{
  "id": "32110693",
  "url": "https://archiveofourown.org/works/32110693?view_full_work=true",
  "author": [
    "Timeflies_Rehersal"
  ],
  "title": "Innit's Cafe",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen",
    "Multi",
    "Other"
  ],
  "fandoms": [
    "Minecraft (Video Game)",
    "Dream SMP"
  ],
  "relationships": [],
  "characters": [
    "TommyInnit (Video Blogging RPF)",
    "Ranboo (Video Blogging RPF)",
    "Toby Smith | Tubbo",
    "Wilbur Soot",
    "Jschlatt (Video Blogging RPF)",
    "Phil Watson (Video Blogging RPF)",
    "Jack Manifold",
    "Niki | Nihachu",
    "Cara | CaptainPuffy",
    "Sam | Awesamdude",
    "Noah Brown",
    "Darryl Noveschosch",
    "Zak Ahmed",
    "Charlie | Slimecicle",
    "Grayson | Purpled (Video Blogging RPF)",
    "Luke | Punz",
    "Antfrost (Video Blogging RPF)",
    "Eret (Video Blogging RPF)",
    "Liam | HBomb94"
  ],
  "additional_tags": [
    "Vigilante TommyInnit (Video Blogging RPF)",
    "Alternate Universe - Coffee Shops & Cafés",
    "Hero Wilbur Soot",
    "Hero Phil Watson (Video Blogging RPF)",
    "Hero Technoblade (Video Blogging RPF)",
    "TommyInnit Needs a Break (Video Blogging RPF)",
    "Touch-Starved TommyInnit (Video Blogging RPF)",
    "TommyInnit is So Done (Video Blogging RPF)",
    "Abandoned Work - Unfinished and Discontinued",
    "Set to be rewritten"
  ],
  "language": "English",
  "series": "",
  "published": "2021-06-22",
  "completed": "2023-06-03",
  "words": "26,949",
  "chapters": "26/26",
  "comments": "809",
  "kudos": "6,534",
  "bookmarks": "829",
  "hits": "145,397",
  "summary": "<p>Cafe Manager by day, Vigilante by night. Tomathy Innit is a 16 year old boy who struggles to juggle between keeping his family's cafe afloat, with said family gone, and his secret life as a vigilante while he takes care of these heroes and villains that keeps passing out at his doorstep.</p>\n<p>Seriously, where are these people coming from?</p>\n<p>I sincerely apologize to you, IncrediblyMai. You wanted evil XD but everyone wanted good XD so according to democracy, we go for Good XD instead.</p>\n<p>It's been a while, hasn't it?</p>",
  "notes": "<p>This is just a brainrot I had from binging Vigilante Tommy fics and rewatching some Undertale playthroughs.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>AN: In everyone else's POV, they would refer to Tommy as an adult because 1)he acts like he's older and more mature as well as the added height he has, still doesn't stop him from causing mischief and 2)he owns his family's fucking cafe. Because really, who would expect an 16 year old to effectively run a cafe?</p>\n<p>Explanation on Tommy's Powers</p>\n<p>Pros: </p>\n<p>-He can create illusions using mist from either his surroundings or released from his own body<br>-The illusions usually can phase through any solid but can solidify if more mist is used<br>-He can either project the illusions to make weapons, obstacles, etc or cover himself in it so that he can disguise himself or just go invisible</p>\n<p>Cons:</p>\n<p>-He needs to actually SEE when he uses the illusions so that he can form what he wants to make<br>-If he were to use the mists extracted from his body for a long period of time, he can risk getting frost bites, or in a more severe case, hypothermia</p>\n<p>Sorry for the late update.</p>\n<p>TW: mentions of a Gun, blood and injury.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">notes</a>.)\n</p>\n<p>Me: *wondering if I should make XD an ally of an antagonist</p>\n<p>Also me: ah fuck it I'll make him a (platonic) simp because that's the best way I can write XD</p>\n<p>Me, when writing this: .......should I add the Egg as another main plot point?</p>\n<p>.....maybe.<br>(Still thinking on this but I'll probably write it soon.)</p>\n<p>A/N: it's my birthday</p>\n<p>Me, looks at the comments: *sees some that say Happy Birthday*<br>Also Me: *confusion but happy anyway</p>\n<p>THANK YOU TO EVERYONE WHO WISHED ME AND I AM SO SORRY I HAVEN'T UPDATED IN A WHILE.</p>\n<p>Exams were killing me.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_18_endnotes\">notes</a>.)\n</p>\n<p>I bet I got y'all good when I mentioned Ranboo brought a child to the banquet, huh?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_20_endnotes\">notes</a>.)\n</p>\n<p>This is my first time writing an actual fighting scene so I apologize if it's not that good.</p>\n<p>TW!!!: Mentions of blood and injuries</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_22_endnotes\">notes</a>.)\n</p>\n<p>Happy Valentines Day, by the way. Lots of Love to you all. &lt;3</p>\n<p>Most Tubbo centric with a bit of a preview on what Dream's powers are.</p>\n<p>A/N: I almost don't wanna post this because of how shit I feel this chapter is. Sorry in advance and please enjoy!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_24_endnotes\">more notes</a>.)\n</p>\n<p>For some reason, I imagine Drista as a college student who's survived on instant noodles, protein bars and fruit bowls but the moment someone cooks a good meal for them, they instantly attached themselves onto said person.</p>",
  "text": "<p>Tomathy Innit, better known as Tommy to the residents of the lower levels of Pogtopia, is having a peaceful morning.</p>\n<p>He started off by a shower and brushed his teeth after forcing himself out of bed before he proceeded to the kitchen to cook some eggs and bacon. He quickly toasted some bread in the toaster before going back to pan and once they were ready, he slid them onto a plate.</p>\n<p>He scrolled through his Twitter feed as he ate the food in comfortable silence, reading whatever was trending at the moment.</p>\n<p>After breakfast and cleaning up after himself, Tommy put on his uniform and left his apartment. The cafe was close so he just needed to walk for about 20 minutes to get there. That is if he doesn't bump into trouble along the way, which would take up an additional 10 or another 20 minutes.</p>\n<p>Seriously, the lower levels of Pogtopia is not a safe place to live with all the thugs and small time criminals running around.</p>\n<p>Anyway, when he arrives at the Cafe, he would start off by baking some pastries as well as making some sandwiches and put them on display after cooling a bit before proceeding to making a quick check in the pantry for drink ingredients like coffee, smoothies and more. He then would begin sweeping around the place a bit.</p>\n<p>The bell rings and the blonde boy turned to look at the newcomer. \"Good morning, Ranboo! How are you?\" He greeted the dual coloured teen as he stepped in with a tired look on his face and hunched posture. \"Tired? I just had some coffee brewed in the back, boob boy. Have a bit then help me with the tables while I sweep.\" Ranboo seemed to perk up a bit, thanking Tommy as he jogged to the breakroom.</p>\n<p>The younger teen just shook his head before placing his broom on a wall and went to one of the racks. He grabbed two sandwiches, placed them on a plate and went to the backroom, where he sees his employee take a large sip of coffee. He quickly placed the sandwiches in front of him and exited the room, ignoring the surprised choke Ranboo let out when he noticed him.</p>\n<p>Tommy lets out a cackle at that.</p>\n<p>___</p>\n<p>At 9.30 am, Innit Cafe is officially open for business. Tommy would man the register and make the drinks while Ranboo would busy himself with taking orders and serving the customers their food and drinks.<br>\nIt was a slow day with only a few customers coming in, mostly regulars.</p>\n<p>He looked up when the bell chimed, seeing a familiar face. \"Eyy, MD! How are ya? Starting shift early?\" He asked as he placed out two mugs of freshly brewed tea for Ranboo to deliver. \"Eyyy Thomas! Yeah, I wanna clock in early today. Got a dinner date with Mamacita later!\" The masked mexican said as he rolled up his sleeves and entered the backroom to clock in for his shift.</p>\n<p>The rest of the day was mostly the same with MD helping out with either the dishes or helping Ranboo serve customers. When evening rolls around and they've finished cleaning, Tommy would close up shop and dismiss his employees with their pay for the week and a bag of pastries that didn't sell during store times.<br>\nHe'd inspect the store one last time before locking up and went on his way home. </p>\n<p>Tommy had helped himself to some churros as he walked, taking in the sight of the city. He sped up his pace home so that he can change into his costume and start his usual patrols around the district.<br>\nRinse and repeat and that was the usual routine Tommy had followed for months.</p>\n<p>Sure it could be a bit boring sometimes (except when he's out patrolling) but hey, at least he's got money for groceries and bills.</p>\n<p>___</p>\n<p>Now, he's just out patrolling on his usual route and stopping crime as much as he can for the past three hours, giving a salute to any passing vigilantes like Ender (who he knows for a fact is Ranboo), Purpled, etc.</p>\n<p>Tommy decided to take a quick break on a rooftop near the Cafe when he saw what seems to be a person, laying face down near the entrance.</p>\n<p>He jumped down and approached the body, quickly checking for a pulse. He felt relief rush through him when he found one. Still, it was a weak one so Tommy had to move fast. He moved the man until he was facing up and once he got a good look of the man, he instantly recognized who was in front of him.<br>\nIt was the Ghost hero, Phantom and he was fucking bleeding from the head.</p>\n<p>So, he lifted the man up from the ground and proceeded to his apartment since 1)calling an ambulance is out of the question because the nearest one is in the upper levels of Pogtopia, which would take a very long time to get here, and 2)he can't call any of his friends since the man didn't carry a cell on him.</p>\n<p>He was also concerningly light when Tommy gave him a piggyback ride.</p>\n<p>Still, he carried the man up till they reached his floor and entered his apartment through the front door, making sure to lock it. Dropping the hero on his couch, Tommy went to bathroom and searched his closet for a first aid kit.</p>\n<p>He walked back to the living room with the item in his hands, grabbed a basin with warm water and a towel. After cleaning and dressing the wound, he left to take a quick shower and a change of clothes. A blanket was draped onto the hero, after making checking if he still has pulse and is still breathing, and Tommy went to bed.</p>\n<p>Such was the unusual routine of Vigilante/Cafe Manager.</p>\n<p>The loud sound of crashing woke Tommy up with a jolt.</p>\n<p>He instantly picked up whatever was next him, which was his baseball bat, and ran out into the living room where he saw a fucking furry arguing with Phantom.</p>\n<p>Before he could even have time to react, a fist had connected to his stomach and a startled yelp rang throughout the chaos.</p>\n<p>That yelp definitely did not come from him since air practically flew out of his lungs, which mostly resulted into a strangled shout coming from him.</p>\n<p>\"CHARLIE. HE'S A FUCKING CIVILIAN!\"</p>\n<p>Tommy looked up to glare at the intruders. Phantom seemed like he was in a mix of confusion, annoyed and tired, then there was the Shapeshifting Hero, Clover, who was holding up the injured hero and the motherfucker that punched him, the Slime Hero, Slimecicle. The tense silence grew as they all just stood there.</p>\n<p>Tommy broke that silence by grabbing his bat again, which fell out of his hands when he was punched in the gut, and started swinging.</p>\n<p>\"Woah! Watch it!\"</p>\n<p>\"Get the fuck out of my house or I will fucking gouge your eyes out of their fucking sockets!\"</p>\n<p>\"Wait a minute-!\"</p>\n<p>\"Your fucking friend is healed now so fucking leave!\"</p>\n<p>He's now forcefully shoving the three heroes out of his apartment, not caring if one of them had accidentally elbowed his face during the struggle or if they fell on their way out before he just slammed the door shut. He let out a tried groan as he looked at the clock, discovering it was in fact 3 am in the morning.</p>\n<p>What the hell?<br>\n___<br>\nRanboo thought Tommy was a good person.</p>\n<p>The older man took him in when he was in a desperate need for a job and the pay was more than enough to cover for the shitty apartment he and Tubbo shared. He had this habit of spoiling him with bags of baked goods, whether to eat during breaks or for him to bring home to his roommate.</p>\n<p>The Cafe itself was really cozy, had homely atmosphere and always kept clean, which completely contrasts all the other shops that surrounds it. They even had some potted flowers and some plants placed all around the place to spruce up the place even more.</p>\n<p>Honestly, he feels lucky to land this job.</p>\n<p>Ranboo also noticed that Tommy was a worrywart, despite what he tries to convince them otherwise.<br>\nHe couldn't blame his boss for that since it's pretty well known that Pogtopia, especially in the poorer districts, weren't exactly the safest to live in. There's always a risk of being attacked if you weren't careful.</p>\n<p>He's constantly looking out for his only two employees as well as some of his regulars. Which just makes it difficult for Ranboo to hide bruises and injuries from doing his vigilante work. The one time he came to work with a sprained wrist, which he covered by wearing a long sleeved shirt, he was dragged to the breakroom and had to sit in silence as his boss inspected his wrist.</p>\n<p>An hour later with a cold pack pressed onto his injury and he finally backed off.</p>\n<p>He can tell that the older blonde was worried for him but he never said anything about it, only continuing the day like it was normal. Except he was shoved into manning the cash register instead while Tommy covered him with MD for the entire week.</p>\n<p>Ranboo swears to be extra careful after that.</p>\n<p>Anyway, Ranboo came to work like usual on Monday and the first thing he noticed when he entered the Cafe was a nasty bruise on Tommy's face. He blinked in surprise and stared at it, ignoring the older man when he told him about the coffee.</p>\n<p>\"Ranboo! Hey, are you listening?\"</p>\n<p>\"What happened to your face?\"</p>\n<p>Tommy just sighed. \"Just fell on my fucking face, big man. It'll be gone sooner or later. Now go get some coffee so that we can start work.\" He grabbed his broom again and continued to sweep dust off the floors.</p>\n<p>Ranboo wanted to ask more but held back, not wanting to accidentally make him mad so he quickly ran off into the break room.<br>\n___<br>\n\"Eyyyy, Thoma- What the fuck happened to your face?\"</p>\n<p>Tommy lifted his head up to look at the masked mexican. \"Oh, hey MD. It's fine. Just a shit morning. I fucking fell on my face.\" He placed a plate of waffles and a cup of coffee into the tray and moved them onto the counter, signalling Ranboo to deliver it.</p>\n<p>\"A... Are you sure? Man, you look like you got into a fight.\" MD said, stepping a it closer to have a better look of the bruise. Tommy just scoffed. \"Oh I was in a fucking fight alright. A fight with gravity. Enough chit chat though, we got a lot of customers today and I don't want boob boy to be alone when we have to deal with a fucking Karen.\"</p>\n<p>He watched as his employer grabbed a mug from a nearby cabinet and started working on the next order.<br>\nMD just silently moved to the breakroom, seeing as Tommy didn't want to talk about it, and clocked in for his shift. Maybe he can ask again later because that sure as hell doesn't look like a bruise you get from falling.<br>\n___<br>\nThe day continued on as normal with the occasional customer asking him where the bruise came from.<br>\nStill, the day was done and dealt with, the entire place had been cleaned and Tommy did a quick inventory check before he locked up, getting ready to go home.</p>\n<p>\"Oh um, Tommy! Do you wanna go to the convenience store with us?\" He looked at the Enderman hybrid with a surprised look on his face. \"Huh?\"</p>\n<p>\"Yeah man! Let's go for a quick Seven Eleven run. We can even buy those slushies you like so much!\"</p>\n<p>Tommy stood there for a second, contemplating on his options. On one hand, he can just decline and go home since he's tired as fuck but on the other hand, slushies and brain freezes. Something he likes very much, especially on stressful days.</p>\n<p>\"Eh, sure. I'll come. Lemme finish locking the cafe.\"</p>\n<p>The trio walked towards the nearest Seven Eleven convenience store and entered in it with Tommy going straight for the slushie machine, Ranboo going off to one of the aisles while MD went to the freezers.</p>\n<p>Thirty minutes later, they met back up at the cash register. Tommy held two slushies in the largest cups they had, Ranboo had a few chip bags on him and MD bought himself one frozen pizza as well as some sodas to share. They paid for their stuff and left, all agreeing to go to the park that was a couple blocks down.</p>\n<p>\"Eyyyy Thomas. I know you love that stuff but calm down a bit or you'll get a brain freeze.\"</p>\n<p>\"Fuck off MD. I fucking need this.\" Tommy continued to slurp the drink as he sat down on the bench. MD just scoffed in return as he sat down next to him. He looked at Ranboo and patted the spot next to him.<br>\n\"C'mon kid, take a seat. Let's snack.\"</p>\n<p>\"Speaking of snacks, what did you get Ranboo?\"</p>\n<p>Ranboo sat down next to MD and runnahed through the contents of his plastic bag. \"I got some Cheetos, Monster Munch and Pringles. Which one do you guys want?\"</p>\n<p>\"Eyyy, gimme the Pringles man.\"</p>\n<p>\"I want the Cheetos.\"</p>\n<p>After getting what they wanted and MD giving a bottle of Pepsi to Ranboo, they fell into conversation while snacking, only stopping for a minute when Tommy gave himself a brain freeze and a quick reassurance that he's fine.</p>\n<p>Tommy had a great evening so far.</p>\n<p>He hung out with Ranboo and MD for a bit before the tallest of the three received a call from his roommate and had to leave. MD stayed with him for a while and they both just talked before they both decided to part ways.</p>\n<p>Deciding to use a shortcut to his apartment, he walked through an alleyway and navigated through it until he reaches an area he recognizes. Throwing both of his empty slushie cups into a dumpster, he continued walking towards the exit, if he didn't hear the soft rustling from said dumpster.</p>\n<p>At first he thought, maybe it was a raccoon. Those adorable, fuzzy bastards would always be around these parts of town, scurrying through the garbage for food. Still, it wouldn't hurt to check, right?</p>\n<p>5 minutes later, he's carrying a fellow vigilante, who he recognizes as Purpled, home.</p>\n<p>He was heavily injured and is losing some blood from the slashes on his body. Tommy sped up his movements, still careful of the person behind him. He practically ran up the stairs and he slammed his door shut when he arrived into his apartment.</p>\n<p>He gently placed the vigilante onto his couch, hoping that the blood wouldn't seep into the pillows, and went off to get the first aid kit again.</p>\n<p>Seriously, it hasn't even been a day since the last one he took in.</p>\n<p>He came back about a few minutes later with a rag and warm water. Tommy opens the kit with a satisfying click and looks into it. \"Note to self, make a list and go to the pharmacy after work to restock on supplies.\" He mumbled to himself as he took out a needle and some thread.</p>\n<p>Some of the slashes were large and they went deep enough to expose flesh so he had to work quickly.<br>\nAfter cleaning blood off some of the bigger wounds, Tommy started to stitch the skin back together.</p>\n<p>___</p>\n<p>\".....Tommy...?\"</p>\n<p>\"Stay down Purp. I just finished stitching you up. Want some painkillers?\"</p>\n<p>Purpled laid back down onto the couch, wincing when he felts jolts of pain run through his body. \"..Yeah. Some cold water too.\"</p>\n<p>Tommy nodded and walked into his kitchen to retrieve what he needed, coming back out shortly after. He placed a glass of iced water and a bottle of pills on the coffee table before he went to sit on the floor.</p>\n<p>\"So, wanna explain why I found you in a fucking dumpster?\"</p>\n<p>Purpled slowly sat up, still wincing at the random jolts of pain that went through his entire body. \"Went to bust a drug ring. One of the fuckers had a tiger mutation and went after me.\"</p>\n<p>\"So you hid in the dumpster because...?\"</p>\n<p>\"Because the fucker couldn't smell me when I hid there. Apparently, garbage overpowers the smell of blood.\"</p>\n<p>He reached for the pills and took about two, reaching out again to grab the glass of water. He popped the pills into his mouth and drank the water, feeling the pills as it slid down his throat. Tommy's face scrunched up in disgust.</p>\n<p>\"Well, you're fucking lucky that none of your wounds were infected from that or else we would've had to risk your identity for a hospital visit.\"</p>\n<p>Purpled gulped the last of the water and set down the glass. \"Yeah, thanks for fixing me up, by the way. I appreciate it.\"</p>\n<p>Tommy just scoffed. \"You better be. I almost had a fucking heart attack when I saw you passed out around a bunch of trash.\"</p>\n<p>The purple colored Vigilante just chuckled in response.</p>\n<p>___</p>\n<p>Purpled decided to stay for the night (after Tommy insisted that he stay so that his injuries can heal) and for breakfast as well so that he can have something decent to eat.</p>\n<p>They both set up the couch with some pillows and a blanket so that he would at least be comfortable sleeping in it.</p>\n<p>They said their goodnights to each other and Tommy went into his bedroom for a shower and a change of clothes before going to bed.</p>\n<p>___</p>\n<p>The next day was relatively calming.</p>\n<p>Tommy woke up about an hour before Purpled. He had just finished showering and had moved on to cooking some pancakes.</p>\n<p>About ten minutes later, Purpled had woken up when he heard the other fall from the couch and possibly had hit the coffee table.</p>\n<p>\"Mind grabbing the plates for me!? You know where they are!\" He yelled into the living room as he flipped a pancake. He can hear the other grumble but still got up and walked into the kitchen to help.</p>\n<p>When the food was finally done, Tommy split the pancakes between them (he placed about an extra three on Purpeld's plate) and gave the vigilante his share, who took it gratefully and went off to eat in the living room. You know since he actually needs to take off his mask to eat and Tommy didn't want to have him expose his identity just because he had to.</p>\n<p>After they were done eating and Tommy had been reassured that his wounds are fine now, Purpled left the apartment.</p>\n<p>____</p>\n<p>Later in the evening, Tommy was out on his usual patrol route again when he stumbled upon Philza fucking Minecraft. Wait, what the fuck? He immediately booked it as fast as he can towards the opposite direction.</p>\n<p>He can hear the hero giving chase as he leapt across buildings. \"Going somewhere, mate?\" The smug bastard appeared next to him in about seconds.<br>\nFuck the man and fuck his ability to fly.</p>\n<p>He growled lowly as he kept running, jumping down into a nearby alleyway and- oh fuck the Blade and Phantom were waiting for him. </p>\n<p>Fuck.</p>\n<p>He was surrounded. At one end, Philza had just landed and blocked one end of the alleyway while the Blade and Phantom blocked the other.</p>\n<p>Okay seriously, when the hell did heroes patrol around these parts?</p>\n<p>\"Tempest.\"</p>\n<p>Tommy snapped his head to attention when the Blade spoke. He took a step back when the pink haired man took a step forward, still being cautious of the other hero that was behind him.</p>\n<p>\"Sorry but we're gonna have to arrest you.\" Phantom took this chance and stepped forward, a pair of cuffs in his hands.</p>\n<p>\"You did good in protecting this district. Unfortunately, there's no longer any need for vigilantes since we're going to be sending heroes to patrol around these parts now.\"</p>\n<p>First thing he's gonna do after escaping these assholes is finding himself an informant because he desperately needs to keep himself updated.</p>\n<p>\"Where the hell is that little shit!?\"</p>\n<p>Just a few minutes ago, Tommy had decked Phantom in the face when he went up to apprehend the vigilante before he parkoured himself back up to the rooftop and cloaked himself in his illusions, or what he likes to call his mists, to turn himself invisible.</p>\n<p>Yup, you read that right. Big Man Tommy is a fucking illusionist and it is Pog as hell.</p>\n<p>First order of business though, he needs to get far away from them so that he can recover for a bit because Holy shit it's only been a few minutes and the drawbacks are starting to kick in. </p>\n<p>He jumped onto a fire escape on the side of one of the taller buildings and ran down it.</p>\n<p>He kept running until he caught sight of the park again. \"That'll do.\" He mumbled to himself as he slowed his pace and walked towards it. He found a bench and plopped himself down onto it. He uncloaked the illusion from his body and started to shiver for a bit, feeling the cold taking affect on him.</p>\n<p>Now, to address the current situation.</p>\n<p>So the main reason that the heroes are here is to arrest the vigilantes? Not because of the increased crime rates? Or the fact villain attacks happen more often in these particular areas? What the actual fuck.</p>\n<p>Clearly, the Government didn't have their priorities straight.</p>\n<p>Tommy groaned when the realization hits him. God, this is just gonna make his patrols even harder, huh? He let himself rest on the bench for a few minutes, contemplating whether or not he should continue the patrol.</p>\n<p>He decided to just go home for now since there was a chance the three heroes were still searching for him and he does not want to see them again after having to deck Phantom in the face.</p>\n<p>Tommy left the park and walked through the alleyways again to get home faster since he wanted to get out of the streets much faster. He did make a quick detour to a nearby pharmacy to buy some medical supplies.</p>\n<p>He entered his apartment about half an hour later with two plastic bags full of medical stuff and maybe some chocolates from a convenience store with the spare cash that he had.</p>\n<p>Tommy placed the items on his coffee table and went to the kitchen to boil some water. As he waited, he looked into one of his cabinets. \"Instant noodles it is then.\"</p>\n<p>As the noodles were cooking, he went to retrieve the first aid kit again and started stocking the items in. He stored the extras in the medicine cabinet in his bathroom. When he closed the cabinet, he took a quick look at the bruise on his face. He grabbed the ointment placed on the side of the sink and applied some onto where the bruise is.</p>\n<p>By the time he was done, the noodles were finished cooking. He ate, washed the dishes and took a shower before going to bed.</p>\n<p>___</p>\n<p>\"Thomas, it's fine! I can still walk.\"</p>\n<p>\"MD, you were limping when you came in. You either let me take a look at it or I'll drag you to the clinic myself.\"</p>\n<p>\"Eyyy.. I-It's fine, mi amigo. No need to go so far.\" MD chuckled nervously at the threat. Tommy just shoved him into the break room. He looked at Ranboo, who stood by the counter when the arguement happened. \"Yo, Ranboo! Mind taking care of the rest of the cleanup?\"</p>\n<p>\"Oh! Yeah, yeah! I can handle it!\"</p>\n<p>\"Thanks big man. Sorry to dump this on you all of the sudden.\" With that, Tommy shut the door behind him.</p>\n<p>Ranboo let out a breath of relief and winced as pain jolted through his body from the broken ribs. Maybe he can sneak a couple of pain killers from one of the cabinets during his break.</p>\n<p>The last thing he wants is for Tommy to freak out over the fact that both of his employees had been injured and close up the cafe early just to take them both to the nearby clinic.<br>\n___<br>\nMD was placed to man the registers and washing the dishes instead of his usual job due to his twisted ankle. Ranboo was doing well on his own with delivering and taking orders.</p>\n<p>Tommy was baking and making drinks like usual but he kept glancing at both MD and Ranboo, each time he looked like he wanted to ask something but held himself back.</p>\n<p>Still, Mexican Dream felt bad since he made the kid worry about him so much even though it was his own fault. Who would've fucking thought he'd run into Clover during one of his patrols?</p>\n<p>\"Oh yeah, I just remembered something. Did you guys hear? Apparently some heroes are going to be patrolling around these parts now.\" Ranboo said as he approached the counter and placed an order into the basket they had.</p>\n<p>Tommy looked surprised at first but then he broke into a smile. \"Really? About damn time! As much as I love our local vigilantes, I fucking hope the heroes are going to get rid of the crime in this shithole. Seriously, it's been quite the fucking problem now.\" Both MD and Ranboo cringed at that, knowing full well that isn't what the heroes are here for.</p>\n<p>Tommy looked so relieved and relaxed after hearing that bit of news.</p>\n<p>He plucked the paper from the basket and went to work on the order. Ranboo went to clean up after some customers after they've left while MD stayed by the cash register as he scrolled through his phone.</p>\n<p>The sound of bell chiming rang though out the cafe and the sound of feet walked towards MD. He looked up and greeted the customer.</p>\n<p>\"Hola! Welcome to Innit's Cafe! How can I help yo-\"</p>\n<p>What the fuck, the Blade and Philza were standing in front of him.</p>\n<p>Philza gave MD a friendly smile but the Blade didn't acknowledge him at all. He was staring at Ranboo.</p>\n<p>\"One espresso with two sugars please. Oh, and a mini apple pie. Both of them are to go.\" He elbowed the Blade, likely signalling him to order for himself, but that didn't stop him from staring at Ranboo, who had noticed by now and looked very uncomfortable.</p>\n<p>\"Eyy, man! Can you NOT stare at mi compañero de trabajo like that? You're acting like a creep!\"</p>\n<p>Tommy stopped brewing the drinks and looked over at the counter. The Blade just started glaring at Ranboo.</p>\n<p>\"You look very familiar.\"</p>\n<p>MD hears Ranboo mutter curses under his breath.</p>\n<p>He was fucked.</p>\n<p>\"You look very familiar.\"</p>\n<p>Oh, Ranboo was so very fucked. </p>\n<p>Tubbo's gonna kill him when he finds out about this. He should've listened when the goat hybrid told him to cover himself up more so that no one would recognize him if he were out in the streets.</p>\n<p>To be fair, he had the same thought as everyone else.</p>\n<p>The residents in the lower levels of Pogtopia believed that the government had completely abandoned them to fend for themselves. It was the prefect example of a dog eat dog world, especially with how many villains were hiding out here.</p>\n<p>There are some exceptions of course. People like Tommy and his landlord, Miss Clementine were kind people even after years of living in this shithole.</p>\n<p>He watched as Philza tried to calm the Blade down but even he started staring at Ranboo at the corner of his eye, which prompted a bit of a hushed conversation between the two. Most likely they were discussing about any connection of him with Ender.</p>\n<p>A tug on his sleeve caught his attention and he turned to look at his boss, who had his customer service face on.</p>\n<p>\"Hey, Ranboo. Mind getting something from the back for a bit? My hands are full right now. Here, this is the list for the shit I need right now.\" He handed Ranboo a piece of paper. He glanced at the heroes while they were preoccupied and leaned in a bit closer. \"Don't worry. I'll handle this.\"</p>\n<p>Before he could say anything, the older man had pushed him into the break room and the door was shut behind him.<br>\n___<br>\n\"You do know you'll get into trouble if you hide a vigilante, right?\"</p>\n<p>Tommy just turned to glare at the Blade, who glared back at him.</p>\n<p>\"Oh is that so? Gosh, I didn't know.\" He said in a mocking tone. \"Now that the distraction is out of the way, are you gonna order or not? Some customers are starting to line up behind you.\"</p>\n<p>True to his words, there were about five customers waiting behind the two heroes, most of them looking very annoyed at the hold up.</p>\n<p>The Blade was about to say something but was stopped by Philza delivering a harsh jab to his gut. It didn't hurt but he did get the message.</p>\n<p>\"A cold latte and a blueberry muffin. Also, to go.\"<br>\n____<br>\nBoth Philza and Techno were, more or less, kicked out of the Cafe, their orders were practically shoved into their hands.</p>\n<p>\"Well, that could've gone better.\"</p>\n<p>Phil just sighed tiredly. \"Techno, why the hell did you do that? I told you, we just came to order food. No interrogations. It's bad enough that the people here doesn't seem to welcome us.\"</p>\n<p>\"Phil, the resemblance was just uncanny. That waiter literally looks so similar to Ender if we ignore that the waiter actually had normal skin color. They were practically one in the same!\"</p>\n<p>\"I know but we can't do anything about it yet. We're not completely sure if that was the same person or not. Remember the Diamond incident?\"</p>\n<p>Techno just took a sip of his drink. \"Oh shit this is good. Also, yes. I do remember that. Seriously, how the fuck did anyone mistaken Skeppy with that guy? What was his name again, Dan?\"</p>\n<p>\"Yeah, Dan TDM.\"</p>\n<p>\"To be fair, the only description given to that intern was that Skeppy had blue hair and that he had diamond shards poking out from his body. They were also pretty similar in height.\" Phil unwrapped his apple pie and took a bite out of it, almost moaning in delight from how good it tasted.</p>\n<p>\"Oh god, this is good. Tech, why'd you have to go and make yourself an enemy to them?\"</p>\n<p>\"Back to topic though, I have a suspicion that kid IS Ender.\"</p>\n<p>\"You sure?\"</p>\n<p>\"Yup, I'm sure.\"</p>\n<p>\"We'll keep an eye out on that Cafe then.\"<br>\n__<br>\nAfter they left, Tommy had to repeatedly reassure Ranboo that it's fine and the whole hero confrontation thing isn't going to affect the business. He made sure the dual colored teen calmed down and sent him back to delivering orders since the other teen mad with very clear that he doesn't want to leave, especially after the whole encounter.<br>\n__<br>\n\"What was that anyway?\" Ranboo flinched at the question but he started to pick up his pace a little.</p>\n<p>He was walking home as MD just started to follow him along the way. MD just stared at him. His expression was unreadable due to the mask he had on his face.</p>\n<p>\"The whole Hero thing. Did you bump into the Blade?\"<br>\nRanboo nodded.</p>\n<p>\"Shit, tipo. Did he get you anywhere? I heard the man was merciless.\" MD walked beside him, still limping a bit from the injured ankle. \"Yeah, he kinda, um, broke a rib or two. Still hurts like hell.\"</p>\n<p>MD made a shocked noise. </p>\n<p>\"And you came in anyways!?\"</p>\n<p>\"Don't act like you didn't come to work with an injury as well, Mr I'm Limping from a Twisted Ankle.\" </p>\n<p>\"Eyy! Clover came outta nowhere, man! I never would've fucking guessed heroes would be coming here!\"</p>\n<p>\"Me too! I thought they'd never poke these areas with a 10 feet long pole!\"</p>\n<p>They both simultaneously groaned in frustration as they began recalling their encounters with the heroes, making sure they were alone when they spoke.</p>\n<p>Eventually they both had quiet down after they got everything off their chest.</p>\n<p>\"So, you're a vigilante?\" MD asked as they crossed the zebra walk. \"Yeah.. You?\"</p>\n<p>\"Yup. I go by Pesadilla. It means Nightmare in Spanish.\"</p>\n<p>\"Oh, okay! I go by Ender!\"</p>\n<p>MD suddenly stopped as he held out his hand. \"What about you and me team up every now and then, ay? Watch each other's backs in case something like this happens again. God knows what Thomas would do when he catches both of us with injuries again.\" Ranboo chuckles at the thought. \"He'd be beyond pissed at that point.\" He reaches out and grasps MD's hand, shaking it slightly.</p>\n<p>\"It'll be a pleasure to work with you then.\"<br>\n___<br>\n\"Are you fucking serious?\"</p>\n<p>\"Heyyy-\"</p>\n<p>Tommy glared at him. \"What the hell are you doing here?\" Hell Flare just smiled at him, nervously. Behind him there were two guys, who Tommy assumed were his friends. A dirty blonde with a porcelain mask on his face and a brunette with a pair of clout glasses.</p>\n<p>They've all looked like they've taken quite the beating from all the bruises and small cuts they had.</p>\n<p>Mask was being held up by Clout Glasses. Tommy tried to see what his injuries were but a majority of his body was covered in the cloak he wore so he couldn't see much.</p>\n<p>\"Hell Flare, I'm already crossing the line by helping you.\"</p>\n<p>\"I know.\"</p>\n<p>\"You're by far the only villain I've knowingly let into my home.\"</p>\n<p>\"I know.\"</p>\n<p>\"And that's only because you're by far the most decent one of all the villains I've ever encountered in my life. Still doesn't quell the urge I have to punt you straight into the sun.\"</p>\n<p>\"Wouldn't be the first time.\"</p>\n<p>\"Then why the hell did you bring your friends here!!?\"</p>\n<p>Hell Flare pressed his hands together. \"Please! Just this once! I promise we will never come here again!\" Muffled laughter came from behind them. \"Never had I thought I'd ever see the day Hell Flare would beg.\" Mask said when he lowered his hand from his mouth.</p>\n<p>\"Shut up! I'm not hearing this from the guy who got his leg shattered!\"</p>\n<p>\"I-\"</p>\n<p>\"Your leg is WHAT!?\"</p>\n<p>Tommy immediately dug his key out of his pocket and unlocked his door. Hell Flare let out a small noise of victory as he ushered Mask and Clout Glasses into the apartment and set them onto the couch.</p>\n<p>Tommy ran to his closet and pulled out the first aid kit, thanking the heavens that he restocked it the other day. He ran back to the trio on his couch. \"Which leg?\" he asked.</p>\n<p>Crouching down, Tommy opened the box and brought out some bandages as Hell Flare moved his friend to show him his injuries.</p>\n<p>With some bandages and a wooden ruler he had, he had successfully wrapped the leg with a homemade splint.</p>\n<p>He looked at the three again, scanning them for their injuries and took out what he needed to treat them from the first aid kit.</p>\n<p>\"So..... does this mean we can stay over?\"</p>\n<p>\"Don't push it.\"</p>\n<p>Tommy liked cooking.</p>\n<p>It helped calm his nerves whenever he feels very stressed or just plainly pissed off. </p>\n<p>Sometimes when he cooks, he'd envision the ingredients he's prepping as the ones who caused him the stress. He imagines what it's like to actually take a life and the satisfaction he would feel when the person below him had finally kicked the bucket.</p>\n<p>\"Umm.. Tommy? I think that onion had been cut enough-\" Tommy glared at Hell Flare as he brought down the knife with a threatening thump.</p>\n<p>\"Shutting up.\"</p>\n<p>He can hear Clout Glasses, or 404, softly snore from his nap on the kitchen table while Mask, or Dream, was playing games on his phone.</p>\n<p>He swears, these three will be the only villain he would willingly help out.</p>\n<p>\"Can you put the chicken and the potatoes in the oven, Flare?\" Tommy said as he dumped the onions into an oiled pan to lightly caramelize them.</p>\n<p>The raven haired man nodded and got to work while Tommy went to check on the broccoli he was steaming.</p>\n<p>He deliberately ignores how Dream watched them work from his game.<br>___<br>\"I think I understand why you wanted to come here, Sapnap.\"</p>\n<p>Dinner had been done and dealt with a while ago. </p>\n<p>Tommy had went to the closet in the hallway and pulled out some pillows as well as blankets for them to sleep with. George made a comment about how well prepared Tommy seemed to be regarding surprise guests despite his reaction earlier, which earned him a pillow chucked into his face.</p>\n<p>For a person, who Dream assumed to be an ex nurse due to his skills, Tommy was a very aggressive person.</p>\n<p>Then again, it might be because they were villains, who Tommy didn't have the heart to turn away after he had seen their injuries.</p>\n<p>\"Yeah? And what's your conclusion?\" Sapnap asked as he got himself comfortable on the floor. George had long fallen asleep, leaving the two to their own. The other blonde had left and went into his bedroom to sleep.</p>\n<p>\"It's cuz of Tommy, right?\"</p>\n<p>\"Mhm.\"</p>\n<p>\"I don't know how to explain this. But he feels safe and warm and shit..\"</p>\n<p>\"Kinda like home, right?\"</p>\n<p>\"I don't like it.\"</p>\n<p>Sapnap looked up at the sofa where his friend was laid on and raised an eyebrow. \"Why's that?\" He asked, curious.</p>\n<p>\"I don't know. I just don't like it.\"</p>\n<p>\"You're just being paranoid, Dream. Tommy's not like that.\"</p>\n<p>\"He can easily rat us out to the police or even the heroes.\" Dream hissed.</p>\n<p>\"But he didn't, right? If he really wanted to rat us out, the government would've been knocking on his door by now with their best heroes to arrest us.\" Sapnap argued.</p>\n<p>Dream just stayed silent as he turned to have his back face Sapnap.</p>\n<p>\"Look, we can leave in the morning if you don't trust him that much, okay?\"</p>\n<p>Dream just hummed in agreement.</p>\n<p>An hour later and they both had fallen asleep.<br>___<br>In the end, they opted to stay for another day or two.</p>\n<p>Mostly cuz George was still recovering from the amount of magic he had to use for their getaway and Sapnap didn't have the strength to carry two people, let alone when they need to run if they get caught.</p>\n<p>Dream refuses to acknowledge how well rested he felt the next morning or the odd warm feeling he felt when Tommy greeted him as he waddled into the kitchen while he made them breakfast.<br>___<br>Tommy was at the door in his usual uniform with some papers in his hand. He turned around and called out to the three guests in his apartment.</p>\n<p>\"I'm going to work! There's some instant noodles in the cupboard and some microwavable food in the fridge! Don't let Flare into the kitchen except to use the microwave! 404, Dream, I'm counting on you for that!\" Tommy hears a soft 'okay!' from 404, who was sitting in the living room.</p>\n<p>\"I caused a fire ONE time! ONCE!\"</p>\n<p>\"That's why I don't fucking trust you with my kitchen!\"</p>\n<p>He can hear Dream wheeze from the couch, which prompted a one sided arguement between him and Flare.</p>\n<p>He left, not wanting to be late for work.<br>___<br>Tommy had called a short meeting before they opened the cafe.</p>\n<p>\"I think it's time we hire someone new. Especially since you two fucks keep getting yourselves hurt for reasons neither of you would fucking tell me.\" He looked at them both with a neutral expression. They both averted their eyes when his gaze landed onto them.</p>\n<p>Of course, he knew they were both vigilantes since he had bumped into them during patrols often enough to connect some dots. Tommy had thought about it long and hard yesterday, especially with Heroes patrolling around the area now.</p>\n<p>Some extra help would be nice and would take a bit off their shoulders.</p>\n<p>\"Maybe about two people since I'm starting up the whole delivery service now. Another waiter and a delivery person.\" He said as he held onto some papers. The words 'Help Wanted At Innit's Cafe. Full Time Positions available: Waiter and Delivery Person.'</p>\n<p>He handed the flyers to Ranboo. \"Scatter them around the area for me, will ya? Me and MD will handle the rest of the cleaning in the meantime.\"</p>\n<p>With that, the meeting was over and they all went to work on their seperate tasks.<br>___<br>It was another slow day with a few regulars coming in to order and fewer of them stayed. Philza came along to order to-go as well with the Blade by his side. A few heroes on duty had popped into the shop for a quick bite to eat before they left to patrol again.</p>\n<p>Anyway, the day was slow and the manager contemplated about closing early when someone came in with the flyers in their hands.</p>\n<p>\"Welcome to Innit's Cafe. How can I help you?\"</p>\n<p>\"Are you still hiring?\" The man asked. Tommy froze in place when he got a proper look at him, recognizing the 3D glasses and especially his voice.</p>\n<p>\"Yeah! Which position you interested in? Waiter or Delivery?\"</p>\n<p>\"Delivery.\"</p>\n<p>\"Do you have a vehicle?\"</p>\n<p>\"Ayup.\"</p>\n<p>Tommy nodded. \"Okay, follow me so we can do a quick interview.\"</p>\n<p>After a few questions and exchanging contact infos, the man, who introduced himself as Jack Manifold, left the cafe with instructions to come the next morning for his first shift.</p>\n<p>He had just hired another fucking vigilante.</p>\n<p>Tommy wonders if he's cursed or something as he closes up shop after giving his employees some treats to bring home.</p>\n<p>Nightmares are a pain to deal with.</p>\n<p>He hates how easily a good dream would turn into the most terrifying of nightmares with just a single push. It would just escalate more and more until he wake up, sweating and panting while his heart beats against his ribcage. </p>\n<p>Each time he wakes up from one, it would haunt him for weeks to the point where he couldn't sleep, which in turn just makes him feel like absolute shit from the lack of sleep and even got him sick on some occasions.</p>\n<p>It didn't help that his illusions would be affected by the nightmares and sometimes when he wakes up, he'd come face to face with his illusions taking shape of his terrors and the feeling of frost biting into his skin from the mists wafting off from him, sometimes enough to form a thin layer of ice on his skin. It scared him to no end when that happened.</p>\n<p>He hates them because he has no clue on how to handle them.<br>\n___<br>\nTommy's eyes snapped open as he jolted up from his bed.</p>\n<p>His hand clutched his heart as he swallowed in a sob and attempted to steady his breathing. The faint sounds of paws padded in his room as he felt the beginings of frostbite crawling up his arm.</p>\n<p>Shit. His illusions were acting up again.</p>\n<p>He does his best to ignore it. \"C'mon, c'mon. Snap out of it. It isn't real. None of them are real.\" He whispers to himself as he felt his bed slightly dip.</p>\n<p>\"T̶̞͙͙͐̇͋͜͝o̵̳̬̰̹̬̥͛͑͒̏̅m̴̯̭͈̹̓m̶̡̲̺̟̩̭̎͂̓̃y̷̩̞̌͑̾̃?̷̟̞̠͂͑͊́̌ͅ\"</p>\n<p>Tommy shut his eyes and continued to steady his breathing. \"It isn't real. It isn't real. It isn't real. It isn't real.\" He repeatedly said to himself. His body jolts when he felt a paw rest on his leg, claws digging into his flesh.</p>\n<p>\" Ḯ̵͖͖͎͍̾͂͠͝ ̶̬̘̬̣ͅk̸͎̺̦͈͖̳̔̄͆͛̂n̷͈͈͍̰̊o̸͎̗͑̇̂̇͋w̵̧̗̹̲̞͐̆͝͝ ̸͙̹̪̭̈́̔ỹ̸̖ő̸̹͔̤̄̑͆ȗ̵̧͇͈̽̂ ̶̬͒̉ç̸͉̉̾̓̎̈́a̶̧̍̑n̶͇̈́͊̑ ̵̨̟̫̳̊͗͑̉͘͜h̵̝̫͛̽̇̔̽̕͜e̵̡͈̹͖̳̳͑͆̒͛̎a̶̩̰̖̒͋̐r̴̠̓ ̷̹̯̭̖̜̞͘̕m̸̳̫͍̊̃̎͐e̴̟̥͇̔͆͐.̶̙̭̈́̾̓\"</p>\n<p>His hands raised and covered his eyes as he felt tears prick at the corners of his eyes. \"You're not real. You're not real. You're not real. Please leave me alone already.\" He can practically feel it's gaze pierce into him and tilt it's head in mock confusion.</p>\n<p>\"Ȉ̴̛͍̕̚͜ẗ̴̙̥̘̦̬̼̽ ̴̞̰̾͜w̶̢͓̺̙̄̒̄a̸̡̻̞̻̯̜̎͊͘s̸̪̹͍̦̋̆ͅ ̵̛̏͛̾ͅy̵̮̼̺̩̓̉̅o̸̦͒̈́͋u̶̮͇͍̓̋r̷͚̟̗͙͍̎̋͊ͅͅo̵̝̜͎͓̫̗͔̿͊w̷̩̤̰̥͚̭͆̎́̽̊͐̚n̶̻͇̦̺̠̟͗̆͋͂̾͝ ̴̢͓̯̲͛̓̈́͠f̸͈̍̓͌̕ā̷͍͕̀͊͊u̵̝͂l̷̢͕̫̐t̵̹͈͓̖͓̻̅͌̓̃,̸͍̱̽̂͐̿͠ ̴̢̼̳̪͚͔̔̐̐̔̍y̶̳̣̤͈̅̓ô̷̪̤̍̕ͅu̷̱̘͓͓̲̰̍̽͌͑ ̷̺̩̘̖͐͝ͅk̵̟̫͐̽̓n̵̬̦͔͒̈́̓o̸̢̧̱̥̅͠w̷̭̻̞̝̤̓̃͗ͅ?̷͈̦̳̖̤͑͂̓̎\"</p>\n<p>He was just crying at this point as he felt the thing drag one of it's paw down, leaving behind deep claw marks on his leg. \"I'm sorry. I'm sorry. Please forgive me. Please, please, please.\" It raised it's paw from his leg and it softly caressed his head, causing him to shiver violently as the cold begins to seep through his body.</p>\n<p>\"Ȋ̸̡̼́̈́͜͝ ̶̨̤͖̗͚̈́̎̅̏̇ͅẇ̸͇̦̖̯̰̱̰́͒̏̒̄̌͝i̵̩̮͕̰̎̍͌̅̃̄̏̚l̴̳̳̙̬̰̞͑͠l̶̡̲̎̓͝ ̵͍̉̉̎̀̓͗̅͠n̸̠̦̓́̀̑è̵̮̥̥͋͊̌̚v̴̹̲̙̹͚̔e̸͚͖̣̋̒͊͛̑̚͜͝r̵̢̛̠̘̺̦̰̤̅̑̇̌͜ ̸̮̄͂̈́͝l̷̛̳̯̼͉̆̒̽́̚̚e̸̻̗͗͊̅͐͘ͅa̷̗͖̝̻͕̦̲̓v̶͉̾̆̏̇̎͗ě̷̡̻͝ͅ ̶͕͙͋͆͒͗̀͐ͅy̸̛̯̥͂̈͑̔̾̍̚ơ̴̡̨̙̝͍̖̦̒̑ụ̵̧̣͖̰̥̖͊͋́̿̾̎͜.̴̻̱͎̊̈́͛̎̉̓͊̚\"</p>\n<p>Tommy passed out after that.<br>\n___<br>\nThe next morning, Tommy had woken up early and filled the tub with hot water, wanting to soak in it to get rid of the ice that clung onto his skin. </p>\n<p>He dressed the wound on his leg, took some painkillers, drank some coffee while it's still scalding hot (he's just built different like that) and left for work after cooking breakfast for himself and the Dream Team, who was still asleep at the time.<br>\n___<br>\nThe cafe was a bit more lively that morning.</p>\n<p>Ever since the heroes had begun their patrols in the lower Pogtopia districts and had been making rounds to his Cafe, a lot more people had starting coming in. That itself was good for both business and as a distraction for Tommy, especially from last night's... situation.</p>\n<p>Of course, both MD and Ranboo came in with injuries, which caused Tommy to shove them into the break room to get them fixed up while Jack arrived in a very exhausted state and a few cuts.</p>\n<p>All of which most likely from patrolling alongside heroes who're out for their heads.</p>\n<p>Tommy subtly glared at a hero, Awesamdude, or Sam as the man insisted he call him, as he walked out with some chamomile tea latte and some sandwiches (as well as a couple of breakfast muffins he slipped into the bag when the man mentioned about how he forgot to eat breakfast as he paid for his purchases) and a promise that he'd come back later after patrol.</p>\n<p>He just rolled his eyes at that and went back to work.</p>\n<p>The bell rang again and he hears as footsteps went straight for the register. \"Excuse me?\"</p>\n<p>Tommy looked up from the drink he was making and wiped his hands. \"Oh sorry about that. Welcome to Innit's Cafe, how can I-\" He froze in place as his eyes widened slightly as his eyes landed on the person in front of him.</p>\n<p>No fucking way.</p>\n<p>There's no fucking way.</p>\n<p>Standing in front of him with a pleasant smile on her face and the fucking flyer in her hands was none other than the most infamous villain from within the walls of L'Manburg: The Bloody Tyrant.</p>\n<p>\"I'd like to apply for a position here if it's still available.\"</p>\n<p>Eret had been out the entire day, looking for a job.</p>\n<p>Sure, being a villain did pay a lot but most jobs are far in between and even then each one is a gamble whether it would rake in some profit or not. Especially when heroes had begun spreading out into Pogtopia, both the higher and the lower levels of the city, and Logstedshire for the past two weeks or so.</p>\n<p>It's safe to say the chances of those heists being a success went from 50/50 to 10/90.</p>\n<p>They needed income from a stable source and what better way than to search for a full time job? He can lay down his title as a tyrant until the whole thing blows over. </p>\n<p>Eret knows for a fact that the heroes aren't here because of the high crime rates. They're here to capture all the vigilantes that patrol here since the people had begun supporting vigilantes. Well, some of them are here due to the crime rates but that's just a handful of them compared to the mass majority who came here for vigilante hunting.</p>\n<p>Still they felt bad for the vigilantes since most of them are just kids who want to protect their neighbourhoods and it's not like they're doing anything wrong, despite the occasional stealing they do.</p>\n<p>Then again, they were often desperate for money when they resort to that.</p>\n<p>Anyway, back to the topic at hand.</p>\n<p>Eret had been wandering around the shopping district of Pogtopia when he saw the flyer. They took a closer look and after a few minutes of debating, she decided to try and apply.</p>\n<p>Working in a cafe does sound like a very pleasant experience after all.<br>___<br>Fuck. Oh fuck. Oh no no no.</p>\n<p>Why the fuck is a villain here!?</p>\n<p>As he mentally freaked out about why L'Manburg's most notorious villain is applying for a job at a cafe of all places, Tommy's body went autopilot as he lead the person to his office to start the interview.</p>\n<p>Thank God he was good at multitasking or else this would've been difficult to deal with.</p>\n<p>Tommy asked questions such as their name (which is Eret), age, any skillsets he should take note of, why they want the job, etc. At the end, he is horrified that the supervillain had passed the interview and had ordered him to come tomorrow for start his training as a waiter for the cafe. Literally, he could not find anything from the entire process that can justify him to not hire the person in front of him.</p>\n<p>They exchanged numbers and said their good-byes as Eret left the cafe with a skip in her step.</p>\n<p>Tommy promptly collapsed on his desk after the door closed and silently sobbed. God it's like his cafe is just attracting law breakers and enforcers alike and it's starting to wear him out.<br>___<br>Jack is pretty sure one of L'Manburg's villains had just been hired into the cafe.</p>\n<p>The cafe had closed early that day since Tommy wasn't feeling too well and he was dismissed with a bag of chocolate oatmeal cookies in his hand.</p>\n<p>So here he was, walking to the bus station. Suddenly, his phone went off and he plucked it out of his pocket, looking at the contact name. He smiled and swiped to accept the call. \"Hey, Niki. How are you?\"</p>\n<p>\"Hi, Jack! How was your first day?\"</p>\n<p>\"It was pretty good. The boss taught me the basics on what to do and had me do a couple of deliveries. How are you?\"</p>\n<p>He hears her sigh from the other line.</p>\n<p>\"Stressful.\"</p>\n<p>\"What's up?\"</p>\n<p>He takes a seat on one of the benches in the bus station and placed the bag on his lap.</p>\n<p>\"Just the higher ups being a pain in the ass like usual. You know how they are.\"</p>\n<p>\"You sure that's it? Sounds like there's more going on.\"</p>\n<p>\"Yeah, well...\"</p>\n<p>He took a cookie out from the bag and popped it into his mouth. \"Oh shit, this is good.\" He mumbled to himself as he chewed. He should really bring Niki and Minx to the cafe if he can since most of the stuff they serve is right up their alley.</p>\n<p>\"Niki?\"</p>\n<p>\"Nah, it's fine. I don't wanna talk about it. Let's talk about your new job though. Where do you work? You've only ever told me that you work in a cafe.\"</p>\n<p>\"Innit's Cafe. It a walk away near Minx's favourite book store.\"</p>\n<p>\"Oh wait! I know that place! Most of my coworkers go there before patrols! Is the food as good as they say? Are the drinks good? Sam keeps telling me how delicious the stuff he bought are.\" She said with an excited tone.</p>\n<p>\"Can confirm. These cookies are fucking amazing.\"</p>\n<p>\"You have cookies with you!?\"</p>\n<p>\"Free of charge, of course.\"</p>\n<p>\"Well, I'll be sent to patrol there next week! Maybe I'll stop by.\"</p>\n<p>Jack smiled to himself. \"Feel free to come by, Niki.\"<br>_______<br>\"You guys are leaving?\" Tommy asked as he changed Dream's bandages.</p>\n<p>\"Yeah, 404 is all good now so he can teleport us back to base. We don't want to overstay our welcome.\" Flare said while he got up from the couch he sat in. When Tommy had finished, Flare took Dream's arm and hoisted him up.</p>\n<p>404 had stepped out of the bathroom as he walked up to his friends. Tommy stood up from where he kneeled on the floor. He watched as they talked to each other before they were escorted to the door.</p>\n<p>\"Well, this is goodbye then.\"</p>\n<p>Tommy rolled his eyes. \"Primes, you're making it sound like this is the last time we see each other again. I know you'll come back. You always do.\" Flare gave a toothy grin.</p>\n<p>\"See you soon then, Tommy!\"</p>\n<p>\"Bring anymore friends of yours and I swear I will murder you this time!\"</p>\n<p>\"No promises!\"</p>\n<p>With a flick of 404's wrist, the Dream Team had disappeared into thin air but now without a quick 'goodbye!' from Flare.</p>\n<p>He closed the door and went to his room to change into his vigilante outfit.</p>\n<p>He was going out to patrol tonight.</p>\n<p>Tommy was in the middle of patrol when he remembered that he needed groceries. He hadn't restocked in a bit and his pantry was almost gone in the few days when the Dream Team stayed over.</p>\n<p>About three hours into his patrol and an entire once-over on every nook and cranny in his district, he decided to end it, seeing as the streets was free of crime. Probably in hiding since the news of heroes patrolling had spread throughout the entire place so it's a quiet night.</p>\n<p>He covered his clothes in an illusion and entered a 24 hour supermarket, making a mental list on what he needs as he went to grab a shopping cart.</p>\n<p>Navigating through the isles, Tommy examined the different products and grabbed the ones he needed before placing them into his cart. His mind started to drift a bit as he thought back on the past few days.</p>\n<p>It had been.... Eventful to say the least.</p>\n<p>The good thing was that sales had been going up with the heroes coming in before and after their patrols and with that came waves of people visiting the cafe for a chance to see their idols in person. Maybe even bother them for a picture or two. You know, typical things fans would do.</p>\n<p>Some people even DM'ed him on Twitter through the official website to make reservations where he had to tell, or in some cases, remind them that his cafe doesn't do reservations.</p>\n<p>He should probably consider expanding the cafe.</p>\n<p>Then there comes the downside which is the heroes themselves. Tommy knows that some of them had been keeping tabs on his cafe, especially on his employees after the Blade had singled Ranboo out as Ender.</p>\n<p>He swears when he say he had caught Clover tail him once and chased him away via throwing rocks at him and a lot of yelling.</p>\n<p>It's probably going to get even worse once Eret starts working there. He can already feel a headache growing from the thought alone.</p>\n<p>Maybe he should contact Drista soon to have her update him on the HQ's future plans.</p>\n<p>Tommy pushes the cart to the self check out, scanned his items, paid for them and left, carefully balancing his purchases in his arms as he walked home.<br>\n____<br>\nOf course something would go wrong.</p>\n<p>Something would always go wrong for Tommy when he's out of his apartment. He starts to wonder what crime he had done in his past life that was so bad that he has to repeatedly suffer in his current one.</p>\n<p>Anyways.</p>\n<p>Tommy had been walking home, minding his damn business when this motherfucker pulls up to him with a gun and demands Tommy for his valuables.</p>\n<p>One thing lead to another and the guy was now on the ground with Sonic apprehending him.</p>\n<p>Yes, this dumbass with a Sonic the Hedgehog hoodie as part of his costume actually went with Sonic as his vigilante name.</p>\n<p>They both talked for a bit while Tommy called for the police to take the mugger away. Sonic had warned him about sightings of the infamous villains like the Bloody Tyrant was lurking around and told him to be careful when walking alone.</p>\n<p>If only he knew.</p>\n<p>It went downhill from there when Philza walked around the corner and spotted Sonic talking to Tommy to which he, which is completely unneeded in Tommy's honest opinion, decided to intervene.</p>\n<p>Now, he's struggling to keep the mugger down, who had been deadset on escaping when the hero and vigilante was distracted. Meanwhile, Sonic was trying his best to fight back the Winged Hero, who was determined to capture the vigilante.</p>\n<p>He tried to escape via using his powers which are just bursts of speed that lasts up to 5 minutes but was stopped each time so now he's stuck trying to fight the hero.</p>\n<p>Tommy wasn't faring any better when the mugger started fighting him when he noticed how occupied the other two were. \"Stay down, asshole!\" Tommy growled as he dropped his groceries to the side so that he can fully focus on keeping the mugger's arms behind his back. \"You fucking wish!\" The mugger suddenly turned his body, which made Tommy yelp in surprise and fall to the ground.</p>\n<p>The fucker tried to make a break for it while he was down but Tommy was quicker and tackled the man to the ground.</p>\n<p>\"Guys! I need some fucking help!\"</p>\n<p>No one replied, seeing as they're too busy kicking each other's asses.</p>\n<p>What the fuck?</p>\n<p>He craned his head and looked around for any signs of the police, his hold on the mugger never faltered. There wasn't a single sign that the police were anywhere near.</p>\n<p>Where the hell were they!?</p>\n<p>While Tommy was distracted, the mugger managed to get his footing and threw him off his back, scrambling to grab something.</p>\n<p>Tommy got up, preparing to tackle the bastard again.</p>\n<p>The sound of a gunshot rang through the air and he feels pain in his abdomen.<br>\n____<br>\nConnor had been doing well so far, surprisingly.</p>\n<p>He was currently fighting off Philza Minecraft, who was trying to arrest him, after helping out Tommy, who had helped him out with his injuries in the past when he started out, from getting robbed.</p>\n<p>He dodged when the winged man threw a punch his way and scrambled to put a distance between them.<br>\nAt the corner of his eye, he can see Tommy trying to keep the guy down. He was holding out really well on his own.</p>\n<p>\"Dude, can we like not do this? A civilian is literally hold down a mugger while we're fighting.\" Connor said, trying to get the hero to stop fighting him. Instead he just gave a sigh.</p>\n<p>\"Sorry mate. These are orders from HQ.\"</p>\n<p>\"Yeah but can we please focus on the mugger first? While I'm sure Tommy can handle himself, I don't think-\"</p>\n<p>A gunshot rang through the air and a loud thump was heard, stopping the hero and the vigilante in their tracks. They whipped their heads to where the sounds came from.</p>\n<p>The mugger was running away while Tommy was on the ground with blood spilling from his stomach.</p>\n<p>\"Tommy!\" Connor screamed, running to where the blonde laid. He held the boy's head up and used his hand to press down on the wounds, hoping to stop the blood flow. He can feel the wind when Philza finally processed what had happened and rushed to help. He looked up and glared at the winged man.</p>\n<p>\"What the hell are you still doing here!? Go catch that motherfucker! I can handle this!\"</p>\n<p>Philza hesitated for a bit before he nodded and flew off to the direction where the mugger went.</p>\n<p>Connor looked back down at Tommy, noticing how pale he looked. \"No no no. Tommy c'mon, you have to stay awake. Tommy!\"</p>\n<p>Tommy just gave a soft groan in response.</p>\n<p>He searched his pockets and pulled out his phone, frantically calling for an ambulance.</p>\n<p>\"He was shot. You have to hurry! He's losing so much blood!\"</p>\n<p>\"Sir, please calm down. Where are you right now?\"</p>\n<p>\"District 12 in the lower levels of Pogtopia.\"</p>\n<p>\"We've dispatched an ambulance and they're on their way. Try and keep the victim awake until then.\"</p>\n<p>Connor looked down at Tommy, who's eyes were now shut and his body became limp.</p>\n<p>\"C'mon Tommy. You have to stay awake. Please? The ambulance are on their way.\"</p>\n<p>Tommy gave no response.</p>\n<p>Ranboo had been patrolling that night when he heard the ambulance sirens.</p>\n<p>He rushed to see what was happening and felt his heart drop at the sight. An injured Tommy was being placed on a stretcher and carried into the ambulance while a panicked Sonic was talking to one of the nurses, blood staining one of his hands with some on his knees and lap.</p>\n<p>When the ambulance drove away, Ranboo jumped down, practically scaring the other vigilante. The dual colored teen marched up to him.</p>\n<p>\"What happened?\"</p>\n<p>\"A fucking mugger shot him.\" Sonic growled out once the panic had died down. Ranboo scrunched his brow together. \"Where did he-?\"</p>\n<p>\"Philza is chasing him right now. Pretty sure the guy caught him already.\"</p>\n<p>Ranboo raised an eyebrow. \"Philza?\"</p>\n<p>Sonic nodded as he wiped off the blood from his hands to his shirt. \"Yup. Philza. Me and Tommy bumped into him earlier. Asshole tried to apprehend me.\"</p>\n<p>\"....Sonic, was he the reason why the mugger got away?\"</p>\n<p>\".....yes.\"</p>\n<p>\".......what in the actual fuck.\"<br>____<br>When MD received news of Tommy being hospitalized from Ranboo the next day, you best believe he was this close to just running to where the Hero HQ is in L'Manburg City to find that winged bastard and just beat the shit out of him. Ranboo had managed to stop him and told him that it wouldn't be worth it.</p>\n<p>....he's still gonna punch that bastard the moment he sees him.</p>\n<p>He pulled out his phone and texted to Jack and Eret that the cafe would be closed for a while, which made them ask what had happened. He told them what they needed to know: Tommy had been shot in the stomach by a mugger and is now in the hospital.</p>\n<p>He also added the fact that Philza Minecraft had been there but failed to capture the criminal when he was too busy with apprehending Sonic. Mostly to drag the hero's name through the mud a bit.</p>\n<p>He heard Ranboo clear his throat. MD smiled sheepishly as he put away his phone.</p>\n<p>\"So... What now?\" The teen asked, crossing his arms. They were both standing in front of the cafe, really unsure of what to do.</p>\n<p>MD looked up at Ranboo with a grin. \"Maybe we can-\"</p>\n<p>\"We are not storming the Hero HQ to beat Philza Minecraft. We would be thrown in jail for that and I doubt we can even touch the man once we manage to get in there.\" MD just pouted in response.</p>\n<p>\"However, I'm not opposed to getting him canceled by the media.\" MD brightened at that. \"We can start beef on him but only on Twitter.\" Ranboo continued as they both started to walk to the park.</p>\n<p>The walk was filled with chatter as the two schemed.<br>____<br>Turns out they didn't need to scheme much because Tubbo had already done it for them.</p>\n<p>Ranboo had completely forgot that Tubbo had cameras planted around the entirety of Pogtopia. Granted, not all of them work but a handful of them are still working despite it's conditions.</p>\n<p>Coincidentally, the ones where the whole incident happened was the few that still worked.</p>\n<p>So being the spiteful goat that he is, he posted the footage of Philza failing to apprehending a vigilante, allowing a mugger to run off and getting a civilian shot under his watch with an anonymous account.</p>\n<p>The media was having a field day with this newly acquired information.</p>\n<p>It trended on Twitter and bunch of other social media. Tags like 'Philza Minecraft', 'Hero HQ', 'Hero Drama' and more were on top of the trending list for over three weeks.</p>\n<p>MD thanked Tubbo for his assistance.<br>_____<br>Techno winced when he saw what was going on in Twitter.</p>\n<p>From what he can gather, someone had posted a video of Phil and Sonic's fight as well as the part when Tommy had gotten shot by a mugger in front of them. Innit Cafe regulars as well as civilians in Pogtopia went feral over that footage.</p>\n<p>Apparently, the kid was well liked by the people there and some even adore him enough to press charges against the Hero HQ for him. (It got worst when a business man like Schlatt was involved.) He chucked his phone onto the sofa as he went to the kitchen for a snack.</p>\n<p>It was very messy situation.</p>\n<p>So HQ tried to cover up as much as they can and asked Philza to take a few days off until the whole thing blows over.</p>\n<p>Phil was taking it really hard, especially with the media breathing down his neck. He felt extremely guilty over what had happened and in the midst of the chaos, he almost gave a letter of resignation to HQ.</p>\n<p>Of course the ones who ran the government couldn't afford to lose such a powerful and useful asset like Philza so they took advantage of his distress and pressured him to stay instead. Constantly emphasizing how his resignation wouldn't be a good thing for everyone and how it would make it look like he's running away from the problems he had caused.</p>\n<p>Of course, they didn't say it like that but he liked to think that's basically what they meant from the expression Phil had.</p>\n<p>If it weren't for the law, Techno would've murdered them all in a heartbeat.<br>____<br>\"For the last time, you don't need to pay for my medical bills. I can handle it on my own.\"</p>\n<p>\"Nah, I already paid for it.\"</p>\n<p>\"Wha-!?\"</p>\n<p>\"Don't worry I intend on having you pay it back anyway, kid.\"</p>\n<p>\"Still I could've handled it myself.\"</p>\n<p>\"You only have enough to pay for that apartment of yours and for your cafe. You have no insurance and from what I can see, the medical bill is much too high for your paycheck. You seriously lucked out.\"</p>\n<p>\"Yeah, no kidding.\"</p>\n<p>\"I'll drop by the Cafe soon and we'll discuss what I want in return for this.\"</p>\n<p>Tommy rolled his eyes as he sat up on his bed. He reached out to the table next to him and grabbed the glass of water that sat there.</p>\n<p>\"How long have I been out anyway?\"</p>\n<p>Schlatt didn't look up from where he sat as he continued to scroll on his phone.</p>\n<p>\"About ten weeks.\"</p>\n<p>Tommy choked on the gulp of water he took. He coughed for a bit, which made the ram hybrid look up and quickly moved to pat his back.</p>\n<p>\"Where the fuck did that bitch even hit me? How the fuck was I out for that long?\"</p>\n<p>He pulled up his shirt and inspected the stitches left behind from the surgery.</p>\n<p>\"Blood loss. Maybe exhaustion. The list can go on but that was from the top of my head.\"</p>\n<p>Schlatt just shrugged before going back to his seat as he picked his phone back up again.</p>\n<p>\"From what I heard, you lost a lot of blood.\"</p>\n<p>Tommy just laid back down onto the bed, feeling exhausted.</p>\n<p>\"Oh look. Philza's getting cancelled on Twitter again.\"</p>\n<p>\"What the hell happened while I was out?\"</p>\n<p>From what he can gather from Schlatt, there had been a scuffle between Pogtopia and the Hero HQ when a clip of him being shot was spread. People were pissed at Philza Minecraft for letting a civilian get shot. </p>\n<p>There were also some mentions on how vigilantes getting caught had increased the amount of crime in Pogtopia but the Hero HQ still kept their bullshit about how vigilantes are outlaws and what they're doing is illegal. Some of the heroes tried speaking up about it but were effectively silenced.</p>\n<p>He had contacted Drista earlier and according to her, she had been digging around and found out that apparently the reason why the government was so eager to crank down the number of vigilante activity is because people would put less faith in heroes, to an extent the government as well, and rely on vigilantes more, possibly causing a revolution to spark within the district.</p>\n<p>He had also found out that there had been an increase in arson cases near the HQ for the past few weeks as well as a lot of planned attacks on heroes.</p>\n<p>He was willing to bet that it was Hell Flare causing havoc again. The man had been very protective of him what he had noticed. He wasn't sure who's responsible on the attacks though.</p>\n<p>Anyway, it had been three days since he was discharged from the hospital with Schlatt driving him home.</p>\n<p>The man had insisted that he was driven home since he had just been released.</p>\n<p>\"Tommy!\"</p>\n<p>Tommy looked at the teen, who had ran all the way to the cafe judging by how heavy he was breathing.</p>\n<p>\"Oh Ranboo, how are-?\"</p>\n<p>\"What the hell are you doing here!?\"</p>\n<p>Tommy just gave a confused look at the dual coloured teen. \"Uh, I own the place? Why else would I be here?\" Ranboo just shook his head with a soft groan.</p>\n<p>\"No, I mean why are you here? Shouldn't you be at home? Didn't you just get released like a few days ago?\" Ranboo said again, punctuating the 'just get released' part.</p>\n<p>Tommy just shrugged. \"Eh, I was bored just sitting at home. Plus, the cafe haven't been open in a long while so why not?\"</p>\n<p>Ranboo just gave an exasperated groan. \"Yeah but-\"</p>\n<p>\"Speaking of which, do you mind working the front for a bit? I have to check the back.\"</p>\n<p>\"Sure, but-\"<br>\"Thanks! Oh and there's some tea in the breakroom if you want some. I couldn't make any coffee today, sorry.\"</p>\n<p>\"Oh that fine but-\"</p>\n<p>\"'kay! See ya in a bit!\"</p>\n<p>\"Let me talk, goddammit!\"</p>\n<p>But Tommy had already left out the door to the cafe's pantry.</p>\n<p>Ranboo sighed but clocked in a shift. He scrolled through his phone when MD rushed in, looking as disheveled as he was. The older man had opened his mouth to say something but Ranboo beat him to it by pointing at the door to the pantry.</p>\n<p>He nodded and made his way there, which caused an arguement to ensue.<br>____<br>\"MD, please I'm more than fine.\"</p>\n<p>\"For fuck sake Thomas, you literally just got released two to three days ago. What the fuck made you think this is a good idea!? You need rest, man!\"</p>\n<p>Tommy just huffed in reply. MD raised his hand and ran it through his hair in frustration.</p>\n<p>\"I was stuck at home way too long, MD. Big men like me need to get out more.\"</p>\n<p>\"Yeah, but-!\"</p>\n<p>The masked man just let out a groan of frustration while Tommy resumed in shuffling through some of the food items on the shelves, checking each one for expiration.</p>\n<p>\"Can you at least just let me and Ranboo do most of the heavy lifting for the day? If you're so fucking insistent on opening today, at least me, Ranboo, Jack and hell, even Eret help you!\"</p>\n<p>Tommy glanced at MD, who had a look of exhaustion on his face. </p>\n<p>\"Mi amigo, please.\" MD tried again with a pleading look on his face.</p>\n<p>\".....\" Tommy sighed in defeat. \"Fine.\"</p>\n<p>MD just gave a smile of relief at him.<br>_____<br>The rest of the shift continued on semi normally.<br>Tommy had Eret helping him with the drinks and food while MD and Ranboo handled orders and their other respective jobs. Jack was placed by the cashier and handled customers.</p>\n<p>The entire time, everyone kept an eye on Tommy as he worked, always asking if he's fine and would take over if he showed even the slightest sign of exhaustion.</p>\n<p>Some reporters had appeared earlier that day and they would crowd by the counter to ask him about what happened that night he had gotten shot. Tommy had denied them any commentry but the reporters had insisted to the point where Jack had to push them back a few times.</p>\n<p>After the third time this happens, Ranboo had snapped and kicked them all out, saying that Tommy didn't need to deal with this type of bullshit right now.</p>\n<p>Tommy had tried to reassure Ranboo that he was fine and that he could've handled them, which made the dual colored teen argue that he looked really uncomfortable with how much they were invading his space and the questions that they asked him. </p>\n<p>At the end, Tommy just ruffled his hair, thanked him for helping out and continued the day.<br>____<br>Tommy was walking back to his apartment after repeatedly reassuring Ranboo and MD again that he could walk home alone before giving them their pay that he had missed out the past few weeks when he was in the hospital.</p>\n<p>At least they relaxed a little when they made him promise to call them if anything went wrong or if he needed help. He nodded, hopefully enough to calm them down.</p>\n<p>Tommy had just arrived at his door when he felt himself get knocked over and the wind punched out of him.</p>\n<p>\"Gah!\"</p>\n<p>\"Tommy!\"</p>\n<p>He glared down at the dark haired man as he continued to squeeze the life out of him in a hug. Tommy punched his shoulder.</p>\n<p>\"Get off me asshole, I can't breathe!\"</p>\n<p>\"Oh, right! Sorry!\" Hell Flare scrambled back as Tommy got up. He took some deep breathes to stabilize his breathing before he turned to look at the villain again.</p>\n<p>\"What are you doing here anyway?\" He asked as he searched his pockets for his keys.<br>\"Well, I heard what happened so I kind of got worried and wanted to see you!\"</p>\n<p>\"Worried enough to cause multiple cases of arson for the past few weeks?\"</p>\n<p>\"Yeah, especially when you keep dragging me and Punz into your bullshit.\" Both villain and vigilante turned to look at the new voice. There stood Purpled in all his purple glory, glaring at Hell Flare.</p>\n<p>Asshole had the gall to look sheepish. Tommy unlocked his front door and pushed the door open. \"Well, since you're both here, want to join me for dinner?\"</p>\n<p>Hell Flare agreed almost instantly while Purpled just shrugged in response, saying that if Tommy didn't mind. They both entered the apartment and made themselves at home while Tommy went to start on dinner.</p>\n<p>It had been a week since he was released.</p>\n<p>Clingy bastards, all of them.</p>\n<p>Hell Flare and the rest of the Dream team had taken turns in visiting him, mostly to make sure he was okay.</p>\n<p>Hell Flare had been the most clingy. He was practically latched onto Tommy for his entire visit. Tommy would've snapped at him by then but the fucker actually made puppy eyes at him so the golden blonde didn't have the heart to do anything. At least he makes himself useful by helping out with chores and shit.</p>\n<p>Dream is a complete and utter asshole most of the time. The dick would follow him around the house sometimes and make every moment a living hell for Tommy just for the shits and giggles. Asshole even commented how funny it is to mess with him.</p>\n<p>404 was by far the most useless of the three, constantly napping on his couch when it was his turn to watch over him. Still, Tommy had to admit, the man was pretty cool in terms of his magic. The younger teen was in awe when he used his magic to practically make everything float and place them back as Tommy instructed him to.</p>\n<p>Things were different at work but still very much the same.</p>\n<p>Ranboo had been fucking hovering every few minutes. Always asking if he's fine and being the first to take over if Tommy ever felt strained. Tommy had to constantly remind him that he was fine and that he can handle things on his own just fine.</p>\n<p>MD was, thankfully, treating him like normal but is noticibly more hesitant to ask Tommy to help him with certain tasks.</p>\n<p>He doesn't have any comments on Jack and Eret since they're both new and the fact that he doesn't know them all that well except all the basic info. He does notice that they're a tad bit protective, however.</p>\n<p>Then, he noticed the severe lack of heroes entering the cafe. Sure, Sam, Puffy and Charlie still came for their morning coffees and pastries (The Slime Hero had come to his apartment a while back and gave him flowers and a cupcake with a note attatched to it that said \"I'm sorry I punched you\". Tommy had since became fond of the green bitch) but that's it.</p>\n<p>Phantom had attempted to enter once but immediately turned to leave and it gave Tommy the perfect chance to catch his workers in the act of them sending piercing glares at the man.</p>\n<p>He had properly smacked them all in the head for that, telling them to not scare away the customers.</p>\n<p>Honestly..</p>\n<p>Tommy sighed to himself as he locked up the shop and dismissed his employees before making his way home.</p>\n<p>Don't get him wrong, he loves them all, maybe Dream Team too (he'd never admit it, especially to Hell Flare. God knows how the arsonist would react if he knew).</p>\n<p>But Tommy wasn't used to being fussed over. Ironic, isn't it? The person who always looks out for other people and goes out of his way to help them, doesn't like receiving help from others.</p>\n<p>To be fair though, he had to learn how to take care of himself for years, especially after his family disappeared, so he was more than equipped enough to do everything for himself.</p>\n<p>He walked down the streets he's most familiar with as he made his way home but stopped when he saw the sale tags plaster on the window of an ice cream shop.</p>\n<p>Holy shit they were selling an entire tub for half price.</p>\n<p>Tommy practically dove through the door and made a beeline to the displays to pick out the ones he wanted. His eyes looked through the wide selection they had.</p>\n<p>He's pretty sure he's dead right now because this is heaven.<br>\n____<br>\nTommy left the shop with three tubs of ice cream in his arms.</p>\n<p>He had gotten himself a good deal on the three and now he's trying to rush himself home so that he can eat them. As he rushed by the corner, however, he felt himself collide into something and felt the items in his hands slip from his grip.</p>\n<p>He despaired as he watched the tubs fall, reaching out to hopefully save them.</p>\n<p>\"Ah.\"</p>\n<p>Only for them to suddenly fly upwards and float back into his hands. Tommy's head snapped to where the voice had come from and there stood a guy who looked very similar to Dream, except instead of a hoodie, he wore a cloak that had its hood pulled up to his head and his mask had an 'XD' carved into it. </p>\n<p>He also noted that the Dream lookalike had blue eyes.</p>\n<p>\"Oh, uh thanks for that, Big man!\" </p>\n<p>\"Your welcome... Uh..\" The other guy paused for a moment. \"Oh, right! Call me Tommy.\"</p>\n<p>He nodded. \"Tommy. Feel free to call me XD.\" He watched as XD's eyes snapped to the rooftops for a split second before he gave a slight bow to Tommy. \"I must leave. Please be careful on you way back.\"</p>\n<p>And with that, XD flew past Tommy.<br>\n____<br>\nJack jumped from rooftop to rooftop, taking care to not bump into anything.</p>\n<p>Niki had messaged him earlier, asking to meet up for a bit before her patrol. He had agreed.</p>\n<p>She had been so stressed out lately due to the HQ putting more work onto her than usual and placing even more pressure on her to top it off.</p>\n<p>As much as he's happy for the whole hero revolution that's going on, he didn't like how badly it affected his best friend.</p>\n<p>He had went back to their house for a bit to get the bag of cookies Tommy had given to him per his request since he had wanted to give some to Niki for a while now but couldn't since she needed to work overtime.<br>\nHe thought she would appreciate something to snack on.</p>\n<p>\"Hello.\"</p>\n<p>Jack practically stumbled from the jump as he felt his body freeze in fear. He turned to look at where the voice came from and there stood fucking XD, wings and halo out in display. His face was blank as he stared into the vigilante's soul.</p>\n<p>Almost immediately, he assumed a defensive position as his eyes scanned for an escape route.</p>\n<p>Then, XD fucking grinned.</p>\n<p>Oh he is so fucked.</p>\n<p>\"Let's talk, shall we?\"</p>\n<p>Jack was running for his life.</p>\n<p>Behind him, he can hear the sound of wings catching up to him. Jack cursed to himself as he took a sharp turn, hopping down to an alleyway in an attempt to lose XD in the maze of alleyways.</p>\n<p>He can still hear the motherfucker catching up to him.<br>\nFuck, fuck, fuck.</p>\n<p>He took another turn and skidded to a stop when he had been met with a dead end. His eyes widened as he backed up but when as he tried to dart back to search for another route to take, he was met with XD, who had been waiting for him.</p>\n<p>\"Please calm down. I have no intention on capturing you.\" The fallen angel said as he held up both hands in a surrendering gesture. \"I just want to talk.\"</p>\n<p>Jack scoffed. Sure, like he's gonna believe that.</p>\n<p>Moving as quickly as he can, he tried to launch himself up back up onto the roof when he felt something buckle on his ankle, which almost instantly pulled him back down and caused him to fall on the ground.</p>\n<p>He looked down at his leg and yep, he had been chained to the floor.</p>\n<p>\"Again, please calm yourself. I just want to talk.\"<br>\nJack gulped as he watched XD approached him, halo glowing softly and his wings folded behind his back.<br>\n____<br>\nTommy had just arrived by the building of his apartment when he stumbled upon a man with golden wings, bleeding out in an alleyway.</p>\n<p>He stared at him for a moment before rushing up the stairs, slamming down the tubs on his table and ran back down as fast as he can.</p>\n<p>Tommy grabbed the man and hauled him up the stairs before entering his apartment again, kicking the door shut with his foot.</p>\n<p>After he had been set on the couch and was confirmed that he wasn't dead, Tommy went to grab the first aid kit as well as a rag to clean the blood off. A quick trip to the kitchen and he had a bowl of warm water in his hands.</p>\n<p>Once he had everything he needed, Tommy went to work.<br>\n____<br>\nThe first aid kit closed with a click as his eyes scanned across the winged guy's body to spot if he missed any other wounds but was satisfied when he found none.</p>\n<p>Still, the guy probably would need something else to wear or at least cover himself up unless he wants the police called on him with the amount of blood he had on his clothes.</p>\n<p>He had checked the unconscious man for weapons, just in case Tommy had accidentally saved a murderer and to confirm whether or not if he needed to call Purpled, Punz or maybe Sonic to turn the guy in for him.</p>\n<p>He had nothing on him.</p>\n<p>Tommy just continued on with his routine after that.</p>\n<p>He placed the first aid kit back to where it belongs and grabbed a blanket to drape over the unconscious person before going back into the kitchen to dump the water he had used into the sink and scrubbed the rag free from any blood left behind.</p>\n<p>Then, he went ahead with dinner, a shower before he went to sit down on a bean bag next to the coffee table, a bowl of ice cream in his hand. Some shitty telenovela was playing as he ate the ice cream.</p>\n<p>He watched as the main character, some woman named Rosita, as she slapped her lover (soon to be ex lover from the looks of things) and began to rant about how she loved them, even with their flaws or something similar to that.</p>\n<p>\"What the fuck?\"</p>\n<p>Tommy craned his head to look at Me Golden Wings as he slowly sat up. He lifted up a hand and gave a small wave.</p>\n<p>\"Hey.\"</p>\n<p>He watched as the man blink, probably trying to make sense of the situation and maybe even having a crisis while Tommy took another bite of his ice cream. He can still hear the telenovela drone on in the background.</p>\n<p>\"......can I have some too?\"</p>\n<p>\"Oh sure. Hold on I'll go get it.\"</p>\n<p>For the rest of the night, they watched the telenovela as they ate ice cream and talked shit about it the entire time.</p>\n<p>It was a weird night but a welcomed one for sure.<br>\n_____<br>\nTurns out the guy is known as The Devil by the media or as he calls himself El Jugador, which means The Gambler in Spanish.</p>\n<p>Tommy had heard of him as one of the newer vigilantes, most likely just recently started patrolling around the area. Word of newer vigilantes appearing had spread easily across Pogtopia's community, El Jugador's debut being the most talked about.</p>\n<p>Apparently the guy was responsible for stopping an armed robbery as well as beating the shit out of some no named hero when they tried to apprehend him after the whole issue was resolved.</p>\n<p>\"By the way, call me Quackity instead of El Jugador. I'm off the clock from the looks of things.\" The Spanish man looked down at the bandages that wrapped around his body.</p>\n<p>Tommy gave an acknowledging nod as he scooped up some more ice cream. \"Name's Tommy. Nice to meet you, Big Q.\" He shoved the spoon into his mouth.</p>\n<p>Quackity gave a toothy grin. \"Likewise, Thomas.\"</p>\n<p>The next morning, Tommy had been cooking when he heard the sound of something falling to the floor and loud groans.</p>\n<p>He assumed Quackity had woken up.</p>\n<p>\"Good morning!\" He shouted to the living room as he slid some bacon and sunny side up eggs onto a plate.<br>\nHe looks up from the plates to see Quackity standing by the doorway to the kitchen, who was yawning. He walked over to the dining table.</p>\n<p>\"Good morning.\" He mumbled as he sat down. Tommy slid a plate over to him as he sat down as well, taking his share.</p>\n<p>The rest of the morning was spent in a comfortable silence.<br>\n____<br>\nPuffy had invited him to join her for some coffee when he entered the office.</p>\n<p>XD had just spent the rest of the night patrolling the entire area after obtaining the information he needed from Thunder so a bit of coffee sounded good. He had caught a good amount of criminals to keep the hounds off his back for a while.</p>\n<p>He listened as she talked about a cafe that she frequents recently.</p>\n<p>On their way, they met Sam and all three made their way to the cafe. He watched as they filled the silence with friendly chatter to each other, always including XD into the conversation in any chance they get.</p>\n<p>They arrived at a warm looking building, which completely contrasts the ones surrounding it. He peers into the windows and watched as customers mull around with pastries and drinks in their hands. He can even see some potted plants placed here and there as well as a few paintings that were hung on the walls.</p>\n<p>\"Oh, um XD?\" Sam called out, waving his hand over his head.</p>\n<p>\"Ah, of course.\" In an instant, the halo and his wings had disappeared in a cloud of smoke which then formed into a small pins into his hands. He clipped them both onto his cloak.</p>\n<p>\"Here we are!\" Puffy exclaimed, pushing open the door with Sam following her from behind. XD trailed behind them and listened as the chatter around become more hushed.</p>\n<p>He felt eyes on him from the other customers which made him twitch. His hand went up and adjusted his mask, making sure it was covering his face. He listens as they whisper behind his back and even saw someone subtly point their phone at his direction.</p>\n<p>\"XD?\"</p>\n<p>His eyes snapped forward, looking at Puffy and Sam, both who were looking at him with concern. He just nodded before going up to the register to order.</p>\n<p>\"Oh, it's you!\"</p>\n<p>\"Ah, hello again Tommy.\"</p>\n<p>If you were to tell Tommy that he would befriend the current number 1 hero, who is also a fallen angel from the rumours he has heard, he would've called you ridiculous and start to insult you.</p>\n<p>Currently, he's having a nice chat with said hero while he was preparing some drinks.</p>\n<p>.....he's pretty fucking sure his powers is some form of magnitude force where he attracts people from all sides of the law. Maybe his illusion magic is just a side power he has.</p>\n<p>To put in some context on what the hell is going on, XD showed up at the cafe with Puffy and Sam, both were ordering while behind them, XD was having what looked like the start of an anxiety attack before Puffy looked back and got his attention, which helped him snap out of it.</p>\n<p>He looked across the cafe and saw some people basically talking shit about him behind their backs while also taking pictures of him but one glare from Tommy was more than enough to get them to fuck off.<br>\nHe turns his attention back to XD and with a smile, he said with faked surprise: \"Oh, it's you!\"</p>\n<p>\"Ah, hello again Tommy.\"</p>\n<p>The way XD relaxed was very much visible, especially when his shoulders had dropped a bit. He can still see him shake a bit though.</p>\n<p>\"Welcome to the cafe! What can I get you?\" He asked, taking out his notepad and pen as he waited.</p>\n<p>XD took a look at the menu for a bit before he decided to order. \"An iced choco mocha with whip cream please and some apple fritters. All to go.\" Tommy nodded as he wrote it all down.</p>\n<p>\"Okay! If that's all, I'll have your orders out in a minute.\"</p>\n<p>Then, he went to work on the orders as he started to make some small talk with XD, all the while ignoring the bewildered looks from everyone else that was present.</p>\n<p>XD had started to become more visibly relaxed the more they talked and even giggled a bit during the conversation from a very well timed pun Tommy blurted out.</p>\n<p>He handed out their orders and after they paid, waved at the three as they walked out the door.</p>\n<p>It was peaceful for a second before some of the customers suddenly sprung out of their seats and crowded by the counter, asking Tommy a bunch of stuff like \"how long have you known XD\" or \"are you two friends\". He had to force them to stop when they asked some more creepier questions.<br>\n_____<br>\n\"Hey.\"</p>\n<p>\"Hey.\"</p>\n<p>Quackity was spread over the couch, remote in hand as he switches through channels. Tommy just went straight to the kitchen after he cleaned himself up and changes into a fresh pair of clothes.</p>\n<p>He had been in the middle of cooking when his front door was slammed open. \"Toms! Hey! How are ya- who the fuck are you?\" There was some thumping noises, most likely Quackity getting up in shock at the sudden guest.</p>\n<p>Tommy barely reacted as he continued to slice up some tomatoes. \"Hell Flare, you know the rules. Quackity, please calm down. Flare is not a threat.\" He said as he dumped the tomatoes into a pot of stew.<br>\n\"But he's a top villain.\" The golden winged man hissed back. Tommy grabbed a wooden spoon from his cupboard and stirred the contents of the pot. \"Like I said, he's not a threat. And if either of you try anything, I have a broom here with your names on it.\" He hears a faint squeak of fear, most likely from Hell Flare.</p>\n<p>The apartment went quiet again, which made the blonde curious so he peaked out from the kitchen into the living room.</p>\n<p>Both the villain and vigilante were staring each other down in an almost taunting way. Quackity's lips were twisted into a snarl while Hell Flare's face was oddly blank and calm but he had a dark look in his eyes.</p>\n<p>He just ignored them and went back to cooking.<br>\n____<br>\nDinner went by very smoothly.</p>\n<p>Quackity and Flare were both civil on the table, despite the fact they were both kicking each other under the table. After he had finished washing the dishes, he went to fridge, plucked out the tubs and served up some ice cream.</p>\n<p>When he went back to the living room with three bowls of ice cream in his hands, they both were siting at the couch but with a distance between them, still glaring at each other.</p>\n<p>He placed the two other bowls onto the coffee table as he plopped himself onto the bean bag. He reached out for the remote and switched on the television.</p>\n<p>Still, the atmosphere remained tense.<br>\n_____<br>\nDream had a pretty good week so far.</p>\n<p>He had managed to pull off some destruction, taken some cocky hero newbies out of commission and even went to bother Tommy a lot. Not to mention he just scored himself some cola that were on sale.</p>\n<p>So here he was, walking across the rooftops with a bag in hand. He slid down the drainpipes that was connected to he building and went on his way through the alleyways.</p>\n<p>Humming a little tune to himself, he went on his way. Maybe he'd take the evening off and just relax for once.<br>\nHe turned the corner and there it was.</p>\n<p>Ponk was making out with Awesamdude.</p>\n<p>Dream immediately backtracked to the corner he turned from. That can't be right. He's probably seeing things. After all, it's been a while since he had gotten some proper sleep and he was pretty tired so it's probably the sleep deprivation talking. Plus, there was no way his buddy Ponk would go for a hero, right?</p>\n<p>....right?</p>\n<p>He looks back into the alleyway again and this time, he locks eyes with the two before immediately pulling himself back.</p>\n<p>Yup, he wasn't seeing things. He walked the other direction of the alleyway as he tried to remember any different routes he could take to get back to base.</p>\n<p>He practically broke into a sprint when he heard the sound of armoured feet running into his direction.</p>\n<p>\"I saw nothing!\" Dream screamed out when he spotted Awesamdude running towards him from the corner of his eye.</p>\n<p>He didn't even slow down. In fact he sped up even more to catch up.</p>\n<p>Tommy is pretty sure they're fucking now.</p>\n<p>It's only been a day since Flare had met Quackity but Tommy is pretty sure they're seeing each other.</p>\n<p>He doesn't know whether to see that as a good thing or a bad thing.</p>\n<p>The cafe was closed for today and he decided to go out for a bit so that he can relax a bit more. He had gone through some bullshit recently and honestly? This break is well deserved.</p>\n<p>Especially when Dream broke into his house in the middle of the night for protection since Sam was on a warpath for his head.</p>\n<p>Tommy refuses to know the reason, mostly when Dream starts babbling about someone making out and how he swears to Prime that he never saw anything.</p>\n<p>Sam just kept approaching them, eyes tearing a hole into Dream, who had resorted into using Tommy as a shield.</p>\n<p>The broom came in very handy at this situation.</p>\n<p>After a few well aimed smacks onto the hero and a quick scolding later, Tommy sends Sam off before doing the same with Dream, who was quick to book it after confirming that the creeper hybrid was nowhere near.</p>\n<p>This is why Tommy doesn't trust adults to keep things in line.</p>\n<p>As much as he hated to admit it but he was a literal child compared to them. He's 16 (soon to be 17, he would realize) for fuck sake! And yet he's the one who has more responsibility over most adults he had met.</p>\n<p>He sighed to himself as he walked into a book store.</p>\n<p>He had made a list of what he wanted to do for the day and the first one is to pick up some books for him to read later in his little corner of the apartment.</p>\n<p>Flare had mentioned that he liked reading mystery novels while Quackity had asked if he had any romance lying around so he'll probably grab a few as well for them.</p>\n<p>He looked around for anything that catches his interest and plucked them out of their shelves, giving it a quick read at the summary to make sure that it was indeed worth it to buy.</p>\n<p>\"If you're a beginner on the romance shit, I suggest going for romcoms first.\"</p>\n<p>His head snapped to the person next to him.</p>\n<p>Oh, it's just Hbomb.</p>\n<p>\"Hey Big H. How ya doing?\" He said as he read through some of the book titles. He had met him a while back when he was the sole employee of the cafe.</p>\n<p>He had applied as a part time cashier and had quit after working for about a year. They both had gotten along very well and he was sad when the older had to leave.</p>\n<p>Still, working with him was very amusing. Especially when he decided to wear a maid outfit, even after Halloween had ended. Hbomb had went out of his way to torment some of the customers as a cat maid and even flirted with Tommy on some occasions. </p>\n<p>He had, thankfully, dropped it when the blonde had shown some discomfort from the flirting. He still continued tormenting people though.</p>\n<p>\"Been a while, Tom! I'm doing good. How's the cafe? I haven't been there in a while.\" He said as pulled out a book and checked the summary.</p>\n<p>He handed the book to Tommy. \"Try this one. It'll probably catch your fancy.\"<br>_____<br>They spent about two to three hours chatting as they caught up with each other while they roamed the area.</p>\n<p>Hbomb had recently started working as an assistant at HQ in L'Manburg City and lived in the dorms that was provided to him. The only reason he came to Pogtopia was to get himself some new novels to read and maybe to stop by the cafe again.</p>\n<p>Unfortunately, Hbomb had to leave when he received a text from his coworker, saying he needed to come in and that it was an emergency. Something about vines and a red egg.</p>\n<p>So Tommy was left alone again.<br>\n_____<br>\nAntfrost hummed a tune to himself as he walked down the street.</p>\n<p>Bad had sent him off on a mission to collect possible members for the Eggpire, get their addresses and send an invite for the banquet to them.</p>\n<p>He had found two potential members so far. A florist with a flower crown of roses on her head and a mercenary wearing a white hoodie and a large medallion on his neck.</p>\n<p>They both held a lot of promise for the Egg so he sent out the envelopes to their doors. He simply slid the florist's invite through her mail slot and handed the mercenary's invite to his younger brother before leaving to search for more.</p>\n<p>It had been an entire day and he still have three more envelopes on him. Antfrost just needed at least two more candidates to hand out the invites to.</p>\n<p>He had been so lost in thought that he wasn't watching where he was going until he felt himself get tugged back and fall into someone's arms. In a split second of that happening, a truck passed in front of him in high speed, loud honking rang in his ears.</p>\n<p>\"Holy shit, that was close.\" The person behind him said as he took a quick breath. \"Hey, are you okay?\"</p>\n<p>Antfrost took a moment to recover from the shock before he went and detatched himself from the person. \"Yeah... Yeah I'm okay. Thanks for saving me!\" The cat hybrid said as he held his hand out for the <strike> teen? </strike> guy who was sat on the floor.</p>\n<p>He just chuckled to himself and took hold of Antfrost's hand before pulling himself up. \"Its nothing dude but for fuck sake, look where you're going! You practically walked into that one.\" He said.</p>\n<p>Oh? Had he been that distracted?</p>\n<p>He quickly checked his bag and found that the envelopes were safe, letting out a soft sigh of relief. He looked back up at the person who saved him as he seemed to ramble off about something.</p>\n<p>It was probably instinct or a gut feeling.</p>\n<p>But Antfrost thinks this guy has the potential to be a fine member of the Eggpire and another devoted follower to the Egg if pushed correctly.</p>\n<p>They both parted ways soon after but the cat hybrid turned back with his phone in his hand, taking a picture of the blonde, who he learned is named Tommy and sent it to his boyfriend, Velvet.<br>\n____<br>\nAntfrost: here's another one vel! can you find his address?<br>\nAntfrost: his name is Tommy and<br>\nAntfrost: actually I forgot to ask how old he is<br>\nVelvet: it's okay hun<br>\nVelvet: here's his address by the way!<br>\nVelvet: *** *********<br>\nVelvet: love you!<br>\nAntfrost: love you too :3<br>\nAntfrost: I'll see you later<br>\n_____<br>\nHe read the address again before pocketed his phone again.</p>\n<p>It doesn't seem too far from where he's from so he made his way over to Tommy's apartment, envelope ready to be delivered.</p>\n<p>Tommy found a letter on the floor to his door when he got back.</p>\n<p>At first he thought, who the fuck uses envelopes nowadays? Much less for what he assumes is spam mail. He picked it up and examined it, almost instantly noticing that it was dyed a deep shade of red and it had a wax stamp on it.</p>\n<p>Okay, this is some fancy shit right here.</p>\n<p>He flipped it over to find if there was anything else and found some writing. In a calligraphy nonetheless. Okay, this is probably really expensive too from the looks from it.</p>\n<p>\"To the person who receives this letter....\"</p>\n<p>As if that isn't ominous.</p>\n<p>So he just broke open the seal to read the letter inside. He noted that it had some vines growing on some parts of the paper.</p>\n<p>\"Greetings to the recepient of this letter!</p>\n<p>We, the Eggpire, have cordially invited you to the Red Banquet! </p>\n<p>The event will start on tommorow evening at 4.50 pm and will go on for two nights. You are allowed to bring one other person to this event as your plus one. The event will happen in the ballroom of Hotel Inferno at District 11.</p>\n<p>You are also allowed to bring appetizers of your own to the banquet if you'd like.</p>\n<p>Yours truly,<br>Darryl Halo\"</p>\n<p>Tommy blinked before going back to read the letter again. Wait, what the fuck?</p>\n<p>The door suddenly swung open which startled Tommy and caused him to look at the person standing there.</p>\n<p>It was Purpled.</p>\n<p>Tommy scowled at him. \"Ever heard of knocking?\" The bastard just grinned at him as he invited himself into the apartment. Tommy just followed him, dropping the books he had purchased earlier onto the coffee table.<br>\"You got a letter too?\"</p>\n<p>Purpled was looking at the red envelope in his hand. Tommy looked up at the other with an eyebrow raised. \"And? How the fuck does that concern you?\" He said as he watched the other plop himself down onto his favourite bean bag.</p>\n<p>Damn you Purpled.</p>\n<p>He huffed and sat on the couch with his arms crossed as he waited for the other to continue. \"Punz got an invite too. Knowing him though, he snatched it away from me before I could read the rest but I know he's been invited to some fancy party.\"</p>\n<p>\"And you're mentioning this because....?\"</p>\n<p>Purpled tried to muster up some puppy eyes and aimed it at Tommy's direction. \"I was wondering if you can bring me with you?\"</p>\n<p>He glared at the purple clad vigilante. \"And what would I achieve from that?\" He said, doing his absolute best to resist that look.</p>\n<p>Purpled's expression turned dangerous and Tommy suddenly feels dread run through his veins.<br>_____<br>Bad had been making preparations for the banquet and everything was going good so far.</p>\n<p>He was almost done and just as the day of the banquet was close.</p>\n<p>He purred when he felt mana from the Egg flow through his veins, fueling his soul and giving him energy. The Egg was very much pleased with their progress.</p>\n<p>But they needed more people to join.</p>\n<p>More people meant more power and the Eggpire needed a lot of it. The only current members were himself, Antfrost and Velvet.</p>\n<p>Bad had sent out Antfrost earlier to search for candidates and hand them the invitations for the banquet.</p>\n<p>Velvet had visited his office earlier to give a report on the candidates.</p>\n<p>Antfrost had already given out all five of the invitations. They were gonna first invite five people to the banquet at first before attempting to branch out more. They wanted to see if Bad could persuade them into joining their forces and serve the Egg first.</p>\n<p>The five candidates are as followed; Hannah Rose, Punz Bedwars, Tomathy Innit, Schlatt J and Ranboo Beloved.</p>\n<p>A florist, two vigilantes, a CEO/criminal mastermind and a cafe owner.</p>\n<p>It might be a bit difficult trying to convince the CEO and two vigilantes but if he can turn the florist and cafe owner to his side, he'd maybe have a chance. </p>\n<p>Especially if Tomathy were to take their side due to how widespread his reputation is.</p>\n<p>He hummed a soft tune to himself as his mood turned brighter and continued to do his work.</p>\n<p>Everything was going good.</p>\n<p>Maybe he can go and see Skeppy for a bit.<br>_____<br>Schlatt told his secretary to clear his schedule for the next two days as he read through the letter again. Eyes hovering over certain parts of it, feeling curious as he read through some of the offers.</p>\n<p>Eggpire, huh?</p>\n<p>There was not much information on them but there had been just enough for him to work with.</p>\n<p>An organization run by three people, who's files had reported that they had went missing since a year ago. There also had been a report that drastic changes had happen between them. </p>\n<p>Now if that didn't raise some red flags.</p>\n<p>A bit of searching later and he found who had been invited. He's not gonna lie, he was a bit surprised to see Tommy's name among the people who had been invited.</p>\n<p>He made a call to Tommy and asked him if he had gotten an invitation, which he confirmed that he has and that he was going to go to the banquet.</p>\n<p>Well, now he has to go if the kid is going because God knows what's gonna happen during this event and those two vigilantes who're invited weren't gonna cut it.<br>He pulled out his phone and sent a text to the manager from his favourite boutique for them to prepare him a new suit to wear.</p>\n<p>Still, maybe this event wouldn't be a complete waste. He can use this chance to talk to Tommy and know more about these Eggpire people. What their goal is and all that stuff.</p>\n<p>Though he was mostly gonna be there for Tommy.<br>They both had been busy with their respective businesses lately so he didn't have any free time to visit the Cafe.</p>\n<p>Maybe he'll call up Swagger and see if he wants to be his plus 1 for the Banquet.</p>\n<p>Schlatt went back to work, looking forward to the Banquet.</p>\n<p>Tommy stood in front of the hotel with a box of cookies in his hands and Purpled by his side.</p>\n<p>They were both wearing suits for the occasion. Tommy had to rummage through his entire closet to find something decent to wear until he found an old suit of his.</p>\n<p>Him and his parents had the suit made for his school's prom about a few months before they disappeared.<br>\nIt had a dark grey dress shirt and a black vest with a maroon jacket for the top. For the bottom, he had black dress pants and wore some boots to match.</p>\n<p>He remembers how much they had insisted he have them make this for him. That it was the most important day of a teen's life. He remembers them occasionally asking if he's bringing anyone with him, whether it was a boy or a girl and how he told them to stay out of his business, which they just laughed at and just continued teasing him.</p>\n<p>It made him realize how he never finished highschool before having to dropout so that he can have more time keeping himself and the cafe afloat. How he never had the chance to graduate.</p>\n<p>He shook his head and went to put the outfit on.</p>\n<p>It was a bit tight but it still fit on him. He grabbed the box of cookies when he heard the sound of his door knocking.</p>\n<p>Now they both had just entered the ballroom after Purpled handed an employee their envelope and they were escorted inside.</p>\n<p>There were other people there too and the one he, somewhat, recognizes is Punz since he's the only bitch he knows that wears all white.</p>\n<p>Plus, Purpled did say he had been invited too.</p>\n<p>Tommy had went ahead and placed the cookies by one of the tables with the rest of the appetizers while Purpled went ahead. He went ahead and made his way to them, picking up a cocktail from a passing server's tray.</p>\n<p>He watches as Punz keeps a glass of champagne away from Purpled, who was reaching out for it.</p>\n<p>\"C'mon! You bitch. I wanna try some!\"</p>\n<p>\"Purpled, you are a literal child. I'm not letting you drink alcohol.\" Punz said as he glared at his younger brother. \"And what did I say about sneaking into parties like this? I don't remember seeing a letter sent to you.\"</p>\n<p>Purpled just huffed as he stepped back. \"I managed to persuade Tommy to let me come with him as his plus one.\" A grin was plastered on his face.</p>\n<p>\"You lil shit. What did you actually do?\"</p>\n<p>Tommy walked up to them.</p>\n<p>\"Hey guys! How ya doing?\" He greeted and almost instantly they both whipped their heads to him. \"Tommy.\" He hissed at the cafe owner. He smiled in response. \"Punz.\"</p>\n<p>\"Why the fuck did you bring Purpled with you? Didn't you remember what happened last time?\" He said, glaring at Tommy, who just chuckled.</p>\n<p>Oh he remembered perfectly.</p>\n<p>Purpled had convinced Tommy to help him on his mission to infiltrate some kind of grand ball for the sake of annoying Punz.</p>\n<p>It ended with Purpled beating the shit out some asshole, Punz having to keep him back while Tommy apologized on their behalf. Apparently the guy had made an insensitive comment about Tommy behind his back and Purpled had overheard which made him deck the man in the face.</p>\n<p>The guy had threaten to sue them before someone else had stepped in.</p>\n<p>This is when he had first met Schlatt.</p>\n<p>\"Oh, I remember that day perfectly.\" He said with a smirk on his face. He can definitely see the appeal of annoying Punz.</p>\n<p>He scowled. \"Great. Purpled had corrupted you.\" He raised the champagne when Purpled made another attempt to swipe at it.</p>\n<p>\"You bitch!\"</p>\n<p>\"How are you enjoying the party so far?\" He asked as he took a sip from the champagne, ignoring the outraged cry from Purpled. Tommy hummed. \"Feeling pretty good so far. You?\"</p>\n<p>\"Same.\"</p>\n<p>Tommy raised an eyebrow at him. \"Really?\" He asked. He can clearly see the mercenary looking uncomfortable.</p>\n<p>Punz stayed silent for a bit. \"....I have a bad feeling is all.\" He said.</p>\n<p>Tommy just nodded in response.</p>\n<p>He hung out with the two and they watched as other people enter the ballroom.</p>\n<p>He waved when he saw Ranboo enter with a boy by his side and...</p>\n<p>What the actual fuck is that a child?</p>\n<p>He gave Schlatt a nod of acknowledgement as he watched him enter the ballroom with Swagger by his side.</p>\n<p>Schlatt had introduced him to Tommy at some point during one of his rare visits to the Cafe and the two had hit it off immediately.</p>\n<p>After a while, they had all been escorted to another room where there was a large table that had been laid out.<br>\n___<br>\nBad stood at the side, a glass of wine in hand. Velvet had approached him earlier and told him that all of the guests had arrived.</p>\n<p>He checked and sure enough, they were all there so he signaled for the hotel staff to start the event.</p>\n<p>Now, Bad, the rest of the Eggpire and the guests were all sat at the table that had been prepared earlier. He was at the head of the table and behind him was the Egg. It took a bit of... 'convincing' but he managed to strike a deal for them to allow him to bring the Egg inside.</p>\n<p>He watched as some of them chatted with each other in hushed tones as they looked at the being behind him, most likely confused on what it is or why it's there. He felt a vine wrap itself around around his ankle and he felt as more energy from the Egg poured into him, making him feel much more stronger than before.</p>\n<p>His gaze turns back to everyone else on the table, watching as they continued chatting but one didn't.</p>\n<p>Schlatt gave them a suspicious look.</p>\n<p>He's gonna have to bring his all for this one.</p>\n<p>He gave a subtle nod to Antfrost and Velvet before he stood up, which garnered the attention of everyone else as their conversations buzzed down. Bad gave them a smile.</p>\n<p>\"Welcome to the Red Banquet, dear guests. I sincerely hope you're comfortable with these arrangements.\"</p>\n<p>'Because you won't be leaving for a while.' He thought to himself.</p>\n<p>\"Allow us to introduce ourselves. We are the Eggpire and we work for the entity behind us, the Red Egg. My name is Bad Halo.\" He bowed at them.</p>\n<p>Two others who sat by his side stood up as well.</p>\n<p>\"I am Ant Frost. It's nice to be acquainted to you all.\" A cat hybrid, which Tommy instantly recognizes as someone who he had saved from getting hit by a car. Ant seemed to have noticed his staring and nodded at him with a smile.</p>\n<p>\"Hi! Name's Velvet. Velvet Cake. Let's get along now!\" He seemed the most excited of the three and was practically bouncing on his feet.</p>\n<p>They both sat down again as if on cue, leaving Bad as the only one standing.</p>\n<p>\"Introductions aren't necessary on your parts since we just need a bit of your time to listen to our proposal.\" He said again.</p>\n<p>Tommy looked back at Punz, who was looking at the demon in distrust. Purpled just kept a clear poker face as he stared at the three in front of them.</p>\n<p>He turned his attention back to Bad as he continued to talk, not noticing the feeling of something crawling up his leg.<br>____<br>\"You want me to do, what?\"</p>\n<p>\"Pose as our kid. Like hell we're gonna bring Micheal with us.\" Tubbo said as he texted Beau and asked her to watch over Micheal. He gotten a simple 'sure, just bring him over' from the other in return before he put down his phone. He swung his legs a bit from where he sat on the kitchen counter before looking back up at the other person sat in the living room.</p>\n<p>\"Yeah but why....?\" Sneeg said as he tried to make sense of the situation.</p>\n<p>Tubbo had sent him a message while he had been out on patrol and asked if he can meet him at his apartment after he was done for the night, which he agreed to.</p>\n<p>\"Because Boo got an invite to some fancy party with a plus two for me and Micheal as well as some other concerning things attatched to it but that's not the point here.\" He said. He hopped off the counter he sat on.</p>\n<p>Walking up to a shelf on the wall, Tubbo picked up an envelope that laid there. \"Plus, I don't trust this at all so I wanna have some backup in case my suspicions were right.\" He said.</p>\n<p>\"And you want me to act like your kid?\"</p>\n<p>Tubbo shrugged. \"Basically.\"<br>____<br>Sneeg sat between Tubbo and Ranboo, having to shift himself into a more childlike state to fit his role better.</p>\n<p>He listened as Bad gave his speech, acting disinterested and looked around the room. He noticed that some of the hotel staff were still in the room with them as they moved around, preparing to serve them but what stood out from them were their glowing red eyes.</p>\n<p>It was an eerie sight to say the least.</p>\n<p>Especially with how blank they look, similar to how Bad, Velvet and Ant's eyes were and how he notices faint trails of red on their skin.</p>\n<p>He ducked his head a bit, keeping his act as a shy kid when one of the servers looked his way. He can feel their eyes boring into his body as they stared at him while his gaze fell onto the floor.</p>\n<p>A breath of relief left him when he felt them look away and continue to do their work.</p>\n<p>Sneeg looks up again and he notices that one of them had hidden what looked like a dagger in their jacket. His eyes widened in shock and he reached out to Tubbo's shirt, tugging it three times.<br>____<br>\"Well, we gotta at least have some sort of signal so that we can avoid talking. In case these Eggpire people got ears listening in on everyone.\"</p>\n<p>Tubbo hummed as he took a moment to think before his face broke into a grin.</p>\n<p>\"Here's an idea. Why don't you just tug onto my clothes? Once for 'this is suspicious', twice for 'something is off here's and thrice for 'something is definitely wrong here'. Pretty simple and effective, right?\" He said, looking over at the hero.</p>\n<p>Sneeg just nodded in response.<br>____<br>\"Now!\" Bad had clapped his hands together.</p>\n<p>\"Let us begin with the banquet! Oh but do, tell us if you would like to consider the offer. It comes only once in you lifetime after all.\" He says as he felt the vines shift from his leg to under the table.</p>\n<p>No doubt it had already crawled itself across the table and begun latching itself onto the guests. Similar to how it did with Madame Poarch when he tried to convince her to help him with his goal of spreading the Egg's influence.</p>\n<p>She had fought back at first but soon became more obedient to the Egg's demands and joined them.</p>\n<p>The Egg would take care of things from here as it would dampen their powers of everyone present, especially the vigilantes, until it's practically unusable. He was only set to distract them after all.</p>\n<p>To have their attention aimed directly onto him so that the Egg could progress to the main event.</p>\n<p>He signals for the workers to serve them as well as to a signal to be prepared if anything were to escalate.<br>He smiled to himself as he sat down again.</p>\n<p>\"So to sum things up from that little rant of yours,\" Punz had spoken up. \"You want us to join you and in return, we would be granted whatever we wanted, whether it'd be money, power, all that shit?\" He asked as he leveled Bad with a look.</p>\n<p>\"Yup!\" He replied with a grin on his face. He tilted his head to the left as if curious. </p>\n<p>\"And before you say 'I don't have anything I want', you're lying. I know you, and a few others here, have something that you want more than anything in the world. Perhaps a reunion with a family member, maybe even protection for someone you care for. Need I explain more?\" Bad said as his eyes roamed, taking in everyone's expression.</p>\n<p>His gaze landed on a few and he mentally cheered. Seems like he had struck a nerve on some of them.</p>\n<p>He had casted the line and hook.</p>\n<p>Now he'll sit there patiently and wait for someone to take the bait he had set out.</p>\n<p>\"Sapnap, I will fucking murder your father.\" Dream said as he glared at the other.</p>\n<p>Sapnap groaned as he turned to his best friend, soon to be dead best friend if he doesn't shut the fuck up, and returned a glare to him. \"I know. You've said that like six times for the past hour.\" He said.</p>\n<p>Currently, the Dream Team plus Ponk are on their way to Hotel Inferno, where Sapnap had found out his dad was hosting a banquet in order to get more members for his cult. Amongst the people invited is Tommy, who they cannot let the egg get to him.</p>\n<p>Oh Punz and Purpled too. Can't forget about them.</p>\n<p>The rest of their trip to the hotel was mostly in silence. Well, at least until Ponk sees Awesamdude, who seemed to be in a rush, and waved at him, which prompted Dream to dive-bomb into the nearest alleyway, trauma from being chased by the Mechanic Hero still fresh in his mind.</p>\n<p>Sapnap let out a laugh while George snickered as Dream peeked out from where he hid to look around for any signs of the hero.<br>\n___<br>\nCorpse knows something was wrong when he clocked into his shift at the hotel that day.</p>\n<p>As if the fact that a majority of his co-workers were sporting almost blood red eyes and had an unnatural feel to them.</p>\n<p>So far, it was just him, Sykkuno, Toast, Rae, Tina, Eryn and Ludwig who were unaffected by whatever the hell was going on here.</p>\n<p>Now, in this type of situation, it's only normal for someone to notify the authorities or at least find some way to escape so that they can call for a hero patrolling nearby.</p>\n<p>Haha, no.</p>\n<p>He's lived in Pogtopia long enough to know what's up.<br>\nHe did consider the second option but before he could do anything, Toast had pulled him aside to inform him that every exit that was once available had become unavailable due to the clusters of red vines blocking the way. Not to mention the many brainwashed employees patrolling the entire place.</p>\n<p>So that plan was a bust.</p>\n<p>What else was he going to do other than just continue on like normal. Though he does feel a bit more at ease when Tina went to the bathroom to text out a code Red to a new vigilante named El Jugador.</p>\n<p>Apparently, they're neighbours.</p>\n<p>What a small world.</p>\n<p>He leaned over one of the guests, Hannah he had recognized, and poured her some sparkling cider. At the corner of his eye, he watched in concern as her skin turned a bit paler and sickly. He placed the bottle back onto his cart and placed a hand on her shoulder.</p>\n<p>\"Ma'am? Are you okay? You look a bit pale there.\"</p>\n<p>It had been about half an hour since Mr Halo had started the banquet.</p>\n<p>He felt her flinch under his touch as she turned to look at him, eyes still dazed. She blinked a bit before looking up at him.</p>\n<p>\"Huh? Oh it's okay... I'm fine..\"</p>\n<p>He wanted to ask more but the stare Bad gave him from the head of the table didn't help much so he left her alone.<br>\n_________<br>\n\"Slimecicle? Where are you going?\" Techno asked with an eyebrow raised. He watched as the humanoid slime moved in rushed movements. He paused when Techno directed his question to him.</p>\n<p>\"Uhhh... To meet a friend. I just remembered we planned to hang out today so I can't stay any longer.\" He said as he shoved his phone into his messenger bag. Techno can vaguely hear the sound of glass hitting something hard from there.</p>\n<p>He always wondered what had been in that bag considering the fact that it was always full of 'random trinkets' as Phil had told him during a passing conversation of theirs.</p>\n<p>His train of thought was cut off when he heard the door to their shared office slam shut.</p>\n<p>Oh, Charlie left.<br>\n_____<br>\n\"Okay, so-\"</p>\n<p>The door slams open, revealing fucking Slimecie as he pants in exhaustion from running. \"Cha-\" Quackity stopped talking as he realized what he was about to say. \"Slimecicle! Shit, did you actually run all the way here?\" Quackity said as he walked up to the hero and guided him into his apartment.</p>\n<p>Ted raised an eyebrow as he watched the humanoid slime plopped down onto the sofa.</p>\n<p>\"Oh by the way, Slimecicle, this is Milkman or well, MM for short. MM, this is-\"</p>\n<p>\"The Slime Hero, Slimecicle. I know.\" Ted said with a deadpanned voice, levelling a stare at the two. Okay, what the fuck he wasn't told he would be dealing with heroes when he got recruited by Quackity for Las Nevadas.</p>\n<p>\"Quackity, what the fuck is this?\" He asked as he turned to look at the duck hybrid, gesturing to the hero. Quackity just scoffed. \"That's Slimecicle.\" Ted glared at him.</p>\n<p>\"You know what I mean, dipshit.\"</p>\n<p>\"Heyyy, no need for insults now.\"</p>\n<p>\"Answer my question, duck man.\"</p>\n<p>Quackity groaned in response. \"He may be a hero but he's part of the team, okay? So deal with it.\" He said.</p>\n<p>Ted just continued glaring at the humanoid slime. \"Any more surprises I should know about?\" He said with a dry voice. Honestly, he felt a little betrayed. Normally he'd be fine being around heroes but being caught off guard like this was never a good feeling for him.</p>\n<p>As if on cue, the door to the apartment opened.</p>\n<p>Ted turned to look-</p>\n<p>'Oh you have got to be fucking kidding me,' he thought to himself.</p>\n<p>Standing by the door was none other than Foolish, Clover and XD. He turns to look at Quackity. \"Really? Them? How the fuck did you even manage to convince them in the first place?\" He said, voice exasperated.</p>\n<p>\"There's a thing called talking, MM. That's how I managed to get them to join me.\" He said. </p>\n<p>\"Now that's just complete and utter bullshit.\"</p>\n<p>\"It's true!\"</p>\n<p>Ted ignores him and looked back at the three standing by the door. \"Did he blackmail you? Have some kind of threat against any of you? C'mon, there's no way he had actually talked you guys into joining him. Trust me, I've experienced that, first hand when he tried 'convincing me' to join.\"</p>\n<p>He remembers when Quackity held him at gunpoint and told him to come with him to the meeting. </p>\n<p>Apparently there had been a code red and he needs all the help he can get, even if it meant threatening people, preferably other vigilantes.</p>\n<p>\"Oh no, he actually just talked to us.\"</p>\n<p>\"What the fuck. Why the fuck did I get threatened to come here? Was I the only one who didn't get a more civilized approach?\"</p>\n<p>\"Hey! I was pretty civilized with you!\"</p>\n<p>He leveled a glare at Quackity. \"You had a literal gun aimed at my head and almost went feral at me. Fuck, you even <b>bit</b> me, asshole. I have the right to call you an animal.\"</p>\n<p>XD just waltzed in and plopped himself onto a chair. \"I have no clue what's going on right now but I wholeheartedly with MM.\" He said.</p>\n<p>Ted cheered in victory while Quackity grumbled to himself.</p>\n<p>\"Anyways, I didn't call a meeting to just do intros.\"<br>\nHe walked up to the front of the room after everyone had settled down into their seats.</p>\n<p>\"Apparently we have a code red. Tina, my roommate, sent me a message about it. Remember the Eggpire?\" He continued and watched as Foolish and Fundy tensed up at the name.</p>\n<p>\"Yeah? Why? Are they here now?\" Fundy asked, hand grabbing his tail. It had been a habit of his when he gets nervous, something Quackity noticed happening a lot lately.</p>\n<p>\"Yeah, they're here, active and they've got hostages.\"</p>\n<p>Purpled remembers being at that fancy dinner party with Tommy and Punz.</p>\n<p>He had been on a mission to annoy his sibling as much as he can during the entire thing so he recruited Tommy and used him to infiltrate the party.</p>\n<p>He never expected to get involved in some cult.<br>\nJust as he was planning on tormenting Punz some more.</p>\n<p>Purpled ducked when one of the red eyed servers swung a chair at him. He shot forward and aimed a kick on the guy's leg, causing the server to fall over. He looks over to where the three Eggpire members are.</p>\n<p>Their leader(?), Bad, is currently fighting with Schlatt and Sneeg, who was previously playing as the kid Tubbo brought with him, and goddamn did they look cool the entire time. They were just exchanging blows with each other without stopping or slowing down.</p>\n<p>On the other side of the room, Punz, Ranboo and Tubbo are fighting Ant. Speed seems to be the guy's strongest attribute with how much he's zooming around the three. They seem to be struggling a bit but Purpled is confident that they can figure their way out of that mess.</p>\n<p>Which leaves Tommy, Hannah, Schlatt's plus one which Tommy introduces as Swagger Souls and then himself against the third Eggpire member, Velvet.</p>\n<p>He felt confident with fighting alongside Hannah considering the fact that he's seen the woman fight before.</p>\n<p>(He'd never forget the day he watched Hannah beat some low level villain down and looked fabulous while doing it.)</p>\n<p>At first, he wasn't too confident on Tommy and the Swagger guy to fight with them. He has heard about the time where Tommy had fought some guy who tried to rob the Cafe from Punz but other than that, he doesn't know much about Tommy's strength. Same thing for Swagger so he was a bit worried for them.</p>\n<p>Now in his eyes, they're both a pair of badasses with how good they move as they dodged through Velvet's strings and moved to land a hit on him, which proved difficult since the guy had backup in the form of two puppets.</p>\n<p>\"Purps! Look out!\"</p>\n<p>Purpled ducked as some of Velvet's strings flew in his direction and ran forward, determined to do his part in this mess.</p>\n<p>Still though. Sheesh, how did it all even escalated to this?<br>\n________<br>\nSomething had went wrong.</p>\n<p>Something had went terribly wrong during the process.</p>\n<p>Bad had just finished conversing with Ranboo, who he had notices was starting to look tired, and Tubbo, who looked close to passing out. 'Micheal' looked at his fathers in panic and tried to keep them awake as he took occasional glances at the demon hybrid.</p>\n<p>His eyes scanned the table and watched as everyone started to look more sleepier as the seconds passed by.</p>\n<p>All except-</p>\n<p>Bad swiftly moved his head to the side as a table knife was embedded onto his chair while he stared straight into Schlatt's eyes. The loud 'thunk' rang out across the room, causing the guests to snap out of their trance.</p>\n<p>The ram hybrid scowled at him as he leaned back in his chair.</p>\n<p>\"Enough of this bullshit, ya damn egghead. I'm a busy man so I've got better things to do then this shit.\" He said before disappearing.</p>\n<p>'A ghost,' he thought to himself before he jumped out of his seat, just as a knife was buried into the cushion of his chair. He sent a kick towards his attacker, which caused the other to stumble back a bit.</p>\n<p>One moment ago, everything was fine but now? It was all going downhill.</p>\n<p>God dangit.</p>\n<p>He sidestepped when Sneeg tried charging at him as he quickly grabbed a chair and used it to shield himself from Schlatt when he punched him, which broke upon contact.</p>\n<p>Sneeg seemed to have taken the role of tank between the two and was rapidly approaching Bad at every chance he gets while Schlatt uses his ghost-like powers to his advantage whether to levitate objects to shoot at him or to go invisible so that he can get close enough to land a few hits on the demon.</p>\n<p>He had to admit, that's some pretty solid teamwork for a pair who just met each other.</p>\n<p>He dodged as a barrage of forks flew at his direction and he sprinted to the side to get some space between them.</p>\n<p>He scowls as Sneeg immediately chases after him while Schlatt prepares more projectiles to shoot at him.</p>\n<p>This is gonna take a while.<br>\n__________<br>\n\"How the fuck are you so fast!? I know cats are supposed to be agile and all but c'mon! This is just unnatural!\" Tubbo complained as he blocked Ant's attack.</p>\n<p>He chuckled to himself. \"Well, you seem pretty agile yourself since you managed to block out most of my attacks unlike those two had.\"</p>\n<p>Ant ducked right as Punz swung a candle holder at his head. He immediately grabbed onto the vigilantes arm and threw him forward.</p>\n<p>Tubbo yelped in surprise as Punz fell on top of him, causing them both to fall onto the ground.</p>\n<p>His ears flicked and his claws slashed to the space on his left, just as a soft 'vwhoop!' was heard.</p>\n<p>Ranboo brought his arms up just in time to shield himself from the attack and he gasped when he felt Ant cut through his sleeves and into his flesh.</p>\n<p>He jumped back as the cat hybrid continued to slash at him, progressively getting more aggressive each time.</p>\n<p>\"Get the FUCK AWAY FROM HIM!\"</p>\n<p>Ant felt a pair of horns as they rammed themselves onto his side, causing him to to hit the wall from the impact.</p>\n<p>He groaned in pain as he got up, wincing when he felt his ribs throbbed. He looked up to see Tubbo standing protectively in front of Ranboo with a pissed off look on his face.</p>\n<p>He growled at them as he feels his tail puff up in irritation.</p>\n<p>He felt just a bit of comfort as he felt the vines wrap around his leg to help heal his injuries, which worked since he couldn't feel his ribs throb anymore.<br>\nHis ear twitched again before he hauled himself forward, right before a golden spear embedded itself onto the wall he had leaned on.</p>\n<p>He hears Punz click his tongue in annoyance as he pulled the spear out of the wall and faced Ant again in a fighting stance.</p>\n<p>Ant grins at him in return.</p>\n<p>Ludwig ducked when a chair was thrown in his direction.</p>\n<p>He only had a second to recover before he had to duck again, this time to dodge Clover who had been launched to the wall during the struggle.</p>\n<p>He shot forward and threw himself to take cover from under a table, just as Billzo, one of the assistant cooks from the kitchen, tried to strike down onto him with a sledgehammer.</p>\n<p>Ludwig wondered for a moment on where the hell did this kid even find that.</p>\n<p>Just a second ago, things were relatively calm despite the fact that the hotel he worked in was taken over by a cult. </p>\n<p>Then, Tina's neighbour and a mix of vigilantes/heroes destroyed the front door of the hotel.</p>\n<p>A few seconds later, it was practically a battle royale within the main lobby. There was probably one happening in the ballroom too from the sounds of destruction he's hearing.</p>\n<p>He spares a glance at Billzo, who seemed to be preparing to swing his sledgehammer at him again, grabs a fallen glass bottle and lobs it at his head, which smashes upon impact.</p>\n<p>\"Holy shit! Ludwig assaulted a minor!\"</p>\n<p>\"Eryn, shut the fuck up!\"<br>_____<br>Velvet growled in annoyance as he watched Purpled zip back and forth, avoiding his wires as he proceeds to get closer and closer to him but was stopped by his puppets.</p>\n<p>Meanwhile, Tommy and Swagger had decided to double team him and took any chance they could get to hit him with almost anything within arm's reach.</p>\n<p>Hannah was pulling her own weight in the battle with some vines she had grown on her arm. Using them as if it were a whip, she opted for a more defensive form by intercepting his wires or flinging his puppets away, giving the other three some kind of opening to attack him.</p>\n<p>He's amazed on how he managed to survive for so long with these four going against him.</p>\n<p>He yelped as he jumped back, dodging Purpled's attack at the last second before sending him a kick from the back, making him stumble forward. He could've used his wires to capture him but the vigilante was pulled away by Hannah in an instant.</p>\n<p>He threw a glance at where Ant and Bad was.<br>Ant was doing well. One of the guests he had fought earlier had stayed behind, obviously hurt from the blood he had dripping from his arms. Meanwhile, the other two, Punz and Tubbo, were putting up a good fight against him but they still struggled in their fight with the cat hybrid.</p>\n<p>And Bad....</p>\n<p>He wasn't looking too good. </p>\n<p>He seemed pretty exhausted as he continues to defend himself from Sneeg and Schlatt's combos.</p>\n<p>Ant seemed to have noticed it too as his attacks were getting more and more aggressive by the passing minute, wanting to end his side quickly so that he can go and aid their leader.</p>\n<p>He didn't realize he was staring for too long before a fist had connected to his stomach. His eyes snapped forward and he was met with Tommy's eyes that glared into him.</p>\n<p>Oh for fuck sake.</p>\n<p>Velvet spat out bile from the force of the punch to his gut and stumbled back. Almost instantly, he wrapped his wires onto some of the fallen servers.</p>\n<p>Even when they're knocked out, his powers could still work on them, right?</p>\n<p>He watched as their eyes snapped open as it softly glowed red, causing him to grin. 'It worked!' he thought to himself as he pulled the wires on his fingers forward, causing the servers to launch themselves forward to attack the four.</p>\n<p>Just a little bit more.<br>______<br>They were losing.</p>\n<p>The battle wasn't at all in their favour, despite it being a 3 vs 1. Guess having the numbers advantage doesn't really matter much in this situation.</p>\n<p>Ranboo was out for a bit due to the damage Ant did on him. Though he wasn't useless by any means, having stuck to playing support instead by using his teleportation abilities to its fullest. He would move him or Tubbo into positions that could give them a slight advantage or so that they can have a moment to recover</p>\n<p>Meanwhile, Tubbo was starting to show some serious fatigue from having to tank hits from Ant. Any form of playful banter between the two were gone, now the goat hybrid was more focused on taking the cat down.<br>Speaking of him, this motherfucker doesn't look like he's taking any form of damage, no matter how hard they hit him.</p>\n<p>Punz felt himself get irritated as he shifted his golden spear into a battle axe. God this guy just does not go down easily, huh?</p>\n<p>He held the axe up to block a pair of incoming claws from landing onto him. Getting cut by claws in general is never a good experience, he knows this for sure since he owns a cat, but getting cut by Ant's claws seemed to be ten times worse.</p>\n<p>He twisted the axe's handle and threw the other off of him as Tubbo went in for the kill. Ant seemed to have sensed this and instantly moved out of the way, right as Tubbo landed a heavy hit which cracked the marble floor.</p>\n<p>The cat reacted quickly and slashed at Tubbo's throat, causing blood to spray out.</p>\n<p>OH SHIT.</p>\n<p>He grabbed Tubbo and threw him out of the way. Thankfully, Ranboo had been there to catch him and tried everything he can to stop his husband from bleeding to death.</p>\n<p>Punz turned to look at Ant with a glare on his face but stopped when he found the other wasn't there anymore.</p>\n<p>Before he could do anything about it though, he felt something slash at his throat. He swung his axe at a random direction as he felt his vision begin to black out.</p>\n<p>No.</p>\n<p>No, he refuses to go out like this.</p>\n<p>He felt his knees buckle into themselves which made him fall onto the floor as he coughed out blood.</p>\n<p>Before he passed out, he felt what seemed to be vines as they wrapped around leg.</p>\n<p>In the distance, he hears Purpled's enraged scream.</p>\n<p>Ted froze when he felt two of the thrumming heartbeats in the ballroom dip until it beats into a lower rythm.</p>\n<p>\"Yo Daffy! We need to hurry this up! We got two down and probably close to being dead!\" He yelled out as he threw a server into the wall.</p>\n<p>He heard someone curse before Quackity's voice rang out. \"Clover! Slime! You two handle the rest of the mob!\" Clover made a noise to protest it but was shut up by a fist being connected to his face. Meanwhile, Slimcecicle just yelled out a \"Got it, boss!\" before jumping headfirst into a crowd of the brainwashed zombies.</p>\n<p>\"Foolish, XD! Follow me! We need to get in! There's been some casualties!\" He ordered as he picked up a knife from the floor and began hacking away at the vines that covered the door.</p>\n<p>It didn't do much until Foolish went up to the door and singlehandedly ripped off all the vines from the door in a single flick of his wrist.</p>\n<p>Ted cackled at Quackity's deadpanned stare between the door and the vines in Foolish's hands.</p>\n<p>Though, the laughter stuttered to a stop when his hearing zones into a newer set of beating hearts and it gets louder and louder.</p>\n<p>Also, it sounds like it's coming from above the ballroom and it seemed to be apporaching very rapidly.<br>\n________<br>\n\"STOP THE FUCKING RIDE-!\"</p>\n<p>\"I CAN'T! IT'S LITERALLY FALLING!\"</p>\n<p>\"This is the last time I'm trusting either of you with a plan.\" Ponk says, gripping onto the edges of the boat for his dear life.</p>\n<p>George makes a noise of agreement as he tightens his hold on Ponk's arm.</p>\n<p>When they had arrived to the hotel, they all realized that none of them had the ability to tear down any of the vines that blocked the entrances. Sapnap had tried to burn it down but it seems like his father had expected that, making sure the vines had some kind of fire protection on it to keep them out.</p>\n<p>Dream had suggested that they go through the roof, remembering that the area around there was connected to a ventilation shaft that goes about everywhere in the hotel.</p>\n<p>But then Sapnap saw the tinted glass roof that connects to the ballroom and suggested that they break in like how they do in spy movies. One thing lead to another and they were on top of the roof from a nearby apartment complex, all sat in a boat and dropped to the the glass rooftop.</p>\n<p>Don't ask how it all escalated this badly.</p>\n<p>Anyway, Ponk sighs to himself, wondering if hanging out with the Dream Team any longer would be worth it if his braincells get burned to ash.</p>\n<p>He feels the boat hit the glass and shatters to pieces upon impact.</p>\n<p>\"BRAKES! HIT THE FUCKING BRAKES! WE'RE GONNA HIT THE FLOOR!\"</p>\n<p>\"THIS IS A BOAT! THERE AREN'T ANY FUCKING BRAKES!\"</p>\n<p>Meanwhile, George just mumbles a quick prayer with one arm still clinging onto Ponk, who was busy calculating how much energy he needs to heal stupidity and any potential injuries for when they hit the ground.</p>\n<p>\"Ah, incoming!\"</p>\n<p>The boat came to a stop as it bobbed a bit from whoever had caught them as they shifted the boat into their arms.</p>\n<p>Ponk leans over the edge to take a good look at their saviour, maybe thank him as well since he knows damn well the other three wouldn't.</p>\n<p>His eyes meets with a pair of emerald green ones as he feels the other three jump off from the boat and into the fray.</p>\n<p>\"Well, hello there.\"</p>\n<p>He decides that staying with the Dream Team could be worth it.<br>\n_____<br>\nPurpled looked up after the shower of glass rained upon them and saw a Hero, Foolish if he remembers correctly, holding onto a boat with the Dream Team in it. Oh and Ponk was there too.</p>\n<p>Wait, Ponk!</p>\n<p>Earlier Purpled had tried to heal Punz with 'Mercy' but failed since the wound just refuses to close. But Ponk's healing powers were no doubtly more stronger than his so he can definitely heal Punz and Tubbo.</p>\n<p>\"Ponk-! Oh my god! I swear if you're flirting with him! Don't deny me, I see that look on your face! You had that face in when you met AWESAMDUDE of all people!\" He yells out, already done with the world.<br>\n\"Seriously, stop trying to fuck all the heroes!\"</p>\n<p>\"I'm not fucking anyone!\" He turns to wink at Foolish. \"But that can change if you'd like.\" The golden shark, totem thing blushed at the suggestion.</p>\n<p>\"But you-! Ugh, you know what? Whatever! Just get over here and heal them!\" He motions his hands towards his unconscious sibling and the goat hybrid who was being held by his very much worried husband.</p>\n<p>\"Sure, gimme a minute!\" Ponk hops off the boat and runs up to them, hands already covered in a soft red glow. He taps on Punz's arm and Tubbo's forehead and Purpled watched as the wounds starts to fix itself up until there was no trace of it left </p>\n<p>\"And.. done! Now if you'll excuse me, we have a cult to dismantle!\"</p>\n<p>Purpled once again watches as Ponk pulls out a couple of scalpels from the pocket of his hoodie before hurling them into Ant's direction, most of them hitting their mark when the cat hybrid gave a hiss of pain.<br>\n______<br>\nThey need to retreat.</p>\n<p>Bad had concluded that from the fact that his own son and his friends when they decided to drop in from the skylight.</p>\n<p>He swiftly dodges roaring flames sent his way and Ant rushed forward, avoiding the fire and intercepting Sapnap with a slash of his claws.</p>\n<p>Gosh darn it. They haven't even dealt with the Schlatt or Sneeg yet! And now here are the Dream Team, barging into the fight!</p>\n<p>He hears Ant hiss in pain and glanced at him to see the cat hybrid pulling out some scalpels that had pierced through his fur and into his flesh.</p>\n<p>They need to leave, now!</p>\n<p>Bad quickly grabs Ant and hoists him up, warping away before their opponents could react, also not forgetting to grab Velvet as well, and went to the Egg. He focused every bit of power he had in him onto the Egg and before they knew it, the Eggpire was gone.</p>\n<p>Tubbo jolted awake, breath and heartbeat going quicker by the second. His brain was in overdrive as it began processing whatever information it managed to get and boils down to just a single thought.<br>What the fuck just happened?</p>\n<p>His hand reached up for his throat from when he felt it get slashed. He didn't feel stitches that signified it would be closed nor did he feel any sign of the wound being there.</p>\n<p>It was just gone. Like it didn't happened in the first place.</p>\n<p>He gives a screech when he gets tackled into a hug by his Oreo coloured husband.</p>\n<p>\"Oh my god, you're actually okay! Now I don't have to be the bearer of bad news to Micheal...\"</p>\n<p>Tubbo groaned and tried to push him away.</p>\n<p>\"Oh fuck off, Ranboo.\"</p>\n<p>He struggled a bit more but it was obvious that the other wasn't letting him go anytime soon.</p>\n<p>\"Let me go or I'll make you sleep outside.\"</p>\n<p>Ranboo immediately let's go with a terrified expression on his face.</p>\n<p>\"Please don't make me sleep outside. It's cold...\" He pleaded.</p>\n<p>The goat hybrid just rolled his eyes and sat himself back up again. He blinked a bit, noticing how blurry his vision was and lifted his hands to rub his eyes.</p>\n<p>The entire scene was just chaos.</p>\n<p>Siren was in the middle of the room, having a heated arguement with El Jugador. Clover was behind him and was backing up what the scarred man had said.</p>\n<p>A few feet away from them was Sneeg, who was speaking to the Captain, probably to report to her about what had happened during the entire thing.</p>\n<p>Awesamdude was by the other guests, checking over them to see if they were okay, with fellow heroes Slimcecicle and XD. Though XD mostly hovered around Tommy, the cafe owner that gives Ranboo all this sweet treats to bring home and someone Tubbo had become fond of through his husband.</p>\n<p>Wait a fucking minute, is that the <i>Dream Team</i> sneaking away in the shadows?</p>\n<p>\"Tubbo?\"</p>\n<p>Awesamdude seemed to have caught the three supervillains as they snuck out but before he can do anything about it, he was pulled over by Medic, who had Foolish's arm hooked around one of his.</p>\n<p>\"Ranboo, the fuck happened while I was out? Why are there heroes here? Why is the Dream Team here?\" He asked, glancing back at the arguement between the two heroes and vigilante, which seemed to get even more heated. Captain and Sneeg seemed to have been done with their reports and was trying to stop the arguements.</p>\n<p>\"Um, do you remember Ant, the cat guy, when he slashed you in the neck?\"</p>\n<p>\"Yeah...?\"</p>\n<p>\"Well, he did that and you kind of, almost died from it. But don't worry! Medic came in clutch and healed it all up!\"</p>\n<p>Suddenly, Sneeg's head snapped to his left and looked to be in shock, hand tugging onto the Captain's sleeves. Captain turns to look at him and mimics the look the size shifter had on his face before rushing forward.</p>\n<p>Tubbo followed where they were looking and almost cackled.</p>\n<p>Awesamdude and Foolish seemed to be wrestling that was extremely one-sided. Don't get him wrong, the creeper hybrid was a large fellow but compared to the shark totem thing that Foolish is, he was practically the size of a dwarf. Plus, it didn't seem like the other was taking his fellow hero seriously with how he's just taking it and even goofing around, which infuriates Sam even more.</p>\n<p>Medic was just in the middle of it all as he tried to calm the offending party down.</p>\n<p>\"Anything else, Boo? I feel like there was something else.\" He asked, eyes still scanning the perimeter for anything else happening.</p>\n<p>A soft scratch of wood on the marble floor was heard and Tubbo made eye contact with Dream, who had on hand on the boat and was attempting to lift it. Hell Flare and 404 was behind him, both whispering to him to leave the boat behind and that \"dude, there are heroes here! If they see us, they're gonna all wanna throw down!\".</p>\n<p>The masked man raised a finger to his lips, making a soft shushing noise before the boat dissapeared from where it was. Tubbo nodded at him before he proceeded to continue sneaking away as if nothing every happened.</p>\n<p>\"Uh, well the Dream Team fell in? There was glass falling everywhere and Foolish saw them, caught them and well, that's all I know. They just popped into the fight. Oh! You should've seen how they reacted when the Captain bursted into the doors with Siren hot on her heels. They just dove into whatever dark corner the room had. I think they escaped.\"</p>\n<p>\"HEY!\" He hears Siren cry out.</p>\n<p>Suddenly, all attempts at stealth was abandoned as the three proceeded to make a run for it instead. Siren gave chase, seconds after.</p>\n<p>\"Ah, now they're escaping.\"</p>\n<p>Tubbo felt a giggle escape his mouth before it turned into a full blown laugh.</p>\n<p>\"Haha.. ahh.. Best night ever. Ten out of ten, would do it again some time. Prefereably without being slashed in the neck and almost dying.\"<br>_____<br>Sapnap snickered as he scaled up a wall of a building until he reached the top before continuing his run on top of the roof.</p>\n<p>He hears a faint sound of George as he teleports around and the loud sound of fireworks as Dream soars on by with a pair of wings on his back.</p>\n<p>\"Stop fucking running already!\" He hears Phantom screech out.</p>\n<p>\"Dude, one of the parts of being a villain is to not get caught by heroes. What kind of supervillain would we be if we get caught by you?\" Sapnap retorts as he jumped across the gap between two building he was running on.</p>\n<p>He hears a soft thud behind him, causing him to glance back a little before speeding up some more. The grin on his face becoming more feral looking by the second.</p>\n<p>Another day, another win for the Dream Team.</p>\n<p>Tommy woke up that morning and decided he was gonna ignore what had happened yesterday. Maybe indulge in a bit of a lazy day to get his shit together.</p>\n<p>He carefully removed Purpled's arms that draped over him and slowly moved himself from the floor where Punz laid on. Blankets piled under the white clad vigilante and a few pillows scattered around. Tommy grabbed one of the blankets and draped it over him before continuing his way out.</p>\n<p>He reached the kitchen and went straight to the fridge, taking out some ingredients he needed to make breakfast.</p>\n<p>Grabbing a nearby pan, he heated up some oil and placed some sausages in to cook while he mixed some eggs together to make an omelette.</p>\n<p>\"Hi Tommy!\"</p>\n<p>Tommy glanced behind him for a second before he went to chop up some spinach and a couple of cherry tomatoes to add to the omelette. \"Ayup, Drista.\" He greeted as he moved to grab another pan and flipped over the sausages from before.</p>\n<p>\"Staying for breakfast?\" He asked as he dumped the chopped vegetables from earlier into the pan.</p>\n<p>He hears her give a soft hum in thought before answering. \"Nah, not today. Things are getting a bit chaotic at HQ and I have to be there early or else the higher ups are gonna get nosy.\" She said, adding a soft sigh at the end.</p>\n<p>\"Oh well, sucks for you then.\" He pours the egg mixture into the pan along with the vegetables.</p>\n<p>It stayed silent for a bit before Tommy glanced behind him again and saw the look on Drista's face. Rolling his eyes, he asked. \"Anything I can do to help?\" He asked in fake annoyance.</p>\n<p>\"Lunch box! Lunch box!\" She sang as her fists beat the surface of the table.</p>\n<p>\"Lunch box it is then.\"</p>\n<p>Drista whooped in joy as he busied himself in folding the omelette.<br>\n____<br>\n\"So, why are you here anyway?\" Tommy asked as he plated Punz's portion of the food. \"Not that I'm complaining, by the way.\"</p>\n<p>As Tommy had been finishing up his cooking, he and Drista chatted to catch up with each other. After all, it had been over a month or so since they've sat down and chilled with each other.</p>\n<p>The only time they had a conversation is when Tommy needed information about what was going on in HQ or when Drista called in favours to have him send pastries and drinks to her during work.</p>\n<p>\"Well, I mostly came around to check how you were doing after the whole, ya know, cult bullshit from yesterday.\" She started. He turns his back to face her and watches as she propped her shoulders onto the kitchen counter.</p>\n<p>\"Yeah, you guys lucked out because that cult was a serious problem. Did you know that their brand of brainwashing is a permanent infection type?\" She said as Tommy placed the plates onto the table.</p>\n<p>\"Wait, seriously?\" He said before moving towards his cabinets to search for a cup for use.</p>\n<p>\"Yeah! We have this one person who was infected by it months back before this. The labs did all they could to find out what the source was and if it was curable.\" Her head leaned into her hands. \"They found nothing and it wasn't curable in any way. Doesn't help that the guy is straight up crazy. Somehow, he managed to escape his restraints and killed two of the scientists working on his case.\"</p>\n<p>\"I also heard that Punz and some guy named Tubbo almost died during the entire thing. So I wanted to check on him too.\"</p>\n<p>Right as she said that, Punz walked into the kitchen, yawning.</p>\n<p>\"You wanted to check on who?\" He asked as he stretched.</p>\n<p>\"Is it true that you almost died last night?\" She asked. Punz just shrugged. \"Yup. Hadn't Medic been there, I would've been a goner for sure.\"</p>\n<p>Punz walked to the table and took a seat, Purpled trailing just a bit behind him.</p>\n<p>\"Good morning you two.\" Tommy said, placing down three cups and poured in some orange juice.</p>\n<p>\"Morning Toms.\" Purpled greeted back.</p>\n<p>\"Good morning. Thanks for breakfast, by the way.\" Punz said.</p>\n<p>A soft 'ping!' rang through the room. Drista fished out a phone from her pocket before standing up. \"Welp, that's my cue. See ya!\"</p>\n<p>\"I'll have Jack deliver your lunchbox later. So keep an eye out, 'kay?\" Tommy said as he sat down. Moments later, Drista merely disappeared from where she stood.<br>\n_____<br>\n\"Hi Foolish-!\"</p>\n<p>She froze in place at the image in front of her.</p>\n<p>\"Ew! Ew! Gross! Foolish, in your personal office too!? Couldn't you have kept it in your pants!? Also, MEDIC!? As grateful as I am that you saved my friend from dying, that does not give you the excuse to fuck my brother!\"</p>\n<p>\"Wait, Drista! I can explain-!\"</p>\n<p>\"Hi Drista!\"</p>\n<p>\"Sam! You too!? I thought you HATED Foolish! Why the fuck are YOU here!?\"</p>\n<p>\"Drista-\"</p>\n<p>\"No! No! I'm done with this kinda shit. It's bad enough that XD simps for that 404 guy! No, I'm out!\"<br>\nShe storms out of the room, leaving the three behind.<br>\n____<br>\n\"Villain fuckers, all of you!\" Drista yelled as she kicked down the door to XD's office.</p>\n<p>He merely glanced up at her before going back to the papers on his desk. \"Knocking is preferable but apparently, you're too mad for that, are you?\"</p>\n<p>He shuffled some of the papers and placed down his pen.</p>\n<p>\"Where's mom?\" He hears her ask, followed by the soft sound of fabric. He looked up and saw her sitting on one of the sofas by the wall.</p>\n<p>\"She's on her way. Apparently, someone from the Board decided to tag along with her so she's gonna take a bit to get here.\"</p>\n<p>\"Which one?\"</p>\n<p>He looks at her with a deadpanned expression. \"Westley.\"</p>\n<p>Drista groans, loud and clear for him to hear. </p>\n<p>\"Ugh, I can't wait for this to end... Why couldn't it have been Stampy? I actually like the guy...\" She mumbled, just as Foolish walked into the room. She turns to him with a slight glare which he responded with a nervous chuckle.</p>\n<p>Okay so let me cut through the chase here.</p>\n<p>I'm gonna be discontinuing this fic as well as Voices of a Thousand but don't worry! I plan to rewrite it all with some brand new plot.</p>\n<p>Things were... Tough for the past year or so which just made me lose my inspiration to write.</p>\n<p>Still, now I'm back and I'm hoping to make a break for it! :D</p>\n<p>I'll see ya in the new book!</p>\n<p>The fic's rewrite is up now! Please enjoy &gt;:3!</p>"
}