{
  "id": "32903653",
  "url": "https://archiveofourown.org/works/32903653?view_full_work=true",
  "author": [
    "TheResurrectionist"
  ],
  "title": "smokin' in the boys' room",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Batman - All Media Types",
    "Justice League - All Media Types",
    "Superman - All Media Types"
  ],
  "relationships": [
    "Clark Kent/Bruce Wayne"
  ],
  "characters": [
    "Bruce Wayne",
    "Clark Kent",
    "Alfred Pennyworth"
  ],
  "additional_tags": [
    "Hurt/Comfort",
    "Blood and Injury",
    "Secret Identity",
    "Identity Porn",
    "Not Beta Read",
    "Bruce Wayne is Batman",
    "Clark Kent is Superman",
    "a little too explicitly",
    "Non-Graphic Violence",
    "References to Drugs",
    "Non-Consensual Drug Use",
    "Hurt Bruce Wayne",
    "Crack Treated Seriously",
    "Secret Identity Fail",
    "Bruce Wayne Needs a Hug",
    "Psychological Trauma",
    "Protective Clark Kent",
    "truth justice and the americ-- oh hey are u good bro?",
    "bruce let himself get hit for the job and on-duty himbo clark kent will not stand for it",
    "on duty himbo clark kent",
    "they’re idiots your honor",
    "only one of them is pretending to be tho",
    "Clark’s a little confused but he got the spirit",
    "bruce would like a resolution to this situation that doesn’t involve being mocked by his teenagers",
    "Alfred racks an AK47 and says pull up bitch",
    "Dubiously Consensual Blow Jobs",
    "blowjobs to distract your partner from the secret identity fail ur about to commit",
    "Closet Sex",
    "Bad Flirting"
  ],
  "language": "English",
  "series": "",
  "published": "2021-07-29",
  "completed": "2021-08-13",
  "words": "6,522",
  "chapters": "3/3",
  "comments": "290",
  "kudos": "7,309",
  "bookmarks": "879",
  "hits": "54,260",
  "summary": "<p>Bruce Wayne -- billionaire playboy, owner of, at most, three brain cells -- beaten up at his own charity gala. Bruce Wayne, CEO of Wayne Enterprises out of nepotism and dumb luck, whose business wasn’t touched by corruption purely because of incompetence -- Bruce Wayne, airheaded and still generous, still kind, bloody in a stall and trying to hide it. </p>\n<p>His hand clenched on the stall door, crumpling it between his fingers. His eyes weren’t burning yet, but barely. </p>\n<p>“Who did this to you?”</p>",
  "notes": "<p>Unbeta'd. Written in one sitting. Thanks to audreycritter for some amazing dialogue ideas in this first chapter, they made me laugh trying to imagine them.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Thanks for bearing with me! I decided I liked this universe too much to leave it at two chapters, so surprise!</p>\n<p>Thanks so much for your kind words! Here's the last chapter. </p>\n<p>I kind of got a little carried away...also, if you'd like to avoid some surprise smut, skip Bruce's section when they're in the closet. Ha!</p>\n<p>Let me know what you thought! :)</p>",
  "text": "<p>Clark pushed through the crowd, camera slung over his shoulder, making a beeline for the bathrooms. </p>\n<p>Not necessarily having to pee didn’t preclude <em> Clark Kent, bumbling idiot, </em>from wiping sweaty palms on cheap polyester and nervously eyeing the exits, mumbling about too much water and dashing off. </p>\n<p>It was a great way to get out of unfortunate conversations (<em>how is Lois doing, anyway? I heard you aren’t working together as much since--) </em>and avoid unfortunate people (Lex Luthor, society hags who pinched rear ends indiscriminately). </p>\n<p>Considering he’d used it twice already tonight, he was long overdue for actually making an appearance in the bathroom. </p>\n<p>Eyeing the overcrowded bathrooms near the main ballroom, he diverted toward the catering entrance, smiling at the staff until he found a quiet men’s restroom tucked into the back corner. </p>\n<p>With a sigh, he pushed the door open, relieved to find it empty. Glancing at himself in the mirror, he considered leaving entirely. He’d gotten enough photos, and--</p>\n<p>A quiet moan interrupted that line of thought, drawing him short. He hadn’t heard another heartbeat--hadn’t even been <em> listening </em>for one, considering how far out of the way the bathroom was, but--</p>\n<p>He tilted his head, smelling blood. Suddenly, <em> Clark Kent, mild-mannered reporter </em> fell away. Someone was hurt. Someone was in <em> pain. </em></p>\n<p>Following the scent, he walked past the stall doors, one by one. Finally coming up on the handicap stall, he braced himself and opened it. </p>\n<p>A dazed-looking Bruce Wayne blinked up at him, covered in blood. </p>\n<p>He was slumped against the wall, foot braced on the toilet. A broken champagne glass was scattered in pieces on the floor around him. </p>\n<p>“Mr…” Clark swallowed, throat suddenly dry. “Mr. Wayne?”</p>\n<p>The billionaire winced, eyes closing briefly. One of them was already mostly shut, swollen by what must have been an impressive hit. Blood was dribbling from his lips, his ears...his nose...</p>\n<p>“I…” Wayne coughed, holding his ribs gingerly. Blood continued to pour out of his nose--clearly broken--as he spoke. “S’not the worst position ‘been found in...”</p>\n<p>Clark stared, at a loss for words. </p>\n<p>Bruce Wayne -- billionaire playboy, owner of at <em> most, </em> three brain cells -- beaten up at his own charity gala. Bruce Wayne, CEO of Wayne Enterprises out of nepotism and dumb luck, whose business wasn’t touched by corruption purely because of incompetence -- Bruce Wayne, airheaded and still generous, still kind, bloody in a stall and trying to <em> hide it.  </em></p>\n<p>His hand clenched on the stall door, crumpling it between his fingers. His eyes weren’t burning yet, but barely. </p>\n<p>“Who did this to you?” he asked, deceptively quiet. Sheer rage boiled in his chest. </p>\n<p>\n<em> It wasn’t right.  </em>\n</p>\n<p>“What?” Wayne asked, sluggish. His eye had fully swollen shut, turning an ugly purple shade. “M’fine. Jus’...tripped.”</p>\n<p>Clark released the stall door, kneeling carefully in front of the billionaire. He shrugged out of his cheap sport coat, wrapping it into a pad and pressing it gingerly to the other man’s face. </p>\n<p>“You’re bleeding,” he said, “Mr. Wayne...you need to go to a hospital.”</p>\n<p>Wayne smiled, an awful grimace of bloody teeth and swollen lips. </p>\n<p>“‘told you. M’fine,” he patted at his suit jacket, looking around, “Whr’s m’phone?”</p>\n<p>“You need medical services, Mr. Wayne,” Clark said, panicking as the other man made to get up, “You’re bleeding and your heart is going a million miles an hour--” </p>\n<p>Wayne squinted at him, pushing nominally with the foot braced against the toilet in an effort to get up. </p>\n<p>“Oh...you’re takin’ my...pulse?”</p>\n<p>Clark immediately moved his hand to Wayne’s wrist, pretending to take his heart rate. “Y-<em> Yes, </em>Mr. Wayne. And I’m very concerned.”</p>\n<p>Wayne, bless him, looked too concussed to argue. He blinked his one good eye, clearly trying to put the pieces together. </p>\n<p>“S’just a...disagreement,” he mumbled, glancing at the broken champagne glass remnants. With a moan, he tried to curl up against the wall, making himself smaller. “M’fine.”</p>\n<p>Clark saw red as soon as the pitiful noise registered, reaching forward in an aborted attempt to help. </p>\n<p>“Who was it?”</p>\n<p>Wayne stared at him, not understanding the question. </p>\n<p>“You’re pretty,” he said in a far-off voice, staring up at him, “y’wearing...contacts or s’mthing…” </p>\n<p>Clark felt his face flush, putting a hand up to his glasses. “I--”</p>\n<p>His now <em> slightly-melted </em>glasses. He blinked away the fire in his eyes, pulling off the glasses before Wayne could notice. </p>\n<p>“Red’s your color...” Wayne continued dreamily, “...handsome w’the hair. M’all red now too…”</p>\n<p>Clark watched as Wayne’s head drifted toward the wall, resting against it for a moment. </p>\n<p>“Mr. Wayne, are you...drunk?”</p>\n<p>“Not...on purpose.” Wayne said, sounding dejected. It was hard to tell, muffled against the wall. “Think I was...drugged.”</p>\n<p>He waved vaguely at the floor, where the champagne glass had shattered. There was glass embedded in his palm, slowly leaking blood. </p>\n<p>So they’d drugged him, waited for him to feel sick, and then tailed him to the bathrooms. Effective. Quiet. Easy exit where they wouldn’t be seen. </p>\n<p>Whoever it was, Clark had a few questions. </p>\n<p>“You’re okay now,” he said, placing a hand on Wayne’s shoulder, rubbing slow circles. “I’m going to go call 911, and then I’m going to find whoever did this.”</p>\n<p>More than a few questions, perhaps.</p>\n<p>If his comm was still working, Bruce was pretty sure Alfred would be laughing at him. </p>\n<p>His evening was going swimmingly. Playing <em> Brucie </em>never got easier, but at least it was familiar. </p>\n<p>He went through the motions at the entrance--smiled at the cameras, waved at the children in the crowd, said a few words about poverty--and dove into the crowd, waiting for his mark. </p>\n<p>He’d thrown back the champagne when it was handed to him, playing into the part for the elder society ladies with a wink that left them tittering. Never thinking about what could’ve been in it. </p>\n<p>Lying against a bathroom stall with an anxious Superman, covered in blood, and the proud owner of some newly-cracked ribs, he’d clearly learned his lesson. </p>\n<p>At least he’d stopped hallucinating. Half of the horror of the whole night wasn’t even from the beating -- it was the way his father’s face stared down at him from the mirror over their shoulders, cold and disapproving. </p>\n<p>\n<em> flecked with his mother’s blood-- </em>\n</p>\n<p>The hits hadn’t mattered, then. He could take them. It was the <em> after </em>that pierced him to his core, shivering on the floor. </p>\n<p>And how fortuitous was it that Superman himself had chosen the same bathroom, entering just as he’d been released from vivid nightmares of death and blood. </p>\n<p>Superman, who was still desperately trying to be <em> Clark Kent, Kansas reporter, </em>despite the clear gouges he’d left in the bathroom stall door. </p>\n<p>Despite the fact that he’d melted his own glasses off his face, even with Bruce’s half-coherent hints and nudges. </p>\n<p>He was holding onto his secret identity by a thread. There was no way he could let the idiot leave the bathroom. </p>\n<p>Above him, Kent was saying something about 911, going on intently about justice and <em> finding who did this to you</em>. Internally, Bruce rolled his eyes, weighing his options. </p>\n<p>He really was quite handsome without the glasses.</p>\n<p>Face screwed up in an expression of righteous contempt, and therefore not looking at him, it was almost too easy to slip a hand around the other man’s wrist, blinking up at him coquettishly. </p>\n<p>Or, as coquettish as he could be with one working eye and potentially missing teeth. </p>\n<p>“Please...don’t leave me,” he said, letting a slight tremor into the words, “D’n wanna be alone…”</p>\n<p>Alfred would be in tears. He’d teased him enough about his obsession with Superman. To hear him <em> beg… </em></p>\n<p>Maybe it was a good thing they’d smashed the comm in his ear. Maybe it was worth the ruptured eardrum, after all. </p>\n<p>Kent, to his credit, immediately placed himself in between Bruce and the door, puffing out his chest. </p>\n<p>“I won’t leave you,” he vowed, glancing down at the hand he had on his wrist. His cheeks pinked, and he looked away, breath hitching. </p>\n<p><em> Tactile. Good. I’ll remember that. </em> </p>\n<p>“Thank you,” Bruce said, meaning it. He trailed off, glancing down at the floor. Was it actually spinning? “M’gonna nap now.”</p>\n<p>“Okay, I’ll--wait, what?”</p>\n<p>Knowing Kent couldn’t track down people and blow his secret identity with his arms full, Bruce smiled, and gladly passed out against the other man’s chest. </p>\n<p>Clark was panicking. </p>\n<p>Bruce Wayne -- <em> the </em>Bruce Wayne, and he still couldn’t quite believe that -- had given him the most charming, bloody smile, and passed out straight into his arms. </p>\n<p>He shifted awkwardly so the other man’s head was cradled against his shoulder, careful not to jostle his injuries. Wayne snuffled against his shirt, smearing blood against the collar. </p>\n<p>It was almost...endearing. </p>\n<p>The urge to leap up and chase after Wayne’s mysterious attackers battled furiously with his desire to hold the billionaire close, sheltering him from the outside world. From those who would do him further harm. </p>\n<p>He couldn’t leave him. Not like this. Not alone. But the press Wayne would get if he called 911 would be...obscene. </p>\n<p>And, if he was honest, the desire to protect the man in his arms extended beyond this bathroom. Wayne...<em> Bruce </em> ...didn’t deserve to have photos of his bruised face on the front of the <em> Gotham Gazette. </em>He didn’t deserve to be mocked and abused further. </p>\n<p>Clark paused for a moment, listening to Bruce’s lungs and heart. Despite the bruising to his chest, his airway sounded clear. His pulse was still elevated, but not dangerously so. </p>\n<p>\n<em> Lucky man... </em>\n</p>\n<p>He was still struggling to figure out what to do next when the bathroom door flew open, three masked men stepping in with guns drawn. </p>\n<p>“Fuck, someone fou--”</p>\n<p>“--need him to open the phone--”</p>\n<p>“I don’t have room for extras!”</p>\n<p>Clark blinked up at the three figures arguing over him, at a loss for words. </p>\n<p>“...hi?” </p>\n<p>One of the men gestured with the gun. “Give us Wayne.”</p>\n<p>He tightened his arms around the billionaire, puffing his chest out and hoping it made him look more intimidating. “Absolutely not.”</p>\n<p>Without warning, the man who’d spoken raised his gun and shot him in the shoulder. Clark winced as the bullet bounced off him, whizzing around the room. </p>\n<p>There was a confused silence. </p>\n<p>“Um...ow?” he wiggled his arm slightly, screwing up his face. “That really hurt.”</p>\n<p>He was pretty sure the three men were gaping under their masks. </p>\n<p>“Must have grazed me,” Clark said quickly, panicking and grasping for a lie, “<em> wow, </em>so weird how ricochets work, am I ri--”</p>\n<p>A taser appeared out of nowhere, leveled at his chest. He curled around Bruce even further, debating simply dropping the pretense entirely, worried for the smaller man. </p>\n<p>But a taser meant they wanted them alive. And if they were alive, they could escape. And, with Bruce safe, Clark could finally deal with them on his own. </p>\n<p>The taser button depressed, sending out the prongs. With a sigh, he let them hit his chest, shaking his arms and dropping Bruce as gently as he could onto the floor, miming a seizure. </p>\n<p>As the taser clicked off, he made a big show of slumping over, eyes falling shut. Above him, he could hear the three masked men approach, stepping over his legs.  </p>\n<p>“Did he just...pass out?”</p>\n<p>\"...yeah, he did.\"</p>\n<p>“Fuckin’ weirdo.”</p>\n<p>Alfred parked behind a suspiciously-clean dumpster, narrowing his eyes. The back door to the kitchens was wide open, swinging on its hinges. </p>\n<p>Before he could exit the Rolls-Royce, a white van pulled out from the loading bay, tires screeching as it sped toward the mouth of the alley. </p>\n<p>He looked at the tracking program on his phone, sighing. The bright triangle that indicated Master Wayne’s last known location remained in place, a few hallways inward and to the left. </p>\n<p>Alfred had a sinking, inevitable feeling Master Wayne was no longer there. </p>\n<p>“Off we go, then,” he said to himself, starting the car. “Another kidnapping. And he does this on <em> purpose</em>.”</p>\n<p>Bruce woke up, to his surprise, somewhere that wasn't Kent’s arms. </p>\n<p>He groaned as his shoulders were tugged back, wrists bound with something flat and plastic. <em> Zip ties.  </em></p>\n<p>\n<em> So they came back.  </em>\n</p>\n<p>Since he’d dropped blatant hints about WE stock info on his phone for the past three excruciating weeks, hoping to identify them, it was really his own damn fault he’d been targeted and beaten to a pulp. The goal of the night, even. </p>\n<p>Was it his smartest plan? Absolutely not. Had he planned on being drugged and left to hallucinate in a bathroom until Superman stumbled onto him? No.</p>\n<p>The idiots being unable to crack a simple phone passcode on the dummy iPhone hadn’t been part of the plan, either. He’d made it so easy for them -- <em> Brucie </em>had even hinted about the code being something “personal” and “formative for me” in a recent interview. </p>\n<p>Five minutes after being plugged into their computer system, the iPhone was set to fry their servers and infect any connected CPUs with a Trojan he’d designed specifically for their type of financial systems fraud. </p>\n<p>He had no love for the big banks and stock traders in Gotham, but the phantom dips and crashes had targeted the easiest victims -- bankrupting small businesses, 401k’s, and devaluing nonprofit healthcare and provider stock shares.</p>\n<p>Victims, for the most part, who couldn’t fight back. </p>\n<p>And now, because he’d underestimated how stupid Gotham criminals could be, he was tied to a chair, beaten, and his entire plan was worthless. </p>\n<p>Somewhere, Jason was laughing at him. <em> Hard.  </em></p>\n<p>He forced his eyes open, groaning against the sudden light. Next to him, also ziptied to a chair, Clark Kent was doing a lukewarm impression of someone waking up from unconsciousness, squinting at the lamp hanging between them. </p>\n<p><em> Could this get more cliché, </em> Bruce thought, glancing around the basement they were trapped in. <em> All we need is a table full of shiny knives and a leaky pipe-- </em></p>\n<p>The fact that Superman had stayed with him, had cared enough about his safety (and, thank the lord, his own secret identity) to play along with their captors was...heartwarming. Adorable, even. </p>\n<p>There was a small voice inside of him, half-lucid from the drugs still, that insisted Clark Kent looked <em> good </em>tied up to a chair and clearly disheveled, but he pushed it aside, taking stock of their situation. </p>\n<p>He had to get them to plug the phone into the computer without realizing it was a trick, and he had to do that in a way that didn’t jeopardize his own secret identity, all while playing the part of the ditzy billionaire. </p>\n<p>With the added concern of keeping Kent from giving up his own secret. Considering the other man seemed to <em> want </em>to be accidentally unmasked, it was an additional stressor he didn’t need. Not while still concussed. </p>\n<p>“Hey...you’re okay…”</p>\n<p>Bruce turned, spotting Kent leaning toward him eagerly. His eyes were wide, full of sincere desire to help.</p>\n<p>He’d seen the expression a million times in the <em> Daily Planet’s </em>coverage of Superman. Generally when he was comforting distressed civilians. </p>\n<p>Bruce wasn’t a distressed civilian -- far from it -- but the motion was appreciated. </p>\n<p>“What...happened?” he groaned, a part of him genuinely curious. “Where are we?”</p>\n<p>“Three men barged into the bathroom after you passed out,” Kent said, <em> way </em>too much Superman in the way his chest puffed out as he recounted their ordeal, “They tased me and then I woke up here...with you.”</p>\n<p>\n<em> Oh, Jesus Christ.  </em>\n</p>\n<p>“I thought tasers didn’t knock you out?” he asked, almost afraid to hear what Kent would answer with. </p>\n<p>“Oh! Um, they tased me,” Kent exclaimed, eyes darting from side to side, “And then they kicked me in the head! Haha. Forgot to mention that!”</p>\n<p>Bruce sighed internally. Externally, he put on an expression of mild concern, voice rising an octave. “Are you <em> okay?  </em>You must be bleeding!”</p>\n<p>It was almost like grilling Dick on a hastily-constructed cover story. But Dick had been eight at the time, and a far, far better liar. </p>\n<p>Kent winced. “It’s--uh. It’s on the back of my head. Can’t even see it.”</p>\n<p>“Oh...okay.” </p>\n<p>Playing airhead <em> Brucie </em> was taking a lot more out of him than usual. It was probably because of the concussion -- symptoms Kent <em>should </em>have been exhibiting if he’d thought his lie through. </p>\n<p>“Did they say anything when they came back?”</p>\n<p>Kent flushed, looking sheepish. “Just something about a phone, and getting it open.” </p>\n<p>\n<em> Of course.  </em>\n</p>\n<p>“Do you see any way to get out? I don’t want to be here when those guys get back.”</p>\n<p>“Umm, hmm,” Kent looked around the room, then widened his eyes comically at the far corner, “Oh my gosh! Look over there!”</p>\n<p>Bruce obliged with a deep, suffering internal sigh. He pretended to ignore the sound of Kent snapping his zip ties. “What? I don’t see anything?”</p>\n<p>“I thought I saw a rat,” Kent twisted in his seat, holding up a freed arm in poorly-feigned shock, “Wow! Look, I got one of my hands free!”</p>\n<p>If Kent hadn’t been in the room, Bruce would have been out of the zipties as well. But unlike the other man, he was <em> actually good </em>at maintaining a secret identity. </p>\n<p>“Think you can get the other one out?”</p>\n<p>Bruce politely ignored the second cracking noise. Kent triumphantly held up his other freed arm. </p>\n<p>“Yup!”</p>\n<p>\n<em> It’s going to be a long night... </em>\n</p>\n<p>Clark quickly stood up, moving across the room to Wayne. He bent down, reaching to help the other man out of his own zipties. </p>\n<p>For a second, he thought he saw something predatory flash in Wayne’s eyes, gone as quickly as it’d appeared. The billionaire gave him a guileless smile, teeth still streaked with blood. </p>\n<p>“Crazy how you found something to break the zipties with. I didn’t even see anything in here!”</p>\n<p>Clark panicked briefly, then mimed holding a knife as he reached behind Wayne, snapping the plastic ties with a pinch of his fingers. His smile wobbled briefly as he looked back down at the other man. </p>\n<p>“Guess it was my lucky day,” he said, feeling his cheeks redden slightly. “<em>Anyway, </em>we should probably escape.”</p>\n<p>\n<em> And once you’re safe, I’m coming back... </em>\n</p>\n<p>Wayne nodded, glancing at the door seriously. It was almost cute to watch him screw up his face, rallying his three brain cells to think of a plan. “We need to figure out where we are, and then look for an exit.”</p>\n<p>Clark could see through walls, so the point was moot, but he digressed. “Right. Do you think they’ll notice us if we’re gone?”</p>\n<p>Wayne winked at him, standing slowly. “Not if we’re quiet. And fast.”</p>\n<p>Heat curled through his gut, snagging his attention. Clark shoved the attraction down, willing himself to focus. </p>\n<p>“Okay. Let’s go.”</p>\n<p>If he’d been anyone else other than <em> Brucie Wayne </em>right now, he was sure Kent would’ve caught on. </p>\n<p>Stumbling into the hallway, he’d made himself giggle, catch Kent’s arm, and flirtatiously declare that the reporter was a “good luck charm” and that only his “impeccable bravery” could lead them to safety. </p>\n<p>Perhaps he was laying it on a bit thick -- <em> Brucie </em>might not know what “impeccable” meant, but it seemed to shore up Kent’s shoulders. Which was good, considering he was Bruce’s only source of intel in an unfamiliar location. </p>\n<p>Despite this, Kent blatantly using his X-Ray vision in front of him, confident that he wasn’t intelligent enough to notice, rankled more than a little. A small <em> child </em>-- not even one he’d trained -- could tell something was going on. </p>\n<p>If anything, it made the charade a little easier on his end. All he had to do was giggle, pause at a hallway, and run a hand down Kent’s arm, teasing. </p>\n<p>“Left or right?” he asked, deep down hating -- <em> hating </em>-- that Alfred would probably link up with them while he was still deep undercover like this. </p>\n<p>Kent paused, scanning the corridor with distant eyes. “Left. I think there might be an exit up ahead.”</p>\n<p>Internally, Bruce rolled his eyes. Externally, he widened them, looking aghast. “How do you know?”</p>\n<p>Kent blinked, obviously not prepared -- <em> still </em>-- to be questioned on the source of his miraculous information. “I...uh…”</p>\n<p>Bruce let him flounder, listening carefully as he let his own gaze go distant. Kent probably wouldn’t even notice -- <em> Brucie </em>was always sort of living in his own world. </p>\n<p>If he wanted to escape with the mission completed, he still needed to get them to plug in the dummy phone. Short of walking into their tech room and plugging it in himself, that left him with limited options. </p>\n<p><em> Especially </em> if he had to convince Kent to come with him, if only to preserve the idiot’s tenuous grasp on his secret identity. Surely, with <em> Brucie </em>safe and sound somewhere, the idiot would probably fly right back to the warehouse without even changing his clothes. </p>\n<p><em> There. </em>He could hear voices down the hallway to their right. Guards patrolling, most likely, which meant wherever they’d put the phone, it was nearby. </p>\n<p>Now to convince Kent to go that way. </p>\n<p>“I think we should go right,” he pressed, tugging on Kent’s arm. “I have an <em> idea</em>.”</p>\n<p>Kent blushed at his overly flirtatious tone, as he had been all night, then looked conflicted. Without giving away his powers, he couldn’t exactly make an argument one way or the other why they couldn’t go <em> Brucie’s </em>direction. </p>\n<p>Bruce prayed that it stayed that way, and Kent didn’t take the risk of revealing himself, but he didn’t have high hopes. </p>\n<p>“Awesome. Let’s go!”</p>\n<p>Clark felt a twinge of nervousness up his spine as Wayne led them <em> directly toward </em> the men who’d kidnapped them, hanging off his arm and doing so much <em> insinuating </em>with his eyes, Clark was worried he’d break something. </p>\n<p>It was almost like Wayne <em> wanted </em> them to get caught. He shook his head, dismissing that thought entirely. If anything, Wayne probably thought he was <em> helping.  </em></p>\n<p>Which was, frankly, adorable. He’d never sensed outright maliciousness from Wayne, only a desire to help others. It wasn’t the billionaire’s fault his worldview was so...limited. </p>\n<p>Now, however, impressively recovered from his earlier injuries, Wayne seemed to be teasing the thread of attraction between them, flirting in between every breath until Clark was flustered enough to stop paying attention to their surroundings. </p>\n<p>When they were a few rooms away from where the kidnappers seemed to be set up, he fought through the haze of embarrassment and lust, shaking his head. </p>\n<p>“We should turn back. This definitely isn’t the way out,” he protested, looking around. “We might get caught again.”</p>\n<p>Wayne shrugged, looking around without a care in the world. “I need to find my phone. Pretty sure it must be around here somewhere.”</p>\n<p>“Wait,” Clark said, actually surprised, “we’re looking for your <em> phone? </em>”</p>\n<p>“I need it,” Wayne said, like it explained everything. For him, it almost did. “Why do you look upset?”</p>\n<p>“<em>We </em> need to <em> escape</em>,” Clark said, voice rising, “It’s not safe here!”</p>\n<p>“Shhhhh,” Wayne said, grabbing his bicep. “Come here. I think I heard something.”</p>\n<p>He let the billionaire shove him into a small closet, closing the door behind them. To Clark’s astonishment, two men walked down the hallway a second later, clearly patrolling. </p>\n<p>He hadn’t even thought to listen to them, too busy being shocked by Wayne’s materialism. It was just a <em> phone </em> -- Wayne could buy the entirety of Apple as simply as normal citizens bought new iPhones. <em> Several times over.  </em></p>\n<p>They waited until the footsteps passed in silence. Once Clark was satisfied they were far enough away, he reached for the door.  </p>\n<p>Wayne caught his wrist, shaking his head. </p>\n<p>“Not yet.”</p>\n<p>“We can’t stay in here forever,” Clark said, anxiety growing, “We need to--hey. What are you doing?”</p>\n<p>Wayne had sunk to his knees, looking up at him imploringly through his lashes. His lips were pursed, heat simmering in his eyes. </p>\n<p>“Think you can stay quiet?”</p>\n<p>Keeping Kent distracted and somewhat willing to adhere to his plan had been fairly easy, so far. </p>\n<p>Yet, as they clearly stumbled closer to the people Kent wanted to “protect” him from, his resolve had strengthened, protectiveness flaring in the way he held his shoulders, in the way he gazed at Bruce. </p>\n<p>It wasn’t enough to distract him from the overall plan, but the tension between them seemed to <em> burn </em>for a moment, as Bruce considered Kent’s position -- that he was something to be protected. Cherished, even. </p>\n<p>It would be laughable to anyone back at the Manor, but that concern caught at something within Bruce, tugging at him. Something primal. </p>\n<p>It was almost too easy to kneel in front of the other man, mind whirring through a million other ways to distract the reporter other than this. </p>\n<p>No, he wanted to. He really, really kind of did. </p>\n<p>“Think you can stay quiet?” he asked, looking up and knowing what kind of picture he made, pupils dilated and lips slightly open. </p>\n<p>Kent immediately went beet red, opening his mouth. No sound came out, and he closed it a moment later, clearly trying to find words. </p>\n<p>Bruce let a hand drift across the front of Kent’s pants, teasing. “You don’t have to say yes…”</p>\n<p>“<em>Wayne </em>--”</p>\n<p>“Bruce, please,” he said, letting his voice deepen. Not too close to the Batman’s growl -- that would be too risky -- but close enough. “Just a yes or a no, Kent…”</p>\n<p>“Clark,” Kent insisted, swallowing hard. His throat worked up and down. “C-call me Clark.”</p>\n<p>“Clark,” Bruce said, humming around the name. He looked up again. “Yes?”</p>\n<p>The other man swallowed again, eyes wide and pupils dilated. He was breathing heavily, despite the lack of need for it. “Y-<em> yes</em>.”</p>\n<p>Bruce reached for Kent--<em> Clark’s-- </em>pants, briefly debating the ethics of sexual intercourse under a false identity. He undid the zipper, sliding them down, and decided that their relative secret identities -- yet undiscussed -- probably cancelled each other out. </p>\n<p>He’d prepared himself for a little warm up, knowing he hadn’t given the other man much warning, only to find himself pleasantly surprised. Clark was rock hard against his stomach, his cock a long bulge that nearly sprung out the top of his boxers, precome already darkening the fabric. </p>\n<p>Impressive. Bruce whistled his surprise softly, getting an aggrieved sound from Clark above him. </p>\n<p>“Shhh,” he said, ghosting a breath over the damp underwear. The other man twisted, a low keening noise escaping him. “You’re beautiful. Don’t worry.”</p>\n<p>Bruce rolled his underwear down, letting Clark’s cock spring free. He made sure to lock eyes with the reporter, asking one final time for permission. </p>\n<p>The other man nodded, looking dazed. He was still breathing heavily, looking absolutely floored by what was about to happen. </p>\n<p>Bruce wondered about the last time Clark had let someone do this for him. It had to have been a while, considering how desperate he seemed, halfway to coming without even being touched. </p>\n<p><em> So sensitive, </em>he recalled, leaning forward. With a slow, agonizing pace, he swallowed the other man down to the root, throat working gently around him in tantalizing contractions. </p>\n<p>Clark made a muffled sound, like he’d been punched, and let his head fall back, hitting the wall with a soft <em> thunk.  </em></p>\n<p>Bruce smiled around the cock in his mouth, slowly working it up and down, twisting his tongue around the head as he did. His lips strained slightly around the girth, so he made each move up and down <em> count</em>.</p>\n<p>Clark groaned as he sped up, his cock slamming into the back of his throat with every stroke. Bruce kept a tight hold on his gag reflex, smirking internally as he felt the other man’s hips twitch against him. </p>\n<p>He pulled off with a <em> pop, </em> licking his lips. Above him, Clark looked absolutely <em> wrecked, </em>blinking slowly as he processed the sudden halt. </p>\n<p>“You can fuck my throat as hard as you like,” he growled up at the reporter, “but you have to stay <em> quiet</em>.”</p>\n<p>Clark’s cock twitched at the words, growing impossibly harder in his hand. With a pointed look, Bruce took him into his mouth again, restarting with a pace that left the other man with little time to brace himself. </p>\n<p>He felt his amusement grow as Clark still held back, clearly worried about hurting him. <em> So goddamned polite… </em></p>\n<p>With a hidden smirk, he reached his other hand between the reporter’s legs, finding his perineum and <em> pressing </em>down suddenly. </p>\n<p>Above him, something shattered, the pieces sprinkling down as Clark grabbed Bruce’s hair with a shout, fucking deeply into his throat and coming in short, furious spurts that left him trembling.</p>\n<p>Bruce swallowed obligingly, wincing internally. There was no way someone didn’t hear that. </p>\n<p>Sure enough, just as he’d coaxed a gasping Clark back into his pants, the closet door flew open, revealing two guards. </p>\n<p>From his position on the floor -- still kneeling and flushed, covered in what looked like the pieces of a mop -- Bruce gave a casual wave. </p>\n<p>“Hey boys!”</p>\n<p>Clark’s face was burning in embarrassment as they were led down the hallway. </p>\n<p>To be fair, it had been burning on and off ever since he’d run into Bruce Wayne -- just <em> Bruce, </em>now, and how weird was that? -- but he was certain he was the reddest he’d ever been in his entire life. </p>\n<p>He’d also been the <em> hardest </em>he’d ever felt in his life, which was the cause of their current predicament. </p>\n<p>To his relief, they weren’t taken back to the room they’d woken up in. Instead, the guards took them to what looked like the main hub for their operation, full of computers, schematics, and a few corkboards with photos pinned to them, connected by red string. </p>\n<p>The sheer cliché of the moment nearly overwhelmed him, and he let out a slightly-strangled chuckle. For some reason, Bruce turned toward him, and they shared a similar look: <em> what the fuck are these idiots doing.  </em></p>\n<p>At the front of one of the tables stood the man Clark suspected of being the ringleader in the bathroom extraction, mask finally off. He was older, grey in the temples and clearly displeased. </p>\n<p>“You let them escape?” he asked the two guards. </p>\n<p>“I have no idea how they got out of the zipties, sir,” one of the guards said, looking nervous. “We found them in the hallway closet…”</p>\n<p>He trailed off, to Clark’s relief, feeling his face heat up. </p>\n<p>“Whatever,” the leader said, “I needed Wayne anyway. Might as well interrogate them here.”</p>\n<p>Clark glanced at Bruce, his worry spiking. The other man seemed to be...<em> thinking? </em>Or something close to it. Maybe he was just tired from their previous activities. </p>\n<p>The leader approached, stopping in front of the billionaire. “Mr. Wayne?”</p>\n<p>“Yes?” Bruce responded pleasantly, if a little distant. </p>\n<p>“I need the passcode to your phone. Don’t make me <em> ask </em>again.”</p>\n<p>Clark felt his eyes begin to burn, fists clenching at his sides. He remembered exactly how they’d <em> asked </em> last time. It had left Bruce beaten half to death, drugged and <em> alone.  </em></p>\n<p>“I already told you. I don’t remember it,” Bruce said, shrugging. “I have too many phones.”</p>\n<p>“Oh, for--” the older man cut himself off, unholstering his gun and pressing it against Bruce’s forehead. “<em>Tell me what it is!”  </em></p>\n<p>Clark’s stomach plummeted as he watched the man’s finger, hovering slightly over the trigger. Was he fast enough to get in between them if he chose to fire? He couldn’t breathe, focused intensely on the way the muzzle pressed against the billionaire’s skin. </p>\n<p>Bruce, unphased by the gun, shrugged again. He smiled up at their captor. “I guess I could try.”</p>\n<p>The man dropped the gun, gesturing at one of the guards, and Clark could breathe again, chest unfreezing. </p>\n<p>They needed to get out of here -- <em> quickly. </em></p>\n<p>So far, Bruce’s backup plan was going well. </p>\n<p>Barring the brief moment Kent’s eyes had flashed red, which he was certain no one had noticed but him, they’d managed to get into the room with the phone and their central computer setup. </p>\n<p>But their captors were still in the room with them. And that made plugging in the phone and getting out before it fried everything with an EMP pulse a <em> tad </em>bit harder. Not impossible -- but harder. </p>\n<p>His dummy phone was shoved unceremoniously into his hands, clearly still unopened. <em> God, </em> but these criminals were stupid. Jason would be <em> smothering </em>him with the “I told you so’s” when he returned to the Manor. </p>\n<p>He’d really had higher hopes. Ah well. Maybe a dumber approach <em> was </em>the solution, after all. </p>\n<p>For a moment, Bruce fiddled with the phone, drawing up one of the failsafe screens he’d left, pretending to try and enter his passcode. </p>\n<p>“Oh crap,” he said, letting a hint of uncertainty thread through his voice. “It says I need to...update? Before I can open it again.”</p>\n<p>The older man -- Dominic Cass, if his intel wasn’t mistaken -- frowned, glancing down at the phone. “What?”</p>\n<p>“It says I need to plug it in and let it update.” He showed him the screen, keeping the innocent expression firmly on his face. “See?”</p>\n<p>He saw the gun whipping toward him and sighed internally, knowing he had to let the hit land. The gun caught him across the temple, slamming his head to the side. </p>\n<p>“So plug it <em> in!” </em></p>\n<p>A few feet away, Clark looked about ready to burst. He could see the red in his eyes starting again, and shifted their timetable up a few minutes. One of them had to get out of here with a little plausible deniability, and it wasn’t going to be him, it seemed. </p>\n<p><em> Whatever can’t be explained by eccentricity isn’t worth explaining, </em>Alfred said in his mind. Bruce smiled to himself, tasting the bitter iron of blood again. Wise words indeed. </p>\n<p>Kent seemed gullible enough. It might work. </p>\n<p>“Do you have a cord?” he asked their captor pleasantly. A second later, one of the guards handed him one, looking slightly sheepish. “Lovely. Thank you.”</p>\n<p>He crossed toward the computer, Dominic watching him, and plugged the phone into the main PC he could see. They had about two minutes, now. </p>\n<p>\n<em> Plenty of time.  </em>\n</p>\n<p>“Did you know that a few years ago, I was thinking about buying a warehouse too?” he asked the group. “It was going to be renovated into apartments. I always loved that industrial feel. Something about the old bricks.”</p>\n<p>In the ensuing silence, Clark finally obliged him. “No, I didn’t know that, Mr. Wayne.”</p>\n<p>Bruce checked his watch, humming to himself. “I thought I told you to call me Bruce.”</p>\n<p>“R-right. Of cour--”</p>\n<p>Before Kent could finish that thought, he was leaping into action, grabbing the barrel of Dominic’s gun and slamming his fist into the man’s unprotected elbow. With a howl, Dominic dropped the gun entirely, cradling his dislocated joint. </p>\n<p>Bruce wasted no time, dispatching the older man with a brutal kick to the temple, then catching a blow on his forearm from behind before he could remember he wasn’t wearing armor. </p>\n<p>The two guards circled him, fists up. Bruce almost laughed. </p>\n<p>A quick jab, a few kicks, and one somewhat show-offy flip later, the two men were down on the floor, out cold. Just on time, the desktop <em> pinged, </em>signaling the start of his program. </p>\n<p>“Time to get out of here,” he said to a gaping Kent, grabbing his arm. “Let’s go.”</p>\n<p>Wordlessly, Kent followed him into the hallway and out toward the doors, never questioning how he knew the right way. He was probably still in shock. </p>\n<p>They got out into the parking lot and Bruce paused, finally catching his breath. If Alfred wasn’t already on his way, then the program activating would make sure he was. </p>\n<p>“How--<em> how </em> did you--with--” Kent babbled, wide-eyed. “Why didn’t you do that <em> before!” </em></p>\n<p>Now it was Bruce’s time to flounder for an answer. </p>\n<p>“They, uh, took me by surprise,” he mumbled, letting his head dip in faux embarrassment. “And I was...scared.”</p>\n<p>Kent raised an eyebrow, clearly not buying that. “That didn’t look like you were scared to me.”</p>\n<p>“Well, I’ve only had a few lessons,” he said, smiling, “I have this personal trainer shipped in from Israel once a month, she’s <em> amazing. </em> Teaches a blend of <em> krav maga </em> and martial arts with added Zumba and Pilates frameworks. It’s quite something. Lot’s of kick-dancing and Pitbull songs, really. Have you ever tried Zumba? It’s <em> exhausting </em>!”</p>\n<p>He could practically feel the way Kent’s eyes glazed over. <em> Good.  </em></p>\n<p>“I can’t wait to tell Gal all about this exciting little misadventure,” he said, smiling wide. It wasn’t solely for Kent’s benefit anymore -- he could see Alfred’s car in the distance, a few warehouses away. “And my prince in shining armor.”</p>\n<p>That got the desired effect. Kent blushed prettily, ducking his head. His eyes were a piercing blue in the low light, warm and carefully amused.</p>\n<p><em> He really needs to stop wearing glasses </em>, Bruce thought.</p>\n<p>Clark was still processing Bruce’s explanation -- and the last thirty minutes, frankly -- when a gleaming Rolls-Royce pulled up in front of them, beeping promptly. </p>\n<p>Bruce grinned at the driver, waving. “Alfred!”</p>\n<p>So it was his butler. He couldn’t find it in himself to be surprised -- Wayne’s minder was infamous for his caretaking responsibilities. Of course he’d managed to track them down. </p>\n<p>Alfred leaned out of the window, looking only mildly impressed by the debacle his ward had gotten into. </p>\n<p>“If you could get in the car, sir,” he said, glancing at Clark. “Will Master Kent be needing a ride as well?”</p>\n<p>Bruce jumped into the backseat, rolling his own window down. He leaned out toward Clark, hanging over the glass. </p>\n<p>“No, I don’t think so,” he said, winking at Clark, “Mr. Kent has his own transportation back to Metropolis, I believe.”</p>\n<p>“I do?” he asked, confused. </p>\n<p>“I’m sure you’ll think of something on the <em> fly, </em>Mr. Kent,” Bruce said, winking again. Clark’s stomach dropped as the billionaire started rolling up the window, everything around him shuddering to a halt. </p>\n<p>\n<em> He knew. He knew the whole time.  </em>\n</p>\n<p>“Wait,” he said, putting a hand out. Wayne paused accordingly, another guileless smile across his face. “I--”</p>\n<p>A thousand questions swirled within him, begging to be asked. Instead, he opened his mouth and asked the dumbest one. </p>\n<p>“What about your, uh, phone?” he said awkwardly, “I know you wanted to go back for it.”</p>\n<p>Inside the building, something began to spark, spreading across the room they’d just vacated. With a muffled <em> boom, </em>the power for the entire building went out, leaving them in the dark. </p>\n<p>Wayne glanced at his watch, humming. There was a smirk curving his lips, ever so slightly. </p>\n<p>“I decided I didn’t need it anymore, I suppose.”</p>\n<p>“Master Kent,” Alfred nodded at him, shifting into drive. Clark stood back obligingly. </p>\n<p>Wayne winked at him as the car started to move, grinning wickedly. “Call me?”</p>\n<p>“You don’t have your phone,” Clark said dumbly. </p>\n<p>“Oh dear. You’re right,” Wayne said, looking momentarily perplexed, “I’ll figure it out.”</p>\n<p>“Sure,” Clark said, grinning. “Mr. Wayne.” </p>\n<p>“Mr. Kent.” </p>\n<p>The window rolled up. By the time the Rolls-Royce was out of sight, he was still smiling. <br><br><br></p>\n<p>The End! </p>"
}