{
  "id": "33354697",
  "url": "https://archiveofourown.org/works/33354697?view_full_work=true",
  "author": [
    "asdfjkl129"
  ],
  "title": "Deku's Already Fucking Taken",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Bakugou Katsuki/Midoriya Izuku"
  ],
  "characters": [
    "Bakugou Katsuki",
    "Midoriya Izuku",
    "Todoroki Shouto",
    "Ashido Mina",
    "Kirishima Eijirou",
    "Original Characters"
  ],
  "additional_tags": [
    "Established Relationship",
    "5+1 Things",
    "POV Outsider",
    "High School Student Bakugou Katsuki",
    "High School Student Midoriya Izuku",
    "Pro Hero Bakugou Katsuki",
    "Pro Hero Midoriya Izuku",
    "Attempt at Humor",
    "Possessive Bakugou Katsuki",
    "Domestic Fluff",
    "they are in love",
    "and it is imperative to both my sanity and your reading experience that you understand that",
    "Public Display of Affection",
    "Fluff and Humor",
    "M for Language and A Little Aggressive PDA",
    "Not Beta Read",
    "One Shot",
    "Implied Jealousy",
    "(but not btwn bkdk. nah they're so good with each other.",
    "everybody else just wants dk for themselves but bk said finders keepers when they were like 5)",
    "everyone in 1-A is having the time of their life",
    "Yanno I prolly could've released this in chapters",
    "but my impulse control grabbed me by the neck and demanded payment",
    "So here we are"
  ],
  "language": "English",
  "series": "",
  "published": "2021-08-19",
  "completed": null,
  "words": "20,876",
  "chapters": "1/1",
  "comments": "323",
  "kudos": "9,756",
  "bookmarks": "2,585",
  "hits": "113,283",
  "summary": "<p>“I want to confess- no, I’m <em>going</em> to confess to Midoriya today, but, uh, before I do that, can you tell me: are Midoriya and Todoroki dating?”</p>\n<p>\"Oh, honey, you sweet, sweet, summer child. It's not Todoroki you have to worry about – they're just friends,\" Ashido says, shaking her head with a vicious grin.</p>\n<p>\"Really?!\"</p>\n<p>\"No, you should be worrying about <em>him,\"</em> she says, jutting her chin forward to indicate something behind Kazuo.</p>\n<p>As if on cue, a low, echoing growl travels through the halls, and Kazuo feels his heart immediately pick up, beating wildly in his chest and so hard it almost hurts.</p>\n<p>-</p>\n<p>5 times people don't realize that Deku is already in a very happy relationship and try their hand at asking him out, and then in Bakugou's unique and special style, get <em>very firmly</em> corrected, +1 time where no correction is needed.</p>\n<p>(Or 5+1 Times Bakugou Scares the Absolute Shit Out of Everybody Who So Much As Even Looks At Deku With the Wrong Kind of Eyes)</p>",
  "notes": "<p>*korok voice* YAHAHA MOTHERFUCKERS I'M ALIVE</p>\n<p>This was supposed to be for Izuku's bday but July fucked me all the way up so here we are, a month later. Fucking kill me.</p>\n<p>I pulled an all-nighter to post this shit today bc I was getting so fucking tired of looking at it. Like, I complained about my <a href=\"https://archiveofourown.org/works/32258437\" rel=\"nofollow\">last fic's</a> length but look at this shit - it's 20 FUCKING K I AM GOING TO COMMIT ARSON. I am very excited to get this out of my drafts but I am also <em>so</em> incredibly nervous aahhhhh</p>\n<p>Pls understand that this is very fucking self-indulgent. Iono what else to tell you</p>\n<p>Izuku, happy birthday. I love you so goddamn much and you deserve the world, so here's this fic where you have exactly what you want: Kacchan.</p>\n<p>Enjoy. I am going to go sleep for a few days ::)))</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Welcome back to the other side soldier, can't believe you fucking read all that shit. There are probably so many mistakes my sleep deprived eyes missed</p>\n<p>Little old japanese lesbian woman I love yououou</p>\n<p>Ms. Kiryu is my favorite, and she dotes on Dk and trash talks Bk, but she refuses to let Bk cook for her because she wants to feed him instead. She took one look at Bk with a horde of kids hanging off of him and adopted him immediately. She also gives Bk a shovel talk despite only having known Dk for ten minutes and knowing that bkdk have been together for over twenty years at this point.</p>\n<p>She definitely has bricks in her purse, as all grannies should.</p>\n<p>And pls appreciate the fact that Bk was ready to throw hands with this woman over Dk. That's called true love babey: fighting tiny old lesbians in a grocery store on a tuesday afternoon while your husband watches the shopping cart and holds the kids.</p>\n<p><em>Also</em> pls appreciate that Bk was really going through it in this. Like, look: if Dk wearing Bk's clothes, holding his hand, kissing him rather voraciously in public, wearing a ring and then raising kids together doesn't scream that Dk is Bk’s – and vice-versa – then iono what the fuck else other than bkdk fucking in public (keep an eye out for that fic sometime in the future 👀) will say “Deku’s already fucking taken.”</p>\n<p>I fuck around over <a href=\"https://yee-boii.tumblr.com\" rel=\"nofollow\">here</a>, y'all can talk to me there :))</p>\n<p>Aight, please get enough fucking sleep, drink some goddamn water, then tell your loved ones they're pieces of shit (affectionately)</p>",
  "text": "<p>1. First Years</p>\n<p>Omi Naoki walks up the path leading to the Height’s Alliance dorms, hands sweating and pulse beating madly in his throat.</p>\n<p>He has a single flower clenched in his fist, and his heart on his sleeve, dressed in his best pair of jeans he owns along with a clean button down. Despite all this, he wears a confident smile on his face and his steps are steady.</p>\n<p>No one’s ever denied Naoki when he smiled at them like this (whether it’s part of his quirk or not, he doesn’t know), and he’s hoping that this time won’t be any different (he <em>really</em> hopes this time won’t be any different).</p>\n<p>Ever since the sports festival passed and Naoki saw the crazy green kid who broke all his bones just to win, he’s been keeping an eye out for him.</p>\n<p>He was cute, obviously crazy enough to make things interesting, and just Naoki’s type. He had smiled at Naoki after the first race and his wide, beaming smile immediately caught Naoki’s attention.</p>\n<p>From the little Naoki had been able to see during lunch and in passing hallways (and the odd moments Naoki saw Midoriya in the news, like that whole thing with almost being snatched by a Nomu in Hosu City, which, wild, but still attractive), Midoriya is sweet, earnest in everything he did, and manages to look cute through it all.</p>\n<p>Now that they were all stuck on campus in the dorms, Naoki figured he’d take his chance and ask him out. Go on a date with him, see if they had any chemistry, and go from there.</p>\n<p>He just hopes Midoriya will give him a chance. Naoki might be in Gen Ed and Midoriya in the Hero Course, but he saw Midoriya trying to talk to Shinsou, who was the most unapproachable kid in his class, so Naoki figured Midoriya wouldn’t care about all that.</p>\n<p>As Naoki walks up the steps, he fails to notice the figure leaning against one of the pillars to his right, instead choosing to focus only on the large doors in front of him.</p>\n<p>He can’t hear anything through the doors, and the sheer size of them is intimidating for no reason, considering his own dorms look almost exactly the same. It’s the nerves, he knows this, but he gulps anyways looking at them.</p>\n<p>He straightens his clothes one more time, adjusts the single red azalea bloom in his left hand, clumsily brushes his white hair out of his face, and knocks on the door.</p>\n<p>With any luck, Midoriya will be the one to open it, but if not, Naoki has no issues asking one of Midoriya’s classmates if they can bring Midoriya outside for him.</p>\n<p>There’s a beat or two of silence that Naoki barely notices, then the door opens, and the loudest person Naoki has ever met (met as in seen him from afar and resolutely promised to never step within twenty feet of the guy if he could avoid it) steps into the doorway, but since he’s so quiet compared to how he was in the sports festival, it takes a moment for Naoki to recognize him.</p>\n<p>“Hah? Who the fuck’re you?”</p>\n<p>Spiky blonde hair, a permanent scowl to go with a gruff voice, and startling red eyes. Just Naoki’s luck, it’s Bakugou freaking Katsuki.</p>\n<p>Out of all of Midoriya’s classmates, he’s the last one Naoki was hoping to open the door. He’d even rather face 1-A’s hobo homeroom teacher then talk to Bakugou, who’s known for his rude remarks and explosive temperament.</p>\n<p>But Naoki won’t back out, not when he’s literally on the doorstep, so he cements his smile and stands up straighter, bowing his head the slightest bit.</p>\n<p>“Good morning, I’m Omi Naoki, from 1-C. I’m looking for Midoriya Izuku?”</p>\n<p>He makes sure to keep his tone polite and even, but he still winces at the silence that follows.</p>\n<p>Bakugou was notorious for his anger more than he was for his win at the festival or for his kidnapping; Naoki doesn’t want to get on one of the bad sides of Midoriya’s classmates, let alone the one with anger issues.</p>\n<p>Bakugou narrows his eyes at him, gaze darting from the flower and Naoki’s nice clothes to his face several times before he steps forward and onto the patio, slightly closing the door behind him until Naoki can no longer see into the dorms.</p>\n<p>“Yeah?” Bakugou asks, but it doesn’t feel like a question. His voice is low, dangerously quiet and nothing at all like the Bakugou Naoki had seen at the Sports Festival or on screen at Kamino Ward. “What for?”</p>\n<p>“I’ve a question I’d like to ask him, if you don’t mind,” Naoki says, smile slipping when Bakugou takes another step forward, hands tucked into the pockets of his black sweatpants. Naoki can’t tell if the step forward was threatening or not due to Bakugou’s impassive face, but he fights the urge to step back all the same.</p>\n<p>Instead, he looks Bakugou up and down, analyzing him for any hints of his mood, but there’s nothing there to give him away. No clenched fists, no tightened shoulders, no expression; it’s terrifying.</p>\n<p>As Naoki studies Bakugou, who studies him right back, he finally notices the lettering on Bakugou’s shirt: simple black kanji stating <em>T-Shirt.</em> It doesn’t seem like something Bakugou would wear, but Naoki wisely keeps that comment to himself.</p>\n<p>His eyes flick back to Bakugou’s face, but his mouth is in a flat line, his pale eyebrows are relaxed.</p>\n<p>There is absolutely nothing Naoki can see that warrants the feeling of dread crawling over his skin. The only hint Naoki has is that there’s something about Bakugou’s eyes that are raising the hairs on the back of his neck, something dangerous, but it’s a warning that Naoki can’t read.</p>\n<p>“And what exactly,” Bakugou says, his tone mild and red eyes piercing Naoki where he stands, “kind of question is that?”</p>\n<p>Naoki frowns, a little shaken by the severe stare but mostly offended at being questioned by someone who had nothing to do with Midoriya <em>or</em> Naoki.</p>\n<p>“Frankly, that’s none of your business, Bakugou,” he says before he can help himself, hand clenching tighter on the flower. He can hear his pulse echoing in his ears, beating wildly for a different reason than before, but he doesn’t take back his words.</p>\n<p>He just wants to see Midoriya, is that too much to ask?</p>\n<p>Bakugou ignores the fact that Naoki knows his name and growls, stepping forward with one hand coming out of his pocket to threaten Naoki, fingers curling around the smoke that’s started to drift up from his palm.</p>\n<p>“Like <em>hell</em> it’s none of my goddamn business, you-”</p>\n<p>Whatever he’s about to say is cut short by the door opening again and a familiar voice calling out.</p>\n<p>“Kacchan? Where’d you go?”</p>\n<p>Naoki can still feel his heart pounding against his sternum and the sweat beading on his forehead, but he lets slip a relieved smile at the sight of Midoriya standing in the doorway.</p>\n<p>He’s in gym shorts and slippers, a wide black shirt with <em>Aji-Fry</em> on the front hanging the slightest bit too big on his frame, and his hair is pulled back from his face by a hairband.</p>\n<p>He really is too cute, and Naoki can’t wait to get to know him.</p>\n<p>“Midoriya, I-” he starts, beginning to step forward, but he’s immediately cut off by Bakugou whipping around and stomping up to Midoriya, blocking Naoki from view.</p>\n<p>“Deku, I thought I told you to watch the eggs,” Bakugou says, and continues to step closer to Midoriya than what’s normal for friends or classmates.</p>\n<p>“I did! I even took them off the pan once they finished! You were taking a while, so I came to see who was at the door,” Midoriya defends, eyebrows furrowing as he stares the slightest bit up at Bakugou, but Midoriya doesn’t seem uncomfortable at the invasion of his space.</p>\n<p>If anything, he seems to be leaning in even closer to Bakugou.</p>\n<p>Naoki’s eyes narrow, darting between Bakugou and Midoriya as they talk, comprehension beginning to dawn on him.</p>\n<p>It finally clicks, Naoki’s mouth falling open, when Bakugou slips an arm around Midoriya’s waist and tugs him into his side, leaning down to speak into his ear. Whatever he says flusters Midoriya so bad he throws his arms up in front of his blushing face, eyes squeezing close.</p>\n<p>“Kacchan,” Midoriya whines, voice high-pitched in embarrassment, and Bakugou only smirks, tugging at Midoriya’s waist and leading him back into the building while his eyes are still closed.</p>\n<p>“Yeah, yeah, whatever,” Bakugou says, tossing a smirk over his shoulder to a gaping Naoki as he kicks the doors to Height’s Alliance shut with his heel, hand still clutching possessively at Midoriya’s waist.</p>\n<p>As the door closes, Naoki can just see Bakugou leaning his face down into Midoriya’s hair, presumably to kiss his head, and Naoki flushes a bit at the intimate act.</p>\n<p>The door clicks shut, echoing a little, and Naoki wilts, letting himself feel the tiniest bit sad without anybody to see him throw a self-pity party.</p>\n<p>Well, that didn’t go as planned. At least no one else was here to witness the whole mess.</p>\n<p>He’s not heartbroken, per se, but he had been looking forward immensely to talking with Midoriya, maybe holding his hand on the walk back.</p>\n<p>Rejection is still rejection, even when not intentional, and it stings a little.</p>\n<p>He drops the hand holding the azalea bloom, looking dejectedly at it. Now what is he supposed to do with the flower, let alone his morning?</p>\n<p>As Naoki turns to go back to his own dorm, feet dragging behind him, a loud slurping sound echoes to the side of him, and he startles, yelling from the abrupt noise and his free hand jumping to his chest to clutch the fabric right above his heart.</p>\n<p>A tall figure steps forward from behind the shadow of a pillar, and Naoki immediately feels flustered over the fact that someone <em>had</em> seen everything and was still here.</p>\n<p>He grips a little tighter to his shirt once he sees who exactly had seen it all.</p>\n<p>A head of hair split between red and white steps forward, a yogurt pack in hand, and Naoki feels his stomach drop straight to the floor. </p>\n<p>Great, it’s Todoroki Shouto, the guy Midoriya beat by breaking his bones and then immediately befriended.</p>\n<p>Naoki starts to stumble over his words, voice rushed and panicked as he gets stared down by <em>another</em> one of Midoriya’s classmates, feeling his blood curdle in his veins at the hard gaze.</p>\n<p>Jeez, what was 1-A’s teacher feeding them?</p>\n<p>“You saw- oh my gosh, you were here- I didn’t know Midoriya was- I mean I only wanted to-” he stammers, defending himself for reasons he can’t explain as Todoroki simply continues to stare at him and drink his yogurt, not saying anything.</p>\n<p>Naoki doesn’t need to explain his reasoning to Todoroki, but with every passing second that Todoroki’s eyes don’t blink, and he continues to drink his yogurt, Naoki can feel the marrow in his bones withering away.</p>\n<p>The longer Todoroki stays quiet, the more Naoki fumbles his words, getting less and less incoherent the higher pitched his voice goes.</p>\n<p>Eventually, Naoki runs out of steam and things to say, his face a bright red as he waits – for what, he doesn’t know, but since Todoroki is still there, still staring at him, Naoki waits.</p>\n<p>“Your name is Omi, right? You know,” Todoroki finally says, pulling the yogurt away from his mouth, his other hand stuck in his pocket nonchalantly, “Midoriya’s taken. By Bakugou, in fact.”</p>\n<p>He starts to walk forward, pace unhurried as he says, “I thought everybody knew that.”</p>\n<p>And with that, Todoroki brushes past Naoki and into the building, closing the massive doors once again without sparing a backwards glance to the stunned Naoki still standing on the porch with a flower in hand.</p>\n<p><em>Fuck,</em> he thinks, shivering at the sudden frigid air surrounding him.</p>\n<p>Why did it seem that everybody Midoriya surrounded himself with were supremely scary for no reason when Midoriya alone seemed to be sunshine incarnate?</p>\n<p>Naoki feels it’s quite safe to say that there will be no first date with Midoriya, if Bakugou or Midoriya’s friend has anything to say about it, let alone Midoriya, who hadn’t even noticed Naoki was there.</p>\n<p> </p>\n<p>2. Second Years</p>\n<p>Shibata Kazuo stands in front of the huge class 2-A door, pulse fluttering in his throat with a mixture of nervousness and anticipation. His palms are damp with sweat, and he kind of wants to dive back into his bed and under his covers for the next century, but he’s already here.</p>\n<p>This is it: he’s finally going to confess to Midoriya Izuku, his long-time crush. There’s no turning back now.</p>\n<p>Just thinking about him makes a smile curl on Kazuo’s face, his expression slightly dopey as he thinks about Midoriya’s smile and his freckles and the view of his strong back covered in green lightning and his always determined glowing eyes.</p>\n<p>Ever since Kazuo and the rest of Class 1-A shared a class with Midoriya’s own hero class, Kazuo’s been smitten, having fallen head over heels for Midoriya.</p>\n<p>Midoriya was so <em>kind,</em> so smart and beautiful when they were all introduced to each other and forced to work together.</p>\n<p>Midoriya had been paired with Kazuo for some brief one-on-one time that Kazuo’s teacher and 2-A’s teacher set up with the upperclassmen, and Kazuo was certain then and there that he just met an earth angel.</p>\n<p>It’s been a couple months since then.</p>\n<p>A couple months of seeing Midoriya in the hallway and waving shyly, of seeking him out for advice or company after school (Okay, it only happened once, but Midoriya didn’t even seem bothered that Kazuo had stopped him to ask questions and catch up. (Kazuo resolutely ignores the part of his memory where Bakugou had stood at Midoriya’s elbow and bared his teeth at Kazuo and the flash of fear that had run through his body at the sight. No, he won’t let one of Midoriya’s weird classmates ruin the memory of Midoriya smiling enthusiastically down at him.)), of getting to work with him in some classes, and Kazuo decided it was now or never.</p>\n<p>Kazuo will confess now and spend the remainder of the year at Midoriya’s side. All that time he spent fantasizing about holding Midoriya’s large hands and sitting with him at lunch is finally getting the chance to become reality.</p>\n<p>He wasn’t always going to confess at first, as Midoriya is constantly surrounded by his classmates or is busy with training and internships, but he’s especially always hanging around with Todoroki and <em>Bakugou</em> whenever he’s not with his friend group.</p>\n<p>(Kazuo still doesn’t know how Midoriya can stand to be around someone who’s always so… <em>angry.</em> That’s gotta get tiring after a while.)</p>\n<p>Kazuo was worried at first, thinking Todoroki and Midoriya were an item with how close they seemed to be, and that that meant Kazuo had lost his chance, but there weren’t any concrete rumors about Midoriya being in a relationship.</p>\n<p>Kazuo took it as a sign to make the first move, to confess and ask Midoriya on a date.</p>\n<p>He takes a deep breath in and immediately chokes on it when he hears a bubbly voice call his name, spluttering as he gulps for air.</p>\n<p>“Shibata! Hey, what’re you doing here?”</p>\n<p>Kazuo turns around, catching his breath, and grins, seeing another one of his upperclassmen.</p>\n<p>Ashido Mina stands next to him, a wide, curious smile on her face as she waves at him. She’s always really fun and interesting in their shared classes, constantly upbeat and excited, so Kazuo relaxes a bit, feeling some of his anxiety drain away.</p>\n<p>She probably knows whether Midoriya is in a relationship or not and can answer some of his questions before he marches in and snatches Midoriya for himself.</p>\n<p>God, even thinking of Midoriya as <em>his</em> makes Kazuo’s heart stutter in his chest. Hopefully, soon, it’ll be true.</p>\n<p>“Hi, Ashido,” he greets with a small bow of his head. “I was hoping to, um, talk to Midoriya for a bit.”</p>\n<p>“Midoriya?” she asks, tilting her head to the side curiously. “What do you want with our Mido?”</p>\n<p>Kazuo blushes at her phrasing and the brief mention of Midoriya, looking to the side.</p>\n<p>Ashido smiles deviously, obviously smelling weakness and leaning in closer to him.</p>\n<p>“Well?” she asks, peering curiously at his blush.</p>\n<p>“I want to- you see, I need to tell him- I need to tell him something important.” Kazuo can barely get the words out, stammering as his blush intensifies when Ashido snickers a bit.</p>\n<p>Kazuo can tell she’s not laughing meanly, but the fact that he can’t even <em>talk</em> about the fact that he’s confessing with Ashido, who has nothing to do with the situation, is more than embarrassing.</p>\n<p>“Oh?” Ashido asks again, still smiling slyly.</p>\n<p>Oh, fuck it, might as well ask her now before he dies of nervousness.</p>\n<p>Kazuo straightens his shoulders, and looks her directly in the eye, but Ashido only seems to be more amused at the sudden change in his temperament.</p>\n<p>“Ashido, can I ask you something?” he ventures, eyes darting around her face for any signs of rejection or annoyance.</p>\n<p>“Shoot,” Ashido says, placing her hands on her hips and grinning.</p>\n<p>More people are in the hallway now, as it’s getting closer to the start of their first period, and Kazuo steels himself, intent on confessing before the hallway fills with more students and Midoriya’s classmates all show up.</p>\n<p>Kazuo looks up at Ashido, hands fisted at his side, and asks the one question that could derail his entire future.</p>\n<p>“I want to confess- no, I’m <em>going</em> to confess to Midoriya today, but, uh, before I do that, can you tell me: are Midoriya and Todoroki dating?”</p>\n<p>By the end of the question, he’s blushing again, the rosy-red spreading across his face in splotchy sections, and he ducks his head to hide as best he can underneath his dark bangs.</p>\n<p>Ashido bursts out laughing, clutching her sides, and Kazuo's head shoots up, feeling a bit hurt at her gleeful chortling. It’s tinged just a bit with a sadistic edge Kazuo doesn’t completely understand, and it causes many of the people walking past them to turn and stare at them both with confusion.</p>\n<p>\"Oh, honey, you sweet, sweet, summer child. It's not Todoroki you have to worry about – they're just friends,\" Ashido says, shaking her head with a vicious grin.</p>\n<p>He perks up, eyes brightening and the hurt falling away as quick as it came. \"Really?!\"</p>\n<p>Ashido shakes her head again, still laughing a bit, but the previous part of her sentence finally catches up to Kazuo.</p>\n<p>“Wait, what do you mean Todoroki’s not the one I have to be worried about? I thought he was the only one Midoriya might have been dating…?” he questions, fidgeting at the smug expression on Ashido’s face.</p>\n<p>She looks over Kazuo’s shoulder, and her grin gets wider, a little meaner, and Kazuo can feel apprehension start to trickle down his spine.</p>\n<p>\"No, you should be worrying about <em>him,\"</em> she says, jutting her chin forward to indicate something behind Kazuo.</p>\n<p>As if on cue, a low, echoing growl travels through the halls, and Kazuo feels his heart immediately pick up, beating wildly in his chest and so hard it almost hurts, his palms starting to sweat as he goes cold with fear.</p>\n<p>The growl is ferocious and violent, dipping and rattling around inside of Kazuo’s head as he starts to turn his face to look behind him.</p>\n<p>The growl gets louder, sharper, and Kazuo freezes. He stares up at Ashido, eyes wide and terrified as the sound gets closer and closer until it's almost directly behind him.</p>\n<p>Why isn’t she doing anything? Why isn’t she helping him and instead is simply smiling down at him? Kazuo’s breath stutters, his lungs filling and releasing unevenly.</p>\n<p>Ashido steps back, and Kazuo almost reaches out to grab her, begging her to not leave him with whatever <em>thing</em> is behind him.</p>\n<p>Kazuo hears an explosion before he gets the chance to move towards her and he jumps, a small scream tearing itself from his throat. He still he doesn't turn around, trembling in place as his own scream echoes in his ears.</p>\n<p>He can feel the urge to run clawing at his throat, the desperation to <em>move,</em> to <em>hide</em> before whatever beast that’s stalking up behind him can tear him to pieces.</p>\n<p>Kazuo’s heart is pounding in his ears, the faint whooshing sound of his own pulse echoing each footstep behind him as it gets closer and closer and <em>closer,</em> it keeps getting <em>closer.</em></p>\n<p>Kazuo’s knees shake with each heavy step, flinching violently at another sudden explosion, and he gulps, preparing to fire off his quirk from the tips of his fingers. Quick bursts of water shot over his shoulders should give him enough time to escape but he can’t <em>move.</em></p>\n<p>He can’t move, he needs to move, <em>he needs to-</em></p>\n<p>“Kacchan!”</p>\n<p>Kazuo hears the voice of an angel before he can gather his strength and see what monster is behind him, and he almost slumps to the floor in sudden relief, his muscles unlocking and air suddenly rushing into his lungs.</p>\n<p>Kazuo hadn't even noticed when the door to class 2-A opened, hadn't even noticed when <em>he</em> suddenly stepped out of the room.</p>\n<p>\"Kacchan! Good morning!\" <em>he</em> calls, unafraid of whatever is behind Kazuo.</p>\n<p>Midoriya's sweet voice cuts through the growl, and the rumbling stops behind him entirely, but the silence only puts Kazuo more on edge, his breath catching in his chest again.</p>\n<p>\"Deku,\" it growls, a deep, thundering sound that easily rattles Kazuo’s ribs.</p>\n<p>Midoriya steps into Kazuo’s view, and his smile changes from delight to a sympathetic frown, freckles moving with the change in expression.</p>\n<p>\"Ah, that kind of day, Kacchan?\" Midoriya asks, and whatever he sees must give him his answer, because Midoriya reaches his hand out, opening and closing it like he wants the monster behind Kazuo to grab his hand.</p>\n<p>\"Come here, Kacchan, we have a couple of minutes before homeroom starts.\"</p>\n<p>Kazuo shakes as a large, pale hand, with strong veins lining the back and faint star‐burst scars curling out from underneath the palm, reaches out directly past his head and over his shoulder. He can feel the change in the air as it moves past him, almost but not quite brushing Kazuo’s hair.</p>\n<p>Kazuo can’t help the flinch at the touch, shoulders jerking up and a whimper hiding pitifully in his throat.</p>\n<p>The hand grabs onto Midoriya's firmly, fingers clutching tightly, and starts to move forward and past Kazuo’s head once Midoriya gives it a light tug towards himself.</p>\n<p>That hand turns into a sleeved arm, into a shoulder with the singular gold button that signifies the hero course and into Bakugou <em>fucking</em> Katsuki.</p>\n<p>Bakugou’s profile is highlighted by the light of the sun through the windows, putting the side of his face that faces Kazuo into the shadows. Only the faintest hint of red peeks out, and Kazuo can't stop himself.</p>\n<p>\"Fuck,\" Kazuo whispers, and jumps when twin pools of blood red eyes twitch towards Kazuo and fix their heavy gaze on him. Kazuo’s knees lock, his own eyes stretched wide and petrified.</p>\n<p>Bakugou turns his head somewhat out of the shadows, half of his face suddenly shown in stark relief and sharp, jutting angles, a play of shadow and light that only serves to make him seem <em>inhuman.</em></p>\n<p>He's baring his teeth at Kazuo, genuine, frothing anger set deeply into his face, and he looks like he's about to rip Kazuo's spine out with nothing but his teeth and enjoy it.</p>\n<p>Kazuo squeaks, taking a timid step back, but Bakugou's already turned his attention back to Midoriya, getting tugged into their classroom by a fearless Midoriya who had just called for his attention with another sickeningly soft, \"Kacchan.\"</p>\n<p>They walk into the classroom without another word, still holding hands, and the door slides softly shut behind them.</p>\n<p>Midoriya didn’t even look at Kazuo once.</p>\n<p>The hallway is almost empty, the silence echoing, and Kazuo jumps again, screaming out when a hand is placed unexpectedly and <em>heavily</em> on his shoulder.</p>\n<p>He had forgotten all about Ashido, and he’s paying for it now as he clutches at his chest and wheezes, eyes staring unblinkingly at the floor in front of him as his heart protests the millionth scare it went through in the last two minutes.</p>\n<p>\"I told you,\" Ashido says, voice sadistically gleeful. \"Todoroki's not the one you need to worry about.\"</p>\n<p>Kazuo understands now, he really does.</p>\n<p>Kazuo’s been dead since he first met Midoriya and disregarded the angry guard dog at his side; he can see that now.</p>\n<p>Midoriya was never Kazuo’s and never would be, if the scary, blonde bastard always with him had anything to say about it.</p>\n<p>Kazuo simply values his life more than he minds his aching heart.</p>\n<p>The next time Kazuo sees the spot of green that makes his heart flutter in the hallway, he immediately turns around, the sight of the blonde hair and scowling visage with an arm thrown over Midoriya’s shoulders enough to make his palms sweat and fear pool in his gut.</p>\n<p>He doesn’t see the triumphant smirk crawling up Bakugou’s face as he runs away.</p>\n<p> </p>\n<p>3. Third Years</p>\n<p>Two of the Big Three walk in, and Saizen Junko’s breath catches in her throat. They’re broad shouldered, stares heavy, and tall in more than just height. Their mere presences loom over her class, pressing down on them and demanding their attention.</p>\n<p>The twist of the blonde one’s mouth and the flat, cold stare on Endeavor’s kid’s eyes curls her skin, a faint shudder crawling up her back.</p>\n<p>They look out at the classroom, the angry one making brief eye contact with her – Junko can feel her life lose a few years from the brief moment where it felt like he was looking <em>through</em> her, as if she wasn’t even significant enough to be the dirt under his boot – and looking wholly unimpressed by what they’re both seeing.</p>\n<p>It might be her imagination, but it feels like the room is suddenly colder, frost crawling up Junko’s fingertips and locking her limbs.</p>\n<p>She wants to crouch under her desk and hide, wants to avoid their piercing stares and merge with the feeling like she’s nothing more than a fly on the wall.</p>\n<p>The angry one’s lip curls, his sharp canines flashing in the classroom lights, and Junko automatically braces herself, hands gripping the edge of her desk and muscles tightening, preparing for <em>something</em> she can’t quite comprehend.</p>\n<p>These two are the leaders of the next generation of heroes? How the hell is she supposed to fight villains when she can’t even handle being in the same room with the people she would hopefully become comrades with?</p>\n<p>The blonde one growls something under his breath, earning a sharp, quiet reply from Endeavor’s kid, and she starts to fold over her desk unwillingly, taking in a sharp breath as quiet as she can.</p>\n<p>The sheer oppressive aura from these two as they trade barbs under their breath, chests puffing in agitation and hands clenching at their sides as they grow more irritated with each other, presses on her ribs until she finds she almost can’t breathe.</p>\n<p>Cold sweat beads at the nape of Junko’s neck, and she peeks to the side, surprised by how unsurprised she is to find many of her classmates in the same position as her.</p>\n<p>She forces her head forwards again, straining all the while, and gapes at her homeroom teacher. He’s standing in the corner of the room, completely unbothered (<em>smiling</em> even) by what he can hear from the two, and Junko kind of wants to go home rather than sit here for another second.</p>\n<p>The two upperclassmen in the front don’t even seem to notice the class’s reaction, eyes continually darting to the door as they trade verbal blows.</p>\n<p>What are they waiting for? Their third companion?</p>\n<p>Junko doesn’t think she’ll be able to handle it – if the two in front were already this intimidating, this daunting and unapproachable, she can’t imagine what all three of them together would be like, can’t imagine just how terrifying the third one must be as well.</p>\n<p><em>Please,</em> Junko thinks, as the door opens and both upperclassmen at the front perk up at the sound, cutting their conversation short in favor of turning to the doorway. <em>Please, no more.</em></p>\n<p>The door slides open completely, and the silhouette hovers in the frame for a few seconds, a bulky figure to easily compliment the large figures of the other Big Three already in the room, and Junko swallows, her tongue sticking to the roof of her dry mouth.</p>\n<p>They’re easily shorter than both blondie and Endeavor’s kid, but just as muscular. They fill out their uniform from what she can tell from the shadows, tight across their shoulders and chest, almost straining. They stand firm, shoulders set confidently with the ease of knowing intimately the weight and capabilities of one’s own power.</p>\n<p>Oh, <em>fuck.</em> There’s no way they won’t be just as terrifying as the other big three.</p>\n<p>He steps forward into the room, and it’s like Junko can breathe again.</p>\n<p>She gasps quietly, body slumping and releasing itself from its tense state as she drinks in the open smile, the wild, green hair, and the easy tilt of his head. He has freckles on the side of his face that she can see, and they crinkle and move with his smile.</p>\n<p>They’re adorable, and they fit him astonishingly well, despite the brawny shoulders and thick torso to match his thick legs.</p>\n<p>Junko gulps, a faint blush staining high up on her cheeks as she forces herself to look only at his face and not the rest of him. He obviously deserves her respect if nothing else. With the way he walked in and changed the whole atmosphere, he must be something even beyond the two already at the front of the class.</p>\n<p>He’s like a breath of fresh air, like the sun after days in the dark. He feels <em>safe</em> and Junko almost wants to cry out of pure joy.</p>\n<p>Her eyes dart to the blonde and multi-colored kid, worried and curious as to how they’re receiving the <em>god</em> that just walked in (because what the hell else could he be, being able to calm down the two monsters at the front of the room with just a look), and feels even more shocked from their expressions then from the green hero that just walked in.</p>\n<p>The angry one is smiling. <em>Smiling.</em></p>\n<p>He looks like he just saw a newborn child and burned down a building, like he’s eating his favorite food and just learned a new way to kill someone, like he was just told he became the number one hero and like he just won the biggest fight of his life. It’s soft and sharp at once, with hidden layers Junko can’t catch, slightly feral with the peek of a canine at the very edge of his lip.</p>\n<p>It coils around his face, twists the sharp features into something Junko can barely understand as <em>delight.</em></p>\n<p>Who the fuck is this green god that just walked in, and what kind of power do they hold over the angry blonde?</p>\n<p>She looks over to Endeavor’s kid and wants to drop her forehead to the desk.</p>\n<p>The look in his eyes has thawed over, an almost embarrassing softening at the corner of his eyes signifying… <em>fondness?!</em></p>\n<p>What the actual fuck.</p>\n<p>When he had first walked in, trailing after the slouching blonde, he seemed emotionless, if not angry as well – just a separate, detached, and empty anger, as cold as the blonde’s was hot. Yet, one look at the green man in the doorway and every layer of frost and ice sloughed off at once, his shoulders slumping and spine relaxing in unison.</p>\n<p>The room is no longer as bitingly cold as before, and he looks content.</p>\n<p>Content with what, Junko has no idea. She kind of wants to throw herself out the window, but then Greenie starts to speak, and she immediately perks up.</p>\n<p>“Kacchan,” he says, and his <em>voice,</em> God, but his voice. Firm like a commanding angel and soft like the downy feathers of a baby bird, and Junko desperately wants to listen to him speak for forever.</p>\n<p>The blonde one’s smirk grows larger, head lightly tilting in acknowledgement.</p>\n<p>His name is Kacchan? It doesn’t fit him at all. It sounds like a nickname but too childish to be anything but a form of mockery. But the way Greenie said it was… soft, almost loving. Like there were decades of memories packed into one word, a command and a beckon all at once.</p>\n<p>Nothing about this situation is doing anything to convince Junko that the adorable and slightly scary boy that had walked in <em>isn’t</em> a god.</p>\n<p>“Todoroki,” he greets next, turning with a soft smile to him and the Todoroki guy nods back easily, still smiling. It looks a little awkward, like his face isn’t used to smiling all that much, but it’s so genuine Junko thinks she just might cry.</p>\n<p>Greenie smiles back even harder, and Junko can definitely feel the tears prickling at the corner of her eyes from the force of his smile.</p>\n<p>“Sorry I’m late,” Junko’s New God softly apologizes.</p>\n<p>Junko can barely hear him, his voice low and scarcely audible from the front of the classroom to where she sits in the middle of the room. She leans forward to try and hear him better, straining to catch his words.</p>\n<p>“All Might and Mr. Aizawa had some last-minute information about the raid next week – it just came in from your dad,” he says, nodding at Todoroki at the end of the sentence. “Nothing urgent, but still necessary to know for later, after we finish with this.” He gestures behind him to Junko’s class, and Junko fights the urge to duck under her desk at the motion.</p>\n<p>Todoroki and Kacchan both perk up at Greenie’s words, interest playing in their eyes.</p>\n<p>Did he just say All Might? The previous number one hero? Junko knows he teaches at UA now, but she doesn’t have any classes with him this year, as he’s solely been teaching the upperclassmen and working closely with the third year’s hero courses.</p>\n<p>Wait, did he also mean Endeavor?</p>\n<p>Before Junko can begin to even try and properly slot this new information into her brain according to importance, Greenie speaks again, quickly shutting his classmates down before they get too excited, shaking his head with a fond smile.</p>\n<p>“I’ll tell you both later,” he promises, and finally steps between them, naturally taking point in front of them, the other two flanking each shoulder like terrifying sentinels. “We already have a task at hand, don’t we? It’d be rude if we kept them waiting anymore.”</p>\n<p>At that, he turns towards the class with a beaming smile, eyes narrowing and crinkling in the corners with apparent happiness.</p>\n<p>Junko’s heart tries to leap from her chest, and she slams her fist right above it on her chest to try and still it.</p>\n<p>She ignores the weird look she gets from Goda, who has been staring at her (probably from all the weird wheezing noises she’s been making since the Green God walked in) for a couple minutes now and trying to catch her attention.</p>\n<p>She ignores him and doesn’t feel guilty at all because Greenie started talking.</p>\n<p>“I apologize for the tardiness,” Greenie says, bowing slightly to the class. “It was both rude and a bad example, so I promise to avoid being late to any future meetings to the best of my ability.”</p>\n<p>Junko wants to stand and pull him up, to let him know he doesn’t need to apologize for something as insignificant as being barely late when his mere presence saved them all from certain death courtesy of the other members of the big three, but the Kacchan guy gets there before she even gets the courage to stand up from her seat.</p>\n<p>He tugs at his shoulder, pulling him up with brisk and sure movements, as if he’s done it a hundred times before.</p>\n<p>“Tch, nothing to apologize for, dumbass,” Kacchan says gruffly, laying a hand almost possessively on the back of his neck once he’s standing upright. “We’re here, so just get to the fucking point already and start the shitty introductions.”</p>\n<p>Todoroki places a reassuring hand on Greenie’s shoulder, nodding to Junko’s quiet, dumbstruck class.</p>\n<p>“It’s fine, Midoriya, it was only a few minutes,” Todoroki reassures. “We should get started.”</p>\n<p>“Right,” Greenie – Midoriya? – says, nodding his head with determination.</p>\n<p>He turns back to the classroom, seemingly uncaring for the hand gripping his neck or the other hand resting heavily on his shoulder.</p>\n<p>“Hello everybody, my name is Midoriya Izuku,” he introduces with another wide smile, bowing slightly again. “I’m from class 3-A, and it’s a pleasure to meet you all.”</p>\n<p>He raises his right hand, gesturing over his opposite shoulder at Todoroki, and Junko immediately notices that it’s covered with gruesome scars twisting around the front and back, disappearing into his sleeve. Despite the grisly scars, his hand doesn’t shake. They’re slightly intimidating, fingers all gnarled and twisted under each one, and Junko wants to trace them with her fingertips.</p>\n<p>Before Junko can punch herself in the chest again for the strange urge, Midoriya speaks up, introducing Todoroki.</p>\n<p>“This is my classmate, Todoroki Shouto, also from class 3-A,” he says, and Todoroki briefly dips his head, face a blank slate again, the smile from earlier gone as he addresses her class.</p>\n<p>Midoriya drops his hand and smiles even further (Junko feels like that shouldn’t be possible, but she’s not complaining as she basks in his presence), shoulders turning slightly to the angry blonde.</p>\n<p>Kacchan, was it? Such a strange name.</p>\n<p>Midoriya almost looks like he wants to be bouncing on his toes, the excitement at announcing his other classmate vibrating his entire body.</p>\n<p>“And this is-” he starts, but he’s cut off by a gruff, low voice.</p>\n<p>“I’m Bakugou fucking Katsuki.” Blondie punctuates his sentence with a hushed snarl, taking a half-step forward and making half of Junko’s class (including herself) flinch back in their seats. </p>\n<p>Todoroki rolls his eyes at the domineering display, turning towards Bakugou with a bored look, and drops his hand from Midoriya’s shoulder.</p>\n<p>(Ah, Junko remembers Bakugou from the previous sport festivals. Can’t believe she forgot, what with the continuous angry face and booming voice.</p>\n<p>So… not Kacchan. Why’d Midoriya call him that then? Is it his hero name?</p>\n<p>Junko eyes Bakugou critically, noting the angry furrow in his eyebrows and his constantly tensing and curling hands.</p>\n<p>No, too friendly and childish for a hero name considering the guy looks like that split second of quiet before dynamite goes off and his presence feels like the physical manifestation of a Molotov cocktail.</p>\n<p>Then why that name?)</p>\n<p>“Really, Bakugou?” Todoroki asks, lips quirking in a sardonic smile. It’s terrifying, and Junko wishes he would just stop smiling entirely if that’s what the other versions of his smiles look like.</p>\n<p>“Got a fucking problem, Icy-hot?” Bakugou snaps, dropping his own hand from Midoriya’s neck to turn threateningly towards Todoroki.</p>\n<p>There’s suddenly an oppressive weight on Junko’s lungs, the room plunging into tight tension as the two stare each other down.</p>\n<p>Not again, she <em>can’t</em> go through this again, she really can’t.</p>\n<p>Before she even has the chance to brace herself for whatever the hell happens when those two argue, Midoriya turns around, placing a hand on Bakugou’s shoulder and shooting a smile in Todoroki’s direction.</p>\n<p>And, immediately, just like earlier, they calm down, Bakugou leaning into Midoriya’s touch and Todoroki’s shoulders slumping as he returns a fond smile back at Midoriya.</p>\n<p>Okay, literally what the fuck.</p>\n<p>“Kacchan,” Midoriya softly reprimands, sliding his hand down and squeezing his arm. “Let’s just get this done with, yeah? We can all spar later, but please don’t make the students cry. Again.”</p>\n<p>Again? Junko’s honestly not surprised but she swears to steer clear of Bakugou as much as possible.</p>\n<p>“Yeah, what-the-fuck-ever,” Bakugou grumbles, but he doesn’t shake Midoriya’s hand off. His anger still simmers just below the surface, like oil waiting for a spark to catch, but he calms down a bit.</p>\n<p>Midoriya merely raises an eyebrow at Todoroki next, and Todoroki backs down, slightly chastised. He still shoots a look at Bakugou, who sneers right back as soon as Greenie turns around.</p>\n<p>“Alrighty!” Midoriya suddenly claps, loud and sharp, and Goda almost falls out of his chair next to her, along with most of her classmates who are still recovering from the stand-off between Todoroki and Bakugou.</p>\n<p>Junko snickers, ignoring the sharp look Goda shoots at her.</p>\n<p>“Now that we’ve introduced ourselves, I’ll tell you why we’re here!”</p>\n<p>His cheery voice makes her class perk up, excitement bubbling in the air. The Big Three don’t just show up in first years’ classes for no reason, after all. Junko bounces in her seat, unbelievably eager for whatever Midoriya has to tell them.</p>\n<p>“Today, we’re going to take you all down to Gym Gamma, and you’ll be joining with Class 1-A. I highly encourage you all to change into your gym uniforms and bring any support items you <em>have</em> to use. But! Only bring them if you have to,” Greenie explains, grinning wider at the wide array of expressions he must be seeing.</p>\n<p>“No cheating, or else you can say goodbye to them.”</p>\n<p>Some people look shocked and Bakugou snickers behind Midoriya, excited at the prospect of destroying property.</p>\n<p>From confusion to palpable eagerness, Midoriya takes all their reactions in eagerly, his wide smile settling into his face steadily.</p>\n<p>“And, no, I’m not joking,” he says, and Junko believes him.</p>\n<p>Bakugou grins madly, stepping up to Midoriya’s side, and Todoroki steps forward as well, but his face remains neutral. It’s just as terrifying as Bakugou’s “I eat babies for breakfast” smile simply because Junko can’t discern any level of emotion from him, which could mean <em>anything.</em></p>\n<p>“Once everybody shows up to Gym Gamma, we’ll explain the exercise we’re doing further. Be prepared for anything! After all, here at UA, we go beyond!” Midoriya calls, putting his fist in the air and waiting with giddy anticipation for the class to finish the phrase.</p>\n<p>Bakugou rolls his eyes, but raises an open hand to shoulder height, small explosions popping in his hands, and Todoroki raises an unenthusiastic fist of his own, staring off into the distance somewhere.</p>\n<p>Midoriya only grins wider and clenches his fist tighter, enthused by his friends’ lukewarm support.</p>\n<p>Junko grins, her bones thrumming with exhilaration, her own fist joining the air as she yells out with the rest of her class, “Plus Ultra!”</p>\n<p>The class soon devolves into excited chatter from there, everybody getting up or putting their things away.</p>\n<p>Junko peeks up at Midoriya again, standing slowly from her seat and watching as he enthusiastically talks with their teacher, hands moving in broad gestures and curls shaking with his nodding head.</p>\n<p>Bakugou stands fairly close to his side, almost touching, and makes juvenile faces at Todoroki. Todoroki doesn’t even seem to notice, grimacing at something on his phone. It’s not nearly as interesting as watching Midoriya be so absorbed in his conversation.</p>\n<p>Goda shakes her from her stupor, rattling her brain as he takes hold of her shoulders and yanks her back and forth roughly. She yelps, eyes breaking from Midoriya to look down at Goda in surprise.</p>\n<p>He simply raises an eyebrow when she blushes at being caught staring at Greenie.</p>\n<p>“Saizen, what’s wrong with you? I’ve literally never seen you blush at anything before – it’s scary,” he says, stepping back from her and stuffing his hands in his pockets.</p>\n<p>He’s shorter than Junko, coming up to her nose on his tiptoes but still taller than most of her classmates, and has pale blue hair with long eyelashes that flutter over dark eyes – and if Junko’s being honest, the ugliest fucking smile she’s ever seen (which she thinks with fondness).</p>\n<p>She huffs, trying to force her blush down through sheer force of will, and stacks up the books on her desk to slip them into her bag.</p>\n<p>“Whatever, shut up,” Junko says, before standing to her full height, peeking over the heads of her classmates to see if the rest of her classmates were ready to go.</p>\n<p>“Yeah, okay,” he says sarcastically, rolling his eyes, but stands as well, a grin tugging the edges of his lips.</p>\n<p>“You excited for the exercise?” Goda asks, rolling back and forth on the balls of his feet.</p>\n<p>“Yeah, even though we don’t know jack about it,” she says, smiling back, a mixture of excitement and nervousness humming in her veins.</p>\n<p>“Still, did you see the way that Midoriya kid came in and immediately calmed them down?” Goda says, turning towards the front and beginning to walk up the aisle to the door, following the flow of the rest of their class. “Dude, I wanna fight him, I bet it’d be fun. You think that’s what the exercise is, sparring with them one-on-one? They told us to be in our uniforms and bring our support items, so it’s possible. If so, I can’t <em>wait</em> to take him on.”</p>\n<p>At Greenie’s name, Junko perks up, tuning out the rest of Goda’s rambling and looking to the front corner of their room in hopes of catching a glimpse of him again.</p>\n<p>But he’s nowhere to be found, and neither are the other Big Three, the space vacated and only their teacher standing at the door, directing their class out and to the locker rooms.</p>\n<p>She sighs wistfully, murmuring under her breath absentmindedly as she thinks of Midoriya’s smile. “Yeah, me too.”</p>\n<p>Goda reaches back and flicks her in the forehead, snorting when she cries out in offense.</p>\n<p>“I’m starting to think we have different meanings of what 'take him on' is implying,” he says, hooting when Junko dives for his neck and misses, intent on putting him in a strangle hold and her face blushing madly.</p>\n<p>Junko can hear Terada laughing at her from the back of the classroom and sees all the semi-sarcastic agreeing nods from different classmates about 'taking Midoriya on' from the corner of her eye as she reaches for Goda again, and <em>God,</em> she really wishes she could jump out of a window right now.</p>\n<p>“Shut the fuck up!” she cries out and chases him out of the classroom.</p>\n<p>They trip and shove each other down the halls and stairs, pulling their classmates into their game until they have to split for their respective locker rooms, both of them breathing heavily and in satisfaction for landing solid hits on each other.</p>\n<p>Junko races through changing into her gym uniform, hastily brushing her dark hair back from her face and meeting back up with Goda as they quickly walk to Gym Gamma. The nervousness is starting to set in now that they’ve changed clothes and locations, and their walk to the gym is easily quieter compared to their game of punch-tag in the hallway earlier.</p>\n<p>When they walk through the doors, they see Class 1-A already milling about, standing in the center of the empty room, and talking in groups.</p>\n<p>“You see them?” Goda asks, craning his neck back and forth for any sight of the Big Three.</p>\n<p>Someone from Class 1-A answers his question, shaking their head and stepping forward. “They weren’t here when we came in.”</p>\n<p>“Yeah, I don’t think they’re here yet,” Junko agrees as their class combines with Class 1-A’s, and immediately eats her words, yelping when she hears a familiar, low but loud voice behind her suddenly answer their question.</p>\n<p>“Wrong!” he yells, laughing when Junko spins around, expression harried and fists up.</p>\n<p>Bakugou cackles freely, uncaring for the frightened expressions his laughter brings. Junko relaxes, but only marginally. How can someone so loud sneak up on all of them so well?</p>\n<p>The Big Three stand a good distance behind them, all in various states of dress. They’re all still in their uniforms, but their jackets have been taken off, all their ties missing.</p>\n<p>Bakugou’s shirt is unbuttoned… quite a bit, actually, and Junko fights from staring at the muscles of his chest for too long (he might honestly have a bigger chest than she does), the remaining buttons from mid-chest down straining to hold his shirt together.</p>\n<p>It’s still untucked like it was when he walked into their classroom, but now Junko can see that he’s wearing a short-sleeved button up, hands stuffed in his pockets as the short sleeves practically cling to his biceps. He stands aloof and unbothered, a smug grin sitting on his face as he judges them all.</p>\n<p>Junko avoids his gaze and looks at Todoroki.</p>\n<p>Todoroki’s wearing a normal, long-sleeved button up in contrast, but his sleeves are rolled up to his elbows, defined forearms on display as he folds them across his chest. If Junko squints, she can see the faintest hints of red hair on one arm and silvery-white hair on the other. Huh, so not a dye.</p>\n<p>His shirt is also unbuttoned, but only by one, the collar open and his shirt tucked in. He looks like he wants to be anywhere but here, highly disinterested as his eyes dart between one student and the next.</p>\n<p>Junko avoids his gaze, too, and steels herself, clenching her fists and praying for stability before she finally looks at Midoriya properly for the first time since they came into the gym.</p>\n<p>She still feels the breath get knocked from her chest for absolutely no good reason, because compared to his companions, Midoriya is dressed almost exactly the same as he was before, disregarding the jacket and the tie.</p>\n<p>His shirt is buttoned up all the way to the collar, his sleeves buttoned at the wrists and covering the scars that continue to crawl up underneath the fabric, with his shirt tucked firmly into his pants. He’s even wearing a belt, with a subtle All Might insignia on the buckle.</p>\n<p>Junko fails to ignore the way his pants seem significantly tighter around his thighs than both Bakugou’s and Todoroki’s.</p>\n<p>And as she continues to fail at keeping her eyes from trailing downwards, she notices that Greenie has some strange metal contraption on his red high-tops, covering the toes and connecting around the back. Junko peeks at Bakugou’s and Todoroki’s shoes, but they’re both wearing their own boots, different in style but nothing even close to the black metal on Midoriya’s shoes.</p>\n<p>They look heavy, like every step will shake the ground, and Junko starts to feel her gut tighten up with anxiety.</p>\n<p>Goda might be right.</p>\n<p>The Big Three take point in front of the combined classes, simply waiting shoulder to shoulder with Midoriya once again in the middle as they wait for all the first years to quiet down.</p>\n<p>Once they’re all quiet enough to hear a pin drop, Midoriya takes point once more, face neutral and hands flexing at his sides. He looks determined, the easy grin from before gone and his green eyes flashing in the gym lights.</p>\n<p>“My own upperclassman did this once with my class,” Greenie starts, and for some reason, both Todoroki and Bakugou grimace, Bakugou pouting behind Midoriya.</p>\n<p>“At the time, it was only my class and one of the Big Three that fought us, but in honor of both tradition and the changing future, I thought it would be the quickest and most sufficient way of showing you all the work and time it’s taken for us to reach the point we’re at today, with both our quirks and the knowledge we’ve gained.”</p>\n<p>Midoriya lifts his fist, and Junko gasps in awe along with everybody else at the green lightning that flickers over his knuckles and around his wrist. His shirt seems to strain the slightest bit around his arms as the lightning flows freely around his fingers.</p>\n<p>“You’ll all be starting your own internships soon,” he says, letting the lightning die out, “and some of you will quickly begin your work-studies after.”</p>\n<p>Midoriya makes eye-contact with Junko, and she shivers at the intensity in his eyes.</p>\n<p>“These weeks where you’ll work in close contact with heroes of your choosing will be some of the most important hands-on experience you’ll gain during your time as a UA student. It’ll be hard, it’ll be tiring and at some points frustrating. You’ll see where you want to be, see the heroes directly in front of you with all their strength and experience and compare it to the progress you’re making, and be disappointed at the pace you’re going, at the minimal amount of growth that you can see.”</p>\n<p>He gestures to himself and to the other Big Three, who have gone still as they watch Midoriya with the same rapture their classes are watching him with. Junko’s breathing has stilled, as she sees Midoriya speak with a passion she rarely sees in those around her.</p>\n<p>“You’ll see us, and you won’t see the years and years of work and blood and sweat we’ve poured into honing our quirks and building our strengths. You’ll see our quirks before you see us, and then you’ll see us as we are now, graduates almost ready to join the field, stronger and more ready than you are right now, and you’ll want to be stronger, quicker, smarter as soon as possible to reach the level we’ve struggled to achieve.”</p>\n<p>“You need to <em>work,”</em> Midoriya says. “You need to learn and struggle and fail, and then recognize your potential and capabilities. These work-studies and internships will be crucial for that – but only if you take it seriously.”</p>\n<p>Midoriya suddenly grins, and rolls his shoulders back, stepping back to be in line with Bakugou and Todoroki, who have shifted their stances to be lower, bodies more parallel with the ground and their hands faintly stretched out from their bodies.</p>\n<p>“But talking about it will only convince you so much,” Midoriya declares. “So, we’ll show you the product of these work-studies and our constant struggle to get better, to be the best, to be a hero the people can count on.”</p>\n<p>Bakugou suddenly speaks, voice a low-timbered growl, grinning maniacally. “Bring it the fuck on extras! I’ll beat you all!”</p>\n<p>Midoriya grins wider, if that’s even possible, and nods his head. “Fight us, show us what you’ve learned! And we’ll show you just how much we’ve learned!”</p>\n<p>Junko gulps, swallowing sharply. Fuck, Goda <em>was</em> right. Are they crazy?! They’re third years! They’re the Big Three! And they wanted them to fight?!</p>\n<p>“Have fun,” Junko’s teacher says, but he’s not even looking at her class! “Try not to kill anyone,” he advises, and he’s smirking at the Big Three, stepping back towards the wall. Junko wonders if this is what betrayal feels like, as she watches him leave her and her classmates to the wolves.</p>\n<p>They all stand there, quirks activated and ready to go at the earliest moment, and Junko puts her fists back up, taking her usual stance. The air is thick with anticipation and anxiousness, and Junko shakes a little as adrenaline starts to flood her veins.</p>\n<p>Goda is bouncing back and forth on his feet, a manic grin of his own on his face as he stares directly at Midoriya, but still, no one moves.</p>\n<p>At least not until Bakugou screams, “DIE!”</p>\n<p>Several of her classmates automatically scream back in fright, and it starts.</p>\n<p>Their classes run forward, sizing up the Big Three, and immediately get knocked out by an exploding fist, courtesy of Bakugou who had immediately jumped into the fray.</p>\n<p>It’s a whirlwind of shouts and grunts, quirks firing off everywhere as all forty students attempt to simply <em>touch</em> Bakugou and Todoroki. They’re getting knocked down and out like flies, one by one, left to right, and Midoriya hasn’t even joined the fight yet.</p>\n<p>Junko barely steps back as Todoroki skates by on his ice and knocks Terada off his feet and a good ways away, immediately whirling around in a swirl of flames to flip Watase onto her back.</p>\n<p>Bakugou is cackling madly as he blasts off left and right, obviously having fun, and Junko avoids him as best she can, seeing from the corner of her eye Goda breaking off from the main group and sprinting directly towards Midoriya.</p>\n<p>Junko will bring flowers for his grave, as long as she doesn’t die here as well, as she ducks and weaves between the whirlwinds that are Bakugou and Todoroki.</p>\n<p>To be fair, Midoriya seems to be taking Goda seriously, furrowed brows and a determined set to his mouth preceding the shift in his stance as he crouches closer to the ground.</p>\n<p>Goda lashes out first, hands dark green and glowing, but Midoriya easily dodges, tripping Goda up right after.</p>\n<p>As Goda falls, Junko can hear Midoriya call out praise to him.</p>\n<p>“That was a good first move! A little rash, but clearly well practiced and angled,” he says, as he jumps over Goda’s leg sweep. “I recommend trying to telegraph it less in the future, maybe faking the first move to take your opponent off guard.”</p>\n<p>Goda gets back up, blushing, and reaches for Midoriya again, who says, “Ah, a five-finger activated quirk, interesting. You should definitely look to work with a close combat hero,” and then immediately punches – albeit <em>softly</em> – Goda in the head, who drops like a sack of potatoes.</p>\n<p>Junko’s mouth drops open, and then she falls to the floor as Katsuya goes flying over her head, a screaming Bakugou giving chase and instantly catching up to her classmate, tackling her to the ground.</p>\n<p>Midoriya jumps into the fray as soon as Goda falls to the floor without a sign of getting up and starts to take on multiple students at once, giving them no time to adjust to the new opponent – all while throwing out words of encouragement and bits of advice as he takes them down.</p>\n<p>He doesn’t even seem to be using his quirk, and Junko can literally feel herself falling in love as she watches him fight like he’s having fun, like they’re actually a challenge for him to take seriously.</p>\n<p>The metal shoe finally seems to be put into use as Junko sees Ueno charge at Midoriya, antlers first, only for Midoriya to easily sweep him away with a high kick, his foot slamming into Ueno’s side with a solid sound and flinging him into a kid from 1-A.</p>\n<p>He turns around, and Junko realizes he’s looking at her. It’s her turn.</p>\n<p>She ducks in, using her height over Midoriya to try and land a punch, hoping it’ll make contact and allow her to take in some of his strength, but he easily dodges, and lashes out with another kick, the same one he used on Ueno.</p>\n<p>Junko jumps away from its range, ducking under it and throwing another punch.</p>\n<p>“Good job!” Midoriya calls, delighted even as he avoids her fist. “Studying my moves from another fight and putting it to use! That’s some good observation skill!”</p>\n<p>The praise stuns Junko, and she suddenly stops, standing in a dazed stupor and slightly swaying as a deep, intense blush climbs over her face. She stares wide eyed at Midoriya’s smile and doesn’t even notice when the top of his foot connects with her ribs, kicking her across the room.</p>\n<p>She goes down, and stays there, grinning like a dope up at the ceiling and ignoring the various screams as the rest of her classmates succumb to the might of the Big Three.</p>\n<p>Greenie praised her! He smiled directly at <em>her</em> and praised her! And the flexibility of his kicks, the strength and force of his legs… Junko’s sufficiently gone.</p>\n<p>She’s out of it for the rest of the fight (which is barely a minute more) and stays in that haze for a while longer even as Goda reaches down and pulls her upright.</p>\n<p>He’s muttering something that sounds suspiciously like <em>fe fi fo fum</em> as he hauls her upright, complaining about her height the entire time, but Junko doesn’t even have the spare brain cells to punch him for it.</p>\n<p>She’s still thinking about the moment Midoriya smiled at her before kicking her across the room.</p>\n<p>When they join the others, all nursing their own minor injuries, the Big Three start talking.</p>\n<p>Junko barely listens as Midoriya explains that they didn’t win over both their classes just because their quirks were strong, but because they worked hard and pushed themselves to their absolute limit, and beyond.</p>\n<p>When he talks about their experiences in the work studies and accepts questions from her classmates, she formulates a plan.</p>\n<p>After they’re dismissed, she’s going to find Midoriya, and talk to him.</p>\n<p>To say or do what, she doesn’t know yet, but she doesn’t want the giddy feeling in her chest to go just yet and being around Midoriya is like being in the direct presence of the sun – addicting, a little dangerous, but so warm and bright she can’t help but want to stay in its light for a while longer.</p>\n<p>She’s staring at Midoriya while he talks, her face visibly lovestruck and covered in a heavy blush. She doesn’t notice the frowns Bakugou directs at her, or the way he steps closer and almost possessively to Midoriya’s side, a hand resting on his lower back as he talks.</p>\n<p>They’re dismissed to change, and Junko anxiously waits as she watches the Big Three disappear out a different door than her class and Class 1-A. They break off, Midoriya and Bakugou going left, while Todoroki goes right with a wave goodbye to the other two.</p>\n<p>Shooting a quick glance at her teacher to make sure she’s not being watched, she darts towards the door Bakugou and Midoriya walked out of, turning left as soon as she’s outside.</p>\n<p>Junko frowns, looking for Midoriya in the empty space, but he’s not there. There’s nothing here, really, except for the corner of the building and some grass, so Junko slowly walks towards the corner, a little wary.</p>\n<p>As she gets closer to the corner, she hears sounds, strange sounds, almost… <em>wet</em> sounds.</p>\n<p>She creeps closer, peeking around the corner, and immediately twisting back around and slamming her back against the wall, hands coming up to cover her gasp before it can escape.</p>\n<p><em>Oh my god!</em> she thinks, face heating up. There’s no way, absolutely no way. She looks again, quickly, and immediately slams herself against the wall again. <em>Holy shit!</em></p>\n<p>She peeks back around, slower, more carefully this time, and watches as Bakugou absolutely <em>devours</em> Midoriya’s mouth, head twisting and tongue moving as he sucks Midoriya’s soul out of his body.</p>\n<p>Bakugou’s pushing him against the wall, both hands on Midoriya’s ass, Midoriya’s legs wrapped tightly around Bakugou’s waist, but with his knees hooked over Bakugou’s arms, feet dangling with the weight of his metal-covered shoes.</p>\n<p>It’s such a provocative image, the position too similar to that of one without clothes on, that Junko can’t help her desire to be the one holding Midoriya up, to be the one between his thighs, to make him dazed and flushed with desire, lust spilling out of him.</p>\n<p>But it's <em>not</em> her who's doing all this to Midoriya. It's fucking <em>Bakugou</em> of all people, and Junko has never felt more jealous in her life.</p>\n<p>When she focuses back in on Midoriya after trying to compose herself, she sees spit escaping from the corner of his mouth, and immediately fails at keeping her composure, muffling a squeak with her hands.</p>\n<p>Midoriya is as red as Junko feels, eyes half-lidded and hands clutching desperately to Bakugou’s hair.</p>\n<p>His shirt’s a mess, the previously buttoned collars at his neck and wrists suddenly open, the fabric rumpled and creased, red marks littering his now bared neck and leading down to his chest – he looks utterly debauched, courtesy of Bakugou, and like he’s <em>enjoying</em> it.</p>\n<p>Bakugou backs off with a wet <em>pop</em> and Midoriya gulps in lungfuls of air, chest heaving and mouth open as he tries to catch his breath.</p>\n<p>He’s staring up at Bakugou with his desire flayed directly on his face, a spacey smile turning the corner of his lips, and Bakugou stares right back, licking his lips hungrily and smirking at the sight in his arms.</p>\n<p>“Kacchan,” Junko hears, a soft, breathy moan of Bakugou’s name, and Junko wants to <em>scream.</em></p>\n<p>“Kacchan, why are you-?”</p>\n<p>“You looked damn good out there, baby,” Bakugou growls, and Junko has to hide another gasp, twisting back around the corner and sinking to the ground.</p>\n<p>She rests her head on her knees, eyes wide and unseeing as she tries to comprehend everything she just saw and heard, trying to ignore her own reactions and the desire to see Midoriya like that and in a million more ways.</p>\n<p>“But we were just fighting with the first years,” Midoriya protests, but it’s interrupted half-way with another gasp, the wet sounds of kisses placed on skin invading Junko’s ears.</p>\n<p>“Yeah, and you looked hot as fuck doing it,” Bakugou says, and Junko peeks back around the corner, still on her ass on the ground, chest heaving despite doing absolutely nothing – but she can’t help it; they suddenly got quieter.</p>\n<p>They’re- Jesus save her soul, but they’re <em>grinding</em> against each other, Bakugou’s mouth completely covering Midoriya’s whole, swallowing every sound he makes as he continually pushes Midoriya against the wall with his hips.</p>\n<p>Midoriya’s leg twitches, hands clutching Bakugou’s shoulders with eyes rolling back as Bakugou gropes his ass, and Junko stands up in a hurry, blushing heavily as she runs back to the gym.</p>\n<p>She doesn’t give mind to the fact that she’s making a lot of noise as she runs, nor to the way the door slams shut behind her as she sprints away, Midoriya’s breathy voice echoing in her ears as she goes.</p>\n<p>She <em>needs</em> to get out of there before she does something stupid or develops anymore of a thing for Midoriya when he’s <em>clearly</em> already taken.</p>\n<p>-</p>\n<p>Katsuki peeks from the corner of his eye, moving to mouth at Deku’s neck and huffing in smug satisfaction when the dark hair of the tall, first year chick who had been making eyes at Deku the entire fucking day finally disappears.</p>\n<p>He grins wider against Deku’s neck when the gym door bangs shut a few seconds later and Deku doesn’t even notice, too caught up in Katsuki’s touch and scent and desire.</p>\n<p>He backs off to look down at Deku, who’s gasping and smiling from where Katsuki had shoved him against the wall and can’t help the pleasant curl of affection and desire that twists in his chest when Deku murmurs his name and tugs Katsuki closer again by the grip on his hair. </p>\n<p>He tightens his grip on Deku’s ass, traces over his freckles with his tongue, and kisses Deku until he can’t breathe anymore.</p>\n<p>His, Deku is all his.</p>\n<p>The next time the Big Three do something involving Class 1-B, Katsuki takes immense satisfaction in the fact that the girl can’t even make eye contact with him or Deku without choking on nothing and heavily blushing.</p>\n<p> </p>\n<p>4. Sidekicks</p>\n<p>See, in retrospect, Eijirou doesn’t think he can do anything more than he is right now. He also doesn’t <em>want</em> to do any more than he is right now, but that’s irrelevant.</p>\n<p>Because, well, Midoriya just updated his costume, going for a more streamlined version of his previous suits to introduce himself as one of the new sidekicks at Endeavor’s agency. Eijirou did the same when he joined Fat Gum’s, so he gets it.</p>\n<p>Midoriya tightened some straps, added a few accentuating lines to help with his “movement speed” (Eijirou’s almost completely sure Bakugou was responsible for half of those updates), which, sure, yeah, Eijirou can see where it might have come into play with his actual hero work.</p>\n<p>The costume <em>also</em> emphasizes his, ahem, <em>assets,</em> if Eijirou was being completely honest – his bro has one hell of an ass, what can he say. Midoriya’s PR Team was having a whole field day with his new updated look.</p>\n<p>Gone was the somewhat mousy but also scarily jacked high-schooler, and in his place is this adorably hardened soon-to-be Pro Hero.</p>\n<p>And sure, Bakugou’s always been a little touchy about Midoriya, a little protective over their relationship due to all the unwanted attention and opinions they receive from strangers and the media.</p>\n<p>He’s always been a little needy and possessive over his man, just as much as Midoriya is over him. No big deal, they all knew how to handle him at his worst, Midoriya better than them all combined.</p>\n<p>And yeah, okay, most villains are pretty vulgar in hopes of catching the heroes off guard and messing them up. Eijirou gets that, he experiences it in most encounters with villains. They shoot off from the mouth whatever comes to their brain in the faintest hope that it’ll give them a few seconds advantage to either run or one hit K.O. the heroes.</p>\n<p>Except, most villains seem to forget that the newest generation from U.A. regularly trained with Bakugou, so they were long desensitized to anything that was said to them. Even Iida learned to tune it all out and not rise to the bait, though he still manages to reprimand the villains for their language once they’re in custody.</p>\n<p>But nobody can quite get under one’s skin like a cocky Bakugou coming off several wins or an angry Bakugou coming off of several losses (thank you, Todoroki and Midoriya, for making it so much worse for everybody else on those days).</p>\n<p>But Bakugou just proposed last night (he had texted Eijirou out of the blue that he was “gonna marry the damn nerd” and then lo and behold, the massive group chat for all graduating heroes in their generation and their mentors got a text two hours later with Midoriya’s distinctive hand bearing a shiny new ring with a simple lock and key emoji underneath the photo to announce his engagement), and today’s the first day the new and upcoming Sidekick Deku is going out on patrol as a completely claimed man, gold ring and all, so honestly?</p>\n<p>It’s shit luck on the villain’s part, but… he also kind of brought it on himself.</p>\n<p>Eijirou watches the one-sided beat down with a mixture of amusement and sympathetic pain. He’s half-heartedly holding Midoriya back (who is, to be fair, not even trying to step in, but Eijirou’s gotta put appearances up for the media’s sake), but mostly cheering his bro on.</p>\n<p>And, since Midoriya really isn’t jumping in to stop it either, Eijirou doesn’t feel bad about calling out wrestling moves to “inspire” Bakugou.</p>\n<p>He’s not surprised. Really. Eijirou could’ve told anyone the outcome of this if they had only asked, but villains don’t necessarily ask questions first, let alone permission.</p>\n<p>When they heard the cacophony of sounds that was the burglary gone wrong, Eijirou was already in the area, and had been meeting up with Deku for a quick five-minute break. They had been patrolling their own assigned sections but ran into each other by pure coincidence.</p>\n<p>Eijirou always loves seeing his friends while they’re in uniform, as it leads to some pretty sick team-ups, so he had no problem walking and patrolling with Deku in his sector a little bit.</p>\n<p>That’s when they heard the screaming simultaneously.</p>\n<p>Some villain calling themself the Vengeful Raccoon (…Eijirou doesn’t even know, honest. He’s there to take villains off the streets, not comment on their less than stellar villain names) had tried to rob a store but wasn’t able to get far.</p>\n<p>Eijirou and Deku had arrived on the scene quickly, Deku pulling ahead with his speed as he always does and immediately engaging the villain while Eijirou went to pull a couple of bystanders that were standing too close to the scene away.</p>\n<p>But when Eijirou had turned back to the fight, assessing to see whether Deku needed back up or not, it was quite clear to him that it wasn’t a normal villain fight, as the villain was evidently a <em>fan</em> of Deku’s.</p>\n<p>“Hey, Deku, how much for a little more private one-on-one, eh? I could show you a real good time, if you know what I mean,” the villain calls out, dodging one of Deku’s kicks.</p>\n<p>His greasy, slicked back black and white hair falls in front of his face, and he tries to toss it back in an artful manner, but honestly it just looks like he lost a fight with a garbage disposal. His beady eyes don’t help, either.</p>\n<p>It costs him a direct kick in the head, given graciously by Midoriya’s metal boots, but the villain springs up like it was nothing.</p>\n<p>He sways where he stands, though, so Eijirou assumes it’s all for show.</p>\n<p>“What?” Deku asks, spinning in place as he lands on the ground.</p>\n<p>Eijirou can tell that he’s visibly confused, his speed faltering the slightest amount on the next kick, but Deku being Deku immediately recovers, lunging for the villain.</p>\n<p>“Let’s take this mano a mano to a bed, do a little tango by ourselves,” Raccoon leers, swiping at Deku’s side and narrowly missing, his hits coming closer and closer the more flustered Deku gets.</p>\n<p>“No?! Thank you?!” Deku gets out, face red, and Eijirou can’t tell if it’s from embarrassment or mounting anger.</p>\n<p>“Are you sure? I’m pretty on top of things as a villain in the underground; you wanna be one of those things?” the villain asks, wildly lashing out at Deku’s head and missing.</p>\n<p>“No, no, I’m good! I’m really good, no thank you!” Deku growls out, growing more agitated and more red as the villain keeps slipping between his hits and under his legs.</p>\n<p>Damn, his bro is so polite, especially to such a vulgar guy; Eijirou's proud of him. He doesn't know how long that'll last, though, because Deku's got a temper to match Bakugou's sometimes if the fights get long and frustrating enough. Which, the fight is certainly getting the more the villain spouts off.\n</p>\n<p>Eijirou feels for him, because most of this fight is being recorded, which means a lot of people are going to be seeing a raccoon-human villain hitting poorly on one of the most widely known and followed sidekicks. Oof.</p>\n<p>The villain pauses, panting with a wide grin, and rakes his eyes over Deku’s body lecherously, mumbling to himself, “What I wouldn’t give to get my hands on that ass. Just a nice, quick slap. See a little jiggle, a little shake.”</p>\n<p>He rubs his hands together, well, <em>villainously,</em> and Eijirou shakes himself from his shocked stupor, eyeing a gaping and blushing Deku.</p>\n<p>Eijirou doesn’t think he’s ever seen someone, villain or otherwise, hit on Midoriya so vigorously or so bad that even the bystanders are cringing. Mostly because there’s an explosive blonde deterrent usually stuck to Midoriya’s side, so it’s never really been an issue before.</p>\n<p>And, the few times Eijirou has heard about Midoriya rejecting people when Bakugou wasn’t around, Bakugou came up quite consistently in Midoriya’s refusals.</p>\n<p>Eijirou’s about to join the fight, because hitting on his bro in public like this just isn’t manly, especially when Midoriya’s already in a relationship and visibly uncomfortable, but he doesn’t need to.</p>\n<p>As the villain reaches out a hand clearly in the direction of Deku’s ass with the explicit goal of slapping it, a depraved smirk on his face the closer he gets to his objective, a series of loud explosions accompanied by very familiar yelling echoes in the air around them.</p>\n<p>In a matter of seconds, the sounds go from mildly loud to absolutely ear-shattering, and one very angry sidekick by the name of Dynamight blasts his way into the fight, almost blowing the villain’s hand off.</p>\n<p>“Hands <em>off</em> you bitch-ass motherfucker!”</p>\n<p>The villain screeches in pain and surprise, rapidly flapping his hands to put out the fire on them, and Bakugou quickly pivots, snatching Midoriya up and dragging him out of the way.</p>\n<p>“What the- Kacchan?!”</p>\n<p>“Tap out Deku, he’s mine!”</p>\n<p>“Okay? But Kacchan, I had it handled!”</p>\n<p>“Fuck off, you pasty-ass garbage-looking rat, all you villains are-”</p>\n<p>“I don’t think he heard me.”</p>\n<p>“Yeah, probably not.”</p>\n<p>“Hey, Kirishima – er, Red Riot?”</p>\n<p>“What’s up, bro?”</p>\n<p>“Do you think Kacchan is okay?”</p>\n<p>“He looks fine to me, why?”</p>\n<p>“…You see absolutely nothing wrong with,” Midoriya waves in front of him, gesturing to everything they’re looking at, “this?”</p>\n<p>“Stand the fuck up you cock-sucking shitty bastard!” An explosion emphasizes each insult. “Come here so I can-”</p>\n<p>“Nah, man’s just blowing off some extra steam, that’s all. Yeah, use the Lion Tamer, Dynamight!” Eijirou mimes the move.</p>\n<p>“Don’t you dare lay your filthy eyes on Deku or I’ll blast your balls so far up your body that for weeks you’ll be tasting your own-” The villain’s screaming isn’t quite as loud as Bakugou’s.</p>\n<p>“You know, I’m not so sure, Kirishima.” A collective wince from the bystanders.</p>\n<p>“Look at him go, so manly defending his fiancé’s honor! Dynamight, The Chair! Give him The Chair!” A bench is ripped up from the sidewalk.</p>\n<p>“Stop running you piece of shit, I’m gonna fuck you up so bad you’ll be shitting blood for months! Get back here so I can-”</p>\n<p>One of the kids in the audience cackles in a way very reminiscent of Dynamight’s cackling. Eijirou shudders at the similarity. </p>\n<p>“He’s sounding a bit more villainous than the villain himself.” Another collective wince from the audience as Bakugou lands on the villain’s back.</p>\n<p>Eijirou grimaces, because Midoriya <em>does</em> have a point.</p>\n<p>He claps his hand on Midoriya’s shoulder and walks towards where Bakugou is currently grappling the Vengeful Raccoon into submission.</p>\n<p>“Don’t worry Deku, I’ll reel him in,” he calls over his shoulder, hardening his body to deflect the various bits of shrapnel headed towards him as Bakugou explodes the ground around him.</p>\n<p>Bakugou continues letting out a never-ending litany of swears and insults, growing more vulgar and incomprehensible as he goes on. He’s saying something about a “dumbass felcher” when Eijirou cuts in, laying a hand on Bakugou’s heaving shoulders and tugging him away.</p>\n<p>“I got it from here, Dynamight. Go check on Deku, or something, keep him company,” Eijirou suggests, tugging Bakugou off the villain and wrapping a hardened hand around the villain’s wrists. The villain doesn’t even seem to notice, eyes dazed, lying face down and limp on the ground.</p>\n<p>Bakugou most definitely knocked something loose in the guy’s head, considering the one-sided beat down Eijirou just witnessed.</p>\n<p>At the reminder of his fiancé, Bakugou is immediately off the ground and running across the street to where Midoriya watches with a somewhat confused and worried look.</p>\n<p>Eijirou watches Bakugou crowd Midoriya, taking his gloves off with his teeth so he can touch Midoriya’s face with his bare hands. One of his hands tugs off Midoriya’s left glove, fingers fiddling with the shiny ring there, the other resting itself possessively on the back of Midoriya’s neck and underneath his cowl to pull him in.</p>\n<p>They share a moment, uncaring for the bystanders watching or the villain on the floor, eyes closed and simply breathing the other in.</p>\n<p>Eijirou has seen them do this same greeting multiple times before: sometimes, it’s off a long day of patrol and they need to calm down, other times it’s coming up on the tail end of a raid, a way for them to settle their nerves and promise to see one another on the other side, and a few rare times it’s when they’re both drunk out of their minds and forgot that everybody around them exists, walking like they've got one steady leg between them both and unwilling to stop touching the other.</p>\n<p>This time, it’s to settle something instinctual that had come unhinged in Bakugou’s chest, and to remind everybody else of their devotion to one another.</p>\n<p>Bakugou rests his forehead firmly against Midoriya’s, and his fingers run gently up and down the back of his fiancé’s neck while Midoriya places his free hand on Bakugou’s arm, fingers squeezing tight into Bakugou’s bare bicep.</p>\n<p>Eijirou turns around to give them a sense of privacy, a fond smile tugging at his lips as he hauls the villain up. Leave it to Bakugou to go from brutally kicking a villain’s ass for a few solid minutes to gently holding his love close to him. Only for Midoriya and no one else.</p>\n<p>The villain stands shakily with a confused light in his eyes and easily follows Eijirou as he leads him to an out of the way spot as they wait for the police to show up.</p>\n<p>“What,” the villain mumbles, head swiveling left and right, eyes unable to focus on anything – oof, the man probably has a concussion courtesy of Bakugou – as he tries to comprehend what just happened to him, “the fuck was that?”</p>\n<p>Eijirou forces the villain to stand upright, hands a firm deterrent against any escape, but the villain doesn’t even seem to be considering it.</p>\n<p>“That wasn’t very manly of you, Vengeful Raccoon,” Eijirou reprimands, bringing the villain’s attention back to him and away from Midoriya. Eijirou doesn’t think the villain can handle anymore straight punches to the head from Bakugou <em>or</em> Midoriya.</p>\n<p>“What the-” he spits up a mixture of blood and saliva onto the floor, head lolling to the side. “The fuck’re you talkin’ about?” the villain slurs.</p>\n<p>“Trying to hit on Dynamight’s fiancé? While Dynamight was in the area? Not a good idea, bro.” Eijirou shakes his head, <em>tsking</em> his tongue at him.</p>\n<p>The villain pales a bit, despite already looking thoroughly thrashed from the fight. “F-fiancé?”</p>\n<p>“Yeah.” Eijirou grins savagely, leading the villain past where Bakugou and Midoriya are wrapped up in one another to the approaching squad car. “Didn’t you hear? Deku’s already taken.”</p>\n<p>“Oh, fuck,” the villain manages, knees locking up, wide-eyes petrified when he makes direct eye contact with Bakugou over Midoriya’s shoulder.</p>\n<p>He’s glaring at the villain something fierce, half of his face tucked down into Midoriya’s neck, hand placed firmly on his neck and one finger brushing up and down the skin.</p>\n<p>Bakugou’s ring finger glints in the afternoon light, and the villain pales further, knees giving up on him.</p>\n<p>Eijirou starts to drag him once his body goes limp, easily hauling his weight across the street.</p>\n<p>“Oh, shit, oh, please, I’m sorry, I’m sorry, I didn’t know,” the villain rambles, face crumpling in despair.</p>\n<p>His voice warbles, tears springing up in his beady eyes as Eijirou grabs him by the back of his shirt to bring him upright for the cops cuff him.</p>\n<p>“Oh, I’m so fucking dead, I’m gonna die, I’m gonna die so many deaths, he’s gonna fucking kill me, I didn’t know, just kill me, please, help me-\"</p>\n<p>Eijirou laughs freely, shaking his head as he hands the villain off.</p>\n<p>Only Bakugou.</p>\n<p> </p>\n<p>5. Pro Heroes</p>\n<p>Despite what most people might think, Katsuki is a patient man.</p>\n<p>The difference between him and others though is that Katsuki chooses when to use his patience, saves it for when he absolutely needs it.</p>\n<p>When Kaminari fucks up the communication tech after goofing off like a dumbass, Katsuki doesn’t need his patience there. When Deku comes home, shaking and eyes blank from a failed mission, Katsuki needs his patience there.</p>\n<p>Katsuki doesn’t see the point in patiently rescuing the dumbfuck who climbed up a tree and couldn’t get down despite it being the fifth time they’ve gotten stuck and had to be rescued, but Katsuki will be as patient as God Himself when he’s working to make Deku come for the third time.</p>\n<p>As Katsuki watches from across the room, he digs deep into his chest and finds the patience he so rarely uses for anybody but Deku.</p>\n<p>This is the third time today the new intern – Katsuki couldn’t give two shits as to what their name is, and it won’t matter because they probably won't be here by tomorrow anyways – has distracted Deku with some inane flirting, distracted Deku away from <em>Katsuki.</em></p>\n<p>Katsuki shifts minutely on the desk he’s leaning against, clenching his fists tighter together from where they’re tucked against his sides, arms crossed against his chest to keep himself in check.</p>\n<p>He watches passively, face blank and mask off, eyeliner smudged after a full shift out on the streets. It’s the loudest warning anyone would need, and it’s obvious to all around him he’s in no mood to be played with, but the intern takes no heed.</p>\n<p>Katsuki’s not worried, is the thing.</p>\n<p>He knows Deku loves him, and that Deku knows he’s Katsuki’s heart manifested into a living, breathing thing. Katsuki knows that all the blood, sweat, and tears he’s poured into their relationship has made it the strongest thing in his life, has made it so he’s all but cemented himself at Deku’s side.</p>\n<p>But it doesn’t mean he’s not pissed.</p>\n<p>Years, they’ve been married for <em>years.</em> Hell, they’ve been together for more years than they’ve been apart now, and still fuckers think they have a chance with Deku, let alone deserve to talk to him.</p>\n<p>They’ve even been publicly presented as a married couple for years, despite not being a hero duo, as fuck all that means when they take almost all their missions and assignments together. Anyone who interviews at their agency to join their team already knows that Katsuki’s a married man, and that Deku specifically is <em>his</em> married man.</p>\n<p>It’s something the intern has elected to ignore for some reason, to their own detriment.</p>\n<p>Katsuki continues to watch the intern clumsily flirt with an oblivious Deku, watches them choose to flirt in front of everybody and specifically in front of Katsuki’s face, as if their meaningless words and paltry attempts for Deku’s attention hold any weight, and lets it amuse him.</p>\n<p>But it’s begun to annoy Katsuki, begun to drain him of his tolerance, and he feels something shift in his chest. He clutches tighter to the smidge of patience he has, staring resolutely at Deku’s side profile, and then forcibly relaxes.</p>\n<p>Not once does he look away from Deku, letting him finish his sentence in their conversation, before cutting the intern off.</p>\n<p>“Deku,” Katsuki calls, eyes serious and pensive, his face neutral to the wandering eye. He doesn’t get an answer right away, Katsuki’s voice too low and the room too loud for Deku to hear him from across the room.</p>\n<p>But the intern notices, and draws Deku further into the conversation, flashing Katsuki a smug look over Deku’s shoulder.</p>\n<p>No matter. Katsuki knows Deku <em>intimately</em> well. It won’t take much to truly catch his attention.</p>\n<p>Katsuki raises his voice, just a touch, and says, <em>“Husband.”</em></p>\n<p>The room doesn’t stop, the people around them don’t look up, but it <em>stills,</em> hushes itself as Deku suddenly straightens up at Katsuki’s call.</p>\n<p>Katsuki sees his shoulders hitch, just a little, and can imagine the little catch in his breath from the thousands of times before that Katsuki has heard it directly in his ear. Most times it’s accompanied by the sweetest of whines, but Katsuki relishes in the faint blush that’s started to crawl up the back of Deku’s neck and over his face instead.</p>\n<p>Katsuki waits, still leaning against the edge of the desk with his legs spread and arms crossed, eyes glued to Deku, and he's soon rewarded.</p>\n<p>Deku turns around, and his own eyes are completely focused on Katsuki. Katsuki's lungs seize from the intensity of Deku’s gaze and the ache he feels at forcing himself to stay still, to stop himself from launching across the room and taking Deku's face between his hands, but he still can’t help the hint of a smirk tugging at his lips.</p>\n<p>That’s right, he wants Deku’s piercing stare only on him, and what Katsuki wants, he gets.</p>\n<p>Katsuki still doesn’t move, but he tilts his head up, an indication for Deku to come over, beckoning him to come closer, always closer.</p>\n<p>And Deku immediately does, not even excusing himself from his conversation. He leaves the intern behind him without a second thought, and their expression is equal parts baffled and annoyed. They look two seconds away from stomping their foot in frustration like a toddler, and Katsuki quietly huffs in satisfaction.</p>\n<p>As Deku crosses the room like a man on a mission, people move out of his way, creating a clear path straight to Katsuki. It takes but a few seconds, and soon, Deku’s directly in front of him. He steps in between Katsuki’s legs, but he doesn’t touch Katsuki when he himself makes no move to touch Deku.</p>\n<p>Katsuki can smell the slightest hint of his cologne, faint from a day’s work of sweat and blood muddying the scent. It’s all Deku, all his husband, and Katsuki can’t help the deep sigh of pleasure he releases now that Deku’s finally within Katsuki’s space.</p>\n<p>“Yes, Kacchan?” Deku asks, eyes imploring and bright as he looks up at him, Katsuki taller even while leaning back on the desk.</p>\n<p>Katsuki tilts his head down, bending forward just slightly, and lets his voice wash over Deku, watching as his eyes flutter shut.</p>\n<p> “Where are your eyes, Deku?”</p>\n<p>\n<em>I missed you, pay attention to me, look only at me.</em>\n</p>\n<p>Deku’s eyes open, his gaze firm, as if he could read all of Katsuki’s thoughts from a few words alone.</p>\n<p>“On you, Kacchan, always on you.”</p>\n<p>“Good,” Katsuki says, voice low but pleased.</p>\n<p>Katsuki already knew what Deku’s answer would be, but each time he says it, confirms his affections verbally for Katsuki’s own selfish desire to hear it aloud, Katsuki’s heart grows another size, thudding painfully against his chest.</p>\n<p>Katsuki would answer the same, if Deku ever asks, would profess his love loud and clear for anyone to hear, but Deku seldom needs more than an <em>I love you.</em> Doesn’t mean Katsuki doesn’t constantly give him more, simply because he can’t hold it all in his chest lest it burst – and Deku always deserves the most.</p>\n<p>Katsuki tilts forward, arms still crossed, and watches as Deku’s eyes flutter shut once more.</p>\n<p>He lightly skims the shell of Deku’s ear, a kiss that’s barely even a brush of his lips and holds himself from doing more when Deku shivers. He makes eye contact over Deku’s shoulder with the fuming intern, and smirks again, tonguing the rim of Deku’s ear – and earning a delightful, muffled whine – just because he can, before turning his head to speak directly in Deku’s ear.</p>\n<p>“Wait for me at home, husband,” Katsuki murmurs, and then he backs away, straightens his spine and shoulders as he looks down at Deku again, cataloguing his heady blush and open mouth and twitching fingers, storing it all away for future, <em>private</em> purposes.</p>\n<p>Katsuki’s fingers ache to brush across Deku’s cheeks, to tuck away slips of his hair and hold him close, but he can’t, not yet. Not when Katsuki has something to do and something to say that would be at risk of tainting how he treats Deku in front of others.</p>\n<p>The reactions Katsuki gets from Deku are for Katsuki alone and the way he touches Deku is for Deku alone, for no one else’s eyes, and especially not for someone as insignificant as the intern across the room.</p>\n<p>He raises his voice slightly, just enough for everyone in the room to hear him say, “See you later, Deku,” and the quiet that had fallen over everyone is suddenly gone.</p>\n<p>Katsuki’s coworkers and employees are abruptly hyper focused, each person steadily working on their own tasks, and Katsuki doesn’t resist the urge to roll his eyes. Nosy bastards.</p>\n<p>His annoyance is tempered, as always, by Deku.</p>\n<p>“Of course, Kacchan,” Deku promises him with a smile, and places a hand on Katsuki’s shoulder for support as he leans in and kisses the edge of Katsuki’s jaw, his lips scraping the skin deliciously and so much like when he’s on Katsuki’s lap, riding, moving at a leisurely pace – and Katsuki has to close his eyes to pray for restraint at the faint touch.</p>\n<p>Deku steps away, eyes dark and a promise for later, then exits the room, leaving to clock out for the day.</p>\n<p>Katsuki steadfastly watches him leave, silent where he sits, and only moves once the door has swung shut behind Deku’s retreating figure.</p>\n<p>He uncrosses his arms to push off the desk with his palms and walks over to the intern, who suddenly looks like they’re regretting all their life choices.</p>\n<p>Katsuki’s arms lay deceptively lax at his sides, his hands loose and open as he walks at a steady, purposeful pace towards the other side of the room. For all intents and purposes, he appears calm, nonthreatening, so no one dares to impede his path.</p>\n<p>He stops right in front of the intern, bordering on leaning uncomfortably close, and says nothing for a very long and excruciating moment. He watches them fidget, shifting on their feet constantly and eyes darting to the people around them for silent support.</p>\n<p>But no one comes up to them, a wide berth of empty space suddenly appearing around them both as the people in the office let Dynamight handle the situation as he seems fit.</p>\n<p>Good to know his employees know when to do their jobs, Katsuki thinks, still watching the intern figure out whether to speak first or not.</p>\n<p>“D-Dynamight, Sir?” the intern stutters after a while. Katsuki can see them fighting the urge to step back into the wall behind them.</p>\n<p>Katsuki says nothing for a moment more, letting them suffer in silence, before he finally speaks.</p>\n<p>“Don’t even think about it,” Katsuki warns, deadly quiet. He stares down at the intern, looming over them, his usual glare and livid voice noticeably absent.</p>\n<p>“Think about-”</p>\n<p>The intern gulps mid-sentence, throat suddenly dry. Katsuki can see their throat working as they struggle to speak up and waits to see if they can pull themselves together and talk again.</p>\n<p>“Think about what, Sir?”</p>\n<p>Katsuki raises an incredulous eyebrow, a sneer fighting to crawl over his face, and the intern stumbles back a step, bumping into the wall behind them with a loud thump.</p>\n<p>Still, no one comes to offer them absolution.</p>\n<p>“My husband,” Katsuki starts, speaking slow and firm, eyes piercing straight through the intern's shaky countenance, “is kind.”</p>\n<p>Katsuki bends forward, his face cast into the shadows, eyes glinting like freshly spilt blood, and stops just a hairsbreadth away from the intern. </p>\n<p>This close, Katsuki can hear them taking short, gasping, almost inaudible little breaths, shoulders rising and falling at a rapid pace. Their eyes dart to and from Katsuki’s face rapidly, as if they can’t decide whether to stare Death in the face or not.</p>\n<p>Katsuki opens his mouth, and the intern flinches at the ice in his voice; his next words are almost a whisper, his voice a low rumble that seems to echo around them.</p>\n<p>“You will find that I am not.”</p>\n<p>It comes at a complete surprise to no one when the intern shows up to their shift the next day with their two weeks resignation in hand.</p>\n<p>Katsuki simply turns Deku away, a hand firmly around his waist, and listens to his husband talk about the details of a new case with a hidden, pleased smile.</p>\n<p> </p>\n<p>+1. Pro Heroes</p>\n<p>Izuku’s pushing his shopping cart down the aisle, focusing so intently on the shopping list Kacchan had given him that he almost runs over the kind, elderly lady in front of him.</p>\n<p>He says kind because she doesn’t immediately try to beat him with her ginormous purse for almost running her over, and instead quietly laughs at him when he prostrates himself in front of her for forgiveness, face blushing wildly.</p>\n<p>“None of that, sweetie, it was a simple accident,” she says, and tugs gently at Izuku’s elbow to pull him upright.</p>\n<p>Izuku stands, still blushing, and makes sure not to lean on the woman at all despite her offering him assistance to stand straight. He towers over her, and he feels clumsier then he has in years as he fidgets with his fingers and the bar of the cart, struggling to move it out of the way as she watches with clear amusement.</p>\n<p>She’s wearing a colorful fruit-patterned button down tucked into a khaki skirt with shin-high green socks that are covered with dancing narwhals, and she shuffles along next to him in Jesus sandals. Her purse is a bright, bright red, almost half her size, and she has a basket also almost half her size filled with various miscellaneous foods and items in her other arm.</p>\n<p>Her outfit makes absolutely no sense, but it’s something that Izuku himself might wear and he swears he’s never seen a cuter old lady. He refrains from voicing that thought, though. Izuku's been told many, many times, by many, many people that his taste in fashion is horrible, so best not open that can of worms with a stranger.</p>\n<p>Instead, he tries to apologize one more time for running into her.</p>\n<p>“Again, I’m so very sorry, I was just so caught up in my list – which is no excuse! Really, I should’ve-”</p>\n<p>She cuts him off before Izuku can spiral into a frantic storm of apologies, resting a gentle, weathered hand on his forearm, and leading him out of the aisle.</p>\n<p>“Hush now, it’s alright,” she says, using his forearm for stability as she walks slowly by his side.</p>\n<p>It's obvious she intends to talk with Izuku at length, so he easily steers the cart with one hand and let's her hold his other arm. He offers to take her basket and put it into the front of his cart, and she lets him with a wide, easy grin.</p>\n<p>“After all,” she starts, amusement lacing her voice and watching Izuku settle her basket, “it’s not every day the number one hero tries to bash you with his cart, now, is it?”</p>\n<p>Izuku groans, blushing again at the teasing, but finally starts to relax as she intended, laughing gently along with her at the ribbing.</p>\n<p>“I’d say it’s unfair that you know who I am when I don’t know who you are, but I think the whole cart incident makes up for it,” Izuku laughs, tugging her gently out of the way of another shopper as they begin to walk again.</p>\n<p>“You would be correct,” she agrees, winking as she says it, and Izuku laughs freely.</p>\n<p>As a hero, Izuku’s willing to put his life on the line for anybody, with no discrimination, but there are some people he’s more willing to sacrifice himself for than others, and this little old lady has already joined that list.</p>\n<p>“I am Kiryu Riona, and it is truly a pleasure to meet you Mr. Deku,” she says, introducing herself to Izuku anyways, and she bows her head at Izuku.</p>\n<p>Izuku splutters, waving his free hand at her, but she ignores him and pulls him forward as she walks.</p>\n<p>“Please, the pleasure is mine, ma’am, and Midoriya is fine; I’m not on duty right now so you don’t need to call me Deku, or mister, or anything like that.”</p>\n<p>“Call me ma’am again and I’ll bash you with my basket,” Ms. Kiryu says in lieu of a response, and laughs at the bewildered face Izuku makes.</p>\n<p>Her laugh is rough, a little raspy, but the laugh lines around her eyes and mouth crinkle like they’ve always been there as her face twists in amusement.</p>\n<p>As Izuku looks down at her laughing at his expense, he can’t help but be curious as to what this woman’s life story is. She seems so content in her skin, talking to Izuku like he’s a relative of hers, and looks like she has decades worth of stories just waiting to be shared.</p>\n<p>“Of course, sorry, ma- er, Ms. Kiryu.”</p>\n<p>“Now then,” she says, and she plucks the list right out of Izuku’s hand, shrewd gray eyes darting over everything Kacchan had written on it. “What is the number one hero shopping for on this fine afternoon, and what unhealthy things can I convince you to get instead?”</p>\n<p>“Oh, well,” Izuku blinks. Wow, she moves a lot faster than Izuku would have expected from a tiny old lady.</p>\n<p>He clears his throat and tries to explain the list.</p>\n<p>“Well, Kacchan, uh, that’s my husband, told me to get this for dinner tonight, but I have no idea where to find some of these ingredients, so I’ve just sort of been… wandering around,” he trails off in embarrassment.</p>\n<p>Number one hero, sure, easy, no problem, that’s understandable because he’s been working at it his whole life. But when it comes to cooking, Izuku is nowhere near as knowledgeable or fancy as Kacchan is, and it’s something Izuku has easily come to terms with.</p>\n<p>He can cook well enough to feed himself and others, but he’ll never be the culinary genius Kacchan has always touted himself to be.</p>\n<p>“You remind me of my wife,” Ms. Kiryu muses, flipping the list over to read the back as she speaks. “Could barely boil water, knew absolutely nothing about any of the recipes I talked about, but good lord if she didn’t eat like her life depended on it. And not just food, if you know what I mean.”</p>\n<p>Izuku chokes, face flushing a bright, uneven red, leaning on the cart for support as she laughs uproariously at his side. She ignores the looks of the shoppers around her, free in her amusement at Izuku's expense.</p>\n<p>“Ms. Kiryu!” Izuku wheezes out, and she nudges his side with her elbow, still laughing at him. Her voice peters out like the hiss of a clicking lighter as she attempts to contain herself, and it reminds Izuku a bit of Kacchan’s laugh.</p>\n<p>How such a loud, joyful sound can come out of a tiny body, Izuku will never know.</p>\n<p>“What, can’t handle a little inappropriate talk, Mr. Deku? The youth these days, I swear,” she says, shaking her head, and Izuku doesn’t even try to fight the laughter bursting out of him.</p>\n<p>“Ms. Kiryu, I don’t think this has anything to do with my being young,” he chuckles.</p>\n<p>“Maybe so,” she reaches up to pat the side of Izuku’s face placatingly, “but don’t tell me you never reward that husband of yours for cooking, eh?”</p>\n<p>Izuku squeaks, his face rapidly turning red once more, but he can’t even deny it.</p>\n<p>“That’s what I thought,” Ms. Kiryu says smugly, smoothing a hand over her gray hair and pushing some flyaways back into her bun. “So, let’s get this husband something unhealthy and tasty, then.”</p>\n<p>Izuku shakes his head ruefully but smiles anyways. Kacchan deserves everything, including indulging every once in a while, but…</p>\n<p>“I don’t think he’ll be too happy about getting junk food. He’s never liked straying too much from our diets,” Izuku tries to tell her as Mr. Kiryu steers him down another aisle, occasionally stopping as she throws various things into her own basket and into Izuku’s cart.</p>\n<p>“Nonsense,” she says, brushing aside Izuku’s words and checking things off Izuku’s list with a pen she took out of her bun. “He’ll eat what you give him or else he and I will have words about it.”</p>\n<p>Izuku sniggers to himself, laughing at the thought of this tiny, fierce old lady squaring up with Kacchan over food, and he can’t deny that he wants to see her win.</p>\n<p>“I’d love to see that,” Izuku admits, reaching up for a bottle on a tall shelf at her request and placing it into her basket.</p>\n<p>“What, to see the number two hero get his ass kicked?”</p>\n<p>Izuku stumbles on his feet, shocked laughter spilling out of him.</p>\n<p>Seriously, this woman! She said that so nonchalantly like taking on Dynamight is nothing more than putting a misbehaving miscreant into their place.</p>\n<p>“Please don’t fight my husband,” Izuku wheezes, leaning over the cart heavily.</p>\n<p>Ms. Kiryu removes her hand from Izuku’s arm to rub his back in the most mocking gesture of comfort he’s ever received – and his husband is Bakugou Katsuki.</p>\n<p>“Only if he behaves,” she says, and moves away from his side to study a row of packaged cookies in front of her. Izuku hangs his head over his arms from where he’s leaning on his cart and smiles in disbelief.</p>\n<p>“What does he like to eat?” Ms. Kiryu asks him, gesturing to the cookies in front of her like she said nothing out of the ordinary. Her voice makes him lift his head, and he looks over at the selection Ms. Kiryu just gestured at, musing over the choices.</p>\n<p>“Kacchan has a fondness for dark chocolate,” he tells her, and she immediately snags one of the bags in front of her and tosses it over her shoulder without looking back. Izuku catches it easily, but it was headed directly towards his face, and he squawks in offense.</p>\n<p>“Hey!” he cries out, gently setting the cookies into his cart.</p>\n<p>“He has good taste, your husband,” Ms. Kiryu says, talking over Izuku’s cry as she moves to another section further down the aisle, but she looks over her shoulder and winks at Izuku as she says it.</p>\n<p>“What? Uh, yes?” Izuku confirms, but it’s more like a question than an agreement.</p>\n<p>Dark chocolate <em>is</em> good, but what was with the wink?</p>\n<p>Ms. Kiryu simply hums with a smile, and keeps browsing, her big bag hanging from her elbow. Despite the size, it doesn’t seem to weigh her down and she walks with a straight back, taking confident steps in her sandals.</p>\n<p>Izuku would offer to carry it for her, but he’s afraid it’ll have something like a couple of bricks in there and that Ms. Kiryu really would try to hit him with it, so he refrains. She seems comfortable as she is, anyways.</p>\n<p>They keep moving through various aisles, Izuku eventually getting everything on his list and a bit more at Ms. Kiryu’s insistence.</p>\n<p>He makes sure to grab a couple of things for the twins, too. No doubt they’d give him The Look and he’d feel his heart break, so might as well circumvent that entire situation altogether.</p>\n<p>They’re discussing the merits of Kacchan’s favorite spicy chip brand versus Ms. Kiryu’s various favorites that she declares are all better than Kacchan's when Izuku hears a high-pitched voice call for him.</p>\n<p>“Daddy!” they squeal, and Izuku whips around, already with his arms out and a wide smile on his face as he bends down to catch Rikiya in his arms. “We found you!”</p>\n<p>Izuku wraps his hands around his son’s waist before tossing him in the air, delighting in the screaming laughter that echoes around them. Rikiya is as loud as Kacchan was as a kid, and he gets louder every day, but Izuku loves it.</p>\n<p>Rikiya is so unabashedly himself and happy that Izuku can’t help but encourage it. It comes back to bite him in the ass often, especially at bedtime or after a rough patrol, but the good far outweighs the bad.</p>\n<p>“You did! Good job!” Izuku praises, catching him easily and bringing him in a for a big hug.</p>\n<p>“Oi! Don’t go running off, you brat!” Izuku hears next, and his heart skips a beat, an even bigger smile crawling up his face at the familiar gruff voice.</p>\n<p>He turns around, holding Rikiya in one arm, and reaches his other hand out to Kacchan.</p>\n<p>“Kacchan! Hi!” Izuku says, watching fondly as Kacchan comes marching down the aisle with Saki still strapped in the baby carrier to his chest.</p>\n<p>She’s awake, but just barely, her chubby cheeks squished against Kacchan’s chest as her eyes blink open and close very slowly, and Izuku watches as she loses the fight, conking out after a few seconds. She has drool coming out of her mouth as she smacks her toothless gums together, and Izuku can’t help the small coo that comes out of him.</p>\n<p>Adorable, his baby is adorable.</p>\n<p>“Dad! Look, Dad is letting me ride his back!” Mikio calls, and Izuku looks up with a smile to see that yes, Kacchan is <em>also</em> carrying Mikio, and he is indeed riding on his dad’s back.</p>\n<p>Kacchan rolls his eyes as he comes closer, carrying his own basket and Saki’s diaper bag in one hand, and lifts one end of a leash in his other hand.</p>\n<p>“He burned it. Again,” he tells Izuku flatly, but a smile is tugging at the corner of his lips. Well, there goes another leash.</p>\n<p>Mikio’s quirk must have acted up, so Kacchan must have resorted to carrying Mikio on his back to keep him occupied and to keep an eye on him. Izuku can only shake his head fondly, counting the total in his head.</p>\n<p>That’s the third one this week. Not quite the record, but they’re getting close.</p>\n<p>Mikio obviously feels no remorse, still wearing the backpack his leash is connected to and playing with the frayed, burnt end.</p>\n<p>Both Izuku and Kacchan were leash babies growing up, but Izuku was normally too shy to go off by himself and leave the shadow of his mom’s leg. He was only a leash baby when he was with Kacchan, as Kacchan always wanted to go explore and break all the rules Mitsuki had given them when they went shopping, often dragging Izuku along with him.</p>\n<p>Once Kacchan got his quirk though, and started exploding his leash, Mitsuki made her own fire-resistant leash. Well, until Kacchan learned how to burn through those ones, too.</p>\n<p>Izuku might just need to call her and see if she has any leftover leashes from Kacchan’s childhood.</p>\n<p>“Hi,” Izuku says again, smiling when Kacchan comes closer and stuffs the leash into the diaper bag so he can grab Izuku’s hand. </p>\n<p>“Hey,” Kacchan greets back, and he pulls Izuku in to give him a simple kiss on the mouth, the blonde stubble on his chin softly scratching against Izuku’s skin.</p>\n<p>“And hello to you, too,” Izuku coos, brushing the side of his finger against Saki’s soft baby cheeks and kissing her blonde hair. She doesn’t wake up, but she does snuffle in her sleep, a little snorting-grumble that means she’s dreaming.</p>\n<p>Izuku takes a moment to lean into Kacchan’s arm, keeping a firm grip on a twitchy Rikiya as Izuku looks down at their baby, and he can’t help but want to cry at how content he is with his life. He sighs, but startles right after when he hears Ms. Kiryu’s rough laughter.</p>\n<p>“Mr. Deku, you didn’t tell me you were also shopping for your kids,” she chides him, but her twinkling eyes let him know she’s more than delighted at what she’s seeing.</p>\n<p>Izuku laughs sheepishly, but he does step out from Kacchan’s side to introduce his family. He pats Kacchan’s arm when he tenses up at Izuku’s departure to let him know it’s alright.</p>\n<p>“Of course, of course, I apologize. Ms. Kiryu, this is our oldest twin, Rikiya,” he says, and gestures to the fidgety boy in his arms.</p>\n<p>“Hi! I’m Rikiya!” Rikiya yells out, delighted to meet someone new, and Izuku winces.</p>\n<p>Rikiya has never had any semblance of volume control, and Izuku’s ears are paying dearly for it. Kacchan laughs at him, and Izuku shoots him a look, eyes narrowed but smiling still.</p>\n<p>Kacchan seems to have forgotten that Mikio is also on his back and therefore right by his ear, and Izuku doesn’t feel like reminding him.</p>\n<p>“This is my dad!” Rikiya announces next, and pokes Izuku’s cheek with a sticky finger. He leaves his finger there, wiping whatever strange substance is on it onto Izuku’s face and Izuku resigns himself to giving them all a bath after dinner tonight.</p>\n<p>They <em>just</em> washed the kids this morning. How did Rikiya already become so dirty? Izuku absently wipes at his cheek as Ms. Kiryu responds.</p>\n<p>“Oh, really?” Ms. Kiryu asks, but it doesn’t sound sarcastic at all. She gives Rikiya her full attention, and Rikiya takes complete advantage of it.</p>\n<p>“Yeah! He’s my favorite dad! Other than my other dad! He’s also my favorite!” Rikiya declares and Ms. Kiryu laughs.</p>\n<p>“I see, I see,” she says, and Rikiya beams at her. “It’s good to have favorite dads.”</p>\n<p>Izuku cuts in before Rikiya can politely yell at her anymore, and gestures to Mikio, who has been kicking his legs in impatience.</p>\n<p>“That one right there is Mikio,” Mikio shrieks a hello at Ms. Kiryu and Kacchan winces – hah – at the direct assault on his own ear, “the other twin.”</p>\n<p>Ms. Kiryu’s eyes dart between Rikiya and Mikio with a growing smile. “I can see the relation,” she says, and Izuku chuckles.</p>\n<p>The only way to tell Rikiya and Mikio apart – excluding their quirks – is by their voices. They look exactly the same, down to their freckles, and they use it to their advantage <em>often.</em></p>\n<p>Izuku places a gentle hand on Saki’s back right next to the hand Kacchan already has resting there, linking his pinky with one of Kacchan’s fingers.</p>\n<p>“And this sleeping rock is Saki,” Izuku jokes, and Saki does absolutely nothing in response, still sleeping away in the comfort of Kacchan’s hold. If the twins can’t wake her up, then nothing will.</p>\n<p>Ms. Kiryu takes a step forwards to properly see Saki’s face from where it’s smooshed up against Kacchan and partially covered with the carrier, and a sweet smile comes over her. The lines in Ms. Kiryu's face soften as she studies the sleeping baby, and she waves a hand at Saki, knowing Saki won’t see it.</p>\n<p>“Oh, she’s adorable, Mr. Deku,” Ms. Kiryu says, sighing happily, and places the waving hand over her heart.</p>\n<p>“You’re goddamn right she is,” Kacchan cuts in, puffing his chest out proudly.</p>\n<p>Ms. Kiryu steps back at Kacchan’s voice and looks up at him with a critical eye.</p>\n<p>If Izuku looms over Ms. Kiryu, then Kacchan is like a giant, taller than both her and Izuku. Kacchan stares right back at her, unafraid of anything – even little old ladies with huge bags that probably have bricks in them.</p>\n<p>Izuku, who is a sane and normal person, appropriately fears said bricks and the little old ladies who carry them.</p>\n<p>“So, this is the husband, then?” Ms. Kiryu asks, and Izuku can’t quite parse out her tone.</p>\n<p>“Yeah, got a problem with it?” Kacchan shoots back, eyebrows furrowing and taking a step closer to Izuku.</p>\n<p>Ms. Kiryu says nothing, pursing her lips as she darts her eyes between the squirming boys who are talking to each other over their dads’ shoulders, the sleeping baby, and Izuku, before going back to Kacchan.</p>\n<p>“You did well,” she finally says, and nods her head in Izuku’s direction, winking at Kacchan like she did at Izuku earlier, but Kacchan apparently seems to understand the secret signal because he relaxes, body easing out of its defensive posturing.</p>\n<p>“Yeah, well, I worked to keep him,” Kacchan says, his voice a little softer than it normally is when talking with strangers. Ms. Kiryu seems to understand his cryptic wording, smiling in response.</p>\n<p>Izuku blinks between them, confused as all else.</p>\n<p>“What are you talking about?” he asks. They both answer him simultaneously.</p>\n<p>“Nothing.”</p>\n<p>“Nothing.”</p>\n<p>Ms. Kiryu pats Izuku’s shoulder, and says, “Don’t worry about it.”</p>\n<p>“I- what?” He looks between them, bewildered, but Rikiya starts to squirm out of Izuku’s hold, flinging his arms up and yelling for attention.</p>\n<p>“Dad! Dad! Guess what!”</p>\n<p>“Shh, remember, inside voices Rikiya,” he futilely tries to remind his son, adjusting his grip.</p>\n<p>“Okay!” Rikiya yells, and Izuku gives up.</p>\n<p>“What’d you want me to guess?”</p>\n<p>As Rikiya points to something on the shelf that had caught his attention, speaking rapidly in a speed only understandable by Izuku, Kacchan, and his twin, Izuku somewhat overhears Ms. Kiryu talking to Kacchan.</p>\n<p>“Mr. Dynamight, I’ve convinced your husband to get a couple of things. Everything you eat is too healthy.”</p>\n<p>“Hah? The hell is wrong with too healthy?”</p>\n<p>“You’ll suck all the joy out of your lives with too many vegetables. Now, if you include some nice sweets with every meal, your husband will only love you more. Trust me.”</p>\n<p>“Deku will eat what he’s given, or he can cook his own shit. He already eats too much junk food; I’m not giving him some goddamn sweets.”</p>\n<p>“Bah! You will live a boring life eating like this, Mr. Dynamight.”</p>\n<p>“Yeah, well, I don’t give a shit, hag.”</p>\n<p>“Mr. Dynamight, it is Ms. Hag to you, or Granny. Please, show some respect in front of your children and your lovely husband.”</p>\n<p>Izuku crouches semi-frozen in front of the crackers, balancing on his heels as he listens with a dizzying mix of mounting dread and increasing bafflement to their conversation, almost falling on his ass when Kacchan gives one of his ugly half-snorting-half-chuckling laughs.</p>\n<p>Oh god, Ms. Kiryu can verbally spar with Kacchan better than half of their friends. Izuku is suddenly very, very afraid. He needs to separate them – and soon.</p>\n<p>Seeing them hit it off like a tiny, flaming lighter tossed directly into a barrel of napalm was not how Izuku expected this to go. Meeting new people is different for Izuku, because Izuku can latch onto and bond with pretty much everyone. For Kacchan, however, it takes weeks to get him to even consider talking to other people outside of work. Ms. Kiryu adopting Kacchan on sight and Kacchan semi-accepting it was the worst-case scenario that Izuku didn’t even consider.</p>\n<p>Thankfully, Mikio comes to the rescue, wriggling dangerously on Kacchan’s back, whispering loudly.</p>\n<p>“Dad!” he whisper-yells. “Dad, I need to tell you something!”</p>\n<p>Izuku squints his eyes at Mikio, and slowly stands up, setting Rikiya on his hip. Rikiya, who is now talking to himself (satisfied that he’s told his dad everything he wanted to), ignores his twin, as he usually does.</p>\n<p>Izuku recognizes that wriggle…</p>\n<p>“What?” Kacchan asks Mikio, stuffing something into his pocket that Ms. Kiryu had given him.</p>\n<p>“I hafta go pee, Dad,” Mikio tells him, leaning down to cup his hand around Kacchan’s ear like it’s a secret. It would’ve worked, except Mikio still doesn’t know what a whisper is.</p>\n<p>Kacchan straightens his spine immediately, suddenly in Dad Mode, and Izuku does the same.</p>\n<p>That’s what it was! Mikio was doing his bathroom wriggle, except modified to incorporate the use of kicks because he’s on Kacchan’s back.</p>\n<p>“Alright, kid, just hold on for a few minutes, yeah?” he tells Mikio, sharing a panicked look with Izuku.</p>\n<p>Mikio only tells them he needs to go pee when he really has to go. Like, <em>really</em> has to go.</p>\n<p>“Gimme,” Kacchan says, and holds an arm out for Rikiya. “I’ll take them and meet you at the car, ‘kay?”</p>\n<p>Izuku kisses Rikiya’s head, passing him into Kacchan’s arm.</p>\n<p>“Alrighty, Kacchan. Be good for Daddy, okay, Rikiya? You, too, Mikio. Love you!”</p>\n<p>“I won’t! Love you, Daddy!” Rikiya promises.</p>\n<p>\"Me neither! Bye!\" Mikio says immediately after. These kids; Izuku swears they're exactly like Kacchan was.</p>\n<p>“You,” Kacchan says, and points to Ms. Kiryu with narrowed eyes. “Don’t corrupt my husband anymore. He doesn’t need any of that extra shit in the cart.”</p>\n<p>Ms. Kiryu sniffs the air, turning her nose up and away from Kacchan. “I will do whatever I please, Mr. Dynamight, including spoiling this lovely man as he deserves.”</p>\n<p>“Daaad,” Mikio whines, and tries to shake Kacchan’s shoulders. “I gotta gooo.” He starts to repeatedly bang his forehead against the back of Kacchan's head, the dull thunking noise painfully audible.</p>\n<p>Rikiya starts patting Kacchan’s cheek from where he’s carefully settled against Kacchan’s side and away from Saki.</p>\n<p>“Dad, Mikio’s gonna pee on you,\" he helpfully informs Kacchan, in case Kacchan didn't understand Mikio's attempt at thought osmosis via skull bashing. He keeps patting Kacchan’s cheek to a rhythm only he understands, and Mikio syncs the beat of his kicking legs and head bonking to it.</p>\n<p>Ms. Kiryu grabs Izuku’s arm again, settling her hand back on his forearm, and makes a shooing motion at Kacchan.</p>\n<p>“Go, Mr. Dynamight. I believe you have some pressing matters to attend to.”</p>\n<p>Kacchan rolls his eyes but offers her a half-smile anyways. Mikio bonks harder. “Quit it with the shitty ‘Mr. Dynamight’, alright? Just call me Bakugou.”</p>\n<p>Kacchan turns to Izuku next and steps closer to him, invading his space.</p>\n<p>“Don’t take too long, okay, baby?” he softly tells Izuku, and then Kacchan firmly kisses him before he can answer, a long, chaste press of their lips together before whipping around, marching back down the aisle absolutely covered in children (Rikiya still using Kacchan's face as a soundboard) and like a man on a mission.</p>\n<p>Well, more like a dad trying to avoid at all costs their kid peeing in public, but, still, it’s the same feeling.</p>\n<p>As Izuku has learned over the years, parenting is a lot like hero work, except instead of extremely volatile criminals and perilous situations it’s extremely volatile children and wildly different but no less perilous situations.</p>\n<p>“And help Ms. Kiryu with her basket, dumbass!” Kacchan calls over his shoulder, hoisting Rikiya into a better position in his arms before disappearing around the corner. Mikio has resorted to gnawing on Kacchan's shoulder, and Izuku winces in sympathy.</p>\n<p>“Okay! Bye! I love you!” Izuku calls out and he can barely hear Kacchan’s muffled cursing in response.</p>\n<p>Izuku laughs under his breath, before turning back to Ms. Kiryu.</p>\n<p>“Well, then,” he says, and gestures to the cart. “Shall we?”</p>\n<p>“Just one more thing,” Ms. Kiryu cuts in, taking lead once more. Her big bag bangs against her knees as she starts to shuffle next to him in her narwhal socks and Jesus sandals once again and Izuku finds himself oddly comforted by the sound.</p>\n<p>“What’s your favorite food?” she asks him. Izuku doesn’t even need to think about it.</p>\n<p>“Katsudon. Why?”</p>\n<p>Ms. Kiryu raises an eyebrow at him. “Katsudon, eh? Sounds a little… familiar.”</p>\n<p>Izuku is not blushing.</p>\n<p>“What’s wrong with katsudon? It’s good!” he defends.</p>\n<p>“Oh, I’m sure he is,” she says, and laughs at Izuku’s expression once more. Izuku brings his hands up to cover his steaming face, groaning beneath them.</p>\n<p>“Ms. Kiryu, please, have mercy,” he begs her, but Ms. Kiryu shakes her head.</p>\n<p>“Never,” she promises, and reaches for her things as they arrive at the self-checkout stations.</p>\n<p>Izuku beats her to it, grabbing her hefty basket and setting it down at her own station. He starts taking his things out in the station directly next to hers.</p>\n<p>“Let me cook for you,” she tells him, taking items out of her basket and scanning them. “I already gave that husband of yours my number. Let me know when you’re free and bring your whole family over for dinner. Keep an old lady company, will you?”</p>\n<p>Oh, so <em>that’s</em> what Kacchan put in his pocket earlier. Ms. Kiryu is sneakier than Izuku had expected.</p>\n<p>“Are you sure?” Izuku asks, as he starts scanning his items at a fast and well-practiced pace. “We can be a lot altogether, especially the twins. Plus, Saki is still only a few months old.”</p>\n<p>“Nonsense, it will be fine. If I could handle Makoto at her hungriest, then I can handle you and your brood. Just come ready to eat,” she orders him, and Izuku can’t help but acquiesce with a smile.</p>\n<p>Makoto must have been her wife, and Izuku easily sees there’s no use in arguing with Ms. Kiryu on this.</p>\n<p>“Then, we would be glad to join you. Thank you,” he says, taking out his grocery bags to pack his items.</p>\n<p>She just waves him off, grinning to herself as she finishes with the last of her things, and Izuku moves over to help her, packing her things and holding the bags for her.</p>\n<p>As Izuku walks Ms. Kiryu to the exit, she tugs him to a stop, and stares up at Izuku.</p>\n<p>“Is everything okay, Ms. Kiryu?” he asks, eyebrows furrowing in concern.</p>\n<p>“You are a very lucky man, Mr. Deku.” She states it simply, not specifying why exactly Izuku is so lucky, but she doesn’t need to.</p>\n<p>She continues walking again, and a dopey smile crawls up Izuku’s face as he follows her.</p>\n<p>He thinks about his kids, thinks about who exactly he gets to come home to, who he gets to save people with, who has been by his side his entire life, and can’t help but agree with her.</p>\n<p>“Yeah,” Izuku says softly. “I really am.”</p>"
}