{
  "id": "34284691",
  "url": "https://archiveofourown.org/works/34284691?view_full_work=true",
  "author": [
    "eggmacguffin"
  ],
  "title": "Hot Dog, French Fries",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [
    "Tim Drake & Damian Wayne"
  ],
  "characters": [
    "Tim Drake",
    "Damian Wayne"
  ],
  "additional_tags": [
    "Truth Serum",
    "Hurt/Comfort",
    "Protective Tim Drake",
    "Hurt Damian Wayne"
  ],
  "language": "English",
  "series": "",
  "published": "2021-10-04",
  "completed": null,
  "words": "6,056",
  "chapters": "1/1",
  "comments": "320",
  "kudos": "9,618",
  "bookmarks": "2,195",
  "hits": "47,243",
  "summary": "<p>Damian was not the sort of boy to mince words; perhaps he could get back to the Manor without alerting Drake to his compromised condition. </p>\n<p>It would be an exercise in espionage, he decided.</p>\n<p>or</p>\n<p>Truth Serum ft. Damian Wayne</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>It seems I can't write angst without injecting a dose of goofy comedy.<br>So many fics that deal with Tim and Damian have Tim being the perfect big brother in the ones where Damian is sympathetic, and wisely distrustful in ones where he's not. I thought it would be interesting to write a story where Tim gets it wrong at first.</p>\n<p>If you liked it, please leave a comment!<br>Thank you for reading!</p>",
  "text": "<p>\"What the hell are you <em>doing</em>?\" said the last voice Damian wanted to hear right now.</p>\n<p>Damian did not jump, but his teeth clacked together savagely as he confirmed the identity of the intruder in the dim light. He frowned, shivering at the damp wind the new opening brought in.</p>\n<p>\"I am sitting in a box. Why are you not with Batman?\" Drake had seemed <em> excited </em> to patrol with Father for the night. What was he doing here without him? Unless...Damian craned his neck, trying to see around the fool, but Red Robin appeared to be operating solo.</p>\n<p>Drake scowled mulishly down at him. \"Funny story. When Batman called Nightwing to rendezvous for the mission he came here for the<em> express purpose </em>of helping us with, he said his sidekick had run off on his own an hour ago. Take a wild guess as to who got put on Robin Retrieval duty tonight.\"</p>\n<p>\"You,\" Damian said, a cold lump of dread settling in his stomach.</p>\n<p>Drake grabbed a fistful of shirt and cape and dragged Damian out of his little crate with one hand, either not noticing or not caring about Damian's uncharacteristic reticence. \"Batmobile's around the corner,\" he grumbled. \"I'm taking you home.\"</p>\n<p>Damian weighed his options. This was better than being caught out by a Rogue or a civilian, and he was not expected to return to the field. Drake was the worst in the line of people willing to help him, but given the circumstances...well. Damian was not the sort to mince words. Perhaps he could get back to the Manor without alerting Drake to his compromised condition. It would be an exercise in espionage, he decided.</p>\n<p>He crawled into the backseat, sitting as far as possible from the driver. This time, Drake did a double-take. \"What, not gonna pitch a fit about who drives?\"</p>\n<p>\"No,\" Damian said through gritted teeth.</p>\n<p>That earned him almost-concerned glance as the engine started up. \"Did you get hurt tonight?\"</p>\n<p>Damian huddled into the seat despite himself, wishing Drake would just stop <em> talking </em> to him. \"I took a punch to the stomach near the Bowery. I have a hangnail on my right thumb. I fell off a bridge, but did not break any bones. I am a little sore, the way one gets from sitting still for too long,\" he reported robotically, each paltry injury twinging as he listed them off obediently.</p>\n<p>Even with his eyes on the road, Damian knew the bitter, judgemental expression Drake would be wearing so well he could probably <em> paint </em> it.\"Then why did you run away from Dick?\" </p>\n<p>\"I needed to be somewhere else.\" It was, technically, the truth, and appeared to be enough to satisfy the ache in his stomach. \"I would prefer to complete this ride without conversation.\"</p>\n<p>A derisive snort dashed his chances of <em>that</em> happening. \"Don't be like that, Damian,\" he said, tone just this side of snide. \"We <em>never</em> talk. Maybe I want to talk now.  How's <em>elementary</em> <em>school</em> these days?\" Damian scoffed. How childish. How plebeian.</p>\n<p>But when he opened his mouth to respond with a curt <em> unsatisfactory, </em> the word wasn't there. Instead, visions of grubby hands swiping at his belongings and patronizing words and glances from adults who could never <em> begin </em> to understand him flashed behind his eyes, and he heard his own voice saying, \"I am deeply unhappy. My classmates do not like me. I do not belong there.\" Damian locks his jaw shut forcefully, holding back any further humiliating elaboration. </p>\n<p>Drake, taken aback by Damian's sudden candor, was silent for a moment before responding. When he did, his voice sounded completely different. \"Uh, that sucks.\" He drummed his fingers on the steering wheel, antsy with an emotion Damian couldn't identify. \"Maybe you could talk to Dick. About that...or something,\" he trailed off, shoulders creeping up to his ears. </p>\n<p>Damian did not dignify this feeble consolation with a response, and instead just <em> existed </em> around the burning pit in his stomach. No <em> just give them time </em> or <em> I'm sure it's not your fault</em>, of course. There was no one here for whom they would need to be <em> precious </em> about his gross inability to relate to his peers. </p>\n<p>When he glanced back toward the front of the car, Drake's shoulders were still hunched. Maybe this was better. If Red Robin was so discomfited by evidence of Damian having an actual <em> opinion </em> on the way others perceive and treat him, this accursed affliction might smother any further attempts at conversation.</p>\n<p>They drove in silence for the next few minutes. Damian sat like stone and his breaths were as silent as he could make them. Perhaps Drake would simply forget he was here.</p>\n<p>The Batmobile had just pulled into the hidden entrance of the cave system. It wouldn’t be long now. If he could just get <em> home</em>—</p>\n<p>\"All right,\" Drake would not be assailed, and seemed determined to initiate some inane conversation with Damian at any cost. \"Do you want to tell me what inspired you to run off by yourself? Or why you were hiding in a fish crate when I found you?\" It sounded as familiar as it did rehearsed, the way they all talked to Damian when he did something they did not understand. Like he was some kind of idiot. \"Either one's fine.\"</p>\n<p>\"I do not want to tell you,\" Damian answered honestly, in easy unison with the lights in his mind. </p>\n<p>\"This is serious, Damian. No one even knew you'd taken off. No one had eyes on you, your tracker was on some random street, and Dick couldn't find you at all; you could have died.\" Drake said, as if reading from a script.</p>\n<p>\"Maybe so, yes.\" he acknowledged. \"However, I do not see how this is <em> your </em> problem.\"</p>\n<p>\"God, would it kill you to—\" Drake huffed out an aggrieved sigh and changed his approach. Sparks danced on Damian's tongue at the unfinished question. \"It's the middle of the damn night. I know you hate me or whatever, but I’ve been looking for you for <em> hours</em>, and...\" he trailed off, shaking his head with a snort. \"Look who I'm talking to. Have you ever felt gratitude towards another person in your miserable little life?\"</p>\n<p>Sensations and colors and phantom pains buffeted Damian like a storm at sea, he had to hold it <em>back</em>, he had to— \"I am grateful you did not kill me upon my arrival in Gotham, although at times I fear you still might want to,\" Damian's traitorous mouth replied for him. Only after he finished speaking did the waves crashing behind his eyes subside. </p>\n<p>Drake's hands locked tightly around the wheel for a moment before he visibly forced himself to relax and ground out, \"What are you talking about, Damian,\" His tone was tight and sharp, moving away from annoyance and closer to real anger. \"Well, you can rest easy on that one.\" Contempt. \"Between the two of us, the only murderer around here is you, remember?\"</p>\n<p><em> You don’t frighten me</em>, Damian tried to say, but of course he could not. \"I remember,\" and that should be enough, he shouldn't need to elaborate, but his mind lit up with beforetimes, his mother and Todd and tales of Robins and the looming, distant spectre of a father Damian had never met, and—\"I was sent here to eliminate Grayson, not you. Todd was supposed to kill you, on my mother's orders. When he failed, and later I failed, I erroneously assumed it was only a matter of time.\"</p>\n<p>Drake slammed on the brakes so suddenly that the snap of Damian's seatbelt against his collarbone was likely to leave a bruise. \"What the<em> FUCK, </em> Damian<em>, </em> is that <em> true!?\" </em></p>\n<p>\"Yes,\" he gasped, and suddenly could not breathe. They hadn't known; not even an inkling. This was going to ruin <em> everything</em>. The uneasy truce that allowed him space within this family, where Tim pretended not to despise Damian and Damian pretended not to resent him for it, because <em> it was his fault</em>, was dashed. Destroyed in a moment. And that was Damian's fault, too.</p>\n<p>More than that. Batman had not known that Damian was sent here to claw his family apart and build a nest from the grisly remains. What would he do to Damian when he found out? </p>\n<p>The door opposite him swung open and Drake was there, staring him down. He looked angry.  He looked disgusted. But most of all, he looked grimly victorious. As though he'd finally been proven right.</p>\n<p>\"Don't tell Father,\" Damian whispered, pressing himself back against the car door, fumbling at the child safety lock. They were still approximately 15 miles from the manor, but he'd run farther while injured worse; if Drake could be tricked into pursuing on foot and abandoning the Batmobile, maybe—</p>\n<p> “Why shouldn’t I tell Bruce?” Drake said, unsettlingly calm. No, not calm. Focused. Like a cat with a mouse in its clutches. Or a detective with a suspect caught in a lie. \"Give me <em> one </em> good reason.\"</p>\n<p>It wasn't a good reason; it wasn't what Damian would have said if he'd had any control. Rather than biting wit or careful manipulation, what came out was the petulant whine of a <em> child</em>. \"It wasn't on purpose. I didn't know it was wrong.\" </p>\n<p>An expression of scorn crossed Drake's face before it flattened out into that infuriating, calculating mask again. The phrase that never failed to make both Drake <em> and </em> Damian furious. <em> Damian doesn't know any better</em>. Insufferable and dismissive, whether it came from Dick Grayson or their shared father or anyone else.</p>\n<p>\"Of course.\" Tim spat. \"Sure. You come here plotting to murder me and my brother. Oh, but you're <em> maladjusted</em>, so it doesn't matter. You actively try murder me multiple times, but that’s <em> fine</em>, because, what, you were feeling <em> insecure</em>?\"</p>\n<p>Damian was shaking with what he decided <em> must </em> be rage, because he hated Drake, he <em> despised </em> him, and opened his mouth to say so—\"I was scared of you. I was certain you'd kill me at the first opportunity,\" he heard his voice say, and the air in the car was so still and quiet that he might have been alone. \"It was the logical conclusion. I was next in line. You had the most to gain from my death. Mother warned me about you. You were the craftiest of Father's children. Your paltry attempts to, to get me alone, to make me trust you, it all seemed an obvious trap. I'd only just gotten here.\" The chemicals and lights and fires behind his eyes cast him cold and lonely and desperate to live. Desperate to carve out a place for himself in this inscrutable new world. \"I'd only just met my father. If I was going to die so soon after my escape, I wanted to die fighting, with a blade in my hand. Not stricken down by a viper I failed to see coming.\"</p>\n<p>Drake's expression cracked down the middle. He did not reach out to make physical contact. In fact, Damian noted, Drake had not so much as crowded him throughout this terrible questioning. His expression righted itself into something that wasn't quite angry, wasn't quite sad. At least, Damian thought desperately,  it was no longer smug.</p>\n<p>\"Damian…\" Drake began, voice faintly strained, \"I really think Bruce needs to know about this.\"</p>\n<p>At this last betrayal, following the parade of humiliations, something inside of Damian <em> snapped</em>.</p>\n<p><em> \"NO!\" </em> he shouted. “I will not allow you to—I refuse—You’re just trying to get rid of me and I <em> will not let you</em>. You <em> never </em> liked me. You want me sent away so that you can have all of them to yourself.” his voice was rising steadily in both pitch and volume completely outside of his control. Damian didn’t care. “You,” he seethed, “would use outdated intel, either through blackmail or <em> tattling</em>, to send me back to the League, because you want me gone but you are too much of a coward to kill me <em> yourself.</em>” </p>\n<p>Damian blinked sweat out of his eyes, face red, hands trembling, and took in the painfully familiar expression on Drake’s face. It was exactly the way those so-called educators looked at Damian when he acted too strangely, or said the wrong thing. It was the look they gave him when tactfully suggesting he might benefit from being placed in a more <em> specialized </em> class. Seeing that stiff, patronizing pity on the face of Red Robin lit Damian’s veins on fire. </p>\n<p>“STOP LOOKING AT ME LIKE THAT!” he screamed. ”There’s—”<em>There’s nothing wrong with my head,</em> he couldn’t say. “I’m—” <em>I’m not a child. </em>“I—” <em>I don’t care what you think of me. </em>He couldn’t get the words out. Sick and stressed, Damian floundered, “I do not find myself challenged by my current educational coursework,” he finished lamely. “I’m not...stupid.”  Then, humiliatingly, he sniffled.</p>\n<p>Damian waited for Drake to start in, to lord this pathetic little display over him. But the seconds ticked by into steady silence. Why hadn’t he said something? Anything? Damian cracked his eyelids to see him standing there, loose-limbed and as not-angry with Damian as he’d ever been.</p>\n<p> When their eyes met, he cocked his head at Damian in a way that was <em> almost </em> friendly. “Well, that’s good to hear. You tired?” </p>\n<p>Not trusting his words to obey him, Damian nodded, and found he <em> was</em>.</p>\n<p>“Me too. Wanna go home?”</p>\n<p>Damian nodded again, closing his eyes. “I would rather die than go back to the league.\" The admission slipped out before he could bite his tongue.</p>\n<p>“Then we’ll go to the manor. It’s closer anyway.” Drake moved back to the front seat and restarted the ignition. He tossed a package of fruit snacks from the glovebox into the backseat, and they landed in Damian’s lap. He cradled the treat with both hands, but did not eat. He was almost home. The miserable interrogation was over. Whatever retribution he faced for running off, whatever Drake decided to do with the information he’d gained, none of it was as important as getting home, escaping to a distant dusty corner of the tower, and waiting for this <em> whatever it was </em> to get out of his system.</p>\n<p>Everything else could come later.</p>\n<p>But of course Drake, with his damnable inability to read a room, had apparently decided that Damian<em> must </em> be in a mood for opening up. \"Something I’ve been wondering...Why are you so scared of the League? I thought Ra’s was your grandfather. You're his chosen heir, right?\" He tossed the carefully inoffensive question over his shoulder as he shifted gears. </p>\n<p>“Grandfather is not looking for a successor in the usual sense.”—and that should have been enough, but the images weren’t <em> stopping</em>. It wasn't something he wanted to even <em> think </em> about, let alone tell <em> Drake</em>. Damian bit into his lips in an effort to keep them closed, blood dribbling down his chin, eyes squeezed shut, body trembling with the force of <em> no, no, no </em> —And Drake, damn him, made a wordless, inquisitive sound, and Damian couldn't stop the words. \"He wants to <em> shell </em> me, crack me open and scrape me out and crawl inside and live in my skin, like a worm, like a parasite, and I don't know if I will be dead when he does it or if I will be forced to watch him pilot my living corpse through every single desecration, I don't want to say it, I don't want to say it I don't want to say it <em> STOP MAKING ME SAY IT </em>—\" Damian latched onto his bare forearm with his teeth as a macabre makeshift gag, hoping to ride out the nauseating horrors dancing behind his eyes.</p>\n<p>Drake threw the car back into park and dove into the backseat, shouting his name. Tugging his arm from his mouth, telling him to breathe, checking his pulse and shining a small light in his eyes and all the while Damian just <em> shook</em>, unable to even hear the secrets he was blabbering.</p>\n<p>When his breathing evened out, Drake swam into focus, looking at Damian with that keen inquisitive gaze that never failed to set his teeth on edge.</p>\n<p>“I don’t recognize these symptoms at all,” Tim began, \"but you've definitely been hit with something.\" It wasn’t a question, so Damian didn’t have to answer. Then, with a sick sort of understanding, Drake said, \"Robin. Report?\"</p>\n<p>\"Code Tango-Six-Seven-One. I am unable to lie and forced to answer when prompted.” Damian answered miserably. Helplessly. “It happened at the docks after I fell. I did not recognize the individual, nor did I see their face.”</p>\n<p>Tim paled and swung himself into the front seat, gunning it towards the cave at top speed. Damian was grateful; he didn't want to see Drake’s expression. He listened and felt the rumble of the engine beneath him, and waited for the first <em> real </em> question. For the actual interrogation to begin. </p>\n<p>The one he got surprised him.</p>\n<p>\"Fuck, Damian. Why didn’t you say anything?”</p>\n<p>“I do not trust you.” Damian said, hollow. “I believed you would use it against me.” He slumped in the backseat, pressing his cheek against the cool window. </p>\n<p>The rest of the trip back to the cave was blessedly silent. </p>\n<p>The Batmobile eventually rumbled to a stop, but Damian didn't move. All he wanted to do was sleep, and the prospect of walking to his room, or even crawling out of the vehicle, suddenly felt too monumentous a task to even contemplate. The cluster of <em> something </em> was still roiling and sparking between his ears, making his head throb and his stomach churn.</p>\n<p>The door he was propped up against was thrown open, but he was too sluggish to process it until he was already tipping backwards—</p>\n<p>—Directly into a pair of warm, waiting arms. He hadn't realized how cold he'd been until he was scooped up and held firmly to a body that felt like a furnace in comparison to his own. He noticed  belatedly that he was shivering.</p>\n<p>\"—mian. Damian. Whether or not you can hear me would be a good thing to know right now—\" Damian wiggled his nose in annoyance and the chatter trailed off with a sigh.</p>\n<p>He felt himself being carried through the cave and laid down on a cot. Warm hands removed his cape, gloves, boots,  and armor (with<em>out </em> permission) and a cool, wet cloth was laid across his eyes.</p>\n<p>Drake crossed the room, fiddling with something tiny and metal, based on the noises he made. Damian strained to hear more clearly--</p>\n<p>The pounding behind his eyes and roilling in his stomach reached an abrupt and alarming zenith.</p>\n<p>The cloth was dislodged as he rolled half off the cot, convinced he was about to lose his dinner. Drake noticed him with a shout and ran to his side just as Damian rasped, \"I'm not sure Father likes me very much because I'm not adopted,\" and was so thoroughly horrified with himself that he might have gone ahead and thrown up anyway. Except.</p>\n<p>With the confession, the buzz-thrum eased its vice-like grip slightly, and a new kind of horror struck him. </p>\n<p>\"It wants you talking,\" Drake verbalized.</p>\n<p>\"I cannot control what I confess,\" Damian whispered. \"I do not want to...I do not like this. This isn't <em>fair</em>.\"</p>\n<p>Drake responded, \"I don't think Bruce really sees me as family.\"</p>\n<p>Damian snapped his head around to stare. \"What? I don't understand.\"</p>\n<p>Drake met his gaze evenly. \"You're right. This isn't fair. I'm trying to make it fair.\" With that, he retrieved the items he had discarded and, with Damian's permission, took a blood sample. \"I'm going to go test this.\"</p>\n<p>Damian would have preferred to just die in peace, honestly, but Drake continued his damnable chatter as he prepared and began the various tests. </p>\n<p>\"You become unwell if you resist,\" he said thoughtfully, \"and if you can't control it...but <em>I</em> might be able to.\" He snapped his fingers with a grin. \"Robin, I respectfully request your permission to ask you some questions.\"</p>\n<p>Any glaring he might have done was hindered by the fact that he couldn't lift his head enough to actually look up. As it was, the nausea was already sweeping back. \"Watch yourself,\" he growled.</p>\n<p>Drake was already trotting across the cave. \"Damian, how many pets do you have?\"</p>\n<p>Damian answered truthfully, but the bubbling in his stomach did not recede even as much as it had moments before. He shook his head miserably. </p>\n<p>Nevertheless, Drake continued to pry, asking innocuous questions as he drew a second blood sample, as his earlier tests around the room began to ping negatives. </p>\n<p>Damian answered everything, obediently and truthfully, but it was not helping. If anything, his condition was steadily worsening, a theory confirmed by the nervous glances Drake kept sending the medical monitor behind his head.</p>\n<p>It happened again when Drake took a break to tend to the still-weeping teeth marks in Damian's arm; that strange, diseased <em> something </em> inside of him reached a boiling point and the words bubbled out of him without his consent. \"I envy you. Father treats you like an equal. It feels like he will never see me as anything but a troublesome child to be dealt with, a nuisance to be <em> handled</em>.\" The fuzzing around his eyes eased substantially more than last time, but did nothing to help against the hot swell of humiliation.</p>\n<p>\"You know, I envy you, too. Bruce treats you like a son.\" Tim rejoined, tone level, not pausing in his task. Not looking at Damian. \"Sometimes, it feels like he doesn't see me as one of his real kids. Or if I am, I'm the easy one. I'm the one he doesn't have to worry about.” He sighed. “It feels selfish to resent it.\"</p>\n<p>\"He respects you! He trusts you!\" Damian hissed, furious. \"I'd give anything for that!\"</p>\n<p>\"He loves you. He worries about you.\" Tim said, voice oddly thick. </p>\n<p>And then his head snapped up, and those eyes were <em> boring </em> into Damian again.</p>\n<p>\"That’s strange.”He said slowly. “Why are so many of your truths about me?\" He abandoned Damian's arm and went over to check on test results, shaking his head. \"You said something strange too, earlier. the wording. You, under a truth spell, said <em> confess</em>. Why? Does it have to be something I don't know? Or—\" Tim, who had been a flurry of nervous, efficient motion since they had arrived, suddenly stood stock still. \"Secrets. It wants your secrets.\" His expression curdled along with Damian’s stomach. “This isn’t your run-of-the-mill Gotham havoc. It was intended for an interrogation.” The flash of stark fury was already gone from his face, so fast Damian couldn't be sure if it had been there at all. Tim was back in detective mode. \"Now, if this is specifically about secrets. Does the level of secrecy affect you? Or maybe the scope—\"</p>\n<p>\"I believe so,\" Damian muttered, dizzy.</p>\n<p>\"We're lucky. Because Damian, you know some pretty big secrets.\" Tim looked at him and, bafflingly, grinned. \"What is Batman's real name?\"</p>\n<p>\"Bruce Wayne,\" Damian rasped, and everything <em> stopped</em>. </p>\n<p>He sat up in his cot. He took a deep breath and it didn't hurt. His head was clear. \"Theory confirmed,\" he said wonderingly to Tim, who whooped, and inexplicably swept Damian into a quick but desperate hug that barely lasted a second. </p>\n<p>The feeling came creeping back soon enough, but it was simple enough to simply run through the extended league roster, starting from the top and meandering all the way down to vigilantes in other universes. </p>\n<p>They couldn’t keep this up forever, though. They were both exhausted,and the time between questions was getting closer to seconds than minutes. None of the tests seemed to reveal anything. Tim had resorted to hanging any number and combination of magical medallions around Damian’s neck, hoping it was some sort of spell.</p>\n<p>\"It’s definitely not chemical. I'm running tests,\"—Damian's breath hitched minutely—\"What's the dumbest thing you've ever seen Jason do?\"</p>\n<p>The memory lit up the insides of his eyelids, and Damian answered, \"I saw him cook a grilled cheese sandwich using the roof of a hot car. He ate the end result and became quite ill.\"</p>\n<p>\"Seriously? That guy, I swear. Comes back from the dead <em> once </em> and thinks he's invincible.\" Despite his light tone, Tim was visibly stressed, pacing from one failed result to another. “There’s nothing in your blood. No sign of magic at all. Just stress. Stress in your brain from nowhere that'll give you an aneurysm if we let it build up for too long.” </p>\n<p>Damian shivered. Tim was resolutely not looking at him.</p>\n<p>“I want to go over your symptoms again. I know that you need to keep telling truths, it's best when prompted, and it's getting worse. If there is anything else, knowing about it might be helpful.\"</p>\n<p>When not <em> helping</em>, Tim had avoided asking questions altogether, which Damian had appreciated and unfortunately been forced to admit. Drake had simply given him a soft little smile and informed Damian that he was allergic to eggs.</p>\n<p>Because of this, Damian was able to pick his words carefully. \"When you ask me something, it's as if...every associated memory is immediately brought to the forefront of my mind. No matter what I am trying to say, what I say is a brief summary of the amalgamation. This set in as my condition progressed.\"</p>\n<p>Tim plopped down on the cot beside him with a defeated stillness. “How old is Wonder Woman?” He said, hands pressed against his eyes.</p>\n<p>“She does not remember, so her exact age has been lost to time. Several thousands, undoubtedly.”</p>\n<p>“Shit, sorry. Where does Krypto live?” </p>\n<p>“The Kent Farm in Smallville, Kansas.” Damian stared at his hands. “I do not want to die.”</p>\n<p>“Damian, I’m...I’m doing the best I can.” Tim flopped onto his back, nearly dislodging him from the cot. “If it's not chemical...if it’s not magic...forced memory recall…” He ground the heel of his hands into his eyes, muttering like a madman under his breath. </p>\n<p>Damian let out the breath he was holding when Drake rocketed up into a sitting position. “Psychic. Fuck, that has to be it.” </p>\n<p>“How do you cure a psychic disease?” Damian asked, frantic despite himself. “How do you prevent a psychic aneurysm?”</p>\n<p>“I don’t <em>know</em>, I don’t…''Tim glanced up, spotted his quivering hands. “What’s the real reason Starfire hates human clothing?”</p>\n<p>“She’s allergic to most synthetic fabrics.” Damain wheezed as the pain receded; the thin mattress they shared was jostled as Tim leapt to his feet with a shout.</p>\n<p>The sound of running feet caught his attention before his vision cleared enough to see Tim already returning from the other side of the cave, a wave of black fabric billowing behind him.</p>\n<p>He jammed <em> the </em> cowl, Father's cowl, onto Damian's head. It absolutely swallowed him, pooling onto the floor around him and slipping down to cover his eyes. When he adjusted the mask to peer through the eyeholes, he found Drake crouching before him, fists knotted in the thick, dark fabric. </p>\n<p>\"He configured it to scramble psychic interference after a run-in with the Mad Hatter.\" Tim breathed. \"Try it, Damian. Say something.\"</p>\n<p>Damian looked down the long, batlike nose of the law at Tim Drake. \"I,\" he said, \"have never been anything but perfectly nice to you.\"</p>\n<p>Drake laughed. He laughed so hard, amused and relieved, that he tipped backwards and sat upon the ground with his hands behind him, grinning sunnily up at Damian. And sitting there, swamped in his father's cape, Damian found himself grinning back.</p>\n<p>And it hit him in a rush. \"I remember. I remember who did it,” he said, leaping down from the cot. </p>\n<p>Tim’s smile changed into something a fraction more fearsome. “Let’s call it in.”</p>\n<p>Several rooftops away from the rendezvous point, evidence safely retrieved, Batman took a moment to breathe in the crisp night air.</p>\n<p>His comm fizzled to life in his ear. <em> “Red Robin speaking. Come in, Batman. Come in, Nightwing.” </em></p>\n<p>Bruce tapped his earpiece. “Batman speaking.” Nightwing mirrored the gesture one roof over. “Report.”</p>\n<p><em> “I’ve got a mission for you. Priority Alpha-Nine-Five. Psychic attack. I’ve got everything stabilized, but we need to put a stop to it now rather than later.” </em> </p>\n<p>There was a delicate barely-there thump as Nightwing joined him on the roof.</p>\n<p>Batman nodded to his partner. “Understood. How is he?”</p>\n<p><em> “I’m fine, Batman,” </em> Damian’s voice piped up over the secure channel. <em> “The suspect is a woman with glowing skin. Her accent was one I did not recognize, but can re-create.”  </em>He cleared his little throat. “<em>Gah-thum Siddy</em>—”</p>\n<p>“Wisconsin,” Batman, as a general rule, didn’t laugh or smile much while in costume. That sort of thing gave people the wrong idea. Nightwing had no such qualms, and had muted his comm to <em> wheeze</em>, bent in half and clutching his sides. “That sounds like Wisconsin. Good work, Robin.” Batman did not laugh, because he was a professional.</p>\n<p><em> “He also did a sketch,” </em> Tim again, <em> “and it’s pretty concise. I’m running it through a few databases right now, but I can send a copy to you guys, see if you recognize it.” </em></p>\n<p><em> “I’ve sent it to the BartPhone</em>—”</p>\n<p>“Batcell,” Bruce corrected.</p>\n<p>Dick rolled his eyes, “Like that’s any less silly—”</p>\n<p>\n<em> “—okay, the photo will hit your funny pocket computer any second now, unless you’re in the sewer or something.” </em>\n</p>\n<p>There was a faint sound over the line that might have been Damian snickering, if Damian were the sort of child to let himself be heard laughing.</p>\n<p>\n<em> “In the meantime, Nightwing, you’ll need a cowl with psychic disrupters. You can hit up my place for the Red Robin cowl.” </em>\n</p>\n<p>Batman and Nightwing glance at each other, in sync as always. “There’s a spare cowl in the cave, right?” Nightwing said slowly. “Is there something wrong with that one?”</p>\n<p>There was a pregnant pause.</p>\n<p>“Red Robin,” Nightwing said gleefully, “How did you neutralize the psychic attack?”</p>\n<p>\n<em> “...I think you know how.” </em>\n</p>\n<p>“Just tell me one thing.” Nightwing said gravely. “Is he cute?” The furious shout of a child betrayed rattled through the comms, answered only by bright cackling.</p>\n<p>The <em> Batcell </em> pinged, saving them all from the unfolding conversation. Bruce studied the photograph closely. It was a woman, drawn lightly in pencil, with sharp cheeks and a heavy brow. Batman murmured, “I think...No, I know who this is. Tina Sanders, formerly known as Christina Bertinelli. She got ousted from the family for reasons unknown.” Batman caught Nightwing’s incredulous gaze. “Arrow warned me she might be looking to get a foothold in the Gotham scene.”</p>\n<p>\n<em> “Well, those reasons might have just gotten a little bit more known. She’s a contact telepath with a penchant for messing with people’s heads; she’s been putting her fingers in peoples brains and wiggling them until information comes out or until their brains liquify. The cowl is enough to shield and disrupt it, but she’s still got an extra-sensory grip on Robin.” </em>\n</p>\n<p>“We’ll find her and cut him free,” Nightwing said with an even, furious certainty, all humor gone from his face. Batman was already tuning in to Oracle’s channel, relaying what they knew. This would not take long.</p>\n<p>“Thank you, Red Robin. Good work tonight. We’ll take it from here.” Batman hesitated. “Thank you for taking care of each other. Thank you for trusting each other.”</p>\n<p><em> “Stay safe,” </em> came Tim’s slightly choked response, and the transmission ended.</p>\n<p>It wasn’t fifteen seconds before a new voice, sharper and impossibly clear, filled the airwaves.<em> “Oracle here. Heard something about a couple of birds in trouble?” </em></p>\n<p>“Right here, Ma’am,” Nightwing responded. “Got anything for us?”</p>\n<p><em> “Boy, do I,” </em>Came the answer.</p>\n<p>Batman fixed the image of Christina Bertinelli’s face in his mind and readied his grappling hook. \"Just tell me where I need to go.\"</p>\n<p>\n<em> “Head toward Seventh and Conway. I’ll fill you in as you fly.” </em>\n</p>\n<p>Tim sat in front of the Batcomputer, dizzy with...any number of things. Relief, exhaustion, emotion. His tiny companion paced around the area with leagues of fabric dragging along behind him. They hadn’t really spoken since the cowl had gone on, and hadn’t even looked at each other since the call had ended.</p>\n<p>“I’m going to wipe the audio.”</p>\n<p>The Batman mask floating four feet off the ground spun to face him with an eventful <em> swoosh</em>. Demanding answers without asking for them.</p>\n<p>“The recordings in the car, and the audio in here, too.” Tim sighed. “I’m going to do it before they get back. Before they find out what it did to you.”</p>\n<p>“Thank you,” Damian said cautiously, creeping closer to take a seat near Tim. As if to watch him. As if this, too, might be some sort of trick to get the better of him.</p>\n<p>And Tim couldn't stop himself. “I wouldn’t do that to you.”</p>\n<p>Damian shifted in his seat. “I know that Father does not permit killing.”</p>\n<p> “Damian. If you didn’t know before, I’m telling you now. I would not jeopardize your safety in the field or in your personal life for petty or selfish reasons. And,” Tim closed his eyes, “I’m sorry about what I did in the car. If I had known, I would never have...I thought you were messing with me. And I was already pissed because of Bruce, and I took that out on you and missed the signs that something was wrong. I was unprofessional, and I was mean. And I’m sorry.”</p>\n<p>Silence. Then, “I am sorry for trying to kill you.” Damian said into the folds of his cape. “Thank you for helping me today.”</p>\n<p>Tim nodded, thinking that was it. He did as he’d promised, tiptoeing through the system and scrubbing the files of Damian’s secrets. </p>\n<p>“...I do not think I am very good at having a family.” Damian said in the smallest voice Tim had ever heard from him, “I lack experience. I worry that I will not be able to catch up.” He squirmed, adjusting the cowl where it tried to slip down again.</p>\n<p>“If it makes you feel any better, I’m not so good at it either.” Tim swept his gaze over the little guy, considering.</p>\n<p>“You hungry?”</p>\n<p>Damian nodded.</p>\n<p>“Me too.” Tim got up and started toward the kitchenette. “How do you feel about grilled cheese?” he called over his shoulder.</p>\n<p>That actually surprised a laugh out of Damian. Tim counted it as a victory.</p>\n<p>They weren’t going to automatically click the way they both had with Dick. That wasn’t how the two of them worked, but that didn’t mean it was impossible. Maybe this ‘brother’ thing was the sort of thing that took both of them<em> trying </em> to get it right.</p>\n<p>The smallest Batman rumpled over to join him, peering at the ingredients Tim had amassed on the counter.  “Now, I’ve never done this before, but it’s not like we can do worse than Jason.” Tim smiled down at Damian. Trying.</p>\n<p>\"A statistical improbability,” Damian agreed and, trying, allowed the corner of his mouth to twitch upward in response.</p>\n<p>Batman and Nightwing rolled into the cave at a crisp 5:51am, wayward telepaths neutralized and locked away. </p>\n<p>Psychic truth serum. Dick shook his head. <em> Only in Gotham. </em></p>\n<p>Tina, it seems, hadn’t been able to convince anyone at all to work with her or even associate with her. So she had decided to build a name for herself by cracking heads open for sensitive intel, following the poor saps around as they spilled their guts, and then abandoning them on random street corners to die.</p>\n<p>Dick could have told her she’d never find business in a place like Gotham. Gotham had secrets running through her <em> veins.</em> No one wanted to work with someone who would jeopardize her delicate balance.</p>\n<p>“Tim? Damian?” He called hoarsely. No response. Stepping over to the kitchenette for some tea, he discovered why.</p>\n<p>On an adjacent couch, with burned bits of sandwich crust and empty fruit snack packages littered around them like a halo, were the men of the hour. Tim was snuggled against the arm of the couch with his knees drawn up, and Damian was curled up against his side, still wearing the comically too-big cowl. </p>\n<p>Absolutely <em>dead</em> asleep, the both of them.</p>"
}