{
  "id": "34315816",
  "url": "https://archiveofourown.org/works/34315816?view_full_work=true",
  "author": [
    "favspacetwink",
    "moonlumie"
  ],
  "title": "double down",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Haikyuu!!"
  ],
  "relationships": [
    "Miya Atsumu/Sakusa Kiyoomi"
  ],
  "characters": [
    "Miya Atsumu",
    "Sakusa Kiyoomi"
  ],
  "additional_tags": [
    "BDSM",
    "Predicament Bondage",
    "Nipple Play",
    "Shibari",
    "Sex Toys",
    "Orgasm Control",
    "Verbal Humiliation",
    "Fluff"
  ],
  "language": "English",
  "series": "Part 9 of Terminal Curiosity",
  "published": "2021-10-06",
  "completed": null,
  "words": "14,283",
  "chapters": "1/1",
  "comments": "709",
  "kudos": "13,056",
  "bookmarks": "657",
  "hits": "226,704",
  "summary": "<p>When Atsumu turns to face him, Kiyoomi doesn’t miss the way Atsumu’s eyes rake over his body, lingering on his hands. He adjusts his gloves and gets a little thrill of satisfaction when Atsumu bites his lip, eyes still stuck on the smooth black nitrile. </p>\n<p>“It usually takes a decent amount of equipment to create a true predicament,” Kiyoomi says. “Unless you’d prefer I go easy on you…”</p>\n<p>Atsumu’s eyes flash. Kiyoomi grins.</p>",
  "notes": "<p>Thank you all for your patience and we hope you enjoy! We were a little worried about releasing this one after so long since it was definitely planned as a transition piece between Sleeping Dogs and some very… fun stuff we have planned for the next parts ;) But don't worry - we didn't skimp on this one, transition or not. </p>\n<p>We've both had a lot going on over the past months so it means a lot that you all are still interested in reading this and have stuck around. Thank you again, and enjoy :)</p>\n<p>P.S. Happy birthday Miya twins. Atsumu's present is getting destroyed and Osamu's present is Atsumu not telling him about it.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Leave a comment to let us know what you thought! We hope you liked it :)</p>",
  "text": "<p>“Ah—nngh, <em> fuck...” </em></p>\n<p>Atsumu feels feverish as he takes Sakusa deep over and over, riding his cock like he doesn’t know how to do anything else. His knuckles are white where he’s gripping the headboard, the bed frame squeaking as he drives down hard and nearly chokes on the euphoric sensations. Underneath Atsumu, half-propped against the headboard by a few pillows, Sakusa’s staring at him with dark eyes, his gaze so intense it sends chills prickling along the length of his spine.</p>\n<p>“Yeah, that’s it,” Sakusa breathes, hands tightening on Atsumu’s hips. “Don’t stop.”</p>\n<p>“Shit, oh my <em> god—” </em></p>\n<p>Atsumu’s voice is hoarse, probably from all the screaming he did in the shower earlier. It breaks completely on his next moan, torn out of him when Sakusa smacks his ass once, <em> hard, </em>then draws his legs up to change the angle. Atsumu pushes through the pleasure and keeps the rhythm going—a tempo so good that he’s not sure his body would let him stop even if he wanted to.</p>\n<p>He cries out, breath stuttering over the sound, when Sakusa threads a hand through his hair and tugs, a feral grin on his face in response to the noises it draws from Atsumu.</p>\n<p>“Just like that,” he murmurs, grin sharpening when Atsumu moans and clenches around him. “Just like that, Atsumu, eyes on me.”</p>\n<p>\n<em> “Omi…” </em>\n</p>\n<p>Sakusa moves his other hand to circle loosely around Atsumu’s dripping cock, just holding it there and letting Atsumu’s desperate movements do the work for him. His eyes are gleaming, grip so loose there’s barely any friction—but that just makes Atsumu work harder, rolling his hips as he fucks himself and thrusts into Sakusa’s hand. </p>\n<p>“Yes, Omi—ungh, fuck, <em> yesss—” </em></p>\n<p>He falls forward, his thighs screaming for relief, and grips the headboard tighter as he lets his forehead rest against Sakusa’s. Up close like this Atsumu can see the flecks of gold in his charcoal eyes, the two of them watching each other hungrily as Atsumu drives them closer and closer to completion. His glutes are aching, slapping down against the tops of Sakusa’s thighs, their groans mingling together as they move. </p>\n<p>It’s the most primal sex they’ve ever had: not planned in the slightest, just driven by the pure, raw need that hadn’t been sated by their first round in the shower. Atsumu’s never quite felt like this, like he can’t get close enough; he’s not tied up, he’s free to move, but no single position has been enough to fully satisfy him. He wants to put his hands and lips and tongue all over the man underneath him and he never wants to stop.</p>\n<p>If sub drop is a thing then Atsumu idly wonders if there’s such a thing as a sub high — but no, he doesn’t really think this has much to do with <em> that </em> at all. It’s more than that. </p>\n<p>Sakusa’s hand abandons its tight grip on Atsumu’s hair in favor of pressing in between their bodies to pluck at a nipple. Atsumu shudders, growling low in his throat as his hips twist uncontrollably. “Yes yes <em> yes, </em>don’t stop—”</p>\n<p>He only realizes his eyes have fluttered closed once he feels lips press against his own. Sakusa is breathing hard, nearly panting against his mouth. Atsumu bites his lower lip sharp enough to make him gasp before slipping his tongue between Sakusa’s lips. His nipple is throbbing, pinched and rolled between deft fingers as he groans into Sakusa’s mouth, rocking his hips down viciously. </p>\n<p>The grip on his dick tightens ever-so-slightly, enough to make Atsumu shudder. He can feel himself getting close, but he doesn’t want it to <em> end. </em> His muscles are burning but Atsumu barely notices, too caught up in how <em> good </em>he feels, his body on autopilot as his instincts make all his decisions for him. Sakusa hisses and twists his nipple, tearing a ragged, drawn-out moan from Atsumu’s very core and swallowing it hungrily.</p>\n<p>“Uuhhh, <em> uuugh</em>, <em> Omi…!” </em></p>\n<p>“Mmnh—are you close?” Sakusa breathes between kisses. Atsumu nods, pace getting faster and faster as he nears the edge. “Me too.”</p>\n<p>Atsumu moans at the thought and hopes he can hold out long enough to watch Sakusa go over first. He pulls back from the kiss, biting his lip as Sakusa lets go of his nipple to run his free hand up and down his back. They’re panting, staring at each other like they’re both waiting for the same thing; Atsumu’s mouth falls open and he feels his eyelids flutter, chest heaving as his orgasm starts to spark in his gut.</p>\n<p>Then Sakusa gasps, eyes dropping down to where their bodies are connected before returning to Atsumu’s face. He swears, then <em> breathes Atsumu’s name </em>as his eyes slip shut and his fingers tighten on Atsumu’s lower back. </p>\n<p>The sight of Sakusa throwing his head back, completely lost to pleasure as he comes, is what does it for Atsumu. Because <em> he </em> did <em> this </em>to Sakusa: made his brows knit together, wound his whole body whipcord tense underneath Atsumu as his hips pump up in little desperate movements. </p>\n<p>Shit. <em> Shit. </em></p>\n<p>Atsumu cries out hoarsely as he follows Sakusa over.</p>\n<p> </p>\n<p>“Now we have to shower again,” Sakusa murmurs, playing with his hair.</p>\n<p>Collapsed on top of him, Atsumu grunts into his shoulder but doesn’t move, horribly oversensitive where he’s still stretched around Sakusa’s half-hard cock. </p>\n<p>“Let me rephrase,” Sakusa says after another minute. “We <em> need </em> to shower again before bed. <em> Separately. </em>Get up, Atsumu.”</p>\n<p>“Such a romantic,” Atsumu mumbles into his skin.</p>\n<p>Sakusa huffs. “Shut up.”</p>\n<p>Atsumu snorts and hits his shoulder as he leans up, pulling up off of him with a hiss.</p>\n<p>He might be too sore to play at practice tomorrow, but that’s a problem for future Atsumu to deal with.</p>\n<p> </p>\n<p>Atsumu is doing a final sweep of his apartment before he leaves the house on a Thursday morning. The bathroom is clean, the kitchen is spotless, and the sheets have been optimistically changed. In an even more aggressive bout of optimism, Atsumu heads over to his bedside table as he shrugs on a brown leather bomber jacket.</p>\n<p>He goes straight for the back of the drawer where a floridly orange box of peach condoms sits next to the ones he usually uses.</p>\n<p>Atsumu is pretty sure hell will freeze over before Sakusa lets him give road head, but that’s why one always dresses in layers.</p>\n<p>Just in case. </p>\n<p>He’s just about to slam the drawer shut when he Atsumu catches sight of the items still sitting loose in the front of the drawer.</p>\n<p>He slows to a standstill, looking down at a supple leather collar and a pair of black, fur-lined handcuffs.</p>\n<p>They haven’t come out of that drawer since that fateful day, over three whole weeks ago now. </p>\n<p>It makes Atsumu’s spine feel itchy to think about, and it brings an embarrassed flush to his face — and not entirely in a good way. </p>\n<p>But most of all, above everything else, seeing those objects makes Atsumu blindingly, uncomfortably, and inescapably <em> horny as fuck.  </em></p>\n<p>It’s not that Atsumu hasn’t been <em> getting </em> any. In fact, he’s been getting a <em> lot. </em> He and Sakusa have fucked on every sufficiently sanitary or sanitizable surface in their apartments over the past three weeks. Sure, that limits it to the beds, the showers, Sakusa’s couch with his quilt thrown over it, and one very memorable kitchen counter experience, but it’s still been as much as their busy schedules allow.</p>\n<p>So it’s not that Atsumu has blue balls or anything.</p>\n<p>It’s just that… it’s been nearly a month since he and Sakusa have done any sort of <em> scene </em> at all.</p>\n<p>At first it was totally fine. Atsumu understands wanting to take a break after his series of… stunts. He knows he made it clear to Sakusa that he didn’t just want dates in exchange for bondage. </p>\n<p>But it’s not like he wanted Sakusa to stop tying him up <em> all together.  </em></p>\n<p>Now, it’s been three weeks. Atsumu hasn’t brought it up. And each passing day makes it seem more awkward to bring it up <em> now </em> when Sakusa hasn’t said anything. </p>\n<p>\n<em> What if Omi doesn’t even want him as a sub anymore, after all that? </em>\n</p>\n<p>Atsumu quashes the thought immediately. He’s not letting himself go down that kind of path on his own anymore. He just needs to talk to Sakusa about it. Like an adult. </p>\n<p>Atsumu cringes and shuts the drawer a bit harder than he meant to.</p>\n<p>“I wish it wasn’t fucking tournament season…” Atsumu grouses as he yanks on his shoes. “Would be a hell of a lot easier with a couple bottles of wine.”</p>\n<p>Still, perhaps a good enough date will grease the wheels regardless. Atsumu picked a fresh local market called Kuromon Ichiba that’s favorited by chefs, meaning there will be lots of produce and meat to choose from should they decide to try making something at Atsumu’s place, but that also has several upscale eateries they can choose from if they’re feeling… less effortful. </p>\n<p>It’s flexible. It’s simple. It’s sophisticated.</p>\n<p>And Atsumu is about to claw his own skin off waiting for Sakusa to pick him up outside his apartment. </p>\n<p>Some part of him knows he and Sakusa will have to talk through what happened that fateful night before Sakusa will likely feel comfortable getting hardcore again. Hell, Atsumu probably needs to put some of what happened into words himself before he’d be able to relax enough to be put under.</p>\n<p>Still, the idea of just saying all that after what happened? It seems impossible. He doesn’t want to talk things out like an adult. </p>\n<p>But <em> god, </em> does Atsumu want to be put under.</p>\n<p> </p>\n<p>The market Atsumu has selected is clearly built to be packed, but is fairly low key on a Thursday afternoon. Kiyoomi doesn’t take his mask off, but he does let his shoulders relax as they walk through the doors into the interior of the market.</p>\n<p>“Not too busy,” he remarks as he glances around at the stalls closest to the door. </p>\n<p>Atsumu chuckles and gives Kiyoomi a self satisfied smirk.</p>\n<p>“Don’ worry, Omi-kun. I wouldn’t have made ya come out to a place like this on a weekend,” Atsumu says as they head down the first row. “Well, unless I was really strapped for entertainment.”</p>\n<p>Kiyoomi narrows his eyes but elects not to respond beyond that, not wanting to give Atsumu any ideas. </p>\n<p>“Are we eating here?” Kiyoomi asks as Atsumu veers off to investigate a shop, hands lazily shoved in the pockets of his jacket. </p>\n<p>“Prob’ly not. I thought we’d shop here and I’d cook for us. But if ya see a restaurant ya really wanna try, we can eat here instead,” Atsumu says as he moves from a fish counter to a shellfish vendor. </p>\n<p>Kiyoomi’d had his doubts when Atsumu said he’d handle the plans for the day — which apparently was a fair concern considering his comment about using Kiyoomi for entertainment — but Kiyoomi has been making a concerted effort to let Atsumu take the lead with this whole dating thing.</p>\n<p>It’s not like Kiyoomi has any experience.</p>\n<p>Atsumu leans over to inspect the selections of different crabs packed in ice. His skin catches the light, pale gold and completely unblemished. </p>\n<p>Kiyoomi actually has very few complaints about the whole dating thing, given how smoothly the past few weeks have gone… except, ironically, for Atsumu’s <em> unblemished </em> status. They’ve been busy, and even with a few coffee dates and more penetrative sex than Kiyoomi’s had in the rest of his life combined, they haven’t done anything that would leave more than a pale love bite or finger bruises on hips.</p>\n<p>“Omi-Omi, look at this one! It’s massive,” Atsumu says, pointing out an admittedly giant dungeness crab. “Do you like crab?”</p>\n<p>“No,” Kiyoomi answers simply.</p>\n<p>They’re bottom feeders. They suck tiny, often rotting, bits of nutrients off sand. It grosses Kiyoomi out. </p>\n<p>“Uhg, fine,” Atsumu says and straightens, moving on to the next stall with Kiyoomi in tow. </p>\n<p>The rest of the afternoon is passed in a similar fashion, sprinkled with mostly food related stories. Atsumu has a shocking number, but then it’s not that surprising considering his twin’s passion. Kiyoomi even has a few of his own, from tales of dull fancy dinner mishaps, to Komori’s culinary adventurousness which often bit him in the ass. </p>\n<p>Kiyoomi finds himself slowly relaxing in Atsumu’s presence. His usually tightly wound spine uncoils enough for him to chuckle readily at some of Atsumu’s stories by the time they cross the threshold to his apartment with a few bags of groceries. </p>\n<p>However, noticing that seems to be a complete jinx.</p>\n<p>Kiyoomi settles down on one of the two dining chairs at Atsumu’s insistence before he returns to the kitchen. And from that point on the easy atmosphere of the room slowly dissipates.</p>\n<p>It takes a moment for Kiyoomi to notice the way that Atsumu has started talking a lot louder, and constantly now. The third crash from the kitchen echoes around the studio as Atsumu drops another pan.</p>\n<p>It's frankly a shock when Atsumu successfully sets two fully plated dinners on the little table.</p>\n<p>“Not dropping these ones?” Kiyoomi asks. Atsumu flips him off good-naturedly.</p>\n<p>For a little while, Kiyoomi thinks that was the end of it—that maybe Atsumu was just nervous to be cooking in front of someone—but then Atsumu stops making eye contact again. He gets kind of quiet for long enough that it makes Kiyoomi flash back to their first proper date.</p>\n<p>Is this how all their dinner dates are destined to be? Kiyoomi can’t help but wonder.</p>\n<p>“This really was good, Atsumu,” Kiyoomi reiterates, both because it’s true and because Komori told him to compliment Atsumu’s cooking <em> no matter what </em> when he texted him that Atsumu was going to be making dinner for the two of them.</p>\n<p>Atsumu jumps, as if he hadn’t realized how quiet it had gotten. Kiyoomi sighs. </p>\n<p>“Ah, thanks, Omi,” Atsumu says. “Are ya done?”</p>\n<p>Kiyoomi isn’t even able to answer before Atsumu snatches the plate up and darts back towards the kitchen. Kiyoomi scowls, hating the sense of twisting confusion in his stomach. Had he done something wrong when they got back to the apartment? Missed some social cue?</p>\n<p>“What’s the matter with you?” Kiyoomi asks bluntly and sees Atsumu’s shoulders jump, followed by the sound of a plate clattering into the sink. “Did I do something to upset you?”</p>\n<p>Atsumu stays frozen for a moment, shoulders still tensed up as he takes a visible breath.</p>\n<p>“It’s n-”</p>\n<p>“It’s not <em> nothing,” </em> Kiyoomi snaps, standing up from the table and striding over to the counter. He’s not always the best at reading body language, but everything about Atsumu’s posture and aura screams <em> do not touch </em>right now, so he tries to keep a reassuring distance. “What’s going on?”</p>\n<p>Atsumu huffs out a little laugh. “Shit, gimme a second. Not everyone’s as blunt as you, Omi.” When Kiyoomi makes a frustrated noise, Atsumu adds, “It’s nothin’... bad, it’s just… embarrassin’.”</p>\n<p>Embarrassing? How long has he been sitting on... whatever this is? Kiyoomi frowns and turns around so he can lean back against the counter, staring at the wall over Atsumu’s bed. </p>\n<p>At least he can take comfort knowing that if Atsumu <em> really </em>didn’t want to talk about this, he would have told Kiyoomi in no uncertain terms to fuck off the second Kiyoomi started pushing him. </p>\n<p>Finally, after he’s washed their dishes and moved on to the pans, Atsumu clears his throat. </p>\n<p>“So… okay. First, ya should know that this… goin’ on dates, sleepin’ over at each other’s places, spendin’ so much time together… it makes me <em> really </em>happy.”</p>\n<p>Oh, god. Why would he say that. Is Atsumu about to break up with him? Is Kiyoomi about to get <em> dumped? </em>His breath feels frozen in his throat.</p>\n<p>“And the sex has been good—<em> really </em>good—so I feel like shit even bringin’ this up, but—”</p>\n<p>“Atsu—”</p>\n<p>“—I really miss doing scenes even though s’my fault we stopped doin’em,” Atsumu blurts out in a single breath before Kiyoomi can cut in.</p>\n<p>Oh. <em> Oh. </em></p>\n<p>Well. That’s much more easily remedied than many of the other scenarios that Kiyoomi had created in his head. <em> This, </em>Kiyoomi can talk about—is eager to talk about, in fact.</p>\n<p>“Why do you think it’s your fault?” </p>\n<p>Atsumu finally looks up from the sink, glancing over at Kiyoomi with startled eyes. </p>\n<p>“Ya really have to ask?”</p>\n<p>Kiyoomi rolls his eyes, “I think it’s been more than proven by this point that we tend to misunderstand each other if we don’t spell things out. So yes, I do.”</p>\n<p>“This is why I didn’t wanna talk about it!” Atsumu groans, a whine edging into his voice. </p>\n<p>“I’ll let you finish the dishes, if you’d like,” Kiyoomi says, ignoring his outburst. “I’ll just be on the couch, enjoying my tea, waiting for you.” </p>\n<p>He hears Atsumu grumbling as he makes his way over to the living area and can’t help but smirk. </p>\n<p>“Oh, and Atsumu?” Kiyoomi says, and looks back at the sink to meet the other man’s nervous gaze. “I miss doing scenes too, if that changes how you feel about having this conversation.”</p>\n<p>Kiyoomi is able to catch the way Atsumu’s eyes widen moments before the other man looks away, a blush rising high on his cheeks as he busies himself with the last of the dishes.</p>\n<p> </p>\n<p>There’s only so many times Atsumu can scrub the last pan.</p>\n<p>He’s stalling, and Sakusa knows it, too, from the way Atsumu can feel the other man’s eyes boring into the back of his head. </p>\n<p>Atsumu squeezes some more unnecessary dish soap onto the sparkling-clean pan and frowns. It’s stupid—this is one of those talks that he <em> knows </em> needs to happen, that he knows he’ll feel better after, but he is absolutely digging his heels in at the prospect of actually doing it. Atsumu has spent the past several weeks doing everything in his power to put that fateful day behind him; he’s so embarrassed by how he acted that the prospect of unearthing it and reliving it sounds like hell.</p>\n<p>Ugh. </p>\n<p>Eventually, Atsumu takes a deep breath, squares his shoulders, and sets the pan in the drying rack.</p>\n<p>“Alright, Omi-kun,” he drawls, padding over to the couch like he’s strutting toward his own execution. </p>\n<p>“Stop being so dramatic.”</p>\n<p>“Stop being such an asshole,” Atsumu shoots back, but there’s no heat behind it. He flops down onto the other side of the couch and stretches out, wiggling his feet under Sakusa’s thighs for warmth. </p>\n<p>“I think you’re out of luck there,” Sakusa says dryly. Atsumu snorts. “Here, let me start. Before I say anything, I want you to know that I don’t blame either of us for what happened, and I don’t want you to feel guilty for trying to protect yourself at the time, okay? Even if it backfired spectacularly.”</p>\n<p>Atsumu scowls at him, feeling oddly touched.</p>\n<p>“So something went… wrong, the last scene we did. I keep wondering if I should have checked in with you more often, or stayed with you longer right afterward before I went to clean up, or… <em> something. </em> I didn’t bring it up until now because you didn’t seem to have any desire to start doing scenes again, but if we both <em> want </em> to, we need to figure out what went wrong so it doesn’t happen again.”</p>\n<p>“I told ya what went wrong,” Atsumu says, frowning. “It’s ‘cause I was all in my feelings ‘n convinced you were just… usin’ me. And not in, like… the good way.”</p>\n<p>Sakusa’s mouth quirks. It makes Atsumu bite down on his own small smile.</p>\n<p>“But, yeah. That’s it.”</p>\n<p>Sakusa raises one eyebrow. “That’s it? So the entire scene was perfect, you wouldn’t change anything about it, and the only thing that made you drop was thinking your feelings were unrequited after you came down from the high?”</p>\n<p>Oh. Well. Uh.</p>\n<p>Atsumu looks at his lap.</p>\n<p>“It’s okay,” Sakusa says quickly. “I won’t be offended, whatever it was. I just need to know so I won’t do it again.”</p>\n<p>Atsumu digs his nails into his thighs. He never thought he’d see the day where Sakusa was the nervous talker between the two of them.</p>\n<p>“Was it the prostate milking? It didn’t seem like you liked it very much, but you kept saying ‘green,’ and I wasn’t sure if you weren’t responding much because you were under or because—”</p>\n<p>“Omi, stop, <em> stop. </em> It wasn’t the…” Atsumu can’t bring himself to say <em> prostate milking </em> out loud. “...Well, ya know what, it was, a little bit. But it was part of, like, a perfect storm. First off, I thought ya didn’t like me, so I was gonna feel bad afterward no matter what. Then… well, I wasn’t super into the scene itself, especially when I realized I wasn’t gonna get to come.” </p>\n<p>He barely blushes saying that; maybe Sakusa’s matter-of-fact approach is rubbing off on him.</p>\n<p>“But the kicker was… I knew that it was somethin’ ya wanted to try, which meant you were probably, like, <em> into </em> it. So, even though part of me knew I was havin’ a bad time…” <em> This </em> is why Atsumu didn’t want to bring this up. <em> Be an adult. Be an adult. </em>He takes a breath and continues. “I still said green when ya asked. I think because… because I figured that’s what ya wanted t’hear.”</p>\n<p>Sakusa doesn’t say anything for several moments. Atsumu blinks down at his pants a couple times before chancing a glance over at the other side of the couch. </p>\n<p>Sakusa’s mouth is twisted into a small frown, almost a pout. It looks unfairly cute on him. But when concern starts to bleed into his expression, veering uncomfortably close to pity, Atsumu tries to stop it in its tracks.</p>\n<p>“And I know that’s — really bad. I’m sorry. You did your part, ya know, givin’ me all these chances to tap out… I just didn’t do mine. And I’ve been kickin’ myself for <em> weeks </em>thinkin’ about that time you got all happy ‘cause I said yellow. You remember? With the…”</p>\n<p>Atsumu pinches three fingers together and mimes inserting something between his legs.</p>\n<p>“The sounding?” Sakusa asks, eyes crinkling. Atsumu nods. “Right, but… Atsumu, I wasn’t happy because you needed to say yellow. I was happy that you felt like you <em> could </em> say yellow.”</p>\n<p>“Right right right, you were talkin’ about how ya could really trust me after that, and that’s just been <em> weighin’ </em> on me. Like we had this good thing going, this great... <em> foundation</em>, and I got real low for two weeks and fucked it all up,” Atsumu says and leans back against the couch, letting out a big breath of air. </p>\n<p>“Fucked it <em> all </em> up seems like a bit of an exaggeration,” Sakusa hazards, looking a bit frustrated and young himself. </p>\n<p>“I know,” Atsumu agrees, and he does. “I just wish I could undo it instead of us figuring out a way to <em> fix </em> it. Especially when all my ideas to fix it just seem stupid in my head.”</p>\n<p>Sakusa picks at a seam on the edge of the couch.</p>\n<p>“Well, you’ve said <em> lots </em> of really stupid things to me and some of them turned out better than I expected… so, what were you thinking?”</p>\n<p>“First of all, rude, Omi-Omi,” Atsumu says as he hunches over again. He pulls his leg up, which sends his knee knocking into the side of Sakusa’s thigh. “Aren’t you the expert here? You got any ideas?”</p>\n<p>“Honestly, I’ve never really… resolved an issue with a sub before. I’d just count it as an incompatibility and look for a better fit. Which obviously I’m not looking to do here,” Sakusa quickly adds, and the subtle press of his leg into Atsumu’s knee is a reminder that he’s serious about that. “Like… I’m twenty-three years old. Just because I’ve been in the scene longer than <em> you </em> doesn’t make me the expert on all things dominant and submissive.”</p>\n<p>Atsumu hums. That is true. Sometimes Atsumu forgets that Sakusa is actually younger than him, if just by a bit. It’s oddly comforting to be reminded, even in the BDSM department, Atsumu’s not completely alone in being a little in over his head. Sakusa looks directly at him again.</p>\n<p>“So… what is your idea?” Sakusa prompts.</p>\n<p>Atsumu grits his teeth and just spits it out.</p>\n<p>“It’s not so much a whole idea as just... wanting to do scenes again,” Atsumu says and then braces himself before locking eyes with Sakusa. “And I want — I <em> need </em> to have ya trust my greens again. I know that’s kind of shitty to ask when I just gave ya every reason not to, but I don’t want to go into a scene with that hangin’ over us. I learned my lesson, I know the signs, and things with us are pretty good, aren’t they?”</p>\n<p>Atsumu flushes, he hadn’t quite meant to say that last part, but Sakusa actually doesn’t flinch. </p>\n<p>“I haven’t hated it at all,” Sakusa says, which is a ringing endorsement coming from those lips, and it makes Atsumu laugh.</p>\n<p>“Wow, enthusiastic, Omi-kun,” Atsumu teases, but it makes him feel more confident. “So… can I ask that of ya? Can I ask you to trust me again, even if I don’t deserve it?”</p>\n<p>Sakusa shakes his head and laughs a little, too. </p>\n<p>“I appreciate the seriousness with which you’re taking this, but I promise you’re not the first one to ever mess up judging their own limits before,” Sakusa reiterates. “So, yes. I’ll trust your colors as long as you promise to err on the side of caution for a little while.”</p>\n<p>“Deal,” Atsumu can’t help but blurt, so many weights suddenly lifting off his shoulders.</p>\n<p>“Especially when it comes to starting scenes in a good headspace. There’s always more time, right?” Sakusa says with a rather warm smile, and — <em> oh, </em> that’s right. They’re <em> dating </em> now, and as long as they are, there’s always another day. Atsumu can always just ask Sakusa to make out with him and watch volleyball if he’s not feeling up to getting wrecked. He hadn’t really thought about it in <em> context </em>before. “How does that sound, Atsumu?”</p>\n<p>“Great,” Atsumu agrees quickly. “I promise.”</p>\n<p>Before Sakusa can say anything else, Atsumu hops up from the couch and heads over to his bedside table. He opens it with a small clatter. He reaches in and grabs the cuffs and collar that have still been sitting inside. </p>\n<p>He goes back to the couch and all but shoves them into Sakusa’s hands, causing the other man to frown in confusion.</p>\n<p>“Wh— I told you these were yours, Atsumu,” Sakusa says. “I wasn’t lying.”</p>\n<p>Atsumu sits back down on the couch, much closer to Sakusa this time, leaning his side into the back of the couch, head leaning on his knuckles. He smiles.</p>\n<p>“I know. But I want you to hold onto them,” Atsumu explains, a shiver rolling through his body as he traces the collar in Sakusa’s palm with his eyes. “Because when I see them next, I want it to be when you’re puttin’ them on me. That okay, Omi-kun?”</p>\n<p>Sakusa’s eyes darken, the air between them thickening. He nods, gently placing the items in his lap so he can reach up to card his fingers through the strands of hair at the nape of Atsumu’s neck and guide him in for a searing kiss.</p>\n<p>“Sounds good to me,” Sakusa says against his lips, and Atsumu surrenders to his touch — just a taste of what he’s looking forward to. </p>\n<p> </p>\n<p>They take it slow for another week after that. </p>\n<p>Well, vanilla. </p>\n<p>They take it vanilla, through a string of four away games: three cities in six days. Once he’s slept a blessed night in his own bed once more, Kiyoomi starts to really focus on planning their next scene. A few texts back and forth finds them settled on the upcoming Saturday, the first of two off days in a row. </p>\n<p>They settle on something new to Atsumu and much beloved by Kiyoomi: predicament bondage. As per usual, Atsumu says he doesn’t want to know any of the fine details, as long as Kiyoomi’s picking from things on his list. </p>\n<p>Which means Kiyoomi takes some liberties with his planning.</p>\n<p>It’s not until Kiyoomi is drying off from his shower that the anticipation of the scene starts to really course through him. He’s <em> missed </em>this. Now that he knows Atsumu’s been longing for it, now that they’ve talked about what went wrong during the last scene, Kiyoomi can finally relax into the familiar excitement. </p>\n<p>He already has all of his toys set up in the bedroom, so Kiyoomi takes some extra time to style his hair. If Atsumu is already in there waiting for him, all the better; that just means he’ll sweat a little in suspense, which is never a bad thing. Kiyoomi dresses in his normal white button-down and black slacks, forgoing a mask but pulling on a pair of gloves mostly for nostalgia—to get in the <em> mood, </em> so to speak. </p>\n<p>Atsumu is indeed waiting in the bedroom, clad only in a towel, inspecting all the toys laying on the bed. </p>\n<p>He looks up when Kiyoomi exits the bathroom and says, “Ya really pulled out all the stops, huh, Omi-kun? It’s like a kinky greatest hits out here.”</p>\n<p>He waves the butt plug he’s holding before setting it down and picking up his collar instead. When Atsumu turns to face him, Kiyoomi doesn’t miss the way Atsumu’s eyes rake over his body, lingering on his hands. He adjusts his gloves and gets a little thrill of satisfaction when Atsumu bites his lip, eyes still stuck on the smooth black nitrile. </p>\n<p>“It usually takes a decent amount of equipment to create a true predicament,” Kiyoomi says. “Unless you’d prefer I go easy on you…”</p>\n<p>Atsumu’s eyes flash. Kiyoomi grins.</p>\n<p>“No fuckin’ way.” Atsumu clutches the collar a little tighter and puts his other hand on his hip. “I can take it.”</p>\n<p>Kiyoomi finds himself gravitating toward Atsumu, caught in his orbit. He reaches out and strokes Atsumu’s cheek once they’re close enough, relishing the way Atsumu’s breath catches.</p>\n<p>“I know you can,” he says. </p>\n<p>He feels Atsumu’s arm wrap around his waist, tugging him in closer, rubbing over the crisp fabric of his shirt in needy little movements. Kiyoomi drops his voice to a low murmur, repeating himself as he plucks the collar from Atsumu’s other hand. </p>\n<p>“I know you can.”</p>\n<p>Kiyoomi cups Atsumu’s cheek and slips a finger underneath the hem of the towel, gripping it so he can pull Atsumu flush against him. Their lips meet as Atsumu gasps, making it easy for Kiyoomi to lick into his mouth, sliding his tongue over Atsumu’s as he presses impossibly closer. Both of Atsumu’s hands are running up and down his back now, clutching at his shirt as he moans low and shameless.</p>\n<p>\n<em> “Omi—” </em>\n</p>\n<p>Kiyoomi kisses the breath out of him for a few more moments, reaching up to fit the collar around his neck. Atsumu makes a needy sound when the soft leather settles at the base of his throat; when Kiyoomi pulls back so he can finish buckling it, Atsumu blinks and swallows, then lets his eyes flutter closed, exhaling softly as his grip on Kiyoomi’s shirt loosens. </p>\n<p>Kiyoomi takes a moment to appreciate how well the collar suits him, to watch the way Atsumu seems to revel in it, then moves away entirely to grab the black rope from the bed. </p>\n<p>“Come on, Atsumu. You want to watch again, right?”</p>\n<p>Atsumu’s eyes pop back open and he nods, following Kiyoomi over to the mirror, nearly stumbling a little in his eagerness. Kiyoomi urges his arms up, away from his torso, and steps into the space behind him, close enough that he can feel the heat radiating from Atsumu’s body. His hair is still damp from the shower; the scent of Atsumu’s shampoo induces a nearly instinctual response at this point, and Kiyoomi can’t help but inhale deeply, shivering as all their other post-shower memories flood his subconscious. He presses a little closer and folds the rope, kissing Atsumu’s bare shoulder as he reaches in front of him.</p>\n<p>“I missed this,” Atsumu blurts when Kiyoomi draws the rope over his chest for the first time.</p>\n<p><em> Cute. </em>Kiyoomi smiles and moves his lips to the side of Atsumu’s neck, right above his collar.</p>\n<p>He glances further down at their reflections in the mirror. The front of the towel is starting to tent.</p>\n<p>Atsumu’s breathing gets heavier as Kiyoomi fashions a harness that hugs his chest, framing each pec individually and continuing down his abdomen to stop right above the hem of the towel. Once those knots are secure, he ties Atsumu’s arms to his sides by looping rope through the harness he just created, working his way methodically down each side.</p>\n<p>This way, Atsumu’s arms aren’t crossed behind himself, which would be uncomfortable since Kiyoomi wants him on his back for this scene. Instead, he’s made just as helpless by the ties binding his arms straight down. </p>\n<p>Kiyoomi glances up at the mirror when he’s done, groaning quietly when he sees the flush that’s spread from Atsumu’s cheeks all the way down his neck. There’s a noticeable bulge in the towel now, and Kiyoomi can’t help the way his hands stray to the makeshift knot that’s keeping it in place.</p>\n<p>The towel comes loose with barely any effort on Kiyoomi’s part, falling to the ground as Atsumu’s cock bobs free.</p>\n<p>“Oh, look at you,” Kiyoomi murmurs, wrapping his hand around the base. </p>\n<p>He hooks his chin over Atsumu’s shoulder and smirks at him in the mirror before giving him one luxurious stroke. It’s agonizingly slow, and it’s most certainly too dry, but Atsumu moans like it’s the best thing he’s ever felt as his eyes flutter shut.</p>\n<p>Then Kiyoomi takes his hand away and makes quick work of finishing the shibari, looping the two loose ends of rope dangling from just above Atsumu’s pelvis down between his legs, wrapping one piece around each thick thigh and securing them back to the tie in front. He sucks in a breath at the sight of the rope hugging Atsumu’s body, swallowing around a suddenly dry throat as he takes that needy cock back in hand.</p>\n<p>\n<em> “Fuck—” </em>\n</p>\n<p>“Keep your eyes on me,” Kiyoomi tells him. When his eyes meet Atsumu’s in the mirror once more, he circles a covered finger around the very tip of Atsumu’s cock and adds, “Not my face. I want you watching right here.”</p>\n<p>“O-oh,” Atsumu stutters, eyes dropping down between his legs. </p>\n<p>His thighs twitch like they want to turn inward and Atsumu leans some of his weight back against Kiyoomi’s chest, squirming as he pets over the slit until his fingers come away wet. Kiyoomi’s gut clenches and he slides his other hand over to Atsumu’s hip to pull his body firmly against him, welcoming the friction against his own dick. Atsumu moans and his legs tremble again when Kiyoomi slicks him up with his own precome and starts to stroke him steadily, slow as honey but much less sweet.</p>\n<p>Then, because his pecs look fucking fantastic outlined in stark black rope like this, Kiyoomi draws his other hand up the length of Atsumu’s torso and cups one of them, kneading lightly before pinching his nipple in between two fingers.</p>\n<p><em> “Mngh, </em> shit,” Atsumu breathes, eyelids fluttering. Kiyoomi speeds up his strokes. “I— <em> Omi—” </em></p>\n<p>Oh, <em> this </em> is what Kiyoomi daydreamed about over the past month, when he wasn’t telling himself he was okay being patient — that he could do without this <em> . </em>Messing Atsumu up is already a headrush, and he’s barely even started. </p>\n<p>He sucks in a breath through his nose and rolls Atsumu’s nipple between his fingertips, watching carefully in the mirror as Atsumu’s face twists in pleasure. Kiyoomi presses even closer, muffling a groan in Atsumu’s shoulder as he rubs his clothed cock against the supple curve of Atsumu’s ass.</p>\n<p>Kiyoomi switches his attention to the other nipple and Atsumu shudders, finally letting his head tip back as his eyes flutter closed. The long line of Atsumu’s exposed throat interrupted by the thick black leather collar is such a nice visual that Kiyoomi doesn’t even bother scolding him for looking away. He just speeds up the hand he’s got working Atsumu’s cock and <em> tsks </em> gently, watching greedily as Atsumu’s hips twitch.</p>\n<p>Jerking Atsumu off in front of the mirror like this wasn’t part of Kiyoomi’s plan for the scene, but he can’t seem to stop; Atsumu keeps gradually collapsing back against him and Kiyoomi is addicted, wanting to make his knees weaker and weaker. When he switches to the other nipple and twists his wrist on the next upstroke, a whine tears from Atsumu’s chest, ragged and needy.</p>\n<p>“Omi…”</p>\n<p>“Mm,” Kiyoomi hums. His pants are too tight around the aching length of his own dick and he ruts forward again, desperate for friction. </p>\n<p>Atsumu gasps, knees nearly buckling as Kiyoomi’s hand slips over him. “Omi—c’n I?”</p>\n<p>Kiyoomi hides a smile against his shoulder, barely suppressing a shiver at how easily Atsumu submits, how quickly he reaches the edge when they play like this. He doesn’t answer him, which is as good as a ‘no.’ He just keeps his hand moving and waits for Atsumu to get desperate.</p>\n<p>It doesn’t take long at all.</p>\n<p>“C’n I, can I come — <em> ah, </em>Omi, I’m — please, I’m gonna come, m’gonna—”</p>\n<p>“Not yet,” Kiyoomi says, and lets go.</p>\n<p>He moves his hand away from Atsumu’s nipple too, not wanting to risk pushing him over the edge with any stimulation. Atsumu moans and squirms fiercely in Kiyoomi’s arms, a vision tied up in black rope, eyes closed, a blissed-out smile stealing across his face at the denial. </p>\n<p>“Oh, you love this, don’t you?” Kiyoomi asks, petting over his stomach and then hooking his fingers under the lowest rungs of rope to tug slightly upward, pulling at the lines between Atsumu’s legs.</p>\n<p>It makes Atsumu gasp and rise up onto his toes momentarily, so easy, like a puppet. </p>\n<p>He bites his lip and nods in response to Kiyoomi’s question, breathing hard.</p>\n<p>“You’re shameless about it too,” Kiyoomi says, releasing the tension to let Atsumu drop back onto his heels. He steps back and turns to grab the vibrating plug off the foot of the bed. “Come get on my lap and I’ll give you more.”</p>\n<p>He situates himself against the headboard with his legs together as Atsumu carefully gets on the bed and knees toward him, stiff cock bobbing lewdly between his thighs. Kiyoomi hums as Atsumu straddles his legs and shimmies his way up Kiyoomi’s body, settling on his lap with a soft huff.</p>\n<p>“Good boy,” Kiyoomi praises, then loops a finger through the collar’s o-ring and pulls Atsumu’s mouth down to his.</p>\n<p>He tilts his head and lets Atsumu suck on his tongue indulgently, tugging a little harder on the collar just to hear him whimper. He can’t resist tracing the line of rope under Atsumu’s asscheek before squeezing it roughly, digging his fingers into the plush muscle before smacking it once, hard.</p>\n<p>“Fuck,” Atsumu gasps, rolling his hips.</p>\n<p>He’s probably getting Kiyoomi’s shirt dirty. Kiyoomi wonders what exactly Atsumu has done to him over the past months that the concept is… exciting.</p>\n<p>Kiyoomi leans away from Atsumu’s mouth and reaches over for the lube, pumping it twice and spreading it around on his fingers. “Sit up straight.”</p>\n<p>“Hmm?” </p>\n<p>Kiyoomi pats Atsumu’s ass with his clean hand. “Up.”</p>\n<p>Atsumu looks confused but does as he’s told, straightening up on his knees and looking down at Kiyoomi expectantly. It puts Kiyoomi at eye level with his chest, a fact that doesn’t escape either of them if the deepening blush on Atsumu’s face is any indication. “Omi…” </p>\n<p>Kiyoomi’s mouth quirks moments before he leans forward and takes one of Atsumu’s nipples between his lips.</p>\n<p>“<em> Ahhn </em>—oh god—oh my god—” </p>\n<p>Atsumu is <em> whining, </em>the sound vibrating against Kiyoomi’s lips as he closes his teeth around Atsumu’s nipple and sucks — gently at first, then harder when Atsumu arches his back and pushes his chest against Kiyoomi’s face, arms barely moving as he struggles. Without pulling off, Kiyoomi spanks him before pulling Atsumu’s cheeks apart and trailing his slick fingers down to his hole. He finds the little ring of muscle and pushes lightly until it gives under his touch.</p>\n<p>Like the shibari, the prep was supposed to be perfunctory — after all, they haven’t even gotten close to the main event yet — but Kiyoomi finds himself unable to stop at the single finger it takes to get Atsumu slicked up for the plug. He squeezes in another, and another, until Atsumu’s gasping and shaking above him as Kiyoomi curls his fingers and bites at the sensitive skin around his nipple.</p>\n<p>“Omi — <em> ah, </em>oh god… fuck me,” Atsumu groans. </p>\n<p>Kiyoomi smirks and draws off the nipple he’s been abusing, grazing it with his teeth on the way back, and promptly bites the other one without even giving Atsumu a chance to catch his breath. Atsumu’s back arches, stretching the harness over his chest, and a strangled whine tears from his lips as he starts to ride Kiyoomi’s fingers, sloppy wet sounds making his movements even dirtier. </p>\n<p>He must really want to get fucked, and Kiyoomi sympathizes with that sentiment. His own cock is <em> aching; </em> part of him wonders if all that vanilla sex has broken him for this, but deep down he still understands the value of delayed gratification <em> . </em> When he draws off of Atsumu’s nipple with a <em> pop </em>and pushes his fingers deeper, Atsumu’s head tilts back and he moans long and low. He sounds—</p>\n<p><em> “F… fuck,” </em>Atsumu breathes.</p>\n<p>Kiyoomi curls his fingers and Atsumu whines, cock twitching and smearing more precome onto Kiyoomi’s shirt. He prides himself on an abundance of patience during times like this, but after only a few more moments he pulls his fingers out and picks up the plug, eager to move to the next part of the scene. </p>\n<p>Seconds later, Atsumu’s swearing and ducking to hide his face as Kiyoomi pushes the plug inside. Kiyoomi can’t help but toy with it for a few moments after it’s settled in place, wiggling the base and savoring the rush that follows as Atsumu squirms and grunts.</p>\n<p>“Does that feel good?” Kiyoomi purrs, reaching up with his clean hand to scratch at Atsumu’s scalp. He feels Atsumu nod against his shoulder. “Use your words, Atsumu.”</p>\n<p>“Y-yeah…”</p>\n<p>Kiyoomi grins and turns to kiss his temple. </p>\n<p>“Good boy.”</p>\n<p>With his arms bound tightly to his sides, Atsumu doesn’t have any way to resist as Kiyoomi manhandles him onto his back, horizontally across the bed. <em> Not that he wants to resist, </em> Kiyoomi muses as he gets off the bed, picking up the spreader bar and thigh cuffs. <em> He probably wishes I was moving even faster. </em></p>\n<p>“You know, when we first started meeting up, I was expecting you to be more of a brat during our scenes,” Kiyoomi says. As if on cue, Atsumu lifts his legs up to be cuffed without being told. “Never would’ve imagined you’d be this eager. I thought I’d have to discipline you… train you, punish you—”</p>\n<p>\n<em> “Shit—” </em>\n</p>\n<p>“—but you give it up every time,” Kiyoomi murmurs, tightening the second thigh cuff until it’s just shy of snug. “It’s almost too easy.”</p>\n<p>Atsumu squirms on the bed, thighs spread, all four limbs now immobilized in some way. </p>\n<p>“S-sorry,” he rasps.</p>\n<p>Kiyoomi snorts and slaps the underside of an exposed asscheek. Normally, getting an apology out of Atsumu is like pulling teeth, but like this... </p>\n<p>“I said <em> almost. </em>Now hold still, I have one more toy for you.”</p>\n<p>Atsumu’s eyes go wide when Kiyoomi picks up the nipple clamps. The chain that normally connects them has been removed; in its place are two pieces of twine, one attached to each clamp. Atsumu’s hands twitch in their ties like he wants to cover himself.</p>\n<p>“Aren’t you glad you’re all tied up?” Kiyoomi purrs, reaching out to roll one of Atsumu’s darkened nipples between the fingers of his left hand. “I know it’s hard to stay still through this otherwise.”</p>\n<p><em> “Jesus, </em>Omi...” </p>\n<p>Kiyoomi smirks. Once Atsumu’s nipple is nice and perky, he goes in with the first clamp. He pinches it open, hovering over Atsumu’s chest for a few seconds just to let the anticipation build, then lets it close.</p>\n<p>The effect is instant. Atsumu gasps and arches his back, a strangled groan tearing out of him a moment later. Kiyoomi glances up to see his face contorted in agony, teeth sunk into his lower lip. He looks <em> gorgeous </em>like this.</p>\n<p>“There you go,” Kiyoomi murmurs. “Breathe through it. Just like that, Atsumu.”</p>\n<p>Atsumu sucks in air with quick, shallow gasps, broken sounds forced out with every exhale as he tries not to jostle the clamp on his chest. </p>\n<p>Kiyoomi feels himself <em> throb </em>where he’s still confined in his slacks, suddenly seized with the same impatience that’s been plaguing Atsumu for the entire scene. </p>\n<p>“Now the other one,” he says, moving so he can reach Atsumu’s right side more easily. “I bet you missed this, huh?”</p>\n<p>Atsumu makes a low noise, almost a growl. His jaw is still visibly clenched, but he makes an obvious effort to relax it so he can speak. “I—<em> nnnngh— </em>haah, no way…”</p>\n<p>Kiyoomi snorts. “You’re a terrible liar, Atsumu. Has anyone ever told you?”</p>\n<p>“Yeah, your m—”</p>\n<p>He’s cut off as Kiyoomi flicks a finger across his nipple, then rubs his thumb over the stiffening bud before pinching it firmly. Atsumu moans, cock leaking precome onto his stomach, and lets his cuffed legs fall now that Kiyoomi is no longer in between them, feet planting on the bed and toes curling into the sheets. Kiyoomi will allow it for now; this is probably the last opportunity he’ll get to relax for quite some time.</p>\n<p>Still rolling Atsumu’s nipple in between his fingers, Kiyoomi bends down to kiss him fast and messy and deep. Atsumu’s mouth is slack, little hurt noises still vibrating in his throat, and he barely gets the chance to reciprocate before Kiyoomi’s straightening back up, chuckling at the dazed look on Atsumu’s face.</p>\n<p>“Omiii…”</p>\n<p>“I know.” </p>\n<p>Kiyoomi’s pants are so tight they’re bordering on painful. He smiles indulgently at Atsumu and pinches his nipple with two fingers, pulling on it so he can open the clamp around the base.</p>\n<p>He lets it close.</p>\n<p>\n<em> “Fuck!” </em>\n</p>\n<p>Atsumu’s body jerks like he’s been shot, curling forward as he swears over and over until he’s out of breath, slowly getting used to the pain in his nipples whether he wants to or not. His hands twist and his fingers curl, but the rope harness holds him helpless — beautiful. </p>\n<p>Kiyoomi bites his lip and reaches down to wrap his hand around Atsumu’s cock. His fingers are still slick from fingering Atsumu open, and Kiyoomi strokes him fast and merciless until Atsumu’s eyes cross and his head falls back, body collapsing into the bed as if he’s surrendering. </p>\n<p>It’s <em> obscene, </em>and it makes Kiyoomi feel hot all over. He strips off his gloves and reaches down with shaking fingers to unbutton his slacks.</p>\n<p>There’s just one more thing he needs to do before he can really let go and indulge himself.</p>\n<p>“Lift your legs back up for me, Atsumu.”</p>\n<p>Atsumu blinks in confusion but does as he’s told, shivering as he pulls his legs up and watches Kiyoomi apprehensively. Kiyoomi picks up the piece of twine connected to one of the nipple clamps and draws it toward the spreader bar, nudging Atsumu’s thigh gently so his legs — and the bar — move closer to his chest, pushing him into a deeper stretch. </p>\n<p>Things seem to click for Atsumu when Kiyoomi loops the twine around the spreader bar and pulls it until the clamp is standing up off of Atsumu’s chest, <em> just </em>shy of completely taut. </p>\n<p>“No, <em> nonono—” </em></p>\n<p>The combination of fear and excitement shining in his eyes takes Kiyoomi’s breath away. “Color, Atsumu?”</p>\n<p><em> “Green,” </em>Atsumu moans, biting his lip as he watches Kiyoomi secure the twine in that exact position, so that any relaxation of Atsumu’s legs will cause the clamp to tug harshly on his nipple. “Oh my god… Omi, oh god…”</p>\n<p>“There you go,” Kiyoomi says as he ties the other clamp exactly like its twin, millimeters away from igniting agony. Atsumu’s staring down at his chest with wonder in his eyes, breath coming in shallow pants as his cock twitches. “Good boy.”</p>\n<p>He gets off the bed entirely, Atsumu’s moan at the praise music to his ears. Leaving him to squirm on the bed, Kiyoomi pulls his pants and boxers off and tosses them in the general direction of his closet before retrieving a flavored condom from the bedside table, situating himself so that he’s standing near Atsumu’s head. He watches Atsumu’s nostrils flare at the strong scent of artificial peach, eyes widening in recognition seconds later.</p>\n<p>“Yeah?” Kiyoomi asks teasingly when Atsumu’s throat works but no words come out. </p>\n<p>He rolls the condom down his shaft, achingly hard and jolting with every press of his fingers, and reaches down to grip Atsumu’s rope harness and tug him a little closer to the edge of the bed, so his head is just barely hanging off. </p>\n<p>“I’m going to fuck your throat like this, Atsumu,” he says, exhilaration racing through him at his own words. Atsumu shudders. Kiyoomi reaches into his pocket and pulls out a familiar clicker, pressing the small object into one of Atsumu’s hands, bound to his side. “Use this if you need a break or want me to stop. Understand?”</p>\n<p>Atsumu nods, cutting off with a yelp halfway through as his legs relax a fraction and end up tugging on the clamps. He quickly pulls them back up, abs flexing to help hold the position.</p>\n<p>“Oh, look at you...”</p>\n<p>Kiyoomi steps closer and taps the head of his cock against Atsumu’s plush lips, gut twisting when Atsumu’s mouth falls open in anticipation. Seeing Atsumu trussed up like this, obediently waiting to take whatever Kiyoomi decides to give to him, is an invitation Kiyoomi can’t refuse.</p>\n<p>He grips Atsumu’s jaw with his other hand and tilts his head further back, watching his throat bob underneath the collar, before finally pushing inside. Atsumu’s mouth is <em> hot, </em>parting further with the press of Kiyoomi’s cock, and Kiyoomi hisses as he guides himself deeper before letting go of his dick and gripping Atsumu’s jaw with both hands. He thrusts his hips ever-so-gently, a test, and shudders at the muffled moan Atsumu lets out. </p>\n<p>Kiyoomi is bolder on the second thrust, bolder still on the next, and he widens his stance to give himself more leverage as his eyes rake over Atsumu’s body: compact muscle, slim and powerful, all that strength brought to heel with a few pieces of rope and some well-placed toys as he squirms and trembles on the bed. Kiyoomi’s cock throbs at the sight. He grunts and starts to fuck deeper, feeling himself prod at the back of Atsumu’s throat.</p>\n<p>“Fuck… yeah, just like that… relax for me…”</p>\n<p>Atsumu whines; Kiyoomi feels him start to do as he’s told, feels his throat start to open up around the tip of his cock, but then he jolts and tenses up, gagging a little as a tortured sound vibrates around Kiyoomi’s cock. Kiyoomi pulls out to give him a break, heat twisting inside him when he realizes that Atsumu had relaxed all over, including the muscles that were keeping the clamps from tugging on his abused nipples. Atsumu’s legs are just barely shaking as he draws them closer to his chest once more, the strain clearly evident from holding the position while so many other sensations bombard him.</p>\n<p>And Kiyoomi hasn’t even pulled out his last trick.</p>\n<p>“You poor thing,” Kiyoomi murmurs, stroking over his cheek as Atsumu swallows, panting. </p>\n<p>“Fuck,” Atsumu slurs, cock drooling precome on his abs. <em> “Omi… </em>”</p>\n<p>He moans quietly when Kiyoomi pushes back inside, his body melting into the bed, going completely still save for the shaking of his legs. This time, when Kiyoomi prods at the back of his throat, he feels Atsumu relax around him, opening up to take him deeper. It’s so good it makes Kiyoomi’s gut ache, a little over half his cock buried inside as filthy, wet noises spill from Atsumu’s mouth with every thrust.</p>\n<p>Kiyoomi lets himself get lost in it for a minute or two, half-lidded eyes keeping a hazy focus on the delicious sight in front of him as his hips move on instinct. He fucks Atsumu’s mouth until his breathing is heavy, dipping into his throat to luxuriate in that tight heat around the head of his cock.</p>\n<p>Then Kiyoomi reaches into the breast pocket of his shirt and pulls out a little remote. He fights down what would surely be a sadistic grin and presses the larger of the two buttons.</p>\n<p>Atsumu tenses up all over, his entire body rocking as his hips jump reflexively. <em> “Mmmm-i!” </em></p>\n<p>It’s probably the closest to Kiyoomi’s name he can get with cock down his throat. Kiyoomi chuckles in delight and clicks the vibrating plug one setting higher.</p>\n<p>“Did you forget that this plug vibrates, Atsumu?” he teases, watching Atsumu’s cock twitch as his legs start to shake more violently. “Mmm, it must feel so good inside.”</p>\n<p>He doesn’t give Atsumu a chance to respond, dropping the remote on the bed and resuming his thrusts. Atsumu chokes around him but Kiyoomi doesn’t stop this time, keeping a careful eye on the clicker in Atsumu’s hand as he starts to fuck deeper and deeper inside. Atsumu makes no move to press it.</p>\n<p>Kiyoomi groans, head spinning at the hot slide surrounding him whenever he moves, at all the things he could do to Atsumu while he’s like this. He wants to make up for lost time. He wants to break Atsumu down until all he knows is Kiyoomi’s name.</p>\n<p><em> “Fuck, </em> I—” He cuts himself off, nearly biting his tongue as he works his cock in and out of Atsumu’s mouth. He wants, he <em> wants. </em> “I… missed this, too, <em> Atsumu </em>.”</p>\n<p>Maybe it’s cruel, to finally say that when Atsumu can’t respond properly, but Kiyoomi would be too embarrassed to admit it out loud otherwise. Atsumu whines, shuddering when the clamps tug on his nipples and he has to reposition himself. He’s started to rock down against the bed, subtly grinding his ass against the mattress and pushing the plug deeper in a slow rhythm. His motions are clumsy, probably because keeping his legs raised is robbing him of most of his leverage. </p>\n<p>A wet noise brings Kiyoomi out of his thoughts, and he realizes that in his haze he’s been pushing almost all the way inside. He groans and slides one shaking hand down to Atsumu’s throat, feeling the thick shape of his own cock pressing in and out. <em> Shit.  </em></p>\n<p>“Can you take all of me like this?” Kiyoomi asks, stroking over Atsumu’s throat and watching his legs tremble. </p>\n<p>Atsumu moans, back arching for a split-second before he wails and tries to curl forward to get relief from the tugging clamps. Kiyoomi should undo them soon to give his nipples a chance for some blood flow, but first—</p>\n<p>“Oh, good <em> boy,” </em>Kiyoomi groans, nearly growling as he buries himself completely inside. He never wants to leave. “You feel so good, Atsumu…”</p>\n<p>Atsumu’s movements against the bed have become much less subtle, his hips rocking needily as his throat spasms around the full length of Kiyoomi’s cock. </p>\n<p>\n<em> What a needy wh—  </em>\n</p>\n<p>The thought pops up in Kiyoomi’s head suddenly, unexpectedly, before he can quash it. He sucks in a breath and tries to ignore it, pulling out a few inches before pushing back in completely. </p>\n<p>Kiyoomi’s always had a pretty clear line between dirty talk and what he actually thinks of his subs, so he’s not sure why that thought would cross his mind. He’s seen that little tick box on Atsumu’s checklist — <em> verbal humiliation — </em>but even in the bedroom, Kiyoomi rarely says anything he doesn’t mean.</p>\n<p>And Atsumu isn’t a whore, even if he acts like one for fun; Kiyoomi <em> showed </em> him how to do it in the first place. In fact, when Atsumu acts slutty in bed, it’s <em> for </em>Kiyoomi…</p>\n<p><em> Oh </em> . He’s <em> Kiyoomi’s </em> whore, <em> his </em>little fucktoy.</p>\n<p>Suddenly it clicks, the origin of that impulse. It makes his mouth dry, makes him hungry. </p>\n<p>\n<em> Shit. </em>\n</p>\n<p>Atsumu’s abs are starting to jump along with his thighs, the twine attached to the clamps millimeters away from taut as he holds the spreader bar as close to his chest as he can. He’s going to get tired soon.</p>\n<p>Kiyoomi can’t wait.</p>\n<p>His own orgasm is closing in on him by the time that Atsumu starts mumbling something around him, cock dark red and sticky with precome, a little puddle pooling on his abs. Kiyoomi pulls all the way out for the first time in a while, hissing at the cool air that suddenly hits his dick as Atsumu gasps for breath.</p>\n<p>“What is it, Atsumu?”</p>\n<p>“I’m…” His voice is so hoarse Kiyoomi nearly blushes. “M’close, can I…”</p>\n<p>Kiyoomi hums and thumbs over Atsumu’s lower lip, swollen and red. “Can you what?”</p>\n<p><em> “Come,” </em> Atsumu grits out, eyes shut tight. He has tear tracks running from the corners of his eyes into his hair. “Fuck — <em> please, </em> Omi, I need’ta—”</p>\n<p>Kiyoomi’s dick gives a maddening twitch at the whine coloring Atsumu’s voice. He sucks in a breath and pushes his thumb between Atsumu’s lips, something savage igniting in his belly at the way Atsumu starts to mindlessly suck on it.</p>\n<p>“So desperate.” Kiyoomi reaches down and plucks at one of the strings connecting the clamps to the spreader bar, grinning when Atsumu moans and rocks down against the bed, rolling his hips as his mouth goes slack. “Fuck, you love it when it hurts, don’t you? Just a little pain and you turn into a slut.”</p>\n<p><em> Shit. </em>He didn’t mean to say that out loud this time. Seeing Atsumu like this is completely wrecking Kiyoomi’s brain-to-mouth filter. Kiyoomi feels his cheeks burn hotter than they already were. He opens his mouth to ask Atsumu’s color but is beaten to the punch.</p>\n<p>“<em>Shit</em>, Omi,” Atsumu slurs around his fingers before Kiyoomi can apologize. “God, <em> yeah </em>— m’gonna come —”</p>\n<p>Kiyoomi curses and pulls his fingers from Atsumu’s mouth, then slaps the throbbing head of his dick against Atsumu’s lips. </p>\n<p>“Open,” he says and groans at Atsumu’s utter obedience, pressing half his dick inside on the first thrust. “Yeah, like that. You can come when you’re choking on me.”</p>\n<p>A mangled groan vibrates around Kiyoomi’s cock as Atsumu’s legs shake, abs twitching and jumping. Kiyoomi fights down the heat swirling in his belly and pushes deeper, sliding down Atsumu’s throat until he’s all the way inside, tight warmth spasming around him. He reaches down to pluck at the twine attached to the clover clamps, rocking his hips in tiny little movements and watching greedily as Atsumu’s cock starts to jerk in a telltale rhythm.</p>\n<p>Seconds later, Atsumu spasms and gags around him, curling in on himself as come stripes over his abdomen.</p>\n<p>“Mmm, good boy,” Kiyoomi purrs, dangerously close to his own orgasm as he watches Atsumu writhe in pleasure.</p>\n<p>Halfway through, Atsumu seems to lose strength in his lower body, legs slipping toward the bed until the twine tugs <em> hard </em> on his poor nipples. He nearly <em> shrieks, </em>or he would have if not for the unforgiving length of Kiyoomi’s cock. Instead, choked-off cries come out as gurgles, and Kiyoomi doesn’t lift a finger to help him.</p>\n<p>He knows the pain is just making Atsumu come harder.</p>\n<p>By the time Atsumu is finished, whimpering and trembling all over, Kiyoomi is a hair’s breadth away from the edge. He pulls out to give himself a break and to give Atsumu some much needed air.</p>\n<p>“Hmmngh,” Atsumu groans, still twitching. His face is covered in drool and tears. Objectively, it’s disgusting, but Kiyoomi has to grip the base of his dick when heat pulses through him at the sight.</p>\n<p>Kiyoomi’s own breathing is loud in his ears. His fingers are twitching. He wants to take, take, <em> take. </em></p>\n<p>He reaches down and pinches both clamps open at the same time.</p>\n<p><em> “Nnnfuck,” </em> Atsumu gasps through gritted teeth, torso rising off the bed as he curls into himself from the pain. The tendons in his neck stand out as he rolls halfway onto his side, hands clenched into fists as a final drop of come beads out of his cock. “Fuck, fuck, <em> fuck…” </em></p>\n<p>Kiyoomi’s wound so tightly from watching him that it makes his movements clumsy as he crosses to the other side of the bed and reaches across to pull Atsumu toward him, nails digging into Atsumu’s hips. The spreader bar is still firmly in place around Atsumu’s thighs, but from the <em> look </em> Atsumu gives him as Kiyoomi reaches for the lube, Kiyoomi’s certain Atsumu would be spreading his legs even wider if he could.</p>\n<p>His nipples are a deep, angry red, standing out proudly from his chest. Kiyoomi eyes them shamelessly as he spreads lube down the length of his cock, still covered with the condom but devoid of any of the peach-flavored lube it originally came coated in. Then he grips the toy still buzzing away between Atsumu’s legs, clicking a button on the base of the plug to turn it off before slowly pulling it out.</p>\n<p>Atsumu moans when he does it, back arching. <em> “Omi…” </em></p>\n<p>“Color?” Kiyoomi asks, voice embarrassingly rough as he watches Atsumu’s slick hole clench down around nothing. Atsumu moans again, louder this time, and Kiyoomi tugs his hips to the very edge of the bed before repeating himself.</p>\n<p>“Green,” Atsumu slurs, lifting his head up to grin shamelessly at Kiyoomi. His eyes slide down to Kiyoomi’s cock and he bites his lip, eyes hooding before his head drops back to the bed. “Fuckin’... green, <em> shit.” </em></p>\n<p>The dopey smile on his face makes something flutter in Kiyoomi’s chest. “Good.”</p>\n<p>He pats Atsumu’s flank, prompting him to lift his legs back toward his chest, and pushes the spreader bar forward when he finds that Atsumu is moving too slow for his liking, nearly bending Atsumu in half in his impatience. Kiyoomi’s eyes lock with Atsumu’s as he starts to push inside, watching as Atsumu’s brows furrow and his mouth drops open, watching him do his best to hold Kiyoomi’s gaze as Kiyoomi splits him open.</p>\n<p>“So good, Atsumu,” Kiyoomi murmurs, feeling like they’re both under a spell. “Such a perfect little slut for me...”</p>\n<p>Atsumu’s eyes slip closed and he turns his head to the side, a blush staining his cheeks. “Oh my god...”</p>\n<p>They both release strained sighs when Kiyoomi bottoms out, cock wrapped in crushingly tight heat. Kiyoomi stays there for a moment, holding still to let Atsumu get used to the stretch. “Hm? You don’t agree? You don’t like it? Being mine like that?”</p>\n<p>“N-no, I - I do…” Atsumu stammers, chest heaving.</p>\n<p>It just pushes Kiyoomi further into that feral headspace that only Atsumu has ever brought out in him. He leans close. </p>\n<p>“Then say it.”</p>\n<p>Atsumu tucks his head even further into his own shoulder instead of answering, cheek nearly glowing from how hard he’s blushing. <em> Cute. </em> But Kiyoomi wants to hear him say it, feels like he needs it. </p>\n<p>“Atsumu.” </p>\n<p>Still seated inside completely, Kiyoomi feels Atsumu flutter around him, but Atsumu’s only response to his name is a weak moan as he squirms on the sheets. Kiyoomi’s nostrils flare and his eyes dart to Atsumu’s nipples, the rush of control starting to seize him; Atsumu’s nipples are still perky enough that Kiyoomi wouldn’t need to hold them still or pinch them to get the clover clamps fitted back around them. Subtly, he slides his fingers down the loose twine until he’s got both clamps in hand.</p>\n<p>He keeps one hand on the spreader bar and reaches down to put the left one back on first, taking Atsumu completely by surprise.</p>\n<p><em> “Ahh—” </em> Before Atsumu can fully react, Kiyoomi reattaches the other one and lets go of the spreader bar. <em> “Nnnghh!” </em></p>\n<p>The way Atsumu’s body is spasming around him makes Kiyoomi wish he put on a cock ring beforehand. He clenches his teeth and reaches down to grip Atsumu’s jaw with one shaking hand, turning Atsumu’s head toward him. Something shorts out in his brain when he sees the renewed moisture on Atsumu’s cheeks, fat tears beading on his lashes as he trains his watery gaze on Kiyoomi once more.</p>\n<p>“I can’t again… can’t...” Atsumu’s voice is hoarse. He must be talking about holding himself up so the clamps don’t torture him; his legs are already trembling. “Omi…”</p>\n<p>“You can and you will,” Kiyoomi says, letting go of his jaw. “Now say it for me.”</p>\n<p>Atsumu’s lip wobbles. Then Kiyoomi smacks the underside of his exposed ass cheek and Atsumu <em> screams </em> as his legs twitch downward reflexively<em>, </em> eyes squeezing shut for a moment before he obediently opens them once more <em> . </em></p>\n<p><em> “Say it, </em>Atsumu.”</p>\n<p>“M’a slut,” Atsumu slurs.</p>\n<p>A dark thrill of satisfaction races through Kiyoomi’s entire body at the words. He might need to update his own checklist, he muses. He pulls back a few inches and then thrusts forward, pushing a sharp cry from Atsumu’s chest. </p>\n<p>“Whose?”</p>\n<p>Atsumu gasps, jaw hanging slack as Kiyoomi starts to fuck him in earnest. </p>\n<p><em> “Oh — </em> ohhh god — <em> yours—” </em> he says, eyes finally falling shut, helpless against the onslaught. </p>\n<p>Kiyoomi smirks, rolling his hips harder, “What was that?”</p>\n<p>“M’your slut — <em> Omi…” </em></p>\n<p>Kiyoomi slides his hands down Atsumu’s trapped arms, trailing over those skilled hands before slipping under his body. His palms skate over the lines of rope under each of Atsumu’s ass cheeks, and then takes hold of the supple flesh, lifting him up slightly to get a better angle. It makes Atsumu gasp and whine with every thrust inside. </p>\n<p>“Good boy,” Kiyoomi murmurs reverently.</p>\n<p>The new angle jostles Atsumu’s legs back and forth as Kiyoomi moves, making the clamps wiggle in small movements that keep the tears flowing down Atsumu’s cheeks. Kiyoomi bites his lip and groans, gut twisting at the hot slide around his cock, the way Atsumu’s body is gripping him. </p>\n<p>He falls into a rhythm, steady and hard, punctuated by the obscene sounds of their skin slapping together as Kiyoomi forces even <em> more </em> obscene sounds from Atsumu’s throat. </p>\n<p>Eventually Kiyoomi has to close his eyes, afraid if he looks at Atsumu for much longer he’ll come before he gets Atsumu there again. If he thinks about the scene too much—if he thinks about <em> Atsumu </em>too much, he’ll—</p>\n<p>“<em> Omi…! </em>” Atsumu groans, breaking his trance after another few minutes have passed. </p>\n<p>Kiyoomi opens his eyes and bites his lip, slowing his pace and rolling his hips deeper as he hefts Atsumu’s hips even higher off the bed. “Yeah?”</p>\n<p>Atsumu whimpers when the clamps shift again. “I—I gotta—”</p>\n<p><em> Thank god. </em>Kiyoomi wasn’t sure how much longer he was going to last. He’s not going to tell Atsumu that, though—not when he’s deep like this, craving humiliation.</p>\n<p>“Again? Already?”</p>\n<p>Fresh tears roll down Atsumu’s burning cheeks and he manages a nod, embarrassed flush spreading down to his chest as his body is rocked by Kiyoomi’s thrusts.</p>\n<p>Kiyoomi grins. “I’m going to take the clamps off when you come. It’s going to hurt. Are you <em> sure </em> you want to?”</p>\n<p>“Oh fuck,” Atsumu chokes, cock twitching as his lashes flutter. “I can’t — I’m gonna — <em> uuhhhn, </em> fuck —”</p>\n<p>“You know how bad it’s going to be and even that isn’t slowing you down, is it?” Kiyoomi murmurs, new thoughts flying from his lips. “Such a desperate little whore. Don’t worry, I’ll give you what you want… you should thank me when I let you come, hm?”</p>\n<p>Still holding Atsumu’s ass off the bed, Kiyoomi lets go of Atsumu’s hip with his other hand and reaches up to flick at a clamped nipple, then trails his hand back down over Atsumu’s trembling, slick abdominals to take hold of his cock. It’s heavy in his hand, hot and needy even after his previous orgasm. </p>\n<p>God, Kiyoomi wants to see him come all over himself. It just might push <em> him </em> over the edge, too. He lifts Atsumu higher, shoulder aching with the movement, and starts to jerk him off with his other hand.</p>\n<p>“Omi, I’m — ah, ah, <em> ah —” </em></p>\n<p>“Not yet.”</p>\n<p>\n<em> “Please!” </em>\n</p>\n<p>Kiyoomi smirks. He has Atsumu right where he wants him. He almost feels <em> high </em>from the absolute control. He waits until Atsumu is sobbing, shaking from how badly he’s trying to hold back, before finally relenting.</p>\n<p>“If you’re sure…,” Kiyoomi whispers, somewhere between teasing and desperate in his own right. “Okay, Atsumu, <em> come for me </em>.”</p>\n<p>Atsumu’s mouth drops open but no sound comes out, breath caught in his chest. Then, because Kiyoomi’s been selfishly drinking in every expression on his face since he pushed inside him, he gets to watch Atsumu’s eyes roll back, eyebrows knitting together a moment later. His body begins to clutch at Kiyoomi’s dick in steady pulses, squeezing down so tight it almost hurts, pushing some sort of embarrassing noise out of Kiyoomi’s mouth.</p>\n<p>Then he starts to spill over Kiyoomi’s fingers in streaks of white, lips moving soundlessly around <em> thank you, thank you, th— </em></p>\n<p>Kiyoomi grits his teeth, a hair’s breadth away from orgasm himself, and lets go of Atsumu’s cock so he can reach up and take off the clamps.</p>\n<p>The result is breathtaking. </p>\n<p><em> Atsumu </em> is breathtaking, his whole body tensing up so hard that his torso comes clean off the bed, abs rippling as he covers them in come, pleasure and pain evident in every line of his body. Kiyoomi can only last a few more seconds watching him, <em> feeling </em>him before his eyes slip closed and he lets himself give in to his release, spilling into the condom with Atsumu’s hoarse sobs echoing in his head.</p>\n<p>\n<em> “Omi…” </em>\n</p>\n<p>Kiyoomi groans, legs shaking, pushing in and grinding deep as he rides out the rest of his high. He can feel Atsumu shivering, hear his ragged breathing, the little moans that are slipping out with every breath. The places their bodies are touching are sticky with sweat, spots rubbed pink by silk rope. Through the haze, one word sticks in the back of Kiyoomi’s mind:</p>\n<p>\n<em> More.  </em>\n</p>\n<p>He opens his eyes, blinking away sweat as he lowers Atsumu back to the bed. Atsumu is panting, unseeing gaze fixed on the ceiling, tanned chest decorated in splatters of come all the way up to his collarbone, white splashes over black rope. Kiyoomi slides his hand down to pet over Atsumu’s spent cock, hissing when it makes him squirm. </p>\n<p>“Good <em> boy</em>,” Kiyoomi murmurs, running his fingers through the mess on Atsumu’s chest, in that rare space between aroused and relaxed where it doesn’t gross him out like it normally would. Atsumu moans softly. <em> “Atsumu… </em> look at you…”</p>\n<p>Kiyoomi takes his fingers — slick, dripping with come — and drags them up to Atsumu’s mouth like he’s in a trance, rubbing around his swollen lips. A pang shoots through his stomach when Atsumu starts to lick around his fingers, sloppy and weak like the half-hearted movements are all he can muster. He doesn’t let it go on for too long, though, because Atsumu’s legs have relaxed in the absence of the nipple clamps and the spreader bar is now digging in uncomfortably where it’s resting against Kiyoomi’s torso.</p>\n<p>“I’m going to take these off now,” Kiyoomi tells him.</p>\n<p>He doesn’t expect a response, and he doesn’t get one—Atsumu is well and truly under.</p>\n<p>Kiyoomi pulls his fingers out of Atsumu’s mouth and sets about undoing the cuffs holding the spreader bar in place. Atsumu’s legs fall limp around Kiyoomi’s sides once they’ve been released, his body shuddering around Kiyoomi’s softening dick. Once he’s set the spreader bar to the side, Kiyoomi presses a gentle hand against Atsumu’s pelvis and pulls out carefully, another pang of want gripping him when Atsumu all but <em> whimpers </em>at the loss. </p>\n<p>He can’t help but notice that Atsumu is still more than half hard.</p>\n<p>He also can’t help but leave Atsumu in shibari as he ties off and disposes of the condom, then slips his ruined button-down off his shoulders.</p>\n<p>“Atsumu,” Kiyoomi whispers, crawling onto the bed. He tugs Atsumu into his lap until he’s settled upright, back against Kiyoomi’s chest, and then scoots back until he’s resting against the headboard. </p>\n<p>Atsumu is a <em> mess, </em> and all Kiyoomi can think about is how much he wants to make him come one last time <em> . </em></p>\n<p>He kisses the side of Atsumu’s head and skirts a hand down his chest, stopping briefly to tweak each sore, swollen nipple until Atsumu is squirming and grunting lowly, pressing his chest closer to Kiyoomi’s wicked fingers as he spreads his legs wider like it’s fucking instinct.</p>\n<p>“So good for me,” Kiyoomi praises him, tugging on one of Atsumu’s nipples as he reaches down with his other hand to swirl a fingertip around the leaking tip of Atsumu’s cock. The result is a throaty groan, Atsumu’s toes curling in the sheets as his hips stutter up to chase more of Kiyoomi’s touch. “Oh, you’re <em> sensitive </em>.”</p>\n<p><em> “Omi,” </em>Atsumu moans, head lolling back against Kiyoomi’s shoulder. “Uuhhh…”</p>\n<p>“It’s okay,” Kiyoomi soothes him. “How are you feeling?”</p>\n<p>Atsumu whines and turns his head to tuck his face into the side of Kiyoomi’s neck. Kiyoomi traces careful, slow circles around his cockhead and luxuriates in the heat of Atsumu’s naked body against his own. </p>\n<p>“Do you want to come again?” Kiyoomi asks.</p>\n<p>Atsumu shakes his head no. Kiyoomi slows the movement of his finger, drawing it away from Atsumu’s cock and doing his best to ignore the thick string of precome that sticks to it.</p>\n<p>“Do you want to stop?”</p>\n<p>Another shake.</p>\n<p>Kiyoomi squints, trying to make sense of Atsumu’s responses. He kisses the side of his head again and Atsumu wriggles closer, arching his back, cock bobbing lewdly in front of him. There’s one conclusion floating around in Kiyoomi’s head, but it’s almost too obscene to consider.</p>\n<p>“Do you… want me to keep going?”</p>\n<p>Atsumu nods and rocks his hips up, another whine bubbling from his throat. <em> But you don’t want to come, </em>Kiyoomi thinks. </p>\n<p>Fuck.</p>\n<p>\n<em> Fuck.  </em>\n</p>\n<p>“Do you want me to tell you when you can come?” Kiyoomi asks carefully.</p>\n<p>Atsumu sucks in a breath and nods.</p>\n<p>“Oh, <em> Atsumu.” </em></p>\n<p>Kiyoomi finally lets himself take Atsumu in hand, reverent, almost dumbfounded by the headspace Atsumu’s reached. He wraps his hand around that slick, needy cock and strokes him slowly, savoring the little squelching noises as Atsumu squirms against him.</p>\n<p>He keeps his pace slow, matching the lazy way he’s rolling Atsumu’s sore nipples and tracing the geometric patterns of exposed skin between rope with the fingertips of his other hand. He plays with his body, self-indulgent, as Atsumu gasps against his neck in little wet puffs of breath. Atsumu’s hands are limp at his sides; he’s not fighting the shibari at all, no tension in his muscles. Beads of sweat are sliding down his abdomen. His toes curl in the sheets every time Kiyoomi twists his wrist just right, toying with his cockhead as he leaks all over Kiyoomi’s fingers.</p>\n<p>Kiyoomi isn’t sure how much time passes. He gets hard again himself, pressed up against the small of Atsumu’s back, but doesn’t let himself think too much of it—this is all about Atsumu, about taking Atsumu to the edge and keeping him there.</p>\n<p>Finally, he sees Atsumu’s hands clench into fists. “Omi… <em> mmnn…” </em></p>\n<p>“Mm, not yet,” Kiyoomi hums, slowing his hand down even more, touch featherlight along the sore, stiff length of his cock before taking it away completely. “A little more, okay?”</p>\n<p>He brushes a thumb against one of Atsumu’s nipples, keeping that gentle as well. A guttural moan catches in Atsumu’s throat and he rolls his hips up, chasing Kiyoomi’s elusive touch in a useless search for something to push him over the edge. Kiyoomi feels the flutter of eyelashes against his neck and realizes a second later that Atsumu is wetting his skin with tears.</p>\n<p>Kiyoomi hopes Atsumu can’t feel the embarrassingly rapid pace of his heart.</p>\n<p>“Good boy.” He rubs Atsumu’s inner thigh in encouragement. “You’re doing so well for me.”</p>\n<p>Atsumu goes even more boneless in his lap, head lolling against Kiyoomi’s shoulder as he shudders. After a few more moments, Kiyoomi deems it safe to start touching him again; he reaches down to give Atsumu’s balls a squeeze before wrapping his hand around his dick once more. Atsumu’s back arches like he’s been possessed, a whine tearing from deep in his chest as he tries to fuck up into Kiyoomi’s fist.</p>\n<p>Kiyoomi <em> tsks </em> and lets go of him, pushing down on his abs instead. “Stay still.”</p>\n<p>It takes some coaxing to get Atsumu to relax again, cock swaying obscenely as he lowers his hips. His little noises have become increasingly desperate, jumping sharply in pitch when Kiyoomi takes him in hand again, but he stays put this time, trembling as Kiyoomi strokes him slow and steady.</p>\n<p>“There you go, Atsumu. Just like that.”</p>\n<p>A few more minutes and Atsumu starts to babble, half-formed syllables spilling from his tongue muffled by Kiyoomi’s throat. He’s taken to subtly swiveling his hips, which doesn’t quite count as staying still, but since it doesn’t interfere with Kiyoomi’s movements, Kiyoomi hasn’t called him on it. </p>\n<p>They’ve done long edging sessions before <em> — </em> lots of them <em> — </em> but never on the tail end of intense predicament bondage. As he watches more precome blurt from the tip of Atsumu’s swollen cock, Kiyoomi thinks maybe he’s made Atsumu wait long enough. </p>\n<p>He speeds up his strokes, cupping and kneading one of Atsumu’s pecs with his other hand and pinching the nipple between two fingertips. </p>\n<p>\n<em> “Omi—” </em>\n</p>\n<p>“Don’t fight it, Atsumu,” Kiyoomi whispers. “I want you to come this time, okay? You’ve earned it.”</p>\n<p>Atsumu’s reply is a blur of excited gibberish slurred into his neck, but Kiyoomi can definitely make out his name, along with the word <em> please, </em> as he squirms excitedly <em> . </em></p>\n<p>“Shh, it’s okay. Just keep your legs open and let me take care of you, hm?”</p>\n<p>A noise like a sob escapes Atsumu’s mouth and he shoves back on his heels, almost making Kiyoomi groan from the increased pressure on his cock. Kiyoomi moves to play with his other nipple, pinching hard as he twists on the next upstroke the way he knows Atsumu loves; when Atsumu’s back arches and he starts to shake, Kiyoomi knows he’s about to fall over the edge. </p>\n<p>“Nnghfuck—thank you—<em> thank you—” </em></p>\n<p>Kiyoomi smiles darkly. “Come, Atsumu.”</p>\n<p>Atsumu goes rigid in his arms and wails through his third orgasm, getting both of them even messier… and, at least for the moment, Kiyoomi doesn’t mind it at all.</p>\n<p> </p>\n<p>Atsumu is floating.</p>\n<p>There’s not much of anything in his head. He’s just a vessel for sensation, broken down into component parts for Sakusa to play like a fine-tuned instrument.</p>\n<p>Holy <em> shit, </em>he missed this.</p>\n<p>So much so that when Sakusa gives him a sip of water and starts to undo the shibari after Atsumu’s third orgasm, Atsumu is almost… disappointed. </p>\n<p>Then he tries to put this into words and can’t even form a single one. Yeah, maybe it is time to stop.</p>\n<p>He makes… some kind of noise and curls in on himself once the ropes have fallen from his body. He feels the bed shift next to him, then the heat of Sakusa’s arms around him. It takes Atsumu a second to orient himself, but once he does he realizes he’s been tucked under Sakusa’s chin. Atsumu grins stupidly and wiggles to get even closer, rubbing his feet up and down Sakusa’s legs until a heavy softness falls over them, one that Atsumu recognizes as the blanket.</p>\n<p>He hadn’t even realized he was cold, but it soothes him, stops his shivering and fidgeting.</p>\n<p>“You did so well,” he hears Sakusa murmur, <em> the warmth </em> in his voice so thick it’s almost tangible. “Get some rest if you need it, okay? I’ll get you cleaned up whenever you come down...”</p>\n<p>Atsumu snuggles even closer, feeling safe in Sakusa’s arms with the blanket tucked tightly around him. They’ve never done aftercare exactly like this. It’s <em> nice. </em></p>\n<p>So good. <em> So </em> good. This, the scene itself <em> — </em></p>\n<p>The best part is that Sakusa understood what Atsumu wanted without him having to say anything. He doesn’t even know if he <em> could </em> have put what he wanted into words. It’s like Sakusa pulled the scene directly from Atsumu’s fantasies without them discussing a play-by-play beforehand.</p>\n<p>“Omi...,” he drawls happily, rubbing his feet against Sakusa’s legs.</p>\n<p>“Mm,” Sakusa hums. “Good?”</p>\n<p>Atsumu nods, anything other than Sakusa’s name still beyond him.</p>\n<p>“...Good.” </p>\n<p>Sakusa laughs, just a little self-conscious huff. </p>\n<p>He starts to rub up and down Atsumu’s back — hesitant at first, then more confident when Atsumu makes a happy noise at the touch.</p>\n<p>Atsumu floats a little for the next half hour, just aware enough to notice that Sakusa is sparing no details with the aftercare. Once the sweat on their skin has well and truly dried, Sakusa carries him to the bathroom and helps him rinse off in the shower before settling him in a hot bath. Atsumu drifts in the bath too; the hands in his hair, fingertips rubbing over his scalp in practiced circles, seem to ground him and send him higher all at once.</p>\n<p>After Sakusa helps him dry off and pull on a pair of sweatpants, Atsumu walks to the couch on jelly legs, cheeks burning pleasantly at the steadying hand Sakusa keeps on his elbow the whole time. He sinks halfway back into oblivion once he’s settled on the couch, bundled up and nestled among some pillows; he’s vaguely aware of Sakusa turning on the television and putting on an old season of a cooking competition show they both like to watch, episodes blending together mindlessly as Atsumu savors the static in his head.</p>\n<p>Eventually, Sakusa nudges him into a semi-upright position for dinner. Dessert, which is a surprise in and of itself, turns out to be a bowl of rich chocolate ice cream.</p>\n<p>“I saw you eyeing it at that market we went to last week,” Sakusa says when Atsumu asks, voice stilted like the words are being forced out of him at knifepoint. </p>\n<p>Atsumu’s been lucid for a while at this point, but the warmth that blooms in his chest as his mouth stretches into a lopsided grin makes him feel like he’s still floating.</p>\n<p> </p>\n<p>Just as Atsumu is finishing his ice cream, he hears a loud <em> thump </em> from the bedroom, followed by muffled cursing and a <em> smack. </em> Atsumu gets up off the couch, wincing as he goes, and wanders into Sakusa’s room to see what’s going on.</p>\n<p>He finds Sakusa holding a slipper above his head and staring intently at a spot on the floor.</p>\n<p>“What’s up, Omi-Omi?”</p>\n<p>“Just a spider,” Sakusa says, slowly lowering the slipper as he continues to stare at the floor. “Don’t worry, I killed it.”</p>\n<p>“You <em> killed </em>it?”</p>\n<p>Sakusa glares over at him. “Of course I did.”</p>\n<p>“He wasn’t botherin’ anyone!”</p>\n<p><em> “He?” </em> Sakusa laughs, lip curling. “It was bothering <em> me </em>. In my own home, no less.”</p>\n<p>“Ya coulda trapped him and taken him outside! Yer balcony’s right there!”</p>\n<p>Sakusa disappears into the bathroom, then reappears seconds later wearing thick blue gloves and clutching a wad of toilet paper. “You know, I distinctly remember us having a conversation about killing cockroaches when we were in high school.”</p>\n<p>Atsumu laughs, “Callin’ it a conversation makes it sound too civil.”</p>\n<p><em> “Tch. </em>My point still stands.”</p>\n<p>“Listen, there’s some bugs ya just gotta—if ya don’t kill ‘em they’ll find their way right back, and they’re <em> pests </em>. But spiders… they’re just mindin’ their own business, ya know? They’ll just find somewhere else to go if ya put ‘em out,” Atsumu says, thinking about long afternoons as a kid spent identifying all the different insects in his backyard with Osamu.</p>\n<p>Sakusa’s lip keeps twitching, like he’s trying very, very hard to keep a disgusted expression off his face. It’s not working, but Atsumu can at least recognize the effort. It’s actually kind of… cute.</p>\n<p><em> Ugh. </em>He’s got it bad.</p>\n<p>Atsumu watches Sakusa crouch down and fold the dead spider into the wad of tissue. One of Sakusa’s unstyled curls falls into his face, partially obscuring his eyes. The muscles of his thighs shift as he stands back up.</p>\n<p>“Well, it’s too late for this one,” Sakusa announces, walking slowly into the bathroom with the crumpled tissue outstretched in front of him. </p>\n<p>“Yeah, I know,” Atsumu says. “But for the sake of all future spiders that accidentally wander into yer apartment when I’m around, just tell me, okay? I’ll take ‘em outside.”</p>\n<p>He hears the toilet flushing, then the sink running.</p>\n<p>“What happens when you’re <em> not </em>around?” Kiyoomi calls as he washes his hands. </p>\n<p>“Don’t worry, Omi-kun,” Atsumu says, leaning around the frame of the door to send him a filthy, sleazy smile. “I plan to be around for a good long time.”</p>\n<p>And imagine Atsumu’s surprise when, to his delight, Sakusa Kiyoomi blushes right up to the top of his ears. </p>\n<p>Yeah, Atsumu is going to be sticking this one out. </p>"
}