{
  "id": "3507428",
  "url": "https://archiveofourown.org/works/3507428?view_full_work=true",
  "author": [
    "Margo_Kim"
  ],
  "title": "The Naming of Hobbits",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "The Hobbit - All Media Types"
  ],
  "relationships": [
    "Bilbo Baggins/Thorin Oakenshield",
    "Bilbo Baggins & Thorin Oakenshield",
    "Fíli & Kíli & Thorin Oakenshield",
    "Dwalin & Thorin Oakenshield"
  ],
  "characters": [
    "Thorin Oakenshield",
    "Bilbo Baggins",
    "Dwalin",
    "Kíli",
    "Fíli",
    "Thorin's Company"
  ],
  "additional_tags": [
    "Ambiguous Slash",
    "Literally so ambiguous as to whether this is romantic or friendship",
    "Romantic Friendship",
    "Thorin POV",
    "Awkwardness",
    "Names",
    "Quests",
    "Post-Quest",
    "Alternate Universe - Everyone Lives/Nobody Dies"
  ],
  "language": "English",
  "series": "",
  "published": "2015-03-08",
  "completed": null,
  "words": "9,756",
  "chapters": "1/1",
  "comments": "613",
  "kudos": "11,912",
  "bookmarks": "3,533",
  "hits": "90,862",
  "summary": "<p>There's a certain point where you can no longer ask someone what their name is. Thorin isn't sure exactly when that point is, but he knows that it's probably some time before the person in question saves your life. On the far side of the Misty Mountains, Thorin realizes that he never quite caught the first part of Mr. Baggins' name, and he finds that it's astonishingly harder to learn than he would have thought. Fili, Kili, and Dwalin are no help whatsoever.</p>",
  "notes": "<p>So <a href=\"https://curmudgeony.tumblr.com\" rel=\"nofollow\">Ias</a> and I were trying to figure out if Thorin ever calls Bilbo by his name before the scenes inside Erebor in DoS, and she joked that maybe Thorin literally did not know Bilbo's name until Balin told it to him. Nearly ten thousand words later, here we are.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Literally, how is nearly ten thousand words. I don't understand. I don't know how this happened to me. This was supposed to be 500 words max, and here we are. </p>\n<p>At one point, I was going to write a sex scene between them where Bilbo would be like, \"Oh Thorin,\" and Thorin would be like, \"Oh....you,\" which probably would have toppled this over to the 15k word mark to get all the set up in there. Cutting that wasn't a length thing so much as some fics just demand to be weird ambiguous friendship love platonic romance things, but feel free to imagine that scene tacked on to the end of the Laketown section. </p>\n<p>You can find more of me at <a href=\"https://margotkim.tumblr.com\" rel=\"nofollow\">my tumblr</a> where, if you go there right after this is posted, I'll probably be complaining how I somehow didn't accomplish any schoolwork during this spring break. I hope my professors accept \"I'm Bagginshield trash\" as an excuse.</p>",
  "text": "<p>“It definitely starts with a B,” Kili said earnestly while Thorin sunk his head in his hands. “I remember that distinctly. B.”</p>\n<p>“And what’s his last name, Kili? You still remember that one?” Fili said, earning himself a well-aimed blow from his brother.</p>\n<p>“These are my heirs,” Thorin said to Dwalin, while Kili tried to pile drive his brother into the ground and Fili laughed and said, “Mr. Boggins! Ooh, Mr. Boggins!” Dwalin gave Thorin a sympathetic look, which was less sympathetic than it would have been if Dwalin did not seem so very amused. “And you don’t know either.”</p>\n<p>“The lad and I have not been on great speaking terms,” Dwalin said. “I’ve nothing against him, but we’ve little in common.”</p>\n<p>That had been, more or less, Thorin’s thoughts on the matter, until the hobbit had thrown himself in front of a warg five times his height to save Thorin. But no, that wasn’t the start, though it was close enough that Thorin could pretend. It wasn’t even Master Baggins’ pledge to help them reclaim their home, though that had humbled Thorin tremendously. It was that Master Baggins had come back, when he didn’t need to, and that alone was more than most people Thorin had ever known. That was someone Thorin could embrace.</p>\n<p>Embracing, of course, was easier than the parts that came after. Like talking, for example. Or figuring out some key bits of information that it was rather too late to ask about.</p>\n<p>“So none of us know his first name,” Thorin said. He glowered at his nephews until they untangled themselves and scrambled to their feet. “I thought you two were friends with him.”</p>\n<p>“We are!” Kili said cheerfully. “Only, we call him Mr. Baggins.”</p>\n<p>“Or burglar,” Fili added.</p>\n<p>“Or the great lump.”</p>\n<p>“Or sheep head.”</p>\n<p>“Enough.” Thorin stepped forward and winced, his hand raising to his side. In a moment, Fili, Kili, and Dwalin were at his side, their faces so worried that he had half a mind to show them he could still take any of the three in a fight. (Well—perhaps not Dwalin. Thorin could admit he’d need to heal a little more before he tried to topple that mountain.) He waved them off with an undoubtedly sour look on his face, and they scooted back, masking their concern with various degrees of success. Thorin leaned against a tree. “Ridiculous.” He wasn’t sure which part of this situation he was referring to.</p>\n<p>“We could ask him,” Kili said.</p>\n<p>“Oh yes, that’s what everyone wants to hear,” Fili said. “‘Hello, person we’ve been traveling with for four months. Funny story, but we never quite caught your name.’ That will make him feel like a real member of our company.”</p>\n<p>Kili’s enthusiasm seemed untampered. “Then we ask Gandalf, or Balin. Or Bofur, he’s good mates with Bofur, I think.”</p>\n<p>Dwalin harrumphed. “If you think Bofur wouldn’t tell the hobbit in a heartbeat…” He trailed off, shaking his head.</p>\n<p>“The wizard would be no better,” Thorin said. He fought the urge to rub his temples, lest he summon another inane round of clucking about his health. This type of sneaking went against his character. He was out of practice in the art of delicacy.  </p>\n<p>“So Balin, then,” Kili said. “He knows how to keep a secret, trust me.”</p>\n<p>“Why?” Fili asked. “What have you told him?”</p>\n<p>“Nothing!” Kili replied too quickly.</p>\n<p>Thorin and Dwalin glanced at each other and had a silent conversation as only old, old friends could do. They could ask Balin, of course, and Balin would tell them and never mention a word of it to Mr. Baggins. But Balin would be so very disappointed in them. In him specifically, Thorin thought, Balin would mostly be disappointed in Thorin, and perhaps Thorin wanted to avoid that because when Thrain disappeared, Balin had stepped in as best he could as something close to a father figure, but there was also that fact that Thorin felt like enough of an idiot at the moment and there was really no need to widen the circle of people who knew it.</p>\n<p>“We ask no one. When we get to wherever Gandalf is taking us, there will be introductions,” Thorin said. He looked firmly at his nephews, at his heirs, assuming everything went as he hoped it would, and found them eager.</p>\n<p>“We’ll listen and report back,” Kili said, like he was being sent on a scouting mission.</p>\n<p>“And we won’t say a word to Mr. Baggins,” Fili said, which Thorin appreciated a little more than Kili’s unbridled enthusiasm.</p>\n<p>“<em>I </em>could ask Balin,” Dwalin said, sounding like he really didn’t want to. “He expects me not to know things like this.”</p>\n<p>“Oh but Balin would <em>know</em>,” Kili said before Thorin could. “He just knows all sorts of things without anyone having to say anything.”</p>\n<p>“Kili, what does he know about you?” Fili asked. Kili gave him a look that he probably thought was subtle and translated very obviously to <em>not in front of Uncle.</em></p>\n<p>“I don’t want to know,” Thorin said.</p>\n<p>Kili wrinkled his nose sympathetically. “You really don’t.”</p>\n<p>Dwalin started to laugh again as Thorin closed his eyes and thought very hard about how he couldn’t die until his heirs were about fifty years older, at which point they would probably be at least a few years wiser than they were now. Which Thorin admitted was big talk from a man desperately scrambling to learn the name of someone he’d traveled with for four months, someone who had saved his life and pledged his service to him, someone who had proven beyond all doubts that he deserved more respect than Thorin had ever offered him, but never let it be said that Thorin Oakenshield couldn’t feel bad about two things at once.</p>\n<p align=\"center\">***</p>\n<p>“No one heard?” Thorin asked his little council. Out behind the great hall, in the garden surrounded by bees the size of their heads, Fili and Kili had at least the decency to look ashamed. Dwalin just shrugged.</p>\n<p>“Forgot,” he said. “I got distracted by the bear man.”</p>\n<p>“That did seem more important,” Fili said.</p>\n<p>Thorin almost said something like <em>you can acknowledge the bear man and still listen for one name</em>, but he stopped himself. There was an obvious rebuttal to that, and even though Thorin didn’t set him up for it, Kili said it anyway. “You didn’t hear Mr. Baggins’ name either, Uncle.”</p>\n<p>“I know. I know.” Thorin pinched his nose. “This is ridiculous.”</p>\n<p>Dwalin made grunt that sounded like he agreed. “Thorin, the time for subtlety’s over. Just ask him.”</p>\n<p>“No, no, we can’t do that!” Kili protested. Then a quick looked of confusion passed over his face. “Wait, when you say ‘he,’ do you mean Mr. Baggins or Balin?”</p>\n<p>Dwalin thrust a hand at Kili and looked pointedly at Thorin as if to say, <em>See? </em>“Just have a conversation with the lad, he’ll understand.”</p>\n<p>“He’ll understand, but he’ll feel terrible,” Kili said. “We’ve just got him feeling like a member of the Company and know we’re supposed to take that away?”</p>\n<p>Fili frowned at his brother. “Why’ve you gone all tender-hearted?”</p>\n<p>“Because I’m a good person, Fili.”</p>\n<p>“We know that’s not true, Kili.”</p>\n<p>“Fine, then because I <em>just</em> had a nice conversation with him and I don’t think that he’s got many hobbit friends and he was nice to Bifur last night.” Kili looked pointedly at Fili who raised his hands in surrender. His brother thus won over, Kili shifted to looking at Thorin imploringly. “We can’t make him feel bad.”</p>\n<p>“We won’t,” Thorin said, wondering if he could keep that promise.</p>\n<p>“Then ask another dwarf!” Dwalin also looked at Thorin. You could have called it imploringly, except that he mostly seemed to be imploring Thorin to stop acting like an idiot. “It doesn’t have to be Balin. Mahal knows, I wouldn’t ask Balin, with his infinite wells of disappointment for eyes. Ask someone else.” When Thorin grimaced, Dwalin added, “We’re dwarves, not elves. We don’t prattle. We can keep a secret.”</p>\n<p>“Secret?” Bofur’s head popped around the edge of the house, pipe sticking out of his mouth. “What secret? Are we talking about what Bombur said last night?”</p>\n<p>“How long were you there?” Thorin asked at the same time Dwalin shouted, “Don’t sneak up on warriors!” while Fili and Kili said excitedly, “What did Bombur say?”</p>\n<p>“Bombur was telling us about the time Dori got drunk off his arse at the last Durin’s Day feast, stood on a table, and serenaded Beli’s wife,” Bofur said, grinning and ignoring two-thirds of the questions leveled his way.</p>\n<p>“Bofur!” Dori shouted, his head shoved out the window above them that Thorin had not noticed. Thorin had a small conniption of terror (<em>How long were you listening? </em>still being the relevant question) as Dori glowered down at Bofur who was laughing so hard his hat was threatening to wobble off. “That’s not how that night went and your lying brother knows that.”</p>\n<p>“Lying? <em>Lying</em>?” Bofur said, shaking his fist at Dori with more good-natured cheer than Dori seemed to appreciate. “Were you lying when you said no woman but Brun would make you happy?”</p>\n<p>Dori’s head disappeared for a moment, accompanied by the sound of thumping feet running closer and closer. Bofur clapped his hat tighter on his head, shrugged at the four of them, and took off running.</p>\n<p>Thorin gave Dwalin a pointed look. “We absolutely prattle.”</p>\n<p>“Fair enough,” Dwalin said, looking after Bofur sprinting across the gardens, Dori hot on his heels. “I didn’t think Dori the type.”</p>\n<p>“I can see it,” Fili said. “You think it was a love ballad?”</p>\n<p>“It’d have to be,” Kili said. “Otherwise why would he be so upset?”</p>\n<p>“Could have been a soldier’s song,” Dwalin said. “If I sang one of those to a dwarf’s wife, I’d keep it a secret too.”</p>\n<p>“We ask no one anything. Ever,” Thorin said. “And when I am king under the mountain, I’m finding better trusted advisors.”</p>\n<p>Kili nodded sagely at that. “Make sure they’ve got a good mind for names.”</p>\n<p align=\"center\">***</p>\n<p>Thorin was laying out his bedroll for a fifth miserable night in Mirkwood when Fili leaned over and hissed, “He signed a contract.” He raised his eyebrows at Thorin. “You know. With his name.”</p>\n<p>“Yes, I know how signatures work,” Thorin said, but he clasped his hand on Fili’s shoulder anyway. “Well done.” His nephew beamed like the sunlight they hadn’t seen for a while. A moment later, perhaps sensing his brother’s happiness and feeling the need to share in it or destroy it, whatever brotherly inclination he felt today, Kili was there as well.</p>\n<p>“What are we talking about?” he asked, looking between the two of them. “Have we made progress on, you know, <em>the mission</em>?” He raised his eyebrows pointedly at Thorin. “You know. With the hobbit.”</p>\n<p>“Yes, I knew what you were talking about,” Thorin said.</p>\n<p>“The contract,” Fili said to Kili, and Kili oohed.</p>\n<p>“Right! With his signature,” Kili said. “That’ll have his name, Uncle.”</p>\n<p>“Do both of you think that I’m very bad at understanding simple concepts?” Thorin asked, then held up his hand. “Don’t answer. Who has the contract?”</p>\n<p>“That’s the bad news. Mr. Baggins has it,” Fili said. “But I figure you can just ask to, you know, read it again. Maybe you forgot a clause or you want to make sure that he’s getting the treatment we promised him.”</p>\n<p>“He is definitely not,” Kili said cheerfully. “This has been <em>much worse </em>than what we promised.”</p>\n<p>“Enough. You’re both on first watch.” Thorin gave both of his nephews a stern look. It did less than it had when they were younger. That was the damned thing about the quest, Thorin thought as he left his nephews to stalk over to the other side of camp where Mr. Baggins and Bombur were counting out rations. You spend enough time with people, you get to see that they’re all a little ridiculous. When he was king, he’d have to make sure that no one talked to him longer than five minutes.</p>\n<p>“Hello there and give us a minute,” Mr. Baggins said as Thorin settled down on the ground beside him. Bombur glanced at them and kept counting. “We’re not done assembling our feast yet.”</p>\n<p>Thorin glanced down at the slabs of honey bread. “What fresh bounty.”</p>\n<p>“Isn’t it,” Mr. Baggins said wryly. “I can’t imagine I’ll ever get tired of honey bread. Why, if I was back in the Shire and eating my seven meals a day, I think I’d make all of them honey bread and nothing but honey bread. Or better yet, I’d simply drizzle some honey on a rock and knock that back. It’ll taste about the same.”</p>\n<p>“It’s better than starvation,” Thorin said, the highest praise he could honestly offer.</p>\n<p>“Many things are better than starvation, Thorin,” Mr. Baggins said, and yes, Thorin did feel guilty about how easily the hobbit could use Thorin’s name, thank you for asking. “You’ll have to set your standards a little higher when you’re king.”</p>\n<p>Bombur stood. “That’s rations then. I’ll start handing out, little bunny.”</p>\n<p>“Oh stop,” Mr. Baggins said as Bombur scooped up the company’s dinner in his arms. Thorin nodded appreciatively at Bombur when he handed Thorin his slice, though he would have been a little more appreciative if he’d said Mr. Baggins’ name in the process.</p>\n<p>On the other hand, it was always worth seeing Mr. Baggins’ face when someone brought up the <em>little bunny </em>nickname.</p>\n<p>When he was gone, Thorin asked, “Do you have your contract?”</p>\n<p>Mr. Baggins frowned in thought, or possibly at the slice of honey bread he’d just taken a bite out of. “Yes, in my pack. Why?”</p>\n<p>“I wanted to reconsider some sections,” Thorin said. “Before we reach the mountain.”</p>\n<p>Mr. Baggins raised an eyebrow. “You mean you would like to change the terms of our contract when I’m miles from home with no recourse and nowhere to go if I find the terms unfavorable?”</p>\n<p>“No, no,” Thorin said quickly. “I want to make the contract fairer to you, not worse.”</p>\n<p>“How?”</p>\n<p>“Some sections are lacking.”</p>\n<p>Mr. Baggins snorted. “That’s true enough.”</p>\n<p>“Yes, I—wait, what?” That had not been the reaction Thorin expected.</p>\n<p>“Are we going to discuss the funeral arrangements section?” Mr. Baggins’ clenched his pipe between his teeth and started digging in his pack. “At what point of service do I warrant more than a—how did you phrase it.” He pulled out the contract, looking a little worse for wear, and flipped it open. “A commoner’s funeral with one pine coffin, and you will not send my body home.” He looked up from the contract with as look as dry as the parchment he was holding.</p>\n<p>“I don’t understand,” Thorin said. “That’s a fine clause.”</p>\n<p>“A commoner’s funeral.”</p>\n<p>Thorin paused. “Yes?” And then seeing from the hobbit’s face that this wasn’t the right answer, “We did specify a coffin. That’s better than usual.”</p>\n<p>“What is it usually?”</p>\n<p>“Just a hole in the ground.”</p>\n<p>Mr. Baggins laughed incredulously. “Good heavens. Would you wrap me in something first or just push me in?”</p>\n<p>“Maybe some tasteful leaves,” Thorin said. “Or we’d set you on fire.”  </p>\n<p>The hobbit held out the contract. Thorin took it, with such a feeling of heady gratefulness that he couldn’t help but smile, an expression the hobbit returned, albeit with a shake of his head that implied he was thinking once again about the strangeness of dwarves.</p>\n<p>“Do you want to offer me more treasure?” Mr. Baggins said as Thorin flipped to the back. “Bonuses for trauma endured?”</p>\n<p>“You can have Fili and Kili’s share,” Thorin muttered. Last page. The signatures. There was Thorin’s, yes, and Balin’s underneath it, and—</p>\n<p>“Oh no, I don’t want that,” Mr. Baggins said obliviously as Thorin stared down in horror. “Not if it comes with the rest of their gains. I’d rather not be in line for the throne, thank you. I like being able to lock my neighbors out, and I don’t think you get to do that when you’re king.”</p>\n<p>“Ah.” Thorin squinted down at the page, then up at B-something Baggins, then back down at the page. “You cannot.” Illegible. Absolutely illegible. There was something he vaguely recognized as a B at the beginning, but he couldn’t even trust that he was identifying that versus simply recognizing what he knew should be there. There was a strange swoop and then a squiggle, then some kind of violent slash, and finally, in letters that could not have been clearer, <em>Baggins</em>. “What a signature you have,” Thorin said helplessly.</p>\n<p>B-something Baggins chuckled, the bastard. Bastard Baggins, yes, there we go, Thorin thought, mystery solved. “Yes, I’ve been told.”</p>\n<p>“You can’t even read the first name.” Thorin hoped he sounded more joking than desperate.</p>\n<p>“You only need the last one for official purposes,” the monster of a hobbit said. “I suppose I always got lazy when it came to my first name.”</p>\n<p>“That’s not good.”</p>\n<p>Mr. Baggins just smiled, then took another bite from his bread and promptly stopped smiling. “What sections were you thinking about then?”</p>\n<p>Thorin squinted at the signature one last time (maybe it was just the dimness of the forest?) before he surrendered. “Your rights in Erebor after we reclaim it,” he said despondently. “If anything happens to me, I want to make sure that you’ll be accorded all the welcome you are due.”</p>\n<p>He didn’t know why that was the lie he picked, for that was not something that Thorin particularly wanted to think about. And yet it was something Thorin had been thinking about a lot lately. He’d be a fool to pretend that he thought he was guaranteed to survive this quest. He was already a fool for thinking that it would work at all, and that was all the foolishness he could spare. He knew his company would look after his hobbit if Thorin could not, but he couldn’t guarantee their safety either. He couldn’t guarantee anyone’s. Least of all Mr. Baggins’. He thought of a little pinewood coffin out here in the wild and then resolutely didn’t.</p>\n<p>“Don’t be morbid, Thorin,” Mr. Baggins said, waving him off. “Nothing bad is going to happen to you.”</p>\n<p>“We’re on a quest to slay a dragon.”</p>\n<p>“Just the same.” Mr. Baggins thought for a moment and grimaced at whatever he thought. “It’s unpleasant enough being in these woods. We don’t need to talk about dire, dark things as well.”</p>\n<p>“Precaution is not dire and dark,” Thorin said with an insistence that almost made him forget that he’d pulled this entire discussion out of thin air as a cover up for trying to read an illegible signature.</p>\n<p>“It is when it’s a precaution in case something dire and dark happens.”</p>\n<p>“So you’d rather face that eventuality unprepared?”</p>\n<p>“Firstly, if anyone is going to survive this quest, it will be you, powered by sheer stubbornness,” Mr. Baggins said. “And secondly, should by some horrid tragedy you not survive, I don’t think that if anyone in this company would kick me out of the mountain because you were gone.” Mr. Baggins paused.</p>\n<p>“Are you thinking about Fili and Kili?” Thorin asked.</p>\n<p>“Yes, they might think it was funny. But then I’m sure Balin would talk some sense into them.</p>\n<p>“Or Dwalin would beat some sense into them.”</p>\n<p>Mr. Baggins hid his smile behind another bite of honey bread. “Either one. So you see, I am very well taken care you, thank you.”</p>\n<p>“All the same, you’d settle my mind if we could agree.”</p>\n<p>“Does this worry you that much?” Mr. Baggins asked, sounding genuinely surprised.</p>\n<p>Thorin shifted. He didn’t know how to answer. “Yes,” he said and realized in saying it that it was completely true. “I want to be sure.”</p>\n<p>“Well, alright, if you’re going to fuss,” Mr. Baggins said, ducking his head. Thorin thought he might have been flushed, but it was too dark now to be sure. “After all, this quest has been nothing but me following your ridiculous whims.”</p>\n<p>“And saving me from them,” Thorin said.</p>\n<p>“And rather too much honey bread.” Mr. Baggins waved Ori over. “What a gloriously grand adventure. I can’t believe I almost didn’t come.”</p>\n<p>The terms they agreed on were simple but satisfactory. Mr. Baggins could stay at Erebor as long as he pleased (“In perpetuity, that’s the official way to say it,” Ori had said conspiratorially to that, tapping his nose) and would be paid a stipend from the royal treasury to support himself so that he didn’t need to work. He’d have the official status of royal guest and would receive any and all benefits granted by that status until such time as he chose to leave Erebor.</p>\n<p>“And if I refuse to ever leave?” Mr. Baggins asked. Thorin’s heart seized a little.</p>\n<p>“In perpetuity,” Ori said firmly. Then he glanced at Thorin who nodded at him. “Er. Yes. In perpetuity.”</p>\n<p>Mr. Baggins gave Thorin a pleased look. “I’ll make sure to drain the treasury dry.”</p>\n<p>Thorin snorted. “I doubt the one member of this company who thought that lapis lazuli was a type of fish will be that big a financial drain, no matter how many books and cups of tea he orders on the king’s dole.”</p>\n<p>Mr. Baggins laughed, his head tossed back. “I’ll have to get more expensive tastes.” He tapped the contract that Ori was holding. “Ooh, and add that I get a private bedroom in the royal section.” He looked at Thorin. “There is a royal section?”</p>\n<p>“Yes,” Thorin said, “that’s where the royalty sleeps.”</p>\n<p>“Perfect,” Mr. Baggins replied. “Put me right next to Thorin, that’ll probably be the best room.”</p>\n<p>“I won’t have a room. I’m supposed to be dead in this scenario,” Thorin said. “That’s the point of this entire clause.”</p>\n<p>“Yes, and now I’m thinking how we are actually going to live in Erebor,” Mr. Baggins said, “which is a situation in which you are very much not dead and where I would like to get the best room possible for my stay.”</p>\n<p>“So you are staying then?” Thorin asked, his heart pounding in his ears.</p>\n<p>Mr. Baggins dropped his eyes again, smiling a little, and shrugged. “No sense going through the efforts to help you get your mountain back and not stick around a while to see what it’s like. If, er, you don’t mind.”</p>\n<p>“No, no, not at all,” Thorin said, probably too quickly. He balled his fists in his lap. “As we said. In perpetuity. Stay forever.”</p>\n<p>Ori looked at Thorin again. “If that’s it then,” he said, with the tone of someone who was eager to be elsewhere. “I’ll just need you both to sign again to the new agreement.” He passed Thorin the quill. “Right here on the top line. And then our master burglar can sign underneath.”</p>\n<p>And not for the first time Thorin thought that surely <em>someone </em>in this company at some point could call Mr. Baggins by his first name.</p>\n<p>“You’ve made me all self-conscious about my signature now,” Mr. Baggins said to Thorin, taking the quill when he was done.</p>\n<p>“Sign neater then,” Thorin said with a fake nonchalance that was almost painful. Mr. Baggins raised his eyebrow at him and scribbled what appeared to be three loops in a row.</p>\n<p>“Like that?” Mr. Baggins asked innocently.</p>\n<p>Thorin resisted the urge to sink his head into his hands. “Exactly, little bunny. Just like that.”</p>\n<p align=\"center\">***</p>\n<p>“I told you, I’m fine,” Kili grunted when Thorin asked for a third time. His face was nearly as pale as the mist-covered lake itself, and with all the sweat running down it, likely nearly as wet. But what could Thorin do, here on this trash heap of a barge? Oin sat on one side of his nephew. Fili sat on the other. And Fili had already told Thorin privately how little Kili wanted him there.</p>\n<p>“You make him feel ashamed, Uncle,” Fili had said, his eyes cast low. “He doesn’t want to look weak in front of you.”</p>\n<p>After the spider attack, his stay in Thranduil’s prison, and miserable escape, Thorin had not thought he could feel worse than he already did. And once again, his relations managed to prove him wrong. So Thorin’s mood was (justifiably, he maintained) wretched by the time Mr. Baggins started singing Bard the bargeman’s praises.</p>\n<p>“How do you know his name?” Thorin snapped.  </p>\n<p>“Because I asked him,” Mr. Baggins snapped back.</p>\n<p>Behind the hobbit’s back, Dwalin stared pointedly at Thorin. Thorin elected to ignore him. Thorin was perfectly capable of hearing the implications himself. That didn’t stop Dwalin from sidling over the second that Mr. Baggins walked away to the other end of the boat. “Did you hear that?” Dwalin asked. “He didn’t know someone’s name so he asked. Brilliant. If you’re still keen on finding new advisors, I’d recommend that lad. He’s got a good head on his shoulders.”</p>\n<p>“Dwalin,” Thorin said warningly.</p>\n<p>“You ought to go over and hire him right now. I think I know what the first subject he advises you on ought to be.”</p>\n<p>Thorin sighed. He couldn’t even be cross with Dwalin—well, <em>that</em> cross, but Dwalin was naturally and always a bit of a prick so Thorin was used to that. “Bofur said his name to me when we were taken,” Thorin said glumly.</p>\n<p>Dwalin leaned in immediately. “Does that mean you know it?”</p>\n<p>If Thorin had been a little less cold, wet, and miserable, he might have given Dwalin a slightly less helpless look. As it was, he was about one cold breeze away from hypothermia so he probably looked as kingly as a drowned kitten when he said, “I couldn’t hear it. Bofur whispered, ‘Where’s—’” Thorin made a chopping gesture where Mr. Baggins name was supposed to be. “Considering the circumstances, I couldn’t ask him to repeat it.”</p>\n<p>“You’re lying,” Dwalin said.</p>\n<p>“I wish I was.” Thorin tried to run a hand through his hair and ended up with his fingers tangled in the spider-webbed, water-logged mess.</p>\n<p>Dwalin was looking at Thorin the way, well, the way Dwalin usually looked at Fili and Kili, which was certainly humbling. “Just <em>ask</em> him, Thorin.”</p>\n<p>Thorin disentangled his fingers, feeling a little like a cat who’d just gotten his claw stuck and intended to act like no one had seen it. “Do you remember after the Carrock when I said that we couldn’t ask him?”</p>\n<p>“Too well.”</p>\n<p>“I was wrong. That was when we should have asked,” Thorin said. “I see that now. I can admit that you were right back then.”</p>\n<p>“I’m still right.”</p>\n<p>“No. We are nearly at the foot of Erebor. I’m sending him in to burgle the Arkenstone.”</p>\n<p>“And you should know his name before that.”</p>\n<p>“How?” Thorin hissed. A few feet in front of them, Gloin turned around and looked at them questioningly. Dwalin and Thorin glared until Gloin faced forward again. It didn’t take long. At least Thorin’s glares still worked on somebody. In a quieter voice, Thorin said, “Am I supposed to push him towards a dragon hours after I tell him that I didn’t even bother to learn his name this entire time?”</p>\n<p>“I will be happy to vouch for how much bother you went to,” Dwalin replied. “You’ve kept this secret long enough.”</p>\n<p>Thorin shook his head. “The longer you keep a secret, the longer you have to keep a secret.”</p>\n<p>“That’s ridiculous.”</p>\n<p>“I agree. And yet.”</p>\n<p>Dwalin started to say something and stopped. He looked pained. More so than he had looked crawling out of the barrel. Either he’d been injured in the escape or he was about to try a heart-to-heart. “The hobbit won’t be angry.” Thorin winced. Heart-to-heart it was. “No.” Dwalin stuck his finger in Thorin’s face. “Listen. I’m only saying this because Balin can’t. Then we’re not going to talk about this again. The hobbit won’t be angry. He likes you. You like him. Everyone knows that he likes you. Everyone knows that you like him. Neither of you are subtle. Whatever you are imagining will happen if he finds out, it won’t. Unless you imagine him laughing at you for a good hour. That probably will.” Dwalin crossed his arms. “So are you going to ask him?”</p>\n<p>“No,” Thorin said. “Someone’s going to say his name sooner or later, and Mr. Baggins will never have to know.”</p>\n<p>“You’re an idiot.”</p>\n<p>“Get it out of your system. You can’t abuse me anymore when I’m king.”</p>\n<p>Dwalin harrumphed. “If you think a crown’s going to stop me—”</p>\n<p>Thorin patted Dwalin’s arm. “I never thought that.” He cleared his throat, his face still a little hot from Dwalin’s speech. “You’re a good friend.”</p>\n<p>“Mahal, no,” Dwalin said. “We’re not doing this.”</p>\n<p>“Oh good. I was out of compliments after that.”</p>\n<p>Dwalin punched Thorin in the shoulder. He always managed to hit the same spot. Thorin’d had a bruise there for decades now. They stood in silence beside each other as the barge glided through the misty waters. Then Dwalin leaned over. “You know my name, right?”</p>\n<p>“Of course I do, Oin.”</p>\n<p>Dwalin might have said something then, probably something blisteringly rude, but it was at that moment that the mist parted. “Oh,” breathed Dwalin, softer than the mist around them. Thorin said nothing. He could not. Because there was home. What else was there to say?</p>\n<p align=\"center\">***</p>\n<p>Thorin tapped out of the party at midnight, when by all accounts it was just getting started. Most of the company was chugging ahead without any sign of halting. That didn’t concern him much. It would take more than this piss ale to get dwarves too drunk. There were only a few members of the company taking an early night along with him. Bofur, for one, was already passed out under a table. Thorin made a mental note to make sure someone checked on him in the morning. Thorin had sent Kili to bed to rest, and he was worried about the way his nephew went without fuss. Fili had gone with him, and Oin as well. The rest of his dwarves still packed into the grand hall as Thorin slipped out. When the great wood doors shut behind him, it swallowed the noise of the party down to a nicely muffled din.</p>\n<p>“All that chaos too much for you as well?” Mr. Baggins asked. He was sitting cross-legged by the edge of the dock with a plate in his lap that could have been at least three meals. There were four empty plates behind him. Thorin shuddered to think of hobbit metabolisms.</p>\n<p>“It’s been a long day,” Thorin said, coming to sit beside Mr. Baggins.</p>\n<p>“Long day? Long week. Long month. Long journey.” Mr. Baggins held up a leg of lamb. “Good food though.”</p>\n<p>“How you can possibly be hungry after what you put away at the feast, I’ll never know.”</p>\n<p>Mr. Baggins simply shrugged happily and kept tucking away. Thorin leaned back on his hands and stared out over the water, towards the mountain. The moonlight was so bright and clear today that it seemed as if the Lonely Mountain stood lonely no more, its pale twin reflected perfectly in the lake. It was too much to think about this close and still so far. “Why did you say what you did?” Thorin asked, his eyes still on Erebor.</p>\n<p>Mr. Baggins swallowed a mouthful and asked, “You mean telling people my name was Otho Banks at the feast?”</p>\n<p>“For one,” Thorin said dryly. He’d followed Mr. Baggins around that feast for two hours, not that he particular minding the following, but it had been in the hopes that the hobbit would surely, at some point, state his first name. Thorin was starting to think he didn’t have one. Maybe it was Mister. Now he was giving out fake ones, the unfairness of which at this point was disappointing but not surprising.</p>\n<p><em>Disappointing but not surprising</em> also summed up much of Thorin’s life in general.</p>\n<p>“You did look very pained when you heard that,” Mr. Baggins said. He gave Thorin a look that seemed to be asking <em>why</em>. Thorin ignored it. He probably <em>had</em> looked very pained when he’d heard that.</p>\n<p>“Why did you tell these people that was your name when,” and here Thorin made an educated guess, “it is not?”</p>\n<p>Mr. Baggins laughed sheepishly. “It’s silly, I know. But Bard—and don’t scowl, Thorin, he’s a perfectly lovely man who didn’t need to help us and just wants his people to be safe—made it clear that the Master wasn’t to be trusted. And I know I’m far away from anyone who knows me, but…” Mr. Baggins moved his plate off his back and leaned back like Thorin. The moonlight lit his thoughtful frown. “I told you about the creature in the Misty Mountains.”</p>\n<p>Thorin nodded. “You are still thinking about how you told him your name?”</p>\n<p>“It’s a strange thing to think about so much,” Mr. Baggins said. “And yet I can’t forget it. I don’t know what I’m worried about, but I’m worried about it.” And that last sentence seemed to sum up much of Mr. Baggins’ life.</p>\n<p>“If it weighs so heavily on your mind, then you do well to be so cautious about your name,” Thorin said, though it killed him to say it. “Shall I call you Otho from now on then? After your favorite relative?”</p>\n<p>Mr. Baggins grimaced. “I don’t know why I picked him. I can’t stand even pretending to be married to Lobelia. You know she’ll get Bag End if I die.” He said this last bit like this reason alone was incentive for him to stay alive. The hobbit contemplated the mountain, his mouth set in a thin line of worry. Thorin turned to contemplate the mountain alongside him. Together they sat in silence and fretted, which wasn’t exactly a pleasant experience but was certainly an improvement of Thorin’s usual situation of fretting alone.</p>\n<p>“You said ‘for one,’’ Mr. Baggins said, still looking upon the mountain.</p>\n<p>“Hmm?”</p>\n<p>“When you asked me why I said what I said, you said the fake names for one. Was there …something else you wanted to ask about?”</p>\n<p>Thorin said nothing.</p>\n<p>“I vouched for your character because I meant it,” Mr. Baggins said simply. “You are the highest caliber of person I have ever met and I would follow you—well.” Mr. Baggins gestured at Erebor. “Across the world to a dragon hoard. That’s why I said that. There’s no one to whom I would rather stake my good name.”</p>\n<p>Thorin didn’t look at Mr. Baggins. He didn’t look at him for a very long time. Then he cleared his throat and said, “Sorry, what good name is that again?”</p>\n<p>Mr. Baggins laughed and bumped his shoulder against Thorin’s.</p>\n<p>Thorin laughed too and then said, “Truly, I do not know your name. Please tell me.”</p>\n<p>“Oh, it’s Otho, of course,” Mr. Baggins said merrily. “Otho Banks at your service.”</p>\n<p>Thorin gave up. He flopped backwards on the pier and stared up at the stars. After a moment, Mr. Baggins flopped down beside him, looking up at the stars that Thorin had grown up under, even if he had never known them inside the mountain. They worried together a while longer, shoulder to shoulder, and if it still wasn’t exactly pleasant, Thorin thought, you couldn’t beat the company.</p>\n<p align=\"center\">***</p>\n<p>Thorin knew this air. Thorin knew this stone. As Mr. Baggins crept towards the great treasure of Thorin’s people, Thorin ran his hands along the inside of his mountain. The stench of dragon and death still fouled the air. But underneath. That he knew. That was the air his people had breathed when the halls of Erebor were lit by gold.</p>\n<p>He couldn’t stay in there. He couldn’t wait halfway home. Thorin stalked out into the open and hated it the second he breathed it again.</p>\n<p>They waited. Thorin closed his eyes and paced out the steps along with Mr. Baggins. He didn’t know where the secret door let out, but it was on the west side, near the top of the service tunnels. There was nowhere for him to go besides the great hall. He would be there now, surely, unless Mr. Baggins crept slower than rock grew. What did he see? Was his face lit by the golden glow?</p>\n<p>They waited in the silence. And then they heard the roar. Thorin remembered it. Thorin had could never forget it, and he’d never tried. He’d hoarded his hatred as much as Smaug hoarded his people’s gold and bones. Noise in the deep came again. Mr. Baggins was down there, against that. And still Thorin did not move.</p>\n<p>“What about Bilbo?” Ori asked.</p>\n<p>Thorin thought about waiting in Thranduil’s prison with more hope than he had known for a long while. Then he thought about gold. “Give him more time.” Hadn’t his hobbit proven that he could get Thorin anything he needed if he just had enough time?</p>\n<p>“Time to do what?” Balin snapped. “To be killed?”</p>\n<p>“You're afraid,” Thorin accused.</p>\n<p>“Yes! Yes, I'm afraid!” Balin said as if cowardice this close to their treasure wasn’t shameful. “I fear for you, Thorin. A sickness lies on that treasure, a sickness that drove your grandfather mad!”</p>\n<p>Thorin flinched away. “I am not my grandfather.”</p>\n<p>“You are not yourself! The Thorin I know would not hesitate—”</p>\n<p>“I will not risk this quest for the life of one—” He faltered for a moment. He found his footing again. “Burglar.”</p>\n<p>“Bilbo,” Balin said. “His name is Bilbo!”</p>\n<p>Bilbo Baggins.</p>\n<p>It should have been something more. After all this time, it should have been something more. Not the name, no, because once Thorin heard it, it slotted into place as perfectly as the Arkenstone above the throne. It was the discovery that was lacking. Balin hadn’t even been the first to say it, Thorin thought distantly. It was Ori. Ori had blurted it out and Thorin hadn’t even noticed.</p>\n<p>It didn’t matter. It didn’t. Not now at least, not when there were larger things happening, not with revenge and reclamation yet to be done, with the Arkenstone unfound, with a dragon awake. It didn’t matter right now, with his sword pressed against the burglar’s chest because Thorin could hear the gold singing and no nameless thing was going to quit on a job halfway through. And it didn’t matter. It didn’t.</p>\n<p>“Bilbo!” Thorin shouted for the first time, and it felt right in his mouth. It felt as right as the gold around him. It felt as right as his grandfather’s crown. Bilbo, Thorin thought, and the sound was like another treasure on top of what he’d already reclaimed. Bilbo could be another treasure. And why not? He’d signed the contract. He’d said he wanted to stay. Let him stay in the royal suites like Thorin promised. That served Thorin all the better. The Arkenstone was still lost to him for now, and that taught him a valuable lesson—do not let what’s precious to you out of your sight.</p>\n<p>Thorin’s grandfather had told him once that you could never own something you didn’t know the name of. He meant rocks. “Bilbo,” the king under the mountain said, and he knew what he meant.</p>\n<p align=\"center\">***</p>\n<p>Bilbo’s was the last face that Thorin saw before dying. Call it one last gasp of greed—Thorin was happy beyond words for the sight and the simple pleasure that he had a name, at last, to put to it. He wrapped the name around himself. And then he let it go. “Farewell, Master Burglar,” Thorin said, and if there was something selfish about wanting to die with a little bit of selflessness, there were none here but Bilbo to judge him, and to Bilbo’s judgment and grief and arms Thorin willingly surrendered himself.</p>\n<p align=\"center\">***</p>\n<p>Bilbo’s was not the first face that Thorin saw when he came back to life.</p>\n<p>The universe, it turned out, did not like parallels that much.</p>\n<p>So Thorin’s first sight upon waking was Dwalin, sitting vigil in the hospital tent. Then it was Fili as he hobbled over at the sound of Dwalin’s shouts, and then it was Kili as he hobbled after his brother. And then it was Bilbo. His face was paler than Thorin remembered it and speckled with someone else’s blood like freckles. He wore the blue tunic of a medic and he was wiping his hands clean on a filthy rag as he rushed over. As Fili and Kili flung themselves on top of Thorin, he saw Bilbo’s eyes begin to water. The last thing that Thorin saw before he succumbed to the blackness again was Dwalin clapping his hand comfortingly on Bilbo’s shoulder.</p>\n<p>That was such a surreal sight that Thorin was fairly convinced he was still dead.</p>\n<p>Thorin slept. He slept and woke and slept again, more sleeping than waking. His conscious hours lasted no longer than the time it took to pour a little broth down his throat. He was never sure who was doing it except when it was Bilbo’s hands that tilted his head back and stroked his cheek when he was done. Even after the quest, Bilbo’s hands were softer than any other that Thorin had ever known.</p>\n<p>Once when he woke, Gandalf was there, puffing as happily on his pipe as if the hospital tent had been his private parlor. “You’re lucky,” Gandalf said simply. “That foolhardy plan of yours could have gone very differently.”</p>\n<p>Thorin groaned. That was about the most he could manage.</p>\n<p>And he slept. Eventually he slept less. Oin fussed over him tremendously, but there wasn’t much Thorin could do about it considering that raising his arms seemed like the most heroic feat imaginable. His nephews were faring better. Fili’s fall had shattered a leg, but dwarves were deft hands at whittling new ones as needed. By the time that Thorin was just managing to start sitting up in bed, Oin had turned Fili into a second pair of hands. “At least then I can <em>pretend</em> he’s helping to heal his brother every time the two of them escape for hours,” Oin grumbled.</p>\n<p>The wounded stayed in medical tents outside the walls of Erebor. Elven medical tents, Thorin realized with horror, but not even Dwalin would indulge his outrage on this one. “You want to put the sick and the dying next to the dragon shit,” Dwalin said, “you be my guest. Me, I’m fine with Thranduil footing the bill for all this.”</p>\n<p>When he put it that way, how could Thorin resist? Oin eventually had to tell Thorin to stop encouraging young dwarf medics to wreck anything that seemed expensive. “He’ll charge Erebor for the cost,” Oin pointed out.</p>\n<p>Thorin weighted that in his mind. “But it will inconvenience him in the short run.”</p>\n<p>As he finished up checking Thorin’s bandages, Bilbo rolled his eyes. “It’s good to know that you getting over your gold sickness hasn’t made you a better person,” he said, his fingers so delicately taping down the fresh gauze that Thorin couldn’t feel it—a welcome shift from his reaction to Oin’s considerably gruffer approach, which could be summed up as <em>feeling it entirely too much so as to make sure that reckless dwarves don’t do this sort of nonsense again.</em></p>\n<p>“Haven’t you heard you should be kind to the wounded?” Thorin said.</p>\n<p>Bilbo snorted and flicked the only place on Thorin’s chest that wasn’t mottled purple with bruises.</p>\n<p>Bilbo had come in everyday to tend to Thorin. Oin said he’d been there as Thorin slept as well. Thorin wasn’t his only charge, of course. Hobbits, it turned out, had precisely the right temperament for healing, and so Bilbo spread his talents through the wounded camp. Some days Thorin saw him for just moment as he passed on, presumably to someone in more imminent risk of dying. Just last Monday, Bilbo had rushed into Thorin’s tent, held his hand to Thorin’s forehead, said, “Drink more water,” and ran out again.</p>\n<p>But that was a rare thing these days. Now, whoever was still left alive was either up and about like Fili or in it for the long haul like Thorin. Thorin had slept through the days when the pyres had burned. Death being more infrequent now, the mourners could afford a little more craftsmanship. Bard himself had thanked the dwarves. “Pine coffins may seem a luxury when we’ve yet to rebuild our homes,” he’d said, “but we ought to give the dead some dignity.”</p>\n<p>When he was gone, Bilbo had given Thorin a small, tired smile and said, “I won’t mention the whole ‘commoner’s funeral’ thing to him if you don’t.”</p>\n<p>Less death meant more free time, at least for the medics. And Bilbo spent his free time, by and large, with Thorin, which made up quite a good deal for the sword wound in his stomach (as did, obviously, Erebor, but that was still a more distant pleasure and pride, and Thorin was still not entirely convinced that everyone wasn’t just lying to him about there being a reconstruction project just to make sure that he’d be a better patient). The two of them had talked plenty over the course of the quest—<em>plenty</em>, as Dwalin had been happy to point out—but it was one thing to snatch conversation while you waited for Dori to ford the stream or Bofur to realize that Kili had knotted his laces together, but it was quite another to sit in one place for hours, days, <em>weeks</em>, with nothing much to do except chat. And sleep. And chat again. Thorin got used to Bilbo climbing up into bed beside him and nodding off after a long shift. You give him twenty minutes like that, his head buried in Thorin’s stronger shoulder, and then Bilbo was good to go for another ten hours.</p>\n<p>Today Bilbo came into Thorin’s tent like he’d fallen down a particularly sooty chimney and said, “The good news is that your nephews are fully healed. The bad news is that your nephews are fully healed.”</p>\n<p>“Are they up to their old tricks?” Thorin asked as Bilbo went over to the water basin on the bedside table.</p>\n<p>“Worse, it was an accident so you can’t even be that mad at them. They were helping Dain’s men move the heating fuel and managed to cover half of the training fields in coal dust,” Bilbo said. When he thrust his hands into the water, the water turned black. “We’ve spent the last hour cleaning it up.”</p>\n<p>“And is it clean?”</p>\n<p>Bilbo laughed. “No, not at all, but we realized that we could leave those two to clean it up themselves.”</p>\n<p>“I love my nephews,” Thorin said, “and yet I am very glad that Balin and Dain are the acting joint heads of government right now.”</p>\n<p>“So are Fili and Kili.” Bilbo dunked his face. When he came back up, eyes squeezed shut and the front of his curls sopping, he fumbled for a washcloth and said, “You know, the active heads of government are keen for you to become the actual head of government.”</p>\n<p>Thorin groaned, as he wouldn’t have if there were anyone else listening. “I know.”</p>\n<p>It wasn’t the first time they’d talked about this. With Thorin’s wounds nearly healed—or, more accurately, as healed as they were going to be anytime soon—it was time to transfer power back to the rightful king. Thorin hated this plan. It had been his suggestion, and he still hated this plan, which meant that it was shocking similar to most of his plans.</p>\n<p>“Only you could sound miserable about achieving everything you ever wanted,” Bilbo said. “How do I look?”</p>\n<p>“You’ve got from soot-smeared to grey,” Thorin said. Bilbo muttered something under his breath that sounded very unkind towards Thorin’s nephews. “And it isn’t as if I did such a good job the last time I was king.”</p>\n<p>Bilbo dipped his washcloth in Thorin’s drinking water and started scrubbing his face. “The first time I tried to steal something for you, I got the entire company captured by trolls. Who’s good at a job on their first day?”</p>\n<p>Thorin scowled. “That’s different.”</p>\n<p>“Posh,” Bilbo said. “You were born to be king, Thorin, and knowing what not to do is as valuable as knowing what to do. If you need help with the rest, just ask one of your faithful advisors for it.”</p>\n<p>“So Dwalin, Balin, or you,” Thorin said.</p>\n<p>“Power, wisdom, and common sense. What more could you need?” Bilbo pointed to his face. “Am I still goblin grey?”</p>\n<p>“Pink as a rose. And about as threatening.”</p>\n<p>Bilbo rolled his eyes. “Thank you, Thorin.”</p>\n<p>“You’re welcome, Bilbo.”</p>\n<p>The name rolled of Thorin’s tongue so easily these days. At the height of his sickness, that was one thing he’d thought correctly at least. Bilbo’s name fit. It fit Bilbo. It fit Thorin. When he had been barely conscious after being coaxed back to the land of the living, he’d murmured it like a prayer. And it worked better than any prayer Thorin had offered before. When you called on Bilbo, he actually helped.</p>\n<p>And Thorin had been right not to ask. He’d learned Bilbo’s name anyway, and Bilbo was none the wiser about Thorin’s ignorance. He’d gotten away with it, Thorin thought. He’d actually gotten away with it.</p>\n<p>That didn’t seem right.</p>\n<p>“I didn’t know your name until Balin told me outside the secret door,” Thorin blurted out.</p>\n<p>Bilbo paused halfway through wringing out his washcloth. “What was that?”</p>\n<p>Thorin gritted his teeth and committed. “I didn’t know your name. Your first name. I didn’t know it.”</p>\n<p>Bilbo still looked like he was trying to understand what Thorin had just said. “You didn’t—I don’t understand, you didn’t know my name?”</p>\n<p>“No.” Thorin pushed himself up in bed. Instinctually, Bilbo pushed him back down again. “I didn’t realize I didn’t know it until you saved me.”</p>\n<p>“Which time?” Bilbo asked, staring down at Thorin in bafflement.</p>\n<p>“The first time,” Thorin said quickly. “I’ve felt bad for a very long while. If that helps.” Bilbo kept staring down at him. “Dwalin, Fili, and Kili were helping me secretly learn your name.” Thorin paused for a moment. “They were not helpful.”</p>\n<p>“You weren’t joking in Laketown,” Bilbo said, bewildered. “When you said you didn’t know my name, you weren’t joking.”</p>\n<p>Thorin winced. “I was trying to make you laugh?” he offered.</p>\n<p>“But you were also hoping that I would say my name in the process. Because you didn’t know it.” Bilbo sat on the edge of the bed, his look of confusion unchanged. “You never called me anything but Mr. Baggins and burglar. I just thought you were simultaneously very formal and slightly rude.”</p>\n<p>Thorin couldn’t exactly deny that description.</p>\n<p>“Why didn’t you just ask someone?” Then Bilbo shook himself. “Of course you couldn’t ask anyone. Anyone in this party would tell me right away.” Bilbo looked back at Thorin. “Why didn’t you just ask me?”</p>\n<p>That was the question, wasn’t it? Thorin opened and closed his mouth a few times. Bilbo kept staring at him like he was the strangest thing he’d ever seen. “I’d done enough to make you feel like you didn’t belong with us,” Thorin said at last. “I didn’t want to make you feel like that again.”</p>\n<p>The bafflement didn’t leave Bilbo’s face at that. In fact it stayed there for a very long while. But then it slid into grin so bright that Thorin had to turn away. “Well,” Bilbo said, shaking his head. He might have been blushing. But on the other hand, that might have just been the last pinkness from his vigorous face washing. “That was a noble thing done very stupidly.” He remembered the washcloth he was holding and started scrubbing his hands clean. “So it’s perfectly in character, I suppose.”</p>\n<p>“I am so sorry,” Thorin said.</p>\n<p>Bilbo glanced up at Thorin. “I stole the one thing you valued most and spent most of the quest doing a very unflattering impression of you behind your back.” He tossed the blackened washcloth in the basin behind him.  “We’ve both done things we regret regarding each other.”</p>\n<p>Thorin frowned. “What impression?”</p>\n<p>Bilbo gave Thorin such a stern look that Thorin sat up straighter. “We have merriment,” Bilbo growled, “when the mountain is ours again.” Then the darkness lifted from his face and he shrugged. “That, more or less. It passed the time.”</p>\n<p>“And my kin let this happen?” Thorin thought of Fili and Kili. “Of course they did.”</p>\n<p>“Your closest kin were my greatest encouragers,” Bilbo said. “They really helped me master the way you spit out words you don’t like. <em>Elves</em>. <em>Fun</em>. <em>Proper rest and healing</em>. It’s quite cathartic, I’ve been using it a lot during reconstruction councils when Balin asks me to sit in. Now everyone listens to me because they think I’m a little frightening, as opposed to before when they listened because they thought that I was your very good friend. I’ll have to correct them at the next council.”</p>\n<p>Thorin grabbed Bilbo’s arm. “You are my friend.”</p>\n<p>Bilbo rested his hand on Thorin’s. “I know, Thorin. You’re not subtle. And I’m not mad, I promise. Whatever things we have to forgive each other for, let’s forgive them. Big and small.” Bilbo squeezed Thorin’s hand. It was also easy with Bilbo, always. Thorin didn’t trust that easiness. Nothing in his life had ever come so easily before as Bilbo Baggins’ good favor. “Besides, you do know my name <em>now</em>. You—you do know my name now?”</p>\n<p>“Of course,” Thorin said. “It’s Bilbi.”</p>\n<p>Bilbo looked at him with dead eyes.</p>\n<p>“I’m sorry, I know it’s Bilbo,” Thorin added after a moment.</p>\n<p>“Do you?” Bilbo said. “Or are you going to spend a year haplessly investigating whether or not my name is Bilbi Baggins.”</p>\n<p>“No because I’ve learned a valuable lesson about asking people when I have a question,” Thorin said. “For example. What is your name?”</p>\n<p>“Oh, it’s Bilbi.” Bilbo bowed his head. “Bilbi Boggins at your service.”  </p>\n<p>“You know, you’re more of a prick than I once thought,” Thorin said.</p>\n<p>“Funny, that’s something Dwalin was just saying about you. However, I, Bilbi Boggins, always knew you were a prick.”</p>\n<p>“Your name is Bilbo Baggins of Bag End at the top of a little hill overlooking the street,” Thorin said. “You don’t like cabbage, you do like carrots, your mother told you tales of all sorts of dragons and princesses when you were young, you’ve feared wolves ever since the Fell Winter, you’re the bravest companion I’ve ever known, and you’ve already scoped out gardening plots on our mountain.”</p>\n<p>“I’m also good at sewing and bad at figures,” Bilbo said, smiling. “If you’re trying to list everything about me, you’ve a bit more to go.”</p>\n<p>“I’m just trying to say that I know you.” Thorin’s hand was still on Bilbo’s arm, nestled in the crook of his elbow. Thorin’s thumb rubbed circles in Bilbo’s soft skin. “Even if some facts took longer to learn than they should have.”</p>\n<p>Bilbo wound his fingers through Thorin’s. “Well,” Bilbo said again and shook his head and laughed. “Thank you.” He smiled at Thorin. Thorin smiled back. “You know that your nephews know my name, right?” Bilbo asked.</p>\n<p>“Of course they do now,” Thorin said. And then he said, “Wait.”</p>\n<p>“The entire quest,” Bilbo said. “They always called me Bilbo. Except when you were there. Then they called me Mr. Baggins, I assumed out of politeness. I’m thinking it was the opposite.”</p>\n<p>“Do you have any descendants that you’d like to make the heirs of Erebor?” Thorin asked. “My own about to get killed.”</p>\n<p>“It’s not your fault you didn’t just ask me.”</p>\n<p>“They actively advised me not to!”</p>\n<p>“And you took their advice? You need me to stick around Erebor more than I thought.”</p>\n<p>“Well,” Thorin said like the answer to that should have been obvious, “yes.”</p>\n<p>The flap to the tent flew open and Dwalin stomped in, Fili and Kili bounding in his wake. They were both about as sooty as Bilbo had been, though Dwalin looked considerably more grumpy about it and his nephews looked considerably less. “Tell your sister she birthed two demons,” Dwalin growled.</p>\n<p>“Oh, it’s cleaned up now,” Kili said.</p>\n<p>“All back where it belongs,” Fili said.</p>\n<p>“You know, we probably shouldn’t have brought this much coal dust into a medical tent,” Bilbo said.</p>\n<p>Dwalin snorted. “The day a little coal kills a dwarf is the day that dwarf deserves to die.”</p>\n<p>“Yes, very good point, Dwalin,” Bilbo said. “Callous but principled, I suppose. Also, what is my name?”</p>\n<p>Dwalin stiffened. Fili and Kili looked like they couldn’t be happier. “He found out?” Fili asked, beaming.</p>\n<p>“I told him,” Thorin said. He stared his nephews down until their glee started to dim a little. “As you should have told me.”</p>\n<p>Kili grabbed his brother’s arm. “He’s still bed-bound,” he said, and they sprinted out of the tent.</p>\n<p>“I’m disinheriting you!” Thorin shouted after them. Their response sounded disturbingly like laughter.</p>\n<p>Bilbo raised his eyebrow at Dwalin. “Well?”</p>\n<p>“It definitely starts with a B,” Dwalin said.</p>\n<p>“How do you still not know?” Thorin asked.</p>\n<p>Dwalin shrugged. “I’m a simple dwarf.”</p>\n<p>“We eat dinner together four nights a week,” Bilbo said.</p>\n<p>“Don’t tell Balin.”</p>\n<p>Bilbo snorted. “I’m telling Balin about every bit of this.”</p>\n<p>Dwalin grimaced, but he didn’t protest. Thorin didn’t envy him the scolding he was about to get. Of course, Thorin would be getting one of his own, but maybe he could feign some severe injury halfway through it. There were very few benefits to getting stabbed and Thorin ought to make the most of the ones he got.</p>\n<p>“What is your name then?” Dwalin asked.</p>\n<p>“It’s Bilbi,” Thorin said.</p>\n<p>Bilbo punched him in the shoulder. Thorin pushed him off the bed. It was strange, Thorin thought as Bilbo made the most offended noise possible as he hit the ground. It wasn’t that this was the happiest he’d ever been, or any nonsense like that. It was just that the happiness underneath his feet felt a little more secure than it had before.</p>\n<p>“You’re a bastard, Thorin Oakenshield!” Bilbo shouted from the floor as Dwalin roared with laughter.</p>\n<p>Yes. This happiness felt very secure indeed.</p>"
}