{
  "id": "3509384",
  "url": "https://archiveofourown.org/works/3509384?view_full_work=true",
  "author": [
    "ebenroot"
  ],
  "title": "pretty girls make me nervous",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Haikyuu!!"
  ],
  "relationships": [
    "Kozume Kenma/Kuroo Tetsurou",
    "with mentions of daisuga",
    "kagehina",
    "BokuAka"
  ],
  "characters": [
    "Kozume Kenma",
    "Kuroo Tetsurou",
    "a good handful of karasuno",
    "and another good handful of nekoma"
  ],
  "additional_tags": [
    "Misunderstandings",
    "so oblivious it hurts!kuroo",
    "so bad at games it hurts!daichi",
    "so frustated with games it hurts!kenma",
    "so done with everything!yaku",
    "and it goes on from there"
  ],
  "language": "English",
  "series": "",
  "published": "2015-03-09",
  "completed": null,
  "words": "6,906",
  "chapters": "1/1",
  "comments": "199",
  "kudos": "15,523",
  "bookmarks": "2,460",
  "hits": "149,844",
  "summary": "<p>(Yaku had to wonder if his captain was listening to himself talk and could realize on his own how much he sounded in love with Kenma.) </p>\n<p>\"So, what is going to happen is this! Friday night, Kenma will be going to the mall with no video games around. His natural attractiveness will show, some love struck girl will ask him out and bam! Kenma isn't single anymore.\"</p>\n<p>(Yaku supposed not.)</p>\n<p>or</p>\n<p>that fic where Kuroo does everything he can to get Kenma a significant other. Meanwhile, everyone bets how long it'll take before Kuroo realizes that Kenma's sorta already dating him.</p>",
  "notes": "<p>so i was GOING to update my other fic i have going on right now but then nekoma's ova happened and i jsut</p>\n<p>also, i listened to the drama cd where karasuno tries to figure out why noya isn't popular and i'm like 'where is our nekoma drama cd with silly team discussions?' and then a fic was born. a very cracky fic that probably has a REALLY OOC kuroo that is probably best enjoyed if you do not think about it too hard</p>\n<p>i'm probably never going to write a haikyuu fic that has a title that properly matches the content of the story (but the song is super catchy tho [from 'Pretty Girls' by Simon and Milo])</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>this fic needed more oikawa</p>\n<p>and i kinda wanna write a companion fic to this where daichi finally finds the game he is good at (gOD HOW HE PLAYED THAT VIDEO GAME IN THE OVA THAT'S SUCH A DAD THING TO DO. 'JUST BLOCK') and everyone plays games and more oikawa but that's another story for another day</p>",
  "text": "<p>\"When we decided to do this 'every Saturday captain meet-up/play cards and bond day', I thought we would always play poker.\"</p>\n<p>\"You cheat. Bokuto, got any threes?\"</p>\n<p>\"Go-Fish.\"</p>\n<p>Kuroo scowled, watching as Daichi plucked a card from the stack to place in his hand. Kuroo wasn't even sure how this little tradition started. Something about strengthening bonds and good sportsmanship or whatever. All Kuroo knew was that he and Bokuto were hanging out in the mall and ran into Daichi, and then it suddenly turned into. . .a thing. It wasn't like any other captains in the prefectures met up to hang out. Matter of fact, it usually <em>was </em>just them three with maybe Kaname asking to hang out and relieve stress every once in a blue moon and Oikawa just showing up without being invited every fall Equinox.</p>\n<p>Kuroo waited for Bokuto to take the fours he asked from him and laid them out before he piped up again. \"I don't cheat, you just suck at it.\"</p>\n<p>\"What would we even play poker with? You took all our money last month,” Daichi said with a frown.</p>\n<p>\"That was a different time. And I didn't cheat. Got any twos?\"</p>\n<p>Daichi begrudgingly handed over two cards and Kuroo laid them down in front of him to make his fourth set. Ok, so he was unreasonably good with cards. Not his fault he was born with a face meant to play poker.</p>\n<p>\"By the way, I won't be able to come to our little 'get together' next week,\" Daichi spoke, asking Bokuto for ones and having to draw from the pile yet again. Kuroo raised an eyebrow.</p>\n<p>\"Why not?\"</p>\n<p>\"I have a date.\"</p>\n<p>There was a collective '<em>oh ho?' </em>from Kuroo and Bokuto, both boys looking expectantly at Daichi to go on and Daichi frowned. \"Why is it that whenever I bring up dating or Sugawara, you guys always want to know about it?\"</p>\n<p>\"Cause it's cute how blushy you get, Sawamura,\" Kuroo said with a grin and Daichi frowned, averting his eyes as he shuffled his cards in his hands.</p>\n<p>\"Whatever. We're just going to go to the movies and get a burger or something. It's nothing to get all 'blushy' about,\" Daichi said with a blushy blush. Kuroo snickered, looking over at Bokuto.</p>\n<p>\"Guess it's just you and me then. Wanna go to the theme park?\"</p>\n<p>Bokuto gave the back of his head a scratch. \"Actually, Akaashi asked me to have next week free. We're going to the zoo, there's a new exhibit on the <em>bubo virginanus</em>. That's smart people talk for the great horned owl,\" Bokuto explained to his less knowledgeable friends. Kuroo frowned and sighed.</p>\n<p>\"Whatever then. I guess I'll hang out with Kenma.\" Which most likely meant bugging Kenma to put down his DS for a while to go and do something.</p>\n<p>\"Dude, did you ever notice how all of the setters are dating someone?\" Bokuto asked and Kuroo raised an eyebrow. \"Suga is with Daichi, Akaashi's with me, Oikawa is with someone new every week-actually that shouldn't count, but regardless!\"</p>\n<p>\"Are we going to finish the game?\" Daichi asked and Kuroo rubbed his chin. Bokuto did have a point. Not like it's anything wrong with his best bro being happy with someone he loved, or Daichi and Suga acting even <em>more </em>like a lovey-dovey couple (though he did get kind of irked when Oikawa would show up and compare his conquests to theirs). But then he thought of his own setter. Kozume Kenma, with his golden cat-like eyes, his blond dyed locks, and his endearing trait of having no social skills.</p>\n<p>Kenma wasn't dating anyone.</p>\n<p>It almost felt like the world stopped spinning at the sudden realization that not just his dear friend since childhood was single, but probably the only setter in the prefecture that wasn't getting any action of the adult variety. It almost felt like a personal attack on Kuroo's duty as both a captain and a best friend. Why <em>wasn't </em>Kenma dating anyone, or at least showing moderate interest in someone? Kenma was nice and smart, and he may have a dry sort of humor but he could be funny! This was just too pressing of a matter to just leave alone!</p>\n<p>Kuroo shot up from the table and slammed his hands on his pile of cards.</p>\n<p>\"I need to go. There's a situation that I need to take care of,\" he said with determination in his eyes. Daichi gestured to the cards in front of him.</p>\n<p>\"But we haven't finished the game!\"</p>\n<p>\"Sawamura, it's kind of obvious that you lost.\"</p>\n<p>\"B-Because you cheated!\" Daichi looked at the cards Kuroo placed down. \"I asked you if you had any queens and you said no and you <em>do </em>have them!\"</p>\n<p>\"See you guys!\" Kuroo responded with a wave and complete dismissal of Daichi's plight, grabbing his jacket and his bag off the hook to leave Bokuto's room. Daichi stared, then looked down at his own hand of cards before tossing them onto the table. He leaned back in his chair and looked at the ceiling.</p>\n<p>\"Next time we meet up, we play checkers.\"</p>\n<p> </p>\n<p>The afternoon is a precious time for both practice and team bonding. On Tuesday, Kuroo had everyone stay after practice so he could have an important discussion with them, captain to his fellow teammates. Kuroo had with him the whiteboard they usually used to discuss plays, taking the marker and writing in big bold words '<strong>Why is Kenma single? Suggestions?</strong>'.</p>\n<p>Everyone's eyes went to Kenma in general confusion. Kenma was already preoccupied with his DS and unaware of the attention. Frankly, the whole world could disappear, so long as he finally beaten that damn demon king.</p>\n<p>\"Uh, what the heck is this?\" Yaku asked and Kuroo capped the marker.</p>\n<p>\"This,\" he gestured to the whiteboard, \"is a team building exercise. Kenma!\"</p>\n<p>Kenma jumped at his name being called, right as the demon king struck his paladin with hellfire and gave an instant game over. He furrowed his eyebrows at the game's screen before he turned and looked at the topic of discussion for today. \"Do you know that you're the only setter <em>not</em> dating anyone?\"</p>\n<p>Kenma opened his mouth to speak. \"Don't say 'It doesn't matter' or 'I don't care' because it <em>does </em>matter and you <em>should </em>care. We all should care! They say behind every great setter is a great partner,\" Kuroo spoke before Kenma could make and sound, and Kenma closed his mouth.</p>\n<p>\"Do they really say that?\" Inuoka asked and Kuroo placed hands on his hips.</p>\n<p>\"If they don't, they should.\"</p>\n<p>\"What about a great ace?\" Lev asked and Yamamoto laughed.</p>\n<p>\"Whatever they do say, it <em>definitely</em> doesn't have anything to do with you.\"</p>\n<p>\"Back to the topic! How can we get Kenma a date?\" Kuroo shouted, clapping his hands to get everyone's attention. All was silent, everyone's eyes darting around rather confused as if they didn't know how to approach such a topic, until Yamamoto raised his hand. \"Yamamoto, what is it?\"</p>\n<p>\"How come you never did this for me? <em>I </em>want to learn how to talk to girls and get a date too,\" he replied and Kuroo sighed.</p>\n<p>\"I'm just a captain, not a miracle worker. Someone else have a suggestion?\"</p>\n<p>Yamamoto squawked before scowling. Tch, like he needed advice from Kuroo anyways when he can just ask Tanaka. All was silent once more, Kenma starting up his game again to vanquish the demon king. Lev raised his hand. \"Yeah, Lev?\"</p>\n<p>\"Because he's short?\" Lev suggested and Yaku shot him a look like he was personally offended for Kenma.</p>\n<p>\"What does <em>that </em>have to do with anything?\" Yaku asked and Lev shrugged.</p>\n<p>\"I don't know. Maybe being short isn't attractive? That doesn't apply to you though, I still think you're cute.\"</p>\n<p>Yaku responded by pulling hard on Lev's cheek and hissing for him to shut up. Kuroo rolled his eyes; personally, he thought Kenma's short height was kind of endearing in a way. He liked it when those golden eyes looked up at him, made him feel all fuzzy inside like a little cat was looking at him. How did no one else feel that way? Regardless, he wrote down '<strong>height</strong>' and turned back to the team.</p>\n<p>\"Ok! Another suggestion!\"</p>\n<p>His team was obviously not on a roll here, still sitting there quietly like they honestly didn't know what was going on or why this was happening. So Lev raised his hand again.</p>\n<p>\"He has no social skills,\" he blurted out and Kenma side-eyed him, his finger slipping on the 'X' button to cast a spell in the wrong direction and create an opening for the demon king to hit him with that damn hellfire attack. The words '<strong>GAME OVER</strong>' flashed on the screen and Kenma put the device to his forehead to groan.</p>\n<p>\"Hmm, yeah that is true,\" Kuroo responded and wrote down '<strong>needs better communication skills</strong>'. \"Someone else have a - I think we have enough suggestions from you, Lev,” Lev placed his hand down, “Anyone <em>else</em>?\"</p>\n<p>Inuoka raised his hand. \"Maybe if there was a girl in real life that was like the girls in his video game, he'd be more interested in them!\"</p>\n<p>\"I don't really play visual novels. So I doubt that would work,\" Kenma piped up. This time for <em>sure </em>he'll get that demon king.</p>\n<p>\"Maybe he's not interested in anyone else right now and we should just accept that,\" Yaku suggested and Kuroo pinched the bridge of his nose.</p>\n<p>\"You have all yet to say an important suggestion.\" Kuroo turned and began to write down his own suggestion, turning back to his team and slammed his hand on the surface of the board.</p>\n<p>'<strong><u>CUTE SPORTS MANAGER</u></strong>'</p>\n<p>\"Kenma needs daily personal interaction from girls! Therefore, we need a cute sports manager like Karasuno!\"</p>\n<p>\"Is <em>that </em>what this 'team bonding' exercise is about?\" Yaku muttered and Kuroo gestured to the board.</p>\n<p>\"Taking all of these suggestions, we now must devise a strategy. Yamamoto, you're in charge of finding us a cute manager.\"</p>\n<p>\"Wha-\"</p>\n<p>\"Yaku, you're in charge of helping Kenma with his people skills.\"</p>\n<p>Yaku just rubbed his head and sighed.</p>\n<p>\"And I'll see about making a date for Kenma with one of Karasuno's managers as a test run.\"</p>\n<p>There was a loud noise that sounded like someone flaying a cat (probably Yamamoto) and Kuroo clasped his hands together. \"Ok! Operation 'Get Kenma a Date' is a go! Good work today!\" Kuroo shouted, giving a wave goodbye before turning to head to the locker rooms. Everyone was still sitting on the floor, except for Yamamoto rolling back and forth sobbing 'It's not <em>fair</em>' over and over. Yaku turned to Kenma with a raised eyebrow.</p>\n<p>\"Did something happen between you two?\"</p>\n<p>\"Not that I know of.\"</p>\n<p>\"To be honest, I thought that Kenma and Kuroo were dating,\" Inuoka responded, a couple of 'Yeah's and 'Me too's sounding out. Kenma gave a nod like he figured the exact same thing and Yaku just groaned. The team sat there, Inuoka looking around confused. \"So. . .what do we do now?\"</p>\n<p>Lev raised his hand. \"Ten bucks says he doesn't figure it out until the end of the month.\"</p>\n<p> </p>\n<p>\"Hey Tsukki~\"</p>\n<p>Tsukishima closed his eyes. It was Friday, no practice, and all he wanted to was buy the new CD that came out and go home in peace. Yet here was Annoyance #1 in his bed head glory, leaning against the wall that housed the rock music. Tsukishima supposed it could be worse, Bokuto and Hinata could have been here too.</p>\n<p>\"What do you want?\"</p>\n<p>\"Are either of your managers seeing anyone?\" Kuroo asked and Tsukishima raised an eyebrow.</p>\n<p>\"If you even <em>think</em> about looking at Kiyoko, Nishinoya and Tanaka will throttle you.\" <em>Which might be entertaining, actually</em>, Tsukishima thought. Kuroo hummed.</p>\n<p>\"What about the little blonde one?\"</p>\n<p>Tsukishima thought about Yachi Hitoka, how her sweet and cute smile was always quick to be replaced with paranoid fear, and wondered just what the hell Kuroo would want with <em>her</em>.</p>\n<p>\"I don't know. It's not my business,\" Tsukishima replied off-handedly, continuing to search for the CD. Kuroo slid a little bit closer.</p>\n<p>\"Find out for me, ne?\"</p>\n<p>\"No.\"</p>\n<p>\"Tsukki~\"</p>\n<p>\"Stop calling me that.\"</p>\n<p>\"Come on, I'll give you something if you do it.\"</p>\n<p>\"There's nothing that you have that interests me.\"</p>\n<p>Kuroo gave that laugh that made Tsukishima shudder before a cutesy little dinosaur keychain was practically shoved into his face. Tsukishima blinked, then scowled.</p>\n<p>\"What makes you think I want that?\"</p>\n<p>\"I know about your little hobby. If you just do this itty-bitty favor for me, this baby could be yours,\" Kuroo replied, swinging the keychain back and forth like it was a hypnotic watch. Tsukishima crossed his arms.</p>\n<p>\"Where did you get it? From a Cracker Jack box?\"</p>\n<p>\"Actually I won it from a claw machine while I was with Kenma at the arcade. The point is, even if you <em>don't </em>take this, I'm just going to keep bugging you about it until you do. So you might as well accept my offer now.\"</p>\n<p>Tsukishima glared at the little plastic triceratops with blush stickers and starry eyes before he snatched the charm from Kuroo. \"Whatever, it'll be pointless anyways. I doubt either of them would be interested in dating you.\"</p>\n<p>Kuroo made a move as if he was stabbed in his heart and Tsukishima rolled his eyes. \"That hurts, Tsukki! But if you must know, I'm not asking for me. I'm asking for my setter.\"</p>\n<p>\"Your setter?\"</p>\n<p>\"Yeah. Let me know as soon as possible, ok?\" Kuroo said and turned with a wave to finally leave the boy alone. Tsukishima pocketed the keychain and went back to shifting through the CDs, thinking about the golden-eyed 'genius' setter he met before. Tch, with how much Kuroo talked about him through texts, Tsukishima thought Kuroo was already dating his setter.</p>\n<p> </p>\n<p>\"Would you rather have chocolate pudding that tasted like shit, or shit that tasted like chocolate pudding?\" Noya asked, tossing the volleyball in the air as he lied down on the bed.</p>\n<p>\"I've actually <em>had </em>chocolate pudding that tasted like shit so that wouldn't bother me,\" Tanaka responded with a shrug, scrolling through his phone and did his 20th spin in the desk chair. Noya hummed.</p>\n<p>\"What about you, Asahi?\"</p>\n<p>\"I'm <em>supposed </em>to be helping you two write your papers, remember?\" Asahi said with as much firmness as he can muster and Noya pouted.</p>\n<p>\"We need to get our creative juices flowing. Besides, they're not due til like two weeks from now. So, what would you rather eat?\" Noya asked with a devilish smirk and Asahi placed a hand to his head.</p>\n<p>\"They <em>both </em>are disgusting.\"</p>\n<p>\"Which one sounds <em>less </em>disgusting?\"</p>\n<p>\"Neither!\"</p>\n<p>\"WHAAAAAAAT?!\" Tanaka screamed all of a sudden and Asahi jumped in his spot on the floor as Tanaka shot up from his chair. \"Yamamoto said Nekoma’s captain wants to find out if our managers are single!\"</p>\n<p>\"Is he after our Kiyoko?!\" Noya shouted, suddenly standing on the bed and Asahi warned him to be careful with the same weak muster as before.</p>\n<p>\"He's not good enough for her!\" Tanaka shouted.</p>\n<p>\"How dare he even try to <em>think</em> he can go after her!\"</p>\n<p>\"Guys, maybe he's interested in Yachi-\"</p>\n<p>\"I'VE SEEN HOW HE LOOKS AT HIS SETTER, AND NOW HE'S TRYING TO GET AT KIYOKO!\"</p>\n<p>(Asahi's voice of reason was lost under the screaming.)</p>\n<p>\"KIYOKO DOESN'T NEED HIM! I WON'T ALLOW IT!\"</p>\n<p>\"AND IF HE EVEN TRIED TO FORCE HIMSELF ON HER-\"</p>\n<p>\"WE'RE GONNA KICK HIS BUTT!\"</p>\n<p>\"GRAHHHHHHHHH!\"</p>\n<p>\"AGGGGGGHHHHHHHH!\"</p>\n<p>And to Asahi's chagrin, it went on like that for pretty much the whole night.</p>\n<p> </p>\n<p>Nishinoya and Tanaka were following Kiyoko around begging her to allow them to walk her home after practice because apparently, some shady guy was going to try and confess to her and they were going to kick his ass. And like always, their ramblings were dismissed with a sigh of indifference (unless you were Noya and Tanaka, then the sigh was of distress and made it all the more important to walk her home!). Well, no point in bothering to ask her then.</p>\n<p>Tsukishima then walked over to where Yachi was currently putting away the volleyballs, hands in his pockets and usual 'whatever' expression on his face.</p>\n<p>\"Yachi.\"</p>\n<p>\"Hmm? Oh, what is it Tsukishima?\"</p>\n<p>\"Are you seeing anyone right now?\"</p>\n<p>Yachi paused, hands gripping the volleyball tight as she stared at the taller boy before her. Sure, Tsukishima was cute (intimidating when you get up close to him, but cute); matter of fact, a lot of girls in her class was interested in him. Yet, he was asking if <em>she </em>was single? Was he. . .interested? Would Yachi become the target of all Tsukishima fan girls and subject to endless torture because she had his attention?</p>\n<p>Wait, what if they didn't work out and they had to break up? Then it would be <em>super </em>awkward having to see each other at practice all the time. What if it got so awkward that Tsukishima quit? He couldn't quit! What if he quits and then Yamaguchi quits? Then everyone starts quitting and the male volleyball team would be disbanded all because Yachi started dating Tsukishima and things got <em>awkward</em>.</p>\n<p>Tsukishima raised an eyebrow and Yachi jumped. She was taking too long to respond to his confession! What if she hurts his feelings because she didn't want things to get awkward and it still became awkward?! <em>Was this even a confession?!?! </em>What if she was just misreading the situation and now Tsukishima would think that she has a crush on him which would be <em>awkward and</em>-</p>\n<p>\"You know what, never mind. Forget I asked,\" Tsukishima said to Yachi still trying to deduce the pros and cons of dating Tsukishima. He turned and opened the door to leave, faintly hearing Yachi blurt out 'I didn't mean to make it awkward!' before he closed the door. Well, can't say he didn't try.</p>\n<p>Tsukishima took out his cell phone and went to Kuroo's contact as the door opened again and Yamaguchi stepped out.</p>\n<p>\"Good work today!\" Yamaguchi chirped and Tsukishima mumbled back in response. Yamaguchi leaned against the wall next to his friend, humming in interest when he saw the little dinosaur attached to his friend's cell phone. \"Oh, this is a cute keychain! Where did you get it?\"</p>\n<p>\"Shut up, Yamaguchi,\" Tsukishima muttered, Yamaguchi seeing the faintest red of embarrassment tinting the blond's cheek. Yamaguchi only smiled as Tsukishima pocketed his phone, the two of them starting off on their walk back home.</p>\n<p> </p>\n<p>\n<strong>5:25 pm</strong>\n</p>\n<p>\n<strong>Tsukki:</strong>\n</p>\n<p>\n<strong>They're not interested</strong>\n</p>\n<p>\"Tch.\"</p>\n<p>\"What?\"</p>\n<p>\"Tsukki said that none of Karasuno's managers are interested,\" Kuroo said with a frown, slipping his phone into his pocket. What the heck, how come they can't see what a catch Kenma is? Kenma hummed.</p>\n<p>\"Oh, that.\"</p>\n<p>\"What do you mean 'that'?\"</p>\n<p>\"Don't you think this is unnecessary?\" Kenma asked, tilting his PSP from side to side. He was taking a break from killing the demon king on his DS to replay another RPG to prep him for the sequel coming out, Kuroo standing next to him in the line outside the store to buy it.</p>\n<p>\"Well sorry for being concerned about your sex life, or rather <em>lack of</em>,\" Kuroo said obnoxiously loud.</p>\n<p>Kenma quickly hid his face in embarrassment and his character walked into a wall. Kuroo smiled, he's just so cute when he got all flustered. Kenma placed his character back on the right path again, eyebrows furrowed and biting his lower lip.</p>\n<p>\"Well I would have a sex life if you-\"</p>\n<p>\"I know, I should have brought it up earlier. Well, we'll just have to move onto plan B,\" Kuroo said, cutting off Kenma and keeping the betting pool of 'how long will Kuroo realize he and Kenma are sort of already dating' alive. Kuroo glanced at his watch. \"Hey, when are they gonna open the doors for us to buy this game?\"</p>\n<p>\"Couple more hours.\"</p>\n<p>\"Want to get something to eat afterwards? My treat.\"</p>\n<p>Kenma nodded.</p>\n<p> </p>\n<p>\"He couldn't make it today?\"</p>\n<p>\"He texted me saying he had to put plan B of his 'get Kenma laid' operation into action,\" Bokuto replied and Daichi furrowed his eyebrows.</p>\n<p>\"I thought him and Kenma-\"</p>\n<p>\"Dude, <em>everyone </em>sees it but him. There's actually a betting pool going on for how long it'll take for him to realize it, you want in on it?\"</p>\n<p>\"I'll pass.\" With Daichi's luck, he'll probably lose. Bokuto hummed and moved his checker piece, taking the last of Daichi's red pieces.</p>\n<p>\"King me,\" Bokuto announced with a majestic air and Daichi hung his head in defeat.</p>\n<p>\"Best two out of three?\"</p>\n<p> </p>\n<p>'<strong>Plan B: Observation</strong>'</p>\n<p>\"Are we <em>still </em>wasting time on this? Kuroo, Kenma likes-\"</p>\n<p>\"Games too much!\" Lev (who changed his bet to two months passing before Kuroo found out and had the pool around $60) quickly cut Yaku off. Kuroo pointed at Lev in affirmation.</p>\n<p>\"Exactly! Which is why Plan B is going to work! Because Kenma is always absorbed in his game, no one around him sees how dateable he really is!\"</p>\n<p>(Yaku had to wonder if his captain was listening to himself talk and could realize on his own how much he sounded in love with Kenma.)</p>\n<p>\"So, what is going to happen is this! Friday night, Kenma will be going to the mall with <em>no </em>video games around. His natural attractiveness will show, some love struck girl will ask him out and bam! Kenma isn't single anymore.\"</p>\n<p>(Yaku supposed not.)</p>\n<p>\"Don't you think it's more preferable for someone to like <em>everything</em> about Kenma? Unhealthy obsession with video games and all?\" Kai (who lost five bucks because 'guys, Kuroo can't be <em>that</em> oblivious for it to last longer than two days') asked and Kuroo hummed.</p>\n<p>\"Well, that <em>is </em>true. . .ok, I'll do a compare and contrast! I'll be there to monitor Kenma's dateability both with and without playing games,\" Kuroo said, happy that this plan was coming together easier than the first one. \"Alright, good work today!\" Kuroo said and grabbed his bag to sling over his shoulder and head to the locker rooms.</p>\n<p>Yaku gave an irritated look at Lev. \"If this is still going on when we have our next practice, I'm telling him and there's nothing you can do to stop me.\"</p>\n<p> </p>\n<p>Kuroo realized that Friday night of the week that watching Kenma playing video games was kind of a game on its own. For Kuroo, he could count how many times Kenma poked his tongue out the corner of his mouth in concentration (currently 12), how many times did his eyes light up when he managed to level up his character (4 times counting), and how many times he would make that cute pout whenever his character died (that was 16 times, damn demon king and his hellfire attack).</p>\n<p>Kenma was out in the open on a bench in the food court, not really paying any attention to anyone around him or noticing if there were any cute girls looking his way. Kuroo was watching from a safe distance behind a wall so as to not intrude on any possible confessions. There were cute girls looking at him, but more in the 'why is he staring at that guy on the bench? So <em>creepy</em>' way than the interested way. He was pretty sure he spent a good half hour just watching Kenma play his video game, figuring that must be long enough for someone to take interest. When no one did, Kuroo moved from his observation spot to the bench Kenma was sitting on.</p>\n<p>\"Ok, time's up,\" Kuroo replied and Kenma paused the game, looking up at Kuroo with tired eyes.</p>\n<p>\"Are you sure you want to go through with this?\" Kenma asked as Kuroo took the DS.</p>\n<p>\"Kenma, as your dear childhood friend, I want you to be happy and be able to be with someone you love.\"</p>\n<p>Kenma frowned, then blushed, then pulled the hood of his jacket over his head and mumbled, \"I love you.\"</p>\n<p>\"Oh? I love you too, that's why I'm doing this. Hand over the PSP as well, I know you have it.\"</p>\n<p>Kenma only stared in disbelief before he reached into the pocket of his hoodie and handed Kuroo the other gaming device. \"Ok, thirty more minutes like this. Afterwards, you wanna get some ice cream?\" Kuroo asked and Kenma shrugged.</p>\n<p>\"I guess. What am I supposed to do now? Just sit here?\"</p>\n<p>\"Just be you,\" Kuroo said with a thumbs up and before Kenma could ask 'literally what the heck did <em>that</em> mean', someone shouted out his name. \"Shit, that was quick,\" Kuroo said and, with his feline flexibility used for saving during volleyball matches, dove behind the nearest trash can to give Kenma some space.</p>\n<p>When he peeked to see who it was, to his disappointment it was just Shrimpy from Karasuno, running up to Kenma with bright eyes and a big smile. \"Oh? You're here by yourself?\" he asked and Kenma glanced at the trash can Kuroo was hiding behind.</p>\n<p>\"Sort of,\" he said and the orange-haired boy cocked his head to the side.</p>\n<p>\"Oh, ok. Hey, I've been meaning to ask you about that game you were telling me about. I got stuck on that one level where you have to find the jewel for the fairy, where is it supposed to be?\" Hinata asked, pulling out his own PSP and booting up his saved game as he spoke.</p>\n<p>Damn, Kuroo didn't see <em>this </em>coming.</p>\n<p>Hinata handed the PSP to Kenma, who took it and immediately guided Hinata's sorcerer to the right spot where the gem was hidden. \"It was there?! Man, I went past that spot a bunch of times!\"</p>\n<p>\"There's a big boss fight coming up once you give the gem to the fairy. Are you at least at level 40?\"</p>\n<p>\"No, I think I'm at 36.\"</p>\n<p>\"Ok, I'll just get your sorcerer up to 42 at least so you can fight the boss,\" Kenma replied, and it was like Kuroo could hear his Plan B being flushed down the toilet. Hinata made a noise of awe and thanked Kenma, rocking back and forth on his heels.</p>\n<p>\"Are you waiting for someone? Do you want to just walk around and talk?\"</p>\n<p>\"I don't mind,\" Kenma said and Hinata grinned. He moved close to look at the PSP screen, Kenma turning slightly red at the closeness before shaking off the feeling, and the two began to walk off to the west end of the mall as Hinata started talking about how volleyball practice was going.</p>\n<p>Kuroo emerged from his spot when they were a good distance away, not missing how Kenma's face flushed red when Hinata got close. Maybe he was overthinking things and the gesture meant nothing. Maybe there was more to that gesture and Kuroo may have found out why Kenma wasn't having any luck with girls. But for now, all he knew was that Plan B had failed.</p>\n<p> </p>\n<p>\"He's not showing up again?\"</p>\n<p>\"He said he was going through a crisis or something.\"</p>\n<p>\"How big is the pot?\"</p>\n<p>\"$100 bucks says he'll realize by the end of the month. I connected four again.\"</p>\n<p>Daichi blinked at the row of red pieces going in a diagonal direction. How did he <em>not </em>see that? He slammed fists on the table and Bokuto gave a cheeky grin.</p>\n<p>\"Scrabble! I'm good at Scrabble!\"</p>\n<p>It wasn't like it was a <em>bad </em>thing that Kenma might like Karasuno's number 10. Sure, it meant that he totally didn't bring into consideration that Kenma liked <em>boys </em>(which Kuroo definitely had no problem with), just that he figured that if Kenma was going to go gay for anyone, it would have been <em>him</em>. What did Shrimpy have that Kenma found attractive anyways? He was just as loud as Inuoka and just as crappy at volleyball as Lev was. Was he good at video games? No, that <em>can't </em>be the reason why. Kuroo considered himself to be good at video games too, whenever he and Kenma played games together at the arcade, he managed to be a worthy opponent (he’d <em>lose</em> but it’d be a damn good fight).</p>\n<p>Kuroo was currently stewing over the matter as he walked to the school of Kenma's possible crush in question. He was just curious and therefore, had to put his Plan C '<strike>Interrogate</strike> Observe #10' into motion. He was happy that Kenma was able to make a close friend like the small middle blocker, he just needed to know when did that friendship cross the line and turned into romance.</p>\n<p>More importantly, he had to know if the orange haired boy reciprocated Kenma's feelings. Because dammit, Kenma deserved someone who would do everything for him. Stand outside in the cold to get a video game for him when he was sick, listen to him enthuse about games (even if they didn’t know what the difference was between a Cleric and a Mage), adore every expression that crossed Kenma's face, if Shrimpy wasn't willing to do it all for Kenma, then he had no business being with him.</p>\n<p>As he passed by a convenience store, someone walked out and bumped right into him. He barely heard their apology through the mouthful of meatbun, turning to see his target looking up at him with wide eyes.</p>\n<p>Skip the observation.</p>\n<p>\"Yo, Shrimpy.\" </p>\n<p>\"Oh! You're that shady captain of Nekoma!\"</p>\n<p>\"I have a name, you know,\" Kuroo replied. Sheesh, didn't Daichi enforce his team to use manners? Hinata hummed and tapped his chin.</p>\n<p>\"Yeah, Kenma mentioned your name. . .ah, Kuroo, right?\"</p>\n<p>Kenma talked about him with Shrimpy? But why didn't Kenma ever bring up his crush on the boy with Kuroo? Did he not think he could come to him about this? Maybe that was why he wanted to stop, because he didn't want Kuroo to find out. . .but they were <em>friends</em>! Friends don't hide something like this! \"Um, you know, when you glare at me like that, I feel like I've done something wrong,\" Hinata said with a nervous laugh.</p>\n<p>\"This is my normal face,\" Kuroo said with his 'not-glare' and stepped closer. \"I want you to know that if you're going to be Kenma's boyfriend, you got to take good care of him.\"</p>\n<p>\". . .Kenma's. . .<em>ehhhh?</em>\"</p>\n<p>\"I need to know, do you feel the same way about him? Like love him more than anything? You <em>better </em>not hurt him or-\" Kuroo blinked. Literally the moment he stepped towards Hinata, Karasuno’s ‘genius’ setter appeared in between them with piercing blue eyes (well, maybe not that instantly, he saw that he shoved Hinata back a little too roughly).</p>\n<p>\"What do you want?\" he asked and Hinata squawked.</p>\n<p>\"Kageyama, it's nothing! I think this is all some big misunderstanding-\"</p>\n<p>\"As your boyfriend,\" Kuroo noticed Kageyama got all 'blushy' like Sawamura did when he talked about Suga, \"it's my duty to stand up for you.\"</p>\n<p>\"But we're not fighting. You just barged in all of a sudden when we were talking,\" Hinata said with his arms crossed and Kageyama turned to him, face even redder.</p>\n<p>\"W-Well sorry for being concerned! Stupid Hinata!\"</p>\n<p>\"I thought you'd stop calling me that once we started dating! Rude!\"</p>\n<p>\"Uh, hold on,\" Kuroo spoke and the two younger boys looked over at the taller male. He pointed at Hinata, \"So you're not dating Kenma?\"</p>\n<p>\"No? He's just a good friend,\" Hinata said and placed his arms behind his head. \"Are you telling me that you and Kenma <em>aren't</em> dating?\"</p>\n<p>\". . .What?\"</p>\n<p>Hinata sighed. \"He talks about you all the time when we text. He quotes you and tells me all the funny things you say. And when we hang out and he mentions you, he always has this smile on his face. Not to mention that you two are almost like, <em>always</em> together. I was surprised to see him at the mall by himself when you weren't around, to be honest. He never told me he was interested in anyone else <em>but </em>you.\"</p>\n<p>Kuroo stared in complete disbelief, trying to process what was just told to him. He himself wasn't seeing anyone. Or even <em>thought </em>about seeing someone for a matter of fact. And yeah, they kind of did things together that could easily be interpreted as couple things. Going out for lunch together and Kuroo lending Kenma his jacket whenever he got cold, or Kuroo and Kenma sometimes cuddling when watching a movie on the couch and Kuroo just absolutely <em>loving </em>the way how Kenma would just <em>look </em>up at him.</p>\n<p>\n<em>\"I love you.\"</em>\n</p>\n<p>There was a couple more minutes of awkward silence with Kageyama trying to get Hinata to just hurry up and go, before Kuroo’s eyes widened.</p>\n<p>“What. The. <em>Shit</em>.”</p>\n<p>And with that, Kuroo turned abruptly and ran off. Kageyama and Hinata stared for a while before Kageyama glanced at the smaller boy beside him.</p>\n<p>\"What did you do to him?\"</p>\n<p>\"Ehhh?! What makes you think I did something to him?!\" Hinata shouted, Tsukishima and Yamaguchi emerging from the convenience store with their goods (and after conveniently eavesdropping from inside). Kageyama crossed his arms.</p>\n<p>\"Because whenever something eventful happens, you're usually around.\"</p>\n<p>\"Just because I had a few run ins at the bathroom doesn't make me a problem magnet!\" Hinata whined and Tsukishima snickered.</p>\n<p>\"He didn't do anything. It's not his fault that Kuroo is just as dense as you two are,\" the blond said off-handedly and Yamaguchi laughed.</p>\n<p>\"TSUKISHIMA!\"</p>\n<p> </p>\n<p>\"If he says we have to stay for a Plan C or Plan F, I'm going to set things straight,\" Yaku said and Lev gave a whine, Kenma only giving a shrug as he switched off his DS for the time being. The three were walking to the gym, Lev mentioning how it'll almost be a month and the pot was just too good for it to end so quickly.</p>\n<p>Before they opened the doors to the gym, the door slid open with a loud slam and Kuroo was standing with wide and distressed eyes.</p>\n<p>\"ARE WE DATING ALREADY?!\" Kuroo shouted to no one in particular, and inside the gym, Inuoka loudly started screaming and cheering 'I won! I won! Right before the month ended! I was right!'. Yaku sighed, placing a hand to his forehead while Lev only pouted.</p>\n<p>\"Thank goodness it's finally over.\"</p>\n<p>\"And it was getting fun too,\" Lev mumbled and Kuroo looked at them.</p>\n<p>\"You two knew?!\"</p>\n<p>\"We <em>all </em>knew. And Inuoka won $120 for predicting on how long it would take for you to figure out,\" Yaku explained.</p>\n<p>\"What the <em>shit.</em>\"</p>\n<p>Yaku grabbed Lev by his arm, giving Kuroo and Kenma a small smile. \"Well, this is probably going to be a very emotional moment so I'll just let everyone know we're going to start practice as soon as you're done, okay?\" he said and promptly shoved Lev inside and closed the door behind him. Kenma looked up at Kuroo with those damn cute eyes and Kuroo bit the inside of his cheek.</p>\n<p>\"So. . .we're dating,\" Kuroo said rather lamely. He felt his ears burning hot in embarrassment; if literally his entire team knew they were together, why didn't <em>he </em>know? Kenma shrugged.</p>\n<p>\"Yeah. Just guess we never made it official.\"</p>\n<p>\"Well why didn't you tell me?!\"</p>\n<p>\"I tried to tell you. You're kind of slow.\"</p>\n<p>\"I'm sure that would have hurt me if we weren't dating and/or best friends,\" Kuroo commented and Kenma looked at the ground, scuffing the toe of his shoe against the cement.</p>\n<p>\"Plus. . .I don't know, it's embarrassing for me to talk about this kind of stuff. When I first thought about you and me together in that way. . .I was nervous about what you would say or how you would feel. If it would change our relationship and make it better or worse. I didn't want to bring it up. . .but the more we hung out and did things together, I thought that maybe this was what being a couple was like, and it really wasn't much different from us being friends. So I thought you caught on a long time ago and just didn't say anything, but you were alright with it. I guess that was too much to think you'd be that perceptive though.\"</p>\n<p>\"Another rude remark. But I guess it's true that you hurt the ones you love,\" Kuroo said and Kenma's face went red. Kuroo scratched the back of his head, not sure what to say. \"Well. . .we never kiss or anything. If we're a couple, you never thought about why we didn't do that?\"</p>\n<p>Kenma's DS appeared in his hands (Kuroo swore this time it was instantly), his thumb rapidly pushing the X button.</p>\n<p>\"I thought you didn't care about that stuff. I don't care either. We could do it though, if you wanted,\" Kenma murmured and Kuroo raised an eyebrow.</p>\n<p>\"Oh ho?\"</p>\n<p>Kenma nodded, the sound of him pressing the button getting louder.</p>\n<p>\"So if I kissed you right now, you'd be okay with it?\"</p>\n<p>Button pressing intensified.</p>\n<p>Kuroo smiled and leaned down, taking Kenma's chin to gently tilt up and give a simple little peck. Kenma's lips were warm and slightly trembling in nerves; Kuroo couldn't help but smile into the kiss and gently press his tongue against Kenma's lower lip. Kenma jolted back, his face as red as their uniform and his character in the game obliterated by hellfire yet again. Kuroo laughed and rubbed the back of his head.</p>\n<p>\"Sorry! We'll take it slow,\" Kuroo said and Kenma gave a slow nod, looking at his game screen and sighed. \"And we'll go to the game store to get a guide so you can beat that game.\"</p>\n<p>Kenma nodded and Kuroo kissed the top of Kenma's head. Kenma averted his eyes and rubbed the spot Kuroo kissed, not thinking he could turn any redder but still managing to. Kuroo snickered. \"I can't believe I was missing out on this for. . .hey, how long did you think we were dating?\"</p>\n<p>\"I don't know. . .when I got on the team?\"</p>\n<p>\"<em>Two years?!</em>\" And he had the nerve to call <em>him </em>slow! The door opened, Lev poking his head out to look at them.</p>\n<p>\"If you two lovebirds are done, we'd like to start practice,\" he said, Yaku's hand shooting out to pull him back inside by the ear and to 'give them their moment!'. Kenma sighed, putting his DS away again.</p>\n<p>\"This is going to be a thing, isn't it?\" he asked and Kuroo shrugged, casually swinging an arm around Kenma's shoulders.</p>\n<p>\"Maybe. But it's a good thing.\"</p>\n<p> </p>\n<p>\"There is <em>no </em>possible way that is a word!\" Daichi cried out and Suga looked through the dictionary.</p>\n<p>\"Actually, 'usufruct' is a noun meaning ‘to be able to use someone’s property so long as it’s not damaged’. So it counts, Daichi,\" the silver haired boy said with a small smile and Daichi threw his hands up.</p>\n<p>\"I have never used these words before!\"</p>\n<p>\"It's not my fault my better half is so smart, Sawamura. I'm pretty sure we earned another eighty points,\" Kuroo said with a grin and Kenma wrote down the calculations.</p>\n<p>\"Dude, we're going to catch up to you soon! Just you wait, Akaashi's just going to stump you with his words!\" Bokuto shouted and Akaashi rested his chin in his hand.</p>\n<p>\"Bokuto, you've been taking all the pieces to spell out animal noises and we're getting five points each.\"</p>\n<p>\"I'm bringing creativity to the board. I still say we should score based on that.\"</p>\n<p>\"Then we should get points too!\" Hinata shouted from his spot at the table and Kageyama shot him a look.</p>\n<p>\"You're just spelling out random noises that aren't even words!\"</p>\n<p>\"'GRAGH' is too a word! It's what you say when you're like 'ugh' and 'gragh'!\"</p>\n<p>\"That doesn't make sense!”</p>\n<p>Kenma sighed and sorted through the letters he and Kuroo had, occasionally picking up the various bits of conversation that floated around the table. Bokuto was asking Akaashi if they added a bunch of ‘S’s to the end of ‘<em>hiss</em>’, they should get, like, a billion points. Daichi was complaining about there being a board game he <em>must </em>be good at with Suga offering to play Twister at his place (though, Kenma wasn’t sure if that was an innuendo for something else). And Hinata and Kageyama were arguing over what should and should not be considered a true word (which could have been a rather philosophical and indulging argument if they weren’t shouting ‘dumbass’ this and ‘you big jerk’ that).</p>\n<p>Kenma looked over at Kuroo, who was also watching everyone else and smiling before he glanced at the pudding-haired boy.</p>\n<p>“What is it?”</p>\n<p>“Nothing. . .is this ‘couple’s night’ going to be a thing too?”</p>\n<p>“Maybe,” Kuroo replied and snuggled closer. Recently, Kuroo had gotten a whole lot more touchy-feely now that they were <em>officially</em> dating. Kuroo always got this big shit-eating grin whenever he thought about it, throwing arms around Kenma and loudly proclaiming to the nearest person (or animal/inanimate object) that they were dating and Kenma was his boyfriend, much to Kenma’s embarrassment. That was also going to be a thing.</p>\n<p>But still, Kenma smiled at Kuroo’s warmth and began to work on the next word to present. <em>This</em>, he thought, <em>was a good thing</em>.</p>\n<p>   </p>"
}