{
  "id": "35165662",
  "url": "https://archiveofourown.org/works/35165662?view_full_work=true",
  "author": [
    "Silver_Athena"
  ],
  "title": "Nightwing gets recruited, Red Hood gets caught and everyone gets grounded",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types",
    "The Flash - All Media Types",
    "Justice League - All Media Types"
  ],
  "relationships": [],
  "characters": [
    "Bruce Wayne",
    "Dick Grayson",
    "Barbara Gordon",
    "Tim Drake",
    "Jason Todd",
    "Cassandra Cain",
    "Stephanie Brown",
    "Damian Wayne",
    "Barry Allen",
    "Oliver Queen",
    "Hal Jordan (Green Lantern)",
    "Diana (Wonder Woman)",
    "Clark Kent",
    "Jarro (DCU)",
    "Harper Row"
  ],
  "additional_tags": [
    "Fluff",
    "Humour",
    "Batfamily Meets Justice League",
    "Attempt at Humor",
    "Americans and their spelling",
    "Nightwing gets recruited",
    "Barry Allen is The Flash",
    "Protective Bruce Wayne",
    "Protective Siblings",
    "Batfamily (DCU)",
    "Protective Batfamily (DCU)",
    "no beta we die like robins"
  ],
  "language": "English",
  "series": "Part 3 of Confusing the Justice League and other family activities - Batfam",
  "published": "2021-11-16",
  "completed": "2021-11-19",
  "words": "5,185",
  "chapters": "4/4",
  "comments": "225",
  "kudos": "7,301",
  "bookmarks": "625",
  "hits": "70,111",
  "summary": "<p>Nightwing gets recruited by the Justice League without Batman knowing.</p>\n<p>Red Hood gets caught by the Justice League without Batman Knowing.</p>\n<p>Now he knows and everyone is grounded.</p>\n<p>The manor might not be standing by the end of the week.</p>\n<p>-----</p>\n<p>“Oracle isn’t my child,”</p>\n<p>“Sounds fake but okay,”</p>",
  "notes": "<p>Ages! Not all of these characters have or will show up, it's just so you have an idea of how many children he has when the counting start</p>\n<p>Barbara 27<br>Richard: 26<br>Jason: 19 (dead)<br>Cassandra 19<br>Stephanie 17<br>Tim 17<br>Cullen 16<br>Harper 16<br>Duke 16<br>Terry 16<br>Carrie Kelly 15<br>Damien 11<br>Mara(?) 11<br>Alina 8<br>Helena 7<br>Jarro 1 year and 5 months</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Barry babysitting assassin children? <br>Yes or no?</p>\n<p>Do you ever do something and your first thought is just: younger me would not like this.</p>\n<p>Cause that's my only thought whenever I enjoy rap music.<br>But then again, younger me would look at my AO3 account and cry with joy so.<br>You win some you lose some.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>So I will be doing the babysitting, I have two thoughts, and one of them will include de-ageing if that's okay...<br>Magic spell leads to accidental babysitting.<br>If I did that, should they all be the same age or just be aged down a couple of years?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Next story will be coming sometime next week or something, Idk, but I'm already working on it!</p>\n<p>Thank you so much for enjoying my last book, all the comments and kudos made my day!<br>I have two versions of the sequel so enjoy!</p>",
  "text": "<p>There were few things in life that Flash hated; he hated when his pizza gets cold on his run back home, he hated when they messed up his order and he had to run all the way back to Italy on an empty stomach, and he hated waiting.</p>\n<p>Waiting was probably the worst, because while the other two had quick and easy fixes, waiting didn’t. He also found himself having to wait for something a lot more than the other two combined.</p>\n<p>All of this is to say, he wasn’t having a good time.</p>\n<p>The lingering smell of fish had him sick, or maybe that was the blood loss? Batman was knocked out next to him and Wonder Woman was bound by her own lasso. The bomb in front of him showed five minutes left. Great.</p>\n<p>Five minutes would’ve been plenty of time for Batman or even Barry to disable the bomb (or at least get it away so it could blow up safely) but with the meta-cuffs around his wrist he couldn’t do anything.</p>\n<p>If only they were normal cuffs, then the stab wound in his abdomen would’ve already healed and the bullet that grazed his thigh would’ve stopped burning.</p>\n<p>Flash looked up, staring at the exposed steel beams as he prayed to every deity he knew.</p>\n<p>\n<em> Rao, please save us. </em>\n</p>\n<p>\n<em> Zeus, please- no not Zeus, he’s a cheater and just a terrible dude. Wait, can he hear me? Please don’t smite us! Not that it would really do anything anyway, we’re about to be blown up. </em>\n</p>\n<p>He looked down at the bomb again, only to see… Nightwing?</p>\n<p>What was he doing here? Had Batman called for help? That wouldn’t be very Batman of him, but then again, adopting upwards of 14 children wasn’t very Batman of him either.</p>\n<p>Nightwing stopped the bomb and walked over to Flash, taking off his cuffs.</p>\n<p>Immediately he started feeling better, his body finally starting to heal itself.</p>\n<p>“Thanks for the assist,” Flash said, trying to be good-humoured but only succeeding in sounding pained.</p>\n<p>“Who are you?” Diana demanded as he saved her.</p>\n<p>“Nightwing, Blüdhaven vigilante,” he said, with something between a salute and a wave.</p>\n<p>Barry recognised it as the formal ‘hello’ in ASL.</p>\n<p>Ever since meeting Black Bat he had started learning ASL in case he met her again.</p>\n<p>“Thank you for saving us, Nightwing of Blüdhaven.” Diana rubbed her wrists together and gathered her lasso.</p>\n<p>“No problem Wonder Woman, I was in the neighbourhood anyway,” he said, sending her a mega-watt smile that would’ve made Superman squint.</p>\n<p>“Are you taking Batman to your super-secret base?” Nightwing asked, a knowing glint in his eyes that everyone would’ve missed. Except Barry knew that he knew much more than he was letting on.</p>\n<p>“Yes.” She nodded. Nightwing’s shoulders shagged almost imperceptibly.</p>\n<p>“Well, good luck!” he said, waving and back-flipping away.</p>\n<p>Once he was gone, they turned to Batman and Wonder Woman gathered his unconscious body in her arms.</p>\n<p>“He would make a fine addition,” Wonder Woman mumbled, it was more to herself than anyone else and Barry doubts he was supposed to hear it.</p>\n<p> </p>\n<p>---</p>\n<p> </p>\n<p>It was a couple days later that Barry finds out what she meant, they were having a security meeting, it wasn’t too important as it was just a small update to the fire system so most of the League wasn’t there.</p>\n<p>Batman, who usually tried to join every meeting no matter how miniscule, was busy dealing with the latest Arkham break-out so he wasn’t there.</p>\n<p>Superman and Wonder Woman were though.</p>\n<p>(So were Flash, Green Arrow and Martian Manhunter, but they aren’t as important).</p>\n<p>The thing with the League was, they liked to know about all the new heroes, which could be difficult when heroes were popping up every day.</p>\n<p>They also tried to recruit (or at least establish a connection so they could call on them if there was an emergency, like an alien invasion) all the new heroes.</p>\n<p>But not just anyone could become a full member with Watchtower clearance, so to get that you needed the okay from the majority of the founders (Batman, Superman and Wonder Woman).</p>\n<p>“I would like to recruit Blüdhaven’s new hero, his name is Nightwing, and he was able to stop a bomb in twenty seconds,” Wonder Woman said with all the authority of a princess.</p>\n<p>“You want to recruit Nightwing?” Flash asked, eyes wide as he stared at her like she had grown another head.</p>\n<p>“The League is in need of more people who can dismantle bombs,” she said.</p>\n<p>Oh God, Batman would hate this. He had worked so hard to keep his identity and the identity (even the existence) of his children safe and it was all going down the drain.</p>\n<p>Just because he wasn’t here.</p>\n<p>Oh God.</p>\n<p>“I feel like we should wait till Batman is here to discuss this,” Flash said, desperately trying to… well he wasn’t quite sure. He was just knew he had to do something.</p>\n<p>“We only need two members for him to be given access to the Watchtower,” Wonder Woman said.</p>\n<p>“He saved your life once and you already want to give him access to the Watchtower?” Flash said, truly stunned at how easily she was trusting him.</p>\n<p>“I am a great judge of character.” She crossed her arms, levelling him with a glare only slightly less scary than that of Batman.</p>\n<p>“I think it’s a wonderful idea, currently we only have two members who can actually disarm a bomb. No Superman, flying it into space doesn’t count,” Green Arrow said.</p>\n<p>“Then it’s settled,” Superman said, only looking a tiny bit sheepish at the comment.</p>\n<p>That’s how Nightwing was recruited, without Batman’s knowledge.</p>\n<p>This wasn’t going to end well.</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>Barry had done everything in his power to be there when Superman and Wonder Woman went out searching for Nightwing to recruit him.</span>\n</p>\n<p>\n<span>Both of them were very confused as to why he wanted to be there so bad, as he was the one who was the most against it.</span>\n</p>\n<p>\n<span>They, of course, didn’t know about how Barry already knew him.</span>\n</p>\n<p>\n<span>They settled on top of the roof of a building, it had been Barry’s idea so they could “see further” but he knew that was a lie. Nightwing was trained by Batman, they would only find him if he wanted to be found.</span>\n</p>\n<p>\n<span>Being on a roof might make him feel safe, Batman has all his business dealings on a roof, maybe it’s genetic? Well, not genetic… it’s like magic, as soon as the adoption papers are signed you become a bat and suddenly rooftops become a second home.</span>\n</p>\n<p>\n<span>He was proven right when a couple of minutes later a figure stepped out of the shadows.</span>\n</p>\n<p>\n<span>“To what do I owe the pleasure?” he asked, though the sentence was very polite, his voice had a slight edge to it. Like he was threatening them whilst also greeting them.</span>\n</p>\n<p>\n<span>Does intimidation also get transferred over when the adoption papers are signed?</span>\n</p>\n<p>\n<span>“Nightwing, when you saved us, I was impressed by your abilities. I believe you have what it takes to someday become a great hero, we would like you to join the League,” Wonder Woman said, stepping forward.</span>\n</p>\n<p>\n<span>“Wait, just like that? You’re letting me on the team, just like that?” his eyes narrowed like he didn’t quite believe them.</span>\n</p>\n<p>\n<span>Flash needed to send him some kind of message, something that says, “Batman doesn’t know anything” whilst also saying “Don’t join just to make fun of your dad!”.</span>\n</p>\n<p>\n<span>Teenagers were scary like that. Nightwing technically wasn’t a teenager anymore, he was probably around Wally’s age.</span>\n</p>\n<p>\n<span>Was Wally an adult?</span>\n</p>\n<p>\n<span>No.</span>\n</p>\n<p>\n<span>It was his first day of high school not too long ago.</span>\n</p>\n<p>\n<span>“You only need two votes from the founding members to be given membership, Superman and Wonder Woman have both given you the okay. Batman hasn’t been notified yet,” Flash said, trying his hardest to speak with his (white out) eyes.</span>\n</p>\n<p>\n<span>He probably shouldn’t have said that, because immediately Nightwing perked up, a smirk appearing on his face.</span>\n</p>\n<p>\n<span>“I thank you for your offer, I am very surprised super-powered heroes like you want little old me to join. But I would be honoured.” He bowed playfully, entirely too self-satisfied.</span>\n</p>\n<p>\n<span>“In a week we will meet back here at 4 pm, then you will be able to meet the rest of the League and gain access to the Watchtower,” Superman said with a smile.</span>\n</p>\n<p>\n<span>“I can’t wait.” Then he jumped off the building, and Flash died a little.</span>\n</p>\n<p>\n<span>What would Batman say about this? He would definitely kill him. RIP Barry Allen, died in the hands of Batman. In happier news, making Batman disregard his ‘no killing’ rule would be one of the most impressive feats of his life.</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p align=\"center\">\n<span>---</span>\n</p>\n<p>\n<span> </span>\n</p>\n<p>\n<span>The next day Barry was chilling in the Watchtower, Hal and Oliver were on Watchtower duty and it was always fun to see the things they would come up with.</span>\n</p>\n<p>\n<span>That’s when the robotic voice of the Zeta-beam called out.</span>\n</p>\n<p>\n<span>“B01,” it said, </span>\n<span>like that was completely normal. Like that was natural. Like everyone knew that the designation ‘B’ existed. Like Batman would let anyone other than him be number one.</span>\n</p>\n<p>\n<span>Oliver and Hal both ran out of the security room, following Barry (at a much slower pace) towards the zeta platform.</span>\n</p>\n<p>\n<span>Where Nightwing was.</span>\n</p>\n<p>\n<span>He was just standing there.</span>\n</p>\n<p>\n<span>Like the fact that he had somehow found their super-secret base that was </span>\n<em>\n<span>in space</span>\n</em>\n<span>, wasn’t anything impressive or extraordinary.</span>\n</p>\n<p>\n<span>Barry was going to faint.</span>\n</p>\n<p>\n<span>Again.</span>\n</p>\n<p>\n<span>How had Batman’s family already made him faint twice in the three months he’d known of their existence?</span>\n</p>\n<p>\n<span>Well, he hadn’t fainted yet.</span>\n</p>\n<p>\n<span>So only once.</span>\n</p>\n<p>\n<span>“How did you gain access to this place?” Oliver asked, eyes wide as he stared at the newcomer.</span>\n</p>\n<p>\n<span>“I could’ve hacked it, I could’ve asked one of my friends to hack it.” He started counting on his fingers the different ways he could’ve gotten in.</span>\n</p>\n<p>\n<span>“Does you-know-who know you’re here?” Barry asked.</span>\n</p>\n<p>\n<span>Maybe he was growing old, or maybe this kid reminded him too much of Wally.</span>\n</p>\n<p>\n<span>If Wally had been raised by Batman.</span>\n</p>\n<p>\n<span>But his dad-senses were tingling, going off in every direction as every atom in his body was pushing him to get this child out of here.</span>\n</p>\n<p>\n<span>Batman had gone through so much to keep his children safe and off the Leagues radar.</span>\n</p>\n<p>\n<span>And now it was all about to go down the drain.</span>\n</p>\n<p>\n<span>“Of course not, I would be grounded for life.” Nightwing scoffed, strolling languidly into the living area, and sitting on the couch.</span>\n</p>\n<p>\n<span>“Green Arrow, Green Lantern,” he said, nodding at the two heroes who were still frozen in place.</span>\n</p>\n<p>\n<span>“This is Nightwing, the newest member, he wasn’t supposed to be introduced or even be here yet.” Flash sent a harsh glare towards Nightwing, he doubts it did much though, the guy has grown up with </span>\n<em>\n<span>Batman</span>\n</em>\n<span>, the only thing that scares him is… well, nothing, probably.</span>\n</p>\n<p>\n<span>Hell is probably scared of </span>\n<em>\n<span>him</span>\n</em>\n<span> (not only is he the son of Batman, but he’s also a Gothamite, people like that don’t get sent to hell, they have their own place) and he doubts a vigilante is scared of death.</span>\n</p>\n<p>\n<span>“How did you even know about this place?” Oliver asked, genuinely confused as he sat on the chair closest to the couch. A dazed expression on his face.</span>\n</p>\n<p>\n<span>“I know a lot of things.” He shrugged. Was this a bat thing? Did the magical adoption papers also make you purposefully vague?</span>\n</p>\n<p>\n<span>“So, you’re the guy that impressed Wonder Woman by disarming a bomb?” Hal asked, sitting down on Oliver’s chair that was way too small for them both.</span>\n</p>\n<p>\n<span>Barry decided to be a functioning adult and sit down beside Nightwing on the huge sofa that could easily fit at least ten people and was made of some kind of silk-like material that was both soft and hard at the same time because Batman was extra like that.</span>\n</p>\n<p>\n<span>He had read some theories that Batman was dating Bruce Wayne (a famous billionaire who people thought had an adoption problem, clearly, they had never met Batman. But if they were dating then maybe all of those kids were actually </span>\n<em>\n<span>their</span>\n</em>\n<span> kids. Don’t go down this route Barry, it will only lead to a headache) so maybe he got his like of unnecessarily extravagant things from him.</span>\n</p>\n<p>\n<span>“What can I say? I’ve been known to be very… disarming,” he said, sending them a smile that belonged on the cover of a magazine.</span>\n</p>\n<p>\n<span>Note to self: never let Nightwing and Wally meet.</span>\n</p>\n<p>\n<span>“How long have you been a hero?” Oliver asked.</span>\n</p>\n<p>\n<span>“Vigilante, technically,” Nightwing corrected, “I’ve been at it for a while now, longer than you probably.” He grinned.</span>\n</p>\n<p>\n<span>“I might look young, but it’s been a while since I was twenty,” Oliver said with a laugh.</span>\n</p>\n<p>\n<span>“The beard doesn’t do much to hide your old-age Ollie,” Nightwing mumbled, if Barry hadn’t been sitting beside him, he wouldn’t have heard him at all.</span>\n</p>\n<p>\n<span>“What do you guys even do up here?” Nightwing asked, changing the subject about as smoothly as sandpaper.</span>\n</p>\n<p>\n<span>“Keep an eye on the world, hide from Bats, nothing too exciting,” Hal said, leaning back in the chair.</span>\n</p>\n<p>\n<span>“Hide from bats?” Nightwing asked, raising an eyebrow, his domino mask moving with his face.</span>\n</p>\n<p>\n<span>This was just great. Were they about to start gossiping about Nightwing’s dad </span>\n<em>\n<span>with</span>\n</em>\n<span> Nightwing?</span>\n</p>\n<p>\n<span>“Batman, scary dude. I’ve never seen him lose a fight, he swears he isn’t a meta but I’m not so sure,” Oliver said, leaning forward in his seat like they were conspiring against someone.</span>\n</p>\n<p>\n<span>“Really?” his voice had the tiniest hint of a laugh he was suppressing.</span>\n</p>\n<p>\n<span>“Let’s not scare the new guy,” Barry said, trying to salvage the situation.</span>\n</p>\n<p>\n<span>“If he’s going to be working with us, he needs to know,” Hal argued, also leaning forward so he could join their conspiring.</span>\n</p>\n<p>\n<span>“Bats is terrifying, he trains us for hours which leaves everyone, even Wonder Woman, tired and bruised. I’ve never heard him give a compliment before,” Oliver said, lowering his voice like he was telling a deep, dark secret.</span>\n</p>\n<p>\n<span>“Sounds rough,” Nightwing said, sounding genuinely surprised.</span>\n</p>\n<p>\n<span>“Don’t get into his personal space and you should be fine, he has a strict no-killing rule so you shouldn’t worry too much, though his punches are known to be a fate worse than death,” Hal said.</span>\n</p>\n<p>\n<span>“I’ll keep that in mind,”</span>\n</p>\n<p>“B01,” the zeta called out, he was early by a couple of minutes but most of the leaguers had already arrived.</p>\n<p>The three founders were there, and Flash, Green Lantern, Green Arrow, Martian Manhunter and Aquaman were also there.</p>\n<p>They were still missing Hawkgirl and Black Canary, who had both said they would be a few minutes late (they had been on a mission together that took longer than expected).</p>\n<p>“Nightwing? Is something the matter?” Batman asked, standing up as he walked towards his son.</p>\n<p>His son.</p>\n<p>The son he didn’t know had joined the League and would be joining them on dangerous missions.</p>\n<p>“Nope!” he said, popping the p.</p>\n<p>“Then why are you here?” Batman asked, his shoulders were stiff, and his fists were clenched.</p>\n<p>“Well, as the newest League member it’s important to be on time,” Nightwing said, his smile was bright as he walked past Batman and towards the rest of the League.</p>\n<p>“Nightwing, I have prepared a chair next to mine for you to sit on,” Wonder Woman said, gesturing to the folding chair next to hers.</p>\n<p>“Thank you,” he said, sitting down.</p>\n<p>Batman stood there, in silent shock for a second before sitting in his chair at the head of the table again.</p>\n<p>“You know Nightwing?” Superman asked, his farm-boy accent shining through.</p>\n<p>“We’re… acquainted,” Batman said.</p>\n<p>“Blüdhaven is Gotham’s sister city,” Nightwing supplied.</p>\n<p>“Our paths have crossed,” Batman said, eying Nightwing from the corner of his eye.</p>\n<p> </p>\n<p>The meeting had been uneventful, Canary and Hawkgirl had arrived just as they had finished talking about security and were moving on to budget.</p>\n<p>More specifically, budget cuts.</p>\n<p>“What do you mean budget cut? Aren’t you guys funded by the government?” Nightwing asked.</p>\n<p>“Yes, well, Zeta-beam maintenance isn’t cheap,” Superman said.</p>\n<p>“Please, your Zeta’s only cost you 100-thousand dollars a year,” Nightwing said, narrowing his eyes.</p>\n<p>If Flash hadn’t known what he knew about Nightwing, he would’ve wondered how he knew exactly how much money they spent on Zeta maintenance.</p>\n<p>“We pay for the repairs of a lot of buildings when there is an alien or robot invasion. That and the diplomatic trips we have to take to alien planets take most of our money,” Batman said, a tired sigh escaping him.</p>\n<p>“So, we have to go back to the cheap coffee?” Canary asked, looking more distraught than she should.</p>\n<p>“I will pay for the coffee myself, there is no way I’m going back to that stuff,” Green Arrow said.</p>\n<p>“We have to do something much more drastic than just switch over to cheap coffee… there will be no more donut-care-Friday,” Batman said, his deep gravelly voice not really suiting the pun he made.</p>\n<p>But it got the right reaction as everyone broke out into screams.</p>\n<p>“You can’t be serious!” Hawkgirl exclaimed.</p>\n<p>“I’m afraid Taco Tuesdays will also have to be cut down to every other week,” he said.</p>\n<p>He shouldn’t have said that.</p>\n<p>The League went into a state of panic, everyone was screaming, Hawkgirl was being held back by Martian Manhunter as she wildly swung her fists in every direction.</p>\n<p>It was a mess.</p>\n<p>But then Nightwing started laughing, a full-body laugh as he leaned in over the table.</p>\n<p>“I’m so sorry, God, you guys are worse than Spoils with waffles,” he said, wiping away a fake tear.</p>\n<p>He was wearing a domino mask that covered his eyes, obviously, there wouldn’t be an actual tear.</p>\n<p>Batman huffed, it almost sounded like a laugh.</p>\n<p>But Batman doesn’t laugh.</p>\n<p>Batman was capable of experiencing many emotions, angry, moody, broody, and justice…y.</p>\n<p>Laughter wasn’t in his range of expressions.</p>\n<p>This got the whole League to be quiet and stare at the two of them.</p>\n<p>“Did… did Batman just laugh?” Flash heard Green Lantern whisper to Green Arrow.</p>\n<p>“If it’s that serious, I know a great doughnut place in Blüdhaven, I can swing by Friday if you guys want?” he said.</p>\n<p>“You are such a cliché,” Batman mumbled.</p>\n<p>What did that mean? Sure, friendliness and doing something just for the sake of pleasure were probably foreign concepts for Batman, but why would that make Nightwing a cliché?</p>\n<p>The rest of the League didn’t seem to hear Batman’s comment as they exploded in praise, thanking the new member with many asking why they hadn’t recruited him sooner.</p>\n<p>It was bound to happen.</p>\n<p>He should’ve known.</p>\n<p>But… well.</p>\n<p>Sometimes Barry wished that things could be simple, that something good could happen and it would be just that, something good.</p>\n<p>But life was cruel.</p>\n<p>He sounded like Batman, had meeting his kids rubbed some of the magic from the adoption papers onto him? Maybe it was all that time spent in Gotham, doctors advise a maximum of 1 hour a month.</p>\n<p>He had just Zeta’d with Nightwing (who was still B01, for some reason they never got that changed, they did add his name to it though) when Oliver ran up to them.</p>\n<p>“Hey, Nigthwing! You’re basically a Gothamite, right?” he asked, bouncing on his feet.</p>\n<p>“Yeah…” Nightwing and Barry looked at him suspiciously.</p>\n<p>“Great!” and then he grabbed Nightwing, dragging him away to the interrogation room.</p>\n<p>Barry followed them, confused as to what was happening.</p>\n<p>When he got inside, he saw Wonder Woman and a man.</p>\n<p>No.</p>\n<p>Red Hood.</p>\n<p>He was bound to a chair, his helmet was still on, but his head was tilted back as though he was too weak to hold it up.</p>\n<p>His head was turned towards the two-way mirror, but Barry guessed that his eyes were closed.</p>\n<p>“We found the Red Hood, he’s an S-rank villain so we brought him back here,” Diana explained, her arms were crossed, and she was glaring at the Red Hood.</p>\n<p>“S-rank? Damn, what did I do to deserve that?” he said, the voice filter distorting his laugh.</p>\n<p>“Do: severed heads, ring any bell?” Oliver said, tilting his head with a dangerous smile.</p>\n<p>“How did you even catch him? I didn’t think anyone but Batman was allowed into Gotham,” Nightwing said, you couldn’t see the worry on him, he was trained to not have any tells.</p>\n<p>But Barry knew.</p>\n<p>Of course, he knew.</p>\n<p>If this had been any of his family members… he isn’t sure what he would’ve done.</p>\n<p>“He decided to visit Starling and we caught him,” Oliver said, nodding his head at Diana who was still glaring at their captive.</p>\n<p>The Red Hood had gone against Wonder Woman and Green Arrow.</p>\n<p>And he was still able to joke.</p>\n<p>“You did <em> What </em>?” Nightwing said, his head snapping towards his brother, domino mask moving with his eyebrows as he glared at him.</p>\n<p>“Please Goldie, I don’t need this right now.” Hood groaned.</p>\n<p>“You don’t-? Oh, maybe you should’ve thought of that before you decided to step out of Gotham! Now I have to bust you out of here, how do you think that makes me feel?” Nightwing said, gesturing wildly as he screamed at his brother.</p>\n<p>“You’re going to do <em> what </em>?” Diana asked, shifting her glare towards Nightwing.</p>\n<p>Oh no.</p>\n<p>This wasn’t good.</p>\n<p>“Sorry guys, but I’m gonna have to take Hood back to Gotham with me,” Nightwing said, moving to go and free him.</p>\n<p>“Move a single muscle and I shoot,” Oliver said, bow and arrow in hand as he aimed at Nightwing’s stomach.</p>\n<p>“Let’s all calm down here-“ Barry tried to salvage the situation but was interrupted by Diana.</p>\n<p>“I <em> trusted </em> you! I vouched for you, I was the one who suggested you!” she screamed, the look of hurt in her eyes betraying her.</p>\n<p>“Sorry WW,” he said, grimacing.</p>\n<p>“Are you getting me out of here or what?” Hood complained, cursing under his breath.</p>\n<p>“Kinda trying to <em> not </em> get shot here,” Nightwing said, glaring at Red Hood.</p>\n<p>“Well hurry up, I promised Red I’d be done by now,”</p>\n<p>“You did <em> what </em>?” and at that moment the Zeta started.</p>\n<p>“B04, B05, B06, B07, B08, B09,” it called out.</p>\n<p>“You <em> know </em> he checks your tracker if you’re even a minute late!” Nightwing said.</p>\n<p>And then six people entered the room.</p>\n<p>Red Robin, Spoiler, Black Bat, Robin, Signal, and someone he didn’t recognise.</p>\n<p>The one he didn’t recognise wore a black and blue suit with a mohawk.</p>\n<p>“Step away from the idiot in the Red helmet,” Red Robin said, holding up a stick in the most threatening way possible.</p>\n<p>“Who are you guys?” Oliver asked, glaring at them, but not lowering his bow.</p>\n<p>“Your worst Nightmare,” Spoiler said.</p>\n<p>“Don’t be like that. We’re trying to rescue a crime boss, let’s at least try and salvage some of our reputation as good guys,” Signal said, seemingly the only one with a braincell.</p>\n<p>“As if we need to prove ourselves to these morons,” Robin said, scowling.</p>\n<p>“You guys aren’t supposed to be up here,” Nightwing said, glaring at his brothers.</p>\n<p>“Neither is he,” the new girl said, nodding her head towards Hood.</p>\n<p>“I plead the fifth,” Hood responded.</p>\n<p>“Where are the others?” Nightwing asked, glaring at them.</p>\n<p>“Don’t tell me there will be another portal,” Barry mumbled.</p>\n<p>“They’re back at the cave with Penny One, Oracle hooked us up so they can hear everything.” Spoiler pointed towards a corner of the room.</p>\n<p>“Let Red Hood go and we won’t hurt you,” a female voice said, making Barry jump slightly.</p>\n<p>“Like Hell we will! We’ve already pinged the rest of the League, they’ll be here in ten minutes,” Oliver said.</p>\n<p>“Batman here?” Black Bat asked, they all seemed to freeze at that statement.</p>\n<p>“This is why I wanted us to hurry!” Hood groaned.</p>\n<p>“Okay, we tried to do this the easy way,” the girl with the mohawk said, producing a gun the length of her arm out of nowhere, “now let’s do this the hard way,”</p>\n<p>Signal disappeared, and then Oliver’s arrow was carefully taken off his bow. He didn’t have time to <b>comprehend</b> that though, as the next thing he knew, a child was thrown at him, feet first.</p>\n<p>Spoiler and Black Bat lounged forward, their blows were blocked by Wonder Woman though, and they began a dance.</p>\n<p>The girl Barry didn’t know started shooting in seemingly random directions, but then Barry noticed how Red Robin had sneaked past them all and was untying Hood while Nightwing inserted himself in the fight against Wonder Woman.</p>\n<p>“To the Zeta!” Red Robin called as soon as he was done, and all the bats dashed towards the Zeta.</p>\n<p>“Stop them!” Wonder Woman screamed at Barry, a painful looking bruise already blossoming on her jaw from a particularly hard hit from Spoiler.</p>\n<p>Flash winced, knowing that feeling all too well.</p>\n<p>He did run after them, not so much to stop them as it was to see more of what was going on.</p>\n<p>Oliver was on the ground, groaning in pain as he struggled to stand up.</p>\n<p>Flash was the first to the Zeta, waiting on the bats with what he hoped was a “disappointed dad” look.</p>\n<p>They came running in, stopping right in front of him as Wonder Woman followed.</p>\n<p>“He can’t see us!” Spoiler pleaded with him.</p>\n<p>“01, Batman,” the Zeta called out.</p>\n<p>Too late.</p>\n<p> </p>\n<p>Batman stepped off the platform, taking one look at all of his children and sighed.</p>\n<p>“What are you doing up here?” he asked, with all the patience of a father of 14.</p>\n<p>They all started shouting, talking over each other, and making it impossible for anyone to understand what they were saying.</p>\n<p>Batman raised his hand, and they all went quiet. He pointed at Nightwing.</p>\n<p>“It’s all Hood’s fault,” he immediately said.</p>\n<p>“The fuck it is!” Hood said, and they all began shouting again.</p>\n<p>Until Batman raised his hand yet again, now pointing it at Red Robin.</p>\n<p>“Hood decided to visit Starling and got caught by Wonder Woman and Green Arrow, Nightwing tried to bust him out but he was then held by gun-point, err, I guess it’s arrow-point.” He looked around at his siblings, gaining nods as though they agreed with his judgement. “And then I saw he was up here and I was like “well that can’t be good” and Bluebird was next to me, and she asked “what can’t be good?” and so I showed her and she was like-“</p>\n<p>“Get to the point.” Batman grunted.</p>\n<p>“Right, well, we went up here to get him out, and it worked!” Red Robin finished, all of his siblings nodding along with him.</p>\n<p>“And the others?”</p>\n<p>“Back in the cave, they’re listening in with Oracle,” Spoiler said.</p>\n<p>“Hey B,” multiple voices said at the same time.</p>\n<p>Batman sighed.</p>\n<p>And Barry saw a broken man. A man with too many children, who were all insanely talented at making his life difficult.</p>\n<p>“What is going on here?” Green Arrow demanded.</p>\n<p>Oh yeah.</p>\n<p>Not everyone here knew about them.</p>\n<p>“The Red Hood is Gotham’s problem, we’re taking him back,” Batman said, like everything that happened didn’t go way beyond “I want <em> my </em> criminal in <em> my </em> city”.</p>\n<p>“As soon as he stepped foot in Starling he became my problem,” Green Arrow said, folding his arms while glaring at Batman.</p>\n<p>It would’ve worked better if he wasn’t standing crooked due to the beating he had gotten from the Robin.</p>\n<p>“Who are all of these people? They seem to fear you but you’re speaking casually to each other. They have access to the Watchtower under the same classification as Nightwing,” Wonder Woman said, running a hand through her hair as though she was stressed.</p>\n<p>“B for bat,” Black Bat said, crossing her arms over her chest.</p>\n<p>“Fear me?” Batman said, sounding genuinely surprised like he didn’t know how frightening he was.</p>\n<p>“Tt, we don’t fear him,” Robin said.</p>\n<p>“We just don’t want to get grounded,” Signal said, shivering.</p>\n<p>“You can’t ground me! I have my own apartment, I go to work, I pay rent!” Nightwing said, pointing at Batman.</p>\n<p>“For that argument to work you’d have to actually be at your apartment,” Batman responded dryly.</p>\n<p>“You’re Batman’s son?” Wonder Woman said, eyes wide.</p>\n<p>“Nightwing, Batman’s lovechild with justice, at your service,” Nightwing said, doing a theatrical bow before turning to Batman again.</p>\n<p>“You can’t ground all of us!” Nightwing shouted.</p>\n<p>“Nightwing is right, the manor wouldn’t last the night if you grounded all of us,” Red Hood said.</p>\n<p>“Remember last time all sixteen of us were together?” Spoiler said, and a collective shudder past through everyone in the room.</p>\n<p>“Sixteen? Three months ago it was fourteen!” Flash said.</p>\n<p>“Long story,” they all responded at the same time.</p>\n<p>“You can’t be serious,” Oliver said, “No, no way <em> Batman </em> has <em> sixteen </em> children!”</p>\n<p>“How dare you insult my father you vermin!” Robin said, being held back by Nightwing.</p>\n<p>That didn’t stop him from throwing a knife at him that flew just over his head.</p>\n<p>“That was a warning,” he said, calming down in his brother’s arms.</p>\n<p>“He’s right, aren’t we at seventeen?” Red Robin said, counting on his fingers.</p>\n<p>“I’ve honestly lost count, are we still counting Jarro?” Signal said, sounding distressed.</p>\n<p>A chorus of yes’ and no’s (the no’s were mostly from Robin) were heard around the room—the people at the cave also shouting.</p>\n<p>“Is Batman even home?” Nightwing asked, his question was followed by silence as all the siblings thought about it.</p>\n<p>“Batman is right in front of you,” Oliver, so very unhelpfully, supplied.</p>\n<p>“Wrong Batman,” they all said.</p>\n<p>God that was getting creepy.</p>\n<p>“Wait, Barry you knew?” Oliver shouted, this seemed to also wake Wonder Woman out of her stupor as she looked at Barry.</p>\n<p>“Ran into a few of them, with their mother and aunts,” Barry said, grinning shyly.</p>\n<p>“You met Harley?” Bluebird said.</p>\n<p>“And Ivy,” Black Bat said.</p>\n<p>“I should really get better at answering the bird call,” she said, sounding disappointed that she hadn’t been there.</p>\n<p>“Very funny. He fainted,” Black Bat sat, pointing at Barry.</p>\n<p>“Well I’m sorry, but a starfish popped out of a magical portal,” Barry said.</p>\n<p>In his defence, a lot had happened that hour, and the starfish was just the nail in the coffin.</p>\n<p>“Jarro? He couldn’t hurt a fly,” Bluebird said.</p>\n<p>“<em>That’s </em> Jarro?”</p>\n<p>“We are getting off-topic. Batman, is the Red Hood your son?” Wonder Woman asked, eyes wide and… hopeful?</p>\n<p>“Yes, he is my second oldest,”</p>\n<p>“Third and a half,” all the kids said at the same time. Seriously, how do they do that?</p>\n<p>“Oracle isn’t my child,” he said with a sigh, sounding like he’d had this discussion one too many times.</p>\n<p>“Sounds fake but okay,” Spoiler said.</p>\n<p>“If you’ll excuse me, I have some grounding to do.” And then he ushered all of his kids into the Zeta, before stepping himself.</p>\n<p>Barry went to go lie down, he was getting a headache.</p>"
}