{
  "id": "3553109",
  "url": "https://archiveofourown.org/works/3553109?view_full_work=true",
  "author": [
    "nightshifted"
  ],
  "title": "they take their shots but we're bulletproof",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F"
  ],
  "fandoms": [
    "The 100 (TV)"
  ],
  "relationships": [
    "Clarke Griffin/Lexa"
  ],
  "characters": [
    "Clarke Griffin",
    "Lexa (The 100)"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2015-03-16",
  "completed": null,
  "words": "9,539",
  "chapters": "1/1",
  "comments": "364",
  "kudos": "13,408",
  "bookmarks": "2,299",
  "hits": "196,804",
  "summary": "<p>\"Our winters are harsh,\" Lexa tells her. \"You must have adequate shelter to survive them.\"</p>\n<p>\"I survived you,\" Clarke says lowly. \"I'll survive anything.\"</p>",
  "notes": "",
  "text": "<p>Monty meets Clarke a mile outside camp with a pack of supplies and the saddest eyes.</p>\n<p>\"You don't have to do this, Clarke,\" he says, shifting the backpack off his shoulder and handing it over. \"You can lean on us.\"</p>\n<p>Clarke lifts the backpack to her shoulder and pulls him close, pressing an affectionate kiss to his cheek. \"Don't get into too much trouble.\"</p>\n<p>\"My partner in crime hates me,\" Monty says, lowering his eyes, \"so no problem.\"</p>\n<p>\"Jasper will come around,\" she reassures him, fighting back tears. \"We did what we had to do.\"</p>\n<p>\"I know.\" He hugs her again. \"Stay safe, Clarke.\"</p>\n<p>\"You too, Monty.\"</p>\n<p>She turns and leaves.</p>\n<p>--</p>\n<p>Clarke has no destination except <i>away</i>. Away from Camp Jaha, where people look to her for guidance. Away from Tondc, where people look at her with caution. Away from... Polis, wherever that is. She wonders briefly what she would find there, what Lexa had been so eager to show her. She tries to reconcile with the fact that she may never know what Lexa sacrificed when she left her there on the Mountain.</p>\n<p>There's a cliff a few miles from where she makes temporary shelter. Every day, she walks to the edge of the cliff, sits down with her legs dangling dangerously over the edge, and stares into the abyss. Sometimes she cries. Sometimes she brings a notebook she'd salvaged from Mount Weather and draws. Sometimes she does nothing and spends an entire day battling her inner demons.</p>\n<p>To be very, very clear: Clarke Griffin does not want to kill herself.</p>\n<p>She still has a few rounds in her gun; it would be quick. But she has seen enough death to know that there is no peace in it, no beauty, no poetry. Bodies are not graceful in death; they bleed and burn and fester. She does not want anyone to find her with a self-inflicted wound and draw conclusions about the person she'd been. She stays alive because she needs her people to pour their hopes into her being strong enough to shoulder the pain. She has to be able to return to Camp Jaha one day, look her friends in the eye, and convince them that she can hold their demons for them without letting them suffocate her.</p>\n<p>She is too young to be this old and weary, but she will not die by her own hand.</p>\n<p>She hunts for food, cooks the meat in a fire that she starts and stokes herself. She keeps herself fed and relatively clean, dry in the rain, warm at night. She's a survivor. At her lowest points, that fuels her.</p>\n<p>She searches for peace on the edges of giant cliffs, under unforgiving waterfalls and inside dark caves. She is not afraid of the elements. She is not afraid of being crushed by boulders or drowned in oceans. She is only afraid of her mind torturing her with the choices that she's made, the people she has given up so that others may live.</p>\n<p>The weeks bleed into each other until she wakes up one morning and finds frost on the grass. Her breath is visible when she exhales, and her fingertips are numb under the blankets. She rubs her hands together for heat; she will have to seek better shelter.</p>\n<p>She packs up her stuff and lifts her backpack to her shoulder. In the distance, she hears the clipped noise of a horse galloping. She doesn't pay it much attention until the sound starts to approach, louder and louder. She takes cover behind a boulder and reaches for her gun, but the horse slows to a steady stop behind a row of trees. Someone dismounts and hitches up the horse, then steps into the clearing.</p>\n<p>It's Lexa. Battle armor on, war paint off.</p>\n<p>Clarke walks out from behind the boulder, keeping her gun trained on Lexa, and Lexa stops in her tracks. She detaches her sheathed sword from her side and tosses it to the ground, then does the same with the knife pinned at her belt. She unbuckles her shoulder guard and lets that fall to the ground, too. She holds up her hands.</p>\n<p>The first thing Lexa says to her in months is, \"Would you like to search me?\"</p>\n<p>Clarke clenches her jaw. \"Don't act like you aren't trained to kill people with your bare hands,\" she says, willing her unpracticed voice not to shake. \"Just stay where you are.\"</p>\n<p>Lexa nods, drops her arms to her sides. Clarke scans the trees for snipers.</p>\n<p>\"I came alone,\" Lexa reassures her.</p>\n<p>\"And we all know we can trust you at your word,\" Clarke fires back.</p>\n<p>Lexa takes that one without a fight. \"You are a legend among my people, Clarke.\"</p>\n<p>That catches Clarke by surprise. \"What?\"</p>\n<p>\"I said, you are a legend among--\"</p>\n<p>\"I heard you,\" Clarke cuts in. \"What are you talking about?\"</p>\n<p>\"You brought down the Mountain,\" Lexa says simply.</p>\n<p>Clarke shakes her head. \"Not by myself.\"</p>\n<p>\"That's not how the story goes,\" Lexa tells her.</p>\n<p>\"I had help,\" Clarke insists, growing angry. \"Not yours, because you betrayed me and left my people to die, but I had help.\"</p>\n<p>Lexa says nothing. The muscles of her neck shift as she swallows hard, the only hint of her frayed nerves.</p>\n<p>\"Why are you even here?\" Clarke presses. \"What do you <i>want</i>, Lexa?\"</p>\n<p>\"What I want is not something that I can have anymore,\" Lexa says quietly. Then, squaring her shoulders, \"Winter is approaching. You should not wander these woods in the cold.\"</p>\n<p>Clarke stiffens. \"I'll do whatever I damn please.\"</p>\n<p>\"Our winters are harsh,\" Lexa tells her. \"You must have adequate shelter to survive them.\"</p>\n<p>\"I survived you,\" Clarke says lowly. \"I'll survive anything.\"</p>\n<p>Pained surprise flickers across Lexa's eyes. Immediately, she regains her composure. \"Clarke, let me take you somewhere safe.\"</p>\n<p>\"I don't want to be safe,\" Clarke says, suddenly fighting tears because she <i>means</i> it. She doesn't care about her own safety. Her body reacts to threats because that is what it's been built to do, but she doesn't <i>care</i>. \"I want to be left alone.\"</p>\n<p>\"You will be,\" Lexa reassures her gently. \"I know a place where no one will bother you, but you will be warm. Please, Clarke. Put aside your animosity for me and let me give you a place to stay through winter.\"</p>\n<p>The laugh that tears from Clarke's throat is dry and seeped with bitterness. \"I don't hold <i>animosity</i> toward you, Lexa; I hold distrust.\" Her grip tightens around her gun, she lifts it and aims at Lexa's forehead. \"You don't know what I'm capable of.\"</p>\n<p>\"I do know,\" Lexa says evenly. If she is afraid, she does not show it.</p>\n<p>\"You're not taking this seriously,\" Clarke warns. \"I could kill you.\"</p>\n<p>Lexa quiets. \"I am taking it seriously. That's why I came alone despite knowing you would be armed and hostile. You will not kill me for the same reason you have not killed yourself, even though your mind has been keeping you tortured and alone all these months.\"</p>\n<p>\"That's a big leap to take,\" Clarke says. \"If we're so alike, then you know that I have it in me to pull the trigger.\"</p>\n<p>\"I do,\" Lexa concedes, still stoic, still unafraid.</p>\n<p>Lexa is giving her a choice, Clarke slowly comes to understand, and her grip on her gun loosens. In a world of forced decisions that stain Clarke's hands with more blood than she can wash off in her lifetime, in this one instant, Clarke has a choice. <i>I do trust you, Clarke,</i> Lexa had told her between whispers of hope and genuine affection, and Clarke aches at the realization that Lexa holds strong to that trust, would put her life on the line to prove that even if Clarke will never be able to reciprocate that trust, she can still have hers. It is the most reckless and stupid thing Lexa has ever done, Clarke thinks as she lowers her gun and gathers ammunition of a different kind.</p>\n<p>\"Tell me why you really came here,\" Clarke says, clipping her gun back into her belt. \"Tell me, and I'll go with you.\"</p>\n<p>At that, Lexa softens. \"You know why.\"</p>\n<p>\"Say it.\"</p>\n<p>\"Clarke.\"</p>\n<p>\"<i>Say it</i>.\"</p>\n<p>\"I do not expect,\" Lexa starts to say, then stops. She takes a shaky breath, gathering courage. \"If I cannot be the person who shares my life with you...\" She trails off again, clenches her jaw, starts over. \"You need a place where you can heal your mind without hurting your body, and I would like to offer you that.\"</p>\n<p>Clarke readjusts her backpack on her shoulder. She walks over and picks up Lexa's sword and knife. She tucks the knife into her own belt but silently hands Lexa the sword. Lexa picks up her shoulder guard and clips it back on, then follows Clarke through the trees to her horse.</p>\n<p>\"I'm not riding with you,\" Clarke tells her. The idea of being pressed to Lexa's body seems unbearable.</p>\n<p>Lexa nods as she unhitches her horse. \"Then we will walk. By horseback, it takes a few hours, but on foot, it'll take us nearly a full day. We should rest at sundown.\"</p>\n<p>\"Where are you taking me?\" Clarke asks.</p>\n<p>\"The Commander before me built a bunker where she could escape from her duties for a few days during times of peace,\" Lexa explains. \"I inherited it when I was chosen as her successor.\"</p>\n<p>After that, they walk in silence, Lexa holding the reins of her horse, Clarke a few steps behind. They only stop briefly for water. While her horse is drinking, Lexa offers to hitch Clarke's backpack to her horse; Clarke refuses. They walk until the sun is low in the sky. Lexa guides them to a nearby clearing so they can set up camp for the night.</p>\n<p>While Lexa ties up and unsaddles her horse, Clarke starts a fire. Clarke is fully planning on staying as far away from Lexa as possible when she notices Lexa removing her shoulder guard and sliding closer to the fire for warmth.</p>\n<p>\"You don't have any covers,\" Clarke comments.</p>\n<p>\"I didn't think I would need them,\" Lexa admits. \"If we'd ridden, we would've made it before sundown. I should have anticipated that you would not want to share a horse with me.\"</p>\n<p>Clarke pulls her blanket out of her bag and walks over to Lexa. She sits down next to her, facing the fire, and drapes her blanket over both their laps. Lexa glances at her before sliding her hands under the blanket.</p>\n<p>\"You should rest,\" Lexa tells her, voice strained. \"I'll keep watch.\"</p>\n<p>\"Wake me in a few hours so we can switch,\" Clarke says around a yawn as she curls down into the blanket, the heat of Lexa's body pressed to her spine.</p>\n<p>--</p>\n<p>Lexa lets her sleep until dawn. She's feeding her horse when Clarke awakens to daylight, and for a moment in the haze of early morning, Clarke indulges herself, watching Lexa speak in low, hushed tones to her horse as she presses a carrot to the horse's lips. Seeing Lexa so unabashedly gentle makes something in Clarke tremble and ache.</p>\n<p>Lexa turns and catches her staring. \"Good morning, Clarke.\"</p>\n<p>\"I told you to wake me,\" Clarke says, pushing herself to her elbows. \"You need to sleep.\"</p>\n<p>\"I'll be fine.\" Lexa walks over and hands Clarke a bag of nuts and dried meats. \"Eat. We still have a seven-hour trek ahead of us.\"</p>\n<p>Clarke sits up and takes the bag. She grabs a handful of nuts and two strips of meat before returning the bag to Lexa. Lexa stomps out the fire and moves to re-saddle her horse while Clarke eats.</p>\n<p>\"Her name is Meadow,\" Lexa says, running her hand down the length of her horse's neck.</p>\n<p>Clarke pauses mid-chew. \"Did you name her?\"</p>\n<p>\"No,\" Lexa replies, \"she was given to me when I was a child. She is old now; I will be taking a new horse soon.\"</p>\n<p>There is so much Clarke wants to ask her, but she doesn't have the words to articulate the questions without seeping them in the wounded remains of her shattered trust. She's angry and hurt, but she's no longer sure what she's angry about or why it hurts so much. She wants to be able to ask about Lexa's past without feeling like she starts to bleed every time she learns something about what shaped Lexa into the person she is, the leader she is, the fighter, the conquerer, the betrayer.</p>\n<p>Clarke finishes her food and gathers up her blanket, stuffs it into her backpack. They set off again. Neither speaks, but the silence is not stifling. Three hours in, Clarke reaches for Meadow's reins, and Lexa hands them over without a word.</p>\n<p>\"I walked away,\" Clarke says a while later. \"I couldn't bear to look at them.\"</p>\n<p>Lexa stays steady. \"People look to leaders for answers in times of strife, but we do not always have them. That is the burden we shoulder.\"</p>\n<p>Clarke swallows against the lump in her throat. \"I don't know if I can shoulder that burden without losing myself.\"</p>\n<p>\"The legends have already been written,\" Lexa tells her. \"Clarke <i>kom skaikru</i> fell from the stars and led her people into the Mountain, ending a century-old war.\"</p>\n<p>\"You ended the war against your people by taking the deal,\" Clarke intones, fist tightening around the reins, fresh rage burning her skin.</p>\n<p>\"But I did not defeat the Mountain,\" Lexa counters evenly. \"You did that.\"</p>\n<p>Clarke shakes her head. She can't close her eyes without seeing hundreds of blistered bodies. \"At what cost?\"</p>\n<p>Lexa glances at her. \"I have nothing to offer you but understanding, Clarke,\" she says softly. \"You do not need to explain your choices to me, or even tell me about them. I have made far worse.\"</p>\n<p>It is the most comforting and tragic thing Clarke has been told in months.</p>\n<p>The sun is low in the sky by the time they reach their destination. Lexa slows at the side of a rock formation that extends several feet into the air and takes Meadow's reins from Clarke. She hitches her to a nearby tree and leads Clarke closer to the rock wall.</p>\n<p>The entrance to the bunker is well-hidden between two overgrown shrubs, and even at Clarke's stature, she has to duck to enter. The inside of the cave is pitch black, despite the waning daylight outside. Lexa fumbles around for a light source. Clarke follows clumsily, accidentally knocking over what sounds like a metal bucket with her leg.</p>\n<p>\"Careful.\"</p>\n<p>\"I am,\" Clarke mutters, a little too coldly, as she moves away.</p>\n<p>Lexa manages to get a fire started in a small pit dug into the wall of the cave that appears to be a makeshift fireplace. The cave walls glow orange as the warmth of the fire fills the space. Clarke drops her backpack and lets her eyes slowly adjust to the dim light.</p>\n<p>The cave is larger and more complex than she'd been expecting. A table equipped with two chairs sits in one corner while a pile of furs populates another. Along the far wall, there are metal shelves propped up and affixed to the hard rock. Rows of books fill the shelves, but as Clarke approaches, she notices there are also glass jars filled with pencils, markers, paintbrushes.</p>\n<p>\"I had those placed after we forged our alliance,\" Lexa says from somewhere behind her.</p>\n<p>Clarke turns around. Lexa is crouched next to the fire, carefully feeding it.</p>\n<p>\"The drawing utensils,\" Lexa clarifies. \"The books are mine.\"</p>\n<p>\"Why?\" Clarke picks up one of the glass jars and rattles it around. \"Don't tell me you took up art after meeting me in some misguided attempt to connect with me.\"</p>\n<p>\"No,\" Lexa says after a moment of hesitation, \"I thought you would like to have them.\"</p>\n<p>Clarke scoffs, putting the jar back down, \"What, you were going to take me on <i>vacation</i>?\"</p>\n<p>Lexa says nothing, even as her body stiffens and her hands still over the fire.</p>\n<p>Clarke's chest tightens. \"You wanted to take me here.\"</p>\n<p>Lexa rises to her feet. \"Would you have come with me if I hadn't broken the alliance?\" she asks, body tightly wound, bracing for the rejection. \"If I had requested a few days of respite after the war, to be alone with you, would you have?\"</p>\n<p>\"I don't know,\" Clarke answers honestly. She swallows hard. She can't think about what she would do if things were different, because they <i>aren't</i>. \"I don't know, Lexa.\"</p>\n<p>\"I would've let the offer stand,\" Lexa reveals, quiet and cautiously hopeful. \"I know that means nothing now, but I would have. It gives me no joy to bring you here under these circumstances, Clarke.\"</p>\n<p>Clarke turns away. \"I'm not here against my will. Don't be so dramatic.\"</p>\n<p>Lexa nods. \"There is a small spring two miles to the north,\" she says, using a branch to transfer some of the fire to the candles placed around the bunker. \"It freezes over in the winter, but the water is drinkable if you crack the ice on the surface. There should still be some food stored under the table from my last visit. It's not enough to last the winter; I will arrange to have more delivered.\"</p>\n<p>\"Lexa,\" Clarke cuts in, watching as Lexa wrings her hands together, uncharacteristically nervous. \"I'll be fine.\"</p>\n<p>\"You are free to stay here as long as you want,\" Lexa tells her. She seems to want to say more, but she bites it back and starts to head for the exit. \"Rest well, Clarke.\"</p>\n<p>\"Where are you going?\" Clarke calls after her.</p>\n<p>Lexa stops and glances over her shoulder. \"Back to Polis.\"</p>\n<p>\"You don't--\" Clarke hesitates. She doesn't know how to verbalize that she's caught between wanting to be close to the one person who understands her and needing the space to heal her broken trust. She can't express how desperately she craves human comfort, and how sick it makes her that she craves it from someone who left her to die. \"You don't have to stay away.\"</p>\n<p>Lexa doesn't look at her when she says, \"I want nothing more than to stay here and do your bidding, Clarke, anything you wanted from me, I would allow. It's all I've spent the past few months thinking about.\" Her voice wavers; her head dips. \"But I know that I have caused irreparable damage, and I can tell that spending time with me is not an entirely pleasant experience for you. I would rather you hate me than hate yourself for seeking me out when you are not ready.\"</p>\n<p>Clarke watches Lexa leave.</p>\n<p>--</p>\n<p>In the mornings, Clarke reacquaints herself with a paintbrush, relearning how to love the color of the sky at sunrise. She takes walks around the bunker, makes trips to the spring for fresh water, washes her hair, scrubs her face. She spends her evenings reading by candlelight and escaping to worlds that are not hers, to stories that are kinder and safer and brighter. She sleeps in furs that somehow still smell vaguely like Lexa; some nights, she is even comforted by it. She dreams about the horrors of war, about tiny radiation-soaked bodies, about the way Jasper had looked as he'd held Maya's dead body, about Raven's screams of agony, about Octavia's disappointment, about Finn and Anya and Wells and Charlotte. She dreams about her mother telling her, <i>maybe there are no good guys</i>, of Lexa telling her, <i>what you would've done</i>, of Dante telling her, <i>I bear it so they don't have to</i>.</p>\n<p>She wakes up every morning, picks up her paintbrush, and tries again.</p>\n<p>By first snowfall, her mind is quieter. Her dreams are less vivid. Some nights, she doesn't dream at all.</p>\n<p>Lexa surprises her with a visit a few days later. Clarke is sitting in the branches of a tree just outside the bunker, sketching the view of the winter forest from the treetops, when Lexa arrives on Meadow. She pulls to a stop under Clarke's tree and dismounts. She hitches Meadow to an adjacent tree and lifts her chin to look up at Clarke.</p>\n<p>\"That isn't how you become <i>trikru</i>, Clarke,\" Lexa says lightly.</p>\n<p>It's a terrible joke, but laughter bubbles from Clarke's throat, strange and unpracticed and wonderful. Lexa's eyes light up, and for a moment, unapologetic affection spills across her features. Clarke's hand itches to capture it on paper. Instead, she closes her sketchbook and tucks it under her arm before climbing down from the tree. She moves to greet Meadow, carefully brushing her hand down the horse's neck.</p>\n<p>\"What are you doing here?\" Clarke asks, glancing at Lexa.</p>\n<p>\"I brought you some winter clothing and food,\" Lexa says, tilting her head toward the two sacks attached to Meadow's saddle.</p>\n<p>\"You didn't have to do that,\" Clarke tells her.</p>\n<p>\"I know.\" Lexa reaches out and scratches Meadow behind the ear. She starts unloading the sacks. \"The truth is, I wanted to see you, make sure you were well.\"</p>\n<p>Clarke tilts her head in a small nod. \"I am.\"</p>\n<p>Lexa lifts one of the sacks to her shoulder, then pins the second, lighter one under her arm, and starts carrying them into the bunker. Clarke follows her inside. Lexa leaves both bags near the entrance and turns to leave, but the doorway is narrow and Clarke is blocking most of it.</p>\n<p>\"If you'd like to stay for a while,\" Clarke starts to say. She watches Lexa swallow thickly, fists balled at her sides. Clarke's chest aches. \"Hey, I'm okay. I'm doing better. I can do this, Lexa.\"</p>\n<p>Lexa fixes Clarke with a soft look before nodding. \"I'm just going to pitch Meadow a tent,\" she says quietly. \"I'll only be a moment.\"</p>\n<p>Lexa moves around Clarke, their bodies brushing despite Clarke's best efforts to make room. Clarke's body feels flushed after the contact, a hint of pain flickering beneath the surface. She starts dragging the sack of food to the table just to give herself a distraction. Clarke is sitting on the floor, going through the clothes in the second sack, when Lexa reenters.</p>\n<p>\"I hope they are to your liking,\" Lexa tells her.</p>\n<p>Clarke pulls on a fur coat and a wool cap. \"How do I look?\"</p>\n<p>Lexa actually flushes. \"It suits you,\" she says stiffly, quickly turning her back and moving to check the fire.</p>\n<p>Clarke takes the jacket off and sets it aside but keeps the hat. She tries on the gloves, then the new boots. Lexa shuffles around the room nervously, looking for things to keep her hands occupied. She's rearranging the bookshelf when Clarke speaks.</p>\n<p>\"Do your people play chess?\"</p>\n<p>\"No. I've only ever read about it in books,\" Lexa replies.</p>\n<p>\"My friend Wells and I would play all the time when the Ark was in the sky,\" Clarke tells her. \"It's a game about long-term strategy. You would like it.\"</p>\n<p>\"You could teach me,\" Lexa says, quietly hopeful.</p>\n<p>Clarke takes off her hat and gloves and fiddles with the straps of her boots, tightening them. She doesn't look at Lexa, doesn't say anything.</p>\n<p>\"What happened to him?\" Lexa asks when she realizes she's been turned down. \"Your friend Wells.\"</p>\n<p>\"He was killed on the ground,\" Clarke says.</p>\n<p>\"By one of my warriors?\"</p>\n<p>Clarke looks up. \"By one of ours.\"</p>\n<p>Lexa bows her head. \"I'm sorry.\"</p>\n<p>\"He let me believe that he was responsible for my father's death and not my mother,\" Clarke tells her, feeling the sting of old wounds being reopened. \"He let me hate him so I could have a good relationship with my mother.\"</p>\n<p>\"He must have loved you very much,\" Lexa remarks gently.</p>\n<p>Clarke clenches her jaw. \"Everyone who loves me <i>dies</i>.\"</p>\n<p>\"I have no intention of dying anytime soon,\" Lexa tells her.</p>\n<p>It takes Clarke a moment, but when it hits her, Lexa is already staring at her with shocked eyes and pink cheeks.</p>\n<p>\"I did not mean to--\" Lexa opens her mouth, shuts it again. \"That is not what I meant.\" She sounds apologetic. Her chin quivers. \"I should go.\"</p>\n<p>Clarke stands up. \"Don't take it back if you mean it.\"</p>\n<p>Lexa doesn't take it back, but she says, \"We don't hurt the people we claim to love.\"</p>\n<p>\"Sometimes we do,\" Clarke tells her, though Lexa knows it better than anyone. \"Sometimes we have no choice.\"</p>\n<p>\"I should go,\" Lexa repeats, voice raw like she's close to tears.</p>\n<p>Clarke nods. \"When will you be back?\"</p>\n<p>Lexa swallows hard. \"I don't know.\"</p>\n<p>\"Come back in a week,\" Clarke says.</p>\n<p>Lexa gives her a tender look. \"See you in a week, Clarke.\"</p>\n<p>--</p>\n<p>Clarke spends an entire day in the cold looking for smooth flat rocks by the frozen river. She collects thirty-two - sixteen the size of her thumb, sixteen slightly larger. She takes them back to the bunker and paints half of them black. While she waits for the paint to dry, she looks around the bunker for something large enough to use as a game board. She finds some rolled up maps, picks the one that looks the least important, and paints an eight-by-eight checkerboard grid on the back.</p>\n<p>Once the paint on the rocks have dried, she carefully draws chess piece symbols on the surface of the larger rocks. Her hand trembles slightly on the queen's crown, but the markings are distinguishable. She leaves everything on the table once she's done and spends the rest of the week writing letters to the people she cannot face - her mother, Bellamy, Raven, Octavia. In them, she apologizes for not doing enough, tells them that she loves them, that they're brave and strong and incredible. She folds the finished letters up and tucks them under a stack of books on the bookshelf.</p>\n<p>It is therapeutic, and when she catches her reflection in the bucket of water she keeps next to the fireplace, for the first time in months, she doesn't flinch.</p>\n<p>Lexa doesn't arrive until very late on the seventh day. Clarke is already curled in the furs when Lexa walks in, and she stops in her tracks when she sees her lying there under the low glow of the fire. Clarke sits up, letting the furs fall around her lap.</p>\n<p>Lexa clears her throat. \"Emergency meeting in Tondc today. I couldn't get away.\"</p>\n<p>\"You could've waited until morning,\" Clarke points out.</p>\n<p>\"You asked me to return in a week,\" Lexa reminds her. \"Today is the seventh day.\"</p>\n<p>\"I'm not pedantic,\" Clarke says. \"I know you are still the Commander and have duties to your people.\"</p>\n<p>Lexa looks down at her hands. \"I don't want you to think that I enjoy breaking promises.\"</p>\n<p>\"I know you don't,\" Clarke reassures her. She runs a hand through her hair, brushing it to one side. \"You do realize that by arriving this late at night, we'll have to deal with sleeping arrangements, right? Nice play.\"</p>\n<p>Lexa's eyes widen comically. \"That was not my intention, Clarke. I didn't even consider--\"</p>\n<p>Clarke lets out a dry laugh. \"I know. Will you relax?\" She sobers and tries to choose her next words carefully. \"I would be okay sleeping next to you.\"</p>\n<p>Lexa searches Clarke's face, her hands pressing together. \"Are you certain?\"</p>\n<p>Clarke isn't, but she nods, shuffling to one side to make space for two on the furs. Lexa starts undressing tentatively, first shedding her armor, then the coat she has underneath. She moves closer and kicks off her boots. Clarke turns toward the wall, breathing evenly as she senses Lexa sliding under the furs behind her. Clarke can't shake the anxious feeling that Lexa's going to do something behind her back, so she turns to face her, which is an equally terrible decision, because suddenly Lexa is <i>there</i>, soft and warm and most likely willing, and Clarke hasn't been touched by anyone in <i>months</i>. Clarke rolls to her back and stares stiffly at the ceiling.</p>\n<p>\"I could sleep by the fire,\" Lexa offers quietly, \"or with Meadow in the tent. It's actually quite warm.\"</p>\n<p>\"It's fine,\" Clarke tells her.</p>\n<p>Lexa pushes herself up to her elbows. \"Clarke, it's not fine. You're shaking.\"</p>\n<p>Clarke hadn't realized, but she doesn't stop Lexa when she gets up and starts fixing herself a bed next to the fireplace with her coat and the blanket folded over the back of one of the chairs. Clarke rolls into the space Lexa had occupied, covering herself in the warmth that Lexa's body has left behind. She watches Lexa slide under the blanket, legs curling toward her body to conserve heat.</p>\n<p>Clarke doesn't apologize, knows Lexa wouldn't want her to, but she pulls the furs tightly around her neck and says, \"Could you do me a favor?\"</p>\n<p>Lexa shifts. \"Tell me.\"</p>\n<p>\"Could you send someone to Camp Jaha to deliver some letters that I wrote?\"</p>\n<p>\"Consider it done,\" Lexa tells her. \"I will send my most reliable messenger.\"</p>\n<p>\"Thank you,\" Clarke says, taking a shaky breath to quiet her racing mind. \"Goodnight, Lexa.\"</p>\n<p>Lexa remains quiet for a moment, but just as Clarke is about to drift off, she hears, \"Sleep well, Clarke.\"</p>\n<p>--</p>\n<p>Lexa is already up and dressed when Clarke awakens the next morning. She finds Lexa seated at the table, hunched thoughtfully over the chess set Clarke had made. Clarke gets up, throws on her clothes, and makes her way over. The pieces have already been placed in their starting positions.</p>\n<p>\"You know the rules?\" Clarke asks.</p>\n<p>Lexa shakes her head, nudging a black pawn to the center of its square. \"No, I have only seen pictures.\"</p>\n<p>\"I'll teach you,\" Clarke says, taking a seat opposite Lexa.</p>\n<p>Lexa slides a plate of food toward her. \"Eat first.\"</p>\n<p>Clarke pops a few dried berries into her mouth. \"I can multi-task.\"</p>\n<p>Clarke spends the next half hour meticulously going over the rules of chess - how the pieces move, how they attack, how to win. Lexa spends the entire time with a scrunched up look of concentration on her face, eyes darting from piece to piece as Clarke shows them to her.</p>\n<p>\"So the purpose is to capture the king,\" Lexa says slowly, moving her hand over the piece.</p>\n<p>\"Yes,\" Clarke nods. \"Well, not capture him, but checkmate him. That's how you win - when your opponent has no more viable moves that would get the king out of danger. Unfortunately for you, betrayal is not a viable eleventh-hour move in chess.\"</p>\n<p>Lexa startles like that had been the last thing she'd been expecting to hear.</p>\n<p>\"I'm kidding,\" Clarke adds quickly. She looks down at the game board and exhales. \"If I don't joke about it, I might actually kill you in your sleep, so pick your poison.\"</p>\n<p>\"I think you've earned that right,\" Lexa concedes. \"Clarke, let us play a match.\"</p>\n<p>\"White moves first,\" Clarke tells her, motioning toward the unpainted pieces on Lexa's side of the board. \"Your move.\"</p>\n<p>Lexa studies the board for a moment before spinning the entire thing around so that the black pieces are on her side. Clarke rolls her eyes, hiding her smile, and plays her king's pawn. Lexa mirrors. The match progresses without a problem until Clarke decides to castle her king.</p>\n<p>\"Hold on,\" Lexa protests, \"how could your pieces move like that?\"</p>\n<p>\"Did I forget to mention special moves?\" Clarke asks sheepishly.</p>\n<p>Lexa fixes her with an intense stare. \"Clarke, you can't make up rules as you go.\"</p>\n<p>\"I'm not making them up!\" Clarke insists, then explains castling, along with <i>en passant</i> and pawn promotion. When she's done, she finds Lexa watching her softly. \"What?\"</p>\n<p>Lexa looks away. \"Nothing. You are very striking when impassioned.\"</p>\n<p>A deep flush moves up Clarke's neck and warms her cheeks. \"It's your move.\"</p>\n<p>Lexa scans the board before sliding her bishop three spaces. She is the image of concentration as she studies the board, periodically asking Clarke questions about why she makes a certain move rather than another. Still, it only takes Clarke ten more minutes to checkmate Lexa's king.</p>\n<p>\"You aren't used to losing,\" Clarke comments as Lexa silently resets the pieces.</p>\n<p>Lexa purses her lips. \"I am merely untrained at this game.\"</p>\n<p>\"You <i>hate</i> losing,\" Clarke continues. \"I bet you were one of those kids who got frustrated when they lost at rock-paper-scissors. Do your people even have rock-paper-scissors?\"</p>\n<p>\"I spent my childhood learning to fight men and women two to three times my size,\" Lexa says. There's no bitterness in her tone; it is what it is.</p>\n<p>Clarke glances at her, suddenly hurting for her. Lexa is so small without her armor, skin and bones and wiry muscles. Clarke cannot imagine Lexa being smaller than she already is, being asked to engage in fisticuffs with people who could snap her in two.</p>\n<p>\"Do not pity me, Clarke,\" Lexa tells her, placing a row of pawns onto the board. \"Pity is often a manifestation of misunderstanding. My training was a necessary step to me becoming a great Commander.\"</p>\n<p>Clarke bows her head. \"I just wish things were different, sometimes.\"</p>\n<p>Lexa looks up and allows a small, sad smile. \"Best of three?\"</p>\n<p>Clarke reaches for her king's side knight. Lexa is an astute observer and plays slightly better the second time, but she still gets handily beat. Clarke tamps down the urge to gloat.</p>\n<p>Lexa is already moving the pieces back into place. \"Best of five,\" she says, very seriously.</p>\n<p>The flicker of nostalgic tugs tightly at Clarke's heart. \"That sounded just like Wells.\"</p>\n<p>\"You speak very fondly of him,\" Lexa remarks.</p>\n<p>\"He was my best friend. At times, I think he was my only friend.\" Clarke blinks against the tears misting her eyes. \"Maybe it's best he never had to watch me make the choices that I have.\"</p>\n<p>Lexa reaches for Clarke's hand but stops herself halfway, drops it awkwardly to the table. \"I know you think that only a monster could have made the choices we made, but we must be able to reconcile the actions we make for our people with the actions we make for ourselves.\"</p>\n<p>\"Have you done that?\" Clarke asks. \"Reconciled with what you did at Mount Weather?\"</p>\n<p>\"I have,\" Lexa says evenly. \"I am not proud of what I did, Clarke, but it doesn't matter. I do not have the liberty of making choices based on my ego, or my wants and needs. If I did, I would've ran away with Costia at the first threat of danger from the Ice Nation and avoided my responsibilities as Commander that ultimately cost her her life. I chose my people over my first love, and if I may speak frankly, again over my second, and I will keep putting my people before the desires of my heart until my fight as Commander is over.\"</p>\n<p>It's nothing Clarke doesn't already know. \"Does it get easier?\" she asks.</p>\n<p>\"No,\" Lexa says, unflinching. \"You get stronger. Your wounds heal into scars.\"</p>\n<p>\"Mine still feel like they're bleeding,\" Clarke admits tightly.</p>\n<p>\"It takes time.\" Lexa dips her head. \"Some wounds never stop bleeding. You learn to live with them.\"</p>\n<p>\"Costia?\"</p>\n<p>\"And you,\" Lexa says softly.</p>\n<p>Clarke bites her lip. \"I don't know how to trust you again. I'm making my peace with everything else, but I don't know how to make peace with that.\"</p>\n<p>\"I don't either,\" Lexa admits. \"I know I do not deserve your trust, after what I did. I know I may never be able to earn it again. And yet I still find myself hoping that...\" She trails off, stares at the space between them like it burns her. \"That we could forge <i>something</i> from the wreckage, and that whatever it may be is comforting for you.\"</p>\n<p>The only thing Clarke can think to say is, \"I would tell you if I didn't want you around.\"</p>\n<p>Lexa nods. \"I'd like a rematch, Clarke.\"</p>\n<p>They play for hours, only stopping for a few minutes when Meadow needs to be fed. Lexa does improve, but Clarke has years of experience over her and wins every match fairly easily. Still, Lexa is fascinated with the game, with its tactics and strategies and setups.</p>\n<p>\"When do you have to go?\" Clarke asks when she realizes it is starting to get dark outside.</p>\n<p>\"I need to be back in Polis by first light,\" Lexa answers, her focus on the chessboard.</p>\n<p>\"How long is the trip?\"</p>\n<p>\"Two hours on horseback,\" Lexa says distractedly.</p>\n<p>\"You should leave before it gets dark,\" Clarke tells her. When Lexa just hums in acknowledgement, Clarke laughs softly. \"Lexa, you're not gonna win this one. I can checkmate in five.\"</p>\n<p>Finally, Lexa looks up. \"When should I return?\"</p>\n<p>\"Anytime you want. It's your bunker, Lexa.\"</p>\n<p>Lexa searches her eyes. \"One week?\"</p>\n<p>Clarke nods. \"Okay.\" She gets up and retrieves the letters she'd written her mother and her friends. \"Here. I know I can't stop you, but please don't read them.\"</p>\n<p>Lexa takes the letters and tucks them into her jacket. \"I won't, I promise.\"</p>\n<p>\"And tell your messenger not to accept any replies. I'm not ready for correspondence; I just want them to know I'm safe and being taken care of.\"</p>\n<p>\"They will be informed,\" Lexa reassures her. </p>\n<p>Clarke pulls Lexa in for a hug. Lexa's body stiffens in surprise, but a moment later, Lexa's arms wrap carefully around Clarke's back as she buries her face against Clarke's shoulder. It's the first real human contact she's had since she said goodbye to Camp Jaha, and Clarke hadn't realized how desperately she needed the physical affection.</p>\n<p>Lexa is so warm. Clarke hugs her tighter, and Lexa doesn't let go. Clarke holds her for what probably is an inappropriately long time, but if it bothers her, Lexa doesn't show it, just stands steady and supports Clarke's weight as she leans into her.</p>\n<p>Clarke realizes, too late, that the emotional impact of being held for the first time in several months has made her start crying. She pulls away to swipe angrily at her eyes for betraying her.</p>\n<p>\"Sorry,\" slips shakily out of her mouth before she can stop herself.</p>\n<p>\"Don't be sorry,\" Lexa tells her, seemingly unsure of what to do with her hands, her body. Finally, she leans forward and pulls Clarke back into her embrace, letting Clarke swallow sobs against her shoulder.</p>\n<p>When she quiets, Clarke slowly moves away from Lexa.</p>\n<p>\"I could stay a little longer if you wanted,\" Lexa offers, forehead knit in concern.</p>\n<p>Clarke shakes her head. \"I'm okay. It's just been a long day. A long couple of months.\"</p>\n<p>Lexa nods. \"I'll be back in a week.\"</p>\n<p>Clarke brushes a light kiss to her cheek. \"Be safe.\"</p>\n<p>--</p>\n<p>Lexa visits once a week, every week. </p>\n<p>Usually, she drops by in the morning and leaves before sundown. They spend their day playing chess and talking about their week apart. Clarke tells her about the strange animals she finds on her walks to fetch water, shows her the pictures she's sketched of them so Lexa can tell her their names in her native tongue. Lexa, in turn, talks about the street festivals in Polis, the performers, the music, the food, and how much she wishes she could take Clarke to one someday.</p>\n<p>Sometimes they sit outside in silence in the snow, Clarke hunched over the pages of her sketchbook and Lexa reading one of her novels, stealing glances at Clarke every few minutes like she's afraid Clarke would disappear if she doesn't. Clarke notices every time but never says anything. Some part of her wants Lexa to love her so much it hurts her. Some part of her convinces herself that if Lexa's the one brimming with unbridled affection, then what she feels for Lexa in return is something else entirely.</p>\n<p>Lexa brings more food when Clarke's supplies run low, though Clarke keeps telling her she doesn't have to. She replaces the metal bucket when it gets leaky, carries in pieces of wood for the fire, and delivers more paint and sketchbooks when Clarke's shelves start looking empty.</p>\n<p>Sometimes Lexa stays overnight, but she always brings extra bedding with her so she has somewhere to sleep.</p>\n<p>Once, they ride together, Lexa's arm wrapped around Clarke's midsection as Meadow carries them to Wells' grave next to the dropship. Clarke kneels silently in the dirt, Lexa standing behind her with her head bowed though she does not believe in the Sky People's death customs.</p>\n<p>It would be funny, the great Commander of the Twelve Clans, tripping over herself to take care of one girl, if Clarke didn't find it a little charming and a little romantic. It would be funny if Clarke wasn't replacing memories of Lexa's face covered in blood and betrayal with memories of Lexa scowling after a bad chess move or speaking nonsense in her sleep or looking at Clarke like she would wait forever for another chance.</p>\n<p>--</p>\n<p>The weeks pass until one day, Lexa arrives on a horse that isn't Meadow. The snow has melted off the ground, and small patches of grass are starting to grow back in. Trees start to bud, birds start to migrate back, animals start to come out of hibernation. It's warm enough, even in the early morning, to walk around outside without a jacket.</p>\n<p>Clarke's heart feels lighter these days. Most of her deepest wounds have scarred over with the passing winter, leaving only shadows of phantom pain that remind her of her past without making it impossible to look to her future.</p>\n<p>Lexa dismounts and walks the new horse toward Clarke.</p>\n<p>\"Who's your handsome friend?\" Clarke asks.</p>\n<p>\"His name is Castle,\" Lexa says. \"I named him after the chess move you invented halfway through our first match.\"</p>\n<p>Clarke turns to pet the horse in order to hide her smile. \"You're an ass.\"</p>\n<p>Lexa smiles faintly as she moves to hitch up her horse.</p>\n<p>They spend the day outdoors to take advantage of the mild weather. They climb trees together and sit in the branches, talking about Clarke's fear of heights and that one time Lexa, age eight, accidentally sliced off a handful of her own hair while playing with a sword she wasn't supposed to touch, and how Anya had laughed at her misfortunes before braiding her hair in a way that hid the missing parts.</p>\n<p>At nightfall, they set out blankets on the fresh grass and lie on their backs next to each other, watching the stars.</p>\n<p>\"Tell me about the sky,\" Lexa requests.</p>\n<p>\"It wasn't glamorous,\" Clarke says. \"We weren't free to move about in space; we were stuck in a ticking time bomb. Everything in the Ark was so... small. The rooms, the jail cells, the hallways connecting the stations.\"</p>\n<p>Beside her, Lexa shifts. \"You could see the Earth from the sky?\"</p>\n<p>Clarke smiles nostalgically at the memory. \"Yeah, the view of the Earth from space was beautiful. That's the only thing I miss.\"</p>\n<p>\"Is Earth as beautiful as you dreamed?\" Lexa asks.</p>\n<p>\"Some things are.\" Clarke turns her head to glance at Lexa. \"I could do without the giant gorillas though.\"</p>\n<p>Lexa exhales a small laugh. \"You fought the pauna valiantly.\"</p>\n<p>Clarke rolls to her side, facing Lexa. She watches the profile of Lexa's face as she breathes, her chest rising and falling with each even breath. She forgets, sometimes, that Lexa is young.</p>\n<p>\"Tell me about Costia.\"</p>\n<p>Lexa's breath hitches, but she obliges. \"She was a healer, like you. She saved my life once, when we were young. Anya had taken me to the front lines of a skirmish with the Ice Nation. A spear dipped with poison caught me off guard. Costia was the one to figure out the antidote. I owe her my life.\"</p>\n<p>Clarke slides closer, takes Lexa's hand and wraps it between hers. Lexa tilts her head to stare at their intertwined fingers for a moment, but doesn't say anything.</p>\n<p>Clarke squeezes Lexa's hand. \"I'm sorry.\"</p>\n<p>\"She is not yours to be sorry about,\" Lexa says. \"You didn't know her.\"</p>\n<p>\"You cared about her. That's all I need to know.\"</p>\n<p>Lexa's eyes are misty, her jaw clenched tight. Clarke knows it's coming before the words leave Lexa's mouth, but it still stings when she says, gently like she's afraid something between them will break, \"Tell me about Finn.\"</p>\n<p>Clarke shakes her head, lets Lexa's hand go. \"I don't think that's a good idea.\"</p>\n<p>Lexa turns; their eyes meet. \"Did you love him?\"</p>\n<p>\"Yes.\"</p>\n<p>\"Even after what he did.\"</p>\n<p>Clarke doesn't have it in her to verbalize it; instead, she nods and tucks her chin to her chest.</p>\n<p>\"I am not passing judgment, Clarke,\" Lexa says gently. \"I have killed far more than Finn.\"</p>\n<p>\"In war,\" Clarke reasons.</p>\n<p>Lexa looks away. \"Not all in war.\"</p>\n<p>\"Then,\" Clarke says, \"in accordance to your laws.\"</p>\n<p>\"I have killed people to protect my secrets,\" Lexa tells her, staring unflinchingly up at the sky. It is the ugly truth, laid bare for Clarke to consume.</p>\n<p>Clarke is not afraid. \"Do you have regrets?\" she asks.</p>\n<p>\"There is no time for regret in the midst of war,\" Lexa says evenly.</p>\n<p>\"And after?\" Clarke presses.</p>\n<p>\"After, we mourn the dead, but we prioritize the living.\"</p>\n<p>Clarke flips to her back and maps the stars with her eyes. She tries to remember where the Ark would be if it were still in the sky, tries to remember the things she'd learned during long physics classes. It doesn't matter, she realizes. The Ark is no longer in the sky, and she is <i>skaikru</i> in name only. She thinks about Lincoln and Octavia and how blurred the lines that separate them are. She wonders if it could ever be that easy, after everything.</p>\n<p>\"Clarke.\" A hint of embarrassment tinges Lexa's words when she asks, \"Was Finn your first?\"</p>\n<p>\"First what?\"</p>\n<p>\"First partner. First person you bonded with.\" Lexa lets out a long, nervous breath. \"I am trying to be delicate.\"</p>\n<p>\"No.\" Clarke's face feels warm. \"Was Costia yours?\"</p>\n<p>Lexa dips her head in a shallow nod. \"Who, before Finn?\"</p>\n<p>\"A girl from the Ark. She didn't make it down.\"</p>\n<p>\"Do you miss her?\" Lexa asks tightly.</p>\n<p>\"We were very young. I barely remember her.\" Clarke huffs out a laugh. \"Are you jealous?\"</p>\n<p>Lexa scoffs. \"Jealousy is the product of a weak mind.\"</p>\n<p>Clarke pushes herself up and shifts until she's on her stomach next to Lexa, their hips touching lightly. Clarke rests her weight on her elbows, thinking about all the things she wishes she had the words to say. Things about understanding, and forgiveness, and taking comfort in shared burdens - different but the same. The things that Lexa has seen and done, the way she carries herself bravely through them, it makes the road that Clarke walks not feel so lonely.</p>\n<p>\"It's okay to want things,\" Clarke settles for saying. She's not sure who she's talking to anymore. \"It's okay to want things for yourself.\"</p>\n<p>Lexa's eyes are bright when she looks at her, needy but restrained. \"I just want you.\"</p>\n<p>Clarke kisses her. Lexa's lips are chapped, and she soothes her tongue over them, drawing a low groan from Lexa's throat. Lexa's hands slide into Clarke's hair as she kisses her back, tentatively at first, then hard and desperate like she's been holding onto the desire for months. Clarke climbs over Lexa, straddling her hips, feeling the burn where their bodies touch. Clarke's hands pull at Lexa's shirt, untucking it from her pants. She slides her palms roughly under the hem of the shirt, riding it up as she touches Lexa's skin. Clarke pulls away slightly when she brushes against a long scar that spans from her hipbone to her ribs. Lexa tries to catch her breath as she stares at Clarke with wide eyes.</p>\n<p>Clarke slides down to drop a row of kisses along the length of Lexa's scar. Lexa shudders, goosebumps lining her skin, but Clarke quickly realizes that it's not a reaction to Clarke's touch but rather to how cool the night air is against Lexa's bare torso. Clarke sits up and tugs Lexa's shirt back into place.</p>\n<p>\"Come inside with me,\" Clarke says breathlessly.</p>\n<p>Lexa lets Clarke pull her up and into the warmth of the bunker. Clarke lays Lexa down on the furs, taking a moment to admire how Lexa looks when she's relinquishing control, before throwing her leg over her body and bracketing her hips. But in the quiet of the bunker, under the dim firelight, Clarke loses some of her nerve. Her hands tremble as she pulls Lexa's shirt and undershirt over her head, and she struggles with the buttons and buckles of Lexa's pants.</p>\n<p>Lexa cups Clarke's cheeks, pulling Clarke down to kiss her, slowly, calming her. Lexa's bare breasts press against Clarke's chest.</p>\n<p>\"Take your time,\" Lexa whispers. \"I have nowhere else to be tonight.\"</p>\n<p>Clarke drops a kiss to the column of Lexa's neck, another on her collarbone, then down between her breasts. A row of small tattoos line Lexa's ribcage, under her left breast. Clarke runs her fingertips over them.</p>\n<p>\"What does this mean?\" Clarke asks.</p>\n<p>Lexa looks down, breath shallow. \"The sword is for Anya, the woman who taught me how to fight. The shield is for Gustus, the man who dedicated his life to protecting me. The lotus flower is for Costia; it was a medicinal ingredient in the antidote that saved my life, and because of that, it was her favorite.\"</p>\n<p>Clarke touches the last one, a star. \"What about this one?\"</p>\n<p>\"I had that done after I left you at Mount Weather so I would never forget,\" Lexa says quietly.</p>\n<p>Clarke's chest feels tight. \"Forget what?\"</p>\n<p>\"You. How it felt to be close to you.\"</p>\n<p>Clarke drops a kiss to Lexa's ribcage. \"I didn't die,\" she murmurs against Lexa's skin.</p>\n<p>Lexa swallows hard. \"They are not for people who I've lost, Clarke.\"</p>\n<p>\"They're for people you loved,\" Clarke says, understanding.</p>\n<p>Lexa shuts her eyes and nods. Clarke leans in and closes her mouth around a nipple, stroking her tongue in a smooth circle. Lexa bites back a moan, her back arching off the furs. Clarke reaches for the buckles of Lexa's pants again, and this time, she manages to get them open. She slides Lexa's pants off with her boots, then removes her socks and underwear, leaving her completely exposed. Lexa tries to sit up, but Clarke pushes her back down, climbing over her to kiss her on the mouth.</p>\n<p>\"You're overdressed,\" Lexa tells her when she pulls away.</p>\n<p>\"I don't see you trying to change that,\" Clarke says lowly, sliding her hands shamelessly down the length of Lexa's naked body.</p>\n<p>Lexa's eyes widen hungrily at the challenge. She reaches for Clarke's jacket, pushing it off her shoulders, down her arms. Clarke tosses it aside. Immediately, Lexa pulls at the hem of Clarke's shirt, ridding her of it in one smooth upward motion. Clarke reaches behind her to unclasp her own bra, letting it slide down her arms. Lexa pushes to sit up again, and this time, Clarke lets her. Lexa dips her head to lavish attention to Clarke's breasts, her hands sliding between their bodies to unbutton Clarke's pants.</p>\n<p>Clarke tilts Lexa's chin up so she can kiss her properly, and Lexa's movements grow frantic as she slips a hand into Clarke's unbuttoned pants. Clarke moans into Lexa's mouth as Lexa pushes into her, palm pressed tightly to her clit. Clarke is so tightly wound that it only takes a few minutes of Lexa messily touching her before Clarke's body shakes with white-hot pleasure, her hands grasping at Lexa's shoulders, her neck, her hair. Lexa's hand does not slow as she murmurs things Clarke doesn't understand into her ear, but her affectionately intimate tone carries across languages, and Clarke trips into a second orgasm, Lexa's name tumbling from her lips. Lexa presses kisses to Clarke's neck until Clarke pulls Lexa's hand out of her pants, away from her sensitive skin.</p>\n<p>Clarke slides her lips over Lexa's cheeks, the bridge of her nose, finally landing on Lexa's eager mouth. The kiss is lazy and slow as Clarke tries to catch her breath. Between kisses, Clarke slips her hand between Lexa's legs.</p>\n<p>\"Commander,\" Clarke mumbles, and Lexa's entire body twitches. Clarke pulls away and laughs. \"I'm not surprised you get off on that.\"</p>\n<p>\"Clarke,\" Lexa pleads.</p>\n<p>Clarke lifts herself enough to pull off her own pants, then nudges Lexa's legs apart and settles between them. Lexa is so sensitive everywhere Clarke touches her, but nothing makes her body twist and arch like Clarke's mouth on her clit.</p>\n<p>Lexa comes on Clarke's tongue three times.</p>\n<p>--</p>\n<p>Clarke wakes the next morning with Lexa's warm body curled around her back. When Clarke shifts, Lexa makes a small sound of protest, the arm draped over Clarke's hip pulling Clarke possessively toward herself. Clarke moves her hand to cover Lexa's, lacing their fingers together.</p>\n<p>\"Lexa.\"</p>\n<p>\"A few more minutes,\" Lexa mumbles against the skin of Clarke's shoulder.</p>\n<p>Clarke relents and closes her eyes, but she ends up drifting off again. When she comes to, Lexa is already up and dressed. When she notices Clarke stirring, Lexa walks back to bed and leans down to press a soft kiss to Clarke's temple.</p>\n<p>\"Morning,\" Clarke mutters. \"Do you have to go?\"</p>\n<p>\"Not until the afternoon,\" Lexa reassures her.</p>\n<p>\"Good.\" Clarke sits up and reaches for her clothes. \"What do your people think you're doing when you sneak away every week?\"</p>\n<p>\"It is none of their business,\" Lexa says, getting back up. \"During times of peace, I have more freedom to move about unnoticed.\"</p>\n<p>Clarke starts to get dressed. \"So they don't know their Commander is getting her ass handed to her in chess by Clarke of the Sky People. Weekly.\"</p>\n<p>Lexa smiles. \"They do not, and they never will.\" She pauses. Then, quietly, \"Unless Clarke of the Sky People wishes to prove her talents in the Polis Center Square.\"</p>\n<p>Clarke turns to look at her, at the open invitation. \"Someday. I promise.\" She finishes dressing and stands up. \"I have some other business to take care of first. I think I might be ready to go back to Camp Jaha. Not today, but soon.\"</p>\n<p>\"Would you like me to come with you?\" Lexa asks.</p>\n<p>Clarke shakes her head. \"I have to do this alone. And to be honest, my people probably won't take too kindly to you being there.\"</p>\n<p>Lexa nods. \"I hope for a chance to convince them otherwise.\"</p>\n<p>\"We have a Sky ritual,\" Clarke tells her, \"where if you want to prove you are worthy of someone, you fight their mother in a display of strength.\"</p>\n<p>Lexa actually seems to consider it for a moment before she realizes Clarke is joking. She scowls. \"Your sense of humor leaves much to be desired.\"</p>\n<p>Clarke pulls her closer, kisses her cheek, then her lips. \"We have time, Lexa. We have time to figure this out. You didn't wait all these months just to be deterred by my people's disapproval. To be clear, that isn't permission to kill them all.\"</p>\n<p>\"Do you trust me?\" Lexa asks her.</p>\n<p>Clarke considers her words carefully. \"I trust that in times of peace, you have no reason to hurt me.\"</p>\n<p>\"And in times of war?\"</p>\n<p>\"War turns us into people we don't want to be,\" Clarke says simply.</p>\n<p>Lexa nods; she understands. She touches Clarke's face, runs her thumbs gently over Clarke's cheekbones. \"If there's anything you need for your journey...\"</p>\n<p>\"Actually, maybe you could give me a ride if Castle's up to it? Walking back to Camp Jaha would take me days.\"</p>\n<p>\"Of course,\" Lexa agrees easily. \"Whenever you're ready.\"</p>\n<p>Clarke purses her lips. \"Next week, maybe.\" She presses her hands to Lexa's hips. \"Now, how do you propose we spend the rest of your time here before you have to leave? Chess? Quiet, personal reading?\"</p>\n<p>Lexa leans down to kiss her neck. \"I have a better idea.\"</p>\n<p>Clarke tries to sound annoyed. \"I just got dressed.\"</p>\n<p>\"There's a very simple solution to that,\" Lexa murmurs, reaching for Clarke's shirt.</p>\n<p>--</p>\n<p>It takes two weeks for Clarke to work up the courage, but when she's sure, she's <i>sure</i>. She packs up what's left of her supplies, and when Lexa arrives on her horse, Clarke hitches her bag to the saddle and hops on.</p>\n<p>The ride back to Camp Jaha is long but quiet. Clarke leans back against Lexa's body as Lexa holds her in place, occasionally murmuring reassurances into Clarke's ear. Lexa tells her stories from Polis to distract her and quiet her mind.</p>\n<p>Clarke makes Lexa stop a few miles outside the camp gates. Clarke dismounts and unhitches her backpack, tossing it over her shoulder. Lexa jumps down after her, curling Castle's reins tightly around her fist.</p>\n<p>\"Take care of yourself, Clarke.\"</p>\n<p>Clarke kisses her. \"I will.\"</p>\n<p>Lexa brushes a strand of hair out of Clarke's face. \"When will I hear from you again?\"</p>\n<p>\"Right here, one week,\" Clarke tells her.</p>\n<p>Lexa nods, pulls her closer, kisses her harder. \"See you then.\"</p>\n<p>Clarke smiles fondly. Nothing else needs to be said. Clarke turns around, her heart ready to face her people.</p>\n<p> </p>\n<p>\n<i>fin.</i>\n</p>"
}