{
  "id": "3589137",
  "url": "https://archiveofourown.org/works/3589137?view_full_work=true",
  "author": [
    "Della19"
  ],
  "title": "i blinked (and there you were)",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Kingsman: The Secret Service (2015)",
    "Doctor Who",
    "Doctor Who (2005)",
    "Doctor Who & Related Fandoms"
  ],
  "relationships": [
    "Harry Hart/Gary \"Eggsy\" Unwin",
    "Harry Hart | Galahad/Gary \"Eggsy\" Unwin"
  ],
  "characters": [
    "Gary \"Eggsy\" Unwin",
    "Harry Hart",
    "Merlin (Kingsman)",
    "OC Lancelot",
    "Arthur (Kingsman)",
    "The Doctor (Doctor Who)"
  ],
  "additional_tags": [
    "Alternate Universe - Time Travel",
    "Time Travel Fix-It",
    "Weeping Angels - Freeform",
    "Post-Canon",
    "Pre-Canon",
    "Really Minor Crossover",
    "Doctor Who as a plot device"
  ],
  "language": "English",
  "series": "",
  "published": "2015-03-22",
  "completed": "2015-07-04",
  "words": "19,894",
  "chapters": "3/3",
  "comments": "549",
  "kudos": "10,416",
  "bookmarks": "3,310",
  "hits": "114,009",
  "summary": "<p>The Weeping Angels, Eggsy reads on the stolen Torchwood intel. Aliens that pose as statues, and kill their victims by sending them back in time and feeding off their years not lived in the present. The politest psychopaths in the universe, a note reads, scrawled in what looks like a doctor’s chicken scratch on the edge of the page by someone who clearly had a perverse sense of humour. A one way trip, the report concludes; you get transported by the angels, and it’s the slow road back to the present for you.</p>\n<p>Eggsy lays his head back on the wall, takes stock of his situation. He’s lost 30 years - three years more than his entire lifespan up ’til now - in the blink of an eye, and now he’s stuck here, in 1988. Three years before he’s even born. Arthur, the prick, is sure to be heading up the Kingsmen, and Merlin, if he’s even there would be…20, maybe. Fuck, so fucking young. </p>\n<p>Shite, even Harry’d only be…</p>\n<p>Alive, Eggsy thinks, and finds himself sitting down hard from where his knees can’t hold him. This is 1988, and Harry’s 23, and alive.</p>\n<p>Suddenly, being stuck in 1988 doesn’t seem so bad. </p>\n<p>Or, the one where love means changing the future. Harry/Eggsy, Time Travel Fix-It.</p>",
  "notes": "<p>A/N: So, some quick Doctor Who notes for anyone not fluent in the show. The Weeping Angels are aliens that disguise themselves as statues and can only move when you aren’t looking at them, like turning your back or blinking. They kill you by sending you back in time and letting you live out your life in the past, and feed off the years you would have lived in the future. The Doctor is a centuries old time travelling alien who “regenerates” and shifts faces instead of dying. The Doctor mentioned in this fic is the 10th Doctor played by David Tennant and his companion is Rose, whom the 9th and 10th Doctors were in love with. They had a bit of a tragic love story that ended kind of happily. Torchwood was an agency started by Queen Victoria to monitor alien activity (The Doctor, specifically) and UNIT is also an agency that deals with aliens in the Doctor Who universe. Everything Eggsy remembers happening are things alien related that happened to London in Doctor Who during his lifetime that he thus would have remembered. And that’s all you need to know about Doctor Who for this fic, though it is a great show and I do recommend it to anyone who likes sci-fi!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>A/N: So yeah, time travel shenanigans. This ship is like a black hole of AUs, and I am getting sucked into it hard. The Doctor Who stuff is just contained to this chapter - it’s more a plot device than a true crossover. But, to come in part 2 - pining!Eggsy thinking Harry is straight, pining!Harry thinking Eggsy is with Lancelot, resolution and bendy young people sex, and then some good old fix it fun with Gazelle and Lee Unwin. You’ll also probably note that I’m writing Eggsy differently than I normally do - this is deliberate, as I’m trying to play up that whole Eggsy is the mature agent one and Harry is the younger, less sure one. And yes, his fake name is Ward because that's Julia Robert's character's last name in Pretty Woman, because I do intend to beat that one reference into the ground. Again, tumblr is a horrible place full of enablers with prompts, and I am weak. Enjoy as always, and comments feed the muse.</p>\n<p>Disclaimer: I still don't own it.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>A/N: So pleased people are enjoying this little AU! I originally was going to have this chapter and the next one be one chapter, but this got longer than expected, and real life demanded more time, so I figured I try to get this part out at least. The downside is that it’s going to be a good while before I have time to write again - I’ve got another super fun medical school exam coming up, and then an actually super fun trip to Europe for 9 days (wheeee!) after that, so we’re looking at three weeks at the shortest before the final part is up, and my apologies for that. But, it’ll have Lee, Gazelle and it will be fix-it fluffy, so at least there is that! Also, yeah, if you find you have developed diabetes after reading this, I take no legal responsibility ;) So, as always enjoy, and comments feed the muse.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>A/N: So yeah, the delay on this is kind of inexcusable, but I do sort of have valid reason in the form of a health crisis where one of the three possible diagnosis they were going to give me for what I had was cancer, and that sort of...wasn’t conductive to creativity. I don’t have cancer, thank goodness, though I do have a chronic illness that I’m starting to be able to manage now, which isn’t exactly ideal, but a lot better than the alternative!! So yeah, that was the state of my life the last few months, and just add med school and you get very little writing done! But I feel a bit better, and I’m finally on my break, so I’m going to try and get my unfinished fics done at least, and a million thank you’s and apologies for the wait and for everyone who stuck around with this fic for much longer than I had intended!</p>\n<p>Also I got a lot of comments about people worried this chapter was going to hurt, and I have to ask; what part of my ridiculous fix-it fervour for this pairing made you think that? ;) Seriously, the movie is angst enough for this pairing - fix-it is for fluff, as I always say, and I hope I’ve delivered on that in this fic :) So, as always comments make the world go round, and I hope you enjoyed the fic!</p>",
  "text": "<p align=\"center\">***************************************</p>\n<p>Amy:<em> Could you? Could you if it was me? Could you do it?</em></p>\n<p>Rory (her husband):<em> To save you, I could do anything. </em></p>\n<p> </p>\n<p>The Doctor<em>: What the hell are you doing?!?! </em></p>\n<p>Amy:<em> Changing the future. It's called marriage. </em></p>\n<p>- Doctor Who, The Angels Take Manhattan</p>\n<p align=\"center\">***************************************</p>\n<p>Life goes on, after Harry dies.</p>\n<p>It seems unfair that it does sometimes, Eggsy admits. Sometimes he feels like time should have just <em>stopped</em> when Harry died, that it should have respected the <em>magnitude</em> of his loss in some tangible way. But that isn’t how the universe works, Eggsy knows; time goes on no matter what, and so Eggsy forces himself to as well. It’d be a grave insult to Harry’s memory if he didn’t, Eggsy knows, because Harry believed in him in a way no one had before. Kingsman was Harry’s last gift to Eggsy, and Eggsy refuses to waste it.</p>\n<p>Besides, he looks <em>damn </em>good in a suit, if he does say so himself.</p>\n<p>Still, there is a clear progression of his life, after Harry. Because Eggsy had loved him, from almost the moment he’d sat back down in the pub after cleaning Dean’s goons clocks, and Harry died never getting to hear him say it.</p>\n<p>That sort of thing leaves wounds that take time to heal.</p>\n<p>And so, in the progression of his life, 2015 is the year of grief. Eggsy sleeps in Harry’s red robe until the smell of him disappears, and occasionally looks over his shoulder when someone calls him Galahad, expecting to find Harry standing right behind him. He spends hours pouring over every report and video recording of Harry’s tenure as Galahad, trying to find even the tiniest remnant of the man still in them, but feels only more alone every time he does. Still, he is an exemplary agent; he starts his own wall of mundane front page articles, and by the end of 2015 there are 12 of them already.</p>\n<p>It doesn’t make him feel any better.</p>\n<p>2016 is the year of anger. Eggsy drinks a little too much, has unwise sex with some dodgy individuals, and his post mission reports start to skirt around phrases like “excessive use of force.” That bloody church in Kentucky reopens and starts preaching its hate again, and Eggsy finds himself tempted to go there and kill them all himself, because why do they, pathetic little hateful people that they are get to rebuild and <em>be</em> again when Harry, who was ten times the man they all were combined, is still fucking <em>dead</em>? He breaks three mission related records and adds 17 more articles to his wall.</p>\n<p>Let no one say anger isn't a motivating force.</p>\n<p>2017 is the year of acceptance. Eggsy goes to a Kingsmen therapist and actually starts dealing with his feelings like a mature adult. He loses his chav accent and develops a fairly decent posh one, because Harry might have thought that being a gentleman was unrelated to the way you spoke, but gun running members of the House of Lords disagree, apparently, and bulletproof suit or not getting shot fucking <em>hurts</em>. He is still himself - relentlessly loyal, irreverent of most things and appreciative of a little sense of the theatrical - he is just more...refined. He learns the art of patience in holding his tongue when playing cards with a disgusting human trafficker. He can seduce a cold blooded assassin with charm and grace, speak fluent French and passable Italian, and he can sit with Lords and heads of state and look like he belongs, like he’d been born in a suit like this.</p>\n<p>By the end of 2017 he’s got 40 articles on his wall, and he’s the best knight the agency has, to the teasing consternation of Roxy, who is undeniably the second best and aiming for the top, as always.</p>\n<p>There will always be a part of him that loves Harry, Eggsy knows. That part that thinks of all that they could have been and mourns the loss. That remembers the warmth in his chest that had bloomed whenever Harry’s smiled at him, and the hint of desire he’d felt looking at the curve of those lips. But now, three years on, Eggsy can feel those things and not let them consume him. He can think, <em>Harry would have loved</em> <em>that</em> when he executes a particularly wicked maneuver on a mission without a twinge of pain accompanying the thought.</p>\n<p>Eggsy’s grown into the man he thinks Harry saw in him, is finally living up to that potential, and finally, it’s a realization that no longer comes with crushing sadness. He thinks, three years after Harry’s death, he might be ready to start moving on, so to speak, and he knows it’d be what Harry’d of wanted for him.</p>\n<p>He thinks, perhaps, 2018 will be the year of peace.</p>\n<p>And then in April, Merlin sends him to investigate the fact that people have started disappearing after visiting a graveyard known for it’s angel statues.</p>\n<p>Peace might not have been the right word.</p>\n<p>The progression of his life gets a little more...complicated then.</p>\n<p align=\"center\">***************************************</p>\n<p>The first thing Eggsy would like to make known when he arrives at the graveyard is that these are some seriously <em>fucked up</em> statues. Eggsy’s never been one to startle at scary movies or the like, but there is something about these things that just creeps him the <em>fuck</em> out. They’ve all got their hands to their eyes like they’re weeping, or hiding, and Eggsy can’t shake the irrational feeling that they’re somehow peeking out at him behind from their stone hands.</p>\n<p>Like they’re <em>waiting</em>.</p>\n<p><em> Lovely</em>, Eggsy thinks, rolling his shoulders to try and dispel the tension that’s gathered there, <em>it’d just be his luck to survive Harry’s death intact and then lose his wits over a few statues.</em></p>\n<p>Still, bizarre feeling aside, Eggsy’s got a job to do, and so he activates his glasses feed and says, as protocol demands, “Galahad checking in at the site. No suspicious activity to report as of yet.”</p>\n<p><em>The statues</em>, he thinks pointedly to himself, <em>don’t count</em>.</p>\n<p>Merlin, the ever faithful voice in his ear responds as expected, a causal humour born of familiarity in his tone, “Acknowledged. A thorough sweep through is probably in order, and then I’ll let you stop chasing wild geese.”</p>\n<p>And Eggsy’s about to shoot some quip back, some little witticism that will make Merlin huff with laughter under his breath, because that’s their thing, but then something <em>moves</em> in the periphery of his eye, and Eggsy whips around, trying to track the movement.</p>\n<p>But all he sees is a statue, wings tucked into it’s back, eyes playfully hidden.</p>\n<p>A statue that was <em>not</em> that close a moment ago.</p>\n<p>“Merlin,” Eggsy finds himself saying, barely able to trust his own eyes, but that one angel was <em>way</em> further away, he <em>knows</em> that, “I think that statue <em>moved</em>.”</p>\n<p>“Galahad, what are you talking about?” Merlin asks, with his <em>yes, really, that isn’t funny tone</em>, but Eggsy’s got bigger problems, because he <em>knows</em> there wasn’t a statue behind him a moment ago, and now there <em>is</em>.</p>\n<p>“Merlin, there’s something <em>wrong</em> with these statues, I mean it,” Eggsy says, as serious as can be, staring at the one in front of him and, in the reflection of his lens the one that is definitely now behind him, that now has it’s hands away from it’s face to bare its sharp <em>teeth</em>.</p>\n<p>Teeth that sharp are never a good sign.</p>\n<p>The fact that it’s a <em>statue</em>, and it’s hands have one hundred percent moved to expose said teeth is probably also not a good sign, Eggsy thinks.</p>\n<p>“<em>Eggsy</em> -,” Merlin starts, voice somewhere between concern and patient reassurance, but Eggsy never hears how that sentence was going to end, because Eggsy <em>blinks</em>, and then Merlin’s just <em>gone</em>.</p>\n<p>Eggsy is too.</p>\n<p align=\"center\">***************************************</p>\n<p>When he opens his eyes, barely even a second later, Eggsy finds himself in an alley in what is unmistakably London, graveyard no where in sight and nothing but static in his ears.</p>\n<p>To say he’s confused would be...greatly understating the matter.</p>\n<p>He taps his glasses a few times, tries hailing Merlin, and when he still gets nothing but static, he starts to worry a bit, because the glasses are fine, he discerns, they’re still transmitting.</p>\n<p>It’s like...no one is there to receive it.</p>\n<p>“Oi mate, you alright there?” A voice says, pulling him away from that disturbing thought, and he looks up to find a man standing there staring at him a bit suspiciously. But what catches Eggsy’s eye is the fact that the guy’s got a haircut and wardrobe that he apparently stole from the eighties, or something because that hair is just <em>not</em> ok, and he’s pretty sure he can see <em>shoulder pads</em> in the guy’s jacket.</p>\n<p>There’s this foreboding feeling starting to grow in the depth of his stomach.</p>\n<p>“No, I’m just...” Eggsy starts, and then, because he’s lived in London all his life and this is <em>wrong</em> - the cars are too old and the streetlights aren’t what they were yesterday - he finds himself asking, that feeling starting to move to his chest as it grows, “What’s the date?”</p>\n<p>“April 8th,” The man says, with a look that Eggsy knows is him wondering what kind of bender Eggsy’d been on, but Eggsy can’t even begin to feel relief at the fact the day is the same, because now he’s finally got a good look at London, and there are a few things <em>missing</em>.</p>\n<p>Eggsy can’t see The Shard or The Eye from here, and so he asks, because he’s got this terrible feeling that might not be because of where he’s standing but <em>when</em>, “What’s the year?”</p>\n<p>“1988,” The man says, like it should be obvious, lifting his eyebrows high as he asks incredulously, “How <em>much</em> did you drink last night mate?”</p>\n<p>And Eggsy’d write it off as a prank, as a late and truly unfunny April Fool’s Day joke, except for the fact that there is a red news kiosk right beside him, the kind where you stick in the money and take the paper, and Eggsy can read the front page from where he’s standing. The headline, truly banal, proclaims, <em>English Pound Note ceases to be legal Tender</em>, but the date, innocuous and innocent in the corner is what catches Eggsy’s eye, holds it and his breath hostage.</p>\n<p>April 8th, 1988.</p>\n<p>“Not nearly enough,” Eggsy manages, standing on a street corner three years before he’s even<em> born</em>, and wishes desperately for a pint or five.</p>\n<p align=\"center\">***************************************</p>\n<p>Look, Eggsy’s a London boy, through and through. He might have shed himself of the estate accent of his youth, but he still lived there, and as such, he remembers all the alien shite no one ever talks about. The Christmas it rained ash, that spaceship that hit Big Ben, The Battle of Canary Wharf and the 456 and the way parents held onto their children a little closer that year. The unspoken rule about being from London might be that you don’t mention any of this shite, because somehow most of the rest of the world seems to have forgotten it, but people like Eggsy, a dyed in the wool Londoner, remember. Point he’s trying to make is this: the knowledge that aliens exist makes suddenly ending up in 1988 after investigating moving statues a possibility, rather than a sign of mental illness.</p>\n<p>Still, that doesn’t mean Eggsy doesn’t allows himself five minutes to panic and freak out. Five minutes to just stare at the date at the paper and think, <em>what the bleeding fuck?</em></p>\n<p>And then those five minutes pass, and Eggsy does what any mature, cultured gentleman spy would do when confronted by a situation like this.</p>\n<p>He breaks into Torchwood.</p>\n<p>Apparently, Eggsy thinks as he leaves in record time, needed info in hand, their security in 1988 was <em>shite</em>.</p>\n<p align=\"center\">***************************************</p>\n<p>The answer to how he’s ended up here is...somehow both helpful and equally unhelpful at the same time.</p>\n<p>The Weeping Angels, Eggsy reads on the stolen Torchwood intel. Aliens that pose as statues, and kill their victims by sending them back in time and feeding off their years not lived in the present. <em>The politest psychopaths in the universe</em>, a note reads, scrawled in what looks like a doctor’s chicken scratch on the edge of the page by someone who clearly had a perverse sense of humour. A one way trip, the report concludes; you get transported by the angels, and it’s the slow road back to the present for you.</p>\n<p>Eggsy lays his head back on the wall, takes stock of his situation. He’s lost 30 years - three years more than his entire lifespan up ’til now - in the blink of an eye, and now he’s stuck here, in 1988. Three years before he’s even <em>born</em>. Arthur, the prick, is sure to be heading up the Kingsmen, and Merlin, if he’s even there would be...20, maybe. Fuck, so fucking <em>young</em>.</p>\n<p>Shite, even Harry’d only be...</p>\n<p><em> Alive</em>, Eggsy thinks, and finds himself sitting down hard from where his knees can’t hold him.</p>\n<p>This is 1988, and Harry’s 23, and <em>alive</em>.</p>\n<p>Suddenly, being stuck in 1988 doesn’t seem so bad.</p>\n<p align=\"center\">***************************************</p>\n<p>The problem of being stuck with no identification three years before he is even born is not really a problem. The Kingsman certainly have the ability to fabricate him an ID that could have him strolling into Buckingham Palace and meeting the security checks if he so pleased.</p>\n<p>The problem is getting into the Kingsman. Because yes, Eggsy discovers after doing a little recon, Chester King is most certainly Arthur, and right up until the moment Eggsy’d killed him, Chester King had pretty much hated his guts.</p>\n<p>To be fair, he’d probably have hated him after that as well, if not for the whole ‘killed him’ thing.</p>\n<p>But that needs to be overcome, and so it will be, Eggsy thinks, because he has a plan and he won’t let anything get in his way. And it’s not a very complicated plan, really; in theory its quite simple. In 2015, on Valentine’s Day - can’t say the man hadn't had an active sense of irony - Richmond Valentine killed 400 million people. One of them was Harry. Now, Eggsy finds himself in 1988, and Harry is alive, and Eggsy’s plan quite simply is this; keep Harry that way, no matter what.</p>\n<p>The 400 million other people he’ll also save are really just icing.</p>\n<p>And so, Eggsy needs to get into the Kingsman.</p>\n<p>And then, as luck would have it, as if fate itself is smiling on him, Tristan ends up dead, and Arthur needs a candidate and well, never let it be said that Eggsy is not an opportunist.</p>\n<p>Besides, Arthur valued self preservation above all things. Eggsy’s got an...angle he thinks will work with good old Chester.</p>\n<p>“Chester King,” Eggsy says to him in greeting, seating himself across from him uninvited in the little cafe that Chester is in, offering his own fake name with a confident smile, “Gary Ward,” because he finally got around to watching Pretty Woman, and Doolittle would be too fucking obvious.</p>\n<p>So much of him begins and ends with Harry. It’s only fair his name does as well, Eggsy thinks.</p>\n<p>“Have we met?” Chester asks, with the false indulgence of someone who knows the answer already, and Eggsy smiles at him in kind, blandly, but eyes just a little bit too <em>sharp</em>, because Eggsy isn’t the man he was the last time they met, and Chester King is little match for the man he is now.</p>\n<p>\"A couple decades from now, actually, so you needn’t worry about not remembering,” Eggsy says casually, gesturing to the waitress and ordering a cup of tea with a smooth smile and a wink that flusters her before turning back to Arthur and...spinning the truth just a little bit, “You were...personally responsible for making sure I became a knight.”</p>\n<p>Killing Arthur, after all, was his very own special ‘last test.’</p>\n<p>Arthur raises an eyebrow at that, but Eggsy thinks its less his claim to be from the future and more that Eggsy certainly doesn’t quite match the ideal of what Chester seemed to look for in proposals; namely blue blood and a classist attitude to match his own. Still, for all that Eggsy is sure that Chester suspects he is less than what he appears, he also takes satisfaction in the fact that he can’t prove it, because Eggsy truly has refined himself into the model of a true modern gentleman, and the grudging acceptance that he can see of that fact in Chester King’s eyes is the sweetest reward he could ever hope to receive.</p>\n<p>It’s possible that Eggsy still harbours a few sour grapes where Arthur is concerned.</p>\n<p>Still, that’s besides the point, so Eggsy lets it go and says instead, cagily, “I’ve found myself taking a one way trip to here from 2018, courtesy of a few angels,” because he’d bet his life that Chester King has stuck his fingers into Torchwood and UNIT intel.</p>\n<p>“I see, and now you wish to rejoin the agency in the here and now,” The man says, because Eggsy has excellent instincts, and then, so fucking <em>smug</em>, like he’s humouring Eggsy, “And are you going to offer me knowledge of the future as a bribe?”</p>\n<p>Well now, that just won’t do, will it?</p>\n<p>“No,” Eggsy says, taking in the smug little fucking twist of his face and deciding to see if he can’t wipe that look off as he says causally, as if he is discussing the bloody <em>weather</em>, “But do I know how you die. Nominate me for the position of Tristan, and I’ll make sure it doesn’t happen that way.”</p>\n<p>And then, with a little self satisfied sip of his tea, because Eggsy might be a gentleman, but he thinks even Harry’d of forgiven this one, all things considered, “And bribe is such a dirty word. Consider it an...incentive.”</p>\n<p>You can bet that smug little smirk is no where to be found.</p>\n<p>But, for all that Chester King was a treacherous snake and a classist prick, even Eggsy had seen that he’d been a brutally pragmatic man. Chester King had sold out his organizations morals and ideals because he’d judged that Valentine was the best way to ensure his own survival, and the fact that they had similar ideals on class had been a side benefit, of that Eggsy is sure.</p>\n<p>Chester nominates him as his candidate for Tristan.</p>\n<p>Eggsy does love being right.</p>\n<p>The trials aren’t run by Merlin, but a man in his 60’s who introduces himself as the knight Kay, but other than that, they’re largely the same as Eggsy’d faced before. Accordingly, with that unfair advantage, Eggsy passes every single test with flying colours, and quite cheerfully shoots the dog, another little pug he’s named JB - though this time for James Bond - because Eggsy’s been a Kingsman long enough to know the weight of a gun with blanks in it versus the weight of one with live ammo. Though, in the name of honesty, he’d have shot, Eggsy knows, even if it had been a loaded weapon, and he can’t make himself feel bad about that. He couldn’t kill the dog for the Kingsman, after all, but for Harry, he’d killed a man.</p>\n<p>And this, one must never forget, is not for the Kingsman.</p>\n<p>“Tristan,” Chester says, grudging admiration on his face as he offers his hand to Eggsy, and Eggsy only smiles, does not gloat, because he is a gentleman as he takes the hand, shakes it once firmly and returns, “Arthur.”</p>\n<p>Eggsy is a Kingsman, and he can follow this Arthur no matter how little he thinks of him.</p>\n<p>Eggsy’s loyalty was never to the king anyways.</p>\n<p align=\"center\">***************************************</p>\n<p>Merlin - the Merlin he knew - it turns out, is actually part of the organization. He’s not in charge of training the candidates yet, but rather head of what Eggsy assumes passes as the 1988 equivalent of a tech division. He’s 21 if he’s a day, just as snarky and possessive about his things as his future counterpart, and sporting a full head of black hair.</p>\n<p>Somehow, it’s the hair that throws him.</p>\n<p>Still, Eggsy likes him just as well as his future counterpart, which is a handy thing, because Arthur sends him out on several incredibly dangerous missions back to back, to prove his worth Eggsy is sure, and so Eggsy once again gets to spend a lot of time with Merlin in his ear. The tech in in 1988 is certainly less impressive; communications are once again limited to actual earpieces and transmitting cameras are only an idea that exists in the R&amp;D development, but they still have lighters that are actually grenades and poisonous knives in expensive oxford shoes, so Eggsy gets by just fine.</p>\n<p>He does, however, exchange his spy glasses for a pair of plain old regular ones with glass lenses, and puts them and his watch away in a safe in his home that only he knows the code to. He doesn’t mind changing the future to save Harry, but he’s wary about introducing tech from future into the past, because he’s seen one too many sci-fi movies to think that’s a good idea.</p>\n<p>Besides, the glasses record and keep the last 24 hours on them, and they’re the only video he has of his mother, Gracie and Roxy. Eggsy might be committed to his plan, is really alright with being stuck here so long as it means changing Harry’s future, but that doesn’t mean that sometimes he doesn’t sit in his new home at night and nurse a glass of scotch as he watches his mum get Gracie ready for school and later, Roxy tease him about some thing that had happened on a mission and punch his shoulder lightly.</p>\n<p>He is happy where he has found himself, but that does not mean there are not things he misses <em>fiercely</em> from his previous life.</p>\n<p>Still, he refuses to let himself dwell on such things, because only unhappiness lives in those thoughts, and so he throws himself into every mission and assignment that Arthur gives him, acing every one, because no matter the time period, Eggsy really is an exemplary Kingsman.</p>\n<p>Accordingly, this is how in Prague he meets Lancelot, Roxy’s predecesor’s predecesor, who is a ginger haired man named Ben. He’s in his mid thirties, with movie star good looks, blue eyes, and a roguish charm.</p>\n<p>He’s also, to Eggsy’s view, entirely aware of and <em>enjoying</em> his position as the agency bicycle.</p>\n<p>Case in point, their second mission together in Paris.</p>\n<p>“You know,” Lancelot <em>purrs</em> to him, after they have disposed of a particularly nasty drug ring, as he sprawls himself out on the couch beside Eggsy, invitation clear in the very <em>bold</em> hand he runs up Eggsy’s thigh, “Arthur’s picks are never as <em>pretty</em> as you.”</p>\n<p>Eggsy finds himself taking a ride or two.</p>\n<p>Because look, Eggsy wasn’t kidding when he realized that he was ready to move on from Harry, and there is a part of him that still means that, still realizes how important that is going to be. Because the Harry that will be proposed for Galahad’s yet to be vacant seat, Eggsy knows, won’t be the Harry he lost, and Eggsy thinks it’d be truly unfair to this Harry if he acted as if he was. The Harry Eggsy had loved and lost had a quarter century on the one that he will meet, twenty five years to become the man that he was, and it would be unproductive to judge the Harry of now by the standards of the Harry of then. The love he has for his Harry will undoubtably colour his interactions with this new Harry, Eggsy knows, but he too also wants to endeavour to be a gentleman and treat him how he deserves; to approach this new Harry as his own man, not as the ghost of someone Eggsy is still chasing.</p>\n<p>So Eggsy sleeps with Lancelot.</p>\n<p>Because, well, who better to pass his time with? Lancelot is handsome, easily charming and very attractive. He is, Eggsy discovers, also<em> excellent</em> in bed, and entirely uninterested in any type of emotional strings beyond friends who fuck, making him entirely perfect for Eggsy’s current needs.</p>\n<p>He’s also, Eggsy thinks, safe, because Lancelot comes with an expiry date. It’s a morbid thought to be sure, but it’s true enough. It’s easier not to get too attached to Lancelot because he knows how this ends, and so Eggsy flirts and fucks around with the man and it’s all light and string free and nonexclusive, and just what Eggsy wants.</p>\n<p>Arthur, naturally, doesn’t approve, because contract killing is apparently fine with his moral compass but buggery is beyond the pale, but Eggsy can almost <em>see</em> in his eyes the ruthless pragmatism win out over his moral disgust. The unspoken rule of ‘don’t ask, don’t tell,’ runs quite strong in Chester King’s Kingsman, and that works just fine for Eggsy, who is entirely willing to engage in a little ‘see no evil.’</p>\n<p>Eggsy’s not sure what 2018 would have become, but 1988 and 1989 become the years of contentment. Eggsy starts a new wall of articles, and adds 14 in 1988, and by the end of 1989 he has 27. Arthur, for all that their relationship will never be close nor fond, considers him a successful agent, and Eggsy has a friend that he fucks in Lancelot, and a friend that he most certainly does not fuck in Merlin, and Eggsy feels satisfied with this life he’d never thought he’d live.</p>\n<p>And then 1990 rolls around, and Eggsy is 29, and he knows that this will be the year of <em>Harry</em>.</p>\n<p>Needless to say, he is looking forward to it.</p>\n<p align=\"center\">***************************************</p>\n<p>1990 also brings with it a visitor he never expected to see, in the form of a man in a brown suit and chucks and a pretty bottle blonde who stumble into the shop on one of Eggsy’s cover shifts that Arthur makes them all do.</p>\n<p>To be fair, a tailor who knows nothing about suits would be a terrible cover, Eggsy admits.</p>\n<p>The girl is very pretty, Eggsy notes, for all that she’s wearing a style of shirt and jeans that won’t be in fashion for another 15 years and when she turns the man, and asks quizzically, “What are we doing here? You never change your clothes,” Eggsy can hear the same London lower class accent that he used to have in her voice.</p>\n<p>He thinks he knows who these two are.</p>\n<p>“Rose...” the man gently chides, and Eggsy hides his smirk, because there is a blue police box on the street corner where one wasn’t a few moments ago, and if the Torchwood intel he stole is correct, the girl has a point. However, the man doesn’t get to finish his sentence as he spots Eggsy, and says, rather bluntly, a frown starting to form on his expressive face, “You’re not supposed to be here.”</p>\n<p>“No,” Eggsy says very politely, to the alien he knows is called The Doctor, with what he is sure is a cheeky glint in his eye, “Are you?”</p>\n<p>“Yes, yes, you’re very clever. The Angels?” The Doctor says, and then before Eggsy can reply, with a dismissive wave of his hand, fast and just this side of manic, “Yes, of <em>course</em> it’s the Angels. But you’re not planning to just ride your time out, are you? You’re planning to change things.”</p>\n<p>“Just one thing in particular,” Eggsy says agreeably, because he can’t see any reason in lying to the man whose made a hobby out of changing history just because he can.</p>\n<p>“It’s never just <em>one</em> thing,” The Doctor says dismissively, shooting a brief look at the girl, who is looking on with some confusion, before returning his gaze to Eggsy to accuse, “You <em>human</em>s, all so bright but you never stop to consider the <em>consequences</em> of your actions.”</p>\n<p>Eggsy’d mention that he’s considered them and simply doesn’t <em>care</em>, but honestly, he feels like that might be splitting hairs.</p>\n<p>“Please, feel free to enlighten me,” Eggsy says instead, and it is a genuine entreaty. Eggsy’s committed to doing this no matter what happens to him or the world, but it couldn’t hurt to actually know the possible outcomes, and this happens to be the only man in the world who could tell him them.</p>\n<p>“The universe is all about it’s checks and balances,” The Doctor informs him, amping up in intensity as he warms to the topic, “You keep enough in the black, integrate yourself into this timeline deep enough, then maybe you create an alternative timeline, separate from your original and you’re fine, you get to stay.”</p>\n<p>And then, changing direction, the warning clear in those paradoxically old eyes, “But you if you don’t, if you find yourself still stuck in your original timeline, then you’re a paradox, and the universe wipes you out - you just fade away. Is your one thing worth that risk?” The Doctor finishes, and for all that Eggsy imagines he thinks he’s just delivered bad news, Eggsy’s honestly pretty pleased, because the two alternatives are both ones he can live with so long as Harry lives too.</p>\n<p>So Eggsy simply looks at the girl, and then back to The Doctor and asks, because this is the fastest way to explain the sheer magnitude of what Harry meant to him, “Is yours?”</p>\n<p>When The Doctor has to break their eye contact to look at his dirty white chucks, Eggsy knows he’s got it.</p>\n<p>“I’ll give it 400 million lives,” Eggsy says quietly instead, and means every single word, “I just want one in return. And he’s worth those 400 million to me,” and then politely, but also entirely rhetorical, “Does that answer your question?”</p>\n<p>He thinks, in those too ancient eyes, he might see the light of <em>approval</em>.</p>\n<p>“So no, thank you,” Eggsy says politely, because this is the only way he can have Harry be alive, and at least now he knows that if he succeeds his mum and Gracie and Roxy will still be out there somewhere, and he knows they’ll be alright without him, “I won’t be needing that ride you’re thinking of offering me.”</p>\n<p>“You’re probably making a mistake,” The Doctor warns him, and Eggsy says only, “It’s mine to make,” and not, <em>for him, no I’m not</em>, because it would be truly ungentlemanly to preach to this man in particular on the lengths one is willing to go for someone they love.</p>\n<p>And then, he turns his attention to the pretty blonde The Doctor called Rose they’ve been unintentionally ignoring, and notes that he can see as clear as day that she’s in love with The Doctor. And since he can’t help but feel sympathy for her for that, Eggsy takes one of the long-stemmed roses out of the tall vase on the counter and offers it to her with a flourish and a wink, “A rose, for a lovely Rose,”</p>\n<p>Eggsy has time to notice that she is especially pretty when she blushes, before The Doctor is herding her away with what sounds like a jealous, “You and your pretty boys.”</p>\n<p>Just before they clear the door Rose throws back over her shoulder a “Thank you,” tongue tucked cheekily between her teeth and Eggsy looks at the millennia old alien painfully smitten with a twenty year old London girl, and reminds himself that there are, in fact, love stories more tragic than his own.</p>\n<p>And so Eggsy watches his only chance at getting back to his own time shuffle his pretty blonde back into his big blue police box of a time travelling space ship, watches it until it has wheezed and faded away.</p>\n<p>And then he gets back to the business of folding pocket squares. It is 1990, and in a matter of months a young Harry Hart will be proposed as a candidate for the position of Galahad.</p>\n<p>He’s exactly where he wants to be.</p>\n<p align=\"center\">***************************************</p>\n<p>Eggsy, for all that he had scoured Harry’s old Kingsman records, doesn’t remember exactly the date and the circumstances under which the current Galahad bit the bullet, so to speak. That would be why he isn’t expecting Lancelot to come out of the bathroom of the hotel room they’re sharing in Monaco after taking down a small terrorist organization and announce solemnly, “Galahad is dead. We’ve been called into HQ, to present our candidates and help with the training.”</p>\n<p>Eggsy’s been waiting for what feels like forever for this moment.</p>\n<p>“Well,” Eggsy says, and kisses Lancelot for what he knows will be the last time, because for all that he has enjoyed his time with the man, with Harry so close it is undeniably over, “We’d better go then.”</p>\n<p>Harry is waiting for him.</p>\n<p align=\"center\">***************************************</p>\n<p>“Merlin,” Lancelot says in greeting when they make it back to the English HQ, and Merlin looks up from his clipboard and returns, with a gesture towards the two way mirror, “Tristan, Lancelot. Fresh new crowd.”</p>\n<p>And so Eggsy makes himself look casually through at the young men gathered there, tries not to let the fact that his heart is currently in his throat show as he scans the group. He notices his own candidate, a marine he notified from the plane to show up, a perfectly nice young man that Eggsy knows will pull his parachute too soon because of a pathological fear of heights talking to the plant for the training, a spotty faced man from the tech department.</p>\n<p>And then he catches sight of the young man standing in the middle of the room, all soft cheeks and brown eyes and fluffy chestnut hair, so painfully young and <em>beautiful</em> and his heart does one long, slow roll in his chest.</p>\n<p><em>Harry</em>.</p>\n<p>That <em>fuck, he’s adorable</em> is the only thought running through Eggsy’s mind right now is...understandable, he decides, staring that those cheeks that he can’t decide if he wants to pinch or <em>bite</em>.</p>\n<p>He was prepared to see Harry alive again.</p>\n<p>He absolutely not prepared for this level of fucking <em>cuteness</em>.</p>\n<p>“My word, who proposed the one with the <em>hair</em>?” Lancelot says, pulling Eggsy out of his rather unabashed staring of said hair, which thankfully has seemed to have gone unnoticed.</p>\n<p>“You’re one to talk,” Merlin fires back, because Lancelot’s hair related vanity is well known in the Kingsman circles, before he flips through a few sheets and then reads off one of them, “Harry Hart, 25, Belvedere’s proposal. RAF, excellent scores in all of their training reports, nothing but glowing reviews from his superiors.”</p>\n<p>...Eggsy is absolutely <em>not</em> plotting on how to get his hands on a picture of Harry in his dress uniform.</p>\n<p>“The <em>puppies</em> look like they’re more dangerous then him,” Lancelot returns, teasingly dismissive, and Eggsy can kind of see where he’s coming from with that, because this Harry is all soft and <em>unsure</em>, with none of the smooth confidence and lethal polish that his Harry’d had.</p>\n<p>Naturally, he still makes an<em> unfairly</em> appealing sight.</p>\n<p>“I think he might surprise you,” is all Eggsy says, trying for casual, but something in his tone must give him away because Lancelot turns to him with a <em>glint</em> in his eyes that Eggsy knows never spells out good things.</p>\n<p>The last time he’d seen that look Lancelot had shot down a helicopter with a fucking <em>handgun</em> and Eggsy’d had to parkour his way over a moving <em>truck</em> to avoid getting hit by damn thing as it fell.</p>\n<p>Lancelot, in case he hasn’t mentioned it before, is fucking <em>nuts</em>.</p>\n<p>“Tristan is playing favourites already I see,” Lancelot announces, with an air of devilish delight, because that look never lies and there’s nothing he loves more than being a fucking <em>wanker</em>, “And with the prettiest one no less.”</p>\n<p>“Oh, go soak your overly groomed head,” Eggsy fires back, instead of the <em>you have no idea</em> he wants to say, and Lancelot reels over-dramatically, placing his hands over his heart and pasting a terribly false look of offence on his face.</p>\n<p><em>Arsehole</em>, Eggsy thinks with some fondness.</p>\n<p>“Gentlemen, as fun as this is, one of you does have to go in and give the speech,” Merlin says dryly, peering up over his clipboard at them unimpressed, because despite time travel, some things apparently never change.</p>\n<p>It is, as always, a strangely comforting thought.</p>\n<p>“Tristan can do it, impress his pretty boy with the hair,” Lancelot decrees, batting his lashes at Eggsy outrageously, and Eggsy, in a gesture much more suited for the chav he once was, gives him a two fingered salute.</p>\n<p>Lancelot, because he is a shameless <em>fucker</em>, only laughs delightedly.</p>\n<p>Eggsy, because he’s a gentleman, just takes the high road and goes in to give the speech. It is only, he reasons, half because he wants to stare at Harry some more, which he thinks is fair, given how long he’s waited.</p>\n<p>Honestly, the other half is that he really wants to give this speech. The draw of being on the other side, and all that.</p>\n<p>It’s kind of a badass speech, after all.</p>\n<p>And so Eggsy walks into the room he was twice a trainee in, and stares at all these young faces that wish to be Kingsman, and the one he knows will actually succeed, and starts the speech.</p>\n<p>“I am the agent codenamed Tristan, and you all are about to embark,” Eggsy drawls, looking these oh so young faces who stare back at him completely absorbed in what he’s saying, “On the most dangerous <em>job interview</em> of your lives.”</p>\n<p>And then he makes the mistake of looking at Harry, whose looking at Eggsy like he’s utterly <em>enraptured</em>, and Eggsy’s hands practically <em>twitch</em> with the urge to run his hands through that bloody hair, to see if he couldn’t make this <em>boy</em> version of Harry <em>purr</em>.</p>\n<p>He is so <em>fucked</em>.</p>\n<p align=\"center\">***************************************</p>\n<p>The players, for your viewing pleasure.</p>\n<p>Eggsy Unwin/Gary Ward/Tristan - 29</p>\n<p>\n<a href=\"http://tinypic.com?ref=2hzojrs\" rel=\"nofollow\">\n<img src=\"http://i57.tinypic.com/2hzojrs.jpg\" alt=\"Image and video hosting by TinyPic\" border=\"0\">\n</a>\n</p>\n<p>Isn’t he just a suave little bugger?</p>\n<p>Harry Hart/Galahad - 25</p>\n<p>\n<a href=\"http://tinypic.com?ref=r23j1g\" rel=\"nofollow\">\n<img src=\"http://i60.tinypic.com/r23j1g.jpg\" alt=\"Image and video hosting by TinyPic\" border=\"0\">\n</a>\n</p>\n<p>I’m sorry, but look at that hair. That hair is that big because it is hiding the secrets of how to steadily get hotter with age from all the rest of us poor mortals.</p>\n<p>Merlin - 23</p>\n<p>\n<a href=\"http://tinypic.com?ref=52ateu\" rel=\"nofollow\">\n<img src=\"http://i60.tinypic.com/52ateu.png\" alt=\"Image and video hosting by TinyPic\" border=\"0\">\n</a>\n</p>\n<p>Finding pictures of young Mark Strong with hair is a lot more difficult than I thought. Ignore the pilot shirt.</p>\n<p>Ben/Lancelot - mid to late thirties</p>\n<p>\n<a href=\"http://tinypic.com?ref=mlgvfk\" rel=\"nofollow\">\n<img src=\"http://i62.tinypic.com/mlgvfk.jpg\" alt=\"Image and video hosting by TinyPic\" border=\"0\">\n</a>\n</p>\n<p>Yeah, let's be honest, you were already imaging him as Ben!Lancelot, weren’t you.</p>\n<p align=\"center\">***************************************</p>\n<p> </p>\n<p align=\"center\">***************************************</p>\n<p>The Doctor: <em>River, you and I, we know what this means. We are ground zero of an explosion that will engulf all reality. Billions and billions will suffer and die. </em></p>\n<p>River: <em>I'll suffer if I have to kill you. </em></p>\n<p>The Doctor: <em>More than every living thing in the universe? </em></p>\n<p>River: <em>Yes. </em></p>\n<p>— The Doctor and River Song</p>\n<p align=\"center\">***************************************</p>\n<p>Harry Hart at 25, Eggsy comes to realize quickly, is a profoundly different animal than Harry Hart at 50. And it isn’t like he wasn't aware that this would be the case before, had psyched himself up for this, but now, staring at the reality of it, it really is incredibly apparent. Harry at 50 had been all hard smooth polished edges and absolute confidence in his skills and his position in life. The Harry that stands before him now is shyer, softer, less confident in himself - more deferential, where his older self had been more assertive.</p>\n<p>Still, it isn’t that they’re bad changes, and they certainly don’t make Harry <em>less</em>, just...different.</p>\n<p>The sight of him shirtless as he punches his way through the two way mirror to drain the room of water and save all his fellow candidates is also...really <em>very</em> nice.</p>\n<p>The fact that he lets Lancelot give the “you failed at teamwork and check out that <em>totally</em> drowned person,” speech <em>might</em> be related to the erection that he’s currently sporting.</p>\n<p>It’s safe to say that Eggsy really <em>likes</em> this Harry.</p>\n<p>And then, as if he wasn’t already drowning in fucking <em>cuteness,</em> apparently Mr. Pickles started out as the runt of the litter because Harry picks the tiniest puppy as his dog, and Eggsy gets to watch him cradle it in his hands and let the little thing lick his face.</p>\n<p>Eggsy might die. He’s given it some serious thought. It’s possible the <em>adorableness</em> might kill him, where drug cartels and terrorists and megalomaniacal psychopaths have failed.</p>\n<p><em>The boy and his puppy were too cute</em>, it will read on his tombstone, Eggsy thinks, under his fake name.</p>\n<p>“<em>Mr. Pickles</em>,” Lancelot drawls mercilessly, because Lancelot has decided that Eggsy’s infatuation with Harry is just fucking <em>darling</em>, and Eggsy decides he won’t allow himself to die of the cuteness only if to not give Lancelot the satisfaction.</p>\n<p>The principal of the thing, and all that.</p>\n<p>“You’re just annoyed because he’s prettier than you,” Eggsy shoots back waspishly, barely looking up from the written candidate tests he’s grading, where naturally Harry has scored the highest again.</p>\n<p>He is the best candidate, and even without his knowledge of the future, Eggsy can see that Harry was born to be a Kingsman knight.</p>\n<p>It is, like Merlin’s eternal and timeless snark, a comforting thought.</p>\n<p>Lancelot, who Eggsy is pretty sure is supposed to be overseeing the target practice trials right about now, naturally ignores the quip and, after pouring himself and Eggsy both a generous sniffer full of brandy, sprawls himself out on the leather settee drawls, satisfied gleam in his eye, “So I am right, you do have your eye on him.”</p>\n<p>Eggsy intends to change the actual course of history for Harry. Needless to say, he’d like to have more than just his <em>eyes</em> on him.</p>\n<p>You can bet he’s not telling <em>Lancelot</em> that though.</p>\n<p>“Given how uncomfortable he is every time you sneak up behind me and cop a feel,” Eggsy says, shooting him a chastising look over the sniffer that bounces off Lancelot like rubber, “I don't imagine it’ll be something that I’ll have to worry about.”</p>\n<p>To be fair, the flirting Lancelot does with him in front of the candidates is only partially because he’s a handsy wanker. The other part is actually strategic, because homophobia is acceptable - and certainly by Arthur himself <em>preferred</em> - in Chester King’s Kingsman, right up until the part where it might interfere with a mission. Arthur’s ideal knight is one who would never actively seek out gay interactions, but also wouldn’t falter if a mission called for it, and so the candidates are screened rather discretely for what Eggsy disdainfully thinks of as ‘the proper balance of homophobia.’</p>\n<p>Occasionally, Eggsy thinks with great fondness on the <em>sound</em> Chester King made as he choked and died.</p>\n<p>Within those - truly offensive - guidelines though, Harry’s reaction is perfectly acceptable. There’s no disgust in his eyes, Eggsy is relieved to see, no moral outrage or pearl clutching, like there is with one of the posh wanker Oxford boys Eggsy’ll be all too glad to send home because he’s soundly failed his written exam. Harry’s just...uncomfortable whenever Lancelot’s hands linger on Eggsy a little too long, looks away with a truly appealing flush on his cheeks that Eggsy is hard pressed to read as anything other than ‘embarrassed straight boy.’</p>\n<p>Eggsy’d have bet his left testicle that the Harry of 2015 was at least bi - “popping cherries” his fucking arse - but this is not that Harry. This is the Harry of 1990, where heteronormativity and homophobia run rampant, and so ‘embarrassed straight boy’ is honestly probably one of the best outcomes Eggsy could have hoped for.</p>\n<p>It’s not much help to his persistent erection though.</p>\n<p>“To pretty straight boys,” Lancelot says, unaware of Eggsy’s inner musings, proposing a cheeky toast, which Eggsy returns in kind, before Lancelot unfolds himself off the couch and asks, with a wink, “Want to come see if your pretty boy can shoot?”</p>\n<p>He does.</p>\n<p>And naturally, of course Harry can, and really fucking well.</p>\n<p>At least being aroused by Harry’s sheer competence is too somehow, strangely comforting.</p>\n<p align=\"center\">***************************************</p>\n<p>They’re down to five by the time the parachute test rolls around, after losing two to the written exam - including Arthur’s pouncy twat of a candidate, a thought that brings Eggsy more joy than it should - and and one to the marksmanship tests. As such, the field is now made up of Harry, Lancelot and Eggsy’s own picks, and two more posh private school boy types that Eggsy has taken to calling ‘Charlie’s’ in the privacy of his own head.</p>\n<p>Ah, Charlie. Punching him in the face still remains a fond memory.</p>\n<p>Still, Eggsy figures they’ll lose two more with the parachute test, and his money is on one of the Charlie’s and his own pick, because Eggsy’d chose him solely for this reason to give Harry a better shot at the seat.</p>\n<p>Can’t hurt to stack the deck, after all.</p>\n<p>However, his candidate also hasn’t made his fear of heights a secret, and that nervousness comes over the coms clearly to Eggsy, Merlin and Lancelot who are watching on the monitors, prompting a probing look from Lancelot as the candidates make the jump.</p>\n<p>“You’ve picked a candidate you knew was going to fail,” Lancelot muses slowly, ever sharp, as they watch the little dots plummet towards the earth on the monitor and, sure enough, Eggsy’s marine panics and pulls far too soon, before Merlin’s even delivered the hook.</p>\n<p>“Have I now?” Eggsy says, a little enigmatic smile on his face as Merlin decrees over the comms that <em>if, for example, one of your group had no parachute</em>, and Lancelot only shakes his head and decrees bemusedly, as one of the Charlie’s panics the fuck out and is generally useless, “You’re a strange one Tristan.”</p>\n<p>Given that this conversation is taking place nearly a year before Eggsy is even <em>born</em>, he thinks that might be a <em>bit</em> of an understatement.</p>\n<p>“Always, Lancelot,” Eggsy says, to the sound of Harry making a plan for the candidates to pull their chutes in pairs, a satisfied smile on his face.</p>\n<p>He wonders if Harry’d felt this way, seeing himself in Eggsy the way Eggsy sees himself now in Harry.</p>\n<p>This time travel thing is some Inception level shite sometimes, Eggsy muses with a smirk.</p>\n<p>The useless Charlie misses the target by at least 10 yards, while other Charlie, Lancelot’s candidate and Harry all land in it, under the radar line. And Eggsy’s got this plan of going up and maybe putting a congratulatory hand on Harry’s shoulder, because the sight of him all flushed with adrenaline and victory is a temptation too strong for the likes of Eggsy, when the useless Charlie stars whining about <em>the trouble they’ll be in when his father hears about this</em>, and yeah, Eggsy just can't resist.</p>\n<p>“No, you don’t talk to me like that,” Eggsy purrs lethally, putting on his best <em>I’ve killed better men than you before breakfast</em> eyes as he...borrows another line from Merlin, because yeah, Merlin had all the best quips, “You have something to say to me, you come up to me and you <em>whisper it in my ear</em>.”</p>\n<p>He takes great satisfaction in the fact that the boy is too weak to come up to him and do so.</p>\n<p>And then he walks up to Harry, whose looking at him with rewardingly wide eyes, and gives him a solid shoulder squeeze and a warm, “Good work,” and then strolls away without a second look, just because he can.</p>\n<p>And that, Eggsy thinks, remembering with fondness a police station three decades from now, is how you make an <em>exit</em>.</p>\n<p>“Have I mentioned you’re a sight when you’re like that, all lethal and sexy?” Lancelot drawls as Eggsy makes his way past him on the stairs, falling in step with him and shooting him a look that Eggsy might best describe as <em>indecent</em>, “Those poor boys could hardly handle it, especially <em>your</em> boy.”</p>\n<p>He’s mentioned Lancelot’s an arsehole, right?</p>\n<p>“You need to have your eyes checked Lancelot,” Eggsy says, because for all he’d like to believe that’s true, Harry still ducks his head whenever Lancelot comes within 10 feet of him, which isn’t the most inspiring sign of interest.</p>\n<p>The sight of Harry blushing, at least, remains as appealing as ever.</p>\n<p>“Lancelot needs to have his brain checked,” Merlin says dryly, falling into step with them, and then to Eggsy, over the sound of Lancelot spluttering over-dramatically in faux offence, “Still, I might steal that line one day.”</p>\n<p>“Please,” Eggsy says magnanimously, because Eggsy too is, occasionally, an arsehole, “Feel free.”</p>\n<p>Man’s gotta have a little fun in life, after all.</p>\n<p align=\"center\">***************************************</p>\n<p>No matter the time period, Eggsy decides, getting almost blown up still sucks<em> balls</em>.</p>\n<p>Waking up in the infirmary wing afterwards is no fun either: still, he makes himself do a inventory, as he always does in situation’s like this. Emergency mission in Mumbai that called him away from the training? Check. Cartel dispatched, hostages retrieved? Check. Bungled extraction resulting in him nearly getting blown the fuck up?</p>\n<p>Check, Eggsy thinks with a wince, taking in the bandages on his chest likely concealing a burn or two, and lingering headache he’s got from colliding with the ground after getting flung through the air from the IED explosion.</p>\n<p>A boyishly adorable Harry and his dog curled up, dozing on the bed beside his arm? Check.</p>\n<p>Wait, <em>what?</em></p>\n<p>But no, Eggsy discovers, his eyes aren’t playing tricks on him, because yes, that is absolutely Harry and Mr. Pickles <em>sleeping at his fucking hospital bedside</em>, and Harry’s all tousled hair and the innocent, open face of the slumbering, and if Eggsy wasn’t dying before he <em>absolutely</em> is now.</p>\n<p>Eggsy’s hand literally <em>twitches</em> with how much he wants to run a hand through that bloody <em>hair</em>.</p>\n<p>He is so <em>fucked</em>.</p>\n<p>“And here I was worried about you being lonely down here,” drawls a voice that most assuredly belongs to Lancelot, and Harry startles awake violently at it. Then he mumbles some apology with his eyes firmly fixed on his feet, gathers his dog and disappears from the room so fast Eggsy’s surprised there isn’t a little cartoon trail of smoke left in his wake.</p>\n<p><em>Lancelot</em>, Eggsy thinks sourly, <em>is an arsehole with awful fucking timing</em>.</p>\n<p>“You know, I feel like he might not be as straight as originally thought,” Lancelot says musingly, shite eating grin on his face, as he takes the seat beside Eggsy’s bed and props his legs obnoxiously on the side of Eggsy’s bed.</p>\n<p>Given that right now Eggsy’s greatest desire is to go after Harry, pin him to the nearest wall, stick his hands in that <em>hair</em> and snog him until they both can’t walk straight, Eggsy can only hope he’s right.</p>\n<p>“Get away from me,” Eggsy grumps, shoving half-heartedly at Lancelot’s feet instead, because there is a thing as revealing too much and Eggsy’s dangerously close to that line. Thankfully, he’s saved by the appearance of Merlin, who wanders in with his favoured clipboard, prompting Eggsy to ask the only partially inane, “What are you doing here?”</p>\n<p>“I have a medical degree?” Merlin responds dryly, and then, at Eggsy’s raised eyebrow - because Merlin might have a medical degree, but Eggsy’s mostly fine and Merlin’s no sitting at your bedside type, so he’s certainly not here just because of that - he capitulates and admits his actual reason for being there as he says, with a shrug, “Belvedere’s been called away on an emergency evacuation in Beruit. Arthur wants you take over his candidate until he’s back.”</p>\n<p>There’s the Merlin he knows.</p>\n<p>“Oh, Tristan shouldn’t have any problem ‘taking over’ with his pretty boy,” Lancelot practically <em>purrs</em> loquaciously, waggling his eyebrows outrageously at Eggsy.</p>\n<p>And <em>there’s</em> the Lancelot he knows.</p>\n<p>“Get fucked,” Eggsy shoots back, and resists the ever tempting urge to flip him off, because Eggsy is, in fact, a gentleman.</p>\n<p>“You offering?” Lancelot teases, blinking his eyes in a coltish parody and Merlin, in the periphery looks like he’d be fine if they both got hit by lightening and Eggsy realizes, quite suddenly that this is his life. That trading quips with Lancelot, getting snarked at by Merlin, saving the day and nearly getting blown up, and a young man with distracting hair that means with world to him have become his new normal. That here, in a time that should be alien to him, he’s found a place, carved out a life here that now he can’t imagine not having.</p>\n<p>This is his life, and he loves it.</p>\n<p align=\"center\">***************************************</p>\n<p>There’s probably a special hell, Eggsy thinks, for people who contemplate having sex with someone tied to railroad tracks only seconds after they realize they didn’t die.</p>\n<p>Harry is panting from adrenaline, flushed, hair windswept and mussed from the train, and his voice is a little hoarse from shouting about how <em>he’s never heard of Kingsman, or anyone called Tristan.</em></p>\n<p><em>Worth it</em>, Eggsy decides, and then makes himself push that thought away and gets down to the business of cutting Harry free, and throws in a “Bloody well done,” for good measure, because he <em>can</em>.</p>\n<p>The appealing flush of <em>pride</em> on Harry’s cheeks is just an added bonus.</p>\n<p>“I’m afraid Belvedere got called away and you’re stuck with me for the next 24 hours,” he continues, to Harry’s questioning look, a little bit apologetic, because Harry’s been doing his level best to pretend that the whole infirmary scene hadn’t happened at all and so Eggsy imagines that this probably isn’t news he wants to hear, despite Eggsy’s own feelings on it.</p>\n<p>Or, Eggsy’s really in quite close proximately to Harry right now, cutting him off these tracks, and also very glad the cut of his suit jacket is so <em>long</em>, is all he’s saying. He hasn’t been this perpetually aroused since...</p>\n<p>Well, to be fair, the last time he was training with Harry, Eggsy thinks with some amusement.</p>\n<p>“No sir, that’s quite...<em>alright</em>,” Harry says, all earnest enthusiasm as he rubs his freed wrists to return circulation, and Eggsy curls his hands into his pockets so he doesn’t reach out and offer to help. And then Eggsy finds himself wondering, <em>great, now what the fuck do I do</em>, because Harry’d just taken him to his home for those 24 hours, but Eggsy’s not sure if that’s standard operating procedure or not.</p>\n<p>He feels like the answer is probably <em>not</em>.</p>\n<p>So fuck it, after Merlin finishes the last two candidate debrief - Harry and Lancelot's candidate, because the second Charlie folded like a house of cards when confronted with the idea of 'death by train' - Eggsy invites Harry to his home, because Eggsy’s never been much for the rules anyways, and it’s all worth it when Harry accepts with this little smile on his face that Eggsy thinks he’d move mountains for.</p>\n<p>It’s only 24 hours, he reminds himself. It’ll be fine.</p>\n<p align=\"center\">***************************************</p>\n<p><em> This</em>, Eggsy decides, watching Harry as he looks at his wall of articles, standing in his home like he <em>belongs</em> there, <em>was a terrible idea</em>.</p>\n<p>Because, Eggsy realizes, quite suddenly, that he’s looking at Harry and not seeing two Harry’s, not the Harry of then and now, but rather, just <em>Harry</em>. And that, the Harry he sees, is the Harry he <em>wants</em>. He doesn’t want the Harry of now because of what he will become; he just wants Harry, whose deep brown eyes shine at him, whose hair tempts Eggsy’s hands no matter if it is sleek and tamed or fly away and fluffy. Harry, who has always looked at him like no one else has, and Harry, who is the only person whose ever made him feel such<em> tension</em> from just a movement or a look.</p>\n<p>Eggsy realizes that the man he’s been calling <em>this Harry</em> has really just been <em>Harry</em> all along.</p>\n<p>He’s Harry, and Eggsy <em>loves</em> him.</p>\n<p><em>Quite a day for epiphanies</em>, Eggsy thinks, looking towards his liquor cabinet with a certain <em>longing</em>.</p>\n<p>And Harry, just <em>Harry</em>, the Harry he loves is looking at him, and Eggsy wants <em>so many</em> things.</p>\n<p>“I don’t suppose,” Eggsy says, to that shyly inquisitive face, grasping at the familiar as a defence against letting slip all the things he’d like to ask, to <em>have</em> of Harry, “You’d like to learn how to make a gentleman’s martini?”</p>\n<p>“Yes please sir,” Harry says, all earnest enthusiasm, looking up at him with those damn wide eyes, and the fact that he doesn’t fuck Harry over his desk is truly a testament to Eggsy’s self restraint.</p>\n<p>The night ends with Eggsy bundling a flushed, tipsy Harry into his guest room, and if he runs a hand through that silky soft <em>hair</em> as he pulls the covers up, soft and <em>reverential</em>, he thinks ever saints would forgive him the temptation.</p>\n<p>In the morning, Eggsy makes eggs and toast for a still sleep foggy Harry, whose hair sticks up in adorable tuffs, and they eat in comfortable silence.</p>\n<p>Eggsy cannot think of a moment where he’s ever been happier.</p>\n<p align=\"center\">***************************************</p>\n<p>Harry shoots the dog, because Harry is a Kingsman, and Harry was always going to shoot the dog.</p>\n<p>Eggsy thinks now, actually, might be the happiest he’s ever been.</p>\n<p>“Galahad,” Eggsy says, offering his hand to their newest knight, and after five years of being a Kingsman, in a time weeks before he’s even born and both five years after and twenty-five years before Harry’s death, Eggsy finally gets to shake Harry’s hand as an equal, Kingsman to Kingsman.</p>\n<p>“Tristan,” Harry says, taking it, flushed with pride and smiling <em>oh so</em> beautifully, and in that moment, Harry’s hand in his, everything is alright in Eggsy’s world.</p>\n<p align=\"center\">***************************************</p>\n<p>Arthur, Eggsy’d just like it known, is a fucking <em>cunt</em>.</p>\n<p>See, the thing about Arthur is; he’s not bad at his job. Eggsy can admit that freely and without prejudice; Chester King has a knack for pragmatism, a skill for appropriate delegation, and the slick, smooth talking skills needed to play the politics implied in running an international clandestine spy agency.</p>\n<p>Unfortunately, Chester King also has quite the streak of ruthlessness in him, and that combined with his utter distain for what he perceives as weakness is what’s causing a problem right now. Because apparently it didn’t just come to Lancelot's and Eggsy’s attention that Harry’d been uncomfortable around their flirting, but Arthur’s as well, and Arthur’s the kind of bloke that likes to find a person’s weak spot and then just press down there until you<em> flinch</em>.</p>\n<p>So, after a few solo missions to ease the new Galahad in, Arthur sends them on a mission to the favourite gay club of a corrupt Russian politician, where the plan is to have Harry and Eggsy pose as a couple looking for a third, lure him up to their room and knock him out and steal the codes he has.</p>\n<p>Or, in other words, Arthur smells a weakness in his newest knight, and so he wants to see what Harry will do when told to sit on Eggsy’s lap and <em>writhe</em>, because Arthur is, once again, a fucking <em>cunt</em>.</p>\n<p>Harry, standing in their hotel room in Russia, looks so bloody <em>uncomfortable</em>, barely able to meet Eggsy’s gaze.</p>\n<p>Chester King, Eggsy thinks, not for the first time, died far too <em>quickly</em>.</p>\n<p>Still, they do have a job to do, and so, although Eggsy’d prefer to have this conversation the first of <em>never</em>, he clears his throat for Harry’s attention and begins, as levelly as he can, “If we’re going to work this mission, I feel like we might want to...clear the air so to speak.”</p>\n<p>“Sir?” Harry asks, looking more liked a trapped rabbit than a man who just last week single handedly took out a drug cartel, and Eggsy takes another second to cast aspirations on the state of Arthur’s parents martial status at the time of his conception.</p>\n<p>Cunt <em>bastard</em>.</p>\n<p>“Gary if you please, Tristan if you must,” Eggsy says, instead of, <em>if you keep calling me sir in that tone I won’t be responsible for my actions</em>, “But never sir - you’re a knight now, an equal.”</p>\n<p>And then, getting back on topic he continues, as diplomatically as he can, trying to infuse a non- judgemental air into his tone to set Harry at ease, “I, and Arthur, to be sure, couldn’t help but notice how...uncomfortable this sort of thing between Lancelot and I made you during the training.”</p>\n<p>“It wasn't that!” Harry protests passionately in response, “It was...” and then he loses momentum and trails off, looking down with what looks like embarrassment at his oxfords, and Eggsy feels a wave of fondness wash over him, because Harry really is such a good hearted man.</p>\n<p>“It really is alright, you can’t help the way you feel,” Eggsy says, and he really does mean it, because Harry’s a product of his environment as much as anyone else is, and he’s still the greatest man Eggsy’s ever met, “I’m really not offended.”</p>\n<p>“No, sir!” Harry exclaims loudly, looking frankly as <em>horrified</em> as Eggsy’s ever seen him, standing practically at attention by the window.</p>\n<p>“Galahad, what did I just say about - ” Eggsy says, running on auto pilot, because it’s easier than confronting their actual problem, and perhaps that’s why he’s so startled by the abrupt appearance of Harry in his personal space, and the sudden, shocking wet <em>warmth</em> of Harry’s mouth on his.</p>\n<p>And it’s clumsy and sloppy, a little too much teeth and Harry clearly doesn’t know how to angle his head, because their noses bump together, and it’s over before it can really even begin.</p>\n<p>And yet...it’s <em>Harry</em> kissing him.</p>\n<p>It’s <em>perfect</em>.</p>\n<p>“<em>Oh</em>,” Eggsy says stupidly, staring at Harry, <em>Harry</em> who just <em>kissed</em> him with what he’s sure is something akin to stunned <em>wonder</em>, as he finally gets it, “Oh I see. You were <em>jealous</em>.”</p>\n<p>“Yes s - Tristan,” Harry says, looking miserable, and he can’t even feel sorry for that, because the sheer wave of joy that seems to permeating ever cell of his body won’t let him. Because now he knows that all those looks, all those flushes and smiles were Harry <em>wanting</em> him, and Eggsy thinks he might not ever be anything other than <em>happy</em> again.</p>\n<p>“You had no reason to be,” Eggsy says, knowing no truer words have ever been spoken, before he continues, more serious than before, because this is something they need to clarify before anything else happens, “Lancelot and I’s relationship is most assuredly over. However, it was also entirely free of strings, not exclusive. Is that what you are looking for here?”</p>\n<p>“No,” Harry says, to Eggsy’s great relief, with growing confidence. And so Eggsy finally gives into the temptation that’s been plaguing him for months, and threads his hands through that damned <em>hair</em>, uses it to guide Harry’s face to his so he can whisper teasingly onto Harry’s wanting lips, “Good, me neither. I find myself wanting exclusivity and all <em>kinds</em> of <em>strings</em> with you.”</p>\n<p>“Yes <em>please</em>,” Harry says, sounded somewhat dazed and stunned, and yeah, that’s it for Eggsy’s self restraint as he <em>takes</em> that <em>oh so</em> tempting mouth in a kiss that <em>certainly</em> isn’t gentlemanly, nibbling in and then <em>conquering</em>, a play of teeth and tongue that leaves them both breathless.</p>\n<p>Harry, he’s pleased to discover, is a bloody <em>natural</em> at kissing.</p>\n<p>“Is this your first time with a man?” Eggsy asks, pushing Harry down gently onto the bed behind them, and taking a second to admire the <em>picture</em> he makes there, all wild hair from Eggsy’s hands and slick, <em>swollen</em> lips from his kisses. And then, once he’s looked his fill, he crawls lithely over him to rest on his hands and knees, and gets to the business of finally getting a look at that cock that’s occupied far too much of his thoughts already.</p>\n<p>Harrys gasps, so <em>prettily</em> as Eggsy gets his hand around his prick, already hard and <em>weeping</em>, and it’s a sight that doesn’t disappoint, because Harry’s a nice big boy, uncut with a nice wide head that makes Eggsy’s mouth <em>water</em> from wanting it.</p>\n<p>And then Harry stutters out a “Ye - yes,” in answer to his question, and Eggsy’s cock, which was already hard enough to pound nails with gets impossibly harder at knowledge that he’s the only one who has ever had the privilege of doing this to Harry, that he gets to be the <em>first</em> man who does this to him.</p>\n<p>Eggsy thinks he might owe those angels a fruit basket or something.</p>\n<p>“I won’t fuck you here,” Eggsy purrs, freeing his own cock and fisting their erections together, savouring the velvet warmth Harry’s cock pressed against his own as he starts jacking them both off lazily. “I’ll wait, until we have all the time in the world. Until I can <em>savour</em> you the way you deserve.” And then, with greater intensity, now fucking shallowly into the cradle of his hand, a move that Harry mimics with desperate, <em>stuttering</em> thrusts, eyes <em>huge</em> as Eggsy keeps whispering his <em>fifth</em> in his ears, “And then I’ll lay you out on my sheets, and find every <em>single</em> spot that makes you gasp and shudder and <em>moan</em>, until my name is the only word you can remember.” And then Eggsy finishes lowly, combining a little <em>nip</em> to the meat of Harry’s ear with a flick of his wrist that never fails, “And maybe then, when you’re beyond even <em>begging</em> for it, I’ll finally <em>fuck you</em>.”</p>\n<p>The sight of Harry <em>desperate</em>, panting and shuddering as he comes all over Eggsy’s hand and ridiculously expensive bespoke trousers, is most one of the most <em>beautiful</em> he’s ever seen. Naturally, it’s that sight that pushes him over the edge, orgasm bursting from his spine to sweep him under, and if his trousers weren’t ruined before, they certainly are by the time Eggsy’s finished coming.</p>\n<p><em>He was due for a new suit anyways</em>, Eggsy thinks with a mental shrug, and then makes with the business of grabbing a few tissues from the beside table to try and elevate the worst of the wet spot.</p>\n<p>Harry’s appealing post-sex lethargy makes easy work out of the clean up, and so Eggsy tosses the soiled tissues and then crawls up to lay beside Harry, bodies turned towards each other and head to head on the same pillow, close enough to share breath. Eggsy amuses himself with running his fingers over the smooth, soft lines of Harry’s face, memorizing him, and Harry leans only further into it, practically purring under the attention. “Gary,” Harry tries out, clearly testing the word on his tongue, and finding it lacking, if the little frown that appears on his face is any indication. And Eggsy gets it, because he’s never liked it, and it has the added downside of making them Harry and Gary and yeah,<em> no.</em></p>\n<p>“I would very much like it if, when it’s just the two of us, you’d call me Eggsy,” Eggsy says softly, running his thumb over those puffy, kiss swollen lips, because in this one way he wants to he selfish, to have Harry call him his <em>name</em> and damn the consequences, “It’s a...nickname from my past I’ve missed hearing.”</p>\n<p>“Eggsy,” Harry says, smiling at the sound of it, and Eggsy sighs out only “Harry,” and then he can’t help but close the tiny distance between them kiss him, soft and sweet, because<em> finally</em>.</p>\n<p>Needless to say, they <em>ace</em> the mission.</p>\n<p>“The...issue has been quite...<em>worked out</em>, I assure you,” Eggsy drawls, with a smirk over his sniffer of scotch to Arthur at the debrief. And Arthur looks like he’s sucking on lemons or something, but every day that Arthur wakes up alive is a gift from Eggsy and they both know it, so Arthur only says, from behind teeth a little more clenched than normal, “Good job on a successful mission,” and that’s all that’s said on the matter.</p>\n<p>“For the love all all that's good and holy, please get in the habit of turning off your recording equipment,” is Merlin’s dry response, and if Eggsy intends to make Merlin suffer at least once when he finally develops the recording glasses, well that's his right, isn’t it?</p>\n<p>“I’ve been replaced,” is Lancelot’s response, not sounding all that broken up about it - and frankly looking terribly delighted over it, the utter <em>prick</em> - because he and Lancelot were never that sort of thing.</p>\n<p>“He has better hair,” Eggsy quips back to him, and Lancelot rears back over-dramatically, like he’s been <em>struck</em> and hisses, hands over his heart, all faux offence, “Lies, vicious <em>lies</em>,” and Eggsy laughs, long and strong, because he’s just so <em>happy</em>.</p>\n<p align=\"center\">***************************************</p>\n<p>After almost a month of missions, dates in little restaurants with candlelight, soft kisses at the door that lead to frenetic hand jobs and frotting up against the wall, Eggsy finally makes good on his word.</p>\n<p>He lays Harry out on his bed, and spends <em>hours</em> discovering Harry with his hands and his mouth, every single part that makes him gasp and <em>whimper</em> and <em>moan</em> beneath him. Sucks him off leisurely until Harry is <em>panting</em>, stripped of restraint and even of <em>words</em>, and then spreads him open <em>oh so</em> slowly with lube slick fingers, until that tight, <em>virgin</em> muscle is loose and <em>open</em>.</p>\n<p>Sliding into Harry, finally, bottoming out in that <em>tight</em> warmth, is like coming <em>home</em>.</p>\n<p>Fucking him, Harry’s <em>oh so flexible</em> young legs up round his shoulders, until they both come so hard they nearly go <em>blind</em>, is also really very <em>fantastic</em> too.</p>\n<p>“I love you,” Harry says softly, shyly, when they’ve finally come back to themselves, slick and sated, head resting over Eggsy’s heart. And Eggsy...</p>\n<p>Eggsy wishes that there were words in the English language to describe how he feels for Harry. Because it seems so trivial to call this thing he feels for Harry love, when it is so much more. Eggsy <em>lives</em> for Harry, for the sound of his footsteps on the stairs in the morning, to the feel of his hair between his fingers, and every beat of his heart that Eggsy thought he’d never get to have with him. Eggsy’s devotion for Harry is such that he’s willing to risk erasing himself from existence to ensure his survival, would consider it worth it for every precious second he’s had with him. Harry means so much to him that Eggsy is <em>literally changing the course of recorded history for him</em>, is aiming to create an entirely new <em>universe</em> for the sole purpose of ensuring that Harry lives past February 14th, 2015.</p>\n<p>Harry is Eggsy’s <em>everything</em>.</p>\n<p>“I love you too,” Eggsy says instead, because those are the words that he has, and from the way that Harry lights up, all beautiful and <em>brilliant</em> at them, he knows they are more than enough.</p>\n<p>This is his life, and it’s pretty damn <em>perfect</em>.</p>\n<p>And so, that’s how it comes to be that by the end of 1990, Eggsy has added 23 more articles on his wall - 12 from him, and 11 from Harry - and his house is now home to two small dogs and two <em>stupidly</em> happy men.</p>\n<p>1990 ends up being the year that Eggsy stops naming the years, because it and all the ones that follow are all years of <em>Harry</em>, and thus years of <em>happiness</em> and <em>love</em>.</p>\n<p align=\"center\">***************************************</p>\n<p align=\"left\">More candidate Harry, because <em>reasons</em>. </p>\n<p align=\"left\">\n<a href=\"http://tinypic.com?ref=igbu2t\" rel=\"nofollow\"> <img src=\"http://i60.tinypic.com/igbu2t.jpg\" alt=\"Image and video hosting by TinyPic\" border=\"0\"> </a>\n</p>\n<p> </p>\n<p align=\"center\">***************************************</p>\n<p align=\"center\"><em>“And will I tell you that these three lived happily ever after? I will not, for no one ever does. But there was happiness. And they did live.”</em> ― Stephen King, The Dark Tower</p>\n<p align=\"center\">***************************************</p>\n<p>Eggsy may stop naming the years, but they still pass, and they are all good years. To Eggsy’s secret joy - and Merlin's long suffering sighs - Harry and he become ‘that couple,’ the disgustingly happy, sappily in love one. They flirt their way through missions - that they absolutely ace, by the way - have a ridiculous amount of mind-blowing sex - occasionally, on said missions - and also watch stupid telly and silly movies curled up at home with JB and Mr. Pickles on respective laps.</p>\n<p>It is, Eggsy thinks, an amazing way to go through life.</p>\n<p>And so, after their first year together, Eggsy begins to measure the passage of time in <em>anniversaries</em>, and never for one second takes for granted the miracle that it is that he can do that.</p>\n<p>And even when it goes wrong, they still make it better. Eggsy gets kidnapped by a terrorist cell in Russia a month after their 2nd anniversary, and Harry <em>obliterates</em> them, freeing him from his shackles with hands that shake in relief and in residual fear.</p>\n<p>The sex afterwards, desperate and <em>shaking</em>, all an affirmation of life and love, is some of the best he’s ever had in his life.</p>\n<p>A year later, he returns the favour when his lover is taken by Bosnian mercenaries, and when he pulls the bag off of Harry’s head and watches his lover blink back at him, there is blood in his <em>teeth</em>, love in his heart and relief in his veins.</p>\n<p>Eggsy thinks even now, there are probably people there telling their children terrifying tales of the things they did for love.</p>\n<p>Waking up all wrapped up in Harry, warm and lovely in the mornings, he can’t find it in himself to care.</p>\n<p>For their 4th anniversary Harry and he end up buying their own place - the posh house that had been just Harry’s before, on it’s little roundabout as a matter of fact - where they knock out one of the walls and build a bigger office, because they are definitely running out of walls for stupid, <em>wonderfully</em> mundane articles.</p>\n<p>Pair of gentleman <em>rockstar</em> spies they are.</p>\n<p>Their fifth year together is the one where Merlin finally gives up the ghost and shaves his head. That year Lancelot buys him shampoo for his birthday, because Lancelot is still, as ever, a <em>wanker</em>.</p>\n<p>Merlin retaliates by replacing Lancelot’s own shampoo with Nair.</p>\n<p>Needless to say, their sixth anniversary takes place in the middle of a vicious no holds barred prank war, that leaves no clear winner and very few people unscathed.</p>\n<p>Harry is particularly unimpressed by his sudden ownership of a a bright pink pair of Oxfords, though Eggsy’s of the opinion they look quite lovely slung up round his shoulders as he fucks Harry until he’s <em>hoarse</em>.</p>\n<p>All in all, a pretty great way to celebrate his 35th birthday, Eggsy thinks.</p>\n<p>Honestly, it’s such a lovely way to live that he even forgets sometimes that there is a ticking clock to all of this. Laying with Harry on their couch, he forgets that this miracle that he has found himself in is not free, is not unlimited. Flirting shamelessly with Harry on a mission, it is easy to forget that that this is a show with a steep price of admission, and that payment is soon to be due.</p>\n<p>He’s just so caught up in being <em>happy</em>.</p>\n<p>And then, one day, sometime around their 7th year together, when Eggsy is up early making breakfast for Harry, he catches a particular name of the morning telly he has one for background noise, and it comes crashing back to him.</p>\n<p><em>Richmond Valentine takes Valentine Industries public</em>, the news scrawl proclaims brightly, innocently, as it runs a PC friendly shot of a younger Richmond Valentine in his customary track suit. It’s a face Eggsy could never forget, no matter how much time travel he did, and suddenly, the bacon becomes drastically less important than it was a moment ago as time, the sneaky bitch, finally catches up with him.</p>\n<p>Because, Eggsy realizes, it is 1997, and although he is 36, he is too also 6, and somewhere in this city a little boy that he once was is probably getting up for the day. A boy who is having his breakfast made by his smiling mum and his hair ruffled by his <em>oh so alive</em> father.</p>\n<p>Somewhere in this city, there is a little boy whose happiness ticks on a countdown clock that only Eggsy can see, and Eggsy doesn’t know what to do.</p>\n<p>In a year or so, Lancelot will die, and Harry will nominate Lee Unwin, a marine with a seven year old son, for the position, where he will die in a training accident, leaving that little boy fatherless and his wife a widow.</p>\n<p>And Eggsy doesn’t know if he’s going to save him.</p>\n<p>“Breakfast?” Harry enquires hopefully, mumbling from behind him, pulling him from his thoughts to the much more pleasant sight of a truly sleepy Harry, hair all tussled from sex, a hand rubbing one eye in a useless attempt to push the grogginess out.</p>\n<p>Harry, Eggsy knows now, from long standing experience, is <em>not</em> a morning person.</p>\n<p>The picture he makes fills Eggsy heart so full of love, it nearly bursts. The list of things he would not do for this are a very short one indeed. Perhaps he will save Lee Unwin. Perhaps he will not. It is a query that demands more thought, to be weighed against what he can get away with and still be allowed to keep Harry, <em>oh so</em> alive.</p>\n<p>Valentine, on the other hand...</p>\n<p>“Of course love,” he says, presenting Harry with his much needed morning coffee, and steals a kiss from those soft, plush lips.</p>\n<p>And smiles.</p>\n<p>That’s a much easier decision.</p>\n<p align=\"center\">***************************************</p>\n<p><em>It should have been harder than that</em>.</p>\n<p>It’s Eggsy first thought as he stares down at the cooling corpse of Richmond Valentine, bullet hole dead centre to the forehead, pulseless beneath Eggsy’s fingers.</p>\n<p>You can be <em>damned</em> sure Eggsy checked the body. It ain’t that kind of movie, and all that.</p>\n<p>And perhaps it is a strange thought, but it is the one he is left with. <em>Not should I have done this?</em>, for he has always known that it would come to this. Megalomania, that strange faith that Valentine had had in his ideals does not listen to reason, to the rational. No man who paints himself and his genocide of innocent people as the biblical Noah and his ark was going to be swayed by the persuasiveness of Eggsy’s argument, he’s always known that. From the moment he arrived here, and realized that he could keep Harry safe this was always the end point that they would arrive at. That he would stand over this man’s corpse as his killer again, for 400 million lives and Harry, Harry, <em>Harry</em>.</p>\n<p>Always Harry.</p>\n<p>But given how much trouble that it had involved the first time, Eggsy almost feels a little cheated now. This might have been a Richmond Valentine with all of his world ending fervour, but it too was one without his paranoia or his military might. A few tranq darts for the security guards, a little tampering with the security cameras, and a single bullet and Eggsy’s just prevented the largest genocide in recent history before it even began, and no one, not even Merlin will be able to prove it was him.</p>\n<p>It just seems so <em>easy</em>.</p>\n<p>“You killed him,” a little voice says from behind him, not a question and yet not an accusation either. And Eggsy whips around and sees, with dawning horror, that the clear, smooth voice belongs to a <em>child</em>, a girl no more than ten, standing in the doorway, all rumpled night gown and smooth plastic where her legs should be.</p>\n<p><em>Tempting fate</em>, Eggsy thinks, looking into the soft, intelligent eyes that regard him unblinkingly, brown hair pulled into two braids with little white bows at the ends of them. <em>He’d been tempting fate</em>.</p>\n<p>Usually, if it feels to easy to be true, it is.</p>\n<p>“Yes,” He says finally, quietly, to the eyes that regard him so steadily for someone so young, before be asks, trying to be as nonthreatening as possible in his query as a man standing over another dead man’s body with a gun in his hand can be, “What’s your name?”</p>\n<p>“Gaby,” She says, softly yet unafraid, strange and remarkable, and suddenly, Eggsy <em>gets</em> it. He can see, in a moment’s clarity how the soft vowels of her name could have become twisted under the lisping accent that Valentine had flaunted. How easily little Gaby, with her soft B’s could have become Gazy, with her oh so sharp Z’s.</p>\n<p>Her <em>oh so</em> sharp <em>everything</em>.</p>\n<p>This little girl, with her braids and her big brown unafraid eyes, is<em> Gazelle</em>.</p>\n<p><em>This</em>, Eggsy thinks, of the loyal killing machine that Gazelle had been, so much more than Valentine had really deserved, <em>explains a lot</em>.</p>\n<p>“He was a bad man?” The little girl who once grew up to be a woman Eggsy had to kill asks, head tilted as she tries to figure out what has happened, and Eggsy can’t help but admire her insight, <em>oh so</em> keen.</p>\n<p>“He was going to do a very bad thing,” Eggsy says, because for all that killing Valentine won’t keep him up at night, for all that he knows his own actions were justified, he thinks calling Valentine “bad” would do the man a great disservice. Valentine was a madman, true, but Eggsy’s lived too long now in the realms of grey that make up the world of espionage not to recognize that there was good in Valentine’s intentions, for all that he had certainly used them to pave a first class road to hell.</p>\n<p>“He was going to hurt a lot of people, so I stopped him,” Eggsy settles on instead, and takes a small, cautious step towards her, and then another when the first isn’t met with a withdrawal, until he’s close enough to crouch down, lowering himself to her eye level.</p>\n<p>Gaby nods, accepting this, and Eggsy thinks a girl as bright as her had probably had her own suspicions on the kindness of men like Valentine. And then she turns her big eyes to Eggsy and asks, still so unafraid, “What’s going to happen to me now?”</p>\n<p>And well, Eggsy finds he only has one answer to that.</p>\n<p>“I don’t have a house as grand as this one” Eggsy finds himself saying, and for all that it’s spontaneous and stupid and perhaps the most unadvised thing he’s ever said, it’s somehow also the one he means most, “But I do have a nice house, and a very nice man and our two dogs live there with me, and I’m sure there’s room for a special little girl there as well, if you’d like to come.”</p>\n<p>As a tool of Valentine’s, Gazelle had been a force of nature, and the only person he’d ever had felt a twinge of something that might have approached regret for killing that day. Now, with the opportunity to change that, to give this remarkable little girl what Harry once gave him - the opportunity to become more - how can Eggsy not even try?</p>\n<p>Eggsy’s just saved 400 million people. He’d like to save one more.</p>\n<p>She looks at him, stares <em>into</em> him for a moment, and then puts her little soft hand in his.</p>\n<p>And Eggsy gathers her up, and takes her home.</p>\n<p align=\"center\">***************************************</p>\n<p>In retrospect, Harry’s incredibly high eyebrow is probably the best response Eggsy could have expected when showing up back home after disappearing in the night, not telling him where he was going and then showing up with a child in his arms.</p>\n<p>He feels like he might be breaking a relationship rule here. Maybe. Just a little bit.</p>\n<p>“So, I probably should have asked your opinion on children before bringing one home, rather than after huh?” Eggsy says sheepishly, running his free hand reassuringly over Gaby’s hair where her head rests in the crook of his neck, just the right height for her as she sits, propped on one of his hips.</p>\n<p>“What’s her name?” Harry simply asks, eyes tracing the motion of his hand, and that’s all he asks, because Harry knows him better than anyone, can read all he needs from that one protective motion.</p>\n<p>“Gaby,” Eggsy says, when there is no response forth coming from her, nuzzled sleepily into his neck, and he makes sure to enunciate the soft B of her name as he says it again, “Her name is Gaby.”</p>\n<p>No sharp Z’s here.</p>\n<p>“It’s very nice to meet you Gaby,” Harry says softly to her, and when his eyes meet Eggsy’s he knows, even before Harry says, “We’ll have to ask Arthur to adjust our work schedules,” stepping aside so Eggsy can bring her into their home, Eggsy knows Harry’s answer.</p>\n<p>Harry Hart, after all, has a certain soft spot for youths with <em>potential</em>.</p>\n<p>“He will,” is all Eggsy says, stepping into the warmth of Harry’s body so that his own forehead rests against Harry’s, and that Gaby is sandwiched safe between them and Harry just holds on because that’s the kind of man Harry is, and the only one Eggsy would ever want to this with.</p>\n<p>In that moment, Eggsy’s got his whole <em>world</em> in his arms, and everything he’s done done is <em>oh so</em> worth it.</p>\n<p>Arthur, naturally, because the man still wishes to continue breathing, does.</p>\n<p>It’s still a facet of their relationship that brings Eggsy a level of <em>unholy</em> joy.</p>\n<p>And so, with a little under the table custody manipulation curtesy of Merlin, Gary Ward and Harry Hart become the legal guardians of one Gabriella Ward-Hart. The hyphen ends up being a compromise, because Harry wouldn’t dare think of not having Eggsy’s last name be there and Eggsy can hardly explain to Harry that isn’t his real name and that when gay marriage becomes legal he intends to take Harry’s anyways. And so, Eggsy finds it just easier to acquiesce and apologize to their new daughter for having name that makes her sound like a law firm instead.</p>\n<p>Merlin’s a hacker. They can change it to just Hart later if Gaby wants.</p>\n<p>And somehow, that ends up being their only bump in the road to becoming a family. Because Eggsy knows that it should be harder - that there should be some awkwardness at trying to fit this new person into their dynamic. That there should an adjustment phase where they try and figure it out and fail a whole bunch instead before <em>finally</em> getting it.</p>\n<p>But somehow, there just isn’t. Eggsy’d basically raised Gracie, and he finds it oh so simple to tap back into that paternal instinct, and Harry’s always been fantastic with children - the utterly perfect wanker - and so they just somehow skip over that first phase and slip right into just being a <em>family</em>.</p>\n<p>Eggsy can’t say he minds.</p>\n<p>And yet, for all that he finds himself happier than he has ever been, there is a part of him that wishes he’d thought to ask the Doctor if there was a sign for when he’d done enough, created this new universe. Because now he’s done it, killed Valentine and saved those 400 million people, but he doesn’t know if his continued presence here means he’s done enough or not. Doesn’t know if he’ll get to stay, or if each morning will be his last here, in this perfect little happiness that he’s managed to eke out.</p>\n<p>All he can do is live, unsure of what the next day will bring.</p>\n<p>Just like, he supposes, everyone else has too.</p>\n<p>Staring at Harry and Gaby shuffling into the kitchen, both rumpled and groggy and barely awake, Eggsy thinks he can rather live with it.</p>\n<p>“And what do my two sleepyheads want for breakfast this morning?” Eggsy asks, heart nearly <em>overfull</em> with love at the sight of his little family.</p>\n<p>So, Eggsy lives.</p>\n<p><em>Still no suspects in the murder of tech CEO Richmond Valentine</em>, the news scroll proclaims, ignored and switched away in favour of Postman Pat as Eggsy flips a rasher of bacon over in the pan.</p>\n<p>It works out pretty well for him, if he does say so himself.</p>\n<p align=\"center\">***************************************</p>\n<p>And then one day, Harry stands before him, a strange shuttered look on his face and announces, voice heavy, “We’ve lost a knight.”</p>\n<p>And Eggsy’s tired, because he’s been up for 48 hours straight with a sick Gaby, and so he asks, before his brain can catch up with his mouth, “Who...”</p>\n<p>And then his mind finally engages, and Eggsy trails off, feeling like he’s been <em>struck</em> in the chest, a bullet against his suit at point blank range, because its Lancelot.</p>\n<p>Of course it’s Lancelot.</p>\n<p>Lancelot who had smiled at him when they’d run into each other at the firing range, flirted shamelessly as Eggsy had thoroughly out shot him. Lancelot who’d mentioned in passing an easy mission to Paris with a fond <em>wink and nod</em> to their first mission. Lancelot who’d smiled softly, real, when he’d asked for Gaby’s size so he could bring her back something pretty from Paris, because Gaby had “Uncle Lance” wrapped around her little pinky.</p>\n<p>Lancelot who’d said, “I’ll see you when I get back,” easy, casually and turned away and Eggsy hadn’t thought anything of it because it was just an easy mission to Paris, and of course he’d be back.</p>\n<p>Lancelot, who is dead.</p>\n<p>It was <em>always</em> going to be Lancelot.</p>\n<p>They never come back.</p>\n<p>And perhaps it’s wrong, but Eggsy’s first grief is not for Lancelot, but for Harry. Because once upon a time that hasn’t happened yet Harry had looked at him and promised him he’d be back and then he’d gone and bloody well died too, and Eggsy finds himself staring at Harry, Harry who is alive now but who fucking <em>died</em> and <em>begging</em>, “You can’t...You can’t ever do this to me. You can’t ever tell me you’ll be back and then just...not come back.”</p>\n<p>And then, voice broken, because he just <em>can’t</em>, can’t have come this far and done this much for it to all end in having to watch Harry walk away again, fail to come back to him, “You <em>have</em> to promise you won’t ever do that.”</p>\n<p>“Darling...” Harry starts, trailing off, pulling into Eggsy’s needy embrace, eyes soft if not a little confused, because this isn’t exactly a normal reaction for Eggsy.</p>\n<p>But then, this is hardly a normal scenario, this strange parody of his greatest nightmare and all Eggsy can find himself able to do is plead, “<em>Please</em>,” helplessly clutching Harry’s lapels and remembering only too well the sound of that one final gunshot that made a liar out of Harry and his promise to come back.</p>\n<p>“I’ll never choose to leave you,” Harry says, for Harry is not a man who makes promises lightly, this Eggsy knows, and this is the best he will give.</p>\n<p>It’s enough.</p>\n<p>And then, Eggsy thinks not of Harry, and his residual grief that still simmers there, for a death that has both happened and yet not, but of Lancelot. Lancelot, who whined about his hair to the point of ridiculousness. Lancelot whose eyes always twinkled with such mischief right before he did something that took years off the end of Eggsy’s life. Lancelot who’d been his first friend in this strange new world. Who’d fucked him and laughed with him and had utterly supported him and Harry, to the point of demanding that, <em>when they make it legal, if you ask anyone but me to be your best man, I’ll invade some small country in retribution, you know I will</em>.</p>\n<p>Lancelot, who is dead.</p>\n<p>And so Eggsy curls into Harry’s welcome embrace, and weeps for his friend.</p>\n<p align=\"center\">***************************************</p>\n<p>Staring at Lee Unwin in the recruits barracks is...a bit of a trip, Eggsy decides, to understate it <em>massively</em>.</p>\n<p>Eggsy doesn’t have many memories of his father, being only seven and all when he died, but the man that stands before him is largely as he remembers. They’re of similar height, and though Lee has darker hair and greener eyes than him, Eggsy can still see the resemblance, where he’d inherited his father’s chin and the shape of his lips. They’re by no means a splitting image of each other or anything, but Lee could pass for a cousin of his if he had too, a thought that amuses Eggsy a bit, just for the sheer ridiculousness of it.</p>\n<p>He’s older than his own father.</p>\n<p>He can’t imagine many people can say <em>that</em>.</p>\n<p>And looking at him, watching him break through the glass as Eggsy himself and Harry had done, Eggsy comes to a decision.</p>\n<p>He’s going to save him.</p>\n<p>Not really because he’s his father, because in the simplest way he isn’t - Eggsy’s father died, and he grew up without him and no amount of time travel can change that for Eggsy. No, Eggsy is going to save him because Lee is a good man, and because he can change it for that little boy at home, waiting for his father to come back and keep the promise he knows he made.</p>\n<p>Eggsy intends to make sure Lee keeps that promise.</p>\n<p>And so, although Eggsy’s own candidate doesn’t make it past the second round, he sticks around the trials. Harry might be Lee’s proposer, and Eggsy’s not trying to hone in on that, but he can hardly resist the opportunity to know a little more about Lee, this man who is his father but not.</p>\n<p>It’s a curiosity that apparently doesn’t go unnoticed.</p>\n<p>“You’re spending more time on these trials then you did with the Kay ones,” Harry says once, a light hint of a question in his tone as he catches Eggsy heading down to the range to watch the candidates - mostly Lee, though James as well, because Eggsy’s curious about the man who was Roxy’s predesessor and Ben’s successor.</p>\n<p>So far, he thinks Lancelot would have loved James, what with them both being gun crazy flirts. It’s almost a thought that makes up for the fact that he can’t tell it to Lancelot.</p>\n<p>Almost.</p>\n<p>“Better candidates,” Eggsy says with a wink, because he can hardly explain his real reason, and <em>I want to make sure they deserve Lancelot’s seat</em> is just a little too raw to share with even Harry.</p>\n<p>Instead, Eggsy just kisses Harry, stupidly perfect in his suit, and goes on his way.</p>\n<p align=\"center\">***************************************</p>\n<p>\n<em>What Eggsy doesn’t see is how Harry’s returning smile is a little frayed at the edges. Is too busy trying to learn all the things about this man who was his father that he doesn’t see Harry’s eyes dim at every smile Eggsy gives to Lee, doesn’t see his mouth pinch when Eggsy brags about Lee’s marksmanship scores, or see his hands creep tighter on his tea cup when Merlin snarks that the last time he’s seen Eggsy with a favourite like this it was Harry himself.</em>\n</p>\n<p>\n<em>But Eggsy doesn’t see any of that.</em>\n</p>\n<p align=\"center\">***************************************</p>\n<p>When James and Lee both pass the dog test, Eggsy knows exactly what they’re going to do for a tie-breaker.</p>\n<p>Eggsy knows how his father died. Unlike Lancelot, or Harry’s predecessor, he remembers every word of the case file about his father’s death. The insurgent, the grenade, everything. Knows that James and Harry and Merlin all missed it, and that his father had dived on the grenade and saved them all. A noble death, to be sure, but one Eggsy doesn’t intend to let time repeat.</p>\n<p>So Eggsy talks his way into going on the mission instead of Merlin.</p>\n<p>Merlin, Harry and James missed the insurgent pulling the pin, because they weren’t looking, weren’t <em>expecting</em> it.  How could they have been?</p>\n<p>Eggsy is. Eggsy is expecting it. Eggsy sees the grenade, sees him about to ready it.</p>\n<p>So Eggsy shoots him in the face.</p>\n<p>\"We rather needed him alive,” Harry says, perturbed, looking over at Eggsy as he lifts his black mask to reveal his face. But his voice trails off to nothing as the insurgents hand slumps down, and the grenade rolls out of it and onto the floor, pin still attached, harmless in a way it wouldn’t have been if Eggsy’d waited another 10 seconds.</p>\n<p>“No need to thank me,” Eggsy says, and throws him a wink, all adrenaline fuelled cheek, as Harry curses under his breath and scowls, because Harry hates missing things.</p>\n<p>“That was brilliant sir,” Lee says, clearly impressed, and Eggsy turns his attention from a nearly sulking Harry to say breezily, so he doesn’t have to dwell on what once was and could have so easily been again, “I thought it prudent to limit the daring heroics to a minimum.”</p>\n<p>And then, with a raised eyebrow at Lee, only half chastising, because even if Eggsy didn’t know that was how his father had died, knowing Lee and his character as he does now would be enough to inform him of this, “Surely having a recruit jump on a live grenade would be bad for moral.”</p>\n<p>“Yes sir,” Lee says back, entirely unrepentant - answering the question of where Eggsy got his cheek - and Eggsy smiles back at him, the smile of the utterly <em>relieved</em>, because he’s saved his father and Gaby and he’s still here, they’re all still here.</p>\n<p>He doesn’t see the frown that creeps onto Harry’s face.</p>\n<p align=\"center\">***************************************</p>\n<p>It’s Merlin who tells him, once their back to UK HQ that James is to be the next Lancelot because Lee has decided he’s going to resign his candidacy, and it’d be a lie to say Eggsy’s too disappointed at the news. Eggsy knows Lee would have made a fantastic Lancelot, but he also knows in the part of him that wanted to save him for Lee’s Eggsy and Michelle that the man has a better chance of being there for his family if he isn’t a Kingsman.</p>\n<p>That, and its still a bit freaking weird to be older than his dad, which would make having him a coworker a bit...odd.</p>\n<p>So when he runs into Lee in the barracks, cleaning out his stuff all Eggsy says is, “I heard the news,” and tries to look as supportive as he can.</p>\n<p>“I’ve got a wife and a kid that need me,” Lee says, with a smile that looks a bit strange on his face to Eggsy, as he says, easy enough, “I guess today made me realize that I want them more than I want to be a knight.”</p>\n<p>“It’s hard to balance this and family,” Eggsy agrees simply, thinking of his own little family and the balancing act they’ve worked out - Gaby <em>begging</em> for boarding school had really helped, for all that he hates having her away no matter how much he knows she loves it.</p>\n<p>“Yes, but you and Galahad manage to do it,” Lee says, and then, so smoothly, so <em>slyly</em> it takes Eggsy a second, “don’t you <em>Eggsy?</em>”</p>\n<p>“Well we...” Eggsy says, still caught on the thought of what they should do with Gaby on the summer hols - Eggsy’s still putting in his vote for Corfu, for all that Harry wants to go to Athens - and then what Lee’s said catches up with him and he just <em>stops</em>.</p>\n<p>\n<em>Eggsy.</em>\n</p>\n<p>Because there’s no way that Lee would have ever heard him called that. Everyone at base calls him Tristan. No one in this time but Harry even knows to call him Eggsy, and Harry is utterly ruthless about informal names at work - Eggsy can’t get Harry to call him that when he <em>blows</em> him at work. Harry’d never have referred to Eggsy by that name in front of Lee.</p>\n<p>“I couldn’t figure it out before, why you were so familiar to me, but I see it now. It’s all in the eyes,” Lee says, clearly taking Eggsy’s stunned silence as confirmation of his theory, as he continues, a cross between baffled and amazed, “You’re my son. Somehow, against all logic, you’re my Eggsy.”</p>\n<p><em>Yes</em>, Eggsy thinks,<em> Lee would have made an excellent Kingsman</em>.</p>\n<p>“I was,” Eggsy settles on, because the full truth is too complicated to put into words, “In a timeline that is hopefully divorced from this one now. Now, your son is home with his mother, waiting for his father to come home and I’m...someone else.”</p>\n<p>“You didn’t grow up with me, did you?” Lee continues, still trying to work through it, and doing a pretty good job of it if Eggsy does say so himself, “In your...timeline Galahad missed the grenade and you weren’t there to correct it and I...he - god this is <em>bizarre</em> - jumped on that grenade, and you lost your father.”</p>\n<p>“I found myself with an opportunity to change that outcome,” Eggsy says, nodding in affirmation, before continuing with a shrug, because it is hardly the noble thing it might seem, given how long it took him to come to that decision, “It seemed like one worth taking advantage of.”</p>\n<p>But Lee just smiles at him, and then Eggsy finds himself drawn into a hug that Eggsy can’t help but burrow into, because for all that this isn’t his father he is Lee Unwin, is the man his father was, and Eggsy hasn’t had a hug from Lee Unwin in a <em>very</em> long time.</p>\n<p>“Perhaps I’m not your father, but let me say this as the father of Eggsy Unwin,” Lee says, pulling back so that he can say it to Eggsy’s face, pride shinning from those familiar eyes, “I’m very proud of you.”</p>\n<p>So yeah, Eggsy’s crying. He’s man enough to admit it.</p>\n<p>Lee Unwin is <em>proud</em> him.</p>\n<p>It’s good enough.</p>\n<p>“Thank you,” Eggsy says, drawing away and taking a moment to discretely compose himself which Lee returns, before he asks, politely but with some genuine curiosity, because Eggsy’s never really given much thought to what happens after this moment, “So what are you going to do now?”</p>\n<p>Because right now there is a seven year old boy who is going to grow up to look an awful lot like him, and that could end up being...really hard to explain in a few years.</p>\n<p>Freaking time travel.</p>\n<p>“Had a job offer from someone I met in the service, in Chicago,” Lee says, an easy smile on his face, that makes Eggsy think he knows exactly what he’s thinking, “Private security, great pay, benefits for the family. I think I’m going to avail myself of that.”</p>\n<p>“Good luck then,” Eggsy says, holding out his hand and Lee takes it and returns the sentiment and as they part ways, and part lives Eggsy finds himself thinking <em>yes, maybe now everything is going to be alright.</em></p>\n<p>Right up until he gets home and takes one look at Harry’s face as he sits on their bed, so terribly shuttered and closed and somehow <em>hurt.</em></p>\n<p><em>Tempting fate again, </em>Eggsy thinks<em>.</em></p>\n<p>Eggsy killed an awful lot of people the last time someone put a look like that on Harry’s face.</p>\n<p>“Darling, what’s wrong?” Eggsy demands, and then, as he’s hit by a terrible thought, half panicked, “Has something happened to Gaby?”</p>\n<p>“Do you love him?” Harry asks quietly, staring up at Eggsy with that terrible <em>look</em> in his eyes, like it’s hurting him even to ask it and Eggsy just stares back at him, like he’s speaking <em>Korean</em> or something, for all the sense what he’s just asked makes.</p>\n<p>“Do I love <em>who</em>?” Eggsy says, so utterly bewildered he’s not even panicked anymore, because <em>what the hell</em> is Harry even on about?</p>\n<p>“Lee Unwin,” Harry says steadily, and Eggsy can only get more bug eyed as he finishes, asking again, so terribly <em>composed</em> in a way that Eggsy knows means Harry is really actually fraying at the seams, “Do you love him?”</p>\n<p>“Do I love...” Eggsy stars, and then just has to splutter off, because <em>what the fuck?</em> Is he <em>in love</em> with<em> Lee</em>?</p>\n<p>What in the <em>ever loving fuck</em> is Harry <em>smoking</em>?</p>\n<p>“Have you gone off your<em> rocker</em>?!” Eggsy settles on, utterly <em>stupefied</em> that <em>anyone</em>, much less <em>Harry himself</em> couldn’t see how ridiculously, utterly <em>gone</em> on Harry he is to ever even think he’d so much as <em>dream of considering</em> someone else, much less <em>Lee</em>.</p>\n<p>Seriously, what the <em>actual fuck</em>?!</p>\n<p>“Please don’t insult my intelligence. I saw you in his arms today, and I know that you killed that man to save Lee, not James or I,” Harry says in response, not backing down, eyes shuttered and pained and a <em>stab</em> to Eggsy’s damn <em>heart</em> as he asks, voice breaking on the last word, “So <em>please</em>, do you love <em>him</em>?”</p>\n<p>It’s is only the knowledge that it is <em>him</em> that put that look in Harry’s eyes that has him actually stopping to consider what Harry thinks he must have seen, instead of just glazing over it in stunned confusion, because Eggsy would rather stab himself in the <em>face</em> then hurt Harry. And once he starts actually looking, well...</p>\n<p>Because well yes, alright true, he’s spent more time with Lee than any other candidate, but surely not enough for Harry to think <em>that</em>! Sure, he’d helped with his marksmanship, and brought his dog a few extra toys, and listened to all of Lee’s marine stories because hey, Eggsy’d never got to hear them from his dad and he was hardly about to let that opportunity pass. And yeah, maybe he’d been a little more effusive to Lee in praising his victories, and maybe he’d shown a little favouritism to Lee over James, and yeah, so he had <em>technically</em> killed a man for him...</p>\n<p>Ok, so maybe <em>now</em> he sees how Harry could have come to that conclusion.</p>\n<p><em>Fuck</em>.</p>\n<p>Created the appearance of trying to cheat on his lover with his own father.</p>\n<p>Freaking time travel.</p>\n<p>“Harry, I love you more than <em>life itself</em>,” Eggsy says, trying to will Harry to see the truth of it as he continues, “I’m not cheating on you with Lee. Lee is, he’s just...” Eggsy stops, no idea how to finish that sentence until it’s already out of his mouth, “he’s my father.”</p>\n<p>So, apparently he’s decided to blurt out the ludicrous truth.</p>\n<p>“That’s not...<em>what</em>?” Harry says, blinking back at him, baffled and still clearly a little hurt and Eggsy can’t have that, can’t stand that pain knowing that <em>he</em> was the one that put it there. And so Eggsy decides, like ripping off a bandaid that he’s in it now, and he might as well go for broke.</p>\n<p>Eggsy’d give Harry <em>everything</em>, if he could.</p>\n<p>The least he could give him is the truth.</p>\n<p>“Please, love, there’s something I need to show you,” Eggsy says, as he makes his way to the safe and opens it, bringing out the glasses he hasn’t touched in a decade and offering them to Harry with a soft entreaty, “Trust me?”</p>\n<p>And Harry, confused and still a little hurt, takes them, and does.</p>\n<p>And so Eggsy watches Harry watch the video he knows off by heart. Watches him take in Eggsy’s own age as he looks in the mirror, at least a decade younger and then Merlin, easily two decades older than he is now. Watches him call Roxy Lancelot, and interact with his mum and Gracie, the family Harry knows he doesn’t have now. Watches him take in the date, timestamped on the video, <em>April 8th, 2018</em> and then watches him bring those beloved brown eyes up to Eggsy’s own, still utterly confused but trusting.</p>\n<p>And that hurt, that terrible, <em>terrible</em> hurt has started to fade away.</p>\n<p>God, Eggsy <em>loves</em> this man.</p>\n<p>And so Eggsy takes the glasses from his hands and holds Harry’s in his own, and tells him a story.</p>\n<p>“I was born Gary Unwin, in the year 1991, to Lee and Michelle Unwin,” Eggsy starts, and once he has the truth just spills from him, so ready to escape from where he’s bottled it up for all those years, “When I was seven, my father died in a Kingsman training exercise, and the man who recruited him gave me this medal and told me if I ever needed help, I could call and say “oxfords not brogues,” and he’d help me. And one day I did just that, and he got me out of a jail sentence and made me his proposal for the open knighthood.”</p>\n<p>And then, with a squeeze of Harry’s hand still curled in his own he says softly, releasing forth his most painful truth, “And I fell in love with him, but then he went and got himself killed by some megalomaniacal psychopath trying to commit mass genocide.”</p>\n<p>Harry’s hands white knuckle on his own, but his eyes tell him to continue, and so Eggsy does, keeping his voice low and steady even as the story becomes impossibly more fantastic, “And then, by some impossible twist of fate - and aliens - I found myself here, back in a time when that man I loved was alive, and so I stayed there and waited for him.”</p>\n<p>“But not for Lee,” Eggsy reassures, because he doesn’t want Harry to ever spend another moment thinking that he has ever come second to Eggsy, because Eggsy would let the world <em>burn</em> if it meant saving Harry, “I didn’t stay so I could save him. I stayed because in a world entirely alien to me because you were out there somewhere, and I didn't want to live anywhere that wasn’t true anymore.”</p>\n<p>“I love you so much I changed the whole course of history for you,” Eggsy says gently, heart in his voice to the still silent Harry, and then, softer, and without the joking tone he’d normally utilize in making this point, “So I hope that answers the question about whether or not I’m in love with someone else.”</p>\n<p>Harry just blinks at him in response, and Eggsy lets him take that moment, lets him process, because this is important, and Eggsy can wait.</p>\n<p>For Harry, Eggsy’d wait <em>forever</em>.</p>\n<p>“You...I’m not worth all that,” Harry stutters forth eventually, looking stunned and <em>overwhelmed</em>, and Eggsy loves him enough to not call him on how massive a lie that is, because Harry is worth <em>everything</em>.</p>\n<p>“You are to me,” Eggsy says simply instead, bringing the hand he still has in his own up to his lips for a soft kiss and staring into Harry’s eyes, to let him see the truth of it, the true depth of feeling that Eggsy has for him.</p>\n<p>Too see that it’s <em>endless</em>.</p>\n<p>Eggsy thinks that in the next second they are falling onto each other, all mouths and teeth and <em>desperation</em> is probably a good sign that Harry’s got it, at least a little bit.</p>\n<p align=\"center\">***************************************</p>\n<p>Later, much later, after they’ve relearned each other in every way two humans can, Eggsy finds himself still awake, laying in the warmth of Harry’s slumbering body, restless.</p>\n<p><em>Waiting</em>, Eggsy realizes, thinking back to what The Doctor had told him all those years ago, and although Eggsy has no proof, he knows, as sure as he knows his own name, that this is the moment of truth, so to speak.</p>\n<p>This is where the universe is weighing him, to see if what he has done is worthy or wanting.</p>\n<p>Eggsy feels like he’s sitting on a precipice, just waiting to see which direction he will fall. Will it be into this world, this universe that he’s managed to create where he can stay with Gaby and Harry, or will he have not done enough and he’ll just be erased, will flicker away, a paradox corrected by time?</p>\n<p>Eggsy can’t say.</p>\n<p>Be he doesn’t fear, doesn’t worry, because laying in the warmth of Harry’s arms, waiting for the cosmos itself to decide his fate, he knows whatever comes - or does not come - tomorrow it’ll have been worth it, for every second he had with Harry and with Gaby.</p>\n<p>So Eggsy presses a kiss to Harry’s slumbering head, and curls into him.</p>\n<p>And sleeps.</p>\n<p align=\"center\">***************************************</p>\n<p> He wakes up.</p>\n<p>The dawn light is peeking through the curtains, and Harry is a warm weight at his back, and Eggsy is awake, and still <em>here</em>.</p>\n<p>“Merlin just called,” Harry whispers into his neck, voice more professional than truly sad as he delivers his news, “Arthur died of a heart attack last night in his sleep.”</p>\n<p><em>Checks and balances</em>, Eggsy thinks, of The Doctor and his warning, of how the universe evens out its own slate, of how there would be losses to keep it in the black and form a new universe, one different enough he’d get to <em>stay</em>.</p>\n<p>And Eggsy thinks,<em> I did it</em>.</p>\n<p>It's an acceptable loss, in Eggsy’s book, and a far better death than Chester King deserved.</p>\n<p>“Well,” Eggsy says, brushing a soft kiss to Harry’s forehead, before clambering out of their bed to make his way to the shower, “We’d better go then.”</p>\n<p>Work to be done, and all that.</p>\n<p align=\"center\">***************************************</p>\n<p align=\"center\">Epilogue</p>\n<p align=\"center\">***************************************</p>\n<p align=\"left\">“Honestly sweetheart,” Eggsy says, fondly bemused, propping the phone between his shoulder and his ear as he searches for a file on his desk, before turning his attention back to his panicking daughter on the phone, “I can’t imagine why you’re even worried right now.”</p>\n<p>“Because she might say no!” His daughter wails into the phone, no sign of her usual calm composure, and Eggsy has to bite down his chuckle, because this is a moment for dad skills and not laughter.</p>\n<p>“Sweet, I’d be a very poor spy if I didn’t notice how enamoured our new Kay is with you,” He reassures, because it’s true enough - Roxy had taken one look at Gaby and pretty much swallowed her tongue, “She isn’t going to say no to being your valentine.”</p>\n<p>“You’re my dad, you have to say that,” Gaby says, somewhere between a whine and a sulk, though with an undeniably fond undertone.</p>\n<p>“Perhaps,” Eggsy allows, and then, with a little bit of that good old Unwin cheek, because he just can’t resist, “But Merlin isn’t, and he’s got a pool up and running for when you two are going finally get on with it.”</p>\n<p>“That gossipy little <em>bugger</em>,” Gaby hisses, before she says good-naturedly, because his girl knows him, “I take it you’ll share your winnings with me?”</p>\n<p>“Only if you actually ask her out,” Eggsy reminds her, as he begins searching in the drawers for the file he’s looking for, a ridiculous endeavour because Harry is fantastic at many things but filing isn’t one of them.</p>\n<p>“Yeah,” Gaby sighs, hugely, before psyching herself up with a deep breath, “I am a Kingsman. I have defused literal bombs before. I <em>can</em> do this.”</p>\n<p>“Go get her sweetheart,” Eggsy says, finally letting that chuckle out as he hangs up. And then, when he fishes a picture frame he hasn’t seen a long while out of the draw instead of that elusive file he takes a moment to just <em>look</em> at it, and remain as bemused at its existence as ever.</p>\n<p>Because the picture is the one that Lee Unwin sent him of his son and his new husband at their wedding, and looking at it he can’t help but shake his head, as he always does, because he needs no more proof that he and the Gary Unwin of this time are different people than the fact that the man staring down lovingly at Lee’s son is none other than <em>Charlie</em> fucking <em>Heskath</em>.</p>\n<p>To say that Eggsy hadn’t laughed so hard he’d <em>fallen out of his chair</em> when he’d first seen the picture would be a lie.</p>\n<p>That had been a hard one to explain to Harry.</p>\n<p>And yes, Eggsy knows that it isn’t quite the Charlie he’d met - and punched in the face and then kind of blown up - because this Charlie’s parents had lost most of their fortune when Richmond Valentine had been found murdered and his stock prices had plummeted.</p>\n<p><em>Oops</em>.</p>\n<p>However, some good that had apparently come out of it was that it resulted in a Charlie that apparently grew up humble and dedicated himself to helping the less fortunate as a doctor in an under serviced intercity Chicago community. And that’s where he’d met Gary Unwin, the young firefighter with a midwestern accent and that’d been that apparently, according to Lee’s note that had accompanied the picture.</p>\n<p>Buried balls deep in his husband, that bloody <em>hair</em> mussed and tangled across his sweaty forehead as Harry bloody well <em>gasps</em> his name, Eggsy’s just decided to be satisfied by the fact that, between the two of them, he<em> clearly</em> has the superior taste in men.</p>\n<p><em>Really</em>, he thinks, staring down at Harry, <em>his</em> Harry, slumped on his forearms, spent and exhausted and <em>oh so</em> in love with this perfect man. Perfection from his head to his toes, from that <em>impossible</em> hair to his biteable pecs to the ring he wears on his finger that clinks with it’s twin when Eggsy twines their fingers together, this little tangible symbol that calls Harry <em>his</em>.</p>\n<p><em>No</em>, Eggsy thinks, impossibly in love, <em>no one could even call it a contest</em>.</p>\n<p>And well, like the cherry on top, dinner at The Savoy, a show at in the West End, and then a great <em>deal</em> of ridiculously <em>filthy</em> sex with his fantastically handsome husband to cap off the evening is certainly Eggsy’s idea of a good Valentine’s day.</p>\n<p>And, if Gaby’s texts were any indication, he’s pretty sure he also won the pool.</p>\n<p>That Eggsy goes to sleep that night in a good mood, wrapped in the warmth of a sweaty, sex sated Harry is perhaps an understatement.</p>\n<p>He’s just so <em>happy</em>.</p>\n<p align=\"center\">***************************************</p>\n<p>It’s quiet when Eggsy wakes up the next morning.</p>\n<p>Not utterly; the house still makes its ambient creaks, and a horn sounds outside as their neighbours try to shuffle three children into the car and off to school as is their ritual. But still, there is something quiet even about that noise, something that makes the morning feel heavier, more weighted then it probably should and has Eggsy at a higher alert.</p>\n<p>“Something wrong, darling?” Harry enquires, picking up on Eggsy’s mood, voice utterly groggy, still half asleep and half muddled from where his face is smushed adorably into the pillow. And for all that it’s hardly a serious query, more a gentle platitude than anything else, Eggsy stops for a moment and <em>considers</em>, takes weight of the answer.</p>\n<p>There’s a crick in his neck and this stiffness in his back, because being 54 means that waking up means a couple new aches and pains. His right arm hurts, because he fractured it a month ago on a mission, and he doesn’t heal the way that he used to 30 years ago. His glasses are now for use and not for show, because otherwise he’d have to play trombone with everything he tries to read, and there is a silvering of his hair at his temples that wasn’t there 2 years ago.</p>\n<p>And Eggsy smiles, because now he’s <em>awake</em>, and because now he remembers what he’d forgotten in his waking drowsiness.</p>\n<p>It’s February 15th, 2015, and Harry - Harry, who looks just like he did when, in another life he promised to come back and never did - is <em>here</em>, in <em>their</em> bed, his <em>husband</em>, and one day older than he’s ever been before.</p>\n<p>“No,” Eggsy says, brimming with nothing but utter happiness and<em> love</em>, snuggling back into the warmth of his husband to whisper into the soft curve of his neck, “Everything’s perfect.”</p>\n<p>And it is.</p>\n<p align=\"center\">***************************************</p>\n<p align=\"center\">FIN</p>\n<p align=\"center\">***************************************</p>\n<p> </p>"
}