{
  "id": "35967814",
  "url": "https://archiveofourown.org/works/35967814?view_full_work=true",
  "author": [
    "Ms_Trickster"
  ],
  "title": "hit me like a shooting star (so i can make a wish)",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [
    "Tim Drake & Jason Todd",
    "Tim Drake & Bruce Wayne"
  ],
  "characters": [
    "Tim Drake",
    "Jason Todd",
    "Bruce Wayne",
    "Leslie Thompkins"
  ],
  "additional_tags": [
    "Humor",
    "Car Accidents",
    "Emotional Hurt/Comfort",
    "Medical Inaccuracies",
    "Gift Fic",
    "Good Older Sibling Jason Todd",
    "Bruce Wayne is a Good Parent",
    "Bad Parents Jack and Janet Drake",
    "Child Neglect",
    "Implied/Referenced Child Abuse"
  ],
  "language": "English",
  "series": "",
  "published": "2021-12-26",
  "completed": null,
  "words": "5,804",
  "chapters": "1/1",
  "comments": "183",
  "kudos": "9,104",
  "bookmarks": "1,742",
  "hits": "50,550",
  "summary": "<p>“He broke my camera!” Tim wails, incensed. “Not a crack, not a dent; it’s nothing but a pile of glass because <em>he broke it!</em>”</p>\n<p>“And his ankle,” Robin adds.</p>\n<p>“<em>And my ankle!</em>”</p>\n<p>“...I accidentally hit him with my car,” Batman reluctantly offers when Dr. Thompkins raises her eyebrow at him, causing her to choke on her next breath.</p>\n<p>(Or: One evening while birdwatching, a ten year old Tim Drake gets run over by the Batmobile.)</p>",
  "notes": "<p>me, writing jason use finger guns: i will pepper in the fact that he's bi</p>\n<p>happy holidays everyone!!!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Jason: [john mulaney voice] here is a tiny 10 year old with abandonment issues and touch starvation…could be a little brother</p>\n<p>edit: [rips off my mask] 'tis i! Missy!! &gt;:D i've been counting the days until this fic was no longer on anon bc i had more end notes i wanted to write but didn't want to connect with my account</p>\n<p>baby tim slips into wayne manor life surprisingly easily. every morning bruce knocks on his door to say good morning and let him know that breakfast is ready. when tim tells bruce about his passion for photography he seems...interested?? and asks him questions?? and jason seems to like spending time with him?????? it's weird. it's so so so weird, but...tim thinks he could get used to it</p>",
  "text": "<p>Beside his bedroom window, Tim takes a moment to double check he’s got everything with him. </p>\n<p> </p>\n<p>His phone is safely nested within the inside pocket of his jacket where it can’t fall out, and his camera is stuffed inside its case, a grounding weight against his chest where it rests underneath his zipped up jacket. When he snakes a hand into his left jeans pocket, his keys jingle quietly when he skims them with his fingers. On his right thigh, he can feel the outline of the granola bars in his other pocket, a late night snack in case he gets hungry.  </p>\n<p> </p>\n<p>The moon is full in the sky, and Tim slides the window open with a grin, breathing deeply and relishing in the wind that tousles his hair and the hint of freedom in the air. The branch beneath his feet creak worryingly, but he’s done this enough times to know it’ll hold steady as he makes his way down the tree. As soon as he touches the ground, he pulls his hood up and starts making his way to the nearest bus station with only the light from the full moon and his memory to guide his footsteps.</p>\n<p> </p>\n<p>It’s a beautiful night for birdwatching.</p>\n<p> </p>\n<p> </p>\n<p>The new Robin fires his grapple at a close by building and Tim holds his breath, finger trembling on the shutter button. He scoots closer to the edge of the building’s roof, leaning as far as he dares, and watches as the boy tugs twice to make sure his hook is caught on its target before he jumps off his roof. Tim locks his eyes onto him, waiting just until—</p>\n<p> </p>\n<p>\n<em> Click. </em>\n</p>\n<p> </p>\n<p>The picture is perfect. Mid-flip, Robin’s bright yellow cape catches the light of the full moon as he flies through the air, the very image of freedom. Tim smiles down at it and takes a moment to feel pride in his progress. Gone are the days of blurry action shots and too dark photos.</p>\n<p> </p>\n<p>Tim Drake, everyone. Professional photographer.</p>\n<p> </p>\n<p>Ahead of him, Robin is already making his way to the next rooftop, and if he squints and tilts his head just so, Tim can see the outline of a shadowed figure waiting for him. Tim gasps silently and raises his camera immediately, but it’s no use. Even with his talent, Batman is <em> Batman </em>. There’s a reason there are so few photos of him. If he doesn’t want to get caught, he won’t, plain and simple. </p>\n<p> </p>\n<p><em> If I want a chance of getting a picture of him </em> , Tim thinks as he stashes his camera back into its case and darts over to the fire escape, practically sliding down the handles, <em> I’m gonna need to get closer. </em></p>\n<p> </p>\n<p>Honestly, though, Tim wouldn’t say no to more pictures of the new Robin. He’d appeared only two weeks ago, and seemed to be doing an impressive job of living up to his predecessor’s reputation. Better, even.</p>\n<p> </p>\n<p>Yes, the new Robin was more inclined to let his fists do the talking, but it was clear that he was more than just a typical fighter. He was a protector and it showed, in the way he offered to walk the working ladies home, in the way he took count of all the street kids in the area and made it impossible for someone to make one quietly disappear. With the new Robin came a Batman more willing to patrol within Crime Alley, taking the time to actually traverse the area instead of what used to be the occasional dash through.</p>\n<p> </p>\n<p>Tim missed Dick. Seeing another boy in the costume made Tim ache for his hero like a phantom limb. </p>\n<p> </p>\n<p>But he didn’t think it’d be so bad, getting used to this new Robin.</p>\n<p> </p>\n<p>Tim stumbles after jumping from the last rung and onto solid ground, but quickly regains his footing. He’s got to move fast if he wants any chance of catching up to Batman and Robin while they get the luxury of grappling hooks. </p>\n<p> </p>\n<p>And into the heart of Gotham Tim plunges.</p>\n<p> </p>\n<p>Run. Stick to the shadows. Turn right at Ivy Meadow Lane. Keep close to the buildings. Avoid the drunk, stumbling man sinking with a voice that ice skates on his bones. Turn left at Doris Avenue to make up for avoiding him. Acknowledge the sound of a car engine cutting through the air. Ignore it. Keep running. Jump over a cat at the last second. Thank every deity you know you won’t be getting on Catwoman’s bad side tonight. </p>\n<p> </p>\n<p>Tim slows to a jog as he approaches the alleyway he’s fairly certain will give him a better view of the Dynamic Duo With the full moon behind him hopefully casting a strong enough glow onto everything below (Tim is crossing his fingers <em> and </em>his toes), there’s a chance he’ll be finally able to catch the elusive Batman on camera. </p>\n<p> </p>\n<p>Tim turns right and immediately yelps, stumbling backwards and throwing up a hand against the brilliant glare that seems determined to drill right into his brain. The light seeps into everything, everywhere, all-encompassing even as Tim tries to squeeze his eyes against it, to shake out the rumble of thunder that floods his ears. Why would anything need to be that brig—</p>\n<p> </p>\n<p> </p>\n<p>“Did you kill him? Is he dead?”</p>\n<p> </p>\n<p>“Ro—”</p>\n<p> </p>\n<p>“Oh, my god. You killed a toddler. Oh, my <em> god </em>.”</p>\n<p> </p>\n<p>“He’s not dead,” a deep voice says quickly. “He’s just…unconscious.”</p>\n<p> </p>\n<p>“<em> How is that any better? </em>”</p>\n<p> </p>\n<p>Tim breathes slowly. There’s gravel digging into his back and two voices by his side, both being entirely too loud for Tim’s spinning head. His left ankle is a dull throbbing pain that grows as his brain starts to come into focus.</p>\n<p> </p>\n<p>“Injuries?”</p>\n<p> </p>\n<p>“Don’t change the subject!” There’s a large, pregnant silence before the second voice, younger, caught between boy and man, sighs shakily and reports, “Minor bruises, some cuts on his knees and a small bump at the back of his head. I don’t think there are any broken bones, but I don’t like the look of his ankle, B. I could've sworn I heard a loud crack, even through the window.”</p>\n<p> </p>\n<p>An acknowledging grunt is the only response. Faintly, Tim feels big hands ghost over his ribs, occasionally applying pressure before moving onto the back of his head.</p>\n<p> </p>\n<p>“Shouldn’t we be taking him to Leslie?” Why are we still here?” The younger voice demands, squeezing Tim’s hand where he’s surprised to realize it’s being cradled between two others.</p>\n<p> </p>\n<p>“...I don’t want to rule out a spinal injury,” the deeper voice reluctantly says, and Tim hears a sharp inhale.</p>\n<p> </p>\n<p>“You think—?”</p>\n<p> </p>\n<p>“No.” The answer comes immediately. “But just in case. I’d rather be cautious and wrong than reckless and cause more harm. We already have enough to apologize for.”</p>\n<p> </p>\n<p>“<em> We? </em> ” The younger voice demands indignantly. “My feet don’t even reach the pedals. There is no <em> we </em>in this situation.”</p>\n<p> </p>\n<p>“…We’ll discuss the logistics later.” </p>\n<p> </p>\n<p>A big hand pats gently against Tim’s cheek as the younger voice makes a noise of deep offense that goes unacknowledged. “Chum? Time to wake up now, please. Come on—there you go.”</p>\n<p> </p>\n<p>Tim groans and fights to keep his eyes open, squinting against his blurry vision. A dark shape hovers above him, nothing discernible except for the stark white lenses where his eyes should be. In the corner of his eye, he can see a brighter and smaller blurred smear. </p>\n<p> </p>\n<p>Tim’s breath catches in his throat. Holy shit. <em> Holy shit.  </em></p>\n<p> </p>\n<p>“Don’t try to get up just yet,” fucking <em> Batman </em> says as Tim’s vision slowly comes into focus, moving his hand from Tim’s cheek to rest it firmly against his chest. “Can you tell me where there’s any pain?”</p>\n<p> </p>\n<p>“Um,” Tim croaks out, mercilessly strangling the high pitched screech that threatens to escape his throat. <em> “ </em> Uh <em> . </em>Hi. Hello. Sir. It’s—it’s an honor to meet you.”</p>\n<p> </p>\n<p>Robin snorts, and Tim <em> swears </em>he sees the corner of Batman’s mouth twitch microscopically. </p>\n<p> </p>\n<p>“Hello,” Batman says gently. “It’s nice to meet you, too. Can you tell me where it hurts?”</p>\n<p> </p>\n<p>“My—my leg,” Tim stammers, then corrects himself, “my ankle.”</p>\n<p> </p>\n<p>Batman purses his lips and nods, shuffling backwards. Tim doesn’t see what he plans on doing because Robin is quick to dart into his field of vision, giving him a blinding smile. Up close, Tim can see details about the new hero that don’t come clearly through the lens of his camera. </p>\n<p> </p>\n<p>His hair is curly, spilling out in all directions from both the wind and what Tim expects is its natural state. Scaly panties have been replaced with a pair of scaly shorts, though much of the costume remains the same. He’s not much older than Tim is (ten years, two months, and four days, thank you very much) but they’re about the same size, with stick thin limbs and a pale complexion.</p>\n<p> </p>\n<p>But Robin has a healthy blush on his cheeks that speaks of healing and the broadness of his shoulders speaks of a growth spurt in the near future, where as Tim has been four feet and three inches and weighing around sixty pounds since he was eight.</p>\n<p> </p>\n<p>“Hey, kiddo! So, with you being unconscious and all, we weren’t able to stick a name to your face,” Robin says cheerfully, innocently shuffling when Tim tries to lean and look past him and at whatever Batman is doing. </p>\n<p> </p>\n<p>Tim startles at the question and blushes furiously. Mother would be horrified to know all it took was a bump to head for him to forget his manners. </p>\n<p> </p>\n<p>“Hi, Robin,” he says shyly, rewarded when the hero’s smile softens. “I’m Tim. Timothy Drake, if you need my full name, but I like to go by Tim.”</p>\n<p> </p>\n<p>Robin ruffles his hair, and Tim promptly swears to never wash it again. “Nice to meet you, kiddo. I’m Robin, obviously. Don’t know anyone else dressing up like a traffic light in this city.”</p>\n<p> </p>\n<p>“Don’t jinx us,” Tim hears Batman mutter, shocking him into a short burst of laughter. Robin glances over his shoulder to stick his tongue out, and then nods at something Tim can’t see.</p>\n<p> </p>\n<p>“Well, Tim-not-Timothy,” carefully, Robin slings his arm behind Tim’s back and under his knees, springing up from his crouch without any hindrance, snickering at Tim’s yelp, “let’s go get you fixed up, yeah?”</p>\n<p> </p>\n<p> </p>\n<p>In the car ride to someone named Leslie, Tim learns a few enlightening pieces of information.<br>\n<br>\n</p>\n<p>“You <em> ran me over </em>?”</p>\n<p> </p>\n<p>Robin winces and points desperately at Batman in the front seat. “Technically, since he was the one driving, it’s his fault.”</p>\n<p> </p>\n<p>Tim pauses. Considers. Then he turns to Batman with his fiercest scowl, perfectly modeled after his mother’s. “You ran me over! How <em> could you? </em>” </p>\n<p> </p>\n<p>“I know,” Batman says gravely, and his tone doesn’t change but Tim gets the feeling he’s hunching his shoulders…just, on the inside. “I am fully aware you could have had more severe injuries than your ankle, and I can’t stress enough how sorry I am for hurting you.”</p>\n<p> </p>\n<p>The Batmobile takes a sharp right turn, somehow not jostling Tim at all despite the speed it’s going at. He doesn’t recognize any of the buildings they drive past, the mysterious Dr. Thompkins most likely residing in the part of Gotham Tim doesn’t dare enter at night. </p>\n<p> </p>\n<p>“Well, you <em> should </em> be sorry,” Tim snaps, and then regrets it when Batman doesn’t say anything to defend himself. He bits his lip. He shouldn’t feel bad, <em> he’s </em> the one that got run over. How is he supposed to explain his ankle to his parents?</p>\n<p> </p>\n<p>\n<em> Sorry mom and dad, the Batmobile ran me over while I was stalking Batman and Robin in the dead of night to take pictures of them. Which actually brings me to a question I’ve been wanting to ask you guys for a while now: can I go to this cool photography camp I found online? </em>\n</p>\n<p> </p>\n<p>Right. Like that would go over well.</p>\n<p> </p>\n<p>But, still. Manners are manners, after all, and Tim has been stepping all over his since the moment he woke up.</p>\n<p> </p>\n<p>“...It’s alright,” Tim mumbles, choosing to stare out the window instead of making eye contact in the rear view mirror. “You didn’t hurt me too badly. I’ve gotten more bruises from gym class. At least you didn’t—”</p>\n<p> </p>\n<p>Tim sucks in a breath and jerks a hand to his chest. Beside him, Robin lets out a startled curse, asking him if something’s wrong, if he’s having trouble breathing, but all Tim can focus on is the way his camera case gives easily against his fingers, bending inwards far past the point it should be able to.</p>\n<p> </p>\n<p><em> I could've sworn I heard a loud crack </em>, Robin’s voice echoes in his ears.</p>\n<p> </p>\n<p>Ice floods his veins.</p>\n<p> </p>\n<p>Robin has moved his face close to Tim’s, mouth moving urgently and pressing gloved fingers against his thundering pulse point on his neck. Tim ignores him, unzipping his hoodie and cradling his camera case in his hands. Batman’s concerned voice has joined the fray, but Tim ignores that, too. </p>\n<p> </p>\n<p>For all the noise the two are creating, the zipper sliding open is somehow what rings loudest in his ears. </p>\n<p> </p>\n<p>The soft tinkle of glass falling out is a close second though.</p>\n<p> </p>\n<p>- </p>\n<p> </p>\n<p>Tim’s first impression of Doctor Leslie Thompkins is that she is not a woman easily caught off guard. When the door to her clinic opens and she looks up, there’s not one inch of her that seems phased at the image of Batman and Robin at her front step. If anything, Tim would say she looked annoyed.</p>\n<p> </p>\n<p>That annoyance eases when her eyes land on Tim and the sloppily made splint Batman had made for his ankle.</p>\n<p> </p>\n<p>Tim’s second impression of Dr. Thompkins is that she takes no shit. She leads their small group to an unoccupied room to wait in until she’s ready to see them, and gives Batman a look that could curdle milk as she sternly tells Batman to “not even <em> think </em> about moving your leathery ass away from this room, I swear to god if you vanish into the night and leave me alone with a patient without telling me anything, I’m going to kick your ass. And I <em> will </em> win”</p>\n<p> </p>\n<p>Tim thinks they’ll get along splendidly.</p>\n<p> </p>\n<p>The room Dr. Thompkins shows them to has pastel green walls and is smaller than the kitchen in Drake Manor. The bed she instructs Tim to hop onto is too tall for him to get on by himself, let alone with a busted ankle. </p>\n<p> </p>\n<p>When Batman twitches like he’s thinking of offering his assistance, Tim throws him a venomous look and pointedly asks Robin for his help. </p>\n<p><br>\n<br>\n</p>\n<p>When Dr. Thompkins steps back in a few minutes later, the room is painfully silent. She looks at Batman, brooding in the darkest corner, then Robin, swinging his legs atop the same bed Tim is on and nervously glancing between his mentor and the boy next to him, and then finally her eyes land on Tim, quietly fuming, arms crossed in front of his chest, and glaring hellfire at the current source of his rage.</p>\n<p> </p>\n<p>“There’s more tension in here than my back,” Dr. Thompkins says as the door swings shut behind her, drawing every eye to her immediately. She flicks her eyes around the room before choosing to settle on Tim, stepping forward until she’s right next to his bed. “Is everything alright?”</p>\n<p> </p>\n<p>As Tim draws himself up as straight as he can without dislodging her grip on his throbbing ankle, Robin lets out a quiet groan beside him. </p>\n<p> </p>\n<p>“As a matter of fact,” Tim says loudly, ignoring how Robin collapses onto his back and throws an arm over his eyes, “everything is <em> not </em> alright. This man, this man right here,” he stabs a finger at Batman, who stares back with an air of guilty exasperation, “he is the cause of all this. I insist you send him to jail immediately.”</p>\n<p> </p>\n<p>Dr. Thompkins blinks slowly, momentarily pausing her prodding. “Well, I’m not a cop so…no. But if there’s a reason you feel unsafe with him in the room, you can tell me and I can kick him out.”</p>\n<p> </p>\n<p>“Oh boy, here we go,” Robin mutters, but Tim can’t bother to acknowledge him right now because the only thing in him right now is rage, clawing a home into his stomach and settling in. He puffs out his cheeks and stabs more vigorously at Batman, wishing for something to throw at him.</p>\n<p> </p>\n<p>“He broke my camera!” Tim wails, incensed. “Not a crack, not a dent; it’s nothing but a pile of glass because he <em> broke it </em>!”</p>\n<p> </p>\n<p>“And his ankle,” Robin adds.</p>\n<p> </p>\n<p>“<em> And my ankle! </em>”</p>\n<p> </p>\n<p>“...I accidentally hit him with my car,” Batman reluctantly offers when Dr. Thompkins raises her eyebrow at him, causing her to choke on her next breath. “But I managed to mostly swerve away once I noticed him, so I think he only got clipped,” he adds over Tim’s loud scoff.</p>\n<p> </p>\n<p>“But we’re all in agreement that <em> something’s </em>up with his ankle,” Robin contributes, finally sitting up to throw an arm around Tim, who couldn’t quite manage to hide his flinch in time. Robin freezes, then starts to slowly withdraw and Tim—Tim—</p>\n<p> </p>\n<p>(The last time his parents had left at the calling of another dig, they’d been playful, flushed with excitement. His dad had twirled his mom as Tim brought down their luggage, gently dipping her as she shook with laughter. Their touches with him had been gentle and fleeting, a hand squeezing his shoulder from Dad and a quick kiss pressed against his hair before they swept out of the door and were off to the airport. </p>\n<p> </p>\n<p>That was almost two months ago. </p>\n<p> </p>\n<p>Tim understood. Really, he did! Their work was important and he was in his double digits now, nearly eleven, give or take a handful of months. He didn’t need a hug. He didn’t need his parents to hold his hand every time he was injured. </p>\n<p> </p>\n<p>And yet.)</p>\n<p> </p>\n<p>Tim fists his hand in Robin’s cape and tentatively leans into the arm, bumping shoulders with the hero. A moment later, the arm settles back down and Tim relaxes. When he looks up, he finds Dr. Thompkins and Batman looking at him with an unreadable expression. </p>\n<p> </p>\n<p>“Well,” Dr. Thompkins says before Tim can work himself into a panic, tucking her hands into the pockets on her scrubs, “I can tell you now that your ankle is most definitely not broken, Tim. Badly sprained? Absolutely. But not broken.” She sends him a tired smile that Tim returns, more than a little relieved. The one saving grace in this whole incident is that he won’t have to explain how he broke his ankle to his parents. “I’ll write you up for some pain medication in case it starts to hurt or you bump it on something, but I highly recommend you RICE it.”</p>\n<p> </p>\n<p>“It’s an acronym,” Robin explains when Tim stares blankly at her. “Stands for Rest, Ice, Compress, and Elevate.” Dr. Thompkins nods along with his words, snatching a post-it note from the nearby desk and scribbling his words down before handing it to Tim. </p>\n<p> </p>\n<p>“I’ll go get you those pains meds now. Batman,” she says, tone chilling considerably, and Tim wonders if he imagined the slight flinch from the man, “would you please accompany me? I’d like a word with you.”</p>\n<p> </p>\n<p>It’s not a question, no matter how it’s phrased like one.</p>\n<p> </p>\n<p>Batman willingly walks out the door she holds open for him and with a soft click, the room is empty of adults.</p>\n<p> </p>\n<p>“So?” Robin nudges him gently, earning himself a puzzled glance from Tim. “What’s really going on?”</p>\n<p> </p>\n<p>“I don’t know what you’re talking about,” Tim denies immediately.</p>\n<p> </p>\n<p>Robin gives him a flat look. “Look Timbit,—”</p>\n<p> </p>\n<p>“<em> Timbit? </em>”</p>\n<p> </p>\n<p>“—don’t go around telling people this, but I was an alley kid. Deflecting with anger to hide whatever you’re really feeling? I’ve got that shit on lock. I practically invented that move. And you’ve had this look in your eyes since the moment I told you how you got your injuries.” </p>\n<p> </p>\n<p>Tim stays silent as a grave, forcing his hand to let go of Robin’s cape so he can clasp both of his own in his lap, like the polite young socialite his parents taught him to be. Robin makes a noise of protest before cutting himself off.</p>\n<p> </p>\n<p>“...Look,” Robin starts slowly, and out of the corner of his eyes Tim can see him drumming his free hand on his thigh. “I know I’m not—the Robin you’re used to. I’m practically a stranger to you. But.” Robin pauses and Tim chances a glance upwards, watching as flashes of uncertainty, determination, and deep concern play out across his face. Tim ducks his head back down, but he can’t block out the soft, full-body squeeze Robin gives him. “But I’m still <em> a </em> Robin. And as long as I am, you’re safe, okay? You’re safe with me.”</p>\n<p> </p>\n<p>Tim fiddles with the bottom of his shirt, keeping his eyes there to hide the way his vision has started to become blurry. “It’s just—” voice cracking, Tim huddles further into the arm around his shoulders. “He hurt me. Batman <em> hurt </em>me. He’s not—he’s not supposed to do that! He was supposed to be safe, but. But he hurt me, too.” </p>\n<p> </p>\n<p>So close together, Tim can feel the way the older boy tenses. A small sob hiccups out of his throat, prompting Robin to wrap his other arm around him, squeezing him tightly.</p>\n<p> </p>\n<p>“Oh, kiddo,” Robin sighs, tone filled with regret, “it honestly was an accident—”</p>\n<p> </p>\n<p>(His mother, holding a bag of frozen peas to the bruise on his cheek the same size as his father’s fist. <em> It was an accident </em> , she says sternly, tutting at the soft whimper that escapes Tim’s throat when she presses down too hard. <em> It’s going to be hard to see you like this, so you need to cover it with make-up. You don’t want to make your father sad now, do you? </em></p>\n<p> </p>\n<p>Tim shakes his head and earns himself an approving nod and a pat on the head. </p>\n<p> </p>\n<p>The next morning, when his father absentmindedly remembers to apologize after some prompting from Mother, his mouth tastes like ash when he says, <em> It’s okay, Dad. Of course I forgive you. </em>)</p>\n<p> </p>\n<p>“—but I bet that doesn’t mean much, does it?” </p>\n<p> </p>\n<p>Clenching his eyes, Tim tucks his face into the curve of Robin’s neck and shakes his head vigorously. </p>\n<p> </p>\n<p><em> No </em> , Tim thinks around the stinging pain of betrayal, <em> it really doesn’t </em>.</p>\n<p> </p>\n<p>- </p>\n<p> </p>\n<p>By the time Dr. Thompkins and Batman come back into the room, Tim’s brief crying session (long overdue, according to Robin, who remains astounded Tim hadn’t burst into tears the moment he found out he got hit by a car) is over and done with. In an attempt to keep a second round of tears at bay, Robin has taken to telling stories about Batman’s greatest mishaps. Some he’d experienced personally, and some had been passed down to him from the previous Robin.</p>\n<p> </p>\n<p>“And so I walk into the Batcave, and this man is head-to-toe covered in bat shit,” Robin is saying, and Tim, snickering too hard to do anything but listen attentively, doesn’t notice the door opening. “I freeze on the spot of course, but he doesn’t even stop to say anything to me, just walks straight to the weapons case, grabs a bow and arrow that I didn’t even know we <em> had </em> , much less that he knew how to <em> use it </em>, and he finally sees me standing there, and you know what he tells me? You wanna know what he tells me?</p>\n<p> </p>\n<p>“What?” Tim wheezes, a few stray giggles bursting out. “What did he say?”</p>\n<p> </p>\n<p>Deeping his voice, Robin gives Tim a faux somber face while miming notching a bow and says, “These motherfuckers are gonna learn today.”</p>\n<p> </p>\n<p>Over Tim’s unrestrained peals of laughter, he hears a soft sigh come from the doorway. “You always do this. Why do you insist on telling that story to everyone you see?”</p>\n<p> </p>\n<p>“I feel like it really explains you as a person,” Robin fires back cheerfully, shooting Batman finger guns at the flat, unamused stare he’s given. Tim watches the man carefully, smile fading slightly, but he doesn’t seem angry. Whatever Dr. Thompkins said to him doesn’t seem to have had a lasting affect. </p>\n<p> </p>\n<p>“Here you are, kid.” Speak of the devil and she shall appear. Tim blinks, accepting the white bag held out to him. “Take one tablet once a day for three weeks. If the pain continues past then, then come back and I’ll take another look at it. That sound okay to you?”</p>\n<p> </p>\n<p>“Yes, Dr. Thompkins.”</p>\n<p> </p>\n<p>“Look at that, no fuss, no ‘I don’t need pain meds’, just taking the word of his doctor to make sure his health is the best it can be.” Leslie sends a sharp pointed glance at the corner Batman has slipped back into. “<em> Some </em> people could stand to learn a thing or two.” Batman moves his head in a way Tim is 50% sure means he just rolled his eyes under his mask. </p>\n<p> </p>\n<p>With one more stern glance his way, she grants Robin and Tim one last smile as she gathers her things. “We’re all done here, so feel free to use this room for as long as you need before leaving. Good night, everyone. Feel free to drop by anytime, though preferably without an injury.”</p>\n<p> </p>\n<p>He runs her words over in his head as he waves her goodbye, tucking the post-it note from her into a side pocket on his busted camera case, still slung around his neck. What reason would they have to stay any longer than necessary?</p>\n<p> </p>\n<p>Robin jumps off the bed first, stretching and shaking out his legs before turning to offer an arm to Tim. Getting down is more of a hassle than getting up was; Tim is already dreading going back to his empty house. He’ll have to camp out in the downstairs living room, going up and down the stairs for food would just irritate his foot and lengthen the healing process. He’d like to have the rolly chair in his room for easy movement, but that was upstairs, which meant it was inaccessible. Maybe he could—</p>\n<p> </p>\n<p>A slight clearing of the throat was what finally made him aware of the shadowed figure towering over him.</p>\n<p> </p>\n<p>Tim sucked in a sharp breath and automatically went to step behind Robin, who’s taller height would hopefully shield him. He made the mistake of putting weight on his sprained ankle, though, and had to quickly stifle a pained yelp as his leg crumbled beneath him, only saved from toppling over due to Robin’s lightning fast reflexives. </p>\n<p> </p>\n<p>Across from him, Batman took a hasty step back, and then one more when Tim still didn’t relax, clutching Robin’s arm tightly. “I’m sorry,” Batman’s tone was stilted, like he was reading off cue cards. “I did not intend for this to happen, but nonetheless it did. I’m sorry. I should have been paying more attention to the road. I—”</p>\n<p> </p>\n<p>Batman clenched and opened his fists repeatedly, blowing out a heavy breath that sagged his shoulders. Tim’s eyes widened when the man slowly lowered himself to the ground, kneeling on one leg. Even with height bent in half, Batman still had an inch or two on Tim, but at least like this they were more or less at eye level. </p>\n<p> </p>\n<p>“I’m sorry,” Batman’s deep voice said earnestly, “for hurting you. You don’t have to forgive me, and I understand if you decide to hate me for the rest of your life. I will replace your camera, of course—” Robin loudly clearing his throat halted his next words, and Batman quickly amended, “Though I am aware that the emotional significance is beyond my power to return to you.”</p>\n<p> </p>\n<p>Tim studied the man in front of him carefully. What little the cowl didn’t cover seemed sincere. His lips were pursed ever so slightly in what Tim was starting to think was true regret. Looking to Robin for what he should do brought no help whatsoever, the older boy just staring back at him.</p>\n<p> </p>\n<p>Decidedly, Tim pressed his hand against Batman’s massive shoulder.</p>\n<p> </p>\n<p>“You’re not the worst,” Tim told him solemnly, giving him a firm pat before taking away his hand. </p>\n<p> </p>\n<p>This time, Tim was <em> sure </em>he saw Batman’s mouth twitch. “I’ll take it.\" </p>\n<p> </p>\n<p>-</p>\n<p> </p>\n<p>Back inside the Batmobile, Batman driving like he was in three separate car chases at the same time, Robin turned sideways and said, “So. I can’t help but wonder who on earth allowed an eight year old—”</p>\n<p> </p>\n<p>“Ten. I’m ten. Did I not mention that? I am definitely not eight years old.”</p>\n<p> </p>\n<p>“—a five year old—”</p>\n<p> </p>\n<p>“<em> Robin</em>.”</p>\n<p> </p>\n<p>“—I’m just going to go lower every time you interrupt,” Robin said, dodging Tim’s punch to his shoulder without letting his shit-eating grin drop an inch. “As I was saying, who let a toddler go out into Gotham in the middle of the night? I’d like to have a few words with your caretaker. Don’t be alarmed if some of those words leave bruises.”</p>\n<p> </p>\n<p>“No, no bruises,” Batman scolds, sending a narrowed glare through the rearview mirror. Tim tilts his head at both of them.</p>\n<p> </p>\n<p>“What do you mean?” </p>\n<p> </p>\n<p>“Your nanny should have kept a better eye on you, Tim,” Batman explains, making a U-turn Tim is fairly certain is illegal. “It’s dangerous for a child to be wandering the streets of Gotham alone, much less at night.”</p>\n<p> </p>\n<p>Tim blinks slowly.</p>\n<p> </p>\n<p>“Umm,” he says hesitantly, glancing between the two heroes. “What nanny? </p>\n<p> </p>\n<p>Robin shoots him a befuddled look. “<em> ...Your </em> nanny? The person who takes care of you while you’re away? Or are your parents home?”</p>\n<p> </p>\n<p>“No, they should be in Guatemala right now,” Batman refutes before Tim can. He nods anyway when Robin turns to him to check.</p>\n<p> </p>\n<p>“Yeah, they’re not home right now,” Tim confirms. “But there’s also no nanny. Did someone tell you guys I had a nanny?”</p>\n<p> </p>\n<p>For a moment, there’s total silence.</p>\n<p> </p>\n<p>“Tim,” Batman finally says, “who looks after you while your parents are away?”</p>\n<p> </p>\n<p>Tim rolls his eyes. “No one? Come on, guys. I’m ten years old, but I’m basically eleven, which is practically fifteen, which means I’m essentially already <em>eighteen</em>, and should therefore be treated like an adult.”</p>\n<p> </p>\n<p>“...Yeah, I’m gonna need whatever trampoline you just used to jump through all those hoops,” Robin says after a moment of staring.</p>\n<p> </p>\n<p>The Batmobile comes to a screeching halt. When Tim glances outside his window, he’s surprised to see Drake Manor, just as dark as he’d left it. It feels like no time at all has passed since they left Dr. Thompkins clinic.</p>\n<p> </p>\n<p>“Tim,” Batman says, drawing his attention. “Do you mean to tell me there’s absolutely no one inside that house right now? No one who can make sure you get the help you need with your ankle the way it is right now?”</p>\n<p> </p>\n<p>Tim squirms in his seat, crossing his arms across his chest. He doesn’t understand what seems to be the problem. What does it matter if there's no one but him at home? Tim can take care of himself. He’s been doing so for as long as he can remember. “It’s fine.”</p>\n<p> </p>\n<p>“Tim.” Batman fully twists his chair around, coming face-to-face with Tim. “You understand I can’t just let you go inside knowing that you’d be alone, right?”</p>\n<p> </p>\n<p>“Why not?” Tim bursts out, clenching his fists and hunching further into himself. “I’m fine on my own. I’m very independent, I don’t need my parents to watch my back every second of the day.” </p>\n<p> </p>\n<p>“You’re a child. Children should have someone to look after them, especially when they’re injured.”</p>\n<p> </p>\n<p>“So what’s your plan? You gonna call my parents? Tell them they need to be on the next flight out to Gotham?</p>\n<p> </p>\n<p>“Actually,” Robin coughs delicately, drawing both of their attention, “I might have a better idea.”</p>\n<p> </p>\n<p>Batman stares at his partner uncomprehendingly. Carefully, Robin tilts his head ever so slightly to the right. </p>\n<p> </p>\n<p>When Tim tries to follow his line of thought, his eyes are drawn to Wayne Manor in the distance, shining like a beacon.</p>\n<p> </p>\n<p>Across from him, Batman hums consideringly.</p>\n<p> </p>\n<p>-</p>\n<p> </p>\n<p>“Jason’s room is just across the hall, and mine is two doors down if you need me,” Actual Real Life Bruce Wayne says to him, passing on a small pile of pajamas that used to belong to Jason and a new toothbrush before opening the door to the guest room that’ll be Tim’s for the night. Or however long it’ll be until Tim gets to go back home.</p>\n<p> </p>\n<p>The room, at least, is beautiful. The bed is gigantic with a mattress Tim is slightly afraid will be all too easy to sink into and never come out of. The window curtains are drawn closed, preventing the early morning dawn light from crawling through. Actual Real Life Bruce Wayne points out a door near the bed. </p>\n<p> </p>\n<p>“That right there is the bathroom, and the door next to the desk is the closet,” Bruce explains too cheerfully for the dead tired look in his eyes. It must be hell to have to keep yourself up after a long night of crime-fighting, Tim thinks as he watches Actual Real Life Bruce Wayne scrub a hand down his face with a yawn.</p>\n<p> </p>\n<p>“Tomorrow, we’ll get your clothes and fill it up a bit. For now, try and get some sleep. I’m sure you’re tired. I’ll leave a message for your parents about what Batman told me before I drop off into la-la-land myself.” With another yawn, Bruce sends him a gentle smile that looks a touch more real than the ones Tim’s seen in the magazines his mother likes to read and sees himself out. </p>\n<p> </p>\n<p>For a long moment, Tim finds himself staring at the closed door, a pile of clothes in his arms, his phone in one pocket and his keys in another, and a shattered mess that used to be his camera on his chest. It’s not how he expected the night to end. It’s not even close. </p>\n<p> </p>\n<p>But Bruce is right. Tim <em> is </em> tired. He changes into the borrowed pajamas quickly, suddenly aching to be swallowed by the warm, comfortable-looking bed waiting for him. He brushes his teeth and his hair, and makes sure his small handful of items are all on the desk right alongside his clothes before he lets himself crawl into bed. </p>\n<p> </p>\n<p>A heavy sigh leaves him as he relaxes into the pillows, eyes heavy. He has no idea what’s going to happen now, with his parents, with the fact that he’s apparently living with Batman and Robin for the time being. But now isn’t the time for that.</p>\n<p> </p>\n<p>Tim blinks once, twice, and on the third blink, his eyes close and don’t open again.</p>"
}