{
  "id": "36366793",
  "url": "https://archiveofourown.org/works/36366793?view_full_work=true",
  "author": [
    "jilliancares"
  ],
  "title": "let me explain",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Deadpool - All Media Types",
    "Spider-Man - All Media Types"
  ],
  "relationships": [
    "Peter Parker/Wade Wilson"
  ],
  "characters": [],
  "additional_tags": [
    "Getting Together",
    "Identity Reveal",
    "5+1 Things",
    "kind of like it wasn't intentionally written that way but it has the same vibe",
    "Wade Wilson is a Good Friend",
    "Smart Wade Wilson",
    "observant wade wilson",
    "accidental bunny massacre",
    "Peter is in love with Wade",
    "Fluff"
  ],
  "language": "English",
  "series": "",
  "published": "2022-01-12",
  "completed": null,
  "words": "8,505",
  "chapters": "1/1",
  "comments": "392",
  "kudos": "10,223",
  "bookmarks": "2,144",
  "hits": "55,528",
  "summary": "<p>Wade scoffs, shaking his head and elbowing Peter in the side. “Sure,” he says, sarcastic. “That’s why your spidey-sense doesn’t see me.”</p>\n<p>Peter’s on the verge of laughing, wanting to join Wade in his amusement, but he freezes. His entire body goes still. He finds himself staring at a roof three buildings over, not even looking at anything. Two blocks away, a car alarm finally shuts off.</p>\n<p>“I never told you that,” Peter says, the realization startling him.</p>\n<p>Or: Peter's starting to realize just how much Wade knows about him.</p>",
  "notes": "<p>this idea struck me halfway through a two hour drive and i spent the last hour desperately trying not to forget all the scenarios and things i came up with for wade to know about peter ASJDLKF</p>\n<p>edit: chinese translation available here! | 此处提供翻译<br>lofter: https://yu--chi.lofter.com/post/4cc9effc_2b4d18611<br>ao3: https://archiveofourown.org/works/37508608</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>i've decided that it's cute when peter thinks of wade as wade but never calls him that 🤔</p>",
  "text": "<p>Peter hears him approaching.</p>\n<p>He’s sitting on a rooftop in Manhattan. It’s close to his favorite Mexican restaurant, which is actually Wade’s favorite Mexican restaurant. He’d never had it before Wade introduced it to him, showing up one night with a bag still warm from full of tacos, burritos, and empanadas.</p>\n<p>It’s not that Wade is especially loud. In fact, he’s so quiet so as to barely be noticeable. Peter certainly wouldn’t be able to hear him without his advanced hearing, and he still wouldn’t hear him if he hadn’t grown so used to the sound of Wade sneaking up on him. It’s as if his ears are specifically tuned to Deadpool’s movements, solely because his spidey-sense gave up on detecting him years ago.</p>\n<p>If Peter really stops to think about it — which he does on occasion, if he’s feeling especially bored — then he realizes how insane it is that he can hear Wade.</p>\n<p>Without concentrating, Peter can hear a <em>lot</em>. Two blocks over, a car’s alarm is beeping. It’s low and aggravating, but persistent enough to give Peter a headache if he focuses on it. He knows it isn’t an emergency, though. It’s because a particularly drunk bar-goer bumped into it while attempting to cross the street. Peter could hear his friends cajoling him after he tripped into it.</p>\n<p>At the base of the building, there’s a steady stream of chatter. It’s thanks to the people continuously passing underneath it, their conversations fading in and out as they come closer and drift away again, continuing down the sidewalk. There’s a couple arguing at a corner across the street, and it’s because the boyfriend forgot it was their anniversary and the girlfriend is pissed, because how can he remember which teams played in the Superbowl every year but not the important dates in their relationship?</p>\n<p>He can hear cars idling. Taxis honking. People laughing and a dog barking and a bat screeching somewhere in the distance. And, beneath it all, Peter can hear the careful scrape of Wade’s boots against the building, followed by the faint tinkling of brick crumbling out from underneath him.</p>\n<p>He shouldn’t be able to hear it, even with his super-hearing. Or, he should be able to hear it, but it shouldn’t be able to catch his attention. Not with everything else constantly attracting it, pulling his eyes and ears this way and that. Someone as quiet and stealthy as Wade shouldn’t be on his radar at all, but he is.</p>\n<p>He wouldn’t be, if he were anyone else. If some random guy was climbing up the wall the way Wade is, the sound of him coming closer wouldn’t register in Peter’s brain at all. Instead, his spidey-sense would tingle somewhere near the base of his neck. Not spelling out <em>danger</em>, per se, but just letting him know.</p>\n<p>A tentative, feeble kind of warning.</p>\n<p>\n<em>Someone’s almost here.</em>\n</p>\n<p>But it’s not a random guy, and for that reason, Peter’s spidey-sense is silent. It’s Wade. So the sound of the city takes a backseat as Peter’s ears train on the <em>scritch, scritch, scritch</em> of Wade’s feet scraping against the building.</p>\n<p>Peter pretends not to notice. He stares off into the distance until the sound stops. Wade is quiet coming up a building, but he’s <em>silent</em> on solid ground. Peter wouldn’t even know he were here if he’d arrived another way.</p>\n<p>He gives him a second or two, allowing Wade to think he finally got the jump on Spidey. He’s probably only a couple steps away when Peter finally speaks up. “No food tonight?”</p>\n<p>“God <em>dammit</em>,” Wade huffs. He gives up on the silent approach and stomps the rest of the way, plopping onto the ledge next to Peter and knocking heavily into his shoulder as he sits. “Fuck you.”</p>\n<p>“Gonna have to be better than that, DP,” Peter says.</p>\n<p>“I was so sure it was the smell giving me away,” Wade says.</p>\n<p>Peter laughs. It certainly hadn’t helped. He can always smell it when Wade’s bringing some sort or meal with him.</p>\n<p>“I brought you something anyway,” Wade grumbles, digging into his pouch and bringing out a chocolate bar. Peter just grins beneath the mask, accepting it without a word.</p>\n<p>Wade almost always brings him something. It must be a habit by now. When they first met — back when Peter was twenty — Wade never showed up empty handed. He was afraid that Peter didn’t care for his company, only his food, so he always made sure that Peter would at least stay long enough to finish a meal.</p>\n<p>“Thanks,” Peter says, yanking his mask up to his nose and ripping open the chocolate bar. He breaks it in two, handing half of it to Wade. In the beginning, Wade would only bring one meal. He was too self-conscious to eat in front of Peter, and he always found some sort of excuse. He’d claim that he ate his along the way, or that he was lactose intolerant, or that he’d had a big lunch. Peter had realized immediately that Wade was insecure about his skin.</p>\n<p>He’s not anymore. He pulls up his mask without a hint of hesitation, biting straight into the chocolate without bothering to break off a clearly outlined chunk.</p>\n<p>“I’ve never been to the zoo,” Peter says, unprompted. It’s a game of theirs. They’ve played it for as long as Peter can remember, and it’s never failed to start a good conversation.</p>\n<p>It was Wade who started it. They’d only been acquaintances for a short while, and usually whenever Peter finished eating whatever Wade had brought him, they’d abruptly run out of things to talk about, as if Peter’s meal was also a timeline for how long they could talk for. Probably just because it’s easier to talk when at least one party is distracted.</p>\n<p>Anyway, Peter had finished the last of his Slurpee from 7-Eleven, the straw sucking loudly at the dregs of the treat, when Wade had cleared his throat.</p>\n<p>“I can’t stand opera music,” he’d blurted. “It’s always sounded boring to me. Those kids on America’s Got Talent will show up and belt them out and everyone goes wild, but I can’t stand it. It’s unbearable,” he’d said. And then, more to himself than to Peter: “And they always get that stupid Golden Buzzer.”</p>\n<p>“Are you kidding?” Peter had said. “Singing opera takes an insane amount of talent. There’s more vocal control there than most kinds of singing.”</p>\n<p>And from there, their conversation had thrived. They’d argued for at least ten minutes, and somehow, the conversation had shifted to something new.</p>\n<p>Now, they often begin conversations with a random fact about themselves. Something they love or can’t stand or haven’t done or refuse to try. Something completely random that they don’t already know about the other.</p>\n<p>It’s always harmless, something that can’t be used to figure out Spider-Man’s identity, and Wade follows the same rules even though everyone already knows his.</p>\n<p>“You’re lying,” Wade says, even though they both know that Peter’s telling the truth.</p>\n<p>“Nope,” Peter says. “Honestly, I don’t get the appeal. I was supposed to go in the fifth grade, but I got sick the night before the field trip.”</p>\n<p>Wade scoffs. “How do you not get the appeal?” he says. “Where else will you ever see a lion in real life? Or a penguin? That’s literally the whole appeal.”</p>\n<p>Peter shrugs. “Why would I want to walk around and look at animals being held captive? I could watch Animal Planet and see them in the wild where they belong.”</p>\n<p>“A lot of those animals are being rehabilitated,” Wade says, sniffing imperiously. “Besides, it’s just a fun time. It’s an experience everyone needs to have.”</p>\n<p>“Doubt it,” Peter says.</p>\n<p>“I’m serious!” Wade insists. “Don’t you trust me?”</p>\n<p>Peter laughs, shaking his head. “Not at all,” he lies.</p>\n<p>Out of the two of them, most people would probably pick Deadpool to be the liar. He’s the mercenary. The more violent of the two, the more chaotic. He’s supposed to be unpredictable. Unreliable.</p>\n<p>Peter’s only caught him in a lie on rare occasions. Not including lies that hold literally no weight at all. But the lies Wade has told him have always been for good reason. Like things he’s trying to shield Peter from or situations in which he’s afraid Spidey might somehow end up getting hurt.</p>\n<p>But Peter? He lies all the time. Not just white lies, but huge ones. He’s constantly deflecting, constantly making things up and omitting the truth in an attempt to keep his identity a secret. Half the time, Peter’s pretty sure that Wade knows he’s lying, but he rarely calls him out on it.</p>\n<p>This isn’t like those times.</p>\n<p>Wade scoffs, shaking his head and elbowing Peter in the side. “Sure,” he says, sarcastic. “That’s why your spidey-sense doesn’t see me.”</p>\n<p>Peter’s on the verge of laughing, wanting to join Wade in his amusement, but he freezes. His entire body goes still. He finds himself staring at a roof three buildings over, not even looking at anything. Two blocks away, the car alarm finally shuts off.</p>\n<p>“I never told you that,” Peter says, the realization startling him.</p>\n<p>Wade knows about his spidey-sense. He knew even before Peter told him. He’d noticed the way that Peter could detect things without looking, without even realizing. How his body would react before his mind had even caught on.</p>\n<p>He’s seen Peter freeze in battle, seen him leap out of the way of gunshots and whip toward an undetected danger. But Peter’s never so much as mentioned that Wade doesn’t trip that invisible wire that everyone else constantly stumbles across.</p>\n<p>“You didn’t have to,” Wade says, oblivious to Peter’s surprise. “It was obvious.”</p>\n<p>“It was?”</p>\n<p>“Sure,” Wade says. “I mean, it’s all in your body language.”</p>\n<p>“My body language,” Peter repeats.</p>\n<p>“Yeah,” Wade says. “You used to stiffen if I was even a roof or two away from you. You even used to turn to look at me before I started talking, like you knew I was going to say something before I even opened my mouth. It hasn’t been like that for years, though. Now you never know what I’m going to do. You don’t know where I am unless you hear me.”</p>\n<p>Peter is doubly shocked.</p>\n<p>“You know that I hear you?”</p>\n<p>“’Course,” Wade says simply. It’s like he doesn’t realize that he’s turning Peter’s world upside down. “You can hear at least a couple blocks away, if you concentrate.”</p>\n<p>Wade lied. He lied when he said that he thought Peter was detecting him by smell, and Peter didn’t realize. Maybe he stretches the truth more often than Peter thought.</p>\n<p>“I never told you that,” Peter points out.</p>\n<p>“I thought you knew that I knew,” Wade says. He takes another heathen-esque bite of his chocolate.</p>\n<p>“You know, you’re scarily observant,” Peter points out. No one else can avoid Peter’s spidey-sense like Wade can. Even people that mean no harm trip it. Like, constantly. Peter could probably close his eyes and navigate the streets of New York, avoiding each and every pedestrian on the sidewalk. At least, unless Wade was the one walking toward him.</p>\n<p>Wade just chuckles, not realizing how far out of left field this is for Peter.</p>\n<p>“I’m a mercenary, Webs,” he says. “If I didn’t notice things, I’d be dead. Like, before all the immortal-plus-walking-Accutane-advertisement shit.”</p>\n<p>—</p>\n<p>Normally, Peter gives villains 110% of his attention.</p>\n<p>A villain isn’t just some criminal. Criminals are predictable. They’re normal people, lacking in morals and often driven to desperation. Villains are a different caliber. By Peter’s definition, they’re the ones with powers, with more extreme motives.</p>\n<p>That being said, the power of flooding New York’s streets without thousands of bunnies isn’t particularly pressing. Inconvenient, yes. But deadly? Not so much.</p>\n<p>“Take <em>that</em>, Spider-Man!” the evil bunny villain cackles. “Now no one can get home without running over defenseless animals! They’ll be distraught!”</p>\n<p>Wade lifts a manhole cover and kicks several bunnies inside.</p>\n<p>“Deadpool!” Peter reprimands. “Stop kicking bunnies into the sewer!”</p>\n<p>“You’re kidding, right?” Wade says, still sweeping them toward their demise. “There are thousands of them. We’ll never find them all a home.”</p>\n<p>“Still!”</p>\n<p>“And you know what they say about bunnies,” Wade continues. “Soon enough, there’ll be even more.”</p>\n<p>“Take this! And that!” Looney Tunes — emphasis on the Looney — says. More bunnies multiply around Peter. He webs up at least a hundred of them and hangs them from a lamppost, hoping a hundred children with extremely lenient parents happen to walk by.</p>\n<p>Despite the fact that Peter is currently facing off with a villain, he can’t really give this battle his full attention. Rather than needing to constantly intervene and save civilians, he’s actually letting them get closer than usual. They’re helping more than they usually do, some of them even cooing over the bunnies and picking them up. Peter can only hope that they decide to take them home.</p>\n<p>Plus, Wade’s accidentally commandeering most of Peter’s attention. They’re a great team in most battles. Peter hardly needs to look at him in order to fight with him, able to swing and attack with just his instincts alone. They can aid each other easily, constantly stepping up where one excels in a certain skillset over the other, but this isn’t like those times.</p>\n<p>“Here!” Wade cries, shoving a handful of bunnies into a car’s open window. “Free bunnies.”</p>\n<p>The driver protests, but Wade’s already directing them out of the street. “Just take a left right down there,” he says. “Run over as many of them as you can, please.”</p>\n<p>Finally, Peter is able to web Jack Rabbit before he can summon bunnies to block him, and the villain gets stuck to the side of a building, struggling uselessly. He calls for the bunnies to help, but they largely ignore him. They just hop around aimlessly. Wade left the manhole uncovered, and there’s a pretty steady stream of bunnies walking into the open hole with no regard for their lives.</p>\n<p>“You should go,” Wade says barely ten minutes later, having shoved as many bunnies into as many cars as possible. He grabs his katanas, twirling them meaningfully. “You’re not going to want to see what happens next.”</p>\n<p>“No,” Peter says abruptly, horrified. “You can’t.”</p>\n<p>“There’s seriously no other option,” Wade says. “It’s this or let a billion bunnies roam free in New York. They’re domesticated, Spidey. They won’t even last a week.”</p>\n<p>Peter shuffles his weight from one foot to the other, indecisive. On one hand, Wade has a point. There’s nowhere for these bunnies to go and no logical conclusion other than what Wade has in mind. On the other hand, Peter doesn’t want to approve the slaughter of this many innocent lives.</p>\n<p>“I guess you could stay here,” Wade adds, shrugging carelessly. “You probably wouldn’t even see most of it.”</p>\n<p>Peter stares at him blankly. He trusts that the expression translates through the mask.</p>\n<p>“How would I not see it?” he says, incredulous.</p>\n<p>“Your eyesight isn’t that good.”</p>\n<p>“What?”</p>\n<p>“I mean, you wear glasses,” Wade says.</p>\n<p>He’s right and wrong. Peter does wear glasses. Out of the suit, at least. But his eyesight is incredible. The glasses are just to keep up appearances.</p>\n<p>“What?” Peter echoes, too dumbfounded to manage anything else.</p>\n<p>Wade does some little gesture. He nudges his knuckle against the bridge of his nose.</p>\n<p>“What is that supposed to mean?”</p>\n<p>“It’s what you always do,” Wade says. “Like you’re trying to push up a pair of glasses that isn’t actually there.”</p>\n<p>“I don’t… do that,” Peter says. At least, he isn’t aware of himself doing that.</p>\n<p>“Sure, you do,” Wade says. “All the time. I figure you’re pretty blind in the suit. Oh! Or maybe you wear contacts?” He’s silent for five seconds at most. “Wait. You just wear glasses out of the suit because your eyesight used to be bad, huh?”</p>\n<p>“How,” Peter says, numb. “How could you possibly know that?”</p>\n<p>“I didn’t,” Wade says. “I guessed. But you just confirmed it. What kind of glasses do you wear, Spidey? Circles? Squares? Oooh, those Gen-Z clear ones that everyone’s obsessed with?”</p>\n<p>Peter shakes his head. “You’re terrifying. You know that?”</p>\n<p>“And I’m proud of it,” Wade says. “Now scurry on home. I have to carrot-e chop these bunnies. With katanas. Shit, no — I have to <em>burrow</em> these bunnies in the ground.”</p>\n<p>“Horrible.”</p>\n<p>“<em>Wait</em>. Knock knock!”</p>\n<p>Peter sighs. “Who’s there?”</p>\n<p>“Alice.”</p>\n<p>“Alice who.”</p>\n<p>“Alice these bunnies would <em>wonder</em> to another <em>land</em>. Get it? Alice? Kind of like ‘I wish’? It doesn’t really work, does it?”</p>\n<p>“I’m going home,” Peter says. “Bye.” He shoots off a web and is already swinging away when Wade calls after him.</p>\n<p>“No, I have another one!” he cries. “It’s <em>rabbit season</em>!”</p>\n<p>—</p>\n<p>Peter slides open the window and wriggles into Wade’s apartment, closing it behind him with a foot. The living room is empty, which usually means Wade isn’t home. For whatever reason — probably because Wade is more adult-like than Peter ever will be — he doesn’t tend to hang out in his room. He thinks a bed is solely for sleeping and not for spending time in.</p>\n<p>Peter disagrees. He owns a couch mostly because Aunt May told him that everyone needs a couch. When Peter’s home, he’s usually sitting in his bed with his laptop.</p>\n<p>He makes his way into the kitchen, pulling open the fridge and analyzing its contents. It’s full of leftovers, but it’s always hard to tell how old the leftovers are in Wade’s fridge. Most of the time, it’s not safe to eat.</p>\n<p align=\"right\">\n<strong>23:52</strong><br>\n<em>beat u home</em><br>\n<em>[1 Image Attachment]</em>\n</p>\n<p>Peter shoots off the text to Wade, including a picture of him standing in front of the open fridge holding up a peace sign.</p>\n<p>\n<strong>23:52</strong><br>\n<em>i think chinese is from ystrday</em><br>\n<em>or i can pick up pizza</em><br>\n<em>whatever u want bb</em>\n</p>\n<p align=\"right\">\n<strong>23:53</strong><br>\n<em>pizza? 👀</em>\n</p>\n<p>Peter makes himself at home on Wade’s couch, turning on the TV and letting whatever Wade was watching last continue playing.</p>\n<p>Wade’s apartment is like their home base. It’s where they go when they want to hang out without being “on duty.”</p>\n<p>It used to make Peter nervous, coming here. He was afraid that accepting the invitation would mean that one day, Wade would expect the same in return. That he’d start begging Peter to let him come over to his apartment, which would be just one short step from Wade figuring out Peter’s identity. But Wade has never asked, and despite the fact that Wade figuring out Peter’s identity doesn’t give him anxiety anymore, he’s never offered.</p>\n<p>He likes what they have. The rhythm, the comfort, the <em>known</em>. Even though he knows it wouldn’t matter if Wade knew his identity, he’s still hesitant to switch things up.</p>\n<p>By the time Wade returns, ten minutes have passed and Peter’s stolen a pair of sweatpants out of the dresser in his bedroom, having put them on over his suit.</p>\n<p>“Hey, baby boy,” Wade says, setting three boxes of pizza on the table before Peter and collapsing onto the couch next to him. “I didn’t know you were comin’ over tonight.” He scoots closer, squeezing a hand behind Peter’s back and then tugging him into a hug, resting his head on Peter’s shoulder.</p>\n<p>Wade is the touchiest person Peter knows. He’s also the only person Peter would tolerate it from. He wraps an arm around Wade’s shoulders and precariously maneuvers a box closer to them, balancing it on the top of his foot. Wade grabs them each a slice once it’s within reach.</p>\n<p>“I wasn’t planning on it,” Peter admits. “But I was close by and I figured I’d see what you were up to.”</p>\n<p>“Nothing as fun as this,” Wade says. Then he glances down and plucks at the waistband of Peter’s sweatpants. Wade’s sweatpants. “These are mine,” he points out.</p>\n<p>“I was cold,” Peter says. And then he clears his throat. “Actually, there’s another reason I came by.”</p>\n<p>“Yeah?” Wade says. “I don’t mind doing sexual favors, but I prefer some advanced notice.”</p>\n<p>Peter snorts, kicking him in the shin. Across the room, the clock on the oven glows the time. 00:09. “It’s my birthday.”</p>\n<p>Wade gasps, planting a hand on Peter’s thigh and using it as leverage to sit up, pulling away from Peter.</p>\n<p>“Shut the fuck up,” he says. “Right now?”</p>\n<p>“Right now,” Peter agrees, unable to tamp down his grin.</p>\n<p>“Webs!” Wade blurts. “You asshole! I would’ve gotten a cake! Or, I don’t know, ice cream or something. Not just some shitty pizza!”</p>\n<p>“The pizza’s great,” Peter says.</p>\n<p>“Well, yeah. But it’s not <em>birthday</em> great.”</p>\n<p>Peter laughs. He leans back into Wade, and Wade is gracious enough nowadays to let Peter initiate contact without calling attention to it. “It’s fine,” he insists. “I don’t usually do anything for my birthday, anyway. I just wanted to hang out if you were free.”</p>\n<p>“I’m always free for you,” Wade insists. He grabs them each another piece of pizza. “Wow. You can rent cars now.”</p>\n<p>“The only thing I have left to look forward to is retirement,” Peter agrees, giggling softly. And then he tilts his head. “Wait.”</p>\n<p>Wade cackles. “Let me guess. ‘But Deadpool! How do you know how old I am?’”</p>\n<p>Peter purses his lips. Takes a bite of his pizza and ignores him. After he swallows, he nods. “Yeah,” he says.</p>\n<p>“Well, we started hanging out when you were twenty,” Wade says.</p>\n<p>“Which I never told you.”</p>\n<p>“Sure, but two years before we started hanging out, your Spidey schedule changed drastically. It wasn’t just after 4 p.m. and on the weekends — it was different times on different days of the week. As if you were working around shifts rather than school.”</p>\n<p>That’s absurd. Who notices something like that?</p>\n<p>“I could’ve been 19,” Peter protests. “Or 21.”</p>\n<p>“Yeah, but the majority of people graduate at 18. You could’ve skipped a grade, you’re definitely smart enough, but most parents decide to keep their kids in the same grade so they’ll stick with the people their age. Not that you have parents,” Wade adds. Peter’s fingers clench into the cushion under his thighs because he’s never told Wade that either. Wade winces. “Sorry.”</p>\n<p>Peter doesn’t bother asking how he knows. He’s probably dropped a million unintentional hints, if the way these conversations have been going are any indication.</p>\n<p>“Whatever,” Peter huffs. “Yes, I’m 25.”</p>\n<p>Wade squeezes him. “Happy birthday.”</p>\n<p>—</p>\n<p>Peter knows that Wade is smart. It was one of the first things he noticed about him.</p>\n<p>And Wade isn’t just smart in the scary, analytical, tactical mercenary way. He’s just genuinely <em>smart</em>. As in, Peter once recommended a book, not thinking Wade would actually take the time to read it, and a week later they’d had a highly intellectual conversation about its themes and whether the author was intentionally writing about the perils of colonization (they decided that yes, she was).</p>\n<p>He’s smart in the way that Peter can ramble on and on about his research and the ways he’s experimenting with his web fluid and Wade can challenge him and suggest new ideas without having known anything about the subject beforehand. He’s ridiculous and corny and funny and leud, but he’s also secretly a genius and that’s not something that most people know about him.</p>\n<p>One time, Wade ranted to Peter about how much he’d hated school, arguing against Peter’s love for school. He’d gotten horrible grades consistently, but it was solely because school hadn’t challenged him enough.</p>\n<p>“Why do they have to harp on about the same subject for two weeks?” Wade had scoffed. “By the time they give you the test it’s not even interesting anymore.”</p>\n<p>Anyway. Peter knows Wade’s smart. He knows he’s observant and that being smart comes easily and naturally to him. Peter’s rarely surprised when Wade says something he wasn’t expecting, because he knows that Wade has the capacity for it.</p>\n<p>He’s just surprised that Wade knows all this shit about <em>him</em>. Because Peter’s smart too. And more than that, he’s careful. He’s secretive. His identity has always been one of his top priorities and even knowing how smart Wade is, Peter had never thought that he wasn’t doing enough to guard the secrets of identity.</p>\n<p>Every time Wade points something out about him that he shouldn’t even know — and so easily and thoughtlessly, like he’s known it for a while and not just realizing it for the first time — it shocks Peter to his core. It feels like Wade is stripping layers away from him, uncovering who Peter really is.</p>\n<p>Actually, no. It feels like the layers aren’t even there. Like Peter deluded himself into thinking they were but he was naked the whole time and never even realized it.</p>\n<p>What else does Wade know about him? What other stores of information are just casually hanging out in Wade’s mind, as if they aren’t a big deal?</p>\n<p>Whatever. Now probably isn’t the time to be thinking about this anyway.</p>\n<p>“Ow,” Wade whimpers, hopping again and leaning against Peter even harder. His foot is missing. He hasn’t told Peter what happened to it, but Wade has a pretty high track record of getting stuck in insane places and just cutting off his own limbs to free himself. He doesn’t have the patience to wiggle out of tight situations.</p>\n<p>“Stop trying to walk,” Peter says, attempting to ignore Wade as he squints down at his phone. He’s also trying to ignore his own paranoia. He’s aware that Wade is staring over his shoulder at his phone and normally Peter wouldn’t think twice about it, but now he’s wondering what information he’s unintentionally giving away.</p>\n<p>Did anything identifying pop up when he googled ‘CVS near me’? What about his apps? His wallpaper? God, Wade probably knows the scent and brand of Peter’s deodorant, just by being so close to him right now.</p>\n<p>This is stupid. Peter doesn’t need to be thinking about this so hard, much less freaking out about it. It’s just <em>Wade</em>. Peter’s lifestyle doesn’t leave a lot of room for socializing or making friends, and Peter has secretly thought of Wade as his best friend for the last four and a half years. Wade definitely knows that.</p>\n<p>When something funny happens to Peter, Wade is always the first person he thinks of to tell. He’s the most common character in all of Peter’s dreams. He’s the only person (besides Aunt May) who Peter makes plans with. Peter genuinely loves him as a person and as a friend and perhaps-accidentally as something a bit more and it doesn’t <em>matter</em> if Wade knows everything there is to know about Peter. The fact that the things he knows about Peter aren’t a big deal to him is just further evidence that Peter has no reason to worry.</p>\n<p>“It doesn’t look like anything’s open,” Peter says. Wade doesn’t actually need medical supplies to heal, but Peter knows from experience that it speeds up the process and results in his skin being less irritated after the fact.</p>\n<p>Wade whines. “Don’t you have a first aid kit?” he says, slumping into Peter.</p>\n<p>“Not on me,” Peter says. “You know, you should start carrying this kind of stuff in your pouches.”</p>\n<p>“No room,” Wade says. “The condoms and lube take up all the space.”</p>\n<p>Peter ignores him. “How is nothing open right now?” he mutters.</p>\n<p>“I meant in your apartment,” Wade elaborates, ignoring Peter right back. “You’ve gotta have stuff in there.”</p>\n<p>“Well, yeah,” Peter says. “But we’re in an alley. Not my apartment.”</p>\n<p>Wade just stares at him. “But you live around here,” he says. Peter doesn’t freeze or stiffen or allow himself to feel shocked at all. He just accepts it. This is his life now.</p>\n<p>“Yep,” Peter says. “Sorry. I’m not ready to show you where I live right this second.”</p>\n<p>“’Course not, baby boy,” Wade says. “But maybe you could swing over there, grab some stuff, and come back?”</p>\n<p>Peter purses his lips. “Sure,” he decides. He tucks his phone away, wraps his arm around Wade’s waist, and webs them to the top of the nearest building. He sets Wade down between two HVAC units, leaning him against one and creating a miniature hammock against the other for Wade to prop his foot on. “I’ll be right back,” Peter says.</p>\n<p>“My hero,” Wade sighs, and Peter takes a running leap off the building.</p>\n<p>He doesn’t bother with any of the shit he normally would’ve bothered with. He doesn’t leave in the opposite direction so that he can loop around and disguise which direction his apartment is actually in. He doesn’t take longer than he needs to in an attempt to make Wade thinks he lives farther away then he really does. He just swings straight home, climbs through the window, grabs what he needs from his bathroom, and heads back.</p>\n<p>Wade is right where Peter left him, now scrolling on his phone. It’s aimed at Peter when he lands, and he knows from experience that he’s going to see some video of himself with a weird filter applied on Wade’s Snapchat story later.</p>\n<p>“Feel any better?” Peter asks, squatting next to Wade’s foot.</p>\n<p>“Feelin’ all right,” Wade says, wiggling his non-stump right foot.</p>\n<p>“Two out of ten,” Peter says. He reaches for Wade’s injured leg, carefully rolling the material of his suit out of the way. Wade’s injuries used to gross Peter out, but he’s too used to it by now. “So,” he says as he uncaps the Hydrogen peroxide. “How’d you know I lived around here?”</p>\n<p>“No matter where we meet up, if you’re just starting your patrol, you always swing like you’re coming from Queens,” Wade says simply. “I figured you lived around here.”</p>\n<p>“You figured right,” Peter says, wincing in sympathy as he pours the antiseptic on Wade, who hisses. “I have a shitty little apartment near here.”</p>\n<p>“I bet it has tons of character,” Wade assures him. “You’re not worried that I knew?”</p>\n<p>Peter just shrugs. “Nothing you do worries me,” he says, realizing that it’s true. He finishes up with Wade’s leg, and then he settles down beside him to wait. They spend the next hour talking and scrolling through Wade’s TikTok likes, which Peter always complains about secretly enjoys.</p>\n<p>—</p>\n<p>Wade drives with his left hand on top of the steering wheel and his right elbow sitting on the center console, an energy drink dangling from his fingers. Music is thrumming lowly in the background, hooked up to Wade’s phone, and Peter sits with his feet smushed between the dashboard and the windshield, leaving footprints against the glass.</p>\n<p>He’s never driven anywhere with Wade before. Never seen him drive. And he’s realizing abruptly that he finds it incredibly hot for absolutely no reason.</p>\n<p>Maybe it has something to do with seeing someone you know in a completely new setting for the first time. Peter would probably be similarly aware and irrationally excited to see Wade in other new settings, like navigating through an airport or dropping off a package at the post office. Actually, Peter distinctly remembers feeling this same way when he went to Wade’s apartment for the time. It was just new and different — Wade comfortable in his own home, sprawled out on his couch rather than the ledge of a building.</p>\n<p>Wade was hired to pick up something three and a half hours away. Not his usual kind of work, but a job he accepted nonetheless. Apparently, a girl left a few important belongings at her ex-boyfriend’s house. She doesn’t want to see him and he refused to mail them to her, wanting to force her to see him again, so she decided to hire Deadpool. A little extra assurance that her ex would return her stuff without her having to ask again.</p>\n<p>Peter’s tagging along just because. Wade invited him, not ecstatic about a long drive on his own, and Peter accepted because he has nothing better to do today and a road trip sounded fun.</p>\n<p>He’s fascinated about every aspect of Wade driving. Peter never learned how to drive — there isn’t really a reason to when you live in the city and can swing anywhere anyway — but now that Wade’s driving, he’s endlessly entertained. Just… the way Wade does everything without even thinking, everything about driving coming naturally to him. Glancing into the mirrors, merging into other lanes, talking to Peter while looking at the road. Somehow, it’s all ridiculously attractive.</p>\n<p>“You know a lot of things about me that no one else knows,” Peter says. Wade flashes his high beams and lets a truck that’s been trying to merge over cut in front of him.</p>\n<p>“Sure,” Wade says. “That’s just what happens when you’re really close. It’s the same for me,” he adds.</p>\n<p>“What do you mean?”</p>\n<p>“You’re the only one who knows a shit ton of stuff about me,” Wade says.</p>\n<p>“Really?” Peter says. For some reason, he thought it only went one way. That Wade knew everything about him, and Peter knew a lot about Wade, but that it was just random stuff. Shit anyone could know.</p>\n<p>“Yeah,” Wade says. “Like the boxes.”</p>\n<p>Peter frowns. “People don’t know about the boxes?”</p>\n<p>Wade shakes his head. “They just assume I talk to myself. Or they might think that I hear voices, but they don’t know for sure. No one else knows that there’s two distinct ones with different personalities. Or that they’re not even voices, necessarily, but <em>boxes</em>. It’s different and I can’t explain it.” Except he has. He explained it to Peter when he asked him about it once. Peter had already figured that he was hearing voices, and that there were two of them — one meaner than the other.</p>\n<p>“What else?” Peter says, suddenly ravenous for more. Wade’s mouth quirks up, amused. He takes another sip of his energy drink.</p>\n<p>“How many languages do I speak?”</p>\n<p>Peter scoffs. “I have no idea,” he says. “A million. All of them.”</p>\n<p>It’s not just that Wade travels to other countries easily, never worried about being lost or confused because of the foreign language. It’s also the way that whenever they’re watching movies, if a character says something in another language — even if there intentionally aren’t subtitles — Wade always laughs. They’re usually making some kind of joke, saying something that only a smaller audience gets to enjoy, and Wade <em>always</em> knows what they say. No matter the language.</p>\n<p>At first, Peter just thought he was pretending to get it. He caught on rather quickly that Wade was actually fluent in more languages than Peter could ever hope to count.</p>\n<p>Wade just shrugs. “Most people think I only speak one language. Two at most.”</p>\n<p>Peter gapes. He scoots back in his seat, moving his feet to the floor to sit up and pay better attention to the conversation. “What else?” he repeats.</p>\n<p>“You know that my skin is sensitive. That I have good and bad skin days and good and bad brain days. You know that it freaks me out when I feel trapped somewhere.” Evident by Wade chopping his limps off far too often.</p>\n<p>“Huh,” Peter says. “I didn’t know I was the only one who knew these things about you.”</p>\n<p>Wade grins. He flicks on the turn signal and gets into the next lane. “I like you knowing stuff about me, Webs. Makes me feel good. I like knowing stuff about you, too.”</p>\n<p>Peter smiles. He can feel himself blushing and he doesn’t even know why. “I like it too,” he admits. Realizes.</p>\n<p>The conversation shifts and they spend the next hour talking about past relationships, brought on by a debate over why the girl and her ex broke up and how long they might’ve dated beforehand.</p>\n<p>Peter talks about Gwen, who he’s mentioned to Wade in passing before. He already knows the whole sob story, but Peter focuses on the good times instead. How they got together, what kind of dates they went on, and a particularly amusing debate about whether Peter would still love her if she turned into a worm.</p>\n<p>In return, Wade tells him about Vanessa. Peter already knows some of the story, but like Peter, Wade reminisces on the better parts instead. He tells Peter about the stupid inside jokes they’d had, how she’d been the first person who he’d known before Weapon X that hadn’t called him ugly afterward, and how they’d lived together for a time, which Wade hadn’t expected to love as much as he did.</p>\n<p>They’ve taken an exit and are on a different stretch of highway by the time the conversation lulls. Wade hums along to the music, his knee bouncing to the rhythm. Peter feels content and soft and just a little bit in love.</p>\n<p>“Hey,” he says suddenly.</p>\n<p>“Oh my God, when did you get here?” Wade jokes. “Hi.”</p>\n<p>Peter rolls his eyes. “Serious question,” he says. “And I genuinely don’t care about the answer.”</p>\n<p>“Uh-huh.”</p>\n<p>“Do you know my identity?”</p>\n<p>The thought has been plaguing Peter for a couple weeks now. Well, maybe plaguing isn’t the right word. A few months ago, Peter probably would’ve been freaking out if the thought even crossed his mind. He’d be anxious and jittery, scared of the possibility and wary of giving himself away.</p>\n<p>Recently, the thought popped into Peter’s head and hasn’t gone away, but it’s more out of curiosity than anything else. Wade knows so much about him. What are the chances that he knows that Spider-Man is Peter Parker, and he just hadn’t made a big deal out of it?</p>\n<p>“’Course not,” Wade says. He shakes his head. “I wouldn’t do that to you.”</p>\n<p>Peter chews on the inside of his cheek. “But you could,” he realizes.</p>\n<p>“Oh, easily,” Wade says.</p>\n<p>“Seriously?” Peter says. “It’d be easy?”</p>\n<p>“For me,” Wade corrects. “Not anyone else. You’re fine.”</p>\n<p>Peter hums. Wade could, apparently, find out his identity. Easily. But he hasn’t.</p>\n<p>“Okay,” Peter says. “Let’s make a bet.”</p>\n<p>Wade perks up. He sits up a little straighter. “I’m listening.”</p>\n<p>“See if you can find out my identity,” Peter says. “Without, like, tracking me or following me home. You just have to come up to me on the street.”</p>\n<p>“You serious, baby boy?” Wade says. “Because I need you to be deathly serious. I <em>will</em> find out if you’re givin’ me permission.”</p>\n<p>“Yeah,” Peter says. “I’m serious.”</p>\n<p>“Want me to tell you how I’m gonna do it?”</p>\n<p>Peter shakes his head. “Tell me after,” he says. “I want to be surprised.”</p>\n<p>The rest of the trip, he’s giddy. Excited. His nerves are gone. All he can think about is when it’s going to happen, where, how. What it’ll be like when Wade strolls up to him — regular old Peter Parker — and gives him a once over, grinning behind the mask.</p>\n<p>—</p>\n<p>It’s been a long day.</p>\n<p>Peter’s alarm didn’t go off this morning, which pretty much set the tone. He missed breakfast, which caused him to be cranky until his lunch break, and the line at the deli was so long that Peter had to each his sandwich on the walk back to the lab, only furthering his bad mood.</p>\n<p>Plus, the specimen he was supposed to be examining wasn’t stored properly by whoever was working with them last time, and it took Peter longer than it should have to realize that the cells he was looking at weren’t supposed to look that way at all.</p>\n<p>Now, Peter’s desperately attempting to turn his mood around. He didn’t have to work late, which was nice, and he has leftovers from last night which he can heat up for dinner, which is always good. After that he can suit up and start swinging around the city, which always doubles as a nice warm-up and a mood lifter. If he’s lucky, Wade might already be out and about by the time he hits the rooftops and then he won’t even have to text him and wait for him to meet him somewhere. Fingers crossed.</p>\n<p>His little bet with Wade isn’t even on his mind as he walks home. They shook on it just two days ago, and even with Wade’s skills, it’ll probably take him a bit of time to work out who Spider-Man is.</p>\n<p>He’s just lost in his thoughts, drifting with New York’s crowds along the sidewalks. He almost does a doubletake when he sees Deadpool.</p>\n<p>He’s perched on a newspaper box, his legs swinging where they dangle above the ground. Peter averts his eyes immediately, not sure whether Wade noticed him or not.</p>\n<p>There’s no way. Just genuinely, absolutely no way. Wade couldn’t have figured out his identity in just two days. He definitely can’t pick Peter out of a crowd. For all Peter knows, he’s staking out right here for some kind of job, totally unaware that Spider-Man is passing by him on the sidewalk.</p>\n<p>Unable to help it, Peter glances back at him, just wanting to get another look.</p>\n<p>Wade’s staring straight at him. He’s smirking underneath the mask. The second he realizes he has Peter’s attention, he raises his hand — just barely — and curls his finger. <em>Come hither.</em></p>\n<p>Peter gapes. Wade throws his head back and cackles. And when he jumps off the box and heads into an alley, Peter follows.</p>\n<p>“<em>How</em>?” he says, the second he catches up to him. Wade doesn’t answer. He’s still getting over his fit of giggles, but he fights through it in order to grab Peter by the waist and shove him lightly against the wall behind him.</p>\n<p>“Oh man,” he wheezes. “You’re so fucking cute.”</p>\n<p>“Seriously, <em>how</em>?”</p>\n<p>Wade’s fingers dig into Peter’s sides, just squeezing him, holding him there.</p>\n<p>“Your facial expressions,” Wade coos. He squeals. “Your <em>hair</em>! Fuck, your <em>glasses</em>.”</p>\n<p>“Deadpool,” Peter says. Wade slides his hands up and down Peter’s sides, as if making sure he’s real.</p>\n<p>“Clothes,” Wade continues. “Real clothes. On your body.”</p>\n<p>“’Pool,” Peter huffs.</p>\n<p>“You’re adorable, Peter Parker,” Wade says. Peter blushes. For the first time, it’s not hidden behind his mask.</p>\n<p>“Please just tell me,” Peter whines.</p>\n<p>Wade doesn’t release him. If anything, he creeps even closer. “The average American commutes 26 minutes to work. I knew you were a scientist and guessed you worked in a lab, and I know what general area you live in. I also know you’re broke, so it probably wasn’t some big company or a super fancy job. I guessed that you’d probably walk to work, not ride the subway, because that’d cost extra money and you’d rather your workplace be within walking distance in case of Spidey emergencies and your suit was at home.”</p>\n<p>Fucking insane.</p>\n<p>“But… how’d you know it was <em>me</em>?”</p>\n<p>“I recognized you yesterday, actually,” Wade says. “But I didn’t wanna confront you until I knew your name.”</p>\n<p>“You recognized me,” Peter says dumbly.</p>\n<p>“Posture, build, glasses, the way you walk,” Wade says carelessly, as if that alone isn’t impressive. “But I wanted to know your name, so — well, I stole this. Yesterday.”</p>\n<p>Wade releases Peter with one hand and holds out the keycard he uses to enter the lab. Peter thought he left it at home today.</p>\n<p>“What,” he breathes, accepting the keycard.</p>\n<p>Yesterday. Wade was close enough to him <em>yesterday</em> to pick-pocket him. And Peter didn’t see him, hear him, or feel him. He didn’t even notice him.</p>\n<p>Wade bounces on the heels of his feet, squeezing Peter’s sides again. “Can I see your apartment now?” he asks. “I’m so curious I could die.”</p>\n<p>Peter laughs. His head pitches forward and Wade’s standing close enough that Peter’s face just bonks into Wade’s chest. He isn’t freaked out, he’s just impressed. Wade is scarily impressive.</p>\n<p>“Yeah,” Peter says, shaking his head in disbelief. “Come on.”</p>\n<p>Wade follows him like an excited puppy the entire way to Peter’s apartment. He bounds up the endless stares, chattering a million miles a minute (<em>—and I knew you didn’t even notice me, Petey, I knew it!</em>) and then he examines every inch of Peter’s apartment the second he gets inside.</p>\n<p>He rifles through drawers, tests Peter’s couch, peeks into the bathroom, and collapses on Peter’s bed. “Where do you hide the suit?” he asks, and before Peter can answer: “Wait! Don’t tell me, I wanna see if I can guess.”</p>\n<p>Once he’s done exploring the apartment, he’s back to exploring Peter. He grabs his arm and squeals at the freckle just above the inside of his elbow. He flips the tag out from Peter’s shirt at the back of his neck — “Totally guessed you were a medium” — and he buries a gloved hand in Peter’s hair, apparently unable to help it.</p>\n<p>Peter just lets it happen, embarrassed and endeared and a little bit loving the attention all at once.</p>\n<p>When Wade finally settles down, he sits on Peter’s couch and opens a food delivery app. Apparently, he already has Peter’s address memorized just by walking inside his apartment.</p>\n<p>Peter doesn’t know why he says it. Maybe all the excitement got to him. But when he sits next to Wade on the couch, he’s feeling bold.</p>\n<p>“Is there anything else you know about me?” he asks.</p>\n<p>“Probably,” Wade says, distracted. “Dunno off the top of my head.”</p>\n<p>Peter sinks into the couch, letting the cheap cushions and horrible springs drag him toward the dip Wade’s created by sitting on it.</p>\n<p>“Okay,” he says simply.</p>\n<p>Wade clicks the order button. Then he cocks his head. “Wait. Why?”</p>\n<p>“No reason.”</p>\n<p>“Is it something specific?”</p>\n<p>“A little,” Peter says. “But if you don’t know, you don’t know.”</p>\n<p>Wade starts bouncing his knee. He doesn’t like being left out. “What is it?” he demands.</p>\n<p>Peter shrugs. “It’s a little personal.”</p>\n<p>Wade’s knee starts bouncing harder. “What is it, Pete?” he says. A little thrill shoots through Peter. He likes hearing his name in Wade’s voice. Really likes it.</p>\n<p>“Guess you’ll have to figure it out on your own,” Peter says.</p>\n<p>Wade whines, both of his knees bouncing now. But he doesn’t argue. He doesn’t press for information. He just falls silent, probably thinking hard.</p>\n<p>The food Wade ordered shows up a little while later and they eat together, chatting idly, but Peter can tell Wade’s mind isn’t fully on the conversation. Afterward, Peter changes and they leave through the window to patrol, but Wade is similarly distracted the whole night. Peter feels a little bad for teasing him like this, but he also isn’t feeling quite brave enough to just announce it, either.</p>\n<p>\n<em>I like you. Like. A lot.</em>\n</p>\n<p>They part ways at the end of the night and Peter falls asleep with a grin, wondering if Wade will figure it out.</p>\n<p>—</p>\n<p>It’s the sound of the window sliding open that wakes him up.</p>\n<p>Peter’s eyes snap open, landing on his alarm clock, which informs him that it’s almost three in the morning. He stiffens for half a second, panicking, before he recognizes the creak of leather and Kevlar. <em>Wade</em>.</p>\n<p>The bed bounces as Wade collapses into it, having crawled through the wrong window.</p>\n<p>“Pete,” Wade whispers. “Hey. Petey.”</p>\n<p>“Wade,” Peter murmurs, his voice rough with sleep. Wade groans, probably from the sound of Peter’s voice. Maybe because of Peter saying his name. He doesn’t say it very often, for reasons he’s still not entirely sure about. Maybe it’s because he thought of him as <em>Deadpool</em> for so long that it felt weird to start calling him by his name. Maybe it’s because it didn’t seem fair, somehow, to call him Wade when he had no idea what Peter’s name was. Or maybe he was afraid that all his feelings would be readily apparent if he uttered that single syllable.</p>\n<p>“Sorry for waking you up,” Wade says, still whispering. He scoots closer, wrapping an arm around Peter and pulling him backwards, so that Peter is pressed against the hard line of his body. Peter pretends that his face isn’t on fire.</p>\n<p>“S’okay,” he says. “What’s up?”</p>\n<p>“Do you like me?” Wade says. His voice is different. Hesitant. Peter realizes that Wade’s entire body is stiff.</p>\n<p>“I don’t know,” Peter hedges. “Do I?”</p>\n<p>Wade groans. “Please throw me a bone here, Webs,” he says. “I don’t know. I could never tell. It’s what I <em>want</em>, so of course— I mean— anything I noticed, I probably made up. Or I was just seeing it the way I wanted to see it. You know?”</p>\n<p>Peter slips his hand into Wade’s, intertwining their fingers, so that both of their hands are resting on Peter’s stomach. “Yes,” Peter whispers. “I like you. Really, really like you.”</p>\n<p>Wade yanks Peter by the hand and Peter rolls over with a squeak, facing Wade now. “And I have for years,” Peter adds.</p>\n<p>“Fuck,” Wade breathes. “I’m so happy right now. Shit.”</p>\n<p>Peter laughs. He scoots closer and wiggles one of his legs between Wade’s, just wanting to be nearer to him. Touching more. Wade squeezes him even tighter.</p>\n<p>“I really want to kiss you,” Wade says.</p>\n<p>Peter reaches up and pushes Wade’s mask over his nose. Then he presses closer and slots their lips together, relaxing into Wade as he fists his hand in the back of Peter’s shirt and holds him even tighter. Wade groans, chasing after Peter’s mouth and extending the length of their kiss two different times when Peter goes to pull away. It only stops because Peter holds him back and bursts out laughing.</p>\n<p>“I’m trying to talk to you!”</p>\n<p>“We talk all the time,” Wade says, grabbing Peter’s hand and pressing a kiss against his palm, then the inside of his wrist. “We can talk later. Right now, I wanna find out what your molars taste like.”</p>\n<p>Peter wheezes, helplessly trying to hold Wade off as he stubbornly rolls closer. “Wade!” he gasps, giggling as, somehow, it turns into a wrestling session. If wrestling included your opponent trying to kiss every inch of your bare skin.</p>\n<p>“Love that,” Wade growls. “Why don’t you say my name more often, baby boy?”</p>\n<p>“Don’t know,” Peter says. Wade finally succeeds in pinning Peter’s wrists above his head and then they’re kissing again. Wade makes good on his promise to explore Peter’s mouth and Peter stops trying to have a conversation with him, giving in to the impromptu make out session.</p>\n<p>It’s all kinds of kissing. Fast and hard. Soft and slow. Peter doesn’t know how long it’s been by the time they finally stop, but he’s laying on top of Wade and Wade’s hands are on his butt and he swears his lips are swollen from kissing.</p>\n<p>They fall asleep like that, completely on accident and in the middle of a conversation, to boot, but neither of them wanted to stop talking. They stay tangled together all night, and when Peter wakes up, his first thought will be something along the lines of amazement, grateful that Wade is as observant as he is.</p>"
}