{
  "id": "38691078",
  "url": "https://archiveofourown.org/works/38691078?view_full_work=true",
  "author": [
    "Ferret_in_a_Lake"
  ],
  "title": "And thus, we live",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku & Shigaraki Tomura | Shimura Tenko"
  ],
  "characters": [
    "Shigaraki Tomura | Shimura Tenko",
    "Midoriya Izuku",
    "League of Villains (My Hero Academia)",
    "Aizawa Shouta | Eraserhead",
    "Eri (My Hero Academia)",
    "Nezu",
    "Bakugou Katsuki",
    "Hatsume Mei",
    "Kurogiri (My Hero Academia)"
  ],
  "additional_tags": [
    "Crack Treated Seriously",
    "Morally Ambiguous Midoriya Izuku",
    "Vigilante Midoriya Izuku",
    "Quirkless Midoriya Izuku",
    "Quirkless Shigaraki Tomura | Shimura Tenko",
    "Protective Shigaraki Tomura | Shimura Tenko",
    "Midoriya Izuku Does Not Have One for All Quirk",
    "anymore",
    "Major character death - Freeform",
    "MCD tag is about future Izuku and Tomura",
    "Sleep Deprived Midoriya Izuku",
    "he is running on less sleep than aizawa at this point",
    "Midoriya Izuku & Shigaraki Tomura | Shimura Tenko Are Siblings",
    "Sensei | All For One is Midoriya Izuku's Parent",
    "Sensei | All For One is Midoriya Hisashi",
    "All for one is having a Bad Time in the background",
    "Midoriya Izuku Has No Chill",
    "Hurt/Comfort",
    "Time Travel",
    "Time Travel Fix-It",
    "Shigaraki Tomura | Shimura Tenko is Not a Villain",
    "Yagi Toshinori | All Might Bashing",
    "just a little",
    "BAMF Midoriya Izuku",
    "Smart Midoriya Izuku",
    "Scary Midoriya Izuku",
    "Tired Midoriya Izuku",
    "League of Villains as Family (My Hero Academia)",
    "Strong Midoriya Izuku",
    "The Amazing Domestication of One Shigaraki Tomura",
    "The Amazing Bastardization of One Midoriya Izuku",
    "Midoriya Izuku is in the League Of Villains",
    "But also not",
    "Shigaraki Gets a Redemption Arc",
    "and Izuku gets a villain arc",
    "neither of them gives a fuck but Izuku gives even less fucks than tenko",
    "Midoriya Izuku-centric",
    "Shigaraki Tomura | Shimura Tenko-centric",
    "Protective Midoriya Izuku",
    "Rated teen for swearing",
    "and some violence",
    "but not much and not very depicted",
    "Enemies to Friends",
    "Quirkless People with Extra Toe Joints Wear Custom Sneakers | Red Shoe Theory (My Hero Academia)",
    "snapshots of life style",
    "the sports festival part is directly inspired by",
    "One Shot Wok by AMournfulHowlInTheNight",
    "and it shows",
    "it's a very good fic everyone should read it"
  ],
  "language": "English",
  "series": "",
  "published": "2022-04-30",
  "completed": null,
  "words": "19,769",
  "chapters": "1/1",
  "comments": "579",
  "kudos": "19,919",
  "bookmarks": "5,117",
  "hits": "112,978",
  "summary": "<p>“That reminds me,” Izuku said, finally looking up from that notebook he was always writing on. “Did you ever figure out which one of your quirks brought us here?”</p>\n<p>Tenko blinked. “Which one of my…?”</p>\n<p>Izuku looked at him weird, “There was no one nearby when we died in the future, so it had to have been you, no?”</p>\n<p> </p>\n<p>AKA, Tomura and Izuku kill each other, get reborn as twins, and proceed to make it everyone else's problem.</p>\n<p> </p>\n<p>\n<a href=\"https://ficbook.net/readfic/13133237\" rel=\"nofollow\">Now with a Russian translation!</a>\n</p>",
  "notes": "<p>This fic got out of hand so badly. I don't even know when it became so long but it sure happened, so. That.</p>\n<p>This is basically Izuku progressively giving less of a fuck as he forces the world to Get Better while Tenko slowly becomes the one with the Common Sense out of the two.</p>\n<p>Please let me know if you think I should add any Trigger Warnings here!</p>\n<p>(Also, if somebody could tell me if this is Screen Reader friendly or not I'd be really grateful, 'cause my screen reader isn't reading the numbers)(Edit: nvm)</p>\n<p>And just in case it's not clear: Yūrei means Ghost in Japanese.</p>\n<p>Enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>(Edit: changed \"dick move\" to \"power move\" bc that's what I actually meant to write originally.)<br>(Edit 31/12/2022: Finally got around to rewriting all the section numbers because my and other screen readers keep completely ignoring the lists. So sorry about the eight month delay lol, my bad. Also, happy new years everybody.)</p>\n<p>Thanks for reading! ♥</p>",
  "text": "<p align=\"justify\">1.</p>\n<p align=\"justify\">During a rainy day in the middle of July, the Midoriya family was blessed with a pair of healthy twin boys.</p>\n<p align=\"justify\">Born four minutes apart, their only differential features were their eye color, with the eldest inheriting the deep red eyes of their father and the youngest the bright green eyes of their mother.</p>\n<p align=\"justify\">They were given the names Tenko and Izuku.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">2.</p>\n<p align=\"justify\">Izuku found how determined Shigaraki was to glare at him every time he was within the other’s line of sight, as if trying to convey <em>‘I don’t know how but this is somehow your fault’</em> with his gaze alone, to be quite impressive.</p>\n<p align=\"justify\">He didn’t find it <em>surprising</em> though. Izuku didn’t think there was much that could surprise him anymore after being reborn as a baby with the guy who killed him as his twin. Hell, he even understood the sentiment behind the sharp looks— <em>Izuku </em>was stuck like this too after all. He knew it wasn’t fun.</p>\n<p align=\"justify\">Even so, he was beginning to wonder when Shigaraki, or Tenko now, would finally accept their situation and stop throwing toys in Izuku’s direction.</p>\n<p align=\"justify\">It’d been five months already.</p>\n<p align=\"justify\">He hoped it happened before their teeth came in.</p>\n<p align=\"justify\">(Sometime later, Izuku would stare at the single-tooth bite mark embedded in his arm and sigh. This was going to be one long childhood.)</p>\n<p align=\"justify\"> </p>\n<p>3.</p>\n<p align=\"justify\"><em>You’re kidding me,</em> Tomura thought, staring with wide eyes at the man who mother had said was their father. He didn’t even have the mind to glare as they were picked up and set comfortably in the man’s arms.</p>\n<p align=\"justify\">Instead, he blankly watched a tiny hand that wasn’t his own reach out and tug on the man’s hair insistently, its owner babbling angrily.</p>\n<p align=\"justify\">All For One just chuckled amused and pressed kisses on top of both of their heads.</p>\n<p align=\"justify\"><em>This is a fucking nightmare, none of this is real,</em> Tomura decided, closing his eyes and resolutely pretending he couldn’t hear the disgustingly gentle and adoring voice next to his ear or mother’s soft laughter in the background or the hero brat’s weak attempts at punching the lord of the underground in the face.</p>\n<p align=\"justify\"> </p>\n<p>4.</p>\n<p align=\"justify\">The two toddlers wrestling in their room yet again stopped to breathe.</p>\n<p align=\"justify\">Izuku, who had been peacefully playing with an All Might doll before the other came and broke it, snarled at Tenko before a thought occurred to him and he grinned.</p>\n<p align=\"justify\">Tenko watched with an iffy expression as Izuku, who had long since learned how to cry at will, slapped his own cheek hard and burst into tears. Loudly.</p>\n<p align=\"justify\">Their mother immediately hurried over at the sound and picked him up. As expected, her eyes were staring at the red mark on his face, hand-shaped and toddler-sized.</p>\n<p align=\"justify\">“Oh my. What happened, Izuku?”</p>\n<p align=\"justify\">He sniffled and pointed at Tenko, who had his face scrunched up in confusion.</p>\n<p align=\"justify\">Tenko didn’t even have time to defend himself before mom’s disappointed eyes fell on him and he was being scolded.</p>\n<p align=\"justify\">When mom finally left, Izuku found himself being the receiver of the harshest glare a toddler could ever give. He just grinned in response and dodged the broken toy thrown his way.</p>\n<p align=\"justify\"> </p>\n<p>5.</p>\n<p align=\"justify\">Their relationship would continue to be like this all the way to preschool, much to their poor teacher’s bewilderment, who just couldn’t figure out why these twins hated each other so much.</p>\n<p align=\"justify\">At least they seemed to behave properly when their mom was in sight.</p>\n<p align=\"justify\"> </p>\n<p>6.</p>\n<p align=\"justify\">Izuku could tell the exact moment Tenko realized who the loud kid on the other side of the room was by the wide, mildly unsettling grin that took form on the face that was much too similar to his own.</p>\n<p align=\"justify\">He debated whether to stop him or not, but then remembered that neither of them had quirks right now and simply decided to watch the show instead.</p>\n<p align=\"justify\">Tenko seemed to have forgotten that when you’re a toddler, no matter how much more experience you had from a past life, three months made quite the difference physically.</p>\n<p align=\"justify\">And Bakugou Katsuki had never been one to hold himself back.</p>\n<p align=\"justify\"> </p>\n<p>7.</p>\n<p align=\"justify\">“You shouldn’t start fights, Tenko-kun!” scolded the preschool teacher once he separated the two vicious toddlers, hauling Tenko to a corner of the room. “Time out corner for you.”</p>\n<p align=\"justify\">While she checked Katsuki for injuries, even though he wasn’t the one losing that wrestling match, another teacher came up to Tenko and started lecturing him on how to get along with others.</p>\n<p align=\"justify\">Izuku knew Tenko could see him snickering from behind the teacher, as proved when the other flipped him off without thinking, cue another lecture from their teacher about respect.</p>\n<p align=\"justify\">Izuku grinned even wider from the other side of the room.</p>\n<p align=\"justify\"> </p>\n<p>8.</p>\n<p align=\"justify\">“I’ve decided you two are cool enough to hang out with me!” that Bakugou brat declared, grinning widely at the pair in front of him.</p>\n<p align=\"justify\">“Don’t care. Get lost,” snapped Tenko at the same time Izuku chirped, “That’s awesome, Kacchan.”</p>\n<p align=\"justify\">Bakugou blinked at them, looking like he was trying to figure out whom to reply to first.</p>\n<p align=\"justify\">“Hey! You can’t just say no!” he ended up shouting, and Tenko just shrugged uninterested.</p>\n<p align=\"justify\"><em>Watch me,</em> is what he opened his mouth to say, but then he caught sight of a deceptively nice smile accompanied by a pair of calculatingly cold green eyes.</p>\n<p align=\"justify\">“Mom said we should make friends, nii-chan. You don’t want to make her sad, right?”</p>\n<p align=\"justify\">And that’s how Tenko, once Grand Commander of the Paranormal Liberation Front, ended up being roped into hanging out with a bunch of annoying children— under the threat of disappointing Midoriya Inko.</p>\n<p align=\"justify\">It was a surprisingly effective threat.</p>\n<p align=\"justify\">(Much like <em>disappointing Kurogiri</em> had been when he was actually this age.)</p>\n<p> </p>\n<p>9.</p>\n<p align=\"justify\">Tenko stared at his new shoes with a frown.</p>\n<p align=\"justify\">He knew these shoes. Had owned this same type for as long as he could remember. He’d worn them as Shimura Tenko, and later on as Shigaraki Tomura, and now again as Midoriya Tenko. His feet forever uncomfortable wearing any other design, so he’d gotten used to the obnoxiously bright red color that went well with literally no outfit in existence.</p>\n<p align=\"justify\">By his side, Izuku had an odd look in his eye as he expertly tied the green shoelaces in a neat bow.</p>\n<p align=\"justify\">Mother had had an almost nervous air around her as she gave them each a pair, informing them that they’d be visiting a quirk doctor later that week to see why their quirks were late.</p>\n<p align=\"justify\">(The sentence sounded kind of familiar, now that he thought about it.)</p>\n<p align=\"justify\">He stopped himself from scratching his neck by focusing on tying his own shoelaces, baby blue in color, and refusing to think too hard about all this. The shoes must just be really good and cheap or something.</p>\n<p align=\"justify\">They fit perfectly, why would he question it?</p>\n<p align=\"justify\"> </p>\n<p>10.</p>\n<p align=\"justify\">“I’m so sorry, Izuku, Tenko! I’m sorry!”</p>\n<p align=\"justify\">Tenko stood awkwardly in mother’s embrace, unconsciously scratching his temple as he listened to this woman, who he’d come to like and respect, cry apologies.</p>\n<p align=\"justify\">Feeling at a loss, he looked towards Izuku, expecting to see him in the same position as him, but instead finding a sorrowful smile and understanding eyes. An incredibly jarring sight when coupled with the childish face of a four-year-old.</p>\n<p align=\"justify\">“It’s okay, mom,” Izuku whispered, placing a hand on mother’s cheek.</p>\n<p align=\"justify\">He looked like he had expected this. Maybe he had. Tenko didn’t know anything about Izuku’s backstory, had never cared to know before. It made him wonder if Izuku had been in this position before, having to listen to this unbelievably kind woman break down because of something outside of her control.</p>\n<p align=\"justify\">He wondered how Izuku had reacted back then, when he was an actual four-year-old hearing such a damning diagnosis.</p>\n<p align=\"justify\">“We’ll be fine even if we don’t have quirks, mom.”</p>\n<p align=\"justify\">The words only seemed to make her cry harder.</p>\n<p align=\"justify\"> </p>\n<p>11.</p>\n<p align=\"justify\">“Hey brat.”</p>\n<p align=\"justify\">“Hm?”</p>\n<p align=\"justify\">“…do you think All For One did something to us?”</p>\n<p align=\"justify\">“What, like taking our quirks before we manifested them and have that doctor of his show mom fake radiographs?”</p>\n<p align=\"justify\">“Yeah.”</p>\n<p align=\"justify\">Izuku hummed thoughtful, then shrugged.</p>\n<p align=\"justify\">“He might have,” he replied simply. “Or maybe we were just born like this. We’re a second generation from his side of the family. It’s plausible.”</p>\n<p align=\"justify\">Tenko frowned, considering it.</p>\n<p align=\"justify\">“That reminds me,” Izuku added, finally looking up from that notebook he was always writing on. “Did you ever figure out which one of your quirks brought us here?”</p>\n<p align=\"justify\">“Which one of my…?”</p>\n<p align=\"justify\">Izuku looked at him weird, “There was no one nearby when we died in the future, so it had to have been you, no?”</p>\n<p align=\"justify\">Tenko racked his brain, trying to recall their final fight. Whether it was a side effect of the reincarnation or due to the quirk overuse he’d been suffering back then, he couldn’t remember much from that time anymore.</p>\n<p align=\"justify\">The image of the hero’s bloodied body by the end was still quite clear, but aside from that, the rest of that day —of that week, of that <em>month</em> really— was no more than a blur.</p>\n<p align=\"justify\">But he did have to agree that he’d had many quirks at his disposal at that time and that he only knew what some of them did for sure. The idea wasn’t completely unfounded.</p>\n<p align=\"justify\">Izuku’s green eyes fell on him then, giving the impression that they were looking at his very soul. Tenko resisted the urge to scratch his neck.</p>\n<p align=\"justify\">“You didn’t notice,” Izuku said incredulous. It wasn’t a question. Then, he sighed, “Oh well. I guess it doesn’t matter much now.”</p>\n<p align=\"justify\">Tenko nodded absently, and that was the end of that.</p>\n<p align=\"justify\"> </p>\n<p>12.</p>\n<p align=\"justify\">Tenko was sure he would start killing people if he noticed one more NPC looking at him with pity. As it was, he settled for scratching his arm as a distraction.</p>\n<p align=\"justify\">He wasn’t stupid, he knew that being quirkless in this society that adored quirks over everything else was bound to be difficult— mother’s reaction was more than enough confirmation of this. But he wasn’t expecting it to be this bad, especially since he was only four years old physically.</p>\n<p align=\"justify\">The brats who always looked at him in fear of pissing him off were suddenly looking at him like he was something to be pitied, like he was somehow weaker than them even though many of them had completely useless quirks like the ability to change eye color or grow their hair a little faster than normal.</p>\n<p align=\"justify\">The worst though, in his opinion, were the whispers among the adults when they thought he was too far away to hear.</p>\n<p align=\"justify\">God, how he missed having Decay.</p>\n<p align=\"justify\">(But that was the problem, wasn’t it? That he didn’t have that ability. That he didn’t have <em>anything</em> at all anymore. Just a pair of red shoes and a drawer full of laces of all colors.)</p>\n<p align=\"justify\">(Izuku had explained to him, oblivious to the growing dread inside Tenko, that the laces on this type of shoes had meanings for quirkless people. At least, some colors did. Black meant doing good and willing to help, grey meant they were managing, and white was practically a cry for help, sticking out like a sore thumb in the already eye-catching red.)</p>\n<p align=\"justify\">(Izuku always wore black, the little hero.)</p>\n<p align=\"justify\">A hand on his snapped him out of his thoughts and forced his scratching to stop, leaving the skin of his arm red and irritated. He turned around to see green eyes framed by a disgustingly kind expression.</p>\n<p align=\"justify\">Izuku seemed unaffected by the looks and whispers, seemed used to this kind of treatment already. It made Tenko wonder if that’s how his life was going to be from now on, pretending to not hear the insults or see the pitiful glances directed his way anywhere he went the moment they saw his stupidly bright red shoes.</p>\n<p align=\"justify\">It made him wonder how Izuku ever managed to become the hero brat he’d met in the future if everyone only acted like this around him up until he got All Might’s quirk. Tenko would’ve gone crazy and attacked someone within a couple years for sure.</p>\n<p align=\"justify\">“What?” he grumbled, shaking off the hand the same way he shook off those thoughts.</p>\n<p align=\"justify\">Izuku didn’t even blink, of course he didn’t, and instead simply pointed somewhere behind him with a smile that somehow felt too real and too fake at the same time. Izuku was far too good of an actor, he’d found.</p>\n<p align=\"justify\">“Wanna play in the bars, nii-chan?”</p>\n<p align=\"justify\">Tenko frowned out of habit, but soon nodded.</p>\n<p align=\"justify\">Not like he had anything better to do anyways, and mother would get sad if he got into another fight.</p>\n<p align=\"justify\">(He tried to not make mother sad anymore. He’d seen the look in her eyes when she saw his scuffed clothes the other day when she picked them up from preschool. He’d much rather she just scolded him like she used to than seeing that annoying expression again.)</p>\n<p align=\"justify\"> </p>\n<p>13.</p>\n<p align=\"justify\">“Shut up, you crybaby! You’re just a useless <em>Deku!”</em></p>\n<p align=\"justify\">Tenko froze in his tracks, slowly turning around to look at where Izuku and that Bakugou brat were standing by the other side of the playground.</p>\n<p align=\"justify\">Izuku was frowning but he didn’t look all that bothered overall, which only made him all the more confused.</p>\n<p align=\"justify\">“That’s mean, Kacchan,” he answered simply, like nothing was wrong at all. Like everything made sense when it was far from that in Tenko’s mind.</p>\n<p align=\"justify\">\n<em>What the fuck— wasn’t Deku his hero name— why would he choose a literal insult as his hero name— why the hell would he ever want to be known by that name— why why <strong>why—</strong></em>\n</p>\n<p align=\"justify\">But for some reason, Tenko, whose number of questions only grew with each second that passed, couldn’t bring himself to voice any of them right now.</p>\n<p align=\"justify\">“Shut up, you stupid Deku!”</p>\n<p align=\"justify\">Tenko had no recollection of how he got there, but one moment he was on one side of the playground, staring at the smoke coming from that Bakugou brat’s fist, watching as it connected with his brother’s face— and the next Bakugou was under him and explosions were going off in his face as someone shouted and hands were <em>grabbing him from behind—</em></p>\n<p align=\"justify\">The world blurred.</p>\n<p align=\"justify\"> </p>\n<p>14.</p>\n<p align=\"justify\">“You shouldn’t have done that.”</p>\n<p align=\"justify\">Izuku’s voice was quiet, barely louder than a whisper, as he examined Tenko’s bruised knuckles. He sounded tired, and Tenko found it infuriating that he couldn’t see his face from here.</p>\n<p align=\"justify\">They were sitting side by side in the empty hallway outside the director’s office, waiting for their mother to come pick them up, the blonde brat having already been sent home some time ago.</p>\n<p align=\"justify\">“Seriously, Tenko. He’s five,” Izuku insisted when he didn’t say anything.</p>\n<p align=\"justify\">“Why was your hero name Deku?” Tenko asked instead of replying. He couldn’t stop thinking about it. Why would Izuku ever choose that as his hero name? Even with the limited understanding Tenko had of Izuku’s past life, it made no sense for him to do that.</p>\n<p align=\"justify\">Izuku didn’t answer immediately, but if there was something Tenko had learned in the past five years, it was to be patient.</p>\n<p align=\"justify\">(Kurogiri would be proud, it suddenly occurred to him.)</p>\n<p align=\"justify\">“Someone said it sounded like <em>dekiru</em> and I liked it.”</p>\n<p align=\"justify\">Tenko frowned.</p>\n<p align=\"justify\">“That’s dumb.”</p>\n<p align=\"justify\">“Maybe,” Izuku allowed.</p>\n<p align=\"justify\">He still didn’t get it, didn’t get why Izuku would choose an insult as his name even if someone redefined its meaning, didn’t get how something like that could ever make the word Deku, <em>useless,</em> sound any better in his ears.</p>\n<p align=\"justify\">He didn’t get it at all.</p>\n<p align=\"justify\">He didn’t ask though.</p>\n<p align=\"justify\">“Mom’s gonna be so worried,” Izuku commented randomly, when the silence stretched for too long.</p>\n<p align=\"justify\">“Do you think I’ll get punished?” he asked, belatedly realizing he’d never been actually punished in his past life. Kurogiri used to scold him, obviously, but as Tomura he’d been given a lot of leeway.</p>\n<p align=\"justify\">(All For One used to punish him, when expectations weren’t met or Tomura happened to be too annoying and he was in a cruel mood. Looking back now however, Sensei’s parenting style and subsequent punishing methods were not something he’d expect from a normal, decent parent like Midoriya Inko.</p>\n<p align=\"justify\">The realization was… enlightening. To an uncomfortable level.)</p>\n<p align=\"justify\">“Dunno,” Izuku hummed noncommittally. “She let me get away with a lot after the diagnosis the first time around, but I never got into a fist fight with anybody. Not this young anyways.”</p>\n<p align=\"justify\">Tenko raised an eyebrow at him, “But you did later?”</p>\n<p align=\"justify\">“Someone had to stand up to Kacchan,” Izuku shrugged, like it was to be expected. Maybe it was, from his perspective. Heroic vision and all that. “They were less like fights and more like beatings though.”</p>\n<p align=\"justify\">Tenko frowned again, not sure how to answer that, but a worried voice calling their names saved him from having to think of a response and the conversation was dropped in favor of reassuring their mother that they were, in fact, just fine and that she didn’t need to worry and <em>yes we’re really okay mother please stop crying…</em></p>\n<p align=\"justify\"> </p>\n<p>15.</p>\n<p align=\"justify\">When Tenko and Izuku went back to class on Monday, Bakugou was already there, playing with some other brats. His face was obscured by All Might band aids and one of his eyes had a dark bruise under it.</p>\n<p align=\"justify\">Bakugou spotted them and flinched, much to Tenko’s satisfaction.</p>\n<p align=\"justify\">His injuries wouldn’t even leave a scar yet the brat had been wailing like crazy when his parent showed up to pick him up. It’d been extremely annoying to hear.</p>\n<p align=\"justify\">Tenko’s injuries were worse than his, anyhow, since he received the brunt of his explosions and kicks —as weak as they were at this age— and he was also covered in yellow band aids, but you didn’t see <em>him</em> complaining.</p>\n<p align=\"justify\">By his side, Izuku sighed.</p>\n<p align=\"justify\">Tenko paid him no mind.</p>\n<p align=\"justify\"> </p>\n<p>16.</p>\n<p align=\"justify\">It took exactly three weeks for Bakugou to try to bully Izuku again.</p>\n<p align=\"justify\">Tenko found the fact that his twin didn’t seem at all surprised by this development to be more upsetting than the blonde brat’s loud voice.</p>\n<p align=\"justify\">He didn’t get why he felt like this, though, which only helped to worsen his mood <em>and</em> the itching.</p>\n<p align=\"justify\"> </p>\n<p>17.</p>\n<p align=\"justify\">Their sixth birthday passed by much like how the previous one had, much like how all future ones would.</p>\n<p align=\"justify\">A small celebration with their mother, watching their favorite movies and eating their favorite foods.</p>\n<p align=\"justify\">A short call from a father they were grateful they never had to see.</p>\n<p align=\"justify\">A couple presents they opened and took pictures with when their mother asked.</p>\n<p align=\"justify\">Nothing too big, nothing too tiresome.</p>\n<p align=\"justify\">They enjoyed it all the same.</p>\n<p align=\"justify\"> </p>\n<p>18.</p>\n<p align=\"justify\">Elementary school was a new experience for him, one that absolutely sucked. In his first run, Tenko had been homeschooled by Kurogiri and trained by various villains who he was fairly sure had ended up as Nomu afterwards.</p>\n<p align=\"justify\">Point was, he never had to attend an actual school in his life before. And while preschool had also been a weird experience, it certainly hadn’t been anywhere near as bad as elementary.</p>\n<p align=\"justify\">But Tenko hadn’t been the leader of a large group of villains for nothing. It didn’t take him long to realize school sucked a lot less once he asserted his dominance.</p>\n<p align=\"justify\">Yes, people still talked shit about his quirklessness all the damn time, the fucking shoes obvious even to the most dense of kids, but at least no one dared to say something to his or Izuku’s faces anymore.</p>\n<p align=\"justify\">Bakugou Katsuki was an exception to the rule, of course, but that brat had been deemed a lost cause from the beginning and Tenko didn’t mind beating him up every now and again.</p>\n<p align=\"justify\"> </p>\n<p>19.</p>\n<p align=\"justify\">“If you hang another fucking All Might poster on the wall, I’m gonna punch you so hard your teeth will fall off.”</p>\n<p align=\"justify\">Izuku just stared him dead in the eye and slowly unrolled the All Might poster he’d sneakily bought earlier while Tenko wasn’t looking.</p>\n<p align=\"justify\">Tenko screeched in frustration and threw a pillow at him, then decided that wasn’t enough and threw himself at Izuku as well.</p>\n<p align=\"justify\"> </p>\n<p>20.</p>\n<p align=\"justify\">Izuku stared at Tenko’s side of the room in amazement. Hung on the wall, there was an honestly impressive poster of Eraserhead that Izuku knew for a fact wasn’t sold in any stores.</p>\n<p align=\"justify\">(God knows how long he and Shinsou spent searching for merchandise of their teacher only to end up commissioning an artist because there just <em>wasn’t any.)</em></p>\n<p align=\"justify\">“Wow… did you paint that yourself?”</p>\n<p align=\"justify\">Tenko was crossing his arms with a smug expression, but his face was clearly blushing. He was not exempt from the Midoriya genes, amusingly enough.</p>\n<p align=\"justify\">“What, you jealous of my skill level?”</p>\n<p align=\"justify\">Izuku just shook his head. He actually was a pretty decent artist himself, but he just didn’t bother painting like Tenko did and instead stuck mostly to sketches. It made sense for him to do that, though, since he mostly just drew to complement his analysis, be it about heroes, villains, or just random quirks he saw on the street.</p>\n<p align=\"justify\">Of course, he didn’t say that.</p>\n<p align=\"justify\">“I’m thinking that you could paint a mural in here that was a mix of both our interests, nii-chan.”</p>\n<p align=\"justify\">“I’m not painting fucking All Might,” came the immediate refusal.</p>\n<p align=\"justify\">Izuku had expected this, but he couldn’t say he wasn’t disappointed.</p>\n<p align=\"justify\"> </p>\n<p>21.</p>\n<p align=\"justify\">“Do you think there’s another you living somewhere with All For One right now?”</p>\n<p align=\"justify\">Tenko blinked, looked up from his homework, and proceeded to make a face that was three parts disturbed and one part absolutely fucking bewildered.</p>\n<p align=\"justify\">“…how the fuck should <em>I</em> know?”</p>\n<p align=\"justify\">Izuku just shrugged.</p>\n<p align=\"justify\">“Dunno. Doesn’t hurt to ask though.”</p>\n<p align=\"justify\">“It hurts my peace of mind.”</p>\n<p align=\"justify\">“How unfortunate.”</p>\n<p align=\"justify\"> </p>\n<p>22.</p>\n<p align=\"justify\">Their ninth birthday came and went, but there was a distinctive lack of a phone call from a certain someone.</p>\n<p align=\"justify\">A week later, their mother sat them down and explained that their father had been involved in a terrible accident and that he was still staying in America while he recovered.</p>\n<p align=\"justify\">Tenko and Izuku exchanged a glance, knowing full well that said ‘accident’ was in reality a fight to death against Japan’s number one hero.</p>\n<p align=\"justify\">Oh well, the fucker had it coming.</p>\n<p align=\"justify\"> </p>\n<p>23.</p>\n<p align=\"justify\"><em>“Oh hell no,”</em> Tenko hissed, eyes wide as he stared transfixed at his reflection in the bathroom mirror. If goddamned Toga suddenly crawled out from it covered in blood and tried to cut him open with a butter knife, he’d feel less horrified.</p>\n<p align=\"justify\">Not even bothering to dry his hair, he hastily threw on a hoodie and stormed out to the living room, where his mother and Izuku were chilling.</p>\n<p align=\"justify\">“Mother,” he called, tone more desperate than he intended but not entirely exaggerated given the circumstances. They turned to look at him in confusion. “We need to buy hair dye.”</p>\n<p align=\"justify\">His mother’s brow furrowed a little, but she didn’t immediately shoot him down, which was good because while he’d rather not go behind her back and earn that I’m-not-mad-just-disappointed look, not even All Might himself could stop him right now.</p>\n<p align=\"justify\">“And why is that?” she asked after a beat.</p>\n<p align=\"justify\">Foregoing words entirely, he shoved the top of his hair in their line of sight, pointing at the <em>goddamned white roots</em> that had started to appear. When he looked up again, Izuku was wincing sympathetically, a hand lightly touching his own (still fully green) hair as if in reassurance.</p>\n<p align=\"justify\">Mother, on the other hand, seemed awfully <em>delighted.</em> “Oh, just like your father!” she exclaimed, clapping her hands in front of her.</p>\n<p align=\"justify\">Izuku and Tenko cringed simultaneously, a reaction that went fully unnoticed by their mother.</p>\n<p align=\"justify\">“I don’t like it,” he said pointedly, bringing her out of whatever memory she was reliving. “I like dark hair better. Can I please dye it, mother?”</p>\n<p align=\"justify\">“But white would look so good on you, Tenko,” mother tried to reassure, the words managing to do anything but. “You even have your dad’s red eyes and freckles— you’d just look even more like him! You’d look very handsome!”</p>\n<p align=\"justify\">Tenko barely stopped the reflexive flinch. Locking eyes with Izuku, he abruptly realized he was currently ten years old and made the impulsive decision to <em>fucking act like it.</em></p>\n<p align=\"justify\">One tantrum the likes he hadn’t had since his pre-League days later, Tenko walked out of the bathroom sporting newly black hair and a wild grin. Izuku snorted and shot him a thumbs-up.</p>\n<p align=\"justify\"> </p>\n<p>24.</p>\n<p align=\"justify\">Tenko squinted suspiciously at Izuku, who had spent the last four and a half hours hyper-focused on something in his laptop.</p>\n<p align=\"justify\">“What’re you doing?” he found himself asking, when curiosity got the best of him.</p>\n<p align=\"justify\">Izuku didn’t even blink. “Getting my teacher fired.”</p>\n<p align=\"justify\">“Ah,” Tenko muttered, nodding, “Cool.”</p>\n<p align=\"justify\">He didn’t bother asking which one. Middle school started less than two weeks ago and Tenko had yet to learn any of his teachers’ names. Asking would make no difference to him.</p>\n<p align=\"justify\">“Want lemonade?” he offered instead, because he could always get behind some good ol’ life ruining. He <em>was</em> a villain, after all.</p>\n<p align=\"justify\">“That’d be great, thanks.”</p>\n<p align=\"justify\"> </p>\n<p>25.</p>\n<p align=\"justify\">“Are you going to become a hero again?”</p>\n<p align=\"justify\">Tenko really had to wonder how he’d never thought to ask before, considering he’s interacted with Izuku every day for the past almost-thirteen years but… Well, he supposed it didn’t matter since he was asking now.</p>\n<p align=\"justify\">Izuku didn’t look up from where he was stretching on the floor.</p>\n<p align=\"justify\">“I mean…” he started after he straightened up, pointedly gesturing between himself and the weapons and items he somehow managed to acquire for his new hobby. Tenko was sure he didn’t <em>buy</em> them, their allowance wasn’t large enough for him to have done that, but for the sake of the image of Izuku as the ‘good guy’ he had preserved in his mind, Tenko refused to question whether his twin stole them from somewhere or not.</p>\n<p align=\"justify\">It wasn’t because he was <em>scared</em> of Izuku, of course not. Tenko wasn’t scared of anything, much less of some hero brat with as much determination as All Might had fans and with an eerily similar gaze to—</p>\n<p align=\"justify\">Tenko wasn’t scared, full stop.</p>\n<p align=\"justify\">(His neck itched, but he stubbornly kept his hand where it was.)</p>\n<p align=\"justify\">“That’s kind of the plan, yeah,” Izuku finished deadpan.</p>\n<p align=\"justify\">“I don’t mean your vigilantism, moron,” Tenko rolled his eyes, pushing his many questions to the back of his mind. “I mean going to UA again.”</p>\n<p align=\"justify\">“I guess so?” At his raised eyebrow, Izuku elaborated, “I don’t have any other dreams or anything, so I might as well.”</p>\n<p align=\"justify\">He watched quietly as Izuku secured all his knifes around his surprisingly high-quality vigilante outfit, before asking another question.</p>\n<p align=\"justify\">“What about All Might’s quirk?”</p>\n<p align=\"justify\">Izuku hummed, “What about it?”</p>\n<p align=\"justify\">“Are you trying to get it back or…?”</p>\n<p align=\"justify\">That made his brother pause, staring back at Tenko with a pair of toxic green eyes that never got any less unnerving. Ah, there it was again, that little voice in the back of his mind whispering that they looked much too similar to a certain supervillain’s eyes even if the color was different.</p>\n<p align=\"justify\">Did Tenko’s eyes look like that too?</p>\n<p align=\"justify\">He pushed that thought out of his mind with the grace of someone who’d lived for years in complete and utter denial about most things related to his new <em>(and past) </em>life.</p>\n<p align=\"justify\">“I don’t know,” Izuku admitted after a beat. “If he offers, I’ll accept. But if he doesn’t then I’ll just become a quirkless hero this time.”</p>\n<p align=\"justify\">Tenko nodded, accepting the answer easily. It was a very Izuku-like answer.</p>\n<p align=\"justify\">“Being underground like Eraserhead has gotta be a lot better than being limelight too,” Tenko muttered to himself.</p>\n<p align=\"justify\">He was pulled back from his thoughts by Izuku’s teasing voice.</p>\n<p align=\"justify\">“We could even be the first ever quirkless hero duo, nii-chan. Think about it.”</p>\n<p align=\"justify\">He hoped his expression conveyed exactly how he felt about the idea, and Izuku laughed as he walked towards their bedroom window.</p>\n<p align=\"justify\">“Well then, I’ll be off,” he said cheerfully, securing the voice modulator around his neck and pulling up his black, veil-like mask.</p>\n<p align=\"justify\">“Get out of here already, dumbass.”</p>\n<p align=\"justify\">Tenko could hear his twin snickering even after he jumped out the window.</p>\n<p align=\"justify\"> </p>\n<p>26.</p>\n<p align=\"justify\">Shouta saw the small figure crouching down at the edge of the next roof over and immediately turned back around. This figure, he could tell, was the reason the pile of paperwork on Tsukauchi’s desk had suddenly increased in size in the past three weeks.</p>\n<p align=\"justify\">\n<em>Nope not me I’m not interacting with this guy nope—</em>\n</p>\n<p align=\"justify\">“Oh, hey Eraserhead!”</p>\n<p align=\"justify\">\n<em>Goddamn it.</em>\n</p>\n<p align=\"justify\"> </p>\n<p>27.</p>\n<p align=\"justify\">Much to Shouta’s dismay, the vigilante continued to hang out around him whenever they happened to run into each other.</p>\n<p align=\"justify\">At least Yūrei wasn’t too annoying and was actually competent in what he did. That was more than he could say about many of his coworkers.</p>\n<p align=\"justify\"> </p>\n<p>28.</p>\n<p align=\"justify\">For Eri, hope was green eyes and freckles.</p>\n<p align=\"justify\"> </p>\n<p>29.</p>\n<p align=\"justify\">“—police reports say that the attack took place during the early hours this morning, leaving no survivors. Police and heroes had been investigating this group known as the Shie Hassaikai for some time now, but it seems that someone beat them to their goal…”</p>\n<p align=\"justify\">Tenko tuned out the rest of the news and slowly turned to stare at the ‘someone’ that had somehow massacred Overhaul’s entire organization within a couple hours.</p>\n<p align=\"justify\">His twin blinked back at him, the picture of innocence.</p>\n<p align=\"justify\">“Izuku,” he said, then paused. He considered the best way to express the sentiment he wanted conveyed in as few words as possible and promptly decided to throw eloquence out the window. “What the actual <em>fuck.”</em></p>\n<p align=\"justify\">A frown took over Izuku’s face then.</p>\n<p align=\"justify\">“Watch your language around Eri.”</p>\n<p align=\"justify\">The toddler in question, who Izuku had just brought into the house that morning with some bullshit explanation, was currently talking with mother on the other room while they waited for social services to show up.</p>\n<p align=\"justify\">“We’re older brothers now,” Izuku continued, nodding sagely to reinforce his point. “We have to be good role models for her.”</p>\n<p align=\"justify\">Tenko pointedly didn’t mention that that was <em>not</em> confirmed. Izuku spoke like adopting that child into the family was the expected, no, the <em>only</em> possible outcome, and Tenko knew better than to try to convince him otherwise, especially with how sleep deprived he’d been since he started going out five nights of the week. It reminded him, vaguely, of Kurogiri telling him Dabi and Toga and the others were useful assets and that he should try to get along with them better.</p>\n<p align=\"justify\">Tenko shut that train of thought and scratched his arm absently.</p>\n<p align=\"justify\">Had Izuku always been this violent? Deku-the-hero had been the most ride-or-die person Tenko had ever met in either life, but he didn’t remember him being this inclined to murder?</p>\n<p align=\"justify\">Izuku abruptly snorted at what a reporter said, eyes alight with something that wasn’t quite <em>cruelty</em> but definitely resembled <em>vindictive</em> <em>gratification.</em></p>\n<p align=\"justify\">Well, Tenko thought mildly. He sure was now.</p>\n<p align=\"justify\">It was a little unsettling to think that Izuku, once considered the unofficial successor of the number one hero, was going through some kind of villain arc while Tenko, the guy who almost destroyed society once upon a time, hadn’t committed a single crime in over a decade.</p>\n<p align=\"justify\">Fuck, what had the world come to.</p>\n<p align=\"justify\"> </p>\n<p>30.</p>\n<p align=\"justify\">When Tenko heard his brother stumble into their room sometime past two in the morning, he didn’t even bother turning around. Izuku actually came back earlier than usual tonight, which was good because the guy could use some rest, but it wasn’t weird enough for Tenko to take his eyes from his work.</p>\n<p align=\"justify\">He had decided to try his hand at coding recently, partially to get started on game development and stuff and mostly as a way to kill time. Who knew going through childhood a second time would get so boring? No wonder Izuku had been so eager to re-start patrolling the moment he was strong enough to not get himself killed.</p>\n<p align=\"justify\">“So…” Izuku said after a beat, obnoxiously ignoring the do-not-talk-to-me-leave-me-alone-do-not-bother-me aura Tenko was projecting. “Good news and bad news.”</p>\n<p align=\"justify\">He sighed internally, flicking his eyes to the ceiling. He knew from experience that any attempts at ignoring Izuku would be futile.</p>\n<p align=\"justify\">“Well then? Spit it out already.”</p>\n<p align=\"justify\">“Right, so. Good news is that I’ve confirmed the existence of the other you.”</p>\n<p align=\"justify\">Tenko felt himself freeze at the words but Izuku barely gave him any time to process them before he continued.</p>\n<p align=\"justify\">“Bad news is I forgot just how unstable you used to be and got my arm disintegrated for it.”</p>\n<p align=\"justify\">\n<em>“You what.”</em>\n</p>\n<p align=\"justify\">He whipped around, finally taking in the sight of his dumbass brother nonchalantly leaning against the wall while blood poured out of his (thankfully still there) right arm and onto their bedroom floor.</p>\n<p align=\"justify\">Izuku had the gall to give him a sheepish smile.</p>\n<p align=\"justify\">“Mind getting the first aid kit for me, nii-chan? I lost mine on the way back.”</p>\n<p align=\"justify\">It was a testament to Tenko’s growth as a person that he didn’t immediately give in to his urge to strangle the absolute fucking<em> moron</em> in front of him.</p>\n<p align=\"justify\"> </p>\n<p>31.</p>\n<p align=\"justify\">“Oh god, how could you let this happen?! My babies…!”</p>\n<p align=\"justify\">Izuku winced, offering Mei an apologetic look.</p>\n<p align=\"justify\">Though, despite the question being directed at him, the girl paid him no mind as she examined her mostly disintegrated inventions. Shigaraki Tomura had done a number not only on Izuku himself, but also on the support items that he’d had Mei build for his vigilantism.</p>\n<p align=\"justify\">Izuku may be strong but he wasn’t stupid enough to fight villains empty handed, and since he had no experience building anything, he’d sought out the only person he knew that did and wouldn’t ask unwanted questions.</p>\n<p align=\"justify\">Newly-thirteen-years-old Hatsume Mei had been more than a little ecstatic to have a client too, but because Izuku didn’t have any money to his name, he’d instead offered a deal. He would clean out Dagobah beach and collect all useful materials for her to use for free as well as work as her beta tester, and in turn she would build any items he needed from now on.</p>\n<p align=\"justify\">And Mei, bless her, had accepted.</p>\n<p align=\"justify\">“Sorry, Mei-chan,” he apologized again.</p>\n<p align=\"justify\">She waved a hand, sighing.</p>\n<p align=\"justify\">“I don’t think I can repair these with how destroyed they are, Izu-kun,” she said. “If I’m gonna hafta build new ones from scratch, is there anything else you wanna add? Any upgrades in mind? Maybe I should reinforce everything so it lasts longer this time— oh but I don’t wanna restrict your mobility… hmm…”</p>\n<p align=\"justify\">Izuku nodded, internally relieved that she wasn’t mad at him, and moved closer to start planning with her. Mei truly was a great inventor and an even greater friend.</p>\n<p> </p>\n<p>32.</p>\n<p align=\"justify\">“It’s been <em>two months.</em> Where the hell have you been?”</p>\n<p align=\"justify\">Izuku blinked at Eraserhead’s glare. He’d be lying if he said he’d been expecting this kind of greeting after finally being free of his brother’s glares every time he so much as looked at his new vigilante outfit for too long.</p>\n<p align=\"justify\">The overprotectiveness wasn’t new but it still continued to baffle him after all these years.</p>\n<p align=\"justify\">“…were you worried?”</p>\n<p align=\"justify\">“Answer my question, Yūrei.”</p>\n<p align=\"justify\"><em>Definitely worried,</em> Izuku thought, offering an apologetic look to the person who was his teacher but also not.</p>\n<p align=\"justify\">“Sorry,” he said. “My equipment got damaged and took some time to repair.”</p>\n<p align=\"justify\">Eraserhead narrowed his eyes at him, but accepted the half-truth with only a warning to let him know next time he decided to go off the radar.</p>\n<p align=\"justify\">The hand-shaped scar on his upper arm itched, but Izuku ignored it.</p>\n<p align=\"justify\"> </p>\n<p>33.</p>\n<p align=\"justify\">Any villain worth their salt had heard about the new vigilante-slash-informant that showed up about a year ago and quickly made a name for themselves. ‘Yūrei’ was a name that inspired all sorts of emotions in people involved in Japan’s underworld, from fear, despair, and uneasiness, to hope, faith, and even relief.</p>\n<p align=\"justify\">And the person behind that name was someone known for their reliability and intelligence, for their ruthlessness and thoroughness. They were known for their extensive information network, for their overwhelming strength, and for their impressive track record in obliterating the lives or careers of any and all people they found to be… unacceptable, by their own standards.</p>\n<p align=\"justify\">(Nobody knew for sure what those standards were, but most could make an educated guess by now.)</p>\n<p align=\"justify\">In short, Yūrei was someone you didn’t want to piss off.</p>\n<p align=\"justify\">Dabi, of course, knew about all this and made a point of staying the fuck away from the guy, lest he ended up like that old Yakuza group from a couple months ago. And even if Dabi considered himself to be a pretty decent guy within the villain spectrum, he wasn’t about to risk it with Yūrei.</p>\n<p align=\"justify\">Not that his intentions seemed to matter at all now, considering he was in the middle of a stare-down with the one guy he’d been going out of his way to avoid. It was reminiscent of when prey noticed a predator about to pounce on them, and Dabi sure as fuck wasn’t the one in power here.</p>\n<p align=\"justify\">Yūrei was slight and far shorter than him, and most likely not fire proof, but their loose posture spoke volumes— it didn’t even cross their mind to be cowed as they stared him down from the other end of the alley, his only viable exit.</p>\n<p align=\"justify\">“You’re Dabi, correct?”</p>\n<p align=\"justify\"><em>Ah,</em> he thought intelligently, hoping it didn’t show on his face, <em>I’m fucked.</em></p>\n<p align=\"justify\"> </p>\n<p>34.</p>\n<p align=\"justify\">Sometime in the near future, Dabi would look back on that first meeting and wonder why he didn’t just use his quirk the moment he noticed the vigilante. It would’ve certainly saved him the trouble of dealing with Yūrei’s little group of freaks now, because apparently the guy had a hobby of picking up any and all strays he came across and kind of liked.</p>\n<p align=\"justify\">Dabi glanced around the building that apparently belonged to Yūrei even though the guy was like, eleven. There were people of all ages living here, but Dabi knew for a fact that they were all villains or runaways or outcasts in some way shape or form.</p>\n<p align=\"justify\">At least he wasn’t the one in charge of keeping them all alive. Silver linings and all that. No, that dubious honor was bestowed upon Mr. Compress and Magne, the poor bastards. They weren’t the <em>only</em> adults in the group, but they were the only two with at least <em>some</em> sense of responsibility and thus they became the designated Adults (with a capital A) in the Haunting— as Toga had dubbed the group.</p>\n<p align=\"justify\">Dabi felt sorry for them sometimes.</p>\n<p align=\"justify\">He imagined it couldn’t be easy to mediate between a bunch of enablers, a bunch of adults that acted like children, and a bunch of actual children, all of whom considered the law and general rules of socialization to be no more than a <em>very</em> loose guideline on how they should act.</p>\n<p align=\"justify\">(And, look, Dabi wasn’t afraid of them, he’d seen too much shit in his life to be scared of little kids, but that didn’t mean he wasn’t infinitely glad he wasn’t the one in charge of dissuading the Toga-Yūrei-Mustard trio from some of their wildest plans. Those children were weapons of mass destruction on a good day, and Dabi still wasn’t sure if them being barely middle school aged made it worse or not.)</p>\n<p align=\"justify\"> </p>\n<p>35.</p>\n<p align=\"justify\">When Tenko caught wind of Izuku’s little side project, he laughed so hard he fell off his bed and <em>still continued</em> <em>wheezing.</em> His twin stared at him with a smile that was equal parts amused and bemused and just barely managed to stay on this side of polite, but Tenko was too busy appreciating the brilliance of the whole situation to care.</p>\n<p align=\"justify\">“You…” Tenko wheezed, taking a couple minutes to calm his breathing. Fuck, he hadn’t laughed that hard in <em>years.</em> “You recruited all the people from the league before the other me could? You stole all his potential allies? <em>For real?”</em></p>\n<p align=\"justify\">Izuku’s expression was the personification of innocence, but behind it he was an Evil Genius through and through.</p>\n<p align=\"justify\">“Oh no, nii-chan,” Izuku’s smile widened ever-so-slightly. “I just gave some people in need a home, that’s all.”</p>\n<p align=\"justify\">\n<em>“Oh my god—”</em>\n</p>\n<p align=\"justify\"> </p>\n<p>36.</p>\n<p align=\"justify\">The first thing Tenko heard when he stepped into Izuku’s probably-illegally-acquired building was a loud groan followed by Dabi asking <em>“another one?”</em> in a long-suffering tone.</p>\n<p align=\"justify\">By his side, Izuku simply snickered and strolled towards where everyone was gathered. Tenko, who was wearing a simple surgical mask and had his hood up, followed suit as he looked around, keeping his hands in his pockets.</p>\n<p align=\"justify\">Izuku really had gathered everyone from the original League of Villains and some more. He avoided looking at Magne for too long, ignored the thought that there was someone important missing, and instead wondered who the brat in the middle school uniform was. He looked even younger than Toga.</p>\n<p align=\"justify\">“This is Dust,” Izuku introduced when he’d reached the front of the group, resting a hand on Tenko’s shoulder. The smile on his face, barely visible behind the veil, didn’t waver even as Tenko shrugged the hand off. “He’s my twin brother.”</p>\n<p align=\"justify\">There was a loud <em>CLANK</em> as a spoon fell on the floor. Spinner, the one who had been holding said spoon, had his mouth hanging open as he stared at Izuku. He wasn’t the only one, actually. With the exception of Dabi, who had his head in his hands, everyone else was looking between Tenko and his brother with wide eyes.</p>\n<p align=\"justify\">In the end, it was Dabi’s distraught voice that broke the silence.</p>\n<p align=\"justify\">“There were <em>two</em> of you?!”</p>\n<p align=\"justify\">Tenko had never heard Dabi —the snarky emo dude with the mysterious tragic backstory and zero fucks to give— sound like that, and he could only blink in confusion <em>(what the ever-loving </em>fuck<em> had his brother been doing to get such a reaction?)</em> while Izuku laughed.</p>\n<p align=\"justify\">“Well, you know the saying,” Izuku started, sounding way too amused, “All good things come in pairs, right?”</p>\n<p align=\"justify\">All in all, Tenko thought as the room spiraled into chaos and questions and whatnot, this was a far better first impression than the one they’d had in the original timeline.</p>\n<p align=\"justify\"> </p>\n<p>37.</p>\n<p align=\"justify\">“I’m just saying, what better place to meet him than at the USJ? We know he’s going to be there for sure.”</p>\n<p align=\"justify\">Tenko’s frown deepened as he offered Eri an apple slice.</p>\n<p align=\"justify\">“But becoming a hero? Why the f— why would I ever do that?”</p>\n<p align=\"justify\">Izuku gave him a look like he didn’t understand what the issue was.</p>\n<p align=\"justify\">“You can always change to another course after the USJ. UA has a coding specialization in the support department that you might like,” he said simply. “Or just drop out of UA completely. It’s not that hard.”</p>\n<p align=\"justify\">He narrowed his eyes at his twin, who only stared at him with a blank expression. There was a story somewhere in there for sure.</p>\n<p align=\"justify\">Though he had to admit that the support department didn’t sound as terrible as heroics, even if it was most likely heavily hero-oriented by virtue of being a hero school.</p>\n<p align=\"justify\">“Besides, you’d have Eraserhead as your homeroom teacher,” Izuku added, like the manipulating little shit he turned out to be.</p>\n<p align=\"justify\">By his side, Eri motioned for another slice and Tenko obliged.</p>\n<p align=\"justify\">“I’ll think about it,” he somewhat relented.</p>\n<p align=\"justify\"> </p>\n<p>38.</p>\n<p align=\"justify\">“Oh, Midoriya, you’re also taking UA’s entrance exam, right?”</p>\n<p align=\"justify\">Izuku snapped out of his sleep-deprived haze at his homeroom teacher’s question, looking up from where he had been staring blankly at his notebook since he sat down.</p>\n<p align=\"justify\">“Yes, sensei,” he confirmed, pushing down a yawn.</p>\n<p align=\"justify\">The class fell into an awkward silence after his simple, matter-of-fact answer. Katsuki was glaring at him from his seat, hands shaking from suppressed anger, which Izuku found weird but not necessarily in a bad way.</p>\n<p align=\"justify\">Ever since the rumors of Izuku getting his third homeroom teacher in a month fired during his first year in middle school had spread like wildfire, all teachers hesitated before being openly quirkist or letting other students get away with bullying when he was around.</p>\n<p align=\"justify\">It was a stark contrast from his original middle school experience. Probably helped also by the fact that Tenko was willing to and had already thrown hands with any bullies he found around the school on multiple occasions.</p>\n<p align=\"justify\">(And the guy said he wasn’t fit to be a hero.)</p>\n<p align=\"justify\">Of course, Katsuki’s record was still as clean as ever, but after the first warning from a teacher he’d backed off somewhat and only provoked Izuku outside of school and when Tenko wasn’t around.</p>\n<p align=\"justify\">Izuku was confident that this Katsuki was a much better person than the Katsuki from the original timeline at his age, even if he still had a long way to go. His childhood friend’s attitude was something he’d promised himself to try to change the moment he realized he was stuck in the past.</p>\n<p align=\"justify\">Feeling some satisfaction from the realization he’d achieved his goal, Izuku looked back down at the barely legible scribbles on his notebook and proceeded to ignore the odd atmosphere in his class.</p>\n<p align=\"justify\"> </p>\n<p>39.</p>\n<p align=\"justify\">\n<em>Number One Hero spotted in Musutafu: Sludge villain apprehended by All Might!</em>\n</p>\n<p align=\"justify\">The words went through Izuku’s head.</p>\n<p align=\"justify\">They went through again.</p>\n<p align=\"justify\">On the third attempt, he realized exactly what just happened and what it meant for him. <em>It was today,</em> he thought numbly, feeling his grip on the phone tighten without any conscious input.</p>\n<p align=\"justify\">\n<em>It was today.</em>\n</p>\n<p align=\"justify\">“Zu-nii?”</p>\n<p align=\"justify\">He blinked out of his head, belatedly noticing that Eri had grabbed his sleeve and was looking at him with wide, worried eyes. Glancing up, he noticed Tenko had stopped typing away and was also staring at him oddly.</p>\n<p align=\"justify\">Making use of two lifetimes worth of practice, Izuku pushed down the dread, relaxed his hands, and wiped any negative emotions out of his face before offering his sister a reassuring smile. He gently patted her hair and met his twin’s gaze evenly.</p>\n<p align=\"justify\">“I’ll be a quirkless hero after all,” was all he said, knowing the other would understand.</p>\n<p align=\"justify\">“Ah,” Tenko breathed out.</p>\n<p align=\"justify\">Eri looked between the two of them with a frown, but Izuku was quick to distract her (and himself too). This wasn’t something she needed to worry about.</p>\n<p align=\"justify\"> </p>\n<p>40.</p>\n<p align=\"justify\">Hitoshi stared wide-eyed between the weirdly cheerful guy who’d offered to train him and Dagobah beach, which had been anonymously cleaned out around two years ago.</p>\n<p align=\"justify\">“…that was <em>you?”</em></p>\n<p align=\"justify\">His voice came out slightly higher than he had intended, but he figured it was justified. The running theory behind the Dagobah beach mystery was that a group, meaning at least <em>ten</em> people, had restored the place to its former beauty in the span of six months a couple years ago, so excuse him for feeling a little doubtful about this random admission.</p>\n<p align=\"justify\">Midoriya had the gall to laugh too.</p>\n<p align=\"justify\">“I needed a way to gain muscle fast,” he said in lieu of an answer. “Moving trash around is a surprisingly effective method, if you know what you’re doing.”</p>\n<p align=\"justify\">Hitoshi glanced at the guy’s arms and torso, well-toned muscles noticeable even through the simple shirt he was wearing, and didn’t doubt the efficacy of such method.</p>\n<p align=\"justify\">“Anyhow,” Midoriya moved on. “This is where we’ll be training. I’ll meet you here every day after school, alright? We’ll also need to arrange for a diet that will benefit you and…”</p>\n<p align=\"justify\">As he listened to the guy ramble on about his plans, Hitoshi couldn’t help but feel like he’d hit the jackpot. With this, he might actually have a chance of getting into UA’s heroic department.</p>\n<p align=\"justify\"> </p>\n<p>41.</p>\n<p align=\"justify\">“So…” Tenko started reluctantly.</p>\n<p align=\"justify\">He looked like he’d been forced to swallow a lemon whole, and Izuku silently raised an eyebrow, wondering what was up with him now.</p>\n<p align=\"justify\">“…UA’s entrance exam, what kind of level is it gonna be?”</p>\n<p align=\"justify\">Izuku’s eyes sparkled and a wide grin took place in his face.</p>\n<p align=\"justify\">Tenko’s grim expression worsened, if that was even possible.</p>\n<p align=\"justify\"> </p>\n<p>42.</p>\n<p align=\"justify\">“…holy fuck.”</p>\n<p align=\"justify\">Tenko stared with eyes full of disbelief at the robot in front of him.</p>\n<p align=\"justify\">Izuku had explained the contents of the exam, as well as the secret rescue points system and how to pass the level for sure, so Tenko knew what to expect and how to react.</p>\n<p align=\"justify\">And so far, everything had been within his expectations. He found the whole thing to be laughably easy and unnecessary flashy, in general. It only managed to reinforce his opinion that there was something truly wrong with society.</p>\n<p align=\"justify\">What Izuku had neglected to mention, however, was that the Zero Pointer would actually be fucking <em>massive.</em></p>\n<p align=\"justify\">As he carried some injured NPC away from a robot taller than half the fake city’s buildings, there was only one thought running through his mind… <em>what the actual fuck is wrong with this school?!</em></p>\n<p align=\"justify\">Fuck fuck fuck— with exams like this it was no wonder that those first-year brats survived the League’s attacks time and time again.</p>\n<p align=\"justify\"> </p>\n<p>43.</p>\n<p align=\"justify\">Meanwhile in a different testing area, Izuku was sporting a wild, slightly maniacal grin as he swung a steel plate into the ‘head’ of a robot, with enough strength to break both the plate <em>and</em> the robot below.</p>\n<p align=\"justify\">Ah, it was good to not have to worry about collateral damage for once.</p>\n<p align=\"justify\">It wasn’t often that he could go all out like this after all. Even in the future, he could only fight without restrains against the Nomu, All For One, and Shigaraki. Normal villains tended to die if he did that, even without the help of One For All.</p>\n<p align=\"justify\">(Izuku made the math and he was eighty-five percent sure he could take his old sixteen-year-old self in a fight any day, and the number went up to ninety-nine if they both fought quirkless.)</p>\n<p align=\"justify\"> </p>\n<p>44.</p>\n<p align=\"justify\">All For One crushed down the urge to shoot the messenger with skill borne from decades of practice and instead focused on the problem at hand. Namely, this <em>Yūrei</em> character.</p>\n<p align=\"justify\">Three years. That’s how long this ghost had been around, building a reputation on par with All For One’s in a fourth of the time it took him to do it. It was ridiculously impressive, and All For One would have been amused by it all if Yūrei hadn’t also decided to target <em>his</em> organization.</p>\n<p align=\"justify\">Because Yūrei wasn’t just some small obstacle like the many others he’d encountered in the past. No, Yūrei was more like a large disaster, if he was being honest.</p>\n<p align=\"justify\">The ghost was <em>efficient.</em></p>\n<p align=\"justify\">Exactly three years after he received the first report about the destruction of an entire branch of his organization, All For One was informed that their last remaining Nomu factory in Japan, the one hidden under a hospital, had fallen. He had no idea what had even happened to the Doctor, though he suspected the man had met a fate as unfortunate as the one of that Overhaul character from a while ago.</p>\n<p align=\"justify\">Two centuries’ worth of meticulous work, the best players in the field working under his orders, unequivocally the greatest quirk research in the entire world—</p>\n<p align=\"justify\">All of it completely eradicated within three years.</p>\n<p align=\"justify\">Not even All Might had done this much damage to his organization in the thirty plus years he’d been around.</p>\n<p align=\"justify\">…at least he still had Tomura and his little pet project.</p>\n<p align=\"justify\"> </p>\n<p>45.</p>\n<p align=\"justify\">When Shouta ran into Yūrei near the end of his patrol, he couldn’t help but raise an eyebrow.</p>\n<p align=\"justify\">“What’s got you so happy?”</p>\n<p align=\"justify\">The vigilante looked more refreshed than he had ever seen him in all the time they had known each other, so Shouta couldn’t help but feel curious.</p>\n<p align=\"justify\">Yūrei blinked at him, but his demeanor remained unusually cheerful.</p>\n<p align=\"justify\">“I just had a lot of fun today, Eraser.”</p>\n<p align=\"justify\">Shouta could hear the grin when he spoke even if he couldn’t see Yūrei’s face properly behind the black veil.</p>\n<p align=\"justify\">“…do I even want to know?”</p>\n<p align=\"justify\">Yūrei hummed, “Probably not.”</p>\n<p align=\"justify\">Shouta promptly decided that whatever it was that Yūrei was so happy about, it wasn’t worth the headache that it would give him.</p>\n<p align=\"justify\"> </p>\n<p>46.</p>\n<p align=\"justify\">“Have you got your pocket tissues?”</p>\n<p align=\"justify\">“Yeah.”</p>\n<p align=\"justify\">“Yes.”</p>\n<p align=\"justify\">“And your handkerchiefs? Have you two got those?”</p>\n<p align=\"justify\">“Yes, mother.”</p>\n<p align=\"justify\">“We got them, mom. Don’t worry.”</p>\n<p align=\"justify\">Izuku heard Eri giggle next to him and he shared an amused glance with her. Then he smiled at their anxious mom before he finished tying his shoes.</p>\n<p align=\"justify\">In front of him, Tenko was already ready and waiting.</p>\n<p align=\"justify\">“Izuku, Tenko!”</p>\n<p align=\"justify\">All three children focused back on their mom. She smiled shakily, eyes shiny with unshed tears.</p>\n<p align=\"justify\">“I’m proud of you both.”</p>\n<p align=\"justify\">“Me too!”</p>\n<p align=\"justify\">Izuku offered his mom a warm smile in return and ruffled his sister’s hair.</p>\n<p align=\"justify\">“See you later, mom, Eri!”</p>\n<p align=\"justify\">“Bye, mother. Have fun in elementary, chipmunk.”</p>\n<p align=\"justify\">“I will, Ten-nii!”</p>\n<p align=\"justify\">Izuku chuckled as they left the house, and he had to skip a bit to catch up to his impatient brother.</p>\n<p align=\"justify\">Tenko’s expression had morphed into a scowl the moment they were out of sight, clearly unhappy he had to wear the uniform of a school he’d tried (and mostly failed) to destroy multiple times in the past.</p>\n<p align=\"justify\">Izuku considered it to be some type of karma and ignored the grumblings of his twin.</p>\n<p align=\"justify\"> </p>\n<p>47.</p>\n<p align=\"justify\">The moment he stepped into 1-A’s classroom, Izuku was hit with a wave of nostalgia so strong that he had to consciously stop himself from smiling too wide or bursting into tears. It’d been too long since he last saw all his friends together like this, even if none of them knew him yet.</p>\n<p align=\"justify\">He ignored Katsuki’s glare with practiced ease, waved at a tired Shinsou, and cheerfully greeted Uraraka when she thanked him for saving her during the exam.</p>\n<p align=\"justify\">This time he made sure to be in his seat before Aizawa-sensei showed up though, knowing that first impressions were important.</p>\n<p align=\"justify\">He noticed that Tenko was sat behind him, in the seat that Mineta would’ve occupied if he was here, and he grinned at his brother who he imagined was still grumbling internally. Tenko narrowed his eyes at him but didn’t get to say anything because that was the moment their teacher walked— well, <em>crawled</em> in.</p>\n<p align=\"justify\">Somehow, he found his teacher’s aptly nicknamed ‘caterpillar mode’ to still be as disturbing to look at as he remembered.</p>\n<p align=\"justify\"> </p>\n<p>48.</p>\n<p align=\"justify\">Shouta observed his new class as they went through the tests, mentally keeping track of things he’d have to correct or encourage in the students later on.</p>\n<p align=\"justify\">Inevitably, his eyes travelled towards the two boys at the back of the group. He could already tell who this year’s Problem Children would be just by looking at them.</p>\n<p align=\"justify\">Midoriya Tenko and Midoriya Izuku.</p>\n<p align=\"justify\">It was rare to have siblings without complementary quirks be placed in the same classroom, and the only reason they’d both ended up in Shouta’s class was because he was better suited to teach someone in their situation than Kan could ever be.</p>\n<p align=\"justify\">That said, the two brothers were excelling in all the tests so far, ranking always within the top five. This alone wasn’t exceptional; Todoroki and Yaoyorozu were also consistently ranking high. No, the remarkable thing was that they were doing so <em>without</em> quirks.</p>\n<p align=\"justify\">The Midoriya twins were quirkless so they didn’t have much of a choice in the matter, but the fact that it wasn’t stopping them from consistently ranking high was what caught Shouta’s attention the most.</p>\n<p align=\"justify\">Most kids didn’t really bother training before they got to UA, and even those who did didn’t do nearly as well as how the twins were doing right now or how they did during the entrance exam.</p>\n<p align=\"justify\">(The eldest, Midoriya Tenko, had got in mainly through rescue points, only defeating two or three robots at the beginning before giving up on that entirely and choosing to do something more efficient with his energy.</p>\n<p align=\"justify\">The youngest though… Shouta could still clearly recall the green blur that had obliterated any and all robots that were unfortunate enough to cross his path, always moving in increasingly creative ways and never failing to rescue other participants on the way.</p>\n<p align=\"justify\">It had been quite a sight, and the silence that filled the observation room once Nezu announced that the kid who had undoubtedly gotten first place was quirkless— it was something he secretly reveled in.)</p>\n<p align=\"justify\">Shouta watched as Midoriya Izuku grabbed a ball for the ball throw test, got in position, and then proceeded to hurl the object in the complete opposite direction he was meant to. The ball flew directly at Bakugou and, without thinking, the teen exploded it back the direction it came from.</p>\n<p align=\"justify\">Midoriya Tenko let out a loud cackle as the recording device showed an outstanding 720.2 meters, a whole fifteen meters higher than Bakugou’s own score.</p>\n<p align=\"justify\">Shouta barely held back a sigh as he moved to stop Bakugou from murdering the green haired boy.</p>\n<p align=\"justify\">Those twins were definitely this year’s Problem Children, he was sure of it.</p>\n<p align=\"justify\"> </p>\n<p>49.</p>\n<p align=\"justify\">What had begun as mild discontent when he realized that All Might was going to be his teacher had steadily escalated to the point where it was at now: complete and utter loathing.</p>\n<p align=\"justify\">He hadn’t felt this strongly about the guy since he was twenty, for fuck’s sake.</p>\n<p align=\"justify\">Tenko, making use of all the wisdom he’d gained in the past fifteen years he spent practically joined at the hip to Izuku, had reasoned that All Might would have no reason to treat neither of them any differently from the other students.</p>\n<p align=\"justify\">Izuku wasn’t his successor, so he wouldn’t be favored, and Tenko wasn’t a villain, so he wouldn’t be held in low regard.</p>\n<p align=\"justify\">Ho boy was he wrong.</p>\n<p align=\"justify\">Who would’ve expected Japan’s number one hero, the great and adored All Might, to be not only a terrible teacher, but a quirkist one at that?</p>\n<p align=\"justify\">A glance at his twin told him that Izuku had.</p>\n<p align=\"justify\">A frown formed in his face as he studied his brother. He felt like every time he learned something about Midoriya Izuku’s past, the number of questions he had grew exponentially. How in the world had Izuku inherited One For All if All Might disliked the quirkless this much?</p>\n<p align=\"justify\">Green eyes abruptly met his just as he felt a hand take his, and Tenko suppressed a flinch.</p>\n<p align=\"justify\">“Calm down.”</p>\n<p align=\"justify\">The words were barely loud enough for him to hear but it made him realize that he’d been unconsciously scratching his arm enough to draw blood. Not like anyone would notice, as it mixed with the dried blood already on him from trying to stop his nosebleed during his match earlier.</p>\n<p align=\"justify\">A match that All Might had put a stop to the moment he saw Tenko’s nose bleeding even though he let Bakugou Katsuki explode the guy with six arms multiple times, and let Endeavor’s brat freeze everyone inside the building despite the threat of frostbite, and let that electric brat electrocute himself, and and and—</p>\n<p align=\"justify\">“Tenko.”</p>\n<p align=\"justify\">Izuku’s even voice snapped him out of his thoughts and he focused on the pair of green eyes in front of him.</p>\n<p align=\"justify\">But Tenko had come to know that Izuku’s eyes only looked like this when one of the people he loved got injured or when he was trying to emotionally distance himself from something that pained him. Seeing as everyone here was fine, it had to be the latter.</p>\n<p align=\"justify\">Izuku was in distress right now.</p>\n<p align=\"justify\">All Might was hurting his brother.</p>\n<p align=\"justify\">\n<em>That bastard—</em>\n</p>\n<p align=\"justify\">The hand holding his tightened its grip, and some tiny part of Tenko’s mind that sounded suspiciously like Kurogiri pointed out that it’d leave a bruise later for sure, but for now it was enough to make him focus back on reality.</p>\n<p align=\"justify\">He took a deep breath and crushed down his chaotic emotions with skill borne from years of practice as both the leader of the League of Villains, Grand Commander of the Paranormal Liberation Front, and Midoriya Inko’s quirkless son. He knew he couldn’t get angry. Not now at least. He could destroy something later, but first he had to get through the school day.</p>\n<p align=\"justify\">“I’m fine,” he assured once his mind cleared enough.</p>\n<p align=\"justify\">His brother studied him for a moment longer before nodding and letting go of his hand. He didn’t speak for the rest of the day.</p>\n<p align=\"justify\"> </p>\n<p>50.</p>\n<p align=\"justify\">“So, what’re your quirks, Izuku-kun, Midoriya-kun? Do you have complementary quirks or something?”</p>\n<p align=\"justify\">Tenko subtly looked up at the question that was mostly aimed at Izuku, given he was the one to interact with 1-A the most. The gravity girl, whatever her name was, was the one to ask, but most students nearby —except for that purple-haired brat Izuku was friends with— were looking at them with curiosity.</p>\n<p align=\"justify\">Izuku had a cheerful smile on his face as he opened his mouth to answer, but a scoff cut him off before he could answer.</p>\n<p align=\"justify\">“Ha! Deku and that fucker don’t <em>have</em> quirks. They’re just <em>quirkless.</em>”</p>\n<p align=\"justify\">Tenko glared at Bakugou —mostly out of habit at this point, that brat’s voice never got any less annoying— and was met with defiant red eyes that never seemed to learn.</p>\n<p align=\"justify\">“…quirkless?” one of his classmates echoed in the background.</p>\n<p align=\"justify\">Izuku stared directly at Bakugou too, refusing to break eye contact despite knowing full well how nervous that made people feel —something Tenko had experienced first-hand far too many times. It was only when the brat shifted uncomfortably, face twisting as if he was about to snarl, that Izuku turned around and smiled at the rest of the class.</p>\n<p align=\"justify\">“Yes, we’re both quirkless,” he confirmed brightly, completely ignoring Bakugou raging next to him. Tenko snorted quietly.</p>\n<p align=\"justify\">Izuku had spoken in a friendly tone, but the class still faltered. As the only one who wasn’t confused as fuck from what just happened, Tenko used that moment to study his classmates’ reactions, paying attention to the emotions in their expressions.</p>\n<p align=\"justify\">A while ago, after they got their entrance exams’ results back, he’d asked Izuku a question that’d been nagging at him for a while.</p>\n<p align=\"justify\">\n<em>“What if your hero friends treat you differently because you don’t have a quirk this time?”</em>\n</p>\n<p align=\"justify\">Izuku hadn’t replied back then, so Tenko had no other choice than to wait and see to get an answer. And now, that moment had finally come.</p>\n<p align=\"justify\">“You passed the exam <em>without</em> quirks?! That’s so incredible!”</p>\n<p align=\"justify\">“I agree, but just <em>how</em> did you do it? I found it hard even with an offensive quirk!”</p>\n<p align=\"justify\">“Ah! I remember you now!” one of them shouted, the invisible brat. “You were the boy running around with a piece of metal, right? I think I saw you destroy a couple robots with it…”</p>\n<p align=\"justify\">“Wow, that’s so manly!”</p>\n<p align=\"justify\">Tenko tuned out the rest of the conversation.</p>\n<p align=\"justify\">He would not admit it, but he felt slightly relieved. After having <em>All Might</em> of all people treat them unfairly because of their quirklessness, he wasn’t sure exactly how much it would affect Izuku, but he knew his twin would not be fine if his friends rejected him as well. Not one bit.</p>\n<p align=\"justify\">He didn’t know what Izuku’s breaking point was, but unlike his past self, Tenko had no intentions to find out.</p>\n<p align=\"justify\"> </p>\n<p>51.</p>\n<p align=\"justify\">Tenko was self-aware enough to know he’d grown a lot through the years, especially after All For One’s capture in the future and after being reborn in the Midoriya family. He <em>knew</em> this, and seeing his debut as a villain from an outsider’s point of view was supposed to put this growth of his into perspective.</p>\n<p align=\"justify\">That said, nothing could’ve possibly prepared him for the sheer amount of second-hand embarrassment he’d felt the moment the young Shigaraki Tomura stepped through that achingly familiar purple portal, no Nomu in sight because Izuku had systematically destroyed all the factories by now.</p>\n<p align=\"justify\">“That was so pathetic,” he muttered, mortified beyond belief. He’d spent more time cringing internally than he did worrying about the sad excuse for villains that showed up or the fact that Kurogiri was right there too. “Oh my god, that was so embarrassing, what the fuck. I can’t believe I did that.”</p>\n<p align=\"justify\">By his side, Izuku snorted.</p>\n<p align=\"justify\">“It’s called <em>growth,</em> nii-chan.”</p>\n<p align=\"justify\">Tenko lifted his head from where it was buried in his hands and sent him a look that was meant to be a glare but ended up as just a flat stare.</p>\n<p align=\"justify\"><em>Fuck,</em> he was never going to live this down now.</p>\n<p align=\"justify\"> </p>\n<p>52.</p>\n<p align=\"justify\">There were exactly four weeks between the USJ attack and UA’s Sports Festival, and Izuku had a number of tasks he wanted to get done within that time. An endeavor that would probably be more successful if he stopped adding stuff to the list.</p>\n<p align=\"justify\">It wasn’t his fault that he kept discovering things that needed to get done as time passed, alright? He didn’t <em>intend</em> to keep making the list larger, it just <em>happened.</em></p>\n<p align=\"justify\">Dealing with Stain before he ran into Ingenium, finding one or more therapists for the Haunting, arresting Shigaraki Tomura, improving the building where the Haunting stayed, getting rid of All For One, making sure Tenko actually trained for the festival, doing something about Re-Destro and his group, coming up with an opening speech for the festival, finding Gigantomachia and figuring out what the fuck to do with him, speaking with Mei about improving his costumes—</p>\n<p align=\"justify\">It was a never-ending list, really.</p>\n<p align=\"justify\">“You’re late,” Eraserhead grumbled as Izuku landed on their usual rooftop, two days after the USJ incident.</p>\n<p align=\"justify\">“I’m not, you’re just early. Should you even be patrolling yet?” he asked, raising a pointed eyebrow. He was fully aware of how far his teacher’s stubbornness went when it came to work, but he had never been able to call him out on it when he was just his student. He was reveling in this newfound power now. “I know you got hurt during the attack at UA the other day.”</p>\n<p align=\"justify\">Eraserhead send him a narrowed look, but his overall expression read more like exasperation at his odd omniscience and less like suspicion, so Izuku didn’t think much of it.</p>\n<p align=\"justify\">“Christ, what the hell’s your info network made of? That wasn’t released to the public,” he muttered, then shook his head lightly. “Never mind, I don’t want to know. It was just a broken wrist and a mild concussion— nothing Recovery Girl couldn’t heal.”</p>\n<p align=\"justify\">“Of course,” Izuku said flatly. He still remembered his teacher breaking out of the hospital to teach their class, more bandage than man yet still insisting that he was fine. With a role model like that, it was no wonder Izuku had never managed to curb some of his more… self-destructive habits. “Did Mic-san even agree with you working so soon or did you sneak out through the window when he wasn’t looking?”</p>\n<p align=\"justify\">Eraserhead huffed, somehow managing to look offended despite his expression not changing at all.</p>\n<p align=\"justify\">“If he didn’t agree, I assure you I would not be here right now,” he deadpanned. “He’d make sure someone else took over my patrol and then tie me to bed or something.”</p>\n<p align=\"justify\">Izuku paused, a retort dying in his throat as the words hit him like a truck.</p>\n<p align=\"justify\">Task delegation.</p>\n<p align=\"justify\">He had a whole group of villains and misfits living rent-free in his building that he could ask to do his tasks for him, how had he not <em>thought</em> of this yet?</p>\n<p align=\"justify\">He wanted to kick himself so badly.</p>\n<p align=\"justify\"> </p>\n<p>53.</p>\n<p align=\"justify\">Dabi watched from afar as Dust walked into their base, feet dragging on the floor, and collapsed on the couch without a single word.</p>\n<p align=\"justify\">This, of course, prompted Toga and Twice to start poking him to see if he was still alive. Which he proved he was by attempting to shove them away. <em>A</em><em>ttempted</em> being the operative word here.</p>\n<p align=\"justify\">“Fuck off,” Dust mumbled when they didn’t leave him alone, face still buried in a cushion.</p>\n<p align=\"justify\">Dabi almost felt sorry for him.</p>\n<p align=\"justify\">“You look terrible,” Twice commented. <em>“Truly a sight to behold.”</em></p>\n<p align=\"justify\">Toga nodded in agreement, still poking the kid’s cheek.</p>\n<p align=\"justify\">“Yeah, why’re you so bloody, Dust-chan? Ditcha get in a fight or something?”</p>\n<p align=\"justify\">Dust groaned, finally sitting up to glare at them, and— yeah, alright, Dabi had to agree with the other two. Dust looked like he had horribly lost a fight, what with the many bruises and cuts he was sporting wherever his skin was visible. Even his clothes were all fucked up, somehow even more ragged than Dabi’s coat (and that was saying something, he really should get around to replacing it before it fell apart completely).</p>\n<p align=\"justify\">If it was a beating, Dabi was sure whoever did it had just become Yūrei’s next target. God knows that kid was terrifying when someone hurt what he considered to be his.</p>\n<p align=\"justify\">It was then that, as if summoned by Dabi’s thoughts, the terrifying kid in question walked into their base, looking marginally worse than Dust.</p>\n<p align=\"justify\">Now <em>that,</em> he thought with a pair of raised eyebrows, that’s a rare sight.</p>\n<p align=\"justify\">“God fucking dammit,” was the first thing Yūrei said —totally not concerning, coming from the kid who almost never swore— as he marched angrily towards his twin. Toga and Twice wisely scrambled out of the way, while Dabi watched from the safe distance of being on the other side of the room, morbid curiosity keeping him rooted in place. “You’re the fucking worst, I swear.”</p>\n<p align=\"justify\">Yūrei kicked Dust’s arm, ignoring the glare he got in return.</p>\n<p align=\"justify\">“Stop complaining. We got the job done, did we not?” Dust muttered, rolling his eyes.</p>\n<p align=\"justify\">Yūrei looked like he was contemplating fratricide. It was a feeling Dabi could intimately relate to.</p>\n<p align=\"justify\">“I don’t understand, just how are you so bad at villainy? Considering who mentored you, this is more than a little depressing, Dust. Truly.”</p>\n<p align=\"justify\">Dust’s nose scrunched up, making him look mildly constipated. “The hell are you on about? I’m a great villain.”</p>\n<p align=\"justify\">“Should I remind you of the attack last week? Or any of your many failed attacks in the past?” he said flatly. “The only plan I’d consider <em>successful</em> on your part was that time you kidnapped Kacchan, and even <em>then,</em> your losses are enough to make me hesitate.”</p>\n<p align=\"justify\">Dust visibly cringed, and Dabi couldn’t help but be intrigued. He knew the twins had no qualms mingling with villains, but he hadn’t been aware that they had a past of villainy as well.</p>\n<p align=\"justify\">As far as he could tell, Dust didn’t really <em>do</em> much in general, preferring to fan the flames of disaster without getting too involved or sticking to causing problems from behind a screen. He seemed to be good at hacking and finding people’s dirty secrets, if Spinner and Yūrei’s comments were anything to go by.</p>\n<p align=\"justify\">Yūrei, on the other hand, was still widely considered to be a vigilante-slash-informant in the few, growing circles aware of his existence, despite the many crimes he had most definitely committed in the last couple of years. He even patrolled with a pro hero regularly, for fuck’s sake.</p>\n<p align=\"justify\">“But that’s not the problem,” Yūrei moved on before Dust could come up with a retort, much to Toga’s obvious disappointment. The Toga-Twice duo looked equally invested in this verbal tennis match while they wisely stuck to the sidelines. “You almost <em>killed</em> the guy, Dust. That’s <em>bad.”</em></p>\n<p align=\"justify\">“Why’re you acting like it’s such a big deal?” Dust honest-to-god <em>whined,</em> propping himself up on his elbows. “You said it, I <em>almost </em>killed him— and don’t act like you haven’t killed before too.”</p>\n<p align=\"justify\">“Yes, but only when I knew there was nothing that could tie those deaths back to me,” Yūrei deadpanned, and Dabi’s brain suddenly decided to remind him that the Shie Hassaikai’s case still hadn’t been resolved even though everyone and their mothers knew who the person responsible for their end was. “Half the goddamn neighborhood saw us fighting tonight, you unsubtle fuck.”</p>\n<p align=\"justify\">Dust didn’t look the least bit sorry, making Dabi wonder if he actually had no sense of self-preservation at all. Yūrei pinched the bridge of his nose, visibly frustrated.</p>\n<p align=\"justify\"><em>“Nii-chan,”</em> he started pointedly. “I let you tag along because I knew you had a bone to pick with him from before. It wasn’t so you could slam his head into a brick wall <em>after </em>he passed out.”</p>\n<p align=\"justify\">“Fucker deserved it anyways.”</p>\n<p align=\"justify\">“The wall <em>cracked.”</em></p>\n<p align=\"justify\">“Not my fault it was a shitty wall.”</p>\n<p align=\"justify\">“Oh, for the love of—”</p>\n<p align=\"justify\">Yūrei cut himself off, taking a moment to reign in his clear desire to punch Dust into tomorrow. Dabi had to applaud that show of self-control— but only mentally, he wouldn’t want to interrupt this little show.</p>\n<p align=\"justify\">“You know what?” Yūrei said suddenly, voice deceptively calm. “I’m too tired to deal with your bullshit right now. I’m going to sleep and <em>we</em> will work on damage control when I wake up. You can consider your hacking privileges revoked ‘til further notice.”</p>\n<p align=\"justify\">They watched blankly as Yūrei turned on his heel and walked off to the room he had claimed as his in the building, completely ignoring his brother’s complaints as Dust scrambled to follow.</p>\n<p align=\"justify\">“Well that was fun,” Toga giggled once the twins were out of sight, sounding like she couldn’t understand what the fuck just happened.</p>\n<p align=\"justify\">Dabi could relate.</p>\n<p align=\"justify\">(Two days later, Toga would come running at him and shove her phone into his face. Only after he managed to calm her down enough to actually <em>see</em> what she was showing him would he realize it was a news article about the capture of the Hero Killer; Stain, who apparently had been found in an alley in Hosu, with extensive injuries and his head having been bashed against a wall.</p>\n<p align=\"justify\">As he stomped down on the urge to laugh hysterically to cover his ever-growing apprehension towards a certain ghost child, Dabi couldn’t help but think that the twins truly were great at damage control.</p>\n<p align=\"justify\">Not a single article even hinted at their involvement.)</p>\n<p align=\"justify\"> </p>\n<p>54.</p>\n<p align=\"justify\">Izuku knew, in theory, that the League of Villains was somewhat competent at their jobs. If anything, almost making society as a whole collapse in the previous timeline was a testament to that.</p>\n<p align=\"justify\">Knowing and seeing were two different things though, and he couldn’t help but be mildly surprised when the Haunting all reported back great progress in their assigned tasks with still a week to go ‘til the festival.</p>\n<p align=\"justify\">Compress, Spinner, and Himiko, probably the most solid infiltration-and-capture team he could form with these people, had been sent to retrieve and dispose of Re-Destro and anybody working directly with him.</p>\n<p align=\"justify\">Izuku wasn’t familiar with all the high-ranking members of the Meta Liberation Army so he could only go off of Tenko’s memories and whatever information they could find doing some recon for a couple days.</p>\n<p align=\"justify\">In the end, the team successfully carried out the mission within two weeks. A week after that, Dabi, Magne, and Tenko announced that they had found Gigantomachia’s current location— apparently not too far from where Tenko had found him the first time around.</p>\n<p align=\"justify\">Meanwhile, Twice and Mustard he’d sent out on errands to get all kinds of materials— both for the improvement of their building and for some ideas Izuku had come up with together with Mei.</p>\n<p align=\"justify\">Tenko was grinning at him, all smug lines and bright eyes, as if he knew exactly what Izuku was thinking and couldn’t help but feel proud of his League. It was actually a very familiar expression, but Izuku didn’t see it often in this timeline, seeing as the League of Villains didn’t exist and their ragtag group was actually Izuku’s work.</p>\n<p align=\"justify\">He huffed, amused, but let Tenko have his moment.</p>\n<p align=\"justify\"> </p>\n<p>55.</p>\n<p align=\"justify\">It seemed obvious in hindsight, but somehow it hadn’t occurred to Izuku that Tenko might miss his old caretaker until he heard him call for Kurogiri to make him a milkshake while in a sleep-deprived haze.</p>\n<p align=\"justify\">Now that the thought was there, though, it didn’t feel like it was leaving any time soon.</p>\n<p align=\"justify\">Izuku hadn’t lost much when he was reborn in this timeline. Or rather, he hadn’t lost anything he <em>couldn’t</em> get back eventually if he tried (anything All Might-related was an exception he was pointedly not thinking about). Tenko however… Everything he’d worked towards, the people he’d got close to in the past— all of that was <em>lost.</em> And sure, he seemed content with his life now, but that didn’t necessarily mean he didn’t miss his old life.</p>\n<p align=\"justify\">Izuku had recruited every future member from the League mainly because he didn’t want Shigaraki Tomura to get to them first and cause problems again, but that wasn’t the only reason. No, he’d done it because while Izuku would get all his friends back when he got into UA, Tenko didn’t have that advantage. Izuku wanted Tenko to have his friends back too without him joining with the League a second time, and so he did what he thought was the best way of achieving that.</p>\n<p align=\"justify\">He hadn’t failed to notice how much more relaxed Tenko had become ever since he was re-introduced to the others, either.</p>\n<p align=\"justify\">Still, there was someone missing from the original League that Izuku hadn’t managed to bring to their side, the one person who was arguably the most important for his brother in the whole group.</p>\n<p align=\"justify\">A finger tapped his forehead harshly, right between his eyebrows, and he flinched back. When he looked up, he found Tenko raising an eyebrow at him.</p>\n<p align=\"justify\">“The freaks said there’s movie night tonight and we’re not allowed to ditch,” he informed flatly, collapsing on the couch next to him.</p>\n<p align=\"justify\">Izuku nodded absently, filling the information away in his brain and focusing on studying Tenko instead.</p>\n<p align=\"justify\">“Whatcha looking at?” his brother snapped eventually, no real heat behind the words.</p>\n<p align=\"justify\">“Do you miss Kurogiri?”</p>\n<p align=\"justify\">Tenko froze, and— oh. He hadn’t meant to blurt that. Izuku had planned a more subtle approach, but now that the words were out of his mouth, he decided that forging forward was the only way to go.</p>\n<p align=\"justify\">“I managed to find and bring together all the others from your League but I just realized that Kurogiri was missing, and since he was your main caretaker growing up, I wondered if—”</p>\n<p align=\"justify\">“Jesus Christ, shut the fuck up.”</p>\n<p align=\"justify\">Izuku’s mouth snapped shut, watching his brother run both hands down his face tiredly. One of them stayed up, scratching his temple slightly in that terrible habit Tenko never seemed to drop. Izuku ignored it for now.</p>\n<p align=\"justify\">“Kurogiri’s a Nomu. He was programmed to protect me— to protect <em>Shigaraki Tomura</em> first and foremost,” Tenko explained tonelessly, a grimace on his face. “You won’t be able to make him join our party like you did with the rest of the freaks.”</p>\n<p align=\"justify\">Izuku blinked. This wasn’t anything he didn’t already know from the other timeline. Kurogiri was a Nomu made from the corpse of an old UA student who may or may not have been related to Aizawa-sensei and Yamada-sensei. That he prioritized Shigaraki’s safety, and by extension the League’s, over everything else was also pretty easy to figure out when he analyzed their behaviors.</p>\n<p align=\"justify\">That said, he hadn’t spent the past four years <em>just</em> tormenting All For One. As fun as that hobby was, Izuku liked being efficient, and while destroying his father’s main assets could be considered enough already, he had taken it one step further and stolen all the information he could get his hands on. Which was, after paying a visit to all Nomu factories he could find in the country, <em>a</em> <em>lot</em> of information.</p>\n<p align=\"justify\">All this to say that Izuku knew far more about bioengineering and genetics than any one person should.</p>\n<p align=\"justify\">“That doesn’t answer my question though,” he said after a beat.</p>\n<p align=\"justify\">Tenko frowned at him like he was being annoyingly dense, but Izuku just waited. Eventually, his twin sighed.</p>\n<p align=\"justify\">“He was a great asset,” he admitted, and knowing how emotionally constipated Tenko was, Izuku would take it for the admission it was meant to be.</p>\n<p align=\"justify\">“Then we’ll get him back,” he said simply, shrugging casually and ignoring the startled look he was given. He made a mental note to add it to his written to-do list later. “I would need to take a look at him first, but I’m pretty sure I can reprogram him. I have enough notes on bioengineering and Nomu-making to be able to at least <em>try.”</em></p>\n<p align=\"justify\">When he didn’t get a response, he turned to find Tenko frozen in place, mouth moving but no sound coming out.</p>\n<p align=\"justify\">“You— it— <em>what?”</em></p>\n<p align=\"justify\">Despite the seriousness of the conversation, Izuku couldn’t help but laugh.</p>\n<p align=\"justify\">“I had to suddenly learn how to use seven quirks at age sixteen, dude. Do you really think I never delved into bioengineering and genetics to try and make sense of them?”</p>\n<p align=\"justify\">Tenko’s mouth closed with a <em>click</em> as he leaned back on the couch and stared into space, looking like he was reconsidering a lot of things. Izuku let him be, pushing his hand away from his face when the scratching restarted and leaning back comfortably as he started to think up a plan for his new objective, yet another bullet point to be added to his ever-growing list.</p>\n<p align=\"justify\">He’d get Kurogiri back, for Tenko.</p>\n<p align=\"justify\"> </p>\n<p>56.</p>\n<p align=\"justify\">There were four days left until the day of the Sports Festival, meaning that Shouta was overworked and stressed enough even <em>before </em>he received what was quite possibly the most disconcerting message from Yūrei so far.</p>\n<p align=\"justify\">The vigilante had let him know beforehand not to expect him during patrol that night, saying he had something to take care of and wouldn’t be able to make it in time, so to have suddenly received a text from him with just some coordinates was, to put it mildly, alarming.</p>\n<p align=\"justify\">Thankfully, Shouta hadn’t been too far away from the location to begin with and thus made it there in just a couple of minutes, landing lightly on top of the closest rooftop.</p>\n<p align=\"justify\">Whatever he was expecting —maybe a fight? Yūrei injured? A powerful villain?— it certainly wasn’t to see Yūrei sitting cross-legged on top of a dumpster, quietly talking with an unknown person, who was in turn leaning against the opposite wall of the alley. They both looked like they’d just been in a fight, small cuts and injuries coupled with tattered dirty clothes, but Shouta didn’t get the impression it’d been against each other.</p>\n<p align=\"justify\">He climbed down, catching the tail end of their conversation.</p>\n<p align=\"justify\">“…have nee-san take care of them later, stop fussing,” grumbled the stranger.</p>\n<p align=\"justify\">“It’s not fussing— oh hey Eraser!” Yūrei perked up, waving a hand in his direction, and Shouta nodded in greeting, making sure the stranger stayed within his field of vision. “Thanks for coming on such short notice.”</p>\n<p align=\"justify\">He hummed absently, allowing himself to relax marginally at the lack of immediate action.</p>\n<p align=\"justify\">“Why’d you call me?” he asked finally, and watched as Yūrei rubbed the back of his neck, what was visible of his expression reading as slight sheepishness. Shouta resisted the urge to frown. “Yūrei?”</p>\n<p align=\"justify\">“Don’t get mad,” Yūrei started, which were the magic words to actually <em>make</em> him frown, because nothing good for his sanity had ever followed them. “Here, just— see for yourself.”</p>\n<p align=\"justify\">Yūrei gestured vaguely in the stranger’s direction. More specifically, towards the stranger’s feet, and Shouta squinted at the shadows, wondering what the hell Yūrei could be possibly showing him—</p>\n<p align=\"justify\">He paused.</p>\n<p align=\"justify\">Was that… a body?</p>\n<p align=\"justify\">For one truly surreal moment, he wondered if maybe Yūrei had killed someone and wanted help <em>—Shouta’s</em> help at that— to hide the body, but then he registered the sound of shallow breaths coming from it and discarded the thought.</p>\n<p align=\"justify\">That still left him with a body though.</p>\n<p align=\"justify\">“And who’s this supposed to be…?” he asked, because what else was there to ask at this point? Clearly Yūrei wanted him to do something about them, considering he would’ve just handed them off to the police otherwise, so maybe the question would shed some light as to <em>why.</em></p>\n<p align=\"justify\">Yūrei blinked, looking thrown off, while the stranger let out a groan, as if suddenly realizing something very obvious, and shuffled away from the body. Not too far, though. Just enough that it’d be more visible under the dim light from a street lamp but still at arms-reach in case it suddenly started moving.</p>\n<p align=\"justify\">Shouta studied it again as the silence stretched on, taking in the bloodied black clothes, separately tied hands, and suspiciously familiar grey hair.</p>\n<p align=\"justify\">Evidently, Shouta should be able to recognize this person. Yūrei seemed to think so, at least.</p>\n<p align=\"justify\">As if understanding he should probably explain himself, the vigilante awkwardly cleared his throat.</p>\n<p align=\"justify\">“That’s, um… Eraser, that’s Shigaraki Tomura.”</p>\n<p align=\"justify\">Ah, so <em>that’s</em> why Yūrei prefaced this conversation with a “don’t get mad.”</p>\n<p align=\"justify\">If Shouta went grey young, he was definitely blaming Yūrei.</p>\n<p align=\"justify\"> </p>\n<p>57.</p>\n<p align=\"justify\">In the three years since Yūrei roped him into joining his little odd group, Atsuhiro had more or less grown used to being one of the few people with any common sense around.</p>\n<p align=\"justify\">There was a reason why he and Magne were the designated Adults, after all, and while Yūrei seemed to be at least somewhat responsible, the boy also had a chaotic streak a mile wide. The fact that he came up with and successfully executed a plan to adopt a bunch of villains and runaways was as good an example as any.</p>\n<p align=\"justify\">All this, of course, meant that when Yūrei announced his newest course of action and his questionable decision to involve them all in it, Atsuhiro didn’t think much of it beyond mentally preparing himself for the worst.</p>\n<p align=\"justify\">It was only after he looked at the whole picture that he started to wonder if maybe Yūrei hadn’t finally snapped under the pressure and gone crazy.</p>\n<p align=\"justify\">“You can release him on the table,” Yūrei instructed as they walked inside the lab the kid had somehow acquired, not waiting to see if Atsuhiro would follow as he moved towards one of the counters and pulled out a pair of surgical gloves.</p>\n<p align=\"justify\">Atsuhiro didn’t need to be told twice though. He quickly pulled out the marble containing the unconscious mist-guy Yūrei had him kidnap and releasing him. He tried to make his movements as natural and relaxed as physically possible, years of acting coming back easily, but something must’ve tipped Yūrei off of his unease with the situation if the mild smile sent his way was any indication.</p>\n<p align=\"justify\">“Relax,” Yūrei said, not unkindly. “His body’s been altered so he’d be an obedient servant with little to no free will. We’re just changing him back to normal.”</p>\n<p align=\"justify\">He didn’t question how a fifteen-year-old could possibly know enough about genetic engineering to accomplish that. Regardless of age and in spite of his crazy plans, Yūrei was one of the most self-aware people Atsuhiro knew. He wouldn’t carry on with this if he wasn’t confident that he could do it and do it <em>well.</em></p>\n<p align=\"justify\">The boy paused for a moment, lips curling in distaste as he eyed the guy.</p>\n<p align=\"justify\">“Or well,” he amended mildly, “as close to normal as we can manage, anyhow. Some things are just beyond repair.”</p>\n<p align=\"justify\">Atsuhiro simply nodded, accepting the words as they were intended— a reassurance, if blunt in its delivery, that they weren’t about to do something unforgivable.</p>\n<p align=\"justify\">Atsuhiro was a villain, but there were some lines that just weren’t meant to be crossed no matter what, and he trusted Yūrei enough to know he wouldn’t lie about this.</p>\n<p> </p>\n<p>58.</p>\n<p align=\"justify\">“Have fun tomorrow, boys!” exclaimed Himiko, waving at the twins as they got ready to leave. “Break a leg!”</p>\n<p align=\"justify\">Dust snorted, “Yeah, Yūrei— break a leg.”</p>\n<p align=\"justify\">Yūrei sent him a dry look, apparently unamused at whatever memory his brother had referenced. Himiko didn’t dwell on that odd exchange— the boys had a lot of inside jokes and asking had never got her a real answer before, so she wouldn’t try now.</p>\n<p align=\"justify\">Instead, she simply watched as Yūrei sighed and turned to smile at her. “Thank you, Himiko-chan,” he said. “We’ll try our best. Just you watch.”</p>\n<p align=\"justify\">Himiko nodded excitedly, “Will do!”</p>\n<p align=\"justify\">By her side, sprawled on the couch, Dabi made a quiet, confused noise. “What’s tomorrow?”</p>\n<p align=\"justify\">“The Sports Festival, duh,” Himiko replied, frowning a little because she <em>knew</em> she’d told him about it— she even made him promise to watch it with her and the rest of the Haunting! Had Dabi forgotten already?</p>\n<p align=\"justify\">Dabi’s face scrunched up, either in annoyance or further confusion. Most likely a mix of both. “What’s that got to do with ‘em?”</p>\n<p align=\"justify\">Himiko blinked, unsure of where the confusion stemmed from. She glanced at the twins, but Dust seemed to be in the same predicament as her, while Yūrei’s face was doing that thing it did when he knew something the rest of them didn’t and found it amusing.</p>\n<p align=\"justify\">She looked back at Dabi, understanding finally hitting her, and didn’t bother stopping the grin threatening to stretch over her face.</p>\n<p align=\"justify\">“Wait, don’t tell me…” muttered Dust, apparently coming to the same conclusion as the rest of them.</p>\n<p align=\"justify\">“Dabi,” Yūrei called, voice light with mirth.</p>\n<p align=\"justify\">There was a great deal of apprehension in his muttered “…what?”</p>\n<p align=\"justify\">“We’re UA students, dude.”</p>\n<p align=\"justify\">“Fuck off,” was Dabi’s reflexive reply, most likely assuming Yūrei was pulling his leg. An understandable assumption, all things considered. Himiko giggled.</p>\n<p align=\"justify\">“Seriously. Class 1-A,” insisted Yūrei, but Dabi just shook his head, glaring at them.</p>\n<p align=\"justify\">“Yeah, no, I’m not falling for that,” he declared, pointedly going back to looking at his phone, and Himiko shared a knowing look with the twins.</p>\n<p align=\"justify\">Yūrei shrugged, “Alright then.”</p>\n<p align=\"justify\">(The next day, she made sure to have her camera ready when the twins showed up on TV. The dumbfounded expression on not only Dabi’s face but also everyone else’s was just <em>priceless.)</em></p>\n<p align=\"justify\"> </p>\n<p>59.</p>\n<p align=\"justify\">To say All For One was upset would be the greatest understatement of his life.</p>\n<p align=\"justify\">His Nomu project was all but done for with the destruction of the factories and the presumed death of the Doctor, the destruction rate of his organization kept on growing despite his best efforts, and both Tomura and Kurogiri had been captured and taken somewhere his warp quirk couldn’t reach.</p>\n<p align=\"justify\">And to top it all off, both of his sons had up and decided to become <em>heroes.</em></p>\n<p align=\"justify\">All For One was all for defying society and its rules, especially if it affected the heroic system directly, but did they <em>really</em> have to choose the<em> one</em> career All For One actively fought against?</p>\n<p align=\"justify\">(Did they really have to follow in their uncle’s footsteps?)</p>\n<p align=\"justify\">If he were a superstitious man, he’d think the universe was actively working to make him miserable. But he wasn’t, so he was blaming Yūrei for his troubles. Everything had only gone downhill ever since that goddamn ghost showed up, even the things that they couldn’t have possibly have a hand in.</p>\n<p align=\"justify\">Like his quirkless sons being in UA’s hero course.</p>\n<p align=\"justify\">Speaking of— All For One had cleared a day in his schedule to watch the Sports Festival with Tomura long before the boy had gotten caught. The fact that he was missing now didn’t mean All For One’s interest in certain contenders had been smothered.</p>\n<p align=\"justify\">So, here he was, sat in front of the TV and watching the first event, an obstacle race, begin.</p>\n<p align=\"justify\">Izuku, his youngest, had given the opening speech to the festival, all bright smiles and friendly personality. A good public speaker, that one. He pondered on the idea of the boy going on to become an advocate for quirkless rights in the future, watching him effortlessly pick up a discarded piece of metal from one of the ridiculously sized robots and… angling it towards a set of cannons pulled from the flesh of another student. He leapt into the air.</p>\n<p align=\"justify\">\n<em>Surely not…</em>\n</p>\n<p align=\"justify\">The cannons exploded and Izuku <em>shot</em> through the air on a steel plate, easily carried by the destructive force. All For One watched, breath held, as the boy rocketed over any remaining robots, right over the canyon, and landed solidly… in the middle of a field of landmines. Which promptly exploded, carrying the boy straight to the finish line with only the occasional foot touching the ground to rocket himself off yet another mine.</p>\n<p align=\"justify\">Both audience and announcers stared, completely dumbstruck, as a quirkless fifteen-year-old rocketed through the obstacle course, finishing the race in thirty seconds flat and no doubt breaking whatever the previous record for this thing was.</p>\n<p align=\"justify\">“FIRST PLACE GOES TO MIDORIYA IZUKU!” Present Mic screamed, a good five seconds later. The cameras focused on the boy, who somehow looked completely nonchalant as he beamed at the audience, before panning back to the other participants.</p>\n<p align=\"justify\">Thankfully, Tenko had the sense to actually go <em>through</em> the obstacles and reach the finish line in seventh place. Good to know that at least <em>one</em> of his kids had some working self-preservation instincts.</p>\n<p align=\"justify\">Then his youngest was assigned a ten-million-point bounty and merely shrugged, skipping around as he quickly gathered a team consisting of his brother, a girl with pink hair, and another with a gravity quirk, somehow looking completely unbothered about having the entire school out to get him.</p>\n<p align=\"justify\"><em>Then again, </em>a nasty voice whispered in his mind,<em> it probably is the norm since they’re quirkless.</em></p>\n<p align=\"justify\">The cavalry battle began and All For One watched the pink haired girl give both of his sons what could only be reinforced metal pipes as they all took off into the air, staying put with the combined work of the girls’ gravity quirk and hover shoes. From there it was a simple strategy of staying out of the other teams’ range and using the pipes to methodically gift concussions to anyone who got too close.</p>\n<p align=\"justify\">It was a terrifyingly effective strategy, and by the end, his boys’ team reigned victorious without losing a single headband.</p>\n<p align=\"justify\">The camera focused on the celebrating faces of the winning team, with Izuku beaming and Tenko looking all smug right in the center of the screen.</p>\n<p align=\"justify\">All For One eyed the wine bottle in the corner cabinet longingly.</p>\n<p align=\"justify\"> </p>\n<p>60.</p>\n<p align=\"justify\">Tenko made the intelligent decision of refusing to go against his brother, meaning he gave up on participating in the third event altogether and instead got to watch as Izuku demolished the competition with the same ease he did corrupted politicians.</p>\n<p align=\"justify\">He remembered watching this event with All For One the first time around and knew for a fact that Izuku was not struggling at all now, no matter how much he downplayed his strength for appearances’ sake.</p>\n<p align=\"justify\">(Not like Izuku <em>could</em> go all out here, against children with as little training as first year students had.)</p>\n<p align=\"justify\">Poor Shinsou, the only one aside from Tenko who had known Izuku was a powerhouse and absolutely feral way before today, was unfortunate enough to be Izuku’s first victim, being <em>picked up </em>and <em>tossed </em>out of the ring before he could get even a word in. Shinsou stared dazedly at Izuku from the ground and Tenko would bet his whole allowance that the guy was reevaluating all the times they’d sparred together in the past.</p>\n<p align=\"justify\">Tenko went out of his way to get popcorn for the match against Todoroki, knowing full well the kind of shitshow it was going to be. And boy did Izuku deliver, prolonging the fight just long enough to get Todoroki to explode in a furious blaze. He caught the grin on his brother’s face right before Izuku jumped after Todoroki and couldn’t help but feel some sympathy for what was going to happen next.</p>\n<p align=\"justify\">Fire shot onwards. Izuku ran directly towards it, grabbing a piece of debris from the half-destroyed ring and using it as a shield against the fire, ricocheting the flame off at an upwards angle. Izuku skidded underneath the improvised shield, his body contorting and twisting into a rising kick aimed at Todoroki—</p>\n<p align=\"justify\">Tenko winced as Izuku’s reinforced shoes connected with Todoroki’s jaw, sending the poor guy flying out of the ring and towards the wall without mercy.</p>\n<p align=\"justify\">The stadium was silent for one blessed moment before it erupted into wild cheers. His phone too was going crazy with Himiko and the others spamming the Haunting’s group chat, but he ignored it for now, deciding to go check on his stupid twin.</p>\n<p align=\"justify\">(No, he was not <em>concerned.</em> He knew full well Izuku was holding his right arm, making a point to keep it angled away from the cameras, only because his compression band and shirt were no more than a tattered mess by now and the hand-shaped scar Shigaraki Tomura gave <em>Yūrei</em> a couple years ago was almost revealed for all to see.)</p>\n<p align=\"justify\">He reached the infirmary minutes after his brother, swinging by the lockers to grab Izuku’s spare PE uniform and compression band, and walked in to find said idiot chuckling sheepishly while Recovery Girl bandaged him up, scolding the shit out of him.</p>\n<p align=\"justify\">“Tenko!” Izuku exclaimed the moment he made his presence known, looking at him like he was the best thing to happen to him at that moment. To be fair, if Tenko was in his position and someone walked in to possibly distract Recovery Girl, he might just look at them like that too.</p>\n<p align=\"justify\">Still, he scowled, throwing the clothes at Izuku and hitting him square in the face because both his hands were in Recovery Girl’s grasp at the moment.</p>\n<p align=\"justify\">“Hey! What…”</p>\n<p align=\"justify\">“Your spare uniform, dumbass.”</p>\n<p align=\"justify\">Izuku blinked, then lighted up, grinning at Tenko, “So you really <em>do</em> care ‘bout me! Thanks, nii-chan!”</p>\n<p align=\"justify\">“More like I don’t want to see a fifteen-year-old going around naked on live television,” he muttered with a frown. “Which reminds me— have you talked to Crazy Two about the NPC’s costumes yet?”</p>\n<p align=\"justify\">“Yeah, I mentioned it to her,” he nodded, throwing on a shirt the moment he was allowed. “Mei-chan took one look at them and immediately started researching a fabric that possibly works with Yaomomo’s and Hagakure’s quirks. Last I heard, she’d thrown a twenty-page essay on why they should change the designs and a portfolio with her ideas on top of Power Loader’s desk and refused to back down until he allowed her to re-work the costumes. If everything goes right, they should be done by the time of our first internships.”</p>\n<p align=\"justify\">“Good,” Tenko nodded solemnly. The hero costumes of half the students in his class were so badly made that he cringed every time they were worn, but Tenko could barely look in the girls’ direction during those classes without feeling <em>absolutely disgusted.</em></p>\n<p align=\"justify\">All of the girls’ costumes were a problem —Tenko had heard both the gravity girl and Tsu say how uncomfortable they were with how tight theirs were made— but the class rep’s and the invisible brat’s were the worst of the bunch, what with one of them being <em>far too revealing for a literal teenager</em> and the other <em>straight-up</em> <em>nonexistent.</em></p>\n<p align=\"justify\">He already had plans to dig up dirt on the companies that made them and the specific people who authorized their use for literal children. It’d serve to blow off some steam if nothing else.</p>\n<p align=\"justify\">Recovery Girl shot them a curious look but didn’t ask any questions, moving instead to treat a battered-up Todoroki, still unconscious on the next bed over. Tenko stared at the poor fucker for a moment longer before turning towards his brother.</p>\n<p align=\"justify\">“If you lose against fucking <em>Bakugou</em> of all people, I’m burning all your posters, you hear me?”</p>\n<p align=\"justify\">Izuku laughed, “Loud and clear, nii-chan.”</p>\n<p align=\"justify\">(Izuku did not lose against Bakugou. In fact, it was a nearly instant, extremely satisfying K.O. on his part because while Izuku was not willing to fight a <em>kid</em> when he himself had years of experience as both being a pro and working with others, a hero student in a school-sanctioned event was an entirely different matter.)</p>\n<p align=\"justify\"> </p>\n<p>61.</p>\n<p align=\"justify\">The night of the Sports Festival, after everything was over and the students were bandaged up and sent home, a celebration was held at the Midoriya household.</p>\n<p align=\"justify\">Their mom made enough food to feed a small army, making sure their favorites were among the various dishes, and Eri excitedly reenacted her favorite moments to her brothers. Tenko applauded and told Eri tidbits of info about the people that had caught her attention, while Izuku and his mom tried to decide the best place to display his gold medal.</p>\n<p align=\"justify\">Afterwards, once Eri had fallen asleep and everything was put away, the boys decided to go to the Haunting. They hadn’t finished closing the door before Himiko threw herself at them, Tenko sidestepping on reflex and Izuku readily catching her. Himiko giggled, gushing about how cool she thought they had been and how she’d recorded everyone’s reactions to show them later.</p>\n<p align=\"justify\">They let her drag them towards the improvised party everyone had decided to throw for them, both of them relishing the warm atmosphere.</p>\n<p align=\"justify\"> </p>\n<p>62.</p>\n<p align=\"justify\">“Very impressive, Midoriya-kun.”</p>\n<p align=\"justify\">Admirably, Izuku didn’t jump out of his skin when an unexpected voice suddenly sounded as he finished climbing a roof. Even more admirably, he didn’t curse aloud when the words actually registered in his brain.</p>\n<p align=\"justify\">Slowly, a little reluctant and already dreading the next few minutes, he looked up at owner of the voice.</p>\n<p align=\"justify\">“I must say,” Nezu said conversationally, like he hadn’t just caught Izuku leaving a crime scene. “You’re a not an easy individual to get a hold of, much less find any information on. You’ve done a masterful job separating your life as Yūrei from your civilian one.”</p>\n<p align=\"justify\">“Thank you?” he replied, because what else was he supposed to do? Even if he managed to get away now, Nezu ran his <em>school.</em> This conversation was inevitable no matter how much he wished it wasn’t and he’d rather not annoy the one guy who could ruin his life with just a word.</p>\n<p align=\"justify\">“And you managed to do it at only thirteen years of age too,” Nezu continued, walking closer, and Izuku stepped away from the edge of the roof. “You’re an extremely skilled individual, and it’s become clear that your current curriculum will not be teaching you anything you don’t already know.”</p>\n<p align=\"justify\">“Sir?” he questioned.</p>\n<p align=\"justify\">Nezu grinned and Izuku felt a sudden sense of <em>foreboding.</em></p>\n<p align=\"justify\">“How would you feel about being my personal student, Midoriya-kun?”</p>\n<p align=\"justify\"> </p>\n<p>63.</p>\n<p align=\"justify\">Tenko hadn’t known what to expect when he and his brother were called to the principal’s office first thing once classes restarted.</p>\n<p align=\"justify\">As a general rule, nothing good ever came from these kinds of visits, which meant Tenko had mentally prepared for the worst. He wasn’t sure what the worst could <em>be</em> but he could at least be prepared for it.</p>\n<p align=\"justify\">Witnessing Izuku and Nezu discuss internship options and a new curriculum at length was not something he would’ve ever considered an option to begin with. Apparently, Izuku had forgotten to tell him that the principal knew about Yūrei and Dust.</p>\n<p align=\"justify\">He was going to <em>strangle</em> him for that later.</p>\n<p align=\"justify\">Now though, he simply focused on his frankly amazing tea while he waited for a lull in the conversation. It was starting to get a little hard to follow the longer in went on, and Tenko would rather not be here when it inevitably started going over his head.</p>\n<p align=\"justify\">“Sir,” he interjected finally, settling down his empty cup. “Since we’re talking about curriculums, I’d like to request something?”</p>\n<p align=\"justify\">Nezu hummed, gesturing encouragingly with a paw. He glanced at Izuku momentarily before focusing back on the principal.</p>\n<p align=\"justify\">“I would like to transfer to the support department,” he said.</p>\n<p align=\"justify\">“Oh?” Nezu replied, somehow giving the impression that he’d be raising his eyebrow if he had any. “And why’s that?”</p>\n<p align=\"justify\">“I’m interested in their coding and IT classes,” he explained, then waved a hand in his brother’s direction. “And heroics has always been Izuku’s dream anyway, not mine. I just followed him here because he asked me to and I didn’t have any better plans at the time.”</p>\n<p align=\"justify\">Nezu looked thoughtful. “I don’t suppose you’d be interested in a joint curriculum then? Attend classes from both support and heroics?”</p>\n<p align=\"justify\">“To be frank, I don’t think I’d be very happy as a hero, sir,” he said dryly. “I’d rather transfer fully to support, if possible.”</p>\n<p align=\"justify\">Finally, Nezu nodded. He placed both paws on his desk, humming lightly.</p>\n<p align=\"justify\">“In that case, I’ll fill out the paperwork for your transfer, Midoriya-kun,” he said, and Tenko tried not to show the relief at never having to attend another class taught by All Might. He’s not sure he managed, considering the amused look Izuku shot him. “The school will send you your new schedule once it’s ready.”</p>\n<p align=\"justify\">“Thank you, sir.”</p>\n<p align=\"justify\"> </p>\n<p>64.</p>\n<p align=\"justify\">Tenko had barely finished introducing himself to his new class when Crazy Two, Izuku’s friend who made his vigilante costume and teamed up with them for the Sports Festival, practically shot out of her seat in her effort to catch his attention.</p>\n<p align=\"justify\">“Izu-kun’s brother!” she exclaimed, despite the fact he’d just said his name. “Here! Come sit with me!”</p>\n<p align=\"justify\">Tenko blinked, abruptly remembering why he’d nicknamed her Crazy Two, and turned to look at his homeroom teacher with a raised eyebrow. One heavy sigh later, the man motioned him to go on and get seated.</p>\n<p align=\"justify\">“What’s your specialty?” she demanded once he was close enough, not even waiting for him to sit down first.</p>\n<p align=\"justify\">“Coding. Hacking.”</p>\n<p align=\"justify\">Crazy Two shot him a wild, slightly maniacal grin as she practically started vibrating on her seat.</p>\n<p align=\"justify\">“Perfect,” she said. “I’ll take care of the physical parts, you make sure the virtual stuff works properly, whaddaya say?”</p>\n<p align=\"justify\">Despite the overenthusiastic and low-key overbearing attitude, Tenko found himself grinning in response.</p>\n<p align=\"justify\"> </p>\n<p>65.</p>\n<p align=\"justify\">Kurogiri had woken up about a week after the Sports Festival, amnesiac but officially capable of free will, and after a check-up to make sure everything was in order, Izuku had put Compress in charge of showing him around the base and introducing him to the Haunting.</p>\n<p align=\"justify\">Last he checked, Compress, Spinner, and Dabi had been taking turns keeping an eye on Kurogiri, which would probably explain why he walked in on Dabi napping without a care in the world while Kurogiri attempted to gather resources in Minecraft (a mighty effort, because apparently controlling the mist wasn’t as intuitive a task as they had first thought) alongside Tenko.</p>\n<p align=\"justify\">Tenko, who had been a scratching mess for the last couple of days.</p>\n<p align=\"justify\">Tenko, who had been distracted and anxious the past couple days.</p>\n<p align=\"justify\">Tenko, who now looked calmer and more relaxed than Izuku had ever seen him in this life.</p>\n<p align=\"justify\">Sure, it wasn’t like what they had in the past, back when Tenko was Shigaraki Tomura and Kurogiri was his main caretaker, but it was <em>something.</em> Tenko had happily been helping Kurogiri get used to life again for the past couple days, and Izuku could already see the improvement in his overall mood. It was as if something in Tenko that had been missing for years was finally found now that Kurogiri was here.</p>\n<p align=\"justify\">A fond smile grew on his face as he watched Tenko go on a short rant about dark oak being leagues better than normal oak and Kurogiri hum, pondering which would go better with cobblestone for their base.</p>\n<p align=\"justify\">Izuku shook his head and retreated with silent steps out of the room, smiling widely.</p>\n<p> </p>\n<p>66.</p>\n<p align=\"justify\">Using Kurogiri’s portal to drop on top of All For One might have been a bit of a power move, but it gave him the perfect opportunity to whack the villain over the head with a metal pole before he could react, and it had the added bonus of being an extremely satisfying action.</p>\n<p align=\"justify\">All For One might have been a two-century-old all-powerful supervillain, but no one was immune to some good ol’ head trauma.</p>\n<p align=\"justify\">Izuku landed lightly on his feet a decent distance away and watched as Tenko fell from another portal and proceeded to swing a metal baseball bat at All For One’s head too.</p>\n<p align=\"justify\">It was a testament to the villain’s resilience and quick thinking that he didn’t immediately pass out. Most people wouldn’t survive the first hit from Izuku, much less the second, so clearly All For One had managed to activated some quirk before the pole made contact.</p>\n<p align=\"justify\">Tenko huffed as he landed next to him, eyeing the dazed villain on the floor.</p>\n<p align=\"justify\">“How the hell is he still awake?” he questioned, frowning.</p>\n<p align=\"justify\">“An incredible reaction-time?” Izuku guessed, carefully stepping closer to kick All For One on the head when he tried to get up. Admittedly, that was for his own satisfaction. He could’ve very well used the metal pole again. “Can’t say he’ll be able to use his quirks anytime soon though. Non-mutation quirks require a lot more brain power than he currently can give.”</p>\n<p align=\"justify\">“He has mutation quirks,” Tenko reminded, scratching his neck anxiously. Izuku studied him for another moment before he turned back to the supervillain in the room.</p>\n<p align=\"justify\">They should finish this quickly.</p>\n<p align=\"justify\">Crouching down next to him, he asked, “Any last words?”</p>\n<p align=\"justify\">If All For One had eyes, Izuku was sure he’d be glaring. With no small amount of effort, the villain said, “You’re… that ghost.”</p>\n<p align=\"justify\">“Yup,” he confirmed, popping the ‘p’. Blinking, he squinted at the part of his face that wasn’t scar tissue. “Huh, mom was right, you <em>do </em>have freckles. Fancy that.”</p>\n<p align=\"justify\">By virtue of being literally next to the guy, Izuku got a full view of All For One’s expression when it morphed into one of realization and he froze.</p>\n<p align=\"justify\">“Well,” All For One said after a beat. “I can’t say I expected… you. Either of you.”</p>\n<p align=\"justify\">“We like to break expectations,” Izuku snorted. The sound of scratching intensified behind him and he sighed silently, getting to his feet in one swift motion.</p>\n<p align=\"justify\">Right, he thought as he lifted the metal pole in the air. Time to finish the Beat the Deadbeat Dad plan.</p>\n<p align=\"justify\"> </p>\n<p>67.</p>\n<p align=\"justify\">“Remind me again why we can’t just kill him?”</p>\n<p align=\"justify\">Izuku sighed, a tired thing that revealed exactly how done he was with this situation, and waved vaguely in their mountain-shaped problem’s direction. Gigantomachia, sitting cross-legged on the floor and curled up so his head wouldn’t hit the ceiling, seemed unexpectedly enthralled by Twice’s rambling.</p>\n<p align=\"justify\">For some reason, Toga had made it her mission to paint Gigantomachia’s nails a bright pink color as some sort of Welcome-to-the-Haunting event, while Spinner appeared to be questioning if he was brave enough to follow Mustard’s lead in his attempts to climb the giant’s back. The Adults (now with Kurogiri as an added force) were keeping an eye out in case anything happened but otherwise were just hanging around.</p>\n<p align=\"justify\">Dabi had taken exactly one step into the room, made eye contact with Gigantomachia, and promptly walked out.</p>\n<p align=\"justify\">Tenko dearly wished he could do the same.</p>\n<p align=\"justify\">“If you have a way to kill <em>that</em> with one hit, I would honestly love to hear it,” Izuku deadpanned. “Cause if <em>he</em> survives and gets angry, <em>we</em> won’t.”</p>\n<p align=\"justify\">“We should’ve just left him in the mountains,” Tenko muttered. “Save us the trouble.”</p>\n<p align=\"justify\">“He would’ve found out about All For One’s death and gone on a rampage eventually,” Izuku argued. “Believe it or not, this <em>is</em> the better outcome.”</p>\n<p align=\"justify\">On cue, Gigantomachia looked up at them with a wide grin and bright eyes.</p>\n<p align=\"justify\">“Little Masters!” he exclaimed, stilling his hands when Toga made a disapproving noise. Why the giant killer mountain had decided to call them <em>Little Masters </em>was beyond Tenko. He didn’t remember Gigantomachia calling him that when he was Tomura— he had always been just <em>Master’s Successor.</em> “Little Masters, don’t you want to come listen to the story too? It’s fun!”</p>\n<p align=\"justify\">“We’re good, Giga!” Izuku called back, shooting him the same smile Tenko often saw parents give their kids in the park when they wanted the little ones to leave them alone for five minutes but couldn’t exactly say that. “You keep enjoying yourself, alright?”</p>\n<p align=\"justify\">“Yes, Little Master!”</p>\n<p align=\"justify\">“Fucking hell,” Tenko whispered. “Giga? Really? The fuck did you give ‘im a nickname for?”</p>\n<p align=\"justify\">“Gigantomachia is too long. Gets tiring after a while.”</p>\n<p align=\"justify\">The implication that they’d be stuck with this mountain-sized puppy for an unspecified amount of time was almost enough to make him groan. Almost. He settled for scratching his arm instead, because accidentally catching Gigantomachia’s attention with a loud noise was the last thing he needed right now.</p>\n<p align=\"justify\"> </p>\n<p>68.</p>\n<p align=\"justify\">Izuku stared at the empty whiteboard in front of him, marker in hand and a frown on his face.</p>\n<p align=\"justify\">He <em>could</em> just write Deku again and be done with it. It had worked just fine for him the last time; it shouldn’t be any different now. Deku had been a fine hero, strong and capable and one of the main fighters in the war against Shigaraki Tomura.</p>\n<p align=\"justify\">But.</p>\n<p align=\"justify\">He wasn’t Deku anymore. Hadn’t been in a long time.</p>\n<p align=\"justify\">Deku was One For All’s ninth holder; the reckless kid who impressed the number one hero with his selflessness; the boy who made it into UA’s hero course despite all odds.</p>\n<p align=\"justify\">The hero who could do it.</p>\n<p align=\"justify\">Deku was All Might’s successor.</p>\n<p align=\"justify\">Izuku was not.</p>\n<p align=\"justify\">Izuku was Tenko’s twin and Eri’s older brother and the founder of the Haunting. He was the one who got an unlikely second chance at life, someone willing to put the lives of others over the law, someone who All Might looked at with pity rather than pride.</p>\n<p align=\"justify\">Izuku was the one who made it into UA’s hero course and got first place in the entrance exam and later on at the Sports Festival too. The one who achieved all that <em>without a quirk.</em></p>\n<p align=\"justify\">Izuku was quirkless but he was <em>alive.</em> Deku died during a war he had been too young to be fighting, killed by an archnemesis who should’ve never been.</p>\n<p align=\"justify\">Shigaraki Tomura and Deku had been victims in a fight that should have never involved them. Both of their fates had been sealed the moment they were chosen, Shigaraki by All For One and Deku by All Might.</p>\n<p align=\"justify\">(He never resented All Might for giving him One For All, not when the man couldn’t have known that All For One was alive still, not when it gave him the chance to be the hero he had always dreamed of being.</p>\n<p align=\"justify\">But, sometimes, when his aching bones wouldn’t let him sleep and the memories weighted heavy on his mind, he couldn’t help but wonder if the quirk was really necessary. If all the pain and the scars and the deaths had been worth the legacy.</p>\n<p align=\"justify\">He still didn’t have an answer for that.)</p>\n<p align=\"justify\">Both Tomura and Deku were given hope by the wrong people and that alone had led to their deaths. But Izuku (jaded, tired, <em>quirkless</em> Izuku) was the one who ended the fight and survived.</p>\n<p align=\"justify\">Deku was always meant to die a hero, fighting in the front lines so other people wouldn’t, sacrificing his heart, body, and soul for the chance to save just one more person. From the very beginning, when he desperately threw a notebook at a villain so his childhood friend would get one more breath, Deku’s survival was never a priority.</p>\n<p align=\"justify\">Deku died a hero, but Izuku planned to <em>live.</em></p>\n<p align=\"justify\">For his friends, for his family— for the mother who supported them despite her fear of losing them and the sister who was slowly healing from her trauma and the brother he never had before but had unexpectedly grown to love.</p>\n<p align=\"justify\">For himself, who was finally starting to realize how loved he was by all these people in his life.</p>\n<p align=\"justify\">Izuku would make sure he <em>lived.</em></p>\n<p align=\"justify\">Mind made up, he took the cap off the marker and started writing.</p>\n<p align=\"justify\"> </p>\n<p>69.</p>\n<p align=\"justify\">“We chose our hero names today,” Izuku said, apropos of nothing.</p>\n<p align=\"justify\">Tenko paused in his endeavor to translate Crazy Two’s ideas into a sketch they could actually work with and stared at him, eyebrow raised.</p>\n<p align=\"justify\">“You better not have chosen Deku again or I swear to god, I’m burning all your All Might posters for real,” he said, then muttered, “Fuck knows I’m long overdue on that.”</p>\n<p align=\"justify\">Izuku snorted, shaking his head.</p>\n<p align=\"justify\">“Nah. I’ve decided to take a page from your book and put my old name to rest,” he assured, waving a hand airily. “It’s been a long time since either of us were ‘Deku’ or ‘Shigaraki Tomura’ anyhow. It just didn’t feel right to keep the name, so I didn’t.”</p>\n<p align=\"justify\">“Huh,” Tenko said, for lack of a better response. Izuku was right, though Tenko hadn’t expected him to just go and say it. It felt like one of those things they silently acknowledged but ultimately never voiced— like their feelings about All For One’s death or the war. “Well? Gonna keep me in suspense or what?”</p>\n<p align=\"justify\">A cheeky grin was sent his way.</p>\n<p align=\"justify\">“Spes: The Perseverant Hero,” he announced. Tenko blinked, wondering whether he should know if that name meant something or not, but was saved from asking when Izuku elaborated. “Y’know how Elpis is the Greek goddess of hope? Well, Spes is her Roman equivalent. I want to give hope to all those kids out there that have no quirks or weak quirks, show them that anyone can be a hero regardless of genetics. I know <em>I</em> would’ve loved to be told that as a child.”</p>\n<p align=\"justify\">Tenko hummed appreciatively. It wasn’t a bad name, and disregarding his own opinion when it came to heroes, Izuku had always been good at the whole motivation deal, at giving his allies hope —in both this and their past lives.</p>\n<p align=\"justify\">He didn’t think Izuku fully understood how much he affected everyone around him.</p>\n<p align=\"justify\">“Wouldn’t you work underground though?” he questioned. “They don’t exactly have enough fame or media exposure to inspire anyone, and daylight heroics would put you at a huge disadvantage.”</p>\n<p align=\"justify\">Izuku nodded, “I thought about that, which is why I’ve decided to become a twilight hero— like Midnight! Or Sir Nighteye! They have enough PR stunts to be known by the general public and be invited to interviews, but their actual work is closer to that of an underground hero.”</p>\n<p align=\"justify\">“Ah, a middle level.”</p>\n<p align=\"justify\">“Yep!”</p>\n<p align=\"justify\">Tenko rolled his eyes at the clear enthusiasm and focused back on his work.</p>\n<p align=\"justify\">“You gonna retire Yūrei then?” he concluded logically. “Can’t imagine keeping two whole secret identities would go over very well, especially with how demanding time and health wise both are.”</p>\n<p align=\"justify\">“Well…” Izuku started, tone sheepish. “Yūrei has a freedom and reach that I wouldn’t get as just Spes, y’know? Like, a pro hero can’t just waltz in and accomplish some of the stuff <em>Yūrei</em> does…”</p>\n<p align=\"justify\">The look Tenko levelled him with was utterly unimpressed.</p>\n<p align=\"justify\">“And when, exactly, will you have time to sleep then?”</p>\n<p align=\"justify\">“I’ll make it work,” Izuku replied, a little too quick.</p>\n<p align=\"justify\">“Don’t think I’m above getting mother and Eri on your case if you don’t sleep, Midoriya Izuku.”</p>\n<p align=\"justify\">A gasp, narrowed green eyes. “You wouldn’t dare.”</p>\n<p align=\"justify\">“Please,” Tenko snorted, a grin widening on his face. “Did you forget I’m a villain? I would most certainly dare.”</p>\n<p align=\"justify\"> </p>"
}