{
  "id": "3885061",
  "url": "https://archiveofourown.org/works/3885061?view_full_work=true",
  "author": [
    "wordcouture"
  ],
  "title": "wonder",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jeongguk | Jungkook/Park Jimin",
    "Jeon Jeongguk | Jungkook & Park Jimin"
  ],
  "characters": [
    "Park Jimin (BTS)",
    "Jeon Jeongguk | Jungkook"
  ],
  "additional_tags": [
    "Alternate Universe - Apocalypse",
    "End of the World",
    "Everything is Beautiful and Everything Hurts",
    "The Author Regrets Everything",
    "everything",
    "Alternate Universe - Space Opera"
  ],
  "language": "English",
  "series": "",
  "published": "2015-05-06",
  "completed": "2015-06-17",
  "words": "7,604",
  "chapters": "2/2",
  "comments": "2,305",
  "kudos": "20,400",
  "bookmarks": "5,886",
  "hits": "945,042",
  "summary": "<p>\"You see, one loves the sunset when one is so sad.\" -- Antoine de Saint-Exupéry, The Little Prince</p>\n<p>“If you love a flower that lives on a star, it is sweet to look at the sky at night. All the stars are a-bloom with flowers...”</p>",
  "notes": "<p>oh god oh god oh god i cannot believe i just did this<br>i cannot believe<br>i just. </p>\n<p>for the jikookbloodpact; tell my parents i love them bc im DONE</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>meep. <br>i had to get it out. <br>so. there's that. <br>and really, if you haven't read the little prince, it probably wont hurt as much <br>so im not sure what you wanna do with that info LMFAO </p>\n<p>*a/n: gliese 876 is a red dwarf around which there is a super-earth and i will just leave that at that :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>im. sorry. D:</p>\n<p>this is the only time i will say this: </p>\n<p>i'm really really really really fucking sorry.</p>\n<p>twt @ ophealian</p>",
  "text": "<p>\n<em>Twinkle, twinkle, little star, how I wonder what you are</em>\n</p>\n<p>But the thing is, we don't anymore. <em>Wonder</em>, that is. We haven't for a while because science has figured out all that there is to figure out. Mankind has come too far, <em>too</em> too far, crossed too many points-of-no-return and kept on barreling through till the last bits and pieces of <em>wonder</em> were shattered. People don't wonder anymore. People don't dream. People just <em>know</em>.</p>\n<p>We <em>know</em> that there are 42, not 48, other civilizations in our galaxy; Douglas Adams must be <em>so</em> damn proud (and the Drake Equation was always more of a guestimate anyway, nowhere <em>near</em> as accurate as Science Fiction). Then again, reality has always been stranger than the mind has the capacity to imagine. Maybe that's why it stopped imagining. It got tired of being outdone.</p>\n<p>\"Jimin! C'mon! You're gonna miss the game!\"</p>\n<p>\"Shut the fuck your face, I'm coming!\" Jimin takes the steps by bounds and leaps, jumping up to tap the wooden doorframe even as he zooms through it to crash onto the old, worn couch in front of a holographic projector. Jungkook is perched right next to it, chewing on his nails. Jimin swats at him.</p>\n<p>\"Stop that.\"</p>\n<p>\"You're not my <em>mom</em>.\"</p>\n<p>Jimin quirks an eyebrow, fixing Jungkook with a look. \"Really? You wanna go there?\"</p>\n<p>\"Alright, alright, I'll stop. Wait, wait, it's starting--I swear to every single galaxy in the entire universe that if Russia takes another Championship I'm gonna stuff an entire shuttle up my ass.\"</p>\n<p>Jimin lets out a bark of a laugh and elbow Jungkook in the side, \"You sure you'd be able to fit that shuttle in? Your head's already taking up so much space in there.\"</p>\n<p>Jungkook shoves Jimin's face through the hologram and it looks like the opening shot goes right through his forehead.</p>\n<p>Zero-gravity football (<em>soccer</em> some people used to call it) is kind of outdated, but still a crowd favorite. Well, as much of a crowd as there is left. Most people have already left Earth and they can't get signals beyond Jupiter so there's literally <em>no</em> chance of the Higher Classes catching this game. Not that the Higher Classes still <em>watch</em> zero-grav football. They've probably come up with something classier and indefinitely more expensive by now.</p>\n<p>\"I used to want to be a football player,\" Jimin says, settling into the couch, reaching across Jungkook for a bag of fries.</p>\n<p>\"I thought you wanted to be a pilot.\" Jungkook doesn't even take his eyes off the game, but his fingers dig through the fry bag and he shoves a handful in his mouth. Jimin shrugs. They both hoot as Korea takes a shot.</p>\n<p>\"No <em>you</em> wanted to be a pilot,\" Jimin corrects. Jungkook pauses with another handful of fries halfway to his mouth, a tiny frown creasing his forehead.</p>\n<p>\"Oh, right, I did.\" Then he shoves the entire handful in his mouth and chews. Jimin is licking his fingers clean of the salt, smacking his lips.</p>\n<p>\"Goal!\" Jungkook punches the air and Jimin crumples up the empty fry-bag and lops it over the hologram straight into the garbage disposal. It hisses as the bag disintegrates and lets out a small puff of oxygen mist.</p>\n<p>In 22010, there isn't much that humans haven't achieved, not much that we have not conquered or destroyed. No <em>last</em> frontier of science because that was ages ago, literally. But one thing hasn't changed--things live, and things die. And well, if the Earth is a living body, then humans were the cancer that it couldn't find a cure for. And so, it's dying.</p>\n<p>But not before the universe put up a pretty good fight. How do you fight cancer? Well, radiation of course.</p>\n<p>When the first wave of gamma rays hit from Eta Carinae, people weren't ready, though they thought they were. Billions died, millions more were diagnosed with diseases that all culminated in fatalities. Plants withered, birds and animals littered the streets by the hundred thousands, what few scientists remained not so much as crossed off species from the list but ripped out entire pages and <em>burned</em> them. The world population was cut down by more than half, almost overnight, and the results were nothing short of devastating. In the years that followed, that half was once again halved by the aftershocks of the radiation, and then halved again by the fallout, reducing the world population to barely an eighth of what it used to be.</p>\n<p>Everyone thought it was finally time for humans to go.</p>\n<p>But cancer isn't that easily cured. And neither is humanity.</p>\n<p>We might call it resilience, the world might call it pestilence. Either way, the people who did survive came up with plans, answers, <em>ways</em>, as we always have, and life carried on, under clothes made to deflect gamma rays. Mechanics and scientists even developed a way to turn that radiation into usable energy and civilization thrived again.</p>\n<p><em>Up above the world so high</em>.</p>\n<p>And <em>that</em> was when we really started looking up towards the stars. That was when people started to realize that our time here really is coming to an end, and that if we don't <em>get out</em>, the world <em>will</em> die, and we would die right with it. Some people might call it a noble way to go but most people just wanted out, nobility go screw itself in the backseat.</p>\n<p>So, the World Council came up with a plan, a desperate, crazy plan, but a plan nonetheless--send 42 ships off into space, towards the known civilizations in our galaxy and hope against hope and against hope that some of them make it. Of course, there are safer civilizations, the ones that people have made contact with, weak as the radio signals were, strange as the messages were, long as it took to decode, but contact <em>was</em> made. And, given the significantly lowered population of the world, it wouldn't be a far shot from splitting what remained of the world into 42 different ships and sending them off. And that's exactly what happened.</p>\n<p>Only, it’s more complicated than that. It's always more complicated than that. How do you decide who gets to go first? Who gets to go to the \"safer\" civilizations, and who gets sent on a joyride towards the edge of our galaxy without knowing if the ship will ever reach the civilization we've never made contact with?</p>\n<p>Rewind 20 thousand years, give or take a century or so and a ship named the <em>Titanic</em> sunk to the bottom of the ocean.</p>\n<p>And, while history doesn't repeat but it sure as hell does rhyme.</p>\n<p>The rich and influential go first, go to the safest. The lesser fortunate go last. So it's been for all of humanity, and so it shall be till the end of the world's days. Literally. Oh the beauties of social hierarchy.</p>\n<p>A ship goes out about every half year or so, because that's how long it takes to recharge the power plant with enough energy to launch a ship into space far enough for it to reach wherever it needs to go; the second to last ship left about six months ago.</p>\n<p>\"Three points! We're ahead by three points!\" Jungkook is shaking Jimin by the shoulders. They're both jumping up and down on the sofa. It creaks and squeaks under their weight but it holds.</p>\n<p>\"Five more minutes and we'll end first quarter with a three point lead!\" Jimin shouts back, and sure enough, five minutes later, the pair of them are <em>tumbling</em> off the sofa, laughing and shouting. It's the first time in two whole centuries that anyone other than Russia's gotten the World Championship.</p>\n<p>\"There's a party going on at Jackson's tonight,\" Jimin says as the game breaks for commercials. They're playing old reruns of ads for outdated things--teleporters, hovercrafts, etc.</p>\n<p>\"There's <em>always</em> a party at Jackson's.\" Jungkook is rummaging around the kitchen for more snacks and comes up empty. \"We need to do some shopping.\"</p>\n<p>Jimin snorts. \"With what cash?\"</p>\n<p>Jungkook rolls his eyes. \"Who needs that when you've got the five finger discount?\"</p>\n<p>Jimin heaves a sigh. Jungkook pauses in his last sweep of the kitchen and eyes Jimin.</p>\n<p>\"Oh, c'mon, it's not like we haven't been doing this for years. Thought you would have gotten used to it by now.\"</p>\n<p>Jimin makes a noncommittal noise and slumps back into the sofa, \"Call me old-fashioned but, I dunno, stealing just doesn't sit right with me.\"</p>\n<p>\"Do we have any other choice?\" Jungkook makes his way back over to the sofa and leans his arms on the back, peering down at Jimin. His eyes are alight with something a little bit dangerous, a little bit devilish.</p>\n<p>\"Suppose not...\" Jimin glances at him and right then, Jungkook drops an apple on his face.</p>\n<p>\"Ow! Shit--! That really--hey, where'd you get an apple from?\" Jimin scrambles up, rubbing at his nose, the apple in his hand, hard and smooth and shiny.</p>\n<p>\"Guy down the street used to own an orchard--I've been taking care of a few things in there at night, you know the trees that are close enough to pull that gamma tarp over? And you said you missed fruits and stuff, so... yeah.\" He trails off at the end, scrunching his nose and scuffing his feet against the floor.</p>\n<p>\"How'd you learn how to <em>garden</em>?\" Jimin asks, eyebrows in danger of disappearing into his hairline, even as he takes a large bite of the apple and almost groans out in satisfaction. It's sweet, and crunchy, and right now, it's just about the last good thing left on this whole damn Earth, except for Jungkook of course.</p>\n<p>Jungkook waves a hand and jerks his head, motioning for Jimin to follow. They make their way through the long hallway of the abandoned house, down to the door leading to the basement. For the most part, they haven't been in there yet--it's only been a couple of weeks since they've moved in and stretching tarp over literally every inch of the roof is a tedious task, but completely necessary for ancient houses like these.</p>\n<p>The basement is damp and dark. Jungkook clicks on his pocket fuse and the room lights up with a soft, blue glow.</p>\n<p>\"Whoa...\" Jimin's eyes go wide.</p>\n<p>\"Right?\" Jungkook says, grinning as he lifts the fuse higher to cast the light about. The basement is chalk full of <em>books</em>. Encased in Plexiglas and sealed tight into boxes of transparent alloy. Books, like the ones they've only seen in museums and in holographic projectors (back when they still snuck around into public schools for lessons). Hundreds upon hundreds of books, their titles in stacked letters, some of them recognizable, others in languages long lost to the ravages of time and the ruthless pace of change.</p>\n<p>\"This one here, is on gardening. I found it the other night when you woke me up from snoring too loudly,\" Jungkook says, bending down to push open the lid of a Plexiglas’s case, pulling out a tattered volume with a bright yellow and black striped cover--<em>Gardening for Dummies</em>.</p>\n<p>\"<em>Dummies</em>?\" Jimin reads, smirking, but Jungkook makes to jab him in the side and he lowers his eyes back to the book. The pages smell like history, <em>proper</em> history, and stories. So, so many stories.</p>\n<p>\"Right here's the chapter on apple trees, and then over here... there are these fruits call 'cherries' before The First Wave. Y'know.\"</p>\n<p>\"They look yummy.\"</p>\n<p>\"Sure do,\" Jungkook says as he flips to another page, the pair of them settling down on the dust-covered basement floor, a pocket fuse between the two of them, huddled over the pages of a book that holds the stories of people from thousands of years ago.</p>\n<p>They miss the entire football game <em>and</em> Jackson's party but neither of them can remember to care anymore.</p>\n<p><em>Like a diamond in the sky</em>.</p>\n<p>Nighttime is the only time it's really safe to go outside without a thick layer of processed fabric clothing on. Nighttime usually finds Jungkook and Jimin splayed out across the roof, staring up at the stars, and tonight, it is no different.</p>\n<p>\"Which one do you think we'll go to?\" Jimin asks.</p>\n<p>\"That one,\" Jungkook says, pointing.</p>\n<p>\"Hm... that one doesn't look so great, what about that one?\" Jimin points to another one.</p>\n<p>\"What's wrong with the one I picked?\" Jungkook lets his hand fall.</p>\n<p>Jimin shrugs, \"Nothing, I just like that one better.\" His hand falls too and their palms find each other, pressing, fingers lacing.</p>\n<p>\"What if I wanted to go to the one I picked?\"</p>\n<p>\"Then I'd come with you.\"</p>\n<p>\"Even if you liked the other one better?\"</p>\n<p>\"Of course.\"</p>\n<p>Silence.</p>\n<p>Jungkook gives Jimin's fingers a squeeze, turning round to face him.</p>\n<p>\"We can go to your star.\"</p>\n<p>\"I thought you liked the other one better,\" Jimin grins, turning his head to catch Jungkook's eye.</p>\n<p>\"Nah, changed my mind.\"</p>\n<p>Jimin squeezes back. They close their eyes and doze to the sound of the wind through the air, thicker than it was before, more solid as it slides against their cheeks and their skin, pulling at their hair with its long, thin fingers, tugging right on the edges of their dreams. They fall asleep to the sound of each other's breathing--the last song the world will ever sing.</p>\n<p>Morning comes with the rare chirrup of bird-song, because humans aren't the only creatures who are resilient and Darwinism still stands, gamma radiation or not. Things learn and die and adapt, things grow and shift and become. Things seek out ever more ways to survive, to <em>live</em>.</p>\n<p>\"Wake up, c'mon, the sun's gonna be up soon and we'll burn out here if we don't get inside.\" Jungkook is tugging on Jimin's arms. Jimin stirs with a huge yawn and blinks up at Jungkook, a soft smile on his face.</p>\n<p>\"Morning.\" His voice is thick and sticky.</p>\n<p>\"Morning,\" Jungkook says, blandly as he gives Jimin's arm another tug, eyeing the horizon. It's brightening by the second and they needed to get inside quick if neither of them wanted second degree burns. The atmosphere has deteriorated so much over the past twenty thousand years that the only reason oxygen is still plentiful enough is for the thin lattice of nanofibers braided and set over the entire world to keep oxygen atoms in, but they're not designed to keep the sun's harmful rays out. That's what the clothes and the tarps are for and staying in the sun too long, even far as it is now, could be deadly.</p>\n<p>\"Alright, alright, I'm up. I'm <em>up</em>.\" Jimin climbs to his feet, gathering their quilt from beneath him, almost stumbling as Jungkook pulls him to the edge of the roof, hopping down the ladder towards the ground, jumping the last two rungs and landing with a drop and a roll. Jimin follows after, still yawning, at a decidedly slower pace, and Jungkook is tapping his feet a mile a minute, holding the back door open for Jimin when he comes through.</p>\n<p>\"So chivalrous,\" Jimin says, grinning, voice still sleepy and soft.</p>\n<p>\"I try,\" Jungkook says, rolling his eyes.</p>\n<p>Jimin sets the quilt on the sofa and curls up again, outside the sun is rising, the windows darkening over to keep the most harmful rays out. Jungkook shakes Jimin by the shoulders.</p>\n<p>\"Get <em>uppp</em>, I thought we were gonna go read today.\"</p>\n<p>Jimin mumbles something and swats at Jungkook's hand, who sighs and leans closer.</p>\n<p>\"One more time in a language I understand?\"</p>\n<p>\"You can... read... I'm gonna... sleep.\"</p>\n<p>\"Ugh,\" Jungkook lets out an exasperated groan and pushes away from the sofa. Jimin barely registers the <em>thumpthumpthump</em> of his footsteps down the stairs to the basement, or the decidedly slower thumps as he comes back up. But he does feel the weight the dip of the sofa under a decidedly heavier weight than he knows Jungkook is. Jimin peers down at Jungkook through one half-opened eyelid. Jungkook has a stack of books on his lap, the <em>Gardening for Dummies</em> propped up against the top, nose buried in it.</p>\n<p>Jimin closes his eyes, \"What's it say?\"</p>\n<p>\"I thought you wanted to sleep.\" Jungkook's voice is flat, but the hitch tells Jimin that he's gloating. He <em>loves</em> gloating.</p>\n<p>\"I do.\"</p>\n<p>\"Then why do you wanna know what it says?\"</p>\n<p>\"Curious.\"</p>\n<p>\"How're you gonna read it if you're sleeping?\"</p>\n<p>\"Read it out loud.\"</p>\n<p>\"What?\"</p>\n<p>Jimin opens one eye again, a grin slipping over his lips, \"Read it out loud. Then I'll know what it says and not have to read it myself. And I like your voice--you have a nice voice. I hear you singing in the public showers all the time.\"</p>\n<p>Jimin can't really tell if it's the morning light hitting Jungkook's face at just the right angle, or if he's just blushing too hard, but the effect is nice. Jungkook's cheeks are a soft shade of morning pink, dipping in gold as he takes a deep breath and lowers his eyes to the page.</p>\n<p>Jimin had never known so many things about cherry blossoms but he thinks that pretty as they may be, they'll never be quite as pretty as Jungkook's blush that morning.</p>\n<p>\"I've decided that cherry blossoms are my favorite flower,\" Jungkook says that night, their shoulders pressed, looking up at the night sky.</p>\n<p>\"You haven't even seen a real one before.\"</p>\n<p>\"Yeah, I know, but I saw them in that book and they're really pretty. And maybe when we get to this new planet and make friends with the people there, we can convince them to plant some.\"</p>\n<p>\"Jungkook, you know that they're extinct right? Where are you gonna get the seeds?\"</p>\n<p>Jungkook turns his head to give Jimin a look, \"You wanna tell me that we've been able to genetically engineer <em>human beings</em>, control the entire genome down to the last letter, and we won't be able to reproduce a cherry tree seed to plant on whatever planet we're gonna land on?\"</p>\n<p>Jimin huffs. \"Alright, alright. Point taken,\" and then he sighs, wistful and soft, \"think it'll be nice there? Wherever we're going?\"</p>\n<p>\"Better be--I'm trying to start the first ever zero-grav team there.\"</p>\n<p>\"All you need is a ball and a zero-grav field. That can literally be done <em>anywhere</em> in space cause <em>no gravity in space</em>, remember?\"</p>\n<p>\"Yeah, but how awesome would it be to have like, aliens versus humans games?\" Jungkook is grinning too wide.</p>\n<p>\"You're so weird--one second you're talking about planting cherry trees, the next you're talking about orchestrating zero-grav football games between two species.\" Jimin shakes his head and lets out a laugh.</p>\n<p>\"What can I say? I'm a man of many interests.\"</p>\n<p>Jimin scoffs, but it turns into another laugh and he's nodding, \"Of course you are--hey,\" he lifts his head up from the quilt and reaches around him, pulling out a book, a thin book, and flipping open the cover, digging a pocket fuse out to shine it on the pages.</p>\n<p>\"Which one's that?\" Jungkook asks, turning onto his stomach, chin resting against Jimin's shoulder.</p>\n<p>\"<em>The Little Prince</em>,\" Jimin says, pointing to a picture of a tiny blond-haired boy standing on a planet with flowers and tiny mountains.</p>\n<p>\"Is it good?\" Jungkook asks as Jimin flips to the first page. He shrugs.</p>\n<p>\"Dunno yet.\"</p>\n<p>By the time they finish, the both of them feel like their hearts are going to pump right out of their mouths and they go to sleep promising each other to always love sunrises more than sunsets. And Jimin decides that <em>this</em> is his favorite book of all time.</p>\n<p>Notices fly through every single holographic device in the entire world--the last ship is leaving in <em>two days</em>. Bring only what you need and nothing else. Supplies will be provided on the ship and partitioned after the headcount has been completed. Please check to make sure you are on the registered name list to confirm your space upon the spacecraft.</p>\n<p>\"We've confirmed, right?\" Jimin asks, peering over the top of <em>The Adventures of Sherlock Holmes</em>. Jungkook is sitting at the other end of the sofa, speeding through <em>Harry Potter and the Deathly Hallows</em>.</p>\n<p>\"Hm? Oh--yeah we have. We got the space assignments too, the same bunk bed. But I used our birth certificate names,\" Jungkook says with a sheepish grin, \"so we'll have to check in at different lines but we'll meet up back inside.\"</p>\n<p>\"Good,\" Jimin says, eyes lowering back onto the page.</p>\n<p>Two days pass in a flurry of words, faster than the flip of a page.</p>\n<p>The check in times are blocked off, mainly to keep the teleportation stations from flooding, and too many people trying to access the same end point might cause glitches in the system (<em>horrible</em> accidents in the past). Jungkook and Jimin are slotted for the last batch of people leaving.</p>\n<p>\"Orphans, <em>duh</em>,\" Jungkook says when Jimin asks why they're always last in line for everything.</p>\n<p>\"Right, right,\" Jimin says, slumping down next to him, watching the clock on the wall tick down mankind's last couple of hours on Earth. It's weirdly symbolic, that the last people on Earth would be those at the bottom of the social class, misfits and orphans.</p>\n<p>When the time finally comes, they decide to leave the books. They're heavy and not worth the weight when teleporting--might screw up the algorithm if their masses are too off and they can't use an entire teleportation ticket for just books, they only have two.</p>\n<p>\"I'll meet you inside, okay?\" Jungkook says, waving as he bounds off towards the line for the J's</p>\n<p>\"Yeah!\" Jimin heads in the other direction for the P's. The lines are long, but they move at a decent pace. Still, it's been an hour and Jimin feels like they haven't moved much at all. Something crinkles beneath his foot as he takes another step and he looks down. It's a teleportation ticket. He bends down to pick it up, smoothing the thin material over his palm. An idea clicks in his head and he grins, turning to the old man behind him.</p>\n<p>\"Could you please save this spot for me? I forgot something back home and I gotta run to get it.\"</p>\n<p>The old man nods and smiles a toothless smile. Jimin bows low, then shoots off towards the nearest teleportation stand.</p>\n<p>Jungkook finally makes it through the sea of people inside, pushing passed them all till he reaches their bunk room. It's tiny, small as a closet, with just two beds and a small light attached to the head of each bed along with the bare necessities needed for daily life. There are two sets of immaculately folded clothes laid out on the sheets. Neither of them have been touched. Jungkook bounces on his feet, looking up and down the curved hallway before he decides to change now and then go find Jimin.</p>\n<p>The mess hall is just that, a <em>mess</em> and Jungkook grabs two apples, shoving one in his pocket, popping the other one in his mouth before moving along the various tables and rotating trays, filling his arms with more food than he's had in... <em>ever</em>. He lays them all out on a table, then scans the room--no Jimin to be found. His stomach tightens, but he brushes it off. There are literally tens of thousands of people on this ship, of course he's not going to find Jimin right off the bat. It'd be nice though.</p>\n<p><em>He'll be there when we go to sleep, he loves sleep too much to skip out on that</em>, Jungkook things as he polishes off his apple and proceeds to stuff his face till he can't fill his stomach anymore. The spaceship rumbles to a start and people cheer as it finally lifts off. Jungkook takes up as much food as he can in his arms and goes back to his bunk, dumping all the food on the lower bed before climbing up the stepladder to peer into Jimin's bed.</p>\n<p>The clothes are still folded, the linens still pristine and wrinkle free.</p>\n<p>Jungkook frowns. Why hasn't Jimin changed yet? He can't enjoy being in those tattered old clothes they were wearing. Something very startling and increasingly unpleasant blooms in the back of Jungkook's mind but it <em>can't</em> be. He takes a deep breath and makes for the central commands.</p>\n<p>The cockpit is barred off by a low set of metallic strings so that the people sitting in the giant lounge can see all the happenings inside, even talk to the crew if they fancied, keep an eye on the ETA and check their progress through the galaxy. The ship has cleared the Earth's atmosphere and is slowly making its way towards Mars. When they clear the last of Jupiter's moons, and only then can they go into light-speed travel. Any time before that and the power of the ship might affect gravitational forces of the first four planets and the point is to leave a much intact as possible.</p>\n<p>\"Hey, excuse me? Uhm, did everyone make it onto this ship?\" Jungkook pulls himself up onto the raised platform of the cockpit and is greeted by a gentle-faced man with a stern smile.</p>\n<p>\"We haven't yet been able to recount the data, but that shouldn't be more than a couple minutes more. Is there someone you're looking for?\"</p>\n<p>\"Yeah, Jimin, Park Jimin,\" Jungkook says, raising his fingers to his lips as if to chew on his nails but he catches himself last second and lowers his hand back down.</p>\n<p>\"Quite a common name,\" the man says, pulling up a list of names and scrolling through them. Jungkook watches, rocking on the balls of his feet.</p>\n<p>\"Do you know how old he is?\"</p>\n<p>\"Uhm.... no? We're orphans... don't really keep track of that stuff.\"</p>\n<p>\"Ah, I'm very sorry to hear that,\" the man's voice softens along with his eyes as he lowers them back onto the scrolling list. Little green checks connected to each name and Jungkook hopes against hope that one of them is Jimin. <em>His</em> Jimin.</p>\n<p>\"Where is he from?\"</p>\n<p>\"Busan. It's a tiny little district--we're both from there--\"</p>\n<p>\"Ah yes,\" the man says, nodding as the scrolling slows and he pauses over one tiny little red x marked next to a Park Jimin, Busan. He frowns, \"It seems that he might have missed check in but I'm sure after the second round of confirmations, we'll find him. No one's missed a ship since the third one took off.\"</p>\n<p>Jungkook takes a deep breath through his nose. His heart is pounding somewhere in his temples and his fingers feel cold, his neck too hot, the space around him doesn't have enough oxygen and he feels his vision slip in and out of focus.</p>\n<p>\"Just another minute or so before the second round of confirmations come in,\" the man says, tapping the refresh button at the top right corner of his list.</p>\n<p>Jungkook closes his eyes and tries to keep still, tries to keep himself from tipping right over and falling off the edge of the raise platform. This <em>cannot</em> be happening.</p>\n<p>\"Ah...\" the man's voice does not bode well.</p>\n<p>\"<em>What</em>?\" Jungkook bites, eyes snapping open. There's still a little red x next to Jimin's name.</p>\n<p>\"It... it seems that he didn't make it onto the ship. And the final headcount did come up to one person short.\"</p>\n<p>\"What do you <em>mean</em> he didn't <em>make it onto the ship</em>?\" Jungkook's fingers curl into fists, his voice low and shaky as his mind buzzes and blanks out to a field of white, noise and heat colliding and melting till he can't think for the rush of blood behind his ears.</p>\n<p>\"He... he's not on the ship. I'm sorry.\"</p>\n<p>\"Sorry? Why are you sorry?\" Jungkook blinks and forces himself to breathe again, his mind untangling bits of logic, stringing it around his throat, pulling tight, \"we just have to turn the ship around and go get him.\"</p>\n<p>\"I'm... I'm very sorry, but we can't do that.\"</p>\n<p>\"<em>Why not</em>?\" His teeth are gritted so tight the words barely make it out coherent.</p>\n<p>\"We can't just turn back around and land the ship again--\"</p>\n<p>\"Why the <em>fuck not</em>?\" Jungkook takes a step forward and immediately, another man appears by his side, tall and broad-shouldered, placing a firm hand on Jungkook's arm.</p>\n<p>\"Please, sir, it would be wise for you to calm down.\"</p>\n<p>\"You left my friend behind! My friend is back there! On Earth, the <em>last person on Earth</em> and you <em>left</em> him there!\" Jungkook's throat aches with the words he's shouting but he almost doesn't hear them over the sound of his fear, his agitation, disbelief, every single emotion he'd never thought he'd be able to feel surging up through his arteries and bones, sizzling up and down his spine, curling around his ribcage, constricting his lungs, his throat, his heart, his heart, his <em>heart</em>.</p>\n<p>There are tears running down his face. He doesn't realize till he tastes them on his lips.</p>\n<p>\"We have to go back! My friend--my <em>best</em> friend is back there! We have to go back!\" He's trying to claw his way to the pilot's seat, as if he could somehow turn the ship around himself, but the second man has him in a vice-grip, holding him with an arm around his waist.</p>\n<p>\"We <em>can't</em>,\" the first man says, voice wavering but final in its tone, \"because it will take another six months for the launch pad to power up again, and... and\" his voice falters as he swallows--Jungkook lets out a ragged, broken sob--\"and we powered down the atmospheric lattice generators when we left. We assumed... we assumed that it would no longer be necessary, given the... circumstances. So the oxygen supply will the depleted by morning.\"</p>\n<p>\"Y-you... you turned off the...\" Jungkook's cry gets cut off in his throat.</p>\n<p>\"I'm very sorry... there's nothing we can do.\"</p>\n<p>\"<em>Fuck</em> that--<em>fuck that</em>--we're going back! I don't <em>care</em> if it takes another six months--we can all stay in this damn ship if we have to--\" he's shaking his head as if it could rid him of the truths spilling over his cheeks onto the ground, shaking his head as if it would help him clear away the myriad of memories of Jimin. Jimin and his laugh like that space between closing your eyes and falling asleep. Jimin with his hands that are so small but strong enough to knock the air out of Jungkook's chest that one time they tried to teach each other boxing from a book. Jimin with his smile like sunrise and eyes like <em>stars</em>. Like diamonds in the sky.</p>\n<p>\"He's just <em>one</em> person,\" the first man says, and he sounds like he's trying to convince himself more than anyone else, \"we can't endanger the lives of tens of thousands of people for just <em>one</em> per--\"</p>\n<p>\"But he's <em>my</em> one person--he's my <em>only</em> person...\" Jungkook's body goes slack and the arm around his waist loosens. A crowd has gathered around the cockpit, watching the entire scene unfold like some gross spectacle in a circus show.</p>\n<p>\"He's the only family I have... that I've ever had,\" he barely hears his own words over the sound of his breathing, can barely taste them over the sadness settling on his tongue, the aftertaste of a bad, bad nightmare that refuses to go away.</p>\n<p>\"Yer... not talkin' bout a little boy, bout yer age... shorter, with dem cheeks, are ya?\" An old man's stepped out of the crowd. People are murmuring and muttering, stepping back to make room.</p>\n<p>Jungkook's head snaps up and he almost falls over the edge of the platform. \"Yes! That's him! Have you seen him? Is he here? Where is he? Is he--\"</p>\n<p>\"Said he had t'go get summat he fergot at home... sounded real important n' told me t'look after his place in line fer him. Ne'er did see him come back.\" The old man shifts his hat on his head and heaves a deep sigh.</p>\n<p>\"And you just <em>let him go?</em>\" Jungkook makes to launch himself forward but the second man's strong arm finds its way around his middle again and it knocks the wind right out of him.</p>\n<p>\"We can try to make radio contact,\" the first man's voice says from behind Jungkook. It is soft, imploring, almost desperate. Try as they might, hearts are still made of soft things, tissue and blood and muscle. Things that wound easy. Things that tend to scar instead of heal. \"Would that be okay?\"</p>\n<p>Jungkook is gasping for breath that isn't there but he nods. He nods and nods and nods.</p>\n<p>After a flurry of whispers in a language Jungkook swears he doesn't know, and a mess of beeps and click and soft static, the first man speaks into a small microphone on a long cord.</p>\n<p>\"Hello? Is anyone there? Does anyone hear me?\"</p>\n<p>And then, like a piercing shard of clarity, painful enough to clear the mind, comes Jimin's voice.</p>\n<p>\"H-hello? Is someone there? Hello?\"</p>\n<p>\"Jimin! Jimin, oh fuck <em>Jimin</em>, can you hear me? Can you hear me?\" Jungkook grabs at the microphone as the man hands it to him and clutches it to his mouth like it could not only save him, but everyone else on this ship.</p>\n<p>\"We won't be able to get you on a private line because the signal is too weak,\" the man whispers, close to Jungkook's ear, \"and once we clear Jupiter's moons, we'll lose radio distance... but you have a little while.\"</p>\n<p>Jungkook nods without really hearing the words, too intent on the breaths coming from the large speakers above him. He could almost hear Jimin's heartbeat, feel it beneath his cheek as he presses his face against the cool of the wall, trying to hold down his hiccups.</p>\n<p>\"Jungkook? Oh shit--is that you?\"</p>\n<p>\"Y-yeah, it's me. What the <em>hell</em> did you go back to grab? You know you missed the ship, right?\"</p>\n<p>\"Yeah... figured that one out myself. I... I picked up a teleportation ticket on the ground and figured that... well, you said you wanted to plant cherry trees when we got to this new planet right? So... I came back to grab your gardening book.\" He sounds sheepish; Jungkook can almost see the embarrassed little smile on his face as he scratches the back of his neck.</p>\n<p>\"You went back for <em>a book</em>?\" Jungkook lets out a strangled laugh and lets his head thump back against the wall, back pressed to it, knees drawn into his chest.</p>\n<p>\"I wanted to surprise you.\"</p>\n<p>Jungkook feels tears prickling at the edges of his eyes again as he digs a small, thin book from the large pocket in his new pants. <em>The Little Prince</em>. \"Me too.\"</p>\n<p>The silence fills the room; no one is talking, all of them looking at the boy curled up against the wall, cradling the speaker to his cheek, a book resting in his lap, an entire ocean caught in his eyelashes.</p>\n<p>\"We're coming back for you,\" Jungkook says, wiping at his tears. The first man snaps around and is about to say something when Jungkook swipes his hand across his own neck a couple of times--<em>don't</em>. The man falters and keeps quiet.</p>\n<p>\"You are?\"</p>\n<p>\"Hell yeah we are. I'll pilot this damn ship myself if I have to.\"</p>\n<p>\"You've always wanted to be a pilot.\"</p>\n<p>\"I did,\" Jungkook says, a small laugh pressing passed his lips. Jimin's always remembered, even when Jungkook didn't, \"and now I am--I guess dreams really do come true.\"</p>\n<p>This time, Jimin laughs. And to Jungkook, it sounds like damnation. It sounds like salvation.</p>\n<p>\"It'll take a while though, we're pretty far out, so... you should probably get some sleep or something. You love sleep.\"</p>\n<p>\"Yeah...\"</p>\n<p>\"Jimin?\"</p>\n<p>\"Yeah?\"</p>\n<p>\"We'll... we'll be there by morning. Captain promised.\" Jungkook bites down hard on his tongue. The Captain's got a pair of in-ears in but he glances over with a sad little smile before his eyes refocus on the twenty or so screens in front of him. A momentary slip-up and everyone on this ship is a goner. Jungkook thinks that it might not be so bad right now.</p>\n<p>\"He did?\"</p>\n<p>\"Yep, he did, so you should really get some rest. You gotta wake up at the asscrack of dawn and you're shit at waking up without me.\"</p>\n<p>Jimin laughs again and Jungkook swallows, letting his eyes fall shut. \"And you better hold onto that book. We're gonna need it when we land in on the new planet.\"</p>\n<p>\"I won't lose it, I promise.\"</p>\n<p>\"Good.\"</p>\n<p>Another silence. Jungkook soaks in the sound of Jimin's breaths and wonders if he could give up his own for Jimin's. If he just held his breath long enough, he could somehow send his lost-breath through the speaker to Jimin, to keep him alive for--</p>\n<p>\"What star are you going to?\" Jimin asks, breaking the silence. His voice is fuzzy with static. The man points at a screen with a map of the solar system. The ship is closing in on the first of Jupiter's moons.</p>\n<p>\"Your star. We're going to your star,\" Jungkook says, letting his head drop between his knees to steady his breathing, \"The one you picked out that night we were on the roof.\"</p>\n<p>\"Really?\"</p>\n<p>\"Yeah, it'll be a long way there so you should--\"</p>\n<p>\"Really rest up, I know, I know,\" Jimin's voice is indulgent and it seeps into Jungkook's skin, sticking like the apple juice that slicks down your fingers when you take too big of a bite.</p>\n<p>\"Its sunset, you know,\" Jimin says after another brief break. The static is getting worse, half-syllables breaking off. Jungkook glances at the screen--halfway to the last of Jupiter's moons.</p>\n<p>\"Is it pretty?\" he asks, running a finger over the cover of <em>The Little Prince</em>, tracing the title.</p>\n<p>\"Too pretty.\"</p>\n<p>\"Sunrise is still prettier,\" Jungkook says, but he hears the choke in his own voice and has to swallow again.</p>\n<p>\"It's getting dark... and cold,\" Jimin says, and for the first time, Jungkook picks out the waver in Jimin's voice, and it isn't the static.</p>\n<p>\"You should sleep, close your eyes and sleep. You're at home, right?\"</p>\n<p>\"Y-yeah... the sofa's really big when you're not squishing me off it.\"</p>\n<p>Jungkook chuckles and curls his free hand into a fist so tight his knuckles go white, \"Well you get it all to yourself tonight.\"</p>\n<p>\"Jungkook?\"</p>\n<p>\"I'm here.\"</p>\n<p>\"I'm... I'm scared.\"</p>\n<p>\"Don't be,\" Jungkook fights and fights and fights to keep his voice steady. Three more moons. \"I'm right here, okay? Right here. Uhm...\" he casts about for something else to say, eyes settling on the large window out to the universe beyond. \"Close your eyes and try to sleep. I'll sing you a song, okay? You said you always wanted to hear me sing.\"</p>\n<p>Jimin's breath comes in a small hiccup, \"Yeah... I guess dreams really do come true.\"</p>\n<p>\"Lie down and close your eyes, okay?\" Two more moons. The crowd shifts. The old man at the front takes off his hat and presses it to his chest, eyes downcast.</p>\n<p>\"Okay.\"</p>\n<p>\"<em>Twinkle, twinkle, little star</em>--\" Jungkook lets out a tiny sob. They're passing the last moon. Jimin's voice echoes out of the static-ridden speakers--</p>\n<p>\"<em>How I wonder what you are</em>--\"</p>\n<p> </p>\n<p>There's a planet out there with a boy and a book of flowers.</p>\n<p>\"But you said that was a really long time ago.\"</p>\n<p>Jungkook glances down at the Glietian boy and reaches out a hand to ruffle his hair. It is thick and dark and feels like tendrils of a long ago night, when stars still used to paint the skies.</p>\n<p>\"It is,\" Jungkook replies, and though it has been too many Earth years, he still can't quite shake his accent. His words are rounder, softer, slurred in a way that Glietian isn't.</p>\n<p>\"Then how is he still a boy? Shouldn't be a--a...\" the Glietian boy frowns, features startlingly similar to a human's. Jungkook wonders if either of his parents were human but that's still rare, and genetic testing is at a standstill.</p>\n<p>\"Grown-up?\" Jungkook supplies with a little laugh, leaning back in his chair, his head hitting the trunk of one of his beloved cherry trees. He points up at the greenhouse ceiling, a thin sheet of shifting plasma keeping the oxygen in, the nitrogen out, projecting the universe across this particular expanse of sky.</p>\n<p>\"Yeah, one of those things.\"</p>\n<p>\"Because I don't know if he's chosen to grow up yet,\" Jungkook says, \"I sure haven't. I'm still a boy.\"</p>\n<p>The boy frowns, \"What do you mean?\"</p>\n<p>Jungkook presses a few buttons on his chair and it spins into life, wheeling over to the edge of the huge greenhouse, where an entire wall is covered in books behind carefully monitored cases as to prevent decay. He reaches in and tugs one out, a particular book, a thin book, with the picture of a little boy and a flower on the cover.</p>\n<p>\"You've read that book to us,\" the Glietian boy trills, clapping and grinning.</p>\n<p>\"It's my favorite, well no--my favorite book is with that boy on Earth.\"</p>\n<p>\"What's his name?\"</p>\n<p>Jungkook pauses, Jimin's name on his tongue like a prayer, a pearl, a perpetual promise of <em>maybe</em>, \"I forget--like I said, it was a really long time ago. But I like to think of him as the keeper of memories.\"</p>\n<p>\"Keeper of memories,\" the Glietian boy echoes, voice thrumming soft and round, trying to imitate Jungkook's accent. Jungkook flips open <em>The Little Prince</em> and points at a passage about seeing and hearts and flowers and he reads it out loud, translating as he goes. The boy stays quiet till the end and quirks his head.</p>\n<p>\"So are all these flowers for him? So he won't have to wonder if a sheep has eaten his flower? There are too many flowers for any sheep to eat here!\" and as if to illustrate, the boy waves his hands towards the massive expanse of the greenhouse, acres and acres of land, acres and acres of cherry blossoms.</p>\n<p>Jungkook laughs, \"Smart--yes. These are for him. So he can look up at the sky and see the stars a-bloom with flowers.\"</p>\n<p>\"Must be lonely, all by himself...\" the Glietian boy says, wrinkling his nose as a petal falls on it. He goes briefly cross-eyed, staring at the tiny pink thing before he shakes his head and it flutters to the ground. Jungkook heaves a sigh and nods and tries not to think (as he has done so many nights, so many days, so many weeks and months and <em>years</em>) about how small Jimin must have looked curled up on that couch, wonder if Jimin sang himself to sleep that night, with his eyes squeezed shut, pretending that it's Jungkook's voice and if Jungkook had to name one regret in his whole entire life (sans the obvious one of letting Jimin--if he had only held on--if he had--<em>if</em>--) he would say that it was not singing more when he had the chance. Not singing for Jimin when he had asked, not singing him awake and singing him asleep and singing him through the paces and prints of every single day they had together as boys. Still as boys now.</p>\n<p>\"He has my favorite book to keep him company, and if he can see it, this whole garden in the sky,\" Jungkook says, and smiles to himself. Because he has to hold onto something to keep himself sane, funny that it's the very thing driving him to what the people of old <em>would</em> have called insanity--believing, <em>deluding</em> himself into--no, <em>believing</em> that maybe, there's a chance that Jimin is still alive, and looking up and <em>wondering</em> if Jungkook is there too.</p>\n<p>\"Well if these are his flowers, then where are yours?\" the Glietian boy asks.</p>\n<p>Jungkook presses his fingers over the book in his hands, tracing the tattered outline and tries to imagine sunrise. There are two suns here, and too many moons to count, so no sunrise or sunset, as the rotation of suns and moons and so many stars it's nearly impossible to chart them. He tries to imagine a sunrise as beautiful as those on Earth and can't, and then he wonders if the sunrises themselves were beautiful, or if they were made so by the way Jimin's face would light up when they happened; he tries to remember a sunrise without Jimin by his side and can't. There are none to be remembered.</p>\n<p>\"He's my flower,\" Jungkook says, \"just the one.\"</p>\n<p>\"Oh,\" the boy says, and then recedes into silence. And then, \"Then how do you know that he's still there? That the 'sheep hasn't eaten the flower', that's what the book says, right?\"</p>\n<p>Jungkook nods and places the book back in its case, lock clicking into place with a small <em>hiss</em>.</p>\n<p>He looks back up at the makeshift sky, projected across the greenhouse ceiling and tries to imagine the universe beyond, the direction that Earth might be in, and he sighs, deep and heavy, lacing his fingers over his lap.</p>\n<p>The ground below is covered in fallen flowers.</p>\n<p>\"That's why I'm still a boy... because I wonder if my flower is still there. And like the book says, that's a kind of pain, a kind of <em>importance</em> that no grown up will ever understand.\"</p>"
}