{
  "id": "39107139",
  "url": "https://archiveofourown.org/works/39107139?view_full_work=true",
  "author": [
    "Vamillepudding"
  ],
  "title": "Family Values",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types"
  ],
  "relationships": [
    "Tim Drake & Jason Todd",
    "Tim Drake & Bruce Wayne"
  ],
  "characters": [
    "Tim Drake",
    "Jason Todd",
    "Bruce Wayne",
    "Jack Drake",
    "Janet Drake"
  ],
  "additional_tags": [
    "Bad Parents Jack and Janet Drake",
    "Child Neglect",
    "Bruce Wayne is a Good Parent",
    "Tim Drake Needs a Hug",
    "Good Sibling Jason Todd",
    "Hurt Tim Drake",
    "Angst with a Happy Ending"
  ],
  "language": "English",
  "series": "",
  "published": "2022-05-20",
  "completed": null,
  "words": "5,974",
  "chapters": "1/1",
  "comments": "189",
  "kudos": "9,674",
  "bookmarks": "1,645",
  "hits": "57,699",
  "summary": "<p>Tim knows, he just knows, that Jason is about to ruin everything. Jason is going to tell Bruce about his parents, and Bruce is going to misunderstand, and then he’ll call CPS, and Tim is going to be trapped in a group home and nobody is going to adopt him because nobody wants to adopt a fifteen-year-old, and he’s going to get into drugs and die under a bridge before he’s eighteen, and it’s all because of one stupid broken arm.</p>",
  "notes": "<p>Wrote this in 36 hours because i just had to get it out of my system. Thanks to <a href=\"https://archiveofourown.org/users/cynassa\" rel=\"nofollow\">cynassa</a> and also to the guy next to me on the train who let me take possession of the charger for the entirety of the train ride.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Tim moves into the Manor, and the next time his parents come back to Gotham, Bruce blackmails them into letting Tim stay with him officially. Jason calls it kidnapping, Bruce calls it parenting.</p>",
  "text": "<p>The beginning of the end starts when Tim breaks his arm. </p>\n<p>He doesn’t even break it on patrol. If he did, things might have been different. But he breaks it during PE, which is just embarrassing. He breaks it while getting tackled by Scott Andrews during a friendly football match, which is worse, especially because Scott seems genuinely apologetic and keeps asking if he needs anything.</p>\n<p>The only thing Tim needs right now is for the school nurse to not call his parents, but he can’t say that, so he just tells Scott it’s cool and his arm barely even hurts anymore, really, there’s no need to feel bad or do anything. </p>\n<p>It's also what he tells the nurse, who does not seem impressed while they wait for the ambulance to arrive. “They’re busy,” he says, which is true. They <em>are</em> busy. On a dig in South Africa. “I can just get a cab home from the hospital.”</p>\n<p>“I can’t let you do that. I’m very sorry, but if your parents don’t answer their phones until you’re ready to be released, the school and the hospital are going to have to act.”</p>\n<p>Shit, Tim thinks, shit, shit, shit. Okay. The chance of either of his parents checking their phones any time soon? Slim. The chance of them calling back? Practically non-existent. He needs a plan, and he needs it now.</p>\n<p>“My parents are on a business trip. They probably don’t have service right now,” he says. When backed into a corner, it’s always best to start with the truth. The nurse is frowning, but he’s just heard sirens in the distance, so he needs to be quick about this. “That’s why my uncle is watching me right now. They must have forgotten to inform the school. So you don’t have to worry about me going to the hospital on my own, because our uncle will meet me there.”</p>\n<p>The nurse is starting to look a bit more relaxed. It’s probably not because of Tim’s lying skills, but rather because she doesn’t actually want to deal with a case of criminal neglect, but, whatever. He’ll take it. “What’s your uncle’s name?” she asks, getting a notepad and a pen. “If you give me his contact details, I’ll be in touch.” </p>\n<p>“Edward Drake,” Tim says, trying not to fidget while the nurse writes this down. The sirens are getting closer, and the ambulance will be here any minute now. He needs to lock this down now, before the story can spiral out of control. </p>\n<p>The nurse pauses, her pen expectantly hovering over the paper as she waits for him to give her the phone number. Tim takes a deep breath, partly to clear his head and partly to lessen the pain in his arm. </p>\n<p>“Alright,” he says, “here it goes-“</p>\n<p>At least, he thinks later when he’s finally in the ambulance, he had enough foresight not to give her a fake. That would have been even more suspicious, and wouldn’t have helped him in any case. No, it had to be real. It also had to be someone who never answers his phone, ever. Someone who, simply by ignoring all calls out of spite, would give Tim enough time to think of a better plan. Hire an actor to play the part of Edward Drake, maybe. He’s positive he can do it. All he needs is a little bit of time. </p>\n<p>Literally all Jason needs to do is not answer his phone.</p>\n<p align=\"center\">*</p>\n<p>Jason is a busy man. He <em>is</em>. Just because he doesn’t have, like, a job, or a degree, or any prospects whatsoever, doesn’t mean he’s just sitting around all day doing nothing, no matter what Dick thinks. Besides, it’s not like Mr Drop Out is any better. </p>\n<p>“Look at me, I’m Dick and I’m so much better than you because I have a gun and a stupid uniform,” Jason mutters spitefully. </p>\n<p>“What was that, Master Jason?” Alfred asks politely. </p>\n<p>“Nothing,” Jason says and goes back to making pie crust. He’s only doing this because Alfred asked, and because Jason took the time out of his otherwise very full schedule, and also because Alfred is getting old and Jason wants him to look back on his life in a few years and realise that out of all the kids Bruce kidnapped, Jason was the only one thoughtful enough to help out with stuff like this. </p>\n<p>What he hadn’t realised when he agreed is that the pies aren’t for the Wayne family to enjoy, but rather to donate to a local pie-eating-contest that Brucie Wayne organised for good publicity after the latest sex scandal. They need thirty pies, they need them by tomorrow, and Alfred has turned from a mild-mannered gentleman into a scary military taskmaster who is going to haunt Jason in his nightmares. </p>\n<p>Finished with this pie, Jason has just moved on to the next when his phone rings. </p>\n<p>“Less dawdling, more baking,” Alfred says. “These pies aren’t going to make themselves.” </p>\n<p>Jason looks from the pies to Alfred, who does not appear amused, back to the pies. There’s <em>so many of them</em>. They’re going to be here until midnight, and it’s barely noon. </p>\n<p>Jason’s phone rings again. </p>\n<p>Fuck it. </p>\n<p>“Sorry, Alfred, gotta take this,” Jason says, wiping his hands on the apron Alfred forced on him, “could be important.”</p>\n<p>“Young sir-“</p>\n<p>“Be right back,” Jason lies and hurries out of the kitchen before Alfred can stop him. He answers the phone while he’s still in earshot, just in case anybody is eavesdropping, saying loudly and exaggeratedly: “Hello?” </p>\n<p>“This is Gotham Academy,” says the woman on the other end of the line. “Am I speaking to Mr Drake?”</p>\n<p>The No is already on the tip of Jason’s tongue, but he holds it back just in time. Gotham Academy. Mr Drake. It doesn’t take a genius to figure out that this lady wants to talk to the Replacement’s parents. Maybe he’s in <em>trouble</em>, Jason thinks gleefully. This could be the perfect blackmail material.</p>\n<p>“Yep,” he says, “that’s me. What’s Timothy done now?”</p>\n<p>The woman from Gotham Academy launches into a story that Jason only listens to enough to figure out that, sadly, Tim hasn’t done anything wrong. Something about an accident during PE, broken bones, very sorry, come to the hospital to get him, get in touch with his parents to- wait. Jason tunes back in just in time to hear that apparently, the school failed to contact Mr and Mrs Drake so far, but Tim informed them of the situation, so as long as his uncle has written permission to check Tim out of the hospital and take him home, it’s all fine. </p>\n<p>Jason’s good mood is restored instantly. </p>\n<p>“Sure, I’ll come right now,” he says, already pulling on his leather jacket. He remembers just in time that the lady on the phone said something about permission, so he scribbles down a few lines on a piece of paper he found, tugs that into his pocket and is off after telling Alfred that sadly he has to leave right now but he’s sending someone to take his place. On his way to Gotham General, he actually stops at a red light for once, taking the opportunity to text Dick that he needs to come to the manor right now, this very instance, because there’s an emergency and they might have a life or death situation on their hands. That should do it. </p>\n<p>Mr Drake, he thinks once he arrives in the hospital and has successfully bullied a nurse into telling him where the Replacement is being kept. She was clearly sceptical that an 18-year-old is both uncle and current guardian of a 15-year-old, but he must have pulled it off, because she didn’t call the cops. He still has no idea why the school called him instead of the kid’s actual uncle, but it doesn’t matter. This has the potential for a lot of jokes, so Jason is going to give it his all. At the very least, he can go check on the kid and see if he’s dead yet. </p>\n<p>Tim is sitting on the bed, his arm in a cast, ineffectively trying to tie his shoelaces with one hand when Jason comes in. Jason snorts, and Tim’s head snaps towards him. Immediately, Tim pales. “What are you doing here?”</p>\n<p>Jason holds up the shitty permission slip he wrote earlier. “Getting you out of here, apparently. What, aren’t you happy to see me, nephew?”</p>\n<p>“This isn’t funny,” Tim hisses, eyes darting around in paranoia, probably checking if someone is listening. Nobody is. This is Gotham, this hospital only has like, twenty nurses and doctors, and they’re all busy dealing with the victims of yesterday’s evil sentient flood. There is no way anybody has time to eavesdrop. “Seriously, why are you here?”</p>\n<p>“I got a call saying you needed a lift,” Jason says coldly. “Not my fault the school messed up. I’m surprised you haven’t gone crying to your actual uncle yet.”</p>\n<p>“My-“ Tim stops, frowns. Then, just like that, his face smooths out until his expression is perfectly calm, revealing nothing. “Yes,” he says, “you’re right. I’m going to call him right now. Thank you for coming by.” </p>\n<p>It’s a clear dismissal, which Jason expected. What he didn’t expect is this weird politeness. He admittedly hasn’t talked to the Replacement much since he returned from the dead a few months ago, besides, well, almost killing him that first time, but he does know that the kid isn’t this polite. Not to anybody, and especially not to Jason. </p>\n<p>The only explanation he can come up with is that Tim wants him to leave badly enough to try anything, and, well, that won’t do. </p>\n<p>“I think I’ll stay here until your uncle comes,” Jason says, flopping down on the visitor’s chair. “That cool with you?”</p>\n<p>“No.”</p>\n<p>“Well, I don’t give a shit.” </p>\n<p>Tim gives up on his shoelaces and, under Jason’s watchful eye, pulls out his phone. The screen is cracked. Tim types in the code, pulls up his list of contacts, selects one and presses the call button. Zero hesitation there, and zero indication that something is up. Suspicious. </p>\n<p>“Uncle Ed?” Tim says, ignoring the way Jason is wiping his boots on the bedding. “Yeah, it’s me. I’m in Gotham General – nothing, just a broken arm. Can you come get me? Uh-huh – okay – no problem. Alright, I’ll see you tonight.” Tim puts down the phone and says, “My uncle is busy, so I’ll just take a cab home. Can you-“</p>\n<p>And now, Tim really does hesitate. “Can you sign me out?”</p>\n<p>Jason stares at him, long and hard. Tim blinks back innocently. </p>\n<p><em>Bull. Shit.</em>, Jason thinks, but he doesn’t say so out loud. Instead, he claps Tim on his uninjured shoulder and says, “Alright-y”, and whistles obnoxiously all the way to his bike.</p>\n<p align=\"center\">*</p>\n<p>Jason is here. Tim did not plan for Jason to be here. Tim does not understand <em>why</em> Jason is here. What is he getting out of this? Is this a new form of torture? Tim knows that technically, he should be happy, because Jason did get him out of this mess, but he cannot relax, his mind stuck on all the possible nefarious reasons Jason could have for it. </p>\n<p>That being said, it takes him a while to notice that Jason is not taking them to Bristol. Tim, who is only holding on to Jason’s waist with one arm anyway, uses his cast to tap Jason on the shoulder. “Hey,” he says when Jason doesn’t react, “you’re going the wrong way.”</p>\n<p>“Nope.” </p>\n<p>“Are you kidnapping me?” Tim asks, frowning and, when Jason only laughs, decides to do the only reasonable thing here. He throws himself off the bike. </p>\n<p>Not his smartest idea, considering he has a broken arm. </p>\n<p>While he’s busy gritting his teeth and trying not to scream from the pain, he barely notices Jason pulling to a stop and coming towards him. What he does notice is Jason lightly kicking him. </p>\n<p>“Get up, moron.”</p>\n<p>Tim breathes in, out, in, and finally admits, “I think I broke my wrist.”</p>\n<p>He expects Jason to laugh, but instead, he curses. “Which one?”</p>\n<p>Tim considers this. “Right one.” He holds up his cast for emphasis, except that only jostles arm <em>and</em> wrist more, making him bite down on a whimper. </p>\n<p>“Could be worse,” Jason says, bowing down to help him up. “It’s not like you were gonna use that one anytime soon, anyway. Come on, up you go.” </p>\n<p>“I don’t want to go back to the hospital,” Tim confesses once he’s standing and leaning against Jason’s side. His mind feels sluggish, but he doesn’t think it’s a concussion. Painkillers, probably. </p>\n<p>“Yeah? How are you proposing we get your wrist fixed up, then?”</p>\n<p>“Don’t you know a guy?”</p>\n<p>“What?” Jason asks. Weirdly enough, he sounds like he’s holding back a laugh. “What guy?”</p>\n<p>“A guy,” Tim insists. “You’re a crime lord. You should know a guy.” </p>\n<p>“Alright, fine,” Jason admits. “I do know a guy. You sure you don’t just want to go back to the hospital, though? It’s not like you got this during patrol. Your parents are allowed to know, and your uncle-“</p>\n<p>“Oh my god,” Tim says, “shut up about my stupid uncle and take me to your guy before I punch something with my good hand.”  </p>\n<p>Jason refuses to try the bike again and hotwires a car instead, which he locks from the inside so that Tim can’t try another escape attempt. Not that Tim is going to. He is now fairly certain that Jason is taking him to a doctor, or at least someone who can help, even if he still doesn’t know where he’ll be taken afterwards.</p>\n<p>Maybe, he thinks hopefully, Jason will just take him home. </p>\n<p>For the hundredth time today, he checks his phone. Still nothing. </p>\n<p>Jason, picking up on this, runs over a red light and says, “What about Bruce?”</p>\n<p>“What about him?”</p>\n<p>“If your uncle really is busy, you could come back to the manor today, spend the night there.”</p>\n<p>Tim tilts his head, confused. “I can’t patrol,” he points out. </p>\n<p>Jason barely avoids running over a pedestrian, honks the car three times, flips the pedestrian the bird, yells, “Fucking move it, grandma!”, and finally says, “So? You can’t patrol, who cares?”</p>\n<p>“Bruce cares.”</p>\n<p>“Yeah, if you, like, skipped patrol for fun. But it’s not your fault your arms are like twigs.”</p>\n<p>“They’re not like <em>twigs</em>,” Tim says, offended. “They’re very muscular. I work out <em>every day</em>.”</p>\n<p>“And you still got tackled by a teenager,” Jason says, shaking his head sadly. </p>\n<p>“<em>I’m</em> a teenager!”</p>\n<p>“You sure sound like one right now,” Jason says, which doesn’t even make sense. Tim wants to cross his arms petulantly, but he can’t, because of the stupid cast and his stupid broken wrist which is probably going to get a cast of its own soon, and god, why does his life suck so much? </p>\n<p>Jason’s guy lives in a shady basement. He takes one look at Tim, clucks his tongue disapprovingly, and gets to work. “Can’t give you any painkillers,” he says while he examines Tim’s wrist, “but I probably got some heroin lying around somewhere. Want some?”</p>\n<p>“No, thank you,” Tim says politely.</p>\n<p>“Coke?”</p>\n<p>Tim looks to Jason, who shakes his head. “No, thank you,” Tim repeats. </p>\n<p>Jason’s guy resets his bone and gives him a new cast, Jason exchanges a quick manly hug and fist bump with him that Tim watches in vague disgust, but before they can get out of there, Jason suddenly tells him to wait. “Got to sign your cast!” He takes a pen and writes something on the plaster. Tim cranes his neck and sees that Jason has written SHITHEAD in capital letters. </p>\n<p>“That kind of makes it sound like that’s your signature,” Tim muses. Jason nods, accepting this criticism, and adds an arrow that points directly at Tim, who probably should have seen this coming. </p>\n<p>And then, because life has the worst timing, Tim’s phone rings just as they’re back in the car that Jason is in the process of hotwiring again. Tim glances at Jason and answers it, angling his head to the side so that Jason won’t hear the other end of the line. </p>\n<p>“Remind me – how old are you again?”</p>\n<p>“Um,” Tim says, his stomach sinking, “fifteen.”</p>\n<p>“Fifteen. You know there are other kids your age who are already in college. When <em>I</em> was fifteen, I would certainly have been able to call for a cab.”</p>\n<p>“I wanted to,” Tim protests, “but the school-“</p>\n<p>“Do you know how much we pay for your school fees each year?” his mother interrupts in a clipped voice. </p>\n<p>Tim’s stomach sinks further. “Um, a lot?”</p>\n<p>“A lot,” his mother repeats. There’s another voice, barely audible, and then his mother’s voice again, no longer addressing Tim: “He says he thinks it’s ‘a lot’.”</p>\n<p>“Sorry,” Tim mutters, but his mother isn’t listening anymore. </p>\n<p>“We pay sixteen thousand dollars a year, to give you the best education possible, and we pay it in the assumption that it’s enough for your school to not bother us about every trivial incident.”</p>\n<p>“Mom-“ Tim tries. From the periphery of his vision, he sees Jason turn to stare at him. </p>\n<p>“I suppose this is our fault,” his mother says, in a tone that makes it clear that she thinks otherwise, “for trusting you to be mature about this. Your father and I owe you an apology for overestimating you. Jack?” More mumbled voices, then: “Apologise to Tim for overestimating him.” </p>\n<p>“Mom, you don’t need to-“</p>\n<p>“Sorry, son,” his father says, apparently having taking possession of the phone, “don’t mind your mom. We’d be there if we could, but you know we can’t leave here until August.” </p>\n<p>Tim drops his gaze. It’s May. The last time he spoke to his parents, they said they’d be back in July, in time for his birthday. They <em>promised</em>. </p>\n<p>“We gotta go,” his father says, “so take care of that broken leg, and we’ll talk to you soon, okay, buddy?” There’s a click. He hasn’t even said goodbye.</p>\n<p>Jason is still staring. “Were those your <em>parents</em>?”</p>\n<p>“No,” Tim lies, but Jason takes the phone from his unresisting fingers and points accusingly at the caller ID, where it clearly says MOM. Tim deflates. “Alright, so it was my parents,” he admits. “But they’re very busy. They can’t be expected to deal with this sort of thing.”</p>\n<p>“What sort of thing, having a son?”</p>\n<p>“No! Just, you know. All the annoying bits. Like getting calls from the school or making doctor’s appointments and stuff. I’m old enough to take care of myself.”</p>\n<p>Jason’s stare is getting more intense. It makes Tim’s skin itch. “I thought your uncle was watching you,” he says. </p>\n<p>Tim rapidly nods. “He is! Today was just bad timing because he’s out of town, but he’s coming back tonight.”</p>\n<p>“Your parents didn’t mention him.”</p>\n<p>“They were probably just annoyed that the school called them instead of him.”</p>\n<p>A few seconds pass. Then, suddenly, Jason smiles a sharkish grin. Tim shudders. “Alright then, you win.”</p>\n<p>“I do?” Tim asks suspiciously.</p>\n<p>“Yep. I’m driving you back to your house, right now. And when we’re there, we can wait for your uncle together.”</p>\n<p>Tim forces a smile on his face. “That’s not necessary, I can-“</p>\n<p>“Please,” Jason says and winks, “I insist.”</p>\n<p align=\"center\">*</p>\n<p>So Bruce’s new kid is a little fucked up, no surprise there. Jason did think it was suspicious, back when he first came back and realised that this isn’t another orphan that Bruce adopted, it’s just the neighbour’s kid. Where’s the trauma, he thought, where’s the horrific backstory?<br>\nTurns out it’s right there, happening in front of Bruce’s eyes. </p>\n<p>While Jason drives them both to the Replacement’s house, he remembers that he’s been here before, one time. This was before his attack on the Tower, when he was still in the process of stalking Bruce’s new kid in order to best figure out his weaknesses. He’d watched little Timothy Drake eat cereal straight from the package, ignore all the dishes piled up high in the sink, and use the polished floors of the ballroom for skateboard practice. Somehow, it had not occurred to him that all of this might be happening without parental supervision. </p>\n<p>“Go on ahead,” he tells Tim once they arrive, “I’m just gonna have a quick smoke.” It’s not a lie, but he uses his smoking break to text Bruce: <em>Does Tim have an uncle?</em> </p>\n<p>Bruce’s reply is instantaneous. <em>No</em>.</p>\n<p>Jason nods to himself and texts back: <em>Who’s watching Tim while his parents are out of town?<br>\n</em></p>\n<p>This time the reply takes longer. <em>The housekeeper, I assume. Why?<br>\n</em></p>\n<p>Jason replies <em>nvm lol </em>and follows Tim into the house. He comes to a stop in the kitchen, where on a large calendar every Tuesday and Thursday is highlighted in yellow. Every yellow box reads MRS MAC. Twice a week, then. </p>\n<p>The picture is starting to get clearer. </p>\n<p>Tim is nowhere in sight, so Jason rummages around in the fridge for some ingredients that he can use to make a quick dinner, only to find that the fridge is empty save for two dozen cans of Red Bull and the remnants of a takeout meal that must have been a curry once upon a time. </p>\n<p><em>Does Tim eat at the manor?</em> He texts Bruce. </p>\n<p>Instead of texting back, Bruce calls him. </p>\n<p>Jason doesn’t answer. He doesn’t have time for the old man’s paranoia. He has to deal with his own paranoia first. “Timtam,” he calls out, “come here this minute or I’m burning the place down.”</p>\n<p>He counts the seconds in his head, reaching all the way to twenty-seven before Tim comes running into the kitchen on socked feet, nearly slipping but catching himself on the counter in the last minute. </p>\n<p>“What?”</p>\n<p>“Pack a bag and get your coat,” Jason orders. “We’re going to the Manor.”</p>\n<p>Tim attempts to cross his arms, only to wince when he is forcibly reminded of the cast. “No, we’re not. You promised we’d wait for my uncle.”</p>\n<p>Jason sighs. “Tim, you don’t have an uncle.”</p>\n<p>The doorbell rings. </p>\n<p>Tim lights up. “I’ll go!” He’s disappeared before Jason can catch him, and by the time Jason has made his way into the front hall, there’s a strange man standing there, trapping Tim in a firm hug. Tim’s look is one of triumph. “Jason, meet Uncle Eddie.”</p>\n<p>“Hi,” Uncle Eddie says, giving Jason a little wave. “Hey, aren’t you Brucie Wayne’s kid? Can I get an autograph?”</p>\n<p>“That’s your uncle,” Jason says flatly. Tim nods. “Bullshit,” Jason hisses, pointing an accusing finger at him. “No way.”</p>\n<p>Uncle Eddie releases Tim from his hold and says, “Hey, man, no need to be so aggressive about it. Take a chill pill.”</p>\n<p>“What the <em>hell</em> did you just say to me?”</p>\n<p>“Jason!” Tim says and, after a quick glance to his left, adds, “Uncle Eddie, stop it. Why don’t you, um, go to your room?”</p>\n<p>“What room?” Uncle Eddie asks.</p>\n<p>“Your room,” Tim says pointedly. “The guest room, where you always stay when you’re watching me. That room.”</p>\n<p>“Right, that room,” Uncle Eddie says, salutes them, and walks into what Jason, thanks to all his stalking, knows to be a supply closet. </p>\n<p>Jason’s phone rings; it’s Bruce again. </p>\n<p>“Aren’t you going to answer that?” Tim asks, eyes darting nervously between Jason and the closed closet door. No doubt that the second Jason is distracted, Tim, having realised the jig is up, is going to bolt. </p>\n<p>Jason takes his still-ringing phone and, looking Tim dead in the eye, drops it in the trashcan. </p>\n<p>It keeps ringing. </p>\n<p>“Um,” Tim says, “was that, like, meant to do anything? Because I think all you managed to do is crack your screen.”</p>\n<p>Jason takes the phone out, throws it on the ground, and stomps on it. The ringing stops. </p>\n<p>“Now,” he says coldly, “you can pack a bag and come willingly, or I can knock you unconscious and carry you. What’s it going to be?”</p>\n<p>“But my uncle-“</p>\n<p>“Tim.” </p>\n<p>Tim is the first to look away, dropping his gaze to inspect his shoes. “What’s going to happen in the Manor?” he mutters. </p>\n<p>Jason frowns at him. “You’re going to tell Bruce that your parents suck, you’re going to have a dinner that’s not made of caffeine or mold, and then you’re going to bed early because you’re injured and you’ve been on your feet all day.”</p>\n<p>“No, but- my arm.”</p>\n<p>“Yeah,” Jason says, uncomprehending, “I know. I just said-“</p>\n<p>“No!” Tim lifts his arm with the cast, beginning to look frustrated. “I won’t be able to do <em>anything</em> for at least a month. I can’t even write, because I’m right-handed.” </p>\n<p>“Yeah? So? If you’re that worried about being bored, I’ll rec you some good movies later.” </p>\n<p>“Jason,” Tim says, and, oh, he sounds serious. “You’re not listening. I’m useless like this. It’s already hard enough being Robin when you’re right there all the time, but there is no way Bruce is going to let me keep it after this. The only thing that’s going to happen in the Manor is that I’ll be kicked out.”</p>\n<p>A few seconds pass, then a few more. Jason has understood every word, but his brain is somehow not computing. Because if he heard right, then, god, the Replacement is more messed up than he thought. Where does Bruce <em>find</em> these kids?</p>\n<p>“Fine,” Jason says eventually. “Don’t pack a bag then. But you’re coming with me, and if I’m right, which I literally always am, then you’re the one who will have to come all the way back here later just to get your shit. Now get that idiot out of the closet and let’s go.”</p>\n<p align=\"center\">*</p>\n<p>Tim has literally never been this nervous. He’s so anxious he wants to throw up, and that feeling isn’t helped by the fact that when they enter the Manor – without ringing the doorbell, they just walked in like criminals –, there is the overwhelming smell of pie everywhere.<br>\nThere are voices drifting out of the kitchen, Alfred’s dry tone and Dick’s excitement unmistakable. There is also – oh no – Bruce’s deep rumble, followed now by an offended: “Don’t <em>touch</em> that!”</p>\n<p>“Oh, shit,” Jason says, and Tim barely has time to wonder why he, too, suddenly looks queasy, but then they enter the kitchen – the kitchen with what appears to be several dozen pies –, and Alfred, hands on his hips, disapproval radiating off him in waves, says, “Master Jason, I’d thought you had quote-unquote ‘an emergency’.”</p>\n<p>“Tim,” Dick says happily, shoving past Alfred to trap Tim in a firm hug, “did you come to help us out? We really need it. I’ve never been this sweaty in my life.” When he pulls back, Tim’s shirt is both wet and covered in flour. </p>\n<p>Bruce, because he’s Bruce, has had his eyes firmly fixed on Tim ever since he came in, and he now asks, “What happened to your arm?”</p>\n<p>Tim flinches. Jason wraps an arm around his shoulders and says, “Timbo fell victim to the horrors of PE.”</p>\n<p>“What did the doctor say? Did you get an X-Ray? Do you have their contact information? I’m calling them,” Bruce says, already standing up. He bumps into a pie in the process, which promptly falls to the floor with a big, sad splash. Bruce looks contrite. </p>\n<p>For the past few hours Tim has been half-convinced that Jason has been having some sort of mental break, and that theory only gets strengthened now. Instead of laughing like a maniac at Bruce like he normally would, Jason barely glances at the now-ruined pie. He has a determined look on his face. Tim knows, he just knows, that Jason is about to ruin everything. Jason is going to tell Bruce about his parents, and Bruce is going to misunderstand, and then he’ll call CPS and it’s going to be horrible because without Robin, Tim literally has nothing else going on in his life, and he’s going to be trapped in a group home and nobody is going to adopt him because nobody wants to adopt a fifteen-year-old, and he’s going to get into drugs and die under a bridge before he’s eighteen, and it’s all because of one stupid broken arm.</p>\n<p>“Bruce, I have to tell you something,” Jason says. Tim’s breath hitches. Any second now, he thinks.</p>\n<p>But Bruce isn’t watching Jason. He’s still watching Tim. </p>\n<p>“Tim,” he says, quiet but firm, “come with me. Let’s have a talk in my office.”</p>\n<p>“Bruce,” Jason protests, “you don’t have all the facts, you can’t just-“</p>\n<p>Bruce holds up a hand. “Not now, Jason,” he says. “Not before I haven’t talked to Tim.”</p>\n<p>“But-“</p>\n<p>“Enough,” Bruce says, sharp enough that Jason falls quiet. “Tim?”</p>\n<p>“Yes, sir,” Tim says, hurrying to follow Bruce. It’s okay, he tells himself. He knew this was going to happen. It’s better this way, even. Bruce won’t have to waste time on hearing Tim’s sob story about being so privileged that he literally has an entire house to himself, because Tim is just not going to tell him. They can part amiably, at least.</p>\n<p>Bruce actually has two offices, one for official Wayne Enterprises business and one for private family matters. He leads Tim into the one for family now, and Tim can’t help but feel slightly touched by that fact. </p>\n<p>He waits until they’ve sat down, Bruce behind his desk, Tim on one of the leather chairs in front of it, but before Bruce can say anything, Tim speaks first. Quick, he thinks, like ripping off a band-aid. “I need to clear out my locker in the Cave, but that’s it. All my case files are up to date, so you should be able to follow those notes easily. I can be out of here in twenty- no, thirty minutes,” he corrects, thinking of his bandaged arm. It’s better to be thought of as slow than to set unreasonable expectations from the start. Still, there is one thing – “Do you think maybe I could come over every once in a while? Not long enough to be a bother, you don’t even have to be here. I just think it would be kind of cool to talk to Dick and Jason sometimes.”</p>\n<p>“Tim,” Bruce says, causing Tim to fall silent. “I want you to know that I respect your privacy, which is why before today, I have not looked at your file more than necessary. However, due to some worrying texts I have received earlier today, I decided to do a little research.”</p>\n<p>A little research, Tim thinks. Oh no. No, no, no, no-</p>\n<p>“These are the facts,” Bruce says, still calm, his massive palms spread openly out on the desk like he wants to show Tim that he has nothing to hide. “Your parents are currently in South Africa. Your housekeeper comes twice a week while you’re in school, a gardening service comes once a month to take care of the grounds. You have no other relatives besides a great-aunt, who is currently in a nursing home in Minnesota. Every day, the only person in that house is you. Have I missed something?”</p>\n<p>Tim looks down at his hands and shakes his head. “You weren’t supposed to notice,” he mutters. “I only became Robin to help you get better. You had enough to worry about, I didn’t want to add to that.” </p>\n<p>“A noble intention at the time,” Bruce says lightly. “And what about now? Do you still think I have enough to worry about now?”</p>\n<p>Tim hesitates, takes a moment to really think about it. Dick’s and Bruce’s relationship is mostly recovered. Jason has returned from the dead, and while he still fights with Bruce on a regular basis, it's obvious to Tim that this, too, is just a matter of time. There are no major crises right now, no alien invasions, and Bruce has so much time on his hands right now that he went golfing with Clark last week. Objectively, this is probably the least worried Bruce has been in years.</p>\n<p>But that still doesn’t mean Tim is Bruce’s problem. </p>\n<p>Bruce must take Tim’s silence as answer enough, because he smiles, though it looks pained more than anything. “I’m sorry,” he says, and that simple sentence is enough to make Tim stare at him, wide-eyed. “I’m sorry that I made you think that you couldn’t come to me with your troubles. You can always come to me, Tim. Always.”</p>\n<p>“Does this mean,” Tim asks, immediately focusing on the only thing that matters, “that I can be Robin again once my arm is healed?”</p>\n<p>“Yes,” Bruce says, simply, just like that, like Tim hasn’t gone numb in relief at that one word. “But that’s not what I wanted to talk to you about. There is no good way to say this, so I’m just going to say it anyway. I want you to move into the Manor.”</p>\n<p>And that – that doesn’t make sense.</p>\n<p>“But I’m not an orphan,” Tim blurts out. He feels like he can’t not say it. Maybe Bruce forgot about this. Maybe Bruce has him confused with someone else. </p>\n<p>But Bruce merely smiles again. “I’m aware. But you’re an unsupervised minor, and you should have someone to watch out for you.”</p>\n<p>“I do,” Tim says. “My parents-“ But Bruce already knows about his parents. “My uncle-“ But Bruce already knows that he has no other relatives. “I can take care of myself.” There. He’s found his angle. Bruce appreciates self-sufficiency, and surely if he wants Tim to stay Robin, this is the most convenient route for both of them. </p>\n<p>“I know you can, but-“</p>\n<p>“Then why can’t you just let it go?” Tim snaps, louder than he meant to. “I come over for patrol and go home afterwards, and it’s worked out like this for both of us. I always knew you didn’t want another son, that you just needed a Robin and nothing else, and I never tried to be anything but that. So if you don’t mind waiting for me to heal before I can patrol again, what’s the problem? Why are you suddenly pretending to care?”</p>\n<p>Bruce looks <em>gutted</em>. “I do care. I’m sorry that I let you believe that I don’t. I want you as Robin, yes, but even if you told me you would never do another patrol again, I’d still want you here. Not as Robin, but as someone I care about. Which is why,” he says, taking Tim’s hands over the desk, “I want you to move in. I want all my family to be close by.”</p>\n<p>\n<em>All my family.</em>\n</p>\n<p>Tim’s heart skips a beat, only to start up again with increased force. It’s beating so hard in his chest that he thinks Bruce must be able to hear it, and if he can’t, then he must at least notice the tears that have gathered in Tim’s eyes. </p>\n<p>“You don’t have to say anything,” Bruce tells him. “Not right now. What do you say we go back downstairs and watch your big brothers’ ill-advised attempts at making pies?”</p>\n<p>Tim, his throat choked up, manages a nod. </p>\n<p>“Oh, I nearly forgot,” Bruce says, just as Tim is about to leave the office. “I have one more question. Listen carefully, because it’s of the utmost importance.” When Tim turns around, his stomach in knots, Bruce is holding up a pen. “May I sign your cast?”</p>\n<p>Tim smiles so widely that he thinks his cheeks must split apart.</p>\n<p align=\"center\">*</p>\n<p>When Tim finally goes back to school three days later, the SHITHEAD and the arrow are surrounded by three names, a dozen of stickers, and a clumsily drawn bat. Tim has never liked anything more.</p>"
}