{
  "id": "39402249",
  "url": "https://archiveofourown.org/works/39402249?view_full_work=true",
  "author": [
    "randomascas"
  ],
  "title": "chelsea",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Stranger Things (TV 2016)"
  ],
  "relationships": [
    "Steve Harrington/Eddie Munson",
    "Robin Buckley/Nancy Wheeler",
    "Robin Buckley & Steve Harrington",
    "Robin Buckley & Eddie Munson"
  ],
  "characters": [
    "Steve Harrington",
    "Eddie Munson",
    "Robin Buckley",
    "Nancy Wheeler",
    "The Party (Stranger Things)"
  ],
  "additional_tags": [
    "Hurt/Comfort",
    "Fluff and Angst",
    "Sexuality Crisis",
    "Bisexual Steve Harrington",
    "Infection",
    "Drinking & Talking",
    "Tipsy Eddie Munson",
    "the handcuffs on eddie's wall get a special mention",
    "Mild Gore",
    "Sexual Humor",
    "Backstory",
    "Blink And You Miss It Slash",
    "Minor Character Death in Backstory",
    "Trailer Park Kid Stuff",
    "Gay Eddie Munson",
    "Doctor/Patient",
    "In a camp way",
    "Wish Fulfillment",
    "Everyone Is Gay",
    "Title from a Phoebe Bridgers Song"
  ],
  "language": "English",
  "series": "",
  "published": "2022-06-03",
  "completed": "2022-06-22",
  "words": "17,733",
  "chapters": "10/10",
  "comments": "262",
  "kudos": "6,126",
  "bookmarks": "823",
  "hits": "76,598",
  "summary": "<p>“Well, I didn’t think you were a good dude until about two days ago.” Eddie’s still watching Steve, studying the flutter of his eyelashes, the casual way his head turns. Noting the intensity in Steve’s eyes as they lock with Eddie’s.<br>“And now?”<br>“And now you’re lying in my bed listening to me spill my deepest, darkest secrets,” Eddie finishes.</p>\n<p>***</p>\n<p>Steve's wounds are infected. Eddie's the only one who knows how to heal him. Add into the equation a bottle of strong vodka, subtract Steve's shirt, and Eddie's lips get a bit too loose for his own liking. (Or, Eddie gets a tragic backstory and flirts with Steve. Steve flirts back.)</p>",
  "notes": "<p>Happy Pride Month besties! Title's a reference to Phoebe Bridgers, and kinda-sorta the Sex Pistols. During this, keep your eyes peeled for a lil It by Stephen King reference, and those handcuffs on Eddie's wall.</p>\n<p>Finally a small warning before we begin: there are mentions of the AIDS crisis - these are rather abstract, and have little to no relationship with queerness in the story. Still, though, I understand that this topic is heavy and I want you to know that it's touched on.</p>\n<p>ask and ye shall receive.</p>\n<p>also notice the fic name change! i wanted to keep using lyrics from the song so i decided to change the name to the song itself. \"chelsea\" in my mind is a steddie song not because they'd relate to it (thank god) but because steve would be a phoebe bridgers fan and eddie would tolerate it because it's about sid and nancy.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>okay i hope y'all liked it! let me know if you guys want another part with our boys being stupid in their feels and maybe possibly a ronance chapter or somethin? idk. tell me all the thoughts on this one because i live on validation. love you guys!</p>\n<p>SO a few notes: this is a bit of a filler because i did not intend for this to be more than a one shot and WOW was i scrambling for material but we're bridging the gap to some incredibly angsty and gooey romance shit so just... indulge me one more time with this little eddie and robin being pals segue.</p>\n<p>little historical note - ACT UP (AIDS Coalition to Unleash Power) was a huge player in turning the tide of the AIDS crisis. they advocated for increased research and access to approved medicine, as well as changes to legislation and public policies to support people with aids. (they also still exist!) at the time this fic technically takes place, ACT UP had yet to be founded. that being said, i've heard a lot of people finding that there's very little discussion about and education on ACT UP in younger queer circles, so i wanted to include the detail of eddie's handmade patch for a little callback. please ignore my blatant disrespect for timelines.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>so do you want nancy and robin's side of things first or steve and eddie's? let me know!!!</p>\n<p>so... ronance came first. But never fear I literally wrote the steddie chapter at the same time so that will be posted within... twenty minutes. And I expect hype on both of them, thank you. (she said sarcastically)</p>\n<p>if these chapters need editing my apologies, i'm driving out to d.c. for the march for our lives tomorrow and wanted to get these up!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>there. after having to explain how gay these two are in a wafflehouse the other day, i finally got it down on paper. tell me what you want to see next because this is four chapter past its due date but its still a preemptive fix-it fic and unlike the duffers i'm here for fan service.</p>\n<p>N E WAY i gotta be up in three hours so leave me some comments to read when i get up :)</p>\n<p>yo the f slur is in here but in a \"eddie uses it about himself and no one else and not in a negative way\" bc we reclaim that shit thanks.</p>\n<p>everything else tho is roughly PG-13 relationship fluff because I can and I will and ur honor I love my boys.</p>\n<p>ALSO ALSO ALSO</p>\n<p>fluffy note at the end i just needed to put that bit in first :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">more notes</a>.)\n</p>\n<p>istg i'm convinced some of you are bots because you're all too damn sweet. literally, everyone who's said stuff about how this is your favorite steddie fic and stuff - ur cruel liars but also keep it up bc at least it's motivating me to write more!</p>\n<p>and if u aren't boldly lying and have hollywood connections... dear duffer brothers let me work on your show with you pls i would absolutely die if you did and i have a resume ready to go for you.</p>\n<p>all far-fetched dreams aside i really appreciate all of your comments and i get so excited when i see them. thank you all so much.</p>\n<p>we're slowly navigating back to some plot. y'all comments r too sweet, n i love you all very dearly. i also apologize because i've seen a bunch of cute steddie trope lists on tumblr but not a single goddamn one of them has been in this entire fic and that's just disappointing!!!</p>\n<p>also if you haven't noticed, i'm going in a poorly focused POV cycle of Eddie, Steve, Robin, Nancy. i may edit later to change some of the ronance chapter names because chelsea is a very steddie song and i feel like ICU fits ronance a lot better. and i'm on tumblr and insta and can drop those handles if you are perhaps interested. i feel like there was something else i was supposed to say but i don't remember ahhhh so enjoy this shit</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>oh that's what i was supposed to say: karen's out of character. oh well.</p>\n<p>alright i am debating if i end this before the big final supernatural fight or not. would y'all rather see something just based on eddie's relationship with the law rn or something that involves Vecna? let me know!</p>\n<p>also in this chapter i totally talk about season two like i remember season two well enough to talk about it. whoops.</p>\n<p>penultimate chapter i think! but don't worry i'm gonna tie everything up nicely here n then i'm working on a new college AU for the fruity four that will include similar amounts of fluff and angst bc i can't help myself. stick around here a little longer and i'll probably post a preview for some of the upcoming content :)</p>\n<p>n e way here's some massive wish fulfillment that a couple of you called! and a bit of historical inaccuracies (AZT trials would've most likely started quite a bit after Eddie's mom died, but still we're going with it.) Enjoy!</p>\n<p>this is it babes. the last little update. the last ride. thank you for all coming on this weird and not at all planned journey with me, and i hope you have a bit more angst in you.</p>\n<p>stick around for the end for a tiny sneak peak of my newest fic, a modern college AU with too much angst to function. i'm obsessed with it and i hope you will be too.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>okay, here it is: a tiny sneak piece of my next work \"listen to iron maiden, baby\"</p>\n<p>Steve’s mixtape “come by the ud whore” from rebel robin<br>Love You So Bad, Ezra Furman<br>Welcome to Paradise, Green Day<br>Chapstick, Coin<br>Cocaine Jesus, rainbow kitten surprise<br>I’m In Your Mind, King Gizzard &amp; The Lizard Wizard</p>\n<p>****</p>\n<p>“As far as I’m concerned, I got seven years left on this planet, so…” Eddie takes a drag, “Why not?”<br>Steve is acutely aware of the tattoos that cover his arm and the battle vest he totes unapologetically. It declares things like “fuck the patriarchy” and “pride's still a riot” and “it's Revenge of the Jedi,” all while proudly keeping the boy’s lean biceps free from everything but his shitty band t-shirt.<br>Steve shoves a cigarette between his lips and shrugs. “Why seven years?”<br>“Twenty-Seven Club, baby.”</p>",
  "text": "<p>\n<span>They’re preparing the weapons in Eddie’s trailer when he notices it. Steve’s borrowing one of his t-shirts from the Hellfire Club from Eddie’s junior year. It’s already a bit small on Eddie, and it pulls tight now across Steve’s chest and stomach. And as they prepare for the impending battle, Eddie can’t even focus on the fact that </span>\n<em>\n<span>there’s an impending battle</span>\n</em>\n<span>. Mostly because Steve should not look good in a remnant of the worst year of Eddie’s life.</span>\n</p>\n<p>\n<span>But also kind of because the way Steve sticks his tongue through his teeth just a bit every time the fabric hits his stomach a certain way. His wounds should be healing by now: it’s been two days since the upside down. Something about the way he reacts, though, to the shift of soft, well-worn fabric worries Eddie to no end.</span>\n</p>\n<p>\n<span>So when Nancy suggests someone stay with Eddie while they go get dinner, he requests Steve.</span>\n</p>\n<p>\n<span>“He’s hurt,” Eddie says.</span>\n</p>\n<p>\n<span>“I’m fine.”</span>\n</p>\n<p>\n<em>\n<span>Jesus, Harrington.</span>\n</em>\n<span> “And, I, uh, actually wanted some advice anyway.” He glances at Robin, because </span>\n<em>\n<span>isn’t that what straight boys do</span>\n</em>\n<span>. She’s watching Nancy, thank god.</span>\n</p>\n<p>\n<span>Steve’s not: he’s staring straight at Eddie, like he’s trying to decode him. God, Eddie hopes he doesn’t get too far in that process.</span>\n</p>\n<p>\n<span>Finally, Nancy lets up. And Eddie’s a bit relieved, because if she dedicated any more brain power to her ex, her brain might explode. Not that Vecna isn’t trying to do that already, but </span>\n<em>\n<span>come on, Nance,</span>\n</em>\n<span> he wants to scream. It was Robin who figured out your favorite song; not your ex. Eddie wonders if Vecna tormented Nancy about being queer while she was gone, or if she hasn’t addressed it yet. She should get on that, with how Robin watches her.</span>\n</p>\n<p>\n<span>When they’re gone, Steve finally breaks the silence. “Look man, if you’re gonna ask about Robin, quit while you’re ahead. You’re really not her… um… type.”</span>\n</p>\n<p>\n<span>Oh, so Steve knows. Maybe that makes things a little bit easier, then.</span>\n</p>\n<p>\n<span>Or maybe Eddie just wants Steve to call him a fucking freak like everyone else. Maybe the inevitable rejection would hurt less.</span>\n</p>\n<p>\n<span>“She’s not mine,” Eddie says, and he hopes to </span>\n<em>\n<span>God</span>\n</em>\n<span> Steve figures it out. From the useless look on his face, it isn’t clicking. So he moves on. “I just said that so you’d stay. Because, look, you’re clearly in a lot of pain right now. And I know you wanna play brave for everyone else, but trust me, I am the last person who wants that right now.”</span>\n</p>\n<p>\n<span>Steve frowns. “I’m fine.”</span>\n</p>\n<p>\n<span>“You aren’t.”</span>\n</p>\n<p>\n<span>“I’m…” Steve stops, and exhales. He looks at his feet. “Yeah. No. I think it might be infected.”</span>\n</p>\n<p>\n<span>Eddie’s lived in a trailer park most of his life, and if he learned one thing, it’s how to pull together back-alley cures for every ailment. Back when he lived two doors down with his parents, he used to help her mom take care of the kids on the block when they got hurt, or sick. Back then, he thought he’d be a doctor one day.</span>\n</p>\n<p>\n<span>Now, he reflects briefly on his life while he digs through his uncle's liquor cabinet for a specific cheap vodka in a specific plastic bottle.</span>\n</p>\n<p>\n<span>“Take your shirt off, and get on my bed,” Eddie calls. He wishes to god that came in another context.</span>\n</p>\n<p>\n<span>And that’s the reason why, when he’s on his feet, and back in the room, his jaw almost drops. Because Steve isn’t sitting on his bed — he’s laying shirtless, on his back, with his head propped up on his arm. His muscles are tense, and he’s a bit sweaty.</span>\n</p>\n<p>\n<span>He has a fever, Eddie realizes. And his attention snaps away from sex-god Steve Harrington and focuses in on the wounds at his side.</span>\n</p>\n<p>\n<span>They’re a nasty shade of yellow and red, surrounded by every shade of green and blue and purple. They’re infected for sure, and Eddie isn’t even sure where to start.</span>\n</p>\n<p>\n<span>“This is gonna hurt.” That sounds like as good a place as any.</span>\n</p>\n<p>\n<span>He moves to Steve’s side, the one by the edge of his bed, so he doesn’t have to climb onto the bed with him just yet. He gets down on his knees, and as he uncaps the bottle, Steve asks, “Are you sure you know what you’re doing?”</span>\n</p>\n<p>\n<span>Eddie glances up at him. “I’ve done this before, promise.” Yet another line Eddie would do anything to say on his knees to Steve in another very specific context.</span>\n</p>\n<p>\n<span>“You sure?” And Eddie can hear it now, hear how terrified Steve is.</span>\n</p>\n<p>\n<span>So, he does what his mom always did, when kids were scared: he tells a story. “My mom was a nurse. When I was growing up, well, a lot of families around here can't afford hospitals, or prescription medicine. On her days off, she did what she could with what we had to help out around here. So growing up, I did this a lot. Do you know how many kids don’t realize you have to wash the scraps on your knees?” Eddie suddenly pours the alcohol onto Steve’s wound. Steve screams, and tenses. He claws at Eddie with one hand, writhing from the intense burn. And Eddie rolls just out of the way, expertly capping the bottle before anything spills. Because Eddie has done this. A lot.</span>\n</p>\n<p>\n<span>After a moment, Steve leans back on the bed and moans, “Holy fuck.” He looks like a wreck on Eddie’s bed, and Eddie literally has to look away – it’s a lot to handle without just </span>\n<em>\n<span>imploding</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Did that hurt?” Eddie asks, trying to mask the fact that he cannot breathe. Steve throws something at Eddie—Eddie’s only stuffed animal, a teddy bear—in response.</span>\n</p>\n<p>\n<span>“Never again, Munson.”</span>\n</p>\n<p>\n<span>Eddie finally manages his composure, and glances up. “We still have one more round of this, Harrington.”</span>\n</p>\n<p>\n<span>“Oh, Jesus. I’m gonna need some of that, then.”</span>\n</p>\n<p>\n<span>“You don’t want this shit. It’s, like, half Everclear, half the cheapest shit they sell.”</span>\n</p>\n<p>\n<span>“Yeah? Trust me, after that, I do.”</span>\n</p>\n<p>\n<span>Eddie hesitates, then says, “I’ll drink to that.”</span>\n</p>\n<p>\n<span>Steve pats the bed next to him weakly. “Let’s get drunk, Eds.”</span>\n</p>\n<p>\n<span>Eds? They’d circle back to that later. Eddie slowly circles around the bed, crawling up next to Steve but, like, in a </span>\n<em>\n<span>chill bro way</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>He hands the bottle off to Steve, who doesn’t even hesitate before tossing back quite a bit of the liquor. Eddie’s almost in awe. He lets Steve hold the bottle a moment longer, before taking it himself.</span>\n</p>\n<p>\n<span>And in a flash, he dumps just enough on Steve’s other wound. Steve tries to punch Eddie this time, but Eddie just pushes him down into the bed. His hand fans out across Steve’s bare, shaggy chest for only a moment too long. Eddie decides it’s the pain that’s making Steve’s heart beat so fast.</span>\n</p>\n<p>\n<span>“What the fuck Munson?” Steve won’t look Eddie in the eyes, just averting his glare lower.</span>\n</p>\n<p>\n<span>“I’ll drink to that,” Eddie mumbles. He rolls back onto the bed, and tosses back some of the vodka himself. Unlike Steve, he coughs, loudly, and lurches forward. “Fuck, that’s fucking disgusting.”</span>\n</p>\n<p>\n<span>“You get used to it,” Steve says, still wincing. Eddie offers him more, and he gladly accepts it.</span>\n</p>\n<p>\n<span>A little while later, Eddie feels properly smashed. Maybe it’s the liquor on an empty stomach, or the boy lying next to him in the full size bed, but his body feels fake. Like it might betray him.</span>\n</p>\n<p>\n<span>“What happened to your mom?” Steve asks quietly, his voice heavy with liquor and exhaustion and a little bit of sweetness Eddie hasn’t heard before.</span>\n</p>\n<p>\n<span>“Huh?”</span>\n</p>\n<p>\n<span>“I mean, what happened to her?”</span>\n</p>\n<p>\n<span>“Oh.” Perhaps it wasn’t his body that would betray him, but his words. “Well…” He tries to think up the words. It was supposed to be a routine blood transfusion. It was supposed to just be anemia.</span>\n</p>\n<p>\n<span>It was supposed to be her </span>\n<em>\n<span>son</span>\n</em>\n<span> who got it first, because he was the freak.</span>\n</p>\n<p>\n<span>“She died,” Eddie says. Because everyone knows she died. Because clearly that’s not the answer Steve wants.</span>\n</p>\n<p>\n<span>“How?”</span>\n</p>\n<p>\n<span>And now Eddie folds. “She had </span>\n<em>\n<span>it</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<em>\n<span>It</span>\n</em>\n<span>, the reason he never goes home with random guys from the crowds at shows. </span>\n<em>\n<span>It</span>\n</em>\n<span>, the word whispered in the hallways around Hawkins, attached to insult after homophobic insult. </span>\n<em>\n<span>It</span>\n</em>\n<span>, the disease that never should’ve been Eddie’s alone to deal with, before the media and the politicians and the small-minded people in his hometown got ahold of it.</span>\n</p>\n<p>\n<span>Eddie waits for Steve to respond.</span>\n</p>\n<p>\n<span>“Oh.” He just says. And then he adds, “I’m really sorry. Is that why you…”</span>\n</p>\n<p>\n<span>“I what?” Eddie says it too quickly. Maybe he was wrong about Steve. Maybe he doesn’t know about Robin after all. Maybe he’s an ass like the rest of them.</span>\n</p>\n<p>\n<span>“You stopped being Hawkins’ freaky genius kid?”</span>\n</p>\n<p>\n<span>And now it’s Eddie’s turn to say, “Oh.” Because how would he have known Steve remembered that, once upon a time, Eddie was going places. </span>\n<em>\n<span>Eddie</span>\n</em>\n<span> barely does anymore.</span>\n</p>\n<p>\n<span>“That was you, right? I remember being jealous of you, when they moved you straight from our seventh grade class to high school. I couldn’t wait to run with all the older kids, and you just… Did.”</span>\n</p>\n<p>\n<span>“Yeah, well, it’s hard to graduate when your mom’s dying of… dying. Or when your dad disowns you. Or when you’re accused of murder.”</span>\n</p>\n<p>\n<span>“Your dad disowned you?”</span>\n</p>\n<p>\n<span>Eddie reaches out, and takes the bottle back from Steve. He takes a swig; Steve was right, he is getting used to it. And now, it’s now or never. Eddie doesn’t know if he should say what he’s about to, but he does.</span>\n</p>\n<p>\n<span>“Yeah, well… My dad found out I was gay. I found out he was religious.” Steve doesn’t say anything, and Eddie doesn’t have it in him to look at him. He takes another draw of vodka, and continues on. “My uncle didn’t give a shit. His sister died because people were too busy hating on gay guys to focus on what mattered, so he took me in. Everyone at school already called me a freak, so nothing my dad said changed that. But there’s something about being told to pack your bags because you had a crush on Andy Felps—“</span>\n</p>\n<p>\n<span>“Andy Felps?“ Steve says slowly. Eddie gulps.</span>\n</p>\n<p>\n<span>“Yeah, Andy Felps.”</span>\n</p>\n<p>\n<span>Steve bubbles for a moment, stuttering over a set of syllables that Eddie can barely make out. Finally, he manages, “But he’s so… I’m </span>\n<em>\n<span>so much cooler</span>\n</em>\n<span> than him.”</span>\n</p>\n<p>\n<span>Eddie doesn’t even know how to respond at first, so he says the only drunk thing that pops into his mind. “Are you jealous, Harrington?”</span>\n</p>\n<p>\n<span>“Yes.” Eddie immediately looks at Steve, and his intense proximity gives him the perfect vantage point from which to watch Steve’s eyes widen. “I mean, no! I mean… I guess I just think you should’ve had a crush on me and not… Andy Felps.”</span>\n</p>\n<p>\n<span>And for once, Eddie isn’t convinced that Steve’s straight. In fact, the panic on his face is so much closer to the kind Eddie experienced back when he </span>\n<em>\n<span>did like</span>\n</em>\n<span> Andy.</span>\n</p>\n<p>\n<span>“Well, I didn’t think you were a good dude until about two days ago.” Eddie’s still watching him, studying the flutter of his eyelashes, the casual way his head turns. Noting the intensity in Steve’s eyes as they lock with Eddie’s.</span>\n</p>\n<p>\n<span>“And now?”</span>\n</p>\n<p>\n<span>“And now you’re lying in my bed listening to me spill my deepest, darkest secrets,” Eddie finishes. Steve grins drunkenly.</span>\n</p>\n<p>\n<span>He blinks, once, and then looks back to the ceiling. Eddie doesn’t think he’s imagining that Steve shifts a bit closer.</span>\n</p>\n<p>\n<span>“We should, um, bandage you up.” Eddie gulps, overwhelmed by the sensation of Steve’s body heat. “But the right way, this time. Not with your ex’s t-shirt, or whatever.”</span>\n</p>\n<p>\n<span>“Yeah, yeah. We… yeah.”</span>\n</p>\n<p>\n<span>“Um. Just stay here, and I’ll grab the stuff from out front.” Pouring honey on Steve Harrington’s body would absolutely be too much to handle normally. Just to make it extra fun, Eddie grabs his handcuffs from the wall on the way back in.</span>\n</p>\n<p>\n<span>“So you don’t hit me this time,” Eddie says, as he tosses them to Steve. Steve looks sufficiently nervous now.</span>\n</p>\n<p>\n<span>“What’re you doing this time?” He asks, but Eddie watches as he dutifully puts on the handcuffs. </span>\n<em>\n<span>Good boy</span>\n</em>\n<span>, Eddie thinks. And then he blushes and looks away.</span>\n</p>\n<p>\n<span>“Honey does a really good job of dressing wounds,” Eddie whispers, as he places one knee down on the thin layer of mattress between Steve and his side. “I’m gonna go ahead and kind of cover your cuts in the them, before I get you all wrapped up, okay?”</span>\n</p>\n<p>\n<span>Steve watches Eddie’s every move as he fills the deep, messy cuts with honey, pooling on as much as he can of the thick golden syrup. Then, he shifts his knee between Steve’s legs. Steve gulps, but still he watches Eddie’s face. Maybe he’s waiting for Eddie to betray himself here. Eddie slowly slides the bandages under Steve’s back, catching some of the drizzled honey before it hits the mess of sheets beneath them. Eddie begins wrapping them around Steve’s toned, smooth torso, trying hard to not hyperfixate on the way Steve flexes when Eddie’s calloused fingers brush against his skin. And then he’s done, and still perched with half his body between Steve’s legs.</span>\n</p>\n<p>\n<span>The front door opens, and, shockingly, Steve stays put until Nancy calls to them from the kitchen, proclaiming burgers and fries. Eddie shoves whatever shirt he can grab off the floor (a Sex Pistols shirt that Eddie cut the sleeves off of) in Steve’s direction, and heads into the kitchen. On the way down the hall, he swaps their medicinal vodka for a different, much tastier bottle of cheap vodka.</span>\n</p>\n<p>\n<span>“Did you get the slushies?” Eddie asks. Nancy points to the counter next to her, as she and Robin dole out burgers (and a grilled cheese for Max).</span>\n</p>\n<p>\n<span>“Where’s Steve?” Robin asks. She gives Eddie a quick head-nod in Nancy’s direction as he goes to put a little vodka in each slushy. A warning, Eddie thinks. He quickly dumps what he can in, and caps the bottle.</span>\n</p>\n<p>\n<span>“Bedroom. We bandaged him up again.” Then, Eddie hip-bumps Nancy. “Your shirt wasn’t totally doing it, Princess.” She laughs, thank </span>\n<em>\n<span>God</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Yeah, well, it got us through the Upside Down, didn’t it?”</span>\n</p>\n<p>\n<span>Before Eddie can respond with something snippy, Steve stumbles into the kitchen. His hair’s a wreck, and Eddie desperately just wants to pull on it.</span>\n</p>\n<p>\n<span>“What are you wearing?” Robin asks. Steve doesn’t say anything. Instead, he takes one of the slushies and heads out the door. The slam of aluminum on aluminum shakes the room.</span>\n</p>\n<p>\n<span>Everything silent, except for the quiet sound of “Running up that Hill” on Max’s walkman. Robin locks eyes with Eddie, and a silent understanding passes between them. She frowns.</span>\n</p>\n<p>\n<span>Nancy moves to follow him, but Robin stops her. “I got this,” She promises, and Eddie trusts that she does. She soundlessly slips out the door after Steve.</span>\n</p>\n<p>\n<span>Steve Harrington is sitting on the steps alone when it finally hits him, why he's sitting out on the steps alone. There’s more vodka in his slushie, the slushie</span>\n<em>\n<span> Eddie made for him</span>\n</em>\n<span>, and he gulps it down. Because Steve is scared. And he’s scared of the fact that he’s scared. And he’s scared that fear and guilt is exactly what </span>\n<em>\n<span>the brain-melting monster</span>\n</em>\n<span> that is coming for all of them feeds off of.</span>\n</p>\n<p>\n<span>Maybe his dad was right: he really should’ve gotten his ass out of Hawkins for college. But there’s part of Steve that wonders if he can ever truly leave Hawkins behind; if the red dust in the dirt will always be stuck to his sweat when the temperature rises above 80 wherever he goes; if the mysteries and the nail-studded baseball bats and the boys in the trailer park will haunt him his whole life long.</span>\n</p>\n<p>\n<span>The door to the trailer swings open, nearly hitting Steve. Another part of Hawkins he could never leave tramps out onto the steps with him.</span>\n</p>\n<p>\n<span>“Hey, drama queen,” Robin says, dropping down next to him. “You gonna talk about the show you put on in there, or should I just keep making jokes about how ridiculous your outfit is?”</span>\n</p>\n<p>\n<span>Steve just presses his forehead into her shoulder. He doesn’t even realize he’s crying until the tears press into his skin, and soak through the thin fabric of her thrift store jacket. Robin instinctively wraps her arm around him, pulling him into her. She presses her lips to his hair, and even now, Steve wishes it could’ve been her.</span>\n</p>\n<p>\n<span>How easy would’ve been to make a life with his best friend? His better half? The only person he knows who manages to keep him enthralled in talks about movies and music and marching band drama? But they’d never quite clicked romantically even before he knew about her, and Robin coming out entirely cemented it. She was his soulmate, but not in that bullshit Nora Ephron way. And all this time, he was convinced it was because of her, because she just wasn’t made that way. </span>\n</p>\n<p>\n<span>Now, he’s having a lot of fantasies about a pair of shitty toy handcuffs and wondering if maybe it’d been his fault all along.</span>\n</p>\n<p>\n<span>“Talk to me, Stevo,” Robin whispers. He laughs just a bit, mostly just exhaling air onto her shoulder and smiling into it. But it fades quickly. And then the tears come back.</span>\n</p>\n<p>\n<span>“Rob, I…” He takes a breath, and then he says it. “I’m scared.”</span>\n</p>\n<p>\n<span>And Steve sends out a prayer to every God he knows, hoping that Robin loves him the way he loves her. Hoping that that’s all it takes to clue her in. Hoping that, after a year, he doesn’t have to say anything else. Because he can’t. Because he doesn’t even know where to begin.</span>\n</p>\n<p>\n<span>Her hand squeezes his shoulder. “I had Ms. Castler for homeroom in fifth grade,” She whispers, “And she sat me next to Liz Fender one day. Oh, god, I thought I was going to combust. I just… I wanted so desperately to be friends with her. I wanted to braid her curly brown hair, and talk to her about the Star Wars pin she always wore, and be in her friend group of cool nerdy girls. And so I did it. I forced my way into her friend group day by day, homeroom class by homeroom class.” She takes a sip of Steve’s drink, and coughs. “Gross.” He takes it out of her hand, and takes a sip, forehead still glued to her shoulder. She runs a soft hand through his hair.</span>\n</p>\n<p>\n<span>“Anyway, she invited me over to her house, one night, for this big sleepover she was having. And I was so nervous. Not because I wasn’t friends with these girls or anything, but because they were the kind of girls who got Baby-Alives and Easy Bake Ovens for Christmas and always had new shoes on the first day of school. Way outside of my tax bracket.</span>\n</p>\n<p>\n<span>“But then we were sitting in the basement, the six of us, and Dana Cole asked everyone if they thought Tommy H was cute.” Steve finally breaks away from Robin, the look on his face one of understanding and a little bit of disgust. “Yeah, yeah. I know, Tommy fuckin’ H. But I didn’t even know we were supposed to like boys yet,” She says, her voice suddenly cracking. “And everyone went around talking about who they liked and why and… And I realized I liked Liz. Like actually liked Liz. I didn’t even know that was a possibility until that moment.”</span>\n</p>\n<p>\n<span>Steve brushes his face with the back of his hand, and then pushes off the steps. He’s pacing, now, his hand folded behind his head. His sides scream, but it helps to numb his brain just a bit, like the vodka. “I don’t know what’s happening, Robin.”</span>\n</p>\n<p>\n<span>In one swoop, she’s off the patio, and blocking his path. “Look at me.” Steve’s hands drop to his side, and she takes them slowly. “Tell me about what you’re feeling.”</span>\n</p>\n<p>\n<span>“I can’t.”</span>\n</p>\n<p>\n<span>“Remember how I thought you would hate me if you knew the truth? I was wrong, then. And you’re wrong now. </span>\n<em>\n<span>You can talk to me</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>Steve sighs, and his shoulders sag. He doesn’t recognize his words as he speaks them, but they flow out of him like they’ve been there forever. “While you guys were gone, Eddie fixed me up. And we talked. And I just kept thinking about how nice it would be to press into him and disappear for a while.” The fear in his voice breaks for just a moment with the joy that accompanies his thought. “I’m so tired, Rob. And confused. I just… want to go back to that moment, in his bed, and never have to leave it.”</span>\n</p>\n<p>\n<span>“Steve… You like Eddie, don’t you?”</span>\n</p>\n<p>\n<span>And now the tears are back, and Steve is shaking his head. His grip tightens on Robin, like he’s so scared she’ll float away. He bites his lip, hard, and looks at the ground. “I can’t. I can’t.”</span>\n</p>\n<p>\n<span>“Hey–”</span>\n</p>\n<p>\n<span>“Robin, I </span>\n<em>\n<span>can’t</span>\n</em>\n<span>.” Suddenly, he lets go of Robin’s hands, and the dam breaks. Every thought Steve has had in the last hour – or maybe it’s been days, weeks, </span>\n<em>\n<span>whole lifetimes</span>\n</em>\n<span> – comes pouring out. “I loved Nancy. </span>\n<em>\n<span>I know I loved Nancy</span>\n</em>\n<span>. And I loved you, so much that for about a month the words </span>\n<em>\n<span>just friends</span>\n</em>\n<span> made my chest </span>\n<em>\n<span>hurt</span>\n</em>\n<span>. And I have kissed almost every girl who I went to high school with, and I had sex with maybe half of them–”</span>\n</p>\n<p>\n<span>“Gross.”</span>\n</p>\n<p>\n<span>“--And I have paused </span>\n<em>\n<span>Fast Times</span>\n</em>\n<span> at </span>\n<em>\n<span>53 minutes and 5 seconds</span>\n</em>\n<span>! So how come I can’t get the thought of Eddie fucking Munson’s hands and his hair and his smile and his fucking </span>\n<em>\n<span>dead mom</span>\n</em>\n<span> out of my brain no matter how fucking hard I try? I can’t be… I can’t be </span>\n<em>\n<span>this</span>\n</em>\n<span>.” His hands are in his hair, and he rips through it, making a mess of it. Everything feels hot and tight and terrifying.</span>\n</p>\n<p>\n<span>Robin rests a hand on his chest. “Steve. It’s scary as hell. I know. I mean, look at me. I’m falling hard for a girl and I don’t think I can ever tell her how I feel because I can’t risk it.”</span>\n</p>\n<p>\n<span>“Vickie likes boobies,” Steve mumbles, despite himself. Robin grimaces.</span>\n</p>\n<p>\n<span>“Right. Yeah. Vickie. That’s who I…” She taps her fist on his chest, and looks away. “It hurts, a lot of the time. And it’s fucking hard. But there’s also a big beautiful world out there where you and Eddie can be happy and normal and stay in that bed all day with no one bothering you.”</span>\n</p>\n<p>\n<span>Steve shakes his head. “Robin, I like girls. I have always liked girls. I’m not gay. I don’t… I can’t like guys.” His face is white, and strained, and he looks like he’s trying not to cry again.</span>\n</p>\n<p>\n<span>But Robin’s just smiling at him, with the smile Robin reserves only for Steve.</span>\n</p>\n<p>\n<span>“Steve Harrington, is this sexuality crisis because you don’t think you are capable of liking girls and guys?”</span>\n</p>\n<p>\n<span>He shrinks, just a bit. Just like Robin knows Steve does when people uncomplicate the things he makes so complicated for himself. “I mean… Part of it, yeah.” Because not all of it is, but he doesn’t know how to quantify the part of it that </span>\n<em>\n<span>isn’t</span>\n</em>\n<span>. He doesn’t know how to explain that his heart starts beating all too fast when Eddie smiles both because Eddie has the perfect smile and because Eddie </span>\n<em>\n<span>shouldn’t have</span>\n</em>\n<span> the perfect smile. But Robin knows Steve, and Steve knows Robin knows Steve, and so Steve knows Robin knows what he means by </span>\n<em>\n<span>part of it</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Bisexuality exists,” Robin says. It’s the explanation Steve needs, but doesn’t entirely understand. He blinks, and her smile grows a bit wider. Because Steve also knows Robin loves explaining things she’s passionate about. “Plenty of people like guys and girls alike,” Robin continues. “You can do that, ya know.”</span>\n</p>\n<p>\n<span>“You… what?”</span>\n</p>\n<p>\n<span>“I did not spend a three months listening to David Bowie every time we drove to work for you to not know about bisexuality.”</span>\n</p>\n<p>\n<span>“David Bowie likes guys?”</span>\n</p>\n<p>\n<span>“Jesus!” Robin presses the palm of hand to her face, but she’s laughing. Soon, Steve is too.</span>\n</p>\n<p>\n<span>“I am nothing like David Bowie,” Steve says, and then Robin’s laughing even harder.</span>\n</p>\n<p>\n<span>“Yeah, because David Bowie can sing!”</span>\n</p>\n<p>\n<span>“Wait, no one ever said </span>\n<em>\n<span>that</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“Steve.”</span>\n</p>\n<p>\n<span>“I can sing!”</span>\n</p>\n<p>\n<span>“And so can Tammy Thompson!”</span>\n</p>\n<p>\n<span>“No, okay, that is just offensive. Do you really think I can’t sing?”</span>\n</p>\n<p>\n<span>“You’ve driven me to work and school since August. </span>\n<em>\n<span>I know you can’t sing.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>Steve opens his mouth to protest, and then closes his mouth. He grins. “I-“ Steve begins, standing up to her challenge, “I will be king.”</span>\n</p>\n<p>\n<span>“No, no, no!” Robin shrieks, and covers her face with her hands.</span>\n</p>\n<p>\n<span>“And you, you will be queen.” Steve gives her a little mock bow, and offers her a hand. Despite herself, and Steve’s god awful singing, she takes it. He spins her around. “Though nothing will drive them away-”</span>\n</p>\n<p>\n<span>“We can be heroes,” She joins in, “Just for one day.” And then he pulls her into a hug. It’s the kind that feels like it has to last forever, or else the world might cave in and the sun might explode and you might have a terrifyingly major sexuality crisis about a boy with long messy hair.</span>\n</p>\n<p>\n<span>“I really like him, Rob,” He whispers into her shoulder.</span>\n</p>\n<p>\n<span>“I know.”</span>\n</p>\n<p>\n<span>“And it’s fucking terrifying.”</span>\n</p>\n<p>\n<span>“I know. But that’s the thing about feelings: they’re kind of supposed to be terrifying.”</span>\n</p>\n<p>\n<span>He sighs. “I really thought I was going crazy there.”</span>\n</p>\n<p>\n<span>She steps back, breaking the earth-shattering, all important hug. “Yeah, because you’re a bonehead!”</span>\n</p>\n<p>\n<span>“You are ruining the moment here.”</span>\n</p>\n<p>\n<span>“Whatever, dingus.”</span>\n</p>\n<p>\n<span>After a few more minutes, Robin reminds Steve that Mickey's burgers always get gummy if they sit too long. He wipes his eyes a few more times, even though they still burn from the tears. It’s not that he feels better: there’s still a part of him standing on the basketball court, listening to every manner of slur hurled at him. But now there’s the part of him that remembers being swim team captain</span>\n<em>\n<span>.</span>\n</em>\n<span> And how no one gave a shit when he and his teammates checked each other out in their speed-os. (Steve’s starting to realize that maybe that wasn’t entirely straight behavior of any of them.)</span>\n</p>\n<p>\n<span>“Maybe one day life’ll be like swim team,” Steve says to Robin as they head back up the steps. He can feel himself trying to rationalize it now, like the day he went to Nancy with flowers and the day he decided not to go to community college and the day he realized the monsters under the bed were real. But he knows all of that worked out for the best, and something about that is comforting.</span>\n</p>\n<p>\n<span>Robin just stares at him. Then she says, “I think I’m in love with your ex-girlfriend.”</span>\n</p>\n<p>\n<span>Steve blinks, and turns towards her. “I’m sorry, what?”</span>\n</p>\n<p>\n<span>“Oh, I thought we were just saying whatever boneheaded dumb idea shit came to mind. Sorry about that.” She opens the trailer door, and Steve knows their conversation has to end there.</span>\n</p>\n<p>\n<span>So, he says, “Rob, we’ll discuss this later.”</span>\n</p>\n<p>\n<span>“Okay, Dad.”</span>\n</p>\n<p>\n<span>“Is everything okay?” Nancy asks. And all at once, Steve realizes he’s over her.</span>\n</p>\n<p>\n<span>Steve looks past her to Eddie, and instantly sees the pain that floods his features. After all the shit he’s been unpacking, he didn’t even think about how Eddie felt. But it’s clear, now, that this situation hurt him just as much as it hurt Steve. And Steve knows for sure, then, that he likes guys too, because he just wants to run to Eddie and throw his arms around him. He just wants to make sure Eddie knows that he is loved and safe, that he’ll never be a freak.</span>\n</p>\n<p>\n<span>Instead he just forces on the biggest smile he can and says, “Yeah, just had to talk through some stuff. Did you guys get my double bacon boy?”</span>\n</p>\n<p>\n<span>The air in the Upside Down is heavy with pollen and sexual tension and Robin is more than over it. She doesn’t even want to be back here, especially not when she has to watch Nancy try to flirt with Steve. She should’ve expected Nancy Wheeler to still be in love with him: every girl she’s ever liked chose</span>\n<em>\n<span> him</span>\n</em>\n<span>. Even Liz Fender did at the cursed sleepover.</span>\n</p>\n<p>\n<em>\n<span>At least everyone's back in their appropriate boxes</span>\n</em>\n<span>, She thinks, as she and Eddie walk shoulder to shoulder. The freaks are finally together. Only, unlike what most of the basketball players think, the “freak” label does not have the same one-size-fits-all quality as “popular.” Case-in-point: Robin and Eddie have next to nothing in common. Except, she hopes, </span>\n<em>\n<span>Steve</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Gross,” Robin says, trying to break the awkward silence filled with watching the worst kind of straightness. Eddie gives her a side eye.</span>\n</p>\n<p>\n<span>“I think it’s kind of cute. Like… soulmate shit”</span>\n</p>\n<p>\n<span>“She has a boyfriend,” Robin snaps. Okay, she definitely needs to reign in her feelings. “And anyway, Steve’s not into her.”</span>\n</p>\n<p>\n<span>“He was.”</span>\n</p>\n<p>\n<span>“Like a year ago!” </span>\n<em>\n<span>Your gay is showing</span>\n</em>\n<span>, Robin thinks.</span>\n</p>\n<p>\n<span>Eddie just smiles, and looks down. “So, you and Steve–”</span>\n</p>\n<p>\n<span>“–Are just friends,” Robin cuts in. Because that’s always the second question people ask, after they try to establish why Robin and Steve are friends. From where they are standing, Robin figures Eddie kind of figured out what brought them together.</span>\n</p>\n<p>\n<span>Eddie exhales a little laugh, and Robin doesn’t have to look at him to picture his face right now. “No, I know. Henderson complains about it like, </span>\n<em>\n<span>all the time</span>\n</em>\n<span>.” Robin nods, because she’s experienced plenty of Dustin’s “Steve and Robin” rants. She usually tells him that she’s into older men, or hates hairspray, or is into older men who hate hairspray. “I was gonna ask if you guys are like… Best friends, I guess.”</span>\n</p>\n<p>\n<span>Robin hesitates. She wants to tell him she thinks Steve might be her soulmate in a solely platonic-with-a-capital-P sense, but she isn’t sure Steve feels the same way. What she is sure of is that he has feelings for </span>\n<em>\n<span>Eddie</span>\n</em>\n<span>, which means she definitely can’t claim to be Steve’s soulmate to </span>\n<em>\n<span>Eddie</span>\n</em>\n<span>. “Yeah, something like that.”</span>\n</p>\n<p>\n<span>“That’s not vague at all.” Right then, Nancy laughs at something Steve says. Robin visibly cringes. Eddie fully turns to Robin now. “Okay, do you think you might be overreacting now?”</span>\n</p>\n<p>\n<span>Overreacting? No. Eddie just doesn’t entirely know what she’s reacting to. Or, maybe, he does. She can’t help but notice the little “ACT UP” that he’s stitched into his vest, and even though it’s a new definition to the words, she wonders if it’s really truly the reference she thinks it is. If he’s who she thinks he might be.</span>\n</p>\n<p>\n<span>If “freak” really is more one-size-fits-all than she thought. “Eddie, are you gay?”</span>\n</p>\n<p>\n<span>He stops walking. Actually stops moving. Robin reluctantly stops too, and turns around so she can look at him.</span>\n</p>\n<p>\n<span>He sizes her up, once, and his fingers lightly brush the little ACT UP embroidery. “Robin, </span>\n<em>\n<span>are you gay</span>\n</em>\n<span>?” Robin breath catches in her throat. Because she can tell, from the smallest bit of fear in his eyes. It’s a silent understanding.</span>\n</p>\n<p>\n<span>“Cool,” She whispers.</span>\n</p>\n<p>\n<span>“Cool.” They start walking again, this time a little closer than before. Then, Eddie hip-bumps Robin. She’s started to realize he’s the kind of person who likes to hip-bump people, if that’s the kind of thing you can notice about people.  “Do you like Nancy?” He asks.</span>\n</p>\n<p>\n<span>It’s Robin’s turn to freeze. She half-feels like she’s sitting on that movie theater bathroom floor all over again. Maybe it's the nausea that Steve warned her the pollen might cause. Or maybe it’s the fact that how she answers changes everything.</span>\n</p>\n<p>\n<span>So, she doesn’t answer. Instead, she says, “Do you like Steve?”</span>\n</p>\n<p>\n<span>Unlike before, there’s no fear this time. Instead, Eddie just grins widely. There’s something boyish about it, unlike so many of the smiles she’s seen him offer to the rest of the party in the last week. Robin doesn’t know if that makes her happy or sad.</span>\n</p>\n<p>\n<span>“Cool,” He says, after a moment.</span>\n</p>\n<p>\n<span>“Cool.”</span>\n</p>\n<p>\n<span>And then they’re walking again, and Robin has half the mind to ask where they’re going, but this is the one time she trusts Steve with no argument. He’s been playing at this game a lot longer than she has, and no one seems to be better at it than him. Instead, she says, “You should go for it, you know.”</span>\n</p>\n<p>\n<span>“Huh?”</span>\n</p>\n<p>\n<span>“Steve. You should go for it.”</span>\n</p>\n<p>\n<span>“No way, Han. That’s like… Uh…”</span>\n</p>\n<p>\n<span>“Lancelot going for Guinevere?”</span>\n</p>\n<p>\n<span>“Right!” His voice cracks, and Robin realizes that he’s </span>\n<em>\n<span>nervous</span>\n</em>\n<span>. Of course he’s nervous. Of course that’s why he’s convinced Steve’s in love with Nancy, when in reality Steve won’t shut up about </span>\n<em>\n<span>Eddie and his fucking handcuffs</span>\n</em>\n<span>. “He’s clearly practically taken, and I should honor those wishes because it’s clearly not meant to be and, um…”</span>\n</p>\n<p>\n<span>“Lancelot and Guinevere ended up together, Eds.” He huffs, and Robin can’t help but laugh a little bit. “Don’t worry, Dustin’s filled me and Steve in on your inability to pass an English class many a-time.” She tries her best to keep the laugh going as she speaks, but part of her suddenly remembers that, once upon a time, Eddie was gonna be the kid who got out. He was the super genius; now, he’s stuck in Hawkins, just like the rest of them.</span>\n</p>\n<p>\n<span>“I know about King Arthur,” Eddie says. And then, like he’s read her mind, he adds, “I used to be </span>\n<em>\n<span>going places</span>\n</em>\n<span>, ya know.”</span>\n</p>\n<p>\n<span>“We read King Arthur two months ago,” Robin points out, “And if I remember correctly you mixed up Avalon and Camelot.”</span>\n</p>\n<p>\n<span>Eddie splays his arm out to the side away from Robin. “Hey, I have a reputation to maintain here.”</span>\n</p>\n<p>\n<span>“You were faking it?”</span>\n</p>\n<p>\n<span>“Uh… duh.” Eddie laughs and skips, once. “I’ve read every Lord of the Rings book, all of Dune, the entire ‘Stand’ which is a </span>\n<em>\n<span>fucking brick</span>\n</em>\n<span>… You think I haven’t read King Arthur?”</span>\n</p>\n<p>\n<span>“You mixed up </span>\n<em>\n<span>Avalon and Camelot</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“Ironically. I was sticking it—” he lightly punches her shoulder, “—to the man.”</span>\n</p>\n<p>\n<span>She swats at his arm lightly, and starts thinking back on what got them into this conversation. After a moment, she glances over at Eddie. “Why’d you call me Han?”</span>\n</p>\n<p>\n<span>“Han Solo?”</span>\n</p>\n<p>\n<span>“Well, obviously. But why me?”</span>\n</p>\n<p>\n<span>“We have another Star Wars nerd on our hands?”</span>\n</p>\n<p>\n<span>“Answer the question, Dingus.”</span>\n</p>\n<p>\n<span>Eddie puts his hands up in mock surrender. “It’s nothing, really.” After a brief pause, which Robin realizes is just for the drama of it all, he says, “I just think you have someone close to you right now who is trying to make you jealous.”</span>\n</p>\n<p>\n<span>Robin’s eyes narrow. “Nancy is </span>\n<em>\n<span>straight</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“And I’m sure you’ve both clearly had that talk while going through her extensive Donna Summers’ collection.” Robin buries her head in her hands.</span>\n</p>\n<p>\n<span>“I’m not having this conversation.” Everything’s getting too loud and too stressful and Robin really wants to go home.</span>\n</p>\n<p>\n<span>“You’re the one that started this whole thing.”</span>\n</p>\n<p>\n<span>That’s enough to send everything tumbling out of control. “Yeah, because you actually have a chance!” She stomps her foot once in frustration.</span>\n</p>\n<p>\n<span>“I’m sorry?” And Robin’s so full of shame. Because Steve’s never said anything about her, even when Dustin’s ragged on him and Lucas’s made jokes and Max’s asked him point blank if Robin likes girls. And here she was, blowing his secret within hours of learning it. So, she covers.</span>\n</p>\n<p>\n<span>“I just mean, like, he’s never confirmed if he’s straight or not.”</span>\n</p>\n<p>\n<span>Eddie gives her a once-over. “Uh huh. And Nancy has?”</span>\n</p>\n<p>\n<span>“Well, uh… I mean…” Fuck.</span>\n</p>\n<p>\n<span>“You still have a shot,” Eddie says.</span>\n</p>\n<p>\n<span>“She doesn’t have a gay best friend,” Robin says at the same time.</span>\n</p>\n<p>\n<span>He smiles. “No, she just has a weird soft spot for you that I cannot understand.”</span>\n</p>\n<p>\n<span>“Fuck you.”</span>\n</p>\n<p>\n<span>“No, no, it’s not that I don’t like you, Buckley. It’s just that she </span>\n<em>\n<span>shouldn’t</span>\n</em>\n<span> like you. There’s a difference.”</span>\n</p>\n<p>\n<span>Just when she opens her mouth to protest, Steve starts yelling. “Guys!” Robin realizes they’re frozen in front of them, and Nancy’s unmoving. Her eyes widen. “</span>\n<em>\n<span>We have a situation here</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Fuck</span>\n</em>\n<span>,” Robin snarls.</span>\n</p>\n<p>\n<span>“I really don’t like this,” Eddie says.</span>\n</p>\n<p>\n<span>“Join the club,” Robin says. She glances over at him.</span>\n</p>\n<p>\n<span>Only to find his skin melting off his skull. He still wears his obligatory grin, but now it’s something more sinister.</span>\n</p>\n<p>\n<span>“Oh </span>\n<em>\n<span>fuck.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“Robin, is that you?” Nancy yells. She’s right where she was only moments ago, except now she isn’t frozen in place. Now, she’s in Vecna’s mind palace </span>\n<em>\n<span>with Robin.</span>\n</em>\n</p>\n<p>\n<span>Oh </span>\n<em>\n<span>double fuck.</span>\n</em>\n</p>\n<p>\n<span>***</span>\n</p>\n<p>\n<span>In the real Upside Down, Eddie stares in horror at Robin’s glazed over eyes. He and Steve lock eyes.</span>\n</p>\n<p>\n<span>“Please don’t tell me…” Steve says.</span>\n</p>\n<p>\n<span>“Your extensive knowledge of Robin’s music taste could definitely come in handy right now.”</span>\n</p>\n<p>\n<span>“Fuck.”</span>\n</p>\n<p>\n<span>Grandma Wheeler’s voice rings in Nancy’s ears as she stares down Vecna for the second time in a week. </span>\n<em>\n<span>That temper of yours isn’t quite fitting for a lady</span>\n</em>\n<span>. Well, Nancy’s been dealing with this bullshit for three years. And if she’s learned anything in that time, it’s </span>\n<em>\n<span>fuck being ladylike</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“Please tell me you see the creepy skull man too,” Robin says. Her face is contorted in fear, and Nancy’s heart feels like it’s going to combust. Instinctively, she steps in between Robin and Vecna.</span>\n</p>\n<p>\n<span>“What do you want from us?” Nancy demands attention now, shoving every ounce of authority she has in her body into her voice.</span>\n</p>\n<p>\n<span>“We meet again, Nancy,” He simply responds. His voice sends a chill down her spine, and Robin clamps on firmly to her arm. Still, she stands her ground.</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>You let me go</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“Have you considered what I said?”</span>\n</p>\n<p>\n<span>Robin blinks at Nancy, and now the shorter girl has to fight to keep her voice even. “We are </span>\n<em>\n<span>nothing alike</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>He laughs, and it seems like the whole world around them is laughing too. His voice reverberates from the rotting trees, and Nancy can all but feel the energy leaving her body. All she wants to do is curl into Robin and cry.</span>\n</p>\n<p>\n<span>“I see what you could be, Nancy, if only you let your </span>\n<em>\n<span>fear</span>\n</em>\n<span> stop holding you back.”</span>\n</p>\n<p>\n<span>“I’m not afraid of you.” And as she says it, it’s as if she wills it to be true. As if she’s sculpting this world into something entirely her own. As if she owns his mind palace in its entirety.</span>\n</p>\n<p>\n<span>“I know,” He says. The conviction leaves her body. “You’re afraid of yourself. And you’re afraid of </span>\n<em>\n<span>her</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“Me?” Robin whispers.</span>\n</p>\n<p>\n<span>“I… I’m not.” Why is she hesitating, all of the sudden? Nancy logically knows he’s wrong: she likes Robin. She cares about Robin. She can’t imagine her life without Robin anymore. And yet, Vecna’s words send cracks through something in her.</span>\n</p>\n<p>\n<span>“You and I always have our toys, don’t we?” Slowly he begins to circle them, like a hyena with its prey. “What’s his name again? Steve?”</span>\n</p>\n<p>\n<span>Nancy’s heart sinks. “Shut up.”</span>\n</p>\n<p>\n<span>He doesn’t. “You, Nancy, like to hide behind pretty boys and use them to make yourself happy. And you pretend you don’t like the suffering you create, all the anguish and pain you leave in your wake. But that’s what’s fun about toys.” He stops walking now, having completed a full circle around them. “Sometimes, they </span>\n<em>\n<span>break</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“It’s not like that!”</span>\n</p>\n<p>\n<span>“Isn’t it?” A branch snaps somewhere far away, and Robin jumps. Nancy glances back at her, and her heart twists at the pain in the taller girl’s face. They need to get out of here. “You just keep lying to yourself, Nancy.”</span>\n</p>\n<p>\n<span>“Leave her alone,” Robin yells suddenly. She drops Nancy’s arm, and steps out from behind her. “She is good and kind and</span>\n<em>\n<span> nothing like you</span>\n</em>\n<span>.” One of Vecna’s tendrils shoots out from behind him, and wraps itself around Robin’s throat. It cuts her breath short, and slams her into the nearest tree. She lets out a strangled whimper.</span>\n</p>\n<p>\n<span>“Robin!” Nancy screams. She dives toward her, but another tendril pushes her back.</span>\n</p>\n<p>\n<span>Venca slowly steps in between the two of them, his ever-present grin covering his face. “Even now, your fear is palpable. You can’t help yourself, can you?” He softly strokes Nancy’s chin, and her jaw clenches. “Stop hiding, Nancy.”</span>\n</p>\n<p>\n<span>“I’m not hiding.”</span>\n</p>\n<p>\n<span>“Aren’t you?” A voice hisses. Nancy looks over her shoulder, and there’s Carrie Fisher. She blinks. No, </span>\n<em>\n<span>definitely</span>\n</em>\n<span> Carrie Fisher, in Leia’s battle outfit.</span>\n</p>\n<p>\n<span>“Pathetic,” Another voice sounds. Nancy glances the other way, to see Ally Sheedy in her all-black Breakfast Club look. </span>\n<em>\n<span>Ally Sheedy</span>\n</em>\n<span>. Because Carol couldn’t shut up Emilio Estevez, but Nancy just wanted to </span>\n<em>\n<span>be</span>\n</em>\n<span> Ally Sheedy. Or maybe more than that. But she can't admit that to herself. Because that prospect is too…</span>\n</p>\n<p>\n<span>Oh, fuck it, </span>\n<em>\n<span>she is scared</span>\n</em>\n<span>. And Robin’s big fucking eyes and soft, earnable smiles are not helping.</span>\n</p>\n<p>\n<span>“I loved Steve,” Nancy snaps. “I love Jonathan! They weren’t just </span>\n<em>\n<span>toys</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“And now?” Vecna asks. Her mouth drops open as she searches for words that won’t come. Behind Vecna, Robin gasps as the tendril tightens around her throat.</span>\n</p>\n<p>\n<span>Now Nancy knows what to say. “Leave her alone. Please.” She isn’t a beggar, but the fear in Robin’s eyes is enough to bring her to her knees. She can’t take it.</span>\n</p>\n<p>\n<span>“Why?”</span>\n</p>\n<p>\n<span>And Nancy shatters. “She’d hate me,” She whispers. Somewhere in the distance, Nancy thinks she hears Frankie Valli playing. And tears roll down her face slowly, stinging her skin.</span>\n</p>\n<p>\n<span>“No,” Robin whimpers.</span>\n</p>\n<p>\n<span>“More than you hate yourself?” Nancy feels like she’s been punched. Vecna turns away from Nancy now, and starts towards Robin. “Your fear limits you so much.” He reaches a finger out, and brushes a single strand of hair from Robin’s face. “It’ll be a shame watching one of your toys die because of it.”</span>\n</p>\n<p>\n<span>Nancy’s eyes widen. She leaps forward, but Vecna’s foot soldiers hold her back. “</span>\n<em>\n<span>You can’t</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“I will. And you can watch.”</span>\n</p>\n<p>\n<span>“Please don’t do this.” Vecna laughs again, and the ground shakes beneath Nancy’s feet. “I… You can’t do this. Not because of me. Not because…” She glances at Robin’s face, one last time. Because its the last time she’ll respect Nancy, and care about her, and think that she’s good and kind and so </span>\n<em>\n<span>not </span>\n</em>\n<span>like Vecna. “Because of my stupid fucking crush on her.” She can’t even look at Robin’s face anymore. She just stares at the ground.</span>\n</p>\n<p>\n<span>The sound of Frankie Valli singing increases so rapidly that it even momentarily shocks Vecna. Only, Nancy realizes it’s not Frankie Valli at all; instead, Steve methodically whispers the lyrics to “Can’t Take My Eyes Off of You” from where she can see him through the small portal that’s opened.</span>\n</p>\n<p>\n<span>Suddenly, Robin rips Nancy’s arm from Zombie Leia’s. She runs in her awkward way towards the portal, holding tight to Nancy. The world is crumbling around them, and the ground shakes violently.</span>\n</p>\n<p>\n<span>“I hate earthquakes,” Robin mumbles.</span>\n</p>\n<p>\n<span>“Almost there,” Nancy says. And for those brief moments, she pretends nothing’s changed. She pretends everything can go back to normal, once they can get out.</span>\n</p>\n<p>\n<span>And then Robin’s landing on Nancy from about four feet into the air, and Nancy’s lungs ache. The ground of the Upside down is hard beneath the two of them. Eddie and Steve stand only a few feet away and Nancy realizes they’re holding onto each other for dear life.</span>\n</p>\n<p>\n<span>“Thank God,” Eddie says. “Oh, Jesus, thank </span>\n<em>\n<span>God.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“I thought I lost you guys…” Steve mumbles. “I thought…”</span>\n</p>\n<p>\n<span>Nancy stands suddenly, and shoves past the two of them. She doesn’t say a word, but she doesn’t have to. Because she’s sure Robin will tell them everything. And she’s sure that’ll be it for her–none of them will want her. She’ll be alone again, just like when Barb died.</span>\n</p>\n<p>\n<span>She pushes far into the trees. If she’s gonna be alone, at least it’ll be on her own terms.</span>\n</p>\n<p>\n<span>“Nance, wait!” Robin calls. Nancy knows she shouldn’t, but she stops anyway.</span>\n</p>\n<p>\n<span>She starts to turn to face the taller girl. “Robin, I’m so sor–” Robin’s lips cut her off. They’re pressed to Nancy’s and so much softer than she ever expected. Once she realizes what’s happening, she melts into the kiss. Her fingers tangle into Robin’s hair, and she goes up on her tiptoes just to be as close to her as possible. Robin tastes impossibly like mint, she decides, and smells like vanilla and cigar and thrift store. And she can’t get enough of it.</span>\n</p>\n<p>\n<span>Robin’s the one who breaks the kiss, and presses her forehead to Nancy’s. “Don’t apologize at all.”</span>\n</p>\n<p>\n<span>“I don’t… I don’t understand.”</span>\n</p>\n<p>\n<span>“Nancy, I have wanted to do that since the library, okay?”</span>\n</p>\n<p>\n<span>“But you kept talking about Steve–”</span>\n</p>\n<p>\n<span>“Because I wanted you to know </span>\n<em>\n<span>I</span>\n</em>\n<span> was single!” Robin pulls back, and rests her wrists on Nancy’s shoulders. “Nancy, I am a huge fucking lesbian who had to spend a whole day around a really pretty, really bad ass girl who dresses like a middle school librarian–I wanted you to know I wasn’t seeing him in case you decided you were in love with me.”</span>\n</p>\n<p>\n<span>Nancy looks down. “</span>\n<em>\n<span>Oh</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Yeah</span>\n</em>\n<span>.” Nancy smiles, weakly, and then presses into Robin.</span>\n</p>\n<p>\n<span>“I was so scared you’d hate me.”</span>\n</p>\n<p>\n<span>“I know. I was too when I told Steve.”</span>\n</p>\n<p>\n<span>“Steve knows?”</span>\n</p>\n<p>\n<span>“Steve and Eddie, yeah.”</span>\n</p>\n<p>\n<span>“And they don’t care?”</span>\n</p>\n<p>\n<span>Robin stifles a laugh, and Nancy can’t for the life of her figure out what’s funny about it. Robin doesn’t even answer the question. Instead, she says, “Let’s go find the boys, okay?” She slips her hand into Nancy’s, and together, they head back towards their friends.</span>\n</p>\n<p>\n<span>“Wait, do you actually think I dress like a librarian?”</span>\n</p>\n<p>\n<span>“Yeah! Wait, is that not a good thing?”</span>\n</p>\n<p>\n<span>Eddie should not be thinking about Steve’s ass at a time like this. Yet Steve thought it was acceptable to squat and pick up Robin’s comatose body in a pair of jeans, so that she and Nancy could be next to each other. And now, Eddie is partially pacing to think through the situation, and partially pacing to cover up the fact that he’s hot and bothered.</span>\n</p>\n<p>\n<span>“She likes, um… David Bowie?” Steve says. They’re throwing out song suggestions, trying to save Nancy and Robin.</span>\n</p>\n<p>\n<span>“No, you like David Bowie.” Because of course Steve likes David Bowie. He also probably likes Madonna and Michael Jackson. He’s </span>\n<em>\n<span>basic.</span>\n</em>\n</p>\n<p>\n<span>Eddie’s pathetically in love with someone boring. Maybe Vecna will come for him for </span>\n<em>\n<span>that</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“It’s not my fault I drive her everywhere!” Steve says. “She doesn’t pay for gas, she doesn’t get to pick the music! It’s simple.”</span>\n</p>\n<p>\n<span>“But not really helpful.” Eddie fusses with his fingers, rolling them around his rings. “What about Miss Nancy here? Because clearly the last one </span>\n<em>\n<span>isn’t working anymore</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>Steve just shakes his head. “We really only listened to music in the car, or like, in my room so—“</span>\n</p>\n<p>\n<span>“So remind me to never have sex with you. Got it.”</span>\n</p>\n<p>\n<span>“What’s </span>\n<em>\n<span>that</span>\n</em>\n<span> supposed to mean?”</span>\n</p>\n<p>\n<span>Fuck. So much for Robin’s insistence that there was a chance. </span>\n<em>\n<span>Cover, Munson, cover.</span>\n</em>\n<span> “I just don’t ever think railing someone to ‘Somebody to Love’ by Queen will be my ideal evening.”</span>\n</p>\n<p>\n<span>“I like matching pace with the piano,” Steve says. An absolute look of horror must overtake Eddie’s features, because Steve breaks into a grin. “I’m kidding.”</span>\n</p>\n<p>\n<span>“Can never tell with you, Steve-o.” Eddie glances down at Robin, trying to think about what he knows about her. “She’s in marching band, right?”</span>\n</p>\n<p>\n<span>“Yes, and she hates band music.” Then, Steve says, “I’d let you pick the music, anyway.”</span>\n</p>\n<p>\n<span>“Huh?”</span>\n</p>\n<p>\n<span>“If we, ya know…”</span>\n</p>\n<p>\n<span>“Are we still on the sex thing?” Eddie waves at the two girls. “Because, uh, I know I’m hot as fuck and queerer than a 4 dollar bill. </span>\n<em>\n<span>I get it</span>\n</em>\n<span>. But I also really don’t want to watch another girl die this week.”</span>\n</p>\n<p>\n<span>“Right. Yeah. No more, um, guy talk. Dude talk. Yeah.” Steve’s eyes are right on Eddie, and Eddie has to look away.</span>\n</p>\n<p>\n<span>“Are you okay?”</span>\n</p>\n<p>\n<span>Steve coughs lightly, and doesn’t answer. “Shouldn’t they be floating by now?”</span>\n</p>\n<p>\n<span>Eddie checks his watch. “Chrissy went full seizure for about…” He looks up at Steve. “Two minutes.”</span>\n</p>\n<p>\n<span>“Max probably had a good five in her.”</span>\n</p>\n<p>\n<span>“And we’ve been at this for six minutes now. They’ve lasted longer than most of the guys I know.” Eddie starts pacing again, trying to get his extra energy out.</span>\n</p>\n<p>\n<span>Steve’s eyes light up, as they follow Eddie back and forth. “Wait, do you think they’re in there together?”</span>\n</p>\n<p>\n<span>“Is this a reference to my sex joke?”</span>\n</p>\n<p>\n<span>“No! I just mean… like, are they in the same fucked-up brain place do you think?”</span>\n</p>\n<p>\n<span>Eddie shrugs, now hyper-aware that Steve’s eyes are following his every move. It’s intimidating as hell. “I don’t think this guy has it in him to really Scarlet Witch that shit.” From the look on Steve’s face, he’s more confused than Eddie expected him to be about a superhero reference. “...Yeah, yeah I do.”</span>\n</p>\n<p>\n<span>Steve face palms. “I can’t believe I didn’t think of this, </span>\n<em>\n<span>fuck</span>\n</em>\n<span>. Robin’s last crush came into Family Video while ‘Can’t Take My Eyes Off of You’ was playing and she wouldn’t shut up about it for </span>\n<em>\n<span>weeks</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“Frankie Valli?”</span>\n</p>\n<p>\n<span>“Yeah! She told me she just wants it to be, like, </span>\n<em>\n<span>her song</span>\n</em>\n<span> with someone.” Steve quickly looks away from Eddie, his face turning dark. “But, I mean… maybe it’ll work, like, solo. I guess.”</span>\n</p>\n<p>\n<span>If Eddie didn’t know, Steve wouldn’t be a bad liar. Mostly because most of the people in Hawkins can’t put two and two — or girls and girls — together. Steve’s actually a godawful liar, at least from what Eddie’s seen.</span>\n</p>\n<p>\n<span>“Maybe it’ll work because she’s with Nancy.” Steve looks up, and Eddie watches his eyes as he slowly starts to realize. “I know about her.”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Oh.</span>\n</em>\n<span>” Steve nods slowly, and looks down. “Did she tell you about Nancy?”</span>\n</p>\n<p>\n<span>“A bit, yeah.” Eddie wants to look away, too, because he knows what he has to ask next and he knows he won’t like the answer. But part of him is still holding onto hope. “How do you feel about it?”</span>\n</p>\n<p>\n<span>Steve looks down at the girls, and then back up at Eddie. He inhales, and then says, “I like someone else.”</span>\n</p>\n<p>\n<span>Eddie’s stomach twists in knots. Of course he does. Steve Harrington always has a girl on his arm. Steve Harrington is </span>\n<em>\n<span>straight</span>\n</em>\n<span>. That’s that. “Do you sing?” And something flickers through Steve’s face – probably relief.</span>\n</p>\n<p>\n<span>“Not really.”</span>\n</p>\n<p>\n<span>“Weren’t you in the musical?”</span>\n</p>\n<p>\n<span>“Aren’t you in a band?”</span>\n</p>\n<p>\n<span>“Do you want a metal cover of ‘Can’t Take My Eyes Off of You’?”</span>\n</p>\n<p>\n<span>“Yeah, actually.” Eddie raises his eyebrows. “It’ll be more of Robin’s vibe anyway.”</span>\n</p>\n<p>\n<span>Eddie wishes he could say he barely remembers the lyrics, but that’s not entirely true. In fact, his mother used to have an old Frankie Valli cassette that she’d play whenever she was home to make dinner for him. He can almost see her now, dancing in the little trailer’s kitchen, even when her skin started to deteriorate.</span>\n</p>\n<p>\n<span>Eddie turns his head towards the girls, entirely unable to look at Steve. “You’re just too good to be true,” Eddie starts. His voice is raspy and warm, like the burn of the cigarettes he used to steal from his dad. And it’s comfortable, like his battle jacket. He pulls the jean material in tighter now, and shoves his hands in his pockets. “You’d be like heaven to touch, I wanna hold you so much.” He twirls his hair around his finger, slowly, trying to calm his racing heartbeat. “You’re just too good to be true, can’t take my eyes off of you.”</span>\n</p>\n<p>\n<span>“Fuck,” Steve whispers. Eddie glances up at him, his eyes already going wide.</span>\n</p>\n<p>\n<span>“Shit, man, did I fuck up? I haven’t sang that since my mom died–”</span>\n</p>\n<p>\n<span>“Eddie.”</span>\n</p>\n<p>\n<span>“So like if the lyrics were so off like, I get it–”</span>\n</p>\n<p>\n<span>“Eddie.” Steve puts his hands on Eddie’s arms, but all Eddie can see is Chrissy’s face as she died.</span>\n</p>\n<p>\n<span>“I don’t want to lose the girls because I fucked up, </span>\n<em>\n<span>fuck</span>\n</em>\n<span>–”</span>\n</p>\n<p>\n<span>“Eddie!” Steve grabs Eddie’s face, which finally manages to shut Eddie up. Mostly because instead of thinking of Chrissy, Eddie is instead acutely aware of how fucking gay he is. And how badly he wants to kiss Steve.</span>\n</p>\n<p>\n<span>Then, something incredibly peculiar happens: Steve kisses </span>\n<em>\n<span>Eddie</span>\n</em>\n<span>. And he tastes like chapstick and Altoids and Eddie doesn’t even hesitate before kissing back. It’s hard and fast and Eddie’s back is pressed to a tree and his rings are tangled up in Steve’s hair and he is embarrassingly hard and–</span>\n</p>\n<p>\n<span>And Robin Buckley is suddenly hovering four feet in the air.</span>\n</p>\n<p>\n<span>Eddie pushes Steve off as fast as possible.</span>\n</p>\n<p>\n<span>“Sorry,” Steve says quickly. “I just… you are hot as shit when you sing, did you know that?”</span>\n</p>\n<p>\n<span>“Your turn.” Eddie grabs Steve’s shoulders, and turns him back towards the floating girl.</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>Fuck.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“Your voice is gonna be better for Frankie Valli. You have to do it.”</span>\n</p>\n<p>\n<span>Steve swallows, hard. And then he starts, his arm wrapping tight around Eddie's waist. Eddie curls into him, feeling him vibrate as he sings. His voice is calculated, smooth. He’s been taught music in a way Eddie hasn’t. It’s unbearably sexy.</span>\n</p>\n<p>\n<span>Steve is launching into the “I love you, baby,” section when it happens: Robin drops from the sky with the same grace and poise she brings to everything, and Nancy lets out a huff the moment Robin hits her. And before Eddie and Steve can even think to celebrate, the two are off having some elaborate fight in the woods.</span>\n</p>\n<p>\n<span>Which means… “So,” Steve says. “We should talk about earlier. While they’re gone, I mean.”</span>\n</p>\n<p>\n<span>Eddie raises his eyebrows. “Or we could just not and like… keep making out in the woods?”</span>\n</p>\n<p>\n<span>Steve opens his mouth, and then closes it. He looks at the clearing around them slowly. Then, he says, “Do you maybe still have those handcuffs?”</span>\n</p>\n<p>\n<span>Steve knows they’re supposed to be saving the world. Logically, that makes sense. But Eddie is doing this thing with his teeth on Steve’s ear and Steve knows there is no way in hell he’ll be able to focus on the apocalypse for a while. Every hero needs to let off some steam sometimes, right?</span>\n</p>\n<p>\n<span>Plus, everyone else had gone home. They’d made it back to the regular world, safe and sound and just in time for a call from Jonathan, Will, and Mike. They were coming to Hawkins in a pizza van, which only made sense to Nancy, and they’d found Eleven, which made sense to no one. They had half a day to themselves until the California crew came crashing through.</span>\n</p>\n<p>\n<span>And now Steve is in Eddie’s bed, under the pretense that he needs help with his wounds again. That’s what they told the kids, at least; Robin gave Steve a knowing look when she left them. He gave her one right back when she said she was spending the night at Nancy’s.</span>\n</p>\n<p>\n<span>Steve’s propped up against Eddie’s wall, back in his t-shirt. (“For your modesty.” “Yeah, fuck you.”) Eddie’s lazily draped over him, peppering his neck with kisses and hickies of which Steve isn’t sure he can explain his way out. Every once in awhile, he bites at Steve’s ear and Steve has to aggressively stifle moans.</span>\n</p>\n<p>\n<span>“So, about those handcuffs,” Eddie whispers in Steve’s ear. And Steve legitimately thinks he might stop breathing.</span>\n</p>\n<p>\n<span>“I’ve never done this before,” he blurts out. Immediately, he regrets it. He’s normally good at this kind of thing. But that’s with girls. And this is Eddie.</span>\n</p>\n<p>\n<span>Eddie leans back, smiling his shit-eating grin that Steve thinks might be his way of showing affection. “Wait a minute: do I make you nervous?”</span>\n</p>\n<p>\n<span>“Very much so.”</span>\n</p>\n<p>\n<span>Eddie’s face softens. “Oh.” He moves to sit next to Steve, and Steve immediately misses the pressure of Eddie’s body on his. “We can stop if you want.”</span>\n</p>\n<p>\n<span>“No! No.” He grabs at Eddie’s thigh, and immediately embarrasses himself with his own lack of chill. “It’s good. Really good. I just…”</span>\n</p>\n<p>\n<span>“I haven’t either, you know.”</span>\n</p>\n<p>\n<span>Steve’s head snaps to look at Eddie. “What?”</span>\n</p>\n<p>\n<span>“I’ve never done this before, Harrington. Like, not with anyone I’ve ever liked.”</span>\n</p>\n<p>\n<span>“Right, yeah.” Of course he </span>\n<em>\n<span>done</span>\n</em>\n<span> this, though. Dustin’s told Steve all about Eddie’s shows at the Hideout. There’s no doubt in Steve’s mind that Eddie’s picked up plenty of guys there for a quick fuck, the way Steve has with girls at parties galore since freshman year.</span>\n</p>\n<p>\n<span>“Is that jealousy?”</span>\n</p>\n<p>\n<span>“No? Maybe. I don’t know.”</span>\n</p>\n<p>\n<span>“Yeah, well, Ally Becker was </span>\n<em>\n<span>not</span>\n</em>\n<span> a good kisser three years ago.” He shrugs. “That one might be on me though. Like, surprise! It </span>\n<em>\n<span>wasn’t</span>\n</em>\n<span> the braces that made things bad.”</span>\n</p>\n<p>\n<span>Steve blinks. “You’ve never done anything with a guy?”</span>\n</p>\n<p>\n<span>“Is that so hard to believe?”</span>\n</p>\n<p>\n<span>Steve blushes for probably the first time since he first started dating Nancy. “I mean… </span>\n<em>\n<span>yeah.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“Are you saying I’m a whore?”</span>\n</p>\n<p>\n<span>“No, I’m saying you’re fucking good at your job.”</span>\n</p>\n<p>\n<span>Eddie rubs a hand across Steve’s stomach, and Steve actually gasps. Slowly, Eddie’s hand comes to slip under the hem of Steve’s shirt. He carefully avoids Steve’s wounds, and instead softly strokes the smooth skin between them. “Is that good?” Eddie whispers.</span>\n</p>\n<p>\n<span>Deep down, Steve knows he knows the answer. But there’s something about the way Eddie says it that has him whispering, “Yes.”</span>\n</p>\n<p>\n<span>Eddie hums lazily, and leans forward to kiss Steve. This isn’t like their earlier makeout session; no, it’s soft and sweet and slow, like Eddie wants to savor every second of it. And that’s good, as first, until Eddie’s hand slips down to rest on Steve’s thigh. Maybe it's the proximity, or just Eddie’s effortlessness, but soft and sweet is not cutting it. Steve presses into him, a hand fisting Eddie’s shirt. And something palpably changes.</span>\n</p>\n<p>\n<span>Steve breaks the kiss. “Off,” He says. Eddie blinks. “Take it </span>\n<em>\n<span>off</span>\n</em>\n<span>.” Eddie still doesn’t move. “</span>\n<em>\n<span>Or I will</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>And like that, Eddie is pulling off his shirt and pulling Steve down on top of him. Steve’s shirt becomes another casualty. There’s hands spread flush against soft stomachs and backs and asses. </span>\n</p>\n<p>\n<span>“Fuck, Harrington.”</span>\n</p>\n<p>\n<span>“How about those handcuffs, Munson?”</span>\n</p>\n<p>\n<span>Eddie gives Steve a quick peck, and pulls off the bed. “Look, I don’t want to like… do anything today. If that’s okay.”</span>\n</p>\n<p>\n<span>Steve nods. “I don’t either.” Which is partially true. But part of him can feel himself holding back only because he doesn’t even know what they are. “Don’t worry.”</span>\n</p>\n<p>\n<span>Eddie unracks the handcuffs, and returns to the edge of the bed. “I wasn’t. Hands?”</span>\n</p>\n<p>\n<span>Steve holds his out, but before Eddie can cuff him, he takes them from him. Quickly, he turns them and snaps them onto Eddie’s wrists.</span>\n</p>\n<p>\n<span>Eddie raises his eyebrows. “What do you think you’re doing, princess?”</span>\n</p>\n<p>\n<span>“This.” Steve grabs Eddie, and throws him onto the bed. Eddie gasps, but Steve doesn’t give him time to get flip. He slams his lips into Eddie’s, and straddles his waist. Then, he shoves Eddie back, and puts Eddie’s hands firmly behind his own head.</span>\n</p>\n<p>\n<span>“Fuck, Harrington.”</span>\n</p>\n<p>\n<span>“No more princess?”</span>\n</p>\n<p>\n<span>“Not when—</span>\n<em>\n<span>Fuck.</span>\n</em>\n<span>” This last part comes in response to Steve sucking on Eddie’s neck roughly. It starts as payback for the marks on Steve’s skin, but Eddie’s response just makes Steve want to do it more. So he does, working his way slowly to Eddie’s collarbone with each hickey. Eddie’s hands come down to Steve’s shoulders, only for Steve to push them right back up on the pillow without stopping. “</span>\n<em>\n<span>God, Steve.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>The image of Nancy moaning that their first time hits him like a freight train. It’s like his brain goes numb, and his pulse starts racing and he’s off Eddie so fast that it's embarrassing. Eddie recoils, and Steve can’t breathe and </span>\n<em>\n<span>You’ll find a nice respectable girl and get your head screwed on right again, son</span>\n</em>\n<span> and he hurt Eddie fuck he hurt Eddie didn’t he–</span>\n</p>\n<p>\n<span>“Steve,” Eddie says somewhere far away. Steve needs to get it together, he knows that. He can’t keep freaking out around the guy he likes because of high school shit. It’s just not fair to either of them.</span>\n</p>\n<p>\n<span>“Sorry, sorry, I–”</span>\n</p>\n<p>\n<span>“Hate yourself for liking a guy and know life would be easier with a woman and desperately wish you weren’t here right now?”</span>\n</p>\n<p>\n<span>“Fuck, Eds.”</span>\n</p>\n<p>\n<span>Eddie takes Steve’s hand. “Is this okay?” Steve nods, because at least his body feels real again. Even if he doesn’t deserve to hold Eddie’s hand right now. “Okay, Harrington. Why do you think I don’t wanna fuck right now? Spoiler: it sure isn’t because I’m not turned on as hell right now.”</span>\n</p>\n<p>\n<span>“You want to savor the moment?”</span>\n</p>\n<p>\n<span>“Ha! That’s real cute, Steve-o.” Eddie looks away. “Deep down, I don’t even think I deserve that much. Like, when you kiss me… I still hear my dad blaming me for my mom’s death. How fucked is that?”</span>\n</p>\n<p>\n<span>“He said that?”</span>\n</p>\n<p>\n<span>“Of course he did. He’s a fucking asshole. But you get used to that feeling. You learn to shove it in a box and push it in a corner and beat it with a bat later. Personally,” Eddie tucks a piece of Steve’s hair behind his ear, “I like to mentally label my box as ‘shit that Reagan would say’.”</span>\n</p>\n<p>\n<span>“No way, you hate Reagan?” Sarcasm drips from his voice, and Eddie grins.</span>\n</p>\n<p>\n<span>“Robin needs to beat your ass more often.”</span>\n</p>\n<p>\n<span>Steve smiles and presses his forehead into Eddie’s shoulder. “I didn’t even notice how much shit my dad’s said about it.”</span>\n</p>\n<p>\n<span>“Yeah, I get that.” Eddie lifts his face with one hand. “You know what hankie code is?”</span>\n</p>\n<p>\n<span>“Robin’s told me about it, yeah.”</span>\n</p>\n<p>\n<span>Slowly, Eddie pushes Steve back onto the bed. “One of the guys at the Hideout taught me about it, right?” He lightly kisses the bandage over Steve’s side, before moving up towards him. “So I shoved a bandana in my back pocket and started wearing it to shows.” He slowly pulls Steve into the circle the handcuffs have made with his arms. Steve leans back into him. “One night, I came home, and my dad just started making jokes about how I was trying too hard to be punk rock and just ended up looking like a faggot or whatever.”</span>\n</p>\n<p>\n<span>“What’d you do?”</span>\n</p>\n<p>\n<span>“Told him I actually looked like a faggot because I like dick.” Steve looks over at him, a curious smile on his face. Eddie’s small, shy smile tells him that he’s being 100% serious.</span>\n</p>\n<p>\n<span>“That's how you had that conversation?”</span>\n</p>\n<p>\n<span>“And everytime I put this bandana in my pocket, I have to choose to shove </span>\n<em>\n<span>that</span>\n</em>\n<span> in the Reagan box.”</span>\n</p>\n<p>\n<span>Steve smiles, and twists to grab at Eddie’s bandana. It’s not that he hasn’t noticed it before – in fact, he’s made a bad habit of staring at Eddie’s ass when he shouldn’t be – but now he can actually make jokes about it without worrying about who’s listening. “You know wearing it in your left pocket means you’re dominant, right?”</span>\n</p>\n<p>\n<span>“You got a problem with that?”</span>\n</p>\n<p>\n<span>“I’m just saying, which of us is the one in handcuffs right now?”</span>\n</p>\n<p>\n<span>“</span>\n<em>\n<span>By choice.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“Uh-huh.”</span>\n</p>\n<p>\n<span>“Is that a dare?”</span>\n</p>\n<p>\n<span>Steve thinks about it for a second. “Maybe for later.” Then, he reaches over and unlatches the handcuffs. “I’m kind of too busy with this fucking hot guy right now.”</span>\n</p>\n<p>\n<span>“Oh? Who?”</span>\n</p>\n<p>\n<span>“Fuck you, Munson.” Steve leans into him, giving him a quick kiss.</span>\n</p>\n<p>\n<span>Eddie softly runs a hand over Steve’s side, and applies just enough pressure to Steve’s healing wound to make it feel better. “Anytime, Harrington.”</span>\n</p>\n<p>\n<span>Robin’s been to a decent amount of sleepovers in her life, especially since her dad picked up the nightshift at the plant her 8th grade year. Anymore, to avoid dealing with all the drama at home, she just crashes at Steve’s place. His parents think they’re dating, which makes for quality entertainment, especially when his dad jokes that Robin will “get Steve’s head screwed on straight.” From the conversations she’s had with him the last few days, she’s pretty sure her influence has helped Steve be anything but </span>\n<em>\n<span>straight</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>The Wheeler’s house is the exact opposite of the Harrington’s.</span>\n</p>\n<p>\n<span>They stopped for dinner first, but Nancy seemed weird the whole time. Robin wondered if it was because of the kiss, if Nancy regretted it. Her anxieties are somewhat eased when they get back to her house.</span>\n</p>\n<p>\n<span>“Where have you been?” Nancy’s mom snaps the second Nancy walks through the kitchen door. “No, don’t answer; I don’t actually care. You’re grounded.”</span>\n</p>\n<p>\n<span>“She was with me,” Robin pipes up from her spot in the door frame. Karen Wheeler looks impossibly more confused. “I’m Robin. Buckley. We have class together.” She glances over at Nancy, racking her brain for a comprehensive lie about the last two days. Every time she looks at Nancy, she can’t shut up; so why is it that her words aren’t forming </span>\n<em>\n<span>now</span>\n</em>\n<span>?</span>\n</p>\n<p>\n<span>“You’ve heard the news about Eddie Munson, right?” Nancy says. She raises her eyebrows at Robin, and she slowly puts two and two together. “She was with him the night Chrissy died.</span>\n</p>\n<p>\n<span>Robin smiles nervously. If she could pretend to be a professional psych student, she can fake this. “Like, we were together after the </span>\n<em>\n<span>game</span>\n</em>\n<span> and we hung out all </span>\n<em>\n<span>night</span>\n</em>\n<span> and so, when they announced they thought he did it, like, I was </span>\n<em>\n<span>really upset</span>\n</em>\n<span> and scared and I asked Nancy if she could come stay with me.” Okay, so not as put together as she would’ve hoped.</span>\n</p>\n<p>\n<span>Nancy frowns. “And I was upset because of Fred, so when she called, I felt like it’d be better to be with her.”</span>\n</p>\n<p>\n<span>Karen’s eyes narrow. “You could’ve called. There is a killer on the loose and… And did you two tell the police any of this?”</span>\n</p>\n<p>\n<span>“They didn’t believe us.”</span>\n</p>\n<p>\n<span>Karen’s eyes shoot to her daughter, and the concern in them is palpable. Robin starts inching towards the stairs. “Uh-huh. Robin, how’d you meet Nancy?”</span>\n</p>\n<p>\n<span>“She’s dating Steve,” Nancy says. Robin has to physically fight some form of response to her crush accusing her of dating her best friend.</span>\n</p>\n<p>\n<span>“And we just kept crossing paths,” She says instead.</span>\n</p>\n<p>\n<span>“She agreed to tutor me for French.”</span>\n</p>\n<p>\n<span>Robin lights up. “I speak four languages, actually. Steve and I learned Russian last–”</span>\n</p>\n<p>\n<span>Nancy takes Robin’s arm. “We’ll be upstairs.”</span>\n</p>\n<p>\n<span>“Oh, um, It was nice meeting you!”</span>\n</p>\n<p>\n<span>And they make a mad dash for Nancy's room. By the time they make it, Robin’s fighting back giggles as she collapses on Nancy’s bed.</span>\n</p>\n<p>\n<span>“She hates me,” Robin says. She grins up at Nancy, who’s far from smiling.</span>\n</p>\n<p>\n<span>“She doesn’t trust me. At all.”</span>\n</p>\n<p>\n<span>“Well, you have been hanging out with a wanted murderer all weekend.”</span>\n</p>\n<p>\n<span>“Not funny.” Nancy sits down on the bed next to Robin, her shoulders slumped.</span>\n</p>\n<p>\n<span>Robin sits up, slowly, and elbows Nancy’s side. “Don’t let it get you down. Moms are, like, meant to be horrible.”</span>\n</p>\n<p>\n<span>“Barb’s mom wasn’t.” Nancy glances over at Robin, and Robin can see the tears in Nancy’s eyes.</span>\n</p>\n<p>\n<span>“You really miss her, don’t you?”</span>\n</p>\n<p>\n<span>Nancy shrugs, and glances down at her lap. “I think sometimes I just feel guilty.”</span>\n</p>\n<p>\n<span>Robin gulps. Her mind is racing with all of the things she can tell Nancy, but she can’t escape the nagging feeling that, no matter what, she’ll come back to the same question. “That’s why Vecna targeted you, isn’t it?” Nancy nods, soundlessly. Her eyes are dark, sad. Robin bites her lip; she so dearly misses Nancy’s smile. “I used to hate you, you know. When you and Barb first became friends. Because I was her best friend, until you came along.” Nancy glares at Robin. </span>\n<em>\n<span>Okay, get to the fucking point</span>\n</em>\n<span>, Robin thinks. “But you were a much better friend to her than I ever was.”</span>\n</p>\n<p>\n<span>Nancy shakes her head and looks away. “She’s dead because of me.”</span>\n</p>\n<p>\n<span>“Because of a flesh-eating monster, actually.” Robin swings her feet back and forth under Nancy’s bed. “You heard Vecna: he wants you. </span>\n<em>\n<span>Oh baby, oh baby</span>\n</em>\n<span>.” Nancy breathe-laughs. </span>\n<em>\n<span>An improvement</span>\n</em>\n<span>. “No matter what you did, no matter how hard you tried, the Upside Down was going to try to hurt you. That doesn’t make it your fault.”</span>\n</p>\n<p>\n<span>“I left her!”</span>\n</p>\n<p>\n<span>“So did I!” Nancy’s head swings to look at Robin. “I just let her go! Because I was jealous. Because I was </span>\n<em>\n<span>scared</span>\n</em>\n<span>. Because I </span>\n<em>\n<span>liked girls</span>\n</em>\n<span> and I thought that meant no one would ever truly be able to like me. But guess what? If I had done something – anything! – to keep her in my life, then maybe I would’ve been there that night. Maybe I would’ve gone home with her when you left.”</span>\n</p>\n<p>\n<span>“You can’t say that.”</span>\n</p>\n<p>\n<span>“Then you can’t blame yourself for what happened.”</span>\n</p>\n<p>\n<span>Nancy opens her mouth to say something, and then she closes it. She quickly glances at the closed door. Without hesitating, she cups Robin’s chin and kisses her. It’s something short and soft and sweet, but it leaves Robin in a mess of fireworks. Her mouth shifts into a shellshocked smile.</span>\n</p>\n<p>\n<span>“Jonathan and I broke up over the phone today,” Nancy says. “Just so you know.”</span>\n</p>\n<p>\n<span>Robin blinks. A bit of her thought she’d be the silly little gay fling forever. A bit of her thought she deserved it. “What?”</span>\n</p>\n<p>\n<span>“I told him I was sick of never talking. And that I was mad he didn’t come to see me. And he told me he’s been lying to me for two months straight. So. I broke up with him.”</span>\n</p>\n<p>\n<span>“Oh. Are you okay?” Part of Robin isn’t sure she wants to know the answer.</span>\n</p>\n<p>\n<span>But then Nancy nods, slowly. “I think… I think I knew this was coming basically since he left. He had this whole idea that I would drop everything for him. And even though he didn’t want that, it pissed me off that he thought I would ever just up and abandon my dreams. I want to be with someone who actually challenges me.” She glances slyly at Robin now. “Who thinks I can be challenged.”</span>\n</p>\n<p>\n<span>Robin flops back onto the bed, her brain trying to form cohesive thoughts about this newest development. “I’m not going to Emerson with you.”</span>\n</p>\n<p>\n<span>“Thank god.” Nancy flops down right next to her, and looks over at her. Robin seriously cannot process how beautiful Nancy’s eyes are, or how intense they look right now.</span>\n</p>\n<p>\n<span>“Oh, so you want me gone?”</span>\n</p>\n<p>\n<span>“Shut up.”</span>\n</p>\n<p>\n<span>“Make me.” God, Robin has always wanted to say that. Back when she used to steal her mom’s bodice-rippers after class, she’d picture a tall dashing man – while, it was a man in fifth grade – taking her by the throat and forcing her into a silence driven by passion and lust and violence.</span>\n</p>\n<p>\n<span>Now, tiny Nancy Wheeler lightly presses her lips to Robin’s. She kisses her slowly, sweetly, with just the right amount of tongue. And Robin isn’t sure she’ll ever again be able to form the words to speak.</span>\n</p>\n<p>\n<span>Robin’s eyelashes flutter, and she takes a light breath. Nancy smiles. “If I had known it was that easy, I would’ve kissed you days ago.” Robin pushes her shoulder lightly, and Nancy smoothly slips her hand into Robin’s. This has to be fake. Robin turns various shades of red, and then drops Nancy’s hand.</span>\n</p>\n<p>\n<span>“Sorry,” She mumbles, burying her face in his hands. “I don’t normally–” The phone rings next to the bed. Robin jumps. It clicks to signal someone else in the house picking up, but Robin still feels entirely too on-edge.</span>\n</p>\n<p>\n<span>Her instinct proves somewhat correct when Mrs. Wheeler yells up to the room. “Nancy, hon, it’s for you.”</span>\n</p>\n<p>\n<span>Nancy sits up slowly next to Robin, her eyes wide. Slowly, she reaches for the bedside phone and picks it up. She gestures for Robin to get close to her, so they can both hear from the tiny speaker.</span>\n</p>\n<p>\n<span>“Hello?” Nancy says. And then she adds, “Mom, get off the line.”</span>\n</p>\n<p>\n<span>“Nancy?” She doesn’t recognize the voice.</span>\n</p>\n<p>\n<span>“Who is this?”</span>\n</p>\n<p>\n<span>“Oh, um… Bill. Beau.” </span>\n<em>\n<span>Bilbo.</span>\n</em>\n<span> Eddie. Robin and Nancy share a look. “I’m calling because… look, um… Just be ready. I’ll be there in ten. It’s Steve.”</span>\n</p>\n<p>\n<span>Eddie’s van might be the most confusing contraption Nancy’s ever been in.</span>\n</p>\n<p>\n<span>The very structure itself is strange: it’s a barely-functioning tin box, with outdated shag carpet that goes across the floor and up the walls. And where there absolutely shouldn’t be seats in the back, there are the mauled remains of what might’ve been recliners, nailed into the floor. The walls are decked in posters and a hand-installed stereo system, which dutifully bangs out something loud and heavy and actually kind of </span>\n<em>\n<span>good</span>\n</em>\n<span>. D&amp;D supplies and McDonald’s wrappers clutter the floor, and a few demo cassettes float between the seats. It smells weird, too, like nice cologne and cigarette smoke; nothing like what she anticipates from Hawkins High’s most prolific weed dealer, even if that dealer is someone as strange as Eddie.</span>\n</p>\n<p>\n<span>What really seems surprising to Nancy right now, though, is Eddie’s behavior.</span>\n</p>\n<p>\n<span>He pulled up only five minutes ago, with a terrified look on his face and Steve lying on his back in the back. After all the work they’d been through to keep Eddie hidden, Nancy thought it must’ve been a cruel prank. Until, of course, Eddie opened his mouth.</span>\n</p>\n<p>\n<span>“I couldn’t…” He tried to say through the open window. “He just… I don’t…”</span>\n</p>\n<p>\n<span>“Eddie, you need to tell us what happened,” Nancy commanded. Steve let out a groan from the back.</span>\n</p>\n<p>\n<span>“It got… </span>\n<em>\n<span>Fuck,</span>\n</em>\n<span>” Steve managed.</span>\n</p>\n<p>\n<span>“We have to get him to a hospital,” Eddie said. He couldn’t look Nancy in the eyes, and his skin was so incredibly pale.</span>\n</p>\n<p>\n<span>“You’ll be arrested,” Robin said.</span>\n</p>\n<p>\n<span>“I… I’m not leaving him.”</span>\n</p>\n<p>\n<span>Which is why Nancy is driving now, with Robin in the passenger seat. And she doesn’t understand why Eddie’s being so sweet with Steve, cradling Steve’s head and telling him he’ll get through it.</span>\n</p>\n<p>\n<span>“Tell me the story again,” Nancy says.</span>\n</p>\n<p>\n<span>“Are you sure this isn’t rabies?” Robin asks Eddie instead. “The incubation period is really similar–”</span>\n</p>\n<p>\n<span>Eddie glances up at her. “Robin, I’ve seen rabies. This isn’t it.”</span>\n</p>\n<p>\n<span>“Okay, boy scout.”</span>\n</p>\n<p>\n<span>Nancy elbows Robin. “Give me your story. Now.”</span>\n</p>\n<p>\n<span>“Right. So. Steve and I were heading to his place because his parents were gone, and Eddie tagged along.”</span>\n</p>\n<p>\n<span>“And why did Eddie tag along?”</span>\n</p>\n<p>\n<span>“Uh…”</span>\n</p>\n<p>\n<span>“Robin, they’re gonna ask! You two aren’t friends with Eddie.” No one could link Eddie and Robin or Steve together, like, </span>\n<em>\n<span>ever.</span>\n</em>\n<span> Unless, of course, “Say you wanted to get high.”</span>\n</p>\n<p>\n<span>“See, I don’t like smoking because it makes my brain go all weird and, like, fake–”</span>\n</p>\n<p>\n<span>“It doesn’t matter! Lie!”</span>\n</p>\n<p>\n<span>“Weed wouldn’t show up on our drug tests,” Eddie cuts in.</span>\n</p>\n<p>\n<span>There’s silence in the front seat for a moment. “You don’t smoke?” Nancy asks.</span>\n</p>\n<p>\n<span>“Nah, dude.”</span>\n</p>\n<p>\n<span>“Aren’t you literally a drug dealer?” Robin asks.</span>\n</p>\n<p>\n<span>“Mmhmm,” Eddie runs a hand through Steve’s hair.</span>\n</p>\n<p>\n<span>“Why the fuck would you sell drugs if you don’t do them?”</span>\n</p>\n<p>\n<span>“Correction, I do </span>\n<em>\n<span>drugs</span>\n</em>\n<span>.” Eddie grins up at her. “Just not weed.”</span>\n</p>\n<p>\n<span>“Why would you sell then?” Nancy asks.</span>\n</p>\n<p>\n<span>“I grew up in a trailer park, Wheeler. You get a bit of a rep from that.”</span>\n</p>\n<p>\n<span>“What’s that supposed to mean?”</span>\n</p>\n<p>\n<span>“Kids knew I had easy access to shit and I was poor enough to need the money. Now, can you focus on getting us to the fucking hospital?”</span>\n</p>\n<p>\n<span>Nancy glares at the road, and grips the steering wheel tighter. “Your car’s a piece of shit.”</span>\n</p>\n<p>\n<span>“Uh huh, I know.” They take a turn and Steve lets out a sharp groan. Eddie’s face contorts in panic. “</span>\n<em>\n<span>Hey, hey, look at me. Stay with me, Harrington</span>\n</em>\n<span>.” Nancy glances at Robin, who doesn’t look at all confused by this situation. By Eddie Munson begging Steve to stay alive, or holding his face, or preparing to spend his life in jail for the boy.</span>\n</p>\n<p>\n<span>Maybe he’s just more loyal than Nancy could ever be.</span>\n</p>\n<p>\n<span>“I’ll say Steve wanted weed,” Robin says. “And he cut his side up pretty badly when he was high.”</span>\n</p>\n<p>\n<span>“And then he still goes to jail?” Steve whimpers out. Eddie and Robin share a look, and Nancy suddenly feels extremely out of the loop.</span>\n</p>\n<p>\n<span>“Say you invited me and Henderson,” Eddie cuts in. “And Dustin bailed at the last minute, but I didn’t want to seem rude.”</span>\n</p>\n<p>\n<span>“Okay, fine.” Robin waves in Steve’s general direction. “What do we say about this… whole thing.”</span>\n</p>\n<p>\n<span>“They’ll know about it,” Nancy says. Eddie and Robin share a look. “Just… trust me.”</span>\n</p>\n<p>\n<span>Steve tries to shift into a sitting position, before curling back down. Eddie lightly presses down on his shoulders. “My veins are black, Nance.”</span>\n</p>\n<p>\n<span>Nancy’s eyes widen. Visions of Will in the hospital and in the shed fill her brain. The sounds of his screams in the night still haunt her dreams if she thinks too hard about that night.</span>\n</p>\n<p>\n<span>“D-does that mean something?” Robin asks. Sometimes, Nancy forgets that that was before Steve and Robin were Steve and Robin. Before she felt a sharp twinge of jealousy when she saw them together. Before she realized that was because she liked girls, and not because she still liked Steve.</span>\n</p>\n<p>\n<span>“The second time,” Steve starts. He inhales sharply, and glances up at Eddie. “The second time we fought this shit, it got Will. And his veins started turning black.”</span>\n</p>\n<p>\n<span>“You’re gonna be okay,” Nancy says, now, as she picks up her speed a bit. She wishes Hopper was there. She wishes things were going to be okay in Hawkins for once.</span>\n</p>\n<p>\n<span>But if things were okay, she’d be dating Steve and marrying him after high school and never escaping Hawkins. Never getting more than Enzo’s on a Saturday night, and cigarettes and beer from the gas station when they could afford it. Never getting to hold Robin’s hand across the center console of a beater van with Eddie “The Freak” Munson’s headbanger music blasting out all around her.</span>\n</p>\n<p>\n<span>She takes Robin’s hand now, and gives it a squeeze. “We’re almost there. Can you hold on that long? We’re almost there.”</span>\n</p>\n<p>\n<span>Steve suddenly twists forward, and throws up in a McDonald’s bag. Nancy thanks her lucky stars they aren’t in her car, as she watches Eddie hold back his hair in the rearview.</span>\n</p>\n<p>\n<span>“Get the ugly out, there you go.” He glances up, and catches Nancy’s eye in the mirror. The urgency on his face scares her more than anything else in this situation. It's the kind of urgency she’s come to know in her years of monster hunting: the kind that comes only when someone is really, truly, terrified to their core.</span>\n</p>\n<p>\n<span>“Eddie, what happened?” She asks.</span>\n</p>\n<p>\n<span>He frowns, and glances down at Steve. “He was fine. We were, um…” He pauses, and Nancy can almost feel him struggling to find the right word. “...Hanging out in my room. And then all of the sudden, he froze. And his face went white, and…”</span>\n</p>\n<p>\n<span>“And the veins around my bite turned black.”</span>\n</p>\n<p>\n<span>“Yeah.”</span>\n</p>\n<p>\n<span>“It’s the hivemind thing we were telling you about,” Nancy says. “Sometimes, when the Upside Down hurts you, it…”</span>\n</p>\n<p>\n<span>“Makes you part of it.”</span>\n</p>\n<p>\n<span>“He’s not gonna have like, a baby demogorgon pop out of his stomach, is he?” Robin asks.</span>\n</p>\n<p>\n<span>“Demogorgon?” Eddie cuts in. “Like the D&amp;D character?” And then, to Steve, he says, “Okay, atta boy. Let’s get you back down.”</span>\n</p>\n<p>\n<span>“It’s what we call some of the monsters that come out of the Upside Down,” Nancy explains. She can see Hawkins General in the distance.</span>\n</p>\n<p>\n<span>“You guy really let fuckin’ Henderson name this shit, didn’t you?”</span>\n</p>\n<p>\n<span>“They were flesh-eating monsters, Munson. You have a better idea?” But his focus is back on Steve. Nancy catches Robin repeating their story to herself over and over again. Like she’s willing it to be true.</span>\n</p>\n<p>\n<span>They pull into the hospital, then, and Robin jumps out of the car. She runs straight for the Emergency Bay, and Nancy can’t help but remember that the taller girl once told her she never runs, not ever. </span>\n<em>\n<span>But these are the things we do for the people we love</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>And then it finally clicks. Eddie’s in the back, promising Steve he won’t leave him. Their proximity isn’t uncommon for the two of them; maybe that’s why she didn’t catch it until now. But the insistence on staying with him, the willingness to risk prison for his life, the fearful pause between “were” and “hanging”. It all makes sense in the light.</span>\n</p>\n<p>\n<span>As the paramedics shove Steve onto a gurney, and security guards fight to pull Eddie away from him, Nancy feels like she’s watching a movie. Only, this would never happen in a movie, because she wouldn’t be with another girl.</span>\n</p>\n<p>\n<span>And her ex, the famed King Steve, wouldn’t have fallen for another boy.</span>\n</p>\n<p>\n<span>They took the clock off the wall in the hospital ward when the power grid got fucked after Starcourt Mall burned down, and never replaced it. Nancy told them it was because some of the doctors from Hawkins lab moved to Hawkins General, after the closure, and did what they could to cover up the Upside Down within local medicine. So now, Eddie isn’t sure how long he’s been sitting here, but it feels like hours. He can’t usually read the numbers on his watch face, and now he can’t even focus enough to try. Far in the distance, past the waiting room and the doors and the security detail, he can hear chanting and yelling. He knows, despite the intangible nature of it all, that it’s because of him.</span>\n</p>\n<p>\n<span>Two officers sit in the seats on either side of him. He recognizes one as the new interim sheriff, only from Newspaper photos and War-On-Drugs local newscasts. The other, rocking what Eddie thinks is an awesome mustache, seems to be his right-hand man. Robin sits across the aisle from him: only Nancy was allowed back, after she begged a few former Hawkins Lab doctors to let her come.</span>\n</p>\n<p>\n<span>The cops keep asking questions, but, strangely enough, neither of Hawkins’ finest particularly seem convinced Eddie was involved.</span>\n</p>\n<p>\n<span>“I’m getting coffee,” The sheriff says. “Do any of you want some? Actually, I’ll just get four cups.”</span>\n</p>\n<p>\n<span>He heads off down the hall, and leaves Eddie, Robin, and the other cop in silence. Eddie squints to read the guy’s name tag, like he always has to squint to read the blackboard: Callahan. Then, he takes a piece of his hair and runs it past his cheek.</span>\n</p>\n<p>\n<span>“Can I go check on Steve?” Robin asks suddenly.</span>\n</p>\n<p>\n<span>“Can you tell us the truth?” Callahan snaps back. Robin curls in on herself.</span>\n</p>\n<p>\n<span>“Seriously, dude?” Eddie says. His stomach twists at the sight of Robin’s face. She already struggles with eye contact, but now she won’t even look at either of them.</span>\n</p>\n<p>\n<span>“Don’t ‘dude’ me.” Callahan crosses his arms. “I know all about you, Munson. We’ve got a file three inches thick on you back at the station.”</span>\n</p>\n<p>\n<span>“Then you know he didn’t </span>\n<em>\n<span>do any of this</span>\n</em>\n<span>,” Robin cuts in. She glances up at them for just a moment, and then looks away. Eddie can’t help but smile at her little display of bravery.</span>\n</p>\n<p>\n<span>“Really?” Callahan hinges towards her as he speaks. It’s definitely not as intimidating as he thinks it is. “Then who did?”</span>\n</p>\n<p>\n<span>“An evil wizard from an alternate dimension?” Eddie offers. He raises his eyebrows at Robin, and sticks out one of his hands.</span>\n</p>\n<p>\n<span>“I will cuff you,” Callahan threatens. He’s a real Bonnie Fife.</span>\n</p>\n<p>\n<span>“I’ll probably be turned on, just warning you in advance.” Callahan turns red, and looks down at his feet.</span>\n</p>\n<p>\n<span>Just then the Sheriff – Powell, from his name tag – comes back with hands full of coffee. He hands one to Callahan, first, and then hands off two to Robin and Eddie. “You guys seem like the kind of kids who like a lot of sugar in your coffee,” He says as he drops them in their hands. Robin holds it with two hands, and takes a sip. She smiles.</span>\n</p>\n<p>\n<span>“Thank you,” She says. Eddie just sets his on the floor. There’s a dull empty ache in his stomach.</span>\n</p>\n<p>\n<span>“So, what’d I miss?” Powell asks. Callahan glances over at Eddie quickly, and then back at Powell.</span>\n</p>\n<p>\n<span>“We were talking about how, uh,” Callahan blinks quickly.</span>\n</p>\n<p>\n<span>“How a dark wizard from an Upside Down world did this,” Eddie finishes.</span>\n</p>\n<p>\n<span>“Uh huh,” Powell says, but there’s hesitance behind his sarcasm. He blinks a few times, regaining his composure, and then looks over at Callahan. “And you didn’t cuff him?”</span>\n</p>\n<p>\n<span>“How else do you explain what happened?” Eddie says suddenly. “Steve’s side is turning black! And… And someone killed Chrissy fucking Cunningham, who, unlike her boyfriend, was everything good and pure and </span>\n<em>\n<span>right</span>\n</em>\n<span> in this world.” Her smile flashes through his mind and he gulps. All of the sarcasm he normally welds disappears. “And I saw Patrick float out over the water,” Eddie continues. Callahan and Powell instantly look to him. His heart skips a beat. “Like, he was ten feet up in the air. And I couldn’t do anything to help him or…” He starts to lose his composure. “Or stop him from…” Eddie squeezes his eyes shut, trying not to think about Chrissy and Patrick’s bodies snapping out of place.</span>\n</p>\n<p>\n<span>“From what?” Callahan says lightly. Robin soundlessly slips to the floor of the hallway, so she can take Eddie’s hand.</span>\n</p>\n<p>\n<span>“He just… his jaw…” And now Eddie’s sheet white and shaking. “It was like he was getting, like, vacuumed in. Or sucked dry. Or… fuck…”</span>\n</p>\n<p>\n<span>And then the door at the end of the hallway bursts open. Two people shove through, despite the security detail at the front door. Eddie recognizes both of them for two vastly different and not particularly positive reasons. The first is the woman that he saw on TV all too often his first senior year. The second used to come around the trailer park to see him sometimes and tell Eddie to get better about containing the whole drug-selling business.</span>\n</p>\n<p>\n<span>Callahan stands up suddenly, his and Powell’s eyes wide as saucers. Because Jim Hopper is very much supposed to be dead, but instead he’s standing next to Joyce Byers and staring down his former employees with a look of intense disappointment.</span>\n</p>\n<p>\n<span>“You detained fucking Eddie Munson?” Hopper asks.</span>\n</p>\n<p>\n<span>Joyce puts a hand on Eddie’s shoulder, and he instinctively leans into it.</span>\n</p>\n<p>\n<span>“You’re alive?” Robin asks.</span>\n</p>\n<p>\n<span>“Where’s Will?” Joyce asks.</span>\n</p>\n<p>\n<span>Right when Eddie decides he’s had enough questions, Powell responds, “Not here.”</span>\n</p>\n<p>\n<span>Hopper and Joyce share a look. “What do you mean?”</span>\n</p>\n<p>\n<span>“Can we just back up and address the fact that he’s </span>\n<em>\n<span>still alive</span>\n</em>\n<span>?” Robin says in her typical loud way. Eddie’s breath hitches. Everything is too loud, too bright, too much; his vision’s turning white and his ears are buzzing and he just wants to run again. Joyce’s hand tightens lightly in his shoulders, grounding him.</span>\n</p>\n<p>\n<span>“We’re just trying to find our kids,” Hopper says. Then, he adds to Robin, “It was the Russians, kid.”</span>\n</p>\n<p>\n<span>Joyce glances between the two officers. “We borrowed a walkie talkie to pick up Will’s radio, but Dustin said something about him, and the hospital, and—\"</span>\n</p>\n<p>\n<span>“It’s Steve,” Robin cuts in. “Not Will.” Joyce visibly exhales. “Will’s supposed to get here from California tonight.”</span>\n</p>\n<p>\n<span>“How’d you even get in?” Callahan asks suddenly. Every eye in the room whips towards him, except for Eddie’s. His stay glued to the floor in front of him.</span>\n</p>\n<p>\n<span>“The door?” Hopper offers.</span>\n</p>\n<p>\n<span>Robin tilts her head. “Did you guys just walk past the angry mob or…”</span>\n</p>\n<p>\n<span>“Mob?” Joyce asks.</span>\n</p>\n<p>\n<span>“I’ve been accused of murder,” Eddie speaks up for the first time, his breathing shaky. “So there’s that.”</span>\n</p>\n<p>\n<span>“You accused fucking </span>\n<em>\n<span>Eddie Munson</span>\n</em>\n<span> of murder?” Hopper says. “Jesus, Powell.”</span>\n</p>\n<p>\n<span>Callahan adjusts his glasses and leans back on one leg. “We found a mutilated body in his uncle’s trailer.”</span>\n</p>\n<p>\n<span>“We’re talking about Jane’s kid, here.”</span>\n</p>\n<p>\n<span>“We’re talking about </span>\n<em>\n<span>Hawkins, Indiana</span>\n</em>\n<span>, here,” Joyce cuts in. “You know what’s happened here over the last four years, and your first course of action is to arrest a </span>\n<em>\n<span>kid</span>\n</em>\n<span>?”</span>\n</p>\n<p>\n<span>Powell sighs. “He ran from the cops, Joyce.”</span>\n</p>\n<p>\n<span>“There’s a mob outside demanding his </span>\n<em>\n<span>head</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“That was not our fault,” Callahan says. Joyce glares at him. “Jason Carver went around tellin’ everyone Munson had demonic powers, or something, because of that fucking board game.”</span>\n</p>\n<p>\n<span>“Wait,” Joyce says, “Is this about D&amp;D?” There’s a telling silence. “You really accused a boy of murder because he plays D&amp;D?”</span>\n</p>\n<p>\n<span>“Well, not </span>\n<em>\n<span>just</span>\n</em>\n<span> because of that.”</span>\n</p>\n<p>\n<span>“Christ!” Joyce yells. “You both knew Janey—we all used to smoke the same cigarettes under the bleachers. And Phil, I </span>\n<em>\n<span>know</span>\n</em>\n<span> she used to patch you up after soccer practice. So why in hell would you arrest her </span>\n<em>\n<span>son</span>\n</em>\n<span> because of—of a harmless board game! My kids play D&amp;D! My son, Will, when he was bullied mercilessly, when you </span>\n<em>\n<span>did nothing about it</span>\n</em>\n<span>, had nowhere to go but to his D&amp;D friends!”</span>\n</p>\n<p>\n<span>“We couldn’t really do anything—\"</span>\n</p>\n<p>\n<span>“It was </span>\n<em>\n<span>vandalism</span>\n</em>\n<span>. And you did nothing.”</span>\n</p>\n<p>\n<span>“Joyce—” Powell starts. The look on her face shuts him up pretty quickly.</span>\n</p>\n<p>\n<span>“Chrissy and Patrick…” Eddie speaks up suddenly. “It wasn’t just D&amp;D. Like, they both </span>\n<em>\n<span>died </span>\n</em>\n<span>in front of me.” He looks up, heart pounding in his chest. “Not because of me. Like, I watched them float up in the air and… And their bones just… God, I don’t even know. It just… they were </span>\n<em>\n<span>twisted</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“That’s what Jason said,” Callahan offers. “But he blamed your demonic cult powers, if I recall correctly.”</span>\n</p>\n<p>\n<span>Eddie snorts. “I wish.” Then he looks up. “Fuck, sorry, I just… trust me, if D&amp;D gave me magical powers or something, </span>\n<em>\n<span>you’d know</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>“It’s this town, and that goddamn lab,” Hopper says. “Why do you think there are doctors here who know how to treat this kind of thing?”</span>\n</p>\n<p>\n<span>“Steve’s veins were black,” Robin points out. “Nancy just brought us here on a whim.”</span>\n</p>\n<p>\n<span>“Is she back there with him?” Hopper asks. Robin nods.</span>\n</p>\n<p>\n<span>“Has she talked to Jonathan recently?” Joyce jumps in. Robin’s eyes go a bit wider as she nods again, and Eddie can’t help but wonder if Robin was a bit more successful with her crush than she might’ve anticipated.</span>\n</p>\n<p>\n<span>“Everyone was meeting up at my uncle’s,” Eddie offers. “We just, uh, had to make a pit stop. Obviously.” He waves his arm around, gesturing to the corridor. Joyce’s still rubbing soft circles on his shoulder, just the way his mom used to. He feels far more alive, now. Far more like Eddie “The Freak” Munson.</span>\n</p>\n<p>\n<span>“How’s he doing back there?” Hopper waits for a response, and when none comes, he adds, “</span>\n<em>\n<span>Jesus</span>\n</em>\n<span>, people. I guess I’ll go check on him.” Callahan and Powell share a look, and then quickly follow after him.</span>\n</p>\n<p>\n<span>Then, it’s just Eddie, Robin, and Joyce. Robin keeps her spot on the floor, but Joyce paces to the other side of the hall to lean against the wall. Eddie pulls his legs into his chest and looks up at her.</span>\n</p>\n<p>\n<span>“Thank you. For defending me.”</span>\n</p>\n<p>\n<span>Joyce smiles softly, and looks down. “My son, Will, told me once about this really cool guy who used to scare off anyone who tried to put Zombie Boy posters up in the high school.” Eddie blushes. \"I kind of suspected that it was you, from how long I knew your mom.”</span>\n</p>\n<p>\n<span>“Yeah?”</span>\n</p>\n<p>\n<span>“Janey was the best of us. We all thought her and Henry were gonna get out of this place. Only we all forgot one thing.”</span>\n</p>\n<p>\n<span>“What?”</span>\n</p>\n<p>\n<span>“Henry.” Eddie laughs for what feels like the first time in a long time. It’s a weird sensation, to no longer miss your father, but it’s a welcome one. “I wish we’d been closer in the end,” Joyce continues, “But Lonnie and Henry were still so close—”</span>\n</p>\n<p>\n<span>“And still such assholes?”</span>\n</p>\n<p>\n<span>Joyce smiles, and instead of answering, she just says, “That’s what Janey always said.”</span>\n</p>\n<p>\n<span>“Yeah, I remember. I think when she got sick she just kind of… Gave up on leaving him.”</span>\n</p>\n<p>\n<span>“Wait, Eds, is your mom </span>\n<em>\n<span>dead</span>\n</em>\n<span>?” Robin blurts out.</span>\n</p>\n<p>\n<span>“Robin, I literally live with my uncle.”</span>\n</p>\n<p>\n<span>“Right, well, I lived with my grandma for two years when my dad didn’t have a job, </span>\n<em>\n<span>so</span>\n</em>\n<span>.” Once again, Eddie’s somewhat shocked by how much Robin can comfortably overshare.</span>\n</p>\n<p>\n<span>“She didn’t give up, ya know,” Joyce cuts in. “She was saving up to move you guys out of this hell hole before…”</span>\n</p>\n<p>\n<span>“She started AZT trials.”</span>\n</p>\n<p>\n<span>Robin blinks up at Eddie. “Oh,” she whispers.</span>\n</p>\n<p>\n<span>“Yeah.” They all said his mom was lucky, getting AZT during the earliest drug trials. But she paid a steep price to do it; and so did he.</span>\n</p>\n<p>\n<span>In the distance, a hospital door slams, and Hopper comes back into the hallway. He’s smiling lightly. Eddie notices the patchy buzzcut he has, which is ever apparent under the fluorescents. Then, he says, “They got it out of him.” Joyce is the only person who looks relieved; Eddie and Robin just stare at Hopper in utter confusion. “Steve’s going to be okay.” Eddie can feel his entire body relax. And to add to the relief, Hopper says, “I convinced those idiots to let you two go in there, if you want.”</span>\n</p>\n<p>\n<span>Eddie and Robin are shooting down the hall before Hopper can stop them. Until they feel the impending heat in the hall. Slowly, both kids slow, and swap a look.</span>\n</p>\n<p>\n<span>“Okay, I am the king of broken air conditioning, but what the </span>\n<em>\n<span>fuck</span>\n</em>\n<span>?”</span>\n</p>\n<p>\n<span>Robin shrugs. “Don’t look at me! I joined this whole program while it was way in progress. Like, we already had a good trilogy under our belts.” They stop in front of the room from which the heat seems to be radiating.</span>\n</p>\n<p>\n<span>“Well, fingers crossed, then.” And Eddie pushes open the door, to find a perfectly normal hospital room, and Steve slumped in the bed. Nancy stands by an open window, smiling at the door. </span>\n<em>\n<span>Smiling at me</span>\n</em>\n<span>, Eddie realizes. There’re no nurses or doctors around right now, so Eddie smirks up at her and says, “Either someone has a crush on me, or Nancy Wheeler has put two and two together.”</span>\n</p>\n<p>\n<span>“You can hold his hand if that’s what you’re asking, Munson,” She snaps back with a smirk.</span>\n</p>\n<p>\n<span>“Oh, so we’re finally acknowledging how fucking fruity we all are?” Robin asks. She wraps her arms around Nancy’s waist, and Nancy leans into her. Eddie blinks. Robin really </span>\n<em>\n<span>was</span>\n</em>\n<span> successful, shit.</span>\n</p>\n<p>\n<span>Steve moans quietly in the bed, his eyes still glued shut. Eddie smiles at him, and watches him from a distance. Eddie slowly slips his leather jacket out from under his battle vest, and drops it on the floor next to the bed.Then, after a moment, he also slips his shirt off from under the battle vest.</span>\n</p>\n<p>\n<span>“Miss Nancy,” He turns around, arms crossed to cover his bare chest, “Why exactly am I sweating my ass off in here?”</span>\n</p>\n<p>\n<span>She waves towards Steve, and breaks away from Robin. Even by the window, they’re still both sweating. “You have to sweat Upside Down infections out.”</span>\n</p>\n<p>\n<span>“Right, of course. Obviously.” He curls his fingers into a fist, and holds it near his chest. “Is there any way we can cool this off now that he’s, uh, magically cured?”</span>\n</p>\n<p>\n<span>Nancy glances at the window, and then back at Eddie. “I’ll go ask around.”</span>\n</p>\n<p>\n<span>She slips out the door and, with a quick glance at Steve, Robin scampers after her. Eddie watches them go, then turns his attention to the hospital bed. The room is impossibly too hot to cuddle with Steve, so Eddie just moves to awkwardly hover at his side. He runs a hand through Steve’s sweat-drenched hair, and watches the IV slowly drip into Steve’s arm. Eddie hates hospitals, and has since his mom passed. Every visit reminds him of her last days, and the few times he saw her fail to help the kids she knew.</span>\n</p>\n<p>\n<span>Steve’s chart pokes straight up by his bed, and Eddie squints to read it. There’s two infections noted on there, and Eddie frowns just a bit. “I shouldn’t have tried to get you drunk,” Eddie mumbles.</span>\n</p>\n<p>\n<span>“You were trying?” Steve whispers. Eddie legitimately jumps.</span>\n</p>\n<p>\n<span>“Fuck, Stevie!”</span>\n</p>\n<p>\n<span>Steve cracks a small, wounded smile. “Stevie?”</span>\n</p>\n<p>\n<span>“Shut up.”</span>\n</p>\n<p>\n<span>“It’s hot as fuck in here.”</span>\n</p>\n<p>\n<span>Eddie shrugs. “Yeah, well, you literally had to sweat the devil out. And I think you’re already running a fever–”</span>\n</p>\n<p>\n<span>“Because you got me drunk?”</span>\n</p>\n<p>\n<span>Eddie just wants to punch him and tell him </span>\n<em>\n<span>no, you just fucking suck at caring for infections</span>\n</em>\n<span>. Instead, he leans down and gives Steve a quick kiss. “Yeah, Stevie. Because I got you drunk.” And then the air conditioning kicks on.</span>\n</p>\n<p>Steve spends the next day in and out of consciousness, and Eddie never leaves his side. His body still feels weird, and it can easily be written off as the antibiotic drip making him woozy. But part of him knows it’s his brain is readjusting to the amount of real-estate it can take up in Steve’s body. Every stolen touch from Eddie helps – everywhere his hands roam when no one’s looking makes Steve want every inch of his skin back for himself.</p>\n<p>His physical healing is uncannily quick, and the hospital offers to discharge him once he spends more time awake than he does asleep. The cops offer to drop Eddie’s charges, too—Hopper’s reinstatement takes only as long as it does for Joyce to find the rules on special elections for sheriff at the library. Steve thinks they’ve pumped too much morphine into his body when he first sees Jim, but everyone gets him up to speed.</p>\n<p>And then he ends the night again in Eddie Munson’s bed, while they prepare for the impending battle. Steve sleeps a lot, lulled by the rustle of his friends breezing through the trailer every once in a while. His arms ache for Eddie’s figure, but only Nancy and Robin know about them. He isn’t quite prepared for this secret to get out there just yet.</p>\n<p>Finally, the next morning, Robin wakes him up softly before the sun comes up. “How you feeling, cowboy?”</p>\n<p>“Cowboy?”</p>\n<p>“Ya know, because you’re into leather now?” Steve punches her arm. She grins. “Attaboy. You think you’re down for the fight today?”</p>\n<p>“I think I need to get dressed.” Steve doesn’t get dressed. He doesn’t move. Instead, he wakes up hours later to Dustin at the end of his bed—Eddie’s bed. Dustin’s hair and clothes are a mess of dirt and blood and torn armor, and when he finally speaks, Steve thinks he might still be dreaming.</p>\n<p>“We lost.”</p>\n<p>“What?”</p>\n<p>“Me and Eddie. We lost.”</p>\n<p>“Where is he?”</p>\n<p>And its Dustin’s words now that leave Steve in a freefall, send him spinning headfirst into the little time the last few days provided. “He stopped running.”</p>\n<p>Because they both know what he means. Because otherwise Eddie would be there himself. Because the world is still cold and cruel and set up to ruin everything Steve could ever try to build for himself.</p>\n<p>He doesn’t move for another day. Robin has to force food down his throat, and even then, he can tell she wants to curl into herself and give up, too. There’re tears cried until there aren’t tears left to cry, and water chugged so that there’re more tears to cry. Mike asks Steve how he and Eddie knew each other, and Steve thinks his chest might just cave in.</p>\n<p>“Vecna got away,” Steve says suddenly. Robin’’s curled into his side, and she startles when he speaks. Looking back on it, he isn’t sure he’s done that in a day. “Eddie’s fucking gone, and Vecna’s still fucking out there, and we couldn’t do anything.”</p>\n<p>Robin pulls him into her chest, and he’s sobbing again. Big huge screaming sobs that shake both of them and pull at everything Steve has left. He wants to die. He wants to swap places with Eddie. He wants to have woken up and gotten dressed and won the goddamn battle by his boyfriend’s side.</p>\n<p>Because of course they’d be boyfriends now, wouldn’t they? Steve would pop the question just as easily as he did with Nancy and they’d live happily ever after. And Eddie would get his diploma. And they’d leave this cursed town for ever.</p>\n<p>“Why did I apply to Scoops,” Robin whispers, as Steve starts to regain his composure. “I could’ve gone my whole life not knowing about alternate dimensions or brain suckers…”</p>\n<p>“Or me.”</p>\n<p>“The worst burden of them all.”</p>\n<p>“Fuck you.”</p>\n<p>Robin kisses his forehead, and mumbles, “I love you.”</p>\n<p>“I know.”</p>\n<p>“You need to stop working at Family Video.”</p>\n<p>On the second day, Nancy joins them in Eddie’s comically small bed, curled up between Steve and Robin. It’s a bit strange at first, thinking that he’s third-wheeling with his ex-girlfriend and her new S.O., but it’s also one that he’s used to. And it doesn’t change their dynamic one bit: they all hold onto each other like there’s no hope outside of that room alone.</p>\n<p>On the third day, Steve sees his second ghost in the last week.</p>\n<p>He wakes up before the girls, all of them still intertwined in Eddie’s sheets. Steve can’t help but reminisce on how Freshman him would give him now a high-five. The thought alone makes him nauseous.</p>\n<p>Slowly, Steve extracts himself from the situation, and sneaks out into the kitchen. His feet feel weird pacing on solid ground after so much time spent in the bed.</p>\n<p>He digs through the limited supplies in the kitchen, managing to extract some coffee grounds from their groceries. He sets to work, putting together Wayne’s old Mr. Coffee and filling it up. He leans against the counter and hits start, and then his sobs once again shoot through his body.</p>\n<p>Someone wraps their arms around his waist, and pulls him in. For a minute, Steve can’t help but think about how much they all smell like Eddie’s smoke and soap after all their days in his house. And he’s pleasantly reminded of the comfort Eddie’s arms used to offer, even if they sent him reeling at the same time.</p>\n<p>“I’m sorry,” Steve whispers.</p>\n<p>“It’s okay,” Eddie whispers back.</p>\n<p>On instinct, Steve spins around and punches Eddie right in the nose. He watches Eddie stumble back, waiting for him to melt into the zombies all of his friends have struggled with in Vecna’s mind palace.</p>\n<p>Only, he doesn’t. Instead, he just clutches his bloody, broken nose, and swears softly under his breath.</p>\n<p>“Fucking hell, Harrington,” He mumbles. “When I said I liked it rough, I didn’t mean like <em>that</em>.”</p>\n<p>Steve goes dead still. “Holy fuck. Eddie.”</p>\n<p>“Yeah?”</p>\n<p>“I thought you were dead.”</p>\n<p>“I figured.” Eddie grabs a dishrag off the counter and presses it to his face. Then, he smiles at Steve. “Do you know how many bats I had to fight off to get here? This hero shit <em>sucks</em> man.”</p>\n<p>Within seconds, Steve pulls him into the biggest hug Steve Harrington might be capable of. Because its <em>Eddie</em> and he’s <em>okay</em> and Steve’s just <em>a little bit in love with him</em> already. And he can’t stop himself from saying all these things, because this is it. Vecna hasn’t won. Eddie’s home safe and sound and in Steve’s arms again and they can always just turn up the heat if he’s hurt.</p>\n<p>Eventually, they have to wake Robin and Nancy. They have to call the rest of the party. They have to tell Wayne, who isn’t at all surprised – “Eddie, son, I have known you your whole life, and you’ve never been anything but a survivor,” – and Joyce and Hopper, who are. And everyone knows the battle must go on another day, til they can close the gates and take down Vecna for good, but there’s something about it. About Eddie and Steve and Hopper <em>surviving </em>it all that makes it so much more manageable in everyone’s eyes.</p>\n<p>It also means, though, that everyone must get ready. Spring break’s coming to a close. The kids – Everyone but Steve – have classes to prepare for and chores to do. And after a light celebration, everyone has to go home and face the right-side-up world.</p>\n<p>“Do you wanna stay?” Eddie asks Steve. He stands at the front door, watching everyone leave. Steve wonders if he’ll ever tell any of them about him and Eddie. He hopes they last long enough that he can.</p>\n<p>“Yeah.” He loops an arm around Eddie’s waist, and he’s impossibly smitten with how well they fit together. He’s impossibly smitten with Eddie, too, and maybe that’s why he loves this so much.</p>\n<p>“Did you mean it, earlier?”</p>\n<p>Steve looks over at Eddie, but for all the studying he’s done of the boy, he can’t make out his expression. “Mean what?”</p>\n<p>“You said you were a little bit in love with me.”</p>\n<p>“Oh.” Of course that’s what he meant. Because Steve fucked up. Because Steve moved too fast. Because Eddie wasn’t in love with Steve and now it’s going to ruin everything. “I mean, I don’t, like, wanna push you or anything, it was just a comment and you were alive and—”</p>\n<p>“Steve, it’s okay!” Eddie glances over at Steve, and, for a brief moment, Steve feels somehow as if he’s looking in a mirror. The logical side of his brain wins over and tells him he most definitely isn’t. Then, Eddie nuzzles his face into Steve’s neck. “I fought killer bats to get to you,” He whispers.</p>\n<p>“Yeah?”</p>\n<p>“Because I am ridiculously, stupidly, in love with you.”</p>\n<p>“I love you too, prison boy.” Eddie laughs against Steve’s skin, and Steve instantly knows how much he means it.</p>"
}