{
  "id": "3948544",
  "url": "https://archiveofourown.org/works/3948544?view_full_work=true",
  "author": [
    "flywithtaetae (kimtaehyungs)"
  ],
  "title": "Date Me",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jeongguk | Jungkook/Kim Taehyung | V"
  ],
  "characters": [
    "Kim Taehyung | V",
    "Jeon Jeongguk | Jungkook",
    "Park Jimin (BTS)"
  ],
  "additional_tags": [
    "Alternate Universe - Coffee Shops & Cafés",
    "because why not",
    "Fluff and Fluff",
    "attempted but fail crack",
    "i dont really know what this is"
  ],
  "language": "English",
  "series": "",
  "published": "2015-05-16",
  "completed": null,
  "words": "5,439",
  "chapters": "1/1",
  "comments": "192",
  "kudos": "12,482",
  "bookmarks": "1,546",
  "hits": "115,171",
  "summary": "<p>Taehyung flirts with the cute high school boy and relishes in the flustered reaction he gets for almost an entire year. But when the following year comes along, he finds himself choking on his own words.</p>",
  "notes": "<p>Trying to overcome my writers block and also to make up for putting my readers through an emotional roller coaster ride with my previous fic. OTL But thanks for all the love for \"Will you be my Forever?\"!! \\o/</p>\n<p>This isn't like my other fic and the genre is really just fluff, attempted but failed crack so don't expect too much.</p>\n<p>(Also, read it in:<br><a href=\"https://ficbook.net/readfic/3250777\" rel=\"nofollow\">Russian</a> by Baek.Yeol</p>\n<p>Thank you for translating!!)</p>\n<p> </p>\n<p>Soonshim is Taehyung's dog ^^</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>cringe</p>",
  "text": "<p> </p>\n<p>Kim Taehyung works part-time as a barista slash cashier at the cafe around the corner of his street. He and his best friend, Park Jimin, had been working there ever since graduating high school almost a year and a half ago, and now balancing freshman year of college and part-time work.</p>\n<p> </p>\n<p> </p>\n<p>He comes across at least a hundred customers per day and while some had caught his attention, he was never kept intrigued for long. It was either because he always found someone else who was much more interesting and eye-catching, or the customer just didn't return often enough for Taehyung to maintain his curiosity.</p>\n<p> </p>\n<p> </p>\n<p>But there <em>is</em> one customer, a high school boy, who had someone managed to capture Taehyung's attention.</p>\n<p> </p>\n<p>There isn't exactly anything special about the boy - fair skinned, neat and short trimmed raven hair, huge round eyes, chubby cheeks and red pouty lips - but Taehyung <em>somehow</em> finds himself drawn in.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung was appointed as the front line cashier one fine Friday during summer, when he saw the boy for the first time; dressed in a school uniform and an absolute adorable stuttering and blushing mess in front of him.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\"Good evening, what can I get for you?\" Taehyung greets warmly with a smile.</p>\n<p> </p>\n<p> </p>\n<p>\"U-um, what's good h-here?\" The boy's cheeks flush and Taehyung couldn't help the upward quirk of his lips.</p>\n<p> </p>\n<p> </p>\n<p>\"All are good but it depends... Coffee or non-coffee?\"</p>\n<p> </p>\n<p> </p>\n<p>\"N-non-coffee please,\" the boy mumbles, but the cafe is quiet enough for Taehyung to pick it up.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung chuckles, \"Not into coffee, huh?\" The boy blushes again as he shakes his head. <em>Cute.</em> \"How about Double Chocolate Ice Blended? One of my all-time favorites.\"</p>\n<p> </p>\n<p> </p>\n<p>The boy contemplates for a second before he shyly nods, \"Okay.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Whipped cream?\" The boy nods again and Taehyung keys the order into the system before he reaches out for a cup, \"Oh, regular or large?\"</p>\n<p> </p>\n<p> </p>\n<p>The boy looks mildly flustered (and Taehyung thinks the boy might be thinking somewhere along the lines of <em>I just wanted a drink why do I have to answer so many questions</em>) but quickly composes himself, \"Um, r-regular is f-fine.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Regular double choco ice blended coming your way then!\" Taehyung chirps and grabs the regular sized plastic cup before turning to the boy again, \"And what would be the name of this lovely boy I am serving?\" Taehyung purposely drops an octave lower, and he finds himself cooing internally at how the boy flushes once more, mouth opening and closing.</p>\n<p> </p>\n<p> </p>\n<p>\"J-Jungkook, Jeon Jungkook\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung hums before writing it on the cardboard around the cup, \"Pretty name for a cute boy like yourself,\" he flashes a grin and the boy- <em>Jungkook</em>- splutters, eyes wide and ears turning red as he half protests and half thanks Taehyung.</p>\n<p> </p>\n<p> </p>\n<p>Even as Taehyung receives the payment from Jungkook, he purposely grazes his fingers with Jungkook's. He finds himself reveling at how the round eyes widen just the slightest and how the blush on the raven boy's face darkens, before he scurries away to the other side of the counter to wait for his order.</p>\n<p> </p>\n<p> </p>\n<p>Jungkook keeps his head down as he patiently waits and Taehyung serves the next customer, occasionally stealing glances at the boy, briefly wondering if he had crossed a line. He didn't mean to make the boy flustered, but the reactions he had gotten was <em>so</em> damn adorable that he couldn't help himself. And when Jimin is done and hands Jungkook his drink across the counter, Taehyung watches with amusement as Jungkook immediately heads out, fumbling with the door that wouldn't budge because he<em> pushed</em> instead of pull.</p>\n<p> </p>\n<p> </p>\n<p>And just like that, Taehyung finds himself smiling for the rest of the evening, thinking of blushes on fair skin and round innocent eyes.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>Taehyung had been so sure that that would be his first and last encounter with Jungkook. He was so so <em>so</em> sure that he had scared Jungkook off and had gotten himself, and the cafe, on the boy's blacklist but surprisingly he was wrong.</p>\n<p> </p>\n<p> </p>\n<p>The following Friday, there is a chime and Taehyung looks up from his phone to smile at the customer. When he sees neat raven hair and familiar round eyes, his smile gets wider.</p>\n<p> </p>\n<p> </p>\n<p>\"Good evening, what can I get for you today, Jungkook?\" He smiles softly, eyes bright as he looks down at his slightly shorter customer, patiently.</p>\n<p> </p>\n<p> </p>\n<p>Jungkook looks surprised that Taehyung remembers his name but well, how <em>can</em> he forget such a cute boy?</p>\n<p> </p>\n<p> </p>\n<p>\"Um, I guess Double Chocolate Ice Blended will do,\"</p>\n<p> </p>\n<p> </p>\n<p>\"Oh wow, you're not blushing and stuttering today!\" Taehyung teases and just at the mention of it, Jungkook actually does blush and look away from Taehyung's eyes. Taehyung feels a flutter within his chest because <em>how</em> can someone sound confident one moment and blush the next moment? \"Regular and whipped cream, yes?\"</p>\n<p> </p>\n<p> </p>\n<p>Jungkook nods and Taehyung smiles, proceeding to the routine of keying in the order and writing the customers' names on the cup, before placing it on a rack and promptly pressing a bell to alert Jimin of a new order.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung accepts the payment and he almost laughs when Jungkook hands him a bill by holding the very edge of it, as if afraid Taehyung would <em>accidentally</em> touch him again. \"You're from that art school beside the national library right?\" Taehyung asks when he sees no queue behind the boy. No harm for small talk, right? And also maybe because he wanted to know more about this cute boy in front of him. Jungkook nods hesitantly. \"Which grade?\"</p>\n<p> </p>\n<p> </p>\n<p>\"Um, second grade.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Oh! Graduating next year then? All the best!\" Taehyung pumps a fist in the air and Jungkook actually smiles for the first time, immediately reminding Taehyung of a cute bunny. \"You're really cute by the w- <em>ouch</em>!\" Taehyung winces and he turns around to glare at whoever hit his head but when he comes face to face with his manager, Kim Seokjin, he immediately gulps and cowers.</p>\n<p> </p>\n<p> </p>\n<p>\"Uh,\" he starts.</p>\n<p> </p>\n<p> </p>\n<p>\"What did I tell you about flirting with the customers?\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung pouts a little, \"But I wasn't! It's called being friendly,\"</p>\n<p> </p>\n<p> </p>\n<p>His manager rolls his eyes, \"Like hell,\" he mutters. \"Switch with Jimin,\" the older man jerks his head backwards to Jimin who is blending the beverage and slightly dancing to a song playing in his head.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung pouts even more and then huffs, begrudgingly turning to take over Jimin's place behind him, but not before glancing at Jungkook and discreetly shooting a wink, making the younger boy blush again.</p>\n<p> </p>\n<p> </p>\n<p>Satisfied, he elbows Jimin out of the way when the blender stops. And with muscle memory, he pours the mix into Jungkook's cup until it fills to the brim, spraying whipped cream and putting the lid on. He side glances to check if his manager is still present and when he sees no sight of the man, he digs out a marker from the pocket of his apron. Hurriedly, he scribbles somewhere beside Jungkook's name.</p>\n<p> </p>\n<p> </p>\n<p>When he passes Jungkook his drink, he makes sure that what he has scribbled is facing the younger boy and he watches as the boy's eyes fall on it. He freezes slightly before glancing at Taehyung. And of course Taehyung wouldn't want to miss a chance. He winks at Jungkook before returning to his place at the blending machines, feeling satisfied when he sees Jungkook hastily walking out of the cafe.</p>\n<p> </p>\n<p> </p>\n<p>Jimin turns to look at Taehyung questioningly, eyes sparkling with curiosity, \"<em>What</em> did you do to the poor boy?\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung laughs and shrugs, eyes twinkling with mischief.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>you're really really really cute!! ^^</em>\n</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>Taehyung is even more surprised when Jungkook doesn't stop coming to the cafe. As if being teased by him wasn't embarrassing enough for the younger boy. But Taehyung is secretly glad, because he gets to have some fun as he attempts to flirt with the raven haired boy and hey, maybe Jungkook isn't opposed to the whole thing which is why he keeps coming back no matter how badly Taehyung makes him flustered.</p>\n<p> </p>\n<p> </p>\n<p>Even his other co-workers have come to acknowledge of Taehyung's slight obsession towards teasing the high school boy and they don't particularly mind because they <em>agree</em> that Jungkook is really beyond adorable. And they also liked seeing how Taehyung smiles so brightly at the younger boy and how the latter's eyes seem to be glowing even when he gets embarrassed. They think the Taehyung-Jungkook interaction is cute.</p>\n<p> </p>\n<p> </p>\n<p>His manager doesn't think so though, because Taehyung gets banished to the position of a barista when he sees Taehyung <em>harassing</em> the poor flustered kid.</p>\n<p> </p>\n<p> </p>\n<p>And it honestly sucks coffee beans because he sees and talks to Jungkook for only 13 seconds (no he <em>didn't</em> count) when the boy drops in every Friday, compared to an approximate of 25 to 30 seconds when he attends the front line.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung secretly prays to Santa that Seokjin will not get his present this year because bad boys don't get presents, right?</p>\n<p> </p>\n<p> </p>\n<p>But that doesn't deter Taehyung from scribbling short messages, both flirty and encouraging, or cute drawings, like an elephant or kittens or lions, on the cardboard fitted around the body of the cup.</p>\n<p> </p>\n<p> </p>\n<p>When he passes Jungkook his beverage, the boy doesn't stutter or blush as much as he did before since it has been a little over three months since his first visit. He smiles shyly at Taehyung now, already used to all the teasing, and only blushes when Taehyung writes embarrassing things or compliments on the cardboard.</p>\n<p> </p>\n<p> </p>\n<p>And Taehyung really <em>really</em> likes the shy smile on Jungkook's face so he never fails to write a little something whenever the boy comes around on Fridays, until it becomes a habit.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>\"Why don't you ask him out?\" Jimin asks him when they are walking home one night after closing up the cafe.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung scrunches his nose, scratching it, \"Nah, I don't exactly like him like that. He's just cute.\" He pauses and adds as an afterthought, \"I think.\"</p>\n<p> </p>\n<p> </p>\n<p>Jimin snorts, \"You like him alright. Are you perhaps waiting for him to become an adult? I mean, he is in high school right now while you're already a college student.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Not exactly, I'm actually pretty contented with it being like this.\" He ignores the weird look Jimin gives him. \"Plus Seokjin hyung is gonna kill me, telling me I seduce the customers,\" he chuckles just thinking of how much scolding he had gotten by his manager ever since Jungkook came around. Jimin laughs along.</p>\n<p> </p>\n<p> </p>\n<p>\"You know he doesn't really mean it, right? Or maybe he does. Maybe he's just worried for Jungkook and doesn't want such an innocent boy to be in the likes of someone like you.\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung furrows his brows, \"What do you mean <em>someone like me</em>?\"</p>\n<p> </p>\n<p> </p>\n<p>Jimin smirks, \"Oh I don't know? A college student preying on innocent high school boys maybe? Pedophile?\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung gasps and whacks Jimin in the arm, \"Am not!\" He stops walking and huffs angrily when Jimin continues cackling. \"And Jungkook's only 2 years younger than us, okay?\" When his best friend doesn't stop laughing, he runs and jumps, throwing himself on Jimin's back, making the other boy yelp in surprise. \"You hurt my feelings Park Jimin, you're <em>so</em> piggy backing me back home.\"</p>\n<p> </p>\n<p> </p>\n<p>Jimin makes a noise of irritation but he hooks his arms underneath Taehyung's legs nevertheless. \"Anyway, winter break's coming.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Yeah, and so?\"</p>\n<p> </p>\n<p> </p>\n<p>\"So... Jungkook might not come around because hey, there's no school right?\"</p>\n<p> </p>\n<p> </p>\n<p>It sinks in and Taehyung suddenly feels a little sad at the thought of not seeing his bunny, \"Oh.\"</p>\n<p> </p>\n<p> </p>\n<p>\"Yeah. Still not going to confess?\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung leans his head against Jimin's, \"I'll think about it when he graduates.\"</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p>When winter break comes around in December, Jungkook <em>really</em> stops coming to the cafe.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung finds himself pouting and whining on Fridays as he mixes the beverages and brews the coffee. He finds himself missing the younger boy's round eyes and shy smiles and hell, he even misses writing messages and drawing cute shit on the boy's cup. By the end of the third week, Taehyung feels extremely lethargic because he isn't getting his weekly dosage of cute bunnies in the form of a high school boy.</p>\n<p> </p>\n<p> </p>\n<p>Jimin pats him in the back each time and offers Taehyung a piggy back every Friday night after they do close up and Taehyung almost wants to cry at how super duper amazing his best friend is.</p>\n<p> </p>\n<p> </p>\n<p>\"Don't worry, TaeTae, only three weeks left!\"</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>Three weeks later, Taehyung goes to work feeling giddy and excited at the thought of seeing Jungkook again. He doesn't even try to deny Jimin's teasing of his hopeless crush with the younger boy.</p>\n<p> </p>\n<p> </p>\n<p>Because it's true. Taehyung is <em>definitely</em> crushing on Jungkook. He spent the entire one and a half months of high school students' winter break working on his school work and brewing up beverages for customers. It's not like it isn't fun at all, but he feels slightly empty when Jungkook doesn't come through the door on Friday evenings with his round eyes and shy smiles. He had been whining continuously at Jimin and the other new part-time worker, Hoseok, about how bunny deprived he is and now that winter break is over, he is bouncing in his spot every single day.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It takes like forever before Friday finally rolls around and Taehyung keeps turning back from the machines to look at the door whenever he hears the chime. He almost gets whiplash at how fast and eager he turns his head. Well, he doesn't, but he definitely gets dizzy from all the turning and Jimin's laughter and teasing starts to get annoying by the minute.</p>\n<p> </p>\n<p> </p>\n<p>\"Seriously TaeTae, relax will you? I'll let you know when he comes in.\"</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>There are no customers and Taehyung is playing Crossy Road on his phone when he vaguely hears the sound of the chime.</p>\n<p> </p>\n<p> </p>\n<p>\"TaeTae! Bunny sighted at 12 o'clock!\" Jimin half whispers, half shouts, causing Taehyung to accidentally send his chicken into the river. He frowns and almost wants to bite Jimin's hand that had been poking his thigh.</p>\n<p> </p>\n<p> </p>\n<p>\"<em>Ji</em>min I-\"</p>\n<p> </p>\n<p> </p>\n<p>\"Hi! Evening, what can I get for you today?\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung hears Jimin greet the customer and he peeks out from behind Jimin's body and feels his jaw go slack.</p>\n<p> </p>\n<p> </p>\n<p>Jungkook's hair has positively grown longer over the holidays and one would think that students would chop it off before school reopens but apparently <em>not</em> Jungkook. The short hair has grown much longer, falling over his eyebrows, and currently sporting a shade of dark brown, and <em>oh my god</em> is that a piercing? The younger boy doesn't look like a kid anymore and rather than plain cute, he's a mixture of cute and handsome.</p>\n<p> </p>\n<p> </p>\n<p>\n<em>Wow.</em>\n</p>\n<p> </p>\n<p> </p>\n<p>He gapes until Jimin knocks him on the head with the plastic cup and demands him to get to work because <em>the beverages won't make themselves, idiot</em>.</p>\n<p> </p>\n<p> </p>\n<p>Half his mind is floating back to Jungkook as he works on said boy's order of the usual Double Chocolate and he accidentally sprays a little too much of the whipped cream that it kind of overflows messily when he places the lid on. Staring at it for a second, he shrugs and reaches out for the marker in his apron's pocket and scribbles a <em>final lap! fighting! p.s you look good </em>and a smiley face beside Jungkook's name. He turns around to the waiting customer and grins, eyes flickering from the brown hair and the piercings and then to Jungkook's eyes.</p>\n<p> </p>\n<p> </p>\n<p>\"I hope you don't mind extra whipped cream,\" he says sheepishly.</p>\n<p> </p>\n<p> </p>\n<p>Jungkook looks at the cup of overflowing whipped cream before he looks at Taehyung with amusement playing his face. He shakes his head and smiles, \"Extra whipped cream is fine. Thank you.\"</p>\n<p> </p>\n<p> </p>\n<p>Taehyung nods dumbly and continues to stare at Jungkook's retreating figure until the younger boy steps out of the shop because is that his cute bunny or...?</p>\n<p> </p>\n<p> </p>\n<p><em>Wow.</em> </p>\n<p> </p>\n<p> </p>\n<p>He really missed Jungkook.</p>\n<p> </p>\n<p> </p>\n<p>\"Kim Taehyung!\" A scream of his name jolts him out of his daze and he looks at Seokjin, wide-eyed, as the man points to the orders in queue, and he scrambles back to his machines, muttering an apology.</p>\n<p> </p>\n<p> </p>\n<p> --</p>\n<p> </p>\n<p> </p>\n<p>It takes time for Taehyung to get used to the change in Jungkook’s appearance. He finds himself staring just a tad bit longer whenever Jungkook collects his order from him. And he thinks he sees what seems like a glint in those round eyes, but he’s not too sure what it means. Still, it doesn’t stop him from scribbling on Jungkook’s cup and even though the younger boy doesn’t mention it, he always gives Taehyung a knowing look from over the counter and Taehyung smiles back, feeling his heart beat a little faster.</p>\n<p> </p>\n<p> </p>\n<p>But just when Taehyung is starting to get used to and get over the hair and piercings, Jungkook comes in and catches Taehyung off guard two months later.</p>\n<p> </p>\n<p> </p>\n<p>Not only did Jungkook enter the café on a Saturday evening, the younger boy also, instead of the usual yellow blazer and black pants, comes in wearing a white loose tank top and black sweatpants and his hair is <em>wet</em>.</p>\n<p> </p>\n<p> </p>\n<p><em>Wet</em>.</p>\n<p> </p>\n<p> </p>\n<p>And those <em>arms</em>.</p>\n<p> </p>\n<p> </p>\n<p>When was Jungkook <em>this</em> attractive?</p>\n<p> </p>\n<p> </p>\n<p>Taehyung chokes on the Caramel Ice Blended he is sipping on and the coughing fits has every head turning at him, <em>including</em> Jungkook. His eyes lock with that belonging to Jungkook and he sees the younger boy’s wide eyes looking at him with shock and concern. Taehyung can feel his face growing hotter and he immediately flees through the STAFF ONLY door, startling Hoseok who is having his break.</p>\n<p> </p>\n<p> </p>\n<p>“What the-“ Hoseok puts down his meal and bends over Taehyung, slapping his back.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung points at the door outside, “C-cus- <em>coughs</em>- tomers,” he wheezes.</p>\n<p> </p>\n<p> </p>\n<p>“What about you? Are you going to be okay?”</p>\n<p> </p>\n<p> </p>\n<p>“I’m ninety nine percent- <em>coughs</em>- sure I’m gonna survive this ordeal- <em>coughs</em>- I can’t die yet! I haven’t sent- <em>coughs</em>- Soonshim for marriage!” He cries out.</p>\n<p> </p>\n<p> </p>\n<p>Hoseok gives him one last pat at the back before grabbing a bottle of water and passing it to him, “Take your time.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Ten minutes after he’s stopped coughing and stopped staring blankly into space, he takes a peek outside. When he has confirmed that Jungkook is gone, he quietly walks to where Jimin and Hoseok is.</p>\n<p> </p>\n<p> </p>\n<p>Jimin looks up from sipping on <em>his</em> drink and raises an eyebrow, “Real smooth, TaeTae, <em>real</em> smooth.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung groans before glaring at the offensive beverage in Jimin’s hand and he just really wants to burn it for putting him through such embarrassment. He’s so damn embarrassed right now that he contemplates quitting the job and moving to another city where Jeon Jungkook doesn’t exist, to hell with college. He is never going to be able to face Jungkook again after this.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>But then the coming Friday, he finds himself brewing the usual order of Double Chocolate Ice Blended for Jeon fucking Jungkook.</p>\n<p> </p>\n<p> </p>\n<p>Jimin said he was being ridiculous and Jungkook probably isn’t going to remember him choking on his stupid drink so Taehyung didn’t have be so dramatic and move to another city.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung had pouted for the rest of the week and refused to accept Jimin’s offers of piggy back rides.</p>\n<p> </p>\n<p> </p>\n<p>He writes a<em> handsome</em> in front of Jungkook’s name and draws tears all over it before he turns to pass him his order without meeting the younger boy’s eyes.</p>\n<p> </p>\n<p> </p>\n<p>“Are you okay?” Came the voice and Taehyung immediately snaps his head up, mouth agape.</p>\n<p> </p>\n<p> </p>\n<p>That is definitely the first time Jungkook had ever started a conversation with him. Other times he’d just be answering Taehyung’s questions or simply smiling back at him.</p>\n<p> </p>\n<p> </p>\n<p>“I was talking about you know- last Saturday.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung suddenly wishes he could mop the floor with his face right now. He awkwardly laughs, feeling himself flush in embarrassment, “Y-yeah! I-I’m alright, just a m-mishap,”</p>\n<p> </p>\n<p> </p>\n<p>It would have been fine if Jungkook had just smiled and let it go but the boy <em>smirks</em>, “Mishap, huh?” And again it would have been fine if Jungkook didn’t have a teasing look in his eyes, as if he <em>knew</em> what actually happened.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung definitely wants to mop the whole café with his face. He feels his face grow hotter and he’s at loss for words.</p>\n<p> </p>\n<p> </p>\n<p>“Thanks and see you,” Jungkook gestures to the drink in his hand, smirk still on his face as he turns to take his leave.</p>\n<p> </p>\n<p> </p>\n<p>The barista stands rooted to the ground and wonders when Jungkook ever stopped smiling and starts smirking at him.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>It goes on like that, short conversations back and forth every Friday without Taehyung taking a step further like asking Jungkook to hang out. He honestly didn’t want to push it because he knew it isn’t the right time. Jungkook’s a senior in high school now and he is bound to be tied down for finals.</p>\n<p> </p>\n<p> </p>\n<p>Jimin doesn’t agree though because he thinks that Taehyung and Jungkook’s relationship had been too stagnant and he is damn sure- he’ll bet his and Taehyung’s friendship on it- that Jungkook also feels something for Taehyung.</p>\n<p> </p>\n<p> </p>\n<p>“If I calculate the time you and Jungkook ever spoke to one another, I’m pretty sure it won’t even accumulate to a day. Hell, I don’t even think it exceeds an hour,” Jimin tells him one day.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung stops rearranging the chairs and frowns, “That really hurts my pride,”</p>\n<p> </p>\n<p> </p>\n<p>Jimin snorts, “I keep telling you to ask him out. People might be kissing the ground he walks on, have you seen how hot and attractive he’s becoming these days? Damn,”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung rolls his eyes. Of course he knows, he of all people should know since he practically can’t take his eyes off the younger boy whenever he’s in a 10 meter radius vicinity. Especially those days when Jungkook decides the weather is too hot for him to put on the blazer and wears only the inner dress shirt. That boy has been hiding such a good body underneath all that clothes…</p>\n<p> </p>\n<p> </p>\n<p>“Yeah and I keep telling you I’d wait until he graduates,” Taehyung huffs. “Why are you so persistent anyway?”</p>\n<p> </p>\n<p> </p>\n<p>Jimin stops wiping the counters and stares at Taehyung, “Because I’m so tired of seeing the two of you flirt for like the past- oh my God- almost two third of a year now!” he throws his hands up in the air and the towel flies and lands on a machine behind him.</p>\n<p> </p>\n<p> </p>\n<p>“It’s been a year already?” Taehyung mumbles to himself, surprised, as he watches Jimin pick the towel and continue wiping. “But aren’t you afraid I’ll spend more time with Jungkook and less with you?”</p>\n<p> </p>\n<p> </p>\n<p>Jimin shoots him a look, “Will you?”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung gasps and puts a hand over his chest, “I would never!”</p>\n<p> </p>\n<p> </p>\n<p>Jimin laughs, “But it’s bound to happen anyway when we find love for ourselves. And then you won’t be needing piggy back rides from me anymore since you have Jungkook and his muscles.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung blushes and groans, taking a cloth out and furiously wiping a spot on the table. Just when he’s about to forget about it.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>On one of the Fridays, Jungkook unexpectedly doesn’t come and it has Taehyung raising his eyebrows. Jungkook didn’t seem like someone who would break a habit and it has Taehyung biting his lip in nervousness. Did something happen? Did Jungkook get sick of the Double Chocolate? Did he finally realize that Taehyung is annoying? In the end, he brushes it off as Jungkook being busy with his final year.</p>\n<p> </p>\n<p> </p>\n<p>When Jungkook doesn’t show up the following week, Taehyung can only purse his lips and keep quiet even when Jimin or Hoseok shoots him a questioning look. It’s not like he has enough of a reason to feel slightly upset that Jungkook’s not coming anymore right? <em>It’s just a crush</em>. Perhaps the boy was out of money and couldn’t afford the weekly sweet treats anymore, or maybe life got in the way.</p>\n<p> </p>\n<p> </p>\n<p>Weeks turn into months, questioning gazes turn into pitiful ones and Taehyung goes from feeling worried to upset and regret. Regret because he feels as if he has so many things he wants to talk to Jungkook about and a cupboard around a plastic cup just wouldn’t quite do it.</p>\n<p> </p>\n<p> </p>\n<p>The end of the year arrives soon enough yet there is still no sight of Jungkook. Taehyung pretty much gives up and carries on life as per usual. Seokjin deems it safe for Taehyung to start attending the front line now because he hasn’t seen Jungkook come in anymore. Taehyung accepts of course. He’s spent too much time dealing with machines and coffee powders, he needs to speak to living beings who won’t only make a buzzing sound.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>And then it happens.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Like any other day in the late evening, the crowd in the café lessens and Taehyung has much more free time to try and beat his top score in Crossy Road. The bell chimes and Taehyung immediately looks up, ready to greet the customer and take an order but his voice gets caught somewhere.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung could never mistake him, but the younger male in front of him looks so much different compared to the last time he saw him. Gone is the brown hair, replaced by a shade of maroon and those chubby cheeks that Taehyung loved are also gone. What catches his interest most is the sharp jawline and the row of piercings that decorated both his ears.</p>\n<p> </p>\n<p> </p>\n<p>It’s when the maroon haired male steps in front of Taehyung that the cashier realizes that he is now looking up into Jungkook’s eyes. The boy has grown <em>taller</em>. And those <em>eyes</em>. Jungkook is so damn attractive, what the hell.</p>\n<p> </p>\n<p> </p>\n<p>“J-Jungkook-sshi?” is the first thing that leaves Taehyung’s lips, protocol of greeting customers long forgotten.</p>\n<p> </p>\n<p> </p>\n<p>Jungkook smiles at him, eyes still bright like how Taehyung always remembered though there is a sort of intense and strong gaze that pierces deep into his soul.</p>\n<p> </p>\n<p> </p>\n<p>“Taehyung-sshi, it’s been a while.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung gawks, “You know my name?”</p>\n<p> </p>\n<p> </p>\n<p>Then smile turns into a smirk and Taehyung suddenly feels like he can’t breathe, “You wear a nametag.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung looks down and splutters when the name Kim Taehyung on a gold pin glares back at him, “I f-forgot,”</p>\n<p> </p>\n<p> </p>\n<p>Jungkook chuckles, eyes crinkling, “Right,” and then he smirks again. “Missed me?”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung stares at Jungkook, face flushing a color enough to rival Jungkook’s new hair color. “W-what? W-why would-“</p>\n<p> </p>\n<p> </p>\n<p>“<em>Oh my God</em>! Where have you been? TaeTae has been missing you like crazy!” Jimin appears out of nowhere, hanging off Taehyung’s back, making the edge of the counter dig into Taehyung’s hip.</p>\n<p> </p>\n<p> </p>\n<p>Taehyung feels extremely betrayed as his mouth parts in shock and he feels his face burn with embarrassment. “Park Jimin!” He hisses.</p>\n<p> </p>\n<p> </p>\n<p>There is a chime of a bell and the cashier and barista immediately puts on their professional façade, returning to their work stations.</p>\n<p> </p>\n<p> </p>\n<p>The cashier looks at Jungkook only to feel his heart beat so much faster when Jungkook smugly smirks at him, eyes twinkling, “You missed me,”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung glances at the customer behind Jungkook and pointedly ignores Jungkook, trying not to appear as flustered as he feels, “W-what can I get for you today?”</p>\n<p> </p>\n<p> </p>\n<p>Jungkook hums, “Regular Pure Vanilla Ice blended please,”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung looks up and tries to hide the surprise on his face. <em>He drinks coffee now?</em> “Whipped cream, yes?”</p>\n<p> </p>\n<p> </p>\n<p>“Of course.”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung feels himself tremble under Jungkook’s stare as he keys in the order. Even as he proceeds to take the next customers’ order, he can’t help but feel intimidated yet extremely surprised at how much Jungkook has changed over the past few months. The boy has gained so much confidence and even had the nerve to slightly tease him.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>What the hell.</em>\n</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p> </p>\n<p>Taehyung is still on cashier duties the following week and when Jungkook walks through the door, he braces himself. He is <em>not</em> going to be shaken by Jungkook.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\"Good afternoon, what can I get for you?\" Taehyung chirps, eyes bright and determined.</p>\n<p> </p>\n<p> </p>\n<p>\"You,\"</p>\n<p> </p>\n<p> </p>\n<p>Jimin promptly laughs behind him and Taehyung finds himself gaping at Jungkook, his face heating up as he tries to find his voice. <em>Where</em> did this boy find all that confidence?</p>\n<p> </p>\n<p> </p>\n<p>\"I'm s-sorry but apparently <em>y</em><em>-y</em><em>ou</em> is not on the menu...\" He tries his best to remain compose but when Jungkook smirks at him, he immediately looks away and clears his throat. <em>Dammit</em>, he’s not supposed to be flustered. He has half the mind to reach over the counter and wipe the smirk off the handsome face.</p>\n<p> </p>\n<p> </p>\n<p>“Will it ever be on the menu?”</p>\n<p> </p>\n<p> </p>\n<p>Taehyung glares at Jungkook, “<em>You</em> is not for sale,”</p>\n<p> </p>\n<p> </p>\n<p>\"Of course. You can only belong to one person,\" Taehyung feels his knees buckle when Jungkook stares into his eyes, soft smile playing his lips, \"Mocha Chip Frappe then- regular- with whipped cream of course,\"</p>\n<p> </p>\n<p> </p>\n<p>\"Right, okay,\" Taehyung keys in the order and reaches for the cup, writing Jungkook's name with trembling hands before he places it aside for Jimin to deal with.</p>\n<p> </p>\n<p> </p>\n<p>When he receives the payment from Jungkook, he feels the brush of the younger boy's fingers against his and he finds his face heating up. Taehyung kind of wants to jump back and run away because why oh <em>why</em> does he like the feel of Jungkook's skin so much?</p>\n<p> </p>\n<p> </p>\n<p>“You should mix my drinks next time,” Jungkook suddenly says.</p>\n<p> </p>\n<p> </p>\n<p>“Why?”</p>\n<p> </p>\n<p> </p>\n<p>The younger boy shrugs, “Because you always write these cute things for me,”</p>\n<p> </p>\n<p> </p>\n<p>And Taehyung wants to melt into a puddle of goo at that moment. He smiles a little and nods, “Of course, and congrats’ on your graduation by the way.”</p>\n<p> </p>\n<p> </p>\n<p>Jungkook looks surprised but shyly smiles back at him and Taehyung laughs. The boy is still so cute underneath all that sexy exterior and confident look.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>And he has no complains about that.</p>\n<p> </p>\n<p> </p>\n<p>--</p>\n<p> </p>\n<p><br>\nAfter the last encounter with Jungkook, Taehyung moves to the counter behind the cashier, opting to mix the beverages instead. He’d like to think of it as no one else should mix Jungkook’s orders except him, and also because he still wants to scribble messages and draw cute shit for the younger boy.</p>\n<p> </p>\n<p> </p>\n<p>It’s a busy Tuesday afternoon and he’s going through a set of orders in the queue, reaching out for the next cup, when the name catches his eye. He feels his heart slam in his ribcage and he gasps.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>Date me, Kim Taehyung-sshi</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Taehyung turns around, immediately spotting Jungkook staring elsewhere, face partially hidden by the snapback on his head. He feels his heart swell at the sight of a shy and nervous Jungkook and he turns back to the machines, carefully mixing Jungkook’s order of Double Chocolate with a grin on his face.</p>\n<p> </p>\n<p> </p>\n<p>It had been unexpected really, because Jungkook still only ever comes on Fridays. But it seems like Jungkook loves to catch him off guard these past few months.</p>\n<p> </p>\n<p> </p>\n<p>Taking out his marker, he scribbles underneath it before he turns around and serves the beverage to Jungkook who is looking at him expectantly with a blush decorating his cheeks.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>yes! of course!!! definitely!!!!!</em>\n</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>And just like that, Kim Taehyung’s love story begins.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> --</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It's a busy day. Summer is kicking in and the temperature outside is increasing, so people come strolling in to their cafe to get themselves a beverage to cool down.<br>\n<br>\n<br>\n<br>\nTaehyung's been mixing drinks non-stop, just like how Jimin's been attending to customers behind him. It's getting tiring honestly and he really can't wait for lunch when he can finally relax and maybe switch duties with his best friend later. Glancing at his watch, he takes note that he needs to endure for another half an hour and he sighs, washing the blender before putting it back in its place.<br>\n<br>\n<br>\n<br>\nThe barista checks the next order on the screen in front of him and reaches for the next cup. Taehyung finds himself smiling a little too wide when he sees the name scribbled on the cup. The stress depletes and he feels his tense shoulder relax as he chuckles. He takes extra care and pours in more love than usual as he blends the beverage this time round. Once done, he pours it into the cup and sprays a little more whipped cream before he puts the lid on.<br>\n<br>\n<br>\n<br>\nAnd like always, for the past two years now, he takes out his marker and scribbles underneath the name.<br>\n<br>\n<br>\n<br>\nWith a satisfied grin, he turns around to pass the customer his order.<br>\n<br>\n<br>\n<br>\nJungkook grins back at him when he takes hold of the cup and Taehyung is being brought back to the first time he ever saw Jungkook smile.<br>\n </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\n<em>Kim Taehyung’s<br>\nkook-ah, i love you</em>\n<em>♡</em>\n</p>\n<p> </p>\n<p> </p>"
}