{
  "id": "39749292",
  "url": "https://archiveofourown.org/works/39749292?view_full_work=true",
  "author": [
    "stereobone"
  ],
  "title": "Whole Lotta Love",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Stranger Things (TV 2016)"
  ],
  "relationships": [
    "Steve Harrington/Eddie Munson"
  ],
  "characters": [],
  "additional_tags": [
    "Podfic Available"
  ],
  "language": "English",
  "series": "",
  "published": "2022-06-19",
  "completed": null,
  "words": "9,632",
  "chapters": "1/1",
  "comments": "464",
  "kudos": "18,767",
  "bookmarks": "3,806",
  "hits": "133,644",
  "summary": "<p>Steve scoffs. \"I think if I was dating someone, Robin, I would be the first to know about it.\"</p>\n<p>\"Would you, though?\" Robin says.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>*holds steve harrington and eddie munson up like marge simpson* i just think they're neat</p>\n<p>twitter @stereoroo and tumblr @stereobone</p>\n<p>thanks for reading xx</p>\n<p>now with beautiful, beautiful <a href=\"https://hitorimaron.tumblr.com/post/691307966515822592/inspired-by-whole-lotta-love-by-stereobone\" rel=\"nofollow\">art</a> by hitorimaron!!</p>",
  "text": "<p>By all accounts, they shouldn't be friends. Steve Harrington and Eddie Munson. In his less charitable years, Steve had definitely said some snarky, downright rude shit to Eddie in the halls at Hawkins High, and that was when he even deemed Eddie worthy of noticing. Eddie had responded in his own over-the-top, self-defensive way. And even beyond that, they have nothing in common. Steve is sporty, preppy, \"totally mainstream,\" according to Robin. Eddie is a metalhead, a self-described nerd, and constantly makes references that Steve cannot, for the life of him, make sense of.</p>\n<p>And yet. Ever since everything that went down with Vecna, they hang out almost every day.</p>\n<p>Eddie bounces into Family Video that Friday just before the end of Steve and Robin's shift, the balmy June air behind him, body leaning against the counter like someone took his bones out for him. He's trying to convince Steve to go see <em>Labyrinth </em>with him.</p>\n<p>\"Dustin already lost his marbles at me about that movie,\" Steve says, sliding a video back into its sleeve. \"It's something with the Muppets? Jim Henson?\"  </p>\n<p>\"Steve, Steve, no,\" Eddie says. \"Not just Muppets. David Bowie.\"</p>\n<p>Eddie leans way closer than he needs to so he can emphasize this point, but Steve is used to the fact that Eddie has no concept of personal space by now. He feels Eddie's warm breath on his face. Eddie is always touching or brushing against him. Steve taps his shoulder placatingly. </p>\n<p>\"Yeah, I mean I like Bowie, I guess. It just sounds like a kids' movie.\"</p>\n<p>\"So let us bring the children. Aren't we co-parenting the little gremlins?\"</p>\n<p>That's been a running joke between them for the better part of three months now. At first it was just Dustin. But now Mike, Sinclair, Max, all of them. They're all apparently their children. If it weren't for Eleven and Will packing up back in California, they'd be there on the list too, Steve is sure.</p>\n<p>\"Oh, just go, Steve, you know you want to,\" Robin says.</p>\n<p>She emerges from the bathroom with fresh eyeliner and new outfit. Eddie grapevines to her and picks her up for a hug. Once he lets her go, he looks her outfit up and down.</p>\n<p>\"This is a date outfit.\" He glances at Steve. \"Is this a date outfit?\"</p>\n<p>\"It's a date outfit,\" Steve says, then whispers, \"she and Vickie are going to touch boobies.\"</p>\n<p>\"Don't be gross!\" Robin says.</p>\n<p>\"I'm kidding!\"</p>\n<p>Robin presses her fingers together.</p>\n<p>\"I mean, I want to touch her boobies, to be clear. Absolutely. But like, in a totally cute way. If she wants me to. Someone please stop me from talking about this anymore.\"</p>\n<p>Eddie claps his hands together. He's wearing a sleeveless black shirt, arms wiry and slightly tanned from the summer sun.</p>\n<p>\"Right, so. <em>Labyrinth</em>?\"</p>\n<p>\"Eh,\" Steve says.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>They go see <em>Labyrinth. </em>Dustin, Lucas, Max, and Mike join. It's absolute chaos in the van, what with Max and Lucas arguing over whether the music Eddie is playing is Judas Priest, even after Eddie loudly announces that, yes, he is playing Judas Priest. It's chaos at the theater when they're buying popcorn, the four of them unable to pour enough fake butter on top of the tub, and finally quiet as the movie starts.</p>\n<p>Somehow, <em>Labyrinth </em>is more enjoyable than Steve thought it would be. Maybe it's because Kermit the Frog decidedly isn't in it, or maybe it's because Eddie is nodding his head along to the music, laughing and genuinely enjoying the hell out of himself. It's nice, Steve thinks, to see him happy, and not terrified that he's going to be arrested and locked away for a murder he didn't commit.</p>\n<p>The chaos begins again on the ride home.</p>\n<p>\"All I'm saying is that maybe David Bowie wasn't the villain,\" Dustin says.</p>\n<p>\"He stole a baby,\" Mike says. \"That's, like, literal villain behavior!\"</p>\n<p>\"Only because she wished it!\"</p>\n<p>\"She didn't think it would literally happen,\" Max says.</p>\n<p>\"Children,\" Eddie says. \"Don't make me turn this van around.\"</p>\n<p>Steve throws a rogue popcorn that got caught in his jacket at Dustin's head.</p>\n<p>\"He'll do it, so help me.\"</p>\n<p>They drop the kids off and everything is much quieter, but it's a good kind of quiet. Steve watches Eddie out of the corner of his eye. He's concentrating very hard on the road, hands locked on the steering wheel. It's easy to tell, now, that it's one of those nights, for Eddie. Steve clears his throat as they draw closer to his neighborhood.</p>\n<p>\"You want to spend the night?\" he asks.</p>\n<p>Eddie's eyes cut to him in the darkness, wide, wet.</p>\n<p>\"Sure, man,\" he says.</p>\n<p>They've done this before. A lot, actually. Steve remembers how it started, must have been over two months ago now. A phone call from Eddie near midnight. Steve was watching a rerun of <em>The Golden Girls </em>on the couch when the phone rang. He'd picked it up and said, \"Harrington residence?\" to Eddie's shaky laughter on the other end of the receiver.</p>\n<p>\"Wow, is that seriously how you answer the phone?\"</p>\n<p>Steve squinted.</p>\n<p>\"Munson?\"</p>\n<p>\"Hey, man. How's it hanging at the Harrington residence?\"</p>\n<p>Steve sat upright on the couch, flustered. He gestured to the house, like Eddie could see it over the phone.</p>\n<p>\"This is my parents' house. You could've been someone for my dad!\"</p>\n<p>\"At 11:45 at night?\" Eddie said.</p>\n<p>\"Whatever, dude. What's up? It's Tuesday night.\"</p>\n<p>There was a pause over the line. For the first time, Steve registered Eddie's unsteady breathing. He switched the phone to his left ear, cord wrapping over his body.</p>\n<p>\"Um, yeah, nothing,\" Eddie said. \"Just can't sleep.\"</p>\n<p>Steve held the phone tighter in his hand, turned away from the TV even though it was still muted.</p>\n<p>\"I get that,\" he said.</p>\n<p>There was another, longer pause.</p>\n<p>\"Yeah,\" Eddie said. \"I should go, right? I should hang up—\"</p>\n<p>\"Just come over,\" Steve said, so Eddie did.</p>\n<p>At first, Eddie stayed in the guest room, but that wasn't enough, sometimes he has a nightmare and if Steve's parents are home, it's quicker and easier if they share a bed. Steve can wake him up, can console him. Steve doesn't mind, honestly. He's got a king-size bed and plenty of extra clothes, not that Eddie ever wears them.</p>\n<p>Inside, Eddie uses the extra toothbrush Steve got for him, and they strip down to their underwear and crawl into Steve's bed. Steve hears Eddie exhale heavily on the bed, then remove his rings one by one and set them on the nightstand.</p>\n<p>\"It's okay,\" Steve says, after a stitch of hesitation. \"You're not running away.\"</p>\n<p>\"I should be able to sleep in my own house.\"</p>\n<p>Steve turns to him. Eddie has his eyes on the ceiling like he's remembering. Steve touches his bare shoulder.</p>\n<p>\"You didn't run away, remember? I invited you. It's okay to have a bad night. Shit, you being here even helps me.\"</p>\n<p>\"Really?\"</p>\n<p>Eddie looks at him now, smiles. He has a disarming smile, but Steve's known that for a while.</p>\n<p>\"Yeah,\" Steve says. \"Try and get some sleep.\"</p>\n<p>He clicks off the light and feels Eddie shift closer to him, sigh. Steve closes his eyes.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Things changed, he knows, when Eddie stitched him up.</p>\n<p>Shortly after Eddie shredded the guitar on top of his own goddamn trailer to stop Vecna from brutally killing Nancy, Steve started to succumb to blood loss, because, as it turned out, the bites from the bats were pretty bad. Eddie and Nancy dragged him to the couch, and for a horrible, sickening moment, Steve thought he was going to die like this, taken out by stupid Demobats.</p>\n<p>Then Eddie was ripping his bandages off and shrugging out of his leather jacket, eyes serious.</p>\n<p>\"Oh, wow, no, I think the bandages should stay on,\" Steve had said weakly.</p>\n<p>\"Relax, Steve, I got you. My uncle Wayne was in Korea. He taught me a thing or two about field dressing.\"</p>\n<p>Eddie rifled through the cabinets and came back with a first aid kit, a bottle of clear alcohol, washed his hands, and went to work. The second his fingers touched Steve's skin, Steve felt like he was on fire. It <em>hurt</em>, and Nancy tried to soothe him through, and somehow Dustin and Max tried to backseat suture, but Steve heard Eddie's voice the whole time, felt his hands across his skin.</p>\n<p>\"You're doing great, Steve,\" he said. \"Ozzy as fuck, I'm telling you.\"</p>\n<p>Steve looked at him. Eddie's tongue was pressed over his bottom lip, brows pinched in concentration. His hands were bloody. Then he looked up at Steve. And he smiled.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>They pick up Robin the next morning and get breakfast at a diner near Family Video, something that has become a bit of a tradition since Eddie started sleeping over at Steve's house. Steve honestly thought that Robin would have some sassy, cute little comments about Eddie sleeping over, but it's been months, and she hasn't said a word. Steve picks her up before their shift, and Eddie follows behind in the van. He consistently orders chocolate chip pancakes and a side of turkey bacon. Somehow, Steve finds this extremely puzzling and extremely endearing.</p>\n<p>\"<em>Well, </em>how was everyone's night?\" Robin asks.</p>\n<p>Steve sets his coffee down.</p>\n<p>\"Are you kidding me? I now know <em>way </em>too much about David Bowie's crotch thanks to <em>Maze</em>—\"</p>\n<p>\"You mean <em>Labyrinth</em>?\" Eddie says.</p>\n<p>He's trying to pour milk into his coffee but only succeeding in sloshing it over the side of his cup from how hard he's laughing. Steve elbows him.</p>\n<p>\"Whatever. You went on an actual date with…you know. Tell us about that.\"</p>\n<p>Robin taps her nails against the table for a moment before perking up in the booth. It's so obvious she wants to talk about her night with Vickie. She glances around quickly to make sure no one is noticing before gushing about how Vickie picked her up and they went skating at the roller rink until closing.</p>\n<p>\"Was she good to you, Buckley?\" Eddie says. \"Because I swear…\"</p>\n<p>\"No, it was…amazing.\" Robin sighs, drops her voice to a whisper. \"We kissed in the car.\"</p>\n<p>\"I knew it,\" Steve says. \"I fucking knew it. I told you she liked boobies.\"</p>\n<p>Robin hisses. \"Keep your voice down, dingus.\"</p>\n<p>Their food arrives. Robin and Steve eat fast so they can make it to Family Video on time, shoveling down eggs and toast and hash browns. Eddie cuts into his pancakes neatly. Their server leaves the coffee pot, since Eddie can't seem to make it through breakfast without having three cups minimum. At the end of breakfast, Robin slaps her fork down on the table and slides against the vinyl of the booth.</p>\n<p>\"And now I'm ready for a day of customer service,\" she says. \"Would you like to join, Eddie?\"</p>\n<p>\"As tempting an offer as that may be, I gotta work on the new D&amp;D campaign for Dustin and the other little gremlins.\"</p>\n<p>Steve refills his coffee mug halfway.</p>\n<p>\"I don't know how to break it to you, Munson, but you did actually manage to graduate high school,\" he says. \"You don't have to do Dustin's nerdy bidding anymore.\"</p>\n<p>\"Uh, you try saying no to that kid. Besides, lest you have forgotten, I'm a nerd. Campaigns are fun for me.\"</p>\n<p>Steve stares at him from under his lashes.</p>\n<p>\"Trust me, no one has forgotten you're a nerd.\"</p>\n<p>Eddie beams at him. He's got a lick of whipped cream near the corner of his lips that his napkin didn't quite reach. Steve points to it, finger making a circle motion.</p>\n<p>\"You've got whipped cream on your face, nerd.\"</p>\n<p>Eddie frowns and wipes at his mouth.</p>\n<p>\"Other side,\" Steve says.</p>\n<p>Eddie wipes again.</p>\n<p>\"Yeah, no, that's. You're literally just missing it.\"</p>\n<p>Eddie holds his hands up. \"Is it like, on my forehead or something?\"</p>\n<p>\"Jesus, man,\" Steve says, and reaches out and wipes the whipped cream away with his finger. Simple. Eddie touches the spot where his finger was with his hand, holds it there.</p>\n<p>Robin clears her throat.</p>\n<p>\"Right,\" she says. \"So, we should get going unless we want to be late? Steve?\"</p>\n<p>\"Right,\" Steve says.</p>\n<p>They pool their cash together and pay.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>They meet at Skull Rock once to smoke weed, and Eddie walks up smelling like gasoline and artificial cherry. His shirt is stained bright red, too garish to be blood. Steve feels his throat go tight with rage.</p>\n<p>\"Who did this?\"</p>\n<p>The smile Eddie's got plastered on drops.</p>\n<p>\"No one,\" he says. \"It's fine. Don't worry about it.\"</p>\n<p>\"Eddie—\"</p>\n<p>\"Seriously, man. Leave it alone. It doesn't matter.\"</p>\n<p>He's got dried slushie on his neck, and Steve wants to tell him that it does matter, of course it matters. Against all bets, Eddie stayed in Hawkins. He told everyone it was because he wasn't going to cave to the town, to whatever twisted rumors they might come up with. Hawkins was his home. But Steve knows, without asking, he knows, that Eddie has nowhere else to go. So, Steve says nothing. He grabs some napkins from the glove compartment of his car and wets them and wipes the red from Eddie's neck. Eddie lets him. He can see and feel Eddie's pulse beneath his fingers. Likes the way it flutters, like a bird beating its wings under the tender skin of his neck.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Saturdays at Family Video are always busiest, so Steve and Robin don't get a chance to talk until the midday rush clears out. They start straightening up the shelves and getting ready to rewind the returns that inevitably have not been rewound. The lower shelves are always a disaster from little kids knocking over movies with their uncoordinated little bodies. Steve crouches down and rearranges things. Robin comes over and drapes herself dramatically over the shelf.</p>\n<p>\"Tell me something fun is going on tonight,\" Robin says. \"If one more person comes in here asking if we have <em>Top Gun </em>when the movie isn't even in theaters yet, I'm going to scream.\"</p>\n<p>\"Uh,\" says Steve. \"Does <em>Star Wars </em>count as fun?\"</p>\n<p>\"Sorry, did you just say <em>Star Wars</em>?\"</p>\n<p>Steve straightens a VHS that's already been righted, shrugs.</p>\n<p>\"Yeah, I mean. Dustin and Mike and all of them have been going on at me for ages to watch those stupid movies, and Eddie has them, so. We're going to watch tonight at his place.\" Steve stands. \"But honestly, I don't get how you can have an episode four, without there being three previous episodes? Chronologically, it doesn't make any sense.\"</p>\n<p>When he turns to Robin, she is just staring at him, like Steve has grown a second head, or suddenly started speaking German. Steve remembers his manners.</p>\n<p>\"Do you want to come? Unless you have another date with—\"</p>\n<p>Robin punches his shoulder.</p>\n<p>\"Ow, shit, Rob! Invitation rescinded!\"</p>\n<p>\"Invitation rejected,\" Robin says.</p>\n<p>Steve rolls out the shoulder she punched. He forgot that she could punch so damn hard. He fiddles with some VHS tapes on the top shelf now that he's standing just to have something to do with his hands. Not sure why he feels oddly nervous. Sometimes, talking about Eddie makes him nervous in a way he can't unravel.</p>\n<p>\"What do you have against <em>Star Wars</em>?\" he asks.</p>\n<p>\"Nothing,\" Robin says. \"That just seems like…you know. Guy time. I don't want to interrupt.\"</p>\n<p>Steve snorts.</p>\n<p>\"Um, I don't think a movie about a star war is considered guy time, but okay.\"</p>\n<p>\"Oh my god, you really have no idea what you're going into tonight, do you?\" she says.</p>\n<p>\"What are you talking about? It's <em>Star Wars</em>.\"</p>\n<p>Robin's hand grabs his shoulder, the same one she punched moments earlier, and squeezes, some soft, unreadable smile on her face.</p>\n<p>\"Sure it is,\" she says.  </p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Eddie's trailer is warm when Steve shows up, which he apologizes profusely for. Tailer a/c, he explains, never works as well as it should. As a result, he's wearing a crop top, stomach on full display. He's got the same manic, bouncy energy to him as he usually does, only it seems dialed up even higher. The air smells like frankincense and processed cheese. Steve kicks his shoes off at the door and watches Eddie grab them Mountain Dew from the fridge, pizza already steaming hot on the stove.</p>\n<p>It's an oddly homey place, which Steve wants to mention but doesn't, because he knows that Eddie can hardly stand to be here most times, even this feels like a huge step. So, he just watches Eddie jump from the kitchen to the front room, hair trailing behind him. He's got all three films spread out on the coffee table.</p>\n<p>\"Okay,\" Steve says. \"You have to come sit down, you're making me nervous.\"</p>\n<p>\"Sorry,\" says Eddie. \"It's just—your first time watching <em>A New Hope</em>? The atmosphere has got to be just right. To be fair, I think <em>The Empire Strikes Back </em>is the best film by far, but the first one is still amazing. You're going to love it.\"</p>\n<p>\"I don't even really understand what you just said, but okay.\"</p>\n<p>Eddie cackles, but he finally, finally sits down on the couch, and cracks open a Mountain Dew.</p>\n<p>\"For the sake of my heart, even if you don't like them, just lie,\" he says.</p>\n<p>Then he hits play.</p>\n<p>The music starting up almost startles Steve off the couch. He's not expecting the long block of yellow text, and he leans forward to read it. He's not sure he's going to like this. He's not sure he can lie convincingly about that.</p>\n<p>As it turns out, he loves it. To the point of yelling at the TV.</p>\n<p>\"Are you kidding me? After all that, Han Solo is just going to leave? He's just going to fucking leave them?\" Steve grabs Eddie's knee. \"Does he come back? Tell me he comes back, Munson.\"</p>\n<p>Eddie throws his head back and laughs.</p>\n<p>\"Dude, I am not ruining the ending for you!\"</p>\n<p>\"Oh my god! I can't take this.\"</p>\n<p>Steve grabs another slice of pizza to calm his nerves, because this may be too much. He cannot believe he spent so long deprived of this film. He's going to have to severely underplay how much he's enjoyed this, simply because Dustin will never let him live it down and he knows it. When Han Solo comes back to help Luke destroy the Death Star at the end, Steve literally stands up. Eddie watches him from the couch, and he looks extremely pleased.</p>\n<p>When the credits roll, Steve understands that his life has been fundamentally changed. Before Eddie can even open his mouth, Steve starts rewinding the tape for him.</p>\n<p>\"Right, so? The next one?\"</p>\n<p>\"I feel like I'm corrupting you or something,\" Eddie says.</p>\n<p>\"I'm a nerd now, is this what you wanted?\"</p>\n<p>\"That was my secret plan all along, you got me, Harrington.\" Eddie fiddles with the ring on his index finger. \"Honestly, I was prepared for you to totally hate it. You've got hidden depths, dude.\"</p>\n<p><em>Same for you,</em> Steve thinks. He doesn't know if it's being out of high school, or the life altering experience of the Upside Down, but he no longer clings to the persona he once embodied. It was an identity, and not one he's particularly proud of. And Eddie, he definitely comes off strong, but it's all defense. Steve gets it. Thinks of his slushie stained t-shirt, how he still won't say who threw the drink at him.</p>\n<p>They start <em>The Empire Strikes Back. </em>About halfway through, Steve feels something knock against his shoulder and realizes it's Eddie. He's dozed off, head tucked against Steve, face lax. Steve wants to wake him, poke fun at him for falling asleep during his supposed favorite film, but Eddie looks so peaceful. His chest rises and falls steadily, the exposed skin of his stomach, full lips parted, so alive, so incredibly solid against him. Steve thinks about shifting his arm so Eddie can rest more comfortably against his side. Instead, all he's doing is staring at him.</p>\n<p>Someone knocks on the trailer door. Steve pulls his eyes back to TV so fast he nearly gets dizzy. Eddie wakes up slowly, blinking into reality.</p>\n<p>The knocking comes again, more insistent. Eddie immediately gets a nervous looks in his eyes, so Steve gets up, grabs the ashtray off the coffee table and unlocks the door.</p>\n<p>It's Max.</p>\n<p>\"Holy shit, Max,\" he says, and tucks the ashtray behind him. \"A phone, ever heard of it?\"</p>\n<p>She points behind her. \"I literally live right there. Why are you here?\"</p>\n<p>Steve schools himself from saying something childish like, <em>none of your business. </em></p>\n<p>\"We were watching—a movie. What's up? It's late.\"</p>\n<p>Max shoulders her way inside and immediately sits next to Eddie on the couch. Steve shuts the door, since apparently this is happening, sets the ashtray back down, and squeezes in on the other side of her. She squints at the TV.</p>\n<p>\"Is this <em>Star Wars</em>?\"</p>\n<p>Steve pauses the movie.</p>\n<p>\"What's the trouble, Max?\" Eddie says.</p>\n<p>Max is tapping her shoes against the carpet, mouth working. She looks…nervous. And now Steve is nervous. Surely something hasn't happened. Surely, they can have three months of peace without <em>something </em>going wrong in this town.</p>\n<p>\"Do you think I'm old enough to have sex?\" she says.</p>\n<p>\"Oh shit,\" says Eddie.</p>\n<p>\"Uh,\" Steve says.</p>\n<p>\"Because I think I'm old enough,\" she says, barreling on. \"But Lucas wants to wait. And I don't know—\"</p>\n<p>\"No, no, no.\" Steve plugs his ears with his fingers. \"Lalala, I am not hearing this.\"</p>\n<p>Max gives him a severe look. And behind that, Steve can see that she looks genuinely, honestly conflicted. Steve would love to tell her to just talk to her mom about it, but, well, she's probably lost in a bottle right now. He looks over her head to Eddie. He makes eye contact with Steve, genuine, if a little alarmed. He says nothing, though.</p>\n<p>\"Okay,\" Steve says, rubbing his hands over his face. \"I guess I'm taking over co-parenting duties tonight.\"</p>\n<p>\"What,\" Max says.</p>\n<p>\"Listen,\" Steve says. \"No one can tell you when you're old enough to have sex. I mean—once you're like. You know. Not a little kid. If you're ready to…have sex—oh my god, I can't believe I just said that—that's fine. But if Lucas wants to wait, that's also fine. As long as no one is pressuring anyone before they're ready.\"</p>\n<p>Max makes a face like what Steve said makes sense, and at the same time, makes no sense. At least her leg has stopped bouncing.</p>\n<p>\"So, what, we don't have to be ready at the same time?\"</p>\n<p>\"No,\" Steve says. \"It's like…Jedi powers. Everyone comes into them at a different time.\"</p>\n<p>\"Steve, what,\" Eddie says.</p>\n<p>Steve covers Max's ears and stage whispers over her head, \"I am panicking here.\"</p>\n<p>\"I can still hear you,\" Max says.</p>\n<p>Steve drops his hands. Max quickly fixes her hair, and seems to have a better understanding of what Steve is trying to tell her, which is great, because Steve feels like he's honestly dying.</p>\n<p>\"That was the dumbest metaphor I've ever heard,\" she says. \"But I guess that makes…sense?\"</p>\n<p>\"He's right,\" Eddie says. \"Talk to Lucas. It'll be fine. It's fine to wait.\"</p>\n<p>They send Max off with a slice of cold pizza and watch her until she's safe back in her trailer. Steve lets himself sag back into the couch after, absolutely drained. Eddie sits next to him, equally boneless. They sit for a long time in silence, <em>The Empire Strikes Back </em>still paused in front of them. If Eddie was falling asleep before, he most definitely is awake now.</p>\n<p>\"This is going to make me sound old,\" Steve says. \"But thinking about any of those kids having sex is just…no.\"</p>\n<p>\"They're babies,\" says Eddie.</p>\n<p>\"And I realize that's hypocritical, because I was like, sixteen when I lost my virginity.\" Steve nudges his leg against Eddie's. \"What about you?\"</p>\n<p>Eddie looks at him. His face is completely unreadable at first, only the longer Steve stares at him, the more readable his face becomes. Everything he's trying to say is spelled out right there. Steve sits upright.</p>\n<p>\"Wait, really? You're serious?\"</p>\n<p>Eddie's smile is only a little self-deprecating.</p>\n<p>\"I mean I've done…stuff, but. Come on, man, I failed high school twice and ran the D&amp;D club, no one was exactly lining up to jump into bed with me.\"</p>\n<p>\"Yeah, but you're like…good-looking.\"</p>\n<p>Eddie slaps his palm to his heart, smile changing from critical to charmed. Despite himself, Steve's face heats up.</p>\n<p>\"Did you just call me hot?\"</p>\n<p>Steve holds his fingers up.</p>\n<p>\"Okay, I said 'good-looking'. That is just, like, an objective fact.\"</p>\n<p>Eddie is laughing now, but not at Steve. He's just happy. Steve has learned all his tells, and at any rate, there isn't a mean bone in Eddie's body. Steve flops back on the couch and kicks his foot up on the coffee table, upending an empty Mountain Dew can.</p>\n<p>\"I made you like <em>Star Wars </em>and you said I was good-looking all in one night,\" Eddie says. \"That's a personal record.\"</p>\n<p>\"Yeah, yeah, you're cute, laugh it up. Are we finishing the movie or not?\"</p>\n<p>Eddie stops laughing and brings his attention back to the TV.</p>\n<p>\"Shit, yeah. The end of this is going to blow your mind.\"</p>\n<p>Steve gets so invested after learning that Darth Vader is Luke's father that they start <em>Return of the Jedi</em>, but both end up falling asleep on the couch. Steve only wakes up when Eddie's uncle Wayne comes back from the night shift, door creaking open on his return. Steve blinks awake, Eddie still half-sprawled on top of him, fully asleep, and freezes. Wayne simply waves at him, smiles, and heads to the bathroom.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Sophie Sanderson asks him to the Fourth of July carnival at Family Video.</p>\n<p>Steve turns her down. It's hilariously easy to do so.</p>\n<p>\"Already got plans,\" he says. \"Can you believe it?\"</p>\n<p>\"Oh,\" she says, pulling cash awkwardly from her purse.</p>\n<p>She's renting <em>Sixteen Candles. </em>Steve walks her out though, because he's not a total asshole, and when he turns around, Robin is staring at him from the counter, stock still in the middle of painting her nails black. She puts the brush back in the bottle just before she drips on the counter, but her mouth is still open.</p>\n<p>\"She was like, stupid hot, Steve.\"</p>\n<p>\"I know, I know,\" Steve says. \"But we already have plans, remember? We've got, like, two cars full of shitheads to take to the carnival with Eddie.\"</p>\n<p>\"So go out another day!\"</p>\n<p>Steve waves her off. They've got <em>The Breakfast Club </em>playing as their afternoon movie. His choice.</p>\n<p>\"Eh, she's got no personality. We sat next to each other in chemistry. Besides, Eddie and I are thinking of making a road trip to Chicago soon, so I'm kind of busy.\"</p>\n<p>\"Oh,\" Robin says. \"Right. Totally.\"</p>\n<p>She goes back to painting her nails, only Steve can tell she's got something else to say. Whatever it is, she keeps it locked behind her lips, and continues painting her nails, curls her fingers to blow the polish dry. Steve plants his hands on his hips and watches her.</p>\n<p>\"I guess it's kind of funny, though,\" he says. \"You have a date this weekend, and I don't.\"</p>\n<p>\"I wouldn't say that,\" Robin says to her nails.</p>\n<p>\"What?\" Steve says.</p>\n<p>\"Nothing,\" Robin says.</p>\n<p>She beams at him from behind the counter.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>El and Will are freshly back from California, which means everyone is more hyper than usual. Driving El, Will, Mike, and Robin to the carnival nearly caused Steve to have a car accident. He can't imagine how Eddie did, though he does drive safer with kids in the car. Marginally. They meet outside the gates, Lucas and Max holding hands, Dustin looking suitably annoyed, and Erica clearly ready to get inside. Vickie's car pulls up onto the grass moments later.</p>\n<p>\"The deal is we meet back here at ten, right?\" Steve says. \"<em>Right</em>?\"</p>\n<p>\"Yes, <em>dad</em>,\" Mike says. \"Can we go now?\"</p>\n<p>\"Hey,\" Eddie says. \"Don't sass your other father like that. I raised you better.\"</p>\n<p>\"You raised us to be meaner,\" Dustin says.</p>\n<p>Eddie hums. \"That's true.\"</p>\n<p>Steve groans. \"Just go, for fuck's sake.\"</p>\n<p>They all take off running, and it's good, to see them light, to see them run without the horror of something chasing them. Vickie approaches Robin, the two of the hug, release, keep a respectful distance apart. It makes Steve sad in a way he can't quite place. He wishes they could kiss in public. He wants it to not be a big deal.</p>\n<p>\"Um, we're going to hit the Ferris wheel, I think,\" Robin says. \"Meet you at the fun house in thirty?\"</p>\n<p>\"Deal,\" Steve says.</p>\n<p>And that leaves him and Eddie.</p>\n<p>Eddie bounces on his heels a moment, lips tucked together.</p>\n<p>\"Want to ride the zipper and throw up?\" he asks.</p>\n<p>\"Absolutely fucking not,\" Steve says.</p>\n<p>They walk the carnival grounds together. Carnivals have never really been a big draw for Steve. His parents always thought they were beneath them, too many Carnies, and honestly, Steve does find them overwhelming. The noise, the crowds. He's only ever gone, well, on dates. Eddie seems interested in all the rides, except he never stops to go on them, he just talks to Steve. He always talks to Steve. He's almost finished with his new D&amp;D campaign, and sometimes he'll call Steve and just tell him about the specifics of it, and Steve listens even though he's got no idea what the hell Eddie is talking about. It's just nice, listening to Eddie get excited.</p>\n<p>They go by the gaming alley and Eddie stops by a basketball game, suddenly fixated. He grabs Steve's arm and points.</p>\n<p>\"Look at that little guy,\" he says.</p>\n<p>He's pointing to the black cat plushie prize on display. Of course he is.</p>\n<p>\"Well, have at it, Munson,\" Steve says.</p>\n<p>Eddie spins away, chuckling.</p>\n<p>\"Yeah, I have, like, zero hand-eye coordination.\"</p>\n<p>Steve looks back at the prize. Shooting hoops? He wasn't a jock for nothing.</p>\n<p>\"Chill, Munson,\" he says. \"I got this.\"</p>\n<p>Three shots later, the black cat plushie is in his hands. Eddie stares at him, suitably impressed, and Steve tries to not feel cool, but he does, honestly, feel a little cool. He tosses the prize to Eddie, who nearly drops it.</p>\n<p>\"Varsity basketball,\" Steve says.</p>\n<p>They walk around some more. Eat a funnel cake. Meet Robin and Vickie at the fun house surprisingly on time. The inside is mostly mirrors, and the lighting is wonky as all hell. That's when things get weird. Steve watches himself get shorter, taller, fatter, skinner. He hears the carnival music. It all sounds very distant. Then closer, fireworks going off. He's lost track of Eddie. Of Robin and Vickie. Steve stares at himself in one the mirrors, where his body is all disfigured looking, like his bones are snapped in half. He looks dead, he thinks. He doesn't look right.</p>\n<p>\"Hey—\"</p>\n<p>Eddie grabs him by the shoulder. Steve blinks back to himself and realizes he hasn't been breathing. He takes a huge, gasping breath, stumbles, and Eddie catches him, the cat plushie between them.</p>\n<p>\"Hey, hey, it's okay, you're okay,\" Eddie says. \"Let's go outside.\"</p>\n<p>They crouch in the grass together on the side of the fun house. Steve still can't breathe right. The fireworks, the music, all of it. He feels Eddie's hand on his back, soothing, grounding. Eventually, Steve gets his breath back. Eddie's hand stays solid on his back. Steve lets himself collapse into the grass, each firework that pops like a gun going off in his heart.</p>\n<p>\"Can I sleep over, tonight?\" Eddie asks.</p>\n<p>Steve looks over to him. Eddie isn't asking for himself.</p>\n<p>\"Yeah,\" he says, still slightly out of breath. \"Yeah, that's cool, man.\"</p>\n<p>\"Oh my god, Steve, are you okay?\"</p>\n<p>Robin runs over to them. Steve reaches his hand out and they hug. Robin digs through her bag for a bottle of water, pushes it over to him, starts babbling that he needs to hydrate, it's hot, and this will ground him, and she can pour the water on his neck if he needs, or on his wrists, because she's read up on this, naturally, Robin has read up on this sort of thing, she's already uncapping the water for him.</p>\n<p>\"Okay, seriously, I'm fine,\" Steve says. \"I just hate the stupid carnival. Relax, Rob.\"</p>\n<p>He takes the water anyway. He hates worrying her. Eddie's hand stays on his back.</p>\n<p>That night after they drops the kids off, Eddie and Steve get into his bed together, and Eddie brings the cat plushie. Steve stares at him for a moment, then bursts into laughter.</p>\n<p>\"You're not serious with that.\"</p>\n<p>Eddie pulls the cat to his chest, frowning.</p>\n<p>\"You won Frodo for me, and you seriously think I'm going to part from him?\"</p>\n<p>\"Frodo…that's…hold on, I know this, Lord of the Rings?\"</p>\n<p>Eddie smiles with teeth in the dark. He's still clutching the cat like it's an anchor, something to hold him to this moment.</p>\n<p>\"I <em>am </em>corrupting you,\" he says.</p>\n<p>\"Whatever,\" Steve says.</p>\n<p>He punches at his pillow to get more comfortable. Watches as Eddie does the same, snuggles in with his stupid, adorable little cat plushie tucked into his arms. Steve shuts his eyes. After a few moments, he opens them again. Eddie is still wide awake, curled on his side and watching Steve.</p>\n<p>\"Thanks,\" Steve says. \"For earlier.\"</p>\n<p>Eddie smiles again, this time, softer.</p>\n<p>\"Of course, man,\" he says.</p>\n<p>They sleep closer together that night, and when Eddie goes back to his trailer that morning, he decides to leave Frodo at Steve's house, set right between the pillows.</p>\n<p>\"I mean, I'm basically here every other day anyway,\" he says. \"Might as well just leave the little guy with you.\"</p>\n<p>Once he's gone, Steve goes back upstairs and sits on his bed, grabs Frodo, and squeezes him. He looks around and realizes that it's true, Eddie is basically there every other day, to the point that when he's not, the house feels odd without him. Empty. Steve sets Frodo back on the bed and goes to take a shower. His sheets smell like Eddie.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Steve's parents go out of town, and July turns hot. So, Eddie comes over for a night swim to cool off. Eddie's swim trunks are black, because of course they are. They only swim about twenty minutes or so, and Steve climbs out of the pool shivering, snatching the towels off the chairs for them both. He notices Eddie watching him towel down and quirks a brow. Eddie looks away.</p>\n<p>\"I feel like you've gotten hairier,\" he says.</p>\n<p>\"I am most definitely the same hairiness as before,\" Steve says. \"It's not my fault you're like metalhead Bambi.\"</p>\n<p>Eddie splutters. \"I'm what?\"</p>\n<p>\"You heard me.\"</p>\n<p>Eddie wraps his towel around his shoulders and walks dripping over to Steve. It's true, though. Eddie's chest is smooth, there's just the dark trail of hair from his navel down to the waistband of his swim trunks, the wiry hair on his legs. Eddie stops in front of Steve, hair wet around his face. He's too close, as always. The light from the pool gives him an ethereal glow.</p>\n<p>\"How am I Bambi in this scenario?\" he asks.</p>\n<p>\"Has no one seriously ever told you that you have, like, the biggest eyes? Total Bambi eyes,\" Steve says.</p>\n<p>Then he makes the mistake of looking right at them. At Eddie. Eddie with his constant fidgeting and lack of personal space and alarmingly wide eyes. Steve can see himself reflected right back in them. Eddie looks at Steve like he's the center of his universe.</p>\n<p>\"Total Bambi eyes,\" Steve says again, only his voice comes out way softer than he means it too.</p>\n<p>Then they're kissing. Steve isn't sure who moved first. And Eddie's lips, they're nice, and he's only an inch shorter so it's not hard to kiss him, not hard at all. They're both shivering but not so much from the pool water anymore. When Steve pulls back, Eddie's eyes are somehow open wider. Steve finds that he doesn't know what to do now.</p>\n<p>\"Should we, um, get changed?\" he says.</p>\n<p>\"Y-yeah,\" Eddie says, and licks his lips. \"That's probably a good idea.\"</p>\n<p>His smile is easy and soft.</p>\n<p>It's not weird, later, when they climb into bed together. Frodo is tucked up in the pillows waiting, but tonight Eddie ignores him, rolls closer to Steve, close enough that he can throw an arm over Steve's stomach, press his face against his arm. Steve sleeps easy.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>They meet Robin at the diner, as usual.  </p>\n<p>Except that Eddie is wearing Steve's shirt. It's an older band shirt, Tears for Fears, a decidedly unmetal shirt, and Eddie put it on that morning, and looks good in it. He looks <em>great </em>in it. And now they're at breakfast with Robin. Nothing is wrong with this scenario, except that Eddie's never done this before. Steve thinks of wearing Eddie's vest all those months ago, how he kind of wanted to keep it, how Eddie said he could borrow it whenever he wanted, because it \"suited\" him, except he never asked.</p>\n<p>\"Hello, earth to Steve!\" Robin says.</p>\n<p>\"Sorry, what?\" Steve says.</p>\n<p>\"Eddie was literally saying that he is unveiling this new campaign of his in like two days. And you just sat there totally zoned out.\"</p>\n<p>\"Sorry,\" Steve says. \"Caffeine hasn't hit me yet.\"</p>\n<p>He grabs his coffee cup to emphasize that point and takes a sip, then winces. He forgot to put sugar in. On cue, Eddie hands him the sugar from the dispenser. He's chewing on his chocolate chip pancakes, his fucking turkey bacon, giving Steve a soft, secret smile.</p>\n<p>Steve accidentally pours too much sugar into his coffee.</p>\n<p>\"All right,\" Eddie says after breakfast. \"I gotta help my uncle clean today, so. I'll see you cool cats later.\"</p>\n<p>He goes in for a hug that Steve easily returns. He wants to hug Eddie, it's not hard. He's wearing Steve's shirt, and he smells like him, and Steve wants to kiss him again. Steve yanks himself out of the hug and drags Robin to the car with him.</p>\n<p>Robin corners him when they get to Family Video.</p>\n<p>\"Um, what the fuck was that?\"</p>\n<p>Steve punches random keys on the computer. \"What the fuck was what?\"</p>\n<p>\"Whatever just happened with you and Eddie this morning.\"</p>\n<p>Steve snorts at the monitor.</p>\n<p>\"Nothing happened.\"</p>\n<p>Robin comes up behind him and physically spins him around in the stool. Steve grabs the counter behind him to keep from falling. Robin is so close to him that Steve is vaguely reminded of that time they were both painfully interrogated by Russian spies. He swallows.</p>\n<p>\"Steve,\" she says. \"I'm your best friend.\"</p>\n<p>Steve slides off the stool. He feels it, bubbling up his throat, he wants to say it. He looks at the glass doors of Family Video. They haven't even unlocked the doors yet. He presses his lips together, hard. Then inhales.</p>\n<p>\"Nothing, uh, you know, just, uh, Eddie and I, we might have. Kissed.\"</p>\n<p>Robin says nothing at first. She just hugs him. It's a good hug, one of those hugs where Steve feels truly safe, and he can smell the coconut from Robin's shampoo. Just as he's hugging back, Robin pulls away.</p>\n<p>\"That's awesome,\" she says.</p>\n<p>Steve stares at her. The computer is buzzing behind him.</p>\n<p>\"Sorry,\" he says. \"I just…I just told you that I kissed a dude, and you're like, not surprised.\"  </p>\n<p>Robin leans against the counter, blazer shifting as she crosses, then uncrosses her arms. Steve can't stop tapping his foot against the carpeted flooring.</p>\n<p>\"Steve, this may shock you to hear, but I think you and Eddie have been dating for the past three months.\"</p>\n<p>Steve scoffs. He doesn't even take a moment to consider what she's saying, because quite frankly, it doesn't make any sense. Steve is reasonably sure that if he was in a relationship, he would know that he was in a relationship.</p>\n<p>\"I think if I was dating someone, Robin, I would be the first to know about it.\"</p>\n<p>\"Would you, though?\" Robin says. \"Think about the past three months. Eddie stays at your place, <em>constantly</em>, you two have nerdy little dates together, you won him a prize at a carnival, you turned down a date to hang out with him, and then you kissed, and he showed up at breakfast wearing your shirt! What, exactly, did you think you two were doing?\"</p>\n<p>Steve feels his body go a little limp. He leans back against the counter, a thousand little things slotting into place. He needs water. He needs to call Eddie. He needs to reaffirm his manhood by having sex with a woman. No, he doesn't. He has no idea what's happening. He barely registers Robin's hands on his shoulders.</p>\n<p>\"Take a breath,\" Robin says. \"You're fine. It's okay. Just talk to me. How are you feeling?\"</p>\n<p>\"I mean, I still like boobies,\" Steve says. \"I just also like Eddie, apparently.\"</p>\n<p>\"Yeah, there's a word for that. It's called bisexual.\"</p>\n<p>\"I know what bisexual is, Robin, but I'm—\" Steve cocks his head. \"Wait a minute. I think I'm bisexual.\"</p>\n<p>\"So, are you going to keep kissing him?\" Robin says, going straight for the jugular.  </p>\n<p>Steve squeezes his hands together. This, now that he's being honest with himself, this is exactly where he wanted this conversation to go when it started, and at the same time, he doesn't want to even entertain this thought. It was so easy, when it was girls. He liked girls, they liked him. Simple. But with Eddie, Steve feels like he's watching the kids talk about their little physics theories or something. He has no idea where to begin.</p>\n<p>\"Is Eddie even into guys?\"</p>\n<p>\"Oh, Steve,\" Robin says. \"My sweet, sweet little Steve. Why do you think I was comfortable enough telling him that <em>I'm </em>gay? Also, he's rented <em>The</em> <em>Rocky Horror Picture Show </em>like four times.\"</p>\n<p>\"Is that the film you showed me where Tim Curry has really nice legs?\" Steve asks.</p>\n<p>Robin stares into the middle distance.</p>\n<p>\"Holy shit,\" she says. \"How did I not realize you weren't straight sooner?\"</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Robin and Vickie were going to join them that night for a swim, but she has Steve just drop her off at Vickie's instead. She kisses his cheek before she gets out of the car. Steve feels like his heart is going to beat right out of his chest.</p>\n<p>\"Go get your man, Steve Harrington,\" she says. \"God, I love that I get to say that.\"</p>\n<p>It's a painful wait for Eddie to arrive. The chug of his van coming up the street has Steve jumping off the couch, butterflies in his whole body. He's standing by the door and opening it before Eddie even has time to knock.</p>\n<p>\"Wow, someone's excited to swim,\" Eddie says.</p>\n<p>Eddie greets with him a smile that Steve is now realizing is kept only for him. He's still wearing Steve's shirt. He's Eddie. He smells like chocolate and frankincense and yesterday's cologne.</p>\n<p>\"Hey,\" he says, when Steve doesn't answer. \"You look—\"</p>\n<p>Steve pulls him inside and kisses him. The impact must catch Eddie off guard, because he stumbles back against the door. Steve presses himself against him, hand caught up in Eddie's shirt, <em>his </em>shirt, feels Eddie's mouth open under his. They kiss like that, right there in the hall, until Steve has to pull back to breathe. Eddie watches him with a wild, caught look in his eyes.</p>\n<p>\"I had this crazy conversation with Robin earlier,\" Steve says.</p>\n<p>\"Oh yeah?\" Eddie's breathing is shaky.</p>\n<p>\"Apparently, we're dating. Like, we've been dating this whole time.\"</p>\n<p>\"Yeah,\" Eddie says, breaking into a smile. \"I think we might've been.\"</p>\n<p>Steve pulls back. \"You cool with that?\"</p>\n<p>\"Well, I'm super gay,\" Eddie says. \"So yeah, I'm pretty cool with it.\"</p>\n<p>Steve leans in to kiss him again, but Eddie stops him with a hand on his chest.</p>\n<p>\"I have to know,\" he says. \"What, uh, what did you think we were doing all these months?\"</p>\n<p>Steve groans and lets his head drop back. It's ridiculous, now that he's had it spelled out for him, now that it's right in front of his face, and he feels himself blush just thinking about admitting to it.</p>\n<p>\"I don't know!\" He rubs a hand over his forehead. \"We were hanging out! And I just really liked it. I like you.\"</p>\n<p>\"I like you, too,\" Eddie says.</p>\n<p>They meet this time for the kiss, Eddie with his hands in Steve's hair. Steve grabs Eddie by the hips and they step together farther into the house, and it's good. Eddie tastes sweet, tastes like something Steve wants to chase.</p>\n<p>\"I dropped Robin off at Vickie's,\" Steve says between kisses. \"So, we've got the whole house to ourselves.\"</p>\n<p>He pauses and realizes exactly how that sounds. He's not trying to get Eddie into bed. Not like that, at any rate. He's paused for long enough that Eddie giggles. He kisses Steve's jaw, blunt fingernails scratching at his scalp.</p>\n<p>\"I didn't mean it like that,\" Steve says. \"I just meant you don't have to worry—\"</p>\n<p>\"But could you also?\" Eddie says. \"Could you also mean it like that?\"</p>\n<p>Steve shivers. They're by the stairs, Steve with one foot up, so he feels taller than Eddie right now, and Eddie is staring at him, eyes wide and bright under the lights. <em>Bambi eyes</em>, Steve thinks.</p>\n<p>\"I haven't been totally straight with you,\" Eddie says. \"Pun definitely intended. Part of the reason I've never really been with anyone is because I'm gay. Just kind of makes it difficult to put yourself out there.\"</p>\n<p>It's not hard for Steve to read between the lines. That he made it easier for Eddie to put himself out there. That against all odds, this is happening for both of them. So, yes, of course Eddie didn't kiss him first. There are a thousand scenarios in which this moment never happens. Eddie presses his forehead against Steve's.</p>\n<p>\"Take me to bed, Steve.\"</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Eddie naked is something that, Steve realizes, he's been casually thinking about. It's incredible to see. Eddie, hair spilled out on Steve's pillow, tattoos dotting his body, dick curved up towards his stomach. Steve climbs on top of him and kisses him into the mattress. The sensation is completely different, more intense, their cocks touching, Eddie's guitar-calloused fingers grabbing hold of Steve's back. They could do it just like this, Steve realizes, rubbing against each other, and he's more than happy to, until Eddie whispers into his ear that he wants to suck him off.</p>\n<p>\"Please,\" he says, and Steve swears and rolls onto the mattress.</p>\n<p>Eddie knee walks between Steve's spread legs, already twisting his hair back. He licks his lips and looks Steve in the eye. Then he ducks down and kisses the scar on Steve's hip from where he stitched him up, the skin still tender after all this time. Eddie watches Steve through his lashes, reverent, before he trails lower and takes him in his mouth. Steve's hands go to Eddie's hair immediately, pushing the locks back, watching the stretch of his lips. He lets go of the moan he's been holding back, toes curling when Eddie groans around his cock.</p>\n<p>\"Jesus,\" he says. \"Fuck. Fuck, you look so pretty like that.\"</p>\n<p>He knows he's not going to last long, because it's been months, and the buildup comes quick. He taps Eddie's shoulder after a few minutes to let him know, but Eddie keeps on.</p>\n<p>\"I'm—\" Steve pulls his hair without meaning to, but Eddie seems to like that. \"Fuck, Eddie, I'm going to come.\"</p>\n<p>Eddie squeezes his thigh, encouraging, and Steve comes down his throat. When he's finished, Eddie sits up and wipes at his mouth with the back of his hand, panting. Steve pulls him in by the back of the neck and kisses him, tastes his own bitterness on his tongue. Eddie is still hard against his hip. Steve kisses the edge of his lips. His nose. His jaw.</p>\n<p>\"What do you want?\"</p>\n<p>Eddie is shaking.</p>\n<p>\"Just touch me,\" he says. \"Whatever you want.\"</p>\n<p>Steve gently rolls him onto his back, steals a hand down and wraps it over Eddie's cock. It's not like touching his own at all. It's different. It's amazing. Steve gives him an experimental stroke and Eddie's hips jerk, mouth dropping open. Steve presses his whole body against him and gets him off like that, long, unforgiving strokes, Eddie clinging to him and saying his name over and over again into Steve's neck. He comes into Steve's fist, warm.</p>\n<p>\"Oh fuck,\" Eddie says. \"Fuck me.\"</p>\n<p>\"Yeah?\" Steve says, eyebrows raised.</p>\n<p>He's feeling surprisingly bold. He lets his hand drift down behind Eddie's balls, to the hot furl of him, presses the tip of his finger against his entrance just so. Eddie's response is to bare his neck, legs dropping open more. Steve isn't a fool, Robin spent the better part of the day explaining sex between men to him, they don't have what they need, but the slickness of Eddie's come is enough that he could do this, if they wanted.</p>\n<p>\"Do it,\" Eddie says. \"God, Steve, just—\"</p>\n<p>Steve pushes his finger in. Eddie is tight. His body has tensed up, but the longer they stay like that, the more he relaxes, and Steve feels him shift on the bed, exhale. Steve moves just a bit, just to see.</p>\n<p>\"Oh god,\" Eddie says.</p>\n<p>\"That okay?\"</p>\n<p>\"Yeah, it's—\" Eddie swallows. \"Keep going.\"</p>\n<p>Steve does. Pushes deeper, until he can't anymore, and Eddie's cock twitches against his thigh. Steve goes for a second finger, feels Eddie tense up again, then relax. Steve pushes in, kisses Eddie's navel, feeling him out. Suddenly, Eddie spasms on the bed, back arching, a moan ripped from his throat. Steve holds his fingers steady and watches him, the heave of his chest. His eyes are blown wide.</p>\n<p>\"You good?\" Steve asks.</p>\n<p>Eddie is staring at the ceiling.</p>\n<p>\"Oh yeah,\" he says. \"I'm better than good, baby.\"</p>\n<p>Steve slips his fingers out and kisses him, hard.</p>\n<p>\"Baby,\" he says. \"<em>Baby</em>.\"</p>\n<p>They sleep entwined that night, Steve's face buried in Eddie's hair.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Steve watches as Eddie eats his turkey bacon. It's tradition. It's adorable. It's their night-after date. He drove that morning, because for one thing, he doesn't plan on letting Eddie go home, and for another, Eddie is a terrible driver. He's wearing another one of Steve's shirts, an old Hawkins High Tigers shirt. It hangs on him like a brand. Steve dares anyone to throw anything at Eddie while he's wearing Steve's shirt. Vickie and Robin are sitting across from them in the booth, so Steve supposes this is a double date.</p>\n<p>\"Are you just going to watch me eat this bacon, or do you want some?\" Eddie says.</p>\n<p>\"First of all,\" Steve says. \"That's not real bacon. Second of all, I'm just wondering why you always order it. Always.\"</p>\n<p>Eddie chews, swallows, frowns.</p>\n<p>\"We've been together three months and you didn't realize that I don't eat red meat?\"</p>\n<p>\"Cut him some slack,\" Robin says. \"He didn't even know you were dating.\"</p>\n<p>\"Okay, okay, it's not even ten yet,\" Steve says.</p>\n<p>He drinks coffee to hide his blush, but he doesn't think he does a very good job of it. They're in the far corner of the diner, so no one can hear them unless they really, really try and listen. Vickie takes a sip of her orange juice and looks at Robin conspiratorially. Steve has a feeling he's going to be getting ganged up on a lot.</p>\n<p>\"And what did you two fine ladies get up to last night?\" Eddie says.</p>\n<p>\"Hmm, same as you gentlemen?\" says Vickie.</p>\n<p>Eddie leans over the booth and drops his voice.</p>\n<p>\"Bible study?\"</p>\n<p>\"So much studying,\" Robin says. \"Sooo much.\"</p>\n<p>Steve flexes his fingers against his fork. He thinks he might have a fever from how hard he's blushing.</p>\n<p>After breakfast, the two of them head back to Steve's. Eddie is unveiling his new D&amp;D campaign tonight. And Steve is happy for him, but god, he just wants to keep him all to himself right now. Still, a handful of hours without Eddie is not the end of the world. It's just odd, not being able to announce their relationship to anyone but Robin and Vickie. Everything is very select. Secretive.</p>\n<p>\"Do you want to come tonight?\" Eddie asks, as if reading his thoughts.</p>\n<p>Steve blinks rapidly as he turns off the main road.</p>\n<p>\"Do I what? To what? To the? Seriously?\"</p>\n<p>Eddie drums his fingers against his legs. He's nervous, Steve can feel it even without looking at him.</p>\n<p>\"Obviously you're not going to be playing. I mean, it'll probably be boring for you, actually. I just thought…ah, never mind. Stupid Eddie thoughts.\"</p>\n<p>Steve eases on the brakes at a stop sign. He looks at Eddie.</p>\n<p>\"You want me to come tonight.\"</p>\n<p>\"No,\" Eddie says. \"You're not even playing.\"</p>\n<p>\"You do,\" Steve says. \"You totally do. You want me to come watch you be the MC—\"</p>\n<p>\"—DM—\"</p>\n<p>\"—Because you're totally excited about your little campaign thingy.\" Steve can't stop the smile that's on his face. \"That's fucking cute, Munson.\"</p>\n<p>Eddie sits there a minute, lip jutted out, then he grabs his hair and pulls it over his face, the way he always does when he's embarrassed. He shakes his head as Steve pulls away from the stop sign and turns onto his street.</p>\n<p>\"God dammit, fine!\" he says. \"I do want you to come, okay? It's just that the kids…they might…\"</p>\n<p>\"Yeah,\" Steve says, sobering.</p>\n<p>He pulls up to the house and puts the car in park. He understands the fear. It's real now for him, too. But, those kids, <em>their </em>kids, he's not afraid of what they'll think, because he knows what they'll think. Steve is half-convinced they might know already. He reaches over the center console and grabs Eddie's hand.</p>\n<p>\"I want to come,\" he says. \"If you're okay with it. I think it'll be fine. We're literally their dads.\"</p>\n<p>Eddie considers this a moment.</p>\n<p>\"We do have joint custody.\"</p>\n<p>\"At this point I think we're just full-on co-parenting.\"</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>That night, Steve drives Eddie over to the Wheelers' basement, met headfirst by Dustin, Will, Lucas, Mike, and Erica. Naturally, it's Dustin who has to say something first, because even though Steve and Eddie have been together all summer, Steve at a D&amp;D campaign is just too weird for him to digest.</p>\n<p>\"You're not part of the party,\" he says. \"Eddie, what the hell is this?\"</p>\n<p>\"He's enjoying the fruits of my labor,\" Eddie says, just as Steve says, \"Don't sass me, I'm basically your dad.\"</p>\n<p>Eddie pulls his notebook and supplies out and sits at the table with his legs splayed, the kids all still staring. Steve goes immediately to lounge on the couch, tries to shrug it off, but he can feel their stares.</p>\n<p>\"He's just going to watch?\" Mike says. \"I don't get it.\"</p>\n<p>\"I get it,\" Will says, naturally.</p>\n<p>\"Well, I don't,\" Lucas says.</p>\n<p>\"He is <em>going</em> to ruin the mood,\" Dustin says.</p>\n<p>Steve grabs a magazine off the floor and snorts.</p>\n<p>\"Relax, children, you won't even know I'm here.\"</p>\n<p>Erica chimes in that they are, in fact, wasting very valuable playing time. She did not come to this stinky ass basement for them to cluck like hens, after all.</p>\n<p>So, they begin. And maybe Steve is being biased, but Eddie is an amazing Dungeon Master. Steve doesn't think he'll ever meet a better one. He's passionate. He's got everyone under his spell just seconds into the game, already got his feet on the chair, because Eddie can't sit still worth a damn. Steve forgets about his magazine and watches him from the couch, mesmerized. Every time they take a break for the bathroom or snacks, Eddie comes over, oddly shy, and Steve tells him that yeah, he's doing good, and Eddie smiles, looks at his shoes, before getting back to it. Like Steve's opinion is that important to him.</p>\n<p>At the end of the night, they're walking to Steve's car when Dustin bikes up next to them. He skids to a stop and gets off. The first thing he does is a frankly absurd bow at Eddie, which Eddie promptly returns. Steve thinks it's ridiculous, and he would walk away if he wasn't pretty sure that he's in love with Eddie. Then Dustin grabs his handlebars and fidgets for a moment. Eddie clears his throat.</p>\n<p>\"What's up, big guy?\"</p>\n<p>Dustin smacks his lips.</p>\n<p>\"So, when you two make all those jokes about being my dads, are you actually being, like, serious?\"</p>\n<p>\"Yeah,\" Eddie says.</p>\n<p>\"Oh,\" Dustin says. \"That makes more sense. Cool. Later, dudes.\"</p>\n<p>He hops back on his bike and rides away. Steve feels something loosen in him. He looks back at Eddie, who leans against the car, impressed, relieved, and tired all at once. Steve unlocks the doors for him. They sit in the silence of the moment, listening to crickets sing in the night around them. Steve risks kissing Eddie on the cheek, hums when Eddie turns his head and meets his lips.</p>\n<p>He starts up the car. Puts it in drive.</p>\n<p>\"Where to now?\"</p>\n<p>\"Home,\" Eddie says.</p>\n<p>And Steve knows exactly where he means.</p>"
}