{
  "id": "39891918",
  "url": "https://archiveofourown.org/works/39891918?view_full_work=true",
  "author": [
    "Xrea354"
  ],
  "title": "Signed Red Robin",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen",
    "M/M",
    "F/F"
  ],
  "fandoms": [
    "Batman - All Media Types",
    "DC Comics"
  ],
  "relationships": [
    "Tim Drake & Bruce Wayne",
    "Tim Drake & Damian Wayne",
    "Tim Drake & Jason Todd",
    "Tim Drake & Dick Grayson",
    "Tim Drake & Alfred Pennyworth",
    "Stephanie Brown & Tim Drake",
    "Cassandra Cain & Tim Drake",
    "Stephanie Brown/Cassandra Cain",
    "Tim Drake & Duke Thomas",
    "Tim Drake/Kon-El | Conner Kent",
    "Roy Harper/Jason Todd"
  ],
  "characters": [
    "Tim Drake",
    "Bruce Wayne",
    "Alfred Pennyworth",
    "Jason Todd",
    "Dick Grayson",
    "Barbara Gordon",
    "Cassandra Cain",
    "Stephanie Brown",
    "Duke Thomas",
    "Damian Wayne"
  ],
  "additional_tags": [
    "Tim Drake is Red Robin",
    "Tim Drake Angst",
    "Tim Drake's Missing Spleen",
    "Damian Wayne is Robin",
    "Damian Wayne Has a Heart",
    "Jason Todd is a Batfamily Member",
    "Batfamily is Family",
    "Dick Grayson is Nightwing",
    "Barbara Gordon Appreciation",
    "Misunderstandings",
    "all relationships are minor",
    "Blink And You Miss It Slash",
    "I don't care about continuity but I have read a lot of comics",
    "so that's the vibe",
    "Protective Tim Drake",
    "miscommunication as a plot device",
    "Canon-Typical Violence",
    "Descriptions of Injury",
    "Creepy Ra's al Ghul",
    "Scarecrow's Fear Toxin (DCU)",
    "fear gas ruins everything"
  ],
  "language": "English",
  "series": "Part 1 of Signed Red Robin and Other Associated Works",
  "published": "2022-06-26",
  "completed": "2023-02-12",
  "words": "46,065",
  "chapters": "12/12",
  "comments": "840",
  "kudos": "7,217",
  "bookmarks": "1,962",
  "hits": "118,866",
  "summary": "<p>\"Wordlessly, and slowly, Bruce takes one breath after another, composing himself. He hands Jason the slightly crumpled sheet of paper. Jason reads it quickly. Quicker than Bruce, but he reads it again and again and again. Finally snapping with panicked urgency, 'What the fuck is this?'</p>\n<p>Bruce, completely devoid of any inflection, forces himself to simply state the facts in front of him. 'That is Red Robin’s two week notice.'\"</p>\n<p>Or</p>\n<p>Tim really thought leaving would be a lot easier. Both figuratively and literally.</p>\n<p>The day Tim decides to move away from Gotham.</p>\n<p>Tim takes Damian on a stake-out.</p>\n<p>Tim tells his team about his plan to move away.</p>\n<p>Tim and Damian talk. </p>\n<p>Other things happen too.</p>\n<p>Tim and Dick are interviewed by Cat Grant. </p>\n<p>Couldn't fit Batgirls in here; they get their own thing now.</p>\n<p>It's the summer, and it passes quickly.</p>\n<p>We're back in the present for this one folks, don't think too much about my story structure; we know I didn't.</p>\n<p>Tim’s future plans change. Or… well. They would’ve.</p>\n<p>Basically a fear gas fever dream that lasts a week. Please please please take care of yourself. This one is kind of a lot, maybe.</p>\n<p>And we're back.</p>\n<p>Welcome to the talk.</p>",
  "notes": "<p>Please be gentle, I beg you.</p>\n<p>(Thanks for all the support, y’all are really amazing.)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Updates every two weeks! If I finish a chapter early, I'll post it early. </p>\n<p>6 Chapters, unless I change my mind.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I read the comics, but please don't point out inaccuracies. This is fiction based on fiction, let's go easy on me. I get to make stuff up if I want to. </p>\n<p>Just to be clear. I think there's a lot of love in the Batfamily. And I'm writing this so I'm going to have them make up. Also, almost everything Tim hears here he takes out of context, and not in the way that his family meant it. That doesn't mean it didn't hurt him, though. And that is something they'll have to work through.</p>\n<p>So I added two more chapters bc I have truly no idea how long this will be but I knew halfway through writing this chapter, that it would probably be longer than 6.</p>\n<p>Also, I edited chapters 1 and 2. Nothing really changed, but now there are commas in the correct spaces and the Grammar is better so you are welcome.</p>\n<p>And just fair warning, I make a very stupid and dumb dick joke near the beginning of the fic and it is not good writing, but I genuinely loved making it, so it stays in.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>Thanks for all the feedback everyone. It means a lot.</p>\n<p>This chapter is shorter than the rest because it's really just one scene. I'm also not used to writing for those characters so this was very new for me. I just had the idea for the scene and needed to get it out, so here! Have an interlude before the next chapter of Batfamily Shenanigans.</p>\n<p>Started writing it. Had a break-down. Bon appétit. </p>\n<p>In all seriousness though during this chapter I had the realization the the story was going to be much longer than I originally thought. So I had to re-outline the entire thing and refocus on what I wanted to say with it. It took me a while, but I think I'm finally happy with the direction I'm heading in. Thanks for being patient.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>Next Up! Dick and Tim chapter featuring the Batgirls. Maybe other characters too, who knows.</p>\n<p>In honor of 1000+ kudos, here's the next chapter a week early. I'm literally blown away by the reaction. Thanks so much, everyone.</p>\n<p>This is late! But also apparently writing Superman is really hard and sucks a lot for me, so I'll take what I can get. These characters are new to me, and I'm not used to their voices, so here you go. Bone Apple Tea.</p>\n<p>Hi y’all it’s been a while haha. Anyway the explanation is that between now and the last time I posted I went from a recent college grad with no jobs to a recent college grad with TWO jobs, and I’ve been traveling for one of them. Anyway, I’m still writing, just not as fast. Also I’m still traveling so this chapter ISNT quite as polished as I’m used to putting out, but I’ll edit it when I get off my flight.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">more notes</a>.)\n</p>\n<p>My goal to mash every trope I possibly can into one medium sized fic is going fairly well if I do say so myself. Do I do it because it makes sense? No. Do I do it because I think it’s funny? Yes.</p>\n<p>Warning. Violence. Depictions of Violence. Descriptions of Graphic Injury. Creepy behavior by Ra’s Al Ghul. A bad memory Tim has with Bruce from being Robin. This chapter took a long time for me to write bc it was hard for me to get into the mindset of what I wanted to say. And also those two jobs turned into 3, I’m WORKING. Not as happy with it as I’d like, but she gets the job done, and I’m not publishing a masterpiece so I settled. Thanks everyone for the response, I really didn’t expect this much interaction and I appreciate all of you immensely. I promise I’m finishing this, it’ll just take a little longer than I originally thought.</p>\n<p>hi, again.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">more notes</a>.)\n</p>\n<p>wild, right? See y'all at the end.</p>\n<p>So, this is it, huh?</p>\n<p>Thanks for coming on this journey with me y'all. I can't believe the response I've gotten and I appreciate everyone who's given me the motivation to continue.</p>\n<p>End of chapter for more notes.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>Hey guys. So this is the end of SSR.</p>\n<p> </p>\n<p>It's not the end of that world, though. With that said, I'm going on a bit of a break for work. Gotta earn money and plan out a couple of fics that I want to take the time to write. One of which I'm really excited for and directly ties into SRR.</p>\n<p>In other news you can definitely still contact me on Tumblr, at https://mediacircuspod.tumblr.com</p>\n<p>I have something really cool going on there right now for my Batfamily fanart. You should definitely check it out if you were a fan of my fic.</p>\n<p>Also I guess I should drop my tumblr, so u can speak to me and stuff. It’s not dedicated to Batman, and I share the account with my sister, but it’s where I am!</p>\n<p>You can find it @mediacircuspod</p>",
  "text": "<p>Batman is never surprised. It’s part of the whole Dark Knight shtick. He’s prepared for anything and everything. Batman’s utility belt even has Bat-Shark Repellent™ inside it, courtesy of a 12-year-old Dick Grayson who watched Jaws at a sleepover even after Bruce told him not to and proceeded to fear that they would run into a shark during patrol. On the streets. Of Gotham. But Dick thought it was necessary for their survival, and Bruce encouraged making things that made Dick feel safe. His first child then proceeded to name it Bat-Shark Repellent™ because he was twelve and dedicated to the bit.</p>\n<p>“We have a theme, Bruce, and we have to stick to it!”</p>\n<p>It’s been mostly useless over the many years since. Still, Dick loves to enthusiastically remind everyone of the one time it saved Bruce’s life anytime a new family member questions the strange addition when reviewing the inventory of Batman’s utility belt. And while most days he can convince himself that he keeps it because that one time it did, in fact, save his life, the actual reason is probably that he misses his eldest son. It’s probably the same reason he carries a collapsible bo-staff and Stephanie’s favorite granola bars. A glowstick in Duke’s signature yellow and the organic dog treats that Damian buys for Titus. It’s why he still has the small divot on his armor’s right shoulder from where Jason used to hold on when he got tired of swinging by the end of patrol all those years ago.</p>\n<p>Jason had seen Cassandra latch on to it the last time an all-hands-on-deck situation required every bat in Gotham’s attendance. Cass stepped up and took down double the number of robots, but she was hurt at end of the night; a broken ankle. She had latched onto the shoulder grip, and Jason had stopped the hurried walk towards his motorcycle so abruptly that Dick walked right into his back, and they both toppled to the ground beside the bike. Even then, Batman was prepared and pulled out the Bat-bandaids™ for Jason’s scraped cheek, regardless of Jason’s startled scoff and quick dismissal of the slightly ridiculous themed bandages. By the end of the night, Stephanie had bullied Jason into a plain patch over the cut after Tim had meticulously cleaned it. All the while, Jason was grumbling about needing to replace his helmet again. They really have to have a talk about how wearing explosives on your head is not a good idea and will one day give Bruce a heart attack.</p>\n<p>God, Bruce misses his kids, despite seeing them on patrol or fighting beside them during that particular month’s big bad crisis. He misses movies and breakfast at the table after a late-night patrol. Bruce misses dinners with his children and commiserating glances at stuffy galas. He misses moments where they’re all together every minute that they are apart. Bruce knows it’s because he’s lost too many of them too many times, but he also knows he’s the luckiest father in the world because even when he loses them, he always seems to get them <em>back.</em></p>\n<p>The point is that Batman is never surprised—he has the shark repellent to prove it, which is probably exactly the reason why Tim waited until Bruce took off the cowl to render the older vigilante completely speechless. Tim’s always been considerate of things like that.</p>\n<p>Bruce doesn’t really know how long he’s been spaced out, but he knows it’s been a while. Tim is still talking, though. He thinks he can safely blame the black folder clutched tightly in his gloved grip for his lapse in conscious thought. The folder is open, and he freezes more and more with each neatly typed and perfectly formatted line on that first document in the small stack of paperwork contained in the ever-professional folder.</p>\n<p>Tim finally stops talking when the papers flutter to the floor, and the folder slips from Bruce’s slack grip. His face contorts to concern, concern for Bruce. He shouldn’t be concerned for Bruce. Bruce is supposed to be the one taking care of Tim. He locks eyes with Tim for the first time since the teenager handed him the envelope seconds, maybe minutes, maybe hours ago—Bruce can’t tell.</p>\n<p>“Bruce, are you alright?” Tim asks, casting his gaze from Bruce’s face to the papers that litter the floor, “I—I can go get Alfred, just… stay here a moment”.</p>\n<p>Tim turns to leave, but that sets alarm bells off in Bruce’s head that blare loud and fast and <em>all-consuming</em>, and they scream louder than any logic he could hope for.</p>\n<p>\n<em>If he leaves, he’s not coming back.</em>\n</p>\n<p>Tim is only one quick step away, still dutifully concerned when Bruce bursts into action. The knock-out gas retrieved from Batman’s utility belt is one of Tim’s own creations, and it is taking effect just as quickly as Tim promised. Not quite quick enough for Bruce to avoid Tim’s look of shock and betrayal before he slumps into the Bat Symbol on Bruce’s chest, but quick enough that Bruce only feels the gut-wrenching stab of it for a couple of seconds afterward. He catches Tim smoothly, dropping with his son to cradle him as he falls. Bruce realizes about halfway to the ground that that was probably not the best way to deal with either the situation at hand or his emotions about it. He elects to try and not think about it too hard and carries his son over to the medical cots to lay him down for what should be at least a couple of hours. The next thing he does is signal for an emergency meeting, immediately calling all Bats back to the cave. He crosses the cave back to the stack of papers scattered across the floor and drops to his knees to search for the one that started it all. It is not hard to find.</p>\n<p>Jason doesn’t like being the first to arrive in the cave. It’s just that he was already upstairs with Alfred when they received the beacon. They were enjoying early morning tea together when their phones and Jason’s comm went off shrilly, the sound code reporting the emergency to be in the cave. More panicked than he expected, Jason lunges towards Bruce’s office for quick access to the poles while Alfred hurries across the manor to the main stairwell entrance. The second Robin distantly registers that his handprint still unlocks the hidden sliding door, and he files it away to brood about later. It's the 19th thing that makes his “brooding for later” list this week, and he knows he’s going to be spending more time than usual with his favorite gargoyle come the weekend. He can’t focus on it now, though, because Batman never calls for help. The stone in Jason’s stomach lurches with every second he takes to slide down into the cave, and the only good thing about his stomach dropping so completely is that it might speed up his descent into the manor’s depths. When he reaches the bottom and bursts into the main floor, he sees Bruce on his knees by the computer.</p>\n<p>Jason covers the 20 yards of distance in seconds before Bruce, cowl-less, looks up at him from the floor, devastated. It’s so surprising Jason falls to his own knees, and they stare at each other just like that.</p>\n<p>He’s suddenly 13 all over again. Alive for the first time, and not the do-over—breathing with lungs that haven’t been <em>buried</em> yet.</p>\n<p>Batman and Robin just had a rough night, and his instincts scream to reach out and comfort his father, but that is not who they are anymore. Jason's not Robin anymore, and too much has happened for them to find ease in comforting one another. It feels like they just got to something stable, good in a way that’s eluded them for too long but far too fragile to test. So they just stare instead.</p>\n<p>Jason is looking for an answer in Bruce’s face, and Bruce is just looking for answers. Bruce is clutching a piece of paper in both hands, surrounded by strewn documents, and Jason is at a complete loss—severely unused to Bruce looking so broken. His entire being exudes failure, and it’s wrong, wrong, wrong.</p>\n<p>“…B?…B, what’s going…” he trails off for a moment, wondering if Bruce is in a state to answer any questions at all, “what’s going on?”</p>\n<p>Wordlessly and slowly, Bruce takes one breath after another, composing himself. He hands Jason the slightly crumpled sheet of paper. Jason reads it quickly. Quicker than Bruce, but he reads it again and again and again. Finally, snapping with panicked urgency,<em> “What the fuck is this?”</em></p>\n<p>Bruce, utterly devoid of any inflection, forces himself to simply state the facts in front of him. “That is Red Robin’s two-week notice.”</p>\n<p>An intake of breath behind them is what alerts the two vigilantes to Alfred’s presence, as well as that he had heard at least the last part of their very stilted conversation. They both turn to the Wayne family’s true patriarch, entirely at a loss. Alfred looks into the face of his son because Bruce is his and has been since two gunshots took away two-thirds of Alfred’s entire world. And then Alfred has to turn and look into the face of his grandson, who’s lost so much, who’s even lost his own life, and he just sees a little boy terrified of losing even more. They both look at Alfred like he has any answers when he knows that he doesn’t. That he’s just as lost, scared, and confused as they are, and Alfred doesn’t know how to reassure his two boys that everything will be alright when he may be losing yet another family member.</p>\n<p>It’s a good thing Alfred Pennyworth is the very best of them, though. Because he may not have the answers, but he can clean up this mess.</p>\n<p>The first thing Alfred does is deposit both men before him into chairs at the Bat-round Table™ that the group uses for meetings amongst the family. The second thing he does is begin the task of gathering the documents strewn across the cave’s floor. He only worries for a moment about finding the correct order when he realizes that Timothy had them numbered neatly in both the top and bottom corners on the right-hand side. At the computer’s large desktop, Alfred quickly orders the papers and feudally attempts not to read a single word on any of the pages. There are too many graphs, and the Butler doesn’t understand why that makes him as queasy as it does.</p>\n<p>Once everything is correctly placed and stacked neatly, Alfred drops the entire stack in the copier to make precisely three more paper copies for Jason, Cassandra, and himself, as he knows they prefer to read physical files. Bruce may keep the original; he is the one who left the boot marks on what looks like pages seven and sixteen, after all. Alfred also downloads the information onto the file network for the digital copies to be accessed on the tablets he sets around the table for the more digitally inclined family members.</p>\n<p>When Alfred can finally take his seat at the table, Jason looks about ready to speak, in control of his faculties at last. Alfred discreetly checks his eyes for Lazarus green but finds clear blue, for now. He releases a breath. Jason is just opening his mouth when two of the cave entrances burst open in a cacophony of panicked sounds. All three Batgirls and Duke screech in on two bikes from the garage—fully costumed and seemingly ready for a fight, and the stairwell entrance is nearly ripped off its hinges by Dick and Damian. They don’t close the door behind them as they race down the stairs. Both groups stop to take deep, relieved breaths at the lack of physical threat. Dick even lets out a light laugh. His joy finally breaks Bruce out of the staring contest he’s been holding with his own cowl laid on the table in front of him to look at the rest of his family arriving.</p>\n<p>The relief in the air slowly recedes as the new arrivals begin to take in the scene before them and the tense shoulders belonging to the three people already seated at the table.</p>\n<p>Dick and Bruce lock eyes, and instantly, the younger man knows that look. Something emotional is going on—that’s bad, and Bruce undoubtedly doesn’t know how to handle it in a positive way. He's probably even started to handle it incredibly poorly if Dick reads the twitch in his father’s jaw.</p>\n<p>Despite the recognition in their stare-down, Damian cuts to the core of the problem first. Looking between Grayson, his father, and the surrounding family, Damian demands, in a tone that could be contempt but is most likely just worry, “Where is Drake?… He always answers the beacon's quickest.”</p>\n<p>No one says anything for some time. Enough time for Alfred to retrieve a collapsible wheelchair for Barbara. She takes his arm and sits gingerly, turning to Bruce in the silence after Damian’s question. They all turn to Bruce after Barbara does, looking for the answers he doesn’t want to give but knows he must.</p>\n<p>“… He’s on a cot in the Medbay,” Bruce quietly confesses to the tabletop.</p>\n<p>That doesn’t go over well.</p>\n<p>A series of voices express their concerns, but it’s Dick who breaks through. Hand on the table in front of him, white-knuckled; his fingers are as strained as his voice, “Why is he in the Medbay, Bruce?”</p>\n<p>Everyone stills at the question. Dick waits for bad news, a fight gone wrong, a lucky hit, a run-in with no backup—<em>why does Tim never call for backup?</em> Bruce doesn’t answer, though, and Dick realizes his father’s not Batman right now. He’s Bruce. He’s a dad right now. He’s Tim’s dad. And while it’s probably good that he’s feeling emotions, what the family actually needs is a report. He’s about to open his mouth, but Cass beats him to it. Cass, who saw it before Dick because, of course she did. Cass, who’s been reading Bruce since they stepped in the cave and has come to the correct conclusion just that bit faster. Dick is so very proud of her.</p>\n<p>Her voice is firm and demanding, but with an undercurrent of care, “Batman. Report.”</p>\n<p>It does what it needs to do. Batman starts at the beginning of patrol. Tim had asked to be with him on the main route. He doesn’t add his own feelings about the request into his words, but there’s a collective intake of breath around the table. Red Robin hasn’t patrolled with Batman in 3 years. Or Nightwing, for that matter. Dick feels the coils of jealousy wrap around him for only a moment before he banishes them away. He has to listen now. Batman goes into the events of the night. It’s good; they do good work. They do really good work. And then he gets to the cave.</p>\n<p>Batman stiffens slightly, unnoticeable to the untrained eye, but he trained all these eyes himself, so he knows the change in his own demeanor is noted and cataloged by everyone in the room. And so he tells them the rest. After writing up his initial report, he tells them about the casual way Tim had called him from the Batcomputer. He tells them about the plastered smile on Tim’s face and the words that Bruce still doesn’t understand, even now.</p>\n<p>“I know this is overdue,” Tim had said, handing Bruce a black folder, the perfect size for the neat stack of papers locked inside, “but I just needed to take the time to oversee the transition smoothly.”</p>\n<p>Bruce then tells them about the jumble of his thoughts as he opened the folder to see what Tim had meant, only to freeze at the very first sheet.</p>\n<p>He looks up to the rest of his children and his family and says, “After reading the first page of Red Robin’s paperwork, I was compromised and did not hear the rest of his explanation.” He breaks the formal tone of his report for the first time to add softly, “I am sorry.” Batman then takes back over, his voice more sure, but his tone holds guilt. “Red Robin eventually noticed my distress and attempted to leave the cave. I believe he meant to get Alfred, but I panicked. Thinking if he left then, he wouldn’t return… I probably overreacted… I knocked him out with the new gas capsule he created four days ago and carried him to the Medbay…. Then I called you here for a meeting.”</p>\n<p>Silence falls over the cave. Dick, Duke, and Stephanie take their seats heavily. Cass had sat down next to Bruce during his report, and Barbara had rolled to his other side. Damian, on the other hand, <em>lunges</em> for his tablet the second the report is over and seemingly mumbles while he reads to confirm his father’s story with the file in front of him.</p>\n<p>“This is completely unacceptable; I do not understand Drake’s—” he stops speaking for a moment, cutting himself off. Damian stopps flipping through the files. He’s silent before, “We need to know what he was saying to you.”</p>\n<p>“I’m already in the feed.”</p>\n<p>Thank God for Barbara Gordon. She spins her tablet to the center of the table and cleanly taps the play button.</p>\n<p>From the feed angle, the camera catches Tim quietly kneeling by Red-bird as he removes his file from underneath the bike’s seat. The vigilante stares at the folder for an entire minute while Batman types up the nightly report. Tim stands and purposefully places himself after a couple of seconds of deliberation. He ends up leaning against the Batcomputer™ counter, his posture over-casual, and he only moves once Batman finishes the report and tiredly takes off his cowl.</p>\n<p>“Hey Bruce, do you mind going over some paperwork I brought for filing.” They see Bruce turn to look over with a tired smile.</p>\n<p>“Of course.” Bruce reaches out his hand for the folder, and Tim neatly deposits it into his grip.</p>\n<p>“I know this is overdue, but I just needed to take the time to oversee the transition smoothly,” Tim explains. It’s painfully manicured like Tim is justifying something. Bruce understands now he was trying to say that he needed time to prepare Gotham for his permanent leave. That Tim felt he needed to justify how long he’s stayed, despite what? Did he feel unwanted, unappreciated—unloved? Bruce has the sudden crushing feeling of needing to know. Of needing to fix it. So this time around, he refocuses and tries to take in what happened next.</p>\n<p>On the feed, Bruce opens the file and freezes. Tim, not noticing the stiffness in favor of further business, pulls a tablet from seemingly nowhere to have a copy of the files for himself.</p>\n<p>“So the paperwork at the top is really just for your filing system, document 1 is the bare bones notice, and the next two pages outline the responsibilities and tasks I performed for the Gotham vigilante scene for the six years I’ve been in active duty. The pages after those first few are actually the more important ones. I’ve separated them by still active Gotham vigilantes, who I’ve been integrating into the responsibilities I mentioned on pages two and three over the past year and a half. You’ll find each section outlines the steps I’ve been taking to train them to adopt the additional work into their schedules. The next two weeks will be their final stages of transition. I’ve also—” Barbara pauses the feed, eyes wide as everyone at the table takes in the last minute of video and sound.</p>\n<p>Stephanie releases a sigh, “okay… we definitely need to finish watching this, but I just. I need a minute” she gets up from the table and walks away. Muttering something about “a year and a half” and “idiots in cowls.”</p>\n<p>Cass shadows her; Steph always forgets to be careful when she’s overwhelmed. Cass can tell that while Steph is definitely upset, sad, and confused, the thing she’s feeling most is anger. A rage that is boiling just beneath the nail beds at her fingertips, begging for violent release. When Steph stops her jerky pacing along one of the center training mats and lets out a growl that ends with an attack on an unsuspecting punching bag, Cass takes her hands. Stills them from their shaking at Stephanie’s side and mirrors them digit for digit, splayed out between the two of them, openly. Steph’s hands are slightly larger than Cass’, and the blonde’s fingertips <em>curl</em> over Cassandra’s black-clad ones tightly. They breathe together for a while, sharing space. They try to get ready to go back to the video feed and the stack of mocking paperwork that somehow is supposed to convince them to let go of Tim.</p>\n<p>Back at the table, Damian sits very still. Over the last few years, he’s gotten more comfortable in silence. Comfortable enough to develop habits like passing the time with small and idle movements. He’ll tap tables with his fingers, bounce his feet, even wring his hands if his mind wanders to something that may worry or confuse him. These small movements show how much he’s grown while with his family, becoming comfortable in his own body and feeling safe enough to take up space. His ability to grow habits that remind him and everyone who loves him just how human a boy raised to be steel can be. But now he’s still, and that’s not good. He’s so still that it rings strange, like he’s not at home—like he doesn’t feel safe. He’s so still, and his expression is so blank, and Barbara doesn’t know what to do.</p>\n<p>Dick and Jason are lowly speaking away from the group, and the other girls left for the training mats minutes ago. Duke is standing between Bruce and Alfred, lost but valiantly giving them each a point of contact—his hands on either of their shoulders. But no one else is noticing Damian’s stillness or what it must mean.</p>\n<p>She decides to suck it up and interrupt the youngest bat’s train of thought. She doesn’t even consider being subtle, rolling beside the 14-year-old, physically pulling him into her chair with her, and hugging him very tightly. He still hasn’t hit a growth spurt, so it’s not very hard, and he's surprised enough not to put up a fight. He’s stiff for so long. Long enough for Barbara to second guess her decision, but when she loosens her grip, Damian surges into her just a bit—panicked. So she tightens her arms again and moves his head to her shoulder with her hand. He curls, lifting his feet to the armrest of her chair and finally wrapping his own arms around her.</p>\n<p>When everyone wanders back to the table, Damian doesn’t mention how he had to tap her three times to get her to let go, and Barbara doesn’t mention the single tear she felt seep into her blouse from her shoulder.</p>\n<p>As everyone settles back in their chairs, Barbara once again plays the footage.</p>\n<p>“I’ve also outlined an itinerary for the next two weeks that’s organized once again by current vigilante in the same order as the more robust files detailing the work I’ve already done with them, starting with Nightwing and ending with Robin. The next papers give a brief overview of my upcoming prospects in San Francisco, Central, Metropolis, and Keystone, whereupon I’ll assume a different alias so as not to confuse the Gotham brand and a no longer active position with these new territories. The Young Justice team is currently coming up with new pseudonyms that will better fit future branding with the team.”</p>\n<p>“And the last papers include an itemized list of all the access codes and passwords I’ve been granted while boarding in Gotham, so it will be pertinent to scramble that system as I’m familiar with the current rotation and combination patterns.”</p>\n<p>“Lucius will receive a similar file in a few hours detailing my withdrawal plan as Majority Shareholder at Wayne Enterprises; you have a copy of that file upstairs in your study, as does Dami—” Tim finally notices Bruce’s blank stare, watches as papers flutter to the floor, and pauses quietly. His tongue clicks. The hum of the computer and chatter of the bats above are the only noise breaking the resounding silence in the dark expanse around the two of them. He slowly puts his tablet on the computer's counter, eyes never leaving his frozen mentor.</p>\n<p>Gently, Tim reaches out—he’s so hesitant to touch, and seeing it from this perspective is eye-opening. It’s hard to see just how distant Tim’s been when the young man is a master at forcing perspective. But here, on the outside looking in, Bruce can tell that Tim doesn’t know if a reassuring hand is welcome. <em>It is</em>, but his own son doesn’t <em>know</em> he can <em>hold</em> or <em>be held</em>, so that too is probably Bruce’s fault.</p>\n<p>Tim’s hand shakes, and he brings it back to himself before speaking, “Bruce, are you alright? I—I can go get Alfred, just… stay here a moment, okay?” He turns away.</p>\n<p>But Tim never leaves. Instead, he’s knocked out with a small gas capsule, just as Bruce had told the group before. They watch Bruce catch Tim as he falls unconscious, and just as he starts to carry him away, Barbara stops the feed.</p>\n<p>No one says a word for a long while until Damian roughly shoves his chair back and throws his tablet into the dark depths of the cave, smashing the bright screen as it tumbles violently into darkness. The young teenager lets out a frustrated shout before storming away and upstairs. A minute later, they know the youngest boy’s door has slammed harshly shut even though they can’t hear it.</p>\n<p>Bruce burrows his face in his hands as he lets out an exhausted sigh.</p>\n<p>“Timothy should be awake in a couple of hours. I’ll wait here with him so you can all collect your thoughts.” Alfred shoots Bruce a seething look, but Bruce can not see it with his face obscured by his palms.</p>\n<p>“This isn’t actually happening, right?” Duke asks warily—like he knows the answer and doesn’t want to hear it voiced.</p>\n<p>Bruce doesn’t know how to react. Looking at his ward—his son, he doesn’t want to fail Duke. He doesn’t want to tell him he doesn’t have the answers, but he doesn’t want to lie to him, either. Dick cuts in instead. He doesn’t have to lie because he’s always been optimistic to a fault, “No, of course not. We’ll make sure.”</p>\n<p>It’s quiet for a while, Dick seems so confident, but something rings wrong in that unwavering conviction.</p>\n<p>Alfred chooses to speak up then, his voice grave, and his accent gives a particular <em>steel</em> to his words, “You can all certainly try to convince Master Timothy to stay and to tell him that he’ll always have a place here, but he’s well past being able to make his own decisions. And we will not be taking that autonomy away from him. If he stays, it will be his choice. And none of you are to take that away from him when he has more than earned the right. Do we understand?” He waits for their small nods. Alfred sighs then and takes on a much less stern tone, “With that being said, we have a whole lot of convincing to do, so I suggest you all head to your rooms to get some rest. I’ll call the schools in a couple of hours to notify them of Duke and Damian’s absences, and then I’ll call Mr. Fox to relay that Timothy will not be in the office today. I expect everyone to be back here in 4 hours. Go to your rooms.”</p>\n<p>Alfred had left no room for argument, so they all followed instructions and made their way to the manor upstairs. Half of them join Miss Gordon in the exposed elevator, but the others make their way to the stone stairs for the journey to their rooms. Once all of the children disappear, Alfred turns to Bruce and follows him to the medbay. He knows that this—this is going to be a long morning and that there is very little chance that he’ll be able to get his son to rest.</p>\n<p>Alfred prepares a damp cloth and removes the hair and sweat from Timothy’s forehead. He checks over the monitors and sits beside his boys. In two hours, he’ll need to start taking care of business, but for now, he gets to sit with Timothy and take a breath.</p>\n<p>One Year, Six Months, and four days ago.</p>\n<p>It's been a bad day.</p>\n<p>It starts with a meeting at 8 am at Wayne Enterprises. Being Tim Drake-Wayne is always exhausting, and Tim doesn't particularly like to be in that persona so early in the morning after a near sleepless night of patrol and detective work, but this is part of the job. Never let it be said that Tim Drake is undedicated to the work.</p>\n<p>He listens to old men attempt to cut corners on company systems and watches them badly disguise their contempt when he gives solutions to issues that don't involve either firing half the operations team or making products unaffordable for the average Gothamite. They question his education(fair), age(fair, again), and attitude(fair, but hey!). Lucius has to come to his rescue <em>four</em> times as if Tim was some injured cub in the woods in need of an adult to pick him up by the scruff of the neck and drag him to safety.</p>\n<p>In the end, he saves both jobs for employees and the affordable pricing for the new gas-mask line the company is rolling out at the end of the month. It's at the cost of all the energy he has from his morning caffeine dose, and he drinks two energy drinks to compensate as he completes a monthly check-in on the R&amp;D department excel charts.</p>\n<p>In an even weirder turn of events, Music Meister, Riddler, and Bane attack the Gotham Zoo in broad daylight around 1 pm. Meaning that Tim has to have Tam call out for him for the rest of the day, which he'll have to pay for tomorrow if he reads the stony face she makes at him while he suits up in his office's ensuite correctly. Tim doesn't even understand how the three coordinate together so effectively. Gotham rogues working together usually ends with betrayal on a large scale, but the three seem oddly united as they battle the Bats for hours.</p>\n<p>Luckily no citizens are killed, but Tim has to treat a large number of wounds in between getting slapped around by magic music notes and Bane's actual face-sized fists. Not to mention that everyone expects <em>him</em> to solve the Riddler's puzzles when he was doing a million other things as well. The family gets all the animals back in their enclosures and waits for the GCPD to take the three rogues away a full eight hours later, to the dismay of everyone present. Tim walks away with a strain in his shoulder, but he thinks he hides it well as no one asks him about it.</p>\n<p>The family decides to patrol together for the rest of the night. Well, within 25 blocks of each other, making a clockwise sweep of Patrol Route 23A. By 11 pm, Tim really needs another energy drink and makes use of stopping a convenience store robbery by buying an absolutely <em>toxic</em> one. He pays for his drink and sits the would-be thief down in the alley a few feet away. He slips some money into the kid's jacket pocket and takes the gun. The kid's hands were shaking during the entire encounter; it had to be the first time he'd ever done something like this. Tim grabs the facial recognition on the kid to look at any files in the Oracle network later. He can probably get him signed up in the neon knights program in the next week or two.</p>\n<p>It's not creepy.</p>\n<p>Okay, it may be creepy, but desperate kids making morally gray decisions remind him too much of himself not too long ago, and he doesn't want kids to go through that.</p>\n<p>When he cracks the drink sitting on a roof a minute later, he hears a small and well-known scoff.</p>\n<p>Damian.</p>\n<p>\"You would drink such dreck, Drake. It fits that you need an extra push to keep up with the family.\"</p>\n<p>Tim stares at Damian while he chugs the rest of the energy drink, crushes the can, and slips it into a pouch on his chest to recycle later. Then he calmly steps off the roof's ledge to grapple toward the group ahead. Damian follows a couple of seconds later. He lets the kid overtake him and watches the smirk on Robin's face as he rockets further forward. Tim wished he cared about Damian less than he does. Tim wished Damian could insult him without clearly referring to Tim and the family as different entities, too. He already understood the kid's opinion.</p>\n<p>When he catches Jason taking a small break on one of the roofs up ahead of the central sweep, he pulls out the gun from his usually empty back holster and hands it over, handle first. He learned his gun safety just like the rest of the Bats last month when Jason and Alfred made everyone sit down for a seminar after Dick accidentally shot Jason in the foot.</p>\n<p>Usually, he'd drop the gun off at the station for Gordon in a Bat-evidence Baggie™, but for some reason, the kid had a Beretta with red detailing, and he figured Jason would appreciate it more than Jim would. It matches his aesthetic, after all.</p>\n<p>Jason whistles appreciatively from his place sitting on the concrete roof and inspects the chamber after fully disarming the firearm.</p>\n<p>His helmet is off beside him, and the red domino mask doesn't hide his smile. It is a joyful thing if a little hungry. Tim can't see them because of the white-out lenses, but Jason's eyes are mostly blue with emerald specks floating around nowadays. The smile doesn't get to Tim the way it did when everything about the other vigilante seemed to glow with some hue of green. Jason's eyes change sometimes, but Tim can always tell, even when Jason has the domino. Tim didn't want to freak out over a smile, so he was grateful that they weren't glowing now. That they glow less ever since Tim fumbled Bruce back through the timeline.</p>\n<p>When Jason looked up with the smile still in place for Tim, Red Robin almost smiled back from under the cowl.</p>\n<p>\"Good for something after all, huh, Replacement.\"</p>\n<p>He almost smiled back because it almost felt okay.</p>\n<p>\"Yeah, well. Don't tell Nightwing where you got it. I'm too tired for a lecture tonight.\"</p>\n<p>Tim takes off towards the last length of the patrol route to the sound of Red Hood's small snort. Tim hopes this last hour won't feel too long.</p>\n<p>It feels very long.</p>\n<p>He was just so <em>tired</em>. And the last energy drink wore off around the time he swung away from Jason and Red Hood's new Beretta. Tim just wants to go to bed or finish that case Cassie asked about last week.</p>\n<p>Scratch that. He definitely wants to finish Cassie's case first and then go to bed. And maybe work on Bart's Meta-metabolism Bars V 3.0. Yeah—Cassie's Case, Bart's Bars, and then sleep. Maybe he'd call Kon, too. He could call Conner while working, though, so that shouldn't take too much time. Kon will be excited by a wake-up call before he starts on chores at the farm for Ma and Pa Kent. It's kind of nice that Tim goes to bed late enough that he can be a part of Kon's morning routine on occasion. It was sweet.</p>\n<p>Tim was still getting used to letting Conner be sweet and doing sweet things for him in turn.</p>\n<p>He shouldn't have been planning and swinging at the same time, though; it's distracting.</p>\n<p>You don't see bullets when you're thinking about your friends. Tim knows that, and he should've known better. The first bullet tore through Red Robin's shoulder, and the grapple he fired missed its mark thanks to the sudden tug on his arm. The second bullet hits his stomach.</p>\n<p>He free falls.</p>\n<p>Despite the bird-themed name, Red Robin can't actually fly(at least until the Glider was fixed from Stephanie's ill-advised battle with Kite-Man). And well, he really shouldn't have been falling from that high. It's bad for his health.</p>\n<p>A sickening crunch comes from where his left ankle landed to break his fall, and the roll he tucked into would have been perfect if not for the wall his head slams against at the end of it. <em>Hard</em>. Tim thinks he sees a crack in it when he stands to check it over. He wants the cowl to record it so he can look at the footage when he isn't see triple or falling to his knees after ten seconds of standing in place due to what is hopefully a mild concussion. And two gunshot wounds. Can't forget those.</p>\n<p>Somewhere nearby, a fight was happening. It ends while Tim crawls to cover.</p>\n<p>Three panicked voices are in his ear, telling him to stay where he is and to <em>stop moving, dammit</em>. One of them screeches not to fall asleep when Red Robin finally stops. They're too loud, especially the last one, and he just needs to rest his eyes for a minute.</p>\n<p>Someone had screamed, \"Robin!\" just as his ankle broke, and he couldn't stop thinking about it. The codename was hard to hear over the rushing blood in his head and sharp crunch of bone below him. He thought that name meant <em>him</em>, but also <em>not him</em>. He drifted into blackness with words ringing loudly around his head. If he were lucky, maybe he would get to hear a bird song soon. He's always liked the way robins sounded.</p>\n<p>•</p>\n<p>Trying to be unconscious in the Batmobile was a losing game. Still, Tim was valiantly falling in and out of wakefulness the entire ride as the car whipped around corners and pushed even its own limits towards the cave where Leslie and Alfred were surely setting up a surgical table. Tim hoped it didn't cause them too much trouble.</p>\n<p>People are talking. To him and to each other, and they wouldn't stop. He thought he heard Damian. His youngest brother's voice cracks on the word \"imbecile,\" and Tim's gut curls and rolls. He turns on his side and vomits on what might be Dick's sleek uniform shoes or Jason's heavy combat boots. Tim can't tell, and when he lifts his head to try and check, he promptly passes out for the rest of the ride. The sound of loud voices and panic ushers him into the dark. He shouldn't worry them like this. He feels like such a burden even as he's engulfed in the overwhelming darkness.</p>\n<p>•</p>\n<p>Tim Drake doesn't like the sound of heart monitors. He's heard too many flatlines in his lifetime to be reassured by the incessant beeps. A heartbeat did almost nothing to calm him these days. He hadn't been out for long, maybe a day. His tongue feels heavy in his mouth, but it's not numb from disuse.</p>\n<p>He starts to take stock of his injuries first. He remembers the zoo first, but he thought he handled that okay. The two gunshot wounds he feels tell him that he most definitely did not handle whatever came afterward. Then he remembers Patrol. Damian, Jason, a rooftop rushing towards him and pain, pain, pain. He was shot. And he hit his head. Hard, if the way he currently feels is any indication. He lets his senses take in his surroundings instead of his own body now that he's taken stock of his injuries.</p>\n<p>There are people in the med-bay. Talking. They aren't near Tim, so he opens his eyes. No one else is set up in a cot—a good sign. He was the only one with a severe injury. He let himself feel the relief and finally strained his hearing to the conversation that was occurring at the other end of the med-bay in hushed tones.</p>\n<p>\"–don't understand what Ra's wants with him.\" Tim's blood goes cold at Dick's mention of Ra's. The rest of the family doesn't really know the extent of everything that happened between Tim and the League last year. He didn't make an effort to tell anyone, and no one had asked.</p>\n<p>\"It's clearly a message.\" Tim recognized Bruce's voice.</p>\n<p>\"Okay. Sure. I get that a bullet with Ra's name on it is a message, but why <em>Tim?</em> Why not Damian? Why not Jason? And why is it so weird?\"</p>\n<p>\"... I admit I've never seen him take such an approach before. My best guess would be that he wanted me to know it was him.\" Ra's name carved on the bullets Tim was shot with makes him want to disappear into the cot, but he needs to know if this conversation can give him any more information, so he strains his hearing to try and listen more clearly. His head swims, but he manages alright, considering everything.</p>\n<p>\"But if it's about you, why did he go after Tim and not anyone else?\" That makes Tim pause. Nightwing's never been so Blunt about Tim's worth being less than the other Gotham vigilantes before. But he was the one who fired Tim in the first place, so maybe it isn't as surprising as Tim wanted it to be.</p>\n<p>\"I don't know, Dick.\" Huh, he doesn't know why he thought Bruce would argue.</p>\n<p>\"Okay. But what if it's not about you? What if it's about Tim?\"</p>\n<p>\"Why would it be about Tim?\"</p>\n<p>Dick pauses. Tim hears him take a cautious breath.</p>\n<p>\"…You didn't see him while you were lost, Bruce. It was bad. He went radio silent for nearly all year. And when he did show up, he was different. Violent. Angry. Itching to pick a fight. I don't even know what he did that year other than look for you, but Ra's was involved somehow, and now we find out he doesn't even <em>have a spleen anymore?</em> Come on?! That's weird!\" Tim wished he could pay closer attention, but his head still hurt.</p>\n<p>\"...hmm… I'm aware he had trouble while I was away.\"</p>\n<p>\"Bruce, you weren't away; we thought you were dead.\"</p>\n<p>\"He didn't.\"</p>\n<p>\"That doesn't mean he made good deci—\"</p>\n<p>Dick was cut off by Damian coming into the room and demanding, \"Is Drake awake?\"</p>\n<p>\"...not yet, bud.\"</p>\n<p>\"I need to talk to him about why he didn't have his Glider. It's an unacceptable oversight that a Bat should have been prepared for. And I need to hear from him about why Grandfather is so occupied with his demise. What could Drake have possibly done to insight his ire?\"</p>\n<p>\"Dami… Tim does a lot that we don't know about….\"</p>\n<p>At that, Damian seems to get even angrier. In a rush, he hisses, \"If he doesn't want to keep us informed, he shouldn't be going out with us!\" Tim winces and hears his small footfalls stomp away. And well, even through the pain of what turned out to be a severe concussion, a shattered ankle, and two gunshot wounds, Tim saw his point. He's almost embarrassed that it took so long to figure out that he didn't exactly belong anymore, if he ever did.</p>\n<p>Tim laid in the silence that Damian left behind as both older vigilantes followed him out of the med-bay.</p>\n<p>Alone, concussed, and in pain, Red Robin spirals.</p>\n<p>He's ashamed that he forgot he was temporary somewhere between standing in the Batcave for the first time all those years ago and free-falling from the Gotham skyline yesterday. Over the last five years, he's always had a job to do. He stopped Batman from going over the edge after Jason's death. He painstakingly helped Bruce and Dick start talking to each other again. He was instrumental in integrating Jason into the family even after the multiple attempts on his life. He fully pulled Bruce out of the Time stream. But the job's over. It's been done, and he hasn't been given a new one—Jason's back. Damian's grown. Tim's just lingering now. The Robin mantle isn't his, and it never really was now that he thinks about it.</p>\n<p>His job has been done for a year. He's just being a vigilante at this point, as if he forgot that he was only supposed to do that in the interim. A long-term, inconvenient, sometimes live-in temp. At least he's had the Nest these last two years; he doesn't want to think about how pathetic he'd feel if he'd had this revelation while still<em> living</em> in Wayne Manor.</p>\n<p>He never expected to be so bitter about having to leave when he started. Because he does have to leave, now that he's not oblivious to what was probably obvious to everyone else. Everyone else knowing and not saying anything fills him with a great deal of shame, and his concussion turns that shame into a violent migraine. He shouldn't be thinking about that anyway. He knows now. That's all that matters. He can make a plan now that he knows.</p>\n<p>He doesn't want to give up saving people, and his first thought goes to his team on the coast—maybe even operating in his friend's home cities with them. They could probably use a Robin, most likely under a different name, but being Batman trained would certainly open doors for him, even without any powers.</p>\n<p>He'll put together a Resume. He's done a lot for the Batfamily and Gotham over the years. He could be an asset to another city easily. Inferiority's never been his particular brand of insecurity. Tim knows he's capable just as much as he knows he's unwanted.</p>\n<p>But that begs the question, how does he leave when he still has so many responsibilities?</p>\n<p>He runs Wayne Enterprises with Lucius. Lucius Fox could run the company by himself, Tim's sure, but he shouldn't have to. He's currently the only Wayne child to do interviews—even Bruce has slowed down since his return. Without news about the Wayne's coming out organically, agencies and magazines start digging. The last time anyone but he or Bruce went to a Gala was before they knew about Damian. And he's managed the family's philanthropy endeavors since blowing up all of Ra's Al Ghul's bases. His patrol route covers 14 blocks that no one else regularly swings by, and Tim's pretty sure he's the only bat sans Barbara to update the Oracle network regularly. <em>All of those are things he can't just up and leave.</em></p>\n<p>So Tim Drake buckles down, and he does what he's always done best. He starts thinking about a plan in that hospital bed, and when Alfred allows him to move to his room for the remainder of his recovery, he gets down to business and makes a timeline. The schedule he comes up with only needs a year and a half to smoothly transition the company and his vigilante responsibilities onto everyone. Given his workload, he thinks he's done a perfectly adequate job with the preparation. And if he's given himself a month or two of buffer, he doesn't think about it too hard. A few more weeks than necessary with people he genuinely loves won't wound his pride any more than it's already been wounded. He thinks he can admit that after all his service, he deserves some time to enjoy his last 18 months in Gotham with a family that he loves, even if he's not truly been a part of it. It is, after all, the closest he's gotten to one.</p>\n<p>Two weeks later, when he's healed enough to convince everyone he's fully recovered, he starts to transition the rest of his gear to the Nest and begins to implement the first stages of <em>Operation: Flying the Nest.</em></p>\n<p>Tim starts with what he assumes will take the longest amount of time.</p>\n<p>He starts with Damian. Obviously, he starts with Damian.</p>\n<p>The kid's only thirteen, but Tim wants him to take over his position in the company as Majority Shareholder. Mostly. He wants to leave Damian in charge but with a stronger support system. He thinks Bruce can be something like a safety net and take back some of his responsibilities from before he got lost in the time stream. He also thinks Damian will get along with the Foxes once they spend a little time together. Tam will love the brat, even if she won't admit it at first. Tim believes it will be good for Damian. Lucius, too; Tim's the only \"Wayne kid\" Lucius gets to see regularly, and Tim <em>knows</em> that he views them as family, too. Even if some of them don't make a point to visit the office. And maybe Tim thinks it'll be good for the world too, sue him. He's a little proud already, and they haven't even started.</p>\n<p>His Calendar in the Nest is updated and ready for the upcoming 18 months. Color-coded and not digital. He and Barbara share a digital calendar. She would definitely find it weird if he started a separate, private one when they'd just made a key to differentiate the nuances between a \"dick appointment,\" a \"Dick appointment,\" and sometimes, in Barbara's case, a \"D/dick appointment.\" It was simultaneously one of his life's best and worst moments because they laughed together for hours. Yet, they had to explain the situation to Batman when they couldn't stop laughing over comms the entire night, which was obviously humiliating. They were comfortable putting up Barbara's physical therapy check-ins, Tim's prescription pick-ups, and even more embarrassing nonsense. Barbara knows he calls missions with Young Justice \"Hot Bitch Hours.\" Tim knows Barbara abbreviates seeing Black Canary as \"Dinah Legs.\" It would probably raise a red flag if he suddenly had an entire \"secret calendar\" for \"personal\" dates. Almost all of <em>Operation: Fly the Nest</em> must be hard copy until about a month before the final two weeks, or Oracle will find out about it.</p>\n<p>He can also probably still use the Oracle network when he's away. He usually does maintenance on it with Barbara on Tuesdays, and really, he can kind of do that from anywhere. Also, she still follows leads for Dinah, and Black Canary has operated in Star with the arrows for years. He'll probably be less involved, but that doesn't mean he has to give up the friendship they cultivated over the years. Tech geniuses have to stick together and all that.</p>\n<p>His calendar at the office is also updated. It's bird-themed because, of course, it is—a gift for the new year from Steph. He loves it.</p>\n<p>That calendar is more focused than the main one back at the Nest. This one is almost entirely about Phase One. Integrating Damian into the business side of Wayne Enterprises. Damian will turn fifteen on the last day of the plan. On that day, Tim will pass off the Majority Shareholder position to his little brother in its entirety. Tim subtitles the first phase, \"Office Gremlin.\" Mostly because he thinks it's funny. A little to distract him from the fact that he'll be giving up one of the things he genuinely likes and is good at. He's glad he's at least giving it to Damian. As much as he hates to admit it. Damian's going to be good at this. He'll even be better than Tim when Tim finally finishes training him. The kid's going to be amazing, and Tim smiles at the thought. It almost makes Tim content about finally taking the first steps toward leaving.</p>\n<p>When he rides into the cave the next night, right before patrol, he leaves his civilian bag on the bench by the training mats. He needs an excuse to return to the Manor tonight if this next part doesn't pan out the way he wants. He starts doing casework on the computer to seem casual when Batman and Robin are finished changing into uniform. He leaves his bike in easy view, as Red-Bird is a large part of the plan—basically the selling point for Damian's involvement. In the few minutes before Bruce and Damian come out of the lockers, Tim actually makes some headway on one of Dick's Bludhaven cases. He makes sure to flag his contributions clearly so Dick can easily pick up the work with the new information. When Bruce greets him, Tim can tell he's surprised Tim is in the cave. He's probably surprised because Tim's not supposed to be in costume for three more weeks. Tim turns around with a smile, cowl pushed back, open but not overdoing it. He's got this.</p>\n<p>Batman smiles tentatively back at Red Robin, \"Tim, I didn't know you were here?\" He frowns briefly, \"You're not supposed to be going out.\"</p>\n<p>\"That's actually something I wanted to talk to you about real quick!\" With his smile still in place, Tim thinks he might be able to pull this off.</p>\n<p>Stubbornly, Batman supplies, \"<em>No.</em> You are not patrolling on a broken ankle.\"</p>\n<p>\"Come on, the ankle's barely fractured at this point, B,\" Tim minimizes, \"And I never said I wanted to patrol.\"</p>\n<p>That seems to surprise the man. Tim's got him dead to rights now. \"Oh? What it is then? Are you okay?\"</p>\n<p>\"I'm doing great!\" Tim produces a folder from seemingly nowhere, black, sleek, and professional. He hands it to Bruce with the air of someone who's already won the discussion, \"A stake-out. And before you argue with me, look at the file. Low-risk, but important. Penguin's up to something that we'll need to stop, but he's not gonna make a move until after that big socialite party at the Iceberg next week. He needs that relatively clean revenue for the lounge. I can get easy intel from the western rooftop of the Fenderson Tower without it being the kind of time-sensitive stuff we have to move on immediately. Plus, I rigged a new zoom lens for my camera that might be able to get faces from way farther away that I've been dying to test. It'll beef up our case file with no risk of aggravating my injuries. It's exactly the kind of work I can do while the ankle finishes healing this week\". He doesn't mention that the ankle should take three more weeks to heal, not one. Still, he knows he's said it confidently enough to minimize Bruce's perceived danger of Tim's predicament. He'll be patrolling by next weekend if this plays out right.</p>\n<p>Bruce looks at Tim and the file and fruitlessly sighs, \"You were shot. <em>Twice.</em>\"</p>\n<p>Tim seals the deal precisely with how he predicted he would get Bruce, who Tim can tell is already tempted to let him do this, agreeing wholeheartedly. \"I wanna bring the kid, too\"; he looks straight at Bruce but nods at Damian. \"That way, I'll have company, and Robin can get some experience with some of the more boring but necessary casework.\"</p>\n<p>From the look on Bruce's face, Tim's won. The happy surprise at Tim offering to spend time with Damian momentarily overshadows Tim's recent run-in with a concrete roof. It helps that Tim knows precisely how to act healed and healthy. He's effectively convinced Bruce that he presented a course of action that is reasonable for his temporary limits, helpful toward an ongoing case, and informative for Damian's training. There was no way he <em>wasn't</em> going to win this.</p>\n<p>There is the small problem of Damian, though. Damian's head shot up at Tim, mentioning taking Robin on a stake-out. And then turns quickly to Bruce, looking for his father to deny such an out-of-turn request. Drake was just injured, and he shouldn't be out as Red Robin for three more weeks at least, and he shouldn't be taking Robin with him. Red Hood, Nightwing, or even Spoiler would all have an easier time taking care of him in an emergency. The entire plot is complete <em>nonsense.</em></p>\n<p>A gruff \"Check-ins every hour.\" comes from Batman.</p>\n<p>\"Done.\" is Red Robin's quick reply.</p>\n<p>\"WHAT? You were just concussed!\" Damian argues incredulously, \"Father! He was just on BEDRE—\"</p>\n<p>\"I'll let you drive my bike.\"</p>\n<p>Damian pauses and looks at Drake as if he's grown four extra arms. His eyes squint behind the mask. \"You don't let anyone drive Red-Bird.\"</p>\n<p>\"Wanna be the first?\"</p>\n<p>A pause, \"...this is a bad idea\". Tim throws him the keys anyway, and Damian catches them reflexively. He looks from Drake to the bike before slumping his shoulders and grumbling. \"Someone competent should be at the stake-out lest you fall over the side of a building and die horribly.\" Tim laughs, and it feels real for a moment. He can't even feel any malice in the statement, and it's nice.</p>\n<p>There's a small grin on Damian's face when he starts the bike, and Tim feels like this might be fun, even if it is part of the plan. Damian's a quick study, and Tim only really has to teach him how to drive the bike for the first few blocks, hand on the kid's shoulder as he whoops and grins. They effortlessly weave through Gotham towards the Fenderson Tower.</p>\n<p>Tim lets the mission play out how he knows it will when they get to the tower. Quietly observing the Iceberg Lounge's back entrance is exactly as dull as it sounds. But he fills the silence by teaching Damian how to take stake-out photos that can be used to identify people, vehicles, and products. The camera is an expensive beast that started out as a high-end Olympus before Tim rigged it up with vigilante tech. Tim also takes Damian through the procedure of emergencies with the camera. If you can pack it away, do it. It takes about seven seconds to secure in the backpack. However, if in danger, eject the SD card via the yellow button on the camera's side, and destroy the body. That will only take one second.</p>\n<p>Damian may not like Tim very much, but Tim knows he loves to learn, and the kid takes to Tim's teaching style exceptionally well during the stake-out. He's an attentive student; sometimes, his pride gets in the way of asking for more information. Luckily, Tim's been around Batman enough to know when someone <em>needs</em> help but won't <em>admit</em> it. They work together well, and Red Robin feels he's accomplished a lot in the four hours they crouch at the base of Fenderson Tower's southwest-facing gargoyle. They are able to identify the players in Cobblepot's upcoming scheme and get photos of a few illegal trades of what Red Robin thinks are knock-off Cheerdrops.</p>\n<p>He also has gathered pertinent information on how Damian learns new information and reacts to Tim being the one teaching it to him. It's far easier than Tim predicted, and he starts to rearrange and add ideas to what he wants Damian to learn over the next year and a half.</p>\n<p>As they pack up the camera and other supplies, Tim puts a hand on Damian's shoulder, the pressure telling him to sit for a few more minutes. He does.</p>\n<p>Tim waits almost too long before clearing his throat awkwardly, \"Ra's doesn't want me dead.\"</p>\n<p>Damian's head snaps up, but he stays silent, staring.</p>\n<p>\"The other week, in the medbay... you asked why he wanted me dead. He didn't—doesn't.\"</p>\n<p>\"...you were awake for that?\"</p>\n<p>\"Kind of. The point is your grandfather doesn't want me dead. He just... he just wants to make sure I can't forget him, is all.\"</p>\n<p>\"Oh.\" It's a small, little thing. And Tim remembers suddenly a child raised by Ra's Al Ghul. Violent, entitled, angry. He remembers a fall, his body broken, blinking in and out of consciousness. Staring at the far-away jaws of a T-Rex and the 10-year-old who pushed him from it. God, the things Damian must have gone through. He knows now, after being fully acquainted with the League. He takes a breath and reminds himself that that kid is here. Breathing, smiling, better.</p>\n<p>\"Yeah.\"</p>\n<p>\"...I'm sorry.\"</p>\n<p>\"Yeah... me too.\"</p>\n<p>Damian sits for a minute, but Tim can tell he wants to mention something else, so he waits until Damian is ready.</p>\n<p>\"About what you overheard the other night....\" Damian says slowly, as though he doesn't quite know how to go on.</p>\n<p>\"It's okay. I get it.\" Tim reassures the younger boy. He does get it. And it is okay. Tim's fixing it right now.</p>\n<p>\"...okay.\" Damian's quiet still, but he's more comfortable. Tim counts the conversation as a success and stands from their perch. He offers Damian a hand to pull him up, and they simultaneously fire off their grapples toward Red-Bird. Tim hides the wince from what may or may not be the stitches in his shoulder wound straining.</p>\n<p>When they return to the cave, they start typing their report on the bat computer and updating the current Penguin case file. Silences between them are usually tense and charged with caution and negativity. Tim can feel that this one is different. It's calm, companionable—he likes it.</p>\n<p>They work together well, and when Bruce returns, he seems cautious but asks how it went anyway.</p>\n<p>\"Red Robin and I retrieved enough evidence to solidly stop the Penguin's newest inane plot and send him to Blackgate for the foreseeable future.\"</p>\n<p>\"The full report for the night is in the Patrol Folder, and the case file has been updated with all the information we found. Robin's new skills include prolonged periods of surveillance with supervision, drug identification, use of the field camera, and for once,\" Tim takes a breath and smiles fully at Damian, \"keeping his tiny mouth shut\"</p>\n<p>He lets out a bright laugh as Damian lunges for him with a shout of, \"Drake!\"</p>\n<p>\"Nuh-uh, I'm INJURED Demon Child! My poor bullet wounds,\" Tim screeches through laughter.</p>\n<p>Damian huffs and punches Tim anyway. In the good arm. Lightly. Tim is surprised but so very proud of him.</p>\n<p>Alfred must be, too, if the old man's grin is anything to go by, \"May I suggest that the young Masters head upstairs for a small meal and some rest. You both have early wake-up calls. And Timothy, it is much too late to return to the apartment, and you have a far too neglected room here that I expect you to use when you come home after 3 am.\"</p>\n<p>Bruce seems to think that's a fantastic idea by his grin, \"I think that's a great idea, Alf. You two head upstairs; I'll see you both for breakfast in the morning?\" The last part is clearly a question for Tim.</p>\n<p>\"Yeah, I'll stick around for breakfast. My first meeting isn't until nine.\"</p>\n<p>Bruce smiles and nods, dismissing both proteges as he turns back to the computer to finish typing his own report. Damian heads upstairs directly after changing, but Tim lingers to take a shower, resting his head against the cool tile. He feels a little sick to his stomach and needs to get a grip. It's going well. Better than he planned; in fact, it's going perfectly. He should be happy about it, and he is. He's happy that the start of everything went smoothly. He's happy that these next few months mentoring Damian look like they might just be a good time. It's just that it's starting to hit him that he's going to have to leave. Funny that it didn't hit until then.</p>\n<p>Tim takes a deep breath and fills his lungs with steam and the faint smell of pineapple from his shampoo. He centers himself, compartmentalizes the emotions, and tucks them away. He'll feel them later. After.</p>\n<p>On the way back up to the Manor, he grabs his civilian messenger bag and flings it over his shoulder. He heads to his room and passes out, politely denying the offer of a post-patrol snack.</p>\n<p>He sleeps for 3 whole hours before his alarm brings him back into the waking world. He dreamed of nothing at all, and it was blissful compared to most nights back at the apartment. He tries not to overanalyze why that might be. Tries not to think about how utterly empty the Nest is and how Wayne Manor feels full of life even in its vastness. Tries not to think about why that seems to matter to him.</p>\n<p>He heads into his bathroom to meticulously take care of his morning routine. He brushes and flosses his teeth, completes a skincare regime, checks his stitches, and re-waps his ankle before placing it in its boot. He quickly dresses in a relaxed suit, fit for April's casual fashion season. He heads down to breakfast with this messenger bag—his laptop and tablet ready to help fulfill the plan's next steps.</p>\n<p>He gets downstairs before Damian and Bruce, and Alfred smiles warmly at him, plating up pancakes and passing Tim the cherry syrup and whipped cream. Even after all this time, Alfred still remembers how he used to like his pancakes, and it makes Tim want to cry. He smiles softly instead and mumbles a thank you before starting up a pot of coffee for himself and probably Bruce.</p>\n<p>When the machine finishes the coffee, Tim fills a plain white mug with black coffee and downs the first cup right there at the counter. He fills his second cup, sits with his food, and opens his laptop and tablet. Getting to work on renewing, approving, or denying contracts for the upcoming Summer Quarter. He's done this already, but he goes over it a second time to ensure it's ready for Damian to look over. There are 23 new contracts that he thinks should be approved, 42 that should be renewed, and 17 that should be denied or terminated. The remaining 12 need to be renegotiated but ultimately approved by the start of June. He's purposefully made exactly two mistakes.</p>\n<p>Damian shuffles in at seven, Bruce not far behind. Tim was right that Bruce goes straight for the pot of coffee while Alfred serves Damian pancakes with blackberries and maple syrup. The berries make a smiley face, and Tim smirks at Damian's small smile before the younger boy starts to cut into his food.</p>\n<p>Duke, who moved in just last month, also shuffles into the kitchen with a yawn. Cass is the final addition, silently appearing at the table and spooking everyone but Alfred.</p>\n<p>Small talk starts just as Bruce finishes his first cup of coffee. The table discusses school, work, and patrol mostly. Questions about everyone's week due to the upcoming weekend, and Tim enjoys it. He basks in how full the kitchen feels and lets himself have these few minutes before worrying about the plan. Damian finishes breakfast first, which is the perfect opportunity for Tim to segue without suspicion.</p>\n<p>\"Damian, once you put your plate away, can you help with something. I think I need a fresh pair of eyes on this contract I have to approve or deny.\"</p>\n<p>Four heads snap up to him when he asks for Damian's input. Tim knows for a fact that had he not taken Damian out for the stake-out last night, the plan would have imploded right then at the Breakfast Table. He knows because Cass and Duke look extremely confused, but Alfred and Bruce only seem slightly surprised. Both their faces betray a tentative happiness at how Tim is reaching out. Damian looks suspicious of Tim for a moment before letting his curiosity take over. The youngest of the group nods sharply and walks over to Tim's side.</p>\n<p>Once Damian looks at the screen, Tim clicks on the spreadsheet link from the laptop, and the contract's digital copy opens on the tablet's display.</p>\n<p>\"You can read the summary and notes here at the top of the page.\"</p>\n<p>While Damian reads, everyone turns back to their food, clearly waiting for the conversation to start again. Tim focuses on finishing his coffee and eating cherry syrup-soaked pancakes. Damian speaks just as Tim gets up to pour his third cup of coffee.</p>\n<p>\"What are the established pros and cons that make the decision difficult? I assume the answer would be to deny a contract with Lexcorp.\"</p>\n<p>\"That was my instinct, too; the major con is obviously Luthor and the undeniable corruption throughout his company. Also, he's tried to kill like five of our closest friends countless times. But the pros are more on the lines of Lex has an exclusive contract with the only company mining these rare metals out of the Western United States, and our scientists really want them. Right now, the only way to get them is through this contract with Lexcorp.\"</p>\n<p>\"tt.\" Damian huffs. \"I see. Is there any way to try and negotiate with this mining company?\"</p>\n<p>\"Not for the next year, while their contract with Luthor is still valid.\"</p>\n<p>Damian thinks for a minute, and Tim lets him, swirling the last of his third coffee cup. \"Approve it for the year, and reach out to this company in the meantime. Marcus Mining?\" Tim nods, so Damian continues. \"You can most likely offer them a much better contract than Luthor next year. Then Wayne Enterprises would have access to these minerals without worrying about using Luthor as a middle-man. That way, this dealing with Lexcorp only has to last a year.\"</p>\n<p>\"That's great thinking; Lucius and I have already been trying to phase out our other Lexcorp contracts over the last eighteen months. Sealing a deal with Marcus Mining will probably give the board of directors enough confidence for us to terminate the rest. Thanks, kid.\"</p>\n<p>\"Don't call me a child! I'm more capable than you will ever hope to be.\"</p>\n<p>\"Capable, but still only thirteen, kid,\" Tim says through a smirk.</p>\n<p>Damian all but screeches, \"A kid who you asked for help!\"</p>\n<p>\"Yeah, yeah, and you did great. I already thanked you.\"</p>\n<p>Damian quiets for a minute as Tim closes the contract tab. Damian is still looking at the spreadsheet open on the laptop, intrigued, and Tim internally smiles at how well these first steps are going.</p>\n<p>\"I would let you look over the other ones, but I think you gotta leave for school in a couple of minutes.\" Damian seemingly deflates but nods his head as if remembering that yes, he does, in fact, have school. Tim waits long enough for Damian to turn away before awkwardly asking, \"Hey... do you actually like this stuff?\"</p>\n<p>\"tt. I think it's overcomplicated drivel, just made to waste important people's time.\" Damian lies right through his teeth. Robin's good, but everyone at the table can tell it's not entirely true.</p>\n<p>\"Okay, that's fair... but this meeting where I present the decisions to the board isn't until Monday... so if you wanted to look it over this weekend, you could.\" Tim points out conversationally.</p>\n<p>Damian's pause is significant and lengthy. Everyone at the table is waiting for his answer, but only Tim is looking at him.</p>\n<p>\"You probably need all the help you can get. And we can't have you embarrassing the family with sub-par work.\"</p>\n<p>Tim genuinely chuckles, \"Alright then, I'll send you access to the spreadsheet. It'll go to your company e-mail; that's the one where you get invitations to charity galas and company events.\" And then, just because he thinks he can get away with it, he adds with just the right amount of hesitance, \"...If you actually want to learn about this stuff, I can teach you a few things.\"</p>\n<p>Damian nods once, and Tim takes that as his cue to stand and stretch. \"I left some paperwork at the apartment, so I'm headed out to get it before driving to the office. I'm gonna be on coms tonight with Babs, so I'll probably talk to everyone tonight. See you guys later.\"</p>\n<p>He starts to leave the kitchen after giving Bruce a pat on the shoulder and side-hugging Alfred as the man sets aside plates and glasses to put in the dishwasher. Just as he passes through the door, Damian speaks up haltingly.</p>\n<p>\"Drake,\" he says, unsure and awkward—like he's not used to the taste of the words in his mouth, \"Thank you.\"</p>\n<p>Tim blanks for a moment; he didn't expect that. Stiltedly, he ends the conversation with, \"Well...It's not a problem. Spreadsheet by Patrol on Sunday.\"</p>\n<p>They both meet eyes for a couple more seconds, and then Tim turns in the doorway again and leaves the kitchen toward the garage. He can't take Red-Bird; that's Red Robin's bike. But he can take Jason's old Davidson that's been in the garage the last week, and that's pretty cool once Tim thinks about it.</p>\n<p>He's feeling confident when he gets back to the Nest, so the first thing he does is call Jason. He wants to start making a precedent for some of the other vigilantes to begin covering his patrol routes in his absence. The Red Hood picks up on the fifth ring.</p>\n<p>\"This better be good, Replacement.\"</p>\n<p>It's early, so Tim cuts to the chase, \"I need you to pick up my patrol from Caulfield to Starway. Black Bat's been doing it, but she's just got a case that falls in the narrows, and that's too far for her to keep picking up my route while I'm injured. It's just for the next week.\"</p>\n<p>\"No.\"</p>\n<p>\"Jason.\"</p>\n<p>\"...Fine, but I want something,\" Tim makes a noise of assent that means something like, go on, so Jason does, \"Panic buttons—for Roy and Lian. The Bat™ kind.\"</p>\n<p>\"...Why not ask Bruce?\"</p>\n<p>\"Old man would’ve asked too many questions. Don't make me regret asking you.\"</p>\n<p>\"Okay, done. Roy can have one of the watches, but I'll have to make Lian's special. Did you have something in mind?\"</p>\n<p>\"A keychain...for her backpack...and a bracelet, for when she doesn't have the bag.\"</p>\n<p>\"Sounds good. What kind of keychain would work with the bag?\"</p>\n<p>There's a heavy pause before Jason sighs in defeat, \"It's... It's a Batman bag.\" Tim bursts into laughter, and Jason <em>groans</em>, \"Come on, Timbo, stop fucking laughing at my misery.\" He doesn’t stop. At least not for a couple of moments.</p>\n<p>Tim catches his breath, \"I'm sorry, I'm sorry... I'll stop. I have something in mind for the keychain now, so thanks. What about the bracelet, you want that superhero-themed, too?\"</p>\n<p>\"Nah, um... she likes that turtle show a lot... almost all of her clothes are about that right now.\"</p>\n<p>\"Ninja Turtles?\"</p>\n<p>\"The one and only.\"</p>\n<p>\"I can work with that. It'll be ready on Monday. You want these to send out a signal to the whole family?”</p>\n<p>\"Yeah, I kind of want the cavalry to show... just in case, you know?\"</p>\n<p>\"...Yeah, I get it. And you’re sure you can add the extra section to your patrol for the next week?\"</p>\n<p>\"I already said yes, Timmy, just take it. Also, you should know you can't bullshit me, kid. I'm taking the route for the next two weeks, at least. Even though I'm pretty sure it's supposed to be three.\"</p>\n<p>\"I only need the one,\" Tim states in a challenge.</p>\n<p>\"Yeah, no dice, Replacement, you have a broken ankle. Both weeks or nothing. You're lucky I'm choosing to forget the third.\"</p>\n<p>\"...fine. I hate you, by the way.\"</p>\n<p>\"Get in line, dumbass,\" he pauses, and then, \"Fucking get better, or whatever,\" and with those very encouraging parting words, Jason Todd hangs up the phone.</p>\n<p>Tim updates the digital calendar by adding Tech Project for Jason on the upcoming labels for Saturday and Sunday. After that, he shoots a text to the Young Justice group chat, asking what kind of pizza they want for tomorrow's Saturday meeting. They decided to take a day off with Tim because he couldn't fight baddies this weekend. The whole team is on call, just in case, but they're planning on staying in the tower and binging Wendy the Werewolf Stalker™. It's on the calendar and everything.</p>\n<p>Finally, he grabs his files, shoves them in his messenger bag, and heads off to work. He has a meeting on the blueprints for the newest Wayne Medical™ prosthetic at 9 am that he’s actually excited about.</p>\n<p>“Why does this always happen when we plan something nice?” Cassie grunts as she struggles to yank her fist out of a depowered robot’s sternum.</p>\n<p>“Because Toyman probably has a mole in Young Justice. Hey Rob, you cheating on me with an older man?” Kon tries to joke, but he has to stop every two words when he’s inevitably tackled mid-air by Toyman’s newest Krypton-inspired creations.</p>\n<p>Tim laughs anyway from the comms he’s manning back at the Tower, “Oh yeah, I’m actually really into disgraced geniuses with a doll kink, now. Sorry to tell you like this,” Tim quips back before turning his attention to Bart. “Impulse, you can limit the perimeter by 5 blocks in all directions, looks like Wonder Girl and Superboy made enough noise to bring in the stragglers.”</p>\n<p>“On it, Captain Rob-Man! Hey, is it just me, or is it totally super weird these bots look like Kon’s kind-of dad?” Bart asks the group.</p>\n<p>Tim and Cassie both say, “definitely super weird,” just as Kon huffs, “Superman’s not my <em>dad</em>.”</p>\n<p>Bart doesn’t let up on Kon, though, “You’ve lived with him for two years and call Jon your little brother. Plus, I only called him your “kind-of dad” listen more closely, my dude. Also, Rob, can I please please please do the tornado thing now that I cleared the streets of civs?”</p>\n<p>Kon sighs in defeat but doesn’t answer. Focusing more fully on the robots swarming him and Cassie. After a loaded pause, Tim replies, “I don’t want any property picked up in the wind, so keep it controlled, Impulse.”</p>\n<p>The cheer Bart lets out vibrates through the comms, and his good mood is as contagious as its always been, “yes yes yes yes yes yes yes, awesome!”</p>\n<p>It only takes about 15 more minutes to get everything under control and Toyman into custody after Bart joins the main fight. Tim, who was at the dining table surrounded by at least four collapsable monitors, returns to the living room to wait for the original young justice members to return. He sinks into the couch and turns the tv back on to find where the group stopped in their Wendy the Werewolf Stalker™ marathon. Just as he loads up the episode, he hears his friends boisterously enter the living area, already changed back into civvies. Bart even has a fresh bowl of popcorn, thanks to the wonders of super speed.</p>\n<p>“Start it up, Boy Wonder,” Cassie calls as she vaults onto the seat by his left. Tim moves closer to her, so Kon and Bart have room to sit on the right side of the couch. It’s a tight fit to get four heroes on only one of the living room couches, but they’ve never been a fan of spreading out to the other sitting areas around the tv. Cassie’s arm is reaching out across the back of the couch, keeping her in contact with Tim and Kon, and Bart’s rested his legs so that his feet pool in Cassie’s lap all the way from the other end of the sofa. Tim presses play on the second season premiere of Wendy™ and relaxes into the embrace of his closest friends as they watch their favorite show.</p>\n<p>It’s just about to start getting late when Tim suggests they pack it in for the night.</p>\n<p>“Timborine, it’s only like, 8 pm?!” Bart complains loudly.</p>\n<p>Tim lets out a little sigh, “Yeah, I know… I just wanted to talk to you guys about something before I head back. Is that okay?”</p>\n<p>Three concerned gazes turn to each other and then to him. They nod. Cassie touches his good shoulder and says, “Of course, Tim.”</p>\n<p>“...okay, um. It’ll be a little while, but…” he sounds unsure until he takes a breath. The next words are stronger, fuller, without the hesitance of how he started, “I’m moving out of Gotham. Gonna do something else, I think, something more me, less Batman.” At the end of the sentence, he nods once and looks up to see three very concerned and confused faces.</p>\n<p>The silence is heavy, and Tim doesn’t quite understand <em>why</em>. He looks, really looks at each of them, and wonders why they seem so shocked. Until Kon speaks up, “Tim, are you quitting being Robin?”</p>\n<p>“I’m not Robin.”</p>\n<p>“What do you mean you’re not Robin?”</p>\n<p>“<em>Damian’s</em> Robin.”</p>\n<p>“Oh my god, Red Robin, Robin–it’s the same. Are you quitting?”</p>\n<p>Tim’s confused, “It’s just… I was Robin, right? I had the job, and I did it. And then I wasn’t Robin, you know? But I still had a job. I had to get Bruce back. So I became Red Robin, and I did the job again. But like… the job’s done, now. Mission accomplished. Batman saved, family back together, all that. I’m just kind of…residual now, no? So, Yeah. What if I get to be something else? Wouldn’t that be better than staying where I’m not needed? I could be with you guys, maybe. Out here. If that’s okay….” He trails off and doesn’t look them in the eyes until he feels their hands on him. Cassie’s by his shoulder, Bart by his knee on the ground, and Kon fitting his hand into Tim’s and gripping tight.</p>\n<p>Cassie says, hesitant, “You’re not residual or whatever. We need you, like every day. I’m sure the Bats do too, hon.”</p>\n<p>Tim shakes his head, “Do you remember what it was like when I first became Robin?” There’s a silence because, yes, they do.</p>\n<p>They remember a Batman who was different than he is now. Who taught Tim like he was a soldier, not a mentee. Who Tim brought back tooth and nail from the edge after Jason’s death. They remember a Robin who wasn’t Batman’s son and was reminded of that every day. By the ghost of Jason Todd, by the very alive Nightwing, by Batman himself, and the sterile, empty rooms of Drake Manor that he returned to at the end of every night. Alone, alone, alone.</p>\n<p>They always knew that the first year was hard. That being Robin cost Tim a lot of himself. That it didn’t really work out for him after that, either. Stephanie dead–or fake dead, or whatever. Both his parents dead, no matter who they were or what they did. Jason Todd <em>alive</em> again, only to nearly slit Tim’s throat at the Tower they’re sitting in right now.</p>\n<p>Tim continues, “As hard as it was, I loved the job. I still love the work. I’m good at it. But I’m not Robin anymore. And like, even when I was, Robin wasn’t mine, you know? I…I want something to be mine, I think. And like, whatever I’m doing right now, it’s just… I’m not needed there. Like all the roles are full, and I’m just trying to squeeze into a place that doesn’t even exist. So like. I have a plan to leave. It’ll take 18 months to tie up all my loose ends and pass off my responsibilities, but these are the next steps. And um. I’d like to know if those next steps could maybe include you guys.”</p>\n<p>Cassie grabs his face and looks into his eyes intensely. She’s crying. Tim reaches out to touch her arm. <em>He didn’t want to make her cry.</em></p>\n<p>She makes him look at her, and though some tears fall gracefully down her cheeks and to her chin, she sounds so sure, so confident, and so unflinching when she says, “Tim Drake, I will always need you. No matter where you are or what you call yourself. I have followed you to the end of the universe and would do it again. Batman affiliated or not, you are my leader, my friend, and my family. If you don’t want to dress up like a demented traffic light anymore, then I will do nothing but support you through that growth. You fit here, with us. You always have, and you always will.” Bart and Kon both tighten their grips and nod when Tim turns to them, all of them silently allowing tears to well and fall.</p>\n<p>“Keystone and Central would be lucky to have you if you wanted,” Bart says before climbing back on the couch and hugging Tim around the middle. Cassie joins Bart while Connor repositions to kneel in front of the group nestled on the couch together, grabbing both of Tim’s hands in his.</p>\n<p>Connor smiles something small and sad before, “I uh. I know Metropolis isn’t Gotham…but um. Metropolis does have, like, a metric ton of rogues that carry a bunch of kryptonite. So…you would be very helpful to everyone there…needed and everything.” He pauses. “I just…if this is what you want, then I want you to have it. I need you to be sure, though. Sometimes, people love differently, you know? Or maybe they’re bad at it and need a kick in the pants like Clark did. Maybe you fit there and just can’t see it because sometimes you think too hard....\" Kon bites his lip before the last thing he needs to say, \"Tim, you love them. Do you think that you can leave and still be okay?”</p>\n<p>Tim swallows around the lump in his throat because Kon is right. He loves them all so much. He loves Gotham. He loves saving people, running rooftops, and fooling around with Steph and Cass. He loves so much, but he feels wrong-footed, even on rooftops. Out of place, even with the people he thought of as family. He feels empty and sick and so, so very tired. He doesn’t want to feel like that, anymore. He doesn’t want shame crawling under his skin every time he thinks about everyone else having a place when he doesn’t, knowing he should have seen it so much sooner, and done everyone the courtesy of leaving before it became a problem. He needs to move on for himself and for the people he loves. So he looks at Kon and tells him the only truth he has left.</p>\n<p>“I think I need to.”</p>\n<p>And Kon joins the group hug on the couch, wrapping his arms around all three of them, and says, “Okay, then.”</p>\n<p>They talk more after that. About where Tim would stay, they throw out alias’ he could be called––all horrible. They talk about the future because Tim is more open about his plans than his past. And when Tim says he should be getting back, they hug for another 15 minutes for the goodbye before Superboy offers to fly him home instead of taking the teleporter. The flight would take an hour, and it was half-past nine already. Tim agrees anyway; he’s on comms tonight, so he can afford to be a little late.</p>\n<p>When Kon sets him down in the Nest, he rests his forehead on Tim’s. “I need you to hear this, okay?” Tim nods against Connor’s head, and Kon says, “I know how you get with plans. It’s like… it’s like once you decide to do something, you just do it until it’s done. And I admire you for that. It’s one of your best qualities. But this time. I need you to let yourself feel things. Change things if you need to. I want you...I want you to be able to change your mind if something doesn’t feel right. Does that make sense?”</p>\n<p>Tim stares. He tries his best to parse through the words, but he doesn’t understand, not really. He <em>does</em> change and adjust plans—all the time. He uses data, analyses risks, and adapts the plans he makes for the best results. He doesn’t get what Connor’s trying to get him to do. Tim wishes he could tell Connor that he doesn’t get it, but he can’t bring himself to. He doesn’t want to disappoint him. Kon’s only asking Tim to do <em>one</em> thing here, after all, so he nods anyway. He promises himself that he’ll try and understand what Kon tried to explain later.</p>\n<p>Kon smiles softly and kisses him. It’s nice. He has to leave so Tim can get to work, but it was nice.</p>\n<p>Tim fills a cup of coffee, sets himself down by his computer bay, and activates his comm unit. “What did I miss?” He asks the open air, ready for anything.</p>\n<p>Stephanie lets out a joyful laugh, “Red! I’ve been waiting for you all night. Guess who faceplanted outside a Subway Sandwich Shop 15 minutes into patrol? Please guess so I can tell you!”</p>\n<p>Tim makes Lian’s keychain and bracelet in a binge that lasts from 4 am to 1 pm on Sunday. He promptly passes out for three hours and wakes up to an email notification from Damian’s Wayne Enterprises account. He’s confused for a groggy few seconds before he remembers the spreadsheet and bolts upright.</p>\n<p>Tim immediately opens the document to review it before patrol. He’ll be on comms again, but he’ll try to talk to Robin a little more this time. Managing the tech has been good these past few weeks during recovery, and he knows Babs appreciates the help. He might take a couple nights in with her before all this is over.</p>\n<p>In the email, Damian has attached a second file of detailed notes written so that they coincide with the spreadsheet Tim had shared. It’s a sound system, highly organized; Tim can see it working in the future. The actual spreadsheet is only changed by the addition of a second “action” column indicating Damian’s view on the contracts using the key Tim had previously established for the actions to approve, deny, renew, cancel, or negotiate. Nearly all of Damian’s decisions match Tim’s own, with a few exceptions. Both contracts Tim had mismarked were changed in Damian’s column. Notably, there is one that Tim didn’t think had problems, but will double-check it now that Damian has questioned the first decision. Tim goes to read the comments on the attached document to get some context and stops short for a minute. Something pangs in his chest when he realizes that Damian has written the comments directly addressing him, and he doesn’t really know why that affects him the way it does. </p>\n<p>Most of the comments are quick and professional. They detail why Damian agreed with Tim’s choices for nearly all the decisions, and a few of them state supporting arguments to bring up if the board disagrees with some of the more philanthropic choices. The contracts that Damian had dissented on got more dedication from the kid, though. There are paragraphs outlining certain decisions that Damian backs up with Tim’s own set precedents; it’s really good work. Tim can help it get better, but it’s already some of the best he’s seen.</p>\n<p>However, the questions sprinkled throughout the attachment are even more interesting; they ask Tim directly for information. </p>\n<p>\n<em>Drake, why does the R&amp;D department seek business with Kord industries over the Transhumeral and Transfemoral prosthesis lines but not the Transradial or Transtibial designs? </em>\n</p>\n<p>\n<em>Is this the company belonging to the woman whose son claimed father was “dumb enough to lose his hands” at last year’s Queen Consolidated Charity Gala?</em>\n</p>\n<p>\n<em>Timothy, the renegotiation for the contracts involving providing lab machinery to state facilities should stipulate the adherence to Wayne Enterprises’ policies on animal testing.</em>\n</p>\n<p>The email is promising. Tim can use these conversations as a reason to bring up the next steps he wants to start working on this summer. </p>\n<p>He’s excited to talk to Damian about the disagreements and congratulate him on a job well done. No doubt, Damian will be insufferable about it, but Tim thinks the kid will be silently pleased. He likes to do good. Tim can tell because he can recognize himself in it from when he was Damian’s age—fighting Bruce at every turn to even take him on as an apprentice. Different in so many ways, but so very similar, too. </p>\n<p>He thinks it has something to do with how they grew up in those early years. Bruce shares that with Dick and Jason. All three of the original team grew up angry. They each harbored a unique rage fueled by grief, revenge, and bitterness. It took hold of them young and spit them out on Gotham’s criminals without remorse. Tim used to feel like the lack of that boiling anger made him lesser, somehow worse at the job—not dedicated enough—too clinical. He doesn’t anymore—because he sees the same thing in the newest Robin. It’s funny how Damian helped assuage that feeling of inadequacy without even trying. It’s funny because the kid would probably be mad at himself for helping Tim at all. </p>\n<p>The rest of the family likes to call Damian the angriest so far, but that’s not exactly right. They’re good detectives, but they’re missing the mark. They always have when it comes to each other. Their mistake is conflating anger with the kid’s ingrained dependence on violence when that comparison is far too simplifying. Those brutal habits were learned by necessity, and Damian’s doing a valiant job of unlearning each and every one of them. What no one else seems to recognize, even Robin himself, is that Damian—just like Tim—grew up lonely. It’s why Tim still gets it, even with the multiple murder attempts, the vicious vocabulary, and the unearned entitlement. He gets why Damian makes the decisions he makes. He understands why Damian goes to violent extremes just to <em> try </em> and prove himself. Tim has never found it hard to sympathize with him; he just wished that the kid could see it too. </p>\n<p>Damian is trying very hard not to be suspicious of Drake. He is. It’s just very hard because he doesn’t understand what the hell is going on with him. Drake should hate him. Drake does hate him, and Damian knows that Drake has every right to continue to hate him. After everything Damian’s done, Robin assumed that whatever thing resembling a ceasefire they had going on was the best relationship he’d get to have with his predecessor. So yeah, none of this makes any sense at all, and none of it should be happening. </p>\n<p>But….</p>\n<p>But it’s nice, is the thing. And nice things have the habit of blowing up in Robin’s face no matter which brat wears the mask. It’s not Damian’s fault for needing to be cautious, but he’s also just started to learn enough to not <em>want</em> to be. </p>\n<p>Red Robin is still on comms tonight, focusing on Batman, Robin, and Red Hood, while Oracle handles the Batgirls and Nightwing. Even though Damian knows Drake prefers fieldwork, he’s incredible at the job. He wouldn’t lie to everyone about recovering faster if he wasn’t itching to get back to the rooftops—back in the fight.</p>\n<p>Drake’s making more of an effort to talk over the line than he usually does. Bruce is indulging Tim for now. Damian catches his father smiling more than usual at the incessant rambling. Robin can tell that Batman thinks Red Robin is talking because he’s bored. Damian thinks it’s because he’s vibrating with nervous energy, anxious every time one or all of them so much as throw a punch, knowing that the family has one less form of backup than they’re used to. It’s setting Damian on edge too, which is a new and unfortunate development. </p>\n<p>Damian never noticed when Red Robin wasn’t on patrol with them in the past. He barely talked on the main comms, he kept to himself, and Damian can’t remember the last time he asked for help. There is absolutely no reason to feel his absence now; even so, it’s not like he’s <em> really </em> missing. Red Robin hasn’t stopped talking for nearly the entire night. </p>\n<p>He’s still chattering with the Red Hood about the abysmal state of the Gotham rogue’s safe situation and how easy they have become to crack, “Hood, I’m telling you it’s like they aren’t even trying anymore. They’ve been moving over to locks with numerical or alphabetic codes. I can unlock those from here, you know? There’s no skill involved in safe-cracking anymore.”</p>\n<p>“You know, Red,” Hood postures, “Most people would consider that development a good thing.”</p>\n<p>Tim responds, “I would expect more appreciation for the finer elements of breaking and entering from you.”</p>\n<p>“Listen, I’m not saying I don’t miss a good dial combination. I’m just pointing out that easy might be considered better when we’re dealing with psychopaths, you get me?” Jason asks him with an air of amusement to his tone. </p>\n<p>Tim huffs a breath and states, “I just think sensitive information should be safeguarded with something slightly more secure than a child-gate. Anyone could’ve swiped those files from Riddler.”</p>\n<p>“Hey! That was hard work, <em> Smurfette </em>.”</p>\n<p>“Uh-huh, that’s why it took less than 10 minutes.”</p>\n<p>They drone on, trading barbs and continued thoughts on the state of Gotham’s current villain gallery. They eventually begin to argue over whether or not certain rogues are actually villains, it’s inane chatter, and Robin focuses on his work instead of their bickering. That is until the end of the patrol when Red Robin addresses Damian directly, asking to move to a personal line once the vigilantes make it back to the cave. Damian agrees after a slight pause, allowing Tim to switch his comm’s frequency. </p>\n<p>Tim wastes no time on small talk; Damian appreciates this. “Your notes were well-done.”</p>\n<p>It’s surprisingly blunt praise, and the younger teen doesn’t know how to answer. He doesn’t seem to have to, though, as Tim continues a moment later, “I’d like the address some of your notations and ask for clarification on a few points if that’s alright with you.”</p>\n<p>Damian falters. Drake is asking him if he wants to continue the conversation—voluntarily relinquishing all <em> control </em> over the situation to Damian. Damian could refuse. He could deny the request and leave Drake licking the wounds of embarrassment and disrespect that Tim had all but opened himself up to. Damian could say nothing at all, just go and make Timothy feel as irrelevant as Damian’s always insinuated he was in the past. </p>\n<p>There’s an insult sitting on the tip of his tongue, but when he opens his mouth, all that comes out is a small, “okay.”</p>\n<p>They talk. They discuss the contracts that Damian disagreed on. Tim answers the questions Damian had all but scrawled on a note-taking document. He treats every single comment methodically and with care—even the ones that were clearly just written for Damian to keep track of his own thoughts while reading over the spreadsheet. He asks Damian questions that make him feel increasingly off-kilter, but also something else, something warmer. Tim listens when Damian elaborates on his points. He changes two of the contract statuses after they discuss them and promises to look at and add a final clause to another after Damian raises concerns about animal testing. And at the end of it all, <em> Drake </em> thanks <em> Damian</em>. As if Tim wasn’t the one who just spent the last hour teaching Damian about business and company politics, patiently answering and asking questions without any hint of annoyance, even when Damian himself became short or heated or embarrassed at times. It throws the younger boy thoroughly, and his body sings with suspicion, but he pushes it down, aside, and away, for now at least. Instead, he lets himself feel pride; it’s different from his pride in the field or in public with his father or Grayson. It’s quieter, but he likes it all the same. </p>\n<p>When Drake offers to send him the meeting minutes to go over once they’re available and written, Damian readily agrees. He’s surprised at himself for how invested he’s become in what is essentially busywork, but he knows it’s important. And it’s for the company, and the company means something. Wayne Enterprises is a big deal; their father entrusted it to Timothy, and however small the task is, Timothy entrusts it to Damian. </p>\n<p>The meeting goes well…. Tim gets most of what he wanted, at least. It’s not without the usual hiccups, but that was always to be expected. </p>\n<p>Rina, who truly missed her calling as a court stenographer, types meeting minutes word for word, and she doesn’t pull punches. Tim debates editing some of the more pointed attacks from Mr. Gauthiery and Thompson but decides against it in the end. Two meaningless businessmen can’t really lower Damian’s opinion of him anymore. He does preface the document with a clear paragraph in the email, though.</p>\n<p>\n<em>Damian,</em>\n</p>\n<p>\n<em> The board’s meeting minutes are attached. Rina was taking them today, so they are extremely thorough. This much detail is only presented when she is behind the keyboard, so some meetings will undoubtedly be less documented. She also does not sugar-coat certain language, and I have not edited the document. I do not want what some board members say about your father to surprise you; please remember that to them, Bruce Wayne is a fortunate rich kid who is irresponsible with his money and is loose with his morals.  </em>\n</p>\n<p>\n<em> The meeting lasted two and a half hours, but the reading time should be much faster. Thanks for all the help. </em>\n</p>\n<p>\n<em> Timothy Drake. </em>\n</p>\n<p>\n<em> Majority Shareholder, WE </em>\n</p>\n<p>Damian calls Tim precisely 3 hours after Gotham Academy lets out for the day. He should be eating dinner. Tim is still in the office, filing a backlog of R&amp;D documents for Lucius. Tim isn’t expecting a phone call, but he can’t say that Damian finishing going over the minutes so efficiently surprises him. Damian has always been blunt—not one to waste any time. Tim appreciates that work ethic right up until his younger brother speaks heatedly into the phone on the other side of the line.</p>\n<p>“Aiden Gauthiery should be immediately terminated from his position on the board.” </p>\n<p>Tim is silent for too long, and there’s no way Damian doesn’t pick up on the tension, even from over the phone. Eventually, though, Tim softly says, “Mr. Gauthiery owns 8% of the current WE shares. I do not have the authority to remove him from his position. I know some of the things he said about Bruce were—”</p>\n<p>Tim doesn’t get the chance to finish his statement before Damian barrels over his words unceremoniously, “Father puts forth a public image designed to manipulate people into forming those opinions about him. I’m talking about how that moronic excuse for a man talked to <em> you </em>.”</p>\n<p>And with that, Tim is rendered silent once again, but for a different reason entirely. Tim is speechless this time because, for the first time in a long time, he doesn’t actually understand what’s happening. This doesn’t seem to deter Damian on the other side of the phone; he couldn’t see Tim’s face go slack, after all. </p>\n<p>“It’s unacceptable and unprofessional to disregard the Majority Shareholder’s work so completely, for no substantial reason. He talked to you like you didn’t deserve to be there when all he’s ever done in his life is inherit money and take over his wife’s shares of Wayne Enterprises.” </p>\n<p>Tim finally seems to escape from his stupor when he hears Damian take a shaky breath, probably to breathe in enough air to rant more about how much he dislikes Aiden Gauthiery. Tim tries to calm him down with reason, “Damian… you have to take into account that from his perspective, I’ve done nothing with my life but inherit money and take over my guardian’s shares of Wayne Enterprises.” If he’s being honest with himself, Tim definitely should have realized that throwing Damian’s words back at the kid wouldn’t help settle down the heated emotions.</p>\n<p>“He implied you were incompetent and uneducated!” Damian’s voice rushes out like he’s bursting. Tim doesn’t quite understand where the anger is coming from.</p>\n<p>Tim sighs and tries to explain, “I’m a high school drop-out, Damian.”</p>\n<p>“You have a GED and were offered 3 honorary business degrees that you turned down last year,” Damian argues, pushing forward a conversation Tim still doesn’t know why they started.</p>\n<p>Tim startles and demands, “How do you know about the honorary degrees?”</p>\n<p>“TT,” Damian huffs, “Cat Grant wrote a very popular article about your refusal to accept them at the start of the year. Which is yet another reason this imbecile has no right to question your decisions in front of the board! Lucius had to step in no fewer than four times to remind him about acceptable workplace disagreement practices. He is unprofessional and incompetent, and I <em> hate </em> him.” Damian finishes—there’s an acid in his tone—vitriolic. </p>\n<p>Tim grimaces before sucking in a small breath, “Dami… I can’t fire everyone who doesn’t respect me. And I don’t have the power to, either. Gauthiery stays.” Tim tries to sound firm, but the kid still doesn’t relent, and all Tim can think about is how much he doesn’t want to be having this conversation.</p>\n<p>Damian viciously tries to demand, “So he just gets to insult the family like that, then?” And now, now Tim’s kind of getting annoyed.</p>\n<p>“He’s not insulting the family. He’s insulting a snot-nosed 18-year-old <em> kid </em> who doesn’t deserve the power given to him through what is commonly viewed as one of the most infamous cases of nepotism in modern world hi—”.</p>\n<p>Damian cuts him off <em> again</em>, nearly screeching, “If he’s insulting you, he’s insulting t—.” And surprising even himself, too tired of being interrupted, Tim snaps.</p>\n<p><em> “Robin!” </em> Tim barks down the phone. Tim is floored that it worked. Damian is silent, and the tension on the line is palpable. Tim knows deep in his chest that Damian will view the following words as the command that they are. And he can also tell that for the first time in their shared history, Damian will listen without pause, “You will drop this, and you will hear me. Is that understood?”</p>\n<p>Robin’s reply is short and clipped, if slightly subdued, “Yes.” </p>\n<p>Tim breathes, adjusts his voice to be less commanding, and tries to explain now that he has the floor, “This is not an outlier. Bruce had to deal with it when he was more involved in the company, and I have dealt with it for over a year.” Tim pauses, debating whether or not this is showing too many of his cards at once, before getting tired of his own bullshit and just biting the bullet, “You will have to deal with it when you start coming with me to certain meetings over the summer.”</p>\n<p>The line is quiet but for breaths. Damian is putting the pieces together in his head.</p>\n<p>“You want me to participate in an internship over the summer.” </p>\n<p>It’s not a question, but Damian states it like it is. He’s tentative and soft and so unlike what Tim is used to at that moment. He’s much more familiar with the boy who was just screaming into Tim’s ear about a man he doesn’t like. Tim answers anyway because this is what he prepared for, not the argument earlier. This is just getting everything back on track. </p>\n<p>“If you want it, I developed a summer intern position that could teach you about the company. There’s a project there that I’d want you to complete.” Tim waits for a beat, “It’s only if you want to do it, though.”</p>\n<p>Damian answers quickly, his voice picking up again to its regular timber, “I want it.”</p>\n<p>Tim grins and warns him, “I think it’ll be good for you, but I can’t show too much favoritism. You’ll probably have to do boring intern stuff like get Lucius coffee and file late-night paperwork.”</p>\n<p>And now the kid’s even quicker on the uptake, and he firmly says, “I still want it.”</p>\n<p>Tim relaxes, “Okay, then. We’ll talk about it more over Sunday brunch at the manor. Are you good?”</p>\n<p>He can feel that Damian has something to say, but he must decide against voicing it because he simply says, “Yeah… all good”, into the phone before hanging up.</p>\n<p>Tim’s not exactly proud that it’s such a relief that Damian hangs up the phone, but that doesn’t make it any less of one.</p>\n<p>Tim has to drop off the panic buttons to Jason in half an hour and finds himself looking forward to it. He walks over to the brown box he placed the three beacons in when he grabbed them from his desk at the nest and opens it, checking it over one last time before he leaves the office. The watch sits garishly in the corner, calling attention to itself with its bright red band and over-large face. Roy’s going to love it, but it’ll no doubt annoy the hell out of Jason. The Ninja Turtle bracelet is a true work of art; it’s Michaelangelo themed upon Jason’s request—apparently Lian’s favorite. The keychain for the backpack is his favorite, though. A miniature red-chrome version of the Red Hood helmet and a bright red quiver dangle together off a silver jump ring. Tim smiles softly and packs it away before heading toward Jason’s current apartment.</p>\n<p>The second he ends the call with Drake, Damian wants to scream, but he won’t. He’s an Al Ghul—a Wayne. He’s <em> Robin</em>, and this isn’t going to get to him. The whiplash the conversation left in its wake is still hollowing out his chest cavity, but if he just thinks about it for a minute, it’ll be fine. His chest can’t be hollow because his lungs expand and contract with his breath. His heart is beating solidly at the pulse-point on his left wrist, and the hand he puts to his chest counts his ribs—all present and secure—there is no gaping hole in his sternum. It helps, and it means he can actually take stock of his emotions now.</p>\n<p>He’s confused and still angry, but he’s also cautiously excited. It’s weird feeling so emotionally unhinged, so he does the only thing he can think of that might make this better. </p>\n<p>He asks Grayson to come to the manor, and just like Damian knew he would, Grayson comes.</p>\n<p>Dick arrives in a good mood because it’s been a good few weeks. Jason and Bruce are talking, Duke is finally settling in, and the girls are as chaotic as ever. Tim is recovering. He took two bullets, but he’s recovering, and he’d been so present on tech with Babs. Everything is going well, so he doesn’t think much of Damian asking him to come over. </p>\n<p>Maybe he should have. Dick’s littlest brother’s brow is pinched tight when Dick finds him sitting at the kitchen island, playing with the cover of a small tablet. He seems to be thinking deeply, and something is so clearly bothering Damian that Dick can sense it just from how tightly the youngest Wayne holds himself. He doesn’t even protest the hug Dick gives him when the oldest sibling makes his own way over to the island. </p>\n<p>“Hey Dami, is something wrong?”</p>\n<p>“I…” Damian starts, “I don’t know.”</p>\n<p>“...okay. Well, if you walk me through what you’re thinking, maybe saying what you’re feeling out loud will help you decide whether or not something is wrong. Does that sound good?”</p>\n<p>“It’s Drake,” Damian says without fanfare. Stilted, upset.</p>\n<p>He probably should have elaborated, though, because Dick immediately assumes <em> they’re fighting again </em> and promptly asks, “Oh no, are you guys fighting again?”</p>\n<p>Damian stays quiet, though. His fingers tap on the countertop, and his foot rubs at the stool’s legs. Usually, if Damian and Tim are fighting, or hell, even if anyone is getting on his nerves, Damian is very vocal about it. This is weird.</p>\n<p>And weird is always, <em> always </em> bad.</p>\n<p>Weird is the feeling Dick gets while off-world for a useless Titans mission—like he’s missing something important—finding out it’s Jason’s funeral. It’s Damian dead on the end of a sword, and Bruce gone, gone, gone.</p>\n<p>It’s Tim’s back retreating from the Bat-cave and Red Robin falling from the Wayne building down, down, down. </p>\n<p>It’s a bullet in Blockbuster.</p>\n<p>Dick fights through the sudden haze to look at Damian. If this is as bad as it could be…Tim was just shot twice, and he could be dying. Again. He starts to panic because, holy shit, he could de—.</p>\n<p>“He’s being too kind.”</p>\n<p>His open and overwhelming relief must show on his face because Damian grimaces. </p>\n<p>Dick takes a bit of a breather and refocuses. He knows how to deal with Damian having trouble accepting affection. He raised him for a while there when things got really bad. Dick is surprised at Tim reaching out, but he’s heard from Duke and Jason that the two have been talking about Wayne Enterprises together for the past few days. There’s a curl of something envious in his gut when he realizes that’s what Damian’s probably worried about, but he crushes it down so he can be there for his youngest brother. </p>\n<p>Dick heaves himself onto the counter with an overexaggerated grunt and flings his body to the side to dramatically lay on the granite counter in front of his baby brother. Damian rolls his eyes, but ever so minutely, the kid’s shoulders drop from up around his ears. Mission success. </p>\n<p>‘You know, little D, sometimes being kind is how families act towards one another.”</p>\n<p>“Drake should <em> hate </em> me.” Damian huffs dismissively. </p>\n<p>The reaction is a lot for Dick to parse through in a short amount of time, and Damian says it like it should be a fact. Which, Dick grants him, would make a lot of sense in a different family. There’s something else in Damian’s voice, though—in his coiled posture—and Dick recognizes the grippings of shame like they’re visible and flashing bright red. </p>\n<p>It’s then that Dick actually finds the words, even if he doesn’t know if they’re the right ones, “Hey, look at me, Damian.” He sits up from where he was lying down, lets his feet dangle off the granite, and waits for Damian to meet his eyes. When Damian’s head comes up, Dick puts a hand on his shoulder and ducks his head closer, so they are eye to eye. </p>\n<p>“We don’t get to decide if or when people forgive us,” is how he starts, and Damian’s face crumples just a little before Dick squeezes his shoulder again, signifying that he isn’t quite done. “We also don’t get to stop them when they’re ready to. Tim is already your family, and he already cares about you, just like you care about him.” It’s a statement, but Dick waits for Damian to nod before he says the last part of his impromptu oldest brother speech. Damian does.</p>\n<p>He also swallows past the realization that he wants what Damian’s getting, “If Tim is ready to reach out to you, then don’t you think you should embrace it? It’s a good thing. It’s a really good thing, kid.”</p>\n<p>Damian looks down and closes his eyes tightly, thinking. He nods to himself once, twice, then looks up at Dick and states, “It is. I’m going to try too.”</p>\n<p>Dick ruffles his hair and pulls his youngest brother into a tight hug.</p>\n<p>When Dick gets a text from Tim two weeks later about doing an interview with him that Tim keeps getting pestered to agree to, he doesn’t cry. He’s never been fond of interviews or talk shows, but this is <em> Tim reaching out </em>. So he decided to follow his own damn advice and tells Tim that he’d be there and that he’d love to. He thought it’d feel like a lie, but it doesn’t. He wants to do this with Tim. He wants to try more than anything. </p>\n<p>If this is trying, then he’s ready to give it everything he has.</p>\n<p>\n<span>Dick is sweating profusely through the unflinchingly expensive suit Tim forced him into early that afternoon. He had tried to wear a button-up he bought from the Old Navy sale section last year, and his younger brother leveled a look at him so vicious it nearly made Dick feel bad for Conner and Bart, who he knows wear basically the same clothes every day. </span>\n</p>\n<p>\n<span>He hasn’t worn a suit while not undercover since he was the acting Batman of Gotham City. It’s itchy and constricting, and he can’t move his shoulders or stretch his legs freely. He doesn’t like not being able to move.</span>\n</p>\n<p>\n<span>He’s currently sitting in a plush chair while a makeup team argues over whether or not they should cover the light scar on the left side of his chin. The official story is a skiing accident; the unofficial story could also be called a skiing accident if you count an encounter with Mr. Freeze while Jason was still in green tights as skiing—or an accident for that matter.  </span>\n</p>\n<p>\n<span>They end up covering it with a slightly too-light concealer for his complexion, but the tonal change is soft and probably won’t be picked up on the camera. He lets it go with an easy smile, and he leaves the chair with a nod—heading over to where Tim is already waiting in the wings on Cat Grant’s new television set. Dick stands beside him and watches as Grant introduces herself to the studio audience currently in the seats nearest to the set. She pays them more attention than he expected. He sees her shaking hands and talking animatedly to a young couple.</span>\n</p>\n<p>\n<span>Dick lets out a small breath and turns to Tim, “I didn’t see the makeup and hair team forcing you into a tune-up.”</span>\n</p>\n<p>\n<span>It’s a statement, but it’s also a question. Dick has been getting good at asking questions without actually asking them. Maybe that has to do with too much time around a family that tenses up when sentences end with a question mark. Maybe it’s just something that would have happened anyway.</span>\n</p>\n<p>\n<span>“I did it before I picked you up,” Tim answered, voice low. When Dick quirks an eyebrow towards him, he shifts uncomfortably and stares at the sound tech fixing a mic to his collar, “There’s still a bruise on my cheekbone from the thing with Peter.”</span>\n</p>\n<p>\n<span>Dick stops fidgeting for a moment where he is playing with his sleeves, “Oh?”. There are a couple of layers to Tim’s answer that require some level of parsing through. </span>\n<em>\n<span>Peter</span>\n</em>\n<span> means Jason; they can’t exactly say his name out in public with him being legally dead and all. But the thing with Jason is definitely referring to Tim’s first patrol since being shot, where a mugger managed to elbow him in the cheekbone before Tim knocked him out. He was out with Jason that night as a sort of trial run. Neither Jason nor Damian have let Tim patrol alone since, and Stephanie’s been getting on them for hogging him. Dick had tried to join one night, but Tim ever so politely informed him that having two babysitters was humiliating enough. He didn’t ask again.</span>\n</p>\n<p>\n<span>That was a week ago, though. There shouldn’t still be a bruise. Dick sees Tim glance at him sideways and lets out an annoyed breath.</span>\n</p>\n<p>\n<span>“Come on, not you, too. It’s almost gone. I’m perfectly fine,” and after a second, something colder leaves his mouth, although someone who hasn’t known Tim for nearly a decade wouldn’t pick up on the tonal change or its new iciness, “And I’m perfectly capable of handling my own business.”</span>\n</p>\n<p>\n<span>Ouch. Okay. Maybe that’s fair. </span>\n</p>\n<p>\n<span>Dick’s also been getting good at forcing himself to let things go. He tilts his head in an agreeable nod towards Tim as Cat Grant starts their introduction on the set. He doesn’t think about talking to Tim later about the prolonged bruise or that he might have gone back to patrol too early. He doesn’t think about it because he knows he’ll end up with another case of foot-in-mouth disease as he no doubt says the wrong thing over and over and over again. </span>\n</p>\n<p>\n<span>Dick is so very tired of saying the wrong thing.</span>\n</p>\n<p>\n<span>Instead, he smiles brightly and wide as he and Tim walk out to greet Cat and her extremely excitable studio audience. </span>\n</p>\n<p>\n<span>He takes more time waving to the audience while Tim takes Cat Grant’s hand, practiced and professional. Tim leans in to exchange quick pleasantries. He’s done this before, but Dick doesn’t remember him ever talking about it. This isn’t Tim, but the face he’s wearing seems so natural and at ease. Dick has the sudden, sinking realization that he isn’t an expert on who his brother is anymore, and he doesn’t know this particular act. The kid who hated English but loved storytelling—the one who practiced skateboarding tricks in the Batcave at all hours of the night and said words like “rad” in the same sentence as “obstruction” isn’t here. Neither is the over-eager Robin, whose go-to disguises were the “too cool for school” Alvin Draper and the painfully over-acted Mr. Sarcastic. He’s learned, and he’s grown, and he’s so so different that it splits Dick’s heart in two on live television. He’s lucky it doesn’t show.</span>\n</p>\n<p>\n<span>The realization that Dick hasn’t been given permission to truly know the man his kid-brother is turning into nearly makes him flinch in pain, but he doesn’t have time for it. Tim is turning towards him with Cat Grant on his arm to introduce them, and he looks every bit the person Dick knew he could be from the beginning. That moment is reassuring in a way––Dick feels a sense of pride looking at him––the only regret in his head is that he didn’t get to be there to see any of it happen. </span>\n</p>\n<p>\n<span>Dick smiles and reaches his arm out, and he knows the effect is disarming because Cat’s eyes wander playfully for the cameras, but he also knows it’s not enough to fool a trained vigilante because Tim’s gaze is piercing and heavy. The applause drowns out his small </span>\n<em>\n<span>hello</span>\n</em>\n<span> to Grant and whatever she says back to him, and all three of them take their respective seats. Tim and Dick sit on stylish but uncomfortable armchairs while Cat retreats behind her bright blue desk. </span>\n</p>\n<p>\n<span>The audience quiets on cue, and Cat grins at them kindly, “I know we said hello on the floor, but I just wanted to welcome you both to the set! Tim, it’s always a pleasure” Tim tilts an angled nod towards Cat––it conveys something that might mean </span>\n<em>\n<span>likewise</span>\n</em>\n<span>, “and Richard! I believe this is your first time on the show; I hope we make a good impression.”</span>\n</p>\n<p>\n<span>“The show is amazing!” He says sunnily, gesturing to the set and the audience in a sweeping motion of his hand to rowdy applause, “but this is hardly my first impression of you, Ms. Grant.” </span>\n</p>\n<p>\n<span>She laughs brightly. It’s well practiced, “No, no, it’s not. Do you remember our first meeting? I’m trying to place it.”</span>\n</p>\n<p>\n<span>He nods once, “I must’ve been 10 or so. Bruce had taken me to my first gala.” He has that night ingrained in his memory, Vicky Vale had nearly been thrown out by Bruce, and Alfred brought Dick to bed a full two hours early because he almost cried when someone claimed how lucky he was to be able to leave the circus behind.</span>\n</p>\n<p>\n<span>Cat quickly straightens as she must remember, “Yes, of course! You were so polite.” Dick is glad they remember the night so differently, “I was a new hire for the daily planet. How long ago must that have been?”</span>\n</p>\n<p>\n<span>He knows this dance, as much as he’s avoided it over the last few years. He might be rusty, but he knows the steps, and he chuckles through his reply, “Too long, you’ll make us both feel old just thinking about it.”</span>\n</p>\n<p>\n<span>She laughs too, and Tim smiles good-naturedly. As they all settle down, she puts her hand down on her desk and leans forward, “I did have a set of questions ready for you both, and I promise I will get to them in a moment, but Tim, I have to know how you got another Wayne to be here! It’s been near impossible to get an interview with anyone else for well over a year now, and I’m feeling very special.”</span>\n</p>\n<p>\n<span>At this, Tim’s laugh finally chimes lightly, and from Cat’s answering megawatt smile, Tim’s laugh must be a rare and hard-won occurrence here. Tim answers with a rueful smirk before leaning in conspiratorially, “I’m going to be completely honest with you, Cat… I asked.”</span>\n</p>\n<p>\n<span>“No!”</span>\n</p>\n<p>\n<span>“Yes.”</span>\n</p>\n<p>\n<span>“No!”</span>\n</p>\n<p>\n<span>He only nods with the same smirk.</span>\n</p>\n<p>\n<span>“I cannot believe that’s the angle we should’ve played this whole time,” she stage-whispers to the audience and camera. They play into her cue and laugh.</span>\n</p>\n<p>\n<span>Tim stays leaned forward as he replies to their host’s brief aside, “Our family, despite the local notoriety, are deeply private people, which I know you understand.”</span>\n</p>\n<p>\n<span>“As someone who reported on Bruce and the Wayne’s for the society pages in the past, I can confirm this as fact,” Cat agrees.</span>\n</p>\n<p>\n<span>“Exactly,” Tim states, “but they are amenable, particularly when I annoy them into agreeing to things I want them to do.”</span>\n</p>\n<p>\n<span>“Well, Tim, on behalf of everyone everywhere, I thank you for your service,” she says before turning to Dick with a question, “Does this mean we’ll be seeing more of you and your </span>\n<em>\n<span>other brother</span>\n</em>\n<span> around in the media?”</span>\n</p>\n<p>\n<span>Dick answers readily, this is a question Tim said she would ask, “I’ll try to accompany Tim when my work allows for it, but I know Cassandra, Damian, and Duke don’t have plans to make any public appearances as of yet.” He’s pretty sure she meant Damian with the rather pointed question, but he wanted to cover everyone legally attached to Bruce with his answer. And he wanted her to notice, too.</span>\n</p>\n<p>\n<span>She does. It almost gives her pause, but she’s a professional. She continues, “Tim has mentioned your work in the past. It surprised me at first but sounds very rewarding. A gymnastics coach, correct?”</span>\n</p>\n<p>\n<span>Dick smiles for another moment, and this one is still polished, but it’s real and warm. He loves his job. Both of them. “Yeah, I mostly instruct k-12 kids in group and individual gymnastics and tumbling. It’s the best decision I’ve ever made.”</span>\n</p>\n<p>\n<span>Cat’s grin also turns soft, “…sounds like a noble pursuit, Mr. Grayson. Although, I’m sure Wayne Enterprises feels your loss in the family business.”</span>\n</p>\n<p>\n<span>Tim stiffens next to him, near imperceptible, and Dick’s hackles rise in turn. He tilts his head, and Tim must recognize something in his eye because he tries to give him a signal to stop. He doesn’t, “I’m not sure what you mean,” is the reply he lands on. Dick wants her to explain, but he also doesn’t want Tim to bite his head off later. Yet. </span>\n</p>\n<p>\n<span>“Oh… I only meant as Bruce’s eldest ward—” </span>\n</p>\n<p>\n<span>Tim interrupts, “Son,” he states, “Dick is Bruce’s oldest </span>\n<em>\n<span>son</span>\n</em>\n<span>.” Tim gives a tight smile to Grant and grips Dick’s sleeve in a way that says,</span>\n<em>\n<span> I don’t like that you started this</span>\n</em>\n<span>, but I’m on your team. God, it’s been a long time since Dick felt like he and Tim were on the same team.</span>\n</p>\n<p>\n<span>Cat continues, correcting herself, “right… as Bruce’s eldest </span>\n<em>\n<span>son;</span>\n</em>\n<span> the</span>\n<span> industry certainly expected you to be the Wayne to overtake Bruce’s position as majority shareholder, while Mr. Drake focused on his late parent’s company. Tim, here, surprised everyone when he… acquired his position in the family business… that is, the Wayne one.”</span>\n</p>\n<p>\n<span>Tim is about to open his mouth and smooth the ruffled feathers here. He’s going to tank the subtle disrespect, </span>\n<em>\n<span>Dick can tell</span>\n</em>\n<span>. And Cat </span>\n<em>\n<span>knows</span>\n</em>\n<span> that that’s what’s going to happen because she’s looking at Tim to talk next. Something in Dick roils at that, and he’s angry at her for it. And he doesn’t want to let Tim soothe the situation yet, so he rushes to speak first.</span>\n</p>\n<p>\n<span>“He surprised everyone except Lucius Fox, who hand-picked and trained him for the position.” After a pause, Dick continues and stares at Cat, daring her to disagree with his next statement, “He didn’t surprise his family, either. Tim’s the smartest person I know. Probably the smartest person you know, too.”</span>\n</p>\n<p>\n<span>At that, Tim lets out a quick laugh—he’s done letting Dick control the situation, “He’s exaggerating.” Cat turns her attention to Tim, relieved.</span>\n</p>\n<p>\n<span>He puts his hand on Dick’s shoulder heavily and makes eye contact with Cat while wearing a wry smirk, “and protective, you understand,” he scrunches his nose at her like they’re friends commiserating, “I think it’s an older brother thing, I’m the same way about Damian and Duke.”</span>\n</p>\n<p>\n<span>She understands exactly what Tim is offering at the moment; an out. She doesn’t even think before jumping on it, chuckling with him.</span>\n</p>\n<p>\n<span>“Now you have to tell me about that! The world needs more stories about the Wayne siblings,” she says dramatically to ease the tension in the studio, “we’re</span>\n<em>\n<span> starved.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“Okay, okay, but only if you promise not to laugh too hard at my expense. I’m an embarrassing older brother.”</span>\n</p>\n<p>\n<span>Cat winks and says, “no promises.”</span>\n</p>\n<p>\n<span>The rest of the interview passes easily between Cat and Tim, but the stiffness in Dick stays. He tries his best to be polite and present, but he’s still so angry. Angry that she got away with it, mad that Tim let her, upset that this definitely isn’t the first time. They talk about their siblings for the remainder of their time with Cat, and Tim brings up how proud he is about Damian accepting an internship with the company over the summer. They talk about the intricacies of the intern program until she has to cut them off.</span>\n</p>\n<p>\n<span>When they say goodbye, and the cameras stop rolling, Cat immediately turns to Tim and says, “Thank you.” Low enough so that the audience doesn’t hear, and then turns to Dick and says, “… I’m sorry,” even lower. They both nod, and then it’s over. Situation handled. Finished. Done.</span>\n</p>\n<p>\n<span>Except….</span>\n</p>\n<p>\n<em>\n<span>Tim is livid.</span>\n</em>\n</p>\n<p>\n<span>He nearly makes it two blocks from the studio in the car before starting the argument, “What did I say just before we went on set?”</span>\n</p>\n<p>\n<span>Dick answers, cringing slightly, “…that you can handle your own business.”</span>\n</p>\n<p>\n<span>Tim huffs like he’s surprised Dick answered but is annoyed all the same, “and what did you do?”</span>\n</p>\n<p>\n<span>And Dick seems to decide then and there that this isn’t the conversation he wants to be having, “No. No, I’m not apologizing for standing up for you. That’s never going to happen, Tim.”</span>\n</p>\n<p>\n<span>Tim reels, this isn’t part of the plan, but he’s still so angry at how it turned out. Dick has no right to meddle in his business. He’s silent for a long while, thinking in circles about what matters more to him—sticking to the plan or making sure Dick doesn’t get an opportunity to play savior when Tim doesn’t need it. In a perfect world, Tim could get Dick to agree to continue going to these, but to also chill the fuck out and let Tim handle himself. It’s not a perfect world. </span>\n</p>\n<p>\n<span>Dick interrupts his speeding train of thought as Tim parks at the Manor, “You’re not doing those alone again. Me or Duke or Cass or Damian—or hell, Bruce. We are going to these with you from now on.”</span>\n</p>\n<p>\n<span>Dick’s not going to let this go, and it’s even a good thing to have the promise of more Wayne’s in the media—but…. Tim doesn’t like what Dick’s insinuating.</span>\n</p>\n<p>\n<span>“I don’t </span>\n<em>\n<span>need</span>\n</em>\n<span> you to </span>\n<em>\n<span>save</span>\n</em>\n<span> me, Dick,” Tim spits.</span>\n</p>\n<p>\n<span>Dick whirls on him from where he was facing the house, “It’s not about what you need—”</span>\n</p>\n<p>\n<span>Tim narrows his eyes, “So you admit, it’s </span>\n<em>\n<span>not</span>\n</em>\n<span> about me.”</span>\n</p>\n<p>\n<span>Dick makes an incredulous sound, “Of course, it’s about you, Tim. I know you don’t need defending, </span>\n<em>\n<span>but you were just going to let her say that shit</span>\n</em>\n<span>. How is that fair to you? How am I supposed to let it happen?”</span>\n</p>\n<p>\n<span>“<em>You</em> don’t get to decide how I handle my problems, Dick!”</span>\n</p>\n<p>\n<span>“I do get to decide how I react to people saying that to </span>\n<em>\n<span>my brother</span>\n</em>\n<span>, though!” Dick breathes deeply, his eyes intense, and he looks at Tim in the face from where he’s bodily turned to face the younger man, “You’re not going to another interview alone.”</span>\n</p>\n<p>\n<span>Tim stares just as heatedly before the fight leaves him all at once. He gets a lot out of this decision; it’s good for the plan. He doesn’t have to like every part of it, though. </span>\n</p>\n<p>\n<span>“It’s not as bad as you seem to think. But fine. Do what you think you need to. Now get out of my car.”</span>\n</p>\n<p>\n<span>A flash of hurt splays itself across Dick’s face before he gets out and leaves, but it doesn’t feel like a victory.</span>\n</p>\n<p>\n<span>Dick doesn’t look back, and Tim doesn’t know why he wants him to so badly. He wants Dick to open the driver’s side door and demand to hug and forgive one another. He wants Dick to force him inside the Manor for dinner, to make him mad, to yell, scream, cry, and fight. </span>\n<em>\n<span>He wants Dick to fight for him even if it makes him angry.</span>\n</em>\n</p>\n<p>\n<span>Instead, Tim rubs a hand down his face, puts the car into drive, and speeds away toward the nest.</span>\n</p>\n<p>\n<span>Tim was right. It’s not as bad as Dick seemed to think. It was worse. Either Tim’s priorities are so turned around that he actually thinks it’s not a big deal, or he knew exactly how bad it was and undersold it in the hopes Dick wouldn’t look into it. Dick doesn’t know what he would rather it be, so he doesn’t think about it beyond planning to fix it.</span>\n</p>\n<p>\n<span>Dick’s been watching and reading interviews since Tim dropped him off, even listening to podcasts that mention the young shareholder. Nearly every one of them includes passive aggressive slights against Tim’s worth, experience, or intelligence. In the articles and soundbites that Tim isn’t present for, they don’t even try to hide it in subtlety. </span>\n</p>\n<p>\n<span>Dick compiles it and shows it to Bruce after patrol that day. He ends by explaining what happened on Grant’s show, and Bruce agrees with him. He goes to Cass and Duke next, and they both say they want to be part of the plan to not let Tim do these alone anymore.</span>\n</p>\n<p>\n<span>Damian is different. He <em>demands</em> to be part of the plan before Dick even gets to him.</span>\n</p>\n<p>\n<span>Dick was planning to talk to Jason first to ask if he thought it would be a good idea to put Damian and Tim in an interview together. The youngest Wayne hears of the plan from Cassandra. He interrupts Dick and Jason in the middle of their conversation, both Jason and Dick leaning towards not putting Damian in interviews with Tim just yet, sourcing the younger boy’s temperament and their history.</span>\n</p>\n<p>\n<span>Damian had information they didn’t, though. When they try to explain why Damian going to the interviews and events is a bad idea, he interrupts them harshly and claims, “It’s not just in interviews.”</span>\n</p>\n<p>\n<span>Both Dick and Jason narrow their eyes and turn to him, listening. Damian continues.</span>\n</p>\n<p>\n<span>“It’s in board meetings, too. Arrogant imbeciles casually disregard him and his authority and he just takes it. He doesn’t defend himself because he thinks that from their perspective, ‘they have a point.’” Damian is fuming, talking at them with his hands and pacing. “He gave me the minutes to the contract meeting I assisted with, and we argued about it over the phone. He told me that </span>\n<em>\n<span>I’d learn to deal with it</span>\n</em>\n<span>. That it happened to father, too. But it’s </span>\n<em>\n<span>different</span>\n</em>\n<span>. He doesn’t get that it’s different. And you’re both going to let me </span>\n<em>\n<span>help</span>\n</em>\n<span>.”</span>\n</p>\n<p>\n<span>Dick just says, “okay.” He stops Damian mid-pace, and he brings him into a hug on Jason’s weirdly comfortable couch. He looks at Jason over Damian’s head, and Jason nods.</span>\n</p>\n<p>\n<span>Dick and Damian eventually leave, Damian ditched school to interrupt them, and Dick takes him to the second half of his classes. Damian tried to get out of it by looking to Jason for help, but Jason’s almost a responsible adult now. He sends a kid to school nearly every day, so Damian really shouldn’t have expected an out from him. </span>\n</p>\n<p>\n<span>Jason sits at his counter and looks at a Batman backpack. Lian and Roy are in Star visiting the Queen’s, but her bag is here on the counter, and Jason is staring at the keychains dangling from the zipper. He breathes in deeply. He still can’t pick her up from school because he’s technically dead. He was going to ask Tim and Barbara to help him craft a new identity for things like that. He was going to ask to be someone new to avoid precisely the kind of bullshit he’s thinking about doing right now. It’s so stupid. </span>\n<em>\n<span>He’s being so stupid.</span>\n</em>\n<span> But he watched the videos Dick sent just like the rest of the bats, and he’s </span>\n<em>\n<span>stuck</span>\n</em>\n<span> thinking, </span>\n<em>\n<span>I can’t even help.</span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>He </span>\n<em>\n<span>knew</span>\n</em>\n<span> he was going to ask for help being no longer legally dead; he was </span>\n<em>\n<span>prepared</span>\n</em>\n<span> to deal with that. He just has to get used to the fact he’s going to ask to come back as himself. </span>\n</p>\n<p>Damian Wayne starting an internship at Wayne Enterprises in mid-June is a big deal in the business and financial circles, especially on the east coast. Tim Drake being the teen's direct point of contact makes it an even bigger deal—a controversial one, if you watch the right programming. Much of the upper crust is divided on the topic. Most of those involved with WE through employment or trade tow the company line. They talk about bright young men taking an interest and making real, effective change. They tout the statistics that back them up, pointing to higher stocks, better public opinion, and their employee satisfaction surveys being the highest in the company's history. They say that if Tim sees something in Damian, there's something to see.</p>\n<p>That is to say, most people involved in Wayne Enterprises understand it to be unwise to directly question CEO Lucius Fox, Majority Shareholder Tim Drake, or Bruce Wayne himself. All three of them regularly speak about how exciting Damian's position as an intern will be over the summer. </p>\n<p>Still, there are other people who do not seem to feel that pressure. Many competing members of other companies call the move the actions of a failing company or an excuse for Bruce Wayne to get his kids out of the mansion for the summer. They view the act as yet another case of Bruce Wayne's dependence on nepotism for his children to gain any form of success. It seems to shine a light on Tim's advance to power; people from all over the media nitpick his decisions from the very beginning to this most current blunder. </p>\n<p>Suffice it to say; the opinion is split relatively evenly in the month leading up to Damian's first day. Still, the coverage is vicious when specific networks decide on a negative stance. The debate even makes it into more mainstream news reports, where a lack of knowledge seems to breed suspicion on whether or not Tim Drake could possibly be an effective controlling shareholder while so young, and just what he thinks he's doing bringing another teenager into the mix. The story becomes a hot topic throughout the month of June, well past the time when both Damian and Tim have proven the decision to be a sound and profitable one. The work's relatively quiet and tedious nature seems to bolster people into sharing their unfounded thoughts on the topic and asking Damian and Tim invasive and offensive questions whenever possible.</p>\n<p>It's the story of the summer.</p>\n<p>Well….</p>\n<p>It's the story of the summer until July 11th, the day Jason Todd returns to the land of the living. Publically, of course.</p>\n<p>After that happens, no one seems interested in asking Tim if he thinks he deserves to hold a position in a major company despite his glaring lack of education. They're busy being flipped off by the newly not-dead Jason Peter Todd-Wayne, and asking Bruce if he thinks there's a possibility that this young man could be an imposter. Granted, those reporters don't get very friendly responses from anyone in the family as they ask questions during the many press conferences following the reintroduction of Jason to the Wayne Family media fold. </p>\n<p>The entire timeline is meticulously planned by Bruce and Dick—Jason approving or denying the steps when presented to him. They designed the coverage to take the heat off Tim and Damian and the negative press that seemed to generate around the start of the summer. The season passes quickly after the first announcement, and the whirlwind unfolds precisely as predicted.</p>\n<p>The entire affair is masterfully executed. Tim applauds them; he does. He just wishes that it would stop feeling so pointedly <em>for him </em>.</p>\n<p>He knows that it's not, is the thing.</p>\n<p>Logically, he gets it. It's about the family. It's about <em>the Waynes</em>. And Damian was getting nearly as much negative coverage as Tim, so he very logically understands why the family is working so hard to curb the attention and help. He's a little confused as to why Jason is so adamant about helping, but he thinks it's a fantastic development for further integrating him into the family. It's incredible progress for him and Bruce, too. Tim is very proud of both of them. </p>\n<p>All those feelings don't stop the <em>help</em> from <em>hurting </em>so poignantly, though. It might actually make it worse.</p>\n<p>Tim wants it to be for him. It's okay that it's not. It's actually better that way. He's been getting complacent over the summer. He's enjoying too much without purpose or focus on the plan. By the end of August, 5 months have passed since the beginning of Tim's plot. That only leaves 13 left to get everything in order. He needs to get back to work, and he needs to do it soon. Tim argues with himself for a long while about his own timeline before he finally elects that he deserves to enjoy the last days of the summer. He wants to remember this summer fondly. He's earned the right to have good memories of these people and this city. Tim has given up so much. He loves Gotham, and he loves them, and he wants so badly to deserve this. </p>\n<p>It kind of sucks that he has to convince himself of that every day. </p>\n<p>Tim devises a schedule for the last week of August to squeeze maximum enjoyment out of the time before he buckles down again. He spends the days working with Damian, covering press with Dick and Jason, and he tries to spend as much time as possible with Steph and Cass.</p>\n<p>It's good. It's<em> really</em> good, but the last day of August is still bittersweet.</p>\n<p>Tim wakes up from actual sleep in the morning. Steph had forced him and Cass onto one of the couches in one of the family rooms to watch a movie marathon that neither of them actually agreed to. But they smile at each other on either end of the plush couch as Stephanie loads up the first Fast and Furious film. Stephanie acts out every explosion with what can only be described as a dedication to a variety of mouth sounds. He and Cass tackle her to the couch around the middle of Too Fast, Too Furious, and she laughs so hard she snorts violently, promising to stop. Tim wakes up to Cass' foot in his face and Stephanie's elbow digging into his back, and he smiles for a long, long time before extracting himself from his sister and best friend. </p>\n<p>Cass wakes up when he stands and she grabs his wrist—her grip is light but secure. He looks down at her, and she tilts her head. She's asking if he's okay, and he doesn't even have to lie to her when he nods silently. She lets him go with a squeeze to his wrist and repositions Stephanie's still sleeping form to lay across her more comfortably than before. Tim catches her eyes again and raises his brows teasingly, and she signs at him to <em>shut up, little brother</em>. They smile at each other brightly, and Tim winks at her before he turns to leave for breakfast—quickly, so he can avoid Cass throwing a pillow at him if he can. </p>\n<p>Damian is waiting for him at the kitchen table, and Tim's decidedly not in his head about how much he'll miss this. He hasn't had breakfast with Damian every day, but he has eaten with his younger brother frequently, especially after Jason's return to the land of the living—legally speaking. The whole family has been more or less using the manor as a home base while the media swarms the Wayne's and those associated with them. The silence isn't as calm as it usually is, and Tim can tell Damian wants to break it. He waits for the kid to be ready and eats his waffle in the meantime. The space is charged, but he still finds himself at peace with being patient; Tim can wait until Damian finds the words.</p>\n<p>\"Drake…\" Tim looks up, fork full of strawberry syrup dipped waffle, and he nods for Damian to continue before shoving his food in his mouth.</p>\n<p>Damian, used to Tim's abysmal eating habits, still makes a softly disgusted face at the older boy's antics before responding, \"I believe I am… anxious. For the meeting this afternoon.\"</p>\n<p>Tim swallows. His brows pinch together minutely. He speaks without hesitation, \"Your presentation is brilliant. The board is going to be blown away, and you've performed perfectly when we've practiced.\" He stabs another piece of waffle, \"There's nothing to worry about, kid.\"</p>\n<p>Damian huffs, \"All the practices have only been in front of you. There's no reason to be anxious when it's just you.\"</p>\n<p>Tim chews his waffle for a long time, thinking. He's letting Damian's worries sink in, so he might be able to assuage some of his nerves. Eventually, he looks across the island where they've had breakfast together so many times over the summer and says, \"I understand.\"</p>\n<p>Damian lets out his signature sound of discontent, \"TT. You do not,\" he insists, \"You do this all the time, and I've never seen you so much as sweat this entire summer.\"</p>\n<p>A slight pout appears on Tim's face, and he braces himself to tell Damian a truth. He doesn't like doing this much, but he's capable of putting his own discomfort aside to be of service. \"You know… I've always been calmer when I have a plan to fall back on. I like to follow steps. Do you think it might help you in the meeting if we put together a small outline, maybe a few contingencies?\"</p>\n<p>Damian really looks at Tim for a moment, and it makes Tim feel like a real physical human being—like he can't be seen through or ignored. It's quite the experience for a child who felt like his skin was glass growing up. The kid's all Robin when he presses, \"We can have contingencies?\"</p>\n<p>\"We can make as many contingencies as you need us to.\"</p>\n<p>As if he's been thinking about it for some time, Damian quickly asks, \"What if I start the presentation and the slide deck fails? The charts we made help with visualization.\"</p>\n<p>\"I can clear my morning to print out the charts. We'll have them and a stand in my office as a backup.\"</p>\n<p>Damian stares for a moment and continues, \"What if someone interrupts me before the question portion of the presentation?\"</p>\n<p>Tim doesn't waver, \"I will kindly remind them to hold their questions, and you will continue as we planned.\"</p>\n<p>The kid nods, \"What if I forget what to say?\"</p>\n<p>It's hard to tell if this is something Tim can find humor in or if this is something Damian needs support with, so Tim settles for smirking before he answers, \"you will take the notecards we wrote out of your suit pocket, and you will use them as a guide. Many board members still use notecards for presentations, and it will not reflect poorly on you.\"</p>\n<p>Damian bites his lip, \"What if there's an Arkham breakout?\" </p>\n<p>And Tim almost laughs because <em>now </em>Damian is <em>reaching</em>, but he catches himself—this is Gotham, after all. He looks at Damian across the table and says, \"As per company protocol, we will shelter in place in the building. You and I will shelter in my office, where Tam has already stored extra suits for emergencies in the en-suite bathroom. The meeting will be rescheduled for the next available business day.\" He tilts his head and adds, \"Damian, <em>you're going to be amazing. </em>I know it.\"</p>\n<p>\"You know it?\" </p>\n<p>A genuine smile makes its way onto Tim's face, splitting it in two, \"Sometimes I just know things. It's older brother magic.\"</p>\n<p>Damian stares again, and he's purposefully not trying to hide his emotions. It's a new development that Tim cherishes when he gets to have it, and it makes talking to and teaching Damian easier than it was before. Damian's worried, but he looks determined, too; he nods. He's ready.</p>\n<p>\"Okay. Okay, let's go.\"</p>\n<p>\"Okay,\" Tim replies, and just to get Damian back to himself, Tim ruffles the brat's hair to get him to shout indignantly.</p>\n<p>He does. And if Tim wasn't fast enough in racing to the car, Damian might've gotten a bite in. As it happens, they make it to the Porsche together, and Damian collects himself after tackling his older brother bodily. He straightens his suit before opening the passenger door and shooting Tim a deadly look as he gets inside.</p>\n<p>•</p>\n<p>Damian and Tim arrive in the boardroom early. </p>\n<p>The room is not quiet. Tim types on his laptop while Damian's feet clap to the timber of his quick pacing. Damian is finishing his last run-through, continually pestering Tim to ask if there is a better, more effective way to say some of his points. Tim denies it every time, stating that Damian's words are <em>completely fine </em>and <em>the best way to get the point across</em>, and <em>Damian, please, it's perfect, let it go. </em></p>\n<p>By the time the rest of the board arrives, they are both sitting together, ensuring the presentation's slide deck runs on the screen at the head of the room. It runs just as it should, and Tim gives Damian a mocking grin. Damian knocks on his shoulder before standing and grabbing the remote to start the presentation on the summer intern project: a proposed charity budget and fundraising schedule that includes longstanding Wayne foundation galas as well as new events based around Gotham schools and shelters. Tim has seen the project hundreds of times over the summer, and every time Damian updated it, Tim became more and more impressed. Tim himself proposed the budget the year before, and he's so proud of what Damian was able to do with it. He expects the board meeting to go well, which is why he's grinning madly when Damian starts.</p>\n<p>\"It's good to see everyone here for such a deserving topic of discussion. The Wayne Enterprises charity branch, The Martha Wayne Foundation, is lauded as one of Gotham's largest and most impactful charitable bodies. Started by Bruce Wayne in his earliest years of ownership, the foundation has been a source of good that gave to Gotham in its many hours of need. I'm here to propose the upcoming fiscal year's charitable budget in its entirety. We'll take questions and proposed changes at the end of the meeting.\"</p>\n<p>\"We'll be beginning with the reserve budget for rebuilding Gotham's infrastructure after a possible rogue attack. The budget here will be–\"</p>\n<p>Most of the board is politely intrigued; the charity budget is always one of the year's more laid-back and exciting meetings. Most of the board are, in fact, Gothamites who actively want to improve the city they love and live in. Most of the board is also not Aiden Gauthiery, whose meager 8% of WE shares seems to compel him to believe himself untouchable. It's him who decides to interrupt.</p>\n<p>Gauthiery clears his throat and looks around incredulously at the other board members, \"I'm sorry… Is no one else offended by this? We can't be seriously considering listening to <em>a toddler </em>talk about a multi-billion dollar company's charity budget.\" The man even turns to Tim and says, \"This has to be a joke, right? It's a miracle we tolerate a high school dropout being here, but this,\" he waves dismissively at a frozen Damian, \"this is too much, and somebody has to say it.\"</p>\n<p>Tim narrows his eyes at Aiden Gauthiery for the very first time, and Aiden seems to delight in finally getting a reaction out of him. After all the time he spent sniping at the young man from the sidelines, it must be nice to see his work pay off. Tim spares a single glance at Damian. The younger Wayne is good at hiding it, he wouldn't be Robin if he wasn't, but Tim knows how to read him now. Damian isn't angry. He isn't furious or seething like Tim would have expected.</p>\n<p>He's upset. </p>\n<p>For a moment, the only thing Tim can see is red.</p>\n<p>It only takes a second from the end of Gauthiery's impassioned interruption for Tim to turn back to the man and smile with all his teeth. The board doesn't get to see this smile much, as it's usually reserved for villains like Dent or Cobblepot. For the people Tim fights against, he smiles like a shark. He is pleased that it unsettles Aiden Gauthiery as much as it does. </p>\n<p>Tim stands and perches himself on the conference table. He leans for the meeting phone that sits unused in the middle of the conference room's table. He doesn't break eye contact with Aiden Gauthiery as he dials a phone number and places the receiver in the crook of his shoulder, leaning back to casually rest on his hands. The room exchanges confused glances with one another as the line rings. A few of them sit straighter in their seats. Rina pauses in taking the meeting notes and looks at Tim in elated shock. Lucius tilts his head but smirks minutely at his chosen protege.</p>\n<p>Someone picks up on the other end, and Tim's eyes sparkle as he cheerily greets, \"Mrs. Gauthiery, it's Tim!\" Aiden's face slams into shock, and Tim revels in it. He continues, \"I know, I know, it <em>has </em>been far too long… yes, yes. I actually wanted to talk business for a moment…. Uh-huh. It's amazing how easily you can read my mind, Diane.\"</p>\n<p>Tim has the entire room's undivided attention, \"I know when we talked about your proposal at the last gala, I denied your request, but I seem to have had a recent change of heart.\" </p>\n<p>Aiden's face is growing red, and he tries to interrupt, but Tim stops him with a look and a venomous, \"I am busy, and you will wait.\" Tim turns his head to the ceiling and answers something on the other line, \"Diane, I'm sorry, someone tried to interrupt me on my end….\" </p>\n<p>Tim lets out a thready laugh, \"Thank you. And yes, I know it's quite sudden. However, since I'm aware of the inconvenience, I'd like to offer you double what we had discussed last year, but only if we can make a decision right now….\"</p>\n<p>Tim is silent for nearly a minute before, \"Yes, absolutely, my people can manage that for you immediately. I'll put you through to my assistant so you can discuss the transfer…. You flatter me, Diane. I'd love to get together sometime soon. Ms. Fox handles my schedule as well, so she'll help you plan something enjoyable, my treat… bye, now.\"</p>\n<p>Tim turns back to Aiden's shaking shoulders and red face as he puts the phone back in its cradle. \"I want you to know that you have had power here in this boardroom because for the last year, I have allowed you to have power. <em>I'm no longer allowing it.</em> Your wife, the actual owner of 8% of <em>my company</em>, has just sold all her shares to me, and she's finalizing the deal with my assistant as we speak. You have no power, but you do have a choice. Option number one, you walk out of this office on your own and exit my building willingly… or number two, security will escort you out,\" as Tim briefly pauses, the meeting room door opens. Two guards step inside, \"I took the liberty of signaling for them while on the phone with your wife to help you make your decision. Thank you for your time with the company Mr. Gauthiery.\" </p>\n<p>Amanda Randall, one of Tim's favorite board members, snorts out loud. Lucius smiles at Tim and mouths, <em>very dramatic</em>…. Others watch with amused awe, but they are only very few. The rest of the gathered group are either deeply shocked or deeply scared, and Tim can deal with both of those reactions later. Only one response matters right now, and Tim hopes he makes the right decision. </p>\n<p>Aiden Gauthiery storms out of the room. After a second of silence, Tim scoots back to his seat and signals to the security detail to follow the man out. Tim then turns to Damian, standing in front of his presentation, and says, \"I apologize deeply for the interruption, Mr. Wayne; please continue with your presentation. I know the board has been looking forward to seeing the results of this year's charity budget proposal.\" </p>\n<p>Shocked still like much of the room around him, Damian takes a breath and collects himself.</p>\n<p>The boy continues. He performs flawlessly and answers a large portion of questions at the meetings close, even staying after to say goodbye to some of the board as it's his last day as an intern for the summer. </p>\n<p>The budget is unanimously approved. </p>\n<p>The car ride home is silent. As they walk up the steps to the manor, Damian stops Tim and looks fiercely at the taller boy's chest. Tim almost asks what's wrong, but his thoughts are cut short when he finds two sudden armfuls of a child assassin barreling into him. It's over before Tim can hug back, and Damian slips into the manor faster than Tim can compute the interaction in his brain. He stands still for a long time after and has the first real moment of doubt in everything he set out to do those 5 short months ago. On the steps of Wayne Manor, Tim thinks to himself,<em> I don't know if I can give this up.</em></p>\n<p>It plays on repeat in his mind until he can smother it without remorse. <em>He has a plan</em>. He has a plan for a reason, and all he has to do is follow it through. He stops himself from entertaining any further useless musings and walks inside. He promised Steph and Cass he'd patrol with them tonight. It's the last night of August, and he's supposed to be enjoying himself.</p>\n<p>•</p>\n<p>Three kevlar-clad vigilantes lay on a flat rooftop near the Bowery. Two of them breathe heavily from racing across rooftops in a game they've played since they were far too young to be who they chose to be. They're still those people now, for better or worse. Their third participant is leaning back on her elbows, cowl pushed back, and staring at her two companions with a small smile. </p>\n<p>Still catching her breath, Stephanie breaks the silence, \"We need to do this more, boy wonder. Tell your keepers to give the rest of us more Tim-time.\"</p>\n<p>Tim laughs, loud and high, \"Trust me, if I could get them to let me patrol by myself, I would.\"</p>\n<p>Steph rolls over the concrete roof and onto Tim's side. She teases, \"Don't worry, Cass and I will protect you from big bad affectionate family members.\"</p>\n<p>Tim rolls his eyes and replies through a grunt, trying to push Spoiler off his left side, \"They've been weird since the zoo,\" Tim complains.</p>\n<p>Stephanie throws him a look like <em>he's</em> being difficult and not the rest of the bat menagerie. She exclaims, \"Oh! You mean they've been weird since you got a concussion and were shot twice by a shadow lackey.\"</p>\n<p>\"Did you just call a League Assassin a shadow lackey?\" Tim tries to change the topic.</p>\n<p>Cass stops him short, \"Not okay. We want to know when something's wrong.\" She looks at him, and he knows she wants to know about this danger with the League. It's something he should've done a long time ago, and if he has to give an update, it might as well be to Cass and Steph. They're the people he wanted to tell, anyway. Despite his own baggage about burdening other people, he's always been able to find solace in his best friend and his sister. </p>\n<p>He takes a deep breath, reaches out for Steph's hand, and softly speaks, \"He calls me<em> Detective</em>. Like it's some kind of honor.\"</p>\n<p>Steph grips his hand tightly back and loudly proclaims, \"What an asshole.\" It's all they need to say. They understand that Ra's isn't going to let it go, but they also know the danger isn't immediate for now. Tim knows that they understand and know that they'll try and protect him when the time comes. It's nice to be with them. And it's nice not to need as many words. Cass rolls to Stephanie's other side, and they stay there looking at the few stars that have fought their way through Gotham's light pollution. </p>\n<p>The group lays together for a while, talking about things that mean nothing, some things that mean something, and some things in between. They ask about his team, about Conner, and he teases them about their newly started relationship. They laugh together, and Tim feels at home on a Gotham rooftop for the first time in a long while. </p>\n<p>They get ready to head to the Clocktower for the night, and he prepares to head to the nest. Cass hugs him tightly before holding him at arm's length. She says, \"Fridays are for Steph and me. We'll patrol and hang out. I'll deal with brothers.\"</p>\n<p>Tim nods dutifully and makes a mental note to shift his schedule for them.</p>\n<p>When he swings back to his own place it’s so very quiet. He sits in his nest, and he misses the noise. He works through the night to try and drown out the silence until the morning. </p>\n<p>\n<span>Alfred left the medbay about 10 minutes ago to ensure everyone is ready for when Tim wakes up in the next few hours. He will also be making brunch, which is a silver lining. Tim's favorite. Bruce has a sinking feeling that he's somehow managed to fuck up unforgivably with his third son. There's just so much he's left unspoken for too long—that he thought Tim knew—that Bruce assumed was intrinsic. Bruce is terrified of the consequences of his own willful ignorance, and he sits alone in his chair as he recontextualizes the last year and a half in his head. And then, because he hates himself just a little, he goes ahead and examines the years before, too. It's just him, Tim's unconscious body, the crushing weight of failure, and the elephant in the room.</span>\n</p>\n<p>\n<span>The elephant in the room is actually an alien in the room. He arrived 5 minutes ago, but he hasn't interrupted Bruce's vigil beside Tim, head resting on the cot beside his son's hip as the boy breathes in a sleep-soft rhythm. The alien in the room's name is Clark. Or Kal. Or whatever Metropolis is calling him on any given day. Bruce just chalks him up as a distraction for the moment and files him away to deal with when he finally gets his thoughts in order. Clark can wait. The League can wait. </span>\n<em>\n<span>The world</span>\n</em>\n<span> can fucking </span>\n<em>\n<span>wait.</span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>Clark is patient with him. Superman has always been virtuous in that way. He doesn't quite understand what's happening, but he's pretty sure he has a piece of the puzzle. It's tucked into his palm, folded exactly four times by Lois when the Kents had dinner earlier that night, and Kon gave them the unassuming piece of paper.</span>\n</p>\n<p>\n<span>It's a resume.</span>\n</p>\n<p>\n<span>Kon had been weird the entire week. Clark is still getting used to reading his eldest son's emotions. They may share nearly the same face, but Connor uses it so differently than Clark. Often, Clark will wonder if that would be different if he had been there for Kon from the start. Guilt edges many of Clark's interactions with his first kid, but there is hope in learning how to read him. It shows that they're working well together and that time is healing them. Connor doesn't often show his nerves, but he's been twitchy since last weekend, and he prefaced tonight's late dinner(there was a large fire in Southern France) with needing to speak to Clark and Lois after for a moment. </span>\n</p>\n<p>\n<span>While they eat, Connor is clearly uncomfortable, and dinner becomes an awkward and unpleasant affair. Jon attempts to lighten the mood, but soon enough, he finishes his own dinner and escapes to his room with a slight nod to his brother. Lois and Clark wait for their son to be ready. Eventually, Kon looks up from his slightly scuffed blue plate and says, \"So, I'm supposed to give you something from Tim.\"</span>\n</p>\n<p>\n<span>Lois brightens measurably beside Clark, but Clark stays confused. His wife reaches her hand across the table and says, \"How is Tim? It's been so long since we've had him over.\" </span>\n</p>\n<p>\n<span>\"Yeah… he's been kind of busy for a while,\" Kon replies. He's still nervous, and Clark is getting the feeling that this conversation might not be as fun as deciding to invite his kid's friend over for dinner. Before he can ask a question, Connor continues, \"um, so… it's actually more like a Red Robin thing.\"</span>\n</p>\n<p>\n<span>Those words resonate, and Clark can hear the </span>\n<em>\n<span>Superman</span>\n</em>\n<span> in his own voice when he quickly asks, \"Is something wrong?\" with an urgency that he's adopted from many years in the life.</span>\n</p>\n<p>\n<span>Kon quickly startles and shakes his head, \"No! I mean…. Okay. It's not an emergency.\"</span>\n</p>\n<p>\n<span>Clark would say something reassuring, but he wants Connor to say everything he needs to. So he just nods and watches as Connor slumps his shoulders to continue, \"I feel kind of like I'm betraying Tim by not thinking this is a good thing, but I've been worried about everything for a while. I promised not to say anything before he was ready, and it's been really hard not to talk to you guys about this because it's a big deal, and I want to tell you guys things that are big, you know. I've been trying to tell him for like a whole year that maybe he should think about it more. But I also don't want to overstep because </span>\n<em>\n<span>that would be weird</span>\n</em>\n<span>, and people shouldn't overstep with their boyfriend's lives like that because even though we're in a relationship, he should get to make his own decisions. But it's just that I think maybe this one is going to really hurt him, right? And I don't really know where to start, but I promised I'd give this to you, so here.\" Kon heaves as he holds out a crisp black folder. </span>\n</p>\n<p>\n<span>Clark has been stunned for at least half of Connor's outburst because—\"You and Tim are dating?\"</span>\n</p>\n<p>\n<span>Connor's eyebrows furrow and Lois sighs pointedly, \"Conner and Tim have been dating for two years, Clark.\" She takes the folder from Kon's hand, \"Thank you, honey; whatever's wrong, we'll figure it out.\" </span>\n</p>\n<p>\n<span>Lois carefully opens the folder and inhales sharply before gripping Clark's bicep, removing the lone piece of paper, and holding it between them to read. Clark gives the document his full attention while Lois looks back at a shifting and nervous Connor. </span>\n</p>\n<p>\n<span>\"I think it's a bad idea,\" is what he eventually replies to Lois' silent probing, \"But… if he needs a place to go, I'd really appreciate him being welcome here.\"</span>\n</p>\n<p>\n<span>Lois, quick as she's always been, \"Tim will always be welcome here, Connor.\" She is firm in her reply, and Connor's shoulders loosen slightly. </span>\n</p>\n<p>\n<span>Clark looks up then, too, \"Of course,\" and then, after a pause, \"but I think I have to talk to Bruce, right? I have the feeling he doesn't know about this.\"</span>\n</p>\n<p>\n<span>\"I think Tim is talking to him after patrol about everything,\" There's a long pause before, \"Dad?\"</span>\n</p>\n<p>\n<span>Clark freezes while looking at Connor, who never calls him that, before releasing a barely audible, \"yes, son?\"</span>\n</p>\n<p>\n<span>\"He sent out a lot of those,\" Conner says it cautiously, guiltily, like it's something he had been trying to stop but didn't know how to, or if he even had the right. Clark just wants to make it better. </span>\n</p>\n<p>\n<span>He tries his best to sound reassuring, \"I'll talk to Bruce when he gets in from patrol in the morning.\"</span>\n</p>\n<p>\n<span>Connor nods and then takes a deep breath, \"I don't think they know how to talk to him. Like, really talk. Tim needs things spelled out when it comes to personal stuff. I had to make him an in-depth pros and cons list before he even considered holding my hand, Clark. I'm pretty sure Tim doesn't think they're family.\"</span>\n</p>\n<p>\n<span>Kon looks heartbroken, and the kitchen is silent. He seems unsure of his next move before Lois snatches him into a deep hug. It settles the restlessness they both saw in their son all week. They don't have much power in the situation, but they can give information to those who do. </span>\n</p>\n<p>\n<span>And they can be a safety net for if things go wrong or if what Connor says is true; if things go according to plan.</span>\n</p>\n<p>\n<span>Bruce eventually picks his head up to look at Clark defeatedly, and Clark takes in his disheveled friend. Before arriving, Clark had thought of a couple ways he could casually bring up the fact that Bruce's son sent him a resume, applying to fight crime in Metropolis beside the Superman family. It's a good resume, and Clark definitely doesn't think about the skills Red Robin listed in it, especially not \"Immunity to Kryptonite.\" He doesn't think about how valuable Tim could be because Bruce is </span>\n<em>\n<span>right there</span>\n</em>\n<span>, and Clark needs to try and get </span>\n<em>\n<span>The Batman</span>\n</em>\n<span> to talk about his </span>\n<em>\n<span>emotions</span>\n</em>\n<span>. The other stuff doesn't matter. </span>\n</p>\n<p>\n<span>In any case, he practiced at least three ways to ease into the topic on the flight to Gotham, but when he was actually confronted with his friend, he decided that absolutely none of those options would work at all. Instead, he decides to rip the band-aid off the second Bruce opens his mouth and says, \"Clark,\" clearly requesting him to explain his presence. After a millisecond of hesitation, Clark silently hands him the folded piece of paper. He wants Bruce to take it in thoroughly before they speak. </span>\n</p>\n<p>\n<span>Clark Kent is an investigative reporter. He can predict a great many things due to years of experience in his chosen field. Now, he expects a great deal of reactions from his friend are possible. </span>\n</p>\n<p>\n<span>What he doesn't expect is a throaty burst of wet laughter. He doesn't expect the choked-out sob afterward, either. It sounds violent and shredding, and Clark Kent can't do anything. He's Superman. </span>\n<em>\n<span>He's Superman.</span>\n</em>\n<span> And yet, he feels so woefully out of his depth when all he can do is drop beside his friend and lean into Bruce's space, trying to provide some small form of comfort even while Clark is drowning in his own overwhelming inadequacy.</span>\n</p>\n<p>\n<span>It's enough.</span>\n</p>\n<p>\n<span>Bruce leans forward and rests his head on his friend's shoulder. He speaks near silently, but he knows that Clark will hear, \"I'm usually good at coming up with plans.\" Bruce pauses to catch the hitch in his breath and cover it smoothly. Clark still hears the noise in his throat, anyway. </span>\n</p>\n<p>\n<span>\"I wish,\" Clark starts, \"… I wish I could offer you advice…\". </span>\n</p>\n<p>\n<span>And Bruce's mouth quirks ever so slightly when he finishes Clark's thought for him, \"But you have about as much experience actually succeeding at parenthood as I do.\" Clark winces. It's a fair assessment despite the many wonderful children they both love dearly.</span>\n</p>\n<p>\n<span>\"Connor says you need to be direct if that helps at all,\" Clark says. A long and pained sigh can be heard escaping from Bruce's direction. Clark lets himself smirk for a moment before he sobers again. There's one more thing he has to tell Bruce. </span>\n</p>\n<p>\n<span>\"He, uh…. He apparently sent out a few of those…just so you know all the variables\", is how Clark chooses to awkwardly articulate what he needed to say. His friend simply nods.</span>\n</p>\n<p>\n<span>After a few more minutes of comforting silence, Superman turns to leave before stopping short and narrowing his eyes at the scene he walked into when he first arrived. He stands there for a moment before asking a question in a tone that reeks of confusion, \"Bruce, why is Tim unconscious?\"</span>\n</p>\n<p>\n<span>Bruce gets a text from Diana mere minutes after Clark leaves. She must have just woken up. </span>\n</p>\n<p>\n<em>\n<span>I would be honored to train Timothy in combat for the foreseeable future and fight beside him in any future conflict. We will be unable to travel to Themyscira for training due to Amazonian law, but there is an island not far off that would be perfect for a training field. I will clear an area as soon as possible if he wishes it. I do not believe the Amazon gods would grant a male human their powers as they did to my previous protégés, but I will see that he is trained to Amazon standards nonetheless. </span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>He had apparently also missed multiple calls from Hal Jordan while he was beside Tim. The Green Lantern left four voicemails in total. Bruce plays them as he walks down a few Manor hallways towards his office. Jason had pushed him out of the medbay just after Bruce read Diana's text. Hal's voice is accusatory and rushed for most of the short messages.</span>\n</p>\n<p>\n<span>\"This is a trap, isn't it? I don't know how or why it's a trap, but it has to be one, and I am not falling for it, </span>\n<em>\n<span>Spooky</span>\n</em>\n<span>. Green Lantern can't be fooled by your weird psychological games.\"</span>\n</p>\n<p>\n<span>Click.</span>\n</p>\n<p>\n<span>\"In the off chance that it's not a trap, then yes, absolutely. Red Robin checking in on Coast while I'm in space would be like—a huge help. Also, the kid's really scary and smart, so I like him.\"</span>\n</p>\n<p>\n<span>Click.</span>\n</p>\n<p>\n<span>\"It's definitely a trap, though, so you should know I definitely didn't fall for it. That last voicemail was totally a joke, man.\"</span>\n</p>\n<p>\n<span>Click.</span>\n</p>\n<p>\n<span>\"I'm gonna see what I can do about a ring.\"</span>\n</p>\n<p>\n<span>Click.</span>\n</p>\n<p>\n<span>Bruce frowns deeply and texts Jordan a solid, </span>\n<em>\n<span>No</span>\n</em>\n<span>, as a response, and Hal quickly replies with, </span>\n<em>\n<span>fair enough.</span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>The voicemail from Oliver is just the Green Arrow laughing into the receiver for over a minute before a loud crash. After which, Dinah must grab the phone as she apologizes for her husband and tells Bruce to try and fix whatever is happening before therapy in two weeks.</span>\n</p>\n<p>\n<span>As he opens his office door, he's greeted by Barry Allen standing across the room, awkwardly shifting from foot to foot, clearly uncomfortable. Bruce sighs tiredly, \"I assume you're here because you received Tim's resume.\" </span>\n</p>\n<p>\n<span>Barry immediately relaxes before he quickly adds, \"and Wally and Max, too. Bart delivered them.\" Barry nods to three black folders that match the one Bruce had opened just a handful of hours ago. He has to shut his eyes and breath on a count to calm himself.</span>\n</p>\n<p>\n<em>\n<span>One, Two, Three, Four, Five.</span>\n</em>\n</p>\n<p>\n<span>He opens them again to see Barry closely observing. The younger man looks saddened by Bruce's demeanor. They've known each other for a long while, so Bruce feels comfortable telling the Flash the truth, \"I think I really fucked up with Tim.\"</span>\n</p>\n<p>\n<span>Something shifts in Barry on the other side of the room, and he leans against the desk he's been fidgeting beside during their interaction so far. His gaze is as demanding as his tone, \"Okay,\" he says, \"What are you going to </span>\n<em>\n<span>do</span>\n</em>\n<span> about it?\"</span>\n</p>\n<p>\n<span>Bruce is incredibly thankful for Barry commanding an answer because he finally, </span>\n<em>\n<span>finally</span>\n</em>\n<span>, thinks of a plan. It's not a great plan, and he doesn't even know if it's a good one. But he tells Barry, and after an initial pause for Barry's snort, the speedster offers to help, so it can't be that bad. Barry is also helpful because his emotional intelligence is nearly triple that of Bruce's, and he doesn't let the older vigilante get away with half measures or leaving things unsaid. </span>\n</p>\n<p>\n<span>They finish the small project just as Alfred calls everyone back down to the </span>\n<em>\n<span>basement</span>\n</em>\n<span> for brunch, the Butler breaking his own rule about meals in the cave for the first time in any of their lives. Barry wishes Bruce good luck before disappearing entirely. </span>\n</p>\n<p>\n<span>The displaced air sweeps through the room and leaves the Batman alone to pick up Bruce Wayne's laptop and descend into the Batcave, where his family is waiting. It really shouldn't feel as daunting as it does.</span>\n</p>\n<p> </p>\n<p>\n<span>It turns out that it hurts to spend time with the family as the months go on. Somehow, it’s still a surprise every single time the warm feeling in his chest when Cass and Stephanie laugh or Duke pulls him into a movie night turns sharp and unyielding. The last time Damian hugged him, </span>\n<em>\n<span>because that’s a thing that happens now</span>\n</em>\n<span>, Tim threw up on the side of the road a mile away from Bristol. </span>\n</p>\n<p>The problem is that….</p>\n<p>Tim is happy. Everything has been the best it’s ever been in Tim’s entire life, and it’ll be over in just 5 months. </p>\n<p>\n<span>These past few years, Tim hadn’t been immune to thinking that the good old days™ of borrowing the Robin mantle were somehow his peak. Or at least the peak of his emotional regulation. There were just as many ups as there were downs at the beginning. He used to think he should be </span>\n<em>\n<span>grateful</span>\n</em>\n<span> for it.</span>\n</p>\n<p>\n<span>His parents never took him with them when they left, </span>\n<em>\n<span>but</span>\n</em>\n<span> he got to know who</span>\n<em>\n<span> The Batman </span>\n</em>\n<span>was.</span>\n</p>\n<p>\n<span>He never got to say goodbye to Janet… </span>\n<em>\n<span>but</span>\n</em>\n<span> Tim Drake was </span>\n<em>\n<span>Robin</span>\n</em>\n<span>. </span>\n</p>\n<p>\n<span>Dad was murdered by Captain Boomerang, </span>\n<em>\n<span>but </span>\n</em>\n<span>Bruce Wayne</span>\n<em>\n<span> adopted him</span>\n</em>\n<span>. Just to make sure he could keep doing his job. </span>\n<em>\n<span>Tim was good at his job.</span>\n</em>\n</p>\n<p>\n<span>Eventually, even though Tim fought his hardest at every single turn, the “</span>\n<em>\n<span>but</span>\n</em>\n<span>” in all those milestones started turning into “</span>\n<em>\n<span>and</span>\n</em>\n<span>”.</span>\n</p>\n<p>\n<span>Stephanie’s corpse was lowered into the ground at the hands of Black Mask, </span>\n<em>\n<span>and</span>\n</em>\n<span> Jason Todd, </span>\n<em>\n<span>his Robin</span>\n</em>\n<span>, came back to slit Tim’s throat in the halls of Titans Tower. </span>\n<em>\n<span>His home.</span>\n</em>\n</p>\n<p>\n<span>Damian threw Tim off a Dinosaur </span>\n<em>\n<span>and</span>\n</em>\n<span> Bart…. </span>\n</p>\n<p>Bart died horribly. </p>\n<p>\n<em>\n<span>And Conner did too.</span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>Bruce was presumed dead, </span>\n<em>\n<span>and</span>\n</em>\n<span> no one believed Tim when he says there’s proof otherwise, that he could have </span>\n<em>\n<span>proved it</span>\n</em>\n<span> given only the chance.</span>\n</p>\n<p>\n<span>His brother, </span>\n<em>\n<span>the new Batman</span>\n</em>\n<span>, took Robin away </span>\n<em>\n<span>and</span>\n</em>\n<span> Ra’s Al Ghul started calling him </span>\n<em>\n<span>Detective</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>Bad things happen; it’s frankly what Tim expects at this point. Which is exactly what makes this last year so confusing. </span>\n</p>\n<p>\n<span>Because….</span>\n</p>\n<p>\n<span>Because Tim drives Duke and Damian to school on Wednesdays through Fridays </span>\n<em>\n<span>and</span>\n</em>\n<span> Young Justice has a standing movie night. </span>\n</p>\n<p>\n<span>Dick Grayson gets pissy at journalists who leave the Wayne off Tim’s name during interviews </span>\n<em>\n<span>and</span>\n</em>\n<span> the Red Hood threatened to murder Lex Luther for a bullet that grazed Red Robin’s shoulder 6 weeks ago.</span>\n</p>\n<p>\n<span>Tim Drake’s life is full of noise, </span>\n<em>\n<span>and</span>\n</em>\n<span> he’s been spending more time at the manor; by the request of Alfred Pennyworth himself. </span>\n</p>\n<p>\n<span>Apparently, the butler has been teaching Cass and Duke how to bake, and needs Tim’s taste buds on demand. Tim doesn’t really think about how flimsy an excuse it is, because it gives Alfred an excuse to ask him, and it gives Tim an excuse to stay. </span>\n</p>\n<p>\n<span>It’s in the middle of a bite of blueberry pie, courtesy of Duke’s latest baking lesson, that Tim finally understands that </span>\n<em>\n<span>the plan</span>\n</em>\n<span> actually fucking sucks. Like, really truly is the worst and he hates, hates, </span>\n<em>\n<span>hates </span>\n</em>\n<span>it. </span>\n</p>\n<p>\n<span>Now that he’s come to that realization, he can’t put it away for anything. All his skills at compartmentalization and repression are failing him in his one moment of need and he sprints out of Wayne Manor and </span>\n<em>\n<span>runs</span>\n</em>\n<span>. He leaves his car and his motorcycle and he runs 3 miles to the bus stop he used as a child to get into Gotham’s city center. He heaves at the poorly sheltered bus stop and waits for the next bus. If the routes haven’t changed much it should pick him up in half an hour. </span>\n</p>\n<p>\n<span>Plenty of time to completely fall apart. </span>\n</p>\n<p>\n<span>Because the universe understands poetic timing and Gotham is Gotham, it starts to rain slowly and then in heavy sheets.</span>\n</p>\n<p>\n<span>The Monday after his blueberry infused epiphany, Gotham Academy calls Tim at work during a quarterly meeting. The summer is coming up again soon and there’s so much to do at Wayne Enterprises that Tim actually has to hand a few of his open Red Robin cases off to Stephanie, and pass any new things that crop up to Jason.</span>\n</p>\n<p>\n<span>Tim walks out of the meeting to take the call despite all that. It’s not like they haven’t been talking about the same schedule for a month, and the school should only be calling him if both Bruce </span>\n<em>\n<span>and</span>\n</em>\n<span> Dick are unavailable. When he answers the call from the high school he doesn’t know what to expect, but he certainly doesn’t expect the opening line he gets from the secretary on duty—he thinks her name is Janine. He could very well be wrong.</span>\n</p>\n<p>\n<span>“Mr. Drake, I’m afraid we need you to pick up your younger siblings. There was an incident during lunch break today that needs to be addressed.”</span>\n</p>\n<p>\n<span>The words confuse Tim because, “…Both?”</span>\n</p>\n<p>\n<span>There’s a small sigh on the other end of the line, “Yes, both Damian and Duke are here in the office with three other students and their guardians. We couldn’t reach Mr.’s Wayne or Grayson, so it took some time to get to you. As soon as you can make it down to the Academy’s office, though, we’d like to discuss the incident with everyone present.”</span>\n</p>\n<p>\n<span>Tim computes the information as quickly as he can and starts walking towards the elevator to the garage, “Of course. I should be there in about 15 minutes…. Goodbye.” He hangs up the phone hastily and shoots off a text to Tam and Lucius about being out for the rest of the meeting. And probably the day. Lucius takes it better than Tam does, and Tim can tell that he’ll have to make it up to her somehow, he’s thinking a paid vacation might do it, but he isn't sure. Maybe one of those expensive space pens.</span>\n</p>\n<p>\n<span>The drive through Gotham towards the school is tense even though Tim’s completely alone—something about the empty space is charging the silence and the inside of the car is brimming with unused and sparking energy. He doesn’t play music or roll down the windows to alleviate the feeling in his chest. He just drives. He has 15 full minutes of thinking in the silence of the S8.</span>\n</p>\n<p><span>He’s glad he didn’t ride his bike into the office today, the Audi has four doors and a back seat by some miracle, so Damian will be comfortable sitting on the bench. It’s </span><em><span>not</span></em> <em><span>even</span></em><span> Tim’s car, so he’s relieved it ended up with him today anyway. The car </span><em><span>is</span></em><span> Jason’s.</span></p>\n<p>\n<span>Well….</span>\n</p>\n<p>\n<span>It’s technically in Jason’s name. Bruce hasn’t told Jason that for the 6 months they’ve had it, though. Bruce’s second son knows it’s his car, too. He’s seen his name on the paperwork in the glove compartment, but he won’t drive it until Bruce bucks up and gives it to him for real. Tim’s just really impressed that Jason’s actually pushing for the emotional payoff of whatever’s going on with him and Bruce. It seems out of and yet in character. A small voice whispers tentatively inside of Tim’s head that it’s something that Jason would’ve demanded </span>\n<em>\n<span>before. </span>\n</em>\n<span>The entire ordeal is indicative of the Robin Tim remembers so vividly from so long ago. Tim almost gets lost in the past when a car horn knocks him back into the driver's seat. The light’s green. He goes. </span>\n</p>\n<p>\n<span>Being back at Gotham Academy is unpleasant; Tim thinks he might just hate it. He’d like to say he remembers Algebra or English classes—lunch with Bernard and Ives—but he doesn’t. What he actually remembers is blood on the floor, and his friend bleeding out from a bullet wound. He passes through the hallway Darla died in quickly, trying not to think even though it’s the one thing he can always be counted on to do. He stills smells rusted copper when he opens the office door and meets the eyes of the secretary at the counter. She seems to recognize what he’s here for immediately and nods towards the Vice Principal’s office at the end of the small hall. Duke and Damian are already sitting in the chairs outside the closed door, both of their heads down, but sitting pressed together. Tim can infer that the rest of the kids and their guardians are already inside, relaying their version of events. It’s not ideal that they get to tell the story first, but it is something he can work with. </span>\n</p>\n<p>\n<span>He clears his throat and stops about two feet in front of the pair, and their heads shoot up to look at him. Tim couldn’t notice it when he walked in, but now that he’s close he can see that Damian has bruises littering both his cheekbones and Duke’s knuckles are bloody. They both look nervous and vaguely guilty. Something violent twists and turns in Tim’s stomach, and he kneels down in front of his brothers to be at their eye level. He runs his hands just above the cuts on Dukes hand first, checking for fractures in the knuckles. When he’s satisfied with that he turns to Damian and grabs his chin, moving his face at different angles to assess the damage.</span>\n</p>\n<p>\n<span>With narrowed eyes he plainly demands, “What did they do?”</span>\n</p>\n<p>\n<span>Duke lets out a relieved breath. He was probably expecting Tim to tell them to explain themselves. None of them are supposed to get into fights while not in masks. Even the ones they don’t win. Tim’s never been fond of that rule. He broke it himself while at Gotham Academy, too—just like every other member of their ragtag group of emotionally repressed vigilantes. Bruce himself being the worst offender. Damian stares at Tim with something in his eyes that breaks Tim’s heart a bit. He’s once again reminded just how </span>\n<em>\n<span>young</span>\n</em>\n<span> Damian is. Tim can do nothing to stop his body from dragging his youngest brother into a tight hug on the office floor.</span>\n</p>\n<p>\n<span>He looks over Damian’s shoulder to Duke, and Duke understands the silent probing to tell the story. </span>\n</p>\n<p>\n<span>Tim fumes by the end of it, his grip on Damian tighter and tighter until Duke finishes with efficiency. Tim places Damian back on his chair and gets comfortable on the floor in front of his brothers even though there are multiple free chairs available. To sit in any of them would mean a loss of contact with one of the two people he's here for, so instead he pushes his back against both their legs and checks his emails. </span>\n</p>\n<p>\n<span>They only have to wait five more minutes before the Vice Principal opens the door. It’s weird how little things changed here in comparison to Tim’s own life. Mr. Williams looks exactly the same as the last time Tim saw him three and a half years ago, down to the patterned tie.</span>\n</p>\n<p>\n<span>A complicated thing happens to his face as he appraises Tim in his three piece suit sitting at the feet of his younger siblings. He doesn’t voice any of the thoughts he may have, and Tim is grateful, but also silently cursing himself for not thinking about the repercussions that Damian and Duke may face if this man doesn’t view Tim as a professional adult. He’s not used to missing any of the variables and he needs his head on right for whatever this meeting entails.</span>\n</p>\n<p>\n<span>Williams attempts to invite them into the room with everyone else. </span>\n</p>\n<p>\n<span>Tim furrows his brow, and asks, “Have Duke and Damian already given you their version of events?”</span>\n</p>\n<p>\n<span>Williams pauses. “I was just inviting them inside to hear their account.”</span>\n</p>\n<p>\n<span>Tim doesn’t let it go. This—</span>\n<em>\n<span>this he could do all day.</span>\n</em>\n<span> “I’d be more comfortable if they were treated with the privacy you’ve already afforded to the other side of the recent altercation. I fear the presence of the three boys who attacked my 14 year old brother might dilute his desire to tell the truth.” Tim’s going out on a limb mentioning Damian’s age, Duke never mentioned how old the other kids were, but judging by the widening of Williams’ eyes, it was the right call. They were probably older, then. </span>\n</p>\n<p>\n<span>The Vice Principal is quick to agree and ushers the three teenagers and their parents out of the room, allowing the three Wayne’s to enter alone. As they pass one set of parents glares at the group, while the other two guardians present only seem surprised that Tim is the Wayne that managed to show up. That’s a fair enough response. Tim catalogues all the reactions for now. As they enter the smaller office he notices that there are only two chairs across Williams desk. It’s amusing to think 7 people were in the room before them. He wonders about the seating arrangement as he ushers Damian into one chair and Duke into the other. He settles between them—standing with a hand on each of their shoulders as Williams takes his own seat across the Oak desk. </span>\n</p>\n<p>\n<span>Clearing his throat after awkwardly adjusting in his seat, Williams speaks, “Alright. I’d like to give you two the chance to tell your side of the story.” </span>\n</p>\n<p>\n<span>Duke looks to Damian to start, as he didn’t get there until after everything apparently went to hell. “They took my sketchbook. Ruined it. I tried to get it back and was intercepted until Duke found us in the halls”, is how Damian decides to explain the situation. Tim almost screams in frustration at Damian’s simplification. </span>\n</p>\n<p>\n<span>He almost demands more from the young teen when Duke cuts in, “By intercepted he means three seniors were taking turns turning his face into an art project. I stopped it,” he pauses and looks at Tim, “I didn’t see a way to stop it immediately without intervening physically. And he’s my brother.”</span>\n</p>\n<p>\n<span>Williams nods, sighs, and says tiredly, “You still should have found a faculty member, Mr. Thomas…. Your stories are very different from that of your peers. We’ll bring them in now to discuss as a group.”</span>\n</p>\n<p>\n<span>Williams stands to get the door and Tim turns to lean on the desk to look at his brothers, and gives a quiet order, “Stay in those chairs. They’ll stand.”</span>\n</p>\n<p>\n<span>At the nods he receives in return Tim turns his attention to the entering party. He offers his hand out for a handshake and the leading man takes it.</span>\n</p>\n<p>\n<span>Tim starts his introduction from there, “My name is Tim Drake. Acting guardian of both Duke and Damian for the afternoon.”</span>\n</p>\n<p>\n<span>He replies, “Anthony Mills, Eric’s dad. These are the Dubois’; they’re Will’s parents. And this is Lindsay Kubby, Kyle’s mother.”</span>\n</p>\n<p>\n<span>Tim nods and shakes their hands as well. He figures he should offer civility first and says, “I’m sure we’ll be able to figure this out.”</span>\n</p>\n<p>\n<span>The snort from Mr. Dubois doesn’t necessarily surprise him, but it does disappoint. Duke cringes before the man even says his next words, his eyebrows pulling together in offense, “There’s nothing to discuss, your boy sicced his guard dog on our boys.”</span>\n</p>\n<p>\n<span>Tim steps towards Dubois and spits, “They’re both my boys,” with a venom he didn’t expect from himself. After a breath he finishes his thought out loud, “If I were less of a man, I would insult your child for targeting and assaulting a boy four years his younger, and I might even imply it was a learned behavior, but seeing as I’m not one to make wild and dehumanizing accusations, I’ll leave my comments to the civil discussion we’re meant to be having.”</span>\n</p>\n<p>\n<span>Williams interrupts before Dubois can reply and Tim collects himself with the full knowledge that he should not have done that, and that he needs to get his shit together. “Why don’t we begin?”</span>\n</p>\n<p>\n<span>Halfway through debating the actual series of events Tim gets fed up with the Dubois’ frequent insinuations that Damian is a liar. Tim decides to do Williams’ job for him.</span>\n</p>\n<p>\n<span>“Damian, where’s your sketchbook?”</span>\n</p>\n<p>\n<span>The backpack is handed to Tim silently, and Damian being demure and quiet makes Tim want to shake the kid. The zipper screeches in the quiet room as Tim opens the backpack and removes a sketchbook, or at least the remains of one. Hesitantly—holding the destruction with care because the work inside is still precious—Tim places the first half of the book in front of the Vice Principal. He places the second half next to the first one. No one speaks for a long moment and Tim holds in most of his rage like the professional he is. </span>\n</p>\n<p>\n<span>“Are we done arguing about what’s real?” </span>\n</p>\n<p>\n<span>Williams nods at the notebook with a grimace, “Yes, I suppose we are,” and he turns to the group. “Our policy on fighting of any kind dictates that all parties are to be suspended for the two days….and the policy on bullying would require the suspension period extended to three additional days for the instigators.” </span>\n</p>\n<p>\n<span>There is outrage on all sides, and Tim pounces on the opportunity. The information about Gotham Academy policy is finally kicking in. “A five day suspension would go on a permanent record, would it not?”</span>\n</p>\n<p>\n<span>The other guardians freeze from their arguments towards Williams to turn to Tim incredulously. Then they swivel back to Williams at his answer.</span>\n</p>\n<p>\n<span>“…It would, Mr. Drake.”</span>\n</p>\n<p>\n<span>Tim looks at Duke and Damian and sees the confusion on their faces. Two days isn’t all that bad a punishment, but Tim knows Bruce would lecture them for it. So, Tim wants to fix it for them, and he knows he can do it.</span>\n</p>\n<p>\n<span>Tim haltingly begins, “…It’s just…these boys are probably seniors, correct?” At the nod of nearly everyone in the office, Tim proposes, “I don’t see the necessity of having to complicate their application process for colleges, is all.”</span>\n</p>\n<p>\n<span>The other adults in the room are quick to agree, afraid of their children's prospects dwindling with a disciplinary record. Williams sighs and asks Tim, “and what would you suggest, Mr. Drake?”</span>\n</p>\n<p>\n<span>“Reduced Suspension. Three days in total for the seniors, and one for my brothers, starting today.”</span>\n</p>\n<p>\n<span>Williams sighs heavily and looks to the parents in the room, and Tim can all of a sudden tell that he’s been dealing with them for more than an hour. The man is </span>\n<em>\n<span>tired</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>“I think that solution is amenable”, he looks to the rest of the room to confirm, and at their agreement, he nods. “Okay, then. You all can leave, Janine at the front will give you information on the suspensions. Duke and Damian, you’ll be cleared to come back tomorrow. Everyone else; I’ll see you Thursday.”</span>\n</p>\n<p>\n<span>In the parking lot Tim opens the backseat for Damian and the young teen gets in quietly. Taking a breath doesn’t make Tim’s chest any lighter, but it does center him enough to grab Duke by the arm before he opens the passenger door.</span>\n</p>\n<p>\n<span>“Bruce isn’t going to tell you this. He’ll think it maybe, but he won’t say it… Good job.”</span>\n</p>\n<p>\n<span>He releases Duke’s arm and makes his way to the driver's side door, not waiting for response. Damian doesn’t say a word the entire drive, but Duke fills the silence by telling Tim about his upcoming Biology unit assessment. It’s interesting stuff, Tim remembers the course from before he dropped out. There’s another, smaller ache settling beside the large one in his bones, it might be jealousy. Duke’s going to graduate next year. A high school diploma and college prospects that he’ll no doubt get scholarships for. </span>\n</p>\n<p>\n<span>Pride nestles there, too. There are too many feelings beneath Tim’s skin, but he likes the way being proud of his family feels in comparison to most other emotions flowing in his veins these days. </span>\n</p>\n<p>\n<span>They make it to the manor in time for Tim to get back to work for an additional 6 hours if he leaves late. He parks in the garage despite that, and walks inside of the building that’s starting to feel like a home again. Damian tries to leave immediately but Tim navigates himself to be an obstacle in the boy’s way. </span>\n</p>\n<p>\n<span>A glare is shot at Tim but he might as well be immune to them, “Move, Drake,” Damian demands. </span>\n</p>\n<p>\n<span>“Hmm. I don’t think I will,” Tim wonders aloud. Then after a second, he orders, “Leave your bag with me. Go get a blank sketchbook… scissors and glue too. Duke and I will wait at the kitchen table.”</span>\n</p>\n<p>\n<span>Damian looks like he wants to argue so Tim takes the bag from his hand anyway, “If your not back in five minutes I’ll call Jason and Roy to help with arts and crafts.” </span>\n</p>\n<p>\n<span>The teen cringes and spits, “fine,” back at Tim. This time, when Damian tries to move around Tim’s figure, Tim allows it. </span>\n</p>\n<p>\n<span>Four minutes and fourty three seconds pass before Duke and Tim are graced with the presence of Damian and his gathered supplies. Tim had already set the destroyed sketchbook and the few loose pages onto the table and Duke has begun the process of smoothing over creases, and uncrumbling to the best of his ability. It seems that Tim has also wrapped Duke’s knuckles. It makes the work slower, but the Signal is determined with his work.</span>\n</p>\n<p>\n<span>Tim takes the supplies from Damian immediately and allows his youngest brother a moment to take in what the three of them are going to spend the rest of the day doing.</span>\n</p>\n<p>\n<span>“…what are you doing?”</span>\n</p>\n<p>\n<span>Duke answers, saving Timothy from having to from where the oldest brother among them pauses in unpacking glue, “We’re fixing it. Well, kinda…. We’re trying to save the drawings.”</span>\n</p>\n<p>\n<span>“But you have the day shift,” Damian argues, confused at why Duke would be in the kitchen sat at the table flattening out a drawing of a blue-bird with concentration in his brow. </span>\n</p>\n<p>\n<span>Duke doesn’t even look up when he says, “this is more important.” His tongue sticks out as he tries to undo a crease in the blue-birds wing. </span>\n</p>\n<p>\n<span>Damian wants to do something to say thank you but his thoughts are interrupted by Timothy crowding in his space. </span>\n</p>\n<p>\n<span>He gives Damian a sympathetic look before saying, “This is going to hurt, I’m sorry,” and unceremoniously slathers some arnica cream onto the bruises that are blossoming blue and purple on the younger boy’s face. Damian doesn’t flinch, but it does hurt. Robin’s had much worse though. </span>\n<em>\n<span>Damian</span>\n</em>\n<span> has had much worse.</span>\n</p>\n<p>\n<span>Then Tim cracks an instant ice pack and hands it to Damian with these instructions, “When the cream dries, use that. Now, come on. We’ve got work to do, and Duke can’t do everything by himself.”</span>\n</p>\n<p>\n<span>Before Tim can turn fully around, the kid stops him.</span>\n</p>\n<p>\n<span>“Why?”</span>\n</p>\n<p>\n<span>Tim takes his time answering, and eventually says, “because you’ve had a bad day.”</span>\n</p>\n<p>\n<span>Damian eventually settles at the table with his older siblings and helps them relocate his sketches from the destroyed book to the new one. Sometimes, Damian will try to throw away a drawing he views as too damaged, or not good enough to relocate, but Tim will take them from him and place them in a pile to the side. The book isn’t perfect, but Damian is grateful for it anyway. When they finally finish, Tim offers some of the sketches Damian had tried to throw away to Duke, and they split the pile among them to keep. </span>\n</p>\n<p>\n<span>Later that night, after Damian is benched from patrol until his face heals somewhat, Tim is stopped in the hallway by the younger boy. The kid’s finally holding the ice to his face, and Tim’s relieved that getting back into Gotham for vigilante work has made Damian more interested in the recovery process. </span>\n</p>\n<p>\n<span>“It wasn’t that bad a day in the end. So thanks.”</span>\n</p>\n<p>\n<span>If someone asked him down the line what about this moment changed Tim’s mind, he couldn’t exactly tell you. But it does. </span>\n</p>\n<p>\n<span>He means it when he promises, “I’m your brother, Damian. I’m always going to be there for you.” </span>\n</p>\n<p>\n<span>And that’s the end of the plan. The end of building and burning bridges. Tim’s at the nest getting ready to go out for the night as Red Robin and he decides to throw out the calendars, and the notes, and the resumes, and everything else when he gets back from patrol. </span>\n</p>\n<p>\n<span>He never does, though. Getting back to nest doesn’t actually happen the next morning. Or that week. </span>\n</p>\n<p>\n<span>Tim really, </span>\n<em>\n<span>really</span>\n</em>\n<span> hates the Scarecrow.</span>\n</p>\n<p><br>\n<br>\n</p>\n<p>\n<span>Red Robin was only in Crane’s temporary lair for three hours and seventeen minutes. Tim would catalog the seconds, but his head is too fuzzy. He can’t put together ideas that consist of more than two or three words at once. He can’t even remember the Scarecrow’s villainous monologue or why he feels nauseous.</span>\n</p>\n<p>He vaguely recalls destroying a vat of liquid fear toxin, but he also feels the familiar sensation of drowning—wet and thick, coating the interior of his lungs. Even in his inebriated state, Tim is disquieted by his failing memory. There is no memory of winning floating through his mind, but he thinks he remembers tumbling out of a window—his body is sore from what might’ve been a two-story fall. Tim’s almost certain he stopped something bad from happening, but a victory would sound different in his head. It would be less muted and jumbled. There’d be laughter and the whirr of a grapple gun, maybe the revving of a bike engine. He doesn’t recall any sounds that point to success. The only noise he can replay is of glass shattering and crunching beneath feet and hands and knees. </p>\n<p>\n<span>That must have happened, Tim thinks sluggishly. His gloves have bits of glass stuck in them. His hands are bleeding into the dark fabric. </span>\n</p>\n<p>\n<span>He tries to think further but is blocked and sidetracked by something blunt inside his own head. All at once, the thick fog in his head sharpens into something feral while he rips his gaze away from his hands and towards the city’s business district—he hears laughter in the distance. </span>\n</p>\n<p>\n<em>\n<span>He hears laughter getting closer.</span>\n</em>\n</p>\n<p>\n<span>He runs. </span>\n</p>\n<p>As fast as he can on what his hindbrain registers as a twisted ankle. The pounding of his feet on asphalt might break the strained bone, but the pain doesn’t register, at least not now. Red Robin runs and hides and hopes and hopes and hopes. It doesn’t seem to matter that hope does very little for birds who can’t see where they’re flying. Miraculously, nothing stops him in his blind fit of jerking movement.</p>\n<p>\n<span>It might be instinct alone that gets him off the streets of Gotham that first night. He spends the hours until morning outrunning a crimson smile and a purple laugh. He hides atop buildings and below ground until the chuckle finds him time and time again. He can’t escape it, and part of him doesn’t want to. If the laugh stops chasing Tim, it might follow </span>\n<em>\n<span>Jason</span>\n</em>\n<span> home. And that thought is unthinkable in every way that Tim fears most. He does everything in his power to ensure that the Joker doesn’t give up on chasing Tim to terrorize someone else. </span>\n</p>\n<p>\n<span>He can’t keep running, though, it’s been nearly a day, and he hasn’t caught his breath. The lungs in his body burn molten and constrict with each laborious breath. A broken bone is now definitely hiding somewhere in his ankle, and his head is so full of primal fear that it splits in two nearly every minute with pain. Red Robin needs to rest and a place to rest in. </span>\n</p>\n<p>\n<span>It feels like giving up. It feels like failing.</span>\n</p>\n<p>\n<span>What happens inside Tim’s head and outside of it are nearly the same for the only instance in the week to come. Inside his tearing mind, Tim’s instincts allow him to scale an abandoned apartment building and crawl through a window to bask in the relative safety of one of Gotham’s condemned apartment complexes. Outside of his awareness, the building Tim finds actually does house people, though none of them notice him climbing to the fifth floor in the evenings, stretching shadows. He finds it because it was familiar at one point, though he doesn’t realize it in his state. It’s one of Jason’s. The Red Hood hadn’t used the safe house in many months, nearly always waffling between the manor and the apartment he shares with Roy and Lian. But it’s protected, and it’s warm, and something about it broke through to Red Robin when he passed it in his wild and frantic search for solace and a place to rest.</span>\n</p>\n<p>\n<span>Through muscle memory, he disables the alarms but still doesn’t notice them. His body is set to autopilot on a course he can’t recognize, with the toxin still poisoning his system. The corner of the main room is quickly occupied by his shaking form. Wedged between a bookshelf and the peeling wall, Tim tries to calm himself down with all the tools at his disposal. It’s hard work. His breaths are laborious, and too many are stuck into each moment. His lungs take the violence without grace; Tim heaves as he curls inwards towards himself. He wants to be small and unnoticeable.</span>\n</p>\n<p>And just when Tim thinks his head is finally clearing, Jason walks in.</p>\n<p>\n<span>No—that’s not right.</span>\n</p>\n<p>\n<span>Jason stumbles into the room violently, falling through the door with only a broken Bo staff to lean on. Once the staff buckles under his weight, Jason starts to crawl instead. His body is so mangled it takes away what little is left of Tim’s breath.</span>\n</p>\n<p>\n<span>Jason stares as he claws his way across the wood floor, and he’s smiling joker-wide, mouth painted red with blood. The edges of Tim’s vision blur with tears, and it feels so </span>\n<em>\n<span>very real.</span>\n</em>\n<span> </span>\n</p>\n<p>“Why’d you let it happen again, Timmy?”</p>\n<p>\n<span>The words rock into Tim like nothing else has that night, and he’s quick to speak through his shredded throat, trying his best to explain through the pain, “I, I didn’t… I swear I didn’t—”.</span>\n</p>\n<p>\n<span>“Isn’t it funny, though?” Jason interrupts jovially despite his mangled skin and bones. Tim can’t even see the older boy’s right foot, but with how Jason fell, it has to be badly hurt.</span>\n</p>\n<p>\n<span>A voice that is Tim’s voice speaks out, but it doesn’t come from Tim. It comes from inside his head—speaks for him—driving the vision without care or consent from Tim himself. Crane is a very brilliant chemist, after all, and he is very, very good at what he does. </span>\n</p>\n<p>\n<span>“…What’s funny?”</span>\n</p>\n<p>\n<span>As if he were waiting for that cue, Jason lifts himself haltingly from where his blood is dyeing the hardwood as the older vigilante forces himself to stand. Tim can hear the man’s bones crack and shift from the weight, and his mangled foot finally comes into Red Robin’s sight line.</span>\n</p>\n<p>Jason levels Tim with a wild grin and displays the joker’s gruesome work like some kind of punchline before clarifying, “Isn’t it funny that I look just like you did?” </p>\n<p>Something like a sick mix of horror and realization dawns on Tim from where he’s still curled in the corner. Jason’s throat spills blood, and his left eye is swollen shut. The legs he is standing on are broken cleanly and precisely. This wasn’t done with a crowbar. It was done with a Bo staff—with the Bo staff Jason limped in on. Tim gets very nauseous at that moment. Every single scrape and bruise on Jason’s body is one that Red Robin is overwhelmingly all too familiar with because they were once his. And Jason once put them there. </p>\n<p>\n<span>The laugh that follows is gleeful and hollow. The bones beneath it give out as Jason tumbles to the floor again, still wheezing through the screams, turning and writhing to look at Tim once more. </span>\n</p>\n<p>\n<span>“You don’t find it funny, little red? I thought you might find it funny?”</span>\n</p>\n<p>\n<span>Hours and hours later, Tim still hasn’t moved, and neither has Jason. The older vigilante is coughing up blood, though, and his wheezing gets quieter and quieter as Tim watches—frozen with his knees tucked into his chest. Jason’s hand reaches out at his last moment, and he asks Tim again why he let it happen. Tim has no answers, so he just shuts his eyes as tightly as he can for as long as he’s able. </span>\n</p>\n<p>\n<span>When he opens them, Jason’s body is gone, but so is the apartment. </span>\n</p>\n<p>\n<span>Instead, he stands on the tower of a Gotham Cathedral, holding on with lax fingers as he sways above the city’s lights. Stephanie is wearing her original spoiler costume and holds onto the spike from the other side. Her smile is small but genuine. And she’s in the middle of relaying some impassioned speech that Tim can’t place, but he takes a deep, relieved breath of glorious and polluted air. </span>\n</p>\n<p>\n<span>Stephanie pauses then, her face morphing into something curious as well as saddened, “Do you remember this night?”</span>\n</p>\n<p>\n<span>He does.</span>\n</p>\n<p>\n<span>“You told me you loved me for the first time, right here,” she elaborates. The statement isn’t for his benefit; it was only said to strengthen the next set of words. </span>\n</p>\n<p>“You loved me, and you wouldn't even tell me your name.”</p>\n<p>There's a churning in the base of Tim’s gut as he tries to reach out to Stephanie across the spire, but she pulls away from him. He grasps at nothing, and there are tears in both their eyes. She takes a heaving breath and lets out a wet chuckle. </p>\n<p>\n<span>Then her teary eyes turn cold as she tells him, “That’s not love, </span>\n<em>\n<span>Robin</span>\n</em>\n<span>.” </span>\n</p>\n<p>He doesn’t even try to stop her from pushing him from the point’s edge. Eyes flutter shut, and a figure falls from the top of Gotham’s skyline. This time, there is no one there to catch him. Just before his body can hit the ground, his vision swims, and he’s standing upright once again.</p>\n<p>\n<span>His stomach drops with dread when he realizes where he is. He doesn’t want to see this, so he closes his eyes, trying to get the nightmare to take him somewhere else. It doesn’t work, so he falls to his knees and vomits on the desert sand. </span>\n</p>\n<p>\n<span>The toxin doesn’t wait for Tim to get his bearings, and the scene before him plays without pause. He’s a spectator in this vision. Owens and Z die bloody while Tim watches, and Pru’s life hangs in the balance. He knows he saved her; he knows he got her out. Now, Tim watches as another version of himself is too late. She dies looking at her Red Robin, and Tim tastes the failure on his tongue. The nightmare isn’t done with him yet, though. Pru’s body morphs into someone longer, leaner—</span>\n<em>\n<span>sharper</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>Batman is bleeding out in front of him now, but it’s not Bruce. Dick is in the suit; the cowl is pulled back as he grips his own throat, trying to staunch the blood. </span>\n</p>\n<p>\n<span>In a blink, Tim is no longer a spectator. He’s the Robin on the ground, crawling his way toward his dying brother. </span>\n</p>\n<p>\n<span>When Tim is just feet away, Dick softly croaks, “Robi-in? Rob—n, help.”</span>\n</p>\n<p>\n<span>Tim finally reaches him. Moving with determination and purpose, he lifts Nightwing’s torso and props the vigilante against himself to put further pressure on the wound. </span>\n</p>\n<p>\n<span>He starts to cry as the gaping wound doesn’t slow, but he freezes when Dick’s eyes finally focus on him, and his words, his last words are, “Where’s Robin, Tim? </span>\n<em>\n<span>Where’s Damian”.</span>\n</em>\n</p>\n<p>\n<span>The nightmare lets him sit with Dick’s cooling body for a long, long time. Enough for the night to fall and the sun to rise the following day. In the toxin-induced hallucination, he feels his skin burn and prickle from the hot sun, but he doesn’t move. He sits with the body, and he waits for whatever new terror is coming next.</span>\n</p>\n<p>Just when enough time passes for Tim to feel panic inch into his fingertips, that this scene might actually be real, might have happened, the world spins. The new environment in his very own rotating door of horrors is constructed with the rocky shores underneath the League of Assassins compound in Nanda Parbat. Everything around Tim glows a sickly green that Red Robin has always been unnerved by. The Lazarus Pits are complicated. Tim is grateful for their part in bringing Jason back to the family. But without the pits, Tim wouldn’t feel sick at the sight of too-green eyes or have the chance to catch the attention of a maniac who should be dead ten times over.</p>\n<p>\n<span>Forcing himself to observe his surroundings past the green glow takes Tim more than a minute to accomplish successfully. He doesn’t know what he’s supposed to be looking for. His instincts say the fear he must be facing here is Ra’s Al Ghul. Pretty cut and dry considering everything he’s been through so far, but that train of thought slams to a halt when Tim sees a body on the shore, drenched in that eerie green.</span>\n</p>\n<p>\n<em>\n<span>Damian</span>\n</em>\n<span>.</span>\n</p>\n<p>\n<span>In a matter of seconds, Red Robin is skidding to Damian’s side, ripping the knees in his suit as the sharp rocks drag through the reinforced fabric. He turns Damian onto his back and frantically searches for signs of life, pressing his ear to Damian’s chest.</span>\n</p>\n<p>\n<span>There’s nothing. </span>\n</p>\n<p>\n<span>Nothing moves, beats, or makes any sound until suddenly, </span>\n<em>\n<span>finally</span>\n</em>\n<span>, something does. Damian’s heart beats, and the boy wheezes and coughs—he breathes. Tim is so grateful he sobs in relief before moving a blinking Damian up to sit, gripping both shoulders in a firm clasp, and demanding, “Never do that again.”</span>\n</p>\n<p>\n<span>Tim is looking over Damian’s injuries when the reply finally comes.</span>\n</p>\n<p>\n<span>“As you wish, Detective.”</span>\n</p>\n<p>\n<span>Tim recoils, falls backward onto his hands, and pushes himself as far away as he can manage, eventually hitting the shore of another demonic pit. The man wearing Damian’s skin stands and brushes his hands along his thighs.</span>\n</p>\n<p>\n<span>No.</span>\n</p>\n<p>\n<em>\n<span>No.</span>\n</em>\n</p>\n<p>\n<span>Anything but this.</span>\n</p>\n<p>\n<span>Damian laughs—No. Ra’s laughs with Damian’s voice, walks over to Tim where he’s frozen on the floor with Damian’s feet, and reaches out with Damian’s hand.</span>\n</p>\n<p>\n<span>He grabs Tim’s face and turns it towards his own smile, shifting Red Robin’s chin from where it’s pointed away. </span>\n</p>\n<p>\n<span>They lock eyes, and Ra’s gives Tim a sympathetic face. It doesn’t match Damian’s; the micro-expressions are all wrong. It helps.</span>\n</p>\n<p>\n<span>Ra’s, never one to waste a monologue, speaks softly to him, “Oh, Detective. There’s no reason to fear me. I don’t plan on hurting you… as long as you do as you're told.”</span>\n</p>\n<p>\n<span>“Never,” Tim spits, finally getting his bearings and trying to scramble away, but Ra’s puts an immovable foot on his chest and holds him there. The rocks that make up the pits’ ridge behind him dig into his spine with force.</span>\n</p>\n<p>\n<span>“This is no way to start, Dear Detective,” Ra’s sighs, “The first thing you’re going to need is a change in perspective.” His smile turns gleeful as he breaks Tim’s ribs, collapsing them into Red Robin’s remaining organs.</span>\n</p>\n<p>\n<span>For the seconds that Tim knows he has left, he can’t breathe or see through the pain, but by some awful miracle, he can feel everything. Damian’s hand lifts him by the collar and drags him up to his knees. A small caress on his cheek has Tim closing his eyes, embracing the pain in place of whatever nauseating affection Ra’s has convinced himself he has for Tim. Somehow, he’s still surprised when Ra’s pushes him backwards into the waters of a Lazarus Pit.</span>\n</p>\n<p>\n<span>He should’ve known, though. He’s always been afraid of drowning in this particular shade of green.</span>\n</p>\n<p>\n<span>He doesn’t feel the waters knitting him back together; the pit doesn’t get a chance to do its work before the swirl tugs him somewhere new. </span>\n</p>\n<p>\n<span>The pull of the toxin is getting weaker. It no longer has the power to alter memories or create new ones like it has been for the last few days. So it chooses a memory it can leave unchanged.</span>\n</p>\n<p>\n<span>The bat-cave years ago wasn’t so different from how it remains in the current day. There are fewer trophies, the computer doesn’t have as many monitors, and the gym is made only for three. There’s just one display case near the center of the room. Tim used to stand before it when he was 13 and alone, willing himself to grow into Jason’s shoes and </span>\n<em>\n<span>just be good enough already.</span>\n</em>\n<span> When the ground beneath Tim settles, he’s face-first on the training mat, a sting in his right arm. </span>\n</p>\n<p>\n<span>Behind him, Batman declares, “You’re getting better,” and he sounds happy, if gruff. Tim remembers being elated at how the joy crept up on Bruce after their first year as Batman and Robin. </span>\n</p>\n<p>\n<span>“Keep at that move, and you’ll have it down by next week, Jay—.” They’ve both frozen at Bruce’s words, Tim halfway to standing, and Bruce, turned away towards the computer. </span>\n</p>\n<p>\n<span>Tim recovers quickly, knowing that the damage has to be mitigated somehow. He stands the rest of the way up and takes a tentative step, “Bruce?”</span>\n</p>\n<p>\n<span>The man with his back to Tim must have heard him, the flinch by his shoulders a dead giveaway, but he’s not looking at Tim. Bruce Wayne is staring at an empty and torn suit covered in blood. Tim is right here, and Bruce won’t even look at him in favor of a glorified tombstone.</span>\n</p>\n<p>\n<span>Tim tries again, “Bruce, are—”</span>\n</p>\n<p>\n<span>“Get out.”</span>\n</p>\n<p>\n<span>Tim freezes but doesn’t give up, “What? Bru—”</span>\n</p>\n<p>\n<span>“Get. </span>\n<em>\n<span>Out.</span>\n</em>\n<span>”</span>\n</p>\n<p>\n<span>“…okay.” His voice is small now, and he leaves for the stairs to the manor, but he doesn’t leave. Bruce will freak out, make a mess, and then…. Then he’ll need someone to put it all back together.</span>\n</p>\n<p>\n<span>That’s what Tim is for. </span>\n</p>\n<p>\n<span>He travels up the stairs with silent efficiency, and he meets Alfred in the kitchen, pausing in the doorway to allow the butler to finish preparing his tea. Alfred must notice him despite his silence because the man makes a second cup without any hesitance.</span>\n</p>\n<p>\n<span>“Master Timothy, would you like to accompany me to the family parlor?</span>\n</p>\n<p>\n<span>Tim politely accepts with a small “yes.”</span>\n</p>\n<p>\n<span>Alfred Leads them away through the manor then and sets down the tea on either side of a small table. He lets Tim sit first before joining him, and they have tea together. Tim never really liked tea, but it seems to calm Alfred down when he drinks it, so there has to be some merit there. He lets the aftertaste sit with him for a while before taking another warm gulp.</span>\n</p>\n<p>\n<span>The silence is broken by Alfred, “How long do you think, Master Timothy?”</span>\n</p>\n<p>\n<span>Tim sighs and looks into the tiny teacup like it may have the answers, “Another hour, at most.”</span>\n</p>\n<p>\n<span>Alfred gives him a pitying look before continuing, “And what will we find?”</span>\n</p>\n<p>\n<span>“Broken equipment—with a focus on anything used by a Robin in the past, possibly shattered glass. Injury to his person will be expected. The backup medical kit would be in my locker if the current stock were destroyed.”</span>\n</p>\n<p>\n<span>Alfred looks down into his own tea now; grief and loss play on his features in real-time. Tim has to look away. It is not his to see.</span>\n</p>\n<p>\n<span>“Alright, then. While we wait, why don’t we play a soothing game of chess?”</span>\n</p>\n<p>\n<span>When Tim and Alfred go back downstairs, Alfred insists on leading. He does so with grace and without trepidation. It helps Tim himself not be afraid of what’s to come. </span>\n</p>\n<p>\n<span>Bruce is on the floor in a heap. His hands are bloody, and there’s a cut on his forehead. The damage to the cave is less than expected. After throwing around a few things, Bruce seems to have concentrated on training equipment. At least the punching bag is meant to take a beating.</span>\n</p>\n<p>\n<span>Alfred goes to help Bruce onto a low bench and finds the medical kit untouched. He hands the kit to Tim with a small nod before starting to clean up the cave. </span>\n</p>\n<p>\n<span>He starts with Bruce’s forehead. His mentor's eyes are slightly hazy. The scrape is cleaned and covered quickly before Tim starts on Bruce’s hands. Silent. He’s learned from his own parents that children shouldn’t speak in situations like this, not unless spoken to.</span>\n</p>\n<p>\n<span>The wraps on Bruce’s hands are almost complete when Bruce finally speaks.</span>\n</p>\n<p>\n<span>“I don’t understand.”</span>\n</p>\n<p>\n<span>It isn't a question, so Tim doesn’t answer. </span>\n</p>\n<p>\n<span>“Tim, I’m sorry. I don’t understand…. Why are you still here? You’re not—”</span>\n</p>\n<p>\n<span>Robin is grateful that Bruce stops himself, but he holds no such notions anyway, heaving Bruce up to help him walk to the stairs.</span>\n</p>\n<p>\n<span>He takes a small breath and says, “I know I’m not your son.” Bruce doesn’t freeze, but he flinches in his assisted walk. Tim continues, “But I’m here because it’s my job, and you need me.”</span>\n</p>\n<p>\n<span>The rest of the trip is silent. Tim takes Bruce directly to his room before leaving to find Alfred. The butler is just emerging from the cave when they meet again. Tim stops a few feet away. </span>\n</p>\n<p>\n<span>“Goodnight, Alfred. I’m headed home.”</span>\n</p>\n<p>\n<span>Alfred looks like he wants to reach out, but Tim doesn’t see it from where his gaze is locked on the clock that sits over the doorway. </span>\n</p>\n<p>\n<span>“You could always stay, Master Tim.”</span>\n</p>\n<p>\n<span>And Tim smiles again, simple and sad, “That’s okay, maybe some other time.”</span>\n</p>\n<p>•</p>\n<p>This time, when he wakes up in the cave, there is no vertigo, pull, or toxin.</p>\n<p>\n<span>He wakes up in the medbay hooked up to an awful lot of machinery and promptly passes out again. Thankfully his sleep is dreamless and beautifully empty. </span>\n</p>\n<p>\n<span>Blinking his eyes open the second time is no easy task, and he can’t stay silent and take stock of himself as he’d like to. Instead, he alerts whoever’s with him of his awakened state and they curse and stumble up to the bedside clumsily.</span>\n</p>\n<p>\n<span>It’s Jason.</span>\n</p>\n<p>He looks terrible. And Tim has a sudden image of his broken body from his hallucination flash through his mind. </p>\n<p>\n<span>“I’m sorry,” Tim croaks with a shredded throat. It hurts to speak from the disuse.</span>\n</p>\n<p>\n<span>Jason’s brow furrows, “What the fuck, kid? You didn’t do any—…. Just…get better, and don’t get fucking nabbed again; that wasn’t fucking cool.”</span>\n</p>\n<p>\n<span>Tim can’t really process much of Jason’s words, but his tone sounds unhappy. It’s okay, though—Jason’s angry a lot.</span>\n</p>\n<p>\n<span>Tim needs to ask, though, since the recent dance with fear toxin has him worried. He slurs, “Ev’ryone okay?”</span>\n</p>\n<p>\n<span>Jason sighs with a slight smirk. He places a hand on Tim’s head and swipes his sweaty hair away, “Yea, Tim. Everyone’s okay. Spoiler and Robin were both benched, though. They wouldn’t sleep.”</span>\n</p>\n<p>\n<span>Jason pauses again, longer this time, and when he speaks again, Tim’s already passed out, “You scared us, Timbit.”</span>\n</p>\n<p>\n<span>He pats Tim’s arm from where it rests above the blanket and closes his eyes for a minute. Then he leaves to tell the rest of the family the news from where they are no doubt sporadically placed throughout the manor. </span>\n</p>\n<p>\n<span>The following few instances he reaches consciousness are uneventful. He can recognize faces as they come in and out, but he can barely hold a conversation for more than a few minutes. It doesn’t help that every time he sees any of the bats, he sees other versions of them, too. </span>\n</p>\n<p>Then, miraculously, about a day and a half later—Tim wakes up alone. He doesn’t squander the opportunity presented to him by a benevolent universe. He writes a note to assuage any further worries the family might have, and he leaves as quickly as he possibly can. </p>\n<p>\n<span>When he gets to the nest, he obsessively reviews his schedule and notes for the coming few months. The last few he’ll spend in Gotham full-time. Because it doesn’t matter if he loves the city or the people in it, it doesn’t matter that he was the happiest he’s been in a long, long time. It doesn’t even matter that some people…. That some people love him here. What matters is that everything and everyone here will be better off with him far away. </span>\n</p>\n<p>\n<span>It’ll be hard. It was always going to be hard, but </span>\n<em>\n<span>now</span>\n</em>\n<span> it’ll be harder, sure. But it’s the right thing to do. Nightmares can’t become a reality if you're not around for them to happen. The common denominators in Tim’s visions were him and Gotham city. So it’s time to leave, and he’s lucky enough to have already prepared the exit strategy. There’s no room for anything else in his head, and he’s blind to any tools that could help him change the course.</span>\n</p>\n<p>\n<em>\n<span>This is the only thing he can do.</span>\n</em>\n</p>\n<p><br>It's still much too soon in the year to ponder resolutions for the next one, but Tim thinks that he already has his big one picked out and is ready to implement it into his life.</p>\n<p>He wants to stop waking up in the fucking Medbay.</p>\n<p>The difference this time, when he groggily returns to consciousness, is that no voices are battling in the corner for him to overhear. The change makes him wrongly assume he's alone, so Tim is surprised when he finds that Dick is sitting next to him—a hand over his face. He looks… tired. Of the many things Dick Grayson can be, Tim doesn't know that he's ever seen Dick this tired. </p>\n<p>He's seen him nervous, energetic, bouncing off the walls. He's seen Dick after a long night—still joyful. Tim's seen him angry and so, so very vengeful. But never this. Never defeated. Never beaten. Never so completely exhausted.</p>\n<p>In his confusion, Tim continues to be silent, but Dick eventually hears his shifting in the cot. In any case, Red Robin still forces Dick to be the one to break the quiet with a soft \"…hey, kid.\"</p>\n<p>His fingers twitch as Tim answers with his eyebrows scrunched, \"Hi, Dick.\"</p>\n<p>The silence carries on even further as Tim looks away, and Dick looks at Tim. Dick shifts on his feet, understandably out of his depth. It makes the air in the room stiff and harder to breathe in. Dick is closer to thirty than twenty now, and he still feels like a child when it comes to reaching out—terrified of rejection, the idea of feeling unwanted still gives him the chills it did from all the way back then. But this risk is worth it. And it will always be worth it no matter what the answer may be at the end of it.</p>\n<p>“…Can I… hug you?” Dick is slow to say the words and freezes from reaching his hand out to touch Tim's shoulder halfway through the question. Halting it mid-air and stopping it from heading where it instinctively wants to land on Tim's shoulder. He doesn't know if it's welcome. </p>\n<p>Something desperate flips in Dick when he realizes Tim has to think about it, but it slows its churning at his little brother's small and resolute nod. </p>\n<p>The younger man is still trying to put together what happened to land him in the med-bay, so he rests his chin on Dick's shoulder when the older man all but climbs in the cot to engulf Tim in an all-consuming hug. They stay there, Tim trying to put his thoughts together—Dick soaking in the contact they haven't shared in an awfully long while.  </p>\n<p>It lasts—Dick doesn't move until Tim slowly but decisively removes his arms from where they were wrapped around his older brother. Now standing, Dick visibly puts on a braver face and asks a question he has to ask. </p>\n<p>\"How much do you remember?\"</p>\n<p>Tim has to think for a few long seconds before starting what he assumes is supposed to be a report. He doesn't notice Dick tense at his overtly formal tone. </p>\n<p>\"Batman and I were patrolling with route 19c as the guide; we intercepted mostly small-time crime and exposed Officer Geller for his involvement with the Maroni ring. Returning to the cave involved finishing reports, and I turned in some paperwork to Bruce, but….\"</p>\n<p>Dick's silence speaks for him, his frown lopsided as he watches Tim put together the last moments he can remember before he was made unconscious. Tim's silence ends softly, his incredulity breaking the formality of his tone, \"…holy shit. Did Bruce knock me out?\"</p>\n<p>“…Yeah… he did. But, like—no, I have no defense for it. How do you feel, though?\"</p>\n<p>Tim stares at Dick for a moment before deadpan replying, \"Like Bruce just knocked me out.\"</p>\n<p>\"Technically, he knocked you out hours ago,\" Dick states, but then decides to go back to his questioning, \"Are you able to walk? You have a couple of people who want to see you.\"</p>\n<p>Realizing that the whole \"Bruce knocking him out\" thing will have to be shouldered for the time being is a tough pill to swallow.</p>\n<p>He decides he's not going to.</p>\n<p>\"I want to see Bruce.\" It's harsh, and Dick startles a little at his tone. Dick wasn't expecting Tim to pick this fight, and Tim can't blame him. The fact that he's determined to deal with this surprises Tim, too. </p>\n<p>There's too long a pause, so Tim says again, \"I want to see Bruce,\" adding, \"He needs to explain this to me. Now.\"</p>\n<p>This time, Dick nods. Before he leaves, he leans in quickly to kiss the top of Tim's head and ruffle his hair. The action isn't entirely unfamiliar. Tim remembers it from before. Swiftly and gracefully, Nightwing is gone, hopefully retrieving Batman.</p>\n<p>Dick couldn't have known, but he drained Red Robin of nearly all his anger with the movement. Tim's eyes well up, and he rubs them quickly, trying to compose himself before they can return. He doesn't want to seem weak, and he doesn't want to explain. He just wants some answers, then to go home and figure out how to bring up leaving again. All his jumbled thoughts make his fingers itch for a computer screen—he wants to make a list.</p>\n<p>He's brought back from his thoughts by a fight outside the door. Jason and Dick are arguing. Tim only tunes in partway through the conversation, but the topic is easy to identify.</p>\n<p>\"—only wants to talk to Bruce right no—\"</p>\n<p>\"That's bullshit, and you know it, Dickbag. We all need to see him.\"</p>\n<p>\"Don't you think that'll be overwhelming?\" Dick tries to say lowly, but his fierceness makes his hushed tone carry. \"We'll get our chance soon, but he asked for Bruce.\"</p>\n<p>\"Yeah, well, right now, I'm not sure <em>Bruce</em> can damn well handle himself around the kid.\"</p>\n<p>And Tim's about to get up and find Batman himself when someone else speaks softly.</p>\n<p>\"Jason's right,\" Bruce sighs, \"I've made it very clear that I'm not exactly adept at handling this particular situation.\"</p>\n<p>Someone snorts, and Tim knows it's Stephanie even before her comment leaves her mouth, \"Way to make an understatement, old man.\"</p>\n<p>As he hears Bruce's voice, he can't stop himself from standing up from the bed and trudging to the entrance. Tim doesn't mean to swing the doors out dramatically, but that's kind of the side effect of falling through them when his knees buckle. </p>\n<p>Before he hits the ground, though, there are hands on him. Bruce's hands are holding him up, and then he gently follows him to his knees. Too gently. </p>\n<p>Tim rears back as far as he can while still using Bruce's body to lever himself upright.</p>\n<p>He gets straight to the point, \"What the fuck was that earlier?\"</p>\n<p>Bruce pauses, searching Tim's face, and Tim sees emotions there he can't decipher. He thinks it's something close to fear, but Bruce has nothing to be scared of here. It doesn't make any sense, and Tim just wants to understand.</p>\n<p>\"I knocked you out with the gas capsule you finished last week,\" and after a beat, \"Good work on those, by the way.\"</p>\n<p>Behind them, Jason mutters, \"oh my god, what the fuck?\"</p>\n<p>Tim doesn't have time to pay attention to that and redirects his attention back to Bruce, reforming his strategy all the while. \"Okay. <em>Why</em> the fuck did that happen earlier?\"</p>\n<p>Bruce takes a deep breath, and Tim thinks it hurts the man to stand there and think about stringing together an explanation. Tim could sympathize, but he won't yet. Maybe later.</p>\n<p>\"I thought you were going to leave.\"</p>\n<p><em>Shit.</em> </p>\n<p>The way Bruce's words left his mouth made Tim's face contort in confusion first before mild resignation. He also doesn't understand why his leaving is a problem. He leaves all the time. People leave all the time. Bruce needs to use his words if he actually wants Tim to understand his reasoning. Tim's too tired to figure it out on his own and too resigned to feel wrong about demanding some clarity. He sighs deeply and bluntly says, \"Please just use your words, Bruce. I'm kind of having a rough go of it right now. In part because you fucking knocked me out.\"</p>\n<p>\"I'm working on the words. And sorry about the capsule. You obviously don't have to, um… forgive me about that. There's a plan and everything if you're willing to listen. But first—\" Bruce says softly as he deftly pushes his arm under Tim's legs and lifts him up into the air.</p>\n<p>Tim squeaks and feels abruptly nostalgic for those last few years of being Robin. He scrambles for purchase around Bruce's neck, and the older man just ducks his head so Tim's hands can find each other behind his neck. Tim huffs in annoyance but stays silent—he doesn't know how long it would've taken to get himself to the table. Bruce certainly doesn't seem to notice that Tim should be heavier now than he was as a child by quite a measure. He's Batman, so he wouldn't show it, even if he did notice. It's been a long while since Bruce has carried him… or well.</p>\n<p>It's been a long while since Bruce has carried him while Tim's been aware of it.</p>\n<p>Once Tim's deposited in a chair, Bruce looks around at the rest of the family sprinkled about the cave too casually to be unplanned. His brow pinches.</p>\n<p>\"Where are Duke and Damian?\"</p>\n<p>Cass answers him softly, \"Duke's trying to get Damian to come down.\"</p>\n<p>Tim's confused at the worried looks that pass around the cave. He gets the feeling that everybody here knows something that he doesn't know. He hates that feeling. It itches below his chin and down his throat—uncomfortable and cloying. Ignorance has always made him anxious, and not knowing is the only thing worse than being burdened with knowledge. Some people prefer it the other way around, but when Tim doesn't know something he feels he should, <em>he can't sleep.</em> </p>\n<p>Bruce just nods like that answer makes sense and replies softly, \"I'm sure they'll be here soon if everyone else wants to take a seat.\"</p>\n<p>Most of them come over quickly and sit down just as fast. Some of them seem more eager about it than others. Jason, in particular, huffs his way to the seat next to Tim and whispers, \"If this makes me cry, I'm gonna steal, like, a million dollars from him.\"</p>\n<p>Tim looks abruptly at Jason and whispers back, \"why would this make us cry?\"</p>\n<p>Beside him, Jason side-eyes Tim and mutters, \"For someone so goddamn smart, you really can't even make a little jump from point A to point B, can you?\"</p>\n<p>Before Tim can reply, the Elevator opens, and Duke comes in with Damian in front of him, pushing the younger forward. Damian clearly doesn't wish to be there but stiffly walks towards the table anyway. He drops into the chair farthest from Tim and won't even look at him. Duke drops next to Stephanie, promptly closes his eyes, and tilts his head back. He'll open them in a second, but he needs the moment before Bruce clears his throat awkwardly. </p>\n<p>Bruce stands uncomfortably by a midsized monitor that Alfred must've found somewhere, and he clicks a small button on the remote he's holding in his hand. </p>\n<p>Tim's small intake of breath is the only indicator that he can read the screen that lights up in front of the table.</p>\n<p>Bruce shuffles before inhaling deeply and reading the words on the screen. \"Emergency Family Meeting. Subject; I think my son Tim Drake doesn't know he's my son.\"</p>\n<p>Bruce clicks to the next slide quickly. It's labeled \"itinerary.\" The slide deck is starting to resemble a case briefing. Steph and Jason both huff out a small laugh. </p>\n<p>There are five steps that he reads off and informs the family of. </p>\n<p>\n<em>Evidence, Theories, Objective Facts, Additional Information, and Closing Statements.</em>\n</p>\n<p>The evidence slide consists entirely of Tim's paperwork, both the stack given to Bruce and the resume he sent out to the entire Justice league. Everyone at the table is familiar with the main document, but they stiffen at the resume. It's news to all but two of them. Bruce only focuses on it for a short time, switching to his next point of topic quickly. </p>\n<p>The man stumbles through the next part. Fumbling his words around what seems to be lumps in his throat. He talks about a lot here, covering ground that Tim himself had put past them years ago. It is in this section that Bruce Wayne nearly breaks down the most. </p>\n<p>Tim is so lost in shock that he doesn't notice when Bruce stops talking from across the room and starts talking from a foot away, shaking his arm in a light hold. </p>\n<p>\"...Tim, are you alright? Are you… are you here?\"</p>\n<p>Everyone else is quiet when Tim says, \"I'm here. I just…\" and he looks away from Bruce, avoiding the eyes around him, \"I don't get it.\"</p>\n<p>Bruce's shoulders drop, and he kneels beside Tim, tilting his son's head towards him to look him in the eyes. What he finds must change his mind about something because he powers off the slideshow without even looking back at the screen.</p>\n<p>\"Hey, kiddo.\"</p>\n<p>\"Hi, Bruce.\"</p>\n<p>\"You gotta tell me what you don't understand so I can make it better.\"</p>\n<p>Tim's an adult. He's an adult who isn't going to cry right now. The tears that well up in his eyes don't fall, and he speaks past the rock in his throat. </p>\n<p>\"It's like. I'm trying to do the right thing here. You don't need me anymore. I'm trying to be practical. I don't understand. Can't you see the logic?\" Tim takes another breath to continue, but when he looks at Bruce, he stops. Bruce looks broken. There's a crack in his expression that Tim hasn't seen in many, many years. </p>\n<p>The look in Bruce's eyes forces the last thing Tim wanted to say to come forth as a whisper–stilted and awkward with a twinge of desperation, <em>\"I had a plan,\"</em> his words turn pleading with his next breath, \"I need to be somewhere I can be useful. I need that.\"</p>\n<p>The broken look in Batman's eyes intensifies even further at the rush of soft words, and he grips Tim's shoulder tightly before letting go and rubbing his hands over his own face instead.</p>\n<p>The silence in the rest of the room reflects how quiet their little family can be when the moment calls for it. Not a breath is out of place; instinctively, they follow Bruce for a rhythm, slow and silent. The only one out of place is Tim, and it makes the boy cringe further; panic more. He feels the divide like it's a physical thing, and he wants to claw at it like a caged animal.</p>\n<p>The room itself seems to hold its breath for Bruce's reply. And when he opens his mouth, he knows, he already knows it'll be inadequate. </p>\n<p>He knows, but still, he has to try, \"Okay. Okay, Tim\", and his son, still catching his breath, tries to look away when Bruce calls his name, so Bruce continues with, \"Hey, I <em>need</em> you to look at me, okay.\"</p>\n<p>Tim looks back.</p>\n<p>It breaks Bruce's heart. </p>\n<p>\"Thank you, kiddo. I want you to remember what I'm going to say next, okay?\" he waits for the tiny nod, \"You're my son.\"</p>\n<p>Tim's breath catches again, but Bruce pushes forward. \"I don't need you to be useful. I just need you to exist; that's part of my job. Not the one we do at night, either. I mean the important one. The one where I care about all of you.\"</p>\n<p>Bruce choosing those words had been incredibly deliberate, each selected with care and slowly said. His following words tumble out with less thought, but he means them just as much.</p>\n<p>\"And that obviously doesn't mean that you can't go. No matter where you are, you're still going to be my son, and I will be so proud of you. It's just that when you gave me that file, it felt like you didn't know any of that. And it sent me into a panic over the fact that I failed in the act of not making it absolutely clear to you. You don't need to be useful, or a hard worker, or even incredibly smart in order to earn the right to be loved. You're just loved. No conditions. And you are all of those things and more. They're part of what makes you you, and I do love that. But I'd love you without any of it, just because you're you and because you're mine.\"</p>\n<p>He's almost out of breath, and Tim is breathing heavier too, but Bruce needs to say his final point. He needs Tim to hear it.</p>\n<p>\"And I know you came into my life differently. And that I was different then, too,\" he winces at his own simplification, but he knows that Tim can remember just as well as Bruce can, \"But just because you were the one to choose me first does not mean I didn't choose you too. <em>I did</em>. I did, Tim. I was just an idiot who assumed I didn't have to use my words.\"</p>\n<p>Tim hiccups wetly and shakes apart just a little. He's so close to crying, and not a single person in the room knows what to do.</p>\n<p>Bruce almost doesn't hold him. </p>\n<p>He almost doesn't pull Tim into a hug and cry with him. Cry first, even. But he does. And the second Bruce has him firmly in the circle of his arms, Tim also cries in earnest. </p>\n<p>The first person to join them is Cass. She doesn't shove Bruce over, but she does get in between them. </p>\n<p>\"Hey, Brother,\" is what she lands on softly before settling against Tim's side, beckoning Stephanie over to join.</p>\n<p>The blonde doesn't wait, and on her way over, she bounces with her words, \"You're gonna make me cry, Boy Wonder.\"</p>\n<p>Tim answers her softly, the first words he's spoken since bursting into tears, and they are nasally and embarrassing, \"Join the club, Girl Wonder.\"</p>\n<p>When she leans over his shoulders, she confidently tells him he's an idiot. He laughs. He laughs, and he loves her so very much. That's his best friend. He should've never lied to her. And she should've never expected him not to. Forgiving each other has always come easy to both of them, though. It has to be after so much practice.</p>\n<p>The two girls let him go and step back, their hands lingering on his shoulders before they fall away, and Stephanie flicks the back of his head softly. Bruce is still in front of him, tearful but with a small smile adorning his face. </p>\n<p>He leans back slowly, still holding one of Tim's arms, and mouths, \"…okay?\"</p>\n<p>\"It's okay if I'm not, right?\"</p>\n<p>\"Of course it's okay…. You have a couple people who might want to talk to you,\" he replies, and then, \"Is that okay?\" </p>\n<p>Tim has to think about that. He turns to see the rest of his family. Most of them are sitting; Damian's even turned away. Jason, however, was clearly in the process of walking over before stopping a couple of feet away—overtly casual, and Dick was frozen behind him, his bottom lip pulled into the left side of his mouth—nervous.</p>\n<p>Tim turns back to Bruce and quickly nods before standing up. Jason must have decided his waiting was over because just as Tim sways on his feet, he's pulled into a violent hug. Jason dwarfs him, as he always has, and Tim lets himself unstiffen from the surprise and hugs his older brother back. </p>\n<p>\"I hope you know the Outlaws travel, and wherever you go, I'll always be a call away and less than 10 minutes by alien princess travel.\" </p>\n<p>Jason squeezes him tighter still, \"But you know, maybe stick around. I can't keep you here, but I can give you a handful of reasons to stay,\" and then he backs away and pointedly moves his eyes across the rest of the family from where each of them are; either pretending to not be listening or shameless in their undivided attention.</p>\n<p>Tim lets out a small chuckle before gaining the courage to look at Dick. Dick is still frozen, Tim's laugh made him flinch, but he still hasn't moved any from where he stopped four feet away. </p>\n<p>The distance feels like miles, dangerous terrain, and it seems impossible to cross from his perspective. And then suddenly, all at once, Tim finds himself done with his own bullshit. It isn't miles; it's four feet. And Tim, above all else right now, really, really wants to hug his oldest brother. He does cross the distance then and flings himself up into Dick's arms. The acrobat catches him quickly, instinctively. His arms tighten, and he buries his face in Tim's hair.</p>\n<p>A whispered \"I miss you\" passes from Dick to Tim, and Tim burrows deeper.</p>\n<p>\"I miss you, too,\" is the small reply back, followed by an even quieter, \"I love you, too.\"</p>\n<p>Dick signs sadly above him before hesitantly saying, \"You don't have to forgive me to love me, okay? You… um. You never have to do that.\"</p>\n<p>And Tim looks into his older brother's face and tells him the truth because they deserve the truth after all this; Tim thinks, \"I want to, though. I don't know how long. But I want to.\"</p>\n<p>A breath punches out of Dick, and Tim can feel it. He has to let go of Tim's back to rub a hand on his face, and then he puts it on Tim's shoulder with a squeeze, \"Then I'll work on deserving it, and you work on letting me?\"</p>\n<p>Tim answers with a tiny affirmation, frantic and wanting. He is so emotionally drained, but there's more to do. He turns to Duke and Damian next, still next to each other. Duke looks at Damian, still turned away, and he sighs. \"Look. I imagine that this is something we'll have to talk about for a while. So I want to get it out of the way that I do want to work through it. But just to put it out there, I don't like that you taught me to hack better because you wanted to leave. I wanted it to be because we're brothers. So, um. I'm mad about that, I think.\"</p>\n<p>Tim swallows again, fidgeting with his hands. He looks down and then forces himself to look at Duke when he says, \"I'm sorry, then. I uh. I didn't think it would hurt you.\"</p>\n<p>Duke snorts and stands. </p>\n<p>\"Yeah, well, you can be an idiot.\" Tim's heart clenches a little at the words, but the pressure releases when Duke starts speeding to him for his own hug. \"It's okay to be an idiot sometimes, but never do that again, maybe.\"</p>\n<p>Tim looks up from his hug with Duke towards the chair Damian was sitting in, but it's empty. No sign of the kid. He's fast. And he was trained to slip away like that. Something like fear washes over him, and once Duke lets go, Tim cranes his neck around the room in a panic, alerting everyone else to the missing teen. </p>\n<p>He almost devolves back into heavy breathing when strong arms reel him in to face a perfectly tailored suit. </p>\n<p>Alfred.</p>\n<p>Tim slumps forward. Sternly, Alfred asks just one question, \"We will have time to talk, yes?\"</p>\n<p>Tim nods into Alfred's suit. He thinks he's getting tired of nodding today. </p>\n<p>Alfred continues with a sigh, \"Alright, then I believe Master Damian is headed to the roof outside his window. He may already be there.\"</p>\n<p>When Alfred lets him go, Tim feels weak all over, not because Bruce knocked him out, which he and Bruce will probably have to talk about again. </p>\n<p>Tim finally processes Alfred's words—his directions to Tim's smallest sibling, and he falters yet again. Damian only does that when he's upset. He looks up at Alfred and tiredly sighs, \"You think he'll see me? We probably should talk.\"</p>\n<p>Alfred looks at Tim for a second before falling into something more comforting, \"I believe he wants to see you. However, he might find it difficult. Best get a move on, Master Timothy.\"</p>\n<p>So Tim does. He gives a little wave, Stephanie pulling him into a last hug. And when he turns, Alfred wryly informs him, \"And you 'probably should talk' to everyone when you get the chance. I imagine it will be very awkward, yet necessary.\" He softens at his last words, \"When you and I talk, we can discuss where you'd like to go if that is still your preference.\"</p>\n<p>The tear that's been welling in his left eye falls at Alfred's offer, and he says, \"Thanks, Alfred.\"</p>\n<p>The walk up to Damian's room feels as if he's moving through deep water. Still, he takes each step with mounting determination until he gets to the family hall. He passes Dick's room, across the Hall from Bruce's, then Jason's. Tim pauses at his own door. He's used the room a lot over the past year and a half. And through all that time, and all the time before that, he never really registered that it's been his for a few years short of a decade. Before he even lived in the manor, his room had been in the <em>family hall</em>. He used to think it was simply for convenience, but now… now he thinks he got a lot wrong. Not everything; he knows he was valid in the things he felt—but still a lot. He believes he ignored things that could've given him pause. Willfully not seeing the facts that would have disrupted his assumptions and theories. </p>\n<p>Down to his very core, Tim Drake has never really felt like much of a son. He <em>knows</em> he loved his parents despite everything, and he even thinks his parents loved him, too. He just doesn't know how much of it there was to go around in the Drake Mansion. After all, Jack and Janet had a child for the same reason the average couple bought a white-picket fence; the optics. He's been a prop his entire life, a tool. And maybe he couldn't recognize the transition from tool to son from simple lack of experience. Maybe it was a lot of things.</p>\n<p>He feels like Bruce's kid right now. He feels like he's been Bruce's kid for a while. He feels like a Grandson, and a best friend, and a brother, too. </p>\n<p>He feels like <em>Damian's</em> brother, walking towards his door to have an uncomfortable conversation. He thinks he might've messed up that last part, but he believes he can fix it, given a chance. </p>\n<p>He bites the inside of his check outside Robin's door, but he doesn't waste time. Something in his gut tells him they've wasted enough of that already, so he knocks. </p>\n<p> </p>\n<p>\n<span>Damian doesn't answer the door right away, and Tim… well, Tim's not going to open it uninvited. He doesn't like to cross lines anymore, especially with kids like Damian. Kids like Tim, who had to get used to people crossing their lines without thought as young children. In truth, Tim had made excuses for it in his youth. He told himself he didn't deserve privacy or respect because he was a kid, and kids don't get a say. He learned differently later on. He knows that because of Bruce, and because of Dick, and because of Alfred. Damian should get the chance to learn it, too. Instead of coming into the room, he presses his back firmly to the thick oak-wood slab and slides down the grain until he reaches the floor. His legs stretch out halfway across the hall, but he's not worried about being an inconvenience. No one will attempt to interrupt unless a fight breaks out.</span>\n</p>\n<p>\n<span>Logically, there's a non-zero chance of that happening within the upcoming interaction. Yet, Red Robin has faith that it won't come to that. Maybe it's somewhat misplaced faith, but Tim believes it isn't. He believes in his little brother.</span>\n</p>\n<p>\n<span>Another knock sounds from Tim's hand, held up beside his head and loudly rapping on the door behind him. Tim listens intently for a few minutes and discovers he can hear the breeze from the open window if he concentrates. Every once in a while, Tim will pick up a ripping sound and a small, muted splash. He almost laughs out loud when he realizes that Damian is ripping shingles from the roof and throwing them into the pool below.</span>\n</p>\n<p>\n<span>It's so very childish and so very stubborn, and Tim loves this kid so much that he wants to scream.</span>\n</p>\n<p>\n<span>Despite the size of the manor, the families' rooms are relatively small. Tim's sure if he projected his voice even slightly, Damian would hear him through the wood and out the window. So, there is no excuse for why he gives Damian five more minutes of alone time except for his own nerves and cowardice. He tries to convince himself that it's definitely for the kid and not for him. Tim is doing just fine, breathing forcibly steady on the floor in the hallway. He dips his head into his chest and curls his legs closer to his body. Tim's knees come up near his face before he lifts his head again and softly clunks it against Damian's door.</span>\n</p>\n<p>\n<span>He takes one last deep breath before he finally speaks.</span>\n</p>\n<p>\n<span>\"Hey, kid. Can I come in?\"</span>\n</p>\n<p>\n<span>There's no answer, so he tries again.</span>\n</p>\n<p>\n<span>\"Damian, I think we need to talk, okay?\"</span>\n</p>\n<p>\n<span>Tim sighs deeply at the continued silence. </span>\n</p>\n<p>\n<span>And then he begins.</span>\n</p>\n<p>\n<span>\"I uh... I know you're angry at me for some of the things that happened today\" Tim can hear the violence in the latest shingle torn from the roof, and the splash is louder, harder. </span>\n</p>\n<p>\n<span>At least he can confirm that he's being heard. </span>\n</p>\n<p>\n<span>\"I don't want you to understand why I feel the way I do, because I want to protect you from ever feeling like that. There is not a single bad thing in this, or any universe, that I don't want to keep far from you. You um… You have to know that before I keep talking….\" Tim bites the inside of his cheek before he takes this next risk. </span>\n</p>\n<p>\n<span>\"And you have to let me know you heard what I just said because if you didn't, I can't talk to you about the rest of it.\"</span>\n</p>\n<p>\n<span>And for a minute, there is nothing between them but silent breaths and the slow breeze whistling through the window Damian sits outside of. At first, Tim's heart sinks just a little further into his stomach, but then he realizes that he can't hear the splash of shingles in the pool or the tell-tale crunch of when they are torn from the roof, either. </span>\n</p>\n<p>\n<span>Miracles exist, Tim is sure of it; he hears the scrape of Damian moving into his bedroom and closing the window. Nothing more. </span>\n</p>\n<p>\n<span>But it's good enough. Tim wants Damian to know that he has always been enough.</span>\n</p>\n<p>\n<span>His following words are relieved, but they transition back to serious as he continues, \"Thank you, kid…. A year and a half ago, Ra's Al Ghul had me shot with two bullets engraved with his name. When I woke up in the Med-bay, I heard a part of a conversation while recovering from the concussion after the shadow's attack.\"</span>\n</p>\n<p>\n<span>\"I know you remember this because we talked about it during the night I taught you to work my surveillance camera. I…. Okay,\" he has to breathe and start again, \"I needed to get out after overhearing what I did. Not because it was horrible, or unforgivable, or even overtly mean. I needed to leave because I felt misplaced and alone.\"</span>\n</p>\n<p>\n<span>Damian's footsteps are near silent, so Tim startles when he hears the soft thump of Damian's back on the other side of the door, probably mirroring Tim's own position. It bolsters him to continue on, even though he barely dissected his emotions back then. He held on to logic to keep himself afloat. He should probably say that to Damian. </span>\n</p>\n<p>\n<span>\"I… I feel that way a lot. Right now, it comes and goes in waves, but, um. When I was a kid, I felt it all the time. My parents were…. They could be good people from time to time, but. I don't think they were ever supposed to be parents. And after they had me, well. I think they might've come to the same conclusion. Back then, the thing that got me away from that feeling was being Robin…. When I used to take photos of Batman, I once heard Jason say that Robin was Magic.\" There's a small huff from Damian's side of the door, and Tim chuckles a little before sobering. </span>\n</p>\n<p>\n<span>\"You know, he used to say stuff like that a lot. Before.\"</span>\n</p>\n<p>\n<span>\"Anyway, he was right. He is right. Being robin saved me. It gave me purpose and a job to do. I became dependent on it, I think. The logic behind being a hero helped me put away everything else, and I was good at it. Better than I am now, even. And it was safe up until the moment it wasn't.\"</span>\n</p>\n<p>\n<span>\"I couldn't put away the death that kept happening around me. My friends, my family. Your dad. And the way I dealt with all of it—what I turned to when I needed to navigate grief and pain—it was taken away.\"</span>\n</p>\n<p>\n<span>Tim can feel the tension in the air that his last confession has created. He can tell that Damian knows precisely what he means. And the unspoken fact remains glaringly unsaid. </span>\n<em>\n<span>Robin was only taken away from Tim so that Damian could have it.</span>\n</em>\n<span> </span>\n</p>\n<p>\n<span>He needs to explain something important before Damian does something like feel guilty over it. That's not what Tim wants out of this. So he interrupts his story for an aside that may feel out of place but desperately needs to be said, \"You deserve to be Robin, Damian.\" An intake of breath surprises Tim for just a moment before he powers forward. </span>\n</p>\n<p>\n<span>\"You even deserved it back then, despite being a little bit of a shithead. Making you Robin was one of the best decisions that Dick ever made, and I am so glad that it happened. You needed Robin, and it saved you, too. I could never regret that. But just because you were ready to become Robin when you did, doesn't mean that I was ready to give it up,\" he takes another deep inhale and listens to Damian's breaths on the other side of the door. They are deep and unsteady, but Tim has come this far, so he goes on.</span>\n</p>\n<p>\n<span>\"And then I was alone again. I found purpose in finding Bruce, in saving him. The job has always been what kept me going. It kept me </span>\n<em>\n<span>here.</span>\n</em>\n<span>\" </span>\n</p>\n<p>\n<span>Tim lets himself take a moment and then gives up on keeping these next words to himself.</span>\n</p>\n<p>\n<span>\"Damian, I feel useless here, and it's not. That's not new. And it… it hasn't stopped. I need to be somewhere where what I can do matters and is needed. And I </span>\n<em>\n<span>know</span>\n</em>\n<span> that Bruce said he just needs me to exist, but what if that's not what I need? Simply existing isn't </span>\n<em>\n<span>useful. </span>\n</em>\n<span>What if what I need is to be needed more than that?\" Tim's just about to lose his composure and spiral a little—too many thoughts prick at the back of his eyes, and all the things that make him feel small threaten to close his throat. </span>\n</p>\n<p>\n<span>He falls backward into the open door and hits his head on the carpeted floor. Damian stands above him, stricken. It takes every thought threatening to swallow Tim and banishes them to the floor beneath him. His mouth is dry, and his throat itches with discomfort. He can't say any words at all, but </span>\n<em>\n<span>this</span>\n</em>\n<span> is his chance, and he's fucking it up. </span>\n</p>\n<p>\n<span>Damian doesn't seem to notice as he stares into Tim's face intently before whispering, \"You don't think I need you?\"</span>\n</p>\n<p>\n<span>On the floor, Tim's mouth falls open, and his face slackens in shock. Damian takes that for what it means. </span>\n</p>\n<p>\n<em>\n<span>Tim didn't.</span>\n</em>\n</p>\n<p>\n<span>・</span>\n</p>\n<p>\n<span>Damian wants to scream at him. He wants to throw a tantrum and kick the man lying at his feet. And two years ago, he wouldn't have wasted the fucking chance. </span>\n</p>\n<p>\n<span>・</span>\n</p>\n<p>\n<span>The place in his throat right behind the roof of his mouth feels clogged and full of cotton. His eyes hurt, and he's angry. He's tried so hard for so long to stop being so angry, and Tim has ruined his progress. When he stormed back upstairs, he assumed he wouldn't see Tim before the older boy left Gotham. The moments that everyone seemed to have with him were beautiful, sure, but no one else seemed to notice the one thing that Damian did. </span>\n</p>\n<p>\n<span>Tim never took any of it back. </span>\n</p>\n<p>\n<span>He can apologize all he wants and regret </span>\n<em>\n<span>how</span>\n</em>\n<span> he went about it all he wants, but it doesn't matter because he's still going to </span>\n<em>\n<span>leave.</span>\n</em>\n<span> He's going to leave, and no one but Damian can tell that nothing </span>\n<em>\n<span>has changed</span>\n</em>\n<span> with their big emotional moments. His father's meeting ended in vain because Damian recognized the expressions Tim wore during nearly every second. He saw it in Tim's face nearly every week over the course of the last year, and every single time he saw it then—that it </span>\n<em>\n<span>changed Damian</span>\n</em>\n<span>—was a </span>\n<em>\n<span>lie</span>\n</em>\n<span>. Why would it be any different just because of a few hugs and a couple clumsy words?</span>\n</p>\n<p>\n<span>Damian has no idea what was genuine and what Tim did just to check boxes on leaving, and it makes Damian tear up even now. And tearing up makes him want to smash something. And wanting to hit something fills him with shame, immediately turning to anger and violence as the most comfortable response. </span>\n</p>\n<p>\n<span>The confusing roil of emotions in his chest only worsens when Tim starts talking about his thought processes. He demands that Damian acknowledge him before he continues, and the younger boy wants to ignore him so badly. He doesn't. He hates that he doesn't, but he climbs into the room and closes the window anyway. Tim notices, and as he continues on, Damian stares at the door from across the room and prepares to leave the moment Tim's words prove not to be worth the time. </span>\n</p>\n<p>\n<span>Something close to understanding washes over Damian when he walks over to the door and places himself on the other side of it, back to back with Tim. He's mad. He's so furious still. He can be two things at once, though, and the other feeling—that one is camaraderie. No matter what Tim supposedly wants to protect him from, Damian knows what it is like to be out of place. He is achingly familiar with loneliness. </span>\n</p>\n<p>\n<span>He didn't know Tim still felt that way even now. He thinks he has seen it before. He thought that had changed recently. He felt he helped to change it.</span>\n</p>\n<p>\n<span>Damian feels broken open by the time Tim actually pauses in his speech. Can feel the tension over the moment as his older brother mulls over everything he's said. Damian doesn't understand how Tim could've gotten everything so wrong. He pulls open the door and asks his question, and the utter silence from Tim is answer enough. </span>\n</p>\n<p>\n<span>Arms flair as Damian spins on his heels and stalks back into his room before twisting around again and staring at Tim as he scrambles to face the younger boy.</span>\n</p>\n<p>\n<span>\"You are so insanely thick that it makes me feel unhinged. I </span>\n<em>\n<span>needed</span>\n</em>\n<span> you even before your hair-brained scheme made you act like you cared about me. What the fuck were you thinking all this time?\"</span>\n</p>\n<p>\n<span>Tim interrupts with a quick rebuttal, \"Caring about you isn't an act!\" but he closes his mouth resolutely at the glare Damian pins him with. </span>\n</p>\n<p>\n<span>Damian seethes, \"I have spent all my life grappling with the intricacies of how to be worthy of love and affection. I was always taught that love depended on service and that it had to be hard-earned through trials. Proving myself was the only path forward, and father wasn't the one who changed my opinion on that. I </span>\n<em>\n<span>still</span>\n</em>\n<span> try to prove myself to him </span>\n<em>\n<span>and</span>\n</em>\n<span> to Grayson. I have to be </span>\n<em>\n<span>better</span>\n</em>\n<span> than I am. I have to be </span>\n<em>\n<span>good</span>\n</em>\n<span>. Behaved. Careful. But </span>\n<em>\n<span>you</span>\n</em>\n<span>. I could return to Nanda Parbat </span>\n<em>\n<span>today</span>\n</em>\n<span>, and </span>\n<em>\n<span>you</span>\n</em>\n<span> would still love me. Or at least, that's what I thought you would do.\"</span>\n</p>\n<p>\n<span>Damian takes a deep breath and explodes, \"I threw you from a dinosaur. Cut your line. I have </span>\n<em>\n<span>never</span>\n</em>\n<span> once caught you, even though recently, I have </span>\n<em>\n<span>tried.</span>\n</em>\n<span> Drake, out of everything I ever hoped for out of this tortuous journey through unlearning everything I've ever known, I never once expected forgiveness from you. Not once.\"</span>\n</p>\n<p>\n<span>\"I thought I had it, too. You gave it freely, without me asking. I thought it impossible, so I didn't even try. But you gave it to me anyway, and it took me weeks to trust in it, but </span>\n<em>\n<span>I did</span>\n</em>\n<span>. Do you know what that meant to me?\"</span>\n</p>\n<p>\n<span>He turns back from the minor pacing he started halfway through his words and waits for Tim to shake his head. </span>\n</p>\n<p>\n<span>\"It meant everything,\" Damian looks away, \"and now I know it meant nothing.\"</span>\n<span> </span>\n</p>\n<p>\n<span>Even Tim is startled by the \"No!\" that rips from his closing throat.</span>\n</p>\n<p>\n<span>He is met by two wide, green eyes.</span>\n</p>\n<p>\n<span>Tim surges upward and moves to grip Damian, but the younger boy moves away. He bites his lip but continues.</span>\n</p>\n<p>\n<span>\"Kid, you are amazing. You are so, so strong, and I am lucky to have been a part of your life. You are loved wholly and without condition, and you aren't the issue here.\"</span>\n</p>\n<p>\n<span>Damian scoffs, disbelieving, so Tim acquiesces.</span>\n</p>\n<p>\n<span>\"Okay, in the beginning, the things you have done were a part of it. That was 18 months ago, and we hadn't worked through any of our shit.\"</span>\n</p>\n<p>\n<span>\"Clearly, we </span>\n<em>\n<span>still</span>\n</em>\n<span> haven't worked through any of our shit, Timothy.\" Damian icily replies.</span>\n</p>\n<p>\n<span>Blue eyes bore into Damian at that, and Tim is calm for just this one moment, \"You know that's not true.\"</span>\n</p>\n<p>\n<span>It's simple. Stated as fact. Tim doesn't think Damian can argue with it. </span>\n</p>\n<p>\n<span>Damian proves him wrong with an absolutely wretched, \"</span>\n<em>\n<span>I </span>\n</em>\n<span>don't know anything.\"</span>\n</p>\n<p>\n<span>It stops the older brother completely. He walks around slowly to where Damian is facing the far wall, not making the mistake of trying to comfort him through touch again. Not yet.</span>\n</p>\n<p>\n<span>\"I'm telling you right now that my original motivations mean very little to me when I think about this last year and a half. I'm telling you right now that loving you and the rest of the family is exactly why leaving is so difficult to do.\"</span>\n</p>\n<p>\n<span>Damian looks like he wants to shout, but instead, he speaks, \"then why are you still trying to leave?\"</span>\n</p>\n<p>\n<span>\"Because I need you all to be </span>\n<em>\n<span>safe</span>\n</em>\n<span>.\"</span>\n</p>\n<p>\n<span>For just one second, Tim thinks he broke Damian. The younger boy looks at him incredulously as if he spontaneously sprouted vines and revealed himself as a distant cousin to Poison Ivy.</span>\n</p>\n<p>\n<span>The kid walks towards Tim for the first time since they started arguing in earnest, \"What are you talking about?\"</span>\n</p>\n<p>\n<span>Alarm covers Tim's face in its entirety, and Damian realizes something undeniable at that moment; </span>\n<em>\n<span>Timothy hadn't meant to say that.</span>\n</em>\n</p>\n<p>\n<span>Damian can sense when Tim is about to backtrack and cuts his hand through the air between them. \"No! No, you will tell me</span>\n<em>\n<span> exactly</span>\n</em>\n<span> what you meant, or you are</span>\n<em>\n<span> leaving now.\" </span>\n</em>\n<span>He points rigidly out the open door.</span>\n</p>\n<p>\n<span>It's one of the most prominent bluffs Damian's ever given out, but Tim doesn't have to know that.</span>\n</p>\n<p>\n<span>•</span>\n</p>\n<p>\n<span>Damian's bluffing. Tim can see it in the slight twitch of his hand, but the ultimatum still scares him. Damian would follow Tim out of the room if he left right now after being told to, but the boy wouldn't forgive him afterward. Maybe, just maybe, if he's completely candid, Damian will understand.</span>\n</p>\n<p>\n<span>\"...Damian. I make things complicated. And sometimes, I make things dangerous. I've been reminded of that recently, and I can't be the reason any of you die.\"</span>\n</p>\n<p>\n<span>Damian peers at him with a furrowed brow before leaning back on his heels and softly speaking in the air around them, \"It must have been something truly terrible to scare you this way.\"</span>\n</p>\n<p>\n<span>Tim lets out a breath before vigorously nodding, \"It was unthinkable, kid.\" Tim thinks he finally got through to the kid, but Damian surprises him for the final time that day.</span>\n</p>\n<p>\n<span>\"It's a shame that I'll have to leave, too. Maybe I'll ask Jon for a key to the fortress or see if Collin can save a space wherever he is. Now that I think of it, my mother's place always has extra rooms. I wonder if she—\"</span>\n</p>\n<p>\n<span>\"What are you talking about?\" Red Robin interrupts.</span>\n</p>\n<p>\n<span>\"Well, Drake. I make things complicated, and sometimes, I even make things dangerous. It'd obviously be better if I left; it'd probably be safer to never speak to my family again, too, so I just won't tell them until two weeks before leaving them behind,\" Damian spits Tim's own words in his face. Tim surprises himself when he </span>\n<em>\n<span>gets it.</span>\n</em>\n</p>\n<p>\n<em>\n<span>Shit.</span>\n</em>\n</p>\n<p>\n<span>\"…Damian.\"</span>\n</p>\n<p>\n<span>The teenager steps up to the challenge, \"Drake.\"</span>\n</p>\n<p>\n<span>If he had to guess what his head would feel like in a moment like this, his instincts would point towards panic. Tim would expect twisted and turning thoughts to overlap and crowd one another until he couldn't tell them apart. He wouldn't have guessed that the things in his head would quiet and let him sort through them with a buzzing but patient anticipation. </span>\n</p>\n<p>\n<span>He's a little bit overwhelmed, and a lot of him is still broken open and raw. </span>\n</p>\n<p>\n<span>He still pulls Damian into his arms, and this time, the kid lets him. Damian turns his face into Tim's chest and grips the sweater he must've changed into at some point. Robin hadn't noticed the change in the wardrobe until he was silently sniffling into it.</span>\n</p>\n<p>\n<span>Tim pulls his chin up and over the crown of Damian's skull and whispers, \"This doesn't just fix everything, kid.\"</span>\n</p>\n<p>\n<span>Damian burrows further into him, and Tim almost doesn't hear his small reply, \"It doesn't have to.\"</span>\n</p>\n<p>\n<span>Damian pulls back for a second, and his gaze demands Tim to hold it. </span>\n</p>\n<p>\n<span>\"In that horrendous document, you never once referenced that we were your family. It was cold. You treated being Red Robin like it was something </span>\n<em>\n<span>anyone</span>\n</em>\n<span> could do. That we could replace you.\"</span>\n</p>\n<p>\n<span>Damian's eyes have been wet throughout their encounter, but now tears well in his large and threaten to fall. </span>\n</p>\n<p>\n<span>\"It scared me. It made me think you didn't care.\"</span>\n</p>\n<p>\n<span>He falls into Tim's chest again. \"Half the family spends time away from home for work and life, Timothy. None of them have needed to give up on being family. You can leave Gotham without leaving us.\"</span>\n</p>\n<p>\n<span>Tim squeezes Damian tighter before letting him go, ruffling his hair. </span>\n</p>\n<p>\n<span>\"Well, I should have a place in Gotham, even if I'm traveling for some of the year.\"</span>\n</p>\n<p>\n<span>\"You could always stay here when you're in Gotham.\"</span>\n</p>\n<p>\n<span>Tim sighs and wants to take Damian up on that sometimes, sure. However, he thinks he'd need his own space. The Nest is the closest he's ever been to making himself a home, and if Gotham's still in the picture, so is Tim's apartment.</span>\n</p>\n<p>\n<span>\"You could always stay with me while I'm in town, too.\"</span>\n</p>\n<p>\n<span>Damian's head whips up, and he nods vigorously. The action is so abruptly </span>\n<em>\n<span>young</span>\n</em>\n<span>, and Tim squeezes his brother, willing Damian to stop growing despite bearing witness to the overwhelming good that time and change have brought to the young man before him. </span>\n</p>\n<p>\n<span>After a couple minutes of comfortable silence, Tim finally clears his throat, \"...I think we're missing Brunch in the cave.\"</span>\n</p>\n<p>\n<span>Damian smiles for the first time since this whole mess started early this morning, \"Do you think he made blueberry pancakes?</span>\n</p>\n<p> </p>"
}