{
  "id": "399804",
  "url": "https://archiveofourown.org/works/399804?view_full_work=true",
  "author": [
    "Closer"
  ],
  "title": "Living In The Future",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Iron Man: Armored Adventures",
    "Ultimate Spider-Man (Cartoon)",
    "Avengers (Comic)",
    "Marvel"
  ],
  "relationships": [
    "Steve Rogers/Tony Stark",
    "Clint Barton/Phil Coulson",
    "Peter Parker/Pepper Potts"
  ],
  "characters": [
    "Tony Stark",
    "Steve Rogers",
    "Peter Parker",
    "Pepper Potts",
    "James \"Rhodey\" Rhodes",
    "Luke Cage",
    "Phil Coulson",
    "Nick Fury",
    "Clint Barton",
    "Natasha Romanov"
  ],
  "additional_tags": [
    "most random Avengers team ever",
    "Crossover",
    "sneaky coulson",
    "Brief Mention of Disordered Eating"
  ],
  "language": "English",
  "series": "",
  "published": "2012-05-07",
  "completed": "2012-05-16",
  "words": "36,271",
  "chapters": "10/10",
  "comments": "678",
  "kudos": "9,172",
  "bookmarks": "2,778",
  "hits": "215,979",
  "summary": "<p>Eighteen-year-old Tony Stark is the boy genius who woke Captain America, and now he's stuck with him. That's not a bad thing, but between Steve's wide-eyed wonder at the new world and Tony's little fanboy crush, the awkwardness just keeps happening.</p>",
  "notes": "<p>This is set in the Armored Adventures cartoon universe, where Tony lost his father and became Iron Man at sixteen instead of in his thirties; in Armored Adventures, Tony has seen Steve in stasis in a glass case, but they haven't been able to wake him. </p>\n<p>It's crossed over with the Ulitmate Spider-man cartoon universe, where Peter Parker is in superhero training with Agent Coulson, though I've jiggered the timeline a little (Cap's awake and Tony's an adult in Peter's 'verse, so I've ignored that).</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Pilot-Star has done a <a href=\"http://i.imgur.com/qS1Iq.png\" rel=\"nofollow\">super-awesome illustration</a> of Steve and Tony feeding the Central Park pigeons on one of their jaunts around Manhattan. :)</p>\n<p>Please note the change in rating! There's pornz ahead!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">more notes</a>.)\n</p>\n<p>There may be a delay between this chapter and the rest...real life is cracking down a little and I sort of ran out of plot. Promise to get back to it as soon as I can!</p>\n<p>Ahahaha JUST KIDDING about that delay. I managed to bang the whole thing out last night. Hooray!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">notes</a>.)\n</p>\n<p>Thanks for reading, everyone! I hope you've enjoyed this.</p>",
  "text": "<p>When Tony turned eighteen, he did an interview with Time Magazine. It was a huge PR blow for Hammer Multinational, but Tony wasn't really competing with Hammer anymore. Stark Solutions was rolling along, doing its own thing in the tech sector, and Justin Hammer's excess and his tantrums and incompetence were slowly destroying his arms company, which had long since gobbled up Stark International and ruined it. </p>\n<p>They asked Tony, why Stark Solutions? Why not simply sit back and live on his trust fund, for that matter?</p>\n<p>And Tony said, \"When my father died, Obadiah Stane took over Stark International and locked me out. SI was the love of my father's life, and it was my home. I was sixteen when he took it from me and I couldn't do anything, but I had the distant hope of one day getting it back. I don't...blame Obadiah, not anymore.\" (Tony was mindful of Whitney, and unwilling to castigate a man in a coma.) \"He just did what he thought he had to do. It must have been hard for him to anticipate losing the company to a kid who wasn't even in his twenties yet. But...when Hammer bought SI, he took away my trust, the one thing my father hoped would ensure I had a worry-free life. Worse, he took away my hope that I'd get my home back someday. I had to move forward. I had to find a new place to call home. I wanted to build my own, so that nobody could take it away from me again.\" </p>\n<p>Hammer stock had dipped significantly. Tony felt a vindictive glee over that. </p>\n<p>But it was true: he had to find a new home. He's still searching, really, but he's only eighteen, just shy of nineteen, and the world is at his feet. SI is a thing of the past, and so is high school; college seems kind of unnecessary at this point. So for now it's just Stark Solutions and Iron Man. </p>\n<p>SHIELD contracts with Stark Solutions for engine maintenance on the Helicarrier and new technology when Tony designs something he thinks even they can't fuck up. In return they've provided occasional support to Iron Man (not that he ever asked for it) and access to the Helicarrier, 24-7, plus a decent if not impressive security clearance. </p>\n<p>Which means sometimes he ends up here, in this dark room only illuminated by the glow of the light in the glass suspension tank. Inside it, Captain America floats serenely in a vat of bio-gel, frozen in an attitude of pride -- arms back, chest forward, head tilted up, like an art deco angel or Iron Man mid-flight. Sometimes Tony tinkers with the calculations the biologists are running to try and find out how to revive him, studying his vitals and his cellular structure, but more often he sits and works quietly, talking to Cap as if he could answer back.</p>\n<p>He's tired, and the numbers on his tablet are starting to blur a little in front of his eyes. Running the company is taking a lot of his time, mostly because he's not an MBA and is picking up the tricks of the trade on the fly. That'll settle down eventually, when he has a little more experience, but in the meantime between Solutions, heroism, trying to keep in touch with Rhodey and Pep long-distance at West Point and Stanford respectively, and repairs on both his armor and theirs when they need it, he's working fourteen-hour days on a regular basis, twenty-hour days when things are rough. He figures at least he's doing it now, when he has the boundless energy of youth to keep him going. </p>\n<p>It's been a twenty-hour-day week. The pressure has finally eased off, now that the markets are closed for the weekend, and maybe he should catch a few hours of shuteye. There's always a room open on the residential level of the Helicarrier for him, Fury makes sure of that. Still, he feels more weary than tired, and if he tries to sleep now his mind will just race and race. </p>\n<p>He clears his tablet and leans back, looking up at Cap, the elegant shadow in the tank. Almost of their own accord, his hands call up the CGI model the biologists have done of Cap's DNA. He has absolutely beautiful DNA, and in it Tony can read Captain America's history: the weak, sickly child, the places where the serum bonded, the patches where it smoothed over the rough stuff and made him who he was when he joined the fight and took Europe by storm. The bonds between the original DNA and the serum repairs are tight, symmetrical, almost machinelike in their precision. Nanobots couldn't have done better (and Tony's seen the disastrous results of SHIELD's attempts). </p>\n<p>He lets his mind drift with the spiralling rotation of the DNA and the slower, almost unnoticeable rotation of Cap in his tank. The Serum is only half the story; it was activated by specific light-wave bombardment, the nature of the waves spreading the bonds over the DNA and securing them in place. Having your whole genetic code rewritten, yeah, that would hurt, and having it happen all at once would only make it worse. The reports on Project Rebirth say he screamed his lungs out when they put him through it. Cap's own words, in neat schoolboy copperplate in the evaluation, speak of how the excruciating pain was still worth it.</p>\n<p>Tony is conscious that he's falling asleep, but just as he drifts off he imagines he sees something brush against the screen where the DNA is turning, a wave and a particle at once, a feather, the aperture of an eagle's eye tightening to focus -- </p>\n<p>\n<i>Turning and turning in the widening gyre,<br>\nThe falcon cannot hear the falconer</i>\n</p>\n<p>\n<i>A vast image out of the Spiritus Mundi<br>\nTroubles my sight: somewhere</i>\n</p>\n<p>\n<i>blank and pitiless as the</i>\n</p>\n<p>\n<i>indignant desert</i>\n</p>\n<p>Tony starts awake with a yelp, the tablet falling from his hands to the floor. The fragments of poetry (never his favorite subject) leak away, some forgotten teacher's voice from the Tomorrow Academy reciting them fading, but the image remains of light and heat and mass and <i>oh, wow</i>.</p>\n<p>Tony has totally always wanted to yell this, and while he's not in a bathtub he's not going to waste the opportunity:</p>\n<p>\"<i>EUREKA!</i>\"</p>\n<p>Tony should call the SHIELD biologists and possibly Nick Fury. He should take the time to explain his revelation and then they could run tests on the blood samples they have from Cap, and then test it on...mice or something, Tony's fuzzy on how the wet sciences work when they don't involve machine/brain interfaces, and then eventually in five or six months or maybe years they'll have tested it out on Cap and gotten their Captain America back.</p>\n<p>That's what Tony should do.</p>\n<p>Instead, because he's Tony Stark, he leaps to his feet and runs to the bank of screens surrounding Cap's tank. He starts by inputting code and running a few tests of his own, working out the kinks, calling up what scraps and sketches of research actually survive from the old Rebirth days. The light-wave bombardment information is more available than the mysterious Serum formula, but Tony doesn't need the Serum -- Cap's already got it inching sluggishly through his veins. All he needs is the right frequency and saturation level, because if the Serum is light-reactive, and currently dormant, then the proper application of new radiation bombardment should -- </p>\n<p>And all the equipment is here, because when they brought Cap here they brought all the crap that made him Captain America, too. </p>\n<p>Around three in the morning an alarm sounds, somewhere, but Tony ignores it. Shortly thereafter, someone begins pounding on the door, but it's just background noise. Tony is in the zone, and it's not even practical anymore, it's this theoretical puzzle to solve. </p>\n<p>Tony flips a switch, and it's a good thing it's three in the morning, because half the lights in the Helicarrier go out. Man, he needs to upgrade their generators. He makes a mental note and then goes back to what he was doing, rewiring the old forties-style bombardment guns, and then he flips another switch and Fury's outside the door yelling at him and half the circuits in this stupid antique machine fry and explode... </p>\n<p>Tony looks up.</p>\n<p>Captain America is turning, turning, so slowly turning...</p>\n<p>And his eyes open. </p>\n<p>He's staring right at Tony, blue eyes focusing through the tank, and Tony stares back in awe. </p>\n<p>Then, suddenly, Cap's whole body moves -- he pushes forward, legs propelling him up against the edge of the tank. He pauses, looks around, back at Tony, and then begins beating on the tank, fists moving slowly, pounding on the glass. </p>\n<p>Tony holds up his hands, the universal gesture for <i>Wait, stop, I got this</i> and runs around to the monitors, hacking through the safeguards easily and initiating the drain mechanism on the tank. The liquid lowers, and so does Cap, and when it drains away completely he's standing there, tall and graceful and alive, hands pressed to the glass. He grabs the oxygen mask on his face with one hand and pulls it down around his neck, heaving in real, fresh, unrecycled air. </p>\n<p>Then he bellows.</p>\n<p>\"<i>LET ME OUT OF HERE, YOU NAZI MONSTER!</i>\"</p>\n<p>Tony rocks backwards and then hears himself bellow back, over the half dozen new alarms going off, \"<i>I'M NOT A NAZI!</i>\"</p>\n<p>Cap's eyes widen. \"<i>YOU'RE AMERICAN? WHERE AM I? WHAT'S THAT NOISE?</i>\"</p>\n<p>\"<i>GIMME A MINUTE, I'LL GET YOU OUT!</i>\" Tony promises, hands dancing across the console, searching for the release on the tank. With a hiss, it begins retracting, the upper housing vanishing into the ceiling as the glass slides into the floor. Captain America stumbles and staggers without the glass to hold him up and Tony vaults the console, shoving a shoulder under his arm to support him. </p>\n<p>\"Easy, easy,\" he says. The other man is slick from the bio-gel he's been soaking in for the past year and change, and he's completely, totally naked except for the disengaged oxygen mask around his neck. </p>\n<p>\"What,\" he gasps, as Tony helps him to one of the benches along the edge of the room. The alarms have gone worryingly silent. </p>\n<p>\"It's okay, I'm a friend, you're safe,\" Tony babbles, pulling off his shirt and trying to wipe the gel away. Note to self: new shirt. \"You're in an American government facility, sorry for the surprise. And the slime.\"</p>\n<p>\"I've had worse,\" Cap says, giving him a dazzling if somewhat confused smile. </p>\n<p>Which of course is when the doors blow open and Nick Fury bursts in. </p>\n<p>He takes in the remains of the tank, the gel-soaked footprints, the softly smoldering equipment. </p>\n<p>\"Uh. Captain America, this is Nick Fury, Director of SHIELD,\" Tony says. \"Director Fury...Captain America.\"</p>\n<p>Captain America currently has Tony's shirt bundled up and held protectively over his privates. An entire squad of SHIELD agents are standing in the doorway looking confused. Fury looks like he might actually blow a vein. </p>\n<p>Tony definitely could have handled this better.</p>\n<p>Tony is so arrested. He's ultra-mega-super arrested, stick-you-in-a-hole-and-pretend-the-hole-doesn't-exist arrested. He's SHIELD arrested. </p>\n<p>Cap, to his credit, said \"Wait!\" and \"No, he didn't do anything!\" and \"Easy, he's just a kid!\" as they were dragging him out. Fury, and Tony is not going to forget this, said \"Strip him before you lock him up.\"</p>\n<p>There's been way more naked in the past two hours than he's comfortable with. Not that spending his Friday night naked is a bad thing, in and of itself, but usually in the fantasies he has of things like this happening, there's someone else in the room and sexy things are going on. Tony regrets, absently, that being the CEO of a high-profile tech company and the pilot of the Iron Man armor has not left much room in his life for things like \"sex with other people\". He wishes he'd lost his virginity before SHIELD decided to lock him up forever. It was on his things-to-do-before-I-turn-nineteen list, right below writing an Iron Man video game. He's sure either Pep or Rhodey would have helped. If not with the sex, then definitely with the video game. </p>\n<p>So he's not really thinking about what's going on in the outside world, nor is he paying much attention to same, when he hears a clang and the hatch in the door opens to allow a bundle of fabric through. Then the window above the hatch opens and Fury's face fills it like an avenging demon of justice. </p>\n<p>\"Get dressed,\" Fury says. The window closes, and then opens again, and Fury narrows his -- well, his eye. \"I guess it's true what they say about Stark guns,\" he adds, and the window closes once more. </p>\n<p>Tony, feeling somewhat harassed, pulls the bundle towards him. There's a pair of black briefs with the SHIELD logo on the hip, a pair of black uniform pants with SHIELD written down the leg, a black shirt with a white SHIELD logo on it. Tony senses a pattern! </p>\n<p>Whatever, he's not going to complain. The undies are totally cool and Pepper's going to be jealous. He wonders if he can requisition a pair for her. </p>\n<p>Once he's decent, the door opens and a giant SHIELD agent, like the biggest he's ever seen, is standing there with a tray containing Tony's watch, phone, and bluetooth headset. Tony takes them carefully and follows when the guy grunts. He's very conscious that he's barefoot, and that the SHIELD t-shirt kind of hangs on him a little. He works out! He just...is a late bloomer. Or something. </p>\n<p>The guy leads him into a very narrow room, grunts again, and says, \"You get five minutes.\" Then he leaves. </p>\n<p>Tony wonders what he's supposed to do in the five minutes he's got, but then a wall slides into the ceiling and on the other side of the room is Captain America. Like Tony, he's wearing SHIELD clothing; there are still traces of bio-gel around his jaw and in his hair. </p>\n<p>\"Uh. Hi,\" Tony says awkwardly. </p>\n<p>\"Hi,\" Captain America says, just as awkwardly. </p>\n<p>\"Sooo...welcome back,\" Tony adds. </p>\n<p>\"Yeah, uh, wow,\" Cap replies. \"Sorry, I wanted to make sure you were...okay. They didn't look too happy with you when they hauled you away.\"</p>\n<p>\"No, I'm good, totally fine. Wondering where my shoes went, but otherwise good,\" Tony says. \"I. Um. Does Fury, did he order you to kill me?\"</p>\n<p>\"What?\" Cap looks shocked. \"No!\" </p>\n<p>\"Oh, so why am I...\" Tony gestures at the room, at them, at the cruel universe which has punished him for being awesome. </p>\n<p>\"Well.\" Cap rubs the back of his head, grimaces at the green goo that comes away in his fingers, and wipes it on his thigh. \"I might have been less than cooperative until my demands were met. Normally I'm not much on insubordination but there's a time and a place and roughing up a kid -- \"</p>\n<p>\"Oh, I'm eighteen, I'm good,\" Tony says. \"Not a kid, you know.\"</p>\n<p>\"Well, it didn't look like a fair fight, anyway,\" Cap replies. He looks up at the ceiling. \"So this is the twenty-first century, huh?\"</p>\n<p>\"Oh, they told you?\"</p>\n<p>\"Couple of things might have tipped me off I wasn't in the forties anymore,\" Cap says drily. \"They said it took a while to get me out of the big...thing of...goo, so thanks for that.\" </p>\n<p>\"Anytime, totally,\" Tony says, and then winces. Way to go, dork. </p>\n<p>A speaker clicks in the ceiling, and Fury's voice comes over the speaker. \"Time's up.\"</p>\n<p>\"Nice to meet you,\" Tony calls under the partition, as it closes. \"I'm a big fan!\"</p>\n<p>\"Thanks!\" Cap calls back, and then the partition slams shut and Tony turns around and Nick Fury is in the doorway. </p>\n<p>\"I'd like it noted for the record that I totally woke up Captain America and did not even fry his brain,\" Tony says, before Fury grabs him by the collar of his shirt and drags him off.</p>\n<p>The lecture from Fury goes better than expected, actually. There's the usual shouting and stomping around, which Peter Parker confided once to Tony he just interprets as \"blah blah blah Parker, blah blah trouble\" and Tony agreed with. (Peter's still in the SHIELD training program for kid heroes; Tony isn't sure why he himself isn't, but he thinks maybe it's because he's too old to unlearn bad habits, and they probably founded the program based on Tony's stubborn destructiveness to begin with.)</p>\n<p>At any rate, one of the other agents brings him a cup of coffee that he gulps down while he's listening to Fury rant about scientific responsibility and access based on trust and how supervillains are made when the controls on the scientific process are ignored. Blah blah blah Stark, blah blah trouble.</p>\n<p>Tony's mental radar, which is running in the background while he focuses on sweet, life-giving coffee, picks up the phrase \"Captain America wants\" and he looks up, looping back in the conversation for a moment.</p>\n<p>\n<i>Captain America wants you.</i>\n</p>\n<p>\"Wants me to what?\" he asks. Fury gives him a frustrated look. </p>\n<p>\"We are offering this man the finest psychologists, historians, and political analysts of the twenty-first century,\" he says, slow and measured, probably repeating himself. Tony thinks Fury must think he just made him say it again to stroke his ego, but the truth is Tony has a very short attention span and just wasn't listening. \"He wants you to get him up to speed on the last seventy years. He refused to even meet with any of our other agents until we let him have that little tete-a-fucking-tete with you.\"</p>\n<p>\"You really shouldn't swear in front of kids,\" Tony says. \"Why me?\"</p>\n<p>\"Who the hell knows?\"</p>\n<p>\"Well, I meant more, why are you letting me, because you obviously are,\" Tony says. \"Or you wouldn't bother telling me. It's not like a guy who's been in the ice for seventy years and is now in SHIELD top-secret custody has a lot of chips on the table. Did he threaten to hold his breath?\"</p>\n<p>Fury looks constipated. \"The man is...persuasive.\"</p>\n<p>Tony raises an eyebrow. \"Okay, sure.\"</p>\n<p>\"That's it? Sure?\"</p>\n<p>\"It's <i>Captain America</i>. Would you say no?\" Tony sets his cup down, feeling a little lightheaded at the thought that Captain America wants to spend time with Tony. He wants a study date!</p>\n<p>\"No, I guess not,\" Fury says, watching him closely. </p>\n<p>\"So when do I start? 'Cause, give me five minutes with a decent digital library archive and I will...\" Tony frowns, losing the thought. \"I will totally...\"</p>\n<p>\"You're going to get some rest first, and so is he,\" Fury says, and Tony lifts his head (nearly reeling out of his seat) to glare at him accusingly.</p>\n<p>\"You sedated me!\" he says, indignant.</p>\n<p>\"Just a little,\" Fury agrees, grinning.</p>\n<p>\"You fucking -- \"</p>\n<p>\"Ah, Tony, language.\" Fury's still grinning. \"Growing boys need their rest.\" </p>\n<p>Tony tries to stay upright, and he manages to keep his eyes open long enough to see Clint and Natasha (fucking awesome, his life is just great) walk into the room, but then -- </p>\n<p>Tony wakes groggily in a spartan, empty SHIELD \"guest\" room: four bare metal walls, a few built-in shelves, a cot and a desk with a computer on it, a cubicle of a bathroom through a doorway in one corner. The clock built into the wall says it's nearly noon.</p>\n<p>Shit. He's wasted a whole morning sleeping when he could have spent it with Captain America. </p>\n<p>He staggers out of bed (someone undressed him; he's not sure if he'd rather imagine it was Clint or Natasha) and strips off his underwear, ducking quickly into the shower so that at least he'll smell vaguely human. There's a razor on the sink so he shaves around the goatee he's trying and so far failing to grow, then dresses, grabs the tablet sitting on the shelf near the door, and pads barefoot (he still doesn't know what Fury did with his shoes) down the hall to the commissary. He has three goals: coffee, Captain America, and shoes. The order is unimportant except for the coffee-first part. </p>\n<p>The commissary is full of people and the smell of lunch, but Tony just lurches directly for the coffee machine, fills two cups, and then unconsciously zeroes in on Parker, dropping down at his table and downing half the first cup in a single go.</p>\n<p>\"Morning, sunshine,\" Peter remarks. </p>\n<p>\"Shouldn't you be in school?\" Tony asks.</p>\n<p>\"It's Saturday,\" Peter replies. </p>\n<p>\"Then shouldn't you be out web-slinging or enjoying the sunshine or something?\"</p>\n<p>\"Team-building weekend retreat,\" Peter says sullenly, and Tony makes a grimace of agreement. \"I've been doing the superhero equivalent of trust-falls all morning. Coulson's a sadist.\"</p>\n<p>Tony hasn't had much interaction with Coulson, but he's heard stories. </p>\n<p>\"So has news made it around the Helicarrier yet?\" Tony asks, lowering his voice. Peter leans in.</p>\n<p>\"You mean about Aptain-kay Merica-ay?\" Peter asks in a whisper. </p>\n<p>\"CAPTAIN AMERICA?\" Tony says loudly, because really, he's kind of an asshole and there's no getting around it. \"REALLY, PETER?\"</p>\n<p>Heads bob up all over the cafeteria. Peter turns bright red.</p>\n<p>\"Just kidding,\" Tony says, and Peter throws an apple slice at him. \"Yeah, that news. I guess it's made it out.\"</p>\n<p>\"Did you have something to do with it?\"</p>\n<p>\"Not to be immodest, but I had everything to do with it,\" Tony replies. </p>\n<p>\"Which would be why there's also a viral video floating around the Helicarrier of you being strip-searched from last night,\" Peter nods. </p>\n<p>\"Well, if you've got it, flaunt it,\" Tony says complacently. Anyone whose opinion he cares about has seen him in way worse than his birthday suit. </p>\n<p>Just then Peter stiffens, eyes fixed on a point somewhere over Tony's shoulder. Everyone else is slowly looking that way too. Tony turns in his seat and see that Captain America lurking in the doorway in a SHIELD noncombat uniform. He looks as terrified of them as Peter looks of him. </p>\n<p>Tony bounces up with a \"Seeya, Parker!\" and runs to the doorway, skidding to a stop a little breathlessly.</p>\n<p>\"Hey, so, hello Captain America! Fury drugged me,\" is his opener -- slick, Stark, real slick there -- \"Or I would have come by sooner, I was just fueling up, did he tell you we're going to be study buddies?\"</p>\n<p>Captain America's mouth works for a second before he replies, \"Uh. Yes. Don't worry, I just woke up myself. Is there lunch?\" he asks, peering around Tony at the crowded room.</p>\n<p>\"Oh sure, yeah, here, okay,\" Tony says, shepherding him through the lunch line defensively. He grabs food without looking -- a bowl of salad, a bag of chips, protein, the guy needs protein, a turkey sandwich? And a Coke, and steers him imperiously towards the table where he still has a full cup of coffee he can drown himself in. </p>\n<p>\"Hi,\" Captain America says to Peter, who looks like he's going to have an aneurism.</p>\n<p>\"That's Peter, he's shy,\" Tony says, while Peter just gapes at him. </p>\n<p>\"Captain America, sir!\" Peter manages, and <i>visibly</i> stops himself from saluting. </p>\n<p>Captain America gives Peter a bright smile and says, \"You can just call me Steve. You too,\" he adds to Tony, then glances at the empty place in front of Tony. \"Aren't you having lunch?\"</p>\n<p>\"Oh, I don't...eat...\" Tony trails off, unsure. He does eat, obviously, just not in any regular sense, and he was way too into the coffee to think about food. </p>\n<p>\"Oh. Well, here,\" Steve says, and hands him half the sandwich. \"You should eat. How old are you boys?\"</p>\n<p>\"Seventeen,\" Peter says. \"Tony's eighteen.\"</p>\n<p>\"You enlist young?\" Steve asks Peter. He seems to be looking for a pull-tab on his bag of chips; Tony takes it from him and rips it open, passing it back. </p>\n<p>\"Uh...you could say that,\" Peter replies. Tony has discovered he does in fact want to eat, and is wolfing down the sandwich. Steve nibbles at a barbecue-flavored potato chip, then looks down at it, apparently impressed. </p>\n<p>It strikes Tony suddenly that Captain America is young too, not much older than them. The facts pull up to the front of his brain without his really asking for them: enlisted at eighteen, underwent Project Rebirth shortly thereafter, three years in combat -- he's only twenty-one, twenty-two at the oldest. </p>\n<p>\"You're not in uniform?\" Steve looks around -- most of the SHIELD agents are in uniform, but there are a few scientists in lab coats or scrubs, and some specialists in street clothes. </p>\n<p>\"He's not regular enlisted,\" Tony says, realizing that Steve's contexts are all out of whack. \"Peter and I are specialists.\"</p>\n<p>\"Oh! Corps of Engineers? Good men,\" Steve agrees. \"Director Fury said you were an engineer,\" he adds to Tony. </p>\n<p>\"More like...\"</p>\n<p>\"Mascots,\" someone says from a table nearby. Tony's head jerks up and he narrows his eyes.</p>\n<p>\"Well, if you want mascot quality work on the jets you're flying around, just let me know,\" he snaps, and the man ducks his head and murmurs <i>nosir</i>. Tony would never do less than his absolute best for the vehicles SHIELD uses, but that asshat doesn't need to know that.</p>\n<p>\"Peter's in a superhero training program,\" Tony continues blithely. \"He's like...the you of the modern world.\"</p>\n<p>\"Oh!\" Steve says, then peers at Peter. \"Project Rebirth?\" he asks dubiously. </p>\n<p>Peter's opening his mouth to reply when a klaxon sounds. Steve starts, alarmed, and then looks up and around him when Fury's voice comes over the loudspeakers.</p>\n<p>\"Mr. Stark, report to command deck. Tony Stark to command deck,\" he commands. Tony shoves the rest of his sandwich in his mouth.</p>\n<p>\"Come on, you better come with me,\" he says, popping the lid back on Steve's salad and thrusting it into his hands. \"Seeya, Spidey!\"</p>\n<p>Peter gives him a faint wave as they leave, Tony towing Steve along with a hand on his wrist. When they hit the command deck, Fury's standing at a monitor, an angry set to his shoulders. </p>\n<p>\"Stark!\" he barks. \"You better know this ship as well as you say you do, 'cause right now Captain America is in the wind and -- \"</p>\n<p>\"Sir?\" Steve asks, and Fury falls silent. He turns, slowly.</p>\n<p>\"Found him,\" Tony says, and makes a <i>ta-daa!</i> gesture. </p>\n<p>\"Was I supposed to stay in quarters?\" Steve asks. \"I found clothes...I thought I'd just go to the mess and get something to eat. Tony was helping,\" he adds, stepping in front of Tony defensively. </p>\n<p>\"Of course he was,\" Fury growls. </p>\n<p>\"Hey, I just wanted a coffee!\" Tony protests, shoving past Steve again. Fury looks at them both like they peed on his carpet. </p>\n<p>\"Captain, you have an official briefing at thirteen hundred,\" he says. \"That'll get you up to speed on the Helicarrier rules and regs and get you set up with network access. Stark, report to the briefing room at fifteen hundred, from there he's all yours.\" </p>\n<p>\"Sweet,\" Tony says. </p>\n<p>\"I'm expecting you to act like a mature adult,\" Fury adds. \"Try not to disappoint me too badly.\"</p>\n<p>This isn't exactly fair -- what does Fury think he's going to do, lie to Captain America about the future? -- but Tony just nods. </p>\n<p>\"See you in a few,\" he says to Steve, who seems uncertain. Tony pats his arm reassuringly, then takes off to see if he can find out what SHIELD did with his shield, because Steve is totally holding his salad in front of him defensively and he looks hilarious. </p>\n<p>Two hours gives Tony more than enough time to locate and crack the lock on the case Steve's shield is in, swipe the shield, smuggle it into Steve's quarters, and then write a semi-intelligent algorithm to search all of the Helicarrier's server folders, shared and private, for digital media of the last seventy years. He also takes a few minutes to find some shoes. </p>\n<p>It's amusing to him, a little; he just got <i>out</i> of high school, and now he's going back to high school history class. Where, ironically, he often spent time studying Captain America. </p>\n<p>Steve is waiting for him in the briefing room, looking weary and upset. When Tony presents himself, a question on his face, one of the anonymous SHIELD agents in the room bends and says, \"The A-bomb\" in Tony's ear as he leaves. </p>\n<p>Oh.</p>\n<p>Yeah, that would shock anyone who hadn't grown up with it, Tony supposes. He doesn't have any particular fear of the atomic bomb -- the cold war and the nuclear arms race were over before he was born, and to him mushroom clouds are familiar more from cartoons than from history film reels -- but he can see how the sheer weight of the devastation would be hard for a man from the days of ground combat to bear. Nukes just don't seem <i>real</i> to Tony. </p>\n<p>\"Hey,\" he says, and Steve glances up, summons a smile for him. \"Got something to show you, come on.\"</p>\n<p>They put Steve in the officers' quarters on the carrier, which Tony supposes is appropriate -- he is a Captain, after all. It means Steve gets a living room attached to the bedroom, with a couch and a television and a kitchen counter along one wall. It's almost <i>more</i> depressing because it's making a pretense of being a home, whereas the general staff quarters don't even bother. </p>\n<p>Still, Tony can work with this, especially when Steve stops in the doorway, shock-still. His eyes are on the shield propped on his couch, and the look on his face reminds Tony of the first time he showed Pepper the armor he built her: like a missing piece had finally been found. </p>\n<p>\"Is it mine?\" he asks Tony, twisting to look over his shoulder. </p>\n<p>\"The one and only. Accept no substitutions,\" Tony replies, and Steve steps into the room, hefts the shield, tosses it lightly, runs his hands over the edges and the front. </p>\n<p>\"I didn't want to ask,\" he murmurs, and the spread of his hands on the metal is almost obscene in its possessiveness. \"I figured it probably ended up on the sea floor.\"</p>\n<p>\"Nobody thought to let you know,\" Tony says. </p>\n<p>\"Where'd you get it?\"</p>\n<p>\"Swiped it from a display case.\"</p>\n<p>Steve looks up at him, worried. \"Are they going to haul you off again?\"</p>\n<p>\"Nah. I left a note.\"</p>\n<p>Steve shakes his head. \"You're something else.\" He settles on the couch, the shield on the floor, tucked up against one leg. </p>\n<p>\"So...I guess I'm supposed to, you know, get you caught up,\" Tony says, and the Awkward is back. </p>\n<p>\"Yeah, guess so,\" Steve answers. He gives Tony a slightly strained look. \"Do we have to do much today? It's just, they told me about the end of the war and showed me some...pictures...\" </p>\n<p>He looks crushed. </p>\n<p>\"We never saw pictures of the camps,\" he murmurs. \"We heard things from guys who were liberating them, but we never saw pictures. And then in Japan...\"</p>\n<p>Tony shifts uncomfortably. </p>\n<p>\"And really I asked for you because you looked like you'd be decent to talk to,\" Steve finishes. Tony gapes at him. \"I mean, after they dragged you off, nobody'd say anything to me, really. And I wanted to make sure they didn't throw you in a cell or anything.\" </p>\n<p>\"That was nice of you,\" Tony manages. There's a lot of emotion in the room right now and he's not sure how to handle any of it. </p>\n<p>\"It's true, isn't it? It's been seventy years.\"</p>\n<p>\"Sorry,\" Tony offers. Steve laces his fingers together, studying them. Tony bites his lip. \"You're famous, you know. America never forgot you. We studied you in school.\"</p>\n<p>Steve nods, not looking up.</p>\n<p>\"There've been other heroes since, but you were the first. All of us -- me, Peter, Pep, Rhodey...you'll like Rhodey,\" Tony adds, grinning. \"Pep...well, Pep's an acquired taste. But you were the first. You were our example.\"</p>\n<p>\"I was hoping young men wouldn't have to fight anymore,\" Steve says quietly. \"I was hoping the end of the war would do away with all that.\"</p>\n<p>\"We don't have to. We choose to. There's bad guys out there and someone has to take them down, so...why not us?\" Tony asks, sitting on the little coffee table in front of the couch. He cocks his head. \"Listen, okay, no more world history today. Let me tell you about <i>our</i> history.\"</p>\n<p>\"I guess Project Rebirth kept going? Someone figured out the Serum?\"</p>\n<p>\"Not exactly,\" Tony replies, and settles in to talk. Talking, he's good at. </p>\n<p>He talks about the death of Captain America and Bucky, which he can tell is hard for Steve to hear, especially Bucky. But he smiles a little when he hears about the memorial service in New York, not so much for himself but for the kid he took under his wing, the kid who was Tony's age when he died. And Tony talks about the others that came after -- the non-powered vigilantes who cropped up all over in the fifties, men and women who grew up on stories of Captain America and wanted to do their part. </p>\n<p>\"Who was the next Captain?\" Steve asks. </p>\n<p>\"There wasn't any next Captain. There couldn't be. The military tried a few times, but nobody lasted long. Nobody lived up to you,\" Tony says. </p>\n<p>\"No pressure,\" Steve drawls.</p>\n<p>\"From what I hear, it wouldn't exactly slow you down,\" Tony replies, and Steve laughs a little. </p>\n<p>He talks about the sixties, and about how the X-Men emerged to fight a new generation of powerful villains, people with special powers who needed other special people to take them down. Tony read up on superheroes when he sort of became one, and he knows about all the greats: Professor Xavier, Jean Grey, Cyclops, Angel, Beast, Storm, Wolverine. Steve listens, growing more intent as Tony talks about aliens and mutants and monsters who decided the world was worth saving, and who made a choice to do the right thing, just like Captain America did. </p>\n<p>He takes more in stride than Tony would have thought, honestly. He doesn't bat an eye at black superheroes (but then, he had the only integrated unit in the forties) and he actually corrects Tony about female superheroes.</p>\n<p>\"No, she wasn't the first,\" he says, when Tony tells him about the original Black Widow. \"Scarlet was the first, I guess, by the way you define superheroes.\"</p>\n<p>\"Scarlet?\" Tony asks. </p>\n<p>\"Scarlet O'Neil. Well, her and Fantomah. I never met Fantomah, she was operating in Africa when I was in the European theatre, but she and Scarlet were working about the same time. Scarlet ran with the Commandos for a while. She could turn invisible -- I thought it was just a way of saying she was sneaky and stealthy, but she could actually disappear. Good soldier,\" he muses. \"I wonder what happened to her.\"</p>\n<p>Tony googles her on his phone, but no luck. \"No record of her in the public eye. But -- hey, SHIELD has her on file.\" He frowns. \"She worked for SHIELD after the war...uh, she died in the eighties.\"</p>\n<p>Steve's mouth twists again. \"Well. That's a pretty good run, I'd say.\"</p>\n<p>\"Yeah,\" Tony agrees, and keeps talking. Cap just sucks it all in, and the only thing that seems to trip him up is Northstar.</p>\n<p>\"He was the first gay superhero to be out,\" Tony says.</p>\n<p>\"Out of what?\" Steve asks. </p>\n<p>\"Oh, uh.\" Tony rubs the back of his head. Captain America is <i>the</i> hero, sure, but Northstar's kind of a <i>personal</i> hero. \"He was the first superhero to be openly homosexual.\"</p>\n<p>Steve blinks at him.</p>\n<p>\"Into men,\" Tony clarifies.</p>\n<p>\"I know what homosexual means,\" Steve says. \"You can do that now?\"</p>\n<p>\"What, be into men?\"</p>\n<p>\"Well, I mean, wasn't he arrested? If he admitted he was in public and all?\"</p>\n<p>It's Tony's turn to blink. \"Um, no. Not so much. It's not illegal to be gay.\"</p>\n<p>\"It was when I was growing up.\" Steve seems to be digesting this. </p>\n<p>\"It's not now,\" Tony repeats. \"Lots of superheroes are gay. Lots of <i>people</i> are gay. It's kind of an okay thing.\"</p>\n<p>He must sound a little more aggressive about it than he intended, because Steve looks startled. </p>\n<p>\"That's...good, isn't it?\" Steve asks hesitantly. \"It went awful hard for fellas in the forties if they were. Some of my unit were, they couldn't tell anyone. I wasn't supposed to know, but these things get around.\"</p>\n<p>\"Yeah, well. It's still not <i>easy</i>, but at least it's not illegal.\" </p>\n<p>Tony might be a little touchy on the subject. He hasn't screwed up the courage to tell anyone but Pep and Rhodey he's gay; not that there's anyone else to tell, really, it's not like Fury would find it relevant, but he could be more...visible or something. He <i>is</i> celebutante Tony Stark, after all. He's getting there, just, slowly. </p>\n<p>Might help to get a boyfriend first. </p>\n<p>\"Anyway, Northstar was the first,\" Tony continues, and launches back into his Abridged History of Superheroes. There was a new generation of X-Men in the eighties, like Jubilee and Rogue, the Fantastic Four in the nineties, their mutations artificial from exposure to solar radiation -- Steve mutters something about science fiction -- and now the newest generation. </p>\n<p>\"Like Peter,\" Tony continues. \"He was bitten by a genetically altered spider. He can climb walls and wow, you should see him move -- it's awesome. He's got a whole team, SHIELD trains them -- Nova and Iron Fist and White Tiger and Power Man. They all look up to you. I bet the team's dying to meet you.\"</p>\n<p>\"What about you?\" Steve asks, looking at him intently. \"You said this was our history. You fight too, don't you?\" </p>\n<p>\"Yeah. I'm Iron Man.\"</p>\n<p>Steve eyes Tony's skin. \"Indestructible?\"</p>\n<p>Tony laughs nervously. \"No. Just plain old human. Rhodey and Pep and me, we have armored suits I invented. They let us fly and shoot stuff, it's pretty cool.\"</p>\n<p>\"Why do you fight?\"</p>\n<p>Tony shrugs. \"Rhodey and Pep just like it, mostly. I mean, they see they're doing good.\"</p>\n<p>\"And you?\"</p>\n<p>Tony is quiet. Steve waits patiently, blue eyes keen. </p>\n<p>\"When I was sixteen, my dad was killed in a plane crash,\" Tony says, his voice subdued. \"He ran a technology company called Stark International. I was too young to take over, so his business partner -- Obadiah Stane -- took charge. He started turning Dad's inventions, my inventions, into weapons. I couldn't let him do that. It's more complicated, but basically...Tony Stark couldn't do anything. Iron Man could do everything. Why stop at protecting myself? I wasn't the one who was getting hurt by Stark International guns, Stark International land mines and missiles. That's all done now, but once it gets you...it gets you.\"</p>\n<p>Steve just keeps watching him. Tony wonders if he shouldn't say something else, but then Steve opens his mouth, inhaling to speak.</p>\n<p>\"When I signed up, Dr. Erskine asked me why I was enlisting. He asked if I was going to go kill some Nazis,\" he said. \"I was younger than you are now. I said no, I didn't want to kill anyone -- \"</p>\n<p>\" -- you just hated a bully,\" Tony finishes. Steve stares at him. \"Told you. You're famous. We're the kids who hate the bullies too.\" </p>\n<p>\"So you chose to fight.\" Steve nods. \"I understand now.\" </p>\n<p>\"Good. I hoped you would. A lot of kids out there are going to hear Captain America's back, and they'll want to know you understand.\" </p>\n<p>Steve unclasps his hands, rubbing them on his knees. \"Look, I'm not much older than you, and I'm not some perfect history book hero. You gotta know that. I want to...I guess I want to fight too, if there's a fight that needs me, but Tony...it's been seventy years. I only understand about two thirds of the things coming out of your mouth.\"</p>\n<p>\"It's okay, you'll pick it up -- \"</p>\n<p>\"Yeah, I know, but...\" Steve looks down, mouth twisting. \"Listen, I'm going to need someone to tell me what's true from what's not, and -- and what's important from what's not. Someone I can trust. I don't know if I can trust SHIELD, or the military, because they want to...use me, I know they're going to want to use me, especially if I'm as famous as they say.\"</p>\n<p>Wow. Steve's no fool, Tony thinks. </p>\n<p>\"So...can I trust you to do that? Help me out?\" Steve asks. </p>\n<p>Tony sits back, stunned and a little worried. He just thought he'd plonk Steve down with some history books and a bunch of old movies. He didn't sign on to be Captain America's modern-day Jiminy Cricket. </p>\n<p>But Steve is just a kid himself, really, and he's lost and scared and trying not to show it, and Tony knows that feeling a little too well. Steve hasn't got a friend in the world except Tony, and he had to fight SHIELD to even get that.</p>\n<p>\"Sure,\" Tony says. Steve looks up, a hopeful smile on his face. \"Sure, I can do that, I guess. Uh. A lot of people are going to tell you that I'm like the worst choice ever for that, though.\"</p>\n<p>\"Why?\"</p>\n<p>\"Oh, well, I...am not very reliable, and I have some impulse control problems, and I don't see things the way other people do. I mean I don't think the stuff they think is important...is important, sometimes.\"</p>\n<p>\"But you're a hero. In spite of all that.\"</p>\n<p>\"Sometimes I think because of all that,\" Tony replies, and Steve gives him an amused look. \"I tend to break rules a lot. Only the dumb ones, if that helps.\"</p>\n<p>\"I never was one for dumb rules,\" Steve agrees. \"I dunno, you seem like you've got your head screwed on right.\" </p>\n<p>\"Thanks, I guess.\" Tony smiles. \"Hey, we should get something to eat before the commissary closes.\"</p>\n<p>\"Can I have some more of those chips?\" Steve asks, as they stand up. He picks up his shield carefully and straps it to his back. \"Those were...different.\"</p>\n<p>\"Sure. You really want to take that thing with you?\" Tony asks.</p>\n<p>\"I feel better when I have it,\" Steve says. \"Is it strange?\"</p>\n<p>\"Nah, not really,\" Tony replies, thinking of how for about two years he took the Iron Man backpack with him everywhere. \"Come on, I'll introduce you to the wonderful world of flavored potato chips.\"</p>\n<p>The commissary is empty, this time of night, so they pretty much have the place to themselves. The dining-hall staff make Steve a giant sandwich, googly-eyed, and he plows through the sandwich and five different flavors of potato chip. He's delighted by M&amp;Ms, which he remembers from ration cans during the war, and peanut M&amp;Ms <i>blow his mind</i>. </p>\n<p>\"Why do you keep looking at that thing?\" he asks Tony, when Tony checks his email on his phone for the third or fourth time. He emailed Rhodey and Pep about the whole \"Captain America\" thing like four hours ago, but Rhodey's probably off doing soldiery things and Pepper has a vibrant, thriving social life at Stanford, so on a Saturday night she probably won't get his email until two in the morning. </p>\n<p>\"This is going to take a whole lot of history for you to understand, but basically I can use this to send messages wirelessly to people,\" Tony says, showing him the phone. </p>\n<p>\"Like radio?\" Steve asks. </p>\n<p>\"More like a telegram, without the telegram lines.\"</p>\n<p>\"Wow. Who are you sending messages to?\"</p>\n<p>\"Nobody at the moment. I'm waiting for people to send them to me. It's also a telephone. And a camera. And you can play games on it,\" Tony says, scrolling through the touchscreen menu.</p>\n<p>\"All in that little thing?\" Steve asks. </p>\n<p>\"Sure. We'll get you one, I'll show you how it works.\"</p>\n<p>\"Oh, that's -- I'm sure they're expensive. It looks complicated.\"</p>\n<p>\"Well, it is, but fortunately my company makes them, so you have an inside track.\"</p>\n<p>\"Your company!\" Steve looks at him, surprised. </p>\n<p>\"Sure. See? StarkPhone,\" Tony says, showing off the Stark Solutions logo on the back. \"Anyway, you gotta have one, nearly everyone does now. Here,\" Tony says, holding up the phone and opening the camera app. \"Smile!\"</p>\n<p>Steve looks confused, but he flashes a matinee-idol grin, which would probably be annoying if it weren't obvious that's just his awesome smile. Tony snaps a picture and then turns the phone around so Steve can see.</p>\n<p>\"Holy -- !\" Steve stares at it. \"There I am!\" </p>\n<p>\"Pretty neat, huh?\" Tony scrolls back to the other photos he has stashed on his phone. The next one is Rhodey, showing off his cadet uniform. \"That's James Rhodes. Rhodey. He's my best friend.\"</p>\n<p>\"He's the one in officer training?\"</p>\n<p>\"At West Point, yeah. And that's me and Pepper,\" Tony points to the next photo, which Rhodey took with Tony's phone a few days before he and Pep left for school. Tony's sitting on a park bench with a hot dog; Pepper has one arm around his neck and is sticking her tongue out at the camera, gesticulating at it with a soda bottle. </p>\n<p>\"That's your girl?\" Steve asks, a knowing look on his face. </p>\n<p>\"Oh, uh, no. She's my...other best friend. I don't have a girl,\" Tony says, flipping to the next picture, which is probably the most awesome photo ever: Iron Man standing to attention, throwing up the peace sign with both hands Nixon-style, while Spider-man does a one-arm handstand on his helmet, legs in a split, making the rock'n'roll horns with his free hand. Pepper's actually the one who took it with her phone, but she emailed it to him and for a while it was his wallpaper. </p>\n<p>\"That's me and Peter,\" he says fondly. \"He's the one in the tights.\"</p>\n<p>Steve is studying the picture closely. \"That's your metal suit you wear?\"</p>\n<p>\"Iron Man, yeah. I'll show it to you tomorrow if you want. I keep it in lockup when I'm on the helicarrier.\"</p>\n<p>\"You're the third person who's said that word,\" Steve says. \"That's where we are, right? The helicarrier?\"</p>\n<p>\"Yeah...\"</p>\n<p>\"Is it a kind of boat?\"</p>\n<p>\"Oh man,\" Tony says, stunned. \"You haven't been outside yet, have you?\"</p>\n<p>\"I didn't know if it was allowed, after I got chewed out for going to the mess hall,\" Steve says, sounding a little aggrieved. </p>\n<p>\"Well, it is now,\" Tony says firmly.</p>\n<p>Tony is not allowed on the landing platform unless he's working on equipment there, and he's broken enough rules for one day, so he takes Steve through the \"diplomat deck\" where they give tours to bigwigs who want to see the helicarrier for themselves. Fury calls it the \"dipshit deck\" because it looks nothing like the rest of the helicarrier and only dipshits get shown there. Still, it has the second-best view after the landing platform, and Tony guides Steve through the carpeted lounge and out onto the observation balcony. </p>\n<p>\"It's technically an aircraft carrier,\" Tony says, as the wind whips their hair around, \"but it flies. My dad built it.\"</p>\n<p>Steve is awestruck. He looks up at the night sky and then out at the clouds over the Atlantic in the distance. When he looks down, though, is when he actually gasps.</p>\n<p>\"What city is that?\" he demands, pointing at the brilliant constellation that is New York at night.</p>\n<p>\"Well, that part's Manhattan,\" Tony says casually. </p>\n<p>\"No,\" Steve looks at him, shocked.</p>\n<p>\"Yep. You're from Brooklyn, right? That's it, over there,\" Tony points, and Steve covers his mouth with one hand.</p>\n<p>\"That's really Brooklyn?\" he asks after a moment.</p>\n<p>\"Yep. We're currently about a mile above New York.\"</p>\n<p>\"My God, will you look at it,\" Steve says, leaning over the balcony railing, utterly fearless of the drop below. \"My God. Oh, my God.\"</p>\n<p>\"Careful,\" Tony says, a little worried, and tugs on his sleeve to pull him back. \"Don't fall in.\"</p>\n<p>\"You don't understand,\" Steve says, still staring out at the vast glittering city below. \"When I was a kid I read science fiction stories about cities like this. All the lights and the high buildings -- and your little camera doodad, and whole ships that could fly, and robots...\" Tony isn't sure whether it's joy or shock on his face. \"And now it's all real.\"</p>\n<p>\"Most of it,\" Tony says. \"We still don't have flying cars.\" </p>\n<p>\"Oh, well, then scrap the lot,\" Steve replies, shooting him a smile. \"Tony, this world is amazing.\"</p>\n<p>\"Yeah, I'm pretty fond of it,\" Tony agrees. </p>\n<p>\"I hate to break this up,\" says a new voice, and Clint Barton drops down behind them out of fucking nowhere, and Tony nearly has a heart attack. Steve's shield is in his hand already, and Tony finds himself tugged behind it before he can think. </p>\n<p>\"Easy, easy,\" Clint says, hands upraised. \"Friend, not foe.\"</p>\n<p>\"Tony?\" Steve asks warily.</p>\n<p>\"Well, I wouldn't call him a friend, but he's not here to hurt us,\" Tony replies, and pushes out from behind the shield to punch Clint in the shoulder. \"You asshole, you scared the hell out of me.\"</p>\n<p>\"Just keeping you on your toes,\" Clint says, and then looks pointedly at Steve, who is shouldering his shield again. </p>\n<p>\"Steve, this is Clint Barton,\" Tony announces. \"Clint, Captain America.\"</p>\n<p>Clint squares his shoulders, which is kind of hilarious. \"Honor to meet you, sir.\" </p>\n<p>\"Get used to it,\" Tony says, when Steve looks taken aback.</p>\n<p>\"Steve,\" Steve says, offering his hand. Clint shakes it, and Tony totally notices the fanboy look that crosses his face. Clint is five years older than Steve.</p>\n<p>\"I wish I could say this was a social call, but Fury sent me,\" Clint says, when Steve lets go of his hand. \"He says there's a midnight curfew for both of you.\"</p>\n<p>\"Aw, man, it's Sunday tomorrow,\" Tony groans.</p>\n<p>\"Hey, don't shoot the messenger.\" Clint grins. \"Tony's working on a growth spurt, he needs his sleep,\" he adds to Steve. </p>\n<p>\"You're such a dick,\" Tony informs him.</p>\n<p>\"I know, it's part of my rugged charm,\" Clint replies. </p>\n<p>\"Are you a superhero?\" Steve asks. Clint blinks. \"Sorry, I'm noticing a personality type.\"</p>\n<p>\"Hawkeye's my call sign,\" he says. </p>\n<p>\"Knew it,\" Steve says to Tony. \"I'm getting a handle on this twenty-first century business.\"</p>\n<p>\"Yeah, you're picking it up like whoa,\" Tony replies. \"Thanks, Clint.\"</p>\n<p>Clint doesn't move.</p>\n<p>Tony rolls his eyes. \"Okay, okay, we're going,\" he says, pushing past him and back inside. </p>\n<p>\"Nice to meet you,\" Steve says politely, and follows Tony. </p>\n<p>Halfway to the residential deck, Tony gets a text from Clint. <i>I shook Captain America's hand. I'm never washing this hand again.</i></p>\n<p><i>Creep,</i> Tony sends back.</p>\n<p>Tony wakes up on Sunday to thirty-nine text messages and four voicemails from Pepper, full of Captain America squee. He has two emails from Rhodey on much the same theme, and one voicemail saying he'd better call Pepper because she's started calling Rhodey. He also has one email from Pepper, but it's just a photo of a Captain America action figure holding a sign reading CALL ME NOW PUNK. </p>\n<p>Pepper once admitted to him, in a moment of weakness, that when she was six she had a Captain America doll. She used to take off his uniform and put it on the one Barbie doll she owned and pretend Barbie was Girl America. The Captain America doll would be her sidekick, Naked Guy. They would wage bloody wars on her stuffed animals. The descriptions of gore were impressive.</p>\n<p>Tony, wisely, calls her. </p>\n<p>\"OHMYGODOHMYGODOHMYGOD,\" she answers, at a tone and volume that would deafen him if he weren't used to it. \"<i>You woke up Captain America?</i>\"</p>\n<p>\"Yeah, I -- \"</p>\n<p>\"OHMYGOD!\" she yells. \"Why didn't you call me sooner?\"</p>\n<p>\"I was kind of busy being arrested for waking up Captain America. Then Nick Fury drugged -- \"</p>\n<p>\"Do not care,\" she replies. \"Is he cool? Is he as tall as he looks in the old movies? Ohhhh has he shot anyone yet?\"</p>\n<p>\"I'm pretty sure they're not going to give him a gun yet,\" Tony says. </p>\n<p>\"Is he there? Can I talk to him? Never mind, I got impatient waiting for you to call, I'll be there soon.\"</p>\n<p>\"You'll what?\" Tony asks faintly. \"Where are you?\"</p>\n<p>\"In the suit, somewhere over corn country.\"</p>\n<p>\"Pepper,\" Tony sighs, pinching the bridge of his nose. </p>\n<p>\"Do not ruin this for me, circuits for brains,\" Pepper insists. \"I'm going to meet Captain America!\"</p>\n<p>\"Pep, listen to me,\" Tony says. \"He just woke up and he's freaked out, okay? He needs friends right now, not fans. Please, please, please, when you get here, be cool?\"</p>\n<p>\"I'm always cool! When am I not cool?\" Pepper demands. </p>\n<p>\"Just, don't tell him about Girl America and Naked Guy until he's had time to get used to your...unique personality,\" Tony says. </p>\n<p>\"Huh. Well, okay,\" she replies. \"See you in an hour or so. Hey, can you let Director Fury know I'm coming so he doesn't try to shoot me out of the sky again?\"</p>\n<p>\"Pepper, he knew you were coming last time. I think he just likes trying to shoot you out of the sky.\"</p>\n<p>\"It is kind of fun dodging the anti-aircraft guns. Okay, love you Tony, bye now!\" she says, and clicks off. Tony looks down at his phone, dismayed.</p>\n<p><i>Called Pep,</i> he texts Rhodey. <i>She's on her way. U want to come up?</i></p>\n<p><i>Can't get off campus,</i> Rhodey's text reeks of glumness. <i>Next time I get a War Machine pass?</i></p>\n<p>Tony went public as Iron Man the minute that the Ghost threatened to expose him. Pepper was basically never <i>not</i> public as Rescue. Rhodey did not go public as War Machine, but the school brass knows, and at SHIELD's directive they can and do give him a pass to go fight. </p>\n<p><i>Promise, bro,</i> he texts. </p>\n<p>\n<i>Holding u to that. Love to Pep.</i>\n</p>\n<p>When Tony stumbles into the commissary, mostly clean and still somewhat damp, he finds Steve sitting at a table surrounded by trainee heroes: Peter in spider-getup except his mask, Nova with his helmet off, Power Man and Iron Fist in full regalia, White Tiger in street clothes. </p>\n<p>\"Tony!\" Steve calls. \"Over here!\"</p>\n<p>Tony, who is at this point totally unused to a full night of sleep, pours himself a cup of orange juice instead of coffee almost completely by accident, and then slumps into a chair Peter pulls around to the table for him. </p>\n<p>\"I should warn you,\" he says, \"Pepper's on her way in.\"</p>\n<p>\"All <i>right!</i>\" Nova punches the air. </p>\n<p>\"She's never going to go out with you,\" Tony informs him.</p>\n<p>\"Who cares? Imma gaze from afar,\" Nova replies. </p>\n<p>\"Pepper'll be a nice break from the sausagefest,\" White Tiger observes. </p>\n<p>\"What, Peter's not girl enough for you?\" Nova asks. </p>\n<p>\"Ugh, will you stop being a jackass?\" Tony groans. </p>\n<p>\"What's wrong with being a girl?\" White Tiger asks pointedly. </p>\n<p>Nova gulps. </p>\n<p>\"Nothing,\" he says.</p>\n<p>\"You're damn right nothing,\" she replies. Tony glances at Steve, who mostly looks confused. </p>\n<p>\"Okay, children,\" he says, making the executive decision to be the condescending big brother, just this once. \"Time for the grownups to have a conversation. Get lost.\"</p>\n<p>\"Please,\" Power Man says disdainfully. </p>\n<p>\"Seriously, Luke, call me when you're not a trainee anymore. Meantime, scram before I sic Coulson on you,\" Tony threatens. That gets them going, if reluctantly. </p>\n<p>\"Let Pepper know I'm around?\" Peter asks in a whisper. Peter and Pep have this friends-with-benefits deal that Tony could never pull off but somehow the scrawny spider totally manages. </p>\n<p>\"Better wait till I pry her off Cap,\" Tony whispers back. Peter nods, gives him a high-fwip (it's a thing they do, shut up) and disappears. </p>\n<p>\"You didn't have to do that,\" Steve says, though he looks grateful. </p>\n<p>\"They're a little overwhelming en masse,\" Tony replies. \"Plus Nova gets all super-testosteroney around...other people. It's a thing.\"</p>\n<p>\"You were right, you know,\" Steve says, sitting back a little. \"They all treat me like I'm special.\"</p>\n<p>\"You are.\"</p>\n<p>\"Not really. No more special than they are.\" Steve shrugs, then changes the topic. \"You should eat.\"</p>\n<p>\"I told you, I don't eat,\" Tony replies with a grin, but he gets up and grabs an apple, bringing it back to his seat. \"Happy?\"</p>\n<p>\"Yes, thank you,\" Steve replies, as Tony takes a bite. \"So I thought maybe today we could do some history. And you said you'd show me your suit.\"</p>\n<p>\"Sure,\" Tony says. \"Where do you want to start?\"</p>\n<p>\"Uh...well, I heard about how the war ended...\" Steve trails off. \"So maybe there? Fury wants me to do some evaluation exercises this afternoon, but my morning's free.\"</p>\n<p>\"Well, that should get us through the fifties, nothing much happened,\" Tony decides. He's sure a lot happened in the fifties, really, but Cold War and awful television aside, he can't think of much, and he's totally not inflicting the infancy of television on Steve. </p>\n<p>Over breakfast, Tony digs into what he remembers from history class: the baby boom after the war, Sputnik, rock music, communism. He feels a little like that old Billy Joel song his dad liked: <i>Joe McCarthy, Richard Nixon, Studebaker, Television...</i></p>\n<p>Tony is trying to explain the life of Marilyn Monroe, with limited success, as they walk down the corridor towards the arms lockup where Iron Man awaits. There's a squeal and a thud and then Pepper is running down the hallway in her armor, helmet off. She skids to a stop when she sees them, and her eyes get huge and round. </p>\n<p>To Pep's credit, as soon as the silence begins to seem weird, she blinks and shakes herself and says, \"Captain America?\"</p>\n<p>\"Uh, yeah, that's me,\" Steve says. \"Miss Potts?\"</p>\n<p>Pepper glances at Tony. </p>\n<p>\"I may have mentioned you,\" Tony says. </p>\n<p>\"You are so getting a gold star later,\" she says, and then comes forward and shakes Steve's hand. </p>\n<p>\"I know this is going to sound totally weird and stalkery but when Tony said you woke up I had to come see, I mean, God,\" she says, but for Pepper she's not speaking too fast. Steve seems weirdly shy, given he was just entertaining an entire troop of idiots way less suave than Pep earlier that morning. \"How are you? Are you settling in okay? Tony's not being a jerk to you, is he?\"</p>\n<p>\"Pepper!\" Tony yelps. </p>\n<p>\"N-no, Tony's great,\" Steve says. \"It's nice to meet you.\"</p>\n<p>\"You too. It's completely weird, actually, and it must be so much weirder for you,\" she adds. \"Are you going to be a superhero again? Are you going to work for SHIELD? Oh man, you don't know yet, of course not...\"</p>\n<p>\"Well, I -- I'd like to. Work again, that is,\" Steve stammers. \"Maybe for SHIELD?\" </p>\n<p>\"You toooootally should, they're so awesome,\" Pepper replies. </p>\n<p>\"Speaking of which,\" Tony says, subtly insinuating himself between Steve and Pepper, \"Peter's gang is looking for you.\" </p>\n<p>\"Tony! Hi!\" Pepper says. Tony rubs his forehead. \"Oh man, are they training today? You think Coulson would let me beat them up again?\"</p>\n<p>\"No harm in trying,\" Tony says through gritted teeth.</p>\n<p>\"Okay.\" Pepper kisses his cheek. \"Be good. I'll see you for lunch, yeah?\"</p>\n<p>She bounds away, servos whirring, and both of them turn to watch her go.</p>\n<p>Most men, when confronted with Pepper for the first time, either swallow their tongues or amp up their game. Steve did all right, considering; maybe the armor helped. Her chestplate isn't exactly like Tony's or Rhodey's, but she'd have castrated him if he gave her anime-style robot boobs, so it's pretty sexless. </p>\n<p>\"You get used to her,\" Tony says.</p>\n<p>\"She's nice,\" Steve answers. He glances at Tony. \"She's really not your girl?\"</p>\n<p>\"Really not. She kisses everyone, you'll probably get one,\" Tony replies, and Steve turns pink. Wow. \"Aaaanyway, Iron Man?\"</p>\n<p>Steve's reaction when Tony flicks on the lights in the locker where Iron Man is standing is gratifying. He takes it in, helmet to boots, mouth slightly open. </p>\n<p>\"Can I?\" he asks, lifting a hand and looking at Tony for permission. Tony nods, and Steve touches the gauntlets, the flexible plating on the arms, the seam where gold meets red on the faceplate. \"You made this?\"</p>\n<p>\"Yeah. That's the newest model,\" Tony says, possibly bragging a little. \"Here, let me show you.\"</p>\n<p>Steve steps back and Tony spreads his arms. The armor, under Extremis control, flies apart gracefully and reassembles itself over his body -- he steps into the boots, feels the chestplate and backplate settle on his body, revels as always in the sensation the armor gives him of coming home. He's safe here, and maybe that's an illusion but it's a welcome one. His armor is his second skin, his pride and joy, the thing he loves most in the world. His armor protects him. From everything.</p>\n<p>He turns to Steve as the faceplate closes gently. </p>\n<p>\"So?\" he asks, and it's still strange not to use the voice modulator anymore to make himself sound older. \"How do I look?\"</p>\n<p>\"Amazing,\" Steve says reverently. He reaches out to touch again, and Tony can tell he doesn't realize he's doing it at first. He holds still while Steve retraces the seam of the faceplate, then picks up one of Tony's hands and studies the glowing white circle set in his palm.</p>\n<p>\"Flight stabilizer,\" Tony says, and Steve looks up. \"Also it fires energy beams. It's one of the few offensive weapons in the suit.\"</p>\n<p>\"It flies?\" Steve asks. Tony takes a step back and lifts off just enough to hover. Steve reaches out and pushes his chest, gently, and Tony drifts backwards. </p>\n<p>\"It's no super-soldier serum, but it gets the job done,\" Tony says, touching down again and retracting the faceplate. </p>\n<p>\"I'm surprised people even remember me,\" Steve says, and Tony frowns. \"With things like this, why would they?\"</p>\n<p>Tony shrugs and the armor flies off, reassembling itself in the locker. \"It's just a machine. You're a bona fide hero. Why wouldn't they?\"</p>\n<p>The rest of the day goes well, more or less. Tony discovers that the fifties were way busier than he thought. The best thing to do, eventually, is to explain the fundamentals of a computer and sit down in front of one with Steve, because that way they can Wiki anything Steve wants to know about and Tony doesn't already know, like the causes of the Korean War. </p>\n<p>Lunch with Pepper is fine, though Steve's a little quiet. Pepper more than makes up for it, firing questions at him and then answering half herself, telling Tony about her classes at Stanford and the sweet Rescue job she did last week. </p>\n<p>\"Ms. Potts,\" Nick Fury says, coming up to them towards the end of lunch. \"Just the woman I wanted to see.\"</p>\n<p>He has that smile which Tony knows means \"DANGER, DANGER\" but which Pepper thinks means \"FUN!\" and it turns out she's right, because that afternoon Tony gets to sit on the sidelines and watch as Pepper becomes Steve's evaluation exercise. </p>\n<p>They throw each other around the workout room for about three hours, and at the end of it Pepper is exhausted but grinning and Steve's practically euphoric. Watching him go at her, Tony understands that the scared, shy, confused man he's been shepherding around for the last day and a half really is Captain America. In battle, he's utterly fearless, cunning, vicious, and just a little bit cocky. </p>\n<p>\"Thank you,\" Steve says to Pepper, at the end of the session. \"That was great.\"</p>\n<p>\"I'm glad you're on our side,\" Pepper pants. </p>\n<p>The only snag in the day is that Tony's secretary -- how weird is it that he has a secretary? -- calls him while Steve's in the locker room, to remind him that Monday is coming and with it his responsibilities to Stark Solutions are looming.</p>\n<p>\"Yeah, but look, I'm a little tied up with something here,\" Tony is saying, as Steve joins him in the hall. Tony points to the silver earpiece he's wearing and Steve nods, herding him unsubtly towards the commissary. </p>\n<p>\"I understand, Mr. Stark, but SHIELD can't monopolize your time,\" she says patiently.</p>\n<p>\"No, I get that -- \"</p>\n<p>\"If you want to continue funding the Iron Man project -- \"</p>\n<p>\"Yeah, okay, I know,\" Tony says tiredly. \"Listen, let's do this a different way. How many actual necessary face-to-faces do I have this week? Vital, non-conference-able meetings?\"</p>\n<p>\"Two on Wednesday, one on Thursday,\" she replies promptly. </p>\n<p>\"Okay, I can work with that. Can you move the one to Wednesday -- or better, the two to Thursday?\"</p>\n<p>\"It'll mean moving around your conference call with Senator -- \"</p>\n<p>\"Senator assclown? Gee, I'll be so sad,\" Tony says. \"Thursday?\"</p>\n<p>\"Yes, Mr. Stark.\"</p>\n<p>\"Okay. I'll set up a remote office here and patch in for the rest. You can keep me on call. Wednesday night I'll be back in Manhattan. I need car service for Thursday and I'll have a guest with me.\"</p>\n<p>Steve is looking both concerned and confused. </p>\n<p>\"Yes, Mr. Stark,\" she sighs.</p>\n<p>\"Annie, you know you're my favorite. Remind me to send you some flowers.\"</p>\n<p>\"Already sent, Mr. Stark,\" she says, sounding less frustrated and more amused now. </p>\n<p>\"Roses?\"</p>\n<p>\"You know irises are my favorite.\"</p>\n<p>\"Of course I do. Oh, and Annie? Trust me, Thursday will be worth it,\" he says, and kills the call.</p>\n<p>The next three days are busy: history and pop culture lessons with Steve in the mornings, work in the afternoons -- often while Steve is in assessments, wiping the floor with everything they can throw at him -- and trips up to the observation deck in the evening to look out on New York, which Steve never seems to get tired of. </p>\n<p>Tony watches him make friends, not jealously exactly, but guardedly. Clint takes Steve spelunking through the air ducts. Peter texts him on the phone Tony taught him to use, at first awe-struck but eventually his snarky Peter-y self. Some of the SHIELD agents arrange a poker night and invite Steve along. A psychiatrist pokes and prods at him on Wednesday, then gives Tony a look that says he'd like to do the same to him. </p>\n<p>But finally it's Wednesday night, and Tony is eating dinner at a regular time -- he's had more regular meals this week than in the past six months combined, he thinks ruefully. And he says to Steve, \"So. Going downstairs tonight.\"</p>\n<p>\"I can't wait,\" Steve says. He's been practically counting the hours until he gets to see New York from street level. It took a lot of bitching and blackmailing and politicking for Tony to even convince Fury he should go, but Steve has the most amazing puppy-eyes when he wants something and apparently even Fury isn't immune. </p>\n<p>\"We have a couple of options,\" Tony continues. \"We can grab a copter and set down at LaGuardia and catch a cab to my place.\"</p>\n<p>\"Or?\"</p>\n<p>\"Or we can jump,\" Tony says. \"You grab onto the suit and I fly us down. I can put us on the ground anywhere we want.\"</p>\n<p>Steve just looks at him, wide-eyed with excitement.</p>\n<p>\"Suit?\" Tony asks.</p>\n<p>\"Suit,\" Steve replies. </p>\n<p>An hour finds them on the flight deck, Tony in his armor, Steve in a leather jacket with a duffel of clothing and his shield strapped to his shoulder, a comm set in his ear so they can talk during the flight. Tony extends the brake flaps on the backs of his calves and points to them. \"Feet there.\"</p>\n<p>\"Are you sure?\" Steve asks.</p>\n<p>\"Trust me, I built the suit, they can handle it. Get an arm around my neck -- yes, like that,\" Tony says, as Steve swings his right arm around the throat of the armor and uses the leverage to balance while he steps up onto the flaps. Tony bounces once or twice, getting used to the weight. \"Okay, whatever happens, do not let go.\"</p>\n<p>\"I've parachuted before,\" Steve reminds him. \"I'm used to free-fall.\"</p>\n<p>\"I'm just sayin',\" Tony replies, and lifts off, hovering about a foot above the deck. Fury and Coulson are there, watching, and he can see Clint crouched up above on a gun turret. \"See you Monday, Director.\"</p>\n<p>\"Bring him back in one piece,\" Fury intones. </p>\n<p>\"Love you too,\" Tony replies. \"Ready, Steve?\"</p>\n<p>\"Ready!\" Steve replies, tapping Tony on the helmet. Tony grins, powers up the stabilizers in his hands, and lunges forward, leaving the safety of the helicarrier and dropping into a dive over Manhattan. He can hear Steve whooping over his comm. </p>\n<p>They free-fall through the air, Tony doing careful rolls and turns once he realizes Steve can handle it, until they pass the tops of the buildings. Tony twists to get upright, firing the repulsors, and levels out a few stories above the street. Below, people point and wave. He can feel Steve waving back. </p>\n<p>They buzz Brooklyn so Steve can get a closer look, and then circle west over Red Hook, the bay, and back past the southern tip of Manhattan. Stark Solutions doesn't yet have its own building complex the way SI did, but Tony has four floors for Solutions in a downtown high-rise and an apartment with a workshop on the upper west side. Always good to have diverse locations -- he still keeps an armory in the old Makluan temple in Jersey as well, and Solutions has backup server farms with saferooms in a couple of different midwestern states. It's not paranoia when people really are out to get you.</p>\n<p>When they finally land on the grassy garden roof of Tony's apartment building, Steve is windblown and breathless, wild-eyed. </p>\n<p>\"That was wonderful!\" he blurts, as Tony retracts the helmet and keys in the security code to the building. Anyone landing on the roof has thirty seconds to disable security before an electrified grid buried just below the grass sets them on fire. There are a couple of villains out there who could survive it, but most of them don't favor the direct approach, and there seems to be a code: only the really desperate or the really nasty go after your home and your family. </p>\n<p>\"Glad you liked it,\" Tony replies, as the rooftop door swings open. \"Come on inside, we can dump your bag and then go out if you want.\"</p>\n<p>Steve follows him down a level, taking in the brick walls and wood floors with surprise. The building is an old rehabbed mansion, one apartment per floor -- perhaps a little fancier than Tony needs, but he likes it here. </p>\n<p>\"Home sweet home,\" he announces, shedding the rest of the armor in the living room, sending it to stand in a corner like a museum display. </p>\n<p>\"This is awfully nice,\" Steve says, drifting to the big windows that look out on the street. </p>\n<p>\"Glad you like it. Guest bedroom's through there,\" Tony gestures over his shoulder, then walks up to the window and taps on it. Digital projections ripple into existence, and Steve starts back before drawing closer. \"Weather'll be nice tomorrow,\" Tony adds, sliding the weather report aside. Up in the corner, photos of him currently being posted from Instagram cycle through slowly; he pauses one of them hovering over the street, Steve's arm upraised to wave, and saves it to his photocloud absently. </p>\n<p>To his surprise, Steve reaches out as well, tapping on the glass as if he wants its attention, then drifting a hand up to the map application in the corner, touching it gently. The window fills with a map of the US, multiple pinpricks of light marking the locations of the Rescue, War Machine, and Iron Man armor, as well as the Helicarrier, a couple of Stark Solutions machines undergoing field-testing, and a few villains who haven't yet figured out Tony has a tracker on them. </p>\n<p>Tony watches, interested, as Steve double-taps New York to zoom in, then places his hands around Manhattan and draws them apart to zoom in further. He's been learning fast. Now the only dots on the map are the Helicarrier to the south of the island and the Iron Man armor. Steve zooms in further on Iron Man, until he has a street map of the immediate area. He stares at it, brow furrowed. </p>\n<p>Tony realizes Steve is memorizing the map. </p>\n<p>\"So you want to get a look at the city?\" he asks, turning to Steve. \"I won't have a lot of time to take you around myself tomorrow.\"</p>\n<p>Steve nods. \"Can we?\"</p>\n<p>\"Sure. Come on,\" Tony answers, and leads him down through the maze of stairwells and corridors to the street. </p>\n<p>They don't really go anywhere in particular; they just walk around, but Steve can't stop looking at everything, can't stop craning his neck to see the skyline of midtown above the relatively low roofs of the upper west side. He watches people walk past talking on their phones, stares at cars, peers into store windows. Tony just watches Steve, amused.</p>\n<p>\"It's like living in science fiction,\" Steve says finally, when they've bought some coffee and settled down at a table next to the window. He has a goofy smile on his face. \"It makes it all worthwhile.\"</p>\n<p>\"It all?\" Tony asks.</p>\n<p>\"Well. I mean. All the history I missed...\" Steve looks out the window, fascinated. \"We might have had some rough times, and it sure is different than it was, but look at New York. I never stopped loving this town. Never could. And look at how fantastic it is now.\" </p>\n<p>\"You don't miss the old one?\"</p>\n<p>Steve looks down at his coffee. \"I dunno. I was gone for an awful long time anyway, what with the war. Didn't have any parents to miss, no brothers or sisters.\"</p>\n<p>He's hiding something. Or, well, not mentioning something, anyway, but Tony doesn't press. </p>\n<p>\"Don't you like it?\" Steve asks.</p>\n<p>\"Sure, but I'm used to it,\" Tony replies. He smiles, and Steve smiles back. \"Glad you do, though.\"</p>\n<p>Thursday is a mess of meetings and Tony has to be on his best salesman behavior, soothing investors and presenting new inventions from Stark Solution's brain trust (him). Nothing goes wrong, exactly, it's just boring and wearying. </p>\n<p>He told Steve he could wander around the city, but Steve doesn't stray far -- he spends a long time standing at the windows on the fortieth floor, staring out, and then goes downstairs. Tony tracks him on a monitor in the corner of his screen, but he never gets more than four blocks away. By the time Tony is done with meetings at three, Steve is back in the office, reading a magazine in the lobby.</p>\n<p>\"Done for the day?\" he asks, once Tony has escorted his last guest out.</p>\n<p>\"Not quite,\" Tony says sourly. \"Paperwork.\"</p>\n<p>Steve nods. \"Want me to get you anything? Did you eat lunch?\"</p>\n<p>Tony didn't. He's gotten used to it in the last week, and his stomach growls. Steve grins.</p>\n<p>\"I'll find you something,\" he says, and disappears again. Tony turns to Annie, who has been unobtrusively staring every time she sees Steve.</p>\n<p>\"You were right,\" she says, watching his ass as he gets into the elevator. \"That was worth it.\"</p>\n<p>\"I knew you'd appreciate him,\" Tony replies. </p>\n<p>\"What's his story?\"</p>\n<p>\"He's been out of the country for a while,\" Tony says.</p>\n<p>Thursday night, Tony takes Steve out for sushi, something he's never experienced. Steve looks skeptical until his first bite, and then he looks like he's a little in love. They taste their way through the entire menu, the chefs smiling and flashing their knives benevolently, laughing at Tony when he tries to charm a shot of sake out of them. People point and whisper: that's Iron Man. That's Tony Stark, the millionaire wunderkind, the boy who'll be a billionaire by the time he's twenty. Tony ignores it, but Steve shoots puzzled, angry looks at the people who whisper behind their menus. </p>\n<p>\"Doesn't it bother you?\" he asks, glaring as someone takes a picture with their cameraphone. </p>\n<p>\"Not anymore,\" Tony says. \"If you think this is bad, you should have been here the week I came out as Iron Man.\" </p>\n<p>\"I used to wonder why I couldn't just say I was Captain America,\" Steve says in a low voice. \"Guess now I know.\"</p>\n<p>Friday morning, Tony is the top story on half a dozen gossip blogs. Blurry photos are published of Iron Man with Steve hanging onto his shoulders, dim photos of Tony and Steve eating sushi. They ask rhetorical questions like whether Tony has abandoned his friends Rescue (aka Pepper Potts) and War Machine (identity unknown) for the mysterious blond man. Most of them seem to have formulated some kind of story that Iron Man rescued the mystery man from danger and treated him to dinner, never mind that the flight and the dinner were twenty-four hours apart. Steve is horrified; Tony is amused. </p>\n<p>\"Honestly, it's no big deal,\" Tony says, and then he thinks about it, and something twists in his guts. \"I mean. If you hang out with me, it's just gonna happen.\"</p>\n<p>\"But it's awful,\" Steve says. \"They're just making up stories about you.\"</p>\n<p>\"Can't be stopped, stupid to try,\" Tony replies. \"Look, maybe you should...\" he swallows. \"There are more low-profile people that could show you around New York. Peter would do it. Or even Coulson.\" </p>\n<p>\"As if I'd let a few nasty stories scare me off,\" Steve sniffs. Tony's stomach-ache eases a little. \"It's not me I'm worried about.\"</p>\n<p>\"You should be. A little. They'll find out your name eventually. Depending on how you play it, they'll figure out you're Captain America.\"</p>\n<p>Steve hunches over in his chair, looking out Tony's kitchen window. </p>\n<p>\"What do you think is better?\" he asks. \"Being public, or having a secret identity?\"</p>\n<p>Tony shrugs. \"It's not really...like, I think I get a lot less shit than Peter, because my friends know if I'm disappearing suddenly I have a reason. On the other hand, I get a lot more shit in the newspapers than Peter does, at least as myself.\"</p>\n<p>\"You swear a lot,\" Steve says mildly.</p>\n<p>\"It's cathartic. Peter gets his fair share of...crap...from the media, but only as Spider-man. He gets to live his life peacefully as Peter, mostly. Me, I'm always going to live in public now. But then I always have, so that isn't a big deal.\" Tony taps on the table, bringing up his archive file. He spins one newspaper clipping around and pushes it across to Steve. Steve's catching on quick; he taps on the image to stop its movement. </p>\n<p>The article is ten years old, and it's about the first robot Tony built. He was eight and it wasn't that impressive a robot but it was pretty impressive for an eight-year-old. When he showed it off at a tech expo, the world was smitten by the dark-haired little boy with the engaging smile and the one-armed robot. Two years later, a souped-up incarnation of his robot was being put to use in surgical suites. </p>\n<p>\"Your father allowed this?\" Steve asks. </p>\n<p>\"He knew I'd need to get used to it,\" Tony replies indifferently. Dad had given him the option of backing out, but Tony had known too, even then, that this was going to be his life. Steve considers the article, then sends it spinning back. Tony archives it. </p>\n<p>\"Look,\" Tony says. \"If you pick up the shield again, if you go out there as Captain America, you and I are going to work together. Sooner or later it'll happen, and at this point SHIELD will probably ask us to partner.\"</p>\n<p>\"You think?\"</p>\n<p>\"I don't work for SHIELD, but I wouldn't mind,\" Tony says honestly. Steve looks pleased, blushing a little. \"You could use a wingman till you find your feet, and I like having backup. My point is, if you fight with me as Captain America <i>and</i> if you're seen with me as Steve Rogers, people are going to add it up. So you can be seen with me as Steve Rogers, or fight with me as Captain America, but you can't have it all. Unless you go public.\"</p>\n<p>\"That's an awful way to look at it.\"</p>\n<p>\"That's the way it is,\" Tony replies. </p>\n<p>\"So you think I should. Just...get up on a soapbox and say I'm Captain America, tell the whole story, and go out there and fight?\"</p>\n<p>\"You haven't got any family to protect,\" Tony says, and then winces. \"Sorry, that came out wrong.\" </p>\n<p>\"No, it's okay. I asked you to help me out with this stuff,\" Steve says. </p>\n<p>\"I didn't want to be public at first, but...I think it's easier. Everyone has to choose, that's part of the gig.\"</p>\n<p>\"I'll think about it. It's a lot more complicated than it used to be,\" Steve murmurs. </p>\n<p>\"Yeah, but on the bright side, <i>way</i> fewer Nazis,\" Tony points out. That earns him a grin.</p>\n<p>It's an easy schedule to fall into, given that Tony can get them to the Helicarrier any time they like. The first part of the week, Steve trains and goes through assessments while Tony works remotely; when they have downtime, they have history and pop culture lessons. Wednesday nights, they take the dive off the Helicarrier and for the rest of the week Steve explores the city while Tony works. The weekend is mostly their own. Iron Man ends up in a few skirmishes with supervillains, and Tony can feel Steve's impatience to join in the fight, but for whatever reason Fury keeps him back. </p>\n<p>Sometimes, on Saturday nights, Tony puts on music from the era they're currently studying and he and Steve have a rock-the-house dance party. Steve has moves. He likes Cyndi Lauper, though he gets sad eyes whenever <i>Time After Time</i> comes on. Then they go out for ice cream and Staring At Manhattan, something that always cheers Steve up. Pretty soon Tony and his tall friend are yesterday's news in the gossip blogs. </p>\n<p>It lasts a month that way, long enough that Tony's become essentially used to it, long enough that Steve is catching up fast to the modern day. So Tony's not entirely surprised when they arrive at the Helicarrier on Sunday night to find Agent Coulson waiting for them. </p>\n<p>Steve lets go of Tony's neck and drops lightly to the flight deck, adjusting the duffel on his shoulder. Tony flips up his faceplate and retracts the helmet, boots clanking slightly as he comes up to take the tablet from Coulson and sign himself and Steve back in. </p>\n<p>\"Mr. Stark,\" Coulson says, handing it over. \"Captain Rogers,\" he adds, a little more deferentially. </p>\n<p>\"Agent Coulson,\" Tony replies, signing deftly. \"To what do we owe the honor?\"</p>\n<p>Coulson has always come across as a bland, unobtrusive man. He accepts the tablet back with no expression on his face at all.</p>\n<p>\"Captain, Director Fury would like you to report to the briefing room at 0930 tomorrow,\" he says. He glances at Tony. \"Mr. Stark, he...strongly encourages you to attend as well.\"</p>\n<p>\"Is this about my clearance to fight?\" Steve asks, excitement creeping into his voice.</p>\n<p>\"I'm afraid I'm not at liberty to say,\" Coulson replies. \"0930.\"</p>\n<p>\"Yessir,\" Steve says, straightening his shoulders. He shoots Tony a thrilled sidelong look. \"We'll be there sir, won't we, Tony?\"</p>\n<p>\"Well, if I'm <i>strongly encouraged</i>,\" Tony sighs. \"Thanks, Coulson. Mess still open? We haven't had dinner yet.\"</p>\n<p>\"It's mac and cheese night,\" Coulson replies, still utterly expressionless. Steve grabs Tony's wrist and hauls him along, because you can take the man out for sushi, steak, or the best fusion cuisine in the city, but there is nothing that entices Steve like institutional macaroni and cheese. It's bewildering. </p>\n<p>Among the half dozen agents catching a late meal in the mess hall, Peter sticks out in his civs like a sore thumb. Tony and Steve pile their plates with macaroni before joining him. He gives them a morose wave.</p>\n<p>\"What's eating you?\" Steve asks kindly. \"You look like someone kicked your dog.\"</p>\n<p>\"Assessments,\" Peter says, pushing cold macaroni around on his plate. \"We spent all weekend doing superhero final exams.\"</p>\n<p>\"How'd you do?\" Tony asks. </p>\n<p>\"Bombed 'em, I guess,\" Peter replies, scowling at his plate. \"The team messed up. We didn't get any of our objectives and I had to spend half my time yelling at Nova. Luke's the only one who got all the way through the exam course.\"</p>\n<p>\"Well, it's not like they can take away your superhero card,\" Tony says, trying to cheer him up. </p>\n<p>\"No, but Coulson can bench me.\" Peter heaves a sigh. \"Anyway, we get the results back tomorrow, guess I can look forward to another thrilling six months with Team Bicker And Fail.\"</p>\n<p>\"Tough break,\" Steve says sympathetically, patting Peter on the shoulder. \"They know what they're doing, I suppose. I'm finding out tomorrow too.\"</p>\n<p>\"Yeah, like they're going to keep <i>Captain America</i> on the sidelines,\" Peter replies. \"I've seen your numbers. You're assessing higher than Tony, and <i>he</i> gets to be a free agent.\"</p>\n<p>\"No get-to about it,\" Tony says. \"I just told SHIELD to fuck off. They're not the boss of me.\"</p>\n<p>\"Must be nice being a millionaire with his own suit of armor,\" Peter says pointedly.</p>\n<p>\"Gentlemen,\" Steve warns. Tony likes that about Steve; he's never treated Peter as less than a fellow soldier. \"No use worrying about it until tomorrow.\"</p>\n<p>Tony thinks Steve can't possibly be as calm as he appears. Tony's certainly not, which is why after he leaves Steve at his quarters, he goes down to the engine room and kicks around there for a while. The maintenance crew is mostly older guys who've been working on machines since they were his age, and they all get along well. Tony's used to hanging out with people older than him, anyhow. He calibrates some energy outputs, does a hand inspection of a new propeller blade for one of the engines, and gets to bed around two in the morning, comfortably exhausted.</p>\n<p>The only thing that gets him to the meeting room the next morning is the giant cup of coffee Steve brings him, and the fact that Steve breaks into his guest quarters, looms until he gets up, and then gives him puppy eyes until he makes himself presentable. Then coffee, and a sleepy stumble towards the briefing room. </p>\n<p>Peter's already there, sitting next to Luke. They both look surprised to see him and Steve. There's also a short, wild-looking man with his feet propped on the briefing table, chewing on an unlit cigar. To round out the circus act, just after Tony and Steve find seats, Natasha Romanov walks in. </p>\n<p>There's a curseword and a scuffle from above, and then Clint Barton drops down from the ceiling. He looks like he maybe didn't mean to do it. </p>\n<p>\"Tasha!\" he says, blinking.</p>\n<p>She grins. \"Hello, Clint.\"</p>\n<p>\"Awkwaaaard,\" Peter whispers to Tony. </p>\n<p>\"Well, I'm here,\" Clint announces, bravado apparently overcoming surprise. \"You can all stop slash start worrying.\"</p>\n<p>\"Put your butt in a chair, Barton,\" says a new voice, and Coulson walks in as well. Tony wonders if he's about to undergo some kind of terrible social experiment. He ticks them off in his mind:</p>\n<p>-- Steve Rogers, super-soldier from the forties.<br>\n-- Luke Cage, indestructible street fighting teenager with superhuman strength.<br>\n-- Peter Parker, wiseass dork with freaky strength and the ability (and the inclination) to stick to walls.<br>\n-- Clint Barton, former circus performer, former thief.<br>\n-- Natasha Romanov, former spy, former thief.<br>\n-- Tony Stark, genius inventor, millionaire, built himself a suit of armor that both flies <i>and</i> has rollerblades.<br>\n-- Creepy dude in the corner.</p>\n<p>And Phil Coulson, whose last job was undercover as a school principal.</p>\n<p>Interesting. </p>\n<p>\"Lady, gentlemen,\" Coulson says, and then adds, \"Barton.\"</p>\n<p>Clint clutches his chest as if he's been shot.</p>\n<p>\"You've been asked to assemble here today so that you can be briefed on a new SHIELD operation,\" Coulson continues, setting his tablet flat on the table and tapping it. A holographic projection of a large, stylized A appears. \"The Avengers Initiative.\" </p>\n<p>\"Avengin' what?\" the unknown guy in the corner asks. </p>\n<p>\"That remains to be seen, Mr. Logan,\" Coulson replies. </p>\n<p>\"Wait -- Logan?\" Clint asks, pivoting sharply. The man named Logan rolls his eyes. Natasha sits forward, looking interested. </p>\n<p>\"Should I know who that is?\" Steve asks Tony in an undertone. Tony doesn't know who that is, so he shrugs. </p>\n<p>Coulson taps the tablet, and an image of a skeleton with huge blades attached to its knuckles appears. \"Jim Logan, aka Wolverine.\" </p>\n<p>Tony knows who Wolverine is. He peers at him with renewed interest. One of the all-time greats. Still kind of creepy. Steve sucks air through his teeth, and Logan gives him a sardonic salute. </p>\n<p>Coulson taps again, and a spiderweb and one flexed arm appear. \"Peter Parker and Luke Cage, aka Spider-man and Power Man.\" Tap; an eyeball and a forearm, the latter adorned with some kind of weapon. \"Clint Barton and Natasha Romanov, aka Hawkeye and Black Widow.\" Tap; the Iron Man helmet and a strand of Steve's DNA. \"Tony Stark and Steve Rogers, aka Iron Man and Captain America. Now that we have introductions out of the way, does anyone object to moving along?\" </p>\n<p>\"If I had my way we'd have moved already,\" Logan says. </p>\n<p>\"The goal of the Avengers Initiative is to create a standing, stable team of men and women with extraordinary abilities,\" Coulson continues, ignoring Logan's huff of impatience. \"This is not a military strike force, but a group of people whose sole purpose is to react to threats against national security and protect America, on American soil, from assaults the military isn't capable of handling. The Avengers are to be apolitical and purely a defensive measure. Trained, supported, and provided intel by SHIELD, of course,\" he adds, with what almost looks like a smile. \"And the seven of you have been nominated as our first choices.\"</p>\n<p>Tony glances at Peter and Luke. They both look stunned. Steve is looking noble and dedicated, like he sometimes does. Clint has just punched the air. Natasha, interestingly, is watching Logan.</p>\n<p>\"Wait just a <i>god damned minute</i>,\" Logan says. \"I told Fury I didn't want to be a government stooge.\"</p>\n<p>\"Hardly a stooge, Mr. Logan -- \"</p>\n<p>\"I ain't interested in joining some SHIELD PR team,\" Logan interrupts, rising. </p>\n<p>\"We'd like you to understand -- \"</p>\n<p>\"Coulson,\" Logan says. \"I came up to this flyin' heap -- \"</p>\n<p>\"Hey!\" Tony interjects, offended.</p>\n<p>\" -- as a favor to you. My gratitude don't extend to babysittin'.\" </p>\n<p>\"If you'd take a minute to listen to the proposal we've assembled,\" Coulson says, still calm and cool, but Logan cuts him off.</p>\n<p>\"Sorry, baby, I ain't the marrying kind,\" he replies, and he's out the door before anyone else can speak. Steve half-rises from his chair, but Coulson puts up a hand, and Steve stills. </p>\n<p>\"Let him go,\" he says, and flicks his fingers through the hologram, dissolving Logan's figure. </p>\n<p>\"Sir, I could talk to him,\" Steve offers.</p>\n<p>\"Logan was a long shot, Captain. I'd rather spend my time constructively. As I was saying,\" and this time he does smile, fleetingly, \"the six of you are our first choices for the Initiative.\"</p>\n<p>Peter raises a hand. Tony rubs his forehead. </p>\n<p>\"Yes, Mr. Parker,\" Coulson says, unruffled. </p>\n<p>\"I'm sorry, are you sure I'm in the right room?\" Peter asks. \"Cause, you know. Bombed the final.\"</p>\n<p>\"Your briefing packets will go into more detail, but I can assure you that you were hand-picked by Director Fury and vetted at the highest levels,\" Coulson replies. \"Each of you has unique talents to offer and we feel that as a team you will work well together. Most of you have worked with at least one of the others in some capacity -- some more...productively than others,\" he adds, and Clint and Natasha grin at each other. \"Most of you also have direct experience working with Mr. Stark.\"</p>\n<p>Tony goes very still, because he can tell what's coming next, and he's about to be terrified.</p>\n<p>\"After a careful assessment, Mr. Stark has been selected to lead the team, with Captain Rogers as second in command,\" Coulson continues. There's the terror. Oh good. \"As Mr. Stark is not on the SHIELD payroll, he's an ideal choice to maintain an impression of objectivity and independence for the Initiative with the media.\"</p>\n<p>\"Uh,\" Tony says. \"Mr. Stark is eighteen and kind of has a day job.\"</p>\n<p>\"None of you will be asked to commit full time. Mr. Parker and Mr. Cage are finishing school, and Agents Barton and Romanov will have other SHIELD assignments,\" Coulson says smoothly. Tony isn't sure but he thinks he may have drastically underestimated Phil Coulson. \"As a team, your job is to be <i>ready</i> to fight.\"</p>\n<p>\"Why isn't Director Fury telling us this himself?\" Luke asks. He looks like he thinks this might be some kind of terrible joke. </p>\n<p>\"Because I've been appointed your handler,\" Coulson replies. \"Those of you who decide to join the Initiative will route your requests, needs, and concerns through me. I'll be with you in the field, and I'll oversee your training.\"</p>\n<p>\"Got tired of the principal gig, huh?\" Clint asks with a grin. Coulson shoots him a narrow look. </p>\n<p>\"What if we don't want to join the Initiative?\" Steve asks. Everyone looks at him, surprised. He holds up his hands, a gesture of innocence. \"I'm in. Just saying. Does everyone get the option of walking out like Mr. Logan did?\" </p>\n<p>\"Of course,\" Coulson replies. </p>\n<p>There's a silent moment while he looks at each of them in turn. Nobody moves. Finally, Peter raises his hand again.</p>\n<p>\"You really don't need to do that, Mr. Parker,\" Coulson says. </p>\n<p>\"Sorry, uh.\" Peter swallows. \"Luke and I already had a team. What happens to them?\"</p>\n<p>\"Your teammates will continue with training, in accordance with their assessments,\" Coulson replies. </p>\n<p>\"What's the catch?\" Luke asks.</p>\n<p>\"There's no catch, Mr. Cage, aside from hard work. The Avengers will be the most elite superhero team on the planet. You will be visible, efficient, and strenuously trained.\"</p>\n<p>\"Visible,\" Peter repeats. \"Like Tony's visible?\"</p>\n<p>\"More or less. You'll be given the option of maintaining your private identity.\"</p>\n<p>\"Ugh, masks,\" Clint groans. </p>\n<p>\"Sweaty and unattractive,\" Natasha agrees.</p>\n<p>\"Speak for yourself,\" Peter retorts. </p>\n<p>\"I think we just did,\" Clint answers. </p>\n<p>\"Oh, good, you're getting along already,\" Coulson sighs. He taps his tablet again, and the holograms vanish. \"Take some time to discuss it amongst yourselves. Your briefing packets have been sent to your secure SHIELD email. When you're finished, please sign and return your statement of acceptance, or your withdrawal documentation, as the case may be.\"</p>\n<p>He walks out. </p>\n<p>They're all quiet as they pull their computers forward. Steve concentrates fiercely on his, tapping on the screen with care.</p>\n<p>Tony, to his surprise, doesn't just have his own paperwork; he has assessments of the rest of the team. Peter is <i>composed under pressure</i> and <i>a stabilizing influence</i> which is kind of funny; Luke is <i>suited to teamwork, particularly mature</i> and both of them are <i>incapable of advancing skills further with their current team</i>. Clint is <i>excessively dedicated to the Initiative</i> and Natasha has <i>particular skills on point as a stealth operative</i>. Steve, unsurprisingly, is <i>a capable, experienced veteran</i> and like Peter, <i>a stabilizing influence</i>. </p>\n<p>Tony finds his own profile. </p>\n<p>\n<i>A non-partisan, highly visible and identifiable public figure with massive general appeal. Intelligent, flexible, and independent, with superior social skills and command capability as proven by previous experience.</i>\n</p>\n<p>That's nice. Tony preens. </p>\n<p>\"Well,\" Steve says, setting his tablet down again. \"I have no problems with this. Whatever gets me back in the stars and stripes.\"</p>\n<p>\"Are we one hundred percent sure there's not another Peter Parker?\" Peter asks, and Luke slaps him in the back of the head.</p>\n<p>\"Don't be an idiot. I'm in,\" Luke announces. \"Parker's in too.\"</p>\n<p>\"Already sent off my acceptance,\" Clint says smugly. Natasha nods. </p>\n<p>All of them look at Tony.</p>\n<p>\"Um,\" Tony says. \"I'm sorry, are you guys seriously expecting me to be all, here are your orders, do what I say? 'Cause Peter's seen me naked on security footage -- \"</p>\n<p>\"Who hasn't?\" Natasha asks. </p>\n<p>\"Thanks. And Luke could snap me in half. And like...you're both older than me,\" to Clint and Natasha, \"and you're <i>Captain America</i>,\" Tony finishes. </p>\n<p>\"You don't think you can do it?\" Steve asks, perplexed. </p>\n<p>\"You run a million-dollar company,\" Natasha points out. </p>\n<p>\"I'm just saying, nobody's used to taking orders from me in a superhero capacity,\" Tony points out.</p>\n<p>\"<i>War Machine</i>,\" Peter coughs. </p>\n<p>\"Ah - ah - ah -- <i>Rescue</i>,\" Luke sneezes. </p>\n<p>\"And if I'm not on the team, you're in as leader, which seems...better,\" Tony says, looking at Steve. </p>\n<p>\"Um, not to make this about SHIELD, but Coulson's pretty smart,\" Clint says. \"If he picked you, I'm good with it.\"</p>\n<p>\"He's got a point. I thought we were gonna be grounded,\" Peter adds to Luke, who nods. </p>\n<p>\"I think you can do it,\" Steve says. </p>\n<p>It's the quiet, intense way he says it that gets to Tony, fills him with warmth. Captain America thinks he can lead the Avengers. <i>Steve</i>, who has seen Tony's embarrassing dancing and poor chopstick skills and dorky collection of comic books, thinks he can lead the Avengers. </p>\n<p>\"Okay,\" he says, and shoots off the acceptance packet before he can rethink it. \"I'm in too.\"</p>\n<p>Their first time in combat as Avengers goes something like this:</p>\n<p>Clint breaks his leg. Natasha breaks an SUV. Peter accidentally webs Luke to a wall temporarily. Luke breaks <i>two</i> SUVs. Tony breaks a building. Steve employs a maneuver Tony hasn't seen him try outside of one of their dance parties and it ends up taking out three Doombots at once. Peter makes eight terrible puns, two of them while riding a Doombot gaily through the air towards certain death. Tony reprograms a dimensional portal over Manhattan so that instead of opening into a realm of fiery destruction, it causes a temporary rain of alien cupcakes, thus saving Peter from certain death. </p>\n<p>Luke spots the source of the problem, reports it in, and then goes after it, Natasha a beat behind him. Clint, leg already broken, pulls three cops and a dog to safety before taking out eighteen doombots with sixteen arrows. Natasha sets off an explosion which nearly kills her but closes the dimensional portal completely. Tony contains half the blast with his armor and Luke contains the other half with one of the broken SUVs. </p>\n<p>There's some property damage, but mostly it's just cupcakes. (Could be worse. Could probably not be more embarrassing.)</p>\n<p>Somehow, the reporters know where the Avengers are gathering to recover, and they catch Peter and Clint doing an awesome mid-air chest bump right before Clint collapses. Steve slams Tony's helmet with his hands and laughs in his faceplate, eyes sparkling. Luke does a victory dance. Natasha takes pictures with her phone. </p>\n<p>Nobody dies. </p>\n<p>They save the world. </p>\n<p>The crowd goes wild. </p>\n<p>Tony is busy for the first few minutes making sure everyone's okay; the worst that's happened other than Clint's broken leg is that Peter is smeared in alien frosting, which is not a mortal wound. Coulson, who had been a reassuring voice in their comms during the fight, is already splinting Clint's leg when Tony turns and realizes that half the newsmedia in New York are gathered at a SHIELD-erected barrier, watching them. </p>\n<p>Time to do what he does -- well, not best, but at least frequently.</p>\n<p>Tony retracts his helmet and walks up to the barrier. </p>\n<p>\"Hi,\" he says, as the reporters wave microphones in his face. \"Oh, hey, uh, hi, hello, how ya doing, what's up? So, this is all very interesting, huh? I'm Tony Stark, you may know me as Iron Man.\"</p>\n<p>\"Iron Man!\" \"Iron Man, what happened here?\" \"Iron Man, can you give us a statement?\" \"Iron Man, is that <i>Captain America?</i>\" \"Iron Man, why are you associating with Spider-man, a known -- \"</p>\n<p>\"Oh, you, are you from the Daily Bugle?\" Tony guesses. The man nods. \"Okay, on three everyone push him waaaaay to the back. One, two, three,\" he says, and the good men and women of the Fourth Estate crowd the asshole away from the barrier. \"Cool. So! Welcome. What you've just seen is some supervillainny in action, thwarted by the Avengers Initiative.\"</p>\n<p>Tony spends the next twenty minutes explaining the Avengers to the media, being awesomely charismatic, and informing them that no, he's not at liberty to reveal the identities of Power Man, Spider-man, or Captain America. </p>\n<p>\"Actually,\" Steve says, joining him at the barrier. He holds up a hand briefly to block the flashbulbs. \"Um, wow, guys, a little less lightning? Thanks,\" he says, as the cameras are lowered. \"Look, this is kind of a long story, and I'm sure SHIELD will be talking to everyone about...us, but my identity isn't a secret.\" He reaches up and pulls his cowl back, off his head. There's that matinee-idol smile, the perfect blond hair, the handsome face. Tony stares up at him, proud and...and honored, to be fighting with him. </p>\n<p>\"My name is Steve Rogers,\" he says. \"I'm Captain America.\" </p>\n<p>\"Way to warn me,\" Tony says out of the corner of his mouth, as the cameras go back up and the flashes intensify. </p>\n<p>\"Spur of the moment decision,\" Steve replies. </p>\n<p>***</p>\n<p>They watch Steve's unmasking on the six o'clock news on the TV in Clint's hospital room. Clint is furious that he hurt himself their first time out of the gate, but he can still shoot, which Steve assures him is what counts. Tony's already working on digital diagrams for a bionic support cast that will sheath the leg and protect the bone without losing mobility. </p>\n<p>\"You'll be back in the field in a week,\" he assures Clint. </p>\n<p>\"Booya,\" Clint replies, a little dopey from pain medication. </p>\n<p>\"Booya,\" Coulson mutters disbelievingly. </p>\n<p>Peter and Luke are still on an adrenaline high; Tony glances at Coulson and then rolls his eyes towards the youngest members of the team, but Coulson just says \"They'll crash\" and sure enough, about ten minutes later Peter is passed out on the other hospital bed in the room and Luke is asleep in a chair. </p>\n<p>\"This was good work,\" Coulson says, muting the television. \"For your first time out, it wasn't unimpressive. It wasn't impressive, but now you have some field knowledge to apply to your drills.\"</p>\n<p>\"Gee, don't flatter me,\" Tony says, grinning. \"Okay, so, we could have done better.\"</p>\n<p>\"You will do better,\" Coulson corrects. </p>\n<p>\"Of course we will,\" Steve replies, returning from a food-foraging expedition with Natasha. She settles crosslegged at the foot of Clint's bed, sitting next to his good leg, and Tony hops up to sit on the edge of the bed next to his hip. Steve pulls up a chair and begins unpacking Chinese food. </p>\n<p>\"Should we wake them?\" he asks, jerking his thumb over his shoulder at Peter and Luke.</p>\n<p>\"Let them rest,\" Coulson replies. </p>\n<p>Clint, aiming with his usual care, tries to throw a chopstick and hit Peter in the nose. Coulson snatches it out of the air like it's nothing. Tony blinks. Steve looks impressed. Natasha seems unsurprised. </p>\n<p>\"Did you think I got where I am by being good at filing?\" Coulson asks mildly. </p>\n<p>\"Well, yeah,\" Tony says. </p>\n<p>\"Try again, Mr. Stark,\" Coulson replies. Clint gives him a look of fond exasperation. Coulson smiles at him. Tony narrows his eyes. </p>\n<p>\"So, let's go over what could have gone better today,\" Coulson continues. </p>\n<p>They eat and discuss strategy in low voices. Clint's pretty out of it, but Steve has a lot of good ideas and Natasha had a better view of the ground-level work than Tony did, so combined they can paint a pretty accurate picture. </p>\n<p>It's...nice. It's comfortable, all of them together here, working for a common goal. Tony feels like a part of something, and for the first time in what seems like forever he feels like someone older and more experienced than him has his back. They're not kids running around, fumbling in the dark. They had a job to do and they did it. It's satisfying. </p>\n<p>Steve eventually wakes up Luke and Peter, loading them up with leftovers and assuring Coulson he'll get them home before their respective curfews. Natasha says she'll go along; she's headed back to the Helicarrier and can take Steve with her, then return in the morning to pick Clint and Coulson up and take them back. Tony doesn't bother asking why Coulson isn't going tonight too. </p>\n<p>\"Heading home?\" Coulson asks after the others have gone. Tony stretches, working out kinks left over from fighting. </p>\n<p>\"Big empty apartment,\" Tony yawns. \"I thought I'd stick around till they kick me out.\" </p>\n<p>\"I'll be spending the night,\" Coulson replies. \"Part of the gig as handler.\"</p>\n<p>Handler, Tony's shiny red metallic ass. \"I'm team leader.\"</p>\n<p>\"I'm not going to armwrestle you for the pleasure of sitting vigil, Stark, relax,\" Coulson replies. He cocks an eyebrow. \"Go ahead and ask.\"</p>\n<p>Tony shrugs. \"I thought Clint and Natasha were a thing.\"</p>\n<p>\"Were.\" Coulson sets aside the remains of his meal and leans back. \"They were going to burn each other out. They both knew it.\" He glances at Clint. </p>\n<p>\"So...you guys?\"</p>\n<p>\"I don't think I'm in danger of burning anyone out. Not my style,\" Coulson replies. </p>\n<p>\"How did you know?\" Tony blurts. Coulson gives him a questioning look. \"About him. How did you know he'd be, you know. Interested.\"</p>\n<p>Coulson gives him a tolerant look. \"I didn't.\"</p>\n<p>\"Then how did he?\"</p>\n<p>\"He didn't either,\" Coulson says. \"He took a chance. Something you might consider doing.\" </p>\n<p>Tony stares at him.</p>\n<p>\"Am I that obvious?\" he asks finally, because he thought he was keeping his jealous, immature little crush on Steve well under wraps. </p>\n<p>\"It's my job as your handler to know everything about the young men and women under my authority,\" Coulson says. </p>\n<p>\"What about fraternization?\"</p>\n<p>Coulson's lips twitch. \"Where'd you pick that word up?\" He shakes his head. \"SHIELD isn't a place where normal people go. There isn't a lot of evidence to support the idea that colleagues who fraternize inherently endanger their social unit anyway.\" He smooths a wrinkle in Clint's bedsheet. \"Assessment aside, you were chosen because you're young, driven, intelligent men and women. You have a very clear sense of focus and purpose. Stable, you are not, but that hardly matters. The work is of the utmost importance to all of you. When it comes time to make the hard call -- and you in particular will likely have to do that someday, as the team leader -- emotional attachment won't play a part. Or at any rate, no greater part than it would if you were simply friends.\"</p>\n<p>\"And you?\" Tony asks. </p>\n<p>\"Clint knows what he signed on for. And he knows better than to put off a shot at something good because it might end badly.\"</p>\n<p>Tony tilts his head. He's not as experienced as Coulson, but he knows an evasion when he hears it. </p>\n<p>\"And <i>you?</i>\" he repeats. </p>\n<p>Coulson returns his gaze, level and unafraid. \"One of my few flaws is my unshakable belief that things won't end badly.\" </p>\n<p>\"Seriously?\"</p>\n<p>\"Don't tell Fury,\" Coulson says, and his fingers tap out a brief staccato beat on the rail of the bed before snaking past it to grasp Clint's hand. \"Look,\" he says, and nods at the television, still on mute in the corner. The big stylized Avengers \"A\" is on the screen, along with a slogan: <i>I Believe In Heroes.</i></p>\n<p>\"PR didn't come up with that one,\" Coulson tells him. \"I did.\"</p>\n<p>The day after their first battle, the Avengers are the darlings of New York. Bootleggers are already selling <i>I Believe In Heroes</i> t-shirts, usually with Steve's iconic shield logo on them. </p>\n<p>Tony is used to the attention, and Peter and Luke are protected by their secret identities (which doesn't prevent Peter from sending Tony a cameraphone shot of himself in one of the bootlegged t-shirts). Steve, back on the Helicarrier, is probably blissfully unaware of what's going on, of how the news keeps flashing pictures of him smiling in his Captain America suit. </p>\n<p>Natasha and Clint are not used to being visible, and Tony thinks it's very virtuous of him not to say he told them so when he can see them wishing for masks. </p>\n<p>He did eventually leave Coulson with Clint the previous night, but only so that he could run down to the Stark Solutions fabrication shop and build Clint a boot. When Clint walks out of the hospital without a limp the next morning, wearing his shiny purple metal prosthetic, the reporters camped in front of the hospital go apeshit. </p>\n<p>\"Smile and wave,\" Tony says, through a bright grin. </p>\n<p>\"Eat me,\" Clint replies, through his own smile.</p>\n<p>And so it goes. Tony is back to mostly twenty-hour days, working, fighting evil, drilling with the team. Peter and Luke whine and moan about being superheroes with curfews and homework. Clint thumps around in his boot. Natasha turns down an offer to be the new Bachelorette, as well as an offer for a series called Who Wants To Marry A Heroine, and finally Tony has to threaten to buy and permanently shut down any television network that approaches her, because it's creepy and kind of sexist. </p>\n<p>Steve goes on Tavis Smiley (\"He's the only talk show host who's not an idiot,\" Coulson explains) to prove he really is <i>the</i> Captain America and discuss how that whole thing happened. Tony watches the way his hands move when he talks about how his teammate Tony Stark figured out how to wake him up, the excited smile on his face. He laughs along with the others when Steve re-enacts the whole \"I'm not a Nazi!\" exchange. </p>\n<p>He doesn't get to spend as much time with Steve, and what time they do spend is mostly drills and team exercises, but at least it's something. </p>\n<p>Their second battle isn't as intense as the first, and nobody gets hurt badly. SHIELD still called out War Machine to help, because giant monsters menacing Long Island are apparently a big deal. Tony suspects privately that Rhodey's been pestering the brass to let War Machine out so that he can meet Captain America.</p>\n<p>In the debriefing room afterward, Rhodey retracts his helmet and Tony throws an arm around his shoulders in a hug. He's missed Rhodey like nuts. he only lets him go enough to turn to everyone else for introductions.</p>\n<p>\"Guys, this is Rhodey,\" he says, sweeping them all with a hand. \"Rhodey, you remember Clint and Natasha.\"</p>\n<p>\"Nice to see you guys on the side of good,\" Rhodey says, offering his fist for Clint to bump. He offers it to Natasha too, but she just eyeballs him. </p>\n<p>\"And you met Peter, right?\"</p>\n<p>\"Yeah, good to see ya,\" Rhodey says, giving him a high-fwip. </p>\n<p>\"This is Luke,\" Tony continues. </p>\n<p>\"Nice to meet you,\" Luke says. </p>\n<p>\"Same here, man, I'm a fan of your work,\" Rhodey replies, and Luke looks pleased. </p>\n<p>\"And thiiiiis,\" Tony says, swiveling Rhodey around, \"Is Captain America.\"</p>\n<p>Rhodey untangles himself from Tony and throws up the most amazing salute ever. \"Captain, sir.\"</p>\n<p>Steve smiles. \"At ease, Rhodey. Call me Steve.\"</p>\n<p>\"Chain of command won't let me, Captain,\" Rhodey replies. There's something different about him -- the way he holds himself, the short, clipped way he talks. Tony looks on, interested. </p>\n<p>\"Well, I won't tell your officers if you don't,\" Steve replies. </p>\n<p>\"Honor code, sir.\"</p>\n<p>Steve nods. \"In that case, nice to meet you, Cadet.\"</p>\n<p>\"Thank you, sir.\"</p>\n<p>Tony and Rhodey have known each other practically since they were born, and Tony knows that underneath it all Rhodey's still the same goofball who played cops and robbers with him as a kid, who had his back in high school and helped him start up Stark Solutions, who just laughed and said \"Feel better now?\" when Tony (totally freaked out to admit it) came out to him. </p>\n<p>But during the briefing, at dinner afterward and when they say their goodbyes, he's definitely different. Precise and sharp, disciplined, mature. Tony hopes to god he seems as grownup as Rhodey does. </p>\n<p>\"Hey,\" he says, as Rhodey prepares to head back to West Point, walking out onto the flight deck in War Machine. \"Army looks good on you, Rhodey.\"</p>\n<p>\"Thanks,\" Rhodey replies, a big smile lighting his face. \"Really?\"</p>\n<p>\"Really. I mean. Weird, but good,\" Tony says. </p>\n<p>\"Avengers is a good look for you, too,\" Rhodey replies. \"Hey, when did we grow up?\"</p>\n<p>\"Dunno. I was busy doing other stuff, I guess.\"</p>\n<p>Rhodey bumps him with his shoulder. \"Say hi to Pep, and look after your team.\"</p>\n<p>\"Go kick some cadet ass.\"</p>\n<p>\"You know it,\" Rhodey replies, and pulls his helmet down. \"Seeya, Tony!\"</p>\n<p>Tony stands on the deck for a while, watching War Machine fade into the distance.</p>\n<p>Life is busy, as an Avenger. Tony keeps thinking that this week things will calm down, this week there won't be any national security threats, this week Stark Solutions won't need him to dive in and fix something someone else screwed up. This week he'll get to bed before two in the morning. </p>\n<p>But \"this week\" never comes, and there's nothing to be done about it but push on, drink more coffee and sleep less, fill his days with work, fighting, drilling, fixing, testing, talking to the press about Solutions or about the Avengers, meetings with Coulson, meetings with his shareholders. </p>\n<p>Something has to give soon. </p>\n<p>He doesn't really understand why Steve looks fretful in drills, lately, and he doesn't know what Steve and Coulson keep talking about in low voices when they think he's not paying attention. Tony is <i>always</i> paying attention, it's the problem with being a genius. He knows he's blowing off meals with Steve, but he has work to do, and Steve will understand. Everyone has to blow off dinner now and again. </p>\n<p>Tony isn't prepared to make an actual statement that Pepper's arrival on the Helicarrier brings things to a head. It's probably coincidence. She shows up on a Thursday, reminds Tony that school's out for the summer when he asks if she's missing classes, and stays up half the night catching up on gossip with him. It's nice to talk to Pepper, and while she looks worried Pep's always been a worrier. He's willing to sacrifice sleep to prove to her he's on top of things. </p>\n<p>Friday morning, in the middle of an R&amp;D meeting at Solutions, Tony collapses. </p>\n<p>It's the most mortifying thing that's happened to him since getting his ass kicked by his own time-traveling grandson when he was in high school (long story). He's in the middle of presenting a new circuitboard he's really excited about to a group of his top-level engineers when suddenly the edges of his vision go grey and his ears start ringing. He panics, because he's been in near-death situations before but never in a business meeting, and then his hands go numb and he can't grip the remote to change the Powerpoint slide, and -- </p>\n<p>He wakes up in a hospital room, feeling like crap. He can hear a heated argument going on somewhere nearby. </p>\n<p>\"...purpose behind this. We were monitoring him.\"</p>\n<p>\"Why? And if you were, why couldn't you stop him?\"</p>\n<p>\"I'm not speaking for the pleasure of hearing myself. It was clear that he needed to learn his limits.\"</p>\n<p>\"I think he damn well found one!\"</p>\n<p>Wow, it must be bad if Steve is swearing. </p>\n<p>\"Yes, that's the point.\" It must be <i>really</i> bad, because that's Coulson. Steve was swearing at <i>Coulson</i>. </p>\n<p>Tony would like to vocalize a smart remark, but it comes out as a dry wheeze instead of actual words. When he opens his eyes, Steve's face is <i>right there</i>, and Tony startles. </p>\n<p>\"Sorry! Sorry!\" Steve says, leaning back. Behind him, Tony can see Coulson hovering. He has a bad feeling about this. </p>\n<p>Steve pours him a cup of water and practically forces it on him, and Tony drinks more to satisfy him than because he wants to. It does clear his throat, though, and his head begins to clear as well. </p>\n<p>\"What's going on?\" Tony asks, and then his brain supplies the answer. \"Ohhh, did I seriously just pass out in front of my staff?\"</p>\n<p>\"Um. Yes,\" Steve supplies. </p>\n<p>\"Oh. Well, that's a thing that happened.\" Tony groans. </p>\n<p>\"How do you feel?\" Steve asks anxiously.</p>\n<p>\"Like crap,\" Tony replies, raising a hand to rub his face. \"How long was I out? Long enough to get to a hospital, I guess.\"</p>\n<p>\"You're in SHIELD medical on the helicarrier,\" Coulson says. \"You've been unconscious for about ten hours.\"</p>\n<p>\"<i>Ten hours?</i>\"</p>\n<p>\"You were sedated to give your body some rest. You're suffering from dehydration, malnourishment, and exhaustion,\" Coulson replies. He might as well be reading off a briefing, he looks so calm, and Tony has come to understand that the calmer Coulson seems, the closer he is to snapping and throttling someone. Hasn't happened yet, but Tony figures it's only a matter of time. </p>\n<p>\"Tony,\" Steve says quietly, and his voice is a mixture of reproach, guilt, and sadness. It's the most awful thing Tony's heard in a long time. </p>\n<p>\"Wow, this is going to dip my stock,\" Tony sighs. Steve makes a dry, unhappy sort of laugh. </p>\n<p>\"Officially, it didn't happen. Your staff have signed confidentiality agreements and on paper you're at SHIELD for an extended training retreat over the weekend,\" Coulson says. </p>\n<p>\"Gee, you shouldn't have.\" </p>\n<p>\"No,\" Coulson agrees flatly. \"I shouldn't have. Captain, if you wouldn't mind...?\"</p>\n<p>Steve looks rebellious, but when Coulson jerks his head at the door, he goes. </p>\n<p>And then it's just Tony and Coulson, who seats himself next to the hospital bed and regards Tony for a while before he speaks.</p>\n<p>\"Steve blames himself,\" he says quietly. \"I asked him to let you work it out. He's angry with me, but angrier at himself.\" </p>\n<p>\"Angry about what?\" Tony asks, baffled. </p>\n<p>\"The Avengers,\" Coulson says, as if he's choosing his words with care, \"are young men and women. There are older superheroes who could just as easily have been brought together, more experienced people who might sometimes be better fighters. Clint's the oldest, and he's only twenty-six. Have you ever wondered why you're all so young?\" he asks. </p>\n<p>\"Luck?\" Tony ventures.</p>\n<p>\"Hardly,\" Coulson says drily. \"You were chosen for your skills, but also for your adaptability. People become set in their ways, don't adjust well to change. We wanted a team that could grow and improve as necessary, so that when you are older, you won't be saddled with the flaws some of our current more seasoned assets are unwilling to fix.\" He taps his fingers on the tablet in his lap. \"Part of the point of the Avengers is to force all of you to work on improving your...less than heroic aspects.\" </p>\n<p>\"I'm guessing those weren't detailed in the reports you sent me,\" Tony manages.</p>\n<p>\"No.\" Coulson cocks his head. \"But for the most part, we were fixing things. Peter is learning control and effectiveness. Luke is learning tactics. Clint and Natasha are both learning to work on a multiple-person team, learning to trust the rest of you.\"</p>\n<p>\"Steve?\" Tony asks.</p>\n<p>\"Steve is...learning to be himself,\" Coulson sighs. \"Slowly. More than that it isn't my place to say.\"</p>\n<p>\"And me?\"</p>\n<p>\"Your assessment rated you as a self-abusive, isolationist workaholic,\" Coulson says calmly. \"Which is relatively impressive for someone who only just became eligible to vote.\"</p>\n<p>\"Well, I've always been an overachiver.\"</p>\n<p>\"Which is part of the issue. You are failing more than anyone else on this team at fixing your problems. Making you leader was a calculated bid to see how far you would push yourself before you pulled back.\" </p>\n<p>\"And I didn't pull back,\" Tony surmises. </p>\n<p>\"No, you didn't. You ended up here instead.\"</p>\n<p>Tony turns his head away, unwilling to look at Coulson's face. \"Am I off the Avengers?\" </p>\n<p>\"What would be the point of that?\" Coulson asks, but his voice is a little gentler. \"No. Now we fix the problem.\"</p>\n<p>\"How?\"</p>\n<p>\"That's up to you. Either you're going to have to start delegating more responsibility for the team to Steve, or you're going to have to start trusting your staff at Stark Solutions to function without your constant direct supervision.\"</p>\n<p>Tony turns back, watching him guardedly. This feels a little like a trial.</p>\n<p>\"I can't give up Stark Solutions,\" he says. \"And I won't give up the Avengers unless you make me.\"</p>\n<p>\"Tony, I don't think you understand,\" Coulson replies. \"This isn't about what you choose. There's no wrong answer. You can choose to ease your Avengers responsibilities, and we're not going to penalize you as long as you can still support the team.\"</p>\n<p>\"But it is a test,\" Tony says.</p>\n<p>\"The test is not what you choose. The test is whether or not you make the choice,\" Coulson says. \"You're dangerously close to being underweight for a man of your size, and you were heavily sleep-deprived when you were brought in. That's unacceptable in someone we depend on to protect the public. Your judgment may already be impaired. If you keep going the way you have been, you'll collapse again, and next time it might be in battle. If that happens, yes, your time with the Avengers will be over until you can get your house in order.\" </p>\n<p>\"How do I fix it?\" Tony asks, his voice sounding small and lost. </p>\n<p>\"That's not my call to make,\" Coulson replies. \"For now, eat, rest, and reassess. Steve will be leading the team until you're back on your feet. Fortunately, Rescue is here, and War Machine's on call if heavy artillery is necessary.\" He pauses, clears his throat, and continues. \"You have a team and friends who care about you. Your engineers were very worried. You're not expected to shoulder everything all alone.\"</p>\n<p>It hurts to hear, physically hurts him, a sharp ache in his ribcage and pricking behind his eyes. Rhodey and Pep have always been there for him but that never stopped the feeling after his dad died that he was alone, all alone and defenseless. He got over it, he grieved and worked and went on, but he can't go through that again. He has to <i>stay</i> alone because if he isn't, and if it's all taken from him a second time...</p>\n<p>\"Can I have a computer?\" he asks.</p>\n<p>\"Not tonight. You can sleep, or we can sedate you. You need rest,\" Coulson says. \"In the morning you can have one.\" </p>\n<p>Tony does feel weary, and if he's not allowed to work, there's not much he can do.</p>\n<p>\"I'll sleep,\" he says, closing his eyes. \"You don't need to drug me.\"</p>\n<p>\"I'll send Steve with the computer in the morning,\" Coulson replies. </p>\n<p>Tony's sure he must imagine Coulson's hand brushing his hair back before he leaves. That's not the kind of thing SHIELD agents do.</p>\n<p>When he wakes, Steve isn't there, nor Coulson, nor any of his team. The clock on the wall says it's nine on Saturday morning; normally on a weekend they'd be drilling right now. </p>\n<p>He must have set off some alert somewhere, because he's just pushing himself up in bed when a staff medic pops her head in.</p>\n<p>\"Mr. Stark, you're awake,\" she says, sounding pleased. She has a tablet under her arm. \"Agent Coulson asked me to give this to you.\"</p>\n<p>\"Where's my team?\" Tony asks. </p>\n<p>She looks guilty for a moment, and then offers him the tablet. Tony's heart sinks. Steve doesn't even want to <i>see</i> him. </p>\n<p>Then he sees what's open on the tablet screen.</p>\n<p>Camera feeds, half a dozen of them, shifting and changing as someone in charge sifts through them. He's seen this display before -- it's what Coulson uses in the field, multiple cycling views to help him direct them and warn them of threats. There's the cam Tony built into Steve's earpiece, showing what Steve sees; most of the others look like security cameras. </p>\n<p>All of them are displaying some kind of sea monster molesting the Statue of Liberty.</p>\n<p>Oh man, Steve must be <i>pissed</i>. </p>\n<p>Tony bumps the volume on the tablet and can hear radio chatter between his teammates. He clears half the screen, keeping Steve's cam in view, and bypasses SHIELD's firewall, activating the mic on the tablet. </p>\n<p>\"Hey kids,\" he calls. \"No fair having fun while I'm stuck inside.\"</p>\n<p>\"Iron Man?\" Steve asks. </p>\n<p>\"Stark,\" Coulson snaps. \"If you're en route -- \"</p>\n<p>\"Relax, Coulson, I'm remoting in from my bed of suffering,\" Tony replies. \"Figure you could use a hand. Cap, on your three, you're about to get -- \"</p>\n<p>He winces as something crunches into Steve's shield. </p>\n<p>\"You know what I'm going to do?\" Peter asks, and Tony watches him jump off Lady Liberty's crown, diving into a mass of squidlike appendages. </p>\n<p>\"Please no tentacle-porn jokes,\" Clint calls. Tony can't see him, and he flips through the cameras, but apparently they can't see him either. </p>\n<p>\"Tentacle...porn?\" Steve asks forlornly.</p>\n<p>\"We haven't yet reached that part of the internet,\" Tony says. </p>\n<p>\"Do we have to go there at all?\" </p>\n<p>\"I'm going to stop by the bodega on the way home,\" Peter continues, backflipping out of the tentacles just before something inside them explodes -- oh, good, he's liking the minibombs Tony made for him -- \"and I'm going to buy a couple of tins of those squids in ink they sell, and I'm going to cook and eat this guy's little brothers.\" </p>\n<p>\"You are a bloodthirsty punk,\" Natasha says. \"I knew there was a reason I liked you.\"</p>\n<p>\"Hey, does anyone have eyes on Power Man?\" Tony asks, because not having eyes on Clint is pretty normal, but he's not seeing Luke anywhere either. </p>\n<p>There's a series of negatives, each more alarmed than the last, from each team member. </p>\n<p>Tony is about to get very, very worried when there's a splattering noise, and the nominal head of the giant squid-like thing bursts open from the inside.</p>\n<p>\"Whichever one of you assholes did not notice me getting eaten alive is going to find themselves in a whole lot of pain,\" Luke roars over his comm, bursting out from inside the squid. </p>\n<p>\"Not it!\" Peter calls, as the tentacles begin to go lax, loosening their hold on the Statue of Liberty and slithering to the ground. Tony watches Steve dodge the falling limbs, while Natasha helps Luke clean the ick off himself and Peter swings up to grab Clint from his now-visible nest in the statue's left hand. </p>\n<p>There's almost always a moment of silence, of rest, when the fight's over and before anything else happens. Tony says, \"Good job, guys,\" and watches their faces brighten. Clint gives Steve's cam a thumbs-up for Tony. SHIELD agents begin swarming the island. </p>\n<p>They should be coming back now, but Steve pauses, shifting tentacles out of the way until he's cleared a space in front of the placard at the foot of the plinth. Tony reads the text over his cam as Steve looks at it. He hears Steve breathe a phrase -- <i>Mother of Exiles.</i> </p>\n<p>Steve has kind of a thing about liberty, justice, yearning to breathe free, et cetera. </p>\n<p>\"Stop flirting, Cap,\" Tony says, and there's a jostle of the cam as Steve laughs.</p>\n<p>\"Be there soon, Iron Man,\" he answers. </p>\n<p>And for a minute, until he remembers he's in a hospital room and they're going to take the Avengers away from him, everything's okay.</p>\n<p>Tony Stark is nothing if not goal-oriented. If he doesn't have Stark Solutions, he lacks the funding to -- well, live independently, but more importantly, maintain his armor, Rhodey's, and Pep's. If he can't maintain his armor, he can't be an Avenger, or he has to become an official SHIELD agent on the payroll and screw that. Tony is never going to let someone else tell him what to do, never going to be at the mercy of more powerful people ever again. </p>\n<p>But if he wants to be an Avenger, he needs the funding from Stark Solutions, and if he runs Stark Solutions, he doesn't have the time to be an Avenger...</p>\n<p>He has to find a way to do both. And still eat and sleep. Maybe he can develop some kind of instantaneous nourishment, like a granola bar that gives you all your caloric and nutritional needs for the week. Maybe he can learn to microsleep, he's heard that's a thing, where you sleep for five minutes multiple times a day. </p>\n<p>But he knows this isn't what Coulson meant when he said Tony had to make a choice. </p>\n<p>He chases it around in his head while the team debriefs without him. He's still trying to decide what to do when all of them troop in en masse, crowding the room until it's full of voices and people and jokes. Pepper is there and she clambers onto the bed, pulling him down so that he sits with his head on her shoulder, and she whispers greetings and feel-betters from Rhodey. Peter brings him a sucker from the squid thing to study, and Luke (freshly showered) re-enacts the fight and gets razzed by the others for getting eaten. Clint and Natasha just stand around looking cool, but Tony can see them watching him carefully. Steve hangs back a little too, is quiet and thoughtful, but that's not really unusual for Steve. </p>\n<p>The doctors let him go that evening, as long as he swears to continue resting and hydrating. They give him a meal plan to get his body weight up, then pack him into a helicopter to go home. It's humiliating, not being able to fly himself, but the armor is still locked down in his apartment. He could summon it using Extremis, but Coulson said it was this or nothing, and he's too tired to argue. </p>\n<p>Steve is in the passenger's seat next to him, which is something. He gives Tony a hesitant smile as Clint lifts the chopper off the flight deck and zooms out over New York. </p>\n<p>Clint's a good enough pilot to hover them over Tony's apartment building, something Tony is grateful for. Still, after they jump down and the copter flies off, he notices the security is disabled. Pepper and Peter are standing in the doorway, waiting. </p>\n<p>He kicks himself for ever giving Peter his access code. </p>\n<p>The problem is that Pepper is a force of nature and can make Tony obey orders nobody else would dare give him. They bundle him downstairs and the four of them curl up together on his giant couch, in a nest of blankets and throw-pillows. (When did he get throw-pillows? Did Pepper go out and <i>buy them?</i>) Tony finds himself wrapped in a quilt, pinned between Steve on one side of him and Peter on the other, while Pepper makes popcorn and Peter fumbles around with his TV remote, looking for bad science fiction movies to watch. </p>\n<p>\"Are you guys just going to spend the whole night holding me down?\" Tony asks, only a little irritated. Steve is warm all up his side, and Peter's presence is calming, reassuring. </p>\n<p>\"Yup,\" Steve replies. </p>\n<p>\"Pretty much,\" Peter says.</p>\n<p>\"Your aunt know where you are?\" Tony asks Peter. </p>\n<p>\"I told her I was sleeping over at Luke's place,\" Peter says. \"He'll cover for me.\"</p>\n<p>\"Okay!\" Pepper says, dropping a huge bowl of popcorn in Tony's lap before curling up next to Peter, legs thrown over his, cheek resting on his shoulder. Tony's glad and all that Pepper has a boyfriend (or a whatever-Peter-is) but he has to stifle an instinctive urge to yell that Pepper is <i>his</i> friend and Peter's not allowed to keep her. </p>\n<p>That would be stupid. Pepper's her own woman and Peter's his friend too, after all. It's just that TonyAndPep was there first.</p>\n<p>Steve puts his arm along the back of the couch, and Peter shoves Tony over a little until he's tucked under Steve's shoulder, buried in warmth and comfort and the familiar smell of SHIELD-issue soap. </p>\n<p>Okay, so he's not going to object.</p>\n<p>Still, about halfway through the movie, when Pepper is snoring softly into Peter's chest and Peter looks like he's about to fall asleep too, Tony leans over and says, \"You hurt her and I'll break your kneecaps.\"</p>\n<p>\"She'll break them first,\" Peter says. \"Relax, Big Brother.\"</p>\n<p>\"Sorry, it's a requirement.\"</p>\n<p>\"Uh-huh. Don't be a dick about this, I really like her.\"</p>\n<p>\"Who's being a dick?\" Tony asks. \"I'm just saying that if you make Pepper cry your life won't be worth living.\" </p>\n<p>\"The woman runs around in a suit of armor blowing stuff up. Trust me, I am not in any way qualified to make her cry,\" Peter replies.</p>\n<p>\"Shhh,\" Steve murmurs absently, hand rising to ruffle Tony's hair. Tony leans into it, falling silent. Peter's eyes droop, and a moment later his head flops on Tony's shoulder. </p>\n<p>Tony glances up at Steve, who's watching the movie, the colors from the television playing over his face in the darkened room. He looks past him to the armor, standing silent in the corner, a protective, empty sentinel. If Rhodey were here, everything he loves would be in one room. </p>\n<p>The thing about Steve is that he is perfect. He's handsome and smart and Captain America, and his heart is huge. If Tony found himself seventy years in the future he'd be kicking and screaming and miserable, but Steve loves the newness of it all, always finds ways to be happy even when he's reminded of what he lost. He's better than Tony, because Tony is <i>damaged</i>. </p>\n<p>Coulson said it; he's an isolationist workaholic. He doesn't know how to be a good person, not really. He can pretend, but it's exhausting being considerate and thoughtful and polite. He was a dick to Whitney and he failed utterly to save Gene from himself, he roped his friends into this dangerous, dangerous work and he couldn't even keep on top of his shit enough not to collapse and screw everything up. </p>\n<p>Steve's better than him, and at least if they do kick Tony out of the Avengers, Steve will be there to lead it. Tony snuffles into his shirt and Steve looks down at him, distracted momentarily. </p>\n<p>\"That was good work out there today,\" Tony tells him, as an excuse. </p>\n<p>\"Yeah, well.\" Steve looks back at the TV. \"If you'd been there we would have noticed Luke getting eaten sooner.\"</p>\n<p>\"Hey, you beat the bad guy, that's what counts.\" </p>\n<p>\"Tony...\" Steve starts, and then stops. \"Listen, I'm just...really sorry.\"</p>\n<p>\"For what? You did great. Good second-in-commanding with the boss out of the field.\"</p>\n<p>\"No, not that.\" Steve shakes his head, and for a moment he looks unbearably unhappy. \"All this. I knew you weren't doing well. Coulson said I couldn't interfere, but I shouldn't have listened to him. I should have done something.\"</p>\n<p>And it's that horrible expression of guilt on Steve's face that really cracks him open, because Tony knows it's nobody's fault but his own, what happened, and he hates that he made Steve look that way. </p>\n<p>\"Coulson was right,\" he says, turning away a little, trying not to shift Peter's head off his shoulder. He feels Steve tense. \"It's not your fault, and he had to let me hit bottom. There's stuff I need to figure out, and I wouldn't have if I hadn't...\" he lets his tongue loll out of his mouth and makes a gagging noise, rolling his eyes. Steve, when he looks back at him, smiles a little. </p>\n<p>\"You're not allowed to wash out,\" Steve tells him. </p>\n<p>\"You'd be a good leader.\"</p>\n<p>\"Not without you.\" Steve tightens his arm a little, and Tony accepts the half-embrace because he's not strong enough to push him away. \"We'll fix it.\"</p>\n<p>\"I guess.\" </p>\n<p>\"We will, Tony. You'll make a plan, you make the best plans, and we'll fix it. I'll help.\" </p>\n<p>It's the same hurt from the previous day, the deep-down hurt in his chest, but Steve ruffles his hair again and the hurt dissipates, breaks up like atoms and drifts away. </p>\n<p>\"Okay,\" Tony says. \"You'll help, huh?\"</p>\n<p>\"Anything you need.\"</p>\n<p>Tony grins. \"Wanna get me a soda?\"</p>\n<p>Steve looks down at him, mock-annoyed. \"Now you're just abusing my good nature.\"</p>\n<p>\"Since when have I done anything else?\"</p>\n<p>\"No soda. Here,\" Steve says, and passes him like the nine millionth bottle of water he's had that day. Tony sighs, sips from it, and hands it back. </p>\n<p>He isn't sure when he falls asleep -- maybe Steve falls asleep first -- but eventually he drifts off, and it's the most peaceful sleep he's had in ages. Possibly since his father died.</p>\n<p>Tony wakes the next morning to find himself laid out on the couch, head in Steve's lap, Steve slumped backwards but still sitting up, one of his hands gently tensing and relaxing on Tony's shoulder. Pepper and Peter must have gotten up and found somewhere else to sleep, sometime in the night; the TV's off and Tony has a blanket tucked around him. He eases slowly out from under Steve's hand, kicking the blanket away, and staggers towards the bathroom. </p>\n<p>As he passes his bedroom he sees Pepper curled up in the middle of his bed; down the hall, Peter is collapsed on the guest bed, and it's kind of adorable that they didn't share. He bets Steve's presence has something to do with it. No teenage sex while Captain America is in the house. </p>\n<p>Tony showers, digs some clothes out of his room without waking Pepper, and sits down with his tablet in a chair near the window. He has to make a plan, Steve said so. Steve said he'd help. Tony could never have asked, but Steve just offered, like it wasn't any big deal, like he didn't expect anything other than acceptance. </p>\n<p>Tony is used to managing time, but he's not used to managing...events, not the way he manages projects and blueprints. Maybe that's the problem; he hasn't been approaching this as an engineer. Surely if he can calculate the workflow he can identify efficiency issues and cost-to-value ratios. And if he adds Steve in, another entire person going into the mix, that's like eight hours a day of time he can screw around with, minimum. </p>\n<p>He can do this. </p>\n<p>He's halfway through charting flow when he hears something. He glances at Steve and sees his mouth working, the barest noise coming out, resolving itself into a word. </p>\n<p>\n<i>Bucky.</i>\n</p>\n<p>\n<i>Bucky, Buck -- no -- </i>\n</p>\n<p>Tony raises his eyebrows. \"Steve?\"</p>\n<p>\n<i>Jesus Christ, Bucky -- </i>\n</p>\n<p>\"Steve!\" Tony calls, and Steve starts awake, eyes flying open, jerking forward. One of his arms darts out, grasping at nothing, desperately reaching for something no one else can see. Tony watches him from the chair across the room, because he's not sure what he's supposed to do.</p>\n<p>Steve's eyes dart around the room, wary, battle-ready, and then he relaxes, letting his arm fall, rubbing a hand over his face.</p>\n<p>\"Wh'time is it?\" he mumbles.</p>\n<p>\"About seven. You okay?\" Tony asks. </p>\n<p>\"Yeah, sorry -- crazy dreams,\" Steve says. He has that tone again, the one that says he's hiding something or at least not telling the full truth. He rubs his hands together and his shoulders tremble briefly. Tony gets up and sits on the coffee table across from him, taking one of his hands. It's ice cold.</p>\n<p>\"When I'm cold -- when I'm asleep -- I get 'em sometimes,\" Steve says, a little too casually. Tony grabs the blanket from the end of the couch and offers it to him. Steve smiles and accepts, burrowing into it with a groan of relief. \"You spent seventy years in the ice, the cold kinda stays with you.\"</p>\n<p>\"Coffee?\" Tony asks. </p>\n<p>\"I'll do it,\" Steve says, and follows him into the kitchen, blanket still wrapped around him. \"You're supposed to be resting.\"</p>\n<p>\"I think I can make coffee without endangering myself,\" Tony replies, and Steve's face crumples. \"Hey! It was a joke. It's okay, I get it. And thank you. But I will make the coffee.\"</p>\n<p>Steve nods, looks thoughtful, and then walks past Tony into the kitchen, tying the corners of the blanket over his shoulders like a cape. \"Fine. I'll make breakfast. You want bacon or sausage?\"</p>\n<p>\"Well, we don't have any food in the fridge, but if we're eating imaginary breakfast I want eggs,\" Tony replies.</p>\n<p>\"Yep, you'll get eggs. And toast and potatoes. And either bacon or sausage,\" Steve says cheerfully. Tony frowns, then turns around to open his fridge. </p>\n<p>It's full of food. It's <i>crammed</i> wall-to-wall with food. Pepper probably bought it after picking up the throw-pillows. </p>\n<p>\"So. Bacon or sausage?\" Steve says. He looks thoughtful as he takes a potato, an actual potato, out of a sack of potatoes on the counter (what? When did they...what?) and begins peeling it into the sink. \"Never mind, everyone'll want something different. I'll make both.\"</p>\n<p>It's going to be a long day, Tony can tell. </p>\n<p>Still, it's not bad, and Steve makes home fries and eggs, bacon, sausage, and toast. Tony eats ravenously, which makes Steve smile and Pepper look calmer. </p>\n<p>They spend Sunday together, the four of them. They play cards, watch movies, and have long involved discussions about team strategy, which supervillain they'd like to defeat the most, and the comparative benefits of spandex versus leather (this one's mostly Peter and Steve, because Tony won't dignify \"spandex\" with an answer). Peter hangs out on the ceiling a lot, but nobody minds; Tony knows that's just a sign he feels at home with them. Steve reads the newspaper, an actual paper newspaper. </p>\n<p>Peter leaves after dinner with a shy kiss for Pepper and a box of leftovers from dinner. Pepper gets a phone call from one of her jillions of friends from Stanford, and steps out on the balcony to gossip; Tony settles in with his laptop again, and then makes an annoyed noise when Steve takes it away.</p>\n<p>\"You put in your time for today,\" Steve says, holding it out of reach, and Tony considers calling the armor to him and knocking Steve on his ass. \"It's Sunday. Day of rest. You can have it back tomorrow morning.\"</p>\n<p>\"You're an evil mastermind,\" Tony tells him. \"The sooner I get the analysis done the sooner I can start restructuring Solutions.\" </p>\n<p>\"Can I ask you something?\" Steve says, still holding the laptop over his head. Tony glares at him. \"If you don't give Solutions one more hour tonight, what's going to happen?\"</p>\n<p>\"You mean aside from the company falling apart?\"</p>\n<p>\"Really?\" Steve inquires, his face bland. He's been taking lessons from Coulson, Tony has no doubt. \"One hour tonight is going to topple four years of your life?\"</p>\n<p>\"It's <i>my company</i>,\" Tony says angrily. \"I made it, it's mine, it's not yours to control! <i>It's mine!</i>\"</p>\n<p>Steve looks startled, and Tony realizes he's yelling. </p>\n<p>\"It's mine,\" he repeats, quieter now. \"Nobody gets to take it away from me, not even you. Give me my laptop back.\"</p>\n<p>Steve lowers his arm, slowly, and holds it out. Tony takes the laptop and flops down on the couch, holding it in his arms. It's not about the stupid laptop, and they both know it. </p>\n<p>\"I know you're really proud of it,\" Steve says, putting his hands on his hips, then in his pockets, then letting them fall to his side like he doesn't know what to do with them. \"But it's not all you've got, Tony. You don't need to kill yourself over it. You have us, too.\"</p>\n<p>Tony rests his arms on the edge of the laptop, chin on his wrists. </p>\n<p>\"You scared me. You scared the hell out of Pepper. When they brought you up to the Helicarrier...\" Steve trails off. \"You were <i>so pale</i>, Tony. I just don't want to see you like that again. I'm sorry, I'm...I'm only trying to make up for not helping sooner.\" </p>\n<p>\"I'm a grown man. You don't have to,\" Tony answers. </p>\n<p>\"Is it okay if I want to anyway?\" Steve asks. \"Look, I get it. When I was eighteen all I wanted was to enlist and get overseas and fight. It felt like life was moving so fast, and if I didn't somehow jump in, I'd be left out forever. But you're doing work a man ten years older than you wouldn't be expected to do. Give yourself a little breathing room.\"</p>\n<p>Pepper picks that moment to come back inside, tucking her phone in her pocket.</p>\n<p>\"Oh my god <i>jocks,</i>\" she says, ignoring the tension in the air. \"What am I, like, a sweaty guy magnet? There are these two football players, okay, who are pining for me, and I'm like oooookay guys, I have a boyfriend, well, maybe he's my boyfriend -- has Peter said anything to you about being my boyfriend? Anyway, even if I didn't I'd say I did because these guys are serious cro-magnons and last night while I was NOT EVEN THERE, obviously, they got into a fistfight over me at a bar. A. Bar. Which is just the dumbest thing ever when you're there with a fake ID to begin...with...\"</p>\n<p>She takes them in.</p>\n<p>\"Awkward moment?\" she asks, and Tony laughs and sets the laptop aside, standing up to hug her.</p>\n<p>\"Not anymore,\" he says. \"Steve was just going to put another movie on.\"</p>\n<p>Steve shoots him a grateful look.</p>\n<p>That night, Pepper takes the guest bedroom and Steve insists he's fine on the couch, even though Tony points out his bed his huge and it's fine if Steve wants to share. It's difficult to get to sleep; his mind is whirring with ideas for streamlining things, and he's so unused to sleeping when he chooses and not just because he's exhausted that even when he does sleep, it's light and restless. </p>\n<p>He wakes to some noise, he doesn't know what, and opens his eyes to see a shadow in the doorway, cast by the hall light. For a second he tenses, but then he pushes himself up muzzily on an elbow. \"Steve?\"</p>\n<p>Steve steps back, hastily, and in the side-light from the hallway Tony can see him looking -- surprised, but also miserable. His hands are trembling.</p>\n<p>\"What's going on?\" Tony asks. </p>\n<p>\"I d - d - didn't meant to wake you,\" Steve stutters. No -- his teeth are chattering. \"I was j - just d - doing a check.\"</p>\n<p>He clenches his hands, as if that's going to help. </p>\n<p>\"You look like shit,\" Tony tells him. Steve laughs a little, softly. \"Get in here, come on.\"</p>\n<p>\"No, I can -- \" Steve starts, but Tony throws back the blankets and scoots over, and Steve comes forward, reaching for them. \"You should g - go back to -- \"</p>\n<p>\"Get in, or I'm putting on the armor and going for a flight,\" Tony tells him seriously. Steve looks at him, and Tony meets his eye. He is not above holding his own health hostage. He's not above much, really. </p>\n<p>With a wary look, Steve slides into the warm spot Tony left, and Tony tosses the covers back over him. Steve's whole body slumps, relaxing into the residual heat. He groans softly, turning onto his side to face Tony, huddling in the blankets.</p>\n<p>\"I could have given you another blanket if you were cold,\" Tony says, settling down again. He can feel Steve's soft tremors through the mattress, but they're easing. \"How do you sleep on the Helicarrier? It's always freezing.\"</p>\n<p>\"Lectric blanket,\" Steve mumbles into the pillow. \"Turned alla way up.\"</p>\n<p>\"You should have said something.\"</p>\n<p>\"I didn't think it'd be a big deal.\" He sighs, opening his eyes. \"I always sleep better here -- almost never happens here.\"</p>\n<p>\"How long?\"</p>\n<p>\"Since I woke up,\" Steve admits. \"Told you. The cold stays with you.\"</p>\n<p>They lie there for a minute or two, facing each other, Steve's hand clenching lightly in the sheets between them. Steve's eyes sweep over his face, cut away, drift back. Finally, he inhales to speak. </p>\n<p>\"Bucky was your age when he died,\" he says softly. </p>\n<p>\"I read the history,\" Tony says, nodding a little. \"And the SHIELD file.\"</p>\n<p>\"You know he fell,\" Steve says.</p>\n<p>\"Yeah.\"</p>\n<p>\"There wasn't even any time to try and look for a body, no time to write to his mother, no time to go home for his funeral. A day and a half later I died too.\"</p>\n<p>\"Almost died,\" Tony corrects.</p>\n<p>\"Basically died. As far as that world was concerned. And my world died, to me,\" Steve says. \"He was my best friend and I couldn't save him.\"</p>\n<p>\"Steve -- \"</p>\n<p>\"I just can't lose anyone else,\" Steve blurts. \"Especially not you. When I woke up I was so alone and I was <i>so</i> cold, that stuff they had me in was freezing, and suddenly there you were, helping me, warm -- you were the only warm thing in the world. I used to feel like I could just sit near you and I'd be warmer.\"</p>\n<p>This isn't about the cold living room or the lack of an electric blanket, Tony realizes. This is about him and his stupid collapse, and Steve being messed up, more messed up than he lets on. </p>\n<p>Tony inches closer, pulling Steve's head down into the hollow of his throat. His nose is freezing. Steve goes willingly, curling into him, seeking comfort as much as heat. </p>\n<p>They fall asleep again bundled tightly in the blankets, with Steve's hands curled in Tony's t-shirt, Tony's face pressed into Steve's soft blond hair.</p>\n<p>Things get better after that. </p>\n<p>Tony starts splitting leadership duties with Steve, which means he can miss half the drills and some of the meetings. He doesn't like it -- it feels like slacking off -- but the others don't seem to mind. Someone's always missing a drill, and Coulson says it makes them more flexible. Tony tries to get Coulson to give him the improvement files so he can work on skills the team lacks, but Coulson tells him to let his handler worry about that, so Tony...well, he still worries, but he doesn't have to do anything about it. He stuffs it to the back of his mind. </p>\n<p>Stark Solutions is a harder nut to crack. The problem is that Tony is leaps and bounds ahead of most of the human race when it comes to tech, and his engineers aren't keeping pace. Few could. Besides, the investors and stockholders are flighty, emotional neurotics and only Tony can soothe them. </p>\n<p>\"I need help,\" he says to Coulson, and it takes every ounce of iron in him to say it. \"Solutions is a problem.\"</p>\n<p>\"Ironic.\" Coulson looks thoughtful. \"Give me a week.\"</p>\n<p>Two days later, courtesy of Coulson's apparently endless connections, Tony has a meeting with <i>Reed Richards, oh my god</i>, his hero. Richards looks down at him with sharp, clever eyes and says \"I admire the work you've done with nanotechnology and processor tricore speed-sharing\" and happens to mention he owns a StarkPhone and Tony tries really hard not to be a total fanboy.</p>\n<p>Reed has contacts who are more than happy to get a steady job, an independent lab, and some intellectual breathing room at Solutions. Sue Storm takes Tony aside and gives him the number of a management company that specializes in riding herd on scientists, and they send an incredibly efficient man -- probably some relation of Coulson's -- to manage his new brain trust. Business still slows down a little, but Tony can <i>breathe</i> again, and his staff aren't constantly trying to kill each other/blow themselves up/destroy his company with their incompetence. </p>\n<p>He still works long hours, but not as long, mostly because Steve starts...hanging around, is the only way he can put it. Precisely at noon and at six o'clock every day, if Steve is there, he comes to fetch Tony for a meal. The first few times he has to bodily drag him away from his work, but Tony doesn't really mind that so much. Steve is incredibly strong and the humiliation of being dragged into a hallway is balanced out by the way Steve just grabs him in a bear hug and moves him around.</p>\n<p>That's probably messed up, but Tony can't bring himself to care. He dresses up in a suit of cherry-red armor and fights evil with his best friends, messed up is relative. </p>\n<p>And finally, there's a Friday night where no villains are evident, his armor is fully repaired after their last battle, and Solutions is running smoothly. Peter has a date with Pepper, Luke is going to a concert, and Natasha has a spa weekend planned. Which, true, may or may not be a reconnaissance mission of some kind, but Tony's not going to bug her about it. Clint has mysteriously vanished, but that's not unusual. </p>\n<p>Tony...has nothing to do. He doesn't even know what he <i>should</i> do. There's an entire weekend stretching out ahead of him. </p>\n<p>\"What are you doing this weekend?\" he asks Steve, who looks up from his sketching. They're in Tony's Helicarrier lab, just messing around; Steve's practicing his drawing, something he \"started up again, it's just a hobby\" after the night he and Tony curled up together in Tony's bed. Tony's pretending he's not trying to peek at the sketchbook, and considering whether he wants to get off the carrier for the weekend or stay there and avoid the world. </p>\n<p>\"Nothing, I guess,\" Steve says. \"Enjoy the quiet, maybe.\" </p>\n<p>\"Wanna go down to the city with me?\"</p>\n<p>\"Sure, if you want. Got any plans?\"</p>\n<p>Tony shrugs. \"See a movie or something, maybe. I feel all weird about it. I don't do well with free time.\"</p>\n<p>Steve gives him a warm smile. \"You know, in the war we took our downtime where we could get it, but I always felt like that. Like I couldn't ever quite get comfortable doing nothing.\"</p>\n<p>\"And now?\" </p>\n<p>\"I'm getting used to it,\" Steve admits. \"The other day I sat down with some paper and tried to work out how old I am. Actually, in terms of time spent...not frozen. Turns out in a month I'll be twenty-three.\" </p>\n<p>\"Well, happy weirdo birthday,\" Tony replies. </p>\n<p>\"Most guys my age were married by now, back when.\"</p>\n<p>Tony feels something twist in his chest. \"Got a girl in mind?\"</p>\n<p>Steve looks at him funny. \"No. I...well. The war changed all that for most of us. And anyway before Rebirth I was never going to be anyone's catch.\"</p>\n<p>\"Well, unless Rebirth gave you a personality transplant, I find that hard to believe. Were girls in the forties really that shallow?\"</p>\n<p>\"What do you mean?\"</p>\n<p>Tony notices it's five fifty-seven, and taps out a command to lock down the armor. \"Well, you might have been kind of small, but you're a nice guy. You're smart, patriotic, you work hard. I guess I don't see why nobody ever noticed. I mean, I'm not that big <i>and</i> I'm kind of a jerk and I still managed to get dates in high school.\"</p>\n<p>\"You're not a jerk, Tony.\"</p>\n<p>\"I'm just on good behavior around you.\" </p>\n<p>\"I don't believe that. Anyway, I guess people didn't think putting up with a skinny asthmatic with a heart murmur was worth it.\" Steve frowns down at his sketchpad, flipping it shut. \"Come on, it's six o'clock. Time to eat a regular meal.\" </p>\n<p>Tony watches Steve at dinner, trying to picture the scrawny kid he's seen in the files. Steve's face hasn't changed, really, just the shape and size of his body. His smile never changed. Tony can't fathom how anyone in their right mind could look at that smile and not want to get to know the guy behind it. </p>\n<p>It must have been...lonely. </p>\n<p>\"What, do I have something on my face?\" Steve asks, when he catches Tony looking. </p>\n<p>\"Nah, nothing,\" Tony replies, and goes back to his meal. Steve gets stern if he doesn't eat enough.</p>\n<p>After dinner, Steve goes back to his room to pick up his shield; he's long since started storing clothes and a razor at Tony's place (Steve is super-particular about his razor, doesn't like anyone else touching it) so they can travel light when they go. Tony can't find Coulson anywhere to sign them out, so he sends the team an email that he and Steve are in Manhattan for the weekend and they meet at the doorway to the Diplomat Deck. They can jump off the Helicarrier from there just as easily as the flight deck. </p>\n<p>They're joking about something, Steve elbowing Tony with a laugh, as they approach the glass doors to the terrace. Suddenly Steve grabs his arm, stopping him from pushing them open. Tony frowns, then follow's Steve's gaze. </p>\n<p>Tony has tried not to think too much about how Clint's dating their handler. For one thing, imagining Coulson having sex is like picturing your parents doing it. Coulson's somewhere in his early thirties Tony guesses, but that's still just a tiny bit cradle-robber-y, for all Clint's crammed a lot of life into twenty-six years. Also, Tony's a little envious, because <i>Clint Barton</i> is managing a stable relationship.</p>\n<p>And he still thinks sometimes about what Coulson said to him after that first mission: <i>He took a chance. Something you might consider doing.</i></p>\n<p>There it is, beyond the glass, unavoidable: Clint is standing at the railing, one hip hitched up against it, arms around Coulson's shoulders, Coulson's around his waist. Their foreheads are pressed together and he can see them speaking quietly, a funny little smile on Clint's lips. Tony glances up at Steve and sees a weird hunger on his face, mixed with a blush at having caught his handler and his friend in a private moment. Steve notices and looks down at him.</p>\n<p>\"Clint and...and Agent Coulson?\" he asks, his tone curious. </p>\n<p>\"Yeah,\" Tony says, pulling them both back, away from the glass. \"I found out a while ago. Sorry, I didn't think I should say.\"</p>\n<p>Steve's still watching as Tony tugs him away. \"Clint's...?\" he asks, brow furrowing. </p>\n<p>\"He's bi, I think,\" Tony says, hustling him back into the hallway. \"He and Natasha used to be a thing.\"</p>\n<p>\"I knew <i>that</i>, about him and Natasha, but...\" Steve cranes his neck for a last look. </p>\n<p>\"I don't know what Coulson's deal is, I thought he was a robot,\" Tony jokes. </p>\n<p>\"Tony!\"</p>\n<p>\"What? Don't tell me you never thought it was possible,\" Tony replies, as Steve leans against a wall. \"Hey, you're cool with it though, right?\"</p>\n<p>\"Just -- just surprised,\" Steve admits. \"They, uh, looked happy.\"</p>\n<p>\"Happy,\" Tony smirks, and moves on before Steve can scold him. \"Come on, we'll find somewhere else to jump.\"</p>\n<p>They end up sneaking out onto a gun turret and jumping from there, soaring over the city the way Steve loves. New York is used to them now, but they still draw a lot of attention. Iron Man darting among the skyscrapers with Captain America clinging to his shoulders is practically a tourist attraction, especially since Steve is a big dork who likes to wave at people as they pass. </p>\n<p>Tony indulges in some acrobatics over Central Park, showing off, and Steve cheers over the comm. </p>\n<p>\"Where do you wanna go?\" Tony asks, as they spiral up over the city.</p>\n<p>\"Anywhere!\" Steve whoops. \"Anywhere you want, Tony!\" </p>\n<p>Tony calls up the internet on his internal display, checking the local movie places. He did kind of suggest it. </p>\n<p>\"There's an art house doing a Hitchcock marathon,\" he says. Steve was morbidly fascinated by Hitchcock when Tony was giving him a crash course in the history of awesome movies. \"If we walk from here we'll get there just in time for To Catch A Thief.\" </p>\n<p>\"Yeah!\" Steve thumps his helmet enthusiastically. Tony drops them down at the northern edge of the park, and retracts the armor into his backpack. Steve, ever prepared, pulls a ball cap out of his back pocket, and they casually don their <i>other</i> costumes, the ones that they wear to go out in public without being too visible. Tony's wearing a ratty t-shirt and sunglasses; Steve puts on his ball cap and unzips his bomber jacket. It's not exactly easy for Steve to blend in and he isn't any good at it, but most people see the obvious <i>I'm incognito</i> clothes and leave him alone. Tony, shorter and more nondescript, could be any teenage boy in New York. </p>\n<p>He missed this. He didn't have time to go flying with Steve or go to movies or do anything normal, when he was headed for the crash. He savors it now: inhales the smell of stale popcorn and sinks deep into the cheap theater seat, glances at Steve every once in a while as he watches the movie, rapt and enthralled. Steve loves movies; Tony thinks they probably remind him of home, the home he left behind, even the ones made long after his fall into the ice. He doesn't even squirm when Cary Grant and Grace Kelly kiss and the movie cuts away to fireworks, one of the most obvious euphemistic sex scenes in all of movie history. Maybe because it's a euphemism. Who knows what Steve thinks about sex? </p>\n<p>Bad Tony. No going there. </p>\n<p>They file out with the rest of the audience when the film is over -- they're probably the youngest people there by twenty years -- and begin the easy stroll towards Tony's apartment building. </p>\n<p>\"You know I looked up Cary Grant on the internet,\" Steve says as they walk. He has his hands in his pockets and looks oddly at peace with the world. </p>\n<p>\"Yeah? Find anything interesting?\" Tony asks.</p>\n<p>\"Lots. You know his real name was Archibald Leach?\" </p>\n<p>\"Ick. No wonder he changed it.\"</p>\n<p>\"And he used to be in vaudeville.\"</p>\n<p>\"You ever see him perform?\" Tony asks, and Steve laughs.</p>\n<p>\"Nah. At least I don't think so. And you know people say he was gay?\"</p>\n<p>Tony glances at Steve. \"I didn't know that.\"</p>\n<p>\"Him and Randolph Scott were a hot ticket, I guess. People sort of knew, apparently.\"</p>\n<p>\"Really? I thought you said people couldn't...you know, back then.\"</p>\n<p>\"Well, nobody talked about it. I mean I guess it wasn't easy, but probably easier for movie stars than some folks had it.\" Steve shoves his hands in his pockets, thoughtfully. \"Maybe harder, I don't know. I know it doesn't seem like it, but things really are better now. You know,\" he adds, in an oddly abrupt change of topic, \"Bucky and I went to see him in His Girl Friday when it was at the picture house.\" </p>\n<p>Steve has never talked about Bucky so casually; rarely talked about him at all. </p>\n<p>\"We loved the flicks. When we were growing up we'd sneak in the back entrance after the lights went down and sit in the aisle and watch together. Stopped that when we got so big we'd be noticed, but by then we could always find a couple of dimes to pool together and get us in.\" Steve whistles low. \"Twelve bucks for a movie ticket now. I'll never get used to that.\" </p>\n<p>\"Fortunately, millionaire,\" Tony says, gesturing to himself with one hand while he unlocks the front door to the building. </p>\n<p>\"Genius,\" Steve says affectionately, and Tony grins at him as they climb into the elevator, riding it to the top. </p>\n<p>When they get inside the apartment, Tony goes to the kitchen, tossing Steve a Coke from the fridge (which has remained suspiciously well-stocked; Tony has an idea that Pepper has employed ninjas to refill it while he's not around). He grabs one for himself and is coming back into the living room when Steve says, \"Hey, I can tell you anything, right?\" </p>\n<p>He looks excited, happy and nervous, and Tony nods a little warily.</p>\n<p>\"Sure,\" he says, wondering if Steve wants to talk more about Bucky, uncertain what he thinks of that. \"Something on your mind?\" </p>\n<p>\"Well -- I mean...\" Steve rubs the back of his head with one hand. \"Things are so different now...and the team and Agent Coulson and everything...\" he laughs a little. \"I never even told Bucky this, but I think he kinda knew. Sometimes it's harder to tell people you care about, just in case, you know.\"</p>\n<p>He sets the Coke down on the table. Tony frowns. </p>\n<p>\"I'm gay,\" Steve says, and Tony chokes on a mouthful of soda. </p>\n<p>\"Great timing!\" he says, swallowing painfully. </p>\n<p>\"Sorry, I didn't expect you to -- are you okay?\" Steve asks, taking the bottle out of his hand. </p>\n<p>\"Yeah! Yeah, I'm okay, we're okay, just...\" Tony coughs, and Steve hits him on the back, hard. He stumbles. \"Don't fix it! Stop!\"</p>\n<p>\"Sorry!\" </p>\n<p>\"Hoo. Okay,\" Tony continues, getting his wind back. \"Wow.\"</p>\n<p>\"I really am sorry,\" Steve adds. \"I just wanted you to be the first one I told.\"</p>\n<p>Tony hacks, clearing his throat. \"Well, I'm very honored, even if I don't look like it right now,\" he says, and then the real wham hits him.</p>\n<p>Steve is <i>gay</i>. <i>Steve Rogers</i> is gay. <i>Captain America is gay.</i></p>\n<p>\n<i>Like him.</i>\n</p>\n<p>Tony looks up at him, eyes wide. </p>\n<p>\"It's okay, isn't it?\" Steve asks. \"You're okay with Clint and Agent Coulson, and...you knew all about Northstar and...\" He looks away. \"I've been trying to figure it out because in the forties, people said it was a phase or some kind of disease or whatever, but I've wanted to tell you -- well, I've wanted to tell everyone, but that's sort of awkward, and...but especially you,\" he blurts. \"Because...please don't be, don't think it's weird, but I guess you know I think you're amazing and -- \"</p>\n<p>Tony acts on instinct, because he does all his best work on instinct, and grabs Steve by his shirt and pulls him forward and kisses him. </p>\n<p>Steve squeaks, startled, but after that he leans into the kiss and suddenly it's <i>dirty</i>, all tongue and teeth. Tony flattens his hands on Steve's chest when he feels Steve pull their bodies together with an arm around his waist. </p>\n<p>\"Tony,\" Steve says, leaning back a little. His other arm raises, fingers tracing a line down his cheek, the same way they did along the faceplate of the armor, the first time he saw it. </p>\n<p>\"Um. Me too?\" Tony ventures, and Steve laughs and kisses him again, tasting like cola and popcorn. </p>\n<p>\"I didn't think -- I thought for sure if you were, it'd be all over the place,\" Steve says, kissing him between words.</p>\n<p>\"Yeah, I kind of lack the balls to follow through with my big ideals,\" Tony replies. </p>\n<p>\"And you -- \"</p>\n<p>\"I've had a crush on you since the first time I saw you,\" Tony tells him, nuzzling along his jaw. Steve makes a soft noise at the rasp of his scruffy goatee against his skin. \"And then you woke up and were...you...and I didn't think I had a chance...\"</p>\n<p>He leans back, suddenly. </p>\n<p>\"You know I put losing my virginity on the list of things I should do before I turn nineteen,\" he blurts. </p>\n<p>Steve stares at him, and then bursts out laughing.</p>\n<p>\"It's not funny!\" Tony protests, starting to pull away.</p>\n<p>\"No, it's not that,\" Steve says, not letting him, tugging him back into his body. He goes reluctantly, offended. \"Sorry, sorry, it's not that. It's just.\" He kisses Tony again and it's like Tony goes all stupid, because he just melts into it. \"Finally something I know more about than you do.\"</p>\n<p>Okay, that's actually pretty funny, yeah. Tony starts laughing too, and Steve hauls him over to the couch and they tumble onto it together, throw-pillows flying everywhere. Tony ends up on his back, pinned to the cushions by a very affectionate Captain America. </p>\n<p>\"I'm so glad,\" Steve says, big hands framing Tony's head, his brightest smile lighting his face. \"I'm so glad you're here, that you woke me up, that you don't think I'm weird and perverted and wrong -- \"</p>\n<p>\"Did people tell you that?\" Tony asks. He traces Steve's lips with his fingers. Steve bends into the touch. </p>\n<p>\"There were places,\" he says. \"Where fellas could go. I never went to any in New York, but overseas...it seemed okay there, like it wasn't real. But some of the men...\" he ducks his head. \"<i>I'm not an invert, I'm just here 'cause there aren't any girls around. I'm not like you.</i>\"</p>\n<p>\"Steve -- \"</p>\n<p>\"Erskine knew. Some of the other scientists said -- said the Serum might...fix me,\" Steve continues, and Tony's heart breaks. </p>\n<p>\"You don't need to be fixed,\" he says fiercely. </p>\n<p>\"Thank god,\" Steve murmurs. He presses his face against Tony's throat, light kisses, gentle and a little desperate. After a while he seems to calm down, and he lifts his head again to rest it against Tony's. </p>\n<p>\"I don't want it to be like those places,\" he says. \"Never learning anyone's name, nothing ever lasting. You -- \" he laughs a little. \"You don't turn nineteen for another few weeks, we can go slow if you want.\"</p>\n<p>\"I...really don't want to go slow,\" Tony replies hesitantly. \"Do...do you? 'Cause, you know my name, so...\"</p>\n<p>Steve smiles against his cheek. \"So pushy.\"</p>\n<p>\"You like it.\"</p>\n<p>Steve nods and settles his weight, hips pushing down just right. Tony can feel heat building against his thigh, and he's lightheaded with the idea that Steve can feel him too. He turns his head to catch Steve's mouth again, hands tentatively exploring, one just below the small of Steve's back. Steve shifts and oh, hey, look, Tony is groping Captain America's ass. </p>\n<p>For all Tony's talk of not going slow, they don't exactly go fast, either. Steve kisses with more confidence than Tony expected, and it's nice just to lie there and touch him and kiss, no pressure to be cool or know what he's doing. Steve slides his shirt up and, with a glance up at him for permission, nips and kisses his way down Tony's ribcage, across the muscles of his stomach that are starting to show definition, huffing warm air over his skin. Tony clenches a hand in Steve's hair and tugs fruitlessly at the collar of Steve's shirt, until Steve laughs and sits back and pulls it off. They've seen each other naked before -- superheroing doesn't leave much room for modesty -- but Tony's breath leaves him in a huff at the sight. Steve looks down at him with a moment's uncertainty, so Tony pushes himself up on his hands and angles for another kiss, lowering his eyelashes in a calculated ploy. </p>\n<p>\"You did that on purpose,\" Steve says, but he leans in and kisses him anyway, easing him back down to the couch. </p>\n<p>\"Well, gee, you caught me,\" Tony replies, and Steve laughs into the kiss. \"What're you gonna do with me now, Captain?\"</p>\n<p>Steve goes still, and then slides his mouth down to Tony's jaw, the hollow of his throat. Tony...isn't sure what he expects, but it isn't Steve's lips on his chest again, the sharp momentary sting of teeth around his nipple. He's more startled to feel a hand on his belt, unbuckling it, thumbs hooked in the waistband of his pants. Tony swallows but lifts his hips enough that Steve can pull his pants and underwear down and off, and it seems a little unfair that he has to be the first one naked, but then Steve rests a hand -- gentle, proprietary -- on Tony's thigh and looks down at him. Tony looks back up and fills with calm because it's Steve, utterly trustworthy, painfully good, a better <i>person</i> than Tony will ever be. But not perfect, and not too good for Tony. </p>\n<p>Steve smiles as if he can tell what he's thinking, bends down, and -- </p>\n<p>\"Oh! God!\" Tony groans, because that's his <i>mouth</i>, because Steve's mouth is warm and damp around him and he's never felt anything quite like this. Steve is watching him, blue eyes flicking up to his face even as his cheeks hollow, and Tony can barely breathe, it's so beautiful. Steve arches a little and takes him deeper and Tony loses himself in a swirl of tongue, a low vibration around his dick that must be Steve moaning, the clean shock of cool air when Steve leans back.</p>\n<p>\"What?\" he manages, looking up at Steve. \"Did I, what did I, please don't stop -- \"</p>\n<p>\"Breathe,\" Steve laughs, crawling back up his body. \"You didn't do anything wrong. This is better,\" he says, and Tony feels warm flesh against his. That's Steve's dick, pressing down against his thigh, against him. Steve's hand sliding between them, fingers stroking him, holding them together. </p>\n<p>Tony babbles encouragements, nonsense, Steve's name, and he could probably just do this forever with his hips bucking up against another body and Steve kissing him. His hands clench on Steve's arms, slide up to his neck and Steve gasps <i>Tony</i> and Tony comes without meaning to, orgasm twisting through him, leaving him breathless. Steve is tense and trembling against him, breathing harsh. Tony jerks and feels a painful curl of renewed arousal when he realizes Steve is coming too. </p>\n<p>Steve collapses on top of him, face pressed to his neck. Tony drifts blissfully, relaxed and satisfied. After a minute Steve snuffs into his throat and then laughs.</p>\n<p>\"What's so funny?\" Tony slurs, not bothering to open his eyes.</p>\n<p>\"We never got beds back then,\" Steve murmurs, kissing him, tongue tickling his skin. \"Alleys. Bathrooms if you were lucky. And now it's okay, and I have you, and I still haven't made it to a bed.\"</p>\n<p>Tony laughs too, lifting a clumsy hand to stroke Steve's hair. \"I think I can arrange one of those.\"</p>\n<p>\"I like it here,\" Steve mumbles, but he pushes himself up. They're messy, sweaty and sticky, and Tony can't stop thinking about how funny it was, about how much they just kept laughing. Steve grimaces at the mess, which is also funny, and Tony laughs as Steve casts around for something to clean them up with. He grabs his shirt, then does it himself when Steve says, \"That's your shirt! Tony -- nnhhhh,\" he finishes, because Tony leans forward and licks his abs. It's -- bitter, not entirely pleasant, but the noise Steve makes is worth it. </p>\n<p>Steve gives him a stern look, but he grabs the blanket off the back of the couch and drops down again, turning so they're facing each other, skin-close, curled up together. </p>\n<p>\"Well, you can put a checkmark next to that,\" Steve says, and Tony snuggles deeper in the blanket. </p>\n<p>\"Done,\" Tony agrees. Steve looks like they've just shared some kind of amazing secret, conspiratorial and pleased. He untangles a hand from the blanket to cup Tony's face, studying it, wordless. </p>\n<p>\"I used to talk to you,\" Tony says. \"Before we woke you up. I'd come to the lab and sit and talk.\"</p>\n<p>\"What did you say?\" Steve asks, a yawn cracking his jaw. </p>\n<p>\"Nothing much. Engineer stuff. Working out problems,\" Tony replies. He touches his forehead to Steve's. \"Did you dream? All that time?\"</p>\n<p>Steve shakes his head a little. \"Sort of. Not really. At some point I thought...I remember feeling safe. I wasn't safe, and then I was. And then you woke me up.\"</p>\n<p>His voice trails off into a sleepy mumble, hand going lax against Tony's face. </p>\n<p>\"Feel safe here,\" he murmurs, and then he's out. Tony studies the pale blond eyelashes against his cheek for a while, before his own eyes close.</p>\n<p>So anyway they end up not leaving the apartment that weekend, which is really okay by Tony. </p>\n<p>It's not just one constant makeout session, though. Steve cooks meals, Tony does dishes (Steve makes him even though the dishwasher will <i>also</i> wash the dishes), and Tony discovers the weird pleasure of pulling the newspaper to pieces to wring every ounce of enjoyment out of it, lying on his stomach on the floor with Steve next to him, sharing the funny pages. Sure, halfway through the funny pages they get into a wrestling match that ends...less than wrestle-y...but the point is there's a lot of domesticity going on, too. </p>\n<p>Steve knows what he's doing better than Tony does, that much is clear, but Tony's forming a fuller picture of him than the history books could possibly give: hasty, furtive meetings in the dark, men who didn't care about him or who actively despised him for making them feel like pansies or perverts, the constant fear of discovery. Steve might tell him <i>You'll like this</i> or teach Tony things he never knew or seem to know instinctively what to do, but his pleasure in Tony's body, his glee at lying in a patch of sunlight through the window while they touch, makes it clear that this is new and better. </p>\n<p>\"I used to think it was a sin,\" he says to Tony on Sunday afternoon, sitting on the couch with his sketchbook laid aside. Tony is sitting sideways, thighs over his lap, tucked up slightly so he can work on some schematics. Steve's been sketching quietly, but now he has one hand curled around Tony's head, idly rubbing through his hair. </p>\n<p>\"It's not,\" Tony says, playing around with a solid-light hologram concept for a backup shield for Steve. </p>\n<p>\"I know that now. But I used to think it was wrong. I didn't...those men who said they weren't <i>really</i> gay, who denied it, I wasn't like that. I knew what I felt. I thought maybe it was because I grew up so small, you know, like I wanted them because I wanted to be <i>like</i> them.\" He presses his face to Tony's temple. Tony turns to kiss him. \"But it didn't change after the Serum. I...died thinking it was wrong, wondering if I'd go to hell. Then I woke up and suddenly...the world had changed. You told me about Northstar and I was so envious. And on the television people talked about being gay, like it was no big deal, or like it was a big deal to be hated for being gay, but...someone was saying it, I guess,\" he finishes. \"Someone was always saying it was okay, that there wasn't anything wrong with me.\" He breaths slowly. \"I don't need to be fixed.\" </p>\n<p>\"Well, you're kind of a goofball, we could work on that,\" Tony says, and Steve laughs. \"Otherwise, no. You're perfect.\" He leans back. \"Do you...I mean, what should we do about telling people? 'Cause I could make a t-shirt that says Captain America took my virginity -- \"</p>\n<p>Steve looks horrified. Tony grins. </p>\n<p>\"Well, I guess we should tell the team, they should know,\" Steve says. \"Obviously Coulson's okay with it, and Clint.\"</p>\n<p>\"They'll be cool,\" Tony agrees. \"Can I tell Pep and Rhodey? I mean they know I'm gay, but about you and me, I mean. This isn't, you know...a random hookup, right?\"</p>\n<p>\"No,\" Steve says warmly. And then, to Tony's dismay, he adds, \"We should tell everyone.\" </p>\n<p>\"Everyone?\" Tony asks, voice rising a little. It's one thing to joke about it, another to actually consider it. \"Like everyone we know?\"</p>\n<p>\"No, everyone,\" Steve repeats. \"Not about...t-shirt material,\" he adds, fumbling, \"but we should tell the people we know and then we should tell the newspapers and stuff. I'd like to.\"</p>\n<p>Tony thinks about it -- thinks about that warm rush of validation when he thought, <i>Captain America is gay like me.</i> Maybe there are people who would care about that. Who would think it was okay because <i>Iron Man is gay like me.</i></p>\n<p>\"It's gonna suck, you know that, right?\" he says. </p>\n<p>\"Last week one of the magazines said I was dating some movie star I've never met,\" Steve says. \"It sucks anyway.\" </p>\n<p>There was a debate a few weeks ago on an internet messageboard about whether Tony was a mechaphile. Steve might have a point. </p>\n<p>\"How?\" he asks, his voice small. Steve turns to look at him, worried.</p>\n<p>\"Are you scared?\" he asks. \"We don't have to.\"</p>\n<p>\"Scared. Ha! I'm not scared,\" Tony lies. Somewhat badly, if Steve's face is any judge. </p>\n<p>\"Tony,\" he murmurs, leaning in. \"We don't have to. Or I could go public and just not say anything about you.\"</p>\n<p>\"Like that'd last. The press would be onto us by the end of the day,\" Tony says. He forces himself to relax. \"It's the right thing to do. I'm...just...yeah, okay. I'm scared. It's scary.\"</p>\n<p>\"It'll be okay. If you don't want to we won't, but if we do, I'll be here,\" Steve says, and that's the point, really. What's he scared of? His two best friends know, Coulson knows, and nobody can take Steve away from him. They're Captain America and Iron Man, and Tony has a sudden surge of <i>anger</i>, of defiant sullen rage. Screw the haters, they can't tell him what to do. Nobody tells him what to do. </p>\n<p>\"Okay,\" he says, curling his fingers in Steve's shirt. \"Okay, let's tell the world.\"</p>\n<p>\"There's Iron Man,\" Steve says, grinning. \"Knew he was in there somewhere.\"</p>\n<p>\"Butthead,\" Tony answers, kissing him.</p>\n<p>Tony tells Pep and Rhodey about his new boyfriend (his NEW BOYFRIEND, HIS BOYFRIEND WHO IS CAPTAIN AMERICA) by photomessage, sending them a shot of him grinning crazily at the camera while Steve kisses his cheek. He tells Coulson via a textmessage reading <i>I took a chance.</i></p>\n<p><i>Proud of you</i>, Coulson sends back, and Tony can practically hear how annoyed Coulson is at having to admit it. </p>\n<p>He calls Peter, because Peter is unaware of <i>several</i> facts, and Peter answers the phone with \"Please say there's no evil brewing, Aunt May's making dinner and if I ditch Sunday Dinner she might actually turn into a villain herself.\"</p>\n<p>\"No,\" Tony says. \"I just needed to uh. Update you on some...status. Of me.\"</p>\n<p>\"Are you okay?\" Peter asks. \"You sound stressed.\"</p>\n<p>\"Yeaaaaah a little,\" Tony says. Steve makes calming, reassuring gestures which look kind of funny. \"Um, so, here's my, uh, status, which is that I am gay.\"</p>\n<p>\"Oh,\" Peter says, thoughtfully. There's a pause. \"And?\"</p>\n<p>Tony knows it's rhetorical, that Peter's just trying to say he's cool with it, and he appreciates that, but he can't help being a little amused when he adds, \"And I'm dating Steve.\"</p>\n<p>\"AHAHAHAHA I KNEW IT,\" Peter yells into the phone. </p>\n<p>Not the response he was expecting.</p>\n<p>\"YOU DID NOT YOU BIG LIAR,\" Tony yells back.</p>\n<p>\"I TOTALLY DID AND NATASHA OWES ME ROSTER DUTY FOR A WEEK,\" Peter answers. Roster duty is the bane of their existence, trying to schedule everyone so that someone's always on call. Peter hates it more than anyone. Tony thinks Coulson makes them do it themselves so he doesn't have to.</p>\n<p>\"You're such an asshole,\" Tony says, and then leans the phone away from his mouth and says to Steve, \"Why am I friends with these people?\"</p>\n<p>\"I heard that!\" Peter says. </p>\n<p>\"Because nobody else will put up with you,\" Steve replies.</p>\n<p>\"Oh man,\" Peter continues. \"Many happy returns, though, seriously. Can I tell Luke?\"</p>\n<p>\"Well, I was going to -- \"</p>\n<p>\"HEY LUKE!\" Peter yells, and Tony covers his face with one hand. \"TONY'S DATING STEVE!\"</p>\n<p>\"WHAT ELSE IS NEW?\" he can hear Luke answer. </p>\n<p>\"So does Coulson know?\" Peter asks. \"Is he cool with it?\"</p>\n<p>\"I told him this morning,\" Tony says. \"It's fine. If you sell this story to the tabloids I will out you as Spider-man, by the way.\"</p>\n<p>\"No, no, down low, got it,\" Peter says. \"Hey, is Steve there? Put him on, I need to tell him that if he hurts you I'll break his kneecaps.\"</p>\n<p>\"That's not funny.\"</p>\n<p>\"Yeah, I didn't think so when you did it to me over Pepper, either.\" </p>\n<p>\"Ugh, I'm not talking to you,\" Tony says. </p>\n<p>\"Okay, I'll see you tomorrow night for drills,\" Peter replies, laughing. \"I'm bringing you a rainbow magnet to stick on Iron Man.\"</p>\n<p>\"Goodbye, Peter.\"</p>\n<p>\"Bye Tony!\" Peter calls, and Tony hangs up. </p>\n<p>\"Well, that's the team,\" Tony says, as the fourteenth text from Pepper (the last three have just been OMG YOU ARE SO CUTE) appears. </p>\n<p>\"Natasha says we suck,\" Steve answers, studying his own phone. \"Apparently she had a bet with Peter and lost.\" He frowns. \"And Clint wants to do drinks and girl talk.\"</p>\n<p>\"He does not,\" Tony says, looking over Steve's shoulder. Steve raises his head and kisses him. </p>\n<p>\"Gotcha,\" he says. Clint's text actually says <i>Nice work bro.</i></p>\n<p>Tony's nineteenth birthday falls within a week of Steve's \"new\" twenty-third birthday. Steve thinks they should just have one big party, and that it would probably be a good time to come out. Tony tries not to think about it.</p>\n<p>\"So,\" Clint says, while they fight a mock battle in the assessment room. He flips over a robot and takes out three metallic tentacle things with an exploding arrow. Tony records the explosion for analysis later, because he can always improve Clint's arrows; he's got a second recording running on Peter, who doesn't cope as well with only a partial team, and Natasha and Luke aren't at drill today. \"Not to be the condescending guy who's been in more relationships than all of you put together, but you two have been dating what, like, ten minutes?\"</p>\n<p>\"Three weeks,\" Steve answers, catching his shield. \"Why?\"</p>\n<p>\"Well, do you really want to announce you're dating? Three weeks, man, that's nothing.\"</p>\n<p>\"It's not like we weren't friends before that,\" Tony replies. He's not terribly happy with his friends discussing his love life, but he supposes fair's fair, and it would be incredibly hypocritical to tell Clint to cut the comm chatter.</p>\n<p>\"I'm just saying, you break up two weeks from now, that's gonna be ugly in the press.\"</p>\n<p>\"Why would we break up?\" Steve asks, alarmed. A whirring claw almost takes him out, but Pepper butts him out of the way and smashes it. </p>\n<p>\"Heads in the game, kids,\" Coulson calls. Easy for him to say, he's standing behind two layers of shatterproof glass. </p>\n<p>\"Just trying to be the voice of wisdom,\" Clint says. </p>\n<p>\"Nuts to all of you,\" Pepper puts in. She's unusually quiet when she fights, it's kind of eerie. \"They're totally MFEO.\"</p>\n<p>\"Totally what?\" Steve asks. </p>\n<p>\"MFEO. Made For Each Other.\" Pepper grabs Peter out of harm's way and flips him towards a wall, where he sticks. \"It's super obvious.\"</p>\n<p>\"Creepier and creepier!\" Tony interjects. </p>\n<p>\"Oh my god, you woke him from his eternal sleep,\" Pepper continues. \"You're co-leaders of the team. He's the old-fashioned type and you're the super-modern gadget-head. Do I need to go on?\"</p>\n<p>\"I'm not old-fashioned,\" Steve grumbles. </p>\n<p>\"You opened your last text message to me with <i>Dear Ms. Potts</i>,\" Pepper replies. </p>\n<p>\"That's polite!\"</p>\n<p>\"Why are you getting your star-spangled shorts in a twist? I'm saying it's a good thing,\" Pepper says. \"You and Tony are one of those romances of the ages. I bet you grow old together and have lots of dogs.\"</p>\n<p>\"I <i>would</i> like a dog,\" Steve says thoughtfully, but Tony barely registers it because he's in the middle of a massive freak-out. </p>\n<p>He's not even nineteen. He's never had a boyfriend before. He can't possibly have found his soulmate, found <i>the one</i>, already, that just doesn't happen. And even if it did, it doesn't happen to him, because he has the most fucked luck in the universe. Which means Steve <i>isn't</i> The One, which means sooner or later they're going to break up. Crap, that's going to hurt really badly. He's going to lose his best friend. He's going to have to lead the team alone again, or leave it, or -- </p>\n<p>\"Tony? TONY!\" someone yells, and then Peter slams into him, knocking him off-balance. They tumble to the floor together, just in time to avoid a swipe by another giant claw thing. Peter flips up and off him, swinging into the rafters, arching backwards as he goes to try and web the claw in place. He misses, and the claw rears up, ready to smash Tony -- </p>\n<p>And freezes. </p>\n<p>The machines power down with a whrrrr, and the battle's over. Tony looks around to see if someone managed to get to the hidden circuitbox they were supposed to find and disable, but instead the door pops open, and Coulson walks in. </p>\n<p>\"You're done for today,\" he announces. Tony starts for the door -- they all do -- but Coulson stops them with a barked, \"I didn't say you could leave.\"</p>\n<p>He walks up to Tony, toe to toe. Coulson isn't generally gentle, but usually there's a sort of mellow affability to him which hides the fact that he could probably kick all their asses simultaneously. He is not mellow right now. </p>\n<p>\"Focus or get out,\" he says, and Tony blinks at him, retracting his helmet. Coulson turns to take in both him and Steve, who falls into parade rest unconsciously. \"You think nobody's ever going to shit-talk you in the field? Do not respond, don't even listen. The pair of you are leading this team, not being rescued by it. You,\" he says, rounding on Pepper, \"don't egg them on. This isn't social hour. You're a professional; act like it. And you, Agent Barton,\" he says, turning to Clint, \"are not the handler of this team. I am. If I think anyone needs assistance in managing their personal affairs, I'll be the one to speak to them. If I want you to give anyone advice, <i>particularly</i> in the middle of a firefight, I'll tell you so. Are we clear?\"</p>\n<p>\"Yes, sir,\" Clint says, lowering his eyes. </p>\n<p>\"Parker,\" Coulson adds. Peter visibly cringes. \"Good work.\"</p>\n<p>\"Uh,\" Peter says. </p>\n<p>\"Locker rooms, all of you. Take some downtime. Next time we drill, be better,\" Coulson orders, and stays in the room while the rest of them file out. </p>\n<p>Clint and Steve shower silently. Even Peter, normally chatty after a battle, ducks under the spray and keeps quiet. Tony sits on one of the locker-room benches, the steam from the showers curling around his ankles, and puts his head in his hands. </p>\n<p>His heart is racing, mind going around and around, worries about Steve and what Coulson just said and what Clint said about breaking up chasing through his head. He wishes he knew how to shut his brain off, wishes there were a way to dull this down to something manageable. Maybe he wishes a little that he wasn't so good at predicting the future, because then he wouldn't have to think about it so much. </p>\n<p>\"Hey,\" Clint says, and Tony looks up to see him half-dressed, pulling a t-shirt on. \"Listen, sorry I got our asses kicked by Coulson.\"</p>\n<p>\"No problem,\" Tony mutters. </p>\n<p>\"For real, I'm happy for you guys. It's just there's a reason I keep my shit private. Everyone wants a piece of you -- especially you,\" he says, glancing at Steve, who's tugging his jeans up in front of his locker. </p>\n<p>\"That's your decision,\" Steve says, not looking at either one of them. \"I respect it. Do us the same courtesy.\"</p>\n<p>\"Right.\" Clint's mouth twists. \"Coulson was right, it wasn't my place.\"</p>\n<p>\"Thanks,\" Steve says, pulling on a long-sleeved shirt with the SHIELD logo on the front. \"We're all tired. Coulson said take some downtime, I think we should listen to him. Peter, eat something,\" he adds, ruffling Peter's hair as he walks past. </p>\n<p>\"Yeah, yeah,\" Peter replies. \"I have a date with Pep and a pre-packaged sandwich from the dining hall. You guys coming?\"</p>\n<p>\"We'll catch up,\" Steve says. Clint follows Peter out, and Steve combs his hair while Tony finishes dressing. </p>\n<p>\"For the record,\" Steve says, watching him in the mirror, \"I'm not planning on breaking up with you.\"</p>\n<p>\"Yet,\" Tony replies, and Steve frowns. \"No, sorry, that's uh. That's Negative Tony talking,\" he adds, because even if they are going to break up, he doesn't want to do it <i>today</i>. \"Look, I told the guys in Maintenance I'd do a walkthrough of the forward rotation servos with them, I better get down there.\"</p>\n<p>\"Tony -- \" Steve warns.</p>\n<p>\"Granola bar!\" Tony replies cheerily, holding one up. \"Not skipping meals, just...spreading them out.\"</p>\n<p>\"Hm.\" Steve turns to face him, hands on his hips. \"Hey, are we okay?\"</p>\n<p>\"Yeah. We're super-okay,\" Tony replies. They are. For now. </p>\n<p>Steve cups his face with one hand and kisses him. \"Come find me when you're done.\"</p>\n<p>\"Probably be late.\"</p>\n<p>\"Find me anyway,\" Steve says, and walks out. </p>\n<p>Tony runs a hand through his hair, making it stand damply on end. When they break up it's going to crush him.</p>\n<p>He doesn't go find Steve immediately after the walk-through, which the engine room guys did ask him about, though perhaps not as urgently as he'd implied to Steve. Instead, once he leaves Maintenance he wanders the darkened nighttime halls of the Helicarrier, fingers drifting over the walls. His father designed this wonderful machine, this barracks in the sky. He knows Dad probably never did any of the fabrication himself, but he still imagines he's touching interfaces his father installed, lights he wired. He wonders what his dad would think of him and Steve.</p>\n<p>Well, no, he doesn't wonder. Dad would have loved Tony no matter what, and it's not like you can find someone better to bring home to your father than <i>Captain America.</i> But he probably would have had smart things to say too, advice about how to handle this, reassurances that he'd still be there no matter what. Tony wishes more than ever for his father's presence. </p>\n<p>He ends up on the Diplomat Deck, padding across the carpet to the terrace. At first he thinks he's alone when he steps out, but then a shadow moves in the corner of his eye and he sees Coulson, still in his suit from earlier. He's leaning on the railing, looking down at the Atlantic. </p>\n<p>Tony almost turns and goes back inside, but Coulson calls out, \"I'm sorry.\"</p>\n<p>Tony hesitates. </p>\n<p>\"For what?\" he asks, curiously. </p>\n<p>Coulson looks sidelong at him. \"Losing my temper today. It was uncalled-for.\"</p>\n<p>Tony shrugs, resting a hand on the railing. \"Wasn't untrue.\"</p>\n<p>\"That's relative,\" Coulson says. Tony edges forward hesitantly, leaning sideways on the railing. Coulson looks back at the water. \"Late for you to be out here.\"</p>\n<p>\"Late for anyone to be out here.\"</p>\n<p>\"Touche.\" Another sidelong glance. \"I saw you lock up, that's why I stopped the drill. It's a natural reaction. But it could get you killed, and you're about to draw a big target on your vulnerabilities.\"</p>\n<p>\"My relationships won't affect how I perform in the field, you know that,\" Tony says.</p>\n<p>\"I think I'm the one who <i>told</i> you that,\" Coulson agrees. \"It isn't what this was about.\"</p>\n<p>\"What was it about?\"</p>\n<p>Coulson blows air through his lips. \"You can't let someone you're fighting play on your emotions. Once this becomes public, they'll try. People are going to say things to you, about you, make nasty jokes. Make up stories. Call you names. And that's just ordinary people who can't control their fear. The ones who really want to get to you will be worse.\"</p>\n<p>\"Did that happen to you?\" Tony asks, because this is obviously personal. </p>\n<p>\"I was in the military before SHIELD, did you know that?\" Coulson asks. Tony shakes his head. \"Army. The fag jokes were not infrequent. It's all kidding around, bonding, except it wasn't. Not for the guys who couldn't talk about who they were.\"</p>\n<p>\"What happened?\"</p>\n<p>\"Lost my temper, finally. Punched a commanding officer. Well.\" Coulson half-smiles. \"Punched is my version. Their version got me a dishonorable discharge.\" </p>\n<p>\"Jeez, Coulson.\"</p>\n<p>\"Normally that'd keep me out of SHIELD, too. Fury wanted to bring me in when he heard I was a free agent, but he had to personally <i>vouch for my character</i>. Not because I punched some guy; because of why I punched him. This was years ago, Tony, but it's not ancient history. I can guarantee you the very first thing that will happen when you make this public is people will call for you both to be removed from the Avengers. There's a very good chance someone's going to mention Clint, and they'll try to get us removed, too.\"</p>\n<p>\"Listen, we don't want to get you guys in trouble -- \"</p>\n<p>Coulson waves it off. \"We've talked about it. Your team needs to stand by you, whatever happens. We're ready for that, and I'm too entrenched now to be ousted at any rate. But we're older than you, we know what to expect and how to deal with it. You can't lock up when push comes to shove, Tony, you have to throw it right back in their faces and prove you aren't afraid. I wish that weren't true, but it is.\"</p>\n<p>\"Well, I'm kind of known as a smart-alec,\" Tony says with a smile.</p>\n<p>\"So what happened today?\" </p>\n<p>Tony's throat tightens, fingers clenching on the rail. \"It's not what you think.\"</p>\n<p>\"Then what was it?\" </p>\n<p>Tony looks away. Coulson nods.</p>\n<p>\"In your own time, Mr. Stark,\" he says. \"Just keep it out of the Avengers, whatever it is. For what it's worth, I think it's a good call,\" Coulson continues, pushing off the rail. \"You know where I am if you need help.\"</p>\n<p>Tony stays after the door closes, staring into the distance, watching clouds drift over the water.</p>\n<p>When he finally gets down to Steve's rooms, Steve is sacked out on the bed, asleep, only his hair protruding from the thick electric blanket on the bed. Tony crawls on top of the blanket -- it's much too warm for him underneath -- and curls up around Steve, arm over his waist, legs tucked up in the curve of Steve's. </p>\n<p>Steve shifts, head emerging a little; Tony whispers, \"It's just me,\" and Steve nods and settles in again, never fully waking. Tony presses his nose into Steve's hair. </p>\n<p>He doesn't know how people...do this, do relationships. It was always just him and Dad, and then just him. Rhodey's parents are divorced, and Pep's mom is out of the picture, he never really asked why. He knows his dad had dates, had girlfriends even, but he kept that part of his life separate from his life with Tony. Tony's grateful -- he's seen what other kids have had to go through sometimes when their parents are dating -- but it means he has no experience with this, no context for what's normal. He just knows that this makes him happy, and the idea of losing it makes him afraid. </p>\n<p>\"I love you,\" he says into Steve's neck, because he's wanted to say it for a while now, but even he knows this is too soon, too fast. </p>\n<p>\"Vyoodoo,\" Steve mumbles. Tony tenses. \"Guhzlee.\"</p>\n<p>\n<i>I love you too. Go to sleep.</i>\n</p>\n<p>Tony tries, but it's hard to calm his thoughts. He snatches a few hours early in the morning, wakes briefly when Steve gets up, then falls back asleep and wakes again when he hears rattling noises. He opens his eyes to see Steve sitting on the couch, eating cold cereal. If they're in Manhattan, Steve goes running in the mornings; on the Helicarrier, usually it's the gym, or sometimes laps around the authorized areas with Clint. He never eats before then, which means -- Tony checks the clock -- yup, almost nine in the morning. </p>\n<p>He slinks out of bed (at some point Steve threw a blanket over him) and flops on the couch, leaning against Steve, face pressed to his shoulder. Steve offers him a sip of coffee, but Tony just curls more closely into him, burrowing under his arm. </p>\n<p>\"Hey, easy,\" Steve says, almost spilling his cereal. \"If you want the shirt you only have to ask.\"</p>\n<p>\"Sorry, sorry,\" Tony mutters, pulling back.</p>\n<p>\"No, that's okay, just -- \" Steve sets the cereal down, wriggles, shifts, and somehow tugs Tony over so that they're both sitting sideways on the couch, Tony's back to Steve's chest, hips cradled between his thighs. Tony settles, tries not to elbow Steve in the ribs, and links his hand with Steve's where it rests on his stomach. They sit that way for a while, quietly, until finally Steve says, \"You ready to talk about it yet?\"</p>\n<p>\"Did people talk about things in the forties? I thought you were all stoic and repressed at all times,\" Tony replies. He can feel Steve's breath against his scalp. </p>\n<p>\"Well, someone keeps making fun of me for being old-fashioned.\"</p>\n<p>\"That was Pep!\"</p>\n<p>\"Don't think I don't know the source,\" Steve answers, and Tony tenses again. \"No, hey,\" Steve protests, tightening his arm. \"Breathe. Whatever's scaring you, it's okay.\"</p>\n<p>Tony tries, miserably, but he doesn't really manage until Steve lifts his other hand, fingers scrubbing gently against the cord of his neck, right where he knows (the big cheater) Tony likes to be touched. </p>\n<p>\"Better,\" Steve murmurs, as Tony eases back against him. \"Want to try again?\" </p>\n<p>Tony closes his eyes.</p>\n<p>\"Is this about coming out? Because we can still call it off,\" Steve says. Tony shakes his head. \"Is it about Coulson dressing us down yesterday?\" </p>\n<p>\"No.\"</p>\n<p>\"So it's about what Clint said. What you said in the locker room. <i>Yet.</i>\" Steve pauses. \"If you're not happy -- \"</p>\n<p>\"No!\"</p>\n<p>\"Okay, shh.\" Steve drops a kiss into his hair. Tony squirms around until he can press half his face into Steve's shirt. He can feel his pulse, steady but fast. Tony knows from the medical files that Steve's enhanced metabolism means his heart beats faster, even resting, than a normal person's. Is that a weird thing to know? It's probably weird. Tony's never been able to quite approximate normal. </p>\n<p>\"What if I do something stupid and you leave?\" Tony asks quietly. </p>\n<p>\"Why would you do something stupid?\"</p>\n<p>\"Track record's not great.\"</p>\n<p>\"Hm.\" Steve seems to give this genuine thought, which is frightening. \"No. Can't see it. Perk of dating a genius.\" </p>\n<p>\"I collapsed.\"</p>\n<p>\"We fixed it.\" </p>\n<p>\"What if we break up?\"</p>\n<p>Steve sighs. \"Why are you so worried that we will?\"</p>\n<p>\"People do. Nobody I know has two parents living in the same house.\" Tony closes his eyes, gritting his teeth, but the words escape anyway. \"I can't be alone again.\"</p>\n<p>\"You're not alone,\" Steve says. \"Listen, even if we do, and I'm not saying we will, you have Pepper and Rhodey and the team. You have Solutions. You're Iron Man, you survive. It's what you do.\"</p>\n<p>\"Nobody finds their soulmate at eighteen,\" Tony mutters. \"It just doesn't happen.\"</p>\n<p>Steve laughs, light and kind. \"I see. Your standards are off.\"</p>\n<p>\"What?\" Tony asks, tipping his head back, eyes opening.</p>\n<p>\"Your standards. Your measures. They're broken,\" Steve tells him, more seriously. \"Tony, when you fall from a great height into the ocean off the arctic circle, you don't get a second chance. You die. When you get bitten by a spider, you itch for a few days and then it fades. When you are sixteen,\" he continues, \"and your best friend builds himself a suit of flying armor, he has the good sense not to build you a suit too. We're not normal. You've been a businessman since before you could drive. An engineer since before your voice broke. Me, I spent my whole life getting my butt kicked around Brooklyn and suddenly I was a national icon. I fought a war that ended sixty five years ago.\"</p>\n<p>\"But -- \"</p>\n<p>\"No. No protests.\" Steve cups a hand around his head, holding him still. \"Fury came to me after the Initiative got started, y'know. He said he'd heard I'd asked about what would happen if we didn't join up. He offered me a solo position.\"</p>\n<p>\"Son of a -- \"</p>\n<p>\"Breathe,\" Steve orders. Tony relaxes again into his hold. \"He said I could get out, see the new world, figure out who I was and what I wanted. I said no thanks. I know what I want. I think you do too, because losing everything...it strips you down until you come face to face with who you really are. This is who I am, and you are who I want, and I don't believe that's going to change. If necessary, I will keep proving that until you believe me.\" Tony can feel him smile. \"Should only take fifty or sixty years.\"</p>\n<p>Something deep in Tony's chest unclenches, something he didn't even realize he was protecting until suddenly it's exposed and raw. </p>\n<p>\"Make you a deal,\" he says, and is only distantly aware he's talking. \"You put up with my crazy crap for the next fifty years and I'll build you the best damn electric blanket you've ever seen.\"</p>\n<p>Steve laughs.</p>\n<p>\"Deal,\" he says.</p>\n<p>Tony turns fully, propping himself on Steve's chest. Steve obligingly slouches down a little, fitting their bodies together. </p>\n<p>\"Maybe,\" Steve adds, \"Just a little, I wanted everyone to know so that it'd be, you know. Official. Permanent. You and me.\"</p>\n<p>Tony kisses him, because he doesn't know how to respond to that. Steve sighs happily. </p>\n<p>\"I'm holding you to that electric blanket,\" Steve adds, and Tony laughs into his mouth.</p>\n<p>Tony Stark turns thirty on a beautiful sunny Saturday. </p>\n<p>The team has changed since they were kids running around kicking ass and having bucketloads of youthful drama. Clint left a few years ago -- nothing dramatic, he just got tired of jumping around buildings at the age of thirty-five and...well, basically took Coulson's old job, handling up-and-coming heroes. He still gets out in the field, and he still has better aim than basically anyone on the planet, but he's not an active Avenger anymore. (He's still an Avenger, of course. Once an Avenger, always an Avenger.) </p>\n<p>It's probably for the best. Coulson's in his forties and his heart wasn't going to stand that kind of strain forever. </p>\n<p>Natasha, crowing that she outlasted him, does not appear to be interested in stopping any time soon, thankfully. </p>\n<p>They have a Hulk now too, or rather they have a Bruce and a Hulk, since Tony managed to entice him/them onto the team. Bruce is quiet but funny when he wants to be, and he and Tony nerd out together in their lab on their downtime. Hulk adores Steve (who doesn't?) so he's more of an asset than a destructive force. Most days, anyway. </p>\n<p>Tony's still trying to get War Machine to join up, but Rhodey seems perfectly happy serving as heavy artillery for his Army unit, so it's mostly become a joke Tony makes when they meet up for drinks on Rhodey's leave. </p>\n<p>Pep and Peter, after breaking up and making up and breaking up and making up and breaking up and marrying other people and breaking up with <i>them</i> (oh, the emotions Tony has had to sit through with those two) finally gave in to the inevitable, got married, and spend all their time talking over each other. It's sweet. Their first kid's on the way, and the Avengers are very apprehensive about what kind of child Peter Parker and Pepper Potts will raise. </p>\n<p>They're calling him Patrick Parker-Potts, because they're evil. </p>\n<p>Luke is already giving them baby advice, because he found -- literally, he's the one who discovered her -- this amazing woman named Jessica, callsign Jewel. He figured out she had powers, recruited her, got her into training, fell in love, and pined for <i>years</i> before everyone got fed up with it and staged an \"ask her out or get over it\" intervention. Which is why the Avengers take personal credit for baby Danielle. </p>\n<p>On the other hand, they lost Luke to being a stay-at-home dad so Jessica can focus on her solo career, and Hulk is not nearly as witty as Luke used to be. </p>\n<p>Steve's still an Avenger. At thirty-four he can still outpace any of them, too, and he somewhat enjoys taking down cocky youngsters who think they own the world. There are a lot of those in SHIELD training; it's almost a requirement. Must Be Arrogant Enough To Pull Off Spandex. </p>\n<p>And of course, Tony. </p>\n<p>Tony turns thirty at the top of his game: leader of the elite Avengers, mentor to a handful of the kids Clint manages, and billionaire head of Stark Solutions, whose only close competitors are Microsoft and Apple. </p>\n<p>Tony turns thirty while getting shoved into a building by some second-rate asshole who invented a growth ray and blew himself up to forty feet tall, which apparently made him <i>nutfuck crazy.</i></p>\n<p>\"Am I allowed to say I'm getting too old for this?\" he asks, picking himself out of the remains of the buliding. </p>\n<p>\"No,\" Coulson answers. </p>\n<p>\"Am I allowed to beg off because it's my birthday?\"</p>\n<p>\"Sure, Tony,\" Peter says, dangling off forty-foot-tall-asshole's inseam. That can't be fun. Natasha's on the other side, shooting Widow's Stings right into his groin, which looks like even less fun. \"You go have some cake, we'll handle this.\"</p>\n<p>\"Don't be a hater,\" Tony replies. He's listing a little -- one of the repulsors is at half-power -- but he shoots out of the remains of the building and aims for the big guy's nose. </p>\n<p>\"Avengers pull back -- Spider-man, Widow, get out of there,\" Steve calls over the comms. \"I'm going to need some serious webbage. Hulk, stop that,\" he adds. Hulk is biting the guy's ankle. It's actually pretty funny.</p>\n<p>\"What's your play, Captain?\" Coulson asks.</p>\n<p>\"You remember the frost giants?\" Steve says. As one, the Avengers groan in dismay.</p>\n<p>\"That's right, we're doing this,\" Steve continues, amusement evident in his voice. \"Come on guys, there's just one this time, and we won't have to melt it. Iron Man, can you draw his attention?\"</p>\n<p>Tony's still aiming for the nose. \"I am all over it.\"</p>\n<p>\"Get him running. Spider-man and Widow, deploy two blocks east at the intersection.\"</p>\n<p>\"I love it when you talk soldier, baby,\" Tony says.</p>\n<p>\"Time and place, Iron Man,\" Coulson interjects.</p>\n<p>\"He's just jealous,\" Tony tells the team. </p>\n<p>\"Yes, I deeply envy your flying tin sweatbox.\"</p>\n<p>\"Not what I meant!\" Tony sings out, about two seconds before he crunches into the big guy's nose. </p>\n<p>There's a bone-rattling roar and Tony takes off, just fast enough for the giant to follow, watching for Peter and Natasha. Peter's in place, and a flash of blue down below says Steve is too; he's not expecting to see Natasha, but she'll be where she needs to be. </p>\n<p>Tony rips through the intersection and turns just in time to see Steve throw his shield, a length of steel coil rippling out behind it. The big guy's ankle hits the makeshift tripwire just as Natasha stings his ankles, and he stumbles and begins to fall. As he's going down Peter leaps into action, webbing him up so that he hangs, almost parallel to the street but twenty feet above it, strands of webbing dangling from the buildings.</p>\n<p>Pepper's team sweeps in then, a dozen men and women in SHIELD body armor, throwing super-light cables up and around the giant, binding him tightly. He roars, enraged, but he can barely move; the webbing, reinforced with the cables, holds him tight. Tony delivers two targeted blasts to his head, and the roaring subsides. </p>\n<p>Ever so slowly, he crashes all the way to the ground, and begins to shrink. </p>\n<p>\"Neurological input,\" Tony says, tilting his head. \"He controlled his size with his mind.\"</p>\n<p>\"Probably took up too much biological processing power, which is why he was totally insane,\" Peter agrees. </p>\n<p>\"Cool,\" Tony decides. He lands next to Pepper, the draft from the repulsors blowing her short red hair around, and retracts the helmet. </p>\n<p>\"That's for ruining my birthday, you dick,\" he tells the heap of webbing and loose coil. Pepper gives him a high-five, then begins barking orders into her comm. </p>\n<p>\"Nice work, kids,\" Coulson says.</p>\n<p>\"Thirty years old!\" Tony retorts. </p>\n<p>\"No mercy,\" Coulson informs him. \"You are the reason I have grey hair.\"</p>\n<p>\"Aw, you say the nicest things. Hey Cap, assemble up, we still have time to make an entrance at the party,\" Tony calls. </p>\n<p>Radio silence.</p>\n<p>\"Cap?\" he tries again. \"<i>Steve?</i>\"</p>\n<p>There's a feeling, and all the Avengers know it, that washes over them when they know something is wrong, something worse than a broken comm. Tony has that feeling now, and he takes off running down the street towards the intersection, Pepper on his heels, Natasha right behind. </p>\n<p>\"I can't raise him,\" Coulson confirms. </p>\n<p>\"I have visual,\" Tony says, because he does -- there's a red-gloved hand lying limp, on top of a heap of rubble. \"Oh, Jesus, no, Cap -- \"</p>\n<p>He skids to a stop and begins heaving cement and rebar left and right. The force of impact on the tripwire must have shoved Steve straight around into the building. </p>\n<p>\"Stupid bastard, if this asshole got him killed on my birthday I'm going to fucking rip his guts out -- \" Tony drops to his knees in the debris, clearing dust away from Steve's face, patting him all over. There's not a lot of blood, but Steve's too still, too pale, and what little blood there is comes trickling out of his mouth. \"Steve, fuck, Steve -- \" </p>\n<p>He's scanning for internal injuries, spinal cord damage, and as soon as the scan comes back negative Tony pulls him up, curls around him and strokes his hair back, slapping him gently. \"Come on, come on. Baby, don't do this to me. Steve, come on.\"</p>\n<p>Steve coughs, twists, lets out a yell of pain; Tony exhales and grips him tightly.</p>\n<p>\"That was unpleasant,\" Steve moans. He turns to the side and spits out two teeth (they'll grow back, they always do, it's eerie). The blood, Tony can see, is from the injured gums.</p>\n<p>\"Oh, thank you,\" he mumbles, pulling Steve into a backwards hug, pressing his forehead to the crown of Steve's head. \"Man, you can't die on me yet, you've got thirty-nine years left on your sentence.\"</p>\n<p>Steve flails, pulling his legs out from under another pile of cement. \"Whatever,\" he manages, panting. \"You still owe me that damn blanket.\" </p>\n<p>Tony laughs, kisses him upside-down, laughs some more. Pepper sits back in relief as Natasha clears the last of the rubble away from them. Hulk lumbers up, Peter crouched on his shoulder. Hulk takes it all in, narrows his eyes, and rumbles, \"Cake now.\"</p>\n<p>\"Yeah buddy,\" Steve agrees. \"Cake now.\" </p>\n<p>\"Birfday cake,\" Hulk insists. </p>\n<p>\"Yep, we'll get you a corner piece with lots of frosting,\" Tony agrees. </p>\n<p>\"You promised everyone a corner piece,\" Steve groans, getting to his feet. </p>\n<p>\"So?\"</p>\n<p>\"So there's five of us. Eight if you count Pep, Clint, and Coulson.\"</p>\n<p>\"I don't like frosting,\" Coulson says over the comms. </p>\n<p>\"That's because you're a joyless automaton,\" Tony babbles, lightheaded with relief. \"What's the problem? Are you saying I'm not capable of designing a cake with eight corners? I'll have you know my cake not only has eight corners but exists in six dimensions. This cake is not a lie.\"</p>\n<p>\"I've talked to your party planner. There are three cakes,\" Coulson sighs. \"You're all dismissed. I'll see you at the party.\"</p>\n<p>The party is a publicity stunt, which means the guest of honor is almost optional. When the Avengers are made as presentable as they ever get, they troop out from the Helicarrier -- currently docked in the bay -- and board the yacht moored off the side of it. Avengers past and present are there; Rhodey made it too, which is awesome. There's some SHIELD brass and agents, a couple of politicians, and a massive number of reporters. </p>\n<p>Tony jets down in style in his spare armor, the one without much firepower but currently much shinier than his battle suit. He sends it to stand sentinel on the deck with a gesture, which never fails to impress the reporters, and settles in at a table to hold court. He accepts presents, eats cake, chats with important people; he kisses Steve for the cameras (always kisses Steve for the cameras, and Steve always blushes) and has a dance or three. </p>\n<p>And, as night falls, the SHIELD agents in the crowd begin gently but firmly herding the reporters back into waiting jets and choppers. Tony watches it all with a faint smile on his face. Slowly, the yacht empties out until it's just him and the people he actually wants at his party: The Avengers. Rhodey and Pep. Coulson and Fury. </p>\n<p>\"This is more like it,\" he says, relaxing back into his chair. Steve, next to him, is eating his millionth piece of cake. </p>\n<p>Clint and Coulson are standing at the rail, looking out at the water, Clint's arm casually slung around Coulson's waist. Pepper is arguing regs with Fury, which means they're both having fun. It looks like Rhodey might be refereeing. Luke and Jessica are slow-dancing to the tune playing on the speakers, while Peter minds baby Danielle and watches Pepper fondly. Bruce and Natasha are dancing too, and Tony wonders if that's the start of something. </p>\n<p>Looking up, he can see faces at the windows of the Helicarrier, some of Clint's kids trying to get a glimpse without being seen. The next generation of Avengers is up there somewhere; one day one of those kids will be leader. A nice legacy, though hopefully not anytime soon. He hopes he's setting a good example for them. He's pretty sure he is. </p>\n<p>The moonlight shines over the water and the yacht and the dancing, and the fairy lights strung over the deck sway in the breeze. In a shadow, his armor stands silent, waiting for him. </p>\n<p>Tony rests his head on Steve's shoulder and laughs. </p>\n<p>\"What's funny?\" Steve asks, smiling down at him.</p>\n<p>\"Everything I love is in one place,\" Tony says.</p>"
}