{
  "id": "40569",
  "url": "https://archiveofourown.org/works/40569?view_full_work=true",
  "author": [
    "astolat"
  ],
  "title": "Favorite",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin/Arthur Pendragon"
  ],
  "characters": [
    "Merlin",
    "Arthur Pendragon"
  ],
  "additional_tags": [
    "Originally Posted on LiveJournal"
  ],
  "language": "English",
  "series": "Part 14 of Merlin works",
  "published": "2009-03-12",
  "completed": null,
  "words": "13,012",
  "chapters": "1/1",
  "comments": "433",
  "kudos": "20,068",
  "bookmarks": "5,150",
  "hits": "312,428",
  "summary": "<p>Arthur was tipped back against the wall, his mouth open for breath and staring at the small arrow-slit window over Merlin's head, trying to work out how it could <em>possibly</em> be that good with <em>Merlin</em>, of all people.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>With heaps of thanks to Julad and Mia and Terri and Dira and Ces! \\o/</p>\n<p>All feedback much appreciated!</p>\n<p>\n<a href=\"http://astolat.livejournal.com/193225.html#comments\" rel=\"nofollow\">Original livejournal post</a>\n</p>",
  "text": "<p>The castle staff outdid themselves for Samhain feast that year, as though celebrating more than just the festival, and after two weeks spent mostly on broth and bread and gruel, Arthur was more than happy to enter into the spirit. When it was all over, he was better than nine-tenths of the way to falling-down drunk. Fortunately, Merlin was convenient to lean upon as they wobbled up the stairs. He'd been drinking a great deal too, though, so they stumbled anyway in the corridor, and Arthur ended up tipped against the wall with Merlin half fallen on top of him, and his hands slid accidentally up under Merlin's pulled-loose shirt.</p>\n<p>Merlin's skin was warm and smooth, and Merlin gave a sort of hiccupping laugh and Arthur laughed too, and kissed him mostly for sheer joy of being alive. Then Merlin's mouth turned out to be unusually soft and sweet and yielding, and so Arthur kissed him again. Merlin made a noise into his mouth, his hands were on Arthur's hips, and a startling shiver went up Arthur's back.</p>\n<p>They were three doors away from his chambers; he didn't want to stop long enough to get there. He dug open Merlin's trousers—Merlin was fumbling wildly at his tunic, pulling it out of the way. Merlin's hand on him was a revelation that burned through the haze of liquor; Arthur jerked him wildly with one hand, his other buried in Merlin's hair, holding him close for kissing. He was <em>appalled</em> how good it felt, his hips thrusting desperately into Merlin's grip.</p>\n<p>\"Arthur—oh <em>god</em>,\" Merlin said, between confusion and pleasure, and Arthur stared into his face; Merlin looked as shocked as he felt, his mouth open. \"This isn't, we shouldn't?—<em>oh</em>,\" Merlin said and pushed shuddering into Arthur's grip, cock hard and unsheathed and blazingly hot, a pleasure all its own to have wrapped in his hand, soft skin tender and going slick beneath his fingers.</p>\n<p>\"Don't be an idiot,\" Arthur said, because of course they shouldn't, but what difference did that make when it felt like <em>this?</em> As though either one of them were going to stop. He dragged Merlin back in, because he wanted another kiss, and another, and still couldn't get enough, not even if he'd pressed their bodies together into one. He tried anyway, shoved more of Merlin's clothing out of the way, and Merlin's hand was pushing Arthur's trousers down his legs.</p>\n<p>And all Arthur could think of was Merlin, his mouth, his hand, the hard bones of his shoulders pressed against Arthur's chest, their thighs chafing sweatily together, perfect, <em>perfect.</em> Then Arthur was spilling helplessly into Merlin's hand, and Merlin on him, and then they were standing in the hall, panting, both of them naked and dripping and bruised like over-handled fruit.</p>\n<p>Merlin said in a dazed, syrupy voice, \"That was—that—Arthur—\"</p>\n<p>Arthur was tipped back against the wall, his mouth open for breath and staring at the small arrow-slit window over Merlin's head, trying to work out how it could <em>possibly</em> be that good with <em>Merlin</em>, of all people, and then he heard footsteps coming up the stairs and realized he was about to be caught in the hallway looking like a drunken half-wit who couldn't even restrain himself long enough to get off in private.</p>\n<p>\"Move,\" Arthur said. \"Move, bloody <em>move!</em>\" He dragged his pants up around his waist, abandoned his belt and Merlin's scarf where they were lying on the floor, and he shoved Merlin down the hall and through the door of his rooms.</p>\n<p>He kicked the door shut, and then jerked his stained shirt off over his head, and wiped himself clean before he threw it on the floor. Merlin was mopping at himself with a washcloth at the basin, without so much as a by-your-leave. Arthur would have yelled at him for it, except Merlin's head was bent forward, and all Arthur could think of was how badly he wanted to go over and bite at the back of Merlin's neck where it sloped into the shoulders.</p>\n<p>\"Good <em>God</em>,\" he said, beginning to be rather horrified at himself. It was one thing to have latched onto Merlin as the nearest warm body available for a quick one-off drunken shag in the corridor, and quite another to be strategizing another round with him. Merlin was his servant. Merlin was—irritating, and wrongheaded, and constantly insubordinate; and it already took more time and attention than Arthur could spare to keep Merlin even vaguely in line.</p>\n<p>So this was not going to be a regular thing, no matter how unbelievably fantastic it had been just wanking off together in the hallway just now. He did not need to know how much better it might get if he shoved Merlin into his bed and—</p>\n<p>Merlin turned away from the basin, then gulped and said, \"Oh,\" also in a certain degree of horror, and then rather unwillingly, his eyes dragged over and looked at the bed.</p>\n<p>Arthur wavered a moment longer, struggling; but indecisiveness was a sin Uther had cured him of by age thirteen, so he said, \"All right, bloody come here already,\" and Merlin nearly tripped over his own feet, trying to get across the room and take off his tunic and his trousers and his boots all at the same time.</p>\n<p>When Merlin woke the next morning, he spent a good ten minutes staring at the canopy, trying to convince himself he didn't remember where he was and didn't remember exactly what he was doing there and how many times he had done it. Arthur was still snoring into the pillows next to him, hair spiky and matted with sweat and, er, possibly other things, as they hadn't exactly stopped to wash in between.</p>\n<p>Merlin had plenty of standards for comparison—well, four, or at least three, if you wanted to be picky and not count Katelyn, since all he'd managed with her so far had been a couple of kisses. But besides her, there'd been Will, and Reenie, from the kitchens, and Prydda; and on top of that, Gwen had kissed him once, which he remembered as being extremely nice even though he'd been half-dead at the time. And none of it, even the best parts, had been <em>remotely</em> close to how he'd felt just under one touch of Arthur's hand, spread wide over the hollow of his back.</p>\n<p>Which would've been bad enough, because honestly, as though Arthur needed any <em>more</em> advantages. Merlin already felt sick with love for him sometimes, in an unpleasant way something like a rash, where it prickled up on you at inconvenient moments. Merlin had grimly got used to the awkward outbreaks of love and could handle them without letting on, but not with Arthur <em>actually</em> tossing him into bed and the two of them having at it for hours. Merlin had a truly awful memory of telling Arthur he was gorgeous and amazing and perfect somewhere around the third go, and it was best not to even think about the things he'd said when they'd been panting weakly after the fifth time, just before they'd fallen asleep.</p>\n<p>Clearly, Merlin needed to get out of bed, and go and douse himself under the pump, and then have someone <em>else</em> get Arthur a bath, and for both of them to never speak of this again.</p>\n<p>He lay there agreeing with himself on this extremely sensible course of action, and then Arthur rolled over, landed mostly on him, and woke up. They stared at each other for a long moment, while some stupid and inappropriate bird sang just outside the window, and then they had sex again.</p>\n<p>Afterwards, Arthur said firmly, \"We were drunk.\"</p>\n<p>\"Yes!\" Merlin said. Arthur was a genius. \"Extremely drunk. Almost out of our minds.\"</p>\n<p>\"Exactly,\" Arthur said. \"And now we will never speak of this again.\"</p>\n<p>\"Right,\" Merlin said, with deep relief, and then he got out of bed to go put on his clothes, and Arthur said, \"...starting an hour from now.\"</p>\n<p>\"Right,\" Merlin said, and got back into the bed.</p>\n<p>Four hours later he staggered back into Gaius's quarters, one shoe unlaced and one shoe off and his trousers somewhere in between; he'd sacrificed dignity for escape—well, Arthur had sacrificed it for him by yelling, \"For God's sake, <em>get out</em>,\" halfway through the third time Merlin had tried to get dressed.</p>\n<p>\"Good heavens, were you rolled by thieves in the castle hallway?\" Gaius said, looking up from his potion-brewing.</p>\n<p>\"Um,\" Merlin said. \"I was drunk. Really very drunk.\"</p>\n<p>\"Did you and Arthur drink <em>more</em> in his quarters after you left?\" Gaius said, a little severely.</p>\n<p>\"No,\" Merlin said. \"I mean yes. Yes, we did. We drank a very great deal. And so we don't remember anything.\"</p>\n<p>Gaius paused and gave Merlin an odd look.</p>\n<p>\"I'm going to go have a bath now,\" Merlin said.</p>\n<p>\"Yes, I think that would be an excellent idea,\" Gaius said. \"And after that, you can take some of this headache remedy to the prince.\"</p>\n<p>\"No!\" Merlin said. He was not going anywhere near Arthur, who was a deadly menace to the virtue and sanity of poor hapless manservants. \"Um. I mean. I think Arthur just—wants to sleep.\"</p>\n<p>Arthur did not want to sleep, because sleeping would have involved staying in the bed, which stank of sweat and the amazingly good sex he was not under any circumstances thinking about. He had a horrible feeling that he had offered Merlin part of the kingdom at some point during the night. Arthur wanted to bathe, and to have his bed stripped down to the ticking, or possibly replaced entirely, and to have his mind wiped clean of the last twelve hours.</p>\n<p>He managed to arrange the first two of his desires, and in order to work towards the third, went out and rounded up all his miserable and hung-over knights for some impromptu drill. If he was suffering—and he was—then he saw no reason why anyone else should get out of it. \"You may need to fight in worse condition one day,\" he said coolly, when Sir Roderick accused him of being a slavedriver. \"Also, you shouldn't have gone on to drink with the drovers afterwards, you know they love to see knights completely shitfaced.\"</p>\n<p>Roderick just whimpered, pathetically.</p>\n<p>Afterwards, Arthur ordered himself another bath, and then poked around the castle until he found the very agreeable chambermaid who had shared his bed a few nights before the whole mess with the Questing Beast, and he tugged her into one of the empty guest chambers.</p>\n<p>\"Mm,\" she said happily, when they were done, petting his chest. Arthur lay staring up at the ceiling in blank horror. It hadn't been <em>bad</em>, of course. It had been entirely pleasurable, and he had enjoyed every moment, and she was much prettier than Merlin and infinitely more to Arthur's taste, and certainly more skillful, and it had been as good as almost any sex he'd ever had in his life.</p>\n<p>Which was on the order of saying the time he'd sprained his ankle in the summer tourney had been as bad as almost any injury he'd ever had in his life—except for the horrible poisoned monster bite that had nearly killed him two weeks ago and was still making his shoulder ache.</p>\n<p>Probably there had been some sort of drug or poison in the wine last night. Or possibly it was a spell.</p>\n<p>\"I think it very likely might be a spell,\" Arthur told Gaius. \"Or a drug.\"</p>\n<p>\"Yes, sire?\" Gaius said. \"And the effects are...?\"</p>\n<p>Arthur stared at Gaius helplessly.</p>\n<p>Abruptly the door to Merlin's small room opened, and Merlin came out looking disheveled and pale. \"Gaius, is there any drug that—\" he said, sounding vaguely panicked, and stopped.</p>\n<p>Arthur glared at him, and his long smooth neck, and the purpling marks of his own mouth, where he'd tasted Merlin's skin and Merlin had moaned and arched into him, and dragged his fingers through the sweat on Arthur's back, and—</p>\n<p>Merlin licked his lips, and Arthur said, \"Nevermind, Gaius,\" and jerked his head to Merlin, who followed him out into the corridor. They made it about thirty feet, to where there was a little windowed alcove with a ledge running around it at chest-height. Arthur turned Merlin around and jerked his trousers down and fucked him. Merlin clung to the ledge and gasped and panted and said, \"Yes, Arthur, yes, <em>yes</em>—\" and was incredibly tight and hot, and Arthur nosed into the dip between his shoulders and licked sweat off his sharp angles and stroked Merlin's cock until they both came.</p>\n<p>Arthur didn't pull out right away, fucking Merlin some more just to break those little stuttering cries out of him, even though his own cock was sore and tender. When he finally couldn't bear it anymore and slid out, he staggered back against the opposite wall of the alcove and stared at his hand, sticky and wet. He wasn't going to, he didn't want... Then Merlin finished fastening up his trousers again, stumblingly turned around and saw him, and Arthur slowly raised his hand to his mouth and watched Merlin's eyes dilate impossibly wide while Arthur licked his fingers clean.</p>\n<p>A week later, Merlin finally confessed to Gaius in sheer desperation.</p>\n<p>\"Well?\" he prompted.</p>\n<p>Gaius continued not saying anything. He had a sort of lopsided, pursed-mouth look on his face. \"You and—Arthur,\" he said.</p>\n<p>\"<em>Yes</em>,\" Merlin said. \"Gaius, please, you have to help us.\"</p>\n<p>\"Is there any chance,\" Gaius began, a little suspiciously.</p>\n<p>\"No!\" Merlin said. \"Do you seriously think I'd cast a <em>love</em> spell on Arthur?\"</p>\n<p>\"It does seem unlikely,\" Gaius said. \"However, somewhat less so than a spontaneous generation of the same emotion.\"</p>\n<p>\"We're not <em>in love</em>, anyway,\" Merlin said. \"I don't even really <em>want</em> him. It's just—it's so—\"</p>\n<p>\"Yes, well,\" Gaius said hastily. \"And this began after Samhain?\"</p>\n<p>\"That night,\" Merlin said. \"We were drunk?\" he added, feebly. They hadn't been drunk the last six days, so the excuse was wearing thin.</p>\n<p>\"Hm,\" Gaius said. \"Well, I will have to do some research.\"</p>\n<p>In the meantime, Merlin resigned himself to his fate and went to see if Arthur needed anything, which these days was a cautious and complicated process where Merlin waited in the hall until he heard someone coming, opened the door and stood just inside the threshold, not letting it shut, and said, \"Is there anything I can do for you, sire?\"</p>\n<p>Usually that worked: he managed to resist the temptation to go inside, and Arthur managed to resist the temptation to order him to come in. At least half the time, anyway. Or close to half the time. Well, it had worked twice so far.</p>\n<p>Tonight, though, he opened the door and found Arthur already naked and in his tub, and Merlin had a sort of gibbering moment and didn't really regain his sanity until he was half-soaked and fucking Arthur wildly up against the table, Arthur holding tight to the far end and moaning while narrow rivulets of water ran off down his thighs onto the floor.</p>\n<p>\"Oh, bloody hell,\" Arthur said, after, and slid down off the table into a heap. Merlin was already collapsed on his back on the floor, lying in a puddle of water with his cock flopping out of his trousers. He couldn't summon the strength to do anything about it.</p>\n<p>Arthur heaved himself up again and glared down at him. \"This is <em>intolerable</em>.\"</p>\n<p>\"I talked to Gaius,\" Merlin said dazedly.</p>\n<p>\"And?\"</p>\n<p>\"He said he'll—do some research.\"</p>\n<p>\"For whatever good that will do,\" Arthur said, and climbed back into the tub. \"Make yourself useful, wipe that mess up and come scrub my back.\"</p>\n<p>It seemed only obvious to climb into the tub behind Arthur to do the scrubbing. Merlin ran soapy hands down Arthur's back, slowly, and then up; and Arthur rolled his shoulders into Merlin's hands, and sighed, and it was really unfairly easy to—it just took Arthur raising himself up a little, on the sides, and he slid right back down onto Merlin's cock with barely any resistance, and it was easy to bear his weight in the water. Arthur let his head sink forward as he rocked, and Merlin pushed his hips up cooperatively in the perfect rhythm that they'd fallen into naturally. Again.</p>\n<p>After they'd shuddered together to a close, Arthur folded his arms and leaned against his knees, without even bothering to slide off, while they caught their breath.</p>\n<p>\"It's not always this good for you, is it?\" he asked, in what might've almost been a plaintive tone.</p>\n<p>\"If it were always this good for me, I don't think I'd ever have left Ealdor,\" Merlin said, and whimpered as Arthur shifted on him. His cock hadn't really been allowed to go soft, inside Arthur, and now it was already hardening again. He hadn't known it could <em>do</em> that. He wasn't sure he <em>wanted</em> it to do that. He stifled another whimper.</p>\n<p>\"I'd probably have tried to challenge Lord Gwydded,\" Arthur said, in reflective tones.</p>\n<p>\"Who's—\" Merlin had to stop, swallowing, as Arthur leaned back against him.</p>\n<p>\"His wife was my first,\" Arthur said. He groaned softly, settling in; as though Merlin were a convenient cushion. Give or take certain non-cushion-like aspects.</p>\n<p>\"You seduced the wife of a lord?\" Merlin asked absently, preoccupied. He'd changed his mind, he was very happy, this was just right—</p>\n<p>\"Don't be absurd, Merlin, I was fourteen,\" Arthur said. \"<em>She</em> seduced <em>me</em>. Now, move. Yes. Like—oh sweet bloody hell, <em>yes</em> and <em>yes</em> and—\"</p>\n<p>After he finally got Merlin out of the room and off to his bed for the night, Arthur staggered over to his own and collapsed face down into his pillows. He'd never done more with another man than get his cock sucked; it'd always seemed too much trouble. And he most certainly had never remotely considered letting anyone fuck him before. Now he was lying here sore from <em>making</em> Merlin, three times.</p>\n<p>It was just—everything was so spectacular Arthur wanted all of it—every possible combination, every possible sensation. But this was becoming absurd. He'd had Merlin more than once every day of the last week, and some part of him was regretting having sent Merlin away just now. He hadn't let Merlin sleep in his bed since the first night, because he knew very well what lay at the end of that road: Merlin in his bed <em>every</em> night, waking up with that vague, muddled look that made Arthur want to scowl at him fiercely.</p>\n<p>Whether Merlin was sleeping in his bed or not, though, Arthur had no illusions about how long it was going to take for this to become common knowledge if it kept up. And if Arthur went on pretending he wasn't doing it, that would be as much as announcing to the court he had no care for Merlin at all. Which he didn't, obviously, not <em>that</em> way; but he was not going to mark Merlin as someone who'd do this sort of thing for just anyone. Some knight or visiting noble might misunderstand, and with Merlin's luck, Arthur would probably end up having to kill somebody or even start a war.</p>\n<p>So that was obviously not workable, but <em>acknowledging</em> Merlin as his—his—well, clearly, something had to be done before things reached that point.</p>\n<p>In the morning, Arthur suggested a long surprise patrol of the southern forts to his father, a bit of a spur to discipline for the commanders and exercise for his men. It was just the kind of thing Uther approved of, ordinarily, but instead of waving Arthur on his way, Uther hesitated uncharacteristically long.</p>\n<p>Arthur stared at him and said, \"Father, I'm <em>fine</em>. And it will be just as well,\" he added pointedly, \"to silence any rumors that may have spread about my health.\"</p>\n<p>Uther finally nodded. \"Very well,\" he said, and then added abruptly, as though he couldn't help himself, \"Take three weeks,\" which was a week longer than it needed at any reasonable pace, but under the circumstances, Arthur wasn't going to complain.</p>\n<p>\"You'll need to pack my things for the morning,\" he told Merlin. \"Chainmail and leather, not the plate; and make sure I have at least one good tunic. And—don't <em>stop</em>.\"</p>\n<p>Merlin slid his mouth off with a wet, popping sound, and glared up at him. \"If you expect me to remember anything you say to me while I'm—\"</p>\n<p>\"I'll tell you again after, stop complaining,\" Arthur said. \"I'm trying to last.\"</p>\n<p>Merlin rolled his eyes and went back to sucking Arthur's cock, somehow managing to be simultaneously irritated and dreamy about it, which had, surprisingly, quite the appeal; or it would have been surprising except <em>everything Merlin did</em> was appealing.</p>\n<p>\"And Gaius had <em>better</em> have a cure for this by the time I get back,\" Arthur added, and shut his eyes to enjoy the final glorious rush.</p>\n<p>Three weeks later—all right, two weeks and four days later—Arthur rode back into Camelot. He left his horse in a groom's care, caught a servant in the corridors to go tell his father he was back and would report shortly, and shot straight up to Gaius's quarters. Merlin was in the room slumped over a bubbling potion, poking at it with a wooden spoon.</p>\n<p>Merlin's head came up when the door opened, and his eyes widened. Arthur gripped tight to the door handle and said, \"Where's Gaius?\"</p>\n<p>\"In town,\" Merlin said, with the fixed, rigid look of a starving man shown into a feast. \"Not back for an hour.\"</p>\n<p>\"Good,\" Arthur said, except it was not good, it was woefully insufficient, especially with the ridiculous excuse for a bed in Merlin's room: they fell off six times, and Arthur banged his elbow painfully against the wardrobe once.</p>\n<p>Afterwards Arthur lay back gulping for breath, in misery, while Merlin trembled in his arms in a horrified and extremely sated way.</p>\n<p>\"I tried to fuck <em>seventeen women</em> while we were on patrol,\" Arthur blurted. \"<em>Nice</em> women. Very attractive women. Some of them were twins. It was horrible. Some of them, I couldn't even—\"</p>\n<p>\"Yeah,\" Merlin said, in tones of darkest gloom. \"I know.\"</p>\n<p>\"Tell me Gaius found a cure,\" Arthur said.</p>\n<p>\"Um,\" Merlin said.</p>\n<p>Arthur shut his eyes. \"Did he have <em>anything</em> to say?\"</p>\n<p>There was a perfunctory knock on the door, and Gaius opened it and said in extremely long-suffering tones, \"Merlin, I realize this is unfair to ask of one sunk in the depths of despond, but could you perhaps have at least taken the potion off the flame before you—\"</p>\n<p>He stopped very abruptly and, with the wisdom of ages, shut the door again.</p>\n<p>\"He said it wasn't an illness to, um, <em>like</em> someone,\" Merlin said, after they had shared a brief and appalled silence.</p>\n<p>\"I don't <em>like</em> you at all!\" Arthur said.</p>\n<p>\"I don't like you either!\" Merlin said. \"Not even a little.\"</p>\n<p>Arthur groaned and thumped his head back against the pillows. After a moment, he drew a deep breath and let it out. \"All right,\" he said, grimly. \"There's no help for it. Pack up your things.\"</p>\n<p>Merlin sat up in the bed. \"You're throwing me out of Camelot?\" he said, voice rising.</p>\n<p>\"What good would that do?\" Arthur said dispiritedly. \"I'd give it a week before I went after you. No, you're moving into my chambers. I can't keep skulking around the castle corridors like I'm ashamed of myself.\"</p>\n<p>\"I'm—<em>what</em>?\" Merlin said, his voice rising even more. \"I'm not moving into your chambers! People will think I'm your—your—<em>mistress</em> or something.\"</p>\n<p>\"You <em>are</em> my mistress, you idiot,\" Arthur said, and then paused to shudder. \"My favorite,\" he corrected.</p>\n<p>He got out of the bed and scowled around at the mess of his armor and clothing on the floor, which had got mixed in with what looked like all of Merlin's clothes from the last week, along with some scattered books, a few loose bunches of herbs, and, in the corner, a wizened dead mouse. \"Get up and help me get dressed again,\" he said. \"I have to go report to my father. And I expect you to be moved by the time I'm finished speaking with him.\"</p>\n<p>Arthur had obviously lost his mind, and he had a mulish look which suggested he wasn't interested in finding it again, either. Merlin argued without a pause for breath through the entire process of getting Arthur back into his things, and might have saved every word for the good it did.</p>\n<p>\"Look, can't I just keep on being your—manservant with benefits?\" Merlin tried, while he laced up the sides of Arthur's padded tunic.</p>\n<p>\"No, you <em>can't</em>,\" Arthur said, and shivered as Merlin's fingers slipped by accident and brushed against his ribs, and then Merlin had to unlace the sides all over again.</p>\n<p>\"But,\" Merlin said, a while later, panting damply into Arthur's shoulder.</p>\n<p>\"Stop arguing, Merlin,\" Arthur said, muffled, his head still buried in his folded arms on the mattress; he was bent over the side of the bed. He pushed himself up with a groan, tumbling Merlin off him. \"One chambermaid walking in on us and everyone will know anyway. It's a miracle no one but Gaius has caught us already.\"</p>\n<p>\"So they'll know; I don't care!\" Merlin said, slumping to the floor.</p>\n<p>Arthur rolled his eyes and stood up. \"Because you're an idiot who doesn't understand anything about the royal court. You'd be eaten alive in five minutes. Now clean me up.\"</p>\n<p>\"You can't just order me to be your mistress!\" Merlin argued, two rounds later, after he'd finally gotten Arthur back into his mail.</p>\n<p>\"I just did.\" Arthur settled his cloak more firmly, dragged Merlin in for a final kiss that made his head spin, and shoved him back down onto the bed. \"Now get moving,\" Arthur said, and swirled out of the room.</p>\n<p>Merlin opened and shut his mouth a few times, uselessly, to the empty air. All right, so the last three weeks had been one long dull grey stretch of boredom, and if pressed he would allow that he was glad Arthur was back; and at swordpoint Merlin might even admit that it wasn't completely horrible to face the prospect of fantastically good sex on a regular basis.</p>\n<p>But that was one thing, and a far cry from signing on to be Arthur's—<em>paramour</em>. He could stand being thrown in the stocks once a week or so; he didn't let any of the painful things hit him, and it was as good a way as any to decide when it was time to take a bath. He wasn't going to be turned into some odd between-stairs creature, too high to eat downstairs and too low to do anything but make a fool of himself at the high tables. Not so he could avoid errands or gossip, or so he and Arthur could have at it more conveniently.</p>\n<p>He wasn't having any of it. Prancing about in fine clothing like he thought really well of himself, being curtseyed-at by the serving girls—lolling about with no real work to do except wait for Arthur to pop in demanding blowjobs—waking up every morning with Arthur stretched out next to him, with his golden hair tufted up ridiculously in the sunlight—kissing Arthur over breakfast and probably falling back into bed with him as often as not—curling up in Arthur's arms all the long, cold nights of the coming winter —</p>\n<p>Merlin paused and forcibly reorganized his thoughts back to the point, which was that he was <em>not</em> going to be Arthur's mistress. Besides, if he was forced to do anything that horrible and extreme, he could not possibly be responsible for his self-control, and he would probably go and fall in love with Arthur. Given that so far Merlin had already killed some ten people, three monsters, and wrested the power of life and death from an evil priestess, all for Arthur's sake, Merlin was a little bit anxious about how much further this could possibly go. Also, Arthur would probably notice the magic at some point.</p>\n<p>Merlin lunged off the bed and burst out into Gaius's chambers. \"He'll notice the magic!\" he gasped.</p>\n<p>Gaius looked up from the blackened cauldron he was trying to scrape clean. \"If you mean Arthur, I think he will first notice the <em>absence of clothing</em>.\"</p>\n<p>\"What?\" Merlin said. \"Gaius, don't talk nonsense, don't you understand? Arthur wants me to move into his chambers.\"</p>\n<p>Gaius didn't show anything like what Merlin felt was the appropriate level of sympathy. \"I am beginning to think you had better.\"</p>\n<p>\"He'll catch me in five minutes!\" Merlin said desperately.</p>\n<p>\"On the available evidence,\" Gaius said dryly, \"I should say you will be too preoccupied to be doing much magic. Please go put on some trousers.\"</p>\n<p>\"What?\" Merlin said. \"Oh.\"</p>\n<p>He washed up a little and put some clothing back on, and then he gathered his courage and went to wait in Arthur's rooms. His heart was pounding. Obviously, telling Arthur was the only thing to do. And then—and then Arthur would—or he would—or else he might—well, at the very least, he would see how utterly impossible it was for Merlin to share his chambers, and then Merlin could find a spell to make all of this go away, and perhaps they could pretend none of it had ever happened.</p>\n<p>Merlin was sorry now that he hadn't worked this out back when they'd been in his own quarters. It—it would've been easier to tell Arthur there. His room was far up and away from the rest of the castle. No one could hear through the walls or anything, or out the windows. Merlin did close the window, and pull the curtains, just to be cautious. He paced in front of the fire for a while, and then he relaid the fire, even though really it was going just fine; and then he swept the floor, by hand, even though it didn't need sweeping, and then he tried sitting in a chair for a bit, but that was no use, so he was back to pacing again when Arthur finally swept back in.</p>\n<p>\"Where are your things?\" Arthur demanded, kicking the door shut, and already slinging his cloak over a chair.</p>\n<p>Merlin cleared his throat. \"I can't move in,\" he said, desperately. \"You don't <em>want</em> me to move in.\"</p>\n<p>Arthur groaned and let his head tip back as he unbuckled his vambraces. \"Listen, you idiot,\" he said, \"do you think I am <em>enjoying</em> the prospect of parading you before the court as my ideal? My father is probably going to think my brain was affected by the poison.\" He paused and said, reflectively, \"I suppose <em>that</em> would explain it.\"</p>\n<p>\"It wouldn't explain it for <em>me</em>,\" Merlin said.</p>\n<p>\"It's hardly a great mystery why <em>you</em> would fall all over me,\" Arthur said. \"Come here and get my mail off.\"</p>\n<p>\"I don't want this any more than you do!\" Merlin said.</p>\n<p>\"'Oh, Arthur,'\" Arthur mimicked, muffled, as Merlin pulled the mailshirt off over his head. \"'Please, Arthur, you're <em>so</em>—'\"</p>\n<p>\"D'you want <em>me</em> to start quoting, too?\" Merlin dumped the mail on the table.</p>\n<p>\"<em>I'm</em> not responsible. My brain has been affected,\" Arthur said smugly.</p>\n<p>\"Didn't take much, did it,\" Merlin sniped, folding his arms. Arthur glared at him. \"Your brain's not affected! There's nothing wrong with us except for—what's wrong with us. And I can fix that.\"</p>\n<p>\"You just finished telling me Gaius said there was no cure,\" Arthur said, \"so—\"</p>\n<p>\"There's no scientific cure,\" Merlin said, and gulped again. \"But there could be—I'm quite certain there's—that is, I haven't looked yet, but I can find—\" He stopped, took a deep breath, and said, \"—a spell.\"</p>\n<p>Arthur sighed and sat down in his chair and took off his boots. \"Merlin, go and get your things.\"</p>\n<p>\"You don't understand,\" Merlin said. \"Arthur, I'm a sorcerer.\"</p>\n<p>\"And I'm the Emperor of Rome,\" Arthur said.</p>\n<p>Merlin stared at him. \"I'm not joking!\"</p>\n<p>Arthur looked up at him exasperatedly. \"Very well, go ahead and do something magical.\"</p>\n<p>\"Er. What?\" Merlin said. He hadn't actually expected Arthur to make him <em>prove</em> his confession.</p>\n<p>Arthur stood up and approached him, waving a hand around the room. \"Come on, then. Show me your great and wondrous powers.\"</p>\n<p>Merlin looked around blankly. He'd already swept the room, twice; the fire was burning, the clothes were all put away; the armor needed cleaning, but he didn't have any of the brushes or oil up here for that. He didn't think Arthur would really appreciate a windstorm in his quarters, or Merlin setting the bed on fire. He could've summoned a light, but the room was bright, so that wouldn't look particularly impressive—</p>\n<p>Arthur rolled his eyes and shoved Merlin backwards onto the bed. He climbed on and kissed him. Merlin wound his arm automatically around Arthur's neck and kissed him back, his legs already falling apart to cradle Arthur's hips. \"I'm not—I'm <em>not</em> joking,\" he insisted, breathlessly, between kisses.</p>\n<p>\"Mhm,\" Arthur mumbled, against Merlin's jaw, blindly groping between them, trying to get Merlin's trousers unlaced.</p>\n<p>\"Look, <em>here</em>,\" Merlin said, in desperation, and stared down. Their lacings promptly undid themselves, tangling around Arthur's fingers.</p>\n<p>\"I don't believe your insolence,\" Arthur said, without even glancing down, and shoved the mess of lacings out of the way and took hold of Merlin's cock. \"Do you have any other demands you'd like to make?\"</p>\n<p>\"No, I just—I did that!\" Merlin said, incoherently, his hips thrusting up into Arthur's hand.</p>\n<p>\"You aren't doing anything!\" Arthur said. \"If you imagine that being my favorite means you now just get to lie there and moan at me uselessly—\"</p>\n<p>\"Aahgh!\" Merlin said wildly, and flipped them over.</p>\n<p>\"Better,\" Arthur murmured, still busy nuzzling at the crook of Merlin's neck. \"I didn't know you had it in you.\"</p>\n<p>Merlin jerked free and sat up over Arthur's hips. \"I have <em>magic</em> in me, you ass!\" he said, and then he pinned Arthur's wrists flat to the bed, and stripped all the clothes off him with a single hot-eyed glare.</p>\n<p>Arthur stared up at him, open-mouthed. \"There!\" Merlin said. \"D'you believe me now? Do I need to hold you down and—\" Arthur's cock jerked hard, skidding slickly against Merlin's thigh. Merlin paused and stared down at it. \"What are—are you—you <em>like</em>—\"</p>\n<p>\"Shut up!\" Arthur said in a strangled voice, and Merlin had one stunning, dazed, impossible moment where he imagined <em>everything</em> they could do together, and then he flung himself onto Arthur, body and magic both. Arthur writhed and bucked up into him, wildly, and Merlin was sucking on his mouth desperately, biting at Arthur's lip, both their cocks in his hand and Arthur's legs locked around his thighs while Merlin kept his wrists and shoulders pinned.</p>\n<p>Arthur strained up against the hold and couldn't break it; his head fell back and he groaned in a shocked, deep voice; said, \"Oh, <em>gods</em>, oh, Merlin, Merlin, <em>Merlin</em>, you absolute <em>idiot</em>,\" and came everywhere. Merlin whimpered helplessly and spent also, and collapsed limply over Arthur's chest.</p>\n<p>\"So it <em>is</em> a spell,\" Arthur said, after he caught his breath. \"I knew it. You've <em>ensorcelled</em> me.\" He tried to sound convinced, and also angry, which he was; he was very angry. It was just remarkable how difficult it was to be properly angry, right after you'd had a spectacular and not entirely physically possible climax, after three weeks of horrible deprivation. The four—five—times in Merlin's room had barely taken the edge off.</p>\n<p>\"Have not,\" Merlin mumbled groggily against his shoulder.</p>\n<p>\"You're an evil lying sorcerer,\" Arthur said. \"I can't trust a word you say.\"</p>\n<p>\"Yeah, better call the guard on me,\" Merlin said, without moving.</p>\n<p>Arthur was starting to get irritated at Merlin's utter lack of concern. Then he noticed he was petting Merlin's hair. He stopped at once. \"I'm going to! What sort of a lunatic are you, anyway? What possessed you to come <em>live</em> in Camelot?\"</p>\n<p>\"I dunno, my mum knew Gaius?\" Merlin said, proving he was a complete lackwit. \"'S my destiny, anyway.\"</p>\n<p>\"What <em>are</em> you blithering about?\" Arthur said.</p>\n<p>\"Protecting you,\" Merlin said. \"What my magic's for. Takes some bloody doing, too,\" he added, and he even had the gall to raise his head and give Arthur a blearily accusing look.</p>\n<p>Arthur glared at him outraged. \"<em>Protecting</em> me—\" Then he turned his head as a soft tap came on the door, and then one of the chambermaids came in with a bucket and mop. She froze and stared at them. Above him, Merlin made a small choked noise.</p>\n<p>\"Oh,\" she said. \"Forgive me, sire!\" she said, and curtseyed her way back out the door very fast.</p>\n<p>\"Stop her!\" Merlin squeaked out.</p>\n<p>\"And do what?\" Arthur said. \"Are you planning to turn her into a frog?\"</p>\n<p>\"What are you talking about? Just—tell her not to tell anyone!\" Merlin said.</p>\n<p>\"Yes, because <em>that's</em> likely to work,\" Arthur said.</p>\n<p>\"Half the castle's going to know by dinnertime!\" Merlin said.</p>\n<p>\"Don't be absurd,\" Arthur said. \"<em>All</em> the castle's going to know by dinnertime.\" He shoved Merlin off the bed. \"Now go and get your damned things.\"</p>\n<p>Merlin thumped over the edge flailing, then sat up and stared at Arthur over the side of the bed with a horrified expression. \"Did you <em>miss</em> the part where I'm a sorcerer? Aren't you even a <em>little</em> bit angry?\" Merlin said desperately. His hair was sticking up like a mink's pelt, and he looked as unhappy as a wet cat.</p>\n<p>\"I am extremely angry,\" Arthur said slowly, with vengeful satisfaction. \"And I intend to punish you extensively.\"</p>\n<p>Merlin swallowed visibly. \"Oh,\" he said.</p>\n<p>\"Yes, precisely,\" Arthur said. \"Go.\"</p>\n<p>Merlin went.</p>\n<p>It was an absolute nightmare. Merlin looked sadly around his tiny room, and packed up his small sack of clothes. He stuck the spellbook on top in a sort of last-ditch attempt, but Arthur just threw it aside onto the table and began to dump the whole satchel out on the bed.</p>\n<p>\"Unacceptable,\" Arthur said, tossing the first shirt on the bed. \"Unacceptable, also unacceptable, actually disgraceful, and—\" he paused, holding up Merlin's feast-day tunic, \"—hideously ugly. This is going to take some doing.\"</p>\n<p>\"What's wrong with them?\" Merlin said. \"You never minded my clothes before.\"</p>\n<p>\"You have appearances to maintain now,\" Arthur said horrifyingly, throwing Merlin's best pair of trousers on the bed after the rest.</p>\n<p>\"Can I go back to my room now, please?\" Merlin said faintly.</p>\n<p>\"No,\" Arthur said. He turned, looked Merlin up and down, and beckoned. \"Those, too.\"</p>\n<p>\"What?\" Merlin said, crossing his hands over his chest. \"I don't have anything else!\"</p>\n<p>\"Good,\" Arthur said. \"Otherwise this would take all day.\" He pulled Merlin in by the kerchief. That came off and went on the bed, too, followed by Merlin's tunic, shirt, second-best trousers, and finally Merlin himself, shoved face down onto the pile.</p>\n<p>\"No, don't get up,\" Arthur said, sliding a firm, possessive hand onto the back of Merlin's neck as he climbed on, pressing Merlin's legs apart.</p>\n<p>\"But what am I—oh—what am I supposed to wear if—<em>oh</em>,\" Merlin said, muffledly, and moaned into the pile of clothing as Arthur slowly pushed into him. \"Oh. <em>Arthur</em>—\"</p>\n<p>Arthur fucked him leisurely, using rather a lot of oil, stroking Merlin off ruthlessly twice in the process. Afterwards, he drew out, came all over Merlin's back, and rolled him over to kiss him. \"But,\" Merlin started to protest again, except he got distracted by Arthur kissing him some more, and didn't remember until after they'd spent the next half-hour rolling around.</p>\n<p>Arthur finally yawned and stretched and got off the bed. Merlin staggered off and stared down at the wreck of every piece of clothing he owned in the world. \"Look what you did!\" he said. \"D'you want me walking around naked or something?\"</p>\n<p>\"Hm, tempting,\" Arthur said, \"but a little advanced for the more conservative minds of the court, I expect.\" He went to his wardrobe and took out a shirt and a pair of trousers and tossed them onto Merlin's head. \"Put those on, have all those others thrown in the rag bag, and go summon the tailors.\"</p>\n<p>\"No!\" Merlin said, throwing Arthur's clothes on the floor. \"These are <em>my</em> clothes, I don't want others. I can still clean them—\"</p>\n<p>\"I don't care what you want,\" Arthur said, advancing on him with glittering eyes. \"You've been lying to me for a year.\"</p>\n<p>Merlin swallowed. \"Arthur,\" he said.</p>\n<p>\"Shut up,\" Arthur said. \"If you really are my loyal servant, you're going to follow my orders, and be quiet about it.\"</p>\n<p>Merlin opened his mouth to argue that he'd been lying for extremely good reasons, like not having his head cut off or being burned at the stake or getting run out of Camelot; also to point out any of which fates would have meant his not being around to keep saving Arthur's life; and for illustration he readied himself to list off the dozen times he'd saved Arthur's life, soul, and/or future kingdom, all the while shouting down any of Arthur's attempts to argue.</p>\n<p>Then he shut his mouth and went to get the tailors instead, because really, that seemed easier.</p>\n<p>He was reconsidering the wisdom of that decision after Arthur proceeded to deck him out in silk and leather, and wool so fine that it felt soft instead of scratchy, even brand-new. Arthur, sprawled back in his chair watching, even examined a rich bolt of velvet, the sort of thing Morgana might use to make a dress. Merlin gave him a sidelong anxious look while holding very still so the tailor wouldn't stick him with pins. Again.</p>\n<p>\"I don't need <em>three</em> shirts,\" Merlin tried.</p>\n<p>\"Certainly you do,\" Arthur said. \"Let's make it <em>four</em>, in fact. Unless you'd prefer robes?\" He held up a corner of the velvet. \"Ceremonial robes, floor length—\"</p>\n<p>\"Four shirts would be splendid,\" Merlin said quickly. \"Really just—um—magnificent.\"</p>\n<p>\"I thought so,\" Arthur said.</p>\n<p>It was amazingly satisfying to see Merlin looking elegant, well-groomed, and utterly miserable in his new clothing. Arthur basked in the reproachful look as he adjusted the collar of Merlin's tunic so it showed the fine linen of the shirt beneath. His fingers brushed Merlin's throat, and Merlin stopped looking quite so reproachful and began leaning towards him, but Arthur had steeled himself to meet temptation by wanking off three times just before Merlin had come back from errands to get dressed.</p>\n<p>\"No, don't even try,\" Arthur said, pushing Merlin firmly back. \"You're not getting out of dinner again.\"</p>\n<p>\"Arthur, I can't,\" Merlin whined pitifully.</p>\n<p>\"If you manage not to spill anything, I'll suck your cock when we get back,\" Arthur said, turning him around and shoving him at the door.</p>\n<p>\"You'll do that anyway!\" Merlin said, trying to balk.</p>\n<p>\"True,\" Arthur said. \"But if you <em>do</em> spill anything, I'll—buy you a present. A golden clasp, perhaps. It would look handsome with the cloak. I'll be sure to spend a good deal of time in the town looking for just the right thing—mention to all the tradesmen how <em>special</em> it has to be—\"</p>\n<p>\"You are an utter bastard,\" Merlin said, morosely.</p>\n<p>Arthur did have a bit of a swallowing moment when he beckoned the steward to have a chair put next to his, and Uther turned his head and raised a rather baffled eyebrow as Arthur shoved Merlin into it. His father had never had anything to say about any of Arthur's past liaisons, but then, Arthur had never set up a favorite before, much less one who'd previously spent almost as much time in the stocks as on his duties.</p>\n<p>Much <em>much</em> less one who was also a sorcerer, and Arthur was being very careful not to think about that, because it alternately made him want to strangle Merlin and hide him somewhere safe. He glared at Merlin, who had no business being magical, and was probably responsible for all of this in the first place, in some dark evil sorcerer sort of way. And who was holding his fork as if he meant to stab someone with it, but wasn't quite sure which end to aim.</p>\n<p>\"Like <em>this,</em> idiot,\" Arthur hissed.</p>\n<p>Merlin abandoned it instead. \"What's wrong with spoons!\" he hissed back. \"I like spoons! And my fingers are perfectly fine—\"</p>\n<p>\"If you want to eat like a barbarian,\" Arthur said, grabbing Merlin's hand and putting the fork back into it.</p>\n<p>\"Maybe I do!\" Merlin said, and tried to put the fork down again.</p>\n<p>Arthur had just put paid to that attempt, and then the servants began to bring around the platters of food; Merlin stared a bit round-eyed at the haunch of venison in sauce as it was set down between them, and then stared at his fork helplessly. Arthur rolled his eyes and cut a portion for him and put it on Merlin's trencher.</p>\n<p>Merlin glared at him, and Arthur belatedly realized what that would've looked like to the rest of the court—as though he'd been serving a noblewoman.</p>\n<p>He beamed at Merlin. Merlin glared even more.</p>\n<p>The rest of that week proved equally enjoyable. Merlin squalled protests over every bit of special treatment: the ones Arthur really did need to insist on, and the ones he made up just to enjoy Merlin's complaining. \"I'll catch a cold! and probably an ague! and then I'll die!\" Merlin said, clinging fiercely to a bedpost as Arthur tried to drag him over to the bath the servants had brought up just for Merlin, scattered with heaps of dried rose petals and lavender. \"I shared your bath just yesterday!\" Merlin added.</p>\n<p>\"Yes, but this one's <em>yours</em>,\" Arthur said, and suckled kisses onto Merlin's neck until his fingers loosened enough to be pried off.</p>\n<p>That did backfire to some extent, as Merlin turned in his arms halfway to the tub and slid his hands under Arthur's shirt, which had somehow come loose from his belt. Arthur opened his mouth to inform Merlin that this pathetic attempt at dodging his fate was not going to work, and then Merlin licked Arthur's teeth, which was a little silly and oughtn't have been at all exciting, and the upshot of the whole thing was that Arthur spent the rest of the day with his hair smelling like lavender.</p>\n<p>After three days of dining with the court, Merlin tried to sneak away to dinner in the servants' hall instead. Arthur had been watching for escape attempts, however, and knew perfectly well where Merlin was. Arthur skipped dinner in the hall himself, waited until the late bell had rung, and went downstairs just as the servants were starting their own meal. And just in time; he could see some of the stupider ones getting ready to start in on Merlin, likely thinking he'd been cast off already. Everyone got to their feet as Arthur swept in, except Merlin, who stared up at him open-mouthed in horror.</p>\n<p>\"Merlin, I <em>do</em> realize it's a large castle, but I would've thought you could find your way to the Great Hall. Now we'll have to eat in my chambers,\" Arthur said cheerfully, and collared him. He waved a lordly hand to the other servants and dragged Merlin upstairs, basking in the rising tirade about how unreasonable Arthur was for demanding his attendance all the time, and why couldn't Merlin have an ordinary dinner with ordinary people once in a while, instead of mad princes who wanted to make him eat with unnatural implements like forks, and how he was going to stick Arthur with one.</p>\n<p>\"—and I don't believe you did that in front of <em>everyone</em>,\" Merlin finished wrathfully, as Arthur pulled him back into his chambers, and then added, \"No! I don't want to! I don't even want to <em>look</em> at you!\" as Arthur shoved him onto the bed. However, Arthur's clothing was coming off by itself, so he gave the pathetically obvious lie all the credence it deserved.</p>\n<p>\"And I'm hungry,\" Merlin whinged, squirming on Arthur's fingers, \"oh, and, I, Arthur,\" and Arthur slid into him triumphantly, and dear <em>god</em> this was good, Merlin writhing beneath him and complaining at the same time, hips rising into Arthur's thrusts.</p>\n<p>\"Shut up,\" Arthur said, because that was the surest way to keep Merlin yammering on. \"I'll make someone bring us up food after, you impossible wretch; didn't you realize they'd think I'd done with you?\"</p>\n<p>\"I <em>wish</em>—I wish you <em>had</em> done with me,\" Merlin said, arching and scrabbling at Arthur's shoulders. \"I wouldn't <em>care</em> what they said—\"</p>\n<p>\"Idiot,\" Arthur said, deeply satisfied, and bent down to kiss him.</p>\n<p>Afterwards he rolled off and got out of bed to stick his head in the hallway and send a passing servant for food. \"There seemed to be several people lingering in the corridor,\" Arthur said, sprawling back on the bed and draping a leg comfortably over Merlin's limp body. \"I think they might have heard you begging and moaning.\"</p>\n<p>Merlin gave a small grumble into the pillows that might've been, \"Ass.\" Arthur smacked his rear as punishment. Merlin squirmed a little but didn't manage to move until the knock came on the door and Arthur called, \"Enter,\" at which point Merlin jerked up and windmilled frantically off the far side of the bed with a thump as the kitchen maid came in.</p>\n<p>\"Leave it there,\" Arthur said, smugly. \"Merlin will serve me.\"</p>\n<p>\"Yes, sire,\" she said, curtseying.</p>\n<p>\"You're a monster,\" Merlin said, getting up and trudging over to the table after she'd gone. He didn't let it stop him from diving in, though.</p>\n<p>\"Thank you, Arthur, for seeing to my every comfort and desire,\" Arthur said. \"I am deeply honored by your attentions and indeed humbly grateful mmprh—\" One of the pillows leaped up and tried to smother him. Arthur fought it off and got up, and he swatted Merlin across the back of the head with his shift before he pulled it on and sat down. \"Give me the roast duck.\"</p>\n<p>Merlin slid it over and poured them both wine. Arthur propped his legs up over Merlin's thighs and said, \"Where were you all afternoon? Did you really think that hiding was going to keep me from guessing what you were up to?\"</p>\n<p>\"Sorry, didn't realize how deeply committed you were to my endless torment,\" Merlin said. \"I was in the library, I wanted to be sure of avoiding you.\"</p>\n<p>Arthur snorted. \"You certainly chose well. What on earth did you do in the library for hours? I'm surprised Geoffrey didn't throw you out.\"</p>\n<p>\"Oh no,\" Merlin said, venomously. \"He was <em>really polite</em> to me. Recommended me some excellent books. He even let me <em>borrow</em> one.\"</p>\n<p>\"I can just see you, hunched over in some dusty corner like him when you get old,\" Arthur said. He stretched. \"We'll go hunting tomorrow morning; you need an antidote.\"</p>\n<p>\"Why is it I don't get to do any <em>useful</em> work anymore, but I can still be dragged hunting?\" Merlin said.</p>\n<p>\"I still let you manage my armor,\" Arthur said. \"And hunting is for sport and pleasure.\"</p>\n<p>\"<em>Your</em> pleasure, maybe,\" Merlin said sulkily. \"I'd as soon spend the day reading.\"</p>\n<p>\"I'm whose pleasure counts,\" Arthur said smugly, except in the morning it was dim and grey as January, and gusting cold rain; Merlin lifted his head from the pillows, looked out the window, and heaved a small pathetic sigh.</p>\n<p>Arthur rolled his eyes and shoved Merlin out of bed. \"Go fetch me some breakfast.\"</p>\n<p>Merlin actually obeyed an order at speed for once, and came back with fresh bread, stuffed eggs, sausages, smoked trout, apples, dried grapes, candied filberts, a fig pie, and also the book he'd absconded with from the library. He brought the tray over to the bed. \"I could read to you,\" he suggested, transparently planning to lure Arthur into an orgy of gluttony and sloth just so he could avoid a little bit of rain.</p>\n<p>Still, obedience deserved some reward, and actually the book was quite interesting, all about the Romans poisoning one another and having fantastic civil wars and conquests all over the place. And it <em>was</em> unseasonably cold, and the bed was warm, and they had a lazy round after they finished eating, and then somehow it was afternoon already, and Arthur had to get up for patrol.</p>\n<p>\"This is all your fault,\" Arthur informed Merlin, who yawned up at him unrepentantly out of the cozy nest of blankets and said, \"So I'll just stay here, shall I?\"</p>\n<p>Arthur spent all the long hours of patrol—and yes, it <em>was</em> cold and wet and ugly out—trying to come up with some sort of really unpleasant task that he could still assign Merlin now that mucking out the stables or scrubbing the latrines or sculling for the cooks were all right out. He hadn't succeeded by the time he got back, which left him in an irritable mood, except then he walked into his chambers and found mulled wine and a hot bath waiting, a clean woolen shift warming by the fire, dinner on the table, and Merlin, bright-eyed and well-rested.</p>\n<p>After Arthur had been taken out of his armor, thoroughly fucked—it was amazing how it unwound the muscles, really—and had bathed, eaten, been fucked a second time, and was lying sprawled in bed with his head pillowed on Merlin's thigh, he was feeling remarkably in charity with the world.</p>\n<p>\"I was just thinking, this afternoon,\" Merlin said, his fingers stroking pleasantly through Arthur's hair, \"you can't make me muck out the stables anymore.\"</p>\n<p>\"I'll think of <em>something</em>,\" Arthur muttered.</p>\n<p>\"I suppose this isn't <em>all</em> horrible,\" Merlin said contemplatively. \"Do you want me to read some more?\"</p>\n<p>\"Yes, all right,\" Arthur said.</p>\n<p>The sex wasn't getting any less spectacular, and Merlin had to admit sharing quarters helped—knowing he was going to have Arthur all that night did make it easier to put Arthur into his armor without having sex twice first. And there really was something to having a bedmate all winter. Merlin didn't even mind the overnight stag-hunting trips despite the snow and wet, not when it meant cuddling up to Arthur in woolen blankets and furs after, their breath streaming out white in the air between slow kisses, Arthur's hips rolling deliberate and inexorable against him.</p>\n<p>And leisure turned out to mean more time to study; the spells in the spellbook were bending into his hands one after another. They saved Arthur twice that winter, against yet more sorcerers trying to attack Camelot. Enemies were coming out of the woodwork, it seemed, and it occurred to Merlin perhaps they were beginning to realize that their chance was vanishing, or already gone—that Arthur was protected, and there would never be a vulnerable young king to make an easy target if they waited.</p>\n<p>Merlin bent grimly to work, after that, to close the window of opportunity even quicker; and stopped complaining when Arthur made him come out riding on patrol.</p>\n<p>\"All right, what's the trick,\" Arthur said suspiciously, after Merlin said, \"Yeah, okay,\" for the third time, and then went abruptly wide-eyed and indignant and yelled, \"I don't need a bloody nursemaid!\"</p>\n<p>That fight lasted an entire week. Merlin made it one full night back in his tiny room in Gaius's quarters—already taken back over with herbs and books and beakers—and after that by mutual agreement, he and Arthur settled for just having very <em>angry</em> sex, except angry sex turned out to be—well. About three days in, they were mostly pretending to still be angry just so they could keep having it. It made it more practical that Merlin could mend the broken furniture, afterwards.</p>\n<p>\"So you seem—happy?\" Gwen asked Merlin a little diffidently on Imbolc festival, at the end of winter.</p>\n<p>\"Of course I'm not happy,\" Merlin said, nursing resentment along with his cup of hot, spiced wine; he was hiding in an alcove from Arthur, who was probably going to try and make him <em>dance</em>. \"You and Morgana and Gaius are the only people of sense who actually talk to me anymore, and Arthur's an unreasonable ass.\"</p>\n<p>\"Oh,\" Gwen said, biting her lip. \"I'm sure if—Merlin, I'm sure Arthur wouldn't—<em>make</em> you—\"</p>\n<p>\"He did make me!\" Merlin said. \"You don't think this stuff was <em>my</em> idea.\" He plucked at the stupid new embroidered tunic he was wearing. \"He wouldn't let us just go on—doing it!\"</p>\n<p>Gwen eyed him a little sidelong. \"But—the—<em>doing</em> part. You don't mind—<em>that</em> part.\"</p>\n<p>\"No,\" Merlin said, gloomily. \"No, that part's brilliant. Oh, hell,\" he added, as Arthur turned the corner and spotted him and came for him inexorably. \"I'm still finishing my drink!\" Merlin protested.</p>\n<p>\"We can take care of that,\" Arthur said, took the cup out of his hands and drained it, and stuck it back on a ledge.</p>\n<p>\"I really am not good at dancing,\" Merlin said.</p>\n<p>\"You don't have to dance, Merlin,\" Arthur said.</p>\n<p>\"I don't?\" Merlin said, brightening.</p>\n<p>Arthur smiled, predatory. \"No. You can sit beside me and feed me sweetmeats instead. Do excuse us, Guinevere,\" he added, and dragged Merlin away to his horrible doom, which ended in disaster as the night wore on. The whole court was going half-mad with gaiety after the long winter, stumbling off into dark corners and some into not-quite-dark-enough corners. Merlin drank steadily, trying to ignore the really outrageous amounts of public snogging going on and also the way Arthur kept moaning elaborately with pleasure as he ate sweets out of Merlin's fingers.</p>\n<p>Finally, after Arthur <em>accidentally</em> licked Merlin's fingers one time too many, Merlin had a fit of drunken recklessness and also <em>accidentally</em> dropped a sweet between Arthur's legs. Where Merlin had to <em>accidentally</em> fumble around for it, at great length, and, well, they hadn't had sex before the feast—Merlin had stupidly, stupidly resisted, to punish Arthur for the tunic—and they ended up on the floor in two heartbeats, wrestling. The only reason they didn't start contributing to the public snogging was because Morgana flipped the tablecloth up and kicked Arthur in the side until he rolled them underneath it.</p>\n<p>Except then they were hidden away, in the dim, golden-filtered light under the linen cloth. It was so very warm and close, and Merlin didn't want to be wearing the wretched tunic to begin with, so taking it off seemed only sensible, and after that sliding his hands under Arthur's shirt, unbuckling Arthur's belt. Everywhere Merlin touched Arthur he left honey-sticky places that almost had to be licked, and he barely heard the music and the laughter of the court, distantly; it didn't matter anything next to Arthur's moaning, his hips rising restless and eager under Merlin's tongue—</p>\n<p>Staggering out from under the tablecloth with Arthur two hours later to find themselves disheveled and well-fucked in front of the king and half a dozen royal councillors, however, was a less than ideal conclusion to the evening. Arthur turned multiple shades of mortified and said, \"Sire,\" in a strangled voice, before hauling Merlin rapidly away.</p>\n<p>Merlin would've informed Arthur that it served him just right, if he hadn't been too busy curling up in terror himself. Uther hadn't so far seen it necessary to pay any attention to their relations, to Merlin's profound relief, but the king had frowned at <em>him</em> just now, plainly wondering <em>are you still here?</em> and as Merlin demonstrably was, the frown had deepened.</p>\n<p>\"He's going to have me executed,\" Merlin said, in mortal terror. \"Or banished. Or both!\"</p>\n<p>\"My father is not going to have you executed!\" Arthur said. \"Stop being hysterical, Merlin. My father doesn't even know you're alive; he'll have forgotten this by tomorrow.\"</p>\n<p>On the morrow, however, a page came at first light to summon Arthur to Uther's chambers. Arthur carefully made sure Merlin didn't overhear, because the last thing he needed was Merlin having a fit of panic—that tended to result in things like a dozen bandits being turned into trees or enemy sorcerers spontaneously bursting into flames.</p>\n<p>Anyway, Arthur knew this wasn't going to have anything to do with Merlin; it was going to be a lecture on behavior appropriate to the dignity of the crown. He could recite it nearly word for word along with his father at this point.</p>\n<p>\"You have kept this boy for five months now—\" wasn't, however, the way Uther usually started.</p>\n<p>Arthur blanched. \"We're <em>talking</em> about this?\"</p>\n<p>Uther gave him a hard look. \"Unless you are going to be dismissing him from your service imminently?\"</p>\n<p>Arthur swallowed. Merlin was lying in his bed right now, curled up under blankets; he was always drowsy and sweetly pliant the day after a feast—</p>\n<p>Uther nodded as if Arthur had actually said something in answer. \"Then you must begin to consider the consequences for the court. A king cannot lightly fix his favor in one person: in giving a man your ear, you give him power.\"</p>\n<p>\"It's not as though I'd ever actually <em>listen</em> to Merlin,\" Arthur said urgently. \"About anything whatsoever. At all.\"</p>\n<p>\"Is that so?\" Uther said. \"His good opinion matters nothing to you, then; and you think nothing of it if you find him disappointed, or unhappy, when you lie down with him?\"</p>\n<p>\"I'm usually the one <em>making</em> him unhappy,\" Arthur said.</p>\n<p>\"And Lord Cadebourne's precipitous departure from this court, last month, was of course none of your doing,\" Uther said.</p>\n<p>As far as Arthur was concerned, Cadebourne had deserved every moment of mortal terror. \"He insulted my dignity.\"</p>\n<p>\"He assumed the boy was an ordinary servant,\" Uther said. \"Given his dress at the time—\"</p>\n<p>\"What business did he have groping one of our servants, anyway!\" Arthur snapped.</p>\n<p>Uther stared at him as if Arthur had grown a second head, and Arthur realized in horror that his hands had clenched into fists.</p>\n<p>\"Er,\" Arthur said, desperately, and tried to make it look as though he'd just been putting his hands behind his back.</p>\n<p>Uther was frowning at him. \"Yes, I see how little you care,\" he said dryly. \"Have you considered what he might do, with such power as that represents?\"</p>\n<p>Arthur's recent concerns about Merlin and power were rather more direct, such as wondering whether Merlin might demolish significant portions of the castle in a temper. \"Not—as such, really,\" he said uncomfortably.</p>\n<p>\"I grant you,\" Uther said, \"that the boy has demonstrated unusual devotion to you; but courage and even loyalty are not the only virtues a king's favorite requires. Do you trust in his prudence?\"</p>\n<p>\"Good God, no,\" Arthur said.</p>\n<p>\"Then you must demonstrate as much to the court,\" Uther said, \"and make clear that while he has your affection, he does not have a hold on your judgment, and those who seek to use him so can expect only your anger.\"</p>\n<p>Arthur stared at him. \"You want me to—<em>say</em> something about this? To the court?\"</p>\n<p>Uther waved that off. \"Merely making an announcement will convince no one,\" he said. \"No; I will make arrangements.\"</p>\n<p>\"And—those would be—\" Arthur said, nervously.</p>\n<p>\"Back to your duties,\" Uther said firmly, which meant that this was going to be as much a test for Arthur as for Merlin.</p>\n<p>The nature of the test became clear two days later, when Merlin burst into the bedchamber livid with fury and began yelling about how it was all Arthur's fault for doing this to him, and Arthur gathered after several minutes that someone had tried to bribe Merlin to plead a case to him.</p>\n<p>\"Oh, god,\" Arthur said.</p>\n<p>\"He shoved a purse at me in the armory!\" Merlin yelled. \"He wanted me to ask you <em>while we were fucking!\"</em></p>\n<p>\"He didn't say that,\" Arthur said; he didn't believe Merlin for an instant.</p>\n<p>\"<em>In an</em> <em>opportune moment</em>, that was his suggestion,\" Merlin snarled. \"What do you think would work best? While I'm having you, maybe? Seems pretty <em>opportune</em>—\"</p>\n<p>\"Merlin, stop howling,\" Arthur said, turning red. \"I promise you unequivocally that if you ever ask me a favor while you're—\" he waved a hand, \"—I will refuse without discussion.\"</p>\n<p>\"Oh, yeah, because it's not like you ever say <em>anything, Merlin, please</em>,\" Merlin said, unfairly.</p>\n<p>\"Fine, then I won't <em>honor</em> it afterwards,\" Arthur said. \"Besides, you refused, so what's the harm done?\"</p>\n<p>That turned out to be an extremely bad question to ask. Arthur was actually grateful when another page appeared to summon him to attend his father again, as it allowed him to escape, although possibly from the frying pan to the fire.</p>\n<p>\"I could've told you he wouldn't do anything like that,\" Arthur said, feeling much put upon.</p>\n<p>\"And yet you questioned his prudence,\" Uther said.</p>\n<p>\"That's because he's an idiot, not because he's going to take bribes,\" Arthur said. \"He just spent an hour ranting at me about corruption, and how the common folk can't respect the law if they think bribery will influence the outcome of justice. He was coming up with some insane scheme to test the virtue of all the magistrates when I finally got away.\"</p>\n<p>Uther stared at him, for long enough that Arthur started to feel a bit anxious, and then Uther said almost warily, \"What <em>is</em> this boy to you?\" and he wasn't asking for the facile answer.</p>\n<p>\"He's—I—\" Arthur said, stuttering in panic. He was getting on extremely well not thinking about what Merlin was to him, and he had no desire to start now. He stopped.</p>\n<p>Uther said, \"I see,\" with a peculiar expression on his face, a little as though he'd eaten something unpleasant. After a moment, he said, \"What does he want from you?\"</p>\n<p>\"Er. Merlin?\" Arthur said, blankly. As far as he could tell, what Merlin wanted from him was ludicrous amounts of sex, his continued survival, and for him to stop buying Merlin things, and Arthur didn't see that Merlin had any right to complain about getting two out of three. Besides, what else was Arthur supposed to do with a chain of gold with sapphires? <em>He</em> certainly wasn't going to wear it.</p>\n<p>\"All men have ambition,\" Uther said. \"Even a servant, and when one ambition is realized, another will arise. If wealth is not his desire, what else? Has he kin, whose advancement he would promote? Will he ask you for title or estate, and stir jealousy among your lords?\" He raised a hand when Arthur would've spoken. \"No, I don't want you to tell me he doesn't want those things; I want you to find out what he <em>does</em> want.\"</p>\n<p>\"I'm not answering that,\" Merlin said warily. He could see where this was going—he'd say he wanted Arthur to stop giving him presents, and then Arthur would smirk and bring out something really awful—he was due to graduate to jewelry any day now—which Merlin would then be bullied into wearing to dinner.</p>\n<p>Besides, all he wanted aside from that was for Arthur to not get himself killed, which Merlin was having to manage mostly on his own anyway. Well, and ludicrous amounts of sex, but that was hardly at issue.</p>\n<p>\"It's not a bloody trick question!\" Arthur said. \"My father wants me to know what you want, so just tell me something—something convincing, unless you want to be <em>bribed</em> some more.\"</p>\n<p>\"Right, because that worked so bloody well for him last time,\" Merlin said, aggrieved. He still thought he had the right idea about testing the magistrates, too.</p>\n<p>\"He'll come up with something else if you don't give him an answer,\" Arthur said.</p>\n<p>\"Fine: what I want is to be laid twice a day,\" Merlin said. \"You can even make it <em>three</em> times.\"</p>\n<p>\"It can't be sex; sex is what <em>I</em> get out of it.\"</p>\n<p>\"Why can't it be what I get out of it, too?\" Merlin demanded.</p>\n<p>\"Because he won't believe it, you idiot,\" Arthur said. \"Either that or worse, he will believe it, and decide that it's beneath my dignity to be servicing you three times a day.\"</p>\n<p>\"So <em>you</em> come up with something!\" Merlin said. \"He's your—\" <em>lunatic</em>, he added silently, \"—father, I have no idea what he'll believe.\"</p>\n<p>\"Bloody hell,\" Arthur said. \"All right, how about—a title?\"</p>\n<p>\"You are <em>not</em> giving me a title,\" Merlin said in horror. \"I'll run away.\"</p>\n<p>\"You'd be back before suppertime,\" Arthur said. \"Come on—<em>Lord Merlin</em>, you must like the sound of it a little.\"</p>\n<p>\"No, I do not!\" Merlin said. \"I'll never be able to talk to Gwen again! You can't talk to someone when they're calling you <em>my lord</em> all the time.\"</p>\n<p>\"You've never had any difficulty leaving off my title,\" Arthur said.</p>\n<p>\"Yes, but Gwen won't leave off mine,\" Merlin said. \"She'd worry about the other servants thinking they could be disrespectful or something. <em>Arthur</em>—\" he pleaded desperately; he really couldn't—</p>\n<p>\"All right, all right, stop moaning,\" Arthur said. \"What about an estate?\"</p>\n<p>\"Um,\" Merlin said doubtfully. \"I suppose that could be all right. Would I have to—do anything with it?\"</p>\n<p>\"Of course you'd have to do something with it!\" Arthur said. \"You'd have to oversee the labor of the serfs, and ensure the crown's tax revenues, and adjudicate disputes among them, and maintain the roads and the water supply, and—never mind,\" he interrupted himself. \"I can't possibly inflict you on any estate.\"</p>\n<p>\"I didn't want one anyway,\" Merlin said sulkily; he was sure it didn't have to be as much trouble as Arthur was making out.</p>\n<p>\"What about,\" Arthur said, \"your mother! I could—send her gifts.\"</p>\n<p>\"Right, which she'll have to explain to all her friends is because her son is being shagged by the crown prince,\" Merlin said. \"No.\"</p>\n<p>\"She ought to be bragging about how you managed to <em>land</em> me,\" Arthur muttered, then turned to the wardrobe and—<em>brought out a box</em>. \"Look, <em>most</em> people appreciate—\"</p>\n<p>\"<em>No!</em>\" Merlin said, backing away. \"No—forget it! I want—I want <em>my own room!</em> Away from you!\"</p>\n<p>\"Which you'd spend no time in,\" Arthur said, opening the box. \"Besides, that's ridiculous, that's not an <em>ambition</em>.\"</p>\n<p>\"More use than an idiot title!\" Merlin said, fending him off. \"Like <em>prince!\" </em>Arthur tried to shove the chain over his head, and Merlin got a closer look at the pendant. \"Is that a—are those—<em>gems?\"</em></p>\n<p>\"Well,\" Arthur said, a little warily.</p>\n<p>Merlin's eyes narrowed and surged gold.</p>\n<p>\"Why thank you, Arthur,\" Merlin panted, a little while thereafter, \"I <em>do</em> like the present—very attractive—\"</p>\n<p>\"Damn you, <em>Mer</em>lin,\" Arthur slurred and writhed his hips, trying to get him in deeper, the chain wrapped three times around his wrists between them. \"Oh, bloody hell, yes—\"</p>\n<p>\"Goes—goes with—your—\" Merlin added, gulping air; Arthur's eyes were wide and glazed and impossibly blue.</p>\n<p>\"Shut—up,\" Arthur panted. \"I'm—I'm going to—make you wear it—every day.\"</p>\n<p>\"Then—I'll make you wear it—every <em>night</em>,\" Merlin said, and Arthur groaned and hooked his wrists over Merlin's head and pulled him down to kiss.</p>\n<p>The chain ended up draped over the headboard. Merlin warily kept half a sleepy eye on it as he slumped against Arthur's side. Arthur idly carded fingers through his hair. \"There must be something you really <em>do</em> want,\" he said, yawning. \"Look, what would you ask me for, if I were king right now?\"</p>\n<p>\"To take off the ban on magic, so I don't have to worry about getting stuck with swords while I'm trying to <em>save your idiot life</em>,\" Merlin said promptly.</p>\n<p>Arthur waved a hand before going back to petting Merlin's hair. \"Fine, the <em>next</em> thing you'd ask me for.\"</p>\n<p>\"Um,\" Merlin said, a bit blankly. He squirmed over to tuck his head more comfortably onto Arthur's shoulder. \"Well—what about—to bring Ealdor under Camelot's protection?\"</p>\n<p>\"Hm,\" Arthur said thoughtfully. \"That might work—getting me to start a war with Cendred, that's the sort of thing my father would find respectable.\"</p>\n<p>\"I don't want you to start a war!\" Merlin protested.</p>\n<p>\"Well, you idiot, how else would I be able to take over protecting one of <em>his</em> villages?\" Arthur said.</p>\n<p>\"It's not like he's paying any attention to it,\" Merlin said.</p>\n<p>\"He'd <em>start</em> if I sent some soldiers there,\" Arthur said.</p>\n<p>Merlin scowled up at the canopy, thinking angrily of his mother's bowed shoulders; the tired, worried faces when winter ran long. \"I think kings are a lot like children sometimes.\"</p>\n<p>\"Don't be an ass, Merlin,\" Arthur said. \"Ealdor's in poor territory—the land's just barely arable, and it's long and costly to travel through the foothills. Cendred only took it because of the strategic value of having a buffer on his eastern border, against Camelot invading.\"</p>\n<p>\"That doesn't mean he has a right to it when he hasn't any care for the people there,\" Merlin said.</p>\n<p>Arthur shrugged. \"I agree,\" he said. \"He'll still go to war over it.\"</p>\n<p>\"Fine, then,\" Merlin said. He sat up and twisted around to look down at Arthur. \"If he wants to be an ass over it, <em>let's</em> go to war.\"</p>\n<p>Arthur stared at him, and then he burst out laughing. \"I'd no idea you were so bloodthirsty,\" he began, amused, and it abruptly made Merlin want to throw something at him.</p>\n<p>\"Shut up!\" Merlin yelled, and Arthur stopped, comically, mouth open. \"D'you even know—d'you understand—it wasn't just Kanen. I never so much as saw a knight in my whole life until I came to Camelot, not even a guardsman. All Cendred ever sent was the tax collector, and he took his due just the same if we'd had a good harvest or a bad—if we were going to all go hungry that winter, he didn't care. One year, three babes died because their mums couldn't feed them, even though we all gave them what we could spare. Magic's not treason in his kingdom, d'you wonder why my mum sent me here, instead? If that—if Cendred will fight just so he can go on treating his people like that, worse than you'd treat your dogs, he <em>deserves</em> a war. He deserves to be overthrown.\"</p>\n<p>He stopped, panting, glaring at Arthur, who'd lost the amusement entirely and was looking troubled instead. He sat up against the headboard. \"Merlin, most kings are like that,\" he said. \"If you don't get enough revenue from the land, you can't maintain your reserves and your army—\"</p>\n<p>\"<em>Camelot</em> manages it,\" Merlin said. \"That place in the fens, Marshwen, we stopped in once—you forgave them the tax, and you let them take toll off the road for keeping it in order—\"</p>\n<p>\"And my father shouted at me for it,\" Arthur said. \"It was irresponsible—I had to reverse it for the next year.\"</p>\n<p>\"You didn't reverse it all the way, did you?\" Merlin said coolly.</p>\n<p>Arthur flushed a little. \"I—found some other revenue,\" he said uncomfortably.</p>\n<p>\"You sent two of your horses as a gift to Lord Madsen, so you wouldn't have the cost of their upkeep anymore, and shifted the money from your own household funds,\" Merlin said.</p>\n<p>\"Fine,\" Arthur snapped. \"So what?\"</p>\n<p>\"So I don't care what other kings are like,\" Merlin said. \"<em>You're</em> not like that. And <em>you</em> are my king.\"</p>\n<p>Then he stopped, and the skin over his cheekbones went hot and uncomfortable, because he hadn't meant it to come out sounding quite like—that; and Arthur was frowning hard at the coverlet with his hands gripping the edge, turning very red.</p>\n<p>Merlin was feeling quite a desperate urge to do something extremely stupid, which he was valiantly resisting, but then Arthur cleared his throat and said, waveringly, \"Well—\" and Merlin broke and leaned in and kissed him.</p>\n<p>Arthur cupped Merlin's face in both his hands and kissed him back, slow and deliberate, just once. \"And you are mine,\" Arthur said, hoarsely, and Merlin swallowed and nodded. \"My favorite,\" Arthur added, quirking his mouth, and stroked his thumb down Merlin's cheek.</p>\n<p>\"You needn't rub it in,\" Merlin muttered, and curled deeper into his arms.</p>\n<p>\n<br>\n</p>\n<p>Epilogue</p>\n<p> </p>\n<p>Uther stared at the pile of maps and scribbled-on parchment notes.</p>\n<p>\"Well,\" Arthur said. \"We might have—got a bit—carried away.\"</p>\n<p>Uther picked up one of the chess pieces. There were also some old tin soldiers and bits of charred wood being used for markers. For being makeshift, it was nevertheless a clear plan of campaign. He'd worked up something similar with his council, once, when they'd had to consider the possibility of war with Powys and Mercia together. This—Uther shifted aside a few pages to examine what Arthur had done about the border with Essex; clever—this one looked—better. He wondered where Arthur thought he was getting this many men, however—</p>\n<p>\"Er, well,\" Arthur said.</p>\n<p>\"Armed serfs are as much a risk to you and your lords as to your enemies,\" Uther said.</p>\n<p>\"Not if they know my victory ensures them and their children just and merciful treatment,\" Arthur said, \"and that the victory of my enemies means their degradation.\"</p>\n<p>Uther frowned down at the maps. He remembered a crowd of peasants quietly standing in the castle courtyard, burning candles they could ill afford to hold vigil for their prince. Arthur might not be wrong.</p>\n<p>\"And <em>this</em> is what he wants,\" he said.</p>\n<p>\"I do have to point out, he was perfectly content before you insisted on my asking,\" Arthur said rather defensively. \"I'm sure he wouldn't <em>press</em> me for it—\"</p>\n<p>Except he would: ridiculous as it seemed, what this boy wanted was no less than a High King; and for love, Arthur would become one.</p>\n<p>\"Very well,\" Uther said. \"You had better keep him after all.\"</p>\n<p>= End =</p>"
}