{
  "id": "4093351",
  "url": "https://archiveofourown.org/works/4093351?view_full_work=true",
  "author": [
    "wherehopelies"
  ],
  "title": "You Still Make Sense to Me (Your Mess is Mine)",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/F"
  ],
  "fandoms": [
    "Pitch Perfect (Movies)"
  ],
  "relationships": [
    "Chloe/Beca Mitchell"
  ],
  "characters": [
    "Chloe (Pitch Perfect)",
    "Beca Mitchell",
    "Jesse Swanson",
    "Emily Junk",
    "Benji Applebaum",
    "Aubrey Posen"
  ],
  "additional_tags": [
    "Fake/Pretend Relationship",
    "Roommates",
    "Famous Beca"
  ],
  "language": "English",
  "series": "",
  "published": "2015-06-07",
  "completed": null,
  "words": "31,416",
  "chapters": "1/1",
  "comments": "242",
  "kudos": "6,185",
  "bookmarks": "1,243",
  "hits": "116,934",
  "summary": "<p>\"Chloe fills up all of the spaces inside her that she didn’t even know existed until Chloe was there.\"</p>\n<p>orrrrr the one where it takes a fake-engagement and being domestic as hell for these two idiots to realize they're in love. Set two years after PP2 and mostly canon compliant. Title taken from Vance Joy's \"Mess is Mine\"</p>",
  "notes": "<p>Hey all! When I started writing this it was supposed to be a short 10k one-shot, then I blinked and it was 31k... so... hopefully the timing and the spacing is all good. This is my first Bechloe fic and today is my birthday so BE NICE! :)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Hit me uppp on tumblarrrr at emilyjunk if you're down to hear lots of screaming about Bechloe and other gay ships</p>",
  "text": "<p>Chloe Beale has always been the pride and joy of her parents.</p>\n<p>An only child, she was well-loved and doted on.  They’d attended every one of her dance recitals, her parent teacher conferences, and sat first row when she was in a production of Hairspray in high school.</p>\n<p>They’re her number one fans.</p>\n<p>So it comes as a bit of a surprise to her when one day they sit her down at dinner and tell her she needs to move out. They do it gently and with loving smiles, but still.</p>\n<p>“Chloe,” her father says. “It’s time you move on.”</p>\n<p>Chloe pouts (she’s totally not too old to pout) and turns to her mother. “What do you mean?”</p>\n<p>Her mom tries to smile encouragingly. “Honey, you know we’ve always supported you. Your father and I were happy to pay for you to attend three extra years of school to ensure you got your degree. And we’ve loved that you’ve been living with us for the past two years, but…” She trails off and her father clears his throat.</p>\n<p>“It’s time you do some things on your own, Chloe.” He pats her hand gently, his soft blue eyes crinkling at her. She feels a lump form in her throat. She’s always been a daddy’s-girl.</p>\n<p>She nods bravely. She <em>is</em> twenty-seven. She really should get out of her parents’ house.</p>\n<p>“We’re happy to help you get on your feet, sweetie,” her mom says brightly.</p>\n<p>Chloe nods again, thinking about how her life has felt slightly unfulfilling since she graduated and left the Bellas. Maybe she needs a change…</p>\n<p>And that’s how Chloe Beale, Southern Belle(a), ends up moving to the bright and bold city of Los Angeles, California.</p>\n<p>//</p>\n<p>\n<em>“You… what?”</em>\n</p>\n<p>“I’m moving to L.A.” Chloe presses the phone between her cheek and shoulder as she continues to fold her clothes.</p>\n<p>There’s the gentle sound of Beca breathing on the other end of the line. Chloe waits for her to process and starts stacking her clothes into her suitcase.</p>\n<p>“<em>You’re moving… here</em>?” Beca says eventually and Chloe grins outwardly. Beca really hasn’t changed much.</p>\n<p>“Mhmmm,” she hums into the phone. “Which is why I was calling you. Because I was wondering if you knew anybody who might need a roommate down there? I mean, I have enough cash to get a hotel room for a couple of days, but eventually I’m going to need to – ”</p>\n<p>“<em>You’re staying with me</em>,” Beca interrupts.</p>\n<p>Chloe pauses, repressing a smile. “Really? It’ll just be until I find my own place, Bec, I swear.”</p>\n<p>“<em>I have an extra room</em>,” Beca says. Chloe hears her sigh. “<em>I mean like. We can be roommates. Or whatever</em>.”</p>\n<p>“That would be…” Chloe searches for the feeling that’s filling her up at the thought of living with Beca again. “Aca-awesome.”</p>\n<p>Beca snorts. “<em>That’s not allowed if you move in.”</em></p>\n<p>Chloe grins and zips up her suitcase. “Oh you love it.”</p>\n<p>\n<em>“No I don’t.”</em>\n</p>\n<p>“Don’t pretend, Becs. I know you do.”</p>\n<p><em>“I changed my mind</em>,” Beca says, but Chloe can hear the amusement in her voice. “<em>You can’t move in.</em>”</p>\n<p>Chloe rolls her eyes fondly. “See you in a few days.”</p>\n<p>And that’s how Chloe Beale ends up living with Beca Mitchell.</p>\n<p>//</p>\n<p>When Beca moved to L.A. two years ago, she’d anticipated that it’d be a long road to achieving her dreams. She’d expected to have to work hard, kiss some ass, probably get some dick-wad producer lots of coffee, and eventually she’d climb the ladder and make <em>music</em>.</p>\n<p>Turns out, she barely had to do that at all.</p>\n<p>Sammy sent her and Emily’s demo around and when she graduated, she’d received a job offer at their branch in L.A. Sammy spent a good twenty minutes lecturing Dax on the benefits of mutual interests or some shit when she told him.</p>\n<p>It’d been a little slow going at first, but after just a handful of months, she’d produced an EP. After a year, she had a single on the radio and a hefty amount of cash in her checking account.</p>\n<p>She bought a nice condo by the beach, one with space for a small recording studio and a guest bedroom in case someone came to visit, like Emily or Fat Amy or Jesse.</p>\n<p>He’d moved here with her after graduating, but they were both busy, her with her EP and him with trying to wiggle his way into the world of cinematic scoring and Hollywood. Turns out three years together wasn’t enough to withstand that, or maybe it would’ve been, but they slowly began to settle into a platonic rhythm until they practically weren’t even dating anymore.</p>\n<p>And then they just… weren’t.</p>\n<p>He’s still her best friend, but she’d quickly learned that Los Angeles is a lonely place. It’s full of people willing to fuck you over to get what they want, people who can’t afford to trust you in case you sell them out, people who are busy at weird hours and always seem to be out of town.</p>\n<p>She’s never been one to need that many friends, but after having a solid family in the Bellas for four years, it would’ve been nice to have some.</p>\n<p>When Chloe called her one Tuesday afternoon, Beca kind of thought it was an emergency. Like Aubrey was in the hospital or Chloe’s vocal nodes were back (could that even happen?). Sure, she’d talked to Chloe a few times over the past two years, exchanging texts here and there. Chloe had FaceTimed her, screaming loudly, when she’d heard Beca’s song on the radio when she was driving. Chloe even called a couple of times, when she and Jesse broke up and when Chloe had gotten a job substitute teaching.</p>\n<p>So yeah, they talked sometimes, but not as often as they probably should have, and when Chloe said she was moving to L.A., it took Beca a second to process.</p>\n<p>Then Chloe was saying something about a roommate and well, Beca <em>does</em> have that extra room.</p>\n<p>“We can be roommates. Or whatever.”</p>\n<p>She could practically hear Chloe’s smile through the phone. <em>“That would be aca-awesome</em>.”</p>\n<p>Beca rolled her eyes, but couldn’t help but grin.</p>\n<p>And really, that was the beginning.</p>\n<p>//</p>\n<p>Beca looks practically the same, as far as Chloe can tell. Maybe her jeans are slightly nicer and her headphones more expensive, but she answers the door with the same raised eyebrow that she used to when Chloe came knocking at her dorm her freshman year.</p>\n<p>“Look who it is,” Beca says with a smirk.</p>\n<p>Chloe can’t help the excited scream that comes out of her mouth as she launches herself at her friend. Beca doesn’t stiffen at the hug like she used to, accustomed to Chloe’s tendency for physical contact. She just squeezes back with a laugh.</p>\n<p>“Hey Chlo.”</p>\n<p>“Hey Becs.” Chloe pulls back, keeping the other girl within reach. “Look at you!” Beca just shrugs nonchalantly. “And look at this place. Holy crap, Beca, you didn’t tell me you were a millionaire.”</p>\n<p>Beca rolls her eyes in perfect Beca-fashion. “Shut up, I’m not.”</p>\n<p>Chloe winks. “Sure.”</p>\n<p>“I’m not, I just…” Beca huffs at Chloe’s playful face. “You know what, never mind. Just come in.”</p>\n<p>Beca grabs her suitcase and drags it into the house and Chloe tries not to giggle because the suitcase is almost as big as Beca. She follows Beca onto the hardwood floor of the house, trying to take everything in about her new home.</p>\n<p>It’s not too big, a good size for just Beca, and it’s modern and well-decorated and warm. Chloe already feels at home.</p>\n<p>“Your room is this way,” Beca says, rolling Chloe’s suitcase behind her. Chloe follows, head peeking into one of the rooms on the way down the hall. She smiles when she sees Beca’s recording equipment set up, her laptop sitting on the desk, one of her many mixing programs open on the screen.</p>\n<p>“So yeah, this is your room,” Beca says when she stops at the room next to the studio. “And like, feel free to decorate or change it around or whatever.” Beca motions to the dressers and the bed. “I just got this stuff in case people visit or something.”</p>\n<p>Chloe tilts her head to the side. “Do you have lots of visitors?”</p>\n<p>Beca shrugs. “Not really. Emily comes in the summer and on her breaks sometimes and we record together. Fat Amy came once, too.”</p>\n<p>“Hmmm,” Chloe hums, looking around the room. “Well, it’s nice.” It is nice, if not plain. She could easily give it some flavor and it’d be perfect.</p>\n<p>“Cool.” Beca nods, crossing her arms over her chest. “So, uh. I can show you the rest of the place, or you can get settled and we can get some food or whatever you want to do.”</p>\n<p>“Maybe I’ll just unpack and then we could get dinner. We can catch up,” Chloe says with a grin.</p>\n<p>“Sounds good.” Beca points behind her awkwardly. Seriously, she hasn’t changed at all. “I’m just gonna be in there working, so holler when you’re ready.”</p>\n<p>Beca quirks her lips in another smile before leaving her to unpack. She didn’t bring much, just her entire closet and a few sentimental things like a picture of her and Aubrey freshman year and some stuff from her bedroom at home.</p>\n<p>It doesn’t take her long to finish unpacking. She stores her suitcase under the bed and heads down the hall to find Beca. She pokes her head into the room she passed on the way to her bedroom and sees Beca sitting in front of her laptop, headphones on and fingers moving delicately over the track pad of her laptop.</p>\n<p>Chloe leans against the door frame for a second, watching. Beca nods her head to whatever track she’s listening to, humming quietly. Her hair is twisted over one shoulder, slightly longer than Chloe’s ever seen it and perhaps a shade lighter from the sun.</p>\n<p>As Chloe watches, Beca seems to finish whatever she’s doing because saves and closes her laptop, unplugging her headphones and pulling them down around her neck. She stands up and turns around, and Chloe is about to say something, but Beca sees her before she can.</p>\n<p>“DUDE!”</p>\n<p>Beca jumps, her hand coming up over her chest.</p>\n<p>“Sorry! Sorry!” Chloe laughs sheepishly.</p>\n<p>Beca stares at her, eyes wide. She lowers her hands and is suddenly… laughing.</p>\n<p>Chloe tilts her head to the side, grinning. “What?”</p>\n<p>Beca just shakes her head, grabbing at her side. Chloe waits for her to stop laughing, which she does after what feels like a century.</p>\n<p>“Sorry,” Beca says, gulping air into her lungs as her laughter dies down. “That just reminded me of…” She trails off, stomach shaking with laughter again.</p>\n<p>Chloe raises her eyebrows, but then suddenly she gets it. She beams. “How high does your belt go?”</p>\n<p>Beca snorts through a laugh, her hand coming up to pinch her nose. “I still can’t believe you did that.”</p>\n<p>Chloe shrugs. “I knew you could sing, you dirty liar.”</p>\n<p>“Whatever.” Beca rolls her eyes. “You’re still a creepy stalker.”</p>\n<p>Chloe gasps playfully. “I’m not creepy!”</p>\n<p>“But you admit you’re a stalker?” Beca raises an eyebrow.</p>\n<p>“Maybe…” Chloe grins again. “You love it.”</p>\n<p>“Uh huh…” Beca thins her lips, trying not to smile.</p>\n<p>Chloe just shakes her head fondly, putting an arm around her friend. “Come on, my tiny, dorky friend. Let’s get dinner.”</p>\n<p>“I’m not a dork,” Beca grumbles, but she lets Chloe lead her to the car.</p>\n<p>As they drive to get dinner, windows down, both of them belting to top 40 hits on the radio, Chloe feels like the past two years apart had barely even happened.</p>\n<p>//</p>\n<p>They settle into a rhythm. Chloe manages to get a job at a private high school teaching choir. She likes it enough, but the kids get on her nerves sometimes. </p>\n<p>Still, it’s different from what she was doing back home and L.A. makes her feel alive in ways that only singing for an audience used to. She loves the sun and the beach and listening to Beca’s music as they drive in her convertible with the top down.</p>\n<p>(“What the hell, Bec, since when did you get a convertible?”</p>\n<p>“Whatever,” Beca scoffed. “It’s L.A. Everyone has a convertible.”)</p>\n<p>And even more so, she loves living with Beca. It’s different than when she lived in the Bella House, half of which she roomed with Aubrey, the other three years of which she roomed with Stacie while Beca shared the upstairs loft with Amy.</p>\n<p>Beca’s currently working on a new album with some DJ//singer Chloe’s never heard of before (apparently he’s ‘the next big thing’ according to Beca) and she works mostly from home.</p>\n<p>Sometimes, Chloe comes home from teaching in the afternoon to find Beca shut in her studio, headphones clamped over her ears, back hunched over her laptop. More often than not, though, Beca is in the kitchen cooking when Chloe walks through the door, music mixing with the smells of whatever’s steaming on the stove.</p>\n<p>Today is one of those days. Beca’s singing to some Jessie J while she fusses over a pan when Chloe gets home.</p>\n<p>“Hey,” Chloe says, setting her keys down.</p>\n<p>“’Sup?” Beca glances at her with a small smile before turning her attention back to the stove.</p>\n<p>“What are you making?” Chloe sits down at the island, watching as Beca rolls up the sleeves of her purple flannel and reaches down to open the oven door.</p>\n<p>Beca grabs a towel and pulls a pan out of the oven. “Chicken. And vegetables. I made those peppers you like.”</p>\n<p>Chloe hums in approval. “Yay, you’re the best.”</p>\n<p>“Yeah,” Beca says, taking the pan of vegetables off the stove. “I was thinking we could eat and watch a movie or something. I finished the last track of the album so I don’t really have to do much tomorrow while I wait for feedback from Marcus and I got us some wine and – ”</p>\n<p>“Whoa, whoa, whoa!” Chloe raises her eyebrows incredulously. “First, you finished the album? And second, you hate movies.”</p>\n<p>Beca shrugs. “Well, yeah, but you don’t.”</p>\n<p>Chloe tilts her head to the side with a smile. “You finished the album?”</p>\n<p>“Yeah,” Beca averts her eyes, turning back to pull two plates out of the cupboard. “I mean, it still has to go through review and I’m sure it’ll need to be tweaked a lot, knowing Marcus anyway.”</p>\n<p>Chloe softens. Beca is so cute when she’s trying to pretend things aren’t a big deal. She’s reminded of when she found out Beca even made music, way back when, and how Beca had tried to convince Aubrey that they needed to change their sound, throwing her talent out there so casually like it was nothing. She remembers how Aubrey had stormed away, the Bellas following close behind, but Chloe had leaned closer, asking Beca if she could listen. Beca had just shrugged, handing Chloe her headphones, nonchalantly sitting there while Chloe’s mind was blown.</p>\n<p>“Congratulations, Beca,” Chloe says, feeling the way pride fills her chest, swelling in her ribcage.</p>\n<p>“It’s, you know, whatever, like I said,” Beca murmurs, standing on her tiptoes to reach for the wine glasses. She’s just a little too short to reach. “It’s not like, one hundred percent done, so.”</p>\n<p>Chloe rolls her eyes fondly, getting up and moving around the island. She moves next to Beca, reaching up to get the wine glasses with a small smirk. Beca looks over at her as their arms brush.</p>\n<p>“Still,” Chloe says, setting the glasses down on the island. “You’re right, we should celebrate.”</p>\n<p>Beca nods. “With wine.”</p>\n<p>Chloe giggles. “Obviously.”</p>\n<p>Beca grins and starts piling food on the plates. Chloe opens a bottle of wine, pouring it in their glasses. They head over to the couch, setting the plates and glasses on the coffee table. Chloe sits on the floor between the couch and the table and Beca follows her, reaching for the remote.</p>\n<p>“Do you even own any movies?” Chloe asks, voice teasing.</p>\n<p>Beca rolls her eyes. “Excuse you, I own On Demand.”</p>\n<p>“So that’s a no.” Chloe grins.</p>\n<p>Beca scoffs. “I was going to let you pick the movie, but you can forget that now.”</p>\n<p>Chloe raises her eyebrows, leaning over to snatch the remote from Beca’s hands. “Snooze ya lose.” She turns the TV on, scrolling through the movie channels.</p>\n<p>Beca shakes her head, hiding her smile in her glass. “Just don’t pick something lame.”</p>\n<p>Chloe grins. “No promises.”</p>\n<p>//</p>\n<p>They’re halfway through the movie and their second bottle of wine. They’d migrated to the couch about twenty minutes into the movie and now their empty plates sit on the coffee table. Chloe has her head in Beca’s lap and Beca taps the fingers of one of her hands on Chloe’s collarbones to the music playing in the movie. Chloe plays with Beca’s other hand, twisting her ring around and around.</p>\n<p>“So this is kind of weird, isn’t it?” Beca says over the movie.</p>\n<p>Chloe snaps her eyes up to Beca’s face. “What is?”</p>\n<p>“We’re like, old.” Beca scrunches her face up, clearly displeased by the thought.</p>\n<p>Chloe grins, wine-drunk and content. “We’re not that old. And whatever, you’re what, twenty-four? That’s not old, Becs.”</p>\n<p>Beca just smirks, tapping at Chloe’s forehead with her free hand. “Okay, but we’re like domestic and shit.” She smiles, barking out a short laugh. “We’re like, married.”</p>\n<p>“Married?” Chloe wonders if maybe Beca is drunker than she thought.</p>\n<p>“Yeah. Like you go to work and come home and I make you dinner and then we cuddle up on the couch with our wine and watch movies.” Beca laughs again and Chloe feels her body shake with it. “We’re fucking married.”</p>\n<p>Chloe giggles. “If you liked it then you should’ve put a ring on it,” she says, slipping the ring off Beca’s finger and sliding it over her own.</p>\n<p>Beca snorts. “Or at least made it Facebook official.”</p>\n<p>Chloe grins. “There’s still time.” She grabs Beca’s phone off the coffee table.</p>\n<p>“Hey!” Beca reaches for the phone. “No!”</p>\n<p>She sits up, moving away from Beca, the wine making her cheeks flush warmly. “Make me!”</p>\n<p>“Chloe!” Beca whines, playfully kicking at Chloe with her foot. Chloe just sticks out her tongue, pulling up Facebook on Beca’s phone. “Oh, really mature. I take it back, you’re actually five.”</p>\n<p>Chloe’s body shakes with laughter and Beca is giggling (she must be drunk, Chloe thinks, because Beca <em>does not</em> giggle), but has stopped reaching for her phone. Chloe navigates through the pages and a few clicks later, she’s finished. She feels her own phone buzz with a notification and she pulls it out of her pocket.</p>\n<p>She accepts the relationship change easily and then it’s done.</p>\n<p>“There!” She grins at Beca. “We’re officially engaged, Ms. Mitchell.”</p>\n<p>“If you didn’t Instagram and Tweet it, though, did it really happen?” Beca asks sarcastically.</p>\n<p>Chloe’s eyes widen. “You’re so right.”</p>\n<p>“No, I’m kidding, Chlo. Chloe!” Beca tries to hide her face, but Chloe has already leaned up against her and snapped a picture. Chloe’s grinning at the camera, but Beca is laughing down at her and it’s actually probably the cutest picture they’ve ever taken. Which isn’t that surprising. Beca always pretends to be grumpy when Chloe wants to take selfies.</p>\n<p>“This is cute,” Chloe says, quickly choosing a filter and uploading it on Instagram. She links it to Twitter and hands Beca her phone back. “<em>Now</em> it’s official.”</p>\n<p>Beca rolls her eyes. “Oh my God, you’re so dumb.” Then she grins again. “Whatever, maybe our friends will send us engagement gifts. Then we can get that espresso machine.” Her eyes glaze over at the thought.</p>\n<p>Chloe snorts. “Okay, you just work on getting me my ring.” She wiggles her hand in the air.</p>\n<p>“I’ll look into it,” Beca nods, taking on a faux air of seriousness. They both erupt into laughter, grinning at each other. Chloe can’t remember feeling this happy in a really long time, maybe since graduation.</p>\n<p>She lays her head back down on Beca’s lap, pressing a smile into Beca’s legs.</p>\n<p>In seconds, Beca’s fingers return to tapping at her forehead, and Chloe brings her attention back to the movie on the screen.</p>\n<p>She doesn’t remember the end of the movie, just the tapping of Beca’s fingers easing her into a contented sleep.</p>\n<p>//</p>\n<p align=\"center\">\n<strong>LIFE EVENT</strong>\n</p>\n<p align=\"center\">\n<strong>BECA MITCHELL got engaged to CHLOE BEALE</strong>\n</p>\n<p align=\"center\">\n<strong>October 5, 2018</strong>\n</p>\n<p>Emily Junk, Stacie Conrad, Benji Applebaum and 97 others like this</p>\n<p><strong>Fat Amy</strong> it’s about time took u guys longer than a wallaby waiting to skinny dip to get on that train wow</p>\n<p><strong>Stacie Conrad </strong>omg you guys!!! :) congratulations! I call dibs on throwing the bachelorette party ;)</p>\n<p><strong>Jesse Swanson </strong>wait what</p>\n<p><strong>Cynthia-Rose Adams </strong>Congrats guys. Imma send you a toaster ASAP</p>\n<p><strong>Aubrey Posen</strong> Chloe Beale call me right now</p>\n<p>//</p>\n<p>Beca wakes to the buzzing of her phone on her nightstand. She flings her arm out, feeling around for it blindly. She hates mornings. And she <em>really</em> hates whoever is calling her at… She squints her eyes open.</p>\n<p>7:43 AM.</p>\n<p>She groans, just as the buzzing stops.</p>\n<p>Thank God.</p>\n<p>She settles back into her pillow, rolling over slightly and bumping into Chloe.</p>\n<p>Chloe?</p>\n<p>Before she can process that, her doorbell rings. She squeezes her eyes shut, hoping the person will go away. It seems like they will. There’s a minute of silence. Then –</p>\n<p>The doorbell rings again. And again. And again and again and –</p>\n<p>“OKAY!” Beca yells. “What the fuck?”</p>\n<p>She swings her feet out of bed and pads down the hallway in her tank top and pajama pants.</p>\n<p>“Dude,” she says as she opens the door. “What the – ”</p>\n<p>“Explain yourself!” Suddenly there’s a finger under her nose.</p>\n<p>Beca zeroes in on the finger, brain taking forever to process, heavy and slow in the way that only comes from a night of drinking wine.</p>\n<p>“Uhh.” She looks up with a scowl. “Lindsey, what the fuck?”</p>\n<p>The woman, only slightly taller than Beca, pushes her raven-black hair behind her ears and scowls right back, an action Beca has become very familiar with in the year that she’s know the woman. “Yes, Beca. What the fuck is right.”</p>\n<p>Beca crosses her arms, jutting her chin out defiantly. “I don’t know what you’re talking about, but I’m 99 percent sure it could’ve waited until at least noon.”</p>\n<p>Lindsey, in all her combat-boot and skinny-jeaned glory, ignores that and pushes her way past Beca and into the house.</p>\n<p>“Excuse you,” Beca says, rolling her eyes and closing the door as she follows the woman into the house and down the hall. They get to the kitchen and Lindsey immediately starts brewing a pot of coffee like she shows up at Beca’s house at ungodly hours of the morning all the time.</p>\n<p>Which, just to be clear, she doesn’t.</p>\n<p>“Beca?” Chloe wanders into the kitchen in that moment, all bed-head and sleep-wrinkled t-shirt. “Who was at the door?” She asks through a yawn, causing Lindsey to whip around.</p>\n<p>“Aha!” She points her accusatory finger at Chloe. “You!”</p>\n<p>Chloe just slumps on a stool, leaning her head on her hand sleepily. “Are you making coffee? Can you pour me some?”</p>\n<p>Lindsey’s face twists in confused incredulity and Beca stifles a grin behind another scowl. Just-woken-up Chloe is one of her favorite things, but she’s a little too pissed at Lindsey right now to fully appreciate it.</p>\n<p>“Umm, hello?” Beca gestures at Lindsey. “You still haven’t explained why you’re here?”</p>\n<p>Lindsey just stares at Chloe, completely disregarding Beca. Which like, wow. Rude. “Figures. Ginger,” she mutters and Chloe quirks her eyebrows. “Well, you did have that thing for Ed Sheeran.”</p>\n<p>“Lindsey.” Beca scowls.</p>\n<p>“Ed Sheeran?” Chloe says, still completely unfazed by the woman in their kitchen. “What about Ed Sheeran?”</p>\n<p>“Nothing,” Lindsey says as the coffee pot beeps. She pulls down a few mugs. “Just that Beca clearly has a thing for gingers.”</p>\n<p>Beca grits her teeth. “Okay no. You know what! Everybody loves Ed Sheeran!”</p>\n<p>Chloe nods amicably. “Very true.”</p>\n<p>Lindsey sets a full mug of coffee in front of each of them. Tendrils of steam rise from the mugs and Beca watches as Chloe blows at hers gently.</p>\n<p>“So,” Lindsey says, a touch of condescension coloring her tone. “When were you going to tell me about this?”</p>\n<p>Beca throws her arms in the air. “Dude! Tell you about what?”</p>\n<p>Lindsey waves her finger between Beca and Chloe. “About the two of you? You know, that you’re dating? And I don’t know… engaged?!” Lindsey’s voice lilts hysterically. “I am your <em>publicist</em>! You are supposed to clear these things with me!”</p>\n<p>Beca’s jaw drops. Oh shit.</p>\n<p>“You have a publicist?” Chloe nods, impressed.</p>\n<p>Beca sighs. “This is Lindsey. Lindsey, Chloe.”</p>\n<p>“You mean Instagram user <em>gingrspiceandevrythingnice</em>?” Lindsey glares at Beca, unamused.</p>\n<p>Chloe grins in a way that Beca can only associate with springtime sun, bright and welcoming. “That’s me!”</p>\n<p>“Great.” Lindsey’s tone suggests it’s anything but. “So maybe the two of you can explain this post.” She makes a big show of whipping out her phone and clearing her throat. “<em>BecaMitchell</em>: <em>Liked it, so I put a ring on it @gingrspiceandevrythingnice #engaged</em>. Accompanied by <em>this</em> picture,” Lindsey turns the phone around so they can see, “and tweeted to your 18,372 Twitter followers!”</p>\n<p>Beca glances at the picture on the screen, clearly from last night. It’s cute, she thinks vaguely, as Lindsey shoves her phone back in her pocket. “That was a joke,” she murmurs. Chloe wraps her hands around her warm mug, uncharacteristically demure.</p>\n<p>“A joke?!” Lindsey seems on her way to an aneurysm.</p>\n<p>“Uh, yeah, dude.” Beca shrugs. “Calm down.”</p>\n<p>Lindsey spins around as if she can’t bear the thought of looking at them any longer, her jacket almost hitting Beca in the face. Beca rolls her eyes. Drama queen. And that’s saying something. She lived in the same house as Stacie Conrad for three years.</p>\n<p>“Okay,” Beca says, trying to regain control of the morning. “Sorry, we made a mistake.”</p>\n<p>“My bad,” Chloe whispers, her eyebrows knitting together.</p>\n<p>Beca shrugs. “Lindsey, it’s fine. I’ll just tweet that it was a joke.”</p>\n<p>Lindsey shakes her head, fingers coming to rub at her temple. “Beca, honestly.” Her voice is strained. “It’s not that easy.”</p>\n<p>Beca raises an eyebrow. “Why not? Sure it is.”</p>\n<p>“Beca, you have an image now – ”</p>\n<p>“Oh god.” Beca pretends to gag. “Don’t rope me into that bullshit. I’m hardly even famous.”</p>\n<p>Lindsey turns on her. “While that may be true, you have already decided to be open about your sexuality, Beca, and now there are young girls out there whose dreams seem to be coming true as they see someone like them being proudly out and engaged. Someone successful in a field where women aren’t that prominent! Especially LGBT women! And now you’re just going to tell them that ‘it was just a joke’?”</p>\n<p>“Wait.” Chloe speaks up. “Open about what sexuality?”</p>\n<p>Beca thins her lips as Lindsey waves her off nonchalantly. “Beca’s bisexuality, of course.”</p>\n<p>Chloe’s eyes snap to hers. “What? Since when?”</p>\n<p>Beca averts her eyes. This is perhaps the most mortifying morning of her life. Or top three at the very least. “It was that German woman,” Beca mutters, embarrassed.</p>\n<p>Chloe’s mouth drops open, appalled. “From Das Sound Machine?!”</p>\n<p>Beca gestures wildly again. “She was physically flawless!”</p>\n<p>“Oh my God!”</p>\n<p>“And if it wasn’t her, well you <em>did</em> force me to sing a duet with you while we were in the shower! Naked!” Beca crosses her arms. Chloe snaps her mouth shut.</p>\n<p>Lindsey looks between the two of them. “I thought you weren’t dating?”</p>\n<p>“We’re not,” Beca grumbles.</p>\n<p>“Then why…” Lindsey shakes her head. “You know what? Never mind.”</p>\n<p>Beca huffs. “Okay, so what do we do?”</p>\n<p>“Well,” Lindsey drawls. “I mean it’s up to you, of course. If you want to say it’s a joke, go ahead. But obviously I don’t recommend that – ”</p>\n<p>“Lindsey,” Beca snaps. “What are the other options?”</p>\n<p>Lindsey taps her finger on her chin. “Well, the standard procedure in this case would be to release a statement about the engagement. Keep the charade up for a few months – ”</p>\n<p>“A few months?!” Beca practically yelps.</p>\n<p>Lindsey glares at her and continues. “Then we would release a new statement at an opportune time, stating that the relationship didn’t work out and the breakup was mutual.”</p>\n<p>Beca frowns, suddenly feeling like she’s way in over her head. She leans against the island, thinking.</p>\n<p>“What does ‘keeping the charade up’ entail?” Chloe asks. Beca feels her eyes on her, but she’s operating in some kind of daze now.</p>\n<p>“Well,” Lindsey says, finally sipping at her coffee. Beca’s remains untouched. “First, we put out a small statement. Beca’s not nearly in the public eye enough for any articles or anything, so that shouldn’t be an issue. Perhaps a few public outings. If Beca has to attend any events, it would be pretty standard of you to tag along, keep up appearances and all that jazz.”</p>\n<p>Chloe hums thoughtfully. “Just a few months?”</p>\n<p>“Yes, probably two or three.” Lindsey nods. “It’s really barely any time at all. Obviously, you’d have to abstain from other relationships, and the hardest part would be keeping it from your friends, of course, but the time will be over before you know it.”</p>\n<p>“Wait, we can’t tell our friends?”</p>\n<p>Beca almost smiles at Chloe’s puppy-dog pout, but she’s heard the mantra enough, and Lindsey wastes no time repeating it. “Can’t trust anyone in this business.”</p>\n<p>Chloe frowns. “And what if Beca just says it was a joke?”</p>\n<p>“Well besides coming off as an asshole,” Beca snorts, but Lindsey ignores her, “she could receive fan backlash and the label might put her on probation from recording until it all blows over. The record she’s working on with Marcus Sentry could see delayed release dates.” Lindsey shrugs as if to say that’s the least of it.</p>\n<p>There’s silence for a minute, Lindsey nonchalantly sipping her coffee, Chloe staring at Beca, Beca staring into space.</p>\n<p>“Becs.” Chloe leans closer, placing her hand on top of Beca’s. Beca pulls away and Chloe frowns. “It’s up to you of course. Whatever you want to do.”</p>\n<p>Beca just sighs. She doesn’t care that much about coming off like an asshole (okay, maybe she cares a little, but like, not <em>that</em> much), but they’re so close to being done with the album and they worked so hard on it…</p>\n<p>Her dreams are right there. She’s so close.</p>\n<p>She meets Chloe’s eyes, the blueness in them pulling her in, familiar and warm. “So I guess we’re engaged, huh?”</p>\n<p>Chloe’s lips pull up in a small smile. “Only if you want to be.”</p>\n<p>Beca turns to Lindsey. “Fine. Only for a few months.”</p>\n<p>Lindsey nods, reaching into the bag she brought with her for her laptop. “So, I’m just going to have to get some background information on this deal and then I’ll write up the statement.”</p>\n<p>They sit at the island for another two hours, hashing out the imaginary details of their relationship, although Beca admits most of them are true. They met at college, they sang in the Bellas, Chloe moved here, they got engaged. The rest is history. Literally.</p>\n<p>When Lindsey finally leaves, Beca disappears into her studio for the rest of the day, hoping to bring the roaring headache in her brain down to a dull roar.</p>\n<p>She really did not expect her Saturday to go like this.</p>\n<p>//</p>\n<p>Things are awkward between them for a few days.</p>\n<p>Not awkward in the sense where either of them is mad, but Chloe senses Beca feels overwhelmed and wants to be alone. Which Chloe understands. Sort of. Not for her personally, but for Beca anyway.</p>\n<p>Lindsey, the publicist (which like, Beca has a publicist? WTF?), informs them that the label encourages them to keep up their façade at least until after the album drops, which is scheduled for the first week of November.</p>\n<p>Apparently Marcus is in love with it, or that’s what Beca tells Chloe a few days after they Get Engaged. Chloe’s not surprised. Who isn’t in love with Beca’s music?</p>\n<p>(The way Lindsey talks about Beca’s small but loyal fanbase and the heads at the label, Chloe’s starting to wonder who isn’t in love with <em>Beca </em>herself, really.)</p>\n<p>So it’s a week of awkward dinners where Chloe talks about their boring school-approved set-list for her school’s woman’s fall choir concert and where Beca kinda just nods in a very Beca-fashion and mumbles things here and there about Lindsey being a dumb ass.</p>\n<p>Chloe is resilient and well-versed in waiting out Beca’s moods, but after so many years of Beca being open with her (at least more open than she is with other people) it makes Chloe sad and kind of wears her down.</p>\n<p>While they sit on the couch in their PJs and eat Chinese take-out and watch Netflix, Chloe doesn’t think the distance between them has ever been so massive.</p>\n<p>And that’s not just because Beca is sitting way over on the other end of the couch.</p>\n<p>Chloe knows that Beca hates games and she hates being fake and that no amount of butting heads will get her to change who she is. One agonizing year of constant Aubrey-Beca bickering taught her as much. So she totally gets why Beca’s in a mood.</p>\n<p>She just doesn’t know how to fix it and it’s making her totally sad.</p>\n<p>“Butt-chin is totally gonna get chopped,” Beca says from the other end of the couch. Honestly, Chloe never thought their couch was that big until now.</p>\n<p>“No, Blondie is.” Chloe shakes her head at the disgusting excuse for crème brulee on the screen.</p>\n<p>Beca snorts. “Butt-chin fucked up vegetables. How do you fuck up vegetables?”</p>\n<p>“Bet you an eggroll it’s Blondie.”</p>\n<p>Beca scoffs. “Deal.”</p>\n<p>They watch the clock run down in silence, Chloe picking at her Chinese food, wondering how they got to this awkward place. She can feel herself pouting into her sesame chicken during the commercial break, but she doesn’t even care.</p>\n<p>“Hey,” Beca says, turning down the volume of the TV as some insurance commercial comes on. “Do you like… have plans or whatever this Saturday?”</p>\n<p>Chloe’s eyes slip over to Beca, watching as the other girl pokes at her lo mein with her chopsticks and avoids Chloe’s gaze.</p>\n<p>“No, not really.” She was thinking of attending a spin class, but that’s hardly having plans. She chews on the inside of her lip, watching Beca.</p>\n<p>“You want to go to the beach or something?” Beca glances at her quickly before shooting her eyes away.</p>\n<p>“Okay,” Chloe says cautiously. Which is weird because she’s never really been a cautious person, but sometimes Beca has a way of making her not say the things she might say to anyone else.</p>\n<p>Beca nods. “Cool.” She quirks her lips in a small smile and turns the volume of the TV up just as the show comes back on.</p>\n<p>Chloe’s stomach buzzes, like there are bees inside of it instead of butterflies, riled up and anxious. She doesn’t have time to think about it though because a minute later, Blondie gets chopped and Beca swears loudly.</p>\n<p>“Pass me your eggroll,” Chloe says gloatingly. She always wins.</p>\n<p>“This show is fucking rigged.” Beca scowls. “You’ve seen it before.”</p>\n<p>Chloe shakes her head, grinning. “No, I haven’t.”</p>\n<p>Beca leans over to pass her the eggroll, grumbling to herself about Chloe being a cheater, but when she settles back against the other end of the couch, her feet land in Chloe’s lap and her lips are twisting in the way that means she’s holding back a smile.</p>\n<p>Chloe grins and bites into her new delicious prize, the buzzing in her stomach settling.</p>\n<p>//</p>\n<p>Things slowly return back to normal over the next couple of weeks. Chloe’s mom has trouble grasping that the engagement isn’t real, but she’s working on it.</p>\n<p>Besides, it turns out that they don’t actually really have to <em>do</em> anything because nobody gives a shit that Beca is engaged except for her tiny fanbase.</p>\n<p>That being said, Chloe gains like 500 Instagram followers which is weird, but Beca’s fans seem really nice, if not a little enthusiastic.</p>\n<p>Still, they go back to being just Beca-and-Chloe and Chloe breathes easier as November 2<sup>nd</sup> gets closer and closer with every passing day.</p>\n<p>//</p>\n<p>The album drops with greater success than Beca imagined.</p>\n<p>She guesses she shouldn’t have been surprised. Marcus has the voice of an old-time crooner and it fits with her beats in ways she never thought would have been possible. Plus, he’s apparently a heartthrob, but it’s not like she’s noticed.</p>\n<p>Sure, she guesses he’s got these fantastic brown eyes and really great hair, but it doesn’t faze her much. She’s fake-engaged to Chloe Beale. She’s accustomed to seeing beautiful eyes and great hair on the daily, and if she’s being honest, way closer-up than she sees Marcus Sentry’s.</p>\n<p>Still, the fans go crazy over him. It’s enough to make her gag.</p>\n<p>Beca can’t say she minds, though. Not when she comes home to find Chloe jumping around the living room as the album bumps through Beca’s high-quality sound system, an expensive bottle of celebratory champagne in the kitchen, and the possibility of finally achieving her dreams sitting just at her fingertips.</p>\n<p>//</p>\n<p>Chloe can pinpoint the exact moment that Beca’s career blows up.</p>\n<p>She’s driving home from work, absentmindedly thinking about her classes, and humming along to the radio. It’s L.A., so she’s been stuck in traffic for at least twenty minutes now on the same stretch of highway, but she doesn’t mind that much because it’s Friday and it’s warm out and Beca had hinted at breakfast for dinner.</p>\n<p>The song on the radio fades into a new one, and after just a few seconds, Chloe gasps. She’s heard Beca’s songs on the radio before, back when she first released her EP, but there’s something about knowing how hard Beca slaved over this track firsthand that makes it feel extra special.</p>\n<p>She grins, singing along to the sultry sound of Marcus’ voice, head bopping to the underlying beat that Beca created. She feels so happy she could scream, and she practically does, whooping a little as the song ends and the DJs come back on the air.</p>\n<p>\n<em>“This is Kyle and Booster and you’re listening to RLA. How about that hot track from Marcus Sentry and Beca Mitchell?”</em>\n</p>\n<p>Chloe grins. “Yeah, how about it,” she says to herself.</p>\n<p>\n<em>“Those are some fresh beats, Kyle, and it seems like we’re not the only ones who are noticing.”</em>\n</p>\n<p>\n<em>“No doubt, Boost. Rolling Stone Online published their Top 30 Up-and-Coming Artists yesterday, and we were definitely not surprised to see those two on the list.”</em>\n</p>\n<p>Chloe almost slams on the breaks. She would have. Except she’s practically already at a stop. Damn traffic.</p>\n<p>\n<em>“Check out their new album On the Rocks, just out last week, it’s got a great sound. You’re listening to RLA’s Kyle and Booster. We’ll be back after these short messages.”</em>\n</p>\n<p>The radio cuts to a commercial and Chloe kind of just gapes in shock for a few moments. She <em>has</em> to tell Beca. Like, now.</p>\n<p>DAMN TRAFFIC.</p>\n<p>//</p>\n<p>Not only is Beca on Rolling Stone Online’s Top 30 Up-and-Coming Artists, but she’s third.</p>\n<p>Marcus is second and the number one spot goes to some YouTube sensation (Beca really hopes he’s not the next Justin Bieber). But still. She’s third.</p>\n<p> She doesn’t really know what it all means.</p>\n<p>//</p>\n<p>She finds out what it means three days later.</p>\n<p>Lindsey conference calls her with some higher ups at the label, starts talking her ear off about the new Wachowski movie and Beca’s not really paying attention that much because, yeah, she still isn’t really that into movies.</p>\n<p>But then they’re saying something about the Wachowskis being obsessed with her and scoring and a soundtrack and Beca’s mind does this short-circuiting thing that she’s pretty sure makes her eyes bulge.</p>\n<p>“They want <em>me</em> to score their movie?” Beca forgets how to breathe for a second. “But I’ve never scored a movie before. Dude. What?”</p>\n<p>“It doesn’t matter, Beca,” intones Robert, some head dude Beca usually lets Lindsey deal with. “They think your sound is perfect for the movie. Think about it.” They hang up soon after, leaving Beca completely flummoxed and under pressure to make a decision.</p>\n<p>She thinks about it for a really long time before she calls them back.</p>\n<p>“Okay,” she says. “I’ll do it, but only if I can collaborate with someone. I get to pick.”</p>\n<p>They get back to her an hour later. “Bring whoever you want. Assemble a team if you need to. They want you, Beca. Don’t pass this up.”</p>\n<p>//</p>\n<p>“New York, Newwww Yoooooorrrkkkk!”</p>\n<p>“Oh my God, please stop.” Beca swats Jesse’s arm. She’s kind of regretting the decision to bring him into this deal. He’s drawing attention to them. In the airport. She scowls.</p>\n<p>“Come on, Becs!” He spins around. “We’re in New York. We’re working on a movie. The Wachowski movie.”</p>\n<p>Beca rolls her eyes. “I still don’t really know what that means.”</p>\n<p>Jesse looks scandalized. “They did <em>X-Men</em>. And <em>V for Vendetta</em>.”</p>\n<p>Beca just shrugs. “Haven’t seen them.”</p>\n<p>“<em>Jupiter Ascending?</em>”</p>\n<p>Beca shakes her head.</p>\n<p>“How did we even date for three years?” Jesse groans. “Can you at least pretend to be excited about this?”</p>\n<p>“No.” Beca grabs his arm, leading him to the guy in a suit holding a sign that says her name on it. At least the service is good.</p>\n<p>They’re just there for a meeting with the Wachowskis. To talk about their vision or whatever. They fly home again tomorrow to start working on the music.</p>\n<p>She hates this part of the music industry (or movie industry now, she guesses). The talking, the schmoozing, the socializing, the <em>vision</em>.</p>\n<p>She just wants to make music.</p>\n<p>But still, Jesse’s excited, and she guesses she can’t fault him that. It is kind of a big deal.</p>\n<p>She’s trying not to think about that part.</p>\n<p>//</p>\n<p>The meeting goes well enough. Beca admits it’s pretty exciting as she feels herself getting swept up in the possibilities ahead of them. The movie, some sci-fi flick featuring a half-lioness girl from a different planet, seems really fucking weird, but Beca sees <em>the vision</em> (ugh) and she’s suddenly completely on board.</p>\n<p>Still, the meeting lasts all day, and she’s getting really tired of Jesse smiling at the Wachowskis like he’s on shrooms or something. It’s overwhelming and she just wants to be back home on the couch in her sweats, Chloe’s head in her lap and shitty TV on in the background.</p>\n<p>Beca calls her the second she’s back in her hotel room, away from Jesse and the never-ending rush of the city.</p>\n<p>Chloe answers after the second ring. <em>“Hello?”</em></p>\n<p>“Hey,” Beca says, voice going soft as she sinks down into her bed. “It’s me.”</p>\n<p>Chloe giggles. <em>“I know, Becs. I have caller ID.”</em></p>\n<p>Beca rolls her eyes. “Right.”</p>\n<p>Chloe hums into the phone and Beca wonders what she’s doing. <em>“How was the meeting?”</em></p>\n<p>“It was good actually,” Beca admits. “The Wachowskis are really fucking weird, though. And Jesse wouldn’t stop grinning like one of these creepy circus clowns the whole time.”</p>\n<p><em>“I hate those clowns.”</em> Chloe scoffs and Beca smiles a little.</p>\n<p>“Me, too. What are you doing?”</p>\n<p>Chloe sighs. <em>“Waiting for my pizza to get here. It’s been like forty-five minutes. I’m starving.”</em></p>\n<p>Beca suppresses a smile. “No cooking, then?”</p>\n<p><em>“I tried, but let’s just say it’s a good thing I’m marrying a halfway decent chef.”</em> Beca can feel Chloe’s grin through the phone. <em>“I burned grilled cheese.”</em></p>\n<p>“That’s just tragic.”</p>\n<p><em>“Ugh, I know.”</em> Chloe clears her throat. <em>“Are you okay, Becs?”</em></p>\n<p>Beca crinkles her nose. “Yeah, why?”</p>\n<p><em>“You just sound… I don’t know.”</em> Chloe hums thoughtfully. <em>“Un-Beca-ey.”</em></p>\n<p>“It was just a really long day, I guess.” Beca frowns. “You know I suck at being social. But at least the Wachowskis were as awkward as me.”</p>\n<p><em>“Not as cute though, I’m sure.”</em> Chloe giggles again.</p>\n<p>Beca’s chest feels light. “Cuter, actually.”</p>\n<p><em>“I doubt it,”</em> Chloe says. <em>“So what are you going to do now?”</em></p>\n<p>Beca shrugs, glancing at the clock. “Jesse and I are going to go out and get a drink or two, I guess.”</p>\n<p>\n<em>“Soon?” </em>\n</p>\n<p>“Uh.” Beca bites her lip. “I was supposed to meet him five minutes ago.”</p>\n<p><em>“Beca!”</em> Chloe laughs. <em>“You’re the worst.”</em></p>\n<p>“I wanted to talk to you,” Beca whines. Then she snaps her mouth shut. Did that come out as needy as it sounded?</p>\n<p>There’s a beat of silence. Beca can hear Chloe breathing on the other end of the line.</p>\n<p><em>“Yeah,”</em> Chloe says after a moment. <em>“Me, too.”</em></p>\n<p>Beca exhales in… something. Relief maybe. “I should probably go now.”</p>\n<p>\n<em>“Okay. I’ll see you tomorrow when your flight gets in.”</em>\n</p>\n<p>“You’re still picking us up right?”</p>\n<p>Chloe laughs. <em>“Duh.”</em></p>\n<p>“Cool.” Beca nods. “Alright then, bye.”</p>\n<p>\n<em>“Love you, Becs.” </em>\n</p>\n<p>Beca grins. “You too. Bye.”</p>\n<p>She hangs up and decides not to change. Jesse is going to complain enough about how late she is.</p>\n<p>Like she needs any more lip from him.</p>\n<p>//</p>\n<p>“So what’s the deal with you and Chloe?” Jesse shouts and Beca leans in to hear him.</p>\n<p>They went to some fancy bar that the concierge recommended where the drinks are too expensive and the conversation around them too loud. There’s not even any good music playing.</p>\n<p>Beca is not impressed.</p>\n<p>“Uh.” She stalls, swirling the liquid in her glass around a little. “What do you mean?”</p>\n<p>Jesse raises his eyebrows at her. “Why didn’t you tell me you guys were together?”</p>\n<p>Beca bites her lip, trying to think of an answer. He’s right. If she would’ve told anyone, it would’ve been him. She doesn’t know how to say that there was actually nothing to tell.</p>\n<p>“It was all just really fast, I guess,” is what she comes up with, but it sounds weak and she knows it. He’s already asked where her ring is and she told him it was “getting sized” and she can’t believe he hasn’t figured it out yet.</p>\n<p>Jesse just nods and puts his arm around her all big-brother like, which would be weird and she should hate it, but it’s Jesse, so somehow it’s not and she doesn’t. “Well, you know I love Chloe.” He tilts his head to the side. “I’m not that surprised, really. You are guys are good together.”</p>\n<p>She glances at him. “Uh. Thanks, I guess.”</p>\n<p>“I mean, I guess I kind of always had a feeling there was something between you guys!” He grins, nodding like this make sense.</p>\n<p>Which it obviously <em>does not</em>.</p>\n<p>“Really?” This is quickly becoming the weirdest conversation she’s ever had. It doesn’t help that they’re practically shouting at each other to be heard.</p>\n<p>“Yeah, dude.” Jesse pulls his arm away and faces her, looking at her with an expression that screams <em>obviously, Beca, god</em>. “Do you know how many times you ditched me to hang out with her in college?”</p>\n<p>Beca quirks an eyebrow, imagining her confusion spilling on the table and giving it all away. “Well, that was for Bellas stuff.”</p>\n<p>“No way, it was all the time.” Jesse shakes his head like an overgrown puppy dog, adamant that you play with him. “And remember when you got that internship and you wouldn’t tell her.”</p>\n<p>“She was dealing with stuff,” Beca defends. “Like <em>graduating</em>. I didn’t want to stress her out.”</p>\n<p>“You mean make her mad at you?” Jesse shoots her this condescending look that she hates. “Dude, she didn’t graduate for three extra years. I’m sure she could’ve handled it by then.”</p>\n<p>Beca rolls her eyes, feeling irrational anger beat at the back of her throat. “She didn’t want to leave the Bellas.”</p>\n<p>“And <em>you,</em> Becs.” Jesse taps her forehead with his knuckles and she leans away, scoffing. “She didn’t want to leave you.”</p>\n<p>Beca grimaces. This conversation is dumb. Jesse is <em>dumb</em>. She downs the rest of her drink, feeling it settle with the growing sense of discomfort somewhere at the bottom of her stomach.</p>\n<p>She should tell Jesse to shut up. She should tell him that he doesn’t know what he’s talking about.</p>\n<p>“Whatever,” she says instead. “I’m getting another drink.”</p>\n<p>“Just think about it!” He calls as she walks back toward the bar.</p>\n<p>She pretends she doesn’t hear him.</p>\n<p>//</p>\n<p>Chloe shrieks happily when she sees them, getting out of her car in the pick-up lane at LAX to meet them.</p>\n<p>She pulls Beca into a giant hug and Beca sinks into it for a second, but then she remembers her and Jesse’s dumb conversation and pulls back. Chloe shoots her a look for a second, quick and fleeting, but then moves to hug Jesse. He picks her up and swings her around and Beca can’t help but smile.</p>\n<p>They’re nerds. Goofy, happy, dumb nerds.</p>\n<p>But they’re her nerds. And she really loves them.</p>\n<p>//</p>\n<p>“So,” Chloe says when they’re alone, having dropped Jesse off at his apartment. “I was thinking that we should get a dog.”</p>\n<p>Beca chokes purely on air. “What?”</p>\n<p>“A <em>dog</em>, Becs.” Chloe glances at her before bringing her eyes back to the road. “Relax, babe, I said a dog, not a snake.”</p>\n<p>“We already have a dog. We have Jesse. Actually he’s <em>worse</em> than a dog.”</p>\n<p>“Clever.” Chloe grins slightly. “But seriously, can we please get a dog?”</p>\n<p>Beca leans against the door of the car so she can look at Chloe better. “But they’re so much work. Why do you want a dog?”</p>\n<p>“Because.” Chloe bites her lip, keeping her eyes on the road. “It was so boring with you gone. I was all alone. I thought I was going to <em>die</em>.”</p>\n<p>Beca rolls her eyes at the drama of it all. “I was only gone for one night.”</p>\n<p>“I know,” Chloe whines. “Can you imagine if you have to go away for more than that? I might not survive.”</p>\n<p>Beca snorts. “Right.”</p>\n<p>Chloe glances at her again, bottom lip set in a pout. “Please, Bec. I promise I’ll totes do like, almost all of the work. You can just appreciate its cuteness.”</p>\n<p>“I dunno, Chloe.” She has nice carpets. And a nice sound system. A just a nice place in general. And dogs are messy. Well, she thinks so anyway. Her parents never let her have pets as a child. Perks of divorce, she thinks sarcastically.</p>\n<p>“Pleeeeeease, Becs.” Chloe bounces up and down a little in the driver’s seat, her pout turned on full blast.</p>\n<p>“Ugh,” Beca sighs. “Fine. Maybe.”</p>\n<p>Chloe beams. “Yay!”</p>\n<p>“Maybe,” Beca points at her. “I said maybe!”</p>\n<p>She said maybe, dammit.</p>\n<p>//</p>\n<p>Beca caves.</p>\n<p>Chloe knew she would because Beca <em>always</em> caves. At least for her anyway.</p>\n<p>Chloe drags her to the Humane Society the next day, watching as Beca tries to keep a straight face at all the dogs wagging their tails at her on the other side of their cages.</p>\n<p>“This is stupid,” Beca scoffs as they walk around a corner and another dog puts her nose to the bars of her cage when they pass. “How can anyone choose when the dogs are being all cute and sad locked up like this!”</p>\n<p>Chloe just smiles knowingly. Beca is <em>such </em>a softie.</p>\n<p>“I hate this,” Beca mutters as a black lab puppy yaps at her. “Stop barking at me, runt!”</p>\n<p>“Beca.” Chloe hip-checks her and sticks her fingers through the holes in the cage. The puppy licks at them enthusiastically. “Chill.”</p>\n<p>“No.” Beca scowls, pulling her arms across her chest like a petulant child. “This place is evil. It’s an orphanage, Chloe. You know who doesn’t get adopted at the orphanage? The big kids.” She glares at the black lab.</p>\n<p>Chloe bites the inside of her cheek to keep from laughing. “Okay, so no puppies.” She pulls her fingers away from the cage, threading them through Beca’s. “Let’s go look at the older ones then.” Beca tugs her away from the cage quickly. “Sorry, pup,” she whispers.</p>\n<p>Beca has her eyes on this cute Australian Shepherd at the end of the row, but Chloe tugs on her wrist before they can get there, causing her to stop mid-step.</p>\n<p>“Ow, Chloe, what – ”</p>\n<p>Chloe’s stopped walking and is staring into one of the cages, lips twisting in thought. She pulls her hand away from Beca and squats down.</p>\n<p>There’s a brown dog lying down on the floor of his enclosure, and as Chloe sticks her fingers in the cage, he stares at her with relative disinterest. She smiles at him, watching as he perks up slowly. Chloe thinks he has really cute pointy ears.</p>\n<p>“Hey,” she coos. The dog sniffs her fingers, gently licking them. Chloe has the vague sense that she’s met the dog before even though she obviously hasn’t.</p>\n<p>It’s clearly meant to be.</p>\n<p>“Boxer,” Beca reads off the information clipped to the cage. “Four years old. Male. Named…” She snorts. “Potato? Who the fuck names their dog Potato?”</p>\n<p>“Aww,” Chloe grins at the dog. “Who’s a cute Potato?”</p>\n<p>She can feel Beca staring at her, her eyes probably doing that half-crazed <em>what the hell, Chlo</em> thing they do sometimes. Chloe is very familiar with that look.</p>\n<p>She beams up at Beca. “We have to get him.”</p>\n<p>Beca’s eyes are totally doing the thing. “<em>Him</em>?” Beca stares at the dog. The dog looks back indifferently. “He looks grumpy.”</p>\n<p>Chloe grins to herself. “So do you.”</p>\n<p>“Ha ha very funny.” She crosses her arms again. “Really, though?”</p>\n<p>Chloe nods, smiling down at the dog. “He’s so cute.” She waggles her fingers through the cage. “Who’s a cutie? You are!”</p>\n<p>Beca’s skeptical frown twists and Chloe knows she’s trying not to laugh. Beca is so easy.</p>\n<p>“Please, Beca, look at him!” She makes her eyes all big, fixing Beca with the cutest look in her arsenal. “He just want two awesome mommies to adopt him.”</p>\n<p>She watches as Beca grits her teeth, eyes flicking back and forth between the dog and Chloe. She drops her head back with a groan.</p>\n<p>“Fine,” Beca sighs.</p>\n<p>Chloe just grins.</p>\n<p>“Why does this always happen to me?” Beca mutters, but she goes to find a Humane Society employee.</p>\n<p>“Ah, this one,” the lady says when Beca brings her back. Chloe’s still squatting with her fingers in the holes of the cage. “He’s been here for <em>quite</em> a bit.”</p>\n<p>Chloe can’t stop smiling. “Ah, see, Bec. We’re saving him.”</p>\n<p>Beca doesn’t say anything, just fixes Chloe with a stare, somewhere between exasperated and fond. The lady lets Chloe into the enclosure and she holds out her hand so Potato can sniff it. At first, he stares at her indifferently, but then he gives it a lick, his long tongue sliding over Chloe’s wrist.</p>\n<p>The employee takes Beca to the counter to go through all the paperwork and payment things (Chloe grins smugly, because like, Beca is totally her sugar mama) while Chloe stays with the dog.</p>\n<p>After he gets used to her, Potato leans his head up and licks her face. By the time Beca has returned, he’s rolled over and Chloe is rubbing his belly.</p>\n<p>Beca eyes the dog like he’s planning on biting a hole through her new jeans. Chloe doesn’t care.</p>\n<p>She’s in love.</p>\n<p>//</p>\n<p>Word gets out that Beca is involved in the new Wachowski movie.</p>\n<p>She suddenly gains an insane amount of followers on Twitter and a bunch of movie blogs start writing some articles about her. <em>On the Rocks’</em> sales skyrocket in days.</p>\n<p>It’s all very surreal.</p>\n<p>She thinks back to the kid she was in high school, perpetually angry at her parents, oversized headphones always around her neck. How many nights had she stayed home messing around on her laptop instead of going out and making friends?</p>\n<p>Now look at her.</p>\n<p>She guesses she’s not quite as angry and she has a few more friends than she did then, even if she still has her nose in her laptop more often than not.</p>\n<p>She briefly wonders when she changed, but as she watches Chloe play tug-of-war with their new dog while she makes dinner, remembering Titanium and shower-acoustics, she thinks she probably knows the answer.</p>\n<p>//</p>\n<p>“Heel, you dumb dog!” Beca tugs on the dog’s leash. “Heel!”</p>\n<p>Chloe rolls her eyes, taking the leash from Beca’s hand. “Po,” she calls, her teacher-voice in full-effect. “Heel!”</p>\n<p>The dog immediately stops pulling.</p>\n<p>“Ugh,” Beca scowls. “How come he only listens to you?”</p>\n<p>Chloe grins at her. “I’m very persuasive.”</p>\n<p>“Or because you feed him food from the table.”</p>\n<p>Chloe gasps. “I do not!” Okay, maybe she does a little.</p>\n<p>Beca’s eyebrows reach new heights on her forehead. “Liar.”</p>\n<p>“You’re such a hater,” Chloe says, leading the dog over to an empty spot on the beach and sitting down.</p>\n<p>They’d decided to take him for a walk on the dog-friendly beach because it was so nice out. Chloe glances down at her bare arms, briefly hoping they don’t get burned, but it was too hot to not wear a tank top.</p>\n<p>Beca plops down next to her, ungracefully kicking up sand as she sprawls out.</p>\n<p>“Lay down, Po,” Beca says, her voice a blunt mallet of authority. The dog is not impressed.</p>\n<p>“Potato, down!” Chloe stares at him and he lies down, a noise grumbling from the back of his throat in a disgruntled sigh. “Good boy.” She pats him on the head proudly.</p>\n<p>Beca eyes the dog warily. “Why the fuck didn’t we change his name again?”</p>\n<p>“Because,” Chloe says for probably the tenth time since they got Po. “He’s four years old and changing it now would confuse him. Wouldn’t it, Po?” She scratches under his chin and he sticks his tongue out happily.</p>\n<p>Chloe takes her phone out of her bra and snaps a picture of him. She uploads it to Instagram with the caption ‘<em>isn’t he cute? Beca doesn’t think so… #potato’ </em></p>\n<p>When she looks up, Beca’s pulled her legs up to her chest, her cheek resting on her knees, just staring at Chloe. Their eyes meet and Chloe thinks Beca’s look almost gray, whether from the sunlight or from the intensity in them, she’s not really sure.</p>\n<p>She’s suddenly self-conscious. “What?”</p>\n<p>Beca twists her lips. “Nothing.” Her gaze slips away from Chloe and comes to rest on the waves in front of them. “I’m just like, happy, or whatever.”</p>\n<p>Something clicks deep inside Chloe. The same feeling she gets when she comes home to find Beca humming in the kitchen or when she hears Beca’s song on the radio.</p>\n<p>Her heart patters like Po’s feet on their hardwood floor, quick and delighted.</p>\n<p>“Yeah,” she says, throat thick. “Me, too.”</p>\n<p>Beca smiles out at the waves, pretty and content, and the gong in Chloe’s chest pangs harder, swelling with love.</p>\n<p>At their feet, Po rests his head on his paws with a happy snort.</p>\n<p>She lays her head on Beca’s shoulder, the skin cold against her cheek. Beca leans into her, arm flexing against the sand to hold them up.</p>\n<p>Chloe’s not sure exactly why, but somewhere deep inside her, she knows this moment will leave fingerprints on her life forever.</p>\n<p>//</p>\n<p>Chloe is crazy, Beca thinks, as they settle in front of Chloe’s laptop on the couch in the living room. Chloe’s got the dog in her lap, as if he’s tiny or something (he’s <em>not</em>), and she’s leaning against Beca’s side comfortably.</p>\n<p>“This is dumb,” Beca grumbles as Chloe pulls Skype up on the screen. “He doesn’t need a godmother. He’s just a dog.”</p>\n<p>Chloe has the audacity to look offended, her palms coming up to cover Po’s ears. “Beca,” she chastises. “What if something happens to us?”</p>\n<p>Beca rolls her eyes. “Nothing is going to happen to us.”</p>\n<p>“You don’t know that!” Chloe takes her hands away from the dog’s ears and hits call on the screen. “Now quit whining and pretend we’re engaged.”</p>\n<p>Beca scoffs before fixing her face in the most outrageously sarcastic interpretation of a loving smile that she can muster. “Yes, dear.”</p>\n<p>“Shut up,” Chloe giggles, but at that moment, their Skype call is answered and Beca’s stomach drops.</p>\n<p>She and Aubrey mostly worked their beef out over the past six years, but seeing her still causes Beca to shudder slightly.</p>\n<p>She’ll never forget all that awful cardio.</p>\n<p>“Aubrey!” Chloe’s suddenly all smiles and excitement at seeing her best friend. Beca pretends that doesn’t make her soften a little because she’s still kind of grumpy that Chloe is making her do this.</p>\n<p>Chloe makes her do a lot of things she doesn’t want to do. Beca thinks it must be akin to a superpower or something.</p>\n<p>“Chloe!” Aubrey beams at them from the laptop. “Oh my God, is that him?”</p>\n<p>“Aubrey, this is Po! Po, this is Aubrey!” Chloe holds up the dog’s paw in a wave. He looks at Beca, unimpressed. She shrugs at him sympathetically. She totally feels the dude.</p>\n<p>“Aww,” Aubrey coos. Beca’s starting to feel extremely nauseous at the whole ordeal. “Hi, Po. And hello, Beca.”</p>\n<p>Beca nods her head. “’Sup, Aubrey.”</p>\n<p>Aubrey leans closer to the camera, her eyes narrowing. “Beca, are you sunburned? You know I’ve told you about the hazards of not wearing sunblock.”</p>\n<p>Beca’s hand covers her nose self-consciously. “No, I just.” She tries to think of a clever response, but not seeing Aubrey in a few years has her really out of practice. She scowls instead.</p>\n<p>Chloe just beams between them. Beca finds the whole thing a mix of adorable and disgusting.</p>\n<p>“Aubrey, Beca and I have something to ask you.” Chloe jiggles her leg nervously. Beca rolls her eyes. Chloe is such a drama queen.</p>\n<p>Aubrey raises her eyebrows in anticipation. “Oh, you do, do you?”</p>\n<p>“Yes,” Chloe nods, fixing Beca with an expectant look.</p>\n<p>“What?” Beca stares back, an uncomfortable feeling of dread rising in her lungs.</p>\n<p>Chloe jerks her head toward Aubrey, a mischievous twinkle in her eye. Beca freezes. Chloe is crazy, she thinks again. Chloe is crazy if she think that Beca is going to –</p>\n<p>“Well, ask her.” Chloe nudges her.</p>\n<p>“What, no!” Beca shakes her head. “You ask her!”</p>\n<p>“<em>Beca</em>,” Chloe commands with her teacher voice, the voice that drives Po to sit when he’s begging at the table.</p>\n<p>Beca falters. “I. What? Chloe. <em>No</em>.” Chloe continues to stare at her. “I. Ugh... Fine. Aubrey,” she starts. Chloe nods encouragingly at her, all sunshine and daisies. Beca hates everything about this moment. “Will you like, be Po’s extremely unnecessary godmother, or whatever?”</p>\n<p>Aubrey gasps excitedly. Chloe beams with the force of a spotlight. Beca hates everything.</p>\n<p>“Oh my God! Of course I will!”</p>\n<p>“Great,” Beca intones wryly.</p>\n<p>Chloe rolls her eyes at Beca, her body buzzing happily. “Don’t mind her. But yay, this is so exciting! Isn’t it Po,” she says in her puppy-voice, shaking his paw up and down. “Auntie Aubrey loves you.”</p>\n<p>Aubrey’s laugh fizzes through the speakers as she smiles at Chloe like she could cure cancer. Somehow, Beca understands the feeling.</p>\n<p>“I have something to tell you guys, too.” Aubrey taps her fingers against her wrist, a nervous habit Beca recognizes from when they were in Bellas together. She’s suddenly intrigued. Maybe Aubrey is pregnant. What if she’s a stripper? Oh my God. What if she’s dating a Treble? The possibilities are endless.</p>\n<p>“I might be moving to Los Angeles!” Aubrey bursts out. Chloe gasps again. Beca deflates.</p>\n<p>“What!” Chloe shrieks. “Why? When?”</p>\n<p>Aubrey crosses her hands on the desk in front of her, leaning in slightly. “Well, my father’s decided that it’s an opportune time to expand his firm to have locations in L.A. and New York and…” She grins widely at them. “He’s sending <em>me</em> to headline the Los Angeles one!”</p>\n<p>“Oh my God!” Beca’s going to go deaf in one ear if Chloe doesn’t stop screaming. “That’s amazing, congratulations!”</p>\n<p>“Yeah, dude.” Beca agrees. She’s happy for Aubrey, at least. Finally her dad has stopped being such a dick. “Congrats.”</p>\n<p>“Thanks guys.” Aubrey looks like she might get teary-eyed. Beca has never felt more uncomfortable. And that’s saying something. Jesse made her watch <em>The Brood</em> once.</p>\n<p>Chloe claps her hands excitedly. “When are you coming?”</p>\n<p>“Well, I was thinking that…” Aubrey clears her throat. “That I could live with you guys?”</p>\n<p>Beca’s pretty sure her heart stops beating right then and there. “Live.. live with… <em>live with us?</em>” she splutters. Oh no. Oh nooooo. No.</p>\n<p>This is her space. Her calm, serene, no psychotic-ex-college-a capella-group-sister-infiltrated <em>space</em>.</p>\n<p>Suddenly, Aubrey barks out a laugh. Po perks up his ears at the sound. “Relax, Beca. I’m kidding.”</p>\n<p>Beca stares, feeling her suddenly chilled blood start to return to its normal temperature. Chloe squeezes her knee, chuckling.</p>\n<p>“Not cool, dude,” she mumbles.</p>\n<p>Aubrey smirks, all too familiar and biting. “I should be offended by the terror that passed over your face, but I’ll let it slide. I wouldn’t want to invade your…” she crinkles her nose as if Po had breathed puppy-breath in her face. “Pre-marriage den.”</p>\n<p>Beca freezes, eyes wide. She’d almost forgotten they were supposed to be pretending to be engaged.</p>\n<p>“Well, thank you, Aubrey,” Chloe grins gratefully, clearly covering for Beca’s inability to make proper words with her mouth.</p>\n<p>Aubrey just winks at Chloe. “Anyway, Chlo. I was going to come out over Thanksgiving to look for a place. Then I’ll probably move out after New Years.”</p>\n<p>“Great!” Chloe’s smile reaches her ears. “You can join us for Thanksgiving, then! Emily and Benji will be here! And I think Jesse was planning on coming, too.”</p>\n<p>“Wonderful!”</p>\n<p>Yes, Beca thinks as they say their goodbyes. Just wonderful.</p>\n<p>//</p>\n<p>Chloe’s always known that if it’s between her and Beca, she’s the dramatic one. Aubrey always told her she needs to think before she overreacts, and while she’s gotten better at it, she knows she’s not immune yet.</p>\n<p>That’s why she’s totally surprised when it’s who Beca starts screaming at Lindsey over the phone just a few days before Thanksgiving.</p>\n<p>“You are supposed to be handling these things! That’s your job, Lindsey!”</p>\n<p>Well, she thinks. Beca did punch someone and go to jail once…</p>\n<p>Chloe purses her lips, an awkward feeling of discomfort rising in her stomach, and stares at the reason for Beca’s continued yelling: an article pulled up on Chloe’s laptop.</p>\n<p>The article itself is extremely mild, which is why Chloe’s surprised at Beca’s outbursts. Chloe would hardly even call it an article, more like a short blurb with a couple of pictures.</p>\n<p>But Chloe guesses it’s the pictures that are the problem.</p>\n<p>The first picture was clearly taken by the paparazzi, a candid snapshot of her and Beca walking Po along the beach. Beca’s in a tank top and jean shorts and Chloe’s got her bikini on under a sundress. Beca’s shooting her a smile, Chloe can’t remember why, but she’s laughing at whatever Beca just said.</p>\n<p>The caption reads “on-the-rise producer/artist Beca Mitchell and her stunning fiancée, Chloe Beale, walk their dog Potato on a sunny Friday outing.”</p>\n<p>Under the caption is another picture, one taken from Chloe’s Instagram featuring the dog licking Beca’s face with the caption “<em>He loves Beca… that makes two of us! #potato”</em> that she posted a few days ago.</p>\n<p>Chloe doesn’t really mind. Sure, it’s weird seeing her face online like this, and it’s weirder that they used her own picture, but the photos are harmless.</p>\n<p>If anything, it should be a compliment. Beca is clearly growing enough in fame that the paparazzi took an interest in their dog-walk.</p>\n<p>Plus, they called Chloe stunning.</p>\n<p>Which like, duh.</p>\n<p>“I don’t care!” Beca huffs out from the other room. “I don’t want them messing with Chloe. We need to call it off, now!”</p>\n<p>There’s a silence and Chloe distractedly twists the engagement ring Lindsey had sent over the other day around her finger.</p>\n<p>(“To keep up appearances,” Lindsey had said to Beca over the phone.</p>\n<p>“These aren’t real, are they?” Beca eyed her own ring warily. Chloe thought they looked pretty.</p>\n<p>Lindsey just ignored her. “Don’t worry about it.”)</p>\n<p>Chloe sighs as Beca starts shouting again. “I don’t care if Marcus suddenly admits that he’s into shoving Legos up his ass!” Chloe’s eyebrows shoot up her forehead. “This has nothing to do with me!”</p>\n<p>Silence. Chloe scrolls down the article again.</p>\n<p>“Fine!” Beca’s voice stabs the air like a knife. Chloe feels mildly bad for Lindsey. “But I deserve a bonus for this.”</p>\n<p>Seconds later, Beca storms back into the kitchen, sitting down with a dramatic huff. Chloe smiles at her sympathetically.</p>\n<p>“Apparently Marcus just got a DUI so the label is trying to deal with that PR shitstorm,” Beca grumbles, her chin coming to rest on her enclosed fist in defeat. “Lindsey says we can’t issue the statement that we’re not together until it all blows over.”</p>\n<p>Chloe’s not sure why, but something in her chest pangs with relief.</p>\n<p>They <em>did </em>just get these pretty rings.</p>\n<p>“It’ll be okay, Becs.” Chloe grabs Beca’s free hand, tangling their fingers together. She rubs her thumb over Beca’s.</p>\n<p>“I know it’ll be okay,” Beca mutters. “It just sucks that you’re getting dragged into this. At least I knew what I was getting into when I put that album out.”</p>\n<p>“Hey,” Chloe pouts. “You’re my best friend. We’re in this together.” Chloe quirks an eyebrow playfully. “Plus, it’s not <em>all</em> bad. They did call me stunning.”</p>\n<p>Beca snorts. “That’s because you are.”</p>\n<p>Chloe takes a secret pleasure in the way Beca’s ears turn bright red, but doesn’t comment on it. She squeezes Beca’s hand and lets go, immediately missing the coolness of Beca’s fingers between her own.</p>\n<p>“Come on,” Chloe says, standing up and holding her hands out to help Beca up.</p>\n<p>“Where are we going?” Beca asks, but takes Chloe’s hands anyway.</p>\n<p>“In-N-Out,” Chloe replies. “So I can buy my fiancée a milkshake.”</p>\n<p>Beca rolls her eyes, but she grins in a way that makes Chloe’s heart jump-start, and Chloe knows what she said was true.</p>\n<p>They’re in this together. They’ll figure it out.</p>\n<p>//</p>\n<p>Beca picks Emily and Benji up from the airport the day before Thanksgiving. Chloe was going to come too, but at the last minute she started stressing out about making their place look so clean that it’s like they don’t even live there.</p>\n<p>Beca tried to reason with her when she started scrubbing the hard-wood floor on her hands and knees, but Chloe on a mission is not to be stopped.</p>\n<p>Emily talks her ear off the whole drive back from LAX, but she doesn’t mind. She makes eye contact with Benji in the rearview mirror and he smiles knowingly at her. She guesses he doesn’t mind, either.</p>\n<p>“Okay, so,” Emily gushes and Beca just lifts an eyebrow in her direction, eyes still on the road. “I’ve been working on a bunch of new stuff, and I know we only have three days, two if you include Thanksgiving, because you probably don’t really want to work on Thanksgiving. Especially if you’re cooking and stuff and my mom and I always watch the parade if you’re into that, which I don’t know about you, but Chloe seems like she might be…”</p>\n<p>Beca bites back a grin and waits for Emily to get to the point.</p>\n<p>“Anyway. I have a bunch of new stuff and I really can’t wait for you to hear it and I was hoping that I could come back for Spring Break and we could finally finish making a full demo. But like, only if that’s okay with you Bec. I know you’re so busy with your movie and your own music and the wedding and everything. I’m just <em>so</em> excited. Especially now that I’m about to graduate, you know? Well you probably know, I mean you already graduated.”</p>\n<p>Emily takes a breath like she might continue so Beca takes one hand off the steering wheel and covers Emily’s mouth with it. Emily’s eyes grow to baseball size. Beca feels her exhale against her hand and pulls it away.</p>\n<p>“Breathe, Legacy.”</p>\n<p>Emily nods. “I’m breathing. Totally breathing.”</p>\n<p>Beca smirks. “We can definitely look at the stuff you’ve been working on. I’m not doing anything work-related until next week.”</p>\n<p>Emily beams excitedly and Beca feels that soft feeling of fondness ease over her. Emily reminds her of Chloe so much sometimes.</p>\n<p>“What about you, Benji, you got some stuff I need to look at?” Beca peers back in the rearview mirror again. Benji just grins.</p>\n<p>“I’m just a computer science nerd now, actually. Except at karaoke night.”</p>\n<p>Emily nods enthusiastically. “He’s so smart. You should see some of the stuff he’s doing with codes and interfaces and stuff. I look at it and I’m just like, sheesh, Benj. He could be hacking the Pentagon for all I know.”</p>\n<p>Benji chuckles. “I’ve told you a million times, Em. I’m not hacking the Pentagon.”</p>\n<p>She doesn’t look convinced. “I’m just saying that I wouldn’t <em>know</em> whether or not you were…”</p>\n<p>At that point, Beca pulls into the driveway, letting out a sigh of relief. Not that she doesn’t love her, but Emily doesn’t appreciate the beauty of silence as much as Beca does.</p>\n<p>“So,” Beca says as they walk through the door. “Emily you know where everything is if you want to show Benij around. I’m just going to go… pee, or whatever.” Really she just needs one second of quiet to psych herself up for the next few days.</p>\n<p>“You got it, Captain!” Emily salutes dorkily and pulls Benji down the hall and into Chloe’s room. Or. <em>The guest room</em>, Beca reminds herself, thinking of their frenzy that morning to move all of Chloe’s stuff into Beca’s room for the next couple of days.</p>\n<p>This fake-engagement thing is getting really inconvenient and if it was with anyone other than Chloe, Beca is one hundred percent sure she would’ve sacrificed her stupid image after like, two days.</p>\n<p>She walks into her room – <em>their room</em>, she corrects in her head – to find Chloe laying on the bed, watching <em>Grey’s Anatomy</em> reruns on TV. Po’s laying on his bed in the corner, fast asleep.</p>\n<p>“Hey,” Chloe grins when she sees Beca. “How’d it go? Where’s Emily and Benji?”</p>\n<p>“Getting settled.” Beca groans. “I love them, but I have a feeling this is going to be a long three days.”</p>\n<p>Chloe pouts, opening her arms. Beca rolls her eyes, but crawls into bed next to her and lays her head on Chloe’s chest. She closes her eyes as Chloe rubs her back gently.</p>\n<p>“At least Aubrey isn’t here yet?” She can feel Chloe’s smile in her hair and Beca can’t help the small chuckle that escapes her mouth.</p>\n<p>“Thank the aca-gods for that.”</p>\n<p>Chloe laughs and it washes over Beca like a warm blanket. She feels the stress start to leave her shoulders.</p>\n<p>“It’s just three days,” Beca says, trying to convince herself.</p>\n<p>“Just three days,” Chloe repeats, and Beca doesn’t need much more convincing than that.</p>\n<p>//</p>\n<p>The next day is probably the most hectic day of Beca’s life.</p>\n<p>Including that day Fat Amy flashed President Obama. She shudders at the memory.</p>\n<p>She’s been in the kitchen since she practically woke up, peeling potatoes and trying to prep the turkey, which, like, thank god for Google.</p>\n<p>If anyone had told her two years ago that she’d be “engaged” to Chloe Beale and cooking Thanksgiving dinner for their friends pretty much by herself, she would have laughed in their face.</p>\n<p>Now look at her.</p>\n<p>Those aca-gods sure do have a sense of humor.</p>\n<p>Somewhere in the other room, Emily is laughing at some joke that Jesse just made. She hears Aubrey’s sharp reply and briefly is grateful she doesn’t have to deal with <em>that</em>.</p>\n<p>She <em>is</em> happy that Aubrey’s here, though. Chloe teared up a little when Aubrey arrived and Beca knows she’s missed her. They’ve been catching up for the past hour and Beca’s been glad to let them have their time together alone. Even if it means she’s doing all this cooking.</p>\n<p>The timer on the oven goes off and Beca checks the temperature of the turkey. Almost done. She sighs in relief.</p>\n<p>She goes back to peeling the potatoes, absentmindedly humming to the song she and Emily put together last night. It sounds great and Beca feels pride swell in her chest.</p>\n<p>Ugh, she is turning into <em>such </em>a sap. <em>Gross</em>.</p>\n<p>“Whatcha smiling about?”</p>\n<p>Beca jumps, the peeler slipping from her hand and into the sink with a metallic clang.</p>\n<p>“Oops, sorry,” Chloe appears next to her and Beca’s heart takes flight. She drops her chin to her chest as she starts to laugh.</p>\n<p>“Dude! I hate when you do that.”</p>\n<p>Chloe hugs her from behind, her chin resting on Beca’s shoulder. “I didn’t mean to,” she giggles in Beca’s ear.</p>\n<p>Beca relaxes into the hug as her heart returns to normal speed. She picks up the peeler and the potato she was working on. “You’re going to give me a heart attack one of these days.”</p>\n<p>“Mmm.” Chloe hums and they lapse into a brief silence that’s only broken by the clicking of the peeler. Eventually, Chloe lets go of her and takes the peeler and the potato from her hands, hip-checking her away from the sink.</p>\n<p>Beca turns to check on the turkey again and sees Jesse leaning against the doorway of the kitchen wearing a shit-eating grin.</p>\n<p>“What,” she scowls at him.</p>\n<p>“Nothing,” he says innocently. “Can I help with anything?”</p>\n<p>Beca narrows her eyes at him. “You can set the table.” She juts her chin at the plates and utensils on the island.</p>\n<p>“You got it, Boss.” He winks and grabs the plates, heading into the other room to set the table.</p>\n<p>She stares after him suspiciously.</p>\n<p>Stupid Jesse.</p>\n<p>//</p>\n<p>It’s Chloe’s first Thanksgiving away from her parents and it’s different in all of the best ways.</p>\n<p>She didn’t have to dress up super fancy, but opted for a casual blue dress that brings out the blue in her eyes and accentuates the tan on her arms that she gained since moving to L.A.</p>\n<p>Back home, Chloe’s mom usually puts her on green-bean casserole duty, which is unfortunate because Chloe hates green-bean casserole. When Chloe asks Beca what she should be helping with, Beca just shrugs and tells her to go catch up with Aubrey. She knows it’s because Beca is secretly afraid Chloe will probably burn something with her culinary ineptitude, but still, she’s grateful.</p>\n<p>Aubrey tells her all about her newest case and Chloe catches her up on what she’s having her kids sing at their Christmas concert. She feels her cheeks starting to hurt from smiling too much, but she can’t stop. She’s missed Aubrey a lot and this is probably the best Thanksgiving she’s ever had.</p>\n<p>When Jesse starts telling Aubrey about the movie that he and Beca are working on, she excuses herself to help Beca in the kitchen.</p>\n<p>Beca’s peeling potatoes, the muscles in her arms flexing with every stroke, and humming under her breath. She’s wearing this old pair of jean shorts, frayed at the bottoms, and this soft navy shirt that hangs loosely around her stomach. Her hair falls over one shoulder, piercings on full display, and as Chloe watches, a small smile tugs at her lips.</p>\n<p>She looks so pretty and so <em>Beca</em> in that moment that Chloe feels love rush through her, and she scoops Beca up in a hug, pleased when Beca doesn’t pull away.</p>\n<p>Chloe thinks she likes Thanksgiving with Beca a lot more than she likes it with her parents.</p>\n<p>//</p>\n<p>The table is meant for four people, but the six of them manage to squeeze around it easily enough. As she passes the gravy to Emily on her right, Chloe can’t help but think that she wishes Thanksgiving could always be like this.</p>\n<p>“This turkey is amazing, Becs,” she says, smiling at Beca on her left. Beca just shrugs and Chloe grins at her inability to take a compliment.</p>\n<p>The rest of the table hums in agreement.</p>\n<p>“Where’d you learn to cook, Beca?” Aubrey fixes Beca with a curious stare and Beca twists her lips in thought.</p>\n<p>“Oh, you know.” She shrugs again and passes Chloe a dinner roll. “Perks of being a child of divorce. You get tired of pizza after a while.”</p>\n<p>Jesse looks scandalized at the thought of getting tired of pizza. “No way. Never.”</p>\n<p>Beca crinkles her nose. “Divorce is another monster, dude.”</p>\n<p>Chloe holds her breath, waiting for bitterness to seep into Beca’s expression, but it never does. Beca catches her eye and pours her some wine.</p>\n<p>“What?”</p>\n<p>Chloe just shakes her head and exhales. Beca raises an eyebrow and does that half-grin Chloe loves. “Nothing.”</p>\n<p>They make light conversation about Benji’s job and Emily’s classes. Chloe feels Po squirm his way under the table, plopping down on her feet with a low snort.</p>\n<p>Aubrey starts chastising Beca about her cholesterol (“I’m not a fifty-year old man, Aubrey.” “High cholesterol effects women, too, <em>Beca.</em>”), and Chloe drifts into a sleepy daze right there at the table.</p>\n<p>When Beca shifts next to her, her leg coming to rest against Chloe’s, Chloe feels heat rush through her body, not sure if it’s from Beca or the glasses of wine she’d had.</p>\n<p>Either way, Beca smiles at her, and Chloe grins back, wine-drunk and happy.</p>\n<p>//</p>\n<p>Emily and Benji offer to the dishes, so Beca stretches out on the couch, Chloe’s head in her lap. Aubrey left a little while after dinner and Chloe quickly dropped off into a light sleep as soon as Beca’s fingers started tapping a rhythm on her forehead. Jesse’s sitting on the floor and scrolling through the channels on the TV for a good movie.</p>\n<p>He clicks on something and grins at her. “<em>Clueless</em>.”</p>\n<p>Beca just shrugs and shakes her head.  He really should be used to this by now.</p>\n<p>“You’re the worst, actually,” he says, moving to lean his back against the middle of the couch.</p>\n<p>Beca snorts. “Yep.”</p>\n<p>They watch the movie in silence for a few minutes. Or at least Jesse does. Beca rubs her pointer finger up and down Chloe’s forehead, enjoying the way Chloe’s nose wrinkles in her sleep when Beca accidentally tickles her.</p>\n<p>“Dude,” Jesse says eventually. “You are so whipped.”</p>\n<p>Beca’s eyes shoot up. “What?”</p>\n<p>“You know,” he says, making a whipping-motion. “Whipped?”</p>\n<p>Beca scowls. “Gross. No I’m not.”</p>\n<p>Jesse shrugs knowingly and Beca wants to punch that condescending look off his face. “You never used to do that shit with me. And we dated for three years.”</p>\n<p>Beca opens her mouth to argue, but then thinks better of it. She wants to tell Jesse he’s stupid and wrong, but she can’t. She’s supposed to be engaged.</p>\n<p>“Whatever,” she says instead.</p>\n<p>“Yeah,” he smirks. “Whatever.”</p>\n<p>She grits her teeth and glares at him until he returns his attention to the movie. She goes back to dragging her finger across Chloe’s forehead.</p>\n<p>Stupid Jesse. He doesn’t know what he’s talking about.</p>\n<p>//</p>\n<p>Chloe’s drooling. That’s her first thought when she wakes up.</p>\n<p>Her second thought is that she’s drooling <em>on someone</em>, her cheek pressed warm into a collarbone.</p>\n<p>Her third thought is that the <em>someone</em> is murmuring quietly, talking on the phone, and playing with Chloe’s hair.</p>\n<p>Her fourth thought is that it’s Beca.</p>\n<p>“Yeah, I guess that’s fine.” Chloe feels the words vibrate around Beca’s chest and into the air. “No, no. I’m excited. Swear.”</p>\n<p>Chloe hears the sound of someone responding, but can’t make out the words.</p>\n<p>“Sorry,” Beca says. Her fingers still on Chloe’s neck as Beca freezes. After a second, they go back to tugging through Chloe’s hair gently. She feels Beca exhale.</p>\n<p>“Not. It’s… I’m just,” Beca stutters. “No, Chloe’s just sleeping.” More response from whoever is on the phone. Beca snorts. “Fuck you, Linds.”</p>\n<p>Chloe grins into Beca’s chest.</p>\n<p>“I’m hanging up now.”</p>\n<p>Chloe feels Beca set her phone on the nightstand and sink back into her pillow with a huff. She flutters her eyes open.</p>\n<p>“Was that Lindsey?” Her voice is croaky with sleep and she clears her throat.</p>\n<p>Beca shifts. “Crap, did I wake you up?”</p>\n<p>Chloe shakes her head. “What did Lindsey have to say so early in the morning?”</p>\n<p>She feels Beca chuckle. “It’s noon, Chlo.”</p>\n<p>“Is it really?” She lifts her head and glances at the clock. “Oh, wow.” Beca raises her eyebrows in amusement. Chloe slumps back down on her chest.</p>\n<p>“Whatever,” Beca says. “It’s a holiday.”</p>\n<p>Chloe hums in agreement and adjusts her position so she’s more on her side and can look up at Beca. “So…?”</p>\n<p>Beca rolls her eyes. “Curiosity killed the cat, you know.”</p>\n<p>“I’m more of a dog person.” As if to back her up from across the room, Po lets out a deep yawn that ends in a groan.</p>\n<p>She feels Beca laugh. “Apparently.” She taps her fingers on Chloe’s back. “I have to go back to New York for a week.”</p>\n<p>Chloe pinches her eyebrows together. “When?”</p>\n<p>“Few days before Christmas.” She sighs. “Jesse and I have laid the foundation for the overall sound of the movie so we have to meet up with sound team and go over some stuff.” She shrugs. “Boring stuff.”</p>\n<p>Chloe twists her lips. “Becs, that’s not boring. That’s really cool.”</p>\n<p>“Yeah,” Beca avoids her eyes. “It’s okay.” She shrugs. “I won’t be back until Christmas Eve though, and you’re going home for Christmas so…”</p>\n<p>Chloe feels a rush of fondness as she suddenly gets it. “Beca Mitchell, are you trying to say you’ll miss me?” Beca’s face turns bright red. Chloe grins and pokes her cheek. Beca turns her face away embarrassed. Chloe wants to die, it’s so cute. “Aww. I’ll miss you, too.”</p>\n<p>“Ugh, stop.” Beca tries to be serious, but it bleeds into a laugh. Chloe pokes her cheek again. “Stop it.”</p>\n<p>“You’re so cute.”</p>\n<p>“I hate you.”</p>\n<p>Chloe shakes her head. “You love me. It’s fine. Just admit it.”</p>\n<p>“Whatever,” Beca drawls. She raises her eyebrows like she knows something Chloe doesn’t. “If you miss me too much, you can just watch me on TV.”</p>\n<p>Chloe feels her nose crinkle in confusion. “On TV?”</p>\n<p>“Yeah,” Beca says, all casual and indifferent. Chloe is suddenly suspicious. “December 22<sup>nd</sup> on Late Night with Seth Meyers.”</p>\n<p>Chloe’s mouth falls open. “What? Are you serious?”</p>\n<p>Beca nods, lips revealing a toothy grin that pulls at Chloe’s heart. “Yeah. I’m serious.”</p>\n<p>“Oh my God!” Chloe shoots up, excitement pumping through her. “Oh my God oh my God!”</p>\n<p>Beca smiles fully, reveling in Chloe’s enthusiasm. “I know right.”</p>\n<p>“Beca!” Chloe rolls over, effectively sitting on Beca. She takes Beca’s cheeks between her palms and squeezes them. “Oh my God!”</p>\n<p>Beca’s body shakes as she laughs. “Stop saying that. And get off me!”</p>\n<p>“No!” Chloe can’t stop smiling. She pulls her hands away from Beca’s face. “Explain!”</p>\n<p>“I don’t really know?” Beca shrugs as much as she can while lying down with Chloe on top of her. “Lindsey just called and said that since I was going to be in New York anyway, she’d try to make it happen. And then she did?”</p>\n<p>“Oh my God,” Chloe says again. She doesn’t really have any other words right now.</p>\n<p>Beca nods like she understands. Her hands come up to tap on Chloe’s thighs. “I can’t believe it either. Like why would they want to hear me talk? I’m not funny or interesting or anything.”</p>\n<p>Chloe looks at Beca like she’s crazy. “Are you serious? Beca, you’re the most interesting and talented person I’ve ever met.”</p>\n<p>“I..” Beca falters, her cheeks turning red again. “Okay?”</p>\n<p>Chloe grabs her face again. “I’m serious.”</p>\n<p>Beca purses her lips. “Okay. Thanks?”</p>\n<p>“Yeah.” Chloe stares down at her, hoping Beca <em>gets</em> it. How could she not? She’s so smart and funny, and her music clearly shows how talented she is. And like, she’s so pretty that it makes Chloe dizzy sometimes.</p>\n<p>Beca meets her eyes and Chloe’s stomach drops. Her breath gets caught in her throat. She shifts slightly and suddenly becomes hyperaware that she’s practically straddling Beca in just her sleep shorts and low rise tank top. She tries to not notice how Beca’s eyes keep glancing down at her cleavage.</p>\n<p>“Umm,” Chloe clears her throat. “I’m gonna get off now.”</p>\n<p>Beca snorts. “Good for you.”</p>\n<p>“Shut up.” Chloe grins and pushes at Beca playfully before sliding off of her, her feet hitting the floor with a light thud. Po raises his head at the noise. She pats it briefly and heads toward the bathroom. She closes the door behind her, leaning her back against it and taking a deep breath.</p>\n<p>She glances at her reflection in the mirror above the sink. Her cheeks flush crimson and her eyes look extra blue under the bright bathroom lights.</p>\n<p>She exhales shakily and bites her lip, realization flooding through her. She tries to shake it off, but she’s always been in-tune with her feelings. There’s no denying it.</p>\n<p>She’s totally into Beca Mitchell.</p>\n<p>//</p>\n<p>Chloe’s always been one to act on her feelings. She doesn’t know how not to. Once she feels something, she can’t just <em>not</em> feel it, so why pretend she doesn’t?</p>\n<p>The problem is, Beca is the opposite. Chloe doesn’t want to say Beca is obtuse, but Beca is clearly not as into recognizing feelings as Chloe is. Chloe guesses it’s from the years Beca spent trying not to add her problems to those of her parents, clamping them down and willing them to go away in hopes that by pretending <em>she’s </em>okay, then her parents will be okay, too.</p>\n<p>But then again, Chloe studied literature and education, not psychology, so she can’t say for sure.</p>\n<p>Still, she’s aware that it takes Beca light-years to realize what she’s feeling, especially if you call her out on it.</p>\n<p>Which is why Chloe tries not to do that with Beca. It’s kind of weird, because with anyone else, Chloe just says what she’s thinking. Not that she doesn’t do that with Beca, but when it comes to some things, Chloe finds herself being a little withholding. She doesn’t even mean to be. It just happens.</p>\n<p>The only thing is that even when Chloe is keeping these things to herself, Chloe is <em>very</em> aware of what she’s feeling, and once she realizes she’s feeling something, she feels and feels and feels until she can’t stop thinking about it. She <em>obsesses</em>.</p>\n<p>And after her little revelation in the bathroom, Chloe’s a little frustrated with her one-track mind.</p>\n<p>Because she can’t stop thinking about Beca.</p>\n<p>It’s been a day. Not even. She hasn’t even slept on it yet, but still, here she is, staring at Beca like she’s under hypnosis.</p>\n<p>It’s like she’s never even <em>seen</em> Beca before.</p>\n<p>She watches as Beca gives Emily a thumbs-up, her fingers pushing at the switches on the table in front of her, cueing up the music. Emily bops her head and starts to sing, hands pushing at the large headphones around her ears, but Chloe hardly notices the song at all.</p>\n<p>Beca is tapping her fingers against her arm, one finger hovering over a dial on the board in front of her, her face twisted in concentration. Chloe’s eyes follow the path of her fingers, up her arm and to her face. She just looks so pretty, and so <em>Beca</em>, and Chloe’s chest feels airy like there’s helium in her heart, tugging it up, up, and away.</p>\n<p>Benji grins at her and Chloe wonders if he <em>knows</em>.</p>\n<p>She smiles back at him and he quickly goes back to watching Emily sing, shooting her the biggest heart-eyes she’s ever seen.</p>\n<p>She totally understands.</p>\n<p>As Beca smiles that sharp half-grin Chloe loves, she thinks her eyes probably look the same.</p>\n<p>//</p>\n<p>Beca hates tears.</p>\n<p>She hates them so much. When people cry, she feels so uncomfortable and out of her element. She wasn’t made for this whole comforting thing.</p>\n<p>Crying girls are her weakness. Avoiding a crying Chloe Beale is her first priority.</p>\n<p>Avoiding a crying Emily Junk is quickly becoming her second.</p>\n<p>“There, there,” Beca says and cringes. Why did she say that? Nobody actually says that. She pats the girl on the shoulder as if that’ll make the tears building in her eyes go away.</p>\n<p>“Sorry,” Emily says, wiping her nose as she sniffles a little. “I’m just going to miss you guys. And with Nationals coming up and the team not ready, I just feel really out of my element. I’m like the worst captain ever, we haven’t won since you guys left and this is my last chance and I just feel like I’m tarnishing the Bellas name and – ”</p>\n<p>“Whoa, okay, stop. Just stop.” Beca grabs the girl by her biceps and shakes her a little. Just a little. “Breathe, Legacy.”</p>\n<p>Emily nods quickly and inhales. Beca sighs. This has been the weirdest two days. First, Chloe’s been acting so weird and she can’t figure out why. Like, usually she won’t stop <em>touching</em> Beca, but she’s been strangely distant. Like, she didn’t even cuddle up to Beca last night, which in the past would’ve relieved her probably, but now she’s used to it and she even kind of <em>missed</em> it.</p>\n<p>Not that she’d admit that, but, you know. <em>Whatever</em>.</p>\n<p>So if that wasn’t weird enough, now she’s just trying to drop Emily and Benji off at the airport and all of a sudden, Emily – optimistic grab-life-by-the-horns Emily – whips out the water works right there in the drop-off lane.</p>\n<p>Beca has the strange sensation that she’s landed in an alternate dimension. Except the part where she’s awkward because that’s apparently still a thing.</p>\n<p>“Okay listen.” Beca squeezes Emily’s arms. “First, you’re not the worst captain ever. If Chloe were here, she would tell you exactly who is, and it’s probably some aca-bitch from the 1960s.” Emily chokes out a small laugh and relief washes over Beca. She really hates tears.</p>\n<p>“Second,” Beca continues. “You’re not tarnishing the Bellas name. Fat Amy already did that with MuffGate. It doesn’t really get worse than flashing your vajayjay to the President, you know what I mean?”</p>\n<p>“But she has such a lovely vagina.” Emily grins a little and Beca grimaces involuntarily. She makes eye contact with Benji briefly, but he just shrugs.</p>\n<p>“Gross, dude.” Emily gives her a watery smile and wipes under her eyes. Beca squeezes her arms again. “Okay, cool, so no more tears.”</p>\n<p>Emily nods. “Yeah, got it. No more tears. Totally.”</p>\n<p>“Great.” Beca lets go of Emily’s arms. “You just focus on school and when it comes to Nationals, just do your best, okay? It’s gonna be fine if you don’t win. I know it seems like it, but it won’t be the end of the world if you don’t. Just have fun with it.”</p>\n<p>Beca takes a second to process what she’d just said and decides that maybe she <em>is</em> in an alternate dimension. When did she start sounding like her dad?</p>\n<p>Still, Emily’s mostly stopped crying now, letting out a few sniffles here and there.</p>\n<p>“So,” Beca continues. “You do all that stuff and I’ll see you on your Spring Break if Mama Junk lets you come out again. Sound cool?”</p>\n<p>“Yeah, sounds cool.” Emily has that look that means she’s going to hug her so Beca just lets it happen, allowing long arms to wrap around her shoulders. “Thanks for everything, we had the best time.”</p>\n<p>Beca hides her smile in Emily’s shoulder. “Yeah, of course, it’s, you know, whatever.” She pulls back and makes her face serious again. “Be good.” She points her finger at Benji. “You, too.”</p>\n<p>He gives her a quick side-hug. “Don’t worry, I don’t make treble, anymore.” He beams and Beca wrinkles her nose.</p>\n<p>“I hate puns.” He just grins that dorky Benji smile and she rolls her eyes. “Alright, get going before you miss your flight.”</p>\n<p>“Yes, Mom.” Emily mimics her eye-roll and Beca pretends that’s not the weirdest thing she’s ever seen.</p>\n<p>Emily and Benji grab their suitcases and wave one last time before disappearing inside the automatic doors of the airport. Beca stares after them for a second, wondering why it feels like a giant chasm just opened in her chest.</p>\n<p>She rolls her eyes at herself. Why is she being so dramatic?</p>\n<p>Yeah. She’s definitely in an alternate dimension.</p>\n<p>//</p>\n<p>The holiday ends all too quickly and before she knows it, Beca’s back in the studio Monday morning, dialed into the music and her laptop.</p>\n<p>She’s supposed to be meeting with Jesse later to hash out some stuff he did over the weekend, but her thoughts feel like they’re running in a million different directions and she’s having trouble grasping onto one long enough to concentrate.</p>\n<p>After about twenty minutes of her just sitting there and tapping at the trackpad of her laptop without actually doing anything, she decides she can be done until she has to meet up with Jesse later. She pushes out of her chair and opens the studio door, stopping in her tracks when she hears a familiar song echoing down the hall.</p>\n<p>The beat pulls her in and she follows it to Chloe’s room. The door is open so Beca leans against the frame and crosses her arms. Chloe’s standing in front of her mirror doing her eyeliner, her voice mixing lightly in the air with the music.</p>\n<p>“You know David Guetta?”</p>\n<p>Chloe glances up and meets her eyes in the mirror. She smirks. “What, have I been living under a rock?” Beca grins and shakes her head as Chloe purses her lips in the mirror. “I need your opinion, Bec.”</p>\n<p>Beca raises an eyebrow. “Fire away?”</p>\n<p>Chloe spins around so they’re face to face and rolls her eyes. “Clever. Okay, but how do I look right now?”</p>\n<p>“You look great,” Beca says automatically, and she means it. Chloe always looks great.</p>\n<p>Chloe sighs in frustration as if to say that Beca should humor her. Beca bites her lip to keep from smiling. “Seriously, Becs. Do you think these jeans are too casual?”</p>\n<p>“Well,” Beca says, quirking her eyebrows. “That’s kind of relative. Too casual for what? The Oscars? Because yeah, dude, I’m pretty sure you gotta wear designer for your red carpet debut.”</p>\n<p>“<em>Beca</em>,” Chloe chastises, one hand coming on her hip and cocking it to the side. “I have to look presentable. I’m meeting with Principal Mueller today.”</p>\n<p>Beca crinkles her nose. “What for?”</p>\n<p>Chloe shrugs, trying for nonchalance but falling short. “He didn’t say. So let’s hope I’m not getting fired.”</p>\n<p>“Oh, come on. You’re not getting fired.” If Beca knows anything, it’s that. Chloe’s the best teacher around. Not that Beca’s ever been to any of her classes or anything, obviously, but it’s <em>Chloe</em>. There’s no way anyone in their right mind could fire her.</p>\n<p>Chloe doesn’t say anything, just turns back around to look in the mirror, her head tilting to the side. Beca steps into the room a little more.</p>\n<p>“And I was being serious,” Beca adds as Chloe fusses with her hair. “You look great.”</p>\n<p>And she does. Beca loves when Chloe wears her hair like that, the ends falling in waves across her shoulders. It reminds her of when they first met, back during Beca’s freshman year when Chloe was going to stop at nothing to make sure they were friends.</p>\n<p>And her eyes are obviously always a really gorgeous blue, eyeliner or no eyeliner. And like yeah, Chloe’s always been able to wear a pair of jeans and the ones she’s wearing now hug her butt in an especially nice way that Beca thinks is awesome.</p>\n<p>And okay, Beca is kind of gay sometimes, but honestly, Chloe looks great <em>all</em> the time. It’s just a fact.</p>\n<p>“Quit staring at my butt.”</p>\n<p>Beca’s eyes snap up and meet Chloe’s in the mirror. She feels her cheeks burn hot when Chloe winks at her.</p>\n<p>Chloe holds her gaze for a second before shifting to look at herself again. Beca watches her bite her lip and she realizes Chloe is nervous, which is something she hasn’t seen in a few years.</p>\n<p>Not since Worlds anyway.</p>\n<p>“I’m sure whatever she wants to talk to you about will be fine, Chlo.”</p>\n<p>“Yeah, I’m sure it will be, too.” Chloe purses her lips like she wants to say something, but she just ends up repeating, “yeah,” again really quietly as she tugs a little at her shirt.</p>\n<p>The action makes something pull inside Beca because for the past couple of days, Chloe’s just seemed… <em>off</em>. “Is everything else okay with you?” She asks cautiously, hoping to not bring on any tears. Beca’s definitely had enough of <em>those</em> in the past few days and anything she experienced with Emily would be one hundred times more uncomfortable with Chloe. Beca <em>hates</em> when Chloe cries more than she hates anything. Even romcoms.</p>\n<p>Chloe just hums in response, though, seemingly unaffected. “Uh huh.”</p>\n<p>“Okay…” There’s practically alarm bells ringing in Beca’s head at this point, but she doesn’t know what to do because while she has a lot of practice dealing with Chloe saying too much, she doesn’t have any practice with Chloe not saying anything. Chloe’s never <em>not</em> said something before.</p>\n<p>Eventually Chloe seems to be satisfied that she looks fine and she turns around, expression clearing into the easy-going one that Beca’s used to. She grabs her bag off the bed and when she meets Beca’s eyes again, she’s smiling.</p>\n<p>“Don’t worry about it,” Chloe says and runs her finger between Beca’s eyebrows. “You’ll get premature wrinkles.”</p>\n<p>Beca swats at Chloe’s hand lightly. “Stop it.”</p>\n<p>Chloe just grins, leaning down slightly to press a kiss to Beca’s cheek. Heat flares to the spot automatically and Beca shivers.</p>\n<p>“I’ll talk to you later,” Chloe says against her hair and it makes Beca feel more off-balance than usual.</p>\n<p>“Okay,” she manages to choke out and heat rushes through her again, simmering in her stomach and flowing up her neck.</p>\n<p>Chloe winks at her again and breezes past her, leaving Beca confused and with her mouth hanging open, wondering what the hell is <em>happening</em> to her.</p>\n<p>//</p>\n<p>If there’s one things Beca absolutely loathes about Los Angeles, it’s the traffic.</p>\n<p>She taps restlessly on her steering wheel, the music on the radio doing nothing to calm her down.</p>\n<p>She’d been just getting ready to leave Jesse’s when Chloe had texted her, and if the text hadn’t made her tense enough as it is, now she has to sit through this craptastic traffic with the cacophony of horns echoing across the freeway every minute.</p>\n<p>She sighs and glances down at the phone in her lap, Chloe’s text still open on the screen.</p>\n<p><strong>Chloe (7:21pm): </strong>Come home ASAP!!</p>\n<p>She’d quickly responded, <em>is everything okay?</em> but so far Chloe hadn’t texted back and she’s kind of freaking out.</p>\n<p>After what feels like forever (or at least the longest twenty minutes of her life), she finally pulls into the driveway and slides out of her car.</p>\n<p>“Chloe?” She calls as she opens the door.</p>\n<p>“In the kitchen!”</p>\n<p>Beca didn’t realize how fast her heart was beating until it started to slow. Chloe at least sounded fine. Still, she hurries to the kitchen, part of her bracing for the worst when she pokes her head around the corner.</p>\n<p>Turns out she’d worried for nothing, though, because Chloe is standing over the sink tossing a salad and smiling to herself. She’s still in the outfit she’d left in that morning. Beca tries not to stare at her butt again.</p>\n<p>“What’s going on?”</p>\n<p>Chloe glances over her shoulder, shooting Beca a smile so bright that Beca feels her own lips instinctively pull upward.  “I got pizza. And wine.”</p>\n<p>“I see that.” Beca raises her eyebrows. “Why?”</p>\n<p>“Because,” Chloe beams. “We’re celebrating!”</p>\n<p>Beca tries not to think about how well everything turned out last time they celebrated, and instead focuses on the fact that Chloe clearly has some good news. “Celebrating what exactly?”</p>\n<p>“Principal Mueller has decided to let me teach an a cappella class next year!”</p>\n<p>Beca smiles slightly, taken aback by Chloe’s clear excitement. “That’s a class?”</p>\n<p>“Yes!” Chloe grins. “It’s basically like the Bellas, but we meet during class instead of in the afternoon like a club. There are competitions and stuff.”</p>\n<p>“So like, <em>Glee</em>?”</p>\n<p>Chloe’s eyes flash sternly, but her smile remains in place. Beca think she looks half-crazed. “If you had even watched an episode of <em>Glee</em> with me then you’d know that that’s not a cappella. It’s very competitive, Beca.”</p>\n<p>Beca holds her hands up innocently. “I believe it.” She crosses her arms, shaking her head in amusement. “Well congrats dude.”</p>\n<p>“Thanks. I’m really excited,” Chloe gushes. “I just hope I do an okay job. I’m a little rusty.”</p>\n<p>Beca doesn’t believe that for a second, if Chloe’s shower singing is anything to go by. Still, even if she was rusty, it’s clear that her enthusiasm would be enough to make up for it. “I’m sure you’ll be the best a cappella coach ever.” She hopes Chloe knows she means it and isn’t being sarcastic. For once.</p>\n<p>Chloe crinkles her nose happily so Beca thinks she gets it. It’s super cute and Beca can’t help but smile back at her.</p>\n<p>“But next time, don’t text me like that,” Beca says. “I almost love-tapped some idiot on the highway to get back here quickly.”</p>\n<p>Chloe tilts her head to the side. “Aw, you were worried about me?”</p>\n<p>Beca rolls her eyes exasperatedly. “You said ASAP, which inherently suggests a sense of urgency, Chlo.”</p>\n<p>Chloe just gives her this sappy smile that makes embarrassment crawl up Beca’s neck. She looks away, anywhere but at Chloe, eyes landing on the pizza and wine sitting on the island. “Wanna get drunk?” She smirks and glances back at Chloe.</p>\n<p>“Duh.”</p>\n<p>Chloe grabs plates and puts some salad and pizza on each while Beca pours the wine. They migrate to the living room and Chloe turns on one of the music channels that Beca gets on her TV. Top 40s hits start streaming through the speakers and Beca turns to Chloe and raises her glass.</p>\n<p>“To your success,” she says.</p>\n<p>Chloe beams at her, shaking her head. “To <em>our</em> success.”</p>\n<p>Beca grins back. “To our success.”</p>\n<p>//</p>\n<p>“Beca?”</p>\n<p>“Hmmm?”</p>\n<p>“I’m drunk.”</p>\n<p>Beca grins lazily, her eyes fluttering closed as Chloe’s fingers tangle with hers. “Me too.”</p>\n<p>Chloe watches her, letting her eyes roam over Beca’s face, from the sharp outline of her nose and down to her lips. They look soft. She wants to kiss them.</p>\n<p>But she’s drunk and Beca’s drunk and they’re laying on the floor and maybe it’s not the right moment. It’s just been a long time since she’s kissed anyone. She wonders how long it’s been since Beca’s kissed someone.</p>\n<p>“Beca?”</p>\n<p>“Hmmm?”</p>\n<p>“Why didn’t it work out with you and Jesse?”</p>\n<p>Beca’s eyes blink open and she rolls over on her side so she can see Chloe. Beca stares at her with pursed lips for a long time and Chloe thinks she might not answer, but eventually her lips thin out and she shrugs.</p>\n<p>“I dunno,” she says finally. “I think we just stopped loving each other in that way, or whatever.” She quirks her eyebrows. “We’re better as friends.”</p>\n<p>“Because you started as friends?” Chloe’s stomach flips in disappointment. She tries to pretend it doesn’t.</p>\n<p>Beca shakes her head, though. “No I don’t think so.” She bites her lip. “Okay, you know when we were getting ready to go on the stage at Worlds? And Fat Amy was giving that weird speech and we were just kind of standing there and smiling at each other and everything around us seemed so big and like the future might go on forever, but we were just <em>there</em>, like in that moment and it was a bubble of just us and the Bellas and the music?”</p>\n<p>Chloe smiles at the memory. “Yeah, that was the best moment of my life.”</p>\n<p>“Yeah, mine too.” One corner of Beca’s mouth pulls up in a half-smile, her eyes softening at Chloe. Beca shrugs self-consciously. “Jesse just didn’t make me feel like that moment anymore, I guess.”</p>\n<p>They hold eye contact for a second, Beca’s eyes flicking back and forth between hers. Then she squeezes Chloe’s hand and looks away, back up at the ceiling. “It was pretty mutual, I think,” Beca says. “I didn’t make him feel the way movie endings make him feel, either. I wasn’t the best part, you know?”</p>\n<p>Chloe crinkles her nose and shakes her head. “You’re the best part for me,” she says lightly.</p>\n<p>Beca’s mouth falls open a little and her cheeks flush bright red and Chloe briefly wonders if she said too much.</p>\n<p>But they’re drunk and laying on the floor holding hands, and their dog that they own <em>together</em> is sleeping in the corner, and it just felt right.</p>\n<p>Beca doesn’t seem to really mind, she just grins and avoids Chloe’s eyes. “Wanna do something dumb because we’re drunk and we can and it’ll piss Lindsey off?”</p>\n<p>“Duh,” Chloe says even though she doesn’t really want to make Lindsey mad, but maybe it’s becoming tradition and Chloe’s a sucker for Beca’s smile.</p>\n<p>Beca grabs her phone and tugs Chloe into a sitting position. “Honestly, the only good time to take selfies is when it pisses off Lindsey.”</p>\n<p>“Beca,” Chloe tries to sound disapproving, but it ends up just being this soft whisper. Beca grins at her and hands her phone to Chloe.</p>\n<p>“Here, you have longer arms.” Chloe snorts and Beca rolls her eyes. “Shut up. Okay, do something cute.”</p>\n<p>Chloe giggles. “I don’t think I’m the one in this relationship who needs to work on that.”</p>\n<p>Beca side-eyes her. “Take the picture or I’ll tell Po to bite you.”</p>\n<p>“Po doesn’t listen to you,” Chloe laughs and Beca nudges her side with her elbow. “Okay, okay!”</p>\n<p>Chloe holds the phone up and presses her lips to Beca’s cheek. She closes her eyes and taps the capture button. “There,” she says, pulling away. Beca takes the phone back and Chloe leans her head on Beca’s shoulder to look at it.</p>\n<p>“This is the most coupley photo I’ve ever taken,” Beca mutters and snorts out a laugh. Chloe looks down at the phone, grinning at Beca’s open-mouthed smile as Chloe kisses her cheek. It’s super cute and Chloe is immediately obsessed with it.</p>\n<p>“Oh my God, we’re so cute,” she gushes. “Send it to me.”</p>\n<p>“One sec, gotta upload it first.” She shares it to Instragram with the caption “<em>if I’m gonna be stuck with someone forever, then it’s good we at least look cute together… @gingrspiceandevrythingnice</em> <em>#lovebirds”</em> and links it to her Twitter.</p>\n<p>Chloe smiles into Beca’s shoulder. “Lindsey is going to kill you.”</p>\n<p>Beca smirks. “Well, that’s what she gets for perpetuating this shit. And whatever, I can take her.”</p>\n<p>Chloe shoots her a skeptical grin. “Okay, Tiny Terror.”</p>\n<p>“Fight me,” Beca scoffs and it’s the furthest thing from tough Chloe’s ever heard. Laughter bubbles up her throat and she pokes Beca in the side, watching as she squirms. “Chloe, no! No!” Chloe just digs her fingers in harder. Beca yelps and it’s so un-Becalike that Chloe feels her own sides start to ache with laughter.</p>\n<p>“Po, attack!” Beca pushes her hands away and tries to crawl across the floor. Po doesn’t even lift his head, just stares at them with clear apathy. Beca flops down on her stomach. “Ugh no. I’m too drunk for this.”</p>\n<p>Chloe grins. “Sucks.” She sits on Beca’s butt. “But yeah, Becs, you <em>totally</em> can take Lindsey.”</p>\n<p>“I want a divorce,” Beca scowls into the carpet.</p>\n<p>“Not a chance, Mitchell.” Chloe laughs, feeling carefree and happy like the swelling of the chorus in her favorite songs. “Po, come!” She taps Beca’s back with her palm and Po pushes himself up, trotting over to them with a wagging tail. He licks at Beca’s face and she sputters. Chloe’s cheeks hurt from smiling too much. “Good dog, Po!”</p>\n<p>“No!” Beca shouts. “Bad dog, Po! Bad dog!”</p>\n<p>Chloe decides to spare Beca and tugs at Po’s collar gently, pulling him away. She slides off of Beca and leans against her side instead.</p>\n<p>Beca groans, face still hidden in the carpet. “I hate you so much.”</p>\n<p>Chloe just grins. “Love you, too.”</p>\n<p>And if she means that in more ways than one, well, she’s just going to have to deal with that tomorrow.</p>\n<p>//</p>\n<p>December arrives quicker than she expected. Before she knows it, Beca’s hurrying to get her Christmas shopping done and frantically trying to finish laying down the theme of the score with Jesse before she has to go to New York next week.</p>\n<p>She’s been locked in her studio for the past two days, and she’s busy and tired, but she’s proud of what her and Jesse have created and she can’t wait to show it to Chloe.</p>\n<p>Beca blinks at the thought, eyes ungluing from her laptop screen to check the time.</p>\n<p><em>Fuck</em>.</p>\n<p>She’s totally going to be late.</p>\n<p>She quickly saves and closes her laptop, hurrying to get dressed into acceptable clothes to wear to a concert. Or a choir concert at least. Chloe’s student’s winter choir concert.</p>\n<p>So like, jeans a nice jacket.</p>\n<p>Good enough.</p>\n<p>She hurries out the door and minutes later, she’s speeding down the street, praying that the cops don’t pull her over because then she’d <em>really</em> be late, and Beca’s never exactly prepared to confront a disappointed Chloe, so that just is not an option.</p>\n<p>She follows her GPS to the school Chloe teaches at and immediately feels like she’s probably underdressed because it’s super nice. Beca rolls her eyes. Private schools, man.</p>\n<p>When she walks in the school, she follows a sign to the auditorium and an elderly woman hands her a program and directs her to a seat on the end toward the back of the room.</p>\n<p>She settles in and gets comfortable just as the lights go down and the stage lights come on, revealing a bunch of kids in their school uniforms standing on a set of risers. Beca bites her lip to keep from smirking.</p>\n<p>Chloe walks onto the stage and for a second Beca feels her mouth drop open. Chloe’s wearing this dark green dress and her hair falls across her shoulders in ringlets of red. Her smile is bright under the stage lights and Beca’s heart gives a few extra forceful beats in her chest.</p>\n<p>She blinks a little, but when she opens her eyes, Chloe’s still standing there looking as gorgeous as ever.</p>\n<p>Chloe taps on the microphone in front of her, crinkling her nose when it causes a muffled thump noise to echo throughout the auditorium. “Hello, everyone,” she says into the microphone, her hand raising in a small wave. “Some of you may know me from the last concert, but if not, then I’m Ms. Beale and thanks for coming tonight! We’ve been working really hard on this stuff the last couple of weeks, so I hope you enjoy it! If you’re feeling extra charitable this season, there’s a table in the lobby where you can donate to the Red Cross. Thanks again and enjoy the show!”</p>\n<p>Chloe sets the microphone back on the stand and turns around to face the kids. Someone starts playing the piano on the side of the stage and Chloe starts to conduct, her hands gesturing at the altos to begin.</p>\n<p>The kids sing a few Christmas songs that Beca recognizes, one she doesn’t, and two songs in another language that could be satanic chants for all Beca knows.</p>\n<p>The choir is pretty good, Beca admits, and she feels herself soften around the edges. Her chest swells with pride as the audience claps loudly after a song. Chloe smiles at the applause and pats the soloist on the shoulder with a thumbs up as he walks back to his spot on the risers.</p>\n<p>“That’s my son,” the lady next to her whispers and Beca grits her teeth so that she doesn’t roll her eyes. Good for you, lady.</p>\n<p>“He’s very good,” she says instead, smiling politely.</p>\n<p>The lady nods. “They sound wonderful, don’t you think?” Beca just nods. “You must be very proud of your son or daughter.”</p>\n<p>Beca’s eyes widen and she feels slightly offended because she definitely <em>does not</em> look old enough to have kids. “Oh, no. I’m not.. I don’t have kids.” She awkwardly points at Chloe. “Ms. Beale is my…” Beca knits her eyebrows together. “Fiancée,” she finishes lamely.</p>\n<p>“Oh!” The lady covers Beca’s hand with her own. Beca pulls away. “Well, congratulations! Ms. Beale is <em>stunning</em> and Michael just loves her.”</p>\n<p>Beca blinks and tries to smile again, which is surprisingly not as difficult as she expected. Chloe <em>does</em> look stunning and <em>obviously</em> her son loves her. Everyone loves Chloe.</p>\n<p>“Thank you,” Beca replies, and is luckily saved from having to say anything as Chloe starts talking into the microphone, thanking everyone for coming again. She urges them all to donate and Beca honestly wouldn’t be surprised if most of the audience does. Not when Chloe’s smiling like that, all pretty and sincere.</p>\n<p>Finally it’s over, and the audience starts to trickle out into the lobby. There’s a long line at the donation table and Beca just shakes her head because of course.</p>\n<p>She hovers near the wall and eventually some of the kids start to appear, looking for the parents and hugging each other. Beca rolls her eyes at all the dad’s giving their daughters flowers. Her dad may not have been like, the total best dad ever, but at least he never gave her flowers because gross.</p>\n<p>“Are you Beca Mitchell?”</p>\n<p>Beca’s eyes focus on the figure in front of her, a tall girl with long black hair. She’s in a school uniform, but she’s clearly trying to rebel against that whole de-individuality thing because she has the sleeves of her shirt pushed up to her elbows and Beca would guess that her black Chucks are not standard uniform.</p>\n<p>“Uh.” Beca darts her eyes to the side before looking back at the girl. “Yeah?”</p>\n<p>The girl bites her lip, her eyes mimicking Beca’s in the way she looks away before coming back to stare at her. “Could I have an autograph?”</p>\n<p>Beca’s eyes widen in surprise. “An autograph?”</p>\n<p>“Yeah?” The girl shifts uncomfortably, which like, Beca totally gets. “Umm, <em>On the Rocks</em> is like, my favorite album.”</p>\n<p>“Oh,” Beca says, finally getting it. “Oh. Yeah, dude, totally.”</p>\n<p>The girl smiles and takes her backpack off her shoulder, rummaging inside it for a minute. She pulls out some notebook paper and a pen and hands it to Beca.</p>\n<p>Beca’s not usually one to get sappy, but like someone <em>recognized</em> her, and asked for her autograph, and told her that Beca’s album is her favorite.</p>\n<p>“What’s your name?” She asks.</p>\n<p>The girl shoots her a little smile. “Uh. Beth?”</p>\n<p>Beca smirks playfully. “You don’t sound too sure.”</p>\n<p>“I’m sure,” the girl says, smiling back at Beca. Beca turns to the wall and scribbles a quick note on the paper and signs her name at the bottom. She hands it back to the girl. “Thanks,” Beth says.</p>\n<p>Beca grins. “What’s your favorite song on the album?”</p>\n<p>“Well I really like all of them, but my favorite is probably Catch-Up. I don’t know,” the girl gushes, suddenly extremely enthusiastic. “I just love the sound on that song, like the lyrics are great obviously, but the music just fills these spaces in my chest that I didn’t really know were there before and I just feel so… so, like, present, or something when I listen to that song. You feel me?”</p>\n<p>Beca kind of just stares because she totally knows the feeling. It’s what drew her to music in the first place. “Yeah, I… feel you,” she says.</p>\n<p>The girl opens her mouth to reply, but a voice calls over the chatter of the lobby. “Beth, let’s go!”</p>\n<p>Beth kind of frowns, but then shrugs. “I gotta go. That’s my mom and she has to pay the babysitter.” She smiles at Beca. “Thanks again. And also you and Ms. Beale are really cute together. I see your pics on Insta.”</p>\n<p>Beca blinks in surprise. “Oh. Thanks.” She smiles at Beth, who waves over her shoulder as she walks away.</p>\n<p>A second later, arms loop around her waist and a chin digs into her shoulder. “Oh my God, did you just meet Beth?”</p>\n<p>Beca turns her head to the side, her nose inches from Chloe’s. “Hi Ms. Beale.”</p>\n<p>Chloe grins. “Isn’t she cute? She’s like my favorite, but don’t tell the others.”</p>\n<p>Beca snorts and is about to respond, but the lady who was sitting next to Beca during the show walks up to them. “Ms. Beale!”</p>\n<p>Chloe’s chin lifts up from Beca’s shoulder, but she doesn’t move her arms. Beca leans away from the woman and further into Chloe in hopes that the woman doesn’t touch her again.</p>\n<p>“I’m Michael’s mother and I just wanted to say that you put together a beautiful concert!”</p>\n<p>“Oh,” Chloe says, voice bubbly in Beca’s ear. “Well thank you. Michael did a great job tonight.”</p>\n<p>“Thank you,” the woman gushes, clearly proud of her son. Beca tries to keep her face passive as to not give away her disgust. “Me and your fiancée made friends tonight, and I have to say, she is definitely a keeper. She seemed very smitten with you the whole concert.” She winks at Beca who imagines she’s a darker shade of red than a stop sign.</p>\n<p>She feels Chloe smile against the side of her head. “Oh, she was, was she?”</p>\n<p>Beca scowls, she can’t help it.</p>\n<p>The woman smiles at them knowingly. “You’re a beautiful couple.” She waggles her fingers at them. “Have a good holiday!”</p>\n<p>“Bye!” Chloe calls. Beca steps out of the hug and turns around to face her. Chloe flashes her a smile and Beca almost caves, but she bites the inside of her cheek to keep from grinning. She’s already <em>blushing</em>. Ugh.</p>\n<p>“So,” Chloe says, drawing out the word. “Did you like it?”</p>\n<p>Beca raises an eyebrow. “Of course I did, Chlo.” She shrugs. She doesn’t love choir concerts really, but she loves Chloe, so obviously she liked it enough. She clears her throat. “And you look super beautiful, by the way.”</p>\n<p>Chloe grins and looks down at her dress. “Don’t you love this dress? It’s so pretty.”</p>\n<p>Beca didn’t really mean the dress, but she nods anyway. “Yeah, totally.”</p>\n<p>Chloe’s eyes twinkle knowingly. “Well, I’m glad you had a good time.”</p>\n<p>“Yeah,” Beca says. “Me, too.”</p>\n<p>Chloe points back toward the auditorium. “I have to help them put those risers away, but I’ll see you at home?”</p>\n<p>“Sure,” Beca nods. “Umm, I can like, pick us up some food and then I’ll meet you there.”</p>\n<p>“Okay,” Chloe says, eyes going soft as they meet Beca’s. Beca can’t really look away. “I’ll see you there then.” She gives Beca a kiss on the cheek, winking as she pulls away. Beca’s cheeks feel like they’re on fire and she clears her throat, watching as Chloe walks away.</p>\n<p>The whole drive home she feels Chloe’s arms around her waist and her lips on her cheek and her stomach feels all weird like something inside of her has shifted.</p>\n<p>When she finally pulls into the driveway, she’s still trying to figure out what.</p>\n<p>//</p>\n<p>“Do you have everything?”</p>\n<p>“Yep.”</p>\n<p>“What about your toothbrush?”</p>\n<p>“Yes.”</p>\n<p>“Laptop charger?”</p>\n<p>“Uh huh.”</p>\n<p>“Christmas spirit?”</p>\n<p>“Chloe.” Beca rolls her eyes as Chloe closes the trunk of the car and hands Beca her suitcase, wheeling it over the pavement of the drop-off line at LAX. “I have everything. And if I don’t, well it’s too late now.”</p>\n<p>Chloe purses her lips, messing with the straps of Beca’s bag. “I guess you’re right.” She adjusts Beca’s bag one more time, smoothing the strap on her shoulder. “This trip is just so important. I want everything to be perfect for you.”</p>\n<p>Beca shrugs. “It’s gonna be all good, I promise.” Except for the part where she’s on TV, but if she doesn’t think about it too much, then she’ll be fine.</p>\n<p>“Okay,” Chloe says softly. She gives Beca a watery smile. “I’m gonna miss you, Bec.”</p>\n<p>“I’ll miss you, too.” Beca squeezes Chloe’s arm. “It’s only a week. It’ll be fine.”</p>\n<p>Chloe nods and takes a deep breath, which seems to help. She puts on a brave smile that has Beca’s heart aching.</p>\n<p>“So, I left your Christmas present on my dresser,” Beca says. “You can’t open it until Christmas, though.”</p>\n<p>Chloe nods, smiling coyly. “Don’t worry, I remember our deal.”</p>\n<p>Beca narrows her eyes though because Chloe sucks at waiting for surprises. “Swear?”</p>\n<p>“Swear,” Chloe says, holding up her pinkie. Beca rolls her eyes, but twists her own around Chloe’s.</p>\n<p>“Alright.” She glances at her watch. “I should probably get going.”</p>\n<p>Chloe pouts, but nods and tugs Beca closer by the collar of her jacket. Beca leans into the hug, her arms looping around Chloe’s waist. Something swoops in her stomach, which has been happening a lot recently when Chloe hugs her. It doesn’t feel bad, it just throws Beca off, like she’s trying to walk on ice or something.</p>\n<p>“Don’t feed Po human food while I’m gone,” Beca says into Chloe’s shoulder. “He’s going to get fat.”</p>\n<p>Chloe giggles in her ear. “No promises.” She squeezes Beca really hard around the middle and Beca squeezes back.</p>\n<p>When they pull away, she gives Chloe a small smile. “I’ll let you know when I’m getting on the plane.”</p>\n<p>“And when you get off the plane. And when you get to the hotel. And when you meet Seth Meyers.”</p>\n<p>Beca smirks. “Don’t worry, dear,” she says sarcastically. “I’ll let you know every time I breathe, too.”</p>\n<p>Chloe points at her sternly. “You better.”</p>\n<p>Beca shakes her head, grinning. “Okay I will.”</p>\n<p>“Good.” Chloe hugs her again really quickly, then gives her a little push toward the door of the airport. “Okay, now get out of here. Go be successful and famous somewhere else.”</p>\n<p>“Alright, alright.” She grabs her suitcase and tosses a wave and a smile over her shoulder, but Chloe has already gotten into the car and is merging back into traffic.</p>\n<p>As Beca watches the car drive away, she wonders why it feels like she’s forgetting something.</p>\n<p>//</p>\n<p>Chloe spends the next two days trying to keep busy. She takes Po on his walks and gets some last minute Christmas shopping done for her family. She goes to Pilates and tries to think of some possible song arrangements for her classes next semester.</p>\n<p>She spends a lot of time thinking about how much her life has changed in the past couple of months. Los Angeles has become her home in so many ways that it feels weird to think about going back to Atlanta, even for a few days.</p>\n<p>Still, as she drives on the freeway with her windows open and music blasting, or settles down in the evening to watch Chopped with a glass of wine, she can’t help but feel lonely. The place feels empty without Beca’s shoes messily cluttered by the door and the soft vibrations of a bassline shaking the hallway.</p>\n<p>Chloe knows it’s only been a few days, but she misses Beca’s half-smile and her sarcastic scowls and her constant tap-tapping on every surface within reach.</p>\n<p>As the days extend, Chloe becomes more and more certain that the things that make Los Angeles feel like home aren’t the things about the city that make it <em>feel like home</em>.</p>\n<p>It’s <em>Beca</em> that makes this place feel like home, like something she wants to keep coming back to, a feeling that she doesn’t want to be without.</p>\n<p>She’s never felt like this way about anything before, not even music, but as she curls up in her bed at night, Po sleeping in the corner and Beca’s music in her ears, she recognizes the feeling exactly for what it is.</p>\n<p>She’s in love.</p>\n<p>//</p>\n<p>Chloe’s in line at Starbucks when she gets the first message.</p>\n<p><strong>Becs (2:18pm): </strong>I’m about to meet Seth.</p>\n<p>Chloe grins and is about to reply when another text comes through.</p>\n<p><strong>Becs (2:18pm):</strong> I think I’ve turned into Aubrey. I’m gonna throw up.</p>\n<p><strong>Chloe (2:19pm): </strong>You’re going to be fine!! :)</p>\n<p><strong>Becs (2:20pm): </strong>New York is freezing and I’m wearing my leather jacket but I’m so nervous I’m sweating right through it</p>\n<p><strong>Chloe (2:21pm): </strong>So just take it off, Becs.</p>\n<p>She expects another reply, but nothing comes and by this time, she’s ordered her coffee and sat down outside.</p>\n<p>She checks Facebook and Instagram on her phone and finally it buzzes with a text.</p>\n<p><strong>Becs (2:29pm): </strong>NO I have pit stains.</p>\n<p><strong>Becs (2:30pm): </strong>[Image Attachment]</p>\n<p>Chloe clicks the picture to enlarge it, gasping a little as it grows on her screen. It’s a selfie of Beca and Seth Meyers, and Chloe rolls her eyes because neither of them are smiling, just staring straight-faced into the camera. She wonders if Beca told him not to smile just to make Chloe laugh.</p>\n<p>Either way, she grins and she immediately starts responding.</p>\n<p><strong>Chloe (2:31pm): </strong>!!!!!!!!!!!!!!!!!</p>\n<p><strong>Chloe (2:31pm): </strong>OMG</p>\n<p><strong>Chloe (2:31pm): </strong>YOU’RE WITH SETH</p>\n<p><strong>Becs (2:32pm): </strong>Excuse you. Seth is with ME</p>\n<p>She snorts as another text comes through.</p>\n<p><strong>Becs (2:33pm): </strong>It just started filming though and I’m going on soon so I’ll talk to you after.</p>\n<p><strong>Chloe (2:34pm): </strong>Kk. You’re going to be great. I love you. Please try to SMILE on-screen</p>\n<p><strong>Becs (2:35pm): </strong>Don’t tell me what to do</p>\n<p>Chloe shakes her head, ready to put her phone away, but it buzzes again.</p>\n<p><strong>Becs (2:35pm): </strong>I love you too.</p>\n<p>//</p>\n<p>Chloe doesn’t usually watch late night TV, except for Jimmy Fallon sometimes, so it feels weird to turn on NBC as the news is ending.</p>\n<p>It feels even weirder that she’s turning it on to watch Beca.</p>\n<p>Beca had called after the show filmed and Chloe had asked how it went, but Beca wouldn’t tell her much other than that it was all a blur and she might’ve blacked out during it because she can’t even remember what she said.</p>\n<p>Chloe doesn’t believe her really because Beca’s always been fine in front of big audiences, nervous but not panicky like Aubrey.</p>\n<p>She’s sure Beca just doesn’t want to tell her what they talked about.</p>\n<p>“Just tell me. I’m going to watch it anyway,” Chloe had whined, but Beca had just laughed into the phone.</p>\n<p><em>“You can wait until it airs just like everyone else.” </em>Beca teased, but still wouldn’t tell Chloe anything more than that she may have mentioned Chloe a little and talked about some embarrassing stuff. <em>“But that’s all I’m saying,</em>” Beca told her.</p>\n<p>Needless to say, she’s more than a little curious.</p>\n<p>Seth goes through his opening jokes and stories, and he has Chloe laughing, but she’s anxiously awaiting the moment that Beca comes on screen so she’s not paying too much attention. She barely even notices when Po jumps on the couch and puts his head in her lap.</p>\n<p>After a commercial break, Seth finally gets down to it. “Now please welcome music artist and producer, Beca Mitchell!”</p>\n<p>Chloe leans forward as Beca appears on her screen. She feels her heartrate pick up and a smile grow on her face. Beca’s wearing her leather jacket, just like she said, over a purple top and black skinny jeans. Her hair falls straight over her shoulders and she looks so cool and so pretty and so <em>Beca</em>, Chloe almost dies.</p>\n<p>“Hi,” Beca says, waving at the audience a little and turning to Seth as she sits down. “Thanks for having me.”</p>\n<p>“Yeah, it’s your first time!” Seth gives her his signature giant stage-smile.</p>\n<p>“It is!” Beca says. Chloe cheeks hurt from smiling.</p>\n<p>Seth leans closer. “So it is your first time on the show, but it’s not your first time national television, is that right?”</p>\n<p>Becs nods, laughing a little. “Unfortunately, no.”</p>\n<p>Seth clearly knows where Beca is going, but he tilts his head to the side curiously. “That’s right, I heard you had quite an embarrassing moment last time you were on TV.”</p>\n<p>“Embarrassing is probably an understatement,” Beca grins and turns to the audience. “For those of you who don’t know, I used to do collegiate a cappella, and we were pretty good, so we were performing for the President on his birthday – ”</p>\n<p>“For the President?” Seth interrupts. “So very good is probably an understatement.”</p>\n<p>Beca grins. “I mean, we won like three national titles and were named World Champions, so we’re kind of the best but…” Beca shrugs nonchalantly, then grins. The audience laughs lowly.</p>\n<p>“Okay, sorry, sorry, continue.”</p>\n<p>Beca taps her hands on her legs and Chloe smiles at the action. “Right, so, we got asked to perform for the President, and we had this bit where one of our singers comes down on these aerial ribbon things, but there was a malfunction and her pants ripped and she wasn’t wearing any underwear.”</p>\n<p>“Oh no!” Seth laughs. “In front of President Obama.”</p>\n<p>Beca nods solemnly, her eyes wide, even as the audience erupts in laughter. “<em>In front of President Obama</em>.”</p>\n<p>“You know, I think I remember hearing about that actually.” Seth nods, leaning forward.</p>\n<p>“I’m sure you did. It was all over the news.”</p>\n<p>“Oh man,” Seth chuckles. “Well I hope this time isn’t as embarrassing.”</p>\n<p>Beca shrugs. “So far so good. There’s still time left, though.”</p>\n<p>Seth beams. “Okay, so I hear you just a got a new dog.”</p>\n<p>“I did,” Beca nods, eyebrows quirking. “Potato.”</p>\n<p>Seth frowns questioningly. “Potato?”</p>\n<p>“He already had that name when we picked him up from the pound.” Beca gestures in the air with her hands. “If it was up to me his name would be Biggie.”</p>\n<p>Chloe snorts and scratches behind Po’s ears. “Don’t listen to her, Po,” she says as Seth laughs on-screen.</p>\n<p>“And is the dog good? Or what kind of dog is it?” Seth asks.</p>\n<p>“He’s a boxer,” Beca says. “And thankfully, he hasn’t been too bad, although if it was just me, who knows what kind of trouble he would get into.”</p>\n<p>“That’s right,” Seth says. “You’re engaged.”</p>\n<p>Beca’s lips thin and Chloe knows she’s holding back a smile. “Yes, and Chloe, that’s my fiancée, I swear she’s like the dog whisperer.”</p>\n<p>Chloe laughs.</p>\n<p>“The dog whisperer?”</p>\n<p>“Yeah,” Beca nods. “He refuses to listen to me. I’ll call him you know like, ‘come here, Po!’ and he just stands there staring at me like, all unimpressed. But then Chloe calls him and he comes running in seconds.”</p>\n<p>Seth chuckles. “But he just ignores you.”</p>\n<p>“Completely ignores me!” Beca rolls her eyes for the camera. “You’d think he’d be grateful that I rescued him or something, but he’s made it quite clear I’m his second choice.”</p>\n<p>“Of course,” Seth says. “Okay, so we’re almost out of time, but congratulations on your engagement and on your first album!”</p>\n<p>Beca grins. “Thank you!”</p>\n<p>“Beca’s album is called <em>On the Rocks</em> and it came out in November.” He points to the audience. “So if you’re looking for a last minute Christmas gift, there you go!”</p>\n<p>Beca laughs and they shake hands. The camera pans to Seth. “We’ll be back after the commercial with Bradley Cooper to talk about his upcoming movie, so stick around!”</p>\n<p>The TV cuts to a commercial and Chloe immediately grabs her phone, just as it lights up with a call. She answers immediately.</p>\n<p>“Oh my God.”</p>\n<p><em>“Hey.”</em> Beca’s clearly trying for nonchalance, but she called literally five seconds after it was done, so Chloe’s not fooled. <em>“So, did you see it?”</em></p>\n<p>“Obviously,” Chloe says, her voice getting higher with excitement. “You were so good!”</p>\n<p>Beca chuckles. <em>“I’m so awkward, but Seth did good at making it seem fine.”</em></p>\n<p>Chloe shakes her head even though Beca can’t see her. “Becs, you weren’t awkward. You were funny.”</p>\n<p><em>“I mean, it’s hard not to be funny when you have a story like Kennedy Center in your back pocket.”</em> Chloe can imagine Beca smirking. <em>“Fat Amy does all the work and I get all the credit.”</em></p>\n<p>Chloe scoffs playfully. “Wow, you’re such a good friend.”</p>\n<p>“<em>Oh, I know. She already called me and congratulated me for bringing up her finest moment.”</em></p>\n<p>Chloe lets out a small laugh. “I’m sure she’s proud of you. All the Bellas are.” She smiles to herself. “I know I am.”</p>\n<p>There’s silence on the other end and she hears Beca exhale loudly. <em>“Is it the 29<sup>th</sup> yet?”</em></p>\n<p>Chloe smiles fondly. “I miss you, too.”</p>\n<p><em>“You haven’t opened your Christmas present yet have you?” </em>Beca says and Chloe rolls her eyes at the obvious deflection.</p>\n<p>“No, I promised, didn’t I?”</p>\n<p><em>“Okay, okay</em>.” Beca sighs. <em>“I can’t wait to be back in L.A. I’m freezing my boobs off.”</em></p>\n<p>They talk for a little bit more, but it’s really late in New York with the time-change, and Beca has work to do the next day.</p>\n<p><em>“Oh, by the way,” </em>Beca says just before she hangs up. <em>“I talked to Lindsey and she said we’ll be able to stop this whole engagement thing in the next couple of weeks.</em>”</p>\n<p>Chloe feels her stomach drop. “Great,” she manages to say, but it doesn’t feel great. It feels like a stab to the chest.</p>\n<p>After they hang up, Chloe looks at her phone background, the selfie of her kissing Beca’s cheek, and smiles fondly.</p>\n<p>Chloe’s not sure, but she thinks Beca feels the same way about her that she feels about Beca because Beca is <em>different</em> around Chloe than she is around other people.</p>\n<p>Not that she isn’t like Beca, but she lets Chloe give her hugs and hold her hand whenever she wants and she never says no to hanging out like she does sometimes with Jesse. And sometimes Beca looks at her with these really soft eyes that Chloe’s never seen Beca give <em>anyone</em> and she always makes Chloe feel like she’s the most beautiful girl around, which is just ridiculous because they live in L.A. and the other day they saw Mila Kunis when they were getting coffee.</p>\n<p>The thing is that even if Chloe thinks that Beca might feel the same way, she doesn’t know for sure, because Beca doesn’t like to talk about that stuff ever. Like, Beca barely even says <em>I love you</em> even if Chloe <em>knows</em> that she says it in other ways like making her dinner and coming to her choir concerts and talking about her on live TV.</p>\n<p>And Chloe loves L.A. and she loves Beca and she loves their dog and their house and their life.</p>\n<p>She doesn’t want to screw any of that up just because she feels too much.</p>\n<p>Chloe’s always felt too much and she knows that’s intimidating, especially for people like Beca, but it’s honestly never really been a huge deal before because if someone can’t handle that than they’ll never be able to handle Chloe and it’s not worth her time.</p>\n<p>It’s just that Beca is different, Chloe knows she is, and she just <em>fits</em> with Chloe like she fits with music and singing and driving with the windows down on a warm day.</p>\n<p>She doesn’t want that feeling to go away, so she can’t tell Beca, at least not until she’s <em>positive</em> that Beca feels the same.</p>\n<p>She just doesn’t know how much longer she can last.</p>\n<p>//</p>\n<p>Beca’s glad when her plane finally lands in the terminal at LAX.</p>\n<p>Her time in New York was an adventure, but she’s glad to be home where the weather isn’t freezing and she can sleep in her own bed.</p>\n<p>She catches a taxi home, and the whole drive she listens to her music and wishes that she wasn’t going home to an empty house. Chloe had left for Atlanta that morning, and even though it hasn’t even been a week, she misses her.</p>\n<p>When she finally gets home, she calls for Po, but he doesn’t come. She quirks her eyebrows, setting her suitcase in the hallway and walking into the living room. He’s just lying on his bed with his ears perked up, staring at her.</p>\n<p>“Dude!” She says, going over and patting his head. “You’re like, the worst guard dog ever.”</p>\n<p>He just lets out a huff and lays his head back down.</p>\n<p>“Yeah, yeah, I know.” She mutters. She’d be disappointed to see her instead of Chloe, too.</p>\n<p>She unpacks her suitcase and does some laundry, eventually making herself some dinner. It’s the first night she’s been alone in the house since Chloe moved in and it feels weird.</p>\n<p>She knows she lived here alone for about a year before Chloe came, but she honestly can’t remember what she used to do at night when there wasn’t a built-in best friend to watch shitty TV with and talk to all night.</p>\n<p>It’s weird.</p>\n<p>She just hopes the next few days go by fast so Chloe will come home soon.</p>\n<p>//</p>\n<p>Christmas is boring for Beca. She sleeps in and takes Po on his walk and her and Jesse meet up to grab lunch.</p>\n<p>He gives her Frank Ocean’s new album on Vinyl and she gives him a <em>Casablanca</em> poster. They eat burgers and talk about music and the Wachowski movie. In a rare moment of sentimentality (must be the Christmas spirit), Beca gives him a really big hug when they part ways.</p>\n<p>She’s just really glad they’re friends.</p>\n<p>Around eight, she sets up in front of her laptop with the wrapped present Chloe left for her on the dresser. It’s big and square and kind of heavy, and she can’t even begin to guess what it is.</p>\n<p>Her laptop tells her she has an incoming Skype call and she quickly answers it. It’s kind of blurry, but eventually Chloe’s face appears on the screen.</p>\n<p>“<em>Becs?”</em></p>\n<p>“Hey,” Beca says with a small smile. Beca’s memory didn’t do justice to how pretty Chloe looks. “You’re kind of blurry.”</p>\n<p>Chloe pouts. “<em>You look good on my end.”</em></p>\n<p>Beca smirks. “I look good on every end.”</p>\n<p>“<em>True that.”</em> Chloe giggles.</p>\n<p>Beca softens, her fingers tapping on her legs. She wishes Chloe were here instead. “How was your day?”</p>\n<p><em>“Umm</em>,” Chloe shrugs. “<em>It was fine. My mom cooked a lot and made me eat too many cookies.”</em></p>\n<p>“Dude, lucky.” Beca’s had Chloe’s mom’s cookies and doesn’t know what Chloe’s complaining about.</p>\n<p><em>“Yeah, but get this</em>,” Chloe says, and holds up a book. She can’t really read the title because of the blurriness of the screen. “<em>She also got me this cookbook and expects me to start cooking. And I told her, I was like, ‘mama, Beca cooks almost every night’ and she told me I better make our engagement real, then.</em>”</p>\n<p>Beca laughs. “She’s not still being weird about that is she?”</p>\n<p>“No,” Chloe says, rolling her eyes. “She said she must just be too southern to understand ‘show biz.’” Chloe makes air-quotes around the words ‘show biz’. “<em>She said she’s excited for us, and I was like, mama you know it’s not real, and she goes, ‘I know Chlo, I just like that Beca gal.’ So you can feel good that my mom likes you better than me, probably.”</em></p>\n<p>For some reason, this makes Beca feel insanely proud of herself. She’s usually horrible with parents, but in the few times she met Chloe’s during college, they seemed to hit it off well enough. Chloe’s mom is like the biggest sweetheart ever.</p>\n<p>“Well, if she likes me better than she likes you, she’s crazy.” Beca’s eyes go wide. “Don’t tell her I said that.”</p>\n<p><em>“Okay</em>.” The call focuses slightly more and Chloe comes in a little clearer. <em>“So not that I’m not enjoying talking to you, but can we please open these now?”</em> Chloe holds up the wrapped present Beca left her. <em>“I’m dying here.”</em></p>\n<p>Beca snorts. “Yeah, okay. You first.”</p>\n<p>Chloe beams. <em>“Should I try to guess.”</em></p>\n<p>“No.” Beca rolls her eyes. “You won’t.”</p>\n<p>\n<em>“Is it a mix-cd?”</em>\n</p>\n<p>“I said you won’t be able to.” Beca shakes her head in amusement. She knows Chloe’s just being a shit-head. That size of present is clearly not a CD.</p>\n<p>Chloe sticks her tongue out. <em>“Fine, fine</em>.”</p>\n<p>Beca watches as Chloe begins to unwrap, and she holds her breath in anticipation. Chloe pulls out the sweatshirt Beca got her and holds it up to the camera.</p>\n<p><em>“Oh my God, Becs, where did you get this?!”</em> Beca exhales through a smile. It’s just a green Barden Bellas hoodie that says BEALE on the back, but she hoped Chloe wouldn’t think it was lame or ugly or something.</p>\n<p>“The Bellas started doing them this year and I got Em to make you one.”</p>\n<p><em>“Well, I love it!”</em> Chloe grins and sets it aside before holding up the second part of her present. Beca taps her fingers on her legs again.</p>\n<p>She knows Chloe will like it, she just really hates the anticipation of giving presents. Especially sappy ones.</p>\n<p><em>“Beca,”</em> Chloe says, her voice dipping lowly. <em>“Oh my God.”</em></p>\n<p>Chloe holds the frame up, a collage of pictures of them from their first time winning nationals to them in Copenhagen to that weird drunk selfie they took that Chloe is obsessed with.</p>\n<p>“I figured we could hang it up in the hallway or the living room or something.” Beca shrugs.</p>\n<p>Chloe sniffles a little. “<em>It’s perfect</em>.”</p>\n<p>“Oh my God, dude, please don’t cry!” Beca grins and leans toward the camera. “I swear if you cry I’m hanging up.”</p>\n<p>Chloe shoots her a watery smile. “<em>You know I get emotional about these things.”</em></p>\n<p>Beca holds her hands up. “Well stop!” She laughs and Chloe crinkles her nose cutely.</p>\n<p>\n<em>“Okay, okay. Open yours now.”</em>\n</p>\n<p>“Alright.” Beca grabs the present and pulls it onto her lap. She looks at Chloe on the screen one more time before sliding her finger under the wrapping paper. She bites her lip as she pulls the paper off what appears to be a binder-type scrapbook thing.</p>\n<p>She opens it, her eyes scanning over the first page. It’s a short blurb from that dumb a cappella talk show that used to do reports on them about Beca leading them to win Worlds. She smiles a little and turns the page.</p>\n<p>The next page is a tiny one-line header about the label in L.A. signing her. Underneath is a bigger article that talks about her EP.</p>\n<p>She keeps turning the pages, each one revealing an article or pictures that show her journey from unknown wannabe producer to who she is today, highlighting all of her accomplishments.</p>\n<p>Her throat feels thick and now she’s embarrassed because <em>she’s</em> getting emotional.</p>\n<p>“Chlo, this is.. this...” She looks up to see Chloe beaming at her. “I don’t even have words for this. Where did you <em>find</em> all these?”</p>\n<p>Chloe smiles coyly. “<em>I’m amazing, obviously.”</em></p>\n<p>“Obviously,” Beca repeats, still in awe. “This must’ve taken you forever.”</p>\n<p>Chloe shrugs. “<em>It was worth it. Honestly I almost cried like five times making that. You’ve done some amazing things.”</em></p>\n<p>Beca inhales and holds her breath. She really doesn’t want to cry. Chloe seems to understand.</p>\n<p><em>“I’m so proud of you, Beca</em>.”</p>\n<p>Beca nods, looking up at the ceiling, her eyes watery. “Uh.” She sniffles. “Thanks. For this and…” She exhales roughly. “Just thanks for everything.”</p>\n<p>Chloe smiles fondly at her. “<em>Of course.”</em></p>\n<p>“I…” Beca clears her throat, trying to shake off the emotion welling inside her. “I couldn’t have done this without you.”</p>\n<p>Chloe rolls her eyes. <em>“Yes you could have.</em>”</p>\n<p>Beca chokes out a laugh. “Yeah, maybe. But it really would’ve sucked.”</p>\n<p>Chloe grins. <em>“Merry Christmas, Becs.”</em></p>\n<p>“Merry Christmas, Chlo.” Beca feels herself smiling hugely and she know she probably looks like an emotional sap right now, but she doesn’t care very much for once.</p>\n<p>Chloe’s eyes crinkle with happiness and it makes Beca’s heart feel too-full. “<em>Give Po a big hug for me and I’ll see you in a few days, okay?”</em></p>\n<p>“Okay.” Beca nods. “Bye. I love you.”</p>\n<p>Chloe blinks at her for a few seconds. “<em>I love you, too. See you soon.” </em> She blows Beca a kiss and hangs up, and Beca’s laptop goes back to the homescreen.</p>\n<p>She flips through the scrapbook a few more times, reading all the articles and looking at the pictures. Finally she closes it and sets it on the mantle of the fireplace so she can look at it whenever.</p>\n<p>She lets Po out one last time and gets ready for bed. When she finally crawls under the covers and settles on her back in the dark, she breathes deeply, feeling her chest move up and down with every breath.</p>\n<p>She closes her eyes, but even in the darkness, she sees Chloe’s soft eyes and happy smile, and she lets them lead her into sleep.</p>\n<p>//</p>\n<p> The day after Christmas, Beca takes Po on an extra long walk on the beach. Halfway through, she sits down on the sand to watch the sunset. Po plops down next to her with an exaggerated groan.</p>\n<p>She pulls her knees up to her chest, watching as sun sets the ocean on fire, the waves cascading into glowing embers of orange and yellow before the sun finally dips below the horizon. She sends a snapchat of it to Chloe. <em>Wish you were here</em>.</p>\n<p>She knows it’s to be expected, but she misses Chloe a lot. And like, the past few days, she can’t stop thinking about how much she misses her.</p>\n<p>There’s a spark of lightning in the distance, followed by a crash of thunder, and she stands up, brushing the sand off her legs and pulling lightly on Po’s leash. It’s getting dark anyway and she doesn’t want to be stuck outside if it ends up raining.</p>\n<p>By the time they get home, raindrops have started to splatter on the pavement and Beca hurries inside to close all of the windows she’d left open.</p>\n<p>She’s eating dinner when the sky starts rumbling louder. Po lets out a small whine from the living room. Beca rolls her eyes at him.</p>\n<p>“It’s just thunder, you big baby.”</p>\n<p>He whines again.</p>\n<p>She finishes her dinner and does the dishes, finally sitting down to watch some TV before she goes to bed. The storm has picked up and she turns up the volume of the TV so she can hear it above the rain slapping against the concrete outside.</p>\n<p>Halfway through an episode of <em>Grey’s Anatomy</em> (Chloe got her hooked on it), a flash of lightning illuminates the room, causing Beca’s heart to jump in her chest. A second later, thunder shakes the house, echoing off the walls.</p>\n<p>Po howls, making Beca drop her phone, and shoots off into the hallway. She hears his claws scratch at the hardwood floor before he disappears into Chloe’s bedroom.</p>\n<p>Beca frowns, and tries to ignore it, but eventually she feels too bad. Sighing, she stands up and pads down the hall after the dog.</p>\n<p>“Po?”</p>\n<p>She pokes her head into Chloe’s room, but doesn’t see him. She quirks her eyebrows because she swore he came in here.</p>\n<p>She’s about to go check in her room when she hears a low whine come from under the bed. She snorts and lies down on her stomach, head turned so she can peer under the mattress. Sure enough, there’s Po, curled in a ball, his head on his paws and tail quivering.</p>\n<p>“Dude,” she chuckles. “It’s just thunder.”</p>\n<p>His eyes stare back at her from their dark hiding spot. She reaches her hand under the bed and taps one of his paws.</p>\n<p>“Come out from there.”</p>\n<p>She spends five minutes trying to coax him out, but he clearly doesn’t want to leave his safe place. She sits up and leans her back against the bed, waiting it out. She looks around the room, taking in all of Chloe’s pictures. Some of Aubrey, some of her parents. Chloe and the Bellas. Chloe and Beca.</p>\n<p>Finally, she hears shuffling, and seconds later, Po crawls out from under the bed. He leans into her, practically climbing in her lap and laying his head on her legs. She scratches behind his ears and he lets out the saddest, most pitiful groan she’s ever heard.</p>\n<p>She guesses she gets it.</p>\n<p>“I know, buddy,” she says, looking back at the pictures of her and Chloe.</p>\n<p>“I miss her, too.”</p>\n<p>//</p>\n<p>Beca’s driving when her thoughts finally manage to catch up with her brain.</p>\n<p>She’s coming back from the grocery store after getting food for dinner for when Chloe comes home tomorrow. She’s blasting the radio, some station on Sirius that Chloe likes because it does this segment where it plays an artist’s most recent hit then follows it up with a popular past single that they had.</p>\n<p>The DJs just played Ellie Goulding’s new song, some collaboration with Pitbull that Beca is pretty meh about, and it quickly fades into one of her older songs that Beca hasn’t heard in forever.</p>\n<p>She grins a little, turning up the volume, and humming to the opening chords of Love Me Like You Do. Chloe used to be obsessed with this song.</p>\n<p>She sings along as the song slows slightly and there’s a little pause after the bridge and the chorus. Beca loves that pause. She lives for that pause.</p>\n<p>That pause feels like the song is going to tear you down and build you up all within a beat. It makes her think of winning Worlds and moving to L.A. and having her songs on the radio. It makes her think of Chloe coming here and moving in together, and getting Po and how Chloe’s eyes shine when they look at Beca.</p>\n<p>That pause makes her think of every time Chloe’s made her feel larger-than-life, like her dreams are not only possible, but right there for the taking.</p>\n<p>In that pause, Beca lets out a breath, her eyes widening and fingers gripping the steering wheel harder.</p>\n<p>She thinks back to Chloe’s choir concert and that girl who asked for her autograph and how Chloe fills up all of the spaces inside her that she didn’t even know existed until Chloe was there.</p>\n<p>Beca finally realizes what her dumb brain has been trying to tell her for <em>weeks</em>.</p>\n<p>She’s in love with Chloe Beale.</p>\n<p>//</p>\n<p>Beca’s leaning against her car, sunglasses on and arms crossed, when Chloe walks out of the airport. She smiles when she sees Chloe, all teeth and happiness.</p>\n<p>She looks so cool and so beautiful that Chloe stops dead in her tracks.</p>\n<p>Beca steps away from the car, head tilting to the side questioningly, and Chloe moves again. In a second, she’s got her arms wrapped around Beca, picking her up and swinging her around, her suitcase forgotten next to the car.</p>\n<p>“Put me down, you nerd!” But Beca is laughing and the sound makes Chloe feel bubbly and drunk.</p>\n<p>She sets Beca back on her feet and leans away from her, taking Beca’s cheeks between her palms. “Oh my God, I missed you so much. I forgot how tiny you are.”</p>\n<p>Beca tries to scowl, but Chloe’s hands are still on her cheeks, preventing her mouth from doing anything but puckering like a fish. Chloe giggles and lets go.</p>\n<p>“How was your flight,” Beca asks and Chloe shrugs.</p>\n<p>“It was nice. I slept the whole time.”</p>\n<p>Beca nods and shoots her a smile. “Nice.” She grabs Chloe’s suitcase.</p>\n<p>“I can get it,” Chloe says, stepping forward, but Beca ignores her, and lifts it into the trunk. “Thanks.”</p>\n<p>“Course.” Beca grins at her. “Ready to go?”</p>\n<p>They get in the car and Beca merges back into traffic. She asks Chloe more about her holiday and Chloe tells her about her mom and dad surprising her with a new pair of nice heels and how her grandma wouldn’t stop falling asleep at dinner.</p>\n<p>Beca won’t stop laughing and Chloe thinks she looks really free and happy. Chloe thinks her heart might grow wings at the sight, because it won’t stop trying to beat its way out of her chest.</p>\n<p>“So,” Beca says when they’re on the freeway. “Do you want to go to this New Year’s Eve party with me? The label is throwing it at this fancy hotel and there’s dinner and a party after.” She glances over at Chloe and shrugs. “You can wear your new heels.”</p>\n<p>Chloe grins because duh. “I’d love to.”</p>\n<p>“Cool, because I didn’t want to say so, but you kind of have to.” Chloe looks at Beca questioningly and Beca’s lips pull up a little. She waves her left hand in the air. “You know, our last outing as fiancées.” Beca frowns slightly. “Or you know. Whatever.”</p>\n<p>Chloe nods, trying not to feel disappointed. It doesn’t matter, she tells herself. Even if she likes Beca as more than friends, they couldn’t keep this engagement thing up forever.</p>\n<p>“Okay,” she says, but Beca must hear the sudden dip in her tone because she glances over at Chloe again. She tentatively reaches over and squeezes Chloe’s hand across the gear shift. Chloe looks down in surprise because she’s not sure Beca’s ever initiated their handholding before.</p>\n<p>“It’ll be fun.” Beca says. “Well, probably. I mean, I heard Jessie J was going to be there.”</p>\n<p>That does cheer Chloe up a little bit. She loves Jessie J.</p>\n<p>They spend the rest of the drive back home speculating about which celebrities will be at the party. Beca doesn’t let go of her hand the whole time.</p>\n<p>//</p>\n<p>“I need your help with something.”</p>\n<p>It’s the hardest sentence Beca’s ever said, but at least she’s saying it to Jesse so he doesn’t really notice that she’s visibly cringing.</p>\n<p>“Okay,” Jesse responds, absentmindedly adjusting the brightness on his laptop. They’re supposed to be working on the movie score, but she’s a little preoccupied right now.</p>\n<p>“I think I’m in love with Chloe.”</p>\n<p>There. She said it out loud. It wasn’t that hard. Not that she hadn’t practiced saying the words to herself the whole drive over to Jesse’s place.</p>\n<p>Jesse doesn’t seem to realize this is a pivotal moment for Beca’s stunted emotional development and just keeps fiddling with his laptop. “Yeah, I know dude. You guys are engaged, remember?”</p>\n<p>She groans and taps the table with her fingers. “Yeah, about that…”</p>\n<p>Jesse finally looks up at her. “What?”</p>\n<p>“We’re not actually engaged.” She raises her eyebrows as if to say sorry, but he kind of just stares at her.</p>\n<p>“What?”</p>\n<p>She nods. “We’re not engaged. Umm. Chloe tweeted that we were from my account that night and we were drunk and Lindsey had a hissy fit and basically the label wouldn’t let me take it back for PR reasons so we had to go along with it and we couldn’t tell anyone and now I don’t know what to do, Jesse, help!”</p>\n<p>His eyes kept growing wider as she kept talking and now they’re the size of salad plates. She feels everything bubble inside her like a geyser of emotions waiting to explode.</p>\n<p>“Wait, you haven’t been engaged this whole time?” He makes this face that looks like he feels slightly betrayed, but mostly just really confused.</p>\n<p>Beca shakes her head. “No. I’m sorry. Lindsey wouldn’t let us tell you.” She shrugs. “We didn’t tell anyone but our families.”</p>\n<p>Jesse leans back in his chair and crosses his arms. He doesn’t say anything for a minute and she just watches him. Finally, he sighs.</p>\n<p>“Okay, well I’m kind of mad about that, but I would like to rewind for a second.” He uncrosses his arms. “So you are <em>not</em> engaged, but you <em>are </em>in love with Chloe?”</p>\n<p>She bites her lip and wishes she wasn’t blushing. “Yeah.”</p>\n<p>“Right.” Jesse rubs his eyes for a second. Then nods at her like it’s obvious. “Okay, so have you told her?”</p>\n<p>“Umm.” Beca feels an overwhelming sense of terror at the thought. “<em>No</em>.”</p>\n<p>“Why not?” He raises his eyebrows in surprise. “Dude, she loves you, too.”</p>\n<p>Beca stares at him. “What?”</p>\n<p>He shakes his head, mouth falling open in a laugh. “Oh my God, the two of you are more clueless than Cher and Josh.”</p>\n<p>“Who?”</p>\n<p>He throws his hands in the air. “We literally watched this movie <em>together</em> over Thanksgiving!”</p>\n<p>“Sorry?” She shrugs.</p>\n<p>Jesse shakes his head again. “Okay, well never mind. Dude. Chloe’s in love with you.”</p>\n<p>Beca stares at him. “Really?”</p>\n<p>“Obviously.” He shoots her this condescending <em>duh, Beca</em> look. She scowls. “She’s been in love with you since Barden.”</p>\n<p>“No way.” Beca scowls in denial.</p>\n<p>He shrugs. “Maybe she didn’t know it yet, but yeah, dude.”</p>\n<p>Beca still doesn’t believe him, but it doesn’t matter. “Okay, well what do I do. I can’t just <em>tell</em> her.”</p>\n<p>Jesse looks at her like she’s crazy. “Yes, you can?”</p>\n<p>“No, I can’t!”</p>\n<p>“Why not?” He puts his hand on her shoulder and she exhales shakily.</p>\n<p>“Because, I dunno. What if she <em>doesn’t </em>and what if I fuck it all up?” The thought cuts through her with a flash of heat. Chloe is her <em>best friend</em>. Her family, really. The best person in her life.</p>\n<p>Jesse smiles sympathetically at her. “Well, first, she <em>does</em>. And second, you’re not gonna fuck it up, Becs. This is <em>Chloe</em>. She loves you either way.”</p>\n<p>She wants to argue, but he’s kind of right. Chloe always puts up with her, even when she’s being an asshole or avoiding talking about stuff or busy with work. She’s Chloe’s number one and Chloe is hers.</p>\n<p>“You can do it,” Jesse says. “And then you can have aca-babies together.” He winks exaggeratedly and it causes her to laugh a little. He’s such a loser.</p>\n<p>She guesses she loves him. A lot. Ugh, how annoying.</p>\n<p>Beca nods a little. Maybe she can do it.</p>\n<p>“And hey,” Jesse says. “If not, then we can spend your period of imminent heartbreak watching bad romcoms and eating ice cream.”</p>\n<p>She grimaces at the thought. “Yeah. No thanks.”</p>\n<p>He laughs and leans over to give her hug. She sinks into it, embracing his familiar <em>Jesse</em>-<em>smell</em> and thinking that maybe he’s right.</p>\n<p>She can do it.</p>\n<p>//</p>\n<p>She can’t do it.</p>\n<p>It’s just a fact. The night passes and New Year’s Eve comes and Beca has plenty of opportunities to tell Chloe she loves her, but she can’t.</p>\n<p>Every time she thinks about saying something, her heart starts beating so hard she thinks she’s going into cardiac arrest and her whole body feels like she took a lava bath it’s so hot.</p>\n<p>It might be easier, Beca thinks as she watches Chloe finish getting ready for the night, if Chloe didn’t look like she belonged on the cover of a magazine.</p>\n<p>“Do you think I did my eyes too smoky?” Chloe peers closer into the mirror, but she’s clearly talking to Beca.</p>\n<p>Beca makes some kind of sound that passes for a <em>no</em>, but honestly, she isn’t even sure if her brain is capable of thinking rational thoughts at this point. It seems to keep short-circuiting.</p>\n<p>It’s not her fault. She’s <em>trying</em> to be rational here.</p>\n<p>It’s just that Chloe is wearing this gorgeous strapless blue dress that fits tightly over butt and not much else. Add the heels in and Beca’s pretty sure Chloe’s legs have never looked that long in her life, but they’re tan and strong and Beca’s not staring, she’s <em>not</em>, it’s just that Chloe is so... <em>hot</em>.</p>\n<p>Which like, duh. Beca’s got eyes. Everyone knows Chloe is hot. When it came to the Bellas, there had been a general consensus among them that Chloe and Stacie were the hottest and when it came down to it, also most willing to exploit that fact to get what they want.</p>\n<p>Beca had seen countless guys eagerly slam a few dollar bills on the bar to buy Chloe drinks, only to have her smile sweetly at them and go back to dancing with Stacie and Jessica and Ashley, sucking her cocktail through a straw and giggling at how <em>easy</em> boys were.</p>\n<p>She must have witnessed it a hundred times. She just never thought <em>she’d</em> be on the receiving end.</p>\n<p>Not that Chloe’s trying to seduce her, but she does keep looking at Beca through hooded eyes for some reason and frankly, Beca’s not even half sure of her own name anymore.</p>\n<p>“Are you ready?” Chloe asks her, shooting her an uncertain look in the mirror, and Beca realizes that <em>fine</em>, maybe she <em>is</em> staring. She blinks a few times and shuts her mouth.</p>\n<p>“Yeah, let’s do this.”</p>\n<p>Chloe grabs her hand and helps her up from her bed, which Beca is grateful for because she really sucks at this whole heel game.</p>\n<p>“You look nice,” Chloe tells her, smiling gently, and Beca looks down at her simple black dress and shrugs.</p>\n<p>“Thanks,” she says, avoiding Chloe’s eyes. “You look. Uh. Acamazing.”</p>\n<p>Chloe snorts and grins at her skeptically. She puts her hand to Beca’s forehead. “Are you feeling alright? You’re being weird.”</p>\n<p>“No. Yeah.” Beca nods. “Nah. I’m yeah. Good. Let’s go.”</p>\n<p>Nailed it.</p>\n<p>They ride to the hotel in a cab because they’re definitely going to be drinking but they didn’t want to actually stay at the hotel because who needs that when they live ten minutes away?</p>\n<p>Beca’s sure that’s going to bite her in the ass when she’s drunk out of her mind and it’s two in the morning, but hey, she’s trying to be responsible here.</p>\n<p>The hotel is pretty nice, Beca guesses, but she’s kind of overwhelmed when they arrive because she spent the whole cab ride trying not to think about how awesome Chloe smells sitting next to her and what if she told Chloe now and then they just ditch this whole thing to stay at home and make out in their sweats.</p>\n<p>But yeah, that doesn’t happen, because of the part where Beca is incapable of expressing her feelings unless it’s in song form or something and that’s just not an option right now, so she follows Chloe to the fancy ballroom and tries not to trip and fall because of her dumb heels.</p>\n<p>The music is already in full-swing by the time they get there even if it’s only 9, but it’s not too loud because the dinner doesn’t officially end until 10:30ish when the countdown to midnight begins.</p>\n<p>They get seated next to a bubbly blonde woman that Beca has never met before which is kind of weird. Beca hates small talk, but Chloe likes it, so she’s grateful when Chloe starts to chat with the woman immediately.</p>\n<p>A waiter comes by and Beca orders a drink because this night is already feeling like a bit too much for her and it hasn’t even really started.</p>\n<p>“David will be back in a few minutes,” the blonde, Maggie she introduced herself as, says about her date. “He’s just run off to the little boy’s right quick.”</p>\n<p>Beca almost snorts, but manages to hide it behind a cough. She feels Chloe’s hand clamp down on her knee, clearly telling her to be nice.</p>\n<p>“Is David your husband?” Chloe asks, turning her southern sweetheart smile on the woman. Beca bites down her smirk.</p>\n<p>“Oh, no. We’re just friends.” Maggie winks suggestively. Thankfully, the waiter arrives with Beca’s drink at that moment, and she eagerly takes a sip. It’s too strong. Excellent.</p>\n<p>“Now, are you two…” Maggie points between them and Chloe makes eye contact with Beca for a second before turning back to the woman.</p>\n<p>She smiles brightly. “Oh, yes. Beca and I are engaged.”</p>\n<p>The word does weird things to Beca’s stomach. She takes another sip of her drink.</p>\n<p>“Oh congratulations!” Maggie beams at them. At that moment, Maggie’s <em>friend</em> comes back, sitting down next to her and putting his arm around the back of her chair.</p>\n<p>Beca glances up at him before doing a double take. She chokes on her drink.</p>\n<p>Chloe’s hand immediately starts rubbing her back until she stops coughing. Maggie and the guy are looking at her and she’s turning really red, she can feel it, but <em>oh my God</em>.</p>\n<p>“David?” She says, and it’s like her first word in ten minutes and Maggie looks shocked that she can even speak. “David Guetta?”</p>\n<p>Chloe’s hand freezes on her back and Beca thinks this is quite possibly the strangest and most amazing moment of her life.</p>\n<p>“Hello,” he says politely, chuckling slightly. “Didn’t mean to surprise you, there.”</p>\n<p>“No sorry, sorry,” Beca says, eyes wide. “It’s just.” She looks at Chloe and Chloe stares back. “We, umm. Sort of met because of your song.”</p>\n<p>David Guetta (ohmygod it’s David Guetta) smiles at them eagerly. “Is that so?”</p>\n<p>Beca kind of dies because he’s right there, and he’s smiling and he’s so French and wearing leather and just. Beca is kind of fangirling.</p>\n<p>“We used to sing in college,” Chloe chimes in. “Well, we still sing. But Beca used to sing in the shower and I heard her singing Titanium so I obviously had to meet her.”</p>\n<p>Beca snorts. “She stormed in on me and forced me to sing a duet with her while we were naked.”</p>\n<p>“Titanium is my lady jam!”</p>\n<p>Beca blinks. Chloe looks embarrassed for once in her life. David Guetta smiles uncertainly like he’s really confused, but thinks they’re cute.</p>\n<p> “They’re engaged, Dave,” Maggie says and Beca becomes really confused about their relationship, but hey, whatever.</p>\n<p>“Oh,” David Guetta says. “This is wonderful. Congratulations!”</p>\n<p>Chloe and Beca exchange giant grins. “Thank you,” Chloe says.</p>\n<p>At this point it’s announced that dinner is ready to be served buffet style. Chloe helps Beca up from her chair (stupid heels) and drags her to get food. Beca tries not to think about how they’re holding hands.</p>\n<p>“Oh my God,” Chloe whispers.</p>\n<p>“I know. I know.” Beca’s still kind of freaking out.</p>\n<p>“That was David Guetta.”</p>\n<p>“I know.”</p>\n<p>“I told him Titanium was my lady jam!”</p>\n<p>“Yeah, that’s embarrassing.”</p>\n<p>Chloe swats her playfully and lets go of her hand so they can get food. “He’s so cute,” Chloe says. “I didn’t know he was French Or like. Old.”</p>\n<p>“Oh really?” Beca frowns down at the food. Some unrecognizable pasta dish. She hopes it’s good and not weird. “What do you think the deal with that Maggie chick is?”</p>\n<p>Chloe shrugs as she takes some of the pasta dish, too. “Who knows. Sleeping together, maybe.”</p>\n<p>“Weird…”</p>\n<p>They smile at each other and head back to their table. Chloe makes more small talk with Maggie, but Beca and David Guetta kind of just sit there and shove food in their faces. The pasta ends up being pretty good, thankfully.</p>\n<p>“So,” Maggie says eventually. “I have to ask because I’m just such a sap. How did y’all know it was meant to be?”</p>\n<p>Beca blinks and stops chewing. She glances at Chloe and they make brief eye contact before Chloe looks away.</p>\n<p>“Well,” Chloe says, clearing her throat. “Beca is amazing. Have you heard her album <em>On the Rocks</em>?” Maggie shakes her head. “Oh, well, it’s just so good. She’s so talented.”</p>\n<p>Beca flushes and sets down her fork. She’s staring, she knows it, but Chloe’s uncharacteristically avoiding her eyes.</p>\n<p>“We’ve known each other for a long time and Beca’s my best friend.” Chloe shrugs like it’s obvious. “She makes me laugh and she lets me see parts of her that nobody else gets to see. When I wake up, I’m happy she’s who I get to talk to first and when I’ve had a long day, Beca’s always there at the end to make me feel better. She’s my best friend,” Chloe repeats and finally meets Beca’s eyes with a shy smile.</p>\n<p>Beca feels herself melt a little. She gives Chloe a small smile back.</p>\n<p>“That’s so sweet.” Maggie claps excitedly and turns to Beca. “And how about you, sweetie? How’d you know Chloe here was the one?”</p>\n<p>“Oh.” Beca says, eyes widening at being put on the spot. “Uh. Me?”</p>\n<p>Maggie nods at her enthusiastically and Beca bites her lip. Maybe she can tell Chloe now. Just you know, without actually telling her.</p>\n<p>Totally foolproof logic here.</p>\n<p>“Umm.” Beca clears her throat. “I mean. That’s easy.” She smiles to herself because it is. There’s a million reasons why she loves Chloe. “Chloe is the kindest person I’ve ever met. And she’s gorgeous, obviously, you don’t need me to tell you that.”</p>\n<p>Chloe’s looking at her intensely, like staring into her eyes, and Beca can’t look away.</p>\n<p>“Chloe makes me better,” she continues, the blue of Chloe’s eyes taking over her entire vision. “And uh, she makes me feel like I can do anything. She’s the best kind of song, one you can listen to over and over, but it just gets better every time.” Beca smiles a little, lifting one of her shoulders in a shrug. “And I, uh. I love her. A lot.”</p>\n<p>Chloe won’t stop looking at her with these wide eyes and Beca’s hypnotized because she just essentially told Chloe how she feels and she thinks Chloe <em>knows</em>, but she’s not saying anything.</p>\n<p>“Oh, that’s just beautiful,” Maggie says, and Beca finally glances away from Chloe to see the woman clutching her chest dramatically. “Aren’t they a beautiful couple, Dave?”</p>\n<p>Beca snorts, she can’t help it. David Guetta just nods at them politely.</p>\n<p>“I umm,” Chloe says. “I have to go to the restroom. Excuse me.” She smiles at them and Beca makes a face as if to ask if she wants her to come with, but Chloe just shakes her head with a small smile.</p>\n<p>She doesn’t know what that’s about, but now she’s left sitting at a table alone with Maggie and David Guetta, and yeah this is the weirdest night. Thankfully, it’s at this point that she hears a familiar voice.</p>\n<p>“Becaw!”</p>\n<p>She whips around, just as Jesse flops down into the seat Chloe vacated. “Oh my God,” she hisses, feeling relief swell inside her. “Thank God you’re here.”</p>\n<p>Jesse just grins that excited boy-next-door smile. “Thanks for putting me on the list.”</p>\n<p>“Yeah, no problem.” She gestures to the people at the table. “Uh, Jesse this is Maggie. And David Guetta.”</p>\n<p>Jesse politely smiles. “Nice to meet you.” Then he turns to Beca, which slightly offends her. Like is he not even a little excited about David Guetta? “Where’s Chloe?”</p>\n<p>“In the bathroom.”</p>\n<p>“Did you tell her?” He looks like an eager puppy.</p>\n<p>She shrugs. “Kind of?”</p>\n<p>“Kind of?”</p>\n<p>She’s about to quietly tell him, but then Chloe comes back. “Oh, hey Jesse.” Chloe smiles at him, but Beca thinks Chloe looks… disappointed? Maybe.</p>\n<p>“Hi, Chloe!” Jesse waves and waggles his eyebrows at Beca. She wants to smack him.</p>\n<p>At this point, dinner is finishing up and the music is getting louder. Beca check her watch and sees that it’s almost eleven.</p>\n<p>“You guys want to dance?” Jesse asks, and Chloe and Beca exchange a look.</p>\n<p>“Sure,” Chloe says. She grabs Beca’s hand and pulls her to the dance floor. Jesse goes to get them all drinks.</p>\n<p>Beca does have to say one thing for fancy parties thrown by a record label. They play really awesome dance music.</p>\n<p>It’s not long before she’s hot and sweaty from dancing and drinking. Her skin feels on fire, either from too much vodka or from that thing Chloe keeps doing with her hips which is just <em>unfair</em>. Chloe catches her staring and winks.</p>\n<p>Beca’s neck burns.</p>\n<p>Jesse’s dancing with some girl and Chloe’s got her hands on Beca’s hips, their bodies flushed together, and for a second Beca can’t breathe.</p>\n<p>She rests her forehead against Chloe’s and inhales sharply.</p>\n<p>The song fades out and the DJ reminds them that there’s only a few minutes until midnight. Beca glances at the feed of Times Square being projected onto the wall. Three minutes and counting.</p>\n<p>Chloe’s fingers dig into her hips and Beca feels dizzy.</p>\n<p>She needs some air.</p>\n<p>“I’ll be right back,” she says into Chloe’s ear. Chloe looks confused, but nods, and Beca makes her way to the edge of the room and out onto one of the many balconies that jut out from the hotel.</p>\n<p>The night air hits her face and she takes in a cool breath, leaning over the balcony railing.</p>\n<p>Everything stops spinning and she feels her shoulders relax.</p>\n<p>“Hey,” a voice says from behind her and she doesn’t need to turn around to know it’s Chloe. “You okay?”</p>\n<p>Beca nods. “Yeah. I just got too hot in there.”</p>\n<p>Chloe comes to stand next to her at the railing. Their shoulders brush.  Beca’s insides twist.</p>\n<p>They stare down at the city, watching the rush of cars below them and see all the people in the street clapping and yelling happily.</p>\n<p>Inside the hotel, a countdown starts up and Beca knows they should go back inside to watch the ball drop and to find Jesse, but the air feels so good and it’s nice and quiet in their little bubble.</p>\n<p>“We should probably go inside,” Beca says as the countdown hits ten seconds. Chloe meets her eyes, and that intensity is back, the one that hypnotizes Beca.</p>\n<p>“Yeah,” Chloe whispers as the countdown reaches five seconds. “Probably.”</p>\n<p>Neither of them move.</p>\n<p>Then Chloe leans forward, her hand coming up to cup Beca’s cheek, and Beca closes her eyes.</p>\n<p>She hears someone inside shout HAPPY NEW YEAR but Chloe’s lips are on hers, soft but sure, and Beca’s kissing back. She hears fireworks pop in the distance, but Beca’s mouth tingles as it moves with Chloe’s, and her heart is pounding loud in her ears.</p>\n<p>Chloe pulls back and Beca blinks her eyes open.</p>\n<p>She feels giddy, but her mouth always says things before she thinks them, and she’s drunk and Chloe just <em>kissed her</em>.</p>\n<p>“What was that for?” She whispers.</p>\n<p>Chloe smiles fondly at her and moves Beca’s hair out of her face. “Didn’t you know? On New Year’s Eve, you’re supposed to kiss someone you love into the New Year. It’s good luck.”</p>\n<p>“Someone you love?” Beca asks, her heartbeat still loud in her ears.</p>\n<p>Chloe nods, and shoots Beca this beautiful smile that makes her stomach flip.</p>\n<p>“About that. Chloe I have to tell you something.” Chloe bites her lip and Beca tries to formulate the right words. “I know that we said all that stuff about the engagement back there with those people. But like. I know the engagement is fake, so that stuff probably didn’t mean anything, right?” She watches as Chloe’s face falls, and this is not going the way Beca expected and she’s saying all the wrong words and she’s just so <em>bad</em> at this.</p>\n<p>She tries to continue, to tell Chloe that she actually <em>did</em> mean it, but suddenly Jesse is there and blowing a noisemaker in between them.</p>\n<p>“Happy New Year guys!”</p>\n<p>Beca could punch him, honestly. For someone who is supposed to be her wingman, he’s doing a really great job of having horrible fucking timing.</p>\n<p>Chloe slides her eyes over to Beca’s and they look really sad and hurt and Beca seriously is going to kill Jesse.</p>\n<p>He blows the noisemaker again and Beca grabs it.</p>\n<p>“Dude!”</p>\n<p>“What?” He grins drunkenly, and looks between them with a smile. “Why aren’t you inside? We should be drinking champagne and toasting our successes!”</p>\n<p>Beca grits her teeth. “Okay, you go and we’ll be inside in a minute.” She looks at him pointedly and he seems to get the message.</p>\n<p>“Oh. <em>Oh</em>.” He backs away. “Okay, I’ll just go get us champagne.”</p>\n<p>Beca pinches her nose until he disappears before turning back to Chloe.</p>\n<p>“Chlo – ”</p>\n<p>“Umm.” Chloe looks like kicked puppy and Beca hates herself. “I have to go to the bathroom, Becs. I’ll meet you, okay?”</p>\n<p>Beca panics. “Chloe!”</p>\n<p>But Chloe is already walking away and Beca lets her head fall back with an exasperated groan.</p>\n<p>Why can’t she do anything right?</p>\n<p>She goes back inside and finds Jesse at the bar. “Dude! I was about to tell her!”</p>\n<p>He holds his hands up apologetically. “Sorry, I didn’t know!”</p>\n<p>“Yeah, well. Fuck you, man.” She grabs one of his glasses of champagne and knock it back. She feels her phone vibrate and she pulls it out of her bra.</p>\n<p><strong>Chloe (12:09pm): </strong>Hey, I’ll meet you at home. Not feeling well.</p>\n<p>“Fuck,” Beca hisses, slamming her glass back down on the bar. She slides out of her heels (stupid heels) and runs out of the ballroom and through the hotel lobby. She knows she probably looks ridiculous, but she doesn’t care.</p>\n<p>She pushes out of the hotel, looking around for the cab line, for a flash of red hair, for <em>anything</em>.</p>\n<p>But Chloe is already gone.</p>\n<p>Beca curses and slips her heel back on. She walks back to the ballroom and finds Jesse still at the bar.</p>\n<p>“She leave?” He asks and he at least has the decency to look sad and guilty.</p>\n<p>Beca nods. “Yeah. And now I probably fucked it up forever.”</p>\n<p>Jesse shakes his head. “No way dude. This is just like the movies! You have to run after her, Becs! Go get your girl!”</p>\n<p>Beca scowls. “This isn’t the movies, Jess.”</p>\n<p>“No,” he says, a smile growing on his face. “This is better.”</p>\n<p>She looks at him skeptically, but he just nods like a crazy person.</p>\n<p>“This is real.”</p>\n<p>//</p>\n<p>Chloe wakes up to a hangover.</p>\n<p>An emotional hangover.</p>\n<p>She really didn’t drink that much last night, but she does feel like she had her heart ripped out and torn in two.</p>\n<p>She groans and rolls over, trying to get back to sleep, but she vaguely hears a familiar loud thumping noise. She peeks her eyes open and checks the clock, her face twisting in confusion.</p>\n<p>Why is Beca in her studio at seven in the morning?</p>\n<p>She wishes it didn’t, because she’s still kind of sad, but her curiosity gets the better of her. She pushes out of bed, first stopping by the bathroom to pee and brush her teeth, and opens her door.</p>\n<p>Sure enough, Beca’s studio light is on.</p>\n<p>She glances in briefly, but doesn’t see Beca, which is weird. She steps into the hallway and sticks her head in the studio door, eyebrows knitting in confusion when she sees Beca sitting on the floor.</p>\n<p>Beca’s still in her dress from the night before, laptop balanced on her upright knees. She’s not working on anything, just listening.</p>\n<p>Chloe listens for a second, her heart beating to the bass of the song, a mashup of Titanium and Ellie Goulding’s Love Me Like You Do that she’s never heard before.</p>\n<p>She likes it and it pulls at her heart as it ends, but Beca must have it on repeat because it starts playing again.</p>\n<p>Chloe clears her throat. “Hey.”</p>\n<p>Beca’s head snaps up to look at her and Chloe steps into the room. “Hi,” Beca says, and Chloe’s not sure, but she seems shy.</p>\n<p>“What are you doing?” Chloe shifts on her feet and stares down at Beca. “Why are you still in your dress?” </p>\n<p>“Oh.” Beca looks down at her outfit like she hadn’t even noticed. “I umm. Just had this stuck in my head and needed to get it out.” She gestures at the laptop.</p>\n<p>Chloe quirks her eyebrows in confusion. “Did you not sleep?”</p>\n<p>Beca shakes her head. “No.” She shrugs and looks up at Chloe and Chloe realizes Beca isn’t shy right now. She’s nervous. “Can I talk to you?”</p>\n<p>Chloe doesn’t really want to talk, she already had her heart broken, but this is <em>Beca</em> and Chloe’s not going to say no. She moves over next to her and slides down the wall so they’re sitting side-by-side.</p>\n<p>The song is still playing and Beca taps on her knees like she can’t keep her hands still. “About last night,” she starts and Chloe feels panic rise in her throat.</p>\n<p>“You don’t have to explain,” Chloe says, but Beca shakes her head.</p>\n<p>“Yes, I do.” She glances at Chloe briefly before looking down at her lap and sighing. “I fucked up last night.”</p>\n<p>Chloe bites her lip curiously, but doesn’t say anything. She hopes Beca isn’t about to apologize, but not take back what she said. Chloe can’t take that.</p>\n<p>“You know I’ve never really been great with words,” Beca continues, her fingers still tap-tapping away. Chloe wants to reach over and grab them, but she can’t right now. “And umm. Last night, when we were outside and you, you know… kissed me.” Beca looks like this is physically painful to put into words. “I tried to tell you after, but everything came out wrong. And I’ve been trying to tell you for a long time, but it took me even longer to realize what I was trying to say.”</p>\n<p>Chloe doesn’t really know where Beca is going with this.</p>\n<p>“And just,” Beca shrugs. “I thought, you know, at dinner, when I was trying to explain how I knew you were the one, or whatever,” Beca rolls her eyes. “I thought I was telling you. But I clearly just suck at this stuff.”</p>\n<p>Chloe’s eyes widen and she feels her heart flutter with hope. If Beca is saying what she thinks she’s saying…</p>\n<p>“Wait,” Chloe interrupts. “So that you stuff you said at dinner. Did you mean that?”</p>\n<p>Beca finally looks at her, eyes wide and vulnerable. Chloe’s stomach flips. “Of course I did. I love you, Chlo.”</p>\n<p>Chloe stills. “I know, but I mean…” She trails off because if she says it out loud then it’s real and this hope in her chest can’t die yet.</p>\n<p>Beca reaches for her hand. “I know how you mean. And yeah. I love you.” She shrugs again, looking anywhere but at Chloe. “I’m <em>in love</em> with you. I maybe always have been, but first there was Jesse and then I was just too dense to realize it.”</p>\n<p>Chloe’s smiling. At least she thinks she’s smiling, but her lips are pulling so hard that she’s afraid her cheeks are going to rip in half.</p>\n<p>“Oh my God,” she manages to laugh out. She slumps her head back against the wall and turns to the side to look at Beca. “Oh my God.”</p>\n<p>Beca suddenly looks worried. “Is that a good oh my God or…?”</p>\n<p>Chloe can’t stop laughing. Her stupid heart thumps wildly in her chest and her face feels hot. “Yeah,” she says. “I’m in love with you, too.”</p>\n<p>“Oh.” Beca kind of just stares at her because she’s still laughing, but then her smile grows at least as big as Chloe’s. “Cool.”</p>\n<p>Chloe snorts. “Yeah, cool.” She squeezes Beca’s hand and their eyes meet and Chloe’s been waiting like six years for this moment. “Now stop being a loser and kiss me.”</p>\n<p>Beca’s eyes widen comically. “Yes, ma’am.” She leans forward, biting her lip nervously, and Chloe’s <em>done</em> waiting, so she meets Beca halfway.</p>\n<p>Beca’s lips are as soft as they were last night, but Chloe feels the kiss in every nerve of her body, her synapses firing on high-alert.</p>\n<p>Beca exhales against her lips, tilting her head to deepen the kiss and Chloe’s chest fills with pleasure. She can’t believe this is happening. She can’t believe Beca loves her back.</p>\n<p>Happiness bubbles up her throat and she pulls back, leaning her forehead against Beca’s.</p>\n<p>“Nice,” Beca mutters in awe and a laugh escapes Chloe’s mouth in a rush. “So… I guess this means we’re still engaged, right?”</p>\n<p>“Lindsey is going to be so pissed at you.” Chloe shakes her head and kisses Beca again sweetly.</p>\n<p>Beca just grins that half-smile Chloe loves. “Dude. So worth it.”</p>\n<p>As Beca leans in to kiss her again and again, Chloe can’t help but agree.</p>"
}