{
  "id": "41083257",
  "url": "https://archiveofourown.org/works/41083257?view_full_work=true",
  "author": [
    "Hazel_Athena"
  ],
  "title": "Facade",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "One Piece"
  ],
  "relationships": [
    "Roronoa Zoro/Vinsmoke Sanji"
  ],
  "characters": [
    "Roronoa Zoro",
    "Vinsmoke Sanji",
    "Nami (One Piece)",
    "Monkey D. Luffy",
    "Tony Tony Chopper",
    "Nico Robin",
    "Franky (One Piece)",
    "Brook (One Piece)"
  ],
  "additional_tags": [
    "Fake Marriage",
    "Angst and Humor",
    "Alternate Universe - Canon Divergence",
    "Spoilers up to WCI"
  ],
  "language": "English",
  "series": "",
  "published": "2022-08-16",
  "completed": null,
  "words": "32,145",
  "chapters": "1/1",
  "comments": "1,056",
  "kudos": "18,203",
  "bookmarks": "4,305",
  "hits": "189,829",
  "summary": "<p>Left with only three other crew mates, it’s a ready expectation that Sanji will start fawning all over Robin in his usual obnoxious way. However, that’s not what happens. Instead, looking wild around the eyes in a way only someone who knows him well would recognize, the cook doesn’t break stride until he’s firmly within Zoro’s orbit and can wrap both hands around his upper arm, clinging tight.</p>\n<p>“Hi, darling,” he chirps, his expression desperately conveying that Zoro needs to play along under pain of death. “Did you miss me?”</p>",
  "notes": "<p>This madness is dedicated to the lovely Dee who came up with the overall prompt and encouraged me to run with it.</p>",
  "text": "<p>Their arrival on Zou comes with the usual mishaps and misunderstandings, but thankfully it’s not long before these get cleared up and the Dog-Woman (or Mink, whatever) promises to reunite them with their missing crew mates. </p>\n<p>As relieved as anyone, but trying not to show it, Zoro trudges through the forest, following quick on Luffy’s heels so as not to get separated. As they walk, Wanda explains how her people have tucked themselves away in the bowels of the woods, partly because their main city is destroyed, but also for safety purposes should the Beast Pirates return.</p>\n<p>Seeing the logic in this, Zoro nods his head in support of the Minks’ strategy, but otherwise doesn’t add anything to the conversation. If he had, he might have noted the curious glances Wanda and Carrot keep shooting him in particular and asked them about it.</p>\n<p>Their arrival at the hidden village is heralded by such a rush of noise that Zoro has to stomp down on an automatic urge to reach for his swords. There are Minks as far as the eye can see, all of them excitedly cheering for the Strawhat Pirates.</p>\n<p>“Man,” Franky lets out a low whistle. “If only we got this kind of welcome everywhere we went.”</p>\n<p>“You’re pirates,” Law mutters, lowering the brim of his hat even further on his head. Zoro can’t be sure, but he thinks the other captain might be wishing he could distance himself from them. “Getting this kind of reception on a regular basis would be unusual to say the least.”</p>\n<p>“Actually, depending on who you ask, sometimes it’s normal for us,” Usopp informs him. “In fact - hey, wait! Is that Nami? I think that’s Nami, and she’s got everyone else with her too!”</p>\n<p>Beginning to wave excitedly, the sniper yells Nami’s name again, followed by Chopper and Sanji’s, both of whom are hot on the navigator’s heels. Franky and Luffy also start yelling, while Zoro and Robin contain themselves to more subdued greetings. </p>\n<p>Or at least they do until the approaching three get within reach. Nami flings herself at Luffy, no surprise there, hugging their captain tightly as he gives her a comforting pat on the head, while Chopper bounces gleefully into Usopp’s arms, the two of them already yammering away about all the adventures they’ve had since they’ve seen each other last. </p>\n<p>Left with only three other crew mates, it’s a ready expectation that Sanji will start fawning all over Robin in his usual obnoxious way. However, that’s not what happens. Instead, looking wild around the eyes in a way only someone who knows him well would recognize, the cook doesn’t break stride until he’s firmly within Zoro’s orbit and can wrap both hands around his upper arm, clinging tight.</p>\n<p>“Hi, darling,” he chirps, his expression desperately conveying that Zoro needs to play along under pain of death. “Did you miss me?”</p>\n<p>*****</p>\n<p>The Minks want to throw them a feast, something they’ve apparently been itching to do since Nami and Co. had first arrived and sent the remnants of the Beast Pirates packing. They’re insistent that it happen immediately, but offer the Strawhats a nearby cabin where they can have their initial reunion in private.</p>\n<p>Since Sanji’s still hanging off his arm like a limpet without any explanation, Zoro thinks that sounds like a <em> very </em> good idea.</p>\n<p>They’re escorted to a room not far away from the main dining hall, but even once there Sanji still doesn’t release his hold. Instead, his eyes keep darting around the room, like he’s expecting any number of unknown enemies to jump out with no warning.</p>\n<p>“Cook,” Zoro tries, only to be quickly shushed not by Sanji, but by both Nami and Chopper.</p>\n<p>“In a minute, Zoro,” Nami says, only removing her finger from her mouth once he’s given her a disgruntled nod. “Someone will be by to bring Brook our way, so you need to play along until then.”</p>\n<p>Play along with <em> what </em> she doesn’t say, and Sanji gives him a weak smile that’s more of a pained grimace, which is no help at all. Suddenly wishing for a drink, Zoro keeps his mouth shut and tries his best not to fidget while they wait.</p>\n<p>Luckily, that doesn’t wind up being for long. Looking a little worse for wear, Brook stumbles in a few minutes later, with a bunch of canine Minks drooling after him. </p>\n<p>Nami’s quick to shoo them away, albeit more politely than Zoro feels is warranted, and shuts the door firmly behind them. Only once that’s done, does Sanji drop his hand like he’s been burned.</p>\n<p>“Sorry, Marimo,” the cook says, sounding exhausted as he rubs the bridge of his nose. “I promise there’s an explanation for all of this.”</p>\n<p>“There’d better be,” Zoro growls, feeling his face heat. He’s pretty sure most of the crew, minus Sanji himself, know about his feelings for the other man, and if whatever’s going on here turns out to be some kind of elaborate joke, he’s not going to be held responsible for his actions. “The hell is going on with you, Curls?”</p>\n<p>Rather than let his own temper spark the way he normally would at Zoro’s tone, Sanji flinches. “It’s a long story,” he says, wrapping his arms around himself in an uncharacteristic display of vulnerability. “One I was really hoping to never have to tell.”</p>\n<p>“Well it’s too late for that,” Nami says sternly, seemingly oblivious to the way her words make Sanji wilt even further. “I get that you wanted to keep this private, but it’s out now and everyone needs to know the details if we’re going to manage to pull this off.”</p>\n<p>“I know,” Sanji agrees quietly. “I just …” he sighs then, trailing off quietly before managing to rally. “I don’t talk about this for a reason.”</p>\n<p>Nami’s face softens, and she walks over to give Sanji’s arm a comforting squeeze. “I’m not blaming you, dummy, and I wish your hand hadn’t been forced this way. Unfortunately, we don’t always get what we want.”</p>\n<p>“Isn’t that the truth.” Sanji says mirthlessly, and Zoro knows the situation must be serious because he doesn’t even swoon at Nami’s touch. Instead, he just gives her a grateful nod as he carefully pulls his arm free.</p>\n<p>“Alright,” he says then, stuffing his hands in his pockets in a way that probably means he’s trying to keep from wringing them together. “Do the words Germa or Vinsmoke mean anything to anyone here?”</p>\n<p>They don’t to Zoro, he’s certain of that much. Nor, judging by the looks on their faces, are they ringing a bell for Usopp or Franky. Robin, however, raises her eyebrows in mild surprise. </p>\n<p>“I’ve never encountered them,” she says, “but I’m familiar with the names. Germa is a kingdom in the North Blue, and the Vinsmoke are the ruling family. They’re, well, from what I know of them I’d say the phrase ‘warmongers’ is likely being too kind.”</p>\n<p>“And then some,” Sanji agrees. “They’re monsters, and Judge, the current king, is the worst of the lot. He also, unfortunately,” and here he braces himself, like he’s half expecting to get hit, “happens to be my biological father.”</p>\n<p>Silence descends over the room, broken eventually by the sound of Usopp clearing his throat. “So, you’re saying you’re, what? Some kind of illegitimate offspring?”</p>\n<p>“I fucking wish,” Sanji mutters. Then he brushes a flustered hand through his hair before dropping an elaborate bow that puts his usual crap to shame. “I guess it’s a little late, but allow me to introduce myself - Vinsmoke Sanji, fourth child and third born son of the Vinsmoke Family, the exiled Prince of Germa Kingdom.”</p>\n<p>“ … Say what?” Usopp’s baffled expression speaks for them all, and Sanji huffs out a frustrated noise.</p>\n<p>“Don’t make me repeat myself,” he grunts. “I haven’t gone by that name in thirteen years, and I don’t actually intend to start now. The only reason I’m even bringing it up is because my past has reared its ugly head and caught up with all of us.”</p>\n<p>Usopp blinks. “I think I’m gonna need some more information.”</p>\n<p>Sanji sighs. “Look, the long and short of it is, I’m essentially the family disappointment. My father wanted his children to be emotionless, super human killing machines who he could use to help him conquer the North Blue. He got four out of five of those, and tossed me aside the second he could, making it very clear in the process that I was never to tell anyone who I was or where I came from.”</p>\n<p>“Then why are you doing it now?” Franky asks. “Not that I’m saying you shouldn’t, bro. Of course we support you one hundred percent, but what changed your mind?”</p>\n<p>For the briefest of seconds, Sanji looks like he might cry. Then he squares his shoulders and plasters a brave expression on his face. “Remember how we ran into some of Big Mom’s people outside of Dressrosa?”</p>\n<p>Most of the crew make various noises of agreement, and he nods. “Well, it turns out that wasn’t an accidental meeting. They were looking for me. My old man’s trying to form an alliance with her, and I’m his way of sealing the deal.”</p>\n<p>“Meaning?” Zoro asks, growing impatient with all this run around. “Get to the point, would you, Twirly.”</p>\n<p>Sanji shoots him an annoyed look, but it quickly fades into something more akin to embarrassment, and he ducks his head, refusing to meet his eye. “Big Mom, we’ve learned, is aptly named. She’s got something like eighty children, and likes to use them to secure various deals via advantageous marriages. Not wanting to use one of the kids he actually cares about, my father offered her me. The ship we ran into followed us here, and they’ve been sent to drag me off to her territory so I can marry one of her daughters.”</p>\n<p>“Well that’s stupid,” Luffy declares, speaking up for the first time. “You belong with us, so they can’t have you.”</p>\n<p>Once again, Sanji looks a little weepy upon hearing this, but he’s quick to clear his throat and continue on. “I’m glad you think so, Captain, but apparently Big Mom isn’t the kind of person who takes no for an answer. Her goons cornered us in the forest a couple days ago, and that’s what led to the predicament we’re now in.”</p>\n<p>“In my defence,” he adds, now meeting Zoro’s eye and giving him a sheepish grin. “It was Chopper’s idea.”</p>\n<p>“I panicked!” Chopper squeaks, bouncing in place when everyone turns to look at him. “They were trying to take you from us, and you looked like you were considering letting them if it meant the rest of us could get away safely.”</p>\n<p>“That’s because that’s exactly what he was doing,” Nami says. “If you hadn’t said what you said, he’d have thrown us out of Bege’s castle and tried to deal with this on his own.”</p>\n<p>“Not because I wanted to,” Sanji protests, and Zoro clears his throat loudly to get all attention on him.</p>\n<p>“What,” he grits out once he’s succeeded, “did you do?”</p>\n<p>“Chopper told the Big Mom Pirates Sanji couldn’t go with them because he’s already married,” Brook says, plucking a few solemn notes on his guitar. “Married, more specifically that is, to you, Zoro.”</p>\n<p>Reasonably certain he must have heard that wrong, Zoro glances around the room, waiting for one of his crew mates to tell him this is all some kind of weird fever dream. Eventually, his gaze lands on Sanji, who cringes in a way that can only mean this whole insane story is legit.</p>\n<p>Taking a deep breath, Zoro points a finger at the cook. “You,” he says in what he feels shows considerable restraint given the situation, “are never going to complain about me stealing booze from the pantry again.”</p>\n<p>Sanji opens his mouth, no doubt to inform him of how wrong he is, but freezes when he catches sight of Zoro’s expression. “Yeah,” he says then, deflating like a balloon someone’s just stuck a pin in. “I guess that’s fair.”</p>\n<p>Zoro nods, satisfied that he’s being taken seriously. Then he takes a few moments to collect himself as he runs over the plethora of questions that are currently chasing each other through his head. Grabbing for one at random, he cocks his head to the side and asks, “What was with that show on the way in?”</p>\n<p>“Bege is still here,” Sanji says tiredly. “He refused to just accept our word that you and I are, uh, you know,” he adds, gesturing tiredly between the two of them. “He wants to see us together for himself.”</p>\n<p>“Define <em> together</em>,” Zoro yelps, a dozen visions dancing across his brain in quick succession, each more terrible than the last. </p>\n<p>“Oh, get your mind out of the gutter,” Nami says, while Sanji sputters and Brook lets out a hearty guffaw. “He wants to see you guys interact with each other and judge for himself if you’re telling the truth about being a couple.”</p>\n<p>“Which we’re <em> not</em>,” Zoro says a little desperately.</p>\n<p>“Obviously,” she replies, with the tiniest spark of pity lurking in her eyes. Zoro hopes Sanji doesn’t catch it before it vanishes. “Hence the whole ‘show’, as you put it. You two need to put on a convincing act, not only for Bege, but for the Minks as well.”</p>\n<p>“Why them?”</p>\n<p>“Because,” Nami says, now speaking to him like he’s a small child, and a rather stupid one at that. “There’s too many of them to convincingly keep up the story. One or more will eventually slip up, and then we’re screwed, so they need to believe you guys are together too.”</p>\n<p>“Wait, you mean we’re lying to the folks hosting us?” Franky asks. “That seems kinda cold, sister.”</p>\n<p>“Do I look like I’m happy about it?” Nami asks, whirling on him. “The whole tribe has been through hell, and they’ve been nothing but wonderful to us since we got here. I hate the position we’re in, but I can’t change it. Unless we want the Big Mom Pirates to keep hunting Sanji down, this is our only option.”</p>\n<p>“Okay, okay.” Franky soothes, holding his hands up in surrender. “I get it. I’m not sure I like it, but I get it.”</p>\n<p>“Good enough,” Nami says. “Now, we should probably get over to the feast before someone comes looking for us, but everyone needs to remember - if anyone asks, Zoro and Sanji are madly in love with each other.”</p>\n<p>Zoro feels at least half a dozen pairs of eyes knowingly peering at him, and finds himself wishing the floor would open up and swallow him.</p>\n<p>*****</p>\n<p>Sanji, Zoro suspects out of guilt, keeps supplying him with all his favourite foods and more alcohol than even he can reasonably handle. They’re tucked away in a quieter corner of the dining hall, close enough to still be part of the festivities, but definitely on the outskirts nevertheless.</p>\n<p>“If I eat anymore, I will literally explode,” Zoro says after Sanji offers him a third plate of rice balls. “I know I can pack stuff away, Cook, but I’m not Luffy.”</p>\n<p>“Yeah, I know,” Sanji says quietly. “I just - ugh. I don’t know what else I can do to make up for … everything.”</p>\n<p>Zoro gives him a hard stare, noting the tired lines around his mouth and the way he’s sitting with his shoulders hunched defensively. He can’t imagine how it would feel to have a past he was desperately trying to keep hidden bubble to the surface like this, so he decides here and now that he’s not going to make things worse for the other man. He’ll play along even if it kills him, which it very well might. </p>\n<p>Greatly daring, he reaches out a hand and curls it loosely around Sanji’s shoulder, hoping the motion won’t get him kicked. “Hey,” he says, clearing his throat awkwardly as Sanji peers suspiciously at him through the fringe of his hair. “Everything’s going to be fine, alright? I don’t have a clue why you picked <em> me </em> of all people to help you with this, but I’m onboard. I promise I won’t fuck it up for you.”</p>\n<p>Sanji’s eyes widen slightly, and he bites the corner of his bottom lip, clearly unsure of what to say. “Thanks,” he says finally, sagging a little further into Zoro’s grip. “Although, for the record, I didn’t pick you, so much as the situation did. I couldn’t name anyone already on Zou because the Minks would blow our cover, Franky and Robin are Franky and Robin, and the idea of Luffy in a romantic relationship is frankly laughable. That left either you or Usopp, and we both know his heart belongs to Kaya.”</p>\n<p>So Zoro really was a last resort then. As much as that stings, it’s good to get that confirmation now, right at the beginning, so he can remind himself of it in case he ever starts feeling like this could be real at some point.</p>\n<p>Giving Sanji a faint shake, he pulls his hand back and dredges up a smile from somewhere. “It’s okay, Curls. I know guys aren’t your thing at the best of times, and not even I’m dumb enough to think you’d ever go for me for real. I’ve got your back, though. As nakama.”</p>\n<p>Sanji watches him with a funny look on his face, his mouth moving soundlessly like he’s fighting to find the words for whatever it is he wants to say. Right when it looks like he might have come across them, however, he’s interrupted by the sound of someone clearing their throat.</p>\n<p>Both Sanji and Zoro jerk around like they’ve been slapped, each of them staring up at the tall, feline Mink who’s just arrived. Based on his spotted coat, Zoro’s going to assume he’s some kind of jaguar, but he suspects it’d be rude to ask.</p>\n<p>“Forgive me if I’m overstepping on your reunion,” he says, once he’s sure he has their attention, “but I felt it was appropriate that I come over and introduce myself.”</p>\n<p>“It’s fine, Pedro,” Sanji says, fixing a smile on his face and waving a hand airily. “It’s good to see you again. How are your injuries doing?”</p>\n<p>“Very well, thank you,” the Mink says, bobbing his head politely. “Between Dr. Chopper’s care and your excellent food, I’m pretty much back to normal. As are most of my men.”</p>\n<p>“I’m glad to hear it,” Sanji says, his smile morphing into something more genuine. “You guys were looking pretty rough when we first showed up.”</p>\n<p>“Which is why we’re all so grateful, and also part of why I wanted to come say hello.” Bowing low, the Mink offers Zoro his hand to shake. “Your husband saved my life,” he says calmly, “and the lives of numerous others. You’re very lucky to have him by your side.”</p>\n<p>“You’re not telling me anything I don’t know,” Zoro informs him, gripping the hand with his own. It’s oddly soft, thanks to the Mink’s fur, but there’s no denying the power coursing through the hold. Whatever had happened during the battle with the Beast Pirates, he’s confident this guy would’ve put up a hell of a fight before they’d taken him down. </p>\n<p>“I’m sure I’m not,” the Mink replies, his grip tightening ever so slightly, “but I felt it was worth saying nevertheless. Sanji was a great help in driving the Beast Pirates off our island, and his kindness afterwards in helping us rebuild was remarkable too.”</p>\n<p><em> Ah</em>, Zoro thinks, finally cluing into what’s going on here. After all, one hapless idiot is perfectly capable of recognizing another, and he’s always known he isn’t the only person easily swayed by Sanji’s charms. Still, for once he doesn’t have to hide how he feels, even if Sanji’s going to think it’s all an act.</p>\n<p>Releasing the Mink’s hand with a pleasant nod, Zoro proceeds to wrap his arm around the cook’s waist, dragging him over until they’re pressed together side by side. “Yeah,” he says, reaching for the mug of ale he knows is around here somewhere with his free hand. “He’s something else for sure.”</p>\n<p>“Quite,” Pedro agrees, with only the slightest hint of an edge to his voice. “I also wanted to let you know, you will have the full force of the Mink tribe backing you if you need to fight off the pirates who seem to think he should join them.”</p>\n<p>Zoro tightens his hold on Sanji without meaning to, only relenting when the other man hisses at him. “Sorry,” he murmurs quietly, before focusing back on the Mink. “I don’t see us needing the help, but we’ll take it all the same.”</p>\n<p>“Fair enough,” Pedro says, clearly sensing this is the best answer he’s going to get. Bowing a second time, he then straightens to his full height and gives them a small smile. “I should leave you two be, however. Especially as I understand it’s been a while since you’ve seen each other. Enjoy the rest of the party, gentlemen.”</p>\n<p>“Thanks, Pedro,” Sanji says, watching the Mink until he’s faded into the crowd of revellers. </p>\n<p>Zoro’s fully expecting the cook to shove him off now that they’re no longer the centre of anyone’s attention, but if anything the other man leans more heavily against him. Pulling his mug away from his mouth, he glances down at the tousled blond head that’s now resting on his shoulder, hoping like hell that Sanji can’t feel the way his heart rate has picked up. “You okay?”</p>\n<p>“Not really,” Sanji replies, an admission that he normally wouldn’t make under pain of death. “Everything’s so messed up, and I’m really, <em> really </em>tired. Maybe more tired than I’ve ever been.”</p>\n<p>“Sounds like maybe you should go to bed then,” Zoro suggests.</p>\n<p>“Probably,” Sanji agrees. Then he makes a face. “That’s going to be a problem in and of itself, though,” he says, his nose wrinkling. “The Minks have given us all private huts to use, but they’re going to expect you and I to share.”</p>\n<p>Zoro’s pretty sure he feels something short circuit in his brain at that notion, but he rallies with impressive speed. “It’s fine,” he says, taking a fortifying gulp from his tankard. “I can sleep on the floor so you and your delicate sensibilities get your beauty rest.”</p>\n<p>Sanji pinches him, the motion causing a sharp stinging sensation when his fingers dig into the tender flesh at the crook of Zoro’s elbow. “Asshole,” he mutters, sounding almost like himself for the first time since they’d all reunited. “Fuck, you’re going to be the shittiest husband ever, aren’t you?”</p>\n<p>Zoro shoots him a grin that he hopes doesn’t reveal too much. “Like you ever thought otherwise,” he says, Sanji’s answering snort echoing in his ears.</p>\n<p>*****</p>\n<p>Zoro’s dragged out of a sound sleep the next morning thanks to a heavy pounding coming from their assigned cabin’s front door. “Whaaa?” He says eloquently, rolling onto his back so he can stare up at the ceiling like it might somehow be able to tell him what’s going on.</p>\n<p>His vision is soon filled with the sight of Sanji, his blond hair a riotous mess of curls, who leans over the side of the bed Zoro had graciously given him to look down at him. “There’s someone at the door.”</p>\n<p>“No shit,” Zoro grunts, bringing his hands up to massage his temples. “I figured that much out for myself, Curls.”</p>\n<p>“Well, look at you being more functional than usual then,” Sanji shoots back waspishly. “It’s not one of the crew, none of them would bother to knock, which means we should get up and see who it is.”</p>\n<p>“You do it,” Zoro retorts with a yawn. “I’m still tired.”</p>\n<p>“That’s because you’d sleep your life away if someone let you,” Sanji declares. Swinging his legs over the side of the bed, he prods the toes of one foot against Zoro’s hip. “Up, Marimo, and put your blankets back on the bed in case anyone comes looking.”</p>\n<p>“You can’t be serious,” Zoro mutters in disbelief. Unfortunately, the look on Sanji’s face indicates that he is, indeed, very much serious, and Zoro can expect a kick to the head if he doesn’t do as he’s told. Groaning, he rolls over and moves to push himself up off the floor. “I take it back, I think it’s <em> you </em> who’s going to be the shittiest husband ever.”</p>\n<p>“Screw you,” Sanji replies. He waits, fidgeting by the closed bedroom door until Zoro has the bed sorted to his satisfaction, and then heads out into the main living area, indicating with a wave of his hand that he expects Zoro to follow.</p>\n<p>Since that’s basically what he does every day of his life, anyway, Zoro doesn’t bother putting up a fight. It’s too early for it as it is, and the last thing they need is for it to spill over where someone might see. </p>\n<p>Especially, as it turns out when they open the door, this particular someone.</p>\n<p>Zoro doesn’t recognize the tall, slender man with the slicked back hair and lolling tongue who’s standing in the entranceway, but it’s clear from the look on his face that Sanji does. It’s also clear that the cook doesn’t want anything to do with him.</p>\n<p>“What the fuck are you doing here?” Sanji growls, making a point of fully blocking the doorway, like he half expects the man to try and force his way inside. “It’s the asscrack of dawn, and we were up all night at a feast. If you have to keep invading my personal space, the least you can do is fuck off until it’s a more reasonable hour.”</p>\n<p>Rather than look offended by this rude greeting, the man laughs, a weird, echoing sound that sets his long tongue rolling. The noise grates on Zoro’s nerves, and makes him reach for a sword he only belatedly realizes he’s not wearing.</p>\n<p>“Is that any way to greet a guest?” The man asks once he’s done laughing. “I’m only here to extend an invitation to you and your,” here he spares a quick glance at Zoro, his lips curving up in a smirk that’s more than a little bizarre thanks to the way his tongue is <em> still </em> hanging out of his mouth, “beloved.”</p>\n<p>Sanji scowls. “My <em> beloved </em> is about to start kicking your ass, and I’m going to help if you don’t get the fuck out of here within the next ten seconds.”</p>\n<p>Apparently sensing the sincerity behind these words, the man stops laughing and raises his hands in a show of surrender. “Truce,” he says, his voice slightly more normal now. “I meant what I said about an invitation.”</p>\n<p>“Do I look like I care?” Sanji demands. “I’ve already turned down one <em> invitation </em>from you people, and I’m going to keep right on doing so until you take the fucking hint. I’m not interested in joining you, and I’m certainly not interested in marrying some woman I’ve never met before.”</p>\n<p>“This has nothing to do with that,” the man insists. “It’s a personal invite from Father to dine with he and his wife tonight.”</p>\n<p>“Who?” Zoro asks.</p>\n<p>“Capone Bege, captain of the Fire Tank Pirates,” Sanji says. “We ran into him the first time we were on Sabaody, remember? When we met Law and Kid and all the others.”</p>\n<p>Zoro shrugs. On the whole he tries his best to forget about Sabaody, especially their first go around the island. He’d probably know this Bege guy to see him, but that’s about it. He does, however, recognize the name from last night’s conversation.</p>\n<p>Pinning their intruder - most likely a high ranking member of the Fire Tank Pirates, he suspects - with a look, he feels a strong urge to commit a little violence. “This Bege guy, he’s working for Big Mom these days, right? He’s the one she sent to drag the cook off to wherever the hell she is.”</p>\n<p>The other pirate nods. “That’s right,” he says, clapping his hands, which Zoro’s just now noticing are abnormally large, together in delight. “And he’s concerned that you Strawhats might be trying to pull the wool over his eyes to keep Vinsmoke here from doing as he’s told, so he wants to get a better look at you for himself.”</p>\n<p>A single glimpse of the stricken look on Sanji’s face at the use of that name is all it takes to send Zoro barreling past him and out the door. He hits the other pirate with enough force to bring him to the ground, and wraps a hand around the other man’s throat in a grip that promises dire retribution if he even thinks about moving.</p>\n<p>The man’s eyes go wide, and he clutches at Zoro’s wrist, trying to break his hold as the swordsman leans forward until their faces are inches apart. “Call him that again,” he hisses in his victim’s ear, “and I won’t even bother sullying my swords when I kill you.”</p>\n<p>“Marimo!” Having apparently reclaimed his wits, Sanji darts forward and grabs Zoro by the shoulders, hauling him backwards off the downed pirate. “Let him go, he’s not worth it.”</p>\n<p>“You’re damn right he’s not,” Zoro snaps, spitting on the ground next to where the pirate is now gingerly massaging his throat. The odds are about even that he’s going to have an impressive set of bruises dotting his neck by the time the day is out. “Tell your <em> captain </em> he can take his invite and shove it up his ass.”</p>\n<p>“No,” Sanji says, startling both Zoro and their visitor if the look on the man’s face is anything to go by. “Provided the dinner is all you’re saying it is, we’ll come.”</p>\n<p>“We will?” Zoro asks, and Sanji nods.</p>\n<p>“Yes. I won’t say I’m not offended by the idea that I’m expected to prove my relationship to a bunch of spectators, but if it gets these idiots out of our lives faster, then I’m all for it.”</p>\n<p>Forcing himself to set aside the rage that’s still kicking hot across his skin, Zoro takes a moment to consider this. There’s a logic to what Sanji’s saying, even if he too thinks this whole situation is ridiculous.</p>\n<p>“Fine,” he grits out, barely resisting the urge to take the Fire Tank Pirate’s knees out from under him as he climbs gingerly to his feet. “If that’s what you want, then that’s what we’ll do.”</p>\n<p>“Oi, long arms,” he says, directing his comment at the pirate. “Exactly where does your boss want this supper to take place?”</p>\n<p>Rubbing his neck theatrically, the other man grins. “Why, in his castle, of course.”</p>\n<p>“Please,” Zoro scoffs. “Like hell are we waltzing into enemy territory without any backup. Tell him to come here.”</p>\n<p>Now the pirate scowls, his hand falling to hang at his side, resting right above one of the revolvers he has holstered on his hip. “Father doesn’t take orders. He only gives them.”</p>\n<p>“I find that hard to believe given how he’s now an Emperor’s subordinate,” Sanji says snidely. “However, I think we can all agree on a compromise. Zoro and I will meet you in the castle, but Bege has to park it in the middle of the Mink’s territory, and our friends will be waiting nearby if he tries to run with us inside.”</p>\n<p>“That’s not my call to make - ” the man starts to say, but Sanji cuts him off with a disdainful look that shouldn’t be doing what it is to Zoro’s insides.</p>\n<p>“It’s the best you’re getting,” the cook says firmly. “Mossball and I will be waiting in the village square for six o’clock. If your captain doesn’t show, that’s his problem.”</p>\n<p>“Now,” he adds, eyes narrowing in irritation. “Get the hell out of my sight.”</p>\n<p>Neither of them says a word until the Fire Tank Pirate is out of view, and then a single shared glance is enough for both of them to agree to take any conversation inside. The door closes behind them with a quiet click, and Zoro runs a hand through his hair while Sanji huffs out a tired sigh.</p>\n<p>“What a morning,” the blond groans, letting his head fall back against the closed door with a soft thump. “I can’t believe this is happening.”</p>\n<p>“You and me both,” Zoro mutters, now scrubbing the same hand over his face. When he moves it, he opens his eye to find Sanji peering at him. “What?” He asks warily.</p>\n<p>“Nothing,” the cook says, quickly looking away and rubbing at the back of his neck with one hand. “Just, uh, wanted to say thanks for how seriously you’re committing to the bit.”</p>\n<p>“Huh?”</p>\n<p>“The bit,” Sanji repeats, flapping a hand like that might somehow clarify whatever point he’s trying to make. “You know, the whole tackling Bege’s henchman thing,” he explains when Zoro continues to stare at him. “It was a good idea. Very devoted husband-esque.”</p>\n<p>“Oh.” Zoro shrugs, trying his best to seem indifferent. In reality, he hadn’t been thinking about keeping up appearances at all. He’d simply seen Sanji’s expression and reacted accordingly. “Whatever,” he says lamely. “It’s not a big deal.”</p>\n<p>“I never said it was,” Sanji sniffs irritably. Knowing him, he’s probably trying to save face after saying something complimentary about Zoro. “Was only pointing out a fact. Anyway, I’m going to get breakfast started. Do you want anything?”</p>\n<p>“I could eat.”</p>\n<p>“Great. You can have first dibs at the shower while I do that then.”</p>\n<p>“I showered yesterday,” Zoro says.</p>\n<p>“And if you’re going to be married to me, you’re going to keep right on making that be a regular occurance,” Sanji says loftily. “Get moving, kelp-for-brains.”</p>\n<p>“Priss.”</p>\n<p>*****</p>\n<p>Nami comes to find them not long before they were planning to depart. “Bege’s castle just rolled into the village,” she says without preamble. “It looks like he’s agreed to your terms.”</p>\n<p>“Great,” Zoro says sarcastically. “I guess that means we can take our show on the road.”</p>\n<p>She once again gives him a smile that’s edged with pity. “Guess so,” she says. “Have you guys come up with a story for when he inevitably grills you about how you got together?”</p>\n<p>“Not to worry, Nami dear,” Sanji calls from where he’s cleaning their cabin’s already spotless kitchen as a form of stress relief. “We spent the afternoon hashing out all those details.”</p>\n<p>“Good enough,” Nami says, thankfully doing them the kindness of not pressing for further information. “You should probably get going then.”</p>\n<p>“Hmm, once more into the breach,” Sanji mutters as he materializes in the living area. “I was really hoping Bege wouldn’t show. One visit to that castle of his was more than enough for me.”</p>\n<p>“Me too,” Nami admits, looking worried. “Promise you’ll be careful, okay?”</p>\n<p>“Don’t trouble a single hair on that beautiful head of yours,” Sanji insists. “I highly doubt Bege and his men would pose much of a challenge for the Mossball and I, but even if they did we’ll have the rest of the crew, the Minks, and maybe even the Heart Pirates on standby. Everything will be fine.”</p>\n<p>“Right,” Zoro says hollowly when Nami turns to look at him. “What the cook said.”</p>\n<p>She snorts. “Very convincing. Alright, you two, I’m leaving this mess in your hands. Don’t screw it up.”</p>\n<p>“Never fear,” Sanji chirps, elbowing Zoro in the side when he rolls his eye. “I saw that.”</p>\n<p>“You were supposed to,” Zoro grunts, rubbing the now tender spot dramatically. “You’re also supposed to be married to <em> me </em>, remember? Although, why you couldn’t have just said we were dating, I’ve got no idea.”</p>\n<p>“Again, that was Chopper, not me,” Sanji says, pulling a cigarette from the packet stuffed in his pants pocket and lighting it as they walk. “And he said married because he was afraid Big Mom wouldn’t deem anything less than that sufficient to get off my back.”</p>\n<p>Zoro makes a mental note to have a talk with Chopper about stopping to think things through when he’s panicking, as opposed to blurting out the first thing that comes to mind. “Fine,” he says aloud, “I guess that makes sense.”</p>\n<p>“It does,” Sanji says, blowing a steady stream of smoke into the air. “Now, let’s go see how convincing an act we can pull off.”</p>\n<p>Zoro’s not sure what to make of Bege’s castle once it finally comes into view, but he decides to dislike it on principle. These people have come in here thinking they can take something of his - for a given value of <em> his</em>, he’s well aware - and the very idea of that makes his lip curl in distaste.</p>\n<p>“Are you … growling?” Sanji asks warily.</p>\n<p>“No,” Zoro says quickly. “Probably a couple of Minks nearby.”</p>\n<p>“Uh huh,” Sanji says skeptically. He’s finished not one but two cigarettes on the walk over, and there’s a jitteriness to his movements that suggests he’d like to get his hands on a third. “Fuck, I can’t believe this is what our lives have come to.”</p>\n<p>“I can always kill ‘em for you if you like.”</p>\n<p>“I would advise against that,” a voice says from above them, and when Zoro cranes his neck upwards, he finds the jaguar Mink from the other day - Pedro - crouched among the branches.</p>\n<p>“Big Mom is a formidable enemy,” he continues on once he’s sure he’s got their attention. “And she doesn’t take kindly to people crossing her.”</p>\n<p>“Got that much, thanks.” Zoro mutters, ignoring the look Sanji gives him that’s clearly meant to tell him to behave. “What are you doing up there, anyway?”</p>\n<p>“Keeping watch,” is the reply. “My people are stationed all over the forest. If Bege or his crew try anything, we’ll know.”</p>\n<p>Wonderful. Feeling not unlike a bug under a microscope, Zoro waits until Sanji’s murmured a quiet note of thanks before tugging the cook forward with him.</p>\n<p>The castle grows bigger and bigger the closer they get, its stone walls and turrets looking completely out of place among the wooden structures favoured by the Mink tribe. Zoro’s half tempted to make a joke about overcompensating for something, but then a familiar shape steps out to greet them, and he scowls instead.</p>\n<p>Following his gaze, Sanji snorts. “You’d think,” he says slowly, eyeing the Fire Tank Pirate from this morning with distaste, “that someone would’ve caught on that we don’t much care for this fellow and sent somebody else.”</p>\n<p>“He’d better not be coming to dinner,” Zoro replies, his fingers itching to reach for any of the three swords that are now resting on his hip. “Otherwise, I really might do something worse than give him a few bruises.”</p>\n<p>As he’d expected, the Fire Tank Pirate is now sporting a ring of marks around his throat, each of which would no doubt line up perfectly with Zoro’s grip if given the opportunity. The swordsman makes a point of eyeballing the bruises as they arrive, and the pirate isn’t quite able to hide the way his hand twitches towards his own neck.</p>\n<p>“You again,” Zoro says after they’ve climbed the front steps of the castle and are standing outside of the main gate.</p>\n<p>“Me again,” the man agrees, letting out a faint chuckle as they both glare at him. “I’m glad to see you made it, and right on time too. If you’ll follow me, Father is waiting for you in the dining room.”</p>\n<p>Gesturing with one the large hand, the man motions to the door, which slides open, as if on cue. It makes no noise in doing so, and Zoro feels the hairs on the nape of his neck stand up at the sight.</p>\n<p>A quick glance at Sanji shows the blond looks no happier than Zoro feels, and it dawns on him then that, thanks to their situation, not only <em> can </em>he offer up some form of comfort without causing a stir, but it’s probably expected of him. His mind thus made up, he doesn’t bother to say anything before hooking an arm around Sanji’s waist, and tucking him up against his side.</p>\n<p>Sanji’s sole reaction is a quiet noise of surprise, but he melts into Zoro’s touch almost immediately and doesn’t try to shove him off. Pleased with this, Zoro shoots their guide a smarmy grin and nods at the door. “Lead the way.”</p>\n<p>The sound of their footsteps echoes while they walk, making Zoro wonder where the rest of Bege’s crew are. They don’t spot a soul on the way to their destination, and when they eventually stop at a set of heavy wooden doors that swing inwards upon their arrival, only a single, solitary figure is waiting inside for them.</p>\n<p>“Your host, gentlemen.” The Fire Tank Pirate says, but rather than join them like Zoro had half been expecting, he waits for them to cross over the threshold and then closes the doors behind them with a nod of his head.</p>\n<p>“What a creep,” Sanji mutters, and Zoro snorts to show he shares the sentiment.</p>\n<p>“Vito’s my second in command,” a gravelly voice says. “And I’ll thank you for treating that with the respect it deserves.”</p>\n<p>Zoro and Sanji turn as one to meet the gaze of their host, with the cook jerking a thumb in the swordsman’s direction. “Technically,” he says with a smirk, “this one’s the second in command of the future Pirate King. Ask me how much respect I give him when I don’t feel like it.”</p>\n<p>“The answer’s ‘none’,” Zoro adds, as if that weren’t perfectly clear already. “But I’ll be the first to admit he’s a little shit.”</p>\n<p>“Love you too, dear.”</p>\n<p>Zoro manages to keep every muscle in his body from locking up at these words, and forces himself to take a good look at their host as a distraction. Now that they’re here, he realizes Sanji was right, and he does vaguely recognize the portly man in the tailored suit from their first stint on Sabaody. He’ll be damned if he can remember anything about him, though.</p>\n<p>As if he can sense this, the older man takes a few steps forward, until he’s directly across from them. “Capone Bege,” he says, offering his hand to Zoro specifically. “And you’re Roronoa Zoro.”</p>\n<p>“No shit,” Zoro says, ignoring the proffered hand until Bege gets the hint and lets it drop back down to his side. “And you’re the idiot who thinks he can just waltz in here and steal the cook away on a whim.”</p>\n<p>Bege’s eyes narrow, giving Zoro the sense that he’s not making a good first impression. “To be clear, it wasn’t a whim. I have my orders, and I tracked down Blackleg here as part of carrying them out.”</p>\n<p>“Is that so?” Zoro asks snidely, scoffing when Bege nods. “Just following orders is a nice excuse. I hear you’re married. How would you react if someone tried to kidnap your wife under similar circumstances?”</p>\n<p>“Marimo!” Sanji hisses, but his voice is overruled by the sound of Bege growling low in his throat.</p>\n<p>“Is that a threat?” The other man asks, the lines of his mouth tightening in a way that probably reveals more than he’d care to let on.</p>\n<p>“No,” Zoro says, immediately backing off. He’s got the information he wanted. “Just an honest question.”</p>\n<p>“Hmm,” Bege replies. He still looks vaguely murderous, but his posture isn’t quite as tense as it had been. “In that case, and speaking of my wife, she’s overseeing the finishing touches on supper, and’ll be along once that’s done. Can I offer either you a drink until she gets here?”</p>\n<p>Figuring it fits the role he’s playing, Zoro raises a questioning eyebrow at Sanji, who snorts. “Go ahead, if you like, but I’m waiting until the food’s ready.”</p>\n<p>Shrugging to indicate Sanji can do as he pleases, Zoro accepts the glass of wine Bege holds out to him, even if it’s not the sake he’d prefer. The taste isn’t bad, and he’s downed most of it by the time another door opens and a female voice calls Bege’s name.</p>\n<p>Bege’s entire countenance softens, and he holds out a hand to the tall, pale haired woman who’s now entering the room. “Roronoa, Blackleg,” he says, inclining his head, “allow me to introduce you to my wife - ”</p>\n<p>“Lola?!”</p>\n<p>“ - Chiffon.”</p>\n<p>Both Bege and his wife stiffen, the two of them staring at Sanji, whose attention is fixed firmly on the woman. Likewise, Zoro eyes her as well, finding that she does look familiar the longer he watches her.</p>\n<p>Suddenly it clicks, and he points at her with the hand holding his half empty wine glass. “Thriller Bark,” he says, looking at Sanji for confirmation. “Captain of the Rolling Pirates, right?”</p>\n<p>Sanji nods. “I’m surprised you remember given how messed up you were after that fight, but yeah, that’s what I was thinking too.”</p>\n<p>Zoro rolls his good eye and knocks back the rest of his drink. “The woman proposed to me out of the blue. Twice.”</p>\n<p>“Lucky you, I only got the one.”</p>\n<p>Any further bickering is cut off by the woman - Chiffon, apparently - stepping forward anxiously. “You know my sister?” She asks, her voice tinged with hope.</p>\n<p>“Uh, yes,” Sanji says. “Not well, I’m afraid, but we met her a couple years ago. Our crews were briefly allies in a fight against Gecko Moria. Though, I guess you could say we’re still allies. She and our navigator became good friends.”</p>\n<p>Zoro doesn’t really remember that, doesn’t remember much of Thriller Bark after his run in with Kuma, but Sanji had been awake for everything that came after. If either of them could give this woman more details, it’d be him.</p>\n<p>“Lola and I are twins,” Chiffon is saying now. “I’m a little bit older, being our Mama’s twenty-second daughter, while Lola’s her twenty-third.”</p>\n<p>“Twenty -?” Zoro starts, and then groans when he realizes what that has to mean. “You’re a Charlotte.”</p>\n<p>“Mhm,” Chiffon says with a bright smile and a nod. “That I am. Your Blackleg and I would have been in-laws if you weren’t in the picture.”</p>\n<p>Zoro gives her a smile with too much teeth if the way Sanji digs an elbow into his ribs is anything to go by. “Don’t mind him,” the cook says, flashing her a sunny smile of his own. “He’s a bit of a brute, I’m afraid.”</p>\n<p>Chiffon giggles and points at Bege. “If you want a brute, you should see this one in the morning before he’s had his coffee.”</p>\n<p>His face flushing, Bege makes a disgruntled noise, and nods towards the table, which is steadily filling up with food under mysterious circumstances. “We should eat before the meal gets cold.”</p>\n<p>“Eat <em> and </em>chat,” Chiffon insists. “We hardly ever get to have company, and I want to enjoy the evening. I’d also love to hear more about how you met Lola and how she’s doing.”</p>\n<p>“She was good the last time we saw her, but that was over two years ago now,” Sanji says, taking a seat at the table. He waits until the Capones take the two seats across from him, and then motions for Zoro to settle in the chair on his left. “Now that I think about it, I’m pretty sure she mentioned having a mother who was a famous pirate.”</p>\n<p>“Very famous,” Chiffon agrees. “But that’s not important, tell me about this Thriller Bark place.”</p>\n<p>So Sanji does, weaving a truncated version of their fight against Moria and his zombie army. True to form, he mentions Perona in a more favourable light than Zoro feels she deserves, but doesn’t pull his punches when talking about the gross stuff Moria’d been up to.</p>\n<p>“Moria hasn’t been seen since Marineford,” Bege comments idly during a brief lull in the conversation. “Your captain know anything about that?”</p>\n<p>Zoro and Sanji shrug in tandem, neither of them able to shed any light on the matter. Then Sanji starts talking about the party their crews had thrown once Moria was defeated, spewing tales that have to be exaggerated.</p>\n<p>“That didn’t happen,” Zoro says, after the cook’s painted a picture of Luffy hanging upside down from a piano while Brook tried to play it. “No way.”</p>\n<p>“I’m sorry,” Sanji says. “Have you met our captain? First of all, it most certainly <em> did</em>, and second of all, how would you know one way or the other? You were busy being a comatose lump throughout the entire bash. Thank you for all the grey hairs you gave me that week, by the way.”</p>\n<p>“Was he very badly injured?” Chiffon asks, her brow furrowed with worry. </p>\n<p>“Oh, he only tried to kill himself,” Sanji declares, ignoring Zoro’s increasingly vocal protests about how that wasn’t how it’d gone down. “Walked right up to Bartholomew Kuma, like a lamb to the fucking slaughter - please pardon my language - and offered him his own head in exchange for Luffy’s.”</p>\n<p>“Why was Kuma there?” Bege asks, looking intrigued.</p>\n<p>“He showed up at the tail end of the fight, no idea why,” Zoro says before Sanji can get going again. “Also, that was <em> not </em>what happened. I didn’t go into it expecting to die, I was just willing to if it came to it.”</p>\n<p>“Because that’s <em> so </em> much better,” Sanji says acerbically. </p>\n<p>Without stopping to consider what he’s saying, Zoro pins him with a look. “Did you ever think,” he says tightly, “that I might have been just as motivated by you trying to get there first? You stood in front me and told me to tell the others we’d need to find a new cook.”</p>\n<p>“After which you knocked me out cold to stop me, bastard.”</p>\n<p>“And I’d do it,” Zoro says seriously, “a thousand times over. If not more.”</p>\n<p>Sanji’s eye widens, and Zoro realizes he’s likely said too much, given <em> away </em>too much. He desperately racks his brain for something, anything he can say to claw the words back from the brink, but before he can come up with an excuse, Chiffon lets out a tiny laugh.</p>\n<p>“And you thought they might be faking,” she says, giving her husband a teasing smile. “You’ve got egg on your face now, don’t you dear?”</p>\n<p>Bege grumbles something unintelligible under his breath, but gives her a grudging nod. “I’ll admit, I might have miscalculated. Between this and Vito’s earlier run in with them, I’m willing to bet they’re legit.”</p>\n<p>“I’m so happy we’ve sufficiently proven our marital status,” Sanji says dryly, every ounce the picture of wronged innocence. “Not to sour the mood of the evening, but you really did have some nerve accusing me of lying about being in a relationship.”</p>\n<p>Bege’s eyes flash, reminding Zoro that he’s a member of the Worst Generation for a reason, and his lips thin in annoyance. “Maybe I was wrong about some stuff,” he says darkly, “but you can’t convince me you haven’t been lying to an extent. I saw the look on your friends’ faces when I brought up the Vinsmoke. They had no idea what I was talking about.”</p>\n<p>Sanji’s face flushes a brilliant scarlet, his temper visible for all to see, but Bege isn’t done yet. He keeps right on talking, only this time he directs his attention at Zoro. </p>\n<p>“Did <em> you </em>at least know?” He asks. “I’d like to think you’d’ve been made privy to his past before you married him, but I’m not willing to put money on it. Tell me the truth, kid. Did you show up on Zou and find out Blackleg here wasn’t who you thought he was?”</p>\n<p>“So what if I did?” Zoro asks, his tone as calm as Bege’s is aggravated. “He’s allowed his secrets.”</p>\n<p>Bege’s face goes slack and he stares at Zoro, completely floored. “You can’t be serious,” he says, shaking his head as he finds his voice. “There’s no way you can just brush off something that major.”</p>\n<p>Since that’s exactly what he’s done, Zoro shrugs. “Where he came from doesn’t change who he is now. I know him better than anyone - his strengths, his weaknesses, his goals, his passions, you name it. Whether or not I also know his old man is fucking irrelevant.”</p>\n<p>“You do.” Sanji says quietly, effectively drawing all eyes to him. It’s Zoro whose gaze he meets, however. “My father, I mean. You met him back in the East Blue.”</p>\n<p>Zoro has a sudden vision of a crotchety old chef who’d looked at Sanji like he was the greatest gift he’d ever been given, even though you’d never know it to hear the man speak. Unable to help himself, he laughs.</p>\n<p>“You’re right, I did,” he says. “Grumpy old bastard didn’t much care for me, did he? Though I guess me getting hacked open right in front of his door probably didn’t make the greatest first impression.”</p>\n<p>“Well, it definitely left <em> an </em>impression,” Sanji concedes. His voice is still strained, though, which makes Zoro turn back to Bege, wanting to make his position on this bullshit abundantly clear.</p>\n<p>“Where he came from is irrelevant,” he says, “except insofar as how much the people who hurt him deserve to get their asses kicked for it. I don’t know how much you were told, but they treated him like shit. Why should he have to relive all that just to keep me in the loop?” Piercing Bege with a look, he decides to go in for the kill and asks quietly, “Would you judge Chiffon for choosing to keep bad memories to herself?”</p>\n<p><em> Got him</em>, he thinks when Bege’s expression melts. He’d figured he was right earlier, but the way the older pirate glances at his partner confirms it. For all his faults, the man is utterly devoted to his wife, and wouldn’t even dream of taking something out on her if their positions were reversed. </p>\n<p>The room’s silent for a moment until Bege leans back in his chair and has the nerve to toast Zoro with his glass before taking a sip from it. “You’re good, Roronoa,” he says, sounding almost impressed. “Much better than the newsreels give you credit for.”</p>\n<p>“It’s not his fault if people underestimate him.” Sanji’s voice is a little ragged when he speaks, and there’s a decidedly glassy sheen to his eyes when Zoro risks a peek at him. “And they do. All the time.”</p>\n<p>“I believe you,” Bege says. And then, because Zoro’s life, when you get down to it, really is one big, cosmic joke, he follows this up with, “You’ve got yourself a good one there, kid.”</p>\n<p>Sanji bites his lip, obviously having no idea how to safely respond to this, so Zoro yet again takes it upon himself to provide a distraction. In arguably one of the most selfish moves he’s ever made, he reaches out to snag Sanji’s left hand before bringing it to his lips so he can press a kiss to the back of it.</p>\n<p>“I’m the lucky one,” he says, projecting all the sincerity he can into the words.</p>\n<p>Sanji’s hand spasms, the twitches evident where his skin is still brushing up against Zoro’s mouth. “Oh, you fucking moss-riddled bastard,” he chokes, thumping the table with his free hand. “We are in <em> public.</em>”</p>\n<p>And the odds of Zoro ever getting a chance like this again are slim to none. He’s never claimed to be a good man, and the notion of being able to take things he wanted has always been part of the appeal of becoming a pirate.</p>\n<p>Rather than saying any of this, however, he goes back to his meal.</p>\n<p>*****</p>\n<p>It’s dark by the time they leave. Bege sees them off with a curt nod and an assurance that he’ll deliver a speedy report to Big Mom. The fact that she may or may not choose to accept what he tells her goes unspoken, and even Chiffon’s smile is a little strained as she waves them off.</p>\n<p>“This isn’t the end of this mess, is it?” Sanji murmurs as they walk side by side towards their cabin. </p>\n<p>“I doubt it,” Zoro replies. “But look at it this way - Luffy’s planning on taking down all four Emperors eventually. After he kicks Big Mom’s ass, you’ll be free of me again.”</p>\n<p>“Mhm,” Sanji hums noncommittally. “In that case, I guess the show must go on.”</p>\n<p>About to ask what he means by this, Zoro gets his answer when the cook winds both his arms around his right one, much the way he had when they’d first reunited on Zou. Sucking in a fortifying breath, he focuses on putting one foot in front of the other.</p>\n<p>By his estimation, they’re about halfway back to their cabin when Sanji breaks the silence. “I know you were sort of just playing a part,” he says softly, “but thanks. For what you said back there. About how I didn’t owe anyone the story of my past. I’ve wanted to come clean for a long time, but I didn’t know how.”</p>\n<p>“Pfft, come clean,” Zoro repeats. “You make it sound like you had something to be ashamed of. Your family being terrible is a reflection on them, not you.”</p>\n<p>Sanji’s grip tightens to a point that’s almost painful, telling Zoro he’s misread the situation. “Cook?” He asks, suddenly certain that he needs to tread carefully here. “What is it?”</p>\n<p>He doesn’t get an answer immediately, and when it comes there’s a catch in Sanji’s voice that makes his stomach clench. “It was never them I was ashamed of.”</p>\n<p>Zoro takes a moment to process those words. If it wasn’t his family Sanji had been worried the Strawhats would reject him for, that only left … </p>\n<p>“It was me.”</p>\n<p>Oh hell no, Zoro’s not going to sit here and listen to this. He doesn’t know what poison Vinsmoke Judge has succeeded in lodging in Sanji’s head, but he’ll be damned if he’s going to let it fester any longer. Even though he knows the odds are about even he’s going to get a dress shoe to the face, he takes a deep breath and asks, “What did he do to you?”</p>\n<p>“What didn’t he do?” Sanji laughs mirthlessly. “You really want to know? Alright, fine, I guess if anyone deserves the truth after the past few days, it’s you.”</p>\n<p>“Judge is, much like Robin said, a warmonger. He’s also completely insane and obsessed with ‘regaining the glory of Germa’,” here Sanji flashes an impressive set of air quotes given that he’s refusing to relinquish his hold on Zoro’s arm, “<em>but</em>, what he is above all else, is a scientist.”</p>\n<p>“Okay,” Zoro says, feeling like some kind of contribution from him is warranted here. “What kind of projects did he work on?”</p>\n<p>“Funny you should ask,” Sanji says, the words spoken in such a falsely bright tone that Zoro feels his skin crawl. “He had two main areas he liked to study - weapons and genetic manipulation.”</p>\n<p>Forget his skin crawling, Zoro’s going to actively be sick. “Curls,” he says weakly.</p>\n<p>“I can stop,” Sanji replies, forever kinder than most people either know or deserve. “If it’s too much, I can shut up and we’ll pretend like this whole conversation never happened.”</p>\n<p>It’s a tempting offer, more tempting than Zoro would care to admit, but he’s no coward and it’s painfully clear Sanji needs this outlet. That alone is enough to make him shake his head. “It’s fine,” he says. “Keep going.”</p>\n<p>The lanterns lining their path cast enough light for him to make out Sanji’s skeptical expression, but it smoothes out a bit the longer Zoro goes without retracting his offer. Finally, he sighs. “I have four siblings. My sister Reiju is three years older, while my brothers and I are quadruplets.”</p>\n<p>“Big family.”</p>\n<p>“Mhm,” Sanji agrees. “I’m the third of the four. Third. Sanji. Wanna know what my brothers are called?”</p>\n<p>“Sure.”</p>\n<p>“Ichiji’s the oldest. After him comes Niji. Then me. Then Yonji. Do you get it yet?”</p>\n<p>“Yeah,” Zoro rasps, the numbers rolling around in his head. “Yeah, I get it.”</p>\n<p>“That’s how little we mattered to him,” Sanji says then. “We weren’t people, let alone children. We were experiments, and I’m the one that failed.”</p>\n<p>“You’re not - ”</p>\n<p>“In his eyes, I am,” Sanji insists, trampling all over Zoro’s protest. “He did something to us before we were born, Reiju too. I’m not like them. I’m smaller, slower, weaker, you name it. I’m <em> human</em>. There are three monsters out there wearing my face, Marimo, and they are so twisted up by whatever was done to them that any shred of humanity they might have once had is long gone. They’re emotionless super soldiers, and that was all Judge ever wanted them to be.”</p>\n<p>“He used to let them beat me, all three of them. He said it was to toughen me up, but I think it was more meant to be a punishment for having the audacity to be born different. I can’t count the number of bruises they gave me, the number of bones that they broke. Sometimes I’m amazed I can cook at all with the way they used to love stomping on my hands.”</p>\n<p>Said hands tighten around Zoro’s bicep, and without thinking he covers them with one of his own, a belated shield to protect the things Sanji treasures most. “None - none of that makes you weak,” he tries. “You were a kid, and you were outnumbered.”</p>\n<p>“Not always,” Sanji disagrees. “It wasn’t always all three at once. Sometimes it was only two, or even one, and I still couldn’t hold my own. Niji used to love to get me alone and make me cry. Sadistic fuck.”</p>\n<p>Well then <em> Niji </em>had better hope Zoro never comes across him in a dark alley someday. Otherwise he’s liable to meet the wrong end of Kitetsu. </p>\n<p>Up ahead, he can see the cabin he’s pretty sure is theirs waiting for them. Part of him thinks he should wait until they’ve reached it to ask the question that’s now percolating at the back of his mind, but he suspects he might lose his nerve by then.</p>\n<p>“Hey, Cook,” he says, licking suddenly dry lips. “What about your mother? Where was she during all this?”</p>\n<p>“Dying,” Sanji replies succinctly, “and then dead. She got sick right around the time my brothers and I were born, and spent the next eight years wasting away before her heart finally gave out. Aside from maybe Reiju, I was the only one who cared.”</p>\n<p>“What was she like?”</p>\n<p>“Beautiful,” Sanji says wistfully. “Kind, loving, the only bright light in a dark place. She was happy with me exactly the way I was.”</p>\n<p>“I’m sorry.”</p>\n<p>“Thanks,” Sanji says, or chokes rather, his voice now thick with emotion. “It’s been thirteen years and I still miss her every damn day.”</p>\n<p>“Of course you do,” Zoro says, thinking of how Kuina’s been gone just as long. “She was important to you.”</p>\n<p>“She was,” Sanji says. “Want to know what Judge did once she was out of the way?”</p>\n<p>“Okay, but I can’t promise it won’t make me try to convince Luffy to sail north and hunt him down.”</p>\n<p>“What a sweet Marimo you are,” Sanji coos, his expression on the edge of manic now. “He locked me in a dungeon, with an iron mask over my head, and threw away the key. Well, metaphorically speaking. There was a key. My brothers used to steal it and come down to kick the crap out of me in between training breaks.”</p>\n<p>“Sanji,” Zoro whispers, horrified.</p>\n<p>“Oh god, real names. No no, we’re not doing that,” Sanji insists. “You promised not to think I was weak.”</p>\n<p>“I <em> don’t </em>think you were weak.” Zoro shoots back, hoping like hell there aren’t any Minks lurking around to overhear them. “I think you were an innocent kid who a lunatic decided to torture.”</p>\n<p>“Yeah, I guess that’s one way of looking at it,” Sanji admits, still in that terribly glib tone that Zoro’s positive is hiding dozens of cracks in the facade. “It took me a long time to consider that, though. They all used to tell me I deserved it, and I believed them. Part of me still does.”</p>\n<p>“I can picture the cell so vividly too. Cold and dark and damp, <em> full </em> of bugs.” Sanji shudders, while Zoro’s struck by a memory of teasing him for running from the spiders on Skypeia, and filled with a sudden urge to travel back in time and punch his idiot younger self right in the goddamn <em> face</em>. “Sometimes I dream I’m still there.”</p>\n<p>“You’re <em> not</em>,” Zoro says fiercely. “And you’re <em> never </em>going back.”</p>\n<p>“God, I hope not,” Sanji says. “Even talking about it is like going through a perpetual root canal. I think going back might actually kill me.”</p>\n<p>“The only people who will die if we run into Germa,” Zoro says firmly. “Will be them.”</p>\n<p>They’ve reached the cabin now, and Sanji’s quiet as he unhooks one hand and moves to open the door. Then he slips inside, flicking a nearby light on as he goes, which illuminates exactly how haggard this conversation has him looking. </p>\n<p>“Thanks, Mossball,” he says tiredly. “You know, you can be kind of sweet when you put your mind to it.”</p>\n<p>“Don’t tell anybody,” says Zoro, a man who is currently using every ounce of willpower not to press his luck and ask the cook if he wants a hug. If Sanji actually says yes, there’s no chance Zoro won’t give himself away, and then they’ll have a whole host of new problems on their hands.</p>\n<p>Luckily, Sanji doesn’t say anything further, and Zoro’s able to wrangle himself under control. The cook still looks terrible, though, and Zoro can’t leave him like that. Telling himself it’s a bad idea, but also unable to stop himself, he wanders into the kitchen and pokes around until he finds what he’s looking for.</p>\n<p>“What are you doing?” Sanji asks from the doorway.</p>\n<p>“Nothing you need to worry about,” Zoro replies, shooing him off. “Go have a seat at the table.”</p>\n<p>“Why?” Sanji asks suspiciously.</p>\n<p>“Because I said so,” Zoro retorts. Sanji always brings people food when they’re having a tough time, so Zoro’s going to return the favor. At least, he’s going to as best as he’s able.</p>\n<p>The kettle screams at him once the water’s boiled, and he digs around in a cupboard until he comes up with two matching ceramic mugs. Then it’s a matter of letting the tea bags steep while he brings the whole mess out to the dining area where Sanji’s waiting for him.</p>\n<p>“Zoro,” Sanji says, his eyes suspiciously damp.</p>\n<p>“Save it,” Zoro says gruffly. “There’s milk and sugar in the kitchen. Let me go grab them.”</p>\n<p>Neither of them says anything as the each doctor their drinks to their satisfaction, but finally curiosity forces Zoro to press for the lone detail he’s still wondering about. Stretching his leg out under the table, he nudges Sanji with his foot. “You never said how you got away.”</p>\n<p>“Hmm? Oh.” Staring into the depths of his mug, Sanji shrugs. “My sister, Reiju, she’s not quite the same as the rest. About six months after Judge locked me away, she broke me out of my cell while Germa was invading a country in the East Blue. Cozia, I think it was called. I ran, wound up working as a chore boy on a passenger liner, and eventually I met Zeff.”</p>\n<p>“And now here you are.”</p>\n<p>“And now here I am,” Sanji agrees. “In a pretend relationship with the world’s most unlikely candidate, drinking arguably some of the worst tea I’ve ever tasted.”</p>\n<p>“Hey!” Zoro protests, knocking his foot against Sanji’s again. “Where’s the gratitude for me slaving away over a hot stove just now? Fucking ingrate.”</p>\n<p>Sanji laughs, it’s weak and wet, but genuine for all that, and therefore one of the best sounds Zoro’s ever heard. “Thanks, Marimo. For everything.”</p>\n<p>Zoro taps his foot a third time, confident the other man hears at least some of what he doesn’t say.</p>\n<p>*****</p>\n<p>Zoro wakes the next morning to a heavy weight on one arm and a patch of sunlight beaming directly into his eye. Groaning, he turns away from the blaze and promptly comes face to face with Sanji’s sleeping form. Belatedly remembering that they’d agreed to share the bed before turning in last night, he slowly realizes that the pressure he can feel is the cook passed out on his arm.</p>\n<p>This poses a conundrum for a number of reasons. Currently, Zoro’s traitorous heart and brain have teamed up to remind him how much he wishes this could be reality, while what remains of his common sense is laying out exactly how Sanji’s bound to react if he wakes up and finds them in such a compromising position. Also, his stomach wants breakfast and his bladder is telling him he needs to get up and take a piss.</p>\n<p>All told, just about every organ he can easily name is screaming at him to run for the fucking hills. </p>\n<p>Barely daring to breathe, he tentatively shifts his trapped arm, wanting to see if he can free it without waking Sanji. </p>\n<p>Naturally, Sanji responds by frowning in his sleep and burrowing even further into Zoro’s chest.</p>\n<p>“Oh this isn’t fucking fair,” Zoro murmurs at the ceiling. A few strands of Sanji’s hair are now tickling his cheek, and it takes every bit of his not inconsiderable strength to resist the urge to stroke his hand through them. “What did I do to deserve this?”</p>\n<p>The ceiling fails to offer up any answers, which leaves him laying right where he is, weighing the pros and cons of waking Sanji up before he’s ready. He almost made up his mind to go for when the cook takes matters into his own hands and starts to stir.</p>\n<p>“Mmh?” Sanji murmurs, one pale blue eye cracking open and peering up at Zoro through the fringe of his hair. “Time’sit?” He slurs, still more asleep than awake.</p>\n<p>Zoro blinks. There’s no handy clock nearby, and with the way Zou moves the position of the au isn’t much help to him either. “Early?” He suggests, figuring that’s as good a guess as any.</p>\n<p>The skin around Sanji’s eye crinkles as he smiles, then he yawns, causing a gust of warm breath to waft over Zoro’s chest. “Hrm. S’rry.”</p>\n<p>“S’okay,” Zoro assures him, too busy drinking in the sight of Sanji all relaxed and sleep rumpled to care about much else. “Do you have to get up soon?”</p>\n<p>Sanji’s eyes narrow into contemplative slits for a moment, before widening in alarm. “Oh shit,” he yelps, surging upwards like Zoro had previously been expecting, and then launching himself from the bed entirely.</p>\n<p>“I’m supposed to be helping with the breakfast preparations in the main dining hall,” he exclaims, rooting around for some clean clothes. “There’s no way I’m not already late.”</p>\n<p>“They’ll understand,” Zoro says in a tone he hopes conveys what’s likely to happen to anyone who doesn’t. “And this place must have plenty of other cooks. Don’t stress over the small stuff.”</p>\n<p>“It’s my <em> job</em>, Marimo,” Sanji reminds him. “And while Zou might have plenty of cooks, I’m the only one with years of experience when it comes to handling Luffy. Inflicting him on a bunch of poor, unsuspecting peons is just cruel.”</p>\n<p><em> That </em>much Zoro can give him, even if it does mean his lazy fantasy morning has now come to an abrupt end. Grumbling under his breath, he fights his way free from the churned up bedding, and proceeds to begin searching for his own pants.</p>\n<p>“What’re you doing?” Sanji asks, causing Zoro to freeze with said pants pulled halfway up his thighs.</p>\n<p>“Uh, what does it look like I’m doing?” He asks, shaking the fabric in his hands for added emphasis. “I don’t think anyone’s going to take too kindly to me showing up in the dining hall in my underwear.”</p>\n<p>“No, I mean, yeah, you’ve got a point there,” Sanji stutters. “But I figured you’d want to sleep a bit more before heading over. There might not be anything ready when we get there.”</p>\n<p>Finishing with his pants, Zoro shrugs and roots around for his boots next, remembering too late that they’re out by the front door where Sanji had insisted he leave them. Sighing, he grabs for his haramaki instead.</p>\n<p>“Maybe not,” he says, his words slightly muffled as he hauls the belly warmer down over his head, “but I’m already awake, so there’s no point in sitting around here. Besides, if I get there early I get first dibs on the food, right?”</p>\n<p>“Only if you put a shirt on,” Sanji advises, chucking one at Zoro’s head. “God, you animal.”</p>\n<p>He seems lighter this morning than he has in a while, definitely since their arrival on Zou, if not earlier. Zoro watches him out of the corner of his eye as they leave the cabin, well aware he must have a besotted look on his face as he listens to the other man yammer on about the various delicacies he’s been exposed to by the Minks.</p>\n<p>It’s a far cry from the emotional wreck he’d been the night before, and is obviously the version Zoro prefers.</p>\n<p>Judging by the steady crowd they run into once they step out onto the main path, Zoro’s willing to bet they’d slept even later than anticipated. Sanji frowns, clearly thinking the same thing, so Zoro opts to distract him by flicking him on the ear.</p>\n<p>“The hell?” Sanji barks, swatting him away with his own hand. “What was that for?”</p>\n<p>Zoro shrugs. “Figured it was as good a way as any to get that pout off your face,” he says, grinning at Sanji’s resulting dirty look.</p>\n<p>“Just when I was about to start thinking charitable things about you,” the other man sniffs. “You’re a brute, Marimo.”</p>\n<p>They spend the rest of the trek bickering between the two of them, earning themselves some bemused glances from more than a few passers by. Luckily, once they step into the dining hall, they spot most of their own crew, plus Law, sandwiched at a single table.</p>\n<p>“Zoro! Sanji!” As usual, the first to spot them, Usopp waves them over, and a bunch of their friends shuffle around to make room. “We were wondering when you two were going to show your faces. How did last night go?”</p>\n<p>“I’m assuming fairly decent given the fact that Bege and his crew departed from Zou several hours ago,” Robin says. </p>\n<p>“They did?” Zoro asks. He settles down on the bench next to Nami, leaving enough space for Sanji to join him if he so chooses. As expected, however, the cook waves off the offer and continues on towards his intended destination of the kitchen.</p>\n<p>“Robin and I watched them leave ourselves,” Franky says, effectively dragging Zoro’s attention away from Sanji’s retreating back. “And given that cook bro seems to still be with us, I’m gonna guess your little dinner date went a-ok.”</p>\n<p>“It … went,” Zoro says. “Don’t think Bege liked either of us, but he and his wife both bought our act. Speaking of,” zeroing in on Nami, he makes sure he has her attention before carrying on, “guess who her sister is?”</p>\n<p>She raises an eyebrow at him. “Why would I have any idea?”</p>\n<p>“Oh come on, you could at least give me one guess.”</p>\n<p>Her eyebrow rises impossibly higher. “Did something happen last night that we weren’t expecting? You’re acting weirder than normal.”</p>\n<p>Zoro sighs. “You’re such a killjoy. Her sister’s your friend from the Rolling Pirates. What’s her face who’s proposed to like hundreds of men.”</p>\n<p>“Lola? Really?” Nami asks, her face creasing with happiness when he nods. “That’s crazy. Did she say how she’s doing?”</p>\n<p>Zoro feels his own grin dim. “Uh, actually she hadn’t seen her in years. Turns out Lola was basically banished by their family for something stupid. She’s, um, also Big Mom’s kid. We ended up being the ones to give Chiffon an update on her.”</p>\n<p>“Oh,” Nami says, more somber now. “Well, wherever she is, I hope she’s doing okay.”</p>\n<p>“Speaking of people who may or may not be doing ok,” Usopp says then, his eyes flicking around the room like he’s afraid of being overheard. “How’s Sanji?”</p>\n<p>Zoro takes a moment to consider his answer. “He’s … stressed,” he says finally. “Doesn’t appreciate all these people digging into his past, or making him think about it in general, but he’s holding it together.”</p>\n<p>“And you?” Nami asks. “How are you doing?”</p>\n<p>“Me? I’m fine. Why wouldn’t I be?”</p>\n<p>Even Law perks up enough to give him a flat stare, and Zoro feels his face heat under the weight of everyone’s combined incredulity. “Quit it, would you?” He mumbles.</p>\n<p>Nobody says anything for a moment, but eventually Chopper turns to him with his big brown eyes out in full force. “I’m really sorry, Zoro,” the reindeer says, a noticeable catch in his voice. “This is all my fault. I should have thought before I spoke.”</p>\n<p>He’s sitting too far away to ruffle Chopper’s fur like he normally would, so instead all Zoro can do is shrug. “It’s fine,” he promises. “So long as the cook doesn’t clue in to what’s going on, there’s nothing to worry about.”</p>\n<p>“Wow, that’s really … mature of you,” Usopp says, sounding surprised. “Not that you’re not usually mature,” he’s quick to add, alarmed when Zoro flicks his attention to him. “Obviously you’re - I mean … god, please don’t hurt me.”</p>\n<p>Zoro keeps up the act for a little longer, enjoying the way the sniper starts babbling, but eventually tears his gaze away. “Is there any more coffee?” He asks, noting that a number of the others have mugs in front of them.</p>\n<p>“Someone should be by soon with a refill,” Nami says. “You can get some then.”</p>\n<p>Satisfied, Zoro nods and spares the table another quick glance. “Where’s Luffy?” He asks, confused by the captain’s absence. “He doesn’t miss meals.”</p>\n<p>“No shit,” Nami replies. “He’s with Momo and the Samurai,” she explains, referencing their other companions who Zoro had all but forgotten about in the whirlwind of dealing with Sanji’s family problems. “They want to set sail for Wano as soon as possible.”</p>\n<p>“They’ll be travelling with my crew and I on the way to Wano,” Law interjects. “Given the very real possibility that your ship is going to have either Big Mom or Germa looking for you, it seemed prudent.”</p>\n<p>He says this in an even icier tone than usual, but Law’s never liked it when a wrench gets thrown in his carefully constructed plans. What a pity for him then that he’d chosen Monkey D. “Chaos Incarnate” Luffy to form an alliance with.</p>\n<p>Rather than point this out, however, Zoro opts not to push his already terrible luck any further. “When are we leaving?”</p>\n<p>“That’s what Strawhat and Kin’emon are discussing now.” Law says, making Zoro wonder why, as a captain in his own right, he’s not taking part in those talks. “But probably not for at least a few more days.”</p>\n<p>“The <em> Sunny </em> took some damage while escaping Dressrosa,” Franky explains. “Between that, the fact that Chopper has a couple patients he wants to monitor a little longer, and the need to resupply, we figure it’s a good idea to make sure we’re fully prepared before we take off.”</p>\n<p>Wonderful, that means he and Sanji are going to have to keep up the act for a while yet. Plus, based on what they’ve been told about Big Mom’s spy network, they’re probably going to have to soldier on anytime they’re any place that isn’t the <em> Sunny</em>.</p>\n<p>As if he can sense Zoro’s thoughts, Sanji chooses this exact moment to swan back out into the main hall with a pair of Minks hot on his heels. All three are laden down with trays of food, and the Strawhats’ table appears to be their intended destination.</p>\n<p>“Breakfast is served,” Sanji declares, beginning to set stacks of pancakes down in front of everyone. “There’s plenty more where these came from, so don’t be shy about digging in, and there’s eggs and bacon coming soon too.”</p>\n<p>“Is there more coffee, Sanji?” Robin asks. “Not for me, but Zoro was just wondering, and no one appears to have brought a pot out with them.”</p>\n<p>In answer, Sanji spins his tray around and plucks a steaming mug off of it. He makes a show of blowing on it to cool it down, and then sets it directly in front of Zoro. “It’s just the way you like it, darling - no sugar and as black as your soul.”</p>\n<p>“Are you sure about the no sugar?” One of the Minks asks, leaning over with a handful of cubes. “We have plenty to go around.”</p>\n<p>“He doesn’t like sweet things,” Sanji says, gently but firmly as he pushes away the encroaching arm. Then he rests a proprietary hand on Zoro’s shoulder, making him choke. “Trust me, I’d know.”</p>\n<p>The second Mink, a younger female that Zoro vaguely recognizes, titters. “It looks like he likes some sweet things, Mr. Cook,” she gushes, batting her eyes at Sanji, who blushes a furious red, but doesn’t move his hand.</p>\n<p>“That’s debatable,” he says. “Now, would one or both of you mind checking on the state of the eggs. I don’t want anyone going hungry.”</p>\n<p>Both Minks happily rush off to do the cook’s bidding, and Sanji sighs as he watches them go. “Not that these people aren’t lovely,” he says, “but I think I’ll be happier once we’re back on the <em> Sunny</em>.”</p>\n<p>“Should be soon,” Zoro grunts, which earns him a pleasant squeeze from Sanji that requires him to take a fortifying gulp of his coffee. </p>\n<p>“It’s still hot, you idiot,” Sanji scolds when he winces. “Careful that you don’t burn yourself.”</p>\n<p>“Too late,” Zoro mutters, setting the mug down to give the beverage a little longer to cool off. </p>\n<p>Sanji sighs the sigh of the perpetually exasperated, but <em> still </em>doesn’t move his hand. “The Minks have offered us full use of their food storage facilities, so I’m probably going to spend most of the day restocking our supplies. I don’t suppose you’d care to help?”</p>\n<p>His thumb is now stroking over the plain of Zoro’s neck in short, little sweeps, effectively robbing him of all coherent thought. “Uh, sure,” he says belatedly, only partially aware of what he’s agreeing to. “I could do that.”</p>\n<p>Sanji gives him a pleased smile, one of the genuine ones that do awful, terrible things to Zoro’s insides. “Great,” he says brightly. “Thanks, Mossy. We’ll head out as soon as we’re done eating, and anyone else who’d care to join us should feel free.”</p>\n<p>The rest of the crew - traitorous bastards to a man - suddenly have a whole host of other things they need to do today. Some of them sound legit, while most are decidedly less so. Zoro doesn’t care what Usopp says, the man does not have a pressing weight lifting regimen he needs to attend to.</p>\n<p>For once, Sanji doesn’t seem overly bothered by the lack of assistance. Shaking Zoro’s shoulder slightly, he lets out a quiet chuckle. “Looks like it’s just you and me, sweetheart,” he says, and then proceeds to do more damage than any enemy Zoro’s ever faced by leaning over and pressing a quick kiss to his cheek.</p>\n<p>“I’ll come find you when I’m ready to leave,” he says, his own cheeks dusted a light rosy pink as he pulls back.</p>\n<p>“Sure,” Zoro squeaks, the sound that comes out of his mouth more akin to something that might be heard from Chopper or Usopp. He stares resolutely ahead of himself as Sanji bustles off, hardly daring to breathe.</p>\n<p>Nobody says a word at the table for at least a minute, until finally Franky awkwardly clears his throat. “You, uh, okay there, Zo-Bro?”</p>\n<p>Zoro has no idea what his face is doing right now, and nor does he want to. “Is he back in the kitchen yet?”</p>\n<p>“Uh, yeah. Why do you ask?”</p>\n<p>In answer, Zoro slams his head against the tabletop, hard enough he’s surprised it doesn’t break.</p>\n<p>“Ah.”</p>\n<p>*****</p>\n<p>Sanji hadn’t been kidding when he’d said he had a lot of restocking to do. Gathering the supplies he’s after takes up most of the day, so much so that there’s no way they’re going to be able to do both that <em> and </em> transport it all the way down to the <em> Sunny </em>in on go, thanks to the size of Zunesha.</p>\n<p>As such, the cook declares that the actual moving of the hood will be tomorrow’s project, and contents himself with gathering and packaging everything for now. It’s then moved to the outskirts of the island, where it can start being moved first thing in the morning.</p>\n<p>It’s enough activity that they’re both exhausted by the end of the day - although Zoro still thinks Sanji’s issues are partly a result of emotional strain - and they don’t make it back to the cabin until well after the sun has set.</p>\n<p>They have a brief argument over the sleeping arrangements where Zoro attempts to reclaim his previous spot on the floor, but Sanji is having none of it. The cook is oddly insistent that it’s not fair for him to do that on top of everything else he’s already taken on, and Zoro resigns himself to caving in the face of Sanji’s resolute expression.</p>\n<p>Telling himself he’ll just stay strong and keep himself to the far end of the bed so as to avoid any further instances of accidental cuddling, Zoro drifts off into a fitful sleep that’s ultimately interrupted by a flailing knee to his back in the middle of the night.</p>\n<p>At first he doesn’t know what’s happening, mildly disoriented because his back is now throbbing, yet his observation haki is convinced there are no enemies in sight. Then he registers the faint sound of a choked off whimper, and it dawns on him that there’s an enemy present, alright, just not necessarily one he can fight. </p>\n<p>Zoro’s no stranger to sharing a room with someone who’s having a nightmare. They all get them at times, it’s inevitable with the lives they lead, but it’s different when he and the person are in the same bed. To say nothing of the fact that there’s no one else to step in under the circumstances.</p>\n<p>On the other hand, he’d rather take Wado to his own throat than he would leave Sanji trapped in the throes of a nightmare when he doesn’t have to. Rolling over and propping himself up on one arm, he peers down at the cook, considering his best avenues of approach.</p>\n<p>He’s heard Sanji have bad dreams before, but they’re usually quiet things where he’s restless for a time, only to eventually wake and drag himself off to the galley before anyone can say anything. <em> This </em> isn’t that. Tonight Sanji’s head is jerking from side to side, his limbs are twitching, and if Zoro listens close enough, he can hear words spilling from the other man’s lips, quiet pleas to be let out and promises that he’ll get stronger.</p>\n<p>It’s the cell, Zoro realizes, the one Vinsmoke Judge had locked him in as a child, that’s what he’s dreaming about. His own stomach roiling, the swordsman doesn’t think about what he’s doing before curling his free hand around the cook’s bicep and shaking him gently.</p>\n<p>He earns himself another kick for his troubles. This time it’s a hit directly to the stomach, a heavy, instinctive thing that rips all the breath from Zoro’s lungs and leaves him doubled over and gasping.</p>\n<p>Sanji’s distressed noises cut off abruptly as he’s jerked back to consciousness thanks to the cacophony Zoro’s now making. “Whaa -?” He tries groggily. “Oh shit, Marimo!”</p>\n<p>“It’s fine, I’m fine,” Zoro wheezes, his good eye watering as he braces his hands on the mattress and sucks in heaving lungfuls of air. “S’my own stupid fault for startling you.</p>\n<p>“No no, it was me - I shouldn’t have - shit. Fuck. Fucking damnit all to hell!” Reaching for Zoro with hands that are still trembling, he paws weakly at his face, like he’s trying to search for an injury.</p>\n<p>Zoro can’t help but snicker as he fends him off. “That’s not where you hit me, idiot.”</p>\n<p>Part of him is expecting Sanji to laugh too, and for his usual mask to slip into place, such that he can pretend nothing had happened. That’s apparently beyond him tonight, however, because what he actually does is let out a low noise of distress and curl in on himself.</p>\n<p>“I’m sorry,” he sniffs, sounding far, <em> far </em> too close to tears for Zoro to handle. “I don’t know what the fuck’s wrong with me. I haven’t been like this for <em> years</em>, but all of a sudden I’m a fucking wreck. I can’t think, I can’t breathe, I can’t - <em> shit.</em>”</p>\n<p>Fisting one hand in his hair, he punches the other repeatedly into the mattress, his breath now coming in short, sharp pants, all indicative of a man on the verge of a panic attack. </p>\n<p>Most of Zoro yearns to drag him into his arms and hold him until this passes, but he’s positive that would just get him kicked again. Not even necessarily on purpose, but because Sanji’s too out of it to focus and is likely to perceive most contact as a threat.</p>\n<p>With that in mind - but equally unwilling to sit back and let his companion suffer - Zoro rolls up out of bed and onto his feet. He thinks he hears Sanji make a confused noise behind him, yet doesn’t let this derail him from his trek to the kitchen.</p>\n<p>He finds the counter by slamming into it, wincing slightly when he bumps the spot Sanji’s already kicked. Then he passes along it until he finds the rack where tonight’s dishes had been left to dry after washing, rooting around until he comes up with a glass.</p>\n<p>Glass successfully procured, his next move is to find the sink and the faucet, and he yanks at the tap so he can fill the cup with a stream of cold water. Only once this task is completed does he head back towards the bedroom.</p>\n<p>Sanji’s sitting in the middle of the bed with his head in his hands and the bedding a churned up mess around him. He doesn’t look up when Zoro first enters the room, but does make an inquiring noise when the swordsman nudges his shoulder with the glass.</p>\n<p>“Hmm?” He tries weakly, and Zoro nudges him a little harder.</p>\n<p>“Take it,” he says firmly. “It’ll give you something to focus on, to help break through the panic.”</p>\n<p>It’s a testament to how badly off Sanji is that he doesn’t protest the use of that word. In fact, he doesn’t protest anything, just takes the glass with a shaky hand, such that Zoro doesn’t release his own hold until he’s sure Sanji’s not going to drop it and douse himself.</p>\n<p>The room quiets as Sanji begins taking slow, measured sips of his water, a little of the tension leaching out of his posture the longer he goes. It doesn’t disappear entirely, however, with shudders still occasionally running through his body, and Zoro doesn’t really think about what he does next.</p>\n<p>The bed dips as he settles back down next to Sanji, a few springs creaking as they adjust to his weight. Neither man says anything, but Sanji sucks in a heavy breath when Zoro lays a careful hand on his back.</p>\n<p>Zoro stays patient, waiting him out to see if he’ll say something or try to buck him off. He stays quiet, though, and after a few minutes of stilted silence slumps a little further into the touch. Satisfied he’s made the right call, Zoro starts lightly dragging his fingers over Sanji’s back, moving his hand in gentle sweeps that are meant to do nothing but offer what comfort he can. </p>\n<p>Sanji’s breath hitches, the sound a clear indication that he’s not sure what to make of this, but he <em> still </em>doesn’t move away. “You don’t - you don’t have to do this,” he finally says raggedly. “It’s only us here. There’s no need to keep up the act.”</p>\n<p>Zoro blinks. Truth be told, he’d forgotten all about the roles they’re supposed to be playing and had reacted on instinct. </p>\n<p>He spends a few moments debating with himself on whether or not he <em> should </em> pretend it’s all an act, but shoves that thought aside almost immediately. Instead, he shifts his grip, curls his arm around Sanji entirely, and tucks him up against his side. </p>\n<p>“I’m not acting,” he says gruffly, but is quick to add before Sanji can get concerned. “We’re crew. <em> Nakama. </em> I don’t care how much we fight with each other, I’m not going to leave you suffering like this when there’s something I can do about it.”</p>\n<p>“I’m fine.” Sanji insists, shoving at Zoro’s chest with the hand holding his now empty glass.</p>\n<p>“You’re not,” Zoro disagrees. There’d been no force behind the shove whatsoever. The move had been entirely for show, and is therefore a clear indication that Sanji doesn’t want him to let go, even if he can’t bring himself to admit as much out loud.</p>\n<p>In further proof of this, Sanji doesn’t even bother doing it a second time. Sniffing wetly, he hides face in the juncture between Zoro’s neck and shoulder, his fingers toying idly with the glass in his hands. “I hate this.”</p>\n<p>“I know,” Zoro replies, close enough to Sanji that a few strands of the other man’s hair tickle his lips. It would be so, so easy to brush a kiss to his forehead or his temple. So much so that Zoro has to count to ten in his head lest he actually do it.</p>\n<p>“It’s not your fault,” he says, once he’s certain he has himself under control. “And it’s nothing to be ashamed of.”</p>\n<p>“Like hell it isn’t,” Sanji snorts. “This is mortifying. I can’t believe I’m this upset by a fucking memory. I’m essentially proving Judge right about how weak I am.”</p>\n<p>“You’re not,” Zoro says simply. “Not at all.”</p>\n<p>Sanji looks up at him then, pulling his head from where he’s got it buried in Zoro’s shoulder to peer at him suspiciously. For his part, Zoro simply gazes impassively back at him, waiting for the blond to find whatever it is he’s looking for.</p>\n<p>“You really mean that, don’t you?”</p>\n<p>“Mhm,” Zoro replies. “You weren't weak in the past, you were just a normal kid, and you’re not weak now. I mean,” he adds, projecting a teasing air into his tone to try and lighten the mood, “you’re obviously not in <em> my </em>league, but I guess you’re okay.”</p>\n<p>Sanji headbuts him none too gently in the chin. “Asshole,” he mutters. “And here was me thinking you might have actually developed some class for a second there. Spoke too soon, I suppose.”</p>\n<p>“Yeah, yeah,” Zoro says, relieved to hear him sound more like himself. Then, more seriously, he asks, “You think you’re through the worst of it?”</p>\n<p>“For now, anyway,” Sanji admits with a deliberately casual shrug. “Enough to try and get a bit more sleep, at least.”</p>\n<p>“Okay,” Zoro says, risking a quick glance down at the bed. As he’s noticed earlier, the bedding is a churned up mess, and a quick prod at the sheet finds parts of it clammy to the touch where Sanji had sweated through it.</p>\n<p>Frowning, he draws his hand away. “Did this place come with spare sheets?”</p>\n<p>“Uh, think I saw some in the linen closet when I went looking for towels yesterday,” Sanji says. “Why do you ask?”</p>\n<p>“Cuz I want to build a blanket fort at three in the morning,” Zoro drawls. “Why do you think? I’m gonna change ‘em so we can be more comfortable.”</p>\n<p>“O-oh,” Sanji says, belatedly catching on. “That’s a good idea, but let me do it. I’m the one who made the mess.”</p>\n<p>“Not a chance.” Zoro says, standing in one fluid motion and effectively evading the cook’s grasp. “In fact, you might want to grab some clean sleep clothes if you have any. You’ve sweated all over the ones you’re wearing.”</p>\n<p>“Are you saying I smell?” Sanji demands irately. “That’s rich coming from he who regularly denounces the act of bathing.”</p>\n<p>“Didn’t say anything like that,” Zoro says, already moving for the doorway and the spot where he vaguely remembers the linen closet to be. “But … if the dress shoe fits …”</p>\n<p>“Marimo, for once I’m feeling vaguely benevolent to you. Don’t ruin it by making me want to kill you like usual.”</p>\n<p>Chuckling to himself, Zoro flips him off as he fully exits the room.</p>\n<p>*****</p>\n<p>If Zoro had expected things to be awkward between them the next day, he’s sorely mistaken. They don’t talk about what happened - obviously, they’re <em> them </em> - but nor do they start dancing around each other in some elaborate form of denial either. They simply go back to their usual banter, and Zoro does his best not to read anything into that.</p>\n<p>Luckily, they’re busy enough getting ready to depart for Wano that they wouldn’t really have enough time to let things get awkward even if they wanted to. There’s lots to do in prepping the <em> Sunny</em>, and they’re as big a part of that as any.</p>\n<p>Franky’s rigged up a similar pulley system to the one that had been used in bandaging Zunesha’s injured leg. Only this one goes all the way down the elephant, coming to a rest only a few feet above where the <em> Sunny </em>is moored. The shipwright’s been using it to do his repairs, but Zoro and Sanji, along with a little help from a grumbling Usopp, commandeer it to aid in their restocking venture.</p>\n<p>It takes multiple, unfortunately <em> lengthy </em> trips to get everything down, and then they need to get everything safely stored away. Sanji also insists on cataloguing every item of food that gets brought aboard, an act that sees Zoro nearly weep tears of boredom before the cook throws a fishing rod at his head and tells him he can do that rather than sit around the galley making a nuisance of himself.</p>\n<p>Usopp is similarly gifted with a pole, and the two of them sit in semi-companionable silence by the railing, drawing up whatever they manage to catch and tossing it in the aquarium. It’s peaceful, almost enjoyable even, until the sniper makes a show of clearing his throat.</p>\n<p>“No.” Zoro says preemptively.</p>\n<p>“You don’t even know what I was going to say!” Usopp squawks indignantly.</p>\n<p>“I don’t need to,” Zoro retorts. “It was either going to be about how the cook’s doing or how <em> I’m </em> doing. I’m not willing to talk about either of those, especially not with you.”</p>\n<p>“Wow, hurtful,” Usopp says, theatrically grabbing his own chest. “Out of all the years we’ve known each other, sailed together, had each other’s backs, I would never have thought you could cut me so deep. You’re a cruel, cruel man, Roronoa Zoro.”</p>\n<p>Zoro watches him roll around a little longer, sighing when he rocks too hard and nearly pitches himself over the side of the ship. “Are you done yet?” He asks mildly, earning himself a sheepish grin for his troubles.</p>\n<p>“Yeah, I think so,” he says. “But,” he’s quick to add, meaning Zoro had spoken too soon if he thought he was in the clear, “I do think you need to talk about what you’re going through. This mess is hard on both of you, even if it’s in wildly different ways.”</p>\n<p>“I’m fine,” Zoro says resolutely, “and so’s he.”</p>\n<p>“Really?” Usopp asks warily.</p>\n<p>Zoro keeps his gaze focused squarely on the ocean, refusing to let anything show on his face. There’s no way Sanji would be comfortable with more people than necessary knowing how badly he’s struggling right now, and Zoro will keep his confidence unless it becomes an active threat to the crew.</p>\n<p>“Hmmm,” Usopp says. It’s obvious he doesn’t entirely believe what Zoro’s saying, but he’s missing enough details to not be able to viably push.</p>\n<p>“Fine. Keep your secrets,” he declares eventually. “It’s not like I’m interested in them anyway.”</p>\n<p>That’s a massive lie even by Usopp’s standards, but if it gets him to shut up, Zoro’s not going to call him out on it. He’s perfectly content to sit right here and focus on his fishing.</p>\n<p>The sound of Usopp grumbling in his throat is obnoxiously loud in the stilted silence. Zoro can feel his forehead furrowing as he’s hit with a sudden urge to fling the longnosed man overboard himself.</p>\n<p>As if sensing where Zoro’s mood is heading, Usopp holds his hands up in a placating gesture, his fishing rod hovering dangerously in his grip. “I know, I know,” he says. “Believe it or not, I’m perfectly capable of figuring out when you want a conversation to end.”</p>\n<p>“Having said that,” he continues on in a frankly admirable act given the glare Zoro’s currently levelling his way. “I just want to make it clear that if you ever <em> do </em>want to talk, or if there’s anything I can do to help, feel free to let me know.”</p>\n<p>Zoro grunts, and Usopp sags in relief, recognizing the response for the peace offering it is.</p>\n<p>“Good talk, buddy,” he says, shifting his hand like he’s going to clap it over Zoro’s shoulder and then clearly thinking better of it. “Good talk.”</p>\n<p>*****</p>\n<p>They get the <em> Sunny </em> stocked and loaded, Franky finishes whatever projects he’s working on, and Nami picks up some useful sea charts that are provided to her by the Minks. Once Chopper arrives and confirms there’s nothing further he needs to do for any of his patients, Luffy flings both hands in the air and declares it’s time for them to set sail.</p>\n<p>“Not a chance, moron,” Nami says, driving her own fist into the back of their captain’s skull. “It’s almost dusk and most of us have been working all day. We should use this time to get a good night’s sleep, and then everyone will be refreshed when we leave in the morning.”</p>\n<p>“Aww, Nami.” Luffy whines, rubbing at his head. “That’s no fair. Torao and the samurai are already long gone,” he points out, referencing the Heart Pirates who’d departed earlier that day. “What if they find fun things to do in Wano without us?”</p>\n<p>“From what Kin’emon’s told us, I don’t think there’s much ‘fun’ to be had in Wano,” Nami mutters. “And the <em> Polar Tang </em> is faster than the <em> Sunny </em>anyway. Even if we’d left at the same time, they’d still be ahead of us by now.”</p>\n<p>“What?” Luffy demands, looking offended. “Torao’s not allowed to have a faster ship than me when I’m gonna be King of the Pirates. Hey, Franky! Do something to make the <em> Sunny </em>faster, okay?”</p>\n<p>Franky dutifully flashes him a thumbs up. “Sure thing, Captain-Bro. We’re probably gonna need more storage space for cola, though.”</p>\n<p>“That’s fine!”</p>\n<p>“Well that sounds like both a recipe for disaster and an idea we need to get out of his head right this fuckin’ minute,” Sanji says from where he’s standing not far from Zoro’s side. Pulling the cigarette is currently enjoying out of his mouth, he curls it between two fingers and waves him to get the captain’s attention.</p>\n<p>“Oi, Luffy! You realize if we stay one more night we can probably have a big goodbye dinner with the Minks, right?”</p>\n<p>It works like a charm. His eyes lighting up, Luffy whirls to face them, a small trail of drool already forming at the corner of his mouth. “You mean like a feast?” He crows, delighted.</p>\n<p>“Well, so long as the Minks are okay with it,” Sanji replies. “I’ll even offer to cook to try and repay them for their hospitality.”</p>\n<p>Luffy breaks out into an impromptu victory dance, dragging Chopper and Usopp into the mess with him. Nearby, Wanda and Pedro, who’ve been consulting with the Strawhats to see what their plans are, both nod approvingly. </p>\n<p>“Your crew saved our island,” Wanda says happily. “As if we’d ever pass up a chance to celebrate with you.”</p>\n<p>“Especially if you’re the one cooking, Sanji,” Pedro adds, and Zoro manfully resists the urge to start glaring at the jaguar Mink. “No one here is going to say no to a last opportunity to experience that.”</p>\n<p>“Careful, he’s got a big enough head already.” Zoro warns, smirking when this works exactly as he’d hoped and drags Sanji’s attention away from the Mink in favour of trying to kick his face in.</p>\n<p>“Stupid, Mossball,” Sanji grouches when Zoro blocks the kick with Shusui. “One of these days I really am going to kill you.”</p>\n<p>“Bring it on, Twirlybrows.”</p>\n<p>“He can’t!” Luffy yells from the pile he’s now in. “Sanji, you need to start cooking right away. I want food!”</p>\n<p>“<em>Ugh</em>, shitty Marimo, shitty captain.” Sanji complains. “Honestly, I don’t even know why I put up with you people.”</p>\n<p>The complaining is all for show, of course, and several hours later not only the Strawhats but what feels like half the Mink tribe are scattered throughout the main hall, all of them enjoying Sanji’s delicious food. Even the cat and the dog are being civil to each other in exchange for neither having to stray too far from the buffet table.</p>\n<p>Sanji’s a whirlwind throughout it all, barely stopping at any point as he keeps bringing out dish after dish. No matter how many times people offer to help him, he waves them off each time and then promptly disappears back into the kitchen.</p>\n<p>Eventually, however, even he can’t cook any longer, and the pressure of everyone telling him to take a break lures him over to where a number of people, Zoro among them, are clustered on various chairs and benches, all of them either completely satiated or just about there.</p>\n<p>“Sanji!” Pedro calls from his spot on a bench with Wanda and Nami. “Come join us!”</p>\n<p>Sanji laughs, gesturing at first the specific bench the trio are occupying, and then the surrounding area. “It doesn’t look like there’s any room for me,” he notes. “I’ll have to go find a spare chair or something.”</p>\n<p>“Good luck,” Carrot giggles around a mouthful of food. “There’s way more people in here than usual.”</p>\n<p>“Not a problem, little sis!” Franky cuts in, and for a second Zoro thinks the cyborg’s about to start building a new seat right then and there. However, instead he plasters a huge grin on his face and points directly at Zoro himself. “The big guy’s lap is unoccupied.”</p>\n<p>It’s a good thing Franky’s already completed the repairs on the <em> Sunny</em>, Zoro thinks, since it’s going to be awfully hard for him to get anything done after he loses both his arms. He may have one hand already occupied with a tankard of ale, but the other’s fully capable of wielding a sword right now.</p>\n<p>That is, until it <em> isn’t. </em>Sanji must be in an especially impish mood - either that or any gods that might be listening absolutely <em> hate </em>Zoro - because the cook gives Franky a look that clearly says ‘two can play at this game’ and drops himself down onto Zoro’s lap without any further fanfare.</p>\n<p>The action is unexpected enough that Zoro winds up splashing beer all over his own arm, while the other automatically comes up to cradle the cook’s waist, not wanting him to fall. His hand spasms slightly, having no idea where to safely place itself, and Zoro’s pretty sure he sees his life flash before his eye when Sanji gives him an exasperated look.</p>\n<p>“Would you look at the mess you've made of yourself, you big ox,” he says, rolling his eyes at the beer that’s still dripping down Zoro’s arm. “Hold on, I’m sure I have a - no, don’t <em> lick </em> it!” He snaps, when Zoro moves to do exactly that. “Oh my god, what in the world possessed me to marry you, you barbarian?”</p>\n<p>“Uhhh,” Zoro says helpfully, which earns him another eye roll as Sanji starts rooting around in his back pocket for something. The motion sets him squirming in Zoro’s lap, and the swordsman holds himself excruciatingly still, lest he suffer a reaction that will get him summarily murdered.</p>\n<p>“Aha!” Apparently having found what he’s looking for, Sanji pulls a pristine white handkerchief free from his pocket and leans over to begin patting at Zoro’s arm dry. “Honestly,” he grumbles. “It’s like I have to do everything around here.”</p>\n<p>“My way would’ve worked just as well,” Zoro says, blinking when Sanji flicks him in the nose with the now soiled cloth.</p>\n<p>“No, it wouldn’t have,” the cook says, rolling the kerchief up into a ball and tossing it to where a number of dirty dishes have been gathered by those who are done with them. “And don’t you dare forget where that is, or you’re getting me a new one.”</p>\n<p>“You’re the one who spilled my drink!” Zoro protests, or at least he starts to anyway. Unfortunately for what little sanity he has left, Sanji chooses this exact moment to loop both his arms around Zoro’s neck, and what actually ends up coming out is a tortured squeak.</p>\n<p>“Too much?” Sanji murmurs worriedly, the question covered up by the guffaws coming from a number of witnesses.</p>\n<p>“No,” Zoro manages to choke out, equally quietly. “No, you’re fine.”</p>\n<p>“Good,” Sanji replies.</p>\n<p>Across from them, Franky, the bastard, is laughing so hard he’s got tears in his eyes. He opens his mouth to say something, only for several hands to suddenly sprout all around his head, effectively cutting off his ability to speak. </p>\n<p>Zoro shoots Robin a grateful look at where she’s planted by her partner’s elbow, and she smiles serenely back at him. A quick glance around the group shows that no one else seems to think anything is amiss, although he could do without the way Nami’s smile is edged with pity.</p>\n<p>Sighing, he knocks back the remains of his drinking, staring forlornly at his empty mug when he comes up with barely half a gulp. </p>\n<p>“I can get you some more,” Sanji says, his own gaze fixed on the tankard. “Since you can’t exactly get up with me sitting like this.”</p>\n<p>Zoro snorts. “First of all, I’m perfectly capable of going to get more booze even while carrying your scrawny ass. Second of all, don’t bother. Someone’ll probably be along with more in a bit, and you just sat down. You’ve been going nonstop all night.”</p>\n<p>“Ship’s cook, remember?” Sanji points out. “It’s kind of my job.”</p>\n<p>“Tell that to someone who doesn’t know <em> exactly </em>how much sleep you got last night.”</p>\n<p>“Mossball,” Sanji says sharply, his tone laced with just enough genuine ire to make Zoro back off. “I won’t use that as an excuse not to fulfill my duties.”</p>\n<p>Sighing, Zoro lets his empty mug drop carefully to the floor, and then winds his now free arm around Sanji’s waist in a mirror of his other one. Part of him knows he should dump the cook to the ground and play it off as a joke, but the rest of him - the <em> oh-so-selfish </em> rest of him - knows he’s not likely to get this opportunity again and can’t bring himself to pass it up.</p>\n<p>“M’sorry,” he mumbles, as contrite as he knows how. “Didn’t mean anythin’ by it.”</p>\n<p>“You better be,” Sanji replies, further leaning into the act by pressing their foreheads together. “Otherwise we’re going to take this outside so I can properly kick your ass.”</p>\n<p>They’re close enough and quiet enough that no one else can pick up what they’re saying, meaning that to the unknowing eye they look like nothing more than a pair of lovers enjoying an intimate moment together. Naturally, this means a bunch of the Minks start catcalling them, and a handful of the Strawhats join in as well.</p>\n<p>“Get a room, you two!” Brook hoots from somewhere in the crowd, while Franky once again starts blubbering. “There are people around.”</p>\n<p>Sanji lets out an irritated sigh. “Our crew mates are morons. Well, minus the ladies anyway.”</p>\n<p>“That’s not exactly news, Curly,” Zoro points out, making a face when Sanji digs his chin into the top of his head in reprimand. “Knock it off, jackass.”</p>\n<p>Sanji’s kind enough to stop what he’s doing, but rather than move his face away entirely, he drops his head down onto Zoro’s shoulder, while all of his limbs sag like they’re suddenly much heavier than they were before. “As much as it pains me to admit it,” he says softly, “I really am tired.”</p>\n<p>“You wanna call it a night?” Zoro asks.</p>\n<p>“I probably should,” Sanji admits. “We’ve got an early start tomorrow, and it’s not like where we’re heading is bound to be peaceful, but …” He trails off, his tone somber. “Who knows when we’ll be back here again, if ever? Anything can happen out there, and I don’t want to miss out on a chance to spend time with friends.”</p>\n<p>Zoro eyes him thoughtfully for a moment. “You’re worried about Germa, aren’t you? You don’t think this mess is over yet.”</p>\n<p>Sanji shrugs, which is as good an answer as any. “Judge isn’t in the habit of taking no for an answer.”</p>\n<p>“Sucks to be him then because he’s going to get a firsthand lesson in it if he comes at you.” Not caring that it’s risky, Zoro starts trailing a hand over the cook’s back, the motion similar to the one he’d been making the night before. “We’re not gonna let him get away with any shit.”</p>\n<p>“Intellectually, I know that,” Sanji says, making no move to stop Zoro’s ministrations. “But it’s still hard to shut up the little voice that’s screaming in the back of my head.”</p>\n<p>That much Zoro understands, and he wishes there was something more substantial he could do to help. Right now he feels oddly powerless, which isn’t something he’s used to, and the very idea of it pisses him off.</p>\n<p>“I can’t predict what’s going to happen,” he says finally, “but I <em> can </em>promise that you’re not going to have to deal with whatever it is alone. Maybe that’s not much, but - ”</p>\n<p>“No, it is.” Sanji cuts him off, his eyes serious and his voice thick. “It’s - you don’t know how much that means. You <em> can’t. </em>My whole life in Germa - alone is the only thing I ever was.”</p>\n<p>Unable to stop himself, Zoro makes a displeased sound low in his throat and amps up the movements of the hand that’s sweeping over the cook’s back. As far as he’s concerned, it’s a poor comfort compared to the demons the other man is currently facing, but it’s all he can do under the circumstances.</p>\n<p>For his part, Sanji doesn’t seem to mind. In fact, his face softens and he relaxes further into the touch. “You’re good at that,” he murmurs, playing absently with the hairs on the back of Zoro’s neck as he slumps against his chest. “I never - this has been a real eye opening experience for me.”</p>\n<p>Hopefully not <em> too </em>eye opening, Zoro thinks to himself, but makes no move to stop what he’s doing.</p>\n<p>*****</p>\n<p>They leave Zou around mid-morning the next day. There are a number of tearful goodbyes and well wishes exchanged on either side, which Zoro finds kind of overwrought. The Minks are now part of the alliance that’s due to take on Kaido, meaning a number of them will be heading for Wano in their own time.</p>\n<p>Pointing this out earns him an eye roll and a sharp elbow to the gut from Sanji, who’s in the midst of his own farewells. </p>\n<p>“Don’t mind him,” he says to a bemused looking Pedro. “In case it’s somehow escaped your notice over the past three days, he’s a bit of an idiot.”</p>\n<p>As usual, the jaguar Mink chuckles, but doesn’t say anything further. He then nods as Sanji wanders off to say something to Carrot, before turning to Zoro and offering his hand. “This goes without saying, I’m sure, but you’ll keep an eye on him, won’t you?”</p>\n<p>Despite his very real position as a potential rival, Zoro can’t help but like the Mink, so he takes the proffered hand without issue. “Obviously,” he replies. “Protecting the crew is my job, and that includes him.”</p>\n<p>“That wasn’t exactly what I meant, but I’ll accept your answer in the spirit it was intended,” Pedro says, blinking in the strange, lazy cat way of is. “See you in Wano, Roronoa.”</p>\n<p>“Yep,” Zoro agrees, before moving to step into the structure that’s once again been rigged up to transport all the Strawhats down to the <em> Sunny.</em></p>\n<p>Luffy had wanted to simply jump from Zunesha’s back, but had been immediately overruled by an enraged combination of Nami and Sanji.</p>\n<p>He’s the first one to set foot on the pulley system, but most of the others follow suit quickly. Nami’s the last of them to climb onboard, busy exchanging numerous hugs goodbye with Wanda, but eventually she joins them, and Franky begins working the mechanism that’ll lower them down to the sea.</p>\n<p>“You’re sure this is safe, right?” Usopp asks, fidgeting nervously as the refurbished boat swings out over the launching pad. “Like, there’s no chance something’s going to snap and send us plummeting into the ocean, is there?”</p>\n<p>“Given how high up we were, it’s more likely that any plummeting we did would simply be to our deaths,” Robin announces, earning herself a combination of exasperated noises and uneasy glances from the crew.</p>\n<p>“Great, thanks, Robin. That was exactly what I wanted to hear,” Usopp says, now joined by an equally anxious looking Chopper. “Would it kill you to go one day without predicting our gruesome demise?”</p>\n<p>“It might?” She replies with a tiny smile.</p>\n<p>“Ugh, Franky!” Usopp groans. “Tell me this contraption isn’t going to get us all killed.”</p>\n<p>“Bro, you literally already used it to load up the <em> Sunny </em>and to help patch up Zunesha,” Franky says, sounding offended. “Plus, you climbed up here the first time on the back of a deformed drawing of a lizard. Would you rather we tried that again instead?”</p>\n<p>“Mainly I’d just rather we were back on the ground,” Usopp says morosely. </p>\n<p>Having settled himself in the depths of the boat already, Zoro curls his arms behind his head and sprawls out with little concern for how slow their descent is going. “You should try taking a nap,” he suggests, already considering one of those for himself. “It’ll make the time go by faster.”</p>\n<p>“How can you sleep knowing we might fall to our doom at any moment?” Usopp asks.</p>\n<p>“Because he can sleep through anything,” Sanji says, pulling a cigarette from his latest pack and flicking his lighter open. “Or almost anything,” he adds offhandedly, most of his attention now focused on igniting his smoke.</p>\n<p>“What’s that supposed to mean?” Chopper asks curiously, tilting his head to one side.</p>\n<p>“Hmm? Oh - um, nothing much,” Sanji says, the bridge of his nose flaring slightly pink. “Just more of a general comment, really.”</p>\n<p>Zoro soon feels the weight of multiple eyes on him, so he closes his own in self-defence, figuring that if he can’t see them, maybe for once in their lives his friends will leave well enough alone.</p>\n<p>“So, this seems like as good a time as any, bros,” Franky pipes up, “but I should probably tell you I made you your own bedroom.”</p>\n<p>*****</p>\n<p>The bedroom debacle carries them all the way down to the <em> Sunny</em>, and at one point nearly capsizes the lift when Luffy gets particularly energetic for not being given <em> his </em>own room. </p>\n<p>“Cap,” Franky says tiredly, “I <em> did </em> make you your own, remember? <em> Sunny </em> was built with private quarters for both the captain and first mate, it’s just you and Zoro never <em> use </em>‘em.”</p>\n<p>“Oh, right,” Luffy says, about to shove a contemplative finger up his nose and only stopping when Nami slaps his hand away. “Well then why does Zoro get to have two?”</p>\n<p>“He doesn’t,” Franky says patiently. “I just revamped his old one so it’s good to go.”</p>\n<p>“<em>Why</em>?” Zoro asks sharply.</p>\n<p>“Well, you and Sanji have to keep up the act until Big Mom’s been taken care of, right?” The cyborg says, gesturing expansively. “What if the ship gets boarded and someone gets suspicious?”</p>\n<p>“Suspicious.” Sanji repeats flatly. “Of the lack of bedrooms.”</p>\n<p>“Well, yeah. You don’t think that’s a risk we should be worried about?”</p>\n<p>Sanji runs his temples, looking pained. “When,” he says through teeth that are now clenched tightly around his cigarette, “was the last time we got into a fight where the enemy examined our living quarters?”</p>\n<p>“Umm, technically that would be during our fight with the Donquixote Pirates,” Brook says. “If you recall, that Giolla woman made quite a mess in the men’s bunkroom.”</p>\n<p>Sanji makes a noise kind of like a distressed foghorn, while his face somehow gets impossibly redder. “Excluding the ladies, I hate this crew,” he says, turning on one heel and stomping off in the direction of the galley. “Nobody talk to me for at least another three hours!”</p>\n<p>Everyone’s silent until he vanishes out of sight and the familiar sound of the galley door slamming shut has stopped echoing across the deck. Only then, does Zoro crane his neck around and give Franky a dirty look.</p>\n<p>“Was this really necessary?” He asks, pretty sure his tone accurately conveys his own opinion on the matter.</p>\n<p>Unperturbed, Franky gives him an obnoxious thumbs up. “Just trying to help you set the mood, Bro!” He chirps. “Also, don’t blame only me. Usopp helped by keeping you guys distracted while we were all down here the other day.”</p>\n<p>“Don’t tell him that!” Usopp shrieks, ducking to try and hide behind the closest available crew member. Unfortunately for him, this happens to be Chopper. “I don’t want him murdering me in my sleep!”</p>\n<p>“No one’s murdering anyone, Usopp.” Nami says tiredly. “Although, if I was Zoro, I’d kind of understand the urge.”</p>\n<p>“Yeah, well, Zoro’s being stupid about the whole thing,” Usopp says with an unusual spark of bravery. “We all know how he feels about Sanji …”</p>\n<p>“Would you be <em> quiet</em>!” Zoro hisses.</p>\n<p>“ … but he’s been oblivious to the way Sanji’s started looking at him.”</p>\n<p>“<em>Huh</em>?”</p>\n<p>“I said what I said,” Usopp replies, crossing his arms over his chest. “And you can ask anyone else here, if you like. They’ve all noticed the same thing.”</p>\n<p>“<em>What </em>thing?” Zoro demands, his head jerking from side to side as he tries to look at all of his crew mates at once. “What the hell are you talking about, longnose?”</p>\n<p>Usopp stares levelly back at him, his earlier terror now completely forgotten. “Sanji’s, like, really comfortable with hanging off you, man. Way more than any of us would have expected when this whole mess started.”</p>\n<p>“He’s been playing a <em> role,</em>” Zoro says, unable to believe he needs to explain this. “It was all an act to save his skin. You don’t see him clinging to me now that we’re away from Zou, do you?”</p>\n<p>“Well, no,” Usopp admits. “But we only left there like an hour ago. Plus, Sanji’s kinda stupid where romance is concerned. He definitely thinks everything’s been an act on your part.”</p>\n<p>“And he’d better keep right on thinking that,” Zoro warns ominously. “Because anyone who makes him think otherwise is getting their ass kicked.”</p>\n<p>“Stop threatening the crew, moron,” Nami says with a sigh. “As much as it pains me to admit this, I do think Usopp might have a point where Sanji’s concerned. He does seem to be looking at you in a new light.”</p>\n<p>“Oh not you too,” Zoro groans, unable to believe that the navigator of all people is switching sides on him like this. “C’mon, witch. You know full well he thinks I’m a dirty, sweaty caveman with no manners and even less class.”</p>\n<p>She snorts. “That’s because you <em> are </em>a dirty, sweaty caveman with no manners and even less class,” she says sweetly. “But you’ve also spent the last four days and change showcasing a much softer side of yourself, and I think Sanji’s noticed.”</p>\n<p>“I repeat,” Zoro says tiredly. “He thinks it’s an act.”</p>\n<p>“But it isn’t,” she points out. “It’s just you giving in to every stupid urge you never figured he’d let you get away with. Don’t deny it,” she adds when he opens his mouth to do exactly that. “We all know how you feel, Zoro. Even Luffy’s fully in the loop for once.”</p>\n<p>“Zoro loves Sanji,” Luffy agrees with a firm nod. “But it’s different from the way he loves the rest of us.”</p>\n<p>“I don’t love any of you,” Zoro gripes. All this gets him is a bunch of eye rolls, however, and leaves him barely resisting the urge to tear his own hair out.</p>\n<p>“I swear,” he says then, “if one of you so much as <em> breathes </em> a damn word of this to the cook, I’m jumping ship and swimming back to Kuraigana. Even <em> Perona </em>was less annoying than you people.”</p>\n<p>Nami makes a show of yawning exaggeratedly, while a number of the others unsuccessfully try to hide snickers behind their hands. Thoroughly done with this entire conversation, Zoro stalks past the entire group, intent on heading to the crow’s nest and the privacy it provides.</p>\n<p>*****</p>\n<p>Despite his hope that things would at least be normal when it was just them and the crew on the <em> Sunny</em>, Zoro is sorely mistaken. They’re several days into their journey to Wano - one that by Nami’s estimation is going to take a few weeks, and that’s providing the weather stays in their favour - but Sanji’s still acting <em> weird</em>.</p>\n<p>And that’s the best description Zoro can come up with - <em> weird</em>. It’s not bad, or damning, or anything of that nature, it’s just <em> weird</em>. He’d been expecting the cook to at best fall back into their usual routine of antagonist rivals or at worst start acting genuinely nasty to make up for the two of them having to make nice in Zou. Instead, Sanji’s acting almost as if they’re still on Zou, and that’s the most confusing possible outcome of all.</p>\n<p>Especially because, after a few days of careful observation, Zoro doesn’t think the other man knows he’s doing it. It’s just that periodically Sanji will start to fall back into similar behaviour patterns to what he’d had on Zou, only to usually catch himself at the last minute and wriggle away awkwardly.</p>\n<p>It’s becoming harder to handle the longer it goes on for too. The number of times Sanji’s casually leaned into his space or shot him a fond look over his shoulder or anything of that ilk have been increasing exponentially, and Zoro’s traitorous heart is starting to wonder if maybe there isn’t something to the rest of the crew’s crackpot theory after all.</p>\n<p>Except, that’s impossible, of course. Sanji’s never shown even the slightest indication of a romantic inclination towards him, and there’s no way seventy two hours worth of a fake relationship are going to change that. It’s all in his head, and Zoro needs to get said head back on straight immediately. </p>\n<p>Which! He would love to do, really, he would. It’d just be extremely helpful if Sanji weren’t suddenly around constantly. The <em> Sunny </em>may not be the biggest ship in the ocean, but she’s still large enough that they shouldn’t be running into each other wherever they go. He’d almost think the cook was actively seeking him out, yet that can’t possibly be right.</p>\n<p>Or, well, it’s right in one instance, but that’s an extenuating circumstance.</p>\n<p>It’s the middle of a bright, clear afternoon. He’s just finished up his training regimen for the next little while, and is settling in on the deck for a nap, when a familiar pair of long legs appear in his vision. Sanji pointedly taps the toe of one dress shoe, and then proceeds to dig it into Zoro’s side when he refuses to acknowledge him.</p>\n<p>“Damnit, Curls,” Zoro says, swatting at him irritably. “What do you want?”</p>\n<p>Sanji’s face screws up in that awkward way it does when he’s after something specific, but doesn’t actually want to ask for it. That usually means he’s embarrassed by whatever it is, and is struggling to work up the nerve to just bite the bullet and say it.</p>\n<p>Zoro casts his gaze heavenward, looking for patience. “Curls,” he repeats. “Whatever it is, spit it out so we can both get back to going about our days.”</p>\n<p>His face heating, Sanji scuffs his foot along the deck. “I,” he says slowly, “was hoping you might be willing to help me with something. In the galley.”</p>\n<p>That’s odd enough that it’d snag Zoro’s attention even if he weren’t already wrapped around the cook’s little finger. As it stands, he guesses one could say he’s double intrigued, and he cocks an eyebrow to indicate the other man should continue.</p>\n<p>“Not here,” Sanji says, easily parsing out his meaning. “Just - come with me, would you?”</p>\n<p>Ignoring the fact that he can see Usopp fishing off the side of the deck nearby, the sniper’s head tilted to show he’s clearly listening to them, Zoro nods. He then climbs laboriously to his feet, carefully tucking his swords back into the sash around his waist so he knows they’re secure.</p>\n<p>Sanji doesn’t say anything even once they’re in the galley with the door shut securely behind them. Rather, he stands there with his hands shoved in his pockets, shifting from foot to foot like he expects Zoro to simply know why he’s been summoned.</p>\n<p>Seeing as that’s not a talent he possesses, Zoro pins the other man with a look. “I’m not a mind reader, Twirlybrows,” he says. “I’m willing to give you a hand with whatever’s got your shorts in a knot, but you’re gonna have to tell me what that <em> is.</em>”</p>\n<p>Making a face like he’s praying for patience, Sanji pulls his hands out of his pockets and starts wringing them together. “Um,” he says finally, but then refuses to add anything further.</p>\n<p>“<em>Curls.</em>”</p>\n<p>“I know, I know, sorry. It’s just, ugh.” Sanji groans, and scrubs his hands over his face. “Fuck, this is so embarrassing. Come with me. I’ll show you what the problem is.”</p>\n<p>With that said, he moves forward and ducks into the pantry, while Zoro obediently trots after him. Once inside, he flicks on the lights and points at a corner in the far end of the room. “It was over there the last time I saw it.”</p>\n<p>About to ask what he’s talking about, Zoro sees a flash of movement out of the corner of his good eye. Turning so he can get a better look at whatever it is, he isn’t surprised when Sanji stiffens beside him as his gaze lands on a large bug that’s merrily scuttling around the floor.</p>\n<p>“Cook - ”</p>\n<p>“Don’t say it,” Sanji snaps. “I know it’s stupid, but - but you get it now, and you said none of what happened was anything to be ashamed of, so I’m kind of hoping you were serious about that and that you won’t mock me until the day I die for this.”</p>\n<p>“Sanji - ”</p>\n<p>“Nope,” he insists. “No real names, you know it weirds me out when you do that. Just - fucking get rid of it, will you?”</p>\n<p>“Sure,” Zoro says, already unhooking his swords from his belt and shifting so he can leave them outside the pantry door. “Was it only the one, or did you see any others?”</p>\n<p>Sanji shudders. “I only saw the one,” he hedges.</p>\n<p>“But it likely came in from Zou, which means there could be plenty,” Zoro surmises.</p>\n<p>“Ugh, don’t put it like that,” Sanji groans. “There could be, you’re right, but I really fucking hope not.”</p>\n<p>“S’fine, I’ll be thorough,” Zoro says. His swords safely secured, he unwraps the sash from around his waist, and then starts undoing the buttons on his over robe.</p>\n<p>“Um,” Sanji says, his voice slightly higher than normal. “What are you doing?”</p>\n<p>“Robe’s too loose and baggy for something like this,” Zoro says, bundling the whole mess up and tossing it out of the room where it lands neatly on one of the dining room chairs. “I don’t want anything crawling inside it while I’m rooting around in here.”</p>\n<p>“Urk, don’t make me sick,” Sanji mutters, looking a little wild around the eyes. “What if something lands on you?”</p>\n<p>“Then it’ll be easier for me to see and kill,” Zoro says, unconcerned. “They don’t bother me the way they do you.”</p>\n<p>“Right, fine.” Sanji mutters, no longer meeting Zoro’s eye. “Do your thing, Marimo, and there might even be some booze in it for you if I’m feeling generous.”</p>\n<p>“Works for me,” Zoro tells him, vanishing back into the pantry.</p>\n<p>He re-emerges a while later, still shirtless, but reasonably certain he’s gotten any creepy crawlies that might have made their way into Sanji’s sanctuary. </p>\n<p>“Was it bad?” The cook asks when he spots him, and Zoro shakes his head.</p>\n<p>“Nah,” he says, wiping his hands on a dish rag Sanji throws his way, and then reaching for his robe. “Found two others besides the one you stumbled over, but I don’t think they were even the same kind. I don’t think you need to be worried about an infestation.”</p>\n<p>“Thank fuck,” Sanji says, his shoulders sagging in relief. “I know it’s never been a secret, but I <em> really </em>hate bugs. Also, here,” rummaging around beneath the counter, he pulls a bottle of sake free and offers it up. “That’s yours, as promised.”</p>\n<p>Zoro stares at the bottle for a moment, letting his gaze flit back and forth between it and Sanji’s face a few times before he takes it. “I’d’ve done it regardless,” he says, not sure if he should be admitting to this or not, “but thanks.”</p>\n<p>Sanji’s cheeks turn pink, and he looks at the ground. “Whatever,” he mumbles. “Don’t go getting all mushy on me, Mossball.”</p>\n<p>Zoro wouldn’t exactly call what he’d said ‘mushy’, but Sanji’s shoulders are steadily crawling towards his shoulders in an awkward hunch, and even he’s capable of reading the room under these circumstances. Saluting the other man with his bottle, he nods and heads back to the main deck.</p>\n<p>*****</p>\n<p>They continue sailing, getting closer and closer to Wano, and a level of anticipation settles over the ship, causing tension to ratchet up in a way that only happens when they’re heading into a big fight. Zoro can feel it in the air, and he doubts he’s the only one. </p>\n<p>Tension can affect different people in different ways, however. Especially people who’ve recently been through one traumatic event already. Sanji can say what he likes, but it’s clear he’s still feeling the strain of having his past brought up without his consent.</p>\n<p>This becomes all the more obvious when he jerks awake in his bunk one night, not quite able to contain the upset cry that spills from his lips. He manages to muffle it before he wakes anybody else, but Zoro’s been having a restless sleep of his own, so he’s already up.</p>\n<p>Sanji doesn’t realize this. Or, if he does, he pretends to not have any knowledge of it. Instead, he sits slumped in his bunk until he’s got his breathing mostly under control, only to then roll out of bed and leave the room entirely.</p>\n<p>Zoro watches him go, noting the way the door closes behind him with a soft click. It’s possible he’s just going to the bathroom, maybe feeling the need to splash some cold water on his face, but the longer he’s gone, the more the swordsman suspects he has no intention of coming back,</p>\n<p>He lies in his own bunk for a while, the <em> Sunny </em>swaying gently beneath him, and considers his options. Only a handful of weeks ago, he’d have left well enough alone, certain his presence wouldn’t be welcome. Now, though, it’s harder to convince himself that this is the case.</p>\n<p>Groaning, he kicks his way free of his bed covers, knowing there’s no chance he’s getting back to sleep tonight until he’s checked on the cook. Hoping this won’t get him kicked from one end of the <em> Sunny </em>to the other, he takes a deep breath and marches resolutely towards the galley, certain that’s where Sanji will have headed.</p>\n<p>Soft light shining out through the porthole window is enough to confirm his suspicions, and he eases the door open, expecting to find the cook either poking at something on the stove, or at least scribbling in one of his recipe books. </p>\n<p>On this, he turns out to be mistaken. Painting a picture that makes Zoro’s chest clench, Sanji’s sitting slumped at the dining room table with his head buried in his hands. His shoulders are noticeably shaking, and when he listens carefully Zoro hears the same almost-whimper Sanji’d made that night on Zou.</p>\n<p>He’d definitely made the right decision by coming in here then. Even if all he ends up doing is providing Sanji with a target for some misplaced aggression, that alone will be worth it for the distraction it’d offer up.</p>\n<p>“You alright there, Curls?” He asks, even though the answer is as clear as day.</p>\n<p>Sanji’s head jerks up, allowing Zoro an unencumbered look at his face. His eyes are bright, although not wet, and he’s sucking in heavy lungfuls of air the same way he had the last time Zoro’d seen him like this.</p>\n<p>“Marimo,” he says, dashing a hand across his face in what’s likely a move to reassure himself that no tears have been shed. “What are you doing in here at this hour? If it’s a snack you’re after, you’re going to have to give me a minute.”</p>\n<p>Zoro rolls his eye at the show of bravado. “You know that’s not why I’m in here, dumbass. I heard you get up and came to check on you.”</p>\n<p>“Gotta make sure I’m not totally losing it, huh?” Sanji asks, letting out a laugh that holds no humour whatsoever. “Can’t say I blame you, really. It’s your job to watch out for potential liabilities.”</p>\n<p>“Don’t put words in my mouth, asshole,” Zoro says, using just enough edge in his voice to keep Sanji from thinking he’s pampering him. “I’m not worried about you fucking over the crew, I’m only worried about you period.”</p>\n<p>“Oh <em> hell</em>, Zoro, you can’t just say shit like that,” Sanji says, rubbing a hand over his face again. “I’m not exactly equipped to handle your pity right now.”</p>\n<p>“It’s not pity,” Zoro insists, earning himself a weak grin from Sanji.</p>\n<p>“Yeah, I know,” he says tiredly. “Although I don’t know if that makes it better or worse.” Standing abruptly, he moves like he’s going to head for the pantry, but his gait is unsteady, lacking his usual grace and speaking of a bone deep exhaustion that shouldn’t be there.</p>\n<p>“This isn’t the first night you’ve had trouble sleeping, is it?” Zoro asks, watching him with narrowed eyes as he bumps into the corner of the table. </p>\n<p>“Not exactly.” Sanji replies, and the fact that he’s willing to admit even that much is as damning as any condemnation Zoro’s ever heard. “It’s possible that Judge is in my head a bit more than I’d care to say.”</p>\n<p>“Mmm.” Zoro half watches him for a little longer, but most of his attention is elsewhere, snagged by an idea that’s now weaseled its way into his brain. “Are you planning to go back to the bunkroom tonight?”</p>\n<p>“I am not,” Sanji declares. “I have a sneaking suspicion that my head is going to betray me again if I go back to sleep, and there’s no way I’m risking waking everyone else up with that. If worse comes to worse, I’ll sleep in here on the couch.”</p>\n<p>Zoro spares said couch a glance. He’s napped on it plenty since the <em> Sunny </em>had come into their lives, but it was hardly preferable to a real bed. His mind therefore made up, he steps forward to intercept Sanji before he gets too far away.</p>\n<p>“You need a proper rest,” he says, stopping Sanji with a hand on his arm. “Or,” he adds, well aware that it’s already an absurd hour in the morning, “as close to one as you can get.”</p>\n<p>“Unfortunately, I suspect that ship has sailed for the night,” Sanji says, shaking him off. “It’s fine, Marimo. I’ve got it handled.”</p>\n<p>Undeterred, Zoro shakes his head and steps further into the other man’s personal space. “If you’re not willing to go to bed, I’ll put you there myself.”</p>\n<p>His eyes narrowing dangerously, Sanji shifts to swing a leg around, his intention plain. Zoro’s expecting it, however, and leans into the movement, rather than away from it. Hunching forward, this allows him to get under the cook and hike him up onto his shoulder.</p>\n<p>“What the fuck?” Sanji yells, and Zoro hushes him with a sharp smack to his hip.</p>\n<p>“If you start shrieking, you’re gonna wake everybody else up,” he scolds. “So unless you want to have to explain what’s going on here, I suggest you shut your trap.”</p>\n<p>“Shut my -?!” Sanji snarls, his hands clawing at Zoro’s shoulders. “Oooh, Mossball, I really am going to kill you this time. Put me the hell down.”</p>\n<p>“No.” Zoro says simply, already marching to the galley door. “And if you don’t quit squirming, I’ll start yelling until someone comes looking.”</p>\n<p>It’s a bluff, there’s no way he’d do that to Sanji under the circumstances, but luckily not one the cook seems willing to call him on. Letting out a disgruntled sigh, he falls silent and contents himself with fisting a hand in Zoro’s hair and giving it a vicious yank.</p>\n<p>Since that’s basically the equivalent of Sanji waving a white flag, Zoro allows himself a small grin and nudges the galley door open with his foot before striding out onto the deck with his precious burden in tow. He then steps carefully down the stairs and walks across the lawn in the opposite direction of the men’s bunkroom.</p>\n<p>“Oh wow,” Sanji says, his voice dripping with condescension. “It’s finally happened. You’ve gotten lost on your own ship.”</p>\n<p>“I don’t get lost,” Zoro sniffs. “And I’m definitely not lost now.”</p>\n<p>“And yet I can see the bunkroom door getting further and further away.”</p>\n<p>“Sure, but <em> I </em>can see the one we need getting closer and closer,” Zoro replies. Ducking under the awning he’s just reached, he drops down into the short hallway and grabs for the doorknob of the room he’s after. Flicking on the light as he passes, he doesn’t stop until he reaches the large double bed and can dump Sanji down on top of it.</p>\n<p>The blond stares up at him from where he’s sprawled across the mattress, while simultaneously trying to fix his sleep shirt, which has gotten rucked up over his stomach during the trek down. “What,” he says, practically spitting the word, “am I doing in here?”</p>\n<p>Zoro takes a moment to glance around and take a look at where ‘here’ is. He can’t remember the last time he’d set foot in the bedroom that technically belongs to him, but he’s pretty sure Franky’s made some upgrades while cleaning it out during their stay on Zou. He definitely doesn’t remember the bed being quite so nice for one.</p>\n<p>The sound of Sanji clearing his throat gets his attention back on the cook, and he tries not to let the other man’s irritated expression get his own back up. “You need to sleep,” he says cautiously. “I get why you don’t want to do it in the bunkroom right now, but a couch in your kitchen isn’t going to cut it either. So,” he flaps a hand awkwardly at the bed. “Use this.”</p>\n<p>Sanji peers up at him through a tousled fringe of hair, for once both of his eyes at least partly on display. “Where I sleep,” he says, giving Zoro a look that clearly implies he thinks he’s an idiot, “isn’t the problem. I’m going to have nightmares wherever I am.”</p>\n<p>“Maybe,” Zoro shrugs. “But you can still sleep somewhere more comfortable than the kitchen.”</p>\n<p>“Oh sure,” Sanji scoffs, “because an unfamiliar environment is going to be <em> so </em> much better.”</p>\n<p>Zoro frowns. “We’re on the <em> Sunny</em>,” he says, failing to see how that’s an unfamiliar environment even if the room’s had a recent makeover. “And you slept fine on Zou, minus that one night.”</p>\n<p>“Well, <em> yeah</em>, but that was because I wasn’t alone,” Sanji snaps. His eyes widen almost immediately after as he realizes what he’s just said, and he looks like he’s about two seconds away from slapping a hand over his mouth while Zoro gawks at him.</p>\n<p>“Uh, well. I mean, I could - stay?” Zoro offers before he can think better of it. He mentally slaps himself upside the head a few times for thinking this might ever be a reasonable suggestion, but rather than look murderous, Sanji now looks almost … hopeful.</p>\n<p>“Really?” He asks, suddenly fascinated with the comforter he’s sitting on top of. “You don’t have to, obviously, but it - uh - I don’t know. It might help.”</p>\n<p>“It was my idea,” Zoro reminds him, his mouth continuing to run away without his permission. “I wouldn’t have suggested it if I minded. Besides, this room may as well get some use since Franky went through all the trouble of putting it together.”</p>\n<p>“Right,” Sanji agrees, nodding his head slowly. “That makes sense.”</p>\n<p><em> Nothing </em>about this makes sense, and they both know it. Still, if it makes Sanji feel better - and gets him to get some frigging sleep - Zoro supposes he can sacrifice what’s left of his sanity for the greater good. His mind thus made up, he closes the bedroom door behind him and moves towards the bed.</p>\n<p>They each automatically gravitate to the sides they’d claimed as their own in Zou. Sanji folds back the covers while Zoro gets the light, and they both end up lying there in awkward silence.</p>\n<p>“You know,” Zoro says, wincing in the dark as a reasonable thought hits him far, far too late. “If it’s mainly company you’re after, I could just sleep on the floor.”</p>\n<p>“We already had that argument in Zou,” Sanji reminds him. “You lost.”</p>\n<p>“But - ”</p>\n<p>“Shut up, Marimo. You started this, but I’m finishing it. Now, be quiet so we can both get some sleep.”</p>\n<p>With that said, Sanji rolls over onto his side, facing away from Zoro and effectively ending the conversation.</p>\n<p>“Right,” Zoro says stiltedly. “Uh, goodnight?”</p>\n<p>“Technically, it’s morning already, but yeah. Same to you.”</p>\n<p>*****</p>\n<p>Zoro’s napping near <em> Sunny</em>’s stern when a shadow falls over him and then leans down to grab him by the ear.</p>\n<p>“What the hell?!” He yelps, flailing both his arms and legs outward until he realizes it’s Nami who’s got him in her clutches. “Damnit, Witch,” he groans, trying and failing to twist his head away from her. “What’d I do now?”</p>\n<p>“I’m almost afraid to ask,” she growls, shaking him none too gently as she glares at him. “Franky and Usopp were gossiping like a pair of useless old biddies this morning. They seem to think that stupid bedroom they made you got used last night.”</p>\n<p>“So? That’s what it’s there for, isn’t it?”</p>\n<p>Zoro realizes too late that he should have tried to pretend he has no idea what she’s talking about. Nami’s eyes narrow into furious slits, and her hold on his ear tightens to the point that he’s starting to worry he might lose it.</p>\n<p>“Sanji,” she says in a voice that’s ice cold, “is <em> very </em>vulnerable right now, and while I don’t think you’d ever do anything to take advantage of that on purpose, I can’t help worrying that you might do it by accident.”</p>\n<p>“I didn’t do jack shit,” Zoro retorts. “But I’m not telling you what happened, either,” he adds when she opens her mouth to say something further. “You know how private he is. He’d hate the very idea of this conversation.”</p>\n<p>Nami purses her lips thoughtfully and finally lets go of his ear. While he rubs at it theatrically, she makes a contemplative noise and rests her hands on her hips. “You’re not entirely useless at this, are you?”</p>\n<p>“Eh? What are you talking about?” Zoro asks.</p>\n<p>“This,” she repeats, flapping a hand to illustrate any number of possible things. “Romantic relationships. You’re actually decent at them, aren’t you?”</p>\n<p>“Dunno,” Zoro replies. “Never really been in one.” </p>\n<p>Rather than look surprised by this like he’s half expecting, Nami’s thoughtful expression deepens. “Yeah, that tracks now that I think about it,” she says. “You’re not the kind of guy to slip in and out of relationships without a strong connection.”</p>\n<p>“ … sure,” Zoro decides, willing to say whatever it takes to get this conversation over with.</p>\n<p>It’s apparently too flippant because Nami’s eyes start to narrow dangerously again. Opening her mouth to no doubt tear another strip off of him, she’s interrupted when the loudspeaker that’s hooked up to the crow’s nest crackles to life.</p>\n<p>“I don’t mean to alarm anyone,” Robin says calmly, “but I’ve just spotted a ship, and it’s approaching us at speed.”</p>\n<p>“The hell?” Zoro says, craning his neck around to try and see what she’s getting at. “D’you think it’s someone from Wano?”</p>\n<p>“Wano doesn’t have ships that sail outside of its borders, and we’re still days away from there,” Nami replies. “And if it’s a ship, not a submarine, that rules the Heart Pirates out too.”</p>\n<p>Most of the crew are heading towards the main deck, so he and Nami do the same. Zoro comes to a stop right beside Sanji’s elbow - the cook having been enjoying a quick smoke at the railing, it looks like - but both their attention on Usopp, who’s got his spyglass out to watch the oncoming vessel.</p>\n<p>“What the hell?” The sniper says. “There’s something out there, alright, but it’s not like any ship I’ve ever seen. It looks like a giant transponder snail.”</p>\n<p>Zoro feels Sanji stiffen next to him. “Usopp,” the cook says grimly. “Pass me that scope, will you?”</p>\n<p>“Uh, okay?” Not bothering to come any closer, Usopp tosses the spyglass across the distance.</p>\n<p>Sanji catches it easily and raises it to eye level. “<em>Shit,</em>” he hisses. “Motherfucking goddamnit all to hell!”</p>\n<p>“Cook?”</p>\n<p>“They’re enemies,” Sanji says, dropping the spyglass and chucking it back in Usopp’s direction without bothering to look at what he’s doing. “It’s fucking <em> Germa.</em>”</p>\n<p>The deck goes silent, with nobody daring to say a word until Sanji lets out a mirthless chuckle. “None of you are going to ask me if I’m sure?”</p>\n<p>“I figure we can all trust you on this one, Curls.” Zoro says. “What do you think they want?”</p>\n<p>“It doesn’t matter,” Luffy snaps, punching one fist into the open palm of his other hand. “They were mean to Sanji, so we’re going to kick their asses!”</p>\n<p>That’s the kind of plan Zoro can get behind, and judging by the expressions of the rest of the crew, he’s hardly the only one. Even Sanji, who would never want anyone risking themselves for him, looks more resigned than anything else.</p>\n<p>“They’re dangerous,” he points out halfheartedly. “I haven’t seen any of my siblings in years, but if some or all of them are over there, they’re basically emotionless killing machines.”</p>\n<p>“We’ve dealt with a few of those before,” Franky muses thoughtfully. “They’re not gonna know what hit ‘em.”</p>\n<p>“Fine,” Sanji says, his own expression that of a man who knows better than to argue. “But if any of you get yourselves killed, I’m going to be seriously pissed off.”</p>\n<p>Zoro snorts. “I already told you,” he says, thumbing Wado’s hilt in anticipation. “If we end up fighting them, they’re the only ones who’re going to get killed.”</p>\n<p>Sanji purses his lips, but doesn’t say anything further. Instead, he pulls a fresh cigarette from the pack in his pocket, lighting with quick efficiency and taking a heavy drag. “The snail ships are fast, it won’t take them long to catch us if we don’t try to avoid it.”</p>\n<p>Part of Zoro wants to rest a comforting hand on his shoulder because who knows how hard this has to be for him. Zoro’s bright enough to read the room, however, and he can tell that the last thing Sanji needs is for someone to mess with him right now - unintentional though it might be.</p>\n<p>No one says anything as the strange ship comes nearer. As Sanji had said, it’s moving remarkably fast, meaning it’s not long before they can all make out its form unaided. Exactly as Usopp had noted, it looks like a giant transponder snail with a castle on its back.</p>\n<p>“Fuck,” Sanji says simply. His cigarette is mostly gone now, and he flicks the butt over the railing without taking his eyes off the vessel. “That’s the flagship.”</p>\n<p>“Are you sure?” Someone asks, and Sanji rolls his eyes.</p>\n<p>“I was <em> born </em>on it,” he grunts. “It’s not a place I’m likely to forget.”</p>\n<p>His statement makes Zoro take a closer look at the ship, and he wrinkles his nose, not liking what he sees. At a glance it’s a dreary, imposing thing, not at all like the kind of atmosphere he’d expect the cook to flourish in. Even Mihawk’s castle was more inviting.</p>\n<p>It’s as he’s eyeing up the structure that he starts to see movement on the battlements. A number of similar looking people in white at black uniforms are crawling all over the place, but as he watches, a set of heavy metal doors open and a massive figure with a mane of dirty blond hair comes into view.</p>\n<p>Sanji sucks in a heavy breath, and then to Zoro’s shock, reaches out and clamps a hand around his wrist.</p>\n<p>“Cook?” Zoro says warily. “You know him?”</p>\n<p>“You could say that.” Sanji murmurs, flashing Zoro a bright smile that doesn’t reach his eyes. “That would be your father-in-law, dear.”</p>\n<p>Zoro takes a minute to digest this, and also grabs a better look at Vinsmoke Judge while he’s at it. After several seconds of quiet contemplation, he decides he’s not impressed.</p>\n<p>“You must take after your mother,” he says then. “He’s got a face like a boar’s ass.”</p>\n<p>A number of the crew laugh, Sanji the loudest among them, and much to Zoro’s relief the sound seems to be a genuine one. Dashing the hand not still clutching Zoro’s arm over his face, the cook chuckles wetly. “He does, doesn’t he?”</p>\n<p>“Mhm, and it’s going to look even worse once we’re done with him.”</p>\n<p>Any response Sanji might make to this is headed off at the pass by the Germa ship now getting within boarding distance. From his place on the battlements, Judge fixes the <em> Sunny </em>with a haughty glare and shouts across the distance.</p>\n<p>“Strawhat! I believe you have something that belongs to me.”</p>\n<p>Luffy blinks up at the monarch and casually adjusts his hat on his head. “Nah, I don’t think so,” he says.</p>\n<p>Judge frowns, taken aback by the easy dismissal. Gathering his bearings, he points an imperious hand at Sanji. “That failure has Vinsmoke blood in his veins and finally a way he can be of use to me. I’m taking him back whether you like it or not.”</p>\n<p>“Yeah, it’s a still a no,” Luffy replies. “Sanji’s my cook, and I don’t want anybody else.”</p>\n<p>“The matter isn’t up for debate,” Judge snaps, slamming a heavy fist down on the railing in front of him. “I didn’t come here to ask for your permission. I came to take what I need, by force if necessary.”</p>\n<p>Luffy shrugs. “You can try, but I doubt you’re strong enough.”</p>\n<p>“Oh for fuck’s sake,” Sanji says exasperatedly. “Luffy, stop pissing him off.”</p>\n<p>“He started it!” Luffy protests. “What makes him think he can just come in here and make you go with him?”</p>\n<p>“Decades of never having been told no for a start,” Sanji replies, his voice desert dry. “Kings are used to getting what they want.”</p>\n<p>“Well then I think he should learn a new lesson,” Luffy declares, crossing his arms over his chest. “Oi! Did you hear that, armour guy? You can’t have Sanji, and we’ll fight anybody you send over to try and take him.”</p>\n<p>Judge’s eyes narrow furiously, his entire face a picture of outrage. “I was prepared to content myself with reclaiming the failure and getting the swordsman out of the way, but now I think I’ll kill your entire crew.”</p>\n<p>Luffy turns away from Judge, apparently done with the conversation. “I get what he means with Sanji, but what did Zoro do to him?”</p>\n<p>“It seems that the news of Zoro and Sanji’s fabled romance has reached him and he’s bought the charade,” Brooks says thoughtfully. “And I suppose since the story created was that they’re married as opposed to simply a couple, Zoro’s a threat to the wedding he’s trying to stage.”</p>\n<p>“Death is a quicker and more finite solution than divorce,” Robin agrees. “His logic is sound.”</p>\n<p>“Gee, thanks.” Zoro says dryly.</p>\n<p>Sanji kicks him in the shin, albeit gently. “Don’t be rude to Robin,” he scolds, “but,” he adds, his face softening. “I am sorry for getting you into this mess.”</p>\n<p>Zoro considers trying to reassure him, but in the end decides it isn’t necessary. What <em> is </em>necessary, however, is dealing with Germa once and for all. “They can do their worst,” he says, moving to draw Shusui and Kitetsu free from their sheaths. “I’m not worried.”</p>\n<p>“We don’t know what’s over there,” Nami says cautiously. “Sanji, can you tell us what to expect?”</p>\n<p>“Well armed, well trained soldiers, and a lot of them at that,” Sanji replies. “But as for anything more specific, I’m afraid it’s been a long time since I set foot on one of those ships. Your guess is as good as mine.”</p>\n<p>As if on cue, the castle’s main gates open as soon as these words leave his mouth, and dozens of heavily armed soldiers pour out through the doors. Even worse, above them, four beams of brightly coloured light shoot out, streaming directly towards the <em> Sunny </em>.</p>\n<p>“What the hell are those?!” Usopp shrieks, flailing backwards as he grabs for his slingshot.</p>\n<p>Sanji swallows thickly, his gaze locked on the lights. “I think they’re my siblings.”</p>\n<p>Surprised noises echo around the deck, but before anyone can find their voices, the lights solidify into humanoid shapes, and the next thing anybody knows, three tall men and a woman, all with the same distinctive curled eyebrows, land on the ship.</p>\n<p>“Fuck.” Sanji says simply. Much like the rest of the crew, he’s whirled around to stare at the threat that’s just landed in their midst, but his expression is as pinched as Zoro’s ever seen it.</p>\n<p>To try and shake him free of his stupor, Zoro nudges him with a shoulder. “Reiju’s easy enough, but which of the guys is which?”</p>\n<p>“If you look at the suits you can see the numbers,” Sanji mutters through gritted teeth. “But if you really want it spelled out for you; red and haughty is Ichiji, blue and mean is Niji, and green and dumb is Yonji.”</p>\n<p>Zoro considers this, a previous throwaway comment by the cook now ringing in his ears. “Hey, Luffy!” He calls, raising his swords with intent. “I want the blue one.”</p>\n<p>None of the Vinsmokes react beyond a slight twisting of the corner of Reiju’s mouth, which Zoro has no desire to read anything into. All four of them eye the Strawhats like they’ve just rolled in something disgusting, their disdain obvious.</p>\n<p>Not a soul moves on the ship for a second, until Judge raises a hand ever so slightly. “Grab Sanji and kill the rest,” he says.</p>\n<p>His hand drops down and not only do his children charge forward, but a number of the soldiers begin making their way over to the <em> Sunny. </em>It’s not long before the entire deck is teeming with enemies, Germa’s manpower seeming to be never ending.</p>\n<p>It’s clear from the way they fight that this is not an army who’s used to being challenged in battle. Plenty of soldiers go down before they even reach the ship, taken out by Luffy’s fists and a couple well placed thunderbolts from Nami. Those that come after are slightly more cautious, but still move with an arrogance that shows they think this fight is a foregone conclusion.</p>\n<p>This is hardly the first time an enemy’s come in so supremely confident that they can take the Strawhats, but it’s still been a while. Their reputation has preceded them in the New World, and people tend to react accordingly.</p>\n<p>Zoro wonders, almost idly, if that’s because Judge is really that arrogant, or if it’s because of something more sinister - namely the experiments he’s performed on his children and subjects alike. In the end, he supposes it doesn’t matter, but it’s what’s on his mind as he rushes forward to meet his opponent.</p>\n<p>Niji allows him to close in, raising his arms protectively as Zoro swings both swords down towards his face. Zoro thinks he sees the faint edge of a smirk when they meet, the two of them trading a series of blows back and forth as they each get a feel for the other’s prowess.</p>\n<p>He’s strong, that much is readily apparent, and a quick glance around shows that the rest of the Vinsmoke are equally powerful. Even with that, though, a few minutes of skirmishing back and forth makes Zoro relatively confident they’re not strong enough.</p>\n<p>“You spend a lot of time picking on people weaker than you, don’t you?” He says, blocking a heavy blow with Shusui.</p>\n<p>Niji frowns and rears back to hit him again, this time using both fists. “What’s that supposed to mean?”</p>\n<p>Zoro grimaces. It’s bad enough the man’s face is similar to Sanji’s, but their voices are fairly close as well. It’s like looking at a distorted mirror. </p>\n<p>Shaking his head, he reminds himself that the tone and emotion are all wrong, and lashes out with a series of swipes that manage to do some damage to Niji’s armour.</p>\n<p>“That’s what I mean,” he says, gesturing at the way the other man recoils even though he’s not hurt. “You’re not used to fighting someone who’s on your level. Let alone above it.”</p>\n<p>Niji’s frown morphs into a full on scowl, and this time he comes at Zoro with less finesse than he had previously - a clear indication that the swordsman had struck a nerve. “You’re not even close to my level, you peon,” he snarls. “If you were, you wouldn’t have settled for my useless brother.”</p>\n<p>Zoro snorts, sidestepping him easily and spinning on his heel to face him as he comes around again. “As far as I’m concerned, he’s the only one of you worth wasting my time on.”</p>\n<p>“You’re delusional.” Niji spits, and this time when he charges, it’s actively sloppy. Zoro blocks him with Shusui alone, and then lands a slash across his chest with Kitetsu that sends him stumbling backwards.</p>\n<p>“How dare you even <em> touch </em> me,” Niji hisses. Zoro’s sword hadn’t just hit the armour this time, there’s a wound that’s actively seeping blood, although he doubts it’s a fatal one.</p>\n<p>Now clearly furious, Niji moves like he’s going to attack once more, only to shout in surprise when one of Usopp’s pop greens bursts at his feet, its long vines shooting upwards to wrap around his arms and legs.</p>\n<p>“You think this is enough to stop me?” He demands, his muscles bunching as he struggles to free himself. </p>\n<p>“Perhaps not,” another voice says, “but I’m more than happy to share the load.”</p>\n<p>With Robin having said her piece, a number of arms sprout around him, securing the struggling prince in place. One hand even goes so far as to land a stinging slap on his cheek, something Zoro can’t help but think is intentional.</p>\n<p>Willing to consider that threat neutralized for now, Zoro looks around for a new enemy to fight and finds one almost immediately. His own eyes narrowed in distaste, Yonji throws a wild punch at him, this blow even heavier than that of his brother’s.</p>\n<p>Zoro vaguely remembers Sanji commenting about how Yonji was the biggest of the quadruplets despite being the last born. It looks like that’s corresponded to a higher level of physical strength as well, albeit with fewer precision skills based on the way his movements are much less fluid.</p>\n<p>Which isn’t to say this brother doesn’t have his own tricks up his sleeve, literally, as it turns out. Zoro’s resigned himself to their fight turning into an all out brawl when Yonji’s fists suddenly shoot forward on strange, chain like contraptions, his hands and wrists no longer attached to the rest of his body.</p>\n<p>“What the hell?!” Nami shrieks, clutching her climatact baton as one arm narrowly misses her. “That’s so gross!”</p>\n<p>Gross isn’t exactly the word Zoro would use, but it’ll do in a pinch. Twisting to avoid both coiled limbs as they zero in on him, he bats them both away, while at the same time testing their durability with his swords.</p>\n<p>“Were you expecting me to be impressed?” He asks as Yonji retracts his arms until they’ve snapped back into a normal position.</p>\n<p>“I don’t care if you’re impressed or not,” the youngest Vinsmoke says, cracking his neck from side to side. “And the only thing I expect is for you to die.”</p>\n<p>“Is that any way to speak to your brother-in-law?” Brook demands, arriving on the scene with his own sword drawn. “What terrible manners you young men have.”</p>\n<p>“I doubt they’re worried about offending me,” Zoro mutters, using the lull in the fight to take stock of the rest of the crew.</p>\n<p>Robin’s taken on sole responsibility for keeping Niji under control, while Usopp’s moved on to helping Nami and Franky fight off the main waves of Germa soldiers. Chopper is surprisingly holding his own against the sister, while Luffy is gleefully pummeling Ichiji, who looks surprised to find himself on the losing end of a battle.</p>\n<p>He doesn’t see Sanji anywhere.</p>\n<p>“Brook,” he starts, only for the skeleton to cut him off.</p>\n<p>“I know,” he says, stepping in front of Zoro with his sword held aloft. “He’s boarded the Germa flagship to deal with Judge himself. I figured you’d want to join him. I’ll take care of this pup.”</p>\n<p>“Thanks,” Zoro says, ignoring Yonji’s resulting sputtering. “Truth be told, I don’t think he’s any tougher than the others.”</p>\n<p>“Duly noted,” Brook replies. “Now, please go reclaim our dear cook.”</p>\n<p>“On it.” </p>\n<p>Without bothering to sheathe his swords, Zoro darts across the <em> Sunny</em>, ploughing his way through any Germa fighters who get in his way, and then leaps the distance to the flagship. He’s met with more soldiers there, but quickly dispatches them.</p>\n<p>“Oi, Curls!” He barks, looking around for a familiar blond head. “Where the hell have you gotten to?”</p>\n<p>Sanji doesn’t answer him directly, but the sound of a fight going on up above provides all the information he needs. A glance upwards tells him that the cook has made it onto the battlements, and is going toe to toe with his former father.</p>\n<p>Never one to be left out, Zoro takes a running start and scales the side of the castle, only stopping once he’s cleared the parapet and can see both combatants. </p>\n<p>This fight’s clearly been going on for a bit already because there are pieces of debris strewn all over the place. Currently, Judge and Sanji are circling each other warily, the king with a massive spear clutched in one fist, and the cook with his heels sparking.</p>\n<p>“Don’t even think about it, Marimo,” Sanji says when he spots Zoro perched on the battlement railing. “You stay right where you are and let me handle this.”</p>\n<p>His comment draws Judge’s attention, and Zoro figures it’s a good thing looks can’t kill because if they could, the glare the older man levels his way would have him flatlining. “So,” he sneers, both of his thick black eyebrows lowering in distaste, “this is the pirate hunter.”</p>\n<p>“Congratulations,” Sanji drawls, unimpressed. “You can read a newspaper.”</p>\n<p>Ignoring him, Judge levels his spear at Zoro. “You’ve caused me a considerable amount of trouble, boy. Big Mom wasn’t pleased when she found out our alliance was at risk thanks to trash like you. I’m out here personally to deliver not only Sanji to her, but your head as well.”</p>\n<p>“But not the rest of me?” Zoro asks, smirking when Judge’s face goes nearly purple with rage. “Seems unfair for the cook to get special treatment, but I guess it’s your call.”</p>\n<p>“I’m going to enjoy killing you,” Judge growls. </p>\n<p>“Like hell you are,” Sanji barks, stomping his foot to make the <em> diable jambe</em>’s flame burn brighter. “You’re not laying a hand on him <em> or </em>anyone else on my crew.”</p>\n<p>He jumps then, the leap planting him firmly in Judge’s orbit and forcing the king to bring up his spear in a defensive position. The two of them clash back and forth, repeatedly exchanging blows while Zoro sizes up the situation.</p>\n<p>Judge is strong, that much is clear. He’d have no problem defeating the young boy Sanji had once been, and even as a grown man it’s difficult to say how well matched they are. Zoro trusts Sanji to have the upper hand, however, and is therefore content to keep only part of his attention on the father and son fight, as the rest of him focuses on the Germa foot soldiers.</p>\n<p>It’s hard to tell thanks to the way their uniforms include masks that cover their eyes, but a number of the approaching men seem to have similar bone structure and body posture. Yet Zoro doesn’t have long to consider this because the crowd is moving forward at speed.</p>\n<p>Zoro suspects it’s their intention to go to Judge’s aid, and probably try to subdue Sanji since they need to take him down alive. Given that, as far as he’s concerned, no one has any right to impede a clash that’s so long overdue, the swordsman opts to leapt from the battlements, landing directly in the path of the incoming soldiers.</p>\n<p>Not a single man among them balks. They all continue streaming towards him, none of them showing even the slightest flicker of emotion. Now certain Judge’s done something to these men, Zoro draws all three of his swords, confident he’s going to have to take every last one of them down to stop them.</p>\n<p>Luckily for him, while the soldiers are definitely strong and well trained, none of them seem to have the enhancements that have been built into the Vinsmoke brothers. That’s good, because even he’d have a difficult time with an entire army of men like that.</p>\n<p>As it stands, he still finds himself struggling slightly due to the sheer weight of numbers, but even that is largely an exercise in endurance. The Germa soldiers keep coming, exactly as he’d expected, yet they can’t bring him down.</p>\n<p>This gets further solidified when Luffy arrives with a whoop, both Brook and Franky hot on his heels. A quick glance at the water reveals that the situation on the <em> Sunny </em> is largely under control, so the captain must have decided to branch out and come find himself some new enemies to fight.</p>\n<p>“Don’t bother the cook, Luffy!” Zoro shouts around Wado’s hilt. “Keep the path clear, but leave his old man to him.”</p>\n<p>“Yeah, I know!” Luffy shouts back, extending one leg in a whipping movement that sends dozens of soldiers flying. “I won’t mess with Sanji’s fight.”</p>\n<p>That’s good, Zoro thinks. Wondering how said fight is going, he cranes his neck around for a quick look.</p>\n<p>Sanji and Judge have paused again, and have gone back to circling each other like a pair of large predators waiting to pounce. Both of them show the signs of wear and tear that only comes from a hard fought battle, but Judge has definitely gotten the worst of it. One of his eyes has been reduced to a bloody mess, and he’s breathing raggedly in a way that can only mean he’s got several cracked or broken ribs.</p>\n<p>Zoro smirks, he’s gotten a few of those from Sanji over the years due to mishaps during their sparring matches, and he’s someone who’s well aware of the power built into the blond’s kicks. He can only imagine the damage inflicted on someone dumb enough to underestimate him.</p>\n<p>This fight’s as good as over. The princes and princess are contained, most of the soldiers are down or going to be that way soon, and the king himself has bitten off more than he can chew. Allowing himself a knowing smirk, Zoro pulls back from the fray, intending to leave the rest to Luffy and the others so he can watch Judge fall.</p>\n<p>The king is speaking when Zoro walks over to the perimeter of the fight. His lip is curled in a disgusted sneer, and he’s glaring at Sanji as best as he’s able thanks to his damaged eye.</p>\n<p>“ - you really think this means anything?” Judge is snarling once Zoro comes within earshot. “The rest of the fleet has already been summoned, and as soon as they arrive we’ll - ”</p>\n<p>“Lose even more badly than you already have?” Sanji drawls lazily. “Face it, you old prick, your strongest fighters couldn’t take us down. All throwing a bunch of stupid clones at us is going to do is cost you more manpower. Show a little humility and get the fuck out of here.”</p>\n<p>“You don’t get to give me orders, <em> boy</em>,” Judge spits. “You’re still as weak and useless as ever. You’ve just been lucky enough to ally yourself with powerful people, that’s all.”</p>\n<p>Sanji laughs. “I’m one of the strongest fighters on this crew,” he says, while Zoro nods approvingly. “Honestly, I’m kind of glad this mess has gone down because now it means I know firsthand how weak <em> you </em>are.”</p>\n<p>“How dare you!” Judge starts, and Sanji’s scoffs.</p>\n<p>“How dare I?” He demands, his eyes narrowing dangerously. “What about how dare <em> you </em> ? Never mind how you treated me as a kid, you attacked my home, my <em> family,</em> completely unprovoked and with every intention of killing the most important people in my life. That’s not a response that’s warranted by me refusing to marry some woman you picked out.”</p>\n<p>“Oh because you picked such a grand prize on your own,” Judge says sarcastically, his good eye flirting over to look at Zoro. “Look at him,” he scoffs, “a ragtag street rat from the East Blue with nothing to his name.”</p>\n<p>“Don’t you dare talk about him like that!” Sanji snaps with surprising venom. “He’s a thousand times the man you’ll ever be, and he’s not no one. He’s going to be the greatest damn swordsman the world has ever seen.”</p>\n<p>“Not if he’s dead,” Judge says coolly.</p>\n<p>His tone, his expression, his entire countenance - all of it - are a complete reversal from what he’s just been showcasing. Moving almost lazily, he brings a hand up and presses a button on the inside of his armoured wrist. It depresses with a faint click, and then the entire world goes crazy.</p>\n<p>Explosions ring out all along the battlements, including right next to where Zoro’s standing. The conclusive force knocks him off his feet, and it’s only his observation haki flaring that sends him rolling to the side at the last minute and saves his life.</p>\n<p>Unfortunately, it doesn’t prevent him from getting hit entirely.</p>\n<p>No doubt having known where the blasts were going to be and reacting accordingly, Judge had anticipated where Zoro was going to land. His spear comes down in what would have been a killing blow had he not moved, and still manages to tear a large chunk out of his side as he’s tumbling across the stonework.</p>\n<p>Zoro bellows, more in rage than anything else, and tries to get his hands under him so he can grab one of his swords. To hell with what he’d promised Sanji, this just got even more personal and he wants some of his own back.</p>\n<p>He sees Judge looming over him, and manages to get his hand around Wado’s hilt, only to flinch in surprise, the motion sending a fresh wave of blood coursing over his torso, as Sanji appears in his vision.</p>\n<p>His mouth twisted in rage, the cook grabs Judge by the collar of his suit, dragging him down so they’re at eye level. “Big mistake,” he snarls in the older man’s face. “I can forgive or at least ignore a lot offences, but that’s not one I’m about to take lying down. He’s <em> mine</em>.”</p>\n<p>Judge’s good eye widens, and so too does Zoro’s own. Sprawled out as he is in a pool of his own blood, the swordsman watches with one hand clamped around his injured side while Sanji releases his grip only to spin around and slam the back of his foot into Judge’s jaw.</p>\n<p>Blood, spit, and at least one tooth spray across the battlement. Even better, a sharp crack rings out in a clear indication of a broken jaw. Then, as Zoro watches, Judge’s eye rolls back and he hits the ground with a meaty thud.</p>\n<p>“Good riddance.” Sanji spits, but barely takes a moment to contemplate his victory before whirling around and sprinting in Zoro’s direction.</p>\n<p>“Marimo!” He yelps, and it’s only when he lands on his knees next to Zoro and there appear to be two of him that the swordsman realizes the wound might be a little worse than he’d first thought. “Shit, that’s a lot of blood.”</p>\n<p>Glancing down at himself, Zoro’s forced to grunt in acknowledgement. It <em> is </em>a lot of blood, and probably explains the sudden dizziness. Still, he’s sure he’s had worse before and lived to tell the tale.</p>\n<p>“M’fine,” he mutters, frowning in confusion when Sanji doesn’t look reassured. “S’no big deal.”</p>\n<p>“I think we’re going to let Chopper be the judge of that,” Sanji replies. Craning his neck around, he twists until he spots a friendly face in the distance. “Oi, Franky! Zoro’s hurt! Find Chopper, and get him over here on the double.”</p>\n<p>“Fuck, Cook, I don’t need Chopper.” Zoro says, or tries to anyway. What actually happens is he moves to push himself into a sitting position, and winds up crashing down onto his back instead.</p>\n<p>“Zoro!” Sanji shouts, scrambling forward on his hands and knees and pawing at the fallen man. “Hey, look at me, Zoro. Come on, look at me.”</p>\n<p>Zoro tries, he really does, but he’s having more and more trouble focusing, and Sanji looks so sad all of a sudden that it hurts to look at him. Almost idly, he wonders why the other man is so upset after he’s just soundly beaten his oldest enemy.</p>\n<p>“Hey, hey, you need to stay awake!” Sanji insists. Leaning forward, he hooks a hand around Zoro’s jaw and tilts his face upwards. “Eyes on me, darling. Don’t you dare try to sleep right now. You can nap as much as you want later.”</p>\n<p>Zoro frowns, the cook’s words managing to break through the fog his brain has become, and making him cringe. After everything they’ve faced today, Sanji’s still keeping up his stupid act, which stings more than it has any right to.</p>\n<p>“Don’t,” he rasps, blood trickling out of his mouth as he forces the words out. “Don’t call me that if you don’t mean it.”</p>\n<p>“Call you -?” Sanji says, cutting himself off as his eyes go wide. “Oh shit! Wait, what do you mean ‘if I don’t mean it’? What are you saying? Oi, Mossball, answer me!”</p>\n<p>He sounds frantic enough and insistent enough that Zoro would really like to. Unfortunately, his body appears to have other ideas, and the last thing he sees is Sanji shouting to someone in the distance, demanding that they hurry up and move faster.</p>\n<p>*****</p>\n<p>Zoro wakes with a dull ache in his side and the sensation that his mouth is full of cotton balls. All too familiar with the symptoms of anesthesia, he cracks his eye open and is greeted by the well known sight of the <em> Sunny</em>’s infirmary ceiling.</p>\n<p>“Shit,” he grunts, bringing one hand up to scrub tiredly at his eye. “Not again.”</p>\n<p>Not enjoying how weak he feels, he lets his hand flop back down onto the bed. He then moves to try and shift the other one, only to realize he can’t because there’s a heavy weight pressing down on top of it.</p>\n<p>Confused, he tilts his head sideways, just far enough to get a look, and promptly jerks in surprise when he’s greeted with the sight of Sanji, sound asleep with Zoro’s arm underneath him. The motion sets his whole side throbbing and pulls a pained noise from him without his permission.</p>\n<p>He freezes, hoping he wasn’t loud enough to wake his sleeping companion, but no such luck. Sanji starts stirring while Zoro’s still trying to get his breathing under control and he lifts his head from where it’s been pillowed on his arms, blinking sleep out of his eyes.</p>\n<p>It takes him a second to realize Zoro’s conscious, but when he does, said eyes go wide and he leans forward in a rush. “You’re back,” he breathes, eyeing Zoro up and down like he’s half afraid this is some kind of fakeout. Of note, he keeps one hand curled loosely around Zoro’s own.</p>\n<p>“How are you feeling?” He asks then. “Are you okay? Do you need anything? Should I get Chopper?”</p>\n<p>What Zoro needs is a moment to parse through that barrage of questions. Once he thinks he’s got them all, he runs his tongue over dry lips, and says, “A little sore, but fine, yes, no, and no.”</p>\n<p>“Huh?” Sanji replies, indicating that even he hadn’t really known what he was saying. “Never mind, I’m getting Chopper.”</p>\n<p>Moving on instinct, Zoro grabs for the hand resting atop his own, clutching it tightly in order to keep the cook from going anywhere. “Don’t even try it,” he says, provided with an admirable rush of clearheadedness as he remembers what Sanji had been saying right before he’d passed out on the Germa flagship. “Talk to me first.”</p>\n<p>Sanji looks down at their joined hands before peering up at Zoro. “Um, what about?”</p>\n<p>Zoe squeezes his hand tighter. “What do you think?” He asks dryly. </p>\n<p>Sanji swallows and looks away. “I haven’t the faintest idea.”</p>\n<p>“Bullshit,” Zoro replies, yanking at his hand until he turns back around to scold him for moving too much. “You called me darling,” he says, once those blue eyes are back on him. “Right before I went under, I heard you.”</p>\n<p>A blush spreads across the bridge of Sanji’s nose, but he maintains eye contact this time. “I did,” he agrees levelly. “And you told me not to unless I meant it.”</p>\n<p>“Yeah, well,” Zoro shrugs. “There was no one around to keep up the act for, and it was hard enough hearing you say things you didn’t mean when there was.”</p>\n<p>“Why?”</p>\n<p>“Damnit, Curls.” Huffing in exasperation, Zoro moves to start untangling their hands. “Why do you fuckin’ think? Because I’m into you, obviously.”</p>\n<p>In answer, Sanji wraps his free hand around the one Zoro’s trying to pull away, effectively thwarting his efforts. “Since when?” He demands, his gaze now so heavy it’s like his eyes are boring holes into Zoro’s prostrate form. “Since fucking when?”</p>\n<p>Zoro groans, unable to believe he has to answer this and wanting to kick himself in the head for starting the conversation. “I dunno, a while? Back before Thriller Bark at least.”</p>\n<p>“Before - that was <em> over two years ago</em>!” Sanji shrieks. “Why didn’t you say anything? Were you …” He pauses then, looking unsure of himself. “Were you ashamed of how you felt?”</p>\n<p>Zoro takes a deep breath in through his nose and lets it out slowly, all while reminding himself that, given what he’s learned about Sanji recently, this is probably a logical conclusion on his part, as opposed to the absolute idiocy it sounds like.</p>\n<p>“<em>No</em>,” he insists, once he’s certain he can safely speak again. “I just didn’t think you’d ever be interested, and I didn’t want to screw up the dynamic we already had.”</p>\n<p>“Well that’s stupid,” Sanji declares. “Don’t you think I had a right to know?”</p>\n<p>“Why? So you could spend all your time coming up with creative ways to tell me to go take a hike?”</p>\n<p>“<em>No</em>,” Sanji shoots back, as forcefully as Zoro had. “So I could make an informed decision, of course. If the past few weeks have taught me anything, it’s that you don’t entirely suck as a boyfriend, you know.”</p>\n<p>“<em>Hah</em>?”</p>\n<p>“Husband. Fake husband.” Sanji clarifies, pulling one hand back so he can wave it around for emphasis. “Whatever title you want to give it, my point stands. You have been surprisingly attentive as a partner, and I want to know if that was <em> you </em> acting or if it was something else.”</p>\n<p>Zoro stares at him, trying to figure out what the proper response is here, and in the end decides the only way out is to tell the whole truth. “I wasn’t trying to manipulate you, or anything,” he hedges. “I was just … maybe okay with having a chance to treat you the way I’d always wanted.”</p>\n<p>Sanji lurches like he’s been punched, but recovers with remarkable speed. “So, what I’m hearing,” he says, holding up a hand to keep Zoro from interrupting, “is that all this,” the same hand now moves in a large circle, as if trying to emphasize everything between them, “was just genuinely you.”</p>\n<p>“ … yeah.”</p>\n<p>“Huh.” Leaning back in his seat, Sanji mouths something to himself that Zoro can’t make out and then nods, seemingly having come to a decision. “I’m going to kiss you now. Please don’t panic and try to stab me in response.”</p>\n<p>“Say what?” Zoro blurts, the second word getting lost in the press of Sanji’s lips on his.</p>\n<p>As first kisses go, it starts out kind of mediocre thanks to the way Zoro’s pretty sure he’s hallucinating. Then Sanji leans in to deepen it, and his free hand comes up to cup Zoro’s jaw, while the other one remains tangled with the swordsman’s own - after which, Zoro decides that, to hell with whether or not he’s imagining things, he’s not passing this opportunity up.</p>\n<p>“You - ” He tries when Sanji breaks the kiss and pulls back just enough to give him some breathing room.</p>\n<p>“Me,” Sanji agrees, shifting slightly to press a kiss to the tip of Zoro’s nose. “Will you punch me if I do that again?”</p>\n<p>“Might punch you if you don’t,” Zoro decides, rallying enough to get at least some of his faculties back. “Are you sure about this though?”</p>\n<p>In answer, Sanji starts pressing a bunch of featherlight kisses to the hinge of Zoro’s jaw. “I wouldn’t be here if I wasn’t serious,” he promises. “I wouldn’t do that to you.”</p>\n<p> “Also,” he adds, “I’ve kinda been wanting to do it since the night of the goodbye feast on Zou. Had to fight the urge when I was sitting in your lap.”</p>\n<p>Zoro supposes that makes two of them, although in his case there’s no way he’d have believed it wasn’t part of the charade had Sanji actually done it at the time. “This way’s better,” he decides, grinning when Sanji presses a kiss to his cheek.</p>\n<p>“Oh yeah, nothing says romance like a deathbed confession,” he mutters, rolling his eyes. </p>\n<p>Zoro tilts his head up just enough to catch the blond’s lips with his own. “I’m not dead,” he says, and thankfully stops himself from following that up with some crack about nevertheless feeling like he’s in heaven. He blames whatever drugs Chopper gave him for that thought even crossing his mind.</p>\n<p>“You’re not,” Sanji agrees, pressing their foreheads together. “And, much though it pains me to admit it, I’m kind of glad about that.”</p>\n<p>“Asshole,” Zoro murmurs, going in for yet another kiss.</p>\n<p>Sanji allows it, but presses him back into the mattress when he tries to repeat the motion. “God, you’re insatiable. And <em> injured</em>. No funny business while you’ve still got a crater sized hole in your stomach.”</p>\n<p>“That’s not my fault,” Zoro grumbles. “Speaking of, what happened with the rest of the fight?”</p>\n<p>In answer, Sanji smirks impossibly wide. “We kicked their asses and then destroyed every laboratory we could track down. Not only is Germa no longer a threat to anyone, but they’re of no use to Big Mom either.”</p>\n<p>“Oh gee, that’s so sad,” Zoro says without an ounce of sympathy in his voice. He snorts. “I bet Judge was pissed.”</p>\n<p>“You know, I think he might have cried?” Sanji says thoughtfully. “I’ll be honest, though, I’ve spent most of my time in here with you. What happens to those fuckers is of little interest to me.”</p>\n<p>“Good,” Zoro tells him. “They don’t deserve your attention.”</p>\n<p>“Unlike you, right?” Sanji asks, laughing when Zoro shrugs innocently. Propping one elbow on the bed, he rests his chin in his hand while he uses the other to lift Zoro’s and press a kiss to his knuckles. “I’m onto you, Mossball.”</p>\n<p>“I never pretended to be selfless,” Zoro replies. “Get used to it.”</p>\n<p>“As it happens, I think there’ll be a lot of things for me to get used to,” Sanji says. “However,” he adds, now making like he’s about to climb to his feet. “I really should go find Chopper so he can examine you.”</p>\n<p>“No, you should stay right here,” Zoro says, hauling back on his arm to stop him from leaving. “Chopper’ll be by to check on me before you know it, he always is.”</p>\n<p>“Careful,” Sanji insists, swaying backwards slightly thanks to the force of Zoro’s hold. “If I fall on you, it’s going to be your own fault.”</p>\n<p>“Then maybe you should lay down so we don’t have to worry about it.” Zoro suggests, liking that idea the more he thinks about it. “C’mon, Curls. If I have to be bedridden, the least you can do is keep me company.”</p>\n<p>“There’s not enough space,” Sanji protests. </p>\n<p>“There is.”</p>\n<p>“Is not.”</p>\n<p>“Cook. <em> Sanji</em>.” Zoro says, delighting in the way his use of his given name makes the other man flush. “I’m injured. Humour me.”</p>\n<p>“The point is to keep you from being further injured - oh, alright, stop pouting.” Rolling his eyes hard enough he’s lucky he doesn’t strain something, Sanji gives the bed a wary look. “This really isn’t made for two people.”</p>\n<p>“Guess we’ll have to get real close then.”</p>\n<p>Sanji groans. “That was terrible. <em> You’re </em>terrible. I can’t believe I’m attracted to you.”</p>\n<p>Zoro would consider feigning hurt, but Sanji’s climbing carefully into the bed even as he complains, so frankly he’s pretty content with his current circumstances. He waits for the other man to get properly settled, and then curls an arm around his waist contentedly.</p>\n<p>“Are you good?” Sanji asks. “I’m not hurting you, am I?”</p>\n<p>“I’m good,” Zoro assures him. “Are you?”</p>\n<p>“I - ,” Sanji bites his lip, his cheeks reddening. “I’m great, no problems here.”</p>\n<p>“Curls,” Zoro says pointedly, well aware the other man isn’t being entirely honest with him. “What is it?”</p>\n<p>“It’s just - ugh, this is so embarrassing, and I’ll kick your ass if you tell anyone about it. Would you,” Sanji takes a deep breath and refuses to meet Zoro’s eye, “do that thing you do?”</p>\n<p>“What thing?” Zoro asks, genuinely confused.</p>\n<p>Sanji wriggles his back awkwardly in response, and it takes Zoro longer than it should clue in. </p>\n<p>“You mean this?” He asks, starting to slowly trail his fingers up and down Sanji’s back in a move he refuses to call a caress.</p>\n<p>“Yeah,” Sanji says, now sighing happily. “That’s exactly what I meant.”</p>"
}