{
  "id": "4262046",
  "url": "https://archiveofourown.org/works/4262046?view_full_work=true",
  "author": [
    "aloneintherain"
  ],
  "title": "Safeguard",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Spider-Man - All Media Types",
    "Marvel Cinematic Universe",
    "Marvel",
    "The Avengers (Marvel Movies)"
  ],
  "relationships": [
    "Spider-Man/New York"
  ],
  "characters": [
    "Peter Parker",
    "New Yorkers - Character",
    "Tony Stark",
    "Aunt May",
    "Johnny Storm",
    "Wade Wilson",
    "Steve Rogers",
    "Fantastic Four - Character",
    "Flash Thompson"
  ],
  "additional_tags": [
    "New York City",
    "Secret Identity",
    "Identity Issues",
    "alludes to superhuman registration act",
    "(mentions of) mutant registration act",
    "Hurt Peter",
    "Hurt/Comfort",
    "discussions of consent",
    "underage superheroes",
    "Police",
    "protective new york",
    "Overprotective",
    "emphasis on the 'over' part",
    "News Media",
    "TV News",
    "POV Outsider",
    "the superhero community",
    "death mentioned in summary takes place before the fic and is brief and non-detailed",
    "Peter-centric",
    "condescending adults"
  ],
  "language": "English",
  "series": "",
  "published": "2015-07-03",
  "completed": null,
  "words": "17,710",
  "chapters": "1/1",
  "comments": "318",
  "kudos": "14,819",
  "bookmarks": "3,643",
  "hits": "141,003",
  "summary": "<p>After the public death of a superhuman 15 year old, teenage superheroes are forced to wear government-issued clothing that marks them as underage.<br>Or; Peter is backed into a corner, Tony Stark grows increasingly frustrated, and New York protects their own.</p>\n<p> </p>\n<p>Peter focusses on the pedestrians, on their whispering and pointing. At Peter. At his blue Regulation Jacket, in the middle of Times Square, blown up to epic proportions on the huge towering screens.</p>\n<p>Oh.</p>\n<p>“Oh,” Peter says, dumbly. “Oh no.”</p>",
  "notes": "<p>This was supposed to be 3K max. I started this before Helping Hands, but it flew out of control. I've spent so much time fiddling with this fic, I'm so happy to finally upload it.</p>\n<p>I've been thinking a lot about how the world might react to underage heroes. I mean, being a superhero is DANGEROUS. Really, really dangerous, and likely to end in major injury or death. Teenagers, out on a battlefield? Lots of adults are going to be very upset about that. </p>\n<p>Some housekeeping:<br>-Peter is 16, nearing 17.<br>-Super is slang for superhuman/superhero.<br>-I love Nova, but I had to have an underage superhero die to kick start the story, so. *shrugs* Pretend it’s another, nameless Super, if it bugs you too much.<br>-I'm not American. Hopefully this is not too obvious.</p>\n<p>EDIT: Cover art is by the wonderful bitterbiracialbibliophile on tumblr! Thanks so much!</p>\n<p>EDIT (2): More <a href=\"https://starpaw0007.tumblr.com/post/162678997499/fanart-for-the-spider-man-fanfiction-safeguard\" rel=\"nofollow\">art</a> by starpaw0007. Thank you!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I know, Deadpool is the poster boy for shitty morals, but I think even some characters must have things they aren’t okay with. Here, Deadpool’s is consent. (And the character himself has a history of sexual abuse in the comics, SO.) I ship Peter with a lot of people, but I hate ships that depict Peter in high school, dating someone in their late 20s/30s. Little 15/16 year olds dating people 30+? Creepy. CREEPY. Also, very illegal. </p>\n<p>I love the Avengers, including Tony. However, the man’s roles in some things (Ultron, Civil War, ect) make me so mad. I can love a character and admit they still have a lot of faults. The Avengers are my favourite superhero group, and I write them as the softest, kindest sweethearts. And maybe I made Tony more dickish than usual in this—especially considering the fact that I usually write him as a secretly schmoopy, selfless individual—but hey. Whatever.</p>\n<p> </p>\n<p>WOAH, this is the longest thing I’ve ever written? It's taken a lot of time, effort, and blood, and so feedback is very much appreciated. :)</p>",
  "text": "<p><img src=\"https://67.media.tumblr.com/66fb4ec796e7708970d766a8fdfb4337/tumblr_o69sdelufW1tcyk7mo2_1280.png\" alt=\"bitterbiracialbibliophile art\" width=\"600\" height=\"783\"> </p>\n<p> </p>\n<p> </p>\n<p>“Oh, no,” Peter says, words slipping out on a rough exhale.</p>\n<p>He swallows around his mouthful of pancake. The food has turned bland and rubbery in his mouth. It no longer tastes like syrup and choc chips, but something equally familiar, something that taste a little like grief, a lot like panic.</p>\n<p>“Hm?” Aunt May looks up from where she’s cutting her own pancakes. She sees his face, slack and ashen, and sits up straight.</p>\n<p>“Peter?” she prompts. “Honey?”</p>\n<p>Stare fixed on the small TV in their kitchen, Peter simply shakes his head. Aunt May looks over, sees the Breaking News, and gasps.</p>\n<p>The TV is on mute, but the script along the bottom of the screen reads: <em>Super killed in battle — revealed to be 15 years old.</em></p>\n<p>“My god,” Aunt May murmurs, hands clapped over her mouth.</p>\n<p>The footage cuts to a vaguely familiar streak of black and gold being caught around the middle and thrown to the ground. A much larger figure pounces on top of the Super. The villain’s huge clawed hand curls around the Super’s torso, reaching up and snatching an identifiable helmet off their head—</p>\n<p>Peter stands suddenly, chair scraping loudly against the tiles. “Nova!”</p>\n<p>The villain has Nova pinned, looming over him. He holds a huge, jagged sword aloft, before arching his back, bringing it down and plunging the blade—</p>\n<p>Aunt May cries out and flinches away, eyes squeezing shut. Peter can’t breath; he’s heard of Nova, knows Supers who are close with him. Peter had met him once, very briefly, caught the end of the other’s bad quip before he’d flown away.</p>\n<p>Peter reaches over and turns the volume up.</p>\n<p>“<em>Like many Supers</em>,” the newswoman says, “<em>Nova had maintained a secret identity throughout his career. His name and age were unknown until last night. His death has sparked a controversial, national debate on the ethnics of Supers and secret identities. Have other children taken up dangerous heroism under the guise of a mask? And if so, what is being done to protect our children?”</em></p>\n<p>Peter feels strangely hot, scrutinised somehow, like he’s under a magnifying glass, a thousand eyes trained on him.</p>\n<p>They replay the footage again, though sharply cut it short, ending before Nova’s abrupt death. Peter thinks, frantically, <em>that could’ve been me. Might just be, one day.</em></p>\n<p>“15 years old,” Aunt May says sadly. “What a tragedy… He’s only a year younger than you, Peter.”</p>\n<p>“Yeah,” Peter says, numbly.</p>\n<p>The news woman places a finger to her ear, listening to something. She straightens, and says, “<em>I’ve just received word that the death of the Super </em>Nova<em> and the subsequent national call for action, has resulted in Congress accelerating the Bill concerning the identification of underage Supers that has been in debate for some time now.”</em></p>\n<p>“<em>What</em>?” Peter chokes.</p>\n<p>“Oh, good,” Aunt May says, and Peter stares at her, betrayed. “I think almost everyone in this city wants to protect our heroes. I’m glad the government is on our side on this.”</p>\n<p>“Yeah,” Peter says, because he feels like he has to.</p>\n<p>Aunt May goes back to her breakfast, and Peter stares down at his pancakes. He inhales deep, grounding breaths, and tries to convince himself that this isn’t the beginning of the end.</p>\n<p> </p>\n<p> </p>\n<p>Peter sees the first sign of it on his way to class—he’s not late, for once, walking leisurely with his skateboard tucked under one arm, and so has time to look around, let his stare wander.</p>\n<p>A small, family run connivence store that Peter frequents sometimes, has posted a sign in its store window. It’s not too large, clearly homemade. In orange WordArt it reads, <em>Friendly Supers welcome! Supers in need shop for free. Water, food, first aid—we got your back!</em></p>\n<p>There’s a little sketch of Captain Marvel striking a winning pose in the corner. Peter stares at it, dumbstruck.</p>\n<p>“Huh,” he says. That’s new.</p>\n<p>He passes three electronics stores on his way to school. Large flat-screens are displayed in all of the shiny storefronts. Most of them are playing the news coverage of Nova. Every time Peter sees it, he feels suddenly bereft of air.</p>\n<p>All day, his classmates are talking about Nova’s death. Most says it’s <em>so sad</em> and<em> such a tragedy</em>. Some scoff and ask, <em>what’s the big deal? Who cares?</em>, and Peter has to wrestle down the urge to punch someone.</p>\n<p>To his classmates, Nova is a distanced figure, a Super on the other side of the city that slipped up in battle and payed for it. To Peter, he’s something else. Someone like him. Someone he could’ve called friend.</p>\n<p>Nova’s age is mentioned in conversation often—the topic is even openly discussed in Peter’s Lit class. When his teacher looks his way, prompts him to join the discussion on the merits of secret identities, Peter shakes his head.</p>\n<p>He swallows, and offers up his shyest look. “I—I don’t really have the authority to comment on something like that,” he says. He hears Flash snort several rows behind him, agreeing.</p>\n<p>The teacher purses her lips, but looks away and draws on someone else. Peter is relieved, though his stomach is still tangled in knots, and it is hard to breath around the lump in his throat.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>It’s on the news a few days later.</p>\n<p>“<em>The Bill concerning underage Supers received a yes vote today,\"</em> a newsman says. “<em>The Bill, if successfully passed, will identify all Supers who are under the age of 18 years old, similar to what people are calling the Superhuman Registration Act, which is still in the early stages of development.</em>”</p>\n<p>“Turn it off,” Peter says, thickly swallowing his mouthful of mashed potatoes. His upset stomach can barely handle his Aunt’s beautiful cooking tonight, let alone that kind of news.</p>\n<p>“Peter?” Aunt May asks, eyebrows pinching together.</p>\n<p>He reaches across the table and takes one of her hands in his, running his thumb over her wrinkled knuckles. He is painfully aware that he may lose her one day. This comfortable, domestic setting cannot last forever. With Uncle Ben, Peter hadn’t realised that. Now, he can’t forget it.</p>\n<p>“I just want to talk to you, Aunt May. Can we not focus on politics?”</p>\n<p>Aunt May smiles, touched. “Oh, Peter, of course we can.”</p>\n<p>The newsman is still discussing the acceleration of the Bill; <em>“It is likely the Underage Superhuman Act will pass sometime in the next week--\"</em></p>\n<p>Aunt May turns off the TV.</p>\n<p> </p>\n<p> </p>\n<p>Peter avoids the TV for the better half of the week. He blocks out any conversation near him about the Bill, and runs away from this the best he can.</p>\n<p>Like always, it comes back to bite him in the ass, ambushing him in the form of Tony Stark.</p>\n<p>He corners Peter on a high up rooftop. Peter stares, mouth agape under his mask. <em>“Iron Man</em>?” he asks, voice far higher than usual.</p>\n<p>Tony Stark—Peter can physically feel the part of his brain that deals with coherent speech shutting down, because <em>woah</em>—steps forward. The man is resplendent in red and gold, armour glinting in the afternoon sun. Peter watches, awed, as Tony holds out a gauntlet, something blue clasped tight in metal fingers.</p>\n<p>“I come baring gifts,” Tony says, gesturing for Peter to take the handful of fabric. Peter does so, and unfolds it. He holds it up.</p>\n<p>“Um,” Peter begins, eyeing the baby blue jacket. “Thanks?”</p>\n<p>“The Underage Superhuman Act passed this morning,” Tony explains, and Peter feels his blood turn to ice. “That’s the standard issued jacket to publicly identify underage Supers.”</p>\n<p>“<em>Excuse me?</em>” Peter asks. The jacket is trembling in his hands, and he feels cold all over, stomach like lead, heart beating wildly. “This is a—a—”</p>\n<p>“Regulation Jacket,” Tony finishes.</p>\n<p>Peter throws it to the ground and scrambles back on shaky legs. “I’m Spider-<em>Man</em>. Man! How do you even know I’m underage—”</p>\n<p>“SHIELD is a very extensive organisation,” Tony says, coming forward, scooping up the jacket and holding it out once more. Peter flinches away from it. “They keep track of high-profile cases, and despite the bright spandex and the whole <em>high-schooler</em> thing, you’re a very high-profile case.”</p>\n<p>Peter is in shock, numb. When Tony lifts his arms and guides him into the jacket, Peter doesn’t fight it. He doesn’t move when Tony zips him into the baby blue jacket, or when he steps away, surveying Peter, nodding to himself.</p>\n<p>Peter stutters a little when Tony’s boots whine, firing up. “It’s the law, kid,” Tony tells him, perhaps trying for reassuring.</p>\n<p>Peter does not feel reassured.</p>\n<p> </p>\n<p> </p>\n<p>The coat is a pale baby blue—could they have picked a more childish colour? <em>Bleugh</em>! —with its collar sitting snug under his chin. It’s small, ending halfway up his torso and flaring slightly around his ribs, its short sleeves sticking out.</p>\n<p>Everything from the colour—blue so light it stands out in stark contrast against his darker blue and red suit, painfully obvious—to the style makes Peter want to rip the thing off and set it on fire.</p>\n<p>Peter, sitting slumped where’s hidden himself away in a building’s high up alcove, picks at the restricting collar.</p>\n<p>In the distance, red and blue lights flare to life, sirens blaring into the night. The thought of going out in the jacket makes embarrassment flame in his cheeks.</p>\n<p>Peter deals with a ridiculous amount of embarrassment as Spider-Man. He’s overheard Flash and his classmates, even random admirers on the street, talk about how cool it must be to be Spider-Man, how awesome he is, how much respect and awe Spider-Man must garner from those he encounters. Ha ha.</p>\n<p>The sirens grow louder as more police cars join the procession. The situation must be growing dire.</p>\n<p>Peter takes a deep breath, and stands. He’s a hero, he reminds himself. Embarrassed or not, crappy passed Act or not.</p>\n<p>His feet leave the building’s edge, and Peter is thrown into free fall, easily swinging past skyscrapers and over traffic.</p>\n<p>He can do this, jacket or not.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>He follows the progression of police cars to a bank robbery, which he takes down in a record time, barely seen as he flits about in the shadows, webbing the robbers from a distance rather than dropping down and engaging them.</p>\n<p>He feels accomplished afterward, and stops three almost-muggings on his way back through the city. An aborted car accident, another mugging, and an hour later, and Peter feels as though nothing has happened.</p>\n<p>By the time Peter hears about the super-villain further in the city, Peter has entirely forgotten about the jacket.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“Times Square?” Peter says to himself. “Are you KIDDING ME?”</p>\n<p>Super-villains, with their stupid <em>egos</em>; they always want to be the centre of attention. It’s a Saturday Night, and Times Square is crawling with people.</p>\n<p>The NYPD are losing, badly, by the time Peter arrives. The super-villain of the night has flying robots—<em>wow</em>, <em>so</em> inventive—that appear imperative to bullets, impossible for the cops to fight. The cops dive for safety behind upturned vehicles. Peter swings closer, sticking to the shadows as he approaches.</p>\n<p>“Any Supers sighted?” a police officer says into his comms. His dark hair is balding, the dark cycles under his eyes telling tales of nights spent working through to dawn.</p>\n<p>“No,” a tinny voice crackles out of the comm. “No Supers spotted.”</p>\n<p>The villain jumps into the air on rocket boots (okay, fine, Peter’ll admit it; he’s a little impressed and very jealous) and laughs manically, firing a round of bullets at the police, who hunch closer to the ground, curling in on themselves.</p>\n<p>“No Spider-Man?” the officer asks, practically begs. He does not sound like Jameson, or any other annoyed reporters, or like a thousand cops before him who had taken one look at Spider-Man and tried to pepper him with bullets. He sounds beseeching, like he hopes the answer will be <em>yes</em>.</p>\n<p>“No,” someone on the comm replies sadly.</p>\n<p>“Fuck,” the cop whispers.</p>\n<p>The villain explodes a part of the pavement and sends pedestrians running and screaming. The cop tries to stand, but the moment he tries, the villain subdues him with warning shots.</p>\n<p>The officer has no choice but to flinch back for cover. He leans his forehead against the body of his gun, and murmurs again, with feeling, “<em>Fuck</em>.”</p>\n<p>Peter creeps even closer, skidding off the awning and swinging upside down beside the car the cop is crouching behind.</p>\n<p>“You should watch your language,” Peter says idly.</p>\n<p>The other man starts, head swivelling up to look at the masked hero. His eyes go wide, and a smile begins to bloom on his lips. His shoulders relax, just a little.</p>\n<p>Peter sticks out a hand. “I’m your friendly neighbourhood Spider-Man, and I’ll be your designated hero for tonight.”</p>\n<p>The cop laughs, taking Peter’s hand and shaking it as he says, “I’m Jeff, and I know who you are, bug boy. We were wondering if you’d show.”</p>\n<p>“Well,” Peter says, flipping to his feet and stretching lazily, “can’t disappoint my adoring fans, now can I?”</p>\n<p>On the street, the villain continues to spew chaos, ignorant to Peter’s arrival. The pavement is torn up, several cars reduced to husks of burnt and warped metal, but there are no bodies yet. The villain seems to be growing cocky though, and he is moving steadily closer to the curious civilians watching on the far side of the square.</p>\n<p>A little girl screams as a jet of fire whirls barely a metre to her left, and Peter jumps to his feet. The cops on the police radio are swearing up a panicked storm.</p>\n<p>“Gotta go,” Peter says quickly. “Duty calls.”</p>\n<p>He leaps over the car and swings closer. Behind him, Peter can hear the elated calls of “<em>Spider-Man</em>!” Several cops whoop victoriously, and his super-hearing lets him hear the rest’s relieved exhales, the soft murmurs of, “<em>thank god.”</em></p>\n<p>“Hey, douche-baguette!” Peter shouts. The villain freezes, turns to him, and scowls. “Try picking on someone your own size, huh?” He leaps, flips, and lands closer, web shooters pointed at the prick’s face. “Like yours truly!”</p>\n<p>He webs the villain’s face and the joints of the rocket boots, and the villain splutters in midair before being sent craning down, colliding painfully with the ground. His hands race to his face to try and tear the sticky stuff off, but his fingers just tangle in the long strands.</p>\n<p>“Going to give up, bud?” Peter asks casually. The villain trips over his own feet, sprawling over the pavement. “Come on, man, this is just embarrassing. Quit while your… well, not ahead, but not <em>completely</em> humiliated yet.”</p>\n<p>The villain scrambles back up, and pants roughly. His eyes flit around the square, surveying his webbed robots, the police officers that are moving out from their protected hunches, moving to help the frightened pedestrians. He looks up at the undamaged big screens, where his face is blown up to massive proportions. Most screens seem to be centred on Spider-Man, though. Specifically, his torso.</p>\n<p>The on-lookers point and stare, caught between awe and shock, and something like concern.</p>\n<p>His Spider-senses tingles. He’s on red alert as the villain doubles over laughing.</p>\n<p>“That’s rich!” the bastard says. “Oh— Oh, my god. You—<em>Ha</em>!”</p>\n<p>Peter shifts his weight, looking around frantically for any sign of danger. There is none. Peter is not reassured.</p>\n<p>“Um,” Peter begins. “You alright there, pal? You need a drink of a water? A blankey?”</p>\n<p>The villain smirks. Villains are always doing that; smirking. Is there some kind of super-villain handbook? How to Look Pompous and Evil 101? Chapter 1: Smirking and Slicking Hair Back. Chapter 2: Leather Pants and British Accents.</p>\n<p>“What about you, Spider-kid? Need a juice box?” Smirky-Smirk-face says.</p>\n<p>“It’s Spider-<em>Man</em>,” Peter snipes back, like he always does when someone questions his age, or hears his teenage voice crack.</p>\n<p>The villain’s smirk grows even more pompous. “Evidently not,” he says.</p>\n<p>Peter blinks at the guy. Now that the villain is still, silent, Peter focusses on the pedestrians, on their whispering and pointing. At him. At his baby blue jacket, in the middle of Times Square, blown up to epic proportions on the huge towering screens.</p>\n<p>Oh.</p>\n<p>“Oh,” Peter says, dumbly. “Oh no.”</p>\n<p>“Oh, yes,” Mr Conceited Prick says.</p>\n<p>He turns and laughs at the crowd, opening his mouth to say something witty and insulting. Peter tackles him before he can get the words out.</p>\n<p>“I’m old enough to beat you,” Peter says. He webs the other’s mouth shut before he can respond, then webs his arms together, his thighs, his legs, and jumps back to survey his work.</p>\n<p>“Spidey!”</p>\n<p>That’s the cops, calling to him as they rush over. Their guns aren’t pointed at him, and no one is asking him to put his “<em>fucking arms in the air or else!</em>” He’s faced that dozens of times before, back when he was just starting out, and he’d rather not deal with it again.</p>\n<p>“Spidey—“ There’s the officer from before, Jeff, pushing past his colleagues and rushing toward him. “I just realised—your jacket, it means… Spidey, you aren’t… are you…?”</p>\n<p>“A competent hero? The awesomest spider this side of New York? Very much hoping you aren’t going to try and arrest me? All of the above.”</p>\n<p>Jeff blinks at him. He’s an inch or two shorter than Peter, but he is stockier and appears far older. He looks like a good man, Peter thinks.</p>\n<p>“Arrest you… No, no!” Jeff shakes his head fervently. “No, we don’t do that anymore, we’re supposed to help you out when we can. We had a meeting about you and everything, it’s all good.”</p>\n<p>Peter blinks down at the other blankly—the NYPD had a meeting about him, about not shooting him, about <em>helping him</em>. Holy cannoli.</p>\n<p>The other officers hover several metres away, some clearing rubble from cars, others talking to pedestrians or into radios. Four are in the process of arresting Mr Villianous Ass over to Peter’s right.</p>\n<p>None of them are shouting or glaring at him. Their hands do not even hover over their guns, or ghost over the trigger as though itching to shoot themselves a spider. A blond cop sees him staring and smiles.</p>\n<p>“Thank you,” Peter says.</p>\n<p>He hopes his sincerity is obvious. The other man waves the gratitude away with one airy hand.</p>\n<p>“No problem,” the cop says casually. “But… Your jacket.”</p>\n<p>“You like?” Peter jokes. He twirls in a circle, holding his hands daintily to his chest. “Pretty, right? Got it from the cutest little boutique—“</p>\n<p>“Spidey,” the cop says. “Kid.”</p>\n<p>Peter sighs, lets his hands drops to his sides. He doesn’t try to run. He knows that will achieve nothing.</p>\n<p>“Look,” Jeff says, “I was talking to some of the others, and we’re worried. You’re a good person, you’ve saved so many, but this is dangerous—”</p>\n<p>Peter snorts a laugh. “I wouldn’t need to be out here if it wasn’t so dangerous. I climb walls and swing off buildings. I can lift cars. I think I’ll be right.”</p>\n<p>The cop narrows his eyes, and Peter realises how arrogant he sounds. He shakes his head and adds quickly, “Not—not that I think I’m invincible! I don’t! Trust me, I don’t, I’ve been shot so many times, and bleeding out in spandex in back alleyways gives you a better understanding of how not invincible you are, trust me—“</p>\n<p>He’s rambling and the cop is still staring, but the jacket’s collar is tight against his throat, a reminder that an aspect of his identity has been permanently outed. Peter rambles when he panics, okay? It’s a thing.</p>\n<p>“—annnnnd I’m making things worse by telling you about all the times I was mortally wounded, BUT the moral of this story is that I’m capable of looking after myself. And New York. I’m not defenceless. I know what I’m doing. Mostly. I mostly know what I’m doing. Thank you for the concern, but, er. It’s not needed, Mr—um.”</p>\n<p>He almost adds ‘Mr Police Officer, Sir’ on the end, but decides against it. That would not make him sound more grown up.</p>\n<p>“There’s no need for that,” the other man corrects. “It’s still Jeff.”</p>\n<p>“Your concern is not needed,” Peter repeats. “Jeff.”</p>\n<p>Jeff sighs heavily and rakes a hand through his hair.</p>\n<p>“Kid,” he says. “I know how capable you are, but… we’re all kind of shocked. I didn’t even realise what the jacket meant until someone told me a few minutes ago. Lots of the guys at the station… We’re indebted to you, Spidey. Half of New York is. You’re <em>our</em> hero, and we worry about you.”</p>\n<p>Peter wants to say something like, ’N'awwwwwww, you do care!’</p>\n<p>Or: ‘Baby, you know I love you, too!’</p>\n<p>Instead, he nods, solemnly. 12 months ago, when he was less renown and still fumbling through the basics of superhero-ing, he was used to people throwing <em>trash</em> at him and shouting threats. The police’s ‘shoot on sight’ method had resulted in more than one unlucky incidents, where Peter had had to sit in class the next day, biting his lip, pretending not to be suffering through the agonising process of healing. Doing calculus was a lot harder with bullet holes in your thighs.</p>\n<p>Now, though, actual real life police officers are telling him they cared. Just—Wow.</p>\n<p>“Be careful, alright?” Jeff adds.</p>\n<p>“No promises,” Peter says.</p>\n<p>Peter steps away as he notices more police officers heading their way, looking prompt, like they mean business. Legal waffle, questioning; Peter likes to avoid it.</p>\n<p>He leaps onto a car’s roof, using it as a step to jump into the air and swing down the street.</p>\n<p>Jeff smiles ruefully to himself.</p>\n<p>“Dammit, we needed to ask him a few questions,” a cop says as she approaches. She notices his little smile, and asks, “What is it?”</p>\n<p>“Spider-Man,” Jeff says quietly. She stares, confused, as Jeff laughs softly, smiling to himself.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Peter uses Aunt May’s kitchen knife to destroy the jacket. He pulls at the seams, using the blade to rip the blue atrocity in half. Afterward, he enthusiastically slam dunks the destroyed material in the bin.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>On Monday, the usual suspects are abuzz with gossip.</p>\n<p>Peter, head down, fumbling with his Modern History textbook and his notes on 20th century Russia, overhears Flash Thompson several lockers over. The blond is waving something in the air, and talking animatedly with a growing crowd of people.</p>\n<p>“Look!” Flash says, pointing at the paper in his hands. “Look at this! You know what this jacket means?!”</p>\n<p>“Oh my god,” a girl in the year below them says.</p>\n<p>“What?” the boy next to her asks. “What am I missing?”</p>\n<p>Flash positively beams, and says, loudly, “Spidey is our age!”</p>\n<p>Peter hunches his shoulders, wanting to disappear. For once, he wishes someone would come and push him into his locker, so long as they shut the door behind him.</p>\n<p>“Woaaahhhhh,” someone in the crowd says. Flash may be popular (and mean and pompous, ugh), but when it comes to Spidey Talk, he’ll talk to anyone. A cluster of people huddle around Flash at the moment. There are a distressingly large number of them. All of them are, Peter suspects, other dedicated Spider-Man fans.</p>\n<p>To be fair, most of the school are huge Spider-Man fans. Peter is very, very embarrassed about this fact.</p>\n<p>“Spidey is too cool,” a shorter girl says, sceptic. (Peter chokes on a laugh—him? Cool?) “You really think a high schooler could be that cool?”</p>\n<p>“Dude’s taken bullets, lifted cars,” a footballer agrees. “He’s a hero. You think someone like that can’t even legally drink?”</p>\n<p>Flash scoffs. “That’s the thing about Spider-Man, though. He’s the underdog! He’s a hero who defies all expectations and kicks butt! He’s the kind of guy who’d say ‘fuck the dangers’ and ‘fuck the consequences’ and go out save people, because saving people is more important than doing homework. So, yeah. Teenage Spidey all the way.”</p>\n<p>Peter literally tries to shove his entire head into his locker, his cheeks flushing red. Praise is a foreign concept to him, both in the suit and out of it.</p>\n<p>The group breaks out into noisy chatter. Some are arguing against, talking about how it’d be too hard to be a Super while still going to high school. It’d be hard to hide it from parents and teachers because <em>come on, someone would notice if a guy was coming to school with gunshot wounds and marks all up their face from being slammed by super-villains.</em> It’s more likely a hoax, or photoshop.</p>\n<p>But Flash has a fair few number of supporters who are arguing for Spider-Teen, saying how it makes sense, how much cooler and more relatable it makes the hero.</p>\n<p>The first bell rings, and the crowd disperses, still chattering as they walk away.</p>\n<p>Peter is frozen, hands crumpled around his messy notes, eyes wide and ears red. He does not move until the hallways are almost empty, and then, slowly and cautiously, he wanders over to Flash’s locker.</p>\n<p>There, left crumbled on the ground, is a newspaper. A photograph of Spider-Man takes up the front page. In the photo, he’s crouched low, mid-fight with the mediocre villain Peter had nabbed in the middle of Times Square. The baby blue jacket stands out against the darker red-and-navy suit.</p>\n<p>The headline reads: SPIDER-MAN OR SPIDER-KID?</p>\n<p>“Oh no,” Peter says.</p>\n<p> </p>\n<p> </p>\n<p>Peter refuses to look at the newspapers after that.</p>\n<p>He refuses to look online, and pretends not to hear Jameson on the big screen around New York, shouting, ’teenagers!’ and ‘I knew it! High school <em>menace</em>!’ and ‘send the bug to juvie!’</p>\n<p>No. Nope, he certainly hears <em>nothing of the kind.</em></p>\n<p>Denial, thy name is Peter.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The next time Peter sees police officers, it’s after he’s stopped a bank robbery.</p>\n<p>It had seemed so simple at first. Nothing out of the ordinary, just a couple of criminals Peter could take down one handed.</p>\n<p>And <em>then</em> the criminals had pulled out machine guns, seemingly out of <em>no where</em>. Not even Peter’s Spidey senses and his superhuman reflexes could save him and the large group of hostages from that many bullets.</p>\n<p>Five causalities—five people who wouldn’t be returning to their families tonight, one of them a twelve year old kid.</p>\n<p>Peter had bodily taken three bullets when the leader had pointed a gun on a six year old boy, and he’d panicked and jumped in front of the nozzle.</p>\n<p>Peter manages to survive, somehow, and webs the criminals up. Before he can make his retreat, the cops arrive. Peter’s relieved, largely because the hysterical hostages calm down some, reassured at seeing the boys in blue.</p>\n<p>“‘Afternoon,” Peter says when the first group of officers burst in. The greeting sounds dull. Peter can’t muster up the joking energy he usually saves for emergency services first arriving on the scene. He gestures to the far wall, where the four bank robbers are webbed together. “Criminals that’a way.”</p>\n<p>The first cop nods, heading toward the bank robbers, but the second hesitates, eyeing Peter carefully. Peter tiredly waves him away, pointing at hostages, tears still wet on their faces, blood still thick on the ground. “Hostages, that’a way.”</p>\n<p>The cop nods and disappears behind the bank’s counter where several people are huddled, traumatised. Peter rubs at his thigh, where a bullet is buried beneath layers of web and skin.</p>\n<p>Peter’s going to get out of here in a minute. He’s going to get up from his leant position against the wall, and walk out those doors with only the barest hints of a limp, and then swing home. He will… just as soon as he finds the energy.</p>\n<p>“Spidey?” Peter looks up. A cop with dark skin and soft eyes approaches him slowly, hands spread non-threatening in front of her. “Hey, bud. How hurt are you?”</p>\n<p>“Not hurt,” Peter lies.</p>\n<p>Two other cops jog over, hovering behind the soft-eyed police woman, glancing from her to the half-crouched vigilante. He’s long since destroyed the Regulation Jacket, but their eyes still trace him, searching up and down his suit. Whatever they see make them purse their lips, eyes crinkling with worry.</p>\n<p>“Spidey!” A familiar figure runs into the complex, spotting him immediately. The man heads over, ignoring his three colleagues and coming to brace an arm around Peter’s shoulders. “Hey there, remember me?”</p>\n<p>“Jeff,” Peter breathes.</p>\n<p>“Yeah,” Jeff says. He supports Peter, guiding him away from the wall and toward the bank’s glass-doored exit. The three officers gape at them, the soft-eyed cop staring at Spidey, hands clenching into worried fists. </p>\n<p>Peter ducks his head, embarrassed, and Jeff snaps, “Don’t you all have jobs to do?”</p>\n<p>Two of them scurry away to assist their colleagues, but the first one doesn’t move, gentle brown eyes focussed on Peter. “You going to be okay?” she asks.</p>\n<p>Peter glances at Jeff. “Yeah,” he says, and this time, he isn’t entirely lying.</p>\n<p>The woman nods, and leaves, heading toward a distraught hostage struggling to breathe through their tears. Jeff sighs, and says, “C’mon, Spidey.”</p>\n<p>Jeff helps Peter limp toward a pair of paramedics. Jeff waits with him as they do their best to cut away his webs, dig out the bullets, and stitch him back up. Peter refuses to go to a hospital. Jeff refuses to leave the younger man’s side.</p>\n<p>Nothing anyone can do could help Peter forget the image of the preteen, mouth open in horror, skin ashen in death, blood pooling onto the bank floor. Still, Peter feels a little better. Jeff’s hand on his shoulder, a pair of steady hands cleaning up his wounds; Peter feels like he can breathe.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Pedestrians slow when they pass the hot dog van. Some of them pause briefly, just long enough to see what’s drawn so many New Yorkers’ gaze, before huffing angrily and stomping away, muttering to themselves about <em>menaces</em> and <em>damned Supers.</em> Others smile when they see the costumed figure, or point and whisper excitedly to one another.</p>\n<p>The owner of said hot dog van smiles to himself. He ignores the crowd, the stares, the pair of red and blue legs swinging over the side of his van’s roof, and continues making hot dogs.</p>\n<p>“Mustard this time?” he questions.</p>\n<p>“Of course!” Spider-Man says, offended the man had to ask. “What is a ‘dog without mustard, honestly! You’re supposed to be the hot dog professional here, seriously, where did you get your hot dog degree, good sir—“</p>\n<p>“Yeah, yeah,” the man says, smiling and holding the hot dog into the air above him. “Take the damn thing before I give it to a paying customer.”</p>\n<p>There is a superhuman flash of limbs and his hand is empty, the food gone. An upside-down Spider-Man smiles closed-mouthed at him, mask pulled up to his nose, mustard smearing his cheek.</p>\n<p>Spider-Man swallows and beams. “Thanks, Stan!” he says, before disappearing from sight.</p>\n<p>Stan knows the vigilante is lazing upon his roof now, using it like his personal sofa. He does it often enough.</p>\n<p>Several months ago, Spider-Man had saved Stan and his van from being flattened by an out-of-control truck. Stan saw the Super two weeks later, when he’d fallen hard upon the pavement mid-swing, his hands bloody, his breathing ragged.</p>\n<p>Stan had helped the guy up, like any descent person would. He hadn’t called an ambulance, though he could see the difficulty Spider-Man was having breathing. He hadn’t called the police, or the <em>Bugle</em>, or said anything about an autograph.</p>\n<p>Instead, Stan had offered him a hotdog.</p>\n<p>“You look hungry,” Stan had said.</p>\n<p>“I—I don’t have any money…” Spidey replied weakly.</p>\n<p>Stan had patted the guy on the back, and smiled.</p>\n<p>“For you?” Stan said. “On the house. A free hot dog, whenever you want.”<br>\nSince then, Spider-Man had been by once a month. Once a month turned into once a fortnight, then every other a week. Now, Stan feels concerned when he doesn’t see the hero sitting on his van at least once a week.</p>\n<p>It helps that the bug was good for business. A few pictures of Spidey sitting astride his van had even made it into the papers.</p>\n<p>Five minutes pass in companionable silence. Stan sells hotdogs—he always sells twice the usual amount when Spidey’s sitting on his van—and the costumed hero takes deep breaths and heals from whatever beating he’d taken earlier, recharging his mental batteries.</p>\n<p>“Um.” A college-aged boy approaches cautiously. An Avengers shirt is stretched over the broad expanse of his chest, a jean jacket covered in pins looped over his arm.</p>\n<p>“Here to buy something?” Stan asks bluntly. He can see the way the boy’s eyes flit to the hero nervously, and Stan’ll be damned if he lets someone bug Spidey when he’s resting. The masked kid trusts him, has become something like a friend. Stan knows how much nosiness freaks Spidey out.</p>\n<p>“No, erm. Sir, are you aware Spider-Man is sitting on your roof?”</p>\n<p>Stan stares down at the other man.</p>\n<p>“Spider-Man?!” Spidey interjects, his voice pitched jokingly high. “What?! Where?”</p>\n<p>“Ha, ha,” Stan says flatly. “You’re hilarious.”</p>\n<p>“I like to think so, yes.”</p>\n<p>“Oh, my god,” the boy whispers to himself, jaw hanging low as he stares, awed.</p>\n<p>“Hiya,” Spidey says. The hero’s scooted to the edge of the van, his legs hanging over the side again. “Can I… help you?”</p>\n<p>“No, I just… You’re Spider-Man.”</p>\n<p>“I am?!” Spidey says, faux alarm in his voice. He glances down at his spandex-clad chest and lets out a little shriek. “Oh my god! How long? I never knewwww!”</p>\n<p>“Spidey,” Stan admonishes gently.</p>\n<p>“Ha, sorry, man. I just get that a lot—“ Spidey cuts off mid-sentence. He shuffles even closer and leans down to peer at the college kid, as though only just seeing him for the first time. “Hey, nice badges!”</p>\n<p>The kid—<em>baby-faced, but likely older than Spidey,</em> Stan thinks—starts, looking down at his jean jacket. He would be holding up the line, but at this point, people are standing away, too surprised to see Spider-Man talking to two random New Yorkers to even think about venturing closer or buying a hot dog.</p>\n<p>“Oh,” the boy says, “thanks!”</p>\n<p>The boy unfolds the jacket and lifts it into the air so Spidey can see the badges properly. The masked man lets out a delighted ‘ooh!’ sound. He points at four of them—a captain american pin, two mutant rights pins, and one anti-Underage Superhuman Act pin.</p>\n<p>“I really like these,” Spidey says. The kid shifts his hold on the jacket, and Spidey coos as he spots a red and blue webbed pin. “Is that a Spider-Man badge? Dude!”</p>\n<p>The boy blushes. “Sorry, that must be weird, I just—“</p>\n<p>“No, no! I like it, it’s cool.”</p>\n<p>“You… you really think so?”</p>\n<p>Spidey nods earnestly, and the kid beams.</p>\n<p>“Well, then,” the boy says as he unpins the badges Spidey had pointed to. “Here. You can have them.”</p>\n<p>Spidey squawks and jumps back. “I can’t take your things! Just—direct me to the site or the store you bought them from, and I’ll buy them myself!”</p>\n<p>Stan huffs a laugh. “You can’t afford hot dogs most days,” he points out.</p>\n<p>“I—er,” Spidey begins. He falters, looking lost; Stan knows just how broke the guy is, has heard the dramatic whining sounds he makes whenever the subject of his bank account is brought up. “Well… You refused whenever I tried to pay you for ‘em!”</p>\n<p>“Of course,” Stan says, “but you stopped offering because you don’t have enough money to pretend. Nice try, Spidey.”</p>\n<p>Spider-Man makes sad sounds—there they are, the sad ‘I’m so <em>brokkkkkkkke</em>!’ noises—and Stan laughs softly to himself.</p>\n<p>The kid moves forward and grabs hold of Spidey’s gloved hand. He manually opens it palm up, pushing the badges into his hand.</p>\n<p>“Take them,” the kid insists. “Really.”</p>\n<p>“Are you—”</p>\n<p>“I’m sure.”</p>\n<p>Spidey is silent for a long moment. He shakes his head, before putting the pins safely in a hidden pocket around his waist.</p>\n<p>“Thank you,” Spidey says. His voice is thick with sincerity and gratitude over four meagre badges.</p>\n<p>Spidey, still perched on the roof of Stan’s van, leant forward over the edge to talk to the both of them, stiffens suddenly. The hero immediately looks to all the pedestrians nearby—now starting to go about their busy lives, now that it’s evident nothing overly exciting is going to happen.</p>\n<p>“Spidey-sense…?” Spider-Man murmurs to himself, rubbing at his temple. “There’s no danger, what the heck is up—<em>OOF</em>!”</p>\n<p>And Spidey goes flying off Stan’s roof in a blur of red and flashy gold, spandex limbs tangled in iron ones.</p>\n<p>The college kid stares off after them, mouth agape.</p>\n<p>“Was that… was that <em>Iron Man?!”</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Iron Man finally stops several streets away, atop a relatively secluded rooftop, and Peter disentangles from the older hero.</p>\n<p>Peter already knows what this is about; he’s been expecting something like this for a while now. He’s heard about lots of the older Supers personally enforcing the Regulation Jackets. Peter steels himself, ready for a fight.</p>\n<p>Stark grabs him around the shoulder and thrusts a wad of blue fabric into Peter’s chest. Peter lets it drop to the floor.</p>\n<p>“No,” Peter says. “No, nope, nada. Not this time.”</p>\n<p>“You have to,” Iron Man tells him, firmly.</p>\n<p>“Do I have to say it in spanish? <em>No</em>.”</p>\n<p>Peter tries to run, jump off the building and swing away, only to have repulsers blasted warningly near him. He tries a second time and steel arm wraps around his throat, prohibiting him from making a hasty get away.</p>\n<p>“You have to wear it,” Tony keeps saying. “C’mon, kid, we’ve been through this.”</p>\n<p>Iron Man’s faceplate is cold, expressionless, and Peter refuses to admit how intimated he is (Iron Man! An Avenger! Peter may be angry, but even the sudden realisation that his longtime idol is actually kind of a huge dick can’t quell that tiny part within him that’s star-struck).</p>\n<p>“That—that right there is why I refuse to!” Peter says. “I’m a superhero, alright? Kind of hard to be symbol of hope when everyone keeps calling me ‘kid.’”</p>\n<p>“It’s the law.”</p>\n<p>“THE LAW CAN SUCK A DICK!”</p>\n<p>Peter flails in Stark’s grip. When Stark flips his faceplate up, Peter manages to elbow him in the nose before backflipping and sprinting across the roof. He’s halfway to freedom, when he hears Stark say into his comm: “Alright, hawk-brain. Your turn.”</p>\n<p>An arrow lodges in his leg, and Peter goes down hard.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The jacket is itchy and ugly and Peter HATES IT.</p>\n<p>He’s nursing a sore leg and an even sorer grudge. The arrow that had buried in his thigh was small, barely thicker than one of his thin fingers, but it had <em>hurt</em>.</p>\n<p>Peter doesn’t care about whatever guilt the two Avengers are harbouring, or whatever happened to them to make them so damn protective of teenagers who throw themselves in front of bullets, because <em>seriously</em>. How dare they try and meddle in his life.</p>\n<p>Peter shreds the jacket with vengeance as soon as he gets home. He refuses to wear that thing again. The first time had been humiliating enough.</p>\n<p>Will the older Supers come after him again? Yes. Does Peter care? Okay, also yes, but the jacket must DIE.</p>\n<p>This time, instead of throwing the tatters of the ruined jacket in the rubbish, he lights the fireplace in his living room and burns it.</p>\n<p>Aunt May comes home to find him laughing, crazed, over an alarmingly large fire. Peter rubs his hands together, staring deep into the flames as something pops and crackles as it melts.</p>\n<p>“Burn,” Peter murmurs to himself, voice high and vaguely hysterical. “Yes, burn, <em>burn</em>!”</p>\n<p>Aunt May tiptoes away from the living room.</p>\n<p><em>Teenagers</em>, she thinks, shaking her head.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>They pin him again<em> the next day</em>. Stark throws another jacket at his head. Peter brushes it away, letting it fall to the ground.</p>\n<p>“You stubborn shit,” Stark shouts, picking the jacket back up and shoving it into Peter’s arms. “<em>Wear it.</em> I’m not fucking around.”</p>\n<p>Peter lifts his mask to his nose and sticks his tongue out at the older Super. Tony throws his hands in the air and activates his boots, rocketing away, disappearing into the skyline.</p>\n<p>On the way home, Peter drops the jacket into the sewer.</p>\n<p> </p>\n<p> </p>\n<p>They call in Deadpool. THEY CALL IN <em>DEADPOOL</em>. Deadpool isn't even supposed to be allowed <em>in</em> New York, good lord.</p>\n<p>“Actually, no one called me,” Deadpool says when Peter screams this into his hands. “Volunteered for this all by myself, Spidey!”</p>\n<p>“<em>Why</em>,” Peter moans, words muffled by his hands and mask. He feels bullied.</p>\n<p>“To make sure our li’l spider was eating his greens! You been drinking enough milk, kiddo? Have any homework you need ol’ Deadpool to help you with? Actually, scratch that, I hate homework, used to set it on fire or make paper planes out of it, or used it to make paper planes that caught fire when they flew, ooh can we do that—?”</p>\n<p>“Why do you <em>care</em> about this stupid law?” Peter interrupts. “Who cares about some dumb jacket? Why should you care that I’m a high schooler?”</p>\n<p>The anti-hero sobers, shoulders straightening in a worrying way.</p>\n<p>All of Wilson’s behaviour today has been worrying. The merc isn’t bouncing forward to sling an arm over Peter’s shoulders, cuddling up close, or slipping an arm around his waist and groping Peter’s ass, like Deadpool often does. There was no wolf-whistling when Peter had first swung past, no shouts of ‘<em>Spidey-babe! Sweet cheeks!</em>’ Nothing lewd, nothing alluding to Wade’s dick and what he wants Peter to do with it. Unusual.</p>\n<p>“Spidey,” Deadpool says. “I thought you were an adult. Okay, not a very old one, but you know, at least 22, 23, not some fucking high schooler, fuck…”</p>\n<p>Peter remains unimpressed, if not a little unnerved by Deadpool’s relatively serious tone. “So?”</p>\n<p>“So? <em>So</em>? So, I’ve been working my  game on you!” Deadpool gestures between them. “I’ve been flirting up a storm! I seduced a higher schooler!”</p>\n<p>“You did not seduce me,” Peter says, deadpan.</p>\n<p>Deadpool continues as though Peter had never spoken; “I’ve been trying to get into the pants of a <em>kid</em>. I’ve literally tried to shove my hand into your pants several times.” Deadpool had succeeded, too, once or twice. Peter feels red hot with embarrassment. Despite the red and black suit firmly in place, Peter can see how sickened the merc is. “I’m a creep, sure, but I’m not a pedophile—“</p>\n<p>“I never thought you were,” Peter says quickly, because c’mon, he’s sixteen, not six. “I’m almost an adult—“</p>\n<p>“You’re a teenager!”</p>\n<p>“Who cares?”</p>\n<p>“Who cares—? Spidey!” Deadpool moves forward, closer, puts both of his hands on Peter’s shoulders. “I’m an adult, I should’ve—ugh, I’m not good with this. There’s, like, moral ambiguity—yes, I know, I sound smart as fuck with my big-ass fancy words—about teenagers and their—their ability to consent. Adults—” Deadpool gestured at himself, and then at the rest of the city, where other heroes and villains and civilians slept, “—do shit to heroes. I’ve seen it Spidey, the way ungrateful people act when you save them. Sometimes they swear or shout death things or shout sex things, and.” Deadpool clenches his fists angrily. “And you’re a fucking kid.”</p>\n<p>“I’m not a child—!”</p>\n<p>“You’re a fucking <em>high schooler!</em>”</p>\n<p>Peter lets out a frustrated groan. Here Deadpool was, finally acting like an adult for once, and he does it to gang up on Peter.</p>\n<p>“What is it with everyone thinking they know better than me?! I can’t drive, so freakin’ <em>what</em>? You know what I can do? Save people. Lift cars. Make a difference.”</p>\n<p>“No one’s saying that you can’t, Spidey.” Baby blue fabric is thrown at him—and come on, how many of these ugly jackets does the city have?—and Peter catches it instinctively. “If you were against a stranger in a suit, and you had orders to take them out by Fury, or torture them for info, would you still do it if you knew the target was actually a 13 year old?”</p>\n<p>Lectured on morals by Deadpool. Peter would be proud of his friend if he wasn't so frustrated, didn’t feel a tiny sting of betrayal, didn’t feel a little bit honoured that the merc cared.</p>\n<p>Still, it was strange seeing Deadpool so serious. Peter had never seen him act even remotely like this before. Deadpool looked oddly passionate about this, about the rules of consent. There must be a story behind that.</p>\n<p>“I’m not 13,” Peter says.</p>\n<p>“Would you do it?” Deadpool presses.</p>\n<p>Peter’s hands are fisted in the folds of the jacket. He stares at it, willing it to catch fire.</p>\n<p>“No,” Spidey admits, “but I don’t kill or torture people as a general rule anyway so—”</p>\n<p>“Put the damned jacket on, Spidey.”</p>\n<p>The jacket is pulled on over his webbed suit. This time, there are no insistent hands pushing him into it, no rough tugging from someone else, no one else to tighten the collar around his throat like a vice.</p>\n<p>This time, Peter pulls the jacket on himself.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>He goes out in the jacket.</p>\n<p>Nothing really changes that first day. He swings around, still hears shouts from people as he passes them—some awed, some angry—and he still saves people. He almost managed to forget about the jacket entirely.</p>\n<p>The next morning is a Tuesday. Peter munches on a bowl of cornflakes and honey, and watches Aunt May go about making herself a bowl of oats. The tiny television on the kitchen provides a soft drone of noise.</p>\n<p>“Oh!” Aunt May says suddenly.</p>\n<p>Peter looks up sharply, limbs going tense, ready to spring up and fight at a moments notice.</p>\n<p>Aunt May is only focussed on the TV. Peter relaxes, relieved, but then Aunt May flicks the volume up, and he stiffens and crushes the metal spoon in his hand in half.</p>\n<p>“<em>Spider-Man was spotted yesterday evening preventing a car accident. The masked hero was wearing a blue jacket, and our sources confirm it is the same Regulation Jacket assigned to underage superheroes in the wake the Super </em>Nova’s<em> death several weeks ago.“</em></p>\n<p>The shot of the newsman cuts to shaky iPhone footage. It’s him, Peter realises, Spider-him, using his webbing to pull a tiny Volkswagen and its passengers out of the path of an out-of-control truck. He pulls several frozen onlookers out of the way too, before darting forward and trying to web the truck to a stop.</p>\n<p>The truck merely slows, not stopping, and Spider-Man bodily puts himself in front of it, hands out, feet firmly planted, to push the truck back. He stumbles a little, but manages to right himself in time, and slow the truck to halt before it could crash into the building full of people barely a metre away.</p>\n<p>\n<em>“Spider-Man appeared to sustain some damage from the impact—“</em>\n</p>\n<p>That had hurt, Peter remembers. He’d grabbed the truck the wrong way, and the full weight had caught him around his upper body.</p>\n<p>The newsman continues, <em>“The jacket suggests that Spider-Man is under 18 years old, legally a child. The pedestrians we interviewed appeared alarmed at the idea of a teenager putting themselves in such a dangerous situations, and also being harmed due to—“</em></p>\n<p>Aunt May’s eyes are wide, both hands clasped against her mouth. Peter thinks for a moment she’s worked out that Peter’s Spider-Man, and the breath is stolen from his lungs.</p>\n<p>“Oh god,” she whispers. “That poor boy.”</p>\n<p>Peter relaxes, then he scoffs, saying, “Poor? Aunt May, he’s a Super.”</p>\n<p>“But he’s still a <em>person</em>. It must be so hard to deal with it, so much violence… I’ve been an adult for a long, long time and it’d frighten me too much to even move.”</p>\n<p>Peter subtly bends his metal spoon back into shape beneath the table, and says, casually, “I’m sure it’s not that scary.”</p>\n<p>Aunt May cuffs him lightly round the ear. “Peter, unless you’re the one out there helping people, you should have some respect. Everyone should. Spider-Man is very brave.”</p>\n<p>Peter takes a large bite of cornflakes to hide his smile. “Yeah?” he asks with a full mouth.</p>\n<p>Aunt May nods. “His parents must be so proud. I know I would just be bursting with it—and oh! His poor parents. I can’t imagine how hard that would be to see your child out there, in danger…” Aunt May picks up her bowl of oats and joins Peter at the table, leaning forward to ruffle Peter’s hair lightly when she’s in reach.</p>\n<p>“Thank goodness you have a nice, sensible hobby like photography,” she tells him. Peter discreetly pretends he isn’t choking on his breakfast.</p>\n<p> </p>\n<p> </p>\n<p>Peter finds the pins he’d received from the young New Yorker, the one with the jean jacket and the huge, awed eyes, outside of Stan’s hotdog van.</p>\n<p>“Huh,” he says, staring at them appraisingly. He’d forgotten all about them in wake of Tony Stark’s abrupt arrival.</p>\n<p>He thinks about what to do with them. Pin them on his satchel? Maybe. Stick them on his own jean jacket? Peter doesn’t own a jean jacket. He only owns his beat up brown one, and the awful baby blue—</p>\n<p>Wait.</p>\n<p><em>If I’m going to wear it,</em> Peter thinks,<em> I might as well go all out…</em></p>\n<p> </p>\n<p> </p>\n<p>Peter stops the Juggernaut on a Wednesday. It’s a sunny afternoon, everything clear and visible in the middle of a crowded New York street. Peter is glad—he makes sure to arch his back, puff out his chest a little, and stand still enough for people around him to catch a photo of him.</p>\n<p>It’s on the internet before Peter makes it home.</p>\n<p>He finds one of the photos on twitter, with the caption:<em> This is the most passive-aggressive thing I’ve ever seen. Kudos, Spidey.</em></p>\n<p>The photos—Peter standing tall, chest out, gazing to the right where a webbed up Juggernaut struggles on the pavement—shows off the pins Peter had stuck to his Regulation Jacket. The Anti-Superhuman Registration Act pin is the biggest and immediately catches the viewer’s eye, surrounded by the two anti-Mutant Registration Act pins and the smaller Captain America one. Peter had almost left that one off, after the aggressiveness of Iron Man, his fellow Avenger, but Peter can’t bring himself to.</p>\n<p>“Ah yes,” Peter says to himself, stroking an imaginary beard on his chin, eyeing the increasing number of retweets—well into the <em>thousands</em>, good <em>lord</em>—with a satisfied smile. “Good.”</p>\n<p> </p>\n<p> </p>\n<p>Peter is not shouted at as much.</p>\n<p>Well, no, that’s not quite true. People still dislike Supers, some people always will. Jameson gets worse (spitting words like “menace” and “teenagers,” like they leave a dirty taste on his tongue), but the general public stops throwing trash at him.</p>\n<p>Most of them.</p>\n<p>Generally, the whole city had already gotten better before the Nova incident. Most of New York liked him, loved him even, but there was still a part of the population that felt inclined to throw soda cans and harsh words his way when they saw him in costume.</p>\n<p>Now days, Peter sees those people less. They still exist, but now, when they start shouting, aim themselves with projectiles, people in the vicinity shout back. It’s… nice. Bewildering. A bewildering kind of nice.</p>\n<p>The most obvious case of this is on a Tuesday afternoon, the sunlight thick and warm in the streets. Peter tends to stick to the air, swinging on his webs high above the cars, but today, he’s ventured lower, and is glad for it when he sees a man about to be crushed by a falling steel beam.</p>\n<p>Peter tackles a construction worker out of the way, and they tumble into the street from the force. Peter is reaching down to help the man to his feet, an apology on his lips, when he hears it.</p>\n<p>A man, an angry Southern one, shouts from a yard over, “Hey, freak!”</p>\n<p>Peter ignores him and hauls the construction worker to his feet.</p>\n<p>“Thank you,” the man says breathlessly. “Crap, <em>shit</em>. I was almost <em>crushed</em>—thank you so much.”</p>\n<p>“Try to make those beams a little sturdier next time?” Peter suggests with a laugh, patting the man on the shoulder, brushing off the dirt on the man’s uniform.</p>\n<p>“HEY, <em>you!</em> I’m talking to you! Look at me when I’m talking to you, you fucking freak!”</p>\n<p>Peter sighs hugely, knowing the words are aimed at him. He wants to flip the man off, but wide eyed children skirt along the edges of his vision—a pair of boys with matching, agape mouths, a little girl hiding behind her mother’s dress, a toddler reaching for Peter’s strange, brightly coloured costume from his mother’s arms—and bites down the urge.</p>\n<p>“What a dick,” the construction worker mumbles angrily under his breath. “Some people, I swear. No respect.”</p>\n<p>Peter shrugs. “I get it a lot,” he confesses. “New Yorkers, y’know.”</p>\n<p>“Get the FUCK off my streets, you hear me? No one needs you fucking freaks in our city, attracting weird shit and—and <em>criminals</em>.” Peter sighs again, planning to say goodbye to the construction worker and beat a hasty retreat up into the skyline, but freezes as the man continues: “It’s YOUR FAULT people keep dying. All those people those villains kill, and fucking car crashes and shit—where were YOU, you goddamn—!”</p>\n<p>Peter’s whole body has gone taunt, shoulders curling around his neck like they do when he’s plain old Peter Parker, making himself smaller, trying to form a barrier, a shell, between him and the world.</p>\n<p>It hurts, to hear the words that ring in his head throughout the day echoed back at him. This man’s words, his insults. The truth. It hurts.</p>\n<p>“HEY!” The construction worker straightens up, a good 6 feet in height. His huge muscles, disguised by a beer belly, bulge as he curls his hands into fists. “You want to <em>shut up</em>, pal?!”</p>\n<p>“It’s <em>true</em>!” the shouter says. “This fucking—”</p>\n<p>He’s come closer, too close, outstretching a hand toward Peter as though to grab him and shake him, or tear into him more than his words already have.</p>\n<p>Peter tenses even more. He wants to run, take off like a skittish animal, but his boots are rooted to the ground, heartbeat pounding in his ears.</p>\n<p>The man lunges forward, his fingers so close to Peter they brush against his back. Several things happen at once; the woman with an armful of toddler, shrieks at the man (“HEY, STOP—!”), and the pair of casually dressed men to his right, previously chatting idly, jump into the scene when the shouter moves, catching Peter’s would-be attacker by the scruff of his shirt. An older woman, around his Aunt’s age, rushes over, spitting swear words over her conservative cashmere sweater and pearl necklace.</p>\n<p>The construction worker has sidestepped in front of Peter, fists braced in front of him, a physical barrier between the teenager and the attacker.</p>\n<p>“Fuck off,” the construction worker tells the man. “You hear me? <em>Fuck off.”</em></p>\n<p>The mother presses her toddler’s face into the crook of her neck, and hisses, “What the hell is wrong with you? How <em>dare you—”</em></p>\n<p>“You <em>fucking</em>—“ the older woman says around a lipsticked grimace, looking about ready to clobber the man over the head with her handbag.</p>\n<p>The man in a loose tie, holding the prick in a tight hold, shakes him and says, “You want to pick a fight, mate? Pick one with me.”</p>\n<p>Peter’s would-be attacker thrashes in his grip, and his friend helps him restrain the guy, gripping at him tight, anything but gentle.</p>\n<p>The aggressive man bares his teeth, nodding his head at Peter. “The freak fucking <em>deserves</em> to take a goddamn beating, look at him—”</p>\n<p>The people surrounding Peter, the tiny crowd who’ve assigned themselves as his protectors, do not take kindly to this, leaping in with their own indignant shouts:</p>\n<p>“Hey, shut the FUCK UP—”</p>\n<p>“What the fuck, man—”</p>\n<p>“You ignorant—you have no idea what exactly—”</p>\n<p>“Erm,” Peter says. Five New Yorkers are shouting at someone who attempted to hurt him, visibly bristling, throwing words and looking ready to throw fists. The man’s words—nothing Peter hasn’t heard spat his way before, really—are drowned beneath a sea of angry rebuttals, the shouts of people coming to Peter’s defence.</p>\n<p>They are a spectacle on the packed street. People hover around them, excited at the drama. Many of them hear their argument, work out what exactly the fuss is about, spot Peter clothed in spandex and confusion, and become agitated themselves, angry on his behalf.</p>\n<p>“Guys,” Peter tries. None of them hear him. “<em>Guys</em>?”</p>\n<p>“How ungrateful, trying to hurt someone who risks life and limb to protect this city and undeserving pricks like you!”</p>\n<p>“The bitch doesn’t do shit for this city, he ruins it, it’s his fault New York is—”</p>\n<p>“He’s a child, how could you—”</p>\n<p>“Dude, <em>it isn’t his fault—“</em></p>\n<p>The angry man kicks one of the men holding him in the shin—who immediately clutches at it, howling—and elbows the other in the face. The construction worker stalks closer, fists bared, and the attacking man draws his arm back to sock him in the face.</p>\n<p>Peter darts in-between them, just in time to catch the punch meant for the construction worker right in the mouth.</p>\n<p>Peter feels blood thicken his mouth, his lip splitting. There are immediate howls of protest from people around him, more people hurrying forward to do something. A bigger fight, a full on brawl waiting to happen. It suddenly occurs to Peter that getting hurt is the worst possible thing he could’ve done in a situation full of protective New Yorkers.</p>\n<p>\n<em>You sure messed this up, Parker. Had to make it worse, didn’t you?</em>\n</p>\n<p>Peter grabs hold of his attacker before anyone else can, jumping into the air, leaping across the street with the protesting man in hand. Peter deposits him on the other side of the road. The guy’s an asshole, but Peter isn’t about to let him be beaten to death by a mob of angry New Yorkers.</p>\n<p>“Get out of here,” Peter tells him, as coherent as possible with a mouthful of blood.</p>\n<p>“I don’t need your help,” the man spits. “This is your fault—”</p>\n<p>“Yeah, you’ve said that enough in the last ten minutes. Now go, before the dozen or so angry people across the street come after you.”</p>\n<p>The man looks at him with unkind, beady eyes, a snarl caught on his lips, but sees the bristling mob behind Peter, the promise of violence still hanging in the air, and wisely scampers off.</p>\n<p>Peter swings over to the mob once the man is out of sight, landing in a crouch on top of a street pole rather than flat footed on the sidewalk. The group look up at him, halfway worried, halfway confused.</p>\n<p>“Spidey,” the construction worker begins, stepping forward.</p>\n<p>“Thanks for the save,” Peter says.</p>\n<p>“Just returning the favour,” the construction worker says with a tired smile. “You okay?”</p>\n<p>“Yeah,” Peter says honestly. His lip is swelling, but it will have healed within the hour, and the words the man had shouted at him have dimmed, slipped off him in the wake of these people’s actions. He raises his voice to address the crowd; “Thanks for being my knights in shining armour, everyone. I, er. Actually appreciate that a lot.”</p>\n<p>A few open their mouths, more shifting closer to him, but Peter stands and jumps into the air and leaves quickly.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“New Yorkers,” Peter pants out as he soon as he lands, “are crazy.”</p>\n<p>Stan doesn’t even look up. He just nods as he gathers up another hotdog, squirting ketchup into a fresh bun. “Don’t need to tell me that, pal.”</p>\n<p>Peter slumps against the van. Blood is no longer welling up in his mouth, but there’s still a lingering sting and awful copper taste that makes him rub at his jaw, smack his lips together and wince.</p>\n<p>“Seriously.” Peter makes an aborted, frustrated gesture with one hand. “Just—<em>why</em>.”</p>\n<p>Stan looks up, spots the blood still wet along Peter’s mask, and almost drops the hotdog he’s holding. He reaches across the counter and touches Peter’s jaw, looking horrified when his fingers come away red. “Spidey! What happened? Are you okay?</p>\n<p>“Not you too,” Peter dismays. “Can’t a man go about his business in <em>peace</em> in this city?”</p>\n<p>He leans back, surveying Peter. “Yeah,” Stan decides, “you’re okay. What happened?”</p>\n<p>Peter shrugs. He doesn’t much feel like getting into it. “Just—just people. You know.”</p>\n<p>Stan nods seriously, pretending to understand, and pours mustard over the sausage. Peter is grateful; Stan, at least, treats him with some semblance of respect. He trusts Peter’s judgement.</p>\n<p>“You’d think after all the Supers in this city, New Yorkers would become desensitized to it all but <em>no</em>, they keep hurling abuse—” Stan shoves a hotdog into Peter’s hand. Peter stares up at the vendor. “I love you.”</p>\n<p>Stan rolls his eyes. “Careful, don’t let my wife hear.”</p>\n<p>“Why can’t people be as chilled as you, Stan?” Peter asks around a full mouth.</p>\n<p>Stan watches him with steady eyes and a cocked head, considering Peter calmly. “Eventually, people will understand. They will, if it’s you. You—you inspire something in people, Spidey.”</p>\n<p>“Huh?” Peter’s jaw is covered in crumbs, smudged mustard decorating the curve of his jaw.</p>\n<p>Stan laughs. “Shut up and eat your ‘dog, kid.”</p>\n<p> </p>\n<p> </p>\n<p>Doctor Octopus is manic, deranged, hugely dangerous, but he’s someone Peter’s <em>dealt with before.</em> He <em>knows</em> Doctor Ock. He can handle him and his ‘bots.</p>\n<p>“Get out of here, kid,” Tony Stark tells him when Peter lands in the middle of the battle. The older man has both repulsers up, shooting oncoming Octobots, and barely even turns to Peter to dismiss him. “We got this, run along home to mummy.”</p>\n<p>Peter takes it in-stride; he’s used to the teasing from other Supers, often dishes it out twice as bad as he gets.</p>\n<p>“Too much for you, old man?” Peter quips, webbing an approaching Octobot to the road. It writhes there, tentacles splayed out, and Tony shoots it dead. “Don’t want to be shown up by someone younger and more attractive than yourself?”</p>\n<p>“You wish,” Tony says.</p>\n<p>“I get it, you have a Snow White complex! Yeah, you don’t want someone younger to outshine you as the fairest in the land.” Peter snickers to himself, as he runs along the roof of a car, backflips off the end, and lands on a bot, crushing it with his weight and force of his jump. “N’aw, are you insecure?”</p>\n<p>“Nice jacket,” Tony quips back. “Glad to see you’re following daddy’s orders.”</p>\n<p>“‘Daddy’, wow, kinky. Though, hey, can you even get it up, nowadays? Don’t you older guys have to take special medication and shit? Not that <em>I’d</em> know, of course.”</p>\n<p>Tony stares at him, or glares at him, or maybe just looks vaguely in his direction—with the emotionless metal faceplate it’s hard to tell. Still, it’s unnerving, intimidating. Maybe Peter shouldn’t mention the guy’s dick? Maybe he really is getting insecure in his old age. Maybe Peter hit a nerve.</p>\n<p>Tony activates his rocket boosters, and with an electronic whine and a burst of light, he rockets upward, so fast he’s nothing but a blur of red and gold.</p>\n<p>Peter’s ears are ringing, and he stares up, watching Tony disappear further into the city, fast as a bullet.</p>\n<p>“Show off,” Peter grumbles. He’s secretly impressed.</p>\n<p>Five minutes and four destroyed Octobots later, and Tony is back, landing in the rubble in a heroic pose that certainly doesn’t make Peter feel inadequate in his brightly coloured spandex. Nope. No insecurity here.</p>\n<p>“He’s still here,” Iron Man says, not to Peter. His comm, likely. “Yeah, I’ll talk to him, Cap’.”</p>\n<p>And then Iron Man is coming over, towards Peter, and his begins to heart races. Maybe this is it. What Peter’s been dreaming of since he was 12 and first saw the group of superheroes on TV.</p>\n<p>Here it comes:<em> I’d like to talk to you about the Avengers Initiative. Would you consider joining?</em></p>\n<p>Peter Parker, Spider-Man,<em> full time Avenger.</em></p>\n<p>“Hang up the mask,” Tony says, and Peter’s heart stumbles in his chest, breath frozen in his throat. “You’re too young for this. You shouldn’t be out here.”</p>\n<p>“Excuse me?” Peter hisses. He feels betrayed, more upset than when Tony Stark had held him on that rooftop and forced him into a horrid, violating Regulation Jacket.</p>\n<p>“This is too dangerous,” Tony says. “You’re, what? Twelve?”</p>\n<p>Peter’s hands turn into fists, muscles going taunt.</p>\n<p>Tony continues, and to Peter, he sounds infinitely arrogant, “Yeah, you should go home, do some homework, take a nap. Hug your parents. Whatever, just get of here and leave it to the big boys, okay?”</p>\n<p>“Don’t tell me what to do,” Peter says. Quips are beyond him, his humour having fled him.</p>\n<p>The robots are in shambles around them. In the distance, Peter is sure Black Widow or someone equally awesome is punching Doctor Ock in the face. Normally, Peter’d give anything to see that. Now, his stomach is full of stones, weighing him down. It feels as though his idol is spitting in his face.</p>\n<p>Tony says, “I’m an adult—”</p>\n<p>“I swear, if the next words out of your mouth are <em>I know better—“</em></p>\n<p>“Look, you’re too young. Come back when your balls drop, okay?”</p>\n<p>Peters hands tremble, blood pumping in a rage. “How could you just—how could you order me to stop being Spider-Man when you’ve never even cared before.”</p>\n<p>“You could get hurt next time,” Tony says flippantly, ignoring Peter. “Can’t have another teenage death on our hands.”</p>\n<p>“You’ve never cared before,” Peter repeats, “even though I know SHIELD has been aware of my age for ages. You’ve never cared about my family, or the super-villains—<em>like Doc Ock</em>—I’ve fought before, or even dropped in and offered help when the news was playing footage of me getting shot full of bullets. When I almost <em>died</em>, alone, without anyone ringing me or banging on my door asking if I was okay, even though you all <em>knew</em> I was injured. You’re a hacker, you work with SHIELD, a goddamn<em> secret intelligence organisation,</em> don’t pretend you didn’t know. ”</p>\n<p>Peter huffs, suddenly out of breath. He feels light, full of adrenaline, like he’s just run a marathon. Anger continues to chase a path through his veins. He continues, “So how dare you try and order me around now, when you never gave a <em>damn</em> before.”</p>\n<p>Did Iron Man know Nova? Did the Avengers even care about the 15 year old being hurt by super-villains? Apparently not, if they can’t even bring themselves to help Peter, or offer him access to their medical facilities rather than trying to get him to <em>run home</em>, despite the injuries currently decorating his body. Here he is,<em> in front of an Avenger</em>, out of breath and half covered in bruises and blood, littered with deep cuts where he’d been too slow and the sharp ends of the Octobots’ tentacles had sliced into him.</p>\n<p>Peter’s 17 years old next week; he’s 18 months older than Nova was.</p>\n<p>“No,” Iron Man says, “we never knew.”</p>\n<p>“Bullshit,” Peter says, the swear escaping him without thought. Peter never swears.</p>\n<p>This is the first they've cared, and it’s in an abstract, distanced sort of way, and they do it by ordering Peter out of this life he’s built for himself?</p>\n<p>“Go home, kid,” Tony says. He jumps into the air, and flies away, leaving Peter shaking in the dust.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Peter has known the Hulk for some time now. They’re not particularly <em>close</em>, but they have an understanding. They’re friends, in a way.</p>\n<p>So when Peter sees the Hulk heading toward a small invasion of radioactive rabbits—yes, apparently this is Peter’s life now—he doesn’t hesitate to swing over and help.</p>\n<p>“Spider small,” the Hulk says immediately when Peter lands catlike in the middle of the road, ready to join in the firefight.</p>\n<p>“Obviously,” Peter says. He gestures to himself, where his spandex does little to hide his narrow frame, delicate shoulders, and thin wrists and ankles.</p>\n<p>“Small,” Hulk repeats. His stare is intense, but Peter isn’t fazed; they’ve been friends for a while, and though they sometimes go for months without seeing one another, they’re an oddly protective pair. Peter refuses to let anyone treat the Hulk like a wild animal, and Hulk won’t let anything hurt Peter.</p>\n<p>Hulk adds, “Baby spider. No fighting.”</p>\n<p>A dangerous concoction of frustration and rage has been simmering away slowly, eating away at the linings of his insides, and it rises forward now, bubbling up his throat. “I’m NOT A CHILD!”</p>\n<p>He’s never shouted at the Hulk before. The other Super sometimes says things that are hurtful, but Peter has always taken it in stride, let it roll of his shoulders. Now, bristling from Tony’s curt dismissals the day before, Peter is seething.</p>\n<p>He knows the Hulk won’t lash out and crush him. The Hulk has control, and actually likes Peter. He won’t hurt him. Probably.</p>\n<p>“No. Spider is,” the Hulk argues, petulant. “Young. Too small.”</p>\n<p>“I’m <em>NOT</em>—”</p>\n<p>The Hulk lays a huge hand on Peter’s chest and pushes him back. He tries for gentle, but Peter still stumbles from the force, though he’s made of sturdy stuff, and stays on his feet.</p>\n<p>“I don’t care,” Peter says. “I’m going to help no matter what you say.”</p>\n<p>He takes a couple of steps back before jumping into the air, flipping to shoot a web far above him. The Hulk is fast though and so much stronger, and he snatches Peter out of midair and puts him down on the road.</p>\n<p>Peter tries to dart away, swing back into the skies, but again, the Hulk catches onto his ankle, pulls him down—roughly this time, the Hulk’s annoyance bleeding through—and Peter crashes down hard enough to make the road around him crack.</p>\n<p>Healing factor or not, that’s going to bruise brightly.</p>\n<p>“Leave,” Hulk says. “Spider go be safe.”</p>\n<p>“Hulk,” Peter tries weakly, climbing to his feet, rubbing at his side, “come on, buddy. We’ve helped each other out a bunch of times before, and I was fine then.”</p>\n<p>“Tony says—”</p>\n<p>“Tony’s an asshole.” The Hulk breathes hot air in his face, eyebrows screwing up, and Peter realises how close those two are, suddenly. He amends, “I mean, he’s a great guy, sure, he’s kind of been my idol since forever, but… He’s an adult. He doesn’t get it, y’know?”</p>\n<p>Apparently, the Hulk doesn’t know, because he says, “Tony says spider could get hurt.”</p>\n<p>Ah. The Hulk has always been paranoid about that, even before anyone had whispered suggestions in his ear, mentioning how particularly vulnerable Peter is. The Hulk is so large, practically indestructible, and the people around him <em>aren’t</em>. It must be like being friends with glass figurines. The Hulk’s always hovered around him, been there to pull him immediately out of danger.</p>\n<p>Peter’s shoulders slump. He’s so tired. “Yeah, bud, I could. I know I could, but I don’t care if I get hurt.”</p>\n<p>“Hulk care.”</p>\n<p>The mask hides Peter’s small, sad smile. “Thanks, man, but shouldn’t I get a say about it? It’s my right. I have the freedom to decide what to do with my life.”</p>\n<p>“Spider too small.”</p>\n<p>Peter’s hands form fists, tiny in comparison to the Hulk’s huge meaty ones. His smile is gone; the mask hides that, too.</p>\n<p>“Okay,” Peter says. Something blooms in his chest, aching. The familiar sting of betrayal. “Okay.”</p>\n<p>He wants to blame the Hulk for this—really, really wants to. He wants to blame <em>someone</em>, but can’t quite find it in himself to do so. Everyone’s just… looking out for him.</p>\n<p>Peter walks away from his friend. He’s usually a blur of movement, walking with his head thrown back, eyes to the sky, but now, he takes level steps, head hanging low, shoulders curled. Like this, Peter does appears small.</p>\n<p><em>Maybe,</em> Peter thinks, a weight in his stomach, <em>they’re all right.</em></p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>This jacket is a cage. It’s a physical barrier between Peter and those he wants to help. Needs to help. Spider-Man <em>needs</em> to help people.</p>\n<p>But this jacket—it’s all people see. When Peter lands flat footed in the streets, people see the blue of his jacket and shut him out. New Yorkers, emergency services, other Supers. They <em>won’t let Peter help.</em></p>\n<p>Sitting on the edge of a high rising building, jacket clenched in white-knuckled fists, Peter tries his best not to shake apart.</p>\n<p>He takes a deep breath. Another. His fists are bunched into the blue fabric like a lifeline, stopping him from tearing himself apart or falling off the ledge, plummeting, webs unable to pull himself up. Peter’s been having a lot of dreams like that lately.</p>\n<p>He feels a bit like that now, like he’s falling. Everything is going past him too fast and Peter is scrambling, desperately fighting for purchase on the walls racing past, but he can’t. He’s falling, and the winds whipping past him are like blades, like fingers, ripping into his skin, ripping the suit away from him. Taking Spider-Man away from him.</p>\n<p>Peter exhales roughly. This weariness is not a unique feeling among Supers. He’s spoken with plenty of them. The Fantastic Four, Daredevil, rogue X-Men; they all agree. This life is hard. It brings you down.</p>\n<p>Peter pushes away from the building’s ledge. He finds his bag, tugs on his jeans, tugs off his mask, and goes home.</p>\n<p> </p>\n<p> </p>\n<p>Peter stops going out.</p>\n<p>The mask is shoved somewhere under his bed, hidden by a pile of dirty laundry. His Aunt May has stopped digging through his things, respecting his privacy. The mask remains undisturbed.</p>\n<p>The Regulation Jacket is folded neatly in a locked box on the floor of his cupboard. Untouched.</p>\n<p> </p>\n<p> </p>\n<p>New York Times, page 8;</p>\n<p><em>Since the Super </em>Nova’s<em> death, over a dozen Supers have worn the regulation blue jacket that signifies they are under the age of 18, legally a child. In that time, crime rates have rose drastically, along with the number of deaths in high risk situations involving super-villains, and disunity in inter-superhero relations.</em></p>\n<p>\n<em>Which begs the question; are the Regulation Jackets worth it?</em>\n</p>\n<p> </p>\n<p> </p>\n<p>A week later, and the front cover of the morning paper reads, <em>Spider-Man missing?</em></p>\n<p>That afternoon, just as school is ending, Peter is ambushed by Johnny Storm.</p>\n<p>The blond pulls up outside Midtown High in a flashy red car, side window rolled down, the collar of his leather jacket popped. Peter stands on the curb, unimpressed even as Johnny grins winningly at him.</p>\n<p>“Get in,” Johnny says.</p>\n<p>“Go away,” Peter tells him. “You’re beginning to attract attention.”</p>\n<p>It’s true, he is. The students flittering out of the school glance at the fancy car, the red paint job glinting prettily in the sun. They eye Peter too, standing by it in raggedy sneakers and old jeans. It’s not a secret that Parkers don’t have much money; Peter’s often teased about it. That Parker kid, with his scholarship and poor family. <em>Poor</em> Parker. Poor, puny Parker.</p>\n<p>Johnny’s expression slides into something harder. “Peter. Get in the car,” he demands.</p>\n<p>“No.”</p>\n<p>“Fine.” Johnny reaches down to unbuckle his seatbelt. “I’ll just hop out, then. We can chat in front of your school. Bet everyone would love to see the famous, very recognisable Johnny Storm, <em>Human Torch,</em> conversing with regular ol’ Peter Parker, huh?”</p>\n<p>Peter gets in the car.</p>\n<p> </p>\n<p> </p>\n<p>Peter huddles into the kitchen counter, long fingers playing with a mug of tea. Johnny had pushed it into his hands as soon as Peter had sat down—“Sue pushed manners onto <em>me</em>, so now I have to push hot drinks onto <em>you</em>. Apparently, it’s polite.”—but he hasn’t touched it, letting the tea grow cold.</p>\n<p>Johnny is a storm of conversation, bustling around the joined kitchen and living room, fiddling with the TV, fixing them snacks. Constant movement, distracting. Without even realising it, Peter finds himself relaxing.</p>\n<p>Peter’s been to the Baxter Building plenty of times. Now, though, Peter doesn’t feel the usual happy buzz he associates with the familiar place. He feels cold. Empty.</p>\n<p>“Peter,” Johnny says suddenly, catching his attention, leaning against the kitchen bench opposite Peter. “You know, this whole thing isn’t that bad.”</p>\n<p>Peter immediately goes taut, glaring at the blond. “Like you’d know.”</p>\n<p>“Hey, I’m underage, too.”</p>\n<p>“Haven’t seen you wearing the—“ Peter screws his face up in disgust. “—the jacket.”</p>\n<p>“Well, yeah, I’m part of a team of adults. There’s a clause.” Johnny clears his throat, and quotes, haughtily, “<em>‘If the Super’s identity and age are known to two or more superhuman teammates, then they are not required to wear a Regulation Jacket.’”</em></p>\n<p>Peter glares harder. “Shut the fuck up, Storm.”</p>\n<p>Johnny pretends to gasp, body curling back, scandalised. “Peter Parker, you swore! Call Captain America, the boy scout swore!”</p>\n<p>“I said, <em>shut the fuck up.”</em></p>\n<p>“There! You did it again! Whatever happened to ‘being a role model for little fans’, huh?”</p>\n<p>“There’s no kids here.” Peter squints at Johnny, and corrects, “Well, aside from you.”</p>\n<p>Johnny laughs, and the moment is broken. The blond hero darts off to collect something from another room, playfully ruffling Peter’s hair as he passes.</p>\n<p>It isn’t until Peter gets a call from his Aunt a little while later, asking him to hurry home and could he please buy milk on his way, that Johnny catches him around his arm, and turns serious again.</p>\n<p>“It’s okay, Peter,” Johnny tries.</p>\n<p>“It’s not,” Peter says hoarsely.</p>\n<p>“You’re strong; you’ll make it through this. You always do.”</p>\n<p>Peter shrugs him off. “Yeah, well. It’s different this time, isn’t it?”</p>\n<p>Johnny Storm is a good friend, a good person. Empathetic, concerned after the wellbeing of others; he’s more like his sister than he’ll let on. His worry shows in his open expression. “Peter, is there anything the Four can do?”</p>\n<p>Peter’s gaze remains hard. “Unless you have a time machine? No.”</p>\n<p>“Hey, you never know what Reeds has down in his labs.”</p>\n<p>Johnny attempts a light-hearted smile, but it falls flat, only managing to stretch out his face, looking wrong, plastic.</p>\n<p>There’s an awkward moment where Johnny stares at Peter, a lump stuck in his throat at he fumbles with this, the limitations of their friendship. Johnny has no idea how to reach past that barrier and help his friend. He wants to fix this, but he has no idea how to. Johnny should’ve—he should’ve interfered sooner. Helped Pete.</p>\n<p>Peter, drowning in his situation, struggling keeping his chin above the surface, does not meet Johnny’s gaze.</p>\n<p>“I have to go,” Peter says finally.</p>\n<p>“Okay,” Johnny says.</p>\n<p>Peter leaves. Johnny stays in the middle of the kitchen, hands curled into frustrated fists, staring after him.</p>\n<p>Sue comes home soon after, and looks surprised to find Johnny standing by himself, glaring at the doorway</p>\n<p>“Johnny?” she prompts. “What’s wrong? Is… is there anything I can do?”</p>\n<p>“You wouldn’t happen to have a time machine, would you?” When that fails to elicit even a smile from her, Johnny sighs deeply. He pauses, then frowns, then looks at her, considering, a plan beginning to take form. “Actually, Sue…”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“Peter?”</p>\n<p>Peter’s voice is muffled, words collected by the pillow he’s shoved his face into. “Go ‘way!”</p>\n<p>“Peter, you have to come down sometime.”</p>\n<p>“No, I’m staying in my room forever!”</p>\n<p>Peter hears the door to his room creak open slowly, and then his Aunt’s soft, sympathetic voice; “Oh, honey.”</p>\n<p>The mound of pillows and blankets moves as Peter shifts on his bed, rolling over and pulling down his comforter enough to expose his bloodshot eyes and the top of his bed-head.</p>\n<p>“Everything is terrible,” Peter tells her solemnly. <br>\nAunt May takes a seat on the edge of his bed, running a hand through his hair and scratching at his scalp like she usually does when he’s sick and whiny. “You want to talk about it?”</p>\n<p>Peter presses into her touch, letting his eyes flutter shut. “Really don’t,” he says.</p>\n<p>Maybe he’s not dealing with this like an adult. Maybe building himself a nest of blankets and pillows and taking refuge in the dark isn’t the mature, responsible way to deal with this. After all, Peter has been demanding other’s treat him like an adult and yet here he is, acting like a small child.</p>\n<p>But, hey. Everything <em>is</em> terrible, and his Aunt May is <em>the best</em>. Can anyone really blame him?</p>\n<p>“I made cookies,” says Aunt May.</p>\n<p>“Oh, my god,” says Peter. “I love you.”</p>\n<p>Aunt May disappears, and returns less than five minutes later with a plate of warm choc chip cookies and a tall glass of milk, a folded newspaper tucked under her arm.</p>\n<p>Peter just about drools at the desert she hands him, but scrunches up his nose at the paper.</p>\n<p>“I thought you liked doing the crosswords?”</p>\n<p>Peter makes a face. “I don’t want to see another newspaper ever again.”</p>\n<p>Aunt May nods, accepting that easily—probably assuming it has something to do with the disastrous job interview Peter had a few months back with the Bugle for a temporary internship. Admittedly, Peter does cringe whenever he thinks about it; he still has nightmares about Jameson, plagued by vivid images of the man—the way his upper lip jiggled when he yelled, decorating with sweat and spittle, and a dancing caterpillar of a moustache. <em>Eugh</em>.</p>\n<p>Aunt May unfolds the paper, moving to put it away. Peter catches a flash of the front page and his heart jumps into his throat.</p>\n<p>“ACTUALLY,” Peter shouts, starting fully upward. The sudden movement jostles his glass, and milk spills all over his pyjamas. “Ah, fudge—”</p>\n<p>“Peter,” Aunt May admonishes gently.</p>\n<p>“It’s the—the paper, can I just—”</p>\n<p>“You’ve got milk everywhere. You need to be more careful.”</p>\n<p>Still, she hands him the paper, and he snatches it up, standing up to inspect the front page. Peter stands in the middle of his room in soiled pyjamas, mouth hanging open, unbelieving. “Is this…?”</p>\n<p>“I hadn’t released you were such a big Fantastic Four fan, Peter.”</p>\n<p>“Er,” he says, looking up at his suspicious Aunt. “I think they’re cool?”</p>\n<p>She laughs at his bewildered, half-guilty look, and says, “It’s fine, Peter.” Quieter, she says, “That Johnny Storm is rather handsome, I can’t blame you.” Peter ignores that.</p>\n<p>“This is…” he says, surveying the photograph splayed over the front page.</p>\n<p>“Strange, I know. I always thought everyone in the Fantastic Four but Johnny Storm were adults?”</p>\n<p>The photo on the front page is of Fantastic Four mid-battle. It’s nothing uncommon—Supers’ fights often end up on the front page of newspapers—but Peter’s eye catches on their uniforms and the contrasting tones of blues.</p>\n<p>The Fantastic Four uniform is a dark blue, while the Regulation Jacket is a horrid, powdery baby blue. The two tones clash horribly, looking worse than they had on Peter. All four of them wear the Regulation Jacket, including a visible Sue and a Johnny Storm not fire and Ben, who’s jacket looks like it was specially tailored six sizes up to fit him.</p>\n<p>Peter cannot breath; he knows how much effort it would take to wear those jackets. Johnny and Sue couldn’t have used their powers due to it, and Ben looks distinctly uncomfortable.</p>\n<p>Aunt May peers at the picture. “Mr Fantastic is greying. They all definitely look like adults.”</p>\n<p>“They are,” Peter says.</p>\n<p>“Then why…?”</p>\n<p>“Who knows?” His grip on the paper is tight, and his lips creep upward, a slowly blooming smile. They did this for him. “Who knows…”</p>\n<p> </p>\n<p> </p>\n<p>It’s still not enough.</p>\n<p>Peter thinks about putting the suit back on, but every time he tries, he catches sight of the obnoxious blue of the Regulation Jacket, smug and pristine next to his weathered suit, and he just. Can’t.</p>\n<p> </p>\n<p> </p>\n<p>Another week slips past without a Spider-Man appearance.</p>\n<p>Peter wants to go out; he misses it, and finds himself drifting off in class more, daydreaming about careening arches through the sky, air whipping past him, the swoop of his stomach during free-fall, the joy when he pulls and arches back up again…</p>\n<p>He really, really misses it.</p>\n<p>He’s not the only one missing Spider-Man. On Thursday, Peter overhears Flash talking frantically with several classmates behind him.</p>\n<p>“You don’t think something’s happened to him, do you?” Flash asks, wringing his hands. He looks like a nervous mother. “It’s not like him to stay away this long.”</p>\n<p>“He’s been missing for longer,” a shorter boy points out.</p>\n<p>Flash bites at his lip. “Maybe…”</p>\n<p>“Maybe he was <em>grounded</em>,” Sally Avrin adds from two seats over, snickering to herself. “Or he was probably too busy at middle school to bother with crime fighting.”</p>\n<p>“Shut the hell up,” Flash snaps. He has no patience for people bad-mouthing Spider-Man.</p>\n<p>“Why are you so enamoured with a child?” Sally asks.</p>\n<p>“Spider-Man’s a hero,” Flash says.</p>\n<p>“A <em>child</em>,” Sally repeats, scoffing. “New York is better off without him.”</p>\n<p>Peter sinks lower in his seat, pulling nervously at the sleeves of his hoodie.</p>\n<p>“New York is <em>suffering</em> without him,” Flash shoots back.</p>\n<p>The two classmates behind nod, the short boy piping up, “Yeah, haven’t you seen the crime rates? They’ve gone up by a lot, and the number of deaths in muggings—”</p>\n<p>Peter’s breath has caught in his throat. He sits up straighter, biting back thoughts of his gasping Uncle dying under his shaking, useless hands. Hadn’t Peter vowed to do everything he could to prevent that? To always be there, to stop that happening to other people?</p>\n<p>“—has also increased, not to mention the number of super-villains attacks.”</p>\n<p>Flash nods. “Yeah, New York <em>needs</em> Spider-Man!”</p>\n<p>Sally huffs angrily and turns away. “Whatever, enjoy fangirling over some little twerp in tights, see if I care.”</p>\n<p>The teacher marches in then and calls the class to attention, halting the class’ conversations. Peter doesn’t listen to a single thing said during the period, frozen in his seat, focussed the entire hour on breathing around the ball of guilt and anxiety swelling in his chest. First Uncle Ben, now countless New Yorkers. How many more have to die before Peter stops neglecting people who need him? Selfish, Parker. Selfish, <em>selfish</em>.</p>\n<p>“Hey, Peter?”</p>\n<p>Peter starts violently, coming back to himself to see the class beginning to file out for lunch. Flash Thompson stands beside him, looking confused at Peter’s reaction.</p>\n<p>“Um,” Peter says, shaking himself, “sorry. Er. What did you say, Flash?”</p>\n<p>“I was wondering what you thought about Spider-Man coming back,” Flash says, eyeing Peter with furrowed brows.</p>\n<p>Peter hides his hands under his desk, clenching and unclenching them into fists. “How should I know?”</p>\n<p>Flash shrugs and looks away. “Well, you used to take photos of him, right? Before Jameson turned you down for the internship?”</p>\n<p>“Well…” Peter takes a deep breath. Lets it out. “I think. I think Spider-Man’s going to come back.”</p>\n<p>“Really?” Flash asks, hopeful.</p>\n<p>Peter steels his shoulders. No more running. No more letting down the people he’s sworn to protect. Who have protected Peter in turn.</p>\n<p>“Really,” Peter promises.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>“We have a code red in progress!” Jeff ducks to avoid a thrown motorbike, one hand braced to protect his head, the other holding his comm. “Repeat, code red.”</p>\n<p>Floating above the confusion, Electro laughs, rippling with energy. Head thrown back, chest thrown forward, arms stretched out. Electricity shoots around him, cracking the pavement and sending pedestrians running screaming as the buildings around them began to crumble, lights flickering on and off sporadically.</p>\n<p>Jeff stands amongst the chaos, shouting into his comm, “Does anyone have visual on any Supers?”</p>\n<p>When he receives no response, he grits his teeth, and bites out, “<em>Repeat</em>! Does anyone have visual on Supers? Does anyone have visual on Spider-Man?”</p>\n<p>The police had quickly learned to rely on Supers out of necessity. Here, in a battlefield far above their abilities, the NYPD are out-gunned.</p>\n<p>Electro spews destruction, laughing manically, felling buildings with the barest effort. The police has been thrown in the deep end, and without the aid of Supers to keep the city afloat, they’d drown.</p>\n<p>A glob of web hits Electro in the shoulder, unbalancing him and drawing his attention. “What—!”</p>\n<p>Spider-Man flips out of the sky, landing in the middle of the destruction with a flippant, “You rang?”</p>\n<p>Jeff slumps, near boneless, against the cruiser at his back. He offers the Super a blooming smile, and greets, “Spidey! Good to have you back!”</p>\n<p>Peter offers a tiny wave, laughing easily like he hasn’t been missing for over a month. “You miss me, Jeff?”</p>\n<p>“<em>Yes</em>!”</p>\n<p>Jeff’s vehement answer must throw Spider-Man off guard, because the small Super tips his head back, eying Jeff. “Huh.”</p>\n<p>“Spider-Man!” Electro has collected himself, now flat-footed, electricity gathered in both hands. He looks pissed. “I thought you were gone for good.”</p>\n<p>Spider-Man shrugs again, far too unconcerned and casual in the middle of such chaos. “Nothing can keep me down for long.”</p>\n<p>Electro snarls, throwing a handful of sparking light at Spidey, who ducks and rolls out of the way, climbing to his feet and then into the air.</p>\n<p>The fight is fast paced, electricity and webs flying faster than the eye can catch, but it is over soon enough, Electro left wheezing against the pavement, limbs bound by webs. Spider-Man stands over him, triumphant.</p>\n<p>“Oh, <em>yeah</em>,” Spidey, the cocky shit, says. He does a little, victorious shimmy, swinging his hips, wrists held high above his head. “Who’s the spider? I’m the spider!”</p>\n<p>“You wish,” says Electro, smiling up at Spider-Man. “Your real battle has only just begun.”</p>\n<p>Spider-Man drops his wrists, straightening up. “Wow, that wasn’t ominous and cliche<em> at all.</em> What ‘real battle’? My battle to find an opponent who’s actually capable of holding their own against me? Ha!”</p>\n<p>Electro manages a cocksure smirk, bound and incapacitated as he is. “How about <em>five</em> other opponents?” he asks, eyes pointedly looking up. Spider-Man freezes.</p>\n<p>Five figures descend from the sky, landing in a wonky circle around the tense Super, surrounding him. Jeff swears under his breath, and fumbles with his comm, whispering commands for back up. They’re going to need so, so much back up. (“Call the Avengers, the Fantastic Four,” Jeff pants, voice shaky, “the—the <em>president</em>, just call someone, send—send <em>everyone</em>, shit!”)</p>\n<p>Jeff surveys the villains, recognising them—Doctor Octopus, Rhino, Sandman, Vulture. He spots Shocker freeing Electro from the binding webs and helping the other villain climb to his feet.</p>\n<p>All of them are past enemies of Spider-Man, he realises with a jolt. Oh, no.</p>\n<p>“Um,” Spider-Man says weakly. “Evening fellas?”</p>\n<p>The six super-villains remain unimpressed, looking angry and menacing. Rhino cracks his knuckles pointedly.</p>\n<p>“Taking a leaf out of the Avengers book with the whole team-up thing, huh?” Spidey babbles. “I have to say, team of super-villains, that’s actually pretty smart. Terrifying—like for real, oh my god, holy cannoli, I definitely peed a little—but <em>smart</em>. Kudos, guys. Do you have a super-cool super-villain name, yet?”</p>\n<p>“The Sinster Six,” Sandman says proudly.</p>\n<p>Spidey claps, nodding his head. “Hey, I like that! Good work, guys. You got the man-power, you got the cool name, now all you need is some skill to actually defeat me.”</p>\n<p>A growl ripples through the villains. Rhino ducks his head, rolling his shoulders in preparation. “You little twerp,” Rhino rumbles. “I’m gonna destroy you.”</p>\n<p>Doctor Ock smiles, something wicked sharp and promising. “No, Rhino. <em>We</em> will crush him.”</p>\n<p>Spidey glances around at the six villains, stretching their arms, readying themselves to charge, to attack, and swallows audibly.</p>\n<p>“Can’t we talk about this?” Spidey tries. “Sit down, maybe have some dinner—”</p>\n<p>He’s cut off as Rhino and Vulture lunge for him. He backflips into the air, swinging away. The Six follow him in a mad scramble of limbs.</p>\n<p>Jeff is forced to crouch behind a police cruiser during the ensuing fight. This is so, so far above his pay grade. He doesn’t have the abilities to handle this; he can do nothing but huddle into himself, and watch as his hero struggles against a brutal, fast paced fight.</p>\n<p>Jeff squeezes his eyes shut. Spidey’s losing, badly. The Super is going to need medical attention, the serious kind, if he even manages to worm his way out of this fight at all.</p>\n<p>“Requesting back up,” Jeff repeats into his comm. “Multiple armed, dangerous super-villains. Spider-Man is injured and outnumbered, hurry, I’m not sure how long he’ll be able to fight them off—”</p>\n<p>One of Doctor Ock’s tentacles catches Spidey around the middle, sending the underage hero into the arms of Rhino, who holds him tight, grinning as Spidey struggles wildly.</p>\n<p>“We’re gonna crush a bug!” Rhino says.</p>\n<p>Spidey coughs, trying desperately to inhale properly—choked off, breaths sounding wet with what Jeff hopes isn't blood—and attempting and failing to form a snappy reply.</p>\n<p>“I have awaited this day a long time,” Doctor Ock says, advancing on the restrained vigilante. “To see you, bound and helpless, brings me true happiness. I am so looking forward to your death.”</p>\n<p>“I want to do the honours,” Shocker pipes up. “Let me at him.”</p>\n<p>“That’s not fair, I wanted to kill the freak,” Vulture squawks.</p>\n<p>Rhino growls. “I want to!”</p>\n<p>Peter can barely keep his eyes open. His body has started to shut down from his mounting injuries and the exhaustion of fighting six super-villains at once. As his eyes shutter close, he barely makes out the blur of red and baby blue, though he clearly hears the shouted, “<em>Hey</em>! I’m the one who does the killing around here, buck-o!”</p>\n<p>Peter is dropped to the ground, and groans as his injuries are jostled. He looks up to see Rhino frozen, Deadpool bolting toward them, katana held high, bringing down his weapon in a high arch.</p>\n<p>“No killing!” Peter shouts, and Deadpool stills the blade bare inches from Rhino’s throat.</p>\n<p>“N’aww,” Deadpool whines, dropping the katana, and crossing his arms over his chest dramatically. “Mooooom, you never let me have any fun! Dad always lets me kill the bad guys!”</p>\n<p>Peter isn’t sure if Deadpool is making a joke, or alluding to someone else being the father to Peter’s mother. He hopes Deadpool doesn’t mean Daredevil. That is not an image he wants to preserve.</p>\n<p>“Oi, who the ‘ell are you?” Shocker demands, glaring at Deadpool’s sulking figure.</p>\n<p>Deadpool’s voice drops, deep and gravelly, a distorted cross between Batman and Wolverine. “Your doom,” he says, before issuing a high pitched war cry and leaping at Shocker and Rhino. Shocker shrieks, high-pitched.</p>\n<p>Peter tries to jump away from the fight, but he’s exhausted, drenched in sweat and blood, and aching all over. One of Ock’s tentacles snakes around his waist, dragging him forward to face the sneering villain.</p>\n<p>“Spider-Man,” Doc Ock spits, “you’ve acquired a friend since we last spoke, have you? No matter, it will not stop us from defeating you.”</p>\n<p>“Don’t you people have anything better to do?” Peter asks, weakly. “Seriously, doesn’t villainry get old? Get a hobby, man. Pick up knitting or something.”</p>\n<p>Ock makes an annoyed noise in the back of his throat, and the mechanical tentacle tightens, growing painful. Peter yelps and tries to wiggle in Ock’s grip to no amends.</p>\n<p>“You cannot escape us this time,” Ock says. “This time, it is your blood that—”</p>\n<p>A hammer throws Ock bodily across the street. Peter sprawls along the pavement, blinking up at the golden image Thor makes, Mjolnir in hand, his brilliant image marred only by the baby blue jacket stretched across his shoulders.</p>\n<p>“You will not harm the young hero, villain,” Thor says lowly. Peter can hear the order in his voice.</p>\n<p>Ock stumbles to his feet, gaping at the prince. “An Avenger?”</p>\n<p>Captain America jogs to stand by Thor, shield in hand, wearing his full suit, a blue jacket, and a steely expression. “Two Avengers.”</p>\n<p>Black Widow melts from the shadows. “Three.”</p>\n<p>Peter’s advanced senses allows him to hear the distant, answering, “<em>Four</em>!” It came from high above them, a lower building’s rooftop. Peter glances up to see a waving purple glove and the hint of a quiver full of arrows.</p>\n<p>“I didn’t sign up for this,” Sandman says. He transforms back into his flesh and blood form, his skin looking pale around his striped shirt.</p>\n<p>“Then you should’ve thought twice about attacking this nice young man,” Captain America says dryly, grinning.</p>\n<p>Electro shouts, angry and full of energy, and he scrambles off of the ground to lunge at Peter. His arm, outreached and glowing, is knocked away before it can make contact with Peter. Electro howls as the shield bounces away from his limb, returning back to Captain America easily.</p>\n<p>Doc Ock has already climbed back to his feet, and he ignores all the other Supers, racing toward Peter’s still hunched form, his actions mirrored by a swooping Vulture, Sandman, and Electro. Shocker aims his hands at Peter.</p>\n<p>Peter squeezes his eyes shut, bracing himself, only to hear the clash of metal, the thud of colliding flesh, and nothing coming near him. When he looks around him, he sees Thor high above, winning in a fight against Vulture. Black Widow has thrown her thighs around Shocker’s waist, and twists, throwing him against a wall in a move Peter himself has been trying to imitate. Captain America darts between Electro and Sandman, shield ricocheting around the street.</p>\n<p>Deadpool has a fistful of Ock’s hair, a katana through one of the villain’s shoulders—non-lethal, maybe, but Peter still winces at the brutality of the act. Deadpool is pulling out Ock’s tentacles, twisting and tugging until they wrench free, spraying wires and sparks, before throwing them over his shoulder and starting on the next tentacle.</p>\n<p>Rhino lays face down in the road several metres away, twitching sporadically. An electric arrow juts out from his back.</p>\n<p>Peter lies on the street, eyes wide. He aches all over, and each passing moment it grows harder to breath, but…</p>\n<p>But the Supers around him are here. Peter remembers, when he was younger, before he became a Super himself, admiring superheroes with huge, awed eyes. Peter feels that awe now, that same wonder and amazement. He feels—for the first time since he put on the suit, since Uncle Ben bleed out under his shaking hands—safe. Like maybe everything will be okay.</p>\n<p>These people are here. Fighting for him. Each wearing identical Regulation Jackets.</p>\n<p>“Aw!” Johnny Storm stands in the middle of the street, arms crossed over his own baby blue jacket, glaring at the other Supers. “No fair, I was hoping to be the knight in shining armour today.”</p>\n<p>“We came all the way out here for n’thing?” Ben asks. His Regulation Jacket is beginning to split around the seams.</p>\n<p>“Seems like it,” Sue says, leaning against Reed and sighing. The Four appear exactly like that had in the newspaper with their matching clashing-blue Regulation Jackets and and suits.</p>\n<p>“‘Torch?” Peter calls. Maybe the Six did really kill him, maybe he’s really ripping open, floundering in a public street, and this is all one big, hallucination induced by excessive blood loss. Peter wobbles on shaky feet.</p>\n<p>“Shit, Spidey!” Johnny jogs to his side, placing a hand around Peter’s back, steadying him. “Dude, are you okay?”</p>\n<p>Peter laughs at that, high and mostly hysterical, because he’s confused, he’s in in shock. Fear and the dregs of adrenaline race through his blood. “Maybe? God, just—what’s going on?”</p>\n<p>Johnny grins. “Supers got to look after each other, Pete’. Who else will, otherwise?”</p>\n<p>Johnny is dragged away by the rest of the four, only to be replaced by a slightly damp Deadpool—sweat? Blood? The red suit makes it difficult to tell; Peter supposes that’s the point—running a hand over the crown of Peter’s skull and cooing over how adorable a damsel in distress Peter makes. The mercenary is chased away by an approaching Captain America giving him the evil eye.</p>\n<p>“You okay, son?” Captain America asks, offering a hand to Peter, who takes it, letting himself be hauled up.</p>\n<p>“I am now, but—” Peter glances around at the unconscious Six; at the news-crew gathering down the street, where they’re free to stand without worrying about being caught in the middle of a fight should violence break out again, interviewing the Four; at Thor and Black Widow staring blankly at a bouncing Deadpool; at the Captain, smiling gently at him. Peter blurts, “<em>Why</em>?”</p>\n<p>“Why?” Captain America repeats.</p>\n<p>“Why—why did you step in? They’re my villains, I was the one that pissed them off, and they were only after me…”</p>\n<p>The Captain smiles gently, and Peter forgets his injuries, feels warm and guarded. “Because,” he says, “you’re a Super. I’ve seen the things you do for this city, how you protect it. You deserve to be protected yourself.” Steve glances down at his own chest, where a Regulation Jacket is straining over his broad shoulders. “And it was the least we could do, after the hassle <em>these</em> caused this.”</p>\n<p>“The jackets?”</p>\n<p>“I don’t agree with them,” Steve says. “Never did. Some of the others are beginning to realise that, too.”</p>\n<p>A loud grumble and the panicked cries of the journalists down the street catch their attention. The Hulk stands by Thor and breathes through his nose, glaring at the Asgardian.</p>\n<p>“You missed a mighty battle,” Thor says, grinning. “Not that it matters. I was there, and so everything was well.”</p>\n<p>“Thor—” Hulk begins.</p>\n<p>Steve sighs and calls the Hulk over before Thor can egg the larger Avenger into a fistfight. The Hulk comes eagerly when he spies Peter.</p>\n<p>“Spider,” Hulk says. He doesn’t seem happy to see patches of blood smudging Peter’s suit.</p>\n<p>Peter opens his mouth, a greeting on his lips, but the Captain cuts him off. “He’s here,” Steve says, and Peter freezes.</p>\n<p>A golden and red suit lands in the middle of the street with a whine of engines. Iron Man approaches Peter, and he feels something seize in his throat. Apprehension, maybe. Panic. The knowledge that nothing good happens to him—and, Peter has learned, that if it does, he doesn’t deserve to hold onto it—and so the universe has come to right itself, take away what little hope the Supers had restored in Peter tonight.</p>\n<p>“Hey, big guy,” Iron Man says to the Hulk. “Want to give me and bug-boy here some privacy?” The Hulk huffs a displeased breath. “Pleasssse? Come on, five minutes?”</p>\n<p>The Hulk grumbles under his breath, but lets the Captain come forward and guide him away. Peter knows most people are terrified of the Hulk. He makes people feel unsafe, with his temper and large bulk, but as Peter watches the Hulk go, he feels a growing sense of unease.</p>\n<p>When they’re finally alone, Iron Man addresses Peter; “I see the calvary arrived in time.”</p>\n<p>Peter nods, a stilted, jerky movement. “Surprisingly, yeah.”</p>\n<p>“Yeah, well…” Iron Man shifts, as best one can in a heavy mechanical suit. “I’m glad you’re okay. It would suck if you were vulnerable because of those damn jackets.”</p>\n<p>“Does this mean you’re not going to hunt me down if I don’t wear one?”</p>\n<p>“What? No, no, of course not, we’re all wearing them, so.”</p>\n<p>Peter stares at Tony expectantly, awaiting an explanation. When Tony fails to present one, he presses, “So?”</p>\n<p>“‘So?’” Iron Man gestures at the Supers around them, some supervising the arrest and transport of the Six, the others chatting with each other or, in Johnny’s case, the press. All of them still wore their Regulation Jackets. “<em>So</em>, everyone’s wearing the jackets. The kids, the adults, the—Deadpools.”</p>\n<p>Peter continues to stare. “….So?”</p>\n<p>“<em>Sooo</em>, you can’t tell who the underage Supers are if everyone’s wearing the jackets, can you?”</p>\n<p>Iron Man’s suit begins to come apart. First, the helmet falls back to reveal a soft eyed Tony Stark, then the suit’s middle rips open, revealing a pastel blue jacket hidden beneath the layers of metal, worn atop a band t-shirt and ratty jeans.</p>\n<p>“You too?” Peter asks, barely breathing. His pulse is loud in his ears.</p>\n<p>Tony offers him a small smile. “Yeah. Me too.”</p>\n<p>Peter lifts shaking fingers to the zipper of his own Regulation Jacket, hardly daring to hope. After all the hurt this thing had caused, the isolation, the desperation, could Peter really just—</p>\n<p>“Go ahead,” Tony urges.</p>\n<p>—take it off.</p>\n<p>The jacket unzips easily, and Peter throws it across the street, letting it land on the damp pavement metres away.</p>\n<p>Tony cups his hands around his mouth. “Hey, Hulk!” he shouts, waiting for the Hulk to raise his head and look at them. “Yeah, buddy, you see that blue thing?” Hulk points at the scrap of baby blue, formerly Peter’s, sitting abandoned in the street. Tony grins. “Yeah, that. Feel like destroying it for us?”</p>\n<p>Hulk smiles eagerly. “Hulk smash?”</p>\n<p>“Hulk smash.”</p>\n<p>Hulk pounds a meaty fist over the jacket, cracking the concrete around it, before lifting the jacket, an end in each hand, and tearing it brutally down the middle. Tatters of blue cloth rain down around him.</p>\n<p>“Spidey?” Tony murmurs. Both of them are focussed on the grinning Hulk, neither of them looking at each other. “I’m… I’m sorry.”</p>\n<p>Peter forgives him.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>The New York papers feature a brightly coloured montage of Supers the next day. Peter refuses to look at any of them, too busy being wrapped in bandages in the Baxter Building, but if he did, he wouldn’t have been disappointed at the headlines.</p>\n<p>\n<em>SPIDER-MAN DEFENDED. THE BIRTH AND DEATH OF THE SINISTER SIX. SUPERHUMAN ALLIANCES. THE LEGITIMACY OF THE REGULATION JACKETS; ARE THEY REALLY NECESSARY?</em>\n</p>\n<p>A week later, Peter finds a newspaper that Aunt May strangely left out on the kitchen table. He fiddles with it, tracing the cover with a long finger.</p>\n<p><em>SPIDER-MAN AND THE REGULATION JACKET,</em> the headline reads. Beneath it is the subheading in bolded black text.</p>\n<p>\n<em>…Speculation says Spider-Man isn't underage after all.</em>\n</p>\n<p>Huh.</p>\n<p> </p>\n<p>.</p>"
}