{
  "id": "43117",
  "url": "https://archiveofourown.org/works/43117?view_full_work=true",
  "author": [
    "bigmamag"
  ],
  "title": "The Truth Is You",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Merlin (BBC)"
  ],
  "relationships": [
    "Arthur/Merlin"
  ],
  "characters": [],
  "additional_tags": [
    "Romance",
    "First Time",
    "Season/Series 01",
    "Truth Spells",
    "Magic Revealed"
  ],
  "language": "English",
  "series": "",
  "published": "2010-01-01",
  "completed": null,
  "words": "8,957",
  "chapters": "1/1",
  "comments": "178",
  "kudos": "27,609",
  "bookmarks": "3,142",
  "hits": "256,986",
  "summary": "<p>Arthur lies to a sorceress and gets slapped with a truth spell. Awkwardness ensues.</p>",
  "notes": "<p><a href=\"http://randhforever.livejournal.com\" rel=\"nofollow\">randhforever</a> chided me and made me keep writing, <a href=\"http://pasty_pants.livejournal.com\" rel=\"nofollow\">pasty_pants</a> got my lame ass to learn google docs and squeed like a squeeing thing, and <a href=\"http://emocezi.livejournal.com\" rel=\"nofollow\">emocezi</a> pitched in her two cents as well.</p>",
  "text": "<p>The Lady Angora was stroking her dinner fork as she went on and on about how lovely Camelot was in spring, and Arthur was at a juncture so desperate that he fleetingly contemplated impaling himself on said fork. The feast to celebrate yet another treaty with yet another kingdom that Arthur was having a difficult time remembering the name of was dwindling down. The candles lighting the banquet hall were stuttering sleepily in their brackets. His father was discussing some serious matter in the corner of the room, his earlier joviality gone for the evening. Arthur had sent Merlin away at least an hour ago, intending on following him right away, but Lady Angora had slipped into the seat next to him and good grief, did she know his number. It would be rude to excuse himself from a conversation with a royal guest.</p>\n<p>He would usually resolve these situations by yawning loudly to hint that it was getting late, but after several polite yawns and then one extremely large yawn that strained his mouth, she was still going on and on, convinced that he was as enamored with her as she was with him. He couldn’t even be entirely angry with her, because he <em>had</em> been interested in her until about an hour ago, right until this wretched conversation. He had talked with her most of the evening; one would imagine that this was good enough for any woman. But now it was late and Merlin had probably wandered off to his own rooms and Arthur hadn’t gotten the chance to properly make fun of that silly hat all evening and now he would have to put himself to bed and bathe in tepid water. It was time for drastic measures.</p>\n<p>Arthur was used to lying to women. It was an unsavory trait, granted, but it was also a survival tactic. Every noblewoman eligible for betrothal had tried their very best to seduce Arthur ever since he was old enough to know what sex was (and even younger than that, dear <em>god</em>.) To avoid their attentions and escape unscathed, Arthur had come up with many lies that were not wholly lies. Arthur had learned long ago from his father that the best lies were the ones that held half truths. He therefore hatched an escape plan.</p>\n<p>“Lady Angora, it pleases me that you enjoy Camelot,” he began, and he <em>was </em>pleased; Camelot was his heart. Lady Angora beamed, most likely picturing herself as queen of the castle at that very moment. He was sure that most noblewomen, despite what Morgana said, had their very own Camelot castle doll houses and had dreamt of marrying him since they were still wearing pigtails. “If you would like, we could perhaps go early tomorrow and I can take you on a tour of the immediate countryside.”</p>\n<p>“That would be most gracious of you, Sire. We must turn in early, then.”</p>\n<p>“Quite right,” Arthur agreed, slyly kissing her hand as he rose from the table. Tomorrow morning he had training with two new knights and his father had only informed him a few hours ago. He would simply go to practice and then apologize to her that afternoon, when she was scheduled to leave. After all, training was one of his royal duties and nothing comes before that. Or at least, not traditionally, but she did not need to know that detail.</p>\n<p>When he arrived at his chamber, Merlin was still there, having fallen asleep in a chair by the fire. By the time he woke Merlin, teased him about the hat, talked him out of destroying the hat as he held it threateningly over the fireplace, and then bullied Merlin into fetching him more firewood, Arthur was entirely pleased with his brilliance and how lovely his life was at the moment.</p>\n<p>*</p>\n<p>The next day he went to training and had a roaring good time with his fellow knights. It was less practice than it was a chance to share sordid stories about last night’s banquet and when Arthur came across Lady Angora in the hall afterwards, he was still in a jovial mood and was fully planning on speaking to her good naturedly about her next visit. He slowed his steps, however, when he saw that she wore a stony expression. Oh right, he lied about this morning.</p>\n<p>“I am terribly sorry, my lady. My father sprung practice on the knights at an early hour this morning.”</p>\n<p>Lady Angora, unnervingly, said not a word. Instead, she shook her head slightly, like she felt <em>sorry</em> for him, turned around, and left. Well, if she was going to get in a tizzy about this, that was her right and not his problem.</p>\n<p>He was a bit chagrined to find out that his father had invited his guests to stay for a few more days, but at least he knew that even if he <em>had </em>been rude, he at least wasn’t going to have to endure any more lengthy conversations from Lady Angora. He was cheered by this thought all through supper and into the evening. Merlin was late coming to his bedchambers, but Arthur was in so good a mood that all he said was a derisive, “Must be nice to have a job where you can come and go as you please, I’m sure all the servants in the castle do <em>their</em> jobs whenever they like” and began sharing some of the sordid stories that the knights had told him this morning, enjoying the way the tips of Merlin’s ears would redden.</p>\n<p>“When should I come back in the morning?” Merlin asked as Arthur pulled back his bedcovers to lie down for the night.</p>\n<p>“At first light,” Arthur answered.</p>\n<p>“Why must I <em>always</em> be here so early in the morning?”</p>\n<p>“Because you make rising at an ungodly hour more bearable,” Arthur said without thinking. Merlin smiled in an insidiously happy way, and Arthur scowled because Merlin clearly had misunderstood him and he needed to qualify. “Though you are a pitiful servant and I certainly could do better for myself.”</p>\n<p>“Could you?” Merlin asked, sort of sarcastically but still with that dead chuffed smile.</p>\n<p>“No.” Arthur was taken aback, fairly sure that he hadn’t meant to say that. He must be more tired than he thought.</p>\n<p>“Are you all right, sire?” Merlin asked, eyes narrowing in worried consideration.</p>\n<p>“I don’t know,” he answered, shakily. Merlin checked his forehead for fever and went to secure him a glass of water for the night. He only fell asleep when Merlin finished quietly doing his chores and snuffed out the candles.</p>\n<p>*</p>\n<p>When he woke the next morning, Merlin had breakfast set out for him. Arthur was so surprised and pleased that his servant was actually punctual and efficient that he only bickered a little as Merlin force-fed him a vial of a brackish liquid, care of Gaius.</p>\n<p>“Shall I muck out your stables today, my Lord?” Merlin asked, not sounding pleased at all with the thought of doing it. Arthur smiled, fully intending to string Merlin along for a while with the notion that Merlin was to clean <em>all</em> the royal stables.</p>\n<p>Instead, he said, “No. You end up smelling like them and then I don’t see you all day.” His mouth instantly halted its smiling and instead simply fell open, just as much at a loss on what to do as its owner was. Merlin, for his part, was perplexed.</p>\n<p>“I thought that not seeing me would be a plus.”</p>\n<p>Arthur rallied himself, even if he felt like panicking. “It depends on my mood. In fact, it would be highly neglectful of me to forgo my stables, especially with honored guests present. You should go muck those out, but first you need to do my laundry, polish my armor, walk my dogs, and scrub the floors.”</p>\n<p>Merlin’s confusion was replaced with thinly veiled anger and, naturally, he banged insolently out of the room. Arthur felt a bit better.</p>\n<p>*</p>\n<p>The day only got stranger. For some reason he kept letting things slip, like when Gwen had asked him if he was all right at supper. He had told her that he was annoyed that the cooks didn’t bother to peel the potatoes before mashing them. It wasn’t an overtly huge disclosure, but it was not something he would normally just speak of to a servant lest it got around to the cook and Arthur’s food was spat in or worse.</p>\n<p>He avoided Morgana like the plague, because whatever was going on with him today, he certainly didn’t want her sticking her nose into his business. He narrowly missed running into Gaius, who would probably sniff out discord in Arthur’s behavior in a matter of seconds. The last thing he needed was that <em>eyebrow</em>, stretched looming and condescending down at Arthur, inexplicably so, since Arthur has been taller than Gaius for years now. </p>\n<p>When Arthur arrived safely in his room for lunch, Merlin was on his hands and knees, scrubbing the floor, his trousers soaked because he most likely had spilled soapy water all over himself. Arthur sat and slurped at the fresh stew, enjoying a rush of dark pleasure as he watched Merlin laboring and ignoring Arthur for all he was worth.</p>\n<p>Until a servant arrived and informed him that the king wished to see him immediately. Arthur pulled Merlin up and ordered him to go as well.</p>\n<p>“But it’s going to take me forever to finish everything as it is! Why do you need me to come?”</p>\n<p>“Because I sure as hell don’t want to face my father alone today,” he blurted out angrily. His mouth snapped shut and he could feel all the blood drain from his face. Merlin almost looked <em>scared</em>.</p>\n<p>“Sire, I’m sure if you sent a servant to the king and told him you were unwell—”</p>\n<p>“I am perfectly fine and I’m <em>not unwell</em>.”</p>\n<p>“Arthur, you wouldn’t back down from facing an <em>undead knight</em>.”</p>\n<p>“I’m not intending to <em>back down. </em>Just because I don’t wish to see someone doesn’t mean that I <em>won’t.</em>”</p>\n<p>He pulled on his dirtiest pair of boots and made sure to leave dirt clods over the parts of the floor Merlin had just cleaned before leaving.</p>\n<p>*</p>\n<p>His father was in a fine mood.</p>\n<p>“You do realise that we have important guests in this castle.”</p>\n<p>“Of course.\"</p>\n<p>“And that one of them is a marriage prospect.”</p>\n<p>“If you are referring to the Lady Angora, we have spent time together.”</p>\n<p>“The Lady Angora and Lord Fabrian of Earsinys are potential allies for Camelot. A marriage between you and the Lady Angora would ensure a victory over Mercia, who are still bitter over their apparent ill treatment the last time they tried to make an alliance with Camelot.”</p>\n<p>Arthur remembered. He supposed being invited as a guest of peace in a foreign kingdom and then mistakenly having all of your party thrown into the dungeons for a couple of days would make one quite bitter. But Arthur could hardly give a damn about all that. Bayard was still a boring louse, and Arthur still suspected that he had been in alliance with the sorceress who poisoned Merlin.</p>\n<p>“I am aware as to my duty, Father.”</p>\n<p>“Then why have I heard talk of Lady Angora shutting herself in her room and not wishing to speak to anyone?”</p>\n<p>“Most likely because I lied to her, and now she’s in a right temper,” Arthur responded, crossing his arms defiantly. Uther’s eyes narrowed.</p>\n<p>“Do you not think of your duty to this kingdom?”</p>\n<p>“Always.”</p>\n<p>“Then why do you insist on treating our guests with such ill respect if your aim is to better your kingdom?”</p>\n<p>“Because I am tired of being treating like a prize cow.” Arthur bit his lip, horrified that this had come out. Uther glowered at his son, having gone quiet and dangerous, a stern lecture imminent.</p>\n<p>“Sire,” Merlin butted in, and Arthur wanted to strangle the idiot because <em>didn’t he ever learn</em>? “Arthur’s not feeling well, I think he needs to lie down for a bit—”</p>\n<p>“How dare you tell <em>me</em> what my son<em> </em>needs? Guards.” Two guards materialized and grabbed Merlin’s arms. Arthur’s mind worked fast.</p>\n<p>“Father, we have a food shortage, surely the stocks are a little too much.”</p>\n<p>“You’re right. Send him to the dungeons.” The guards whisked Merlin away, the tall wooden doors shutting with finality behind them. “And <em>you</em>,” he said, pointing a gloved finger at Arthur. “Will attend to your duties and apologize to Lady Angora.”</p>\n<p>“I’ll apologize, but let me handle my own servant.”</p>\n<p>“I can see how well your handling has worked thus far. You’re too soft on the boy.”</p>\n<p>“I’m not <em>soft</em> on anything,” Arthur said, indignant.</p>\n<p>“He’ll only be in there overnight, and you can have other servants pick up the slack. Why get in an upset over it?”</p>\n<p>“Because I hate the way you speak to him.”</p>\n<p>And as his father turned various shades of red and purple, Arthur knew that he was well and truly cursed.</p>\n<p>*</p>\n<p>The depressing upshot of it all was that his father now believed <em>Arthur</em> to have a mental affliction, thus Merlin was released because he at least had told the king the truth about Arthur needing a lie down. Arthur vindictively sent Merlin to muck out the stables, <em>handling</em> his servant properly, and then sequestered himself in his room with orders to all servants not to intrude on his privacy. Of course, this peace lasted only an hour, broken by Morgana slamming into his room, face drawn and furious like a cat who had just clawed its way out of a bathtub after being thrown in.</p>\n<p>“You are a silly little boy with absolutely no heart,” she greeted, gripping the edges of his table and leveling a glare at where he was seated.</p>\n<p>“What have I done <em>this</em> time?”</p>\n<p>“Gwen and I arrived just after dark after a lovely day in the orchard,” Morgana said, as if she was telling Arthur a wonderful fairy tale she had just heard. Then she bit out, “Imagine our surprise when we encountered Merlin in the stables, cleaning them <em>in the dark</em>.”</p>\n<p>“Well, it’s nice to know that he’s following orders for once.”</p>\n<p>Morgana looked murderous. He was glad that he hadn’t ordered dinner yet, because surely there would have been a knife in her clutches at this point. “Then I talked with him and it turns out that not only are you making him muck out your stables at night, but that you got him thrown in the dungeons earlier today.”</p>\n<p>“He got <em>himself</em> thrown in the dungeons. Besides, he was only there for about half an hour.”</p>\n<p>“Half an hour in which he was jailed with four prostitutes and three thieves, one of which tried to convince him to hide some stolen jewelry in his pants because the guards would likely not search the servant of the prince.”</p>\n<p>“If it’s any consolation, I’m sure he knew that the palace guards have no problem rustling around in his privates for stolen goods,” he assured her, standing up to avoid being talked down to like a child and drinking from his goblet.</p>\n<p>“And <em>speaking of privates</em>, he was also molested by one of the prostitutes.”</p>\n<p>“We should all be so lucky, and for free, even.”</p>\n<p>“She was fifty and had a moustache!”</p>\n<p>“Well, no such thing as a free lunch, then.”</p>\n<p>“You are a sniveling brat who wouldn’t just attend to his own health and have a lie down. Future king indeed. Can’t even stand on his own, doing whatever his daddy commands.”</p>\n<p>Arthur bristled, his fingers nearly turning white from the tight grip he had on his goblet. “It was <em>me</em> who managed to get Merlin out of the dungeons with a slap on the wrist and it was <em>Merlin</em> who couldn’t stand there and shut up in front of the king.”</p>\n<p>“He stood up for you!” she all but bellowed. “The least you could do was stand up for <em>him</em>. Do you not think of him at all?”</p>\n<p>“I think about him all the time!” he shouted, slamming his goblet back onto the table. Morgana was shocked into silence and Arthur winced, realising how that had just sounded. He ground his teeth and turned toward the window. “I told my father that I didn’t like how he treated Merlin. There, are you satisfied? Want to run off and talk more with Merlin behind my back and then come back and cast more aspersions on my character?”</p>\n<p>He waited a while, expecting her to start yelling again or worse, speak softly to him, but when he turned around to face her, she had left.</p>\n<p>*</p>\n<p>Merlin appeared some time later, smelling to high heavens and looking as if he too wanted to murder Arthur. Arthur stopped him from gathering the unfinished laundry and told him to sit despite this. Merlin did so, angry and wary.</p>\n<p>“Something’s wrong with me,” Arthur began, staring at the fire and trying not to pace as he had been doing since Morgana left.</p>\n<p>“I’ve been telling you that since I met you,” Merlin quipped, set on being insufferable all evening.</p>\n<p>“I mean, something is not right. I think I’m cursed.”</p>\n<p>Merlin’s anger and resentment took a backseat to reluctant concern. “Cursed how?”</p>\n<p>“I don’t really know. I just keep…telling the truth,” he admitted.</p>\n<p>“You have to tell the truth?”</p>\n<p>“Not all the time. I can still lie, but sometimes…I tell the truth.”</p>\n<p>“Right. That makes very little sense, Arthur,” Merlin said, though he sounded as if he was still willing to be convinced.</p>\n<p>“Things just keep slipping out, I don’t know how it works.”</p>\n<p>“Right, tell me a lie. Something obvious.”</p>\n<p>“All right. I’m a girl.”</p>\n<p>Merlin raised both eyebrows in astonishment. “You really <em>are</em> telling the truth.”</p>\n<p>Arthur glared at him.</p>\n<p>Merlin smirked and said, “You walked right into that one, mate.”</p>\n<p>“Shall I <em>prove</em> that I’m not a girl?”</p>\n<p>“If you feel that insecure, then by all means.”</p>\n<p>“Let’s try another lie. I am not the prince of Camelot.”</p>\n<p>Merlin nodded. “Definitely a lie, since the gods know that you’re a spoiled elitist brat.”</p>\n<p>Arthur gave Merlin a dangerous look. “You’re being extra insubordinate tonight.”</p>\n<p>“I think my manners got lost somewhere in all that horse shit I waded in the past hour. Anyway, so you can lie. I don’t see the cause for concern.”</p>\n<p>“I told you, sometimes I tell the truth.”</p>\n<p>“Maybe you have a mental affliction,” Merlin suggested, loftily.</p>\n<p>“First you call me a spoiled brat and now you’re insinuating that I am insane. Why did I convince my father that keeping you in prison wasn’t a wonderful idea?”</p>\n<p>Merlin fidgeted a little, turning serious. “I don’t know. Why did you?”</p>\n<p>“You didn’t deserve it.” Arthur’s eyes widened in realisation. “I tell the truth when I’m asked a question.”</p>\n<p>“Oh.” Merlin said.</p>\n<p>“Oh?”</p>\n<p>“Are you sure?”</p>\n<p>“Very sure.”</p>\n<p>Merlin smiled slowly and terrifyingly and Arthur remembered that Merlin was presumably still vexed with him. “What were you really doing last week when you told me that you were on patrol?”</p>\n<p>“I was lazing about in a meadow. Damn it, Merlin!” Merlin had the completely suicidal gall to laugh in his face. “No more questions from you!”</p>\n<p>“Have you ever worn women’s clothes?”</p>\n<p>“Yes.” Arthur felt his face heat up and Merlin looked ready to burst a blood vessel from laughing at the crown prince of Camelot. “I was eight and it was all Morgana’s fault!”</p>\n<p>Merlin eventually subsided into quiet choking giggles the longer Arthur glared at him. “I think this is the best thing that’s ever happened to me.”</p>\n<p>“You will ask no more questions.</p>\n<p>“Oh come on, I’m sure it can’t get any worse than admitting to wearing women’s clothes,” Merlin said, positively giddy. Arthur let some of his discomfort show on his face.</p>\n<p>“How would you feel if you were unable to lie? If every secret you had was in danger of being said aloud?”</p>\n<p>The laughter was gone from Merlin’s face and Arthur could see that the seriousness of his situation had hit home. Arthur briefly wondered what dark secrets <em>Merlin</em> could possibly hold, amusing himself with the imagined scenario of Merlin confessing that he got a rise out of being put in the stocks.</p>\n<p>“Sorry. No more questions, sire.” Arthur nodded in satisfaction, remembering for a second why he never had the heart to truly sack Merlin. “We have to see Gaius, he may be able to help.”</p>\n<p>Arthur nodded and retrieved his coat.</p>\n<p>*</p>\n<p>“This is no doubt a result of sorcery,” Gaius told them solemnly after they told him the problem. Arthur fought the desire to roll his eyes. Of course it was bloody sorcery.</p>\n<p>“Can anything be done about it?” Arthur asked, glossing over this obvious fact.</p>\n<p>“I’m afraid that this particular kind of sorcery is a spell of vengeance and only the person who cast it can tell you how to end it. There is an old tale of a counselor of a great kingdom who had this spell placed on him, forcing him to reveal all the secrets of the kingdom. Whoever ensorcelled you may be a traitor or perhaps our guests are not here for strictly diplomatic reasons.”</p>\n<p>Arthur’s attention pricked at that one and then he felt like an even bigger idiot than Merlin when he figured it out.</p>\n<p>“The Lady Angora gave me a funny look the other day.”</p>\n<p>Gaius looked doubtful. “That’s not strictly against the law, sire.”</p>\n<p>“But she shook her head at me because I had lied to get out of spending time with her.”</p>\n<p>”I always knew the prat in you would get into this kind of trouble,” Merlin piped up, shooting <em>Arthur</em> a look of long suffering. Arthur sometimes wondered if he could possibly get Merlin a manservant who was shit, so that Merlin could appreciate how wonderful Arthur was for not sacking him at the end of each day.</p>\n<p>“It wasn’t a complete lie. I <em>did</em> have to train two knights that morning.”</p>\n<p>“I can bet good money that you asked to spend time with her, knowing that you had to train in the morning so that you could get out of seeing her and still be polite.”</p>\n<p>“Merlin, do shut up.”</p>\n<p>Merlin subsided with a knowing grin and a shake of his head.</p>\n<p>“The fact remains that this is probably her form of vengeance.” Gaius said. “Perhaps the king should be informed.”</p>\n<p>“No, I’ll remedy this mess,” Arthur said, moving toward the door.</p>\n<p>“Where are you going?” Merlin asked.</p>\n<p>“Lady Angora’s rooms and <em>that was a question</em>.”</p>\n<p>“I’m sorry, but I kind of figured that it was a rhetorical question. I’m coming with you.”</p>\n<p>“No, you will stay here in case she tries anything.”</p>\n<p>“That’s why I’m coming with you!”</p>\n<p>“And how could you possibly help? Wave your arms at her? Fuss her to death?”</p>\n<p>“She’s a noblewoman and it’s late. If you go by yourself and someone sees you, they’ll tell your father and then you’ll have to tell him the truth.” Arthur grumbled only a little bit before leaving for the guest rooms, Merlin in tow.</p>\n<p>*</p>\n<p>Turns out that Arthur didn’t have to suffer the indignity of knocking on her door. They found her gazing out of a window halfway there.</p>\n<p>“Lady Angora,” Arthur announced jovially, a hint of steel underlying it.</p>\n<p>“Prince Arthur,” she said equably, turning away from the window and facing them.</p>\n<p>“We know what you did,” Merlin piped up from behind him, and Arthur forced himself not to roll his eyes. Honestly, it was like a mouse threatening a cat.</p>\n<p>“You will lift this curse or I will have your head,” Arthur commanded, drawing his sword in one smooth movement.</p>\n<p>“You are charming, aren’t you Arthur?” she asked.</p>\n<p>“I am extremely charming,” Arthur immediately responded. Merlin made a pained sound and he swore he could hear him mumble, “<em>Of course that would be the honest truth.”</em> Arthur magnanimously chose to ignore him. Lady Angora walked a bit closer, strangely calm for someone who was at the business end of a sword.</p>\n<p>“This is not a curse, Arthur Pendragon,” she intoned, and what was it with wizards doing that whole ‘I am a big bad sorcerer so kneel before me’ act? He was certain he could identify a sorcerer based on that alone. “It is a gift.”</p>\n<p>“Yes, well, you can have the gift back,”</p>\n<p>“The curse can only be lifted by you.”</p>\n<p>Great. One of <em>those</em> sorcerers. Honestly, it wasn’t like he had been killing any unicorns lately. Perhaps he had inadvertently stepped on a fairie this time.</p>\n<p>“And I suppose the next thing you’re going to tell me is that I will be tested?”</p>\n<p>“The cure is simple. People lie for many reasons. Those who lie the most have the greatest need to find truths hidden even from themselves.” She took a step closer, chest grazing the tip of Arthur’s held sword. “You could have just told me the truth, but you felt the need to lie anyway. You are a practised liar and for the curse to lift, you will need to discover what it is that you lie about the most. Even to yourself.”</p>\n<p>Arthur just couldn’t believe how insane sorcerers were. “What kind of stupid curse is that? How am I to know what I lie about the most?”</p>\n<p>“That is for you alone to discover.\"</p>\n<p>Arthur narrowed his eyes. “You aren’t actually related to anyone called Anhora, are you?”</p>\n<p>She shook her head in confusion, and he shouldered more humiliation as he heard Merlin stifle a snigger.</p>\n<p>“You may as well put the sword down. You won’t kill me, will you?”</p>\n<p>“No,” he hissed, sheathing his sword irritably. Fucking truth spells. “But rest assured that I won’t hesitate if I find that you escape this castle before the spell is lifted. I would never trust the word of a sorcerer.”</p>\n<p>She raised an eyebrow, and he wondered if he shouldn’t just have her executed out of spite. “You’ve got a lot to think about. I’ll retire for the night.”</p>\n<p>*</p>\n<p>When Arthur returned to his chambers, he placed his hands on either end of the fireplace and leaned against it.</p>\n<p>“This might not be too difficult,” Merlin said lightly, and Arthur heard the clatter of Merlin collecting his dishes.</p>\n<p>“What are you blithering on about?”</p>\n<p>“Well, you have to tell the truth. All you have to do is have someone ask you what your biggest lie is.”</p>\n<p>Arthur raised his head a little, grudgingly impressed. Merlin, when not being a complete idiot, was sometimes quite clever. Not that he’d tell Merlin that unless he was about to drink poison and die.</p>\n<p>“The only problem is, I have to be asked.”</p>\n<p>“…right,” Merlin drawled, like Arthur really did have a mental affliction.</p>\n<p>Arthur matched his tone. “Meaning that whoever asks will know my greatest lie. Think of the hold they would have over me.”</p>\n<p>Merlin twigged on, frowning deeply. “Well, who do you trust? There’s Morgana, you’ve known each other forever.”</p>\n<p>“And give that brazen hussy possibly asinine information with which to torment me?”</p>\n<p>“Well, Gwen would keep your secret,” Merlin next suggested. Arthur hesitated on that one, because while it was true that Guinevere would keep his secret, he felt highly uncomfortable with the idea of it. Guinevere represented the people of Camelot, and he couldn’t stomach the possibility of disappointing his people.</p>\n<p>“No,” he said.</p>\n<p>“Okay then, Gaius. He’s a physician, he’s sworn to secrecy and the king trusts him.”</p>\n<p>“Merlin, just ask me.”</p>\n<p>“Me?” Merlin asked, sounding shocked.</p>\n<p>“Yes. As my manservant, you have to keep my confidences. In addition, you <em>have</em> proven to be loyal.” He didn’t say, <em>I trust you</em>. Merlin seemed to hear it anyway, and was looking at Arthur with a decidedly soppy expression that Arthur wanted gone this instant. “Ask and get it over with.”</p>\n<p>“All right,” Merlin said walking over to Arthur and standing in front of him, a serious look on his face. “Arthur, what is your biggest secret?”</p>\n<p>“I don’t know.” Arthur scowled. “I suppose it’s not as simple as it looks.”</p>\n<p>Five days passed with no change in Arthur’s condition. Arthur managed to shirk most of his duties by a stroke of luck. To keep Lady Angora close by in case he really did have to execute her, he had formally requested that the guests stay longer, pleasing his father to no end. No doubt his father and Lord Whatever-His-Name-Was were too busy drawing up marriage contracts to really pay that much attention to what Arthur was really doing.</p>\n<p>Currently, Arthur was lying prone on his bed, a cool rag against his forehead to ease the headache there. He had never thought so much in such a short span of time. Arthur had never, in fact, been much of a thinker. He preferred action, the kind of action seen in battle, no time for thoughts. He prized this trait in his knights, the ability to separate the mind and to fight on pure instinct. He had learned over the years the need for thought in diplomacy and grave matters, but he never enjoyed it or relished it.</p>\n<p>Now he was worn, dead tired of going through memories, agitating old wounds, and rifling through deeply repressed thoughts that he carefully pushed to the back of his mind. Like the matter of marriage and how it would feel, being bonded to someone he barely knew, not loving them. He thought of his mother, who he might be today if she had lived. He had even, in his most Herculean effort yet, disassembled his relationship with his father and unfurled years upon years of repressed anger, resentment, humiliation, and shame. After several hours of <em>that</em>, he had called for a meal, hoping that this had been enough. A serving girl came in and asked if there was anything else, and he told her that he wanted to see Merlin instead of telling her nothing else was required. She curtseyed and left, and Arthur fell back onto his bed, cold compress on his forehead, miserable and wondering why the hell he wanted to see Merlin. He had thought about his manservant enough on day two of his seclusion. Then again, putting Merlin in his place was always a wonderful stress reliever and required very little thought. His subconscious was obviously seeking means to repair its fragile state.</p>\n<p>Merlin came in soon after, wearing an old shift that had only dreamed of being white and breeches, most likely having been woken up to come here. His hair was rumpled and he was blinking blearily, movements lethargic.</p>\n<p>“You wanted to see me?”</p>\n<p>“Yes,” Arthur said, taking the rag off his forehead and holding it out. “Dip this in that bucket and send someone to the icehouse.”</p>\n<p>Merlin scowled, taking the rag. “Arthur, it’s late and it would be unfair to get someone to go all the way to the river in the dark, walk down into the bowels of the icehouse, and gather some ice for your big spoiled head.”</p>\n<p>“I should make you do it,” Arthur responded, groaning as Merlin took the rag and Arthur drug his outstretched hand in to clutch at his pounding skull.</p>\n<p>“Careful,” Merlin warned in amusement, “In the state you’re in, I just might be able to beat you in a fight.</p>\n<p>Arthur scoffed. “I could have both my arms and legs lobbed off and you’d <em>still</em> be useless in a fight.”</p>\n<p>Merlin hummed noncommittally, obviously too sleepy to bicker too much, and placed the newly cooled rag on Arthur’s forehead. Arthur moaned a little in relief and lay prone on the bed, all the world’s suffering on his shoulders. Merlin began to pull Arthur’s boots off and dug under him to retrieve the bed linens. He watched Merlin pull the covers up and essentially tuck Arthur in with great amusement.</p>\n<p>“We’ll find a way out of this,” Merlin said, an earnest promise in his voice. Merlin was leaning over Arthur, the laces undone on his night shift, neck reflecting the light of the fire.</p>\n<p>“We’d better. I have to see my father in the morning. There are matters I need to attend to, even if he fully believes that I am currently dizzy for the Lady Angora.”</p>\n<p>“Well you certainly have an addled mind because of her,” Merlin said equably, straightening and moving toward the door. “Just rest tonight, sire. You’ll need it.”</p>\n<p>*</p>\n<p>Arthur had never wanted to be anywhere else so much in his entire life. He’d gladly battle some magical beast than to have to endure his father, who was in a cold rage about something this morning.</p>\n<p>“I have heard from various sources that you have sequestered yourself in your chambers for the past several days and that the Lady Angora has not left hers in that same time.”</p>\n<p>“I thought it would be better if we were seen to be more prudent in our exchanges.”</p>\n<p>“This from my son, who would have <em>married</em> the Lady Sophia if I had not forbidden it directly.”</p>\n<p>Arthur winced. As if he constantly needed reminding of <em>that</em> debacle<em>. </em>He hardly remembered a thing from it, and he had already spent three hours thinking about it yesterday.</p>\n<p>“Therefore I have chosen a wiser course of action this time around.”</p>\n<p>Uther glared at him. “You will tell me the meaning behind all of this. Now.”</p>\n<p>Arthur had never in his life been so glad that his father tended to order him around rather than just ask nicely.</p>\n<p>“It is just as I’ve said. We spend about a half hour a day together to keep modest appearances. I want her to stay longer.”</p>\n<p>“She will be leaving tomorrow.”</p>\n<p>“Father, you can’t do that,” Arthur said, alarmed.</p>\n<p>Uther leaned threateningly over the main dining table. “It is clear that you have no active interest in the girl. Why is it so imperative that this girl, who you so clearly are not enamoured with, stay in Camelot?”</p>\n<p>Fuck. “She’s a sorceress and she has placed a spell on me. She must stay so I can be sure that I’m cured.”</p>\n<p>Uther turned a shade of red the likes of which Camelot itself had never seen. “If this is the truth, you have been hiding a known practitioner of magic from justice.”</p>\n<p>“It’s not like it’s an evil spell, and I brought some of it upon myself.”</p>\n<p>“What is this spell?”</p>\n<p>“I’m forced to tell the truth.” Arthur closed his eyes for a couple of seconds, a deep knot of dread filling his chest. His father didn’t say a word to this.</p>\n<p>“Guards, seize the Lady Angora. She is accused of sorcery.”<em></em></p>\n<p>*</p>\n<p>Lady Angora was to be burned at dawn. Arthur drank deeply from his goblet, systematically attempting to get as drunk as possible. Merlin was pacing before the fireplace, face stricken.</p>\n<p>“Would you stop <em>pacing</em>?” Arthur bit out, gently massaging his pounding right temple.</p>\n<p>Merlin stopped and turned toward him, resolute. “This isn’t right.”</p>\n<p>He sighed heavily. “She’s a sorceress who cast a hex on the crown prince. Her motivations were selfish and petty and could have insurmountable consequences for the kingdom. My father has executed sorcerers for much less.”</p>\n<p>“I know that, but I visited her in the dungeon and she wouldn’t stop crying. She just doesn’t like being lied to. Her father always lies to her about things and when you did it to her, she was understandably upset.”</p>\n<p>“Understandably?” Arthur plunked his goblet back on the table, moving around it to face Merlin. “She cursed me and <em>you’re</em> defending her!”</p>\n<p>“She never meant for this to happen! She thought that you would have cured yourself in less than day. The spell won’t end with her death.”</p>\n<p>“And how would you know that Merlin? Because <em>she </em>told you?” Merlin went quiet. Arthur nodded, because of course she did and Merlin, the gullible little idiot, had swallowed it all up. “As I’ve told you before; never trust the word of a sorcerer.”</p>\n<p>Merlin stood still for several seconds, and Arthur watched Merlin’s face harden in resolve. “Do you trust me, Arthur?”</p>\n<p>“Yes,” Arthur immediately answered. Then he glared at Merlin for making him answer that.</p>\n<p>“But you <em>don’t</em> trust the word of a sorcerer?”</p>\n<p>“Never,” he answered, pleased that this was clear, but still glaring at Merlin.</p>\n<p>“What would you do if <em>I</em> was a sorcerer?”</p>\n<p>“I don’t know,” he answered, frowning because that wasn’t right. “That’s a stupid question because you obviously aren’t one.”</p>\n<p>“But I am.”</p>\n<p>Arthur rolled his eyes. “Not <em>this</em> again. Really, pretending to be a sorcerer to save Gwen is understandable, but one sob story and you’re willing to put your life on the line? I’m fairly sure I can get my father to execute her on a chopping block instead of in a fire…”</p>\n<p>“Arthur, <em>stop</em>.” Arthur startled as Merlin whispered something and his eyes seemed to flash gold, but that couldn’t be right. He startled when he saw that the goblet he had been drinking from earlier was hovering at eye level between them. Arthur stood frozen, disbelieving. Then a rage as he had never known swept through him, and all he could think was <em>liar</em>.</p>\n<p>“I should have you burned right beside her!” he snarled, knocking the goblet out of the air. Merlin’s face instantly filled with so much pain and hurt that Arthur couldn’t look at it, couldn’t handle this.</p>\n<p>“Arthur, I’m sorry…”</p>\n<p>“I <em>trusted you</em>, and you took advantage of it. You’ve been lying to me since the day we met. What in all the heavens do you have to say to defend yourself?”</p>\n<p>Arthur wasn’t looking directly at Merlin, but he could see the slump of his shoulders and the edge of his anguished jaw.</p>\n<p>“You said that you couldn’t trust a sorcerer, but you trust me and I’m a sorcerer.”</p>\n<p>Arthur’s eyes snapped back to Merlin’s face. “Ask me again if I trust you.”</p>\n<p>“No. I know you don’t, not now. But I trust <em>you</em>. That’s why I’m telling you.”</p>\n<p>“You’re telling me now to manipulate me, to try to get me to change my mind about the Lady Angora. If you trusted me, you would have told me the truth back in Ealdor, instead of letting Will lie for you.”</p>\n<p>Merlin bristled, as if he had any right to be offended. “My best friend died and as we burned his body, all you could do was warn me against sorcerers like him. Sure he died saving you, but that only let <em>me</em> get away with hiding a sorcerer from you. I’ve saved your life over and over again, just like Will, and I’m a sorcerer.”</p>\n<p>That angered Arthur at the same time that it broke something he didn’t know he had inside. “Obviously you only saved my life because it would save your own hide, then. It makes logical sense why you would do it. If the truth were ever found out about you, I would be indebted to you. That’s it, isn’t it? That first time you saved my life you didn’t even <em>like</em> me. You did it to earn a reward.”</p>\n<p>“It’s true, I didn’t like you, but I wasn’t going to let you <em>die</em>. I didn’t even know one gave rewards for saving you. You get yourself into so much danger that the most anyone can expect is a fruit basket.”</p>\n<p>“And how many times was it because of magic that my life was in danger?”</p>\n<p>“Magic is neither good nor bad. I don’t use my magic that way.”</p>\n<p>“Oh, so I’m to openly trust that you have never used it to your own advantage? Never once used it to finish chores? I <em>knew</em> my armour was too polished to have been done by a country bumpkin like yourself his first day on the job.”</p>\n<p>“And shiny armour is evil now, is it?”</p>\n<p>Arthur’s jaw tightened, having enough of this. “You know the penalty for sorcery. Can you give me one good reason, besides saving my life for your own advantage, why I shouldn’t have you executed?”</p>\n<p>“The questing beast,” Merlin said, lowering his eyes.</p>\n<p>“So you killed it with magic, as I’m sure you did with the griffin as well. If that’s the best you can do…”</p>\n<p>“When you were bit by the questing beast, you were going to die. There was no cure for it, except one. To save one life, another life must be given to keep the balance of nature. Only a powerful sorcerer could do the trade. I traveled to the Isle of the Blessed and gave my life for yours.”</p>\n<p>Arthur stared. “That can’t be true. You’re still here, how would you have gotten out of it?”</p>\n<p>“I was tricked. Nimueh tried to take my mother’s life as payment, so I planned to go back and <em>make</em> her take me. Gaius went before me to give his life, and he nearly did. I killed Nimueh.”</p>\n<p>A cold chill ran down Arthur’s spine. “<em>You</em> killed a powerful sorceress? You?”</p>\n<p>Merlin gave him a wry smile. “I do have some natural talents, you know.”</p>\n<p>“You were saying goodbye to me,” Arthur said, remembering. “The day I began to walk around again after waking up from the fever.”</p>\n<p>“Yes.”</p>\n<p>“You couldn’t have told me you were a sorcerer even then, when you knew you were going to die?”</p>\n<p>Merlin bowed his head, thinking. “I suppose I didn’t want you to remember me like that. I wanted you to remember me as your friend.”</p>\n<p>Arthur stood there, letting it all sink in. He wanted to puzzle over the decision of what to do with Merlin now, but all he could think of was what would have happened if Merlin had indeed given his life that day, Arthur never knowing what he did for him. How long would it have taken him to find out? How would Arthur have felt when they brought in Merlin’s body? In all likelihood, there wouldn’t <em>be</em> a body and Arthur would believe Merlin to be missing. How long would Arthur wait before replacing his manservant? How long before his memory would fade?</p>\n<p>“I know I’m a sorcerer,” Merlin began, and Arthur felt another rush of anger from just hearing the words. “And my word doesn’t count for anything. And I would lie to you, but never about what matters. I only lied because I was scared, and it just got harder and harder the longer I waited. But I couldn’t let Lady Angora die when I could do something about it. I would have magicked Gwen from the pyre in front of the king if I had to. I would rather die an agonizing death than to see you die. Sometimes it scares me, what I would do to see you live. If that isn’t answer enough to any question you have of me, then I’ll gladly walk into the fire myself.”</p>\n<p>There was nothing for it; Arthur turned away, breathing harshly, hearing the pounding of his own heart. Arthur was weak. He was being manipulated again. His father warned him of sorcerers, that they bear no sign of the mark. There is no sense of evil. If ever there was an enchanter who fit this description, it was Merlin. Merlin who had made an idiot of him, had sailed below Arthur’s notice, had known how to get Arthur to trust him and care about him.</p>\n<p>“You <em>certainly</em> know what to say to make a fool of me,” Arthur drawled, turning back to Merlin, forcing himself to see the revealed sorcerer behind the mask of his friend. He wouldn’t appear. “You are banished from here. You must leave this place.”</p>\n<p>Merlin, the daft idiot, <em>shook his head</em>. “I won’t leave.”</p>\n<p>“Most would be pleased that I extended that much lenience. Do you <em>want</em> to be executed?”</p>\n<p>“I won’t leave you. You need me.”</p>\n<p>“How arrogant of you. I’d say I didn’t know you had it in you, but I don’t know <em>what</em> you are anymore.”</p>\n<p>“You need me. And I need <em>you</em>. I was born like this, born with magic, and all my life I have seen it as a burden and something to be ashamed of. But coming here, and protecting you, it has given it <em>meaning</em>. It’s like I was born this way for a reason, for a destiny. By asking me to leave here, you’re asking me to take away the only thing that gave my life meaning.”</p>\n<p>Arthur, enraged, took Merlin by the shoulders and shook him, despite knowing that Merlin could easily eviscerate him with a hot poker.</p>\n<p>“Find another destiny!” he yelled into Merlin’s face. Merlin gripped Arthur’s upper arms tightly, less like he was trying to fight than he was trying to keep himself from falling off a cliff face.</p>\n<p>“Arthur, just <em>listen to me..</em>.”</p>\n<p>“I won’t watch you die!” Arthur blanched at his words the same time as Merlin gasped and flushed from them. Then Merlin did the unthinkable, and leaned forward and caught Arthur’s mouth with his own. Arthur’s eyes fell closed and he was kissing back fiercely, anger coursing through his veins. His hands moved from their grip on Merlin’s shoulders to slide down Merlin’s back, possessive. Merlin moved his hands to Arthur’s hips and Arthur gasped into Merlin’s mouth, the kiss turning desperate. He moved one hand to grab the back of Merlin’s neck, fingers pushing into his hair, using the hold to angle Merlin’s head until the kiss impossibly deepened. It went on and on, stretching impossibly long. Arthur was shivering, a slow fire burning down his spine. As it was, he tried to block out his fears, to stop all this, but all he could imagine was Merlin screaming in agony, flames engulfing him, and Arthur knew he could never watch that happen. He would have dove into the flames himself, in front of his father and Camelot.</p>\n<p>Merlin made a small sound in the back of his throat, and Arthur felt his fingers slide minutely into his trousers. Arthur growled and backed Merlin up to the table, getting a knee between Merlin’s legs and scrabbling at his trouser lacings. Merlin broke the kiss to pant hot and wet into Arthur’s neck, unskillfully trying to undo Arthur’s pants in return. Finally, they both managed to push enough clothing aside and they moved together, resuming their kiss, moaning into each other’s mouths as their cocks slid between their bodies, the small amount of friction enough to leave them shaking and gasping. It didn’t last long. Merlin came first, crying out softly, shuddering. Arthur pulled away enough to look at Merlin, his emotions all over the place, and saw that Merlin had a huge, ridiculous, self-satisfied look on his face like he did when he put Arthur’s armor on properly or he solved the riddle of how to drink poison from a single goblet, and Arthur, surprised, began to laugh as he went over the edge.</p>\n<p>“Am I that bad?” Merlin asked, amused. Arthur kept huffing out breaths of laughter as he came down, drunkenly resting his forehead against Merlin’s. He turned serious as a minute passed and he began to think again. Sensing the change, Merlin quieted as well, his arms holding Arthur a bit tighter. Arthur drug his head from Merlin’s and looked at him, even if what he really wanted to do was manfully flee from having to face this right now, but he’d be damned if he was going to run from <em>Merlin</em>. Even if he was a big powerful sorcerer, the notion itself was too ridiculous and he’d rather be struck dead.</p>\n<p>“If I ordered you not to save her, would you do it anyway?”</p>\n<p>Merlin hesitated a moment, but then nodded firmly, a determined glint in his eye. “Would you stop me?” Merlin asked.</p>\n<p>Arthur gave it a few ticks, then grudgingly shook his head. Merlin gave him a look of surprised glee.</p>\n<p>“Arthur, the spell!” he said, smiling.</p>\n<p>“What about it?”</p>\n<p>“You didn’t answer right away. Arthur, what is your favorite type of food?”</p>\n<p>Arthur, in a daze, drug up a lie. “Porridge.”</p>\n<p>“You did it!”</p>\n<p>“Or the Lady Angora decided to lift the spell.”</p>\n<p>Merlin frowned at him, deflating. Good <em>god</em>, was Arthur really feeling sorry for wiping that joy from Merlin’s face? Apparently he was, because he pulled away, hitching up his trousers as regally as one could ever manage. Misinterpreting the action, Merlin frowned further, not so regally righting his own ruined clothing.</p>\n<p>“Well, come on then,” Arthur said, as lightly as he could manage. “Show me what you can do.”</p>\n<p>Merlin smiled <em>brilliantly</em>.</p>\n<p>*</p>\n<p>“I can’t believe how bloody simple that was,” Arthur raged as the three of them rode slowly from Camelot, the surrounding woods extremely dark from there being no moon. It was windy and Lady Angora was riding in front of him, recuperating from her near death experience, hair tickling Arthur’s nose incessantly.</p>\n<p>“What did you expect?” Merlin countered, having the gall to sound even the least bit smug.</p>\n<p>“All this time you knew that all you had to do was bat your eyelashes and keys would fly to your hands. I can’t even begin to count the number of times that would have been helpful to know.”</p>\n<p>“It’s not like I can do magic all the time like that, especially with others watching. I tend to save it for when you decide to bravely get yourself killed. I don’t know how you survived so long before I came to Camelot.</p>\n<p>“Not everyone has to rely on <em>magic</em> to get along, <em>Merlin</em>,” he scoffed, cursing as another tree branch scraped his face. “You think you can somehow summon a <em>light</em> or is that too mundane?”</p>\n<p>“That depends on if you’re admitting that you need magic right now.”</p>\n<p>“I <em>don’t need magic</em> to navigate a forest I’ve been playing in my entire life,” he announced scornfully right before he smacked into a low hanging branch. Merlin laughed delightedly and Arthur was beginning to change his mind about keeping Merlin safe.</p>\n<p>Except not for a second, and that <em>really</em> put Arthur in a bad mood.</p>\n<p>“I’ll summon a light, even if you don’t need it <em>sire</em>.” Merlin intoned a spell in a language that never stopped setting Arthur’s teeth on edge, years of hating and fearing it twisting through him. Arthur almost fell out of his saddle as a familiar blue orb of light floated a few feet in front of them, illuminating the path. Stunned speechless, Arthur looked over at Merlin, who had a matching little orb in his palm. Merlin didn’t look smug now. He looked faintly sheepish and like he had done that spell without thinking.</p>\n<p>“It was you,” Arthur said, wonder lacing his voice because he was unable to hide it. That had been the first time he had ever known that magic could be used for good.</p>\n<p>“Gaius told me. I didn’t know how I did it, as I was unconscious at the time, but he said I kept calling out for you, sensing danger, and we figured out what spell I used later.”</p>\n<p>Arthur continued to stare at Merlin as more and more pieces fit, how even if all other magic in the world was evil and dark and should be eradicated, Merlin’s magic was <em>good</em> or maybe it was all the same magic and Merlin was just one of many that used it like this. Merlin blushed a little, turning away and Arthur tried to collect himself as he realized he had probably been gazing at Merlin in a decidedly besotted way, framed by soft magical light.</p>\n<p>They reached a crossroad and Arthur dismounted and helped Lady Angora to the ground.</p>\n<p>“Will you be all right?” Merlin asked gently, handing her a bag filled with food, a change of clothes, and a bit of money.</p>\n<p>“No,” she said, quite honestly and sadly. “I can’t go home. My father has disowned me to retain the kingdom’s alliance with Camelot. But I’ll be okay, I still have my magic and I know how to weave. I can blend in at a village, change my looks a little. I just…will miss my home, family, and friends.”</p>\n<p>She looked down at the ground, radiating pain. Arthur briefly imagined having to be exiled from Camelot. It would be a fate worse than death for him. He tentatively reached up and placed a hand on her shoulder.</p>\n<p>“When I am king, you will be welcome in Camelot,” he told her. It was the first promise he would make as king and he knew that it wasn’t entirely directed toward her. He felt Merlin at his back, and hoped that Merlin understood that when he was king, Merlin would never have to fear again.</p>\n<p>She looked up again and smiled. “I shall be patiently awaiting that day, your highness. Until then, may you be well.”</p>\n<p>She walked down one of the roads, a day’s ride from the nearest village. Arthur turned to look at Merlin, and Merlin was looking at him like Arthur had just returned from hanging the moon. Arthur, for the first time, terribly and consciously wanted to kiss Merlin. He then realised that he <em>could</em>, so he did, gently and with purpose. Merlin stopped the kiss, his hands cupping Arthur’s face in an entirely girly manner that Arthur did not enjoy at all, really.</p>\n<p>“I think you’ll be a decent king, Arthur Pendragon.”</p>\n<p>Arthur scowled. “<em>Decent</em>? If I ever manage to get you to behave like a decent manservant for a single day, I’ll become a legend.”</p>"
}