{
  "id": "43212999",
  "url": "https://archiveofourown.org/works/43212999?view_full_work=true",
  "author": [
    "liverobinreaction (bugbee)"
  ],
  "title": "Banshee In A Well",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman - All Media Types",
    "Red Robin (Comics)",
    "Batman (Comics)",
    "DCU",
    "DCU (Comics)"
  ],
  "relationships": [
    "Tim Drake & Bruce Wayne",
    "Tim Drake & Jason Todd",
    "Tim Drake & Dick Grayson",
    "Tim Drake & Damian Wayne",
    "Tim Drake & Ra's al Ghul",
    "Cassandra Cain & Tim Drake",
    "Tim Drake & Prudence Wood"
  ],
  "characters": [
    "Tim Drake",
    "Batfamily Members",
    "Bruce Wayne",
    "Jason Todd",
    "Dick Grayson",
    "Damian Wayne",
    "Ra's al Ghul",
    "Alfred Pennyworth",
    "Cassandra Cain",
    "Stephanie Brown",
    "Prudence Wood"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "Tim Drake-centric",
    "Child Neglect",
    "Metahuman Tim Drake",
    "Bruce Wayne Tries to Be a Good Parent",
    "Bruce Wayne is Bad at Feelings",
    "Tim Drake Needs a Hug",
    "Suicide",
    "Suicide Attempt",
    "is it suicide if you know you'll come back to life???",
    "Resurrection",
    "It Gets Worse Before It Gets Better",
    "Good Older Sibling Dick Grayson",
    "Hurt Tim Drake",
    "Child Death",
    "Character Undeath",
    "Character Study",
    "Angst",
    "Fluff and Angst",
    "Angst with a Happy Ending",
    "Hurt/Comfort",
    "Jewish Tim Drake",
    "Unreliable Narrator",
    "Immortal Tim Drake",
    "Tim Drake's Missing Spleen",
    "Creepy Ra's al Ghul",
    "No Bashing",
    "the author loves all characters",
    "Damian Wayne is Bad at Feelings",
    "Good Sibling Jason Todd",
    "Good Sibling Damian Wayne",
    "Good Sibling Cassandra Cain",
    "Tim Drake Has Issues",
    "Tim Drake Is Deranged",
    "(AFFECTIONATE)",
    "Tim Drake has the self-preservation instincts of a wet paper bag",
    "blanket permission for art and podfics",
    "Lazarus Pit Side Effects (DCU)",
    "The unreliable narrator tag is there for a REASON",
    "Deranged Tim Drake",
    "I EXPLICITLY FORBID ANYONE FROM FEEDING MY FICS TO AI"
  ],
  "language": "English",
  "series": "Part 1 of bury the dead where they're found",
  "published": "2022-11-22",
  "completed": "2023-04-02",
  "words": "43,022",
  "chapters": "5/5",
  "comments": "1,314",
  "kudos": "15,012",
  "bookmarks": "4,752",
  "hits": "176,831",
  "summary": "<p>Tim is five years old when he drowns in his parents' pool. He dies quietly, waiting for parents who love him, but will never be there, to realise that something is wrong. They never show up, and he sinks into oblivion.</p>\n<p>When he wakes up and claws his way out of the water, the sun has set, and the lights of his house are on. He is cold and wet and his lungs burn.</p>\n<p>But most of all, Tim is alone.</p>\n<p>(If you die and no-one is there to see it, were you ever alive in the first place?)</p>\n<p>Here is the thing: there is something wrong with Timothy Drake.</p>\n<p><em>Trust me</em>.</p>\n<p>It’s a nice evening.</p>\n<p>It doesn’t last.</p>\n<p>Tim isn’t really sure if anyone has ever... cried over him.</p>",
  "notes": "<p>I EXPLICITLY FORBID ANYONE FROM FEEDING MY FICS TO AI.</p>\n<p>Hi hello I wrote this in a fugue state, and have most of it done. I'm not Jewish but have done my best to research specifics for this fic. Please feel free to correct me!</p>\n<p>Anyway, I've given Tim the power to come back to life. How does he have this ability? Idk his mom had a water birth near some lazarus pits or something. This will never be examined closely, at least not in this fic. As for canon, uh. I've taken the timeline and made it my own. There is no such thing as DC canon, so I have cherry picked my favourite parts like a monkey picks bugs from its sibling's fur.</p>\n<p>Enjoy, leave a comment, bookmark or kudos. Chapter title comes from 'Chelsea' by Phoebe Bridgers.</p>\n<p>EDIT: quick note; Tim is an incredibly unreliable narrator in this. If you're expecting a straightforward 'poor little meow meow Tim he's so mistreated and abused by the mean mean Bats', then this is NOT the fic for you. Nor is this bashing of any kind of any character. Do not complain in the comments about it. Thank you.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>Music Referenced:<br><a href=\"https://www.youtube.com/watch?v=rkoVWy0AjX4\" rel=\"nofollow\">Vivaldi's Violin Concerto No. 4 in F Minor, RV 297 \"Winter\" - I. Allegro non molto</a><br><a href=\"https://www.youtube.com/watch?v=LMCN-N3PTis\" rel=\"nofollow\">Vivaldi's Violin Concerto No. 2 in G Minor, RV 315 \"Summer\" - III. Presto</a><br><a href=\"https://www.youtube.com/watch?v=0jinOTQ9BaU\" rel=\"nofollow\">November by Max Richter</a><br><a href=\"https://www.youtube.com/watch?v=v0Hl0CcM-A4\" rel=\"nofollow\">Elgar's Salut d'Amour</a></p>\n<p>oh my god thank you all for the support and comments, like holy shit??? thank you all so so much, i hope you like this chapter, though it may seem a bit wonky at times. most of my batman knowledge comes from a) the 1998 YJ run, b) DC Rebirth, c) Red Robin, and d) trawling through fanfics and the wiki. bc of that, i firmly do not believe in a consistent DC canon and instead just write what i want. so yeah, if something seems inconsistent or off, it's because im making a whole ass frankenstein's monster out of the source material and my own headcanons. also my desire to make writing easier for myself.</p>\n<p>regardless, as many of you have rightly pointed out: tim is not a reliable narrator. so keep that in mind, especially towards the end. anyway, onwards to the chapter!</p>\n<p>chapter title comes from 'Neptune' by Sleeping At Last.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>hot damn i did not expect this many people to like this story. I decided to add a fourth chapter and make it a series, because i have additional Thoughts TM about this fic, and also have other ideas surrounding the premise. (one which currently in development is where tim decides the best way to get rid of insomnia is. you guessed it. killing himself. so while up in the titans tower, all alone and safe in his room, frustrated and exhausted, he decides to go with the world's shittiest melatonin and offs himself. cue jason walking in and going What The Fuck)</p>\n<p>anyway, thank you all so so much, if you enjoyed please leave a comment, bookmark and kudos, and I will be seeing you all soon.</p>\n<p>tumblr: <a href=\"https://www.tumblr.com/liverobinreaction\" rel=\"nofollow\">liverobinreaction</a></p>\n<p>Into the homestretch now!!! i am genuinely stunned by how much support and how many comments i got last chapter, like holy shit, deranged tim really hits the spot huh. well here's more of it. thank you guys so so much for your comments, you have no idea how delighted i am to see how much people enjoy this. i hope you still like this after this chapter because uh. i put the batfam through the wringer. not as badly as next chapter, but right now, these poor idiots arent talking to each other. </p>\n<p>i wrote this when i should have been writing a draft essay (due today whoops) but i genuinely could not stop writing. i go a bit more in depth into tims powers but uh. dont think too hard about it. ill explore it more in another fic. probably. we'll see. anyway, i hope you enjoy, and i preemptively apologise for this chapter. </p>\n<p>chapter title from 'Firework' by First Aid Kit.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>did tim seriously invent a device that could mess with konnors hearing just in case tim died so kon wouldnt question not hearing his heartbeat? yes. yes he did. </p>\n<p>once again, tim is not a reliable narrator. the way he understands things gets misinterpreted and distorted very easily. i absolutely love every member of the batfam, and very much Do Not Do Bashing. i find it a disservice to the characters and think it prevents an examination into why someone reacts in a specific way. </p>\n<p>dick is terrified out of his mind, and he's always been a bit petty and easily frustrated. add on the stress of being batman for almost a year, he really isnt in the proper mindset to talk to tim calmly. barbara is also at her limit, and as the other person next to tim who saw how bruce spiralled after jason, shes furious that tim would do that to them all again. bruce is clueless and thinks tim wants space, especially because hes emancipated. rest assured hes making sad longing eyes as he watches tim leave, while telling himself that he has to respect his childrens boundaries. alfred is barely holding everyone together, and needs a holiday. damian doesnt know what the fuck is going on but knows its Bad and tries to help in his weird, awful way. steph is not dealing. with what you ask? she doesn't know either. and cass is absolutely desperate and furious that she cant make the words and thoughts make sense. </p>\n<p>They Are Having A Time. And Not A Good One. </p>\n<p>anyway, an actual, in depth bruce and tim reunion will happen next chapter, along with comfort, cuddles, and pain. there will be POVs galore. i am currently crying as i realise how many other one-shots im going to have to write because there are so many other paths i wanted to explore. (tim actually running away, tim NOT CUTTING OFF HIS ARM and being trapped by Ra's, DICK ARRIVING JUST AS TIM IS STABBED, etc. fuck im never going to get my masters at this rate.)</p>\n<p>thank you all so much for reading and supporting this story, i cant believe the sheer amount of people who enjoy it. as always, leave a comment, bookmark and kudos!!!</p>\n<p>bug, i hear you say, bug, wasnt this meant to be four chapters long.</p>\n<p>no, i reply. youre imagining things. i definitely did not write more than expected about the batfam reacting to tims death. i definitely did not underestimate how much i had to say. i definitely did not lie when i said last chapter that things would be resolved.</p>\n<p>anYWAY massive thanks to Reni, Katrin, agentfancypants, Alpaca&amp;Kittens, Cassiopeia and everyone else on discord who cheered me on and yelled at me for breaking their hearts.</p>\n<p>and also an absolutely huge shoutout to <a href=\"https://uwethra.tumblr.com/\" rel=\"nofollow\">uwethra</a> who drew some <a href=\"https://www.tumblr.com/liverobinreaction/705237093805391872/hello-oh-my-god-i-love-this-so-much-the\" rel=\"nofollow\">incredible fanart of Tim getting impaled</a></p>\n<p>i promise proper resolution next chapter which WILL BE THE LAST CHAPTER I SWEAR</p>\n<p>chapter title from 'Death With Dignity' by Sufjan Stevens.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>noW LOOK BEFORE YOU KILL ME I SWEAR THINGS ARE GONNA GET BETTER THEY ARE GOING TO ALL HUG SO HARD BUT THIS CHAPTER WAS ALREADY 8K WORDS LONG</p>\n<p>next chapter is tim's pov who deals with the grief of his family learning that homeboy has died so many times, schrödinger needs a new cat.</p>\n<p>also bonus points to anyone who can guess the significance of tim's passcode</p>\n<p>as always, please leave a kudos, drop a comment and bookmark, and let me know what you think!</p>\n<p>Massive thanks to Alpaca&amp;Kittens for betaing this chapter, Cassiopeia for writing an incredible AU of this AU, James, Vee and everyone else who cheered me on in Discord, and let me tear them to shreds. A big big thank you to PearlBear, who has continued to be a dear and treasured friend.</p>\n<p>And most of all, thank you, the reader!!! I hope you enjoy. An epilogue will be posted sometime this week.</p>\n<p>Chapter title from 'Forgotten Souls' by Mother Mother</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">more notes</a>.)\n</p>\n<p>WELL. It's been a RIDE people. I have been blown away by the amount of support this story has received. I joined the fandom fairly recently (last October/November), and became gripped by so so many ideas. This was just the first one that I had to write. And it has been a journey. I've made so many friends, joined different events, and have been inundated with new ideas. It has been a delight to write this and show it to you all. Thank you so much for your support, your comments and bookmarks and follows. I genuinely hope you enjoyed this chapter, and will be posting an epilogue sometime this week. Beyond that though, I look forward to writing my next piece!</p>\n<p>In the meantime, I can be found rambling on my <a href=\"https://www.tumblr.com/liverobinreaction\" rel=\"nofollow\">tumblr</a>, or on discord. Thank you once again, and I hope to see you all soon!</p>\n<p>quick note: im not interested in constructive criticism. if there's a typo or weird sentence then that's fine, but if you would have preferred me to write a scene in a different way or dont like my characterisation/pacing/etc then just. dont comment about it.</p>\n<p>I am open to any transformative works, including art, podfics, translations, and written works inspired by my fics, as long as I am properly contacted and credited! I EXPLICITLY FORBID ANYONE FROM FEEDING MY FICS TO AI.</p>\n<p>visit me at <a href=\"https://www.tumblr.com/liverobinreaction\" rel=\"nofollow\">liverobinreaction</a> on tumblr bc i need more people to talk to about batman</p>\n<p>Music Referenced:<br><a href=\"https://www.youtube.com/watch?v=rkoVWy0AjX4\" rel=\"nofollow\">Vivaldi's Violin Concerto No. 4 in F Minor, RV 297 \"Winter\" - I. Allegro non molto</a><br><a href=\"https://www.youtube.com/watch?v=LMCN-N3PTis\" rel=\"nofollow\">Vivaldi's Violin Concerto No. 2 in G Minor, RV 315 \"Summer\" - III. Presto</a><br><a href=\"https://www.youtube.com/watch?v=0jinOTQ9BaU\" rel=\"nofollow\">November by Max Richter</a><br><a href=\"https://www.youtube.com/watch?v=v0Hl0CcM-A4\" rel=\"nofollow\">Elgar's Salut d'Amour</a></p>\n<p>EDIT: WE HAVE FANART</p>\n<p><a href=\"https://www.tumblr.com/liverobinreaction/705237093805391872/hello-oh-my-god-i-love-this-so-much-the\" rel=\"nofollow\">Bad Luck</a> by <a href=\"https://uwethra.tumblr.com/\" rel=\"nofollow\">uwethra</a> (cw for blood and the end of chapter 3)<br><a href=\"https://twitter.com/Ssybalong/status/1615207157364035584\" rel=\"nofollow\">Grief</a> by <a href=\"https://twitter.com/Ssybalong\" rel=\"nofollow\">Ssybalong</a> (cw for blood and chapter 4)<br><a href=\"https://www.tumblr.com/retro-stars/713545221905022976/my-hands-gained-a-mind-of-their-own-so-enjoy-this\" rel=\"nofollow\">Drowning</a> by <a href=\"https://retro-stars.tumblr.com/\" rel=\"nofollow\">retro-stars</a><br><a href=\"https://www.tumblr.com/rt-nique/740920720396271616/the-desire-to-art-for-banshee-in-a-well-by\" rel=\"nofollow\">Reflection</a> by <a href=\"https://www.tumblr.com/rt-nique\" rel=\"nofollow\">rt-nique</a><br></p>",
  "text": "<p>Here is the thing; Tim is no stranger to death. His parents are archaeologists and bring back pots and jewellery and bones, and he grows up listening to them talk about lost kingdoms and forgotten civilisations. In the early days, when they’re at home and not off on a dig or business trip, they take him to museums and let him look at some of their finds. His mother points out the grooves in a copper coin they found in Iran. His father lets him stroke a finger down a rib bone they brought back with them from Siberia. They teach him history, and inadvertently, death.</p>\n<p>Here is the thing; Tim knows what death is. He’s from Gotham, and sees his first fresh corpse at three years old. His nanny had meant to take him grocery shopping. They get caught up in a robbery instead. The robber is middle-aged and sweating, face pale and eyes bloodshot. He shoots the cashier for being too slow. The white tiles of the supermarket turn red, and his nanny tucks his face into her chest a second too late. A year later, he watches the Graysons fall to the ground, bodies snapping and crunching while the crowd panics. Blood splatters the floor, and their son screams louder than the crowd.</p>\n<p>Here is the thing; Tim drowns at five years old in the pool in his garden while waiting for his parents to join him. They had missed his birthday in July, and promised to spend a day with him in the summer sun as an apology. They tell him to go on ahead; that they’ll be right with him once they finish just this last task. He dives into the water and plays, not realising how close he is to the deep end until his muscles cramp suddenly.</p>\n<p>He drowns quietly, waiting for parents who love him, but will never be there, to realise that something is wrong. They never show up, and he sinks into oblivion.</p>\n<p>When he wakes up and claws his way out of the pool, the sun has set, and the lights of his house are on. He is cold and wet and his lungs burn.</p>\n<p>But most of all, Tim is alone.</p>\n<p>He drags himself inside and looks for his parents, shivering and dripping water everywhere. His father is in the living room, busy making last minute corrections to his latest journal article before sending it off. He doesn’t notice his son walking in through the patio doors. Tim continues onwards, and finds his mother in her study, trying to solve an issue with Drake Industries Japan over the phone. As he walks in, she glances up at him and frowns, eyes catching on the puddle he’s accidentally making.</p>\n<p>“Timothy,” she whispers, phone tucked to her chest, “don’t just stand there dripping, you’ll ruin the hardwood floor!”</p>\n<p>She does not mention the pool or the late time, instead lifting the phone back to her ear and pointedly gesturing at him to leave.</p>\n<p>So he goes to his room and dries himself off. His lips are blue when he looks in the mirror, and his throat burns with the lingering taste of chlorine. He coughs, and water spills out.</p>\n<p>Timothy Drake is five years old when he learns what it is like to die for the first time.</p>\n<p>In the days after, he is clingy, much to his parents’ annoyance. His mother indulges him for the first few times, propping him on her lap as she takes him through spreadsheets and emails, but after ten minutes she shifts and complains of sore legs, shooing him away to go bother his father instead. Jack takes one look at his distressed son, and grimaces.</p>\n<p>“Sorry buddy,” he says sympathetically, fingers tightening around his glass of scotch, “but I really need to finish making corrections. We can go play outside after, alright?”</p>\n<p>It is an empty promise, but Tim nods and goes back to his room. He plays his violin obsessively, stumbling through piece after piece until he can play them perfectly. He overloads his brain with notation and correct finger placement, and the memory of drowning disappears for a while. His teacher actually gives him a few words of praise for the progress he has made, and his mother nods approvingly at the news.</p>\n<p>But it isn’t enough. He gets nightmares and refuses baths, and after the third tantrum of the week, his parents snap. Janet scolds him with harsh, cutting words meant to bring Tim back in line. Jack just yells and yells. Tim is locked out of their room when he has a nightmare, and is dunked in the water at bath time despite his thrashing.</p>\n<p>He learns quickly after that. When it’s time for a bath, he proclaims he wants to start showering instead, and Jack congratulates him for being a big boy. The first night he manages to swallow down his screams, his father ruffles Tim’s hair and watches a history documentary with him, and his mother asks him to play violin for her. Absentmindedly, she mentions that she would love to see him play Vivaldi’s <em>Allegro non molto</em>, and he vows to learn it for her. Janet is surprised by his declaration, but she gives him a soft smile, and kisses his forehead.</p>\n<p>A week later, they leave.</p>\n<p>In the months following his death, when he isn’t playing violin or studying, he researches. He reads through scientific articles and watches diving videos about the nature of drowning, even though it makes the nightmares worse. But he has to know. His nanny tuts and tries to limit his screen time after the second night he wakes up screaming, but he can’t stop. He swallows down words like hypercapnia and hypoxia, and wonders if his death was just a nightmare he had after falling asleep near the pool.</p>\n<p>And then Tim slips in the shower and cracks his head open on the floor, unconscious before the pain can even hit. He wakes up hours later, blood coating the tiles just like it did at the supermarket. When he cautiously touches his scalp, there is no injury. Physically, he is fine. His head pounds and his body aches, but he is alive. The blood is still wet from the humidity of the shower, and he slowly cleans it up, eyes swimming and almost slipping again. He has to take another shower to rinse out the blood in his hair, and by the time he stumbles out of his newly cleaned bathroom, it is dark outside, just like the first time. Robotically pulling on his pyjamas, he goes to check on his nanny.</p>\n<p>She is asleep on the couch, television on and an empty glass of wine on the coffee table, unaware of the events that led to her charge cracking open his head while under her supervision.</p>\n<p>Now here is the thing; Timothy Drake is a precocious child. The word gifted and genius is thrown at him by various child psychologists, pleasing his parents to no end. He is signed up to various MENSA programmes designed for children like him, and his interests are indulged and financed by parents unconcerned with money and desperate to satisfy his never-ending curiosity, if only to stop him from bothering them instead. He is a mature child, is praised by parents and teachers alike for being so responsible, so serious, so unlike the other children. But as he huddles in his closet, trying to remember what it feels like to breathe, he is a scared child with too much information overloading his brain.</p>\n<p>It makes him shudder, and when he finally goes to sleep that night, he dreams of his head cracking open like an egg, his brains spilling out from the cavity and blocking the shower drain. In the distance, he can hear the violin playing. He lies on cold hard tiles, red-tinged water filling the bathroom up and into his lungs. Tim opens his mouth to scream, to breathe, but all that comes out is <em>Allegro non Molto</em>. In the shiny reflection of his own blood, he spots his mother standing in the doorway. She is smiling and swaying as he wails out the last notes of <em>Allegro</em>.</p>\n<p>And as the water begins to drag him back down, she turns to leave.</p>\n<p>“Wait,” he gasps out, hand outstretched, “mom, mom, <em>please</em>-!”</p>\n<p>But she just hums <em>Allegro non Molto</em> as she shuts the door and disappears.</p>\n<p>She doesn’t come back.</p>\n<p>No-one comes. No-one notices.</p>\n<p>He dies alone again and again and again, <em>Allegro</em> shrieking in the back of his mind.</p>\n<p> </p>\n<p> </p>\n<p>Tim stops trying to learn <em>Allegro non Molto </em>for a while after that, and his mother never asks after his progress when his parents pick up the phone. He tries to push all thoughts of death out of his mind by focusing on other things.</p>\n<p>However, Tim is a detective at heart, and when presented with a mystery of his own body, he has to dig further. He is perhaps, just a bit too smart for his own good. His parents send him to science camp the summer he turns six, and his head is full of words like the scientific method and hypotheses. Despite being the youngest child there, he is quickly taken under the wing of the guest scientist, a biologist called Dr Emma Gibson. She lectures him on lab safety and allows him to watch her run different experiments. She even lets him write down observations, comparing them with her own notes. When the camp is over, she ruffles his hair and tells him to look her up when he becomes a scientist.</p>\n<p>His heart is full, and despite the sadness of her leaving, Tim is confident in his budding abilities as a scientist. And so, just like Dr Gibson taught him, he begins to outline a research plan.</p>\n<p>Fact: He has died twice now.</p>\n<p>Fact: No-one has been around to see it and confirm whether he really is coming back to life.</p>\n<p>Hypothesis: He is either having severe visual hallucinations or he is a metahuman of some sort.</p>\n<p>Conclusion: Insufficient data, needs more testing.</p>\n<p>The cold, clinical words are comforting in a way, and it makes it seem like he really is a scientist doing fun experiments. It almost helps him forget that he’s his own test subject, and that the experiments will require him dying in some way.</p>\n<p>Almost.</p>\n<p>But he needs to know more. He writes down various plans, wondering how big of a sample size he needs. He spoofs his IP address just like he learned at the computer safety course he snuck into at Gotham University instead of the MENSA children’s architecture course he was originally signed up for. He researches death and the best way to achieve it, ignoring the bleating warnings begging him to call a suicide hotline. He isn’t suicidal, and he won’t be dead forever, not like his grandma or the Graysons. This is for science.</p>\n<p>Dr Gibson also said that experiments need to be peer-reviewed, but Tim isn’t really sure who he could ask. Maybe Batman? But he has a son, and Tim doubts that the caped vigilante would be willing to stand-by and watch a child die. Besides, there’s that whole thing about no metahumans.</p>\n<p>It’s unprofessional, but he decides that the situation is exceptional enough that peer-review isn’t needed.</p>\n<p>So he waits until his nanny goes to sleep, on a night when she’s drunk a little too much wine. Up in the attic, he swings a rope around a beam and ties a noose around his neck with shaking fingers. There is a note in his bedroom as a contingency. He stands up on a chair he found tucked away in the corner and trembles, trying to gather the courage to do what he has to do.</p>\n<p>But suddenly the science doesn’t seem as fun anymore. He thinks of the forums where people recounted their unsuccessful suicide attempts, how they were stuck in limbo and pain until someone either found them or they managed to crawl their way to a phone. He thinks of jetfool78’s account of hanging in his closet for what felt like hours, choking and gasping until his wife found him and pulled him free.</p>\n<p>In the end, Tim is unable to jump, and instead starts undoing the knot.</p>\n<p>Unfortunately, his sudden movement causes the rickety chair to collapse, and he chokes, fingers clawing around his throat. He doesn’t know how long he hangs there until his vision fades to black, choking and gasping as he slowly dies. Unlike jetfool78 however, there will be no rescue.</p>\n<p>And yet, he wakes up. He’s still hanging, and he can already feel his airways closing again, but this time he manages to yank his head out from the rope. He collapses to the floor with tears streaming down his face as he coughs and coughs and coughs.</p>\n<p>His watch tells him it’s 4am. He’s been up in the attic for five hours. When he staggers down to his room, hiding the rope and burning the letter, he catches his reflection in a mirror. There is a purpling bruise around his neck, and his throat aches, but it isn’t as severe as one would expect from an actual hanging victim. Instead, Tim suspects that the bruising is from after he woke up.</p>\n<p>He notes down his observations with shaking hands, the code he made up for this purpose looking unintelligible, even to his own eyes. He doesn’t sleep that night, and by the time his nanny comes in to wake him up for school, the bruising has faded.</p>\n<p>Dr Gibson would tell him that he needs to follow up, but Tim really doesn’t want to. Instead, he shoves his notebook under his bed and with a mental apology to Dr Gibson, he decides that science isn’t really for him.</p>\n<p>His decision lasts about two weeks before he conducts another experiment, alone in the mansion as his nanny has snuck out to go to a party.</p>\n<p>The housekeeper comes by, and with it, she brings an opportunity. She’s easily distractible with a few questions about her grandchildren, and he pesters her as she’s packing up her things, watching as she forgets a bottle here and some powder there. It works, and she leaves behind industrial cleaning supplies, tucked away in the kitchen but not out of reach. His research indicates a certain sort of messiness, so he lays out the tarp he had bought under the guise of taking interest in painting. There was no need to explain himself really, since his parents just wave his excuse away and give him permission to use their card.</p>\n<p>His nanny won’t be back until late, if she comes back tonight at all, and the housekeeper will be gone until Monday to take him back to school. His parents called him the day before to confirm that they would be stuck in Belize until next Thursday. With the confidence of an unsupervised child, Tim downs a mug of the nastiest chemicals he was able to mix together without creating chlorine gas.</p>\n<p>It’s a bad death.</p>\n<p>None of his deaths so far have been good exactly, but this one is the worst so far. There’s a lot more to clean after he wakes up, and even as the taste of chemicals burns his throat lining, he’s thankful for the resources he has to remove any evidence. But for weeks afterwards, the scent of lemons makes him gag and choke.</p>\n<p>He decides that his experiments are over after that death, and goes back to the violin and ballet and gymnastics. It’s safer after all, and less likely to kill him.</p>\n<p> </p>\n<p> </p>\n<p>Tim’s preference for safer hobbies lasts until he turns eight, when he gets a camera for his birthday. He watches a video of Robin doing a quadruple somersault soon after that, and figures out Batman and Robin’s identity. Before Tim even knows what he’s doing, he’s drawn up a comprehensive guide of their usual patrol routes, has tuned his ham radio to pick up the police scanner, and is sneaking out with his new camera to take pictures at night.</p>\n<p>He asks his parents to sign him up to self-defence classes and krav maga, because you never know in Gotham he explains, and they absentmindedly accept, phone crackling with static as the reception in Cameroon fades in and out. He eagerly sends them the permission slips, and a few hours later, their secretary has signed them, and he’s enrolled in various courses that will teach him how to be quick and sneaky. Granted, it’s less a method to keep himself safe, and more a way for him to keep up with the Bats as they dart across the night sky, but he enjoys it nevertheless, especially as he gets more and more used to running across rooftops and ducking into shadows.</p>\n<p>It is the most fun he has ever had.</p>\n<p>He gets shot at, is chased down alleyways, and slips off of railings more than once, but by some miracle, he never actually dies during his excursions into the Gotham night. He comes close once or twice, and yet by the time Dick Grayson graduates from being Robin into Nightwing several years later, Tim has reached ten years old without dying once during his excursions.</p>\n<p>He keeps an eye on Batman and the newly named Nightwing during his break, but he doesn’t sneak out to take pictures until the adoption of Jason Todd-Wayne is announced, especially since his parents finally decided to fire his nanny. They do not hire anyone else, but they send him to boarding school and call him two times a week, and he gets to come home on the weekends, when the housekeeper stops by to check in on him.</p>\n<p>He joins the school’s orchestra, and finally forces himself to learn <em>Allegro non Molto </em>in its entirety. His fingers are blistered messes by the end of it, despite his callouses, but the way the orchestra teacher beams at him in pride makes it all worth it. When he tells his mother, she hums, and he can picture her pleased smile.</p>\n<p>“Well done, Timothy. You’ll have to play for me when we come back. In the meantime, why don’t you learn <em>Presto</em>?”</p>\n<p>Warm from her praise, he agrees, already pencilling extra practice sessions between ballet and self-defence. He can play most of it by the time his parents return, but Janet waves off his attempts to play for her, explaining that she has a headache.</p>\n<p>They leave two days later, and Tim performs <em>Presto</em> for his orchestra teacher instead of his mother. His praise feels hollow, but it’s something at least.</p>\n<p>Tim begins to go out at night again, waiting for a glimpse of the new Robin, even though he logically knows that it will take a while for Robin to be field-ready. If nothing else, it’s a good way to keep his skills sharp. But when the new Robin does appear, Tim finds himself shaking in excitement as he watches Robin cling to Batman’s back, a grin wide on the older boy’s face. And he dives back into photography, camera clutched with trembling hands as he snaps picture after picture.</p>\n<p>Compared to Dick Grayson, the new Robin is bolder, but just as cheerful. There’s a wonder to him that Tim never quite saw with Jason’s predecessor, and as he laughs and quips and clings to Batman, Tim finds himself believing in the magic of Robin. He gets closer to the duo, taking more pictures in increasingly precarious situations.  </p>\n<p>It gets him into trouble one too many times, and eventually, not even his meagre training can save him from a bullet in his head. He crawls out of dumpsters more than once during Jason’s stint as Robin, and it’s sheer luck that no-one is ever around to see his resurrection. His notebooks get new entries however, and he realises that he’s been waking up quicker after his deaths. He spits out his fair share of bullets as he notes how fatal injuries will heal, but smaller ones won’t. If he has more than one fatal injury, the one that deals the death blow will be healed first. The other one won’t until he dies of it.</p>\n<p>He learns that the hard way after having a cerebral haemorrhage only a few seconds after waking up from the stab wound that had taken him out the first time. Injuries that start out survivable but become fatal after insufficient treatment also heal (after dying), and there are far too many close calls at school where he’s had to pass off wound infections as the flu, hoping desperately that the school’s strict sickness policy will keep anyone from entering his room until he recovers.</p>\n<p>At the very least, he thinks, Robin and Batman never see his blunders. He’s fully aware of Batman’s disdain for metas in Gotham, and he doubts his parents would be pleased if they have to move because Tim died in the wrong place at the wrong time.</p>\n<p>But as time goes on and he turns twelve, tensions begin to rise between Batman and Robin, hushed arguments ringing out against the concrete as Tim watches. There is only one public screaming match before Robin marches off. The next few weeks are quiet, despite Arkham announcing the Joker’s escape. Batman goes out a few times before disappearing, but Robin is nowhere to be found. Batgirl stops appearing as well, and the news breaks that Barbara Gordon has been attacked in her own home, shot by one of the Joker’s henchmen.</p>\n<p>And then, the Wayne family lawyers announce that Jason Todd-Wayne has tragically passed away. The official story is that he was kidnapped while on his way to meet with some friends, was held for ransom, and then killed during the process.</p>\n<p>The sighting of Robin, Batman and the Joker in Ethiopia suggests a different story.</p>\n<p>Tim has gotten used to death. He’s not comfortable with it and never will be, but it’s a song and dance he knows intimately. But he’s only used to it happening to him. Not others.</p>\n<p>Jason’s death hits him in a way he hasn’t ever really thought about. Logically, he knows that most people didn’t come back to life, and he’s seen enough dead bodies to be mostly desensitised. But it’s different this time. He knew Robin, Jason, even if only from a distance, and it seemed like he would live forever.</p>\n<p>He hopes he didn’t die alone. Not like Tim.</p>\n<p>The news of Jason’s death is enough for his parents to call him before their usual scheduled time. They pull him from boarding school and give him the option of self-study or going to the local private academy, finding the commute to the boarding school too risky. Tim doesn’t quite understand how commuting to a local school is any safer, but it’s the thought that counts, and their concern is enough to make him agree to the academy. They have to hang up fairly soon, but they organise the instalment of a new security system, and increase the housekeeper’s hours to keep an eye on him.</p>\n<p>It’s not much, but it makes him feel loved anyway.</p>\n<p>He says goodbye to his music teacher, who firmly tells him to keep practicing and to join his new school’s orchestra.</p>\n<p>“You have a talent, Mr Drake. Do not waste it,” he says seriously, squeezing his shoulder.</p>\n<p>Tim dutifully agrees, fingers twinging with phantom pain. He goes to his new school and is placed with kids two years older than him. There is no school orchestra. He returns every day to an empty house and feels like he’s drowning all over again.</p>\n<p>At the very least, his new schedule allows for more time outside at night, and it’s this freedom that lets him notice Batman’s gradual decline into brutality and passive suicidal behaviour. Petty criminals like pickpockets and shoplifters are beaten savagely, and Tim watches with increasing concern as Batman throws himself into dangerous situations over and over again. Every night. Even after taking blows that would have forced him to rest several days before.</p>\n<p>Batman is killing himself, and no-one is stopping him.</p>\n<p>And Tim realises that he has to step in.</p>\n<p> </p>\n<p> </p>\n<p>Tim is fully aware that he is, as some people have put it, fairly insufferable. His classmates call him that when he talks just a bit too much during group projects, his teachers call him that when they whisper their complaints about him, and his parents have hung up on him before for asking too many questions. It’s hard not to be insufferable when you’re a genius who’s skipped two grades and you have the nosiness and curiosity of a child who has never really been told ‘no’. Add in the fact that his idea of ‘parental supervision’ is an email and a credit card, then you begin to realise that the deck of normality was stacked against him from the start. And that’s not even mentioning his interest in ‘girly’ hobbies like ballet and the violin. If anything, Tim’s fairly proud that he hasn’t turned out worse than he is.</p>\n<p>But he doesn’t really mind being irritating, especially since it has its own benefits. It’s a lot easier to get people to agree to his requests when they want him to shut up. It also means that normal things like self-consciousness and embarrassment become a secondary concern when faced with someone’s business.</p>\n<p>Business such as a grieving father who fights crime and is subtly trying to kill himself for example.</p>\n<p>In hindsight, it is not exactly his proudest moment. But just like being obnoxious, his meddling is inevitable. He sends letters to the Justice League at such a rate that he gets a notice to cease and desist in his PO Box. It is signed by Wonder Woman, and he frames it, even though it’s addressed to a fake name. But his work isn’t done, and if none of the other heroes want to step in, then Tim is going to have to. So he wanders into Blüdhaven and Wayne Manor repeatedly, trying to force Nightwing and Batman to talk to each other, even if it’s about how annoying Tim is. He’s not even asking to be Robin; he just doesn’t want to watch Batman go into a battle he can’t come out from.</p>\n<p>Gotham needs a Batman after all. And Bruce needs someone in his corner, even if it’s the excruciatingly insufferable kid from next door.</p>\n<p>Except Bruce and Dick get captured, and Alfred chucks the Robin costume at him alongside a few words of encouragement.</p>\n<p>When he puts on the Robin costume for the first time, Tim is expecting it to be a one-time deal only. It is exhilarating, even as he rescues Batman and Nightwing, but he has no intentions of forcing a grieving father to take on a new sidekick after the death of Jason. Bruce even bluntly tells him that he doesn’t want a new partner, and while it’s a bit frustrating, Tim accepts it without a problem. He isn’t that oblivious. But then the older man concedes that maybe he does need a Robin, and while he doesn’t outright give the mantle to Tim, he’s willing to try.</p>\n<p>But Tim is very aware of his role. He is not a son or a friend or a protégé. He is a placeholder, a splint to keep Batman from shattering into pieces. As Alfred had said; Tim can follow orders. He can also nag with the best of them, which is certainly another point in his favour according to the butler. That and the fact that he knows Bruce’s identity are the main factors that make Bruce consider him as a possible candidate rather than sentiment.</p>\n<p>So he trains and learns to be the best splint possible. Batman’s training forces him to change his usual style. Whereas before, Tim would just let himself be killed if he couldn’t win a fight, he can’t do that anymore. He isn’t fighting by himself after all. But more importantly, he can’t do that to Bruce. He won’t let Bruce watch another Robin die in uniform.</p>\n<p>It is the main reason he never tells him about his particular ability.</p>\n<p>Tim learns to wield a staff, is sent to Paris to train after making Bruce promise to look after himself, and comes back with new scars but no deaths. A month later, Tim is deemed ready, and is launched into his Robin career with little fanfare.</p>\n<p>For the first time, he stays alive not out of luck, but skill. Even after being beaten half to death by the Joker, he clings on.</p>\n<p>However, as cordial as Bruce is to him, it is clear that he does not want a partnership of banter and familiarity like the previous Robins. Not when Bruce accidentally calls him Jason multiple times, when resentment gleams in his eyes as he looks at him on particularly bad days. It’s easier for both of them to keep a distance, and after patrol and a check-up, Tim wanders back to the emptiness of the Drake mansion. He doesn’t really mind. He’s used to being independent, and it isn’t like he’s a normal child. Being Robin and looking after Bruce gives him something tangible and real to do, and it’s better than sitting on the computer all day trying to teach himself ancient Sumerian Cuneiform.</p>\n<p>Dick, however, is very different. After getting over the shock of a new Robin, he throws himself into Tim’s life without hesitation. He pulls him into hugs and ruffles his hair, he invites him to the movies and to Blüdhaven for sleepovers, and he loudly and openly calls Tim his little brother. It is absolutely delightful and Tim can’t help but soak up the attention lavished upon him by the first Robin. He introduces him to the Titans, encourages him to work with Bart and Cassie and Kon, and listens to him ramble about his day without ever hanging up or groaning. Tim can safely say that he adores Dick, and even if he’s doing it to rub it into Bruce’s face, he doesn’t mind. He’ll take vindictive affection over nothing any day.</p>\n<p>But Dick’s open warmth seems to crack something in Bruce, and he begins to hesitantly invite him to stay the night after patrol, even when Tim hasn’t been injured.</p>\n<p>Alfred is a genial presence, and while not as open or cuddly as Dick, there is an undeniable fondness to the older man that Tim is eager to lap up. He makes him treats and tuts when Tim forgets to eat. He’s always moving, always doing something, and he never gets irritated when Tim bombards him with questions. If anything, Alfred is delighted to regale him with various tales as he trims the roses or prepares dinner. His favourite moments are when Alfred fixes his clothes, tutting over rumpled trousers and wrinkled shirts, lingering close enough that Tim realises that this is how the old man shows affection. His version of an embrace is straightening clothes, and while Tim has never known his grandparents, he’s fairly certain that Alfred is what a grandparent should be.</p>\n<p>For a few years, Tim is happier than he’s ever been. Bruce has begun to thaw even more, giving him smiles that are more than just a twitch of his lips, and ruffling his hair in a way that feels distinctly paternal. His parents haven’t been home in Gotham for almost seven months, but for the first time, he doesn’t care. He has the Titans, has Dick, Alfred and Bruce, and for the first time in years, he feels loved.</p>\n<p>Of course that’s when things go to shit.</p>\n<p>The year he turns fourteen, his mother dies, his father falls into a coma, and a new player in Gotham causes Bruce to shut down, even as he manages to get temporary custody of Tim while they try to sort out who should look after him.</p>\n<p>It’s funny. No-one’s ever cared about his living situation before.</p>\n<p>Tim buries an empty casket because there is no body to bury, and while neither he nor his mother actively practiced, it still feels wrong that she hasn’t been properly laid to rest. He doesn’t recognise the rabbi presiding over the ceremony, and he barely hears what the man says as he fixes the black ribbon to his right lapel.</p>\n<p>“Do you want someone with you as you perform keriah?” he asks kindly, and Tim shrugs. The rabbi’s eyes soften, but he stays as Tim numbly tears the ribbon apart and mumbles a prayer.</p>\n<p>He barely notices the rest of the funeral, staring blankly ahead as well-wishers try to talk to him. They’re all acquaintances and work colleagues, and it’s very obvious that none of them have researched what to do at a Jewish funeral before, let alone attended one. Someone brings flowers without having consulted the rabbi, and Tim wants to punch them. Judging by the rabbi’s frown as he spots them, he isn’t impressed either.</p>\n<p>Dick and Bruce take him back to the Wayne Manor afterwards, and the trip is silent.</p>\n<p>He sits shiva for his mother alone, in a dazed state. Even if Jack Drake wasn’t in a coma, Tim knows the man wouldn’t join him. He hadn’t converted, nor had he ever really been interested in partaking in the few Jewish traditions Tim and his mother did observe. Bruce offers to join him, but the appearance of Red Hood and a car bomb distracts him.</p>\n<p>Tim doesn’t know how to feel. He never played <em>Allegro non Molto</em> for her in the end. Or <em>Presto </em>or <em>November </em>or <em>Salut d’Amour</em>. Or any other pieces she asked him to learn. A part of him is expecting her to tell him that their trip has been extended the next time he calls them. Another part of him dully points out that technically, death is an extended trip for most people. And his parents- his mother- was always very good at those.</p>\n<p>He hasn’t cried yet. He doesn’t know if he wants to.</p>\n<p>The worst thing is that nothing feels different. There is no real piece missing, like the grief pamphlets said. He doesn’t turn to talk to her, because she was never there in the first place. He isn’t expecting a phone call, because Tim was always the one who called first. Drake Manor has always felt empty, and he hasn’t lived there for almost a year, even before his mother died.</p>\n<p>He doesn’t feel lost, because to be lost, someone has to realise you aren’t there.</p>\n<p>On the last day of shiva, he gets angry. Because his mother is dead, and she will never get to know him. She will never <em>want</em> to get to know him. She will never have the chance to want to be a part of his life beyond phone calls and a credit card and violin requests she will never listen to.</p>\n<p>It’s such a waste.</p>\n<p>Jack Drake has always been straightforward. The man is attracted to the idea of fatherhood, but not very invested in the reality of it. His presence has always been decided on a whim, promising Tim to take him to the finest photography museums or concerts or restaurants, before changing his mind without warning to something else. Jack Drake likes to talk about the things he wants to do, but has very little interest in putting the work in to achieve said things.</p>\n<p>But his mother was different. She didn’t try, not really, but there was a cursory presence. She was the one to encourage his interests, even if she herself never wanted to hear about them outside of the violin. She never promised him anything she wouldn’t do, not like Jack, and in that way, she was reliably unreliable. Jack Drake would promise to pick Tim up from school and leave him waiting for three hours in winter until Tim finally called a cab home.</p>\n<p>Janet Drake would have never made that promise in the first place.</p>\n<p>Neither of his parents really wanted or expected children. Apparently his mother didn’t even know she was pregnant until she was already several months along, and at that point, most of the upper society knew about the future Drake child, so she couldn’t get rid of him, not without a scandal.</p>\n<p>She hadn’t wanted him, but she had made sure he was comfortable.</p>\n<p>Janet Drake was not a good parent, or a parent at all really, but she hadn’t abandoned him to the wolves.</p>\n<p>Somehow, it still feels like an excuse.</p>\n<p>Tim meets with the family lawyer and accountant shortly after he finishes sitting shiva, and they offer him their condolences. The lawyer explains his parent’s will, explaining that he has inherited everything, but will not have access to the Drake company’s share-holds until he is either 18 or legally recognised as an adult. He does have a trust fund however, to be dispersed as needed, so he hasn’t been left destitute.</p>\n<p>Not yet at least, according to his accountant.</p>\n<p>His mother’s life insurance policy is enough to cover most of the medical fees, however there is no certainty as to whether Jake Drake will ever wake up.</p>\n<p>“You can afford to keep him on life support for another three years,” she explains, “but after that, you will have depleted most of your available funds.”</p>\n<p>The lawyer clears his throat, and gives him a smile that tries to be kind.</p>\n<p>“There is also the matter of custody. Bruce Wayne has temporary custody at the moment, but he has offered to foster you with the possibility of something more permanent. We still need to talk to your social worker, but given that Mr Wayne lives next door to you and you are familiar with him, a court will likely find him the most suitable candidate,” he explains.</p>\n<p>Alfred drives him back to the Manor after that, and gently promises him that whatever happens, Tim won’t be alone. He will have a home with them no matter what.</p>\n<p>Bruce formally fosters him three days later, but the whole thing is mostly a formality and a way to keep him out of social services rather than any actual desire for a son. With the way Bruce and Dick focus on solving the case of the Red Hood, the Wayne Manor is as empty as the Drake’s used to be more often than not.</p>\n<p>But he’s used to looking after himself, and despite the strange knot of grief in his chest, time goes on, and Tim continues on as he always has. He keeps his father on life support, because he doesn’t really know what else to do, and he donates most of his parents finds to various museums.</p>\n<p>Tim is not petty. But he does take great glee in sending off the precious artefacts his parents loved out of his old house. He doesn’t sell Drake Manor, but he does close it down, only sending a cleaning company once every couple of months for generic upkeep.</p>\n<p>Just like that, he settles into Wayne Manor. The numbness begins to fade, and when he isn’t out as Robin, he plays his violin obsessively, almost out of spite. He turns fifteen, and begins to feel okay. He gets hit in the face by a brick and makes a new friend because of it. Stephanie is loud and cheerful and unafraid, even in the face of her own father, and Tim falls just a little bit in love. Cassandra slips into their lives silently, and he can’t help but adore her, playing violin for someone other than a teacher or a distant audience for the first time.</p>\n<p>And then the Red Hood makes overt threats towards Robin, Tim gets benched, and eventually is sent to the Titan’s Tower for his own protection. It’s irritating, but at least there are more people at the Tower, so he begrudgingly agrees. A break from Gotham will do him some good, he thinks.</p>\n<p>Two days later, he wishes he had never left the Manor at all.</p>\n<p> </p>\n<p> </p>\n<p>Now, Tim isn’t really a literature buff. He’ll read, but things like allegory and irony and satire fly over his head. So when the Red Hood breaks into the Tower and beats Tim half to death, he isn’t quite sure what to call it. Dramatic irony perhaps, when he takes off his helmet to reveal the face of Jason Todd. Then he stomps on Tim’s fingers, and all thoughts of literary devices flee his head.</p>\n<p>“Should have thought harder before putting on the mask, Replacement,” he mocks, eyes glinting green.</p>\n<p>Tim tries to crawl away, and is shot in the thigh for it. Agony lances through his body and he chokes back a scream. He prays it hasn’t hit anything important, but it turns out that bleeding out is the last of his worries, as three minutes later, Jason punts him down the stairs. Tim only has enough time to swear violently before his neck snaps quietly against the cold tiles of the tower.</p>\n<p>It is the first time he has ever died as Robin, and it feels a little bit like a betrayal.</p>\n<p>He wakes up several hours later, alone in the tower, body aching from numerous bullet wounds, fractures, and bruises that haven’t been healed by his death. With clouded eyes, he notes a bloody message written on the wall. But before he can properly decipher the letters, his thigh throbs, and he bleeds out.</p>\n<p>Everything is a bit of a blur afterwards, and the next time he wakes up, he’s in the Cave’s medbay, Alfred at his side.</p>\n<p>“Welcome back, young master Tim,” the old man greets him dryly as he hands him a bottle of water. “You gave us all quite a scare.”</p>\n<p>“Sorry Alfred,” Tim croaks out, gingerly grabbing the water with his unbroken hand and taking several sips. “What’s the damage?”</p>\n<p>“Several broken fingers and a splintered left wrist, a fractured shoulder and broken ribs, and your femoral artery was dangerously close to being nicked by a bullet. It’s through sheer luck that you didn’t bleed out before you were found.”</p>\n<p>“How bad are my fingers? Can I still- will I regain full motor control?”</p>\n<p>Alfred chuckles, but it sounds drained.</p>\n<p>“It will take time and physical therapy, but yes, Tim.”</p>\n<p>There is silence for a moment, before Alfred closes his eyes and steps closer, a wrinkled hand gently reaching out to stroke his forehead, fingers trembling as he smooths Tim’s hair out of his eyes.</p>\n<p>“It was a very close call, my boy. Too close. This house can’t afford to lose another of its children,” he murmurs wetly.</p>\n<p>Tim remembers the broken neck and the bullet he’s fairly certain <em>did</em> tear through his femoral artery. Given how quickly he lost consciousness after waking up from his first death, he has the sneaking suspicion that he may have bled out and died again shortly after.</p>\n<p>But there’s no need to tell anyone that. Not with how shaken the normally unflappable Alfred is. So instead he lets the old man do his version of coddling and fussing over him, which mainly consists of checking over Tim’s bandages and making sure he has enough water. Before long, he steps back and clears his throat.</p>\n<p>“If you are hungry, I have some soup cooking in the kitchen. I will bring it down shortly. Perhaps the other residents of this house would like to speak to you while I do so.”</p>\n<p>Alfred pointedly raises his voice towards the last sentence, and Dick sheepishly shuffles in.</p>\n<p>“Hey Timmy,” he says gently, reaching out to ruffle Tim’s hair, “how are we doing?”</p>\n<p>“Like a spring chicken,” Tim replies drily, and Dick grins.</p>\n<p>“Bruce is still at the computer,” he explains, sharing a commiserating look with the butler. “I tried to tell him to come by, but he’s... fairly obsessed with finding Hood. Given how he stuck to your side while you were asleep, I’m surprised he hasn’t bulldozed his way in here yet.”</p>\n<p>Tim blinks. Bruce sat with him? But before he can even open his mouth to ask, Alfred mutters something derogatory under his breath and glides out of the room. Barely three minutes later, a disgruntled Bruce enters the medbay.</p>\n<p>He pauses by his bedside, face worn and bags under his eyes, and it hits Tim just how tired Bruce is. He has seen the older man at his absolute worst, but there’s an exhaustion he’s never quite noticed before.</p>\n<p>Dick leans over and gently ruffles Tim’s hair, before giving Bruce a harsh look.</p>\n<p>“I’ll go help Alfred with that soup,” Dick tries to say lightly, and Tim gives him a crooked smile. Bruce shuffles forward, almost awkwardly, as his eldest son breezes past him.</p>\n<p>Neither of them talk. For once, Bruce seems at a loss, hands clenching and unclenching at his side as he stares at the heart monitor and IV lines. He doesn’t perch on the bed like Dick did, or fuss with his sheets like Alfred. He just stands there, unable to look Tim in the eyes, and all of a sudden, Tim is angry.</p>\n<p>Bruce isn’t the one lying in the medbay after being beaten up and shot at by Jason Todd. Bruce isn’t the one who has to go through months of physical therapy. Bruce isn’t the one who had his goddamn neck snapped.</p>\n<p>He wants to scream at him, wants to yell and sob and ask why even now, he still can’t look him in the fucking eyes.</p>\n<p>But Tim has always been a fixer. Has always cleaned up his own messes and the messes of others while he bites his tongue and hopes he doesn’t choke on it one day. Knowing his luck, he probably will.</p>\n<p>“Red Hood claims to be Jason Todd,” Tim finally says, giving in to the unspoken stand-off just like he always does.</p>\n<p>“I know.”</p>\n<p>“He says you replaced him.”</p>\n<p>“I know.”</p>\n<p>“With me.”</p>\n<p>“Yes.”</p>\n<p>Tim kind of wants to punch him in the throat.</p>\n<p>“So what’s next?” he asks instead, because if he doesn’t, he thinks he’ll have a breakdown.</p>\n<p>Bruce is quiet for a moment, before he shuffles closer and hesitantly wraps a hand around Tim’s unbroken wrist.</p>\n<p>“You rest,” he rumbles out, “and you recover. Red Hood will be- dealt with. He won’t hurt you again, Tim.”</p>\n<p>Tim is too stunned by the blatant affection Bruce is showing him to say anything else, and instead nods numbly. They sit like that for a good ten minutes before the older man reaches up and strokes his hair, something soft and sad on his face.</p>\n<p>“I’m sorry, Tim. I’ll do better.”</p>\n<p>Tim wants to ask what exactly he’ll do better, but he’s too tired to try and navigate Bruce’s metaphors. So instead, he leans into the warmth offered to him and lets himself think he might be loved. Just for a little while.</p>\n<p>He falls asleep with fingers carding through his hair, and it’s almost enough to make him doubt the distance between them before. Tim knows better though at this point, and when he wakes up alone, he isn’t disappointed.</p>\n<p>It’s hard to be let down when you don’t expect anything, after all.</p>\n<p> </p>\n<p> </p>\n<p>Unsurprisingly, Tim is benched again, but unlike last time, he’s practically chained to the manor. He is driven to school and doctor appointments, has at least seven trackers on his person at all time, and isn’t allowed to leave the house unsupervised. Given how busy Bruce, Alfred and Dick are, it means he rarely leaves at all. Stephanie and Cass drop by and try to entertain him, but there’s only so much they can do to stave the boredom. Alfred tries to be present, but the old man has his routine and tasks, and the last thing Tim wants to do is interrupt them, no matter how often he’s told he isn’t being a bother.</p>\n<p>The worst thing isn’t the silence or the apathy or even the injuries. No, what upsets Tim the most is the fact that he died as Robin. It is telling that Tim is angrier about his streak being broken than Jason murdering him. Robin was sacred. One person dying in the suit was enough, let alone two more times. The only saving grace is the fact that no one has found out about it. Except, perhaps, Jason himself, but Tim isn’t rushing to ask him anything anytime soon.</p>\n<p>He takes up a position on coms as support for Oracle, despite Bruce and Dick’s repeated assurances that he doesn’t have to. Tim wants to, though. Because at least this way he can see them regularly. Cass and Steph both take up the Robin mantle while he’s recovering, and he swallows down the sharp flare of pain in his chest when he sees them.</p>\n<p>Jason tries to go after them, but stops when he realises they aren’t Tim. And gradually, the older boy seems to slow down, softening back into an amalgamation of Red Hood and the Robin Tim once knew. Batman and Nightwing notice the change, and Tim watches as they begin to team up. The first few times are disasters, fizzling out into screaming matches and blood, but it doesn’t last. After a week to cool down, they try again, gravitating towards each other despite the pain.</p>\n<p>And then one night, Tim goes down to the Cave and sees Jason. Alfred is there, fussing over his lost child, but Jason’s attention snaps to Tim the moment he turns up.</p>\n<p>They stare at each other without blinking, without moving. And then suddenly, Jason gives him a slow nod. It isn’t an apology. It isn’t even an acknowledgment. But it must mean something, because that nod breaks the spell, and Jason turns away, ignoring him for the rest of the night.</p>\n<p>His presence is never brought up, even when Batman or Nightwing are in the Cave, and Tim feels like he’s drowning all over again.</p>\n<p>The fact that he can’t play violin certainly does not help. Despite Alfred’s prognosis of recovery, it takes Tim months to regain even half of the flexibility he used to have, and more than once, he has to stop himself from hurtling his violin against a wall. While the rest of his body heals suitably, his fingers remain stiff, and he finds himself unable to play <em>Allegro </em>or <em>Presto </em>or <em>November</em>. His playing sounds childish, and after the fourth time his fingers refuse to react with the speed they used to, he gives up. Or rather, Cass makes him give it up.</p>\n<p>“Not healthy,” she tells him gently, prying his fingers away from the bow. “Dance instead?”</p>\n<p>Tim stares at the thin lines decorating his shaking hands, looks at the tightness of the bow and the worn down strings on his violin.</p>\n<p>“Yeah,” he says after a while. “We can dance instead.”</p>\n<p>She helps him put the violin away, and it feels like a part of him is being torn apart. He doesn’t know whether he should laugh or cry at the fact that he feels more grief over this than his mother’s death. But then Cass is pulling him into the dance room and watching him with eager eyes, and he forces his thoughts away.</p>\n<p>He hasn’t been in ballet for a few years now, but he’s still familiar with the stretches and routines, and his sister follows his movements with rapt attention. She mimics him, waving him away when he offers to show her the female parts instead. She wants to learn both, just like him, she explains. By the time he is healed enough to go back to being Robin, the two of them are like extensions of each other when they dance, switching between male and female roles without even thinking.</p>\n<p>He returns to being Robin without much fanfare, but the months away have changed things. He kept up with his training, but there’s a familiar disconnect between him and Bruce. Jason’s presence doesn’t exactly help things, but Tim tries to stay cordial. It doesn’t exactly fix things, but he settles into this new status quo without much difficulty.</p>\n<p>And then a little boy proclaiming himself to be the blood son of the bat shows up at Wayne Manor, sword in hand and head held high. Damian changes absolutely everything, entering their lives like a comet striking the earth. He does about as much damage as one too, though it mostly seems to be focused entirely on Tim.</p>\n<p>Damian’s assassination attempts make Tim’s life a living hell for the sole fact that it makes keeping his abilities secret almost impossible to do. That, and Tim would rather eat a shoe than be killed by the snot-nosed brat he now has to cohabitate with. It’s a matter of pride, at this point, but the little shit is good at what he does, and there are multiple close calls. He’s tossed off Bruce’s damn dinosaur, is poisoned and stabbed, and on one memorable occasion, almost blown-up.</p>\n<p>It is almost a relief when Jack Drake wakes up. Tim scurries back to Drake Manor as quickly as possible, ignoring Damian’s mocking and Bruce’s frown, and helps his father settle back into life. Jack mourns his mother with an absent-minded distance, and despite his complicated feelings about her, Tim can’t help but think Janet deserved better than this.</p>\n<p>His father tries to be involved in his life, but Tim is far too used to this song and dance to fall for it again. He is pleasantly surprised the first few times he actually makes an effort to be present, but the moment he meets Dana, he knows that things will go back to the way they always were. And he is proven correct. He doesn’t hold it against Dana, and finds her a nice enough woman. She’s the one who drags Jack to celebrate Tim’s sixteenth birthday after all, and he appreciates the gesture.</p>\n<p>It doesn’t last, because nothing good ever does in Tim’s life. His dad finds out about Robin and in some puffed up gesture gives him an ultimatum to either give it up, or have the whole Bat Clan be exposed to the press. Despite Robin being, quite frankly, the only good thing about his life currently, he goes to Batman, explains the situation, and leaves. Bruce does not stop him.</p>\n<p>He does, however, put Stephanie in the suit.</p>\n<p>And then she dies.</p>\n<p>And so does Kon and Bart.</p>\n<p>And then Jack is murdered in front of him.</p>\n<p>Bruce picks him up and carries him home, wrapped in his cloak and uncaring of the blood staining the fabric. He doesn’t poke or prod. He doesn’t try and pry the story out of him. He just sits with him, and Tim wonders how Bruce is able to do the right thing at the worst possible moments.</p>\n<p>He goes back to Wayne Manor, of course, and ignores the tension in the house. Tries to pretend that everything is alright, even as he boils with rage and grief in equal measure. It isn’t even about his father. Not really. Jack is a footnote in his life if Tim has to be honest, and had about as much impact as one too. But Steph? Kon? Bart?</p>\n<p>He feels like someone’s torn a chunk from him, and it hurts more than all of his deaths combined. Or at least, he thinks it does, because somehow, things get worse.</p>\n<p>Because Bruce dies.</p>\n<p>And everything spirals out of control.</p>\n<p>Here is the thing: there is something wrong with Timothy Drake. Normally, Jason would think that anyone who willingly climbs into the Robin suit and acts as B’s yes-man is abnormal, but Tim goes beyond that.</p>\n<p>Contrary to popular belief, when Jason went after the new Robin at the Titan’s Tower, he hadn’t planned on killing him. Terrorising? Absolutely. Maiming? Certainly. Crippling? If it meant that he would stay out of the costume, then so be it. But murdering him? No. That would prove nothing, it wouldn’t make the statement he wanted.</p>\n<p>Except the haze of green that always seems to linger in his vision had blurred things, more so than usual. He remembers beating the boy who stole his place, his <em>life</em>, remembers shooting him in the thigh and stomping on his hand.</p>\n<p>Jason remembers pushing him.</p>\n<p>He remembers expecting the new Robin to twist just like Bruce taught them and cushion his fall.</p>\n<p>He remembers laughing cruelly when he didn’t.</p>\n<p>Jason doesn’t know why the boy didn’t catch himself, but had been too amused by the way he had smashed into the tiles at the bottom of the stairs like a broken puppet, limbs twitching once, twice, before finally falling still. At the time, Jason had thought he’d fallen unconscious, and scoffed at the sheer ineptitude of the kid. This was meant to be his replacement? This was the boy Bruce had handpicked to fill Jason’s place before his corpse was cold?</p>\n<p>Pathetic.</p>\n<p>Since torturing an unconscious person wasn’t exactly thrilling, he had instead decided to start the next phase of his plan: vandalising the walls with the new Robin’s blood. Jason dug his gloved fingers uncaringly into the bullet wound on Tim’s thigh, noting with distant glee that he must have hit an important vein given the amount of blood.</p>\n<p>Except as he wrote, the blood flow trickled down to a sluggish stream. The colour had darkened into something black, had begun to cool, and Jason stared at the injury in confusion.</p>\n<p>It was then that he noticed that Tim wasn’t breathing. That his body was cold.</p>\n<p>That the angle of his neck was wrong.</p>\n<p>And Jason froze, the green clashing with panic as he fumbled with his gloves to check for a pulse.</p>\n<p>Nothing.</p>\n<p>“No,” he swore, teeth gritted, “you absolute piece of shit, you don’t get to fucking die on me.”</p>\n<p>The kid didn’t reply.</p>\n<p>Images of another battered Robin swam into his mind, and he couldn’t help but see his own self, broken and bruised as he waited for death to finally take him. Jason couldn’t breathe. No more Robins, he had promised himself. No more dead kids chosen for a pointless and endless crusade.</p>\n<p>He looked at his blood-soaked gloves, the red streaks on the wall, and wondered what the fuck was wrong with him.</p>\n<p>Jason lifted the lockdown, pressed the emergency beacon, and fled the tower. He stumbled into an alleyway, threw his helmet into a wall, and vomited, glove leaving red smears behind as he gripped the dirty brick.</p>\n<p>Later, after being confronted by Batman and screamed at by Nightwing, he learns that the kid survived.</p>\n<p>He tells himself that he must have had a flashback. Or that the green had made him see things. Except there’s a soft, nagging voice in the back of his head that sounds like a young Robin, quietly suggesting that maybe he hadn’t been mistaken. That perhaps, Jason killed another Robin.</p>\n<p>But that would make no sense, because Tim is fine, and neither Bruce nor Dick had mentioned him dying. Jason watches him from a distance, watches him heal and grumble and try to play the violin. Watches him dance with the new girl, go to school, do his homework.</p>\n<p>And he is alive.</p>\n<p>So why is everything inside Jason screaming that something is wrong?</p>\n<p>He goes through the cam footage in his helmet, except half of it is corrupted from when he hurled it against a wall. Only snippets are recoverable, and he feels sick as he watches himself brutalise the kid. But there’s no evidence of death. There is no dead Robin.</p>\n<p>When the new Robins go out, Jason lets himself approach. The blonde one hisses and spits at him, but the other girl just stares at him silently. Batman appears before he can say anything, whisking them away as he looks at Jason with an unreadable look. The green rumbles and howls, but he pushes it down.</p>\n<p>No more dead Robins, he repeats.</p>\n<p>Jason keeps his distance from the others, focusing his attention on fortifying his gang into a stabilising and reliable force. Clean drugs, no selling to kids, unionised brothels and protected prostitutes. Those who break his rules are made an example of, and the green haze calms with every drop of blood he spills, every grateful smile and relieved sob he receives from the people he helps.</p>\n<p>And then Dick tracks him down. He’s out of costume, face neutral as he waits in Jason’s safe house. Jason goes to shoot him, pretending his gun isn’t empty, but the softness in his former brother’s eyes chases away the rage.</p>\n<p>Dick hugs him, and it is the most painful thing in the world.</p>\n<p>“Alfred misses you,” his older brother murmurs. “You should call him.”</p>\n<p>Jason swallows, eyes burning and he nods into his brother’s chest. He’s so fucking tired.</p>\n<p>“Yeah. Okay.”</p>\n<p>It doesn’t make anything right, per se, but the hostility from before has dampened down into a wary uncertainty. Nightwing groups up with Red Hood and looks at him with big, sad eyes every time he shoots someone. When he turns up with Batman, a wave of green fills his vision, and he can’t stop the rage that spills out of his chest and into his throat.</p>\n<p>They part ways minutes later, and Jason is furious at Dick, furious at Bruce, furious at himself.</p>\n<p>Except Dick comes back, coaxing him like a wild animal, and as burned as he is, Jason can’t help but try again. When Batman shows up again, he chokes down the violence. Bruce doesn’t say a word.</p>\n<p>He just looks at him.</p>\n<p>There are several wrong starts and bad days, where he can’t stand to look at himself in the mirror, let alone his former family, when his blood vibrates with poorly concealed fury and he comes to in the middle of a bloodbath.</p>\n<p>But there are... okay times too. Not good, because Jason doubts things will ever be good between them again, but sometimes, Batman will sit next to him on a roof and offer up one of the little snack packets he always carries around.</p>\n<p>He barely manages not to cry the first time it happens.</p>\n<p>Soon enough, he slinks back to the BatCave, and Alfred’s joy is enough to make him realise that everything Talia said was a lie.</p>\n<p>“Oh, my boy,” the old man whispers into his hair, uncaring of the size difference. “You finally came home.”</p>\n<p>Neither of them mentions the tears in each other’s eyes.</p>\n<p>When the replacement shows up, Alfred gives Jason a look, soft and gentle. It is a silent request not to harm Tim again, to keep things civil.</p>\n<p>But Jason is too caught up by the intact neck of his replacement. The green doesn’t even whisper. All he can see is a neck he knows was snapped.</p>\n<p>The kid pales as he spots him, mouth thinning, but he doesn’t scream or attack him. He just... stares back. For lack of anything else to do, Jason nods, and turns back to Alfred, hands shaking.</p>\n<p>Something is wrong with Tim Drake.</p>\n<p>Jason doesn’t look at Tim again, and the boy shuffles off somewhere else.</p>\n<p>In the back of his mind, the crack of bones echoes. He doesn’t know if it’s his own memories, or the sound Tim made as he fell to the floor.</p>\n<p>He doesn’t know which he prefers. But he does know this: Timothy Jackson Drake should not be alive. </p>\n<p>There is something wrong with Tim Drake, and Jason should find out what it is. Should tell Bruce or Dick, or even Alfred.</p>\n<p>But he doesn’t want to. Because that would mean that Jason succeeded, that he has become the very person he despises. Tim still can’t look directly at him, and the realisation that Jason is his Joker makes him feel like he’s dying all over again.</p>\n<p>So he stays quiet. He keeps an eye on the boy, tells himself it’s reconnaissance, but he knows the truth. A part of him is terrified that if he looks away, Tim will collapse and stop breathing. That his neck will re-break, and it will be Jason’s fault.</p>\n<p>Something twists inside him when his replacement gives up Robin, and the green haze swirls in the corner of his eye, because after everything he’s been through, everything he’s fought for, Tim is going to just... give it up.</p>\n<p>For a father that, from what he’s seen, is pretty shit. Not Willis levels, but still an asshole.</p>\n<p>And then Stephanie Brown dies in the Robin suit, and Tim becomes a distant thought.</p>\n<p>Another dead Robin. Bruce acting like nothing is wrong. Tim staring into the distance and Dick desperately trying to keep things together.</p>\n<p>He spirals. Jason can admit that much. A part of him is viciously gleeful when Jack Drake dies, but the rage at another dead kid in a suit chases the thought away soon after. He plots and plans, starts brutally attacking Black Mask’s men, and doesn’t care when several of them land in intensive care.</p>\n<p>It isn’t about Stephanie, not really. He didn’t know her. But that’s not the point. The point is that Bruce has failed yet again, and Jason wants the man to know it. He wants to scream and yell and claw at the man that was his father, wants to ask why his crusade can dismiss the deaths of children, but will leave their murderers alive.</p>\n<p>He doesn’t get his answers. He never will.</p>\n<p>Because Bruce dies.</p>\n<p>And Jason drowns in green.</p>\n<p> </p>\n<p> </p>\n<p>Here is the thing: Tim makes a mistake.</p>\n<p>Several, in fact, and each one is worse than the other. His first mistake is telling anyone about Bruce’s appearance in the painting, because all it gets him are increasingly worried looks, and Dick’s gentle suggestion that he go to therapy. Tim is fully aware that he probably needs therapy, but not for the reason being suggested. His next mistake is forgetting that the status quo has once again been changed, because when Damian appears in front of him in the Robin suit and a smirk on his face, Tim is blindsided.</p>\n<p>His third mistake is leaving. In hindsight, Tim probably could have convinced the others given enough time and energy, but grief and anger do not leave a lot of room for reason. In his mind, he has been abandoned once again, but this time he only has himself to blame. Intellectually, he knows that grief can wreak havoc on people’s relationships, but that doesn’t stop the exhausted and betrayed tears that attack him at night.</p>\n<p>Cass disappears to Hong Kong. Barbara shuts herself away and focuses on working with the Birds of Prey. Jason dresses up as Batman and goes back to killing criminals, before being wrangled out of Gotham by Starfire and Arsenal for an undetermined amount of time. Back at the Manor, things are deteriorating just as badly. Alfred is running himself ragged, and doesn’t need any more grief. Dick is so focused on being Batman and staying strong for Damian that he has little time for anything else.</p>\n<p>Leaving seems like the only option Tim has. So he packs up his things, destroys his trackers, and takes the first flight out of Gotham without telling anyone. He uses his status as the son of the Drake archaeologists liberally, and gains access to various excavations and archives he otherwise wouldn’t have been able to visit legitimately.</p>\n<p>“Taking after your parents, eh?” one of his guides jokes, watching the way he notes down every strange discovery on his laptop.</p>\n<p>“Something like that,” he grins back, and the guide laughs.</p>\n<p>Tim doesn’t have anything concrete, not yet, but the clues are building a picture. Being thrown into time isn’t exactly the most natural conclusion, but given the evidence, it would make sense. Stranger things have happened after all, and if it means there’s a chance that Bruce is alive, then he’ll take it.</p>\n<p>The last mistake he makes is catching the attention of Ra’s al Ghul.</p>\n<p>Here is the thing: ever since Jason came back, Tim has been researching the League of Assassins and their fabled Lazarus Pits. Bruce has always been reluctant to discuss his experiences with the organisation, but his need to prepare for every outcome means that he inevitably has to teach Tim about them.</p>\n<p>What he learns is... terrifying, because if his particular abilities comes under the League’s radar, then Tim is screwed. He doesn’t want to know what they would do it him if they found out, doesn’t want to see if the Lazarus Pits would work on him or leave him dead, and he most certainly does not want to discover whether his mind would remain intact if he did survive. Tim has always been careful to hide his power, but he is damn near obsessive about hiding it from the League. He has purposefully crafted a mediocre persona to keep them uninterested, has always shrunk back and quivered in the few times Bruce has had to deal with them, and considering Damian’s low opinion of him, he was certain he had fooled them.</p>\n<p>Given the assassins sent after him in Paris however, he doubts it was ever enough. And when they keep appearing, this time to assist him, Tim knows he’s fucked up somewhere along the line.</p>\n<p>But somehow, his mistake becomes a blessing.</p>\n<p>Prudence, Z and Owens are strange for assassins, and their loud reluctance to actually help him speaks volumes to their own confusion about Ra’s’ end game. But they listen to him. They don’t kill when he asks, they keep injuries to non-lethal levels, and they speed up his investigation three-fold.</p>\n<p>More than that, Tim finds himself slowly liking them. He turns seventeen in Zurich, after investigating reports of a strange bat-shaped glaive being found in a mountain pass, and the assassins take him out for a beer. They’ve become friends, tentative as it is, and as much as Tim doesn’t want to get attached, the loneliness makes it hard to stay objective. Somehow, Prudence turns into Pru who can be antagonised into suplexing people, Z ropes him into watching corny television and chucks food at him, and Owens is always ready for a game of cards or chess.</p>\n<p>So Tim wrestles Pru and cheers her on when she slams a would-be rapist into the ground, heckles the soap operas with Z and eats the food he’s given, and competes with Owens to cheat in increasingly complicated and creative ways. Even though they’re allies through forced circumstances, they make it easy to feel comfortable.</p>\n<p>It doesn’t last, of course. Tim is a detective, and he knows patterns. He’s done the maths. The likelihood of people staying in his life is tragically low.</p>\n<p>The beginning of the end starts with a packet of papers being waved in front of him.</p>\n<p>“News for you, boss,” Owens says, a crooked grin on his face. “There’s word of an excavation team heading to a cave in Iraq after finding some tablets hinting at a find there. Might be important.”</p>\n<p>Tim takes the offered papers and reads through them, and pauses at the picture of the tablet. In the corner is a tiny symbol, something that could almost be considered bat-shaped. It is the best clue he’s found so far.</p>\n<p>“Huh. Looks like you’re onto something,” Z comments, peering over his shoulder, and Tim chuckles.</p>\n<p>“Looks like it. Time to pack up then. Pru, can you send some people to slow the expedition down before we go there?” he asks, carefully folding the papers and tucking them into one of his many folders.</p>\n<p>Pru groans at his request, but pushes herself off the hotel couch and wanders over.</p>\n<p>“Sure, but I get to choose dinner.”</p>\n<p>“Deal.”</p>\n<p>They leave the next morning, staggering their travel to reduce any notice, and convene in Baghdad. Z has already organised a jeep for them to use to travel through the desert, and Pru shows up with a grin on her face as she explains how the expedition team has come down with a sudden case of food poisoning.</p>\n<p>They collectively agree not to let her choose the food anymore.</p>\n<p>A day later, they set off, and anticipation bubbles in Tim’s stomach. There’s something out there, he can feel it. The ride is silent, his excitement and nerves strangling any conversation that could have bloomed. Z, Owens and Pru seem equally on edge, and as they get closer and closer to their destination, the tension only rises.</p>\n<p>Perhaps that should have been the first sign that something wasn’t quite right.</p>\n<p>But then they reach the cave, and as Tim carefully investigates every inch, any concern evaporates at the sight of a familiar shape.</p>\n<p>There’s a drawing of a bat carved into the stone, worn and ancient, but unmistakably one of Bruce’s. It takes everything in Tim not to whoop with joy, and he has to calm himself down multiple times as he begins to chisel it out.</p>\n<p>“That what you’re looking for?” Z asks, unimpressed, and Tim hums.</p>\n<p>“It’s the best evidence I’ve found since I set off,” he explains absent-mindedly. “Can someone toss me the brush?”</p>\n<p>He painstakingly removes the drawing from the stone, wrapping it up in cloth to keep it from crumbling to pieces or being exposed to anything that might damage its structure. Pru mutters something about nerds and digging under her breath, but Tim is too entranced by his discovery to care.</p>\n<p>He should have been paying attention.</p>\n<p>It was the first rule that was instilled in him as he travelled through Gotham at night.</p>\n<p>No matter how safe you think you are, there is always something dangerous waiting.</p>\n<p>They exit the cave, and Owens, having stood watch, raises a hand to greet them. He opens his mouth to say something.</p>\n<p>Blood splatters onto the sand.</p>\n<p>Owens’ head topples to the floor with a dull thump, eyes open and unseeing. He’s still grinning.</p>\n<p>Pru barely has time to shriek before her own throat is slit, her furious scream turning to a strangled gurgle. Z tries to fight back, face incandescent with rage, and he gets stabbed in the lungs for it. Tim desperately tries to fight back, but he isn’t spared from the carnage either, and he gasps as the blade slips between his ribs and pierces his organs.</p>\n<p>“Thank you for participating,” their attacker says placidly, “you’ve made a very amusing game.”</p>\n<p>And he disappears, leaving blood-soaked sand and four bodies in his wake.</p>\n<p>Z wheezes something, blood bubbling past his lips, and Tim tries to crawl to him. By the time he reaches him however, he is silent, eyes open and unseeing. Tim chokes back the taste of blood and grief, and drags himself over to Pru.</p>\n<p>There is no point in checking on Owens.</p>\n<p>Through some miracle, Pru is still breathing, and he pounces on her wound, ignoring the agony of his own injury as he puts pressure on the cut. She looks at him with wild fury and shock, blood streaming down her neck. By the time the bleeding has slowed down, Pru is unconscious and he is delirious with pain and blood loss, but he can’t give up now.</p>\n<p>He can’t die right now. Not when he doesn’t know how long it will last before he wakes up. And Pru needs help now.</p>\n<p>So he hauls her up, muffling a scream as he stretches his wound even further. A reedy whine escapes his lips, and he can feel warm blood slide down his chest, sticking to his clothes and catching stray grains of sand.</p>\n<p>He has to keep going.</p>\n<p>“We can do this,” he garbles out. Pru’s only response is a rattling huff.</p>\n<p>Tim doesn’t know how he gets back. Doesn’t know where he pulled the strength from to deposit Pru in the jeep and dive back, body shrieking in agony as he loses more and more blood. But he hangs on, and every time his vision darkens, he forces himself to stay awake. In his delirium, the hotel is a safe zone. There they can rest. He can fix Pru and himself, and they will be safe.</p>\n<p>It is a miracle that they make it to the hotel, let alone undetected, but he manages it. He sways on his feet, hands trembling and body weakening as he pulls open his emergency supplies and gets to work on Pru.</p>\n<p>She’s still breathing, which is comforting in of itself, and he assesses the damage with blurry vision. Her larynx has been severed, but through some miracle, her trachea is intact. His hands shake as he wraps it up a torn bedsheet. It’s barely passable, but with luck, it will keep her from dying.</p>\n<p>He did it. They’re safe.</p>\n<p>And with that, he finally lets himself collapse.</p>\n<p>Tim is dead before he hits the floor.</p>\n<p> </p>\n<p> </p>\n<p>When he wakes up, he thinks for a moment that he’s in the BatCave. That Dick came and rescued him, took him home, patched him up. And in that moment, he so desperately wants that to be the case. Tim wants to be home, he wants to see Dick and Alfred and even Damian, he wants to feel safe again.</p>\n<p>It is a nice dream.</p>\n<p>Too bad it isn’t real. Instead, as his eyes clear and focus, he notes the ornate ceiling, the golden light of lamps, and the soft sheets surrounding him. There is a large window on the other side of the room, and he squints at the silhouette facing away from him, hands clasped behind their back.</p>\n<p>“October 17, 2002,” the person suddenly says, voice smooth and familiar, and Tim freezes, ice clawing up his spine. “Jeremy Rhodes reports to his superior, a lieutenant of Black Mask’s group, that he shot and killed a potential tail. He describes the victim as young, possibly a child, with dark hair and blue eyes.”</p>\n<p>No.</p>\n<p>“December 9, 2002. A homeless man calling himself Streetcart contacts the police after seeing a young boy fall to his death. Young, possibly a teenager, he tells the operator, with black hair. When the police show up however, they are unable to locate a body in the area that matches his description. It is written off as a hallucination, and forgotten.”</p>\n<p><em>No</em>.</p>\n<p>“March 22, 2003. Sasha Novin brags to her friends about gutting a ‘little brat’ in Park Row. She mentions stealing a watch and his shoes, but insists he has other valuable items. And yet, when she brings her friends to loot the rest of the body, she finds nothing.”</p>\n<p>Tim can’t breathe.</p>\n<p>“August 3, 2003. Gideon ‘Punchout’ Tonello, a member of the Joker’s gang, confesses to stabbing and hitting a black-haired and blue eyed boy with a hammer. There is no evidence of such a murder happening, and it is concluded that Gideon was lying in order to confuse law enforcement about his actual crimes.”</p>\n<p>Ra’s al Ghul turns away from the window to look at Tim with dark amusement, lips quirked into a mockery of a smile.</p>\n<p>“June 26, 2007. Timothy Drake is stabbed through the chest with a sword. He is described as a black-haired, blue-eyed teenager. His spleen is ruptured, his right lung is torn, and his heart is nicked. He bleeds out in his hotel room at 1:49 in the morning. And then the strangest thing happens; when his body is recovered, he begins to breathe again. He is taken to a secure location for an emergency operation, but dies on the operating table. He is dead for 34 minutes. Just before the call is made to utilise a Lazarus Pit, however, his heart starts to beat. When examined, they find his heart and lung healed. His spleen, however, is still ruptured, and must be removed. Timothy Drake makes a full recovery despite dying twice in one day.”</p>\n<p>The ancient man cocks his head, eyes half-lidded.</p>\n<p>“Tell me, Timothy,” he purrs, “how old were you, when you realised that you could not die?”</p>\n<p>Tim’s hands curl into the sheets as he tries not to vomit.</p>\n<p>“What do you want,” he says flatly, gut churning, and Ra’s tuts.</p>\n<p>“Come now, Timothy. I have asked you a question, and am intrigued to hear your answer.”</p>\n<p>He doubts that Ra’s wants to know out of mere curiosity, and the mere thought of what he might do if he knows the answer makes Tim’s chest constrict. His mind works overtime, poking and prodding various answers and non-answers he could possibly give. Carefully, he sits up, refusing to wince as the movement tugs on the stitches in his body.</p>\n<p>“Young,” he replies, slipping on the familiar mask of the young Drake heir; composed, intelligent, ruthless.</p>\n<p>It only serves to amuse Ra’s further, and yet he moves on from the topic. But the gleam in his eye suggests he knows more than Tim wants.</p>\n<p>“You have made excellent progress during your search for the Detective. It is most impressive.”</p>\n<p>He pauses, eyes raking over Tim with an intensity that makes his skin crawl.</p>\n<p>“And then you present to me an even bigger curiosity: the ability to return to life without the use of a Lazarus Pit. You can only imagine how intriguing you are. I admit to being curious, how many times have you perished under the supervision of the Bats, without them ever noticing?”</p>\n<p>Ra’s steps forward, and Tim forces himself to stay relaxed, even as the older man grasps his chin. His fingers are cold and harsh, but his grip is dangerously gentle. Tim knows that he could snap his neck with barely any effort if he so desired, and does not move.</p>\n<p>“Do they know about the attic?” he murmurs gently, and ice travels down Tim’s spine. Before he can respond, Ra’s releases him, his eyes fever bright, and pulls out an old, but familiar notebook from his sleeve.</p>\n<p>“Where did you get that?” Tim bites out, because that- that’s the first notebook he used to write down his observations about his deaths.</p>\n<p>“By looking,” Ra’s replies, still smiling, and he flips the book open. “Your cipher was absolutely fascinating to break. To think you came up with it at five years old... truly impressive.”</p>\n<p>Tim’s throat closes up, and he tries to lean forward to grab his notes, but Ra’s pulls back, tutting.</p>\n<p>“You’ll tear your stitches. Do you not remember the aftermath of death seven? Or 22?”</p>\n<p>He does remember. He remembers the pain, the shaking hands as he tried to stitch his own wounds shut without properly disinfecting the tools. He remembers the pus and the black blood and the heat that slowly boiled his organs until he died.</p>\n<p>And now Ra’s knows too.</p>\n<p>Tim feels like he’s been cracked open, all the secrets he’s worked so hard to swallow down being carelessly scooped out and displayed for the world to see.</p>\n<p>“What do you want,” he repeats, voice hoarse and defeated.</p>\n<p>“I would like to make another deal, Timothy. Several of my best operatives have been slaughtered, meticulously hunted down and assassinated. This includes two of the assets I sent to assist you. You have found the evidence you need to prove the Detective’s continued existence, but the question of how to return him to the correct time remains. Help me eliminate the threat to my business, and I shall offer you every single one of my resources to ensure the Detective’s safe return.”</p>\n<p>“I won’t kill,” Tim automatically responds, and Ra’s simply hums.</p>\n<p>“As expected.”</p>\n<p>It isn’t even a question. Tim should refuse. He has his evidence, he can go to the Justice League and convince them of the truth. He can get Bruce back without making a deal with Ra’s al Ghul.</p>\n<p>Except the feeling of Ra’s’ fingers on his face lingers, the hungry look in his gaze as he spoke about his abilities still burned into his mind. Now that he knows, Ra’s will not let Tim go easily.</p>\n<p>There is more at play here. But what?</p>\n<p>“Fine,” Tim forces out, and Ra’s smirks.</p>\n<p>“I look forward to our partnership, Timothy,” he purrs, and Tim has to swallow down the bile. “Rest and recover. We will discuss more at a later date. Right now, I am certain your guest wishes to speak to you.”</p>\n<p>Tim blinks, face scrunching up in confusion, and in that moment, a young woman stumbles into the room.</p>\n<p>“Timothy Wayne?”</p>\n<p>Tim jerks forward, mouth falling open as Tamara Fox trembles in front of him, two guards behind her. She looks confused and terrified, eyes darting between him, Ra’s and the swords on her guards’ waists.</p>\n<p>“What-?” he chokes out, and Ra’s simply smiles.</p>\n<p>Tamara shuffles in, positioning herself at a distance and fingers clutching at her sleeves, a desperate look on her face.</p>\n<p>“I shall leave you to entertain your guest, Timothy,” Ra’s says smoothly, striding towards the door as Tamara shuffles inside. He pauses before he leaves, head turning back slightly to look Tim in the eyes, his notebook still cradled between his fingers.</p>\n<p>“Should you ever wish to... explore your abilities further, then I will gladly offer my assistance.”</p>\n<p>And then he is gone, leaving Tim with a confused civilian and the need to vomit. The room is silent for a moment, Tam staring at him with a bewildered expression on her face, before it twists into confused rage.</p>\n<p>“Tim,” she begins, voice trembling, “what the fuck is going on?”</p>\n<p> </p>\n<p> </p>\n<p>Tam, obviously, does not take his explanation well. She tries to hold it together, smoothing her face into the same neutral mask her father makes when confronted by particularly irritating business partners, but there is a visible fragility in her eyes.</p>\n<p>“Why would you agree?” she asks him, again and again when he comes back from his meetings with Ra’s shaking and vomiting. Tim shrugs and deflects.</p>\n<p>“Because it was the best choice in the situation,” he offers, “and it will keep you out of the crossfire.”</p>\n<p>Because if I don’t use this chance to burn everything Ra’s has, he’ll never stop coming after me, he doesn’t say.</p>\n<p>They both know that while he isn’t lying, he absolutely isn’t telling the truth either. She pushes and prods, tries to force him to tell her what exactly he does with Ra’s when he isn’t training, gathering information, or putting a comprehensive packet about Bruce together.</p>\n<p>“It’s just tea,” Tim tells her, and she lets out a furious sob.</p>\n<p>“Must be some tea, if it makes you throw up every time,” she says, cheeks dark from tears. Tim looks away.</p>\n<p>Here is the thing: Ra’s does just have tea with him, though he never drinks it. He does, however, ask Tim questions, uncaring when he is silent and refuses to answer.</p>\n<p>“Did you know,” Ra’s says one day, carefully dripping honey into his tea, “that any tissue or blood left behind from your deaths dissolves after several days? When injected into other hosts, it has no impact on their survival rates either. Instead, it becomes... inert.”</p>\n<p>He is suddenly very thankful that his blood type is common enough that Bruce felt no need to draw blood from him in case of emergencies. But it would explain how a five year old was capable of cleaning a bathroom covered in blood without leaving a trace. Tim was a smart kid, but even he would have struggled to get every single corner. The fact that pieces of his body are impacted after death suggests some linkage to his abilities, and a part of him wonders what Ra’s isn’t saying.</p>\n<p>After all, he conspicuously does not mention the Lazarus Pits.</p>\n<p>For his own safety, Tim does not voice any of his thoughts, and instead levels the ancient man with an unimpressed look.</p>\n<p>“Rummaging through my DNA, Ra’s?” he returns, fingers trembling around his own untouched cup.</p>\n<p>“Naturally. There are several metahumans with the ability to prevent or circumvent their own deaths. None, however, actually physically perish. Not like you. And yet, investigations into your DNA have shown that genetically, there is nothing exceptional that causes your repeated resurrections. On the surface, you are utterly and entirely human,” he explains, and Tim scoffs.</p>\n<p>“No need to sound so disappointed.”</p>\n<p>Ra’s chuckles darkly.</p>\n<p>“Quite the contrary, Timothy. I am intrigued. You are a rare mystery. One I look forward to... <em>unravelling</em>,” he replies lowly, voice smooth and soft.</p>\n<p>Tim excuses himself shortly after, and vomits the moment he escapes back to his room.</p>\n<p>While infrequent, every session follows a similar line. Most often, Ra’s pulls out Tim’s notebooks and goes through every death, eyes burning bright as he wonders over the details written in the margins. And then he begins to go through the theoretical scenarios Tim has written about.</p>\n<p>Tim has died many times, in various ways, but as long as death exists, there will always be new and creative ways to fall victim to it. He has always been a preparer, so of course he writes theories on what could happen if someone beheaded him or threw him into space.</p>\n<p>It delights Ra’s as much as it sickens Tim.</p>\n<p>“I would think that total destruction of your body would prevent you from returning,” he muses, fingers trailing over Tim’s handwriting.</p>\n<p>“Maybe,” Tim says, trying to swallow down the visceral disgust in his throat. “I’ve never been inclined to try.”</p>\n<p>“Understandable, of course.”</p>\n<p>And so it goes. By the time Tim has tracked down the next target of the Council and wormed into the League’s databases, Ra’s has picked through his deaths like a vulture. He has not mentioned the Lazarus Pits once, and Tim has not offered to discuss what would happen if he was dropped into one.</p>\n<p>He also does not go out of his way to force Tim to die, even during training. Oh, he lets his agents try their best, but he never puts him in a situation where death is inevitable. It would be easy on Ra’s’ part to kill Tim in his sleep or set wave after wave of assassins after him.</p>\n<p>And yet he never does.</p>\n<p>This, more than anything, clues him into the fact that Ra’s is absolutely up to something, and Tim has a sneaking suspicion he knows what it is and how it relates to his abilities.</p>\n<p>It is a relief to leave the Cradle to go after the Council, even as he gives Tam explicit instructions to stay in their room and out of sight. Tim has tried time and time again to send her back to Gotham, but has always been denied. She is a glorified hostage, and he realises that her presence is insurance to make sure he returns after every mission.</p>\n<p>Pru joins Tim on his mission, her silence a noticeable weight in the helicopter as they trace their target’s footsteps. There is no Z or Owens to fill the space with murmured comments or jokes. The assassins that make up his team have no inclination to make any noise either.</p>\n<p>The mission, naturally, goes horrifically wrong. It is a slaughter. Every squad he put together and sent out are massacred, and his own is gutted from a team of 12 to four survivors. It only gets worse as he rushes back with Pru to the Cradle, desperately hoping that he isn’t too late to save Tam from a similar fate. The next hours pass in a hazy rush of injuries, blood and poison, yanking Tam out of danger and barely having time to warn Pru to run before he blows everything up.</p>\n<p>Ra’s calling him immediately afterwards is unsurprising.</p>\n<p>“You’re a dangerous young man, Timothy.”</p>\n<p>“I’ll take that as a compliment,” Tim replies, steadying Tam as she stares at the wreckage he’s caused in grim shock.</p>\n<p>“I am not in the habit of letting dangerous men live. In your case, however, something else shall have to suffice,” Ra’s says softly. “Considering you have destroyed my business, I only find it fair to return the favour.”</p>\n<p>The com goes silent immediately after issuing his threat, and Tim crushes his own shortly afterwards.</p>\n<p>“Was that...?” Tam asks, trailing off, and he sighs.</p>\n<p>“We need to go back to Gotham.”</p>\n<p>She lets out a startled laugh, hand still wrapped around his arm. He can feel her trembling.</p>\n<p>“Well, mission accomplished on my part, I suppose.” Despite the fear and apprehension in her voice, there is relief as well, and Tim can’t help but feel the same.</p>\n<p>Neither of them speak as they fly back to Gotham, both exhausted and processing the events of the past few weeks. But his work is not done yet. Ra’s knows he is tired, knows he’s burning out, and will strike the moment Tim is back in Gotham. He won’t start without him, so that gives him only a sliver of opportunity to plan.</p>\n<p>First, however, he uploads all his information on Bruce and how to retrieve him to the Justice League servers. And then he sends it to Barbara just in case. If anything, it should convince the others to try and get him back, just in case. Tim will stop Ra’s’ attack on Wayne Enterprises and his family no matter what, and he’ll do his damned best to make it out himself.</p>\n<p>But there are worse things than death, and Tim hasn’t made it this far without making contingencies.</p>\n<p>“Lucius? Sorry for the late call, but I need you to file some paperwork...”</p>\n<p> </p>\n<p> </p>\n<p>It was for nothing. Everything Tim did, all his research, pissing off Ra’s-</p>\n<p>It was fucking pointless.</p>\n<p>Stephanie is alive. So is Kon and Bart. Barbara tells him that they already know that Bruce is alive due to some skirmish with the Black Lanterns.</p>\n<p>He is shaking as he leaves the BatCave, ignoring Dick’s heavy stare, Damian’s smirk and Stephanie’s frown. Tim knows his theory was outlandish. He knows. But he wishes that just once, people would trust him. Though he supposes it’s his own fault for going off the grid. He should have just stayed in Gotham, or at the very least, stayed in America.</p>\n<p>And now, because of his own stupidity, his <em>pride</em>, everyone is in danger.</p>\n<p>Ra’s calls him again, and Tim has to force himself to focus on the clues he drops. Despite his fury and shame, he contacts the others. Puts them in position.</p>\n<p>Plans for his confrontation with Ra’s.</p>\n<p>Here is the thing; Tim has picked apart Ra’s’ observations on his abilities. He listened to every sickening second of him discussing the gruesome ways he could die, the experiments he conducted, the curiosity that is his body.</p>\n<p>Not once did Ra’s mention the Lazarus Pits. And that tells Tim everything.</p>\n<p>He meets with the rest of the Bats and explains the situation, before contacting Young Justice and Manbat, organising the best formations to secure Ra’s targets. Pru shows up, and her presence is a relief, despite Damian’s yelling. Tim fights off the assassins with Steph before sending her to the manor, listens to everyone sound off and confirm their safety, before he tells them that he’ll rendezvous with them shortly. He talks to Dick privately and explains that he’ll be in Burnley.</p>\n<p>“If things go wrong, I may need backup.”</p>\n<p>“Tim-,” Dick tries to interject, but he cuts him off.</p>\n<p>“Please. I’m asking you to trust me.”</p>\n<p>There’s silence for a moment, and Tim can feel the frustration mounting before finally-</p>\n<p>“Always. I’ll be there. Be safe, Tim.”</p>\n<p>His stomach twists, and he lets out a sound of confirmation before switching the com off and crushing it under his heel. He already hates himself for lying to Dick, but it had to be done.</p>\n<p>None of them can be anywhere near Ra’s and Tim when they fight. But they’re safe, and that’s what matters.</p>\n<p>He tells Ra’s as much, clutching his dislocated arm and wincing in pain, and the ancient man looks at him.</p>\n<p>“Well done, Detective,” he murmurs, uncaring of the blood dripping from his face. “You have indeed saved the people he loved. You have won this bout. But I’m afraid that I am the winner in the war.”</p>\n<p>A blade slices through his heels, and Tim cries out, collapsing to the floor. A boot slams into his head, again and again, until he can barely see anything from his swollen eyes. Ra’s crouches down, grabs his hair to look him in the face, and smiles.</p>\n<p>“We discussed whether total annihilation of your body would prevent you from returning. However, as I experimented, I noticed that your spleen had a very... interesting reaction when placed within Lazarus Water. It did not dissolve. Instead, it seemed to go into a... stasis of a sort. But that was not the most fascinating part. No, what truly caught my attention was that as long as a piece of it existed, then no matter what the destruction was, it could reform.”</p>\n<p>He drops Tim’s head with a loud thunk, and tosses a small, beeping device into his face.</p>\n<p>“I do hate to make your father go through the same loss with a different son. The destructive power of this bomb will... completely disintegrate any living matter,” he explains, drawing his sword and positioning it over Tim’s chest.</p>\n<p>“I apologise, however I must ensure that you remain... immobile until detonation. But do not worry, we will be seeing each other shortly. And after that, well... We’ll have all the time in the world.”</p>\n<p>The bright red numbers of the bomb sear into Tim’s already sensitive eyes, and he watches the glint of the city lights in the reflection of Ra’s sword. It strikes true, and he gasps, already feeling the blood pour into his lungs and choke him.</p>\n<p>Ra’s watches him with distant amusement, before yanking the sword out of his body and cleaning it off.</p>\n<p>“Farewell, Detective. I look forward to our next conversation,” he says, turning away and leaving the building.</p>\n<p>And then it’s just Tim, a fatal sword wound, and a bomb slowly ticking down. If what Ra’s said is true, then Tim is fucked. And yet...</p>\n<p>Tim grins with bloody teeth.</p>\n<p>Because here is the thing; Tim knows what Ra’s said during his time with the League. He listened very carefully. And he knows that the Pits were never mentioned during their discussions. Which meant that Ra’s had managed to discover some reaction with his blood or organ. One he did not want Tim to know.</p>\n<p>Here is the thing; Ra’s specifically said that his blood became inert when in contact with other hosts. Inert does not necessarily mean unusable. Instead, it suggests that all that is needed is something else to make it react again.</p>\n<p>Put together, Tim was able to conclude that Ra’s most definitely still had his intact spleen, and was holding onto it for a very specific reason.</p>\n<p>Here is the thing; his power is lazy. It doesn’t heal everything. It lets him die over and over rather than getting rid of all lethal injuries at once. It stands to reason that his ability would prefer proximity over quality.</p>\n<p>There is currently an arm and copious amounts of blood in a bathtub in one of Tim’s safehouses.</p>\n<p>If someone were to test it, it would match his DNA. It had been difficult to cut his arm off and do enough damage to kill himself without permanently losing his arm, but he had managed, and woke up in a bathroom that could have come straight from a horror movie.</p>\n<p>Ra’s may have his spleen, but Tim has his arm.</p>\n<p>As the numbers tick down to zero, Tim laughs.</p>\n<p>“Checkmate, Ra’s.”</p>\n<p>And the world turns white.</p>\n<p> </p>\n<p> </p>\n<p>Two weeks later, Tim wakes up in his bathtub with a splitting headache and laughter on his lips.</p>\n<p><em>Trust me</em>.</p>\n<p>The video starts, and he watches Tim enter the building.</p>\n<p><em>Trust me</em>.</p>\n<p>Ra’s al Ghul walks out, blood splattered on his face and shirt. He looks directly into the camera and smiles, his eyes glinting.</p>\n<p>\n<em>Trust me-</em>\n</p>\n<p>The building explodes, and the screen turns black.</p>\n<p>\n<em>I’m asking you to-</em>\n</p>\n<p>Dick slams his fist into the table, ignoring the pain that shoots up his arm. He hasn’t been this angry in a long time, too used to swallowing it down in favour of keeping the peace. It’s almost unfamiliar. Jason had always mocked him for being temperamental, back when even the smallest of looks from Brue was enough to make him storm off in a rage. It’s ironic that their positions have changed so drastically.</p>\n<p>But he’ll take anger over grief.</p>\n<p>He replays the video.</p>\n<p>\n<em>Trust me.</em>\n</p>\n<p>Tim walks in. Ra’s saunters out. The building explodes and the screen goes black.</p>\n<p>“Dick.”</p>\n<p>Barbara’s voice is soft, gentle, and he ignores her, rewinding the video again to watch from the beginning.</p>\n<p>\n<em>Trust me.</em>\n</p>\n<p>Tim walks in. Ra’s walks out. The screen goes black.</p>\n<p>He rewinds.</p>\n<p>Tim walks in. Ra’s walks out. The screen goes-</p>\n<p>\n<em> <strong>TRUST ME.</strong> </em>\n</p>\n<p>NO INPUT DETECTED.</p>\n<p>“Dick,” Barbara says again, and he finally turns to look at her, scowling at the unplugged cable in her hand.</p>\n<p>“I wasn’t finished,” he argues.</p>\n<p>“Yes, you are. You’ve been down here for the past ten hours.”</p>\n<p>She wheels over and places a hand on his fist, gently tugging it away from the keyboard. There are heavy bags under her eyes, and he can see the exhaustion in her frown.</p>\n<p>“We’ve watched the footage several hundred times; it’s not going to change. I’ve checked for tampering, editing, everything. It’s the original.”</p>\n<p>He yanks his hand away from her and can’t stop his glare.</p>\n<p>“So what, I should just dust my hands and go ‘oh well, guess another one of my brothers’ got blown up, time to plan a funeral’?!” he hisses out, and she purses her lips, eyes narrowing.</p>\n<p>“You know that’s not what I mean. You’re exhausted, upset and angry. You’re not going to find anything like this, and if you don’t take a minute to think your next words through very carefully, you’ll find every traffic light turning red the moment you drive past it,” she spits back, and for a moment, Dick opens his mouth to retort, the rage bubbling and boiling in his chest-</p>\n<p>“If I may cut in, Master Dick, Miss Gordon?” a cool voice cuts through the silence, and he whips his head around to look at the disappointed face of Alfred.</p>\n<p>And just like that, the anger disappears.</p>\n<p>Because if Barbara looks tired, then Alfred looks wrecked. His eyes are bloodshot, his hands are trembling, and he looks older than Dick’s ever seen him before. Alfred has always been a steady and constant presence in his life, has remained composed and strong through every event he’s been through. He’s the one who picks up the pieces of this broken family and carefully glues them back together, he’s the one who drags them from darkness and despair when they’re too weak to leave, he’s the one who stitches their wounds, cooks their food, cleans their home, who keeps everything running.</p>\n<p>Even after Jason died and Bruce fell apart and Dick refused to come home, Alfred had done his best to appear strong for them.</p>\n<p>Alfred has always been a pillar, but a pillar cannot hold a roof up by itself.</p>\n<p>And somehow, Tim became that second pillar. Dick doesn’t know exactly what went on while Tim was training to be Robin, but there are hints here and there. Tim glares like Alfred and orders them to eat in the same disappointed tone. He has always listened and obeyed Alfred’s orders, has never tried to argue back with him, and used to drink tea with him every Thursday.</p>\n<p>Tim is the one who supported Bruce and let Alfred grieve properly, without having to worry about waking up to the news of Batman’s death due to his own recklessness. When Alfred couldn’t wake Bruce up, it was Tim who would force him out of bed and make him eat. When Bruce refused to stop drinking, it was Tim who helped Alfred empty every bottle as they scolded him. And after Bruce’s... disappearance, it was Tim who supported Alfred while Dick was busy with Damian and his own grief.</p>\n<p>Dick knows that Alfred loves all of them equally, but Tim has been there during some of the worst moments of Alfred and Bruce’s life, and that creates a bond that Dick can never understand. Just like the bond he has with Damian can’t be replicated.</p>\n<p>Dick is Alfred’s first grandchild, the one he scolded for climbing on chandeliers but would push bookcases in safer positions for him to clamber on, who learned how to cook his favourite foods and would sneak him a cookie after patrol. Jason is Alfred’s soft spot, the little distrustful boy who would join him in the kitchen and watch him cook, who he made sure had safe spots for him to hide in when overwhelmed and terrified. Damian is his baby grandchild, spoiled and bratty, who he handles with strict kindness and shows him how to take care of his animals.</p>\n<p>Tim, however, is Alfred’s hope. He’s the little boy who knocked on their door and demanded to speak to Mr Wayne and Mr Pennyworth to scold them for Batman’s violence, the little boy who took it upon himself to handle Bruce in his grief and bring him back when Alfred couldn’t, the little boy who looked at Dick and Bruce and forced them to reconcile. The little boy who proved beyond a doubt that Bruce is still alive, and sent the details needed to bring him back.</p>\n<p>The little boy who walked into a building and never came out. Who Dick failed, over and over again.</p>\n<p>And it’s that that forces Dick to snap out of his anger. Because Alfred has lost yet another grandchild, so soon after losing his son in all but blood, and the last thing he needs to handle right now is another self-destructing Batman.</p>\n<p>“Sorry, Alfie,” Dick says quietly, and Barbara echoes him.</p>\n<p>“I understand that the current situation is... difficult. However, no progress will be made with an empty stomach and an exhausted mind. I have made soup for you both to enjoy, and there are two fresh beds with your names on it. I have spoken to Mr Kent, and he has confirmed that they are currently in the process of following Master... Master Tim’s instructions. Master Bruce shall return soon.”</p>\n<p>His stumble is uncharacteristic, and Dick’s heart lurches and the hoarseness of Alfred’s voice. But he nods regardless and stands up. Barbara purposefully rolls over his foot without looking at him as she heads to the elevator, and Dick swallows his yelp. He kind of deserves it right now, even though the worry is twisting and turning inside his chest.</p>\n<p>After all, there’s been no news. Nothing since the building exploded and they realised that Tim was at the centre of it. He’d almost vomited right there, the realisation that he had lost another little brother to an explosion and a madman sinking into his bones with despair. It had taken a lot of effort to force himself to ask Kon if he could hear Tim’s heartbeat.</p>\n<p>What he learned was as unhelpful as it was concerning. Because Konnor just squinted at him in confusion.</p>\n<p>“I mean, no, but that doesn’t mean much with Rob,” Kon explained, looking for the world like he hadn’t just witnessed his best friend get blown up. And Dick... didn't know how to respond to that.</p>\n<p>“Elaborate,” Dick had gritted out, mind swirling. Kon blinked, and made a non-committal noise.</p>\n<p>“His heart sometimes stops. Like, I’ve heard it happen while he’s right in front of me. It can disappear from anywhere between a few minutes to like... a couple of months. So me not hearing his heartbeat doesn’t really tell us much. But it’s Rob. He’s always got a plan.”</p>\n<p>Dick almost strangled his former teammate.</p>\n<p>“Do you know why?”</p>\n<p>And Konnor shrugged.</p>\n<p>“It’s Tim, man. Knowing him it’s probably some gadget he made. I didn’t really ask. He gets cagey if you try and find out his favourite colour let alone the weird shit that his body does. Cassie once asked him if he was allergic to anything and he tried to make her sign an NDA,” he replied, as though it explained anything.</p>\n<p>To be fair, it kind of did.</p>\n<p>Tim has never been the most open. He’s always been a miniature adult, face solemn and actions measured, and sometimes Dick forgets that he’s only 17. But he thinks that how his little brother prefers it. He soaks up affection and attention when possible, but also shies away from it the moment he thinks he’s imposing. He’s paranoid, obsessive and borderline smothering with how he keeps an eye on the people he loves, and yet he reacts with confusion when someone tries to ask how he is.</p>\n<p>Sighing, Dick turns away from the screens and begins to head towards Alfred. Babs and Alfred are right; he’s too exhausted and upset to continue obsessing over this.</p>\n<p>And then the computer dings.</p>\n<p>Dick cranes his head back towards the desk, looking away from Alfred’s judgemental stare and Barbara’s thinned lips.</p>\n<p>“Surely that can wait,” Alfred says in a voice that is certainly not a suggestion.</p>\n<p>“It might be important?” Dick offers, and he sheepishly takes a step back, wincing at his grandfather’s irritated huff.</p>\n<p>“Just like his father,” he thinks he hears murmured in the distance, and Dick pretends not to hear him. He won’t take long, he tells himself. He just needs to-</p>\n<p>There is a new message in the family dropbox, signed with Tim’s code, and Dick’s heart stutters.</p>\n<p>His arm darts forward to open the message and a video begins to play, his little brother’s voice filling up the cave. Dick scrambles to reconnect the screen to his computer, and when it does, the sight of Tim’s face is the best thing he’s ever seen. He looks exhausted, blood and bruises splattered across his face, but he is alive.</p>\n<p>“Hey everyone, sorry for the silence but getting to a secure location has been... trying. But this is my ‘I survived and am okay!’ recording for you guys. So... I survived and am okay! It took a lot of work and taking some risks that in hindsight, probably shouldn’t have worked, but they did.”</p>\n<p>“You reckless moron,” Barbara whispers wetly, and Dick has to choke back a hysterical laugh.</p>\n<p>“Anyway, I’m currently going underground for a bit, because Ra’s will undoubtedly realise I survived soon, and it’ll be safer for me to be... out of the way when he does. He’ll get over it eventually. Until then though, I’ll be out of contact. But no matter what you might see or think, I’m alright. I’m safe, secure, and recovering,” Tim reassures, “and I’ll be back soon. In the meantime, get Bruce back and watch out for the League. Stay safe, listen to Alfred, and tell Damian he’s an asshole for me.”</p>\n<p>Dick can’t stop the disbelieving sob that escapes his chest, cheeks damp, and he turns to look at Barbara and Alfred. Barbara has already moved back to the computer and is scanning through the metadata, trying to pinpoint a location. Alfred however, looks like a strong wind could tip him over.</p>\n<p>“Oh my dear boy,” he murmurs, voice thick, “come back home soon.”</p>\n<p>Dick moves to support Alfred, who gives him an unimpressed look despite the wetness in his eyes, but grips his hands tightly regardless.</p>\n<p>“We’ll get him back, Alfie,” he promises, and the older man huffs.</p>\n<p>“Of course, Master Dick. Now, with that good news, I do believe some food is in order,” Alfred says pointedly, shooing him towards the elevator, and Dick grins. “Care to join us, Miss Gordon?”</p>\n<p>“Just a moment,” she replies distractedly, still scanning through lines of hidden data before huffing in frustration. “There’s no location or date attached.”</p>\n<p>Dick pauses, trading a look with Alfred.</p>\n<p>“Is that an issue?”</p>\n<p>And Barbara... Barbara hesitates.</p>\n<p>“It shouldn’t be,” she finally says, “and even if it is, I’m too tired to dig further.”</p>\n<p>She shuts the computer down before he can stop her, quickly wheeling over to join him and Alfred. Her eyes are narrowed and she’s chewing on her lip, fingers tapping against her arm rests.</p>\n<p>“Barbara,” Dick starts to ask, but she cuts him off.</p>\n<p>“I know. But not now. I’m tired, you’re tired, and we deserve to have some hope.”</p>\n<p>Alfred’s mouth is in a tight line, even as he nods and agrees: “Quite right. This can be discussed tomorrow, after food and rest.”</p>\n<p>Dick can’t argue against that. He probably should. Batman would dig deeper and poke and prod until Barbara finally explained what had her so nervous but-</p>\n<p>He isn’t in the suit or cowl right now. He <em>isn’t</em> Batman right now. He’s Dick Grayson who wants to believe his little brother is alright.</p>\n<p><em>Trust me</em>.</p>\n<p>“Yeah,” he replies softly, “alright.”</p>\n<p>They eat in relative silence, Damian having been put to bed long ago, despite his protests. They haven’t told him about Tim yet, but a part of Dick doubts that his baby brother would even care. It’s an awful thought, especially since he is getting better with emotions, but there has always been a dismissiveness to Damian’s treatment of Tim that he’s never applied to anyone else. Oh, he’s rude and uninterested in almost everyone, but the way he sees Tim goes beyond that.</p>\n<p>“He is a superfluous addition,” Damian had scoffed out, almost confused after Dick scolded him for riling Tim up. “I do not understand why you insist on keeping him.”</p>\n<p>Dick has no idea where he’s getting these ideas from, and nothing he says or does seems to change Damian’s mind. It only got worse after Dick gave him Robin, and while he doesn’t regret doing it, he know that it put Tim in an even worse position than before.</p>\n<p>So when Damian wanders into the kitchen for breakfast the next day, Dick just... doesn’t say anything. He should. He knows he should. He remembers his own fury over Bruce’s silence when Jason died all too well, but right now, he understands.</p>\n<p>He hates it.</p>\n<p>But he can’t deal with his comments this morning, is too exhausted to fall into the circular argument they inevitably have about Tim. Alfred gives him a look as he hands him his coffee, and Dick grimaces, but he stands by his choice.</p>\n<p>The old man has never approved of Damian’s treatment of Tim, nor has he found Dick’s methods productive. But there’s not much either of them can do. Scold too much, and Damian may decide to go back to his mother and grandfather. Don’t say anything, and Tim thinks they agree with what Damian says.</p>\n<p>It’s an exhausting balance.</p>\n<p>More than that, it’s an unfair one, but it’s the best Dick can do right now. He’s juggling a job, a traumatised child, and Batman. Picking and choosing his battles is the only way he can survive without breaking down.</p>\n<p>Damian grumbles as he prepares for school, trying to argue that his expertise will be needed after the involvement of his grandfather, but unless they occur literally next door to them, explosions have never kept Gotham schools closed, and Dick needs him out of the manor while he investigates Tim. His baby brother must be able to tell that something is up, and despite his protests, he goes with minimal fussing.</p>\n<p>“I do not see the point,” he complains, but he lets Alfred herd him to the car.</p>\n<p>With the house empty, Dick finally heads to the BatCave. Barbara is already there, face grim as she lifts a cup of coffee to her lips. He takes a deep breath, and settles into detective mode.</p>\n<p>“What caught your attention last night?”</p>\n<p>She doesn’t reply immediately, fingers hovering over the keyboard as she visibly tries to gather her thoughts. He swallows.</p>\n<p>“The main issue,” she begins slowly, “is that it’s a recording. Which means that there’s a chance this was made... before the explosion. The fact that there’s no date or location is suspicious, especially since this is meant to reassure us.”</p>\n<p>“It’s Tim. He probably knew he wouldn’t be in good enough shape to call us, so he prepared one beforehand.”</p>\n<p>“It could be. But if he thought it would distract us from looking for Bruce, do you honestly think he wouldn’t make a message to tell us he’s okay, even if he isn’t?”</p>\n<p>Dick’s heart pounds, and he can feel the creeping fear begin to claw its way up his throat. This was the boy who took eight months to convince he wasn’t imposing if he stayed a night at the manor after all.</p>\n<p>But-</p>\n<p><em>Trust me</em>.</p>\n<p>“Maybe it was recorded before... everything,” he hesitantly suggests, “but you know how he is with contingencies. Tim’s definition of a risky action is a normal person’s carefully thought out decision. He had 77 contingencies just in case Bruce didn’t listen to him when he first popped up.”</p>\n<p>Barbara hums in agreement, but there’s still an uncertainty in her eyes that lingers.</p>\n<p>“Perhaps, but... Why remove the identifying data? You could argue it’s to prevent Ra’s from tracking him down, but-,” she cuts herself off and pinches her nose, the gesture a familiar sight. “He never once mentions the explosion, Dick. He just says he survived.”</p>\n<p>Dick walks up to her and puts a hand on her shoulder.</p>\n<p>“Tim is an enigma on the best of days,” he offers. “I don’t think even Bruce fully understands him sometimes.”</p>\n<p>“Bruce can barely understand himself,” she grumbles back, but her shoulders relax and the tension slowly dissolves from her face.</p>\n<p>“You’ll have to say that to him when we... when we get him back,” he tries to joke, and she lets out a small huff of amusement, a smile on her face.</p>\n<p>“Sure. I’ll put it on my list.”</p>\n<p>He laughs.</p>\n<p>“You have a list of things you’re going to say to him?” he asks incredulously, heart lifting at the sight of her smirk.</p>\n<p>“Of course. Jason and I trade tips,” she says flippantly, and Dick pauses.</p>\n<p>Jason. Someone needs to tell Jason about...</p>\n<p>Well. Not Tim. Not yet.</p>\n<p>But Bruce.</p>\n<p>“Can you contact him? To let him know about... B?”</p>\n<p>“Already done. Since he’s with the Outlaws right now, I figure it was the best time since they can handle any... fallout,” she explains tentatively, and he sighs.</p>\n<p>“What’s the status on that by the way? Do we have a timeframe?” he asks, and she nods.</p>\n<p>“Tim’s notes gave the Justice League the last pieces needed to safely bring him back. Cyborg said it could take anywhere between three days and a month, but he’s leaning towards a week. Green Lantern agrees with the estimate,” she details, watching him sag over the desk with a soft look on her face.</p>\n<p>They’re so close. All of sudden, Dick feels exhausted, every worry and doubt slamming into him with the force of a drugged-up Bane, and he has to force himself to keep standing and not crumple like a used tissue.</p>\n<p>“He’ll be home before you know it,” she says softly, reaching over to lace her fingers with his. He doesn’t quite trust his voice and nods.</p>\n<p>Last stretch, he tells himself, and then you’ll have your family back.</p>\n<p>For once, it doesn’t sound like a lie.</p>\n<p> </p>\n<p> </p>\n<p>“There is something seriously, clinically wrong with you.”</p>\n<p>Those are the first words Pru says to him as he exits the blood-spattered bathroom, yanking on a pair of pants and a shirt.</p>\n<p>“Drowning at five because your negligent parents couldn’t be bothered to supervise you will do that to a person. What’s the date?” Tim shoots back, grimacing as he catches sight of himself in a mirror. He looks like a corpse, but his heartbeat is strong and steady, he has all his limbs, and he isn’t with Ra’s, so it’s a win.</p>\n<p>Pru does not agree.</p>\n<p>“You had me steal Lazarus Water, told me to cut your arm off at such an angle that I would hit your heart, and made me dunk it in the water. Then you made me cut pieces of you up to put in jars like some sick trophy. While making me record it. You get how fucked that is, right? Like, childhood trauma is not enough to explain how bloody deranged that is,” she snaps back, and he shrugs, shuffling over to boot up his computer and see what he missed. Asking Pru to help him with his plan had been a gamble, but she owed him.</p>\n<p>The date tells him that it’s been two weeks since his confrontation with Ra’s. Two weeks is... both longer and shorter than expected. He’ll have to test if it’s the Lazarus Water or the damage that slows down his resurrection.</p>\n<p>“I need to see how exactly my body reacted to a prolonged state of death and complete destruction. Recording the process just made it easier to see how far my ability can go,” he explains to her as he scrolls through various news sites. The explosion has taken up most of the headlines, with relief efforts still going strong. Casualties are lower than predicted, and the Bats have helped mitigate the damage. The biggest scandal is the fact that reconstruction has had to be halted due to the discovery of cheap unstable materials being used by Gotham Construction Co. hired by specific government members with stocks in the company, and the papers are practically burning with accusations.</p>\n<p>His succession as the majority shareholder of Wayne Enterprises is a minor footnote in comparison, preventing too much drama over his disappearance. There are some speculative articles, but nothing big thankfully.</p>\n<p>“Yeah, well, it was freaky enough to watch live. Do you know how many fingers I cut off? 18. There are 18 fingers in various jars around here, and you grew them back in a matter of minutes. I’d cut one, look away, and bam. Already back.”</p>\n<p>Coming up with a plan that would trick his healing ability into regenerating a new arm had been difficult enough, and yet it seemed like he had managed.</p>\n<p>“Huh. Ra’s mentioned that my spleen healed despite being destroyed by him, but I would have thought my regeneration would have ignored additional injuries during the healing process. Speaking of, I’ll have to check if it came back or not.”</p>\n<p>Tim clicks open the video feed of the bathroom, ignoring the sputtering sound that escapes the former assassin.</p>\n<p>“I’m sorry, did you say you made me cut pieces of you off <em>without knowing if they’d grow back</em>?”</p>\n<p>He waves her off.</p>\n<p>“When you cut off my arm and it came back, it was clear that my ability considered it a part of the injury that killed me. It wasn’t too difficult to extrapolate how my body might react after that. Besides, I drew up schematics for prosthetics just in case. I was already taking a big gamble with the arm, why not go for a few fingers too?” he says absentmindedly, watching with curiosity as his body slowly regenerated on the screen. “You were right. The pieces come back in chunks, like a laggy reload.”</p>\n<p>The recording is absolutely fascinating. Instead of growing or healing like a body part, his extremities appear out of thin air from one moment to the next. First his fingers, then his shoulder, then his torso and other arm, then his legs and feet, and finally, his neck and head. He isn’t sure how his internal organs came back, and mentally jots down a reminder to test it someday.</p>\n<p>“Okay genius, if it considered your arm part of the lethal injury, then why the fuck did your spleen not come back after you died in the desert? The damage done to it should have been considered a part of the lethal injury,” she snaps out, and he spins around to look at her.</p>\n<p>“Simple answer: Ra’s lied. Complicated answer: carrying you back to the hotel with a lethal injury was apparently enough to be considered a second death blow. Hence why I died twice rather than just once. Of course, I didn’t know that at the time, so Ra’s took the opportunity to get a complete non-vital organ from me with a somewhat believable explanation,” he points out, before blinking. “Speaking of, Pru, did you by any chance see an ultrasound machine around? I want to know if I regrew my spleen or not.”</p>\n<p>She just stares at him.</p>\n<p>“I don’t know how to respond to that, so I’m just going to reiterate: no amount of therapy can fix you. You are broken. <em>Broken</em>. When you finally snap and decide to take over the universe, I hope you remember that I called it and helped you out.”</p>\n<p>She storms over as she complains; shoving him away from the computer and shutting it down before yanking him out of his chair. He yelps at the harsh movement, stiff muscles protesting as she herds him to the kitchen.</p>\n<p>“I wasn’t finished!” he complains, and she smacks his head, glowering at him.</p>\n<p>“I was! What are you even going to do with it, upload it to a fucking snuff website?”</p>\n<p>Tim pretends to consider the idea.</p>\n<p>“I could make some extra cash...” he ponders, grinning at the sheer disgust lighting up her face.</p>\n<p>“No wonder you can’t die, you’re so bloody insufferable that not even the universe wants to deal with you,” she hisses out, but the words are weakened by the box of cereal and bowl she slams down in front of him. “I hope you choke.”</p>\n<p>“I did that once, it wasn’t fun. I still can’t eat a kebab without gagging.”</p>\n<p>He deserves the slap this time.</p>\n<p>“I’m making you pay me double for all this, I hope you know,” she grinds out, leaning against his fridge, and he nods, spooning a portion of food into his mouth.</p>\n<p>“Fair enough. Anything notable happen?”</p>\n<p>“Ra’s al Ghul apparently threw a tantrum so severe it left multiple operatives dead when he realised you duped him, and you’re a week away from being legally declared missing. Officially, you’re on a journey to say goodbye to your youth before joining the corporate world. Unofficially, the Bats haven’t decided if you’re dead or not yet, even after making me send that message to them. That Oracle girl is fucking good, I nearly got caught several times,” she grumbles, before pausing. “Oh, and Daddy Bats is back.”</p>\n<p>Tim slams his leg into the table in surprise.</p>\n<p>“Ow- fuck- Bruce is back?” he asks, trying not to sound too desperate, but given Pru’s mocking grin, he’s obviously failed.</p>\n<p>“Yep. Been in recovery, but the whole Justice League got together to yank him out. From what I’ve managed to glean while keeping an eye out, your notes were the last pieces they needed to get him out safely, and let them know how to deal with the Omega Particles.”</p>\n<p>Tim leans back, letting the spoon drop into his bowl. Well. At least he was useful in some way.</p>\n<p>He should be relieved. He <em>is</em> relieved. But there’s a tangled knot of emotions he really doesn’t want to examine. Beyond the relief and joy, there’s bitterness and anger and resigned acceptance. Sure, Bruce is back and he did help in the end, but it’s also a reminder of how little everything he did mattered. It was all for nothing. All his notes, his research, his isolation and compromises, and it meant nothing. Worse than that, it put the people Bruce loves in danger.</p>\n<p>But Bruce is back. He’s home, he’s safe, and he has his family back.</p>\n<p>Tim’s mission is done.</p>\n<p>For a moment, he contemplates just... leaving. Packing up his stuff, burning his safe houses, and moving to the cottage he bought under an assumed name a few years back. He doesn’t have to tell anyone he’s alive, and while it would be painful to lose another person in another explosion, they would heal. Bruce has Damian, Dick, Jason, Alfred, Kate, Steph, Barbara, Cass-</p>\n<p>This could be a clean break.</p>\n<p>“Oi, fingerboy, do you want cereal or mush?” Pru’s voice snaps him from his thoughts, and he looks up to see her glaring at his bowl. He makes a show of taking a big bite from the soggy mess, and she gags. He grins at her.</p>\n<p>“You can chop me into pieces without flinching, but some mushy cereal gets to you?” he teases, pushing down all thoughts of running away.</p>\n<p>“Fuck off,” Pru grumbles back. She begins to talk about other updates before moving into anecdotes about her worst food experiences. He listens to her with half an ear as he mentally outlines a script to use when he finally calls the Bats, giving appropriate hums here and there. </p>\n<p>As easy as it would be, Tim can’t run away. He can’t do that to them. It’s too cruel, and he knows that the guilt would crush Dick and Bruce. And Alfred, fuck, Alfred would be gutted. He loves them too much to put them through that.</p>\n<p>All too soon, he’s finished his food and Pru has run out of stories. She watches him carefully as he cleans up the dishes, something unreadable in her eyes.</p>\n<p>“Well then,” she finally says, “I should be off. I expect the money in my account today, yeah?”</p>\n<p>Tim pauses. It’s strange. He’s gotten used to Prudence, despite their differences, and she knows him better than anyone else in the world right now. It’s jarring that this strange assassin has watched him die, has killed him because he asked her to, has defected from her former master because she believes she owes him a debt.</p>\n<p>He asked her to steal jars of Lazarus Water for him, and she did.</p>\n<p>He could ask her to stay. Could offer her more money to stick around, to go out and cheer her on as she suplexes criminals. He could do that.</p>\n<p>But he won’t. Because he knows that she wouldn’t stay. Maybe she’d agree to give it a shot. But staying in one place would chafe at her, would make her grow resentful. And while they’ve been through a lot together, it doesn’t necessarily mean that she wants to stick around.</p>\n<p>So instead he gives her a nod.</p>\n<p>“You’ll get the money as soon as possible. See you around, Prudence.”</p>\n<p>She tosses up a lazy wave and leaves. She doesn’t look back, and he doesn’t watch her go. It doesn’t exactly feel final. But he knows all too well how easily goodbyes can become permanent.</p>\n<p>They’ll either see each other again, or they won’t. There’s no point in overthinking it, not when there are more important things to do. So he heads back over to his computer, encrypts the recording and downloads it onto an innocuous looking USB stick. He finds the jars with his fingers in the fridge, and takes a moment to swear violently at Prudence. She agreed to take one of them and dump it somewhere, but he has to deal with the rest somehow. For now, he shoves one in the panic room, deciding to come up with locations later.</p>\n<p> </p>\n<p> </p>\n<p>He’s stalling.</p>\n<p>Tim really should call his family.</p>\n<p>He transfers the money to Prudence instead, before opening up a map and noting down good places to stash his jars, all while pretending that he isn’t a coward. He continues to do busywork until he can’t anymore, his burner phone staring accusingly at him.</p>\n<p>“Fine,” he mumbles, reluctantly picking it up. Stuffing his wallet in his pocket, he yanks on a coat, hat and sunglasses, before finally leaving his safehouse for the first time in two weeks, wandering down alleyways and random corners. He goes to a random diner, orders a coffee, and switches on his phone.</p>\n<p>It immediately begins to ring.</p>\n<p>Tim takes a deep breath.</p>\n<p>“I can explain-,” he starts to say as he accepts the call, and is immediately cut off.</p>\n<p>“<em>Two weeks</em>,” Barbara hisses, “two <em>weeks</em> with only a vague and suspicious recording that didn’t prove anything about your status. You think I don’t know that you made that before the explosion? You did a good job fooling Dick, but you are a decade too early to try and pull the wool over my eyes, Tim.”</p>\n<p>He winces.</p>\n<p>“I had to go full faraday,” he tries to offer, but it sounds weak to his ears, and he can practically imagine the irritated twitch of Barbara’s eyebrow.</p>\n<p>“Get in the goddamn car, Tim.”</p>\n<p>He’s about to ask what car, when he spots Dick’s Ford Fiesta skid in front of the diner. Tim feels nauseous, but he drops some cash and a tip on the table, feeling like a prisoner on death row as he shuffles out of the door. He’s barely stepped past the threshold before he’s being swept into a massive hug, familiar arms trembling as they hold him tight.</p>\n<p>“Never do that again,” Dick croaks out, “do you understand me, Timmy?”</p>\n<p>With his face pressed against his big brother’s chest, there isn’t really anything else Tim can do but nod. Dick is shaking, he realises distantly. He’s seen Dick upset and worried before, but this... this goes beyond that.</p>\n<p>Tim did this.</p>\n<p>And with that thought, he finally clings back, fingers digging into Dick’s jacket as he tries not to cry.</p>\n<p>“I’m sorry,” Tim whispers, and his brother’s arms tighten.</p>\n<p>He’ll remember to be angry later. There’s a lot unsaid after all. But right now, all that matters is his big brother and the fact that Tim finally feels <em>safe</em>.</p>\n<p>When he finally pulls back, Dick’s eyes are red, and he keeps looking him up and down as he checks for injuries.</p>\n<p>“You’ll explain when we get home?” he asks simply, and Tim pauses.</p>\n<p>“As much as I can,” he finally agrees, and he can see that Dick wants to argue, but he presses his lips together and nods.</p>\n<p>“Bruce has been asking after you,” he offers instead, unlocking his car and waving at him to get in. Tim tries not to flinch as he settles into the passenger seat.</p>\n<p>“How is he?”</p>\n<p>“All things considered, pretty good. Alfred has barely left his side, and Dami-,” he stumbles over his words, suddenly hesitant as he remembers Damian and Tim’s less than cordial relationship.</p>\n<p>After everything that’s happened, Damian’s hostility seems... unimportant. Tim will probably take that back the moment he has to deal with the little brat again, but right now he can pretend that they’re brothers. That he’s seen as something other than a nuisance.</p>\n<p>“And Damian?” Tim prompts, and the sheer relief in Dick’s sagging shoulders makes something sour rise in the back of his throat. He swallows it down. He’s caused enough trouble as it is.</p>\n<p>“Dami keeps letting Titus wander into Bruce’s room and using it as an excuse to see him,” Dick explains, a small grin on his face, and Tim lets a soft laugh escape his chest. He can imagine Damian bristling at the mere suggestion that he’s concerned about Bruce, and it’s enough to wash away the rest of the bitterness.</p>\n<p>“And... the others?”</p>\n<p>It’s a loaded question. Is Jason there? Is Cass? Steph? Dick glances at him from the corner of his eye.</p>\n<p>“Jason’s back,” he begins slowly, “and he keeps throwing rocks at Bruce’s window. Steph shows up now and then. Cass’ home too. When she isn’t stuck to Bruce like a limpet, she’s... trying to find you.”</p>\n<p>Silence falls between them. Tim can barely breathe, something heavy stuck in his throat, and Dick focuses back on the road, knuckles white around the steering wheel.</p>\n<p>“Look, Tim. Babs, Alfred and me... we haven’t told anyone what happened. About the... explosion. All we said is that you confronted Ra’s, checked in with us, and then went underground to recuperate. But an explanation would be... really nice.”</p>\n<p>Tim digs his fingers into his thighs, the subtle accusation in Dick’s words ringing clearly in his hears.</p>\n<p>“I mean, that’s pretty much what happened,” Tim forces out, and his brother’s jaw clenches.</p>\n<p>“Don’t pull that shit with me, Tim. You lied to me. You told me to go to Burnley when you were nowhere near there.”</p>\n<p>Tim tries to stay calm.</p>\n<p>“It was advantageous-,” he starts to say, but is immediately cut off by Dick slamming his hand against the steering wheel.</p>\n<p>“Bull<em>shit</em>!” he shouts. “You <em>knew</em> Ra’s was going to pull something like that, you <em>knew</em> I would have stopped you if I was there, and you <em>knew</em> that there was a good chance of you dying. Why else would you record a video beforehand? Did you have another message ready for later, after Bruce was rescued, telling us that you died from your injuries?”</p>\n<p>Rage bubbles in Tim’s stomach, and he can’t stop himself from trembling. He has to swallow multiple times to prevent himself from screaming back, and even then it takes a tremendous amount of effort to stay calm.  </p>\n<p>“Focus on the road,” he says instead, voice flat.</p>\n<p>Dick scoffs, and it echoes like a gunshot.</p>\n<p>“I can’t fucking believe you. You know what, fine. You can explain yourself when we get back.”</p>\n<p>And Tim-</p>\n<p>Tim snaps.</p>\n<p>“Stop the fucking car,” he hisses, and it’s startling enough that Dick does as he says. He yanks open the door and storms out, ignoring Dick’s loud and furious protests.</p>\n<p>“I’ll call later. Don’t come after me,” Tim tosses back, and the other man yells something back at him. But he can’t bring himself to care.</p>\n<p>Tim fucking died for them. Got himself blown up into dust, had to cut off his own arm as a contingency to regenerate, and once again, it’s all about them. Neither Barbara nor Dick asked him if he was okay. Neither of them told him that his notes helped get Bruce back. They didn’t even say they were worried about him.</p>\n<p>If his head were clearer, then he would know that his anger is blurring the truth, would acknowledge that their curtness and frustration comes from a place of worry and fear. But right now, Tim doesn’t want logic. He wants to be angry. He wants to be hurt. He wants to scream and cry and be told that it’s okay.</p>\n<p>He wants Dick to chase after him and apologise, wants another hug, wants to see Cass and Alfred and Bruce, wants to hear them fuss and worry and-</p>\n<p>Tim lets out a yell of frustration and kicks a dumpster, uncaring of the way his foot immediately throbs in response. Despite the stink of Gotham’s alleyways and trash, he sinks down to the floor and buries his head in his arms.</p>\n<p>It doesn’t matter what he wants. He really should know better by now.</p>\n<p> </p>\n<p> </p>\n<p>The next few months are numbing. Tim throws himself in WE and Red Robin, interacts as little as possible with the Bats, and discovers that his spleen is still missing, because why would his powers ever make things easy for him.</p>\n<p>Bruce only seeks him out once, clasps a warm, heavy hand on his shoulder and tells him he did a good job. Tells him that he’s proud, that he’s sorry he had to put Tim through all of that, that he can rest easy knowing that Red Robin is around.</p>\n<p>It is everything Tim has ever wanted, and yet it feels like he’s drowning all over again. He waits for something more, for Bruce to scoop him into a hug and tell him that he’s done enough, that he can come home, that he doesn’t have to be Robin to be his son.</p>\n<p>An alert goes off, and Bruce disappears with one last look. He doesn’t contact him again, and Tim doesn’t know what he expected.</p>\n<p>The message is clear. His job is finished. He’s not a Wayne, not a Robin, not family. He’s just the insufferable neighbour kid who doesn’t know when to let go. It’s about time he understands that.</p>\n<p>Outside of WE and their night jobs, they don’t talk.</p>\n<p>He only teams up with the others if he absolutely has to, and ignores any tentative invitation to go back to the manor. The only ones he tolerates are Cass and Alfred, but even then the apathy makes it difficult to understand that they care. Cass brings him his violin once, a silent request for him to play.</p>\n<p>It takes everything inside him not to hurl it to the floor.</p>\n<p>Instead, he gently gives it back to her, fingers trembling from the urge to destroy it and watch it splinter.</p>\n<p>“I’m not really up to playing lately,” he says, and he can feel her sorrow even through the face mask. She holds onto him tightly, voice a mere whisper as she tells him that he’s her brother over and over again. He just clings back, a lump in his throat. She tries to be there. She’s always known when something is wrong. But she still has to finish things up in Hong Kong, and while she silently offers over and over to stay and let someone else deal with it, he refuses.</p>\n<p>Cass leaves reluctantly, and makes him promise that he’ll be okay. That he’ll still be here when she gets back.</p>\n<p>“I’ll do my best,” he offers, because he can’t lie to her. He won’t lie to her.</p>\n<p>But it’s enough for her, and she goes back to Hong Kong.</p>\n<p>Patrols are quiet after that, beyond the shoot-outs and the pained grunts and the screams. Tim watches Red Hood slowly re-enter the fold, still prickly and green, but he’s trying, and that’s what matters. Despite a few false starts, Batman has adapted to his new Robin without much issue, and it makes something in his stomach cramp when he sees how well they work together. Oracle is curt with Red Robin, giving him the bare minimum when he asks for extra information with his cases, and eventually, he stops contacting her outside of patrol at all. He does not talk to Spoiler at all, and she keeps her distance.</p>\n<p>Nightwing pretends nothing has happened, but he’s petty and makes comments, trying to push and prod him into saying something.</p>\n<p>Tim is used to being silent though, and he refuses to engage. There’s no point.</p>\n<p>Eventually, it comes to a head, and it’s Robin who confronts him.</p>\n<p>“You have upset Grayson,” the younger boy says, eyes shining with disdain, and Tim wants to punch him. He settles for ignoring him instead.</p>\n<p>Robin clicks his tongue.</p>\n<p>“Drake, this behaviour is beyond childish. If you are really so insistent on being a nuisance, then you should at least do the rest of us a favour and go away.”</p>\n<p>“Codenames,” is all Tim says in reply, and he can practically see the boy’s rising rage. Before he can begin to spew more vitriol however, Tim grapples away, already planning a route away from the others to finish his patrol in peace.</p>\n<p>Except the hook never connects.</p>\n<p>One moment he’s swinging securely and the next his line has been cut, and he’s falling. A glint of a birdarang reflects in the moonlight, answering his question of how this has happened. For a split second, he thinks about just letting himself hit the floor and forcing Damian to deal with the aftermath of killing Tim. Make Damian explain to everyone that he cut his line and let him fall, just like Dick’s parents.</p>\n<p>It is so, so tempting.</p>\n<p>But he can see Robin’s wide eyes, mouth slack and panicked, and there is regret there. For all his words and violence, Damian is barely ten. He’s a child.</p>\n<p>So Tim latches onto a window sill, grunting as his shoulder is almost yanked out of its socket from the force. It takes a moment for him to scrabble to safety, and by the time he lands on the street, Robin is already there.</p>\n<p>“You are making mistakes,” he tries to huff out, but Tim can hear his voice trembling. “On a normal day, you would have been able to react appropriately.”</p>\n<p>It’s as close to an apology he’ll get, and Tim-</p>\n<p>Tim is <em>tired</em>. He is so, so tired. For once, there is no rage. There is no anger or bitterness or betrayal. Just a bone-deep exhaustion that he hasn’t been able to escape since he first drowned at five years old.</p>\n<p>“Don’t do it again,” is all he says, and Robin jerks his chin down.  </p>\n<p>Damian stops antagonising him after that, and Tim doesn’t know if he should be relieved that it took another assassination attempt to make him stop, or infuriated that he has to come close to dying before anyone gives a shit.</p>\n<p>He settles on apathy. There’s no point in caring.</p>\n<p>Tim goes to work, he goes out at night, he lets himself get shot and stabbed and beaten before he crawls back to his safehouse and waits for oblivion. Some days, it’s tempting to pick up the handgun in his evidence box and finish the job, just so he doesn’t have to think for a couple of hours. But the hassle of having to deal with the subsequent explanation as to why a bullet is missing is too much effort. So instead, he scatters some of the other fingers, fends off assassins trying to kill him and drag his body back to Ra’s, and pretends that he isn’t considering his Atlas contingency.</p>\n<p>It wouldn’t be difficult to piss off Black Mask as Tim Drake and get the Gotham Bay Send-Off. He has to admit he’s interested in seeing how his power deals with concrete shoes.</p>\n<p>It’s not until he gets a letter from Gotham City Hall at his civilian address that things change. Apparently there’s been a clerical error with his emancipation paperwork, and they need him to come down and verify his identity. In any other case, it would be such a blatant trap that Tim would laugh. Except it isn’t. He double, triple-checks just in case, and nope, it’s the usual bureaucratic fuck-up that every local government experiences.</p>\n<p>It’s irritating, but if it means ensuring his emancipation sticks, then he’ll deal. He goes there after work, letting himself leave before 5pm for once, and the suspicious shock on Tam’s face makes him plan to do it again.</p>\n<p>Gotham City Hall is in a constant state of repair, given the frequency of attacks launched against it, and this time is no different. Construction beams and exposed rebar poke out everywhere, there’s yellow tape declaring certain areas off limits, and the poor teller looks one bad customer away from going postal. Tim sighs, and settles in for a long wait.</p>\n<p>The line moves slowly, and the atmosphere of frustration and monotony is practically tangible. A lady argues with the teller about a parking ticket, asking why she has to pay when it was Bane who pick up her car and tossed it in a no-parking zone. A young man requests paperwork to transfer his city records to another town, explaining to the uncaring teller that he’s moving away.</p>\n<p>Finally, it’s Tim’s turn.</p>\n<p>“I’m here to fix an error with my emancipation filing,” he says, and the person at the desk grunts.</p>\n<p>“Go to floor 3, the manager will help you directly.”</p>\n<p>Tim thinks he understands why people become supervillains.</p>\n<p>He wanders to the stairway, dodging snapped off rebar and pipes as he climbs the stairs, ignoring the gentle croaking of broken scaffolding. The lights have been smashed, and they’ve hung up torches as a replacement. He scoffs, and the building seems to groan in agreement.</p>\n<p>He reaches the second floor, and observes the bent metal beams above his head with trepidation. Something about them look familiar, and he racks his head trying to recall why. One of the torches sways, a beam of light hitting the sheen of metal.</p>\n<p><em>GCC </em>is written in white, blocky letters.</p>\n<p>GCC. GCC.</p>\n<p>Gotham Construction Co.?</p>\n<p>Why would that catch his attention?</p>\n<p>A headline flashes in his mind, and despite his training, he freezes.</p>\n<p>The metal creaks ominously.</p>\n<p>Oh.</p>\n<p>Oh no.</p>\n<p>And before he can even move, a cracking sound echoes through the stairwell, bouncing off the walls like a gunshot. He watches with slow realisation as a beam snaps off from where it’s bent, hurtling down towards him. One moment, he’s standing, and the next he’s on the floor, head swimming and in agony. Pain radiates from his torso, and yet, he cannot feel a single thing below his ribcage. Blinking out the blurriness from his eyes, he chances a look at the damage.</p>\n<p>Or tries to at least.</p>\n<p>“You have got to be shitting me,” he wheezes out.</p>\n<p>The metal beam currently lodged in his body and blocking his vision doesn’t reply, too busy pinning him to the floor like an insect. With trembling fingers, he gently prods his back to see how deep the beam has gone. His hand touches metal, slick with blood, and Tim swallows.</p>\n<p>It’s punched a soccer ball sized hole straight through his flesh and spine, burrowing out of his skin and into the ground like the world’s most morbid flag pole.</p>\n<p>The Gotham Bay Send-Off wouldn’t have done this to me, he thinks to himself, slightly hysterically, at least then I’d keep my spine.</p>\n<p>The only relief is the thought that the damage done will most definitely count as a part of a fatal injury. Less relieving is trying to figure out how the fuck he’s going to dislodge a giant beam from his body while paralysed and severely injured.</p>\n<p>For a moment, he thinks about calling out for Kon. But he’s off world at the moment, on a trip with Clark and Jon to learn strength control. He doesn’t really need to be there for it, but he had been delighted that Clark had even offered, though he pretended he didn’t care. So no Kon.</p>\n<p>“Shit,” Tim hisses, the taste of blood thick in his mouth. “Shit.”</p>\n<p>Twelve years. Twelve years he’s managed to do this without interference or anyone noticing. Ra’s doesn’t count. And one metal beam has ground that achievement into nothing.</p>\n<p>He closes his eyes. Takes a deep breath, and instantly regrets it, pain stabbing through his lungs and into his throat. His vision swims and blurs, and he can feel his body shutting down.</p>\n<p>With rapidly weakening strength, Tim activates his emergency beacon and silently apologises to whoever responds to his call.</p>\n<p>Bruce has many regrets. When you reach his age, it’s hard not to look back and wonder why he chose a specific course of action over something far, far better.</p>\n<p>He regrets acting in such a way that made Dick feel he was unwanted, unloved, causing a rift in their relationship that has only recently begun to heal. He regrets being suspicious of Jason, seeing his anger instead of his joy, refusing to listen to him out of fear and concern until he left and died without ever knowing just how much Bruce loves him. He regrets being curt and cruel to Stephanie, ignoring her concerns and attempts to help, and instead focusing on her faults and flaws until she jumped into a situation she didn’t understand. He regrets keeping Damian at arms-length, watching him closely and disapprovingly, always expecting the worst even as the child, <em>his</em> child, was so desperate to please him.</p>\n<p>He is grateful they have remained in his life despite his screw-ups. That he isn’t too late to try again and do better this time.</p>\n<p>But for all his regrets, Tim is... not exactly one of them. Bruce feels guilty that the way he acted in his grief made a little boy with too-sharp eyes come to his front door to scold him, but it gave him Tim, and he can’t regret that. Even when he was cruel and hurting, trying desperately to push away another child who might worm his way into his heart the moment he acknowledged him, he cannot regret it. Because Tim is stubborn, perhaps more stubborn than any of them, and he knew exactly what Bruce was doing.</p>\n<p>He looked Batman in the eye when no-one else would, and told him to pull himself together.</p>\n<p>“You can’t be a grieving father and a grieving vigilante at the same time. Not without destroying yourself and Gotham. So either you go to grief counselling or you discover just how exactly I got a cease and desist letter from the Justice League,” he’d said seriously, mouth pressed into a thin line with eyes too old to belong to a twelve year old.</p>\n<p>It was a childish way of looking at grief, and Bruce had yelled at him for that, had said several cruel things, but Tim stood his ground. The boy had looked at him with that dissecting gaze, wordlessly telling him that he knew exactly what he was trying to do and that he wasn’t going to let Bruce self-destruct out of grief. More than that, Tim made sure Bruce understood that he was ready and willing to be the biggest thorn in his side until he made a decision.</p>\n<p>Tim showed up every day. Alfred never barred him entry, even after Bruce explicitly told him to keep the boy out. Any attempts to call his parents were met with a dial tone or a harried secretary telling him that they were unavailable. Meanwhile, Tim would leave pamphlets and flyers everywhere, and Bruce still doesn’t know how exactly he managed to roll some of them up in the toilet roll. He made spreadsheets and graphs, had Alfred trick Bruce into sitting down for seven hours as the tiny boy lectured him about healthy grieving mechanisms and the damage he was causing to minor criminals.</p>\n<p>He had made an information packet that was 270 pages long, and ended with a quiz.</p>\n<p>Bruce went to grief counselling.</p>\n<p>He’s never admitted it, but the stubbornness of a little boy who saw things with old, old eyes probably saved him.</p>\n<p>Tim has always been remarkably resilient, no matter his age. And while Bruce mourns the things his boy must have gone through to turn out that way, he cannot deny that it forced him to heal. That it helped not only him, but Alfred and Dick and Barbara and everyone else in his life. He remembers how he would trick Dick into coming over, how he’d connect Barbara to their coms over and over, no matter how many times they changed the frequency. He stuck to them like a burr, unflinching in the face of sharp words and casual cruelty as he donned the Robin costume with grim determination.</p>\n<p>But Tim’s independence has always been a double-edged sword.</p>\n<p>Shortly after Jason died, Bruce had been in no position to parent another child, and Tim’s acceptance of his detached approach to the boy had been a relief at the time. He’s ashamed when he thinks back on it, knowing full well that he had been distant on good days, and downright cruel on bad ones, telling himself that refusing to let Tim in was for the best. That Bruce couldn’t damage him if he stayed away.</p>\n<p>Except he got attached. Of course he did. How could he not? It was impossible not to get attached to such a brilliant and ridiculous boy, a boy who would scold him and force him to eat, who made it his personal mission to bother Bruce until he went to counselling, who would eagerly help with whatever he could without a single complaint.</p>\n<p>No matter what he did, Tim was here to stay, and there was nothing Bruce could do to stop it. And after realising that trying to push Tim away would be futile, Bruce has tried to be more present in his life.</p>\n<p>Which meant Tim’s prior independence, something that had been a boon before, became... difficult.</p>\n<p>Having raised two boys starved for attention and willing to reach out for affection when needed, Tim’s distance has always sat awkwardly in comparison. But Bruce repeatedly told himself to give it time. He knows enough about his son’s childhood to understand that he is unused to parental supervision and supportive presences in his life, and therefore doesn’t know how to respond to it beyond confusion and trepidation.</p>\n<p>Jason was the same when he first arrived to the Manor, but he had at least some experience with his mother doting on him in her lucid moments. Exposing him to Dick’s easy affection, Alfred’s gentle hands, and Bruce’s own presence had made him relax and recognise them as family. Tim, in comparison, has never had such a reference. Beyond that, Bruce can admit that he’s never been the best at making Tim feel welcome, and only really began to try after his mother’s death. Even then it had been quickly cut short by Jason’s appearance.</p>\n<p>And during the time Bruce was gone, it only seems to have gotten worse.</p>\n<p>Tim has always been independent, but his distance has turned into outright avoidance. The first few weeks after returning to the correct time, Bruce had been too exhausted to think much about it. He’d asked after him of course, but Dick and Barbara explain Tim’s pivotal role in bringing him back, that he pissed off the League of Assassins in the process and is making himself scarce until Ra’s al Ghul calms down.</p>\n<p>Bruce knows there’s something they aren’t telling him, and yet, as agonising as it is not to interrogate them for the information, he’s been trying to trust his family more. So he accepts their words and tries to wait for them to come to him with the truth.</p>\n<p>Even when Dick comes back one day, tight-lipped and furious, he doesn’t ask.</p>\n<p>But as Bruce slowly gets his strength back and Tim continues to stay away from the Manor, he knows he has to do something. He tracks his son down, tries to tell him that he’s proud of what he did to get Bruce back, that he’s missed him and wants him home. Tim doesn’t give any indication of wanting too much physical affection from Bruce, so he clasps a hand on his son’s shoulder and tries to convey just how much he is loved without words.</p>\n<p>Tim looks at him with something fragile and desperate, and Bruce is about to drag him into a hug anyway, but-</p>\n<p>The moment is shattered by an alert. Crime never sleeps after all. But he trusts Tim. Trusts that his boy will come to him when he’s ready, just as he always has.</p>\n<p>Even as the months go by without a hint of Tim outside of WE or patrols, Bruce waits patiently. He waits and waits and waits, and slowly, the waiting fades into the back of his mind as he deals with the Justice League and Arkham breakouts and settling back in. And just like that, there are other pressing matters to look at, and he knows that Tim will understand when he comes back.</p>\n<p>Because he’s always come back, no matter what.</p>\n<p>That all changes on a Thursday evening, shortly before dinner. Damian is wrestling with Titus on the floor, a documentary about lead makeup playing in the background. Alfred is in the kitchen finishing up the last few dishes, and Bruce is sat in the living room, watching his youngest sons fondly. Dick had promised to show up after patrol, and he thinks he might be able to entice Jason to join them as well. Steph is currently on holiday with some school friends, and Cass has finally confirmed that she’s finished up most of her business in Hong Kong.</p>\n<p>A recent Arkham breakout makes it unlikely that any rogues will stir up trouble, and patrol promises to be fairly straightforward.</p>\n<p>It’s a nice evening.</p>\n<p>It doesn’t last.</p>\n<p>The sinking feeling in his gut starts moments before Barbara calls him.</p>\n<p>“<em>Tim’s civilian beacon just went off</em>,” she says in lieu of a greeting, and Bruce immediately heads towards the BatCave. Damian looks up as he exits, but makes no move to follow. Alfred stares at him disapprovingly, but a quick hand signal explains the need for his absence.</p>\n<p>“Where?” he asks, and Barbara hums.</p>\n<p>“<em>The tracker says he’s in Gotham City Hall. Social media has picked up on something going on there, but there haven’t been any- never mind, I stand corrected, an alert just went out. Apparently there was a construction failure in the building causing one side to look dangerously close to collapsing. Currently there’s no reported fatalities or injuries</em>,” she explains, voice ever so slightly confused and exasperated. “<em>Is Tim really calling for our help with something like this?</em>”</p>\n<p>“It could be the work of a rogue,” he suggests, pulling out his suit. “Any Arkham breakouts?”</p>\n<p>“<em>Nope, none recently. Harley and Ivy are still out, but they’ve been on the down low for a while. It could be Penguin, but there hasn’t been any chatter about a hit on the City Hall recently</em>,” she explains, “<em>though it could also be a set up to distract from an impeding breakout</em>.”</p>\n<p>Bruce grunts as he finishes suiting up.</p>\n<p>“Would that be a sufficient excuse to explain Batman’s presence?” he asks, and she makes an affirmative sound.</p>\n<p>“<em>It would be plausible, yes</em>.”</p>\n<p>“Good.”</p>\n<p>With that, he starts up the Batmobile and gets ready to head into Gotham, only to pause. He closes his eyes, and makes a mental note to apologise to Alfred for his childhood.</p>\n<p>“Damian,” he finally sighs out, “I need you to stay here.”</p>\n<p>His youngest son, already in his Robin suit, glares at him from the backseat, his lips turned-down into a scowl.</p>\n<p>“If Drake is incompetent enough to fall into a civilian trap, then he will need my presence to remind him of his failures,” he explains haughtily, nose stuck in the air, but Bruce has come to know his son. And he knows that the tremble in his lips isn’t from annoyance, but worry.</p>\n<p>He’s vaguely aware that Damian had some sort of confrontation or discussion with Tim that left him unsettled and off-kilter, though it was hardly noticeable at first. But the boy has stopped insulting his estranged brother any time his name comes up in conversation. He no longer scoffs or makes derisive sounds when Tim speaks on the coms, as rare as that has become, and instead silently assists him when needed.</p>\n<p>The concern in his youngest son’s eyes suggests that whatever happened between them was a bit more severe than an earnest heart-to-heart, but until either of them tell him what happened, then he’ll just be happy that they aren’t at each other’s throats anymore. But regardless of their truce, Bruce can’t take Damian with him. While a part of him wants to assemble their entire forces for Tim, he has to remain calm. Tim chose to reach out to him, chose to activate his civilian emergency beacon. As much as he wants to race to his son with all his might to protect him, doing so would draw far too much attention to Tim and any possible connections he may have with Batman.</p>\n<p>“I know, kiddo,” he says gently, “but you can check over him when he gets back. Besides, you have an exam tomorrow.”</p>\n<p>Before he was lost in the time stream and got to know his son, he knows that Damian would have argued. Would have scoffed and pretended to accept, just to sneak out on his own later.</p>\n<p>This Damian, however, grimaces, which is his version of a pout. Bruce hides his smile, and ruffles the young boy’s hair instead.</p>\n<p>“Fine,” Damian grits out, “but you will alert me the moment you return, Father.”</p>\n<p>“Of course, son.”</p>\n<p>It’s a compromise. But given that only a year ago even that would have been impossible, Bruce thinks he’s allowed to be proud.</p>\n<p>Grumbling silently, Damian exits the Batmobile and makes sure to slam the door with force. Alfred pops his head through the window.</p>\n<p>“I will ensure the young master stays put, Master Bruce.”</p>\n<p>Bruce sighs.</p>\n<p>“Thank you, Alfred. I’ll be back soon.”</p>\n<p>“Of course, sir.”</p>\n<p>And with that, he rolls up the window, and heads off to collect Tim.</p>\n<p> </p>\n<p> </p>\n<p>If the police and firemen are surprised by his presence at the city hall, none of them show it. In fact, a lot of them seem relieved.</p>\n<p>“Preliminary reports suggest structural damage, but I ain’t taking any chances,” one of them says. Batman rumbles out a silent confirmation.</p>\n<p>“Reports say the east stairwell collapsed, but apparently that area had been sectioned off for repairs,” a fireman offers. </p>\n<p>“<em>That would check out. East stairwell is where his beacon is</em>,” Oracle adds on quietly, and Bruce grunts out an acknowledgment to both of them, heading over to the cordoned off entrance. No-one attempts to stop him, too used to his presence to protest.</p>\n<p>“We haven’t gone in yet, but it seems to have stabilised for now,” a woman in specialist gear says to him as he ducks under the tape. “If you want to check out the scene, then go ahead, but stay... uh. Alert.”</p>\n<p>She seems to realise how superfluous her warning is, but he’ll take it regardless.</p>\n<p>“Understood.”</p>\n<p>The interior of the City Hall looks wrecked, but that isn’t exactly anything unusual. It’s always in some state of disrepair, and he notes the crumbling concrete with distaste. The east stairwell is partially blocked off by a bent steel beam, and it’s a squeeze to make his way past it. The rest of it isn’t any better, and he turns on his night vision, carefully climbing up the groaning beams to the first floor.</p>\n<p>As he studies the debris to assess his next steps, something drips down to his feet. He looks down, headlamp immediately lighting up.</p>\n<p>A crimson stain shines back at him, surrounding a small mass of flesh and shards of bone. Distantly, he notes the shape resembles a shattered piece of the lower thoracic spine area. It would be excruciating.</p>\n<p>He looks up, just as another drop of blood falls and splashes against his boots. A metal beam has punctured the ceiling, bloody gore dripping from the end.</p>\n<p>Something in Bruce’s chest stutters.</p>\n<p>He’s seen many awful things in his life, but there’s a particular sort of agony in knowing that the person on the other end is almost certainly incapable of surviving such damage. He can only hope that it isn’t Tim, and that sends a specific sort of agony through his chest. But he forces himself to ignore the jarring sense of wrongness, the soft jab that it might be Tim on the other end. With practiced ease, he squashes the thoughts. He has to trust that it isn’t Tim.</p>\n<p>Instead, he takes a deep breath and tries to steel himself for what is about to come, before he starts to climb up again. Bruce pushes through the debris, ducking underneath exposed rebar, as his eyes stay focused on secure grips and weak areas. He boosts himself up and lands on stable ground, sweeping the immediate area for any potential danger.</p>\n<p>Instead, his gaze hits a lump.</p>\n<p>Please, a soft, desperate part of him begs. <em>Please</em>.</p>\n<p>His headlight bounces against glistening metal, blood reflecting from the surface, and he takes a step forward. There’s a body there, pinned into place by the beam, face turned away. And yet, despite the damage, a faint wheezing sound rings out, the final strangled gasps of a dying person.</p>\n<p>Bruce walks closer, eyes caught on the damage done to the fragile body before him. It’s fatal. Even if he was able to remove the beam, the hole it would leave behind would kill the person in seconds. The most he can offer is comfort in their final moments. He takes a careful step forward, hand outstretched to gently turn their head towards him.</p>\n<p><em>Please</em>.</p>\n<p>His glove makes contact with tacky skin, and dim blue eyes open to gaze at Bruce.</p>\n<p>“Hey B,” Tim - his <em>son his son his son -</em> gurgles out, blood coating his teeth. “Sorry to call you for this.”</p>\n<p>And Bruce’s world shatters to pieces all over again.</p>\n<p>He doesn’t remember dropping to the floor, a shaky hand cupping a too-pale face. He can distantly hear Barbara calling out his name, trying to get an update, but he can’t answer her. All he can focus on is Tim, the wet whistling sound coming from his lungs, the bruises under his eyes and the thinness of his body.</p>\n<p>He’s not even 18 yet.</p>\n<p>He’s still just a boy. <em>His</em> boy.</p>\n<p>“<em>No</em>,” Bruce heaves, voice strangled as he cradles his son’s head. “<em>Please</em>, no, not again.”</p>\n<p>“S’alright, dad,” Tim slurs out, “but you have to... to do one thing for me.”</p>\n<p>Bruce can barely hear him, already fumbling with his com for backup and digging in his utility belt for a blade saw.</p>\n<p>“Oracle, get Kal on the line, <em>now</em>, we need an emergency extraction from-,”</p>\n<p>A hand grasps his own, gently pulling it away from the com. Tim looks at him with dazed, unfocused eyes, but there’s a twist to his lips that could almost be called a smile. Bruce wants to scream, wants to bundle him up in his cape and take him home, keep him safe and sound and-</p>\n<p>“Stop,” his son whispers, “they can’t do anything.”</p>\n<p>Tim tries to say something else, but his voice can barely make a whimper, and Bruce has to force down a whine. He wants to protest, wants to argue and command Tim to fight, wants to promise that everything is going to be okay, that he can fix this somehow. Because that’s what Batman does. That’s what Batman is meant to <em>mean</em>.</p>\n<p>And yet-</p>\n<p>He can’t fix this.</p>\n<p>He can’t fix the giant hole in Tim’s torso, can’t glue his shattered spine back together, can’t carefully slot the burst organs on the floor below back into their rightful home. Because there is a hole in his son.</p>\n<p>There is a hole in his son and he is dying. </p>\n<p>“B,” Tim finally manages to get out. “Dad. I need you to trust me. I need you to... to take my body back to the Cave. Not the hospital or the morgue, but home. No ambulance, no morgues, no-,”</p>\n<p>He chokes on a globule of blood, threads coating his teeth as he coughs. Bruce lurches forward and cradles his son’s head, tries to stop him from losing strength, but the hand around his tightens.</p>\n<p>“This is important. Listen, you can’t- you have to take my body home,” Tim says desperately, eyes suddenly clear and focused. “And then things will be... okay. Call Pru for more answers. Use my phone. Two-one-three-eight-two-seven-oh-seven-nine-six. I... can’t explain more, but I’m going to be okay.”</p>\n<p>How, Bruce wants to yell, how is anything ever going to be okay again? But the sharp gaze of his son forces him to nod, his other hand shaking as he reaches up to stroke his cheek.</p>\n<p>“Alright, Tim,” he promises hoarsely.</p>\n<p>His son doesn’t reply.</p>\n<p>The wheezing has stopped.</p>\n<p>Bruce shuts his eyes and holds Tim tight, tears finally escaping from his mask, before turning his mic back on with trembling fingers. He switches to the general channel, and immediately, the noise of the others fills his ear.</p>\n<p>“<em>B</em>?” Nightwing- <em>Dick</em> asks, “<em>Everything alright? Did you find T</em>?”</p>\n<p>Bruce’s hand flinches from where it’s buried in Tim’s bloodied hair, and tries not to scream.</p>\n<p>For a moment, the world falls silent.</p>\n<p>For a moment, Bruce holds his son, and weeps.</p>\n<p>“Code white,” he finally rasps out, “convene at the Cave immediately.”</p>\n<p>He barely notices the large hand that gently clasps his shoulder, the quiet strength of his best friend as he arrives to help remove his son from the wreckage. Bruce’s chest spasms as the beam is carefully removed from Tim’s body, flinches at the wet sound it makes as it slides out. Black blood coats the metal, and he tugs his son into his lap, cradles him close and trembles, pretending that there is no gaping hole in Tim’s torso, that his own gloves aren’t slick with red.</p>\n<p>“Come on, B,” Clark says softly. “Let’s take him home.”</p>\n<p>He doesn’t let go of Tim as they discreetly exit the building, away from the police and firefighters and reporters. He doesn’t let go as Clark gently urges him into the Batmobile, taking the driver’s seat as Bruce sits in the back. He doesn’t let go as the city lights of Gotham streak past them.</p>\n<p>He doesn’t let go.</p>\n<p>He’s still too late.</p>\n<p> </p>\n<p> </p>\n<p>Jason’s always had trouble with slow days.</p>\n<p>On one hand, slow days were the best days for a street kid. Shops were a little less cautious, gangs were a bit more lenient, and cops were in a better mood and unlikely to beat the shit out of you for ‘loitering’. As Robin, and then the Red Hood, he’s learned differently. Slow days usually mean something nasty is being cooked up for the evening and or night, and given the nature of his job, it eventually ends up being his responsibility in some way or another. The last slow day he had was ended by a team-up between Hatter and Scarecrow, and he’s very much not eager to find out how tonight is going to go.</p>\n<p>So he tries to take advantage of the daylight to relax a bit. He hands out clean needles for distribution, helps deliver a new batch of the insulin he’s been making in B’s basement, and he cooks a big meal for the homeless kids living in the building close-by. There have been no major incidents or scuffles in his territory beyond an argument over who got the last pack of tampons from one of the freebie bins he’s set up, and that’s hardly difficult to resolve. He promises to increase the amount of personal hygiene items he normally puts in the bins, heads to a nearby pharmacy and buys out the whole period section, and everyone leaves happy.</p>\n<p>By the time the evening rolls around, he’s cautiously optimistic that patrol tonight won’t be a hellish experience.</p>\n<p>Of course, that gets dashed as he’s suiting up. He’s barely placed his com in his ear before it’s turned on, Oracle speaking up immediately.</p>\n<p>“<em>Hood, you there</em>?” Oracle asks, and Jason grunts, body tensing at her unreadable tone.</p>\n<p>“What’s the sitch,” he asks, pausing at her answering sigh.</p>\n<p>“<em>RR’s civilian emergency beacon went off, we’ve narrowed its location to the city hall. Nothing to worry about, really. Would you mind taking over the beginning of B’s patrol route while he sorts this out</em>?”</p>\n<p>If it were anyone else, then Jason would complain a bit, but begrudgingly do it. If it were anyone else, he would make a snarky comment about others not being able to handle the heat.</p>\n<p>If it were someone he hadn’t killed with his own bare hands, he wouldn’t be swallowing down bile right now.</p>\n<p>“...his civilian beacon?” he finally croaks out, and Oracle makes an affirmative noise. She sounds bored, almost annoyed, and entirely unaware of the fact that Jason can’t breathe.</p>\n<p>“And you’re sure it’s nothing?” he forces himself to ask, and Oracle sighs.</p>\n<p>“<em>Look, it isn’t anything dire. Reports say it’s just some issues with construction at the city hall. T probably asked for assistance in helping civilians out</em>,” she explains impatiently, and it does absolutely nothing to calm him down.</p>\n<p>“Give Dick the route,” he says instead, “I’ll go assist.”</p>\n<p>“<em>What? As Red Hood? No, J, the place is swarming with police. Just go do the route as I asked</em>-!”</p>\n<p>He switches his com off, unable to care about the consequences Barbara will unleash on him for cutting her off. He can handle a few cops, he just needs to go and see that Tim is okay. He won’t take long. After that, he’ll grovel and bribe Babs with whatever she might want.</p>\n<p>He’s out of the door in seconds, heading to another location to finish getting ready, before he’s on his motorcycle and speeding through the streets towards Gotham City Hall.</p>\n<p>Logically, Jason knows that he’s overreacting. He sincerely doubts that there’s anything actually wrong, but he hasn’t seen Tim outside of the Red Robin gear in a while. Neither Babs nor Dick would explain where he went during Bruce’s disappearance, and they stayed quiet on why he never showed up after his return either. Not even Alfred said a word, his lips pressed tightly together whenever someone asked after Tim. To most people, it would have looked disapproving. Except Jason knows Alfred. And he knows when he’s worried.</p>\n<p>So yeah, Jason is concerned. He knows he has no right to be, not when he hasn’t ever actually spoken to the kid properly. But as long as he can make sure that Tim is alive, then he’ll deal with the guilt and the flashbacks.</p>\n<p>He skids into an alleyway near the city hall, dumping his motorcycle with little care before he’s scaling the wall and roof-hopping towards the main plaza. He can see why Babs wanted him to stay away; Gotham PD has pulled out all the stops this time. In the distance, he spots various news reporters and TV stations, each speculating and commenting on why parts of the east stairway has collapsed.</p>\n<p>Jason’s stomach twists.</p>\n<p>He can’t see Tim or Batman anywhere, and he has a sinking feeling that they’re both inside, which is... not great for his PTSD.</p>\n<p>Yeah, he really gets why Oracle didn’t tell him anything. But he can handle it. He has to.</p>\n<p>This isn’t Ethiopia. Bruce will get there on time, Tim is alright, and nothing is wro-</p>\n<p>His com crackles.</p>\n<p>“<em>You better have a good apology lined up, Hood</em>,” a cheerful voice comments.</p>\n<p>“Get off the line, Dickwing,” Jason groans out.  Nightwing chuckles, and he can just picture his older brother’s smug grin.</p>\n<p>“<em>No can do, I’m afraid. Oracle wants us all on the same channel for now to coordinate tonight’s patrol, as someone threw off her original plans</em>.”</p>\n<p>Jason swears.</p>\n<p>“Really? I told her I was gonna check out the city hall, you know I’ve been looking into the dodgy construction deals going on in the Alley,” he bullshits, and Oracle finally chimes in.</p>\n<p>“<em>I do believe that’s a collaborative effort, Hood. N is right though; you better be prepared to grovel</em>,” she says waspishly, and his face automatically grimaces.</p>\n<p>“Yeah, yeah, I’ll plant the bugs you’ve been nagging me about.”</p>\n<p>“<em>Oh no, I want more than that. I want Johann Thurm’s hard-drive in the Clocktower this time tomorrow</em>.”</p>\n<p>Jason grits his teeth. It’ll burn several favours he’s owed, but what Babs wants, she gets.</p>\n<p>“Fine.”</p>\n<p>She chuckles, and exits the general line, heading back to do whatever Oracle has to do. He can hear the quips of his brother through the com as he stops a robbery or some goons looking to cause trouble.</p>\n<p>In that moment, everything is fine. He can picture B and Tim wandering out from the wreckage with barely any scratches, a sheepish grin on the younger’s face while their father scowls back, barely hidden relief in his eyes.</p>\n<p>For a moment, he can believe that everything is going to be okay.</p>\n<p>His com clicks. Bruce is on the line.</p>\n<p>“<em>B</em>?” Nightwing asks, “<em>Everything alright? Did you find T</em>?”</p>\n<p>He doesn’t reply immediately. It takes several seconds for him to say anything at all.</p>\n<p>And then-</p>\n<p>“<em>Code white</em>,” Bruce forces out, voice wrecked, “<em>convene at the Cave immediately</em>.”</p>\n<p>His com beeps as the connection is cut off from Bruce’s side.</p>\n<p>There’s silence for a moment.</p>\n<p>And Jason is moving before he knows it, vaulting over ledges to speed back to his motorcycle, uncaring as he slams into multiple people on the way.</p>\n<p>Code white.</p>\n<p>Code white.</p>\n<p>Code white.</p>\n<p>Civilian death, his brain helpfully chimes in, sending a wave of some tangled emotion down his spine. He thinks he hears Dick having a panic attack over the coms, and Jason is close behind. His bike glints underneath the Gotham street lights, and just as he reaches it, his older brother appears out of nowhere, hurling himself at him with trembling hands and panicked breaths. Together, they stumble, and Jason unleashes a torrent of swears.</p>\n<p>“Jason,” Dick warbles out, fingers digging into his jacket. “Jason, I can’t-,”</p>\n<p>“Neither can I right now, okay?” Jason snaps back, electricity surging through his veins. “Fucking- pull yourself together!”</p>\n<p>He says it to Dick as much as he says it to himself.</p>\n<p>Jason has no clue how they make it back to the Cave without getting into a road accident, given how quickly he speeds, but in the moment, he can’t bring himself to care. All that matters is getting to his father.</p>\n<p>All that matters-</p>\n<p>All that matters is-</p>\n<p>He slams on the breaks as they arrive, already tossing himself off the bike and moving, Dick bolting past him. And then he stops suddenly, and Jason skids to a stop.</p>\n<p>Alfred is waiting for them.</p>\n<p>Alfred is waiting for them, eyes sunken and cheeks gleaming in the light of the Cave.</p>\n<p>“Boys,” he rasps out, sounding older than ever. “There’s has been... an unfortunate accident with... with...”</p>\n<p>And Alfred- unflappable, unsurprised, stoic and ever polite-</p>\n<p>He chokes. Covers his mouth with his hand as he gasps around a sob, hunching over himself as he turns away from them.</p>\n<p>Jason stops breathing, heart thundering in his ears, and he has to force himself to stay upright.</p>\n<p>Meanwhile, Dick vanishes, faster than he’s ever seen his older brother move.</p>\n<p>Jason takes a step forward. And then another. Reaches Alfred and clutches his grandfather to him as he weeps quietly in his arms. He waits for something to tell him that this is dream.</p>\n<p>Instead, a wail bounces against the unforgiving rock of the Cave. Dick is screaming in the distance, and it pierces his skull like a cold, cold crowbar. He blinks, and suddenly, Jason is outside the medbay, Alfred nowhere to be seen.</p>\n<p>Dick is cradling the pale body of Tim in his arms, face screwed up as he sobs and sobs and sobs, chest rattling with too few breaths. There’s blood smeared on his cheek as he clutches his little brother to his heart, and Jason can hear him begging Tim to wake up over and over. Barbara sits in the corner, head in her hands, glasses tossed uncaringly to the floor. A wounded noise rings out, and Jason’s eyes swivel to the side, catching on the sight of his father hunched over.</p>\n<p>Superman is there, Jason notes distantly, holding Bruce up as though he’d collapse into dust if he let go.</p>\n<p>His father lifts his eyes to gaze dully at him, opens his mouth as if to say something, and then closes it again. He lowers his head again, and Jason watches him shake and tremble, harsh sounds escaping from him. He’s weeping, he realises slowly. His father is weeping as though nothing will ever be alright again.</p>\n<p>Jason’s eyes gradually move to look at the boy who could have been his younger brother. He’s small and pale, still in his suit from his job at WE. A little boy dressed up like a business man. Dark crimson soaks through his office shirt, wicking up to his collar, and sticking to his hair. There’s no broken neck this time. Just a hole the size of a soccer ball in his torso.</p>\n<p>He’s seen enough death to know that there’s no surviving that sort of damage.</p>\n<p>Jason sways. He doesn’t know if he’s going to vomit or run away, so he settles on trying not to fall over. And yet, against his will, his fingers reach out and brush against Tim’s neck. Blood catches his fingertips, and as he presses against the cooling skin, he wonders why he expected to feel a heartbeat.</p>\n<p>There is a hole inside his brother, and he thinks a hole has been punched into his family at the same time. And just like Tim, he doubts they’ll survive it. He lingers against his little brother’s spine, before pausing.</p>\n<p>Then again, most people didn’t survive from a broken neck either.</p>\n<p>He blinks.</p>\n<p>And all of a sudden, the world clears.</p>\n<p>“Bruce,” Jason starts, voice steady. “Dad. Did Tim talk to you before- before?”</p>\n<p>If his father startles at his term, he doesn’t show it. He doesn’t even look at him.</p>\n<p>“’Take my body home. Call Pru,’” Bruce echoes listlessly, and Jason slides forward, trying to manoeuvre around Dick. He shoves a hand into his brother’s pocket, ignoring Dick’s sharp yell in his ear. His fingers hit a rectangle, and he pulls his prize loose.</p>\n<p>Tim’s phone is surprisingly intact given the damage done to its owner, but Jason is pretty sure that you could drop his phone into lava and it would still come out whole. He flicks on the switch, grumbling at the passcode that pops up.</p>\n<p>“Passcode?” he demands, and finally, Bruce looks up again, the emptiness in his eyes clearing. He shuffles out of Clark’s grip, and the other man steps back, brow furrowing. Barbara lifts her head, eyes bloodshot, and she stares at the phone in his hand.</p>\n<p>“Jason,” she says hoarsely, “what is this about?”</p>\n<p>“Give me the passcode, and then I’ll tell you,” he snaps back. They stare at him, and he scowls.</p>\n<p>“Jason-,” Clark begins, but Bruce interrupts him.</p>\n<p>“Two-one-three-eight-two-seven-oh-seven-nine-six,” he finally replies, and Jason taps it out immediately. The screen lights up, and he clicks on Tim’s contacts, scrolling down until-</p>\n<p>Pru.</p>\n<p>He taps call without hesitation, hitting speakerphone.</p>\n<p>The phone rings once, twice, and then-</p>\n<p>“<em>If I have to kill you again, I’m making you pay double, Fingerboy</em>,” a female, British voice snips, fond annoyance threading her tone. “<em>And if I have to play babysitter to your flesh chunks as you regenerate again like the world’s shittiest Doctor Who, then I will personally find a way to put you down for good</em>.”</p>\n<p>Air floods Jason’s lungs, and he swallows down a hysterical laugh.</p>\n<p>“I’m guessin’ you’re Pru,” Jason says drily, and for a moment, there’s silence.</p>\n<p>“<em>Ah bollocks</em>,” she finally says, “<em>he died in front of you and told you to call me, didn’t he. Fuckin’- I’m gonna kill him again, I swear</em>.”</p>\n<p>Distorted relief and victory runs through his veins, and he can’t stop his huff of laughter this time, eyes burning bright as he stares down at the phone.</p>\n<p>“Join the club,” he answers, and she cackles, loud and amused.</p>\n<p>All of a sudden, Bruce and Dick are there, cradling the phone like it’s something precious. Barbara’s eyes are wide, before they narrow, and he can tell she’s putting the pieces together.</p>\n<p>“Explain,” Bruce demands, eyes boring a hole into him, and Jason grimaces.</p>\n<p>“It’s complicated,” he tries to offer, but the woman cuts him off with a bark of laughter.</p>\n<p>“<em>Not likely. Sure, it’s complicated if you think too hard. So don’t. When Tim dies, he doesn’t have the courtesy to stay dead. This ain’t the first time, and it sure as hell won’t be the last.</em>”</p>\n<p> “This has happened before?” Dick whispers brokenly, just as Bruce says:</p>\n<p>“He’s died before?”</p>\n<p>Both of them sound like they've been shot, and he watches as Bruce stumbles, hands shaking.</p>\n<p>‘Pru’ snorts, unimpressed.</p>\n<p>“<em>Yeah, sure has, Mr BatWayne. It is freaky. Fah-reaky. Have you ever cut a fella’s arm off so hard you hit his heart and then watched it regrow? Cus’ I have, and lemme tell you, worst night ever. Actually no, scratch that, having to cut off his fingers and jar ‘em like Hannibal’s pickle collection was the worst shit. Hey, now that you know, can you put him in therapy? Or like... find some way to make him less broken? He’s gonna need multiple therapists for sure, since the first one is absolutely gonna quit the moment he walks in. That kid is a walkin’, talkin’ existential crisis. For other people, I mean</em>.”</p>\n<p>Bruce is frozen, staring at the phone with a blank expression on his face. Dick looks torn between confusion and grief, and Barbara-</p>\n<p>Babs looks ready to kill someone.</p>\n<p>“The bomb,” she says steadily, even as her hands tremble with rage. “He didn’t get out in time, did he?”</p>\n<p>Jason snaps his head up to look at her, and she steadily avoids his gaze.</p>\n<p>When Pru makes an affirmative sound, Barbara sucks in a heavy breath. Dick collapses, making a wounded noise, and Bruce looks like his whole world is collapsing. Jason’s head feels fuzzy, the phantom echo of a bomb ticking down ringing in his ears.</p>\n<p>“What?” he asks softly, and Barbara’s mouth thins.</p>\n<p>“Later,” she says, and Jason has to stop himself from storming over to her and shaking the answers out of her. He clenches his teeth, and refocuses on the phone.</p>\n<p>“How long does it take for him to come back?” he asks, and Pru makes a non-committal sound.</p>\n<p>“<em>I ‘unno, he told me it can take anywhere from a few hours to a couple of weeks depending on the cause of death. Bullet to the head is the quickest, apparently</em>,” she says, almost sounding bored. Jason tries not to think about how many times Tim must have died in order to know this information. From the look on Bruce and Dick's faces, he guesses they're trying to do the same.</p>\n<p>None of them are succeeding at it.</p>\n<p>“And a giant hole in the torso?” he eventually rasps out.</p>\n<p>She hums and smacks her lips.</p>\n<p>“<em>Honestly, no clue. Depends on the damage. Are his organs still there</em>?”</p>\n<p>It's almost easy to cling onto her nonchalant tone. She doesn't sound concerned at all, and Jason grasps that unflappable irritation with everything in his soul, because if he doesn't, then he's going to start screaming.</p>\n<p>“Nope. Part of his spine’s gone too.”</p>\n<p>“<em>Yeowch. Yeah, that’s gonna take at least three days, if not longer. Don’t dump him in a hospital or a morgue, because then I have to get him and watch him respawn, and once is enough for me</em>,” she complains loudly, and Dick chokes.</p>\n<p>“So what?” he demands, voice reedy from his crying. “He’s just going to come back?”</p>\n<p>“<em>Yup</em>,” Pru replies, popping the ‘p’. “<em>Oracle’s correct, Ra’s fucking blew him up so hard he turned into dust, and he came back in a bathtub three weeks later. Don’t question it. Seriously</em>.”</p>\n<p>Dick retches at that, face going pale, and Barbara doesn’t look any better. Bruce hunches over, hand gripping Tim’s tightly. Jason forces himself to keep still as the urge to hit something bubbles in the back of his throat. None of them say a word, not until Alfred clears his throat.</p>\n<p>“Thank you for informing us, Ms Prudence. I daresay we would have been... distraught without your assistance,” he says, and Pru makes a strangled sound.</p>\n<p>“<em>Jesus Christ, did they bloody nick you from the BBC? Did Liz herself release you from service? Fuckin’ hell. Southern bastard</em>,” she curses, and Alfred-</p>\n<p>Alfred laughs. There’s almost hysterical relief lining his eyes as he chortles, even as Pru continues to complain.</p>\n<p>“Not quite, Ms Prudence,” he says after a while, wiping a tear from his eye. “You are welcome to the manor should you ever wish for some proper tea.”</p>\n<p>“<em>Yeah, sure, why not. Anyway, are we done? Cause I’m done. Don’t call me again, and tell Fingerboy that he owes me extra for this. Ta</em>.”</p>\n<p>The call ends as abruptly as it started, leaving the six of them to stare at the blank phone in silence. Slowly, Jason turns to look at the boy he killed not too long ago.</p>\n<p>That, he thinks, is something to process later.</p>\n<p>For now though? For now, Jason will wait.</p>\n<p> </p>\n<p> </p>\n<p>Dick doesn’t know what to feel. Perhaps relief would be best, but staring at the unmoving corpse of his little brother, it doesn’t quite fit. Both Prudence and Jason confirmed that Tim would come back to life eventually; however his brain has yet to comprehend it all. Grief still aches deep inside him, and he finds himself sobbing at random intervals.</p>\n<p>He feels like he’s being torn in half, two truths clashing with each other as he sits beside Tim whenever he can.</p>\n<p>Eventually, he settles on guilt. How many times has Tim died? How many times did it happen under Bruce’s care? <em>His</em> care?</p>\n<p>Dead. His Timmy has died enough times to know how long a bullet to the head takes to heal.</p>\n<p>Jason had already reluctantly ground out his own role in causing Tim to die, which had sent Dick straight to the garbage can to vomit. Bruce looked like he didn’t know whether to cry or collapse, and instead buried his face in his hands. Jason had stood up to leave at that point, but Dick couldn’t bear seeing another brother disappear, and instead darted over to hold him tight.</p>\n<p>“Please don’t go,” he whispered hoarsely, “I can’t lose another brother tonight. I can’t lose you again.”</p>\n<p>Reluctantly, he had agreed. Bruce eventually pulled his head out of his ass and clasped a hand on Jason’s shoulder, hesitant and unsure if he’d allow such a thing. And for once, Jason accepted the affection.</p>\n<p>They stood around the corpse on the bed for an indeterminable amount of time, until Bruce murmured something about telling Damian. Jason disappeared soon after, helping Alfred up the stairs. Barbara had joined them, glasses crooked and eyes still red.</p>\n<p>And then it’s just Dick and Tim.</p>\n<p>He grips his little brother’s cold hand in his own, thumbing over a silent pulse point over and over as he swallows down sobs.</p>\n<p>“When you came into our lives,” he starts quietly, “I promised myself to be the best big brother I could. I promised myself that I wouldn’t make the same mistakes as Bruce, that I wouldn’t do what I did with Jason.”</p>\n<p>He crumples, resting his head on the cool sheets cradling Tim.</p>\n<p>“I’m sorry, Tim. I’m so, so sorry.”</p>\n<p>He should have listened that day. Shouldn’t have let his own anger and worry take over, should have been calm and accepted Tim’s evasions, except-</p>\n<p>He’s so tired of having to deal with non-answers from his family. He’d been worried sick, hadn’t known if his little brother was dead or alive, and he had desperately wanted a proper answer for once. Tim used to tell him everything.</p>\n<p>Or... at least Dick thought he did.</p>\n<p>God, how old had he been when he first died? He must have been terrified.</p>\n<p>Had anyone noticed? Did anyone say anything? Or did he do as he always does: keep quiet and observe until it becomes advantageous.</p>\n<p>“I don’t understand you sometimes, Tim. I wish you knew that I want to.”</p>\n<p>He doesn’t answer. Of course he doesn’t.</p>\n<p>Tim is dead after all.</p>\n<p>He falls asleep at Tim’s bedside some indeterminable amount of time later, and feels the warm body of his youngest brother pressed against him. He cracks open an eyelid.</p>\n<p>Damian isn’t looking at him.</p>\n<p>“I don’t hate him,” he says suddenly, head ducked. “I don’t think I ever did.”</p>\n<p>Dick hums, other hand reaching out to tug him closer. And for once, Damian lets him.</p>\n<p>“I don’t know how to feel,” he admits quietly, and Dick chuckles sadly.</p>\n<p>“I don’t think any of us know what to feel.”</p>\n<p>“I keep looking back and wondering- Richard, what if I succeeded? What if I did kill Timothy, and that is why he refuses to return home?”</p>\n<p>“Oh, Dami,” he sighs gently, pressing a kiss to his youngest brother’s hair. “I don’t think that’s why. If anything, it’s probably my fault.”</p>\n<p>Damian squirms, wriggling out of his embrace, his eyes narrowed. He looks so young like this, even as he tries to pretend to be older.</p>\n<p>“You do not understand, Richard,” he says, voice clearly frustrated, “I cut his line recently. I was... angry at how upset he was making you.”</p>\n<p>Dick’s eyes flutter shut as he takes in Damian’s words. A part of him wants to yell, wants to demand why Damian thought that was appropriate, but-</p>\n<p>He opens his eyes, and can see angry tears on his youngest brother’s cheeks.</p>\n<p>“And you know it was wrong,” Dick says gently, pulling him back into a hug.</p>\n<p>Against his chest, he can feel him nod.</p>\n<p>“I didn’t want him to die,” he admits into his shirt, “as he fell, I realised I didn’t want him dead.”</p>\n<p>“I know, kiddo, I know.”</p>\n<p>He stays there with his younger brothers for a while, vaguely aware of the rest of his family trickling in at various intervals. Bruce sets up cameras and sensors to make sure he catches the moment Tim’s heart starts beating again. Steph shows up and weeps against the bed, unable to bring herself to touch him. Jason reads books to his quiet corpse, voice cracking occasionally. Cass appears out of nowhere, tears dripping down her cheeks as she tucks herself against Tim’s cold body and refuses to move, no matter what. Damian brings down Alfred the cat and sits close by, sometimes silent, sometimes not.</p>\n<p>And Dick... Dick waits. Waits for his little brother to finally come back to life and fill the hole he’s left behind. But as long as he comes back eventually, well.</p>\n<p>He’ll wait for as long as needed.</p>\n<p> </p>\n<p> </p>\n<p>Before he had ever even met him, Damian had known that Timothy Drake would be his hardest opponent to beat.</p>\n<p>While the reports from the League tended to describe the older boy as cowardly, if intelligent, his mother had told him differently. It was one of the rare days she deigned to sit with him, cradling him close as she stroked his hair. Neither of them had been speaking, but his mother always had wisdom to part.</p>\n<p>“Grayson and the Todd boy hold your father’s affections,” she had said suddenly, sliding her fingers down to grip his chin. “Timothy Drake, however, holds your father’s ear. You are to obtain both, do you understand, Witwaat?”</p>\n<p>The childish nickname made him flush in embarrassment, but he had agreed, leaning back into the loving affection she gave to him. He’d known of Drake at the time, but had fallen into the same trap as the informants in his father’s city, viewing him as nothing more than a nuisance.</p>\n<p>But his mother is a clever woman.</p>\n<p>He’s never forgotten her words, has always kept it in mind when approaching Drake, because his mother was right. She usually is. He observed the way his father tossed his affection towards Richard, watched how he’d always reach out to touch Jason, but pulled back at the last second.</p>\n<p>He noticed how Drake would receive knowing glances and silent nods, how his input would always be considered the longest, how even the most illogical of ideas would be discussed with a weight he reserved for Drake and Drake alone.</p>\n<p>Drake should have been straightforward. He <em>was</em> straightforward in the beginning. Antagonistic towards the threat of the blood heir, untrusting of his League background, and overly-cautious in their interactions. But despite it all, he didn’t openly obstruct Damian’s integration into the family.</p>\n<p>And yet there was a reason he was trusted by the Batman, which made him an enemy.</p>\n<p>It had made trying to assassinate him very difficult. Even the most elaborate plots failed, and Damian had steadily turned to focus on waging mental warfare if physical altercations were insufficient to remove Drake from the family.</p>\n<p>Perched on the bed where his dead brother slumbers, Damian wonders how many times he actually succeeded. It’s strange to see Timothy so still. Even during the height of their, in retrospect, one-sided rivalry, he had always been moving.</p>\n<p>The fatal hole in his torso is gone, having gradually disappeared into nothing, and yet his heart remains silent. He knows that the rest of his family has become antsy, the hope they had been clinging onto for the past week slowly waning as Timothy remained lifeless. Had this occurred prior to Damian’s most recent attack on his life, then he would have assumed the boy was doing it out of spite.</p>\n<p>Now though, he just hopes he wakes up at all. It’s strange, how easily he has come to view Timothy as family, if not a brother quite yet, despite their estranged relationship. He had fully expected him to report Damian’s misconduct to the rest of the Bats the moment he could. It would have been his right, and the slimy guilt that continued to churn in his stomach agreed.</p>\n<p>And yet no reprimand ever came.</p>\n<p>There was nothing but the echo of a tired, thin voice, from a tired, young man, quietly telling him to not do it again.</p>\n<p>Damian doesn’t understand him.</p>\n<p>He says as much out loud.</p>\n<p>“You are confusing, Timothy,” he admits, eyes darting to the side to make sure no-one is nearby. “You are openly favoured by the family, yet you retreat and hide when possible. Even now, you remain dead, while father and the rest anxiously await your resurrection.”</p>\n<p>The heart monitor stays silent, and he frowns.</p>\n<p>“If this is because of what I did, then fine. But don’t take it out on Richard. He cares for you for some reason.”</p>\n<p>He doesn’t dare say that perhaps, Damian himself cares for Timothy in his own way as well.</p>\n<p>But as a blue eye cracks open to look at him, he thinks that his brother already knows.</p>\n<p>When Tim finally cracks his eyes open, he isn’t really expecting Damian to still be there. Sure, he had heard his younger brother murmuring to him, his quiet words not quite revealing his actual thoughts though certainly hinting towards them, but he would have thought he’d leave soon afterwards.</p>\n<p>Apparently not.</p>\n<p>There’s a moment of silence between the two of them, neither moving as they examine the other. And then the heart monitor attached to his chest begins to blare, setting off a chain reaction of alarms ringing loudly. Tim shuts his eyes again, sighing softly.</p>\n<p>Damian immediately flicks his face, scowling down at him when he reopens his eyes.</p>\n<p>“Keep your eyes open, Timothy,” he hisses out. “You’ve been lazing around for a week already.”</p>\n<p>Tim hums. A week is longer than expected, given that the last time he was killed in such a manner that his organs had to be regrown, it took only a couple of days for him to come back. He very pointedly decides not to say anything about that to Damian, however. The boy is looking at him as though he’ll disappear if he blinks, fists gripping his sheets so tightly that his knuckles will undoubtedly ache the moment he releases them. They stay clenched even as he hops off the bed to switch off the alarms.</p>\n<p>“You will answer father’s questions,” he demands, and Tim tries not to grimace. He should have just called Pru instead; sure, she would have complained about having to break into a morgue to steal his body, but he’d prefer that than having to... explain everything.</p>\n<p>“I don’t suppose I could... not?” he tentatively offers, and Damian’s glare suggests he’d very much like to test Tim’s immortality again.</p>\n<p>“If you even think about-,” he starts to threaten, but is thankfully interrupted by the pounding of heavy footsteps against the floor of the Batcave.</p>\n<p>Tim sucks in a preparatory breath and looks up, just as the door slams open. And Bruce bowls into the room, chest heaving, face pale and eyes bright with a cocktail of emotions.</p>\n<p>He looks just like he did when Jason had died. For a moment, Tim can smell whiskey instead of antiseptic, but he chases the memory away. There are dark bruises under Bruce’s eyes, his visibly greasy hair sporting new strands of grey. He’s wearing old tattered sweatpants and a faded shirt for some college band he’s never listened to. He looks ragged and worn down.</p>\n<p>And yet, he stares at Tim like he’s some sort of miracle.</p>\n<p>“Tim,” he breathes out, “Tim.”</p>\n<p>He takes a stumbling step forward, arm outstretched. Damian slips out without a word, shooting Tim one last heavy glance.</p>\n<p>“Hey B,” tumbles out of Tim’s mouth, and Bruce- Bruce rears back like Tim has just shot him with Alfred’s double-barrel shotgun, face paling even further. And then he’s there, heavy hands on his shoulders as he tugs him close and shakes.</p>\n<p>“Don’t,” he rasps out, “don’t say that. Don’t- you died, Tim. You <em>died</em>, don’t-,” he swallows down the rest of whatever he was going to say, breath hitching as his fingers dig into his skin.</p>\n<p>Tim flounders.</p>\n<p>He’s seen Bruce cry before. Of course he has, he was there in the aftermath of Jason’s death, helping Alfred pick up empty bottles while Bruce sobbed in his office. It’s different though, this time. Because Bruce suspiciously sounds like he’s about to cry over Tim.</p>\n<p>Tim isn’t really sure if anyone has ever... cried over him.</p>\n<p>Before he can think on that any further, he’s being crushed into a broad chest, a large hand reaching up to cup the back of his head and cradle it like he’s the most precious thing in the world. Like he can protect Tim from everything and everyone just by holding him close, by refusing to let go.</p>\n<p>Something in Tim’s chest spasms and he automatically clings back, fingers gripping warm fabric as he breathes in the scent of <em>home</em>.</p>\n<p>“Bruce,” he says, voice muffled by his shirt, and he’s horrified to find tears welling up in his eyes.</p>\n<p>Why is he crying? Why is <em>Bruce</em> crying? Everything is alright, after all. Tim is alive, despite what happened, and once he explains it to Bruce, then he’ll realise that there’s nothing wrong too, that this is normal and it’s okay, and that he shouldn’t be grieving for someone like Tim, not when death doesn’t affect him long enough for it to matter.</p>\n<p>“It’s okay, Bruce,” he mumbles, “it’s alright.”</p>\n<p>The older man flinches again at his words and pulls back, hand slipping from his head to cup his cheek. Tim startles at the way he looks at him with something soft and wounded in his eyes. He’s never seen it directed at him before. Jason, yes, Dick, sometimes, Cass, when she can’t talk and ducks into his bed, even Damian whenever he says something particularly depressing about his life in the League.</p>\n<p>But not Tim. Never Tim.</p>\n<p>“How can you say that?” Bruce asks, voice hoarse. “I watched you <em>die</em>, Tim, held you as you bled out, only to learn that this- this is normal for you? That you’ve probably died under my watch without me ever knowing? How can you believe that that’s okay?”</p>\n<p><em>Because I’ve been doing it since I was five,</em> he doesn’t say.</p>\n<p>\n<em>Because it’s my normal and I don’t understand why you’re so upset.</em>\n</p>\n<p>“Because I’m alive, and that’s all that matters?” he says instead, purposefully flippant. Bruce’s eyes narrow and he lets his hands drop, lips slowly thinning.</p>\n<p>“You purposefully withheld vital information from me, information that could have- Tim, did you even think about the effects this would have on us?”</p>\n<p>The genuine grief in his words, a harsh, guttural sound lingering deep in Bruce’s chest, makes Tim shuffle uncomfortably, but he doesn’t relent.</p>\n<p>“It never came up.” He licks his dry lips once, suddenly aware of how thirsty he is.</p>\n<p>Bruce’s nostrils flare, and his knuckles whiten from where he’s balled his hands into fists.</p>\n<p>“You’re being obtuse on purpose,” he grinds out, and Tim shrugs, noting how the grief is starting to fade into something stronger, something a bit like anger, and this, this he knows how to handle.</p>\n<p>“I’ve never had to explain it to anyone, and since I always knew I’d be fine, then what does it matter?” he explains, watching carefully as he presses all the right buttons. Bruce rears back, eyes darkening.</p>\n<p>“What does it-? What is wrong with you?” he demands. “I <em>held</em> you as you died in my <em>arms</em>, Tim, and you ask me why it matters?”</p>\n<p>Logically, Tim knows that seeing the death of a family member has consequences. But it’s always been different for him. He comes back, after all, and he’s never actually had to deal with people grieving over him. So he pushes further.</p>\n<p>“As I said, it happens all the time. I <em>am</em> sorry I put you in that position, if I had been confident in my ability to extract myself, then I wouldn’t have called you.”</p>\n<p>He sees the exact moment Bruce tips from anger into rage.</p>\n<p>“You- is this a game to you?” he thunders out, and Tim settles into the distraction, even as his chest tightens.</p>\n<p>“Of course not, it’s just my normality,” he repeats. “Bruce, I’ve been doing this for <em>over a decade </em>now.”</p>\n<p>It’s a mistake to say that, Tim instantly knows.</p>\n<p>Bruce stares at him, eyes wide and uncharacteristically expressive. Tim swallows through his dry throat at the sheer horror on his adoptive father’s face, the anger disappearing instantly as he does the math and realises how young he would have been when he first died.</p>\n<p>“Tim,” he starts to say, voice cracking. “Tim, how old-?”</p>\n<p>“It doesn’t matter.”</p>\n<p>It sounds flat, even to his own ears, and Bruce just keeps looking at him with a pale face and trembling lips. Tim opens his mouth to try and do damage control, but the door slams open again, cutting him off before he can try. Tim swallows again.</p>\n<p>Dick stands there, eyes wide and face exhausted, as he takes the scene in. Bruce looks up, mouth in a thin line. Somehow, he looks even more haggard than before. For a moment, none of them speak.</p>\n<p>And then Dick is moving forward, arms reaching out to cradle Tim close to him, and despite the sourness of their last few interactions, despite the things that remain unsaid bubbling beneath the surface- Dick is his big brother. It’s so easy to sag forward into his warmth, to feel safe and protected and <em>alive</em>.</p>\n<p>He doesn’t know how long he’s wrapped up in Dick’s embrace, his chest hitching against Tim’s cheek as he tries to hide his sobs from him, and Tim’s stomach twists.</p>\n<p>“Heya, Timmy,” Dick finally murmurs into his hair, voice breaking at his name. “We missed you.”</p>\n<p>“I’m right here,” he tries to point out, but his oldest brother just shakes his head and says nothing.</p>\n<p>It isn’t until Bruce clears his throat that they part, and Dick wipes his face, trying to give Tim a wobbly smile.</p>\n<p>“Here, Tim,” Bruce says quietly, holding out a water bottle. “I should have given this to you when you first woke up.”</p>\n<p>He nods wordlessly, taking the bottle and cracking open the seal, finally soothing his itchy throat. He wonders why it’s so dry; the last time he had to spend more than a day recovering, he woke up just fine.</p>\n<p>It’s not until the tangy taste of iron mixes with the water that he realises his throat is likely still covered in dried blood from when he coughed it up.</p>\n<p>And for some reason, it’s that thought that finally pries through his false calm and flippancy. Dying brutally is nothing new to him. It likely never will be. But being pinned there like a bug in a case, knowing that unless he got help, he’d keep reforming over and over around the intrusion until finally, his body stopped trying and remade itself from a finger again?</p>\n<p>That is far more unsettling.</p>\n<p>And Tim- Tim is so tired. What’s the point in trying to run and hide from this? They know now. They all know. And he’s going to have to unpick every death, every trauma, and force them to live through it too. Isn’t it better if he gives them redacted and edited accounts, rather than having Bruce scour through security cam footage and dig through his belongings until he witnesses the full extent of Tim’s existence? He’s already plagued them with one horrific death after all.</p>\n<p>Screwing the lid of the bottle back on and dropping it into his lap, Tim takes a deep breath. And then another. And another, until he’s scrubbing his face tiredly and trying to force the words to come out. It was easier with Pru. She’d listen, if he told her, but she never poked and prodded beyond her own morbid fascination.</p>\n<p>With Ra’s, well. There was little choice there, and it was far more academic and hypothetical in nature.</p>\n<p>This discussion in comparison will result in... feelings. And he doesn’t mean it in some blithe way or as a flippant quip. No, he means it as an acknowledgement of the inevitable fallout that will follow this. People are not used to death. Not even the Bats, as much as they’d proclaim it shaped them. The only one who would maybe understand is Jason, and he’s still so traumatised by his own death that it would probably set him off even more.</p>\n<p>Because death did not create Batman.</p>\n<p>Grief created Batman, and Robin, and Nightwing, and Red Robin, and Oracle, and Batgirl, and Red Hood, and, and, and.</p>\n<p>Death doesn’t create.</p>\n<p>It certainly didn’t create Tim Drake.</p>\n<p>He licks his lips again, finally lifting his head to look at his father and brother.</p>\n<p>“I know it’s pointless to ask,” he starts to say, voice soft, “but I’m going to ask anyway. Do you really need to know? Isn’t it enough to know that I’ll come back at some point?”</p>\n<p>Bruce furrows his brow, and Tim knows exactly what the man is thinking: of course he needs to know. As a detective, as Batman, there is no price too high for information. But Dick catches on to Tim’s unspoken question, catches on to the warning layered in his voice.</p>\n<p>“How bad?” Dick asks quietly as his fingers curl into fists. “How bad is it?”</p>\n<p>“At a certain point, I ran out of journals to document my deaths in.”</p>\n<p>Dick inhales sharply, fingers digging into the sheets as though they’re all that’s keeping him in place. Bruce looks like Tim just punched him in the gut.</p>\n<p>“Deaths. <em>Deaths</em>. As in more than one. Fuck. <em>Fuck</em>,” Dick murmurs, voice steadily growing in volume, and Tim shrugs.</p>\n<p>“I was unsupervised as a kid. You already knew this.”</p>\n<p>There’s silence in the room as his words settle, Bruce and Dick both looking at him with something unbearably fragile in their eyes.</p>\n<p>“Not like this,” Bruce finally says. “Tim, you said- a decade?”</p>\n<p>“Answer my question first. Is it worth knowing?” he repeats, the words hard but necessary. “You can walk away now, knowing that ultimately, I’ll be fine. Hell, I’d prefer it.”</p>\n<p>Dick makes a choked noise.</p>\n<p>“Tim, you can’t... you can’t just ask us to walk away from this. How can you even ask that?”</p>\n<p>His voice trembles, face pale as he reaches out to grab him again. But Tim stops him, hands wrapping around his older brother’s wrists.</p>\n<p>“Because this is normal, Dick. All of this? It’s my every day. And I don’t-... look. You don’t have to know the details, okay? This is me telling you that knowing more will just be... hard,” he finishes lamely, and Dick lets out a wet laugh, pulling his wrists away.</p>\n<p>“It’s already been ‘hard’, Tim,” he snaps out.</p>\n<p><em>Not like this,</em> Tim doesn’t say.</p>\n<p>“I haven’t even started and you’re already upset,” he points out instead, “seriously, we can all just forget about this.”</p>\n<p>Bruce looks at him, eyes tight and lips trembling.</p>\n<p>“Tim,” he says, before pausing, wetting his lips. “Tim, son, I held you as you-,”</p>\n<p>“-As I died, yes, you’ve said,” he cuts in, waving off the bubbling grief of his adoptive father dismissively.</p>\n<p>Bruce rears back as though struck, while Dick stares at Tim like he’s never seen him before. And oh, Tim hasn’t forgotten just how similar Dick is to Bruce in the end. They’re both so easy to goad when the right spots are poked and prodded.</p>\n<p>“What the fuck is wrong with you?” Dick starts, eyes starting to burn with disbelief and rage. “How can you just-?”</p>\n<p>“Dick,” Tim cuts in, voice cruel, “I died for the first time because my parents couldn’t be bothered to supervise me in a pool. I was five. Then, they encouraged me to take showers because I was too afraid of the water to get in the bath, and that was oh so frustrating for them. Unfortunately for them, my nanny enjoyed a bit too much wine, and forgot to put any sort of anti-slip mat, so a few months after my first death, I slipped and smashed my head open.”</p>\n<p>Dick’s mouth drops open, horror clear in the shine of his eyes, but Tim isn’t finished. Dick wanted to know what was wrong with Tim, well, wish fucking granted. Bruce seems like he doesn’t know whether to storm out or grab him and make him stop. Good, he thinks viciously. If they want to know, then he’d make sure they’d regret it. This isn’t Pandora’s Box. There is no hope to be found at the bottom of the truth, and maybe once Bruce and Dick understand that, they’ll let it go.</p>\n<p><em>They’ll let </em>him<em> go</em>, a small part of him whispers, sad and grieving and forever five years old, waiting for someone to realise he wasn’t there anymore. He pushes it down, drowns it just like he drowned all those years ago, and ignores the memories of chlorine burning the back of his throat.</p>\n<p>“After that, well, I just had to experiment, you know? I did my research, anti-suicide forums were very helpful on that regard, toddled up to the attic, and hung myself. Woke up a few hours later gasping for breath, and almost died again. Then there was the bleach, and boy, was that aftermath tough to clean up.</p>\n<p>“I was a bit traumatised by that, and decided to hold off on the old experiments, though I did make quite a few notes. Unfortunately, Ra’s al Ghul currently has them, so I can’t show you. My decision not to die lasted quite a while, up until I was shot in the head by a gang member while following Batman and Robin. Thankfully he dumped me in the trash and not the bay, but it still wasn’t a fun experience.”</p>\n<p>“Tim...” Dick whines brokenly, face pale as bone as he reaches for him, but Tim smacks his hands away, because he isn’t finished. He doesn’t want the soft pity or broken grief or the endless self-blame that is rooted in this family like an infection in their bones, always curdling every interaction and discussion.</p>\n<p>“After that, well, I was a bit reckless. Have you ever crawled your way back home with a flattered lung and road rash so severe you can see your rib cage? I have. How about being gutted in an alleyway and being robbed while your intestines hung out? Oh, but we can’t forget being shot in the thigh and pushed down the stairs, can we! That was a double death, you know, woke up from my neck being snapped just to bleed out from a shredded artery. Cheers for that, Jason, you broke my streak of not dying while being Robin,” he says sarcastically, words pulling awkwardly at his mouth. In the corner of his eye, Bruce flinches, and Tim is so <em>sick</em> and <em>tired</em> of the man taking everything onto himself, of diminishing everyone else’s struggles because <em>heavens forbid</em> someone other than him has an emotion or is to blame.</p>\n<p>If Bruce dares to take Tim’s deaths as his own, if he uses the horror and pain and agony that Tim went through over and over as more fuel, then Tim is going to disappear and join Pru.</p>\n<p>“Tim,” Bruce warbles out, and Tim tries not to snarl.</p>\n<p>“No, Bruce, I never died under your watch until that point, so you can take your guilt complex and shove it up your-!”</p>\n<p>Arms wrap around him, warm and familiar, a head of black hair tucking into his neck as he freezes. Cassandra has always been the strongest of them all, and he can feel it in the way she’s gripping him like he’ll disappear any moment now, body trembling and face wet from where it’s pressed against his skin.</p>\n<p>“Leave,” she orders, voice muffled.</p>\n<p>Bruce and Dick look wrecked, faces sallow and grieving, even as they try to protest. But Cass isn’t having any of it.</p>\n<p>“<em>Leave</em>!”</p>\n<p>They leave.</p>\n<p>Carefully, Tim brings his arms up to hold Cass back. She’s always cried loudly, almost out of spite for the silence beaten into her as a child. But right now, she weeps without a sound. He swallows, his own eyes burning as he buries his face into her collarbone, fingers twisting into the sweater he recognises as his own.</p>\n<p>Neither of them says a word for a while. They just hold onto one another and try to breathe.</p>\n<p> </p>\n<p> </p>\n<p>“You promised,” is the first thing Cass says to him, voice hoarse and accusatory. “You promised you’d <em>be okay.</em>”</p>\n<p>“I am,” he tries to rasp out, and the way she tightens her grip feels like a warning, so he quickly corrects himself: “I thought I was.”</p>\n<p>“You lied,” she says mournfully, “you lied, and I let you go.”</p>\n<p>From where she’s tangled with him, he can’t see her face, but the minute shift of her shoulder tells him that she’s spiralling, and he quickly goes to pull away. She tries to tighten her hold, but he needs to look her in the face.</p>\n<p>“Cass, I promise I thought I was okay,” he repeats, and she lets out a sigh so deep he can feel it in his bones.</p>\n<p>“Lying,” she breathes out into his ear, “to me, to yourself, to everyone.”</p>\n<p>And that-</p>\n<p>Tim doesn’t know how to respond to that. It’s becoming something of a pattern, because other people are so complicated and expect things he can’t give. But Cass is different. And so, he decides to be truthful for once.</p>\n<p>“I don’t know what you want me to say,” he finally admits, because that’s the crux of it; he doesn’t know what to say. He doesn’t know what’s the right thing to tell them, how he needs to react, how he convinces everyone that this is normal and always has been.</p>\n<p>Cass just leans back in, tucking her head beneath his chin, and she holds him with a gentleness that makes his eyes sting.</p>\n<p>“Words are hard,” she agrees, and he lets out a strangled chuckle.</p>\n<p>Both of them stay quiet for a moment, neither quite sure how to continue. Cass will listen to him, she won’t interrupt, she won’t start to tear up or blame herself or look at him with wide eyed horror on her face.</p>\n<p>Because Cass is Cass is Cass, and she is his sister before anything else. She knows better than most what it’s like to be unheard.</p>\n<p>“I think dying has been the one constant in my life,” he confesses into her hair, half hoping she won’t hear him. But she does. Of course she does, and she goes still at his words, chest hitching as she waits for him to continue.</p>\n<p>And unlike the bitter torrent he threw at Bruce and Dick, unlike the caustic sarcasm he spewed to amuse Pru, unlike the clinical observations he noted down for himself and Ra’s, what begins to pour out of his chest <em>hurts</em> in a way he’s swallowed down since that first lungful of water.</p>\n<p>He tells her about the pool, the bathroom, the attic, the kitchen. He tells her about the fevers and the bullet holes and the shredded skin. He tells her about road rash and infection, about organs rupturing and bleeding out, about severed limbs and exposed innards.</p>\n<p>And she listens. She doesn’t weep, doesn’t interrupt, doesn’t tell him to stop.</p>\n<p>She just... listens, until he runs out of half-remembered deaths and his voice is hoarse.</p>\n<p>“It’s normal,” he eventually finds himself saying, “that’s the thing, it’s normal to me. And no-one’s ever asked before. No-one’s ever noticed unless I died in front of them, and even then it’s a toss-up, though to be fair, I actively try to prevent people from connecting the dots.</p>\n<p>“I think a part of me actively wants to die, Cass,” spills out of his mouth, and he regrets it as she flinches against him, the first sign of movement since he started talking, but he can’t stop. “And not in a permanent, suicidal depressed way, but like there’s some biological imperative that makes me seek out death over and over. Because what other explanation is there? I was five when I died the first time, and then I killed myself to test it. Multiple times. And even when I tried to avoid it, it still lingered in my mind.</p>\n<p>“Why did I do that stuff? Why did I record it? Why do I still pull that shit, over and over, choosing death like it’s the easiest thing in the world?”</p>\n<p>Cass is silent in his arms, her breath tickling his neck in a steady rhythm. But she doesn’t let go.</p>\n<p>Instead, the room is disrupted by a clearing throat, and Tim’s eyes dart up, even as Cass stays quiet. Alfred stands there, wrinkles pronounced and looking more exhausted than ever. At the sight of him, Tim can’t help flinching, guilt bubbling beneath his skin as the older man slowly approaches them.</p>\n<p>“If I may, Timothy, Cassandra?”</p>\n<p>Cassandra doesn’t move to kick the older man out, not like she did with Bruce and Dick, and Alfred-</p>\n<p>Well, Alfred is Alfred.</p>\n<p>And so, Tim nods.</p>\n<p>“How much did you hear?” he rasps out as Alfred steps closer.</p>\n<p>“Enough to know that you’ve been suffering alone for far too long, dear boy,” he replies, and the gentleness in his hand as he rests it on Tim’s shoulder is so familiar and comforting, it hurts.</p>\n<p>“It’s not really suffering,” he protests weakly, and Cass’ arms tighten around him.</p>\n<p>“Pain... is not normal,” she forces out, and he tries to reach up to stop her from talking when she doesn’t want to, but she flicks him away. “Silence... was my normal. But it was wrong.”</p>\n<p>Tim swallows, throat dry and eyes burning as he leans back and looks at his older sister until the softness on her face is too much. Alfred’s hand tightens gently, slowly drawing him into an embrace as Cass tangles their hands together.</p>\n<p>“Do you understand?” she asks quietly, squeezing each of his fingers. “Dying may be your normal. But it is still wrong.”</p>\n<p>And that-</p>\n<p>He can’t-</p>\n<p>It’s different, he tells himself through the haze of confusion, grief and frustration. Cass was forced into silence by David Cain, while Tim willingly let himself die over and over to test it.</p>\n<p>The blood at the back of his throat burns, even after being washed away by water, and he tries to wave Cass’ words away.</p>\n<p>“It’s not the same,” he tries to explain, voice cracking as he stumbles over the words. “Your- David forced you into that, he raised you that way, you were just a kid-!”</p>\n<p>“Weren’t you too?”</p>\n<p>Tim whips around to the door, eyes widening at the sight of Jason, who quickly raises his hands in a placating manner.</p>\n<p>“Master Jason,” Alfred says, voice neutral, “I do believe it would be best not to overwhelm Timothy at the moment.”</p>\n<p>Tim blinks in surprise at the open coolness in his tone, but Jason seems... unsurprised, even as his shoulders tense.</p>\n<p>“If Tim wants me to leave, I will, I promise.”</p>\n<p>Cass’ hand tightens slightly, and he can imagine her eyes narrowing.</p>\n<p>“No pressure,” she whispers into Tim’s ear, and Tim-</p>\n<p>He doesn’t understand what’s going on.</p>\n<p>“It’s fine?” he says haltingly, and the relief on Jason’s face is palpable. He takes another step inside, cautiously approaching Tim’s bed while keeping his eyes averted.</p>\n<p>“Sorry for interrupting,” he rasps out, before clearing his throat. “I, uh, couldn’t help but listen.”</p>\n<p>“...it’s alright? It’s the Batcave. Eavesdropping is a given?”</p>\n<p>“It should not be,” Alfred murmurs derisively, but his former iciness seems to have thawed slightly. Cass remains in a defensive position however.</p>\n<p>“Regardless, I also, uh, I wanted to apologise. A lot. For... well. For killing you.”</p>\n<p>His voice lowers towards the end, and the sheer guilt in the words feels like being punched in the face. Tim can’t help but blink rapidly, eyebrows furrowing as the previous frostiness surges back to life in the room.</p>\n<p>“Dude, is that what this is all about? It’s fine, seriously. I was more pissed off about the broken fingers. No worries,” Tim tries to wave him off, desperate to force things back to normal.</p>\n<p>Given the disbelief in everyone’s eyes, he figures it wouldn’t be that simple.</p>\n<p>“Tim,” Jason says slowly, “I killed you.”</p>\n<p>“Jason,” Tim parrots back, equally slow. “You’re not the first, and you won’t be the last.”</p>\n<p>Alfred looks away at that reminder, and Jason flinches as well. Cass remains steady in Tim’s arms, but her muscles are coiled and cling onto him with desperation.</p>\n<p>“You can’t- How can you just wave that away?” Jason finally forces out, throat hoarse, and Tim is getting really tired of his reactions to things being waved away,</p>\n<p>“Look, Jason, was it frustrating to be killed by you? Yeah. Did I feel a little bit betrayed? Sure! But I’m not <em>mad</em> about it. It doesn’t mean anything, really.”</p>\n<p>The tension skyrockets, and he wants to bash his head against something, because clearly, he just said another wrong thing.</p>\n<p>“How can it not mean anything?” Jason demands. “I want to tear the Joker to shreds for what he did to me.”</p>\n<p>“And rightfully so. But it’s different with me. It’s my <em>normal </em>and that’s okay, Cass,” he answers, shooting a look to his older sister. “Look, trying to understand it just makes people upset, okay? Seriously, it’s not a big deal.”</p>\n<p>“Not a big deal. You dying is... not a big deal.”</p>\n<p>“Yeah.”</p>\n<p>“Lying,” Cass interrupts, voice cold and distant.</p>\n<p>Tim scowls. “I’m not!”</p>\n<p>“It is a big deal. It is big to me. To Alfred. To Jason,” she insists, and he tries not to scream.</p>\n<p>“Cassandra is correct, Timothy. Perhaps you do not find it distressing, but we do. I wish you never had to experience all that pain. I wish it never became your ‘normal’,” Alfred says quietly, his words washing over the room. “Just as I wish that Jason never had to suffer at the hands of the Joker.”</p>\n<p>Tim tries to breathe while Jason croaks out a distressed: “Alfie...”</p>\n<p>“Okay, yes, I understand that. But Jason’s death and trauma are... look, they’re real, okay? He genuinely died. I don’t.”</p>\n<p>He doesn’t know who he’s talking to at this point, because clearly, no-one believes him. Tim clears his throat instead.</p>\n<p>“It’s different,” he repeats, looking towards Jason for some sort of backup, but the lopsided smile on Jason’s face makes him want to cry.</p>\n<p>“How so, Tim? How is it different? We both died, we both came back, if it’s meaningful with me, why isn’t it meaningful when it happens to you?”</p>\n<p>“It just is! This- There’s no need to worry when I come back because it’s a guarantee, whereas with you- It’s just- It’s-!”</p>\n<p>“-a tragedy,” Jason finishes, “because I’m loved, and you’re not. Because if all those deaths mean something, then it means that you suffered. It means that those deaths were unfair. In a twisted way, if your deaths mean something, then it means that everything else was for nothing. That in the long run, Timothy Drake suffered for nothing. Right?”</p>\n<p>The room falls silent as Jason’s words settle between them. Tim stares at the man who could have been his brother, fists subconsciously clenching his sheets, even as Cass tries to pry them loose.</p>\n<p>“Get out,” spills out of Tim’s lips. “All of you. Out.”</p>\n<p>“Timothy-,” Alfred starts, but Tim just shakes his head.</p>\n<p>Because what the fuck is he meant to say to that?</p>\n<p>‘<em>Thanks for dismantling my entire psyche after apologising for snapping my neck</em>’?</p>\n<p>Tim would rather die again. There’s probably a vat of acid or something around here that he can dissolve himself in and respawn somewhere far away in like, Maine or Uruguay, right? Because his deaths don’t matter. They don’t.</p>\n<p>They <em>don’t</em>.</p>\n<p><em>He doesn’t matter</em>, bubbles up softly in his head, gentle and quiet and unnoticed like a drowning child. He swallows thickly past the gnarled knot in his throat as Jason and Alfred shuffle out, forcing out a sigh that seems to steal too much from his lungs.</p>\n<p>“That means you too, Cass.”</p>\n<p>“No.”</p>\n<p>The word echoes through the room like a slap, and he opens his mouth to hiss something back, but she shushes him. Carefully, she slips out of his arms, but her hands remain close, fingers brushing against his wrists as she sits opposite from him. Her eyes burn with some unnamed feeling, but there are tears on her cheeks as she lifts one of his hands and places a kiss on his pulse point.</p>\n<p>“I am not leaving. Not again. Not anymore.”</p>\n<p>“Cass,” he says, voice dangerously close to cracking, but she just squeezes his wrists gently.</p>\n<p>“It is not okay,” she whispers brokenly, but with a kindness he hates and loves in equal measure, “and that is alright.”</p>\n<p>Tim chokes, tears welling up and spilling down his face, even as he tries to force the shaking sobs back down, chest aching from the force of it. He holds his breath, hoping that the lack of oxygen will starve his impending breakdown away, but Cass-</p>\n<p>Cass thumps him.</p>\n<p>“Cry, stupid,” she says, voice trembling.</p>\n<p>And Tim-</p>\n<p>Tim breathes.</p>\n<p>And he finally breaks.</p>\n<p>He collapses forward into his sister, chest heaving with sobs that practically tear their way out of his throat, and it hurts more than any death he’s died before. Cass is crying with him, loud and open, but she doesn’t stop holding him, she doesn’t let him go for a second.</p>\n<p>“Why did it never matter?” he hiccups out. “Why does it always take me dying for people to notice?”</p>\n<p>“Why did you not tell me?” Cass counters, sniffing into his shoulder. “I would have been there.”</p>\n<p>And that hurts, because Tim- Tim knows it’s a lie. He knows it deep in his cracked and scarred bones, that even if anyone had known, nothing would have changed.</p>\n<p>“But you weren’t!” Tim howls. “None of you were! Whenever I need you, whenever I think about telling you, you all disappear! I needed you when Bruce disappeared, I needed Dick when Damian attacked me, I needed Bruce when Jason killed me, I needed my parents when I died in that fucking house over and over-!”</p>\n<p>He whines into Cass’ neck, voice breaking as his throat spasms and aches.</p>\n<p>“Why am I never first?” he finally admits hoarsely.</p>\n<p>Cass shudders, a wounded sound escaping her chest, even as she weeps and clings on tightly.</p>\n<p>“I’m sorry,” is all she says through her tears. “I’m sorry.”</p>\n<p>And Tim can only cry even harder.</p>\n<p> </p>\n<p> </p>\n<p>His eyes feel swollen when he opens them, and he winces, despite the low light of the room. His face is sticky and his throat hurts, and somehow, he physically feels worse despite being fully healed. His body feels heavy, despite the numb void inside his chest, and he sucks in a trembling breath.</p>\n<p>Beside him, Cass is a comforting weight, though their crying session has blocked her nose enough to make her snore softly. He only vaguely remembers what happened after Cass began apologising. He knows he was cruel.</p>\n<p>He tends to be, when vulnerable.</p>\n<p>But she had stayed.</p>\n<p>Tim scrubs at his face, swallowing through his hoarse throat and trying not to cough. He pats around for some water, only to still as a bottle is handed to him.</p>\n<p>“Here,” a low voice rasps out.</p>\n<p>Bruce sits in the chair next to the bed, clothes rumpled and face still full of stubble.</p>\n<p>“I can leave if you want,” he says, unknowingly echoing his second son, and despite himself, Tim snorts.</p>\n<p>For a moment, he thinks about sending him away. Thinks about yelling at the man he wishes was his father, he wishes would look at him like he looks at the rest of his children. Thinks about letting the remaining knot inside his chest fester and clog his throat, until his desires twist into resentment.</p>\n<p>He thinks about getting up and leaving, never to return.</p>\n<p>“No,” he whispers instead. “You can stay.”</p>\n<p>Bruce nods with a heavy head, eyes not quite meeting Tim’s.</p>\n<p>“Tim,” he starts, voice cautious “I would like... to apologise. For... everything. For making your pain about myself and my guilt. For not noticing how much you went through. For... not being there when you needed me most.”</p>\n<p>Tim takes a swig of water to avoid answering, but Bruce isn’t finished.</p>\n<p>“I have never wanted to make you feel... like you do not matter. Like your pain and suffering doesn’t matter. Because it does, Tim. You matter, and I am so, so sorry you’ve had to go through this by yourself. If you want me to listen, I will.”</p>\n<p>Tim swallows, the water cooling his throat, but the lump has returned, and all he can do is nod. For a moment, neither of them say anything, and Tim blinks away the tears that have started to burn in his eyes again.</p>\n<p>Bruce notices.</p>\n<p>“Can I... Tim, can I hug you?” he asks softly, and for some reason, the hesitation in his voice, the distress and grief- it’s too much.</p>\n<p>Tim bursts into tears again, even as he nods, and Bruce practically dives forward and scoops him up, no sign of hesitation despite Tim’s crying. Crushed against Bruce’s chest, Tim lets himself fall apart all over again, the desperation from before warping into something raw and grieving. But he doesn’t talk.</p>\n<p>Tim doesn’t have any words left to say, not while he’s occupied with weeping. Cass slips out quietly as he cries, only giving him a soft squeeze and a kiss on his greasy head before disappearing, but Bruce stays, warm and steady, large hands running through his hair.</p>\n<p>“I’m sorry, Tim,” he whispers, and the gentleness makes him start all over. Even when he tries to stop, Bruce keeps holding him. A part of him wants to be angry. Wants to scream and yell and push Bruce away, but he’s so, so tired of feeling things.</p>\n<p>“Why is it,” he eventually rasps out after calming down, “that you only show up and seem to care at the worst moments? And sometimes, not even then?”</p>\n<p>He licks his dry lips, and finally decides to just... be truthful for once.</p>\n<p>“I can’t keep doing this,” he admits. “Every time I think things might be different, but you just... don’t listen to me. You make a promise, and then you disappear. I just... I don’t know what you want from me, Bruce.”</p>\n<p>Bruce inhales sharply at his words, but Tim can’t find it in himself to regret them. He’s tired of the push and pull, tired of not knowing if he actually is Bruce’s son or just another vigilante, tired of having to choose to be competent and reliable. </p>\n<p>He chose to clean up Bruce’s messes, yes, but Tim is so, so tired.</p>\n<p>“I’m not... good with feelings,” Bruce finally says, but he doesn’t make a move to push Tim away. “But you have always... astounded me with your ability to read people. You’re intelligent. You’re quick and clever. Most of all, Tim, you- you tend to be kind. Even when... when I don’t deserve it. You were there in my worst moments. You dragged me out of that darkness over and over, supported me both as Batman and Bruce Wayne. You were... you are an astounding person.”</p>\n<p>Silence lingers between them for a moment, and Tim swallows thickly as the words ring in his ears. But Bruce isn’t finished.</p>\n<p>“And yet... it should have occurred to me,” he continues, “that a- a child shouldn’t have to support themselves and an adult. That it isn’t their... responsibility to make sure the grownups are okay first, and themselves second. I... should have checked in on you, Tim. I should have <em>listened</em> to you, or... at least, made you feel that I would listen. And I am so sorry that I didn’t.”</p>\n<p>Carefully, he pulls away from Tim to look him in the face.</p>\n<p>“I’m sorry that... every time you reached out, I made it about myself and my guilt, or brushed you off. I’m sorry I- made you feel like you didn’t matter, that your... your deaths were meaningless,” he swallows, hands reaching up to cup Tim’s face. “The world, my life, it... it’s infinitely better because you are in it.”</p>\n<p>Tim can’t stop the tears that leak out of his eyes, but Bruce just gently wipes them away, his own eyes shining wetly.</p>\n<p>“Do you really want to know? About... all of it. Me dying, over and over and over?” Tim warbles out, the words cracking as he does so. Bruce closes his eyes briefly, before opening them, still shiny, but accepting.</p>\n<p>“It’s going to break my heart,” he says, voice hoarse but honest. “Because you’re my son, Tim, and I love you. But I would rather know and be heartbroken, than look away when you... get hurt.”</p>\n<p>“You sure, Bruce?” Tim asks again.</p>\n<p>Without saying anything, he’s pulled forward again, into his father’s arms. He can feel Bruce swallow against his forehead, can feel the way his fingers are digging in just a bit too hard, and Tim- Tim sags, hands reaching up to grab back.</p>\n<p>“You’re my son,” is all Bruce says back, chest rumbling against his face.</p>\n<p>And for once, Tim feels like it’s the truth.</p>\n<p>So he opens his mouth, and talks for what feels like hours. Like Cass, he tells Bruce about every major death, about the memorable ones and the painful ones, the ones he didn’t mind and the ones that made him pray he’d never wake up. Bruce flinches or makes a wounded noise every so often, but he doesn’t interrupt except to give Tim water. He stays by his side, face paling every now and then, but he doesn’t move away from Tim.</p>\n<p>By the end of it, he’s shaking, shoulders shuddering as he takes several loud breaths.</p>\n<p>“I told you,” Tim says quietly. “I told you it would be easier not to know.”</p>\n<p>At that, Bruce snaps his head up, lips pressed into a trembling frown.</p>\n<p>“Maybe,” he admits, “but not for me. Not when it’s you.”</p>\n<p>Tim tries not to cry at that. He would have thought that after crying over and over again for the past few hours, there would be nothing left. And yet, here he is, tears streaming down his face one more time. Bruce lets out a distraught sound at the sight and clutches Tim close, hand cupping his head as rocks him gently.</p>\n<p>“I’ll say it as many times as needed, Tim,” he says quietly. “You’re my son, and I love you. I’m... I’m sorry I made you ever think otherwise.”</p>\n<p>He leans his cheek against his father’s chest, breathing in deeply as he tries to stop crying. His head is pounding and his eyes ache, and he feels like someone’s taken every single coherent thought and scooped it out, leaving him hollow and brainless.</p>\n<p>And yet, it doesn’t hurt as much as before. Despite the very physical pain of his tears and yelling, the tight knot that had previously threatened to choke him has loosened.</p>\n<p>That could also just be the exhaustion speaking.</p>\n<p>Carefully, Tim begins to extract himself from the iron bars that are Bruce’s arms, and his father quickly lets go once he begins to shuffle.</p>\n<p>“You okay?” Bruce asks haltingly, and Tim pauses.</p>\n<p>“No,” he finds himself saying. “But I think I will be. After a nap. Can I go to my room?”</p>\n<p>Bruce chuckles weakly.</p>\n<p>“Yes, of course. Just... stay in the Manor for a while? Please?”</p>\n<p>It’s probably a sign of his fatigue that Tim didn’t even think about bolting. And yet something small and warm bubbles up at the request, because... Bruce wants him to stay. Bruce would worry if he left.</p>\n<p>And Tim thinks that if he did leave, then Bruce would go after him for once.</p>\n<p>“I will,” he croaks out, throat tight. “I promise.”</p>\n<p>Bruce sags in relief, but doesn’t say anything else, instead helping Tim out of the bed as supporting him as they make their way upstairs. His limbs are fairly weak, but that’s fairly standard for a regeneration that long. Granted, he wasn’t as shaky after the explosion, but he figures that was because his legs had to be reconstructed from scratch and therefore didn’t just lie there uselessly.</p>\n<p>When they reach his room, Bruce lingers, uncertain whether to follow him or not.</p>\n<p>“I’ll be okay,” Tim finally says, and his father sighs, before nodding.</p>\n<p>“If you need anything, just... let us know, okay?”</p>\n<p>Despite himself, Tim leans forward and hugs him.</p>\n<p>“Yeah,” he repeats. “I will.”</p>\n<p>With a last squeeze, Tim finally hobbles into his room and shuts the door, before collapsing onto his bed. He’s asleep before he’s even landed.</p>\n<p> </p>\n<p> </p>\n<p>Tim wakes up to a small weight beside him, and he blinks blearily, wondering when Cass crept in. Except, as he wipes the sleep away from his eyes, he realises that the body next to him is far too small to be his sister’s. His lips part in surprise as he looks at Damian curled up beside him, brows furrowed and expression serious, even in sleep.</p>\n<p>Before he knows it, Tim’s stroking the younger boy’s head, realising that this is probably the longest he’s ever touched Damian in a way that wasn’t them fighting.</p>\n<p>A green eye cracks open, staring at him balefully.</p>\n<p>“I will only allow this once,” he snaps out, though much of the heat has been leeched out and replaced with sleepiness, “so enjoy it while you can, Timothy.”</p>\n<p>His eyes close again. And then open again.</p>\n<p>\"Did I ever kill you, Timothy?\" he asks, voice fragile. And Tim can’t help but smile.</p>\n<p>\"You wish,\" he retorts lightly, and the younger boy scowls.</p>\n<p>But he relaxes.</p>\n<p>\"Probably for the best,\" he sniffs out. \"My assassination techniques aren't meant for scrubs.\"</p>\n<p>Tim can't help but laugh, even as he tugs Damian into a hug.</p>\n<p> </p>\n<p> </p>\n<p>He wakes up again to another weight settling beside him, and he stares up into Dick’s wide eyes.</p>\n<p>“Sorry,” his older brother mumbles. “I can leave if you want-,”</p>\n<p>And Tim is so tired of fighting with Dick.</p>\n<p>“I’m sorry for provoking you,” he says, fingers reaching out to grab Dick’s sleeve. “And for being purposefully obtuse in the car. And for lying to you.”</p>\n<p>Dick swallows, eyes glassy.</p>\n<p>“I’m sorry for not listening to you and for... making you think I was choosing Damian over you. I’m sorry for pushing you, and for leaving you to be killed, and yelling at you, and-,”</p>\n<p>Tim leans forward and hugs his brother. Long, familiar arms wrap back around him, holding him tight as Dick weeps silently into his hair.</p>\n<p>“I love you, Timmy. You’re my little brother, and I just... God, I should have asked more. I should have done... more.”</p>\n<p>Tim exhales into Dick’s shirt, eyes closing.</p>\n<p>“Maybe,” he says quietly, “but I didn’t want anyone to know. And even when I did... I didn’t make it easy. It still hurts though, Dick. You didn’t even stop to listen, because you just... never stay. Instead you blow up and get angry and disappear, before showing up and pretending nothing happened. And that... that really fucking sucks, Dick.”</p>\n<p>“I know,” his brother replies, even as his voice cracks. “And I’m sorry. You can hurt for as long as you need to. But... I’m gonna be there if you need me. And I’ll do better. I swear.”</p>\n<p>“You better,” Tim mumbles back, fingers tightening in his brother’s shirt. “Because I’ll kick your ass otherwise, you dick. I’m tired of chasing after people.”</p>\n<p>Dick laughs wetly.</p>\n<p>“So am I,” he says, “so am I.”</p>\n<p>“Less running, more sleeping,” a voice pipes up tiredly, and Tim chuckles at Cass’ sleepy face popping out from the covers.</p>\n<p>“Okay, okay,” he whispers. But he doesn’t let go, even as he drifts back off into sleep.</p>\n<p> </p>\n<p> </p>\n<p>Light is beginning to stream into his room when Tim wakes up again, and he blinks blearily as he takes in his surroundings. Dick, Cass and Damian are still in his bed, curled up or spread out in equal measure, limbs tangled and warm against his skin.</p>\n<p>And yet, there is someone missing.</p>\n<p>Carefully, Tim extracts himself from the pile, tiptoeing out into the hallway and curling his toes against the cold floor as he wonders where Jason might be. With quiet steps, he pads downstairs to the kitchen, peering past the door to see if Alfred is already making breakfast and has seen Jason.</p>\n<p>To his surprise, the kitchen is empty. As is the dining room. It isn’t until he wanders onto the patio that he spots Alfred, sat on a bench facing the garden, eyes distant and unfocused. A cup of tea sits beside him, but there’s no plume of steam suggesting that it’s fresh.</p>\n<p>“Alfred?” he asks cautiously, and the old man startles, old hands already moving to grab a weapon that isn’t there. For a moment, Tim is worried that Alfred doesn’t recognise him. But then he relaxes, exhaling deeply, even as he waves him over.</p>\n<p>Tim shivers in the early morning breeze, but goes to join his grandfather in all but blood. A warm jacket is instantly draped over his shoulder, and he’s about to protest, but Alfred’s stern look quiets him.</p>\n<p>Neither of them say anything for a while, instead watching the curling morning mist slowly evaporate into dew on the grass, the morning sun only just beginning to peek above the horizon.</p>\n<p>“You know,” Alfred suddenly starts, “I don’t think I’ve ever quite failed someone as much as I have failed you.”</p>\n<p>Tim can’t help but flinch in surprise, eyes widening as he turns to look at the older man. And yet, he continues to stare forward, resolutely not looking back at Tim.</p>\n<p>“Alfred...” he begins to say, but the man lifts up a quiet hand.</p>\n<p>“Forgive me, Timothy, for interrupting, but I would like... to explain myself for a moment.”</p>\n<p>There’s silence for a moment as Alfred lifts up his cup of tea and takes a sip, face wrinkling at the coolness of it, and despite himself, Tim chuckles silently.</p>\n<p>“When you came to our doorstep, you were... barely a teenager. And yet, I welcomed your assistance. Perhaps some could even say I took advantage of your kindness. In some ways, I relied on it. When Master Bruce was locked in his room, when he wasn’t eating, when I was on the verge of giving up, over and over, you were there. You still believed in something. And I was relieved.</p>\n<p>“I should be ashamed of that, but I’m not. It most likely makes me a less than savoury person, yet I cannot bring myself to regret your help. Not when it brought my boy back to me.”</p>\n<p>For a moment, the only sound is distant birdsong. And then Alfred adds quietly:</p>\n<p>“Not when it brought me you.”</p>\n<p>Tim swallows.</p>\n<p>Finally, Alfred turns to look at him, and there are tears in his eyes.</p>\n<p>“I want to apologise, Tim. For not looking closely. For letting you shoulder a burden this old man could not. For standing to the side while you were suffering. For not... for not knowing when my boy was dying in plain sight.”</p>\n<p>He chokes on the last words, the tears finally escaping his eyes, and Tim doesn’t even think about it. He reaches out and grabs Alfred, burrowing his head into the familiar scent of tea leaves and the cigars he pretends he doesn’t smoke.</p>\n<p>“It’s okay,” he mumbles into his waistcoat. “Or, well, it’s not okay, I guess. I was angry at your neutrality sometimes. But... I still love you, Alfred. Even when I was at my most destructive, I still loved you. You and everyone else.”</p>\n<p>A trembling hand reaches up to cup his head, and he can hear Alfred’s hitched breaths.</p>\n<p>“I love you as well, my dear boy.”</p>\n<p>They don’t embrace for long; but it is enough for Tim to feel warm, despite the early morning chill. Eventually, Alfred brushes himself off, lifting his cold cup of tea and clearing his throat.</p>\n<p>“I should begin making breakfast,” he announces, and Tim smiles.</p>\n<p>“Anything good?” he asks.</p>\n<p>“Eggs Florentine, I think. Protein and iron to... well. Replenish your spirit.”</p>\n<p>“I look forward to it,” Tim says honestly, and Alfred nods, standing up and moving back inside.</p>\n<p>Tim’s about to call back to ask him where Jason is, when the distant scent of cigarette smoke fills his lungs. And Tim knows where the other boy is. Forcing himself up, Tim heads inside as well, and begins the trek to the roof.</p>\n<p> </p>\n<p> </p>\n<p>Jason sits on the edge of the roof, cigarette hanging between his fingers as he stares off into the horizon. The sun is only just beginning to rise properly, but the grey morning light is enough to make out his hunched shoulders.</p>\n<p>“Wondered when you’d show up,” he says tonelessly, gruff voice echoing against the tiles.</p>\n<p>“Really? How many cigarettes have you smoked waiting for me to figure out where you are?” Tim asks teasingly, moving forward to sit next to Jason. The older man glares down at him, but doesn’t move.</p>\n<p>“Why are you up here, Jason?” he eventually asks, and Jason shrugs.</p>\n<p>“Needed to think. Besides, I didn’t think I was welcome to the slumber party,” he replies, and despite the mocking in his tone, there’s no real heat. Tim hums.</p>\n<p>“You are. Welcome, I mean. I meant what I said, Jason. I don’t... I don’t hold a grudge or hate you for killing me.”</p>\n<p>“Yeah, well, maybe I do. I thought I’d be the last one, you know. The only and last dead Robin. And then I go and fucking kill you. And you let me.”</p>\n<p>Tim frowns at that, brows furrowing.</p>\n<p>“I didn’t exactly let you,” he points out, trying not to sound too irritated. “You were bigger than me and ambushed me. I didn’t just lay down and let you punt me down the stairs.”</p>\n<p>Jason huffs.</p>\n<p>“It shouldn’t have happened in the first place.”</p>\n<p>Tim snorts, and Jason turns to look at him balefully, eyes narrowed.</p>\n<p>“According to everyone, I shouldn’t have died at five. Or six. Or any other time. But I did. And that became-,”</p>\n<p>“Normal, I know, I’m beginning to think it’s your favourite word, kid,” Jason interrupts, lips curved into a frown. “It isn’t, though. I meant what I said before. Though the whole part about no-one loving you wasn’t me being mean, I meant it from, like, your perspective. You think you don’t mean anything, so therefore, your deaths don’t mean anything.”</p>\n<p>“I figured.”</p>\n<p>They’re silent for a moment, neither quite sure how to continue. Jason takes another drag of his cigarette, the smoke curling playfully as he exhales. Eventually, he talks again.</p>\n<p>“How about this,” he offers, “I’ll accept that you don’t hold a grudge over the whole... Tower thing, if you accept that you dying is shit and shouldn’t happen.”</p>\n<p>Tim blinks.</p>\n<p>“That’s... gonna take a while for me to do,” he admits hesitantly, “the accepting my deaths thing, not you killing me.”</p>\n<p>“Nah, that’s not how this deal works. Until you can accept the other, then I’m not off the hook for... for killing you.”</p>\n<p>And Tim... Tim doesn’t know whether to laugh or cry.</p>\n<p>“You’ll have to stick around for that,” he finds himself saying instead. “I need someone to teach me how to be angry over dying, and I figure you’re the expert.”</p>\n<p>And Jason laughs. It’s loud and strong and full of humour, and Tim finds himself laughing alongside the man he could someday call brother.</p>\n<p>“Alright,” Jason acquiesces eventually, wiping tears away. “I guess I could show up now and again.”</p>\n<p>“Then it’s a deal,” Tim agrees.</p>\n<p>They shake hands beneath the morning sun, palms warm and slightly dusty from the tiles, and the scent of cigarettes lingering on Tim’s fingertips.</p>\n<p>“Now come join the slumber party,” Tim says. “We need someone to push Dick out of the way.”</p>\n<p>On the sun-warmed rooftop, Jason laughs again.</p>\n<p>“Fine, fine. Last one there has to steal his blankets,” he quips, before darting away.</p>\n<p>And in the morning light, yelling after Jason and collapsing into the pile of his siblings, Tim thinks that he might be able to live for something other than death.</p>"
}