{
  "id": "439396",
  "url": "https://archiveofourown.org/works/439396?view_full_work=true",
  "author": [
    "Pookaseraph"
  ],
  "title": "Not the Worst Step-Dad in the History of Everything",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M",
    "Gen",
    "M/M"
  ],
  "fandoms": [
    "Suits (TV)"
  ],
  "relationships": [
    "Mike Ross/Harvey Specter",
    "Harvey Specter/Original Female Character"
  ],
  "characters": [
    "Mike Ross",
    "Harvey Specter",
    "Original Character",
    "Donna (Suits)"
  ],
  "additional_tags": [
    "Kid Fic",
    "Canon Compliant",
    "Fluff",
    "Parents & Children",
    "Step-parents",
    "Hook-Up",
    "Absent Parents"
  ],
  "language": "English",
  "series": "",
  "published": "2012-06-20",
  "completed": null,
  "words": "15,153",
  "chapters": "1/1",
  "comments": "225",
  "kudos": "8,889",
  "bookmarks": "2,086",
  "hits": "105,521",
  "summary": "<p>When the son he never knew he had is deposited on his doorstep by Child Protective Services, Harvey does the kindest thing he knows how to do: put Mike Ross on the case. Mike responds by doing what he does best: get emotionally attached to the client.</p>",
  "notes": "<p>Mostly canon compliant, has some nods to 2x1. I wouldn't call them 'spoilers' per se, but if you want to remain completely untainted about the character progress up through 2x1 I'd hold off on reading.</p>\n<p>Thanks to Regann as always.</p>",
  "text": "<p>Mike Ross had built his - admittedly short - career in trying to anticipate the needs of his boss. Harvey tended to be rigorous and exacting, he had methods that he expected Mike to follow when it came to anything from filing a motion or a subpoena to dealing with any of the various issues Harvey's clients had that didn't involve the law. Mike knew the things Harvey had no tolerance for: Mike's emotional involvement in cases, family issues, and ballet; Mike also knew the things that Harvey ate up with a spoon: being right, winning, and ragging on Mike in a manner that often bordered on mean. All of that gave him very little context for the phone call he got while he was sitting at his own desk proofing briefs.</p>\n<p>\"Get your a-- My office, now.\" And then he hung up.</p>\n<p>Mike actually stared at the phone for several seconds while he tried to determine if his boss had actually <i>not</i> cursed, because as far as Mike could remember - and he could remember quite a lot - that didn't usually happen. He tucked his phone in his pocket took the short journey from his desk to Harvey's office, where he found Donna sitting at her desk with the look of a very alarmed and startled animal. Mike's sense of dread grew with each passing second.</p>\n<p>\"Something wrong?\"</p>\n<p>Donna didn't even answer, just waved him in. Inside Harvey's office there was Harvey, sitting at his desk, looking irritatingly attractive as always, and there was a kid, a boy, ten, maybe eleven years old, on the wrong side of a growth spurt that would hopefully happen soon. The kid's dark black hair was cropped short, styled in a messy sort of mop, and his eyes were bright blue. He wore an expensive pair of jeans and a slim fitting t-shirt, and sat awkwardly perched on Harvey's couch. Client's kid maybe.</p>\n<p>\"Mike, Hunter Davis, Hunter, Mike Ross, my Associate.\"</p>\n<p>The kid mumbled a relatively soft: \"Hello, Mr. Ross.\"</p>\n<p>Mike waited for a few moments for the explanation, and then he spread his hands in a blatant play for Harvey to actually explain what he wanted, and then when that didn't work he just asked outright. \"Client's kid?\"</p>\n<p>\"Here's his file. Take care of him.\" Harvey held out a file, but it was not the standard files they used for briefings or other filings at Pearson Hardman.</p>\n<p>After a moment of hesitation, Mike reached out and took it, flipping it open to the first page and recognized it immediately for what it was, Child Protective Services file. Hunter Davis, mother Naomi Davis - deceased as of last week, father... Harvey Specter. Mike closed the file, considered yelling at his boss, and then realized it wouldn't do him much good with Hunter sitting right there. </p>\n<p>\"Harvey, wanna give us a few minutes?\" There was no way Mike was having a conversation with Hunter out in his cubical where the other Associates would be watching and waiting to swoop, knowing his luck, Louis would have come in and added a comment or three while he was at it.</p>\n<p>Harvey closed his laptop, pulled it from the docking station on his desk, and headed out of the office with the computer tucked under his arm without another word. Mike didn't think he had ever seen Harvey that pissed. A glance to Hunter seemed to confirm his suspicion that the kid knew Harvey was mad, but was similarly mystified as to the exact cause.</p>\n<p>\"Well, Hunter, like Harvey said, I'm Mike Ross. You can call me Mike if you want. I prefer it.\" He sat down on the couch by Hunter, but not too close, neatly pressing his tie to his chest.</p>\n<p>\"I'm not made of glass.\" Mike immediately recognized the signs of a kid who had been 'handled' for the past week, the sort of overwhelming coddling that did nothing to soothe the soul-deep ache in your chest because the person you loved was dead.</p>\n<p>He coughed. \"I didn't say you were. I said my name was Mike.\" He placed the file across his knees, hand holding it in place. \"Are you going to be living with... your father?\"</p>\n<p>Hunter shrugged. Mike had gotten enough of a look at the file to know that was the plan. Harvey had already been neatly evaluated as the only living relative that the kid had available, Naomi hadn't had any family. \"It's not like he wants me.\"</p>\n<p>\"Hunter, I'm his Associate. I've been on every single important case your dad has had since I came on board. You're important.\" Or he would be, if Harvey knew what was good for him. Harvey might bend the rules a little or even break them, but if Harvey thought he was getting out of this by dumping his <i>son</i> on Mike, he had another thing coming. \"Did you live around here?\"</p>\n<p>Mike already knew the answer, but he waited for Hunter's answer. He shook his head. \"Washington, DC.\"</p>\n<p>\"So we'll need to get you into a new school. Do you like school?\" Mike took a moment to flip open the file, glance at the grade and school reports, achievement tests off the charts, brilliant.</p>\n<p>\"It's boring.\"</p>\n<p>\"Boring, huh?\" Mike pulled his bag back over his shoulder and tucked Hunter's folder into it. \"I will have you know I am the king of making school very, very fun. Come on.\"</p>\n<p>Hunter, much to Mike's surprise, actually followed after him. When he passed Donna as her desk she held out a card for him, and he took it without really thinking. A moment later he glanced at it and realized it was Harvey's credit card, <i>his</i>, not his corporate card. \"Is this the right card?\"</p>\n<p>\"Yes.\"</p>\n<p>\"Are you going to tell me why--?\"</p>\n<p>\"No.\"</p>\n<p>Mike knew better than to badger Donna on a topic she wasn't talking on, so he and Hunter headed to the elevators, and thankfully managed to dodge Louis or any other number of assholes who would have made Hunter's brief moments at the firm even more frustrating and annoying. After they slid inside, alone, Mike punched the key for the entrance. \"Favorite subject?\"</p>\n<p>\"History, I guess? At least there's a lot to read.\"</p>\n<p>\"Math? Science?\" </p>\n<p>\"Boring,\" Hunter answered. \"You've got my tests, right? Mom said you can't be emotionally well adjusted if you skip grades.\"</p>\n<p>Mike thought he felt his chest constrict just a bit. \"My mom always said that, too. She said 'Michael, you're a kid. You should take time to be a kid'.\" Mike thought he might be a little ill with a knot curling up inside his stomach.</p>\n<p>\"So you think so, too?\" Hunter asked, and Mike could hear the disappointment, even behind the intensely stoic front he was putting up.</p>\n<p>He shut his eyes, sending a silent apology to his mother. \"Not really. I'll find you a school that will allow some self-pacing.\"</p>\n<p>When he finally opened his eyes and glanced towards Hunter, he saw that the boy had his own eyes squeezed tight, tears spilling out at the corners. The elevator dinged open and Mike carefully took his hand, leading him out so Hunter could continue to leave his eyes shut. He hailed a cab and the two of them headed to the nearest bookstore.</p>\n<p>Two blocks away from the firm, Hunter finally opened his eyes. \"I'm not happy.\"</p>\n<p>\"Ok.\" Mike wasn't going to fight him on that. Telling the kid to be happy or to be sad or to feel anything had never helped Mike. \"Now, we have some rules, you need to either be holding my hand, or I need to be able to see you, alright?\"</p>\n<p>Hunter nodded. \"'Kay.\"</p>\n<p>The two of them spent the next two hours browsing the school prep section, long enough for Mike to determine that Hunter should probably be in high school. Mike didn't really recommend high school for anyone, much less brilliant twelve year olds, but the alternative was a bored kid. Mike knew from experience what happened when a bored twelve year old had bad influences on his life. After their shopping, they were at a little Italian bistro with Hunter working his way through some pasta and Mike doing the same. His phone chimed. Harvey. <i>'Any progress on the case?'</i></p>\n<p><i>'I thought you didn't care. I'm handling it.'</i> Mike glowered at the phone for a moment before he looked back at Hunter. \"There are a few good private schools in Midtown, but I don't know if they'll be able to take you in the middle of the year.\" Hunter didn't answer, just stared down into his pasta. \"How are you set for clothing?\"</p>\n<p>\"I have some at Harvey's.\"</p>\n<p>\"Phone? Computer?\"</p>\n<p>An hour later the kid had a Mac and an iPhone, care of Mike knowing Harvey's social security number. Some days Mike realized he could have been a far more creative criminal. Identity theft would have been way more profitable. He programmed in some numbers, Mike - cell phone and work - Harvey - ditto - and Donna - just work. \"You have a problem, you call me.\"</p>\n<p>\"Does Harvey make you fix all his messes?\" Hunter asked, shoving the phone in his back pocket as Mike added the laptop to the bags they were carrying.</p>\n<p>Hunter wasn't exactly wrong about that, but he doubted Hunter needed to hear that. \"Harvey trusts me to take care of anything for him.\"</p>\n<p>It was obvious Hunter didn't particularly believe that. Mike didn't particularly believe that at this moment. After lunch they were back at Pearson Hardman, Harvey was still missing in action, and after checking with Donna, Mike took up residence in Harvey's office and got to work on his calls. For Mr. Specter, three private institutions in the general vicinity were prepared to potentially offer Hunter mid-semester admission. Mike made a string of appointments for tomorrow.</p>\n<p>\"Do you have a suit?\" And then they went suit shopping.</p>\n<p>By the end of the day, Mike was fairly certain he never, ever wanted to be responsible for another human being, he also had the intense desire to punch Harvey, and to go and thank his grandmother profusely. They ended out the day at a burger joint, and Mike had texted Harvey that he really should actually <i>see</i> his kid. He and Hunter were... well Mike would be hard-pressed to say they had really bonded, but he'd taken some time to actually talk to the kid, share the pieces of his own history that were far too painfully similar, just so Hunter knew that he had a friend, a shoulder if he needed it. He was actually smiling by the time their drink orders arrived at dinner, and then Harvey showed up.</p>\n<p>\"So. Progress?\"</p>\n<p>Hunter's face closed off immediately, and Mike didn't even stifle the urge to kick Harvey soundly in the shin. Harvey barely flinched.</p>\n<p>\"Hunter picked out some furniture to convert your home office back into a bedroom. You'll have to use the den for the office, now. We picked up everything Hunter will need to settle in, phone, computer, some suits. We have three school interviews for tomorrow, after which Hunter and I will discuss which school best suits him.\" Mike rattled off the few additional bullet points of progress that they had made over the day, avoiding mentioning that Hunter was brilliant, was obviously beside himself over the death of his mother and his father being a prick, and generally the kid could use a damn <i>hug</i>, Harvey.</p>\n<p>And then, just when Mike thought they might be getting somewhere, Harvey told him to take Hunter home, Harvey needed to be back at the office.</p>\n<p>Mike took Hunter home by way of Williamsburg, stopping by his apartment to pick up a clean suit, some off hours clothes, and some overnight toiletries. If he knew Harvey, and he did know him pretty well, Harvey was going to avoid the situation by coming home way late, and Mike was going to crash on the man's couch as payback. He wrangled Hunter through and evening bedtime ritual, read some <i>Guns, Germs, and Steel</i> by way of a bedtime story, and then raided Harvey's beer and crashed on his balcony waiting for the man to return.</p>\n<p>*</p>\n<p>\"I'm not letting you bill me for babysitting if you're passed out drunk on my balcony.\" Mike snapped awake to Harvey's voice looming somewhere over him and behind.</p>\n<p>Mike groaned for a minute, sitting up and rubbing his eye. \"What time is it?\"</p>\n<p>\"A little after midnight.\"</p>\n<p>\"And I'm not drunk, I had two beers.\" After scrubbing the sleep out of his eyes he grabbed the remainder of the beer at his elbow to swig out the disgusting taste in his mouth. \"Besides, I needed to confer with my <i>client</i>.\"</p>\n<p>At least Harvey didn't try to bullshit around him and pretend they didn't have anything to talk about. He had been avoiding Hunter and Mike the entire day.</p>\n<p>\"You didn't know?\" Mike asked. Harvey didn't even have to answer, Mike could tell. Harvey hadn't known. He might not be able to read his boss completely, but he had a few tells Mike was becoming aware of. \"One night stand? Ex?\"</p>\n<p>\"You're my Associate. You don't get to grill me on my personal life.\" Harvey was still standing behind him when Mike finally climbed to his feet and turned around. Everything about Harvey screamed to back off, his arms were crossed, his face closed off, and he looked like he'd rather be anywhere else in the world.</p>\n<p>\"Oh no, you just made your personal life into my professional life, so now I get to grill you about your personal life, Harvey. You don't like that, you shouldn't have had me babysit your kid for the last sixteen hours.\" Mike stood closer now, giving Harvey his best semi-intimidating glower, even if he couldn't quite match his boss in height. \"Now sit down and tell me what you should have told me this morning.\"</p>\n<p>\"I didn't know. Naomi and I...\" Harvey sat down on the lounge chair Mike had vacated, elbows perched on his knees, fingers messing up his hair. \"She was with the Department of Justice, I met her when I was in the District Attorney's office. We... had a minute.\" Harvey didn't say anything else for several long moments, finally running his hands over his jaw and the slightly overgrown five-o'clock shadow there. \"I left the District Attorney's office to go to Pearson Hardman, I asked her to marry me, she said she wasn't going to marry someone who chose money over justice, and then she moved to Washington.\"</p>\n<p>Where apparently she'd had Harvey's kid and never spoken to him again rather than reveal the existence of said kid. The thing that Mike realized - that would obviously burn Harvey under the circumstances - was that Mike knew just how dirty Cameron Dennis had been, and maybe it hadn't been the <i>best</i> choice Harvey could have made, but bailing on the DA's office had been good for his soul.</p>\n<p>\"So now you have a kid.\"</p>\n<p>Wrong thing to say. Mike watched Harvey's cheek twitch, clenching his jaw in an obviously displeased fashion. \"You get him into school, you do whatever it takes for him to not be too screwed up, and I'll call it a win.\"</p>\n<p>\"Harvey, I'm your <i>Associate</i>, not your co-parent.\" Mike tried to keep his voice from getting too loud, but he wasn't feeling particularly charitable towards his boss. \"Do you have any idea what your kid's going through right now?\"</p>\n<p>\"No, but you do?\"</p>\n<p>\"Yeah, Harvey. I do.\" Mike didn't sit down, started to pace. \"Why the hell would you shove your son on me if not to make sure I did that thing you claim to <i>hate</i>? Me empathizing with the client doesn't get me anywhere, right? Except when you want to dump your kid and everything he's going through on <i>me</i>. So I'm taking Hunter to his school interviews tomorrow and then that's it. You can't contract out fatherhood, you either bill the damn hours or you don't make the cut.\"</p>\n<p>Mike picked up his beer bottles and started to head back inside. </p>\n<p>\"Where do you think you're going?\"</p>\n<p>\"I'm going to crash on your couch. Hunter and I have to be at the first interview at eight.\" Mike shook his head, not quite believing Harvey. He could be an ass, he really could. \"And this is low, even for you. I put up with a lot from you, because I know you'll fight for me, but if you <i>ever</i> manipulate me like this again...\" Mike didn't know what he'd do, Harvey was a bastard but he was his bastard, and Mike apparently was attracted to that bastard even when he was being a dick.</p>\n<p>\"What did I do?\" Harvey asked, and he sounded... so damn bewildered.</p>\n<p>\"You don't even know?\" Mike rubbed his forehead, tried to shake the fog that was setting in from too little sleep. \"Jessica didn't tell you?\"</p>\n<p>\"Tell me what?\"</p>\n<p>Mike took a deep, steeling breath, trying desperately to feel charitable toward Harvey. Harvey hadn't known, that made the completely cavalier foisting of Hunter onto him only slightly better, but only just. \"My parents were killed by a drunk driver when I was twelve. I got kicked around in the system for a few days while my grandmother - who had been about to retire - tried to get her life in order to raise another kid after she'd just lost her son. She didn't really want me; she loved me, she <i>always</i> loved me, but she just wasn't ready for a genius who was struggling with losing his parents. So you get your shit together, Harvey.\"</p>\n<p>He'd expected Harvey to fight back. Harvey always let Mike rage, and always had a comeback, but this time he just took a deep, shaky breath. \"Go to bed, Mike. You've got an early morning and you want to make a good impression on Hunter's school.\"</p>\n<p>Harvey was... Mike had never seen him like that. He'd seen Harvey upset and a bit unsettled, he'd seen his face when he was about to fire Mike. He knew a lot of different facets of Harvey but the man sitting on the balcony with Mike was a different animal entirely. Mike reached out and gave Harvey's shoulder a squeeze. Harvey didn't even react.</p>\n<p>Mike left him like that, slightly concerned about leaving him, but maybe this was Harvey in the process of getting his shit together. Mike wouldn't know, he'd only ever seen Harvey when he had all the answers. The only time he'd ever seen Harvey not certain of what to do, he'd been about to beat a confession out of a murderer. A Harvey who didn't know how he was going to get what he wanted was a scary Harvey.</p>\n<p>\"You'll get it worked out,\" Mike found himself assuring Harvey.</p>\n<p>Harvey just nodded, back still toward Mike. He did need to sleep, he was dead on his feet as it was.</p>\n<p>\"I have your back.\"</p>\n<p>No answer. Reluctant, but knowing he had little other choice, Mike left Harvey to his brooding.</p>\n<p>*</p>\n<p>Mike was up early, and stole a shower and started a pot of coffee, before he realized it was inappropriate to feed a twelve year old coffee for breakfast, so he made some eggs and toast since Harvey's refrigerator and pantry didn't really suit anything else. Mike was yawning around his cup of coffee when Hunter came into the room, still dressed down and not quite ready for the day. Mike could at least approve of making sure he didn't get his suit dirty.</p>\n<p>\"Now, remember, the interview today is just as much about you as it is the school. You want to pick somewhere you'll enjoy.\"</p>\n<p>\"Yeah right,\" Hunter answered, grumbling around his eggs.</p>\n<p>Mike didn't like his answer, and frowned. \"It is. I picked these schools based on excellent academic rankings, you pick based on what you think is best for you.\"</p>\n<p>Harvey - interrupting by his mere presence - came into the room and started to pour himself a cup of coffee. He was dressed, but only in tie, vest, shirt, and pants, his jacket obviously still somewhere else. He didn't say anything at first, just put in a touch of creamer and then took a sip. Hunter didn't answer Mike's reassurance, just went back to his food.</p>\n<p>\"When are you getting back to the office, today? Louis is hounding me to loan you out for the Pinewood briefs.\"</p>\n<p>Of course, Mike was handholding <i>Harvey's</i> kid through his mother's death and the selection of a private school and all Harvey cared about was loaning him out to Louis who worked him like a dog - or a pony, he supposed. \"Our last interview should wrap up around 2:30. I'll take Hunter home and come back to the office. Three, 3:30.\" Mike glanced over to find Hunter very pointedly ignoring both of them. Mike had never been a fan of being talked about while he wasn't in the room. \"Is that alright, Hunter?\"</p>\n<p>\"You don't ask, you tell. You're an authority figure, not a kindergarten teacher. We're not building consensus.\" And then he left.</p>\n<p>Mike sighed. This fake co-parenting thing worked much better when Harvey didn't countermand him in front of the kid. \"What you want out of a school is important to me, and Harvey has given me... power of attorney on this.\" It was hilarious, most days Harvey acted as though Mike couldn't wipe his own ass without instructions.</p>\n<p>Their first interview was an unmitigated disaster. They took one look at Hunter and his date of birth and sent him packing, no twelve year olds allowed. Mike could have kicked himself for not really checking, but Hunter seemed to be taking the rejection in stride. If he was anything like Harvey, he'd just take it as reason to fight back harder next time. Mike picked them up a coffee for him and a hot chocolate for Hunter to pass the time.</p>\n<p>Their second interview - Addison Prep - was far more suited. They took one look at Hunter, assumed he was brilliant, they talked about Hunter's goals for the new year, and then took him to take a few achievement tests while Mike talked with the Headmaster.</p>\n<p>\"So, Mr. Ross. What is your relationship with Mr. Davis? We like to get a feel for the adults in our students' lives.\"</p>\n<p>For a moment Mike felt like a terrible, incredible fraud, and then he realized he wasn't; with Harvey checking out from Hunter's life, Mike might be all the kid had for a while. \"I'm Harvey's Associate. If Hunter is sick, has any problems, or so forth, I'll be his first line of contact and primary guardian.\" Which Mike had told Harvey he <i>wasn't</i> going to do, but he was a sap and a sucker, obviously. He just couldn't leave Hunter hanging like that.</p>\n<p>\"You will need a letter from Mr. Specter to that effect. We are... very understanding of... alternative parenting arrangements here at Addison Preparatory. But we require the guardians be allowed to make medical or legal decisions on the child's behalf.\"</p>\n<p>Mike frowned for a moment, and then he realized what the Headmaster was implying, and then Mike was vaguely embarrassed on both his own and Harvey's behalf before he finally coughed. \"The letter will be no problem. Please send a form letter to my corporate email, Pearson Hardman.\" Mike pulled out his business card and handed it across the desk, and suddenly having the very immediate realization that he had just been assigned the duties of 'mom' in the eyes of the Headmaster. Fine, he'd just go for broke. \"Harvey and I have a... very close relationship. He trusts me with Hunter implicitly.\"</p>\n<p>The Headmaster didn't even blanch, which honestly surprised him. Apparently they were fairly tolerant. Go them. \"And how long have you been Mr. Specter's... Associate?\"</p>\n<p>Wow, Mike as not going to be able to take his title seriously from now on. That could be a problem. \"Five months. I know, short time, but sometimes you just know.\" Mike was saved from further gay-insinuating small talk by Hunter returning and giving him a completely obtrusive thumbs up. \"If you'd also email me the enrollment forms. You'll have our answer by the end of the day.\"</p>\n<p>Mike, Hunter, and the Headmaster, headed out toward the entrance to the school. The walk and talk was comfortable, going over the school grounds, athletics, extracurriculars, and other information. Hunter was obviously paying attention, trying to get a feel for the place as well. Mike was glad he was taking this seriously, perhaps the chance to get into high school in some more appropriate material would be just the thing he needed to help him deal with his mother's death. Mike knew it would have done him a world of good, if only to get away from Trevor; just after his parents died was when he started to get into the worst of his own bad life choices. Trevor's bad habits immediately became Mike's bad habits and Mike did not want that to happen to Harvey's kid.</p>\n<p>He and Hunter finally powwowed over lunch. \"You seem excited about Addison.\"</p>\n<p>\"You and Harvey are really going to let me go to a high school?\" Hunter didn't seem to believe it, but Mike was more than ready to allow it and... well Harvey currently didn't care. Even if Harvey wouldn't actively say it, he was definitely a 'do it, and then fuck forgiveness because you did the right thing' type.</p>\n<p>\"I'll make it happen for you, Hunter.\" That he could promise, because he was not letting Harvey - or Hunter - down on this one. \"Now let's talk pros and cons so you can weight your last option for school.\"</p>\n<p>There was no contest, by the end of the day, Hunter wanted to go to Addison Prep, Mike wanted him to be happy, the school had an excellent academic reputation, and there it went. Mike dropped Hunter off at Harvey's, made sure he was set for the afternoon, and then headed into work. He called the Headmaster at Addison, said they intended Hunter to enroll, filled out the kid's forms, the emergency contact forms, the waivers, the authorizations, and everything else under the sun. Mike had it memorized back to front by the time he rolled into Harvey's office a little after four.</p>\n<p>\"I proofed the briefs for Louis, he's happy - or as happy as Louis gets.\" Mike pulled out his folder. \"Pull out your signing hand, we've got enrollment papers.\"</p>\n<p>Harvey didn't even ask, just pulled out a pen and uncapped it. Mike set down the first piece of paper. \"Obscenely large check for enrollment fees, tuition, activity fee.\" Harvey at least glanced at that, and didn't even arch an eyebrow at the amount. He signed. \"Enrollment agreement. Pretty standard.\" Another signature. \"Liability waiver if Hunter participates in sports.\" Harvey signed. \"Permission for me to sell Hunter's kidneys on the black market should the need arise in the course of school.\"</p>\n<p>Harvey did not sign, but instead looked up at him and gave him a 'don't mess with me, Mike' look.</p>\n<p>\"It's a form so I can tell them to send him to the hospital, treat him, and so on. It's a limited power of attorney and they won't let me pick him up or deliver him to school without it.\" Harvey signed. \"Guardian contact form. Sign under section (b).\"</p>\n<p>\"Why not section (a)?\"</p>\n<p>\"Because if you sign under section (a) they call you first, if you sign under section (b) they call me first.\" Harvey signed under section (b). \"Also, Addison Prep now thinks we're gay and I'm Hunter's step-father.\"</p>\n<p>\"What?\" Harvey actually leaned in and looked at the contact form. \"It lists you here as a... non-relative, parental approved guardian. That doesn't imply gay step-dads.\"</p>\n<p>Mike just rolled his eyes. \"Because it's so normal for a lawyer to have his Associate go to a school interview, and then sign himself up as a primary emergency guardian and contact.\"</p>\n<p>\"So you're saying it's not your fault that they inferred that you're my gay lover?\" Harvey shot back.</p>\n<p>\"No, it's <i>your</i> fault. Which <i>sucks</i>, because Hunter's math teacher... mmm!\" Actually the woman had been pretty fine, and the Headmaster had introduced Mike as Hunter's 'alternate parental guardian', which apparently was code for 'gay boyfriends' at the school. Mike didn't even really want to know how that had come about. Mike took all the paperwork and slid it back into his folder, finally folding it up and hugging it loosely to his chest.</p>\n<p>\"Wait, Addison Prep is a high school. Hunter is twelve.\" Harvey made a gesture that Mike took to mean 'give me the paperwork back' and Mike ignored it, instead tucking the folder under his arm.</p>\n<p>\"How good of you to do basic math.\" Mike fiddled with the folder again, tapping his fingers against it. \"I enrolled him in high school because he was bored in middle school. Do I need to tell you what happens to bored geniuses who aren't intellectually challenged by school?\"</p>\n<p>Harvey didn't even need to think about it, he snapped back an answer just a moment later. \"They smoke pot with their asshole best friends and almost commit drug trafficking?\"</p>\n<p>Mike might not have been quite that blunt, but the analysis was pretty on the nose, so he held up his finger and nodded.</p>\n<p>\"... Good idea with the high school.\" Harvey finally closed his eyes, took a breath. \"Thank you.\"</p>\n<p>\"Have your shit together, yet?\" Harvey's frown was all the answer Mike needed. \"Harvey you just... <i>be</i> there. What's the real problem? Living proof you didn't close a deal you really wanted to?\"</p>\n<p>Harvey got up from his chair; for a moment Mike expected him to shoo him out of the office, but instead he just went to stand at the glass window and stare out over the city. \"I'm over Naomi; that's not the issue. I never wanted kids, and if I was going to have kids it was going to be with someone who would take care of all the... crap.\"</p>\n<p>\"Those emotions you don't have?\" Mike asked. \"You don't know what to do with them? Look, you... gave Hunter to me because you didn't know what the hell to do with him. That should mean something like you trust me implicitly, but mostly it means you didn't want to deal with him. So... tonight... <i>talk</i> to him.\"</p>\n<p>\"He is a small child,\" Harvey answered. \"It will be only slightly worse than trying to explain to you why getting emotionally attached to your clients is a bad call.\"</p>\n<p>Mike glanced over at Harvey, tried to figure out if Harvey was being dense, stupid, or intentionally hurtful, but it seemed that Harvey might understand how to manipulate emotions, but he really wasn't able to figure them out how to actually have them. \"Your son's mother just died. She was shot as part of her damn job. He is never, ever going to get to see her again. She is never going to tuck him in, or kiss him on the head, or tell him not to eat all the Cheetos before bed. And when he realizes that, when it really, <i>really</i> sinks in that this isn't just a really annoying vacation to see the guy with the slick hair who doesn't like him, he is going to break.\"</p>\n<p>Harvey's jaw twitched slightly, but Mike just continued to power through.</p>\n<p>\"And what he does, if he's going to jump a train back to Washington or take up with some assholes who shove coke up their nose or any other lousy coping mechanism under the sun is on you. If you're <i>lucky</i>, he'll come to me.\" Mike just couldn't figure this out anymore. Harvey was hardly an open book for him, but it wasn't usually this hard to tell what he was thinking. \"Are you going to tell me what about this is so shocking that you can't do your damn job?\"</p>\n<p>Harvey glanced over to Donna's desk, where she was sitting, carefully plugging away at whatever work she was pretending to do. \"Donna, not to be disturbed, and stop listening.\" The instruction was was only accompanied by a soft click. A few moments later he sat down. Mike had expected him to maybe take the chair, a silent 'keep away' tactic, but Harvey sat on the couch facing the window to the city. \"My mother cheated on my father constantly growing up, every week another casual boyfriend. We didn't even know until she decided to leave him.\"</p>\n<p>Mike very politely ignored saying that Harvey's personal decisions on that front weren't exactly blameless. He knew Harvey spent more than enough time chasing skirts and sleeping with them. Instead of mentioning any of that, Mike stayed silent.</p>\n<p>\"I <i>hated</i> her, still do.\" Harvey pressed his palms to his knees, maybe thinking, maybe considering what to say, but he finally nodded. \"I keep thinking that Hunter must hate me, too.\"</p>\n<p>\"Hunter doesn't <i>know</i> you, Harvey.\" Mike could see Harvey flinch, maybe even a twitch. \"You're just a guy in a suit who pawned him off the second you had a chance.\" Mike wasn't certain he wanted to let Harvey off the hook, but as much as Harvey was driving him crazy, he didn't want to shoot him in the foot that bad. \"I told him you put me on your most important cases.\"</p>\n<p>\"That's an overstatement,\" Harvey said, smirking.</p>\n<p>Mike couldn't even find it in himself to be upset. That was just Harvey being Harvey. \"So you're worried he'll hate you for not loving his mother?\"</p>\n<p>No answer. Mike decided to read that as a maybe.</p>\n<p>\"Hunter doesn't need his mother to have been your one true love, people get divorced all the time.\" Mike wasn't certain what Hunter did need to know, but that wasn't the most important thing. \"He needs to know you didn't know about him and that you wouldn't have rejected him if you'd had the chance.\"</p>\n<p>\"So you want me to lie.\"</p>\n<p>Mike knew Harvey hadn't know about him, so that left the second clause. \"You really wouldn't have loved him and supported him if Naomi said yes twelve years ago?\"</p>\n<p>\"Probably not. I was a new associate at Pearson Hardman, who has time for kids?\"</p>\n<p>Mike gave Harvey his very best 'you have got to be shitting me' face.</p>\n<p>\"Fine. Fine. I would have gotten him a Yankee's uniform onesy with 'Specter' embroidered on the back. Happy?\" Mike was, and even though he knew it was courting disaster he couldn't quite help but smirk at the declaration. Harvey Specter, closet power-dad in the making. \"I would have... done something.\"</p>\n<p>\"Harvey, I know you're a bit... work, play, emotions.\" Mike made the requisite hand gestures to indicate the relative priorities, which put Harvey's emotions very low on the list. \"but you have to tell him that. Your anxiety is going to be even more obvious, he's going to pick up on it, and he's going to resent you for it.\"</p>\n<p>\"I'm not anxious, and he shouldn't come to me. I hired you to take care of my minutia.\"</p>\n<p>Mike rolled his eyes. \"Comparative size of the effort you made to actually become a father notwithstanding, a kid is not a minutia. You ready? Here you go: Harvey Specter treatment.\" Mike stood up, sweeping his jacket back with the fists he placed on his hips. \"Here's what you're gonna do: you're going to go home tonight, you're going to take your kid out to dinner for pizza, you're going to tell him the PG version of why you never married his mother. You're going to tell him that you would have made an effort, and that as much as this was a surprise you're going to make the effort from now on. Finally, you tell him you sort of suck at emotions, so if he needs a shoulder that's why you have me.\"</p>\n<p>Harvey took a long, slow breath in, and then out. \"Fine.\"</p>\n<p>\"Fine?\" Mike was honestly shocked. \"I expect results, Harvey, none of this unemotional dicking around you're so fond of. This habit of you not giving a shit is really going to stunt your kid's emotional growth.\"</p>\n<p>Harvey snorted, thankfully amused and not annoyed by Mike's declaration that so closely mirrored Harvey's usual complaints about Mike. \"Get the hell out of here before I decide you're more trouble than you're worth.\"</p>\n<p>Mike turned to leave.</p>\n<p>\"Wait, Mike.\" Mike waited. \"He's smart?\"</p>\n<p>\"Well he's no me, but yeah, he's pretty damn smart.\"</p>\n<p>\"So he's an idiot,\" Harvey answered, smirking again. \"Mike... thanks.\"</p>\n<p>Mike shoved his hands in his pockets and then shrugged, not quite certain what to do with the thanks. \"I'll be at your condo at 6:30 tomorrow morning to pick up Hunter for his first day. Tell him he needs to wear a suit, he'll have his uniform to change in tomorrow and you want him to look nice.\"</p>\n<p>\"I <i>don't</i> want him to look like an idiot.\"</p>\n<p>\"No, you want him to look nice.\" When Mike thought the instruction might have finally sunk in, he turned and walked out of the office, leaving a confused Harvey in his wake, much to his own amusement.</p>\n<p>Donna grabbed his arm as he breezed by her desk. \"Did you break him?\"</p>\n<p>Mike glanced over his shoulder and saw Harvey, back to him, staring out the windows of his office, hands on his hips, obviously thinking. \"Probably just a little. Nothing he can't handle. Can I ask you something?\" Donna didn't object, which in Donna-speak was at least a slight approval. \"Why didn't he dump Hunter on you?\"</p>\n<p>\"What, because I'm a woman and therefore have a genetic predisposition to understanding small booger factories?\" Donna did not sound pleased, which was really mostly an edge, but Mike could tell.</p>\n<p>\"No, because he's known you for over twenty times longer than me. I could have sold him for drugs and Harvey probably wouldn't have noticed for a week.\" Not that he would do that, but his point still stood. Anything Harvey thought he knew about Mike, he knew two dozen times better for Donna. \"But he didn't ask because you hate kids. Got it.\"</p>\n<p>\"I don't <i>hate</i> kids, they are just small and annoying.\"</p>\n<p>Answer telegraphed and received, Mike went back to his desk, shaking his head as he went. No wonder Harvey and Donna worked so well together, they had particularly complimentary damages. He wasn't sure what that made him, but he didn't care. He was the guy who was going to help Hunter get used to the weirdness that was having Harvey Specter in your life.</p>\n<p>*</p>\n<p>Hunter came down to meet Mike just at 6:30, dressed neatly, and slid into the cab Mike had come over in. He had his book bag as well, filled with note-taking implements. Mike watched Hunter sigh, dump the bag on the ground and then buckle up. \"Did you eat breakfast?\"</p>\n<p>\"Harvey is so full of shit.\"</p>\n<p>Mike took that as a no. \"Drive through at the Starbucks down the street, please,\" he told the driver, and then turned back to Hunter. \"I have known Harvey for a while, so while I can say that's not a bad assessment, what's brought that on?\"</p>\n<p>\"Last night. We got this pizza, and he like... I don't even know what we were talking about.\" Hunter glowered and then looked out the window. \"I think he was trying to say he used to like my mom and was going to try to be a dad or something, but he doesn't even <i>like</i> me.\"</p>\n<p>The modest joy that Mike was going to get out of telling Harvey he'd failed his homework was completely overshadowed by Hunter actually seeming to be legitimately upset. \"Hey.\" He reached out, put a hand on Hunter's shoulder, and Hunter didn't flinch away, so he pulled the boy into a one armed hug - or as much of one as could be managed in the back of a taxi with them both belted up. \"Harvey... he sort of isn't good with his emotions. I never knew your mom, but I imagine that was part of the reason he and your mom didn't click enough to get married. With Harvey you have to read what he doesn't say, what he does. That's why he's having me do all this stuff with you rather than do it himself, because he's smart enough to know he's not great at it.\"</p>\n<p>Hunter just scooted away and put his forehead on the glass of the cab. \"Why couldn't you be my dad?\"</p>\n<p>Mike felt his throat constrict for a moment, painfully so. He sort of wished he could be, right now, then it would be less inappropriate for him to want to hug Hunter and make him feel better.</p>\n<p>\"And how the heck do you put up with Harvey?\"</p>\n<p>It really did help if you found him painfully attractive, not that Mike was going to tell that to Hunter. \"I've known him long enough to see him care. You will, too.\"</p>\n<p>After scarfing down Starbucks in the back seat of the cab and getting to Addison, Mike unloaded his bike, he and Hunter went to the Headmaster's office and got all the paperwork squared away and Hunter was ready for his first day in a new school. The two of them stood together in the Headmaster's office a few moments longer, even after Hunter was clinging to his new schedule.</p>\n<p>\"Hey.\" Mike squeezed the kid's shoulder in his neatly pressed school uniform. \"You're a Specter, nobody is going to get the better of you.\"</p>\n<p>Hunter answered by grabbing Mike around the waist and burying his head in Mike's chest for a moment. They stayed there like that as Mike forgot how to breathe, arms wrapped around Hunter, hugging him back. \"Thanks, Mike.\"</p>\n<p>\"And remember, you call if you have any problems. Text me when you get home, and don't make me go all Ronald Reagan on your ass.\"</p>\n<p>\"Trust but verify?\" Hunter asked, reminding Mike, very quickly, that Hunter was Harvey's kid. If anyone was going to be able to match him catch phrase for catch phrase, it was going to be Hunter.</p>\n<p>Mike held out his fist, Hunter fist-bumped him back, and then headed out of the room into the corridor. The weight of oppressive authority figureness left him very suddenly and he leaned against the nearest wall, exhaling.</p>\n<p>\"I can see what Mr. Specter sees in you.\"</p>\n<p>That commentary from the Headmaster was more than Mike really wanted to deal with right now. \"Thanks. You have my number.\"</p>\n<p>The need to get out of there was quickly becoming oppressive, and Mike biked the rest of the way to work, finally locking up his bike and heading into the building just in time to have Harvey catch up with him.</p>\n<p>\"You need to hire a car or something for the Davis case.\"</p>\n<p>\"It starts tomorrow. Sadly I can't use Ray.\" </p>\n<p>Harvey took a long sip on the cup of coffee he'd gotten from the truck outside. The elevator they got onto together was overcrowded, and Mike didn't think it would be appropriate to start up the conversation about Hunter. Harvey, however, didn't seem to think he should keep his thoughts on the matter to himself.</p>\n<p>\"There's a reason I never try your ideas, Mike.\"</p>\n<p>\"Because you suck at implementing them?\" Mike shot back immediately. Harvey just glowered. \"I smoothed things over with the client. You're welcome.\"</p>\n<p>Maybe it was weird that he was calling Hunter 'the client' but it didn't matter. As far as Mike knew, almost no one at the firm actually knew who Hunter was. Harvey seemed to want to keep it that way, and Mike could at least respect that. Harvey should at least be on his fatherhood feet before he had to be subjected to Louis - or anyone else - ragging on him about the topic. Mike trailed Harvey all the way to his office, before they finally slid in together, Harvey closed the door, and glowered at Mike.</p>\n<p>\"How did you smooth things over? By telling him everything?\" Harvey asked, in no mood for mincing words, apparently.</p>\n<p>Mike slung his bag onto Harvey's couch. \"I told him you weren't really an emotive person, you show you care in actions. And then because I'm the best Associate ever, I reminded him that you assigned him to me.\" And Mike, for all his faults, was not emotionally constipated.</p>\n<p>Harvey deflated, collapsing into the couch again. \"Thanks.\"</p>\n<p>\"You're not used to sucking this hard, are you?\" Mike was trying to be sympathetic, he really was, but they weren't exactly the mutually comforting and supportive types. \"You like this--\" and then Mike gestured over his head. \"Try again tonight. He's going to text me when he gets home.\"</p>\n<p>\"How do you <i>know</i> all this?\" The mirror of their very first conversation was weird; it reminded Mike that Harvey - and Jessica - were terrifyingly impressed of his law knowledge. Harvey was impressed with him; even though he hadn't gotten what he wanted last night from Hunter he was still coming to Mike for advice and still staggered by his knowledge.</p>\n<p>\"It's... I'm just <i>remembering</i>, Harvey. I'm remembering what I really needed, what I wished Grammy could have given me.\" Mike took a seat on the couch next to Harvey, the two of them too close together, but Harvey didn't pull away. \"Sometimes I needed a friend, sometimes I needed discipline, sometimes I just really needed a distraction.\"</p>\n<p>\"So I'm the disciplinarian.\" Harvey smirked at him. \"You would decide to be the fun parent.\"</p>\n<p>They weren't co-parents. He wished Harvey would stop acting as though they were, because it was already starting to leave him twisted up when he thought about what he and Hunter and Harvey <i>weren't</i>. \"You get to be the guy who knew his mom. You're his connection to her, not just because you plus Naomi got you Hunter, but... you get to tell him stupid stories about when you were at the DA's and she was at DOJ and how you met, what she meant to you. When he's older he's going to want to know what Naomi was like, what she thought about, her beliefs... otherwise he's going to wonder...\" Mike shook his head, trying to clear it, but the fog didn't go away, the prickle of wetness in the corners of his eyes didn't go away. \"Where he came from, what he's even doing in the world sometimes.\"</p>\n<p>Mike stood, pressed his fingers into against his eyes to remove the tears that were threatening to fall, and he headed out of the room.</p>\n<p>\"Mike.\"</p>\n<p>\"I've got Preston briefs to deal with.\"</p>\n<p>Harvey let him leave.</p>\n<p>*</p>\n<p>It was sometimes easy to forget that he was playing non-sexual co-parent with Harvey. With Hunter now taking a car service to school, and heading home after classes, Mike saw him only the two or three times a week Hunter required the sort of active parenting that Harvey seemed disinclined to provide. One weekend day a week he spent taking Hunter to something culturally significant, a museum or theater in the park. One weekend they took a boat around to see the Statue of Liberty and Ellis Island.</p>\n<p>Most people who saw them when they went out assumed that Mike was Hunter's father - even though he was far too young to have a kid Hunter's age - and thought he was the most adorable dad ever. Mike tried to not let it get to him.</p>\n<p>It wasn't working.</p>\n<p>\"Do you ever find it weird that dad pays to babysit me, but everyone thinks you're my dad?\"</p>\n<p>Mike tried to shrug it off. \"A little.\" He could admit that much. \"You're a good kid.\" Mike slung his arm around Hunter's shoulder and the kid didn't shrug him off, just sat through it. \"Is Harvey getting any better at communicating?\"</p>\n<p>\"He checks over my homework now... and says stuff like 'not bad' when I get all the problems right.\" Hunter shrugged, but not to relieve him of Mike's arm. \"He bought me some shoes I wanted, and he... told me stuff about mom when I asked. I guess he's doing alright.\"</p>\n<p>\"He's trying.\" Mike was almost proud.</p>\n<p>\"Yeah. I wish you'd come chaperon dinner more. That's the worst, almost two hours where we have to pretend to talk to each other. After he's done asking about school he doesn't have anything more to say.\" Hunter finally did shrug off Mike, and tilted his head towards a soft pretzel stand a few feet away. Mike dug out his wallet and handed over a ten, a few minutes later, Hunter came back with two soft pretzels, Mike's with mustard on half of it, Hunter's plain. \"You must talk to him, right?\"</p>\n<p>They talked a lot, more than a lot, but that didn't make Harvey make much sense. \"You could ask him about being a lawyer.\" Or being right. Harvey was only too happy to talk about how right he is.</p>\n<p>\"I don't want to be a lawyer.\"</p>\n<p>Harvey might think anything of that. Mike didn't know. \"Being a lawyer isn't just about arguing cases, it's... it's about knowing your options, standing up for what you believe in, and having opinions. When I was your age...\" Mike stopped himself short, because he was one game of backgammon away from becoming far more like his grandmother than he was entirely comfortable. </p>\n<p>Hunter snorted. \"Go on, do tell, Mike.\"</p>\n<p>\"Just...\" Mike reconsidered what he'd been about to say, the idea of putting his own old pain on Hunter rather than trying to take some away was intolerable. \"I wish I'd had someone to tell me my options. I would have messed up far less with my life.\"</p>\n<p>\"It couldn't have been that bad. You're a lawyer, now.\"</p>\n<p>It wasn't as though Mike could tell Hunter the truth, that his life was only alright because Harvey had taken a chance on a down-on-his-luck kid, and Jessica had backed him up when the hour was needed. \"Not <i>too</i> bad. I still have a misspent youth that Harvey probably doesn't want me telling you about.\"</p>\n<p>\"If you think that's going to make me uninterested you're the worst lawyer ever,\" Hunter answered, but he just curled an arm through Mike's as they walked through the park.</p>\n<p>\"I'll tell you when you're older.\" Mike then abused his guardian-prerogative to ruffle Hunter's hair. \"Are you still settling in alright?\"</p>\n<p>The evasive look on Hunter's face made Mike particularly worried for a moment, but he tried to hide it by pulling off a small bite of un-mustard-covered pretzel and dipping it in the mustardy part. He could do this. While Harvey responded pretty well to the hard sell, kids seemed to work better with a soft sell, let them come around, make them think it was their idea to tell you something. \"Classes are good.\"</p>\n<p>Mike tried not to frown. Hunter didn't sound like he was lying on that point, and Mike was the recipient of all of Hunter's grades, tests, and papers, so he knew Hunter's scores weren't slipping. \"Does that imply something else isn't?\"</p>\n<p>\"A lot of the kids have heard... um... that I've got two dads.\" Hunter took a huge a bite of his own pretzel, obviously buying time while he chewed. \"And so they give me a hard time, ask if I'm gay too. So... yeah.\"</p>\n<p>\"You're getting teased?\" Hunter's shrug-answer said it all. \"I could talk to the Headmaster. Harvey could threaten to beat up the kid's parents.\" Harvey <i>delighted</i> in threatening to physically assault people, and Mike tried to ignore how nice it would have been to have Harvey dedicated to defending his - and his kid's - honor on that front. \"It's not a big deal, really.\"</p>\n<p>Mike <i>meant</i> that he didn't care that Hunter's schoolmates thought he was gay, but Hunter seemed to take it as a blanket statement about being gay in general. \"I know. Harvey said...\" Mike waited, hanging on Hunter's every word. \"He said he wasn't much into anyone when he was my age. Baseball, however... He wants me to play baseball.\"</p>\n<p>\"Do <i>you</i> want to play baseball?\" That was the question.</p>\n<p>\"I'd play catch, I guess, or go to a game.\"</p>\n<p>\"Tell him that,\" Mike said, wrapping his arm back around Hunter's shoulder. \"He's a bit of a softie under the exterior, trust me.\"</p>\n<p>\"Are you coming to the science fair next week?\" Hunter asked, out of the blue. \"I know it's in the evening and you usually don't come over for late evenings, but it's... I'd like you to come. Harvey said he probably wouldn't make it.\"</p>\n<p>Mike wanted to kick Harvey. Who would miss an evening science fair that his son was obviously proud about? \"Of course. It was in the email bulletin, right?\" Mike read them every Tuesday morning at work to make sure he was up on all of Hunter's activities and the happenings at Addison Prep. \"Wouldn't miss it for the world.\"</p>\n<p>And Mike <i>wouldn't</i>, which was one of the things that seemed to differentiate him from distant-dad Harvey.</p>\n<p>On Monday he walked into Harvey's office, put the weekend's work on Harvey's desk, and then left. \"Go to your kid's damn science fair, Harvey.\"</p>\n<p>*</p>\n<p>Mike really didn't expect Harvey to show at the science fair, that just wasn't his style, it seemed. But Mike left work around 6:30, got to Harvey's place just before seven, picked up Hunter and his science project, before they headed over to school and Hunter got set up. Some people might have thought it was weird to spend their Friday night going to their boss' kid's science fair, but Mike couldn't think of much he would have liked better.</p>\n<p>Well, he would have preferred getting laid, but that had always been easier when he followed Trevor's lead, and Trevor... wasn't in his life anymore, and really shouldn't have been in Mike's thoughts tonight either.</p>\n<p>Mike helped Hunter unload his project from the back of the town car, and the two of them cut through the halls of the school to the auditorium. Hunter headed to his assigned space, and Mike helped to make sure the project was neatly on display and Hunter looked his best, not a hair out of place. \"Knock 'em dead.\"</p>\n<p>\"It's not a competitive sport,\" Hunter answered.</p>\n<p>\"You still play to win.\" Mike allowed himself one more moment to squeeze Hunter on the shoulders. \"Make your dad and me proud.\"</p>\n<p>Mike settled in at Hunter's side, watched as he started to field questions from the rotating parents. He <i>was</i> intensely proud, and he really wished Harvey were here to see this. Hunter had other ideas.</p>\n<p>\"Mike, you can go look at the other projects. I'm fine on my own.\"</p>\n<p>He grabbed his chest, and made a mock-pained 'ahh' sound. \"Cast off and betrayed.\" But he did leave Hunter to his project. Mike remembered well the intense desire to feel independent in high school; no smothering his boss' kid with affection. </p>\n<p>Mike was half way down the row Hunter's project was in when he heard a voice behind him: \"Michael?\"</p>\n<p>\"Oh, Judy.\" Mike shook Hunter's math teacher's hand. \"The kids' projects look incredible.\" He had only joked about her to Harvey once, and Judy had never given any indication of actually being interested, but Mike did appreciate the option of having an adult conversation once and a while that didn't revolve around the law.</p>\n<p>\"Hunter wouldn't quiet down about how excited he was to have you here tonight.\" That made Mike happy, but it should have been Harvey that Hunter had wanted to have here. \"His project is very well thought out. Are you sure you didn't help him?\"</p>\n<p>\"Just took him to the library,\" Mike answered. \"We go at least once a week.\"</p>\n<p>\"I think it's great,\" Judy said. \"You're so involved in his life. So many of the parents send their nannies or au pairs, you really put in the time that Harvey can't.\"</p>\n<p>Mike's only answer was a nervous chuckle, because, wow, how did his life suddenly become so awkward again?</p>\n<p>\"That's really what makes him so special.\" Mike heard the voice from behind him - instantly connected it to who it was - but couldn't quite shake the temporary surprise of having Harvey actually come to the fair. \"So emotionally invested.\"</p>\n<p>A moment later he had an arm slung around his shoulder, and Harvey was all but painted onto his side. His boss had an arm around him and was hugging him. Mike's brain might have gone a little fuzzy for a moment.</p>\n<p>\"Did I miss anything, hon?\"</p>\n<p>Harvey just called him 'hon'. His world might very well be ending. \"Harvey,\" Mike managed to muster what he thought was the right level of fond enthusiasm, because Harvey <i>had his arm around Mike and was hugging him</i>. \"This is Judy Buckley, Hunter's math teacher. I thought you weren't going to be able to make it.\" Because as much as Mike had wanted Harvey here for Hunter, Harvey <i>HAD HIS ARM AROUND MIKE AND WAS HUGGING HIM</i>.</p>\n<p>\"Finished up early.\" Harvey held out a hand to Judy and they shook, politely. \"Harvey Specter, Hunter's father and Mike's Partner.\"</p>\n<p>Oh that son of a bitch. It wasn't even like Harvey was lying, he was the Partner that Mike was assigned to, so yes, he was Mike's Partner, but if Harvey kept at that, Mike was fairly certain he was going to tackle Harvey to the ground and either beat the shit out of him or rub off on him, possibly both.</p>\n<p>Judy was completely immune to the subtext of the moment, probably because she was just reading the subtext as text, like Harvey had obviously intended. \"It's so wonderful you have a Partner like Michael. He's so involved with Hunter's schooling, most step-parents can hardly manage to learn their step-children's names.\"</p>\n<p>\"Well that's just Mike,\" Harvey answered, his lip curled in an amused smirk that Mike recognized instantly as trouble. \"From the moment I met him I knew he was the one.\"</p>\n<p>Mike's brain shorted out again, it really did. He thought he might even be starting to sweat. Stupid Harvey and his attractive face and the way he just flirted with Mike sometimes like it was nothing. \"Michael has mentioned before. Love at first sight.\"</p>\n<p>That was <i>not</i> what he had said. He had said that when they first met they had hit it off immediately. \"Well. It's been <i>lovely</i>, but Harvey we really should go see Hunter's project now and that's nice.\" And Mike all but physically dragged Harvey away from Judy because his brain was going to explode if Harvey didn't get his arm off from around Mike's shoulders. \"What the hell do you think you're doing?\" He asked, when they were far enough away for Judy to not overhear.</p>\n<p>\"You said you accidentally made them think we were a gay couple,\" Harvey answered, clearly thinking nothing of how off-balance he was making Mike.</p>\n<p>\"And so your punishment for that is to actually play like we're a gay couple?\" Mike hissed, mouth perhaps a touch too close to Harvey's ear, but he was used to that brief proximity that came from when they conferred together in court. \"You know Hunter already gets picked on for having gay dads, right? Do you need to add fuel to the rumor mill?\"</p>\n<p>\"You're mixing your metaphors.\" Harvey ignored the main emotional problem, completely, as was his wont. \"And besides, if people are going to think he has gay dads, they should be the best damn gay dads ever. So shut up and smile, hon.\"</p>\n<p>\"Oh, it's on.\" So Mike slung his arm low around Harvey's waist under the suit jacket, fingers brushing along the seam where Harvey's vest went from suiting to the more flexible cotton in the back. Mike - unlike Harvey - had shed his suit jacket, but still had on his dress shirt and tie. It made them an odd mis-match, as always, with Harvey so intensely buttoned up while Mike wore his permanent five o'clock shadow and mussed hair. \"So how was your day, dear?\"</p>\n<p>Harvey, the ass, pressed his face so close to the side of Mike's head than he nearly had his nose touched to Mike's temple. \"Fine, fine. Closed an important deal.\"</p>\n<p>\"Preston?\" Mike asked, and he cursed his own natural response to turn toward Harvey when he answered, because they were now close enough that their noses had nearly bumped, and Harvey only pulled away enough to keep that from happening, not to create an actual proper amount of space between them.</p>\n<p>\"Mmm.\" Harvey's confirmation did an uncomfortable thing to Mike's spine sending a very brief shudder along Mike's back that he couldn't suppress. \"Best closer in the city, after all.\"</p>\n<p>\"On my summaries and briefs.\"</p>\n<p>\"Don't ruin it.\" Harvey's voice continued to be warm and comfortable. \"I'm here, aren't I?\"</p>\n<p>Mike felt his brows knit together for a moment, trying to figure out this version of Harvey. He'd never seen him, not even late at night, or the few times they'd spent time off work together. \"I have said that showing up is a large part of parenting. Come on.\"</p>\n<p>Harvey finally relinquished control of Mike's shoulder, and Mike pulled away from Harvey a barely-respectable few inches to head over to Hunter's project. Harvey actually primed Hunter to discuss it, and then Hunter explained, pointing neatly at each panel as Mike watched with something like stunned awe. Finally, Hunter shooed them away, and Mike headed down the row of projects in the other direction. Mike didn't want to be the first one who blinked...</p>\n<p>And then Harvey slung an arm over Mike's shoulder again, and Mike slid his arm under Harvey's jacket. \"You didn't suck at that, Harvey.\"</p>\n<p>\"Thank you, Michael,\" Harvey answered, finally smirking over at him. \"Really, 'Michael'? You hate being called Michael.\"</p>\n<p>\"It was either 'Michael' or 'Mr. Ross' and I was not allowing 'Mr. Ross'.\" He caught Harvey's skeptical look. \"What? I'm not going to date Hunter's math teacher.\"</p>\n<p>\"That never stopped you from being inappropriately attached to people you work with, Mike.\"</p>\n<p>Rachel, not Harvey, Harvey wasn't talking about Mike's inappropriate crush that he was silently having nurtured by the way Harvey's thumb lightly dug into the seam of his shirt at his shoulder. \"Caring isn't a weakness.\" Except right now, right now Mike would have preferred not to care. He would have preferred Harvey not run his hand down along his shoulder and his upper back as the two of them walked and looked at the projects.</p>\n<p>Most of the kids recognized him, and he received several polite 'Mr. Ross'es from the kids as they passed. Harvey occasionally got a 'Mr. Davis' or a 'Mr. Specter' from the kids who were a little closer to Hunter. When they got to the end of the first row of projects and slowly started to circle back around, Harvey leaned back in to his personal space. \"Love at first sight, huh?\"</p>\n<p>\"You were the one who picked me, remember?\" Mike took a deep breath, reminding himself that even if he got smart with Harvey in the privacy of Harvey's office that was different from being an ass in public. \"You fell in love with my brain, a moderately narcissistic move on your part, but I have proof. I just let people infer that you fell in love with the rest of me, too.\"</p>\n<p>\"Was being my gay boyfriend really the path of least resistance, Mike?\" Harvey asked, and the jerk actually had the nerve to brush his thumb along Mike's throat, caressing the damn pulse point like that was a completely normal thing for him to do.</p>\n<p>Mike didn't answer.</p>\n<p>Harvey actually did press his nose against Mike's throat. \"Hmm?\"</p>\n<p>\"Is this funny for you?\" Mike hissed through his teeth.</p>\n<p>\"Yeah,\" Harvey answered. \"Pretty funny.\"</p>\n<p>Mike pulled away, grabbed Harvey's elbow, and then dragged his <i>Partner</i> out of the auditorium and into one of the abandoned side halls, before pushing him against the wall. \"Look, Harvey, this isn't funny. This is Hunter's <i>school</i>, he has to come here every day. You want to mess with me, fine, but don't mess with Hunter's life.\"</p>\n<p>Harvey didn't answer, and when Mike glanced up he saw Harvey looking at him, really looking, the way he did when he fixed those too-perceptive deep brown eyes on him and seemed to see whatever he'd been looking for. Mike looked away.</p>\n<p>\"Look at me.\"</p>\n<p>Mike did. He did even though he knew he shouldn't. Mike might not know how Harvey did it, but he knew the instant Harvey had seen whatever it was he was looking for. His whole demeanor changed, his back straightened, he pulled far enough away that Mike could see the tension in his jaw.</p>\n<p>\"You want me.\" Harvey neatly encapsulated the anxiety of Mike's life in three simple words.</p>\n<p>He opened his mouth to protest. Harvey shut him up by falling on him, mouth hard and demanding on Mike's. Neither of them had much finesse to start, Mike's arms ended up somewhere around Harvey's back, pulling him in closer, fingers digging hard into Harvey's well-muscled back and shoulders. Harvey's hands ended up somewhere on Mike's lower back, tugging them so close they had to tangle their legs between each other to stay standing. After that it was all smooth sailing as Harvey took command of Mike's mouth, dragging a few truly inhuman sounds out of Mike that probably would have been groans if he'd at all expected to end the day lip-locked with his boss. Instead Mike was fairly certain he'd just started to whimper.</p>\n<p>Mike drew back long enough to breathe, leaving a soft bite on Harvey's lips as they parted. Harvey left him barely any space, the two of them still pressed together, hip to chest. Harvey's mouth was next to Mike's ear, and Mike was assaulted by the rhythmic steady panting of his boss, while Mike found himself swallowing, as though that could force more air into his lungs.</p>\n<p>\"So...\" Mike said, still wishing he could breathe. \"That happened.\"</p>\n<p>What also happened was Mike had very firm evidence of Harvey's mutual interest pressing up against his own thigh. The great Harvey Specter had turned into a slightly quivering mass of arousal. Harvey's hands brushed along Mike's side, down his hips in a manner that might have passed for smoothing his shirt were it not for the way Harvey trailed his thumbs across Mike's stomach.</p>\n<p>\"Assholes.\" Hunter.</p>\n<p>The two of them broke apart, burned. And saw their... co-kid looking at the two of them, face stormy.</p>\n<p>\"So that's why you two never let me see you together.\" Hunter crossed his arms in front of his chest. \"I'm a big kid, I could have taken you telling me from the start that you're dating your Associate, dad.\" He and Harvey shared a momentary 'what the hell' glance, before Hunter continued his tirade. \"And you.\" Hunter turned on Mike. \"All that crap about talking things out and sharing your feelings and that, that's all bullshit. The two of you wouldn't even cop to this to my <i>face</i>.\"</p>\n<p>Mike was way too buzzed and horny for this conversation.</p>\n<p>\"Hunter...\" Mike didn't even know what to say. The truth sounded even more bizarre than the fiction.</p>\n<p>\"Hunter.\" Harvey actually stepped forward, brushed a hand down his vest, and looked his son square in the eyes. \"I'm sorry.\"</p>\n<p>Mike thought he might faint. Harvey <i>never</i> apologized. Instead, he leaned back against the nearest wall and tried to pretend like that wasn't an action right out of some cheesy old-style movie where some heroine had just gotten snogged within an inch of her life by the dashing hero.</p>\n<p>\"Mike and I...\" Harvey looked over his shoulder to Mike and then caught something on Mike's face that made the bastard smirk. Why did he have a crush on an asshole? \"Are complicated. But...\" Harvey took a deep breath, grabbed the top of his pants in two fingers, tugged them up, and then crouched down so he was at eye level with Hunter. \"I promise you, Mike and I aren't dating.\"</p>\n<p>That stung. Mike was trying to not let that sting.</p>\n<p>\"So you're fucking?\" Hunter asked, voice still pissed. He would have done well to learn Harvey's cool disappointed anger rather than the rage he was working with now.</p>\n<p>\"Language. But no.\" Mike could see the lines of Harvey's back, see the way he must have been straining to not use his typical 'shut up and listen and do what I say' voice. \"We're still figuring it out.\"</p>\n<p>Hunter arched an eyebrow at Harvey, and Mike grinned in spite of himself. \"You two seemed to have it pretty worked out there... by the way, you owe me therapy.\"</p>\n<p>\"You don't need therapy. You just caught your parents making out.\" Harvey straightened and then neatened his clothes again. \"Sexual chemistry isn't enough. But I never lied, Mike and I aren't dating, but... we might, in the future.\"</p>\n<p>Mike felt the nearly irresistible urge to twirl his hair. What the fuck was his life coming to? He took a deep breath, and then another, before he finally opened up his eyes and saw both Specters, junior and senior, staring at him. \"What Harvey said. Look, I could go into a detailed timeline of how hot I've found your dad at various point over our acquaintance, or you can go back to the science fair, Harvey and I are going to go look at the other projects, and then we'll go out for ice cream to make up for traumatizing you with us making out. Okay?\"</p>\n<p>Hunter looked at them both, jaw set. \"Fine.\" Hunter straightened his uniform and looked at both of them. \"And if you want to date... that's fine. As a step-dad Mike doesn't suck.\"</p>\n<p>And then he left.</p>\n<p>And Mike stared after him.</p>\n<p>And then he turned to Harvey with what could probably be described as disgust and annoyance. \"You're emotionally stunting our son.\"</p>\n<p>Harvey arched an eyebrow at him. \"How long have you been thinking about him as <i>our</i> son?\"</p>\n<p>\"Um...\" Mike didn't really want to answer that, because the answer was intensely embarrassing.</p>\n<p>And, thankfully, Harvey was a bit emotionally constipated, so his answer was to wrap his arm around Mike's shoulder and tug him back toward the auditorium. \"Our son's having a science fair, time to be gay dads with me.\"</p>\n<p>Mike tugged his shirt and tie into some semblance of neatness so he didn't look like he'd just been making out with his boss-and-potential-future-boyfriend in the hall of his step-son's school. \"Always time to be gay dads.\"</p>\n<p>The two of them were the best damn lawyers in New York City, as far as gay dads went, they'd knocked it out of the damn park.</p>\n<p>*</p>\n<p>Of course, after they had finished their rounds, Mike having managed to not melt into a puddle of goo, the three of them piled into the town car and headed back to Harvey's condo. Mike came up to the room without really being asked, even though he felt slightly like an intruder in the home. The three of them climbed out of the elevator and then Hunter looked back to both of them.</p>\n<p>\"I'm going to my room and listening to music with my headphones on.\" And then he gave them a thumbs up, with a look that was a mix between pained and awkward.</p>\n<p>Mike watched Hunter's retreating back and couldn't quite stifle the awkward, pained, confused laugh that bubbled up. \"Beer?\" Mike asked, because like hell he was having this conversation completely sober.</p>\n<p>\"Whiskey,\" Harvey corrected him. A moment later, Harvey retreated to the kitchen, picked up a pair of glasses and a bowl of ice before retreating down the hallway in the direction of his room.</p>\n<p>Mike followed, eventually ending up on the balcony outside of Harvey's bedroom. Mike collapsed onto the nearest chair, surprised when Harvey uncapped the bottle and poured them both a rather generous helping of booze. Neither of them spoke as they picked up the glasses, Mike tilted the glass from side to side for a moment before he caught Harvey holding his own glass at an awkward angle, tilted towards Mike. Mike clinked their glasses before they both took a sip, lounging back in their chairs.</p>\n<p>Harvey didn't break the silence.</p>\n<p>\"You totally jumped me.\" Mike thought it was best to get that out of the way.</p>\n<p>\"Astounding summary of the facts in evidence.\"</p>\n<p>Mike snorted. \"Look, Harvey...\" He swung his legs up so he could sit, see Harvey where he was sprawled. Everything about the man radiated tension. \"Can we do this with no bullshit? I don't need your typical squish me like a bug response to everything not-quite-right I say.\"</p>\n<p>\"Yes.\" Harvey also sat up, looking across the small divide at Mike. \"I kissed you.\"</p>\n<p>\"You... <i>like</i> me.\" Mike tried that, eyes glancing toward Harvey, speculative.</p>\n<p>\"Prom's not until next month, Mike.\"</p>\n<p>Mike set his glass down on the table and stood, headed to the door. He wasn't going to put up with this bullshit. Harvey's fingers were curled around his wrist before he could get to the door. </p>\n<p>\"I... sorry.\"</p>\n<p>He sat back down. \"Real answer?\" Mike prompted.</p>\n<p>\"Yes, Mike. I like you. I have for a while.\"</p>\n<p>Mike glanced down at his hands before filling them with the glass again, looking across the space between them again. \"That's pretty vague, Harvey. Pre-Hunter? Post?\"</p>\n<p>\"Pre.\" Harvey took a long drink of whiskey before he put it back down. \"I never expected anything... but you weren't wrong, your mind wasn't the only thing I noticed the day we met.\"</p>\n<p>The idea was mind boggling. Mike spent a moment to taking it in. He never really considered himself apt at reading interest from another person, but he never thought he was quite <i>that</i> bad as to miss an interest that had been possibly directed at him for months. Either that or Harvey was amazing at keeping that close to the chest. \"Damn.\"</p>\n<p>Harvey arched an eyebrow at him.</p>\n<p>\"We could have been dating for months.\" Mike looked down at his glass and took a sip. \"Alright... It's not simple, though, is it? I mean there's work, Jessica, and there's Hunter. I was pretty put-upon when you dumped your kid on me, weeks ago, but I can't...\" Mike trailed off again. \"If we fuck this up it could hurt him, badly. It would be just like a divorce.\"</p>\n<p>Mike waited, breath caught in his chest, for Harvey to say something. He didn't. Instead he stood, glass dangling at his side as he walked out to the edge of the balcony and set his glass there, looking out over the city. Harvey at his most introspective and pensive was not something he was used to. He knew Harvey must have his moments, but they always seemed to be where Mike couldn't see. After a few long minutes, Mike finally got up and went over to Harvey, placing a hand on his back before reaching up to pull the jacket off of Harvey. He let himself have the jacket peeled away, and Mike slung it over the nearest chair.</p>\n<p>\"You'd get him in the divorce anyway,\" Harvey said.</p>\n<p>It had been minutes since Mike had last spoken, he barely caught what Harvey was even talking about. \"You're his <i>dad</i>, he's almost fond of you now.\"</p>\n<p>\"He's fond of you. He's a good kid, even if his affection for you is unfathomable.\"</p>\n<p>Mike pressed up against Harvey's side, shoulder to shoulder. \"I'm irresistible to Specters. They just want to...\"</p>\n<p>Harvey spun him, pulled him close. The two of them were pressed back against each other, all the way down.</p>\n<p>\"I... object to being manhandled like a 40s era starlet.\"</p>\n<p>So Harvey leaned in and brushed his lips against Mike's, soft in a way their kiss in the hallway hadn't been. If their first kiss had been the one that fucked you hard against the wall, this one was the one that took you to dinner and held the door, gentle, tender, and slightly awkward. If you'd have asked him yesterday, Mike would have said that Harvey didn't have this in him. But Harvey picked up his glass in one hand, and kept another gently against Mike's jaw, barely directing him as they walked back to the chairs, lips still pressed together.</p>\n<p>Mike eased Harvey down onto one of the lounge chairs, and then followed after him, legs straddling Harvey's hips. Mike took advantage of the position to press his lips against the skin of Harvey's throat.</p>\n<p>\"Mike.\" Harvey stopped him, and Mike leaned back on his haunches, looking down at Harvey. He looked... cool, and calm, and completely in control, which made Mike feel a bit like an over-eager kid. \"You really want... this?\"</p>\n<p>\"You're going to have to be less vague than that, Harvey.\" Mike frowned over him.</p>\n<p>\"You're my Associate, you're my kid's co-parent, you really want to be my... partner?\" Harvey sounds, if anything, skeptical, as though being Harvey's partner was some amazing burden that Harvey couldn't imagine anyone taking on willingly.</p>\n<p>\"You're already my Partner, Harvey,\" Mike answered, just to tweak the man's nose. He couldn't go anywhere, anyway. But he knew what Harvey was actually asking, and he knew his own answer on that front. Here in the chilly night air wasn't really the place for deep, important and meaningful confessions and yet... \"It's just like everything else we've ever had.\"</p>\n<p>Harvey prompted him to continue with a single arched eyebrow.</p>\n<p>\"You have everything I want and I keep wondering why you share it with me.\" Mike wouldn't have been able to give a kid the life that Harvey had effortlessly given Hunter; Mike hadn't earned his law degree or a bachelors; Mike wasn't rich, didn't have a easy and comfortable life - even with his current salary he never moved out of his ratty little apartment in Williamsburg for fear that Jessica would eventually pull the plug on his career.</p>\n<p>\"Do you know what Jessica said to me the night she took you to dinner? Before she pulled the rug out from under me.\" Mike shook his head, he honestly had no idea what went on inside the funny little heads of anyone above him at Pearson Hardman, mostly he got a look into Harvey's because the man was so transparent sometimes. \"She said you might even be the best of her and me, the drive, the desire to win, and the...\"</p>\n<p>\"Human touch?\" Mike prompted.</p>\n<p>\"That.\" Harvey placed a hand warm on Mike's thigh. \"You're going to beat me someday.\"</p>\n<p>\"Jessica said I beat you the day we met.\" <i>That</i> Mike remembered; he'd been shocked she'd put it that way, but it wasn't hard to see that now. \"Fine. I want it all. You, Hunter, the job, the condo, the PTA, the clients, the suits... everything. And just like everything else I've gotten so far, I'm going to keep it, and I'm not going to be the worst step-dad in the history of everything either.\"</p>\n<p>*</p>\n<p>Only Harvey would try to <i>grill</i> in two pieces of a three piece suit. It was blisteringly hot, and yet Harvey stood next to the grill, prodding hot dogs and hamburgers, chicken patties, and veggie patties as though it wasn't the hottest Memorial Day in recent memory. If Mike hadn't been personally witness to Harvey sweating his ass off, usually after a run or going to the gym, he might have thought the man incapable. He also witnessed Harvey scruffy, unkempt, and generally frazzled on more occasions than anyone without his mega-brain could have counted.</p>\n<p>His mega-brain was currently occupied but nothing of particular importance to a case, truth, justice or world peace, but instead the age-old question of how to keep cold things cold and hot things hot while it was a million degrees outside. Implementation was running slowly, the various kids from Hunter's little league team were running around out on the fields and mulched play areas of the park, most of the adults were spectating or mingling with each other, having long since dropped their food off with Mike. Mike was then left to put his brilliant idea into practice: ice, lots of ice. One of the great joys of having been an Associate was that Mike really tended to take menial labor as par for course - he only wished he could bill a client for it.</p>\n<p>\"Need a hand?\" The polite request came from somewhere over his shoulder as he hauled yet another bag of ice toward the cold table.</p>\n<p>Mike glanced. Woman, pretty, maybe five years older than Mike. \"Sure. I'm actually behind on my veggie slicing duties, unless you want to haul ice with me?\"</p>\n<p>She made a gesture toward the table, and the small cooler than Mike had stored the onion, lettuce, and tomatoes to be sliced for salad fixings and Mike nodded. \"Carrie Vance,\" she introduced herself as she picked up the knife and started to slice.</p>\n<p>\"Steve's mom,\" Mike filled in. Perfect memories were very useful for socializing. \"Mike Ross, Hunter Davis' step-dad. Haven't see you at any games or practices - busy career?\"</p>\n<p>Mike could ask the question easily, and with no judgement, because damn it was hard for him and Harvey to juggle Hunter, even with Harvey's swan-like ability to move around and do fatherhood things. Mike's recent bump closer to Partner had made it more difficult for him to be the go-to dad.</p>\n<p>\"Executive Assistant,\" she answered. Mike glanced at her and saw a look that he knew well from Donna: don't call me a secretary.</p>\n<p>\"My old boss' EA runs the office, I swear.\" Mike continued to haul ice, broke it open, and spread it around the plastic bin they were using for cold things. \"Anything you want, she makes it happen. I'm an Associate - third year, Partner track.\"</p>\n<p>She didn't look impressed, but he knew what she was thinking: another asshole in a suit. Mike had long ago learned to shrug it off. People didn't know his story and judged him for how he looked: a kid in neat khakis with a fancy job. \"How does an Associate have time for a cookout, even one on a public holiday?\"</p>\n<p>Banging the boss... Mike just smirked to himself while he headed back to the car for the last bag of ice. \"I give my company a lot of billables, I do good work, and I fix all the stuff that needs the soft touch. And for that I am paid in Memorial Day, Christmas, and the Fourth of July.\" In truth his iPhone was still strapped to his ass, set to vibrate, should work need him. He watched Carrie finish up with the tomatoes and spread them out on the plate on top of the ice.</p>\n<p>Speak of which... His phone buzzed, and he wiped a damp hand on his khakis before he pulled out his phone and read the text: <i>'Stop flirting with the soccer mom and get me a beer'</i>. He snorted, looked up where Harvey was standing loose at the grill, one eye on the burgers.</p>\n<p>\"Get your own beer!\"</p>\n<p>Harvey - ever the communicator - punched another text on his Blackberry rather than holler. <i>':('</i></p>\n<p>\"Excuse me for a minute, Carrie. Husbandly duties await.\" And then he picked up a beer and headed to the grill before handing Harvey his beer. \"Really? You're jealous of the soccer mom?\"</p>\n<p>\"She's flirting with you.\"</p>\n<p>\"She's unimpressed with my career and parenting skills.\" Mike reached out, flattened his hand against Harvey's waist, and smoothed the fabric of his vest. \"You know this is pure ego, right? You can't go meet a client smelling like charcoal.\"</p>\n<p>\"I like looking like a men's wear ad.\" Harvey brushed a thumb against Mike's jaw, no doubt leaving a light smudge of soot and char. \"<i>You</i> like me looking like a men's wear ad.\"</p>\n<p>\"I do. Always have.\" Mike leaned in, gave Harvey a soft peck on the lips - which he reciprocated wholeheartedly, and then backed away. \"You just like being the team DILF, admit it.\"</p>\n<p>\"I refuse to answer, on the grounds that it's not cool to admit that out loud.\" Harvey reached out and brushed his fingers along the ring Mike was wearing, smooth and tasteful platinum that had already been on Mike's finger long enough to leave a shadow when he took it off.</p>\n<p>\"Doesn't matter, as long as you're the DIGF.\"</p>\n<p>Harvey crinkled his brow, confused, and Mike laughed before kissing him on the temple and heading back to the cold table and started to help Carrie chop. He could read witnesses easily now, and he could see the question sitting there on the tip of her brain.</p>\n<p>\"Yup, gay. Gay and married.\" Technically bi, but it was a distinction very few people liked to make, so Mike didn't usually bother, he was a dude with a dude, currently gay.</p>\n<p>His phone chimed again. <i>'Is the F still for fuck?'</i></p>\n<p>Mike snorted again - oh Harvey. <i>'Yes'</i></p>\n<p>He and Carrie managed to have a long stream of unjudgemental and uninterrupted gossiping over the cutting board, until Hunter returned with another kid. His arm slung over the kid's shoulder, limping along toward the eating shelter, blood coming out of his leg. His first reaction: panic, he tamped down on before he pointed over to the car. \"Don't bleed in the food area.\"</p>\n<p>Hunter sat on the nearly empty bed of the hatchback, legs dangling over the back. \"Ow.\"</p>\n<p>\"How articulate.\" Mike dragged a first aid kid out of the back and began to clean away the worst of the blood. Hunter was currently in the midst of a growth spurt of epic proportions, having gone from just over five feet to almost five foot nine in just under a year. Harvey was certain he had more growing to do as well, and said after Hunter finished growing up he might actually finally get started on growing <i>out</i>, but he currently resembled Mike more than Harvey. All of that meant his coordination was not always the best. \"Trying to impress someone?\"</p>\n<p>\"Just a little bit,\" Hunter moped at him as Mike inspected the actual gash itself.</p>\n<p>It was impressive, but not dire. If Mike didn't think Hunter would kill him, he would have insisted on stitches. Instead he set to work with disinfectant and then some butterfly bandages. \"Take it from me, it works way better when you just be yourself.\"</p>\n<p>\"I tripped, fell, and cut my leg open - how much more 'me' can I get?\"</p>\n<p>He couldn't help it, barely-teenaged love angst was very amusing now that he didn't have to experience it anymore. He chuckled. \"Well, getting sewn up by your step-dad could be cool. Tell her I fretted that it would scar.\" Hunter looked uncomfortable for a moment. \"Him?\" Mike asked, because Hunter wasn't exactly one to share his love life.</p>\n<p>\"Her.\"</p>\n<p>\"Well, don't worry, Specters get finer as they age, and that includes having better game.\" Mike glanced over his shoulder, Harvey was conspicuously not watching, which meant the man's eyes had been boring into the back of Mike's head when he wasn't looking. \"Your dad used to sort of suck when he actually cared.\"</p>\n<p>\"He got you.\" And Hunter had a point, but...</p>\n<p>\"He shoved me up against a wall and kissed me in the middle of a science fair, as far as game goes, that's pretty weak sauce.\"</p>\n<p>\"You didn't just say that, please.\" Hunter hid his head in his hands, looking somewhere between mortified and fond.</p>\n<p>\"What?\" Mike did his best to look affronted. \"I totally nailed that.\"</p>\n<p>Hunter just shook his head. \"You didn't, trust me.\"</p>\n<p>Which, of course, had Mike thinking of exactly how many times he'd nailed that... and glanced over to Harvey again, who appeared to be scrolling through his Blackberry. Text from the office maybe, or more likely he was browsing a dictionary looking for G-words. \"Well, get out of here, and try not to fall over your own damn feet again.\"</p>\n<p>\"Yes. You're so smart, dad.\"</p>\n<p>\"Cut it with the sass or I'll hug you in front of your girlfriend.\" Instead he shooed Hunter off with a pat on the shoulder and he was off to the races again.</p>\n<p>His phone buzzed. <i>'Dad I Get (to) Fuck'</i></p>\n<p>\n<i>'It's so cute how you put in the parens. And hush, I was trying to counsel your son on his dating game.'</i>\n</p>\n<p>\n<i>'Never getting grandchildren that way'</i>\n</p>\n<p>Grandkids - god, Hunter was <i>fourteen</i>. Mike felt intensely old. <i>'I do alright with the old guys. I have great game'</i></p>\n<p>\n<i>'Your 'game' is standing around looking like you want to have sex'</i>\n</p>\n<p>Harvey was right, but... <i>'My track record with that strategy is excellent. Now finish up your grilling so we can eat.'</i></p>\n<p>\n<i>'Yes, dear'</i>\n</p>\n<p>Mike loved it when Harvey said that. He loved it even more when Harvey slid into the bench beside him and left their legs to press together and then set three perfectly dressed hot dogs in front of Mike, along with a generous portion of macaroni salad. Harvey leaned in, nose tickling against Mike's ear and the nape of his neck. \"Kiss the cook?\"</p>\n<p>\"I did sign an exclusivity agreement to that effect.\" So he tilted his head and gave Harvey a peck on the lips.</p>\n<p>\"Hey, Mike.\" Mike turned and saw Kristy smirking at him. \"What excuse are you and Harvey going to have for grilling with the team after Hunter goes to college.\"</p>\n<p>College... next year, oh god, empty nest. He and Harvey were going to fuck all over the condo. \"We're turning Hunter's old bedroom into a modern art studio,\" Harvey answered, looking completely serious to anyone who didn't know him as well as Mike - or Hunter - did. Hunter stuck his tongue out. \"Or we'll adopt. The last one turned out so well-adjusted.\"</p>\n<p>Adopt... Only Harvey would cavalierly suggest major life changes while in between bites of hot dog. As far as Mike was concerned, the idea didn't suck, but... wow... Harvey was scarily into this 'dads' thing now, or maybe he just really liked to grill. It was probably the grilling. He gave Harvey's knee a squeeze, because Harvey Specter's secret was out, he cared, a lot. Mike was just glad to be on the receiving end of it, and even if he couldn't always anticipate where Harvey's mind was going to go, he always enjoyed the ride.</p>"
}