{
  "id": "44074044",
  "url": "https://archiveofourown.org/works/44074044?view_full_work=true",
  "author": [
    "alcyonenight"
  ],
  "title": "burn up, burn out",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "原神 | Genshin Impact (Video Game)"
  ],
  "relationships": [
    "Alhaitham/Kaveh (Genshin Impact)"
  ],
  "characters": [
    "Alhaitham (Genshin Impact)",
    "Kaveh (Genshin Impact)",
    "Tighnari (Genshin Impact)"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Sick Character",
    "Hurt/Comfort",
    "Chronic Illness",
    "Terminal Illnesses",
    "Eleazar (Genshin Impact)",
    "Angst with a Happy Ending"
  ],
  "language": "English",
  "series": "",
  "published": "2023-01-05",
  "completed": "2023-01-07",
  "words": "8,646",
  "chapters": "4/4",
  "comments": "453",
  "kudos": "14,671",
  "bookmarks": "2,887",
  "hits": "112,626",
  "summary": "<p>\"So, what great building did our master architect work on this time?\"</p>\n<p>Nothing. Four days ago, Kaveh thought he would never work on anything again.</p>\n<p>\"Where were you when Sumeru needed you most?\"</p>\n<p>Dying.</p>\n<p>(Or: the one where Kaveh was born with Eleazar)</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>work title and chapter titles from porter robinson's musician</p>\n<p>honorary knight is still in progress, but alhaitham and kaveh are so married that i couldn't not write about it even though all my characterization will be proven wrong in like two weeks</p>\n<p>a lot of time-skipping afoot lads</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>you cannot convince me that a kaveh that uses a cane would not have a massive collection for purely aesthetic reasons. he would only buy ones in the appropriate size and design but he would absolutely end up with canes in spades.</p>\n<p>the next time that tighnari saw kaveh he punched him</p>\n<p>you wanted it, you got it. coming in hot with my soft alhaitham agenda, girls.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>chapter title from porter robinson's \"sweet time\"</p>\n<p>i have been writing this so fast because i wanted it done before any more lore could come out and i know the preload is gonna have lore. but we are done here. we are done here. there will be no more of these two until at least after the patch i swear</p>",
  "text": "<p>By his final year in the Akademiya, Kaveh budgets his schedule more tightly than his parents once budgeted their mora. His classes and the time spent going to and from them. Study hours in the House of Daena. Meals, carefully chosen for the combination of expense and nutritional value.</p>\n<p>A visit to Bimarstan every two months to see how his Eleazar is progressing and buy more medicine. Three days of the clearest schedule he can arrange after important exams or deadlines, because he <em>always</em> takes ill at the end of a project. Physical therapy exercises in an effort to counteract the peripheral neuropathy. Rubbing lotions with Nilotpala Lotus oil into his hands, even though there's no solid evidence it will help, because he <em>needs</em> his hands, if nothing else he needs his hands-</p>\n<p>Kaveh breathes in and returns his attention to the diagram in front of him. He does not have time to get caught up in trivialities. He does not have time at all.</p>\n<p>\"You don't need that straightedge. Your lines are perfectly straight.\"</p>\n<p>Kaveh does not need it today. Yesterday he did. Tomorrow he might. But if he doesn't use it every day, people could start asking questions. \"I don't see how that's any of your business,\" he says without looking up from the paper.</p>\n<p>\"You're that Kshahrewar who has a reputation for refusing to spend time on 'pointless endeavors,'\" whoever-it-is says. \"That straightedge is slowing you down.\"</p>\n<p>Kaveh, against his better judgment, looks up. Green eyes. Soft silver hair. Muscles for days. \"My name is Kaveh,\" he says, swallowing down desire as quickly as he recognizes it. He only has time to strive toward one thing, and that thing is <em>not</em> a pretty boy.</p>\n<p>\"Kaveh,\" the stranger repeats. \"I am Alhaitham.\"</p>\n<p>\"Wonderful,\" Kaveh says. \"Now, unless you have something <em>interesting</em> to point out, please find someone else to bother.\"</p>\n<p>\"You've omitted a step in your description,\" Alhaitham says. \"You did the math correctly, but you did not record your reasoning for calculating the hypotenuse.\"</p>\n<p>Kaveh sighs, because Alhaitham is <em>right.</em> \"Thank you.\"</p>\n<p>Alhaitham nods and leaves without another word.</p>\n<p>---</p>\n<p>Kaveh's dormitory is tiny and cramped, room only large enough for a bed and a dresser. There is no space to exercise and he can't afford anything more expensive without cutting into food or medication. So for his physical therapy, he goes to one of the pavilions surrounding the House of Daena. The House of Daena is quiet anyway because the Akasha makes most physical books obsolete, and the pavilions around it are even more quiet.</p>\n<p>Except not today, because Alhaitham is inside his favorite gazebo, arguing with some slim Spantamad scholar.</p>\n<p>\"The corpse of Durin is readily accessible,\" Alhaitham is saying. \"It is possible to go and examine it firsthand.\"</p>\n<p>\"I don't have the funding to leave Sumeru City, much less travel to Mondstadt,\" the Spantamad scholar replies.</p>\n<p>Kaveh sighs. He does not have the time to find a new place, and it's not as if their argument is taking up physical space. He sits down on the opposite side and stretches out his legs in front of him. \"What's this about?\" he asks.</p>\n<p>\"Zinat is writing a paper <em>theorizing</em> on the elemental energies surrounding the corpse of Durin on Dragonspine,\" Alhaitham says.</p>\n<p>\"He's right,\" Kaveh says, bending forward to touch his toes. \"And if I recall correctly, Lisa Minci submitted a full ley line survey of the area to the Akasha about it two years ago. Your mentors won't be impressed by speculative work when there's already completed research on the topic.\"</p>\n<p>\"Lisa Minci? Oh...\"</p>\n<p>\"Yes, oh,\" Kaveh says, leaning into the stretch.</p>\n<p>Alhaitham catches Kaveh's eye. His mouth hasn't changed, but his eyes have lit up with silent laughter. <em>Want</em> tries to rise up through Kaveh's throat, but he swallows it back down.</p>\n<p>\"I should talk with my mentor,\" the little scholar says, and scurries away.</p>\n<p>\"Did Lisa Minci really do a survey of Durin's corpse?\" Alhaitham asks.</p>\n<p>\"Yes,\" Kaveh replies. He shifts through sitting up to lowering himself onto his back, knees drawn toward his chest, then tilts his hips to the right. \"I'm sure it's quite fascinating if you're interested in the subject matter.\"</p>\n<p>\"Perhaps.\" Alhaitham sits down against one of the pillars, far out of the way. It's impossible to tell whether he wants the conversation to continue.</p>\n<p>\"Friend of yours?\" Kaveh asks.</p>\n<p>\"No,\" Alhaitham says. Not with disdain. Not spluttering and blushing. Just a simple denial.</p>\n<p>\"And she's not from your Darshan, I assume,\" Kaveh says, switching the direction his hips point. \"You don't strike me as Spantamad.\"</p>\n<p>\"Strictly speaking, I am not yet affiliated with a Darshan,\" Alhaitham says. \"This is my first semester.\"</p>\n<p>\"But you're working toward Haravatat, aren't you?\" Kaveh asks.</p>\n<p>\"Yes,\" Alhaitham replies, and this time he sounds quietly pleased. Or perhaps quietly smug.</p>\n<p>Kaveh risks a glance up. Definitely smug.</p>\n<p>For a brief, fleeting moment, Kaveh imagines a world in which he could kiss the smug tilt off a pretty boy's lips. It wouldn't have to be Alhaitham, but he wouldn't mind if it was.</p>\n<p>\"You do strike me as the type of person who thinks Haravatat is the pinnacle of academic achievement,\" Kaveh says.</p>\n<p>\"It's certainly superior to the Kshahrewar,\" Alhaitham says.</p>\n<p>\"You're intentionally provoking me, and I won't fall for it.\" Kaveh straightens his hips and plants his feet on the ground, then lifts his hips and holds the pose. But then he continues: \"The Haravatat are the smallest Darshan for a reason. They've forgotten that knowledge is useless without any practical application.\"</p>\n<p>\"There are plenty of practical applications for the fields studied by the Haravatat,\" Alhaitham replies. \"Might I remind you that linguistics falls under its purview? Are you suggesting that there is no practical application to understanding another language?\"</p>\n<p>Kaveh smiles. \"Vahumana could absorb all of that without anyone noticing. Many of those courses are already shared between Darshans.\"</p>\n<p>Their back-and-forth extends so long that Kaveh doesn't quite finish his physical therapy regimen before the Akasha beeps in his ear to notify him that it's time to go back to his dorm and study. He pauses right in the midst of an argument about runes that he doesn't even believe, sighing. \"I've got to leave,\" he says with genuine regret. The part of him that cares quite a bit more than he would like that Alhaitham is attractive continues, \"I come here for exercises most days, if you'd like to pick this up again later.\"</p>\n<p>Alhaitham nods, but doesn't say anything. Kaveh resigns himself to the rest of their meetings being coincidence-</p>\n<p>-until the next day, when he arrives at the gazebo to find Alhaitham already there, book spread across his lap.</p>\n<p>\"So as I was saying yesterday,\" Alhaitham says. \"If we couldn't decode the runic structure used by the followers of King Deshret, we wouldn't know-\"</p>\n<p>By the week before midterms, more days than not, Alhaitham will join Kaveh at the pavilion. Sometimes he joins Kaveh in his exercises. Sometimes he reads books from the library or does homework. Most often, they fight over trivial, silly things, and Kaveh is very nearly late to his next engagement.</p>\n<p>Alhaitham makes it so easy for Kaveh to forget that he's running out of time.</p>\n<p>---</p>\n<p>Kaveh sits at Bimarstan, waiting for his turn. They're always running late on appointments. He tries not to let himself get angry about it. If someone before him needed more care than could have been anticipated, that's not anyone's fault.</p>\n<p>He spends the wait studying with the Akasha. There's a grand structure under the Mausoleum of King Deshret. It hasn't been thoroughly explored due to the dangers presented inside, but translations and preliminary studies suggest it could cover much of the Hypostyle Desert. It's incredible that they had the technique to build structures that were so large and extended so far under the sand. And it's a shame that those techniques are lost. Though perhaps some of the writings of King Deshret's followers might have preserved something...</p>\n<p>Fifteen minutes later, when an Amurta intern calls Kaveh's name, he realizes he's studying rune structures.</p>\n<p>The examination passes quickly. The intern, a light-skinned man with prominent fox ears, watches quietly as the real doctor studies the scaling on Kaveh's thighs.</p>\n<p>\"This patch of skin is dead,\" the doctor says, frowning. \"And there's infection here. Tighnari, look at this.\" She pries gently at a black scale. Something brown and foul-smelling oozes out from under it. \"This is what it looks like when a patch of Eleazar starts to necrose. At this stage, however, we would expect most of the surrounding tissue to remain viable. Bring me the menthol balm. Ten percent concentration.\"</p>\n<p>They're not talking to Kaveh anymore, so he doesn't have to listen. He can just take this in. Process.</p>\n<p>He's been as fortunate as a person born with Eleazar can be up until now, he supposes, but his luck was bound to start running out eventually. Assuming the most typical trajectory of the disease, once tissue starts to decompose, he can expect to live about four more years. The numbness will get worse. He will begin to experience paralysis and pain.</p>\n<p>But four years. Even if he can only work through three of them. It's enough. He has the time, as long as he doesn't waste it, to leave something behind.</p>\n<p>This is why it had to be Kshahrewar. This is why it had to be architecture. Getting research published can take decades. But a building can go up in just a few short years.</p>\n<p>The doctor numbs his thigh and debrides the dead tissue. Kaveh watches. He refuses to let himself be squeamish about this. He agrees to move from appointments every two months to every month as his thigh gets bandaged.</p>\n<p>Then he walks back to the Akademiya and does not think about it. He does not have time to think about it.</p>\n<p>---</p>\n<p>Perhaps it is the stress of knowing that after this round of exams, the only thing between Kaveh and graduation will be his thesis. Perhaps it's the more concrete knowledge of his lifespan. Perhaps he's weaker after the infection in his thigh.</p>\n<p>Whatever it is, he wakes up in the morning of his first exam with an entirely numb left arm and a pounding headache, and knows it is going to be a bad day.</p>\n<p>It could have had the decency to wait until <em>after</em> exams like usual.</p>\n<p>Kaveh drags himself out of bed, forces some water down his throat, and stumbles to his exam.</p>\n<p>He does fine on his exam, of course. He would have to be far more ill than this to forget how to do trigonometry.</p>\n<p>He should go back to his dorm and go to bed. He should rest.</p>\n<p>But he <em>is</em> too ill to swallow down the part of him that wants things he will never have, and so he makes his way out to the pavilion.</p>\n<p>\"Ah, you're here,\" Alhaitham says. \"If- Kaveh?\"</p>\n<p>Kaveh leans against a column. \"Go on,\" he says. \"I'm listening.\"</p>\n<p>\"You look like something chewed you up and spat you out.\"</p>\n<p>Kaveh rolls his eyes, which he regrets because it makes the ache behind his eyes spike. \"I know I'm not at my most attractive when I don't put my hair up, but it's exam week. Allowances must be made.\"</p>\n<p>A cool hand rests against his forehead. \"Senior,\" Alhaitham says, having somehow managed to cross the distance between them between one blink and another. \"You have a fever.\"</p>\n<p>Alhaitham has never touched him before. Kaveh doesn't think anyone other than his doctor has touched him in years, except by accident. Certainly not so gently.</p>\n<p>\"It's exam week,\" Kaveh says helplessly. He has to pull away. He has to. He just can't summon the will.</p>\n<p>Alhaitham, for once, does not argue with him. Of course, that's only because he doesn't need to. \"Come on,\" he says, instead. He shifts to stand at Kaveh's left and wraps an arm around his waist.</p>\n<p>Kaveh wishes that Alhaitham had chosen his right, so he could feel it more. Nothing to be done about it.</p>\n<p>Alhaitham walks them to his dorm room, one of the expensive ones close to the main entrance of the Akademiya. Either he came from money, or he has a really impressive scholarship. The room has its own attached bathroom, a desk and a closet in addition to the bed and dresser, a rug on the floor.</p>\n<p>\"Sit on the bed,\" Alhaitham says.</p>\n<p>And Kaveh is so tired that he obeys.</p>\n<p>\"I have another exam after lunch,\" he mumbles, staring down in disbelief as Alhaitham removes one of his shoes, and then the other.</p>\n<p>\"Then you can rest until lunch,\" Alhaitham says. \"Lay down, Kaveh.\"</p>\n<p>\"Are you sure?\" Kaveh asks.</p>\n<p>\"Yes,\" Alhaitham says, pushing Kaveh down.</p>\n<p>Kaveh doesn't resist. He just sets an alarm in his Akasha terminal and closes his eyes.</p>\n<p>The next few days are a blur of illness. Kaveh goes to his exams, and somehow Alhaitham is always there to pick him up afterward and tug him back to his dorm. When he has the energy, he studies, but much of the time he just sleeps. Alhaitham keeps offering him food, but he doesn't feel like eating and keeps refusing.</p>\n<p>\"Is there anything you think you can eat, Kaveh?\" Alhaitham asks. \"Anything at all?\"</p>\n<p>On the border of delirium with one exam to go, Kaveh answers honestly and without thought. \"Kulfi,\" he mumbles. \"Rose kulfi. No pistachios.\"</p>\n<p>\"Really?\" Alhaitham asks skeptically.</p>\n<p>\"Mhm,\" Kaveh replies.</p>\n<p>Alhaitham rests his hand against Kaveh's forehead again. \"Fine,\" he says.</p>\n<p>The next time that Kaveh wakes enough to sit up, Alhaitham shoves a bowl into his hands. Slightly melted rose kulfi, with no pistachios.</p>\n<p>Kaveh is sure he'll regret this later. But right now...</p>\n<p>The part of him that wants and wants and wants is quiet and still, curled up in his chest with satisfaction. The part of him that scrambles to make the most of every instant is quiet, too, the way it often is around Alhaitham.</p>\n<p>This is something that he can't hold on to, but he's glad for this moment. He's glad he gets to know how this feels.</p>\n<p>\"There's only so much I can do for you, Kaveh,\" Tighnari says, rewrapping a bandage. \"I am not a doctor. I am a Forest Watcher. My specialty is ecology.\"</p>\n<p>\"You're doing all that I actually need,\" Kaveh says. It's an old argument, worn soft over time. Neither of them ever make progress. \"How is Collei?\"</p>\n<p>\"Better off than you,\" Tighnari replies. \"Given she eats and sleeps properly.\"</p>\n<p>\"I don't have time,\" Kaveh says. \"You know that.\"</p>\n<p>\"You could almost certainly buy yourself another year if you took better care of yourself,\" Tighnari says. \"Perhaps even two.\"</p>\n<p>\"I'm almost finished with the Palace,\" Kaveh says. \"Two or three more months. And then it doesn't matter anymore.\"</p>\n<p>Tighnari sighs. \"Have you told Alhaitham?\"</p>\n<p>\"Why would I?\"</p>\n<p>\"Have you told <em>anyone?\"</em></p>\n<p>\"You,\" Kaveh replies.</p>\n<p>\"That doesn't count,\" Tighnari says. \"You didn't tell me. I was simply there while you discussed your Eleazar with someone else. You did not make an intentional choice to inform me.\"</p>\n<p>\"Then no,\" Kaveh says. \"But that's my decision.\"</p>\n<p>\"It is,\" Tighnari agrees. \"But I think it would be easier for you if you did. And that you're being quite cruel to all of your friends. Alhaitham in particular.\"</p>\n<p>\"That pompous ass?\" Kaveh asks. \"The one who keeps telling me that the Palace of Alcazarzaray is a pointless monument to hubris and I'm wasting my time working on it?\"</p>\n<p>Tighnari levels him a flat, unimpressed look. \"Yes.\"</p>\n<p>\"My health is none of his business,\" Kaveh says. \"And if not for this, it wouldn't be any of <em>yours,</em> either.\"</p>\n<p>Tighnari sighs. \"Fine,\" he replies, tying off a bandage. \"We're going to need to increase your dose again. Three drops, twice a day. Your stomach isn't going to like it, to be clear.\"</p>\n<p>\"When has it ever,\" Kaveh replies. \"Anything else?\"</p>\n<p>\"Drink a full cup of water between taking it and drinking coffee,\" Tighnari says. \"Or you <em>will</em> have heart palpitations again. Really, it would be better if you laid off the caffeine, but we both know you won't.\"</p>\n<p>\"I won't,\" Kaveh agrees cheerfully.</p>\n<p>\"And speaking of things we both know you won't do,\" Tighnari continues. \"Use your cane. Tell everyone you were injured if you'd prefer. I know you hate the visual marker, but you will have a difficult time recovering if you fall, and your balance is getting worse.\"</p>\n<p>\"Making vines with my Vision has worked well enough so far.\"</p>\n<p>\"It won't work forever. One day you won't catch yourself in time. Use your cane, Kaveh.\"</p>\n<p>\"I'll think about it.\"</p>\n<p>\"Good,\" Tighnari says. He sighs. \"And to actually answer your question from earlier, Collei has recovered well from the recent scare. I'm having her avoid holding anything heavy or breakable so she doesn't hurt herself again, but the wound healed nicely.\"</p>\n<p>\"Is she happier?\" Kaveh asks. \"She was so frightened the last time we met. I don't know what happened to her, but she deserves better.\"</p>\n<p>\"She does,\" Tighnari says. \"I hope I can give it to her.\" Left unsaid: Collei has even less time than Kaveh to get what she deserves.</p>\n<p>\"You've been doing well so far,\" Kaveh says. \"Thank you for seeing me. I've brought a few padisarahs from the build site, by the way. I think the roots are mostly intact.\"</p>\n<p>For the first time, Tighnari smiles. \"Have you? Show me.\"</p>\n<p>---</p>\n<p>The last three weeks of work on the Palace of Alcazarzaray are the hardest weeks of Kaveh's life. (Alhaitham would insist that they are only the hardest up to that point, because the Haravatat are pedantic like that, and Kaveh would commit an act of violence that would get him imprisoned for the rest of his shortened lifespan, so perhaps it is better that they haven't spoken in months.)</p>\n<p>The cane becomes a necessity, and then not really enough. A mild cold passes through the construction workers and Kaveh gets a fever and a cough that he can't fight off. For the last week he can't stomach anything but plain rice, and even that has to be at opposing times from his medication. Numbness dances along his limbs, leaving burning pain behind the next day.</p>\n<p>It doesn't matter, because the finish line is in sight, and he knows this building far better than he knows his own body. If he drops dead after the construction is finished, so be it.</p>\n<p>Kaveh takes the Lord Sangemah Bay on a tour that he barely registers even as he does it. She's pleased.</p>\n<p>The next morning he cannot get out of bed. It is not a matter of a lack of desire or willpower. It is that he does not have the strength to sit up.</p>\n<p>He always takes ill after a deadline, he supposes.</p>\n<p>It doesn't matter now. The Palace of Alcazarzaray is finished, the client has been taken on a tour and approved everything. There's nothing left.</p>\n<p>There's... nothing left.</p>\n<p>Kaveh's body aches and burns, but his mind goes numb at the realization. He's done what he's worked toward this entire time. It's finished.</p>\n<p>It doesn't feel the way he'd thought it would. It doesn't feel like anything at all.</p>\n<p>He has no idea what to do from here. He hasn't thought about it at all. He didn't have time.</p>\n<p>Now, nothing he does matters anymore.</p>\n<p>He closes his eyes.</p>\n<p>---</p>\n<p>Kaveh has never woken up in Bimarstan before, but he knows the place well enough that he is not disoriented when he sees that's where he is. He's not sure <em>why</em> he's here, but his location, at least, is familiar.</p>\n<p>The person sitting next to his bedside with an Enkanomiyan dictionary is familiar, too.</p>\n<p>\"Alhaitham?\" Kaveh asks.</p>\n<p>\"You really do take ill after every deadline,\" Alhaitham mutters, setting the book aside.</p>\n<p>\"Shouldn't you be in the middle of midterms?\" Kaveh asks.</p>\n<p>\"That was a week ago,\" Alhaitham says. Despite the statement that ought to be deeply alarming, though, he looks more relieved than anything.</p>\n<p>\"Oh,\" Kaveh says, frowning. \"What happened?\"</p>\n<p>\"They won't give me a specific diagnosis,\" Alhaitham says. So he doesn't know. \"But they've been giving you antibiotics, so you clearly have some kind of infection. This is the first time you've woken lucid.\"</p>\n<p>Kaveh nods.</p>\n<p>\"They asked if I knew where you were getting medical care for the last year,\" Alhaitham continues.</p>\n<p>\"Tighnari,\" Kaveh replies.</p>\n<p>\"The Forest Watcher?\" Alhaitham asks. \"He's not a doctor.\"</p>\n<p>\"He tells me that all the time,\" Kaveh murmurs.</p>\n<p>Alhaitham looks at Kaveh like he's the prompt for an essay he doesn't want to write. \"The Lord Sangemah Bay is footing the bill for your hospital stay,\" he says, finally. \"So you had better get well soon. She'll bill you every penny.\"</p>\n<p>Kaveh thinks about sitting up, but one of his hands is too numb for him to tell if he's planted it against the bedding. \"That she will.\"</p>\n<p>\"The Palace,\" Alhaitham says slowly. \"Was it worth this to you?\"</p>\n<p>\"Yes,\" Kaveh says, looking away.</p>\n<p>---</p>\n<p>Kaveh never bothered to plan for the time after he built his masterpiece. He realizes, now, that this was irrational. There was bound to be a period between finishing his life's work and dropping dead. But he had never thought about what he would do with that time. He has nowhere to stay because he's spent the past few years in a cabin at his worksite, and now that the job is over it will take time and money to find somewhere new. He has a little left over from building the Palace, but that fund is being drained by his stay in Bimarstan. And they won't release him until he has somewhere to go.</p>\n<p>\"Stay with me,\" Alhaitham offers, completely nonchalant, a week later with an out-of-date Inazuman newspaper on his lap.</p>\n<p>\"Aren't you living in the dorms?\" Kaveh asks.</p>\n<p>\"I got a good work-study,\" Alhaitham replies. \"I bought a house.\"</p>\n<p>\"You bought a <em>house</em> while you're still a student. Of course you did.\"</p>\n<p>\"Well?\"</p>\n<p>It's not as if Kaveh has many other choices.</p>\n<p>---</p>\n<p>Somehow, it works. Kaveh recovers enough to work on blueprints from a desk for a few hours most days, and when he can't, he pretends he's in bed because he's depressed instead of explaining anything. Alhaitham, in turn, pretends to believe this. They squabble over things while Kaveh lays in bed or on the couch, but it loses its bite after one particularly enthusiastic shouting match over star charts results in Kaveh running a high fever for three days.</p>\n<p>It works, though. It works after Alhaitham graduates, after Kaveh finally starts tipping over into the green and earning enough that he theoretically <em>could</em> strike out on his own, though neither of them bring that up.</p>\n<p>It works for more than two years, longer than Kaveh thought he would even survive, until the day after a particular Sabzeruz Festival.</p>\n<p>Kaveh wakes in excruciating, overwhelming pain. He promptly vomits all over the sheets, which is alarming both because it is disgusting and because he doesn't feel it in his throat at all. He starts crying and he can't move his hand to his face. He tries to call for Alhaitham, but his tongue isn't working properly, either, and the sound he produces is just a strangled cry.</p>\n<p>Things get fuzzy after that.</p>\n<p>Someone finds him, presumably Alhaitham. He's wrapped in blankets and carried out to Bimarstan, placed in a bed on his side. Frantic voices speak all around him, constant chatter that he can't process.</p>\n<p>Some indistinct amount of time passes in a haze.</p>\n<p>When Kaveh is finally aware of himself again, there's someone next to his bedside, which is familiar... but it's Tighnari, which is not.</p>\n<p>\"It's happening, isn't it,\" Kaveh asks softly.</p>\n<p>Tighnari presses his lips together and takes a deep breath. \"If you mean that you're dying,\" he says, \"then yes. A lot of Eleazar patients... lost ground on the day after the Sabzeruz Festival, though you're one of the worst.\"</p>\n<p>\"Figures,\" Kaveh says.</p>\n<p>\"Why do you have me authorized to make healthcare decisions for you and not Alhaitham?\" Tighnari asks.</p>\n<p>\"You know why,\" Kaveh replies.</p>\n<p>\"He still doesn't know?\" Tighnari asks.</p>\n<p>\"He doesn't.\"</p>\n<p>\"You need to tell him,\" Tighnari says. \"He needs to know.\"</p>\n<p>Kaveh doesn't answer.</p>\n<p>\"All that's left for you is hospice care,\" Tighnari says. \"You can do that at home, or there's a hospital near Caravan Ribat.\"</p>\n<p>\"Let me think for a minute,\" Kaveh says.</p>\n<p>\"Kaveh-\"</p>\n<p>\"You just told me I'm dying,\" Kaveh presses.</p>\n<p>Tighnari's face shutters closed. He nods and leaves.</p>\n<p>Kaveh looks around the room. He realizes there's a bowl on his bedside table. He's recovered to some extent, though he's sure it won't last, and he's able to sit up enough to look inside.</p>\n<p>Something liquid and a floral pink.</p>\n<p>Melted rose kulfi.</p>\n<p>He really has been cruel to Alhaitham.</p>\n<p>The next time a doctor comes to speak with Kaveh, he explains that he wants to go to the hospice near Caravan Ribat.</p>\n<p>Kaveh does not speak to Alhaitham before leaving for the hospice. He leaves a letter stating that he has been commissioned for a large project in the desert. Alhaitham will not believe this for an instant and he <em>hates</em> being told lies. It will make him angry, and maybe then he will not want to try to find Kaveh.</p>\n<p>He also writes letters to the people who have commissioned him for designs, stating simply that he will not be able to complete them. He has intentionally only been taking money upon completion, knowing this would happen one day.</p>\n<p>With that done, he hires a carriage out to the hospice.</p>\n<p>It's a deliberately quiet place, set just far enough back from the Wall of Samiel that sand doesn't blow through the windows. He's told it's nicer than the previous hospice at Dar al-Shifa, which he believes if only because they never build anything nice beyond the wall. There are ten patients in total, all with late-stage Eleazar who had nowhere better to die. Six of them are children.</p>\n<p>The staff help him write a will. He marks off a little for his mother and leaves the rest to Alhaitham to deal with as he wishes. They don't ask him why he isn't staying with the person he's leaving most of his possessions to and he doesn't tell them.</p>\n<p>Dying is messy and humiliating, and the only thing that makes it bearable is that he's sleeping eighteen hours a day. He rapidly becomes unable to get out of bed. Then he loses the ability to sit up on his own. His hands become too weak to feed himself, but his interest in food is wearing away, anyway. The staff offer him his choice of anything he'd like to eat within reason, and part of him thinks of asking for rose kulfi, but that reminds him of Alhaitham and turns his stomach.</p>\n<p>Some of the others get regular visitors, but Kaveh doesn't. No one except Tighnari even knows where he is, and Tighnari is busy and probably quite frustrated with him, so he understands. He can't say he's not lonely, but for the most part, he's just so tired. He doubts he has much time left.</p>\n<p>They take away the Akasha terminal as his health dwindles, and he begins to dream for the first time since he was a child. He dreams of his student days, being late for class or forgetting a homework assignment. He dreams of sketching blueprints from a desk. He dreams of Alhaitham at his bedside, crying. He dreams of Alhaitham, above all else.</p>\n<p>And then, one day, he wakes, and he feels... all right. Not well, but better. Well enough to sit up on his own. To get to his feet on his own, though his balance is terrible. He's ravenous with hunger.</p>\n<p>And it's not just him. It's every patient at the hospice.</p>\n<p>And a runner arrives from Caravan Ribat to announce that it's not just the hospice, it is every single person with Eleazar, as far as anyone can tell. There has been a sudden mass remission. No one knows what to make of it. Additionally, the Akasha has been disabled and all of Sumeru is in confusion and-</p>\n<p>Kaveh grabs the clothes he arrived in and a bland medical cane, and takes the first available carriage to Sumeru City. He doesn't know what he'll do from there, but now that he's not dying, he wants to be as far away from this place of death as he can get.</p>\n<p>His first instinct is to go to Bimarstan, to have someone examine him and tell him exactly what state his health is in now. Then he sees the crowd around the hospital and changes his mind. He sits and listens to the chatter.</p>\n<p>It certainly sounds like Alhaitham has been busy. Prominently featuring in a coup does not sound much like him, but who knows what's changed in the past few months?</p>\n<p>It takes more strength than Kaveh <em>really</em> ought to waste, but he walks up through the winding streets of Sumeru City to the Akademiya. He wanders to the House of Daena, caught up in nostalgia.</p>\n<p>He finds Alhaitham, working quietly at a table.</p>\n<p>Alhaitham looks up. His eyes go wide as saucers. \"Kaveh,\" he breathes, voice more fragile than it has ever sounded before. Then something in his expression goes cold. \"So, what great building did our master architect work on this time?\" he asks, vaguely mocking.</p>\n<p>Nothing. Kaveh thought he'd never work on anything again.</p>\n<p>\"Where were you when Sumeru needed you most?\"</p>\n<p>Dying.</p>\n<p>Kaveh doesn't know how to answer.</p>\n<p>\"Oh?\" Alhaitham asks. \"You seemed perfectly comfortable talking about your project in the letter you left me.\"</p>\n<p>Kaveh takes a step back. Coming here was a mistake. He's not wanted. That's... entirely understandable. \"I'll just-\"</p>\n<p>Alhaitham sighs. \"Sit down,\" he says. \"Even a child could see how tired you are.\"</p>\n<p>Kaveh frowns, but carefully lowers himself into a chair. \"I heard you took down the Grand Sage, and now you're the prime candidate for the position.\"</p>\n<p>\"And I heard you were working on a project in Caravan Ribat,\" Alhaitham replies.</p>\n<p>\"I didn't say a thing to you about Caravan Ribat.\"</p>\n<p>\"And I didn't say I took down the Grand Sage.\"</p>\n<p>Kaveh sighs. \"I'm sorry.\"</p>\n<p>Alhaitham studies him. \"Are you really?\"</p>\n<p>\"I thought you wouldn't want to deal with someone dying in your spare bedroom,\" Kaveh admits.</p>\n<p>\"You didn't ask,\" Alhaitham replies. \"You-\" Somehow the sound, and the sigh after it, conveys all of his frustrations. \"You're too tired for this. Come home. I'm sure you haven't eaten since you got to the city.\"</p>\n<p>\n<em>Come home.</em>\n</p>\n<p>Kaveh smiles and gets to his feet, steadying himself with his cane. Alhaitham springs to his feet and takes his arm on the opposite side.</p>\n<p>\"And to be clear,\" Alhaitham says, letting Kaveh set the pace out of the House of Daena. \"I did <em>not</em> 'take down' the Grand Sage. I don't even know what that's supposed to mean. I assisted Lord Kusanali, yes, but that is simply the duty of members of the Akademiya.\"</p>\n<p>\"And since when did you care about <em>that?\"</em> Kaveh asks. He looks over at Alhaitham just in time to see the laughter flash in his eyes, and the satisfied--<em>smug</em>--tilt to his lips.</p>\n<p>Kaveh takes the opportunity he'd turned down a hundred times before. Turning is just a touch precarious, but he does finally get to kiss the smug off Alhaitham's mouth.</p>\n<p>When he pulls away, Alhaitham is blushing all the way down to his shoulders.</p>\n<p>---</p>\n<p>\"You didn't have to run away to die in the bushes like a wounded dog,\" Alhaitham says. \"If you didn't want to stay with me, Tighnari would have taken you. The Akademiya would have taken you.\"</p>\n<p>\"I was frightened,\" Kaveh says.</p>\n<p>\"Tighnari asked me how you were doing,\" Alhaitham replies. \"And I had to tell him I didn't know where you were.\" He sighs. \"He wouldn't tell me what happened, but he said that if you weren't with me, there were only so many places you could have gone. I had to look for you.\"</p>\n<p>\"You looked for me?\"</p>\n<p>\"And I found you, eventually. Though I don't think you were... quite there, by then. I tried to speak with you, but you just stared.\" Alhaitham draws a deep breath. \"And it was because of the Sages.\"</p>\n<p>Kaveh frowns. \"What did they have to do with it?\"</p>\n<p>\"They ran an experiment on all of Sumeru City during the Sabzeruz Festival,\" Alhaitham says. \"They used the Akasha to manipulate our perception of reality. You went days without food or medication. Of course your health would decline rapidly. Much longer and you would have died then and there.\"</p>\n<p>\"Oh.\" Kaveh swallows hard. \"Oh, that's...\" He studies Alhaitham. \"So you went up against the Sages to avenge me?\"</p>\n<p>\"I went up against the Sages because their further plans would have caused massive disruptions across Sumeru, and I knew by then that you had no hope of surviving a delay in your medication for a second time.\"</p>\n<p><em>\"And</em> to avenge me.\"</p>\n<p>Alhaitham's eyes glimmer. \"I won't deny that I was angry.\"</p>\n<p>\"So... what happened to all of the Eleazar patients?\" Kaveh asks. \"Why did I recover?\"</p>\n<p>\"I don't know,\" Alhaitham admits. \"I got a head injury during the execution of our plan. I had only been released from treatment for a few hours when you found me. I knew there had been a remission for most, but I... didn't want to assume anything.\"</p>\n<p>\"You were afraid to get your hopes up.\" Kaveh tilts his head to the side. \"You got a head injury?\"</p>\n<p>\"A concussion, yes,\" Alhaitham says. \"It's just sore now. How much have you recovered? Is- is the Eleazar gone?\"</p>\n<p>\"To my knowledge,\" Kaveh says. \"The crowd at Bimarstan was so thick that I couldn't even see the door. But they did a preliminary examination at the hospice, and they think the inflammatory and autoimmune responses have halted. I'm not dying anymore.\" It feels bizarre to say it. He's known he's dying almost his entire life.</p>\n<p>Alhaitham takes a deep breath. \"I missed you.\"</p>\n<p>\"I missed you, too,\" Kaveh says. And he must truly feel brave today, because he keeps going: \"I love you.\"</p>\n<p>Alhaitham smiles, a gentle thing that Kaveh imagines most people have never seen, and leans forward to kiss Kaveh.</p>\n<p>---</p>\n<p>\"Alhaitham,\" Kaveh calls. \"Alhaitham, which of these canes looks better with this outfit? The mulberry or the one painted green?\"</p>\n<p>\"I am going to leave you here if you don't hurry up and pick one,\" Alhaitham says.</p>\n<p>\"Or maybe the mahogany?\"</p>\n<p>\n<em>\"Kaveh.\"</em>\n</p>\n<p>\"Just because <em>you</em> don't care about aesthetics doesn't mean-\"</p>\n<p>\"I will leave without you <em>and</em> I will tell the Auntie next door that you're alone in the house and you need something to eat.\"</p>\n<p>Kaveh knows this is not an empty threat. Alhaitham has done it before. He picks up the mulberry cane and heads toward the door. \"There's no need to be so rude.\"</p>\n<p>\"And there's no need for you to own <em>twelve</em> canes in various woods and paint colors, but here we are.\"</p>\n<p>\"Thirteen,\" Kaveh says. \"I just ordered one in birch from Mondstadt.\"</p>\n<p>Alhaitham sighs. \"You're figuring out where to store it,\" he grumbles. \"I'm not letting you keep <em>all</em> of them next to the front door. There isn't enough space as it is.\" He holds the door open for Kaveh to leave in front of him.</p>\n<p>\"Of course,\" Kaveh says, because those words <em>are</em> entirely empty. Alhaitham will let him keep as many canes as he wants in any location he wants, as long as he gets to complain about it. \"You're quite impatient. Are you that hungry?\" He steps outside.</p>\n<p>\"Yes,\" Alhaitham grits out. He walks through the door, then turns to lock it behind them.</p>\n<p>\"Let's stop for kulfi on the way to the restaurant, then,\" Kaveh says. \"It's hot out.\"</p>\n<p>\"You just want kulfi,\" Alhaitham says. \"Fine. Which stall do you want to stop at? The one at the corner, or the one that's right next to Lambad's?\"</p>\n<p>Kaveh will never be healthy in the way that Alhaitham is healthy. The damage that the Eleazar did to his body has not undone itself. He is covered in scars. He tires quickly and needs some kind of mobility aid if he plans to go very far. He catches cold every time one of Alhaitham's coworkers does, even if Alhaitham never catches it himself and washes his hands with more religious devotion than he shows to his actual Archon. On bad days, his limbs still go numb or burn with pain.</p>\n<p>But he is alive. He is still designing buildings. The Palace of Alcazarzaray is no longer his greatest work, even if he can't spend long on a worksite anymore. And he has Alhaitham.</p>\n<p>Somehow, it's that last part that feels most important.</p>\n<p>\"Corner,\" Kaveh decides, letting his free hand fall into Alhaitham's. \"They use better rosewater. Come on. Let's go.\"</p>\n<p>\"Now who's impatient?\" Alhaitham asks, laughter in his eyes.</p>\n<p>Contrary to what his fellow students seem to believe, Alhaitham is, in fact, a human being with flaws and weaknesses. He keeps them closer to his chest than most, perhaps, but they are there. One of his weaknesses is that he thinks that his senior Kaveh is beautiful.</p>\n<p>To be clear, it has nothing to do with the excessive grooming behaviors Kaveh engages in, or his personal style best described as similar to a bowerbird--although the few times that Alhaitham has allowed himself the liberty of touching Kaveh's hands, the astonishingly soft skin has been a factor in making it difficult to pull away, and skin that soft is cultivated. The parts of Kaveh that Alhaitham thinks are beautiful are something else entirely: the intense single-minded focus he has when applying himself to his work, the genuine joy that dances over his face when provided with an interesting new piece of information even when it causes problems for him, the ability to translate his flights of fancy into something tangible as if it's effortless when Alhaitham knows full well that it is not.</p>\n<p>That first exam week, when Kaveh is unwell and arrives at their usual meeting place flushed with fever instead of passion, stumbling and disoriented but still capable of reciting material hardnesses and doing flawless trigonometry computations, Alhaitham comes to a realization.</p>\n<p>Kaveh rejects all offers of food for two days. Adding sugar to tea only adds so much nutrition. He needs to eat something. Alhaitham very nearly pleads for Kaveh to tell him <em>something</em> he will eat.</p>\n<p>\"Kulfi. Rose kulfi. No pistachios.\"</p>\n<p>Alhaitham has already bought the kulfi and is prying it off the stick to put in a bowl when it occurs to him that he would not do this for anyone else. It would not even occur to him as an option for anyone else.</p>\n<p>This is not a simple matter of admiration of or appreciation for Kaveh's best traits. Those things are there, yes, but there's something else, too.</p>\n<p>Alhaitham spends the next days thinking on it as he walks Kaveh to his exams, then rushes to take his own and finish in time to pick Kaveh up. He weighs the hypothesis in his mind.</p>\n<p>Yes, he decides. Love. Nascent love, but love, nonetheless. Romantic love, even.</p>\n<p>He knows, though, that the ways he can act upon this are limited. Kaveh is driven. There is something that he wants above all other things, and it is not young love. There is no question of Kaveh accepting a confession. He simply will not. In a way, Alhaitham admires this, too.</p>\n<p>Perhaps when they are older, when Kaveh has what he wants, perhaps then... something. Alhaitham is not the visionary of the two of them. He doesn't know what to imagine. But something.</p>\n<p>---</p>\n<p>When Kaveh is working on the Palace of Alcazarzaray, Alhaitham comes to understand something else, something he is honestly embarrassed not to have realized before: It's not that Kaveh has a weak constitution. Kaveh is <em>ill.</em> Kaveh has been ill longer than they have known each other.</p>\n<p>It isn't even that Kaveh has been hiding it, really. He just hadn't spoken of it, and it had never occurred to Alhaitham to ask. But in retrospect, it seems obvious. Why else would a student of architecture who didn't even keep a block in his schedule for socialization have such a strict exercise regimen--one consisting primarily of stretching? Why else would he make regular trips to Bimarstan?</p>\n<p>Kaveh is ill, and his health has only been declining while he works on this project.</p>\n<p>They have shouted at each other before, but the fight over the Palace is the first time it is truly ugly. Kaveh takes a rejection of the Palace he is killing himself for like a rejection of his own soul. They do not speak for eight months.</p>\n<p>What brings them back together is simple enough. Alhaitham hears that the Palace of Alcazarzaray has finally been completed. He asks where Kaveh is celebrating this achievement. No one knows.</p>\n<p>Alhaitham thinks of the way that Kaveh had already run himself ragged the last time they spoke, how long it's been since then. How passionate Kaveh gets as a deadline approaches, and how sick he was during exams and after he finished his thesis.</p>\n<p>And so Alhaitham almost goes straight out to the Palace to look for Kaveh--but it occurs to him to check Bimarstan first.</p>\n<p>There Kaveh is, pale and gray and still, lips bloodless. It does not suit him at all. Nor does the confusion and genuine fear in his expression when he wakes without recognizing Alhaitham.</p>\n<p>The next three days are miserable. Alhaitham misses assignments for the first time in his academic career because he cannot bear to leave Kaveh alone for this.</p>\n<p>It is a deep, deep relief to take him home.</p>\n<p>They never discuss that fight that they had. They never discuss the fact that Kaveh cannot spend more than five hours a day out of bed. Perhaps it's not necessary. Perhaps they understand each other.</p>\n<p>---</p>\n<p>The day after the Sabzeruz Festival, Alhaitham nearly loses Kaveh.</p>\n<p>Kaveh's health has been poor, but more or less stable, for months. And yet that morning.</p>\n<p>Alhaitham hears retching from Kaveh's room. Retching, and then something keening like a wounded animal.</p>\n<p>\"I'm coming in,\" Alhaitham says.</p>\n<p>There is no response.</p>\n<p>Kaveh is on the bed, soaked in sweat and streaked with vomit. His breathing is rapid and shallow. He doesn't look at Alhaitham, but his eyes are open, pupils blown huge.</p>\n<p>Alhaitham cannot let himself be consumed by fear at this critical moment. He wraps Kaveh in a fresh blanket and carries him from the house, head tilted toward the ground so that if he vomits again he will not swallow it.</p>\n<p>Bimarstan is crowded, but Kaveh's condition is far worse than any of the rest. The doctors take him from Alhaitham immediately.</p>\n<p>Kaveh is delirious, worse even than those days after the Palace. He won't eat anything, even when Alhaitham risks leaving long enough to buy kulfi.</p>\n<p>After four days, Tighnari convinces Alhaitham to go home, bathe, and sleep.</p>\n<p>When Alhaitham returns to Bimarstan, Kaveh is gone. For a few seconds, Alhaitham is certain that he's dead. Then one of the staff presents him with a letter, one in the clumsy hand that Kaveh has been forced to adopt in the past few months, claiming he has been commissioned for an important project.</p>\n<p>It seems they never understood each other at all. Alhaitham doesn't understand why Kaveh would run away. And Kaveh is capable of cruelty, but this--he must not know how badly Alhaitham hurts. He must not know.</p>\n<p>Alhaitham cleans Kaveh's room. He strips the bed and washes the soiled sheets and blankets. He clears out all the trash. He does not touch the blueprints on the desk. It is entirely irrational, but- Kaveh loves his work more than anything else in the world. If it is still here, then maybe he will come back for it.</p>\n<p>---</p>\n<p>\"He's not with you?\" Tighnari asks, genuine shock in his expression. \"I thought, certainly, with this...\"</p>\n<p>\"No,\" Alhaitham says. \"He vanished.\"</p>\n<p>Tighnari looks stricken. \"I'm sorry,\" he says.</p>\n<p>\"What are you sorry for?\" Alhaitham asks. \"Do you know where he is? Do you know what is <em>happening?\"</em></p>\n<p>Tighnari visibly steadies himself. \"What did Kaveh tell you? Anything at all?\"</p>\n<p>\"He told me that he was going to work on a project in the desert,\" Alhaitham says.</p>\n<p>Tighnari considers, quietly. \"I doubt he's in the desert,\" he says, finally.</p>\n<p>\"Where <em>is</em> he, then?\" Alhaitham demands.</p>\n<p>\"If Kaveh would not tell you, I should respect that,\" Tighnari says.</p>\n<p>\"You-\"</p>\n<p>\"But,\" Tighnari continues. \"You have been living with him for quite some time. You are the Scribe of the Akademiya, and they do not place fools in that position. Think, Alhaitham. You should know what's wrong with him by now without being told.\"</p>\n<p>\"He's ill,\" Alhaitham says.</p>\n<p>\"With what?\" Tighnari asks. \"Let me tell you what you know, Alhaitham. You know it is either incurable or difficult to treat, because he has been sick as long as you have known each other. You know that it causes his motions to be unsteady at times. You know that he is prone to infection.\" He looks straight at Alhaitham. \"You know that a peacock like him covers nearly every centimeter of his skin at all times.\"</p>\n<p>And Alhaitham knows. It is obvious. Perhaps he had just chosen not to know, before. \"Eleazar.\"</p>\n<p>\"There are only so many places that a late-stage Eleazar patient can go, if it is not their home,\" Tighnari says.</p>\n<p>---</p>\n<p>There are four hospices in Sumeru that take Eleazar patients. Of those four, only one is anywhere near the desert. Kaveh was ill and distressed and the mention of the desert was likely to be from somewhere else in his thoughts. Therefore, the first hospice that Alhaitham checks is the one just outside Caravan Ribat.</p>\n<p>Kaveh is there. Kaveh is dying.</p>\n<p>They have put him in a private room, like each of the other patients. The light shines through the window, but indirectly, not enough to blind the eye. The walls are painted a cheerful yellow. There are fresh flowers on the nightstand.</p>\n<p>It feels like a wasted effort.</p>\n<p>Kaveh's eyes are open, but he does not seem aware of anything around him. The staff tell Alhaitham that it may be that he is unaware, or it may be paralysis. Amurta scholars believe that sound is the last sense to decay, they tell him. It is possible that he will hear, even if he cannot respond.</p>\n<p>\"You didn't have to leave me, Kaveh,\" Alhaitham whispers. \"Why did you run away to die here?\"</p>\n<p>He reaches forward and strokes Kaveh's hair. The staff have been taking good care of him, at least. His hair is soft, recently cleaned.</p>\n<p>\"I would have stayed with you,\" Alhaitham continues. \"I would have cared for you until you were gone, Kaveh. Is it that you didn't want that?\"</p>\n<p>Kaveh's hands are dry. All of his skin is dry. He is dehydrated, and it is dangerous to give him much water at a time. But it aches that his hands are dry.</p>\n<p>\"I don't understand you, Kaveh,\" Alhaitham murmurs. \"I don't understand you, and now it seems I never will.\"</p>\n<p>He cries for the first time since he was a child.</p>\n<p>Then he leaves. Not because he truly wants to. But because the Sages' god-building plan is terrible and <em>will</em> cause massive disruptions in Sumeru. No one is going to prioritize bringing painkillers to a hospice when a new god is running around, and at the very least Kaveh deserves to die in comfort.</p>\n<p>---</p>\n<p>Alhaitham has been telling himself for days that Kaveh is almost certainly dead. Yes, Eleazar patients have experienced a remission. But it is unlikely that Kaveh survived until that point. He was on the very brink when Alhaitham found him. He would not have made it another three weeks.</p>\n<p>He tells himself this over and over, again and again, and then suddenly Kaveh is in front of him. Alive. Awake. Too thin, faintly trembling, standing with a tight grip on a cane he would never have chosen for himself. Alive.</p>\n<p>Alhaitham prides himself on his ability to approach situations rationally, even under stress, but he is human. Even he has his weaknesses, and Kaveh has been his weakness since they met.</p>\n<p>He is relieved in a way that he has never felt before. He is furious. He is terrified. He is- not going to make a spectacle of himself and Kaveh in the middle of the House of Daena. People are already paying far too much attention to him.</p>\n<p>Or he is going to make a spectacle of himself, because while Alhaitham knew how focused and efficient Kaveh could be when it came to translating his desires into reality, he had not once considered what that would look like if Kaveh wanted <em>Alhaitham.</em></p>\n<p>---</p>\n<p>Here are some things that Alhaitham knows about Kaveh:</p>\n<p>Kaveh is beautiful. He is at his most beautiful when he wants something slightly troublesome to obtain and has just realized how to reach it. He has no idea that this is what makes him beautiful and not the preening he constantly indulges in. (Alhaitham does not attempt to tell him because it would be absolutely humiliating.)</p>\n<p>Kaveh is ill. Kaveh has always been ill, and Kaveh will always be ill. He has canes and a wheelchair and wrist braces and ten vials of medicine, and they will not fix what the Eleazar has broken, but they make his life easier and so they are more valuable than gold. Some days are good, and he's almost as well as he was in the Akademiya. Some days are bad, and he can't--or shouldn't--get out of bed. There are more bad days when it gets cold or he is stressed, but they can and will arrive at any time with no rhyme or reason to them. (Alhaitham is grateful for even the bad days, because nothing will ever be worse than the days when he thought Kaveh was gone.)</p>\n<p>Kaveh loves kulfi. If a new kulfi stand pops up anywhere in Sumeru City, he will want to go. He will try each of the flavors in turn over a number of visits, and when finished with the process, will only want rose. When he's having a good day, he wants all the available toppings, and when it's a bad day he wants it as barebones as possible. Even if he turns down every other food, though, he will at least <em>try</em> to eat rose kulfi. (Alhaitham has learned to make it from scratch.)</p>\n<p>And Kaveh loves Alhaitham. Just <em>what</em> he loves about Alhaitham is anyone's guess, because all he ever seems to do is complain about him. A few of the complaints are even valid. But Kaveh loves Alhaitham, despite everything he complains about, reasonable or not. (Alhaitham would be a poor scholar indeed if he never doubted it--but every time he doubts, Kaveh is ready with evidence.)</p>\n<p>One day, Kaveh will be dead. One day, centuries after that, Kaveh's buildings and monuments and blueprints and writings will all crumble away into dust, and he will be forgotten. This is simply the way of things. But right now, Kaveh is alive. And Alhaitham is so, so fortunate that their lives have overlapped, that they have had the chance to know each other.</p>"
}