{
  "id": "4433063",
  "url": "https://archiveofourown.org/works/4433063?view_full_work=true",
  "author": [
    "relenafanel"
  ],
  "title": "Slide To Answer",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Captain America (Movies)"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers"
  ],
  "characters": [
    "Steve Rogers",
    "James \"Bucky\" Barnes"
  ],
  "additional_tags": [
    "Alternate Universe - Modern Setting",
    "Wrong Number AU",
    "Romantic Comedy",
    "Phone Calls & Telephones",
    "Dating",
    "One Night Stands",
    "Steve accidentally calls Bucky for dating advice",
    "Bucky gives good advice",
    "Meet-Cute",
    "Misunderstandings"
  ],
  "language": "English",
  "series": "Part 1 of Slide to Answer",
  "published": "2015-07-27",
  "completed": null,
  "words": "6,326",
  "chapters": "1/1",
  "comments": "877",
  "kudos": "30,772",
  "bookmarks": "6,250",
  "hits": "306,955",
  "summary": "<p>\"What do I do?” Steve appealed into the phone. “I’m freaking out.”</p>\n<p>There was silence on the other end of the line. It lasted so long that Steve pulled the receiver away from his ear and frowned at it. Pay phones were old. Maybe this one wasn’t working despite the obvious dial tone when he picked up.</p>\n<p>“Ok,” a stranger’s voice said over the phone. “First acknowledge the fact that you dialed the wrong number, but be quick about it because my cab is a few blocks away from my own plans and I’m about to drop some truth bombs on you.”</p>",
  "notes": "<p>(with thanks and apologies to <a href=\"https://archiveofourown.org/users/biblionerd07\" rel=\"nofollow\">biblionerd07</a> for letting me use her bad dating experience for one of the scenes).</p>\n<p>Warnings for: Bad dating experiences that include creepy one-liners that strip recipient of bodily autonomy, slight judgment of different dating styles, and one point with a misunderstanding where Bucky almost turns Steve down.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p><a href=\"https://relenafanel.tumblr.com/\" rel=\"nofollow\">Follow me on Tumblr.</a> I'm hilarious and complain a lot about my million WIP, but then I finish one and everyone is happy.</p>\n<p> </p>\n<p>Also, FYI, this fic demonstrates why the <a href=\"http://www.cbc.ca/news/trending/canadians-top-the-world-in-smiling-poop-emoji-use-report-finds-1.3043143\" rel=\"nofollow\">top emoticon used by Canadians</a> is the poop emoji.</p>",
  "text": "<p> “<em>I want to fuck him</em>,” Steve hissed into the phone with a certain amount of desperation for advice, referencing an earlier conversation he had with Sam where Steve had insisted that he was just agreeing to the blind date for the free food.  “I can’t take him back to my apartment, the toilet is still backed up and I’ve been peeing in the tub and brushing my teeth in the kitchen sink.  I haven’t washed my sheets in 5 weeks, I don’t know if I have any condoms left, and I’m pretty sure I’m not wearing antiperspirant and the moment this jacket comes off, it’ll be noticeable.  This date wasn’t supposed to go well!  It was supposed to be an excuse for free food, and I know you warned me but you can say ‘I told you so’ later.  <em>What do I do</em>?” he appealed into the phone.  “I’m freaking out.”</p>\n<p> </p>\n<p>There was silence on the other end of the line.  It lasted so long that Steve pulled the receiver away from his ear and frowned at it. Pay phones were old.  Maybe this one wasn’t working despite the obvious dial tone when he picked up.</p>\n<p> </p>\n<p>“Ok,” a stranger’s voice said over the phone.  “First acknowledge the fact that you dialed the wrong number, but be quick about it because my cab is a few blocks away from my own plans and I’m about to drop some truth bombs on you.”</p>\n<p> </p>\n<p>“What?” Steve questioned. ”Sam?”  He knew how it happened, of course.  He was tucked into a corner in the back of the restaurant furtively talking into a pay phone while his cell phone was on the table next to Peggy.  She had given him an extreme look of warning when he excused himself to go to the bathroom, like she thought he’d run out the back door.  Peggy had known him for years, she should have more faith in his ability to face a problem head-on by now.  So he’d smiled at her, at her boyfriend, at his own date, and then left his phone next to his napkin and made a hasty retreat.</p>\n<p> </p>\n<p>The payphone had just been fortuitous.  He must have dialed Sam’s number wrong from memory.</p>\n<p> </p>\n<p>“Second,” the stranger’s voice drawled over the line, “I’m assuming you’re an adult.  You mentioned your own apartment and your voice is a hundred percent adult male, even if what you’re saying screams fifteen year old boy whose sexual experience is limited to touching his own dick.”</p>\n<p> </p>\n<p>“I’m twenty-eight.”</p>\n<p> </p>\n<p>“Then act like it!  If he’s not offering up his own apartment, then you don’t have to offer yours. If it’s going as well as you think it is, then go out again.  If you’re really that thirsty for it, pull him into the bathroom and get him to blow you.  You won’t have to take him back to your place or take off your jacket, but only if you have a condom on you.  Safe sex is good sex.  I know you’re a teenager and all, but remember that.”</p>\n<p> </p>\n<p>“I can’t just pull him into the bathroom…” Steve answered in a scandalized tone.  He felt a bit foolish, crouched protectively over the receiver of the pay phone as wait staff walked by him to get in and out of the kitchen.  “Can I?”</p>\n<p> </p>\n<p>“It’s easy enough.  Just tell him you’re going to the bathroom and hint that he should join you.”</p>\n<p> </p>\n<p>Contrary to belief, Steve had fooled around in a bathroom before, he just typically did it with people he was in a relationship with.  Someone he wouldn’t call the next morning?  A little more terrifying. “I already used the bathroom excuse to call you.  Or, well… you know.”</p>\n<p> </p>\n<p>The guy was silent for a moment, and Steve thought it was possible he was being laughed at.  Steve didn’t blame the guy.  “There are other places you can hook up.  Try an alley or the back of a cab.”  He could hear a muffled ‘sorry’ before the guy said, “I was told by this very nice cab driver to tell you not to use the back of a cab.”</p>\n<p> </p>\n<p>“I don’t think I’m the kind of guy to do that.”</p>\n<p> </p>\n<p>Steve could practically hear the shrug.  “So you’re not an exhibitionist, but you’re the kind of guy who is considering putting out on the first date. If all you want from him is sex, then fucking <em>get it</em>.  If not, get a second date and be more prepared next time.”</p>\n<p> </p>\n<p>“Yeah,” Steve took a deep breath, and he couldn’t quite believe he was about to take advice from a stranger.  Steve didn’t always take good advice from his <em>friends</em>. “Yeah, you’re right.  Thanks.”</p>\n<p> </p>\n<p>“No problem.  And, and hey! One last thing: <em>for fucksakes, call a plumber</em>!”</p>\n<p> </p>\n<p>Steve laughed and hung up.</p>\n<p> </p>\n<p>Really, that should have been the first and last time he heard the stranger’s voice on the other end of the phone.  It should have been.</p>\n<p> </p>\n<p>But it wasn’t.</p>\n<p> </p>\n<p>x.x.x.x.</p>\n<p> </p>\n<p>Steve was experiencing deja vu as he grabbed the cordless phone off the table in the hallway and ducked into the washroom.  The number he dialed almost rang out before someone answered with a half-formed word that could have been ‘hello’ or any other variation of acknowledgment. “Sam! I think my coworker is trying to set me up with her nineteen year old daughter.  She told me the entire department would be at her house, but it’s just the three of us.”</p>\n<p> </p>\n<p>There was silence on the other end of the line.  A familiar kind of silence that made Steve want to hit his head against the sink because <em>again?</em> He hadn’t called Sam.  Sam would already be laughing at Steve, because he knew Steve and Steve’s dating luck, but this kind of weighted silence was the kind that said things were about to get awkward.  “Is she attractive?”</p>\n<p> </p>\n<p>Steve let out the breath he was holding.  At least he was consistently dialing the wrong number instead of unloading his dating woes on multiple strangers.  “That’s not the point.”</p>\n<p> </p>\n<p>“No, I think the point is that you’re missing it.  She’s not trying to set you up with her kid, she’s trying to get you for herself.  Are <em>you</em> attractive?  I feel like you might be attractive if this is happening to you, but maybe not because you have no idea how to spot someone throwing themselves at you.  That’s a thing that gets old and obvious really fast.  That’s irrelevant, sorry, sorry.  I’m a little tipsy.  Ignore me.  The point is, she’s wants you in her bed and made sure there was easy access.”</p>\n<p> </p>\n<p>“I don’t think…”</p>\n<p> </p>\n<p>“Oh yeah, babe, she wants in your pants the same way you wanted in that guy’s pants last month, and believe me, she’s more prepared than you were.”</p>\n<p> </p>\n<p>“I… what?  No… what do I do?” he hissed.</p>\n<p> </p>\n<p>“First, get off the house phone.  They’re probably both listening in.”</p>\n<p> </p>\n<p>“How…?” </p>\n<p> </p>\n<p>“How did I know?  You’d have Sam’s number on your own phone, so you’re not using it.  I bet you’re pretending to hide in the bathroom again, which is such a patent move for you it’s ironic considering how you treat your own.”</p>\n<p> </p>\n<p>“Hey! I called a plumber.”</p>\n<p> </p>\n<p>“That’s <em>fantastic</em>,” the guy answered in a dry, sarcastic tone that immediately made Steve like him more.  “Look, get off the phone, sit through the food like an adult, and then excuse yourself because you have a date later tonight.”</p>\n<p> </p>\n<p>“I don’t have a date.”</p>\n<p> </p>\n<p>“Oh god.” Steve was being laughed at again. “Are you telling me you can’t lie?  Ok, fine.  I’m going to be at Tip Top until about 10 tonight.  Come meet me.  If you’re exhausted by the time supper is over, just don’t show up.  That easy.  Now go.”</p>\n<p> </p>\n<p>Steve didn’t bother correcting the guy, because he could lie.  He could lie decently well if he had an actual lie in place, and even if the stranger on the phone didn’t realize it, he’d given Steve what he needed.  The problem Steve had with lying was when he was put on the spot.</p>\n<p> </p>\n<p>But he had plans later.  With <em>stranger on the phone</em>.  His good pal.</p>\n<p> </p>\n<p>He could get through this, he thought, hanging up without saying goodbye.</p>\n<p> </p>\n<p>.x.x.x.</p>\n<p> </p>\n<p>He was lounging in bed by nine, staring up at his ceiling with the hopes that maybe a blank canvas could help him piece together exactly what had just happened.  It had been a weird night.  Such a weird night.</p>\n<p> </p>\n<p>He kind of wanted to tell his good pal, <em>stranger on the phone</em> about it, because if anyone could understand the ridiculousness of it, it was him.</p>\n<p> </p>\n<p>“Hey,” Steve said, recognising the guy’s voice saying hello this time.  He knew that the guy had a local number, he’d just accidentally inverted the last two numbers in Sam’s phone number.  Twice.  It was easy enough to figure out now that he could consult his contact list.</p>\n<p> </p>\n<p>“Oh god, I’m sorry.  I left Tip Top hours ago.  Completely forgot about our date.”  Steve could no longer hear the sounds of the bar in the background, but there was clearly laughter coming from close by.  It took him a moment to place that it was from a television rather than people.  He knew, if the guy was listening, it would be obvious by the ambient noise that he wasn’t in public either.  If this stranger had figured out he was on a house phone, surely he’s already figured out he hadn’t accidentally stood Steve up. “By the sounds of it, you’re not looking for me.”</p>\n<p> </p>\n<p>“No, don’t worry about it.  I know you didn’t actually mean for me to meet you.  I just thought you’d be interested to know that you were right about the mom, but wrong about the daughter.”</p>\n<p> </p>\n<p>The guy was silent for a moment.  “What?” he questioned, his tone clearly amused.</p>\n<p> </p>\n<p>“She ran her foot up my leg at one point during dessert.”</p>\n<p> </p>\n<p>“Wait? The daughter or the mom?” he asked, a laugh burbling out of his mouth.  It sounded bright and amused, for all that it was at Steve’s expense.</p>\n<p> </p>\n<p>“The daughter,” Steve smiled, enjoying the story for its storytelling, or more likely, enjoying the response he was getting.</p>\n<p> </p>\n<p>“No way!  How attractive are you?”</p>\n<p> </p>\n<p>Steve rolled his eyes.  “I don’t think that’s it.  There was some kind of rivalry there and I ran out pretty quickly after food, so now I’m wondering if I can even go back to work.  I might have to quit my job.”</p>\n<p> </p>\n<p>“You’re such a damn drama queen,” the man laughed.  “Unless she’s your boss.  Then yes.  Quit your job.  But only if you have a back up and running away is your forte.”</p>\n<p> </p>\n<p>“You’re right,” Steve mused, staring at his ceiling and wondering what he was doing with his life.  “I’m being dramatic.  I don’t have to quit my job.  I might have to bring a date to the company function, but quitting is excessive.”</p>\n<p> </p>\n<p>“Somehow, I don’t think you’ll have a problem with that,” the man sounded like he was laughing at Steve.</p>\n<p> </p>\n<p>The fact that Steve hadn’t been in a relationship for over a year begged to differ.  “You don’t know this about me, and I know these conversations haven’t been a very good sampling of my personality, but I’m not the type of person to quit just because it’s tough going.”</p>\n<p> </p>\n<p>“Not a quitter, huh? So what happened to that guy you wanted to fuck?  Were back alley blowjobs involved?  Second dates?”</p>\n<p> </p>\n<p>“Well,” Steve mused.  “It’s not exactly quitting.  I considered both of those, but he didn’t tip the waitress.  It ruined my boner.”</p>\n<p> </p>\n<p>“Ew.”</p>\n<p> </p>\n<p>“Yeah,” Steve agreed.  “Thanks for talking this out with me.”</p>\n<p> </p>\n<p>“No problem,” he said with amusement.  “Name’s Bucky by the way.”</p>\n<p> </p>\n<p>“Steve.”</p>\n<p> </p>\n<p>“Well, Steve, I have mediocre Chinese take-out to finish while I’m still tipsy enough to think it’s tasty, so I’m going to let you go now.”</p>\n<p> </p>\n<p>“Sure,” Steve answered.  “Bye.”</p>\n<p> </p>\n<p>“Bye.”</p>\n<p> </p>\n<p>Hanging up was a little awkward, but then so was the entire conversation.  Steve programmed Bucky’s number into his phone, wondering if it was a weird thing to do.</p>\n<p> </p>\n<p>It <em>was</em> a weird thing to do.</p>\n<p> </p>\n<p>Whatever, though, it couldn’t be weirder than repeatedly calling a guy for dating advice while hiding in the washroom.</p>\n<p> </p>\n<p>x.x.x.x.</p>\n<p> </p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>Friday night!</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>If you have a dating emergency I might not hear the phone</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>Dance club tonight</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>Maybe you could text me from under the table like a normal 28 yr old on a date.</em>\n</p>\n<p> </p>\n<p>At one point, all Steve texted back was <em>!!!!!!!!!!!!!!!!!!!!!! things got weird.</em></p>\n<p> </p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>I feel like I’m missing premium gossip.</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>Callll meeee</em>\n</p>\n<p>\n<em> </em>\n</p>\n<p>x.x.x.x.</p>\n<p> </p>\n<p>It was a bit chilly out, but Steve liked the crisp feel of the autumn air.  It helped him decompress from his date, and there was something about the damp, cool smell of autumn that appealed to him.  It reminded him of leaves crunching beneath his feet, warm apple cider, and the excitement of preparing for Halloween.</p>\n<p> </p>\n<p>He was walking on a sidewalk that saw a lot of foot traffic over the run of a day, so there weren’t very many leaves for his foot to scrape against, but he did wonder if he could find apple cider at the Farmer’s Market.  He’d go in the morning, and detour across the park so he could take a moment to look at the leaves changing colour.</p>\n<p> </p>\n<p>Thoughts and plans helped him cool down enough, so after a few blocks of walking with his thoughts, all he really wanted to do was tell Bucky.  Bucky had said ‘premium gossip’ but it wasn’t quite that.  It was something best shared, though, and it felt weird that the first person he wanted to share it with wasn’t Sam.</p>\n<p> </p>\n<p>“So,” Steve said with no preamble once Bucky picked up the phone with an exclaimed ‘Steve!’.  “Are you ready to hear about my most recent dating misadventure?”</p>\n<p> </p>\n<p>“I don’t know,” Bucky answered him back in a yell.  There was incredibly loud dance music behind him, and Steve had no idea how Bucky could even hear him.  Maybe he just had good ears for hearing people while in a club. Steve had trouble with that so it was kind of baffling to him. “Are you hiding in the bathroom like dating is some kind of horror movie scenario?”</p>\n<p> </p>\n<p>“Dating isn’t, but this might be.”</p>\n<p> </p>\n<p>“What?”</p>\n<p> </p>\n<p>There went the theory of Bucky being able to hear him. “Dating isn’t a horror movie but this date might be,” Steve answered a bit louder.</p>\n<p> </p>\n<p>“It might be what?”</p>\n<p> </p>\n<p>“A horror movie!”  Steve yelled into the phone, wincing in apology as a couple on the sidewalk gave him wide berth.</p>\n<p> </p>\n<p>“I can’t hear you! Give me a moment,” Bucky answered, and Steve could hear him moving through a crowd, the sounds of music and people more prevalent than Bucky himself.  Steve would think it strange that Bucky always seemed to be out when he called if Steve didn’t consistently call him on Friday nights.  “Shit, it’s gotten cooler out,” Bucky said, and Steve could hear that he’d broken from the crowd.  The cacophony of the background seemed to become suddenly quiet, a stillness that carried over the phone line.  “Better make this quick, Steve.”</p>\n<p> </p>\n<p>“It’s only October,” Steve reminded him.  “It’s brisk.  You told me to call.”  Steve had opted to walk the fifteen blocks home rather than take public transit.  It had given him perspective, and that perspective was that other people should appreciate Brooklyn in the fall.  \"Enjoy it.  Breathe it in.\"</p>\n<p> </p>\n<p>“You’re an asshole, I'm standing next to a dumpster.  I just came from a sweaty club and this shirt is thin.  I wanted people to see my chest through it, but these nips are not what I meant.”</p>\n<p> </p>\n<p>Steve laughed in response.  The difficulty with having never met Bucky was that Steve couldn’t get a mental picture of that.  Oh, he could think of a random faceless body wearing a thin white shirt, but he didn’t know what color Bucky’s chest hair would be, or if he even had any at all, and he didn’t know Bucky’s size.  Bucky could be anyone. </p>\n<p> </p>\n<p>Anyone in Steve’s area code who spent time in a bar in Bed-Stuy.  That did not narrow it down as much as someone might think.</p>\n<p> </p>\n<p>“Well if you’re just going to complain, would you rather hear the story or go back inside?”</p>\n<p> </p>\n<p>“I’m out here already,” Bucky grumbled.  “But this better be good.  You’re making me regret that I quit smoking.  There’s this guy about four feet away taunting me with his cigarette. – <em>No, I don’t want to fight you for it</em>, Jesus Christ, ok, hold on I have to move.”</p>\n<p> </p>\n<p>Steve listened, half with amusement and half in concern as Bucky grumbled as he walked, complaining about drunk people. </p>\n<p> </p>\n<p>“Seriously, Steve, this better be a good story.  I’m freezing my balls off, here.”</p>\n<p> </p>\n<p>“Maybe that’s a sign your pants are too tight.”  That was something Steve knew from experience.</p>\n<p> </p>\n<p>“Maybe you wouldn’t think so if you saw my ass in them,” Bucky retorted.  “Now tell me your weird dating story.”</p>\n<p> </p>\n<p>It probably wasn’t that good of a story, but somehow that made the situation even funnier.  “I guess we’ll see how weird it is.  So the date was going ok.  The guy was a little strange, insisting to get my chair for me and offering to ask the hostess if I could keep the flowers on the table if I thought they were pretty, but nothing alarming.  In the right context it could be kind of sweet, in that way that people who don’t really understand how to talk to someone smoothly can be when they’re trying too hard.”</p>\n<p> </p>\n<p>“I’ll take your word for it,” Bucky drawled in response, blowing out a puff of air that crackled over the phone.  “Usually I think overly desperate people are a turn-off.”</p>\n<p> </p>\n<p>“Yeah, while I feel like I might disagree with you in principle, this is one case where you’re right.  So, supper is going ok.  Nothing weird happens, it’s not like he tries to dictate my food choices or order for me, or any of those annoying alpha male moves that are incredibly telling about someone’s personality.  So the food comes and we’re eating and talking, and it’s starting to get pleasant when he leans across the table, looks into my eyes, and says…” Steve paused for dramatic effect.</p>\n<p> </p>\n<p>“What?” Bucky questioned.  He was definitely hooked on the story.  Steve wasn’t a very effective storyteller, so he wasn’t sure why Bucky was so invested.</p>\n<p> </p>\n<p>“He says: I wish I could get you pregnant so you’d have to stay with me forever.”</p>\n<p> </p>\n<p>Bucky was silent for a moment before Steve could hear him inhale sharply over the phone.  “<em>What?</em>  What the fuck?”</p>\n<p> </p>\n<p>Bucky wasn’t laughing.</p>\n<p> </p>\n<p>There were a lot of things about Bucky that Steve liked in a ‘strangers who nod at each other on the train’ kind of way.  There were a few things about Bucky that Steve felt like he could even appreciate on a deeper level.  This was the first time he actively <em>liked</em> the person Bucky was.</p>\n<p> </p>\n<p>“I know.”</p>\n<p> </p>\n<p>“No, I mean. What. The. Fuck?”</p>\n<p> </p>\n<p>“I KNOW,” Steve answered.  “So I said: ‘that’s creepy and invasive someone’s bodily autonomy and not something anyone wants to hear, no matter their gender. I suggest you reconsider the way you speak to people. I’m going to the bathroom now and I’m not coming back’.”</p>\n<p> </p>\n<p>“Good.  What the actual fuck?” Bucky repeated.  “I feel like I should be laughing, like it’s so horrifying it’s funny, but instead I’m just standing here like a ridiculous asshole with my mouth open in shock.  Who the hell says something like that?”</p>\n<p> </p>\n<p>Steve smiled.  Yes, he did like Bucky more now that he told the story.  Possibly he’d used it as some kind of test, but he’d never admit to it.  “I told you it was weird.”</p>\n<p> </p>\n<p>x.x.x.x.</p>\n<p> </p>\n<p>“I got hit on three times, and then decided to just come home,” Steve told Bucky, picking at the shawarma he’d picked up a few blocks over.  He licked his fingers and wondered if he could have apple cider with this.  It would be a weird combination, but apples went with a lot of things Steve wouldn’t necessarily consider a good match.</p>\n<p> </p>\n<p>“You didn’t find any of them attractive?” Bucky questioned idly.  He told Steve that he’d just gotten back from a work trip and didn’t have the energy for more than a nap and maybe some internet porn later.</p>\n<p> </p>\n<p>“Eh,” Steve answered.  “They were ok.  I don’t know why they approached me, though.”</p>\n<p> </p>\n<p>“Attractive people are kind of my thing,” Bucky drawled in a lazy tone.  “Three people wouldn’t approach you unless you had something going on.  Believe me, I’m a connoisseur.”</p>\n<p> </p>\n<p>“I don’t consider myself that attractive,” Steve told him.  “I don’t like being judged by my looks from across a bar, like I'm some kind of prey.  Every time it happens I turn down the offer on the principle of the thing.”</p>\n<p> </p>\n<p>“See, you just said two contradictory things to me.  You wouldn’t get offers if you weren’t moderately attractive.”</p>\n<p> </p>\n<p>“There’s no accounting for the taste of drunk people,” Steve answered.  \"It leaves me feeling kind of cold to be considered based on how I look and not,” Steve hesitated, sure Bucky would laugh at him.  “Me.”</p>\n<p> </p>\n<p>“I understand, but look, even that guy you didn’t go home with would have taken one look at you in the beginning of the date and sized you up.  You did the same for him.  Everyone does it.  There’s something more honest about a stranger in a bar coming up to you with the sole purpose of sex.  Both of you know what cards are on the table, you’re not trying to impress him, or her, by giving little pieces of yourself that are both personal and yet something you judge as not being personal enough that you can’t tell a stranger.  There’s something unfussy about the ‘you’re hot, if you think I’m hot and down for it, we should fuck’ convo.  Something almost pure.”</p>\n<p> </p>\n<p>“Something almost pure,” Steve repeated slowly, holding the phone between his chin and his shoulder.  “Okay,” he continued with a laugh.  “Let’s say I do see your point, but I think there’s something really defeatist about it.  It might be honest, but it sucks the romance right out of equation.”</p>\n<p> </p>\n<p>“Steve,” Bucky answered him with an impatient whine.  “Of course it does.  We’re not talking romance, here, unless you need romance to be present in order to fuck.  Which is, you know, a thing I’m aware exists – just not our current topic here.  Unless it is.  We’re just talking straightforward sexual attraction.”</p>\n<p> </p>\n<p>“I don’t know.  It seems cold.  I prefer spending an hour across from someone and weighing whether I can stand them for any longer than that.  I like to know who I’m taking to bed.”</p>\n<p> </p>\n<p>“You almost ended up bringing home someone who doesn’t tip wait-staff.”  Bucky sounded amused as he reminded Steve of this little gem.  His tone emphasized it like not tipping was a grievous offense, up there with cannibalism.  Bucky had agreed that it was terrible when Steve first mentioned it, but now he was using it to make fun of him. </p>\n<p> </p>\n<p>(Steve really liked that about Bucky, in the growing list of things he liked about Bucky.)</p>\n<p> </p>\n<p>Bucky continued. “At least when you don’t know the person’s name, you can’t be held accountable for people <em>who don’t tip</em>.”</p>\n<p> </p>\n<p>“When was the last time you went on a date?” Steve questioned.</p>\n<p> </p>\n<p>“When was the last time you hooked up with a stranger?” Bucky countered.</p>\n<p> </p>\n<p>“Five years ago in college.  Your turn.”</p>\n<p> </p>\n<p>“Dating is for people who are worried about being alone for the rest of their lives. Are you?”</p>\n<p> </p>\n<p>“You’re evading the question.”</p>\n<p> </p>\n<p>“And I’m leaving now. Goodbye, Steve,” Bucky said.</p>\n<p> </p>\n<p>x.x.x.</p>\n<p> </p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>How about a challenge.</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>I will date someone if you try a one night stand.</em>\n</p>\n<p>\n<strong> </strong>\n</p>\n<p>Steve rolled his eyes when he looked at the texts.  Yeah.  Turned out he could back down from a dare.  <em>I don’t back down from challenges but I’ll have to decline.</em></p>\n<p> </p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*chicken* *poop* *happy face*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*eggplant* *eggplant* *heart* *bride* *baby bottle*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>Or your last date: *baby bottle* *stop light*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*poop*</em>\n</p>\n<p> </p>\n<p><em>OK FINE YOU’RE ON!</em> Steve texted Bucky back, amazed that a few emoticons had the ability to aggravate him into doing this.</p>\n<p> </p>\n<p>\n<strong>New text from Bucky:</strong>\n</p>\n<p>\n<em>*smirk face*</em>\n</p>\n<p> </p>\n<p>x.x.x.x.</p>\n<p> </p>\n<p>Steve didn’t give Bucky’s dare much thought except to berate himself over being annoyed into taking it.  He hadn’t really considered that he might go through with it until he spotted the guy leaning back against the bar, long, strong legs in a pair of tight black denim.  His leather jacket was open, and he looked casual about the fact he was perusing the bar to assess who he’d like to approach with an offer or a flirty line.  He wasn’t desperate in it, and while there was something detached about the efforts, Steve could appreciate someone who knew what they wanted and actively went for it.</p>\n<p> </p>\n<p>In other words, the type of person Steve had always had a curious kind of attraction to; the intense, temporary kind that was based entirely off of looks rather than mutual interests or intellect. </p>\n<p> </p>\n<p>He didn’t want to be just <em>anyone</em>, but he liked the idea of being chosen for a night by someone who looked discerning enough to leave if no one caught their eye. </p>\n<p> </p>\n<p>Maybe.  Maybe, he thought, he might go through with Bucky’s challenge after all.  His eyes immediately took in the man’s hands, the way he was holding his beer bottle loosely in his fingers like he was completely unconcerned by the potential of dropping it, and felt a thrill at that kind of practiced control.</p>\n<p> </p>\n<p>Yeah.</p>\n<p> </p>\n<p>Yeah, maybe he could do this.</p>\n<p> </p>\n<p>He <em>wanted</em> to.</p>\n<p> </p>\n<p>The man finally noticed Steve watching him, and he bit his lip as he took a moment to assess Steve back.  He tilted his head to the side and gave Steve a smile, the first reaction Steve had seen from him in the five minutes he’d been watching.  He finished his drink and licked his mouth, standing and leaving behind the bottle.</p>\n<p> </p>\n<p>Steve found that his heart was beating incredibly quickly.  He was nervous and aroused.  This was it.  He would either be able to do this or he wouldn’t.</p>\n<p> </p>\n<p>A few moments later Steve realized that he’d lost sight of the man on the dance floor, and he wondered if that was some kind of social cue he didn’t understand.  Was he supposed to get up and go meet him somewhere, some kind of unspoken rule people who did this regularly understood?</p>\n<p> </p>\n<p>He was about to get up to explore that possibility when his phone rang.  He pulled it out of his pocket, thinking it might be Sam cancelling on him, but the incoming call was from Bucky.  Bucky never initiated phone calls, only texts, so even though Steve didn’t think this was a great time, he answered anyway.</p>\n<p> </p>\n<p>“Hey,” Steve answered, deciding he’d find out what the call was about before he told Bucky he might be busy.  If Bucky was actually taking his own challenge seriously, the call could be about any number of things.</p>\n<p> </p>\n<p>“So what do you do when the most attractive man you’ve ever seen, like seriously gorgeous Steve, you’d consider it too if you saw him, is giving you eyes like he wants to take you to bed?  How do you do this?  Do I go over and talk to him and ask if he wants to get food?  Food’s a thing people do on dates, right?  Or maybe I should just… try the dating thing later.”</p>\n<p> </p>\n<p>“It’s your call.” Steve answered.  “Can you see him now?  What’s he doing?”</p>\n<p> </p>\n<p>“I don’t know,” Bucky said.  “I’m tired of this.  My eyes always go to the most beautiful person in the room, and I’m exhausted of there being absolutely no meaning behind the hook ups.  I know I challenged you, but I was really challenging myself.  Why can’t I meet someone who cares whether I tip the waitress?  I’ve been wondering about it for weeks.”</p>\n<p> </p>\n<p>Steve couldn’t help but smile, even though Bucky was genuinely worried.  “How do you know that you don’t?  Do you ever ask?  A lot of people feel really strongly about that issue.”</p>\n<p> </p>\n<p>“You know what I mean,” Bucky answered him, sounding exasperated.  “It’s not about that, specifically.  I don’t want to be alone for the rest of my life.”</p>\n<p> </p>\n<p>“Are you hiding in the washroom?” Steve asked, incredulously, trying not to laugh at the complete role reversal of Bucky calling him, freaking out about dating from the men’s room.  “Bucky, just go ask.  If you want something more, find someone who’s interested in the same things.  If the gorgeous guy isn’t, that’s his problem.  There will be someone you’re attracted to who is.  That’s what dating is.”</p>\n<p> </p>\n<p>“It’s not that easy.”</p>\n<p> </p>\n<p>“No, it’s not.  But I think it’s worth it.”</p>\n<p> </p>\n<p>“Do you?”</p>\n<p> </p>\n<p>“I’ll let you know.  I think I’m about to have a one night stand.  We’ll see how unfulfilled I feel in the morning.”</p>\n<p> </p>\n<p>“Steve,” Bucky answered in a serious tone.  “If you don’t want to… don’t let me project my insecurities on you.  I rescind the challenge.”</p>\n<p> </p>\n<p>“While I appreciate the thought, you’re not the only one who saw something they want tonight.”</p>\n<p> </p>\n<p>Bucky let out a bark of laughter, but he also sounded relieved.  “Dirty, tell me the details later.”</p>\n<p> </p>\n<p>“I’ll tell you about it in too much detail if you just suck it up and go try connecting emotionally to someone.”</p>\n<p> </p>\n<p>“Ok, ok, I’m going.”</p>\n<p> </p>\n<p>Steve hung up the phone and wondered if his conversation with Bucky had made him lose his window entirely.  He was about to get up and do something completely out of character, because if Bucky could do it, so could he, when the striking guy from the bar slid into the seat across from him.</p>\n<p> </p>\n<p>Steve stared at him in surprise for a moment, wondering if maybe he’d waited for Steve to get off the phone, though he hadn’t noticed him in the surrounding area while talking to Bucky, and it seemed kind of ludicrous to think that someone with as much going on for him as this guy did would wait for Steve.  The timing was too coincidental for it to be anything but.</p>\n<p> </p>\n<p>“What are your thoughts on the separation of religion and state?”  He asked in a confrontational tone, a sullen expression on his face, like he had very low expectations but high hopes for Steve’s answer.  There was something about the situation that had nothing to do with the man’s sinful lips that made Steve hesitate before answering.  Or, well, it had a lot to do with his mouth.  It took Steve a moment, too distracted by the pout and the challenging stare, to place the voice.</p>\n<p> </p>\n<p>Jesus Christ.</p>\n<p> </p>\n<p>Then he started laughing.</p>\n<p> </p>\n<p>Bucky.</p>\n<p> </p>\n<p>Jesus Christ.</p>\n<p> </p>\n<p>Bucky did not look happy that he was being laughed at, which made the situation so much funnier.  He gave Steve a dirty expression before getting to his feet.  “Figures,” he muttered.</p>\n<p> </p>\n<p>“Bucky, no,” Steve appealed in the most somber tone he could muster, and then broke into laughter again as Bucky frowned at him in confusion before his eyes widened drastically and he sat heavily in the chair.</p>\n<p> </p>\n<p>Bucky still did not find everything as funny as Steve did if his scowl was any indication.</p>\n<p> </p>\n<p>“I asked, multiple times I asked,” he pointed out, eyebrows dour.  “Just how attractive you were, for fucksakes, Steve!  You modest asshole. I went through all that just to find out it’s you, and you don’t count.  I <em>know </em>you.”</p>\n<p> </p>\n<p>“Oh my god,” Steve answered, because it was starting to occur to him exactly what Bucky had used as an opener.  <em>Jesus Christ, Bucky</em>.  “You don’t start with the heavy questions.  And you don’t act like you’re going to fight someone depending on their answer.”</p>\n<p> </p>\n<p>“Why not?” Bucky demanded, tapping his fingers on the bar.  “Those are the kinds of things that matter.  I don’t want to find out three months into a relationship that someone is a Republican.”  </p>\n<p> </p>\n<p>“I think you’d figure it out before then.  There are subtle clues.”</p>\n<p> </p>\n<p>Bucky rolled his eyes and continued pouting. Fuck, he was so gorgeous.  That, more than anything, pulled Steve out of the hilarity of the situation.  Steve wanted to bang him like a screen door and then carry him over the threshold. Was that weird?</p>\n<p> </p>\n<p>It was kind of weird.</p>\n<p> </p>\n<p>At least he hadn’t said it out loud.</p>\n<p> </p>\n<p>Bucky continued to look like life had betrayed him.  “How would you do it, then?”</p>\n<p> </p>\n<p>“Maybe you’d like to go out for supper sometime and see,” Steve responded, deliberately pitching his tone as low and intimate as he could.</p>\n<p> </p>\n<p>Bucky grinned.  “Ok, so your game is different from what I’m used to, but you still have it.  <em>Maybe you’d like to go out for supper sometime and see,</em>” he repeated.  “Yeah, I like that.  Think it would work on the guy in the purple shirt?”</p>\n<p> </p>\n<p>Everything seemed to come to a complete stop in Steve’s mind, like Bucky had just drenched him in ice water and all the warmth from their bantering was draining from his face.   “Maybe,” he managed to answer.  “Try and see.”</p>\n<p> </p>\n<p>Bucky gave him a smile and a thumbs up and got up from the table.  “Good luck with the guy you’re going to fuck.  I’ll get out of your way.”</p>\n<p> </p>\n<p>Steve wasn’t sure if it was ironic or horrifying that Bucky seemed to have <em>no idea</em>.  He managed a wan smile in response that couldn’t look like more than baring his teeth, and his mind was screaming at him, taunting him with the question: <em>where’s your courage now</em>?  He watched Bucky leave, and the view was maddeningly good.</p>\n<p> </p>\n<p>Steve was an idiot.</p>\n<p> </p>\n<p>Bucky was one too, but it was Steve’s idiocy that just let him walk away.</p>\n<p> </p>\n<p>Bucky seemed to jolt to a halt before turning and staring at Steve.  He was doing this squinting, confused face as something seemed to occur to him that had him taking a step forward to return to Steve.  He sat back down and hit his head against the table, keeping his forehead pressed against the metal top.  “It was me, wasn’t it?  I'm the guy.”</p>\n<p> </p>\n<p>“Yeah,” Steve answered, drawing out the syllables. </p>\n<p> </p>\n<p>Bucky nodded, and the motion was more like he was rocking his face against the table, which was vaguely disgusting, but completely sympathetic.  “Good.  I'm, uh... glad.  Maybe we could… uh… supper?  Food?”</p>\n<p> </p>\n<p>Steve knew this was not the time to laugh again, but it was tempting.  “Sure.  We can go out for supper sometime.”</p>\n<p> </p>\n<p>Bucky tilted his face up just enough so he could see Steve.  “You meant that as an invite, didn’t you?  Fuck, I’m bad at this.”</p>\n<p> </p>\n<p>“Yeah, you are.”</p>\n<p> </p>\n<p>Bucky grinned, fast and sharp.  “You know what I’m really good at, though?  I’ll fulfill yours if you fulfill mine.”</p>\n<p> </p>\n<p>“Better,” Steve pointed out, just to be an asshole.  “Not fantastic.”</p>\n<p> </p>\n<p>x.x.x.</p>\n<p> </p>\n<p>“’lo?” Bucky croaked over the phone, sounding sleepy and adorable.  Steve stood in the doorway of his bedroom and took in the way the sun looked shining on Bucky’s face.  He couldn’t really remember how this one night stand thing was supposed to go, but he didn’t think he was supposed to be this happy to wake up with someone in his bed.</p>\n<p> </p>\n<p>“So I think I lost your challenge,” Steve answered, smiling as Bucky’s eyes shot open and he turned to look at Steve standing there with his cell phone to his ear.</p>\n<p> </p>\n<p>“Couldn’t go through with it, huh?” Bucky asked with a sly grin, running a hand down his chest like a temptation.</p>\n<p> </p>\n<p>“Oh no, I did.  I brought him home with me, and we made out against my front door.  I blew him on the couch until he almost came, and then fucked him on my bed, slow and slick until he was begging.  I’m thinking of doing it again and then feeding him breakfast,” Steve said as he walked towards the bed.</p>\n<p> </p>\n<p>“Fuck,” Bucky answered, reaching for him, getting his fingers in Steve’s shirt and pulling him forward.</p>\n<p> </p>\n<p>“I promised you details,” Steve reminded him, sitting on the bed and leaning forward to kiss Bucky, his face tilted up for it.  “How did your night work out?”</p>\n<p> </p>\n<p>Bucky grinned and it was the first time Steve actually saw his expression when he was shy and uncertain.  “We’re going out for supper later,” he admitted. </p>\n<p> </p>\n<p>“That’s real good,” Steve told him over the phone.  “Make sure he takes you somewhere that you can sit and talk, so he can show you how much he likes you by paying you all the attention you deserve.  Make sure he’s good for you, that he’s a good fit, ok?”</p>\n<p> </p>\n<p>Bucky swallowed and nodded. He reached for Steve, deft fingers pulling at the drawstring of Steve’s pyjama pants.</p>\n<p> </p>\n<p><span>Steve put his hand in Bucky's hair and quickly leaned in for another kiss.  </span>“I got to go, I think I’m about to get a blow job.”  </p>\n<p> </p>\n<p>Bucky laughed at him.  “I think you might be right.”</p>"
}