{
  "id": "453655",
  "url": "https://archiveofourown.org/works/453655?view_full_work=true",
  "author": [
    "orphan_account"
  ],
  "title": "5 times Crowley was Summoned on purpose + 1",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "Other"
  ],
  "fandoms": [
    "Good Omens - Neil Gaiman & Terry Pratchett",
    "The Avengers (2012)",
    "Discworld - Terry Pratchett",
    "Harry Potter - J. K. Rowling",
    "Sherlock (TV)",
    "House M.D.",
    "Supernatural"
  ],
  "relationships": [
    "Aziraphale/Crowley"
  ],
  "characters": [
    "Crowley (Good Omens)",
    "Aziraphale",
    "Loki (Marvel)",
    "Samuel Vimes",
    "Mustrum Ridcully",
    "Ponder Stibbons",
    "The Bursar (Discworld)",
    "Lecturer in Recent Runes",
    "Voldemort",
    "Albus Dumbledore",
    "Sirius Black",
    "Jim Moriarty",
    "Greg House",
    "James Wilson",
    "Dean Winchester",
    "Sam Winchester",
    "Castiel",
    "Crowley (Supernatural)"
  ],
  "additional_tags": [
    "Magic",
    "Demons",
    "Angels",
    "Kissing"
  ],
  "language": "English",
  "series": "",
  "published": "2012-07-07",
  "completed": "2013-01-07",
  "words": "10,049",
  "chapters": "6/6",
  "comments": "242",
  "kudos": "12,380",
  "bookmarks": "1,845",
  "hits": "138,078",
  "summary": "<p>Crowley had no idea who'd let slip how to summon demons, but it was a damn pain in the arse sometimes.<br>Recently, however, things had just been getting ridiculous.<br></p>",
  "notes": "<p>FINISHED!!! AT LAST!!!</p>",
  "text": "<p>\"Come on, Aziraphale, we're going out!\" Crowley told the angel, waving two tickets at him gleefully and flopping down into an armchair. [1] \"These are tickets to the gig of the century: all the best bands gathered together in one stadium to play! They're coming here from all over the world!\" The demon was practically shivering with excitement.</p>\n<p>Aziraphale smiled benevolently at his enemy/colleague/sort-of-friend and surreptiously flicked some dust off the sweater he was wearing.[2] \"I see, my dear. I suppose that-\"</p>\n<p>\"Uh-uh, let me finish,\" cut in Crowley, grinning sharklike at the angel as he laid down his ace in the hole. \"<em>All</em>  proceeds go to charity,\" he finished, folding his arms triumphantly. \"It's practically your divine  <em>duty </em>as an angel to attend.\"</p>\n<p>\"So how do you plan to explain <em>your </em>presence there if anyone asks from your side, my dear?\" Aziraphale asked, putting down his cup, teaspoon and saucer very carefully and s moothing down the tablecloth. [3]</p>\n<p>Crowley scoffed. \"Please, like they'll even notice Down There. Anyway, I'll just say that I wanted to corrupt all the well-intentioned schmucks again. Works every time, I tell you. And--\"</p>\n<p>PUFF</p>\n<p>There was a brief, disorienting moment of speed, a brief smell of sulfur, and then Crowley blinked and looked around. He was in a dark,and dingy room. <em>Oh, no... not a summoning... </em>He groaned and turned around to see a pale, dark haired man wearing... was that leather armour...? and wielding a pointed metal staff.</p>\n<p>\"Tremble, spawn of the deepest pit of hell,\" he intoned. \"For I am Loki, the most powerful of them all, and I command thee to do my bidding.\"</p>\n<p>Crowley looked down to see a summoning circle. It was well drawn, but fairly useless for holding him captive. He raised an eyebrow at this 'Loki'. \"No puny mortal hasss the power or sssskill to bind one of the truly fallen. I will not sssserve thee. [4]\" he replied, playing up the hiss for all it was worth.</p>\n<p>[1] Tartan.</p>\n<p>[2] Tartan.</p>\n<p>[3] And tartan.</p>\n<p>[4] Crowley was largely of the opinion that if some idiotic satanists wanted to spout Ye Olde Englishe garbage at him then he would jabber it right back at them and see how <em>they</em> liked it.</p>\n<p>\"Thou must do my bidding, insolent serpent!\" The boy [5] spat in fury, his face darkening. The dark shadows beneath his eyes made his eyes gleam in a way that unsettled Crowley slightly. \"I command thee! I am your master!\"</p>\n<p>The serpent gritted his teeth in irritation. This kid was <em>really </em>starting to annoy him now. It was lucky for the little rat that Aziraphale was so against him wishing people out of existance, that was certain... Still, he <em>could</em> put the wind up him a little...</p>\n<p>Crowley whipped off his sunglasses and glared at him with golden slitted eyes. \"Sssserpent you call me, and ssserpent I am: the firssst, the tempter. I answer to none but the ruler of Below, the Adverssssary.\" he paused. \"If thou wissssheth to gain wealth, power or knowledge, thou may ssstrike a deal with Hell, sssummoner.\"</p>\n<p>Loki frowned doubtfully. \"What kind of deal?\"</p>\n<p>Crowley grinned, sharklike. \"Oh, the standard deal: you can have incredible power, wealth, or just the ol' 'long life and happiness' deal. Your choice, really. Anything you want, within reason.\"</p>\n<p>\"You... sound different than before.\" the Jotunn ventured, suddenly uncertain.</p>\n<p>\"Well, if you drop the stupid 'thou', 'thee', 'spawn of satan' nonsense then I will too, and I'll knock off the bloody hissing, yeah?\"</p>\n<p>Loki raised an eyebrow. \"Agreed. And in return for these boons... m y soul?\" his eyes glinted with hidden mirth.</p>\n<p>Crowley snorted, slipping his shades back on. \"Yeah, right. You're immortal, genius. That's what we in the game call 'cheating'. We could wait for a thousand years and never see so much as a glimpse of your soul.\" He waved a hand lazily and brushed a speck of dust from his impecably tailored suit. \"Twisted and rotten though it may be. No, you can just owe me one.\"</p>\n<p>Loki blinked. \"What, owe you a <em>soul?\"</em></p>\n<p>Crowley sighed. Idiots. Idiots everywhere. \"No, no. You'll owe me a favour, and I'll put you in touch with a war hungry alien army, ready to obey your every command. Seem fair to you?\"</p>\n<p>Crowley felt slightly smug: he didn't need to use any miracles to put the two sets of aliens in touch, so it wouldn't show up Below, and Crowley got to keep the favour all for himself. Who knew when having a god on your side would be useful? [7]</p>\n<p>\"Agreed.\" the trickster god replied, smirking slightly, and extended his hand to seal the deal.</p>\n<p> </p>\n<p>[5] Speaking as an entity that had existed in one form or another since the creation of the Universe, Crowley viewed any living creature younger than 2000 years old as a child in comparison to himself. [6]</p>\n<p>[6] This did, eventually, lead to the feeling that he was stuck in one massive cosmic nursery s chool with a co-worker who spent most of his time fingerpainting in the sandpit with the rest of the toddlers.</p>\n<p>[7] 'god', mind you, not 'God'. The essential capital letter made the crucial distinction between:</p>\n<p>1) A commendable effort at the manipulation and corruption of powerful and influential beings, and <br>2) a good and righteous smiting from the creator of the universe.</p>\n<p> </p>\n<p>Crowley clasped his hand, infusing the touch with a dab of Power to make the Contract binding.</p>\n<p>Loki gasped as a tendril of dark smoke wound its way around his hand and up his forearm. It left an unpleasant-looking demonic sigil there, which glowed red for a second before fading into the skin.</p>\n<p>\"Just a little something to make sure you don't renege on our deal, hmm?\" Crowley told him. \"It's a little difficult to trust the god of lies. No offense meant.\"</p>\n<p> \"None taken.\" Loki paused. \"I assume you'll need help getting out of the circle.\"</p>\n<p>\"Hmmm? Oh, no. I'll be fine by myself, thanks.\" Crowley replied with a smile, stepping out of the circle with ease.</p>\n<p>Loki drew back in shock. \"But... the... the circle! It's meant to bind you there!\"</p>\n<p>Crowley snorted again. \"Please. This couldn't even hold an imp, let alone a fallen angel. The circle only summons, it doesn't trap me. I could have gotten out at any time I wanted. Lucky for you I decided to cut a deal.\" He smirked, giving him a nod. \"See you around.\" </p>\n<p>The demon snapped his fingers and disappeared in a puff of sulfurous yellow smoke.</p>\n<p> </p>\n<p>~ GO ~ GO ~ GO ~</p>\n<p> </p>\n<p>Two weeks later, when the television showed alien invaders trashing New York and Aziraphale was tutting disapprovingly at him, Crowley was lounging in an armchair and smiling smugly in the knowledge of a job well done.</p>\n<p>\"Will someone get the Bursar down from there?!\" Yelled Archancellor Ridcully, who was glaring at the levitating form of his colleague and gripping his staff tightly.[1] \"Who's got the dried frog pills? Stibbons, stop him floating away, bigods!\"</p>\n<p>His Grace, Sir Samuel Vimes, Duke of Ankh and Commander of the City Watch, glowered at the group of men bustling around in sequinned robes and pointy hats. <em>Bloody wizards,</em> he thought darkly as watched the pantomime unfolding before him. Always mucking around with the occult, rending the very fabric of reality asunder and the like. Troublemakers, the lot of them.</p>\n<p>Vimes sighed.\"Oh, for... Constable Swires, go fetch him down, will you? Preferably before the damn wizards blow someone up.\" He winced. \"Again.\"</p>\n<p>The tiny policeman saluted and jumped on the back of his Lancre Lappet-faced Worrier. \"Aye, Commander, Ah'll gae an' get 'im noo!\" The falcon lifted into the air and flew towards the unstable [2] figure of the Bursar.</p>\n<p>Vimes turned to Ridcully. \"You know that when I asked for a consult you <em>could </em>have just sent Stibbons. You <em>really</em> didn't all need to come.\"</p>\n<p>\"Nonsense!\" Ridcully boomed cheerfully. \"Nothing worse than a rogue demon-summoner on the loose!\" He strode over to the chalked circle. \"Not after that nasty business with Eric and Rincewind.\"</p>\n<p>Rincewind, Professor of Cruel and Unusual Geography, poked his head around a pair of arguing wizards. \"I'd like to point out that it wasn't my fault!\"</p>\n<p>\"Yes, yes, duly noted. So, Sir Samuel, what can we help with?\"</p>\n<p>Vimes glowered a little, but let the 'Sir' pass. After all, it wasn't like he could just quit the nobility. Sybil would <em>kill</em> him, for a start. \"We need to know anything you can tell us, really. What kind of demon, how powerful. Are there, oh, I don't know... <em>kinds </em>of magic?\" he tried.</p>\n<p>\"Definitely. And as for the rest... Runes?! Get over here!\"</p>\n<p></p>\n<p>[1] Normally the Bursar's little habit of forgetting that gravity applied to him would be fine, provided that nobody reminded him that he couldn't fly and turned out to be right. However, the real world was lacking in a few areas compared to Unseen University - namely, it didn't have a bloody roof.</p>\n<p>[2] In, oh, <em>so </em>many senses of the phrase.</p>\n<p>The lecturer in recent runes stopped arguing with the senior wrangler and began inspecting the circle. \"Ah, I see... yes, there, but... no, that <em>can't </em>be right. And why would he do that?\" he blinked up at Ridcully. \"Whoever did this, he's certainly very unorthodox. I mean, it would <em>work, </em>but I haven't a<em> clue</em> what kind of demon he ended up with. I think he <em>made</em> a couple of runes <em>up!\"</em></p>\n<p>Ridcully nodded. \"Well, only one way to find out, then!\" he said brightly, and before Vimes could stop him, he'd raised his staff and fired a bolt of magic into the circle and a figure appeared in the centre of the circle.</p>\n<p>\"I was in my <em>Bentley,\" </em>Crowley whispered in horror, staring his hands as if the steering wheel - or, indeed, the rest of the car - might suddenly rematerialise in his hands. \"My <em>Bentley!\" </em>I was on the motorway, it'll be ruined! You <em>bastards.</em>\" he looked up at them and and blinked in confusion. \"Uh... are you summoning demons at a <em>fancy dress party? </em>It's simultaneously very original and incredibly ill-advised.\"</p>\n<p>Vimes stepped forwards into the demon's line of sight. \"This isn't a... whatever you said. This is Ankh-Morpork, and we need you to answer some questions.\" He told the demon, slipping straight back into 'policeman' mode. Or, as he privately thought of it, 'suspicious bastard.'</p>\n<p>The demon squinted disbelievingly at him. \"Look, I'll ignore the armour, but why the hell are those people dressed as magicians? The whole thing with the robes and pointy hats?\"</p>\n<p>\"<em>Wizards, </em>actually and we're dressed like this because we <em>are </em>wizards.\" Ridcully told him, looking slightly miffed. \"Look:\" he raised his staff and turned a nearby rat into a frog.</p>\n<p>Crowley gaped, then frowned. Oh, g- sa- <em>somebody, </em>what the <em>hell </em>is going on? I need to go home to London, Aziraphale will be missing me.\"</p>\n<p>Ponder came over to the group, nervously polishing his glasses \"Uh... I think that the Professor of non-existant magics has just sat on somebody, and...\" he gaped as Crowley pulled out his mobile phone, checking for signal. \"That's... sir, that's what they do on <em>Roundworld!\" </em>He turned to Crowley, almost vibrating in excitement. \"Mr... uh...\"</p>\n<p>Crowley looked up glumly. \"Crowley,\" he told him. \"And 'Roundworld'?\"</p>\n<p>\"Yes Stibbons, what are you talking about?\" Ridcully demanded.</p>\n<p>\"You know, that strange place Hex found when we were scrying? Adrian and I were studying it until he left for Pseudopolis. They use magic to power all sorts of devices.\"</p>\n<p>\"Electricity,\" Crowley corrected, stowing his phone in his pocket.</p>\n<p>Vimes perked up. \"Really? How do you get it out of the sky?\" he asked, interested.</p>\n<p>\"Uh... you burn coal, which heats water into steam, which turns a turbine which is connected to a generator, which produces electricity. I wouldn't bother, though - the fumes pollute the planet really badly, and you seem to be getting along just fine without it.\"</p>\n<p>\"So it's a little like what the dwarfs do... would a Device do to turn the generator?\" he wondered aloud. \"It's this little thing that <em>never </em>stops turning.\"</p>\n<p>Stibbons turned to him in excitement. \"That's... well, the possibilities are <em>endless! </em>I wonder if... Well, we can start researching it in the High Energy Magic building.\"</p>\n<p>Ridcully waved a hand dismissively. \"Yes, yes, fine. Now, Crowley.\"</p>\n<p>\"Yes?\"</p>\n<p>\"So, this is the first time you've been here? You weren't summoned before?\" he tried.</p>\n<p>\"Here? No, definitely not. I think I'd have remembered coming to this place.\"</p>\n<p>Ridcully sighed. \"Oh well, it was worth a shot.\" He scuffed away the runes with his shoe. \"You're free to go home.\"</p>\n<p>Crowley snapped his fingers, there was a puff of smoke and... Crowley stayed exactly where he was. He looked up at them in horror. \"I can't get home. I'm stuck in another bloody <em>Universe!\" </em>He paused, then sighed. \"I've got a dinner date with the angel at the Ritz in an hour. He's going to make that '<em>I'm disappointed but I'm sure you couldn't help it</em>' face at me.\"</p>\n<p>Vimes winced. Sybil was <em>good </em>at using that face. But... \"Angel?\"</p>\n<p>\"Don't ask.\"</p>\n<p>Vimes nodded as Crowley stepped out of the circle. \"Well, I'd better go if you can't help us with our enquiries. Good luck getting home.\" he nodded to the wizards and moved away. \"Watchmen? We're leaving!\"</p>\n<p>Ridcully turned to the downcast demon as the coppers left, their relief palpable. Nothing worries a good copper more than somebody with the power to destroy the City by accident and the common sense of a suicidal lemming. \"Not to worry, we'll let Hex have a go at working out how to send you back!\"</p>\n<p>Crowley blinked. \"Who's Hex?\"</p>\n<p>\"That may,\" Stibbons told him, \"be the wrong sort of question.\"</p>\n<p> </p>\n<p>~ GO ~ DW ~</p>\n<p> </p>\n<p>\"You built a <em>computer? </em>And it runs on <em>ants?\" </em>Crowley stared at the giant network of tubes, strange little mechanical doodahs and things  that went <em>sproing [3] </em>that stood before him. There was teddybear sat on top of it. He didn't ask.</p>\n<p>The quill pen attatched to the machine began to write. « <em>Yes. My name is Hex. How may I be of assisstance? »</em></p>\n<p>Crowley blinked. \"It's <em>sentient?\"</em></p>\n<p>Ponder made a face. \"Nobody's quite sure, to be honest. But he's brilliant at maths.\" He raised his voice a little. \"Hex? We need to know how to send Crowley back home to roundworld. Can you help us?\"</p>\n<p>« <em>Affirmative.</em> »</p>\n<p>Something made an odd noise in the depths of the machinery and Stibbons winced. \"There goes the semi-fluctuative inequality detector [4],\" he muttered. </p>\n<p>Crowley moved hastily away from the machine.</p>\n<p></p>\n<p>[3] As any good evil genius will tell you, you <em>have </em>to have something that goes <em>Sproing. </em>It's a matter of style.</p>\n<p>[4] The more complicated the name, the higher the funding. Well-known fact.</p>\n<p>*****</p>\n<p>\"And you're <em>sure</em> that this will work, are you?\" Crowley asked, fidgeting nervously.</p>\n<p>\"Yes, relatively,\" Ponder replied. \"There's a less than 4.5% chance of us overshooting.\"</p>\n<p>Crowley swallowed. \"Right,\" he murmured. Taking a deep breath, he stepped into the circle.</p>\n<p>Ridcully gave him a thumbs up. \"Good thing not much can kill a demon anyway!\" he said cheerfully.</p>\n<p>\"<em>Wha--?!\"</em></p>\n<p>Ponder pulled the lever.</p>\n<p>Crowley's form stilled mid-yell, flickered for a moment, then faded gently away. The room was silent for a moment before Stibbons broke the spell by murmuring \"I hope he got home alright.\"</p>\n<p> </p>\n<p>~ GO ~ DW ~</p>\n<p> </p>\n<p>\"<em>--at?!\" </em>Crowley finished yelling, then fell over. He groaned, face-down in the grass of St James' park. Home, he was <em>home...</em></p>\n<p>\"Crowley? My dear boy, whatever is the matter?\" Aziraphale's gently sophisticated tones washed over him and he grinned. It was good to be home.</p>\n<p>\"Angel,\" he started, opening his eyes, \"You would not <em>believe </em>the day I've just had.\"</p>\n<p> </p>\n<p></p>\n<p> </p>\n<p> </p>\n<p>\"My lord, are you sure that this is the course of action that you would like to take...?\" Severus probed gently, head respectfully bowed, as the Dark Lord commanded.</p>\n<p>Voldemort smirked. <em>\"Yes</em>, Severus, I <em>am</em>. A demon has power enough to destroy this so-called 'Chosen One' once and for all, before he even becomes a threat to us.\" His eyes glinted dangerously as he frowned at his most loyal of servants. \"I am your <em>master</em>, Snape, and you would do well to remember it.\"</p>\n<p>Snape bowed. \"Yes, my Lord,\" he replied.</p>\n<p>\"Good. Now, let us begin!\" The Dark Lord announced.</p>\n<p>The massed Deatheaters drew their wands and began to release spells, chanting in latin the whole time. Soon the clearing where they stood was filled with arcs of light and glittering sparks as the cells grounded themselves in the glowing pentegram carved into the earth, along with the runes and sigils arranged around it. The light from it grew in intensity until it nearly blinded the wizards, and Voldemort raised his wand, crying out <strong><em>\"VOCARE DAEMONIUM!!!\" </em></strong>in a harsh scream.</p>\n<p>There was a moment of hushed calm and the circle's searing glare softened to a muted red glow that lit the clearing oddly, casting flickering shadows between the trees. Silence reined for a moment until someone coughed. All eyes went to the glowing circle and the suited individual standing within it, his face in shadow. Slowly the figure raised its head and gazed at them, its eyes hidden by dark glasses.</p>\n<p>\"Well? What is it that you want, humans?\" the figure asked, slipping the glasses carefully into its pocket to reveal slitted golden eyes. The Death Eaters said nothing, waiting for their leader to speak up.[1]</p>\n<p>Voldemort cleared his throat, stepping forwards with an expression of appropriate evil on his face. \"We have summoned you, oh being of darkness, in order that we may destroy our enemies, the hated --\"</p>\n<p>\"Oh, god, <em>more </em>of you,\" the demon muttered, interrupting. He rolled his slitted eyes and stuck his hands in his pockets. \"Look, it's very simple, humans. You can either let me go back to my vaguely-nefarious deeds, schemes and plans - I was in the middle of attempting to subvert an angel to the dark forces when you decided to go and summon me, thanks very much, and doing very well at it - or you can go ahead with this little drama, I can cut you a deal, and we can all go home, yeah? Either way, you're gonna have to tell me what it is that you want.\"</p>\n<p>Lucius started forwards angrily. \"How<em> dare</em> you address the Dark Lord in that manner?!\" He demanded, a rather ironic look of righteous indignation on his face.</p>\n<p></p>\n<p>[1] Interestingly enough, there have been very few moments in the history of humanity in which absolute silence has existed. This was one of the only three in the last century, caused by a combination of surprise and the muffliato charm. Naturally nobody made a note of it, or even noticed other than quietly thinking Oh, it's a bit quiet'. Typical.</p>\n<p>Crowley snorted. \"Oh, please. 'Dark Lords,' they're like apocalypses[2]: some well-intentioned idiot will defeat their nasty little plans, then give it another couple of centuries and there'll be another one around. I've been here for nearly 6000 years, and you can bet your ass I'll be here in another 6000 years, unless someone actually <em>succeeds</em> in bringing about the apocalypse this time. Again.\" he paused, smirking at the wizards. \"So, I'll ask you again: What. Do. You. Want?\"</p>\n<p>Voldemort laughed. \"I like him, he has spirit!\" he hissed gently to Nagini, who slid a little closer to the circle. To his surprise, the demon hissed violently back at the snake, who retreated quickly. \"You speak parseltongue?\" he asked in surprise.</p>\n<p>Crowley shifted forms into a snake for a moment as a reply, then reformed in his customary suit. He was growling slightly at this point: \"What do you <em>want</em> with me?\" he all but yelled.</p>\n<p>\"To do our bidding, of course!\" one of the deatheaters told him. \"Follow our commands!\"</p>\n<p>Crowley laughed, shoving his hands in his pockets. \"Nothing doing, wiseguys,\" he told them. \"It's simple: I'll cut you a deal, but youy have to pay up in the end. Otherwise what's the point? Ssso, what will it--\"</p>\n<p>Crowley was interrupted by the arrival of several other wizards, dressed in robes like the others, but without the cowls to conceal their faces. They attacked the deatheaters, quickly starting violent duels against them. Crowley watched, bemused, as the humans fought it out, with Voldemort entering into a violent battle against a white-haired wizard in sky-blue robes.</p>\n<p>While the other wizards seemed to be flinging spells left right and centre, these two seemed to be duelling with a sense of purpose, spells interweaving with each other into intricate patterns and shapes, so beautiful that they barely seemed deadly until Crowley nearly got his head taken off by a poorly-cast curse.</p>\n<p>Eventually the group of deatheaters dwindled as more and more of them disapparated away to safety, leaving a few shapes on the ground where they had been caught by surprise and stunned.</p>\n<p>The Dark Lord looked around at his army of wizards, now pared down to the bone, and snarled in defeat. \"Retreat, deatheaters, retreat!\" he called, throwing up a powerful shield. With one last hex sent whirling towards his opponent, they drew the shadows towards them and disappeared in a puff of black smoke.</p>\n<p></p>\n<p>[2] 'Apocalypse<em><strong>s</strong></em>' is a word which exists as an oxymoron all by itself.</p>\n<p>Crowley shook his head, stepping forwards out of the circle. Well, at least, he tried to step out of the circle. To his dismay, he rebounded against the invisible barrier the runes were projecting. Cursing, he tried again, to the same result. By now the wizards had picked themselves up and noticed the figure trapped in the glowing circle.</p>\n<p>Crowley tried to smile disarmingly, putting his shades back on. \"Uh... do you think you could give me a hand? I'm having a little trouble here...\" the wizards simply stared at him. \"Uh... I'm Crowley? Names, anyone?\"</p>\n<p>\"We are the Order of the Phoenix,\" the old man told him, smiling gently.</p>\n<p>\"Ok, nice name. Good imagery. And I guess<em> you're</em> the ones trying to stop those idiots then?\" he hazarded, rasing an eyebrow hopefully.</p>\n<p>\"Obviously,\" a dark-haired man next to the old man replied, frowning at the demon. \"Albus, can't we just hand him over to the Ministry like the rest of these scum?\" he glared at the demon as if he'd personally killed his hippogriff.</p>\n<p>\"Patience, Sirius,\" Albus replied, holding up a hand. \"I suspect that this man is not our enemy. Are you?\" this last was delivered to Crowley, who shook his head frantically. It was unlikey that any of these guys had any Holy water on them, but these days he learned not to take any risks he could avoid: he was still trapped in the circle, and it would be a little tricky explaining to those Below how he'd lost his body if they decided to try to kill him.</p>\n<p>\"Definitely not, they just kind of... brought me here.\" Crowley told them truthfully.[3]</p>\n<p>Albus smiled, blue eyes twinkling, just like Aziraphaple's when he was amused. He winked at the demon, pulling out his wand and casting a charm: \"Finite incantatem.\" The runes immediately stopped glowing, allowing the demon to step out, carefully trying to avoid the salt and iron filings scattered around it - they itched like <em>hell</em> if any of them touched his skin.</p>\n<p>\"Uh... thanks. I'll just be going then?\" Crowley said, itching to get away.</p>\n<p>\"And us, too. We have to get the Deatheaters to the ministry before they wake up.\" Albus told him, still smiling. \"Everybody, you'll need to take a deatheater each when you disapparate.\"</p>\n<p>The order began to disappear with a series of loud <em>cracks, </em>member by member, the clearing emptying until only Crowley and Dumbledore were left. Dumbledore looked around him absently, smiling at him. \"Oh, and Crowley?\" he said finally once the silence had been drawn out for a while. </p>\n<p>\"Hmmm?\"</p>\n<p>\"Tell Aziraphale it was good to finally meet you, will you? I have every confidence that you two will have a good time as friends,\" he replied, with a wink of his sparkling blue eyes, and disapparated.</p>\n<p> </p>\n<p></p>\n<p>[3] Hey, a job may be a job, but he sure as Hell wasn't about to try lying to these people, whether his amoral integrity was at stake or not.</p>\n<p>\"You're late,\" came a voice from behind him. Crowley turned, bristling slightly in indignation. </p>\n<p>\"Oh, I'm <em>so</em> sorry,\" he replied, voice dripping with sarcasm. \"It's so <em>terrible</em> that there's so many people summoning me left right and centre that I can't even get any of my <em>normal</em> work in inbetween getting pulled every which way by people like you who want something from me.\" he glared at the short man in the finely tailored suit [1] before him. \"I was halfway through a job, you know. And a bloody good one it was too, thanks very much.\"</p>\n<p>The man simply looked amused, raising an eyebrow at the angry demon trapped in the summoning circle. \"Oops,\" he replied, not sounding terribly impressed. \"Dreadfully sorry. I didn't realize you would be quite so busy.\"</p>\n<p>Crowley grumbled under his breath at <em>damn stupid angels and their stupid books </em> before nodding, slightly mollified. \"It's not exactly a cushy job, being the only demon topside, you know,\" he said bitterly.</p>\n<p>The irishman looked interested. \"The only one?\" he asked, eyes glittering. \"How come?\"</p>\n<p>Crowly's golden eyes narrowed. \"That'sss nothing to do with you, <em>mortal</em>,\" he hissed dangerously. He knew from experience that when humans got interested in demonic affairs it <em>never </em>ended well for anyone concerned.</p>\n<p>The man made a face. \"Oops. Sorry.\" he raised an eyebrow, pulling out some gum from his pocket and starting to chew it. \"So, what was this 'job' you were doing then?\" he asked him.</p>\n<p>Crowley scowled, then resigned himself to conversation with the man. Nobody ever just told him casually what they wanted any more, they wanted <em>customer service.</em> He was beginning to wish he hadn't come up with the whole damn idea in the first place.</p>\n<p>\"I shut down BT's entire broadband system for three days, again, and then I managed to reprogramme the cashpoint system of Natwest.\" he told the man, who nodded.</p>\n<p>\"Not bad, I suppose,\" he allowed. \"Crude, but effective - a knock-on effect of low-grade sin. Mass-produced evil. It's inventive, at least.\" He shoved his hands into his pockets.[2] \"Wouldn't it be better to go for something bigger?\"</p>\n<p></p>\n<p>[1] Thank god, someone with good taste. Crowley had begun to see tartan in his <em>dreams </em>by this point.</p>\n<p>[2] Incidentally <em>ruining </em>the line of his suit in a way that grated against Crowley's nerves. It was like painting a Bentley bright pink: it ruined the Look, and Crowley would hate you forever.</p>\n<p>\"Hey, I founded the Conservative Party, and the BNP. Also Manchester, and the M25.\" Crowley protested.</p>\n<p>\"...Ok, that's pretty evil,\" the man conceded, nodding. \"The name's Jim Moriarty, by the way,\" he added, off-hand. \"I'm... what was the charming little phrase that Holmes number 2 used?... ah, yes, 'a consulting criminal.' Quaint.\"</p>\n<p>Crowley grinned, snakelike. Which was to be expected, considering his original job as the serpent of Eden. This man effectively did his job for him, enabling crime and damnation in others. \"Nice. The name's Crowley.\"</p>\n<p>\"Hmmm...\" Moriarty nodded, grinning, eyes glittering oddly. Then his face sobered, though his eyes still glinted. His voice changed to a mocking English accent. \"Now, to business.\"</p>\n<p>Crowley sent out a wave of thanks to... well, whoever might be listening, to be frank. <em>Finally. </em>\"What do you want, Moriarty?\"</p>\n<p>\"A soul. One soul in particular: Sherlock Holmes.\" he made a face. \"The fool went and got himself <em>killed; </em>I mean, <em>really.</em> Just because I made him jump off a building, I didn't tell him to <em>die, </em>did I?\" Moriarty pouted. \"<em>Boring.\"</em></p>\n<p>Crowley blinked. Obviously a criminal mastermind wouldn't be <em>particularly </em>sane, but... <em>really? \"</em>I'm afraid that we don't usually do that kind of thing - how do you even know he went Down Below, anyway?\" he asked doubtfully.</p>\n<p>Moriarty raised an eyebrow, face devoid of any humour. \"Call it a hunch,\" he told Crowley. \"Here's the deal: I give you 1000 souls; you give me Sherlock Holmes' soul. I'll provide the body, and even if he isn't in hell, you'll still get the souls.\"</p>\n<p>Crowley hesitated, then nodded. It was a good deal, after all. \"Agreed,\" he told the criminal, holding out his hand.</p>\n<p>Moriarty shook it without hesitation, not even wincing as a spark of demonic energy sealed the deal. He smirked, stepping back and deliberately scuffing out the runes forming the summoning circle.</p>\n<p>Crowley frowned. \"Out of curiosity, where will you get the sinful souls to pay with?\"</p>\n<p>Moriarty waved a hand dismissively. \"I'll just kill off part of my organization,\" he replied.</p>\n<p>Crowley nodded, then clicked his fingers, summoning a large, black, leatherbound book into his hand, filled with the names and locations of the deceased. He  opened the book and read quickly down the page. He smirked, then closed the book with a <em>snap.</em> \"Sorry,\" he told the human. \"Nobody by that name.\" He paused. \"In <em>either </em>location. Looks like he's still alive, 'Jim'.\"</p>\n<p>And with that Crowley winked at Moriarty, smiling smugly, and faded away. And, just like the Cheshire Cat, the las thing to go was his grin.</p>\n<p>\"You were bored,\" Crowley echoed dully from within the confines of yet <em>another </em>magic circle. \"<em>Bored.</em>\"</p>\n<p>The man, who was lounging in a large leather swivel-chair and positioned only a meter, maybe two, from the circle's boundary, smirked at the depressed demon. \"Hey,\" he retorted, \"I'm not too thrilled about you turning up either.\" He waggled an eyebrow and leered at Crowley. \"I was <em>trying </em>for a succubus.\"</p>\n<p>Crowley shot backwards so quickly that he blurred, banging his head against the barrier around the edge of the circle. \"Aaaaarrk,\" he blurted articulately, then managed to pull himself together a little. \"Hands off, mortal, or I will make you <em>pay</em> later on,\" he threatened. \"I'm <em>strictly</em><em> </em>in the temptation business, and hapy to remain so.\" He paused. \"Well, except that one time, and that was for a bet. And technically, I'd be an incubus, so...[1]\" he trailed off, realising that he'd lost a little of his impetus. \"<em>Anyway,\" </em>he glared at the human malevolently, \"You stay <em>away </em>from me.\"<em><br>\n</em></p>\n<p>The human rolled his eyes. \"Touchy, touchy,\" he replied, smirking in a way that made the demon's hackles rise. \"Your innocence is safe with me.\" He paused thoughtfully. \"Oh, no, wait... demon, remember? Innocence isn't really part of the deal.\" He shrugged. \"I'm strictly an ass and tits guy anyway, though.\"</p>\n<p>Crowley folded his arms across his chest, glaring at this <em>irritating</em> man who had the audacity to taunt one of the Fallen.[2] \"Then what, and I am beginning to <em>loathe</em> the frequency with which I'm having to ask this, do you <em>want?\"</em></p>\n<p>\"Search me,\" came a voice from the corner. \"I've never been able to figure out what House wants.\"</p>\n<p>Crowley spun around to see a dark-haired man eating popcorn out of a bowl and watching their altercation with rapt attention. Crowley stared at the man, who raised an eyebrow at the yellow-eyed gaze. \"What? I've given up being surprised by House's insanity by this point. I'm just here for the show.\" He waved a hand dismissively. \"Just act as if I'm not here.\"</p>\n<p>The demon blinked, then sat down in his circle helplessly, staring at the wall. \"Only in America,\" he said to himself. \"This is the only country in the whole blessed <em>world</em> where they'd be doing this to me. Because they were <em>bored</em>.\" he paused, squinting up at the bemused humans. \"Did Aziraphale put you up to this? Is this his idea of a joke? Because I'm perfectly prepared to start up the practical joke war again.\" He scowled, clambering to his feet. \"Is <em>that </em>what this insanity is about, then?\" he grinned manically, <em>this </em>close to losing it and just deciding to blow up America instead of talking. An impressively sinful country it may have been, but he could cope with a small dip in his results. He had big hopes for Asia, after all... You know what, if they were going to be this ungrateful, maybe he'd <em>let </em>Armageddon happen, next time, and see how they liked it <em>then.</em></p>\n<p></p>\n<p>[1] Aziraphale tended to rub off on you after a while. Crowley had found himself using words such as 'articulation' in general conversation, which had to be the beginning of the end.</p>\n<p>[2] With Aziraphale it was a different matter. He was <em>meant</em> to irritate Crowley, though it seemed that nearly all of it was entirely subconscious on his part. But when you were being disrespected by every human you came across, you were obviously losing your touch a little.</p>\n<p>\n<em> </em>\n</p>\n<p>\"I'm going to pretend I know what the hell it is you're talking about and say <em>nooooo...</em>\" House replied, tossing a ball at the demon, who ducked. \"Do a magic trick, go on,\" he paused expectantly.</p>\n<p>\"Do... what?\"</p>\n<p>\"You know. Something demonic and awe-inspiring,\" House replied. \"Or, you know, pull a rabbit out of a hat. That's good, too.\"</p>\n<p>Crowley just whimpered quietly. Was he in an insane asylum? Was that it? Surely none of this could be <em>real... </em>he didn't think that americans had gotten <em>that </em>strange in the past twenty years or so, but maybe he'd missed something.</p>\n<p>\"House, stop being mean to him,\" the guy with the popcorn said. \"It's bad enough you trying to get the nurses in the clinic to quit without making an ethereal being depressed.\"</p>\n<p>\"Occult, not ethereal,\" Crowley muttered. </p>\n<p>House rolled his eyes. \"Yeah, yeah, whatever Wilson,\" He grumbled, grabbing his cane and limping over to the demon in the circle. He poked the demon with the cane, and Crowley snapped, grabbing it and burning the whole thing to charcoal, before he let go and let the dust float to the ground. House was left holding the handle of his cane. \"That was the one with the flames on it,\" he grumbled, dropping it to the floor. </p>\n<p>Wilson blinked in surprise. \"House,\" he said, deadpan. \"Do you think that you could <em>please</em> let the nice demon go before he decides that you'd look nice as a pile of ashes? Though I'm sure that you'd look lovely as a heap of impure charcoal, it might be a little tricky to explain to your mother why she's burying you in a matchbox.\"</p>\n<p>\"yeah, yeah, bring Mom into it why don't you,\" House grumbled. \"The demon's british and he burnt my cane! That doesn't deserve mercy!\"</p>\n<p>\"No, it just means that you probably shouldn't antagonize him,\" Wilson pointed out.</p>\n<p>House huffed out a sigh, pouting for effect. But Mo-o-om...\" he whined, sticking out his lower lip, clasping his hands under his chin and looking up at Wilson pleadingly. \"Can't I keep him, Wilson? Pleeeeeease??\"</p>\n<p>\"I can cut you a deal to let me out. That's my job, you know.\" Crowley pointed out.</p>\n<p>House shook his head. \"nah, I'm good thanks,\" he replied.</p>\n<p>\"Come on!\" Crowley replied. \"I'll even waive the whole immortal soul thing, just let me go!\" Nothing. \"There has to be something you want... money.\"</p>\n<p>\"I'm fine.\"</p>\n<p>\"Fame?\"</p>\n<p>\"Got it.\"</p>\n<p>\"A beautiful woman.\"</p>\n<p>\"Nah, I'm good with hookers, thanks.\"</p>\n<p>Crowley cast around desperately for something else to tempt the man with. What in heaven's name could he possibly want... \"I can heal you! Cure your leg for you, stop you ever needing that cane again.\"</p>\n<p>The man paused, shoulders tightening, and Crowley sensed victory, pressing home his point. \"You can do everything you used to be able to do, finally free of it. All you have to do is let me go.\"</p>\n<p>House straightened up, turning to look at the demon. The shadows fell oddly about his face, a beam of moonlight slanting in and putting the angles of his face into sharp relief. His features moved strangely as they contorted into an expression that he didn't recognize. House's lips moved and Crowly had to strain to hear the single word that he whispered between them. </p>\n<p>\"No.\"</p>\n<p>He moved forwards quickly, breaking the circle with the toe of his sneaker, and Crowley vanished with a puff of black smoke, leaving behind a slight whiff of sulphur and a white rectangle that fluttered to the floor. House stooped to pick it up, recognising it as a business card.</p>\n<p><em>A.J. Crowley,</em> It read, <em>Demon and Apocalypse-preventer. Also does parties. If you require my services, please don't hesitate to get lost. </em>House chuckled quietly.</p>\n<p>Wilson frowned thoughtfully. \"what did you say to him, House?\" He asked quietly.</p>\n<p>House straightened up. \"I said yes, of course, dimwit,\" he replied, snorting. \"You think I limp around all day for fun, asshat?\"</p>\n<p>\"Then... he didn't make good on his deal, then?\" Wilson offered.</p>\n<p>\"Evidently not,\" House replied, sarcasm dripping form his words. \"I can see why they call you the smart one, huh?\" He looked at the card in his hand, then back down at the circle thoughtfully. Then, witout another word, he turned and limped out of the empty office, Wilson following behind him. Just like always.</p>\n<p>It's universally accepted by satanists, theologians (of the more hands-on type) and hunters, that while it's child's play to summon up a demon, trying to find the <em>right </em>one is about umpteen times more trouble than it's worth. Attempting it tends to involve more hours of research than is generally considered healthy, as well as the headache that trying to spell a demon's name can give you. Don't even <em>attempt </em>to pronounce it - demons have a fondness for xs, js and qs, often consecutively, and appear to believe that vowels are for wusses. Then there's the fact that four times out of five you'll end up with the wrong demon <em>anyway.</em></p>\n<p>Considering this, it would probably surprise the casual onlooker (providing, naturally, that they had a decent knowledge of demon summoning) that the Winchester brothers were about to attempt just that. Then again, Sam and Dean happened to have two things that no other people had: Firstly, levels of pig-headed stubbornness that would put a camel to shame[1]. And secondly, they happened to have an angel on their side. Let's call it divine intervention.</p>\n<p>Dean added the finishing touches to the final sigil out of the seven that they'd spent several hours engraving into the stone floor of the cellar they'd rented. He stood up stiffly, wincing at the stiffness in his joints that came from lying on the ground, and dusted some of the dirt off his jeans.</p>\n<p>Sam pulled out a handful of salt, mixed with iron filings, and scattered it liberally around the edge of the circle. Dean nodded, smirking at Castiel. \"Come on then, angel, light her up!\"</p>\n<p>Castiel blinked, raising an eyebrow at the brothers. \"...Light what up?\" He asked. \"The cellar appears to be adequately lit already.\"</p>\n<p>Dean groaned. Bloody literalminded angels and their literalminded... uh... minds? He sighed. \"Doesn't matter, just start off the process, angel,\" he grumbled.</p>\n<p>Castiel nodded, as always the strong, silent type (a little voice in the back of Dean's head snickered shamelessly), and waved a hand over the dull runes which suddenly began to glow with angelic power. There was a strong wind that rushed through the cellar, accompanied by tendrils of smoke that whipped around in a mini-cyclone. A dark, handsome, slender figure in a stylishly-cut suit (Yes, the author has a crush on Crowley. Shush.) materialised in the centre of the circle, formed out of the smoke, with an anticlimatic <em>pop.</em></p>\n<p>Dean grinned, getting ready to gloat over his captive (hey, he might not do this for <em>fun</em>, but it helped to have a little gloating every now and then) and a smirk appeared on his face. The demon glanced up at them, sighed deeply, and pulled a set of speech cards out of his pocket.</p>\n<p> </p>\n<p></p>\n<p>[1] Stubborness is a much-underrated quality - while it may not have the same mountain-moving abilities as Faith, it's still a good trait to have in a prophet. (It took Joshua a <em>lot </em>longer than seven goes to knock down the walls of Jericho, and a hell of a lot more than trumpets).</p>\n<p>\"Hello,\" he read in a flat english monotone, \"You've chosen Satan and Co. express service for today's damnation. Thank you for giving us your custom. We offer a comprehensive range of services for our standard price of one freely-given immortal soul.\" He shuffled the cards in his hands. \"Are you a revisiting customer, or is this the first time you have used our services?\"</p>\n<p>There was a long silence, and Crowley waited expectantly. \"Shall I take that as a 'no'?\" he asked, smirking ever so slightly.</p>\n<p>\"What the hell?\" Dean heard Sam mutter, and the demon rolled his eyes behind his dark shades.</p>\n<p>\"Well, yeah,\" he replied, \"But the powers that be Down Below decided that we should have a new company policy: to whit, anyone who summons a demon up gets drowned in bureaucratic bullshit.\" He brightened up. \"Oh, that reminds me...\" he clicked his fingers and the cards containing said bureaucratic bullshit burned into bureaucratic ashes. \"That felt good.\"</p>\n<p>He paused. \"You know, I'm not sure whether to regret sending them that memo on corporate practice or feel proud that they're finally moving into the 20th century. I'm not even going to bother trying with the 21st...\" he coughed, embarassed. \"Anyway, sorry about all that, but orders are orders.\"</p>\n<p>Dean snorted, irritation letting him recover a little. \"Yeah, right. The hell you did - the 'King of Hell' doesn't have to take any <em>orders</em> from anybody.\"</p>\n<p>Crowley faltered, blinking. \"... no, I don't imagine he does,\" he replied cautiously. \"And your point is?\"</p>\n<p>Sam folded his arms, giving him <em>bitchface number 27: 'Yeah, right, do I <strong>look</strong> like a dumbass?' </em>\"It's not like anybody's going to be giving <em>you</em> any orders soon, Crowley, is it?\" he narrowed his eyes further at the demon. \"Not since you <em>betrayed </em>Cas and took over Hell, you snake!\"</p>\n<p>\"There's no need to get <em>personal</em>,\" Crowley muttered, face pale. \"And I know that I haven't been Downstairs in a while, but I don't think that even <em>I</em> could have missed a promotion <em>that</em> big.\"</p>\n<p>Dean growled between his teeth. \"Look, Crowley, just because you've gone and gotten yourself a new meatsuit doesn't mean that you can try and pretend that none of this ever happened! We don't forgive that easy.\" He managed to get the smirk back onto his face. \"And what's with the British accent[2]? You got a fondness for the British meatsuits or something? They just sound freaky.\"</p>\n<p>\"Definitely an improvement on the last one, though,\" Sam said absently, looking Crowley up and down appreciatively.</p>\n<p>Silence filled the cellar, and Dean turned slowly to stare at his little brother.</p>\n<p>Sam looked away as he noticed the sudden silence. \"What?\" he asked defensively, catching Dean's incredulous stare. \"Just <em>saying...\"</em></p>\n<p>Dean closed his eyes and put his head in his hands. \"There is a <em>time</em> and a <em>place\"</em> he said between his fingers, \"For hitting on people. And it is <em>not</em> when we've trapped a demon in a cellar!\"</p>\n<p>Sam rolled his eyes. \"Whatever, Dean. Cool it, I was just pointing it out.\"</p>\n<p>\"At least the kid has taste,\" Crowley told them, looking down at himself. \"There's not a thing wrong with my body - over six thousand years and not a single problem; one owner since new.\" He paused. \"Since <em>everything </em>was new, really... anyway, <em>I </em>like it!\"</p>\n<p>Castiel was busy doing the creepy stary thing he always freaked people out with - sure enough, Crowley had begun to look increasingly unnerved by the angel's intense gaze. When Castiel narrowed his eyes and tilted his head, the demon finally snapped. \"Ok... is this guy new or something? Because seriously, the staring thing's going to creep out the humans a little.\" He glanced back towards the brothers. \"Who's this guy? Is he as much of an arsehole as all the other angels? Well,\" he corrected himself, \"<em>most</em> of the other angels.\"</p>\n<p>Sam was enthralled by now. \"Do you have some kind of memory loss or something?\" he guessed, raising an eyebrow.</p>\n<p>Dean groaned. \"why do I <em>always</em> end up with the nutjobs?\" he asked the heavens. Or, at least, the cellar roof. The whole 'being underground' thing kind of ruined the effect.</p>\n<p> </p>\n<p></p>\n<p>[2] Note for Americans and other aliens: There is <em>no such thing </em>as the 'British Accent.' There are accents <em>from</em> Britain: there are English, Scottish, Welsh and Irish Accents. Even <em>within</em> England there are so many accents that most of the South half can't understand the Northerners. It's like saying that someone has a 'european accent' - one lot of people will be offended, and all the others will want to punch you for even suggesting that they sound like \"That lot of bastards.\"</p>\n<p>Castiel frowned, turning towards the brothers. \"He <em>seems</em> different,\" he admitted, \"There's something strange about him.\"</p>\n<p>Crowley snorted. \"Yeah; from the sounds of it you've got the wrong bloody demon! What, did you decide to start harassing me because you couldn't find <em>him?\"</em></p>\n<p>\"<em>Paranoid </em>nutjobs,\" Dean ammended.</p>\n<p>Sam glanced over at his older brother. \"I think he <em>has</em> finally cracked,\" he told him, thoroughly amused (hey, when you spend your life driving from cheap motel to cheap motel and getting nearly killed on the way, you get your kicks where you can find them).</p>\n<p>Dean scowled. \"We don't have time for this,\" he announced, pulling out a bottle of Holy Water from his pocket. This was angel-blessed, the strongest stuff you could get without actually knocking Raphael over the head in an effort to get him to give you anything other than a righteous smiting[3].</p>\n<p>\"Well,\" said Crowley, in time-hallowed words, \"<em>That</em> escalated quickly.\" He still regarded internet memes as a bit of work well-done for hell.[4] Trying to grin disarmingly, he took a step closer towards the Winchesters, one eye on the bottle of water. \"Just... put the bottle down and we can talk, ok?\"</p>\n<p> </p>\n<p>\"Man up a bit!\" Dean snapped, \"And start talking some sense, dammit! Anyway, the big <em>scary </em>'King of Hell' can't be afraid of a little pain, can he?\" he shot back, sneering.</p>\n<p>\"No,\" Crowley said weakly, bordering on the hysterical \"It's not that I'm unable to handle pain, it's more that I'd prefer not to go the way of Ligur and be smited into Oblivion, yeah?\"</p>\n<p>\"What the hell is <em>wrong </em>with you, Crowley?!\" Dean exploded, finally losing patience and just flicking some of the Holy Water at the captive demon. Crowley flinched backwards, yelling out in pain; he had thrown up his hands to protect his face, and the water burned his skin like acid. His wings came out as reflex; an attempt at making him seem larger and more intimidating. His shades lay where they had fallen, discarded, as Crowley glared at the two hunters, eyes blazing.</p>\n<p>Dean's eyes widened and he stumbled backwards, swearing loudly and fumbling desperately for his demon-killing knife. The bottle of Holy Water dropped to the floor unheeded and smashed, splashing the edges of Crowley's wings. Black smoke rose from them like steam and he hissed in pain, beyond anything as human as <em>words; </em>his mind was going straight to snake, instincts ingrained since the Garden.</p>\n<p>\"Yellow eyes,\" breathed Sam, all trace of humour gone. \"<em>Shit...\"</em></p>\n<p>(<em>Cue advert break... no? Oh. On with the story, then...)</em></p>\n<p> </p>\n<p></p>\n<p>[3] This is, unsurprisingly, the <em>only </em> kind of smiting there is.</p>\n<p>[4] The fact that Aziraphale was also of this opinion, but from <em>Heaven's </em>point of view, was beside the point. Everyone knew that those little <em>'share this if you support our cause' </em>messages irritated far more people than they helped.</p>\n<p>\n<em> </em>\n</p>\n<p>Castiel simply stood and watched the drama unfolding before him with a puzzled look of half-recognition on his face, brow wrinkled. Dean took a cautious step closer, brandishing the blessed blade. Crowley's wings flutttered nervously; yearning to open to the skies , but hemmed in by the boundaries of the circle.</p>\n<p>Suddenly there was a <em><strong>FLASH</strong></em> of white light and Aziraphale appeared, clad in a sky blue suit, his only concession to tartan a hankerchief in his breast pocket, brushing the dust off his shoulder. <em>\"Really,</em> Crowley,\" he started. \"They're just going to have to leave you alone for a while; I haven't managed to finish a meal wiith you for...\" he trailed off as he looked up from his ministrations and took in the tableau before him; Dean advancing on the captive demon with a knife, and Sammy and Castiel watching.</p>\n<p>The older angel took a deep breath in, his wings unfurling to span the cellar, pure white and radiant. Intense blue eyes filled with fury as Grace rolled off him in waves; a flaming sword appeared in one hand, which he levelled at Dean. \"Take one more step towards him,\" he challenged the hunter, voice soft and deadly. \"I <em>dare </em>you.\"</p>\n<p>Dean gulped, his face turning a rather unusual colour. He'd met angels before, of course, but never one such as Aziraphale; an <em>avenging </em>angel, filled with righteous fury. Needless to say, he started backing away carefully.</p>\n<p>Aziraphale waved a hand and the demon-killing knife vanished into the ether. He turned back towards Crowley, carefully slicing through the circle's sigils and miracling away the salt. He immediately reverted to his natural state of mother hen, taking Crowley's hands to inspect the damage. Oh, Crowley,\" he murmured, \"what have they <em>done </em>to you?\" He summoned up a little grace and soothed away the burns from the demon's hands and wings.</p>\n<p>Crowley sagged in relief, running a shaky hand through untidy hair. \"Thanks, angel,\" he replied, with an attempt at his usual crooked smile.</p>\n<p>Aziraphale smiled gently back at him. \"It's not a problem, dearest.\"</p>\n<p>Castiel blinked in surprise a something inside his head clicked into place. \"Aziraphale?\" he asked surpised.</p>\n<p>The older angel turned, face grim once more. \"Yes? What do you -- <em>Castiel?\" </em>he blurted in surprise.</p>\n<p>Dean frowned, glancing between both of the angels. \"Wait, you guys <em>know </em>each other?\" he asked, and was summarily ignored for his pains by both angels.</p>\n<p>\"Castiel, I know that things have been difficult these past few years,\" started Aziraphale, king of the understatement,\" but <em>really. </em>I can hardly believe you've stooped to torturing harmless Fallen.\"</p>\n<p>\"<em>Harmless?!\" </em>Sam shot back, skeptical. \"Demons are anything but harmless.\"</p>\n<p>\"Fallen Angel,\" Crowley corrected idly, far more relaxed than he had been five minutes ago. \"There'ssss a diference.\" he paused, miracling (anti-miracling?) up another of shades. \"And lets just say 'disinclined to harm you,' shall we?\" he settled back, leaning back against the cellar wall to enjoy the show.</p>\n<p>Castiel frowned, looking puzzled. \"Why do you choose to associate with one of the Fallen?\" he asked Aziraphale, who smiled.</p>\n<p>\"He's good company, and he knows some <em>excellent </em>restaurants. After six thousand years with nobody else to talk to, you tend to get on with someone rather well, to be frank.\" he glanced back at Crowley, laughter dancing merrily in his eyes. \"He's a much nicer person than he likes to make out, you know.\"</p>\n<p>\"Oh, <em>thankssss, </em>angel,\" he grumbled, embarassed. \"Shout it out to the whole world, why don't you?\" Sam sniggered, and Crowley stuck his forked tongue out at him.</p>\n<p>Castiel still looked confused. \"There is no Crowley mentioned in the records of the Fallen,\" he told them. </p>\n<p>Crowley coughed awkwardly. \"Well, I Fell a little <em>after </em>the whole thing with Luci, to be honest,\" he admitted. \"Never really liked him, the vicious sod. Seriously, talk about a freaking psychopath, that guy gives the word 'mental' a whole new meaning. I didn't so much <em>fall </em>as...\" he paused, searching for the words.</p>\n<p>\"Saunter vaguely downwards,\" Aziraphale supplied, smiling fondly.</p>\n<p>\"Yeah,\" Crowley agreed, brightening. \"And then I went and upstaged everyone else by inventing original sin barely five minutes later, he told them all smugly.</p>\n<p>Aziraphale rolled his eyes. \"The little serpent's alway's been rather proud of that one.\"</p>\n<p>Dean shifted uncomfortably. \"I think that what we have here is a case of mistaken identity,\" he admitted.</p>\n<p>\"What, you think so?\" Crowley asked in mock-surprise. \"Just who in Heav--Hel--<em>Earth's </em>name did you mistake me for, anyway?\" he demanded. \"That Holy Water bloody well hurt!\"</p>\n<p>The brothers looked at each other, then launched into a tirade against <em>their </em>Crowley.</p>\n<p>\"-Tricked us-\"<br>\n\"-The Colt-\"<br>\n\"-With Bobby-\"<br>\n<em>\"-Betrayed </em>Castiel when he-\"<br>\n<em>\"-Took over Hell-\"</em></p>\n<p>Aziraphale blinked as the verbal assault on the demon finished. \"Well,\" he announced eventually. \"He <em>does </em>seem like a rather nasty piece of work.\"</p>\n<p> There was another <em>pop, </em>and a second dark figure materialised in what we shall for the sake of narrative causality assume is an <em>absurdly </em>spacious cellar. Crowley the second smirked as he glanced around the place. \"Did somebody say my name?\" he asked.</p>\n<p>Of course they had ended up in a bar.</p>\n<p>Dean had had his reservations at first (read: sworn himself blue and point-blank refused to go), but he'd eventually agreed to go with them for two reasons. Firstly, the chance to get so completely drunk that this all made some sort of sense was a very attractive prospect; and secondly, Dean had seen Crowley 1.0's Bentley, and... well. Nobody with a car that nice could be <em>all </em>evil.</p>\n<p>Sam sipped at his pint, watching Crowley 2.0 over the rim of his glass. British beer was far stronger than the stuff you got back home, he reflected idly. The younger demon seemed really hyped up, like a girl just before a big date; he kept checking his hair every couple of minutes or so, fingers beating out a fast staccato rhythm as he fidgeted. Every so often he'd glance over at Crowley 1.0.</p>\n<p>Sam couldn't resist, grinning evilly, he nudged him (yes, today was officially the strangest day ever) and smirked. \"So,\" he began casually, \"This new guy... he's some kind of big deal? You know... Down There?\"</p>\n<p>\"Are you <em>kidding?!\" </em>The demon yelped, high pitched voice and all. He coughed, embarassed, and took a gulp of his drink. \"It's just... <em>the Serpent of Eden, </em>y'know? He basically <em>invented </em>the job I do. And he's good at it, too, always inventing new methods of spreading evil. Like Facebook. And those automatic checkout machines that never work. And I'm nearly certain he helped found the Republicans.\"</p>\n<p>Crowley smirked. \"So... yeah. He's a pretty big deal.\" He frowned into his glass. \"Well, to the Human Demons, anyway. The Fallen haven't any imagination whatsoever, on the whole. Still stuck in 2000BC, the lot of them.\"</p>\n<p>Sam raised an eyebrow. \"And you're the king of Hell,\" he pointed out. \"So go talk to him.\"</p>\n<p>Crowley rolled his eyes. \"I can see why they call you the smart one,\" he muttered, knocking back the rest of his Glennfiddich and sauntering towards the table Crowley 1.0 was sat at. He slipped into the seat opposite his counterpart.</p>\n<p>\"So,\" said Crowley 1.0, \"I believe you're the second version of me I've been hearing so much about.\"</p>\n<p>Crowley 2.0 mock-bowed, smirking. \"All of it bad, I hope?\" he joked.</p>\n<p>\"Admirably so.\" Crowley 1.0 told him. \"And apparently you've managed to take over Hell while I've been away, too.\" His eyes flickered gleefully with a kind of smug satisfaction. \"Have you gotten rid of Hastur yet? <em>Please</em> tell me you're demoting some of those unimaginative bastards to spit-turners. I mean <em>really,</em> craftmanship's all very well and good, chipping away at one soul for twenty years, but with seven billion people on the planet it just isn't <em>sensible.\"</em></p>\n<p>Crowley 2.0 nodded, smirking. \"Has-beens.\" He stuck out a hand. \"It seems I share a name with quite the legend; the serpent of eden.\" He whistled. \"That's quite the pedigree, I have to say.\" He grinned, raising his glass. \"To both Crowleys. And our <em>excellent </em>dress sense.\"</p>\n<p>Crowley the first took a sip of his drink, shuddering. \"God, angels have <em>no </em>sense of style at all. It's horrific.\" He paused. \"Though I didn't <em>particularly </em>enjoy being mistaken for you, to be frank.\"</p>\n<p>Crowley 2.0 winced. \"Ah. Yes. Uh... sorry about that?\" he tried.</p>\n<p>\"Not a problem, really. Certainly not as bad as what happened <em>last </em>Apocalypse, anyway.\"</p>\n<p>Crowley 2.0 straightened up a little, intrigued. \"So that <em>was </em>something to do with you, then? There were rumours among the upper circles of Hell, but that was all. Nothing concrete, anyway.\" he signalled to a waitress for another whisky. \"I certainly know a few demons who'd love to shake you by the hand for getting rid of that old dinosaur, Ligur.\"</p>\n<p> \"Yeah, I <em>was</em> involved, but I'm not sure exactly how much I helped.\" the older demon paused. \"You know, I could do with a contact in America,\" he said thoughtfully. \"Fancy an arrangement between our two countries? America's definitely where all the sin is at the moment - you've got gluttony down to an <em>art</em> form.\" he raised an eyebrow. \"And I have to say, well done for inventing the Krispy Kreme. That was a stroke of <em>genius</em>.\"</p>\n<p>Crowley 2.0 preened slightly, before he started nodding thoughtfully. \"I can imagine that this could be... beneficial...\" he agreed, sipping his second whisky slowly. \"To both sides, naturally. I've got a couple ideas for a new online service that could <em>really </em>tarnish peoples' souls.\"</p>\n<p>Crowley 1.0 grinned evilly over his vodka. \"Tell me more...\" </p>\n<p>Dean groaned into his beer. \"Look at them!\" He told the two angels. \"They're <em>plotting </em>together, look!\"</p>\n<p>Both angels dutifully looked at the two demons, who by now were both cackling into their drinks. \"Oh dear,\" sighed Aziraphale, \"He's going to have a <em>terrible </em>hangover in the morning, isn't he? He a nightmare to deal with when he's grumpy.\"</p>\n<p>\"But... they...\" Dean gaped at this blatant lack of worry from both of the angels for the future of all mankind, then gave up in favour of getting even more heroically drunk than before.</p>\n<p>Aziraphale stood, nodding to Castiel, as Crowley shook hands with his new business partner. \"And I believe that <em>that</em> is our cue to leave.\" he turned back to the other angel. \"It was lovely to catch up with you and your friends, Castiel.\" </p>\n<p>He moved over towards the demons' table, where he bent down to whisper something in his demon's ear. Crowley 1.0 nodded, standing up and saying something to the other Crowley, who nodded, snickering unashamedly. As they moved away, the slightly tipsy Aziraphale leaned over and kissed Crowley 1.0 gently; fairly drunk, the demon responded rather enthusiastically. And noisily.</p>\n<p>Castiel turned a rather funny colour at this display and wore an expression closely akin to that of a teenager whose parents just started flirting in front of the coolest kids in the school and isn't quite sure whether to ignore them or scream at them to stop it <em>now!</em></p>\n<p>Dean simply moaned into the bar, which was by now pressed closely to his face, and concentrated very hard on not passing out. Sam simply sniggered into his pint glass.</p>\n<p>As the two beings disappeared in a puff of grey smoke, the only sound they left behind was that of Crowley 2.0 laughing hysterically into the seventh scotch of the night. After he'd managed to calm himself, he looked over at three of them and started giggling madly again. \"Just you wait!\" he crowed in between chuckles. \"Just you <em>wait!\"</em></p>\n<p>Not long after, somewhere in Scotland, a satanist cult stared in confusion at the grey, transparent, smoky figure in the centre of their circle.</p>\n<p><em>\"Hello, and thank you for choosing Satan and Co. for today's temptation. We're afraid that our operative can't be with you just now, as he is very busy elsewhere. However,we will try to get back to you within the next millenium at least.</em> <em>We hope you'll choose us again for all your future attempts at achieveing damnation and unlimited power.</em></p>\n<p>\n<em>\"Please leave a message after the scream.\"</em>\n</p>\n<p> </p>\n<p> </p>"
}