{
  "id": "4581585",
  "url": "https://archiveofourown.org/works/4581585?view_full_work=true",
  "author": [
    "andavs",
    "rosepetals42"
  ],
  "title": "The Silent Fury",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale",
    "Scott McCall",
    "Talia Hale",
    "Laura Hale",
    "Cora Hale",
    "Isaac Lahey",
    "Erica Reyes",
    "Vernon Boyd",
    "Brett Talbot",
    "Sheriff Stilinski",
    "Melissa McCall"
  ],
  "additional_tags": [
    "How to Train Your Dragon AU",
    "Emissary Stiles Stilinski",
    "Magical Stiles Stilinski",
    "Werewolves",
    "Alive Hale Family"
  ],
  "language": "English",
  "series": "",
  "published": "2015-08-15",
  "completed": "2015-11-05",
  "words": "31,750",
  "chapters": "3/3",
  "comments": "495",
  "kudos": "9,561",
  "bookmarks": "2,628",
  "hits": "112,971",
  "summary": "<p>\n<em>Derek is about to leave, content with the smell of blood as proof that the Fury is dead when he hears it.</em>\n</p>\n<p>\n<em>A heartbeat.</em>\n</p>\n<p>\n<em>It’s faint and uneven and even with its help, it takes Derek a full minute of scanning the clearing before he finally spots the small heap that must be the human. It’s down on the far side of the canyon, almost completely hidden by a tall oak tree and–Derek jumps down before he thinks about it.</em>\n</p>\n<p>\n<em>He knows what he has to do. Furies are dangerous. Furies are fire and smoke and a funeral he barely remembers. He lands almost silently and makes sure his hands are fully shifted into claws and then slowly moves forward.</em>\n</p>\n<p>Or, a <b>How to Train Your Dragon AU</b></p>",
  "notes": "<p>Hello, and welcome to the first ever full-fledged <b>Puddle and Fish Collaboration!</b></p>\n<p> One day, both Leda and I watched HTTYD. And then we started talking about a possible HTTYD AU. And then we forgot to stop talking and suddenly I was writing and she was creating visual masterpieces and we both kept sharing more and more ideas and editing and now here we are. Three months later with a monster on our hands. We hope you like it!</p>\n<p align=\"center\">\n<img src=\"http://i.imgur.com/g7SjFOF.gif\"></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Thanks so much for reading! Next chapter will be up as soon as possible!</p>\n<p>Thank you so much for being so patient while you wait!</p>\n<p>As I'm sure you've noticed, we decided to combine the last two chapters into one SUPER chapter, so this is it!</p>\n<p>We hope you enjoy</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">more notes</a>.)\n</p>\n<p>We hope you enjoyed this Puddle and Fish Collab!</p>\n<p>Come check us both out on tumblr (petals42 and andavs) for more sterek, fic, and fun!</p>\n<p>Thank you very much for reading!</p>\n<p>Oh, also as you may know, andavs and I are currently trying to work on a little <a href=\"https://petals42.tumblr.com/post/116529238464/the-not-quite-normal-but-still-totally-awesome-otp\" rel=\"nofollow\">Not Quite Normal OTP Challenge.</a> We have decided that this counts as #25 (AU of your Favorite Animated Movie!).</p>\n<p>To read/view the rest of these challenges, or to see all the other madness we get up to, you can find us both at <a href=\"https://andavs.tumblr.com/\" rel=\"nofollow\">andavs</a> and <a href=\"https://petals42.tumblr.com/\" rel=\"nofollow\">petals42</a>on tumblr!</p>",
  "text": "<p>\n<strong>Chapter 1</strong>\n</p>\n<p> </p>\n<p>The howl rises at dusk.</p>\n<p>It is almost dark, later than they usually come, late enough that everyone’s eyes are shifted, though they haven’t yet lit the lamps in the house. It is also the end of the raiding season, almost cool enough that the attacks stop, so there is a beat of surprise around the table. At least, Cora pauses with her fork halfway to her mouth, Laura cocks her head to the side, and Derek knocks a glass of water over as his arm jerks. Only his mother rolls smoothly to her feet, eyes already pointing somewhere in the distance.</p>\n<p>Laura recovers next, shoving her seat back and dashing outside before his mother even says anything.</p>\n<p>“It’s from the west,” his mother tells him. “Derek, stay here with Cora. No wandering outside.”</p>\n<p>Then she’s gone as well.</p>\n<p>Derek feels a familiar blush come over his face. Because he’s nearly eighteen. He knows he’s supposed to be a fighter like all the other werewolves his age. But he’s not good at it. He knows that. He is big enough and strong enough and his mom taught him all the basics, same as Laura, but he just… fighting isn’t natural to him. He knows all the moves but can never put them together. He doesn’t like it. He’s not good at it.</p>\n<p>And it’s not a secret. The entire pack knows about his disgrace. Not even just his pack. The entire allegiance of Hales and Itos and Sorensens know. He’s Derek Hale, the only Hale son, who can’t fight. Who doesn't seem to want to.</p>\n<p>Training is due to start in just a few days and his mom hasn’t even mentioned it. No one has.</p>\n<p>So when his mother tells him to “stay here with Cora,” what she means is “you stay inside and safe.”</p>\n<p>And when she says “No wandering outside,” he knows she’s actually talking to Cora. Cora is the one who is only fourteen and already trying to get Talia to abuse her Alpha powers and let her start training early.</p>\n<p>So, technically, his job of watching over Cora is important. He can’t let her get killed – or worse, snatched – just because she’s impulsive and thinks she’s invincible.</p>\n<p>It’s still embarrassing, though. He wants to like fighting and killing and protecting their people from the humans that raid and kill his people, he just… he just doesn’t. He just-</p>\n<p>“C’mon,” Cora says, almost the moment the door shuts behind their mother. She’s already moving towards the back. “Let’s go!”</p>\n<p>“No,” Derek replies, rising and following her. “Cora, stop. Mom said-”</p>\n<p>“Mom will never find out,” Cora replies. “We’re not going to fight – not that you can anyway – we’re just going to look.”</p>\n<p>It’s a bad idea. He knows it’s a bad idea. But she’s already halfway out the back door and he can’t think of a way to stop her that doesn’t involve physical restraint and to do that would mean he’d have to catch her first and she’s-</p>\n<p>She takes off into the woods and he follows. He has to keep her safe.</p>\n<p>He tells himself that repeatedly as they venture further and further from the village. Because Cora might think she's brave enough to fight humans but being caught disobeying their mother was a different thing entirely. So she leads them on a wide loop towards the west, careful to duck behind trees as other werewolves rush towards the sighting. Or at least, she remains hidden until they are deep enough in the woods that there are no more werewolves to spot them. Unfortunately, that just means she starts moving even more quickly and he’s so focused on following her through the darkness that he completely misses it when there is suddenly a flurry of movement from above them.</p>\n<p>The human is on them in a heartbeat.</p>\n<p>There’s a burst of bright light that blinds Derek temporarily and Cora screams and-</p>\n<p>It’s mostly luck. Cora shrieks as it grabs her, throwing her head back to howl for their mother, knocking it in the face as she does. Its grip on her doesn’t loosen but it gives Derek enough time to blink vision back into his eyes and, well, that’s when he sees them.</p>\n<p>The tattoos.</p>\n<p>Everyone knows that humans have tattoos, though mostly they are just dark bands wrapped around their arms that you can only see once you’ve stripped them of their armor. There’s a few differences, a few unique designs that werewolves don’t bother identifying but…</p>\n<p>But all werewolves know these ones.</p>\n<p>The dark, swirling pattern wraps around the human’s wrist and hand and Derek focuses his vision, hoping that somehow he’s seeing things wrong and the corresponding pattern won’t be on the human’s neck.</p>\n<p>It’s there.</p>\n<p>It’s a Fury.</p>\n<p>Something in Derek’s stomach turns to ice. Because all humans are dangerous. They use the cover of night to attack and kill without mercy or simply grab younger werewolves and drag them off and the first rule of fighting a human is to always be prepared for the multitude of weapons and herbs that they have on them at all times.</p>\n<p>But of all the humans, a Fury is the most dangerous.</p>\n<p>They’re recognizable by the tattoos on their hands and neck, but none have ever been killed. Or captured.</p>\n<p>And they are known for killing werewolves rather than snatching them. And sometimes those that are taken are able to escape or the pack is able to track them down, but… you can’t track someone when they are dead. When they’ve been burned and-</p>\n<p>He moves before he really lets himself think about how impossible this is. Cora is still yelling and the Fury is still trying to drag her backwards into the woods and the air is thickening as if there’s another trick he’s about to pull and Derek moves.</p>\n<p>It lacks any true finesse of a fighter. He simply lunges and feels his claws sink into flesh.</p>\n<p>There’s a tingling – almost a burn – and it occurs to him that the Fury is fighting back even as Derek’s claws are inside him, but luckily Cora takes advantage of the Fury’s momentary distraction to shove an elbow into his stomach (that’s a trick she has learned from Laura).</p>\n<p>The Fury yelps and lets go and, for once, Derek doesn’t hesitate. He steps forward and grabs and then throws with all his strength because the thing is not hurting Cora and-</p>\n<p>Dimly, he hears a crash and maybe a crack but the point is that it’s far away. It’s gone. Cora’s safe.</p>\n<p>“Cora,” he says, panting a little. He knew the fight must have only been a few moments, but it seemed longer. “Are you okay?”</p>\n<p>“Ye-yeah,” she says, looking over at him. She looks pale. Pale and scared. He doesn’t blame her. “Is it dead?”</p>\n<p>“Yes,” Derek says. He’s probably not lying. His hand is covered in blood and the crack that he heard was probably the sound of its head hitting a tree. Or the ground. It’s probably dead.</p>\n<p>“I- Derek you killed a human,” Cora says it with a touch of awe. Derek nods. He’s just glad she seems unaware that it was actually a Fury. Good. He doesn’t want her to be more freaked out that she already is. “It just- it just came out of nowhere and you- you <em>saved</em> me.”</p>\n<p>“Let’s go home.” He says instead of answering her statement. “Mom’s going to kill us if she finds out we were out here.”</p>\n<p>Cora nods wordlessly and they turn for home.</p>\n<p>Derek glances to woods as they leave, idly taking note of where they are.</p>\n<p>The Fury is dead. It has to be.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>For all intents and purposes, the raid is a success for the werewolves. No one was killed or taken and they had managed to capture three of the humans, which will now be used for training purposes. People are practically giddy the next day. Everyone grins broadly as they pass each other in the streets and children are reenacting the bits of battle they’d heard about and-</p>\n<p>And Derek finds an excuse just after midday, after helping fix a fence damaged in the attack, to sneak into the woods. Because he’s positive the Fury must be dead, he is, he just… he still has to check.</p>\n<p>Luckily, he is known for being quiet and for wandering away without explanation sometimes. No one thinks to question where he is going.</p>\n<p>He finds the spot where he and Cora had been attacked easily enough, the smell of fear and desperation still lingering in the air and the splash of blood against a tree an easy sign. He shifts, enhancing his senses further and then follows the trajectory that he thinks he threw the human.</p>\n<p>His instinct leads him even further away from the village to the edge of a canyon. The drop is steep and the area itself isn’t big – a small spring of water, a patch of trees, and not much else, and, as a werewolf, he could jump down without breaking anything, but he’d have to climb up. There’s no way a human survived falling into this. No way.</p>\n<p>Derek is about to leave, content with the smell of blood as proof that the Fury is dead when he hears it.</p>\n<p>A heartbeat.</p>\n<p>It’s faint and uneven and even with its help, it takes Derek a full minute of scanning the clearing before he finally spots the small heap that must be the human. It’s down on the far side of the canyon, almost completely hidden by a tall oak tree and- Derek jumps down before he thinks about it.</p>\n<p>He knows what he has to do. Furies are <em>dangerous</em>.  Furies are fire and smoke and a funeral he barely remembers. He lands almost silently and makes sure his hands are fully shifted into claws and then slowly moves forward.</p>\n<p>The Fury’s heartbeat doesn’t change. It doesn’t know he’s here.</p>\n<p>Derek moves less cautiously as he comes closer and it’s then that he sees the reason the Fury doesn’t mind his presence. It’s asleep. Well, unconscious is the better word. It’s  partly on its side, sprawled under the tree that must have finally stopped its movement, half covered in twigs and branches that haven’t yet lost their leafs.</p>\n<p>He waits a few more heartbeats, then he goes and finally gets a good look at it. Perhaps the first real look any werewolf has ever gotten of a Fury.</p>\n<p>It’s…</p>\n<p>It’s young is the first thing Derek realizes. In his head, all humans are old and grizzled, muscled and scarred from years of attacking and killing werewolves. Their skin is thick and leathery from the sun and marked with tattoos that only make them look more nightmarish but this one…</p>\n<p>This one looks younger than even Derek. It’s hair is strange – cropped fairly shot in the middle, but then practically shaved on the sides. It doesn’t even have facial hair yet, the only marks on its face a few dark dots that form a pattern up his jawline and it’s- his? – skin is more red than tan, his nose slightly upturned, eyelashes dark and thick where they rest against its cheek.</p>\n<p>It doesn’t stir, even as Derek bends down so they are less than a foot apart. Derek shouldn’t be surprised. Its face is bruised and there’s a trail of blood that runs from his hairline down the left side of his face and neck. One sleeve of its armor and shirt is torn off at the elbow, leaving its forearm scraped and exposed. That’s not even taking into account its leg, which, even covered by its pants and hidden by branches, is obviously mangled.</p>\n<p>It looks… it looks like a werewolf. An unshifted werewolf, but still…</p>\n<p>It doesn’t look different. It could be Laura or Cora, a perfectly peaceful unshifted wolf.</p>\n<p>Except for the tattoos.</p>\n<p>They are even more visible in the daylight, dark black lines that stand out starkly against its pale skin. The ones that wrap around his hand and wrist look like nothing more than intricate patterns, thick and dark lines wrapping around themselves in way that’s almost beautiful. It must have taken hours to complete.</p>\n<p>But the one on its neck is even more distinctive. Derek has never seen one before, has only ever heard them described broadly, as maybe some kind of animal, but this close, he can see it’s not just any animal, it’s a <em>wolf</em>.</p>\n<p>The wolf’s mouth is open in a snarl, tongue sticking out grotesquely, its eyes angry and ears pressed almost flat against its head.</p>\n<p>It looks evil. And it reminds Derek what he has to do.</p>\n<p>He’s shifted back into his base form, he realizes, too curious and relaxed to bother maintaining his beta shift.</p>\n<p>But he focuses now. Focuses and sets his claws against the Fury’s neck and the thing must almost be dead anyway, because it doesn’t even twitch at the feel of claws at its jugular and he should do it.</p>\n<p>He should slash across its flesh and across the howling wolf that the Fury wears like a badge of honor and he should stop looking at its face and focusing on its racing heartbeat and the fact that its skin is cold beneath his hand and there is pain bubbling right under the surface. He’s never thought about taking pain from a human before, never considered the fact that if he can do it with other werewolves and animals, then he can help humans too because that’s ridiculous, humans are <em>evil</em> and-</p>\n<p>He growls low in his throat. He has to do this. He has to keep the pack safe. He has to-</p>\n<p>He can’t.</p>\n<p>He pushes away roughly and the Fury falls even further to the side but doesn’t wake.</p>\n<p>It’s so weak, he assures himself. It’s going to die whether or not Derek kills it. It’s weak and injured and alone and it probably won’t ever wake up.</p>\n<p>It will die and Derek won’t have to kill it.</p>\n<p>He clings to that thought as he turns and runs, climbing up the wall of the valley in three easy bounds.</p>\n<p>He forces himself not to look back.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>The next morning, he returns and the Fury is not dead.</p>\n<p>He -it - is a few paces from where he was the day before and it isn’t moving now but it’s obvious it was trying to head for water. It’s equally obvious it had failed. The stains of blood smeared into the ground don’t reach to the spring and one hand is stretched towards the pool of blue but the Fury is passed out again, unmoving, and Derek would think it is finally dead except for the same faint heartbeat.</p>\n<p><em>A fighter</em>, Derek thinks to himself. <em>Stubborn.</em></p>\n<p>Not that it matters. Everything dies if it can’t get to water and the Fury had barely made it three feet. It’s not even halfway.</p>\n<p>He leaves without bothering to jump down and take a closer look.</p>\n<p>*^*^*^</p>\n<p> </p>\n<p>Two hours later, he’s back. He doesn’t know why.</p>\n<p>He’d gone back to the village only to find that Cora had decided that Derek’s first kill was worth possibly getting in trouble for disobeying their mother. He had gone back to find himself something of a hero, people slapping him on the back and congratulating him on a job well done, and then his mother sat him down and told him that she hadn’t thought he had it in him, but now he <em>can</em> start training with the other teenagers as winter falls and-</p>\n<p>And he would love to say that he comes back to finish the job, to get the kill that everyone thinks he already has, but that would be a lie.</p>\n<p>Derek comes back to do the opposite.</p>\n<p>Derek still jumps down without thinking about it and it’s only as he lands with a slight <em>thump</em> that he realizes something is different.</p>\n<p>The Fury is awake.</p>\n<p>He- <em>It</em> yelps as Derek straightens and Derek shifts instinctively, although it’s obvious that the Fury can’t take him. From the look of it, it hasn’t even managed to make it to the water yet.</p>\n<p>Derek doesn’t move closer but the Fury drags itself away as if he had. It only manages to slide back a foot before curling forward to clutch its leg, gasping for breath. Derek takes a slow step forward. The Fury grits his teeth and drags himself backwards more quickly this time, only stopping when his back runs into a tree.</p>\n<p align=\"center\">\n<img src=\"http://i.imgur.com/0QQzqPC.jpg\" alt width=\"1000\" height=\"590\">\n</p>\n<p>“Don’t,” the thing groans and Derek pauses only because it’s a shock. He knows humans can talk, knows that they keep them separated when captured for training for that very reason, but in battle they rely on whistling signals that sound like birds if you don’t know what to listen for and he’d always assumed that they just… didn’t. Or that if they did, he wouldn’t be able to understand. “G-get away from me.”</p>\n<p>The Fury puts up one hand as Derek continues coming closer and it’s probably supposed to be threatening but all that happens is a few sparks come out of the center of his palm. It sags immediately after as if that had taken more effort than it looked like.</p>\n<p>Derek doesn’t exactly feel worried. He keeps walking. Slowly but steadily, ignoring the angry glare that the Fury gives him even as it coughs, and groans, and then tries to raise his hand again only to drop it a moment later.</p>\n<p>“Stay the fuck away,” it pulls itself back a little bit, dragging the back of its skull along the tree as if its neck isn’t strong enough to stay upright. “Fucking- just leave me alone and I won’t-”</p>\n<p>Its heart is beating too fast now. Fast enough that Derek can barely distinguish between heartbeats. It – he? – is sweating and there is still a trail of blood coming from his leg and-</p>\n<p>Derek would say something if it wasn’t so hard to talk while shifted. And for all that he is fairly certain the Fury is too weak to hurt him, he isn’t about to risk letting his guard down. So, he merely ignores all the half-formed curses and snarls that the Fury throws at him and keeps moving.</p>\n<p>When he bends down, he’s almost not surprised to find that the Fury’s right hand has been curled around a knife this whole time. It comes flying at his face with more speed then he would have thought possible, but he catches it easily. He doesn’t mean to squeeze it’s wrist hard but he applies pressure until the knife falls to the ground between them. To be safe, he grabs it and shoves it in his pocket.</p>\n<p>The Fury sags as if that was his last option and he knows it.</p>\n<p>“It’s okay,” Derek tries around his fangs as he reaches for the Fury.</p>\n<p>“Fuck. You.”</p>\n<p>If the human in front of him is scared, he’s not showing it. His jaw is clenched and his glare never falters, even as his eyes flick to Derek’s claws for a heartbeat before returning to his face.</p>\n<p>Then Derek reaches for his neck, purely because that’s the easiest chunk of skin to get to, and whatever peace the human had made with death evaporates.</p>\n<p>“No,” he gasps, reaching up to push feebly against Derek’s wrist. “Please, don’- there’s nothin’ <em>left</em>.”</p>\n<p>Derek feels a flash of guilt that he ignores the human’s pleas to stop but clearly the pain is getting to him because he’s not exactly making sense so Derek can’t be blamed. His skin is clammy under Derek’s hand and Derek shifts back into base-form the moment he starts drawing pain because-</p>\n<p>Well, because it knocks him out of shifted-form the moment he starts taking it. There’s too much but he forces himself to focus and-</p>\n<p>Most of it is coming from his leg.</p>\n<p>“What’re’ou… doin’?” the human slurs, head dipping towards Derek as all his muscles relax.</p>\n<p>“Helping,” Derek supplies and then leaves it at that.</p>\n<p>Because, honestly, he’s not sure. This is… this is <em>wrong</em>. Derek is a werewolf, a werewolf whose mother is the Alpha of one of the three Packs that make up the alliance and he is out here, in the middle of the day, when he should be helping his Pack, taking care of a <em>human</em>.</p>\n<p>Not even a regular human. A Fury. The dangerous, ruthless, <em>killer</em> type of human. The same kind of human that ignored the fighting to sneak through the village and get to his house and lite it up even though-</p>\n<p>He shakes his head.</p>\n<p>He can't look too deeply into it. It’s bad enough that in his head, he is already referring to the Fury as a “he” rather than an “it.” Humans are supposed to be “its.” They’re monsters. Less than animals. Less than-</p>\n<p>The human’s eyes slide shut and Derek takes that as a sign that he’s taken enough pain for now.</p>\n<p>He stretches the Fury out, shifting him until only his head is resting on the root of the tree, and then moves down to the leg.</p>\n<p>He sees instantly why it isn’t healing. The break is high, almost at the knee and bone isn’t quite breaking the skin, but it’s close. It seems to be just one break, but the two parts aren’t close enough to knit back together. There’s only one way to get them close enough and Derek isn’t sure when he had decided to <em>nurse the Fury back to health</em> but-</p>\n<p>He takes a deep breath, pulls in as much pain as he can, and snaps the bone back in place.</p>\n<p>The Fury wakes up with a scream.</p>\n<p>Derek lunges for his mouth, terrified that someone will hear the sounds of agony but as quickly as started, it’s over. The human is breathing harshly, groaning around clamped teeth, and tears are streaming out from under closed eyes, down the side of his face, but he’s not yelling.</p>\n<p>“Sorry, sorry, sorry,” Derek mutters. “Had to do it. It will heal now.” The sound of his voice just makes the human flinch. He shuts up. The break was a bad one. Even now that the bone is back in place, it will still take a couple hours to heal completely.</p>\n<p>Maybe more. It looks like the side of the Fury’s face still hasn’t healed over and it has been almost two full days since the attack. There must have been internal damage that took priority over his smaller injuries. Or his body had been too desperate to heal his leg.</p>\n<p>Or he was too weak from dehydration.</p>\n<p>Derek reaches for his canteen, scooting forward so that he can lift the human’s head and press the bottle to his mouth. Unsurprisingly, the Fury turns his head away at first but the moment the water actually touches his lips, he starts gulping quickly enough that Derek has to pull the bottle away to keep him from choking.</p>\n<p>He breathes a sigh of relief when the human appears to be too far gone to really realize what’s happening. They repeat the process a few times, pausing only when the human has to cough and stopping when he passes out again.</p>\n<p>Derek doesn’t really know what he’s doing, but he forms a rough kind of pillow out of leaves and re-fills the canteen at the spring. Then he places that next to the Fury.</p>\n<p>Hopefully the human will be healed and gone by the next day. Hopefully he will go back to where he came from and he won’t remember any of this and Derek won’t have to worry about this anymore.</p>\n<p>The human is evil and Derek just wants-</p>\n<p>He wants things to go back to normal</p>\n<p>He stands to leave and then realizes he still has the human’s knife in his pocket.</p>\n<p>After a beat of hesitation, he puts it next to the canteen.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>Stiles comes to slowly. Too slowly. He must spend about ten minutes willing himself to wake up completely, screaming internally that he needs to get moving and check the surrounding area and find Scott and get to water and it still takes him too long.</p>\n<p>When he finally gets his eyes open, it’s dark out. He blinks up into the night for a bit, forcing his mind to remember the events that led him here. There was his attempt to grab what looked like a young werewolf, only to find she wasn’t alone (<em>stupid, should have checked, should have been more careful</em>), and then there was… There’s a gap. A gap in his memory and that should scare him, because everyone knows (and he knows better than most) that if the weres get bored of draining your magic, or if you struggle too much, or get mouthy, then they go ahead and take some memories too.</p>\n<p>But in this case he’s pretty sure it’s just a head injury. Probably the same thing that ruined his leg.</p>\n<p>He tells himself that firmly but his heart starts beating a little faster anyway.</p>\n<p>(They already took too much from him. He barely remembers her and Scott filled him in on all the stories a thousand times but he doesn’t, he can’t-)</p>\n<p>He groans as a headache suddenly bursts to life across his temples. Groans and then breathes because he has to-</p>\n<p>He has to get out of here.</p>\n<p>He can’t die. He has to find Scott and they have to get back to his Dad and Melissa and-</p>\n<p>He can’t let them starve. Not another. Not his Dad. Not Melissa.</p>\n<p>He has to move. He struggles to sit up, needing no reminder that his leg is broken because the stupid thing is still throbbing. His mouth is dry, although he has faint memories of drinking water. Of a werewolf <em>helping</em> him drink water.</p>\n<p>He knows what that means. He has to get out of here.</p>\n<p>The moon is almost full and it will have to provide enough light for him because he knows without checking that his magic is still tapped out. Which either means the werewolf from before sucked him dry again or he had never rejuvenated enough in the first place.</p>\n<p>He suspects the latter. He had been drained five days before the raid, which meant that even during the fight, he was only operating at half-capacity. And then there was the blast of light to distract the small werewolf and the attempt to burn the other while being stabbed and the pitiful excuse for fire-</p>\n<p>If the werewolf actually tried to drain him, well, it wasn’t like there was any magic left for him to get. He shouldn’t, but Stiles gets a sick sense of satisfaction at that.</p>\n<p>Only briefly though. Because Stiles knows what happens to emissaries captured by other packs. They are allowed to recover and then drained. Fully. To death. After all their memories are stolen and sorted for clues.</p>\n<p>There’s a canteen at his side, full, and Stiles only hesitates for a second before opening it and chugging as much as he can. Dying isn’t an option. He doesn’t know where he is but he can figure it out and his leg <em>hurts</em> but it doesn’t seem to be as bad as he remembers it and he-</p>\n<p>As he puts the canteen back down, feeling slightly nauseous, it clinks against something.</p>\n<p>His knife.</p>\n<p>The werewolf had given him his knife back.</p>\n<p>For the first time since waking up, Stiles is truly surprised. Doubtless, all the wolfsbane has come off so it’s not poisonous anymore, but he’d carved the runes in it himself and he’s sure it can still do damage to werewolves. It should have been taken from him.</p>\n<p>Maybe the werewolf didn’t know. Didn’t bother looking closely enough that engravings etched into the side or didn’t realize that they mean any wound it inflicts won’t heal instantly.</p>\n<p>That’s his mistake. The second Stiles gets enough magic, he can project this knife into the wolf’s throat.</p>\n<p>He’d been practicing his aim with Scott. When he managed to get enough magic that he could actually do it without Deucalion noticing he was lower than he should be.</p>\n<p>Not that he would be sticking around that long. He shakes his head, he doesn’t know why he has the sense he’s trapped. His leg is mangled but it can’t be that bad and he can crawl and yet he still-</p>\n<p>A canyon.</p>\n<p>He goes still and squints into the darkness, part of the gap filling itself in.</p>\n<p>He fell – was thrown? – into a gully of some type.</p>\n<p>He’s trapped. He can’t get out. Not until his leg heals at least a little.</p>\n<p>Something in his stomach sinks and his clutches his knife tighter and decides he can’t deal with this just yet.</p>\n<p>It’s entirely too easy to fall into darkness once more.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>The next morning, training starts and the only word Derek can think to describe it is bizarre.</p>\n<p>It’s bizarre because he is something of a celebrity at the moment or at least Cora has made his fight with the human (thank the gods she didn’t realize it was a Fury) seem dramatic enough that people won’t stop talking about it. So when he arrives at the training with the five other young werewolves, there’s more than a few looks. And, for once, they aren’t pitying looks.</p>\n<p>It should make him feel better, but it doesn’t. Because the entire opening speech is about how humans are ruthless monsters that have been attacking werewolf packs for generations and how they are callous enough that the bands tattooed around their arms signal the number of kills or captures they have and how it is the duty of all werewolves to destroy them on sight and-</p>\n<p>And all Derek can think about is how <em>young</em> the Fury looked and how scared he was when he scrambled away from Derek and how desperate his voice was when he told him to stay away, when he told him there was nothing left (whatever that means).</p>\n<p>He keeps his face neutral and tries to tell himself that it was a special case, that the Fury was <em>injured</em> and, really, werewolves kill in battle but they don’t track down injured humans and kill them in cold-blood. Any other werewolf would have made the same decision. And the Fury is probably gone by now but if not, maybe they could learn something by studying him or asking questions or-</p>\n<p>“What is the number one strategy when fighting humans?” Satomi snaps. Derek blinks and straightens. The speech is clearly over and, according to the laws of the Alliance, all Alphas are to be treated with the same respect as your own.</p>\n<p>“Aim to kill,” Erica pipes up.</p>\n<p>Satomi shakes her head. “That’s not strategy,” she says. “That’s just a fact. I want to know <em>how</em> you are going to fight them.”</p>\n<p>“Use our superior strength?” Isaac asks.</p>\n<p>“Not bad. But not the number one rule.”</p>\n<p>There a few heartbeats of silence. When Derek glances around at the other werewolves, he sees that most of them have given up. Erica is looking a little annoyed that her aim to kill plan wasn’t the right answer.</p>\n<p>“Look up?” Derek finally asks, just to break the silence. Satomi is known for her patience. They could be there all day otherwise.</p>\n<p>He’s sure it’s wrong but the Fury had definitely dropped from <em>above</em> them so-</p>\n<p>“Exactly,” Satomi says. She is the oldest of the three Alphas, and not one for outward displays of happiness, but her mouth quirks up for a moment. “Now, we know that humans are not as strong as us, but they are aware of this themselves. Which means they have found ways to adapt, the biggest being their reliance on surprise and tricks, the most basic of which is utilizing their surroundings, particularly the trees…”</p>\n<p>She continues and Derek keeps his eyes on her. Partly because it’s polite and Satomi will doubtless report to his mother how he is doing, partly to avoid the half-shocked, half-jealous looks of his fellow trainees.</p>\n<p>Mostly, though, mostly so that he can make it seem like he is still listening even as he wonders if the Fury will still be there when he gets back to the gully.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>Derek almost doesn’t go. Satomi’s idea of initial training is cardio so his afternoon had been spent running almost nonstop and then dinner is a forced recap of the running that is almost as exhausting as the running itself and-</p>\n<p>He tells himself a thousand times that the Fury must be gone by now but as dusk falls, he packs up a second meal (he has a feeling he’s going to be hungry again later even though usually werewolves are just fine on one meal a day) and heads out.</p>\n<p>“Just like your father,” his mother says as he nods his goodbye. Her smile has gone soft and sad. “He always needed his alone time too.”</p>\n<p>Derek nods silently because he doesn’t exactly remember much about his father and then seriously considers staying because he is going to maybe help the same kind of thing that <em>killed</em> his father, but…</p>\n<p>He’s only going to make sure the thing is gone.</p>\n<p>It’s not.</p>\n<p>Derek frowns as he looks down into the canyon. The Fury is awake now, sitting by the spring, armor in a pile next to him, chest stripped bare. Derek watches as he reaches a wad of clothing that must be his shirt into the pool of water and then shoves it with a hiss onto his stomach.</p>\n<p>Where Derek stabbed him with his claws just a few nights ago. Still not healed.</p>\n<p>He takes a step closer to the edge of the canyon. The movement draws the Fury’s attention. Derek isn’t close enough to hear his heartbeat, but his eyes land on Derek’s and his chest rises as he takes a deep breath.</p>\n<p>Derek wishes he knew what he was doing but he jumps down anyway. To simply stare from above seems rude. And he is already in too deep. He can’t just let the Fury die on him now. Not when Derek already saved him.</p>\n<p>The human doesn’t say anything as he walks closer. Just glares at him, and clutches the shirt to his side. Up close, he is lean but muscular, more than a few scars littering the expanse of his skin. And without his shirt, Derek can see that the tattoo on his neck and hands are actually connected. The head of the wolf flows into a body which sits on his shoulder, two of the paws across his collarbone, the back two on his upper bicep. All the curved lines that loop around his arm down to his hands are actually the tail.</p>\n<p>The other arm is bare. No bars. Derek finds that reassuring. The Fury might have been attacking his village but he hadn’t killed anyone yet. Maybe this had been his very first mission.</p>\n<p>That’s good. That makes it so Derek didn’t save a killer. He saved someone… well, not innocent. It had been grabbing Cora but at least he’s not a killer. Any other werewolf would have done the same.</p>\n<p>Derek blinks and tells himself to stop staring.</p>\n<p>The human’s heart isn’t beating as quickly as it had been before but it’s still not steady. Derek makes sure both of his hands are up. Last time, even though he was dehydrated and half-passed out, the Fury had managed to shoot a little fire from his hands. And try to stab him. Derek isn’t taking any chances.</p>\n<p>“You here to kill me?” the human asks, gritting his teeth and sitting up a little straighter. It almost sounds like a taunt.</p>\n<p>“No,” Derek replies. The Fury looks at him steadily for a moment. Satomi had told them that human hearing wasn’t as advanced as werewolves, that they didn’t think humans could even hear heartbeats, wouldn’t be able to tell if you lied to them, but it seems like the Fury is checking for something.</p>\n<p>After a beat, he… well, he doesn’t relax exactly but some of the tension goes out of his body. He allows himself to sag back once more. At least, he does after he reaches for his knife again and rams it into the ground so it’s within easy reach.</p>\n<p>“Okay,” he says and then looks back at his stomach, peeling back his shirt to poke at the half-closed wounds.</p>\n<p>“You’re still …” he starts, eyes flickering down to the Fury’s chest again. The human looks up at him. Saying “injured” seems rude. Derek clears his throat and changes the word. “Here. You’re still here.”</p>\n<p>The Fury glares at him. “How would I be gone already? You stabbed me. And broke my leg.”</p>\n<p>“Yeah, but,” Derek tries. “That was three days ago.”</p>\n<p>Even the deepest wound should have been healed by now. Unless there was wolfsbane along the blade but it’s not like Derek had rubbed his claws in wolfsbane. Only humans used those kinds of tactics.</p>\n<p>The Fury’s eyes squint in judgment.</p>\n<p>“Yeah, so?”</p>\n<p>“Well, shouldn’t you be healed?” Derek asks. It comes out a little bit growly. He doesn’t need this humans’ judgment. He needs him to be gone and out of Derek’s mind.</p>\n<p>“Can’t use my own magic on myself, dude,” the Fury says, frowning down at his gut again. “Unless… can your emissaries do that? Did they figure out a way?”</p>\n<p>Derek blinks. He has no idea what this kid talking about. Emissaries? The kid looks back up at him, almost eager.</p>\n<p>“No,” Derek says, feeling something twist in his gut as the human’s face falls. “No, I mean, we don’t have emi-”</p>\n<p>“Right,” the Fury cuts in as Derek hesitates over the unfamiliar word. For no reason, his heart has started beating faster again. “Right, you guys don’t keep things like me around.”</p>\n<p>His mouth twists but he doesn’t sound too upset or surprised. Derek frowns. If emissaries are Furies then it’s not like werewolves would want them nearby. They literally spend their whole life training to <em>kill werewolves</em>. And everyone knows that Furies are the most ruthless, that they can create a ring of Mountain Ash with a wave of their hand around a werewolf and hold it in place while other humans cross the line and-</p>\n<p>That’s not even counting the fire.</p>\n<p>“But, you’re keeping me around at least for a little bit, right?” the Fury asks. He doesn’t seem surprised by that either. Or grateful. God, if Derek’s mom found out about this- “I’m no good to anyone like this.”</p>\n<p>For some reason, he waves a hand at his neck rather than his leg but maybe that’s a human thing.</p>\n<p>At a loss for what else to do, Derek nods.</p>\n<p>“Great!” the Fury says, grinning sarcastically. “Then I assume you’re going to feed me?”</p>\n<p>“Uh,” Derek says. He thought the Fury would be gone by now. But he did bring a bag full of extra food so, “Yeah. Here.”</p>\n<p>The Fury’s hand curls around his knife again as Derek approaches, holding the bag out in front of him. In a heartbeat, it is snatched away and Derek skips back a few steps. Then watches as the human opens the bag and stuffs a huge bite of bread in his mouth.</p>\n<p>Well, that makes sense. It has been three days. At least.</p>\n<p>“I’m Derek,” Derek offers after a minute. The Fury pauses in chewing to look at him. Derek doesn’t know why he feels that he just made a fool of himself but he does.</p>\n<p>“And you want me to call you…?” The Fury says after swallowing. His voice is hard again, playful only on the surface. “Let me guess- ‘my lord and master’?”</p>\n<p>“What- no,” Derek says, frowning. “I just told you. My name is Derek.”</p>\n<p>The Fury looks at him as if he’s not quite right in the head. Doesn’t respond aside from twitching one shoulder up in what could be acceptance. Goes back to eating.</p>\n<p>“And you are?” Derek finally prompts, timing his question for when the Fury has finished the loaf of bread and not yet found the strips of jerky at the bottom of the bag. He’ll have to bring more food next time. The human looks thin to the point of sickly.</p>\n<p>His question earns him another mistrustful glare.</p>\n<p>“Stiles,” The Fury finally says. “If we’re using names. I prefer ‘annoying shithead’ if you’re planning on derogatory terms.\"</p>\n<p>Derek frowns at his tone. Half challenge, half casual acceptance.</p>\n<p>“But, you’re the wolf with the food,” the human- Stiles – says, waving a piece of jerky in the air for a moment before biting it and continuing with his mouth full. “So what you say goes, boss.”</p>\n<p>“Derek,” Derek corrects. He still feels like he is being mocked somehow. He needs to get this human out of here. “How long will this take?” He waves a hand in the Fury’s general direction, trying to encapsulate both the time necessary for his leg and his stomach to heal.</p>\n<p>Stiles goes… well, not still but forcibly relaxed. He stares down at his own leg for a bit then glances back up.</p>\n<p>“At least three weeks,” he admits, mouth twisting. “Maybe more.”</p>\n<p>His heart skips. Derek doesn’t understand why he’s lying.</p>\n<p>“That long?” he asks. God, humans take <em>forever</em> to heal. It explains why most often it is the smell of blood that gives them away later in the raiding season.</p>\n<p>“Regenerating takes time,” Stiles replies. At least that isn’t a lie. Derek mentally shrugs. Alright, well, formal training is a full month so he’ll have plenty of excuses to be eating more. It will just be a matter of finding the time to sneak away. “You can’t rush perfection.”</p>\n<p>Speaking of, it’s probably time for him to head home. He’s exhausted and he’s going to have to think of some creative excuses that won’t set off his mother’s lie detector to use these next few weeks.</p>\n<p>“Alright,” he says. “I’ve got to get back.”</p>\n<p>The Fury nods. “I’ll be here.” The sarcasm is back, cheerful and biting.</p>\n<p>Briefly, Derek considers apologizing, because it is his fault that Stiles’ leg is broken, that he is stuck at the bottom of this gully for the foreseeable future.</p>\n<p>But, no. Stiles had been attacking his <em>sister</em>. He doesn’t even deserve Derek's help, let alone his apology.</p>\n<p>“Hey,” The Fury’s voice stops him as he turns to leave. It’s softer and serious and Stiles is carefully looking down at his stomach in a weak attempt at nonchalance. “Did- Any kills?”</p>\n<p>Derek’s jaw clenches. <em>Kills</em>, Stiles calls them. Like they don’t matter. Like they are some score to be kept track of-</p>\n<p>“No,” he snaps. “You didn’t manage to kill any of us.”</p>\n<p>Stiles must sense his tone but still doesn’t look up.</p>\n<p>Derek rolls his eyes and goes to leave again.</p>\n<p>“And you guys?” Stiles asks. His eyes flick up and then back down again. “You didn’t… you bag any?”</p>\n<p>His words are crude but he’s holding his breath. His heart is beating too fast again.</p>\n<p>“No,” Derek says, feeling his anger fade. Stiles glances up at him again before his head drops into a short nod. “No, we captured three though. They’re all older, I think. Experienced.”</p>\n<p>He hasn’t seen them yet, but from what he’s heard, they all have kills to their name. They’re not like Stiles. Not innocent.</p>\n<p>“Captured?” Stiles asks. “What does-”</p>\n<p>“We don’t kill them,” Derek offers. “At least, not… not right away.”</p>\n<p>They will at the end. Whichever one is the strongest will go up against whoever is doing the best in training during the Winter Solstice and it’s a festival of sorts- anger and revenge and rebellion all rolled into one.</p>\n<p>It had never been his favorite day, he’d actually managed to avoid the fight altogether for the past few years or so but now-</p>\n<p>“Fair enough,” Stiles replies and then he stuffs the last of the food into his mouth.</p>\n<p>Derek wants to ask then. Wants to ask what happens to the people who are taken far enough away that the bonds of pack fade and then disappear altogether.</p>\n<p>But instead he turns and leaves.</p>\n<p>He thinks Stiles just gave him the answer anyway. </p>\n<p> </p>\n<p>\n<strong>End Chapter 1.</strong>\n</p>\n<p>\n<strong>Chapter 2</strong>\n</p>\n<p>It’s not that Stiles trusts the werewolf. He doesn’t. He knows full well that Derek is a werewolf and that werewolves see humans as tools and nothing more and he has not forgotten for an instant that he is the enemy.</p>\n<p>Stiles isn’t Scott. He doesn’t believe that humans and werewolves can coexist in peace or that some of them might be good somewhere. He doesn’t worry about the morality of what they do or what they are forced to be.</p>\n<p>So there is no trust.</p>\n<p>But there is <em>reliance</em>.</p>\n<p>Stiles simply can’t hunt for himself at the moment. His leg won’t take his weight and he doesn’t have a fishing line to try to catch the fish he can see in the spring and his magic is returning too slowly to try using that for at least a week.</p>\n<p>So, like it or not, he is stuck waiting for Derek to bring food every night.  And Derek seems to know that because there is never enough for more than one meal. Two if he stretches it.</p>\n<p>Stiles knows what that means. Hunger is a powerful tool for keeping people in line. The entire population of Beacon Hills is controlled by it. And there’s no real way to fight it. Deucalion and his pack are the ones that hunt and scare off game so that the humans can’t and- well, the only way to rebel is to let yourself slowly starve to death so that your husband and son live even though neither of them would want you to do that and it turns out your son is an emissary anyway so your dream of keeping him away from the fighting squads is never going to come true and-</p>\n<p>Maybe that makes it easier. That Stiles is used to relying on werewolves for food. That years of dependence made it so he’s long used to the sting of embarrassment when Derek hands him the basket and Stiles snatches it quickly and starts eating before Derek can change his mind.</p>\n<p>Up to this point, Derek hasn’t shown any sign of playing that particular trick. In fact, he hasn’t seemed threatening at all. He’s young, maybe Stiles’ age, and always careful. He doesn’t come too close and puts his hands up when Stiles snatches the basket away. Even his voice is always patient and calm. Basically, he is confusing. And, really, he appears just as confused by Stiles as Stiles is of him. Overall, it’s not a bad deal.</p>\n<p>The only thing that Stiles doesn’t like is the way that Derek lingers.</p>\n<p>Stiles gets being a kept pet of sorts, gets that Derek is giving him some time to recover before sucking him dry, even gets that Derek seems to be keeping him a secret – his own private emissary to feed off of whenever he desires. Derek has told him enough that he knows he is in training right now. Being suddenly faster and stronger than the others will give him a distinct advantage once Stiles has enough to take. It makes sense. Stiles understands it. Accepts it, even.</p>\n<p>He just doesn’t understand why Derek uses the time Stiles spends inhaling the first few bites of food to re-fill Stiles’ (well, it is technically Derek’s) canteen from the spring, even though Stiles has gotten pretty good at crawling over to fill it himself. He doesn’t understand why Derek sees that he’s shivering one night and the next day brings a blanket.</p>\n<p>The cold isn’t life threatening yet. Derek shouldn’t have cared.</p>\n<p>Mostly, though, he doesn’t understand why Derek insists on making conversation. Random conversation too, awkward questions or halting stories about his life that Stiles at first frantically analyzes for clues and refuses to let himself respond to. If Stiles is being secretly interrogated for information about Deucalion, it is the strangest interrogation style he’s ever heard of.</p>\n<p>It’s probably not an interrogation, though. If Derek wanted information on the Alpha pack, all he had to do was dig into Stiles’ neck and take it.</p>\n<p>“So,” Derek says as Stiles tears into the loaf of bread he’d brought. Stiles is already rolling his eyes. That tone of voice tells him that Derek is going to go for an awkward question. “You must, uh, I mean those tattoos are pretty impressive. You must like them.”</p>\n<p>Unbidden, memories rise to the surface. Memories of struggling, of screaming that they made a mistake, of being held down as claws sunk into his neck for the first time, stealing away something he had just started to recognize was a part of himself. Memories of pushing back. Of flinging one of them across the room before his magic could be dragged out of him.</p>\n<p>That’s when they first took parts of her. When he tried to get them away from him. He didn’t even realize it at first. The gaps were small and… well, you can’t miss what isn’t there. He’d kept struggling, kept telling them off and figuring out ways to use his power so that there wouldn’t be any left to take, even though they kept digging at his neck anyway. They couldn’t keep him still enough to tattoo him. Stupidly, he thought that was winning.</p>\n<p>And then one day, he’s gone home and heard Melissa telling his father that “Claudia would be proud” and he realized he had no idea who Claudia was. His father and Scott were terrified and he suddenly saw all the holes that were in his mind, moments that didn’t line up because there was no set up or stories he no longer knew the ending to.</p>\n<p>It changed then. He stopped struggling and focused on lying down and forcing himself to stay still while watching in terror as a hollow needle was filled with ink and then stabbed into him over and over, pausing only occasionally when Ennis had to stop to wipe away blood.</p>\n<p>It had taken almost three full days. It still takes a solid five hours when they decide it has faded too much and has to be re-traced.</p>\n<p>“No,” Stiles says, honestly though he doesn’t know why. “I hate needles.”</p>\n<p>A pause.</p>\n<p>“I can’t tell if you’re being sarcastic,” Derek mutters and that’s funny enough that Stiles barks a laugh.</p>\n<p>“No,” he replies, still grinning because, what else is there to do? “Not this time.”</p>\n<p>“Then, why…?” Derek fades off, eyes flicking again over the prominent wolf on his neck  and trailing down to his hands.</p>\n<p>“Not exactly a choice, dude,” Stiles tells him. Derek is frowning again.</p>\n<p>“So, all Furies have to get them?” he asks. “It’s like… tradition?”</p>\n<p>Stiles blinks at that. It’s not quite the wording he would have chosen but, okay, tradition works.</p>\n<p>It’s easier to say than “possessive marking intended to put fear into other werewolves, mark them as separate from other humans, and make it easier for Deucalion to run his hand up people’s shoulders and feel the raised lines even though he’s blind so he knows who to feed off of.”</p>\n<p>“Yeah, all emissaries,” he offers, letting his voice go dark. He feels Derek’s eyes on him again.</p>\n<p>“Do you… <em>like</em> being a Fu- emissary?” Derek asks.</p>\n<p>Stiles looks up to glare at him, half wondering if this is some sort of joke. Does he like being used as essentially a human regenerating snack? Or letting werewolves take his magic so they can feel more powerful whenever they want? Or only being allowed to use his magic when he’s in battle, out killing other werewolves so the Alphas can spread their power?</p>\n<p>Is Derek fucking crazy?</p>\n<p>Then again… he likes that he automatically gets food from the Alphas even if he doesn’t make any kills. He likes that he can share that with his father and Melissa and that they probably won’t starve. He likes storing up some magic and then trying to come up with new ways to use it. He likes that he has learned to boost Scott’s speed and strength when they’re fighting, that he figured out a trick that at least manages Scott’s breathing problems, that he can blast werewolves away from Scott if they get too close.</p>\n<p>He hates it. But maybe he wouldn’t change it.</p>\n<p>“It is what it is,” he allows.</p>\n<p>Silence descends.</p>\n<p>Then,</p>\n<p>“Can I?” Derek asks, putting up a hand.</p>\n<p>That’s the other thing Stiles doesn’t get about Derek. Almost every time before leaving, he offers to take some of Stiles’ pain. It makes no sense and Stiles refused the first few times on principle but then-</p>\n<p>Well, he’d allowed it once and Derek hadn’t taken the opportunity to flip him over and sink his claws in so…</p>\n<p>“Alright,” he agrees, gripping his knife harder as Derek approaches.</p>\n<p>Reliance. Not trust.</p>\n<p>Still, as he has before, Derek moves slowly and curls his hand around Stiles’ ankle rather than his neck and then-</p>\n<p>Stiles lets out a sigh of relief without meaning to. The consistent throb of his leg fades, as do the sharp stings of cuts and uncomfortableness of bug bites and-</p>\n<p>“What <em>is</em> that?” Derek growls. Stiles blinks at him, uncertain why the werewolf sounds so frustrated. “The feeling around your stomach, it’s not- I can’t get <em>rid</em> of it.”</p>\n<p>Stiles considers and then tilts his head to the side, squinting.</p>\n<p>“It’s just hunger,” He shrugs. “No big deal.”</p>\n<p>That’s a constant in his life that Stiles is long used to. He and Scott have a rule: their parents first. Always. Stiles has his own rule: Scott before him.</p>\n<p>“Hunger?” Derek repeats. “But I give you food.”</p>\n<p>Stiles rolls his eyes.</p>\n<p>“Well, one meal a day isn’t exactly gonna cut it,” he tells Derek, twitching his leg as a signal for Derek to stop. Derek lets go and leans back, but doesn’t stand. “Not that I’m complaining!”</p>\n<p>He’s really not. The food isn’t much but it’s good – better than he would get at Beacon Hills and Stiles suspects he’s stealing it from his own pack.</p>\n<p>“How many meals are you <em>supposed</em> to have?” Derek asks.</p>\n<p>“Uh, I know I’m an emissary but I’m still human, dude. We need about three.”</p>\n<p>“A <em>day</em>?!” Derek sounds scandalized. It makes Stiles laugh. And not even in a sarcastic way.</p>\n<p>“We can’t all have super-efficient digestive systems like you wolves,” he says. And then goes quiet. Because he doesn’t remember her, but he still <em>knows. </em></p>\n<p>His dad had just suffered the wound that put him off the fighting squads forever, he and Claudia decided that bringing another child into the world wasn’t worth it – not even for the extra food they were guaranteed while she was pregnant, Stiles was too young and his mother had made the decision to stop eating. To give her food to him.</p>\n<p>He knows the stories well enough that he feels like he should remember them –<em> she spent the last three weeks in bed, still refusing to eat, she used to hum to you as she lay there, you begged her to eat, we buried her behind the willow tree in the woods </em>– but he doesn’t feel anything. Just general sadness and guilt because she died for him and he will never remember the songs she used to hum. He can’t even remember what she looked like.</p>\n<p>“But, you-”</p>\n<p>“It’s fine,” Stiles says, cutting Derek off almost roughly, even though he should have learned his lesson by now about being rude to werewolves. He just wishes Derek wasn’t here right now. That <em>he</em> wasn’t here. That she hadn’t – “I’m nowhere close to starving to death. Don’t worry about it.”</p>\n<p>It takes weeks to do that, months if the gaps in his head are anything to go by.</p>\n<p>Derek must sense his mood because he leaves without asking any more stupid questions.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>The next day, Derek arrives later than usual but with four times the usual amount of food. Maybe five.</p>\n<p>Stiles gapes at him and Derek <em>blushes</em>, like he’s embarrassed. Which doesn’t make any sense.</p>\n<p>“I don’t think I could sneak away that much every night,” Derek warns as Stiles still stares dumbly. “But I’ll try.”</p>\n<p>“This- I,” Stiles clears his throat and starts again. “This won’t make me fill up any faster.” For once, he was actually telling the truth. The wait time is something that annoys the Alphas the most and judging by the fact that they still give the emissaries the same amount they give those who made only one kill (aka next to nothing), he doubts the extra food will help.</p>\n<p>Though he will be eating more than he ever has in his life if Derek can bring this much even three times a week. Hell, if he manages it four times, Stiles will have enough to last the journey back and still have some to spare for Scott and their parents.</p>\n<p>Derek hasn’t challenged his request to wait three weeks before draining him yet. In fact, the longer Stiles could put it off, the better for his leg. Broken bones take at least three weeks to heal, but if he can convince Derek his magic at four would be even better…</p>\n<p>He snaps his eyes away from the food, worried that somehow just the smell of deceit will make Derek suspicious. When he looks up, Derek is frowning in confusion.</p>\n<p>Then he shakes himself and looks disappointed. Stiles tenses.</p>\n<p>“Oh. I thought,” the werewolf stops and shakes himself. “I’m sorry it won’t help you heal faster.”</p>\n<p>Stiles blinks at the wording (<em>sorry? Heal?</em>) but Derek cocks his head as if listening and then bends down and starts taking pain without asking.</p>\n<p>“Sorry,” he grunts as Stiles gasps in part shock and part relief. “I think someone’s following me. Gotta go.”</p>\n<p>He’s gone an instant later. Stiles turns it over in his head for a moment before refocusing.</p>\n<p>He doesn’t have time to figure Derek out.</p>\n<p> </p>\n<p>*^*^*^</p>\n<p> </p>\n<p>Derek never intended to become good at training. He certainly never meant to use what he learned from Stiles to hunt down the same seven humans they release and capture over and over again.</p>\n<p>But, hanging out with Stiles has helped him. Humans still disguise their scent with a variety of techniques, but being around Stiles has made his nose even more sensitive to what exactly a human smells like. He can pick out the difference between human heartbeats and animal ones and now that he knows humans actually have to eat three times a day instead of just once, he quickly figures out that the older captives, the ones who have been there for a few months, almost always head towards the gardens rather than try for the forest.</p>\n<p>Most importantly, he knows that humans can communicate. He knows they’re probably in pain. He is starting to think that maybe they don’t want to fight either. At least, Stiles doesn’t seem to hate him.</p>\n<p>Since Derek realized he was accidentally starving the Fury, Stiles had been… well… <em>friendly</em> is too strong a word and <em>polite</em> was the wrong word entirely but…</p>\n<p>Stiles is relaxing. At least a little. He no longer holds his knife when Derek arrives (though it’s always within arm’s reach) and his gaze has gone considering rather than accusing and Derek can’t be sure, but it seems to him that every so often he lets himself smile, just a little bit, at whatever story Derek is trying to tell that day.</p>\n<p>A real smile, too. Not the hard smirk that still pops up at inappropriate times.</p>\n<p>Then again, maybe that is Stiles hating him, maybe he’s reading this all wrong or just hoping that-</p>\n<p>“Derek,” Satomi’s voice jars him out of his musings on Stiles. He tries not to flush. He shouldn’t be thinking about the Fury anyway.</p>\n<p>Today’s important. It’s been ten days since training started and today, Satomi is allowing them to finally fight an actual human in hand-to-hand combat. He’s young, Satomi explains as Derek refocuses, but humans literally train since birth to kill werewolves. He’s not going to be easy to take down.</p>\n<p>He also already has two bands around his right bicep. They all know what that means.</p>\n<p>“No killing it,” Satomi instructs softly, only loud enough for the werewolves to hear. That’s always the rule. They need the humans to train with. “Though, remember, it is not operating under those assumptions.”</p>\n<p>Derek hangs back and watches. The human had been resting in the back of his cage, legs bent and arms resting on top. At Satomi’s growl, he rises and comes out of his cage blinking in the sunlight, clearly confused – maybe even waiting for an order. Usually they try to arrange it so that the humans honestly think they have escaped somehow. No need to bother with that this time. It’s going to be fairly obvious what they expect the human to do.</p>\n<p>Kill or be killed.</p>\n<p>Derek watches as he spots the small ring of werewolves and then the sword on the ground nearby. There’s a flash of fear in his eyes as he assesses the situation but it’s gone almost immediately. Because it has to be. In an instant, he’s darting forward and grabbing the sword, spinning it as he readjusts his grip as if to get used to the weight.</p>\n<p>Erica steps forward to take him on first, something like a smirk dancing on her face. She swings and it should be too fast for a human to follow but the human seems to read where she <em>will</em> be and then-</p>\n<p>A moment later Erica is somehow flung across the dirt and Satomi motions for her to stay down. Her rule is that humans generally attack in groups and if she thinks you would be dead in an actual battle, you are out of training as well.</p>\n<p>Isaac goes next and he’s more cautious than Erica, but easily frustrated and it takes longer, but the result is the same. Isaac ends up declared dead without even touching the human. Brett and Sam are next and they sort of try to attack together, but Derek thinks it just makes both of them fumble into one another’s space and get in their own way. Or maybe that’s the human too, the way he manipulates it so they are attacking from the same direction.</p>\n<p>By the time Boyd steps up, the human is panting and for a moment, his eyes flick to the side, as if expecting someone to be there who’s not, and the mistake costs him. Boyd swings and the human jumps back but not quite enough. Derek sees the punch catch him on the chin and he knows from personal experience that Boyd hits hard, but the human allows himself a mere moment to scramble back and blink before striking forward again.</p>\n<p>Derek doesn’t know when exactly the human managed to figure out that Boyd is strong but not fast but the next two minutes are dominated by the human running literal circles around the werewolf. Eventually Boyd missteps and the human swings the hilt of his sword down on Boyd’s temple.</p>\n<p>The human turns to face him, gasping now, reaching his free hand to his throat as if trying to rub something away, and Derek-</p>\n<p>Derek doesn’t want to fight him. He looks like he’s the same age as Stiles and he’s clearly winning but he doesn’t look happy about it. He doesn’t look proud of himself or excited about the fight or smug that he is taking werewolves out so easily. He just looks…</p>\n<p>He looks sad almost. Sad and defeated even though he isn’t. Well, not yet.</p>\n<p>His eyes flick to the opening of the training ring even as he holds his sword pointed at Derek.</p>\n<p>Derek wants to let him go.</p>\n<p align=\"center\">\n<img src=\"http://i.imgur.com/xdBNtvS.jpg\" alt width=\"999\" height=\"619\">\n</p>\n<p>“Derek,” Satomi orders. “Stop hesitating. In battle it will cost you.”</p>\n<p>Derek watches the human refocus.</p>\n<p>Derek rushes him. Satomi is an Alpha.</p>\n<p>He’s not quite sure what he’s going to do as he has no real intention of hitting the human, but when there is a sword suddenly swinging at his stomach, he knows enough to spin away and grab the human’s wrist to stop it and-</p>\n<p>He doesn’t even think about it. There is pain there: new, sharp pain across his jaw, doubtless from Boyd’s punch, old aches across his shoulder from when he was captured, and a tight pain radiating from his stomach that Derek recognizes as hunger.</p>\n<p>It’s all there. Simmering under the surface and Derek does what comes naturally.</p>\n<p>He pulls, trying to grab as much as he can in the brief moment it will be socially acceptable for him to be touching this human.</p>\n<p>He’s not ready for the human to gasp, freeze, and then sag in his arms.</p>\n<p>Panicking, Derek spins again and throws the human over his shoulder, hoping it looks like some sort of wrestling move rather than the human suddenly going limp on him. He supposes it works well enough because in an instant, he has the human on his back, claws pressed to his throat.</p>\n<p>“Very good,” Satomi says into the sudden silence. Derek is gasping as well now, a bit lightheaded from taking all that pain. “You see how Derek got in close so that the human couldn’t use its speed against him? That and grabbing onto his arm allowed Derek to use his superior strength. For the next week, we will be practicing wrestling moves…”</p>\n<p> Satomi continues even as she walks over to grab the human by the back of his neck and drag him back into his cell.</p>\n<p> The human is still panting, but his eyes lock on Derek as he allows himself to be pulled away.</p>\n<p> They are glossy and still sad and yet there’s a hint of surprise. A question there that Derek doesn’t know how to answer.</p>\n<p> *^*^*^</p>\n<p> </p>\n<p>He should stop, Derek knows. In real battle, he won’t be able to do this and Erica and the others are getting more and more suspicious of his ability to take down humans so easily.</p>\n<p> He <em>tries</em> to stop, tries to remind himself that the humans aren’t all like Stiles or that first young human, that the others have four or more bands wrapping around their arms and come out swinging to kill, that this strategy doesn’t make sense because it won’t work against a healthy human and it sometimes leaves him weak and shaky if they are too injured and-</p>\n<p>He tries to stop and when he can’t, he thinks about coming clean. Considers the fact that maybe it <em>could</em> be a real strategy, that it seems to leave the humans limp with relief, at least long enough so that they could be captured but-</p>\n<p>But he doesn’t. Because it would mean revealing how he found out that he could do this and because he doesn’t know how to put it and because he just-</p>\n<p>He can’t get Stiles out of his mind. And he doesn’t want humans to be captured.</p>\n<p>So he doesn’t stop and doesn’t tell and against the other werewolves, he’s still the worst at fighting, but against humans?</p>\n<p>Against humans, he’s getting a reputation.   </p>\n<p>It’s suspicious and he knows it. His mother is too busy to really comment on it aside from near constant prodding at the dinner table to tell his sisters how well he’s doing and Laura is surprised but above it but Cora…</p>\n<p>Cora has taken to staring at Derek more and more as if he is a puzzle that she can figure out if she can just get the opportunity. She asks for more detailed questions at dinner and openly questions where Derek goes after dinner (to which he says “around” which is entirely unconvincing) and the kicker is when Erica shows up to training and laughingly tells him that his little sister thought they were sneaking around together.</p>\n<p>It’s even more embarrassing when Isaac admits that she had cornered and interrogated him as well.</p>\n<p>It’s bad enough that he takes to <em>actually</em> going on long wandering walks after dinner, avoiding the canyon completely and trying not to feel worried that he can’t be with Stiles until sneaking out well past midnight. But he knows she’s following him and if he tried to shake her off <em>too</em> badly, it would be obvious he was hiding something and-</p>\n<p>“Cora!” he finally yells after almost a week of this, spinning around and glaring at the direction he knows she’s hiding in. “You’ve got to stop stalking me!”</p>\n<p>Predictably, she first attempts to go very still and pretend she’s not there.</p>\n<p>“Seriously,” Derek growls. His eyes might flash if they weren’t already shifted to see in the growing darkness. He can’t have her doing this anymore. He’s getting tired and cranky and he doesn’t like that sometimes Stiles is fast asleep when he gets there but snaps awake if Derek gets within fifteen feet. “Cora.”</p>\n<p>She steps out then and doesn’t bother pretending she wasn’t following him.</p>\n<p>“I’m not <em>stalking</em> you,” she huffs. “I’m just trying to figure out where you go every night!”</p>\n<p>“I go for a walk,” Derek says, hoping that his heart beat doesn’t skip. It’s not <em>technically</em> a lie. “That’s it. Now stop following me!”</p>\n<p>He moves to walk away but she skips forward to be next to him.</p>\n<p>“Your eyes are different,” she says, staring up at him. He rolls them, angles for home so he can attempt to drop her off.</p>\n<p>“No, they aren’t,” he says.</p>\n<p>“Yes, they are,” she replies. “More… bluish? Are you sick? Is that it? Are you hiding the fact that you are dying?”</p>\n<p>“I’m not dying,” he grumbles. “And I’m not sick. And my eyes are the same gold as always.”</p>\n<p>“They <em>aren’t</em>,” she says. “I mean… mostly. But I think they are a little blue too.”</p>\n<p>“You need a hobby.”</p>\n<p>“Are you taking something?” she asks and then <em>grins</em>. “That’s it! That’s how you’re suddenly so good at fighting! Is it some kind of herb or-”</p>\n<p>“<em>Cora,</em> ” Derek snaps. “I’m not taking anything. That doesn’t even make sense. Just <em>go away</em>.”</p>\n<p>It comes out testier than he means for it to and she blinks at him, hurt. At least, she lets it show for a moment.</p>\n<p>“<em>Fine,</em> ” she snaps. “ <em>Be</em> too cool to hang out with the family anymore. <em>Whatever</em>.”</p>\n<p>She storms off and he opens his mouth to call after her, because she’s right. He <em>should</em> want to spend time with his family, with his pack. Technically, he doesn’t need to go see Stiles <em>every</em> night. Stiles would probably be happy if he didn’t come so often, but he- He <em>wants</em> to see Stiles. Wants to so badly that it’s almost a physical itch.</p>\n<p>So he doesn’t call after her.</p>\n<p>He does another loop through the woods and then heads to Stiles.</p>\n<p>*^*^*^</p>\n<p>“You’re early!” Stiles says as Derek drops in the gully midafternoon.</p>\n<p>Stiles clears his throat. He had sounded more honestly surprised than sarcastic.</p>\n<p>They may have even been a touch of happiness.</p>\n<p>It’s been over two weeks now and it’s not that Stiles has <em>forgotten</em> that Derek is biding his time until he can rip the magic from Stiles’ body and use it to make himself even stronger and faster but, well, sometimes it’s easier not to think about it.</p>\n<p>It’s easier to just see Derek as the person who delivers him food and will fill up his water canteen without being told and who will come talk to him for at least a little while.</p>\n<p>So he doesn’t <em>like</em> it, he doesn’t- but… well, he’s bored. He’s stuck in a canyon, side now almost completely healed, with absolutely nothing to do. He’d spent a few days trying to find a branch that he could fashion into a crutch but then Derek had seen and brought back a polished, clean pole from his village. So Stiles’ big project that was supposed to keep him entertained for days was over in a few short hours.</p>\n<p>“Yeah,” Derek says, swinging into the wooded area where Stiles has set up his rudimentary camp. As is more usual than not nowadays, the bag of food he brought is practically overflowing.</p>\n<p>Stiles almost feels bad that he’s started to squirrel away some of the jerky for his return trip. Well, he does until he remembers that Derek is just waiting around for his magic to grow back and then most likely kill him. Then he feels less bad.</p>\n<p>“Rose, one of Satomi’s betas, is giving birth today,” Derek explains. “No afternoon training.”</p>\n<p>Stiles opens his mouth to say something, when suddenly there’s a sound from somewhere above them. Stiles doesn’t really think about it, has already classified it as some sort of animal, but Derek stiffens, drops the bag of food and then <em>moves.</em></p>\n<p>Stiles doesn’t even have time to protest as suddenly Derek is yanking him down and into the thickest area of trees, one hand clamped over Stiles’ mouth to ensure he doesn’t make a sound.</p>\n<p>Stiles opens his mouth to bite Derek’s hand anyway when he notices that Derek’s eyes are pointed upwards and he’s <em>shifted</em>. As if in danger. Stiles stops struggling. Derek presses his other finger to his own lips, signaling for quiet, and then when Stiles nods, he slides his hand from Stiles’ mouth to his neck.</p>\n<p>Stiles freezes for an entirely different reason.</p>\n<p>Derek’s claws are now almost aligned with the four scars that already mar the back of his neck. A little bit over and Stiles know they will sink in easily and there will be a stab of pain through his spine and then the world will go black and there will be a <em>suction</em> as if all the blood in his body is being pulled away from him, away from where it needs to be and then-</p>\n<p>Then just more pain. For five minutes, sometimes ten if they’ve let him go for a while and, if they decide to mess with his memory, he’ll get flashes. Little bit of the things they are taking from him, the emotions associated with each that he’ll never quite feel again.</p>\n<p>Then it will be over. The claws will pull out and Stiles will go cold and lean over to throw up in the bucket they provide for just this reason. They’ll give him a heartbeat, maybe two, to gasp and shudder, to work his throat open again, to spit into the bucket, and then they’ll shove him off the table and he’ll scramble to get his feet under him and leave the room.</p>\n<p>Scott will be waiting for him outside, ready to catch him and throw a spare jacket over his shoulders, wiping away the blood from his neck as he does so and-</p>\n<p>“Stiles?” Derek’s hand tightens around his neck. They’ve shifted back into his human form and the barest edge of his fourth finger is brushing against one of the scars.</p>\n<p>\n<em>Don’t move. Don’t move or they’ll take something.</em>\n</p>\n<p>\n<em>Don’t move or they’ll take the rest of her.</em>\n</p>\n<p>“What is-?” Derek cranes his neck around to look and his eyes widen in surprise as he sees them and-</p>\n<p>Stiles shoves him away, using just a bit of magic to make sure that Derek flies a full four steps away from him.</p>\n<p>“Don’t,” he orders, wishing his heart wasn’t pounding in his ears. He rises to his feet, grabbing for his crutch with one hand and his knife with the other. Spots fill his vision and he struggles to blink them away. “Don’t.”</p>\n<p>“Don’t what?” Derek asks, holding his hands in the air. He looks like he is worried Stiles has gone crazy. “Stiles, I just pulled you down because I’m pretty sure Cora is following me here. I wasn’t going to do anything.”</p>\n<p>Just like that, Stiles is sick of this game. Of Derek pretending that he isn’t waiting for Stiles’ to recover completely so he can drain him. Of Derek acting like he doesn’t even <em>know</em> what Stiles is talking about.</p>\n<p>It had been fine before, when he was too weak to stand and Derek brought him extra blankets and food and started a small fire him at night but now…</p>\n<p>It had been almost two weeks. Stiles is still trapped in this canyon because his leg still can’t hold him but he is handling everything else. Maybe not food, but he can get his own water and start a fire and is slowly but surely setting up a small form of shelter for when it rains.</p>\n<p>He is also starting to map out the easiest rock face to climb out of here, but Derek doesn’t need to know about that.</p>\n<p>What Derek <em>must</em> already know, must already sense because werewolves know these things, is that Stiles’ magic is back. Maybe not all the way, but it’s been a long time before Stiles has been allowed to fill up completely. He’s not even sure how much more he <em>could</em> get. Even with the level he’s at right now, he feels… wired. Like he should be using it somehow. He could blast Derek further back if he wanted or fire a <em>real</em> ball of fire this time or-</p>\n<p>Or nothing.</p>\n<p>Despite all his power, he can’t make his leg heal any faster. He can propel Derek away, but he can’t propel himself <em>up</em> and even if he could, his leg won’t last for the journey back home. Chances are he’d end up caught by other werewolves. Werewolves who won’t be so interested in keeping him alive or semi-healthy for long enough that he could escape.</p>\n<p>He has to get back to Scott. Right now, keeping Derek happy is his best option of doing that.</p>\n<p>“Alright,” he says, shoving the knife back into his pocket. “Alright, it’s fine. Sorry. Let’s just get this over with.”</p>\n<p>When Derek doesn’t move, he hobbles closer. He’s done this almost every other week for six years. As long as Derek doesn’t take too much, he’ll recover in a few hours. And it’s not like he has anything better to do than rest.</p>\n<p>He hops the last few steps and then turns. He and Derek are almost of equal height so he bends his head. He’ll collapse once Derek starts but Derek will have to catch him if he wants his fingers to stay rammed into his neck and Stiles may want this over with, but he’s not <em>lying down</em> in front of a werewolf. Not unless he’s forced to.</p>\n<p>“Go for it,” he says. “Just don’t- don’t take too much, alright?”</p>\n<p>He’s not exactly sure how werewolves know to stop but even Kali has managed not to kill anyone. He’s hoping it has to be a concerted effort.</p>\n<p>He squeezes his eyes shut. His vision is always the first thing to go and last thing to come back so it’s easier that way.</p>\n<p>Scott won’t be here to catch him or lead him back to their hut or wipe the blood from his neck, but that’s okay.</p>\n<p>It’s time to get this over with.</p>\n<p>*^*^*^</p>\n<p> </p>\n<p>“What are,” Derek starts and then stops, one hand coming up to brush over the scars. “Stiles, what are these? What are you talking about?”</p>\n<p>“You- have you never done it yourself before?” Stiles asks. His scent spikes into something almost like panic before it suddenly goes muted again. “Well, you’ve watched, right? I think it’s… I mean I’m pretty sure it’s instinctual.”</p>\n<p>“Pretty sure <em>what’s</em> instinctual?” Derek doesn’t feel any instincts about what to do with Stiles. Except the ones telling him to take care of Stiles, to come visit him at least once a day, to protect him from enemies- even if those enemies are Derek’s own Pack.</p>\n<p>Underneath him, Stiles goes still. Derek lets go of the Fury’s neck completely but it’s still another heartbeat before Stiles finally turns around.</p>\n<p>“Derek,” he says slowly and his hand drifts toward his knife again, but Derek thinks that’s more instinct than anything. “What do you think an emissary – a Fury – what do you think I am?”</p>\n<p>“A magic user,” Derek replies. Satomi had touched upon Furies. Though she’d only told them enough to impress upon them the danger of Furies, to explain that if they see one, their duty is to warn everyone in the area and then leave them for the more experienced fighters. “A human with the ability to use magic.”</p>\n<p>“Well, yes,” Stiles says. “But what else?”</p>\n<p>Derek’s mouth twists.</p>\n<p>“Killers,” he says. “Furies are the most dangerous and ruthless of the humans and specialize in killing.”</p>\n<p><em>With fire mostly,</em> he adds mentally. <em>Because burns are the hardest to heal and fire consumes quickly and maybe you can run in and save two of your younger children, but if you go in for a third time--</em></p>\n<p>He didn’t need Satomi to teach him that.</p>\n<p>He pulls his thoughts away from that and then shakes his head to wipe the emotion from his face. He can’t think about that now. Not with Stiles looking at him, heart still racing too fast to be natural.</p>\n<p>“The pack works to take them down first,” he admits. “Though we’ve only ever succeeded in injuring them enough that they have to retreat.”</p>\n<p>“But you don’t keep any yourself?” Stiles presses.</p>\n<p>“No,” Derek says, frowning. “Why would we? Some werewolves believe they’re rabid.”</p>\n<p>Stiles takes a step away from him, as if just now realizing how close they are. He smells… scared? It not quite panic anymore- there’s too much disbelief for that - but… it’s not calm, not by a long shot. Derek barely resists the urge to rub at his nose.</p>\n<p>“You don’t – you don’t use them? You don’t drain them until they’re dead?”</p>\n<p>“Drain them? What are you- we’ve never even managed to <em>capture</em> one.”</p>\n<p>“But they… some have disappeared,” Stiles says, more to himself than Derek. “Not come back from raids at all and if you’re not…”</p>\n<p>He fades into silence for a beat, staring into the distance and then barks a laugh that may be the darkest sound Derek has ever heard. It sounds almost painful.</p>\n<p>“Of course,” he says, still grinning, all teeth, the grin that Derek has learned to hate. Or maybe he always did. “At least we let you live… what a bunch of-”</p>\n<p>He cuts himself off as if stabbed and Derek watches as the Fury’s eyes slam back to him. They are a few shades too dark, lacking all their usual humor.</p>\n<p>“They why didn’t you kill me?” he asks. It’s Derek’s turn to wince and glance away. “If you don’t know about the magic or what emissaries are really good for, then why…?”</p>\n<p>“I still have no idea what you’re talking about,” Derek grumbles. It all makes no sense. Stiles never makes sense. “But I didn’t kill you because I… I didn’t want to.”</p>\n<p>There. That’s simple enough. He had looked at Stiles, hurt and bleeding and practically dead already and he hadn’t wanted to kill him.</p>\n<p>Though, it was more than that.</p>\n<p>Because he never wanted to kill anyone, but he <em>couldn’t</em> kill Stiles.</p>\n<p>“That doesn’t…” Stiles is frowning at him, face a picture of confusion. “That doesn’t explain <em>anything.</em>”</p>\n<p>Derek shrugs. Maybe it doesn’t. But there’s no other way to explain it.</p>\n<p>“So you’re just… you’re just going to let me go,” Stiles says. “This isn’t- I’m not your prisoner.”</p>\n<p>“No,” Derek replies. “You can leave whenever you’re healed. Or whenever- whenever you want.”</p>\n<p>Not that Stiles would want to stay any longer than necessary. Not that Derek wanted him to. This was just- he was-</p>\n<p>“What were you even talking about?” He says, pulling his thoughts away from that direction. Of course he wanted Stiles to leave. The kid was sarcastic, annoying, rude, and dangerous. The entire point of taking his pain and feeding him was to get him on his way back to his own village. Away from Derek. “About the magic.”</p>\n<p>Stiles looks at him for a long time, head tilted and eyes focused. Derek thinks for a moment he’s actually going to open up.</p>\n<p>Then he smirks, and Derek knows the answer before he even says it.</p>\n<p>“Like I’m telling you,” he says, eyebrows lifted in a challenge. “I’m not an idiot.”</p>\n<p>It probably should annoy Derek, that Stiles still doesn’t trust him, but it doesn’t.</p>\n<p>For some reason, it just makes him smile back.</p>\n<p>*^*^*^</p>\n<p> </p>\n<p>Derek stays for longer than Stiles realizes, stays until the conversation has shifted away from sensitive topics back to general opinions and lighthearted stories, stays until Stiles finally allows himself to put down his knife and stops flinching whenever Derek moves too close.</p>\n<p>It’s dark when Derek finally leaves, dark enough that Derek casually shifts his eyes over to see better, and they seem to glow almost blue in the light of the moon. Stiles thinks that they are brighter than any other werewolf’s and he stares for a moment, just a second, and then Derek is nodding and leaping away.</p>\n<p>And for some reason, it’s then that the enormity of what just happened finally hits Stiles.</p>\n<p>He almost drives himself into a panic attack replaying the conversation, certain that, despite it all, the soft laughter and the gentle slow movements, Derek <em>must</em> be lying. He <em>must</em> be but Stiles can’t quite think of any good reason why he would be. There’s no angle there. Except maybe to be cruel, to let Stiles’ guard fall even more than it already has and he just doesn’t… he doesn’t think that Derek would do that.</p>\n<p>He might even trust Derek a little bit and that thought <em>does</em> send him into a panic attack, albeit a small one because that’s not… that’s <em>wrong</em>. Werewolves are cruel and evil and how can he trust Derek when he might have to kill him and-</p>\n<p>He calms down eventually. It takes longer than it should without Scott there to talk him through it.</p>\n<p>The thought makes him even more miserable. Because Scott could be dead. Maybe not on this raid (Derek had said that they didn’t kill anyone) but there were four other packs in surrounding areas that they were sometimes ordered to attack and-</p>\n<p><em>He’s fine, </em>Stiles tries to assure himself. <em>Not killed. Not captured.</em></p>\n<p>Stiles is pretty sure that this pack is the only one that takes prisoners and Derek had also said that they had only captured three older people. Stiles doesn’t hate the older members of Beacon Hills, the rough men and women who have long been beaten into submission, who fight over their kills and refuse to share the spoils – can’t hate them because he <em>understands</em> them but he can’t care about them either. He doesn’t have the time.</p>\n<p>But it’s <em>Scott</em> who keeps him from being just like them, who feeds their parents first but then whoever else needs it and who keep encouraging Stiles to try to learn how to heal with his extra magic, rather than fight or boost Scott and-</p>\n<p>If Scott’s gone, Stiles will-</p>\n<p>\n<em>He’s fine. He has to be.</em>\n</p>\n<p>His anxiety has left him exhausted but he is still too wired to sleep. He feels that same itch under his skin that has been building for over a week now. Ever since-</p>\n<p><em>Ever since he got his magic back</em>.</p>\n<p>He could use it, he realizes almost abruptly. There’s no need to hide it from Derek or worry that the Alphas will notice it’s lower than usual.</p>\n<p>For the first time in his life, he’s free to use it however he wants. Whenever he wants.</p>\n<p>He could- Well, he doesn’t really know what he could do. He doesn’t have any Mountain Ash and, besides, setting up a ring is one of the things Stiles never even had to think about it, it’s too dark to attempt flinging his knife around, and Scott isn’t here for Stiles to use his self-invented boosting spells on.</p>\n<p>Well, fire it is then.</p>\n<p>Fire is the one thing that the Alphas bother “teaching” the emissaries to do. And it’s not really teaching so much as snarling threats and laughing as any emissaries that haven’t just been drained attempt to whisper advice without drawing attention to themselves.</p>\n<p>Stiles picked it up easily. He’d only burned himself twice before learning how to project it away from his hands and he’d never had a problem making it as big as Deucalion demanded.</p>\n<p>It is just a matter of drawing focus <em>inward</em> and turning that pull into something like anger (never hard to do, only hard to control) and then-</p>\n<p>He lets it build in his hand for a while, watches as this tips of his fingers tips turn their usual shade of – well, actually they look a bit blueish rather than orange, but blue fire is hotter so that’s probably because he’s so <em>full</em> right now – and then,</p>\n<p> He aims the fireball towards the rock wall, careful not to shoot it up into the sky or let it get big enough to start a <em>real</em> fire but it’s still impressive, remains blue as it streaks through the sky and then explodes to orange.</p>\n<p>The heat of it warms his face and he finds himself smiling.</p>\n<p>He should keep himself topped up for his journey back but that’s still over a week away, which is plenty of time and-</p>\n<p>For once, he can start experimenting.</p>\n<p>\n<strong>End Chapter 2.</strong>\n</p>\n<p> </p>\n<p>\n<strong>Chapter 3</strong>\n</p>\n<p>In the end, they make it almost a month, twenty-seven days to be exact before Derek makes a mistake.</p>\n<p>He is sitting with the fish line in the water, even though it’s the middle of the night and the fish are doubtlessly asleep and Stiles is standing, cautiously bending his leg slowly, exercising it without putting any weight on it. And Derek doesn’t mean to but it just… it just pops out.</p>\n<p>Stiles is talking, telling a story that involves a squirrel and his friend, Scott, and-</p>\n<p>“Bet I could have caught it,” Derek says, smirking just because he can. Because it’s been days now, over a week since Stiles learned Derek wasn’t after his magic and they’re finally at the point where Stiles sometimes smiles and teases back and-</p>\n<p>“Oh, please,” Stiles says, looking down to focus on pulling his foot up towards his chest. He only winces a little which Derek takes as a good sign. It’s still crazy to him that humans take this long to heal but at least Stiles seems to be doing better. “You could not.”</p>\n<p>“Superior werewolf speed and strength,” Derek points out. “Squirrels are nothing.”</p>\n<p>“Right,” Stiles replies, glancing at him again. He looks almost relaxed as he rolls his eyes. “I believe you.”</p>\n<p>“I’ll prove it,” Derek offers.</p>\n<p>“While in a canyon? I’m pretty sure I’ve scared them all off.”</p>\n<p>“I could catch you one and bring it back.”</p>\n<p>“Like that counts,” Stiles says. “You would definitely cheat. You probably domesticate squirrels or some shit.”</p>\n<p>Derek laughs at that. The past ten days Stiles has kept up a constant stream of musing as to what Derek’s pack is like. Derek knows it’s not entirely benign, knows it’s Stiles way of fishing for information, trying to nail down how exactly his pack and the Alliance operates but it can be entertaining.</p>\n<p>“Don’t be ridiculous. We don’t train squirrels,” Derek says. “But if you want to witness it, then I’ll-”</p>\n<p>He stops. Once Stiles can get out of this canyon, he’s gone.</p>\n<p>He’s gone and Derek won’t have to sneak him food in the middle of the night or help him fill his canteen or debunk his increasingly wild theories about his pack. He’ll just… disappear. Forever. As if he were never here.</p>\n<p>“I could catch you one when you visit.”</p>\n<p>Derek tries to sound casual when he says it, tries to sound like Stiles does when he talks about being hungry or taking forever to heal or any of the other thousand things that seem <em>wrong</em> but slip out too easily.</p>\n<p>Stiles laughs.</p>\n<p>“See! I knew you couldn’t do it,” he says, still smiling. He doesn’t seem to realize that Derek is serious.</p>\n<p>Stiles is leaving soon. They both know it even though they’ve never mentioned it aloud. But Stiles’ leg is almost completely healed, or at least, healed enough that he moves around constantly and only rubs at it absently towards the end of the night. The pain Derek takes almost every night has faded from a deep throb to a dull ache.</p>\n<p>Derek hasn’t missed the multiple stashes of food Stiles has spread throughout the canyon either. The biggest is underneath his small shelter in the woods but he’s started two more than Derek has sniffed out. He also hasn’t missed the fact that the rocks on the far wall smell like Stiles, like he’s already started to practice scaling up them.</p>\n<p>Derek wonders if, even now, it never occurs to Stiles that Derek would help him out of this canyon if he asked.</p>\n<p>“I will,” Derek insists, trying to keep his voice light because that seems to be how Stiles communicates, through jokes and teasing and- “Just come back and visit.”</p>\n<p>He fails in trying to keep his voice casual. It comes out more desperate. More like a plea.</p>\n<p>“Derek,” Stiles says, softly. And Derek’s stomach drops because for once, Stiles doesn’t sound amused. He sounds… careful. Sad, almost. “We’re not- I can’t come visit you.”</p>\n<p>“Why not?” Derek says, standing and trying to ignore the fact that all his heart has started hammering and there’s an odd fear at the back of his throat. “I mean, look, no one has found us out yet and it’s been almost a month! We can just meet here sometimes. When- when you can sneak away or-”</p>\n<p>“We’re not doing that.” Stiles’ voice sounds flat and final and Derek hates it. “And you don’t – you don’t want that, Derek. Not really.”</p>\n<p>“Yes, I do,” Derek says and he knows he’s not lying. He loves his family, he <em>does</em>, but Stiles is-</p>\n<p>Stiles challenges him and makes him laugh and Derek feels <em>better</em> when they can just sit and talk, even if they’re arguing, even if Stiles is making fun of him, even if Stiles had spent the day working himself too hard, talking to himself, and his voice is slightly hoarse and he falls asleep while Derek is trying to tell a story.</p>\n<p>Derek likes Stiles. He’s not even sure what that means yet or what is going to happen but- but letting Stiles walk out of his life forever is unacceptable.</p>\n<p>“Look, you can’t,” Stiles says, shifting too quickly onto his bad leg and flinching off. “You- don’t- you don’t know anything about me! I-”</p>\n<p>“What are you talking about?” Derek says. He knows everything he needs to about Stiles. Stiles eats too quickly, like he’s afraid it’s going to be taken away, but still doesn’t eat much, saving most of it for later. He’s named one of the bigger fishes who is too smart to bite any of his bait Leeds and Derek has heard Stiles engaged in entire conversations with it as he drops into the canyon. His smirks don’t reach his eyes but his laughter shakes his whole body.</p>\n<p>Derek knows Stiles.</p>\n<p>“I- I’m not,” Stiles starts, waving a hand. “I’m not what you think I am. I’m not-”</p>\n<p>He stops completely and Derek doesn’t say anything. Just lets the silence stretch because he doesn’t even begin to know what questions to ask.</p>\n<p>“I’ve <em>killed</em> werewolves before, Derek,” Stiles says suddenly. His voice is soft and quiet and Derek freezes, listening for the lie.</p>\n<p>It has to be a lie. Stiles doesn’t have any bands. Derek checks again, only to see that for the first time in days, Stiles’ fist is curled around his knife again.</p>\n<p>“No, you haven’t,” Derek replies. “Not directly, you-”</p>\n<p>“Yes, directly,” Stiles interrupts, choking on a merciless laugh. “Directly as in stabbed them with a wolfsbane blade to the heart and slit their throat directly.”</p>\n<p>There’s still no lie. There has to be-</p>\n<p>“You don’t have any bands,” Derek insists, waving a hand at Stiles’ bare arm. “Even Furies get them, we know-”</p>\n<p>Stiles is shaking his head.</p>\n<p>“I… I’ve tried to tell you. You don’t get fed unless you make kills,” he says this like it means something. “Except for Emissaries. We’re too valuable to let starve, but… Scott could never do it. We’d fight together and he’s better with the sword then I am and I can use my magic to make him faster while hanging back and he would always get them in a corner and then he-”</p>\n<p>Stiles swallows. Derek <em>knows</em> there is a look of horror on his face but he can’t change it.</p>\n<p>The loss of a member of your pack was… was <em>unspeakable.</em> Derek had felt it too many times.</p>\n<p>“He always hesitates,” one of Stiles’ shoulders falls up and down in a movement that isn’t quite a shrug. “He can’t do it. So I- I do it.”</p>\n<p>Stiles looks up and meets Derek’s eyes.</p>\n<p>“I’ve done it. Twice,” His glare turns defiant. “And we take back their – the proof and Scott turns them in as his kills and gets the bands and enough food for him and his mom and I will have to do it again, Derek. That’s how we do it.”</p>\n<p>“Stiles-” Derek wants him to stop. To stop this.</p>\n<p>He wants it to be a lie.</p>\n<p>Stiles barrels on.</p>\n<p>“The only reason we weren’t together the night I attacked you is because Scott was drawn into another battle and people are going to start getting suspicious if we always go off together and he comes back with a kill. But winter is coming and our parents are both -- I left to find another.</p>\n<p>“I would have killed her, Derek. Your sister. Cora. If Scott were there, we probably could have taken at least one of you and I would have Ringed the other and I’ll have to do it again at some point. And I won’t hesitate. I can’t.”</p>\n<p>He sounds firm. Almost angry.</p>\n<p>“I’m a killer, Derek. It’s like you said. Furies kill people. It’s what we’re good for and it’s how it’s always going to be. And you saying differently isn’t going to change anything. There’s no such thing as an innocent human. Except maybe Scott and he- I don’t even know if he’s still alive.”</p>\n<p>Something in his voice breaks and despite it all, Derek reaches for him.</p>\n<p>Stiles takes a step away.</p>\n<p>“You should,” Stiles stops and clears his throat. “You should go, Derek. I don’t know what we think we’re doing here but-”</p>\n<p>“It won’t work,” he says, limping back another step. “It <em>won’t</em> so just- just get out of here.”</p>\n<p>Derek doesn’t move at first – isn’t going to – and Stiles must sense it.</p>\n<p>Because the next moment, there is a pressure against Derek’s shoulders and it’s not a shove backwards but it is unrelenting. He falls back one step and then another when the magic still doesn’t let up, not even when Stiles turns away from him</p>\n<p>Derek finally does then what he should have done the first time he saw Stiles.</p>\n<p>He leaps up the rocks and runs.</p>\n<p>*^*^*^</p>\n<p>Stiles spends the next two days getting ready.</p>\n<p>He uncovers all his hidden stashes of food and packs them into one bag, he spends an afternoon trying to get his magic to mend the shirt that Derek gave him that is understandably ratty around the edges, he cuts down his crutch into a walking stick and continues to do exercises on his leg, staring up at the canyon wall and trying to visualize actually climbing up it and-</p>\n<p>And then he grits his teeth and sharpens his knife and cuts his hair as best he can. Because unlike most of the other humans, emissaries are required to keep their hair short. It helps with the stealth missions they are often sent on, and, more importantly, gives the wolves easier access to the back of their neck.</p>\n<p>That’s probably why everyone else keeps their hair so long. No one wants to look like an emissary. Not for a moment. Stiles doesn’t blame them. There’s a reason he pushes the boundary and insists on shaving the sides of his head short and leaving the middle as long as they will allow him.</p>\n<p>He cuts himself twice, nicking the top of his ear bad enough that it bleeds and he wishes Scott was here to do it.</p>\n<p>His first shearing was at the hands of Ennis, but Scott has done every one since. He knows how to gently scrape along the sides so it is as short as it can be and he knows exactly how long Stiles can get away with for the middle, especially the back. So that the Alphas can get to his neck but it’s still <em>different</em>, still defiant, at least a little bit. He doesn’t know how but Scott always manages it and Stiles loves it.</p>\n<p>This time, he’s careful to cut it shorter than Scott would. He’s been gone for a month now and he’s assuming that the amount of magic he’s bringing back will be enough to placate them, or at least see the benefit of keeping him alive but he… He knows the other emissaries weren’t killed by this pack at least. And that means the Alphas probably drained them to death.</p>\n<p>It’s very possible they’ll do that to him the moment he steps foot in the village.</p>\n<p><em>They won’t</em>, he tries to assure himself, clutching the knife in his fist a little harder, considering cutting it all off, getting rid of the one last bit of defiance he allows himself. <em>They’re not going to kill me.</em></p>\n<p>He’s too valuable. He’s one of the youngest emissaries and judging by the amount of times that it is Deucalion to drain him instead of the others, he thinks he produces the most magic and they won’t want to waste him. They might hurt him or separate him from the others for a while, but draining him completely would be stupid. And the Alphas aren’t stupid.</p>\n<p>He drags in a ragged breath and leaves his hair the way it is.</p>\n<p>They won’t kill him.</p>\n<p>Of course, they will do other things.</p>\n<p>He knows they are going to dig through his memory and find out what exactly he has been up to these past weeks. Hopefully the gap caused by his injury won’t make him suspicious and hopefully they won’t find anything damning as they poke around his innermost thoughts and feelings and hopefully they’ll only remove the important bits, the bit where he realized that they were liars, that other packs didn’t even know what an emissary <em>was</em>, let alone how to use one.</p>\n<p>Hopefully, they’ll leave it at that but-</p>\n<p>They could take it all.</p>\n<p>They could take Derek’s awkward attempts at asking to take away his pain and their stilted first conversations, the easy laughter that now flows between the two even though Stiles doesn’t remember making the decision to get comfortable. They could take the way Derek’s eyebrows draw together in concern when Stiles says something that he doesn’t understand and the half-quirk to his mouth when Stiles says something he finds funny and the way his eyes linger – only sometimes- on the side of Stiles’ neck that isn’t marred by a tattoo.</p>\n<p>They probably will. It’s too risky otherwise and so Stiles will be left with just a big hole where this past month has been and his father and Scott won’t ever be able to fill him in on the details, won’t be able to tell him what it is he is missing.</p>\n<p>He’ll live his whole life wondering what happened in the month he was away, probably believe whatever stories they tell him, believe that the Hale Pack had tortured him and they had saved him and he should be <em>grateful</em>.</p>\n<p>His hands are shaking, he realizes abruptly, but it’s not a panic attack. It’s… slower somehow and deeper and maybe it’s something like grief, even though that doesn’t make any sense and he hasn’t lost anything- not yet and-</p>\n<p>“Stiles?”</p>\n<p>Stiles jumps, blinking back moisture that isn’t supposed to be there and scrambles to his feet.</p>\n<p>And then clutches his knife even tighter because two days ago he had confessed to murder and <em>Derek Hale</em> is standing in front of him. Coming closer.</p>\n<p>“What do you want?” he asks, eyes flicking upwards to the lip of the canyon. Derek must know that he can’t take Stiles alone, not now that Stiles’ leg is practically healed and his magic is replenished. But werewolves hunt in packs and any more than three or four and Stiles would be hard pressed to fight his way out. Even if he could kill a few-</p>\n<p>He doesn’t <em>want</em> to kill Derek. He-</p>\n<p>“Look, I’m leaving,” he offers, swallowing. “Today, actually, so just-”</p>\n<p>“You said ‘have to,’” Derek says suddenly and it confuses Stiles enough that he stops scanning the trees and looks back at Derek. It doesn’t help. His face is unreadable.</p>\n<p>“What?”</p>\n<p>“Before,” Derek is still moving closer. “When you said you said you would- when you said you will kill werewolves again.”</p>\n<p>Stiles blinks at him. Still not understanding. He <em>will</em> kill werewolves again. That’s the point. He can’t stop. Not when his father and Scott and Mrs. McCall are still trapped in Beacon Hills. And escape isn’t an option. People aren’t allowed to leave. Not even when they are old and useless and starving to death. The Alphas still make sure there is no leaving.</p>\n<p>“You said you would <em>have</em> to,” Derek continues. “Not that you want to.”</p>\n<p>Stiles takes a step back as Derek gets within arm’s reach, but that’s when the werewolf finally stops moving. Stiles is just lucky he can hear him over his own heartbeat.</p>\n<p>“There are other things too,” Derek says and Stiles flinches back when Derek lifts his hand, but all he does is start counting on his fingers. “The tattoos that you hate, the scars on your neck, the talk of how food is distributed in your village…</p>\n<p>“You said <em>have to</em>,” Derek repeats and then he is sitting down on the log that has become their spot, staring up evenly at Stiles. “I think it’s time you told me why exactly it is that humans attack us every year. Why you <em>have</em> to kill us.”</p>\n<p>Stiles shakes his head automatically. He can’t tell. That’s – they Alphas will <em>know</em> and they will kill him for it, because they might want his magic, but they will never forgive him for revealing them to the other Packs. Never. Derek already knows too much already.</p>\n<p>There’s a reason they send out all human strike teams until the very end, until the other Pack is weak and whittled away from years of raids, until they can go in and kill everyone. The element of surprise is crucial and if Stiles ruins that for them-</p>\n<p>They’ll kill him.</p>\n<p>“I -,” he says. Derek still hasn’t moved. Stiles isn’t fooled for an instant. Derek could leap at him right now and end all of this. Still, he looks at the ground instead of at the werewolf. Mutters the phrase soft enough that Derek couldn’t hear it if he wasn’t a werewolf. “What happens if I can’t tell you?”</p>\n<p>He tenses, ready for a threat, ready for Derek to tell him that either Stiles give him a good reason or he doesn’t get to leave, ready to Ring Derek if he has to, and he clenches his jaw, just <em>ready</em> and turns his glare to Derek and-</p>\n<p>And sees that Derek’s eyes have gone soft and sad and maybe <em>resigned</em>. Like he expected this.</p>\n<p>“Then you leave,” Derek says calmly and Stiles feels it like a punch to the chest. “You go and I let you and that’s all that happens, Stiles.”</p>\n<p>Stiles look down at his hands. They’re shaking again.</p>\n<p>“But,” Derek continues and Stiles almost feels relief that Derek is going to say something that makes <em>sense</em>, something like ‘I’ll kill you if I see you again’ or ‘Don’t you dare come back here.’ “I won’t be able to help you if I don’t know. And I want- Stiles, I could help. I <em>promise</em> I could at least try and-”</p>\n<p>Derek stands as he speaks, takes another step closer and this is- Stiles-</p>\n<p>“It’s a pack of werewolves,” Stiles says, looking up from where his gaze has dropped to meet Derek’s eyes. “A pack of Alphas, actually. And they- they’re the ones who control the humans. All of us.”</p>\n<p>Derek freezes and Stiles cringes, certain he is going to be accused of lying because Derek had spoken enough about the topic to know that even the Alliance of three packs living so close together was a rarity, that a pack of only Alphas should be <em>impossible</em> and-</p>\n<p>“Alright,” Derek says, sitting back down. “Tell me everything.”</p>\n<p>And the crazy thing is that Stiles thinks he will.</p>\n<p>Thinks he wants to.</p>\n<p>*^*^*^</p>\n<p>Derek tries very, very hard to keep his face neutral. Because he wants Stiles to feel like he can tell Derek anything, to not regret finally choosing to open up and Stiles has always seemed to be able to read him so Derek bites down on the inside of his cheek and clasps his hands together and tries to focus on <em>keeping still</em>.</p>\n<p>Because if he doesn’t, he might lose it.</p>\n<p>If he allows the horror and disgust to show on his face, Stiles might get embarrassed or start censoring the story and if he inhales too deeply and gets a good whiff of Stiles’ scent, which is by turns horrified and dulled somehow, he may not be able to stop from howling; and, above all, if he lets himself really <em>focus</em> on the things Stiles is telling him, he has no doubt he will shift and take off in the direction of Beacon Hills right this moment.</p>\n<p>There’s an equally likely chance, he will grab Stiles, bring the Fury’s erratic pacing to a stop, and just <em>hold</em> him.</p>\n<p>And he can’t do that.</p>\n<p>Because anyone can see that Stiles is trying to hold it together. His tone oscillates between flat and emotionless, listing the basics like they don’t matter, or throwing the story out there like a taunt, lips curling around the syllables in dark amusement, accompanied by an eye roll or shrug as if that somehow proves he’s unaffected.</p>\n<p>\n<em>There’s only nine of them, but they control the food supply and by this point, all other packs attack humans on sight so there’s nowhere for us to go. Even if we wanted to try.</em>\n</p>\n<p>\n<em>There’s not really a shortage, but they only give food to those who are useful, mostly to those who make kills and so that’s why I had to- that’s why we attack so much.</em>\n</p>\n<p>\n<em>So werewolves can take emissaries’ magic. It makes them stronger, faster. That’s- that’s what the scars are for. That’s how they do it.</em>\n</p>\n<p>Derek tries not to interrupt. Tries not to push as Stiles’ obviously shies away from certain topics, but sometimes he can’t help it and-</p>\n<p>\n<em>“Sorry,” he says as he Stiles takes a breath. “Sorry, but why don’t the Furies fight back?”</em>\n</p>\n<p>\n<em>Stiles freezes and then goes for a grin a beat too late.</em>\n</p>\n<p>\n<em>“Well, there’s not that many of us and we’re drained most of the time,” he says, shrugging one shoulder. “Unless they are sending me on a raid, the most I can usually manage is lighting a freaking candle.”</em>\n</p>\n<p>\n<em>“Oh,” Derek nods, feeling silly for asking such a stupid question. It’s then that he notices Stiles isn’t looking at him.</em>\n</p>\n<p>\n<em>He’s looking down at the ground, one hand hesitantly coming up and skimming down his hair so that he’s almost- but not quite- touching the scars on the back of his neck.</em>\n</p>\n<p>\n<em>“There’s,” Stiles starts and his voice is low and nervous. He still doesn’t look up. “There’s something else the Alphas can do too.”</em>\n</p>\n<p>\n<em>Stiles takes a breath and Derek watches as he glances up for only a moment before focusing on the ground again, fingers slowly tracing over the marks once more.</em>\n</p>\n<p>\n<em>“They can mess with your memories a little bit,” he admits. “If they- if you misbehave or struggle, they can take stuff from you.”</em>\n</p>\n<p>\n<em>“Stuff?” Derek repeats, failing to keep the horror from his voice. Luckily Stiles seems to register the question and nothing else.</em>\n</p>\n<p>\n<em>“Memories,” he clarifies. “Moments or days or- or people.”</em>\n</p>\n<p><em>Derek wants to ask but he doesn’t dare. Instead, he simply lets the silence linger, lets Stiles gnaw on his bottom lip and stare at where his toe is digging into the ground for a little while, fingers still running over his scars and just when Derek is afraid it’s gone on too long, when he tries to work up the courage to say </em>something<em>, Stiles snatches his hand away from his neck and pulls out a grin that’s not quite stable.</em></p>\n<p><em>“So, anyway, the </em>Furies<em>,” he stops to grin at Derek then, a nod at his shift in vocabulary. “Don’t exactly get to do much, really. Just get these badass tattoos and keep our hair short and-”</em></p>\n<p><em>It takes a little while before Derek can pay attention again, but Stiles quickly starts on his theories on which packs each of the Alphas had come from and this is </em>important<em> this is information he should tell his mother so-</em></p>\n<p>All told, it takes almost an hour for Stiles to finishing tell him about Beacon Hills.</p>\n<p>“And, well, that’s it,” Stiles says finally. “You can tell your mom everything if you want, not that I think it will actually help anything but at least you know now. That’s why the humans attack and why I have to go back and-”</p>\n<p>“No,” Derek interrupts, standing. No, Stiles cannot go back there. No alone. Not ever. “You can’t go back there Stiles.”</p>\n<p>Normally when he tells Stiles what to do, he earns a glare, but this time Stiles’ mouth curls up into a smile smaller than his usual grin.</p>\n<p>“I can,” Stiles says. “And I will. Derek, I have <em>family </em>there. My dad is probably worried sick and Scott wouldn’t have managed to kill any werewolves while I’m gone and without me, they get a third less food so they might be <em>starving</em> and I- Staying isn’t an option.”</p>\n<p>“No, I mean, you can’t go back there <em>alone</em>. We have to stop them,” Derek clarifies. “The Alphas. We have to tell my Mom and Satomi and Olin and you said it that there’s only nine Alphas. We’re three <em>packs.</em> We could- we can stop them.”</p>\n<p>Stiles is staring at him. “Derek, you can’t-”</p>\n<p>“We <em>can</em>,” Derek says, cutting him off and taking a step closer before stopping himself. “You said it yourself- the Alpha pack wants to destroy us completely and this is a way to make the attacks <em>stop</em>, once and for all. It’s all my mom has wanted for years.”</p>\n<p>“Derek, she… she’s not gonna believe you,” Stiles says. “This is- I <em>know</em> it sounds crazy. She’s going to think I tricked you or that you made it up or-”</p>\n<p>“You have to come with me to tell her,” Derek replies. “They’ll believe you.”</p>\n<p>“What they’ll do is <em>kill</em> me,” Stiles interrupts, running one hand through his hair. “I’m a <em>Fury</em>. You take me within two feet of you village and your pack will have me torn in half before I get a word in!”</p>\n<p>Derek frowns. Technically, that’s true. There’s no reason to spare a Fury, to even consider talking to one, and even if Derek escorted him, odds are he would get shoved aside and Stiles would be killed before he knew it.</p>\n<p>And letting a Fury in front of all three Alphas at once? It’s too big a liability. It will never happen. Unless-</p>\n<p>“The Festival,” he says. Stiles looks at him.</p>\n<p>“What?”</p>\n<p>“There’s a Festival we have,” Derek explains. “Every year, all three packs <em>and</em> Alphas attend and everyone will be too busy and excited to notice when I sneak you in. And I’m in training so I’m allowed near the ring in case whoever is fighting goes down.”</p>\n<p>“A ring like a <em>training</em> ring?” Stiles asks but he doesn’t sound nearly so against it as he had a moment before. “A training ring surrounded by warrior werewolves who will want to kill me?”</p>\n<p>“I’ll get you a disguise,” Derek promises. “It’s not like people are going to <em>suspect</em> that a Fury is going to show up in the middle of the day. Everyone will be too busy having a good time.”</p>\n<p>“It’s a bad idea,” Stiles says but that’s not a no. Derek has known Stiles for a month now. He knows what that means.</p>\n<p>“We have to try,” Derek tries. “If we can get my mom and the other Alphas to believe then… then we could stop them. The Alphas.”</p>\n<p>“Why would they even care?” Stiles asks, some of the excitement dimming from his eyes. “Humans have been attacking you guys for <em>years</em> and now that you know what to watch for, you could probably set up your defenses just fine. There’s no point in risking yourselves to help us.”</p>\n<p>“There is a point,” Derek says. “It’s- it’s the right thing to do. Because a pack of Alphas is… it’s <em>wrong</em>, Stiles. It’s wrong that humans are forced to fight and that your magic gets taken away from you and that they take-”</p>\n<p>He stops when Stiles looks away.</p>\n<p>“They’re gonna help,” Derek repeats. “And wouldn’t that be better than just returning? We could get them all out – your dad and Scott and his mom. All of them.”</p>\n<p>“You- you really think they would listen?” Stiles asks, but he’s in. Derek can already tell.</p>\n<p>Derek nods.</p>\n<p>“It’s in three days,” he says, somehow knowing that that will be Stiles’ next question, knowing he won’t want to wait for longer than he has to.</p>\n<p>Stiles’ face slides into something softer, almost hopeful, then-</p>\n<p>“I’m gonna die, aren’t I?” he says, grinning.</p>\n<p>“No,” Derek says, smiling back. “I won’t let anyone hurt you. Promise.”</p>\n<p>He keeps his voice light but if Stiles were a werewolf, he would hear that Derek’s heart is perfectly steady.</p>\n<p>*^*^*^</p>\n<p>Derek rushes to the canyon on the morning of the festival, fighting back the urge to throw up.</p>\n<p><em>It’s going to be okay,</em> he assures himself for the thousandth time. <em>This works out for the better, it gives us a good excuse-</em></p>\n<p>There’s a split second when he lands that he doesn’t see Stiles sitting near the spring in his now-usual spot and he panics but then Stiles is striding up to him, limping slightly since it’s morning and Derek’s suspects his leg takes a while to warm up, and-</p>\n<p>Derek can’t help it. Despite all the bad news he’s about to deliver, he laughs.</p>\n<p>Stiles looks ridiculous. Derek had brought him a pair of pants and a tunic two days ago, since nothing about Stiles’ all-black Fury uniform was at all discreet and the shirt he had been wearing (that he’d stolen from Laura actually) smelled too much like him. It had seemed like a good idea, since this way he would smell mostly of Derek and the plan was to stay together. And Stiles had looked a little doubtful when Derek had given them to him but, well-</p>\n<p>Now Derek can see why. The pants aren’t too bad since they are practically the same height and it’s probably a good thing that they are a bit too long and hide Stiles’ black boots almost entirely. But the tunic… Well, it’s obvious that Derek is a good deal broader than Stiles. Stiles is practically swimming in it.</p>\n<p>The coat doesn’t help either, although at least it covers up the back of Stiles’ neck.</p>\n<p>“Oh, real funny,” Stiles mutters darkly as Derek keeps grinning. “Laugh it on up there, Derek.”</p>\n<p>Derek continues to do so because Stiles is pouting, but not truly angry.</p>\n<p>“It doesn’t look that bad,” he tries as Stiles scowls at him, shoving up his sleeves before remembering that he can’t do that without revealing his tattoos.</p>\n<p>“I look like an idiot,” Stiles tells him. “Promise me if I die, you won’t burn my body wearing this. I don’t want to look stupid when I’m dead.”</p>\n<p>Just the thought cuts of Derek’s amusement immediately.</p>\n<p>“You’re not going to die,” he repeats (for the hundredth time in three days). “Though, I do have bad news.”</p>\n<p>He winces as Stiles stills, staring at him in concern. Winces and looks down and-</p>\n<p>“Well?” Stiles asks finally. “How could things possibly get any worse?”</p>\n<p>“I-” Derek starts. “Remember how I’ve said that one trainee is selected every year? To fight the strongest human we have in the ring?”</p>\n<p>“Yes,” Stiles replies, still frowning.</p>\n<p>“Well, it’s me,” Derek admits. “I’ve been selected.”</p>\n<p>It was all his stupid human-tricks that he learned from Stiles. The sensitivity his nose had for the scent of human and the fact that he picked up some tracking tricks from there rare times Stiles told stories and, of course, the pain leeching trick, which meant that he was pretty sure some of the humans attacked him first and practically allowed themselves to be grabbed and taken out immediately.</p>\n<p>Stiles goes very still.</p>\n<p>“Okay,” he says, running a hand through his hair, sweeping it back and forth along the short side as if that will help him think. “Okay, well, what does that mean?”</p>\n<p>“I don’t know,” Derek admits. “I just found out like an hour ago! I mean, I have to be at the ring earlier and more people will want to know where I am and- I don’t know!”</p>\n<p>“Well, look,” Stiles starts, gnawing on his bottom lip, still dragging his hand back and forth along his head. “It’s – it’s fine. Maybe it’s even better.”</p>\n<p>Derek raises an eyebrow. He’s been telling himself that lie all morning but he’s not sure how it could actually be better.</p>\n<p>“You’re expected to be at the ring,” Stiles clarifies, flailing his hands through the air. “No one will question you being back there and I can just hide or something and then when it’s your turn to go out, I’ll just… tag along.”</p>\n<p>“I thought we were going to try to let you talk to the Alphas in private,” Derek says, frowning. “Or at least more private than in the center of, well, everybody.”</p>\n<p>“Well, we can’t let you kill a human,” Stiles grumbles. “And there’s no way to do it before the fight?”</p>\n<p>Derek shakes his head.</p>\n<p>“Then that’s how we do it,” Stiles says, he doesn’t look as concerned as Derek feels. “I’m not seeing any other options.”</p>\n<p>“You’re right,” Derek admits, sighing. “You’re right just- you have to be <em>careful</em>. Stay where I put you and let me talk a little bit before you come out. I don’t want this to be… abrupt.”</p>\n<p>More like he doesn’t want everyone panicking and killing Stiles before he gets a chance to speak but they both know that without having to say it aloud.</p>\n<p>“Deal,” Stiles says. “I stay hidden away until you prep ‘em. Then come forward, hands up, careful not to make any sudden movements. Or fireballs.”</p>\n<p>Stiles appears relaxed about the whole thing, but Derek suddenly feels like this is moving too fast. Three days ago, this had seemed like a good idea, a viable alternative to Stiles just <em>leaving</em> but now that it was actually happening…</p>\n<p>Now it just seems too risky. All three Alphas have lost pack members to the humans over decades of fighting and his own mother had lost her <em>mate</em> and maybe Stiles had been right the first time this came up, maybe none of them will actually be willing to listen to a young Beta werewolf and the Fury he was supposed to kill.</p>\n<p>“Derek,” Stiles says, taking a step closer and ducking his head to catch Derek’s eyes. “Look, either it works or it doesn’t and either way, at least it will be over with. It’ll be fine.”</p>\n<p>Derek nods but something in his gut twists. He wonders how much of Stiles’ life has revolved around that saying <em>At least it will be over with</em>. He wonders if Stiles’ version of “fine” bothers to take his own life into account.</p>\n<p>“Just, uh,” Stiles suddenly says, encouraging smile sliding from his face. “Just promise me one thing.”</p>\n<p>Derek freezes. A part of him knows what Stiles is going to say before the Fury even says it.</p>\n<p>“If I don’t make it,” Stiles continues, running a hand through his hair. “Just promise you find a way to let my family know. Grab a human during the next attack and whisper it in their ear or something.”</p>\n<p>“Stiles-”</p>\n<p>“Don’t use a note. Most of us can’t read.”</p>\n<p>Stiles hold Derek’s eyes for another moment before he is rolling his shoulders as if shaking something off.</p>\n<p>“Alright,” he says, striding forward and clapping Derek on the shoulder as he brushes past. “Let’s do this.”</p>\n<p>“Wait,” Derek says, inhaling. “Wait, Stiles, you smell.”</p>\n<p>“What do you mean I smell?” Stiles say, huffing. “I took a dip in the spring like yesterday!”</p>\n<p>“I mean you smell like a human,” Derek clarifies, mouth quirking upwards. “Almost all the adults are literally trained to sniff out humans. And then kill them.”</p>\n<p>Stiles snorts but his hands drift toward his pocket. “I mean, I think I used up all my herbs that are supposed to counteract that,” he admits. “I don’t know-”</p>\n<p>“There’s- well, there’s another way,” Derek say, feeling his face warm a little bit. “We could get you to smell more like me.”</p>\n<p>Stiles raises an eyebrow at him.</p>\n<p>“Not like that!” Derek says. “I just need to… hold you for a while. Maybe, uh, maybe rub at your neck a little.”</p>\n<p>Stiles is right in that it’s not the most effective way to scent someone, but it will do for a day. If Stiles agrees to it. Because Stiles has grown comfortable enough to touch Derek sometimes, favoring him with a pat on the arm or a lazy swipe to the back of his head when Derek teases him, but he remains fairly sensitive to his own personal space. He sometimes lets his foot stretch out close to Derek when they sit around the fire but just as suddenly he’ll leap up and away, moving restlessly as they talk. Derek nudges Stiles with his shoulders every once and a while but never more and-</p>\n<p>And he can’t forget the last time he touched Stiles’ neck, the gasping panic and the scent of dread and-</p>\n<p>“Oh, well that’s not bad,” Stiles says, stepping forward. “Always knew you were looking for an excuse to hug me.”</p>\n<p>Derek rolls his eyes but takes a step closer as well, inhaling to try to make sure that Stiles is as okay with this as he sounds. There isn’t anything immediately concerning so he takes a breath and wraps his arms around the Fury. He’ll keep this quick and easy- just long enough to get Stiles smelling mostly of him and then-</p>\n<p>And then he makes the mistake of dropping his head toward Stiles’ neck and inhaling again.</p>\n<p>The scent hits him like a wave- pine, mostly, with hints of fresh water and fish – but underneath all that is just… <em>Stiles.</em> It’s spicy somehow and musky and there’s a bit of smoke to it, which Derek has only ever associated with horrible things, but somehow mixed with Stiles’ other scents it’s softer, less acidic and Derek wants to taste-</p>\n<p>He leans back, trying to get some distance but all that does is make it so his eyes fall on Stiles’ neck.</p>\n<p>He’s on the tattooed side, and he dimly remembers hating the wolf that stands out black and violent against Stiles’ throat and, logically, he knows he hates it even more know that he knows how and why it was put there, but right now-</p>\n<p>Right now he’s captivated by it. He can’t help but follow the lines with his eyes, imagining the rest of the body of the wolf spread across Stiles’ collarbone, the back two legs etched across his shoulder before the tail splinters all the way down his arm to his hands.</p>\n<p>When Stiles releases the breath he’s holding, soft and silent across Derek’s shoulder, and then swallows, the wolf shudders with the movement.</p>\n<p>Without thinking about it, Derek reaches his hand up to feel it, pressing his palm to the mark and maybe trying to leach away pain that is no longer there. He tightens his grip slightly, fingers just on the edge of the four tight patches of skin on the back of Stiles’ neck and-</p>\n<p>He feels Stiles tense against him and he’s already pulling away but then the next moment, Stiles relaxes.</p>\n<p>And then, though Derek doesn’t put any pressure, Stiles head falls to the side, exposing more of his neck.</p>\n<p>Derek can’t tell whose heart is beating louder- his or Stiles’.</p>\n<p>His thumb is in the crook where Stiles’ neck meets his jaw and instinctively, he lets it sweep out, down along Stiles’ jaw and Stiles inhales again and that’s when Derek finally leans back enough that he can pull his eyes away from Stiles’ neck and onto his face.</p>\n<p>Stiles is beautiful. Derek almost never gets to see him in the sunlight, see how the morning light makes his eyes appear gold, almost like a wolf’s, and they are huge in his face, dancing with something different than his usual dark amusement.</p>\n<p>They’re standing too close, Derek realizes. This has gone on too long. He’s still holding Stiles’ neck and they’re breathing the same air, Stiles only pausing to lick his lips and Derek can’t help but track the movement and there’s another swallow against his hand, smaller this time, nervous, and Stiles’ hand is on Derek’s elbow, which is something that Derek hadn’t noticed before and they might be getting closer even though Derek is positive he’s not moving and-</p>\n<p>Stiles blinks and jerks back.</p>\n<p>“Ooh-kay, then,” he says and Derek feels all the blood in his body rush to his head. What was he doing? That was- he finally glances up and feels slightly better when he sees that Stiles has turned bright red as well. “Well. That was- effective scent marking? Yes?”</p>\n<p>Mutely, Derek nods.</p>\n<p>“Except, well, uh, let’s make sure it’s even, right?” Stiles says and then he stumbles forward to grab Derek’s other hand and wipe it against the other side of his neck. “There we go. All done. Smell is everywhere.”</p>\n<p>“Y-yeah,” Derek replies, telling himself he doesn’t sound hoarse. That was – he can’t – they can’t deal with this right now. They have to get going.</p>\n<p>Still, he stays where he is as Stiles heads off to the canyon cliff side.</p>\n<p>“Derek!” Stiles calls. “Come help me out of here so we can go save the day!”</p>\n<p>That makes Derek laugh for some reason and he goes.</p>\n<p>He can worry about whatever that was later.</p>\n<p>*^*^*^</p>\n<p>Stiles doesn’t know what he did to make Derek believe he is a reckless individual, but he clearly did something. Because Derek has not stopped freaking out since jumping out of the canyon and then turning around and helping haul Stiles up after him.</p>\n<p>“Hold on,” Derek says, pressing one hand to Stiles’ chest to push him back as someone walks by. Stiles rolls his eyes but goes still. The passing werewolf is <em>literally</em> carrying a stack of boxes. He can’t even <em>see</em> them.</p>\n<p>Stiles wants to huff or sigh or maybe even snicker and poke Derek in the side but he doesn’t. He is positive that if he so much as thinks about talking, Derek will panic and press a hand to his mouth to stop him and Stiles-</p>\n<p>Stiles can’t think about what happened when Derek was scent-marking him. Because, they are in the middle of a highly complicated and likely-deadly mission at the moment and Derek is a werewolf and Stiles is unsure when he started trusting Derek and even more unsure as to when he started… <em>liking</em> Derek but, regardless, now is not the time.</p>\n<p>The werewolf passes without incident and Derek still remains frozen for two long beats before continuing. And that’s better because when Stiles is pressed to Derek’s side, he can’t focus.</p>\n<p>And he needs to focus. He has to try to figure out what makes these werewolves different, and if it’s possible that Derek is just too young to know that they <em>do </em>have emissaries, if it’s just some well-guarded secret, and, above all, memorize an escape route out of here. Because the more he thinks about this, the more sure he is that this is a terrible plan.</p>\n<p>Maybe not as bad as going back and definitely having all his memories erased and possibly having his life-force sucked out of him, but still not great.</p>\n<p>It takes them a long time to make it to the training ring. Considering Derek stops them about every five steps, Stiles is surprised they make it there at all.</p>\n<p>Once he sees it though, he thinks that maybe he shouldn’t have been in such a hurry.</p>\n<p>He doesn’t know what he was expecting but it was not this huge, well-maintained structure. It is lined with wooden spikes and they’ve installed raised stands for the crowd to sit on and-</p>\n<p>“We take training seriously,” Derek mutters as if catching Stiles’ scent of part-wonder, part-horror. “We- we have to.”</p>\n<p>Wordlessly, Stiles nods. The humans don’t have the wood to spare for such a structure, not when there’s are more important things to do like desperately cut firewood or scrounge for food, but if they had the spare time, Stiles is sure the humans would do the same thing.</p>\n<p>As it is, they take training just as seriously. From the time children can walk, they are given wooden swords and maybe some like to claim it’s play but adults go around correcting grips and stances and even the kids realize it’s something more by the time they’re seven or eight.</p>\n<p>He shakes his head to clear his thoughts but it only gets worse when he follows Derek beneath the outer ring to the inside of the ring. Derek had mentioned that they keep some humans for training and so Stiles should have put together that they would obviously need somewhere to <em>stay</em> but-</p>\n<p>But he’s not actually prepared to see the small caged areas that line the ring, protected from the weather but only barely. He can’t help but imagine that if his dad were captured instead of just injured, he could be wasting away, practically starving. And it’s not the werewolves’ fault, obviously, but still, Stiles can’t-</p>\n<p>“Stiles,” Derek hisses, drawing his attention away from one such enclosure. Stiles blinks and refocuses. There is no one even <em>in</em> the cell.</p>\n<p>“Okay,” Derek says, opening a door. “This is where we keep supplies for the humans, so it smells more like them anyway. And no one should come in till after the festival is over so-”</p>\n<p>“I stay here till your big moment,” Stiles finishes, waving a hand. “Now, go before someone comes looking for you.”</p>\n<p>“Okay,” Derek says, stepping towards the door without looking away. “Don’t move though. And don’t touch anything. And if-”</p>\n<p>“Derek, go,” Stiles says. Honestly, he’s nervous but… he is also so <em>full</em> right now. His magic is restless almost, crackling under the surface of his skin, and he doesn’t <em>want </em>it to happen, but if he needed to fight werewolves right now, he thinks he could win. Busted leg and everything. “I’ll be fine.”</p>\n<p>“And you won’t move?” Derek asks again. Stiles is grinning fondly for some reason, although he doesn’t remember telling himself to.</p>\n<p>“Not until you come get me,” he promises. Derek is still frowning, opens his mouth (doubtless to worry more) and so Stiles uses his magic to push him back, just a little, his hands flashing blue for an instant. Derek growls but it is entirely fond and then he’s gone.</p>\n<p>The next forty minutes are not fun. Stiles has never done well with being trapped somewhere in the first place and the combination of nerves and magic that seems to be <em>singing</em> somehow doesn’t help. He tries to stay still, then rocks up and down on his toes until his leg begins to ache, and then paces anyway.</p>\n<p>He tries not to, but his thoughts turn over all the ways that this can go wrong. It doesn’t help his anxiety or his restlessness and there’s a dozen times when he goes for the door to just take off and take his chances with the Alphas.</p>\n<p>But he doesn’t.</p>\n<p>Because he had promised Derek he’d stay. And Stiles isn’t usually one to make promises (let alone keep them) but…</p>\n<p>If this works, it could change everything. His dad and Melissa could stop worrying about the coming winter and gain weight. Scott wouldn’t have to fight; Stiles wouldn’t have to worry about his breathing problems every time he fought. Stiles wouldn’t have to frantically search his memories every time Alphas drained him and try to figure out if they had taken anything while he was still distracted by the rush of pain.</p>\n<p>This is worth the risk. He knows that.</p>\n<p>He’s still relieved when the door opens slowly and Derek is standing there, waving Stiles forward.</p>\n<p>“It’s time,” Derek whispers as Stiles steps forward. “Satomi is already sitting with my mother and Olin. They’re releasing the human now.”</p>\n<p>“Okay,” Stiles replies, mouth suddenly dry. “Okay, so, do I stay here for a few minutes or--”</p>\n<p>“No,” Derek says. “Here, come with me. Quietly.”</p>\n<p>Stiles glares – he knows that this is currently a time for silence! – but Derek is already turning.</p>\n<p>“Stay here,” Derek instructs, pushing him gently against the wall near the opening to the ring. “No one should be back here since all I have to do is walk out and, well-”</p>\n<p>“Fight a human to the death?” Stiles says, drumming his fingers against his chest.</p>\n<p>“I’m just going to explain the situation,” Derek corrects. “No death.”</p>\n<p>“Well,” Stiles starts because, <em>no</em> death seems a bit optimistic. He puts on his best grin. “Let’s not-”</p>\n<p>“Stiles,” Derek growls. “No death.”</p>\n<p>“Fine,” Stiles says. There’s a clamor from the crowd as presumably the human had just been released.</p>\n<p>Wait. The human. Who doesn’t know that Derek isn’t there to kill him.</p>\n<p>“Wait, wait, wait,” Stiles says, reaching to grab Derek and stop him. Derek freezes, eyes flashing.</p>\n<p>“What? What’s wrong?”</p>\n<p>“The human!” Stiles clarifies, waving a hand in the direction of the ring. “The human doesn’t know that you’re not there to kill him! Which means he’s going to try to kill you!”</p>\n<p>This plan is literally the worst plan in all of history. Derek is going to go out there and get stabbed and Stiles is going to have to go save him and-</p>\n<p>“Don’t worry,” Derek says. “If he actually comes at me, I’ll just knock him out.”</p>\n<p>Sure. Like it’s that easy. An alarming amount of Derek’s stories end with him being beaten up by his <em>younger</em> sister so Stiles isn’t exactly sure where this confidence is coming from. And come to think of it, Derek’s verbal communication skills are not very high either- why did they think Derek was going to be able to talk in front of everyone?</p>\n<p>“Alright,” Derek says, apparently mistaking Stiles’ silence for agreement. “Wait here until I give you the cue. Don’t let them see you.”</p>\n<p>“Cue?” Stiles repeats. “What cue? Derek, we never talked about-”</p>\n<p>Derek waves a hand at him and then steps out. And, of course, Stiles can’t hear anything because there is cheering and he does wait a few beats, so Derek isn’t still by the door, but then he can’t help but peek out.</p>\n<p>He scans the crowd first, mouth going dry as he realizes just how many werewolves there are. Derek had told him that this was an Alliance of three packs, that despite the attacks, they are still strong but…</p>\n<p>It’s a lot of werewolves. Some half-shifted in anticipation of the fight, some watching with a look of almost boredom that Stiles recognizes, all with their attention completely focused on Derek.</p>\n<p>The three Alphas are there too, sitting in the middle of the benches. They all hold themselves regally, gracing the audience with only small smiles (and Derek got one from his mother, Stiles saw, just a small flash of motherly-pride that Stiles doesn’t quite recognize).</p>\n<p>Stiles turns his attention back to Derek, who isn’t shifted yet, and then to where three werewolves are pushing a human forward and throwing a sword on the ground for him to slowly bend and grab, wincing like he’s already in pain and—</p>\n<p><em>Scott</em>.</p>\n<p>Later, this will be another gap in Stiles’ memory. He will never quite remember how he moves so quickly, how he throws his coat off so his arms are free, how the magic leaps into his hands easily, so <em>unbelievably</em> easily, and he doesn’t even have to focus to use it, how it just <em>flows</em>.</p>\n<p>He will not remember the desperate cry that pushes itself from his lips either, but maybe that’s for the best.</p>\n<p>*^*^*^</p>\n<p>When Derek hears it, he thinks that something has gone wrong. He’s just entered the ring and he’s waiting until the other werewolves leave, mostly to make sure the human doesn’t rush him immediately, partly so they don’t drag him away the minute he starts talking instead of fighting. He turns, dimly recognizing the human as the young one, who excels at fighting even though he seems to hate it and he has just breathed a silent sigh of relief because this one never attacks first, always waits until he is forced to fight and so Derek thinks that this will be easy but-</p>\n<p>But then Stiles lets out a shout that is anger, horror, and desperation rolled up into one and he is running out, blue energy flying off his hands light lightening and some of it goes <em>into</em> the other human and Derek has no idea what is happening but-</p>\n<p>“Stiles!” the human shouts and then he’s moving too, running towards Stiles.</p>\n<p>The two hit each other in a hug that Derek has to assume is painful, though he is still too shocked by the turn of events to really process what is happening.</p>\n<p>“Scott, you’re-,” he hears Stiles gasp and the rest is lost because the human starts talking over him and-</p>\n<p>“FURY!” a werewolves yells.</p>\n<p>And with that, the stunned silence breaks.</p>\n<p>There’s a wave of movement from the stands, non-warriors pulling their children <em>back</em> as others rush forward, already shifted and snarling.</p>\n<p>“Wait!” Derek yells, but it’s already too late. His voice is lost in the collective roar of attack and when he looks back, Stiles and Scott have realized the situation. They’ve stepped away from each other, their faces mirror images of determination. Scott is gripping his sword with a purpose that Derek has never seen before and Stiles’ hands are <em>glowing</em> blue, the light casting an eerie hue to his tattoos.</p>\n<p>“Stop!” Derek tries, watching as no less than five werewolves jump into the ring to surround the two humans. He’s moving too slowly, not sure how to stop them without actually attacking and people are not even looking at him, but he starts forward anyway-</p>\n<p>And then the Alphas jump down.</p>\n<p>The three of them walk in unison, shifting slowly into their Alpha form, red eyes blazing even in the midday sun, and it’s too late, Derek realizes. It’s too late. Stiles and his friend are surrounded and judging by the way Scott’s eyes flick around and spot the others and the way he shakes his head at Stiles and the way Scott’s hand closes around Stiles’ shoulder – just for an instant- both the humans know it.</p>\n<p>“Wait!” Derek tries again, but no one is listening to him and when he tries to step forward, another Beta pushes him <em>back</em> and suddenly Laura is there, pulling him away, but still not <em>listening</em> to him and he sees the moment when it’s about to happen.</p>\n<p>All three Alphas tense and for once, Stiles isn’t grinning, and Derek has already shifted instinctively, driven by the scent of danger and <em>fight</em> and Stiles is going to <em>die</em> and that can’t happen, it <em>can’t</em> and-</p>\n<p>Derek <em>howls</em>.</p>\n<p>It’s a howl that comes from deep in his chest and he <em>knows</em> he’s a beta, knows he can’t shift any more than he already has, but something is twisting inside him, hot and sharp, but not painful and-</p>\n<p>There’s a flash of blue, a rush of energy, and then Derek dimly recognizes that he’s lower to the ground, but it doesn’t register as wrong.</p>\n<p>He just deepens his howl into a growl, barrels through the ring of betas, and goes and stands where he’s meant to be.</p>\n<p>Between Stiles and <em>threat.</em></p>\n<p>Between Stiles and his pack.</p>\n<p>Between Stiles and anything.</p>\n<p>*^*^*^</p>\n<p>Stiles freezes, so surprised that he loses his grip on his magic completely.</p>\n<p>Scott grabs him and pulls him back, shouldering his way forward so that he is at least half between Stiles and the <em>giant wolf</em> and Stiles doesn’t bother pushing back because-</p>\n<p>He is fairly positive that wolf is <em>Derek.</em></p>\n<p>Derek Hale, Derek. The Derek Hale who, upon last check, was a regular werewolf. Nicer than the werewolves Stiles has known before, a little socially awkward, to be honest, given to often communicating with grunts and eyebrows but not an <em>actual wolf</em>.</p>\n<p>At least the shock of it all means that no one is currently trying to kill them</p>\n<p>Or maybe that’s Derek. Because when one of the Betas around the edge of the circle takes a step forward, Derek turns and <em>growls¸</em> rumbling rising from deep in his throat.</p>\n<p>“Stiles,” Scott suddenly says, his voice a near-whisper that Stiles is sure all the werewolves hear anyway. Even the ones who have halted in their retreat at the top of the stands and are now simply staring. “This must be what they were trying to do.”</p>\n<p>Stiles blinks. Looks at Scott and then back at Derek.</p>\n<p>“The Alphas,” Scott says, his voice lower and hoarser than Stiles’ remembers, though maybe that’s from disuse. “When they go through those phases where they drain you more often, when-how did he-”</p>\n<p>Scott cuts off and Stiles would think it was in anger except Scott never gets angry and then he doesn’t have time to worry about it because the Alpha in the middle growls and steps forward.</p>\n<p>“What did you do to <em>my son</em>?” Her voice is mangled from talking around fangs. She takes another threatening step forward, and this time Derek moves to match her. He doesn’t growl but his ears go back. She stops moving and when she looks up at him again, she looks horrified enough that Stiles feels he should answer.</p>\n<p>“Umm,” Stiles starts. Of course, he doesn’t actually <em>have</em> an answer. How had Derek turned into a <em>wolf</em>?</p>\n<p>“Stiles didn’t do <em>anything</em>,” Scott protests. “To get that to work, your <em>son</em>,” Scott directs a glare of judgment down at Derek. “Would have had to drain Stiles for <em>weeks</em>.”</p>\n<p>Stiles blinks, finally putting Scott’s first statement together. Right. The Alphas did go through periods where they let a single one of them drain all the emissaries as often as possible, and Stiles and Scott had long theorized that they must be trying to <em>achieve</em> something but-</p>\n<p>“I-I’m not drained,” he says, concentrating for a moment to double-check that’s true. It is. His magic is… calmer now, but it’s still there. Waiting. Ready for him. “Derek never drained me.”</p>\n<p>He glances at Scott as he says this, trying to reassure him that’s he’s not lying.</p>\n<p>“Derek,” Talia repeats, slowly. Her voice is on the edge of a growl. Around the circle, the other beta werewolves suddenly tense. The wolf presumed to be Derek snarls. “How did you know his name?”</p>\n<p>Shit. Stiles really needs Derek to have vocal chords again. Like right now.</p>\n<p>“I, uh,” Stiles tries. “He-”</p>\n<p>“You know what, it doesn’t matter,” Talia says. “Change him <em>back</em>.”</p>\n<p>“I didn’t change him <em>into</em> a wolf!” Stiles protests. He has to get Scott out of here. And figure out how to change Derek back and he can’t do that if he’s dead. Or two seconds away from being dead. He just needs-</p>\n<p>“Maybe if you all took a step back,” Scott suddenly suggests, his head cocked to the side as he looks at Derek. “He seems a little… protective.”</p>\n<p>That’s certainly one way to put it. Derek looks coiled to spring at anyone who so much as scratches an itch. Scott is a genius.</p>\n<p>The oldest of the Alphas – Stiles is pretty sure her name is Satomi, based on Derek’s description – steps back first, as do four of the werewolves around the circle. The male, Olin, is next, which leaves just Talia and one dark haired beta, who must be Laura.</p>\n<p>Stiles is about to open his mouth to tell them that they don’t have to back up, that Derek already seems more relaxed, but they step back almost in unison.</p>\n<p>Not too far back though. To be honest, Stiles suspects they could leap forward and kill them both in an instant, maybe even using his preoccupation with Derek as a distraction.</p>\n<p>He flicks his eyes to Scott, who raises one eyebrow and tightens his grip on his sword ever so slightly.</p>\n<p>Well, at least Scott is ready.</p>\n<p>“Okay,” he breathes. He takes it as a good sign that Derek’s ears are forward again. “Derek.”</p>\n<p><br>\n<img src=\"http://i.imgur.com/ysPclAc.jpg\" alt width=\"1024\" height=\"683\" align=\"center\"><br>\n</p>\n<p>Derek turns to look at him and blinks, shaking himself.</p>\n<p>“Alright,” Stiles says, some part of him relaxing. Derek’s eyes somehow look… still like Derek. They’re intelligent and steady. “Derek, you can, uh, switch back now.”</p>\n<p>He tries to make his voice calm. Friendly, even.</p>\n<p>Derek tilts his head.</p>\n<p>Stiles doesn’t know what that means. He has become a master over the past month at dissecting Derek’s nonverbal clues but he isn’t prepared to decode <em>wolf</em> mannerisms and he doesn’t have the eyebrows and Talia Hale is definitely going to kill him. And Scott. Both of them.</p>\n<p>His heart beat must jack up or something because Derek growls again, low in his throat.</p>\n<p>“Dude,” Scott whispers. His eyes are on the Alphas, but his foot taps a rhythm on the ground. Stiles glances at it.</p>\n<p>It’s as he guessed: Scott’s foot is pointing towards the nearest exit. Three taps means there’s three werewolves in the way. They could take three, Stiles knows, if he boosts Scott with speed and blasts a wall of fire, it might be able to give them enough time but-</p>\n<p>“Derek,” he says, trying to turn his desperation into something like a command. “Change back.”</p>\n<p>Derek looks like maybe he tries then. His head goes down and he squirms a little, but it doesn’t do anything. He is still 100% a wolf.</p>\n<p>Then he lets out a whine, high pitched and-</p>\n<p>They’ll have to take Derek with them, Stiles realizes. If he has time, he can figure this out, he can save him and then Derek can come back here later. When he’s not a wolf.</p>\n<p><em>Okay</em>, Stiles thinks, mind racing. He can do this. He just needs to somehow communicate to Derek that he has to run when Scott gives the signal and then they have to get far enough away that the bonds of pack break so that he can’t be tracked, at least for a little while, and Scott will know that exact point and-</p>\n<p>“Your magic,” Satomi says suddenly. Stiles flinches but she doesn’t move, only raising her voice enough to carry. “May I see some?”</p>\n<p>Stiles freezes. Next to him Scott’s eyes squint in confusion.</p>\n<p>“What?”</p>\n<p>“Your magic,” the Alpha repeats, ignoring the fact that <em>all</em> of the Betas, including her own, tense at the idea. “I’d like you to do a little.”</p>\n<p>“It’s not really-”</p>\n<p>“A flame will do,” she interrupts. Stiles stiffens, balking at the tone, at the <em>command</em> but then Derek whines again, paw scratching the ground in distress and-</p>\n<p>“Fine,” he snaps. It’s nothing he isn’t used to. “How big do you want it?”</p>\n<p>Probably big enough to drain a good chunk of his magic, if he had to guess. But that’s okay, he’s stronger than he’s ever felt and-</p>\n<p>“As small as you can make it,” she supplies. There’s a down twitch to her lips that Stiles can’t decipher. It’s almost like she expected him to know the answer or understand it but werewolves never ask for <em>small</em>. They ask for huge and destructive and keep asking until you’re gasping and shuddering on the ground.</p>\n<p>Next to him, Derek turns to look up at him, head tilting in almost a question.</p>\n<p>Stiles concentrates.</p>\n<p>The magic leaps to him too quickly and for a moment he gasps, unprepared for the raw <em>force</em> of it. It’s always felt like rage, an anger deep inside him that’s usually gutted from him on a regular basis, but now…</p>\n<p>Making a <em>small</em> burst of flame doesn’t feel natural. It’s harder than he thought it would be to pull back instead of push forward and even when he gets the flame going, he struggles to propel it into the air without making it <em>bigger</em>. The heat pools in his fingertips and he’s not going to burn himself for the first time in years, but the pain helps him grit his teeth and pull back and what ends up shooting into the air is more than a spark, but not enough to be a threat.</p>\n<p>It still streaks up into the sky for a while. Stiles doesn’t bother watching it.</p>\n<p>“Has it always been blue?” Satomi asks. Stiles frowns.</p>\n<p>“No,” he admits. “But it’s been a long time since I’ve been so full, so I think-”</p>\n<p>Satomi’s wordless shake of her head cuts him off.</p>\n<p>“No,” she says. “Look at his eyes. They are the same color.”</p>\n<p>She’s- she’s right, Stiles realizes, looking at Derek. Against the black and dark gray coat of fur, they are dazzling. A blue too deep and bright to be normal.</p>\n<p>Oh god, he did do this.</p>\n<p>“Use your magic,” Satomi orders. Stiles lifts his head to glare at her because, okay, he <em>knows</em> that’s what he has to do but it’s not like he’s done this before and considering half the werewolves in the circle look about ready to kill him, he’s not exactly feeling particularly relaxed at the moment. Satomi seems unaffected by his glare. “You’ll probably have to touch him.”</p>\n<p>Stiles glances at Scott, a wordless plea to watch his back, and then bends down, kneeling on his good leg. Derek sits as well and-</p>\n<p>Fuck, Stiles doesn’t know how to <em>do</em> this. He’s only good at death – at launching fireballs or propelling knives forward or flinging werewolves back. Even his tricks to help Scott are only to make Scott faster and stronger so that he can fight, to make sure his lungs don’t give out.</p>\n<p>Well, actually that last one is almost close to healing. It’s not permanent but it’s <em>good</em> and—</p>\n<p>Stiles takes a deep breath and focuses. His magic bubbles up quickly, but then he pushes most of it down and reaches towards Derek, hands tinted a soft blue. He’s not used to simply holding his magic without using it, even when there is enough for him to hold. He’s never noticed how his hands glow before. Of course, maybe that is new too.</p>\n<p>His hands settle on Derek’s fur softly and, with Scott it’s just a matter of imaging how he <em>wants</em> Scott to be. It takes only an instant in battle to look over and picture Scott moving faster, of Scott being able to push back against a werewolf and <em>win</em>. His magic takes it from there, leaping out of him and into Scott and it just <em>happens</em>. He doesn’t even have to think about it anymore.</p>\n<p>“Derek,” he says, trying to will his magic into Derek’s body somehow. Except Derek feels the same way Scott does when he’s already boosted him enough. There’s nowhere for the magic to <em>go</em> because he already is as fast as he can be and as strong and-</p>\n<p>“I- I need you to come back,” Stiles whispers, clutching his fur a little harder. And it’s not just because if Stiles doesn’t pull this off, he and Scott are definitely going to get killed by werewolves.</p>\n<p>It because… he just needs Derek to be <em>Derek</em> again. He needs him to be his human-form self with his eyebrows that are constantly dancing across his face and revealing his true emotions and his oddly gentle voice that has never yelled at Stiles, not once, not even when he deserved it. He needs the stubble across his face that Derek rubs at when he’s embarrassed and the soft laugh that bubbles out of his chest when Stiles manages to use humor as something other than a defense mechanism.</p>\n<p>He needs his eyes back. These blue ones are beautiful but he needs <em>Derek</em>’s eyes, the green, hazel, <em>captivating</em> eyes that glint in the moonlight and-</p>\n<p>He feels when his magic starts to flow into Derek, softly and slowly. A tug so slight that he doesn’t seem to actually be losing any, as if it’s drawn from a different source entirely. For a moment, that worries him but then Derek shudders beneath him, his fur disappearing in favor of skin and-</p>\n<p>Yup, Stiles is now holding a naked Derek by the shoulders. In front of his mother. Who wants to kill him.</p>\n<p>“Alright,” Stiles says, standing and taking a step back as one of the betas steps forward to hand Derek his clothes. “This has been very nice. We’re just,” - he waves a hand between him and Scott – “Just gonna take off now. Back to our side of the woods.”</p>\n<p>Luckily all the betas seem a little shell-shocked and the Alphas haven’t taken their eyes off Derek, who is still blinking and looking a little out of it. Scott grabs his shoulder and pulls him back, seemingly agreeing with his plan to get the hell out of here.</p>\n<p>“Good times,” Stiles continues, backing up another step. “Derek, thanks for the- er, you know. Not killing. Thanks to all of you, actually. It’s been a lot of fun. So, we’ll see you. Around.”</p>\n<p>If the stunned silence holds for another few seconds, he and Scott can make a break for it. He already feels Scott getting ready to leap into action.</p>\n<p>“Stop,” this time the order is from Talia, who sounds completely unreadable. “You aren’t going anywhere.”</p>\n<p>Stiles glances towards the exit of the ring. Considers it. Seriously considers it. The werewolves are pretty stunned, they aren’t angry anymore since he fixed Derek and the plan still stands. If they move fast enough, he and Scott might be able to get away but-</p>\n<p>“Stiles,” Derek grunts, taking a breath and straightening. “We said we would explain.”</p>\n<p>Scott’s grip on his arm doesn’t change, remaining neutral, content to follow whatever decision he makes, even if it means staying with the people who imprisoned and tortured him for a month.</p>\n<p>“Fine,” Stiles sighs, glaring at Derek to let him know that this is his fault. “But we’re going to need food.”</p>\n<p>Derek smiles and nods.</p>\n<p>Talia looks ready to murder him.</p>\n<p>It’s going about as expected.</p>\n<p>*^*^*^</p>\n<p>“That… that can’t be true.”</p>\n<p>Stiles scowls. Considering these are the first words out of Talia’s mouth since the whole story came out, he has to assume this isn’t going well.</p>\n<p>He can understand not believing him. He is a Fury, known for killing people and doing magic and had been hiding out in the woods with her son with ample time to brainwash him. And he’d also just turned aforementioned son into a wolf, so… yeah, no one has to trust him. But they had let Scott do most of the talking and Scott is the most earnest, trustworthy human on the planet.</p>\n<p>Scott is also currently frowning at her, as if personally offended she hadn’t believed him.</p>\n<p>“It is,” Stiles interrupts, shifting his weight off his bad leg and wishing he could sit down. They are in Derek’s house and the three Alphas are sitting in chairs around the kitchen table but it had been made abundantly clear that Stiles and Scott are not welcome to sit. Even Derek hadn’t been offered the extra chair.</p>\n<p>They are also clearly not allowed to leave. Laura is standing by the door, and there are four Betas outside. Throw in the fact that the entire village is now on alert, ready to kill anything that moves and, well…</p>\n<p>It would be quite nice if Talia and the other Alphas believed them.</p>\n<p>“Mom,” Derek starts.</p>\n<p>“Don’t,” Talia commands, throwing a glare at Derek that silences him immediately. Stiles has never really considered what sort of trouble Derek could get in for disobeying his Alpha but he’s starting to think they’ll have to take him with them when they bust out of here. Just to be safe.</p>\n<p>“It is true,” Scott says, eyes cutting between Derek and Stiles. “I mean… how would we make this up?”</p>\n<p>“There is no such thing as a pack of <em>Alphas</em>,” Talia says. Next to her Olin nods in agreement.</p>\n<p>“But there is,” Stiles says, stepping forward. “We think they all killed their own Alpha years ago and then their betas to get stronger. It’s what they <em>do</em> when-”</p>\n<p>He stops himself abruptly. Adding that detail isn’t going to make the werewolves feel any more inclined to help them. After all, the humans are the ones that capture those betas in the first place.</p>\n<p>“When they what?” Satomi cuts in, speaking for the first time. Her voice is iron but Stiles and Scott still glance at each other.</p>\n<p>There’s no hiding it though. Not now.</p>\n<p>“When we capture betas,” Scott finally says softly. “That’s- They get forced into a pack and then-”</p>\n<p>Scott stops. He is never going to be able to say it. Scott can’t even watch.</p>\n<p>“Whoever is technically their Alpha kills them,” Stiles finishes. “We think it makes them stronger. Or that mixed with the emissary magic they usually take right after.”</p>\n<p>Scott is the one that believes emissary magic might have something to do with it. Stiles thinks it’s just a rush for them. He thinks they like slashing their claws across a beta’s throat and then sinking them into an emissary without even wiping off the blood first.</p>\n<p>When he glances over again, all the Alphas have paled.</p>\n<p>“That’s,” Olin says. “That’s <em>impossible</em>.”</p>\n<p>Stiles squints. Definitely not impossible. He’s seen it. He’s been there.</p>\n<p>“To kill your own beta is… an <em>abomination</em>,” Satomi says and even she sounds shaken. “It’s…”</p>\n<p>“It’s a lie,” Talia says and her voice is firm. She’s made up her mind. “This entire story is <em>ridiculous</em>.”</p>\n<p>“Why would we lie?” Stiles tries, not bothering to keep the annoyance from his voice. He had been afraid that the werewolves wouldn’t want to help, that decades of attacks would mean that it didn’t matter if the humans were being controlled by outside forces. He assumed that if he were allowed to tell the full story, they would at least <em>believe</em> him.</p>\n<p>“I don’t know,” Talia growls. “To save your own skin, or, more likely, to lead us into a trap. What I <em>do</em> know is that you’ve already brainwashed my son and somehow <em>turned him into a wolf</em> and-”</p>\n<p>“Stiles didn’t brainwash me!” Derek says, stepping forward and finally getting a sentence in. “He wasn’t even <em>awake</em> when I found him and decided not to kill him. He didn’t do <em>anything</em>. <em>I</em> did. I decided to nurse him back to health and sneak him food.”</p>\n<p>Talia’s eye flash red. “Then I will deal with you later.”</p>\n<p>“Okay,” Derek says. “But he’s telling the truth. Are you even <em>listening</em> to their heartbeats?”</p>\n<p>“Like a Fury couldn’t learn to lie,” Talia starts, half-rising and-</p>\n<p>“I can prove it,” Stiles blurts. Both Scott and Derek turn to frown at him.</p>\n<p>“How?” Olin says.</p>\n<p>“Easy,” Stiles says, even though it’s anything but. “You can see for yourself.”</p>\n<p>He forces his voice to come out like a challenge, almost aggressive because that’s easier than being scared. It’s always been easier.</p>\n<p>They don’t realize what he’s offering right away. No one does.</p>\n<p>“We’ve already told you about the magic and the…” he stops and works saliva into his mouth. “The memory stuff. So if you won’t believe us, then use it. See for yourself.”</p>\n<p>He goes to take a step forward and finds himself pulled back.</p>\n<p>“Absolutely not,” Scott says, his voice almost a growl.</p>\n<p>“No,” Derek says at the same time, striding forward. He’s partially shifted, eyes glowing blue. “You can’t.”</p>\n<p>Stiles glares at both of them. This isn’t their decision. It’s his.</p>\n<p>“Yes, I can,” he says, focusing on Derek. Derek doesn’t get to tell him what to do. “And I’m going to.”</p>\n<p>“You are not,” Scott says. “It’s- there has to be another way.”</p>\n<p>“There isn’t,” Stiles insists. “This is easiest.”</p>\n<p>“But-”</p>\n<p>“They don’t believe us, Scott!” Stiles interrupts, letting some of his panic take over for just a moment. “They don’t believe us and there are eight werewolves within spitting distance that want to <em>kill</em> us and both of us have been away for a <em>month</em>. Our parents probably think we’re <em>dead</em> and we’re going to be if we don’t get this handled.”</p>\n<p>“They don’t even know what they’re <em>doing</em>,” Scott insists, waving a hand at the Alphas dismissively. “Stiles, it doesn’t matter if we’re alive if you’re not-”</p>\n<p>He doesn’t finish the sentence. They both know the ending anyway. It’s not like the rest of the human camp doesn’t know about Deaton, who once knew almost everything about the Alphas and who now wanders the camp having to be told when to eat.</p>\n<p>“I’m sure it’ll be fine,” Stiles repeats, glad that Scott isn’t a werewolf. That he can’t hear Stiles’ heart stutter over that sentence. He turns to Talia. “Okay. So just-”</p>\n<p>“<em>No</em>,” Derek growls again and there’s suddenly a tug on Stiles’ magic as if it <em>wants</em> to flow into Derek. Luckily, it stops when Derek turns to his mother, all challenge and anger. “Mom, if you do this, I will <em>never</em> forgive you.”</p>\n<p>“<em>Derek</em>,” Talia says and her voice is angry but Stiles hears the pitch of hurt underneath. He has his mouth open to tell Derek to just <em>relax</em> when Satomi beats him to the punch.</p>\n<p>“Derek’s right,” She says, stepping forward. “I’m sorry, Talia, but you’re too close to this.”</p>\n<p>Talia’s eyes actually flash at that and Stiles remembers Derek telling him that an Alliance between packs is rare because Alphas are not supposed to get along. They’re all too used to being in charge.</p>\n<p>“He’s your <em>son</em>,” Satomi continues. “And you have every right to be angry but we’re playing with forces we don’t understand. Anger can’t come into this.”</p>\n<p>Talia’s mouth twists into an unhappy scowl, but after a beat, she nods.</p>\n<p>“Alright,” Satomi says. “So I’ll do it. Unless, Olin, you’d like to?”</p>\n<p>Satomi inclines her head to the third Alpha in the room and Stiles has to assume it’s at least partly to make up for the display of authority she’d just made but-</p>\n<p>“No,” Scott says, stepping forward again. “<em>None</em> of you know what you’re doing. You’ve never seen what this can <em>do</em> or what <em>happens</em> or what it’s like when he can’t-”</p>\n<p>“Scott,” Stiles says. He can’t think about that right now – the hours spent yanking on his own hair, crying silently, trying so hard to <em>remember</em> her, anything about her.</p>\n<p>“I <em>have</em>,” Scott spits, ignoring him. “So this isn’t some stupid <em>Alpha politics</em> game that you are going to play.”</p>\n<p>He points to Satomi.</p>\n<p>“You’re doing it,” he orders. “Because I don’t trust any of you but at least you seem to have <em>some</em> idea what you’re talking about. So it’s you. No one else or the deal’s off.”</p>\n<p>Stiles raises his eyebrows because that’s a ridiculous statement considering this isn’t exactly a negotiation. Then raises them even higher when all three Alphas nod.</p>\n<p>“And you don’t take <em>anything</em>,” Scott continues. “Not a drop of magic or a single memory. If it feels like you’re pulling anything out, you stop. I don’t care if you want to try to kill us afterwards, you stop.”</p>\n<p>Scott doesn’t sound angry anymore, merely terrified.</p>\n<p>“I will,” Satomi promises. “You have my word.”</p>\n<p>To be honest, it doesn’t help as much as Stiles would like it to because he has no reason to trust Satomi at all, but it makes Scott relax. At least, he sags as if defeated. Which means at least he agrees.</p>\n<p>A spike of fear travels up Stiles’ spine.</p>\n<p>This is <em>happening</em>.</p>\n<p>“I don’t understand,” Derek says, shoving Laura’s hand off him when she tries to hold him back. “Why does <em>anyone </em>have to do this? Why can’t you just trust <em>me</em> even if you don’t trust him?”</p>\n<p>“Because you’re bonded,” Satomi says a bit harshly, a crack in her usually calm exterior. Even the other Alphas still to look at her. “There are stories – old stories – about werewolves whose eyes turn blue, werewolves who can work with humans and achieve the True shift but they’re <em>stories</em>. We don’t know what it means. For all we know, it means that this Fury <em>has</em> brainwashed you.”</p>\n<p>The whole room is sort of gaping at her and Stiles feels his heart start hammering. He doesn’t know what any of this means either. He hadn’t <em>meant </em>to bond Derek or whatever it was called. Fuck, he doesn’t even know what he did. Or when he did it.</p>\n<p>Derek’s mouth opens and closes but Satomi continues after barely a pause.</p>\n<p>“You’re asking us to listen to two <em>humans</em>,” Satomi continues, her voice calm once again. “No, a <em>Fury</em> and a human who want us to go to war. We have to be positive they are telling the truth. And right now, you aren’t a reliable witness.”</p>\n<p>No one says anything.</p>\n<p>“Okay,” Stiles says into the stillness. He can’t worry about what Satomi just said. About being <em>bonded</em> to Derek. He can’t. Because this is going to happen. The arguments are over.</p>\n<p>He knows his heart is hammering but that’s okay. He can do this. Or he has to. Either way.</p>\n<p>“Clear the table,” Scott orders. “He needs to lie down.” Stiles wants to disagree but can’t. The few times he’d been selected for a post-kill draining, two other werewolves had had to hold him up while another drained him and the end result was him collapsed on the ground the moment they let go.</p>\n<p>Lying down is better.</p>\n<p>“We could use my bed,” Derek offers and Stiles rolls his eyes.</p>\n<p>“It’s fine,” he says.</p>\n<p>“No,” Scott says, glaring around the room at all of them. “If you’re going to do this, let’s at least use a bed.”</p>\n<p>“<em>Scott</em>,” Stiles growls. They have to stop putting this off. It’s just making it worse. “I’ve been doing this for <em>years</em>. A table is <em>fine</em>. It doesn’t matter. Let’s just- let’s just do this.”</p>\n<p>He moves forward and sits on the table, making it clear he’s not moving. He doesn’t want to walk to Derek’s room; he doesn’t want to drag this out any more than he has to. If he does, he’ll start thinking and maybe panicking and this is no different from the hundreds of other times he’s been drained. He’ll be fine.</p>\n<p>He tries to communicate all of that as he locks eyes with Scott and he sees that his friend is still unhappy, maybe even furious, but he doesn’t argue. Just-</p>\n<p>“We’ll need a bucket,” Scott snaps, breaking eye contact first. “And a glass of water and a warm cloth. And a clean shirt.”</p>\n<p><em>You’re pushing it</em>, Stiles wants to say because they’ve never had those things before, but he doesn’t. Partly because Laura is already moving to get them and partly because fear has closed his throat.</p>\n<p>He needs to get this over with. If he doesn’t, he might back out.</p>\n<p>So, he takes a breath and lays down, feeling his chest warm with something like terror and hating that even though he <em>knows</em> it’s not the same, it feels like it is. The way his hip bones jut against the wood of the table and he tilts his head the same direction, so she has easier access, eyes already squeezed closed and he knows to reach his hands up and grab onto the edge of the table and-</p>\n<p>That’s when it changes. Because Scott’s never been allowed to be with him, but he’s here now and one of his hands brushes against Stiles’ until it loosens its grip on the table and transfers to Scott.</p>\n<p>And, fuck, he’s terrified. He knows Derek is there and he knows Satomi has vowed not to take anything but it would be so easy. It would be so easy for her to take everything – his magic and all his memories – and it would be so easy for them to contain Derek and kill Scott and he <em>hates</em> this. The vulnerability of being stretched out, just waiting until they do whatever they want and he’d gotten <em>used</em> to his magic. To feeling like he can fight back.</p>\n<p>He clutches down on Scott’s hand fiercely.</p>\n<p>“Stiles,” Scott starts.</p>\n<p>“Do it,” he grits out.</p>\n<p>He doesn’t flinch when Satomi touches his shoulder with one hand, or when her other rests on his neck. He doesn’t flinch because he’s learned that if you flinch sometimes they miss and then they have to come out and dig in again and the other hand holding you steady clamps down viciously and you’ll have bruises around your arm for days and if you do flinch too badly, they call in one of the others to help hold you and-</p>\n<p>It’s just better to stay still. Even when the claws come out and dig in.</p>\n<p>Stiles whimpers as her claws break the skin, the fact that the feeling is now familiar doesn’t help at all with the pain and he squeezes Scott’s hand and wonders if it’s actually worse that she’s trying to go slow because it takes her a little while to break through the muscle to the bone of his spine.</p>\n<p>And then she hits and he forces himself to remember to breathe, panting and-</p>\n<p>He was right. It is instinctual. His magic is flowing up to her, the same hot, stabbing pain piercing his body and he bites down on a groan that’s about to break free anyway.</p>\n<p>Then, suddenly it’s gone. He almost <em>feels</em> her forcibly stop draining him, a flash of heat against his spine and then the suction stops.</p>\n<p>He manages one breath of air before she refocuses.</p>\n<p>The pain is in his head this time and suddenly he can’t think.</p>\n<p>All he can do is remember.</p>\n<p>She’s thorough. She starts at his earliest memories – <em>Scott, hunger, his dad returning from battle bloodied and broken</em> – and at first she seems not to know how to move faster or skip forward and Stiles is afraid he’s going to have to relive all of it but she gains speed and-</p>\n<p>His life whizzes before him. Sword fights with Scott and finding a patch of berries that they ate before realizing they would make you sick and-</p>\n<p>There’s a gap there that he feels her hesitate over. She glides back and forth, searching for something that’s long been removed and <em>it’s gone</em>, he tries to tell her. <em>It’s gone and it’s never coming back.</em></p>\n<p>He doesn’t know if she can hear him but she gives up quickly and moves on.</p>\n<p>She speeds through most of it, through the long days of training and starving and training some more. She only pauses when it’s important, when he found out he was a Fury, when they drained him for the first time, when he witnessed his first death.</p>\n<p>He’s pathetically grateful that she only watches the first few moments of his tattoo before skipping forward. That she does the same with the moment when his family realized what had been taken.</p>\n<p>It’s only as she gets closer that he realizes she’s going to find out about the two werewolves, the two that only three people in the world know about. He thinks his father and Melissa suspect, but they’ve carefully never asked and he and Scott never volunteered the information. It’s just the three of them: him, Scott, and Derek.</p>\n<p>And now maybe Satomi.</p>\n<p>He panics, trying to jerk his head away because she can’t see that, she can’t <em>know</em> and then he tries to hide it somehow, to wrap the memories closer so she won’t find them and-</p>\n<p>\n<em>The werewolf is old. It’s the only reason he and Scott were able to defeat her on their own and Stiles is gasping, worn out from having pushed so much of his magic into Scott (not that Scott is much better and Stiles has to figure that out, has to fix that somehow) and they’ve managed to beat her, but only just.</em>\n</p>\n<p><em>“Do it,” he says, forcing his eyes to the trees and blinking away the spots that rise to his vision. They have to get Scott a band, to get him on steady rations. Stiles’ allotment isn’t enough for all four of them and they’ve both lost too much weight and so have their </em>parents <em>and he and Scott have taken to sleeping rather than training and he knows what that means and-</em></p>\n<p>\n<em>They need this. It’s why they had risked going off by themselves even though all the other teenagers stick to the safety of numbers. They can afford to get the half-ration offered those who merely assist.</em>\n</p>\n<p>\n<em>Scott and Stiles can’t.</em>\n</p>\n<p>\n<em>Scott takes a step towards the dazed werewolf and his arm is shaking as he holds up his sword. Stiles doesn’t even notice it right away because it’s been a long battle and both of them shake more often than not these days.</em>\n</p>\n<p>\n<em>He’s moving too slowly and Stiles sucks in a breath, trying to scrape the bottom of his magic and see if there’s any shred he could boost Scott with but there’s-</em>\n</p>\n<p>\n<em>“S-Stiles,” Scott gasps and Stiles finally looks over.</em>\n</p>\n<p>\n<em>Scott is terrified. His chest is heaving and his hand is spasming around the hilt of his blade and his eyes are filled with tears and- “I c-can’t. She-”</em>\n</p>\n<p>\n<em>She’s practically unconscious now, unshifted and lying in a heap almost at the edge of Stiles’ Mountain Ash circle.</em>\n</p>\n<p><em>Stiles would say they could capture her, but that would just get the other humans involved and Scott would be stuck with half-rations. The end result would be the same anyway. She’s going to end up dead and at least this way it’s quicker and they </em>need the food<em>.</em></p>\n<p>\n<em>“Okay,” he says straightening. “Okay, Scott, it’s okay.”</em>\n</p>\n<p>\n<em>He takes a step closer, careful not to disturb the Mountain Ash and then reaches and takes the sword from Scott. It’s been dosed with Wolfsbane and etched with runes Stiles learned from the other emissaries.</em>\n</p>\n<p>\n<em>It falls out of Scott’s grip too easily and Scott clutches as his shirt as he passes and-</em>\n</p>\n<p>\n<em>“Don’t look,” Stiles orders and steps forward.</em>\n</p>\n<p>\n<em>The sword slides in easier than he thought it would, but the sound is much worse and-</em>\n</p>\n<p>Mercifully, Satomi skips forward. Faster this time too and he hopes for a second that she won’t even register the next one. But,</p>\n<p>\n<em>At least it’s faster- the second one.</em>\n</p>\n<p>\n<em>It’s mid-battle and Stiles already knows that Scott can’t do it and he the werewolf isn’t old this time, merely overly confident since he is fighting two teenagers that are still too skinny by half. Regardless of the reason, he is making sloppy mistakes and-</em>\n</p>\n<p>\n<em>Stiles doesn’t think about it. He sees his opening and leaps and when he hits the werewolf’s back, he slides his blade across the man’s neck before he has the opportunity to throw him off. Warmth splashes across his hand and Scott stares at him, stunned, for half a beat before he is shaking himself and coming forward to wipe it off, taking the knife gently as he does so.</em>\n</p>\n<p><em>They don’t have time, they have to get their proof and get back with the others, but Scott takes the time to wrap his arms around him and just </em>hold him<em> and Stiles wants to push him away but he doesn’t.</em></p>\n<p>Satomi skips most of it after that. She ignores the near constant drainings and the attempts to learn to knife throw and-</p>\n<p>She gets to Derek sooner than Stiles thought she would. And she watches their first few interactions and Stiles doesn’t try to stop her, figures that this will be where she digs for clues that he’s brainwashed Derek or used some form of magic.</p>\n<p>But suddenly she’s pulling out. Before it’s even over. It’s oddly gently and he’s not sure what she’s doing at first, if she’s going to try something else but then she’s gone.</p>\n<p>As always, the blood from the wounds is what he registers first, liquid trailing down the sides of his neck now that there’s nothing holding it in and his vision doesn’t work yet, but he’s knows to use his arms to push himself up and blindly roll to the side.</p>\n<p>The wave of nausea hits and Scott’s hand in his hair directs him to the bucket. It’s not bad, just two heaves. It’s not bad. It’s usually worse.</p>\n<p>“Stiles?” Scott says, almost frantically when he finishes. “Stiles? Who are you? Who am I? What’s your dad’s name?”</p>\n<p>“Stiles,” Stiles replies, spitting once more in the bucket and sighing in relief when the warm cloth hits the back of his neck. “Scott. John.”</p>\n<p>His voice is raspy but he doesn’t ache like he usually does.</p>\n<p>“Did she take anything?” Scott insists. Wordlessly, Stiles shakes his head. He just needs-</p>\n<p>“Give me a minute,” he tells Scott, wiping one hand across his eyes. He sits up, keeping his breathing even as he swings his legs over. He’ll be able to move in a second.</p>\n<p>“They aren’t lying,” Satomi says finally. “They- it’s true.”</p>\n<p>“The Alphas?” Olin asks.</p>\n<p>“Yes.”</p>\n<p>“So the humans are innocent?”</p>\n<p>Stiles flinches at the word, keeping his eyes shut. They both know that’s not true. She knows what really happened. What Stiles has done.</p>\n<p>“Yes,” she replies, voice betraying nothing. Stiles can’t help but wonder if her heart skipped a beat. “We need to discuss this. Alone.”</p>\n<p>That’s his cue. Stiles pushes himself closer to the edge, reaching for Scott to help him steady himself as he stands.</p>\n<p>“Wait,” Talia Hale says and she’s frowning at him. Maybe in annoyance. Maybe in concern. It’s impossible to say. His vision is still too blurry to make out details. “We’ll leave. You three stay here.”</p>\n<p>Stiles blinks at her in surprise.</p>\n<p>Olin and Satomi head for the door first, marching out with only a goodbye glance of their eyes.</p>\n<p>“The guards stay,” Talia says. Stiles nods at that. Like he could forget they are still prisoners. “But they won’t come in.”</p>\n<p>“Thanks,” Scott replies, accepting the gesture with an air of caution. Talia nods.</p>\n<p>“Derek, you stay here too,” she orders. “And make sure they eat something.”</p>\n<p>And then she’s gone.</p>\n<p>Stiles isn’t quite sure what’s happening.</p>\n<p>*^*^*^</p>\n<p>After four weeks of only interacting with Stiles at the bottom of a canyon, usually in the middle of the night, it’s bizarre to have him suddenly in his kitchen, sitting in Laura’s usual spot like he belongs there, grinning as Scott introduces himself to Derek “properly” and then outright snorting as Derek fumbles to explain that he <em>didn’t</em> drain Stiles (just to clarify, because Scott had looked pretty furious earlier). It’s strange to think that this is the first time he’s seen Stiles sit in a chair, the first time he’s seen Stiles use a regular cup, the first time that Derek gets to cook for him <em>properly</em>, with a real wood stove and meat that hasn’t already been salted into jerky. For some reason, Derek is captivated by watching Stiles using a fork, his eyes helpless to do anything but track his tattoos as they flicker and dance with such a simple movement.</p>\n<p>It’s strange to see Stiles fret over someone. But when he finally slides into a chair and Scott winces as he does the same, suddenly Stiles is demanding that Scott left up his shirt so he can inspect the deep bruises that cover Scott’s ribcage and it’s clear in an instant that there are no boundaries between these two. Stiles pokes at a bruise and Scott shoves him off playfully, hand rubbing over Stiles’ cropped hair as he pushes him aside, even as Stiles suddenly catches his bottom lip between his teeth and glances up at Derek.</p>\n<p>Derek doesn’t need him to ask the question aloud. He walks forward immediately, holding a hand out for Scott to grab. Scott grins at him, already more trusting than Stiles ever was and the smile Stiles sends him over Scott’s exhale of relief is like nothing Derek has ever seen before.</p>\n<p>So, yes, it’s strange, but also <em>wonderful</em> because Stiles looks <em>right</em> somehow. His smiles are softer and rise to his face easier and he swings his head to include Derek in them, even though it makes his neck start bleeding twice more despite the “freaky werewolf healing” that usually causes them to close up faster. (<em>Can’t have us walking around with holes in our neck, dude.</em>)</p>\n<p>Scott attacks his meal with an intensity that has Stiles frowning and Derek flushing because he <em>knows</em> Scott hasn’t been fed properly in a month. But Scott is talking around mouthfuls of food anyway, demanding to hear more and more detail of Stiles’ month and, when Stiles is forced to admit that he’d spent most of it chilling in the woods, so bored he’d named a fish that he’d never managed to catch, Scott turns his open, easy smile to Derek.</p>\n<p>And so Derek talks. Or tries to. Luckily, Stiles manages to take over about half his stories – even the ones from the beginning, when Derek hadn’t even thought he’d been listening because Stiles listening while glaring and holding his knife in a white-knuckled grip.</p>\n<p>They avoid certain topics – Scott and Stiles’ parents, the “training” that Scott had been used for, the fact that Derek and Stiles are now bonded. It’s avoidance, yes, but it doesn’t feel stilted. It’s just…</p>\n<p>It’s easier to enjoy the little things. For now.</p>\n<p>Eventually, Scott starts yawning and though Derek can see that he is fighting to stay awake, Stiles is on him in an instant.</p>\n<p>“You should get some rest,” Stiles declares and then ignores Scott’s frown of protest. “Can he use your bed?”</p>\n<p>“Of course,” Derek replies and Scott opens his mouth to say something but only a yawn comes out.</p>\n<p>“Sorry,” he says eventually, standing. “I- it’s all the food I think.”</p>\n<p>“Fatty,” Stiles mutters, entirely fondly.</p>\n<p>“Muscular,” Scott corrects, even though it’s not quite true anymore. Idly, Derek wonders if it ever was.</p>\n<p>Guilt twists in his stomach and some of it must show in his face, because Stiles is suddenly jabbing him in the side, insisting that he give them the tour of the mansion and he has to insist about a hundred times that it’s alright for Scott to curl up on his bed and-</p>\n<p>And then suddenly it’s just him and Stiles again.</p>\n<p>They stand in the doorway to his bedroom, Stiles seemingly unwilling to let Scott out of his sight and maybe Derek is imagining it, but he swears he can <em>feel</em> the heat of Stiles’ magic as they stand next to each other.</p>\n<p>At least, he feels something.</p>\n<p>“You really think they’re gonna help?” Stiles asks, raising one eyebrow and one side of his mouth into a smirk that is an almost even mixture of doubt and hope.</p>\n<p>“Yes,” Derek says. He’s not lying. He’d seen Satomi’s face when she pulled her fingers out of Stiles’ neck. There was horror there, yes, but also resolve and anger and – they’re going to help. Derek knows it.</p>\n<p>“And if they don’t?” Stiles asks.</p>\n<p>“Then I will,” Derek replies.</p>\n<p>Stiles snorts and ducks his head and Derek feels an embarrassed blush start to spread across his cheeks but the next moment, Stiles is looking up at him, smiling.</p>\n<p>“Just you, me, and Scott?” he asks. His voice is light, teasing almost but… it’s a gentle tease. Happy, almost. “The three of us against a pack of Alphas?”</p>\n<p>“Sure,” Derek replies, putting some of Stiles’ usual bravado into his voice. “I can turn into a wolf now. No problem.”</p>\n<p>Stiles doesn’t say anything, not at first, and Derek assumes that they are going to talk about it, about being “bonded” or what that means or how that even <em>happened</em>.</p>\n<p>Instead Stiles just takes a breath and his eyes look towards Scott again, but he leans closer, close enough that their shoulders are touching.</p>\n<p>“Okay,” he says finally, exhaling slowly. His voice is soft, almost peaceful. “Sounds good.”</p>\n<p>Derek doesn’t nod, afraid to move lest the motion make Stiles jerk away, but he smiles and he feels like Stiles knows.</p>\n<p>\n<em>Sounds good.</em>\n</p>\n<p>End.</p>"
}