{
  "id": "470234",
  "url": "https://archiveofourown.org/works/470234?view_full_work=true",
  "author": [
    "Sparseparsley"
  ],
  "title": "Fuzzy Logic",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski"
  ],
  "additional_tags": [
    "Bodyswap",
    "Frottage",
    "Animalistic",
    "Werewolves",
    "Mildly Dubious Consent"
  ],
  "language": "English",
  "series": "",
  "published": "2012-07-27",
  "completed": null,
  "words": "6,504",
  "chapters": "1/1",
  "comments": "235",
  "kudos": "12,713",
  "bookmarks": "2,033",
  "hits": "179,566",
  "summary": "<p>Derek and Stiles switch bodies because of wizard reasons and Stiles just wants to know what that awesome scent is.</p>",
  "notes": "<p>Once again, thanks to Ro and Andrea for cheering me on and keeping me cheerful, and Dizzzylu for being an even more amazing beta than usual, since she had to face this before I even gave it a proper first edit. This was written as a fill for a prompt at the Teen Wolf Kink Meme and is set in the nebulous 'future' where stuff isn't so shitty and wizard bones are the worst thing they have to face.</p>",
  "text": "<p>“No, seriously, <em>what </em>is that <em>smell</em><em>?</em>”<br><br>\nStiles sniffs at the air above his computer screen, sure he looks stupid but also sure he doesn’t care, since it’s not his body he’s looking stupid in. And no, <em>seriously</em>. Whatever it is, it’s awesome. All warm and spicy and... green? Is green a scent?<br><br>\n“Hey, Derek, is green a scent?”<br><br>\nSacked out on the bed behind him, Derek grumbles.<br><br>\nYeah, it takes a lot of energy to be a Stiles, and Derek isn’t doing all that well with it.<br><br>\nLike, at all.<br><br>\n“You can’t go to sleep yet, man, it’s barely five. You’ll screw up my body rhythms. And I have the worst nightmares during naps, just fyi.”<br><br>\nBoy, and how weird is that? They’d switched minds or spirits or whatever, Stiles doesn’t like to think about it because words like ‘soul’ start coming up and no, okay? Just no. They’d switched minds but their actual brain masses had stayed firmly inside their respective skulls, which evidently meant that they got to dream each others’ dreams now, too, along with living each others’ lives.<br><br>\nIf Stiles never dream-eats another dream-antelope again, it’ll be too damn soon. And then there’s the dreams with fire, horrific enough that Stiles is pretty sure they’ll come along with him if he ever gets his body back.<br><br><em>When</em><em>.</em><br><br><em>When </em>he ever gets his body back.<br><br>\nHoly fuck, none of the if and all of the when.<br><br>\nBecause if he was lying a teeny bit to Peter Hale about not wanting the bite, he is <em>sure </em>of it now. He does not want the bite, he does not want to be a werewolf, he wants to be out of this mind-of-its-own body and back in his own now, now, foot stomp, now.<br><br>\nGod, this <em>town</em>. Where else, right? Where else would picking up a fucking bone in a forest equal Freaky Fur-day? Where else would wizards think it was humorous to just leave their own humeruses laying around for anyone to find?<br><br>\nWhere else would <em>wizards</em>.<br><br>\nYeah. That’s a thing.<br><br>\nWizards.<br><br>\nWizards who are <em>assholes</em>.<br><br>\nAnd now because of some Merlin wannabe, he gets to spend the rest of who knows how long inside Derek Hale’s body. And with Derek inside <em>his </em>body. Which, irony, because how often had he thought about that before, with slightly dirtier implications? Too often.<br><br>\nAnd yet never often enough.<br><br>\nSo yeah. It’s been hell, so far.<br><br>\nStiles would never admit it, but Derek has the worst of it between them. Stiles only has to control the urge to flip out and kill people here and there. Derek has to go to<em> high school</em>. Derek has to get detentions and suck at lacrosse and occasionally fall down to keep the world convinced that it’s Stiles in there. Derek has to hug the Sheriff (“No.” “Yes you <em>do</em>. You hug him or I shave you, so not kidding.”). Derek has to <em>mow the lawn</em>.<br><br>\nHave you seen the Hale house? Outdoor maintenance is not a priority.<br><br>\nNot that Stiles isn’t having a rough time, too. All these fancy werewolf instincts are easy enough to learn about at a distance, researching for Scott and all, but actually having them? So. Shitty. The urge to run, the urge to fight, to howl and hunt and stalk and hump. He doesn’t know if that last one is mostly his teenage-boy mind on werewolf or if it’s more because of Derek’s body, but it is just every form of inconvenient either way.<br><br>\nHe can’t even jerk off because it’s not his damn dick. An injustice so unfair that Stiles has given into the lesser sin of coveting just to try and balance out the universe. Coveting, in this case, means getting all the eyeful he can get his hands on whenever he has an excuse to get Derek’s body naked. He’s been taking a lot of showers, lately. Sometimes two in a row. One warm shower for the ogling of the abs and the, uh, goods (the <em>very </em>goods) and one cold one for the de-arousing afterward.<br><br>\nAnd that’s so not the worst of it.<br><br>\nNo, really. The absolute worst of it had been when he’d seen Mr. Argent a few days ago, giving Stiles-in-Derek the hairy eyeball in a thankfully populated street, and Stiles had found himself wanting to bite him and grind all up on him at the same time. What. No. What? No! If this is what it’s like being a werewolf, every no. He has no idea how they all do it.<br><br>\nOh, and speaking of ‘they’, is he ever glad he didn’t have to convince any of the pack that he was Derek. It probably would’ve been impossible anyway, even if Stiles hadn’t totally spaced out when he caught their scents and ended up starting a drugged out pack-haze touch-fest, nuzzling into their necks and crawling all over them while Derek tried to explain the whole mind swap thing. Going by the way they all turned from shocked to just as blissed out and touchy as Stiles was, he figures Derek must control the fuck out of that instinct and not let it out to play very often. Or ever.<br><br>\nWhich is silly, because the parts of that day that weren’t killer embarrassing (he’s pretty sure Isaac came in his pants and he’s definitely sure Scott bathed him with his tongue) were <em>awesome</em>. And Derek needs some awesome in his life. A thing that Stiles would have told him if he hadn’t run away after the explaining part, like some... running awayer.<br><br>\nMaybe humans and pack pseudo-orgies don’t mix.<br><br>\nSince then, Stiles has been spending most of his time either here or at Casa de Werewolf, turning his brain to mush and his eyes into dry little balls of agony while trying to figure out how to fix them. Werewolf eyeballs are inconveniently sensitive to the light of computer screens. Handy, huh? All roads have led to nowhere, so far, except for a quick conversation with Dr. Deaton that ended with some borrowed books, an ‘I’ll look into it’ and an assessing look that made Stiles think of rabbits in labs and fleeing the premises.<br><br>\nOf course, Derek is no help. What time he doesn’t spend Stilesing, he spends recuperating from Stilesing and occasionally enjoying the novelty of homework.<br><br>\nOh wait, no, that’s right, he makes <em>Stiles </em>do the all the homework still. Ha ha ha.<br><br>\nAsshat can wrestle with the lawn mower and his father’s confused, hurt faces for <em>eternity </em>for all Stiles cares.<br><br>\nExcept no, of course not.<br><br>\nBut at the same time, yes.<br><br>\nBecause here Stiles is subjecting his stupid werewolf eyes to yet more asshole wizard research while Derek snoozes on the bed like he owns it or something.<br><br>\n“Hey, furball, I mean it!” Stiles twists in his chair, throwing a balled up piece of paper at Derek’s Stiles-shaped skull. Boom, headshot, thank you werewolf vision. “No napping! Wake up and tell me if any of this sounds even remotely plausible. Because I can’t be certain, but I’m pretty sure licking tree stumps isn’t going to help us.”<br><br>\nDerek’s bare feet roll and stretch where they hang off the side of the bed, their current owner grunting himself awake. “Your teacher is an asshole.” Funny how he manages to sound sexy like that, voice all sleep-rough deep, where Stiles usually just sounds like he’s got a head cold.<br><br>\n“Who?” Stiles loses the thread of the conversation for a second as another wave of that green-spice smell breezes over him. It’s been following him around since this all started last week and if he doesn’t figure out what it is soon, he’s going to flip out. “Oh, what, Harris? What’d he do to me now? To you.”<br><br>\nDerek is silent for a moment, frowning at the ceiling. “He’s just an asshole. He kept singling me out.” He heaves himself up, slumping on the edge of the bed and rubbing his hands vigorously over the short stubble of his hair. “And he called you stupid.” He speaks it into his chest, low and muffled enough that Stiles probably wouldn’t have been able to hear it with his own ears.<br><br>\n“Uh, you also call me stupid?” Like seriously, pot on kettle judgements all over the place here.<br><br>\nDerek looks up, palms still curved over his skull. He’s wearing that Derek look of pouty, angry affront. It’s super disconcerting on Stiles’ face. “That’s different.”<br><br>\n“Oh. Okay.” Whatever, Stiles doesn’t have enough spare brain cells to ask about the logic there, not when there are tree stumps to read about and smells to pinpoint. He shifts back and shoves his head under the desk, hunting the scent. “Anyway, he’s always been that way, you’ll tune it out. Oh hey, or-” His scalp skims the edge of the desk as he pulls up with a mischievous (or terrifyingly toothy, depending on who you ask) grin. “We could bring your face to visit him if you want, put the fear of Hale into him?”<br><br>\nDerek gives him a level look (with a touch of sarcasm, because that’s how Stiles’ face works). “No. You don’t have enough control yet. If he pisses you off, you might hurt him.”<br><br>\nStiles shrugs and rolls his chair away from the desk with a kick, sniffing at the air. “Fine, I was just offering.” Whatever, Derek’s the one that has to deal with Harris. “And maybe I’d have more control if you, you know-” He waves a floppy arm of accusation. “-helped me? Hooked me up with tickets to AlphaCon 2012? Seminars. Pack Orgies And You. Proper Care And Maintenance of a Nemesis. Current Best Practices in Discovering What The <em>Hell That Smell Is</em>.”<br><br>\nDerek growls, sharp frustration pulling him to his feet. Or, well, Stiles thinks that was a growl. Filtered through a human throat it came out more like a whiny groan with a stutter in it, but hey, points for effort.<br><br>\n“It’s <em>just </em>a smell, Stiles. Ignore it!”<br><br>\n“It is not ‘just’ a smell. Cheese is just a smell. Rain is just a smell. This is.. this is unignorable. It’s everywhere! Is this just how the world smells to your nose? Because you’d think it’d be a mood lifter.”<br><br>\n“And yet you won’t stop complaining about it.”<br><br>\n“Yeah, because I don’t know what it is! Come on, you have to have some idea. Green? Spice? Greenspice? Does any of this sound familiar?”<br><br>\nDerek turns away, shoulders doing that high scrunch thing that always leaves Stiles’ back tight and sore. “What does it even matter?” He picks a book off the pile on Stiles’ nightstand, one of the ones they’d borrowed from Dr. Deaton, and waves it over his shoulder. “We’ve got more important things to worry about.”<br><br>\n“We?” Because it hasn’t been ninety percent Stiles doing all the heavy eye work. Nope, ‘we’ have more imp- Wait.<br><br>\nStiles knows those shoulders, and what sort of feelings set them off. And his fuzzy superpowers are telling him he knows what the rise in Derek’s heartbeat and the tiny changes in his voice mean, too. “Oh you deflecting assmunch, you totally know what it is, I can hear it!”<br><br>\nIf anything, Derek’s back tenses up further. “No, I don’t. All you’re hearing is me getting pissed off because you won’t drop it.”<br><br>\n“Ha! No. No way. I can recognize angry-Derek just fine, thanks. Lots of little points of data to compare, there. You are <em>totally </em>lying and you’re gonna tell me, or I’ll bleach every piece of leather you own.”<br><br>\n“Stiles, it <em>seriously </em>doesn’t matter.” Oh, he actually is getting angry now, Stiles can see it in the tightness in his jaw and the twitches in his hands. If Derek was in his own body, there would be claws by now and possibly some wall slamming. But Derek isn’t in his own body, is he? Derek can be pushed.<br><br>\nStiles takes a deep breath and goes full on five-year-old. “Tell me, tell me, tell me, tell me, tell me, I can do this all night, man, tell me, tell me, tell m-”<br><br>\n“Stiles!” It must sting like hell when Derek slams his palm against the wall, fragile as Stiles knows that palm to be. Yup, definitely winning this one.<br><br>\n“Come on, I can be annoying way longer than you can be stoic, tell me, tell me, tell me, what is it, what is it wh-”<br><br>\nDerek turns on him, snarling. “You! It’s you!” His eyes are blazing, not supernaturally lit but still intense enough that Stiles shrinks back in his chair. “Jesus fucking- ” His hands run over his hair in a frustrated swipe, he’d probably be tearing at it if there was enough to get a grip on. “That’s what this body smells like. The smell. Is you.”<br><br>\nStiles blinks, dumbstruck. No way. “No <em>way</em>.”<br><br>\nDerek stares at him, intensity fading to that familiar sour look before he snorts and turns away, back to the pile of books on the nightstand. “It’s everywhere because your body’s been everywhere. Now drop it.”<br><br>\nYeah, no. No in ten languages. Stiles has to check this shit out.<br><br>\nHe’s on his feet and behind Derek in a few short steps, leaning in to take a deep breath at the back of his neck, where Stiles knows the sweat always gathers. This close, the scent comes in like a gale, whipping all through him. <em>Greenspice</em>.<br><br>\nHoly god, it <em>is </em>him.<br><br>\n“Oh my <em>god</em>.”<br><br>\nDerek hand-to-god <em>flails</em>, trying to turn around and step back in the same movement, which mostly ends up with him sideswiping Stiles and hip checking the nightstand.<br><br>\nSo it’s at least half Stiles’ body’s fault that he spends so much time trying not to hit the floor. Good to know.<br><br>\n“What the hell are you doing!” Derek backs into the wall, eyes wide, hand flying up to the back of his neck.<br><br>\nStiles follows through a haze of scent, wanting his nose back in there right damn now. He crowds Derek’s newly smaller body against the wall, stuffing his face into the curve of neck and shoulder and taking another deep sniff. “Humuhgod.” It’s even better the second time, warming him from the inside out.<br><br>\nTwo hands push all over Stiles’ face, shoving him back. Not all that far though, Stiles has freakish wolf-strength and at least one extra inch on his side, now.<br><br>\nPanting hard through grit teeth, Derek glares at him. “Get ahold of yourself!”<br><br>\nA beat of silence, and then they’re both looking down to where Stiles has his hands on Derek’s arms, fingers tight.<br><br>\nStiles flicks his eyes up again and barely has time to smirk before Derek rolls essentially his entire face. “You know what I mean.”<br><br>\n“Yeah, no, it’s fine, I just-” Stiles shifts to the other side, nosing into the fuzzy hair behind Derek’s ear. “I’ve got it under control, just let me- “ Derek’s pulse picks up, breath catching in his throat, his hands still pushing at Stiles to very little effect. If anything, the way Derek’s body is reacting just makes the scent even better, makes it less like a noses-only party and more like a freaking all-senses-invited aura or something. Stiles groans and presses in, mouth open to breathe in the full experience.<br><br>\n“Stiles! Stop!”<br><br>\n“Mmhm.” In a minute.<br><br>\nAnd then Derek knees him in the balls.<br><br>\nIt’s a pretty iffy kneeing, as far as they go. With the way they’re standing, he’s barely able to make contact. But it’s enough of a shock to send Stiles stumbling back with an alarmed grunt. “Uh, <em>ow</em>?”<br><br>\nDerek falls back against the wall, catching his breath. “You have to calm down.”<br><br>\n“Who’s not calm, I’m calm! You know what’s not calm? Kneeing someone in the junk!” Stiles gestures towards the abused goods emphatically. Which in retrospect is a bad idea because, sudden realization, he is hard enough to put up drywall with his dick. Or something.<br><br>\nDerek doesn’t notice though, he’s too busy giving Stiles shit. “You weren’t listening!”<br><br>\n“Yeah, well-” He totally wasn’t. He’s not sure he could have without the knee distraction, which should be a sobering thought but mostly just leaves him angry and tangled up in instincts and guilt. “-well. You know what? It’s my body, so I can sniff it if I want to!”<br><br>\n“Calm. Down.” Derek’s eyes squeeze shut as he breathes each word out tight through his teeth. Really, it looks like he’s not even talking to Stiles at all.<br><br>\nThe thought makes Stiles pause and cock his head to the side, sniffing at the air. The scent has morphed now, turned all hot baked wood. And Stiles remembers it. Not the same scent, no, but the same sort of redshift change. Just like when Isaac lost it in that whole pack-pile incident and had started humping Stiles’ Alpha-shin.<br><br>\nDerek is <em>into it.</em><br><br>\n“You’re totally horny.” Okay, that wasn’t the subtle yet classy insinuation Stiles had intended. Sue him, he’s busy being stunned.<br><br>\nDerek jerks, eyes flying open. “No, I- “ He stops himself, knowing Stiles can hear the lie.<br><br>\n“Liar.” Okay, so they both knew it, that doesn’t mean Stiles can’t get another point on the scoreboard.<br><br>\nDerek grunts, turning his head away. “I’m a werewolf stuck in a teenager’s body. And you were <em>sniffing </em><em>me</em>. It’s only- ” It seems like he’s struggling with the words, attention anywhere but on Stiles. His heart rate and breathing are doing very weird things, though.<br><br>\n“You’re still lying, sort of.” Stiles muddles through the mess of instincts and sense-memories in his head. “Like... half-lying. Which means. Something being left out, maybe?”<br><br>\nDerek’s eyes flick over to him, then down and away again with another twitch<br><br>\nHoly shit, Derek just checked him out. Or checked himself out. Whatever, who cares, somebody definitely just got checked out. “Oh wow.”<br><br>\nHe doesn’t know what that means, what exactly Derek is leaving out. But if it’s not just automatic reactions, if it’s something else too, then wow.<br><br>\nStiles takes a step forward, sees Derek tense up again and knows it’s not a refusal. <em>Definitely </em>knows it when Derek’s eyes lock on to his mouth.<br><br>\n“<em>Stiles</em><em>.</em>”<br><br>\nIt’s part warning and part plea, and even if it was said in Stiles’ voice, the thought of Derek pleading for anything makes Stiles’ lungs want to work double-time. “We can... “ He moves closer, licks his lips and sees Derek’s eyes go heavy and dark at the sight. Oh yeah. “We can do this. Can we do this? I mean, I think we can do this. It’s basically masturbation, right?”<br><br>\nYeah, right.<br><br>\nDerek shudders and the woodspice scent comes up rich, thick in Stiles’ nose, overpowering. It makes him want to own and he growls out around the need, crowding Derek into the wall again, not waiting for a reply.<br><br>\nHe has his nose pressed tight against the bend of Derek’s jaw when Derek must decide that the answer is yes, because suddenly they’re kissing. Oh, wow, Derek’s mouth is warm. It’s warm and wet and tasty and <em>weird as fuck</em> because it’s Stiles’ mouth. He’s kissing his own mouth and licking at his own tongue, pressing his own body against the wall while his own hands go tight around his shoulders, and it is weird as fuck, but the weird barely rates beside the knowledge that this is <em>Derek</em>.<br><br>\nThey break apart, panting for breath. “Oh god.” Stiles leans his head against Derek’s neck, hands clenching in the worn grey hoodie he seems partial to. “How do more people not want to make out with me? My mouth is amazing!”<br><br>\n“Shut up.” Speaking of amazing, even coming out of Stiles’ mouth Derek’s sex-voice is practically debilitating. All rough and growly and Stiles is kissing him again, chasing it over his tongue.<br><br>\nThey kiss for ages, bodies shifting against each other while Stiles drowns in the taste and the sound, the feel of Derek rolling into him. It only stops when Derek’s groans change, going higher and tighter. Stiles pulls back and... shit.<br><br>\nHe’s holding Derek there. Both hands wrapped around thin wrists, he has them locked to the wall by Derek’s head, holding fast even as Stiles feels the muscles under his palms flexing and pulling. “Oh, shit!” He yanks his hands back like they’ve been burnt. “I’m sorry, I didn’t-” He hadn’t even realized he’d been doing that, so lost in wanting to kiss of fuck or eat Derek right through the wall, he hadn’t had a fucking clue.<br><br>\n“It’s fine.” It doesn’t come out like an acceptance of Stiles’ apology. It comes out <em>raw</em>. Derek’s hands clench where he still holds them against the wall and his eyes slide shut. “Don’t stop.”<br><br>\nHoly crap, he likes it.<br><br>\nOne part of Stiles (one stupid part that will not succeed in its quest to keep him unsexed) wants to psychoanalyze that, make sense of it with everything he knows about Derek, but the rest of him wants that part to fuck off so he can do exactly what Derek says.<br><br>\nNot a hard choice.<br><br>\nHe’s back up in Derek’s space in a heartbeat, hands pinning his wrists against the wall, mouth seeking that taste-scent again. Derek strains against his grip, but now Stiles can tell the difference. It’s not Derek trying to get away, it’s Derek testing the power in Stiles’ hold, feeling how strong it is from the other side for once, and liking it.<br><br>\nBut Stiles can’t keep it up, not with Derek grunting into his mouth like that and rocking his hips up. It makes Stiles’ hands itch for more and he barely has any say in how they drag down Derek’s arms and curve low around his back. He knows what they want, and it’s like nothing to wrap them around Derek’s waist and lift. No effort at all the hold like that while Derek groans into his mouth and wraps long legs around Stiles’ hips, heels digging in hard to the backs of tense thighs.<br><br>\n“Oh my <em>god</em>.” Best creepy self-making-out <em>ever</em>.<br><br>\nOr, no, because then Derek takes it another step into better, tearing his mouth away so Stiles can drag teeth down a long, sweat-damp neck. “The bed- hah- Stiles, the<em> </em><em>bed</em>.”<br><br>\nWhat bed, Stiles doesn’t own a bed. All he has is this wonderful wall and two handfuls of an ass that never felt this good when it was his. He squeezes through thin material, plaid pajama bottoms because werewolves only care about style when they’re in their own bodies, and Derek makes the loudest noise yet, a sharp ‘<em>ah</em>’, before burying his hands in Stiles’ hair and yanking. “The bed!”<br><br>\nOhh, the <em>bed</em>. Also, note to self: grow the hair out even if it makes you look like a muppet, because sexy hair yanking feels fantastic.<br><br>\n“Bed, bed, yes, great plan, smart- oh god- smart thinking.” He takes a deep breath in anticipation of the effort, but once again, it’s like nothing to move away from the wall with Derek held up around him, the few steps between the wall and the bed easy and steady.<br><br>\nIt must not feel the same from the other side because Derek’s arms go tight around his neck, holding on hard enough that Stiles has to tamp down the urge to rub his face all over him and tell him everything’s okay. Because <em>really</em>. Seriously, what is a werewolf, a miserable little pile of instincts.<br><br>\nThey land soft when they make it to the side of the bed, Stiles still marvelling at how much more control he has over his muscles now, how they take the weight of two bodies leaning over with little strain. He lifts Derek again, pushing him farther onto the mattress until Stiles can crawl up after him, kneeling in between his spread legs.<br><br>\nA wave of vertigo sweeps through him as he stares down at Derek. At <em>himself</em>. He doesn’t know what he’s doing, totally inexperienced, half dazed with lust and scent, and he’s doing it with <em>himself</em>. In that second it’s all too much. It overwhelms him, makes his teeth itch and his hands ache, makes his bones want to shift and- god- “<em>Derek</em>.”<br><br>\n“It’s okay.” Derek is right there, up on one arm and into Stiles’ space with his palm rasping against Stiles’ jaw. “You’re doing fine, just concentrate on me, just- here.” He sits up and curls his fingers around the bottom of Stiles’ shirt, sweeping it up and over his head in one movement. “Here.”<br><br>\nDerek’s hands slide up his chest and along his shoulders, fingers spread wide over the dip and curve of trembling muscle. It feels so good, firm against firm. It pulls Stiles back down from the edge and he whimpers, leaning into Derek until they’re flat on the bed again, nuzzling into the hand that finds its way up his neck.<br><br>\n“You good?”<br><br>\n“Mmhm.” Stiles lets his eyes fall shut, dipping his nose into Derek’s palm and following the scent down to his wrist, powerful where the skin is so smooth and thin.<br><br>\n“Good.”<br><br>\nDeep down in the spice of skin and heartbeat, Stiles barely even senses the movement of Derek’s legs as they wrap over his hips. So it’s a shock when they go tight, lifting Derek hard against him, rolling them together through layers of cloth. Stiles gasps, hips bucking down hard against Derek. “<em>Ahh</em><em>!</em>”<br><br>\nDerek grunts in pleasure, head falling back against the blanket as the flush on his skin rises higher and hotter. Warm thighs work around Stiles’ body, drawing him in and moving in ways he’s pretty sure he never would have thought of. Stiles eases into the rhythm, finding the steadiest places to put his knees and the best angle to tilt his hips, hard to do when all he wants is to lay over Derek and let it take him.<br><br>\nStiles does something right though, because suddenly they’re there, they’re locked and tight and grinding against each other and Stiles can feel it. He can feel the hard length of Derek’s cock perfectly, dragging against his own over and over again. “Oh, holy, Derek, <em>wow</em>.”<br><br>\nDerek just nods against the bed, eyes still shut and mouth open around groaning little whimpers. Stiles tucks his face into Derek’s throat, mouth and nose working at it like he could somehow get right into the skin. He needs everything,<em>everything</em>. The sweat gathering in the dips and valleys under Derek’s shirt is close enough to smell, but that’s not enough.<br><br>\nDerek sucks in a surprised breath when Stiles pulls them both upright and yanks that ratty grey hoodie off him, rough enough that a few seams tear with a stuttering rip. Stiles growls in frustration, because of course there’s another shirt underneath, all tucked up under Derek’s armpits now. It follows the first just as fast, leaving Derek bare and pink-flushed from the waist up, chest heaving.<br><br>\nFor most of his life, Stiles has never been exactly happy about this view. How he’s paler and thinner than a lot of the other guys. Freckled, with that full body blush that just screams his embarrassment to the world. But now... <em> fuck</em>.<br><br>\nA second later they’re flat on the bed again, Stiles sighing in satisfaction as bare skin slides against bare skin. It’s so <em>hot </em>pressed together like this, and the sweat collects along Derek’s collarbone even as Stiles licks it away. He holds Derek down, spreads him out with his arms wide and loses himself in taste while they move together. Derek groans with each swipe of Stiles’ tongue, shudders every time Stiles rubs a stubbled cheek against him, cries out when teeth scrape over his shoulder or against the sensitive skin around his nipples.<br><br>\nThey never stop moving, tangled up and locked together until Derek is arcing up from the bed, spine a hard curve. His voice is strangled and whining when he can finally force it out. “Jesus, <em>Stiles</em>! I- fuck, I can’t- hold on- fucking hair trigger- <em>harder</em>!”<br><br>\nStiles is whimpering back, loses his grip on Derek’s arms as they fly up to wrap around the wide span of his shoulders. He presses down heavily against Derek’s chest, face tucked into his neck, mouth open and gasping against his throat. “Tha- <em>ah</em>! That body’s never been- with someone else- <em>god</em>! Hell d’you expect?”<br><br>\nDerek seems to contract at that, thighs suddenly like vises around Stiles’ hips, arms clawing tight. He surges up against Stiles with a strangled noise,a mixed sob and growl, clinging while he, fuck, while he <em>comes </em>in Stiles’ arms, in his bed, in his fucking<em> </em><em>body</em>.<br><br>\n“Oh my god, you’re, oh my <em>god</em>.” The scent of it hits, a hundred times stronger, a thousand time sharper, driving into Stiles’ skull and he has to- he doesn’t know- he needs- “Derek!”<br><br>\nHis body is moving almost without him, turning Derek onto his stomach and tearing at his own pants, pulling and shoving until they’re down around his thighs and his cock is free.<br><br>\nFingers twisting hard in the blanket, Derek turns his head back, voice hoarse. “Don’t-!”<br><br>\n“I won’t.” Stiles shakes his head even as he’s laying himself down over Derek’s back. He won’t, he still has enough control left to keep himself from that, from shoving Derek’s pants down and losing everything inside him just like this body wants. But even the thought of it, the image, has him shaking as he finds the dip between Derek’s cheeks and shoves his cock along it with a harsh whimper.<br><br>\nThe friction is strange, the thin cloth of Derek’s pants moving with Stiles and bunching up around his cock, but he still can’t keep himself from rutting against Derek’s ass, hips jerking hard as he mouths blindly at the trembling muscles in Derek’s shoulders. His teeth ache to bite and scrape along the nape of Derek’s neck and Stiles grinds them hard, snarling through the urges.<br><br>\nDerek goes rigid underneath him and, for a second, some small part of Stiles shrinks back, sure it’s fear that Derek’s showing. But it doesn’t smell like fear. It smells like, it’s not actually possible but it almost smells like Derek is coming <em>again</em>, that hot forest scent driving Stiles to grind even harder against him, riding him into the mattress.<br><br>\nAnd it has to hurt how Derek’s cock, barely spent, is trapped between his body and the growing wet spot on the bed. Stiles has always been ridiculously sensitive after he comes. But Derek only flings his arm back until he can grab hold of Stiles’ thigh and urge him on, blunt nails digging into the clenching muscle.<br><br>\nIt’s possibly the spark of pain that does it, who knows, but suddenly the curling need in Stiles’ belly is <em>urgent</em>, dragging him up. He fits one hand around the back of Derek’s neck and sets the other between his shoulders, fingers spread wide, pinning Derek flat against the bed. The pressure lifts Derek’s ass and Stiles throws his head back, crying out as he fucks against the hot curve of it. This is the moment he might break, these are the seconds where the wolf clawing in his chest might tear through and take Derek, fuck him, <em>mate </em>him. Stiles is shaking with it, voice and body both <em>howling</em>.<br><br>\nBut it can’t happen, he’s already coming, everything from his ass down to his toes flexing hard and working for as much sliding contact as possible. He soaks the band of Derek’s pants and comes all over his back in slick lines, growling in satisfaction at the sight. His hands barely keep their hold against Derek’s skin as Stiles fucks himself through it, past it, until he’s shaking, whimpering, eyes squeezed shut over the rough feel of cloth against his cock. God, he can’t stop, why can’t he <em>stop</em>?<br><br>\nIt’s Derek that finally gets Stiles’ attention, loose and pliant underneath him, repeating his name breathlessly until Stiles finally stills, calmed by the sound of it. Shuddering, he opens his eyes.<br><br>\nOh, god. Derek is <em>covered </em>in him.<br><br>\nThick lines of come pool and slide down Derek’s back, marking him, pulling Stiles to crouch down against him, weak and shivering. Stiles doesn’t know what he’s going to do until he does it, he barely knows his own name, but when he rubs his rough cheek into the wet patterns of his own come, spreading it up Derek’s back and mixing it into the smell of their skin, it only feels right.<br><br>\nHe’s panting heavily, slumped with his sticky face mashed against Derek’s shoulder when Derek finally shrugs him off and turns over. He looks about as messed up as Stiles feels, open and vulnerable in ways Stiles is too out of it to think about right now. Half on his side, Stiles only has the energy to watch as Derek leans closer and, with a carefulness that makes Stiles feel more things he doesn’t want to think about, licks at his cheek.<br><br>\nStiles whines but Derek just pushes him onto his back and finishes the job, tongue scraping against stubble. When he’s done, he licks his way to Stiles’ mouth and in, sharing the mixed flavour of them before falling back onto the bed with a breathy grunt.<br><br>\nStiles blinks at the ceiling, every part of him weak, stunned. “So...”<br><br>\nSlim fingers brush against his thigh, distracting him with the soft rub of knuckles. Eventually, after Derek turns and curls up with the skin of his back tacky against Stiles’ arm, Stiles remembers that he’d been saying something.<br><br>\n“So...”<br><br>\nWow, the entire universe smells like him and Derek now. That’s nice. That can stay. Oh right, saying something.<br><br>\n“So, I’m kind of upset that Scott never told me the finer details of awesome werewolf sex.”<br><br>\nDerek ‘<em>hmph</em>’s in reply. It’s either a laugh of the fondest ‘you idiot’ Stiles has ever heard. That can stay, too.<br><br>\nStiles speaks up again a few minutes later, because even the most intense of experiences aren’t enough to keep him down for long. “Hey, how weird would it be if I devirginized my own ass?”<br><br>\nDerek goes stiff beside him and Stiles can practically smell the denial. “No.”<br><br>\n“I wasn’t <em>planning</em>, I was just saying.” Stiles flushes, a much less obvious effect in Derek’s skin, and tries not to remember how close he got to doing exactly that.<br><br>\nDerek turns again, shifting against the wrinkled blanket until he’s facing Stiles, watching him intently. “You’ll be in the right body when that happens.”<br><br><em>When </em>that happens. Stiles swallows over the hard thump his heart takes. “You’re gonna fuck me?” He doesn’t mean for it to come out all sexy, but he can’t help it if his throat has gone dry and his voice is wrecked to shit and extra Derek-y. He can already feel this body reacting to the dirty pictures in his head and he takes a moment to reflect on how unfair it is if the werewolf recovery bonus extends to dicks as well. He has time to think about it since Derek is just staring at him, eyes tracking over Stiles’ face like he’s trying to see under it to the actual Stiles inside.<br><br>\n“Yes.” It doesn’t seem like a threat or a promise when Derek finally answers, it’s more like a certainty. A truth.<br><br>\n“Oh.” Stiles blinks and tries to keep from staring at Derek’s mouth. The whole sex haze is finally clearing and being attracted to his own face is starting to get weird again. “Okay.” He was a sure thing anyway, so he supposes it’s good to know that Derek is on the same page.<br><br>\nObviously done with the conversation and the act of conversing in general, Derek turns away and curls up against Stiles’ side again. It’s sort of surprising that he doesn’t want a shower, or at least a towel or something, but if smelling like sticky sex and werewolf from head to toe doesn’t bother him, Stiles isn’t going to complain.<br><br>\nShit, he’d bite his tongue off first. And with this mouth that is not an empty threat.<br><br>\nHis mind circles while they lay there, buzzing around school and pack and asshole wizards who he’s feeling just a little magnanimous toward right now but who still need their dead teeth kicked in, before coming back around to werewolves and the sexing thereof.<br><br>\n“Hey, Derek?”<br><br>\nThere’s no answer, but he’ll take the slight change in Derek’s breathing as a ‘yes, Stiles, I am paying attention, your sexual prowess has simply robbed me of my ability to speak’. Or possibly just a ‘yes, Stiles’.<br><br>\n“Why isn’t everybody all over me if I smell this good? All the pack, I mean” Because Peter sort of had been, but that bit of knowledge is packed away in a box labeled ‘Nope’ and thrown into the very dustiest corner of Stiles’ mind. “It’s not like they’ve had a lot of practice controlling their shit like you have.”<br><br>\nOn the tail end of a sigh that was definitely edging toward a snore, Derek answers. “'s different for everyone, you don't smell like that to them.”<br><br>\n“Oh. So why do I smell that way to you?”<br><br>\nDerek hesitates before answering, body sleep-still but heartbeat giving him away. “Go to sleep.”<br><br>\nStiles snorts, dragging his arm up from where it's gone numb under Derek's back and repurposing it as a pillow. With his free hand, he tugs on his pants until they look somewhere in the vicinity of proper. “It's gonna suck when we're back in our own bodies and I won’t be able to sniff out when you're doing that deflecting thing any more.” No reaction, naturally. “And I can’t sleep, I have to not be here when Dad gets home.”<br><br>\nWell past half-asleep now (Derek is a born napper, who knew), Derek replies with a murmur. “‘S’fine, you’ll hear him.” With a last bit of effort, he drags himself up a few inches, taking up whatever room is left on Stiles’ arm-pillow. “Y’wake up when you feel some’n in your territory...”<br><br>\nOh, well that’s alright then. He is feeling pretty wiped now after all that sexual prowessing, no matter what his dick thinks. Derek’s dick. Their dick? Bah. Maybe the asshole wizard research can be put on hold for the night. Who knows, a fresh brain might be helpful in trying to figure out- hey.<br><br>\n“Wait, what d’you mean my territory. Derek? If anything, it’s his-”<br><br>\nDerek makes a happy rumbling noise beside him, totally gone.<br><br>\n“Derek?”<br><br>\nNada.<br><br>\nFine. Whatever. It’s not like he can’t badger answers out of displaced werewolves tomorrow just as well as he did today.<br><br>\nFiguring he may as well make the best of it, Stiles rolls onto his side and eases up against Derek’s back. With an arm around Derek’s waist and the other still doing pillow duty, he resigns himself to being the big bone to Derek’s little bone for the next hour at least.<br><br>\nHa, ‘bone’.<br><br>\nFreaking wizards.</p>"
}