{
  "id": "49010737",
  "url": "https://archiveofourown.org/works/49010737?view_full_work=true",
  "author": [
    "dove_dove"
  ],
  "title": "Drinking Buddies and Diaries",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M",
    "Other"
  ],
  "fandoms": [
    "Good Omens - Neil Gaiman & Terry Pratchett",
    "Good Omens (TV)"
  ],
  "relationships": [
    "Aziraphale/Crowley (Good Omens)",
    "Aziraphale & Crowley (Good Omens)"
  ],
  "characters": [
    "Crowley (Good Omens)",
    "Muriel (Good Omens)",
    "Aziraphale (Good Omens)"
  ],
  "additional_tags": [
    "Sad Crowley (Good Omens)",
    "Cute Muriel",
    "wingthem",
    "separated husbands",
    "Diary/Journal",
    "Late Night Conversations",
    "Jealous Aziraphale (Good Omens)",
    "Spoilers",
    "Crowley has a nice ass"
  ],
  "language": "English",
  "series": "",
  "published": "2023-07-31",
  "completed": "2023-08-13",
  "words": "31,115",
  "chapters": "12/12",
  "comments": "1,817",
  "kudos": "13,338",
  "bookmarks": "2,676",
  "hits": "142,123",
  "summary": "<p>“I read the books about you,” Muriel said matter-of-factly.</p>\n<p>Crowley wasn’t following. “The books about me?”</p>\n<p>“The letter books to Aziraphale’s friend Diary? You must know them. They must be an angel, but I don’t think I’ve ever met them before.”</p>\n<p>Crowley coughed heavily. “You’ve read Aziraphale’s diary?”</p>\n<p>Crowley finds himself in the pages of Aziraphale’s diary. Muriel meets ducks.</p>\n<p>Aziraphale learns of the Earth Observation Files.</p>\n<p>This one veers a bit angsty. I’ll make it up to you all, I promise.</p>\n<p>Two diary entries in this one! Crowley comes to a decision and Muriel sells a book.</p>\n<p>Crowley and Muriel scheme. And drink.</p>\n<p>Stuff happens. Crowley finds his best friend.</p>\n<p>Aziraphale and Crowley square off.</p>\n<p>Aziraphale, Crowley, and Muriel take a trip to the sea.</p>\n<p>Muriel torments Aziraphale. Aziraphale torments Crowley.</p>\n<p>Aziraphale talks. Muriel is found out, and found.</p>\n<p>God has a few things to say.</p>\n<p>Muriel keeps their promises.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Repost! Sorry for that formatting, if you saw it!</p>\n<p>I wasn’t intending this to be a series, but you all have been so unfathomably kind and encouraging. Endless thank-yous to you all for reading and for your lovely comments. I don’t have words for how much they’ve meant to me, so I offer this chapter to you instead.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Fan artists are gifts from the Almighty!</p>\n<p>Check out this PRECIOUS fanart from Krakkagar (in comments)!!</p>\n<p>https://www.tumblr.com/heyimdove/727026172938027008/some-amazing-crowley-fanart-by-krakkagar-they</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>I genuinely don’t have the words for my appreciation for all of your comments and kudos and kindness. They really mean so, so much to me.</p>\n<p>The Goat Tavern is a real place! Never been, so if you have, please tell me if it’s cool!</p>\n<p>Surprise! Double update day! No one tell my boss!</p>\n<p>What’s this?? A third chapter in one day?</p>\n<p>Yep! A commenter said it’s their birthday. Happy birthday to you!</p>\n<p>Also, I’ve lost control of my life.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">more notes</a>.)\n</p>\n<p>…..</p>\n<p> </p>\n<p>……</p>\n<p> </p>\n<p>Okay so is it actually spelled “nicked” and not “knicked”?? Should I edit this? Very annoyed tbh</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p>Were you wondering how I was going to write myself out of last chapter? So was I!</p>\n<p>Just kidding. There’s structure. I promise. I think. I’ve written so many words, they’re all starting to look the same. You could tell me “banana, fish, gorilla, shoelace, with dash of nutmeg” and I’d be like, <i>roger that, captain. aye aye, sir. </i></p>\n<p>Are you like “okay let’s get back to the diaries and the jealousy and the emotions now”?? Never fear, next chapter’s about to be a whole bouillabaisse of it. Bouillabaisse will even be in the chapter. Lots to look forward to.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Only a few chapters left, team! We got this.</p>\n<p>*This Enoch stuff is all real lore!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>*This Enoch stuff is all real lore! Depending on your flavor (if any) of Abrahamic religion, of course.</p>\n<p>Still a few more chapters left. I want you all to know that your comments and kudos have meant the whole world to me.</p>\n<p>Maybe a few edits- I posted this fic basically in the midst of a fever dream sequence. Probably needed a wee bit more editing.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>Ah, would you look at us! So near the end!</p>\n<p>There’s one or two chapters left, but this has been so extremely fun for me that I’ll probably just start up some new fic. If you have tumblr, hit me up! I’m heyimdove. And if you’ve read this, I love you? Let’s be friends??</p>\n<p>Sorry if you saw the chapter with the messed up formatting!! I type all this on my phone in my notes app. It’s a whole mess.</p>\n<p>Our last chapter!!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_12_endnotes\">more notes</a>.)\n</p>\n<p>* this is a real serial killer who worked out of the Goat Tavern!</p>\n<p> </p>\n<p>Thank you all for reading this. It has meant the entire world to me that you did, and left kudos and comments and treated me so kindly. 30k words and so many new friends later, I really couldn’t be more in awe of this fandom.</p>\n<p>Someone asked if they could use my fic for fanart purposes, so to all fan artists, please know that making such art will kill me. Please kill me. I’m begging you to kill me.</p>\n<p>Thank you so very much for your support. Please look out for new fics (possible companion piece?) in the future- but for now, I gotta give these thumbs a break.</p>\n<p>My endless gratitude and love,<br>Dove</p>\n<p>hello :). Thank you for reading!</p>",
  "text": "<p>Soho was the last place Crowley wanted to be, and yet, the one place he always seemed to end up.</p>\n<p>There wasn’t anything for him here except a few hundred years’ worth of memories, punctuated neatly with one so terrifically awful that it felt like a stab wound whenever it popped into his mind uninvited. Every inch of this block was layered in the ghosts of an angel.</p>\n<p>The street felt hollow without him, <i> like looking at where the furniture isn’t. </i></p>\n<p>But here Crowley was, again, late at night so that he wouldn’t catch Maggie’s pitying gaze or Nina’s regretful one. He didn’t blame them for what happened, but he couldn’t bare to look at them now, not now that they knew it was all over. Their advice had done something worse than not work.</p>\n<p>He glanced at his watch, dark and shiny and sleek- a manifestation of everything he wanted to convey about himself to the outer world. Aziraphale was the only one who saw something different there. Saw under it.</p>\n<p>It was 2:12 AM. All the shop lights were off.</p>\n<p>All except one.</p>\n<p>For one desperate, manic moment, Crowley thought Aziraphale had returned. The light on was the one the angel left when it was late but he was still reading. The figure under the light wore a cream tartan dressing gown, but their hair was dark and their skin olive. Not Aziraphale.</p>\n<p>Crowley stood there for a moment, thinking about his last time in that little shop. Thinking about the last time he’d touched Aziraphale. They’d kissed. The memory was like a block of ice.</p>\n<p>It hurt. It hurt to have the knowledge that Aziraphale’s lips felt exactly as Crowley had expected. Every other facet of that moment was terribly different from what he had imagined.</p>\n<p>It was foolish to come down here. He gazed into the shop, desperately aware that he was only hurting himself by being so near it.</p>\n<p>In a moment of shock, he realized that he’d been staring at the angel in the bookshop, and that the angel was now staring back.</p>\n<p>They looked at each other for a moment. Then, Muriel’s face bloomed into a wide smile and they waved enthusiastically.</p>\n<p>“Oh god,” murmured Crowley, turning away and walking down the street. The Bentley wasn’t too far.</p>\n<p>“Um, wait! Hello!”</p>\n<p>Crowley stopped, exhaling. He could hear the angel’s feet pattering behind him and wanted to run, but he detected a note of sharp eagerness in their voice. Their loneliness was palpable even at a distance.</p>\n<p>“Crowley? What are you doing out so late?”</p>\n<p>“I’m a demon, we’re practically nocturnal.” He turned to face them.</p>\n<p>“<i>Are</i> you still a demon, then?”</p>\n<p>Muriel’s tone was entirely different than Aziraphale’s had been, so long ago. Crowley didn’t have the desire to respond with a quip now.</p>\n<p>“Yes,” he said flatly.</p>\n<p>“Oh,” they replied, a little bemused. “I thought if you <i>weren’t</i> on Hell’s side, it meant you were something else…” The angel trailed off, thinking. “Well, it’s lovely to see you again anyway! Would you like to come in? I’ve got, um, whisky?”</p>\n<p>Crowley’s eyebrows shot up. He was surprised to hear Muriel knew what whisky was, let alone that they had any. Then it hit him- the whisky was probably the bottle Aziraphale kept on hand for when Crowley was in.</p>\n<p>“I don’t think- I don’t-.“ Crowley’s hands were up in front of his chest as he backed away slightly, as if he were talking down a gunman.</p>\n<p>“Oh, right. Of course. Sorry,” Muriel replied, obviously crestfallen. “Sorry to interrupt.”</p>\n<p>Muriel turned to go back to the bookshop, leaving a sour feeling in Crowley’s stomach. He knew all too well what it was like to be lonely on Earth. How much effort it took to belong there.</p>\n<p>“Wait,” he groaned, regretting it immediately.</p>\n<p>Muriel turned around with a dazzling smile. “Oh, yes, sorry?”</p>\n<p>He groaned once more, then stomped up to them.</p>\n<p>“Why do you want to be my friend?”</p>\n<p>Muriel’s head tilted like a confused dog. “Um, well, I don’t know what to say! Why wouldn’t I want to be your friend?”</p>\n<p>“Why would you? I’m a demon, remember?”</p>\n<p>Muriel smiled blankly back, as if they really couldn’t understand the question. Crowley sighed. “Listen. I can’t go in Az- in- in that shop, but I can sit on the stoop with you. If you’re still offering whisky, that is.”</p>\n<p>“No, silly,” Muriel began, waving their hand dismissively. “I’m <i>inviting</i> you in, you have permission-“</p>\n<p>Crowley growled. “I don’t need permission to go in there, but…I just can’t. Shall we drink or not?”</p>\n<p>Muriel beamed. “Right! Be right out!”</p>\n<p>They eagerly trotted ahead, while Crowley took his time approaching the shop as though it could blow up.</p>\n<p>His mind wandered back to the fire. When he thought he lost Aziraphale. A painful lump in his throat appeared.</p>\n<p>“One whisky, coming up!” Muriel nearly sang, clinking the bottle and two glasses as they stepped back onto the stoop.</p>\n<p>Crowley stared. “You’re not drinking any, are you?”</p>\n<p>“Well,” Muriel smiled conspiratorially. “I was thinking perhaps I ought to try some. They’re always talking about alcohol in books. I’m too nervous to drink it alone. I hear it can make you…” They swallowed cautiously, holding the bottle carefully as though not to upset it. “Drunk.”</p>\n<p>“Smart angel,” Crowley murmured. “It’s best not to drink alone if one can help it. That’s a free Earth lesson for you.” He began pouring the drinks. “Have you ingested anything before, Muriel?”</p>\n<p>“Oh no, nothing yet.” Muriel smiled trepidatiously.</p>\n<p>“And you’re starting out with hard liquor in the company of a demon?” Crowley finally laughed- it felt like ages since he had last done. There was mischief in the sound. “Perhaps I misjudged you, Muriel. Cheers.”</p>\n<p>He lifted his glass. Muriel did the same, not understanding they were meant to touch. Crowley clinked the glasses and tossed much of the drink into his mouth. Whisky was better savored, better sipped, but this was the closest he’d been to the bookshop since that day. He needed some courage.</p>\n<p>He had, of course, forgotten that Muriel did not know how to properly drink whisky. They drank as much as Crowley did and swallowed slowly, their eyes wide.</p>\n<p>“Did you like it?” Crowley asked, amused. He’d expected a little more reaction.</p>\n<p>Muriel shook their head. “Oh, no. Not at all, actually. It was worse than terrible.” Crowley grinned.</p>\n<p>“I’ve never heard such a poor review given so brightly. Here,” he said with a snap. “Try this instead.”</p>\n<p>Across the street, a small window in the front of the Drunken Donkey tinkled apart. A cup filled with a fizzy pink drink soared towards them and landed at Muriel’s feet.</p>\n<p>“Is it…whisky?” Muriel took the glass and studied it warily.</p>\n<p>“It’s a Shirley Temple. You’ll like it.”</p>\n<p>With a glance at Crowley that clearly said <i>I hope I can trust you </i>, they brought it to their lips.</p>\n<p>“Drink it slower this time, it’s bubbly,” Crowley cautioned. “And watch out for the cherries- those red round things. You’ve got to chew those.”</p>\n<p>Muriel obeyed, tipping the cup slightly and sipping slowly. Then, eyes full of confusion, they broke out into another massive smile.</p>\n<p>“Oh yes, that is MUCH nicer!” Muriel laughed. “Why does anyone drink whisky when Shrilly Tembles are available?”</p>\n<p>Crowley smiled, a bit bitter this time. “Whisky can make you feel less pain. Dulls the hurt. The taste starts to become nice when you’ve had enough of it.”</p>\n<p>“I hope I never need to drink whisky enough that I start to enjoy the taste,” Muriel said, a bit frightened. They sipped more of their Shirley Temple and watched Crowley, who had fallen into another memory.</p>\n<p>“I want to be your friend because you’re good.” The words came out of Muriel like a fact.</p>\n<p>Crowley looked at them. “How could you possibly know that?”</p>\n<p>“Well,” Muriel began in an almost business-like tone. “I’ve read nearly all the books in the shop. It hasn’t taken too long, you see; scriveners like I was are required to read quickly. Lots of texts in Heaven to refer to. Lots of records. When there aren’t many angels around to talk to, you get good at reading quick.”</p>\n<p>“But what does that have to do with me being good or not?” Crowley said, dumbfounded if not impressed. Muriel hadn’t been in the shop long. There were thousands of books there.</p>\n<p>“I read the books about you,” Muriel said matter-of-factly.</p>\n<p>Crowley wasn’t following. “The books about me? The ones that talk about me and the other demons falling out of heaven?”</p>\n<p>“Oh yes, I did read those. But I meant the ones about you and Aziraphale. The letter books to Aziraphale’s friend.”</p>\n<p>As far as Crowley knew, Aziraphale had many passing acquaintances throughout the millennia, but none he wrote books of letters to.</p>\n<p>“What friend?”</p>\n<p>“Oh, his friend Diary? You must know them. They must be an angel, but I don’t think I’ve ever met them before.”</p>\n<p>Crowley coughed heavily. “You’ve read Aziraphale’s diary?”</p>\n<p>Muriel looked completely perplexed.</p>\n<p>Crowley spoke fast. “Can you bring it out here? The book full of letters to…Diary?”</p>\n<p>“There are a LOT of them,” Muriel replied. “Which one do you want?”</p>\n<p>Crowley considered this. “I guess whatever one is about me.”</p>\n<p>Muriel didn’t move.</p>\n<p>“Is there a problem?”</p>\n<p>“All of them are about you. Can you maybe be a little more specific, please?”</p>\n<p>He groaned in frustration. “Well, gah! What do they say, then?!”</p>\n<p>Muriel got a funny look on their face. “Haven’t you read the books? If I was in a book, I’d read it all the time!”</p>\n<p>“Well, Muriel, books with the words “dear diary” in them do tend to be private.”</p>\n<p>Muriel blanched, setting down their cup. “You mean I shouldn’t have read them?”</p>\n<p>“No, you should not have,” Crowley laughed.</p>\n<p>“So, uh, I’ve probably, oh, upset the new supreme archangel? Already?”Muriel wrung their hands fretfully. Crowley pitied them.</p>\n<p>“Nah. Don’t worry about it. The Supreme Archangel of all Heaven has moved on from this life. He doesn’t care about the earth or what’s in it.” Crowley heard the bitterness in his voice and took another swig. “He left those books behind. Besides, I won’t tell if you won’t.”</p>\n<p>Muriel did not look placated. Instead, they looked frightfully concerned.</p>\n<p>Suddenly, their eyes narrowed. “Are you…trying to trick me?”</p>\n<p>“Trick you? Course not.”</p>\n<p>“I’m not as easily fooled now, you know. These books have taught me a lot. I know about orcs now, and the virtues of tilling the land, and, and- oral sex, and how to bake soufflés!”</p>\n<p>Crowley choked on his whisky.</p>\n<p>“No need to be yelling about that!” He cried, shushing Muriel. “The- the oral thing, not the soufflés…”</p>\n<p>“What I mean is that I’m not as easily tricked. You can’t just say something untrue and get away with it anymore.” They straightened their back proudly, accidentally grabbing their whisky cup instead of their Shirley Temple. “I’m not so naive.” They took a swig and choked.</p>\n<p>“What untrue thing did I say?” Crowley’s voice was rising indignantly. He was a demon, he did lie, but he hadn’t then.</p>\n<p>Muriel wheezed through the alcohol burning their throat and it occurred to Crowley that Muriel did not know how to spit. “You said Aziraphale didn’t care about the earth or anything on it, but you’re on the earth and he cares about you more than anything. You’re all he ever talks about in those letters. I think he tries to make that Diary person jealous.”</p>\n<p>Crowley didn’t want to hear it, not from Muriel and not with Muriel’s light manner. Muriel didn’t understand the weight of the message they were delivering</p>\n<p>But Crowley couldn’t stop himself. “What did Aziraphale say? To..to Diary?”</p>\n<p>“Oh, you know, just all the nice things you do for people and animals all the time even though hell would punish you for it if they knew. And especially the nice things you do for Aziraphale.”</p>\n<p>Muriel paused.</p>\n<p>“And also about how you look in your ‘sharp clothes.’ I could do with a lot less description of your outfits, if I’m honest. Totally breaks focus from the narrative, reading six paragraphs about your outfit of the day.“</p>\n<p>Crowley started to speak, but words failed.</p>\n<p>“That reminds me! Would you please stand up for just a moment?” Muriel looked up at Crowley with a curious, clinical innocence, like a child observing a bug. “And lift up the back of your jacket, please.”</p>\n<p>“Uh, what for?”</p>\n<p>“I want to understand what Aziraphale means by ‘spectacular buttocks’. The words don’t make sense to me.”</p>\n<p>Crowley’s jaw dropped. “He didn’t say that!!…?”</p>\n<p>“Strange thing to say, right? Well, aren’t you going to stand?”</p>\n<p><i>“No, I bloody well won’t!”</i> Crowley blushed scarlet and pulled his jacket tight around him. Muriel sighed, a hint of annoyance in their breath.</p>\n<p>They sat quietly for a moment. “Did he say anything else…not about my Earthly appearance?”</p>\n<p>“Sure! He loves you more than any other being. I’m sure he’s not including God in that group, of course.” Muriel giggled.</p>\n<p>Crowley really didn’t need to hear this. Not from Muriel and their buoyant giggle.</p>\n<p>“Muriel, could you show me-?”</p>\n<p>“Of course! Come on in.” Muriel started to stand, but stopped when they notice Crowley hadn’t moved.</p>\n<p>He looked up at them behind the dark glasses, voice somehow gruff and fragile at once. “I- I can’t.”</p>\n<p>Muriel considered him for a moment. “We’ll make a deal. You tell me who Diary is, and I’ll bring out either the first or the last book, whichever you like.”</p>\n<p>Crowley took one final drink, polishing off the glass. “Diary isn’t anyone, the book itself is called Diary. Diaries are meant for the author’s eyes only, typically. It’s a record of one’s life and their feelings. Very silly things to have. You write as if you’re talking to it.”</p>\n<p>In this moment, Crowley felt like Aziraphale’s diary would be the least silly thing in the world to have.</p>\n<p>“I think it sounds brilliant,” Muriel breathed. “A record…but about yourself? That you talk to like a friend, even if you don’t have any.”</p>\n<p>At that, Muriel looked embarrassed, so they scuttled off to get one of the books before racing back.</p>\n<p>“Oh, um, which one should I get, Crowley?”</p>\n<p>“The, uh, the…most recent.” His heart seemed to be burning. He was about as nervous as he’d ever been. It was like preparing to ask Aziraphale to be with him again.</p>\n<p>Muriel came back with a handsome, leather-bound book, and passed it to Crowley.</p>\n<p>“I suppose you’ll need time to read that privately, won’t you?” Muriel said, at almost a whisper, the happy tone of their voice rather tinny.</p>\n<p>Crowley looked at them. “Muriel, it’s nothing personal. I just can’t go in that shop. It’s too- too much for me.”</p>\n<p>“You have a lot of memories there.” Muriel said softly, sounding far less naive than usual. “I’m sure it hurts when…when he’s gone.”</p>\n<p>Crowley grunted, feeling like the cold, empty glass in his hands.</p>\n<p>“Hurts knowing why he left,” Crowley muttered. “That he even could.”</p>\n<p>Muriel smiled sadly. “I’m surprised myself. He talks a lot about how glad he is to be here, how he never wants to lose this place. But I suppose it’s easier to save the world if you’re the one holding the nuclear codes.”</p>\n<p>Crowley could only stare at them.</p>\n<p>“Oh, I, I read all about the Cold War,” Muriel explained awkwardly. They reached toward the leather book. “May I?”</p>\n<p>Crowley passed the diary back to them, fearful he might not get it back. Every book in the shop had been handled by Aziraphale, but these diaries felt like him. His hands slid across the pages once. It was the closest thing to touching the angel he would likely ever get again.</p>\n<p>“Ah! Here’s the section. One of my favorite parts!” Muriel’s index finger was halfway down a page near the start of the diary, and started to read aloud.</p>\n<p>\n<i>“October 18th,</i>\n</p>\n<p>\n<i>Dear Diary,</i>\n</p>\n<p>\n<i>The most marvelous thing happened today, and I must admit even I never saw it coming. That I, who knows Crowley better than anyone, and certainly longer than nearly anyone, could still find myself surprised by him speaks to the many joys of living here on Earth. It never fails to amaze. He never ceases to amaze.” </i>\n</p>\n<p>Crowley had gone very still. Muriel continued.</p>\n<p>“<i>It was, by all measures, a perfectly splendid Autumn day. The air was crisp enough to require layering, so Crowley was wearing a dark turtleneck-</i> do you mind if I skip this part? These sections make me feel…funny.”</p>\n<p>Crowley cleared his throat hurriedly and nodded, his hand gesturing more wildly than he’d intended.</p>\n<p>“Thanks,” Muriel exhaled with relief.</p>\n<p>“<i>We sat at the benches facing the pond, my Crowley to my left, as always. Some children nearby were tossing bits of food to the ducks. One looked over her shoulder and spotted us. I had never seen this child before, but she approached with a skip in her step and a smile on her face. Vainly, I assumed she was attracted by the angelic goodness I tend to exude, but when she arrived at our bench, she spoke to Crowley instead.</i></p>\n<p>\n<i>I remember you, she exclaimed. Look what we brought for the ducks!</i>\n</p>\n<p>\n<i>She held open a brown paper bag full of peas. Dear, sweet Crowley smiled in response and commended the child before sending her off to her mother again.</i>\n</p>\n<p>\n<i>What on earth was that? I asked, and I tell you, I could not have prepared myself for the answer.</i>\n</p>\n<p>\n<i>Crowley said ‘I saw them a week or so back. They were feeding the ducks rice- it’s probably the worst thing you can feed a duck, you know. So I told them to try frozen peas. Ducks love them and they won’t make their insides explode.’</i>\n</p>\n<p>\n<i>He said it so casually, but my heart seemed likely to explode itself. Crowley has always been kind to children, but in all our years, I’d never seen him teaching any how to be kinder.</i>\n</p>\n<p>\n<i>Of course, shortly after, Crowley scolded me for staring at him and threatened to cause mischief of some kind if I didn’t cease praising him at once. What he fails to understand, of course, is that I am constantly trying very hard not to compliment him. It is dreadfully difficult to be near the sole source of my joy and be tight-lipped about his endless charms. One could forgive me for not always succeeding.</i>\n</p>\n<p>\n<i>Maybe someday I will be able to lavish him with the praise he deserves and he will accept it. I pray for it- and I suspect the Almighty listens, for despite his protestations, my Crowley seems to perk up ever so slightly whenever I pay him a well-deserved compliment.”</i>\n</p>\n<p>Muriel closed the book happily. “See?” They said, as though they’d won a debate.</p>\n<p>The words meant very much to Crowley, though they didn’t fix anything. They hurt as much as they helped.</p>\n<p>“I remember those ducks,” he muttered. “Those kids.”</p>\n<p>He needed a moment to collect himself. He needed time to read more. He was still so furious with the angel, but the diary was the closest thing he had to Aziraphale. He wanted that “us time” so desperately. This was, tragically, the next best option.</p>\n<p>“Muriel, I think I’d better-“</p>\n<p>“Here,” Muriel passed the book back. “When you’ve finished, I’ll trade you for another one.”</p>\n<p>Crowley nodded. “Th-thanks, Muriel.”</p>\n<p>“Oh, and Crowley? What are peas? And where are the ducks?”</p>\n<p>“Tell you what,” Crowley said, standing up. “When I come back to trade for another volume, I’ll show you.”</p>\n<p>Muriel smiled widely, clapping softly. “Oh yes! Thank you, Crowley!”</p>\n<p>“Not a problem,” he replied, and took off down the bookshop steps. With a grin and a shake of his head, he lifted the back of his jacket up and struck his hip out to the side. He looked over his shoulder at Muriel. “Ta-ta, now.”</p>\n<p>“Oh, thank you!” Muriel said appreciatively, staring directly at Crowley’s arse with all the desirous energy of a postage stamp. “But I’m afraid I still don’t understand, really. No offense.”</p>\n<p>“Knew you wouldn’t,” Crowley laughed openly, enjoying the feeling. “Never change, Muriel.”</p>\n<p>“Oh, uh, okay.” Muriel smiled and waved before turning into the shop.</p>\n<p>They didn’t want to get their hopes up, but tonight felt…different. Tonight felt like, perhaps, something have fallen into place. Perhaps Muriel had found themselves a friend, a “drinking buddy”, a “wing-<s>man</s> them”. They had the wings for it, after all.</p>\n<p>They checked to be sure the demon had left the block. Somewhere, they could hear the engine of an old car sputter to life and speed away.</p>\n<p>Muriel approached the gateway, arms full of electric candles, and activated it.</p>\n<p>“Is anyone there?” They whispered nervously.</p>\n<p>“Hello, Muriel,” the Metatron said. “I’ll connect you.”</p>\n<p>Aziraphale’s face appeared. “Good evening, Muriel, isn’t it a bit late for you? Is everything okay?”</p>\n<p>Aziraphale’s eyes looked heavy. He reached towards a bowtie that wasn’t there and settled for smoothing out the new tie Heaven had him wearing. His suit was fine, fancy, sharp and starchy. He desperately missed his old one.</p>\n<p>“Oh, yes, sorry. Just wanted to let you know I gave him that book you asked me to give him.”</p>\n<p>Aziraphale smiled, relieved. “Jolly good work, my dear.” Aziraphale paused, his voice trembling almost imperceptibly. “Did he look well?”</p>\n<p>“Er, his corporation looked fine, but his expressions….”</p>\n<p>“Ah, of course,” Aziraphale replied dully.</p>\n<p>“Aziraphale? May I ask a question?”</p>\n<p>“Yes, of course.”</p>\n<p>Muriel gulped. “What does ‘spectacular buttocks’ mean? I asked Crowley but I don’t really understand what he showed me.”</p>\n<p>“Showed you?” Aziraphale spluttered. “Oh- I- dreadfully sorry, Muriel dear, but something’s come up- I must, uh, I must go. Goodbye now.”</p>\n<p>The gateway closed abruptly.</p>\n<p>Muriel stared at it for a few moments, then giggled to themselves.</p>\n<p>They were still learning, and many things didn’t make sense here on Earth. However, if these books taught them anything, it was that jealousy was a very powerful motivational tool when bringing split lovers back together.</p>\n<p>Muriel had already been thinking it, even before Crowley had come by. But now that they were almost friends, it was decided: Muriel would be the best wingthem ever. They weren’t so naive anymore, after all.</p>\n<p>Crowley read the dairy again and again. He read it at least six times before even considering trading it back with Muriel. It felt like a sacred text. Like a blessing bound in leather.</p>\n<p>It was for that reason he was unable to just return and get another one right away. Muriel wouldn’t have minded if he had, of course. They wouldn’t have judged how quickly he’d devoured the book because Muriel would’ve had nothing to compare his behavior to. Wouldn’t know it was desperate or odd or worthy of derision.</p>\n<p>He paced the apartment, running his hands through his hair and sighing. The flat was his again, but he didn’t like it much. It no longer felt like home. Shax’s interior decorating instincts were very different from his. Rather more slime than he’d left it. Rather more wall-licking than he liked.</p>\n<p>A few miracles got the place cleaned up, but Aziraphale’s voice echoed in his head. <i> I would always know the stain was there. Underneath.</i></p>\n<p>He hated when Aziraphale was right, especially now after Aziraphale had been so wrong. The diary had proven at least that much.</p>\n<p>The diary. It seemed filled with its own sort of divine energy. Like moonlight’s distillation of the sun, Crowley could feel Aziraphale in the pages.</p>\n<p>At first, Crowley started reading it with bitterness, disdain. At the first mention of his own name, he slammed the book shut and downed another glass of whisky. He glared at it from across the room and thought maybe he ought to light it aflame along with the rest of his memories of the angel. Perhaps the entire flat.</p>\n<p>But, of course, he did not. He drunkenly hissed and growled at the book and its infuriating author, but the closest he got to inflicting any actual damage was dog-earing the corner of a page containing a particularly wonderful passage about himself.</p>\n<p>“Take that,” he whispered, bending the corner down, knowing how his angel hated dog-earing. “That’ll teach you.”</p>\n<p>Crowley believed it very unfortunate that each and every thought the angel committed to the page reminded Crowley why his heart beat for Aziraphale, even after all this time and all this damage. Aziraphale seemed to spend every day looking for reasons to love the world. If the diary was to be trusted, it <i> appeared</i> he found what he was searching for in Crowley.</p>\n<p>The diary left Crowley’s mind swimming- a memory breached. <i> You idiot. We could have been us.</i></p>\n<p>Instead, here he was in a grey room that smelled of Shax and whisky bottles. And Aziraphale was somewhere appallingly bright and unbearably far, and perhaps they would never speak to each other again. Breathing came fast and panicked.</p>\n<p>He couldn’t bear another moment in the flat. He grabbed the diary and within moments was in the Bentley. Traveling, as always, towards Soho, as if he might find his heart there again. It was a hopeless feeling.</p>\n<p>He sped through the streets, shops passing nearly too quickly for him to make out.</p>\n<p>“Ah, wait,” he muttered to the car, who obediently screeched to a hard stop. Parking in a space that stretched to accommodate them, Crowley dashed out of the Bentley and into a fine stationary shop. He felt it was only right to give Muriel something in exchange for their assistance the other night, even if they didn’t know just how important that diary was. That was habit, wasn’t it? Tit-for-tat was how he and Aziraphale had always operated.</p>\n<p>Not that Crowley was looking for a new Aziraphale. He didn’t want one. He couldn’t possibly find one even if he did want a replacement; he was sure that Aziraphale was the finest of all <i>her</i> creations and strongly suspected that knowing the angel at all had been a divine curse. He had had his fill of that static. But he couldn’t help wonder how hard it had been for Muriel, spending the last 6,000 years without an Aziraphale of their own.</p>\n<p>By Crowley’s account, what he and Muriel had in common was that neither had a single friend. Why shouldn’t they be friendless together?</p>\n<p>He was out of the shop again very quickly, a brown bag slung over his arm. He placed it in the seat beside him where a plastic baggy full of frozen peas sat, condensation dripping threateningly in the direction of the Bentley’s fine leather upholstery.</p>\n<p>“You will NOT DRIP ON MY LEATHER,” Crowley snapped. Any water that had considered dripping seemed to freeze in place.</p>\n<p>“Good,” he growled.</p>\n<p>In a shockingly small amount of time later, Crowley parked across from the bookshop. It was a Tuesday afternoon, and the shop would be empty. No one would know why, of course, no one except Crowley. A few decades prior, Aziraphale had miracled Tuesdays in the shop to be especially, perpetually, vacant. They had often spent Tuesdays together.</p>\n<p>Crowley approached the door and found it slightly ajar as if to welcome customers. He hesitated there on the stoop. He could just knock, he assured himself. He didn’t have to enter.</p>\n<p>He rapped on the window. “Oi, Inspector Constable?” He called into the shop. “You in?”</p>\n<p>With enthusiasm nearly indecent in its intensity, Muriel popped up from behind a shelf, wearing a white, short-sleeved button-up shirt, tan slacks, and white sneakers. Crowley thought it was a perfectly acceptable getup for a bookseller. He flashed them an approving thumbs up when they approached the door.</p>\n<p>“Crowley!” Muriel said, smiling. “You’re back! Come in, come in!”</p>\n<p>“Ah…no, I won’t be doing that.”</p>\n<p>“Oh, no?” Muriel looked disappointed.</p>\n<p>“No,” he replied sternly. “But I did bring a few things by. Any customers in?” He knew the answer, but he peered in anyway.</p>\n<p>“Oh, no. No one seems to want to come in. I’m not sure what I’ve done wrong.” Muriel chewed their lip fretfully.</p>\n<p>“A mystery,” Crowley couldn’t help but grin. “Here you are.”</p>\n<p>He tossed the bag to Muriel. Their mouth fell open.</p>\n<p>“This isn’t- it’s not-for me?”</p>\n<p>“Yeeeep.” Crowley put his hands in his pockets and rocked on his feet, feeling more than a bit awkward.</p>\n<p>With a trembling hand, Muriel reached into the bag and pulled out a light blue, cloth-bound book. Lovely gold letters emblazoned across the front read DIARY.</p>\n<p>“Oh, my! It’s perfect.” Muriel breathed, awestruck. They raced to Crowley, smiling wildly, before their face fell. “It actually is perfect!”</p>\n<p>Completely perplexed, Crowley found himself patting the shoulder of a weeping angel.</p>\n<p>“There’s no need for all that, now. I kept the receipt if you’d like it,” he murmured, sounding annoyed but feeling differently.</p>\n<p>“What’s a receipt?” Muriel hiccuped.</p>\n<p>“It’s so you can give the diary back to the store I bought it from, get some money back, and buy something you’d actually like with it. Perhaps another costume? You might try impersonating a doctor next.” He smiled.</p>\n<p>Muriel clutched the diary as though it was their baby. “I could never! It’s the second gift I’ve ever been given. I love it.”</p>\n<p>Crowley groaned at Muriel’s earnestness. “Then what are you crying for? Quit it now and lock up. I told you we would go look at ducks.”</p>\n<p>Muriel nodded, pulling a large key out of their pocket. “But what if a customer wants to buy a book?”</p>\n<p>“Trust me, they won’t.”</p>\n<p>They took off down the street together.</p>\n<p>Crowley knew he ought to not care, but he couldn’t help it. “You haven’t actually been selling any books, have you?”</p>\n<p>Muriel blushed, looking a little ashamed. “Not yet, but I’m sure I will if I-“</p>\n<p>“A bit of advice for you, Scrivener. If you want to stay in the good graces of your new boss, you won’t let a single book leave that shop.”</p>\n<p>Muriel looked at Crowley, stricken. “Even the diary book I sent you off with?”</p>\n<p>It was Crowley’s turn to feel uncomfortable, like the butt of a joke. “Well, except those. I’ll bring those back.”</p>\n<p>“Right,” Muriel exhaled with relief. “Did you finish it yet?”</p>\n<p>Crowley grunted noncommittally, taking care to step on a leaf just to focus on the crunch.</p>\n<p>“I thought I’d see you much sooner.”</p>\n<p>“It’s only been four days.” Crowley wasn’t sure why he sounded defensive.</p>\n<p>“I was expecting you back the same night. Are you a slow reader? I finished The Crow Road the same day you gave it to me, you know.”</p>\n<p>Crowley glared at them. There was no reason to admit that he had finished the diary that night OR that he fought himself not to return to the shop immediately for the next unread volume.</p>\n<p>“I was busy,” he snarled.</p>\n<p>The rest of the walk to the park was as pleasant as a walk with a veritable infant could be. Sure, Muriel wasn’t crying again, but they did seem entirely enchanted by nearly everything they passed. From pay-to-use loos to overburdened dog walkers, everything elicited squeaks of excitement from the scrivener.</p>\n<p>It was actually a welcome distraction. Crowley’s mind was overlaying memories of his walks with Aziraphale over the current scenes before him. This square of pavement is where Aziraphale told Crowley off for frightening some rude teenagers back in ‘82 (1982, that is). That streetlamp lit up far too brightly when Aziraphale had drunkenly tried to light it, Christmas Eve of 1799. Well, perhaps it wasn’t the same one, but it was in the same place, anyway. The locals had called it a miracle, not knowing how right they were.</p>\n<p>And of course, that bench. Their bench. Facing the pond and the ducks. Where Crowley sat with Aziraphale on his right. Always.</p>\n<p>Crowley avoided the bench and instead stood near the pond’s edge. “Ducks,” he said to Muriel, indicating them with little enthusiasm.</p>\n<p>Muriel made up for it ten times over at least. They pulled the peas out from the baggie Crowley had brought with him, tossing them one at a time at the various appreciative if not demanding, waterfowl, and clapping excitedly whenever one snapped it up.</p>\n<p>“I’ve only read about them, this is amazing! Crowley,” they gasped suddenly, grabbing his arm and pointing as though they’d seen a celebrity. “That couldn’t be a goose, could it?”</p>\n<p>Crowley peered at the large old bird. “Keep your distance. Geese are crotchety buggers.”</p>\n<p>“Yes, yes, I know!” Muriel said completely thrilled, trotting over to the goose to get a closer look.</p>\n<p>Muriel seemed to have a gift. They soon found themselves surrounded by squawking birds. And for the better part of an hour, chose to remain a member of the flock while Crowley observed the park goers from a distance, flipping through the diary he’d been mostly unable to set down for days.</p>\n<p>“I’m so sorry, young Mr. Duck, the pea is all gone!” He heard Muriel say to the latest addition to their posse.</p>\n<p>“Pea<b>s</b>, scrivener,” Crowley corrected.</p>\n<p>“Oh yes, of course! Sorry.” Muriel turned back to the duck, “Don’t worry, I’ll come back again soon. You have my word as an-.”</p>\n<p>Crowley looked up sharply from the diary and cleared his throat with a warning.</p>\n<p>“As an- an- animal lover,” Muriel finished, glancing at Crowley for reassurance. He just nodded.</p>\n<p>What Heaven was thinking, sending this being down without any proper guidance or training, Crowley didn’t know. A worried voice in the back of his mind wondered if Heaven didn’t particularly care if mortals found them out, this late into the Great Plan. He was well aware that Armageddon was very much still a topic of discussion among the higher-ups.</p>\n<p>His eyes fell on Muriel, who was looking up at the duck, then down at their lap, then back at the duck so quickly it appeared the angel had glitched. Crowley stepped forward to see Muriel’s blue diary in their lap. Gracing the first page, Muriel had sketched a likeness of a duck.</p>\n<p>They were adding small details to the beak when Crowley’s shadow passed over the book. Muriel slammed it shut with a gasp.</p>\n<p>“Nice doodle,” he commented.</p>\n<p>“Oh, uh, thank you. I’ve actually, uh, never done that. Only ever wrote words. Never actually had anything to doodle.”</p>\n<p>“And are you enjoying it?”</p>\n<p>“It feels better than recording,” Muriel whispered quickly, as though someone would be angry at them for turning the thought into sound.</p>\n<p>Crowley let himself smile. “I like making things too. Been a while, but I understand the appeal.”</p>\n<p>“You made stars, right? Before…?”</p>\n<p>Crowley could’ve scowled, but chose not to. “That I did.”</p>\n<p>“You must be very proud,” Muriel said with a smile. “Humans all <i> love</i> the stars. Practically every book talks about them, you know.”</p>\n<p>Crowley nodded. “So I’ve heard.”</p>\n<p>“Speaking of books, remember that part in the diary where-“</p>\n<p>Crowley held up a hand. “Gotta stop you there, Constable. I really- I can’t- let’s agree to keep those diary entries quiet. You never know who might be listening. Ducks have ears, after all. Wouldn’t want your boss’s secrets in the wrong hands.”</p>\n<p>“Do they?” Muriel peered at the ducks. “Where?”</p>\n<p>“Trust me, they’re there.”</p>\n<p>“Would a duck…do…something with secrets?”</p>\n<p>“Better not to find out.”</p>\n<p>Muriel nodded in solemn agreement. They returned to their sketch with eyes narrowed, glancing at the ducks around them with heavy scrutiny.</p>\n<p>The last thing Crowley wanted was to discuss the holy pages of Aziraphale’s scriptures, many of which featured Crowley very prominently, with Muriel. He may have had demonic proclivities, but such a book club was, conceptually, far too twisted for even him.</p>\n<p>Some time later, they returned to the shop much in the same fashion as they’d left it; Muriel chattered at every mundane thing they saw and Crowley tried to think of anything but Aziraphale and failed miserably.</p>\n<p>Once at the shop, Muriel darted inside, taking the most recent diary with them. The moment it left Crowley’s hands, he’d wanted to beg for it back.</p>\n<p>They returned with a new volume, the second-most recent diary. This one had colorful papers sticking out from it. Muriel held it in front of them as if it was the happiest they’d ever been.</p>\n<p>“What’re-?”</p>\n<p>“Post It notes!” Muriel announced, anticipating the question. “Indicating all my favorite sections.”</p>\n<p>Crowley groaned. This really did feel like a book club now. He felt suddenly uncomfortable reading the diary at all. But, he was a (sort of) demon, wasn’t he? Ethics needn’t apply.</p>\n<p>Unlike the last, this book was full. Curious, Crowley flipped to a page marked by a yellow rectangle poking out the side.</p>\n<p>It wasn’t a diary entry at all. It was a sketch. Of him. Of <i> many</i> hims.</p>\n<p>In one corner, Aziraphale had drawn Crowley from the shoulders up, in profile. His mouth was neutral. It reminded Crowley of art he’d seen back in the old days, somewhere in Greece.</p>\n<p>Just under that, Crowley was stretched out, limbs spilling over the sides of what was clearly Aziraphale’s chair. His head was thrown back, exposing his neck, a wine glass looking irresponsibly loose in his hand.</p>\n<p>On the opposite side of the page, eyes. Just eyes, tender eyes, with pupil slits.</p>\n<p>Beneath that, a pink sticky note concealed a part of the page. Crowley pulled it up. He gaped, astonished to find a sketch of his backside and upper thighs in some very tight jeans.</p>\n<p>Muriel coughed beside him and looked away with an embarrassed “sorry.”</p>\n<p>Crowley was tempted to linger on the arse sketch, but just under it, two hands sat next to each other. One was thicker, wearing a golden pinky ring. The other was somewhat longer and more slender, the nails a bit sharper. The hands were nearly touching.</p>\n<p>Below that, a lanky Crowley, spreading far too much of his body across a park bench, looking to his left. Legs wide, arms draped across the back. An alert expression behind his dark glasses. Tightness in his jaw.</p>\n<p>The largest sketch by far was in the center. It was Crowley, seated at a table he knew to be at the Ritz. His eyes peered ever so fractionally over the tops of his dark glasses, and he held a wine glass aloft in a toast. His eyes looked warm, they looked loving. The Crowley in the drawing was smiling.</p>\n<p>The Crowley holding the diary was not. He battled the tears invading his eyes, willing them not to fall. He could not let Muriel see.</p>\n<p>Suddenly, he felt the warm pressure of a small palm against his back.</p>\n<p>“There, there,” Muriel said, patting him. “Lovely doodles, aren’t they? Who knew Aziraphale was such an artist! Really captured your good side.” They blanched for a second. “I don’t mean the, uh, bottom drawing!”</p>\n<p>The <i>intended</i> double-meaning wasn’t lost to Crowley. He glanced at Muriel, feeling again like perhaps he had misjudged them. He cleared his throat.</p>\n<p>“This is a bit…this is a bit too,” the words caught in his throat and he growled. “Fuck it, I need a drink.”</p>\n<p>Muriel gestured towards the shop door. “I’ve got more whisky inside, if you-?”</p>\n<p>“Nah, can’t. Let’s go to the pub.” In an instant, Crowley’s swagger had returned to his legs and hips. If he could will plants to grow better and keep a burning car intact, surely he could do the same to himself. Tonight, he’d drink, and tomorrow, alone, he’d read the diary without an audience.</p>\n<p>Muriel trotted after him, stopping at the pub’s entrance to examine a small bit of cardboard that was taped over the window Crowley broke when summoning Muriel’s drink. Crowley noticed Muriel staring, and, with a few soft gestures, the glass was healed and the cardboard fell away. </p>\n<p>“Usual order for you, Inspector?” Crowley called over to them. Without waiting for an answer, Crowley asked the bartender for a Shirley Temple and a red wine.</p>\n<p>Muriel smiled. It was fair to say that the sketches had made an impact on Crowley, but also hadn’t ruined his night. That was good. That was very good. Sure, he still wouldn’t enter the bookshop, but Muriel knew they could convince him to soon.</p>\n<p>And Muriel reported as much, a few hours after a sodden Crowley sauntered off into the night, cursing Aziraphale while cradling the diary in his arms like a protective lover. Aziraphale listened as Muriel recounted the day, anxiety in his eyes.</p>\n<p>“I’d forgotten about those sketches,” he admitted. “Dreadfully tawdry,” he muttered.</p>\n<p>“Oh, not at all!” Muriel protested. “They’re lovely!”</p>\n<p>They both cleared their throats- one of the drawings at the forefront of both of their minds.</p>\n<p>Muriel, of course, did not feel anything towards Crowley but friendship. They knew about romance and desire from books, but (happily) felt no such feelings themselves, for Crowley, his arse, or anyone else.</p>\n<p>But the Supreme Archangel didn’t need to know that. Not yet.</p>\n<p>“It took him longer to read the last diary than I expected,” Aziraphale admitted, running his necktie through his fingers. “What’s that you’ve got there, Muriel?”</p>\n<p>“Oh, this?” Muriel held up a meat pie from the pub. “I was thinking about trying food today.”</p>\n<p>Aziraphale gazed at the pie with a look of longing. “You ought to, those are splendid. Pair it with a chianti, trust me.”</p>\n<p>“Oh, no, I don’t care much for alcohol. I’ll be having a Shirley Temb- I mean, Tem<i>p</i>le with extra grenadine.” Muriel bounced on their feet at that and something in Aziraphale broke.</p>\n<p>“A Shirley Temple, you say?” He reminded himself it was not becoming for the Supreme Archangel of all Heaven to pass judgement. “Lovely,” he said, trying not to grit his teeth. “But what’s that book beside you?”</p>\n<p>Muriel held up the blue diary, which had been sitting ostentatiously beside Muriel on a table. “A gift! Crowley brought it over for me. It’s a diary of my own!”</p>\n<p>Aziraphale’s smile faltered. “Crowley- he gave you that?”</p>\n<p>“He did indeed! Look, I’ve already drawn a duck!” Muriel held up the sketch proudly.</p>\n<p>“Very nice, Muriel.” Aziraphale stared at the book, his expression seeming to mean many things at once. Love. Pride. Longing. Jealousy…</p>\n<p>Now was the time to strike.</p>\n<p>“I’d better get going, Supreme Archangel, sir.”</p>\n<p>“<i>Aziraphale</i> is fine, Muriel, as I’ve told you. Busy day tomorrow?”</p>\n<p>“Oh yes, I’ve got a new strategy to sell some books, since I had no customers today,” they began.</p>\n<p>“Ah that‘s nice- wait,” Aziraphale’s patronizing smile was quickly swapped with a look of horror. “Sell-?”</p>\n<p>“Uh oh! Gotta go! A mortal’s at the window, I think they need something!”</p>\n<p>Aziraphale closed his mouth, looking a bit more than desperate, and the gateway closed abruptly.</p>\n<p>There was no mortal at the window, but Muriel knew Aziraphale had fudged the truth here and there when needed. Muriel needed Crowley to enter the bookshop again, and Muriel needed Aziraphale to return to it, and not just as a floating head. They needed Aziraphale back in a fully-corporated, fully kissable form. They thought a lovesick Crowley would be enough, but meat pies and the threat of bookselling might be the straw to break the camel’s back.</p>\n<p>It occurred to Muriel suddenly that this might, by some definitions, be considered torture.</p>\n<p>Okay, so maybe their methods were a bit messy, Muriel reflected, returning to their duck sketch to add shading. But hey, they’d never done this before.</p>\n<p>Had anyone?</p>\n<p>Aziraphale gazed at the spot where the bookshop flickered and disappeared just moments ago. For a breath, it almost felt like he was back there. He could almost smell the books, almost taste the tea he would’ve been drinking at this time of night, had he been there. He missed everything about it.</p>\n<p>Heaven took a great deal getting used to. No books here, for a start. No coffee shops or restaurants. No (desperately needed) light dimmers. No diaries to speak of. No demons whatsoever.</p>\n<p>After six thousand years, what had once been a paradise felt rather more like walking into a toothpaste commercial. Everything was a brighter white than necessary. Unnatural. Cold in a sparkly, tingly way.</p>\n<p>It threatened a headache, so Aziraphale miracled a seat and sank into it, longing for his old red chair with the delicately carved details, that often sported a darkly-clad demon on its wooden arm.</p>\n<p>His eyes narrowed. For all he knew, Muriel was going to sell that chair, too. Maybe they already had!</p>\n<p>He groaned plaintively.</p>\n<p>Muriel. The angel reminded Aziraphale of himself, or a version of himself he hadn’t been for a few thousand years. That bothered him. He didn’t need Muriel reminding anyone <i> else</i> of a younger, arguably better, Aziraphale.</p>\n<p>It had, after all, taken Aziraphale and Crowley a few thousand years before they had drinks together, hadn’t it? It had taken Muriel and Crowley a few weeks at best to reach that milestone.</p>\n<p>Plus, anyone could see that Muriel was far less stuffy than him…</p>\n<p>Shax’s voice echoed in his head. <i> I'm a little bemused as to why Crowley should risk destruction for you. You don't seem his type at all.</i></p>\n<p>Was Aziraphale an outlier, or was there something about overly-optimistic angel types in general that got Crowley’s heart racing?</p>\n<p>Aziraphale scoffed, realizing how very silly he was being. He had nothing to worry about and he wasn’t being replaced. They were in the middle of a spat, that’s all it was. They’d had spats before. If anything, he and Crowley always ended up closer afterwards.</p>\n<p>By that logic, really, this whole mess was actually quite a good thing. Yes, when they eventually reconciled, and of course they would, everything would be better and Crowley would understand. He’d <i>understand</i> that Aziraphale really hadn’t wanted to leave; he’d needed to. Perhaps Crowley might even thank him for taking on something so hard…</p>\n<p>Silly again, Aziraphale thought bitterly. There was no guarantee of anything— this was not their usual spat. It would be a miracle if Crowley reacted the way Aziraphale wished he would…but he knew all too well that miracles didn’t work like that.</p>\n<p>He refused to think about it now. Aziraphale spun in the chair, as though looking at <i>this</i> white expanse instead of <i>that</i> one would recenter his goals.</p>\n<p>Protect the Earth. Protect Crowley.</p>\n<p>Even if the demon never talked to him again, it would all be worth it, just as long as he was safe and whole.</p>\n<p>From somewhere, Saraqael spoke.</p>\n<p>“Aziraphale, the Earth Observation Files suggest that the demons Shax and Furfur may have broken a standing peace agreement when relocating Shax back to hell. Shall we take action?” Aziraphale spun his chair back to find Saraqael very near.</p>\n<p>“Earth Observation Files?” Aziraphale perked up as Saraqael backed away, uncomfortable with the proximity. “What are those?”</p>\n<p>Saraqael stared. “The name’s rather self-explanatory, I should think.”</p>\n<p>Aziraphale raised an eyebrow at the unexpected cheek and adjusted the arms of his suit jacket. “Well!” he snipped, clicking his tongue. “How are they accessed?”</p>\n<p>“We’ve got a terminal. I’ll show you.”</p>\n<p>Saraqael sped off. Aziraphale followed, trying his very best to keep his face neutral. Unlike the other Heaven-based angels, neutral facial expressions were never really his strong suit.</p>\n<p>Soon, a great gleaming obelisk floated before them. A faintly glowing screen cast blue light across Saraqael’s wide eyes as they looked up at Aziraphale.</p>\n<p>“You request files and they appear. For instance,” they turned to face the obelisk and spoke. “SHAX. FURFUR. MOVING. FROM. FLAT. ON. EARTH. SAFE SEARCH SETTINGS ON.”</p>\n<p>The obelisk seemed to blink, and a small shelf slid out just beneath its screen. A stack of photos materialized there.</p>\n<p>“Ah, so it’s like a Google,” Aziraphale said, brightly.</p>\n<p>“I don’t know what that is,” Saraqael said dryly.</p>\n<p>Aziraphale didn’t explain. He wasn’t entirely sure he knew what a Google was either. Crowley tried to tell him once, but he took off his jumper halfway through the explanation, and— well. It couldn’t be helped.</p>\n<p>He thumbed through the pictures instead and sighed with irritation.</p>\n<p>They must’ve received good news in Hell, as Shax and Furfur were, evidently, quite enjoying their last hurrah on Earth. The photos captured the charmless things knocking over rubbish bins, throwing eggs of unknown origin at cars, tripping innocent passersby.</p>\n<p>Aziraphale clicked his tongue. “What exactly is the problem here, Saraqael? This all looks very standard,” his mouth pursed as he examined the images, unimpressed. “If not artlessly juvenile. No flair or creativity.”</p>\n<p>“Look at this here,” Saraqael snapped, feeling as though Aziraphale had quite missed the point, brandishing a photo. “An unacceptable act of aggression upon a representative of Heaven.”</p>\n<p>The Unacceptable Act of Aggression in question was the placement of a Kick Me sign on the back of one former scrivener, and the resultant kicking that followed, administered by the demons themselves. Aziraphale examined the final image in the series then ran his hands over his face with a groan. It could not be plainer that <i>Muriel</i> was apologizing to the demons, clarifying that the sign must’ve been a mistake, while the demons cackled.</p>\n<p>“So??” Saraqael was impatient. “What shall we do about this?”</p>\n<p>Aziraphale simply looked at them for a moment. The words juvenile and artless came back to mind.</p>\n<p>“Nothing, Saraqael. This is the sort of mischief human children get up to, it hardly merits a diplomatic crisis. I’ll tell Muriel to be more wary when I speak with them next.”</p>\n<p>“Understood,” Saraqael replied with a sour expression. Righteous indignation seemed to be their default setting. Aziraphale found it all very tiresome.</p>\n<p>Saraqael rolled away, but Aziraphale remained at the obelisk. When he was sure he was alone, he spoke.</p>\n<p>“Um, hello. This is Aziraphale. S-supreme Archangel of Heaven. Please, um, show me the demon Crowley. Uh, London. Earth. Today.”</p>\n<p>He paused, fist to his mouth, knuckle in his teeth, and then-</p>\n<p>“Safe search settings off. NO! No, safe settings on! Definitely on. My apologies. Wouldn’t want to see anything untoward now, would we?”</p>\n<p><i>Yes we would</i>, hissed a dark-gray voice in his head.</p>\n<p>A stack of papers appeared on the obelisk’s shelf. Hands trembling, Aziraphale took them slowly, glanced at the photo on the top, then shoved the whole stack in his jacket, wondering how he could possibly explain these documents away should anyone inquire.</p>\n<p>“I need- I need a folder. Confidential folder.” One fell into his hand.</p>\n<p>He walked quickly back to chair and sank into it. Did he really want to spy on Crowley? Muriel had already reported the day’s activities, he knew what happened. What right did he have, invading Crowley’s privacy like this?</p>\n<p>Suddenly, Aziraphale grinned. Could it really be considered an invasion of privacy when, at this very moment, the demon was probably reading one of Aziraphale’s diaries without his express permission? This wasn’t an invasion of privacy so much as a defensive counter-attack. Never mind that Aziraphale had set the bait.</p>\n<p>He exhaled sharply to steel himself and then opened the file. He quickly flipped through the pictures.</p>\n<p>Crowley and Muriel.</p>\n<p>Crowley and Muriel.</p>\n<p>Crowley and Muriel and a rather lot of ducks.</p>\n<p>Crowley and Muriel.</p>\n<p>Crowley staggering around the street, drunk and belligerent, waving goodbye. To Muriel.</p>\n<p>Of course they’d spent the day together. Aziraphale knew that. Didn’t bother him any less, however.</p>\n<p>There was an obvious trend across the snapshots. In each, Muriel was beaming at varying degrees of brightness. In some, Crowley smiled too, but it was a weak thing. In most pictures, he didn’t smile. His jaw was set and something about his posture was unlike him. It looked like he was perpetually uncomfortable.</p>\n<p>This both relieved and upset Aziraphale. He bit his lip, trying to sort out his feelings.</p>\n<p>The last few shots were of Crowley alone. Stumbling through the streets back to his flat, then evidently changing his mind and returning to the Bentley.</p>\n<p>“Oh Crowley, drinking and driving? You wouldn’t!” Aziraphale scolded under his breath at the little Crowley in the photograph, halfway in the Bentley, his leg looking impossibly long.</p>\n<p>But as far as Aziraphale could tell, he didn’t drink and drive. The next shots showed Crowley in the car, diary open, glasses removed. Scowling at the pages in one shot and then laughing in the next.</p>\n<p>Then, awfully, crying. Quite a few shots of him crying.</p>\n<p>Aziraphale hated himself for looking. How dare he intrude on this moment of pain when he was the source of it? He closed the file with force.</p>\n<p>Driven mad by his inability to make up his mind, he opened the file again. He selected his favorite of the snapshots and tucked it into his much-despised tailored suit. Then he closed the file and sent it away with a wave of his hand.</p>\n<p>The picture, tucked firmly against his heart, showed Crowley mid-laugh, eyes closed, head tilted back, diary in hand. Gorgeous.</p>\n<p>The picture convinced Aziraphale that somewhere, deep down, Crowley had to know, <i>had to believe</i>, that he was Aziraphale’s everything. And that, as long as Crowley knew it and believed it, Aziraphale wouldn’t lose him completely. And if right now his diaries were the only way he could tell Crowley that he lived and would die for him, so be it. At least the message was sent, even if too late to enjoy it.</p>\n<p>It was always too late.</p>\n<p>Aziraphale clutched the picture against his chest through his suit jacket and fought back tears. He exhaled and steadied his face in resolve. All this pain would be worth it as long as Crowley was safe.</p>\n<p>Ranking God’s most diabolical mechanisms for suffering, Crowley believed that being simultaneously overjoyed with, and utterly demolished by, one’s beloved was especially high on the list. The emotional peaks and valleys he experienced while reading the latest diary were at such spectral extremes that he felt dizzy with it.</p>\n<p>Crowley rubbed his eyes wearily. He’d stayed in the Bentley all night, drunkenly reading. Spitefully dog-earing pages, folding Muriel’s Post It notes into origami birds that stood sentinel on the dashboard, crying onto one page and seething at the next.</p>\n<p>If anything, the diary had taught him that Aziraphale was very stupid. This also ranked highly on the Suffering Scale- that is, loving someone who was hopelessly stupid, especially one who had the capacity to be irritatingly clever and yet still chose to explore other avenues. Aziraphale was always taking the scenic route of stupidity, while Crowley waited for him, foot tapping, at their destination.</p>\n<p>Crowley squeezed his bleary eyes shut, wanting to discorporate to Hell just so he could storm up the escalators to Heaven and demand to speak with management.</p>\n<p>The diary reminded him that Aziraphale was foolishly conditioned to “do good” and “be good” without properly examining either concept, but it fully clarified that, for once, Aziraphale and Crowley were entirely on the same page about one thing; they were made for each other.</p>\n<p>“Arhhh!!” Crowley flailed for a moment in the car. “Why would he do this, then?”</p>\n<p>If the Bentley knew, she didn’t tell him. Crowley sagged.</p>\n<p>“Let’s think about this rationally. Aziraphale wouldn’t abandon-“ he paused, rearranging the thought before he could speak it. “Aziraphale wouldn’t abandon the <i>bookshop </i> for a promotion. Of course he wouldnt. He genuinely thinks Heaven will change, won’t muck up our lives…in other words, he’s being a stupid, selfless, beautiful idiot.”</p>\n<p>Channeling his feelings, he flicked a plump, pink folded bird from the dashboard. It ricocheted against the windshield and landed cutely on his chest. “Bahhhgh,” he groaned. He had had quite enough of cute things.</p>\n<p>He held the bird in his fingers, glaring at it. If Aziraphale had any brains at all, he would be with Crowley and not risking the wrath of Heaven when his plan fell to pieces, as it inevitably would.</p>\n<p>“But that would be too easy, my dear boy!” Crowley said in a mockingly posh voice, holding up the origami bird and tilting it with each word as though it was Aziraphale. “Why would I ever want to make things EASY, Crowley? Don’t you know me at all?”</p>\n<p>The bird’s voice grew increasingly snarly and sarcastic. Crowley crushed it in his palm and tossed it in the seat behind him.</p>\n<p>He returned to the diary at his side.</p>\n<p>“Alright,” he murmured, “if I open this to an entry where Aziraphale talks about, about…loving me, then I’ll- I’ll make a plan. I won’t give up on this.”</p>\n<p>“And if he doesn’t, then I accept his decision and I get along with my life. Nothing lasts forever, blah blah blah, the whole shabang. I’ll wash my hands of it all.”</p>\n<p>More entries spoke highly of Crowley than didn’t. His odds were good.</p>\n<p>He exhaled. Eyes closed, Crowley opened the diary.</p>\n<p>Another exhale. He opened his eyes.</p>\n<p>This page’s entry began halfway through the prior’s.</p>\n<p>\n<i>“…believe that, but Crowley seems to think so. I choose to trust him, no matter how worrisome it is to me.</i>\n</p>\n<p>\n<i>Rest assured, I remain ever vigilant. Perhaps our respective offices will leave us be, but I’ve prepared for other, less happy outcomes. In an abundance of caution, I will not commit these plans to page here.</i>\n</p>\n<p>\n<i>I admit I’m laughing at this entry- I write as if I’m a spy or a criminal mastermind, rather than a silly old angel, fussing over his bookshop and the demon dozing on the settee. Still, I must resign myself to this new position as an “enemy of the state.” It would feel quite glamourous if it weren’t so sad.</i>\n</p>\n<p>\n<i>I’m sure this is harder for me than it is for Crowley. I would hazard a guess that he finds being cast out of both Heaven <u>and</u> Hell to be terribly (and I do apologize for the phrasing, but) sexy. He walks with even more sway to his hips now, a feat I previously believed impossible (but am in reverence of regardless). He wears ostracization like a fabulous accessory and flaunts himself accordingly. Plainly put, he loves it.</i>\n</p>\n<p>\n<i>I want to be pleased that <u>he</u> is so pleased, but oh, I fear that She might not be. Are we awaiting the other shoe’s swift and inevitable drop? And what can I do to keep him safe if it comes down upon us?</i>\n</p>\n<p>How irritating, Crowley thought, who read the passage with wide and hungry eyes, feeling wholly beloved. How irritating that they felt so similarly about their situation and never said it out loud.</p>\n<p>Did Aziraphale think Crowley hadn’t gone half crazy, trying to guess the Almighty’s next move? He’d worn circles into the ground from pacing, wondering how he could keep Aziraphale well enough away from Her fury. Of course Crowley was afraid of Her too- She’s GOD.</p>\n<p>This entry was laughable, really, considering Crowley was the only one between the two of them to both witness Her wrath and bear it directly.</p>\n<p>And sure, he leaned into the joy of finally being free while he could. Of both of them being free. It felt like stretching his wings again after a hundred years of hiding them. It felt good.</p>\n<p>Crowley growled. Why were they always afraid of being punished for feeling good?</p>\n<p>He was reminded of another entry he’d read and flipped to it quickly. The book made this easy. It wasn’t bending to Crowley’s typical control over the inanimate; this diary seemed independently willing to cooperate with him.</p>\n<p>\n<i>March 23rd,</i>\n</p>\n<p>\n<i>Dear Diary,</i>\n</p>\n<p>\n<i>I scarcely have the energy to write. Forgive my abnormally shaky handwriting. Today was everything I dreamt it would be, and yet, I sit here trembling.</i>\n</p>\n<p>\n<i>Crowley finally agreed to visit Kew Gardens with me. I have visited more times than I could count, but Crowley had never been. I tempted him- the gardens are lovely at the start of Spring, I told him, and by some miracle, I was rewarded with the pleasure and privilege to escort him through the grounds myself.</i>\n</p>\n<p>\n<i>We spent five delightful hours there. He whispered to plants and I was perfectly content to observe. He preferred exotic leafy things and only paid attention to the flowers if I pointed them out.</i>\n</p>\n<p>\n<i>He wore a very dark green jumper under a taut black suit jacket, and the effect was enchanting. The verdant greens around him made the crimson of his hair blaze particularly fiercely, and it took every ounce of my self-control not to touch him. I admit I spent much of the day dreaming I had my canvas and easel with me, wondering if Crowley would model for me if I asked very nicely.</i>\n</p>\n<p>\n<i>At some point, however, he asked what I was staring at. From then on, I tried my very best to look anywhere but him.</i>\n</p>\n<p>\n<i>The day passed very pleasantly. As we stopped for a small bite, Crowley asked me which plant specimen had been my favorite. Of course, I told him I appreciate the beauty inherent in all Her creations, but he snarled at that quite harshly and asked if I really thought something like a corpse flower was as pleasing as a daffodil.</i>\n</p>\n<p>\n<i>I admitted I found the dahlias exceptional. He told me his favorite, a scientific name I can’t recall now for a glossy, wide-leafed vine, and I thought the topic was closed.</i>\n</p>\n<p>\n<i>A while later, we strolled together down yet another garden path. We were so close, achingly close. Our arms bumped together enough times I nearly lost count. (I didn’t, of course. 36.)</i>\n</p>\n<p>\n<i>Unexpectedly, he put a hand on my arm, leaned in and whispered “Be right back, Angel.” I was stunned speechless by the sudden proximity, and couldn’t find my voice again until he was already out of sight.</i>\n</p>\n<p>\n<i>His tone was unmistakable, however, so I prepared myself for demonic antics I was sure would follow.</i>\n</p>\n<p>\n<i>I was wrong, for when he returned, he held the most impressive dahlia of the bunch in his outstretched hand, offering it to me. It was as large as a dinner plate and deep velvety red.</i>\n</p>\n<p>\n<i>If I were mortal, I don’t think I would’ve survived it.</i>\n</p>\n<p>\n<i>“Thought it was pretty,” he said, and pretty it was indeed. It was the most lovely blossom I’ve ever seen. I would recreate it here if only I could get my hand to steady.</i>\n</p>\n<p>\n<i>I tried to thank him profusely, but within moments, a squadron of security guards interrupted, demanding that we vacate the garden immediately and not return. Crowley laughed and strode out, calling “be back next week, love!” to the poor officers. I followed.</i>\n</p>\n<p>\n<i>By now, dusk was falling over London and stars appeared above us. Our arms bumped again.</i>\n</p>\n<p>\n<i>Something came over me. I felt prepared to tell him these feelings I have grappled with for centuries, the feelings I have only shared with you, Diary. I turned to face him, opened my mouth- and he said “wait.”</i>\n</p>\n<p>\n<i>He pointed out a trio of people across the street. I hadn’t noticed them, but once I did, my heart dropped. Uriel, Sandalphan, and Michael stared at us.</i>\n</p>\n<p>\n<i>We stopped. They continued to stare. Then, after a few moments, they disappeared into the sky.</i>\n</p>\n<p>\n<i>We made it back to the bookshop without further incident, but all thoughts of confession turned to ashes and all hopes of a nightcap were dashed. We bid farewell at the bookshop door, agreeing we ought to lay low for a few days. Apart.</i>\n</p>\n<p>\n<i>I can’t imagine why archangels would stalk us at a garden, but it terrifies me. I feel like the dahlia can sense this; it has wilted terribly since Crowley left. So have I.</i>\n</p>\n<p>\n<i>So, dearest diary, I regretfully inform you that today, just as every other, did not end with the love of my life in my arms. It began promisingly enough, though, and that shall sustain me for at least a little longer.</i>\n</p>\n<p>Crowley exhaled. He was angry. Angry with Heaven for taking from him, always taking. He barely even registered that the Bentley was on the move before it pulled up to the bookshop.</p>\n<p>He was out of the car and at the entry in a few long strides. A customer carrying a paper bag nearly passed him with a book she had successfully managed to purchase.</p>\n<p>“I’ll take that, thank you,” Crowley said, not slowing down as he walked by her. He pulled the book from her bag and snapped; whatever argument she’d planned, she promptly forgot.</p>\n<p>“OI, CONSTABLE?! Have you lost your mind?!”</p>\n<p>“Crowley!” Muriel beamed from behind the counter. “Something wonderful just happened; I sold my first book!”</p>\n<p>“Yeah, and your last!” He returned the copy of <i>The Two Foscari</i> to its shelf. “What d’you think you’re doing?”</p>\n<p>“I’m…running a bookshop,” Muriel replied slowly, the way one would talk to someone with a head injury.</p>\n<p>“No, actually, you’re not. You’re babysitting a book collection while the owner is out on business.” Crowley spat, hands on his hips.</p>\n<p>“But the Metatron said-“</p>\n<p>“The Metatron?! The Metatron can get bent for all I care!” He began pacing. “Every book you sell belongs to Aziraphale, so technically, you know, you’re stealing. God doesn’t like that now, does She?”</p>\n<p>Muriel swallowed. “But Aziraphale left them behi-“</p>\n<p>“He’ll be back. I know how to get him back. So don’t even THINK about selling another dusty book.”</p>\n<p>Muriel smiled widely at the finger Crowley pointed in their face.</p>\n<p>“Crowley, you finally came inside.”</p>\n<p>Crowley looked around, startled. Here he was. Aziraphale’s bookshop. Really <i>his</i> bookshop too. Their bookshop. It felt like it had been ages.</p>\n<p>He sniffed. “Been in here loads of times. What of it?”</p>\n<p>Muriel wasn’t fooled by Crowley’s forced cool demeanor but had the good sense not to comment.</p>\n<p>“Welcome back,” was all they said.</p>\n<p>“So what’s the plan, then?” Muriel pulled up a chair as Crowley rummaged around the shop, looking for a specific wine he liked and that he knew Aziraphale would have stocked.</p>\n<p>“Uh, the plan, Constable?”</p>\n<p>“You know, your plan you said you had, back when you were shouting at me a few minutes ago?” Muriel replied helpfully.</p>\n<p>“Ah, right, the plan.” Crowley entered the front area of the shop again, wine in one hand and glasses in the other. “<i>The plan</i>.”</p>\n<p>He stood before Muriel a moment, mouth moving like a TV character on mute. “I don’t actually have one, as it were.”</p>\n<p>Muriel blinked. “Oh.”</p>\n<p>“It’s fine!” He swung the hand with the wine bottle dismissively. “I never make plans, anyway, that’s Aziraphale’s thing.” Crowley uncorked the wine with a snap. “He’s all about plans, great complicated, nonsensical plans, and I’m all about, well, making it up on the fly, I suppose. It’s always worked out for me.” He paused. “Well, usually.” Crowley poured wine into the glasses and offered one to Muriel.</p>\n<p>They stared at it.</p>\n<p>“Have some wine.” He thrust it towards them. <i>“To look at,”</i> he added, rolling his eyes.</p>\n<p>Brimming with apprehension but putting on a brave face, Muriel took the wine glass. They swirled the liquid inside.</p>\n<p>“P-pretty,” they remarked.</p>\n<p>“Tastes good, too,” Crowley added, taking a swig.</p>\n<p>“You know,” Muriel began slowly, focusing on the wine sloshing and trying hard to appear as though they hadn’t already plotted the idea out six hundred different ways and in the context of several different alternate universes. “I might have a- a plan.”</p>\n<p>“Have you now?” Crowley peered over his glasses, more amused than interested. “Go on, then.”</p>\n<p>Muriel exhaled with a smile, giggling nervously. “Yes, okay. Good. Okay. So.”</p>\n<p>Crowley tilted his head, wondering if the scrivener had broken. He cleared his throat.</p>\n<p>“Right,” they blushed, pulling themselves together. “So, each day, Aziraphale will check in with me. Either I contact him or he contacts me using that little gateway thing. I think it’s mostly an excuse to get updates about you or to get a peek at the shop. He never seems to pay much attention to my other reports.”</p>\n<p>Muriel smiled brightly as though that didn’t hurt their feelings. Crowley felt a bit sorry for them.</p>\n<p>“So,” they continued. “Last night, I mentioned that I would try selling a book. I thought it might coax him down, but it wasn’t enough.”</p>\n<p>“Coax him?” Now Crowley was interested. “Why, exactly?”</p>\n<p>Muriel huffed, looking away. “Well, because!” They stamped their foot in helpless frustration. “B-because he’s miserable! You’re miserable! I’ve only read about five thousand books about love and misery, and, well,” they straightened their back. “In my professional opinion as a book seller, you two are a mess. And, truth be told, I really can’t stand to see it!”</p>\n<p>Crowley gaped at them. “You really have been reading, haven’t you?”</p>\n<p>“Yes,” Muriel nodded emphatically. “I won’t have this turning into <i>Persuasion</i>. I can’t go through that twice.”</p>\n<p>“We’re not a novel, you know. This isn’t,” Crowley’s eyes landed on a book title. “<i>Wuthering Heights</i> or something.”</p>\n<p>“Oh dear me, no! That would be dreadful! Absolute worst case scenario, can you imagine?” Muriel shuddered.</p>\n<p>“Never actually read it,” Crowley sniffed.</p>\n<p>“Oh, but you must! It’s wonderful. And so awful. You’d love it. There’s this woman, Cathy, and her adopted brother, Heathcliff, and-“</p>\n<p>Muriel caught Crowley’s expression and fell quiet. It was hard to stop talking about books once they started. “Anyway, I won’t spoil it for you.”</p>\n<p>“So, what do we do when Aziraphale calls? What’s the next part of the plan? I tell him to quit Heaven and come home?”</p>\n<p>“No, definitely not. You wait for him to decide that himself.”</p>\n<p>Crowley rolled his eyes. “That’s a terrible plan. He’s too, he’s too“ Crowley grimaced. “Too noble. He won’t abandon his post.”</p>\n<p>“He might,” Muriel said knowingly, eyes wide. “He’s very jealous, you see.”</p>\n<p>Crowley blinked. “Of what?”</p>\n<p>“Well,” Muriel straightened their shirt and smoothed out their trouser legs, looking around uncomfortably. “Of me, actually.”</p>\n<p>“Why?” Crowley asked, flabbergasted to the point of rudeness. “Sorry, that came out wrong.”</p>\n<p>“Because I get to run the bookshop. And I get to see you. And you gave me a gift,” Muriel smiled awkwardly. “And showed me the ducks.”</p>\n<p>Crowley groaned. “You told him about all that? Whose side are you on anyway?”</p>\n<p>“I’m on your side! Yours and his, I mean.”</p>\n<p>Crowley’s eyebrows shot up. <i>Their</i> side had never had more than two people. A lot of the time lately, it only had one. He’d never expected it to have room for three.</p>\n<p>“So you think seeing me during a call will drive him so mad that he’ll leave his heavenly throne and, what?”</p>\n<p>“Be your boyfriend, I suppose?” Muriel sniffed the wine cautiously. They took a tiny sip.</p>\n<p>It was good. Muriel took a bigger sip. The wine was not as sweet as a Shirley Temple, and had no fun little fruits bobbing in it, but the effect was pleasant and felt warm when swallowed.</p>\n<p>Crowley, meanwhile, didn’t know how to respond to the word boyfriend. He nearly forgot that was a word people used.<br>\nWhatever he and Aziraphale were or could someday be, ‘boyfriend’ felt too small to fit it.</p>\n<p>“If he was so jealous that he’d come down here, then why isn’t he here now? As you said, I took you to meet ducks! Practically the pinnacle of romantic endeavors.”</p>\n<p>Muriel noted the sarcasm there and felt proud of themselves. They were getting better at earth-style conversation.</p>\n<p>“Because ducks aren’t enough-“ Muriel punctuated each word with an emphatic clap. “We need to do more.”</p>\n<p>Crowley raised an eyebrow at Muriel’s investment. They continued.</p>\n<p>“Aziraphale has been able to stomach hearing about all this, but I suspect seeing us together would be a different story entirely. Ducks and diaries are all very well and good, but we need something bigger. Like, say you tell me his favorite book, and he calls while you’re reading it to me? Or say we-“</p>\n<p>“Dine at the Ritz,” Crowley whispered, certain that was the key.</p>\n<p>“Or do whatever that means, yeah! Exactly!” Muriel replied enthusiastically, then faltered. “Is that the fancy restaurant Aziraphale talks about in the diary? Will I have to eat?”</p>\n<p>Crowley was pacing, thinking this through. It seemed sacrilegious, inviting Muriel into their place.</p>\n<p>But his mind was whirring with plans.</p>\n<p>Step one: take Muriel to the Ritz. Have a grand time.<br>\nStep two: Later, let Aziraphale call while Crowley was in the shop. Make cold, disinterested conversation with Aziraphale.<br>\nStep 3: Teach Muriel <i>A Nightingale Sang In Berkeley Square</i> beforehand; make them hum it absently in the background until Aziraphale notices and explodes</p>\n<p>Evil, evil stuff. He couldn’t possibly.</p>\n<p>New plan:<br>\n1. Take Muriel to the Ritz to look in the window.<br>\n2. Muriel could then tell Aziraphale that Crowley took them to the Ritz- it wouldn’t be lying, after all- but Crowley could preserve the restaurant as just for the two of them. Perfect.</p>\n<p>“Get your coat, Muriel, we’re going to the Ritz.”</p>\n<p>“Oh jolly good!” Muriel cried, clapping their hands. “So you think my plan will work?”</p>\n<p>Crowley looked at them, this cherubic angel, with a million-kilowatt smile and feet that always seemed to be bouncing with excitement, and wondered if they weren’t, in fact, a demon. An angel with a knack for manipulation such as this was something of an anomaly. Ought he be worried?</p>\n<p>Muriel smiled eagerly, awaiting his response, little fists balled up as if they were clutching their hope in their hands.</p>\n<p>“Could, I suppose,” said Crowley cooly. Muriel squealed with excitement.</p>\n<p><i>Probably not a threat, </i>Crowley decided. <i>But better stick around and keep an eye on them, just to make sure.</i></p>\n<p>——</p>\n<p>Within the hour, the two of them stood outside the Ritz, peering in.</p>\n<p>“We’d be able to see it much better inside, don’t you think?” Muriel asked, as though this comment was helpful.</p>\n<p>“Yes, thanks, I have got a brain, Muriel,” Crowley replied sarcastically. “But I can’t go in there with you.”</p>\n<p>“Oh, painful memories and all that again?” Muriel tried to conceal their disappointment in a cheery voice that inadvertently came across very mockingly. Crowley glared.</p>\n<p>“Besides,” he finally said. “You don’t eat. And I barely eat. Hardly fair to take a table at the Ritz for two beings who only drink, when there are perfectly marvelous pubs nearby. Have you seen enough?”</p>\n<p>Muriel took one final glance at the Ritz, then nodded.</p>\n<p>“Right,” Crowley nodded. “C’mon then. Drinks on me.”</p>\n<p>They walked a few blocks and came upon The Goat Tavern, a green and gold pub. Muriel came to a stop, looking at the golden goat statue above the entrance with trepidation.</p>\n<p>“This isn’t a satanic bar, is it?”</p>\n<p>A pair of elderly men walked out of the pub, smiling kindly at them. Crowley nodded cordially at the gentlemen before cocking a skeptical eyebrow at Muriel.</p>\n<p>“Goats, you know,” Muriel tried to explain. “Some people say they’re satanic.”</p>\n<p>“Goats?” Crowley asked incredulously. “Have you met a goat before? Hilarious, for starters- great fun. Make the best sounds. Now, come in, Inspector. If there’s any satanic activity, you’ll have a chance to cast it out, cleanse the place- whatever it is you angels do.”</p>\n<p>Muriel followed hesitantly. “My miracles are record-keeping specific, actually. I don’t think I’m able to do any other type.”</p>\n<p>Crowley, having crossed the pub and now leaning on the bar counter, rolled his head towards Muriel. “Lucky for you, that’s an easy fix. I’ll teach you how to do a little…system override, we’ll call it.”</p>\n<p>“I don’t think I’m allowed to. I’ll get into trouble, messing around with my pre-sets without permission.”</p>\n<p>“Lucky for you, you’ve got a boss about as threatening as a ripe summer plum. All give, all sweetness. Nothing to worry about.”</p>\n<p>Muriel mulled over the odd turn of phrase in their mind and concluded that it was probably sexual, but wasn’t exactly sure how.</p>\n<p>“‘Ello, what’ll it be?” A dark-skinned and burly man approached the counter from the opposite side, tossing two paper coasters to them.</p>\n<p>“Talisker for me. And you?”</p>\n<p>Crowley looked at Muriel expectantly, who realized this was some kind of test.</p>\n<p>“I’ll have a…a…Pimm’s Cup, please. With a cherry. Please.”</p>\n<p>“With a cherry,” the barman repeated, nodding with a wink at Muriel. He turned and busied himself with the shelves of liquor behind him.</p>\n<p>“Pimm’s Cup?” Crowley turned to them, sounding almost hurt. “Have you gone to the pub without me?”</p>\n<p>“Oh, not at all. I saw it in a drink recipe book Aziraphale keeps at the shop. Pimm’s Cups have little foods inside. Floating in there. All I’ve had to eat so far are cherries from Shirley Temples. I want to try a few more drink foods.”</p>\n<p>“Muriel, just order normal food. They serve actual meals here,” Crowley said, gesturing at a barmaid setting a plate of fish and chips down for a patron at the end of the bar counter.</p>\n<p>“Oh, better not. I think I just like the foods that come in alcohol, like the cherries in Shirley Temple.” Muriel smiled and folded their hands in their lap. The barmaid passed them, but not without an “afternoon, love” and a wink at Muriel.</p>\n<p>Muriel knew that winks could mean a great deal of things, but couldn’t come up with a good reason why either barperson had winked here. Muriel could only conclude that this was simply how humans behaved in bars.</p>\n<p>“You don’t-?” Crowley gaped. “Muriel. Shirley Temples are not alcoholic. You do know this, yes?”</p>\n<p>“Oh, yes, of course!” Muriel winked at him dramatically.</p>\n<p>Crowley furrowed his brow at them, feeling for the first time ever that there was a language he couldn’t speak fluently on Earth; Murielese.</p>\n<p>“If you just like foods in liquids, you could try soup,” Crowley continued, trying to move on from the baffling wink. “Stew, even.”</p>\n<p>Muriel considered this. Soup did sound very wonderful in the books they’d read. They suddenly felt brave.</p>\n<p>“Mr. Barman?” Muriel called hesitantly. The barman turned, their ready drinks in hand.</p>\n<p>He smiled charmingly at Muriel, barely acknowledging Crowley. “Here you are, love. What can I do for you?”</p>\n<p>“Oh, thank you!” Muriel smiled at all the little foods in the Pimm’s Cup. “Have you got any soups?”</p>\n<p>“Sure; potato leek, tomato, mulligatawny…”</p>\n<p>“Oh, so many choices,” Muriel looked worried. They turned to Crowley.</p>\n<p>He sighed crossly. “Aziraphale would’ve ordered the mulligatawny. And from my understanding, he has somewhat…” he grumbled. “Excellent taste.”</p>\n<p>Muriel nodded happily and turned back to the barman. “Mulligatawny, please!”</p>\n<p>He nodded with another sweet smile and was off.</p>\n<p>“Hmph,” Crowley said. “Typically, they ask me what I want as well.”</p>\n<p>“Did you want something? We can call him back.”</p>\n<p>“No! But I like telling them, anyway,” he pouted. He normally received plenty of attention in bar settings. Not that he cared much for it, but…his ego was a bit fragile as of late.</p>\n<p>By the time Muriel’s soup arrived, they’d developed a plan. Crowley would remain in the shop until Aziraphale called. He would make a production of leaving. Then, Muriel would provide details about the day to Aziraphale and mention both selling a book and going to the Ritz.</p>\n<p>“And then,” Crowley said darkly. “I return, interrupt your call, and ask if we’re still on for tomorrow.”</p>\n<p>“Tomorrow?”</p>\n<p>“Sure, we’ll say we’re, I don’t know, headed to the park again.”</p>\n<p>“But will we actually?”</p>\n<p>Crowley considered it.</p>\n<p>“Yeah, we will. So we can work on your miracle pre-sets. Are you going to try your soup?”</p>\n<p>The bowl sat before Muriel, silently challenging them. They picked up a fork.</p>\n<p>“Nope, try this one,” Crowley grunted, swapping the fork for a spoon. “You take the spoon, scoop up the soup, blow on it for a moment, and then put it in your mouth.”</p>\n<p>“Blow on it?”</p>\n<p>“You know, whooo” Crowley pursed his lips and blew air. Muriel giggled.</p>\n<p>“Human bodies are so weird,” they said. Hand trembling, they followed Crowley’s instructions. The soup sat in their mouth for a few moments.</p>\n<p>“Swallow, Muriel! Just like a drink!”</p>\n<p>Muriel swallowed hurriedly and gasped.</p>\n<p>“Well?” Crowley studied their face.</p>\n<p>Muriel’s eyes were like saucers. “It’s…fantastic.”</p>\n<p>They dove back into the soup, eating far too quickly and loudly. The barman watched, seeming utterly enraptured by the display.</p>\n<p><i>Humans are attracted to the oddest things,</i> Crowley thought to himself, the hypocrisy entirely lost on him.</p>\n<p>When they returned to the shop a few hours later, Crowley was pleasantly buzzed.</p>\n<p>Muriel, however, was positively sloshed. Their right arm was over Crowley’s shoulder as he did his best to keep them both upright.</p>\n<p>“Look, Crowley!” Muriel spluttered, flinging an arm to their left, pointing at a figure down the block. “It’s Maggie!” They spoke her name as if she were the most precious of all Earth’s offerings.</p>\n<p>“OI, MAGGIE! MAGGIE THE RECORD SHOP HUMAN!” Muriel waved their arm chaotically. “YOO-HOO! Yoo-HOOOOOO!”</p>\n<p>“Shut it!” Crowley hissed, still not keen to run into Maggie after what happened since they last spoke. “You need to sober up!” He scolded.</p>\n<p>“Heh,” Muriel rolled their head to look at Crowley, eyes unfocused. “Who, me?” They pointed a lax finger towards themselves and chuckled.</p>\n<p>He couldn’t be mad at them, not really. This was yet another Earthly lesson Muriel would need to learn. No one knows their limits right away. Now they knew Seven Pimm’s Cups and a glass of wine amounted to an measure of alcohol well past Muriel’s limit.</p>\n<p>“Gimme your keys, you idiot,” Crowley snarled, trying desperately to get into the shop before Maggie arrived.</p>\n<p>“They’re MINE!” Muriel snapped suddenly, going very rigid. “I can do it!”</p>\n<p>Reaching into their pocket, they pulled out a pen from the pub and tried to jam it into the keyhole.</p>\n<p>“Ugh,” Crowley groaned, removing his arm from Muriel and letting them fall to the ground. They cackled.</p>\n<p>It occurred to Crowley that actually he’d never needed a key to the bookshop. He snapped his fingers and the doors opened. Maybe he was drunker than he realized.</p>\n<p>“Crowley?” Maggie called softly behind him. “How’ve you been?”</p>\n<p>He didn’t look at her. “Fabulous, as you can see.”</p>\n<p>From the ground, Muriel let out a silly little giggle. “This is a <i>pen,</i> not a key!”</p>\n<p>Befuddled, Maggie looked at them for moment. “Mr. Fell around, by any chance?”</p>\n<p>“Actually!” Muriel announced, standing up. “I am now the pur-pury-purveyor of this establishment. I’m Mr.- uh, Mr. Muriel.”</p>\n<p>“Right,” Maggie said. “Crowley, what’s really happened? Where did Mr. Fell go?”</p>\n<p>Crowley turned to look at her. “He took a new job.”</p>\n<p>“And did…did you do what we-?”</p>\n<p>“Yeah.”</p>\n<p>Maggie understood how it went by the expression on Crowley’s face. “Oh, dear.”</p>\n<p>Muriel swayed on the spot, looking between them. “Oh buck up, you two! It’s just a little tiff, it’ll work out. Soon enough, Mr. Crowley and Mr. Fell will be…”</p>\n<p>Crowley gritted his teeth and Maggie grimaced, both fearful of whatever Muriel would say next.</p>\n<p>“Lovers,” Muriel finally said, gushingly, suppressing a burp and looking supremely unbothered. Crowley groaned with disgust.</p>\n<p>“Oi, you actually need to sober up right now. I won’t let you in the shop if you might throw up.”</p>\n<p>Muriel blinked at him. “How’d’I do dat?”</p>\n<p>“You just do it. You just focus on the alcohol leaving your body. Release it from yourself.”</p>\n<p>Maggie looked startled, having only a few ideas what this could mean.</p>\n<p>Muriel focused. Their slight swaying steadied. And after a few more seconds, they stood perfectly straight, with an expression like they tasted something very unpleasant.</p>\n<p>“Well,” Muriel said, terribly sober and evidently quite embarrassed. “Shall we, then?”</p>\n<p>They marched inside stiffly, their blush evident even on the back of their neck.</p>\n<p>“Ah, one of your lot then, I presume,” Maggie said, understanding nothing that had just happened except that it was supernatural.</p>\n<p>“Don’t lump them in with me!” Crowley replied quickly.</p>\n<p>“Oh, I remember them now! The pure white police officer! They look so much more normal now…”</p>\n<p>Maggie smiled and touched Crowley’s arm. “If you need anything, Crowley, I’m only next door.”</p>\n<p>“Meh,” he replied, waving her arm away. She smiled softly again and walked on.</p>\n<p><i>Humans are awful,</i> he thought, feeling fondly towards the one who’d just left. He entered the shop again, a little slowly. It still took some getting used to.</p>\n<p>The clock read half-past seven. “Alright, Constable, how shall we prepare for your conference call?”</p>\n<p>Muriel was already darting around the shop, arranging books into piles so as to suggest they’d been recently used or discussed. Two wine glasses, partially filled, sat on the desk.</p>\n<p>“Okay, he really could call at any time. We ought to take our seats, look comfortable, act as if we’re discussing books.”</p>\n<p>“I don’t really read books,” Crowley replied, sitting on the couch, examining his nails.</p>\n<p>“Exactly, it’ll drive him mad if you’ve started reading them now that’s he’s gone. Take this one,” Muriel held up <i>Wuthering Heights</i>. “I’ll give you the synopsis.”</p>\n<p>By the end of Muriel’s retelling, Crowley was both confused (there were far too many characters, with far too many shared first names) and a bit shocked. He thought his relationship was a mess, but yeesh. It could get much worse.</p>\n<p>“Don’t test me on this, I will fail,” Crowley said, sipping some of his wine. “How does my hair look?”</p>\n<p>Muriel exhaled fondly. “Don’t worry, Crowley. You look exactly how Aziraphale likes you best.”</p>\n<p>Crowley blushed, wanting to argue or say that that wasn’t why he’d asked. But Muriel would know better. They were quiet for a moment.</p>\n<p>“Now what should we do?”</p>\n<p>Crowley sat up. “Let’s work on your factory settings. Get you an upgrade.”</p>\n<p>Muriel shook their head. “What if he sees?”</p>\n<p>“Oh please,” Crowley waved his hand. “As if he hadn’t done this all himself a few thousand years ago.”</p>\n<p>Muriel gulped. “O-okay. What do I do?”</p>\n<p>Crowley smiled. “It’s very simple, Muriel. You just need to tell yourself you can do it. And then you can do it.”</p>\n<p>“I don’t understand.”</p>\n<p>“You need to break the rules. That’s it. The only thing stopping you from performing any miracle you’d like is you and whoever told you to fall in line in the first place.”</p>\n<p>Muriel’s eyes went wide. “Am I being tempted? Is that what this is?”</p>\n<p>Crowley shrugged casually, lounging back on the couch, his legs too long. “I guess, but I’m non-affiliated, so what harm could it do?”</p>\n<p>Muriel’s eyes darted around Crowley’s face. They wished he would remove his glasses. That would make all of this easier to trust.</p>\n<p>They exhaled, then focused on a human passing by the shop. With a few swirls of their hand, the human hurried into the bookshop, then stopped.</p>\n<p>“Oh, uh, my apologies. Wrong shop,” they said, confused and a little upset, before running back out of the shop.</p>\n<p>“Did you do that?” Crowley asked. “Nice work, only next time give them a reason for what they’re doing or they’ll go all weird on you.”</p>\n<p>Outside, the human was clearly in the midst of some sort of panic attack. Crowley snapped, and the human continued on as though nothing out of the ordinary had just happened.</p>\n<p>Muriel nodded, in complete awe of the miracle. “I can’t believe it was as easy as all that. Just say I can do it, and I can do it. Brilliant.”</p>\n<p>Once started, Muriel found it hard to stop casting miracles. They summoned wine bottles, they closed curtains. With a sweeping wave, every book on every shelf in the shop rearranged, leaving books sorted by color only.</p>\n<p>“Woah now, that’s a bit much I think-“ Crowley coughed, when suddenly, the thick dust the books left suspended in the air was alight with a white-blue glow.</p>\n<p>“Muriel, what the blazes is going on?”</p>\n<p>The dust was thick enough to obscure Aziraphale. Crowley froze.</p>\n<p>“Oh, sorry, Supreme Archangel!”</p>\n<p>Aziraphale was impatient. “Please, Muriel, just Aziraphale is FINE. Now what have you done to my shop? Why on earth is it foggy?”</p>\n<p>“Oh, it’s dust, sir, I was doing some rearranging…”</p>\n<p>“Rearranging?”</p>\n<p>“Yes, the books…by color.” Muriel said as if it caused them physical pain to admit it. Crowley willed himself not to laugh. He probably would’ve laughed in any other circumstance.</p>\n<p>Aziraphale let out a long sigh. The dust began to fall, but Aziraphale seemed not to notice, as he began reading from a document.</p>\n<p>“I just received notification of excess miraculous energy from the shop, far beyond your usual output. I’m not a stickler but I do need some clarification as to why-“</p>\n<p>Aziraphale looked up. His eyes locked with Crowley’s, just visible in the settling dust.</p>\n<p>“-this is happening,” he finished lamely.</p>\n<p>Crowley wanted to say so many things. <i>I love you,</i> for one, and <i>I missed you, please come home,</i> for two. But instead, he said:</p>\n<p>“Hello, Aziraphale. Nice suit.”</p>\n<p>It wasn’t a compliment, and Aziraphale knew better than to take it as one.</p>\n<p>“Hello Crowley,” Aziraphale replied, not sure what tone to use and rapidly cycling through several. “Are you well?” His eyes scanned every inch of Crowley with a hint of badly-concealed need and even worse-concealed worry.</p>\n<p>“I am indeed,” Crowley said with more bravado than made sense. “How’s Heaven?”</p>\n<p>Aziraphale swallowed. “Ah, well. It’s - it’s Heaven, after all! Lovely, of course.”</p>\n<p>“Of course,” Crowley replied, mockingly sweet. Muriel cleared their throat, attempting to remind Crowley of the plan to leave the shop.</p>\n<p>“Tell me, Ange-<i>Aziraphale</i>,” Crowley was proud of how he corrected himself. “Who’ve you cast into hellfire since you took on the job? I do love office gossip,” he growled.</p>\n<p>To that, Aziraphale clicked his tongue. “I hardly think we need to be petty, my d- my…” Aziraphale was not so good at corrections.</p>\n<p>“<i>Your</i>? Your what?” Crowley was determined to give Aziraphale no mercy whatsoever. “Air too thin up there to think properly, is it?”</p>\n<p>“Crowley,” Aziraphale sighed. “I apologize, as much as I would like…would like to catch up with you, I have important matters to discuss with Muriel, here.”</p>\n<p>“Ah yes, come to scold them for <i>too many frivolous miracles,</i> that’s right.”</p>\n<p>Aziraphale’s eyebrows fell. “Something like that.”</p>\n<p>“Well, it was my fault,” Crowley said, standing with his arms wide. “I taught them what to do, just the same as I taught you.”</p>\n<p>Aziraphale looked down. “I see.”</p>\n<p>“Do you? You send a scrivener down here, entirely untrained, and get upset when they try to figure out how to survive on Earth?”</p>\n<p>“I didn’t say I was-“ Aziraphale interjected.</p>\n<p>“You’ve taken all that trademark Heaven common sense to heart, Aziraphale. Great work. I won’t keep you, Supreme Archangel. Enjoy your meeting,” Crowley said lightly. His body shook with too many feelings.</p>\n<p>“Crowley!” Aziraphale said quickly, just as the demon strode away.</p>\n<p>“What?” He didn’t look back at the floating head of his most beloved, most terrible…</p>\n<p>“It really- it was good to see you,” Aziraphale said softly. Sadly.</p>\n<p>“Right,” was all Crowley could muster before walking out the door. The cool London air embraced him, and only then did he realize how hot his body was.</p>\n<p>He was a block away before he remembered he was supposed to return to the shop and invite Muriel out to the park the next day.</p>\n<p>He spun, heading back. Seeing Aziraphale was like erupting with lightning. He felt every cell of his skin buzz.</p>\n<p>He was still so angry. And so torturously in love. He wondered what would happen if he stepped into the gateway while Aziraphale’s head was in it. Would he wind up in Heaven where Aziraphale was?</p>\n<p>But he’d discorporate for sure. He didn’t know who, if anyone, would be willing to give him a new body now. Certainly no one in Hell. Perhaps only one person in Heaven.</p>\n<p>Crowley threw the shop doors open and strode inside. “Sorry to interrupt! Forgot something!” He called out. “Muriel, are we still-?”</p>\n<p>He stopped a few strides in. Muriel was gone.</p>\n<p>Instead, standing before him in a finely-tailored and lightest blue suit, was Aziraphale. Just Aziraphale.</p>\n<p>“Oh,” Crowley breathed.</p>\n<p>“Oh,” Aziraphale replied, wiping a tear off his cheek</p>\n<p>They stared at each other for a moment.</p>\n<p>Diary entries swam through Crowley’s head. Words he’d only dreamt of hearing Aziraphale say echoed around his brain. Words Aziraphale wrote. Feelings Aziraphale felt.</p>\n<p>“What are you doing here?”</p>\n<p>Aziraphale just looked at Crowley, as if he had so many things to say, none of them could squeeze through. He tried a few times to speak. He opened his mouth and squeaked slightly. He stepped forward, and stepped back, and then turned away from Crowley entirely.</p>\n<p>Crowley stepped forward. “What are you doing here?” He repeated with more urgency. The scrivener’s absence was loud.</p>\n<p>“Just business,” Aziraphale finally said. “Heavenly machinations, you know. Very busy. Not all of us have had time to spare for,” the angel hissed, “the Ritz.”</p>\n<p>By this point, Aziraphale had slowly angled towards Crowley. He glanced at him for a moment, then looked away. Crowley looked back stoically. His pounding heart was anything but.</p>\n<p>“Tell me more about your lessons.”</p>\n<p>“Lessons?” Crowley repeated. “What lessons?”</p>\n<p>“Earth lessons. Muriel says you’ve been teaching them.” Aziraphale looked very stony. There was no hint of flirtation here.</p>\n<p>“Sure, I’ve been trying to fill in the blanks your lot forgot to share with them before you chucked them down here to fend for themselves. I took them to see the ducks at St. James’s, took them to have a few pints, ate some soup…”</p>\n<p>Crowley was a demon. He was a DEMON, damn it all. But he looked at Aziraphale, who seemed carved out of stone down to the last white curl, and broke. “And yeah, I took them to see the Ritz. We looked in through the window. Didn’t even go inside.”</p>\n<p>Aziraphale’s eyes met Crowley’s. They were stormy, but something in them seemed to lighten marginally.</p>\n<p>“And what about miracles?”</p>\n<p>Crowley shrugged again. “I told them they could do whatever miracle they wanted if they gave themselves permission.”</p>\n<p>“It wasn’t Muriel’s permission to give, Crowley!” Aziraphale shouted suddenly, his hand coming down on the desk.</p>\n<p>Crowley seethed. “Who gave you permission to break your rules, Aziraphale? Who told you to give the humans that flaming sword?”</p>\n<p>“This is different!” Aziraphale shot back.</p>\n<p>“How?!” They were close now. The air between them was hot.</p>\n<p>“Because NO ONE WAS PAYING ATTENTION TO ME! TO US! TO YOU!” Aziraphale bellowed. “You HAD to know you’d be scrutinized after turning my offer down!”</p>\n<p>“What, you mean by you? You were watching me, right? Getting reports?”</p>\n<p>Aziraphale faltered. “That was different. That wasn’t this.” The angel swallowed, knowing he wasn’t making any sense.</p>\n<p>“What?”</p>\n<p>“I was checking in on you out of selfishness, Crowley. I was checking in because I wanted to know- wanted to know you were okay.”</p>\n<p>Crowley would’ve done the same thing, given the opportunity, but he snarled anyway. “So you spied on me?”</p>\n<p>Aziraphale grimaced. “Yes.”</p>\n<p>“That’s sick. You know it.”</p>\n<p>Aziraphale looked down. “Maybe so, but that’s not why Muriel’s…not here. They’re not here, not here…because the Metatron, he…”</p>\n<p>The angel stopped. He looked down at his shoes, then up at the ceiling, trying to hold back tears. He glanced at Crowley, who only then realized that it wasn’t just Muriel and himself in trouble.</p>\n<p>“Angel?” Crowley whispered, realizing he’d said that word only after it had left his lips. Aziraphale choked, and a sob escaped.</p>\n<p>In a breath, they were together. Crowley held Aziraphale tightly and Aziraphale sobbed against his chest.</p>\n<p>“Shhhh,” Crowley whispered, running his hand on Aziraphale’s hair. “Shhh, now.”</p>\n<p>“Oh Crowley, it really- it really is so terrible, you have no idea.”</p>\n<p>“Deep breaths, Angel. Then tell me all about it.”</p>\n<p>Crowley led Aziraphale to the couch as Aziraphale struggled to regain composure. He slowly managed to calm himself into occasional shuddery gasps and hiccups.</p>\n<p>Finally, he drug his eyes up to meet Crowley’s. Tears threatened to fall, but didn’t, as if Crowley had commanded them to stay.</p>\n<p>“Well, first of all,” Aziraphale sighed. “Everyone in heaven is a complete <i>bitch.</i>”</p>\n<p>Crowley laughed, and Aziraphale smiled in spite of himself. “I could’ve told you that much, Angel! You don’t belong up there.”</p>\n<p>“Of course I don’t, I knew that going into it. I hate these suits,” he moaned, tugging on his blazer.</p>\n<p>Immediately, Crowley got to work at taking the offensive garment off Aziraphale. He threw it roughly to the floor and undid the tie around the angel’s neck.</p>\n<p>“Better now?” Crowley grinned.</p>\n<p>Aziraphale stared at him, fully stunned. Crowley turned scarlet.</p>\n<p>“Much better,” Aziraphale finally whispered.</p>\n<p>They held each other’s gaze for a moment.</p>\n<p>“Tell me what’s going on, Angel.”</p>\n<p>Aziraphale looked down. “You won’t like it.”</p>\n<p>“When have I ever liked anything?” Crowley smiled, lifting Aziraphale’s chin, trying his best to fight off the apprehension building in his stomach. Just for a moment more. He was with Aziraphale again.</p>\n<p>“They- they think you’re…they think you may be a threat.”</p>\n<p>Crowley blinked. “Uh, yeah? Are you going to tell me the sky is blue next?”</p>\n<p>“No, this isn’t like before, Crowley. The Metatron, he sent Muriel here on purpose. They were a test, an assessment or something. I only just found out.”</p>\n<p>“What?”</p>\n<p>“He wanted to how you’d respond to a new angel in your quadrant. Wanted to see if you’d attempt to, I don’t know, expand your influence over another heavenly entity. Like you did with me.”</p>\n<p>Crowley’s mouth was agape. He didn’t understand. “But me and Muriel, it’s nothing like you and me!”</p>\n<p>“I know. I told him your influence was good, not dangerous. That was,” Aziraphale gulped. “The wrong thing to say.”</p>\n<p>“Are you in trouble, Angel?” Crowley scanned Aziraphale’s face for signs of injury or scorch marks.</p>\n<p>“Me? No, Crowley, you are!”</p>\n<p>Something about the tone led Crowley to think Aziraphale was lying. Crowley was sure Aziraphale’s situation was bad, but he refused to admit it. The angel continued.</p>\n<p>“You need to stay away from the shop. You need to keep yourself hidden, at least for a little bit!”</p>\n<p>Crowley darkened. “Where’s Muriel?”</p>\n<p>“In Heaven,” Aziraphale said fretfully. “The Metatron is going to interview them.”</p>\n<p>“And by interview them, you actually mean-?”</p>\n<p>“Determine if they’ve behaved in such a way to deserve…”</p>\n<p>“No, no, no,” Crowley muttered.</p>\n<p>“Falling,” Aziraphale cried, collapsing into tears again.</p>\n<p>For a moment, Crowley thought Muriel’s manipulative skills would be far too powerful when used demonically, but that was the least of his worries. Muriel did not belong in Hell.</p>\n<p>“On what charges?” Crowley demanded, furiously.</p>\n<p>“Muriel knew not to do miracles outside of their assigned duties. But they did anyway. I went to deal with this, but apparently the Metatron decided to pull the Earth Observation files he’d been quietly gathering. He made it known that Muriel was spending a great deal of time with you and that it was a problem.”</p>\n<p>“What difference does it make if Muriel talks with me? I’m not affiliated with Hell anymore!”</p>\n<p>Aziraphale gulped. “He’s actually been running a bit of a PR campaign against you, and all demons. He’s determined to keep angels and demons very separate after what happened with Gabriel. I think- I think <i>he</i> thinks that if he shows that even an angel like Muriel can be tempted, no angel is safe.”</p>\n<p>“What can we do to stop this?” Crowley whispered urgently. “There must be something? It’s all my fault, I can go to the Metatron-!”</p>\n<p>“Absolutely not, Crowley! They’ll erase you, they’re looking for any reason to, that’s why I need you to flee! Muriel is my responsibility anyway. I put them up to all this in the first place.” Aziraphale was truly miserable.</p>\n<p>“What do you mean?”</p>\n<p>“I told them to give you my diaries. So you knew how I felt, even if I couldn’t tell you.”</p>\n<p>Crowley balked at the angel. Then laughed.</p>\n<p>“Muriel is an actual madman,” he said, admiringly. “Here I thought all this time they were working with me.”</p>\n<p>Then he remembered. Muriel was the third member of <i>their</i> side.</p>\n<p>Muriel was always working them both. And for them both. Muriel was always working <i>with</i> them both.</p>\n<p>“We’ve got to go get them, we have to do something.” Crowley stood, pulling Aziraphale by the hand.</p>\n<p>“No, Crowley! I have to do something, and you need to hide!” Aziraphale sounded extremely firm. His time leading Heaven seemed to have strengthened his spine a bit.</p>\n<p>“Absolutely not,” Crowley spit back.</p>\n<p>But at that moment, the gateway flashed a violent white, and Muriel came leaping out of it, looking wild.</p>\n<p>“Muriel!” Crowley gasped. “What the hell are you- how did you?”</p>\n<p>“Told myself I could,” they replied, breathless, hands on their knees.</p>\n<p>Aziraphale gaped. “But how did you travel through the gateway without discorporating? Even I couldn’t do that, I took the stairs—?”</p>\n<p>“Told myself I could,” Muriel said again, huffing, as if that explained everything, and suddenly, it did.</p>\n<p>“Well, would you look at that,” Crowley breathed.</p>\n<p>“We ought to get moving, I think,” Muriel gasped, clutching a stitch in their side. “The Metatron is not going to be pleased when he wakes up.”</p>\n<p>“When he-??”</p>\n<p>\n<i>“Wakes up???!”</i>\n</p>\n<p>Muriel just nodded, still trying to catch their breath.</p>\n<p>Crowley was terrified and entirely impressed. “Muriel, what have you done?”</p>\n<p>“And what’s that you’re holding?” Asked Aziraphale, suddenly incredibly serious.</p>\n<p>“What, this?” Muriel finally stood up straight, opening their coat wide and pulling out a large tome.</p>\n<p>In the grand hierarchy of all beings, God resided firmly at the top. And now, just underneath her, but above all others, sat one former Scrivener, 37th class, armed with unimaginable power.</p>\n<p>“I knicked it,” they said guiltily, holding up The Book of Life.</p>\n<p>“You WHAT?” Crowley and Aziraphale said together, one grinning massively and the other stricken, neither fully believing what Muriel said.</p>\n<p>“Well, yes,” Muriel said. They had finally caught their breath after so much running, but panic kept each breath shallow. “Believe me, I had to, he was-“</p>\n<p>The gateway behind them sparked. “We really should be going, right away, I think. Probably best not to do any miracles either,” Muriel said apologetically.</p>\n<p>Crowley made to follow Muriel, who was grabbing a few items on their way out the door, when Aziraphale pulled him back by the arm.</p>\n<p>He was hushed but panicked. “Crowley, this is- this is an unimaginable crime. We don’t have to go with them.”</p>\n<p>Crowley looked at Aziraphale as if he’d gone mad. “What? ‘Course we do, they’ll never get out of this themselves. Now let’s go.”</p>\n<p>“It may be too late for Muriel to evade punishment, but not you. You still have time to run!”</p>\n<p>“They need our help,” Crowley said simply, and Aziraphale released him. “We’re helping. At least I am, anyway.” He walked quickly to the door before turning back. “You coming or not?”</p>\n<p>Crowley’s voice was steady, but his expression was fierce. Aziraphale felt he could burn holes through his glasses.</p>\n<p>“Well?”</p>\n<p>The angel looked around helplessly for a moment, trying to determine what next move would be best. He had a feeling whatever damage control he attempted in Heaven would not be well-received, but maybe he could mitigate the worst of it if—</p>\n<p>Muriel rushed back in the door to grab a blue book, then stopped, catching sight of the frozen angel.</p>\n<p>“Aziraphale? Aren’t you coming?”</p>\n<p>Their voice was so soft.</p>\n<p>Of course Aziraphale was coming. He moved quickly to follow them both out the shop door.</p>\n<p>It was all rather incredible, Aziraphale realized, getting into the passenger side of the Bentley. How had things changed so much since Aziraphale sheltered Jim that Aziraphale would now be the one shirking away from danger while Crowley volunteered to protect against it?</p>\n<p>He looked over at Crowley, overwhelmed by love.</p>\n<p>Crowley looked back at him and huffed, cheeks going red. “Angel, now’s not the time for that. I’ll never be able to start driving if you give me that face.”</p>\n<p>————————</p>\n<p>A few minutes later, with Aziraphale looking firmly ahead, the Bentley flew down High Holborn, quite nearly flew, as Aziraphale and Crowley argued over what to do. In the backseat, smushed between shivering potted plants, Muriel clutched The Book of Life tightly, laughing in disbelief one moment and groaning with regret the next.</p>\n<p>“If you are miracling this car to go faster, I must insist you STOP at ONCE!” Aziraphale shouted, clutching the dashboard.</p>\n<p>“I’m not doing it! She’s just as scared as we are!” Crowley shouted back, his hands on the steering wheel, knuckles white.</p>\n<p>Muriel bobbed blankly about in the backseat, letting the car move their body however it wanted to. “They’re definitely going to erase me, aren’t they?” They were queasy, and it had nothing to do with Crowley’s driving.</p>\n<p>Aziraphale shot a look back at them, shooting for sympathy but landing firmly in irritation. “They’re going to erase <i> us</i>, Muriel,” he corrected.</p>\n<p>“That’s only if they can catch us!” Crowley declared roguishly, taking a turn far too fast. Aziraphale squealed in terror, harmonizing shrilly with the Bentley’s screeching tires. A potted shrub fell over, battering him with hundreds of tiny sticks and leaves.</p>\n<p>“WHY are your plants here, Crowley?” Aziraphale demanded, spitting out a leaf and pushing the offending plant back.</p>\n<p>“Ah, they weren’t happy in the flat. I couldn’t get all the <i>Shaxness</i> out.” Crowley turned back and glanced at the plants. “They’re recovering, but,” a growl took over his voice. “…<i>not fast enough.</i>”</p>\n<p>“CROWLEY! THE ROAD! FOR GOD’S SAKE, KEEP YOUR EYES ON THE ROAD!”</p>\n<p>“Where are we going?” Muriel asked, trying to focus on anything but what they’d done. The chaos was helpful, but did nothing for Muriel’s taut nerves.</p>\n<p>“Away,” Crowley said. “We’ll know when we get there.”</p>\n<p>Muriel sat back, resigned. They couldn’t use a miracle to travel, as any miracle could alert Heaven of their whereabouts. Muriel’s impulsiveness had doomed them all. “I’m so sorry,” they cried.</p>\n<p>Crowley laughed weakly. “Tell you the truth, Inspector, I’m not sure this is a bad thing.”</p>\n<p>“Not a bad thing?” Aziraphale chuckled humorlessly and yet somehow also hysterically, flinging his arms. “You’re right! It’s not a bad thing. It’s the worst possible thing.” After a beat, he turned back to Muriel. “I do forgive you, of course.”</p>\n<p>Crowley waved an index finger at Aziraphale, looking over at the angel before said angel promptly pushed his face back to the road. “Think about it! We can’t be erased now that we’ve got the book! We can make people- ANYONE- disappear from all existence! Who would dare mess with us now?”</p>\n<p>“God would, I think?” Muriel replied, ashen-faced.</p>\n<p>Crowley stopped talking.</p>\n<p>They drove in alert silence, as if God might make a warning sound, a trumpet noise or a heavenly chorus or a bird call, before smiting them off the face of the planet. They heard nothing beyond the roar of the Bentley and the soft shivering of the leaves.</p>\n<p>They passed the time as such for hours. The sun began to rise behind them, rays stretching over wind turbine-dotted fields.</p>\n<p>“What I don’t understand,” said Crowley suddenly, causing his passengers to jump, “Is why the Book of Life was out in the first place. Don’t they keep that thing locked up somewhere?”</p>\n<p>“Oh, yes,” Muriel sighed lifelessly. “He was going to make changes to it.”</p>\n<p>“The Metatron was going to erase you? Oh, Muriel.“ Aziraphale was truly sorry.</p>\n<p>“No, he said he was going to make <i>changes,</i> he said. Edits.”</p>\n<p>“Nah,” Crowley shook his head. “He can’t make changes to the Book. All he can do is erase people.”</p>\n<p>Muriel shook their head back. “<i>No,</i> he can change what’s written there. Swap one adjective for another adjective. He did it to you, Crowley. Don’t you remember? He did it to all the fallen angels.”</p>\n<p>Crowley’s jaw tightened. He remembered changing, falling, being an angel in one moment and a demon the next, but he did not recall what exactly changed him. He assumed God snapped their celestial fingers…or something?</p>\n<p>“You mean at God’s command, of course,” Aziraphale said shakily.</p>\n<p>“<i>No,</i> he can just do it. Didn’t you know?”</p>\n<p>Aziraphale looked at Crowley hastily, who shook his head.</p>\n<p>This information changed everything.</p>\n<p>“If we didn’t know, how on earth do you know?” Aziraphale tried his best not to come across insulting.</p>\n<p>“I’m a scrivener. I record what happens. On Earth, in the Heavens. If God speaks to the Metatron, I’d know. We record everything God says directly.”</p>\n<p>“When was the last time that happened?”</p>\n<p>“She said ‘I have glorified it and will glorify it again’. She was talking to Jesus about Heaven.”</p>\n<p>“But that was like two thousand years ago!” Crowley protested. “That can’t be right! You can’t just build all this,” Crowley gesticulated frantically, “And just abandon it!”</p>\n<p>“It’s just been the Metatron this whole time since then,” Aziraphale breathed, voice heavy with astonishment.</p>\n<p>“So,” Crowley trying to understand. “The Metatron has just been doing whatever he likes, for who knows how long, and God either doesn’t know or doesn’t care?”</p>\n<p>“I suppose,” Muriel said softly. Crowley exhaled hard.</p>\n<p>“How can we know for sure?”</p>\n<p>“Well,” Aziraphale worked it out aloud. “If erasing people is something the book is able to do, then God wouldn’t need a book to do it. God would just do it. That’s what the word <i>almighty</i> means. The Metatron is God’s voice, not God’s will. If the Metatron is using the book to erase people or cast them into Hell, then it’s possible that it’s not God’s will at all and never was.”</p>\n<p>“And it’s just as possible that She doesn’t care one way or another,” Crowley said bitterly.</p>\n<p>Aziraphale furrowed his brow, deep in thought.</p>\n<p>They passed a sign reading, Woolfardisworthy, and Aziraphale gasped. “Go there!”</p>\n<p>Crowley leered at him. “What for? Why Woolfard-is-worthy?”</p>\n<p>“It’s pronounced Woolsery.”</p>\n<p>“It’s never?”</p>\n<p>“It is,” Aziraphale continued. “And that’s why it’s perfect. Even if an angel, or demon, as it were, were to find us, they’d have to know how to pronounce the town properly in order to direct others here using typical supernatural travel methods. At least, that’s how it works when viewing the Earth from Heaven. Let’s say you’d like to go to Berkeley Square, for instance, but you’re unaccustomed to London and you pronounce Berkeley by sounding it out, you’ll wind up somewhere in San Francisco.”</p>\n<p>Crowley groaned. The logic was tenuous at best.</p>\n<p>“Alright, I guess we’ll give it a go,” Crowley grumbled. “Still, I can’t understand why humans would invent a whole language and then not follow any of its rules.” He peered in the rearview. “What’re you up to back there, Muriel?”</p>\n<p>“Oh,” they said anxiously, angling their diary downwards to show the page. “Doodling, I suppose. I’ve never seen Earth outside of London.”</p>\n<p>“Muriel, these are very good, indeed!” Aziraphale exclaimed, looking at them over his shoulder. “You’re quite the talent. Do let me look them over later, won’t you?”</p>\n<p>“Sure,” Muriel blushed, looking very pleased, an inkling of an idea forming in their mind. “I’ve been practicing.”</p>\n<p>“Well, you’ll have plenty of artistic inspiration here. Old villages, lovely beaches, fields of wispy grass,” he rolled the window down and breathed deeply. “And the clarifying smell of the sea. You can only just detect it now, but wait til we get closer. Lovely.”</p>\n<p>Crowley grimaced. “Oh sure, yeah, lovely indeed! No lovelier place to be hunted by, who was it again? Oh yes, the entire Heavenly host!”</p>\n<p>“Not the entire Heavenly host,” Aziraphale murmured. “I <i>am</i> the Supreme Archangel, in case you forgot.”</p>\n<p>“Hadn’t,” Crowley snarled. “Just don’t care.”</p>\n<p>Muriel wasn’t keen to watch the two lose the precious emotional ground they’d made up in the last few hours. Something needed to be done.</p>\n<p>“Let’s find a beach!” They suggested, lifting up a bag. “I brought a few bottles of wine. We can have a picnic!”</p>\n<p>Aziraphale looked over his shoulder, disdain in his voice. “Muriel, two bottles of wine does not a picnic make. Also, it’s 6:43 in the morning.”</p>\n<p>“A daybreak, wine-only picnic is the only kind I’m interested in,” Crowley replied, a bit scathingly. “Great idea, Constable.”</p>\n<p>The Bentley turned down a country road, and within moments they beheld the glorious blue sea crashing mildly against the sandy shore, the beach miraculously (well, not <i> actually</i>) empty. Muriel leapt out of the car, Book of Life in one hand, tote bag in the other, and raced towards the water.</p>\n<p>Aziraphale was right about the ocean air. The weight of the worry Muriel carried seemed to lessen, as though the wind lifted it away and out to sea. All around them, long grasses waved, welcoming them, and gulls called out from the skies.“Hello,” they seemed to say, diving around each other, dancing for Muriel.</p>\n<p>At least, that’s how Muriel saw it. They’d never seen the sea before- not from Earth anyway.</p>\n<p>The effect was not felt as potently by the other members of Muriel’s traveling party. Aziraphale was still in his suit slacks and dress shirt, and Crowley never wore anything suitable for sand. They trudged down to meet Muriel (already sketching a pair of gulls), looking thoroughly out of place.</p>\n<p>“There are three wine bottles,” Muriel said, not looking up. “Help yourself!”</p>\n<p>Aziraphale scowled as he sat down by the tote bag. No one had ever invited him to help himself to his <i>own wine</i>. He pulled out a lovely vintage and realized Muriel had grabbed wines that were both very expensive and very rare.</p>\n<p>Perhaps it was their last opportunity to drink, he thought miserably. Might as well go out with style.</p>\n<p>“I haven’t a corkscrew,” Aziraphale realized aloud, never having needed one before.</p>\n<p>Crowley produced sleek black multitool. Aziraphale looked at him questioningly.</p>\n<p>“It’s a good cover, in case I need to pretend I fixed something without anyone asking questions.”</p>\n<p>Aziraphale nodded. “Thank you.” He brushed sand from his hands and took the tool.</p>\n<p>Crowley sat beside him. The chaos and energy of the last few hours had weathered and dulled into something else. Resentment sat at the forefront of his mind. Its source sat in the sand beside him.</p>\n<p>So Aziraphale was back beside him. So Crowley knew how the angel felt. But Aziraphale had never said the words aloud. And they were the words of an angel who had never been kissed.</p>\n<p>What was Aziraphale thinking now that they had kissed? Did the Aziraphale in the sand believe Crowley deserved more of an explanation, more of a response beyond <i>I forgive you</i>? Or would Aziraphale make Crowley do all the hard parts again, and as always?</p>\n<p>Aziraphale passed Crowley a bottle.</p>\n<p>“Cheers,” Crowley said, and without waiting for Aziraphale to finish opening his own, he clinked their bottles together. He poured the wine down his throat, far too much and far too fast, knowing this would scandalize the angel.</p>\n<p>“To reunions,” Aziraphale said uneasily.</p>\n<p>Muriel sketched steadily, but that didn’t mean they were unaware of the veritable sea of tension behind them.</p>\n<p>Perhaps they hadn’t been on Earth long enough. Perhaps they hadn’t gone native. Whatever the reason Muriel felt completely devoid of romantic or sexual interest, they couldn’t help but feel very blessed to not suffer the way Crowley and Aziraphale did. It sometimes seemed like the two of them chose this pain. They were <i>finally</i> in the same place. A romantic one, at that! And instead of doing, well, whatever it was they <i>ought</i> to be doing (Kissing? Caressing? For God’s sake, <i>talking</i> at the very least?), they were were sitting beside each other, taciturn and messy. If this meant Muriel had to clean things up, well, then Muriel would do what they had to.</p>\n<p>Of course, Muriel knew they ought to be focused on other things. After all, they were in the worst trouble of their existence. But it was <i>scary</i> to think about, so they really rather wouldn’t. Devoting their brainpower, even if just for a moment or two, to their original scheme was a needed escape from….all this nonsense to do with putting the Metatron to sleep.</p>\n<p>Life had never been so complicated before they first stepped foot on Earth.</p>\n<p>A plan was coming together in their mind, but it was devious. It was risky. But (and Muriel was sure of this) it was necessary. As a student of romantic literature, Muriel determined it was the most viable path forward. There was little time to waste.</p>\n<p>They finished the last few details on a very important sketch before slamming their diary shut and standing up. They stretched and groaned, making sure to draw attention to themselves, then turned to face the pair in the sand.</p>\n<p>“When did you open the wine, Crowley?” Muriel asked, walking towards him with a bit of wiggle in their hips and a hand extended.</p>\n<p>“Oh, er,” Crowley replied. “Few moments ago.” Crowley understood that Muriel wanted his wine bottle, but didn’t understand why they would share it when a third bottle sat unopened. He passed it to them anyway.</p>\n<p>“Thank you, Crowley!” Muriel flashed a peppy smile, then slowly tilted the bottle back into their mouth, maintaining eye contact with Crowley as they drank. They punctuated the swig with a half glance at Aziraphale, who, unlike Crowley, very much noticed the entire display and the intention behind it.</p>\n<p>“Crowley, are those ducks as well?” Muriel wasn’t an idiot- they knew they were gulls- but they pointed excitedly at the birds a few yards down the beach with a bubbly giggle.</p>\n<p>“Nah, some kind of seabird,” Crowley replied disinterestedly, sparing them a look and taking his wine bottle back.</p>\n<p>“Those are gulls, Mur-“ Aziraphale started.</p>\n<p>“Let’s look at them!” Muriel said, cutting Aziraphale off entirely and grabbing Crowley’s hand.</p>\n<p>“We can see them well enough from here!” Crowley replied with a groan. But Muriel tugged persistently, so he rose with a begrudging “Fine!”</p>\n<p>“You’ll watch our stuff, right?” Muriel asked Aziraphale in a manner that was rather less a question and more a statement, tossing their diary towards Aziraphale and spraying his torso with sand. “Thanks!”</p>\n<p>Muriel pulled Crowley along, urgently whispering “Crowley, do NOT look back at him.”</p>\n<p>“Wha-?” Crowley allowed himself to be dragged. He had no idea what was going on but had the sense to follow Muriel’s instructions.</p>\n<p>It was a good thing, too, that Crowley did not look back. He very well may have been turned into a pillar of salt by the Archangel, currently staring daggers at the pair of them and beside himself with fury.</p>\n<p>“What’s all this about?” Crowley whispered.</p>\n<p>“The plan, Crowley! Don’t you remember?” Muriel whispered back. “WOW, these birds are LOVELY,” they shouted, angling their chin just slightly to the side, hoping Aziraphale would hear. The birds in question were fighting noisily over the shredded carcass of a crab.</p>\n<p>Crowley stared at Muriel as though they had lost their mind. “We have more important things to worry about right now!”</p>\n<p>Muriel wasn’t listening. They grabbed Crowley’s lapel for a moment, tossing their head back in a laugh, before suddenly turning quite serious.</p>\n<p>“I am going to push you. This is called flirting. I need you to laugh, okay?”</p>\n<p>“What? No! Don’t push me!” Crowley said shrilly, hands raised to defend himself.</p>\n<p>But it was too late. With a glittering laugh, Muriel pushed Crowley, who immediately tried to dodge, failed, and fell face first into the sand.</p>\n<p>He laid there for a second.</p>\n<p>“Crowley?” Muriel laughed for real this time, tickled by how unexpectedly easy it was to knock the demon over. They really had <i>barely</i> pushed.</p>\n<p>Resolutely <i>not</i> flirting, Crowley lashed back out at Muriel, striking towards them like a snake and grabbing their ankle, sending them into the sand as well. Muriel screeched with fear, but quickly turned the sound into one of playfulness. Crowley crawled towards them, spitting sand out of his mouth.</p>\n<p>“What the hell, Muriel? What’s gotten into you?!”</p>\n<p>“No, no, this is perfect. Aziraphale is going to go entirely insane, I promise you,” Muriel squealed hastily, hands protecting their face, palms out in surrender.</p>\n<p>Crowley looked up. Indeed, Aziraphale looked about ready to kill. He took a long gulp of wine and set the bottle down slowly, staring at Crowley murderously. Crowley felt his insides go cold.</p>\n<p>“How is this helping us exactly?” He asked through gritted teeth, sitting back on his legs.</p>\n<p>“It is,” Muriel replied. “Just trust me.” Muriel stood and held out their hand in a peace offering. “He looks, um…mad. Or rather, furious.”</p>\n<p>“I’ve never seen him make that face before,” was all Crowley could say.</p>\n<p>They stood, shaking sand off their bodies, and approached Aziraphale once more. Crowley felt desperately uncomfortable, so he turned towards the sea and walked a few paces towards it.</p>\n<p>That left only Muriel and Aziraphale together. Muriel braced themselves.</p>\n<p>“Thanks for keeping that safe,” Muriel said, too brightly. They were disappointed to see that Aziraphale had not opened Muriel’s diary.</p>\n<p>“Of course,” Aziraphale said, not looking at them.</p>\n<p>Muriel picked up the diary by the edge and opened it slightly, confirming they had opened it to the right page.</p>\n<p>This next move could be very dangerous indeed, Muriel thought, but they hadn’t spent all that time sketching for nothing. They stumbled slightly and dropped the open diary on the sand between them, making sure to toss it in such a way that Aziraphale couldn’t possibly miss what was on the page.</p>\n<p>Lovingly shaded, clad in skintight jeans, was a sketch of one familiar, spectacular arse.</p>\n<p>“Whoops,” Muriel said, ears turning red as they snatched up the diary and hugged it to their chest. Their heart beat madly. They didn’t dare look at Aziraphale.</p>\n<p>The sketch was just a trap, a ploy, but it embarrassed Muriel just as much as if they’d drawn it for personal pleasure. At that moment, they understood that this plan was indeed torture, by all definitions, for all parties.</p>\n<p>Aziraphale didn’t say anything. He looked at Muriel, struggling to form words.</p>\n<p>At that moment, Crowley rejoined the group. “What’s with the face?” He asked Aziraphale bluntly.</p>\n<p>“I think- I think it’s all this sea air,” Aziraphale said, fanning himself. “Or too much wine, perhaps.”</p>\n<p>Muriel felt a pang of guilt. This would all be worth it when they got together, Muriel reminded themselves.</p>\n<p>They were, all of them, silent for a moment, staring at the sea.</p>\n<p>“Shall we look for lodging?” The timber of Aziraphale’s voice was suddenly brighter than usual. Much brighter.</p>\n<p>Crowley didn’t notice it, or perhaps he noticed but didn’t catch the significance of the change, but Muriel knew. Muriel had read enough books to know that this was an indication of resolve, or even of challenge. It was the voice of an angel who had taken stock of the situation before him and found it entirely unacceptable. It was the voice of an angel who was pushed to the edge of comfort and returned with a plan to finally pick up the pace.</p>\n<p>Muriel smiled, trying very hard to make sure Aziraphale didn’t see, feeling very relieved.</p>\n<p>“I suppose we should,” Crowley agreed, making his way to the Bentley.</p>\n<p>“After you, my dear,” said Aziraphale cordially to Muriel, but the energy around him seemed to crackle. Muriel gulped.</p>\n<p>—————</p>\n<p>Within only a few minutes of puttering down the road, they found a lovely seaside lodge. The restaurant beckoned them especially; the smell of fresh bread and lobster was enough to almost make Aziraphale forget their “picnic”.</p>\n<p>“Listen, I’ll check in at the front desk. You two find a table and keep your heads down,” Crowley said, peering around them for signs of ethereal activity. “And do not let that book out of your sight.”</p>\n<p>“Right,” Aziraphale replied. “Come along, Muriel.”</p>\n<p>He caught their eye a moment, and Muriel suddenly felt very small beside Aziraphale, who they liked very much, and who didn’t like them very much back at this moment. Muriel tried to make small talk as they walked towards <i>The Stone Frigate</i>.</p>\n<p>“The seaside is lovely, isn’t it?” Muriel tried first.</p>\n<p>“Perfectly so, yes,” Aziraphale inhaled. “That ocean breeze really goes to one’s head, doesn’t it?” There was the slightest hint of an accusation there.</p>\n<p>Muriel nodded, smiling nervously. “Oh yes! I’m silly with it!”</p>\n<p>“You don’t say?” Aziraphale replied cooly.</p>\n<p>“Have you been to this restaurant before?”</p>\n<p>“Yes, dear, I regularly travel four hours west to dine here at <i> The Stone Frigate</i>.”</p>\n<p>“Ah,” Muriel smiled, but their voice was sad. “Sarcasm, yes. Crowley taught me about that.”</p>\n<p>“Crowley seems to have taught you a lot,” Aziraphale remarked, opening the restaurant door.</p>\n<p>“Oh yes, he’s been a massive help. There’s so much to learn. I haven’t tried much, um, food? But I think I would like to eat what I can now, while I can, just in case…”</p>\n<p>It was a chip in his armor, and Aziraphale’s innate warmth won. “Oh my dear, I will find you whatever on this menu is best, trust me.”</p>\n<p>Though it wasn’t <i>The Ritz</i>, the restaurant was everything a seaside eatery ought to be. The walls were covered with pictures of fisher people and the prizes they caught. Every surface was made of wood, either painted or covered in shiny pitch, and each step made the floorboards creak. It was something like being on a ship.</p>\n<p>It had been ages since Aziraphale had traveled on a wooden ship. He rather liked it, living a life of adventure. He had gone aboard as a priest.</p>\n<p>And luckily so, as he was therefore the only crew member spared by the pirates who commandeered his ship five days into its maiden voyage- never mind that Crowley happened to be their captain.</p>\n<p>Aziraphale willed the memory of a long-haired, sun-kissed, radiantly-freckled Crowley from his mind and returned to the present. On the wall beside the host counter, a large sign listed the catches of the day. ‘Lobster’ was circled in red. Aziraphale loved lobster.</p>\n<p>A young man met them at the counter, fumbling over his words and blushing furiously at Muriel as he led them to a table overlooking the sea. Aziraphale would have found it terribly endearing- on another day.</p>\n<p>“He was nice!” Muriel remarked jovially. “And he gave us bread!”</p>\n<p>A basket of golden, steaming rolls sat before them. Aziraphale groaned happily at the smell.</p>\n<p>He took a roll in his hand, cut it open with a knife, and spread a dollop of butter there. He noticed Muriel studying him.</p>\n<p>“Muriel, have you had bread?”</p>\n<p>Muriel shook their head but licked their lips. “I only eat foods in liquids. Like soup. Or cucumbers from Pimm’s Cups. Or cherries from-“</p>\n<p>“Yes, we know, from Shirley <i>bloody</i> Temples! Always on about those cherries!” Crowley said, walking up to the table and sitting beside Aziraphale.</p>\n<p>He placed a sherry in front of Aziraphale, who noticed Crowley had not brought a drink for himself. Or for Muriel, for that matter.</p>\n<p>“For me?”</p>\n<p>“Looked like you needed one,” Crowley said, not meeting the angel’s eye, and Aziraphale bloomed a little bit. “You ordered yet?”</p>\n<p>“Not yet, but Muriel is entrusting me to pick out something for them that they’ll like.” Aziraphale looked over at Muriel warmly for a split second, then remembered to adjust his face a degree or two cooler.</p>\n<p>Muriel, who had not stopped studying the bread, hadn’t noticed.</p>\n<p>Crowley, studying Aziraphale, had.</p>\n<p>The waiter returned, stuttering again. “Wh-what c-can I-?”</p>\n<p>“Right, I’ll take the strongest coffee you’ve got,” Crowley interrupted. “Nothing else.”</p>\n<p>Aziraphale smiled kindly at the young man. “I’d like the lobster tail please. In fact, two; one for me and one for my friend here. They’d also like an order of bou-boy-“</p>\n<p>“Boilsyba-bou,” Crowley attempted to help.</p>\n<p>“Bouillabaisse?” Muriel finished perfectly.</p>\n<p>“That,” Crowley said defeatedly.</p>\n<p>“Yes, that,” Aziraphale concurred, pretending it did not bother him that Muriel nailed it on the first try.</p>\n<p>“It’ll be out shortly,” the waiter said, not looking at anyone and turning away quickly.</p>\n<p>“That human likes you, Muriel,” Crowley said, watching the boy’s back. “They all seem to, now that I think about it. They’re always winking or tripping all over themselves.”</p>\n<p>“Is that what that means?” Muriel exclaimed loudly. “I couldn’t figure it out! Remember at the Goat Tavern, when…”</p>\n<p>Aziraphale’s attention slipped. He had never really heard Crowley, who was laughing and nodding along to Muriel’s recollection, talk like this. Crowley never seemed to care enough to remember.</p>\n<p>It became clear to Aziraphale that Muriel was important. Was special. Crowley was fond of them. Of course he was; he had offered to stay and help them at the risk of his own immortal peril. The only other person he’d done that for was-</p>\n<p>“Aziraphale? Did you hear me?” Crowley said, snapping in front of the angel’s face.</p>\n<p>“Oh, dear, I’m afraid not. Lost in my thoughts.”</p>\n<p>“I was telling Muriel about that time Job’s boy came on to you, do you remember?” Crowley’s smile was luminous as he tossed his head back and laughed at the memory.</p>\n<p>Aziraphale blushed. “I rather think he was just…outgoing.”</p>\n<p>“He was definitely <i>out</i>, alright,” Crowley laughed again. “Never did find out where he was going.”</p>\n<p>The conversation flowed naturally, and Aziraphale couldn’t help but feel reluctantly awed by it all. He’d never expected to dine with Crowley with a third party involved, and certainly not one who was, somehow, unobtrusive. Aside from Muriel’s obvious pash on Crowley, Aziraphale found their company enjoyable.</p>\n<p>The food arrived; Aziraphale and Crowley both laughed at the expression on Muriel’s face when they were served the lobster. The bouillabaisse smelled wonderful, and was a soup, so Muriel started there.</p>\n<p>“Try it with this,” Aziraphale said, passing a buttered roll to Muriel. “Dip it in.”</p>\n<p>Muriel obeyed. The bread was remarkable; Muriel made that clear without saying a word.</p>\n<p>“Slow down there, Scrivener,” Crowley said, glancing over at Muriel with slight disgust.</p>\n<p>He returned his gaze back to where he’d really wanted it. Aziraphale delicately cut a small sliver of lobster tail, already dripping with lemon juice, and dipped it lightly into a cup of drawn butter.</p>\n<p>He slowly brought the lobster to his lips. In the space of a millisecond, the angel flicked his eyes towards Crowley. Then he slid the fork into his mouth, moaning decadently as he chewed.</p>\n<p>Elbow on the table and chin in his hand, the faintest smile playing on the corner of his lip, Crowley lost himself in looking at Aziraphale.</p>\n<p>“Something on my face, dear?” Aziraphale asked coyly.</p>\n<p>Crowley straightened up, startled. Muriel temporarily paused their ravenous attack on the soup to giggle at him.</p>\n<p>“The lobster,” Crowley choked. “It, it looks nice. Haven’t had lobster in a hundred years, at least, and it wasn’t even fashionable then. Not served with drawn butter in those days.”</p>\n<p>“Here,” Aziraphale said, extending a fork towards Crowley, a perfect piece of lobster stuck to the end, just a little too large to be proper.</p>\n<p>Crowley leaned in, opening his mouth wide to accommodate the morsel, yellow eyes staring intently at the angel’s from behind his dark glasses. Aziraphale took his time extending the fork, wanting Crowley to lean even closer.</p>\n<p>The demon’s lips closed over the lobster and he pulled back, dragging the meat off the fork with him. Neither broke their gaze for a moment, but the pull of Crowley’s mouth was too much for Aziraphale. It was his turn to stare.</p>\n<p>“Very good,” Crowley finally said, dabbing his mouth with a napkin. Aziraphale exhaled heavily, realizing he’d been holding his breath.</p>\n<p>“Y’should try th’bread, ‘s delicious,” Muriel suggested, mouth full. The moment was lost.</p>\n<p>They finished their lunch shortly after, Muriel eating their lobster tail with as much restraint as the gulls on the beach had shown to their crab. They headed towards their rooms, which ran parallel to the sea, and Muriel was besides themselves.</p>\n<p>“I’ve never had a ‘room’ before,” they said, smiling hugely. “Just someone else’s shop! I think I may try,” they giggled mischievously, “jumping on the bed!”</p>\n<p>“Sounds great, Muriel, you enjoy that. Here you are,” Crowley said cooly, passing out keys. “You’re in room 22 here. Aziraphale, we’re in room 23.”</p>\n<p>Aziraphale spluttered, going instantly red. “We?”</p>\n<p>“Is that a problem?” Crowley asked, eyebrow raised, opening the door to the room and revealing two queen beds. There was a door on the left wall, which Crowley promptly opened. Muriel poked their head through joyously.</p>\n<p>“Oh, how lucky! It’s like we’ve got one big room! I’ve never had roommates!”</p>\n<p>A conjoined room and two beds were not what Aziraphale had imagined for their first time sharing a hotel room. More crucially, Muriel was not involved whatsoever in this fantasy.</p>\n<p>“Muriel, bring that book here, would you?” Crowley said, beginning to pace, peeling off his jacket. Aziraphale tried not to stare and busied himself with his wrinkled button up shirt.</p>\n<p>Muriel produced The Book of Life and set it on the bed nearest Crowley. The two of them gathered around it, while Aziraphale watched from his own bed.</p>\n<p>“Should we open it?” asked Crowley hesitantly.</p>\n<p>“Oh, you see, I tried already,” Muriel said. “Only I couldn’t get it to open on Earth. It only opened for a moment, back while I was still in Heaven.”</p>\n<p>At this, Crowley tried to flip the front cover open, but it didn’t budge.</p>\n<p>“You’re up, <i>Supreme Archangel,</i>” Crowley said, passing the book to Aziraphale. He glared in reply to the waspish tone.</p>\n<p>At his touch, the book opened- only to the first page.</p>\n<p>Two words were written there;<br>\n<i><br>\n<s>ENOCH</s></i></p>\n<p>\n<i>METATRON<br>\n</i>\n</p>\n<p>The book would open no further.</p>\n<p>“Oh, drat! They must’ve locked it,” Aziraphale said as Crowley slumped back onto the bed. What good was a Book of Life that didn’t open?</p>\n<p>“Enoch sounds familiar,” Aziraphale said, brow furrowed.</p>\n<p>“Oh, that’s just the Metatron,” Muriel said dismissively. “His original name, you know, from when he was human?”*</p>\n<p>Crowley laughed. “Muriel, that’s an old rumor we made up in Hell.”</p>\n<p>Muriel shook their head. “No, I’m certain actually that Enoch was a man. He lived to be 365. He’s the only man to never die, actually.”</p>\n<p>“But you said he only lived to 365,” Aziraphale said, chortling. “I think we’d know about a 365 year old human.”</p>\n<p>“Oh, right,” Muriel nodded, understanding the confusion. “What I meant is that he lived to be 365 on Earth. After that, God pulled him into Heaven. And he never died! He just sort of…became the Metatron.”</p>\n<p>Aziraphale looked at Muriel with increasing concern. “Humans don’t become angels when they ascend, Muriel. You know that.”</p>\n<p>Muriel looked down at their feet. “Oh, right. Of course. Silly me. I don’t know why I said that.”</p>\n<p>They tried the book a few more times before Muriel decided to see if they could figure out how to work a television- a device they’d only ever read about in books. Returning to their room, Muriel gave Crowley a weighty glance and then closed the door that separated them.</p>\n<p>The atmosphere changed in an instant. Crowley and Aziraphale each sat on their respective beds, not wanting to be the one to speak first.</p>\n<p>After a few moments, Crowley laid back with a sigh and wiggled out of his shoes. It took more effort than he expected; it had been a very long time since he’d removed his shoes manually. He realized how much he took miracles for granted.</p>\n<p>Watching Crowley wriggling on a bed was too much for the angel, so after a few moments, Aziraphale broke. “It’s been ages since I was last in Devon. I’d forgotten how pleasant it is.”</p>\n<p>Crowley simply turned his head and looked at the angel.</p>\n<p>“Have you ever been? I’m sure you have, but-“</p>\n<p>“Spare me the small talk, Angel.”</p>\n<p>Aziraphale’s heart leapt. Crowley had used the word so sparingly in the day since they’d been reunited.</p>\n<p>“Is there something you’d rather we discuss instead?”</p>\n<p>Crowley scowled at the answer. He was sick of Aziraphale constantly making him be the one to talk about <i> real things</i> first.</p>\n<p>“No. Never mind. I’m going to nap.”</p>\n<p>“Oh, Crowley!” Aziraphale scolded. His breath hitched for a moment, as though trying to gather the courage to continue speaking. He swallowed. “What can I possibly say? Because I can’t say I’m sorry for going to Heaven.”</p>\n<p>“No? Not sorry for it?” Crowley’s voice was a low growl.</p>\n<p>Aziraphale steamed. “You’ve read my diaries, actual paper copies of my heart, and you haven’t- you haven’t even mentioned it. What can I possibly say to you that you haven’t already read?”</p>\n<p>Crowley sat up, angry. “You’re right, I read the words of an angel who thought he wanted something, then <i>forgave me</i> once he got it!”</p>\n<p>“You rejected me,” Aziraphale said quickly, heatedly. “You rejected me and then you kissed me immediately after. You punished me, Crowley.”</p>\n<p>“Punished? Rejected?” Crowley was on his feet now, arms flailing. “I asked you to run away with me!”</p>\n<p>Aziraphale scoffed furiously. “And how could I? I had an opportunity to keep you safe, FINALLY, for the first time since you fell. I didn’t want to go back to Heaven, I didn’t want to become an Archangel!”</p>\n<p>“Makes sense why you’d invite me along, then!” Crowley said sarcastically.</p>\n<p>“Don’t you understand it was torture? And I knew, I knew you would never agree to come back as an angel. But I had to ask. Because may-,“ all the fury in his voice broke apart, leaving only wistful regret. “Maybe you would’ve said yes and we would never have needed to be separated.”</p>\n<p>Aziraphale huffed, his big blue eyes watery but his voice steady once more. “All I’ve wanted, for such a terribly long time, is to drink tea in our bookshop and then go for Sunday drives in the Bentley. To go to <i>The Ritz</i> so I can watch you while you watch me. To holiday in Alpha Centauri. To feed ducks peas with you at St. James Park. To bicker with you about my silly fascinations or where in the shop you should put your latest addition to your plant collection. To kiss you in the bandstand during the rain.” He paused, catching his breath, then fixed his eyes determinedly upon Crowley’s, who only then realized he’d taken his glasses off. “For as long as we both shall live.”</p>\n<p>Crowley only stared at him, stunned speechless.</p>\n<p>“And maybe- maybe you’ve thought about…about moving on. Maybe I’ve caused this to break irreparably. But I pray I haven’t, because I can’t imagine existing without you, Crowley. I do believe I’d rather be erased.”</p>\n<p>“Moving on?” Crowley didn’t understand.</p>\n<p>Aziraphale looked at him, anguished, and collapsed on the bed, cradling his face in his hands. “Muriel.”</p>\n<p>“Oh, Angel,” Crowley grinned widely, covered his own face in his hands, and fell back against the bed beside Aziraphale. “You lovely, silly idiot. You couldn’t have possibly believed that?”</p>\n<p>Aziraphale looked over at him, confused and offended.</p>\n<p>“I hate to break it to you,” Crowley began with a giggle. “But Muriel,” he paused to laugh. “Muriel had you fooled. Hook, line, and sinker. Or what was that phrase you liked? Played for a sucker?”</p>\n<p>Aziraphale stood quickly, shocked. He was silent for a beat. “What?”</p>\n<p>Crowley could only nod, giggling too much to speak at the look on Aziraphale’s face.</p>\n<p>“You mean they don’t-“ Aziraphale whispered.</p>\n<p>“Nuh uh,” Crowley replied, trying to contain a laugh. “I’m astonished you bought it.”</p>\n<p>“But that’s- that’s-! That’s utterly devious!”</p>\n<p>“Borderline evil, right?” Crowley wheezed, wiping away a tear. “That’s what I said!“</p>\n<p>“You mean it was <i>Muriel’s</i> idea? The get-togethers? The duck feeding? The sketch of your arse?”</p>\n<p>“Well now, you drew that, remember?”</p>\n<p>Aziraphale clapped his hands to his face in shock. Crowley didn’t even <i>know</i> about that sketch. Muriel seemed to have gone rogue.</p>\n<p>“And you’re quite sure Muriel is not infatuated with you?”</p>\n<p>“Quite,” Crowley grinned. “I think Muriel feels as much romantic interest for others as you feel for <i>The Sound of Music</i>.”</p>\n<p>Aziraphale exhaled heavily. He had greatly underestimated the scrivener.</p>\n<p>“So this was a plot,” Aziraphale said, hands on his hips. “And you went along with it.”</p>\n<p>“To be fair, I mostly stood around doing what Muriel told me to.” Crowley shrugged. “They read all your books, so I trusted they knew what they were doing.”</p>\n<p>At that moment, there was a knock on the door conjoining their room. Muriel opened it slowly.</p>\n<p>“Not a good time, Muriel,” Crowley called to them, but Aziraphale strode over and clasped their hands.\n“Muriel, you wiley little scamp, I’m astonished! However did you come up with your little ruse? You had me completely fooled!”</p>\n<p>“Oh good. You finally know,” Muriel spoke as thought attempting to sound relieved, but couldn’t quite muster it. “Listen, I’m very sorry for-for interrupting,” Muriel continued softly, “but I think there may be a demon in the telly? Is that normal? He told me to stay put. That they’re coming for me.”</p>\n<p>——————————————————-</p>\n<p>Two minutes and twenty-six seconds later, Crowley, Aziraphale and Muriel were back in the Bentley, racing madly away from the little inn. Muriel clung tightly to The Book of Life, as thought it could somehow save them.</p>\n<p>“I need to know EXACTLY what the demon said,” Crowley hissed, scanning everywhere for the first signs of demonic activity.</p>\n<p>“He said something like,” Muriel adopted a strange voice. “‘You must be Muriel, the angel who managed to evade sentencing.’ And I said ‘sentencing?’” Muriel reverted to their normal voice and then back to the strange one again. “‘You know, you were sentenced to Fall, but you ran instead. Hell wants what’s ours.’”</p>\n<p>“Did he mention the book?”</p>\n<p>Muriel shook their head. “No. No mention of the book at all.”</p>\n<p>“Heaven doesn’t want them to know,” Crowley breathed.</p>\n<p>At exactly that moment, a BANG rattled the car. The Bentley swerved erratically off the road and into a dusty field. Whether by demonic intervention or otherwise, her back left tire had popped.</p>\n<p>“Oh fuck, oh fuck, oh fuck,” muttered Aziraphale as Crowley tried to regain control of the car. The plants in the back seat shivered loudly.</p>\n<p>Just then, a roaring sound filled the air. Behind them, dozens of demons appeared out of the ground below, screaming or cheering. It was impossible to tell.</p>\n<p>A second tire popped.</p>\n<p>“I have to use a miracle,” Crowley said, and the Bentley roared on deeper through the field.</p>\n<p>Suddenly, the vents began to drip maggots- a light trickle only, for now.</p>\n<p>A voice said “pull over, Crowley, or I’ll fill the whole car.”</p>\n<p>“I’ll have you know you are threatening the SUPREME ARCHANGEL OF HEAVEN!” Aziraphale shouted to the maggots.</p>\n<p>“We don’t want you,” Hastur snarled. “We only want to bring our new friend home where they belong.”</p>\n<p>Muriel screamed.</p>\n<p>Aziraphale turned to Crowley. “We have to get out of the car. We can’t fight and drive or we risk getting discorporated, and I do believe that’s the last thing we want right now.”</p>\n<p>Crowley knew he was right. With a grunt of fury, he threw the car into a hard spin and came to rest facing the advancing crowd of demons.</p>\n<p>They leapt from the car. Aziraphale and Crowley flanked Muriel, who held the book tightly as they trembled.</p>\n<p>“Stay BACK,” Aziraphale yelled, and suddenly he was emitting a golden light. He stepped forward with his arms spread to protect Crowley and Muriel, and sent a blast of energy towards the horde. It was loud; loud enough to drown out the sound of the Heavenly trumpets that sang out into the evening sky.</p>\n<p>“That was a warning!” Aziraphale hollered. He could see demons he recognized in the crowd, many from the attack on his shop. Others he did not recognize, and they looked far worse than those in the former category. They were frightening, but Aziraphale was not afraid.</p>\n<p>“So is this,” said a voice behind them, and a burst of light brought the three to their knees.</p>\n<p>“Shouldn’t have done a miracle if you wanted to hide, Aziraphale,” Uriel drawled.</p>\n<p>Angels, far outnumbering the demons present, filled in a half-circle around them. The disorderly pack of demons closed the circle. They were surrounded.</p>\n<p>“You can leave,” Michael said to the demons. “We’ll deliver Muriel immediately after their sentencing.”</p>\n<p>“Nothing doing,” Hastur replied. “I found them, I’m not leaving without them. Besides, it took forever to get everyone here. Woolfardisworthy, complete bollocks…”</p>\n<p>As they argued, Aziraphale whispered, still on his knees. “Muriel, now would be the right moment to believe your way into saving us.”</p>\n<p>A tear fell down Muriel’s cheek. “I’ve been trying to do miracles since the tire popped. Nothing’s worked. I think,” they began to weep, “I actually think <i>I</i> made the second tire pop.”</p>\n<p>Crowley’s eyes found Aziraphale’s. This seemed like the end. They grabbed each other’s hands.</p>\n<p>“Enough arguing,” snapped a voice. The Metatron stepped through the crowd directly where the demons and angels met.</p>\n<p>“Who the hell’re you?” Hastur spat.</p>\n<p>At this moment, the Metatron’s walk was impeded by the presence of a demon with hair like rabbit ears.</p>\n<p>The Metatron coughed. Eric turned to face him with a smug grin. “Need something, old timer?”</p>\n<p>In a blast of confetti, Eric was gone.</p>\n<p>Hastur looked down hastily and moved further away from the Metatron.</p>\n<p>“Angels of Heaven,” the Metatron addressed them loudly. “Demons of Hell.”</p>\n<p>“You see before you three traitors; three traitors to Heaven, one of whom is so industrious that he also managed to become a traitor to Hell. The Demon Crowley has corrupted both our lowliest scrivener, Muriel, and our Supreme Archangel, Aziraphale. With only enemies left to them, they took off with my Book of Life to erase you all from existence.”</p>\n<p>The crowds around them gasped. Aziraphale protested.</p>\n<p>“You must believe me, we would never!”</p>\n<p>Crowley interjected softly. “Not <i>all</i> of you, anyway.”</p>\n<p>“QUIET!” The Metatron bellowed. He turned to Aziraphale.</p>\n<p>“It’s not that you would never, Aziraphale, it’s that you <i>could</i> never. You aren’t powerful enough to open my Book. Not Beloved enough.”</p>\n<p>The Metatron turned to face the crowd.</p>\n<p>“You all shall see God’s power today. You will watch as these three are erased, you will see exactly why Angels and Demons do not work together. And you will not remember their names, faces, or their deeds, but you will remember this moment.”</p>\n<p>From somewhere in the crowd, a demon spoke.</p>\n<p>“But didn’t these two do, I dunno, kinda necessary things? Don’t we…need them becaAAAAAH!”</p>\n<p>With a snap, this second Eric became confetti.</p>\n<p>“Muriel, now if you please; my Book.”</p>\n<p>“I’m sorry, Metatron, b-but I won’t,” Muriel choked.</p>\n<p>“I’m sorry, Muriel, but you will.” The Metatron gestured softly with a single index finger.</p>\n<p>Muriel stood quickly, and very straight. Too straight. Their spine seemed to pop and crack. They let out a cry of pain.</p>\n<p>“Come now. Enough of this foolishness” the Metatron said, giving Muriel a look of hatred, and Muriel took a single, agonizing step towards him. Everyone could see this was against Muriel’s will.</p>\n<p>“Muriel, no!” Crowley said. At that moment, he grabbed Muriel’s hand, still clutching Aziraphale’s.</p>\n<p>Muriel froze. Crowley turned to his angel, eyes wide with fear behind his glasses.</p>\n<p>“Angel, what do we do?”</p>\n<p>Aziraphale looked at the crowd around them, understanding fully that the three of them were, perhaps, the most hated beings to exist. The only allies they had were each other. In that final moment, Aziraphale needed to make sure Crowley knew.</p>\n<p>“Oh Crowley, my dear Crowley,” he sighed, lip trembling as he scanned the demon’s face. “I love you.”</p>\n<p>He held Crowley’s face with his free hand and kissed him. It was desperate, like their first kiss, but the similarities ended there. Both kissed with equal passion, equal need. Crowley separated his hand from Aziraphale’s and used it to hold the angel closer.</p>\n<p>The crowd surrounding them roiled with disgust and fury. The Metatron silenced them with a wave of his hand.</p>\n<p>“MY BOOK, MURIEL,” he demanded, his voice terrifying. Not by their own accord, Aziraphale and Crowley broke apart as if pulled by two giant claws. Crowley quickly scrambled to grab Aziraphale’s hand again. If Aziraphale and Muriel were going to disappear, they wouldn’t be alone in their last moments. <i>He</i> wouldn’t be alone in his. He looked at Muriel and Aziraphale, and wanted so badly to spare them, that suddenly, he believed he could.</p>\n<p>A massive purple dome sprung forth from the three figures at the center of the circle. It knocked down all angels and demons, and pushed one Metatron back. Wings shot forth from the trio’s backs, and The Book of Life fell from Muriel’s hands and landed on the ground in front of Crowley.</p>\n<p>They could stand again, so Aziraphale and Crowley rose up together. Aziraphale held Crowley’s right hand, and Crowley held Muriel’s.</p>\n<p>“What happened?” Muriel asked, gazing at the angels and demons as they slowly got back to their feet up, rubbing their heads or wings.</p>\n<p>“I did a miracle,” Crowley said softly. “But I’ve never seen one look like that. Did you—?” He turned to Aziraphale.</p>\n<p>“Yes, I did one too,” Aziraphale whispered. “I tried to…to protect you both.”</p>\n<p>“Me too,” Crowley said breathlessly. He felt very powerful. Invincible, maybe.</p>\n<p>“The book!” Muriel cried.</p>\n<p>Responding to the potent energy around it, the Book of Life swung open. Its pages flipped rapidly before them, landing finally on a page near the front. One name seemed to be highlighted with light.</p>\n<p>Muriel peered at it. “Enoch,” they said. “See? I told you!”</p>\n<p>Aziraphale and Crowley stood on either side of Muriel and began to read.</p>\n<p>\n<i><s>Enoch</s>, son of Jared. Status: Alive. Species: <s>human</s>. Year of Birth: 3384 BC. Year of Death: N/A. </i>\n</p>\n<p>Scribbled in the margin was a single word: <i>Metatron</i></p>\n<p>Crowley looked over at the Metatron and grinned. “Usually people with bad first names don’t change them to worse ones,<i> Enoch</i>.”</p>\n<p>The Metatron colored a deep red and stomped towards the book. “Give me that!”</p>\n<p>Suddenly, the book’s pages flipped and flipped some more. Only this time, the trees surrounding the field began to sway wildly as well, and dust lifted in the wind all around them, and then, as if the universe itself was inhaling-</p>\n<p><i>She</i> was there. Winds whipped and clouds rolled rapidly, and a beam of brilliant light fell on the three of them.</p>\n<p>Her voice rang out, like that of a stadium of people, and yet still somehow only one voice. “Aziraphale, Crowley, please stand aside. I need a word with Muriel in private.”</p>\n<p>Crowley gazed up at the source of the light, agog for a moment, then released Muriel’s hand and tried to drag Aziraphale out of the light beam. The angel resisted, frightened for his friend- he couldn’t bear to see another good angel fall.</p>\n<p>“Don’t worry,” Muriel said, trembling from head to toe but smiling at them anyway. “We-we can always t-tell you everything we talked about afterwards.”</p>\n<p>It hadn’t been very long since Aziraphale had said those words to Muriel.</p>\n<p>“Great. Thanks.” His voice was tinny.<br>\nHe followed Crowley outside of the beam of light.</p>\n<p>From outside the light beam, God’s voice could be heard but not understood. The angels and demons surrounding them had fallen to their knees. After a moment, Crowley and Aziraphale did too, still grasping the other’s hand. No one thought to capture them. All eyes were turned upward.</p>\n<p>Almost all eyes, rather. A few yards from them, something very strange seemed to be happening to the Metatron. He was trembling, panicking even. His were the only eyes not glued on the light above. He scanned the crowd. His eyes fell on Crowley and Aziraphale and he scrambled towards them.</p>\n<p>“You blithering idiots,” he hissed. “You absolute-!”</p>\n<p>God spoke. “No more of that, Enoch.”</p>\n<p>The Metatron crumpled, looking like he was asleep, and maybe he was. God’s voice returned to the the beams, only for Muriel to hear.</p>\n<p>All Muriel could think, standing under God’s light, was how they got here in the first place. How only a night before, the Metatron was scolding them in Heaven.</p>\n<p>\n<i>“Muriel, as you should already know, demons and angels do not intermix. They do not forge friendships. They do not drink at the pub together, or feed ducks. If Archangel Aziraphale accepts this, why can’t you?”</i>\n</p>\n<p>\n<i>“I’m sorry, I- suppose I, I, I don’t understand why? I’m sorry,” Muriel was nervous.</i>\n</p>\n<p>\n<i>“You don’t understand? Even an angel as dim as you should be able to grasp this.”</i>\n</p>\n<p>\n<i>From the corner of their eye, Muriel could see Michael’s lips curl into a smile.</i>\n</p>\n<p>\n<i>Muriel swallowed. “I only mean to say, if one demon can wind up redeemed, even just a little, by befriending an angel, well…shouldn’t we want that for all of them?”</i>\n</p>\n<p>\n<i>“Would you risk your purity, your holiness, to redeem a fallen angel?”</i>\n</p>\n<p>\n<i>“I don’t see why I would have to risk anything,” Muriel said apologetically. Disagreements weren’t easy for them. “Crowley isn’t with Hell. He’s good, even if he’s not, well, Good.”</i>\n</p>\n<p>\n<i>“Well, thanks to your interesting philosophy, Crowley won’t be anything now,” the Metatron hissed. The Book of Life fell from somewhere and onto the table in front of the Metatron.</i>\n</p>\n<p>\n<i>“Your Holiness?” Uriel tilted their head. Erasures were not commonly performed.</i>\n</p>\n<p>\n<i>“Uriel, tell the Heavenly Host that Muriel…” the Metatron glared at them coldly. “That Muriel has fallen.”</i>\n</p>\n<p>\n<i>Muriel gasped, unable to speak. They collapsed in disbelief and began to weep upon the floor.</i>\n</p>\n<p>\n<i>“Michael,” the Metatron spoke louder so ans to be heard over the sound of Muriel’s sobs. “Inform Hell that they should expect a new arrival.”</i>\n</p>\n<p>\n<i>Michael nodded curtly, sparing Muriel a blank look, then followed Uriel away.</i>\n</p>\n<p>\n<i>“Saraqael, we shall need a new angel to fill Muriel’s vacant post. Find someone suitable.” Muriel could hear them speed away.</i>\n</p>\n<p>\n<i>Muriel didn’t know why they were surprised that none of the angels objected to Muriel’s sentence.</i>\n</p>\n<p>\n<i>“Now,” the Metatron faced Muriel. “Have you anything to say for yourself?”</i>\n</p>\n<p>\n<i>Muriel looked up. The Metatron looked old, so very old, and so very powerful. “Please,” they said.</i>\n</p>\n<p>\n<i>The Metatron sneered. “You fallen angels all say the same thing in the end. How very predictable.”</i>\n</p>\n<p>\n<i>Muriel thought of another fallen angel. One who told them they only needed to give themselves permission to be extraordinary.</i>\n</p>\n<p>\n<i>“Go to sleep!” Muriel commanded suddenly.</i>\n</p>\n<p>\n<i>The Metatron looked at them. “Excuse me?”</i>\n</p>\n<p>\n<i>“I said,” Muriel stood, trying to look powerful too. “Go to sleep!”</i>\n</p>\n<p>\n<i>The Metatron laughed. “My dear, I haven’t slept since I was a-“</i>\n</p>\n<p>\n<i>“GO TO SLEEP, RIGHT NOW, PLEASE!”</i>\n</p>\n<p>\n<i>The space between them filled with purple mist. It cleared, and the Metatron’s giant head lolled forward, eyes closed.</i>\n</p>\n<p>\n<i>Muriel couldn’t believe it.</i>\n</p>\n<p>\n<i>“Are- are you tricking me?” Muriel whispered, a finger outstretched, wondering if poking the Metatron would wake him. They then wondered if touching the Metatron was even possible. Would they explode if they tried?</i>\n</p>\n<p>\n<i>They picked up the book from the table, and, ever so gently, touched his cheek with it. The book flipped open.</i>\n</p>\n<p>\n<i>“WHAT the BLAZES?” Michael shouted, returning with Uriel and Saraqael. Muriel turned around, tucking the book in their coat, more out of habit than intention.</i>\n</p>\n<p>\n<i>Michael stood between the gateway and Muriel, hand outstretched, pointing. “What have you done to him?”</i>\n</p>\n<p>\n<i>Muriel may have blacked out at this point. They knew they had evaded the angels, and that it required a very lot of running. They also knew that they’d set off some kind of defensive miracle that locked the gateway behind them as they leapt through it and into Aziraphale’s shop. </i>\n</p>\n<p>“Muriel,” God said neutrally. Muriel shook their head as if to erase the thoughts. How had it been only a day since then?</p>\n<p>God’s light brightened and Muriel fell to their knees.</p>\n<p>“You’ve been busy lately.”</p>\n<p>Muriel nodded. “Y-yes, Almighty God.”</p>\n<p>“Shirley Temples, road trips…even stealing books.”</p>\n<p>Muriel’s eyes widened with fear.</p>\n<p>“What gives you the right, Muriel, to face the Metatron and defy him? Well?”</p>\n<p>Muriel sputtered, bowing their head into the dirt of the field. “Oh, Almighty, I-“</p>\n<p>“Are you going to say you’re sorry?” God spoke over Muriel, silencing them. “Don’t.”</p>\n<p>“You did what you did to protect your friends. You defied the Metatron, highest of Heavenly beings, to save the soul of a demon.”</p>\n<p>Muriel couldn’t tell if God was pleased.</p>\n<p>“Did you not?”</p>\n<p>“Y-yes, Almighty God, I- I thwarted your will.” Muriel began to weep.</p>\n<p>“Your friend Aziraphale said it well; The Metatron is God’s voice, not God’s will. As it happens, I don’t have very much to say, typically.”</p>\n<p>She continued. “I could destroy you for this. But I won’t.”</p>\n<p>Muriel exhaled, tears streaming down their face. “Thank you, Almighty God! You are so merciful!”</p>\n<p>“Yes, alright,” God said disinterestedly. “You seem like you want to ask me something. You may.”</p>\n<p>There were many better questions to ask the Almighty, but Muriel couldn’t think of any. “How did I do all those things I did? To the Metatron, and the archangels, I mean…”</p>\n<p>“I let you,” God said simply, and Muriel understood that She wasn’t arrogant. She spoke of her ability with no awe, like a person describing taking a walk or making a sandwich. Controlling everything was as simple as blinking to Her.</p>\n<p>Muriel wondered if She even had physical eyes that blinked.</p>\n<p>“Plus,” God continued, amused, “Enoch really did need a nap. All that Second Coming nonsense, after I’d just made it clear to both Heaven and Hell that I have no interest in ending the world right now…” God stopped. “You look confused.”</p>\n<p>“Maybe just a little,” Muriel tried to understand. “You gave me temporary abilities, for a few minutes.”</p>\n<p>“No, for a few milliseconds, a few different times. You can’t possibly understand, but I’ll explain anyway. I am in every second for as long as I want to be. I can make every second stretch- I do it all the time. A second or a thousand years feels the same to me. I have no beginning, no end. I am not of time.”</p>\n<p>Muriel tried to wrap their head around that and found it impossible to imagine experiencing, but not difficult to comprehend.</p>\n<p>“So you were in each moment I attempted a miracle.”</p>\n<p>“Yes.”</p>\n<p>“And you…adjusted my settings each time?”</p>\n<p>“Exactly.”</p>\n<p>“So I’m not especially powerful, then?” Muriel said, smiling in order to cover other feelings.</p>\n<p>“Not compared to me,” God replied.</p>\n<p>“Oh, yes, of course not!” Muriel laughed, utterly terrified that their question was somehow disrespectful. Then it struck them that saying ‘of course’ may have been disrespectful. They shut up.</p>\n<p>“But you are a very good Scrivener. Exceptional even,” God said kindly. “Enoch is ready to rest now, which means I need a new scribe. Someone who knows right from wrong. Someone I can trust with my Book. Someone who won’t use a silly title like ‘The Metatron’. Blecch.” God laughed.</p>\n<p>Muriel’s eyes grew wide. “You mean…?”</p>\n<p>“Uh huh. So go tell them goodbye. We have work to do,” God said.</p>\n<p>“Oh yes, of course.” Muriel smiled even wider than before, as though that would stop them from crying.</p>\n<p>This was an incredible, unfathomable honor- perhaps the highest honor. But, amid all of this glory, there was one thing that hurt.</p>\n<p>God, being God, knew what Muriel thought; Muriel believed God wanted them to say goodbye to the only friends they’d ever had.</p>\n<p>“Don’t worry, Muriel. You’ll be able to say hello whenever you’d like. He has a gateway, after all.”</p>\n<p>“Aziraphale won’t be coming back?”</p>\n<p>“No,” God said plainly. “He’s earned a break.”</p>\n<p>Muriel nodded happily. “Oh! Jolly good!”</p>\n<p>Muriel scanned the crowd: Aziraphale and Crowley knelt on the outskirts of the light beam, among the crowd of angels and demons who had come for the book thief and instead found themselves awed by Her ineffable glory. Muriel trotted up to them.</p>\n<p>“Muriel, what did the Almighty say?” Aziraphale was breathless.</p>\n<p>Muriel tried very hard at first not to look too pleased with themselves, but quickly gave up. “Everything’s okay! I’m being promoted! New Metatron! Me!”</p>\n<p>“You’re kidding!” Crowley cried, grasping Muriel’s hands and cheering excitedly along with them. Immediately, he cleared his throat harshly and remembered himself. Aziraphale looked at Crowley fondly.</p>\n<p>“Not kidding- look!” Muriel held the book in their hands, wide open. Enoch’s entry had changed.</p>\n<p>\n<i><s>Enoch</s>, son of Jared. Status: Deceased. Species: <s>Human</s>. Year of Birth: 3384 BC. Year of Death: 2023. </i>\n</p>\n<p>“Wow,” gasped Aziraphale. He glanced at the place where the Metatron had been. Nothing remained but a black suit jacket.</p>\n<p>“And here’s mine!” Muriel said, flipping further into the middle of the book, having no trouble turning the pages now. “Muriel, former scrivener, Voice of God the Almighty.” They puffed their chest up proudly.</p>\n<p>Overcome, Crowley balled his hand into a fist and congratulatorily rapped them on the arm. There was not even a smidge of condescension in it.</p>\n<p>“Your entries changed, too,” Muriel said happily, flipping the page and indicating a line entry with their index finger. The first word was entirely blacked out. The second, <i>Crawly</i>, was struck through. Crowley’s line then read:</p>\n<p>\n<i> Crowley. Status: Alive. Species: <s> Archangel </s> <s>Demon </s> ???</i>\n</p>\n<p>Muriel then flipped to another page, holding the book out to Aziraphale.</p>\n<p>“No, dear, I don’t want to see it.” Aziraphale stepped back hastily. “I know what I am. I don’t want a label for it.”</p>\n<p>Muriel nodded and smiled, closing the Book of Life.</p>\n<p>“Turns out Enoch had gone a little, uh, bloodthirsty there. God hadn’t actually wanted most of what was going on, so there’ll be staffing changes, I’d expect. However, this <i>does</i> mean I’ve got to go up to Heaven, now.”</p>\n<p>They paused. Then, with a little wail, Muriel threw their arms around Crowley first, and Aziraphale second.</p>\n<p>The angel patted their back fondly. “Mur- I mean, Metatron, will we still be able to-?”</p>\n<p>“<i>Muriel</i> is fine, Aziraphale. I’ll be busy being God’s scribe,“ (they gave a proud, important sort of wiggle), “but you can say hello any time with the gateway. God said so Herself!”</p>\n<p>“Good. We really need some Us Time after all this.”</p>\n<p>Muriel smiled awkwardly, glancing down at Crowley and Aziraphale’s intertwined fingers. “Of course, I’m sure you two are ready to have time, just the two of you.”</p>\n<p>“I meant <i>US</i> time, Muriel. The three of us,” Crowley said with a wobbly grin.</p>\n<p>“Oh.” It was all Muriel could do not to cry.</p>\n<p>“Copious amounts of alcohol at <i>the Ritz</i> sound about right?” Aziraphale suggested, wiggling an eyebrow at Crowley.</p>\n<p>“No, The Goat Tavern!” Muriel clapped, regaining the ability to speak. “I’d like to say hello to my pub friends. Might even try out <i>winking</i>,” they said deviously, causing Crowley to laugh loudly.</p>\n<p>“Muriel,” God said, and this time Her voice reached the crowd. “Come along now, we have a great deal of organizational restructuring to address. You can catch up with them on Sunday. Right, Aziraphale?”</p>\n<p>Aziraphale stammered. “Sunday’s schedule is completely open!”</p>\n<p>“Good,” God replied. “And you do understand you’ve been fired, right?”</p>\n<p>Aziraphale stuttered a few moments. “Yes, I- I do.”</p>\n<p>“Don’t look so happy, Aziraphale,” God said, great affection in Her voice. He adjusted his facial expression immediately, failing to look somber.</p>\n<p>“Crowley,” God’s tone changed. The clouds darkened.</p>\n<p>Crowley realized his glasses had disappeared from his face and were suddenly in his left hand. He looked up at Her light, nothing separating his eyes from Her glory. Nothing to hide behind. He was frightened, but he was determined to keep his back straight.</p>\n<p>God was silent for a moment.</p>\n<p>“I’m very proud of you, you know,” She said finally. “Time to go, Muriel.”</p>\n<p>With a happy giggle, Muriel walked towards the center of Her light. They turned to face their friends, waved excitedly, then the light was out. Muriel was gone.</p>\n<p>The crowd of angels and demons stared, open-mouthed, at the place Muriel vanished. Crowley wiped tears from his eyes and returned his glasses to his face.</p>\n<p>In a breath, Aziraphale found himself surrounded in Archangels. He held Crowley’s hand tighter, who pulled him close.</p>\n<p>“Well??” Michael demanded furiously.</p>\n<p>“What happened?” Uriel was only slightly calmer than their peer, but their eyes seemed to bug out of their head as they stared between Aziraphale and his boyfriend in the dark glasses.</p>\n<p>“Ask the new Metatron,” Crowley said proudly. “Just missed them, though. Bad luck.”</p>\n<p>“Who? You can’t possibly be referring to <i>Muriel</i>?”</p>\n<p>Crowley and Aziraphale turned away and walked towards the Bentley, hand in hand. Michael continued shouting, threatening, and soon other angels joined in as well. The demons who didn’t disappear the moment God arrived ran alongside them, demanding answers of their own.</p>\n<p>“I’m terribly sorry, but we’re not taking questions at this time,” Aziraphale said briskly, reaching the car. Crowley opened the door for him.</p>\n<p>“After you, Angel Supreme.”</p>\n<p>“<i>Former</i>, my dear,” Aziraphale replied, sliding into the passenger seat.</p>\n<p>“Not to me,” Crowley said quietly into the angel’s ear before closing the door for him.</p>\n<p>Suddenly, Crowley was blasted by twin jets of white and red energy. Hastur was there, arm raised. A few feet to his right, Michael pointed at Crowley too.</p>\n<p>He turned to them. “Ah, would you look at that! Heaven and Hell, working together again! I thought you lot were trying to avoid that.”</p>\n<p>Michael and Hastur glanced at each other anxiously. This dual attack was not intentional.</p>\n<p>“Why’re you still…?”</p>\n<p>“Fine?” Michael finished, sounding stupid and knowing it.</p>\n<p>“The Almighty’s Protection, I should think?” Aziraphale pipped, rolling the car window down and poking his head out.</p>\n<p>The truth was, Crowley and Aziraphale had both felt a change, a shift, when their miracle took hold. Crowley had kept Aziraphale safe, and Aziraphale had the pleasure of finally rescuing Crowley in return.</p>\n<p>They didn’t have an answer as to why the miracle was still holding; perhaps it was thanks to the new powers bestowed upon a new Metatron. Maybe it was an act of God’s Grace. It didn’t really matter- all they cared about was that it seemed, at least for now, that neither the Heavenly Host nor the agents of Hell could touch them. For the first time in thousands of years, they felt safe.</p>\n<p>“If God’s protecting you, why’re you still a demon?” Uriel asked, sounding more confused than upset, like they were on the cusp of understanding something very important and yet so very simple.</p>\n<p>“Because he’s absolutely <i>perfect</i>,” gushed Aziraphale, gazing adoringly up at Crowley.</p>\n<p>Crowley leaned against the car, grinning smugly as though sunning himself in the angel’s praise. “Alright there, Hastur? Been a long time! What’ve they got you doing these days?”</p>\n<p>“M-maintenance. Investigations if they ask,” he stuttered, almost against his will. He was unsure of what kind of consequences he might face by ignoring one of God’s favorites. He didn’t want to find out.</p>\n<p>“Right, enjoy that then,” Crowley strode around the car. “Best be off, now! Go on, you lot, back to your offices! Shoo!” He urged them away like a farmer shooing crows out of his garden. Some actually listened.</p>\n<p>“See you all, well, <i>never</i>, I should hope!” Aziraphale added out the window, laughing in a tinkling, sparkly way.</p>\n<p>Crowley hopped into the driver’s seat and they were off, the Bentley, all four tires intact, spurring up dust in their wake.</p>\n<p>Wiping said dust from their face, Michael looked desperately at the angels and demons around them.</p>\n<p>“Am I the only one wondering what the actual fuck just happened?”</p>\n<p>Suddenly, a plume of dark purple smoke appeared, sending Michael stumbling back and into a coughing fit.</p>\n<p>“Woolsery!! I’m here! Made it!” Shax shouted triumphantly. She looked around at the mass of angels and demons, who all looked thoroughly bemused and aimless, some of whom were returning to their respective offices.</p>\n<p>“Don’t tell me it’s already started?”</p>\n<p>——————————</p>\n<p>A few hundred miles later, the Bentley traversed the final few Soho streets leading up to the bookshop. Its driver could’ve miracled themselves there directly, but the drive was calming. Pleasant. The Bentley drove at a pace somewhere in between Crowley and Aziraphale’s preferences; both were surprised to find this agreeable. It was nighttime now.</p>\n<p>“My dear,” Aziraphale said softly, studying the way the passing streetlamps tossed lights and shadows across Crowley’s face. “I want to go celebrate somewhere, but I must admit, I’ve been so very homesick… May we stay in tonight and have breakfast tomorrow?”</p>\n<p>They pulled up in front of the shop.</p>\n<p>Crowley didn’t know what this meant for him, so he left the engine running as Aziraphale stepped out. “As in- do I- should I go-?”</p>\n<p>Aziraphale opened the backseat of the car and pulled out a box of plants, ignoring the question entirely. “Come along, my dear, let’s get your things inside. Won’t these add some life to the shop!” Aziraphale smiled lovingly at a ficus, whose leaves waved shyly back.</p>\n<p>“To- your-?” Crowley’s brain was offline. He stumbled out of the car.</p>\n<p>“And do hurry, Crowley. I think I’d like to give sleeping a try. Can you teach me?”</p>\n<p>Crowley gaped at the angel, unable to move. Aziraphale gave him a look as if to say “well?”</p>\n<p>Crowley remembered to breathe. “No, no, I need some <i>direct</i> words for whatever…this is.” If Crowley had learned anything, it was that they couldn’t continue hoping the other would read their mind. He had a feeling that, now that Aziraphale had returned, his diaries would be off-limits once more.</p>\n<p>“Yes, of course.” Aziraphale set the box of plants on top of the Bentley. His eyes burned with purpose. With sincerity.</p>\n<p>“I want you to bring <i>our</i> plants into <i>our</i> shop, open a bottle of wine from <i>our</i> collection, and drink it with me in <i>our</i> bed.”</p>\n<p>Faster than even he knew he could move, Crowley rounded the Bentley, tearing off his sunglasses and stopping centimeters from Aziraphale’s face. “And?” He whispered fiercely.</p>\n<p>Aziraphale flushed. The proximity was too much. Crowley’s eyes were too much. “And be mine.”</p>\n<p>It was what Crowley needed to hear and what Aziraphale needed to say. They moved together, Crowley marveling at the willingness of Aziraphale’s lips, the strength of his hands against Crowley’s back as they pulled him in closer, closer still. Could they ever be close enough?</p>\n<p>There were no lapels for Crowley to grab, so one arm slipped around Aziraphale’s torso while the other buried itself in his hair. Aziraphale’s arms slid up over Crowley’s shoulders and looped around his neck. They swayed together, deliriously happy. <i>This</i> was the kiss they’d been waiting for.</p>\n<p>“Aw!!! Yay!” A joyful and familiar voice from the sidewalk rang out, causing the two to break apart.</p>\n<p>“Maggie! Don’t interrupt them!” Nina scolded in a loud whisper, pulling her girlfriend into the coffee shop. A second passed, then both women pressed their faces against the glass to get a better look.</p>\n<p>Crowley and Aziraphale took a step back from each other, but couldn’t remove their hands entirely.</p>\n<p>“Perhaps we should-?” Aziraphale said, flicking his head towards the door of the shop as it opened on its own.</p>\n<p>“Oh, we definitely should,” Crowley replied hungrily. In a snap, the plants had disappeared. He grabbed his angel’s hand and led him inside. Into <i>their</i> shop. Into <i>their</i> home.</p>\n<p>Early Sunday morning, Crowley awoke to soft kisses on his lips. Aziraphale was still getting the hang of sleeping. He couldn’t seem to do it for more than a couple hours at a time, and didn’t know that it was generally considered rude to wake someone else in the wee small hours of the morning just to kiss them.</p>\n<p>Crowley would, of course, never tell him that, and furthermore, would likely kill anyone else who tried.</p>\n<p>“Oh good, you’re up!” Aziraphale punctuated the sentence with another kiss.</p>\n<p>Crowley groaned, feigning irritation, and wrapped his arms around the angel, reveling in the warmth their bodies generated under the covers.</p>\n<p>Crowley kissed Aziraphale’s nose. “It’s 4:17 in the morning, Angel.”</p>\n<p>“Yes! Technically morning,” Aziraphale replied brightly.</p>\n<p>“<i>Technically</i>,” Crowley conceded with a nod, then pressed his face against Aziraphale’s. “Good morning, Angel.”</p>\n<p>“Good morning, my dear.” Aziraphale, not wasting any opportunity to kiss his Crowley, brought their lips together again.</p>\n<p>There’s something thrilling and tragic about desperately wanting something, only to discover, once you have mustered the courage to give it a go, it’s your favorite thing you’ll ever do. Aziraphale and Crowley both mourned the wasted time. Six thousand years on Earth they could’ve spent holding each other. It ached; there was only one cure for it.</p>\n<p>“Hold me tighter, Angel,” Crowley whispered against Aziraphale’s neck.</p>\n<p>Aziraphale drew Crowley against him ever tighter. “This good?”</p>\n<p>Crowley shook his head, his hair tickling Aziraphale’s cheek. “Not enough. I need more.”</p>\n<p>“My dear, I don’t think that’s possible,” Aziraphale said, pulling his head back to smile fondly at Crowley.</p>\n<p>Crowley returned the look with a darker one, needy and flustered. Suddenly, Aziraphale understood what Crowley meant.</p>\n<p>“On second thought,” the angel growled softly. They were kissing again.</p>\n<p>~~~~</p>\n<p>They could’ve stayed there all day, but by eleven, Crowley was doing his best to get a stubborn Aziraphale out of bed.</p>\n<p>“We have things to take care of, Angel! Muriel’s stopping in, remember?” He sighed, admiring the angel, all pink-cheeked and cozy in the bed they shared, and found himself wishing he could live in that moment and never leave.</p>\n<p><i>This is an every day thing, Crowley. Aziraphale in a bed is a part of your life now. Stay focused, </i> urged the voice in his head. It hurt to get out of bed when Aziraphale so badly wanted to stay in it.</p>\n<p>Aziraphale opened his eyes a sliver to confirm what he hoped was happening actually was happening: Crowley, biting his lip, gazed longingly at him. The angel smirked.</p>\n<p>“Isn’t there anything I can do to…tempt you to stay?” He fluttered his eyelashes just so.</p>\n<p>Crowley’s cheeks flushed— <i>that </i> was playing dirty. He grabbed the corner of the downy comforter, yanking it off the bed and the angel in it.</p>\n<p>“C’mon, Angel! Rise and shine, now- you’re so good at it.”</p>\n<p>“Foul fiend,” Aziraphale whined, rolling over and speaking into the pillow.</p>\n<p>Crowley, watching the sad display with his arms crossed and hip jutting out, realized he had one surefire way to get Aziraphale out of bed. He raced downstairs, then returned holding one thick, leather-bound book with colorful little sticky notes poking out the side. He turned to a page and began to read aloud:</p>\n<p>”Every day, the temptation I fight grows stronger. It is a losing battle, I fear, for each time Crowley-“</p>\n<p>Aziraphale sat up very quickly.</p>\n<p>“-enters my shop, my knees weaken and my heart-“</p>\n<p>“IS THAT MY DIARY?” Aziraphale squealed, chucking a pillow at Crowley as hard as he could. The demon dodged the pillow and the angel that followed, leaping up onto the bed and reading louder.</p>\n<p>“-POUNDS MADLY! IT’S PARTICULARLY TORTUROUS WHEN- ARGHH!”</p>\n<p>At this moment, a second pillow hit Crowley square in the face, then the angel wrapped himself around Crowley’s waist and dragged him down. Aziraphale tried to tug the book from Crowley’s hands, but the demon wriggled away and fell off the bed.</p>\n<p>Crowley hopped to his feet and, laughing madly, hurried down the spiral staircase. He resumed reading at the top of his lungs:</p>\n<p>“-PARTICULARLY TORTUROUS WHEN HE’S WEARING THE NEW STYLE TROUSERS HE’S PICKED UP- <i>oh, Angel, how naughty!</i>- THEY LEAVE SO LITTLE TO THE IMAGINATION, AND YET-!”</p>\n<p>Aziraphale wailed loudly. “Crowley, I promise you that I will draw out my halo and DISCORPORATE YOU!”</p>\n<p>“AND YET, MY IMAGINATION HAS NOT YET RUN OUT OF NOVEL FANTASIES INVOLVING THE TROUSERS AND THE DEMON IN THEM…OR OUT OF THEM, AS THE CASE SO OFTEN IS.”</p>\n<p>Crowley finished the sentence triumphantly and looked up at Aziraphale, who was frozen halfway down the staircase and had gone very quiet.</p>\n<p>“Oh, I hate it when he talks about your <i>outfits</i>.”</p>\n<p>Crowley dropped the diary with a little squeak of surprise. Just behind him sat Muriel, covering their eyes.</p>\n<p>“Hello Crowley,” they said. “Hello, Aziraphale. Did you forget we were supposed to meet 6 minutes ago?”</p>\n<p>With a snap, they miracled a robe onto Crowley’s otherwise entirely bare body.</p>\n<p>“Muriel! You need to warn us before you barge in! We’re- we’re-??” Crowley looked at his angel for help.</p>\n<p>“Lovers,” Aziraphale finished, uninterested in beating around the bush. Crowley blushed furiously. “So either wait for us to let you in or risk seeing a lot worse than that!”</p>\n<p>“Okay, understood!” Muriel nodded with a grimace, looking over at Crowley as he bent to pick up the diary he’d dropped. “I still don’t see what’s so <i>spectacular</i> about it, though,” they murmured.</p>\n<p>A few minutes and one <i>cupperty</i> later, Crowley and Aziraphale were ready to go.</p>\n<p>“Where to first, Constable?”</p>\n<p>Muriel smiled. “I think the park to start. After all, I gave those ducks my word that I’d be back.” Crowley chuckled, understanding they were completely serious about the promises they’d made to ducks.</p>\n<p>“And you can try ice cream!” Aziraphale clapped excitedly. “You’ll love it! Even Crowley likes it!”</p>\n<p>“Yes! Jolly good! And after that, the pub?” Muriel looked at them hopefully, bouncing on their feet.</p>\n<p>“Absolutely,” Crowley agreed. “We still haven’t had the chance to celebrate your promotion, you know.”<br>\n————————————-</p>\n<p>A few hours passed at the park. Muriel admired ducks and sketched trees while relaying all the news out of Heaven. They talked books with Aziraphale and gossiped with Crowley, stopping only to wink at the occasional human making googly eyes at them as they walked by.</p>\n<p>At one point, Crowley sat on his preferred bench and watched as Aziraphale and Muriel cooed over waddling ducklings. Something about his angel bonding with Muriel made him feel full in a place he’d never realized had been empty.</p>\n<p>Sensing Crowley’s eyes, Aziraphale turned back to beam at him. Crowley was always rendered breathless when the angel looked at him that way. There was no better feeling.</p>\n<p>In the late afternoon, they walked together to<i>The Goat Tavern</i>, chatting about Muriel’s new interest in television programs (“The TV in Heaven is completely demon-proof!”) when Aziraphale stopped suddenly.</p>\n<p>“Crowley, you must be joking!” He scolded. “How could you take Muriel here?” He gestured to the pub with distaste.</p>\n<p>Crowley chuckled. “Oh, grow up, they’re harmless.”</p>\n<p>“Who, exactly?” Muriel asked nervously.</p>\n<p>“My dear, this is a satanic pub,” Aziraphale explained, glaring at Crowley. “The owner’s held rituals here in the tunnel below for, gosh, seventy, eighty years? That dreadful John George Haigh business…”*</p>\n<p>“But- but I asked you! I asked when we…” Muriel spluttered, completely aghast. “Crowley, you- you ARSEHOLE!”</p>\n<p>Crowley giggled madly, racing away as Muriel gave chase, brandishing their diary like a club.</p>\n<p>The chase concluded after Muriel landed a respectable wallop across Crowley’s back. “Fine, Fine! We’ll go somewhere else!”</p>\n<p>“No, I’d still like to go in there,” Muriel huffed, “but you deserved that!”</p>\n<p>“He most certainly did!” Aziraphale agreed, linking arms with Muriel and walking haughtily past Crowley and into the pub. It was really rather nice once you forgot about the whole Satan thing.</p>\n<p>The barman lit up with a charming smile as Muriel entered. “Welcome back!” He said, eyes warm.</p>\n<p>Muriel winked at him. “I brought friends!”</p>\n<p>The barman directed his attention to Crowley and Aziraphale. “Hey there! First time in?”</p>\n<p>Crowley spluttered- who did this human think he was, forgetting Crowley like that? “No! I brought Muriel here in the first place!”</p>\n<p>But the barman was already looking back at Muriel. “Pimm’s Cup for you?”</p>\n<p>Muriel eyes twinkled, happy to have been remembered. They smiled brightly. “Yes, exactly! Thank you!” They added a wink for good measure.</p>\n<p>The wink helped; the barman stayed close through the night, making sure they never needed to flag him down or endure empty cups even when the pub filled around them.</p>\n<p>Once sufficiently sloshed, Aziraphale tucked himself under Crowley’s arm as the demon slurred animatedly and Muriel laughed.</p>\n<p>“In other words, you <i>can</i> drink poison, but <i>should</i> you?” Crowley considered the question. “Actually, yes. You should do it at least once.”</p>\n<p>“You should <i>not</i>,” Aziraphale demurred. “Crowley nearly lost his head.”</p>\n<p>Suddenly, Muriel gasped. “Oh! I nearly forgot! I meant to give you the things you left in Heaven.”</p>\n<p>“…Things I left?” Aziraphale was thoroughly lost.</p>\n<p>In a soft gesture, Muriel was suddenly holding a stack of items- no one else in the pub seemed to notice. On top, folded perfectly and pressed, were the clothes Aziraphale wore to Heaven. He made a joyous little noise; how he had missed them.</p>\n<p>He placed the clothes on the bar counter, and, confused, lifted the next set of items; six manila folders.</p>\n<p>“Muriel, what are-?” Aziraphale stopped talking abruptly, having just opened the top file and realizing he was about to be utterly humiliated.</p>\n<p>“Ooh, what’ve you got there? Heavenly secrets?” Crowley flipped file two open. “Oh. WOW.”</p>\n<p>Aziraphale ripped the folder away from Crowley, blushing deep red. His collection of Earth Observation files had grown since he first used the device. He visited it each time he missed Crowley. Which, as it were, had been very often.</p>\n<p>“Why does this folder say ‘Safe Search Off?’” Crowley was unsure if he should be disgusted or horny.</p>\n<p>“Never you mind!” Aziraphale snapped. The documents vanished (reappearing deep in a closet in the shop that Crowley never used. They would be safe there).</p>\n<p>The last item was a large book.</p>\n<p>“Oh, this isn’t mine, dear.”</p>\n<p>“Ah, yes! I know,” Muriel laughed in a soft, somewhat uncomfortable fashion. “I thought I’d give it to you to keep in the shop.”</p>\n<p>Aziraphale examined the book, not wishing to hurt Muriel’s feelings. “I don’t usually store modern textbooks. They update so frequently, you see- they’re the only kind of book that doesn’t appreciate in value.”</p>\n<p>“Yes, but I actually meant to, uh,” Muriel swallowed. “What I mean to say is, that book is for you. And Crowley. I think it may help. I think it may help you both.”</p>\n<p>Aziraphale’s eyes widened in surprise. He read the title again.</p>\n<p><i><u>Trauma Counseling, Second Edition: Theories and Interventions for Managing Trauma, Stress, Crisis, and Disaster</u></i> by Lisa Lopez Levers</p>\n<p>“Oh! Oh, well. That is…” Aziraphale didn’t know why his eyes were filling with tears. “That is very thoughtful.”</p>\n<p>Crowley reached over to pat his dear friend’s hand. “Thank you, Muriel.”<br>\n———————————————</p>\n<p>Well past midnight, the three returned to the shop, stumbling and singing old drinking songs that Muriel didn’t know (but they didn’t let a trivial thing like that stop them).</p>\n<p>They swayed inside together, arm in arm in arm. “This has been so fun,” Muriel said. “I wish I could stay.” They looked at the gateway, a little guiltily.</p>\n<p>“Sober up now?” Crowley suggested. The three of them expelled the alcohol with a grimace,</p>\n<p>“Don’t fret, dear, you just pop in any time,” Aziraphale smiled through the unpleasant taste in his mouth.</p>\n<p>“After warning us,” Crowley added hastily.</p>\n<p>Muriel grinned. “How’s next week?”</p>\n<p>Aziraphale’s face fell and Crowley rubbed his neck. “Ah, dear, next weekend, we’ll actually be visiting a national park. Are you familiar with South Downs?”</p>\n<p>“Oh? Yes, I’ve read about it. Going on a long holiday?”</p>\n<p>“Nah, just going to take a look at little cottage for sale. Thought it might be nice to have somewhere to run away to when we really need it.” Crowley looked at Aziraphale with a shy grin.</p>\n<p>“But nowhere too far,” Aziraphale smiled back.</p>\n<p>“That sounds lovely!” Muriel walked towards the gateway. “Well, when you’re free next, you know where to find me.”</p>\n<p>“We’ll be back on Monday, Constable. How’s Tuesday night for you?”</p>\n<p>“I’ll have to ask my boss,” Muriel activated the gateway, no candles required, with a soft gesture.</p>\n<p>“Tell Her we say hello,” Aziraphale said, waving. “And that we hope She’s well!”</p>\n<p>“She’s <i>God</i>, Angel.” Crowley rolled his eyes. “See you later, Inspector.”</p>\n<p>Muriel stepped into the glowing rune and smiled at their friends. They made a mental note to make sure every South Downs cottage on the market was positively dreamy. With a wink, they rose in the beam of light and faded away.</p>\n<p>As Muriel faded from view, Crowley appraised his angel as he miracled himself into his beloved returned clothes. “Come to bed, love?”</p>\n<p>“In a moment, Crowley. I’m going to make a cup of tea and see if I can wear the Heaven off of these garments. Tea for you, darling?”</p>\n<p>“No, thank you.” He meandered to the stairs, preparing to rest but not wanting to go to bed without Aziraphale. “I love you, Angel.”</p>\n<p>Aziraphale smiled. “I love you too, Crowley. Be up in just a moment. Stay awake for me?”</p>\n<p>Crowley nodded. Once upstairs, he swapped his clothes for one of Aziraphale’s cotton undershirts and slid on a pair of his favorite novelty socks; black with sweet little yellow ducklings. He climbed into bed and curled up, reflecting on all the changes of the last few years. Closing his eyes, he marveled at the fact they ever made it here in the first place. It was truly the least probable outcome, but that was how it worked, wasn’t it?</p>\n<p>The Ineffable Plan never failed to astonish.</p>\n<p>Some time later, soft kisses roused him. “You said you’d wait for me, dear,” Aziraphale whined.</p>\n<p>“‘<i>Mnotsleeping</i>!” Crowley propped himself up on his elbow. Aziraphale slipped his arm through the space there and cuddled up close.</p>\n<p>Crowley had only barely woken up, so sleep was closing in on him fast.<br>\n“I could do this forever,” he whispered.</p>\n<p>The lovely part of forever is you can start it whenever you want to. It’s always waiting for you to remember it, waiting for you to be brave enough to seize it. Aziraphale felt joy beyond measure to know they had, <i>finally</i>, decided to begin their forever.</p>\n<p>Aziraphale stole a few more kisses before sighing contentedly.</p>\n<p>“And so we will, darling,” he replied, closing his eyes and drifting off to the sound of Crowley’s peaceful breathing.</p>"
}