{
  "id": "490958",
  "url": "https://archiveofourown.org/works/490958?view_full_work=true",
  "author": [
    "minusoneday"
  ],
  "title": "Blood Pounding in Our Veins",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Danny Māhealani/Stiles Stilinski",
    "Stiles Stilinski/OMC",
    "Derek Hale & Stiles Stilinski pre-slash"
  ],
  "characters": [
    "Stiles Stilinski",
    "Scott McCall (Teen Wolf)",
    "Derek Hale",
    "Danny Māhealani",
    "Isaac Lahey",
    "Sheriff Stilinski",
    "Melissa McCall",
    "Lydia Martin",
    "Jackson Whittemore",
    "Allison Argent"
  ],
  "additional_tags": [
    "Angst",
    "Canon Compliant",
    "Bisexuality",
    "Stiles-centric",
    "Friendship",
    "Underage Drinking",
    "Panic Attack",
    "Canon-Typical Violence",
    "BAMF!Stiles",
    "Additional tags apply - please see notes"
  ],
  "language": "English",
  "series": "",
  "published": "2012-08-19",
  "completed": "2013-04-24",
  "words": "41,305",
  "chapters": "10/10",
  "comments": "685",
  "kudos": "10,549",
  "bookmarks": "2,834",
  "hits": "199,577",
  "summary": "<p>Stiles figured that Mrs. McCall finding out Scott’s secret would change things, but he’s completely unprepared for the very first thing she does, which is to invite Isaac to move in with her and Scott.</p>\n<p> ***</p>\n<p>In which Stiles is angry. For some very good reasons.</p>\n<p>Six days cooped up in his own room is well past Stiles' lack of human contact limit.</p>\n<p>Little bit of a shorter chapter, I think, but not by much. I still have a pretty decent backlog already written, and I'm hoping to get more done this weekend, so I should be able to maintain the \"chapter every few days\" thing for a bit longer!</p>",
  "notes": "<p>This story picks up from the end of the season 2 finale. It's mostly canon compliant, although I've tweaked some details to suit the story. For example, in that last scene of the finale between Stiles and Scott, Stiles' cheek is fully healed. I'm... condensing the timeline a bit, and it's fair to say that something like that scene may have happened, but sooner (in this fic) than the canon implies. Make sense?</p>\n<p>Also, the rating is possibly end game, we'll see how that goes, and the relationships are tentative. Haha, I AM REALLY SELLING THIS, I BET. I've been having fun writing it though, and I got antsy about posting it, so here we are. Hope you enjoy!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Longer chapter for you guys! Just a heads up, the next one might not be up until the end of this week.</p>\n<p>Oh gosh, another long one, and I didn't even include everything I'd initially intended to be in this chapter. Whooops. You may also notice that I've changed the number of chapters from 7 to a question mark. It's possible that a plot may have crept in and taken up residence without my consent, so I do apologize for that. As soon as I have a better idea of how this is going to progress, I'll put up another estimate.</p>\n<p>Anyway, yes, plot ahoy! Hope you enjoy it!</p>\n<p>I keep expecting to sit down and write a quick, short chapter, and then I end up with almost five thousand words. Sorry for keeping you guys waiting! (And on a cliffhanger, no less!) Hopefully this chapter doesn't disappoint. :) No guarantees on when the next chapter will be - I'm gearing up for a couple busy weeks, but hopefully I'll have time to squeeze in an update somewhere along the line! Thanks again for reading, and I hope you enjoy!</p>\n<p> </p>\n<p>(Also, this chapter does contain some descriptions of a panic attack. It's not particularly graphic, but I just thought I would give a head's up!)</p>\n<p>Another long-ish one for you guys! Sorry for the slight wait - real life has been terribly busy, so I haven't had much of a chance to write. The busy-ness isn't guaranteed to let up any time soon, so don't worry if this goes another week or so without being updated. I promise, I am still plugging away! :)</p>\n<p>I am so very sorry for the wait, everyone! I honestly didn't expect it to be this long, but life has been busy, and then I got sidetracked with another plot bunny, and I'm afraid this fic got shifted to the back burner for awhile. I have neither forgotten about this fic, nor abandoned it, however, and I am actually really excited for what's coming up, so never fear! Updates might not be as quick as they were at the start, but I'm determined that this fic shall not languish in WIP-dom for too much longer. As ever, thanks so much for reading, and I hope you enjoy!</p>\n<p>A thousand and one apologies for the ridiculously long wait. This chapter gave me FITS, but now it is done and it is posted and thank goodness for that. I'd intended to lump another scene or two in with this one, but I figured it had been a long enough wait between chapters, and that I'd rather just go ahead and get this one posted. I'm thinking there'll be one more chapter, maaaaybe two before I get this all wrapped up.</p>\n<p>Also PLEASE NOTE: I've added a couple tags for this chapter in order to warn for it being a violent one. Nothing too far away from canon, I don't think, but please be aware!</p>\n<p>Thanks again for your patience, and I hope this doesn't disappoint!</p>\n<p>It's finally finished, yay! A HUGE thank you to everyone who stuck with me on this story. I never expected it to take nearly this long to completely, nor did I expect it to take some of the turns it did. Of course, now that I've had days and weeks and months to overload my brain with all sorts of brilliant meta, there are some things I would probably do differently, but overall, I'm really happy with the way this turned out. </p>\n<p>I will probably go on a comment spree sometime this week, so don't be surprised if you suddenly get a reply on a comment you left awhile ago. (I am SO grateful for the lovely, LOVELY comments you've all left, and I do apologize for dropping the ball so terribly on responses. I'll be getting to them in the near future, for sure!)</p>\n<p>I hope the final chapter doesn't disappoint! Thanks again for being awesome and SO patient! &lt;3</p>\n<p>I do have a tumblr, if anyone feels like hanging out. You can find me <a href=\"https://sidekickinit.tumblr.com\" rel=\"nofollow\">here!</a></p>",
  "text": "<p></p>\n<p>~*~*~*~</p>\n<p>Stiles figured that Mrs. McCall finding out Scott’s secret would change things, but he’s completely unprepared for the very first thing she does, which is to invite Isaac to move in with her and Scott.</p>\n<p>In fact, it’s not really an invitation so much as an order, and it happens quickly enough that the first Stiles knows of it is when he goes over to Scott’s and sees a stack of boxes in the front hall.</p>\n<p>“Uh… are you guys running away to join a circus or something?” Stiles asks, nudging at one of the boxes with his shoe. “I’m pretty sure you’re only supposed to take the clothes on your back in that case. Maybe a knapsack.”</p>\n<p>“Oh – yeah,” Scott says, shifting awkwardly in the middle of the hallway. The awkwardness is noticeable, simply because Scott doesn’t move that way anymore. He’s graceful and smooth, and if he’s scuffling around the way he currently is, it undoubtedly means that Something is Up. “About that…”</p>\n<p>“Scott!” Mrs. McCall’s voice punctures their conversation. “Where did Isaac go?”</p>\n<p>“To get his bed!” Scott shouts back.</p>\n<p>Stiles isn’t stupid. It takes him all of 2.5 seconds to put everything together.</p>\n<p>“No way – no <i>way</i>,” he whispers furiously. “Your mom is not running a halfway house for delinquent werewolves! Since when?”</p>\n<p>“Since she realized Isaac didn’t have anyone watching out for him except Derek, who I think we can all agree sucks ass as an alpha, let alone a guardian,” Scott whispers back. “Look, I know it’s probably a little weird – ”</p>\n<p>“A little weird!”</p>\n<p>“ – but it’s not forever! And it might be kind of cool, I don’t know,” Scott continues. “Isaac’s a good guy – he really had my back with everything that went down, you know?”</p>\n<p><i>I</i> had your back, Stiles thinks mutinously, glaring at Scott with his jaw set. He was the one who drove his freaking jeep into Jackson, after all, single-handedly saving the day.</p>\n<p>Well, sort of. Mostly. Lydia did some stuff, too, but he doesn’t like to think about that because down that road lies heartache and tears.</p>\n<p>“So when was this even decided?” Stiles demands, giving another box a shove with his foot. Some might call it a kick.</p>\n<p>Scott’s face has guilt stamped all over it, and Stiles doesn’t even really need to hear his answer of, “Last week,” to complete his picture.</p>\n<p>“And you were going to tell me when?” he asks, crossing his arms and giving Scott his very best and most practiced glare. It’s not the best idea, because the side of his face is still sore and achy, and glowering only makes it feel worse.</p>\n<p>“I thought you’d be weird about it,” Scott says earnestly. “I’m sorry, I should’ve said something before. But – you don’t have to be weird, okay? It’s just a temporary thing.”</p>\n<p>“Right,” Stiles mutters. He knows how things go when Mrs. McCall gets her teeth into something. It doesn’t happen often, but on the occasions it has… Stiles still vividly remembers the summer she decided video games were not a worthwhile summer activity. He and Scott had ended up on every summer sports league in town.</p>\n<p>“Stiles – ”</p>\n<p>“Whatever, dude, it’s fine,” Stiles says with a jerk of his shoulder, like he’s hoping he can physically shrug the situation off. “Are we going to play some Call of Duty or what?”</p>\n<p>There’s that guilt again, flashing right across Scott’s face. “Uh… I’m supposed to help Isaac unpack. And my mom’s been a lot more chill lately, but I don’t think she’s actually forgiven me for the whole werewolf secret identity thing yet, so I’m trying to stay on her good side.”</p>\n<p>It’s not like it’s an unreasonable thing. Scott and Stiles have had to reschedule more than one video game session due to the whims of their parents. But Stiles has a funny, bitter feeling about this one, something that coils low and poisonous in his stomach.</p>\n<p>“Sure,” is all he says. “Are we still on for tomorrow, at least? Lacrosse?”</p>\n<p>“Yeah,” Scott says, and Stiles might not be a werewolf, but he can sense the relief in Scott’s voice. “Yeah, absolutely. Pick me up once you’re done with breakfast.”</p>\n<p>Stiles murmurs an affirmation, and that’s that. He could stay and offer to help, he knows, but his entire being is rebelling at just the idea of helping Isaac Lahey move in to the place he’s always considered his second home. It’s petty, probably, and way too territorial for a human being, but his gut reaction is primarily I hate this, and for now, that’s what he’s going with.</p>\n<p>He waves goodbye to Scott and heads for his jeep, wanting to be gone before Isaac gets there.</p>\n<p></p>\n<p>*</p>\n<p>“So I hear Isaac Lahey is going to be staying with Melissa and Scott?” Stiles’ dad says at dinner that night, a frown creasing his forehead.</p>\n<p>“Yep,” Stiles replies. “Take another scoop of peas, don’t think I don’t see you skimping on the greens.”</p>\n<p>His dad rolls his eyes, but he takes another helping of peas anyway.</p>\n<p>“Does she realize what she’s getting into?” he presses. “It’s… well, it’s kind-hearted of her, but taking into account Isaac’s history – not to mention the year he’s had…”</p>\n<p>“Oh, I think Scott’s got her all caught up,” Stiles says, a slightly bitter edge to his voice. It’s not that he wants his dad to find out about everything that’s been going on; he’s not nearly ready for that conversation yet. But seeing the way Scott’s mom is coming around, how much easier things have been between them lately… yeah, Stiles can admit it. He’s a little bit jealous. At least Scott doesn’t have to lie anymore, while Stiles is still piling up one after another after another.</p>\n<p>“Hmmm,” his dad says, and he dips a hunk of steak into his mashed potatoes, still ignoring his peas entirely.</p>\n<p>“Eat those,” Stiles orders, “they’re good for you.”</p>\n<p>He might not be able to share with his dad the current supernatural situation happening in Beacon Hills, but Stiles will be damned if he lets his dad clog his arteries any more than they already are.</p>\n<p></p>\n<p>*</p>\n<p>The Isaac situation isn’t too bad at first, though Stiles is hesitant to admit that, because it feels like as soon as he does things are going to start going wrong. But he’s trying to be honest in his own head, since some days it feels like every other word out of his mouth is a lie, and the truth of the matter is, Isaac mostly keeps to himself. He doesn’t tag along when Scott goes out to meet Stiles, and he doesn’t generally venture out of his bedroom when Stiles is hanging out at the McCalls’ place.</p>\n<p>He makes appearances for meals, according to Scott, but otherwise, he’s either holed up in his room, or out with Erica and Boyd. It makes Stiles wonder if this is maybe the first opportunity he’s had to really sort through what his life has become, and it sparks the tiniest bit of sympathy deep within his chest. They seem to be in a lull right now, after all; it’s as good a time as any to spend some quality time with your thoughts.</p>\n<p>The first time he actually wanders out of his room while Stiles is hanging out is during an intense game of old school Mario Kart, Super Nintendo style.</p>\n<p>“Isaac, hey!” Scott says, taking his eyes off the tv long enough to shoot a friendly grin Isaac’s way. “Are you any good at Mario Kart?”</p>\n<p>Isaac shrugs, and while Stiles hasn’t taken his eyes off the screen, in his peripheral vision he can see something that looks a lot like smug steal across Isaac’s face.</p>\n<p>“I’m not bad,” is all he says.</p>\n<p>“Great,” Scott says, shoving his controller at Isaac. “I’m tagging you in, then, because Stiles is creaming me.”</p>\n<p>“Hey!” Stiles exclaims, the unexpectedness of that exchange making him jerk hard enough to send his driver careening into a wall, losing all the speed he’s built up. “You can’t just switch out in the middle of a race!”</p>\n<p>“Just did!” Scott says – he practically chirps it – and scoots over to make room for Isaac. “I’ll play winner.”</p>\n<p>Stiles grits his teeth, bites his lip and furrows his brow in concentration, suddenly determined to win this round.</p>\n<p>Of course, because the gods of luck hate him, Isaac turns out to be a freaking god at Mario Kart. He takes Stiles out in under two minutes, and Scott crows victory – more like howls, really – and slaps Isaac on the back, gives his shoulders a friendly shake. “That was awesome,” he says, then holds a hand out to Stiles. “‘Kay, dude. My turn!”</p>\n<p>Stiles silently hands over his controller and moves back to the couch. He does not sulk, because he is practically an adult, but he does feel a certain vindictive satisfaction when Scott doesn’t last more than a minute against Isaac.</p>\n<p>Serves him right.</p>\n<p></p>\n<p>*</p>\n<p>Somehow, the Mario Kart session opens a door, and suddenly, Isaac is everywhere. He joins them for video games when Stiles heads over, which sucks, because most of their favorite games are two player only. He starts coming to their lacrosse training practices, even though Stiles is the one who needs help, and no, he doesn’t want any help from Isaac, thank you very much. At night, when they’re chatting online, Scott will disappear for long minutes at a time, only to return with a “sry dude, isaac was showing me something.”</p>\n<p>The worst though, is when Scott and Isaac start having secret werewolf meetings with Erica, Boyd, Derek and Peter. Scott gets stupidly close-mouthed about them, to the point where he won’t tell Stiles anything; Stiles is pretty sure it’s out of a desire to keep Stiles safe, since Stiles was the one who got all fucked up during the last supernatural showdown.</p>\n<p>This time around, Stiles isn’t even sure how much he wants to get involved. Scott let something slip once about an alpha pack, and while Stiles doesn’t know any details, just the sound of it is terrible enough. Except even if he’s not sure he wants to be one hundred percent involved, he deeply hates feeling so excluded. Scott and Isaac start doing this thing where they break off mid-conversation when Stiles enters a room, and without fail it makes his ears turn red and his heartbeat kick up.</p>\n<p>“You know what,” Stiles finally explodes, one afternoon when it’s happened one time too many, “you live together. If your secrets are that important, then have these conversations when I’m not here.”</p>\n<p>Scott looks at him, astonished; Isaac’s face is blank.</p>\n<p>“In fact,” Stiles continues, his irritation ratcheting up a notch at the complete lack of response, “feel free to finish it now. I’m going home. You won’t even have to worry about me overhearing.”</p>\n<p>Stiles has his feet shoved into his shoes, and he’s grabbed his wallet and keys before Scott manages a, “Stiles!” but by then it’s too late, he’s already out the door and headed for his jeep.</p>\n<p></p>\n<p>*</p>\n<p>He doesn’t walk in on any more cut-off conversations after that, but it’s an uneasy truce at best.</p>\n<p></p>\n<p>*</p>\n<p>Scott and Isaac aren’t the only ones keeping Stiles out of the loop; since that final showdown against Gerard, Stiles hasn’t once seen the rest of the pack.</p>\n<p>Well, he guesses they’re a pack; he’s still pretty fuzzy on the dynamics there.</p>\n<p>It comes as a shock, then, when he stumbles across Derek in the cereal aisle of the grocery store.</p>\n<p>“You shop here?” Stiles asks by way of greeting, his surprise bleeding into his voice.</p>\n<p>Derek doesn’t even look up, because Derek is, for all intents and purposes, an asshole.</p>\n<p>“It’s the only decent grocery store in town,” he replies, plucking a box of raisin bran off the shelf and flipping it over to examine the nutrition facts.</p>\n<p>“I figured you’d just be roughing it,” Stiles says. It’s been a long time since he’s had the chance to bait Derek; besides, after facing down Gerard and the kanima and, hell, Peter, Derek just doesn’t seem quite so scary any more.</p>\n<p>“You know,” Stiles continues. “Squirrels. Rabbits. Raccoons. Can you eat raccoons? How come people don’t eat raccoons? You’d think – ”</p>\n<p>“Stiles,” Derek barks, glaring at him over the cereal box. “Shut. Up.”</p>\n<p>Stiles’ anger hits him full-force and all at once.</p>\n<p>“Don’t you tell me to shut up,” he spits out, taking a step into Derek’s space, then another, and another. “God, you people – I’ve come to your rescue how many times now? And you still act like I’m something disgusting you stepped in that got stuck to the bottom of your shoe. I got my ass kicked because of you and your stupid pack – pushed down a flight of stairs and punched repeatedly in the face and – ”</p>\n<p>Stiles breaks off abruptly, because nobody knows the full extent of that beating at Gerard’s hands. The scrape on his face and the bloody lip were obvious, but he kept the yellow-and-green bruises that had spread along his side from Gerard’s kicks hidden. Jesus, he was lucky he hadn’t broken a rib.</p>\n<p>Derek is looking at him in astonishment; it’s the most expression Stiles has ever seen on his face that hasn’t fallen into the categories of anger, irritation or smug.</p>\n<p>“Forget it,” Stiles growls. “I’m done anyway, okay? I’m out. Driving my jeep into Jackson was my last hurrah. Next time you need someone to save your furry butt, don’t bother asking me.”</p>\n<p>He blindly grabs the peanut butter he came into the store for, and he storms the entire way to the cash register.</p>\n<p>It isn’t until he’s putting it away in the cupboard at home that he realizes he got the brand they used to buy – full-fat, loaded with sugar and sodium and calories.</p>\n<p>His dad is going to be genuinely thrilled.</p>\n<p></p>\n<p>*</p>\n<p>Considering that his anger stays a constant, fizzy presence just below the surface over the next few days, it’s probably a mistake to meet Scott and Isaac for lacrosse. Lacrosse may very well be the one thing Stiles still has left though, and he isn’t giving it up just because his life is full of douchebag werewolves. This is going to be his year, he’s determined to make it happen.</p>\n<p>Scott and Isaac are late, so Stiles tries to work out some of his tension by running wind sprints, but all it really does is leave him out of breath and irritable. When Scott and Isaac finally pull in twenty minutes later, Stiles can’t help that the first words out of his mouth are, “Well, thanks for showing up, guys,” in a snotty tone that’s probably more suited to an eight-year-old than a seventeen-year-old.</p>\n<p>“Sorry,” Scott grimaces. “We were – we kind of got caught up, uh – ”</p>\n<p>“Pack stuff,” Isaac supplies with a shrug, like that’s all Stiles needs to know. Like that’s all the explanation he deserves.</p>\n<p>“Whatever,” Stiles says, and he feels like his jaw must be clenched tight enough to grind down granite. “Just get your sticks, okay? I’ve been here for twenty minutes, and there’s only so much I can do on my own.”</p>\n<p>Stiles is willing enough to admit he’s not in a great mood, but if Scott and Isaac are picking up on it, then they’re choosing to ignore it. They take their sweet-ass time getting their equipment out of the car, and they’re laughing about something as they make their way over to Stiles.</p>\n<p>“I wanted to practice scoring going up against a defender,” Stiles says shortly. They usually let him dictate the practices, since, you know, he’s the only one who actually needs the practice. Normally, he thinks that’s nice, but today it just feels condescending. Pitying.</p>\n<p>“Sure,” Scott says. “I’ll take goal.”</p>\n<p>He jogs off to his position, and Stiles calls after him, “No werewolf tricks!” Scott waves him off, and Stiles fixes a glare to Isaac. “Same goes for you,” he says, and Isaac just smiles a disarming smile.</p>\n<p>Things get off to a bad start almost immediately. Stiles is wound way too tightly to be at all effective on the field, and Isaac is right there in his face no matter what he does. He’s bigger than Stiles, faster than Stiles, and he’s most definitely stronger than Stiles, and it all adds up to Stiles being unable to get close enough to the goal to even take a shot.</p>\n<p>“I said,” Stiles grits out, as Isaac blocks him yet again, “no werewolf powers.”</p>\n<p>“I’m not!” Isaac exclaims. He’s smirking. “This is just me, Stiles.”</p>\n<p>Something disturbingly like a growl claws its way out of Stiles’ throat, and this time when he goes to make a run past Isaac, he whacks him on the shoulder as hard as he can with his stick.</p>\n<p>“Hey, whoa, dude!” Scott yells. “That’s a total foul!”</p>\n<p>Isaac’s eyes flash dangerously, but Stiles just stares him down, breathing heavily, fury bubbling through his veins.</p>\n<p>“Stiles?” Scott calls again. “Do you need a break, man?”</p>\n<p>“No,” Stiles says – almost snarls, really, and if that isn’t a sure sign he’s spent too much of the past year around werewolves, then he doesn’t know what is. “We’re going again.”</p>\n<p>“Isaac?” Scott says. “You okay?”</p>\n<p>“Fine,” Isaac says in a flat voice. He hardly even <i>flinched</i> when Stiles hit him, stupid werewolves and their stupid powers and their stupid healing capabilities.</p>\n<p>Stiles scoops up the ball, walks maybe twenty feet away, and takes a moment shifting his weight back and forth, trying to determine where he wants to go. A split-second later, he takes off, cleats tearing up the field as he runs full-tilt for the goal.</p>\n<p>Isaac, of course, is right there. Except this time, neither of them is backing down, and neither of them is giving an inch.</p>\n<p>Later on, maybe, Stiles will be disappointed in himself, but for right now, he swings his stick down, intending to trip Isaac with it.</p>\n<p>There’s another flash in Isaac’s eyes, and in the next moment he’s shoving Stiles. And it’s not the shove of a typical teenage boy; no, this shove has a werewolf’s full-blown power in it, and Stiles goes flying.</p>\n<p>He hits the ground with a dull thump, his entire body jarring badly. Thank God he was wearing his helmet, he thinks muzzily; otherwise, he’s pretty sure he’d have a cracked skull.</p>\n<p>He’s unaware of Scott calling his name until Scott is right there next to him, sinking down onto his knees and pressing his hand to Stiles’ chest.</p>\n<p>“Are you all right?” he asks, sounding freaked. “You went flying, dude, are you hurt?”</p>\n<p>Stiles ignores the pouncing in his head and the ache of his bones and forces himself up. “Fine,” he mutters, gently easing his helmet off and trying his best to hide his wince from Scott. “Peachy keen.”</p>\n<p>“What was that out there?” Scott demands. “I mean, Isaac shouldn’t’ve pushed you, but you were fouling him all over the place! What gives, Stiles?”</p>\n<p>“What gives?” Stiles echoes, and there’s that fury, finally making an obvious appearance. “I don’t know, Scott, what do you think gives?”</p>\n<p>Despite the fact that he’s now a terrifying creature of the night, with huge, terrifying fangs, who could easily tear your throat out and call it a day, Scott still does the best wounded puppy expression that Stiles has ever seen.</p>\n<p>“I’m done, okay?” Stiles snaps, struggling to his feet.</p>\n<p>“Done… with practice?” Scott asks, scrambling to stand up, the frown on his face signaling confusion and concern.</p>\n<p>“Done with everything!” Stiles shouts. “With all of this fucking werewolf crap, all right, I’m done. Congratulations, you don’t have to worry about running around behind my back anymore, because I am removing myself from the frigging situation.”</p>\n<p>“Stiles,” Scott protests, “c’mon, don’t be pissed – ”</p>\n<p>“I’m not pissed,” Stiles says, voice cold. “I’m done. You have your new best buddy right there, so just leave me the fuck alone.”</p>\n<p>It’s easily the meanest thing he’s ever said to Scott, and the evidence of that is right there in Scott’s expression; he looks like Stiles has punched him, and whether it’s from the shock or not, he actually lets Stiles walk back to his jeep, get in, and drive away.</p>\n<p>The anger starts to dissipate just as quickly as it came on, leaving Stiles feeling numb. And more than a little sick to his stomach. Scott’s been his best friend since second grade, and this doesn’t feel like a fight. It feels like a break up.</p>\n<p>Stiles isn’t turning his jeep around though, so there’s nothing for it but to head home.</p>\n<p>Seven days later, Stiles still hasn’t spoken to Scott. It’s not for lack of trying on Scott’s part, but Stiles has covered his bases; he’s blocked Scott’s phone number, blocked him from ichat, and he’s even gone so far as to seal a line of mountain ash along the sill of his bedroom window.</p>\n<p>That still leaves the front door, which is a viable point of entry if you’re Scott McCall (although not if you’re Derek Hale), but Stiles has given his dad the short version of their fight, and he’s made it clear that Scott is not welcome here right now.</p>\n<p>He’s pretty sure his dad thinks he’s being ridiculous, but he’s also been prone to giving Stiles his way lately, ever since Stiles showed up after having gone missing for hours, bruised and bloody and shaken.</p>\n<p>Six days cooped up in his room is well past Stiles’ limits, however, and when he hits that seventh day, he knows he has to get out, he has to go somewhere. Preferably, somewhere Scott would never be.</p>\n<p>Which is how he ends up at the Beacon Hills public library. It’s not a particularly well-trafficked place, considering it’s just a tiny off shoot of the nearest city’s public library system, but Stiles has good memories of visiting when he was little. His mom used to take him, and they’d always come out with a stack of books on whatever subject Stiles was interested in at the time.</p>\n<p>It’s the smell that hits him, when he first steps in – papery, a little musty, something lemon-scented underneath, from whatever cleaning supplies they use. The air conditioning must be out again, because it’s warm inside, but the temperature isn’t going to climb past the 70s today, so it shouldn’t get too stuffy.</p>\n<p>Stiles has his laptop and his headphones with him, but he finds himself browsing along the stacks, somehow ending up in the folktale and fairy tale section. The books with ‘wolf’ in the title practically jump out at him, and after a moment’s deliberation, he plucks a few off the shelves. Not for any particular reason, and it’s not like they’d be helpful even if he did have a reason. He’s just curious as to what he’ll find.</p>\n<p>He grabs himself a table in the back corner and sets to reading. He’s only been at it for twenty minutes or so when he hears someone drag the chair back from the table beside him.</p>\n<p>“Little Red Riding Hood? Really?” a familiar voice asks, and Stiles glancing up to see Danny, who’s looking at him with a half-amused, half-bewildered expression.</p>\n<p>Stiles double checks his book, and sure enough, there isn’t an obvious red hood or wolf in sight on the page he’s been looking at – it’s a fairly generic picture of a little house tucked into the deep, dark woods.</p>\n<p>“Dude,” Stiles says, “how did you even know that?”</p>\n<p>Danny shrugs and slides into his chair. “That was my little sister’s favorite book two summers ago. I think I read it to her three times a day for a solid four months.”</p>\n<p>“Sounds like your little sister has good taste, then,” Stiles says, because this story is a lot better than the one he was reading before. The language is rich and descriptive, and even if the backgrounds leave something to be desired, he likes the way the artist has drawn Red Riding Hood. She looks spunky, with her dark, bobbed hair and an upturned ski slope of a nose.</p>\n<p>“Before you say that, you should know she has since moved on to Justin Bieber,” Danny whips right back to him.</p>\n<p>Stiles considers this for a moment, then nods. “Point,” he says. Danny smiles and takes out a novel – the new Stephen King one that everyone at his Dad’s station seems to be reading.</p>\n<p>It’s probably the second or third best conversation they’ve ever had, and even as a lull settles over them, Stiles finds himself searching for something else to say. He’s been people-starved for days now, and it goes against his very nature to be quiet for so long a period of time. He knows Danny doesn’t like him, but he’s at the point where even negative attention sounds a whole lot better than no attention.</p>\n<p>“So, I know why I’m at the library,” Stiles prompts, “but why are you here? Just to read?”</p>\n<p>“I’m on break,” Danny says, not looking up from his book. “I’ve volunteered here the past few summers, and this year they finally put me on payroll, which is awesome. It’s just part-time, but it’s decent money for being somewhere I like.”</p>\n<p>“I didn’t know that,” Stiles says, curiosity piqued. “So you’re like a librarian, or what?”</p>\n<p>Danny shrugs. “You have to have a degree to be a librarian. I do a little bit of everything – shelving, the circ desk, putting stickers on whatever books come in…it’s cool, means I get first dibs on everything new.”</p>\n<p>“So, what you’re saying is, you could score me a copy of Fifty Shades of Grey without me having to wait for the waitlist to go down?” Stiles asks, and Danny snorts, chokes a little, even. It feels like a win, like Stiles has somehow scored a point in the game of ‘Get Danny to Like Me or Die Trying.’ Although the odds of his sudden and most unfortunate demise have significantly gone down ever since Stiles cut out all the werewolves from his life, so maybe he’ll be able to get Danny to tolerate him without even a miserable and prolonged death.</p>\n<p>“How do you know there’s a waitlist?” Danny asks accusingly, and this time it’s Stiles’ turn to bark out a laugh.</p>\n<p>“Wait, really?” he exclaims. “That’s the best thing I’ve ever heard.”</p>\n<p>“Really? ‘Cause I kind of think it’s the worst.”</p>\n<p>Stiles laughs again. He’s probably being too loud for the library, but he’s thinking hanging out with a library employee might grant him a pass, just this once.</p>\n<p>“So where’s McCall?” Danny asks after a few beats of silence. “Aren’t you guys usually attached at the hip?”</p>\n<p>Stiles’ good mood evaporates. “We… had a fight,” he says, his voice suddenly down to a library-appropriate volume. “We’re not speaking.”</p>\n<p>Danny looks like Stiles just hit him over the head with a brick. “You and Scott?” he asks, voice rich with disbelief. “I didn’t think it was possible for you guys to go two hours without speaking.”</p>\n<p>“Yeah, well.” Stiles flips to the next page in his book, staring blankly down at it for a few seconds.</p>\n<p>“He’s been going through some stuff the past year,” Stiles explains. “It sounds shallow to call it drama, but… it’s all pretty dramatic, so. And I’m just done with getting sucked into it. I need a break.” He sighs, shoulders slumping down, and he steals a look at Danny. “It’s not – it isn’t like I’m ditching him in a moment of need. I stuck with him all year, but at a certain point, it’s like… I need him to be there for me, too. And he hasn’t been. And he has other people to help him out now, so I’m just… over it.”</p>\n<p>It had been fun at first, helping Scott figure out the whole ‘I’m a werewolf now’ thing, and Stiles hadn’t even minded the occasional rush of adrenaline that came with facing near certain death. But those instances kept piling up, and it’s a little too easy for Stiles to remember how no one had come for him when he’d been taken by Gerard. No one came looking – Scott didn’t come looking, and Stiles can appreciate that other stuff was going on, but… Scott is his best friend in the entire universe, he should have come for Stiles.</p>\n<p>When Stiles looks over at Danny again, he’s a little surprised to see that he doesn’t look even a little judgmental. If anything, he looks kind of sympathetic.</p>\n<p>“Jackson’s been a complete weirdo for months now,” he offers, unprompted. “And I haven’t seen him once this summer – he’s been holed up with Lydia the entire time.”</p>\n<p>Stiles manages a crooked smile, trying to ignore the niggling guilt that crawls up his spine, as well as the stab of achy sadness that accompanies it. He’s been trying his damnedest not to think about Lydia. “Sounds like we could start a club,” he says and gets a mirror of his own smile from Danny. It’s not one hundred percent happy, but there’s a certain solidarity in it, that Stiles can appreciate.</p>\n<p>Danny takes a quick look at his watch and sighs. “I have to get back,” he says, and Stiles nods.</p>\n<p>“I have my fairy tales to get back to,” he says. “Thanks though. For uh… it’s been… quiet, without Scott. I’m not good at quiet.”</p>\n<p>There’s a long, long moment after Danny gets to his feet, where he’s looking at Stiles carefully. It’s kind of an intense, frowning look, and Stiles shifts uncomfortably. He’s just about to ask if everything’s okay when Danny sighs, looking vaguely like he’s about to regret whatever he’s going to do next.</p>\n<p>“You wanna come over?” he asks. “My shift’s done in a couple hours, I was just going to head home to play video games. So if you think you can kill two hours here, you could just follow me.”</p>\n<p>“Yeah,” Stiles says, the startled agreement out of his mouth before his brain has quite caught up to the fact that <i>Danny</i> is asking him to hang out. Danny, who has disliked Stiles for as long as Stiles can remember. “Yeah, that sounds – cool. Awesome.”</p>\n<p>“Don’t make me regret the offer,” Danny says, but he’s kind of smiling as he says it, and Stiles is going to assume that means it’s a joke and not an actual threat.</p>\n<p>“Get me that copy of Fifty Shades, and I promise to be on my very best behavior,” Stiles replies; it gets another chuckle, and Stiles is pretty sure that this whole interaction has upped his score way more than just a single point.</p>\n<p>“See you at two,” Danny says, and Stiles can’t help it, he kind of sits there beaming as Danny heads for the desk.</p>\n<p></p>\n<p>*</p>\n<p>Danny’s house is a lot smaller than Stiles imagined it would be. Maybe he expected something more because of the crowd Danny runs with; God knows Jackson and Lydia both have sprawling mansions with pools and ridiculously landscaped yards. Danny’s place, on the other hand, is a cozy-looking two-story house, painted grey with dark, navy shutters. There are two kids’ bikes tipped over in the front yard, and the probable owners of the bikes are darting through a sprinkler, shrieking with laughter.</p>\n<p>“My brother and sister,” Danny offers, as he and Stiles head up the driveway. “Caroline’s eight, and Parker’s 6.”</p>\n<p>“I always forget you have a brother and a sister,” Stiles says. The kids look like they’re having a blast. “I mean, I know you said earlier, just…”</p>\n<p>“They’re a lot younger than I am,” Danny shrugs. “And they don’t like coming to lacrosse games, they get bored.”</p>\n<p>Instead of going up to Danny’s room, Danny leads Stiles into what looks like a well-loved den. There’s a worn, velvety soft couch, an armchair, and a beat-up old entertainment center that houses a large TV and what looks like a Playstation 3.</p>\n<p>“This is nice,” Stiles says.</p>\n<p>Danny’s mouth pulls to the side. “Yeah, it’s… you know,” he says. “It’s fine. You should see the system Jackson has set up, it’s crazy…”</p>\n<p>Stiles snorts. “Well, first off, Jackson hates my guts, so I’m never going to see his setup. Second, I bet it’s so expensive-looking that I’d be afraid to sneeze for fear of damaging his eight million dollar diamond-encrusted TV stand.”</p>\n<p>That, much to Stiles’ surprise, gets a laugh.</p>\n<p>“No diamonds,” Danny says, but the odd, crooked line of his mouth has evened out to a real smile. “But yeah, it’s almost too nice, you’re right. Here, you want anything to drink? There’s a mini fridge masquerading as an end table, we have some Coke and Sprite and stuff.”</p>\n<p>Stiles opts for a Coke, and he and Danny sprawl out in front of the TV, choosing Mortal Kombat to start with, because Stiles thinks working out some of his aggression and irritation via video game avatar sounds like a great idea.</p>\n<p>Danny’s dad comes in with bagel bites about an hour later, Caroline and Parker both on his heels. They immediately grab some of the snacks, then proceed to crawl all over Danny.</p>\n<p>“Get off, I can’t see the screen!” Danny exclaims. “You guys’re gonna make me lose!”</p>\n<p>“Keep doing exactly what you’re doing,” Stiles orders, thumbs flying across his controller. “Just another couple seconds… yes!” He raises his arms, victorious, then turns to gloat at Danny, who groans.</p>\n<p>“That’s it,” he tells his brother and sister, “you guys are disowned. I’m giving you away to the circus.”</p>\n<p>Caroline just giggles, but Parker’s eyes get wide and scared. “Nooooo, Danny!” he yelps. “Circuses have clowns, I don’t like clowns!”</p>\n<p>“Should’ve thought of that before you climbed all over me and ruined my game,” Danny says, but he scoops Parker up and slings him upside down over his shoulder, at which point Parker lets out a pretty shrieky giggle of his own.</p>\n<p>Stiles can feel himself starting to smile, watching the scene unfold before him. Caroline leaps onto Danny’s other shoulder, but he catches her easily, not overbalanced at all. That’s maybe what makes him so good in goal – he always knows where his center is, and he doesn’t let himself be pulled one way or the other.</p>\n<p>“Caroline, Parker!” Danny’s mom calls. “You’d better not be wearing those wet bathing suits in the house!”</p>\n<p>“Whoops!” Caroline chirps as Danny sets both of them down. “C’mon, Parker, let’s go back outside!”</p>\n<p>They grab three more bagel bites each, then take off for the great outdoors once again. Danny’s outright grinning as he sits down; it’s the most relaxed Stiles has ever seen him, and while Danny pretty much always looks stupidly attractive, right now he looks soft and open in a way that Stiles isn’t used to.</p>\n<p>It makes his cheeks heat up, makes him swallow uncomfortably, and he reaches for a bagel bite of his own, trying very hard to ignore the sudden coil of tension in his stomach that feels suspiciously like want.</p>\n<p>“Rematch?” Danny asks, picking up his controller again, and Stiles nods, relieved his mouth is too full to require a response.\n</p>\n<p></p>\n<p>*</p>\n<p>Danny’s dad invites Stiles to stay for dinner, but Stiles declines; his own dad is actually going to be home tonight, and Stiles likes to eat with him when he gets the chance.</p>\n<p>“We should do this again,” Danny says, as he walks Stiles to the front door.</p>\n<p>“Yeah,” Stiles agrees, once again helpless to that stupid, beaming smile. “I had fun, thanks. I can bring over my copy of Madden, if you want – I got the newest one a few months ago, and I’ve hardly had a chance to play it.”</p>\n<p>“Cool,” Danny says, with a smile of his own. “I’ll see you later then.”</p>\n<p>“See you,” Stiles says with an awkward, twitchy little wave.</p>\n<p>Danny doesn’t live too far, so it’s not even a ten minute ride home, but that’s plenty long enough to send Stiles’ mind reeling. It’s been a long, long time since Stiles has felt so flustered around Danny Mahealani. He has distant memories of first and second grade, when he was kind of fixated on getting Danny’s attention, but after that, he mostly took Danny’s many hints and left him alone. He’s almost jittery, though, already anxious and excited at the prospect of doing this with Danny again. It’s a feeling he only associates with Lydia – and sometimes with certain werewolves who push him up against walls with more force than is strictly necessary, but he’s always put that down to adrenaline.</p>\n<p>There’s no reason for him to be filled with adrenaline now though, no real reason he can think of for his stomach to be in knots, or for his brain to be stuck on Danny’s full-fledged grin.</p>\n<p>Well, that’s not entirely true. There are reasons, but not ones Stiles has ever spared much thought for. He’s been in love with Lydia since third grade, after all, the kind of consuming, all-encompassing love that eclipses any other glimmers of feeling. Those occasional instances of attraction to other people never measured up when he compared them to the way he felt about Lydia, and so it was easy to dismiss them as something else. Like adrenaline. Or a particular delight at someone’s sense of humor.</p>\n<p>The way he’d felt sitting there with Danny today… that’s a little harder to dismiss. Stiles wonders if that means he’s really getting it this time, that Lydia isn’t going to pick him, he’s never going to be with her, and it’s time to move on.</p>\n<p>It kind of makes a sad, inevitable sort of sense, although Stiles had always pictured himself moving on to, you know, a girl.</p>\n<p>“Well, frick,” Stiles mutters as he pulls into his driveway. At least his dad isn’t home yet, because Stiles’ brain is firing on all cylinders, putting all sorts of little tidbits together, and painting kind of a daunting picture.</p>\n<p>At least this way, he has twenty minutes or so to lose himself in making dinner, so hopefully he won’t be a space case when his dad comes home.</p>\n<p>*</p>\n<p>When in doubt, Stiles’ battle cry has always been “To Google!” Google knows all, provided you can give it the right search parameters, and if there’s one thing Stiles prides himself on, it’s his research prowess. He doesn’t know what Scott and his pack are going to do without him and his mad researching skills, actually, but he also doesn’t think that’s his problem anymore.</p>\n<p>They’ll figure it out.</p>\n<p>Or they won’t, and they’ll die horribly, but Stiles is trying to be a glass-half-full guy here, so he’s banking on them being able to figure it out.</p>\n<p>That Thursday night, two days after he hung out at Danny’s, Stiles finds himself searching out whatever information he can on bisexuality. The more he reads, the more he starts to feel settled and secure, because this is him. This is something he gets, deep down, all natural instinct. It’s like a million things suddenly click into place, and even though it’s only been a few days of angst and deliberation, it feels good to put a label on it – to find one that fits him.</p>\n<p>He doesn’t feel any great need to act on it; just knowing is enough for now. Besides, Danny is starting to look like the only friend he’s got, and Stiles isn’t willing to jeopardize that for a second.</p>\n<p>Almost like Danny’s psychically tuned into Stiles’ brain waves, he texts just as Stiles closes out of the final Wikipedia page he was skimming.</p>\n<p>\n<b>come over tomorrow for madden?</b>\n</p>\n<p>Stiles grins.</p>\n<p><b>prepare to get your ass kicked</b>, he replies.</p>\n<p>They text back and forth a few times, their threats growing ever more dire, before Danny finally says he has to get his brother and sister in bed, but he’ll see Stiles tomorrow.</p>\n<p>Stiles goes to sleep that night feeling more content than he has since his fight with Scott.</p>\n<p>*</p>\n<p>Madden’s a great game, but after playing it for three hours straight, even Stiles could use a break, and this time, he and Danny grab the proffered tray of bagel bites and head up to Danny’s room.</p>\n<p>It’s freakishly neat, is the first thing that Stiles notices. The colors are all dark and rich - navy blue and forest green - ultra-masculine, except that there’s also a poster of Lady Gaga on the wall, which makes Stiles grin, thoroughly charmed.</p>\n<p>There’s a stack of SAT prep books by Danny’s bookshelf, and his clearly state-of-the-art computer dominates the rest of the room, perched on a large desk, complete with a hard drive, a printer, and a stack of computer games.</p>\n<p>“Nice poster,” Stiles comments, nodding toward Her Gaganess.</p>\n<p>“My sister got it for me for Christmas,” Danny says with a fond smile. “I’d actually take Lucille Ball or Judy Garland as my preferred gay icon over Lady Gaga any day, but it was a nice thought.”</p>\n<p>It’s too good a segue to pass up, and Stiles clears his throat, gingerly takes a seat on the edge of Danny’s bed.</p>\n<p>“So,” he says slowly, “your family’s cool with it? I mean, they seem great, and I know you used to have a pretty serious boyfriend, so they must’ve been okay with, uh... you know...” Stiles finishes, making a vague sort of all-encompassing gesture with his hand.</p>\n<p>“They’re awesome,” Danny agrees, taking a seat in his computer chair, which looks ten times more comfortable and cushiony than Stiles' own. “I know with some families, they just sort of ignore it, and everyone talks around it - that’s how my ex’s parents were. I'd go over there, and they'd never really look me in the eye, like if they pretended I wasn't there, I'd go away. But mine don’t treat me differently at all, and they’re all about meeting my boyfriends or whatever.”</p>\n<p>“That <i>is</i> awesome,” Stiles echoes. “Did they see it coming?”</p>\n<p>“I think they had it figured out before I did,” Danny says with a shrug. “I knew by the time I was eight or nine, probably, but my mom swears she had her suspicions beforehand.”</p>\n<p>“You knew when you were that young?” Stiles asks, surprised. “Really?”</p>\n<p>“I think you just know. It’s a part of you, right? So... yeah.”</p>\n<p>“But what if you don’t?” Stiles asks, recognizing that his voice is maybe too interested, a little too intent. Danny looks at him curiously, and so Stiles swallows and presses on. “I mean, what if you... like, what if you spent your whole life thinking you were one way, and then you start to realize that maybe you’re another way, too, only it had never occurred to you to be that way, because you’d always thought you were that first way - “</p>\n<p>“Stiles,” Danny interrupts, looking more amused than irritated, which has to be a good sign, “you’re not gay. You’ve been obsessed with Lydia for <i>years</i>.”</p>\n<p>He sounds a lot like Stiles’ dad, enough so that it makes Stiles huff out a quiet laugh. “Um, no,” he says, “not gay. But... bi, I think. Maybe.”</p>\n<p>“Bi,” Danny repeats, and now he’s frowning, and Stiles doesn’t know him well enough to know whether it’s a good frown or a bad one.</p>\n<p>“Okay,” Stiles says quickly. “So, I know we’re getting along right now and playing video games and stuff, but I mean, you’ve spent kind of a lot of years not liking me. Do you remember why?”</p>\n<p>Danny doesn’t even look embarrassed as he says, “You were hellishly annoying the first few years of grade school.”</p>\n<p>“Yup,” Stiles agrees, willing to admit to that much. “I was always around you, right? It was basically a two-year-long campaign of ‘Pay attention to me.’”</p>\n<p>“I guess that’s one way to look at it.”</p>\n<p>“And I finally <i>stopped</i>,” Stiles continues, “in third grade. When Lydia Martin transferred in, and instead of wanting to be around you all the time, I wanted to be around her.”</p>\n<p>Danny stares at him, but Stiles can see him processing that information. “Okay, so wait a minute,” he says. “You’re telling me that all that time you spent bothering the hell out of me - that was you pulling my metaphorical pigtails?”</p>\n<p>“That is... probably accurate, yes,” Stiles says. “I mean, until Lydia showed up, and she had <i>actual</i> pigtails, and then it was all sort of downhill from there for me.”</p>\n<p>From the expression on Danny’s face, Stiles is pretty sure he’s just blown Danny’s mind.</p>\n<p>“Anyway,” he continues, “I was all about Lydia for so long, that I think I just kind of had blinders on for everyone else, you know? But she’s... I mean. I think I finally get that she’s never going to pick me. After everything I did for her this year - after all that she <i>still</i> picked Jackson. She loves him. So. I guess I’m... realizing I have other options, for the first time in a long time. And some of those options have stubble.”</p>\n<p>At that, Danny actually laughs, and Stiles feels a little bit of the tension around his shoulders slip away.</p>\n<p>“Stubble, huh?” Danny asks. “I <i>knew</i> that line about Miguel being your cousin was bullshit. Also, his name being Miguel.”</p>\n<p>Stiles fishmouths at him, his face flushing, and he finally bites out, “Fine, his name is Derek. And Derek is so far off the table I cannot even begin to tell you.”</p>\n<p>“Uh huh. So… why was he lurking in your room? You’re trying to tell me that <i>wasn’t</i> some clandestine booty call?”</p>\n<p>“Oh my God, no!” Stiles exclaims. “Shut up, I don’t even know why I told you all this. I haven’t told <i>anyone</i> yet, I just... needed to say it out loud to someone, I guess.”</p>\n<p>“As far as people you would want to tell, I’m a pretty good pick,” Danny says, moving to sit next to Stiles on the bed, their shoulders bumping companionably. It’s nice. “You’re doing okay?”</p>\n<p>“Yeah,” Stiles says. “I am, actually. Mostly, right now, I want a coming out party. Do we get one of those? I feel like I should get one of those.”</p>\n<p>Danny laughs again and shoves at Stiles’ shoulder. “Come back Friday night, okay?” he says. “We’ll pregame, and I’ll take you out. See if we can find you some other hot, stubbly guy for you to sneak into your room.”</p>\n<p>Stiles flushes like crazy, but he’s grinning, because that sounds really good. It sounds like fun, and he could use some fun.</p>\n<p>“Thanks,” he says. “Friday. I’m holding you to it.”</p>\n<p>He hangs out for another hour or so in Danny’s room, debating movies and music, listening more eagerly than he lets on to Danny’s stories about the lgbtq scene in Beacon Hills which, while small, sounds pretty welcoming.</p>\n<p>By then it’s dinner time, and even though Danny invites him to stay again, Stiles decides to head home. He’s got a lot of things to think about, and some time to himself wouldn’t be the worst thing in the world.</p>\n<p>As soon as he pulls into the driveway, he gets the sense that somebody’s watching him. It makes the hair on the back of his neck prickle, but when he gets out of his jeep, he doesn’t see anyone in the near vicinity. He doesn’t hear anything either.</p>\n<p>He gets his key ready, and he has it in the lock the instant he gets to the door. He’s just turning the knob when he hears a noise, and panic rises sharp and bitter in the back of his throat. He throws the door open and lunges inside, but he’s way too slow, and he hasn’t even begun to slam the door shut before there’s a body colliding with his back, sending him sprawling to the floor.</p>\n<p>Stiles yells and resorts to his preferred method of escape, which happens to be flailing. Sometimes, if he’s lucky, he can score a hit with a wayward elbow or something. Unfortunately, luck doesn’t seem to be on his side right now, because whoever’s on top of him is a whole lot faster than Stiles is, not to mention stronger.</p>\n<p>“Get off!” Stiles shouts. “Get <i>off</i> of me, or I swear, I’ll - “</p>\n<p>He doesn’t even have to finish the threat, because the weight on top of him disappears. Stiles hears the door click and the lock turn, and he whips onto his back, squinting up at his assailant.</p>\n<p>It’s Scott, and all of Stiles’ panic immediately turns to rage.</p>\n<p>“Are you kidding me?” he yells, scrambling to his feet. “Holy <i>shit</i>, dude, I about had a heart attack! What the hell was that!”</p>\n<p>“You aren’t returning my calls!” Scott exclaims. “This was a last resort, Stiles, I just want to <i>talk</i>. And if I’d let you know I was here, you would’ve slammed the door in my face.”</p>\n<p>That’s... true, but Stiles just scowls, because attacking him out of nowhere is completely crossing a line. Seriously, his heart was on the verge of giving out. It’s still beating faster than it should be, and he knows Scott can hear it, which actually only serves to make him even more irritated.</p>\n<p>“I don’t see what there is to talk about,” he grumbles, pushing past Scott and heading to the kitchen to start dinner.</p>\n<p>“How about the fact that you basically threw a tantrum, walked off the lacrosse field, and then ignored me for over a week,” Scott fires back. “How about that?”</p>\n<p>Stiles grabs a pot from underneath the stove, fills it with water and slams it down on the burner with more force than is strictly necessary.</p>\n<p>“Yep, tantrum-thrower, that’s me,” he says. “Throwing tantrums all over the place, no reason for them at all.”</p>\n<p>“There wasn’t any reason for it!” Scott says. “You just went crazy - and what was with fouling Isaac like that? You could’ve hurt him!”</p>\n<p>“I could <i>not</i> have,” Stiles says, and the idea is so ludicrous that he almost laughs. “Holy shit, are you kidding me? He’s a werewolf, Scott, I would’ve broken my lacrosse stick in half before even making a dent in his stupid, thick skull.”</p>\n<p>“You’ve been a dick to him ever since he moved in - “</p>\n<p>“No more than you guys have been dicks to me,” Stiles fires back. “You have this whole double <i>life</i> going on now, and you’ve done everything possible to keep me out of it - “</p>\n<p>“Because that’s what I thought you wanted!” Scott interrupts. “You <i>said</i> - “</p>\n<p>“Yeah, you know what pushed me over the edge there, Scott?” Stiles asks, brandishing a wooden spoon at him. “How about the fact that Gerard Argent beat the shit out of me, and you didn’t even come <i>looking</i> for me?”</p>\n<p>That scores a hit; Stiles can see it in the way Scott’s face falls, how there’s an apology stamped all over it. “Stiles,” he says quietly. “I wanted to - I was <i>about</i> to, and then Derek and Peter showed up, and...”</p>\n<p>“Two hours,” Stiles says, and his voice sounds funny to his own ears. A little cracked and rough. “You could’ve tracked me down no problem, and instead, you let my dad go crazy worrying about me for two <i>hours</i>.”</p>\n<p>“Stiles, I’m sorry,” Scott says. “I made a choice. And I’m not saying it was the right one, but I had to - ”</p>\n<p>“If it had been Allison, there wouldn’t have been any choice,” Stiles snaps. “You would have gone after her the second she went missing.”</p>\n<p>It’s too true a point for Scott to argue, and they both know it.</p>\n<p>“Get out,” Stiles says. “And I swear to God, if you jump out at me like that again, I’m going to start carrying wolfsbane on me.”</p>\n<p>Scott’s shoulders slump, and he takes a deep, sad breath, like he’s about to start pleading with Stiles again, but then he frowns instead.</p>\n<p>“Armani?” he asks, taking another sniff of the air. “Why do you smell like Danny?”</p>\n<p>Stiles glares at him. “You have your new friends, I have mine,” he grits out.</p>\n<p>“Danny doesn’t even like you,” Scott says, sounding surprised, and that’s the last straw, the fact that Scott doesn’t even believe Stiles might have found someone who wants to hang out with him.</p>\n<p>“Well, thanks, Scott,” Stiles says bitterly. “I always knew I could count on you to believe in me.”</p>\n<p>“Dude, that wasn’t what I <i>meant</i> - “</p>\n<p>“I have dinner to make, you need to leave,” Stiles says, cutting him off. He turns back to the stove to check on the water, adds a pinch of salt and a dash of oil, and ignores Scott’s quiet, pleading, “Stiles.”</p>\n<p>A few moments later, and he hears Scott’s footsteps retreat, then the opening and closing of the front door. As soon as he’s gone (because Scott isn’t the type to even think of just pretending to close the door), Stiles slumps over the counter, his palms pressed hard to his temples. He can feel a tension headache coming on, and that is seriously the last thing he needs right now.</p>\n<p>Stupid Scott, and his stupid, earnest, puppy dog face, and if they were fighting over anything else right now, Stiles would have folded like a cheap card table, but he’s too angry for that. He’s too furious and hurt and upset to give even an inch, and he doesn’t know when that’s going to go away, if it ever is.</p>\n<p>So for now, he doesn’t linger over thoughts of Scott. He puts the pasta in, starts preparing a salad, and thinks instead about how he’d better make sure Danny knows he doesn’t have a fake ID, as that is one hundred percent going to affect their Friday night.</p>\n<p>The fake ID, according to Danny, isn’t going to be a problem.</p>\n<p>“I know the bouncer,” he says with a shrug, “he’ll let us in. Besides, once we pick out some clothes for you, you’ll get in no problem.”</p>\n<p>“Uh, excuse me?” Stiles says, glancing down at himself. “I have clothes. I’m wearing them. What’s wrong with these?”</p>\n<p>Danny smiles pityingly, that sort of look that’s always driven Stiles crazy, and not in the fun way. “You’re in baggy jeans, a t-shirt, and a hoodie,” he says.</p>\n<p>“This is my best hoodie!” Stiles exclaims. “What do you want from me?”</p>\n<p>“I want you to take it off, and then agree to wear whatever I give you,” Danny says simply. His voice is incredibly firm, his arms are crossed, and Stiles knows immediately that this is a losing battle. That doesn’t stop him from grumbling as he sheds the hoodie.</p>\n<p>“Where do you think you’re going to conjure up these clothes anyway?” Stiles asks. “None of your stuff is going to fit me. Like, not a chance, dude.”</p>\n<p>Danny just rolls his eyes. “Trust me,” he says, “I’ll manage.” He starts digging right through closet, obviously done with Stiles’ protests.</p>\n<p>A few minutes later, he emerges with a dark red v-neck that looks like it has a better chance of fitting Parker, and a pair of skinny jeans, the likes of which Stiles hasn’t worn since he left his ‘trying to emulate Zac Efron’ stage behind.</p>\n<p>“No,” Stiles says promptly, but Danny just thrusts the items at him. “No,” Stiles says again, but Danny is insistent.</p>\n<p>“You either put these on, or I’ll be forced to do it for you,” he threatens, at which point Stiles decides acquiescence is the better part of valor and resigns himself to the stupid outfit.</p>\n<p>The shirt is too tight, just like Stiles knew it would be, and the jeans aren’t much better, but Danny takes one look at him and grins.</p>\n<p>“Perfect,” he says, and Stiles knows there’s no point in disagreeing, that Danny is just going to steamroll right over him if he tries.</p>\n<p>“I hope you know, I feel violated,” he grumbles.</p>\n<p>“I’m okay with that,” Danny says, amused. “Here, you’ll feel better after shots, give me your glass.”</p>\n<p>Stiles, it turns out, <i>does</i> feel a lot better after shots. He feels that perfect level of warm and fuzzy, where he sort of wants to just hang all over everyone and be <i>close</i> to people. He’s a people person, he is, people are his favorite, and they also happen to make excellent places for him to rest against.</p>\n<p>“You’re gonna be able to walk there, right?” Danny asks, shades of concern in his voice. “‘Cause I’m not carrying you.”</p>\n<p>“Psshhhhhhhht,” Stiles says, shoving at Danny’s face. “I have a fantastic tolerance and am a champion walker, do not cast such aspersions on my walking ability.”</p>\n<p>“Really? Because you sound wasted,” Danny says, but he’s grinning. “Although I guess if you can use the word ‘aspersions’ you’ll probably be able to make it the three blocks to the club.”</p>\n<p>“Indeed,” Stiles agrees.</p>\n<p>It’s a nice night, a little cooler than it’s been all summer, which is pretty ideal considering the rum that’s flowing through Stiles, warming him up, leaving his skin flushed. He and Danny don’t talk, but for once, Stiles is okay with that, too. The night air smells crisp and clean, and if it weren’t for the fact that he should probably watch where he’s putting his feet, he would want to close his eyes and just breathe it all in.</p>\n<p>He hears the club before they can see it, the air growing thick with ringing voices the closer they get.</p>\n<p>“You’re sure I’ll be able to get in?” Stiles asks Danny in an undertone. His nervousness is beginning to creep up on him, make itself known.</p>\n<p>“Trust me,” Danny says again. “Lawrence has a type, and you’re it. You’ll be fine.”</p>\n<p>“Lawrence?” Stiles asks, because who the hell is Lawrence, and why does it matter that he has a type, but that’s when they come into sight of the club, and Danny takes Stiles by the elbow and steers him toward the front of the line.</p>\n<p>“‘Rence!” he calls, waving when the bouncer looks up. Lawrence signals for them to come to the front, and while there’s some grumbling from those who have been waiting, Danny ignores it, so Stiles does, too.</p>\n<p>“Mahealani,” Lawrence says, giving Danny a slap on the back, hard enough to make him wobble. Not that it’s such an impressive feat, considering Lawrence has got to be six five at least, and seemingly made of solid muscle. He’s got light brown hair, killer blue eyes, and... yeah. Stubble. Stiles shoots Danny a highly suspicious look, which Danny ignores outright. He might as well be humming to himself and twiddling his thumbs, he’s not even <i>pretending</i> to be subtle.</p>\n<p>“So who’s your friend?” Lawrence asks, those pretty blue eyes raking over Stiles, lingering on the low dip of that v-neck. “Haven’t seen him before.”</p>\n<p>“This is Stiles,” Danny announces, slinging an arm around his shoulder. “He’s new - he’s recently figured some things out, made some headway in the self-actualization process.”</p>\n<p>Unless Stiles is much mistaken, Lawrence’s eyes gleam at that, and his smile widens. There’s something vaguely predatory about it, but not in a terrifying werewolf way. More in a way where the only word that comes to mind is ‘hot,’ and Stiles has already established with himself his enjoyment of getting shoved up against walls, and Danny knows all about his thing for guys who are both attractive and stubbled. So he’s thinking he should probably be more grateful than not for Danny’s machinations.</p>\n<p>Stiles swallows, his throat bobbing with it, and Lawrence laughs. “Well, congrats, Stiles,” he says, then leans in. “I get a dinner break in an hour,” he murmurs. “I’ll come find you, buy you a drink.”</p>\n<p>For maybe the first time in his life, Stiles is struck speechless, but he retains the presence of mind to nod jerkily, and he’s rewarded with another grin from Lawrence, who then opens the door and waves them inside.</p>\n<p>“Does this shirt have magical properties?” Stiles hisses as soon as they’re in. “And also, did you set that up? Are you setting me up?”</p>\n<p>“I... may have finagled,” Danny says, looking far too pleased with himself. “Slightly. It’ll be good for you to get your feet wet though! And Lawrence is a nice guy, he isn’t going to push for anything.”</p>\n<p>“He is like eight thousand miles out of my league!” Stiles exclaims. “Have you not <i>seen</i> him?”</p>\n<p>“Like I said, you’re his type,” Danny says with a shrug. “Besides, you’re good-looking. He’s not really out of your league.”</p>\n<p>Stiles positively goggles at him. “Tell that to, oh, I don’t know, every other person in our high school who has shown less than zero interest in dating me in the two years I’ve been going there!” he exclaims.</p>\n<p>“Well, that’s down to your personality, not your face,” Danny says. He’s grinning, so Stiles knows it’s a joke, but when Danny goes to sling an arm around his shoulders again, Stiles still feels obliged to make a face at him.</p>\n<p>“I need another drink,” he mutters.</p>\n<p>“Yeah, me too,” Danny agrees, and he drags Stiles over to the bar, where he makes no move to order anything, just leans up against it.</p>\n<p>“What are we doing?” Stiles asks, leaning in so Danny can hear him over the pulsing music. “Are you ordering?”</p>\n<p>“No point,” Danny smirks. “Give it a minute.”</p>\n<p>And sure enough, a couple minutes later, the bartender is tapping them on the shoulders and sliding two plastic cups toward them, filled with something that smells potent.</p>\n<p>“Courtesy of the two gentlemen down that way,” he says, and Stiles peers down to see two men who have to be at least in their thirties watching them.</p>\n<p>“Oh my God,” Stiles says, “they’re old.”</p>\n<p>“Yep,” Danny agrees, grabbing his glass and raising it down to the guys in a toast. “Which is why we drink, and then disappear.” He knocks his drink back, and Stiles follows suit. He’s still wincing from the sharp burn of the vodka as Danny grabs him and heads for the dance floor.</p>\n<p>“Dude!” Stiles yells, “I am not your duck on a string!”</p>\n<p>“What?” Danny yells back, but he’s clearly not too interested in the answer, considering the way his gaze is already fixed to the grinding mass of bodies in front of them.</p>\n<p>Stiles is not, nor has ever been, much of a dancer, and he balks a little bit at jumping right into the middle of things. Danny must be an old hand at it though, because he’s smiling encouragingly at Stiles, his body already moving to the music.</p>\n<p>It’s overwhelming there in the center of the dance floor. The music is loud, and the press of bodies around them is hot, and even with the drinks he’s had, Stiles is a little too self-conscious to really let loose. Plus, people keep touching him, which means he keeps jerking himself away, not quite comfortable with the fact that strangers are trying to grope him.</p>\n<p>“Stiles, relax!” Danny shouts at one point, giving his shoulders a shake. “It’s supposed to be fun!”</p>\n<p>Stiles is no longer certain their definitions of fun align, but before he can come up with a response, there’s a delighted yell behind him, and he’s suddenly engulfed in a hug from what must be some sort of bright pink feather monster.</p>\n<p>“Stiles!” a strangely familiar voice crows, and Stiles is manhandled around, only to find himself face to face with Ginger.</p>\n<p>“Hey!” he exclaims, positively delighted, and impulsively gives her a hug.</p>\n<p>“So you’re back, hmm?” Ginger asks over the music, arching one impeccably drawn eyebrow.</p>\n<p>“I - yes,” Stiles says. “Yes, I am.”</p>\n<p>“Knew it,” Ginger replies, and bops him on the nose. It’s such an unexpected action, so out of sync with the rest of the club, that it startles a laugh out of Stiles.</p>\n<p>“Now,” Ginger continues, “what exactly do you think you’re doing here? Dancing? Because if that’s what you call dancing, we have some work to do.”</p>\n<p>It’s plenty true, so Stiles just steps back, making room for Ginger and her pink feather boa, as well as the rest of her entourage. And suddenly, Stiles is having fun. Ginger and her friends are every bit as loud and boisterous as Stiles is on his most ADHD-fueled days, and what’s more, they’re not getting all grabby hands with Stiles’ ass. Well, not much, anyway.</p>\n<p>It’s not too long before Danny gets pulled away by a handsome blonde with the deepest dimples Stiles has ever seen. That’s fine though, Stiles is pretty content where he is.</p>\n<p>The DJ’s just switched over to what sounds like the beginning of a Ke$ha block when Lawrence suddenly appears, squeezing between Ginger and Mary Lou, a drink in each of his hands. He offers one to Stiles, eyebrows raised, and Stiles takes it without hesitation. Ginger shoots him another look with arched eyebrows, but Stiles gives her a little wave and a smile, at which point she smirks and makes a shooing gesture at him.</p>\n<p>Lawrence is somehow even better looking than Stiles remembers, and the <i>way</i> he’s looking at Stiles makes him gulp his drink a little too fast.</p>\n<p>“Good?” Lawrence asks, balancing his own plastic cup carefully as he slips closer to Stiles, one hand coming to rest on his hip.</p>\n<p>“Yeah,” Stiles says. “A lot better than the one I had earlier.”</p>\n<p>Lawrence looks pleased to hear that, and he starts to rock back and forth in time to the music, nudging Stiles to move with him. He’s still sipping at his drink, but he’s watching Stiles over the rim of his cup, and it’s flooding Stiles with a heat he hasn’t felt since Derek last shoved him up against a wall.</p>\n<p>He drains his drink with a final long gulp, just in time for Lawrence to finish his own. He plucks Stiles’ cup out of his hand, then sets both of them on a nearby table. Stiles hadn’t even realized they’d shifted this far from the center of the dance floor.</p>\n<p>“You wanna dance some more?” Lawrence asks, keeping his one hand on Stiles’ hip, then sliding the other around to slip into his back pocket and give his ass a squeeze. It makes Stiles jump, his hands jerking immediately to Lawrence’s shoulders, where he grips tightly. Lawrence doesn’t pull him in again though, and he’s looking at Stiles kind of earnestly, clearly waiting for his reply.</p>\n<p>“Yeah,” Stiles says. His tongue darts out to wet his lips, and he sees Lawrence’s eyes drop down to his mouth, following the motion. “Yeah, let’s dance.”</p>\n<p>It’s the right answer, because Lawrence beams and starts walking Stiles back into the crush of people. It’s hot and sweaty, and Stiles can feel the back of his shirt sticking to his skin, Lawrence’s hand an even hotter brand on his hip.</p>\n<p>The music is low and rhythmic, and each steady bass note seems to bring them closer, until they’re following the lead of everyone around them and grinding together. Stiles takes the opportunity to run his hands up Lawrence’s chest, over the solid bulk of his shoulders and up around his neck. He’s so built and strong, and it feels like he’s everywhere, all wrapped up around Stiles.</p>\n<p>Danny was telling the truth though, because Lawrence doesn’t make any moves to push things further. He’s touching Stiles a lot, but in mostly proper places, and he hasn’t tried to kiss him yet or anything. It’s Stiles, in fact, who finally musters up the courage to cross that line, pressing himself up on his toes and lifting his chin in clear invitation.</p>\n<p>Lawrence accepts, sealing his mouth over Stiles’ in a hot, hard, demanding kiss. It’s leagues away from the single kiss Stiles had stolen one summer at camp, with a cute redhead who looked a lot like Lydia. That had been awkward and sloppy and overall, not that awesome. Lawrence knows very well what he’s doing though,and it’s more than enough to make up for Stiles’ lack of experience.</p>\n<p>It takes a few minutes for Stiles to realize they’ve stopped dancing, and that Lawrence is walking him purposefully toward a dark corner, never letting up kissing him for an instant. Stiles’ back hits the wall with a thump, and a gasp tears out of him, leaving him suddenly dizzy with arousal. It’s mortifying, just how much this is doing it for him, and he squeezes his eyes shut, desperately trying to get his breathing back under control.</p>\n<p>“Hey,” Lawrence hums, mouth hovering by his ear. “S’okay. You’re doing great - fuckin’ beautiful, Stiles, you know that? How beautiful you are?”</p>\n<p>That statement is so shocking and unexpected that Stiles’ eyes fly right back open. “Should get your eyes checked,” he says promptly, falling back on his default snark. Lawrence’s face is perfectly serious though, his eyes intent, and he gently laces the fingers of his left hand in Stiles’ right, sliding it up the wall over Stiles’ head and holding it there while he leans in for another kiss.</p>\n<p>They keep at it until a distant, tinny beep breaks through the music, and Lawrence groans.</p>\n<p>“Break’s over,” he mumbles against Stiles’ mouth, finally pulling away with great reluctance, his hand sneaking down to his pocket where he shuts off his cell phone's alarm. When Stiles blinks, his eyes feel almost too heavy to move, and his mouth has gone numb and tingling.</p>\n<p>“Already?” he rasps, gaze still stuck to Lawrence’s lips. They’re red and swollen, and Stiles has to wonder if his own look the same. They’re probably even worse, considering Stiles’ fair skin, and oh God, he’s going to have beard burn, isn’t he?</p>\n<p>“Yeah.” Lawrence sighs, brushing his mouth against Stiles’ cheeks, his temple, down to his jaw. “Unfortunately. Could keep kissing you all night.”</p>\n<p>Stiles feels his cheeks go hot with the beginnings of a blush, and he clears his throat. “When do you get off?” he asks. “Danny and I... we might stay late, I don’t know.”</p>\n<p>“Two thirty,” Lawrence laughs. “Past your bedtime, I’m guessing.”</p>\n<p>“Watch it,” Stiles says, and he gives Lawrence’s side a pinch, but it only elicits a grin. Lawrence curves his hand to his cheek and ducks in for one more kiss, surprising a noise out of Stiles with a wet and dirty slide of his tongue.</p>\n<p>“I’ll be here next Tuesday,” Lawrence murmurs as he pulls away. “I won’t be working. If you’re interested.”</p>\n<p>Stiles doesn’t give a definite yes or no, but Lawrence doesn’t seem to expect one. He just gives Stiles one last grin before he pushes his way back through the crowd to his post at the door.</p>\n<p>It’s a good thing the corner he’s in is dark and comes with a solid wall at his back, because Stiles takes a good five minutes to catch his breath and will his hard on away. He’s hot and sweaty, and he’s starting to see why the guys in these clubs always seem to be without shirts, because his is sticking to him uncomfortably. He can’t stop touching his mouth either, rubbing the pads of his fingers over the prickling, sensitive skin.</p>\n<p>He hasn’t quite talked himself into walking when the crowd shifts and there’s Danny, heading right toward him.</p>\n<p>“Have fun?” he asks when he reaches Stiles, his grin awfully knowing.</p>\n<p>“Mmph,” Stiles says, which earns him a laugh.</p>\n<p>“You ready to go? We can stay if you want... I know Lawrence gets off late tonight. It’s your call.”</p>\n<p>“I... um. I - ” Stiles fumbles, like his tongue is too thick to form real words. “Yeah, I think m’ready. We can go.”</p>\n<p>Danny’s expression is a really <i>nice</i> one, and he claps a hand to Stiles’ shoulder, guiding him toward the exit.</p>\n<p>The sharpness of the cool evening air is a punch to the gut. It feels like an entirely different world out here, and Stiles would almost be wondering if this evening had been a fever dream, except for the way so much of his face feels raw.</p>\n<p>“You are going to have some wicked beard burn,” Danny comments, sounding more amused than should be allowed, if you ask Stiles.</p>\n<p>“Yeah, well, your neck looks like you got attacked by giant mosquitoes,” Stiles says promptly, and Danny immediately claps a hand over the hickeys that are forming, bruisey and purple against his skin.</p>\n<p>“Crap,” he mutters darkly, “it’s so much easier to hide them in the winter, I hate summer.”</p>\n<p>He sounds so ridiculously irritated, and Stiles finds himself dissolving with helpless laughter against his shoulder. Tonight’s been a good night, he thinks. He feels free, for the first time in a long time. It’s heady, a dizzying rush, and if it weren’t for the fact that he is clearly underage and also clearly drunk, with a father who is an actual sheriff, he thinks he would be crowing about it, tilting his head back and shouting straight up to the stars that there is someone in the universe who thinks he’s beautiful, who wants to kiss and touch him and maybe more.</p>\n<p>They head back to Danny’s, since Stiles already told his dad he’d be spending the night. It felt like the smart thing to do, and considering Stiles’ current state of being, he is going to give himself a pat on the back for that kind of forethought.</p>\n<p>“You hungry?” Danny asks once they get back, slipping inside the dark, still house. Everyone’s gone for the weekend, on a trip to Disneyland that Danny had opted out of, so there’s no need for them to be too terribly quiet.</p>\n<p>“I could eat,” Stiles agrees, sliding into one of the stools they have placed along their counter.</p>\n<p>Danny starts making grilled cheese sandwiches, which smell <i>amazing</i>.</p>\n<p>“So who was that guy you spent the night macking on?” Stiles asks, stealing a piece of cheese to munch on. “Is, uh... anything going on there?”</p>\n<p>Danny shrugs, slathering butter on one side of the sandwich, then dropping it into the heated pan with a sizzle. “Nah,” he says. “I’m not actually looking for anything right now. You know, I’m still sort of... my last relationship was...” He grabs for a spatula and gives the sandwich in the pan a sharp, moody poke.</p>\n<p>“Well, he’s an idiot,” Stiles says, jumping in with a sweeping general statement. Sometimes though, those are the best kinds of statements, and now is one of those times, if the way Danny sneaks a grateful glance at him is any indication.</p>\n<p>“He is,” Stiles says firmly. “You don’t have to worry though - you’ll find somebody else. You’re, like - you’re perfect. I mean, you’ve got shitty taste in best friends, we’re all in agreement on that fact, but other than that, you are a perfect specimen of a person, and it’s ridiculously unfair.”</p>\n<p>“You’re drunk,” Danny smiles, deftly flipping the grilled cheese sandwiches.</p>\n<p>Stiles gives him a stern, narrow-eyed look. “Not that drunk,” he says, taking care to keep his words as crisp and clean as possible. “I know perfection when I see it.”</p>\n<p>“Eat your sandwich,” Danny says, but he’s looking pretty stupidly fond as he sets the plate down in front of Stiles. He’s even cut it in half diagonally, and Stiles ignores the fact that the cheese is melty and practically bubbling it’s so hot, scoops the triangle up to his mouth and takes a big bite.</p>\n<p>“Ohhhhh my <i>God</i>,” he moans, uncaring that his mouth is full. If he and Danny are going to be friends, Danny is going to have to deal with the less-than-charming aspects of Stiles’ personality. “Oh my God, and you can <i>cook</i>, this is the most amazing grilled cheese I have ever eaten.”</p>\n<p>Danny slides into the seat next to him and digs into his own grilled cheese sandwich, although he eats his with a fork, like a huge, huge weirdo.</p>\n<p>“Sandwiches,” Stiles mumbles around a mouthful of cheesy, buttery goodness, “are a <i>finger</i> food, Mahealani.”</p>\n<p>“Not all of us are heathens, Stilinski,” Danny replies, though he waits until he’s swallowed to do so.</p>\n<p>The sandwiches are gone in a matter of minutes, and then Danny gets them each a glass of water, which they carry up to his room. They’re quiet as they change into boxers and t-shirts, sipping all the while on their water.</p>\n<p>“So, good night?” Danny finally asks, setting his glass on his nightstand and tugging down the blankets on his bed.</p>\n<p>“Best night,” Stiles says, and he knows it’s the truth, feels warm and content as he says it. “Thanks.”</p>\n<p>Danny grins and climbs into his bed, letting out a slow, soft sigh as he settles down into the mattress. Stiles takes a quick look around and realizes there isn’t an air mattress or a futon or even a sleeping bag in sight.</p>\n<p>“Uh... Danny? Can I go grab the couch in the den? Or do you have an extra blanket, at least? I guess I could sleep on the floor...”</p>\n<p>“We can just share,” Danny says sleepily, holding the blankets open in invitation. Stiles’ eyebrows go way, way up, and he’s pretty sure his brain goes all spluttery for a long moment.</p>\n<p>“Share?” he asks, the word sounding more than a bit strangled.</p>\n<p>“It’s not a big deal,” Danny says, and he must be more tipsy than he’s been letting on, because he follows it up with, “Besides, I like to cuddle, and I never get to anymore.”</p>\n<p>The thought of Danny being a cuddle monster is <i>hilarious</i> to Stiles, but he holds back his laughter for fear it might burst out of him in a decidedly hysterical way. Instead, he just crosses over to Danny’s bed, slipping between the sheets and taking care not to cross the invisible line drawn down the middle.</p>\n<p>He shouldn’t have bothered though, because as soon as he’s lying down, Danny flips off his bedside lamp, which throws the room into gloomy darkness, and shifts close enough to Stiles that he can wrap an arm around his waist and tuck his face against the back of Stiles’ neck, one of his legs sneaking forward to get tangled up with Stiles' own.</p>\n<p>“Oh my God, you <i>do</i> like to cuddle,” Stiles mutters. “You’re like an <i>octopus</i>.”</p>\n<p>“G’night, Stiles,” is all Danny says, and soon enough his breathing has lengthened, deepened, and Stiles can tell he’s asleep.</p>\n<p>Sleep is tugging at his own eyelids, making them feel heavy and scratchy, but he can’t drift off quite yet. This marks the first time he’s shared a bed with somebody since he and Scott were, like, eight, and that means it’s a whole different <i>kind</i> of sharing a bed. It’s nice though, Stiles thinks. It’s warm and safe, and Danny feels a lot like a security blanket draped over him.</p>\n<p>It makes him wonder, not for the first time, if this is something Derek’s pack does. Stiles has spent hours researching, not only werewolves, but wolves and pack behavior, too. So he wonders, sometimes, if they strengthen the bonds between them with touch and nearness, wordless reassurance that they have each others’ backs.</p>\n<p>If they have done anything like this, Stiles has never been invited. But then again, it’s been made quite clear, multiple times over, that Stiles isn’t pack. He isn’t a part of the ties they’ve forged; if anything, he’s just the unfortunate tag along, lumped in with Scott, who never does seem able to commit to being part of Derek’s pack one way or the other.</p>\n<p>That’s fine though, Stiles tells himself, as he snuggles back closer to Danny. He doesn’t have any interest in a pack pile anyway - they’d probably all smell like blood and dirt and dog anyway, and Stiles will take Danny and the scent of his cologne any day, thank you very much.</p>\n<p>With that thought in mind, Stiles takes another deep breath, and finally lets himself go to sleep.</p>\n<p>~*~*~*~</p>\n<p>Stiles volunteers to make breakfast the next morning, since Danny fed him the night before. He prides himself on his breakfast sandwiches, and even though they’re not too terribly hungover, a buttery, cheesy mound of eggs and bacon piled between two slices of toast sounds heavenly.</p>\n<p>Plus, it’s a good activity to hold his attention, keep him focused. He’d woken up half-hard, and while he’d been able to extricate himself from both Danny and the sheets that now smelled like the both of them without waking Danny up, he doesn’t want things to get weird. It’d been better to slip away to the bathroom, splash some cold water on his face, then chirp out to a muzzy, blinking Danny as he’d passed his room, “I’m making breakfast! Fifteen minutes!”</p>\n<p>They eat quickly, spend an hour playing video games, and then Stiles gathers up his things and heads home.</p>\n<p>He’d been hoping that extra hour of video games would have been enough time for his dad to go out somewhere - anywhere - but no such luck. His car’s right there in the driveway, and Stiles can hear the hum of the lawn mower from around the side of the house. Sure enough, a moment later, his dad rounds the corner, his face brightening when he sees Stiles.</p>\n<p>“Great timing,” he calls out as he kills the mower’s engine. “The front and the rest of the back are all yours!”</p>\n<p>“I thought you <i>liked</i> mowing the grass,” Stiles protests as he slides out of his jeep. “You keep saying it keeps you active, keeps you fit! Maybe you’d be allowed to eat more cheeseburgers if you mowed the lawn more often, ever think about that?”</p>\n<p>His dad fixes him with a stern look and turns the mower’s handle toward Stiles. “I’ve got a mountain of paperwork to get through,” he says, “and I <i>distinctly</i> remember the conversation we had where we decided - ” He breaks off, frowning at Stiles. “What happened to your face?”</p>\n<p>Stiles’ hand goes to his cheek, checking or a scrape or a scratch that has somehow ninja’d its way onto his skin. He doesn’t find anything though, and his face screws itself up as he looks at his dad in confusion.</p>\n<p>“All around your mouth.” His dad frowns, motioning to his own face. “It looks like you’ve got a rash.”</p>\n<p>It hits Stiles, all at once, what his dad’s talking about, and he makes a strangled noise, his hand slapping over his mouth. Which, now that he’s thinking about it, <i>hurts</i>, because his skin is still irritated from last night and, no doubt, red enough to catch his dad’s notice.</p>\n<p>“Danny’s, uh... couch,” Stiles says quickly, as soon as he’s removed his hand. “Is very scratchy.”</p>\n<p>The lie slips out like second nature, because lying to his dad these days <i>is</i> second nature, as much as it turns Stiles’ stomach to think about. This isn’t anything he’s planning to keep from his dad indefinitely though, he is absolutely going to tell him. He just... wants to do it on his terms, when it won’t have to be accompanied by an explanation of how he spent the previous night making out with a clearly college-age guy at a club he most certainly wasn’t old enough to be in.</p>\n<p>“His couch,” his dad repeats, and there’s something in his expression that says Stiles hasn’t completely gotten away with his lie, but he’s willing to let it drop. For now.</p>\n<p>“His couch,” Stiles agrees.</p>\n<p>“There’s lotion in my bathroom cabinet,” his dad finally says. “Put some on, and then get back out here. I’ve got some other yard work I need you to do once you finish mowing.”</p>\n<p>Stiles goes immediately; he isn’t going to stick around on the off chance his dad decides to pursue a line of questioning in regards to his alleged couch burn. He finds the lotion easily enough, a brand-new bottle of it, right there on the bottom shelf. He doesn’t think anything of the pink, flowery logo until he’s already cracked the seal and started smoothing it over his skin.</p>\n<p>It’s the smell that brings him up short, a scent he remembers from when his mom used to reel him in for a hug and kiss the top of his head. It’s a visceral memory, strong enough to catapult him right back into that moment, like if he turns around, his mom might be standing right behind him, arms open for a hug.</p>\n<p>He takes a deep, shaky breath, and after a moment’s hesitation, finishes applying the lotion. He knows it will wear off soon enough, that he’ll adjust to the scent until he doesn’t even notice it, and that will probably be for the best. For now though, he keeps breathing deep, eyes closed against the assault of memories that come with each inhale.</p>\n<p>“You’re killin’ me, Dad,” Stiles groans, when his dad comes out to remind him that there are still hedges to be trimmed. All told, it’s two o’clock by the time Stiles finally drags his sorry ass inside.</p>\n<p>“I’m showering!” he calls out to his dad, who barely glances up from the paperwork he has spread out over the kitchen table. “And then I am ordering the biggest pepperoni pizza in the universe, and it’s all mine, I’m not sharing any of it.”</p>\n<p>“And who’s paying for this pizza, exactly?” his dad asks.</p>\n<p>“Okay, so, you can have <i>one</i> piece,” Stiles relents as he clomps up the stairs, “but you have to pick off the pepperoni!”</p>\n<p>What he’d really love to do is flop straight onto his bed and take the most epic of naps, but he’s filthy, and he’ll pay for any flopping he does now with an emergency load of laundry once he wakes up. Still, his bed is <i>calling</i> to him, and he’s staring at it longingly when he hears a thump outside his window.</p>\n<p>It takes him all of three seconds to cross his room and throw it open, and he’s not even all that surprised to see Derek crouched a few feet away on the roof, his gaze dark and furious.</p>\n<p>“I can’t get near your window,” he says, voice tight. No hi, hello, how are you - nothing like that, and Stiles narrows his eyes and crosses his arms.</p>\n<p>“That would be the mountain ash I put in,” he snaps. “And considering its sole purpose is to keep unwelcome werewolf-types <i>out</i>, I would say it’s doing its job admirably.”</p>\n<p>“I need to talk to you,” Derek says, and there’s a little bit of a growl in his throat that has Stiles swallowing hard, for reasons he isn’t entirely prepared to admit to himself just yet.</p>\n<p>“Well, as I’ve told Scott,” Stiles says, “I’m not that interested in a conversation, so feel free to be on your merry way.”</p>\n<p>“Stiles!” Derek snaps, and although Stiles wants to describe his tone as petulant and whiny, there’s a thread of authority there, too, a demand that Stiles feels almost compelled to answer.</p>\n<p>“My karma had better be tripling by the <i>second</i>,” Stiles grumbles as he climbs through the window, taking care to keep a few paces away from Derek, who’s still basically glowering at him, like an oversized bat or something. As Stiles is watching him, Derek’s nostrils flare, and an even deeper frown steals across his face.</p>\n<p>“You <i>reek</i> - ” he says roughly, a deep inhale accompanying his step closer.</p>\n<p>“I’ve been doing yard work all afternoon!” Stiles exclaims. “I haven’t showered yet - and if you think this even comes <i>close</i> to your stench at its very worst, you’ve got another thing coming - ”</p>\n<p>“It’s not that,” Derek growls. “It’s... people. You smell like other people. Like... like....”</p>\n<p>His expression goes funny, and Stiles tries frantically to think of anything other than last night and the feel of Lawrence pressed against him, or the cocooned warmth of Danny’s bed. Something besides the way Lawrence had gotten him so worked up in that dark corner of the sweaty club, or the morning wood that had greeted him upon waking a few hours ago.</p>\n<p>In the end, he just lifts his chin up, a clear challenge to Derek’s so-called authority.</p>\n<p>“I have non-werewolf friends, thanks,” he grits out. “And anything else you might smell on me is none of your business. Now either tell me what you’re doing here, or get out.”</p>\n<p>“How much do you know about the alpha pack?” Derek asks after a beat. “What has Scott told you?”</p>\n<p>“Uh... nothing?” Stiles asks, looking at Derek incredulously. “Are you kidding me? We’re not speaking! God, do you not talk to your pack, like, ever?”</p>\n<p>“Scott isn’t part of my pack,” Derek says, which at least answers the question of the current state of his and Scott’s ever-changing status. Not that Stiles cares.</p>\n<p>“Okay, fine, whatever,” Stiles says. “He wasn’t telling me anything even before we stopped speaking. I assumed that was a directive from you, by the way. Keep the meddling human away from your ridiculous werewolf drama - which is fine by me, for the record. I’ve washed my hands of it.”</p>\n<p>“The alpha pack’s been here for a month now,,” Derek continues, as if he’s not even listening to what Stiles is saying, which is way more par for the course than Stiles would like to admit. “They’ve been keeping quiet, but they’re gearing up for something big. All signs point to them wanting to take us out, eliminate any werewolves before we have a chance to settle in here.”</p>\n<p>“What do they care?” Stiles asks, in spite of his very strict ‘I do not care, I’m staying out of it’ stance. “You’re not about to go steal some other pack’s territory, right? What does it matter to them if you just hang out here and mind your own business?”</p>\n<p>“It’s more complicated than that,” Derek explains - somewhat patiently, even, considering it’s Derek. “Any new alpha is a potential threat. There are territories that belong to bigger packs not too far from here; if they look the other way while I build a pack of my own, they run the risk of losing their territory. They make themselves vulnerable to attack.”</p>\n<p>“So don’t attack them,” Stiles snaps. “There, simple. I’ve solved your problem for you. Can you please go now?”</p>\n<p>“They don’t care about my intentions,” Derek says, and any trace of patience has disappeared from his voice now. If Stiles didn’t know better, he’d say that Derek almost sounds scared. “They don’t want the hassle of incorporating a new pack. The existing packs have agreements - treaties, I guess you could say. When I lost my family - whatever deals we’d made with surrounding packs dissolved. They don’t carry over unless there’s an alpha immediately in line to succeed, who’s willing to rebuild the pack from the ground up. My sister and I left - and by doing so, we forfeited any right to continue holding territory here.”</p>\n<p>Stiles can only gape at him. “Then what the hell were you thinking, building yourself a pack?” he demands. “Are you <i>stupid</i>? If you knew all this, why the <i>hell</i> would you go around biting yourself a new family?”</p>\n<p>“It was necessary,” Derek says, his eyes flashing that creepy shade of alpha red. “I had to find out who killed Laura. And I needed the strength a pack offered - which, I might add, came in handy with the kanima - ”</p>\n<p>“Which was <i>also</i> your fault!” Stiles throws right back at him. “Jesus, long-term strategy is really not your strong suit, is it?”</p>\n<p>“Shut up!” Derek growls, shifting toward Stiles in a decidedly threatening way, but Stiles only moves closer to his window sill, poised to tip himself back inside at the slightest provocation. Derek takes notice, and he drags in a deep breath; Stiles watches as he forces the tension from his shoulders, which Stiles kind of only thinks would create more tension, but then again, this is Derek Hale. He probably wouldn’t know what to do without the weight of at least half a world bearing down on him.</p>\n<p>“I will admit that some of my choices may have lacked foresight,” Derek finally says.</p>\n<p>“No kidding,” Stiles says, though the words come out a bit faint, most likely due to the shock of hearing Derek admit that he is indeed fallible.</p>\n<p>Derek still shoots him a glare, so it’s not like things are changing too radically.</p>\n<p>“But what’s done is done,” Derek continues. “I can’t undo the bites I’ve given, and they’re not going to negotiate with us.”</p>\n<p>That’s when Stiles’ frustration gets the better of him, and he gestures wildly with his arms, his words bursting out of him. “So why are you <i>here</i>, Derek? I’m not pack, and I’m not a <i>werewolf</i>, so what could I possibly even bring to the table right now?”</p>\n<p>It’s a long moment before Derek answers, and Stiles is having a hard time reading his expression. His eyes are dark and guarded, and he isn’t giving anything away. “They don’t know you,” he finally says. “The Alphas - they’re familiar with all of us, regardless of whether or not we’re shifted. They’d be able to smell Jackson all over Lydia. Scott would never ask Allison to go up against a threat like this, and I’m not willing to bring an Argent into a pack matter anyway.”</p>\n<p>And there it is, yet another reminder that Stiles apparently doesn’t feature at all in Scott’s list of priorities. It stings, but Stiles pushes past it, because that isn’t really the issue right now.</p>\n<p>“I’m still not clear on what you’re asking here, Derek,” Stiles says. “Am I supposed to be some sort of spy for you? Peek through their windows and eavesdrop on whatever nefarious plots they’re cooking up?”</p>\n<p>“They want us <i>dead</i>,” Derek growls. “And we know <i>nothing</i>. We don’t even know who all of them are, how many they have, and we can’t go into whatever’s coming completely blind!”</p>\n<p>“So, what, I’m your red shirt?” Stiles asks, edging closer to Derek. There’s a faint trembling beginning underneath his skin - rage, he thinks, seeping up to the surface slow and steady. “Send Stiles, he doesn’t matter. If he makes it back, great, we’ll have some inside information. If not, oh well, he wasn’t important to anyone anyway.”</p>\n<p>For a full five seconds, Derek forgets to glare at him. Instead, he just looks at Stiles with sharp disbelief. Stiles watches as he swallows, his eyes drawn to the bob of Derek’s throat.</p>\n<p>“You won’t be in danger,” Derek finally says. His voice is low and intent, and his eyes are intense, fixed to Stiles’ face. “That’s the only reason I’m asking, Stiles. They don’t <i>know</i> you. They’re here on pack business, and if they were to harm a human - it would call too much attention to themselves. Attention they don’t <i>want</i>. You’re the perfect person to get close to them - you’re not a werewolf, and you don’t smell anything like pack anymore - ”</p>\n<p>“No,” Stiles says. “That’s my answer, okay? No.”</p>\n<p>That disbelief is still there on Derek’s face; it’s possibly even ramped up a notch compared to what it was before, like Derek never for a second believed that he wouldn’t be able to talk Stiles into it.</p>\n<p>“Do you not understand?” Derek demands. “This isn’t a game, Stiles, I’m not joking around here - ”</p>\n<p>“Oh, I know you’re not joking,” Stiles says, and his smile is brittle. “But I don’t trust you. And you don’t trust me, right? I can’t possibly be your only option; you have a backup plan. And I’m done playing at being hero. Figure it out yourselves.”</p>\n<p>“Stiles,” Derek says urgently, but Stiles has already climbed back inside his room in one swift, fluid motion. He shuts the window with a loud thump before Derek can say another word, then lowers his blinds for good measure.</p>\n<p>He knows Derek’s still out there; he can practically feel the weight of his gaze, even through the wall, but there’s no way in hell Stiles is continuing this conversation any further. He’s done, he is beyond done, he’s not going to throw himself headlong into danger for them anymore. He’s not going to risk losing his life, he’s not going to risk doing that to his dad. He’s finally got his priorities in order, and for once, that means he’s putting himself first.</p>\n<p>“Food!” Stiles chirps. “Pizza, wings, fries... there’s some Red Bull in the one bag, too, and cookies...”</p>\n<p>His dad’s eyebrows get even higher, which is surprising, because Stiles was pretty sure they were already at their maximum peak. “So this food,” his dad says slowly. “Is for...?”</p>\n<p>“Danny’s coming over,” Stiles says, setting the pizza and the wings down on the table with a grunt, then dumping his assorted bags beside them.</p>\n<p>“Danny,” his dad repeats, lowing his paper. “Not Lydia?”</p>\n<p>Stiles’ head snaps up, and he gives his dad the sharpest look in his repertoire. “Why on earth would you think that?” he demands.</p>\n<p>“Because this? Is giving me flashbacks to your Macy’s spree,” his dad replies. He’s grimacing, a little, and Stiles feels his cheeks flood red. Stiles coughs, clears his throat, and gets busy unpacking his bags instead of looking at his dad.</p>\n<p>“Nope, this is nothing like that,” Stiles says as he pulls out the salsa he’d grabbed - the good, fresh kind that tastes like cilantro and lime. “Not even close. Just two guys, hanging out, playing video games... totally, uh. Casual. And friendly. Very friendly! Not <i>too</i> friendly, I mean, just... we are <i>bros</i> now...”</p>\n<p>He can feel his dad still looking at him, and as a direct result, he can also feel his ears getting hotter by the second.</p>\n<p>“Couch burn, huh?” is what his dad finally says, and Stiles gapes at him, speechless. His dad doesn’t drop his gaze, and after a minute Stiles clears his throat again and ducks his head.</p>\n<p>“Very scratchy couch,” he says weakly, and his dad sighs.</p>\n<p>“You know you can always talk to me,” he says gently, folding his paper up and pushing himself to his feet. “About anything, all right?”</p>\n<p>Stiles gives a jerky nod, still determinedly unpacking his groceries, which now that he thinks about it, may have been slightly overkill. By just a little.</p>\n<p>“Good,” his dad says. “Then on that note, I am taking a piece of this pizza, and no, I am not picking any meat products off of it.”</p>\n<p>Stiles is pretty sure that qualifies as emotional blackmail, but he keeps his mouth shut as his dad opens the box and places two huge pieces onto a napkin, because he is a dirty opportunist who clearly does not care at all about the state of his general well-being.</p>\n<p>He gives Stiles a firm tap on the head with his paper though, as he walks past, the kind that manages to feel a lot like ‘I love you.’</p>\n<p>Once his dad’s out of the room, Stiles takes a moment to survey the results of his shopping. It suddenly seems like way, way too much, and Stiles puts that down to seeing it actually spread out over the table like this, instead of piled into a shopping cart. He’s not trying to woo Danny after all, God, what was he even thinking?</p>\n<p>It’s an easily fixed problem, at least, since he can just hide all of the extras away in the fridge and the cabinets. Danny won’t ever have to know the full extent of Stiles’ neuroses, which is absolutely for the best.</p>\n<p>He’s halfway through burying the wings under a bag of carrots (where his dad won’t think to look for them) when his phone buzzes in his pocket with its usual impeccable timing. Stiles has to twist around to get it, since his right hand it currently occupied keeping half of the fridge’s contents from falling out.</p>\n<p>“H’lo?” he says in a strained voice, once he’s got his phone pressed to his ear and is reasonably sure everything is going to stay right where it is, provided he doesn’t move.</p>\n<p>“Stiles, hey, it’s Danny,” Stiles hears, Danny’s voice tinny and full of static, like he’s got a bad connection. “I’m really sorry, I’m gonna be late.”</p>\n<p>“That’s cool, that’s fine,” Stiles says quickly, lunging forward with his elbow as a carton of cottage cheese makes a bid for escape. “Everything okay?”</p>\n<p>“Yeah,” Danny says, although he sounds annoyed. “Yeah, fine. Jackson needs me to pick something up for him from the middle of nowhere. And whatever you’re about to say,” he adds, and they must have a psychic connection thing going on, because Stiles is already opening his mouth to scold him, “trust me, I’ve already thought it. But he just... sounded like he needed someone.”</p>\n<p>“Yeah, fine, okay,” Stiles says. “I can put the pizza in the oven, but it’s gonna be your fault if it’s all dried out.”</p>\n<p>“You got me pizza?” Danny asks, sounding thrilled, and Stiles’ stomach flips over in a distracting sort of way.</p>\n<p>“And salsa,” Stiles says. “But I’m very hungry, so if you’re not here soon, I’m going to eat all of it. Every single delicious, salsa-y bite, Danny.”</p>\n<p>Danny laughs, warm and happy right in Stiles’ ear. “See you soon,” he promises, then hangs up.</p>\n<p>Stiles lets out a quiet sigh and slumps a little, managing to completely forget about all the food he’s keeping stable. It tumbles out of the fridge in a mini avalanche, and he groans, swatting at the bag of carrots. He hates carrots, he doesn’t even know why they have them.</p>\n<p>Trust Jackson to go and ruin a perfectly good night of hanging out. Not that it’s <i>ruined</i> - Danny is still going to come over, and Stiles is more grateful than he has words for that Danny didn’t ditch him completely in favor of his best friend. He could have, so the fact that he didn’t is a good thing, a good feeling. Still, it’s not making Stiles feel any fuzzier in regards to Jackson. Jackson, who’s been completely ignoring Danny all summer, no doubt too wrapped up in Lydia and his newfound werewolfhood and being Derek’s newest lapdog -</p>\n<p>That thought pulls Stiles up short. Jackson texting Danny out of the blue for a vague demand. Derek, who is the <i>Alpha</i>, and Jackson, who is all about currying favor with people in charge.</p>\n<p>The timing is grossly suspect, and Stiles taps a quick text into his phone: <b>where’s jackson sending you again?</b></p>\n<p><b>3605 parker ln</b> Danny sends back, and Stiles pulls it up on Google maps with a sinking feeling in the pit of his stomach.</p>\n<p>It’s an abandoned junkyard on the edge of town, and Stiles swears. He leaps to his feet and slams the refrigerator door shut, ignoring what sounds like more food being knocked from the shelves.</p>\n<p>“Dad, I’m running out real quick, be back soon!” he yells, then grabs his keys off the table and races for his car. He only has his instincts to go on, but he’s got that awful, sour feeling in his stomach, and a line of tension creeping up his spine.</p>\n<p>The second he’s got his jeep running, backing out of the driveway with a reckless swerve, he’s running through calculations in his head. If Danny called him just as he was leaving his house, then he’s got a good ten minute head start on Stiles, but Stiles has every confidence he’ll catch up. He’s more familiar than he’d like to be with shortcuts through the woods, and besides, he knows where every speed trap in town is.</p>\n<p>Sure enough, he pulls into the parking lot just as Danny’s getting out of his car. He kills the engine and lunges out of his jeep, and Danny’s already turned around, staring at him in bewilderment.</p>\n<p>“Stiles?” he asks, a frown appearing on his face. “What’re you doing here?”</p>\n<p>“We need to leave,” Stiles says urgently.</p>\n<p>“What?” Danny asks, and that frown isn’t going away. He’s looking at Stiles the way he used to, like Stiles is a huge weirdo who he can’t even begin to comprehend.</p>\n<p>“Danny, we have to leave <i>now</i>,” Stiles insists. “Look, I don’t know what Jackson told you, but whatever it was, I can guarantee you he isn’t looking out for you. You have to trust me on this. You <i>have</i> to, Danny, you - ”</p>\n<p>“Stiles, calm down,” Danny interrupts, and that’s when Stiles realizes he’s clutching at Danny’s jacket, and that he probably sounds a little unhinged.</p>\n<p>“Sorry,” he says hastily, dropping his panicked grip and shoving his hand into his pocket instead.</p>\n<p>“It’s okay,” Danny says, his voice gentle. “Listen, I know it probably seems like a strange request, but would you believe me if I told you it isn’t even close to the weirdest thing Jackson’s asked me to do? Seriously, this is hardly out of the ordinary.”</p>\n<p>Danny glances around, and Stiles follows his gaze, taking in the lot: mostly empty, but littered with the remains of what used to be a place where people could salvage car parts. There are a few stripped frames, some tires, and a gutted building that looks to be on the verge of falling down. It’s not quite dusk yet, but it’s close, and the long shadows give the whole place a decidedly sinister feel.</p>\n<p>“What exactly did Jackson ask you to do?” Stiles asks after a long beat.</p>\n<p>Danny shrugs, and Stiles can’t remember ever being this naive about situations that are clearly life-threatening. “He said I needed to pick something up for him,” he says. “That there’d be some people here? I swear, if this turns out to be steroids, I’m going to kick his ass.”</p>\n<p>Stiles can’t even manage a smile, his brain racing a mile a minute. He knows Derek needs information, that he wants a general idea of what he and his pack are going to be up against. An abandoned lot on the outskirts of Beacon Hills seems like a reasonable place for a group of temporarily nomadic Alphas to establish a home base, and if this is where the Alphas are, Jackson wouldn’t think twice about sending Danny here on a wild goose chase. The Alphas would know the instant someone set foot here. Stiles can see the scenario play out in his mind. They’ll come out to investigate, Danny will ask for a mysterious package, the Alphas will put it down to a miscommunicated drug deal and send Danny on his way. Then, when Danny gets back, Jackson can pick his brain about how many people he saw, what did they look like, where did they come from, gleaning whatever details they can from the information Danny offers.</p>\n<p>It’s the stupidest plan Stiles has maybe ever heard, and that includes those plans of his own that have turned out to be legendarily awful, but he’s equally sure he’s <i>right</i>.</p>\n<p>“Danny, let’s go,” he tries again. “Forget the steroids - the <i>last</i> thing Jackson needs is anything he would be getting from a shady as fuck transaction on the edge of town, okay? Let’s just - please. Please, can we get out of here?”</p>\n<p>Stiles is pleading, he can hear it in his voice, but he can’t bring himself to care because Danny’s expression is softening, and he’s reaching out to clasp Stiles’ shoulder.</p>\n<p>“You’re right,” Danny says, his fingers a warm, firm pressure, even through Stiles’ hoodie. “You’re totally right. Let’s go.”</p>\n<p>“Fantastic,” Stiles says, this hugely relieved smile breaking across his face. “You don’t even know - seriously, good choice, excellent life choice, I’m applauding you so much right now - ”</p>\n<p>He breaks off as he glances away from Danny, because there’s suddenly a person standing ten feet away from them. Stiles startles badly, because holy shit, he showed up out of <i>nowhere</i>, that same creepy move that Derek likes to pull. The person is a man, six and a half feet tall at least, and since he’s not wearing a shirt, Stiles can easily see that his muscles practically have muscles of their own.</p>\n<p>“Danny,” Stiles whispers, and he knows Danny’s seen the guy, too, because Danny has gone very, very still. “Danny, when I say go, run for my Jeep, okay?”</p>\n<p>“Leaving so soon?” a voice breaks in, and Stiles and Danny both whirl around, only to find that a woman has snuck up behind them. She’s tall, but slim is the wrong word to use on her; Stiles would go with lean, because even from here, he can see that she’s all muscle. Her brown hair looks thick and coarse and is streaked with gray, and her skin is weathered, adding probably an additional five years to her actual age.</p>\n<p>“Yes, leaving, we were just on our way out,” Stiles says quickly. “Took a wrong turn, had to stop to regroup, but we are now good to go, so... you folks have a good night, and we’ll just - ”</p>\n<p>“You’re not going anywhere,” the woman says, and Stiles has no idea how she manages to make a fairly mild tone sound so deadly. Stiles gropes for Danny’s arm, latching onto it tightly, and he’s just about to make a break for his jeep when the woman smiles at them.</p>\n<p>She already has her canines out, and Danny’s sharp inhale turns into an outright gasp when her eyes flash red.</p>\n<p>“You’re not going anywhere,” she repeats, and Stiles whimpers. He is going to kill Jackson and Derek for this.</p>\n<p>Provided, of course, that he and Danny make it out alive.</p>\n<p>The night’s another cool one, the air crisp and the wind biting, but Danny is a steady warmth at Stiles’ side.</p>\n<p>“Stiles?” he whispers, because that’s right, he doesn’t know what these people are, has no idea that they’ll be able to hear every word he breathes. “Stiles, what’s - ”</p>\n<p>“Look,” Stiles announces, taking a protective step in front of Danny, wanting to keep him shielded from the very serious threat in front of them. “He doesn’t know anything, okay? He doesn’t have anything to do with this, he doesn’t even know what you <i>are</i>...”</p>\n<p>“Oh, I think that cat’s out of the bag, don’t you, Stiles?” the woman smirks, and Stiles heart sinks, because of course she was paying attention, and now she knows exactly who he is. It isn’t like there are any other kids named Stiles in Beacon Hills. Her eyes go back to red, and this time they stay red; Stiles feels Danny shrink in on himself a bit at the sight.</p>\n<p>“What I’d like to know,” she says as she stalks toward them, every inch a predator, “is why you’re here. Why the two of you are trespassing.”</p>\n<p>“We’re not trespassing,” Stiles says, because apparently he is missing that thing also known as a sense of self-preservation. “This isn’t your territory.”</p>\n<p>“We’re holding it,” the male alpha says, his smile full of terrifying, glinty white teeth. his voice is low and dark, rough, like maybe his throat has been damaged from years of constant growling, even though Stiles knows well enough that werewolves can heal from anything. Or almost anything, at least. He’s keeping his distance, almost observing, which makes Stiles think he might only be there as extra muscle, just in case anything goes wrong. “That makes it ours.”</p>\n<p>“So I’m going to ask one more time,” the female says, crossing those last few feet until she’s right in front of Stiles, deliberately invading his personal bubble. She flicks out a hand to reveal her claws, and Stiles feels more than hears Danny’s moan. He knows she’s felt it, too, when she smiles and lifts the tip of one claw to Stiles’ throat. “Why,” she says, bringing her mouth to Stiles’ ear, “are you here?”</p>\n<p>“Steroids,” Danny bursts out, before Stiles can even scramble for something he could pass off as a lie. “I - I swear to God, my friend wanted me to come pick up a package for him - I am ninety-nine percent sure it was for drugs. Of the performance-enhancing kind.”</p>\n<p>Stiles can tell that the answer catches her off guard, because she almost looks amused as she flicks her gaze over to Danny, lingering on him for just a moment before her eyes slide back over to Stiles.</p>\n<p>“He’s not lying,” she says silkily, “but then again, I hear he doesn’t know anything about all this. I’m sure he believes what he’s saying, but that doesn’t make it the truth. So why don’t <i>you</i> tell me what’s going on, Stiles.”</p>\n<p>“I don’t know,” Stiles says, swallowing shallowly in an attempt to keep his skin from being pierced by that ultra-sharp-looking claw. “I swear, I found out Danny was coming here, and I had a bad feeling about it, so I went after him.”</p>\n<p>She moves fast, so fast that Stiles can’t even mount a struggle as she grabs him by the collar and throws him down to the ground, banging his head sharply against the ground and then holding him there with one pointy-tipped hand pressed to the back of his neck. Stiles aims to stay silent, but he knows his ragged breathing gives away his mounting sense of panic.</p>\n<p>“One more time, Stiles,” she says, placing a knee none-too-gently in the middle of his back for good measure. “Why the hell is Hale sending human members of his pack to spy on us?”</p>\n<p>“I’m not pack,” Stiles spits out, ignoring the gritty burn against the side of his face as he tries to turn his head enough to look at her. “I’m not pack, and neither is Danny, and neither of us are <i>lying</i>. You’d know it, if we were.”</p>\n<p>“Oh, you’re pack,” she murmurs, pressing her knee harder into Stiles’ back, until he has to resort to a choked gasp for more air. “You don’t think we weren’t observing Derek and his puppies long before we alerted him to our presence? You’ve been keeping your distance lately, but you were right in the thick of things before, and the bonds of a pack run deeper than a teenager’s temper tantrum.”</p>\n<p>“<i>Temper</i> tantrum,” Stiles croaks. His face is starting to go red, he can feel it, and the pressure on his back isn’t letting up, not for a second. “No, I’m done, I’m out, there isn’t anything binding me to them anymore.”</p>\n<p>She leans in close, her nose pressed to Stiles’ hairline, and takes a deep breath. “You smell like Hale,” she say, her voice like a purr. “I’m an Alpha, Stiles, you can’t hide anything from me. You saw him recently, and I want to know what, precisely, you discussed.”</p>\n<p>“Go to hell,” Stiles spits out, and he hears an outraged snarl the instant before she’s hauling him over onto his back and letting her fist fly at his face. It connects with his left cheekbone, the same place Gerard had focused his attack, and Stiles panics, flailing wildly in a desperate scramble to get away. She’s so much stronger than he is though, stronger by far than Gerard, and she’s not letting up, not for an instant.</p>\n<p>“Stop,” Stiles gasps, clutching at her arm, but she shakes him off with ease and hits him again. “St-stop, wait, <i>please</i> - ”</p>\n<p>To Stiles’ everlasting surprise, it’s the last punch she throws, and she pulls abruptly away from him with another snarl. She whirls around, and Stiles dizzily props himself up on his elbows to see why.</p>\n<p>Danny’s standing a few feet behind her, pale and terrified, with a massive, bloodied rock in his hand. Now that he’s looking at the back of her head, Stiles can see a similarly bloody gash near her temple.</p>\n<p>“Don’t,” Stiles says, and in the instant before she lunges, teeth bared, he grabs for her arm. “I swear to God, we don’t know anything,” he pleads. “And even if we <i>were</i> spying - you got the drop on us. You win. Just let us go. You - you don’t want the blood of two sixteen-year-olds on your hands, do you? Are you really gonna be that kind of a monster?”</p>\n<p>She’s looking at him now, her eyes red and her expression wolfed out - moreso than Derek’s ever gets, which Stiles has a feeling means she’s been an Alpha that much longer.</p>\n<p>“Please,” Stiles repeats, his voice dropping down to a hoarse whisper.</p>\n<p>After a long, long moment, her face morphs back to a human one, although her eyes stay that glittering, dangerous shade of red. “Take a message back to Hale for me,” she says, and Stiles nods woozily. His face is throbbing, and his vision is starting to swim a little.</p>\n<p>“Sure,” he says. “What’s the message?”</p>\n<p>She takes his left wrist in her hands, then snaps it, a brutal, efficient movement, and Stiles screams at the sudden pain. She watches him with an emotionless expression, and as soon as his scream dies away, she says, “Tell him that if he tries a stunt like this again, he won’t be getting his pet human back broken - he’ll be getting you back in pieces.”</p>\n<p>Stiles gulps back a sob, but it breaks free from his throat anyway. He curls in on himself protectively as she stands up, and he watches as she crosses to her fellow Alpha, who at some point had shifted behind Danny - probably about the time Danny whacked her with that rock - clearly ready to attack if he saw a need. They don’t look back, they just melt into the surrounding forest together, and that’s when Danny finally stumbles forward to Stiles’ side.</p>\n<p>“Your wrist is broken,” he says, panic in his voice. “You - and your <i>face</i> - holy shit, Stiles, what was that? What - her <i>face</i> - and their eyes - Stiles, what’s going <i>on</i>?”</p>\n<p>The pain is so sharp in his wrist that Stiles is feeling dangerously close to puking all over Danny, but he forces himself to sit up, his left hand tucked against his chest, while his right clutches weakly at Danny’s arm. Danny seems to take the hint and wraps an arm around Stiles’ waist, practically pulling him to his feet.</p>\n<p>“M’sorry,” Stiles slurs, slumping against Danny’s shoulder. “S’werewolves. You can’t think I’m crazy, okay, you <i>saw</i> them, and I - I’ll explain everything, but - in th’car, please, let’s get out of here.”</p>\n<p>“Yeah,” Danny agrees, his voice shaking. “Yeah, you need a - a hospital, and we should - okay, yeah.”</p>\n<p>“No hospital,” Stiles argues as they start back toward Danny’s car. God, he really doesn’t want to leave his jeep here, but it’s not like he can drive it with a broken hand, and it makes more sense for them to take Danny’s car, he guesses. “It’s fine, I’m okay, we should - we need to go to Derek’s first. Do you know where that is? The old Hale house?”</p>\n<p>“Yeah,” Danny says, but he sounds uncertain, wary. “But Stiles... isn’t that, um, dangerous? I mean, if - if Derek’s one of - one of <i>those</i> - ”</p>\n<p>“An Alpha,” Stiles says, as Danny holds the door open for him and he slides into the passenger seat. He waits while Danny goes around to the driver’s side door, but as soon as he’s in, Stiles continues. “He’s an Alpha. And he’s a terrible one, he’s a complete dumbass, but he isn’t dangerous. Not - not to you or me.”</p>\n<p>“How do you know that?” Danny asks. He turns the key and his engine rumbles to life, and almost immediately he’s whipping out of the lot, driving faster than is probably safe on these twisty back roads. “How do you know we’ll be safe?”</p>\n<p>Stiles takes a deep, steadying breath and tries his best to push his body’s many aches and pains out of his thoughts. “Scott’s a werewolf,” he says. “So is Jackson. And Erica, Isaac, Boyd... they’re all in Derek’s pack. I mean, Scott isn’t right now - he sometimes is, I don’t know, it’s a frigging soap opera, I swear.”</p>\n<p>“Jackson,” Danny repeats, stealing a look at Stiles. His face is still terrifically pale, like none of the color has bled back into it yet. “Jackson’s a werewolf.”</p>\n<p>“Yup,” Stiles says. “He used to be a were-lizard, but then he got better. I mean, relatively, I guess. And before you ask, he completely brought it on himself. <i>He</i> went after it, he begged for the bite, so it’s his own damn fault he’s caught up in all this. And I’m assuming it’s his fault that you’re involved now, and I am so <i>sorry</i> you’re involved, Danny, God.”</p>\n<p>“Are you saying me going home and just... forgetting about everything that happened tonight... that’s off the table?” Danny asks weakly, and it almost sounds like on some other day, in some other instance, it could be a joke, but in this particular moment, it falls flat.</p>\n<p>“I’m sorry,” Stiles repeats, wincing as he shifts and jostles his wrist. “But I don’t think - it’s complicated, and I don’t know if they’ll leave you alone, I can’t guarantee that. We just... we need to talk to Derek, okay?”</p>\n<p>“Okay,” Danny says, and the trust that’s there in his voice is enough to make Stiles feel sick again. Stiles can’t even protect himself; he can’t be watching out for Danny, too.</p>\n<p>They drive in silence for another few minutes, but it’ll take them at least another fifteen to get to Derek’s place, which is across town. Stiles swallows against the nausea he can feel building in his throat, a combination of physical pain and receding adrenaline.</p>\n<p>“You think you could start at the beginning, maybe?” Danny finally asks, breaking the silence. His eyes are on the road, his hands curled perfectly at ten and two on the steering wheel, but there’s nothing at all relaxed about him. “Fill me in on the details?”</p>\n<p>“Yeah,” Stiles says. “Yeah, I can do that.”</p>\n<p>It’ll be a good way to pass the time and fill the silence, and Stiles has been aching for so long to tell someone. Even if he hates himself a little for putting this weight on Danny, of all people, it’s a relief, too, to finally share it with someone outside the pack. So he starts with that night in the woods, when he and Scott so stupidly went looking for a dead body, and takes Danny all the way through the end of the school year. It spills out in a steady stream, and it feels like Stiles doesn’t take an actual breath until he’s told Danny everything.</p>\n<p>Danny’s silent, but he finally lets out a slow breath. “I’m going to kill Jackson,” is the first thing he mutters, and Stiles huffs a quiet laugh.</p>\n<p>“Not if I don’t kill him first,” he says.</p>\n<p>“Nah, I’m his best friend, I get dibs,” Danny insists.</p>\n<p>Stiles manages a small, tight smile. “We’ll see,” he says, as Danny makes the turn onto Derek’s property. He’s outwardly pretty composed, but inside he’s a jumble of fear and anger, and he’s not quite sure what he’s going to do once he gets inside.</p>\n<p>He and Danny walk up the path to Derek’s front door, shoulder-to-shoulder. It’s been weeks since Stiles was here, and he’s surprised to find that it looks kind of habitable. Granted, minimally habitable, since odds are one good gust of wind could still send it tumbling down, but the porch has been swept free of debris, and there are a few lights shining through the windows, which look marginally cleaner than the last time Stiles saw them.</p>\n<p>“Should we knock?” Danny asks, but Stiles just shakes his head.</p>\n<p>“No need,” he says; he’s proven right an instant later, when the front door flies open and Derek comes out, glare already in place.</p>\n<p>“Stiles,” he demands, “what’re you...”</p>\n<p>He trails off once he catches sight of Stiles’ face. “What the hell happened,” he says, not really letting it be a question. He clatters down the front steps, but Danny steps between them before he can get too close.</p>\n<p>“His wrist is broken,” Danny says, and Stiles can’t help the rush of warmth he feels, how nice it is to have someone stick up for him for once, even if Danny is shaking a little. He knows he’s standing up to an Alpha right now though, so Stiles doesn’t blame him for a second.</p>\n<p>“What happened,” Derek demands again, and the pleasant warmth Stiles was feeling a minute ago gets replaced with that anger that’s been keeping him company all summer long.</p>\n<p>“What happened?” he echoes, stepping around Danny and glaring up at Derek. “You tell me, Derek. Whose bright idea was it to send Danny into a freaking <i>Alpha</i> den without even telling him what he was getting into?”</p>\n<p>Derek looks so completely stunned, that Stiles knows he has his answer right there. “Jackson,” he mutters to himself, and he storms past Derek, straight into the living room.</p>\n<p>There’s a threadbare couch and a patched chair that wasn’t there before, but nobody’s sitting in them; instead, Scott and Isaac are on their feet, lurking just a few feet away from the door, while Jackson is hovering in front of the couch.</p>\n<p>“What’s Danny doing here?” Jackson demands, at the same time Scott says, “Stiles? What <i>happened</i> - ”</p>\n<p>“What the hell is wrong with you,” Stiles says, his voice coming out cold and furious as he glares Jackson down. “I know you’re not the brightest crayon in the box, but this was stupid even for you, Jackson.”</p>\n<p>Jackson bristles, because even when he’s so blatantly wrong, he’s never taken well to being spoken to like that - especially not from Stiles, of all people.</p>\n<p>“If you’re talking about sending Danny to the lot - ”</p>\n<p>“That’s <i>exactly</i> what I’m talking about,” Stiles snapped. “You sent him in <i>blind</i>, they could have torn him apart if they’d felt like it.”</p>\n<p>“They’re not monsters, they wouldn’t have harmed an innocent human,” Jackson snarls, but Stiles only makes the most disparaging noise he can possibly muster.</p>\n<p>“You’re a fucking <i>moron</i>,” he says, to which Jackson growls and starts toward him. Before he gets more than three steps, there’s a terrifying roar from behind Stiles’ left shoulder that sends Jackson to his knees, leaves him cowering.</p>\n<p>Stiles turns around to find Derek halfway to wolfed out, canines bared and eyes red as he glares Jackson into submission.</p>\n<p>“I didn’t authorize anything like this,” Derek growls, his gaze fixed to Jackson.</p>\n<p>“Yeah?” Stiles challenges, lifting his chin defiantly at Derek. “I don’t know if I believe that, actually, considering your most recent plan was to send your <i>pet human</i> to do your spying for you.” He practically spits the words out, and Derek actually winces. It just makes Stiles think that his face must really look terrible, because it’s a rare thing for Derek to even admit he’s wrong, let alone look guilty about it.</p>\n<p>“Derek - <i>Danny</i>,” Jackson says, something placating and pleading in his tone. “I thought it was foolproof. Danny and I haven’t hung out - not since I became a werewolf - ”</p>\n<p>“Yeah, about that,” Danny mutters.</p>\n<p>“ - and their problems are with <i>us</i>, not some human who wandered onto their territory by accident! They had no reason to hurt him!”</p>\n<p>“Except that they’ve been watching you,” Stiles says coldly. “Everything you do, they <i>know</i> you. I think they probably took the time to sniff out your one and only friend, Jackson.” Jackson’s eyes flash that crisp, beautiful blue, the color that Derek’s eyes used to be, but Stiles holds his ground, looking down at Jackson from his moral high ground.</p>\n<p>“Stiles told me everything,” Danny interjects. “I’m not going to tell anyone, I swear, but I don’t want any part of this. I have a little brother and a little sister - I’m not doing anything that runs the risk of hurting them.”</p>\n<p>Derek’s expression is <i>awful</i> upon hearing that - some terrible mix of grief and guilt and rage, and Stiles has to swallow and look away. He forgets, sometimes, the mountain of shitty things Derek has been buried underneath. It doesn’t excuse the stupid things that Derek sometimes does, but it sure as hell evokes some serious sympathy, and Stiles isn’t in the mood to be sympathetic right now. Even if it is Jackson’s fault, a part of Stiles still wants to lay the blame directly at Derek’s feet, whether that’s fair of him or not.</p>\n<p>It’s quiet, following Danny’s words, until a very soft, “Stiles,” from Scott breaks the silence. When Stiles looks up, Scott is approaching him slowly, his hands practically held out in an ‘I come in peace,’ gesture. “I’m going to call my mom,” he says gently. “She can look at your wrist, decide if you really need to go to the hospital or not.”</p>\n<p>Stiles gives a jerky nod, ignoring the way his face gives another throb of protest at the action. “Sure,” he says. “Thanks.”</p>\n<p>Scott disappears into the kitchen to make the call, and Stiles’ eyes find Danny once again. “You should go,” he says quietly. “You should - Jackson should drive you. You can make him grovel all the way back to your house.” It’s a sign of just how fucking in the wrong Jackson is that he doesn’t even growl or protest.</p>\n<p>“You going to be okay?” Danny asks. He crosses over to Stiles, his face creased with concern, and brings his hand up to Stiles’ injured cheek, brushing his fingers so lightly across the bruise there. Stiles hears a swallowed noise from someone in the room, but he can’t bring himself to care, since Danny’s <i>right there</i> and touching him oh-so-carefully.</p>\n<p>“I’m fine,” Stiles whispers back, although his voice breaks unconvincingly over the word.</p>\n<p>Danny doesn’t call him on it though, just wraps his arm gently around Stiles’ shoulders and draws him in for a hug. “You were a complete badass,” he murmurs, lips brushing right against Stiles’ ear, and oh, this isn’t fair, it is not fair that this is happening in a room full of werewolves. “Thanks, Stiles.”</p>\n<p>“Um, any time,” Stiles says as Danny pulls away. He’s itching to reach up and run his own fingers over his ear, all the places Danny touched him, but he resists the impulse and instead gives a little wave as Jackson steps forward. Danny’s expression narrows, going cold and distant, the way he sometimes looks when he’s playing goal and the other team’s fouling like crazy; it’s what Stiles has dubbed his ‘I am about to send you home crying to your mother’ look, and he’s never once seen it turned on Jackson.</p>\n<p>Stiles has a feeling Jackson is in for a deeply uncomfortable car ride.</p>\n<p>Once they’ve left, Stiles takes a deep breath and makes for the couch. Scott isn’t back from his phone call yet, and Isaac has disappeared somewhere in all the drama, leaving just Derek, who’s still doing his usual glowering thing from the corner.</p>\n<p>“We need to talk,” Derek says, crossing the room to stand in front of Stiles. Stiles goes tense, and he feels his heart start to beat faster, just from Derek’s proximity.</p>\n<p>“Yeah,” Stiles says, and his voice is positively bitter. “I expect you want a report, right? Whatever details I picked up while trying not to die.”</p>\n<p>“Stiles - ”</p>\n<p>“You don’t <i>get</i> it, do you?” Stiles explodes, his breath hitching in a familiar and terrifying way. “You’ve <i>always</i> had your stupid werewolfian genetics to fall back on, you have no idea what it’s like to be human, to know that you’re one stray bullet away from death.” His breathing’s gone shallow and fast, mimicking the tempo of his heart, and Stiles is starting to feel lightheaded with it. It’s not new, he knows it’s the start of a panic attack, one of the kind that hit him out of nowhere and without warning, but he can’t quite pull it back, he can’t get it under control.</p>\n<p>“Do you have any idea what that would do to my dad?” he asks. “It’d <i>kill</i> him, Derek. He’s already lost my mom, he can’t lose me, I can’t <i>do</i> that to him. I can’t,” and he cuts himself off with a shaky gasp. It’s all downhill from there, and it’s like he’s right back in those days after his mom’s death, when it felt like he could never catch his breath, when his chest was always tight and constricted, too weighted down to get a proper lungful of air.</p>\n<p>He hates that Derek’s there, that Derek’s watching him crumble like this, but Stiles can’t do anything to stop it. It’s like a trainwreck in slow motion, and his wrist hurts, and his face hurts, and he can’t <i>breathe</i>.</p>\n<p>“Stiles,” he hears Derek murmur, and the next thing Stiles knows, Derek’s kneeling down in front of him, his hands settling on the couch on either side of Stiles’ legs. “Stiles, breathe with me, can you do that?”</p>\n<p>For more than a few minutes, Stiles can’t. He can’t get it together enough to follow the pattern Derek’s giving him, he’s too lost in the crush of his own panic. What it finally takes is Derek settling against the arm of the couch and gently tugging Stiles between the vee of his legs, which leaves Stiles’ back pressed to Derek’s chest.</p>\n<p>“Breathe with me,” Derek repeats, and this time Stiles can <i>feel</i> the pattern Derek is offering, the slow and steady inhale, the two beats of holding his breath, then an equally lingering exhale. Stiles is shaking by the time he’s got a handle on it, and he feels utterly wrung out, but at least he <i>can</i> breathe again.</p>\n<p>To his surprise, Derek doesn’t move away; instead he reaches for Stiles’ wrist, carefully curling his fingers around the area that hurts most. Stiles’ instinct is to jerk away, but after a second he’s glad he didn’t, because through some ridiculous form of werewolf voodoo, the sharp ache that’s been lingering ever since the female Alpha took a dislike to his bones remaining in one piece dissipates.</p>\n<p>“Thanks,” Stiles murmurs, and he reaches up with his other, uninjured hand to wipe at the tacky sweat that’s drying along his forehead. He shifts, preparing to move away from Derek, but Derek’s arm slides up to his chest, tightening there to keep him in place.</p>\n<p>“I’m sorry,” he says, and it’s unexpected enough to freeze Stiles right where he is. He feels Derek sigh, the tickle of an exhale against his ear, and then the rise of Derek’s chest as he inhales. “I never meant for Danny to get involved, or for you to get hurt. The only reason I asked in the first place... we’re desperate, Stiles. This is our territory, but they’ve already got us on the defensive. I didn’t ask you to get us information because you’re dispensable. I asked because you’re smart. Because you’ve saved us - saved <i>me</i> - more than once. Because I never for a second thought they would hurt a human.”</p>\n<p>He moves his hand from Stiles’ wrist to the bruise on his face, and the pain leeches away from there, too. He’s not healed; his cheek still feels stiff when he turns his head, and his wrist isn’t bent in the right direction, but the pain’s muted, for now.</p>\n<p>“You’re pack,” Derek says, and before Stiles can protest, he barrels on. “And that doesn’t mean I get to demand you to put your life on the line, and it doesn’t mean you <i>owe</i> us anything. It does mean that it’s my job to protect you. And this?” he says, his thumb stroking along Stiles’ cheek once more, before falling away, “is never going to happen again.”</p>\n<p>Stiles’ heart is jackrabbiting again. Not like it was while he was having the panic attack; more like the way it’s been racing whenever he gets too close to Danny lately. Or the way it had felt determined to beat its way out of his chest when Lawrence had been pressing him up against that dark corner, lights and music and warm bodies all around them.</p>\n<p>It isn’t anything Stiles wants to examine too closely, not when <i>Derek</i> is the cause, and so he swallows hard and carefully extricates himself from Derek’s hold. This time, Derek lets him go.</p>\n<p>“You’re okay?” Derek asks quietly, his eyes their usual burst of color - hazel, Stiles guesses, with not a trace of red to be found.</p>\n<p>“Yeah,” Stiles says hoarsely. “Yeah, I’m okay.”</p>\n<p>And for the first time in the weeks since Gerard took him, since he had to watch Matt strike his father, since all of this supernatural craziness has invaded his life, he’s surprised to find that he’s not lying. He’s not fine, maybe, not yet, he isn’t good or great, but he’s okay. He’s all right.</p>\n<p>“I’m... I’m gonna go find Scott,” Stiles says. “I - I think we could probably use a talk, too.”</p>\n<p>Derek just nods, which makes sense, since he’s probably used up his daily word allowance on the things he told Stiles, but Stiles doesn’t feel any anger at it. It’s just Derek, and for once, he’s said the things that needed to be said. That Stiles needed to hear.</p>\n<p>“Thanks,” Stiles adds, and before the moment can turn too sappy, he gets to his feet and heads for the kitchen, where he knows he’ll find Scott.</p>\n<p></p>\n<p>~*~*~*~</p>\n<p>“You okay?” Scott asks warily, and he sets his phone to the side, eyes on Stiles.</p>\n<p>“Yeah,” Stiles says, taking the seat across from him.</p>\n<p>“My Mom said she’d be here in fifteen,” Scott adds, his gaze dropping to Stiles’ wrist. “She might still want to take you to the hospital though, she didn’t sound too pumped about the idea of having to set a broken bone.”</p>\n<p>“That’s fine,” Stiles says, and he sounds exhausted to his own ears at just the thought of spending the evening in a hospital, letting some doctor poke and prod at him. His dad’s going to be thrilled to get that call, he’s sure, and Stiles is going to have to think up another lie to explain it to him, not to mention...</p>\n<p>“Oh crap,” Stiles groans, rubbing at his temple. “My jeep. My <i>jeep</i>.”</p>\n<p>“What?” Scott demands. “What about your jeep - what happened?”</p>\n<p>“It’s still at that stupid lot,” Stiles mutters. “And I swear to God, if those fuckers lay a single <i>claw</i> on it...”</p>\n<p>“We’ll get it,” Scott says earnestly, even though this is one of those times where, if things were normal, he’d maybe be teasing Stiles about his possibly unhealthy attachment to his piece of crap car. All good-natured though, because Scott knows the history behind it, knows about the jeep Stiles’ mom used to have, how this one isn’t an exact match, but it’s damn close. How Stiles had come across it two weeks before he’d turned fifteen, and even though he couldn’t drive yet, had begged his dad to get it. Had practically had a power point presentation ready to go, except Mr. Stilinski hadn’t really needed the convincing; his eyes had just gone soft, and for the next year and a half, the jeep sat in their driveway, where Stiles washed it every two weeks like clockwork.</p>\n<p>It makes Stiles’ chest go tight again, just thinking about what those Alphas could do to his baby, and that’s when Scott gets to his feet and moves close enough to give Stiles’ shoulder a firm squeeze.</p>\n<p>“We’ll get it,” he says firmly. “<i>I’ll</i> get it. I - consider it my apology. Or like, part one of my apology.”</p>\n<p>Stiles gives him a decidedly sideways glance, a slight frown on his face. “Do you even know what you’re apologizing for?” he asks, because he wants things to get back to normal, he wants his best friend back, but he has no interest in making it easy for Scott.</p>\n<p>“For not upholding my end of the best friend bargain,” Scott says slowly, like he’s taking his time in choosing his words. “You’ve been going above and beyond ever since I got the bite, and I... I’ve been slacking, dude. And that sucks.”</p>\n<p>“It’s not like I don’t get that you have a lot on your plate,” Stiles says, because he feels like he needs to make that clear, maybe. He doesn’t want to be the overly needy, clingy best friend, after all. “I mean, there’s the werewolf thing, the being in love with the daughter of a hunter thing, the failing all your classes thing - ”</p>\n<p>“I’m not failing <i>all</i> my classes,” Scott interrupts, but he’s smiling. It feels good, seeing that smile, knowing that Stiles is the one who put it there.</p>\n<p>“Ninety percent of your classes,” Stiles amends. He takes a deep breath, trying to line up in his head all the reasons he’s been so angry. He’s been too run by his emotions lately, he hasn’t been thinking, just <i>feeling</i>, so it takes him a moment to figure out what to say next.</p>\n<p>“I just need you not to forget about me,” he finally murmurs, not quite looking at Scott, because this is veering way too close to “heart-to-heart” territory, and that is not how Stilinski men do things. Ever. “Just - if I get kidnapped, it’d be nice to feel like I was actually on your radar. I mean, I guess we’re all now aware of what a huge freaking liability I am - ”</p>\n<p>“You’re not a liability,” Scott breaks in again, but his smile’s gone now, replaced with a frown. “Are you kidding me, Stiles?”</p>\n<p>Stiles is on the verge of making a sarcastic comment, but the thought dies at the look on Scott’s face. “Uh, no?” he says after a beat. “I got kidnapped and beaten up by a guy, like, five times my age, who doesn’t even <i>have</i> any supernatural powers. And then the way you and Isaac and everyone cut me out afterward...”</p>\n<p>“I thought that’s what you wanted,” Scott says, his frown deepening. “You got all distant, and my mom said you probably needed to not feel like you were in mortal danger for awhile.”</p>\n<p>Stiles just stares at him, his tongue pressing against the inside of his cheek, then says in a low, rough voice, “I figured you just thought I was useless now.”</p>\n<p>Before he even realizes what’s going on, Scott’s yanking him into a hug - still mindful, luckily, of his broken wrist. It happens quickly enough that Stiles doesn’t even have time to flail before he’s trapped against Scott’s chest.</p>\n<p>“You’re not useless,” Scott says fiercely. “You’re, like, the <i>opposite</i> of useless, Stiles. Wasn’t Derek just begging you for help a couple days ago? It’s because he knows we’re better with you than without you. And, dude, I sometimes think about all the people I could’ve hurt, if you hadn’t stuck by me the first few times I transformed, and...” He trails off, and his arms go tighter around Stiles, leaving Stiles with no real choice but to let himself relax into it.</p>\n<p>“I need you,” Scott says, voice gritty and hoarse and all the more real for it. “And I miss having my best friend around.”</p>\n<p>“You have Isaac now,” Stiles says, voice muffled against Scott’s shoulder. As soon as the words have left his mouth, he winces, because God, how obvious is <i>that</i>? He’s basically got ‘pathetically jealous’ stamped all over him.</p>\n<p>“Isaac’s a good dude,” Scott says, finally pulling away, but his hands slide up to Stiles’ shoulders instead, keeping him close, forcing Stiles to look at him. “He’s fun, and he’s been wearing way less leather lately, thank God, but he’s got nothing on you, Stiles. He never wants to stay up all night watching sci-fi movies and eating Doritos, for one. And he’s totally scared of my mom.”</p>\n<p>“I’m scared of your mom,” says Stiles, and somehow there’s a crooked smile that’s made its way onto his face. His shoulders feel just a fraction lighter, too, not quite so bowed down anymore. “<i>You’re</i> scared of her!”</p>\n<p>“Well, yeah,” Scott says, “but you still crashed your jeep into her car when I needed you to, you know? I mean, you know that dumb saying, right? About how your best friend won’t be able to bail you out of jail, because they’ll be sitting right there with you? That’s you, dude. That’s us.” He gives Stiles a little shake, but his expression isn’t silly or lighthearted; he’s serious, more intent than Stiles has maybe ever seen him. “I mean, you’re probably going to be the reason we’re in jail in the first place, but I made my peace with that a long time ago. You’ve got my back, Stiles, and I’ve got yours. Always.”</p>\n<p>It’s what Stiles remembers Scott saying about Isaac a few weeks ago, and it’s easy enough to remember how his anger had flared up inside of him, quick and brutally hot. Now though, it’s just the memory; in this moment, he’s not feeling any of it, not even a flicker.</p>\n<p>“Thanks,” Stiles finally says, that last bit of tension unwinding from his shoulders.</p>\n<p>“And I’m gonna be better about having your back,” Scott says, and he goes in for another hug, because apparently this is that kind of conversation.. “I just forget sometimes, you know? To worry about you. You’re really good at taking care of yourself and saving all our asses - sometimes I forget that you don’t have super powers.”</p>\n<p>“So what you’re saying is, I’m actually Batman,” Stiles says, not quite lighthearted, but getting there. “You’re Superman, and I’m Batman, and nobody’s Robin.”</p>\n<p>“Nobody’s Robin,” Scott agrees. Stiles can feel him smiling, and when they finally pull apart, there’s still a beaming grin on Scott’s face. Seeing it there makes Stiles feel like things are okay again, which makes him that much more reluctant to bring up something that might make it disappear.</p>\n<p>“About the Alpha Pack,” Stiles says slowly. “I mean, I understand why you weren’t telling me anything about them now - ”</p>\n<p>“It’s your choice,” Scott says. “If you want to opt out, that’s fine, Stiles. No one’s going to think less of you.”</p>\n<p>“Jackson will,” Stiles says. “And probably Boyd and Erica. Isaac, maybe, Lydia...”</p>\n<p>“No one,” Scott cuts in. “I’ll fight them. For your honor.”</p>\n<p>“Okay, see, I’m not actually a damsel in distress,” Stiles says, “so - ”</p>\n<p>“I’m kidding, dude. And besides, we <i>get</i> it.” Scott looks at him steadily, his eyes dark and serious. “Allison’s been training to fight off scary monsters since she could walk, and I still freak out about her having to go up against something nasty. And Jackson - I think he’s on the verge of forbidding Lydia to come to any more pack meetings.”</p>\n<p>Stiles snorts. “Right, good luck with that, Whittemore. Lydia Martin is a goddess among women and cannot be tamed.” It stings, a little, the mention of Jackson and Lydia, but not nearly as much as he expects. Maybe not even as much as it should, and he can tell that Scott picks up on it, because he’s back to frowning curiously at Stiles again.</p>\n<p>“You didn’t get all sad,” he says, taking an obvious sniff; Derek clearly still hasn’t been able to train any subtlety into him. Scott should be required to temporarily join the pack for that alone. “When I mentioned Lydia just now - you didn’t get sad.”</p>\n<p>It will forever be unfair that Scott can smell emotions or whatever, and Stiles shuffles awkwardly, shifting his weight from one foot to the other. “Yeah,” he says, purposely drawing the word out. “About that...”</p>\n<p>Scott stares at him, and then his eyes widen in surprise. “You still smell like Armani,” he says, almost accusingly. “<i>Danny</i>?”</p>\n<p>“Not specifically,” Stiles says hurriedly. “At least. Um. Not yet. But I’m, uh... exploring. Some new options. By which I mean I may have made out with a guy at a club the other night. And, uh, liked it.”</p>\n<p>Stiles is pretty sure Scott will be okay with it; he’s never had any problems with Danny, after all, but even when Stiles would make a joke about being attractive to gay men, or wanting to make out with Scott, he knows Scott never once took him seriously. Which means Scott has probably never even entertained the possibility of Stiles being bisexual, and Stiles doesn’t quite know what to expect in a reaction.</p>\n<p>It still comes as a bit of a shock when Scott yanks him right back into a hug, which means they’re up to a truly ridiculous number of hugs for a single conversation, and Stiles is definitely going to protest the next one.</p>\n<p>“I love you anyway, dude, and I am totally cool with you wanting to date other dudes,” Scott announces, and Stiles bursts out laughing because it sounds like something Scott may have read off the back of a pamphlet. It’s sincere though, Scott <i>means</i> it, and when he starts to pull away from Scott - probably wondering why Stiles is laughing at him - Stiles just tightens his own arms, taking care to keep his wrist well out of it, and keeps Scott trapped in the hug for a while longer.</p>\n<p>“Also, Danny’s awesome,” Scott adds, as soon as they’re once again back in their own little personal bubbles, each of them claiming a seat at the table. “Is he, uh... is he into you?”</p>\n<p>Stiles shrugs, his gaze falling to a knot on the surface of the table. He runs his thumb over it, his nail catching on a jagged edge in the middle of the swirl. “I’m not actually sure,” he admits. “We’ve been hanging out a lot, but... yeah, I don’t know.”</p>\n<p>“Well, good luck!” Scott says brightly. “And hey, he knows about werewolves, but isn’t one - you guys totally have that in common now!”</p>\n<p>It’s such a ridiculous summation of this entire day that Stiles snorts and drops his head to the crook of his elbow. “Yes, good, just what I was looking for in a boyfriend.”</p>\n<p>A silence blankets them, but it’s a nice one, a settled one, and they don’t break it until Scott sits up, the movement abrupt. Stiles can practically see his ears perk up.</p>\n<p>“My mom’s here,” he says. “I’m gonna go get her - you stay here, all right?”</p>\n<p>“Yeah, sure,” Stiles agrees, because where the hell else is he going to go?</p>\n<p>Scott wavers though, for the moment after he gets to his feet, and it’s not until Stiles quirks an eyebrow at him that he speaks. “Are we okay? Or at least, uh, close?”</p>\n<p>“Yeah,” Stiles says. He has to clear his throat, because it suddenly feels a little bit tight. “Yeah, buddy. We’re okay.”</p>\n<p>It gets a grin, a flash of white teeth, and then Scott is taking off for the front door.</p>\n<p></p>\n<p>*</p>\n<p>“Hey,” Scott says, as Stiles’ is climbing into his mom’s car. “Give me your keys.”</p>\n<p>Stiles goes all squinty-eyed at him, which prompts an eye roll from Scott.</p>\n<p>“For your jeep,” he says. “I’ll run over and get it, then come meet you at the hospital.”</p>\n<p>It’s not that Stiles doesn’t want his jeep back; he wants his jeep back very badly, in fact, and leaving it in an abandoned lot for the foreseeable future reads like an invitation for his father to start asking some pointed questions about what Stiles has been doing with his time. The thought of sending Scott alone, however, makes his stomach twist, and he hesitates, teeth worrying at his bottom lip.</p>\n<p>“I’ll be <i>fine</i>,” Scott says, holding his hand out and making a “gimme” motion with his fingers.</p>\n<p>“Take Derek with you,” Stiles finally says, digging his keys out of his pocket and holding them out to Scott. “I swear, you don’t want to mess with these Alphas, okay? Take Derek, and don’t do anything stupid.”</p>\n<p>Scott just smiles, plucking the keys from Stiles’ fingers with something like glee - probably because Stiles never lets anyone else drive his baby. Ever. Not even Scott. “See you in twenty minutes,” he promises, then lopes back up to the house, hopefully to get Derek. Mrs. McCall emerges from the front door just as Scott hits the porch, and Stiles watches him press a quick kiss to her cheek, his lips moving in what’s probably a thank you. Mrs. McCall manages a smile, but to Stiles, it looks strained, full of worry. She doesn’t say anything though, just runs a hand through Scott’s hair and makes her way down the rest of the stairs.</p>\n<p>“You ready?” she calls as she approaches the car, and Stiles nods, finally bringing his legs inside and tugging the door shut.</p>\n<p></p>\n<p>*</p>\n<p>They made him turn his phone once he left the waiting room, and Stiles is itching to check it, to make sure everything’s okay. The instant he’s got his cast on, he excuses himself to go find Scott, leaving his dad to deal with the list of instructions on proper cast care, which is honestly kind of redundant at this point, because Stiles has had broken bones on multiple occasions, he’s practically an expert on them by now.</p>\n<p>When he makes it to the waiting room, though, it’s empty, except for a middle-aged woman who has a hand wrapped around her stomach and is looking faintly green, and a young father with a baby who won’t stop crying. Stiles takes a second look around, slower, but there’s no Scott to be found.</p>\n<p>He spots Mrs. McCall emerging from a hallway out of the corner of his eye, and he jogs over to her, trying his best to keep his panic at bay.</p>\n<p>“Hey,” he says, “is Scott here? Is he with you?”</p>\n<p>“No,” she says, eyebrows ticking up. “Should he be? I thought he was getting your jeep - he probably left it at your house.”</p>\n<p>Stiles bites back his disagreement, because there’s no sense in worrying Scott’s mom needlessly. Scott hasn’t told her anything about the Alpha Pack; they’d had to explain away the broken wrist with a thoroughly embarrassing explanation of yet another fantastically clumsy moment in the life of Stiles Stilinski: ie, the time Stiles had pulled off to the side of the road to help a stray dog, which had conveniently run off when Stiles had managed to trip over his own feet and tumble down the steep incline, snapping his wrist when he’d thrown his hand out to break his fall. It had been the only thing they could think of to account for the bruise and scrape along his cheek as well, and Stiles kind of hates the fact that Mrs. McCall and his own father had bought it hook, line and sinker.</p>\n<p>Mrs. McCall’s eyebrows are moving higher with every second Stiles doesn’t answer though, so he quickly says, “Right, yeah - you’re probably right. I’ll just... give him a call later.”</p>\n<p>He wheels away from her quickly, turning his phone back on as he heads back to his dad. There aren’t any missed calls, no voicemails or text messages, which actually concerns him more than if there had been some. At least then he would know what’s going on.</p>\n<p>He runs into his dad halfway down the next hallway; his dad sighs when he sees the bright blue cast, and he slings an arm around Stiles’ shoulders, heading in the direction of the parking lot.</p>\n<p>“You hungry?” his dad asks. “We could stop for burgers on the way home.”</p>\n<p>“Nah, I’m okay,” Stiles says quickly. “I was feeling kind of queasy earlier, actually, with the pain and all, so I’m thinking I might just make a sandwich at home. And you have to get back to work anyway, right?”</p>\n<p>“Well... yeah, I have some things I need to finish up,” his dad says. “But only if you’re sure you don’t need me to stick around. You going to be okay for a couple hours?”</p>\n<p>“Yeah, completely,” Stiles insists. “Seriously, just drop me off at home, I’ll probably get a sandwich and go right to sleep, I’m wiped out.”</p>\n<p>“Okay,” his dad agrees, and they’re quiet the rest of the way home, although Stiles can’t stop himself from fidgeting. There are a million things that could have happened; Scott might have forgotten the plan to come to the hospital, or else gotten distracted with something. Maybe the Alphas took his jeep somewhere, and Scott’s spent all this time looking for it. Or maybe Allison called him up and wants to get back together; Stiles can’t even really blame him if that’s the case, because he’s pretty sure that Scott’s higher brain functions cease functioning whenever Allison acknowledges his existence.</p>\n<p>Still, his stomach sinks when they pull into the driveway and Stiles’ jeep is nowhere to be found.</p>\n<p>“I thought Scott was getting the jeep for you,” his dad says, frowning, and Stiles takes a deep, meant-to-steady breath.</p>\n<p>“Probably took it for a joy ride,” he says, popping the door open and hopping out. “Jerk. I’ll call him - go finish your work, okay? And no stopping by McDonald’s for dinner - I’ll <i>know</i> if you’ve had something terrible and artery-clogging.”</p>\n<p>“Yeah, yeah,” his dad says with an eyeroll of epically teenage proportions. “Don’t forget to take those pain meds, all right? Love you, kid.”</p>\n<p>“Love you, too, Dad,” Stiles says, and as soon as his dad and the patrol car are out of sight, he takes off for his room, dialing Scott’s number as he goes.</p>\n<p>The phone rings once, twice, three times, and then Scott’s voicemail kicks in.</p>\n<p>“Scott!” Stiles exclaims. “Where the hell are you, man? I’m back from the hospital, where <i>you</i> were supposed to be - call me back as soon as you get this, okay? Because I am kind of freaking out here, and I swear to God, if you went and used my jeep to pick Allison up and win her back, I am going to kick your ass, do you hear me? <i>Call</i> me.”</p>\n<p>He throws his cell down on his bed, feeling jittery enough that he knows sitting down isn’t going to last. He paces the room instead, gnawing at his thumb nail and wondering what the hell he should do next.</p>\n<p>Stiles is just about to try calling Isaac, instead, when he hears a thud from downstairs. He goes flying down the staircase, at a speed that presents a real hazard to his newly-casted wrist, and skids to a stop in the front hall, keeping an ear out for another burst of noise that he can zero in on.</p>\n<p>There’s a second thump, coming from the kitchen this time, and he forces himself to a slower pace, wishing all the while that he had a baseball bat with him. Or perhaps a considerably more lethal weapon. He’d take one of those, too.</p>\n<p>“Who is that?” he calls out as he approaches the kitchen. “Scott?”</p>\n<p>It’s gotten dark, but he can hear a sort of scuffling sound, and he grasps blindly for the light switch, a small yelp escaping him the instant he’s flipped it, because there is half a person sticking through the kitchen window. All Stiles can see is a pair of black motorcycle boots and dark grey jeans, and he grabs for their biggest butcher knife before he realizes who those jeans belong to. Or, to be perfectly honest, who that ass belongs to.</p>\n<p>“Derek?” he asks, voice strangled. “Are you serious right now? What the hell do you have against <i>doors</i>, you creep! You - ”</p>\n<p>He breaks off as Derek slides down to the floor, landing in a crumpled heap and leaving a smear of blood all along the windowsill. He struggles to sit up, and Stiles makes a choked noise as he takes in the state of Derek’s chest. His shirt is in tatters, revealing four deep score marks, like a set of claws ripped their way through his skin.</p>\n<p>The wounds aren’t healing, and Stiles knows exactly what that means.</p>\n<p>“Derek?” he repeats, his voice barely a whisper, and Derek’s eyes flutter, taking a good thirty seconds to actually focus on Stiles.</p>\n<p>“They’ve got Scott,” Derek mumbles. “I couldn’t - too many - they took him. Y’need to call the pack - get everyone here. Figure out what t’do.”</p>\n<p>He slumps back against the wall, like he’s all out of energy to keep himself upright, and Stiles spends half a second quietly panicking before his brain manages to shut out all that white noise and zeroes in on what needs to be done.</p>\n<p>First things first; he shoots a text to Isaac, a demand to round up the rest of the pack and bring them all to Stiles’ house, because now is not the time for any of them to be alone. Second, he pulls Derek up and half-carries him as carefully as he can to the living room, where he deposits him gingerly on the couch. Derek leaves a trail of blood all along the kitchen tile and the carpet, and Stiles can only imagine all the blood he’s going to get on the couch, but Stiles will just have to figure that out later.</p>\n<p>Derek’s unconscious by the time Stiles slides a pillow underneath his head, and it’s only then that Stiles realizes his hands are shaking, that he feels like he’s about to be sick. If Derek’s hurt this badly, Stiles doesn’t even want to think about the state Scott’s in - or the state he’s about to be in, if the Alphas do, in fact, have him.</p>\n<p>“Derek, buddy, c’mon,” Stiles murmurs, resisting the urge to put his hands on Derek’s shoulders and shake him awake. “Wake up. This is your chance to prove what an awesome Alpha you are, okay? I need you right now - <i>Scott</i> needs you, so you have to get up.”</p>\n<p>There’s no response, nothing but the slow, shallow rise of Derek’s chest to indicate that he’s still alive.</p>\n<p>“Okay,” Stiles says to himself, his voice shaky. “Okay. Time to call Dr. Deaton.”</p>\n<p>It’s a stroke of luck that Deaton answers, and he swears he’ll be there in ten minutes. Ten minutes for Deaton, then, possibly less for the rest of the pack, provided Isaac actually got Stiles’ message and passed it on to everyone else.</p>\n<p>Ten minutes, then, to wait. Stiles can do that. He can absolutely do that. He drags an ottoman next to Derek’s head, then sits right beside him, where he can keep an ear out for the quiet, barely-there rhythm of his breathing. His own heart is pounding, loud in his ears, but he focuses on Derek’s breathing instead, like if he pays enough attention, it will keep Derek alive.</p>\n<p>Ten minutes until help arrives.</p>\n<p>Ten minutes until they can start working on how to save Scott.</p>\n<p>Ten minutes.</p>\n<p>Stiles buries his face in his hands, takes a deep breath, and sends a silent prayer up to whoever might be listening to help keep his panic at bay for just ten more minutes.</p>\n<p>Derek comes to with a pained gasp. It’s probably Stiles’ fault; he’d been trying to get a better look at the damage the Alphas had done to Derek, but Derek’s shirt is... <i>sticking</i> to his wounds in awful, horrible ways, and when Stiles goes to lift it up, he finds another gouge along Derek’s side curving around his abs and disappearing toward his back.</p>\n<p>“Hey, no, calm down,” Stiles says as Derek tries to force himself up to a sitting position, a hurt and frustrated sound tearing out of him. “Derek, just <i>relax</i>, okay? The rest of the pack is on their way, there’s nothing you can do right now.”</p>\n<p>Derek subsides, but there’s a decidedly furious glower on his face. Stiles would like to think it’s not directed at him specifically though, so much as the situation they’re in.</p>\n<p>“Can you tell me what happened?” he asks, leaning in closer. He feels too much like he’s looming, which is strictly Derek’s purview, so he forces himself to shift back, to give Derek some space.\n</p>\n<p>“Your jeep was sitting there, probably right where you left it,” Derek says quietly. “We figured we’d be fast enough to get in and get it started before they tried anything, but...” His eyes go distant, like he’s remembering something terrible, and Stiles reaches out unthinkingly, sets the tips of his fingers against Derek’s arm.</p>\n<p>“Derek?”</p>\n<p>“There had to be at least ten of them,” he says. “They came out of <i>nowhere</i>, all of them shifted, and Scott just - froze. Though I don’t think we would have had time to get to the jeep anyway, they were that fast.”</p>\n<p>Derek’s looking determinedly up at the ceiling as he talks, and Stiles takes the opportunity to study his expression. He’s pale, clearly exhausted and in a lot of pain, but his face is flooded with guilt, too.</p>\n<p>“They overpowered you?” Stiles asks. “And took Scott?”</p>\n<p>The nod Derek offers his jerky and sharp.</p>\n<p>“Don’t blame yourself, okay?” Stiles says. “If anything, I mean - <i>I’m</i> the one who gave him my keys - ”</p>\n<p>“If I can’t blame myself, then you can’t either,” Derek says immediately, his voice that same, rough growl. “I’m going to get him back though. Once the pack gets here - ”</p>\n<p>“You and a bunch of recently-turned teenagers going up against ten or more Alphas?” Stiles asks, and he doesn’t <i>mean</i> to sound skeptical, but he is, and it comes through in his voice loud and clear.</p>\n<p>“There’s Peter,” Derek says, and Stiles snorts.</p>\n<p>“Yeah, Peter. We should definitely trust him. Absolutely.”</p>\n<p>“He’s pack,” Derek growls, his frown deepening. “He’ll do as I ask.”</p>\n<p>Stiles grits his teeth and bites back the response he wants to make. It’s hard work, ignoring the part of him that’s still terrified of Peter, in a way he’s never felt toward Derek.</p>\n<p>It’s not his call to make though. It’s Derek’s, it’s his pack’s, and if they all want Peter around, then Stiles guesses it’s out of his hands.</p>\n<p>He doesn’t get the chance to say anything else anyway; Isaac strides in a moment later, closely followed by Erica and Boyd.</p>\n<p>“Deaton’s around the corner,” Isaac announces, as Erica and Boyd move immediately to Derek’s side. “We passed him.”</p>\n<p>“Good,” Stiles says, getting quickly to his feet, vacating his own spot next to Derek for either Erica or Boyd to claim. Isaac looks just as panicked as Stiles feels, although he’s keeping it just as tamped down, too. Stiles can see it anyway, in the tension surrounding his eyes, the tight line of his mouth.</p>\n<p>“We’re getting him back,” Stiles says, voice low and firm. “Nothing is going to happen to him.”</p>\n<p>Isaac takes a deep breath, then gives Stiles’ shoulder a clap before moving closer to Derek.</p>\n<p>The pack has to scatter away from their Alpha once Deaton finally walks in, but Stiles takes the opportunity to fill them in on the situation. Everyone’s face looks the very picture of grim by the time he’s finished.</p>\n<p>“We’re all going to die,” Erica mutters, earning her a sharp look from nearly everyone else in the room.</p>\n<p>“Nobody’s dying,” Derek snaps, the words giving way to a snarl as Deaton applies some foul-smelling paste to his gasping chest wounds.</p>\n<p>“Nobody’s dying,” Stiles repeats. “Just... ignore the current state of your walking, talking werewolf shish-kebab over there.”</p>\n<p>“Derek’s in no shape to fight,” Boyd chimes in, gaze flickering toward their Alpha. “And we’re down Scott. The three of us can’t take on that kind of a threat.”</p>\n<p>“There’s Jackson,” Stiles says, then blinks, looks around. “Where is he? For that matter, where’s Peter?”</p>\n<p>“Jackson’s on his way,” Isaac says. “But Peter...” He hesitates, then trails off, eyes sliding to Derek.</p>\n<p>“We haven’t seen much of Peter recently,” Erica finishes.</p>\n<p>Stiles immediately rounds on Derek, ignoring the faint sympathy that wells up in him at the sight of how miserable he looks. “Peter will fall into line, huh?” Stiles asks. “Are you telling me that instead of keeping him on the tightest leash <i>ever</i>, your creepy zombie uncle has been completely left to his own sadistic devices?”</p>\n<p>Derek manages a glare, but it’s not even close to threatening.</p>\n<p>“How much you want to bet he has something to <i>do</i> with the Alpha Pack?” Stiles says, voice rising. “You ever think about <i>that</i>, Derek?”</p>\n<p>“That hurts, Stiles.”</p>\n<p>The voice comes out of nowhere, and Stiles whirls around, to find Peter Hale himself standing in the doorway to his living room, his ever-present smirk curving around his mouth. Stiles stumbles back, and it’s only Isaac’s hand gripped tight around his bicep that keeps him from falling. He can’t help the fact that he still reads Peter as the biggest threat in the room - even when the room in question is filled to the brim with werewolves.</p>\n<p>Peter takes three precise steps, then stops. His hands are in his pockets, and his posture is relaxed and loose - as non-threatening as he can make it. His eyes are cold though, and his voice has that same lilt it had before, the one that had promised blood and mayhem and destruction.</p>\n<p>“We’re all friends here, Stiles,” Peter says. “No need for nasty accusations or name-calling. That isn’t very <i>nice</i>.”</p>\n<p>Stiles swallows, then lifts his chin a little higher, as defiant as he can possibly make it. “If you’re here to help Scott, then fine,” he says. “But I swear to God, if you try anything - if this is all some elaborate douchebag scheme of yours - ”</p>\n<p>Peter’s eyes flash for just a moment - a dark rusty brown that’s too close to red for Stiles’ comfort. In the next instant it’s gone, and Peter’s eyes are back to their normal blue. “I’m here for my Alpha,” he says, glancing at Derek, then back to Stiles. He takes his hands out of his pockets, offers them palm up to Stiles. “Nothing up my sleeves,” he adds. “I want Scott back just as much as you do.”</p>\n<p>“He’s not lying,” Derek breaks in. He’s breathing heavily and through his nose, jaw clenched tight as Deaton finishes bandaging him up. “I’d know it if he was.”</p>\n<p>Stiles doesn’t feel all that convinced, but he nods anyway, knowing it’s the best he’ll get for now. Isaac gives his arm another friendly squeeze and then drops his hand; Stiles hadn’t even realized he’d been holding on all this time, and he manages a crooked smile for him. After all of this is over, once they get Scott back safe and sound, he’s going to have to apologize to Isaac. He’s not exactly looking forward to it, but he can at least recognize when he’s in the wrong, and Isaac didn’t actually deserve anything Stiles had thrown his way.</p>\n<p>“I’ve done all that I can,” Deaton says, fixing the last bandage in place, then snapping his gloves off and stepping away from Derek. “You’ll heal, but it’s going to take some time.”</p>\n<p>Derek, of course, gets to his feet immediately; Stiles doesn’t miss the way Deaton rolls his eyes - displeased, but resigned.</p>\n<p>“As soon as Jackon gets here, we’ll leave,” he announces, rolling his shoulders in a way that makes his muscles flex in a really distracting way, especially considering that now is so completely not the appropriate moment to be noticing something like that.</p>\n<p>“And?” Stiles prompts, fixing his gaze determinedly to Derek’s face. “What’s the plan after that?”</p>\n<p>“The plan,” Derek says, his eyes narrowing into a glare, “is for you to stay here, safe, and let us take care of this.”</p>\n<p>It takes Stiles a moment to realize that Derek is actually being serious, but the instant he does, he folds his arms across his chest and matches Derek’s glare with one of his own.</p>\n<p>“First,” he says, “that is a <i>shitty</i> plan. And it’s not even really a plan, it’s just another round of ‘let’s throw ourselves headfirst into danger and hope for the best,’ which, <i>no</i>. And second? No way in hell am I sitting this out.”</p>\n<p>“You’re hurt,” Derek says firmly.</p>\n<p>“You’re hurt <i>worse</i>,” Stiles fires right back.</p>\n<p>“Stiles, I’m not doing this with you right now. You’re <i>staying</i> - ”</p>\n<p>“I’m not,” Stiles interrupts, fighting to keep from erupting into shouting. It’s horribly tempting. “We <i>just</i> had this conversation, do you not remember?”</p>\n<p>“I do,” Derek says. His gaze is so intense, it might as well be burning a hole right through Stiles. “And I also remember the part where I said I wouldn’t let anything <i>happen</i> to you again.”</p>\n<p>Something about the way he says it makes Stiles flush, and he remembers all at once that they aren’t alone; they’re having this conversation in front of the rest of Derek’s pack, in front of Deaton, in front of <i>Peter</i>. Stiles doesn’t want to linger on exactly what’s making that steady heat creep up his face, and so he just lifts his chin and drops his voice.</p>\n<p>“Either I’m pack, or I’m not, Derek,” he says quietly. \"You don't get to go back and forth on this.\"</p>\n<p>Silence stretches between them, and neither of them breaks eye contact until they hear the sound of an expensive car roaring up the street.</p>\n<p>“Jackson’s here,” Isaac says. “I’ll go... fill him in.”</p>\n<p>“Me, too,” Erica says immediately, and Boyd follows them out the front door. Deaton’s disappeared; Stiles thinks he can hear him moving around the kitchen, maybe, leaving just him, Derek, and Peter in the living room.</p>\n<p>When Stiles glances back at Derek though, Derek’s shifted his gaze to his uncle, and some sort of unspoken command must pass between them, because then Peter’s melting out of the room as well, back to the front yard with the rest of the pack.</p>\n<p>“You know,” Stiles says, tongue sneaking out to wet his lips. His mouth feels very suddenly dry. “If this is your attempt to get rid of any and all witnesses, I’m going to have to dock you points on subtlety.”</p>\n<p>“Stiles,” Derek says, sounding every inch the grumpy sourwolf Stiles knows him to be. “Shut up.”</p>\n<p>He crosses to Stiles, finally coming to a stop directly in front of him, and Stiles’ heart stutters wildly. For once, he does as Derek asks and keeps his mouth shut. Just for the moment. Just long enough for Derek to lean in, one hand curving around his neck.</p>\n<p>“You’re pack,” Derek says, an affirmation. “But you’re also human. You - you’re <i>breakable</i>.”</p>\n<p>“For the record,” Stiles says, “I’ve been shot, clawed up, and gouged <i>way</i> fewer times than Scott has.”</p>\n<p>Derek’s eyes darken toward something angry. “The difference,” he growls, “is that Scott gets back <i>up</i>. You might not be able to.”</p>\n<p>Stiles just holds his gaze, letting his expression speak for him. He can tell that his message has been received, loud and clear, when Derek huffs a supremely irritated sigh.</p>\n<p>“Would you take the bite?” he asks suddenly, his grip tightening on Stiles’ neck. He’s not holding tight enough to hurt, but it’s a firm, steady pressure, the tips of his fingers digging in. There’s no prick of claws though, no danger that Stiles might come away scratched or nicked.</p>\n<p>“No,” Stiles says, no hesitation this time around. His stomach swoops low though, that frisson of trepidation passing through him, the way it always does whenever he thinks about what his life might become if he were to ever say yes to that question.</p>\n<p>Derek just nods though, like he expected as much. He looks tired, and it makes Stiles want to do something insane, like hug him. He's clearly been spending too much time around Danny, or something. He curls his hands into fists to ensure they don't reach out for Derek, ignoring the sharp ache in his left wrist.</p>\n<p>“You do as I say,” Derek says, before Stiles can say anything else. “<i>Exactly</i> as I say, do you understand?”</p>\n<p>“Yeah,” Stiles agrees, then forces a grin to his face. It’s more difficult than he expected it to be. “As long as what you say isn’t completely stupid.”</p>\n<p>He’s expecting a growl, some sort of irritated eye roll, but Derek only looks at him steadily, then gives Stiles’ neck a firm squeeze before finally releasing him. Stiles shivers when he moves away; Derek runs hot, and the air feels chilly without him directly in Stiles’ personal bubble.</p>\n<p>“You should check in with Deaton,” Derek says, nodding toward the kitchen. “See if he can do anything about the bloodstains on your couch.”</p>\n<p>“Yeah, <i>your</i> bloodstains,” Stiles mutters, but it’s a weak reply. He doesn’t move from his spot as Derek heads outside. He just watches him go, until a polite cough from behind him catches his attention.</p>\n<p>“For the record, I am not a maid service,” Deaton says, “but I’ll see what I can do about the blood.”</p>\n<p>“Thanks,” Stiles says. He glances quickly to the couch and then just as quickly away, feeling faintly queasy at the sight of all the blood that Derek left behind. “My dad would, uh.. assume the worst.”</p>\n<p>“He might not be wrong in that assumption,” Deaton says, because Deaton is a glass half-empty kind of guy. “A pack of Alphas isn’t to be trifled with. I’m surprised you haven’t already figured that out.”</p>\n<p>“I’ve figured it out,” Stiles protests. “Trust me, I am incredibly aware. But they’re not leaving me behind. They <i>need</i> me, okay?”</p>\n<p>Deaton sighs and digs a small satchel out of his pocket. “I never said they didn’t, Stiles,” he says placidly, then tosses him the bag. Stiles catches it one-handed; it’s a soft, purple velvet, the color deep and rich, and it’s tied with a silky, golden drawstring.</p>\n<p>“Mountain ash?” Stiles asks, and Deaton nods. “This stuff doesn’t come with, like, a handbook or something, does it? Because I’ve gotta say, that would make this all ten thousand times easier.”</p>\n<p>“No handbook,” Deaton says. His mouth quirks to the side, giving his expression an almost fond edge. “There wouldn't be a point - it works differently for everyone. But I trust that you’ll figure out what to do with it when the time comes.”</p>\n<p>“Super helpful, thanks,” Stiles grumbles, but he slips the bag into the pocket of his jeans, where there’s no danger of it falling out.</p>\n<p>There’s the sudden thump of footsteps coming toward the front door - loud enough that Stiles wonders if the stomping is for the benefit of his pathetic human hearing - and then Boyd pokes his head in, gaze finding Stiles.</p>\n<p>“Derek’s ready to go,” he says, and Stiles squares his shoulders.</p>\n<p>“Does Derek actually have a plan yet?” Stiles asks, but he’s reaching for his hoodie, already heading toward the door.</p>\n<p>“That’s why we voted you get to ride with him,” Boyd deadpans. “Spend the car ride bouncing some ideas around, okay?”</p>\n<p>“Yeah, great,” Stiles grumbles, but he glances back before he goes, lifting a hand in Deaton’s direction. “Hey... thanks.”</p>\n<p>Deaton just nods, his face serious. “Good luck,” he says.</p>\n<p>Stiles swallows and closes the door firmly behind them. He’s pretty sure luck is exactly what they’re going to need.</p>\n<p>“I don’t like this,” Derek grumbles as he pulls to a stop and cuts the engine. They’re the first ones to the junkyard, but they also managed to hit every green light; the rest of the pack wasn’t so lucky, but they should be along shortly. “We need something else, something different.”</p>\n<p>“Look,” Stiles says, not making any move to get out of the car just yet. “You said that there are usually treaties in place, right?” Derek makes a vague noise, but Stiles is going to take it as agreement. “And treaties require negotiation.”</p>\n<p>“They’re not going to negotiate with us, Stiles,” Derek says, and Stiles can hear the frustration in his voice, the tension lining those words.</p>\n<p>“Maybe they’ve been waiting for you to come to them,” Stiles counters. Derek shoots him a look, which he pointedly ignores. “You did say that you and Laura had forfeited your right to hold territory here - and yes, there was other stuff going on, I get it, but maybe if you all just sat down and <i>talked</i> about it...”</p>\n<p>“No,” Derek says firmly, shaking his head. “If they’d wanted to play nice, they would have approached me. Instead, they intimidated the hell out of Boyd and Erica, spent weeks lurking on the outskirts of town while leaving menacing reminders of their presence everywhere, and then they <i>hurt</i> you. And now they’ve taken Scott. They’re <i>toying</i> with us, and it’s - it’s uncivilized. It’s not the way packs are meant to interact with one another.”</p>\n<p>Derek’s the one with experience in this area, so Stiles has no doubt that he’s technically <i>right</i>, but the fact remains that the Alpha pack has Scott, and they need to do <i>something</i> in order to get him back.</p>\n<p>“I don’t like it anymore than you do, but what other choice do we have?” Stiles says with a forced shrug. “Now, how do traditional negotiations work? Pack to pack? Alpha to alpha?”</p>\n<p>“It... varies,” Derek says. “In a situation like this...” He hesitates, and Stiles knows he isn’t going to like whatever Derek has to say next.</p>\n<p>“They’ll want to maintain an upperhand,” Derek finally says, his mouth tightening at the corners. “They won’t want to talk to me - I’ll have to send a second. They’ll probably want Peter, since he’s more experienced than Boyd. As a show of trust, one of their pack members will stay with us, and in return... they’ll choose a member of our pack to be sent to them for the duration of the negotiations.”</p>\n<p>He’s not quite meeting Stiles’ eyes as he says it, and a heavy, sour weight settles in the pit of Stiles’ stomach. Just like that, he knows exactly who they’ll choose.</p>\n<p>“That sounds more like collateral,” Stiles says, and Derek doesn’t correct him, which... ugh, Stiles sometimes hates being right. “They, uh, also pretty heavily implied they’d rip my head off if they saw me again,” he says, swallowing. “Sure you can’t send ‘em Jackson instead?”</p>\n<p>“Do you see why this is a terrible plan?” Derek breaks in, his voice angry and sharp. “Once you’re in there, I can’t protect you, Stiles. Sending you is supposed to be a sign of good faith, of trust, but I <i>don’t</i> trust them. They could do <i>anything</i> to you, and I wouldn’t be in a position to stop them.”</p>\n<p>His chest is heaving, and there’s the slightest edge of red to his eyes, and Stiles doesn’t want to think about what would happen if he ran into one of the Alphas right this moment. After a second’s deliberation, he reaches out to Derek’s shoulder, curling his fingers carefully against his jacket.</p>\n<p>“This is all we’ve got,” Stiles says seriously, his fingers tightening in what he hopes is a reassuring manner. He can feel how solid Derek is beneath that leather, his muscles coiled and ready for a fight. “They took Scott, and there’s no way in hell I’m letting them keep him. Besides,” he adds, managing a crooked smile, “now that I think about it, Jackson would be unbelievably shitty at negotiations. You definitely don’t want him going in there to plead your case.”</p>\n<p>“I don’t want you going in either,” Derek says, his words almost a growl, his gaze so intent that Stiles has to freeze for a moment, caught under his stare.</p>\n<p>He finally swallows and takes his hand from Derek’s shoulder. “The rest of the pack is probably here by now,” he says. “We should go meet them.”</p>\n<p>Derek nods, slipping out of the Camaro, though Stiles takes an extra moment, just long enough to shoot a text to Alison, an oh-so-brief rundown of the situation, as well as a description of their location. The Argents aren’t his first choice in allies, but as it so happens, he kind of hates this plan just as much as Derek does, and if the possibility for backup exists, well, he thinks they might as well try. He doesn’t even know if it will work; to the best of his knowledge, Scott and Alison haven’t been speaking at all this summer. He just has to hope that she’ll come, that Scott being in danger will be enough to bring her here, along with her father and whatever other trustworthy hunters she can round up. </p>\n<p>As soon as the text is sent, Stiles gets out of the car, closing the door just as the rest of the pack turns into the junkyard: Jackson and Erica in his Porsche, Boyd, Isaac and Peter in the oh-so-sensible Honda Peter has apparently procured for himself.</p>\n<p>“So, do we have a plan yet?” Isaac asks, as soon as his feet are on the ground.</p>\n<p>Stiles shares a look with Derek; Derek looks away first.</p>\n<p>“Negotiation,” Stiles says. “We’re going to try talking it out.”</p>\n<p>“And you think <i>that’s</i> a winning strategy?” Jackson demands, lips pressed so tightly together that a tic starts up in his cheek.</p>\n<p>“I think it’s a better plan than sending Danny on a snipe hunt for steroids,” Stiles snaps back, and for once in his life, Jackson subsides.</p>\n<p>“Well, well, negotiation, is it?” a familiar voice breaks in, and a growl goes up amongst the werewolves as they all whirl around to face the newcomer. Stiles doesn’t miss that the pack closes ranks around him, putting his all-too-human self squarely in the center of their protective circle. </p>\n<p>He recognizes the female Alpha from before, and she bares her teeth in a grotesque parody of a grin. She isn’t alone; there’s an adorably plump blonde who looks like she could be a cheerleader standing to her right, and a middle-aged man to her left, complete with slicked-back hair and a goddamn suit.</p>\n<p>“Alpha Hale,” the man says, his voice almost a purr. “How nice of you to drop by. Again. This makes, what, your pack’s third visit today?”</p>\n<p>Derek’s jaw is clenched tight. Stiles is just impressed his claws haven’t made a showing yet. “We’re here to negotiate,” he grits out, looking positively murderous. Stiles hopes he keeps himself in check; murder doesn’t seem like it would be a terribly positive start to what is supposed to be a productive discussion.</p>\n<p>“You know the protocol?” the blonde asks, lifting one perfectly plucked eyebrow. Her voice is light and pleasant, and her smile is positively perky, and Stiles really, really hates her.</p>\n<p>“I do,” Derek says grudgingly. “Which of yours will you be sending to us?”</p>\n<p>The man who looks like a car salesman steps forward, his expression easy and relaxed. “That would be me,” he says, his gaze raking over Derek, then darting over to Isaac, whom he offers a wink. Stiles shudders on Isaac’s behalf.</p>\n<p>“We’ll speak with your uncle,” the blonde says, and Peter steps forward readily, likely already expecting it. “And we’ll also - ”</p>\n<p>“The newest wolf and the human,” the woman in the center interrupts. Derek goes rigid as a board beside him, and - yes, there are the claws.</p>\n<p>“No,” Derek says sharply. “<i>One</i> of them will meet with you.”</p>\n<p>“I want both,” the woman says simply, with the air of someone who knows she has all the cards. She smirks at Stiles, but then her gaze sweeps back to Jackson and settles into something more predatory.</p>\n<p>Derek’s ready to argue - probably ready to launch himself at the Alphas, claws and fangs bared - so Stiles hastily steps on his foot.</p>\n<p>“It’s fine,” he murmurs, when Derek looks at him, trying to keep his voice low enough so the Alphas can’t hear, though he knows that’s unlikely. “They’re just trying to throw you off, I bet, okay? It can’t hurt to have an extra one of us in there, right?”</p>\n<p>Stiles doesn’t even believe his own attempts at reassurance, because there’s something else at play here, he’s sure of it, but the Alphas are a few too many steps ahead, and he doesn’t see any choice but to go along with their whims and hope some opportunity falls into their laps.</p>\n<p>Derek doesn’t say anything else, but he also doesn’t stop Stiles or Jackson as they step forward to stand beside Peter.</p>\n<p>“Excellent,” the female Alpha says, offering Derek another flash of teeth, one of the more threatening smiles Stiles has ever had the misfortune to witness. “I’ll send a messenger if we’re going to be longer than an hour.”</p>\n<p>She gestures for the blonde to go first, then for Peter, Stiles and Jackson to follow, leaving herself to bring up the rear. The blonde sets a quick pace, and it gets darker the further into the forest they get, until Stiles is having difficulty placing his feet. He stumbles and nearly goes down more than once, but each time Jackson appears at his side, catching him. They don’t discuss it, and Stiles doesn’t bother to thank him, but he is grateful, in spite of the fact that it’s Jackson who’s keeping him on his feet.</p>\n<p>All told, the walk takes less than ten minutes, and they come to a stop in a clearing where an ancient barn stands, made of decrepit, decomposing wood. It’s fairly large, but it also looks like it’s on the verge of collapse.</p>\n<p>“Seriously,” Stiles mutters, “what <i>is</i> it with werewolves and buildings that should have been condemned by now? Does squalor really do it for you or something?”</p>\n<p>Jackson jabs him in the back, a gesture clearly intended to shut him up, but sarcasm is Stiles’ coping mechanism when it comes to being scared out of his freaking mind, and this entire situation more than qualifies, so Jackson shouldn’t expect a respite from the snark anytime soon.</p>\n<p>The blonde opens up a door tucked into the side of the barn, and Stiles is surprised to see a warm glow coming from within. They must have a generator, he realizes as he steps inside, because there are a half dozen lamps scattered throughout the half of the barn they’ve clearly been using as their base. There are a few piles of moldy-smelling hay, which Stiles guesses have been used for bedding, probably, and across from him, barely visible in the gloom, is another door, a mirror to the one they’ve just entered.</p>\n<p>“Stiles!” </p>\n<p>Stiles whirls around, and his heart gives a lurch as he spots Scott, manacled to a corner. There are wires running along the metal, crackling with the electricity that’s meant to keep Scott in check. Stiles starts toward him, but surprisingly, it’s Peter who grabs him by the collar of his shirt and yanks him back.</p>\n<p>“I just want to check on him,” Stiles protests, “make sure he’s all right.”</p>\n<p>Peter doesn’t let go though; in fact, he curls his hand around Stiles’ throat, and Stiles is shocked to feel the pinprick of five claws. He goes perfectly still, and Peter’s other hand locks tight around his arm.</p>\n<p>“Well?” Peter asks lightly, and from the way she looks up, Stiles knows he’s talking to the female Alpha. “Can we consider our bargain fulfilled?”</p>\n<p>“I think so,” she says.</p>\n<p>“Bargain?” Stiles chokes, just as Jackson starts growling and begins to shift. He isn’t quick enough though; the female Alpha signals and two other werewolves grab him, pinning him easily to the floor.</p>\n<p>“What the hell is this?” Stiles demands unsteadily, remaining stock still, too aware of how Peter’s claws are on the verge of sinking into his skin.</p>\n<p>“My nephew killed me,” Peter says silkily, walking Stiles over to where Scott is chained. “You don’t <i>really</i> think I’d just let that go, do you? Forgive and forget? Not exactly my style.”</p>\n<p>He shoves Stiles down to the ground, and Stiles throws his hands out to catch himself, crying out when his cast thuds harshly against the dirt floor, sending a shockwave of pain all the way up his arm.</p>\n<p>“So, what,” Stiles says hoarsely, scrambling up to a sitting position, cradling his aching wrist to his chest. “You waited until a pack of Alphas showed up and made some kind of twisted deal?”</p>\n<p>Peter’s smirk. “Now, that would have been rather chancey,” he says. “I called them here. It’s a handful of old friends, some acquaintances, a few favors I was owed.” Stiles gapes at him, and Peter’s smirk widens. “Very interested, they were,” he says in a low voice, leaning in so Stiles will be able to hear, “in our friend Jackson over there. And willing enough to help me regain my Alpha status in exchange for him.”</p>\n<p>For all that Stiles has been anti-Peter from the start, it’s still blowing his mind a little that Peter actually is the villain here, the proverbial Big Bad Wolf, if you will. </p>\n<p>“Okay,” Stiles says shakily. “So, the Alphas - they wanted Jackson, you got them Jackson. And you’re going to kill Derek to take his Alpha powers, I’m guessing? And you had them take Scott because - because there’s probably still some sort of tie between you, since you gave him the bite.” Beside him, Scott is growling, low and menacing, deep in his throat. Stiles tries to put that from his mind, wets his lips as he stares Peter down. “So what’m I doing here?” he asks. “Why have them bring me?”</p>\n<p>“I’m not going to make the same mistakes as last time,” Peter says easily. “I plan to start my new pack off on the right foot.” He catches Stiles by the chin, forces him to look up. “No refusing my very generous offer this time, Stiles,” he says.</p>\n<p>“You think I’d ever be a part of your pack?” Stiles spits, while Scott makes yet another lunge forward, though he falls back with a cry when the manacles spark, shocking him. “Even if you did bite me, you would <i>never</i> be my Alpha.”</p>\n<p>Peter smacks his cheek - two hard slaps that leave Stiles’ skin stinging. “We’ll see about that,” he says as he stands up. He looks terribly pleased with himself. “The both of you - I think you’ll fall into line quite nicely once I’ve bestowed the rest of my bites. I think I’ll start with the Sheriff, then work my way around to Allison and, of course, the lovely Melissa.”</p>\n<p>Scott rears back and howls, and the only thing that keeps Stiles in place is the view he has of the wicked curve of Peter’s claws, still unfurled at his side.</p>\n<p>“Mmm, I thought so,” Peter says with a low chuckle, and right before Stiles’ eyes, he lets the change wash over him, doing the same twitchy shoulder thing that Stiles has seen Derek do. “Do be good, boys, I’ll be back soon.”</p>\n<p>He lopes away to where the other Alphas are congregated, clearly ready to be on their way. Stiles takes quick stock of the situation. Jackson’s manacled to the wall to their left, just like Scott, complete with the electrical hook up to keep him from breaking free. He’s aware and alert though, staring straight at Stiles and Scott, something pleading in his expression. Stiles doesn’t blame him; he can’t imagine the Alphas have anything good in mind for their resident ex-kanima.</p>\n<p>There’s one Alpha stationed equidistant between the three of them, who’s clearly meant to be keeping an eye on everything while the other Alphas go fight. Stiles’ gaze flicks back over to the group, and he can tell they’re ready to go, that they’ll be leaving any second. He’s starting to panic, because Scott and Jackson are essentially out of commission right now, and there’s no way Stiles can take out even one Alpha, not when he doesn’t even have anything to <i>fight</i> with - </p>\n<p>He freezes, remembering the bag of mountain ash weighing down his pocket. He can’t make a circle with it, there isn’t time for that, and it’s not like it would do them any good, anyway. And he certainly can’t force any of the Alphas to ingest it. But maybe there’s some other way he can use it, something else he can try.</p>\n<p>A possibility occurs to him all at once, and he carefully turns away from the Alphas, fishing the bag out of his pocket. He slips his hand inside the bag, collecting a fistful of ash, then catches Scott’s eyes and sucks in a deep breath, making an exaggerated show of holding it. Scott looks at him in confusion for a moment, before understanding dawns and he takes his own breath, mimicking Stiles.</p>\n<p>Stiles catches Jackson’s eyes and performs the same mime, making sure he sees Jackson take the breath before he closes his own eyes, breathes in deep and steady.</p>\n<p>He just has to believe. The mountain ash is all about belief, the knowledge that you can make something happen. He thinks about Gerard, what the mountain ash had done to him, thinks about the line that had snaked its way around the warehouse, the line that never should have connected because there wasn’t enough ash to finish it.</p>\n<p>He thinks about the inside of this barn, imagines the dust in his palm swirling up into the air, spreading out in curling tendrils until the entire room is thick and choking with it. Then he brings his hand to his mouth and blows.</p>\n<p>Stiles blinks his eyes open immediately and has to resist the urge to gasp. The air is hazy with mountain ash, impossibly dense, considering he’d had so little in his palm. He can barely see three feet in front of him, but he can hear the Alphas retching and gasping. Stiles doesn’t have any time to waste though; he doesn’t have any idea how long a werewolf can hold its breath, and he has a feeling exposing Scott and Jackson to any mountain ash whatsoever probably isn’t <i>good</i> for them.</p>\n<p>He jumps to his feet and darts to Scott’s side, yanking the wires away from the manacles. Scott’s sweating, his skin gone almost grey, but as soon as the electricity is disconnected, he manages to yank himself free, and then he and Stiles are racing over to Jackson to repeat the process.</p>\n<p>An Alpha grabs Stiles’ shoulder as he goes past, but he fumbles out another handful of mountain ash to fling in his face, and the man goes down with a yowl, clawing at his eyes.</p>\n<p>The three of them burst outside, out the door they entered, and Scott and Jackson immediately start sucking in huge lungfuls of air, terrible, hacking coughs wracking their frames. Stiles swats at them with his good hand as best he can, batting mountain ash from their hair and clothes.</p>\n<p>“C’mon,” he says nervously, glancing back to the barn. Already the dust is beginning to clear from the air, and Stiles has no idea if his plan will have proven to be nothing more than a minor inconvenience to the Alpha pack. “We have to go - we have to warn Derek - ”</p>\n<p>“Nah,” Jackson chokes, giving his head a sharp shake. “He’s already on his way - ”</p>\n<p>Derek and the rest of the pack come crashing through the trees before Jackson can finish his sentence. Derek’s eyes are blazing red, Isaac, Erica and Boyd ranging behind them in their wolf forms, their own eyes glowing.</p>\n<p>“I heard Scott’s howl,” Derek growls. “What the hell happened?”</p>\n<p>He starts forward, and Stiles lunges forward, grabs his arm to drag him back toward the tree line. “You don’t want to go in there right now, trust me,” he says. “There’s mountain ash - I filled the air with it.” His eyes narrow as he takes in the four wolves, remembering that there should be a fifth. “Where’s the Alpha who was with you?”</p>\n<p>“Dead,” Derek says, his expression dark and terrifying. “Collateral. I told you, I heard Scott’s howl, knew something was wrong. Where’s Peter?”</p>\n<p>“He’s with them,” Jackson says, voice hoarse. He’s looking decidedly rough, but there isn’t any black oozing from either his or Scott’s faces, so Stiles is going to consider that a win. “He made some sort of deal with them - they were going to help him kill you, so he could be an Alpha again.”</p>\n<p>Stiles watches Derek carefully, not entirely sure what he’s expecting: a howl of rage, maybe, or a reckless rush to get at his uncle. Derek doesn’t make a sound, though his body goes rigid, expression collapsing into a look of fury and betrayal.</p>\n<p>“We end this here,” he says, each word enunciated perfectly. “They’ll be weak from the mountain ash - don’t waste any time, attack as soon as they step foot outside. Don’t kill them outright if you can avoid it - leave that to me.”</p>\n<p>Derek’s gaze finds Stiles, then, and his mouth tightens that much more. “You should go,” he says, but he already sounds resigned, like he knows the answer he’s going to get.</p>\n<p>“I’m staying,” Stiles says, lifting his chin in defiance.</p>\n<p>Before Derek can argue, the barn doors fly open, and everyone tenses, the wolves poising for attack. For a moment, there’s no movement, and then there’s suddenly an ear-splitting yowl, and the entire Alpha pack comes streaming out at once.</p>\n<p>Their faces are terrible, black liquid oozing from their mouths and noses, from their eyes, and there’s a desperation to their movements that wasn’t there before. The Alphas meet Derek’s pack in a rush, and although Stiles’ friends are outnumbered, they’re fresh, unaffected by the mountain ash, and he can see that their attacks are stronger, more precise. More devastating.</p>\n<p>Still, it’s not just a pack of werewolves, it’s a pack of <i>Alphas</i>, and they aren’t going down without a fight.</p>\n<p>Stiles regretfully puts the mountain ash back into his pocket, knowing he won’t be able to use it anymore, not when both packs are so entwined. He drops back toward the tree line, reaching for a fallen branch, since some sort of weapon is better than none.</p>\n<p>There’s a rustling behind him, and he whirls around with his branch at the ready, only to come face to face with Allison and her father. Stiles’ mouth drops. </p>\n<p>“Got your text,” Allison murmurs, brushing past him to get closer to the action.</p>\n<p>Stiles makes some sort of shocked noise, but Allison signals for him to be silent, then raises her crossbow, clearly sighting one of the two Alphas who are advancing on Scott. She fires, and Stiles watches the arrow find its mark, embedding itself in the throat of the Alpha, who drops to the ground with a gurgle. The other Alpha - the blonde cheerleader-type - looks up just in time for Chris Argent to fire two bullets right into her heart: wolfsbane, if the way she shrieks is anything to go by.</p>\n<p>The gunshots, of course, take away their element of surprise, but Stiles isn’t so sure if they even need that anymore. The Alpha pack is splintering before his eyes, three of them going down under the combined onslaught of Derek and Boyd, Erica taking care of a fourth. Scott gets to his feet with a roar, then leaps forward to join Jackson and Isaac, making quick work of the Alphas they’re facing.</p>\n<p>Allison already has her bow reloaded, taking care to sight carefully before she looses another arrow. Chris barks out, “Stiles!” and tosses him a gun, which Stiles just barely manages to catch with his good hand. He holds it carefully, the weight of it fitting comfortably in his hand. He’s gone shooting with his dad before, and he’s a decent enough marksman, even if he isn’t the best.</p>\n<p>He takes another look around the battleground, and that’s when he realizes, with a sinking feeling in the pit of his stomach, that he doesn’t see Peter anywhere.</p>\n<p>Peter’s all about self-preservation, Stiles knows - clearly, since he had an entire backup plan at the ready to resurrect himself from the dead. So its not like it’s surprising that Peter hasn’t joined in the actual combat. He doesn’t believe for a second that Peter has actually left though. He’s no doubt lurking on the edges of the action, simply waiting to seize an opportunity, should one present itself.</p>\n<p>They can’t afford that, can’t afford to let Peter walk away from this unscathed, can’t afford to let him live when he’s only going to try to unravel them once more.</p>\n<p>Stiles double checks that the gun’s safety is off, then darts between the fighting werewolves, back into the house. The mountain ash haze has mostly cleared out, but he doesn’t linger, heading straight for the second door he’d glimpsed earlier. He’s unsurprised to find it open, and he slips out as quietly as he can, holding his gun at chest-level and doing his best to keep it steady.</p>\n<p>“Peter!” he calls hoarsely, keeping his back firmly to the barn. It’s dark on this side of the clearing, infinitely more shadowed, and he’s having a hard time adjusting to the gloom. “Peter, you fucking <i>coward</i>. Come out where I can see you!”</p>\n<p>He keeps his eyes glued to the forest, expecting at any moment to see Peter slinking out from between two trees.</p>\n<p>Instead, he hears a scrape from high above him, like the sound of a claw on wood, and he jerks around just in time to see Peter launch himself off of the roof, aiming straight for Stiles.</p>\n<p>He shoots once, misses, and then Peter’s tackling him to the ground, the two of them rolling over twice before coming to a stop. Peter is sprawled on top of Stiles, one hand wrapped around his cast, pinning it over his head, but Stiles has the muzzle of his gun pressed right to Peter’s stomach, his finger still on the trigger. Stiles is nearly gasping for air, and Peter’s breathing isn’t all that steady either.</p>\n<p>Peter still manages to crack an oily smile though, peering down at Stiles with something a lot like interest. “Why, Stiles,” he says smoothly, “is that a gun or are you just happy to see - ”</p>\n<p>“Shut up,” Stiles bites out, jabbing the gun harder into Peter’s gut - his diaphragm, if the pained wheeze he makes is anything to go by. “I swear to God, I will shoot you.”</p>\n<p>“Oh, I believe you,” Peter murmurs. He moves his free hand to Stiles’ neck, and Stiles feels the tips of his claws curving into his skin, far too close for comfort. “The real question,” Peter continues, “is whether that shot would kill me before I sliced open your throat.” His smile widens, cold and ruthless. “Now, since we seem to be at something of a stalemate here, how about I sheathe my claws, you put the gun down, and we both go our merry, separate ways.”</p>\n<p>“Yeah, right,” Stiles manages to spit out. “So you can go after my dad or Mrs. McCall? Not a freaking chance.”</p>\n<p>Peter’s expression darkens, and his smile is starting to look distinctly forced, like he’s finding their banter less amusing by the second. Stiles shifts uncomfortably and swallows hard. His heartbeat is through the roof, and if he can hear its thudding in his own ears, he can only imagine how loud it must be to Peter, betraying just how terrified he really is.</p>\n<p>“Planning on waiting here until my handsome nephew comes to rescue you, then?” Peter asks sharply, and Stiles’ chest tightens, a harsh breath spilling out of him. Peter’s eyes gleam; he looks so self-satisfied that Stiles kind of wants to puke.</p>\n<p>“A regular damsel-in-distress aren’t we, Stiles?” Peter asks, his voice cold. He forgets himself enough to lift his hand from Stiles’ neck, pressing a claw into his cheek instead and drawing a ragged scratch down its curve. “Take away your pretty bag of magic tricks, and what are you? <i>Useless</i>. You - ”</p>\n<p>Stiles pulls the trigger, ignores the warm gush of blood and <i>shoves</i> Peter away, scrambling out from underneath him as fast as he can. Peter makes a wounded, gurgling noise, swaying on his knees. His face is ugly, and he shifts with a pained roar, struggling to his feet. Stiles is ready for it though, already on his feet, planting them shoulder-length apart as he levels the gun once more, this time straight at Peter’s heart. “One more step,” Stiles warns, voice thick, but his hand steady.</p>\n<p>“Oh, Stiles,” Peter growls, almost fondly. “You would have made a wonderful, ruthless beta. I almost regret what I’m about to do to you.”</p>\n<p>He’s still faster than Stiles would have believed possible, seeing as he’s got a wolfsbane bullet lodged underneath his ribs right now, but Stiles has put a fair amount of distance between them, and this time when he shoots, he doesn’t miss.</p>\n<p>Peter’s whole body jolts when the bullet hits him, and he looks almost surprised as he glances down at the sudden bloom of blood spreading darkly across his chest.</p>\n<p>When he crumples to the ground, he doesn’t get back up again.</p>\n<p>Stiles turns at the sound of rapidly approaching footsteps, but it’s only Derek and Scott who round the corner of the barn. Scott lets out a shout when he sees Stiles, racing over to him with a look of terror on his face.</p>\n<p>“Stiles!” he yells, “are you - oh God, what the hell happened - ”</p>\n<p>Stiles glances down, letting out a soft “huh” at the sight of his blood-soaked shirt, the grisly sight of his red, slick hand. “It’s not mine,” he says weakly. His head feels heavy as he lifts it back up to Scott, who’s come to a stop right in front of him. “I’m fine, man, it’s okay, I’m - ” He spots Derek, hovering a few steps behind Scott, and Stiles’ voice cracks as he says, “I’m sorry. I’m - I think he’s dead. I’m pretty sure I killed him.”</p>\n<p>Derek’s face is hollowed out, all sharp lines and gaunt shadows, but he squeezes Stiles’ shoulder as he passes him, making his way carefully over to his uncle.</p>\n<p>Stiles watches him, a sick feeling rising up in his own stomach, a wave of nausea he has to force down. It’s not like this is the first time he’s caused irreparable damage to Peter Hale. He as good as killed him last time, too, with their homemade molotov cocktails, but that had been from a distance. This time - this time had been from Stiles’ own two hands, and the evidence is still slick and sticky on his skin.</p>\n<p>He tries to wipe the blood off, but his shirt is too saturated to soak any of it up. Stiles finally drops his hands to his sides, ignoring the way they shake.</p>\n<p>“Is everyone - ” he starts to ask, “are the Alphas - ”</p>\n<p>“Dead,” Scott says, voice flat, his jaw clenched, tight and crooked. “They’re all dead. Mr. Argent took care of the ones that Derek didn’t get to.”</p>\n<p>Stiles spares a quick look toward Derek, who’s bending over his uncle, examining him carefully. He’s a mess, too, Stiles realizes, blood on his hands, his shirt and, horrifyingly, smeared over his chin and down his neck. Stiles shudders, and his stomach turns viciously. He doesn’t want to get sick, that is the last thing he wants to do, and he swallows hard. Scott’s looking at him with eyes that are wide and worried, and Stiles doesn’t protest when he seems to make up his mind and drags Stiles in for a hug, because apparently hugs are a thing they do now, all the time. This makes, what, four times in one night?</p>\n<p>“Shit,” Stiles says thickly, fingers on his good hand curling into Scott’s shirt. He’ll have to buy him another one, because this one’s going to be a lost cause after hugging Stiles. “That escalated so fucking quickly, Jesus, I can’t - we should go home, I want to go home, my dad’s going to <i>freak</i> if he gets home and I’m not there.”</p>\n<p>“Yeah,” Scott agrees, hugging him tighter. “I’ll drive you, okay? </p>\n<p>“You’re not hurt?” Derek asks, from just behind Stiles’ shoulder, and Stiles jumps. He turns to face him, Scott’s arms falling away.</p>\n<p>“No, I’m fine,” he manages. “Bruised, a little, but I’m not - the blood isn’t mine.”</p>\n<p>Derek’s gaze zeroes in on the scratch Peter had left on his cheek though, and he lifts his hand to Stiles’ chin, angling his face to better examine it.</p>\n<p>“It’s a scratch,” Stiles says, voice cracking. His own gaze is kind of stuck on the blood streaked all over Derek’s face. “I’m fine.”</p>\n<p>There’s something in Derek’s expression that says, quite clearly, he isn’t convinced, but then he seems to notice where Stiles is looking, and he hurriedly swipes his shirt sleeve across his face in an attempt to clean himself up a little. It doesn’t help that much, though it does leave him looking very slightly less deranged.</p>\n<p>“Let’s go,” Scott says gently, nudging Stiles back toward the front of the barn. Derek stays behind, already turning back to deal with his uncle.</p>\n<p>The front of the barn is a mess of bodies and blood, and the Stiles from a year ago probably would have been morbidly fascinated, but as it currently stands, he just keeps his chin lifted and does his best to ignore the grisly scene, instead seeking out his friends to make sure they’re all right. Everyone seems to be in one piece, though more exhausted than elated. Going up against an Alpha pack head-on takes it out of you, clearly.</p>\n<p>“I’m fine,” Stiles says again, when he sees more than one pair of eyes widen, taking in his appearance. “I’m not hurt, Peter’s dead, it’s all - it’s fine.”</p>\n<p>“I’m driving Stiles home,” Scott announces, leading Stiles toward the trees, in the direction of his Jeep. “But, um. I’ll be back, okay? Twenty minutes.”</p>\n<p>Stiles catches Scott’s gaze straying to Allison and her father, and he almost has to laugh, because his best friend is nothing if not consistent. Scott’s expression goes sheepish at Stiles’ soft, huffed breath, but Stiles only shakes his head, nudges Scott with his shoulder.</p>\n<p>“It’s okay, dude,” he says very quietly, “I get it.”</p>\n<p>“I don’t even know why she’s here,” Scott says as they head into the woods, picking a careful path in the direction of the junkyard.</p>\n<p>“I texted her,” Stiles says. “Told her you were in trouble. They must’ve dropped everything to get here as fast as they did.”</p>\n<p>“That’s - that was - good call,” Scott says roughly. He’s never been good at keeping his emotions from his face, and even in the dark of the forest, Stiles can tell that he’s flying through expression after expression, trying to get a handle on what this might mean for him and Allison.</p>\n<p>They stay quiet until they reach the junkyard, and Stiles breathes a sigh of relief when he spots his Jeep, unharmed and right where he left it.</p>\n<p>“You still got my keys?” he asks, and Scott holds them up, gives them a shake. He unlocks the door for Stiles, then circles around to the driver’s side, while Stiles settles into his seat, doing his best not to get too much blood on his baby's upholstery.</p>\n<p>“Ready?” Scott asks, as he turns the key and starts the engine.</p>\n<p>“Yeah, man,” Stiles agrees. He sounds worn out, even to his own ears. “Thanks for driving me.”</p>\n<p>“Never a problem,” Scott says softly, seriously, and the Jeep rumbles quietly as they pull out of the lot and turn down the street, into the night.</p>\n<p>Stiles doesn’t realize just how soaked in blood he is until he and Scott are a minute and a half down the road, and suddenly all he can smell is the copper tang of blood. His stomach turns, and he fumbles desperately for the window crank, rolling it all the way down and stopping just short of sticking his head out of it, the way a dog might on a long car ride.</p>\n<p>“You okay?” Scott asks, shooting him a worried look.</p>\n<p>“Fine,” Stiles gasps, swallowing against the abrupt flood of saliva in his mouth. “Fuck, I’m fine, just needed some air.”</p>\n<p>“Are you going to pass out?” Scott asks, voice pitching higher with concern. “You look like you’re about to pass out.”</p>\n<p>Stiles forces himself to take a deep breath, letting the cool night air hit the back of his throat in a welcome rush. It makes him feel a little less like puking, but his heart is still hammering too fast. </p>\n<p>“I - shit,” he says, halfway to burying his face in his hands before he remembers the blood drying thick and tacky on his skin. He course corrects, leaning far enough forward to press his forehead to the dashboard instead, lets his fingers dig into his knees; his jeans are ruined anyway, a little more blood won’t matter.</p>\n<p>“It’s different,” Stiles says. “Hurting somebody up close, right? It’s - I felt it when that bullet hit him, Scott, he <i>jerked</i> - and his blood’s all <i>over</i> me, it’s all - how’m I even going to get it all out - ”</p>\n<p>A warm hand descends on the back of his neck, offering him a firm squeeze.</p>\n<p>“It sucks,” Scott finally says quietly, voice distant, like he’s remembering. “And it’s different, yeah. It’s more... real, when you can actually feel what you’re doing to someone.”</p>\n<p>Scott takes a turn at a sharp angle, and the two of them rock to the left, Stiles’ body pressing harder into Scott’s palm.</p>\n<p>“You heard him though,” Scott says after another few blocks of strained silence. “You knew what he was going to do - to my mom, to your dad.”</p>\n<p>“I mean, yeah, he was the bad guy,” Stiles says. “I’d do it again, if I had to.”</p>\n<p>And maybe that’s the most unsettling part. That he’s shaken now, kind of nauseous and freaked, but he isn’t broken. He knows just what he’s capable of, knows that if push comes to shove, he can stare down a threat to his family and pull the trigger anyway.</p>\n<p>They spend the rest of the drive in silence, Stiles breathing through his mouth in an effort to stave off that sick feeling still lurking in the back of his throat. It doesn’t help much; he might not be able to smell the blood anymore, but he’s so covered in it that he can still taste it, a metallic tang on his tongue.</p>\n<p>The Jeep bounces gently as Scott turns into Stiles’ driveway, and as soon as it’s come to a rocking stop, Stiles fumbles the door open and nearly trips over himself to get outside, to get away from that enclosed space.</p>\n<p>“Thanks,” he says, already holding his hand out for his keys. “For driving me, thanks. You should get back - ”</p>\n<p>“Dude, I’m staying,” Scott says easily, circling around to Stiles’ side, depositing the keys in his palm. His face is set, and Stiles wonders when he changed his mind. “No way I’m leaving you here alone.”</p>\n<p>“I’m fine,” Stiles protests immediately. He winces though, registering all too well just how unconvincing he sounds. “And you told Allison - ”</p>\n<p>“We’ll talk some other time,” Scott says firmly. He’s already got his arm draped over Stiles’ shoulders, totally unmindful of the blood. “This is where I should be right now, okay?”</p>\n<p>Stiles slumps, a breath away from agreement, when his front door bursts open and Danny comes rushing out, pulling up short when he gets close enough to see their current state in the evening’s gloom.</p>\n<p>“Holy shit,” he breathes, voice gone soft with something that sounds, to Stiles’ mere human senses, like terror. “Holy <i>shit</i>, Stiles - ”</p>\n<p>“I’m okay,” Stiles croaks. “I’m not - it isn’t mine.”</p>\n<p>Stiles doesn’t even think to question what Danny’s doing here. Somehow, just seeing him sends a dizzying rush through him, a feeling he doesn’t have a name for. It relaxes him though, the tension within him uncoiling sharply enough that he feels the way Scott notices, how his arm twitches, how he turns to look at Stiles, surprise in his gaze.</p>\n<p>“Okay,” Danny manages, nodding weakly. “Scott, are you - ”</p>\n<p>“Also fine,” Scott says. “No one’s hurt, and the Alphas are dead, so. We won, I guess.”</p>\n<p>“Victory to us,” Stiles chimes in weakly, but no one laughs. </p>\n<p>“You need to get inside,” Danny says suddenly. “Before your neighbors see you.”</p>\n<p>“Yeah,” Stiles says, then turns to Scott. “Thanks for driving me,” he says, quiet, low enough that Danny’s human hearing won’t pick up on it. “You should go talk to Allison.”</p>\n<p>“But you - ”</p>\n<p>“Danny’ll stay,” Stiles says, glancing over his way, just for a second. Danny’s tense, worry still lining his expression, but his gaze is fixed to Stiles, like he’s resisting the urge to check him over for himself, make sure he’s really okay.</p>\n<p>“Shit, dude,” Scott sighs, then drags him into a hug. Stiles is going to let it slide for tonight, but as of tomorrow, he’s putting a daily limit on hugs. “I’m calling you in an hour, okay? And if you need me to come back over, just say the word.”</p>\n<p>“I will,” Stiles promises. “Thanks, I - thanks.”</p>\n<p>“You saved my life,” Scott says steadily, pulling away far enough to look at Stiles with such fierce affection that Stiles can’t believe he went half a summer without speaking to Scott at all. “You’re a big damn hero.”</p>\n<p>It actually shocks a laugh out of Stiles, and Scott beams, clearly pleased by it. He doesn’t linger beyond that - probably wants to keep things on a light, pleasant note - and Stiles watches him shift as he darts between Stiles’ and his neighbor’s houses, taking a route back to the junkyard that will keep him out of the way of any prying eyes.</p>\n<p>When Stiles turns back around, Danny’s watching him, eyes dark and filled with concern. “Shower?” he asks, and at the suggestion, Stiles feels a surge of want more powerful than anything he’s ever known.</p>\n<p>“Yes,” he says. “Oh my God, yes, please.”</p>\n<p>He follows Danny into his house, noting with approval that there’s no evidence of blood; Deaton must have some kind of magic clean-up fairy dust that he hasn’t told Stiles about, because Stiles doesn’t have any idea how he managed to get the place so spotless.</p>\n<p>“Dr. Deaton let me in,” Danny says, as he leads Stiles up the stairs, moving familiarly enough that Stiles wonders if he’s wiled away his time here by exploring the place. “I wanted to come by, see if you were really okay, and I found him instead. He told me what was going on, and I just... Jesus,” he says, gives his head a shake. “I don’t know how you guys deal with this shit.”</p>\n<p>“Dealing with it implies some degree of control,” Stiles says. “I think you’re giving us too much credit.”</p>\n<p>Danny glances over his shoulder, eyes finding Stiles. “You seem pretty in control to me,” he says, which is ridiculous, considering that just ten minutes ago Stiles had been on the verge of a panic attack. The way he’s looking at Stiles is careful and warm, and Stiles chokes on a response, feels a rush of blood start to creep up his face.</p>\n<p>Danny notices it, gaze lingering over Stiles’ cheeks before he abruptly turns around as they reach the landing, ducking swiftly into the bathroom. Stiles takes a moment to grip the railing and breathe deeply, needing the time to regain his composure. He doesn’t know what’s wrong with him, that he can still get distracted by Danny’s eyes and his broad, strong shoulders, even after the night he’s had.</p>\n<p>He hears the shower turn on, and he forces himself to move. Danny must have the shower cranked all the way to boiling, because it’s only been a few seconds, but Stiles already feels a burst of steam against his face as he enters. It feels good - soothing, like stepping into a sauna, the kind of warm air that digs into your muscles and forces them to relax.</p>\n<p>Danny’s rummaging through the cabinets, making a triumphant noise as he pulls out a plastic bag, a remnant of Stiles’ last trip to CVS.</p>\n<p>“For your cast,” he says, nodding to Stiles’ wrist. Thank God for Danny, Stiles thinks, because in his current state of mind, he’s pretty sure he wouldn’t have remembered to wrap his cast until it was halfway to disintegrated.</p>\n<p>“Get undressed - we’ll wrap it once you’re ready to get in,” Danny says brusquely, but unless Stiles is much mistaken, he’s blushing a little. </p>\n<p>It could be the heat, Stiles thinks. It’s probably just the heat.</p>\n<p>He turns away from Danny as he peels his shirt off, tossing it right into the trash can. He toes off his shoes, then undoes his pants and shoves those down, pulls his socks off as he steps out of his jeans. It leaves him in just his boxers, and he hesitates for a moment before deciding to leave those on.</p>\n<p>Stiles catches Danny watching when he turns around, but his eyes are mostly fixed to the blood that soaked through Stiles’ shirt and smeared across his chest.</p>\n<p>“Shit,” Danny whispers again, but he doesn’t say anything else as he carefully takes Stiles’ cast in his hand and begins to tie the bag around it.</p>\n<p>“Waterproof, you think?” he asks after a minute, eyebrows raised, and Stiles nods.</p>\n<p>“Should be good,” he says, “thanks.”</p>\n<p>The mirror in the bathroom is already fogged over, and it’s starting to get difficult to breathe, the air full of muggy moisture. Stiles tests the shower with his unbagged hand, then turns the knob just a titch back toward cold, not wanting to scald himself when he gets in. Once the stream of water is bearable, he steps into the tub, tugs the curtain shut behind him.</p>\n<p>The hot water feels incredible, streaming over his aching body, already pinkening by the time it pools around his feet. Stiles is going to have to scrub to get the blood off, but for now he just bows his head and lets the water sluice over him, turns his thoughts off and empties his mind of anything but how good a hot shower feels.</p>\n<p>His concentration breaks when the curtain slides open again, and Danny steps in, undressed but for his boxer briefs. Stiles swallows, mouth parting at the sight of him, and Danny offers him a crooked smile.</p>\n<p>“I just thought you could use some help, maybe,” he says quietly, a little hard to hear over the drumming of the water against porcelain. Stiles doesn’t think anyone’s ever looked at him quite like Danny is right now - as if Stiles is someone special, someone Danny wants to get to <i>know</i>, dig down deep and find out all his secrets.</p>\n<p>The thought makes Stiles shiver, even though the shower is far too hot for that.</p>\n<p>“Gonna scrub my back for me?” he finally croaks, a pale imitation of a joke, and Danny steps closer, reaching past him for the shampoo.</p>\n<p>“Among other things,” he says lightly, and Stiles knows right then that he can choose to take that statement however he pleases.</p>\n<p>He stays silent for now, turns cooperatively as Danny lathers up the shampoo, then starts massaging it into his hair. Stiles has been growing it out for the past couple months, so it’s longer than it used to be, and he can’t quite contain a quiet moan as Danny’s fingers slide through it, rubbing firmly against his scalp.</p>\n<p>“Close your eyes,” Danny murmurs, and Stiles slips them shut as Danny guides his head back under the water, though he wicks away most of the soap before it can get near Stiles’ eyes.</p>\n<p>Once his hair is thoroughly rinsed, Danny gets the soap out and starts sudsing up Stiles’ back. His touch hovers somewhere between clinical and an outright massage, and Stiles can feel his dick starting to harden, firming up against the sopping cloth of his boxers.</p>\n<p>“Turn,” Danny says, once Stiles’ back is perfectly clean. Stiles hesitates for only a moment this time, grateful for the fact that he’s already flushed from the heat of the shower, that Danny won’t be able to tell he’s blushing. </p>\n<p>“I can finish - if you want,” Stiles forces himself to say, voice hoarse, just to check in. He doesn’t want Danny to feel like he owes Stiles this, or like Stiles isn’t capable of finishing washing up, even if he will have to do it one-handed.</p>\n<p>“Nah, I’ve got this,” Danny says. His eyes are very dark, and Stiles exhales in a stuttered rush as Danny brings his soapy hands to Stiles’ body and begins rubbing them in circles along his skin, starting at his shoulders and making his way to Stiles’ chest, slowly and carefully down his stomach.</p>\n<p>Stiles’ voice cracks when he says, “Fuck, Danny,” when Danny’s hands reach his waistband. One stays right where it is, fingertips hovering over the saturated fabric, but the other one slides around Stiles’ side to splay against the small of his back.</p>\n<p>“You don’t like me,” Stiles blurts out, all of a sudden feeling vaguely panicked and entirely out of his depth, because this is, unquestionably, the most intimate thing that’s ever happened to him, and on top of everything else that's happened tonight, it might be too much for him to deal with.</p>\n<p>Danny just looks at him steadily though, his gaze warm and almost fond. “That hasn’t been true for awhile now,” he murmurs, and it could be condescending or rude, but Stiles already knows that Danny spent a long time disliking him, and to hear this straight from his mouth, that it’s just not true anymore...</p>\n<p>“You’ve got some serious hidden depths, Stilinski,” Danny adds, and Stiles means to offer him a smile, something in return for what he’s sure is a compliment, but he gets distracted by Danny’s mouth instead, his breath hitching obviously.</p>\n<p>Danny inhales, sharp and sudden, then gently nudges Stiles back against the shower wall. The cold shock of the tile makes Stiles gasp, just as Danny leans in for a kiss.</p>\n<p>Danny, Stiles realizes suddenly, is tall. Stiles might run with werewolves, but Danny’s got inches on everyone in the pack, except for maybe Boyd and Isaac. It means Stiles has to tilt his head up to kiss him, that he has to reach up to thread his fingers through Danny’s hair, the better to tug him in closer.</p>\n<p>Danny’s mouth is wet and hot, and he’s terribly, brain-meltingly practiced at this, teasing Stiles’ mouth open with ease, sucking hard on his bottom lip, only to soothe it a moment later with a flick of his tongue.</p>\n<p>Stiles doesn’t know what to do with his injured hand, can’t seem to find a comfortable position for it, and Danny finally wraps his fingers just below his cast, around the skin of Stiles’ forearm, and presses it into the wall behind him, up above Stiles’ head. It makes Stiles wonder if Danny was paying attention at the club, if he was taking mental notes of the things Stiles likes.</p>\n<p>Just the thought makes Stiles’ dick throb, makes him jerk his hips against Danny’s, moaning when he can feel how hard Danny is, too. He repeats the motion, and this time it’s Danny who makes a noise, low and choked in the back of his throat.</p>\n<p>“You want me to blow you?” Danny offers, and Stiles’ eyes fly open - God, he hadn’t even realized they’d fallen shut.</p>\n<p>“Shit, no,” he gasps. “If you put your mouth on me, I’m going to slip and crack my head open and die the least heroic death ever.” Danny snorts, but he doesn’t protest, probably sensing the truth of the statement.</p>\n<p>“Let’s just... this is good, right?” Stiles asks unsteadily. “This is nice.”</p>\n<p>“Nice?” Danny asks with a teasing smile, even as he rocks forward again. “Is that all I rate?”</p>\n<p>“You’re right on the verge of excellent,” Stiles says, the fingers of his uninjured hand tugging thoughtlessly at Danny’s hair. “Maybe if you took those briefs off - ”</p>\n<p>Danny doesn’t hesitate; he lets go of Stiles just long enough to shove his underwear down, the fabric clinging as he slides it off. Then his hands go to Stiles’ waistband, and Stiles nods frantically at Danny’s questioning look, lifting his hips away from the wall so Danny can peel his boxers off.</p>\n<p>It’s the first time Stiles has ever been naked with anyone outside of a locker room, and he’s determined not to stare like someone who’s obviously new at this. He drags Danny in for another kiss instead, but this time his dick drags wetly up Danny’s hip, and it's starting to feel like Stiles’ brain is going to short-circuit from how <i>good</i> this is.</p>\n<p>“I got you,” Danny says, one hand sliding up Stiles’ back again, the other - oh God, wrapping around both of their dicks, giving Stiles’ a warm, tight channel to fuck up into.</p>\n<p>It’s over embarrassingly fast after that. They thrust up against each other, bodies wet and overheated; Stiles clutches at Danny’s shoulder as he comes, muffling his cries into his neck.</p>\n<p>“Shit,” Danny grunts, then, “Stiles - ” and his hips jerk hard, come splashing onto his fist, some even splattering against Stiles’ stomach.</p>\n<p>Stiles feels limp and wrung out, exhausted down to his bones, and all he manages to do is pant and try to catch his breath as Danny maneuvers him back under the water, carefully rinsing both of them off. The water’s just starting to go lukewarm, but it’s a cool relief against Stiles’ overheated skin.</p>\n<p>Once they’re all cleaned up, Danny turns the water off, and the two of them stumble out of the tub, dripping all over the floor.</p>\n<p>“Towels’re - that cabinet, there,” Stiles manages, pointing at the cabinet in question. Danny obediently snags two fluffy towels, handing one off two Stiles and using the other to dry himself off, before tying it snugly around his waist. Stiles copies his movements, albeit quite a bit clumsier, with only one working hand. When he fumbles his effort to tie the towel at his waist, Danny steps in, wrapping Stiles up easily and efficiently although he takes advantage of the opportunity to tug Stiles in close enough for another slow, drawn out kiss.</p>\n<p>Stiles’ knees feel weak once they finally part, and he dips his head, pressing his mouth to Danny’s collarbone, since it’s right there in front of him, tempting him.</p>\n<p>“Bed,” he murmurs, because between the night’s earlier violence, the sex, and the way Danny’s kisses have left him breathless and dazed, Stiles doesn’t think he’ll manage to stay on his feet too much longer.</p>\n<p>They do pause briefly in Stiles’ bedroom to drag on some shorts before letting the towels drop and crawling into Stiles’ bed. Like last time, Danny immediately curls into Stiles, his arm wrapped firmly at his waist, nose tucked into the back of his neck. Stiles feels a vague, interested pull low in his stomach, but the adrenaline rush is finally wearing off, the crash settling in, and it’s left him more exhausted than horny.</p>\n<p>It’s nice, lying there with Danny, with the warm, solid weight of him, and Stiles wishes he could just let it be, that he could turn his brain off for once and enjoy it.</p>\n<p>That’s not how Stiles’ brain operates, unfortunately, and after a few quiet minutes, he says, “You know this is a bad idea, right?”</p>\n<p>Danny doesn’t say anything; Stiles can feel his soft, even breathing against the back of his neck, the only sound against the silence of the room. When it’s been too much stillness for too long, Stiles shifts, lets the pads of his fingers tap idly along Danny’s forearm.</p>\n<p>“I just,” he starts to say, soft and stilted, “you don’t want any part of this. You said you didn’t, and that’s - it’s for the best, really, congratulations on the whole having a sense of self-preservation thing.”</p>\n<p>Danny makes a muffled noise - Stiles can’t tell if it’s amusement or a mild scolding - and tightens his arm, pulling Stiles closer.</p>\n<p>“I’m in this though,” Stiles says, staring straight ahead at his window, where the mountain ash line is still intact. He’ll have to remove it tomorrow morning; the Alphas are gone, after all, and he isn’t interested in keeping any of the werewolves - his pack, he supposes - out of his room anymore. “And I think I’m always going to be. And I don’t want to be the person dragging <i>you</i> in and getting you involved.”</p>\n<p>“Nah, I’ve got Jackson for that,” Danny says lightly, and Stiles can’t help but crack a wry smile, bumping Danny’s shin with the heel of his foot.</p>\n<p>“I’m serious,” Stiles says. “You shouldn’t - you’ve got Caroline and Parker - ”</p>\n<p>“I know,” Danny says. His voice is very quiet. “I know, I do. I just wanted to... I just wanted. Even if it was only this once. Is that okay?”</p>\n<p>“Yeah,” Stiles says, and the thing is, he really does feel okay about it. A little achy, maybe, deep down, to have done this with Danny once and know they’re not going to be doing it again, but overall, it’s okay. They can still be friends, Stiles thinks, because that’s something else entirely. It’s not this closeness, not this warm, heavy contentment, bodies pressed close together and intertwined; friendship doesn’t have to entangle the way a relationship would. It can, of course, if you let it, but it doesn’t have to.</p>\n<p>“Besides,” Danny says, and to Stiles’ surprise, he can hear a smile in his voice. “I can’t compete with the fact that Derek Hale really wants to put his dick in you.”</p>\n<p>“Oh - <i>dude</i>!” Stiles splutters, his entire body lighting up with a hot, brutal blush. Danny’s chuckling behind him, that <i>asshole</i>, and when Stiles tries to wiggle away, Danny just holds him even tighter, not letting him gain an inch.</p>\n<p>“Sorry, sorry,” Danny says, still laughing. “Geez, calm down, we’ll talk about that later. You’re all mine tonight, anyway, okay?”</p>\n<p>Stiles resists answering for as long as he can, but he caves when Danny starts to skim kisses along the nape of his neck and up underneath his ear. “Fine, yeah,” he says, letting himself settle back comfortably against Danny’s chest. “For tonight.”</p>\n<p>He falls asleep almost as soon as he lets himself relax, Danny’s breath soft and steady against his skin.</p>\n<p></p>\n<p>*</p>\n<p>Stiles’ mouth falls open, some half-assed explanation ready to spill out, but his dad gives a firm shake of his head, points to Stiles, then downstairs, and holds up five fingers. He doesn’t wait for a response, and Stiles winces as he listens to the heavy tread of his dad’s footsteps, all the way down the steps.</p>\n<p>Danny is still asleep, chest rising slowly with each deep breath, and Stiles doesn’t have any interest in bringing him along to the conversation that’s about to happen, so he carefully disentangles himself from Danny’s sprawling limbs, then slips as quietly as he can out of bed. He pulls on the first t-shirt he sees, one that he’d left hanging off the back of his computer chair, and creeps downstairs.</p>\n<p>His dad’s already sitting at the kitchen table, a glass of water and two pills in front of the empty chair clearly meant for Stiles.</p>\n<p>“Take those,” his dad says, nodding toward the pills, “and then you and I are finally going to have that chat we’ve been putting off.”</p>\n<p>Stiles doesn’t even try to argue; he just slips into the chair, knocks the pills back and takes a long, slow pull of water before finally setting his glass down.</p>\n<p>“So, I’m bisexual,” he says, not quite managing to meet his dad’s eyes. It isn’t his fault the grain of their kitchen table spirals out in a really interesting pattern.</p>\n<p>He does startle a bit, head jerking up, when he feels his dad’s hand settle heavily on his shoulder. “And I’m fine with that,” his dad says seriously, gaze completely focused on Stiles’ face. “You know that, right?” He punctuates the question with a gentle squeeze, a small shake of Stiles’ shoulder. “I love you no matter what, kid.”</p>\n<p>“Yeah,” Stiles says. His voice, shockingly, is hoarse, and he forces a swallow, clears his throat. He can’t quite believe how much lighter his shoulders feel, how much less constricted his chest is, just hearing those words out loud. It’s not like he hadn’t <i>known</i> his dad would be all right with it, but... it’s good to actually hear it. To know for certain. “Yeah, I do. Love you, too.”</p>\n<p>“Good,” his dad says, and then his gaze sharpens. “Now let’s talk about how I found two sets of clothes in the bathroom last night and Danny Mahealani in your bed this morning.”</p>\n<p>Stiles spends a brief moment panicking about the shirt he’d so carelessly thrown into the trash can last night, but after a second, he convinces himself that his dad would have led with that before anything else. Hell, if his dad had found that shirt, he’d have charged into Stiles’ bedroom when he got home last night, demanding an explanation. As it stands, he probably peeked into the bathroom, made a pissy face, then left the mess for Stiles to clean up.</p>\n<p>His dad’s staring at him expectantly, eyebrows just shy of forming an actual frown, and Stiles wets his lips, squares his shoulders. “He came over last night to check on me,” he says, figuring it’ll be simplest to stick as close to the truth as possible. “To just - you know. See if I was okay.”</p>\n<p>“Is he your boyfriend?”</p>\n<p>“No,” Stiles says, shaking his head. “We’re just friends. Last night was sort of - he - look, neither of us really needs a detailed explanation, right?” Stiles asks, a bare note of desperation creeping into his voice. “You don’t want to hear that, I don’t want to say it, so let’s just leave it at, we weren’t doing anything stupid. Can’t we just do that?”</p>\n<p>Stiles can feel that his face is blotchy and pink by the time he’s finished, though his dad is looking awfully red as well.</p>\n<p>“I’m buying you condoms,” his dad says a moment later, and Stiles manfully resists the urge to cover his face in his hands.</p>\n<p>“<i>Dad</i>!”</p>\n<p>“I am buying you condoms, and I am not saying that I want you to have to use them, or that I <i>condone</i> you doing anything that requires them, but I’d like for you to have them if you need them,” his dad says, and yep, he might be even redder than Stiles is. “But I don’t actually want you to need them, you’re still a kid,” he finishes, pointing a stern finger at Stiles. “Understood?”</p>\n<p>“Oh God, kill me now,” Stiles groans, burying his face in his elbow. </p>\n<p>“Stiles - ”</p>\n<p>“Yes, yes, I understand!” Stiles exclaims, lifting his head back up. “No more of this talk, never - <i>please</i>. I’ll make you bacon for breakfast if you promise we don’t ever have to speak of this again.”</p>\n<p>His dad looks hilariously torn between the promise of bacon and the desire to be a good parent. “So long as you’re smart,” he finally says. “And safe. All right?”</p>\n<p>Stiles thinks about how, in the big scheme of things, last night with Danny was downright innocent, and then he thinks about all the other things he’s doing, the things that aren’t safe at all, and the guilt hits him hard and fast. “I - yeah,” he agrees, forcing the spike of shame away. That’s to deal with later, something he’ll get to eventually, but it doesn’t belong here, not in this moment. “Yeah, I’ll be smart. And safe.”</p>\n<p>There’s a long stretch where his dad just looks at him, like he’s weighing the sincerity of Stiles’ promise, but he finally sighs, apparently satisfied, and reaches out to run a hand through Stiles’ hair.</p>\n<p>“I’ll make the bacon, I’m not making you cook with a broken wrist,” he says as he stands up. His voice is gruff, but fond, a warmth underneath his words. “How’s the injury today?”</p>\n<p>“It’s okay,” Stiles says. “I’m okay.”</p>\n<p>It makes him smile, a little bit crookedly, because that, at least, is the truth. He doesn’t have everything figured out yet, not by a longshot, but he’s doing okay, and okay feels pretty good.</p>\n<p>“Good,” his dad says, and when Stiles gets to his feet, his dad drags him into a tight hug, presses a kiss to Stiles’ temple. Stiles allows it, sinks happily into his dad’s embrace, strong and sure and comforting.</p>\n<p>“Go tell Mahealani to get his ass down here if he wants breakfast,” his dad says as he finally lets Stiles go. Stiles grins at him, flush with a mixture of embarrassment and contentment. </p>\n<p>“Yeah, all right,” he says.</p>\n<p>“And kindly remind him that I am the Sheriff and if I stumble across another unauthorized sleepover, I’ll arrest him for breaking and entering,” he calls after Stiles, who’s already loping up the stairs. It surprises a laugh out of Stiles, short and bright, and when he makes it back to his room, Danny’s already sitting up in bed, tangled in Stiles' sheets, looking confused and a little bit wary.</p>\n<p>“Stiles?” he asks, rubbing at his eyes, and Stiles' smile widens.</p>\n<p>“Come on,” Stiles says, feeling better - lighter - than he has in a long, long time. “Breakfast.”</p>"
}