{
  "id": "5277863",
  "url": "https://archiveofourown.org/works/5277863?view_full_work=true",
  "author": [
    "MirreRover (orphan_account)"
  ],
  "title": "Our Red Scarf (Keep Me Warm)",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS",
    "K-pop"
  ],
  "relationships": [
    "Jeon Jeongguk | Jungkook/Kim Taehyung | V"
  ],
  "characters": [
    "Kim Taehyung | V",
    "Jeon Jeongguk",
    "Park Jimin (BTS)",
    "Jung Hoseok | J-Hope",
    "Min Yoongi | Suga",
    "Kim Seokjin | Jin",
    "Kim Namjoon | Rap Monster"
  ],
  "additional_tags": [
    "Alternate Universe - College/University",
    "Fuckbuddies",
    "Angst and Feels and Humor",
    "Shameless Smut",
    "AKA",
    "Explicit Sexual Content",
    "Explicit Language",
    "so much explicit language",
    "Bad boy Jeongguk",
    "and so many other cliches because I kind of live for that stuff"
  ],
  "language": "English",
  "series": "",
  "published": "2016-01-10",
  "completed": "2016-02-25",
  "words": "42,212",
  "chapters": "9/9",
  "comments": "869",
  "kudos": "17,882",
  "bookmarks": "4,801",
  "hits": "332,828",
  "summary": "<p>Jeongguk is trouble. Taehyung likes trouble a bit more than he probably should.</p>\n<p>Just don't tell Jimin about it.</p>",
  "notes": "<p>Welcome to the fic that changes title every month because the author is <b><i>fickle</i></b>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p align=\"justify\">I really only meant this to be a one-shot, I would have written it differently if it was going to be a multi-chaptered fic, and I probably still should.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p align=\"justify\">Well, too many words consisting only of angst and smut. What am I even writing?</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p align=\"justify\">Listen to <a href=\"https://www.youtube.com/watch?v=3vS8NNZsmUc\" rel=\"nofollow\">this</a> with me and lets drown in our emo-ness together.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p align=\"justify\"> 95 line for life.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_8_endnotes\">notes</a>.)\n</p>\n<p align=\"justify\"> Credits to both Robert Frost.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p align=\"justify\">Well, that's it. It's finally done. I hope you guys enjoyed it.</p>\n<p align=\"justify\">I'd love to know what you think, good or bad, so please leave a comment. </p>\n<p align=\"justify\">Feel free to visit my <a href=\"https://mirrerover.tumblr.com/\" rel=\"nofollow\">tumblr</a> for questions or to rant about Taekook.</p>",
  "text": "<p align=\"justify\">Taehyung draws his oversized sweater a little closer to his body. The weather is colder than he’d expected, temperatures dropping quickly now that the sun has set and the campus is engulfed in darkness. Or it would have been if there wasn’t a lamp post every two feet. Campus security is no joke.</p>\n<p align=\"justify\">His nose already feels frosty and his fingers are beginning to follow suit, so he buries them deeper in the yellow sleeves. Jimin likes to say that the colour reminds him of stale mustard but Taehyung refuses to acknowledge that the garment looks anything other than sunshine yellow. His best friend had solemnly shaken his head and said, <em>‘I can’t believe you manage to get laid looking like that,’</em> as Taehyung had exited their dorm room earlier.</p>\n<p align=\"justify\">Jimin knows what Taehyung’s objective is for the evening. He knows Taehyung is meeting up with someone to destress after midterms, and essays, and endless experiments with lab equipment that seems to be designed solely for the purpose of thwarting all his scientific ambitions. His best friend knows it’s someone who can get Taehyung down on his knees, begging for more. That much Taehyung had divulged over cheap drinks and anime. Jimin just doesn’t know who this person is. It wasn’t like Taehyung had explicitly lied about Jeongguk; he just hadn’t been very forthcoming about his identity either, leaving Jimin to assume it’s someone he doesn’t know.</p>\n<p align=\"justify\">Taehyung prefers to think of it as creative story telling.</p>\n<p align=\"justify\">Pushing thoughts about the moral ambiguity of his actions to the back of his mind, Taehyung turns a corner and the artificial lightning begins to thin out. He still doesn’t know how Jeongguk can afford to live in an apartment by himself just off campus. The situation does nothing but feed into all the bad rumours that are going around about him and his penchant for body decoration doesn’t help with that either. The girl with the big eyes and loose lips sitting in the back of one of Taehyung’s microbiology classes had once let it slip that Jeongguk was said to be part of a gang. Another had whispered he’d send a man to the hospital once. Taehyung himself suspects that Jeongguk is a stereotypical rich brat with a chip on his shoulder, trying to rebel against the status quo, nowhere near as dangerous as the stories depict him to be. But that’s just a guess. They don’t talk about things like that.</p>\n<p align=\"justify\">Despite the nature of their relationship, most of Taehyung’s information concerning Jeongguk is second-hand. Most of it actually comes from Jimin. Jeongguk and Jimin are members of the same dance team and the bad boy has been the bane of Jimin’s existence ever since he joined. Jeongguk has perfected his irreverent teasing of Taehyung’s best friend to a level that can only be described as art. It’s the reason Taehyung hadn’t told Jimin about his meetings with Jeongguk.</p>\n<p align=\"justify\">It’s probably the reason they were happening in the first place.</p>\n<p align=\"justify\">As Taehyung walks down the street, his destination now only a few buildings away, he thinks about the first time he’d talked to Jeongguk. He’d been to enough showcases and listened to enough of Jimin’s exasperated rants to recognize him when Jeongguk approached him in a bar off campus.</p>\n<p align=\"justify\">Taehyung should have probably turned him down but (with alcohol in his system and the vision of a young god in front of him) the words had come out like a flirtatious invite instead, <em>‘I don’t think I’m allowed to talk to you. I heard you’re the devil’s spawn.’</em></p>\n<p align=\"justify\">If Jeongguk had been surprised by Taehyung's statement, he hadn't shown it. He’d merely flashed him a smirk that Taehyung has become all too familiar with over the past weeks. <em>‘I see my reputation proceeds me. Who’s been spreading the gospel of Jeon Jeongguk?’</em></p>\n<p align=\"justify\">Taehyung had found himself returning Jeongguk’s grin. <em>‘Jimin. Your wicked ways are all he ever talks about.’</em></p>\n<p align=\"justify\">That was the first time Jeongguk’s laughter ringed in his ear and Taehyung had known instantly that it would be so difficult to stay away from him. Jeongguk’s demeanour had been perfectly in sync with Taehyung’s; the game of push-and-pull played out so perfectly between them. When Jeongguk’s warm hands slipped under his shirt at the end of the evening as his tongue conquered Taehyung’s mouth, Taehyung no longer had the will power to resist.</p>\n<p align=\"justify\">That’d been the first evening Taehyung had gone home with Jeongguk.</p>\n<p align=\"justify\">By now the door in front of him is almost as familiar as his own. Taehyung raps his knuckles on the wood in rapid succession, eager to get out of the cold and against Jeongguk’s body.</p>\n<p align=\"justify\">It seems like forever before the door opens and Jeongguk leans against the doorpost in all his broad-shouldered glory. Dressed in just his sweatpants, Taehyung can admire the wide planes of his chest and the strong curves of the muscles in his arms, covered with intricate swirls and foreign lettering. Taehyung assumes the tattoos are all supposed to have a deeper meaning but, who knows, maybe they're just misspelled song lyrics instead. Still, the sight never fails to create heat in his abdomen.</p>\n<p align=\"justify\">Jeongguk smirks knowingly; a seductive curl of the lips that’s both arrogant and alluring. Jimin calls it the devil’s smile and it does look sinfully good on him in Taehyung’s humble opinion. But the smirk has to part for words to pass through, “no scarf and sunglasses this time?”</p>\n<p align=\"justify\">“I swear someone was watching me that time. Following me.” Taehyung doesn’t wait for a spoken invitation but squeezes in past Jeongguk. “You know Jimin would kill me if he found out.”</p>\n<p align=\"justify\">The door falls close behind them, shutting out the cold. “Who would ever want to spy you?”</p>\n<p align=\"justify\">“You would,” Taehyung teases. “You positively worship my ass.”</p>\n<p align=\"justify\">Jeongguk scoffs, “I don’t have to spy on you. You’re always coming to me first, so who’s worshiping who exactly?”</p>\n<p align=\"justify\">Taehyung decides an argument about who of them is thirsting for it the most is a waste of precious time, so he shoots Jeongguk a playful wink instead. “I think we all know I’m your dick’s most devout follower.”</p>\n<p align=\"justify\">Jeongguk's face lights up a little at that comment and the threat of a petty argument is successfully avoided. Taehyung turns to toe out of his shoes but he can still tell Jeongguk is coming up behind him before he's even wrapped an arm around his waist.</p>\n<p align=\"justify\">Strong hands push aside the fabric of Taehyung’s sweater without hesitation, the touch already deliciously demanding, as Jeongguk’s hot breath tickles the sensitive skin of his neck. Taehyung has only been inside for a few minutes but he can already feel himself growing hard. The effect Jeongguk always has on his body borders on downright petrifying.</p>\n<p align=\"justify\">Jeongguk pulls him against his chest, Taehyung’s ass lining up perfectly with his crotch, and it becomes clear that Taehyung isn’t the only one who’s excited. Soft lips tease the crook of Taehyung’s shoulder followed by a soft bite and soothing swipe of a tongue. It is sure to leave a mark and Taehyung knows it’s merely the first of many.</p>\n<p align=\"justify\">The knowledge sends a shudder down Taehyung’s spine and his body begins to burn, the outside cold already a distant memory.</p>\n<p align=\"justify\">“I think I might need you to prove your devotion to my dick, <em>baby</em>,” Jeongguk murmurs right below his ear. Taehyung can’t stop his breath from hitching when Jeongguk sucks the lobe into his mouth.</p>\n<p align=\"justify\">He knows Jeongguk is deliberate in his use of the word <em>baby</em> as a pet name.  Jeongguk uses it because he gets off on the fact that Taehyung is older but pliant under his forceful touch. He uses it because he’s an insolent brat just like Jimin always says he is. Taehyung can’t help but find it amusing.</p>\n<p align=\"justify\">“Anything for you, Gukkie,” Taehyung promises in breathy tones; an obvious lie but it doesn’t fail at making Jeongguk groan and rock his hips into him with a blatant eagerness.</p>\n<p align=\"justify\">Impatient, Jeongguk turns Taehyung in his grip so he can collide their lips together. There’s an almost frantic hunger in the way Jeongguk kisses him, a desperate need in how his hands roughly clutch at Taehyung’s waist to direct him towards the bedroom. It makes Taehyung feel weak in the best possible way. He suspects it makes Jeongguk feel strong and in control.</p>\n<p align=\"justify\">Breaking their kiss to come up for air, Jeongguk makes quick work of the sweater, muttering something about it being <em>‘hideous’</em> under his breath. Taehyung takes offense to that and nips on Jeongguk's bottom lip. The hands on Taehyung’s ass tighten briefly in retribution, the sensation just south of painful. “Play nice, <em>baby</em>.”</p>\n<p align=\"justify\">“Or what?” Taehyung’s teasing challenge makes Jeongguk’s eyes grow even darker. This is a dangerous game he’s playing, Taehyung knows that, but he’d always felt things were most exciting when the stakes were high. The dangerous games are the fun ones. He takes in the tattoos he loves to run his fingers across, the piercings he always aches to tug at with his teeth, the lean muscles that can hold him with so much strength. Jeongguk is trouble. Taehyung likes trouble a bit more than he probably should.</p>\n<p align=\"justify\">With a growl, Jeongguk pulls off Taehyung’s remaining shirt, leaving them both naked from the waist up. He then meshes their lips together again with enough conviction to make Taehyung believe he never plans on separating them ever again.  </p>\n<p align=\"justify\">Jeongguk tastes sweet, intoxicating. It’s like a drink Taehyung can never get enough of. He can’t believe he’s become so addicted in merely a few weeks. Trouble. Jeongguk is trouble. He’s trouble in the way he skilfully seizes control of Taehyung’s mouth, leaving Taehyung panting for more.</p>\n<p align=\"justify\">Even with their lips locked, they manage to find their way through the apartment and into Jeongguk’s bedroom, hands constantly groping at naked flesh. Taehyung revels in the way he can feel Jeongguk’s muscles flex beneath his skin. He feels so good to the touch.</p>\n<p align=\"justify\">Jeongguk’s fingers start fiddling with Taehyung’s belt but he groans in frustration when it won’t give. Patience is never Jeongguk’s strong suit during their hook-ups. At least not during the first round. Taehyung snickers but takes pity on him, his long fingers travelling downwards to undo it himself. When he’s finished, Jeongguk slips his hand in without hesitation and wraps it around Taehyung’s dick. “Fuck, you’re so hard already.”</p>\n<p align=\"justify\">Taehyung gasps when Jeongguk starts tugging experimentally, a calloused thumb teasing at the slit before moving downwards, pre-come facilitating the glide. Taehyung mouths at Jeongguk’s jaw as Jeongguk works him, moving lower and down Jeongguk’s neck, biting his shoulder when Jeongguk flicks his wrist in just the right way. With one hand, Taehyung palms Jeongguk’s dick through the fabric of his sweatpants. “Could say the same about you, Gukkie.”</p>\n<p align=\"justify\">Taehyung gives Jeongguk a teasing squeeze as if to prove his point and is rewarded with a guttural groan. The heat in Taehyung’s belly intensifies. He sinks to his knees, taking Jeongguk’s sweatpants with him, determined to prove his devotion like Jeongguk had requested earlier. Jeongguk’s dick looks like it’s dying for affection, just like Taehyung imagines his own does.</p>\n<p align=\"justify\">Normally, Taehyung might try and tease Jeongguk a little more, he does love to torment him, but tonight the need to taste Jeongguk is too strong. He briefly kisses the tattoo on Jeongguk’s hipbone after which he takes him between his lips with a wink. He gives the head a quick suck and smoothly swallows Jeongguk deeper, savouring Jeongguk's taste on his tongue. It’s slightly salty and bitter but at the same time sweet and irresistible.</p>\n<p align=\"justify\">Taehyung knows a lot of people hate it but he loves sucking dick. He might be the one on his knees but the gorgeous man in front of him is the one at Taehyung’s mercy. He can tell by the way Jeongguk’s hips buck and his dick twitches in his mouth.</p>\n<p align=\"justify\">One hand on Jeongguk’s hip and the other at the base of his dick, Taehyung settles into a slow rhythm. He watches Jeongguk as he drags his tongue across a sensitive vein and seeing the pleasure on Jeongguk's face is so utterly gratifying. But Taehyung only has the chance to do it two times before he can feel Jeongguk’s fingers twist in his hair, pulling him off.  </p>\n<p align=\"justify\">“Not like this.” Jeongguk nods towards the bed. Taehyung’s insides tighten with unbridled want.</p>\n<p align=\"justify\">Discarding the last of his clothes, Taehyung makes his way over and Jeongguk is quick to follow his good example. The state of the bed is not unexpected but it still amuses Taehyung. A bottle of lube and a few unopened condom wrappers are strewn across the duvet, obviously thrown on there without care.</p>\n<p align=\"justify\">Taehyung crawls onto the bed with a chuckle, settling on his shins. “You’re such a romantic, Jeonggukkie.”</p>\n<p align=\"justify\">“At least I bring condoms to the party —” Taehyung opens his mouth to protest but Jeongguk knows better than to give him the time to do so “— Condoms that aren’t <em>Glow in the Dark</em> or<em> Banana Flavoured</em>.”</p>\n<p align=\"justify\">As Jeongguk settles on the bed behind him, Taehyung picks up one of the packages for closer inspection. “<em>Ultra Thin Feel</em>. How uninspired.”</p>\n<p align=\"justify\">“But I like them, baby.” Jeongguk wraps two possessive arms across his waist and pulls him closer until Taehyung’s back sits flush against his chest. It causes Jeongguk’s dick to settle between the cheeks of his ass, still wet with his saliva, and Taehyung can’t help but roll his hips back into it. The grip on his waist tightens. “I like how they let me feel every ridge of you when I fuck into you.”</p>\n<p align=\"justify\">The way the dirty words are breathed near his ear makes Taehyung shiver. Desire starts to coil in his stomach, the heat from before blazing back to life. Suddenly, Taehyung is no longer interested in looking at the condoms, he wants to start using them already. “When you put it like that, it does sound nice.”</p>\n<p align=\"justify\">Jeongguk hums in agreement and reaches around him for the lube. When the bottle cap snaps open, Taehyung experiences an almost visceral response; a tremor shaking his body in anticipation. It only gets worse as Jeongguk’s finger begins to tease his entrance and it doesn’t stop until the digit slides in easily, meeting almost no resistance. Taehyung immediately rocks back on it. He’s so hungry for it.</p>\n<p align=\"justify\">“Fuck,” Jeongguk curses in a coarse voice. “What have you been getting up to before you came over?”</p>\n<p align=\"justify\">A second finger joins the first one, making Taehyung keen. “I-I got impatient, so I gave myself a head start.” What he doesn’t say is how Jeongguk had been on his mind the entire time Taehyung finger-fucked himself in the shower earlier that evening.</p>\n<p align=\"justify\">Jeongguk groans behind him. The digits curl and twist expertly, causing white hot sparks to flicker up Taehyung’s nerve endings. “How did it feel when you were touching yourself? Did it feel good, <em>baby</em>? Did it feel like this?” There's an almost jealous edge to Jeongguk’s voice.</p>\n<p align=\"justify\">“No,” Taehyung confesses with a moan. “You feel better. So-so much better.”</p>\n<p align=\"justify\">Jeongguk grunts in approval, appeased by the idea of outdoing Taehyung’s own fingers. If Jeongguk wasn’t tormenting his body with sharp stabs of pleasure, Taehyung might have laughed at his competitiveness. With the situation being as it is, he releases a series of desperate moans instead.</p>\n<p align=\"justify\">Jeongguk begins to place to soft bites and wet kisses along Taehyung’s shoulders and neck as he works him open. Taehyung knows he’ll probably be covered in them by the time the night is through because, for some reason, Jeongguk is never satisfied until Taehyung looks like his personal work of art. Taehyung reaches one arm over his head to clutch at Jeongguk’s hair, silently asking for more.</p>\n<p align=\"justify\">Jeongguk moves one arm around him to start stroking Taehyung’s dick again, using a hand Taehyung suspects he'd been touching himself with just seconds earlier. Distracting Taehyung with his tugging, Jeongguk slips a third finger in. It stings in the most delicious manner. Movements faltering for only a second, Taehyung’s body readily accepts that digit as well.</p>\n<p align=\"justify\">Taehyung knows he could come like this, <em>would</em> come like this very soon if they didn’t stop, but he doesn’t want it this way. Jeongguk’s hand and fingers are not enough. Taehyung craves more. He tightens his grip on Jeongguk’s hair. “I’m ready, Gukkie. I’m ready.”</p>\n<p align=\"justify\">It’s all the encouragement Jeongguk needs. His hands still their administrations, the loss making Taehyung whimper, and move to Taehuyng’s back, pushing him down towards the mattress until Taehyung is on his hands and knees. Jeongguk doesn’t ask if it’s okay like this, they're past that point. After several weeks, Jeongguk knows how Taehyung likes it. Except there’s a softness behind the forceful touch that Taehyung rather not think about.</p>\n<p align=\"justify\">The sound of a plastic wrapper being torn open is there to distract him.</p>\n<p align=\"justify\">Taehyung doesn’t turn to look but he knows when Jeongguk is rolling on the condom. He knows when Jeongguk lubes himself up. He can tell by all the little sounds that escape Jeongguk’s mouth as he’s touching himself. Those sounds haunt Taehyung in his dreams. He thinks about them all the time.</p>\n<p align=\"justify\">Jeongguk pushes in with a swift but steady thrust and the stretch his dick provides makes white spots flash behind Taehyung’s closed eyelids. Taehyung almost sobs with how good it feels. The sensation never disappoints. Jeongguk never disappoints. Even as Jeongguk is still for a moment, giving Taehyung time to adjust, Taehyung’s body seems to buzz with pleasure and he immediately pushes back, trying to take Jeongguk deeper.</p>\n<p align=\"justify\">“Fuck, you take it so well, baby.” Jeongguk’s strained praise is like music and Taehyung wants to hear more. He needs to hear more.</p>\n<p align=\"justify\">They settle into a rhythm, Jeongguk’s hands caressing his sides, pulling him closer every time he pushes in. Taehyung eagerly obliges by rolling his hips back to meet his every stroke. All the while, Jeongguk keeps singing his appreciation in soft murmurs, “You look so good like that, baby. So pretty. So fucking good.”</p>\n<p align=\"justify\">It takes just a few thrusts before Jeongguk finds his prostrate and Taehyung keens while letting his head drop down onto the pillow to let him know just that. Jeongguk doesn’t miss the hint and makes sure every next push hits Taehyung exactly where he needs it the most. Jeongguk can touch him so deep like this, fucks him so well from behind. The waves of heated pleasure are rolling over Taehyung; he just wishes there were more.</p>\n<p align=\"justify\">“Faster.” Taehyung can hardly recognize his own voice, cracked and splintered with lust.</p>\n<p align=\"justify\">Jeongguk groans in response and his fingers grip Taehyung’s hips in a vice-like clutch, leaving even more marks. Marks Taehyung treasures.</p>\n<p align=\"justify\">The bucking of Jeongguk’s hips builds up, the plunging of his dick in Taehyung’s body almost punishing. Like Taehyung had wanted, the waves of pleasure increase in number. He’s beginning to drown in what Jeongguk is doing to him.</p>\n<p align=\"justify\">There’s only Jeongguk and the sounds they’re making and his sweat slicked skin against Taehyung’s body as they move together. The bed cracks and protests under Jeongguk’s forceful thrusts but Taehyung loves the obscene sounds. The coil of heat and want and ecstasy in his stomach just keeps constricting further and Taehyung knows he’s so close. He can already feel his toes curl in bliss.</p>\n<p align=\"justify\">Jeongguk must have sensed as much. “Are you going to come, baby?”</p>\n<p align=\"justify\">“Yeah,” Taehyung chokes out between hoarse cries.</p>\n<p align=\"justify\">Jeongguk stills suddenly, a hand moving to squeeze around Taehyung’s dick. “Not yet. Not until I say so.”</p>\n<p align=\"justify\">Taehyung feels a familiar mixture of emotions take hold of him. A part of Taehyung hates Jeongguk for denying him his orgasm but a larger part of him loves the delayed gratification Jeongguk is subjecting him to. But then Jeongguk completely slips out of his body and Taehyung’s scale of emotions immediately tips in favour of strong dislike.</p>\n<p align=\"justify\">“<em>Jeongguk.</em>” The neediness is unmistakable. It’s a desperate plea disguised as a name.</p>\n<p align=\"justify\">“Get on your back.” But before the words finish leaving Jeongguk’s mouth, he’s already succeeded in turning Taehyung over.</p>\n<p align=\"justify\">Jeongguk makes sure to lock their eyes together as he slides back in Taehyung’s body. Trouble. Jeongguk is trouble. The obsidian eyes are like magnets; Taehyung can’t look away.</p>\n<p align=\"justify\">The new position provides a whole new level of intimacy. A level Taehyung isn’t quite sure he can take but when Jeongguk’s mouth is upon his own, those thought disappear like they were never there to begin with. Taehyung obligingly wraps his legs around Jeongguk’s waist as they settle into a slower rhythm than before.  </p>\n<p align=\"justify\">But Jeongguk still pushes so deep inside his body. Still fucks him so well even like this. Taehyung clutches at Jeongguk’s hair as the waves of heat are back, rakes his nails across Jeongguk’s tattooed back as Jeongguk moves within him like he’s robbing Taehyung of everything he has. Jeongguk is trying to steal something with his kisses. Something precious; Taehyung just knows he is.</p>\n<p align=\"justify\">Before Taehyung can determine what he's lost to Jeongguk, the coil in his abdomen bursts and his orgasm finally hits him. It makes Taehyung’s head roll back against the pillow, his eyes rolling back even further, whimpers he didn’t even know he could make filling the air.</p>\n<p align=\"justify\">But Jeongguk only stills for a minute, Taehyung’s climax so strong he can’t move for a short while, and picks up his pace again. The sensation of Jeongguk fucking into him is so intense when Taehyung is still riding the aftershocks of his release. It’s too much. Taehyung deeply regrets not sucking Jeongguk off for longer. He weakly pushes on Jeongguk’s shoulders, knowing it’s futile. “Fuck, don’t do this to me, Gukkie. You can’t do this to me.”</p>\n<p align=\"justify\">Like he'd been waiting for Taehyung’s desperate pleas, Jeongguk’s hips begin to stutter and falter, finally reaching his orgasm as well. Taehyung’s body is wrecked with a quiver when Jeongguk groans in his ear as he comes, another when Jeongguk swells inside of him, and a final one when Jeongguk ultimately slips out of his body.</p>\n<p align=\"justify\">Taehyung immediately misses Jeongguk’s weight when he rolls off him. He feels he should say something, something to burst the bubble. He settles on a sighed, “your dick has wrecked me.”</p>\n<p align=\"justify\">Taehyung can practically see Jeongguk’s chest swell with pride upon hearing his praise and grins a sly smile he doesn’t let Jeongguk see. Bad boys and their easily inflatable egos.</p>\n<p align=\"justify\">For a while, the only sounds between them is their breathing returning to normal. The blood rushing in his ears is replaced by a wonderful mellow feeling. Suddenly, Taehyung’s midterm stress and essays and lab experiments seem like things that never even happened. He isn’t sure if he even remembers what he’s majoring in at the moment. Biology something.</p>\n<p align=\"justify\">Eventually, Jeongguk gets up to dispose of the condom and to fetch them a towel. He helps clean up the mess on Taehyung’s stomach when Taehyung still feels a bit too hazed and blissed out to move. After unceremoniously dumping the towel on the floor, the laundry basket standing merely three feet away, Jeongguk is back at his side.</p>\n<p align=\"justify\">Taehyung vaguely registers Jeongguk starting to play with his hair. The sensation is far too pleasant. If he isn’t careful, it might lull him to sleep.</p>\n<p align=\"justify\">“Did everything work out okay with that lab project you had to do?” Jeongguk’s question catches him off guard, Taehyung didn’t expect Jeongguk would remember something he’d once merely mentioned in passing.</p>\n<p align=\"justify\">“It turned out okay in the end.” Taehyung trails the outline of the tattoo on Jeongguk’s hipbone with a single finger. It’s Taehyung’s favourite one because whenever he licks it, Jeongguk goes mad. “The Professor says he is going to deduct some points, though.” His finger reaches the lowest line of inked skin and the muscles in Jeongguk’s abdomen contract in the most mouth-watering way. “Because he caught me roasting squid jerky over a Bunsen burner one evening. Apparently I’m not allowed to use the university’s equipment in such a disrespectful manner.”</p>\n<p align=\"justify\">Jeongguk snorts rather un-sexily upon hearing that confession. His bad boy persona cracks and evolves into something else; something bordering on cute and adorable. It reminds Taehyung vaguely of a bunny and suddenly Jeongguk looks his age. Moments like these don’t feed into burning in the lower pit of Taehyung’s stomach but hit Taehyung higher. They make his heart thump violently in his chest. Jeongguk is trouble. Trouble indeed.</p>\n<p align=\"justify\">It scares Taehyung more than he would like to admit. “I should go and get back to my dorm before the temperature outside drops below cold as fuck.”</p>\n<p align=\"justify\">Jeongguk watches him get up and pull on the clothes they’d left all over the bedroom floor. He looks unfazed by Taehyung’s abrupt departure but it’s not like shouldn’t be used to it by now. Shimming into his sweatpants, Jeongguk follows Taehyung out into the hallway. “Maybe you could stand the cold a little better if you'd put on a proper coat instead of that mustard monstrosity.”</p>\n<p align=\"justify\">Taehyung huffs as he pulls the garment in question up off the floor and over his head. “I look like an adorable ray of sunshine in this sweater and don’t you even try to deny it.”</p>\n<p align=\"justify\">As they make their way to the door, Jeongguk laughs in a way that shows he clearly disagrees with that statement.</p>\n<p align=\"justify\">When Taehyung turns to toe back into his shoes, he feels something soft being draped around his shoulders. The scent of Jeongguk’s cologne invades Taehyung’s nostrils as his fingers toy with the new addition to his outfit. It’s like a punch to the gut. Taehyung’s questioning eyes flicker from the red scarf to Jeongguk’s face.</p>\n<p align=\"justify\">“It’s an old one. You can bring it back next time.” Jeongguk looks almost as surprised by his actions as Taehyung is.</p>\n<p align=\"justify\">“Thanks.”</p>\n<p align=\"justify\">The unexpected moment of care is followed by an awkward silence. Taehyung is about to make a silly remark to try and salvage the situation but Jeongguk beats him to it, “Say hi to Jimin for me.”</p>\n<p align=\"justify\">“You know I won’t.”</p>\n<p align=\"justify\">“Hmm, that’s right, I’m your dirty little secret.” Jeongguk smirks but Taehyung can’t tell how sincere it is. On the surface it looks like he enjoys being someone’s dirty secret just as much as Taehyung pretends he likes to keep them.</p>\n<p align=\"justify\">Taehyung decides to make an effort for his best friend and raises an eyebrow. “Now that we are on the subject of Jimin, stop being a cocky brat and start calling him hyung. He’s older than you and if I have to listen to him complain about you one more time, I’ll probably go crazy.”</p>\n<p align=\"justify\">Jeongguk easily dismisses Taehyung’s instructions with a wave of the hand. “What would be the fun in that?”</p>\n<p align=\"justify\">Taehyung figures he’d hereby tried and failed. Jeongguk would continue acting however he pleased and Jimin would have to deal with that problem on his own.</p>\n<p align=\"justify\">Just like Taehyung had invited himself in, he lets himself out by opening the door and stepping outside. Jeongguk leans against the doorpost and the entire situation is laughably similar to earlier in the evening. Except Jeongguk’s lips look a little swollen and his hair is messy from where Taehyung clutched at it and Taehyung assumes he looks similarly dishevelled.</p>\n<p align=\"justify\">The bunny that Taehyung had caught a glimpse of in the bedroom is long gone. At the moment, Jeongguk looks every bit the bad boy enigma but Taehyung can still feel his heart beating in erratic patterns.</p>\n<p align=\"justify\">“Text me.”</p>\n<p align=\"justify\">“Sure,” Jeongguk drawls with studied nonchalance, almost tipping over into indifference, but Taehyung knows he will. Jeongguk always texts.</p>\n<p align=\"justify\">Taehyung supresses the urge to press a goodbye kiss against Jeongguk’s lips and settles for a casual wave. When he turns and takes his first few steps towards home, he can hear Jeongguk’s apartment door closing behind him. The sound is unexplainably unpleasant.</p>\n<p align=\"justify\">Taehyung digs his nose into the scarf. More of Jeongguk’s scent fills his nose, familiar and capable of inducing an immediate tightening in his gut. Taehyung sighs. Deep down he knows he’s making a big mess of things and it would probably prove to be toxic in the long run. Sometimes, when it’s two in the morning and Taehyung still can’t sleep, he wonders if he’s using Jimin’s dislike of Jeongguk as an excuse. It’s easy to pretend something isn’t real if nobody knows about it. If you don’t tell anyone.</p>\n<p align=\"justify\">As the lamp posts around him increase in density, Taehyung resolves to finally spill the beans this time. To tell Jimin what has been going on and to see where that revelation will take him and Jeongguk. Just like he had the last time he came back from Jeongguk’s apartment in the dead of the night. And the time before that one.</p>\n<p align=\"justify\">Maybe this time he finally would.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">Taehyung never did tell Jimin. But he isn’t sure if he ever <em>really</em> thought he would.</p>\n<p align=\"justify\">Jeongguk did text him. It took him a longer time than usual to reach out and the location specified was unexpected but Jeongguk did text. Jeongguk always texts.</p>\n<p align=\"justify\">The light above Taehyung’s head begins to flicker, casting the hallway he’s walking down in an eerie glow. It probably does that during the day as well but now that it is almost midnight, the shaky illumination seems ominous. Taehyung always finds it exciting to be in one of the university’s buildings at night when it’s mostly empty. It feels illicit even at the times it isn’t, just like meeting up with Jeongguk does.</p>\n<p align=\"justify\">Taehyung turns the final corner and spots his destination. He could probably find his way to the dance studio in his sleep, Jimin had dragged him there to watch often enough, but recently he hadn’t visited any of the dance practices. Not since Jeongguk.</p>\n<p align=\"justify\">It’s the first time that Jeongguk has texted to meet him there after practice. When Taehyung had asked why, Jeongguk had send him one of his trademark succinct responses: <em>floor-to-ceiling mirrors. </em>After that, Taehyung didn’t need any more convincing.</p>\n<p align=\"justify\">The music coming from the inside makes Taehyung pause, one hand on the door handle. If Jeongguk is still practicing, it would mean he’s been at it for hours; first group practice and now on his own. That’s a lot of dedication for a bad boy who pretends not to give a fuck. Turning the handle as quietly as possible, Taehyung squeezes in unnoticed, locking the door behind him.</p>\n<p align=\"justify\">The sight of Jeongguk dancing is like a blow to the chest, taking all of Taehyung’s breath away. His moves are sharp, measured, angry. It’s not the same as watching Hoseok, Jimin or any of the other dancers. Watching Hoseok dance makes Taehyung happy, watching Jimin dance makes him proud. Watching Jeongguk dance just makes him burn. The way Jeongguk’s hair is stuck to his forehead, the way his skin shimmers under the artificial lightning, the way his tank top has grown damp, everything about him makes Taehyung burn. Jeongguk is trouble. So much trouble.</p>\n<p align=\"justify\">The graceful movements of Jeongguk’s limbs falter when he finally spots Taehyung in the mirror. He dances until the chorus ends before making his way to the stereo, muting the music and grabbing his water bottle. There’s something very enticing about the thirsty manner in which Jeongguk downs the drink.  </p>\n<p align=\"justify\">Taehyung starts to move away from the door, closing the distance, leaving his coat behind in a heap on the floor.</p>\n<p align=\"justify\">Jeongguk eyes him suspiciously. “How long have you been standing there?”</p>\n<p align=\"justify\">“Long enough. Is that for the next showcase?”</p>\n<p align=\"justify\">Jeongguk shakes his head. “Freestyle.”</p>\n<p align=\"justify\">“It’s good.”</p>\n<p align=\"justify\">Jeongguk casually bobs his shoulders as Taehyung reaches him, like he’s already well aware that he’s good and doesn’t need Taehyung to confirm it for him. Up close Jeongguk looks even better. At this moment, he embodies everything Taehyung supposedly hates; exercise and sweat, yet he still makes Taehyung burn.</p>\n<p align=\"justify\">Jeongguk doesn’t seem to return the sentiment, nose scrunching up in distaste. “What the fuck are you wearing this time?”</p>\n<p align=\"justify\">Taehyung looks down at his clothes; sweatpants like the one Jeongguk’s wearing, a customised baggy sweater, and socks in sandals. It’s his staple outfit on his off days. Sometimes on his normal days too. “They're my comfy clothes.”</p>\n<p align=\"justify\">“They’ve got holes in them.”</p>\n<p align=\"justify\">“I know. I put them there myself.” Taehyung flashes him one of his signature boxy smiles. He knows how to play cute. “It’s artistic.”</p>\n<p align=\"justify\">Jeongguk groans. “I swear you looked hot once. You were looking so fuckable when I picked you up at the bar that one time.” He shakes his head. “Where did things go wrong for you?”</p>\n<p align=\"justify\">“It’s not about what’s on the outside, Gukkie. It’s about what’s underneath.” Taehyung can see Jeongguk roll his eyes at the platitude.</p>\n<p align=\"justify\">Not the least bit discouraged, Taehyung presses up against him, finding his lips. Despite his obvious dislike of Taehyung’s clothes, Jeongguk’s response is instant, one arm wrapping around Taehyung’s waist as the hand on his other arm finds the nape of Taehyung’s neck. There’s desire and hunger on Jeongguk’s tongue as he explores Taehyung’s mouth. Jeongguk is always hungry. The kiss tastes salty, wet, but still sweet. In his current state, Jeongguk shouldn’t still taste so good.</p>\n<p align=\"justify\">Taehyung is the one to pull away first, tilting his head playfully. “And in my case that would be nothing, Gukkie.”</p>\n<p align=\"justify\">Jeongguk’s face lights up, interest piqued. He moves his hands down, fingers slipping under the waistband of Taehyung’s baggy sweats, and discovers Taehyung is speaking the truth. He gives the naked globes of Taehyung’s ass a slight pinch as he pulls Taehyung even closer. “Ugly or not, it does make for easy access.”</p>\n<p align=\"justify\">Taehyung grins. “I knew you’d like it in the end.”</p>\n<p align=\"justify\">Jeongguk smirks and it’s conceited but inviting at the same time. Taehyung can’t help but burn. Jeongguk’s eyes dart to the door. “Did you lock it?”</p>\n<p align=\"justify\">Taehyung nods.</p>\n<p align=\"justify\">“Good.”</p>\n<p align=\"justify\">Jeongguk pulls back to yank his tank top over his head, dumping it on the floor, and then his mouth is upon Taehyung’s again. He doesn’t kiss Taehyung like he’s been dancing for hours, there’s a fire behind it that makes Taehyung think Jeongguk could kiss him long enough to last until morning, but he feels and smells like he’s been dancing. Jeongguk’s skin is slippery under Taehyung’s fingers as he clutches at Jeongguk's broad shoulders, his scent is heavy as it enters Taehyung’s nose. Taehyung shouldn’t like it so much but he does. Trouble indeed.</p>\n<p align=\"justify\">Jeongguk cups his jaw, forcing him to look up. “Did you bring it?”</p>\n<p align=\"justify\">“Yeah, yeah.” Taehyung presses their lips together for another hungry kiss. “I brought it.”</p>\n<p align=\"justify\">Taehyung digs into the pocket of his sweatpants and dumps the content in Jeongguk’s outstretched hand. Jeongguk looks at the lube and condoms with a mixed expression. His small sigh hints at exasperation but the twitching at the corner of his mouth indicates amusement as well. “They’re red.”</p>\n<p align=\"justify\">“Of course they are, I got to pick, so I got us something fun for a change—” Jeongguk scoffs but Taehyung doesn’t let that deter him “—and why wouldn’t you like it? It’s your favourite colour, after all.”</p>\n<p align=\"justify\">Taehyung falls silent when he realises what he just said. Jeongguk raises an eyebrow. “What makes you say that?”</p>\n<p align=\"justify\">“It’s all you ever wear.” Taehyung shrugs his shoulders, feeling defensive although he isn’t exactly sure why. “Black, white, every shade of grey that comes in between, and red. Yet you have the balls to complain about my wardrobe.”</p>\n<p align=\"justify\">Jeongguk doesn’t talk, his black eyes boring into Taehyung’s, searching. It feels like such a long time. Then he shrugs, tension gone. “Ketchup beats mustard.”</p>\n<p align=\"justify\">It takes two whole seconds before the words sink in and Taehyung’s frame begins to shake with giggles. They sound hoarse in his deep voice. “You obviously don’t know your condiments. Mustard and ketchup go hand in hand.” Taehyung gives Jeongguk’s shoulder a weak push. “And stop insulting my sweaters, you little brat.”</p>\n<p align=\"justify\">Jeongguk grins as he slips the condoms into his own pocket. A strong touch backs Taehyung up against the mirrored wall, the show of force causing delectable shivers to travel down Taehyung’s spine. “Shut up. They’re hideous and you know it.”</p>\n<p align=\"justify\">Before Taehyung has the chance to protest, Jeongguk glues himself to Taehyung like a second skin, his muscular thigh sliding between Taehyung’s legs, the friction making Taehyung moan into his mouth. The hands on Taehyung’s shoulder move upwards over his arms, pinning them to the mirror, as Jeongguk’s lips move lower across Taehyung’s jawline and neck. Jeongguk nips at the skin, placing new marks over faded ones. The rings and bracelet on Taehyung’s hands tick dangerously on the reflective surface behind him but it’s hard to worry about scratching the mirror when Jeongguk is rocking between his legs. All Taehyung can do is rock back. They’re so hard already. </p>\n<p align=\"justify\">Jeongguk looks up. “Did you touch yourself again?” His eyes are dark. “Before coming over?”</p>\n<p align=\"justify\">Taehyung feels his cheeks heat up. It’s become a ritual of sorts. He touches himself before meeting up with Jeongguk and he touches himself again after. It makes the time spent with Jeongguk seem longer. It prolongs the pleasure.</p>\n<p align=\"justify\">Jeongguk can read the answer on his face and groans. “Fuck, you drive me crazy sometimes.” He releases his grip on Taehyung’s wrists. “Turn around.”</p>\n<p align=\"justify\">Taehyung doesn’t even hesitate. The mirror feels cool and calming under his palms but the face staring back at him looks almost foreign. His cheeks are already flushed, the redness travelling downwards until it disappears under his sweater, accented by the love bites Jeongguk left behind seconds earlier. He feels Jeongguk’s hands slip under the waistband of his sweatpants before he sees them pool around his feet in the reflection before him. His mirror image’s modesty is preserved by his oversized sweater, blocking Jeongguk’s hands and their effect on Taehyung’s body from view. Taehyung wonders if the sweater will ever come off this evening. The idea it might not it only adds to the heat pooling in stomach.</p>\n<p align=\"justify\">A slicked finger teases at Taehyung’s entrance. It slips inside without further warning, making Taehyung moan and drop his head. Jeongguk’s breath is hot as it skims across Taehyung’s sensitive neck and Jeongguk’s voice is gravelly as he whispers in his ear, “Tell me what you think about when you do it, <em>baby</em>.”</p>\n<p align=\"justify\">A second digit joins the first, locating his bundle of nerves, making Taehyung whimper as they work him open. Taehyung moves back on them with unashamed eagerness. The fingers of Jeongguk’s free hand entwine themselves with the strands of Taehyung’s hair, forcing him to look up. Taehyung meets Jeongguk’s eyes in the mirror. The dark orbs are no less captivating when seen in a reflection; they’re still on fire and Taehyung still can’t look away and they still make him burn. He’s burning up so badly.</p>\n<p align=\"justify\">Jeongguk curls his fingers, grazing his prostate. “What’s on your mind when you touch yourself? Who do you see?”</p>\n<p align=\"justify\">“Y-your fingers. Your cock. W-what you’ll do to me—” Taehyung keens as Jeongguk’s third finger pushes in with the others, momentarily unable to continue, eyes scrunching shut in the pain-laced pleasure “—<em>You</em>. Just you.”</p>\n<p align=\"justify\">Taehyung can sense Jeongguk’s satisfaction in the way his touch changes, fingers becoming tender. Now there’s extra care behind the forcefulness, less demand in Jeongguk’s eyes.</p>\n<p align=\"justify\">Jeongguk finally tears his gaze away to place a soft kiss on Taehyung’s bare shoulder, the overly large sweater pushed off to the side. “You ready?”</p>\n<p align=\"justify\">Taehyung nods. “Ready.”</p>\n<p align=\"justify\">In the mirror Taehyung can see Jeongguk’s hand disappearing to pull a condom out of his pocket. He can see Jeongguk’s sweat pants fall to the ground as he simultaneously tears open the wrapper between his teeth. Taehyung knows that isn’t safe but it still makes his gut clench with aching want. He can see the pleasure etched in Jeongguk’s features as he rolls the condom on behind Taehyung’s back and lubes himself up, the actual motions hidden from view but clear as day on Jeongguk’s face.</p>\n<p align=\"justify\">Jeongguk’s eyes are upon him again as he pushes inside Taehyung. It’s too much, Taehyung’s eyelids flutter close as Jeongguk bottoms out with a groan. Jeongguk’s dick burns in the most delicious way, adding fuel to the fire already blazing in Taehyung’s stomach and Taehyung rocks back on him in desperation, needing more. Wanting more. “<em>Move</em>, Gukkie.”</p>\n<p align=\"justify\">Jeongguk doesn’t need to be told twice. He pulls out, the sensation of him leaving Taehyung’s body just as gratifying as when he enters, and pushes back in with a string of expletives falling from his lips. Jeongguk’s hands move under Taehyung’s sweater with determination, gripping Taehyung’s hips with purpose, before settling in a hard rhythm.</p>\n<p align=\"justify\">Taehyung braces himself against the mirror, meeting each of Jeongguk’s thrusts. The hands on his hips adjust the angle of his body and Jeongguk’s next stab hits his prostate. Taehyung’s forehead falls towards the mirror with a whimper as the flames of pleasure lick at him. He burns.</p>\n<p align=\"justify\">“That’s it,” Jeongguk croaks in lust-filled tones. “Like that, baby. Take it like that.” He’s merciless as always, giving Taehyung’s sweet spot no respite after he’s found it. </p>\n<p align=\"justify\">There’s something dirty about their sweatpants pooled around their feet, the fabric of Taehyung’s sweater shifting with their motions. Every thrust of Jeongguk’s dick makes Taehyung grow hotter, his hands now slippery on the glass. But Taehyung is panting on the mirror, fogging up the reflective surface. He can’t see Jeongguk like this. He wants to see Jeongguk. He <em>needs</em> to. “I-I want to ride you.”</p>\n<p align=\"justify\">Jeongguk grunts. “These floors aren’t exactly comfortable.”</p>\n<p align=\"justify\">“<em>Gukkie</em>,” Taehyung pleads in breathy tones, trying to squeeze as much neediness in the name as he can. He knows it has the desired effect when Jeongguk’s rhythm falters. “Let me ride you, Gukkie.”</p>\n<p align=\"justify\">Jeongguk pulls out, causing them both to groan like they’re in pain. The aching emptiness Jeongguk’s dick leaves behind makes Taehyung briefly think he’s made a mistake. But that feeling disappears when Jeongguk tosses a towel on the floor and sits down, leaning back on one hand. Taehyung follows him to the ground after taking off his sandals and sweatpants. He leaves the sweater on.</p>\n<p align=\"justify\">Swinging his leg over Jeongguk’s lap, Taehyung positions himself above Jeongguk’s dick. It’s his turn to look at Jeongguk as he sinks down, slowly taking him inside his body. Jeongguk’s eyes hood over in pleasure, a moan escaping his lips. “Fuck, baby, you feel so good.”</p>\n<p align=\"justify\">Taehyung starts rolling his hips. “You too. So, so good.”</p>\n<p align=\"justify\">Jeongguk’s free hand grips at Taehyung’s ass, helping him move. The way the fingers dig in the skin, Taehyung knows he’ll have a reminder of this night every time he sits down on a hard surface in the coming days.</p>\n<p align=\"justify\">They can’t move as fast as when they were standing and it’s back again; the intimacy. Taehyung’s chest clenches painfully at the sight of Jeongguk’s face, so he doesn’t look. He doesn't want to see it after all. His eyes travel lower and his hands follow, trailing his fingers over the tattoo under Jeongguk’s collarbone. Even lower still, across the tattoo on Jeongguk’s side. Taehyung does ponder the meaning of them a lot. Jeongguk’s abdomen flexes involuntarily and Taehyung swallows. Sometimes looking at Jeongguk hurts. He can make Taehyung burn so hot. Trouble.</p>\n<p align=\"justify\">Taehyung kisses him as they fuck, each thrust stocking the fire higher, eager to steal back whatever Jeongguk stole from him the last time they met. As they kiss, the heat in his stomach keeps increasing, their movements growing frantic. Taehyung is so close; he can feel it. Jeongguk is too, Taehyung can tell by how Jeongguk’s rhythm is starting to disintegrate right beneath him.</p>\n<p align=\"justify\">Taehyung kisses harder, trying to take everything from Jeongguk just like Jeongguk always takes all he has from him. Before Taehyung can be sure if he’s succeeded, Jeongguk swells within him, climaxing underneath him. They break apart in moans as Taehyung rides him through his orgasm, milking him.</p>\n<p align=\"justify\">Surprise overtakes Taehyung when Jeongguk still has the clarity of mind to push aside the sweater and wrap a hand around Taehyung’s dick, helping him find ecstasy as well. It only takes a few strokes before Taehyung is finally consumed by the fire eating away at him. He sobs Jeongguk’s name as he shoots his release on Jeongguk’s abdomen and hand, marking him like Jeongguk always marks Taehyung’s skin with his teeth.</p>\n<p align=\"justify\">It takes a while before the fever resides and Taehyung’s mind becomes clear again. Jeongguk is waiting for him, one hand rubbing slow circles on Taehyung’s sweat-slicked back, looking pleased with himself. “You with me?”</p>\n<p align=\"justify\">Taehyung smiles faintly, once again amused by Jeongguk's blatant smugness. Then he nods, moving off Jeongguk’s dick as he holds the condom in place at the base, his body trembling at the final graze over his now raw nerves. “Your dick should come with a warning label.”</p>\n<p align=\"justify\">Jeongguk chuckles, ego stroked, but it turns into a groan as he pulls the towel out from underneath his butt. He uses it to clean up the mess on his hand and stomach. “You fucking owe me for sitting on this floor. I can’t feel my ass.”</p>\n<p align=\"justify\">Taehyung grins and leans forward to place a peck on Jeongguk’s nose. “Don’t worry, I think I know of a couple of ways to make it up to you. I’ll have your ass feeling happy in no time.”</p>\n<p align=\"justify\">Jeongguk stares back with wide eyes and Taehyung can feel a blush creep up his cheeks. Things are strangely reversed in a hook-up scenario. It’s not the sex but the innocent gestures that are taboo. They aren’t supposed to give each other fluttery kisses on the nose.</p>\n<p align=\"justify\">Rattling from the door handle acutely cuts through the awkwardness. Taehyung’s heart skips a beat before trying to burst out of his chest, and they both tense up with surprise.</p>\n<p align=\"justify\">Jeongguk is the first to relax. “Don’t worry, it’s locked from the inside. They’ll need a key to get in but I stayed last. I have it.”</p>\n<p align=\"justify\">Taehyung nods weakly, heart still racing, as he completely moves off Jeongguk’s body. But then there are more scraping noises coming from the door; the sound of someone fiddling with a lock and key.</p>\n<p align=\"justify\">“Fuck,” Jeongguk hisses as he gets up off the floor and shimmies into the sweatpants still wrapped around his ankles, stuffing the used condom in one of the pockets. “It’s Hoseok.”</p>\n<p align=\"justify\">Taehyung frantically reaches for his own sweats. “I thought you said <em>you</em> have the key.”</p>\n<p align=\"justify\">“He’s the fucking captain.” Jeongguk furiously rubs at his bare stomach, trying to remove all evidence of Taehyung. “He has his <em>own </em>key.”</p>\n<p align=\"justify\">Taehyung barely manages to wiggle into his sweat pants before the door swings open but he already knows it doesn’t make a difference if they’re naked or not.</p>\n<p align=\"justify\">“Jeongguk, you still—” Hoseok’s question dies on his lips as he spots them. His eyes flicker from Taehyung to Jeongguk and back again. Then he sighs. “Jimin is going to be so pissed.”</p>\n<p align=\"justify\">Jeongguk spares Taehyung a brief glance after which he scoffs and starts picking up his stuff from the dance floor. “As opposed to a time when he isn’t acting butthurt.”</p>\n<p align=\"justify\">“You know what, I’m the one who’s butthurt,” Hoseok says, making his way to a bench on the side of the wall, collecting a stray book. Taehyung winces. Of all the times Hoseok could have accidently left that behind.</p>\n<p align=\"justify\">Hoseok looks at them with a perfectly on point expression of a disappointed mother. “The dance studio, guys, I mean—<em>really?</em>” His face contorts in pain. “We occasionally eat off that floor, Jeongguk.”</p>\n<p align=\"justify\">Jeongguk grabs his gym bag and stuffs his tank top and towel inside. “Don’t tell me you never have, hyung.”</p>\n<p align=\"justify\">Hoseok opens his mouth in a silent gasp of horror.</p>\n<p align=\"justify\">Jeongguk shrugs, pulling a hoodie out of his bag and over his head. “Your loss then.”</p>\n<p align=\"justify\">Taehyung watches Jeongguk swing the bag strap across his chest and step towards the exit. He waves a casual hand over his shoulder as he passes through the doorway, not bothering to look back. Taehyung wonders if Jeongguk won't be cold without a coat. He has to supress the urge to tell Jeongguk to stop.</p>\n<p align=\"justify\">The air grows thick after Jeongguk’s departure. Taehyung feels itchy and dirty, his sweater drenched in his sweat, maybe Jeongguk’s too, the inside of his pants sticky. The smell of sex is heavy around him. The smell of Jeongguk is still there while he himself isn’t.</p>\n<p align=\"justify\">Hoseok’s eyes shift from the door through which Jeongguk just left to the spot where Taehyung is still rooted to the ground. The orbs are not as playful as they usually are. Somehow serious looks carry more weight when coming from someone as cheerful as Hoseok. “How long has this been going on?”</p>\n<p align=\"justify\">Taehyung briefly considers lying but doesn’t. “A few weeks.”</p>\n<p align=\"justify\">Hoseok whistles, his eyebrows raised. “I bet that amounts to a lot of fucking.”</p>\n<p align=\"justify\">It does. Taehyung is quiet for a few seconds, before opening his mouth to give way to an unsure voice, “<em>Hyung?</em>”</p>\n<p align=\"justify\">“You don’t want me to tell Jimin.” It’s more of a statement than a question. Taehyung nods hesitantly and Hoseok clucks his tongue. “I hope you know what you’re doing, Tae.”</p>\n<p align=\"justify\">“It’s college.”</p>\n<p align=\"justify\">Hoseok fixes him with a stare. “Doesn’t make it any less real, Taehyung.”</p>\n<p align=\"justify\">“We know what we’re doing.” The words taste like a lie.</p>\n<p align=\"justify\">“<em>Okay</em>,” Hoseok says, but his voice lilts in a way that expresses scepticism. “Ready to go?” He jiggles the keys. “I need to lock this place up before I leave.”</p>\n<p align=\"justify\">Taehyung nods and slips into his sandals before trudging towards the door and his coat. Something shiny catches his attention as he passes the stereo; Jeongguk’s phone. He pockets it without thinking.</p>\n<p align=\"justify\">Taehyung and Hoseok are silent on their way outside but they’re not supposed to be. They’re the rowdiest of their group of friends and the silence between them sounds foreign. It’s almost a relief when they part ways at the main entrance.</p>\n<p align=\"justify\">As Taehyung walks back to the dorm alone, he thinks about Jeongguk. Something has changed, Taehyung just doesn’t know what exactly.</p>\n<p align=\"justify\">But he knows he can’t take it back. </p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">Taehyung knows he can’t change what happened in the dance studio. He can't change the fact Hoseok caught them in the act.</p>\n<p align=\"justify\">He also knows he needs to give Jeongguk back his phone.</p>\n<p align=\"justify\">Taehyung eyes the device on his desk. He shouldn’t have taken it with him. If he had given it to Hoseok instead, it wouldn’t be on top of his study papers right now, he wouldn’t be staring at it intermittently for the past half hour instead of preparing for his afternoon lecture. During the last class discussion, Taehyung had been useless because the night before he’d been binge watching <em>Attack on Titan</em> with Jimin. If he doesn’t read up on the latest research on Serotonin Inhibitors, he’s bound to firmly cement his reputation as the resident airhead of the class. He’d rather have someone else wear that dubious badge of honour. Taehyung sighs. Senior year’s a bitch. According to Hoseok, being a graduate student is even worse.</p>\n<p align=\"justify\">Taehyung idly fidgets with his pen when he should be taking notes with it instead. <em>Iron Man</em> is still staring back at him from his desk and Taehyung can feel the corners of his lips tug up in a faint smile. Jeongguk’s superhero phone case doesn’t match all that well with his tattoos and piercings.</p>\n<p align=\"justify\">Spinning his desk chair round and round, Taehyung rhythmically thumbs the top of his pen, the clicking noise becoming faster as his self-control grows weaker.</p>\n<p align=\"justify\">Slapping his hand down on top of the desk, Taehyung comes to an abrupt stop. One look.</p>\n<p align=\"justify\">Taehyung picks up the phone and opens the menu. Jeongguk still doesn’t use a passcode. Taehyung had expected Jeongguk would have put one in after what happened last time. His thumb hovers over the message icon but Taehyung bypasses it; he wouldn’t go that far. It’s also not the reason why he’s been fixated on the phone ever since he remembered he took it home with him last night.</p>\n<p align=\"justify\">Taehyung opens Jeongguk’s pictures instead. He scrolls through them, most of the pictures are of notes from Jeongguk’s classes, a few of some people Taehyung doesn’t know (or at least not personally), some of Jeongguk’s and Jimin’s dance team. When his own face pops up, he stops. They’re still there.</p>\n<p align=\"justify\">Taehyung had gotten his hands on this phone once before, when Jeongguk was taking a shower. That time, he’d taken over twenty pictures of his own face to keep himself entertained (each one sillier than the one before) and to mess with Jeongguk’s head. It had worked a little too well. Jeongguk had been furious.</p>\n<p align=\"justify\">At the time, Taehyung had been sure that his silly joke meant the end of their casual hook-ups. It had taken him a considerable amount of acting cute and no less than two blowjobs to calm Jeongguk down and work his way back into Jeongguk’s good graces.</p>\n<p align=\"justify\">Jeongguk had said he would delete the pictures but he hadn’t. Taehyung bites his bottom lip. He wonders what Jeongguk’s reason was for keeping them. Or if maybe Jeongguk had just forgotten they were there.</p>\n<p align=\"justify\">There’s an inexplicable urge to add more pictures of his face to Jeongguk’s phone but Taehyung resists the impulse. No amount of blowjobs would make Jeongguk forgive him if he made the same mistake twice.</p>\n<p align=\"justify\">Taehyung is staring at a picture of himself sticking out his tongue while holding his fingers up in a V-sign, when the door swings open with considerable force. Taehyung flinches in his chair, almost dropping the phone to the floor, his hands scrambling to save it from an untimely end or cracked screen. Jeongguk would kill him. When the phone is secure in his grip, he quickly stuffs it in his backpack.</p>\n<p align=\"justify\">Jimin whines like a dying animal as he tumbles into the room and down onto his bed. Taehyung waits for him to speak but his best friend doesn’t, instead pulling a pillow over his head to stifle his screams.</p>\n<p align=\"justify\">Taehyung raises an eyebrow. He’s usually the one in charge of the theatrics, not Jimin. “You okay there, ChimChim?”</p>\n<p align=\"justify\">Jimin pulls the pillow up off his head and narrows his eyes in an accusing manner. “Why did you let me take <em>Environmental Chemistry and Physics</em>? You just stood by and watched me do it. How could you, Tae?”</p>\n<p align=\"justify\">The pen finds its way back to Taehyung’s hand and he resumes his clicking from before. “You needed the science credits. This course fit your schedule the best.”</p>\n<p align=\"justify\">Jimin groans. “You should have stopped me. You’re horrible. I hereby de-friend you.”</p>\n<p align=\"justify\">“That bad?”</p>\n<p align=\"justify\">Jimin just sighs; loudly and full of anguish.</p>\n<p align=\"justify\">“You’ll be fine, ChimChim.”</p>\n<p align=\"justify\">Another sigh.</p>\n<p align=\"justify\">“I’ll help you with the sciency bits.”</p>\n<p align=\"justify\">A disbelieving groan this time.</p>\n<p align=\"justify\">Taehyung gets up from his chair and drops down beside Jimin on the small bed. He proceeds to wrap himself around his friend like an overgrown koala. “Can’t be all bad.” He tucks his chin on Jimin’s shoulder. “Is the Professor at least nice to look at?”</p>\n<p align=\"justify\">“Average,” Jimin breathes while staring at the ceiling. He’s quiet for a few second before continuing, “But there’s this Teaching Assistant.”</p>\n<p align=\"justify\">Taehyung grins. “Is he hot?”</p>\n<p align=\"justify\">Jimin sighs again but this time it’s with longing instead of desperation. “I want to lick every inch of his skin. Repeatedly.”</p>\n<p align=\"justify\">Taehyung chuckles, his arms tightening their grip briefly in amusement. Jimin is wonderfully solid and sturdy in his arms; his rock. Taehyung tickles his side. “Go on.”</p>\n<p align=\"justify\">“That’s all there is. I wanna lick him.” Jimin giggles as he turns to look at Taehyung, eyes scrunched into crescents. “Like every day.”</p>\n<p align=\"justify\">When Jimin smiles, Taehyung smiles too. It’s infectious. “That doesn’t sound like a bad class at all. I’m coming to your next lecture. I want to meet the human popsicle.”</p>\n<p align=\"justify\">Jimin’s giggles deteriorate into cackles. “I want to lick the popsicle’s popsicle.” That statement really isn’t all that funny. Their jokes often aren’t but they usually still succeed in making each other laugh until they cry. Jimin is still wheezing when he turns to his side. “Don’t you have class in a few minutes, TaeTae?”</p>\n<p align=\"justify\">Taehyung glances at the clock on the wall. “There’s still time.”</p>\n<p align=\"justify\">Jimin snuggles closer. “You want to go out to eat tonight? Like, get something bad and greasy?” They hadn’t done that in a while, Jimin had been on a diet.</p>\n<p align=\"justify\">Taehyung smiles his boxy smile. “Always.”</p>\n<p align=\"justify\">“Are you sure you’re free? You’re not meeting up with your mysterious boy toy tonight?”</p>\n<p align=\"justify\">Taehyung’s smile falters. “No, I just saw him last night. It’s just a hook-up. I don’t want to overdo it.”</p>\n<p align=\"justify\">Jimin hums, eyes sharp. “You’ve been meeting up with him for a while, though. You’re usually not that committed. What’s so special about this one?”</p>\n<p align=\"justify\">That’s Taehyung’s opening; it’s right there, all he has to do is take it. Taehyung has been waiting for a chance to confess to Jimin about Jeongguk and now Jimin is presenting him the perfect opportunity on a silver platter.</p>\n<p align=\"justify\">But Taehyung still doesn’t take it.</p>\n<p align=\"justify\">“His dick. It’s like—” Taehyung waves his hand in the air in a crude gesture hinting at size “—ten out of ten would totally fuck.”</p>\n<p align=\"justify\">“Are you saying you can’t stay away just because of his massive dick?”</p>\n<p align=\"justify\">“You don’t understand,\" Taehyung says with a sigh. \"I think it’s put a spell on me. It calls my name at night.”</p>\n<p align=\"justify\">\"Because that’s not creepy at all.\" Jimin gives Taehyung an inquisitive look. \"What about the man attached to it, though? He put a spell on you too?”</p>\n<p align=\"justify\">Taehyung shrugs, the motion stunted when lying down. “He’s hard to read. We let his dick do most of the talking.” Jimin looks unconvinced. Hurt maybe, because Taehyung won’t share more. Taehyung unwraps his arms and gets up from the bed before he says something stupid. Like Jeongguk’s name. “I’ve got to go, ChimChim. I’ll see you tonight.”</p>\n<p align=\"justify\">“See you tonight, Tae.”</p>\n<p align=\"justify\">Taehyung makes it to the class room with five minutes to spare. Class goes as expected considering he had done none of the reading but all of the procrastination. Fortunately, he wasn’t the only one and he isn’t half-bad at bullshitting his way through the discussion. He only gets one or two strange looks when he speaks, both of them from the Professor. Taehyung isn't sure if he's already completely forgiven for the squid jerky and Bunsen burner incident. But the girl with the ugly green sweater is fairing far worse, answering all her questions poorly.</p>\n<p align=\"justify\">It’s still a relief when the class is finally over.</p>\n<p align=\"justify\">When Taehyung gets outside, he digs his nose deeper into Jeongguk’s scarf. It still faintly smells of Jeongguk’s cologne but it gets weaker each day. Taehyung should give that back as well. It’s just that it’s nicer than the scarf he owns himself, warmer, and the days just keep getting colder. There will be snow soon. Taehyung loves snow but he hates the cold.</p>\n<p align=\"justify\">The university's buildings thin out until they completely disappear as Taehyung steps across an invisible threshold and off campus. It feels strange walking towards Jeongguk’s apartment during the day when the sun is out, like Taehyung’s timing is off. They usually meet up at Jeongguk’s place after dark. Things are different at night; priorities shift, emotions change. People aren’t the same at night, when the darkness shrouds their activities.</p>\n<p align=\"justify\">Knocking on Jeongguk’s front door feels different too because for the first time in weeks, Taehyung isn’t sure how their meeting will play out.</p>\n<p align=\"justify\">Jeongguk opens the door fully dressed and with a beanie on his head. Another deviation from their normal pattern; Jeongguk usually greets him half-naked and with a smirk, not this guarded expression. But then Jeongguk usually knows when he’s coming.</p>\n<p align=\"justify\">“Taehyung?” The name rolls off Jeongguk's lips in curt tones.</p>\n<p align=\"justify\">Taehyung puts his arm out, <em>Iron Man</em> staring up at them from the palm of his hand. “You forgot your phone last night.”</p>\n<p align=\"justify\">Jeongguk takes the device and checks it. He doesn't question why Taehyung is the one who had it. Taehyung sees Jeongguk's thumb hovering over several icons but he ultimately doesn’t tap them, pocketing the phone instead. His eyes shift their attention back to Taehyung. They’re like the rest of him; cold and uninviting. His entire posture looks stiff and unyielding. “I take it we’re over.”</p>\n<p align=\"justify\">“What?”</p>\n<p align=\"justify\">Jeongguk furrows his eyebrows in annoyance. “I’m your dirty little secret, right? You didn’t want Jimin to know. Well, you saw Hoseok hyung last night. I think that ship has sailed.”</p>\n<p align=\"justify\">Taehyung slowly shakes his head. “Hoseok hyung won’t tell anyone.”</p>\n<p align=\"justify\">One of Jeongguk’s eyebrows lifts up in disbelieve. “What makes you say that?”</p>\n<p align=\"justify\">“Because he said he wouldn’t.”</p>\n<p align=\"justify\">For a few heartbeats, Jeongguk is silent. Then he releases a mocking huff. “And you believe him?”</p>\n<p align=\"justify\">“Why wouldn’t I?” Taehyung’s voice sounds small even in his own ears.</p>\n<p align=\"justify\">Jeongguk’s jaw clenches and unclenches. One of his hand reaches up to brusquely adjust his beanie. “People lie, Taehyung. Everyone does. You’re lying to your best friend, aren’t you? What more proof do you need?”</p>\n<p align=\"justify\">Taehyung’s lips thin out in a terse line. “I suppose you’re right. I lie to my best friend. You lie to your teammate on the dance squad. We all lie.”</p>\n<p align=\"justify\">The following silence could cut glass. Jeongguk opens his mouth to speak but a gravelly voice from inside the apartment pipes up before he has the chance, the vowels and consonants rolling like the owner might have had one or two drinks, “Jeongguk, you little shit, are you fucking coming to help me with this or what?!”</p>\n<p align=\"justify\">Taehyung can’t think of a face that matches the unfamiliar sounds. Jeongguk turns his head to yell back over his shoulder, “In a minute, hyung!”</p>\n<p align=\"justify\">“Who the fuck are you even talking to, Jeongguk?” The voice appears to be coming closer. “Is it one of those idiotic bible thumpers?”</p>\n<p align=\"justify\">The owner of the drunk voice appears in view, seizing Taehyung up. He doesn’t look intoxicated up close and Taehyung thinks he's definitely seen him around campus before. The pink hair is hard to miss. Another man with tattoos and piercings just like Jeongguk; someone also at the centre of the university’s rumour mill. He looks just as intimidating at first glance as Jeongguk does, if not more, even though he's shorter than both of them.</p>\n<p align=\"justify\">The pink-haired man nods in Taehyung’s direction. “Hey.” He turns towards Jeongguk before Taehyung can reply to his meagre greeting. “Boyfriend?”</p>\n<p align=\"justify\">“No,” Jeongguk snaps back.</p>\n<p align=\"justify\">“Fine,” the man replies irritably, hands up in a deflective gesture. “Not your boyfriend, I get it. But is he coming in or out? Because we’ve got shit to do, Jeongguk.”</p>\n<p align=\"justify\">“He just stopped by to drop off my phone,” Jeongguk says as he looks over at Taehyung. “He’s just leaving.”</p>\n<p align=\"justify\">The wind is cold on Taehyung’s cheeks. “Yeah, I’m just leaving.”</p>\n<p align=\"justify\">The pink-haired man looks back and forth between them before making his way back to the living room, muttering something under his breath about <em>‘time’</em> and <em>‘melodramatics’</em>.</p>\n<p align=\"justify\">“Are you going to text?”</p>\n<p align=\"justify\">“Sure,” Jeongguk drawls in his familiar indifferent air. But this time it feels different; frostier. For the first time, Taehyung isn’t sure if he will.</p>\n<p align=\"justify\">The door falls shut with a harsh jeering click. Taehyung turns and starts to walk back to campus, towards the lab. He’s supposed to stain a significant amount of microscopic slides today. It will be okay. The work is repetitive and monotone and doesn’t require him to think. He can put on his music and let his body do the work for him, his hands moving through the motions almost automatically.</p>\n<p align=\"justify\">Jeongguk’s scarf still smells of him, making Taehyung’s gut clench. Taehyung wants to take it off but he can’t because it’s cold outside and he hates the cold. It’s one of those days when the sky is completely clear and the sun looks so warm and inviting when you’re inside but once you step outside the cold is biting. The nice weather is but an illusion.</p>\n<p align=\"justify\">In the days that follow, the weather keeps deteriorating. Each day gets colder than the one before. Jeongguk doesn’t text. Taehyung doesn’t text him either. Two weeks pass and it's a mile stone of sorts; the longest time they've gone without contacting each other ever since Taehyung first went home with Jeongguk.</p>\n<p align=\"justify\">Taehyung thinks about his pictures on Jeongguk’s phone a lot. About whether they would still be on there or if Jeongguk had deleted them by now. Sometimes he wishes he’d taken pictures of Jeongguk on his own phone. It doesn’t seem fair that Jeongguk can look at him whenever he wants while Taehyung can’t look back, even if in reality Jeongguk probably doesn’t look at the photos at all. Not being able to see Jeongguk, Taehyung resorts to staring at his own reflection in the mirror. At first it stings to see the marks Jeongguk had left behind. When they fade, it stings to look at the unblemished skin.</p>\n<p align=\"justify\">Jimin doesn’t ask but he knows when Taehyung no longer goes out at night. They spend a lot of evenings under the blankets watching their favourite shows. Jimin helps him fight the cold; Taehyung helps Jimin tackle his science course. They occasionally go over to visit Seokjin’s apartment, the oldest member of their friend group and a <em>Food Science</em> graduate student. His home cooked meals are a great remedy against the wintery frost. Hoseok drags them to parties on the weekend. Hoseok knows <em>everyone</em> and alcohol and rooms filled with people are a great way to stay warm.</p>\n<p align=\"justify\">One time Taehyung tries to burn in another person's company, trying to chase away the chill in his chest. But the stranger isn't witty enough, his touch not assertive enough, his fingers too limp. Taehyung shuts him down after a single kiss. At the parties that follow, Taehyung doesn't try again.</p>\n<p align=\"justify\">In the end, Taehyung never finds out Jeongguk would have eventually texted him. After almost a month, Taehyung is the one who contacts him first. But he decides to go for a more direct approach. He calls him.</p>\n<p align=\"justify\">It takes three rings before Jeongguk picks up.</p>\n<p align=\"justify\"><em>“Yeah?”</em> Jeongguk’s voice still makes Taehyung’s heart thump against his chest. Trouble.</p>\n<p align=\"justify\">“Hey,” Taehyung answers hesitantly. He picks at the corners of his <em>Neuroscience </em>study book splayed out on the table in front of him. “Christmas break is coming up.”</p>\n<p align=\"justify\">\n<em>“I know.”</em>\n</p>\n<p align=\"justify\">It’s harder over the phone. Jeongguk is difficult to read as it is but without visual cues it feels like talking to a wall.</p>\n<p align=\"justify\">“I’ll be going home to visit my family in two days.”</p>\n<p align=\"justify\"><em>“Hmm.”</em> The noise sounds dispassionate when coming in the canned tones from Taehyung’s phone.</p>\n<p align=\"justify\">Taehyung accidently tears some of the pages in his book and cringes. He was planning on selling that at the end of the school year. Pushing the book aside, he takes a deep breath. “I think I might need a fix to tide me over. There’s not much fun to do where my parents live.”</p>\n<p align=\"justify\">There’s a silence on the other end of the line. For a short moment, Taehyung wonders if Jeongguk might turn him down. All hook-ups have an expiration date and they’re probably far past theirs.</p>\n<p align=\"justify\">\n<em>“Okay. See you at seven.”</em>\n</p>\n<p align=\"justify\">The line goes dead before Taehyung has the chance to respond.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">The afternoon drags on. The eight-and-a-half hours between the phone call and the time they’re supposed to meet crawl by excruciatingly slow. But then it’s almost seven and Taehyung is trudging his way through the snow, ice-cold water seeping in through his shoes, and time speeds up again. It accelerates mind-bogglingly fast and Taehyung reaches Jeongguk’s apartment far too soon. Before he’s ready.</p>\n<p align=\"justify\">He knocks anyway.</p>\n<p align=\"justify\">Like the last time they met, Jeongguk opens the door wearing a long-sleeved shirt and a beanie. A voice in the back of Taehyung’s mind is telling him that doesn’t bode well for whatever it is that Taehyung had hoped they’d do tonight.</p>\n<p align=\"justify\">“Fuck,” Jeongguk croaks in a voice that sounds like it hasn’t been used in a while. There are dark circles under his eyes, a tired expression on his face. He tugs at the beanie, pulling it up a little before pushing it back in place, fiddling with the fringe peeking out from underneath. “I’m not done yet—with my assignment, I mean. It’s taking longer than expected.”</p>\n<p align=\"justify\">Taehyung doesn’t respond. A small part of him wonders if this assignment Jeongguk speaks of is even real, if this is Jeongguk’s way of breaking things off for good. Jeongguk could have called or texted him but he hadn’t. He’d let Taehyung plod his way over through the cold, snow and icy roads, yet he isn’t stepping aside to let him in. Unlike before, Taehyung lacks the confidence to squeeze past Jeongguk’s wide shoulders uninvited.</p>\n<p align=\"justify\">Things had changed so much after being discovered in the dance studio. They’d changed after not speaking for almost a month. Gone is the easy banter and the even easier sex. In its place is an unfamiliar landscape that Taehyung isn’t sure how to navigate.</p>\n<p align=\"justify\">Taehyung decides he isn’t going to be that person who begs to stay where he isn’t welcome. He’s about to turn around and leave when Jeongguk’s voice stops him in his tracks, “It should take me like thirty minutes. One hour tops.”</p>\n<p align=\"justify\">Taehyung takes in Jeongguk’s broad figure filling up the hallway before him. “Do you want me to come inside and wait? Because you’re kind of blocking the doorway.”</p>\n<p align=\"justify\">“What?—“ a blank look; or maybe just tired one “—Yeah, yeah, come in.” Jeongguk finally steps back and turns sideways to make room, one hand blearily rubbing at his eyes. As Taehyung enters, Jeongguk is already making his way back to the living room. “I need to get back to that assignment. The deadline is tonight.”</p>\n<p align=\"justify\">Taehyung nods even though Jeongguk can’t see him. It’s not like he’s a stranger to essay writing frenzies and desperate all-nighters but it isn’t something he’d ever seen Jeongguk do. They used to be the thing they did to keep their minds off their studies.</p>\n<p align=\"justify\">After removing his coat and shoes, Taehyung decides to take his socks off as well. His numb toes are never going to recover their feeling if he keeps the soaked fabric on. Dropping them on the old radiator in the hallway with a sigh, he begins removing the two scarfs around his neck with his other hand. Jeongguk’s scarf and his own. A shiver runs across his back when he’s done. He wishes Jeongguk would stoke the place a little warmer now that it’s winter, especially if he might have to wait an hour before crawling up against the hot furnace Jeongguk calls his body.</p>\n<p align=\"justify\">When Taehyung enters the living room, Jeongguk is sitting cross-legged on the couch, laptop perched on his lap, books and study papers scattered across the floor and coffee table in front of him. The keyboard makes a rhythmic clicking noise as Jeongguk taps away and the screen content looks scarily similar to Matlab running on a Linux operating system. Two things that feature regularly in Taehyung’s nightmares. In the midst of all the school stuff are food wrappers and two large juice boxes. No glasses.</p>\n<p align=\"justify\">“You drink directly from the carton?”</p>\n<p align=\"justify\">Jeongguk looks up with a slightly dazed expression. His eyes flicker from Taehyung to the juice boxes and subsequently the kitchen, like he just realized it’s common courtesy to offer your guests a beverage.</p>\n<p align=\"justify\">“You animal,” Taehyung continues in a sing-song voice before Jeongguk has the chance to speak, because he’s a firm believer of talking over awkward situations or silences. “Don’t worry about it. I’ll show you how civilized people drink.”</p>\n<p align=\"justify\">Taehyung walks towards the kitchen. He doesn’t know it inside out but he can find his way to the glassware just fine. None of the glasswork matches but Taehyung had secretly dubbed the mug with a puppy wearing a bowtie <em>his</em> mug on his third visit to Jeongguk’s apartment. Jeongguk gets the beer glass with the moustache on it. Classy as fuck.</p>\n<p align=\"justify\">Taehyung fills the mug and beer glass with orange juice from one of the boxes and settles on the couch next to Jeongguk. He looks in <em>the zone</em>, completely unaware of Taehyung, the magically appearing glass of juice on the table in front of him, or the television that’s tuned to a random music station. It’s a state of mind Taehyung isn’t unfamiliar with himself. Neither are the dark eye bags and exhaustion that come with it.</p>\n<p align=\"justify\">Taehyung reaches forward to grasp the beer glass, his rings clicking against the cold, smooth surface, and holds it in front of Jeongguk’s face. “You need to drink, Gukkie.” Taehyung isn’t sure if that’s true. In all honesty, Jeongguk looks like he needs a good night’s sleep but the juice is the best that Taehyung has got to offer.</p>\n<p align=\"justify\">“Thanks,” Jeongguk mutters distractedly, downing the glass in one go. Taehyung takes it off his hands again when he’s finished.</p>\n<p align=\"justify\">“Want more?”</p>\n<p align=\"justify\">“No, I’m good.” Jeongguk rubs a hand over the back of his neck, trying to work out the kinks.</p>\n<p align=\"justify\">“What are you working on?”</p>\n<p align=\"justify\">Jeongguk’s face takes on a dark expression, giving his laptop a look as if he’s trying to threaten it into submission. “The assignment from Hell.”</p>\n<p align=\"justify\">Taehyung cocks his head. That doesn’t exactly clarify much.</p>\n<p align=\"justify\">Jeongguk continues before Taehyung has the chance to voice that thought, “It’s nothing special, really. Just an end of term thing.” He lets out a frustrated sigh. “It was supposed to be finished ages ago. But Hoseok hyung scheduled these extra dance classes and Yoongi hyung got all that new music equipment and that fucking <em>MacBook</em>—even though I told him anything <em>Apple</em> is basically an overpriced piece of shit—and made me help him install all his crap like I’ve got nothing fucking better to do with my time.”</p>\n<p align=\"justify\">“Yoongi hyung?”</p>\n<p align=\"justify\">Jeongguk looks at Taehyung, his previous rant voiced in the direction of his laptop. “The guy with the pink hair.”</p>\n<p align=\"justify\">Taehyung remembers him. That’s the person Jeongguk had adamantly told that Taehyung isn’t his boyfriend.  “The guy who curses even more than you do.”</p>\n<p align=\"justify\">Jeongguk nods and keeps talking without further prodding on Taehyung’s part, his frustrations seemingly bubbling to the surface in his tired state, “He helped me get my first tattoo and I swear, he hasn’t stop lording it over me ever since, always making me do one shitty job after the next for him. Setting up sound equipment, installing music software, designing the cover of his demo—what the fuck do I even know about that shit? I’m a Computer Science Major, not a Graphic Designer.”</p>\n<p align=\"justify\">The sneak peek into Jeongguk’s social life is unexpected and Taehyung’s next words come out unmeasured, “Sounds like a wonderful friendship.”</p>\n<p align=\"justify\">Jeongguk shoots him a dirty look. “You’re best friends with Park Jimin, it’s not like you’re one to talk.”</p>\n<p align=\"justify\">Taehyung pivots his body and gives Jeongguk’s hip a playful kick, his foot coming to rest against Jeongguk’s thigh. It feels wonderfully warm under his cold toes. “My Jimin is the world’s most precious cinnamon roll.”</p>\n<p align=\"justify\">Jeongguk grumbles and rolls his eyes. “Well, good for you. My Yoongi hyung is far from a cinnamon roll. He’s more like a badly burnt marshmallow.” Jeongguk grabs Taehyung's ankle and chucks his foot off the couch. “But if I ever kill a man, he’d help me hide the body without asking questions. What more could I possible ask for?”</p>\n<p align=\"justify\">“You sound scarily sincere when you say that.”</p>\n<p align=\"justify\">“It’s because I am.” The conviction in Jeongguk’s words silences Taehyung for several seconds. Jeongguk refocuses his attention on his computer.</p>\n<p align=\"justify\">“I don’t think Jimin would be good with dead bodies.” Taehyung folds his legs under his body until he’s sitting cross-legged on the couch like Jeongguk and begins rubbing at his still icy feet. “But he would cry and hold my hand—visit me in prison each week and send me cookies—so I guess that counts for something.” He shrugs. “I like cookies.”</p>\n<p align=\"justify\">Jeongguk huffs, muttering something about <em>‘useless’</em> under his breath. Taehyung can’t tell is it’s directed at him or the <em>ERROR</em> message on the laptop screen but he can feel his hackles rising regardless. His best friend isn’t useless.</p>\n<p align=\"justify\">“Why do you dislike Jimin so much?”</p>\n<p align=\"justify\">Jeongguk sighs, adjusting his beanie again. “I don’t dislike him. He’s just so soft.” He furrows his brows. “Sensitive.”</p>\n<p align=\"justify\">“He’s sensitive because he cares. It doesn’t mean he’s not strong. Jiminnie works really hard—for himself and for others. He’s a good person. A good friend.”</p>\n<p align=\"justify\">Jeongguk doesn’t respond.</p>\n<p align=\"justify\">“He probably cares about you too just because you’re his teammate. Even if you two can’t stand each other, he’d still care about you.” Taehyung gives up trying to thaw his feet with his hands. They look a little red now but don’t feel that much warmer. “You should treat him better,” Taehyung whispers as he watches the redness fade from his skin.</p>\n<p align=\"justify\">There’s a heavy silence but Taehyung soon discovers he prefers that over what comes next, “Is that comment directed at me or at yourself?” Jeongguk’s eyes never leave his laptop, voice stoic, but to Taehyung the words feel like a slap in the face.</p>\n<p align=\"justify\">Their conversation had progressed into the kind of personal talk that goes far beyond what they ever spoke about in the past. Normally, Taehyung would have left ages ago but this time he hadn’t. He still doesn’t. He hadn’t seen Jeongguk in a month. If he left now, Taehyung doesn’t know when the next time would be. If there even would be a next time.</p>\n<p align=\"justify\">Taehyung bites his bottom lip before facing up to the cold, harsh truth. “We should both treat him better,” he says in a soft voice. “You, me, the whole world.” He weakly waves one hand towards the ceiling. “The Aliens on Mars for that matter.”</p>\n<p align=\"justify\">“There are no Aliens on Mars.”</p>\n<p align=\"justify\">“I refuse to acknowledge that.”</p>\n<p align=\"justify\">Jeongguk hums in an uncommitted manner, still tapping on his keys. He seems unfazed by Taehyung’s idiosyncrasies. Maybe he just never was.</p>\n<p align=\"justify\">Taehyung glances at Jeongguk from the corner of his eyes. Then he flat-out stares. Jeongguk’s jaw is set as he works and there’s tension in his shoulders. It aches. After a month, they’re finally in the same room again, on the same couch, but he still seems so far away. Out of reach. Taehyung is still cold.</p>\n<p align=\"justify\">With a small sigh, Taehyung lies down on his back, head on the arm rest, and cautiously buries his toes between Jeongguk’s body and the couch. It’s far from subtle. Jeongguk raises an eyebrow at him, one-part questioning and one-part admonishing. He does that a lot. Whenever he does, the metal of Jeongguk’s eyebrow piercing shimmers in the light. There’s a unique reflective pattern for annoyance, question, disbelieve, surprise, or very rarely utter bewilderment. Any emotion really. Taehyung can’t distinguish them all but he sees them painted in dancing light.</p>\n<p align=\"justify\">Flashing a rectangle smile, Taehyung wiggles his toes a little. “Your butt is gloriously toasty.”</p>\n<p align=\"justify\">Jeongguk shakes his head. “You really shouldn’t be allowed to go outside of your house unsupervised.”</p>\n<p align=\"justify\">But Jeongguk doesn’t push Taehyung’s feet away. It makes Taehyung’s toes feel like they’ve died and gone to heaven. The warmth in Taehyung’s torso indicates that his chest agrees.</p>\n<p align=\"justify\">They stay together like that for a while. Well past the thirty minutes Jeongguk had said he needed to finish his assignment. Once or twice, one of them goes for a bathroom break but Taehyung digs his toes back under Jeongguk’s body whenever he gets the chance and Jeongguk lets him every time. The remote control resurfaces sometime during the hour and Taehyung finds an anime show that he likes. The sound of Jeongguk’s occasional groans of displeasure and muttered curses mingle with the tapping of the keyboard and the Japanese fight cries that are coming from the television. It’s not what Taehyung had come for, or what he’d expected, but it’s not unpleasant either.</p>\n<p align=\"justify\">At least not until pangs of hunger begin to plague his stomach.</p>\n<p align=\"justify\">Taehyung pokes at Jeongguk’s thighs with one foot. “Did you eat yet, Gukkie?”</p>\n<p align=\"justify\">“What?” Jeongguk asks distractedly, but he continues when the meaning of Taehyung’s words has properly sunken in, “No, not yet. I haven’t got around to it.”</p>\n<p align=\"justify\">Taehyung gets up off the couch and heads to the kitchen, although he isn’t sure what to do when he gets there. He could go to the supermarket and buy some food, put it on the counter, and proceed to stare at it until it perhaps magically cooked itself. Taehyung sighs. Even when frying an egg, he’s a known fire hazard. He has no business cooking food.</p>\n<p align=\"justify\">Randomly opening cupboards, Taehyung stumbles upon instant ramen packages for in the microwave. Perfection in a plastic bowl. Quick to make as well. When done, he takes the two steaming bowls to the couch.</p>\n<p align=\"justify\">“I found ramen.”</p>\n<p align=\"justify\">Jeongguk dumps his laptop on the coffee table and slides down onto the floor, carelessly pushing papers and books out of the way, before accepting Taehyung’s offer with two outstretched hands. “Thanks.”</p>\n<p align=\"justify\">Taehyung eagerly nestles himself on the warm spot Jeongguk’s body had left behind on the couch. “I made myself one too. Finder’s fee and all.”</p>\n<p align=\"justify\">“Of course you did,” Jeongguk responds without surprise. “I’ll eat well.”</p>\n<p align=\"justify\">It’s nice watching Jeongguk eat. It’s scary too because Taehyung feels he shouldn’t be so invested in Jeongguk’s health. His chest tightens. Trouble. As Taehyung starts his own meal, his feet zoom in on Jeongguk’s body like two heat seeking missiles, coming to rest on the shoulders in front of him.</p>\n<p align=\"justify\">Jeongguk cranes his head to look at him with warning. “Don’t you dare poke your cold toes against my neck.”</p>\n<p align=\"justify\">Taehyung shakes his body with a little whine. “If you were even half a gentleman, you’d let me wear your <em>Iron Man</em> socks.”</p>\n<p align=\"justify\">Jeongguk turns his face back towards the television, suddenly invested in Taehyung’s anime show. “What socks?”</p>\n<p align=\"justify\">“Don’t lie to me.\" Taehyung’s feet give Jeongguk’s shoulder a little nudge. \"You can pretend to be all tough and emo but I saw them once. I know you have them.”</p>\n<p align=\"justify\">There’s a small pause as Jeongguk takes another bite of his ramen. “Those socks are precious to me.”</p>\n<p align=\"justify\">“Well, <em>my</em> <em>toes</em> are precious to me,” Taehyung murmurs darkly. With limited stealth, he moves his feet lower and gingerly squirms his way under Jeongguk’s shirt until the soles of his feet rest flat against his naked back. Taehyung lets out a heartfelt sigh of contentment at the warm contact. “Glorious.”</p>\n<p align=\"justify\">“For one of us maybe.”</p>\n<p align=\"justify\">But Jeongguk doesn’t rebuke him, finishing up his meal while Taehyung uses him as his own personal heater. Taehyung’s toes heat up fast. They might have been warm for a very long time now, before dinner even, but Taehyung glues parts of his skin to Jeongguk anyway.</p>\n<p align=\"justify\">It’s another half hour and an empty juice carton later before Jeongguk slams his laptop close and settles back against the couch between Taehyung’s legs. Taehyung glances at the clock. It’s just half past nine.</p>\n<p align=\"justify\">“Thirty minutes, huh. One hour tops.”</p>\n<p align=\"justify\">Jeongguk briefly cracks one eye open to also sneak a look at the clock. “Well, give or take.”</p>\n<p align=\"justify\">Jeongguk looks awfully tired. Taehyung isn’t sure why Jeongguk had even told him to come. He isn’t sure why he himself is still there. There hadn’t been a single time in the past when the atmosphere was less sexually charged than it is now. Jeongguk looks like he might fall asleep right there, head resting on the couch.</p>\n<p align=\"justify\">Taehyung pulls off the beanie, carding his fingers through Jeongguk’s hair. “You need a haircut.”</p>\n<p align=\"justify\">“You need to burn your sweaters.”</p>\n<p align=\"justify\">“I’m butthurt.”</p>\n<p align=\"justify\">“Good,” Jeongguk sighs in a low voice, eyes still closed as Taehyung’s nails gently scratch against his scalp.</p>\n<p align=\"justify\">Taehyung’s other hand joins the first and together they travel lower, rubbing soft circles on Jeongguk’s temples. Jeongguk looks like he might just melt into a puddle. Taehyung places his thumbs in the middle of Jeongguk’s forehead and drags them outwards over Jeongguk’s eyebrow ridge, briefly caressing the piece of metal he encounters. </p>\n<p align=\"justify\">“Your eyebrows are on fleek.”</p>\n<p align=\"justify\">Taehyung can see Jeongguk’s lips twitch like he's trying to suppress a smirk. “What does that even mean?”</p>\n<p align=\"justify\">“That they be bangin’. They be on point.”</p>\n<p align=\"justify\">Jeongguk bites his lip to hide his smile but Taehyung can see his closed eyes scrunch up a little in amusement and grins his own little sly smile. Jeongguk’s still a sucker for flattery and Taehyung still knows how play cute. Maybe things hadn’t changed that much. Maybe things can go back to how they were before Hoseok walked in on them in the dance studio. Maybe Taehyung wouldn’t have to be cold for the rest of the winter.</p>\n<p align=\"justify\">“I take it that’s a good thing.”</p>\n<p align=\"justify\">“Of course. Who doesn’t like a man with good eyebrow game?”</p>\n<p align=\"justify\">“Anyone ever tell you that the way you flirt is kind of strange?” Jeongguk drawls his question in a lazy manner, the words heavy with fatigue.</p>\n<p align=\"justify\">“The way I flirt is just the right mix of cute and sexy. It’s adorable. I’m adorable.”</p>\n<p align=\"justify\">Jeongguk turns his face sideways, digging his nose in Taehyung’s palm. “Well, it’s definitely memorable.” A slow exhale of breath follows when Taehyung runs two fingers underneath Jeongguk’s ear shell, below the row of piercings. “You’re memorable.”</p>\n<p align=\"justify\">It’s not been often that Taehyung got to see Jeongguk like this; passive and pliant. When he has his energy, Jeongguk always likes to be in charge physically and Taehyung lets him. Taehyung isn’t as scared to give over his body as Jeongguk is. It’s his heart that Taehyung worries about because he’s been careless with it before. But now Jeongguk is fluid under his touch; malleable. Vulnerable. Taehyung can feel Jeongguk’s eyelashes flutter against his palm as he runs his other hand across the faint scar on Jeongguk’s cheek. A slow rush of warm breath on Taehyung's skin as he caresses his fingers across Jeongguk's jawline.</p>\n<p align=\"justify\">Taehyung can’t stop touching, fascinated by what he’s holding in his hands, unwilling to let the rare opportunity slip by. It’s the first time he’s seen Jeongguk like this. What if he never will again? The thought makes Taehyung’s heart thump violently against his ribcage. Trouble. Still trouble.</p>\n<p align=\"justify\">Taehyung decides it’s high time for their situation to take on some semblance to normalcy, to what they’re used to. There’s safety in routine and theirs was always more physical and not filled with so many words of the outside world. Their bodies talk, so they don’t have to.</p>\n<p align=\"justify\">Bending at the waist, Taehyung places an open-mouthed kiss along Jeongguk’s sharp jaw, following the path his fingers had laid out for him. When he reaches the corner of Jeongguk’s mouth, the man beneath him responds, clasping their lips together. There’s sweetness of the orange juice but underneath it there’s the familiar seductive taste that’s inherent to Jeongguk. Fingers brush over the nape of his neck, keeping him close as their tongues lazily rediscover each other’s mouths, and Taehyung sighs into the kiss. He’d missed this so much.</p>\n<p align=\"justify\">But the position they’re in is awkward, their faces aligned upside down, and being bent in half making the muscles in Taehyung’s back and neck protest. Taehyung breaks their kiss, pleased at the way Jeongguk’s lips trail after him, and slides off the couch and into Jeongguk’s lap. Their mouths melt together again without hesitation. Kissing Jeongguk, feeling his wide shoulders and strong body beneath him, having Jeongguk’s hand caress his side and back in leisurely patterns, feels so good it physically pains Taehyung.</p>\n<p align=\"justify\">Their kiss is unhurried. Taehyung can taste desire and passion, Jeongguk’s hunger that’s always there, but it’s slightly subdued by the his fatigue. This time, it’s a slowly sweltering fire that’s growing between them. But they do burn, their rising arousal trapped between Taehyung’s slowly undulating hips proves they do burn. Taehyung feels so warm, he glows.</p>\n<p align=\"justify\">Jeongguk pulls back to tug Taehyung sweater and shirt over his head and Taehyung lets him, obediently lifting his arms over his head, because he doesn’t need the garment’s heat anymore. Jeongguk’s eyes feel heavy when he takes in the exposed skin. A month apart had turned Taehyung back into a blank canvas.</p>\n<p align=\"justify\">“You’re so pretty,” Jeongguk sighs as his fingertips skim across Taehyung’s clavicle. That statement shouldn’t give Taehyung the gratification it does. Just like Jeongguk shouldn’t look so pleased to see him unmarked by another person’s lips. Trouble.</p>\n<p align=\"justify\">Taehyung rather not think about what it all means and pulls off Jeongguk’s shirt as well before burying his nose in Jeongguk’s neck. Jeongguk’s cologne smells so much better when mixed with Jeongguk's warm musk. One deep inhale and Taehyung’s head buzzes with it, the blood in his ears rushing, as the heat below keeps pooling. Taehyung moves lower, tasting each line of ink he encounters, the letters below Jeongguk’s collar bone, the ones above his heart, and each unblemished stretch of skin in between. When he reaches Jeongguk’s nipple, he sucks it in his mouth, hearing Jeongguk groan as he grazes it with his teeth, feeling Jeongguk’s hips buck up against him as he nips at it again. It’s left hard and shimmering with his saliva and Taehyung isn't satisfied until the other one looks the same.</p>\n<p align=\"justify\">Taehyung moves backwards of Jeongguk’s lap, hands pressing into Jeongguk’s side, silently telling him to move up onto the couch. Jeongguk obeys, his tiredness making him uncharacteristically docile, and Taehyung settles on his knees between Jeongguk’s legs. Resuming his path downwards, Taehyung mouths along Jeongguk’s sternum, noses at the hard lines of his muscles, dips his tongue in Jeongguk’s navel, feeling him shiver. Jeongguk’s naked flesh shuddering beneath his administration sends all the blood rushing downwards. The slow burn inside Taehyung’s abdomen speeds up, his sweats growing too small as his skin begins to tingle like it’s coming alive.</p>\n<p align=\"justify\">Taehyung teases the sensitive skin above Jeongguk’s waistband with his fingernail, enjoying how Jeongguk stiffens and jerks his hips up. He repeats the action with his tongue, revelling in Jeongguk’s pained groans.</p>\n<p align=\"justify\">“You’re such a fucking tease.” But there’s a lust simmering beneath Jeongguk’s admonishing words that tell Taehyung just how much he likes it.</p>\n<p align=\"justify\">“Take off your pants and I’ll make it up to you.”</p>\n<p align=\"justify\">Jeongguk takes him up on the offer, sliding his sweats and underwear down until they pool around his feet. His dick looks red and swollen, pre-come leaking from the tip, begging Taehyung to touch it. The sight makes his mouth water and he licks his lips in anticipation. If he wasn’t so eager to suck Jeongguk off, he’d probably laugh at himself for how thirsty he’s being. But he resists the temptation and places love bites on Jeongguk’s inner thigh instead.</p>\n<p align=\"justify\">Jeongguk’s fingers twist in his hair. “I thought you said you’d make it up to me.”</p>\n<p align=\"justify\">Taehyung looks up and flashes him a wicked smile, hands caressing Jeongguk’s legs in deliberate strokes. “Say the magic word.”</p>\n<p align=\"justify\">The annoyance is evident in the twitch of Jeongguk’s jaw, the way his eyes darken. If it were any other time, Taehyung knows Jeongguk would take back control, pin him against the floor until he begged Jeongguk to fuck him. But this isn’t any other time and the tiredness that’s evident in Jeongguk’s every move wins out like Taehyung had hoped it would.</p>\n<p align=\"justify\">“<em>Please</em>,” Jeongguk grinds out between his teeth.</p>\n<p align=\"justify\">Taehyung tilts his head in a playful manner and shoots him a teasing wink. “Good boy.”</p>\n<p align=\"justify\">The look on Jeongguk’s face is something Taehyung knows he’ll forever regret not having captured on camera. Not giving Jeongguk’s bruised pride the time to trounce his fatigue, Taehyung slips his lips over the head of Jeongguk’s dick. Taehyung sees all the dissatisfaction dissolve from Jeongguk’s face the moment he gives it a hard suck.</p>\n<p align=\"justify\">The heaviness of Jeongguk on his tongue feels so right, the saltiness tastes so good, but the sounds Jeongguk makes as Taehyung takes him deeper are the best. Taehyung had missed the way it makes him burn on the inside, blood scorching his veins with desire.</p>\n<p align=\"justify\">Taehyung flattens his tongue, running the tip across the sensitive vein at the bottom of Jeongguk dick as he moves upwards. He continues until only the head is left in his mouth and briefly tongues the slit, an almost hurt groan escaping Jeongguk. Taehyung could listen to that all day, needs to hear more, so he repeats the movement, drawing out more of Jeongguk’s wrecked sounds. Every noise feels like electricity sparking down his nerves, right towards his crotch.</p>\n<p align=\"justify\">Taehyung settles in a slow rhythm, his hand wrapping around the base of Jeongguk’s dick, moving it in tandem with the bobbing of his head. There’s a small ache beginning to build in his jaw, his eyes watering a little with the strain, but it’s all worth it. The heavy hooded eyes staring down at him, pitch black with lust, make it all worth it.</p>\n<p align=\"justify\">Jeongguk’s calloused fingers stroke over the hollow of his cheek, a slight pressure as they push to feel Jeongguk’s dick moving in and out of Taehyung’s mouth. “Fuck, you’re so good at that.”</p>\n<p align=\"justify\">Taehyung hums in agreement, aware the vibration will give Jeongguk even more pleasure. It makes Jeongguk slump his body against the back of the couch, face towards the ceiling as he drowns in what Taehyung is doing to him.</p>\n<p align=\"justify\">Taehyung slips his other hand down, into his own sweats pants, palming his own dick as he starts stroking it in sync with Jeongguk’s. Normally, Jeongguk wouldn’t let him. He would stop Taehyung because he wants to be the only one touching him even when it’s Taehyung’s own fingers. But this time Jeongguk doesn’t even seem to notice through the haze of his own bliss and exhaustion.</p>\n<p align=\"justify\">Taehyung can sense Jeongguk’s drowsiness in how he rocks his hips without his usual grace and effortless coordination, the unrestrained moans of pleasure that escape his lips. Jeongguk lacks his usual control, falling apart under Taehyung’s hands, and Taehyung knows it’s a matter of time until he reaches his release.  </p>\n<p align=\"justify\">Jeongguk seems to know it too, his hand finding purchase in Taehyung’s hair and briefly tightening in warning. “Baby.”</p>\n<p align=\"justify\">Taehyung moves off Jeongguk’s dick, locking their gaze as he drops a hand down to massage Jeongguk’s balls. “It’s okay. You worked hard tonight. Let me take care of you.”</p>\n<p align=\"justify\">For a moment, Jeongguk’s face is unreadable, but then he lets his head roll back again in silent agreement, his hand dropping to the couch. When Taehyung takes him back in his mouth, all the restraint is gone. Taehyung’s lips form a tight seal and he bobs one, two times before Jeongguk comes. Taehyung swallows it all down, Jeongguk’s lewd curses and guttural sounds spurring him on, stoking the fire inside. Taehyung keeps sucking until Jeongguk weakly nudges his shoulder, incapable of taking more.</p>\n<p align=\"justify\">Taehyung gets up off the floor, wincing at the stiffness in his legs and the uncomfortable grazing of fabric across his hard dick. But seeing Jeongguk pull his sweatpants back up and sink back into the couch with closed eyes like Taehyung’s mouth has ruined him more than makes up for it. Trouble.</p>\n<p align=\"justify\">Taehyung settles in Jeongguk’s lap, finding his mouth for the laziest kiss yet, wanting to bask in his glory, in how he turned Jeongguk to mush under his touch. Even if they didn’t talk for almost a month, Jeongguk is just as hungry for him as he was before.</p>\n<p align=\"justify\">Jeongguk pulls away first, skimming the back of his hand over Taehyung’s stomach like a question. “What about you?” Jeongguk’s voice sounds rough with the after effects of his orgasm, sleepiness pulling him under.</p>\n<p align=\"justify\">“Don’t worry about it.” Taehyung is surprised to find he means it. “I’ll be fine.”</p>\n<p align=\"justify\">Jeongguk slips a hand in Taehyung’s sweatpants, clasping a hand around Taehyung’s dick, making Taehyung hiss. Jeongguk gives it an experimental tug. “You don’t feel fine.” Jeongguk’s fingers are so much better than his own have been and Taehyung's hips thrust up with a sudden need. Jeongguk skilfully collects pre-come to smoothen out the slide. “Get on your back and I’ll return the favour.”</p>\n<p align=\"justify\">“No,” Taehyung groans as he lets himself fall forward into the crook of Jeongguk’s neck, hot breath tickling sweaty skin as he pants. “Just touch me.”</p>\n<p align=\"justify\">In another uncharacteristic turn of events, Jeongguk obeys, passing up the opportunity to tease and delay Taehyung’s orgasm. Taehyung is already strung so tight from touching himself and the way Jeongguk squeezes him is just right. It only takes a few hot strokes before the fire coiling in his stomach explodes, flames spreading all the way outwards until he can feel it in the fingertips that are digging into Jeongguk’s shoulder. The low sob ripped from his throat sounds like it isn’t his as his hips stutter through his orgasm, painting both their stomachs white.</p>\n<p align=\"justify\">Taehyung can feel his chest heaving as he tries to catch his breath, his limbs slowly becoming his again as the flames retreat. It’s this brief instant when he can almost forget who he is and what he’s doing, the past and future disappearing until there’s only the warmth of this moment, that Taehyung keeps coming back for.</p>\n<p align=\"justify\">“You cheated,” Jeongguk murmurs, belatedly realizing Taehyung was touching himself before, but his accusation lacks spirit.</p>\n<p align=\"justify\">“I cheated,” Taehyung admits with a faint grin, pulling his sweats back up. His entire body is humming with contentment.</p>\n<p align=\"justify\">Taehyung grabs Jeongguk’s shirt of the couch and dabs at the mess on his own stomach and then Jeongguk’s in lazy strokes. Jeongguk mimics the motion on Taehyung’s back. It’s too good to pull away from, so Taehyung allows himself a few more seconds in Jeongguk’s arms.</p>\n<p align=\"justify\">Jeongguk’s lips trail across Taehyung’s shoulder like an afterthought, leaving his signature marks in their wake. “When are you going to be back?”</p>\n<p align=\"justify\">It takes a few seconds before Taehyung remembers he’s leaving to visit his family in a few days. “After two weeks, I think.” Taehyung threads his fingers through Jeongguk’s hair. “You?”</p>\n<p align=\"justify\">“I’m not leaving.”</p>\n<p align=\"justify\">“You’re not going home for the holidays?”</p>\n<p align=\"justify\">“This is home.”</p>\n<p align=\"justify\">Taehyung’s question of, <em>‘What about your family?’</em> dies on his lips when he feels how rigid Jeongguk’s previously liquid body has become. This isn’t a topic open for discussion. Taehyung briefly massages the knots in he feels in Jeongguk’s neck, the muscles are a mess after sitting behind a laptop for so long, and some of the tension slowly seeps out under his touch. “You should go to bed, Gukkie.”</p>\n<p align=\"justify\">Jeongguk doesn’t respond.</p>\n<p align=\"justify\">Giving the tense muscles one last squeeze, Taehyung slips off Jeongguk’s lap and immediately mourns the loss of heat. He reaches for his shirt and sweater, pulling the clothes over his head. He’s half-resigned to seeing himself out but when he’s dressed, Jeongguk gets up off the couch and follows behind him towards the front door.</p>\n<p align=\"justify\">In the hallway, Taehyung reaches out for the familiar red fabric but stops mid-motion. That one isn’t his; not anymore. He grabs the grey one instead. “Thanks for the scarf.”</p>\n<p align=\"justify\">“Sure.” Jeongguk’s eyes are so dark as he watches Taehyung pull on his shoes and coat. The blackness looks so tired. He looks like he’ll fall the asleep the moment his head will hit the pillow later. Taehyung wants to stay with him. With Jeongguk where it’s warm but he doesn’t ask and neither does Jeongguk.</p>\n<p align=\"justify\">“I’ll see you when I get back?” Taehyung doesn’t know if it’s a question, a statement, or a plea.</p>\n<p align=\"justify\">Jeongguk brushes a hand through his fringe. “Yeah, I’ll text.”</p>\n<p align=\"justify\">Taehyung nods, opens the door and disappears outside into the snow. As he walks back to his place, his shoes get wet again and he knows he’ll have awfully cold toes for the rest of the night. But it’s better than it was before he’d come over. Better than the previous few weeks. Things had changed but maybe they wouldn’t change any further.</p>\n<p align=\"justify\">Taehyung wished he knew if that’s what he wants or not.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">The next day, Taehyung discovers it’s not all about what he wants or what he does. He never finds out if he would have told Jimin eventually. The day before Christmas break things change permanently and Taehyung can’t take any of it back.</p>\n<p align=\"justify\">When Jimin enters their dorm room, he knows. Taehyung just knows Jimin knows. It’s visible in the hurt weighing down the corners of his best friend’s mouth; in the angry creases between Jimin’s brows. Jimin knows.</p>\n<p align=\"justify\">“ChimChim, I can expl—”</p>\n<p align=\"justify\">“Funniest thing happened at dance practice,” Jimin cuts him off in a cold voice. “We’re all done, everyone’s heading out—Happy Holiday cheers and all—and suddenly I see Jeongguk putting on your scarf.”</p>\n<p align=\"justify\">Listening to Jimin feels like a block of ice settling in the pit of Taehyung’s stomach. Suddenly Taehyung can see all the little moments when he should have told Jimin what was going on but hadn’t. All the times when Jimin gave him an opening but Taehyung didn’t take it. The regret is instant, vicious, like a living thing eating Taehyung from the inside and leaving nothing but coldness behind.</p>\n<p align=\"justify\">“And stupid me, I ask Jeongguk how he got his hands on it.”</p>\n<p align=\"justify\">The block of ice grows, Taehyung’s entire chest starts to feel numb but he’s frozen and he can’t move, watching Jimin dump his dance stuff on his bed as he angrily sorts out his belongings.</p>\n<p align=\"justify\">“So Jeongguk says he doesn’t know what I’m talking about and that it’s his scarf but I <em>know</em> that’s not true. Because I’ve <em>seen</em> you, Tae. I’ve seen you drag that tattered red rag with the frayed bottom around for almost a month. Indoors, outdoors, you wore it <em>everywhere</em>.”</p>\n<p align=\"justify\">“Jimin, I—”</p>\n<p align=\"justify\">“I was <em>so</em> fucking worried about you, Tae,” Jimin cuts him off again. His voice sounds so strangled, Taehyung wonders for a minute if Jimin might cry. If he had been crying. “I was driving myself crazy with wondering why you wouldn’t tell me.”</p>\n<p align=\"justify\">Jimin is pulling out his suitcase, dumping it on the bed, putting in the final items after already packing up most of his things the night before. Taehyung wants to tell him to stop but he’s stuck in his seat like an ice sculpture.</p>\n<p align=\"justify\">“I started thinking the weirdest things, Tae. I had all these kind of nightmares about you dating one of the Professors. Or someone who’s already seeing someone else. I don’t know, some dirty old married man—the way you would never stay the night at his place and how he wouldn’t come here. And you just wouldn’t <em>tell </em>me anything, no matter how often I asked.”</p>\n<p align=\"justify\">“I’m sorry. I didn’t—”</p>\n<p align=\"justify\">“But all the while—<em>all </em>this time—you were just getting fucked by Jeon <em>fucking</em> Jeongguk.”</p>\n<p align=\"justify\">Taehyung wishes Jimin would look at him when he talks, would listen to what Taehyung has to say, would give him the chance to explain.</p>\n<p align=\"justify\">“And I could tell that Hoseok hyung knew. And if Hoseok hyung knows, Seokjin hyung knows. <em>Everyone</em> knew. Everyone but <em>me</em>.” Jimin is finally done packing. He finally turns to look at Taehyung who’s still unmoving in his seat. Taehyung discovers he wished for the wrong thing, seeing the hurt and betrayal etched on Jimin’s face just makes it worse. “I feel so stupid, Tae. You made me feel so stupid. Why’d you lie to me?”</p>\n<p align=\"justify\">This is it; Taehyung finally has his chance to speak but the problem is that he doesn’t have anything worth saying. No real excuses. None that make any sense, so he tells the truth instead, “I-I don’t know.”</p>\n<p align=\"justify\">“It’s because you like him, isn’t it?” The way Jimin says it sounds like a factual statement wrapped up in an accusation. “He was just supposed to be another of your one-night stands but he wasn’t and now you like him and you don’t know what to do. And you didn’t want to tell me because you were scared that I’d tell you to get your shit together.”</p>\n<p align=\"justify\">Taehyung’s finally able to get up off his chair. “No, that’s not it. It’s just I—I don’t know. It just happened.”</p>\n<p align=\"justify\">“Jesus, Tae. In denial much?” Jimin yanks the suitcase of his bed. “You’ve been miserable this past month and you’re going to try and tell me that wasn’t about Jeongguk? Why don’t you stop your lying already? Nobody’s buying it but you.”</p>\n<p align=\"justify\">“I’m not…” Taehyung doesn’t know how to finish that sentence. He doesn’t know if he can truly say he hasn’t been lying. But Jimin is reaching for his coat, suitcase at his side and Taehyung feels the chilliness in his body grow. The regret, the panic; it’s all cold. “Where are you going?”</p>\n<p align=\"justify\">“I’m heading over to Minhyun. He’s got one more free seat left in his car, so I’m catching a ride home with him and Ren.”</p>\n<p align=\"justify\">Jimin isn’t even close with Minhyun and Ren.</p>\n<p align=\"justify\">“But we’re going to catch the train tomorrow,” Taehyung says, denial colouring his voice. “Travel the first part together. Just like we always do.”</p>\n<p align=\"justify\">“I know,” Jimin says, coat on, ready to leave. “But I’m really not in the mood for that right now.” He says the next words like it pains him just as much as it does Taehyung, “I need a break.”</p>\n<p align=\"justify\">A break. A break from Taehyung. In all the years they’ve been friends, Jimin has not once needed a break from Taehyung. There’s maybe ten feet between them, Taehyung at his desk, Jimin at the door, but it feels like they’re a world apart. But the distance isn’t sudden, not completely, because it’s been quietly growing for months. Ever since Taehyung started keeping secrets. It increased each time Taehyung dodged Jimin’s questions or brushed aside his best friend’s worries.</p>\n<p align=\"justify\">Taehyung’s voice chokes when he realizes just how badly he has messed things up, “ChimChim, I’m sorry.”</p>\n<p align=\"justify\">Jimin’s face softens somewhat when he takes in Taehyung’s state, the anger dissipating slightly from his features, his gaze taking on a resemblance to its usual kinder self. “Maybe we can travel together on the way back,” he offers like a consolation prize. “After Christmas break.”</p>\n<p align=\"justify\"><em>‘When I’m no longer so upset,’</em> is what Jimin doesn’t say but what Taehyung knows to read between the lines.</p>\n<p align=\"justify\">“I’ll text you when I get to my parent’s place,” Jimin promises as his hand reaches for the door, because he’s soft at heart, even when he’s so angry as well. When he’s halfway through the door, Jimin pauses, releasing a tired sigh. He turns to look at Taehyung with eyes that see and know too much at times because they’ve been friends for too long to still be able to truly hide from one another.</p>\n<p align=\"justify\">“And I do know, Tae,” Jimin says in a gentler voice and Taehyung recognizes it immediately. He instantly knows that he doesn’t want to hear whatever comes next, just like he didn’t want to hear it so many times before. “I know that Namjoon hyung kind of crushed you when he left. I know how much it hurt you when he called you immature and said he didn’t think you were ready for a relationship. But for however book-smart Namjoon hyung might have been, he could be really stupid too. The fact it didn’t work out isn’t all on you. You need to stop keeping people at a distance because you think you’re not right for relationships. That you’re somehow not worthy. Just let it go, Tae.” Jimin’s next words take on a lilt that’s nothing short of pleading, “Stop holding yourself back because of people that aren’t even here anymore.”</p>\n<p align=\"justify\">Taehyung wants to do what he usually does in this situation. He wants to tell Jimin he’s no longer bothered by how some past boyfriends may have discarded him for acting outside of the norm. He wants to say he’s just trying to enjoy college life to the fullest and that there’s time for actual dating when he’s older. He wants to say he just hadn’t met anyone who really captured his interest.</p>\n<p align=\"justify\">But Taehyung’s scared that if he tells Jimin one more lie, he’ll cause a kind of damage that’s beyond repair, so he doesn’t speak at all. There’s nothing but a devastating silence.</p>\n<p align=\"justify\">“I’ll text you when I get home,” Jimin eventually says again, the promise like a small comfort.</p>\n<p align=\"justify\">“O-okay,” Taehyung replies in his stunted deep timbre, the sound of defeat making it even more hoarse.</p>\n<p align=\"justify\">For a second it seems like Jimin might stay, like his sudden anger has diminished enough now that the initial shock of finding out Taehyung had been sleeping with Jeongguk has passed. Now that he sees how sorry and conflicted Taehyung is. Jimin’s temper flares hot and bright at times but he always has trouble sustaining the flames.</p>\n<p align=\"justify\">But Jimin doesn’t stay, leaving Taehyung alone in a dorm room that’s too big for just one person. Too cold without Jimin’s laughter and sunny smile.</p>\n<p align=\"justify\">A small light flickers on his right and Taehyung reaches for his phone on instinct. When he unlocks the screen, he sees the warning signs he so wished he’d caught earlier. One missed call from Hoseok. A text message from Hoseok too: <em>Jimin knows, Tae. I think he’s heading back to the dorm.</em></p>\n<p align=\"justify\">Then Taehyung sees what isn’t there.</p>\n<p align=\"justify\">No missed call from Jeongguk. No text message from Jeongguk either.</p>\n<p align=\"justify\">It’s like he’s halfway to Jeongguk’s apartment before he even realizes what he’s doing. For the first time in weeks, the snow doesn’t bother his toes at all. There’s an anger burning in the pit of his stomach that seems to sizzle hot enough to keep him warm for days.</p>\n<p align=\"justify\">He raps his knuckles on Jeongguk’s front door with too much force, gloves forgotten in his dorm room, the skin chafing so badly it might bleed.</p>\n<p align=\"justify\">Jeongguk opens the door in a large hoodie and beanie. It seems the more clothes he wears, the more distance there is, the more distance he wants. His large frame looms over Taehyung in the doorway with steel is his posture and in his face. He’s rigid and cold. The glint of determination in his eyes shows he’s prepared. Prepared for Taehyung. Jeongguk knows exactly why Taehyung is here.</p>\n<p align=\"justify\">Taehyung balls his hands up in tight fists, nails digging in the palms of his hands. “Why didn’t you try and warn me?”</p>\n<p align=\"justify\">Jeongguk clenches his jaw. “Warn you about what?”</p>\n<p align=\"justify\">“Don’t fucking play coy with me, Jeongguk!” Taehyung explodes, his rage burning so bright at the sight of Jeongguk pretending he doesn’t understand what Taehyung means. “You know exactly what I’m talking about! Why didn’t you warn me about Jimin!”</p>\n<p align=\"justify\">“Because it’s not my fucking responsibility!” Jeongguk bites back, fire in his eyes. “I’ve been lying for you for months. I fucking lied for you today. But it’s not <em>my</em>—” Jeongguk roughly pokes his own chest with his finger “—problem that Jimin doesn’t fall for that shit anymore.”</p>\n<p align=\"justify\">“That’s not the issue, Jeongguk!” Taehyung can feel a sharp sting behind his eyes, tears of frustration threatening to escape. “I’m asking you why you didn’t try to warn me.” Jeongguk rolls his eyes and Taehyung instantly sees red. His life is a fucking mess right now and Jeongguk doesn’t even care. “And maybe he wouldn’t have figured it out if you’d been a little less obvious!”</p>\n<p align=\"justify\">Taehyung immediately regrets the words the second they leave his mouth. There’s a shift in the air, in Jeongguk, in everything. Taehyung had been wrong when he thought Jeongguk was cold before. This person right now, this person who looks nothing like the man he’s been sleeping with and every bit like all the bad rumours, is as hard and unmoving as frozen stone.</p>\n<p align=\"justify\">“Are you trying to tell me I can’t even wear my <em>own</em> fucking scarf?!” There are so many layers to Jeongguk’s hissed words; a question, a challenge, a threat. Taehyung doesn’t know which nuance deserves his attention more. “Why can’t I, Taehyung? Why is it so important to keep me a secret?”</p>\n<p align=\"justify\">Taehyung wants to stay mad so badly. He wants to take all the anger, frustration, and loathing he feels towards himself for messing things up with Jimin, messing things up with everyone, and selfishly project them onto Jeongguk. Easily shift away the blame, guilt, and regret, by passing them on to someone else, but Jeongguk won’t let him. Jeongguk isn’t a pushover.</p>\n<p align=\"justify\">“Jimin wasn’t allowed to know about me,” Jeongguk continues, “even though you keep saying he’s your best friend. And when someone <em>finally</em> fucking catches us in the act—when Hoseok hyung walks in on us—you fucking freeze like a deer in headlights. In fact, you still try and keep it a secret.”</p>\n<p align=\"justify\">There’s so much resentment in Jeongguk’s voice that Taehyung finds it hard to believe he never caught on to it before. But then again, he probably had but tried to smother it beneath playful words and placating touches.</p>\n<p align=\"justify\">“What exactly where you afraid of happening if people knew you were fucking me?” There’s a crack in Jeongguk’s armour. Something flickers across his features that looks a lot like hurt. “Were you scared of what people would think of you? I can’t be all that bad because you had no fucking trouble coming over and letting me turn you inside out each time.”</p>\n<p align=\"justify\">Taehyung feels a wetness on his cheeks. Tears that are too numerous to still be held back. “Why do you even care about that, Jeongguk? It’s not like you were dying to tell the world about me either. All you ever do is complain about my clothes, my friends, the way I act.”</p>\n<p align=\"justify\">Jeongguk huffs a little in disbelief, “That’s because I’m not allowed to talk to you about anything else! Because <em>every</em> time I go just a little off topic, you fucking shut me down and leave!”</p>\n<p align=\"justify\">When Taehyung doesn’t respond fast enough, Jeongguk lets out a small hollow chuckle.</p>\n<p align=\"justify\">“You’re such a fucking coward,” Jeongguk says deprecatingly. “Don’t think I don’t see you looking at my tattoos all the time. Touching them, kissing them—you like the way I look in private just fine—and I know you want to know what they mean. Yet you never ask. You don’t even have the fucking balls for it.” Jeongguk fixes him with a dark judgemental stare. “What exactly do you think is going to change if you know?”</p>\n<p align=\"justify\">“I don’t know!” Taehyung retorts with venom, driven by this overwhelming urge to defend himself. “But I don’t hear you talking about your tattoos either! Or why you’re not going home for the holidays, so don’t you even <em>dare</em> pretend that’s all on me!”</p>\n<p align=\"justify\">“That’s because my dead parents are none of your fucking business!”</p>\n<p align=\"justify\">Taehyung feels like someone just dumped him in a bath of ice water, but judging by the stunned look on Jeongguk’s face, his own words have caused himself an even greater shock.</p>\n<p align=\"justify\">Jeongguk’s head drops down so fast it looks like someone slapped him. He stares at his feet as he roughly adjusts his beanie, takes a deep breath before his shoulders straighten with uncanny resolve. When he locks eyes with Taehyung again, they’re empty and seemingly devoid of emotion.</p>\n<p align=\"justify\">“You know what, Taehyung, get the <em>fuck</em> away from me. And lose my number while you’re at it.”</p>\n<p align=\"justify\">The door is slammed shut in Taehyung’s face with an unmistakable force of finality and rejection before Taehyung even has the chance to think of a response. Although he doesn’t think he’d ever be able to come up with one for what just happened. The scorching heat of fury his veins is gone and the icy despair of regret and guilt is there to immediately replace it. He’s cold and he’s crying and he’s lost. He’s so fucking lost.</p>\n<p align=\"justify\">Taehyung stands there staring at Jeongguk’s door like it might open any second, like Jeongguk might come back and they can pretend this never happened. But Jeongguk doesn’t and Taehyung can no longer feel his fingers, so he leaves. He walks back to campus and passes by his dormitory without stopping—there’s nothing there for him without Jimin—leaves campus again on the opposite side and heads over to another familiar set of apartment buildings. </p>\n<p align=\"justify\">Seokjin doesn’t look surprised to see him, like he’d been waiting for him to show up. Taehyung lets himself fall into the older man’s body like a drowning man clinging to a life raft.</p>\n<p align=\"justify\">“Try not to ruin this dress shirt, Tae. I kind of need it,” Seokjin chastises, but his tone is mild. A hand immediately starts rubbing comforting circles on Taehyung’s back as he embraces Taehyung in his arms without hesitation.</p>\n<p align=\"justify\">“Jimin hates me,” Taehyung chokes into Seokjin’s chest. It’s stupid and whiny and Taehyung knows the words aren’t true but he’s hurting, his chest feels like it’s filled with shrapnel, and he wants someone to coddle him and tell him everything will be okay. Seokjin is his best bet, the closest thing he has to a mother figure at campus.</p>\n<p align=\"justify\">“Don’t be silly, Tae,” Seokjin starts assuring him as if on cue, fingers brushing away the wetness on his cheeks. “You know what he’s like. Jimin’s anger burns hot but it burns all at once. The art of holding a grudge is completely lost on him.”</p>\n<p align=\"justify\">“Is that Taehyung?” Hoseok’s voice calls out from behind Seokjin, but Taehyung can tell the question is merely rhetorical.</p>\n<p align=\"justify\">Taehyung supposes he shouldn’t be surprised to find Hoseok at Seokjin’s apartment. Hoseok and Seokjin may be less similar to each other than Jimin and Taehyung but they’re just as attached at the hip. What one of them sees or hears, the other knows the next day. Between the two of them, they’re rumoured to hold access to all the university’s secrets.</p>\n<p align=\"justify\">Seokjin releases Taehyung to close the door and takes Taehyung’s coat. When Hoseok sees the tear marks on Taehyung’s cheeks, he looks two-thirds sympathetic and one-third weary condemnation. He’s nice enough not to throw the words <em>‘I told you so; I warned you to be careful’</em> in Taehyung’s face but it’s still written in his eyes and impossible to miss.</p>\n<p align=\"justify\">Hoseok’s critical gaze is broken when Seokjin lets out a rather shrill shriek that belies his manly frame the moment Taehyung’s hand accidently brushes against his own. “God, Tae! Why are you so cold?!”</p>\n<p align=\"justify\">“I went to see Jeongguk. We…” Taehyung’s eyes flicker between Hoseok and Seokjin, before taking a deep breath. For the first time in a while he decides to just spill it out and be done with it. “We broke things off; he doesn’t want to see me anymore.</p>\n<p align=\"justify\">Seokjin crosses his arms and narrows his eyes in suspicion. Sometimes he reminds Taehyung of a big pink shark that just smelled blood in the water. Taehyung’s blood. “Is that why you’re so upset?”</p>\n<p align=\"justify\">“No,” Taehyung denies a little too quickly. “It’s Jimin. It’s because of Jimin. We were supposed to travel home together but he’s so mad that he left without me. It’s not—it’s not about Jeongguk.”</p>\n<p align=\"justify\">“Hoseok told me about what’s been going on with you and Jeongguk,” Seokjin says and Taehyung feels a very specific kind of dread settle in his stomach. The problem with a mother figure is that the desired coddling goes hand in hand with the undesired parental reprimands. “From what Hoseok has heard from you and Jimin—from what he’s seen from Jeongguk—it kind of sounds like you were treating him as your personal on call hooker. Like you were both treating each other like an on call hooker.”</p>\n<p align=\"justify\">It hurts hearing it described like that and it almost feels like it doesn’t do whatever was going on between him and Jeongguk justice but Taehyung supposes it does. It’s exactly how he had treated Jeongguk.</p>\n<p align=\"justify\">“I know,” Taehyung admits in a shaky tone, “but it’s college.”</p>\n<p align=\"justify\">“It’s stupid,” Seokjin informs him rather succinctly, pre-emptively cutting through all of Taehyung’s possible excuses before he even has the chance to voice them out.</p>\n<p align=\"justify\">Tough love; Taehyung isn’t a fan.</p>\n<p align=\"justify\">And he knows. Goddammit, he knows. He'd known all along that it was stupid and toxic but after what had happened with Jimin earlier, after what had just happened with Jeongguk, it feels like the knowledge will be seared in his memory until the day he dies. He knows.</p>\n<p align=\"justify\">Taehyung tries to convey just that to Seokjin, putting on his best red-rimmed puppy eyes. He can’t take any more. Someone needs to give him a break and take care of him and help put him back together because he can’t do it by himself. Not right now. Not after Jimin. Not after Jeongguk. There’s nothing left.</p>\n<p align=\"justify\">It’s but a second before Seokjin caves with a deflated sigh and Taehyung supposes it’s a testament to the sorry state he must be in. Perhaps he looks every bit as lost as he feels. The older man uncrosses his arms and reaches out for Taehyung. “Let’s get out of the hallway. I was just about to start making dinner.” He turns to Hoseok. “Did you wash the rice yet?”</p>\n<p align=\"justify\">“It’s already in the cooker,” Hoseok replies, affectionately tousling Taehyung’s hair in silent reassurance when they pass.</p>\n<p align=\"justify\">“Right,” Seokjin says as they make their way to the kitchen. “I suppose I’ll put you both on vegetable duty but you know the rules.” There’s a warning look in Taehyung’s direction. “Under no circumstance is are <em>you </em>allowed near my stove.”</p>\n<p align=\"justify\">Taehyung nods, a little unsure why Seokjin still feels the need to tell him that. He hasn’t been allowed near Seokjin’s stove for years. Not since the <em>Tupperware</em> and open fire incident.</p>\n<p align=\"justify\">They cook and eat and talk about everything that comes to mind that doesn’t involve Jimin and Jeongguk. They talk a lot about the Christmas break and how they will be spending it, Hoseok and Seokjin taking the lead while Taehyung merely has to nod along with the conversation as he tries not to think about Jeongguk or his parents. They talk about graduate school and gossip about people Taehyung doesn’t even really know except for maybe their faces. But they don’t talk about Jimin and Jeongguk for hours, not even when Taehyung gets his text from Jimin and replies with his own, causing Jimin to send him a second text saying Taehyung is the stupidest person he knows but that he loves him even though he still wants to throw him off a building and burn all his clothes, and Taehyung is so grateful.</p>\n<p align=\"justify\">They don’t talk about it until Taehyung is the one bringing it up long after dinner is finished, nestled on the couch next to Seokjin, head buried in Seokjin’s chest. There are snacks on the table, the posh ones only Seokjin ever has or bothers to make, and they’ve already polished off two bottles of wine. Taehyung thinks he might be responsible for finishing one of them all by himself.</p>\n<p align=\"justify\">“He’s got such nice shoulders, hyung. Glorious and wide like the Pacific Ocean.” Taehyung makes an uncoordinated swinging motion with one hand in a poor attempt to illustrate his words. “Just like you. He’s got your shoulders.”</p>\n<p align=\"justify\">“Well, I don’t know about that.” Seokjin clasps his hand together with Taehyung’s, ensuring he won’t poke out someone’s eye with his flailing. “I’m quite sure I’m somewhat unparalleled in the shoulder department.”</p>\n<p align=\"justify\">“He’s not pretty like you,” Taehyung continues undeterred, and Seokjin hums like he hadn’t expected anything else. “But he’s so horribly handsome, hyung. Every time I see him naked, I kind of want to cry.” There’s a displeased sound coming from Hoseok’s direction but Taehyung ignores it. “But sometimes he looks like a bunny too. And it’s so cute but it’s scary too and I don’t know what to do but the bunny’s got like the best dick in the world and—”</p>\n<p align=\"justify\">Hoseok shoots up in a sitting position from where he’s lying on the floor in disturbing speed, like the undead rising up from their coffin. “No, no, no,” he says, waving his hand at Taehyung as if he’s berating a puppy for trying to piss on the carpet. “No stories about Jeongguk’s dick. Or any kind of dick, for that matter. You think he’s handsome and cute and he’s got good game and lets leave it at that.” He falls back to the floor with an agonized groan. “I don’t bother you guys with my wartime stories about vaginas either.”</p>\n<p align=\"justify\">“Don’t mind Hobi, Tae.” Seokjin pats his head like Taehyung is in fact a puppy, unclasping his other hand to reach for his glass of wine. “He’s just saying that because he’s jealous and doesn’t really have any wartime stories. Vaginas or otherwise.”</p>\n<p align=\"justify\">Hoseok’s face contorts in one of his trademark scandalized silent gasps. He shoots up again to launch into an extensive monologue about how he’s the number one bachelor on campus and how Seokjin can’t judge because his <em>‘middle-aged gay ass’</em> hasn’t gotten laid in weeks.</p>\n<p align=\"justify\">The familiar bickering is strangely soothing. The way they tease each other is savage but amusing just like it always is, yet Taehyung can’t muster a proper laugh. Their spats never last long. As usual, his friends’ squabbling quickly evolves into high pitched laughing as they get off topic. Taehyung finds it hard to focus on their conversation, his hazy mind still occupied with bunnies. And bunny teeth. And round bunny eyes. He needs more alcohol.</p>\n<p align=\"justify\">“You know,” Hoseok says, plucking at the snacks on the coffee table when his laughter has subsided. “I’ve been thinking.”</p>\n<p align=\"justify\">“Don’t hurt yourself,” Seokjin offers up dryly, wicked smile curling up the corners of his mouth.</p>\n<p align=\"justify\">Taehyung can almost see Hoseok swallow back a sniping comeback because when someone provides you with free food and expensive wine, you adjust your behaviour accordingly, and if they reciprocated each other’s every teasing remark, the conversation would never progress.</p>\n<p align=\"justify\">“I’ve been <em>thinking</em>,” Hoseok repeats, the words lilting as if he’s challenging Seokjin to interrupt him again. When Seokjin doesn’t, his tone grows more neutral, saying, “and I think that Jeongguk <em>wanted</em> people to find out.”</p>\n<p align=\"justify\">Seokjin’s body posture stiffens with just the smallest amount of tension, interest piqued, eyes alert. “Why?”</p>\n<p align=\"justify\">Hoseok shrugs, as if the answer is simple. “Why else would he wear the scarf?”</p>\n<p align=\"justify\">Seokjin nods sagely as he quietly hums with an understanding that is lost on Taehyung. Or maybe Taehyung just really wants it to be lost on him.</p>\n<p align=\"justify\">“It’s <em>his</em> scarf,” Taehyung argues, voice small, parroting the words Jeongguk threw in his face a few hours earlier with so much spite.</p>\n<p align=\"justify\">“I know, I know,” Hoseok says. “But I’ve seen him with other scarfs; black ones or something equally depressing. He knew you’ve been wearing the red one around for a month but he wore it anyway. A part of him must have guessed Jimin would probably put one and one together.” Hoseok pops a piece of cheese in his mouth. “Trust me, Jeongguk isn’t stupid and he knows Jimin isn’t either.”</p>\n<p align=\"justify\">The following silence is so heavy that Taehyung can hear Hoseok’s words echo in his ears. His stomach churns at the thought that Jeongguk might have intentionally set off the ticking time bomb that Taehyung had knowingly let sit underneath his friendship with Jimin.</p>\n<p align=\"justify\">“You have a point,” Seokjin agrees, twirling the wine in his glass like a well-bred socialite. “How wonderfully passive aggressive.”</p>\n<p align=\"justify\">“But that doesn’t make any sense.” Taehyung shakes his head, desperation colouring his voice, panic even. He really needs Hoseok to be mistaken. “It’s all over anyway. Why did he want people to know so badly?”</p>\n<p align=\"justify\">Seokjin’s fingers are tender as they stroke through his hair, like a mother consoling a child. “I’m not sure, Tae. Maybe he just wanted to take back control and force the issue. See what you would do if Jimin—if people found out.” There’s a little weary sigh, as if the three years of age separating them is an almost unsurmountable span of wisdom and experience. “Maybe he wanted you to tell him it was okay to stop being a secret.”</p>\n<p align=\"justify\">Sometimes a final puzzle piece falls in place, in this case a misty outline Taehyung had already caught eye of and was frantically trying to pretend didn’t exist, and there isn’t a feeling of relief and joy. Instead there’s dark, cold regret when finally glimpsing at the image that could have been but will never be because it’s too little, too late, and the vision is already crumbling at the edges, collapsing into nothingness before it even was something to begin with.</p>\n<p align=\"justify\">There’s a burning behind Taehyung’s eyes, a wetness in his lashes, as he watches his <em>could have been</em> disintegrate into nonexistence. There’s a painful pounding behind his temples as <em>should have done</em> and <em>should have said</em> fill up the empty space left behind. Not even Seokjin cooing over him with soothing murmurs, petting Taehyung’s head buried in his wide chest, helps dull the ache.</p>\n<p align=\"justify\">Taehyung hopes Seokjin has enough red wine to make him forget this day ever happened come morning.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">Taehyung doesn’t forget. Although it’s not for lack of trying and the next day he finds himself all alone on a train that’s about to burst at the seams with the amount of people squeezed inside and with his body stuck somewhere in the stomach-churning state that exists between <em>hungover</em> and <em>still a little drunk</em>. And Jimin isn’t there to hold his hand.</p>\n<p align=\"justify\">Miserable doesn’t even begin to describe it.</p>\n<p align=\"justify\">When Taehyung gets home, he doesn’t fall into his mother’s embrace, he melts into it. As soon as he crosses the threshold, his mind does that strange thing where you seem to revert back to the exact mental maturity you had when you last lived at your parental home. It’s like a time vortex and Taehyung knows it will be merely a day before his mother will be laundering and folding his underwear as he petulantly pouts whenever his father asks him to take out the trash. All his independency at college, where he does his own laundry (forgoing any folding) and only takes out the garbage when there’s a mountain atop the trash bin, will instantly seem like a distant memory. Another Taehyung in another life; a Taehyung who gets picked up by men at bars and fucks them in dance studios without bothering to take off his sweater. At home he’s Taehyung the son; a Taehyung who walks the dog upon his parents' instructions.</p>\n<p align=\"justify\">And during the day it’s easy to forget. College seems a world away when he’s at home or at his grandmother’s house surrounded by his large family, a lot of them just as loud and quirky at times as he can be. Several of his cousins are below ten, a mental age he feels very comfortable being around. When he’s lying at the bottom of a pile of their flailing chubby limbs, their giggling tinkling in his ears, his chest compresses so comfortably that he almost can’t notice the uncomfortable chill that now lives there. </p>\n<p align=\"justify\">But there are also times when Taehyung remembers not everyone can escape beneath a human blanket of little children or into their grandmother’s hugs.</p>\n<p align=\"justify\">In one of those moments, Taehyung seeks the help of that one uncle who always drinks too much and tells tawdry jokes. It’s late in the evening on the first day of Christmas and his uncle keeps topping up his glass and Taehyung keeps chugging it down as his mother sends disapproving glances their way. But she doesn’t intervene in time and it’s somewhere around midnight when the drunk Taehyung does what the sober Taehyung was too scared to do and he ends up sending Jeongguk a text. The next morning it takes him five minutes to decipher the message he actually sent, butchered by autocorrect and his own spelling mistakes, and it’s something along the lines of; <em>Merry Christmas</em>, <em>I’m sorry</em>, <em>tattooed</em> <em>bunny</em>,<em> I miss you </em>and something more about<em> cute little bunnies</em>.</p>\n<p align=\"justify\">Taehyung lays off the alcohol after that.</p>\n<p align=\"justify\">Jeongguk never texts back.</p>\n<p align=\"justify\">But Jimin calls and Taehyung calls Jimin. A lot. Things aren’t the way they were before; before Taehyung started lying to him a few months back or even before Jimin found out about Jeongguk. There are small cracks in the veneer of their friendship that need a little more time to be painted over and disappear like they were never there but at its core their friendship is as strong as ever. They’re best friends. Bros before not bros.</p>\n<p align=\"justify\">And Taehyung can almost detect something akin to relief in Jimin. Relief it’s merely Jeon Jeongguk, someone Jimin may bicker with at dance practice but who seems pretty harmless beneath the tattoos, instead of somebody much worse. Taehyung doesn’t know if he’s offended or flattered at the notion that Jimin thought he might have managed to enter an illicit affair with a married Professor. Mostly offended probably but he supposes that’s what you get for keeping secrets.</p>\n<p align=\"justify\">Jimin called again fifteen minutes ago and now Taehyung finds himself lying on his bed in some old ripped jeans he found in the back of his closet that he’s contemplating taking back with him to university. The days in the dead zone between Christmas and New Year’s Eve feel strange, being in his old room surrounded by his high school stuff even stranger still, and Jimin’s voice, a bit shrill and mechanical through his phone’s speakers, is a welcome distraction.  </p>\n<p align=\"justify\"><em>“God, driving home with Minhyun and Ren was the worst thing ever. I’ve seen things, Tae. I tried washing my eyes with soap but it’s too late, it’s already seared into my brain. I tried escaping at a gas station but they promised me they would tone it down and I fell for it like the gullible idiot that I am.” </em>There’s a disgruntled little huff. <em>“I’m so taking the train back up to uni with you. I’m never setting foot in that car again.”</em></p>\n<p align=\"justify\">Taehyung can’t help but feel a little pleased at Jimin’s misery, a little reassured that no one’s capable of stealing his spot as Jimin’s best friend even when they’re fighting.</p>\n<p align=\"justify\">“I’ll bring candy for in the train and pour hot cocoa over everyone who tries to engage in PDA,” Taehyung assures him. “It’ll be fun.”</p>\n<p align=\"justify\"><em>“Ugh, no candy, please.”</em> Jimin sighs a little sadly. <em>“I’m eating so much during the holidays already. I’m going to get fat. Who is going to date me then?”</em></p>\n<p align=\"justify\">Taehyung can feel his skin starting to itch with irritation. Jimin and the way he diets and exercises relentlessly from time to time aches at Taehyung’s heart. Whatever his best friend does, he should do for himself only and not to please the boys at college. The boys at university are idiots. Isn’t Taehyung a prime example of that?</p>\n<p align=\"justify\">“Someone who likes you for something besides your abs, like he should,” Taehyung chastises. “How’s the Teaching Assistant doing anyway? The popsicle one.”</p>\n<p align=\"justify\"><em>“Straight,” </em>Jimin deadpans immediately.<em> “He showed me all this pictures of his girlfriend on his phone. I think it was his way of low-key telling me to stop staring at his ass.”</em> Jimin releases a pitiful whine and Taehyung can almost see him cover his face with one hand in despair. <em>“God, Tae. It was the most embarrassing thing ever. I can never go back.”</em></p>\n<p align=\"justify\">Taehyung tries not to snort a little with laughter, he really does, but it’s so hard. “Just how intensely were you staring at his ass that he felt he had to ward you off with pictures?”</p>\n<p align=\"justify\"><em>“I don’t know.” </em> There’s the sound of slight giggling. <em>“He wore like the tightest pants. How could I not stare?” </em>The giggling tapers off into a little resigned sound. <em>“Besides, that class is torture. I can literally feel myself dying on the inside each time I have to attend a lecture, so I may or may not have fantasized about how the TA looks like without his clothes to stay awake. Desperate times and all.”</em></p>\n<p align=\"justify\">Taehyung says what he always says when Jimin talks about how much he hates the courses he’s taking, “You should change majors, ChimChim. Do something in the Arts.”</p>\n<p align=\"justify\">There’s a short silence on the other end of the line and Taehyung knows he’s hit a nerve. He always does when he says that.</p>\n<p align=\"justify\"><em>“I’ve bestowed upon you the gracious gift of my forgiveness like five seconds ago, Tae. But you're already nagging me about my science major again.” </em>There’s a slight annoyance in Jimin’s voice but no fire. <em>“Are you already trying to get back on my bad side?”</em></p>\n<p align=\"justify\">“I think this might constitute as emotional blackmail,” Taehyung accuses with a little whine, a little peeved by the fact Jimin is using his lingering guilt as a way to stop him from bothering Jimin about school. “That’s not a good foundation for a friendship.”</p>\n<p align=\"justify\"><em>“This is me taking advantage of the fact that you screwed up just like any good friend would,” </em>Jimin declares without an ounce of regret. <em>“Such is life.”</em></p>\n<p align=\"justify\">Taehyung scoffs a little. “I need new friends.”</p>\n<p align=\"justify\">\n<em>“No one will put up with your crazy but me.”</em>\n</p>\n<p align=\"justify\">“Whatever, I’m adorable. Lots of people want to be friends with me.” Taehyung brushes his hand over the rips near his knees. People might make fun of the holes he always cuts in his clothes but he knows the glimpses of his golden skin tantalize people. They attract dark, round eyes that can’t look away. “I’ve once seen one of Jeongguk’s friends in passing. He was short like you but—”</p>\n<p align=\"justify\">\n<em>“I’m not short!”</em>\n</p>\n<p align=\"justify\">“—he looked a hundred times scarier than you do—”</p>\n<p align=\"justify\">\n<em>“I can be scary!”</em>\n</p>\n<p align=\"justify\">“—and Jeongguk calls him hyung like he means it and it’s all very suspicious.”</p>\n<p align=\"justify\">\n<em>“Suspicious?”</em>\n</p>\n<p align=\"justify\">“That he calls him hyung.”</p>\n<p align=\"justify\">\n<em>“He calls Hoseok hyung.”</em>\n</p>\n<p align=\"justify\">“But not like he means it.”</p>\n<p align=\"justify\">Jimin hums a little in contemplation. <em>“You know, for someone who wouldn’t talk to me about Jeongguk before, you now always seem to find a way to bring the conversation back to him.”</em></p>\n<p align=\"justify\">For some reason that remark makes Taehyung feel like a little kid caught with his hand in the cookie jar. “No, I don’t.”</p>\n<p align=\"justify\"><em>“Yes, you do. You like him.” </em>There’s no accusation or teasing tone to Jimin’s words. He says it like he knows it to be true, just like how he knows the world is round and the earth revolves around the sun.</p>\n<p align=\"justify\">“How can I even really like him? That makes no sense. I don’t even really know him.”</p>\n<p align=\"justify\">\n<em>“What on earth are you talking about, Tae? You’ve been sleeping with the guy for months.”</em>\n</p>\n<p align=\"justify\">“I know.” Taehyung pokes a finger through the hole in his jeans. “But that’s all we do. It’s just sex.”</p>\n<p align=\"justify\">Jimin releases a long and exasperated exhale of breath at the other end of the line, the flow of air creating an uncomfortably loud, static noise that has Taehyung pulling the phone a few inches off his ear. <em>“Do you really think you can only get to know someone by having deep conversations about the meaning of life? All the little things add up, Tae. Even if you try to compartmentalize it and never stay the night. You can’t go at it for weeks like bunnies and expect not to learn anything about each other.”</em></p>\n<p align=\"justify\">Bunnies, go figure. Taehyung makes the hole is his jeans a little bigger. “I suppose.”</p>\n<p align=\"justify\">\n<em>“Isn’t, like, eighty percent of communication non-verbal anyway?”</em>\n</p>\n<p align=\"justify\"><em>“</em>Two-thirds,” Taehyung corrects automatically.</p>\n<p align=\"justify\">\n<em>“Whatever, that’s still a lot.”</em>\n</p>\n<p align=\"justify\">“I guess.” Taehyung bites his bottom lip as he rips the fabric around his knee all the way to the seams on the sides, creating a ridiculously large gap but that’s the fashion these days, so it’s not like it matters.</p>\n<p align=\"justify\">\n<em>“Tae?”</em>\n</p>\n<p align=\"justify\">“Yeah?”</p>\n<p align=\"justify\">\n<em>“Does he call you hyung?”</em>\n</p>\n<p align=\"justify\">Taehyung laughs. A proper laugh that makes his ribs ache. He hasn’t laughed like that in days. He wipes away the tears that have gathered in his lashes when the shaking subsides enough for him to talk, “Are you going to throw a tantrum if he does?”</p>\n<p align=\"justify\"><em>“Yeah,”</em> Jimin whines, the noise a little piercing over the phone. <em>“I think I might throw him down a flight of stairs when he isn’t looking. High ones at that.”</em></p>\n<p align=\"justify\">Taehyung releases a bit more hiccupped laughter. “He doesn’t call me hyung.”</p>\n<p align=\"justify\">There are a few seconds of silence before Jimin’s voice is back, the words dripping with suspicion, <em>“What does he call you? It’s something dirty, isn’t it? Wait, what—no, I don’t wanna know. Don’t tell me.” </em>Another short silence. <em>“Okay, I wanna know, tell me. Tell me before I change my mind.”</em></p>\n<p align=\"justify\">“Baby,” Taehyung chokes out between shaky laughs, already filled with glee at the horror he can imagine on Jimin’s face. “He calls me baby.”</p>\n<p align=\"justify\"><em>“Tae!”</em> There are gagging noises like Jimin might actually be sick. <em>“How can you let him call you that?! He’s two years younger than you, he’s basically just a big nosed foetus.” </em>Another heaving sound.<em> “That’s disgusting.”</em></p>\n<p align=\"justify\">“He gets off on it.” Taehyung giggles deep and hoarse, yet strangely child-like. “It makes him feel all big and tough.” He rubs his hand across his chest. “It’s cute. Gukkie is cute.”</p>\n<p align=\"justify\">\n<em>“What a little brat. I told you a hundred times already; the little turd has no respect for his seniors.”</em>\n</p>\n<p align=\"justify\">“You shouldn’t call him little,” Taehyung snickers. “There’s nothing <em>little</em> about him.”</p>\n<p align=\"justify\"><em>“Oh my God, Tae.”</em> A tortured groan. <em>“You have the lamest sense of humour. Seriously.” </em>But then Jimin starts snickering as well and Taehyung knows he has him hooked. <em>“Besides, everyone knows it isn’t the size that matters; it’s what you do with it that counts.”</em></p>\n<p align=\"justify\">Taehyung laughs so hard that the dog comes up to his room to check on the noise, as does his mother. He laughs until he knows his muscles are going to ache for days. He laughs because he and Jimin are stupid and lame together and will probably be that way together until they’re eighty and that makes him happy. Jimin laughs too.</p>\n<p align=\"justify\">When they finally recover from their fit, they talk about family and how nice and weird it is to be home. Taehyung stares at the ceiling, counting the cracks. Later on, he balances a text book on his feet, almost blinding himself permanently as it falls towards his face with a sharp corner heading for his left eye, all the while listening to Jimin puttering about around his own house.</p>\n<p align=\"justify\">A set of familiar sounds catches Taehyung’s ear after he successfully deflects his book and saves his vision. “Are you drawing something?”</p>\n<p align=\"justify\">\n<em>“In a minute. Just taking out my pencils.”</em>\n</p>\n<p align=\"justify\">“Draw me something pretty.”</p>\n<p align=\"justify\">\n<em>“Haven’t I given you enough pictures?”</em>\n</p>\n<p align=\"justify\">“Put your name on it too. I’m going to sell them all for big bucks when you’re a world famous artist.”</p>\n<p align=\"justify\"><em>“As if,”</em> Jimin snorts. <em>“I’m not going to be an artist. There’s no money in starving. Besides, if I was, I wouldn’t be taking </em>Environmental Chemistry and Physics<em>.”</em></p>\n<p align=\"justify\">“I’m not giving up hope.” Taehyung bites his lip in contemplation. “Make it a puppy wearing a bow tie.”</p>\n<p align=\"justify\">\n<em>“You have very unique tastes. You’ll have trouble selling this later.”</em>\n</p>\n<p align=\"justify\">“Don’t be silly. Everyone loves puppies.”</p>\n<p align=\"justify\">If Taehyung listens carefully, he can hear the scratching of Jimin’s pencils on paper. He contemplates telling Jimin the bow tie is supposed to have polka dots, like it’s counterpart on the mug, but decides against it.</p>\n<p align=\"justify\">“This is nice.”</p>\n<p align=\"justify\">Jimin hums.</p>\n<p align=\"justify\">“Being able to talk to you, I mean. About this. About him.” Taehyung sighs deeply and remorsefully. “I’m sorry I didn’t tell you sooner, ChimChim.”</p>\n<p align=\"justify\">\n<em>“I know, you said that already.”</em>\n</p>\n<p align=\"justify\">“But still, I don’t know what I was thinking.”</p>\n<p align=\"justify\">\n<em>“You weren’t thinking. You were being stupid. We all are sometimes. It’s all the hormones and the beer and the greasy food at college. It does funny stuff to our brains.”</em>\n</p>\n<p align=\"justify\">“You’re probably right.”</p>\n<p align=\"justify\"><em>“You don’t have to tell me that.\" </em>Jimin snorts.<em> \"And I've been forced to watch you inhale your food more times than I can count. Eating like a pig can’t be healthy.”</em></p>\n<p align=\"justify\">“Don’t lie. Seokjin hyung is the one who eats like a pig. It’s a joy watching <em>me</em> eat.”</p>\n<p align=\"justify\"><em>“Don’t think so,” </em>Jimin disagrees<em>. “And the rest of your stupid behaviour is probably Jeongguk’s bad influence. Jeongguk and his dick that calls your name at night.”</em></p>\n<p align=\"justify\">“You really hate him that much?”</p>\n<p align=\"justify\">\n<em>“Of course not. I don’t hate on babies.”</em>\n</p>\n<p align=\"justify\">Taehyung can’t supress a snigger. “You’re so mean, ChimChim. If you treat him like this all the time, I’m not surprised he doesn’t call you hyung.”</p>\n<p align=\"justify\"><em>“Well, he started it,”</em> Jimin mutters. Taehyung can hear the crumpling of paper as Jimin probably discards a drawing that doesn’t live up to his high artistic standards. <em>“And he is, you know—a little kid. Beneath all the angst and the tattoos and the seemingly never-ending reserve of basic shirts and beanies. I mean—does he even own anything else? Have you ever snooped around in his closets?”</em></p>\n<p align=\"justify\">“He’s got <em>Iron Man</em> socks but I’m not allowed to wear them.”</p>\n<p align=\"justify\"><em>“Right. </em>Iron Man<em>, of course. Anyways, that’s not my point. I’m saying that I think he’s just a little kid beneath the tough guy persona. He doesn’t like that idea of mine.”</em></p>\n<p align=\"justify\">Taehyung takes a few moments to digest Jimin’s words. There’s a niggling feeling in the back of his head that there’s more to that story. “Did you go all maternal on him like Seokjin hyung does to us?”</p>\n<p align=\"justify\">The scratching of pencils stops.</p>\n<p align=\"justify\">“<em>I might have,”</em> Jimin admits begrudgingly. <em>“Didn’t go over all that well. It’s just—I couldn’t help it, you know? Whenever we have big showcases and everyone’s family comes to watch he’s—”</em></p>\n<p align=\"justify\">“—all alone,” Taehyung finishes. The mental image is like an ice-pick to the chest.</p>\n<p align=\"justify\"><em>“Yeah. Not all alone, of course. He has his friends—he’s not that emo—but still.” </em>Another crumpling sound. Jimin can’t draw very well when he’s worked up about something<em>. “And I saw him in the park once, playing with an old lady’s dog. He looked like an overgrown twelve-year-old with tattoos, it was weirdly cute. You probably would have gone all heart eyes over him.”</em></p>\n<p align=\"justify\">“I don’t go all heart eyes.”</p>\n<p align=\"justify\"><em>“Yes, you do. If not for him, it would have been for the puppy.”</em> Jimin’s voice sounds a little calmer now. Taehyung knows he’d been right; Jimin cares. Jimin always cares. <em>“I can’t believe they’re actually people at school that think he beats people up for a living. Everyone with half a brain can see he’s all bark and no bite. I bet he started that rumour himself.”</em></p>\n<p align=\"justify\">“ChimChim?”</p>\n<p align=\"justify\">\n<em>“Yeah?”</em>\n</p>\n<p align=\"justify\">“You’re cute.”</p>\n<p align=\"justify\"><em>“Kim Taehyung! Don’t flirt with me all shamelessly,\" </em>Jimin scolds teasingly. <em>\"I'm making you one drawing and that’s it.”</em> Taehyung knows nobody else who lights up as brightly upon receiving a compliment as Jimin does. He can almost feel the rays of happiness through the phone.</p>\n<p align=\"justify\">“That’s okay. I still think you’re cute.”</p>\n<p align=\"justify\"><em>“Of course,”</em> Jimin agrees and Taehyung can almost envision him preening in his seat. <em>“But don’t think I don’t notice when you’re trying to change the subject. You should talk things over with him, Tae. Put this drama to bed one way or the other. You’re going to make dance practice and show cases so weird for me if you don’t. You owe me that. You owe it to yourself and him too.”</em></p>\n<p align=\"justify\">Taehyung gets to work on the rips on his other pant leg, easily tearing the soft and worn fabric of the denim. “He literally told me to get the fuck out of his face and lose his phone number.”</p>\n<p align=\"justify\">Jimin’s end of the line goes completely quiet. <em>“Well,”</em> he says eventually, <em>“clearly he’s a tad bit upset. But, you know, people say mean things in the heat of the moment.”</em></p>\n<p align=\"justify\">“I texted him I was sorry on Christmas day. Wished him a Merry Christmas and stuff.” Taehyung wraps his arm around himself. “He didn’t respond.”</p>\n<p align=\"justify\">\n<em>“I’m not sure if this is really a texting matter, Tae.”</em>\n</p>\n<p align=\"justify\">“I know. It was a drunk text, anyway. He probably just deleted it.”</p>\n<p align=\"justify\"><em>“You’re hopeless,” </em>Jimin groans exasperatedly.<em> “And Jeongguk is just being his emotionally constipated self. You know what little kids are like when they’re constipated, they get all moody and prone to temper tantrums.”</em></p>\n<p align=\"justify\">“I feel like Jeongguk might be the type to hold a grudge,” Taehyung says softly, admitting to his insecurities. “He doesn’t seem like the type to forgive easily.”</p>\n<p align=\"justify\"><em>“Maybe,”</em> Jimin says noncommittedly, but Taehyung can tell he thinks Taehyung’s words are true with the way his voice wavers. <em>“But you won’t know until you try. And it’s not like it’s all your fault because Jeongguk is an ass. You two are both stupid.”</em></p>\n<p align=\"justify\">Taehyung tries to think clearly but a thick fog of confusion settles over him whenever his thoughts concern Jeongguk. He feels confused about Jeongguk and himself. About Jimin too. “I never thought you’d react like this. I thought you would tell me to forget about him and find somebody nice.”</p>\n<p align=\"justify\">\n<em>“You don’t think he’s nice?”</em>\n</p>\n<p align=\"justify\">“<em>I</em> think he’s cute. But you’re not exactly his biggest fan.”</p>\n<p align=\"justify\"><em>“Well, it would have been great if you had picked just about any other member of my dance team who isn’t Jeongguk. But Hoseok and Seokjin hyung make it sound like maybe he likes you and I know you like him. I’d rather see you happy with him than hopping from one-night stand to one-night stand because you think nobody wants you to stick around for the long run.” </em>Jimin exhales a worried breath and Taehyung can easily imagine the concerned face that matches it. <em>“Just be careful, Tae. Jeongguk has a lot of baggage and he can be a real callous dick. He proved that when he waved that stupid red scarf in my face. I don’t want you to get hurt.”</em></p>\n<p align=\"justify\">Jimin cares. Jimin always cares so much.</p>\n<p align=\"justify\">Taehyung’s voice sounds suspiciously hoarse when he speaks his next words, “I love you, ChimChim.”</p>\n<p align=\"justify\">\n<em>“I love you too, TaeTae.”</em>\n</p>\n<p align=\"justify\">Eventually Taehyung’s mother gets impatient, as does Jimin’s, complaining they’re roommates who see each other whole year round and that they should focus a little more on family for the holidays. The next days, Taehyung dutifully babysits his little cousins, although it can’t really be called babysitting when you just let them run wild and join in on all the mischief. Whenever they come close to getting in trouble, his grandmother is there to save the day without fail. She always did spoil him rotten.</p>\n<p align=\"justify\">The start of the new year is marked with a lot of happy cheering and well wishes. When Taehyung’s mother kisses his cheek and strokes his hair affectionately at midnight, Taehyung feels completely warm for the first time in days. But it's only seconds later when that warmth is replaced by a strange feeling of guilt for having such a happy home even though his rational mind keeps telling him he shouldn’t have to feel that way. He doubts Jeongguk would ever want him to feel that way.</p>\n<p align=\"justify\">Taehyung ends up texting all his friends and the family that couldn’t make it to his grandmother’s house, receiving so many texts in return. It’s not until the next morning when Taehyung discovers a late text amidst all the others, from a number he didn’t text first the previous night, received at three in the morning when he already went to bed.</p>\n<p align=\"justify\">\n<em>Happy New Year. -Guk</em>\n</p>\n<p align=\"justify\">No autocorrect. No spelling mistakes. No alcohol.</p>\n<p align=\"justify\">It’s all Taehyung needs.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">Jeongguk’s text is all Taehyung needs to dive in headfirst.</p>\n<p align=\"justify\">Jimin graciously allows him to ditch their plans of coming back up to university together while Seokjin gives him the blessing to crash at his apartment with the spare key kept safe by his downstairs neighbour. His parents are surprised but let him leave the nest early despite their disappointment and the next day Taehyung is back on campus, half a week before the dorms reopen and the rest of the students will join him.</p>\n<p align=\"justify\">Without the other students, the college isn’t the same. It’s easy to forget the university’s size when its squares are filled with people but now that it’s empty, Taehyung feels dwarfed by the tall buildings. He only hears his own footsteps, his own breathing, in a place that’s meant for thousands of people. Besides the occasional lost wanderer like him, the campus is a ghost town.</p>\n<p align=\"justify\">Taehyung is almost glad when he reaches the other side and enters civilization again, his feet following the path to Jeongguk’s apartment almost automatically. But he isn't glad, not with how unbelievably queasy his stomach is feeling. After months of burying his head in the sand, he has looked up at the proverbial sky and done a complete turnaround, went from 0 to a 100 in 0.1 seconds. This kind of dramatic and impromptu behaviour is exactly the reason why some of his previous boyfriends cut him loose. He knows it is. Yet Taehyung can’t help himself. He’s still walking. He’s still making his way over to Jeongguk’s apartment. He’s still carrying a large bag of Chinese takeout.</p>\n<p align=\"justify\">The food is a peace offering of sorts; one of which Taehyung isn’t so sure how effective it will be. People tend to become more obliging when placated with food and it works with Taehyung but he fears that Jeongguk’s willpower is a lot stronger than his.</p>\n<p align=\"justify\">When Taehyung arrives at Jeongguk’s door, he can’t bring himself to knock. He doubts bringing Chinese food, when maybe he should have gone for fried chicken instead. He doubts coming over to Jeongguk’s apartment and getting on that morning train. He questions all his choices that got him to this point. But then his toes grow frosty and he fears the food will follow and he can’t wait any longer. He finally knocks.</p>\n<p align=\"justify\">It’s always the cold that motivates him.</p>\n<p align=\"justify\">Taehyung is about to knock again but then the door opens. It’s another one of those moments when Taehyung wishes he’d captured Jeongguk’s face on camera because (for almost three full seconds) the expression painted before him is nothing but honest bewilderment. Jeongguk is usually quite good at remaining unfazed by Taehyung’s out-of-the-box behaviour, capable of schooling his expressions, his face often a mixture of slight exasperation, mild surprise, and (at good times) a significant glimmer of amusement. It’s not often that he truly shocks Jeongguk and he wonders if there are a lot of people that can. Taehyung wonders if Jeongguk hates being surprised like that.</p>\n<p align=\"justify\">“What are you doing here?” It’s obvious just how perplexed Jeongguk is by the way there isn’t even room for any other emotion than shock in his voice.</p>\n<p align=\"justify\">“You texted me.” Taehyung’s normally deep tones sound too high-pitched, the shaky syllables reflecting the doubt and insecurity swirling in the pit of his stomach.</p>\n<p align=\"justify\">If possible, the disbelieve on Jeongguk’s face grows even larger, his eyebrow piercing disappearing somewhere far under the fringe of his hair. “So you just hopped on a train and came over?” When Taehyung doesn’t respond fast enough, the surprise on Jeongguk’s face has time to ebb and gives way to the familiar hard lines resentment, his body growing rigid in the hallway. “You do realize I sent that to practically everyone in my phone, right?”</p>\n<p align=\"justify\">That can’t be true. Taehyung can’t accept that to be true because he came all the way here because of that text. People don’t send texts like that to other people at three in the morning if they don’t mean it. It wasn’t a drunk text. If Jeongguk didn’t want to reach out to him, he would have taken more care to avoid him. Hoseok said it before, Jeongguk isn’t stupid.</p>\n<p align=\"justify\">Taehyung slowly motions his head from left to right in denial. “I don’t believe you.”</p>\n<p align=\"justify\">Jeongguk stiffens even further and crosses his arms over his chest, making him look so broad and impenetrable, and his voice becomes as biting as the frosty wind outside, “Are you here for sex? Because I think we can both find other people for that.”</p>\n<p align=\"justify\">That hits Taehyung right where it hurts. He’d been so busy trying not to consider the likelihood that Jeongguk had already found other people for that. Jeongguk is handsome and Taehyung might have been on his own when they didn’t talk for a month, with his family during Christmas break, but that doesn’t mean Jeongguk had been alone. It doesn’t mean Taehyung’s absence in Jeongguk’s bedsheets wasn’t compensated for with the heat of somebody else. Somebody better.</p>\n<p align=\"justify\">“I’m not here for sex.” Taehyung lifts the bag he’s holding up a little in a weak attempt to entice Jeongguk. “I brought food. I…I want to talk.”</p>\n<p align=\"justify\">Jeongguk stares at the bag of food like it might contain a bomb before brushing his hand through his hair rather brusquely, something Taehyung is starting to identify as a sign of Jeongguk’s nerves, a sign that he isn’t quite sure what to say or do. And Jeongguk does look confused at the moment. Confused and angry and a little lost despite his harsh words. His tough demeanour seems ironically fragile, like it might break if Taehyung taps it a little too hard.</p>\n<p align=\"justify\">Taehyung wants it to break.</p>\n<p align=\"justify\">“Gukkie,” Taehyung pleads in a soft voice, eyes wide and imploring. “I feel bad about what happened. About our fight. I want to talk about it. I want to try and make it right.”</p>\n<p align=\"justify\">Jeongguk drops his gaze to the floor and rubs the back of his neck. Something that sounds like a cross between a disbelieving huff and a hollow snigger leaves his mouth. “And what if you can’t make it right?”</p>\n<p align=\"justify\">The words chill Taehyung all the way down to his bones. It’s a possibility he’s been trying very hard to ignore these past days.</p>\n<p align=\"justify\">“I want…I want to try.” Taehyung wants to show him just how badly he wants to try but it’s hard when Jeongguk still has his eyes cast downwards. “If the talking—if it doesn’t help, I’ll leave. I’ll let you be.”</p>\n<p align=\"justify\">When Jeongguk takes a step back, Taehyung braces himself for the impact of the door slamming shut in his face again but it never comes. Jeongguk merely turns and walks back into his apartment, leaving the entrance open for Taehyung.</p>\n<p align=\"justify\">Collecting all his courage, Taehyung steps over the threshold and into the hallway. After closing the door and removing his coat and scarf, Taehyung cautiously enters the living room where Jeongguk is already setting down two plates on the coffee table in case they need it. Taehyung joins him on the floor, taking out all the food cartons and the wooden chopsticks to arrange them on the table in awkward silence.</p>\n<p align=\"justify\">Jeongguk is the first to start eating, saying nothing and grabbing a carton seemingly at random. Taehyung follows his example, despite his queasy stomach, and the sound of them eating does nothing but make the quiet between them boom even louder.</p>\n<p align=\"justify\">Taehyung is supposed to talk about why he’s here, confess what he’s feeling, but he can’t. Not like this. Not when Jeongguk is so far away even though they’re a mere two feet apart. Not when it seems so likely that Jeongguk won’t want to hear what he’s got to say.</p>\n<p align=\"justify\">Taehyung spots a few empty liquor bottles and before he can stop himself, he’s saying something completely else, “How did you spend the holidays?”</p>\n<p align=\"justify\">Jeongguk’s chopsticks freeze mid-motion, eyes dark in warning as they focus on Taehyung. “Are you asking me if I spent them sad and alone? Curled up on the couch with a bottle of booze?”</p>\n<p align=\"justify\">Taehyung supposes that in a way he is asking if Jeongguk was alone this past week but not in the pitying way Jeongguk is implying. Not like that. “No, I’m asking you how you spend the holidays.”</p>\n<p align=\"justify\">It’s a full two seconds till Jeongguk breaks his punishing gaze and focuses his attention back on the food. “I spent the holidays with Yoongi hyung mostly—a few other friends—but mostly Yoongi hyung.” Jeongguk twirls the chopsticks absentmindedly in the carton he’s holding. “We spend most holidays together because he doesn’t go home much.” There’s a brief pause like he doesn’t know if he should continue. “His parents; they don’t agree with his tattoos. His pink hair. His music. Anything that makes him <em>him</em>, really.”</p>\n<p align=\"justify\">“That must be hard,” Taehyung eventually says for lack of anything better. He’s never been in the position where his parents didn’t support him. He’s never felt he couldn’t go home for the holidays.</p>\n<p align=\"justify\">From the corner of his eyes, Taehyung watches Jeongguk eat the food he brought. Some of the hardness has seeped from Jeongguk’s features, so maybe hot food does mellow people out and it doesn’t just work on Taehyung. Maybe the silence is just as horrible for Jeongguk as it is for him and maybe Jeongguk is just as eager to break it with words. Perhaps they could talk some more.</p>\n<p align=\"justify\">“You two seem really close.”</p>\n<p align=\"justify\">Jeongguk shrugs. “He’s an old friend of my brother. When Junghyun hyung went abroad on a scholarship and I stayed behind, Yoongi hyung kind of took me under his wing. I was young and naïve and I didn’t realize I was making a deal with the devil.” He switches to another food carton. “Every night I pray for him to make it big, so I’ll no longer have to help him drag his sound equipment to every gig and back.”</p>\n<p align=\"justify\">The words are acerbic, said without a laugh to soften the blow, but Taehyung can’t believe Jeongguk actually means it. Taehyung can only imagine how much their company must mean to each other in their current situation. He also realizes what it means that Jeongguk is sharing this personal information with him, even though their conversation is stunted and full of uncomfortable pauses, and Taehyung’s stomach finally settles down. That Jeongguk is telling him this means he hasn’t shut Taehyung out completely, <em>isn’t</em> shutting him out completely.</p>\n<p align=\"justify\">“He has gigs? Is he in a band?”</p>\n<p align=\"justify\">Jeongguk shakes his head. “Yoongi hyung raps.”</p>\n<p align=\"justify\">Taehyung grabs the carton with stir-fried shrimp as he tries to picture the short pink-haired man rapping in his drunk voice, syllables rolling. “I can see that.”</p>\n<p align=\"justify\">“Yeah, he’s good,” Jeongguk confirms as he accepts the carton when Taehyung is done with it, fingers briefly brushing against each other.</p>\n<p align=\"justify\">Taehyung can feel his cheeks heat up and he wonders if this small touch is really making him blush. “Do you rap?”</p>\n<p align=\"justify\">“I’ve sung a few background vocals on his tracks. He says I did ‘alright’.” Jeongguk rolls his eyes a little. “I think it was a euphemism for ‘you’re cheap and I can’t afford a decent singer’.”</p>\n<p align=\"justify\">An amused snort escapes Taehyung and Jeongguk looks at him in surprise. Taehyung offers him an insecure smile in return. “Wouldn’t he have taken you off the tracks if you weren't good?”</p>\n<p align=\"justify\">There’s that unreadable expression in Jeongguk’s eyes again but then he breaks contact and directs his gaze back to what’s left of the food. “I suppose.”</p>\n<p align=\"justify\">A sudden curiosity grapples at Taehyung, he wants to hear Jeongguk sing, but he knows Jeongguk won’t ever do that. Taehyung settles for the next best thing. “I think I’m curious now. Can I catch one of his shows?”</p>\n<p align=\"justify\">“Yoongi hyung performs all around town. At least once a week. Shouldn’t be hard,” Jeongguk responds noncommittedly.</p>\n<p align=\"justify\">Taehyung stops himself before he can ask Jeongguk to take him to one.</p>\n<p align=\"justify\">It’s not long until the rest of the food is finished. Taehyung starts to take a deep breath to say what he came to say but then Jeongguk starts talking first, “How did you spend the holidays?”</p>\n<p align=\"justify\">Taehyung’s deep breath stilts in the process and he exhales a little awkwardly. “With my family. At my grandmother’s house mostly.”</p>\n<p align=\"justify\">After a few seconds hesitation, Taehyung digs up his phone. He wonders if it’s poor form to flaunt family pictures in an orphan’s face but Jeongguk asked and he no longer wants to be that coward who’s scared of sharing anything personal. He feels like Jeongguk would be the kind of person who hates it when people don’t talk about their family because he doesn’t have his parents anymore.</p>\n<p align=\"justify\">Taehyung pulls up the most recent picture of him and his grandmother, taken just two days ago, and hands him the phone. “This is her.”</p>\n<p align=\"justify\">Jeongguk’s face is stoic as he observes the screen but then Taehyung thinks he can observe a small grin. “She looks like she’s trying to suffocate you.”</p>\n<p align=\"justify\">Taehyung’s grandmother is indeed a fierce hugger. He grins along with Jeongguk. “She calls it love.”</p>\n<p align=\"justify\">Jeongguk’s thumb hovers over the screen as he glances in Taehyung’s direction, one eyebrow raised in question. Taehyung nods almost imperceptible, giving Jeongguk silent permission to scroll through the pictures. Of course, irony deems it fit that the next image is of Taehyung and his parents. Taehyung is torn between snatching the phone out of Jeongguk’s hand or burning a hole in Jeongguk’s face with his intense staring.</p>\n<p align=\"justify\">“Your mom is pretty,” Jeongguk says without looking up, “but you look more like your dad.” There’s a small pause as Jeongguk cocks his head a little. “He’s kind of ugly.”</p>\n<p align=\"justify\">Taehyung slaps Jeongguk’s shoulder in retribution and steals his phone back without so much as a thought, catching himself off guard. Taehyung thinks his strange and overly familiar response is mostly driven by surprise and relief. Relief that the picture doesn’t seem to bother Jeongguk that much. Relief that Jeongguk is capable of joking about it.</p>\n<p align=\"justify\">“My dad is handsome,” Taehyung protests a little petulantly. “I’m handsome.”</p>\n<p align=\"justify\">Jeongguk actually snickers at that. “I guess we’re all entitled to our own opinion.”</p>\n<p align=\"justify\">Taehyung thinks that maybe he should be offended but he can only feel happy upon seeing Jeongguk smile. There’s a warmness in Taehyung’s chest that’s coming back alive and it feels fuzzy when it expands outwards and grows. It feels hopeful. He cracked Jeongguk’s though shell.</p>\n<p align=\"justify\">Taehyung decides to continue along the same track and pulls up another picture on his phone.</p>\n<p align=\"justify\">“I have tons of cousins.” Taehyung waves an image of himself and a little girl with pig tails in Jeongguk’s face. “I know you’re not supposed to have favourites but she’s my favourite. I’ll have you know that she always says I’m the ‘handsomest’ boy she knows and that she wants to marry me when she’s older.”</p>\n<p align=\"justify\">Jeongguk snorts a little and Taehyung is quite sure that there’s a teasing twinkle in his eyes. “Did you break the news to her yet? About how you two are family? Or that you like dicks?”</p>\n<p align=\"justify\">“Rude,” Taehyung says, as he shoots Jeongguk an offended look that’s only partially fake. “And I’m sure she’ll wizen up to the facts eventually. With age comes wisdom, Gukkie. For now, I’m perfectly content with her thinking there’s fairy dust and sunshine coming out of my ass.”</p>\n<p align=\"justify\">“I think she might have you mixed up with Hoseok hyung.”</p>\n<p align=\"justify\">“She doesn’t even know Hoseok hyung and it’s not like he’s not the only ball of sunshine at this university. I’m positively radiant.”</p>\n<p align=\"justify\">Jeongguk chuckles and Taehyung can’t help but like the rush that comes with hearing Jeongguk laugh. “Whatever you say.”</p>\n<p align=\"justify\">“I say I’m handsome and delightful.” Taehyung keeps scrolling. “This is my dog.” He proudly shows off a picture of his mixed breed Jindo dog.</p>\n<p align=\"justify\">“Soonshimmie,” Jeongguk says without missing a beat. When Jeongguk realizes what he gave away, he immediately averts his eyes and starts stacking the empty cartons, like that would counteract the fact that he remembered the name of Taehyung’s dog. Taehyung can’t even recall telling him that and the hopeful feeling in his chest grows. It’s funny how Jeongguk’s hostile behaviour breaks down and Taehyung’s insides instantly flutter. Still trouble.</p>\n<p align=\"justify\">“Yeah,” Taehyung confirms, trying to dispel the discomfort of the moment by talking over it. “That’s Soonshimmie. She’s the cutest dog ever.”</p>\n<p align=\"justify\">It doesn’t help. Jeongguk is stuffing the empty food cartons back in the plastic bag, putting the still full ones to the side, all the while avoiding the act of so much as glancing in Taehyung’s direction.</p>\n<p align=\"justify\">Taehyung reaches out on instinct, placing a hand on Jeongguk’s biceps and feels it become rigid beneath his touch. “Gukkie?”</p>\n<p align=\"justify\">Jeongguk stops his cleaning and falls back against the couch looking almost defeated, like Taehyung wore down his defences and broke down his resolve, his gaze never leaving an invisible spot on the wall in front of him.</p>\n<p align=\"justify\">“Hoseok hyung,” Taehyung stammers awkwardly, not knowing where to start. He swallows thickly. “Hoseok hyung said you probably wore the red scarf on purpose.” Jeongguk still won’t look at Taehyung’s questioning eyes. “Is that—Is that true?”</p>\n<p align=\"justify\">Jeongguk’s shoulders stiffen, his chin raising up in a familiar defiant lilt as he simultaneously clenches his jaw, like he’s ready for Taehyung to fight him on this. “Yeah. Yeah, I did.”</p>\n<p align=\"justify\">For what may be the first time, Taehyung recognizes Jeongguk’s antagonistic posture for what it is; a defence mechanism. So, unlike the last time they spoke, Taehyung remains calm, keeps his voice devoid of fire and anger as he speaks, “Why? Why did you wear the scarf, Gukkie?”</p>\n<p align=\"justify\">Jeongguk looks completely taken aback by the lack of acrimony Taehyung is displaying, so prepared for another argument that he doesn’t seem to know what to do when that argument doesn’t come. His shoulders slump, all the confidence melting away under Taehyung’s eyes like snow under the sun. Jeongguk looks tired, fragile, and Taehyung regrets ever asking.</p>\n<p align=\"justify\">But at the same time Taehyung doesn’t regret it. This is safe. Taehyung much rather have Jeongguk be vulnerable before him than the other way around.</p>\n<p align=\"justify\">And Jeongguk is vulnerable. There’s something very brittle behind Jeongguk’s dark eyes. “What do you want me to say, Taehyung? That I like you?”</p>\n<p align=\"justify\">Taehyung’s heart beats violently against his ribcage as if it’s trying to get closer to Jeongguk. Taehyung does what his heart tells him and leans forward, his free hand tracing the scar on Jeongguk’s cheek.</p>\n<p align=\"justify\">“Do you?” Taehyung whispers. Asking Jeongguk if he likes him is so much easier than confessing first. Taehyung won’t allow himself to be put in the position of being the one capable of getting hurt. He’s done that too often in the past.</p>\n<p align=\"justify\">There’s a slight quiver to Jeongguk’s bottom lip when Taehyung runs a thumb across it and Taehyung lets himself fall those final few inches to capture it between his own. It’s not as much a kiss as it's supposed to be a demand. It’s Taehyung willing Jeongguk to confess to him so he can finally say it back.</p>\n<p align=\"justify\">“Stop,” Jeongguk mutters in broken tones against Taehyung’s lips, but Taehyung can’t. Not until Taehyung can make Jeongguk understand the depth of what he feels. But then Jeongguk’s hands are on his shoulders, pushing him away as if Taehyung has poison in his mouth. “Stop it! Get away from me!”</p>\n<p align=\"justify\">Taehyung stares at him with wide eyes. This isn’t right. This isn’t how it’s supposed to be. Jeongguk likes him, Taehyung had been so sure. “Gukkie?”</p>\n<p align=\"justify\">“Fuck!” Jeongguk curses as he cards both hands through his hair in agony. “I hate this!” He looks at Taehyung with red-rimmed eyes, as if he’s fighting back his tears. “I fucking hate you!” The words are like a knife, cutting the warmth right out of Taehyung’s chest. “I hate you and those hideous sweaters you always wear,” Jeongguk continues in a voice that seems crippled with hurt. “I hate how they make you look. I hate how you drown in them until all I can see are your collarbones. I hate how you smile at me until your face is no eyes and all teeth. I hate how you always call me Gukkie. I fucking hate how weak it makes me feel.”</p>\n<p align=\"justify\">This isn’t right at all. Something is going very, very wrong. Jeongguk’s words cut. They cut at Taehyung but, worst of all, they seem to cut at Jeongguk too. Taehyung tries to reach forward again. “Gukkie.”</p>\n<p align=\"justify\">“Stop it!” Jeongguk demands, arms up to defence so Taehyung won’t touch him, but it almost sounds like he’s begging instead. “Stop calling me that. Stop playing with me.”</p>\n<p align=\"justify\">“I’m not,” Taehyung stammers. “I’m not playing with you.”</p>\n<p align=\"justify\">“Yes, you are,” Jeongguk accuses with anguish. “You’re <em>always</em> fucking playing with me. You come over to my place, you take what you want, and then you fuck off to wherever it is you came from. And every time I try to talk, you shut me up with sex. And I don’t want that anymore. I don’t want to feel used like that but every time I try to break it off, you call or text me. Because <em>those</em> are the times when you’re suddenly able of reaching out to me first.” Jeongguk wraps an arm around his waist as if he needs to protect himself against Taehyung. “But in the end you never stay. And I couldn’t ask you because I was scared that meant you were never coming back. You won’t give me what I need but you also won’t let me go. You were upset people found out about me.” Jeongguk shakes his head like he’s trying to ward Taehyung off. “You don’t care about me at all.”</p>\n<p align=\"justify\">Taehyung feels like he’s in a dream. The dream in which you think you’re falling and he’s stuck in the horrific moment right before you wake up when you’re paralyzed with vertigo and dread.</p>\n<p align=\"justify\">“I’m sorry,” Taehyung says, stumbling over his words in his haste to get them out. “Gukkie, I’m sorry.” Taehyung reaches out to brush a hand over the scar again, wiping away the wetness there with his thumb. “You have it all wrong, Gukkie. It’s not like that. I care. I care about you.”</p>\n<p align=\"justify\">“Don’t lie to me,” Jeongguk pleads. “You’re just here for the sex and after that you’ll leave. You always do.” There’s a small choke. “It’s like you get off on the power you have over me. On always being able in roping me back in.”</p>\n<p align=\"justify\">Taehyung’s shakes his head in desperation. “That’s not true. I swear that’s not true.” He cups Jeongguk’s jaw with both hands. The anxiety Taehyung experiences at seeing Jeongguk like this is mind-altering. Taehyung would do anything to make it stop. Anything to make it right. “And I’ll stay. I want to stay. I’ll stay the night if you let me. Not for the sex. We don’t have to have sex. I want to stay because I missed you and I want to be with you.” He cradles Jeongguk’s face like it’s precious. And it is precious. Jeongguk is precious to him. “I like you, Gukkie. I like you so much.”</p>\n<p align=\"justify\">“Don’t lie to me,” Jeongguk whispers with big and insecure eyes. And Taehyung can’t see the piercings or the tattoos, all he sees is how young Jeongguk looks. How much he reminds Taehyung of himself, of how Taehyung was with all the boyfriends that didn’t treat him right in the past. How he was with Namjoon. But this time it isn’t Taehyung getting hurt, it’s Jeongguk. Jeongguk isn’t trouble; Taehyung is.</p>\n<p align=\"justify\">“I’m not lying,” Taehyung says, and now he’s the one crying. “I promise I’m not lying. I like you, Gukkie. I really do. And I’m sorry I hurt you. I didn’t mean to hurt you and I didn’t mean to make you feel this way. I was…I was too wrapped up in my own feelings. I didn’t notice. I’m sorry.” Taehyung finally pulls back his hands to wipe away his own tears. “I’m so sorry.”</p>\n<p align=\"justify\">And then there’s nothing but their shaky breaths between them as they try pick up the pieces and put themselves together again. Their bodies left battered by the onslaught of their own feelings that spilled from their mouths like they were powerless from stopping it, the emotions so intense that they transformed into a pain that’s physical.</p>\n<p align=\"justify\">“If you like me,” Jeongguk ultimately says in a hesitant voice, eyes dry again but still full of hurt, “why do you always leave me?”</p>\n<p align=\"justify\">Taehyung is sure he had a hundred excuses before coming over to see Jeongguk but none of them seem valid anymore. None of them carry any weight when he considers how he made Jeongguk feel. “I guess I’m a coward,” Taehyung eventually responds, “just like you said in our fight. I was…I was scared because I didn’t want to like you. I didn’t want to like anyone.” Taehyung lifts his hands in a helpless attempt at articulating what had motivated him at the time. It’s just that he hardly understands his own impulses himself. “I think I went home with you that first time because I didn’t think you’d like me either. That you weren’t interested in anything but a one-night stand.” Taehyung sighs regretfully when he thinks back on how they got tangled up in this twisted game of push-and-pull where nobody seems to win and everybody seems to lose instead. “But you weren’t just handsome and sexy; you were cute and funny too. And when you called me to hook up again, I told myself ‘one more time’. But one more time turned into lots of times and I couldn’t stay away.”</p>\n<p align=\"justify\">Jeongguk doesn’t look like he understands and Taehyung can’t blame him. Taehyung doesn’t understand either.</p>\n<p align=\"justify\">“What’s so bad about liking someone?”</p>\n<p align=\"justify\">“Have you,” Taehyung starts, franticly trying to find the right words. “Have you ever been in a serious relationship?”</p>\n<p align=\"justify\">Jeongguk shakes his head. \"Never been really interested in that.\" His eyes fall down like he’s almost ashamed to admit it. \"Just lots of random hook-ups instead. I'm just...I'm just a wild night to people.\"</p>\n<p align=\"justify\">“I’ve had a few relationships,” Taehyung tries to explain. “Not all serious but the last one was. When they left—when Namjoon left, it hurt. I didn’t want to do that again. I didn’t want someone telling me they liked me, telling me that I’m funny and quirky and that’s why they want to be with me, why they can’t get enough of me. I didn’t want another person telling me to be myself and share all my secrets only to change their minds a few months down the road. I didn’t want another person suddenly saying I’m too much, too weird, too hard to keep up with.” Taehyung can feel himself choke up again and tries to bite it down, tries to ignore the burning behind his eyes. “That I’m too immature and always embarrassing them in public. Fun as a friend maybe but not boyfriend material.”</p>\n<p align=\"justify\">Taehyung doesn’t realize he’s already crying until Jeongguk cups his jaw with one hand and brushes away the tears on his cheekbone, just like he had done for Jeongguk earlier. The calloused pads of Jeongguk’s fingers are more comforting than his own hands could ever be.</p>\n<p align=\"justify\">“Before them, I was never insecure about myself like that,” Taehyung continues. “I just wanted my last year of undergrad school to be fun, to continue with a graduate degree next year and maybe when I finished that—when some of the hurt and my eccentricities had eroded away—I could see if there was anyone willing to put up with me on the long-term. I thought I needed a break from anything more than just sex.”</p>\n<p align=\"justify\">Jeongguk drops his hand back on his lap and Taehyung immediately longs to have it back on his skin, its absence painful.</p>\n<p align=\"justify\">“I don’t want to put up with you,” Jeongguk says, voice still coarse with emotion. “I want…I want to be around you. And I like that you’re different—that you stick out like a sore thumb sometimes—just like me. It makes me feel normal.” Jeongguk rubs at the back of his neck, seeming to struggle in his search for words. “I don’t think you’d ever be able to embarrasses me in public. When I go out, people only seem to notice the tattoos and the piercings. That’s all they ever see.”</p>\n<p align=\"justify\">There’s an undercurrent to Jeongguk’s last statement and Taehyung remembers all the rumours; Jeongguk’s reputation.</p>\n<p align=\"justify\">“I don’t care about those. I’m not ashamed of you, Gukkie,” Taehyung declares, fraught in his attempt to reassure Jeongguk. “That’s not why I kept you a secret. I didn’t care if people found out. It was only ever about hiding from Jimin. I didn’t want Jimin to find out about you because he’s my best friend and he would have been able to see right through me. I knew he wouldn’t have left me alone. He would have been telling me to get my head out of the past, or out of my ass, or maybe both, and sort this shit out.” Taehyung pauses, thinking about his phone calls with Jimin. “He did tell me to sort this out. To make things right with you.”</p>\n<p align=\"justify\">“Is that why you came here?”</p>\n<p align=\"justify\">Taehyung knows what Jeongguk is really asking and this time Taehyung is determined not to try and force Jeongguk’s hand. This time Taehyung would be vulnerable for Jeongguk instead of making Jeongguk vulnerable for him. “I came because I wanted to tell you I was sorry and that I like you.” Taehyung bends forward to smooth out the strands of Jeongguk’s hair that he ruffled up when he was so upset. Jeongguk leans into Taehyung’s hand and the sight causes a bittersweet ache. Taehyung feels the warmth in his chest return but now it’s spiked with a fierce surge of protectiveness. “Why did you let me in?”</p>\n<p align=\"justify\">Jeongguk no longer looks brittle—open, but not brittle. “Because I like you too.”</p>\n<p align=\"justify\">That confession triggers so many emotions that Taehyung doesn’t know on what to focus first. The happiness, the relief, the affection, they all mingle together into a warm haze that’s only broken by the sharp spice of his adrenaline rush. A rush at being able to call Jeongguk his.</p>\n<p align=\"justify\">Taehyung slides into Jeongguk’s lap, their bodies slotting together more perfectly now than they ever did before. Jeongguk feels so strong, broad and solid beneath him but this time Taehyung doesn’t forget he’s fragile under his touch too. Underneath the tattoos and the piercings, Jeongguk is vulnerable in Taehyung’s hands. Jeongguk is not trouble, he’s precious, and Taehyung needs to take care not to break him.</p>\n<p align=\"justify\">They kiss and this time it’s a kiss between equals and not a struggle for power. This time Jeongguk doesn’t push him away but tries to get closer. This time they’re not trying to steal, they’re trying to give. There’s adoration lacing Jeongguk’s ever present hunger as his tongue explores Taehyung’s mouth and there’s extra care in the way Taehyung cards his fingers through Jeongguk’s hair.</p>\n<p align=\"justify\">When they break apart, Taehyung presses a soft, fluttery kiss against Jeongguk’s nose like he’s wanted to do so many times before. “Can I stay?”</p>\n<p align=\"justify\">“Yeah,” Jeongguk says as he tries to capture Taehyung’s mouth with his again. “You can stay.”</p>\n<p align=\"justify\">For the first time, Taehyung does stay. He changes into one of Jeongguk’s shirt and sweatpants that swallow his thinner frame and discovers sleeping in the same bed as Jeongguk is just two degrees shy of disastrous. Jeongguk sniffles. Taehyung vaguely remembers an offhand comment about Rhinitis and he used to not even really notice anymore but in the dark and quiet of the bedroom the noise is unescapable. But the suffering is mutual. According to Jeongguk, Taehyung is a blanket-hogger in addition to sleeping like a starfish, slowly forcing Jeongguk out of his own bed inch by inch. Somewhere around three o’clock at night, Jeongguk threatens to make Taehyung sleep on the floor if he pokes his <em>‘cold-ass toes’</em> against Jeongguk’s thigh one more time.</p>\n<p align=\"justify\">But in the morning, when Taehyung can see the dust particles dancing above their heads in the early sunlight and Jeongguk is sleeping so soundly that he doesn’t notice Taehyung wrapping his body around him like a koala, Taehyung thinks he wouldn’t want to be anywhere else. It takes listening to twenty of Jeongguk’s heartbeats beneath his ear before Taehyung is pulled under into a deep slumber.</p>\n<p align=\"justify\">No place makes Taehyung feel warmer than Jeongguk’s bed with Jeongguk in it.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">No place feels warmer than Jeongguk’s bed with Jeongguk in it and that’s exactly the reason why Taehyung is a little disgruntled when he wakes up all by himself. Alone. In a bed that’s feeling a tad bit chilly.</p>\n<p align=\"justify\">Taehyung groans, burying deeper under the duvet, as images of Jeongguk in workout gear flash before his mind’s eye. Something about running. Taehyung scrunches up his eyebrows in thought, starting to put together the fuzzy pieces floating in his head. Jeongguk had said he was going for a run when Taehyung had still been to drowsy to completely comprehend what was happening, falling back asleep the second Jeongguk had left the room.</p>\n<p align=\"justify\">Another tortuous groan escapes past Taehyung’s downturned lips. God, who even does that? Who goes for a run at ass o’clock? Taehyung pushes aside his messy fringe, squinting at the bedside alarm. 10:42. Well, maybe not ass o’clock but that’s still pretty early when you consider that they’re on their Christmas break.</p>\n<p align=\"justify\">Taehyung pulls the blanket up to his nose, counting the cracks in the ceiling as he engages in a battle of wills with his bladder. His lips straighten into a terse line of determination. Mind over matter. He will not leave this slice of heated heaven.</p>\n<p align=\"justify\">It’s five minutes until his bladder emerges victorious. Matter over mind.</p>\n<p align=\"justify\">The cold floor is like ice under Taehyung’s feet as he paddles over to the bathroom. He takes an extra hot shower to soothe his frazzled nerves. The warm water is like a dream, making him linger far longer than is necessary. When the stream starts to turn colder, Taehyung rushes back to the bedroom, stealing one of Jeongguk’s boxers and slipping back into the sweats and t-shirt Jeongguk borrowed him before complimenting his outfit with one of the thousand hoodies Jeongguk has hanging in his closet. A wicked grin flashes across Taehyung’s features as he spots a set of <em>Iron Man </em>socks and confiscates those as well.</p>\n<p align=\"justify\">Safely bundled up, Taehyung finally notices a torn piece of paper on the bedside dresser, its blank surface littered with Jeongguk’s chicken scratches. Jeongguk usually communicates via a keyboard, that much is obvious.</p>\n<p align=\"justify\">\n<em>Gone for a run. Tried to tell you but you seemed comatose.</em>\n</p>\n<p align=\"justify\">Taehyung frowns. Zero points for romance.</p>\n<p align=\"justify\">\n<em>DON’T eat in my bed!!</em>\n</p>\n<p align=\"justify\">Rude much?</p>\n<p align=\"justify\">The ink on the next line is a bit thicker than before, like Jeongguk had hesitated before writing it down.</p>\n<p align=\"justify\">\n<em>X Guk</em>\n</p>\n<p align=\"justify\">A smile blooms across Taehyung’s face as a warmth starts to uncurl and flutter in his chest. Cute. Jeongguk is cute. Taehyung can almost imagine him writing it, Jeongguk fiercely debating whether or not to add something as small but telling as that. Jeongguk was always a notoriously bad texter during their hook-ups, often only sending Taehyung one or two word messages; locations and times, dozens of messages that consisted only of the letter <em>‘K’</em>.</p>\n<p align=\"justify\">Taehyung is still smiling as he makes his way to the kitchen. He’d show Jeongguk how it’s done and resolves to clutter his next text to Jeongguk with enough flashing hearts and moving emoticons to make Jeongguk’s phone light up like a Christmas tree. Taehyung can almost taste Jeongguk’s embarrassment already. How sweet.</p>\n<p align=\"justify\">Sorting through the leftover Chinese food, Taehyung pick two cartons. He doesn’t care what other people say, it’s even better the next day. For a moment, Taehyung considers eating it in the bed (because he can just as much of a little shit as Jeongguk is) but with no small amount of self-discipline, Taehyung decides to be a better person and behave himself.</p>\n<p align=\"justify\">Reheated food in one hand, Taehyung turns on the television and nestles on the couch, seriously contemplating bringing over the duvet from Jeongguk’s bedroom but feeling too lazy to actually follow through on that thought. Why is Jeongguk’s apartment like a snow fortress?</p>\n<p align=\"justify\">Taehyung barely finished his food when there’s noise coming from the front door, metal sliding over metal as a key is turned, followed by Jeongguk’s return to the apartment. His cheeks are rosy from the cold, making Taehyung want to pinch and kiss them, and his eyes are big and round as they take in Taehyung on the couch. His posture is coloured with Jeongguk’s usual air of nonchalance but Taehyung now knows him well enough to catch little flickers of other emotions under that mask of indifference. Relief, surprise…happiness?</p>\n<p align=\"justify\">All of a sudden, Taehyung feels like he passed some sort of test. Jeongguk’s test of Taehyung’s feelings because Taehyung isn’t quite sure if people can even go for a proper run in this cold and snow. What if Jeongguk’s departure had been his way of giving Taehyung an exit? An opportunity to leave unseen? Part of Taehyung smarts at the idea of how uncertain Jeongguk still feels about Taehyung’s commitment but another part rejoices at seeing how pleased Jeongguk is at the fact that Taehyung is still there. Jeongguk is cute indeed.</p>\n<p align=\"justify\">“Gukkie,” Taehyung exclaims with enough melodrama to make the students in the theatre department reel with envy, arms up like he’s desperately reaching out for Jeongguk. “You’re back. I thought I was going to freeze to death when you were gone.” Taehyung waves his hand about the room. “How could you leave me alone in this icy fortress of solitude?”</p>\n<p align=\"justify\">Jeongguk rolls his eyes but his face is also engraved with amusement at Taehyung’s antics, just the way Taehyung likes it.</p>\n<p align=\"justify\">“Heating is a bitch,” Jeongguk says as he begins to fiddle with the thermostat. “This thing doesn’t work properly anymore, so you got to turn it up really high.” His eyebrows knot together in annoyance. “I’ve called my landlord all fucking week but I don’t think he’ll drag his ass here until I set the place on fire.” Suddenly the pipes start to groan and rattle like some great beast in the wall just awoke from his sleep. “Should get warmer soon.”</p>\n<p align=\"justify\">Taehyung lets his body lean forward even further over the back of the couch. “How was your run?”</p>\n<p align=\"justify\">“Fine. They cleared the main road running past the university of snow, so it was okay.” Jeongguk pulls his shirt over his head, revealing a stomach that makes Taehyung want to release an obscene sound of appreciation but he manages to control his baser impulses. “Gonna take a shower.”</p>\n<p align=\"justify\">Taehyung nods, mouth watering a little with a hunger that has nothing to do with the Chinese food as he watches Jeongguk disappear towards the bedroom. There’s barely time for Taehyung to refocus his attention on the television before Jeongguk returns much earlier than expected. But Taehyung can’t say he minds when Jeongguk joins him on the couch, black hair still a little damp.</p>\n<p align=\"justify\">Without hesitation, Taehyung pounds upon Jeongguk like he’s prey, happily draping himself over the lap of another warm body. It’s a little silly, they’re both grown men with Taehyung being maybe a bit more slender of frame but also an inch taller than Jeongguk, yet he fits so perfectly there.</p>\n<p align=\"justify\">“God, Gukkie,” Taehyung almost moans against Jeongguk’s shoulder, nose catching wind of Jeongguk’s shampoo; something woody and masculine and fantastic. “You’re so hot.”</p>\n<p align=\"justify\">“Funny you should say that because I feel kind of cold,” Jeongguk mutters darkly, eyebrow piercing raised and shimmering with what looks like a reprimand. “There was hardly any hot water left.”</p>\n<p align=\"justify\">Taehyung feigns a little noise of surprise. “How peculiar.”</p>\n<p align=\"justify\">“Yeah,” Jeongguk agrees. “How peculiar.”</p>\n<p align=\"justify\">Taehyung attacks him his most blinding rectangular smile, softly wheezing with a mostly unapologetic giggle as he sneaks an arm around Jeongguk’s neck. “We can cuddle to keep warm.”</p>\n<p align=\"justify\">Jeongguk grumbles a little, so Taehyung ups his charm offensive by dropping a gentle kiss on Jeongguk’s cheek. Jeongguk’s irritation immediately thaws out, the grip of his arm around Taehyung’s waist tightening adoringly.</p>\n<p align=\"justify\">The manner in which Jeongguk’s cheek dust with the slightest hint of pink and how his eyes soften makes butterflies explode in Taehyung’s abdomen. Taehyung still knows how to play cute and Jeongguk is still his favourite victim but it’s different now. Jeongguk seems so confident and mature in some ways; the tattoos, his own apartment, the way he fucks like a god. But Taehyung realizes now that the times he thought he was stroking Jeongguk’s big bad boy ego, he was actually praising a young man who was insecure and longing for his affection. Taehyung could live with that. He’d drown Jeongguk in it if he would let him.</p>\n<p align=\"justify\">And Jeongguk isn’t the only one insecure. Taehyung is clingy, unable to control it now that they’ve confessed, crawling into Jeongguk’s body because he’s aching to be near. And Taehyung finds himself waiting for the other shoe to drop, just like he was waiting for it yesterday evening when they cuddled and made out on the couch for hours before going to bed. Waiting for Jeongguk to tell him he needs a little space to breathe and for Taehyung to take it easy because Taehyung’s constant care is starting to become stifling. Just like all of his previous boyfriends did.</p>\n<p align=\"justify\">But Jeongguk doesn’t.</p>\n<p align=\"justify\">They watch anime together instead, their bodies a mess of tangled limbs, Taehyung’s body crispy and toasty in Jeongguk’s arms but his heart feeling even warmer.</p>\n<p align=\"justify\">Taehyung doesn’t know how long they sit together like this, his eyelids eventually starting to droop like he might doze off again, but then Jeongguk’s voice breaks the silence, the man’s chest a pleasing rumble behind Taehyung’s back.</p>\n<p align=\"justify\">“Did you tell anyone yet?” Jeongguk asks the vague question with a false nonchalance he fails so epically at that Taehyung has to try his hardest not to laugh at his face. He’s proud of himself when he doesn’t because Jeongguk sounds like he’s been working up the courage to ask that question ever since they’ve been sitting on that couch.</p>\n<p align=\"justify\">“Yeah,” Taehyung says, hand reaching back to brush reassuringly through Jeongguk’s hair. “Posted something in the group app before going to bed last night.” Taehyung had read his friends’ responses that morning when scarfing down the leftover Chinese. “Jimin said we’re not allowed to have sex at the dorm because you have your own apartment.”</p>\n<p align=\"justify\">Jeongguk scoffs a little like he usually does at the mention of Jimin’s name.</p>\n<p align=\"justify\">“He’ll arrive at the station this Sunday at three, so if we go over to the dorm at that time, we could be up and running in all our naked glory by the time he gets back to our dorm room.” Taehyung leans his head back to underline his statement with a lascivious wink and Jeongguk chuckles in response.</p>\n<p align=\"justify\">“I honestly don’t know if I can get it up knowing that Jimin is just around the corner.”</p>\n<p align=\"justify\">Taehyung kisses his teeth, a disappointed sound hissing past his lips. “Amateur.”</p>\n<p align=\"justify\">Jeongguk immediately pinches his side in revenge, making Taehyung laugh and flail about helplessly until he apologizes by acknowledging Jeongguk as a ‘<em>Sex God’ </em>and Jeongguk’s fingers stop tickling his ribcage with teasing touches.</p>\n<p align=\"justify\">They’re both still grinning as Taehyung falls back against Jeongguk’s chest. “Hoseok hyung spammed the app with like a thousand hearts and kissing emoticons.”</p>\n<p align=\"justify\">Jeongguk shakes his head. “He’s always spamming the dance app as well. Kind of hard to take him serious that way.”</p>\n<p align=\"justify\">“This is how normal people are supposed to text, Gukkie. They invented moving stickers for a reason,” Taehyung explains with an exasperated sigh, like it’s common knowledge and all people should communicate by means of flashy emoticons instead of actual words. Taehyung is a strong advocate on the matter. “But he also said that I’m not allowed to talk about your dick.”</p>\n<p align=\"justify\">Jeongguk’s eyebrow shoots up, piercing vanishing far beneath his fringe. “Why would he say that?”</p>\n<p align=\"justify\">“No reason,” Taehyung says while flapping his hands through the air in a nonsensical gesture, the way his voice lilts unconvincingly making Jeongguk snort disbelievingly.</p>\n<p align=\"justify\">“Right.”</p>\n<p align=\"justify\">“Anyways,” Taehyung says, changing the subject rather conspicuously. “Seokjin hyung said that he wants me to bring you over for dinner soon.”</p>\n<p align=\"justify\">“Dinner?”</p>\n<p align=\"justify\">“Yeah.” Taehyung taps his chin in thought. “I know it’s quick but it’s not like I can say no to my mom shark, so we’ll just have to go and face the inquisition.” He shrugs. “At least there’ll be good food.”</p>\n<p align=\"justify\">Jeongguk looks at him with a forehead full of creases. “You do know that what you just said makes absolutely no sense to me, right?”</p>\n<p align=\"justify\">“Patience, my little bunny,” Taehyung says as he softly pats Jeongguk’s cheek like he’s a little kid. “Everything will become clear in the end.” Jeongguk sullenly scrunches his nose up, so Taehyung turns his slightly condescending petting into a soft caress across Jeongguk’s cheekbone. “What about you?”</p>\n<p align=\"justify\">“Me?” Jeongguk’s voice is laced with genuine question. It’s glaringly obvious that Jeongguk doesn’t completely comprehend yet that relationships are a two-way street but Taehyung doesn’t care. They could work on that. Jeongguk had never really dated before.</p>\n<p align=\"justify\">“Yeah. <em>You.</em> Did you tell anyone?”</p>\n<p align=\"justify\">Jeongguk tilts his head and Taehyung can tell the thought hadn’t even crossed his mind yet, so focused on Taehyung and whether he was still trying to keep Jeongguk a secret from his friends that he hadn’t even told anyone himself.</p>\n<p align=\"justify\">“No,” Jeongguk eventually admits. “I mean, I told my brother once, via Skype, that I—” there’s a slight blush creeping up Jeongguk’s face and Taehyung can feel his insides twist with pleasure “—that I liked someone. And Yoongi hyung figured something was going on that time you dropped off my phone. But I…I didn’t text anyone you stayed over last night.” Jeongguk kneads the back of his own neck in consideration, scrunching up his nose again. “That would be weird.”</p>\n<p align=\"justify\">Taehyung snorts a little in glee. Of course, because tough guys with tattoos don’t talk about stuff like that and they definitely don’t bombard each other at night with texts about their crushes that are illustrated with moving stickers like twelve-year-old girls. Taehyung shrugs. Their loss, obviously.</p>\n<p align=\"justify\">“What do you want me to tell them?” Jeongguk’s piercing gaze connects with Taehyung’s, his face schooled into that neutral, guarded expression that Taehyung hopes will appear less and less frequently in the future. It feels like another test. A question behind a question.</p>\n<p align=\"justify\">“I told my friends that we made up,” Taehyung says, choosing his words carefully. “I told them that we confessed to liking each other and that I was staying the night.” Taehyung takes a deep breath, shifting a little awkwardly between Jeongguk’s legs. He thought they'd cleared everything up last night but now he still felt a little insecure when actually putting it into words. He thought they'd said <em>said </em>it already but they hadn’t. Not really. His next words come out rushed, “I told them that we were dating and that you’re my boyfriend.”</p>\n<p align=\"justify\">The following second seems to last an eternity. Taehyung suddenly worries if he'd jumped the gun. Did Jeongguk maybe not feel this way? Did he want to take it slower? Did he want to do casual dating before an actual relationship? A sudden anxiety begins to seep into cracks of his recent happiness, threatening to freeze it over and kill it like a spring flower that tried to blossom prematurely, but then Jeongguk nods with a small smile, all bunny teeth and big eyes.</p>\n<p align=\"justify\">“Yeah, you’re my boyfriend,” Jeongguk agrees and Taehyung’s lips are on his in an instant, swallowing the final syllables.</p>\n<p align=\"justify\">Kissing Jeongguk the boyfriend is a hundred times better than kissing Jeongguk the casual hook-up. It tastes sweet when Jeongguk dips his tongue in Taehyung’s mouth like he’s there to stay, it feels secure when Jeongguk’s hand fans out over his lower back to pull him closer like he never wants to let Taehyung go. The little whimpers that escape their lips sound sensuous like always but now they’re also grounding. This is real. This is theirs. Taehyung can’t get enough and neither can Jeongguk.</p>\n<p align=\"justify\">The next hour, the anime show plays forgotten in the background. Taehyung never thought he could feel this way but he can’t think of a single thing more interesting than kissing Jeon Jeongguk.</p>\n<p align=\"justify\">The rest of the day passes in a similar fashion. They remain holed up in Jeongguk’s apartment, hidden away from the cold and the world outside while eating, watching television shows, kissing, or just talking. Taehyung wonders if it’s telling for how their relationship would progress in the future, if they were going to turn into one of those boring couch potato couples, but he honestly can’t bring himself to care. He likes this. He likes Jeongguk and he doesn’t need anything else.</p>\n<p align=\"justify\">Somewhere around nine at night, Jeongguk is spread out over the couch, feet dangling off one of the armrests while new food cartons litter the coffee table because they ordered fried chicken. Taehyung would feel guilty about their piss-poor diet but Jeongguk claims he can cook and promised to demonstrate his skills tomorrow, something Taehyung is excitedly looking forward to.</p>\n<p align=\"justify\">Taehyung swings one leg over Jeongguk’s waist to straddle him and feels exuberantly pleased with how Jeongguk’s hands shoot up to steady his hips like it’s second nature. Jeongguk’s shirt has twisted with his movements, caught strangely beneath his back, and Taehyung can see the fine lines of the tattoo across his clavicle peaking up from beneath the collar. Taehyung caresses the inked skin with the finger tops of two slender digits. Jeongguk’s eyes immediately shoot upwards, dark orbs full of question.</p>\n<p align=\"justify\">“It’s pretty,” Taehyung says in a soft voice, fingers dipping under the rim of the shirt to trace the entire length of the tattoo. They hadn’t talked about them yet, not since Jeongguk had accused Taehyung of being too scared to ask what they mean during their fight before Christmas break. Taehyung pulls the shirt down a little, trying to read the foreign lettering.</p>\n<p align=\"justify\">“<em>Life: It Goes On</em>,” Jeongguk answers Taehyung’s unspoken question. “First tattoo I ever got.”</p>\n<p align=\"justify\">“I thought that’s what it meant.” Taehyung hesitates briefly, biting his bottom lip. “Why did you pick it?”</p>\n<p align=\"justify\">“Just to remind myself at times.” Jeongguk shrugs nonchalantly, eyes darting back to the television, but Taehyung can tell by how taut Jeongguk’s body feels beneath his legs that he isn’t as relaxed as he pretends to be.</p>\n<p align=\"justify\">Taehyung traces the inked skin one final time. It’s not as poetic and hopeful as tattoos often are, no <em>‘Believe’</em> or <em>‘What Doesn’t Kill You Makes You Stronger’</em>. Jeongguk’s tattoo is the undeniable truth of the matter inked into his skin. Blunt and harsh. Taehyung thinks it suits Jeongguk.</p>\n<p align=\"justify\">Just as Taehyung mentally prepares to fall down beside Jeongguk, calculating how to best nestle himself against his boyfriend’s side like the lazy bums they’ve become, Jeongguk bends up at the waist to pull his shirt off over his head. He falls back on the couch bare-chested, carelessly tossing the garment on the floor. The stomach Taehyung had been lusting over that morning, and many times before that, is on glorious display beneath him, the tattoos now clearly visible.</p>\n<p align=\"justify\">Taehyung reaches out for the smooth skin on instinct but stops himself at the last moment, fingers hovering in the air as he looks at Jeongguk, asking permission without words. Jeongguk grants it to him by encasing his hand with his own and pushing it down towards his chest, squeezing briefly before folding his arm under his head.</p>\n<p align=\"justify\">The skin is hot and soft beneath Taehyung’s touch, a soft current seeming to buzz where they’re joined without clothing to separate them. Taehyung sighs in muted pleasure as he moves his hand downwards, fingers caressing the stretch of skin over Jeongguk’s heart. The ache to kiss that tattoo is often the strongest.</p>\n<p align=\"justify\">“<em>Passion Brings Light,</em>” Jeongguk says, words slow and weighted. Taehyung feels he’s being let in on a secret, on something important. And he is. Anything that matters enough for Jeongguk to permanently put on his skin is of significance to Taehyung. “There was a period in my life when I wasn’t passionate about anything. It felt like living in a black pit that grew darker each day. I think the absence of passion kills.”</p>\n<p align=\"justify\">Taehyung had never thought about things like that. He’s happy and he supposes he’s passionate. He loves science and working in the lab. Then he thinks of Jimin and how miserable his best friend is in his classes and how happy drawing makes him. Maybe Jeongguk is right. Taehyung has been trying for ages to get Jimin to switch his major.</p>\n<p align=\"justify\">“That’s what I originally wanted get there,” Jeongguk continues; “<em>The Absence of Passion Kills</em>, but my tattoo artist wore me down with a half hour speech about how it’s more motivating to phrase the message positively.” Jeongguk jokingly rolls his eyes. “So now it’s; <em>Passion Brings Light</em>.”</p>\n<p align=\"justify\">Taehyung lays a flat hand on Jeongguk’s heart, trying to feel it beat beneath his fingers. “Even if life just goes on?”</p>\n<p align=\"justify\">Jeongguk shrugs. “I guess there’s a difference between living and merely existing.”</p>\n<p align=\"justify\">Taehyung moves downwards even further, fingers kissing the tattoo on Jeongguk’s side. It’s the only piece with colour, dark blues and hints of white mingling in with the black and grey.</p>\n<p align=\"justify\">“Magpie,” Jeongguk explains. “My mother’s favourite bird.” It’s a side profile of the bird in mid-flap, its wings behind it and slightly bend. There’s motion in the image; life. “They’re not the prettiest of birds but they’re very intelligent and they have a weakness for shiny things. My mother used to say she could relate to that.” Jeongguk grins wryly. “It’s also supposed to be a symbol for good luck.”</p>\n<p align=\"justify\">“It’s beautiful,” Taehyung whispers.</p>\n<p align=\"justify\">“She was a beautiful woman despite what she sometimes thought,” Jeongguk says, eyes sad and the hurt there makes Taehyung’s chest ache uncomfortably. “Beautiful and smart.”</p>\n<p align=\"justify\">Taehyung nods. Looking at Jeongguk, it’s not hard to believe those words. Taehyung soothingly brushes his hands over Jeongguk’s chest before wrapping them around Jeongguk’s shoulders, trying to console him by touch. When Jeongguk remains silent, Taehyung’s eyes travel to the only other tattoo depicting an animal. He can see part of it curling around Jeongguk’s shoulder and upper arm but most of it is hidden from view, continuing down over Jeongguk’s shoulder blade and part of his back. It’s the largest piece to decorate Jeongguk’s body. “And the tiger?”</p>\n<p align=\"justify\">“My father,” Jeongguk says. “And me. It represents power and strength.” There’s a fierceness to the image that never fails to captivate Taehyung’s gaze when Jeongguk has his back to him. “Destruction too. It’s a warning.”</p>\n<p align=\"justify\">“For who?”</p>\n<p align=\"justify\">“For me.”</p>\n<p align=\"justify\">Taehyung wants to ask more. He wants to decipher Jeongguk’s cryptic words but he also doesn’t want to push. Worrying his bottom lip with his teeth, Taehyung decides to let it go for now. There’s more ink on Jeongguk’s body left to explore. Maybe those lines would be less painful to discuss.</p>\n<p align=\"justify\">“He was a good man,” Jeongguk says, not giving Taehyung the time to move on to a different patch of skin. “Strong and brave. He just…” Jeongguk trails off in a hoarse voice, the words thick and strained with barely held back emotion.</p>\n<p align=\"justify\">“It’s okay,” Taehyung immediately coos as he gives Jeongguk’s shoulders another squeeze. He locks eyes with Jeongguk, trying to show him he’s there and he isn’t going anywhere. “We don’t have to talk about it. You don’t have to tell me if you don’t want to. Or if you’re not ready. I can wait.”</p>\n<p align=\"justify\">“I know,” Jeongguk says after taking a deep breath, voice more even, but his eyes still red and misty. “I just want you to know I had good parents. I come from good people.” Jeongguk’s face twists with worry and anger. “I know people at university talk sometimes.”</p>\n<p align=\"justify\">“Of course you do,” Taehyung immediately says as he bends down to press his lips against Jeongguk’s forehead, kissing away the frown. “I never doubted that.” Taehyung cups Jeongguk’s jaw in both hands, looking at him with fierce intent. “You’re a good person, Gukkie.” This time Taehyung briefly presses his lips against Jeongguk’s mouth. “I’m sure your parents were good people too.”</p>\n<p align=\"justify\">“He used to drink,” Jeongguk blurts out. His eyes widen a little in panic when he realizes what he said. “I mean, he wasn’t an alcoholic or anything,” Jeongguk rushes to explain, hands waving through his hair a little franticly, and Taehyung is torn between trying to reassure Jeongguk he’s not obligated to tell him anything again or just letting Jeongguk get it off his chest. “He didn’t even drink during the week. But whenever my parents went to a party, he always had that one glass too many. You know?”</p>\n<p align=\"justify\">Taehyung nods, making a little humming noise of understanding as he weaves fingers through Jeongguk’s hair and captures Jeongguk’s hand, so Jeongguk can’t torment the dark strands any further.</p>\n<p align=\"justify\">“It wasn’t his fault. I know it wasn’t. The truck ran a red light but sometimes I still wonder…” Jeongguk bobs his shoulders in a helpless motion, the movement hampered by lying down. “I wonder if maybe his reflexes would have been better if he hadn’t been drinking.”</p>\n<p align=\"justify\">“Oh, Gukkie,” Taehyung almost sighs, clutching Jeongguk’s hand even tighter in the hope it might take away some of the pain. His heart aches at the thought of the amount of torment Jeongguk objects himself too. The misery he inflicts upon the memory of his father.</p>\n<p align=\"justify\">“I know,” Jeongguk whispers, casting his eyes downwards like a child who's been chastised. “Junghyun hyung gets mad when I say that. He says I shouldn’t talk about dad like that.”</p>\n<p align=\"justify\">“I think,” Taehyung says in a gentle voice, trying to find the right words, “that you just really wish your parents were still here.” Jeongguk flinches, eyes filled with an anguish that Taehyung knows he can never fully understand because he’s lucky enough to have both his parents in good health. “There’s nothing wrong with that.” Jeongguk doesn’t respond, so Taehyung brushes his thumb over his cheek. “If you ever want to talk and you think your brother won’t understand, you can talk to me.” Taehyung cradles Jeongguk’s face with both hands, making sure the man beneath him can see the promise in his eyes. “I’ll listen.”</p>\n<p align=\"justify\">Jeongguk nods, diverting his gaze to the television screen and Taehyung takes note of the silent cue, letting himself fall down to the couch, settling on his side into the nook between the back of the couch and Jeongguk’s body. As the minutes pass, Taehyung can feel Jeongguk’s body relax beside him, Jeongguk’s breathing evening out and becoming calm and deep again. All the while, Taehyung absentmindedly runs his fingers over the exposed expanses of skin, lips brushing against Jeongguk’s shoulder. Unconsciously, Taehyung curves and moulds himself to Jeongguk’s body, like the ocean bending to towards the moon.</p>\n<p align=\"justify\">Somewhere far into his instinctive exploration, Taehyung’s hand slides down Jeongguk’s muscular arm until he reaches Jeongguk’s wrist. Taehyung briefly thumbs at his pulse point before moving up Jeongguk’s arm a little until he finds the small tattoo of a two headed arrow. It’s a collection of just five lines, the arrow depicted in its most abstract form, the head facing in the direction of Jeongguk’s palm.</p>\n<p align=\"justify\">“Yoongi hyung made me get it. As a reminder to not get too stuck in the past.”</p>\n<p align=\"justify\">Taehyung is not quite sure how to respond. He didn’t mean to redirect their conversation back to more tattoos. “I guess that’s not a bad reminder,” he eventually settles on.</p>\n<p align=\"justify\">“No,” Jeongguk agrees. “I suppose not.” Jeongguk lifts his other wrist. “He’s on here too. One of the dots.” Taehyung observes the line of three dots on Jeongguk wrist, starting below the palm and moving up Jeongguk’s arm. “People that helped me after my parent’s death. Yoongi hyung, my brother, and me.”</p>\n<p align=\"justify\">“You helped you?”</p>\n<p align=\"justify\">“You can’t rely on someone else for everything.” Jeongguk wipes his fringe of his forehead. His voice sounds even and collected when talking about the smaller tattoos, like the strong person he always acts to be. “It’s just another reminder. They’re all reminders.”</p>\n<p align=\"justify\">Taehyung feels small under Jeongguk’s gaze, his eyes mature and more experienced, despite being two years younger. Like Taehyung’s quirky behaviour is extra frivolous compared to the thought that went behind all of Jeongguk’s inked skin. Jeongguk is not always the best with words but his tattoos show just how deep Jeongguk’s waters run.</p>\n<p align=\"justify\">Taehyung trails his fingers across the tattoo peeking out just above Jeongguk’s jeans and watches Jeongguk's abdomen contract just as it always does, desperate to lighten some of the tension. “Please tell me this doesn’t represent a person. I’ve licked it more times than I can count.”</p>\n<p align=\"justify\">Jeongguk snickers, eyes dancing. “Don’t worry, that’s just a collection of aesthetically pleasing looking lines.” Taehyung raises an eyebrow. “I lost a bet once when I was drunk,” Jeongguk continues, “and Yoongi hyung made me get a tattoo on my hipbone because it hurts like hell and his soul is as black and worn out as that stupid leather jacket he always wears.”</p>\n<p align=\"justify\">Taehyung chuckles, glad to see Jeongguk’s face painted with something other than hurt again. “You two really have an interesting friendship.”</p>\n<p align=\"justify\">Jeongguk hums in agreement and smirks. “But it’s his loss in the end because it makes for a great focal point during sex.”</p>\n<p align=\"justify\">Taehyung grins. “That it does.” Taehyung then leaves the tattoo on the hipbone in peace and swing his arm around Jeongguk’s waist. “Do you want more?”</p>\n<p align=\"justify\">“Maybe.” Jeongguk brushes his hand over the bicep resting against Taehyung’s chest. “On my arms perhaps. But I want it to have meaning.”</p>\n<p align=\"justify\">“Maybe you should get something a bit more light-hearted,” Taehyung begins to tease, “like <em>Iron Man</em>.” Jeongguk rolls his eyes towards the ceiling but that only encourages Taehyung. “Or a dirty joke. That’s a fun icebreaker.” Jeongguk’s face seems to battle between exasperation and amusement, so Taehyung continues, eager to see him laugh. “I know, you should get a Sudoku puzzle. A really difficult one. One of those with a five-star rating because that would be fun after sex.” When that doesn’t do it, Taehyung brings in the big guns. “Or my face. My face is like a work of art; it never goes out of style.”</p>\n<p align=\"justify\">That finally cracks Jeongguk. “Shut up,” he says between his chuckles. “Anything but your face.”</p>\n<p align=\"justify\">“Gukkie!” Taehyung gasps in mock offense. “How can you even say that?” He cups his own chin with one hand. “Art, I tell you.” Jeongguk just keeps laughing and Taehyung starts to snicker as well. “Nevermind. I don’t want you to tattoo my face anyway. It will just get ugly as you grow old and fat.”</p>\n<p align=\"justify\">“I don’t care.” Jeongguk shrouds himself in his trademark blasé demeanour but Taehyung knows much better than to fall for that again. Jeongguk does care. He’s very much bothered by the opinions of others. “The tattoos put most people off anyway.”</p>\n<p align=\"justify\">“I’m not sure if that’s true,” Taehyung retorts. “I think most people are just surprised.” He swings a leg over Jeongguk’s hips, cuddling even closer. “I was surprised even though I really like them. It’s a lot of ink for someone as young as you.”</p>\n<p align=\"justify\">“I know,” Jeongguk acknowledges. “I blasted through a large part of my inheritance with this apartment and getting the tattoos done.” He sighs. “Not to mention that I spent a lot of my free time in a chair or on a bench in a tattoo shop. The back piece hasn’t been finished for more than a few weeks. I got the final session in when we weren’t talking for a month.” Jeongguk averts his eyes like he’d rather not think of that anymore. “Before our fight and Christmas break.”</p>\n<p align=\"justify\">“I thought I noticed as much but you were sitting with your back towards the couch and…” Taehyung gives a little weak shrug, cheeks flushing with embarrassment when thinking back on that moment and the blowjob he gave Jeongguk on the exact same couch they're now lying on. “I didn’t have the guts to ask.”</p>\n<p align=\"justify\">Jeongguk responds with a similar shrug, like it doesn’t matter. Like he’s no longer bothered with how Taehyung dodged personal conversations in the past. “My brother thinks I’m an idiot. But the pain and—and having them on my body; it’s cathartic somehow.” He places his arm under his head again. “I don’t know. Makes me feel better.”</p>\n<p align=\"justify\">“That’s good,” Taehyung says, angling his body over Jeongguk who is starting to feel a bit cold to the touch without his shirt on. “Everyone deals with stuff in their own way. You could be doing a lot worse than getting inked up.”</p>\n<p align=\"justify\">Jeongguk murmurs in agreement, a hand slipping under Taehyung’s shirt to stroke Taehyung’s back in idle circles, the caress making Taehyung want to purr and curl up like a cat basking in the sun. Taehyung feels so warm. So at home.</p>\n<p align=\"justify\">That night, Taehyung kisses each line of ink, each curl and swirl covering Jeongguk’s body and the unblemished stretches in between. Taehyung’s lips worship the scar on Jeongguk’s cheek and the ones on his legs and arms from where Jeongguk always hurts himself when dancing. Because Taehyung adores every piece of Jeongguk, even the imperfections and the pieces that have been broken and put together again; the ridges of Jeongguk’s mind and personality that are rough around the edges.</p>\n<p align=\"justify\">Taehyung doesn’t like Jeongguk in spite of them. Or because of them. Taehyung likes Jeongguk and that includes every part of him.</p>\n<p align=\"justify\">Taehyung knows he can’t stop until Jeongguk finally believes that.</p>\n<p align=\"justify\"> </p>\n<p align=\"justify\">The coming weeks, Taehyung discovers just how much he likes Jeongguk. He discovers that he really does. So, so much.</p>\n<p align=\"justify\">But sometimes Jeongguk just makes it so hard to like him.</p>\n<p align=\"justify\">Like right now, when Taehyung is wearing formfitting jeans, has his hair done up in a casual <em>somebody clutched at it during sex and now I look gloriously fucked</em> kind of manner, and is wearing eyeliner. Actual eyeliner. He looks good. He knows he does because the people at the club hadn’t been able to keep his eyes off him. Jeongguk had known it too, hands all over him, lips sucking possessive hickeys of ownership into the skin of his neck. Right there in public to the great dismay of their friends.</p>\n<p align=\"justify\">But alas, that smouldering fire back in the club had been extinguished by what Jeongguk considers an apparent disaster in his social life.</p>\n<p align=\"justify\">Taehyung sighs. He takes in Jeongguk’s broad shoulders resting against the back of the couch, black hair moved to the sides, exposing his forehead and that pierced eyebrow that never fails to drive Taehyung wild. If Taehyung didn’t know better, he’d call Jeongguk’s aesthetic: <em>sexy brooding in a tall, dark stranger kind of way.</em> But he’s better informed than that, so he knows that <em>sulky kid</em> is a far more accurate description.</p>\n<p align=\"justify\">Jeongguk turns to look up at him, corners of his lips turned down and eyebrows furrowed. “You don’t think there’s <em>really</em> anything going on there, do you?”</p>\n<p align=\"justify\">Seriously? Taehyung is standing before him in a shirt without holes. Without his trademark holes, that’s the extraordinary lengths he’s willing to go to for Jeongguk, and Jeongguk lacks the common courtesy to eye fuck him the way Taehyung obviously deserves after the monumental struggle he’s had with that horrible stick of eyeliner.</p>\n<p align=\"justify\">Taehyung suppresses the urge to sigh again. Barely. He tilts his head, offering an unsure, “Maybe?”</p>\n<p align=\"justify\">And by ‘<em>maybe’</em> Taehyung means an all resounding yes. Of course there’s <em>something</em> going on considering Jeongguk’s <em>‘there’</em> refers to accidently finding two of their friends sucking face in one of the stingy bathroom stalls of the club they’ve just gotten back from. Sucking face and sucking God only knows what else. If there's any deeply felt emotion behind the sucking of various body parts is not yet clear to Taehyung, but he's planning on subjecting his best friend to a thorough interrogation at a later time. </p>\n<p align=\"justify\">Jeongguk groans like Taehyung just kneed him in the gut, shoulders slumping in misery. “Great.”</p>\n<p align=\"justify\">Taehyung wants to echo that sentiment. Curse Jimin and his horrible timing. Things had been going so well back in the club with Jeongguk skilfully gyrating his hips into Taehyung’s, hinting at an evening full of dark promises.</p>\n<p align=\"justify\">But seeing Jimin’s hand down his precious Yoongi hyung’s pants seemed to have put a definite damper on Jeongguk’s usually relentless horniness. However, Taehyung won’t be defeated that easily. He won’t give up on what he felt back at the club; Jeongguk’s thighs hot and heavy between his legs, hands hungrily gripping his waist.</p>\n<p align=\"justify\">Goal firmly in mind, Taehyung makes his way to the couch and straddles Jeongguk’s lap, caging Jeongguk with his legs and the arms he slips around Jeongguk’s neck. Jeongguk’s hands automatically enclose themselves around the curve of Taehyung’s ass, briefly tightening to cup an admiring feel. Taehyung doesn’t know if it’s a completely conscious action on Jeongguk’s part but it’s encouraging nonetheless.</p>\n<p align=\"justify\">Gently pushing some escaped strands of hair off Jeongguk’s forehead, Taehyung asks, “Why are you so upset? This could be a good thing. Maybe Yoongi hyung will have less time to boss you around if he’s hanging out with Jimin.”</p>\n<p align=\"justify\">Jeongguk shrugs, eyebrow furrowing even further, obviously unable to see the bright side.</p>\n<p align=\"justify\">Taehyung can feel a little sliver of impishness creep into his features, ready to poke a bit of fun at Jeongguk’s childish sulkiness. “Maybe the four of us can go on double dates. That should be fun.”</p>\n<p align=\"justify\">Jeongguk’s face fills with so much horror that Taehyung would almost feel bad. Almost. But not really, so deep giggles shake his frame instead. Jeongguk’s hands immediately grab Taehyung’s thighs and start to push, trying to dislodge Taehyung from his lap. Expecting this reaction, Taehyung tightens the grip of his legs and arms, clinging to Jeongguk like an obnoxious octopus as he buries his laughter in Jeongguk’s neck.</p>\n<p align=\"justify\">Jeongguk eventually gives up, settling on delivering a vengeful pinch to Taehyung’s ass, only making Taehyung laugh even harder. “God,” Jeongguk grunts. “You’re the worst.”</p>\n<p align=\"justify\">“But you luuuuuvvv me,” Taehyung drawls against his skin, placing a mollifying kiss there before coming up to look at Jeongguk with twinkling eyes. Jeongguk looks at him with a slightly pained expression, indicating that he probably does love Taehyung even though he’s kind of wishing he didn’t right now.</p>\n<p align=\"justify\">“You two can come to pick us up at the dorm in matching tuxes,” Taehyung continues enthusiastically, Jeongguk’s cringing only spurring him on even further. After Christmas break, Taehyung moved back into the dorm with Jimin but he still sees Jeongguk almost every day, often eating together during lunch, sleeping over at least twice a week. Jeongguk occasionally swinging by unexpectedly in the morning to walk him to class or the lab might be one of Taehyung’s favourite things in the world. “And bring us flowers and chocolate.” Jeongguk creases up his nose like he just smelled something bad. “Maybe take us on a gondola ride during sunset.”</p>\n<p align=\"justify\">“A gondola ride?” Jeongguk splutters incredulously, having reached his limit. “Do they even have those here?” He releases a mocking huff. “What horrible romantic comedy do you live in exactly?”</p>\n<p align=\"justify\">Taehyung grins, placing a peck on Jeongguk’s nose. “Find me a gondola ride and I promise to love you forever.”</p>\n<p align=\"justify\">Jeongguk raises an eyebrow. “Forever, huh?” Taehyung nods gleefully. “But only if we take Yoongi hyung and Jimin too?” Taehyung nods again, eyes scrunching up and lips parting in his rectangular smile. “Yeah,” Jeongguk twangs. “I think I’ll just settle for forever minus a day.”</p>\n<p align=\"justify\">“Forever minus a day,” Taehyung murmurs, warmth uncurling in his chest. “Aren’t you confident.”</p>\n<p align=\"justify\">Jeongguk merely smiles smugly in return. He is growing confident. About Taehyung. About them. He no longer seems to wonder if Taehyung will be at his side if he needs him and is just starting to expect he will instead. Much like Taehyung no longer doubts to find Jeongguk holding his hands when he’s sad or insecure. They’re both growing confident.</p>\n<p align=\"justify\">But apparently Jeongguk still has one or two things he’s worried about. Something outside the scope of their love life and more into the scope of someone else’s. Jeongguk looks up at him with those big, black, bunny eyes that do funny things to Taehyung’s insides. His voice is adorably serious as he asks, “Do you think Yoongi hyung is going to make me call Jimin hyung?”</p>\n<p align=\"justify\">Taehyung looks at him, mouth slack, before erupting in an absolutely thunderous laugh. Jeongguk starts pushing him off his lap again in irritation but his attempts are feeble at best, more or less done out of principle and without actual grit, and Taehyung is able to hold on despite the way his muscles are wrecked with laughter. Even almost falling on his ass can’t kill his joy at Jeongguk’s expense and he clutches at his stomach that feels like it’s being painfully forced into a six-pack by laughing alone. It takes several minutes until Taehyung hiccups his final shaky chuckles and wipes a few escaped tears from his eyes.</p>\n<p align=\"justify\">Taehyung turns his attention back on his increasingly irritable boyfriend. “Is this why you’re so cranky? You think Jimin is going to use Yoongi hyung to get back at you?”</p>\n<p align=\"justify\">“No,” Jeongguk is quick to deny, but Taehyung sees something that isn’t quite fear as it is uneasiness flicker across Jeongguk’s face. His Jeongguk’s face. The face of that though, strong man with all the tattoos whom half the campus would avoid if they ran into him in a poorly lit street. That man who’s rough around the edges, a little callous when he feels cornered and upset, who pretends to not need anyone’s approval yet shines so bright when being praised. Who goes so soft when it’s Taehyung who tells him how important he is. How much he matters.</p>\n<p align=\"justify\">A few more wheezing giggles escape Taehyung but he’s quick to curb the rest when Jeongguk shoots him a look that could kill.</p>\n<p align=\"justify\">“Don’t worry,” Taehyung coos. Looking down at Jeongguk with mischief dancing in his eyes, he wraps his arms back around Jeongguk’s neck. “I’ll protect you.”</p>\n<p align=\"justify\">“Oh, please,” Jeongguk scoffs deprecatingly. “You’re way too scared of Yoongi hyung. Last week you spotted him in the corner and almost jumped a foot into the air.”</p>\n<p align=\"justify\">“I’m not scared,” Taehyung protests immediately. “I just didn’t see him there. He can be so quiet sometimes. What was he doing in the corner anyway? Just looming there—” Taehyung shivers a little at the memory “—like some kind of pale angel of Death.”</p>\n<p align=\"justify\">“Yeah,” Jeongguk snorts derisively. “You don’t sound scared at all.”</p>\n<p align=\"justify\">“I’m not,” Taehyung denies petulantly. And he isn’t. Maybe he’s a little intimidated by the pink haired man but that has more to do with the fact that he’s almost like a surrogate brother to Jeongguk. Fortunately, Taehyung is quite sure that the older man may find him a bit peculiar (as most people do) but also appreciates of how happy Jeongguk looks around Taehyung. The unspoken promise Taehyung made in his mind to Yoongi to take good care of Jeongguk weighs on Taehyung’s shoulders like a comfortable coat he doesn’t ever want to part with.</p>\n<p align=\"justify\">Taehyung squints his eyes into crescents as his lips part to give way to a teasing rectangular smile. “And seeing Jimin trying to eat off Yoongi hyung’s face after his show did ruin his street cred a little bit. I don’t think I’ll jump the next time he’s hiding in the corner.”</p>\n<p align=\"justify\">“Wonderful,” Jeongguk mutters. “Good for you.”</p>\n<p align=\"justify\">“Stop worrying,” Taehyung says with a snigger. He places an affectionate kiss alongside Jeongguk’s jawline, his lips lingering briefly. It’s so sharp that Taehyung sometimes wonders how he hasn’t cut himself on it yet. “If Jimin decides to use his manly wiles for evil, you can always enlist the help of Seokjin hyung.”</p>\n<p align=\"justify\">Jeongguk raises that pierced eyebrow. “You really think Yoongi hyung will care about Seokjin hyung butting in?”</p>\n<p align=\"justify\">Now it’s Taehyung’s turn to scoff. “Please, your grumpy grandpa is no match for my mom shark.” Jeongguk rolls his eyes at that but Taehyung can see the corners of his lips quirk slightly with the beginning of a smirk. “Besides, you’re Seokjin hyung’s new favourite because you’re the only one he deems worthy of being his kitchen disciple.”</p>\n<p align=\"justify\">Jeongguk actually smiles a little at that and the sight causes familiar flutters low in Taehyung’s abdomen. Taehyung had never suspected Jeongguk and Seokjin would get along that well. Seokjin with his immaculate dress shirts and distaste for foul language yet he seemed to have taken Jeongguk under his wing, thrilled at finally having found someone who shares his interest in cooking.</p>\n<p align=\"justify\">In fact, somehow their ragtag group of friends meshed surprisingly well, falling together like they were meant to be, despite they’re seemingly diverging interests and personalities. Just last week they all had dinner together for the first time, Hoseok and Yoongi talking about music for hours, Jeongguk and Seokjin cooking dinner, Jimin <em>squabbling</em> with Yoongi (in a somewhat convoluted mating dance apparently), and Taehyung ending up evicted from the kitchen indefinitely for prematurely stuffing his face with what turned out to be essential ingredients and almost ruining diner. Taehyung still felt somewhat sore about that. Jeongguk and Seokjin hadn’t been willing to listen to his side of the story at all.</p>\n<p align=\"justify\">But when seeing Jeongguk’s faint smile right now, Taehyung forgets all about how he was clearly unfairly dismissed from the kitchen, leaning forward like a flower drawn to the sun. Taehyung decides it’s definitely time to move on to more pleasant things. Something that includes more smiling from the both of them, less talk of their friends, and hopefully more moaning. Taehyung licks his bottom lip and sees Jeongguk’s gaze flicker down to follow the movement. Yes, definitely something that involves more moaning.</p>\n<p align=\"justify\">Taehyung moves a little closer, rolling his hips into Jeongguk with determination, and the sudden dark glint in Jeongguk’s eyes lets Taehyung know his boyfriend isn’t oblivious to what Taehyung is doing. Taehyung cocks his head a little, voice dropping to an even hoarser timbre. “Don’t you like the outfit I picked?”</p>\n<p align=\"justify\">Jeongguk tilts his head as well, mirroring Taehyung, pursing his lips a little like he’s giving it serious thought. “Clothes that actually fit you. Without holes as well. I think I remember seeing something similar in a far, far away past but I’ve seen you in so many hideous sweaters by now that I can hardly remember it.”</p>\n<p align=\"justify\">Taehyung gives Jeongguk a salacious wink. “Dug it up from underneath the mothballs just for you, Gukkie.”</p>\n<p align=\"justify\">Jeongguk smirks and tugs at the red fabric around Taehyung’s neck. “Don’t you think this kind of ruins it?”</p>\n<p align=\"justify\">Taehyung gasps, trying to imitate one of Hoseok’s iconic offended faces. “It’s got sentimental value. It’s <em>our </em>red scarf.”</p>\n<p align=\"justify\">“<em>My</em> scarf.”</p>\n<p align=\"justify\">“You <em>gave</em> it to me, Gukkie.”</p>\n<p align=\"justify\">“<em>Borrowed</em>,” Jeongguk counters with a grin. He nods towards one of Taehyung’s feet. “Those are an unexpected addition too.”</p>\n<p align=\"justify\">Taehyung briefly locks eyes with the Iron Man on his left foot. “I washed them and put them in my closet. They’re mine now.”</p>\n<p align=\"justify\">“Is that the way it works,” Jeongguk grin widens, eyes filled with tender playfulness. None of Taehyung’s previous boyfriends ever looked at Taehyung like that. None played along as well as Jeongguk does.</p>\n<p align=\"justify\">“Yeah,” Taehyung replies with a boxy grin of his own, pleased at how Jeongguk finally seems to have managed to banish thoughts of Jimin and Yoongi to the darker recesses of his mind, safely locked away. They could stay there until the next time Taehyung felt like torturing his boyfriend for his own amusement. “That’s the way it works.”</p>\n<p align=\"justify\">Jeongguk tugs aside Taehyung’s collar before nipping at the newly exposed skin, leaving a faint red mark behind.</p>\n<p align=\"justify\">“Mine,” Jeongguk declares, eyes dark and full of suggestion as he looks up at Taehyung. The obsidian orbs burn and their heat goes straight to Taehyung’s core.</p>\n<p align=\"justify\">Taehyung bites his lip. That’s better; this evening is back on track.</p>\n<p align=\"justify\">Taehyung strokes his hands down Jeongguk’s side as he places more marks in the crook of Taehyung’s neck, working his way up, feverishly muttering ‘mine’ into Taehyung’s skin. Reaching Jeongguk’s jeans, Taehyung moves one hand to the centre and squeezes with intent, pleased with the semi-hardness he finds there. Even with the novelty of dating wearing of after a few weeks, Jeongguk’s body is just as responsive to Taehyung as before.</p>\n<p align=\"justify\">“Mine,” Taehyung states, squeezing once more for good measure.</p>\n<p align=\"justify\">“Fuck.” Jeongguk’s curse breathes hot against Taehyung’s ear shell. “You sure are subtle, baby.”</p>\n<p align=\"justify\">“Just making sure you won’t forget,” Taehyung murmurs, voice part teasing and part serious, head dipping low to place his own marks along Jeongguk’s neck. Both could play that game. Taehyung has begun to develop a newfound appreciation for the way Jeongguk always imprints his skin ever since he saw the girl at the coffee shop near Jeongguk’s apartment stare at a particularly vicious hickey Jeongguk had left on the column of his throat. Now gratification twirls warm and slow in his abdomen whenever he sees people staring at either his or Jeongguk’s hickeys, something inside him twisting in contentment when he sees the realization that they’re taken settle in the eyes of the other students at campus.</p>\n<p align=\"justify\">“Never,” Jeongguk promises in a thick whisper. He underlines his statement by tugging on Taehyung’s earlobe with his teeth, hands massaging the globes of Taehyung’s ass, and Taehyung hears his own breath catch in his throat.</p>\n<p align=\"justify\">Taehyung can feel a sudden neediness claw at bones, a desire poisoning his blood so it chars his veins and he rolls his hips down again more desperately. Only Jeongguk gets him on the edge that quickly. Makes him hard that fast.</p>\n<p align=\"justify\">Taehyung leans back to pull his shirt off over his head, huffing a little in indignation when it briefly gets stuck behind his ears, not really used to wearing tightfitting clothes, always forgetting they’re just as much of a pain getting off as they are getting into.</p>\n<p align=\"justify\">Watching Taehyung struggle in his haste to get naked, makes Jeongguk release a few endeared chuckles. “You don’t have to wear that for me, you know,” Jeongguk says as he pulls Taehyung close again. “I like it but I like your artsy fartsy hole-filled sweaters too.” He gives Taehyung one of his serious looks. A look that’s supposed to mitigate all the times he makes fun of Taehyung and his clothing, like he’s suddenly a bit worried Taehyung might not know that he’s joking when he does it. “You know I do.”</p>\n<p align=\"justify\">“I know,” Taehyung is quick to reassure him. He sits up straight on Jeongguk’s lap, places his hands on his own shoulders and strikes a pose. “You’re all over these collarbones.” Taehyung sticks out his tongue provocatively. “Pervert.”</p>\n<p align=\"justify\">“You’re a fucking nightmare,” Jeongguk says, groaning despairingly, but there’s an entertained undercurrent to his words that he just can’t quite hide.</p>\n<p align=\"justify\">Taehyung is about to launch into a speech about how he’s pretty sure he’s all of Jeongguk’s dreams come true, when strong arms jostle him up into the air, making nothing but a surprised gasp tumble past his lips instead. There’s no time for protests as Jeongguk connects their lips in a bruising kiss, teeth nipping at Taehyung’s bottom lip as he begins to navigates them to bedroom. This is Jeongguk taking control of the situation and Taehyung lets him, obligingly clinging closer, limbs eagerly wrapped around Jeongguk’s torso. This is what Taehyung had been waiting for all night. This is Jeongguk finally tending to the fire that always crackles between them until it will consume them again with bliss.</p>\n<p align=\"justify\">It would be a lie to say it’s effortless for Jeongguk to lift them of the couch and carry Taehyung to the bedroom (Taehyung is more robust than his delicate features and normally baggy clothing would suggest) but it’s not really hard on him either. And Taehyung can’t help but revel in Jeongguk’s raw power. He can’t help but burn. Even with their arousal straining almost uncomfortably behind their jeans and between their bodies, he can’t help but rub up against Jeongguk in search for more. Even when his desperate grappling at Jeongguk’s body makes Jeongguk clash their shoulders against the door post with a painful thud, Taehyung can’t stop.</p>\n<p align=\"justify\">Taehyung is sure he’ll always want more of this. More of Jeongguk. More of the way Jeongguk makes what was already there in Taehyung burn brighter while adding completely new embers to the flame. He makes everything around Taehyung seem so effervescent; all the colours saturated with a poignant vibrancy. Taehyung never wants to go back to the dark. To the grey that didn’t even seem colourless before Jeongguk.</p>\n<p align=\"justify\">They reach the bed and Jeongguk lets them fall forward until they end up a tangled mess of limbs and breathy chuckles. Jeongguk’s T-shirt disappears but before Taehyung has the chance to run an appreciative gaze over the newly uncovered skin, Jeongguk’s lips are upon his again. Jeongguk tastes so sweet, so hungry, and Taehyung isn’t sure if he’s being devoured or if he’s the one swallowing Jeongguk whole. Maybe it’s both. Maybe they’ll consume each other until they’re one. Or maybe until there’s nothing left.</p>\n<p align=\"justify\">Unable to see, Taehyung resorts to worshipping with his hands instead, long fingers kneading the strong planes and muscles of Jeongguk’s shoulders and back, nails racking across the dark lines of inks he now knows by heart. Jeongguk does the same, coarse finger pads skimming over the dips and lines of Taehyung’s stomach until they reach denim. Everywhere he touches Taehyung, Taehyung’s skin seems to ignite. He burns.</p>\n<p align=\"justify\">Jeongguk’s hands are rough as he pulls the stiff denim and the underlying underwear down, Taehyung moaning in relief when his erection is freed from the rigid fabric. The jeans get caught behind Taehyung’s ankles and Jeongguk yanks them off with one final tug, muttering a few violent expletives under his breath. “Stick to your regular clothes next time,” Jeongguk grumbles, forehead creased in annoyance. “These take fucking forever to get off.”</p>\n<p align=\"justify\">Taehyung snickers at Jeongguk’s sexual frustration. “So impatient.”</p>\n<p align=\"justify\">But Taehyung’s chuckles die on his lips when Jeongguk grasp his dick, squeezing it just right and giving it a teasing tug. Taehyung gulps, hips involuntarily bucking up into Jeongguk’s touch, and Jeongguk smirks knowingly. Jeongguk knows all too well that Taehyung is just as desperate as he is.</p>\n<p align=\"justify\">Taehyung wishes he had the will power to balk at the blatant smugness, but he’s too hot, too needy for more, so he helps Jeongguk get out of his jeans instead. And then there’s nothing separating them. There’s only naked skin. There’s nothing in the way of their hands and lips as the reacquaint them with all the curves and turns of each other’s body, seeing if anything has changed in the very brief time they were apart. Taehyung finds out Jeongguk feels just as good, tastes just as good, as he did before. Maybe even better. The way Jeongguk dips in the hollow of his throat to torment his soft skin, the way their erections rub together as they move against each other. It seems to get better every time.</p>\n<p align=\"justify\">But Taehyung still wants more.</p>\n<p align=\"justify\">“Gukkie,” Taehyung croaks when Jeongguk rolls their hips together in a particularly effective stroke. “Lube.”</p>\n<p align=\"justify\">They disentangle from each other with considerable effort, Jeongguk reaching over to grab the lube from the nightstand drawer. He rolls back with his prize, dropping it on the sheets between them. One hand brushes affectionately across Taehyung’s hipbone, the soft caress making Taehyung shiver.</p>\n<p align=\"justify\">“You want to top?” Jeongguk’s voice embodies a strange combination of lust and sensitivity. This is Jeongguk eager to please, maybe even feeling a bit guilty about how he’d almost ruined their evening by sulking on the couch. This Jeongguk, caring and tender in his own way, makes Taehyung even more keen to crawl under this man’s skin and into his heart and built a permanent home there.</p>\n<p align=\"justify\">Taehyung shakes his head. “No. You top.” He bites his bottom lip, searching for more words and Jeongguk halts his stroking, picking up on Taehyung’s sudden hesitation and that only makes Taehyung’s chest ache even more. Dark orbs bore into Taehyung’s and Taehyung can’t help but answer the questioning look that lies within the black pools. “The condoms. Do you-do you want to go without?”</p>\n<p align=\"justify\">There’s an almost imperceptible raise of Jeongguk’s eyebrow piercing but Taehyung catches the faint glimmer. “No condom?”</p>\n<p align=\"justify\">“Yeah.” Taehyung feels a blush creep up his cheeks. But it isn’t shame or embarrassment. It’s a heat that expands under his skin at the thought of what they’re about to do. “I want to feel you. All of you.”</p>\n<p align=\"justify\">Jeongguk’s answer comes in the form of another bruising kiss. Taehyung will never tire of the way Jeongguk kisses him. Jeongguk’s kisses tell him more about how much he desires Taehyung, how much he cares, than words ever could. There are entire confessions hidden in the way Jeongguk licks into his mouth and moves his tongue against his own.</p>\n<p align=\"justify\">Jeongguk moves lover, his lips writing love letters in the slope of Taehyung’s neck, his fingers declaring his eternal affection on the soft skin of Taehyung’s thigh. And Taehyung lets himself sink into the bed, not so much hearing as feeling the words being written into his skin, giving his response in soft groans and gasped breaths.</p>\n<p align=\"justify\">One slicked finger circles Taehyung’s entrance before slipping inside, Taehyung immediately sinking down on it with crooned pleasure. Taehyung wants to close his eyelids and roll his head back in pleasure but he can’t. Not with Jeongguk’s gaze burning into his own, watching every expression from his spot between Taehyung’s spread legs, every response to his touch that flickers across Taehyung’s face.</p>\n<p align=\"justify\">A second finger joins the first, Taehyung eagerly accepting that one too, Jeongguk’s half-hooded eyes filling with lust-laced wonder. Jeongguk looks as if Taehyung is the most amazing creature he has ever laid eyes upon, has ever touched, and it only makes Taehyung want to please him more.</p>\n<p align=\"justify\">Jeongguk’s fingers twist and curl until they find that spot that makes Taehyung fall apart every time he strokes past it, a wrecked sob spilling from Taehyung’s mouth each time he brushes against it. And there are sparks dancing under Taehyung’s skin, travelling from wherever Jeongguk touches him to the heat growing in his lower abdomen.</p>\n<p align=\"justify\">“You always take it so well, baby,” Jeongguk praises, voice low and full of desire, as he pushes a third finger in. The well-known compliment is like a soothing balm, smothering the sting of being worked open.</p>\n<p align=\"justify\">Taehyung longs for Jeongguk’s hand around his dick again, pushing him over the edge, making him explode, but he resists the temptation to ask for it. He doesn’t want to come like that. He needs Jeongguk inside of him. All of him with no barriers to separate them for the very first time. The mere thought makes shivers run down his spine.</p>\n<p align=\"justify\">“Gukkie,” Taehyung groans, deep voice splintered with lust. “<em>Hurry</em>.”</p>\n<p align=\"justify\">Jeongguk obeys, retracting his fingers, always weak when Taehyung calls him Gukkie. Always weak when Taehyung makes his voice waiver with unbridled neediness. The disappearance of Jeongguk’s digits has Taehyung feeling empty and bereft, the only consolation being the promise of something better.</p>\n<p align=\"justify\">Taehyung props himself up on two elbows, watching Jeongguk lube himself, his face contorted in almost painful pleasure. The sight makes Taehyung’s mouth go dry, a thirst tearing him apart on the inside. He’s burning and only Jeongguk can quench it.</p>\n<p align=\"justify\">“Like this?” Jeongguk’s words are gruff and Taehyung wonders if he's still capable of forming coherent sentences. If they both are still capable or if they’re already too far gone in their hazy longing to talk with their mouth instead of their bodies.</p>\n<p align=\"justify\">“Yeah,” Taehyung answers as he falls back on the pillows. Somewhere in the back of his mind, Taehyung registers how soft the sex is, how vanilla. But he wants it like this. He wants to see Jeongguk when he takes him inside his body. He wants this new first for them to be slow. Taehyung wants to relish in it.</p>\n<p align=\"justify\">Jeongguk must feel the same. His hand is undemanding when he grips Taehyung’s hip to hold him steady and the first thrust so agonisingly gentle. Taehyung can feel every inch of Jeongguk push inside him, every little bit of extra stretch sending new flashes of bliss up his spine. And Jeongguk is above him, watching how he tears Taehyung apart in the best way and Taehyung can see the same high reflected in those round black eyes above him.</p>\n<p align=\"justify\">Taehyung is sure he’s never seen something as beautiful as the pleasure etched on Jeongguk’s face.</p>\n<p align=\"justify\">Jeongguk lets his head drop down when he finally bottoms out and curses, hot pants fanning against the crook of Taehyung’s neck.</p>\n<p align=\"justify\">“I know,” Taehyung moans in return. And he does know. He’s so fucking close and so is Jeongguk, Taehyung can tell by how Jeongguk’s biceps strain beneath his hands. They’re both trying so hard to keep it together but the feeling of truly melting into one for the first time is like a blissful current trying to pull them under until they drown in it.</p>\n<p align=\"justify\">Yet Jeongguk manages to settle into a slow rhythm, moving so deliberately, trying desperately to prolong the pleasure. Prolong their union. His entire body feels taut against Taehyung with restraint, the effort of holding back painted in every contour of his body. It’s torture. The leisurely push and pull into Taehyung’s body, the scorching friction that makes all the nerve endings sings, it’s all torture. The sweetest kind. Taehyung is teetering right at the edge. They both are and he knows that the longer they walk this staggering line, the better the fall.</p>\n<p align=\"justify\">Every time Jeongguk thrust in, every time Taehyung moves his hips up to meet him, there are new white hot flashes tormenting nerves. Jeongguk feels so good. So close that Taehyung can no longer tell where he ends and Jeongguk begins. Taehyung tells him, tells him just how good he feels in broken whispers and breathy grunts, Jeongguk responding by groaning his own sweet nothings into Taehyung’s hair. Their moans and sobs filling the air, mingling with the sound of their bodies coming together, skin against skin. Their bodies have become slippery, hands moving smoothly over sweat-slicked planes. Taehyung licks across Jeongguk’s shoulder, tasting the salt, before dipping his tongue into the hollow of his collarbone.</p>\n<p align=\"justify\">Maybe he’d done it on purpose. Maybe he’d wanted Jeongguk’s resolve to break. And it does break. Taehyung can feel the exact moment Jeongguk’s carefully crafted dam of will power caves and he’s overrun by a hungry fiery need that he can’t hold back any longer. Jeongguk speeds up, his lunges punishing and desperate like he wants to completely disappear into Taehyung’s body and never leave. Taehyung eagerly takes every single one, nails digging into Jeongguk’s shoulder, leaving crescent-shaped marks in their wake. And Jeongguk is kissing him like he’s loving him, peppering Taehyung with feeling as their mouths crash together. And it all melts, the touching, the kissing, the emotions, until they’re a tightly wound ball of heat that’s burning Taehyung up from the inside.</p>\n<p align=\"justify\">But it’s a pace Jeongguk can’t keep up with and ultimately his rhythm falters followed by his release. The feeling of Jeongguk swelling inside him and the additional stretch is the final flame that makes the coil of heat in Taehyung’s abdomen explode and consume him in a blaze of ecstasy. He comes untouched, painting both their stomach white while Jeongguk does the same deep within Taehyung.</p>\n<p align=\"justify\">Jeongguk’s body is heavy when he slumps down on top of Taehyung but Taehyung loves the weight. He loves how it ground and anchors him to the bed until he’s able of finding his way back to his own body. Until the flames of pleasure retreat and there’s nothing but the warm glow of contentment left behind.</p>\n<p align=\"justify\">Taehyung doesn’t know how long it takes for their breathing to return to normal but it’s long enough for Jeongguk to grow soft and slip from his body, making them both shiver with the aftermath of their desire. Jeongguk rolls off Taehyung and for a moment Taehyung is scared Jeongguk might leave to get a towel but he doesn’t. He pulls Taehyung flush against him instead.</p>\n<p align=\"justify\">Taehyung starts drawing lazy patterns across Jeongguk’s body with one hand, tracing all the tattoos that are no longer a mystery to him. Jeongguk does the same, hand dipping over Taehyung’s waist and continuing downwards, until a finger finds Taehyung’s entrance and the evidence of what they just did. In an uncharacteristic moment of bashfulness, Taehyung feels a redness colour the tip of his ears. He opens his mouth to make a silly remark to try and hide his sudden embarrassment but Jeongguk beats him to it, all cheeky grin and bunny teeth, “My dick has ruined you.”</p>\n<p align=\"justify\">Taehyung punches his fist against Jeongguk’s arm but it lacks force with how mushy his muscles still feel after his orgasm. “Don’t steal my lines.”</p>\n<p align=\"justify\">“Maybe you should get new lines,” Jeongguk teases with twinkling eyes.</p>\n<p align=\"justify\">Taehyung looks at the young man beside him. Not the tough guy people think he is but not the fragile boy from his weakest moments either. Just Jeongguk. His Jeongguk. The Jeongguk only he gets to see.</p>\n<p align=\"justify\">“I love you,” Taehyung whispers. They’d never said it like that before; soft-spoken instead of teasing, words pregnant with meaning, faces so close that their noses are almost touching. Now it’s Jeongguk’s turn to blush and Taehyung feels a thick, warm blanket of satisfaction settle over him.</p>\n<p align=\"justify\">“I love you too,” Jeongguk whispers back, almost stammering over the words. Taehyung glows, a radiance uncurling in his chest and spreading all the way down to the tip of his toes.</p>\n<p align=\"justify\">After that, Jeongguk is all loving touches and affectionate caresses in the shower, laughing for a good five minutes at Taehyung’s raccoon eyes from the runny eyeliner. He even lets Taehyung use one of his stupidly expensive shampoos and body washes, only grumbling a little in protest when Taehyung ends up using an excessive amount in his enthousiasm. It takes a single kiss for Taehyung to be forgiven.</p>\n<p align=\"justify\">Their finger tops are wrinkly by the time they make it back to the bed. Clean and barefaced, Taehyung settles on his side of the bed after they decorated it with a fresh pair of sheets, some rings and his spare phone adapter a permanent fixture on the nightstand beside it.</p>\n<p align=\"justify\">Jeongguk lies down on the mattress behind him with his chest against Taehyung’s back. A hand starts carding its familiar path through Taehyung’s hair, drawing sleep even closer, always successful at pulling Taehyung down into a slumber. Jeongguk will probably sniffle during the night but it doesn’t matter because Taehyung no longer has trouble sleeping through the sounds. Taehyung will probably end up flailing his limbs in his sleep but Jeongguk will just constrain him by wrapping him in a tight hug like he does most nights Taehyung comes over. They’ve adjusted to each other’s quirks.</p>\n<p align=\"justify\">Taehyung doesn’t worry as he falls asleep. He might not know where he’ll do his graduate studies, if they’ll offer him a position at the school they’re at now, or if he’ll continue his studies somewhere else. The future might be uncertain but he’s no longer willing to settle on something less than what he has with Jeongguk.</p>\n<p align=\"justify\">Taehyung wants to burn. He wants to see the world in vibrant colours. Sometimes that means trouble. Sometimes it makes Taehyung trouble and occasionally, Jeongguk is trouble too.</p>\n<p align=\"justify\">But mostly, Taehyung knows he’ll never be cold with Jeongguk holding him.</p>\n<p align=\"justify\"> </p>"
}