{
  "id": "529219",
  "url": "https://archiveofourown.org/works/529219?view_full_work=true",
  "author": [
    "owlpostagain"
  ],
  "title": "here is the deepest secret nobody knows",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "F/M",
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Lydia Martin/Jackson Whittemore"
  ],
  "characters": [
    "Stiles Stilinski",
    "Erica Reyes",
    "Isaac Lahey",
    "Derek Hale",
    "Scott McCall",
    "Lydia Martin",
    "Jackson Whittemore",
    "Danny Māhealani",
    "Vernon Boyd"
  ],
  "additional_tags": [
    "Pack Dynamics",
    "Pack Feels",
    "Stiles/Erica bromance",
    "Pack Mom Stiles Stilinski",
    "Post Season 2"
  ],
  "language": "English",
  "series": "",
  "published": "2012-10-05",
  "completed": null,
  "words": "22,322",
  "chapters": "1/1",
  "comments": "550",
  "kudos": "27,343",
  "bookmarks": "7,740",
  "hits": "445,379",
  "summary": "<p>“Derek,” Stiles groans. “You have me. You’ve always had me, you absolute moron, how many physically impossible feats of life-saving heroics do I have to perform before you get it?”</p>",
  "notes": "<p>Nothing here belongs to me - this is, in fact, the closest I've ever gotten to canon/non-AU fanfiction before and therefore I really can't claim ownership of any of it. </p>\n<p>Title comes from the wonderful poem \"i carry your heart\" by ee cummings.</p>\n<p>Beta'd by the most wonderful and beautiful and fantastic closestofcalls, the beta to my alpha</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>This is my first attempt at writing anything in the Teen Wolf fandom - it's an experiment at best, an exploration of a whole ton of post-finale/season-long feelings at worst. Thanks for reading!</p>",
  "text": "<p> </p>\n<p> </p>\n<p>\n<br><em>here is the deepest secret nobody knows<br> (here is the root of the root and the bud of the bud</em>\n<br><em>and the sky of the sky of a tree called life; which grows</em>\n<br><em>higher than soul can hope or mind can hide)</em>\n<br><em>and this is the wonder that's keeping the stars apart</em>\n</p>\n<p><br> It’s something of a tragic commentary on Stiles’ life that he doesn’t even flinch at the sight of a dark figure slouched against his bedroom wall. <em>Secret club house entrance, werewolves only;</em> he was going to have a sign made and hung outside his window, maybe take a Sharpie to it and cross out ‘<em>were</em>’ for ‘<em>sour</em>,’ because why the fuck not.<br><br> “Really, I do have a front – Erica?”<br><br> Stiles freezes, fingers still fumbling against the light switch that had just helped throw the shadowy corner into sharp relief. Erica Reyes, the last werewolf, last <em>person </em>he ever would have expected, is slumped against the window frame, blonde curls tangled and matted and filthy across her face, hanging damp and heavy with <em>oh god that was blood</em>.<br><br> “Shit shit shit,” Stiles hisses, throwing himself across the bedroom as fast as his painfully human limbs would let him, careening to a stop just before crashing into her. She barely moves in response, barely does more than gasp at him with a sickeningly wet, squelching sound and a painfully uneven rise and fall of what had to be, at the very least, broken ribs.<br><br> “Erica,” he says cautiously, reaching out with the slowest, smoothest motion he could muster in his best effort not to startle her. She flinches away, hunching in on herself, but making no real attempt at shaking off the fingers he’d curled loosely around her wrist. “Erica,” he tries again, reaching his other hand up to the hair covering her face. “What – are you…”<br><br> Stiles is a nurturer by nature. He liked to think it was his mother’s influence, a little bit of her leftover in him, someone to do their best to carry on her legacy of being the most unselfishly kind person he’d ever known. One look at the blonde girl’s face as he gingerly pulls her hair back, one glimpse of a bloody bottom lip, of thick mascara and eyeliner running down tearstained cheeks and melting seamlessly into her bruise-battered jaw, and nothing else mattered. Stiles didn’t care how she got to his house, what brought her here, what did this to her. That could come later.<br><br> “I didn’t…” she whispers, gritting out the words between harsh breaths. “I didn’t know…where else to go.”<br><br> “Oh my god, come here,” he exhales, using the hand on her wrist to tug Erica off the wall and towards him. She moves without protest, leaning one shoulder into his chest and dropping her forehead against his neck, curling into Stiles in a painfully sad reminder of the old Erica, the human Erica. He ushers her out of his bedroom and towards the bathroom as fast as she’s able to move, lowering her down onto the edge of the bathtub and dropping to his knees between her feet.<br><br> “I’m going to go get you some…(clean, dry, not blood soaked, <em>oh god</em>)…clothes,” he tells her quietly. He keeps his hand cupped around her arm, just above her elbow, not sure which of them, precisely, he was reassuring more with the touch. “And then we’re going to get you all cleaned up, okay?” <br><br> Erica nods, just a dip of her neck and a soft movement of her chin, enough for Stiles to accept it as acknowledgment but not enough to stop him from hurtling down the hallway like hell was nipping at his heels. There wasn’t much he could do for her, really, and he had no <em>idea</em> why she wasn’t healing on her own, but still, Stiles is reluctant to leave the injured girl alone for longer than absolutely necessary.<br><br> He doesn’t waste time, doesn’t hesitate, but does take just a quick extra second to dig for his fuzziest sweatpants, to tug out a t-shirt that the washing machine had long ago beat into silky-soft submission.<br><br> Hardly even four minutes had passed, if that, but it had apparently been enough for Erica to strip down to bra and underwear, curled protectively in on herself on the closed toilet seat in a way that Stiles knows is down to self-preservation much more than self-consciousness. He staunchly ignores the pile of ripped and bloody cloth next to the tub, crouching down next to Erica’s huddled form and running his free hand down her relatively unscathed bicep again.<br><br> The brunt of the surface damage seems to be her face and neck, knuckles and palms, and one badly shredded knee and shin. Maybe there was something to be said for those leather jackets Derek’s pack seemed to be so fond of. He couldn’t say much for the condition of Erica’s bones, internal organs, and other such vitalities, but there isn’t much he could do even if he knew what was wrong.<br><br> “I need to clean some of these,” Stiles tells Erica, and never in his life has he been more aware of his own inclination to desperately babble. He genuinely can’t tell if the werewolf is listening to a second of it, if his words are falling on deaf ears or not, but he kept his voice low and his tone calm, quietly walking her through a basic survey of her visible injuries and, once that was done, the careful application of hydrogen peroxideand antiseptic. “I don’t know why you’re not healing, but it’s okay, we’ll clean these out and you can shower if you want, we’ll wrap you up and…I don’t know, we’ll call Derek maybe, Derek’ll know –“<br><br> “No,” Erica gasps, shaking her head in the most vehement motion Stiles had seen since he’d found her. “No. Not Derek.”<br><br> And that, over everything else that has happened in the last twenty minutes, makes Stiles sits back on his heels and stare up at the trembling sixteen-year-old, fingers stilling from where he’d been gently wiping a betadine-soaked cotton ball across her split knuckles.<br><br> “Okay,” he promises soothingly, dropping the cotton ball and grabbing at Erica’s shaking fingers, wrapping them in his own and squeezing gently. “Okay, Erica it’s okay. I won’t call Derek if you don’t want me to. Okay?”<br><br> He waits until some of the desperation has faded from her battered face, until she’s once again steady enough that she can meet his eye and nod, to resume his work on her knuckles. Erica doesn’t say another word, doesn’t make a sound, even as Stiles moves up to cup her jaw softly with his left hand, right hand probing carefully over the cuts and bruises littering the blonde’s face.<br><br> He finishes in silence, for once finding absolutely nothing to say. Stiles doesn’t know <em>what</em> to say, what to do; it hasn’t even been a week since everything had gone down with the Argents and Jackson, he hasn’t even had a chance to catch his breath yet, but here he is with a healing-impaired werewolf looking steps away from death in his bathroom.<br><br> Stiles can’t say any of this though, can’t press the words out and shove them into Erica’s already rapidly building panic, so he carries on without a sound, quiet and efficient as he cleans the last of the cuts across one sharp cheekbone and drops a bloodstained wash cloth into the sink.<br><br> “Okay,” he breathes slowly, letting the air out of his lungs in stages as he scrambles for a plan. Erica shifts, straightening up just enough for Stiles to realize that her rib cage looks slightly less like it’s been crushed by a mack truck, and he is struck with the desperate need to sort out that dilemma first.<br><br> “Okay,” he says again. “Okay. I mean this in the least offensive, most caring way possible, but you seriously look like you are in need of a nice hot shower.”<br><br> She doesn’t smile, not really, but there’s the barest hint of a quirk to one corner of Erica’s lip, and that’s enough for Stiles. He pushes himself upright carefully, scooping the blonde’s filthy pile of clothing up with him and gesturing with three fingers and the dangling edge of a leather sleeve to the sweatpants and shirt he left on the bathroom sink.<br><br> “I promise those are clean clothes, and there are extra towels under the sink. There’s…I mean, it’s been at least seven years since the last time a girl used this shower, so I apologize in advance for however lacking it might be…”<br><br> Erica shakes her head just slightly, but that little quirk is there again, the little upward tilt of her mouth that <em>isn’t</em> the completely dead, wrecked expression she’s been wearing thus far, so it’s another success for Stiles. He nods decisively before he can start rambling again, elbowing the bathroom door shut behind him and waiting for the telltale sound of water against the ceramic tub before shuffling off to his room.<br><br> He meant to put her clothing in the wash, he really did, but the injuries are nagging at him, needling their way into every train of thought he tries to jump to until he has no choice but to face it. There’s <em>something</em>, he knows it, something significant about the fact that Erica sustained substantial injuries that aren’t healing the way they should, he just can’t think of what. He’s so tempted to text Derek, but he can’t think of a lie to explain why he’d want to know, not one that won’t result in Derek showing up in Stiles’ room in a huffy rage of Alpha, and he can’t do that to Erica.<br><br> He calls Scott. Not that he’s expecting much; Stiles is pretty sure <em>he</em> knows more about being a werewolf than Scott actually does, but sometimes, on rare occasions, Scott picks up on a thing or two. Besides, even if he doesn’t, maybe Stiles can convince Scott to call Deaton at…2:00 am.<br><br> Scott, of course, doesn’t answer. Not one of the three phone calls, two texts, fourth phone call, or the voicemail Stiles leaves him. Whatever, Google it is.<br><br> Twenty minutes later, for all it felt like ten seconds, Erica is shuffling her weight from foot to foot in Stiles’ doorway, and the sight of it breaks his damn heart. His clothes, small as they are, still hang on her slight frame, and with her face clean and her blonde hair pulled back, it’s the closest she’s looked to the old Erica in a long time. She looks fragile and broken, the illusion of her newfound invincibility clearly shattered straight through, and Stiles firmly shoves any hesitation he might have felt into the deepest corner of not giving a fuck.<br><br> He pushes himself away from his desk, preliminary (and useless) research into werewolf healing properties forgotten as he drops down onto his bed, patting the empty space next to him in the least presumptuous manner he can. Erica moves with the stilted, cautious gait of someone favoring more than one aching bone, but she does look just a touch better than she did before her shower. She <em>is</em> healing, faster than a human would, but not as fast as <em>she</em> normally would.<br><br> Her movement is careful, but there’s no uncertainty in the way she slowly lowers herself down onto the mattress and immediately curls into Stiles’ side, pressing her face into his shoulder and her knees into his ribs, tucking her feet under his back. Stiles worms an arm under her back, wraps the other over her shoulders, and doesn’t let go as she slowly, unrestrainedly, starts to sob.</p>\n<p><br> To say they wake up would imply that either of them slept. Stiles thinks Erica might’ve dozed off a bit, and maybe there are a couple blank patches in his overall consciousness, but for the most part he’s aware of the gradual arrival of the morning in stages, the slow fade from midnight blue to stormy gray, from pre-dawn light to actual, proper sunlight. Erica’s shoulders stopped shaking around 4:00, the damp spot her tears left on Stiles’ shirt dried up a little after 5:00. He had, at some point during one of his less lucid periods, started absently stroking her hair, and she tracing the lines of his stomach over his shirt. For something that was easily the most intimate thing Stiles had ever done in his life, with someone who was practically, really, a stranger, it was surprisingly, comfortably, platonic. <br><br> Stiles is reluctant to break the silence, to disturb the dreamy hush of early morning still hovering in the air, but he’s running out of time before he actually has no choice, and some things are important.<br><br> “I need to start getting ready for school,” he says quietly, tucking a loose blonde curl behind Erica’s ear. “Unless you want me to stay.”<br><br> Erica shakes her head, nose nudging against the side of his ribs with each back and forth slide.<br><br> “No,” she reiterates quietly, her voice hoarse with disuse and rough with the remnants of her earlier tears. “You miss enough already because of us.”<br><br> He starts to protest, because <em>really</em>, but Erica cuts him off, soft, but no less assertive than usual.<br><br> “Besides,” she whispers, and there’s a wonderful hint of <em>something</em>, something that says maybe she’s not entirely emotionally destroyed, in her tone. “You can front all you want, I know you actually like school.”<br><br> Stiles doesn’t know how to protest that. Normally he’d be all over it, lying his ass off up down left and right to cover it up, but it feels…cheap. Like lying to Erica, after last night, would take away something of the sincerity he was trying so hard to present to her, even if it was over something as silly as school.<br><br> “Okay,” he nods, chin bumping against the crown of her head. “My dad worked the midnight shift last night, but he’s been pulling a lot of doubles since he got back into the office, so you should be okay until I get home.”<br><br> “I can leave…” Erica trails off half-heartedly, voice small and uncertain, and Stiles’ heart breaks for the millionth time that night.<br><br> “No,” he says firmly. “No you can’t. In fact, if I get home and you’re anywhere but here I will go on a town-wide manhunt until I find you and drag your sorry ass back home, got it?”<br><br> Erica nods, curling her fingers into the loose t-shirt fabric over Stiles’ stomach. Normally he’d keep a wary eye out for claws, but Erica has been nothing but shockingly human since she’d appeared; scaling the wall outside his window seems to be the last werewolf maneuver she’d managed.<br><br> “Good. Now, Derek,” Stiles begins, and it’s almost painful how Erica tenses up, shoulders stiff, spine rigid under Stiles hand. “Hey,” he says quietly, shifting gears. “I promised I wouldn’t talk to him. I’m just warning you, he has a tendency to show up here when I absolutely expect it the least. In fact, I think he does that bit on purpose. He hasn’t…I haven’t heard from him since…well, you shouldn’t have to worry about it. But just keep it in your mind as something that’s not far beyond the realm of possibility, yeah?”<br><br> Erica nods again, and Stiles squeezes her tighter, once, just for a second, before loosening his grip enough that she gets the hint, shifting her weight to allow him to pull his tingling limbs out from the blankets they’d tangled themselves up in. She immediately turns into the pillow he’d been leaning back against, tugging it down to her torso and wrapping her arms around it like a makeshift Stiles. There’s a shockingly overwhelming fondness rising up in the pit of Stiles’ stomach, something brotherly and affectionate and again with the weirdly-intimate-for-near-strangers, but it’s enough for him to lean over, smoothing her hair back out of her face and dropping a kiss to her brow before carefully closing the bedroom door behind him.</p>\n<p><br><br> Stiles barely plants one foot inside the main hall of the high school when he finds himself yanked forward and thrown flat against the nearest bed of lockers, metal handles digging into his lower back while a heavy forearm preses firmly across his trachea.<br><br> “What did you do to her?” Isaac snarls, crowding Stiles further back against the lockers and leaning unsettlingly close to the soft skin of the human’s neck.<br><br> “D-dude-” Stiles wheezes, choking the words out from under the werewolf’s vice-like hold across his throat.  He’d failed to think this all the way through, forgot about those freaking werewolves and their stupid noses, and Stiles is absolutely certain that he <em>reeks</em> of Erica.<br><br> Isaac begrudgingly lifts the pressure on the other boy’s throat, just enough that Stiles coughs in his face a few times before making a more successful attempt at speaking.<br><br> “She’s fine,” he says quickly, going against everything Derek told them and staring the werewolf dead in the eyes, meeting Isaac’s gaze unflinchingly. “Erica…I don’t really know what happened. She’s hurt, and she’s not healing right. But she’s going to be okay, Isaac, she is. And she’s safe.”<br><br> “<em>Where</em>?” Isaac whines, and Stiles is shocked at the sheer desperation in the single word. He’s never thought of Derek’s pack as being <em>close</em>, together out of necessity more than an actual bond, but Isaac is pinning him with such a distressed look, such wretched concern on his face, that Stiles is forced to reevaluate.<br><br> “My house,” he said quietly. “But, Isaac…”<br><br> Isaac moves faster than Stiles could ever have guessed, out the door and halfway to the sidewalk before Stiles even reaches the second syllable of his name. Stiles isn’t sure he’d have been able to catch Isaac even if he had werewolf speed on his side, no doubt in his mind that Isaac would be at the Stilinski’s house before he’d even made it to his first period class.<br><br><em>p. sure isaacs bout 2 brk in</em><br><br> He texts Erica, hoping desperately that it won’t make things worse, that she won’t react to Isaac the same way she had to the mention of Derek. From what Stiles understood about packs, and from the lost desperation on Isaac’s face before he left, Stiles can’t imagine Isaac’s presence being anything but <em>good </em>for Erica, but still. He feels oddly, overwhelming protective, and can’t help but hover over his phone for the entire walk to class, waiting for a response.<br><br><em>its ok.</em><br><br> He gets finally, seconds before the first period bell was due to ring.<br><br><em>needed him. ty. </em><br><br> Satisfied that that was the best he was going to get, at least until he got back home and could evaluate the situation for himself, Stiles shoves his phone back into his pocket and settles in for what is undoubtedly going to be the longest school day of his entire year.</p>\n<p><br><br> As promised, it’s approximately the longest day of Stiles’ existence, and he’s had some truly, <em>painfully </em>snail-paced days in his time.<br><br> Scott tries to talk to him once or twice, he thinks. Makes something of a half-hearted explanation for missing Stiles’ admittedly excessive attempts at contacting him last night (though still doesn’t express enough interest in the issue to ask <em>why</em> Stiles wants to know). Stiles responds in the easiest way he knows how these days; devoting less than a quarter of his attention to filtering through the long-winded musings about Life After Allison while idly weighing how long it’s going to take Scott to notice what Isaac had realized in under a minute.<br><br> (The entire day goes by without so much as a puzzled sniff – Stiles would have lost any bets he placed, and therefore vows never to mention it out loud.)<br><br> He makes a flimsy excuse to not hang out with Scott after classes, practically running to his car the second the last bell rings. Stiles takes the stairs two at a time when he gets home, not even bothering to hide his anxiety. He <em>hates</em> leaving people alone when they’re sick, when they’re hurting. He’s always hated the thought of someone suffering in silence, of suffering alone and immobile and without anything to provide any kind of distraction from the inevitable and overwhelming cascade of thought. He lets out a breath he didn’t know he was holding, a sigh of relief he hadn’t realized he needed, when he throws open his bedroom door to find Isaac huddled next to Erica, wrapped in an undoubtedly protective position around her sleeping form.<br><br> Protective, Stiles realizes, but not defensive. Isaac must have known it was him, recognized his scent or his heartbeat or his footsteps or whatever the hell it was with their damn spidey-senses, because he doesn’t even blink at Stiles’ sudden appearance in the room, just frowns petulantly and made a frantic shushing motion with his free hand.<br><br> It winds up being a wasted effort. Erica cracks both eyes open seconds after Stiles quietly closes the door behind him, and the soft upward curl of one corner of her lip sends another wave of fondness through Stiles. She almost seems to be just as relieved that Stiles is back, lifting one hand off Isaac’s hip to beckon Stiles towards the bed, both werewolves shifting over to make room for him to slip into the space on Erica’s other side.<br><br> “How are you feeling?” he asks quietly, wedging one shoulder under Erica’s until she’s propped up between the two boys, Isaac’s elbow against Stiles’ collarbone, Erica leaning back in the space between them. She hooks one ankle over Stiles’ leg, tucking her bare foot under his calf, and he drops a hand down to curl over her hip without even stopping to think about it.<br><br> “Better,” she shrugs, “a bit.”<br><br> Stiles nods. He doesn’t want to push her, he really doesn’t, but he’d spent the entire day distracting himself by coming up with a long list of questions and concerns and things that he really has the burning need to start researching <em>immediately</em>, and the most pressing of which, he’s quickly starting to prioritize, was why the fuck he’s so shamelessly comfortable with two werewolves he wasn’t even friends with all up in his bed <em>cuddling</em> with him.<br><br> “So. Not that this isn’t nice,” he starts bluntly, gesturing to the general <em>this</em> covering his mattress. “And not that I’d ever complain about having two frankly gorgeous people in my bed on a normal basis, but, like…”<br><br> “It’s a wolf thing,” Isaac says carefully. He’s watching Erica, like he’s not quite sure what he is and is not allowed to reveal to Stiles, but she doesn’t seem even remotely perturbed by the question.<br><br> “I told you,” she takes over when Isaac starts to look like he isn’t going to elaborate any time soon. “I didn’t know where else to go. I couldn’t go back to Derek, not when I was that weak, not after defecting like that. And Isaac…”<br><br> “I live with Derek,” the other teen supplies, shrugging his free shoulder. Stiles frowns at that, because last time he checked Derek split his time between a burnt out shell of a house and a dilapidated train depot, both of which are definitely unsuitable life choices for one person, let alone two.<br><br> “Right,” Erica nods. “And I can’t…I can’t go home right now.”<br><br> “Don’t tell me you were living with Derek too.” Stiles frowns harder. That absolutely is just not acceptable; he’s overwhelmingly not okay with that.<br><br> The blonde drums her fingers against Stiles’ thigh lightly, nails against the rough grain of his jeans. “Sometimes,” she admits. “I stayed with Boyd, sometimes, since his dad hadn’t really, I mean…”<br><br> “Wait - where is Boyd?” The second the words are out of Stiles’ mouth, he knows. He knows without even needing to see the look on Isaac’s face, hearing the slow, ragged intake of breath from Erica.<br><br> “Boyd…Boyd is…”<br><br> “Never mind,” Stiles says quickly, squeezing Erica’s sharply protruding hipbone lightly. “Later. One thing at a time.”<br><br> The blonde inhales a long, shaky breath before nodding, setting her shoulders a little more firmly against the two boys’ before taking another, shorter breath.<br><br> “I didn’t know where to go,” she repeats, “so I just kind of…I let the wolf instinct in a little more than normal. To see if it could sniff out somewhere safe, somewhere to hide. And, well, I wound up here.”<br><br> “Why?” Stiles asks, entirely out of curiosity over protest. It’s…frankly, it’s oddly flattering, and leaves a warm sort of something settling in his ribcage. Stiles can’t remember the last time he felt like someone actually needed him, like he had something to offer that no one else could give. It wasn’t like Derek, begrudgingly accepting Stiles’ help when he had no other options, or his dad, humoring Stiles’ compulsive efforts to try and keep him healthy and safe.<br><br> “You look out for us,” Erica admits. “You do it without even thinking about it. Even though you’re just…you’re not…like that day in the library. Scott was so busy worrying about his stupid girlfriend, but you stayed with me. <em>You</em> made sure I got to Derek, <em>you</em> took care of me.”<br><br> “It’s a wolf thing,” Isaac says again. “You earned the respect of the wolves by acting like part of the pack, and even more so by doing it as a human.”<br><br> “Well that’s,” <em>strangely sweet</em>, “actually kind of awesome, which makes sense because I am awesome, but it still doesn’t explain why <em>I’m</em> okay with this,” he gestures again to Erica’s leg thrown over his own, nudging his head backward into the arm Isaac had snuck around his neck, “snuggly little puppy pile. I didn’t even realize it was weird until I started thinking about it.”<br><br> “Instinct,” Erica shrugs.<br><br> “You’re not a wolf,” Isaac agrees, cutting Stiles off before he manages to point out the obvious, “but you’re a human that runs with a wolf pack. It rubs off on you, whether you realize it or not.”<br><br> “You may not be a werewolf,” Erica teases, the most light-hearted tone Stiles’s heard from her yet, “but we’ve rubbed off on you a little bit.”<br><br> And weirdly enough, Stiles thinks that’s actually really cool. Wolf instincts. Word. Besides, he’d only been slightly kidding earlier – you don’t get much hotter than Erica Reyes and Isaac Lahey, and Stiles really, <em>really </em>is not going to complain about having either one of them all up in his cuddle grill.</p>\n<p><br> They spend the rest of the afternoon answering Stiles’ multitude of questions to the best of their abilities. Isaac, once he’d gotten over his initial power-rage hard-on after the turn, had spent the better part of the last two weeks grilling Dr. Deaton for as much information as the good veterinarian was willing to share. Stiles has to admit, he’s impressed by the tenacity – and deeply regretful of the fact that he hadn’t taken the time to think of it first. He’s also, quietly, to himself, pleasantly surprised by how <em>effortless</em> it is. Some collective, unacknowledged decision has been made, or maybe they’ve all just had their worlds knocked so far off axis that everyone’s just defaulting to tabula rasa, but whatever animosity, whatever antagonistic drive previously existed between them is just <em>gone</em>. Isaac is painfully easy to like when he’s not acting like a raging rage monster, and Erica – Stiles is genuinely disappointed in himself for not realizing sooner how incredibly awesome Erica is, how great she could have been for him.<br><br> Once everyone’s warm and loose and comfortable, Stiles and Isaac convince Erica to tell them what happened. It’s stilted and painful, painstakingly pulling shrapnel from a ravaged wound, but they eventually gather enough information to draw a decent picture. Erica and Boyd, having escaped from Gerard and abandoned (and <em>oh</em> how Erica flinches over the word, remorse dripping from every syllable) the pack, barely made it to the edge of the woods before meeting another pack of wolves. An <em>alpha pack</em>, specifically, who’d taken one good look at the pathetic, month old betas in their trap and promptly gone to town on them. Erica managed to escape them only because Boyd, good, fiercely protective Boyd, had thrown himself head-first into the pack, distracting them long enough for her to get away. She has no idea how she made it as far as Stiles’ house, or where in the woods she’d started from, but at the very least it explained why her injuries weren’t healing the way they normally would.<br><br> “I hate to be the bearer of bad tidings,” Stiles sighs, scrubbing one hand over his hair before dragging his palm slowly down his face, “but someone needs to tell Derek.”<br><br> Erica and Isaac both shift uncomfortably, neither one even pretending to look anywhere near Stiles’ face. He knows what’s coming, knew before he opened his mouth, really.<br><br> “Yeah,” Isaac agrees. “But we were kind of hoping it’d be you.”<br><br> “How’d I know?” the brunet grumbles back. “I get why not Erica, but what about you?”<br><br> “He’s mad at me,” the other boy says glumly, picking at a loose thread fraying off the hem of Erica’s shirt. “He thinks I stayed for Scott and not for him, and that I’m trying to break away from his pack and be a part of Scott’s instead.”<br><br> Stiles rolls his eyes. Personally, he thinks the last thing any of them needs is Scott as the Alpha of his own pack. Good lord, he loves the kid like his own brother, but Scott as an Alpha?<br><br> “Are you?” he asks warily.<br><br> “I – no,” Isaac says unconvincingly. “I don’t want to be in Scott’s pack. I want Scott to be in ours.”<br><br> Stiles frowns again, nodding in response to the werewolf’s unspoken question.<br><br> “Fine,” he nods, just once more for good measure. “I’ll tell Derek. I’ll go now, actually, cause he really needs to know what’s going on. But when I get back, you two have to do me a favor.”<br><br> Erica is nodding before he’s even done, before he’s even finished asking, and the unquestioning loyalty again struck Stiles in a weird place, somewhere deep in his ribs and suspiciously close to his heart.<br><br> “When I get back,” Stiles sighs, extricating himself from the tangle of limbs on the bed and stretching slowly to his feet. “You guys have to help me come up with a decent cover story to explain to my dad why you’ve apparently moved in for the week.”</p>\n<p><br> The train depot – and even in his <em>head</em> Stiles can’t muster up the proper level of disdain to express how vehemently opposed he is to this shit – is looking particularly worse for the wear when Stiles shoves his way through the back door. Honestly, it looks like a grenade just let loose in here, and for one, semi-panicky second Stiles actually considers the possibility (because really, this is his life and therefore it is a <em>thing</em> that actually <em>could </em>happen) that it actually did.<br><br> “Derek?” he calls, not bothering to raise his voice higher than standard indoor volume. There’s no response, not so much as the creak of rusted metal or the shuffle of rubber soles against concrete, but Stiles knows, <em>instinctively </em>(because HA, werewolf instincts), that Derek is here.<br><br> “Derek, come on,” he tries again, picking his way over the debris littering the floor, making his way towards the crumbling remains of the rail car he knew Derek had claimed as his own. “I’m not leaving without searching this entire place top to bottom, which will realistically take me longer than this conversation will, so the sooner you acknowledge me the sooner you can get rid of me.”<br><br> The responding sharp crash of glass shattering against metal is near immediate. The brunet barely flinches at it, heaving the long-suffering sigh of one entirely too used to overly dramatic diva werewolves and climbing the rest of the way towards the train car.<br><br> Derek is slouched on the floor between two rows of seats, wedged into the miniscule leg space with one arm resting heavily on the half-torn-away bench and his booted feet in the ruined aisle. He doesn’t even bother looking at Stiles, just helps himself to a hearty swig of the nearly-empty bottle of Jack Daniels dangling from his fingertips. Stiles squints along the floor, considering the crash, and sure enough he can see the remains of what looked suspiciously like a second bottle shattered by his feet, and holy shit, if Stiles didn’t know better he’d say there’s actually a distinct possibility that Derek Hale is <em>drunk</em>.<br><br> “Get out.”<br><br> Stiles thought he knew Derek’s deadpan droll. Thought he knew how the Alpha could flatten his tone to nearly nothing, monotonous disinterest oozing through every word out of that whip-sharp mouth. Past experience has <em>nothing </em>on this, on the utter emptiness in Derek’s voice, words spoken entirely without affect.<br><br> “Dude,” he breathes, crossing the space between them until there’s just single seat back separating him from the older man. “You look <em>wrecked</em>.”<br><br> “Fuck off and die,” the werewolf responds succinctly.<br><br> Any other day Stiles would have been impressed by his unflinching delivery, really, but this is just…this is <em>sad</em>. Pathetic sad, clearly, but also just downright <em>sad</em>. Stiles almost wants to get right up into Derek’s personal space, to wrap himself around the Alpha, crowd up into him until he could <em>feel</em> the tension melting away. He wonders, not for the first time, how long it’s been since Derek just let somebody <em>hold him</em>.<br><br> “Derek,” he tuts, sidling around the last bench of seats until he’s standing in the space between Derek’s slightly spread calves. “Seriously, I’ve seen better-looking corpses –”<br><br> For the second time today Stiles finds himself slamming backwards into painfully harsh metal without seeing it coming (and really, he should have), hard and heavy muscle held taut against him, pinning him flat like a frog on a dissection tray. Derek breathes harsh, damp heat against Stiles’ face, weighed down with the stench of whiskey and whatever else had died in the other man’s mouth recently, both hands fisted in the loose fabric of Stiles’ t-shirt.<br><br> “What part of get out,” he snarls, face so close Stiles can feel the push and pull of each word in the air, “did you not fucking understand, Stiles?”<br><br> Stiles, in a move that truly, honestly shocks even himself in that moment, keeps his mouth shut. He’s never had much patience for rhetorical questions, generally took great pleasure in pissing people off by offering answers he knew they weren’t really looking for, but apparently self-preservation is kicking in strong today. He keeps his lips carefully, pointedly sealed, tilting his chin down and slightly to the side, lowering his gaze to study the seats behind Derek’s right elbow.<br><br> Nobody moves for several long, incredibly drawn out breaths. Stiles waits in quiet supplication, studiously keeping his eyes lowered and his neck subtly bared, focusing his otherwise racing thoughts on the task of slowing his heart rate back down to a reasonably steady beat, his breathing to something less intense than a hundred meter sprinter’s. On the fifth slow, deliberate inhale, Derek loosens his grip just a bit.<br><br> Stiles waits until the tenth exhale, each breath relaxing the werewolf’s hold on him just a little more, before he’s willing to raise his eyes back up to meet Derek’s. He finds, rather than the angry red glare he’d been expecting, the top of Derek’s (shocking disheveled) head. The Alpha’s forehead is pressed against the hand still clutching Stiles’ collar, the other hand sliding up to curl around the younger teen’s neck.<br><br> “Derek,” Stiles mutters. He moves without thinking about it, reaching one hand forward to grip the werewolf’s hip, mirroring the hold on his neck.<br><br> “You smell like them,” Derek mumbles. He’s flattened his hand against Stiles’ chest, bringing his face even closer to the fabric Stiles was now positive stank of Derek’s pack. “Isaac, Erica.”<br><br> “That,” Stiles supplies helpfully, “may be in some way related to the cuddle orgy that has been taking place on my bed since last night.”<br><br> Derek whimpers. <em>Whimpers</em>, like Stiles has actually just inflicted some kind of physical pain on him, and the brunet absolutely <em>does not get it</em>. He’s missed something massive, clearly, somewhere between waking up in the Argent’s basement and Erica climbing in his window last night, and he’s starting to think he’s actually going to have to figure out what it is before he makes any progress here.<br><br> “They’re okay,” Stiles tells him, politely ignoring the way Derek is now shamelessly inhaling the scent off his clothing. “Erica and Isaac. They’re safe.”<br><br> “Boyd?”<br><br> Stiles exhales slowly, dragging it out as long as possible. “Boyd’s…Boyd’s dead, Derek.”<br><br> He didn’t realized to how much of Derek’s weight had been resting on his chest until the werewolf starts dropping heavily to the ground, legs seemingly giving out beneath him. Stiles makes a desperate attempt at catching him, hands coming up to grab under Derek’s arms, but he does little more than slow their fall, the pair of them collapsing in a heap on the filthy train floor.<br><br> Derek’s forehead dislodges itself from Stiles’ chest, landing somewhere in the crook between his neck and collarbone, pressed against the tips of the fingers still wrapped around the younger teen’s neck. Stiles fists his hands in the shirt over Derek’s ribs, pulling the werewolf closer without bothering to consider the potentially fatal ramifications. Derek, for the first time Stiles can remember, doesn’t protest the touch, just kept breathing staccato, desperate breaths into the hollow of Stiles’ throat.<br><br> “Oh fuck,” Stiles exhales, shifting his weight to settle more comfortably on the floor, bending one knee against Derek’s back to help support them both. He gives in to the impulse – pack instinct or basic human conscience, he doesn’t know or care – and shifts his grip on Derek’s shirt until Stiles can manhandle him between the v of his thighs, back flush against Stiles’ chest, one of Stiles’ arms firm across his chest and one wrapped around his stomach.<br><br> Derek doesn’t struggle, doesn’t protest, sinks into the embrace (for all its aggression there’s really no other word for it) with nothing more than a shudder. This, more than anything, slaps Stiles flat across the face as a giant red flag of Wrong Very Wrong, because Derek is never <em>compliant</em>, compliant and Derek shouldn’t even co-exist in the same <em>room</em>, let alone the same sentence. There are werewolves in his bed and they were drawn there on some pro-Stiles <em>instinct </em>and Derek is falling apart and also possibly drunk and is nothing <em>sacred </em>in this world anymore?<br><br> Stiles makes up for it the best way he can – he talks. And talks. And talks.<br><br> “They were attacked by an alpha pack,” he whispers, angling his head closer to the older man’s ear and shifting his grip a little higher up on Derek’s shoulder. “Boyd fought back so Erica could escape. She came to my house for some wolf-y instinct reason I’m still not clear on. I’m not gonna lie, she got the shit beat out of her by those Alphas, and of course it’s all healing at a lot closer to human-speed than you all normally do, but she’s okay. She’s okay, and Isaac’s with her too, and they miss you. They’re scared to come home, come here, but they want to. Which, of course, makes me question their better judgment because <em>seriously</em>, Derek, this place is just a catastrophe waiting to happen, can’t we just find you a nice apartment somewhere, clean out someone’s basement, maybe even at least just buy you a <em>mattress</em>, I mean <em>really, </em>and speaking of living things are we ever going to talk about Mr. Back From the Dead and whether or not he’s secretly planning to kill us all and overthrow you as alpha or – ”<br><br> “He left.”<br><br> The words are so quiet, muffled as they are in the sleeve of Stiles’ hoody, that he wouldn’t even have noticed them if he hadn’t felt the motion of Derek’s jaw against his arm.<br><br> “Are we adding this to the column of good things or bad things that have happened this week?”<br><br> Derek shifts his head slightly, lifting his chin so the entire lower half of his face isn’t burrowed in Stiles’ sleeve anymore, and Stiles can feel the dirt and grime from Derek’s hair against his cheekbone.<br><br> “He said he was going to find some local packs we used to be on good terms with. See if he could find out anything about the alpha pack…”<br><br> “But…” Stiles prods.<br><br> Derek is quiet for a long minute, and in a rare display of impulse control Stiles lets the silence sit. He thinks maybe it’s because he’s so far out of his element, so completely at a loss as to how he wound up here, curled up against the wall of an out-of-use train car with <em>Derek fucking Hale</em> practically in his lap, that even his fallback of babbling endlessly has completely packed its bags and abandoned him.<br><br> “I was never supposed to be Alpha,” Derek admits, so soft it’s barely loud enough for Stiles to hear it. “My mom was Alpha, and would have been for a long time under better circumstances. Even if she wasn’t, I had an older brother. And Laura. And two or three cousins probably better suited to it than I ever would have been. He killed my sister. He killed Laura, and he killed too many other people, and he turned the single most infuriating kid on the planet into the single most infuriating <em>werewolf</em> on the planet, and he made general chaos out of what was already a pretty miserable existence.”<br><br> “But…” Stiles, he figures, can fill in the blank himself this time. “He’s the only family you have left.”<br><br> Derek lets his silence confirm what Stiles already knew.<br><br> It sits longer this time, hanging heavily in the air between them, around them. Long enough for Stiles mind to wander, again, in the direction of <em>what the unholy fuck is he </em>doing<em> here</em>. This is definitely above and beyond whatever instincts Erica and Isaac seem to think he has. This is <em>Derek</em>. He’s borderline cuddling <em>Derek Hale</em>, best known for his fondness for shoving Stiles bodily into as many immovable objects as he can, with a fuse shorter than a dog collar and a serious need for a muzzle. Never mind how often Stiles may have thought all Derek needs is a nice hug, or the very rare occasions he’s actually been tempted to offer one…this is legitimately insane, no matter how fucked up they both are.<br><br> “Are you drunk?” he finally asks, mostly to distract himself and maybe hoping that Derek will react violently to the blatant disregard for his apparent meltdown, because at least then there would be some semblance of <em>normalcy</em>.<br><br> Typically, because it’s exactly what he doesn’t want, Stiles gets a <em>smirk</em> in response.<br><br> “Half an hour before you got here,” Derek mumbles, waving one hand carelessly towards the mostly-empty bottle of whiskey left abandoned on the other side of the train car, “there were two of those. Full.”<br><br> “Ah.” Because really, what do you even say to that? Apparently werewolves can get drunk, they just have to soak their liver eight ways to alcoholism first? “Okay, up.”<br><br> He loosens his grip on Derek’s shoulder, lowers the leg still bracing the right side of Derek’s body. The older man moves slowly, almost reluctantly, leaning forward to break Stiles’ hold and give him enough room to move, but not bothering to stand up himself. He leans back into the space Stiles leaves behind almost as soon as the teen’s out of the way, slumping against the train wall.<br><br> “Right,” Stiles nods, falling back on a business-like efficiency he didn’t know he possessed. “This alpha pack, any immediate threat from them? Immediate like within the next week?”<br><br> Derek shrugs, but Stiles knows by now that if there was a real threat, if there was a real need for urgency, they wouldn’t even be here right now. He’s not overly concerned, not entirely, but it’s worth checking anyway.<br><br> “Good,” he nods again, “good. So listen…” he trails off, because Derek is still not really looking at him, and this is actually semi-important.<br><br> “Derek Hale,” he hisses, crouching down low to get in Derek’s face, and it’s actually amazing the way Derek’s hazel eyes snap up towards him, “for once in your goddamn life will you <em>fucking listen to me</em>. Thank you. Jesus.” Stiles glares, channeling as much of the angerfrustrationdislike that he usually feels from Derek’s own bone-chilling hate-stares, until he’s certain he’s got the werewolf’s attention.<br><br> “Now,” he says slowly, “here’s what we’re going to do. You have a week, Derek. One week. Take a break, go find the Jack Daniels distillery and drink your way through it, kill some deer, get another tattoo. Whatever. Fucked if I care. Clear your head, figure your shit out. I’m giving you a week, man, to pull yourself together.”<br><br> Derek opens his mouth, and whether it’s to argue or to agree Stiles doesn’t particularly care.<br><br> “No!” he snaps, pointing one finger accusingly at the interruption. “Nope. This is not a friendly suggestion, and it’s not open for discussion. Get your shit together, find someplace to house your pack – <em>yes your pack, don’t give me that look </em>– someplace that isn’t this absolute shithole. Make peace with the fact that you’re the Alpha now, whether you want it or not, because we need you, and we need you not to be an absolute asshole about it. Is that clear?”<br><br> Derek stares at him. <em>Stares</em>, like he’s never quite seen anything like Stiles before, and Stiles can’t really blame him. He lowers his hand back down to his side but pointedly refuses to look away, narrowing his eyes just enough to reiterate that he means <em>business</em>.<br><br> “Yeah. Yes.” Derek nods, confirming in triplicate.<br><br> “Great,” Stiles straightens up, wipes his sweaty palms on his jeans like he’s just brushing off the filth, and storms out of the train depot without another word.<br><br> He waits until he’s a solid two miles away to slam on the brakes, pull the Jeep over, and shake his way through the biggest <em>holy shit</em> of a panic attack he’s suffered in a long, long time.</p>\n<p><br> Stiles drives Isaac to school in the morning, and it’s an oddly pleasant feeling, sharing that drowsy, half-awake asscrack-of-dawn stumble with someone else. Isaac makes him coffee and Stiles doesn’t burn their toast, and it’s just that little bit easier to shuffle off towards first period when you’re solid in the camaraderie of shared suffering. Stiles mulls this over as he nurses what’s left of his second, to-go cup of coffee he’d insisted they stop for, and the distraction leads him to promptly walk head-first into Scott.<br><br> “You smell like Isaac,” Scott says suspiciously, glaring at the lukewarm coffee like it’s had anything to say in that matter.<br><br> Stiles rolls his eyes, because honestly, Scott, really?<br><br> “That would make sense,” he agrees, “since I drove him to school this morning. And he slept at my house last night. And also this might possibly be his shirt, I got dressed in the dark this morning.” He stops himself at the last second so he doesn’t add ‘because I didn’t want to wake Erica up by turning the lights on.’ Scott’s head looks reasonably blown enough as is; one thing at a time, really.<br><br> “You – I –” Scott frowns expressively – really, his whole <em>face</em> frowns, possibly his entire body – and Stiles feels a stab of guilt. It’s not like Scott’s been smooth sailing lately either, Stiles can forgive the occasional bit of distraction. Plus, he hasn’t spent an overabundant amount of time with Erica; he might not recognize her scent as easily as he would Stiles’ or Isaac’s, or even Derek’s.<br><br> The bell rings, interrupting any effort Stiles would have made at explaining, and this time they’re both glaring at relatively blameless inanimate objects.<br><br> “Okay,” Stiles says quickly, because he really, really cannot afford to be late and neither can Scott. “I have approximately a million things of supreme importance to tell you as soon as possible. After school pow-wow? Say yes.”<br><br> “Yeah,” Scott nods, clapping Stiles’ shoulder in further affirmation. “See you at lunch.”<br><br> The morning passes at a leisurely pace, and Stiles spends an entire period pondering what, precisely, it says about his current life that <em>school</em> is his pleasant, relaxing downtime between the overwhelming chaos of the outside world. <em>Relaxing</em>. School is<em> relaxing</em>. He has a lurking suspicion that werewolves are to blame for this. All of them. As an entire, all-encompassing species.<br><br> Lunch rolls around and Scott is already waiting for him at their usual table. It takes approximately eight seconds and one look at Scott’s expression for Stiles to realize what’s coming.<br><br> “So listen,” Scott says quickly, cutting Stiles off before he can even open his mouth. “I know I said I’d meet up with you after school, but I was just talking to Allison, and she and I are like, trying to do the whole friends thing, you know? Because, I mean, she could really use some friends right now, and friends is better than nothing, isn’t it? So she suggested maybe we could hang out today, said she’d help me study for that Chem test on Thursday so maybe I don’t completely blow my entire grade and can we maybe reschedule?”<br><br> He says it all in several long, gasping exhales of breath, like he knows the second he gives Stiles an in, Stiles will run a mile away with it. It’s a testament to how well he knows Stiles, really, because Stiles is just <em>waiting</em> for an opportunity to rip Scott’s small intestines out through his mouth. Or possibly punch him in the face. He’ll settle for a nice long ranting scream, really.<br><br> “Seriously? Friends? That is a disaster waiting to happen and you know it, Scotty.”<br><br> Isaac drops down into the empty chair on Stiles’ right, flashing an easy grin at Scott that lessens the offense. Scott looks confused, frowning at the way Stiles doesn’t react to Isaac’s surprise appearance.<br><br> “But you’re right about one thing,” Isaac continues, reaching forward to sneak a fry off Scott’s tray, “that Chem grade of yours is so way far down the drain it hurts. How about English, how are you there?”<br><br> “You’d think,” Scott sighs, rolling with the unexpected in an unusually non-Scott-like manner, “considering I’ve been speaking it my entire life, I might actually be passing it. I think I might be doing better in Spanish than I am in English.”<br><br> “Well,” Isaac grins again, offering up a pretzel in exchange for the french fry he’d pilfered, “that’s why you’ve got me around. How are you doing on that Mockingbird essay? Have you had your one-on-one with Williams yet?”<br><br> The horrorstruck expression on Scott’s face tells Stiles that, a. he completely forgot about said meeting and, b. it was some time today.<br><br> “Shit shit shit,” Scott hisses, shoving his tray over in Isaac’s direction, grabbing half a chicken strip for himself as he jumped up out of his chair. “I was supposed to be in the library five minutes ago. Shit.”<br><br> He’s gone before either Stiles or Isaac can stop him. <em><br><br></em>“Has he always been like that,” Isaac comments offhand, waving another one of Scott’s fries at his rapidly retreating form, “or is this a recent, wolf-and-Allison-inspired decent into insanity?”<br><br> “Isaac,” Stiles sighs, helping himself to one of Scott’s abandoned chicken fingers, “there was a solid two weeks in eighth grade that I read the entire DSM-IV in hopes of finding some kind of psychological disorder to properly explain that which is Scott McCall.”<br><br> Isaac’s response is interrupted by yet another arrival – and this one, unlike Isaac, deserves a sharp double-take and slight gaping from Stiles, because Jackson fucking Whittemore has just settled himself into Scott’s recently vacated seat. He doesn’t come bearing food, doesn’t even put his backpack down; he looks like a man on a mission.<br><br> And suddenly it all comes roaring back, and Stiles valiantly resists the urge to slam his head repeatedly against the cheap tabletop. How, <em>how</em> had he forgotten, how had they <em>all </em>forgotten, judging by the look on Isaac’s face, about Jackson? Holy shit, there’s a brand spanking new werewolf sitting in front of them like he’s not quite sure he’s allowed to be here, and it’s such a bizarre change from the Jackson Stiles is so used to that he doesn’t know how to recover.<br><br> “So,” Jackson clears his throat. He’s got one hand nonchalantly curled through the one backpack strap he’s wearing, but the bold whiteness of his knuckles gives him away. “Do either of you know where I can find Derek? I haven’t – I haven’t seen him since…the warehouse, I guess, and I’m not…”<br><br> “Derek…” Isaac trails off, looking sideways at Stiles, who is finding it increasingly difficult to avoid the forehead smashing.<br><br> “Derek’s trying to figure some things out,” Stiles says carefully, doing his best impression of casual. “There’s…there’s another pack kind of lurking around, and we don’t know much about them, so…”<br><br> It’s a practiced art, lying to werewolves. He doubts Jackson is settled enough to really be able to tell if Stiles is pulling one over on him anyway, but Isaac looks faintly impressed. The trick is to line up a series of truths, peppered through with a handful of nice, long, implication-heavy pauses, and let the other person draw their own conclusions. <br><br> “Oh.” Jackson looks put out, but he doesn’t look suspicious, so Stiles counts it as a win.<br><br> “It’s necessary,” Isaac adds gently, “otherwise he’d be here helping you.”<br><br> “Yeah,” Jackson shrugs, “sure, yeah.”<br><br> “On the bright side,” there’s probably a bit too much robust enthusiasm in Stiles’ voice – Jackson looks slightly alarmed – “you’ve got us. We’re practically pros by now, between me and Isaac we’ve been around for pretty much all the turns.”<br><br> Jackson visibly deflates, and it takes Stiles a bit of serious deliberation to decide that it’s with relief, not disappointment. He’s almost impressed, really, with how much of an effort Jackson seems to be making to not be his typical raging douche of a self.<br><br> “That’s – that’d be good,” Jackson nods decisively. “Thanks.”<br><br> “Listen,” it’s the genuinely grateful edge of Jackson’s voice that has Stiles leaning forward, barely glancing at Isaac for affirmation that the other teen is on board. “The pack’s kind of temporarily crashing at my house, for now. Stilinski’s Home for Wayward Werewolves, you know. If you want you can swing by after school, or whenever.”<br><br> “I’m sure you have approximately two million questions,” Isaac picks up, smiling reassuringly. “Erica and I can probably help a lot, and Encyclopedia Brown over here knows entirely too much for someone who’s still human.”<br><br> “Are you sure?” Jackson frowns, and the question is directed at Stiles. He has a brief flash of Jackson and Lydia, together in the harsh glare of Stiles’ Jeep’s headlights, but it’s gone before he can even get a good grasp on it. This is so much more important than any residual hurt he feels over Lydia’s love life.<br><br> “Definitely,” Stiles nods. “Come over. In fact, I bet Lydia has just as many questions as you do, and I think it’s time she’s gotten her answers too.”<br><br> Jackson studies him for a long moment, fingers so tight on his backpack that Stiles is genuinely shocked that he hasn’t pierced the skin of his palm with wolfed-out claws. He finally nods, once seemingly to himself, then again to Stiles and Isaac.<br><br> “Yeah, okay,” Jackson says, hiking his backpack a little higher up on his back and pushing himself to his feet. “Lydia’s got some meeting or another after last period, but we’ll swing by after?” <em><br><br></em>Isaac waits until Jackson is gone from the cafeteria before turning wide eyes on Stiles, who shakes his head frantically and pulls his phone out of his pocket before Isaac can interrupt.<br><br><em>l8r he can hear.</em><br><br> He types, tilting the screen towards Isaac. The werewolf nods, and Stiles is so fucking grateful, for just a moment, that someone else just <em>gets it</em> without questioning him.<br><br> In the complete opposite feeling of the first half of the day, the afternoon drags at a painfully, agonizingly slow crawl. Stiles spends most of Chem ignoring Scott and Allison, most of Econ panicking about whether or not he is<em> even remotely</em> ready to sit in the same room as Jackson and Lydia together, and the majority of English Lit whispering things that make Isaac snicker despite the fact that he’s sitting all the way across the room. Scott looks impatiently confused by the entire proceeding, and Stiles takes a perverse amount of pleasure in that knowledge. Fine. See how he likes being left in the dark.<br><br> He does, actually, need to talk to Scott for real though, so he makes a point of snagging his best friend by the back of the shirt before he can go barreling out to meet Allison.<br><br> “Wait,” Stiles says quickly. “First of all, don’t rush, let her wait on you for a change. Don’t look too eager, you guys are just <em>friends</em>.” He instantly feels bad about the last minute emphasis, but Scott’s already looking pretty bleak about the entire situation, there’s not much Stiles can do to make it worse. “I really do need to talk to you though, it’s like, massively important in the immediate future. Call me when you’re done studying or making puppy eyes or whatever, please?”<br><br> “Yeah,” Scott nods, “absolutely.”<br><br> “Don’t make too much of an ass of yourself,” Stiles teases, shoving Scott towards the door with a grin that he has to put a little bit too much effort into. Scott waves him off in response, practically running into the doorframe in his eagerness to get out of the classroom, and Stiles can’t help the frustrated sigh the second Scott’s gone.<br><br> Isaac’s waiting by his Jeep, having slipped out of the room the minute Stiles made a move towards Scott, regressing back to his old James Dean wannabe impersonation as he watches Stiles cross the parking lot.<br><br> “My birthday is April 8th,” Stiles states, unlocking his door and throwing his backpack into the back seat.<br><br> “That’s fascinating, tell me more,” Isaac teases, climbing into the passenger seat.<br><br> “You, Erica, and Derek can all pitch in and buy me my very own leather jacket,” Stiles continues, ignoring the interruption. “I feel like it’s mandatory if I want to hang out with the cool kids.”<br><br> Isaac laughs, fingering the jacket in question as Stiles eases back out of the parking spot and hopes to God there are no lurking werewolves waiting to jump out in front of his hood (it happened once, and therefore it’s a legitimate concern).<br><br> “They’re a bit much, aren’t they,” Isaac shrugs, “but they hold up nice in a fight, you know? A sweatshirt would rip the second the claws came out, but the leather lasts a couple seconds longer.”<br><br> “That,” Stiles nods, thinking of Erica’s mostly unscathed arms, “actually makes sense.” He pulls the Jeep out of the lot, scanning the area for any sign of a telltale Porsche – he and Isaac seem to reach the same conclusion at the same time.<br><br> “Holy shit,” Stiles breathes.<br><br> Isaac, almost simultaneously, groans, “I can’t believe we forgot about Jackson.”<br><br> “<em>Forgot</em>,” Stiles wails, bracing his forehead against his steering wheel the second they hit a red light. “<em>Forgot</em>. Like we didn’t spend God-knows how long trying to hunt and catch his stupid scaly ass, how the fuck did we forget the end result of that one?”<br><br> “Derek’s gonna eviscerate us,” Isaac whimpers, frowning balefully at Stiles.<br><br> “Derek?” he snorts. “Derek forgot too. He never would have pulled this emo bullshit if he remembered he had a freaking werewolf puppy running loose. Jesus,” Stiles sighs, “what the fuck are we gonna do?”<br><br> “Full moon’s not for a while,” Isaac reminds him. Stiles has a feeling the reminder is just as much for Isaac as it is for Stiles, but it’s reassuring nonetheless. Derek will be back to full-functioning form by then if Stiles has to personally drag him back into the real world, so all they have to do is stall Jackson a bit. Answer some questions. Make a few executive decisions.<br><br> “Okay,” Stiles exhales slowly, “okay. Solid game plan. We just have to give Jackson enough to keep him happy. And Lydia – well, Lydia’s smart enough that she’ll find the answers on her own if we don’t give them to her, so I don’t feel bad telling her. If Derek has a problem with it he probably should have said something when Lydia helped raise the dead. I’m starting to wonder if we should maybe bring Danny in too – it might be useful, having someone who can keep Jackson on the proverbial short leash if need be. Why are you looking at me like that Isaac.”<br><br> Isaac is shamelessly staring at Stiles with a small smirk on his face, one eyebrow raised as he waits out the other teen’s rant. Stiles glares back at him, pouting at the clear amusement.<br><br> “You know,” Isaac says carefully, keeping his eyes trained on Stiles’ face like he’s studying the brunet’s reaction. “The thing about being in a pack is that pack looks out for their own. We take care of each other, have each other’s backs. Pack’s about safety and security and having that to fall back on, knowing that even if you drop the ball there’ll be someone else to pick it up. It was one of Derek’s biggest selling points, and I’m pretty sure it’s why he picked me and Boyd, at least, if not Erica too.”<br><br> “Must be nice,” Stiles nods, “when it works. When there’s actually enough people in a pack for that safety net to exist.”<br><br> Isaac frowns, like Stiles isn’t going the direction Isaac wants him to, and he waits a few beats before trying again from a different angle.<br><br> “Scott said Derek wasn’t his Alpha,” he reminds Stiles bluntly. “I get that. I think it’s appallingly dumb, but that’s a separate conversation. Scott said no.”<br><br> “I remember,” Stiles agrees, “I was there.”<br><br> “Right,” Isaac nods. “<em>Scott</em> said he wasn’t a part of Derek’s pack.”<br><br> “Well, okay yeah. Sure. But I mean, Derek even said, Scott had his own little pack before his temporary partnership with Team Leather, me and Allison, maybe even his mom and my dad and whoever else. So Scott joins Derek’s pack and, as the supposed Alpha, that means me and Allison and whoever merge packs too.”<br><br> “Exactly,” Isaac agrees, nodding along so emphatically that his curls are going slightly haywire. “But <em>Scott</em> defected. Scott didn’t say ‘me and my pack are leaving you and yours,’ he said ‘peace bye I’m outty.’”<br><br> “So what’s the difference?”<br><br> “The difference, dear Stiles, is that Scott made his decision for himself. That doesn’t mean you don’t get to make your own decision.”<br><br> “You’re asking me to choose Derek over Scott,” Stiles protests, focusing the brunt of his glare on the 5-miles-under-the-speed-limit grandmother driving in front of him instead of turning it on Isaac. “It’s <em>Scott</em>, man, he’s like my brother.”<br><br> “I’m not asking you to choose anyone,” Isaac insists, tone calm and placating. It’s a far cry from the Isaac Stiles used to see around school, always so easily cowed and intimidated, always quick to avoid a confrontation. He likes this change, this newly assertive Isaac, and he likes it even better now that Isaac’s coming down from his post-bite douchebag high. “I’m just saying, you act like pack. You feel like pack. You use the royal we when talking about Derek’s pack, like you’re a part of it. And yeah, Scott’s your best friend, Scott’s your brother, and he always will be. But if it came down to the wire, if you were in deep and you needed backup and you needed help, which one of them would you trust to be there to save your sorry ass?”<br><br> He wants to say Scott. Every fiber of his being wants to say Scott, every piled up second of every year he’s spent with Scott at his side: his best friend, his only friend. He <em>should</em> say Scott, it’s on the tip of his tongue to do so. The words are on the tip of his tongue, but there’s a phantom hand against his chest, wasting precious seconds urging him to run, and a solid mass between him and Peter, him and Isaac.<br><br> He doesn’t say anything.</p>\n<p><em><br></em>“But. Why.”<br><br> “Because the alternative is having a loose cannon of a werewolf running around Beacon Hills,” Stiles sighs. “Well. Another one.”<br><br> “Rude,” Isaac calls from the kitchen. Stiles and Erica ignore him.<br><br> “He’s whiny, and rude, and an over-privileged asshole,” Erica argues, like it will actually change anything. “I can’t believe Derek bit him.”<br><br> “Oh, yeah,” Stiles snorts, rolling his eyes. “Because you guys were all sunshine and butterflies and sharing your cookies with the class when Derek bit <em>you</em>.”<br><br> “<em>Rude</em>,” Isaac yells again, and is, again, promptly ignored.<br><br> “That’s different,” Erica insists, inspecting the finally-healed skin between her knuckles. “Jackson’s always been a jerk. Always. He’s not power-tripping now, he’s been on a douchebag power trip for his entire life.”<br><br> That…Stiles has to give her. Hell, twenty four hours ago he would have been the one making her argument. But something about the quiet way Jackson had approached them at lunch, the conscientious effort to be polite, coupled with the knowledge that Jackson was so completely out of his depth right now, it tugs uncomfortably at the pitying part of Stiles’ heart. Besides, he has a feeling they’re all floundering a bit right now, pulling themselves back together only to find that some of the pieces don’t quite fit back into their original pigeon holes.<br><br> “He’s pack,” Isaac says, leaving the kitchen in favor of the living room couch. “Maybe he doesn’t really feel like it yet, but he is, whether we want him or not.”<br><br> “What about Lydia?” the switch is obvious; Erica knows she’s lost round one, but Stiles can tell she’s going to put up a struggle on this one too.<br><br> “Lydia’s been out of the loop for long enough,” Stiles reminds her. “We should have told her the second she was out of the hospital, and we didn’t, that’s not fair.”<br><br> “Neither is rubbing your face in her and Jackson’s little fairy tale, love-conquers-all romance saga,” the blonde grumbles. “I’d rather let Jackson whimper off into omega-dom than you leave the pack.”<br><br> He’ll concentrate later on the fact that Erica, like Isaac, seems to assume he’s a member of Derek’s pack, not Scott’s. For now Stiles is too busy with the fierce rush of gratitude that Erica’s protesting Lydia’s presence on his behalf.<br><br> “Jackson’s pack,” he shakes his head, smiling at Erica’s pout. “He needs to be with you guys, at least, and he really needs Derek. Lydia’s…well, it’s pretty obvious they’re a package deal, yeah? So I’m just going to have to man up and get over it.” Stiles means it, too. Passing commentary about fifteen year plans and all aside, Stiles isn’t stupid. Lydia loves Jackson so fiercely it literally saved all their lives – there’s no way in all of heaven and hell he’s getting in the middle of a bond like that. Hell, at this point, as much as it hurts, he’s not even sure he wants to.<br><br> “I still don’t like it,” Erica mumbles petulantly.<br><br> “Well deal,” Isaac says suddenly, pushing himself up off the couch and crossing over to the window, “’cause they’re here.”<br><br> It’s…it’s awkward. Jackson’s clearly still making an effort not to be a stuck up dick, and Lydia’s tiptoeing around Stiles like she’s not quite sure how to talk to him, which has Erica increasingly on edge. Isaac does most of the talking, answering any questions Jackson can think of and volunteering some Jackson hasn’t thought of yet. Stiles fills in what he can when he sees fit, and even though Lydia doesn’t quite look at him, she hangs on his every word.<br><br> Frustration hits its optimal peak when Erica outright growls at Lydia. Stiles glares at her until she sheepishly apologizes to Lydia, who staunchly and impressively held her ground, before grabbing Lydia’s arm and urging her to her feet.<br><br> “Come on,” he says firmly. “You and I are going for a walk. And Creepy McCreeps One, Two, and Three are going to stay here and talk about wolfy things.”<br><br> Nobody protests, which is a shockingly nice change of pace, and Stiles waits until they’re half a block away from prying werewolf ears before shoving his hands in his pockets and turning awkwardly to look at Lydia.<br><br> “Stiles…” she says quietly, and he just shakes his head. He doesn’t need her to say it, doesn’t want to hear it from her. It’s easier, in some strange way, if it goes without her saying anything.<br><br> “Listen, Lydia, I get it,” he shifts his weight, fixing his eyes on the ground beneath his feet. “You and Jackson…I get it. What you did for him was amazing, and how much he needs you is <em>painfully</em> obvious, and I’m not stupid enough to try to get in the way of that. You just,” he exhales slowly, extracting one hand from his pocket to scrub at his close-cropped hair, “you gotta give me a little bit of time with it.”<br><br> “I don’t want to hurt you,” she says quickly, biting her lip like she’s immediately regretting her words. “I really like you Stiles, just…as a friend. Wait that sounds horrible, that’s not what I meant.”<br><br> She looks frustrated, and flustered, and it’s so unbelievably out of character for Lydia Martin that Stiles can’t help but laugh. He loves this girl, he probably always will love this girl, but he’s going to have to learn to shift it to a more platonic level. He thinks he can. He thinks it might be worth it – something tells him he and Lydia could do some serious damage together, two clearly brilliant and awesome humans running with a pack of wolves.<br><br> “I know what you mean,” he assures her. “We’re kind of hanging on the cusp of a wolf pack that may or may want us to be their token human members. We, Miss Martin, need to stick together. United front of badass humanity against Alpha and the Pups.”<br><br> Lydia exhales, nodding slightly before glancing up to meet Stiles’ eyes. There’s a moment of silence, a soft second where neither of them so much as breathes, until Lydia lets out a single, slightly shrill giggle. She immediately slaps a hand over her mouth, looking slightly horrified, but Stiles only shakes his head and cracks a broad grin, and that seems to be all the permission she needs. Soon they’re both outright laughing, Lydia with her face buried in her hands and Stiles crouching down over the sidewalk, bracing himself against his knees. There’s more than a slight note of hysteria in the sound, but compared to what the alternative could be Stiles thinks maybe this is alright.<br><br> “Werewolves,” Lydia breathes, finally. She drops down to the ground next to where Stiles is still crouching, tucking her dress neatly underneath her and perching on the curb. Stiles shifts around until he can join her, long legs splayed out into the empty road in front of them.<br><br> “Werewolves,” he agrees. “Fucking werewolves.”<br><br> “My boyfriend is a werewolf,” she says disbelievingly, and Stiles can tell it’s the first time Lydia’s actually stated the obvious out loud.<br><br> “And before that he was a lizard. Kind of,” Stiles adds helpfully, earning himself a gentle slap on his thigh.<br><br> It still hurts. It’s still fresh, and it still stings when Lydia says ‘boyfriend,’ and it’s definitely not something he’s going to get over overnight. But Lydia asks about how Scott got turned, and what kind of research Stiles has done, and whether or not he’d be willing to share some of it with her, and she leans into his side and debates the pros and cons of different search engines with him, and Stiles thinks that maybe this will be okay.<br><br> “So there’s one thing I still don’t get.” Lydia sounds hesitant, and Stiles thinks he knows what’s coming. It was only a matter of time – she was there, too, when Scott declared himself separate from Derek, and since the question of his loyalties just seems to be <em>such</em> a hot topic lately... “I don’t want to say whose side are you on, because it’s not about sides, but –”<br><br> “Yeah, I know,” Stiles nods. “For someone who claims to be a member of Scott’s pack, I’ve been awfully involved in Derek’s lately. Isaac beat you to the punch, we had this conversation earlier.”<br><br> “Do you have to pick one?”<br><br> Stiles doesn’t look at her, focuses on picking at a fraying aglet on his left shoe. “I don’t really know what the other options are,” he says eventually, peeling at the split plastic. He can feel Lydia’s hazel eyes on him, sharp and intelligent and not missing a thing, and he can’t help but hope that brilliant, wonderful Lydia will have a solution.<br><br> “But you want to be a part of Derek’s pack. There wouldn’t be a dilemma if you didn’t.” It’s obvious in the matter of fact way she says it, Lydia’s confirming what she already knows, not asking.<br><br> “It’s nice, having people around,” Stiles shrugs, smirking slightly. “No one’s ever growled at someone because they think she’s hurting my feelings before.”<br><br> “That,” Lydia scoffs, “is only because you never saw the absolute daggers of death Reyes used to glare at me. Believe me, if she could have growled, she would have.”<br><br> Stiles, if the way his face heats up is any indication, blushes as red as his hoody.<br><br> “The point, though,” Lydia continues, blessedly ignoring him, “is that maybe you wouldn’t have to choose if you could convince Scott not to break off and try to start his own pack.”<br><br> Honestly, the idea hadn’t occurred to him. Well. No, it had. Of course it had, Isaac had even mentioned it himself. But Stiles had dismissed it almost as quickly as he’d thought it, because Scott had made himself clear, and Scott could be irritatingly bullheaded about things when he wanted to be (usually, of course, when it was most inconvenient for Stiles).<br><br> “Scott’s pretty firmly in the anti-Derek camp right now,” he reminds Lydia. She should know, she saw it herself, but then again, there had been a mostly dead and entirely naked Jackson in the room at the time, so.<br><br> “Yes, well,” Lydia uncrosses her legs and plants her feet firmly underneath her before standing up and offering a hand to Stiles, “Derek’s not here right now, is he?”<br><br> Stiles mulls that one over as he allows her to pull him upright, tossing the words around contemplatively as they wander back to the Stilinski house. Derek <em>isn’t </em>here, but the pack is. And maybe Scott isn’t Team Derek, but he sure as hell better be Team Stiles, and he seems to be the head cheerleader for Team Isaac these days, and maybe if they played it right they could convince Scott that the pros of being in a pack outweighed the cons of having to deal with Derek fumbling his way through being their Alpha.<br><br> “So, how do we do it then?” he asks finally, stalling halfway up the steps of his front stoop. Lydia looks back at him with a superior smile, like she’d timed out exactly how long it was going to take him to ask exactly that and was just waiting for him to catch up to her.<br><br> “How do you sell Scott on pack life? You start by pulling together enough of a pack to function as a valid selling point.”<br><br> She leaves him to think that one over too, letting herself into the house and wandering back towards the kitchen. He doesn’t bother asking how she knew to check there first, considering they’d left Jackson, Isaac, and Erica in the living room, just follows her down the hallway until he finds the three werewolves around the kitchen table.<br><br> “Jackson wants to tell Danny,” Isaac announces by way of greeting. Erica’s doing some weird non-verbal girl communication with Lydia, and Stiles has no idea what’s happening but nobody growls at anyone, so he figures that’s an improvement. He takes the empty chair between Isaac and Jackson and nods.<br><br> “I think he should,” he says, “if I have a vote in this. Everyone could benefit from a little more Danny Mahealani in their lives. And I could benefit from having direct access to a world-class hacker.”<br><br> “Now you’re just using me for my friends, Stilinski,” Jackson whines, and Stiles is pleasantly surprised to realize he’s teasing. Interesting.<br><br> “Everyone’s gotta bring something to the table,” Stiles fires back cheerfully, “and, well, I suppose your contribution is going to have to be Danny and Lydia, seeing as you don’t have much else to offer.”<br><br> Isaac looks at him like he’s an idiot, but Jackson just laughs. It’s a fascinating turn of events, one that Stiles isn’t entirely opposed to at all.<br><br> “Isaac and I already agreed we think Danny should know,” Erica interjects, rolling her eyes at Isaac’s expression. “We were just waiting on you.”<br><br> Because, apparently, his vote counts for something after all. Because this is a pack decision, with the Alpha being gone and all, and, according to Isaac and Erica, Stiles is pack. Huh.<br><br> “Good,” Jackson nods. “Anyway, being temporarily dead and then promptly undead has somehow resulted in mandatory family dinners.”<br><br> Stiles walks Jackson and Lydia out for a slightly-awkward-but-less-so-than-before goodbye before shuffling back into the kitchen and making a beeline for the fridge.<br><br> “Lydia thinks we should try to convince Scott to merge the packs,” he tells the remaining two werewolves, confident that they can hear them despite the fact that his head is mostly in the freezer. “Mostly by convincing him that pack life is awesome.”<br><br> “Except right now Derek’s pack consists of two and a half people, a tentative third, and his girlfriend,” Isaac reminds him, abandoning the table in favor of hopping up onto the bit of countertop closest to the fridge. <br><br> “And maybe Danny,” Erica adds. “But even then, it’s not much of a pack, is it?”<br><br> “It’s like when you go away to camp,” Stiles offers, abandoning his quest for some kind of edible vegetable and pulling back out of the freezer. Erica and Isaac give him blank looks in response, and okay, yeah, maybe not the best metaphor given Erica probably spent most of her childhood in and out of doctors’ offices and Isaac…well.<br><br> “When you go to sleep away camp they put you in cabins with like, ten other kids, yeah? And those first few days there you know that by the end of the summer these are gonna be your bros, and you’ll do awesome stuff like prank the shit out of other cabins and annoy the hell out of your counselor and shit like that, but you’re not on that level yet so it’s still kind of awkward. We’re the awkward little kids assigned to Derek Cabin and waiting for that glorious bonding moment when everyone becomes overnight bffls.”<br><br> By the time he’s done Erica’s shaking her head with an expression Stiles can only describe as exasperated fondness on her face, but Isaac looks faintly intrigued.<br><br> “So pack bonding, then,” he says, ducking out of the way when Stiles reaches for the cabinet behind Isaac’s head. “What’s something everyone likes? Or something we all have in common?”<br><br> “Movies,” Erica suggests, like that’s not simultaneously the obvious and the impossible.<br><br> “Being sarcastic, sassy assholes. Sassholes,” Stiles tries, giving up his search with a small sigh and pulling out a box of instant mashed potatoes.<br><br> “Wait.” There’s enough thoughtfulness in Erica’s voice for Stiles to turn around; she’s straightened up from where she was slumped over the table, brown eyes bright with whatever’s sparked her interest. “Movie night of appallingly inaccurate werewolf movies with free reign to shamelessly mock their shortcomings.”<br><br> “That’s…actually kind of brilliant,” Isaac concedes, glancing over to gauge Stiles’ reaction.<br><br> “Where have you been all my life?” he sighs, grinning at Erica. “You are brilliant.”<br><br> “Well,” Erica says smugly, “I do try.”<br><br> They spend most of dinner planning it – Erica pulling up lists of werewolf movies on her phone, Isaac rattling more off from memory (and isn’t <em>that</em> a fun skill Stiles is going to have to explore later, because if Isaac is a movie buff then he might have a new best friend), Stiles making a grocery list for supplies. They’re maybe a little too enthusiastic about it, maybe working a little too hard on something that should be fairly routine for a group of normal teenagers, but it feels good to have a project and a distraction. Besides, Stiles isn’t quite sure he remembers <em>how</em> to be a normal teenager, not anymore.<br><br> So they plan, and Stiles makes dinner and makes lists and promises Erica he’ll stop by the video rental place tomorrow until a shifty-eyed Isaac mentions he might already own most of the movies on Erica’s list, as long as Stiles has an HDMi cable for the flat screen in the living room. They feel a little silly about it, but it’s something to do, and, in particular, something to distract Stiles from the fact that despite his frequent cell phone checks, Scott completely failed to call or text Stiles like he’d promised he would.<br><br> Inevitably, though, the Sheriff comes home just in time to usher them all upstairs to pretend like they’re actually going to get a reasonable night of sleep before school tomorrow. He’s also, apparently, cottoned on to the fact that all three of them have been sleeping in Stiles’ bed, which seems to be a very big No. It’s weird not having Erica in his room, even weirder when he thinks about how backwards his definitions of <em>weird</em> really are lately, and he’s lost on that thought until Erica clears her throat loudly from the doorway.<br><br> “What’s up?” he asks, not looking up from his laptop. “Isaac’s in the shower, but it’s yours when he’s done if you want it.”<br><br> “I’m good.” She’s lingering in the doorway, hovering, and that’s enough to make Stiles close his laptop and turn around, giving her his full attention. She gives up after a few long moments, crossing the room and dropping down on the edge of his bed, legs curled up into her chest.<br><br> He’s forgotten, somehow, that underneath Derek’s ill-timed breakdown, and the reemergence of Jackson, and Stiles’ own personal drama with Lydia and Scott and Alpha politics, all of this started with Erica getting thoroughly beat and watching her packmate die.<br><br> “How are you, though?” he tries, internally cringing.<br><br> “Better,” she mumbles. “Not <em>better</em> better. But. Better.”<br><br> Stiles recognizes Don’t Wanna Talk About It. It’s a front he’s projected and perfected for years; it’s not hard to pick it up from someone else when you know what to look for.<br><br> “I wanted to apologize, actually. About earlier,” Erica says finally, glancing over at him. “With Lydia.”<br><br> “You don’t –”<br><br> “No, wait,” she holds up one hand, interrupting him. “I used to have this…I used to daydream about finally getting your attention, about you looking away from Lydia long enough to realize how great we could be. And I had this one, in particular, about that stereotypical teen movie moment, you know, when you’re totally over her and with me and happy, and <em>that’s</em> when Lydia finally notices you and tries to get you back. And you, because hey, my fantasy, totally shut her down cold, because you realize how much better things are with me than they ever could have been with her.”<br><br> “Erica…” Stiles says softly. He doesn’t know how to tell her he wishes he’d realized that too, wishes they could rewind back far enough to where none of <em>this </em>happened. Because she’s right, he knows it – they would have been phenomenal together. If she’d pulled his attention away from Lydia long enough for him to notice Erica, Erica would have been eight different kinds of perfect for him.<br><br> “It’s okay,” she shrugs, and she’s smiling like she means it. “It was a while ago. Besides, I think I’d have someone else in mind to play my role now, if that scenario ever came up.”<br><br> Stiles frowns in confusion, but Erica doesn’t pause long enough for him to ask.<br><br> “But anyway, the thing I always wanted to say to you was that you deserve a million times better than Lydia Martin. You really do. Because yes, Lydia is smart, and beautiful, and lovely, and she would focus all that power on molding you into exactly what she wants, and that, Stiles, would be a travesty. Because I think you’re pretty damn awesome the way you are.”<br><br> He can’t help it. Doesn’t really want to stop it, even if he could. Stiles rolls his desk chair forward until he’s close enough to cup Erica’s jaw between his hands and places a single, fleeting kiss against her lips.<br><br> She gets it. He knows she does, and it’s a relief not to have to explain it. There’s nothing there; it’s not meant to be anything more than an acknowledgement of the single nicest thing anyone’s ever said to him, an apology for failing them both so spectacularly in the past, a single second to honor what could have been. She presses into it for a second, just long enough for it to count for something, before pulling back.<br><br> “If you leave this pack,” she says quietly, “I will hang Scott from the rafters in the gym. By his balls.”<br><br> Stiles laughs so hard he nearly cries.</p>\n<p><em><br></em>“Okay, seriously, what gives. First it’s Isaac, now Erica too? And you smell like…Jackson. And Lydia. What’s going <em>on</em>, Stiles?”<br><br> Something in him breaks a little. Scott sounds so accusatory he’s practically snarling, and the grip he has on Stiles’ arm is just on this side of inhumanly tight, and Erica’s at his shoulder making a low noise in her throat that’s probably not calming Scott down, and Stiles is already so done with today and it’s not even first period yet.<br><br> “Go,” he tells Erica lightly, touching his fingertips to her wrist. “I got this.”<br><br> She leaves, but not without enough flare to prove how violently opposed to the situation she is, and Scott’s torn between gaping at her and glaring at Stiles. Stiles can still see Isaac out of the corner of his eye, melting back against the nearest bed of lockers like he’s doing his best to stay out of the way, and Stiles lets him. It might be good, for him or Scott, he’s not really sure, if Isaac’s there too.<br><br> “You would know,” he tells Scott calmly, leveling his best friend with a look that belies his conversational tone, “if you’d, actually, for once, actually torn yourself away from your daily Allison meltdown long enough to remember that I had <em>literally life-changing important things I needed to talk to you about</em>.”<br><br> There’s a moment where Scott looks like he might feel guilty, but he flashes right through that to hurt, and then angry, and then he’s snapping right back. “Look, I’m sorry Lydia picked Jackson over you, and I get that you need to vent –”<br><br> “Boyd’s dead.”<br><br> Scott closes his mouth so abruptly Stiles is pretty sure he actually hears teeth click together.<br><br> “Erica got away, but only just. They were attacked, after they somehow managed to escape being shot repeatedly by your ex-girlfriend and then electrocuted for hours on end by her psychotic grandpa, by an alpha pack. Yeah, a pack. Of Alphas. Every single one of whom could rip each and every one of us to pieces. Including Derek. Who, by the way, has gone AWOL, since he lost his <em>entire pack</em> in under 24 hours. Again. So you know what, Scott, you focus on your fake friendship with Katniss, because without her, you’re going to find yourself an Omega by default, and I hear that’s a pretty shitty place to be.”<br><br> It takes Scott a few seconds to recovery, but Stiles is happy to let it sink in. Not happy. Smug. Content. He’s content to watch Scott soak it in, to feel the weight of just some of what he’s been missing in his…absence. He can tell when the last point hits home, when Scott’s shoved everything else aside to recognize what Stiles implied.<br><br> “Not even a week ago,” Scott says quietly, and there’s ice in his tone, a hard line driven directly at Stiles, “you told me I still had you. That I’d always have you. So what, Erica bats her eyelashes and suddenly you’re gone?”<br><br> Stiles closes his eyes and inhales a long-suffering breath. He’s certain that the only thing holding him back from punching Scott right in his stupidly crooked jaw is the tough-learned knowledge that it will do more damage to him than it will to Scott. <br><br> “You have me,” he exhales finally, opening his eyes and glaring right back. “You’ll always have me. But I’m starting to think that maybe I don’t have you, and right now, with everything that’s going on, I can’t afford that doubt.”<br><br> The bell doesn’t ring the way he wants it to; doesn’t signal the perfect ending of the argument that lets Stiles have both the last word and a legitimate excuse to walk away. He finds, in this particular moment, that he doesn’t care. He stalks off on his own, hesitating only long enough to glance once at Isaac, tearing his gaze away from the dumbstruck look on Scott’s face, and for Isaac to nod back with the barest incline of his head.<br><br> Stiles walks away before Scott can catch up. He doesn’t bother with first period; finds himself instead wandering into the empty natatorium. They’d drained the pool after the incident with the kanima – standard procedure for glass breaking anywhere near it, let alone an entire panel of the glass ceiling shattering – and, since swim season was long over, hadn’t bothered refilling it yet. The overwhelming stench of chlorine still hung heavy in the air though, and Stiles found himself, inexplicably, calming down just a little bit more with each inhale.<br><br> He stays there through second period and half of third, up in the mezzanine level with his legs dangling over the edge and his elbows propped against the third rung up on the safety rail. A campus security guard shows up twenty minutes into third period, lazy on the first level and not thorough enough to look up and catch him, but it’s enough motivation for Stiles to leave, haul his backpack up off the floor and wander the long way back through the locker room before meandering through the hallways.<br><br> He kills fourth period by pretending to proofread his essay on <em>To Kill a Mockingbird</em>, like he hadn’t written the essay last weekend and proofread it twice since then, but has a hard time coming up with a reason to avoid lunch. It’s <em>lunch</em>, first of all, and Scott’s definitely not masochistic enough to make a scene in the cafeteria. Besides, he has a lurking suspicion that Erica will come find him if he doesn’t show up, and he doubts that will be a particularly pleasant experience.<br><br> Sure enough, she’s waiting for him at his usual table. Scott and, surprisingly, Isaac, are notably absent, but neither of them comment on it as Erica picks carefully at her apple and Stiles rambles about the pros and cons of straight versus curly fries. It comes as something as a surprise, really, when a lunch tray drops down on the table next to Stiles’ elbow, and for the second time in his life Stiles is greeted with the sight of Danny, Lydia, and Jackson dropping down from on high to consort with the common folk. <br><br> “Hey,” Danny says cheerfully, sinking gracefully into the chair on Stiles’ right.<br><br> “Heard you and McCall broke up this morning.” Jackson just dives right in before he’s even fully seated, wisely leaving an empty chair between himself and Erica.<br><br> “<em>Jackson</em>,” Lydia hisses, claiming the empty chair and throwing the mother of all scolding glares his way.<br><br> “What,” he shrugs, “I was just going to say that, if Stilinski’s so inclined, I’ve been looking for a good excuse to punch McCall for weeks. Arguably years.”<br><br> Stiles, to everyone’s apparent surprise, bursts out laughing.<br><br> “Shit,” he sighs, ducking his head and shaking away the laughter. “You’re actually more terrifying when you’re trying to be nice then you ever were when you hated me, Whittemore.”<br><br> “Thank you,” Jackson replies magnanimously, and that, more than anything, breaks the ice.<br><br> Lunch goes by in an infinitely better time than Stiles would have expected, given his day so far. Danny, who Jackson must have ran to tell the second family dinner was over, distracts Stiles with question after question after question, and his careful attention to each of Stiles’ answers is enough to prove bringing Danny in was a good decision. Lydia makes an effort with Erica, an actual effort in more than just pretty girls talking about girl things, and Jackson bounces back and forth. There’re a couple of stall outs, a couple false starts and long, hanging moments of silence before someone jumps to fill them, but all in all, it’s kind of nice. Erica eventually brings up their idea for a pack movie night, playing it way too cool and casual for someone who had spent so much time the night before planning it out, but Lydia and Danny, and even Jackson, are quick to agree. Lydia nudges Stiles foot under the table, smiling her approval at him, and Stiles is sheepishly proud of the way he doesn’t react to the attention.<br><br> The afternoon’s harder. Stiles has to go to Chem because Harris will probably make up at least three excuses to give him detention in his absence, Econ because why pass up an excuse to hear Coach Finstock’s babbling lunacy, and English so he can hand in his paper, but Scott’s in all three, and Stiles can <em>feel</em> Scott’s eyes on him, oscillating between hurt and angry like Scott can’t make up his mind.<br><br> Stiles has a lurking suspicion that wherever Isaac disappeared to at lunch, it had something to do with Scott, because Isaac books it straight out of English the second the bell rings, before Stiles has even finished putting his books back in his bag. Scott, on the other hand, is clearly lingering, not quite looking at Stiles but still hovering.<br><br> Stiles doesn’t bother hiding the way he sighs exasperatedly, staring at Scott until he has no choice but to look at Stiles. Stiles kind of…flails his arms in a faintly dramatic, ‘get on with it’ kind of way, and Scott looks positively constipated in response.<br><br> “I’m sorry,” he says finally, sighing hard enough that his shoulders droop several inches. “Stiles, I’m sorry. You were right, you tried multiple times to tell me that you needed to talk to me, and I kept blowing you off. And,” he holds up one hand, anticipating Stiles’ interruption before the kid can even open his mouth, “I know it’s not the first time I’ve done it. Not even close. And I’m sorry, because it’s really not fair at all. I don’t blame you for feeling like you can’t count on me. I probably deserve that, and I definitely haven’t given you much of a reason to think otherwise. I’m sorry.”<br><br> Stiles and Scott have fought, real, genuine fights over more than just which gaming console was superior, a grand total of four times over the course of their friendship. Each time Stiles has managed to hold onto his anger, to hold that burning ember of a grudge, for less than a day. This time, clearly, is no different.<br><br> He meets Scott’s hopeful puppy dog eyes with a wry smile, rolling his eyes. “Isaac talked to you, didn’t he?”<br><br> “Talked?” Scott snorts, returning Stiles’ gaze with a tentative smile of his own. “That’s one way to put it. Ripped me a new one is another way to put it.”<br><br> “<em>Isaac</em>?” Stiles blinks back his surprise. “Seriously?”<br><br> “You know that parent voice, that quiet calm one they whip out right around the same time as your middle name, and it always means you’re in deep, deep shit?” Scott implies grimly. Stiles raises both eyebrows, clearly impressed.<br><br> “Huh,” he huffs. “Who knew.”<br><br> They both shift awkwardly for a moment; it’s clear the conversation isn’t over, but neither one of them seems sure which issue to tackle next.<br><br> “He, uh,” Scott starts finally, “also talked to me a bit about why he thinks splitting my pack from Derek’s is a mistake.”<br><br> “Yeah,” Stiles nods, “we’ve talked about that a bit too.”<br><br> “Did you mean what you…” Scott trails off, clearly not meaning to go that blunt that quickly, and Stiles takes pity on him before Scott can try pulling it back.<br><br> “About being a part of Derek’s pack?”<br><br> Scott nods.<br><br> “Well,” Stiles rubs one hand over his buzzed hair, scrubbing his palm down as far as his nose before running back up to the top of his skull. “Yeah. Kind of. I meant what I said about always having your back, too, but dude, I really think the best choice is Derek’s pack. For me, definitely, but also for you.”<br><br> “But, why?” And it’s a testament to the way Scott is actively trying to listen to Stiles right now (and honestly, so much <em>effort</em> from people these days, it’s a nice change of pace) that, despite being so obviously against it himself, there isn’t an ounce accusation in his tone.<br><br> “Did Isaac fill you in on everything?”<br><br> Scott nods again, and Stiles makes some kind of head-bob-motion in response.<br><br> “Okay,” he sighs. “So there’s kind of a crazy pack of superwolves biding their time before they come kill us all and abscond with Derek, you got that part? And the thing about pack is that it actually <em>makes you stronger</em>. Not just the way we always assumed Derek meant, that it makes him physically stronger, but it makes all of us better. It’s family, and it’s trust, and it’s being secure in the knowledge that you have someone to fall back on, and maybe, in this case, secure in the knowledge that if some crazed wolves decide to kidnap me, the whole fucking cavalry will come after me. Not like last time, when I didn’t even think I’d get you, because I wasn’t sure which side you were on anymore.”<br><br> Scott flinches, visibly, but Stiles thinks he maybe deserves that one and doesn’t bother apologizing for it. There’s no point, anyway, because Scott would know it was a lie.<br><br> “We’ve never had much family, bro. You get that as much as I do; we are the textbook definition of broken homes. It’s…it’s baffling, a little bit, but I have a really good feeling about this. It’s going to take time, and definitely a lot of work, but this pack, all of us, could be the silver fucking lining in this nightmare.”<br><br> Scott’s quiet for a long moment, and Stiles lets him be. He’s committed to this now, he thinks. Regardless of Scott’s decision, regardless of what Scott thinks is best for him, Stiles knows in his gut that Derek’s his Alpha, that Isaac and Erica, and even Jackson and Lydia and Danny, are his pack.<br><br> “I get what you’re saying about the pack,” Scott says finally, and it’s clear he’s choosing his words carefully. “I do. Or I think I do, at least. But Derek, man…do you really think, if it came down to it, Derek would risk his life to save yours?”<br><br> Stiles can’t even control how fast he snaps back at that, the sudden urgency he feels to correct Scott, to make Scott realize how truly, deeply wrong he is.<br><br> “Scott, he <em>has</em>. He has, more than once, which is more than I can say for you. Yeah, fine, you have an annoyingly wonderful habit of swooping in last minute and saving the day in the eleventh hour. But what you miss is that, if it weren’t for Derek, I probably wouldn’t survive long enough to witness your heroic entrance.”<br><br> It’s not fair, because Stiles knows this time that Scott doesn’t deserve it. He knows, after the fact, that there’s always been a good excuse for Scott’s inaction. It’s illogical, and he knows it, but he still can’t quite shake that feeling of betrayal when he risked his life, risked <em>Derek’s</em> life, half-drowned in a pool, and Scott hung up on him.<br><br> “Listen,” he tries again, making a concentrated effort at soothing any feathers he might have just ruffled. “I get it, I know you’re there. You’re there as much as you can be, and that’s incredible and I can never thank you enough for it. But that’s my whole point, about pack. Right now you’ve got one werewolf with two mostly helpless humans to look out for, and if we get separated, you inevitably have to choose. But if we were united, one pack under one Alpha, you wouldn’t have to make that choice. It’s okay if you go after Allison, or Isaac, or someone else, because that still leaves five other people to come after me.”<br><br> It’s working, Stiles can tell it is. Maybe not enough to sell Scott entirely, but enough to convince him to at least give it a chance, maybe to come tomorrow night and see the whole pack together, see what that could be like, and Stiles is ready to count that as a huge victory.<br><br> “I still don’t…Derek…”<br><br> “Derek’s a work in progress,” Stiles concedes. “He is, you’re right about that. But I’m working on it, and so is he. And if you think about it, Scott, if you really sit here and think back about everything you know about Derek Hale…fine, maybe he’s gone about it in completely the wrong way, and he’s shit at showing it, but his heart’s in the right place and you know it.”<br><br> “I’ll think about it,” Scott promises, and it really does feel like a promise he’ll actually keep. “Give me some time.”<br><br> “Yeah,” Stiles agrees instantly, because he <em>wants</em> this, he wants Scott to come to a real decision, no more wishy washy back and forth about Derek and his pack. “Yeah, of course. Think about it. Talk to me, or Isaac, or whoever, if you have any questions about anything. And come tomorrow night. It’s just movie night at my house, we’ve done that a million times. It doesn’t have to mean anything.”<br><br> “I will,” Scott nods. He shifts his weight back and forth, tugging against the backpack still hanging from his shoulders, and bites his lip once before finally spitting out whatever lingering thought he’s holding back.<br><br> “So, we okay?”<br><br> “Yeah, bro,” Stiles insists. “Course we are. What, do we have to hug it out to make it official?”<br><br> Apparently they do.<br><em><br></em></p>\n<p><br> It’s an early Friday night dinner – the Sherriff’s shift starts at 5:30 but Stiles, in an effort to feed his father real food, has managed to wrangle both his dad and Isaac into agreeing to turkey burgers and salad in lieu of their original meat and fries demand. They’ve barely started eating, Stiles graciously ignoring Isaac’s liberal application of ranch dressing (it’s low fat; what Isaac doesn’t know won’t kill him), when Erica sits upright so sharply, so abruptly, that more than one piece of silverware clatters to the table in shock.<br><br> The sound she lets out is something distinctly non-human, something ear-splitting between a shriek and a whine, and she’s out of her seat and through the back door before anyone has time to ask for an explanation. Stiles can do nothing but gape after her, mouth hanging open in unguarded shock, when Isaac is suddenly taking off after her, so fast he upends his chair.<br><br> “What the –” the Sherriff marvels, and Stiles is entirely at a loss with a response. He shrugs, entirely unhelpfully, and pushes himself to his feet with significantly more caution than either werewolf had demonstrated.<br><br> “Stay here,” Stiles warns, stilling his father’s movement with one outstretched palm. “Stay here until I know what it is.”<br><br> There’s a noise of protest at the order, concern more than disobedience, but Stiles ignores it as he moves carefully towards the open door, quickly cataloguing the closest defensive weapons in his mind, just in case, as he rounds the doorway.<br><br> A pile of bodies lie in a tangled heap near the center of the Stilinski’s backyard, and Stiles takes just barely a second to panic before he recognizes the near-hysterical sound of Erica’s tearful laughter. He steps closer, lowering his mental guard with each footfall, until he can make out three distinct figures on his grass.<br><br> Boyd, one hand curled around the back of Erica’s neck, other arm wrapped around Isaac’s waist, face just as bloody and bruised as Erica’s had been and one eye swollen nearly all the way shut, is grinning at Stiles like today is the most glorious, wonderful day on God’s green earth.<br><br> Stiles is inclined to agree. <em><br><br></em></p>\n<p><br> He hadn’t really expected to find Derek at the train depot; sure enough, when Stiles shoves the heavy door open the place looks virtually untouched, definitely unlived in. He’d expected Derek to be at the Hale place even less, but then again, there’re only a limited number of options Stiles is even aware of, and there’s no time like an enforced week of self-reflection to drive him to visit the old property.<br><br> Derek’s car is parked a couple hundred yards from the house, like he couldn’t bear to desecrate the ruins with any more evidence of his continued existence than strictly necessary. Stiles is feeling magnanimous in light of Boyd’s return from the dead; he pulls up into the empty clearing next to the Camaro, leaving his Jeep behind to trek the remaining distance on foot.<br><br> There’s no reaction to Stiles’ appearance, though he’s completely certain that Derek could hear and smell him before he’d even gotten out of the car, but this time Stiles doesn’t go out of his way to demand the older man’s attention. He doesn’t need to, not when Derek is sitting out in broad daylight, hunkered down on one of the sturdier porch steps, elbows on his knees and one palm cradling his temple. It’s not until he’s closer, steps away and still unacknowledged, that Stiles notices the small book in the Alpha’s free hand, a slash of white against the black and grey of Derek’s form.<br><br> Stiles drops himself down to sit on the stair under Derek’s, not really trusting the rotting wood to hold them both, and doesn’t question the automatic draw to sit closer than might ordinarily be considered normal. He’s been starting to consider, lately, that perhaps one of the most consistent truths about his relationship with Derek is their unflinching tactility – he can’t remember the last time they interacted without shoving or grabbing, jostling the one’s arm or elbowing the other away. They’re so rarely in a calm setting, so rarely together in relative quiet, no looming urgency hanging over them, that Stiles has never really had the opportunity to see if this automatic draw and pull of Derek’s skin worked in non-violent ways too.<br><br> He mulls this over as he sits on the rickety wooden steps, close enough to feel the now-familiar heat of a werewolf’s body filling the inch of space between his shoulder and Derek’s arm. It’s an unusually long silence for Stiles, especially in Derek’s presence, but it’s also an unusually long tolerance of Stiles’ proximity, and he’s tempted to let Derek take the lead on this one. For now.<br><br> Eventually the werewolf leans into him, shifting his weight towards Stiles’ slighter form, tilting his head down towards the bared skin at the back of Stiles’ neck. The boy can tell the moment the scent registers, the moment Derek realizes why Stiles has interrupted Derek’s forced isolation.<br><br> “Boyd…” he says softly, drawing in even closer, every warm exhale spreading goosebumps further along Stiles’ skin.<br><br> “Came home this afternoon,” Stiles nods, shifting just enough to subtly allow the Alpha better access. “Shoulda known, really. Erica assumed he was dead – he didn’t follow her, and I guess it looked pretty bad from her angle, but. Well, first rule of any quality sci-fi, supernatural, or fantasy story is no body, no death, right? I mean, Gandalf, Peter Pettigrew, Sebastian Verlac. Even if she didn’t know better, I should have.”<br><br> Derek didn’t say anything, didn’t need words for Stiles to hear the blatant <em>I have no idea what you’re talking about</em> stare he was almost certainly leveling at the back of the teen’s head.<br><br> “Jean Grey.”<br><br> “Technically that’s Phoenix,” Stiles quips back automatically, “but I’ll give you…wait a minute.” The words caught up with him all at once, slamming through his awareness with all the subtlety of a freight train. He whips around, stabbing an accusing finger dangerously close to the older man’s nose. “You sneaky little bitch, you’re secretly a geek.”<br><br> Derek smirks, just a little quirk of the corner of his lip, and Stiles gapes at him.<br><br> “Comic books,” he says, deliberately off-handed and accompanied by a small shrug. “I used to…” Derek shifts the arm in his lap, redistributing his weight until he can balance on the elbow still propped against his knee. “Well. I was going to go to school for engineering. Maybe architecture. But I liked anything that involved drawing.”<br><br> He holds his free hand out to Stiles and, sure enough, when the brunet looks down there’s a sketchbook being offered to him, spine cracked deeply enough to hold the page open without anything pinning it down. It’s a rough sketch, none of the precision a proper blueprint would have had, but there’s no doubt in his mind that Stiles is looking at a near-perfect replica of the Hale house in all its glory.<br><br> The sketches go on for several pages, drawings of the house’s exterior from all sides, sketches of old rooms, floor plans. He lingers on the floor plans more than the rest; it takes him longer to realize that these, unlike the previous sketches, are improvements and not memories. The first floor looks relatively like what the bare bones still remaining would suggest, but the second – Stiles bites back a smile at the small row of bedrooms lining the hall, initials brushed into the corner in an impossibly light, delicate press of graphite against the page. ER gets the corner room and her own bathroom, IL a room with a bay window. VB, Stiles notices, has been smudged to near nothingness.<br><br> “Technically it’s not a new place outside of the train depot,” Derek says quietly, watching over Stiles’ shoulder until he’s certain the teen has made it through all the drawings. “At least, not yet. So it doesn’t really hold up that end of the deal. And these are a few weeks old. It might make more sense, at this point, to scrap it.”<br><br> Stiles frowns, leaning his weight back until his spine digs into the lip of the stair Derek’s perched on and his side, from shoulder to knee, is pressed against the warm length of Derek’s. The werewolf doesn’t pull away - if anything, he pushes a little further into it.<br><br> “That,” Stiles compromises, flipping back to the interior floor plans again, “depends entirely on how flexible you can be with this second floor. Boyd, I think, will be a little upset if you give away his room on account of being fake dead.”<br><br> Derek’s scoff hides a snort of amusement, and he’s close enough now that it ruffles the short hairs at the base of Stiles’ neck.<br><br> “Also, Jackson,” he reminds Derek, “who has been alarmingly not-douchey this week, so that should be an interesting treat for you. And, solely for the purpose of not messing up your delicate organization, my initials are not SS. Just so you know what to mark it when you finish designing my suite. Although if it’s on the third floor you better remember to add an elevator.”<br><br> Derek tugs the sketchbook back, reaching one hand behind him for a long-abandoned pencil. <em>JW</em>, he writes in the margin, drawing a neat arrow to the second floor drawing. <em>Suite for GS + elevator</em>.<br><br> “You absolutely do not know my initials, you are making that up,” Stiles frowns, staring at the offensive evidence clearly in front of his face.<br><br> “Don’t make me say it,” Derek warns threateningly, “I’m not entirely sure I even know how to, but I will make certain that my butchered pronunciation makes your head explode.”<br><br> There’s a funny little thump in his stomach, something echoing down from his ribs and bouncing through his torso, something that feels like an odd mixture of pleasure, pride, and fondness. He feels like a proud parent watching his delinquent child bring home his first passing report card, not quite straight-As but solid points for effort.<br><br> “You’ll never know,” he insists firmly, stamping down on the warm feeling. “The point, Derek,” and while he doesn’t let his voice get too somber, he lets enough of the teasing fade out so they can be clear on this, “is that you have a pack. Your pack didn’t abandon you, doesn’t want to. In fact, your pack has actually gotten bigger since the last time you saw it, so you really might want to consider that third floor. It’ll be a nice summer project, I can supervise while all you of the werewolfy super-strength run around shirtless.”<br><br> Stiles drops one hand on Derek’s knee, squeezing it briefly before using it to push himself upright, straight off the staircase until he’s standing in front of Derek again. This time the man is looking up at Stiles, something that looks alarmingly, adorably, like a combination of confusion and hope settling across his features.<br><br> “The whole pack, significant others included, is going to be at my house tomorrow night. We’re having a movie night, pack bonding, trying to see if everyone can actually coexist in the same room for a whole evening,” Stiles shoves his hands in his pockets before he can do something ridiculous like ruffle Derek’s hair or pat his cheek. “If you think you’re ready for it, the invitation is open to you too. If not,” he shrugs, “well, no one’s going anywhere, we can wait a bit longer. Although I’m not actually sure how Boyd escaped the Alphas, so that situation might change. Oh well. No immediate crises.”<br><br> He doesn’t bother waiting for a response from Derek, not really expecting one, so Stiles is already a few steps away when Derek calls out after him.<br><br> “Aren’t you a little confused about which pack you’re in?”<br><br> In an earlier time he might have been offended, might have read thinly-veiled rejection and exclusion in the question. Stiles has spent too much time with Erica and Isaac this week, too many too emotional conversations about <em>feelings</em> and pack loyalty, to take it as anything other than Derek scrambling to understand. He turns back slowly, maintaining the distance between them but forcing himself to look the werewolf so squarely in the eye that Derek can’t mistake it.<br><br> “I’m loyal to my Alpha,” Stiles says firmly. “Always will be.”</p>\n<p><em><br></em><br> It’s…it’s not awkward, not really, but only because they all actively work at making it not awkward. Still, they’re all <em>there</em>, even Scott, though he looks the most reluctant out of everyone, so it’s a start. Stiles spent the better part of the day making food – Erica bounced frenetically back and forth between helping him and hovering over Boyd – mostly picky finger food they could pile onto the coffee table and eat in the living room, chili for nachos and homemade pigs in a blanket like his mom used to make every Superbowl Sunday. In an entirely non-shocking move the majority of the food is completely demolished within the first twenty minutes, but Stiles is convinced that’s a good thing. Everyone’s warm and slightly lethargic with the weight of too much junk food in their bellies, and the bloated contentment makes it that much easier to brush off the fact that two weeks ago most of them hated each other.<br><br> The movies help too; Stiles and Erica exchange entirely-too-pleased smirks the first time Jackson makes a snide comment about how painfully inaccurate Michael J. Fox’s werewolf is.<br><br> “At least,” Isaac amends, grimacing, “it’s not <em>Twilight</em>.”<br><br> “Don’t lie, Isaac,” Boyd grumbles back, “you’re totally Team Jacob and we all know it.”<br><br> “Well yeah,” Danny snorts, “have you <em>seen </em>his abs?”<br><br> But it’s Scott, <em>Scott</em>, who seals the deal when he tentatively tosses out. “Who needs Taylor Lautner when you have Derek Hale.”<br><br> Danny is the first to laugh, but Isaac and Stiles follow so quickly after it’s nearly simultaneous. Even ever-stoic Boyd cracks a smile at that, warily shaking his head.<br><br> “Guys,” Jackson pouts, and it takes Stiles a second to realize <em>holy shit</em>, Jackson’s actually joking, actually playing petulant for laughs and not because he’s being a spoiled brat, “I’m hurt. At the first opportunity possible I’m challenging Derek to an ab-off.”<br><br> “Erica and I volunteer to judge,” Lydia says quickly. She twists around from her perch on Jackson’s lap and hikes his shirt up to his ribs, studying his stomach like she isn’t intimately familiar with it. “Erica?”<br><br> “I think,” Erica hums after a moment of staring contemplatively at the proffered skin, “a side-by-side comparison is in order. Also possibly a touch-test.”<br><br> “You keep your greedy paws to yourself,” Stiles chides, elbowing her in the ribs. Erica shifts her arm around enough to pinch Stiles’ side in retaliation, grimacing apologetically when she accidentally catches Danny’s skin too.<br><br> “That,” Scott accuses melodramatically, “that is your possessive!Stiles face.”<br><br> “Why do you sound surprised?” Isaac nudges him, raising an eyebrow at Scott. “Is it a secret that Stiles wants to lick every inch of Derek’s six pack?”<br><br> “You say that like I’m the only one here,” Stiles sighs, frowning at Isaac, “when really, I mean, a show of hands –”<br><br> Erica, Lydia, Danny, and…<em>Jackson</em>?...almost simultaneously raised their hands with more enthusiasm than Stiles had ever seen from any of them in a classroom. Stiles nods triumphantly, case in point, and grins at Isaac, who only shakes his head in response. They’re joking, Stiles knows, but there’s a feeling in the pit of his stomach that Isaac planted that particular idea on purpose. To <em>what</em> point and purpose Stiles isn’t sure, but…well, he’s been fixated on worse thoughts before, so he’ll allow it.<br><br> Because the important part, the real thing, is that this is <em>working</em>. It’s not entirely effortless – there’s a precarious sort of fragility in the air, like everything’s okay now but one wrong word, one poorly-executed joke could bring it all crashing down around them – but it’s something. Stiles is okay with something.<br><br> Erica, like she can hear Stiles’ thoughts, or maybe just like she can smell the smug contentment on him, reaches over and laces their fingers together, squeezing his hand lightly. Stiles thinks maybe he likes this part most of all – the easy way everyone’s all threaded together, Erica curled with her legs in Boyd’s lap and her back against Stiles’ side, Danny’s thigh pressed against Stiles’ from hip to knee. Jackson and Lydia have somehow squished themselves into Stiles’ dad’s recliner, Isaac and Scott are close enough on the loveseat that you could almost call it <em>cuddling</em> (and really, that’s another avenue Stiles might have to explore with Isaac a bit, because there’s pack-cuddling and then there’s <em>cuddling</em> and Stiles is not entirely opposed to the idea of Isaac and Scott <em>cuddling</em> cudding). It’s warm, and it’s comfortable, and it’s this, more than anything else, that makes Stiles think they have a chance at actually making this work long term.<br><br> They’re halfway through <em>Van Helsing</em> when Erica’s grip on Stiles’ hand tightens. He’d write it off as nothing, or maybe her distaste at the simpering vampire-girls on the screen, if it wasn’t almost simultaneous with Boyd’s suddenly tense shoulders and Isaac subtly freezing in place.<br><br> “He’s outside. Front stoop.” Erica presses the words against the shell of Stiles’ ear, like five-eighths of the room isn’t hyperaware already. They seem content to let Stiles handle it though, pointedly ignoring the way he leisurely pushes himself to his feet and heads towards the front door.<br><br> Derek looks fragile, like something that was shattered and then pieced back together, but the glue hasn’t dried yet, the cautious hold tenuous at best. Stiles wants to blame it on the sallow glow of the overhead porch light, but he’s so damn tired of lying to himself.<br><br> “You meant me,” Derek doesn’t hesitate, jumps right in the second Stiles pulls the door shut behind him, like he knows he’ll lose his nerve if he waits too long, “not Scott.”  <br><br> It’s endearing, and exasperating, the way he tries so hard to make it sound insistent. Stiles hears the question too easily though, hears the hesitation and the uncertainty in Derek’s voice, and wonders how long Derek’s been broken. How long, really, and if he’s so irreparably damaged that there’s no hope for him, that nothing in the world will convince Derek that he has Stiles. But, then again, it’s only in that moment, only as the thought formally crosses Stiles’ mind for the first time that he’s willing to acknowledge, that Stiles realizes exactly how true it is. Derek <em>has </em>him.<br><br> “Jesus, Derek,” he exhales softly, “it really is like the blind leading the blind with you, isn’t it?”<br><br> Derek flinches but holds his ground, like he’s bracing himself for the verbal barrage he’s so sure is coming, and Stiles <em>hates </em>it.<br><br> “The thing is,” he pushes on, not letting Derek’s hangdog look slow him down, “it’s so obvious to anyone who really looks at it that you tried. You took these kids, broken kids from broken lives and broken homes, and you gave all of us the chance to have something better, something really good. And yeah, dude, I’m not gonna sugar-coat it – you sucked at it. You sucked really fucking bad at it, but the thing is, families? They kind of…they forgive you for sucking, sometimes. Sometimes you get a couple redos before you get kicked to the curb and replaced by some serial killer, risen-from-the-grave uncle or a snot-nosed high school punk who’s been a werewolf for less than a hot second.”<br><br> There isn’t really a smile on Derek’s face (and lets face it, Stiles would fall ass-over-tits backwards off the stoop’s railing if Derek actually <em>smiled</em> at him), but there’s something that makes him look a little less dead around the eyes, something just a touch softer in the set of his shoulders, and Stiles really considers that as much of a victory as he’s going to get. Derek doesn’t look like he’s quite ready for speech, not yet, but Stiles is content to wait for him, content to sit on his little perch and let Sourwolf McGee sort through it all for a few minutes.<br><br> “So…” Derek trails off, visibly weighing the pros and cons of saying whatever’s hanging off the tip of his tongue.<br><br> Stiles heaves a long-suffering sigh, raising an eyebrow at the werewolf. “This may honestly be the only time I ever offer you a completely free pass to ask whatever you want, with absolutely no repercussions,” he lies, because Derek so rarely opens himself up to other people’s thoughts that Stiles knows he will never, ever deny him the opportunity. “Speak now, or forever hold you insane curiosity.”<br><br> “On a scale of groveling to purchasing many, many expensive presents, how bad is it in there?” Derek tries, and it’s precious the way he thinks he’s getting the harder question out of the way first.<br><br> “Scott and Lydia will require some extensive ass-kissing,” Stiles ticks them off on his fingers, “Jackson will throw a fake temper-tantrum and will promptly get over it as soon as you start paying attention to him. Erica and Boyd need to be reassured that you won’t kill them for leaving, so they won’t be too bad. Isaac just wants everyone to be one big happy family, so sell Scott on joining the club and you’ll kill two birds with one stone. And Danny…” Stiles smirked, reaching up to hook one finger in the hem of Derek’s t-shirt, hiking it up to reveal the aforementioned abs. “I’m 85% positive Danny’s the founder of a Facebook fan page dedicated entirely to these right here, so you’re all set with him.”<br><br> The corner of Derek’s lip looks lighter still, not quite a smile yet but not <em>as </em>heavy as it had been. He shifts forward slightly, just enough to be feasibly passed off as him redistributing his weight, but Stiles can’t help but notice it brings Derek closer, presses Stiles’ hand just a touch firmer into warm skin.<br><br> “What about you?” the Alpha asks quietly, and Stiles genuinely has to restrain himself from pinching Derek’s stomach as hard as he can possibly manage, because really, does he have to spell it out?<br><br> Yes. Apparently. He does.<br><br> (Never mind he himself is only just starting to grasp it, only just starting to understand. Erica knew. Isaac knew. Even Scott knew, a little bit. Derek should just <em>know</em>.)<br><br> “<em>Derek</em>,” Stiles groans, sliding his fingers down to hook into the belt loops of the werewolf’s jeans, tugging him forward into the space between Stiles’ thighs, pinning his hips in place with a gentle press of younger teen’s knees. “You <em>have</em> me. You’ve <em>always</em> had me, you absolute moron, how many physically impossible feats of life-saving heroics do I have to perform before you get it?”<br><br> “Jus – just so we’re clear on this,” Derek mumbles, looking down to where Stiles still has his hands, both of them now, hooked into his belt loops, “by have, you mean –”<br><br> Stiles cuts him off with a frustrated growl, yanking hard enough that Derek, in his surprise, stumbles forward, overbalancing enough to grab at the railing right next to Stiles’ hip and bring his face close enough that Stiles can reach up, reeling Derek in with a hand on his jaw and a smirk on his lips.<br><br> If he’d been forced to guess how this would go, because in the very, very deep back recesses of his subconscious Stiles <em>had</em> considered this as a possible outcome of their endless pigtail-pulling, he would have probably assumed violent and aggressive, tension snapping mid-argument like a rubber band to the face.<br><br> The kiss is soft, tentative, bordering on chaste. It’s only just long enough to be real, just definitive enough to be clear in its intentions. This is a <em>kiss</em>, and Stiles licks across Derek’s bottom lip before claiming the same spot with his teeth because he wants to be absolutely sure Derek can’t mistake this as anything else.<br><br> He breaks it off first, pulling back far enough that he can meet the werewolf’s stare without going cross-eyed but leaves his fingers firm against the rough stubble lining Derek’s jaw. It’s…he takes the moment to collect himself, allows Derek the chance to catch up while Stiles own brain is firmly slotting everything into place with a quiet sort of <em>oh</em>. It’s a sigh of relief and a surprised sort of wonder, that moment of soul-deep contentment when you twist the focus just right and suddenly everything’s in vivid, technicolor clarity.<br><br> “Traditionally,” Derek mumbles, and it’s only then that Stiles realizes the hand not bracing Derek against the railing has found its way to the short fuzz of hair on the nape of Stiles’ neck, “there’s a very specific position in the pack for someone like you.”<br><br> He opens his eyes, and Stiles is pleasantly surprised to see they’re completely void of any sign of alpha red. It’s better than he’d hoped for, really, because it means these words are Derek’s, not influenced by any wolfy instinct or Alpha politics, but genuinely <em>Derek’s</em>.<br><br> “Yeah,” Stiles nods, smirking up just a little bit into Derek’s heavy stare. “Yeah, I know.”<br><br> Derek shifts his weight foot to foot, pressing lightly into Stiles’ inner thighs and looking for all the world like Stiles has once again pulled the rug from under his feet, like Derek had had every intention of playing it down until Stiles had confirmed the futility of that effort.<br><br> Stiles resists the urge to laugh in his face. “I’m not saying we should go shopping for engagement rings yet,” (the battle to control himself is quickly becoming a lost cause; Stiles stifles a giggle into the older man’s shoulder when his face pales) “me being, you know, sixteen-year-old jailbait and all. Maybe I’m just saying that you don’t have to do this alone.”<br><br> Derek’s panic softens considerably, the pads of his fingers pressing into the muscle of Stiles’ neck until the teen pulls back enough to meet his eyes again.<br><br> “Yeah,” the Alpha says quietly, stroking his thumb down the line Stiles’ throat, “I’m starting to realize that.”<br><br> Stiles lets the moment hang, closing his eyes and soaking in the feeling of Derek’s thumb against the bumps and ridges and pale skin. He’s not sure he’s ever been so aware of another person’s presence, has been able to close his eyes and hear as Derek’s breathing quietly evens out, feel the ragged edge of a hangnail on Derek’s thumb, taste the foreign flavor still lingering on his bottom lip.<br><br> “So,” he clears his throat softly, opening his eyes to glance back up at Derek. “I’ve got a living room full of Betas and in-the-know humans that are eagerly looking forward to convincing you and Jackson to stand side by side with your shirts off.”<br><br> Derek looks like he’s not sure if Stiles is kidding or not, and the confusion is so painfully endearing that Stiles is genuinely baffled that he didn’t clue in on himself a little sooner. He takes pity on the Alpha, slipping his fingers from Derek’s belt loop to pinch the skin just above his waistband.<br><br> “I’m delighted to say I’m being completely serious about that. But for real, they’re desperately in need of an Alpha. So. You ready?”<br><br> Derek nods. And then, like one nod isn’t enough for him, he licks his lips and nods again. “Yeah,” he agrees. “Yeah.”<br><br> Stiles doesn’t bother with any kind of pomp and circumstance, nor does he bother trying to hide anything from the group of teens blatantly, <em>painfully</em> trying to pretend like they hadn’t just eavesdropped on the entire conversation. He leads Derek inside with loose fingers curled around the werewolf’s wrist, and he’s intrigued, but not entirely surprised, to notice that Danny has abandoned his place on the couch and resettled on the floor at Jackson’s feet, shoulders tucked between his best friend’s calves. Stiles heads for the couch and, after a lightning-fast eyes-and-eyebrows conversation with Erica, drops down in the space next to the arm, leaving a wide open cushion between himself and Erica.<br><br> Erica smiles tentatively at Derek, and while he doesn’t quite smile back, something in his expression must signal his forgiveness, because a bone-deep tension rushes out of Erica like she’s been holding it taut there for days. Derek settles an arm around her shoulders as she leans into him, and he uses the same hand to brush fondly over Boyd’s head.<br><br> There’ll be a conversation. There still needs to be, that much is clear. Not just Boyd and Erica; Jackson’s already shooting attention-starved stares Derek’s way, and some of the reluctance has returned to Scott’s expression. But they let it settle in the background for now, something that can be dealt with later, separately, sometime outside of this temporary truce.<br><br> “The important question,” Lydia says cautiously, and Stiles has never loved her more, “is whether or not vampires are real too.”<br><br> “No,” Isaac shakes his head, “the important question is whether or not they’re the Edward Cullen variety or the Count Dracula variety.”<br><br> “You versus Edward Cullen,” Danny challenges, “hand to hand combat. Who would win?”<br><br> “Jacob,” Boyd deadpans.<br><br> Laughter erupts around them, and just like that they’re back where they were, Derek’s arrival a forgotten interruption as Isaac loudly protests and Scott teases back.<br><br> On the couch cushion, in the scant space between Stiles’ propped up foot and Derek’s thigh, warm fingers find his hand and thread together with his own. Stiles squeezes Derek’s hand in response, shifting his weight just enough that their shoulders press together.<br><br> It’s not perfect. It’s not fixed, just like that. It’s still dangerous, still fragile. There are still loose ends – Allison isn’t gone for good, and Peter’s coming back too. Gerard’s body hasn’t been found, and Stiles already learned that lesson once this week. The Alpha pack is coming. But still, it’s something. It’s a start.<br><br> Stiles, slowly, exhales. </p>\n<p> </p>\n<p> </p>\n<p>\n<em>i carry your heart (i carry it in my heart)<br><br><br><br><br></em>\n</p>\n<p>\n<em>\n<br></em>\n<a href=\"https://thegloryof.tumblr.com/\" rel=\"nofollow\">tumblr</a>\n</p>"
}