{
  "id": "5317256",
  "url": "https://archiveofourown.org/works/5317256?view_full_work=true",
  "author": [
    "mikkimouse"
  ],
  "title": "A Wild Heart's Desire",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Original Child Character(s)",
    "Sheriff Stilinski",
    "Talia Hale",
    "Jordan Parrish"
  ],
  "additional_tags": [
    "Single Parent Derek",
    "Single Parent Stiles Stilinski",
    "Feral Derek",
    "Magic Stiles",
    "Domestic",
    "Past Jennifer Blake/Derek Hale",
    "mentioned Allison Argent/Scott McCall - Freeform",
    "POV Multiple",
    "Past Magic-Related Consent Issues (see end notes)",
    "Tattooed Stiles"
  ],
  "language": "English",
  "series": "",
  "published": "2015-11-30",
  "completed": null,
  "words": "13,410",
  "chapters": "1/1",
  "comments": "590",
  "kudos": "14,362",
  "bookmarks": "3,364",
  "hits": "156,437",
  "summary": "<p>If there's one thing Stiles Stilinski knows, it's that Deputy Derek Hale absolutely Does Not Like him. The only reason Derek even tolerates him is because their kids are worryingly codependent. </p>\n<p>So Stiles is understandably confused when a very feral Derek shows up in his backyard after a call gone wrong and proceeds to move in with him.</p>",
  "notes": "<p>Thank you to C and J for the beta. &lt;3</p>\n<p>See end notes for spoilery stuff about the consent issues.</p>\n<p><strong>ETA 12/6/15:</strong> For marguerite_26, one of the mods of this wonderful event! I only got a very tiny glimpse into what all you guys had to do, and can I just say WOW. I knew a lot of work went into putting on events like this, but the definition of \"a lot\" was WAY beyond what I thought. Thank you so, so much for your efforts in putting on the Fall Harvest, and I hope you enjoy this offering. &lt;3</p>\n<p>So this fic was based off <a href=\"https://mad-madam-m.tumblr.com/post/111803985990/paintedlandscape-replied-to-your-post-top-5\" rel=\"nofollow\">this prompt</a>, was meant to be only about 5k, and ballooned to 14k because I have absolutely zero ability to gauge how long a fic will be and I also don't know when to shut up. Thank you to jsea and bleep0bleep for betaing, and to spellwovennight, infectiouspunk, deleted-scenes, literaryoblivion, and ljummen for their tireless cheerleading and brainstorming help.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I very nearly named this \"Deer-ly Beloved\" because I think I'm hilarious.</p>\n<p>The \"Mrs. Delgado\" mentioned is Allison.</p>\n<p>Magic-related consent issues: Jennifer, Derek's ex, used magic on him and Amy to alter their memories and/or make them easier to deal with. That's all the detail the story goes into.</p>\n<p><strong>ETA 12/6/15:</strong> <a href=\"https://mad-madam-m.tumblr.com\" rel=\"nofollow\">Tumblr</a> and <a href=\"https://twitter.com/mad_madam_m\" rel=\"nofollow\">Twitter</a>!</p>",
  "text": "<p>Derek walked up to the little magic shop on the corner of Main and First and steeled himself at the front door. Even out here, he could smell the telltale scents of wards and herbs and potions, a combination that usually made him wrinkle his nose. </p>\n<p>Now it did not, and <em>that</em> was why he steeled himself. </p>\n<p>He pushed open the door, a bell chiming gaily as he did, and stepped into the shop. \"Amy?\" he called out. \"Where are you?\"</p>\n<p>\"In the back, Daddy!\" </p>\n<p>Derek suppressed a whine. He didn't want to walk all the way into the back. </p>\n<p>The magic shop was packed full, with scarcely room for a full-grown werewolf to move around. He stepped around a shelf crammed full of books that stank of magic, bumping into another shelf of multicolored glass vials filled with God only knew what. The vials clinked together ominously, and Derek froze, waiting to ensure none of them broke. When they didn't, he let out a relieved breath and slowly edged his way past the rows of sweet-smelling herbs, which never failed to make his nose itch. </p>\n<p>\"How could you ever find anything in here?\" he muttered to himself. \"This place is a mess.\" </p>\n<p>\"Good, because it needs to be incomprehensible to everyone <em>except</em> me,\" a new voice said. </p>\n<p>Derek did not jump, or growl, or give any other indication that he'd been <em>surprised</em>. Instead, he turned slowly and raised his eyebrows. There. No surprise whatsoever. </p>\n<p>Stiles, the owner of both the voice and the shop, crossed his hands over his chest and smirked. For a human, he was annoyingly perceptive. He also happened to be the father of Derek's daughter's best friend, which meant Derek had to deal with him on a daily basis. </p>\n<p>\"Well, well. Deputy Hale. Fancy seeing you here.\" </p>\n<p>Derek resisted the urge to roll his eyes, but only barely. \"I'm here to pick up Amy. Thank you for watching her.\" </p>\n<p>Stiles snorted and waved his hand. His long fingers were tattooed between each knuckle, some of the tattoos wrapping around his fingers like a ring. \"You're always so stiff about it. She loves Jack, Jack loves her, she keeps him occupied for two hours after school while I'm here and you're running around protecting the good city of Beacon Hills from all sorts of nefarious characters. I'm happy to do it. Besides, do you have any idea how much good childcare costs?\" He spread his arms wide. \"I am saving you so much of your deputy's salary, my friend.\" </p>\n<p>\"For which I am eternally grateful,\" Derek said dryly. He wouldn't have chosen the employee lounge of a magic shop as the place to leave his kid after school, but Amy loved it and the lounge itself was safe from any particularly worrisome magic. \"Now can I have my daughter back, or did you turn her into a newt or something?\" </p>\n<p>Stiles pressed a hand to his chest and gasped, scandalized. \"How <em>dare</em> you imply that I would do such a thing, you <em>heathen</em>. Everybody knows you turn werewolf kids into sheep. It's funnier that way.\" </p>\n<p>Derek could see the joke coming a mile away. \"Because it's a wolf in sheep's clothing?\" </p>\n<p>Stiles pouted. \"You know, it's no fun when you make the jokes before I do.\" </p>\n<p>\"Maybe that's a sign you should get new jokes.\" </p>\n<p>\"Maybe it's a sign I'm starting to rub off on you,\" Stiles shot back. </p>\n<p>He was, but Derek would never, ever, in a million years admit it. Stiles was infuriating, and annoying, and too damn smart for his own good. He also had the terrible habit of being stupidly beautiful and wiggling his way under Derek's skin and staying there. Every time they were around each other, Derek felt wrong-footed and off-balance. He was pretty sure the only reason he hadn't been fired was because the sheriff preferred to ignore it. </p>\n<p>He didn't <em>like</em> being off-balance, but Stiles seemed to relish poking at him until he got there. </p>\n<p>\"My daughter?\" Derek said again. The sooner he could get out of here with Amy, the better. </p>\n<p>Stiles tilted his head toward the back of the store. \"She's helping Jack clean up the lounge. She'll be along in a minute.\" He batted his eyelashes flirtatiously. \"Why, one would think you're trying to get rid of me, Deputy Hale.\" </p>\n<p>\"Gee, what gave you that idea?\" </p>\n<p>\"Oh, come on!\" Stiles went around behind the counter and pulled out some shoeboxes filled with God knew what. \"I'm not that bad.\" </p>\n<p>He wasn't that bad, Derek knew, or else he'd never have let Amy stay with Stiles unattended for even a second. But still... \"What are you making now? Love potions? Luck spells? Please, Mr. Stilinski, help me pass my test tomorrow?\" </p>\n<p>The playful nature vanished, and Stiles's golden eyes snapped with fire. It may even have been literal fire; Derek wasn't a hundred percent sure. \"Wow, looks like someone hasn't paid any attention to magical law for the last <em>hundred years</em>, because love spells are <em>still illegal</em>. And even if they <em>weren't</em>, I'd never make any spell to compromise consent.\"</p>\n<p>\"No, but you can make spells to hold a werewolf in place. Kill someone with a thought. Burn a family alive with a snap of your fingers.\" Derek glared. \"When the line between what's 'good' and what's 'bad' magic is so close together, how can you tell when you cross it?\" </p>\n<p>\"Oh, so magic should be forbidden just because it's a tool some people misuse?\" Stiles didn't back down an inch. \"Then I suppose you think werewolves ought to be classified as lethal weapons again?\" </p>\n<p>Derek growled. \"That's not the same thing, and you know it.\" </p>\n<p>\"What I find <em>interesting</em>, deputy, is that you have all this to say about magic, and yet you still leave your daughter with me every afternoon without fail.\" Stiles drummed his fingers on the counter. \"My only conclusion is that even if you hate magic, you must trust me on some level.\" </p>\n<p>Derek cleared his throat and looked away. \"Amy likes Jack. And my boss gave you a good recommendation, for some unfathomable reason.\" </p>\n<p>\"Your boss is my father. Of course he's going to give me a good recommendation.\" Stiles pulled out little pouches of powder and poured them into a set of a dozen vials sitting out on the counter. \"So come on, Hale. What is it? Is it the magic you hate, or me?\" </p>\n<p><em>Both. I hate magic, and I hate what you're doing to me. </em>Derek realized his fists were clenched, and he shoved them into the pockets of his uniform. He couldn't admit any of that to Stiles, though, not without admitting to...other things. Things he wasn't acknowledging now or ever. </p>\n<p>He'd been through this once. He was <em>not</em> going through it again. </p>\n<p>\"Daddy!\" Amy came running out of the back of the store, saving Derek from having to answer. \"Daddy, want to see the books I got out of the library today?\" </p>\n<p>Derek crouched down and scooped her up, hugging her close. Amy rubbed her face on his beard and neck, replacing the smell of the school and the shop with their own little pack-scent. Derek nuzzled her back, pleased. \"I would love to see the books. How many did you get?\" </p>\n<p>\"Like <em>eight</em>.\" Amy's green eyes were huge with the thought of the bounty. \"It's going to be <em>awesome</em>.\" </p>\n<p>\"I bet. Pick one for us to start reading tonight,\" he said, setting her back down. \"And say thank you to Mr. Stiles for watching you.\" </p>\n<p>Amy spun around and curtsied, daintily holding out the sides of her favorite pink skirt. \"Thank you for letting me come and play with Jack, Mr. Stiles.\"</p>\n<p>Stiles bowed and produced a red rose from thin air. \"It was a pleasure, Miss Hale. Please let your father know he's welcome to play anytime as well.\" </p>\n<p>\"He can't,\" Amy said. \"He has to work and keep the city safe. He's better than Batman.\" </p>\n<p>Stiles snorted, and his eyes skated back over to Derek. \"Well, he's certainly got a better uniform.\" </p>\n<p>Derek felt his cheeks heat at Stiles's scrutiny, and he grabbed Amy's hand. \"Come on, kiddo. Let's head home so we can get dinner. Thank you again, Stiles.\" </p>\n<p>\"Bye!\" Amy called cheerily, waving behind them as Derek tried very hard not to drag her out of the store. </p>\n<p>Once outside, Derek didn't stop moving until they were at his truck, parked half a block away from the magic shop. He took in deep lungfuls of air, grateful to be away from the oppressive scent of magic and even more grateful to be away from the intriguing scent of Stiles. </p>\n<p>Amy clambered into the car, babbling about the books she'd finished last week and the books she'd picked up this week from the library. Then she launched into a long story about how Joey Thompson let loose Mrs. Delgado's class rabbit after recess. </p>\n<p>Derek let the words wash over him, the familiar sound of her daily recitation filling the cab of the truck and easing the tension he'd felt since he'd walked into the shop to pick her up. He hated dealing with magic, hated even more that he <em>didn't</em> hate Stiles, and those two warring emotions were worse for him than if he just had to deal with disliking Stiles outright. </p>\n<p>\"And do you know where they <em>found</em> the rabbit? Principal Yukimura's office!\" </p>\n<p>Derek pressed his lips together, fighting a smile. He wondered what Kira's dad had had to say about finding a rabbit in his office. \"You don't say.\"</p>\n<p>\"Uh-huh!\" Amy nodded. \"Yeah, and then—\" </p>\n<p>The radio in Derek's truck crackled to life. \"Hale, you there?\" </p>\n<p>Derek pulled over to the side of the road and grabbed the radio off the dash. \"Yeah, Parrish, what's up?\" </p>\n<p>\"We've got a seven-oh-seven-William out by the Preserve.\"</p>\n<p>\"Shit,\" Derek muttered, and then cast a glance at Amy. \"Don't repeat that.\" </p>\n<p>Amy zipped her lips. </p>\n<p>\"Don't repeat what?\" Parrish asked. </p>\n<p>\"I've got Amy with me,\" Derek explained. \"Let me drop her off, and I'll meet you at the Preserve in fifteen.\" </p>\n<p>\"Ten-four. See you there.\" </p>\n<p>Derek set the radio back on his dash and pulled into the first parking lot he could find. Seven hundred codes meant supernatural crimes, and a 707W meant reports of illegal magic, most likely a witch. Laura was out of town until Saturday, so Derek couldn't leave Amy with her, and his parents were both at an event in San Francisco and wouldn't be back until tonight at the earliest. </p>\n<p>That left just one person. </p>\n<p>Derek bit his lips to keep from uttering another curse in the presence of his seven-year-old daughter, and turned back toward Stiles's shop. </p>\n<p>Stiles was locking up when Derek rolled up, while Jack jumped around on random leaves on the sidewalk. Derek parked haphazardly next to Stiles's beat-up old Jeep. \"Stay here for one minute,\" he ordered Amy, and jumped out of the car.</p>\n<p>Her eyes were wide and round with fear. \"Daddy?\"</p>\n<p>Derek leaned back into the cab. \"Hey, listen. It's going to be fine. I have to go back to work, so I'm going to see if Mr. Stiles can watch you. You'll get to play with Jack for the night. That'll be fun, right?\"</p>\n<p>Amy nodded, eyes still huge. </p>\n<p>Okay. It would be fine. Derek shut the door and jogged over to where Stiles was standing on the sidewalk, frowning at him. \"You guys forget something?\" he asked. </p>\n<p>Derek shook his head. \"I just got called in. I hate to ask, but—\" </p>\n<p>\"Put Amy's stuff in the Jeep,\" Stiles said. \"She can stay the night, if she needs to.\" </p>\n<p>\"Sleepover?\" Jack asked.</p>\n<p>Stiles rubbed a hand over his son's dark buzz cut. \"Yeah, kid. That cool with you?\" </p>\n<p>Jack jumped up and down. \"Yes! Can we have dinosaur nuggets and mac and cheese and watch <em>The Land Before Time</em>?\"</p>\n<p>\"Yes, yes, and ask Amy what she wants to watch.\" Stiles pushed him toward the Jeep. \"Go get in the car, bud.\" </p>\n<p>\"Okay!\" Jack ran over to the Jeep, shouting for Amy. </p>\n<p>Derek rubbed his hand over his face. \"I'm sorry, I hate to spring this on you, but—\"</p>\n<p>Stiles waved the protest away. \"Dude, you're talking to the son of the sheriff. You think I don't know how this goes?\" </p>\n<p>\"Thank you,\" Derek said, and meant it down to his bones. </p>\n<p>\"What's the code?\" Stiles asked. </p>\n<p>He debated all of two seconds before answering. Besides, Stiles would probably call his dad to find out anyway. \"Seven-oh-seven-William.\"</p>\n<p>Stiles blanched. \"Shit.\"</p>\n<p>\"Yeah.\" </p>\n<p>\"Hey.\" Stiles grabbed his arm, face uncharacteristically serious. \"Be careful, okay?\" </p>\n<p>Stiles's scent warmed with concern and a new spicy-calming note Derek didn't recognize. For the span of a heartbeat, it felt like the moment had weight, like there was something physical between them. It wasn't magic—or at least, it didn't smell like magic—but it was almost tangible nonetheless. </p>\n<p>Then Stiles let go of him, mouth twisting back into a smirk. \"I'd hate for something to happen to my dad's favorite deputy.\"</p>\n<p>He failed completely at an unaffected tone. Derek decided now was not the time to call him on it.</p>\n<p>Instead, he nodded. \"Thanks for taking Amy. I'll let you know when I can pick her up.\" </p>\n<p>Stiles smiled. \"She's welcome to stay as long as she needs to.\" </p>\n<p>Derek got Amy moved from his truck to Stiles's Jeep in record time and kissed her forehead. \"We're going to start that book tomorrow night, okay, kiddo?\" </p>\n<p>Amy sniffled. \"Okay.\" </p>\n<p>Derek hugged her tight. \"Love you.\" </p>\n<p>\"Love you too,\" she said into his neck, her voice muffled. </p>\n<p>And then Derek left his daughter with one witch to go face down another.</p>\n<p align=\"center\">***</p>\n<p>Stiles drove back to his house with one very excited five-year-old and one very frightened seven-year-old who was desperately trying not to show it. He drove calmly, talking as normally as he could, but he let Jack's unbridled excitement at the potential sleepover fill the car. His kid was so much like him it was unreal.</p>\n<p>He unloaded the kids at his house and ushered them both inside, checking the wards on his front door by habit. If it was a witch out at the Preserve, he probably needed to check all his wards. \"Jack, put your backpack up, and I want your playroom clean in five minutes if you and Amy want to watch a movie.\" </p>\n<p>\"Okay!\" Jack shouted, stampeding up the stairs. Who the hell knew a five-year-old could make so much noise?</p>\n<p>Amy started to follow, but Stiles grabbed her shoulder. \"Hey, Amy.\"</p>\n<p>She looked up at him, her pale green eyes swimming with tears. </p>\n<p>Stiles crouched to put himself closer to her level. \"Hey, I know it's scary. My dad used to be a deputy just like yours, and he had to go out on calls like this all the time. But you know what? He always came back. And,\" he tapped a finger on Amy's nose, \"I love my dad, but he is not better than Batman.\" </p>\n<p>Amy hugged herself, but didn't say anything. </p>\n<p>\"Your dad's a werewolf, and he's a very good deputy,\" Stiles continued. \"He's going to be fine, and he's going to come back here tomorrow to pick you up, and we're all going to have breakfast together, okay?\" </p>\n<p>Amy sniffled, but her trembling lips turned up into a smile and she nodded. </p>\n<p>\"Okay.\" Stiles ruffled her hair. \"Go give Jack a hand. I think he got distracted playing.\" </p>\n<p>She nodded again and darted up the stairs. </p>\n<p>Stiles sighed and looked out east, in the direction of the Preserve. <em>You'd better not make a liar out of me, Derek Hale</em>, he thought, and went to heat the oven for dinosaur chicken nuggets.</p>\n<p align=\"center\">***</p>\n<p>He got the kids fed, helped Amy with the handful of math problems she had to do for school, and then let them put down a bunch of blankets and sleeping bags in the living room to watch movies until they fell asleep. It was a special night, he reasoned, and anything that took Amy's mind off the fact that they still hadn't heard from Derek was a good thing. </p>\n<p>Stiles made it until 8:30 before texting his dad. </p>\n<p>\n<b>To: Pops</b><br>\n<em>Hey, have you heard from Derek and Parrish?</em>\n</p>\n<p>\n<b>From: Pops</b><br>\n<em>Not yet. Just sent out another team as backup.</em><br>\n<em>I'll call you when I hear.</em>\n</p>\n<p>\n<b>To: Pops</b><br>\n<em>Thanks. Love you.</em>\n</p>\n<p>\n<b>From: Pops</b><br>\n<em>Love you too.</em>\n</p>\n<p>He tried not to look at his phone, but the longer they went without getting a call, the antsier Stiles got. He checked the wards on his house four times, cleaned the kitchen, cleaned the bathroom, picked up everywhere in the living room except the pallet where the kids were now passed out, Amy having moved close enough to cuddle Jack in her sleep. Stiles snapped a quick picture. Derek would love it.</p>\n<p>If the asshole could be bothered to let them know he was okay, that was. </p>\n<p>At nearly 11pm, his phone rang, and Stiles damn near jumped out of his skin trying to answer it. \"Hey, Dad! Dad, what's going on? Where's Derek?\" </p>\n<p>\"Stiles, calm down.\" </p>\n<p>Stiles recognized that voice. That was his serious sheriff voice. He dropped into a chair at the kitchen table, heart pounding ferociously. \"Dad?\" </p>\n<p>\"Derek and Parrish had the witch cornered, but she got a spell off. Derek pushed Parrish out of the way. It didn't kill him, but...\"</p>\n<p>\"But?\" Stiles prodded, when his dad didn't finish, the relief at <em>it didn't kill him</em> fading fast. </p>\n<p>\"It forced him into his beta shift,\" Dad said. \"He attacked Parrish and ran off.\" </p>\n<p>\"Shit.\" Stiles glanced back into the living room to make sure the kids were still asleep, and then whispered, \"He's <em>feral?</em>\"</p>\n<p>\"Looks that way. We've got the witch in custody and other patrols going after him. Do <em>not</em>, under any circumstances, leave your house.\" </p>\n<p>\"But Dad!\" Stiles protested. \"His daughter is here. You know feral wolves, they hole up in a den and protect their family. He's going to come looking for Amy.\"</p>\n<p>There was silence on the line for all of ten seconds, and then his dad said, \"You mean to tell me Amy is <em>with you</em>? Stiles—\" </p>\n<p>\"Dad, I'll be fine,\" Stiles cut in. \"I can handle a feral werewolf. In fact, it might be better if he heads this way.\" </p>\n<p>\"I didn't hear that. I did not hear my <em>only son</em> speculate that he should be <em>werewolf bait.</em>\"</p>\n<p>Stiles was already at his back windows, checking the yard. He was on the edge of his neighborhood, closest to the Preserve, but it was still a pretty good distance away. \"I can handle him, and if I've got him here, then he's easier for you to contain. <em>And</em> you know he's not going to hurt unsuspecting citizens.\"</p>\n<p>His dad made a noise that was unhappy, but wasn't entirely disagreement. \"He's dangerous, Stiles.\" </p>\n<p>\"More dangerous to other people than to me.\" Stiles calculated the distance from the Preserve to Derek's house in his head. \"Okay, he's probably already made it to his place and realized Amy isn't there. He'll be tracking her. I'm going to set up my wards and see if I can get him over here.\" </p>\n<p>\"For God's sake.\" </p>\n<p>\"Dad,\" Stiles said firmly. \"You know I can do this.\" </p>\n<p>There was a soft curse on the other end, and then his dad groaned. \"Okay. Do it. But I'm sending a patrol to your neighborhood right now.\" </p>\n<p>\"Okay, that's fine. Just stay back from my house until I have him contained here.\" His backyard was still quiet, but Stiles knew better than to think that meant anything. \"I've got to go, Dad. I love you.\" </p>\n<p>\"Love you too, son.\" </p>\n<p>Stiles hung up and crept into the living room, grabbing Amy's discarded clothes from beside her backpack. Derek would be tracking her by scent, so the best hope was to try and get him here before he made the rounds to the school, the shop, or the rest of the town.</p>\n<p>He eased out the back door with Amy's clothes in hand. When he was just beyond the wards edging around his house and garden, he hung the clothes on top of the swing set. Then he drew a sigil in the air over them and blew it on the wind, carrying her scent further and faster than it would have gone on its own. </p>\n<p>Then he rolled up his sleeves, his tattoos glowing faintly in the light of the full moon, and sat on the back porch to wait. </p>\n<p>He didn't have to wait long. Within five minutes, he heard a shuffling outside of his back gate and a low growl that sent a chill down his spine. </p>\n<p>Stiles's heart kicked into high gear, and he stood slowly, not taking his eyes off the gate. </p>\n<p>A shadow jumped over it, landing hard at the edge of Stiles's garden. It was Derek, wearing only a pair of tight black boxer briefs, eyes electric blue and fangs bared. He dug his claws into the ground and kept his eyes fixed on Stiles. The growling got louder.</p>\n<p>Stiles took a deep breath and held up his hands, showing that he was unarmed. \"Hey, Derek. I heard you were having a rough night.\"</p>\n<p>He took two tentative steps forward. Derek snarled, and Stiles stopped moving. His heart was pounding so hard Derek <em>had</em> to hear it, but Stiles kept his voice calm and even. \"Okay, dude. I'm not coming any closer. Looks like you got rid of your deputy's uniform, huh?\" </p>\n<p>Derek remained where he was, tense and ready to spring. Stiles swallowed a few times, hoping to wet his throat. \"Amy's inside. She's asleep right now. You left her with me, remember? You had to go out to the Preserve to stop a witch, so Amy came home with me and Jack.\" </p>\n<p>Derek couldn't understand him; Stiles <em>knew</em> Derek couldn't understand him, but talking was what he was good at, so he kept talking. \"They watched <em>Frozen</em> and <em>Finding Nemo</em>. I think Jack was disappointed that she wouldn't watch <em>The Land Before Time</em>, but he's still so excited about having her sleep over that I don't think he was too upset. Besides, there were chicken nuggets and mac and cheese, because I am a <em>fantastic</em> cook.\"</p>\n<p>Stiles glanced back toward the house, where Amy and Jack were safely ensconced, and when he flicked his eyes back to Derek, Derek had halved the distance between them. </p>\n<p>Shit. Stiles needed to be more careful about that. Derek sniffed the air, brow furrowed like he couldn't quite make sense of what was going on.</p>\n<p>Stiles attempted to move forward again, slower than molasses, trying to get close enough for his spell. Just to contain Derek until the deputies could get here and they could make the witch reverse her spell. He just needed to be a little bit closer...</p>\n<p>Derek suddenly dove forward and smashed his face into Stiles's crotch, hard enough to knock Stiles over, but thankfully just off-center enough that his dick was unharmed. He barely had time to think <em>what the actual fuck</em> when Derek growled and nuzzled fiercely and <em>fucking God now was not the time to be getting a hard-on.</em></p>\n<p>Stiles struggled to sit up, which was harder than it sounded with a feral werewolf's face two inches from his dick. Derek took that in stride, and moved from mashing his face in Stiles's crotch to mashing his face in Stiles's <em>neck</em>.</p>\n<p>\"Whoa, there, easy boy,\" Stiles said weakly, one hand hovering over Derek's head. \"Be, ah, be careful with those razor sharp teeth right next to my delicate, fragile skin.\" </p>\n<p>Derek's response was to fucking <em>lick his neck</em>.</p>\n<p>\"Oh my God, are you <em>scenting me</em>?\" Stiles blurted out.</p>\n<p>Derek growled so low it was more of a rumbling purr, and then alternated between dragging his face over Stiles's neck and dragging his tongue over the same spot. </p>\n<p>Stiles had never heard of a feral werewolf scenting someone who wasn't a family member. This was completely fucking <em>ridiculous.</em> </p>\n<p>\"Okay.\" He tried to push Derek off of him, but it was about as effective as pushing at a baby elephant. \"Okay, <em>okay!</em>\"</p>\n<p>At the last one, Derek backed off, hanging his head. It was pathetic and fucking <em>adorable</em>. </p>\n<p>Stiles cautiously reached out to run his fingers over Derek's head, and Derek leaned into the touch, making the happy rumble-growl again. </p>\n<p>\"Okay,\" Stiles said, because there really wasn't anything <em>else</em> to say. He was busy rethinking his plan. \"Come on inside, dude, because I imagine you're going to want to see Amy.\"</p>\n<p align=\"center\">***</p>\n<p>\"What do you <em>mean</em>, he's asleep on your living room floor?!\"</p>\n<p>Stiles winced at the volume of his dad's yell. \"I mean he's curled up around his daughter and snoring like a freight train, what do you think I mean? Here, look.\" Stiles took a picture with his phone and texted it to his dad. \"It's adorable.\" </p>\n<p>\"I can't believe you're using 'adorable' to describe a feral werewolf,\" Dad said. \"No, wait. Yes, I can. What I <em>can't</em> believe is that you're letting a feral werewolf sleep two feet away from your <em>son!</em>\"</p>\n<p>Derek twitched in his sleep, like he could hear the conversation on the phone, and Stiles hoofed it out of the living room and into the downstairs bathroom. \"Do you really think I would let him in my house if I hadn't taken <em>every</em> precaution? Seriously, Dad. Have a little faith in me.\" </p>\n<p>\"<em>Feral</em>,\" his dad repeated, like Stiles wasn't well aware. </p>\n<p>\"Look, I'm telling you. He came straight into my backyard, scented the <em>fuck</em> out of me, followed me inside, shuffled in a circle on the pallet with the kids, then flopped next to Amy and fell asleep. It was the most anticlimactic dealing I've ever had with a feral werewolf.\" </p>\n<p>\"This is the <em>only</em> dealing you've ever had with a feral werewolf!\" </p>\n<p>Stiles wanted to bash his head against the wall. He was twenty-eight years old, for God's sake. He knew how to adult at least a little. \"Dad, I swear. I don't know what it is, but he doesn't see me as a threat. He doesn't see Jack as a threat. If he did, he wouldn't be <em>sleeping on my living room floor. </em>I would be dead in the backyard.\"</p>\n<p>\"Don't <em>say</em> things like that, for God's sake. You're going to give me a heart attack.\" </p>\n<p>Stiles could practically <em>hear</em> his dad rubbing his forehead, and changed his tactics. \"Look, Dad. We have no idea how he'll react to anyone else, but for whatever reason, he's totally chill with me. He can stay here tonight and we can get the witch to break the spell in the morning. Or, hell, I can figure out how to break the spell. It might take longer, but I can do it.\" </p>\n<p>\"I don't like this,\" Dad grumbled. </p>\n<p>\"Yeah, I couldn't tell.\" </p>\n<p>\"<em>Stiles</em>.\"</p>\n<p>\"<em>Dad.</em>\" </p>\n<p>There was silence on the phone for a few seconds, and then Dad muttered, \"Fine. God, I can't believe I'm agreeing to this.\" </p>\n<p>Stiles sagged against the bathroom wall, letting out a breath he hadn't realized he'd been holding. \"Thank you.\"</p>\n<p>\"Please don't make me regret this.\"</p>\n<p>\"I won't.\" Stiles considered. \"Oh, by the way, you might want to have someone go look through the Preserve for his gun. I guess belts aren't all that comfortable when you're half-shifted.\" </p>\n<p>He actually heard his dad's facepalm over the phone. \"Oh, for God's sake.\"</p>\n<p align=\"center\">***</p>\n<p>Stiles fell asleep on the couch not long after he hung up with his dad. He'd thought about going to bed, but fuck it, everybody else was in the living room and he'd seen Derek getting twitchy as he was getting ready for bed. Stiles guessed he wanted to keep everyone in the same room, because as soon as Stiles settled on the couch, Derek burrowed into the pallet and relaxed in a boneless heap. </p>\n<p>Stiles didn't think he was going to sleep well, but he closed his eyes, and the next thing he knew, Jack was poking at his cheek. </p>\n<p>\"What is it, kiddo?\" Stiles asked, his voice rough with sleep. </p>\n<p>\"Mr. Derek's a wolf,\" Jack said, sounding remarkably unconcerned about it. </p>\n<p>Stiles sat up and rubbed his eyes. \"Yeah, bud, I know.\"</p>\n<p>\"He's only wearing <em>underpants,</em>\" Jack said. \"Can I wear only underpants?\" </p>\n<p>\"No,\" Stiles said firmly.</p>\n<p>Jack whined. \"But Daddy, Mr. Derek's doing it!\" </p>\n<p>\"Dude, we are not basing clothing decisions off of what Mr. Derek's doing right now, okay?\" Stiles swung his feet over the side of the couch so he was sitting on it normally. \"Go wake Amy up and see what she wants to have for breakfast. What time is it, anyway?\" </p>\n<p>\"It's eight-thirty,\" Jack said. </p>\n<p>\"Eight—\" Stiles cut himself off and grabbed his phone. <em>Shit</em>. \"Oh, sh—seabiscuits. Jack, go grab your stuff. We need to get to school.\" </p>\n<p>\"What about Amy?\" </p>\n<p>\"Have her get her stuff too.\" Stiles paused, and tried to imagine taking her away from a feral werewolf, even if it was just to go to school. \"Scratch that. Amy gets to have a day off.\"</p>\n<p>Jack pouted. \"That's not fair!\" </p>\n<p>Stiles rolled his eyes to the heavens. \"Mr. Derek isn't your dad. I am. And I since I'm not going to rip anyone's heads off for getting near you, I say you're going to school. Go get your things.\" </p>\n<p>\"But I don't—\"</p>\n<p>\"Jonathan Michael Stilinski, if you throw a temper tantrum right now I am going to ground you for the next two weeks.\" Stiles pointed to the stairs. \"Go get ready for school.\"</p>\n<p>Jack's lower lip trembled, but he stomped his way up the stairs, jumping twice on the squeaky step. Stiles sighed and rubbed his forehead. He hadn't even been awake ten minutes and he was already getting a headache. Today was going to be fantastic. </p>\n<p>\"How come I don't have to go?\" </p>\n<p>Stiles looked up and saw Amy sitting up from her side of the pallet. Derek was still asleep, snuffling into the blankets. </p>\n<p>Stiles hesitated. He wasn't entirely sure how to explain this. \"Well, your dad's a little, um...\" </p>\n<p>\"Weird?\" Amy supplied, with a sideways glance at him. </p>\n<p>\"Yeah.\" Stiles wiped his hand over his face. Shit, he needed coffee before he got into the Jeep. \"He's a little weird right now, and he's going to be very unhappy if you aren't with him. So, until he's less weird, you're going to have to stick pretty close to him. Is that okay?\" </p>\n<p>Amy nodded and scratched Derek's head. He rumbled happily.</p>\n<p>Jack stomped back down the stairs, wearing his shirt inside out and his shoes on the wrong feet and his backpack half-open with all the stuff spilling out of it. Well, at least he was dressed. </p>\n<p>He glared mutinously at Stiles. \"It's not fair. You're mean.\"</p>\n<p>Stiles sighed and stood. \"Yeah, I'm the Wicked Witch of the West. Let's go. Amy, I'll be back in about fifteen minutes, okay?\"</p>\n<p>She grinned at him. \"Okay, Mr. Stiles!\" </p>\n<p>Stiles had just opened the door to the garage when Amy yelped, something loud thudded across the floor, and the next thing he knew, Derek was shoving him and Jack back toward the living room. </p>\n<p>Stiles almost whacked his hip on the edge of the kitchen table. \"Derek, what the hell?\"</p>\n<p>Derek whined, eyes wide in distress, and pushed him again. </p>\n<p>\"Mr. Derek wants us to stay!\" Jack kicked off his shoes and threw his backpack against the wall. \"Amy, Amy, Mr. Derek doesn't want us to leave! Wanna go play upstairs?\" </p>\n<p>\"Jack, wait!\" Stiles called out, but he heard the familiar thumps of two kids running upstairs. <em>Awesome.</em><br>\n<br>\nHe turned back to glare at Derek, still crouched on the kitchen floor in front of him, looking pathetic. \"I hope you're happy,\" Stiles said, digging his phone out of his pocket. \"We're going to have a talk about this when you get back to normal.\"</p>\n<p>Derek headbutted him in the hip in response. </p>\n<p>\"Fine, fine, I'm moving.\" Stiles walked back toward the living room, Derek right at his heels, as he scrolled through his phone for Allison's number. Predictably, it went to voicemail. \"Hey, Ally, it's Stiles. Jack and Amy Hale aren't going to be able to make it to school today, so if you could grab any schoolwork for them, that would be fantastic and I would owe you a million dollars or at least two weeks of babysitting for you and Scott. I'll talk to you later.\"</p>\n<p>He sat back on the couch, and Derek crawled up beside him, flopping face-down over his lap. Stiles grunted at the upper body weight of a 200-pound werewolf landing on him. \"Holy <em>crap</em>, dude.\" </p>\n<p>He thumbed through his phone to call his dad, absently running his fingers through Derek's hair as the phone rang. Derek nuzzled his stomach and rumbled happily. </p>\n<p>Dad picked up on the third ring. \"Please tell me no one's dead.\" </p>\n<p>\"No one's dead,\" Stiles said. \"No one's even injured. I am, however, currently stuck in my house, because Derek isn't letting anyone leave.\" </p>\n<p>\"He's not letting anyone leave,\" Dad repeated. </p>\n<p>\"Yes.\" </p>\n<p>\"Derek Hale, as a feral werewolf, is holed up at <em>your house</em>, after scenting you, and he's not letting anyone leave.\" </p>\n<p>\"That's your judging voice, Dad.\" </p>\n<p>\"Is there something you want to tell me about the nature of your relationship with Derek Hale, son?\" </p>\n<p>Stiles squawked. \"<em>What?</em>\"</p>\n<p>\"I'm not mad,\" Dad said. \"I know you'll tell me about this stuff in your own time. But I was under the impression that you two weren't actually—\"</p>\n<p>\"We're not!\" Stiles flailed and remembered the giant half-naked hunk of werewolf currently sprawled across his lap. \"We're not,\" he repeated, a little more quietly. \"He doesn't even like me. He tolerates me because Jack and Amy are friends.\" </p>\n<p>\"Uh-huh,\" Dad said skeptically. \"Not to dismiss your observational skills, son, but every conversation we've had in the past twelve hours leads me to think the opposite.\" </p>\n<p>Stiles threw his head back against the couch. \"Believe me, I'm just as lost as you are.\" </p>\n<p>\"Well, I'll see if we can get the witch over there to break the spell,\" Dad said. \"I imagine you and Derek are going to have a lot to talk about once he's, uh, more himself.\" </p>\n<p>Stiles looked down at his lap, where his fingers were buried in Derek's ink-black hair. Derek had somehow wiggled an arm around his waist and was nosing at the strip of skin between Stiles's shirt and pants. \"Yeah, you can say that again.\"</p>\n<p align=\"center\">***</p>\n<p>Really, Stiles shouldn't have been surprised when the witch refused to come undo the spell, even though the deputies reminded her repeatedly that doing so would help her get a lighter sentence.</p>\n<p>By that time, the area that Derek allowed them to be in had expanded to include the backyard, and he and Jack and Amy were running around chasing each other, Derek snapping playfully at their heels. It was startlingly domestic, if one ignored that Derek was wolfed out and half-naked.</p>\n<p>\"Is the spell something you can break?\" Dad asked him on their next phone call. </p>\n<p>\"Probably,\" Stiles said. \"It'll take me a little longer, though. And I have to do some research first.\" </p>\n<p>\"Will the kids be okay if you do it there?\" </p>\n<p>\"Yeah. I'll just need them to stay upstairs in Jack's room until it's finished.\" Stiles watched the way Derek grabbed Jack and Amy up under each arm and rolled with them, the two kids screaming with laughter. \"I'll be able to do it by tomorrow, I think.\" </p>\n<p>\"Are you two going to be okay with this, son?\"</p>\n<p>\"Yeah,\" Stiles said. \"I mean, I am. I'm fine. I'm just not sure what Derek's going to think when it's all said and done.\" </p>\n<p>\"Okay,\" his dad said, the skepticism evident once again. </p>\n<p>\"Dad, for the fifth time, if we were dating, I would have told you!\" Stiles burst out. \"I wouldn't be lying about it. Not <em>now</em>.\"</p>\n<p>\"I know that,\" Dad said. \"But do you want to be?\" </p>\n<p>\"I...\" Stiles raked his hand through his hair. \"I don't know.\" </p>\n<p>Dad hmmed on the phone. \"Well, for what it's worth, I think it's pretty clear Derek doesn't hate you as much as you think he does.\" </p>\n<p>Stiles watched the werewolf in question roll on the ground, letting Jack and Amy jump on him. The sight did things to him, and he shut those feelings down as ruthlessly as he could. \"Okay. I'll let you go. I'll send you a text once I've finished my research. I think I've got everything I need here, so I can probably do the spell late tomorrow morning or early afternoon.\" </p>\n<p>\"Okay, kid. I'll take you and Jack out for breakfast on Saturday after all this has settled down. Sound good?\" </p>\n<p>Stiles felt, not for the first time, pathetically grateful for his father. \"Thanks, Dad. You're the best.\"</p>\n<p>\"And I've got five coffee mugs that prove it.\"</p>\n<p align=\"center\">***</p>\n<p>After another half-hour of playing outside, Stiles ushered everyone in so he could get Jack and Amy lunch. They were more than happy to have dinosaur-shaped chicken nuggets and mac and cheese for yet <em>another</em> meal, but Stiles cut up some celery and apples in an effort to make it somewhat healthier. </p>\n<p>Derek turned up his nose at both the nuggets and the mac and cheese, and Stiles finally cracked open his freezer and found two steaks he'd bought a month or so ago. He stuck one steak in the fridge and defrosted the other in the microwave, and then tossed it into a skillet until it was brown on both sides. </p>\n<p>\"I was saving these for a special occasion,\" he groused, putting the steak on a plate. \"You'd better appreciate this.\" </p>\n<p>Derek ripped into the steak happily, the juices dripping down his chin. </p>\n<p>Stiles rubbed his forehead. \"Okay. Research time for me. Jack, you and Amy can play in your room or put on a movie. You,\" he pointed to Derek, \"don't break anything.\" </p>\n<p>Derek took another massive bite of steak and growled.</p>\n<p align=\"center\">***</p>\n<p>The one bad thing about magical research was that it was so damn detail-oriented. It was far too easy for Stiles to lose focus and get distracted by something shinier and less mind-numbing. Even so, he managed to plow through a half-dozen websites and five of his books related to counterspells and countercurses before he remembered the outside world existed. </p>\n<p>At least by that point, he was reasonably sure he had a spell that would work. He'd come across a few things that mentioned this kind of spell could wear off naturally, once a feral shifter felt suitably safe, but the chance of that happening this century was about zero. Derek would want out of his house as soon as possible, Stiles felt sure.</p>\n<p>He glanced at the clock. It was nearly five. He needed to go make sure Jack and Amy had dinner. If he waited much longer they'd probably try to raid the kitchen themselves, and that could only end poorly. </p>\n<p>He headed into the living room, where Jack and Amy were eating popcorn and watching <em>The Land Before Time</em>. </p>\n<p>\"Hi, Mr. Stiles!\" Amy waved and held out the bowl. \"Want some?\" </p>\n<p>Stiles grabbed a few kernels and popped them into his mouth. \"You two about ready for dinner?\" </p>\n<p>\"Can we have dinosaur nuggets again?\" Jack asked. </p>\n<p>\"Sure, but we're going to have something other than mac and cheese as a side.\" Stiles looked around and frowned. \"Have you two seen Mr. Derek?\" </p>\n<p>\"He went outside. He wouldn't let us come with him.\" Jack made a face. \"He growled.\" </p>\n<p>Amy swatted him. \"He wouldn't <em>hurt</em> you, silly. He just wanted us to stay here.\"</p>\n<p>\"Outside?\" Stiles repeated, because <em>what</em>.</p>\n<p>Amy and Jack nodded, turning back to the television. Clearly they didn't realize what a <em>gigantic fucking deal</em> this was. </p>\n<p>\"Stay here,\" Stiles ordered, even though neither Amy nor Jack seemed particularly inclined to move, and then he bolted out the back door, fumbling his phone out of his pocket. </p>\n<p>Feral werewolves <em>never</em> left a den once they'd settled there, and the fact that Derek <em>had</em> left had Stiles's heart in his throat. What did that even mean? Where the hell had Derek even <em>gone</em>?</p>\n<p>He stumbled onto the back porch, scanning the yard, but saw nothing. Derek wasn't here. Derek was gone. Shit. He had to call his dad, because if Derek ran across anyone else—</p>\n<p>Stiles stepped on something crunchy and squishy at the edge of the porch and stopped cold. </p>\n<p>Slowly, he raised his foot and looked down. A dead squirrel. He'd stepped on a dead squirrel. One of three dead squirrels, <em>and</em> two dead rabbits, all lined up in a neat row on his back porch. </p>\n<p>\"Holy fucking shit.\" Stiles scrambled back, clutching his phone to his chest and breathing hard. Dead animals meant one of two things. Either someone was leaving him a very unkind message, or—</p>\n<p>Something rustled in the woods behind his house, and a second later, Derek jumped over the back fence, dragging something behind him. </p>\n<p>A deer, Stiles realized. Derek was dragging a dead <em>deer</em>.</p>\n<p>He staggered to the nearest chair and sank down, covering his face with shaky hands. The deer landed with a <em>whump</em> on the porch next to the other small animals. </p>\n<p>\"Oh my God,\" Stiles said weakly. \"Oh my <em>God</em>.\" </p>\n<p>Derek looked from the deer to Stiles and back again, pride evident on his face. </p>\n<p>\"Oh my God,\" Stiles repeated, because he literally could not form any other words. </p>\n<p>Okay, that was a lie. He could form a lot of curses. </p>\n<p>\"What the <em>fuck</em>, dude? What the actual fuck? Why in the hell would you run off and bring back a bunch of fucking <em>oh my God you're providing food</em>.\" </p>\n<p>Derek bounded over and nuzzled Stiles's neck, doing his happy rumble-growl again. Stiles tried to push him down, because no matter how hot it was to see Derek dragging around giant animals in nothing but tight black boxer briefs, he smelled like blood and the coppery scent was doing unhappy things to Stiles's stomach. And really, he did not need to be associating sexy things with unhappy stomach things.</p>\n<p>\"I can't believe you just dropped a dead deer on my porch,\" Stiles said, looking for something to get his mind off the fact that that was <em>blood on his shirt</em> now, oh fuck. \"What am I supposed to do with it? That thing's got to be at least a hundred pounds. What am I going to do with a hundred fucking pounds of deer? How fast does that shit go bad? I don't even have a deep freezer, oh my God.\" He leaned over and put his head between his knees, trying to breathe. \"Okay. Yeah. Venison sausage gift baskets for the entire department this year, that'll be perfect. Thank you, Derek. I've got Christmas taken care of now.\" </p>\n<p>Derek continued to nuzzle at him, bumping his head into Stiles's arm, and then his side, until Stiles dropped a hand to his head and carded fingers through his hair. It was a little wet. Stiles religiously told himself it was just sweat from exertion. Not...anything else. </p>\n<p>\"Okay, dude, okay, we're getting you inside and you are getting a bath because seriously, you stink.\" Stiles took another look at the deer lying on his porch. \"Actually, first, you're going to help me get the deer into the garage, because I am not leaving six dead animals on my back porch when there are <em>other</em> predators out there who would be more than happy to have them for a snack. And <em>then</em> we're going to get you a bath.\"</p>\n<p>Derek cocked his head quizzically, like he wasn't quite sure what Stiles was saying, but he was willing to go along with it anyway. That was okay. Going along with it was all Stiles needed. </p>\n<p>And at some point this evening, he was going to have to search \"how long until a deer starts to rot\" to make sure this stupid thing wouldn't stink up his entire house.</p>\n<p align=\"center\">***</p>\n<p>After some quick Google searching on his phone, Stiles decided the best thing to do was leave the deer on some tarp in his garage until he could call someone to come pick it up. It was going to be cool enough that the deer <em>should</em> be fine for a day. </p>\n<p>He threw some chicken nuggets in the oven for the kids and told Amy and Jack to come get him when the timer went off, and then he ushered Derek into the bathroom and ordered him into the bathtub. Derek whined, snarled, and fought, but not hard enough to hurt him, and fortunately not hard enough that Stiles <em>couldn't</em> get him into the bathtub and turn on the water. When Derek made to bolt, Stiles pushed him back. </p>\n<p>\"You are not leaving this bathroom until you are clean, do you understand me?\" he snapped. </p>\n<p>Derek blinked at him with pale eyes, water clinging to his lashes. His hair and sideburns were plastered to his skin. It was sad and adorable and somehow sexy, all at the same time. How could Derek look both adorable and sexy at the same time? It wasn't fair. Stiles wanted to bash his head against the wall.</p>\n<p>He heard telltale giggles in the hallway. \"I thought you two were supposed to be watching the oven!\" Stiles shouted over his shoulder.</p>\n<p>\"Sorry, Daddy!\" Jack yelled, and Amy giggled louder, and then the sound of their thundering footsteps faded in the direction of the kitchen. </p>\n<p>Stiles sighed and turned back to Derek, shampooing his hair and then rinsing it clean, wiping down the rest of his body with a wash cloth as perfunctorily as he could, trying not to pay attention to Derek's chiseled chest or broad shoulders or strong thighs, or the fact that the boxer briefs left nothing to the imagination when they were soaking wet. </p>\n<p>\"Bad Stiles. Don't objectify the feral werewolf,\" he muttered. </p>\n<p>Derek, fortunately, either didn't mind or didn't realize he was being objectified, because he just leaned forward and licked a stripe up Stiles's neck.</p>\n<p align=\"center\">***</p>\n<p>The rest of the evening was thankfully devoid of more dead animals, and Stiles was able to get the kids down on the pallet again without any trouble. Derek was with them, because apparently being sprawled out on the floor for two nights in a row didn't lead to any cricks in one's neck if one were a werewolf. </p>\n<p>\"Do we have to go to school tomorrow?\" Jack asked. </p>\n<p>Stiles sighed and rubbed Jack's buzz cut. \"Nah. But tomorrow's the last random day off. You'll have to go back on Friday, okay?\" </p>\n<p>\"Ugh, fine,\" Jack grumbled, and then he threw his arms around Stiles's neck. \"Night Daddy. Love you.\"</p>\n<p>Stiles hugged him back, taking a brief moment to be grateful for his kid. \"Love you too, kiddo.\"</p>\n<p>Amy cuddled up with Jack's second-favorite elephant toy. \"Are you going to sleep down here with us, Mr. Stiles?\" </p>\n<p>Stiles shook his head. \"I'm too old to sleep on the floor. I'm heading up to my bed. You kids come and get me if you need anything, okay?\" </p>\n<p>\"But Daddy's sleeping on the floor,\" Amy pointed out. \"And he's older than you are!\" </p>\n<p>Stiles rolled his eyes. This kid was too smart for her own good. \"Yeah, well, I'm not a werewolf.\"</p>\n<p>\"If Daddy sleeps on the floor he wakes up and says lots of bad words about his neck,\" Jack piped up.</p>\n<p>\"Yes, thank you, Jack.\" Stiles made to flick a finger at his kid, and Jack giggled. \"Anyway, I'll just be right up the stairs. Good night.\"</p>\n<p>\"Good night,\" Amy and Jack said in unison. </p>\n<p>\"And no watching movies all night until you're at least thirteen!\" Stiles added from the bottom of the stairs. </p>\n<p>\"We won't!\" they called back through their own laughter. </p>\n<p>Stiles headed up the stairs to the sanctuary of his own bedroom. It was a little messy, as usual, but it was quiet and his and he could pretend for five minutes that he didn't have to do a spell on a feral werewolf in the morning. He could pretend it didn't affect him to see Derek lying down with their kids or playing in the backyard or bringing home a ridiculous fucking <em>deer</em> for dinner. It was making him question every interaction they'd had since Derek and Amy had moved back to town a year ago and Amy and Jack had become inseparable. Because feral werewolves did not set up a fucking <em>den</em> in the homes of people they <em>hated</em>.</p>\n<p>He should really quit angsting about this and get some sleep. He'd do the spell on Derek in the morning, they would probably go back to the mostly cordial relationship they'd had, and everything would be <em>fine</em>.</p>\n<p>\"Yeah, keep telling yourself that,\" Stiles said, and went to get ready for bed. </p>\n<p>He'd just climbed into bed and gotten comfortable when his bedroom door creaked open. Stiles buried his face in his pillow and groaned. \"No, Jack, you may not have a midnight snack, but you <em>can</em> have a glass of water if you get one for Amy too.\" </p>\n<p>He expected the door to slowly close, but instead he heard the sounds of someone shuffling into his room, someone who sounded too big to be Jack. </p>\n<p>Stiles raised his head from his pillow and saw Derek crouching at the side of his bed, eyes glowing faintly blue in the dark bedroom. </p>\n<p>Even though he shouldn't have been surprised, Stiles gave a start. \"Fuck, dude, what are you doing here? Aren't you supposed to be downstairs guarding the kids?\" </p>\n<p>Derek whined and grabbed at the comforter, gripping through it when he found Stiles's arm and tugging.</p>\n<p>Stiles groaned and tugged his arm back. \"What do you <em>want</em>, man? If you have to go to the bathroom, I have it on good authority you know how to use the back door. And you already ate your whole steak for dinner and I don't have another one, so if you want food, you're SOL.\"</p>\n<p>Derek kept whining and tugging.</p>\n<p>Stiles pulled his arm back. \"No, okay? Whatever it is, I am sure it can wait until morning. I am going to <em>sleep</em> in <em>my bed</em>.\"</p>\n<p>Derek huffed, and then he loped out of the room, not even bothering to close the door behind him. </p>\n<p>Stiles shoved his face back in the pillow. Fine, he could sleep with the door open. It wouldn't bother him at all. He'd be fine. </p>\n<p>He was just starting to doze when he heard the patter of footsteps on the stairs, and then the patter of feet in <em>his bedroom</em>. </p>\n<p>Stiles raised his head up again. \"What the—\"</p>\n<p>Amy and Jack scrambled into his bed, toting stuffed animals and blankets and a pillow each. Before Stiles could ask them what the fuck they were doing, his bed sank with an even heavier weight, and Derek crawled in behind him. </p>\n<p>Stiles automatically moved forward to make room for him before remembering this was <em>his bed</em>. \"Dude, what the fu-fudge cakes are you doing?\" </p>\n<p>\"Mr. Derek wants us all to sleep together!\" Jack said. \"Is that okay, Daddy?\" </p>\n<p>Amy laughed and flopped down on top of Jack. \"It'll be a puppy pile!\" </p>\n<p>Stiles let his head fall back to his pillow. \"Oh my <em>God</em>.\"</p>\n<p>Behind him, Derek threw a leg and an arm over him and buried his nose right in the nape of Stiles's neck. Stiles did <em>not</em> squeak. </p>\n<p>\"Daddy, is it okay if we all stay in your bed?\" Jack asked again at a much lower volume. </p>\n<p>Stiles could already feel himself giving in. \"Fine, but we're going to <em>sleep</em>. Okay? No tickle fights, no giggling, no nothing. I want to sleep.\"</p>\n<p>\"Okay,\" Jack whispered back, and next to him, Amy nodded furiously into her pillow. </p>\n<p>They <em>did</em> giggle and flail around a bit, because they were five and seven and also because Jack was related to Stiles, but they quieted down and fell asleep much faster than Stiles would have expected. As for Derek, he'd apparently made himself comfortable by using Stiles as a body pillow and had no inclination whatsoever of moving. </p>\n<p>That was fine. That was totally fine. Completely fine. Stiles was <em>fine</em>. </p>\n<p>It took all of three minutes before he admitted it was a lie. He looked at Jack and Amy, curled up together and sound asleep, felt the weight of Derek over his body and the heat of his breath on the back of his neck. He wanted this, dammit, wanted it to be real so badly he could <em>taste</em> it. He wanted lazy mornings and late nights and someone to share his bed with; he wanted this to be his family every day and not just for the five or six minutes he and Derek spoke when Derek came to pick up Amy. </p>\n<p>And he couldn't have it, because no matter what feral Derek did, non-feral Derek wanted nothing to do with him. At least, nothing to do with him beyond mere acquaintanceship. </p>\n<p>Stiles burrowed his face in his pillow and just...pretended. One night. For one night, it was real. </p>\n<p>He could live with that. He'd have to, anyway.</p>\n<p align=\"center\">***</p>\n<p>Stiles woke up the next morning overheated and very confused as to why, before he remembered Derek and the kids had crawled into his bed last night for a slumber party. Sure enough, they were all still there, Jack and Amy starfished on their half of the bed, and Derek wrapped around him so tightly Stiles could feel his chest rise and fall with each breath. </p>\n<p>It took him a moment to realize he could feel something <em>else</em>, too. </p>\n<p>Stiles mashed his face into the pillow and whispered, \"Oh my <em>God</em>.\" Hopefully quietly enough that it wouldn't wake anyone else in the bed. </p>\n<p>Nope. Nope nope nope. He wasn't dealing with Derek's little Derek first thing in the morning. He wanted either a coffee or a stiff drink before that happened. </p>\n<p>Heh. <em>Stiff</em>.</p>\n<p>Stiles gingerly extricated himself from the minefield of limbs and crept downstairs. Bathroom first, then coffee, and then he'd get the spell set up. By then the kids would be awake, he could feed them, and then he could tell them to go play in Jack's room until he finished with the spell. </p>\n<p>The coffee had just finished brewing when he heard voices and rustling upstairs, which likely meant the kids were up. Ah well, so much for hoping for more quiet. Stiles grabbed the cereal bowls and poured himself a cup of coffee. Belatedly, he realized he'd made enough for Derek, too. </p>\n<p>He rubbed a hand over his face. \"Get a grip, Stilinski.\" </p>\n<p>\"Daddy!\" Jack yelled, stumbling down the stairs. \"Daddy, Daddy, guess what! Mr. Derek's okay!\" </p>\n<p>Stiles whipped his head around. Surely he'd heard wrong. \"Huh?\" </p>\n<p>Jack grabbed his hand. \"Come on! Mr. Derek's okay now but you should show him where your pants are. He doesn't want to be naked anymore.\" </p>\n<p>Stiles let Jack drag him back upstairs to the bedroom, mostly because he was too stunned to resist. </p>\n<p>He walked into his bedroom and saw Derek standing in front of his dresser, two drawers open, with Amy hanging off his back, and still wearing nothing but the black boxer briefs. He'd shifted back to fully human, and his cheeks, neck, and chest were bright red. </p>\n<p>Stiles could have happily lived the rest of his life without knowing Derek Hale blushed all the way down to his <em>chest</em>. </p>\n<p>\"See, Daddy?\" Jack said. </p>\n<p>Derek snapped his head up from the dresser, looking like a kid with his hand caught in the candy jar. </p>\n<p>Stiles swallowed hard. \"Um. Hi. Bottom right drawer, if you're looking for sweatpants?\" </p>\n<p>Derek nodded stiffly and opened the proper drawer. \"Thank you.\" </p>\n<p>Stiles quickly turned and went to his closet, rummaging through until he found a large t-shirt. Derek wasn't that much taller than him, but his shoulders were broad enough that most of Stiles's shirts would be tight. </p>\n<p>He handed the shirt over, and bit back any comments about Derek being in his clothes. \"So, uh.\" Stiles made to shove his hands in his pockets, but he was still wearing pajama pants. \"Were you...okay, when you woke up?\" </p>\n<p>Derek nodded again. \"Yeah. Um. Amy woke me up. How long was I...?\" </p>\n<p>\"Oh, about twenty-four hours?\" Stiles said. \"Not that long, really.\" He nodded downstairs, toward the kitchen. \"I've got some coffee on, if you'd like.\" </p>\n<p>\"Yeah. Coffee's good. Um.\" Derek rubbed the back of his neck, looking painfully awkward. \"Can I borrow your phone?\" </p>\n<p>\"Yeah! Sure.\" Stiles gestured to where it was plugged in next to his bed. \"Be my guest. I'm, uh, coffee. Yeah.\" </p>\n<p>He backpedaled out of the room as fast as he could, though not before he heard Jack say to Amy, \"Daddies are so <em>weird</em>.\"</p>\n<p align=\"center\">***</p>\n<p>Stiles hadn't expected them to <em>talk</em> about it, really, even though it deserved talking about. It was difficult to have a discussion with two kids running around underfoot, excited about another day off from school. He figured it might wait until lunch or something, when they could get the kids settled down with a movie or outside playing, where they'd both be distracted and he and Derek could have an Adult Talk.</p>\n<p>But he didn't expect Derek to come downstairs and say, \"My mom will be here to pick us up in ten minutes. We'll get out of your hair.\" </p>\n<p>\"Whoa, what?\" Stiles held up the cup of coffee. \"You're not...I mean, you don't have to—\"</p>\n<p>But Derek shook his head. \"No, it's...you didn't have to.\" </p>\n<p>\"Dude, you were <em>feral</em>,\" Stiles blurted. \"Yeah, I kinda did.\" </p>\n<p>Derek flinched and hunched in on himself. \"I'm sorry,\" he said gruffly. \"I'll get Amy. We'll wait outside. Thank you for watching her. And for letting me borrow your clothes.\"</p>\n<p>\"Derek—\" Stiles started, but he was already out of the kitchen. </p>\n<p>Stiles sank back against the counter, holding the coffee cup to his chest and not entirely sure what it meant.</p>\n<p align=\"center\">***</p>\n<p>Derek remembered everything. </p>\n<p>He tried to tell himself that he didn't, push it as far back into his consciousness as it would go, but the smells of the past twenty-four hours were emblazoned on his memory. Each inhale brought with it another whiff of Stiles's scent from the borrowed clothes, which reminded Derek of sleeping the entire night with his nose buried in Stiles's neck, of waking up slowly to a pillow reeking of that scent, of a bed that smelled of <em>them</em> and <em>kids</em> and <em>pack</em> and <em>home</em>.</p>\n<p>It was ridiculous. It wasn't something he could have again, not with another witch. And it sure as hell wasn't something he wanted to remember. </p>\n<p>Yet it seemed both his own mind and his daughter were against him in that regard. Amy rambled about it the entire way back to their house. His mother, thankfully, kept her mouth shut, although Derek didn't miss the way her eyes kept flicking to meet his in the rearview mirror. </p>\n<p>\"Weren't you scared?\" he asked Amy, half because he needed to know, and half to get her to stop the flow of words about how much <em>fun</em> she'd had living with Mr. Stiles and Jack for the past day. </p>\n<p>Amy shook her head and looked at him like he was crazy. \"You weren't going to <em>hurt</em> me. And Mr. Stiles is magic. He was going to fix it.\"</p>\n<p>She sounded so utterly unconcerned about it that Derek could only blink at her. Obviously, he'd never hurt his daughter, but he'd thought she'd be at least a little worried about him getting stuck that way. Instead, apparently she'd had as much faith in Stiles to make him better as she had in Derek not to hurt any of them in the first place. </p>\n<p>Mom followed them inside once they reached the house, hovering in such a way that Derek knew they would be having a conversation sooner rather than later. He ignored her and got both himself and Amy changed into clothes that didn't reek of Stiles and Jack, and then ushered Amy outside to play for a bit while he made coffee and breakfast. </p>\n<p>Amy ran straight for the swing set, and Derek watched her for a few minutes before he turned to the coffeemaker. </p>\n<p>Mom leaned against the counter, her sharp eyes on him as he moved around the kitchen. Derek could feel the weight of her gaze on his shoulders, and he did his best not to fidget under it. </p>\n<p>\"Whatever you want to say, will you go ahead and just say it?\" Derek finally snapped. </p>\n<p>\"I was going to ask when you intended to tell me about your relationship with Stiles,\" she said evenly. \"But given your reaction, I'm guessing there isn't one.\" </p>\n<p>Derek angrily punched the grinder, using the noise to buy time to respond. \"You guess right. There isn't.\" </p>\n<p>He felt the warm press of her hand on the back of his neck, and Derek instinctively leaned back into it. Even at thirty years old with a daughter of his own, it still felt comforting to have his mother and Alpha here, reassuring him. </p>\n<p>\"Do you want there to be?\" Mom asked. </p>\n<p>Derek dumped the grounds into the filter and turned the pot on. \"No.\" He cursed inwardly as his heart tripped; she'd have heard the lie as easily as he did. \"I don't know,\" he admitted.</p>\n<p>Mom squeezed his neck gently. \"You don't have to know. But Stiles is smart. He knows that it means something that you chose his house, and him, when you were in a state like that.\" </p>\n<p>He turned around and hugged her, pressing his nose into the crook of her neck and breathing in the familiar smell of <em>Alpha-mother-home</em>, trying to erase the last bits of Stiles stubbornly clinging to him. \"I don't know what to do.\"</p>\n<p>She scratched her fingers through his hair. \"Tell him you need some time to sort it out, then. If he's a good man, he'll understand.\" </p>\n<p>\"I hate it when you make sense,\" Derek grumbled. </p>\n<p>She chuckled and pinched his ear. \"No, you don't. Now.\" She kissed the side of his head and pulled away. \"I'm going to go make sure your father hasn't flooded the bathroom, and you are going to have a quiet breakfast and enjoy the day with your little girl, okay?\" </p>\n<p>Derek raised his eyebrows. \"Flooded the bathroom? What's he doing now?\" </p>\n<p>Mom rolled her eyes and waved the question away. \"Remodeling the half-bath next to the study. I've already got the plumber on speed-dial.\" </p>\n<p>Derek snorted. He loved his dad, but Dad's DIY efforts tended to end poorly. \"Well, if you end up needing a bathroom, you're always welcome here.\" </p>\n<p>Mom grinned. \"I'm holding you to that.\"</p>\n<p align=\"center\">***</p>\n<p>He didn't call Stiles. </p>\n<p>It was cowardly. Derek had no problem admitting that to himself. But every time he even <em>thought</em> about thinking about Stiles, he threw himself into doing something else: reading, catching up on paperwork, playing with Amy, anything to keep from having to think about it. </p>\n<p>Thankfully, he was able to take the next day off so he could pick Amy up from school, and then the day after that was Saturday and the only thing he had to worry about was getting her to her soccer game on time. He didn't have to drop her off at the magic shop, didn't have to see Stiles.</p>\n<p>Logically, he knew avoiding the problem was a terrible way to deal with it. It was going to come back to bite him eventually, but he just...couldn't. He wanted to pretend he hadn't changed everything, but he had. And the next time he saw Stiles, he would have to explain, and he couldn't. He couldn't even begin to explain something he only barely understood himself, something that made him ache and made him fear in the same breath.</p>\n<p>The last time he'd felt like this, he'd been holding Amy her first night at home from the hospital. </p>\n<p>That probably said a lot more about his mentality regarding Stiles than he wanted it to. </p>\n<p>On Sunday afternoon, Derek's phone beeped with a text message just as he and Amy got home from their weekly lunch with his parents and the rest of their extended family.</p>\n<p>\n<b>From: Stiles Stilinski</b><br>\n<em>Hey, you at home?</em>\n</p>\n<p>Derek's heart somersaulted in his chest. He put the phone on the table, picked up the living room, and texted back ten minutes later. </p>\n<p>\n<b>To: Stiles Stilinski</b><br>\n<em>Yes, why?</em>\n</p>\n<p>That was safe enough, he thought. Probably Stiles just wanted to see if Jack could come over and play. It was closing in on the seventy-two hour mark since he and Amy had seen each other, and Derek was pretty sure there were going to be withdrawal symptoms by Monday morning. </p>\n<p>However, he didn't get a response. </p>\n<p>He'd just settled on the couch next to Amy, both of them with books, when the doorbell rang. Derek groaned and inwardly cursed the terrible timing, but he got up to answer the door. </p>\n<p>The scent hit him right as the door swung open, and Derek found himself staring dumbly at Stiles and Jack, Jack holding a bright blue folder full of papers and Stiles with a giant cardboard box of frozen meat. </p>\n<p>Derek blinked. \"What.\" </p>\n<p>\"Hi, Mr. Derek!\" Jack said brightly, waving the folder. \"I brought Amy's homework! Miss Allison brought it over! And Daddy brought the deer!\" </p>\n<p>\"The...deer?\" Derek repeated, confused.</p>\n<p>Stiles hefted the box. \"Oh yes. The deer. Now scoot, this thing weighs fifty pounds.\" </p>\n<p>Derek scooted. Jack and Stiles came inside, Jack scrambling unerringly to the couch where Amy was while Stiles strode down the hall into the kitchen. </p>\n<p>Derek followed Stiles, still at a loss. \"You brought us deer?\" </p>\n<p>\"No, you brought <em>me</em> a deer.\" Stiles set the box on the kitchen table with a thud. \"And now the deer has been processed, and you have enough venison to last you through the winter and plenty of proof that you are a good wolfy provider.\" </p>\n<p>\"I brought...\" The memory hit him like a freight train, and Derek's cheeks heated in embarrassment. He dropped his face into his hands. \"Oh my <em>God</em>.\" </p>\n<p>\"And there it is.\" Stiles snorted. \"I wondered if you remembered any of it.\" </p>\n<p>Derek sank into the chair, staring vacantly at the box of meat sitting on the kitchen table. \"I can't believe you kept it.\" </p>\n<p>\"What, the deer?\" Stiles shrugged. \"Of course I kept it. It was a good deer. Thankfully, one of the other deputies works part-time at a place that does processing, because I know jack shit about making it go from 'deer' to 'edible meat.'\"</p>\n<p>Derek couldn't take his eyes off the meat. He knew he should get up, thank Stiles, put the venison away, do <em>something</em> to indicate that he was indeed a functioning person, but he was just...Stiles brought him the <em>deer</em>. He hadn't thrown it away. He hadn't given it away. He'd kept it, had it processed, and brought half to Derek. </p>\n<p>\"Anyway,\" Stiles said, \"I'm going to grab Jack and, uh, get out of your hair, so—\" </p>\n<p>\"Wait,\" Derek cut in. His voice cracked on the words. </p>\n<p>Stiles stammered to a halt. \"Uh, what? You want me to wait? You want me to <em>stay</em>? Because I was under the impression that, you know, you didn't particularly care for me and—\"</p>\n<p>Derek gave Stiles a flat look. Stiles snapped his mouth shut and dropped into the chair beside him. </p>\n<p>Derek looked down at his hands, broad and flat, the wiry black hairs between his knuckles. He'd only ever told his family about this, and he hadn't spoken about it in years. </p>\n<p>He cleared his throat, tried to find the words. \"Jennifer—Amy's mom—she was a witch. I knew it before we got together, but...I didn't...\" God, why was talking about this so <em>hard?</em></p>\n<p>\"Hey,\" Stiles said, his voice surprisingly gentle. \"Dude, you don't have to tell me—\"</p>\n<p>\"I do.\" Derek winced at the harshness in his tone. \"I do,\" he tried again, softer. \"I need you to know.\"</p>\n<p>Stiles nodded, amber eyes serious. \"Okay. Take your time.\" </p>\n<p>Derek frowned down at his hands again, trying to unstick the words. \"She used magic on me,\" he finally said. \"And Amy.\" </p>\n<p>Stiles sucked in a breath, but didn't say anything. </p>\n<p>Derek continued haltingly. \"I didn't notice. For the longest time, I didn't...she was using magic on my own goddamn <em>daughter,</em> to make her more 'manageable,' and I didn't fucking <em>notice</em>.\"</p>\n<p>\"That's probably part of what she was doing to you,\" Stiles said. \"To keep you from noticing.\"</p>\n<p>Derek shook his head hard, the old guilt rearing its ugly head. \"I'm her <em>father</em>. I'm supposed to protect her from that.\" </p>\n<p>Stiles, thankfully, didn't argue with him. \"So how did you find out what Jennifer was doing?\" </p>\n<p>\"I guess she slipped up.\" Derek rubbed his forehead, as if it could somehow erase all the memories. \"I don't know if she forgot to spell me or didn't think I was within earshot or what, but I saw her do it to Amy and I lost it. And she started to do it to me, to make me forget, but...I don't know, it didn't work. I grabbed Amy and left.\" He swallowed hard. \"Memories started coming back the longer I was away from her. Things I thought were real weren't. I didn't...I <em>couldn't</em> trust myself. I still don't, some days.\"</p>\n<p>\"On my <em>God</em>, Derek,\" Stiles whispered. </p>\n<p>Derek cleared his throat. \"Anyway. That's...why I have trouble. With magic.\"</p>\n<p>\"Yeah, no <em>shit</em>.\" Stiles raked his hand through his hair, his eyes wide with horror. \"Look, you <em>know</em> I would never do that, right? To you or Amy or anyone.\" </p>\n<p>His heartbeat was strong, steady, and Derek nodded. \"On some level, I know. And I know Amy knows, because she doesn't...it doesn't even bother her to be in the store. I'm glad for that.\"</p>\n<p>\"But it bothers you,\" Stiles said. </p>\n<p>Derek shrugged helplessly. \"I just...don't ever want to be compromised like that again. I have to protect her.\" </p>\n<p>\"I get that.\" Stiles nodded. \"Believe me, I get that.\"</p>\n<p>They sat in silence, Stiles unusually still, the only sounds coming from Jack and Amy playing in the living room. Derek wasn't sure what else to say, how else to explain. </p>\n<p>Stiles finally broke the quiet between them. \"But...when you were feral, you came to my house.\"</p>\n<p>\"Yes.\" </p>\n<p>\"You kept us all there, until the curse broke. Because you felt safe with us.\" </p>\n<p>\"Yes.\"</p>\n<p>Stiles fidgeted, popping his fingers. \"That's not...I mean, that's not normal, right? I've only ever read about feral wolves, but—\"</p>\n<p>\"You're right,\" Derek said. \"It's not normal. We stick with family. Pack.\" He hesitated, and then added, \"Our mates.\"</p>\n<p>\"Oh,\" Stiles said, and then, \"<em>Oh</em>.\"</p>\n<p>His heart constricted, and Derek hunched in on himself. \"Sorry.\" </p>\n<p>\"No!\" Stiles flailed. \"No, dude, don't apologize, don't...\" He scrubbed his hands over his face and sighed, and then covered Derek's hands with one of his own. \"Derek, look at me, please.\" </p>\n<p>Derek stared at the tattoos marking Stiles's hands, and then looked back up to meet his eyes. He didn't think he'd ever seen Stiles so serious. </p>\n<p>\"I felt it too,\" Stiles said quietly. \"That...all of us together. It felt like family, and I...I liked it. More than I thought I would. More than I probably should. So if that's something you feel, I just wanted you to know you're not alone. And...I don't want to pressure you into anything, but if you wanted—if you ever felt ready for it, I'd be up for trying.\"</p>\n<p>The words spoke right to the part of Derek that was both exhilarated and terrified. <em>I want it too</em>, he wanted to say. <em>I feel safe with you, but this scares the shit out of me</em>. </p>\n<p>But he couldn't form the words. </p>\n<p>Stiles squeezed his hands and stood. \"I'm going to grab Jack and head out. Amy's still welcome to stay at the store after school. And if you text me when you're on your way, I'll make sure she's waiting up front or outside. You don't have to come in. And...you know, if you decide you want to, maybe we could get coffee or something. Just talk, you know. Anyway. Um. I'll see you later, Derek.\"</p>\n<p>He gave a little wave and started to leave the kitchen a second time. And Derek finally, <em>finally</em> unstuck his voice and said, \"Friday.\" </p>\n<p>Stiles whirled on his heel. \"Huh?\" </p>\n<p>\"Amy's going to be staying with Laura next weekend. They're having a girl's weekend in.\" Derek felt like his heart was going to beat out of his chest, like he was stepping off a cliff without any way to keep from smashing himself to bits at the bottom. \"If you wanted to have dinner on Friday. Just to talk.\" </p>\n<p>Stiles's face went through a complicated series of expressions before he beamed like the damn sun. \"Yeah! Yeah, that'd be...yeah. Seven o'clock work for you?\" </p>\n<p>Oh God. When had breathing become so difficult? Derek made himself stand up, even though his legs were shaking. \"Seven's good.\" </p>\n<p>\"Good,\" Stiles echoed. \"It's a date. Or not! It's a...getting together and talking...thing. With food.\" </p>\n<p>Derek couldn't help it. He laughed. \"Getting together and talking thing. With food. Yeah, that works.\" </p>\n<p>Stiles grinned. \"Awesome.\"</p>\n<p>He collected Jack—who went with surprisingly little protest—and headed out the front door, bidding goodbye to Amy as he did. Derek leaned against the couch, still shaky from the conversation, still scared about taking the next step. </p>\n<p>But deep inside, something else settled in his chest, a bright, warm coal of hope that hadn't been there in far too long.</p>\n<p>Amy poked him in the side. \"Are you going on a date with Mr. Stiles?\" </p>\n<p>Derek picked her up and swung her into his arms. \"Maybe. Is that okay with you?\" </p>\n<p>Amy rolled her eyes. \"<em>Duh</em>. Of course it is. Me and Jack have been waiting for this for like <em>months</em>. I want him to be my real brother.\" </p>\n<p>Derek snorted. \"It's a little early for that, don't you think? We haven't even been on a date yet.\" </p>\n<p>She shrugged. \"Aunt Laura told Gramma it's a miracle one of you hasn't bent the other over the nearest flat surface yet because the UST makes her ill every time you're in the same room.\" </p>\n<p>Derek choked and almost dropped her. \"Your Aunt Laura and I need to have a talk. Come on, let's go read outside while you completely forget you ever heard anything like that.\"</p>\n<p>\"Okay!\" Amy wiggled until he put her down, and then she grabbed his fingers. \"Just one question, Daddy.\" </p>\n<p>\"Yeah?\" </p>\n<p>\"What's UST?\"</p>\n<p>Derek facepalmed. He was going to <em>kill</em> Laura.</p>\n<p align=\"center\">***</p>\n<p>\n<em>One month later</em>\n</p>\n<p>\"That smells amazing.\" Stiles poked his head over the grill and inhaled. \"What are you making?\" </p>\n<p>Derek swatted at him with his grill tongs, but he couldn't stop the smile spreading over his face, how it warmed him to have Stiles in his space. \"Venison steak, venison sausage, and venison burgers for the kids.\" </p>\n<p>\"Mmm, <em>venison</em>.\" Stiles grinned and took a swig of his beer. \"Is that the last of our deer?\" </p>\n<p>Derek nodded. \"Seemed appropriate for tonight.\" </p>\n<p>It was officially one month since they'd started dating, and Stiles had insisted on celebrating. Even though it was early November, the weekend weather was surprisingly warm, and Derek had suggested a cookout. Stiles had grumbled about werewolves and their damn high body temperatures, but he'd agreed. </p>\n<p>Now the sun was setting, Jack and Amy were chasing each other around the backyard, and Derek was counting the minutes until venison steaks. </p>\n<p>\"You know, I meant to ask you.\" Stiles took another drink of his beer. \"Why did you ask me to dinner in the first place? We'd just had that whole conversation...I figured you'd want to give it a couple of weeks, at least.\" </p>\n<p>Derek ducked his head. \"You said I didn't have to come into the store. And you brought me the deer.\" </p>\n<p>\"What...<em>really?</em> That's what it was?\" </p>\n<p>Derek shrugged. \"I showed you I could provide for you. And instead of throwing it away or giving it to someone else, like most people would have done, you had it processed for both of us.\" </p>\n<p>\"What about the shop?\" </p>\n<p>\"Ever since I told you about Jennifer, you haven't made me spend any time around magic. And I know that it's a big part of your life. So...that means a lot.\" Derek swallowed. \"It gave me the courage to do something big for you.\" </p>\n<p>\"Okay.\" Stiles set down his beer. \"Okay, I really need to kiss you now.\" </p>\n<p>Derek felt his lips twitch. \"Need?\" </p>\n<p>\"Need, want, whatever, you <em>pedant</em>. You're adorable and I'm having feelings about it.\" </p>\n<p>Derek turned so he was facing Stiles full-on, leaned further into his space. He watched the way Stiles's breath caught, his body hitching slightly with the movement. \"Just feelings?\" Derek whispered.</p>\n<p>\"<em>Good</em> feelings, of the happy and loving variety, are you <em>happy now</em>, you—\" </p>\n<p>He didn't find out what Stiles was going to call him, because Derek closed the rest of the distance between them and sealed his lips over Stiles's, shutting him up. </p>\n<p>Stiles made a noise in the back of his throat, and then his fingers were in Derek's hair, adjusting the angle of the kiss and running his tongue over Derek's lips until Derek sighed and opened them.</p>\n<p>And <em>wow,</em> this was so much better than Derek had ever anticipated. He dropped his hands to Stiles's hips, pulling him closer, chasing the scent and taste of Stiles and—</p>\n<p>\"A<em>hem</em>.\" </p>\n<p>They sprang apart like teenagers caught necking in the car. Amy and Jack stood at the edge of the porch, arms crossed and looking frighteningly judgmental for two kids who weren't even out of elementary school. </p>\n<p>Amy tapped her foot on the ground. \"So if you're done with the <em>gross</em> stuff, are we going to eat yet?\" </p>\n<p>\"Yeah, we're hungry!\" Jack said. </p>\n<p>Derek was going to die of embarrassment. </p>\n<p>\"Nope,\" Stiles said easily. \"We're not done with the gross stuff yet. We have at <em>least</em> another four minutes of making out before the burgers are done, so unless you want to see me stick my tongue back down your dad's throat, you'd better go play on the swing set.\" </p>\n<p>Derek buried his face in his hands. \"Oh my <em>God</em>.\"</p>\n<p>\"Are you really gonna stick your tongue all the way down his throat?\" Jack asked in horrified fascination. </p>\n<p>Amy shivered. \"Grown-ups are <em>disgusting</em>. Come on, Jack.\" </p>\n<p>\"That's so <em>gross!</em>\" Jack shouted, but he followed Amy away from the porch. </p>\n<p>Yup. Derek was going to die of embarrassment. </p>\n<p>\"There. Privacy,\" Stiles said. \"Well, for a relative value of privacy. Now where were we?\" </p>\n<p>Derek went back to the grill. \"We were grilling hamburgers.\" </p>\n<p>\"Oh, come on, Derek.\" Stiles practically hung off him. \"I scared them off. Don't you want to take advantage of it?\" </p>\n<p>Derek grabbed his hand and kissed the knuckles, rubbing his thumb along the lines of the tattoos there. \"Later.\" </p>\n<p>Stiles pouted. \"But later is so far away.\" </p>\n<p>Derek poked at the steaks and burgers, glad for the heat to hide the blush on his face. \"Well, the kids will be occupied with a movie later.\" </p>\n<p>\"A movie—oh. <em>Oh</em>.\" Stiles kissed the shell of his ear, and Derek shuddered. \"Okay. Definitely later.\" </p>\n<p>Later, Derek would take Stiles into his bedroom and kiss him senseless. Later, he would undress them both and memorize every inch of Stiles's skin. Later, he would press his nose to the back of Stiles's neck and breathe deep, taking in the scent he hadn't been able to get out of his mind for months. </p>\n<p>But now, Derek stood on his back porch with his daughter and her best friend running around the swing set, his boyfriend plastered to his back, the smell of grilled meat filling the air and the twilit sky darkening around him. </p>\n<p>He was home.</p>"
}