{
  "id": "539061",
  "url": "https://archiveofourown.org/works/539061?view_full_work=true",
  "author": [
    "gyzym"
  ],
  "title": "Crash Landers",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Allison Argent/Scott McCall",
    "Vernon Boyd/Lydia Martin",
    "Allison Argent/Lydia Martin/Vernon Boyd/Scott McCall",
    "Isaac Lahey/Erica Reyes",
    "[past Danny Mahealani/Stiles Stilinski]"
  ],
  "characters": [],
  "additional_tags": [
    "Epistolary",
    "Allusions to sexual trauma",
    "Stalking"
  ],
  "language": "English",
  "series": "",
  "published": "2012-10-16",
  "completed": null,
  "words": "31,173",
  "chapters": "1/1",
  "comments": "637",
  "kudos": "16,349",
  "bookmarks": "5,794",
  "hits": "415,410",
  "summary": "<p>In which Stiles learns to Stalk That Stalk. (Or, how to accidentally woo your unfriendly neighborhood alpha in roughly five hundred handwritten steps.)</p>",
  "notes": "<p>Okay so FIRST AND FOREMOST: this story features heavily in mutually consensual stalking. If that is not for you, this fic is not for you! Please read accordingly. </p>\n<p>Secondly: I owe so much fucking thanks on this one I don't even know where to begin. To <a href=\"https://archiveofourown.org/users/postcardmystery\" rel=\"nofollow\">Postcard</a>, <a href=\"https://archiveofourown.org/users/fireeverything\" rel=\"nofollow\">Nat</a>, and <a href=\"https://archiveofourown.org/users/angelgazing\" rel=\"nofollow\">angelgazing</a>, for reading every word of this and cheering me on tirelessly; to <a href=\"https://archiveofourown.org/users/amazonziti\" rel=\"nofollow\">amazonziti</a>, for being the best beta a girl could ask for and fighting back my italics obsession for great justice; and, of course, to <a href=\"https://fiveyearmission.tumblr.com/\" rel=\"nofollow\">fiveyearmission</a>, who, in addition to betaing this, also CREATED THE CUSTOM STYLESHEET THAT LETS THE NOTES LOOK LIKE NOTES AND ACTED AS MY OWN PERSONAL GODDAMN YODA IN MAKING IT WORK: I seriously, seriously cannot thank you enough. Like. Ever. THANK YOU SO MUCH, OH MY GOD. </p>\n<p>And thirdly: there is a side, semi-original character in this story who uses the gender-neutral pronouns zhe/zher, and is, as such, referenced within the narrative with said pronouns. If you have never encountered said pronouns before, that's what they are! If <i>I</i> have used them incorrectly, please do not hesitate to let me know.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>\n<i>There is a book </i><br>\n<i>living inside your chest</i><br>\n<i>with dilated instructions</i><br>\n<i>on how to make a safe landing.</i><br>\n<i>It was written</i><br>\n<i>for crash landers.</i><br>\n<i>Thank you.</i><br>\n<i>I am coming home to listen.</i>\n</p>\n<p>\n-In Landscape, Buddy Wakefield\n</p>\n<p>Stiles…is bored. </p>\n<p>He freezes the second the thought crosses his mind, waiting for the other shoe to drop. If the last two and a half years have taught him anything, it's that boredom is a luxury waiting to hightail it out the front door the minute you notice it's there; boredom, Stiles has come to realize, is the cruelest of all states of being. It tricks him into thinking it's a horrible curse when it's around, probably to make him feel guilty when it vanishes into the night and leaves him <i>wishing like hell</i> it would return. Boredom, for all its pitfalls, is a lot better than bleeding from assorted orifices. Boredom is significantly preferable to terror, agony, or impotent rage. Boredom, Stiles knows, is a gift, even it's one he doesn't usually want very much. </p>\n<p>When he's spent a full minute sitting lying stock still across the cab of his father's cruiser, Stiles unfreezes, figuring he's probably safe from dramatic irony for the time being. It's even possible, for all he knows better, that he'd <i>welcome</i> some dramatic irony right now--he's bored, and it might be a luxury, but that doesn't mean he has to like it.</p>\n<p>This wouldn't be such a problem, Stiles thinks, if it wasn't for how he's gotten used to not being bored. He has structured his life around panicking about supernatural creatures, and panicking about people finding out about supernatural creatures, and panicking about not finishing his homework because of supernatural creatures, and panicking about not getting into college because of not finishing his homework because of supernatural creatures. Things have long been featuring heavily in panic and supernatural creatures! But now…well. The alpha pack's been dealt with for over a year, Peter's been back in the ground for six months, high school is over forever, college is sorted out, and Stiles' father knows about werewolves. Things are peaceful, for the time being. </p>\n<p>He freezes for a second time, waiting. Alas, nothing dastardly appears, and he's forced to settle back down. Again. </p>\n<p>It's not, of course, that Stiles <i>wants</i> something to show up and start stalking, murdering, maiming, possessing, torturing, turning, or otherwise harming the remaining innocent citizens of Beacon Hills. Granted, Stiles kind of thinks there's maybe only four or five innocent citizens <i>left</i> in Beacon Hills, but still. Their safety is important. In theory. It's just that, in practice, everybody but Allison and Lydia are going to be staying in the area for college. This means that Scott is spending his every free moment with Allison, and Boyd is spending his every free moment with Lydia, and Stiles is finding himself with more free moments than he's had in quite awhile. An embarrassment of free moments, you might say. So many free moments that he's kind of depressed about it. </p>\n<p>Which shouldn't happen, Stiles knows, when you're part of a pack. When you're part of a pack, there is always supposed to be someone capable of Being There For You, even if Being There For You just means available for occasional hang-outs so you don't find yourself waiting for your dad to finish his probably-nooner-given-how-long-he's-been-in-there-ew with Scott's mom and take you to lunch. But Scott and Boyd and Lydia and Allison are busy with each other, and Isaac hasn't ever liked Stiles, and Erica likes Isaac too much to acknowledge the fact that she likes Stiles, and even desperate times don't call for the desperate measures of hanging out with Jackson. There’s Mox, but Mox is a real, non-supernaturally-inclined adult, with a day job on top of the drag gig and a very active night-life, and Stiles knows there’s a fine line between being an adorable baby queer and being an obnoxious pain-in-the-ass teenager, doesn’t want to cross it. He wishes that he and Danny were at the stage where they could be bros again, but they're still too firmly entrenched in being awkward exes for that to be an option, which means that Stiles? Is having a lonely summer. </p>\n<p>So, yeah. It's not that he's looking for disaster to befall the town, exactly. It's just that it might be kind of nice. </p>\n<p>He sighs after a third fruitless freeze-and-wait attempt--a watched pot of impending supernatural chaos never boils, apparently--and sits up, cracking his neck. He's been in this car for almost half an hour, because his father is a ridiculous person who does things like park a block away from the hospital and say, \"I'll be right back, son, just…checking on something,\" like Stiles doesn't know what the fuck is up. Usually he's grateful for the fact that he and his father have a don't-ask-don't-tell policy about the details of the sex they are or are not having, but today he kind of wishes his dad had blown off their plans. Left a sock on the kitchen table or something. It'd be less awkward. </p>\n<p>The street, when he looks around for something to occupy himself that isn't his nearly dead phone or his dad's don't-you-dare-touch-this-Stiles-I-mean-police-scanner, is empty. Oh, there's a couple of kids walking down the street, a few bicycles leaning against a rack, a black Camaro parked about a block and half away…</p>\n<p>…<i>Derek's</i> black Camaro. Is parked. About a block and a half away. It has to be Derek’s, because there’s no other Camaro in town sporting huge, ugly clawmarks across the back bumper. Stiles brightens; there's no cure for boredom quite like harassing your unfriendly neighborhood alpha. </p>\n<p>He gets out of the cruiser and jogs up the street, doing a surreptitious creep up to the car and checking all the windows to make sure it's empty. Then, on the theory that it'll make Derek materialize if he's around, he runs the pad of his index finger down the front of the car, hard enough that it squeaks against the paint job. When Stiles is not immediately confronted by the Eyebrows of Doom, he assumes Derek has parked here and gone somewhere, which is good news. Definitely. Of course. Because it's not like Stiles was looking forward to having an excuse to talk to Derek or anything.</p>\n<p>On the plus side, he's now got possibly infinite time and Derek's abandoned car to fuck with. Stiles considers his options for a minute, grins, and goes back to the cruiser. </p>\n<p>The glove compartment of Stiles' father's police car is largely uninteresting, but there is a small stack of blank parking tickets shoved into the back. It's not normally a sheriff's job to do things like ticket illegally parked vehicles, but Stiles' father keeps the option available to himself for those times when he runs across particularly gross offenders or, not that he'll admit it, days when he's just kind of feeling vindictive. Grinning victoriously, Stiles pulls one out, flips it open, grabs a pen from the graveyard of coffee cups and other miscellany that is the passenger seat floor, and…pauses. </p>\n<p>Shit. What do you write inside a fake ticket meant to briefly mislead a slightly unhinged werewolf into deep annoyance? Stiles is pretty sure, \"Ahahahahahaha\" is not appropriate, and 100% certain that, \"For reasons I cannot even explain to myself, you've kind of been a recurring feature in my ongoing journey of sexual discovery since the first time I laid eyes on you,\" will not go over well. Hmm. Decisions, decisions. </p>\n<p>Eventually, he writes, \"Gotcha!\" and walks back over to the car, shoving the fake ticket under the left windshield wiper with satisfaction. It's not much better than \"Ahahahahaha,\" but it's a significant improvement on the other option, so Stiles is going to count it as a win. He goes back to the cruiser, meets his father coming the other way, and mostly forgets about it. Hopefully it'll at least cause some mild intrigue at some point, unless (please, please, please, <i>please</i>) something else comes up.</p>\n<p>Something else comes up.</p>\n<p>A week later, Stiles is behind the wheel of Derek’s car, careening around the corner of one of only four remaining streets they've never caused trouble on as he’s chased by a merry band of murderous elves. They are <i>actually a merry band</i>, is the worst part; they play folk music at the local nursing home on Tuesday and Thursday, and apparently thirst for blood every other day of the week. Sometimes Stiles hates his life.</p>\n<p>But the point is, he's driving for his life, with Boyd riding shotgun and Scott groaning as he heals his way out of bleeding to death in the backseat, leading the merry band on a less-than-merry chase to the edge of the territory line. If their plan works, this little maneuver will allow Derek and the rest of the pack to rip the elves to tiny, elven pieces while they're weak from crossing their boundary; if it doesn't work, they're probably all gonna die. So, you know. It's Monday. </p>\n<p>\"Eyes on the road, Stiles,\" Boyd snaps, the fourth time Stiles cranes his neck to see if they're still being chased, \"I've got this.\" Stiles grumbles but turns around, and that's when he sees it: the yellowed edge of a parking ticket, just barely sticking out from underneath the driver's-side visor, which is currently flipped into the upward position. It looks crumpled, a little, less like someone balled it up and more like it's been handled enough times to have lost the crispness of fresh paper. Stiles stares at it until Boyd yells, \"STILES!\" and he jerks his attention back to the road, yanking hard on the wheel just in time to keep them from wrapping around a tree. </p>\n<p>So. It's not like Stiles has the time to check and see if it's the ticket he left; he's busy with driving, and then with the bloody near-murder of all the elves, and then with frantically double-checking Scott’s now-healed wound, and then with hastily negotiating a peace treaty, and then with Derek snatching his keys back from Stiles and stalking away muttering under his breath. It could, Stiles knows, be another parking ticket, a <i>real</i> parking ticket, that Derek's just keeping because he hasn't paid it (or, to be more accurate, tried to harass Stiles into harassing his father into excusing him from paying it) yet. </p>\n<p>He knows it's not another parking ticket, though. He's not sure how, but he does. And it occurs to him, when he thinks over the ragged, worn edge of the paper, to wonder if he hasn't cornered the market on loneliness this summer. To consider the possibility that, just maybe, he's never been a contender at all. </p>\n<p>It's hard to stop thinking about that, Stiles finds. Very hard. He was right: the boredom was definitely a luxury.</p>\n<p>So that's how it starts. Not that Stiles really knows what \"it\" is, exactly. Not that Stiles even wants to know. </p>\n<p>The first few notes are easy enough to write. That, Stiles is pretty sure, is because he scribbles all of them without particularly thinking about why he's doing it, forcing himself to forget about them the minute he's finished. They're just jotted-down little nothings, scrawled onto the backs of parking tickets he stole from his dad's glove compartment, that he keeps in his own car until he happens to chance across the Camaro in town. </p>\n<p><i>A man's car is his temple,</i> the first (well, technically second) one says. Stiles shoves it into Derek's cracked window one afternoon when he sees the Camaro in the lot of the grocery store, and cackles for the rest of the day. </p>\n<p><i>This is actually an illegal parking spot, I hope you know that,</i> the next one says. In a different color than the main body of the script, Stiles is forced to add, <i>I want you to know that I wrote this BEFORE I saw you parked here, on the theory that I would eventually find you parked somewhere illegal. I didn't expect it to be SO SOON, oh my god. I'm probably saving you from getting a real ticket here. Be grateful</i>. He puts that one under the windshield wiper again, going through the effort, this time, to date and fill out the front of the ticket properly so that any passing officers will think someone else really did deal with it. Which is technically way more illegal than Derek's parking job, but whatever. It's not like that's a new thing for Stiles. </p>\n<p>The one after that says, <i>Sometimes I want to thank you and don't know how. So: thanks</i>. Stiles sticks it under Derek's door handle at three in the morning one night, on his way back to his Jeep to drive home, shower off the blood, and maybe just go ahead and sleep for a thousand years. He doesn't add an addendum to let Derek know that he wrote this one ahead of time too, on the theory that Derek would pop up to save him from certain death eventually; Derek doesn't need to know that. </p>\n<p>Actually, Derek doesn't need to know <i>any</i> of this, doesn't need Stiles leaving him strange little parking ticket notes at odd hours. It's weird, and Stiles feels weird about it. But there's something…almost freeing in it, Stiles thinks. He's sure Derek knows he's the one leaving them, because, even putting aside the scent Stiles is sure he's leaving all over them, who else would have access to parking tickets? But Derek doesn't bring it up at pack meetings, doesn't send Stiles angry texts demanding explanations, doesn't say anything about it at all. If anything, Derek is scowling at Stiles <i>less</i> these days than he used to; Stiles keeps catching him staring from across the room, blinking and looking away whenever Stiles meets his eyes. </p>\n<p>Which, okay. The thing about Derek? Is that Stiles does not <i>get</i> him. Oh, he understands the basic lay of the obnoxious werewolf land; Derek is paranoid and intense and actually kind of more than a little bitchy, when you get right down to it. Derek is compulsively Bad With People, although he is, very occasionally, good at pretending not to be Bad With People. Derek mostly does not like anything at all. Derek tends to shut down in the face of things he does not understand. Derek is pretty easily manipulated, once you understand that he just wants answers to his problems handed to him as quickly as possible. Stiles can argue with Derek for hours, and has. Stiles can meet Derek furious glare for furious glare, and has. In terms of the basic, necessary interactions, Stiles gets Derek just fine.</p>\n<p>But… well. Unasked-for crises of the <i>Dear god why are you so attractive</i> variety aside, Stiles hasn't ever actually spent very much time thinking about the rest of Derek. Or, like, getting to know him. He feels vaguely guilty about it, kind of, because he's on pretty rock-solid terms with the rest of the pack--Isaac doesn't like him, but it's mutual-Scott-jealousy dislike, which Stiles gets (probably better than he should, if he's honest). And yeah, Erica's avoiding him lately, but that's only because their closeness is kind of on hiatus until it makes Isaac less of a possessive pain in Erica's ass; the two of them haven't been dating very long, and Stiles gets that too, that sometimes stuff has to get shelved for the sake of working through more important stuff. Stiles has never particularly enjoyed Jackson, but dating Danny had been an education in his assorted foibles, and he's been working with Boyd so closely for the past two and a half years that he's competing with Scott in the best-friend department. Lydia and Allison have been high on Stiles' speed dial since even before they were pack, and, for obvious reasons, Stiles knows Danny in ways he never really expected to know anybody, for all that's all water under the Been Dumped bridge now. </p>\n<p>So it's just… Derek. Criminally hot, criminally reticent, often actually criminal Derek, who Stiles treated like an enemy whose life he felt compelled to save for the year it took Scott to finally join the pack, and who has just been Derek since. Stiles finds himself in Derek's car a lot, and vice versa; Stiles finds Derek in his <i>bedroom</i> a lot, although the vice versa there only applies in Stiles' more secret and shameful fantasies. But somehow it's always just work, barked orders and pithy arguments, the two of them running through the woods while Derek screams about how Stiles is human and shouldn't be here and Stiles screams about how Derek should shut the fuck up and let him flee for his life in peace. There's never anything else, no casual hang-outs, no late-night gaming marathons, no texts in the dead of night, no easy sharing of coffees. </p>\n<p>Which is a shame, because every once in a while there <i>is</i> a really fucking dark joke. Or a sliver of a bitter smile. Or the hint that underneath all that leather and hair product and scowling is a person that Stiles might, actually, <i>like</i> kind of a lot. He's been trying not to think about that for the better part of two years, knowing full well that he's the kind of guy who tends to commit long-term on the liking-people thing whether or not he wants to. It seemed like a good idea at the time, but now--still thinking, more than he’d like to be, about that worn yellow corner of paper--Stiles wonders if he's maybe been kind of a dick. If, in assuming getting friendly with Derek would put them both in an uncomfortable situation, he's actually been out and out unfriendly to a person who is notably bad with all things emotion. </p>\n<p>So he keeps writing the notes. It's something to do, after all, and he's having a lonely summer.</p>\n<p class=\"desc left\">[Parking ticket #10, stuffed into the Camaro’s tailpipe:]</p>\n<p class=\"stiles ticket\">The idea of college kind of freaks me the fuck out. Which doesn't even make sense; it's not like most of us are moving away, not really, not far enough to matter. I just keep thinking about the way trouble follows us. I think everyone I know is sick of getting blood on their hands.</p>\n<p class=\"desc left\">[Parking ticket #18, stuck to the passenger-side window with chewing gum:]</p>\n<p class=\"stiles ticket\">Your hair looked immensely stupid today. Seriously, is there a store in town that just sells you gel by the metric ton? Werewolf or not, no one's hair should achieve that kind of height. You look like a Disney villain.</p>\n<p class=\"desc left\">[Parking ticket #24, left peeking out from underneath the hood:]</p>\n<p class=\"stiles ticket\">Scott's not mad at you because you don’t seem more upset that Allison's leaving in the fall. Scott's mad at you because you don't seem to care that HE'S upset about that. This isn't rocket science.</p>\n<p class=\"desc left\">[Parking ticket #31, slipped into the trunk:]</p>\n<p class=\"stiles ticket\">I'm not sorry I was a dick to you today. But I could probably have been nicer. So. Do with that what you will.</p>\n<p class=\"desc left\">[Parking ticket #43, filled out and placed beneath the left windshield wiper:]</p>\n<p class=\"stiles ticket\">THIS IS SUCH AN ILLEGAL PARKING SPOT I DON'T EVEN HAVE WORDS</p>\n<p class=\"desc left\">[Parking ticket #49, tucked inside left rear tire rim:]</p>\n<p class=\"stiles ticket\">Why is your car full of Red Bull cans today? Does that shit even work on weres? Whatever's going on, either sleep or tell the rest of us. Me, at least. Maybe if I was less bored out of my mind, I would not have to keep leaving you weird notes you never respond to. Not that I want you to respond, I'm just saying, you could cut down on the volume by giving me a task.</p>\n<p class=\"desc left\">[<del>Parking ticket</del> Note #51, taped to the inside of Derek’s mailbox:]</p>\n<p class=\"stiles\">I ran out of parking tickets. Hope you're not opposed to index cards. Or printer paper. Or the backs of receipts. There's only so much you can steal from a police station before they get wise.</p>\n<p>Stiles has been leaving notes for a month and a half when his Jeep breaks down in the rain. </p>\n<p>Well, no. The Jeep doesn't break down in the rain; the Jeep breaks down, and <i>then</i> it starts to rain. Right after Stiles realizes that he can’t leave the car on a poorly-lit, wooded back road, but before he manages to painstakingly shove it to the side of said road and consider his options. It's the kind of downpour that starts out of nowhere but manages to immediately drench everything in touches, which is probably why it causes Stiles to fall over in the sudden mud and send his phone flying.</p>\n<p>Into a puddle. Which causes the phone to spark dangerously and then, horror of all horrors, die a sad, watery death. Stiles swears and picks the thing up between two fingers; it fails to electrocute him, but he's actually not sure if that's a good thing right now or not. </p>\n<p>\"Motherfucking shit fuck,\" Stiles says to no one. He's two miles outside of town, soaking wet, mud-covered, without a phone, and it's two in the goddamn morning on a Friday night. His dad's at Melissa's, and won't know to look for him. Scott's at Allison's, and won't know to look for him. The entire pack probably thinks he's at home, because it's not like he mentioned to anyone that he was going to Jungle to try and fail to get laid. Mox definitely thinks he’s at home, because he said that’s where he was going when he left the club. His life is a tragic tale. A tragic tale that, after all that build-up to ending in grisly murder, is apparently going to end in pneumonia. </p>\n<p>Devoid of other options, Stiles sighs and starts walking. Maybe, if he's very lucky, there'll be an axe-murderer in the woods; it would be a shame to waste the build-up. </p>\n<p>After ten minutes, the rain lets up; after fifteen, the bushes at the side of the road <i>do</i> rustle. Stiles goes still and silent, reaching into his back pocket carefully to pull out and turn on his taser. This is what he gets, he supposes, for wishing an axe-murdering upon himself. At least it'll be quick--either Stiles' taser will charge up in time or there'll be an axe embedded in his neck within minutes, but either way, it's not likely to be a lengthy showdown.</p>\n<p>And then the bushes open and Derek says, \"Stiles,\" like he's just, you know, offering a casual greeting. </p>\n<p>Stiles' shoulders sag in relief despite himself. \"You were supposed to be an axe-murderer.\" </p>\n<p>\"Sorry to disappoint,\" Derek says, and Stiles thinks there's a glimmer of humor around his eyes. Then again, he's freezing to death and covered in mud; wishful thinking is probably much more likely. \"What are you doing out here?\" </p>\n<p>\"It's a new exercise regime,\" Stiles says brightly, turning the taser off again. It occurs to him, kind of distantly, that this is the first time he and Derek have been alone together since Stiles started with his little epistolary campaign--maybe Derek's lack of axe-murdering plans <i>is</i> a disappointment. \"What you do, right, is deposit yourself in the center of the woods, cover yourself in mud, take a quick dip in some rain water, and then walk until you see something vaguely resembling civilization. Very cutting-edge. All the celebrities are doing it.\" </p>\n<p>\"Ha ha,\" Derek says, dry. He's scowling now, all the humor gone. \"And the real reason? You're soaking wet. It's the middle of the night.\" </p>\n<p>\"Is it <i>really</i>?\" Stiles says before he can help himself. \"My god, is that what all the darkness is about?\" </p>\n<p>\"Stiles.\" </p>\n<p>\"My car broke down,\" Stiles admits. When Derek's eyebrows go up, Stiles shuffles his feet and looks down at the ground. \"And it's possible that in trying to get it off the road--for the safety of the Beacon Hills citizenry!--I may have, uh. Dropped my phone. Into a puddle. And killed it. By accident. Mistakes were made, Derek, sometimes things happen, it can't be helped.\" </p>\n<p>Despite the fact that this is the full story, Derek looks far from mollified. He glares at Stiles; when Stiles glares back, Derek sighs and says, \"<i>And</i>?\"</p>\n<p>\"<i>And</i> what?\" Stiles says. \"That's it, that's the whole story, driving the car, car broke down, tried to move it, dropped the phone--oh, yeah, the mud. I kind of fell over a little, that's how the phone ended up--\" </p>\n<p>\"Why,\" Derek says, slowly and like Stiles is an idiot, \"were you driving around in the woods at this time of night in the first place?\" </p>\n<p>\"Ah,\" Stiles says. He thinks about that for second. \"Can I plead the fifth?\" </p>\n<p>\"You cannot.\" </p>\n<p>\"Can I plead embarrassment?\" Stiles tries. \"Or…chilly? Yeah, that's it, I am too chilly to properly remember the circumstances that lead me to--uh. <i>Uh</i>. What are you--oh.\" Stiles stops talking, because Derek has stripped off his jacket--his <i>jacket</i>, his black leather jacket that he loves even more than he loves that stupid car, if how possessive he is of it is anything to go by--and draped it over Stiles' shoulders. \"Uh. Really? I mean, thank you, but…really?\" </p>\n<p>\"I'm going to get my car,\" Derek says. \"<i>Stay here</i>, and turn your taser back on. I'll be back in fifteen minutes. Do not do anything stupid, and do not think for one second that I'm not going to make you tell me what the hell you were doing out here.\" </p>\n<p>Then he <i>bounds the fuck back into the woods</i> before Stiles can say anything. What the hell. What. The. Hell.</p>\n<p>When Derek returns, he is, indeed, in his Camaro. He's also put a one of his stupid henleys on the passenger seat, and flatly refuses to start the car, or give Stiles his phone to leave a message with his trusty tow service, until Stiles strips out of his own wet shirt and puts it on. <i>Then</i> he glares at Stiles until Stiles puts the jacket back on. It's all very strange. </p>\n<p>\"It's summer,\" Stiles points out a little bitterly, when Derek nods, satisfied, and starts the car up. \"Even my delicate humanity is not likely to suffer hypothermia in July.\" </p>\n<p>\"Because you're so trustworthy on the topic of your own weaknesses,\" Derek says.</p>\n<p>Stiles rolls his eyes, stung and trying to cover it. \"Unnecessary roughness!\" </p>\n<p>\"Is it?\" Derek gives him a sidelong look that Stiles can't interpret, which is just as well, because a second later he says, \"So. Two in the morning, middle of the woods: your reason?\" </p>\n<p>\"Hunted by rogue KGB assassins,\" Stiles says promptly. He may have used the time Derek was gone to brainstorm. \"Verbally tormented by a magical squirrel? Attempting to flee the rap for poisoning the water supply. Desperately in love with a wood nymph! Answering a plea from two young lovers trapped on opposite sides on a crumbling wall.\" </p>\n<p>\"That last one was Pyramus and Thisbe,\" Derek says. His tone of voice is surprisingly mild. \"<i>And</i> that's not even how the story went. What's the truth?\" </p>\n<p>\"The truth is…embarrassing.\" </p>\n<p>\"What <i>is</i> your definition of embarrassing, exactly?\" Derek says, and Stiles flushes. This is exactly why he's been…well, not avoiding Derek, exactly. Just avoiding being in situations where Derek might have the opportunity to mention that Stiles has been writing him short little basically-diary-entries for reasons even he doesn't have a handle on for over a month. He cuts his eyes to the left, expecting Derek to look cruel, or at least brooding; instead, Derek's cheeks are flushed too, and he's biting his lip like he didn't mean to say that. Stiles looks away, confused, until Derek says, \"I mean…I mean I'm your alpha, and this isn't responsible behavior. Explain yourself!\" </p>\n<p>Stiles can't help but snort. \"Really? 'Explain yourself, I’m the alpha,' that's your play?\" </p>\n<p>\"Stiles, would you just tell me?\" Derek says. He sounds weary. \"You know I'm going to make you. I know you know I'm going to make you. Can't we just cut to the chase?\" </p>\n<p>\"Fine,\" Stiles says. He huffs out a breath, looks out the window, and swallows down the humiliation of the whole thing; he's just going to deal with this. Hell, he's just going to say what he probably would have ended up saying, eventually, in one of the stupid notes. \"I was at Jungle, doing my utmost to appear an alluring sexual prospect to the local gay population. And, obviously, failing spectacularly. Mud included. Satisfied?\" </p>\n<p>\"Are you gay?\" Derek says, sounding…shit, Stiles doesn't know what to call that tone of voice. Curious? Concerned? Trying to talk about anything that isn't Stiles' deeply mortifying lack of game? \"I mean, I know you and Danny were, uh, involved, but Isaac seems to think you're planning on making a move on Erica. They fight about it. Loudly.\" </p>\n<p>\"Ugh,\" Stiles says, because <i>ugh</i>, of all the conversations he doesn't want to have with Derek freaking Hale. He shifts in his seat. \"Okay, well, thing one: I love Erica, but only as a friend. Isaac's being a tool about it, god knows why. And thing two: bisexuality is actually a thing that exists, dude. In concept and practice. And I am possessed of it in spades, not that it's any of your business.\"</p>\n<p>\"Oh,\" Derek says. After a long pause, \"Me too.\" </p>\n<p>\"You, too, agree that my sexuality isn't any of your business?\" </p>\n<p>The corner of Derek's mouth twitches up; Stiles sees it, it happened, he's sure. \"I, too, am bisexual.\" </p>\n<p>\"Oh,\" Stiles says. He blinks at Derek a couple of times, and then a couple more, just for good measure. \"I--<i>really</i>?\" </p>\n<p>This time, the corner of Derek's mouth doesn't twitch up so much as stay there. \"Is it really that much of a shock?\" </p>\n<p>\"You, freely offering up personal information?\" Stiles says. \"Yes, it's a shock. It might even be the shock of the century. Somewhere, right now, there's a pig oinking in terror at its newfound ability to fly. <i>And</i> I bet they're throwing snowballs in hell.\" </p>\n<p>Derek doesn't say anything else, because of course he doesn't. Because naturally, that is how Stiles' life works. Object of his deep-attraction-if-not-necessarily-affection, recipient of his assorted nonsensical missives, disgustingly hot alpha werewolf Derek Hale divulges his bisexuality on a whim and then clams up entirely; why, exactly, is Stiles even surprised? He settles back against his seat, pulling Derek's jacket tighter around him in the hope that he'll stretch the leather and <i>ruin</i> it. For some reason, Derek just smirks at this, and Stiles looks out the window, eyes narrowed with irritation. </p>\n<p>Still, he does find himself fingering the index card in his--well, Derek's, technically, but Stiles is going to count it as his for the moment--pocket. Because, yeah, okay, Stiles maybe wrote Derek a note while he was waiting for the bastard to return with his car, because it's possible that Stiles has started carrying paper and a pen with him everywhere he goes, in case he runs into Derek's car. Or Derek's…mailbox. Or, sometimes, the pocket of this very jacket, when Derek has tossed it somewhere and isn't looking at Stiles. And, all right, if pressed Stiles might <i>also</i> be willing to admit to the possibility that he's kind of pinpointed the places Derek's car is likely to be at a given time on a given day. He figures it doesn't count as stalking if the other guy stalked you first; clearly, stalking is part of how one bonds with Derek. Stiles is only being considerate. </p>\n<p>The note, damp but readable, says, <i>I don't understand you</i>. Stiles isn't sure if it's a good thing or a bad thing that this drive has only made it more true, but either way, it's not a shock. </p>\n<p>When they pull into Stiles' driveway, he tucks the index card between the seat and the cupholder just as Derek says, \"Stiles?\" </p>\n<p>He freezes, wondering if Derek was just waiting for the chance to catch him out and <i>add</i> to the humiliation, and says, \"Yeah?\" </p>\n<p>\"Don't do this again,\" Derek says. When Stiles opens his mouth to say that it wasn't, you know, <i>his fault</i> that circumstances aligned against him, Derek holds up a hand and says, \"I could've been an axe murderer--you were joking, but I'm not. The local gay population is clearly too stupid to be worth your time. At the very least, use the main roads if it's after dark.\" </p>\n<p>\"Uh,\" Stiles says, blinking at him, \"o…kay?\" </p>\n<p>\"Okay,\" Derek agrees, and waves a hand like Stiles is free to go.</p>\n<p>Stiles gets out of the car kind of blindly and more or less stumbles into the house. He doesn't even realize he's still wearing Derek's jacket until he's shut the door behind him, stared blankly into the darkness, and said, \"Too stupid to be worth your <i>time</i>? What does that even <i>mean</i>?\" to absolutely no one.</p>\n<p>The next morning, it's still unseasonably cold and rainy, and Stiles stares at Derek's jacket for almost fifteen minutes before he swears and leaves his bedroom without it. He comes back upstairs twenty seconds later, glares at the jacket for ten more minutes, swears again and puts it on. He shoves his hands into the pockets, grumbling and glancing out the window like he's afraid Derek will be there to judge him. </p>\n<p>Which is when he notices the flash of white sticking out from beneath his window frame, the sharp edge of crisp paper. Stiles just kind of <i>looks</i> at it for a second, and then he walks over, glances over both shoulders, opens the window and glances out both sides of that, too. He picks up the envelope--because that's what it is, a plain, white envelope, unmarked and shoved just far enough under the window to avoid getting soaked through or blowing away--and realizes, to his own horror, that his hands are kind of shaking. </p>\n<p><i>You could work on your subtlety,</i> the piece of paper inside says, in the weirdly intricate, curling script that Stiles has long since accepted as Derek's handwriting. <i>You could work on your subtlety,</i> and absolutely nothing else. </p>\n<p>Stiles looks at it. He looks at it for awhile longer. He touches the edge of the writing with his index finger before he pulls it away like he's going to burn himself on his own weird sentimentality, what the hell. He looks at it again. </p>\n<p>\"I could work on my <i>subtlety</i>?\" he says eventually, but he's smiling.</p>\n<p>After he picks up his car from the mechanic, Stiles spends nearly an hour at Beacon Hills Mall, getting increasingly annoyed looks from the sales staff at various stores and very nearly giving himself a full-blown asthma attack in his quest for the best. It's worth it, though, because eventually he finds the single most foul-smelling perfume he has ever encountered. For the first and hopefully only time in his life, he thanks the universe for creating Bath &amp; Body Works and buys a bottle.</p>\n<p>Then he goes out to the woods--it's not like he wants his house to smell like this crap, Jesus--and soaks an index card in the stuff, kicking back against a tree and rereading Lovecraft while it dries. When the surface is writable again, Stiles takes a red pen and scrawls, <i>Subtle enough for you?</i> sideways across the card, and then stuffs the whole pungent mess of it into the TARDIS-blue envelope he'd bought on a whim in the mall's stationery store. </p>\n<p>Then he drives across town. Derek takes whichever of his wolves are available for runs a couple of times a week, announcing the times at pack meetings and leaving the option to join him open, but Stiles knows he's been running alone a lot this summer. He thinks Derek's probably trying learn to give the pack space to handle their lives, but he also thinks it must kind of suck, running around the woods by yourself. </p>\n<p>Not that Stiles cares. Or anything. At all. </p>\n<p>Except that he does care, a little, because it's how he knows that Derek's on one of the runs now. That means his car is parked in the public lot at the end of First Street, because that's where they always end; Derek likes to lead them from his house to the middle of the woods and then down into civilization, where everyone can do things like buy Gatorade or use a gas station bathroom. Stiles grins when he spots the Camaro and all but skips his way over to it, tucking the envelope under the front windshield and hurrying back to his car. He circles around the block, meaning to drive away, and instead finds himself parked at the farthest end of the street, waiting. </p>\n<p>He's never stuck around to see Derek find one of these things before. It had always seemed like the last weird straw, and, also, it's not like Stiles' <i>entire life</i> is centered around leaving notes for Derek or anything. He's got things to do! Places to be! The desire not to be immediately spotted by the being with superior senses and glared at and/or humiliated until he dies! Stiles has his priorities in order.</p>\n<p>But today, Stiles has used Scent, and he's pretty damn sure it's going to be super effective. Today Derek is going to be too busy fighting back the assault of that terrible smell to immediately notice that Stiles is nearby. Today is going to be <i>hilarious</i>. </p>\n<p>It only takes fifteen minutes for Derek to stroll up to his car, shoulders thrown back and face stormy, walking the walk of the dangerously attractive and occasionally actually dangerous. Sometimes Stiles thinks about pitching some network the concept of a Derek Hale reality show; Derek would never agree to it for a thousand reasons, but he does have a certain star quality, Stiles thinks. Maybe it's just that, until you've saved his life a couple of times, he's pretty good at sending off the non-verbal cue that he is above the proceedings around him and would like you, the viewer of his movements, to fuck right off.</p>\n<p>Or possibly Stiles is projecting. Whatever. The point is, Derek's got a hot walk; he isn't going to dwell on it. </p>\n<p>Stiles can see the exact moment the scent hits him; Derek freezes, sniffing, and then makes what is easily the most comically horrified face Stiles has ever seen in his life. He slaps both hands over his mouth and chokes on trying to keep his laughter silent; as he watches, Derek waves a hand in front of his face, frowns, and then skulks carefully towards his car, his face still twisted up in disgust. To Stiles' ever-increasing delight, Derek looks in all the windows, <i>and the trunk</i>, before he walks around to the front of the car and sees the blue envelope tucked under the windshield wiper. </p>\n<p>Derek's eyebrows go up, and just like that, Stiles isn't laughing anymore. He wonders, a little frantically, if there's any way he could start the car and drive away without Derek noticing; he seriously considers covering his eyes, and finds he can't quite bring himself to do it. He suddenly and viscerally doesn't want to see Derek doing this, doesn't want to watch as Derek…does what, exactly? Opens it up and rolls his eyes, or tosses it away, or scowls at it? God, maybe he'll set it on fire. Maybe he sets all of them on fire; Stiles wouldn't know. He doesn't <i>want</i> to know, but he does, too--so much that, for all his nerves are on overdrive, he can't help but keep his eyes fixed on Derek. </p>\n<p>This is why he just sits there, staring and wishing he could force himself to look the fuck away, while Derek turns the envelope over in his hands, shakes his head, and opens it, pulling the index card out. Stiles watches him stare down at it for a long moment, and he's starting to think that maybe this is what Derek does--that maybe Derek just stares at the things Stiles leaves him <i>until they disintegrate</i>--when he sees Derek's shoulders start to shake. It's very slight at first, the motion so negligible that Stiles thinks maybe he's imagining it, but after a second Derek's mouth is splitting open in a grin and…. </p>\n<p>Derek Hale. Is laughing. Stiles has made Derek Hale laugh. And it's not a sarcastic little chuckle, or a small, bitter snort; Derek is actually, genuinely, honest-to-god laughing, hard enough that his shoulders are shaking, that Stiles can see his grin from all the way back here. Stiles is…transfixed. Derek looks like an entirely different person like this, even from a distance, younger and warmer and more approachable than Stiles has ever seen him, and he stares and stares and stares and stares until he realizes, too late, that Derek is staring back at him. </p>\n<p>\"Fuck!\" Stiles yelps, flailing, and Derek's fading grin flares back to full-force, which means he probably both heard and saw that. Stiles crosses his arms over his chest and tries to scowl at Derek; he mostly fails, because it turns out to be hard not to smile at Derek freaking Hale when he smiles at you first. </p>\n<p>While Stiles watches, Derek picks up the card, points at it, and shakes his head, his grin shrinking down to a smirk. That takes Stiles a second, until he remembers that what the card actually said was <i>Subtle enough for you?</i> Then he does manage a proper scowl, and throws in a middle finger for good measure. Derek's smirk deepens, and he salutes--salutes!--before he gets into his car and drives away. </p>\n<p>\"So, I've officially lost control of my life,\" Stiles says faintly to his Jeep. She purrs awake under his hands when he turns her key, and he chooses to take it as consolation; after all, it's not like he's got a lot of other options.</p>\n<p>When Stiles gets home that night, after <i>finally</i> getting in some quality Scott-time, he flips open his laptop only to find an index card resting on top of the keyboard. Stiles spares a moment to be irritated that Derek risked damaging his screen that way before he picks it up and stares at it. </p>\n<p>It's the same card he left in Derek's car last night, but the words <i>I don't understand you</i> have been underlined with what looks like a heavy felt-tipped marker. Stiles wonders if that's the whole message, his own sentiment returned in kind, before he thinks to turn the card over. </p>\n<p><i>Why are you doing this?</i> the back says, Derek's handwriting. And that's the whole problem, isn't it; Stiles doesn't know.</p>\n<p>It takes Stiles an entire day to get up the nerve to do it, god knows why, but on Friday afternoon he drives to Derek's house. He's got the damn leather jacket in hand, and there's a piece of notebook paper folded into a tiny, compact square in its left pocket. He's not sure if he's hoping Derek will be there or not, but he's been feeling kind of weird about holding onto the jacket, and equally weird about not answering Derek's…response? Message? Whatever. This whole thing is beyond him. </p>\n<p>Of course, he doesn't even get the chance to knock before Derek is opening the door, barefooted in ratty-looking jeans and a tank top. Stiles swallows. He can do this. He is an adult. He has been aware of the attractiveness of the man in front of him since he was a mere child of only sixteen. He is eighteen glorious years old now; soon, he will be nineteen. He can buy cigarettes! And enlist in the military! And…and handle himself! </p>\n<p>\"Stiles,\" Derek says. </p>\n<p>\"Jacket,\" Stiles says. Goddamn it. \"I mean…your jacket. Is why I am here. To deliver it. Return it! Because it was, uh, nice of you. To let me borrow it. But it's…July…and since you're the only person I know who wears leather in July like that's, uh, normal, I thought it might be good. To give it back to you. Also, it's yours, so, here.\" </p>\n<p>\"Thanks,\" Derek says after a second. His eyes are crinkled up at the corners, and Stiles kind of hates how much, just this second, he feels like a deer caught in the headlights. It's been years since Derek made him feel like a deer caught in the headlights; Stiles has been a regular-ass dude in the headlights, at the very least, for ages. \"Uh. Do you want to come in?\" </p>\n<p>\"Oh!\" Stiles says. This was not part of the plan, because who plans for Derek taking a sudden turn towards the hospitable? He blinks, swallows, does not flail through force of will, and recovers with, \"I, um, I mean, you're probably doing stuff. Right? Things and, and stuff. And other things. I wouldn't want to, like, impose or anything.\" </p>\n<p>This time, the look Derek gives him involves no eye-crinkles. The crinkling has moved to his forehead. Tragically, it is not less attractive. \"Stiles. You have a key to this house.\" </p>\n<p>\"Yeah, but that's for,\" Stiles waves a hand, \"<i>you</i> know. Pack stuff. Werewolf…reasons. Not for me to like, crash your mid-afternoon half-dressed party. Not that you're not allowed to be half-dressed! In your own home! Just, uh. Yeah.\" </p>\n<p>\"I gave you a key for the same reasons I gave them to the rest of the pack,\" Derek says. He's apparently (thank god) choosing to ignore the rest of it, but he sounds confused. \"You're always welcome here--all of you. I assumed you didn't spend as much time at the house as the others because you didn't want to.\" </p>\n<p>\"I…what?\" Stiles stares at Derek for a long moment, and then makes the executive decision to abandon being blindsided by hotness for being <i>pissed as fuck</i>. \"Dude, <i>what</i>? What the hell? You handed me a key and said, 'I sincerely hope that you know that if you abuse this, I will not take it lightly.' What part of that was supposed to communicate that I was welcome to hang around whenever I felt like it?\" </p>\n<p>\"When we finished construction, I was running a pack entirely composed of high school juniors,\" Derek says. At least this territory--Stiles furious, Derek talking to him like he's a moron--is familiar. \"I gave that speech to everyone. I didn't want to have to deal with the possibility that one of you might decide to throw a rager while I was out of town.\" </p>\n<p>\"Did you just say <i>rager</i>?\" Stiles demands, and then waves Derek silent before he can reply. \"Never mind! Not the point! I thought--\" </p>\n<p>\"You thought what?\" </p>\n<p>Stiles opens his mouth to say something and finds that nothing comes out, because… because he thought that Derek didn't want him around, honestly. Stiles isn't like Scott or Boyd or Erica or Isaac or, hell, even Jackson, weres who can run with Derek and fight with Derek and train with Derek; he isn't like Lydia, magic oozing out of her at every turn, or like Allison, whose training and insight as a hunter made her an invaluable asset. He isn't even like Danny, because while Danny's just as human as Stiles, everyone knows he's planning on taking the bite when he's finished with college and made sure it's really what he wants from his life. Stiles isn't planning on taking the bite, not now, not after college, not ever. As hard as he tries--and oh, how he's tried--he genuinely doesn't want it, and it wouldn't be fair to lie about that, or to ask Derek to bite him <i>anyway</i>, against Stiles' will, on the theory that eventually Stiles would come around. </p>\n<p>So he's spent the year and a half since the construction wrapped mostly coming when he's called, showing up for pack meetings or the more-regular-than-is-healthy-but-honestly-less-regular-than-Stiles-would-like supernatural crises that tend to crop up. Sometimes he'll come by with someone else, Scott or Boyd or occasionally even Lydia dragging him into the house to hang out, but he's never made a habit of showing up solo. The rest of them had all chosen bedrooms pretty early on, all spending more and more time using them as their various parents were let into the loop, but Stiles had picked out an office, because he didn't want to be weird. Because there's being useful and then there's being needy and Stiles is painfully aware that he's not very good at knowing where that line is; he'd thought it best, all things considered, to err on the side of caution. </p>\n<p>He wonders, now, how that must have looked to Derek. He'd always assumed that Derek's scowls and glares when Stiles was around the house were about how completely and utterly Stiles was abusing his pack privileges, but it occurs to him that, just maybe, it was actually the opposite. Maybe Derek was annoyed because he thought Stiles was avoiding him, <i>them</i>, for reasons of his own. </p>\n<p>\"I, uh,\" Stiles says, after a long pause. \"I think I have to go.\" </p>\n<p>\"Okay,\" Derek says. </p>\n<p>It could be Stiles' eyes playing tricks on him, but he thinks Derek looks a little dejected, like that wasn't the answer he wanted. Which is probably why, before he can help himself, Stiles adds, \"But I'll come back! Like, okay, probably not today but I'll…I didn't think…I'll come back. I'll start being here more. If you want. Or not, if you don't. Whichever. Either way.\" </p>\n<p>\"That would be…good,\" Derek says, slowly and painstakingly and like it is costing him money. Stiles squints at him, and Derek clears his throat and clarifies, \"You. Being here more. Would be good.\" </p>\n<p>\"Good!\" Stiles says, and hears how crazy it sounds, high-pitched and like he's a lot closer than he actually is to losing his shit. Stupid voice. \"So, uh, I'll see you around, then?\" </p>\n<p>\"Yeah,\" Derek says. \"See you.\" </p>\n<p>Stiles bounds back to his car and makes it three whole blocks before he has to stop, rest his head against the steering wheel, and breathe until breathing no longer feels like a chore. Misinterpretations, he decides, are worse than boredom. Also, he thinks maybe he should have written a different note.</p>\n<p class=\"desc left\">[Note #88, left in Derek’s jacket pocket:]</p>\n<p class=\"stiles\"><u>Reasons Why I Am Doing This: An Incomplete List</u><br>\n<br>\n1. I have no fucking idea. Seriously. I really don't know.<br>\n<br>\n2. It's oddly freeing? Maybe that's because you don't answer them, so it's just like sending messages out to the void, who knows. I guess it's nice getting the chance to... I don't know. Put my thoughts down on paper? I've never really done that before. Never had the patience for it.<br>\n<br>\n3. I get bored. Like, a lot.<br>\n<br>\n4. It was really funny to think about you being pissed about a parking ticket only to find out it wasn't really a parking ticket. That's what actually started it. It's all a prank gone strange and awry.<br>\n<br>\n5. I'm having kind of a weird summer.<br>\n<br>\n6. You haven't told me to stop.<br>\n<br>\n7. We don't actually like, talk very much. At all. Outside of screaming and almost-dying, I mean. And since I'm planning on doing the werewolf-adjacent thing for pretty much the rest of my life (because now I know, so how could I do anything else? And, also, Alan would kill me if I decided to just abandon all our training and shit to, what, go into banking? What do real people even do for jobs?), and you're like, The Werewolf, I thought maybe we should get on that. Talking more, I mean.<br>\n<br>\n8. You are more forgiving than my former English teachers about how much I like run-on sentences, and I feel like you're not forgiving often enough in general for me to ignore the opportunity to further train you in how it works.<br>\n<br>\n9. Sometimes I want you to answer? Not that you should feel obligated to, but it's nice to think about, I guess. It's been cool, the last few days. Makes me feel a little less creepy about it when you write back.<br>\n<br>\n10. Because I kind of think that we might actually like each other, dude. If we stopped… not liking each other. Do we not like each other? This confusion is the real reason on this one.<br>\n<br>\n11. I'd like it if we liked each other. Full disclosure: I almost didn't write this one down.</p>\n<p>It's after the Incomplete Lists of Reasons that the one-side epistolary campaign really and truly becomes a two-sided epistolary campaign. No one is more surprised than Stiles. </p>\n<p>The first few of Derek's notes are sparse, either one-sentence questions or, more often, bitchy little criticisms that Stiles finds himself grinning at despite himself. One of them, to Stiles' unending amusement, is just a frowny face, in response to what was, admittedly, a mostly unjustified shitfit Stiles pitched during that afternoon's pack meeting. Stiles writes ridiculous things in response to every note he finds; some of it is the previously-established purposeless babble, but some of it is answers to the questions Derek asks, and sometimes, when Stiles is feeling very daring, he asks questions of his own. This is how he learns that Derek is allergic to both vinegar and cayenne pepper, and that Derek's lived in twelve states, and that Derek's favorite movie is <i>Fight Club</i>.</p>\n<p>Stiles' favorite movie, regrettably, is also <i>Fight Club</i>. He lies and tells Derek it's <i>Pulp Fiction</i> when Derek turns the question around on him; better to misrepresent himself than to come off as pathetically imitating Derek's choices. It's not fair at all, because he's seen <i>Fight Club</i> a hundred times since he and Scott first watched it, secretly and feeling like badasses about it, when they were thirteen, but whatever. Whatever! Stiles can make some sacrifices for the cause.</p>\n<p>Only no, actually, he can't, which is why he actually ends up writing an entire letter, two pages, front and back, to explain that he lied about <i>Pulp Fiction</i> because he didn't want Derek to think he was a poser, but that he is not, in fact, a poser, and has written this essay on his reasons for loving <i>Fight Club</i> to prove it. He doesn't find a note in his bedroom or car or windowsill for two days, but then a three-page handwritten rant about how <i>Paranormal Activity</i> is the worst movie ever made appears overnight. Stiles reads the letter with increasing amounts of incredulous laughter, concludes that Derek might be a <i>secret movie buff</i>, what the <i>fuck</i>, and gleefully writes out a response before he grabs his external hard drive and heads for his car. </p>\n<p>\"Hi,\" Stiles says, when Derek opens his front door. \"Paranormal Activity 2 is even worse; you wanna watch it?\" </p>\n<p>Derek blinks at him. Then, will wonders never cease, he smiles very slightly, pushes the door open wider. \"Sure. Come inside.\"</p>\n<p class=\"desc left\">[Note #107, dropped in Derek’s empty coffee cup while he’s paying for pizza:]</p>\n<p class=\"stiles\">You have terrible taste in everything. It's almost a gift.</p>\n<p class=\"desc right\">[Response #22, found in Stiles’ sneaker on his way out the door:]</p>\n<p class=\"derek\">Disliking anchovies is commonly considered good taste. There's something wrong with you.</p>\n<p class=\"desc right\">[Response #45, found in place of a bookmark in Stiles’ copy of <i>Night Watch</i>:]</p>\n<p class=\"derek\">STOP LEAVING THESE IN MY LAUNDRY I KEEP WASHING THEM</p>\n<p class=\"desc left\">[Note #124, left in Derek’s laundry:]</p>\n<p class=\"stiles\">Angry capitals at the loss of getting to read my missives? I think I'm touched.</p>\n<p class=\"desc right\">[Response #46, found stapled to Stiles’ laptop case:]</p>\n<p class=\"derek\">That's not what I meant. There's ink on my favorite shirt.</p>\n<p class=\"desc left\">[Note #125, left in the second drawer of Derek’s dresser:] </p>\n<p class=\"stiles\">How can you possibly have a favorite shirt? Every shirt you own is the same as the next one. I spent an entire year in high school trying to figure out if it was possible that you just had ONE shirt, worn many times.</p>\n<p class=\"desc right\">[Response #47, found inside an empty bottle of Snapple in Stiles’ car:]</p>\n<p class=\"derek\">Hours spent thinking of me? I think I'm touched.</p>\n<p class=\"desc left\">[Note #126, left wrapped around Derek’s car key:]</p>\n<p class=\"stiles\">Don't be a dick.</p>\n<p class=\"desc right\">[Response #48, found in Stiles’ dirty clothes hamper:]</p>\n<p class=\"derek\">Don't leave notes in my laundry!</p>\n<p class=\"desc left\">[Note #201, shoved under Derek’s couch cushions:]</p>\n<p class=\"stiles\">I've been trying to sleep for four fucking hours and I can't do it. I keep having this nightmare where Scott decides he wants to be with Allison too much to stay here and takes off to the East Coast without telling me and I don't get there in time to keep Chris Argent from accidentally-on-purpose chopping him in half. Which is ridiculous, right? I mean, a few years ago, maybe not, but Scott would never do anything to risk himself or the pack these days, and he’d TELL me, and anyway Chris isn't in the hack-the-undeserving-in-two business. I guess.<br>\n<br>\nI don't know why I keep telling you this stuff. Like, even in writing this down I'm thinking, \"Derek doesn't need to know that, why the fuck would you tell Derek that,\" but I know I'm going to end up shoving it under your couch cushions tomorrow. Even if I think I shouldn't. Maybe especially if I think I shouldn't. I don't even know what I'm writing anymore. </p>\n<p class=\"desc right\">[Response #110, found beneath Stiles’ windowsill:]</p>\n<p class=\"derek\">For my money, an Argent-based nightmare is never that ridiculous. Stop drinking those stupid energy drinks and this problem will solve itself. Also, you'll smell better.</p>\n<p class=\"desc right\">[Response #147, written on the back of a photograph found inside Stiles’ wallet:]</p>\n<p class=\"derek\">When I was living in Montana, I mostly worked as a rodeo clown. I had to stop because I was starting to get too well-known, but it's not bad work if you've got a healing factor. If you EVER show ANYONE this photo, I swear to god I will forgo the courtesy of wringing your neck and just blackmail you with all the information you've spent the summer giving me. Happy birthday.</p>\n<p class=\"desc left\">[Note #208, left on Derek’s nightstand:]</p>\n<p class=\"stiles\">OH MY GOD. Okay, I'm going to need a grace period to come up with every rodeo clown joke I can think of. Two, three days. Sit tight.<br>\n<br>\nI can't believe you knew it was my birthday.</p>\n<p class=\"desc right\">[Response #148, found in the pocket of Stiles’ third-favorite hoodie:]</p>\n<p class=\"derek\">You do tend to be surprised by the wrong things.</p>\n<p class=\"desc\">[Notes #270-274 and Responses #198-203, exchanged over the course of a two-hour pack meeting largely as crumpled-up paper projectiles:]</p>\n<p class=\"derek\">Your hair looks stupid today. Nobody's hair should go that high off their head. You look like a Disney villain.</p>\n<p class=\"stiles\">Have you been sitting on that all this time? That's sad, Derek. And I was electrocuted! My hair is this way for reasons of painful science!</p>\n<p class=\"derek\">You were not ELECTROCUTED.</p>\n<p class=\"stiles\">Was too.</p>\n<p class=\"derek\">I would've been able to smell it. That was static electricity. Kelpies generate it when they're out of water too long. You know that. I know you know that. Don't milk it.</p>\n<p class=\"stiles\">I'm just saying, there are singe marks on my favorite shirt.</p>\n<p class=\"derek\">How can you possibly have a favorite shirt? Aren't they all the exact same ugly plaid?</p>\n<p class=\"stiles\">Imitation is the sincerest form of flattery. Thus, I am choosing to look at your shamefully obvious and deeply pathetic recycling of my insults as a compliment.</p>\n<p class=\"derek\">You do that.</p>\n<p class=\"desc left\">[Note #300, left in Derek’s Camaro:]</p>\n<p class=\"stiles\">Stupid, obvious, possibly offensive question: to you ever think about what your life would be like if you were someone else? Or if you were…I don't know, you in another universe? Trousers of time, if that's even a reference you get. </p>\n<p class=\"desc right\">[Response #234, found in Stiles’ Jeep:]</p>\n<p class=\"derek\">Every day. And I got the reference.</p>\n<p class=\"desc left\">[Note #301, left tucked inside a dogeared copy of <i>Thief of Time</i> in Derek’s mailbox:]</p>\n<p class=\"stiles\">I used to think a lot about a version of myself who'd had the most normal childhood imaginable--no ADHD shit, no mom dying, eventually no werewolves (no offense). But now I kind of think that Stiles' life might've turned out to be empty and boring. He's probably a banker or something. I think I'd rather be a rockstar. Or a television personality. Or a rodeo clown.<br>\n<br>\nI'm not fishing for anything here; I'm worried you're going to think that. Don't think that. I'm just curious, in general, on the topic of my insanities and whether or not they're shared. When I asked Scott if he'd ever imagined himself being someone else, he looked at me for a long time and then said \"Like, if I was Harry Potter?” and I just thought you might...fuck it, I don’t know.<br>\n<br>\nIt figures you've read Pratchett. You're such a geek deep down, it's ridiculous. </p>\n<p class=\"desc right\">[Response #235, found under Stiles’ pillow:]</p>\n<p class=\"derek\">Being a rodeo clown isn't all it's cracked up to be, and your bizarre insistence that all \"normal\" people bank for a living is never going to make sense.<br>\n<br>\nI used to think about who I would be if more of my family had survived the fire, or if it had never happened, but I had to stop. It was too easy to let it become all I thought about, and it was affecting the way I was running the pack. Laura always told me that you have to let go of the past to fully live in the present, but it took me longer than it should have after becoming alpha to fully understand what she meant. Now I do what I can to only dwell on those things that I can actually affect in the here-and-now, with…varying degrees of success. I do think a lot about what would've happened if I'd <u>been</u> a different person, made different choices. Sometimes I think about what it would be to live a solitary life, just me and the woods, but I guess it's more of a daydream than anything else.<br>\n<br>\nNobody's normal, if that's what you're worried about. Even when they seem like it. Especially when they seem like it. Stop obsessing and be glad that you're you. </p>\n<p>So Stiles basically spends the rest of the summer hanging out at Derek's. Whoops. </p>\n<p>It's not like he <i>intends</i> to do it. What he <i>intends</i> to do is watch a couple of movies with Derek, maybe get a little more comfortable hanging around solo at Casa de la Hale, and possibly, in the spirit of friendship and decreasing the amount of stalking he's lately been up to, develop the habit of delivering his notes when he happens to be on-property. Except that he and Derek kind of start exchanging a lot of notes. Like, multiple-rounds a day a lot. Like, so many that sometimes Stiles will stick one under a coffee cup, leave the room for twenty minutes, and come back to find something poking out from beneath his laptop. </p>\n<p>Which means he's at the house. A lot. To drop the notes off, and to watch movies with Derek, who does indeed turn out to be a secret movie buff, who knew? And after that starts, well, it's not <i>right</i> that nobody's ever introduced Derek to Fallout or Bioshock, Stiles obviously has to rectify that. And then, during said rectification, it becomes apparent that Derek is just as stressed out about college and Allison and Lydia's impending departure and how much time the pack isn't spending together as he is; Derek just doesn't actually know how to enforce mandatory bonding time when it's not directly related to possible carnage.</p>\n<p>But Stiles does, which is how he finds himself organizing movie nights, and bowling trips, and barbecues, and a Slip 'n' Slide competition, and, fine, basically everything he's been wanting to do all summer. It's a lot easier, he discovers, to call up all his friends and ask them to hang out when the full sentence includes the phrase, \"and Derek says we should.\" Not that Stiles needs Derek as an excuse to hang out with the pack; he doesn't. At all. But that fear that always itches at him when he picks up the phone, the niggling doubt that wonders if this will be the time someone says, <i>We'll hang out, Stiles, just not with you</i>, kind of vanishes once Stiles knows that having Stiles around is something Derek wants. </p>\n<p>And Derek…does want Stiles around. That much becomes incredibly obvious incredibly quickly, to Stiles' deep surprise. Stiles is actually so surprised that, around the middle of August, the emotion hits some kind of ceiling Stiles hadn't previously known was there. There's only so many times that Derek can look at him with sad eyes when he starts getting ready to leave, so many times Derek can ask if he wants to stay for dinner, so many times he can wake up on Derek's couch covered by a blanket he wasn't wearing before, before Stiles kind of <i>has</i> to stop being surprised. So it all kind of coalesces into a gigantic ball of perpetual shock that Stiles has mentally labeled \"Friendship with Derek Hale: What The Fuck,\" and that lives on at a low hum in his chest. </p>\n<p>Friendship with Derek Hale, as it turns out, mostly consists of strangely comfortable silence regularly broken by arguing. Arguing about the right way to make coffee and the wrong way to appreciate The Strokes; arguing about who's saved whose life more times; arguing about where Stiles put his backpack and why all of Derek's favorite takeout places don't deliver. It's actually kind of more fun that Stiles has had in a long time, because Derek seems to take the part of Stiles that can't ever manage to pull a punch in stride. Hell, Stiles thinks Derek might even <i>like</i> that part of Stiles, because it's not like Derek's ever pulled a punch in his life, and he gets so comfortable being himself around Derek that he realizes, a few years too late, how long he's spent trying to be someone else. </p>\n<p>The pack notices that something's changed, of course; Stiles isn't worrying about it, because everyone's being ridiculous. Scott keeps giving him weird looks and Boyd flat-out asks about it one night, narrowing his eyes and looking away when Stiles tells him that nothing's happening, really, he swears it's not. Lydia sends him several text messages informing him cheerfully that she <i>will</i> get it out of him eventually, Erica keeps flicking him on the arm and raising her eyebrows, and there's a message on his voicemail from Allison one morning that just says, \"I know everyone's been kind of busy this summer, Stiles, but I hope you know that I'm always around if you want to talk.\"</p>\n<p>The thing is, though, that Stiles <i>doesn't</i> want to talk. Which…is weird, both because Stiles rarely finds himself positioned against talking and because Stiles doesn't know why, exactly, he's not eager to spill the details of this to anyone. It just feel private, somehow, like it's for him and Derek and nobody else, and if that makes Isaac pull faces at how often Stiles is on the living room couch, makes Jackson roll his eyes and mutter about playing favorites under his breath, well, so what? Derek doesn't seem to have a problem with it, and Derek doesn't seem inclined to tell anybody about it, either, and Stiles likes that. Likes having something secret that isn't really secret at all. Likes that, in avoiding talking to everyone about it, he can avoid talking to <i>himself</i> about what it all means. </p>\n<p>There are conversations even Stiles can't quite handle, after all. There are truths even Stiles can't lie his way around. </p>\n<p>The end of August comes before Stiles is expecting it to, and suddenly they're throwing a barbecue for Allison and Lydia's last night in town. Everyone's invited--the pack and their assorted parents, Alan and Ms. Morrell, the handful of other supes they've gotten friendly with over the years. Even Chris Argent shows up, not that anyone--Chris included--seems particularly thrilled about it. Stiles spends most of the night avoiding Danny, stealing whatever moments he can with Lydia, accepting that he's not actually <i>going</i> to be able to steal any moments with Allison, and trying to make sure his father doesn't spend enough time with any of the faeries to encounter their dangerous sense of humor. It's not stressful, exactly, but it's not a relaxing evening either, and everyone's been mingling out back for almost two hours before Stiles realizes he hasn't seen Derek since everyone showed up. </p>\n<p>\"The pretty blonde guy in the corner,\" Stiles says in Melissa's ear as he passes her, \"<i>please</i> make sure he doesn't trick my father into a life of terrible crime,\" and slips into the house before she can ask any questions. It'll be better for everyone. </p>\n<p>Derek's not inside, which is unsurprising. He's also not on the front porch, which, while not <i>that</i> surprising, is kind of disappointing. Find The Alpha, though it is not without merit, is the kind of game Stiles really prefers to play in daylight. Sighing and kicking at rocks as he walks, he ambles across the property until he reaches the edge of their immediate territory line, the one Stiles and Lydia once spent three days warding from intruders. There's a bench there that Boyd made with Derek as part of their extensive alpha-to-second bonding rituals--something about Creating As We Destroy, Stiles doesn't remember it now--and Derek's up in a tree about ten feet away, eyes glinting alpha red. </p>\n<p>\"Well, this looks healthy,\" Stiles says, sitting down on the bench and craning his neck to look at Derek. \"Very well-adjusted, responsible adult, the look you're rocking. You should do pamphlets.\" </p>\n<p>\"That doesn't even make sense.\" </p>\n<p>\"Because sense is such a thing for you,\" Stiles says, rolling his eyes. \"What're you doing?\" </p>\n<p>There is a long pause, and then Derek says, \"Keeping watch. Someone has to.\" </p>\n<p>That, Stiles thinks, is a tricky one. Oh, he could point out that this entire area is coated with a ridiculous amount of enchantments; he could mention that anyone thinking of attacking a werewolf pack gathering, let alone one attended by faeries and hunters, would have to be seriously out of their minds; he could even bring up the fact that Derek has admitted, on more than one occasion, to being aware of his own paranoia. But Derek's admitted that in writing, and that's another thing that doesn't get talked about--Stiles and Derek spend a ridiculous amount of time together, lately, and write each other a ridiculous amount of frankly overly-revelatory nonsense, but they don't ever cross those streams. Derek doesn't call Stiles on the assorted truths to which he has confessed on paper, and, in return, Stiles doesn't use Derek's scrawled out honesty to win arguments. What happens in the notes stays in the notes, as far as Stiles is concerned. The fact that their agreement on that fact is tacit kind of only proves his point. </p>\n<p>\"Well,\" Stiles says, \"could you keep watch down here, then? Your not being taller than me is sort of a security blanket I have. Like, 'Well, ravenous monsters may be coming from your soul, but at least Derek Hale doesn't tower over you,' kind of thing. It's good for my manhood. And, also, werewolves in trees? Not exactly dignified, dude. Trees are a cat thing.\" </p>\n<p>\"If I come down there,\" Derek says, narrowing his eyes, \"will you shut up?\"</p>\n<p>\"Probably not,\" Stiles admits, \"but at least I'll be talking more quietly.\" </p>\n<p>Silence for another second; then there's a soft rustle, and Derek's jumping to the ground from fifteen feet and landing in a crouch. Stiles rolls his eyes, because Derek's showing off, and Derek smirks, because he's an <i>asshole</i>. The quiet holds between them for a few minutes as Derek stretches out next to Stiles on the bench, kicking his legs out in front of him. </p>\n<p>\"So,\" Stiles says eventually, \"be honest: it's a) Chris Argent, b) Chris Argent, and c) people in general, right?\" </p>\n<p>\"Was that…a question?\" Derek's clearly trying to scowl at Stiles, but there's a slight upward pull to the corners of his mouth, so he doesn't quite manage it. \"Because if you want me to be <i>honest</i>, I think I'm going to need to know what about.\" </p>\n<p>\"Your reasons for edge-of-the-property skulking, obviously.\" Stiles narrows his eyes when Derek raises his eyebrows and says, \"Oh, do not <i>even</i>. This is totally skulking. You are absolutely a skulker. The word skulk was invented specifically for you, and has been waiting all its skulky little life for you to show up and make it relevant.\" </p>\n<p>Derek's smirk is a thing to behold; a little darkly, Stiles wishes someone else were beholding it. It's kind of hard to ignore. \"'All its skulky little life’?\" </p>\n<p>\"Shut up,\" Stiles says, \"we're talking about <i>your</i> skulky little life right now. What's going on?\" It occurs to him, a little late, that Derek might actually be keeping watch for something <i>specific</i>, and he adds, \"It's not the kelpies again, right? Because I really did not like the kelpies, and if they're coming back I'd like to leave you here and return with a shotgun. And possibly some implements of torture, I fucking loved that shirt they ruined.\"</p>\n<p>\"Because wanting to torture insane sea beasts over a ruined shirt is so, ah,\" Derek pauses, like he's relishing the word, \"<i>healthy</i>.\" </p>\n<p>\"Don't be a dick,\" Stiles says. \"Answer the question.\" </p>\n<p>\"It's not kelpies.\" </p>\n<p>\"Not that question!\" </p>\n<p>\"I hate these things,\" Derek says. He kicks at a nearby stone; it flies through the air and embeds itself in a nearby tree trunk, which would be unsettling if Stiles hadn't seen him do it before. \"It's a recipe for disaster, putting this many people in one place. It's asking for trouble.\" He pauses again, quirks a sharp little smile, and adds, \"Also, I make terrible small talk.\" </p>\n<p>Stiles sighs, because on his list of Shit He Cannot Say Out Loud, <i>I feel really fucking bad about how your family was burned alive</i> is pretty close to the top. \"Why do you let us throw them, then? If you hate us having them so much?\" </p>\n<p>\"It appeases everyone,\" Derek says, shrugging and tensing up. \"And I don't hate that we have them, exactly. It's your families; it's what I signed up for when I turned you. Or, well, obviously not you specifically, but… When I made you all pack, I was asking for this on some level. To a certain degree, it's an inevitability--you have families, and you should be able to include them in this part of your lives, if only a little.\"</p>\n<p>\"Oh,\" Stiles says. He thinks about that for awhile, winces, and says, \"If I try to make poignant observations about, like, found family and shit, you'll snarl at me and disappear into the woods, won't you?\" </p>\n<p>\"Faster than you can say, 'emotionally constipated,'\" Derek confirms, but his shoulders relax, just slightly.</p>\n<p>\"That is what I would say,\" Stiles says cheerfully. \"Or, uh, yell. Into the forest. Because you would already have run away, leaving me to languish alone on this bench for five or ten entire minutes, you hypothetical bastard.\" </p>\n<p>\"Well, you know me,\" Derek says, and there's that dark humor twisting his mouth again, the kind Stiles can't help but like. \"Heartless.\" </p>\n<p>\"Is that what the kids are calling it these days? Here I thought you were a pain in the ass.\"</p>\n<p>Derek's eyebrows go up, and Stiles isn't sure when he developed the ability to discern the fact that it's a playful gesture. Or, quite frankly, when he developed the ability to produce playfulness in <i>Derek Hale</i>. \"Sorry, think you've gotten you and me mixed up.\" </p>\n<p>\"I bet you think you're real funny,\" Stiles says, but he grins and shakes his head after a second, looking down at his hands. \"You <i>are</i> funny, is the weird part.The cognitive dissonance on that one, man, I can't even tell you.\" </p>\n<p>\"I know the feeling,\" Derek says. When Stiles shoots him a sidelong look, confused, Derek runs a hand through his hair. \"Tell you what, Stiles. You go out and find yourself the loudest-mouthed, most obnoxious teenager in town. Spend a few days with him. Really let it <i>get</i> to you. Then you'll get it.\" </p>\n<p>\"Oh,\" Stiles says, his mood souring. \"Because I'm an obnoxious, loud-mouthed child?\" </p>\n<p>\"Because you turned out not to be, despite all appearances to the contrary,\" Derek says. \"Talk about cognitive dissonance.\" </p>\n<p>Stiles can feel his cheeks heating, and knows--goddamn it--that Derek has to be able to see it, his night vision being what it is. \"Jesus, a compliment. Who are you and what have you done with Derek?\"</p>\n<p>\"Maybe you deserved it,\" Derek says, and shrugs when Stiles gives up and flat-out gapes at him. \"Or maybe you didn't. I could be buttering you up for something.\" </p>\n<p>\"Not like you,\" Stiles decides after a moment's consideration. \"You're much more likely to threaten than charm.\" </p>\n<p>Derek grins, bright and wide and a little dangerous in the moonlight. \"I don't understand how I'm the one whose compliments are a surprise. You're much less kind than I am.\" </p>\n<p>\"Bullshit.\" </p>\n<p>\"A minute ago you were talking about torturing kelpies,\" Derek points out, which, shit, is true.</p>\n<p>\"Well, they…ruined my shirt,\" Stiles says. It's lame, and Derek smirks at him because it's lame, leaving Stiles with no choice but to roll his eyes. \"Ugh. How about this: you come back to the house with me, do the rounds, make nice with the assorted parents--they like talking to you, by the way, the alpha you know and all that--and I will not abandon you to awkward small talk with anyone. Kind enough for you?\" </p>\n<p>Derek just gives him a considering look, head tilted and eyes narrowed. He stares for so long that Stiles can feel his fading blush flaring back to life, but he doesn't break Derek's gaze, and Derek doesn't seem to want him to. For a moment, there's something almost charged about the air between them, things Stiles has been denying to himself all summer springing to life in his chest… and then Derek looks away, and the moment is broken. </p>\n<p>\"I'm holding you to that,\" Derek says, standing up. \"You're in charge of all the small talk.\" </p>\n<p>\"So, business as usual, then?\" Stiles says, and follows Derek back to the house.</p>\n<p>College starts. Stiles moves into his dorm room a little bitterly, because the rest of the pack--or the portion of them that are attending Beacon University, anyway--are all living together in another building. Derek's house is forty minutes away from the school, and he'd insisted that everyone opt-in to on-campus housing, and is even paying for some of it; his reasoning had been more about having a secondary base of operations than to save anyone the commute, but either way, nobody was arguing. Danny'd hacked into the housing system to make sure everyone roomed together, and originally the plan was that it'd be Boyd with Stiles, Scott with Isaac, Danny with Jackson and Erica in a single. </p>\n<p>Then Stiles' dad found out about it. It was a three day fight, spanning text messages and emails and one very tense dinner, before finally the sheriff slammed his closed fist down on the kitchen table and yelled, \"Goddamn it, Stiles, is it so much to ask that you meet some people who are <i>people</i>?\" </p>\n<p>Stiles' father has been good about the werewolf thing, mostly, has turned a blind eye when he needed to and swallowed down most of his protests. He's been looking at Stiles with this sick combination of pride and fear and regret for the better part of a year, since Melissa sat Scott and Stiles down and told them that she <i>couldn't</i> keep this secret from a man she was growing to love, since it became a moot point when, two days later, Stiles had to perform a bloody exorcism before his father's eyes. The man hasn't asked for much, has been better about it all than Stiles had any right to expect, and watching him snap like that… Stiles had sighed and choked back his anger and told Danny to give him a random. The two of them had still been together then, a month away from a breakup that wouldn't even come as much of a surprise, and Stiles had figured it'd work out okay, one way or the other. </p>\n<p>So now it's Scott with Boyd, Isaac with Danny, Jackson and Erica in singles, and Stiles in a different building with Arif. Arif is, by his own definition, a frat boy waiting to happen; he's from Ohio, was apparently both prom king and the quarterback of his high school football team, and has been sending Stiles enthusiastic Facebook messages about which local clubs ID for two months. The first thing he says to Stiles is, \"Bro.\" </p>\n<p>The second thing he says to Stiles is, \"You know we're going to need a bigger beer fridge, right?\" </p>\n<p>The third thing he says to Stiles is, \"Holy shit, we're going to be late for the party.\" </p>\n<p>This is how Stiles ends up spends the first four days of his sure-to-be-illustrious college career dancing, trying not to vomit, vomiting, nursing a hangover, and day-drinking, not necessarily in that order. He kind of expects Arif to get sick of him after the first day, because Arif is deeply hot in a straight-boy kind of way and also clearly the sort of cool that transcends having to claw your way up a new social ladder; instead, Arif thinks he's hilarious and loves that he knows where all the late-night food is. So then Stiles waits for the weekend to end, running on the assumption that, once classes start, Arif's partying will quiet down. This assumption fails him, because it turns out that Arif is of the belief that, \"College is for partying, bro, not studying. What do you think cram sessions are for?\" </p>\n<p>For all Stiles doesn't usually like people, for all Stiles is in many ways the poster child for misanthropy, he can't help but like Arif. Arif has excellent taste in video games and better taste in alcohol, and somehow--even though Stiles has been living here for his entire life and Arif has been living here <i>since Friday</i>--he hooks Stiles up with the best fake ID guy Stiles has ever met within 36 hours of his arrival. Just to be sure, Stiles has Scott come over on the second day to scent-check that Arif is not a sleeper agent of the supernatural variety; Scott not only verifies Arif's humanity but responds enthusiastically to Arif's immediate bro-hug, which is delivered with the words, \"Any friend of Stiles' is a friend of mine.\" Arif is loud, fearless, quick to declare his affection, and capable of convincing Stiles to do a keg stand; Arif, to sum up, is great. </p>\n<p>But a terrible, tragic thing happened to Stiles when he was in high school… well, okay. An <i>assortment</i> of terrible and tragic things happened to Stiles, or around Stiles, or in front of Stiles, or occasionally because of Stiles, while Stiles was in high school. But perhaps the most terrible and the most tragic of them all is that, somehow, in between the part where he was completely uncool and the part where he was spending all his free time with creatures of the night, Stiles failed at learning how to enjoy a party. Oh, he <i>can</i> party, that's not the problem; drinking isn't exactly a complicated process, and he can close his eyes and dance his trashed little heart out with the best of them. It's just that, inevitably, when he's out for the night hopping from packed bars to packed houses, he finds himself in the corner drunkenly surveying the room for enemies. Or accidentally-on-purpose questioning random strangers about their birthmarks. Or demanding that Arif not take that cut-through because <i>danger lurks everywhere</i>, and drinking does not exactly do a lot to lessen Stiles' awareness of that fact. </p>\n<p>\"You are paranoid as fuck,\" is what Arif concludes in the middle of the third night of their friendship, as they weave drunkenly back to the dorms. Then he slings an arm around Stiles' shoulders and says, \"But I like you anyway. Being a roommate is <i>awesome</i>.\" </p>\n<p>\"Being a roommate is the <i>shit</i>,\" Stiles agrees a little dizzily, and Arif's laugh booms up the street. Stiles' father was right; meeting some people who are people was a good call. </p>\n<p>So, yeah. Arif is awesome, and it's kind of embarrassingly amazing to have a new friend, but after the first few days of his new nighttime routine Stiles begins to wonder if he, himself, is really cut out for the party lifestyle. It's a little ridiculous, since Stiles' nighttime routine has largely consisted of supernatural violence for years, but at least there's adrenaline in that. And less alcohol. And, surprisingly, more sleeping; Arif seems to run on a combination of naps, Red Bull, and a miraculous class schedule that means he doesn't actually have to be on campus until noon. Stiles, on the other hand, passes out in the middle of his first 9 AM Sociology lecture, and while he's pretty sure he doesn't care at all about Sociology, it would've been nice to find out. Also, he's almost certain the girl who was sitting next to him heard him say something mortifying in his sleep, because when he does wake up, she's giving him a seriously judgmental look. </p>\n<p>Wednesday rolls around, and Stiles…is beat. What he <i>wants</i> to do is haul ass out to Derek's and crash there for a night or several, settle into the comfortable silence he's kind of grown to depend on, leave the notes he's been writing without time to deliver them, and just reset for a little while. He maybe, possibly, kind of, sort of, <i>a little bit</i> misses Derek, and arguing with Derek, and Derek's stupid comfortable couch, and Derek's stupid comfortable <i>face</i>, and, yeah, okay, Stiles definitely needs to get some sleeping done in the very near future. He'd just go out there, but he's not exactly sure what to tell Arif about the whole thing. \"Hey, sometimes I'm going to not sleep here but it's definitely not because I'm part of a werewolf pack or anything,\" seems a little much; \"Hey, don't worry if you don't hear from me for a few days, I probably haven't been gored by manticores,\" isn't going to do much to disabuse Arif of the paranoid notion. </p>\n<p>All in all, it's a giant relief when Stiles' phone rings on Wednesday night. He and Arif are drinking Heineken and getting puked on by Boomers in Left 4 Dead, but it's Derek's number, and Stiles can't help but grin as he drops his controller and takes the call. \"Hey.\" </p>\n<p>\"Come downstairs,\" Derek says, sharp. \"We've got trespassers on the south border.\" </p>\n<p>\"Shit, shit, yeah, hold on,\" Stiles says, already moving. He's got a duffel bag packed under his bed full of all the shit he might need--mountain ash and the assorted other powders Stiles privately thinks of as magical herbs and spices, a miniature crossbow, a change of clothes, some holy water, a handgun complete with a variety of enchanted bullets, the usual--and tosses it over his shoulder. \"Is that all the detail I get or what?\" </p>\n<p>\"Everyone else is en-route,\" Derek says, and Stiles can hear his eyeroll. \"But we need you; hopefully whoever it is will be willing to negotiate. I'll fill you in on the drive. Come. Downstairs.\" </p>\n<p>\"What do you mean come down--\" Stiles stops, glancing out the window, and laughs. \"Oh my god, of course you're already here. I swear to god, Derek, you're so predictable it's ridiculous.\" </p>\n<p>\"Would you just <i>hurry up</i>?\" </p>\n<p>\"I'm coming, I'm coming, hold your freaking horses,\" Stiles says, and hangs up. \"Arif, dude, I gotta go.\" </p>\n<p>Arif looks out the window, and then back at Stiles, and then out the window again. When he looks back at Stiles, his eyes zero in on the duffel bag, and he grins. \"Should I expect you back?\" </p>\n<p>There's a weird, teasing emphasis on the question, but Stiles doesn't have time to dwell on it; Derek might well be in the kind of mood to try to come in and drag Stiles out of the building, and Stiles really does not want Derek to meet his RA. So he just says, \"Uh, probably not, man, sorry. Maybe not for a couple of days, depending. These are the downsides of rooming with a local!\" </p>\n<p>\"Think I'll live,\" Arif says, still grinning. \"Have fun, bro.\" </p>\n<p>Stiles is not planning on ever mentioning it to anybody, but he runs down all four flights of stairs, only slowing down when he gets to the lobby of his building to catch his breath. Then he walks out to Derek's car, casual as anything, and slides into the passenger seat. It's weird, because for a second Stiles wants to like, launch himself across the gearshift and <i>hug</i> Derek, or grab his hand, or just do <i>something</i>; it's such a relief to see him that it's almost dizzying, and Stiles admits, if only to himself, how deep in the shit he really is. </p>\n<p>\"Hey,\" Stiles says, because he is a mature, controlled, capable adult. Then, because he is also predisposed towards ruining any attempts he makes at being a mature, controlled, capable adult, he adds, \"I'm going to crash on your couch tonight, just so you know. And maybe tomorrow night. And possibly forever; sleep is a thing I require to live, as it turns out.\" </p>\n<p>\"Roommate problems?\" Derek says, but Stiles sees the way his shoulders relax, actually watches the tension drain from around his eyes. It makes Stiles relax too, lets him release the growing fear that maybe Derek was enjoying this break from Stiles--clearly, he has been just as wound up about it, if not more. </p>\n<p>\"Not really,\" Stiles says, leaning back in his seat. \"Arif's great, he's just a harder partier than I suspect I will ever be. Part of me wonders if he's a supe--dude, kidding. Totally kidding. I had Scott check him and everything, he's as human as they come, if you start stalking him I <i>will</i> hurt you.\" </p>\n<p>\"Aren't you the stalker at this point?\" Derek's scowling, but his eyebrows are smiling. Eyebrows, Stiles knows, can smile; it doesn't matter if it sounds ridiculous. Stiles does not have to justify his internal monologue. \"I mean, you <i>did</i> spend a considerable portion of the summer leaving notes in my car. No matter where said car happened to be.\" </p>\n<p>\"Yeah, but you stalked me first,\" Stiles says. \"I had this out with myself, okay, don't think that I didn’t. This is <i>Stalker 2: The Restalkening</i>. Or possibly <i>Stalker 3: He Stalks Again</i>, because technically I think you've stalked me since I started stalking you.\" </p>\n<p>\"Everything about this conversation is the worst part of this conversation,\" Derek says with a sigh.</p>\n<p>\"That's great,\" Stiles says, \"how 'bout we skip ahead to what kind of heinous crimes against nature we're gonna have to commit tonight,\" and Derek rolls his eyes, starts filling him in. </p>\n<p>(Later, Stiles takes a break from patching his assorted wounds to slip a handful of notes under Derek's bedroom door; the next morning, he wakes up on Derek's couch to find an envelope under his pillow and a Post-it note on his forehead. The envelope is stuffed with slips of paper coated in Derek's ornate scrawl, but the Post-it is very simple. It says, \"Pick a bedroom, genius.\" Stiles grins at it for ten minutes and slides it into his wallet before he goes to brush his teeth--it's the kind of thing he wouldn't want to lose track of.)</p>\n<p class=\"desc left\">[An excerpt from Note #478, left folded up small inside Derek’s wallet:] </p>\n<p class=\"stiles\">...I don't know, man. I guess I thought college would involve meeting a lot of people who know exactly what they want to do with their lives, but mostly I meet people who've got no fucking idea. It's not even just the other freshmen--juniors, seniors, Arif's new friends from rush, nobody's got any clue. And I <u>do</u>. Like, okay, obviously I don't really, because I guess you could be planning on kicking me out of the pack, but I don't really think you're going to do that. And hell, even if you did, I'd just go hunt down another pack to speak for, probably. In the hypothetical future where you fire me from doing it for you, obviously, don't get weird and panicky. I wouldn't leave the pack unless you made me.<br>\n<br>\nBut my point is…huh. I don't really know what my point is. I just feel a lot older than I am, I guess, and that was true in high school too, but now it's different. Weirder. I know it's just because I've seen more shit than most of the people I'm meeting, but it makes it hard to relate, you know? Which, hey, story of my life, at least it's not new ground. I'm happier about it than I've ever been, which kind of makes me nervous, and don't bother telling me not to obsess. I'm not obsessing. It's not bad nervous.<br>\n<br>\nAnyway, this class I'm in is starting to get interesting….</p>\n<p class=\"desc right\">[An excerpt from Response #417, found in Stiles’ sociology textbook:]</p>\n<p class=\"derek\">Boyd's putting together that paper on the anchor concept after all. He asked me about mine yesterday, and I didn't know what to tell him. When I was teaching them to control themselves, I told them my anchor was anger, and it was, at the time. But I think being alpha is actually SUPPOSED to force you to anchor to the safety and solidity of your pack. It took me so long to realize that, at the beginning, that I let the anger take me over. I was trying so hard to find my way back to my humanity, and the only path I knew to get there was rage, which ended up taking my further <u>away</u> from humanity, I think. I don't know. I regret it. I'll always be ashamed of the way I behaved when I first came back here.<br>\n<br>\nBut that's not my point. My point is, my anchor <u>did</u> become the pack. My humanity is tied to the preservation of theirs--yours--and while I'm sure that's the safest option for all of you, and a function of being the alpha, I can't help but worry about it. The last time I was anchored to people this way… well, you know that story. I only landed on anger in the first place because it was literally the only thing about me that still felt human, after everything else was lost. It became a crutch, of course, like everything else, but I don't want to end up there again. Or, I guess, I don't want to end up there for the same <u>reason</u>--if I could, I'd happily re-anchor myself to anger right now. It would be safer for me, if not for the rest of you, and I'd love to allow myself that selfishness.<br>\n<br>\nBut, for obvious reasons, I can't tell Boyd that. I don't want him to think I don't value the pack, not when the truth is that I value you so much that I can barely stand it some days. I told him I'd get back to him. I don't even know why I'm telling you, except that it is so immensely bizarre to me that I'm able to that it almost has novelty value. Who knows.<br>\n<br>\nIn other news, if Jackson tries to get me to buy him beer he can't even get drunk off of one more time I swear I'm going to kill him...</p>\n<p>Things settle into a routine. The pack's assorted dorm rooms are situated in a quad, with a common room that the six of them all share; Stiles finds himself avoiding it, partially for reasons of the still-awkward situation with Danny and partially because being there makes Stiles feel sort of terrible. Not, it has to be said, for himself--Stiles has plenty of reasons to play the self-pity card, but this isn't one of them. He knows he's welcome in the quad, even knows it's kind of point of contention that he isn't there more. It's Derek Stiles feels shitty for, especially since he was the one to argue for dorm rooms in the first place. Stiles knows that, whether Derek will admit it or not, having his pack sharing living space he can't access without being let inside has to be making him nuts. He also knows that Derek meant it when he said he wanted them all to have as typical a college experience as possible, and won't say anything about it even if (especially if) it's hurting him. If Stiles has picked up nothing else from months of exchanging notes, it's that Derek has a self-punishing streak a mile wide. </p>\n<p>So Stiles spends most of his time in his own dorm room or at Derek's house, luring whoever he can to join him in abandoning the quad. It's kind of a one-two punch strategy, because it gets everyone spending time with Derek <i>and</i> Arif, who is rapidly becoming Stiles' favorite person alive. His partying streak has quieted down some since the semester really got into swing, and these days he only drags Stiles out on the weekends, plus or minus the occasional Thirsty Thursday. Stiles is pretty sure that he's never going to recover from the experience of kegs and eggs, but he's also positive that watching Arif make Jackson barf was <i>totally worth it</i>, so. After a few weeks, Stiles gets used to coming home to find Scott chilling on his bed, or Boyd stretched out on Arif's moth-eaten futon; a few weeks after that he strong-arms Derek into establishing mandatory pack house-nights, if only to lessen the crazy around his eyes. </p>\n<p>By the middle of October, Stiles' life is proceeding, if not at a smooth clip, at least at a low hum of minimal chaos. Arif has confessed that he thinks Stiles and his friends are in some kind of benevolent cult, but he doesn't seem concerned about it, and it's the easiest thing to let him believe; Derek's still twitchy and bitchy and clearly uncomfortable with the living arrangements, but he's calmed down, which Stiles is counting as a win. His classes are going well, and so are Scott's--Stiles can't help but check in, even though they’re not taking anything together--and everybody's relationship problems seem to be sorted out. Stiles is actually pretty sure Boyd and Scott and Allison and Lydia have some kind of complicated four-way sex thing going on, since Lydia and Allison are both in Boston and Scott and Boyd seem to vanish together a lot these days, but nobody's talking, and Stiles doesn't really blame them. It's not like he's talking, after all. </p>\n<p>Which isn't to say there isn't stuff to be talking about, because…okay. Stiles is Not Panicking about it, because panicking about it would be stupid and ridiculous and counterproductive, but the Derek thing has officially crossed the line into being a Derek <i>problem</i>. It was one thing, Stiles thinks bitterly, when it was just the notes and the stalking and the occasional furtive masturbation session; these days, Stiles thinks about Derek so often that he's starting to wonder if he's got some kind of psychological condition. Lycanthromania or something. They're still writing each other, long letters that have taken the place of the quick little notes they were dashing off when they had all the time in the world to leave them lying around, but they've also started texting. And emailing. And entering into this territory Stiles doesn't quite understand, because they're in more-or-less constant contact now, and instead of being driven crazy by it, Stiles likes it. Loves it, even. Can't imagine what he'll do when it stops. </p>\n<p>Like he said: it's a problem. He's trying not to think about it. </p>\n<p>He is, in fact, actively focusing on not focusing on it (with limited amounts of success) when Arif bursts into the room one Friday night at the end of October, eyes wild, and says, \"Bro!\" </p>\n<p>\"Bro,\" Stiles returns, grinning. \"What's up? That face always means trouble.\" </p>\n<p>\"We,\" Arif says, drawing himself up and puffing out his chest, \"are going to the gay club.\" </p>\n<p>\"What, Jungle?\" Stiles blinks, because he hasn't been to Jungle since that weird night with the mud and the phone and Derek's jacket, months ago now. Hooking up has not been high on Stiles' list of activities, not in the least because he's maybe-kind of-slightly fixated in a prohibitive way on a certain alpha werewolf. Then his brain catches up to what's actually happening here, and he blinks again, says, \"Dude, wait. What? Why? You know that I don't, like, need you to do that for me, right?\" </p>\n<p>Arif rolls his eyes. \"No, bro, not you. I've got your number. It's for Mike, he came out to us today, and we're going to be supportive! Only we're going to have to be supportive early, because there's a rave that starts at like 11:30 on the other side of town, but still! You have to come!\"</p>\n<p>\"What the hell do you mean, you've got my number?\" Stiles hasn't gotten around to mentioning the whole into-dudes-and-ladies thing to Arif, on the theory that it doesn't matter much while he's not trying to score anyway and, also, he's a little afraid to. \"And, hold on, tall Mike or short Mike?\" </p>\n<p>\"I mean I've got your number, man, chill out,\" Arif says. He grins. \"It's cool. I get you. We don't have to, like, talk about it or anything. And tall Mike and short Mike both have girlfriends, dude. This is Mike from the Quick-E-Mart, he's pledging with me. You've met him, I think? White dude, blonde hair? He was here the other day while we were pre-gaming.\" </p>\n<p>\"Why the fuck do we know so many people named Mike?\" Stiles says, mostly to himself. \"And why do I have to come along on this journey to the queer side of the moon?\" </p>\n<p>Arif flops down on Stiles' bed, his head coming to rest right next to Stiles' thigh. This, Stiles knows, is to intensify his delivery of the puppy dog eyes, because Arif's puppy dog eyes are a <i>weapon</i> and he knows it. \"Come onnnnn, Stilinski. You're, like, the only gay guy I know. I don't know shit about wingmanning for dudes who like other dudes! Help a guy who wants to help a guy help a guy out.\" </p>\n<p>\"I want you to know that that is the worst thing you've ever said to me. Also, let me cry into my pillow, for your straight-boy life is so hard,\" Stiles says on a mock-sigh. Then he thinks back over that sentence and scowls. \"And hey, man, don't assume shit. I'm not gay! I am bisexual. Say it with me: bi-sex-ual. It's a whole thing.\" </p>\n<p>\"See,\" Arif says mournfully, cranking the puppy-dog eyes up to eleven, \"I didn't even know that, how am I ever gonna get Mike any <i>dick</i>?\" </p>\n<p>\"I take it back,\" Stiles sighs, \"<i>that</i> is the worst thing you've ever said to me,\" but he agrees to go along despite himself. </p>\n<p>This is how Stiles finds himself in Jungle with a posse of straight boys, downing a rum and Coke while Arif enthusiastically orders Mike several horrifyingly-named shots. Stiles leaves them to it and goes to find Mox. Zhe's holding court in the back as usual, rocking a wig Stiles has never seen before and zher headliner makeup, and Stiles hopes his group sticks around long enough that he'll get to see zher take the stage as Roxie Malone. Mox had been kind of a godsend to Stiles in high school, when he was so fucked up about who he was and what he wanted that he didn't know where to turn; they've been tight since the night they met, the only plus to come out of kanima-hunting. In exchange for zher warmth, advice, and, occasionally, couch-space, Stiles took his werewolf-honed negotiating skills to zher skeezeball (and, incidentally, vampiric) boss in the middle of his junior year of high school. Stiles had been less than kind and more than a little violent, and had sort of almost wound up dinner, but it was worth it for Mox's renegotiated contract. And, also, the lifetime cover-charge waive zhe got the Jungle staff to give him in thanks. </p>\n<p>\"On the prowl, Little Red?\" Mox says, winking at him when he slides into zher booth. Mox is the only person on the planet allowed to call Stiles by that name, because zhe is the only person on the planet who knows about the fantasy from which it was derived. Stiles flushes anyway; he tries not to think about the night he got drunk enough to tell zher about that. \"I can keep an eye out for any promising prospects.\" </p>\n<p>\"Nah, I'm here helping my straight roommate introduce his new gay fraternity brother to the queer side of the yard,\" Stiles says, and Mox throws zher head back and laughs. </p>\n<p>\"Well, isn't <i>that</i> an enticing sentence,\" zhe says, grinning. \"Where's the newbie? I'll have my girls keep an eye on him.\" </p>\n<p>\"Guy at the bar in the tragic plaid,\" Stiles says, nodding over to where Quick-E-Mart Mike is choking on a shot that might well be the Kiss &amp; Tell. </p>\n<p>Mox rolls zher eyes. \"Honey, you <i>cannot</i> talk about tragic plaid.\" </p>\n<p>\"I work my tragic plaid, okay?\" Stiles knows it's lame, but Mox knows what he's like, so whatever. \"My tragic plaid and I are one.\" </p>\n<p>\"If that's what you have to tell yourself to sleep at night,\" Mox says, giving him a doubtful look. When Stiles scowls at zher, zhe laughs again. \"Fine, fine. Claws up. You just come over to say hi, then? We haven't seen you in months.\" </p>\n<p>\"Wanted to know how things are working out with the new management,\" Stiles says, too innocent. Mox's new boss is a vampire, just like zher last one; Stiles has never been able to figure out how much zhe knows about the supernatural shit that goes on in this town, and can't quite work up the nerve to ask. The new vamp management is a pack installation, though--Stiles had kind of insisted on it. \"And fuck that, I had dinner with you three weeks ago. Just because I haven't been coming in <i>here</i> doesn't mean you can guilt me.\"</p>\n<p>Mox gives him a hard look, seeing through the chatter. \"You know I know that whatever you're into is too harsh for a kid your age, don't you?\" </p>\n<p>\"I do, indeed, know that,\" Stiles says, because this is not the first time they've had this conversation. \"And <i>you</i> know that you don't actually want to know, right?\" </p>\n<p>There's a long pause, and then Mox tosses back the rest of zher drink and sighs. \"You're gonna be the death of me, kid, I swear to god. And Vlad's great, except for how his name is Vlad and I'm pretty sure he's hungering for the blood of virgins.\" </p>\n<p>\"He'd better not be,\" Stiles snaps before he can help himself. He'd been <i>very clear</i> in the residency agreement that Vlad was to feed on non-humans only, and the hell if he's going to let that deal go down the drain after only four freaking months. Then he finds himself caught in the headlights of Mox's sharp scrutiny, and swallows. \"Uh. I mean. Because that…would be wrong?\" </p>\n<p>\"You're right,\" Mox decides after a second, \"I definitely don't want to know. If he does anything dastardly, I'll give you a heads up, alright? Send you a little text message of terror, I know how you like that.\" </p>\n<p>\"Aww, Mox, you do love me.\" </p>\n<p>\"I remember when you were just a snot-nosed little baby,\" Mox says, fluttering zher eyelashes. \"You were <i>adorable</i>. If I'd known you'd grow up into a snot-nosed little headache, I would've left you to the mercy of the crowd.\" </p>\n<p>\"But you didn't,\" Stiles says cheerfully, sliding back out of the booth. \"And I'm still adorable, you know you think so deep down.\" </p>\n<p>\"Real deep,\" Mox says, but zhe winks. \"Have fun tonight, alright? And if you cancel on me for lunch next week, I will tell that pretty, pretty man I keep seeing driving around with you about where the name <i>Little Red</i> came from.\" </p>\n<p>\"Oh god please don't,\" Stiles says, all in one breath, because Mox has to mean Derek. He's not actually sure what's more terrifying, the thought of Mox telling Derek about that particular (and, admittedly, kind of Derek-based) fantasy, or just the fact that Mox can <i>identify Derek as the pretty man Stiles hangs out with</i>. \"If you love me at all, you will not tell Derek Hale--\" </p>\n<p>\"Oh my god, <i>that's</i> Derek Hale?\" Mox's eyes widen, and Stiles is despairing even before zhe shakes zher head and says, \"I should've known. Kid, you and that man are the talk of the town.\" </p>\n<p>\"Not really?\" It comes out as kind of a squeak, but Stiles can't help it.</p>\n<p>\"Really,\" Mox says, and smirks in the face of Stiles' panic. \"Go on now, go back to your straight boys. I've gotta go get stage-ready, and this'll all be a much more interesting story if I don't give you anything else. Kiss kiss.\" </p>\n<p>Zhe stands and walks off, heels clacking against the tile floor, and just waves over zher shoulder when Stiles yells, \"Really!? You're just going to leave me with 'Kiss, kiss,' Mox? Not cool! Party foul!\" after zher. Everyone Stiles knows is against him. </p>\n<p>He goes back over to the bar, where Quick-E-Mart Mike seems to have found himself an attractive man to flirt with; Arif looks ridiculously proud, which is hysterical and sad in equal measure. Stiles orders another rum and Coke for himself, shots of Jaeger for both of them--when in whatever the frat-boy version of Rome is, after all--and drags Arif out to the dance floor. Dancing, and the assorted benefits thereof, is one of the many points Stiles and Arif have bonded over since becoming roommates. A man does not need an excuse, a partner, or rhythm to dance. All he needs is the desire to have a good time. </p>\n<p>The next few hours pass in a blur of alcohol and dancing and more alcohol and more dancing. Mox comes onstage as Roxie somewhere between Stiles' third and fourth drink; zhe does three numbers, brings the house down, and blow Stiles a kiss on zher way offstage. Stiles blows one back and feels pretty damn good about the whole world--so what if he's kind of harboring some intense feelings for Derek? So what if apparently that situation is the \"talk of the town\"? Stiles has awesome friends, and an awesome pack, and an awesome roommate, and he could totally get laid if he wanted to. He doesn't like to brag, but he's pretty sure he's hotter than Quick-E-Mart Mike, who definitely appears to be sealing the deal. All in all, Stiles is riding just enough of a buzz for every problem in his life to be reduced to no big deal, but not quite enough of a buzz for every little thing to start seeming like a danger sign. Things are good. Stiles is glad to be alive. </p>\n<p>Which is when he sees Danny. Because of course it is. </p>\n<p>He's not facing Stiles, is wrapped around some guy Stiles has never seen before, but Stiles still knows it's him--even if he couldn't recognize that ass on sight, he's been on the receiving end of Danny's dancing enough times to know his whole catalog of moves by heart. Danny's working a forward grind right now, holding his partner by the hips and mouthing at his neck as he moves, and Stiles feels himself go stock-still, staring. He <i>shouldn't</i> stare, because it's weird and creepy and this is exactly why Danny broke up with Stiles in the first place: Stiles' stupid, impossible, over-the-top feelings were more than Danny was looking for. Not that Stiles blames him; the way Stiles gets when he's in love is probably more than <i>anyone</i> is looking for. </p>\n<p>Stiles isn't in love with Danny anymore, spent months after their breakup forcibly quelling the emotion, but it still makes something ache in his chest to watch him with someone else. He's moving like he's comfortable, like he's not trying to prove anything, and Stiles knows he should look away, tries, can't. It's the first time he's seen Danny without the cloud of awkwardness hanging between them in months, and while Stiles knows it's just because Danny doesn't know he's there, there's something about that that's even more intoxicating than watching Danny move. There are days, even now, when Stiles misses Danny's friendship so much it nearly knocks him down; it hurts to see him with someone else, but it's good, too, reminds Stiles of the person he's started to feel like he's forgotten entirely in his bitterness. </p>\n<p>And then Danny turns around and executes the move Stiles once thought of as the Killshot, reaching behind him to grab his partner's hips and jerk them forward together. Stiles can't help it; he grins, because Danny's partner has clearly never encountered the Killshot before, and the expression on the lucky bastard's face is shocked and thrilled and horny all at once. Stiles has been there, he really has. He almost wants to order the guy a drink. </p>\n<p>He's still grinning when Danny sees him, catches his eye. Stiles' grin falters, goes a little brittle but holds; to his surprise, Danny returns it, his own smile small and almost hopeful. They stand there, smiling at each other across a crowded room while Danny grinds on another guy, and Stiles doesn't know what's happening. Is this how you get back to bros, then? Is that something that's even still on the table? Is there even the slightest possibility that, despite everything, Danny misses being Stiles' friend too?</p>\n<p>\"Yo, Stilinski,\" Arif says, sounding pissed, from behind him, \"isn't that your boyfriend? What’s he doing here with someone else?\" </p>\n<p>Stiles jerks his attention away from Danny and starts to turn around, wondering how the hell Arif knows he and Danny were ever together in the first place, let alone how he came to the conclusion that they're together <i>now</i>. He doesn't even make it all the way through the turn, though, before he catches Arif's eyeline and follows it to…</p>\n<p>…Derek. Who is staring right at him from between the arms of an absolute fucking stranger, and looking, not to put too fine a point on it, murderous. </p>\n<p>There's a long moment where their eyes meet, where Stiles just gapes at Derek like an idiot, mouth half-open in shock. Then Derek's face contorts in sharp rage, and before Stiles can do anything, can even <i>think</i> about doing anything, Derek's twisting away from his dance partner, shoving him away with too much force and stalking furiously towards the door. Stiles has no doubt that he heard what Arif said; his goddamn super hearing probably pricked at the word <i>Stilinski</i>, and Stiles can't imagine Derek would be that angry just to see Stiles out with his friends. Hell, for all Stiles knows Derek's only here <i>because</i> Stiles is here--it's not like stalking is new territory for them. </p>\n<p>He doesn't know what it is, the alcohol in his system or the look on Derek's face, the weird moment with Danny, the months and months of denial, but something in Stiles snaps at the sight of Derek tearing towards the door. He's spent all this time handling it with kid gloves, this…this…this <i>whatever it is</i> between him and Derek, hasn't been pushing it, hasn't been expecting anything at all. Even in the privacy of his own head, Stiles has been shying away from what it all might mean, not wanting to get his hopes up, not wanting to be <i>stupid</i>, and somehow he's been stupid anyway. Somehow it still hurts like a stab wound to the chest, how <i>fucking horrified</i> Derek looked at the suggestion that he and Stiles might be together, and it's too much, all at once, for Stiles to handle. Months and months of trading secrets, of building trust, of Stiles fucking handing his soul over in bits and pieces for <i>no goddamn reason at all</i>, not asking for a damn thing in return, and Derek can't even be decent enough to <i>pretend</i> not to be disgusted by him? </p>\n<p>Fuck being hurt, Stiles decides. Better to get angry instead. </p>\n<p>\"I have to deal with this,\" Stiles snaps to Arif, already heading for the door. \"You should go to the rave.\"</p>\n<p>\"Are you guys fighting this week or something?\" Arif calls, but he doesn't follow Stiles outside. </p>\n<p>Derek's not in front of the club when Stiles gets there, but Stiles knows Derek, knows what he's like; he storms around to the alley on the side of the building, the one with a cut-through to Peardon Street. Sure enough, Derek is almost to the end of it, and Stiles curls his lip into a snarl, takes a deep breath, and yells, \"Hey, asshole! You wanna wait the fuck up?\" </p>\n<p>For a second, Stiles thinks Derek's just going to keep walking. Then Derek's shoulders sag and bristle, all in one movement, and he turns around with his eyebrows up. \"Huh. So <i>I'm</i> the asshole? How does that work, Stiles? What d'you need me around for anyway--am I part of a cover story, is that it? Explain away your strange behavior by claiming I'm your fucking boyfriend? What, do you need me to sit for some photos?\" </p>\n<p>\"You have a lot of fucking nerve,\" Stiles snaps, \"to act like the idea of dating me is the worst freaking thing you've ever heard of in your life, <i>Derek</i>. Like, seriously, whose reputation do you think would take the hit there? In column A, we've got the promising young college freshman, and in column B we've got the fucking murder suspect--\" </p>\n<p>\"Really?\" Derek's almost yelling, which is great, because it means Stiles can yell back. \"<i>Really</i>? Jesus, it's like you can't even <i>help</i> yourself. Hit the soft tissue, right? Inflict maximum damage with minimum effort, isn't that always your play?\" </p>\n<p>\"<i>Fuck</i> you,\" Stiles says. It comes out half-choked in shock, because of all the places he wasn't expecting Derek to hit, Stiles' fears about how he might be a completely soulless, empathy-challenged bastard deep down is probably to the top of the list. \"I, seriously, what the fuck is your problem? Like, what are you even so angry about, is the idea of dating me really that terrible? Because you know what, Derek, I'll tell you what, if you <i>hate</i> me so much, if I am so fucking <i>objectionable</i> to you, maybe you should have mentioned it while you were leading me the fuck on all summer!\" </p>\n<p>\"While <i>I</i> was leading <i>you</i> on,\" Derek repeats. His eyes flash red, and Stiles' eyes narrow as he balls his hands into fists. \"While <i>I</i> was--I'm sorry, who started whatever the fuck has been going on? Who started sticking parking tickets on whose car?\"</p>\n<p>\"You never told me to stop!\" Stiles yells. \"You just let me keep doing it and doing it, you fucking <i>wrote back</i>, okay, so don't act like this is just me!\" </p>\n<p>Derek's lips curl back in a snarl, which is a weird expression on him when it doesn't come with fangs. \"Telling your college buddies that we're dating? Pretty sure that's just you, Stiles.\" </p>\n<p>There's something pinging at the back of Stiles' mind, a sort of high-pitched alert that he's maybe missing some pertinent facts here, but he's too angry to pay it any attention. He has to keep being angry; if he lets himself be anything else, there is the decent and deeply humiliating chance that he might cry. \"I didn't tell him anything! He freaking assumed, okay, probably because you've got me walking around carrying this stupid fucking torch--is this funny for you? Is that it? This whole time... am I a joke? Have you been laughing at me while I drove myself <i>crazy</i> for <i>months</i>?\" </p>\n<p>\"Wow,\" Derek snaps, “that must've been so fucking hard for you, let me get out my <i>violin</i> to play you the world's <i>saddest song</i>--\" </p>\n<p>\"What the fuck is <i>that</i> supposed to mean?\" </p>\n<p>\"What the fuck does any of it mean?\" Derek cries, throwing his hands in the air. \"I spend years, Stiles, <i>years</i> telling myself that I can't have feelings for you, that I'm disgusting for even thinking about it, that you'd be horrified, that I've clearly been <i>warped beyond all fucking belief by</i>--\" Derek cuts himself off harshly, actually turns his face away from Stiles, before he takes two steps into Stiles' space and hisses, \"And then you start dropping confessions into my car window and showing up at my house and being…being…and now I guess you're telling people you're my boyfriend, so you tell me, Stiles, you tell me what the fuck it <i>means</i>, because clearly I have no! Goddamn! Idea!\" </p>\n<p>Silence hangs between them for a half second, everything moving so fast in Stiles' head that he can't even begin to catch up. Then they're kissing, so sudden and sharp and intense that Stiles doesn't even know which of them moved first. Derek's hands are wrapped around Stiles' biceps and Stiles' fingers are twisted tight in Derek's black t-shirt, and he's gasping against Derek's open mouth, biting down on whatever he can reach. His lips part when Derek's tongue pushes against them, insistent and furious, and then Stiles swallows a huge breath of Derek's air and forgets how to think at all. </p>\n<p>They kiss and kiss and kiss and kiss, clinging to each other in a dark alley like they're the least sane still-life ever painted. It's fast and hard and it <i>hurts</i>, almost; Stiles can feel his lips swelling up, knows that this is reckless and stupid and the absolute worst way to go about this. He doesn't care, because he's wanted this so much, for so long, that he's barely even let himself want it at all, and now it's here, Derek's hot fucking mouth opening to him, Derek's insanely gorgeous body grinding into his, and Stiles pushes closer and closer and--</p>\n<p>\"Ahem,\" a familiar voice says, and Stiles breaks away from Derek only to see <i>Danny</i> at the mouth of the alley, his hand over his mouth, his shoulders shaking with laughter. </p>\n<p>Of course. Of fucking course. </p>\n<p>\"I have to go,\" Derek says. His voice cracks, warbles on it, and there's a high flush to his cheeks. Stiles doesn't even get the chance to reach for him before he's gone; he could give chase, but he's not stupid enough to imagine he'll be able to catch Derek unless Derek wants to be caught. He sags instead, his shoulders slumping, and runs a hand through his hair. </p>\n<p>\"So,\" Danny says, still trying and failing to conceal his laughter, \"guess you're not hung up on me anymore, huh?\" </p>\n<p>\"Oh my god,\" Stiles says, and closes his eyes.</p>\n<p>Danny ends up dragging Stiles to a diner up the street, because Danny--as Stiles has long known--is food-obsessed. Despite all evidence to the contrary, Danny persists in the belief that there is no problem that cannot be fixed with the application of enough pie. As far as Danny's concerned, if pie can't fix it, it's not really a problem; Stiles has given up trying to convince him otherwise. </p>\n<p>\"What about your, uh, conquest?\" Stiles tries, while Danny hauls him bodily down the sidewalk by his shirtsleeve. \"Don't you need to get back to that? Isn't that much more important than humiliating me over pie?\" </p>\n<p>Danny just gives him a flat, disbelieving look and says, \"Please, Stiles. He'll keep,\" and Stiles doesn't have any choice <i>but</i> to grin and follow along. It's been a long time since Stiles last encountered Danny's ridiculous, if entirely justified, ego--it's easy to follow his own good humor at its sudden reappearance into the corner booth at Lou's. </p>\n<p>There's a brief moment of respite while Danny orders them both coffee and cherry pie a la mode, but the minute their waitress disappears, Danny drops his hands on the table, palms flat. \"<i>So</i>.\" </p>\n<p>\"Lovely weather we're having?\" Stiles winces when Danny just raises his eyebrows. \"Look, Danny, what do you want me to say here?\"</p>\n<p>\"Well,\" Danny says, \"you could start with how you came to be kissing Derek Hale in an alley. Or, if you want, you can feel free to jump right in with how you came to be kissing Derek Hale in an alley. Of course, you could always just tell me how you came to be kissing Derek Hale in an alley.\" </p>\n<p>\"You're really not going to let me out of here without the story, are you?\" </p>\n<p>\"I will be the king of all gossip,\" Danny confirms, settling back in his chair and smirking. \"Jackson will cower before me. Also, I'm guessing it's hilarious, and I could use a laugh. Well, another laugh. Start at the top.\" </p>\n<p>So Stiles starts at the top. He tells Danny about the lonely summer, about the first parking ticket, about the way he found it in Derek's car a week later; he tells Danny about the second parking ticket, and the fifth, and the twenty-fifth. He tells Danny about running out of parking tickets, about driving around Beacon Hills looking for the black Camaro with the tell-tale clawmarks marring the back bumper, about learning Derek's schedule by accident in the process. He tells Danny about the night in the woods with the leather jacket and the borrowed henley Stiles never quite brought himself to give back, about <i>I don't understand you</i> underlined in black felt-tip marker. He tells Danny about the hours and hours hanging out alone with Derek, arguing and sniping and sitting in comfortable silence and trading dozens upon dozens of notes, about how those notes became letters and texts and emails. He tells Danny about growing to like Derek, his twisted sense of humor and the way he never pulls his punches, the way he really is kinder than Stiles has ever even played at being underneath all the scowling. He tells Danny about the fight he still hasn't fully processed, about the things he and Derek only just finished screaming at each other, and Danny just <i>listens</i>, calm and quiet, prodding Stiles to go on whenever he trails off. </p>\n<p>\"…and that's it,\" Stiles finishes eventually. His pie has gone cold, but that's okay; he doesn't want to eat it anyway. Thinking over what Derek said in the alley, Stiles thinks there's maybe the decent chance he never wants to eat again. \"That's the whole thing, start to finish.\" </p>\n<p>Danny nods. Then he takes a long swig of his coffee, swallows, draws in a deep breath, and says, \"<i>Well</i>. First of all, just so we're clear? That is the creepiest goddamn story I've ever heard.\" </p>\n<p>\"Hey!\" Stiles snaps. There were a lot of responses he was expecting, but that wasn't one of them. \"No it's not!\" </p>\n<p>\"Oh my god, Stiles, the stalking <i>alone</i>,\" Danny says, grinning slightly as he shakes his head. \"Let alone the like, intense codependent tone of the whole thing, or the fact that it all wraps up at scream-kissing in an alley, I don't even know where to start.\" He pauses, considering, and adds, \"It is very…you guys, though. I'll give you that.\" </p>\n<p>Stiles blinks at him for a minute. \"What does <i>that</i> mean? What is very 'us guys,' like, what? What?\" </p>\n<p>\"Come on, Stiles,\" Danny says. When Stiles blinks at him some more, Danny rolls his eyes. \"You know what I'm talking about. The whole all-the-air-empties-from-rooms-you're-both-in thing? You can't tell me you've never noticed. It's been going on since we were in high school!\" </p>\n<p>\"<i>What</i>?\" </p>\n<p>\"It used to drive me crazy when we were dating,\" Danny says conversationally, like he's not <i>totally upending Stiles' worldview</i> or anything. \"And before we were dating, actually--it so wasn't fair that I couldn’t for someone that hot because he was too fixated on <i>you</i>. Also, it was way unsettling when I thought you two were cousins. Just, uh, for the record and everything.\" </p>\n<p>\"Why did nobody, like,\" Stiles waves his hands in the air over their table, which does not seem to faze Danny at all, \"<i>tell me</i> about this? Mention this to me? Drop me a handy little note that said, 'Hey, Stiles, heads-up-seven-up, you're eyefucking Derek Hale!'\" </p>\n<p>\"Do you not actually process emotions unless they're delivered to you in writing?\" Danny's lips purse thoughtfully, but his eyes are teasing. \"That would explain so much about you.\" </p>\n<p>\"Said Captain Pie,\" Stiles shoots back, and Danny's grin is so shit-eating that Stiles has to throw his napkin at him. \"Do not start, okay, I know I could do better than 'Captain Pie,' we all know I could do better than 'Captain Pie,' I'm having kind of a bad night!\"</p>\n<p>\"Not from where I'm sitting,\" Danny says. Stiles narrows his eyes, wondering if Danny is fucking with him; in return, Danny raises one eyebrow, a gesture that Stiles once thought of as sexual kryptonite. Even now, it sends a shiver down his spine. \"Seriously, what part of this is reading as bad to you? Your creepy love interest returns your creepy feelings, I'm not seeing the problem here.\" </p>\n<p>\"It's not <i>creepy</i>, it's…it…it works for us, okay!\" Stiles glares, but Danny's eyebrow remains up. \"And, just…fuck. I think I probably fucked it up completely, didn't I? I was a total dick to him.\" </p>\n<p>\"And he was a total dick to you,\" Danny says, \"but everything still ended with kissing, so…\" </p>\n<p>\"Yeah, but he ran off!\" Looking wrecked and heartbroken and like Stiles had torn all the feelings out of his chest and stomped on them for sport; Stiles isn't going to be forgetting that raw expression on Derek's face any time soon. \"Like, <i>literally ran</i>. Away from me. Down the alley.\" </p>\n<p>\"Okay, so, first of all, I don't think anybody would react well to getting caught out by their stalker-turned-friend-turned-makeout-buddy's ex.\" Danny takes another swig of his coffee and adopts what Stiles has come to think of as the Wiser Than Thou face; fuck, he really has forgotten about the breadth of Danny's ego. \"And secondly? Derek is not exactly known for his sanity, Stiles. I mean, neither are you, and this whole story kind of proves it, so, uh, I think you should probably chill. Maybe take a day or so to calm it the fuck down, and then talk to him. Things never turn out to be as much of a disaster as you think they're going to be, you know? And, I'm going to be completely honest here, I'm pretty damn sure he wouldn't have put up with the stalking if he didn't like you. And vice versa, actually. Like, the yelling and kissing and running away is kind of the most <i>normal</i> part of this sordid little tale.\"</p>\n<p>\"Ugh,\" Stiles says, slouching down in his seat in despair. \"You're mean.\" </p>\n<p>\"Aww,\" Danny says, \"you deserve it,\" and when he smiles, it's almost like it used to be, the comfortable camaraderie between them that existed before things went wrong.</p>\n<p>And Stiles has to know, suddenly; he sits up straight and, before he can lose his nerve, blurts out, \"So, does this mean we can be bros again?\" </p>\n<p>Danny gapes at him. \"<i>What</i>?\" </p>\n<p>\"I mean,\" Stiles says, babbling a little and not caring, \"like, when we broke up you said you'd like it if we could be friends but then things were awkward and I didn't want to make them more awkward but it kind of seems like--\" </p>\n<p>\"Stiles,\" Danny says, holding up a hand. \"Are you kidding me? I dumped <i>you</i>, remember?\" </p>\n<p>\"No,\" Stiles snaps, vicious at the reminder, \"I had forgotten, thanks <i>so</i> much, be a shame to let <i>that</i> little detail slip my mind.\" </p>\n<p>\"That's not what I mean,\" Danny says, and sighs. \"You're so… okay. Listen. The standard etiquette, when two people break up, is that the dumper--that would be me--allows the dumpee--that would be you--to call the shots on when it's cool to hang out again. You made it really clear that you couldn't handle being around me at first, Stiles, and I felt bad, because I really did want to feel the same way about you that you did about--\" </p>\n<p>\"Can we skip this part!\" It comes out a little strangled, because, yeah, Stiles isn't in love with Danny anymore, but there's always going to be part of him nursing that old hurt. There's always going to be part of him wishing Danny had loved him back, playing at what-ifs, and the last thing he wants to do is open that can of worms right now. </p>\n<p>\"Sorry,\" Danny says quietly, and he actually does sound sorry. Stiles isn't sure if that makes it better or worse. \"That wasn't my point anyway, though. My point is, you were weird at first, and then you stayed weird, and then you started acting like, I don't know, like I got the pack in the divorce or something? Which is ridiculous on a hundred different levels, but whatever. <i>You</i> were weird about <i>me</i>, not the other way around. I never wanted us to not be bros. It would actually fix about a dozen problems if we could be bros again--I just wasn't going to be a dick and push you on it.\" </p>\n<p>Stiles takes a moment to process that. At the end of the moment, he mostly feels incredibly stupid. \"…Oh.\" </p>\n<p>\"Yeah,\" Danny says, giving him that same small, hopeful smile from inside the club. \"So…friends? Please? Among other things, I'm not nearly as good at pranking Jackson without your help.\" </p>\n<p>\"I…yeah,\" Stiles says, smiling huge and helpless. \"That sounds pretty great.\" </p>\n<p>\"Great,\" Danny says, grinning back at him. He slides out of the booth and pats Stiles on the shoulder, gives him a hard, bracing sort of squeeze. \"I'm gonna go back to my evening now, but thank you. This was even funnier than I was expecting. Pie's on you, by the way. I think it's the least you can do.\" </p>\n<p>\"Thanks,\" Stiles says, rolling his eyes, but he's still smiling. He doesn't realize the fatal flaw in the Danny-leaving plan until Danny's already walking away; then he flails in his seat, twisting around so he can say, \"Wait! Danny! What do I do? How do I talk to him about this? You can't leave me like this, dude! I've got unresolved feelings over here! \"</p>\n<p>Danny doesn't slow down, doesn't even turn around, just calls, \"Write it in a letter, Jane Austen!\" over his shoulder.</p>\n<p>\"You can't quote <i>Community</i> at me, you bastard!\" Stiles yells as Danny reaches the door. \"I'm the only reason you even <i>watched</i> that show!\" </p>\n<p>This, too, fails to motivate Danny towards mercy; Stiles turns bitterly back into his seat only to find everyone in the entire diner staring at him. </p>\n<p>\"Well, I <i>am</i>,\" Stiles mutters, sinking down low in his booth. \"Check, please?\"</p>\n<p>Stiles thinks about going back to his dorm room, but decides that being alone right now is probably asking for a panic attack. He considers trying to meet up with Arif at that rave, but decides that that, too, is probably a recipe for disaster. So he goes over to the quad, swiping his student ID to get into the building and taking the stairs two at a time. Maybe, he thinks as he walks down the hall, they can get Derek enrolled in a class or something, make him a fake ID card--it might solve some of the housing stress problems if he didn't need a student to escort him inside. </p>\n<p>Then Stiles realizes that his strategy for avoiding thinking about Derek is, in fact, <i>thinking about Derek</i>, and seriously contemplates the benefits of pitching himself back down the stairs headfirst. A convenient hospital stay might actually be easier than dealing with his life right now.</p>\n<p>He decides better of it, and knocks on the door. </p>\n<p>It's Erica who answers it; she jerks back a little when she sees Stiles and then gives him a hard look. \"Um. Hi?\" </p>\n<p>\"Hi,\" Stiles says. Over her shoulder, he can see Isaac sprawled across the couch, Jackson in one of the chairs. \"Is, uh. Is Scott here?\" </p>\n<p>\"I think he and Boyd are--\" Isaac starts, but Erica waves him silent.</p>\n<p>\"That one,\" she tells Stiles, pointing at one of the doors. They've all switched rooms so many times that there's no way to know whose is whose anymore. \"But I'd knock first, if I were you. You okay?\" </p>\n<p>\"I, yeah, that's…yeah,\" Stiles says. \"Fine!\" </p>\n<p>Erica gives him a skeptical look, but she walks back over to the couch and settles down into the crook of Isaac's arm. Stiles breezes by them, nodding at Isaac and returning Jackson's probably-sarcastic wave, and knocks again, this time on the door Erica indicated. There's a pause, and then Scott yells, \"A little busy right now, guys!\" </p>\n<p>\"Please?\" Stiles hears the desperation in his own voice and winces. Shit. \"Er. I mean, if you're like, busy-busy then I can--\" </p>\n<p>The door swings open before he can even finish the sentence. Scott's wearing a pair of sweatpants and nothing else; behind him, Boyd's dressed more or less identically, and there's an open laptop sitting on the bed next to him. Stiles winces even harder, although he does take some pleasure in officially confirming the four-way sex theory. </p>\n<p>\"Uh,\" Stiles says, \"I can go.\" </p>\n<p>\"Dude,\" Scott says, blinking at him with wide eyes, \"are you kidding? What the hell happened?\" </p>\n<p>He grabs Stiles by the shirtfront and hauls him inside, reaching out behind him to shut the door as Boyd whistles, long and low. \"Jesus, Stiles. Ladies, I'm really sorry, but we're going to have to call you back.\" </p>\n<p>\"Wait, wait, lemme see,\" says what Stiles believes is a tinny version of Lydia's voice. Obligingly, Boyd picks up the laptop and turns it towards Stiles, and, yep, that's definitely Lydia laughing hard enough to fall off the bed. What the hell? \"Oh my god, yeah, definitely call us back.\" </p>\n<p>\"With all the details,\" Allison adds. She waves at Stiles, and Stiles is pretty sure she's only wearing a sheet, but he waves back before Boyd flips the laptop shut. </p>\n<p>\"Okay, so, explain,\" Boyd says, as Scott reaches out like he's going to touch Stiles' face and then stops himself. Which, seriously, <i>what the hell</i>. \"In as few words as possible, please.\" </p>\n<p>\"And, like, right now,\" Scott adds. He gives Stiles the concerned eyebrows, and Stiles despairs of everything. He did not want concerned eyebrows from this exchange. He wanted to curl up and die, and, if he was lucky, talk Scott into petting his hair. </p>\n<p>\"I, uh,\" Stiles says. \"I kind of…had a fight with Derek? And then, um. Made out with Derek? And Danny saw us. And made me have pie. And now we're bros again. That's the good part! The bad part is the…fighting. And making out. With Derek. Um.\" </p>\n<p>\"Uh-<i>huh</i>,\" Boyd says, raising his eyebrows. \"Well. I guess can't say that I'm surprised.\" </p>\n<p>\"Okay, dude, weird question, but I have to check.\" Scott's eyebrows dip even closer together as he talks, and he leans in a little, lowering his voice to a concerned whisper. \"Did Derek, like, punch you in the mouth while you were fighting?\" </p>\n<p>\"What?\" Stiles demands, flailing a little. \"No! Of course not! What the hell?\" </p>\n<p>\"Oh,\" Scott says. He puts a hand to his own mouth, and his eyebrows go up this time; it takes Stiles a second before he realizes that Scott is fucking <i>laughing</i>, what the <i>fuck</i>. \"Uh, well. Jeez, man. Good for you? I guess?\" </p>\n<p>\"Okay, what the <i>hell</i> are you guys--\" Stiles starts. </p>\n<p>Then he catches sight of himself in the mirror and promptly stops talking, because…shit. Shit, shit, shit, Stiles looks wrecked and, and <i>debauched</i>, Jesus Christ. It's not even fair, because it's not like he and Derek did anything except kiss, but Stiles' mouth is swollen and puffy, something that probably hasn't been helped by the way he's been compulsively biting his lips for the last few hours. His hair is all over the place, a result of how many times he's run his hands through it in frenetic stress, and there's glitter on the side of his face that must have rubbed off from somebody at Jungle. All that combined with the way that his long-sleeved black t-shirt is clinging to him, the bright-red flush to his cheeks, and, yeah. Stiles can definitely see what they're laughing about. </p>\n<p>\"Oh my god,\" Stiles says to his reflection. </p>\n<p>\"Yeah,\" Scott agrees, still laughing. \"You've, uh, looked less…porny. You know. In your life.\" </p>\n<p>\"I've been looking for a new caller ID picture for you anyway,\" Boyd says, and when Stiles turns to forbid him from photographing this, he catches the full brunt of the flash. \"Yeah, that's perfect. Didn't even have to say cheese.\" </p>\n<p>\"You guys are the worst,\" Stiles says mournfully. \"The absolute fucking worst.\" </p>\n<p>\"I'm sure,\" Boyd says, flipping his phone shut and standing up. He pushes Scott to one side to get to the wardrobe with a casual, proprietary ease that Stiles has never seen between them before. Scott grins, and Boyd grins back, running a thumb over Scott's neck before he starts rummaging around for a shirt. To Stiles, he says, \"So, not to minimize the man-pain I'm sure you're here to have--\" </p>\n<p>\"Hey!\" </p>\n<p>\"--but can I ask how you left things with Derek?\" Boyd pulls a t-shirt over his head and gives Stiles the serious-business look. \"By which I mean: did you part on good terms or bad ones?\" </p>\n<p>\"Uh,\" Stiles says, wincing, \"well, he kind of said he had to go and then. Er. Ran away.\" </p>\n<p>\"Right,\" Boyd says on a sigh. \"Scott, you deal with him, I'll track Derek down?\" </p>\n<p>\"Sure,\" Scott says, even as Stiles says, \"Wait, what?\" </p>\n<p>Boyd rolls his eyes. \"If you seriously think you're the only one among us on Derek Hale Sanity Watch, you are out of your mind. And, frankly, I'm insulted; I've been doing it way longer than you have. Somebody's gotta make sure he's not running around antagonizing innocent citizens.\" </p>\n<p>\"Beacon Hills doesn't have innocent citizens,\" Scott says, sagging a little. \"Just us, people who are secretly evil, and our parents. And Arif, Arif is cool.\" </p>\n<p>\"I'm sure he'll appreciate that,\" Stiles says. He rubs a hand over his face and sighs. \"Ugh. Can I like, use your shower, then? I promise I'll go back to my own room to sleep, I just, I don't know. I wanted to--\" </p>\n<p>\"You can totally use our shower,\" Scott says, slinging an arm over Stiles' shoulders. \"And our towels. And you can borrow some PJs. And if you wanna sleep in my bed, that's cool too.\" </p>\n<p>\"The girls will forgive us if we leave them on their own for a night,\" Boyd says, and there's something about the wry tone of his voice, the way Scott's eyebrows dance, that makes Stiles think that's an inside joke. </p>\n<p>\"Best friend duty is important,\" Scott says solemnly. \"We are here for you. Or I am, anyway, Boyd's going to go be there for Derek, but still.\" </p>\n<p>\"I take it back,\" Stiles says. He turns into Scott's shoulder shamelessly, because Scott gives the best hugs in the world and Stiles is starting to develop an early hangover. Scott huffs out a laugh but reels him in, patting his back. \"You guys are the absolute <i>best</i>.\" </p>\n<p>\"We know,\" Boyd says, \"back in a bit,\" and gives Scott a brief kiss before he slips out the door. </p>\n<p>\"How is it,\" Stiles says, raising his eyebrows as Scott blushes, \"that I spend months and months dancing around this Derek thing, finally hit terrifying new ground, show up here looking 'porny,' and your sex life is <i>still</i> more exciting than mine? How is that even possible?\" </p>\n<p>\"Boyd says I'm gifted,\" Scott says, shrugging. \"And Lydia says you and Derek are drama llamas. I'm sure it evens out.\"</p>\n<p>Stiles showers, relieved at the solitude that comes of the communal bathroom being Friday-night empty. Under the spray, he can take the shallow, hitching breaths he's been building up to all night without fear of being overheard, can rest his forehead against the cool, slick tile and try to calm himself down. It almost works, the same way it always does--the hot water is enough to unwind the tension from his muscles, if not to untangle the huge knot in his chest. He wraps one of Scott's huge, fluffy towels around his waist when he's done and makes it all the way to the door before he realizes he's forgotten his shower caddy, and it's only in doubling back that he catches sight of himself in the mirror.</p>\n<p>For the second time in an hour, Stiles stops and stares himself down. It's not surprise this time, but curiosity; he's never made a habit of looking at himself half-naked, excepting those awful few months in high school when he did it to be self-punishing, critical. It had been a terrible habit, picking himself to pieces without a lifeline, and he's avoided the practice entirely since then. The mirror, as far as Stiles is typically concerned, is meant to be a clothing-only experience. Naked mirror time is for people whose self-confidence is less fragile than Stiles', and he learned that lesson the hard way more than once. </p>\n<p>But now… well. Now Stiles lets his eyes rake over his torso, the curve of his hips, the lines of his biceps. He's slimmer now than he's ever been, all his baby fat sacrificed to the cause of battling evil, hard muscle stretching out over places where soft tissue used to sit. There's the scar at the base of his neck that Mox's old boss left, two barely-visible dark circles all that remains of puncture wounds that hurt for months after the fact. It's hardly Stiles' biggest scar, but it is the one most often left visible, and he runs his index finger over it almost unconsciously, a little surprised at the feel of rough callous against the smooth skin. </p>\n<p>At the ball of his right shoulder, there's another scar, three massive tears left by the alpha pack in the middle of one of their rougher battles. The skin had healed over dark and ragged, white and red scar tissue knotted together in raised marks that will always look like gashes. His left hip, a sprawling, star-shaped burn from a hydra fight; the center of his chest, four thin white lines from the afternoon Peter played at carving out his heart. Stiles' whole body is like this, a pockmarked history of every time he hasn't died since his life fell to chaos, and when he feels emotion swell in his chest he tries to tamp it down instinctively, realizes a second later that it's pride. </p>\n<p>Reality crashes over Stiles like a wave--no, Stiles thinks. Not like a wave. Waves attack you, overwhelm your defenses, drag you under their surface and don't let go until you drown. It's more like a gust of wind, knocking the breath from his lungs but leaving him upright despite himself: this Derek thing, complicated and messy as it may be, is only a small thing, a manageable one. In the grand scheme of disasters Stiles has weathered, it's not even a blip on the radar, hardly registers at all. It only feels staggering and dangerous, like walking the edge of a fraying tightrope, because of the scars it might leave. But then, doesn't Derek, of all people, know from scarring? Doesn't Derek, of everyone Stiles has ever met, know best the dangers of running claws across someone's heart? </p>\n<p>Derek is probably more scared than Stiles is, if he's going to be honest about it. Derek is probably more scared than Stiles is, and less able to handle his fear--small acts of magic and large acts of manipulation aside, Stiles' real asset to the pack is his ability to work through terror, to tamp it down until what needs to be done is done. And he knows what needs to be done here, doesn't he, if he really thinks about? Hell, on some level, maybe he's always known. </p>\n<p>He goes back to Scott's room, changes into borrowed pajamas, curls up quiet under Scott's covers and tucks his head under Scott's chin. There's a movie playing on the TV, one of those terrible C-list films Scott's always loved to hate, and he tracks it with absent eyes, not really paying attention. Scott pets his hair after all, exuding the sort of benevolent ease that's always been the bedrock of their friendship, when push came to gunfire came to shove, and Stiles lets himself drift on it, centers himself. This is going to be alright. <i>Stiles</i> is going to be alright. He finds enough trouble, these days, to abandon the need to borrow it--maybe that's what growing up is, when you get right down to it. Or maybe Stiles wouldn’t know. </p>\n<p>\"Stiles?\" Scott says eventually, soft in the hush of the room. \"You awake?\" </p>\n<p>\"Yeah,\" Stiles says. \"What's up?\" </p>\n<p>\"Well,\" Scott says, stretching out the vowel like he's wheedling for something, \"I was wondering…since, uh, it sounds like you and Derek are finally getting your shit together--\" </p>\n<p>\"Did you know we had shit to get together <i>too</i>?\" Stiles demands, because, okay, there's inner peace and then there's <i>everyone he knows always being against him</i>.</p>\n<p>Scott sighs. \"Dude, everybody in the whole town knows you've got shit to get together. Your dad asked me to 'Keep an eye on you' the other day, okay, accept your fate and let it go.\" </p>\n<p>\"Oh, god,\" Stiles groans, burying his face in Scott's shirt. \"Okay, well, that's the worst news of the year. What were you asking?\" </p>\n<p>\"Well,\" Scott says again, hesitatingly this time, \"it's just…you remember how when I first started dating Allison I kind of wanted to talk about how she was awesome all the time?\" </p>\n<p>\"No,\" Stiles says. He rolls his eyes and grins at once, can't quite help himself. \"I don't remember that at all. As far as I can recall, you were the picture of manly composure; never once did you make me suffer your love poetry. Not even one time did you call me at four in the morning to cry! It's possible that I'm blocking some stuff out, of course--\" </p>\n<p>\"Dick,\" Scott says, but it's fond. </p>\n<p>\"<i>Werewolf</i>,\" Stiles returns. \"I win forever.\" </p>\n<p>\"Look, dude, what I am <i>asking</i>,\" Scott says, clearly at the end of the patience rope, \"is: if you and Derek start fucking, does that mean I can finally brag about my awesome four-way sex life without risking you like, killing me from the jealous?\" </p>\n<p>There's a pause, loaded and thick, and Scott's whole body is tensed like he's waiting for Stiles to kill him. Stiles holds it back for a minute, just to screw with Scott a little; then he gives it up, hugs him, and laughs so hard he nearly cries.</p>\n<p><b>Text Message from Stiles Stilinski to Derek Hale, Sent: 9:45 AM</b> </p>\n<p>Left you something. Any and all responses must be delivered in person. Place: the overlook at the west territory border. Time: 2PM. I will provide coffee.</p>\n<p><b>Text Message from Derek Hale to Stiles Stilinski, Received: 9:47 AM</b> </p>\n<p>Left me something where? </p>\n<p>\n<b>Text Message from Stiles Stilinski to Derek Hale, Sent: 9:48 AM</b>\n</p>\n<p>You'll find it. Think tradition. See you at 2.</p>\n<p>At quarter past one, Stiles puts on his warmest jacket and hits the Starbucks. He gets a venti black coffee for himself and, after a moment's consideration, a mocha frappuccino with extra whipped cream for Derek. He'll bitch and make faces about it, probably, but it's not like his sweet tooth is any secret, and this way Stiles won't have to risk his beverage getting cold on the walk. </p>\n<p>He drives, tapping his thumbs against the steering wheel frantically and trying not to let his nerves get the best of him. When he fails at that, he turns up the radio and sings along at the top of his lungs, pushing the Jeep off the road and up into the woods as far as she can go. The trees get too close together to drive through eventually, and Stiles cuts the engine and grabs both coffees, tramping through the underbrush as noisily as he can in the hope his broadcasting of his location will make Derek appear. This, too, fails, and at 1:45 Stiles finds himself alone at the top of the overlook, all of Beacon Hills spilling out in front of him.</p>\n<p>Stiles sits down at the edge of the cliff, lets his legs dangle down towards oblivion, turns his collar up against the wind and waits. Derek, if Stiles doesn't miss his guess, will be viciously punctual just to make a point. </p>\n<p>Sure enough, Stiles' phone display has just flicked to 2:00 when he hears a leaf crunch behind his head. He grins despite himself, doesn't turn. \"Derek.\" </p>\n<p>\"Stiles,\" Derek says. He sits, close enough that his leather jacket sleeve brushes against Stiles' corduroy-clad arm, and pulls a bright yellow parking ticket out of his pocket. Stiles bites down on his smile and hands over the frappuccino, which Derek takes, rolling his eyes. \"Really?\" </p>\n<p>\"You like chocolate,\" Stiles says, too innocent.</p>\n<p>\"Not what I meant,\" Derek sighs. He flips open the parking ticket and recites, \"'Dear Derek: I like you like you. Do you like me like me? Please check all that apply.' Are you kidding me?\" </p>\n<p>Stiles is not going to laugh. He's not. This is an important moment with a lot riding on it; the fact that he also happens to be a hilarious genius is neither here nor there. \"I thought, given the circumstances, that the direct approach was best.\" </p>\n<p>\"Stiles, my options are, 'I desperately crave your nubile body,' 'Every breath you take, every move you make, I'll be watching you,' 'I like you, but only in an occasionally-making-out-in-alleys kind of way,' and 'I'll rip your throat out with my teeth,'\" Derek says despairingly. </p>\n<p>\"I wanted to cover every base!\" Stiles says. Definitely not laughing. Gravitas is his watchword. \"I thought I was very thorough!\"</p>\n<p>\"You are thoroughly out of your mind,\" Derek says, but he doesn't sound annoyed. If anything, he sounds relieved, and Stiles lets some of his manic worry drain away, slows his kicking feet just a little. </p>\n<p>They sit in silence for awhile, not quite comfortable but not quite strained, and Stiles wonders if maybe this is it. Maybe this is all it'll ever be, the two of them doing this forever, dancing around and around it but never quite managing to talk about it. Stiles isn't even sure he'd mind that--no, that's a lie. He would mind it, but not so much as he'd mind going through life without any of it, whatever this thing is between them that he's grown to value so much. </p>\n<p>And then Derek sighs and says, \"Stiles, why did you start leaving the notes?\" so maybe they are going to talk about it after all. </p>\n<p>Stiles could say something flip, something glib, could dodge it, but he doesn't want to. The whole point of this, the two of them on the edge of this cliff, is honesty, so he tries to think about what he would say if he was writing it out. Derek waits, doesn't push him, and after five minutes or so Stiles says, \"When I was a kid, I asked my mom what being in love meant.\"</p>\n<p>Derek shifts next to him, but when he speaks, his voice is warm, only a little hesitant. \"Yeah?\" </p>\n<p>\"Yeah,\" Stiles says. He pushes out a breath that hangs soft-white in the air, doesn't quite smile. \"It was right after I first developed what would turn out to be a <i>very</i> long-term Lydia obsession--never let it be said that I don't do my research, okay? And she told me that she knew she was in love with my dad because he just…got her.\" Stiles sighs, twisting his hands together in his lap. \"And when Scott started getting serious with Allison, I asked him too, and he said the same thing. That they just got each other, like it was instinctive.\" </p>\n<p>\"I don't get you,\" Derek says, fast, like a confession. Like he's sorry about it. </p>\n<p>Stiles smiles at him. \"I know you don't.\" </p>\n<p>Derek shifts again, and Stiles could put him out of his misery, could finish the thought, could get to his point. But it's true what Derek's been saying, overtly and covertly, over the past few months: Stiles isn't kind. He's <i>capable</i> of kindness, can pull it out when he needs to, knows how to work it as an angle or apply it as a tool, but it's not his default state and it never has been, either. It doesn't mean he doesn't care about the people in his life--if anything, he cares too much, pushes past the acceptable boundaries of investment into territory that's often uncomfortable. Kindness, Stiles has come to realize, has nothing to do with that. Kindness is about putting other people's feelings before your own, and Stiles does hate to pull his punches. </p>\n<p>He waits instead of saying anything, watching Derek's discomfort twist his face into a scowl, tracking the way Derek's thumb and forefinger worry at the crisp edge of the parking ticket, softening it. The forest is resplendent in amber and red, fallen leaves blowing around in the heavy wind and drifting over the cliff's edge; Derek's sticks out like a sore thumb with his dark hair and black jacket, a shadow in broad daylight. </p>\n<p>\"You didn't answer my question,\" Derek says after a while, and Stiles grins. </p>\n<p>\"Sure I did,\" he says. \"Months ago. I even gave it a handy title, I believe it was 'Reasons Why I Am Doing This.' Don't you remember?\" </p>\n<p>\"Actually, it was, 'Reasons Why I Am Doing This: An Incomplete List,'\" Derek says, scowling. \"Not that I tortured myself wondering what was incomplete about it for days or anything.\" </p>\n<p>\"Sorry,\" Stiles says. </p>\n<p>Derek sighs. \"Liar.\" </p>\n<p>\"Yeah,\" Stiles admits. He takes a long sip of his coffee; it's mostly cold, but still strong, and he lets the flavor coat his teeth, his tongue. \"Look, Derek… if you want me to answer your questions, you're going to have to answer some of mine.\" </p>\n<p>\"You'll make the whole world blind that way,” Derek says, scowling down at his cup.</p>\n<p>\"This isn't eye for an eye,\" Stiles says, and laughs on it a little despite himself. \"This is a negotiation, kind of. Or me taking advantage of the circumstances, if we're going to be honest. I don't have leverage over you very often.\" Derek snorts, and Stiles narrows his eyes, tilts his head. \"Did you mean what you said last night? That you've wanted me for years?\" </p>\n<p>Derek freezes. \"I didn't say that.\" </p>\n<p>\"Okay,\" Stiles says. He pitches his voice low, because it's clear that he's spooked Derek somehow, and that's the last thing he wants to do here; Stiles is having some fun with this, sure, but that's mostly because it's the only good distraction from the way his heart is threatening to beat out of his chest. \"You'll forgive me if I was a little, uh, distracted. You're kind of a good kisser, I wasn't exactly in a place to be taking down direct quotes.\" </p>\n<p>\"I didn't,\" Derek stops, takes a deep breath, flexes his hands. \"It wasn't…it's never just been about <i>wanting</i>. You were a kid, you're still a kid--\" </p>\n<p>\"Whoa,\" Stiles says. \"Let's just interject here with the fact that I am old enough to vote, rent an apartment, join the army, buy myself little boxes of cancer in stick form, and purchase my very own pornography. That, combined with the fact that I have seen and participated in more gore and grisly murder than your average grown-ass adult, means you can drop that one, okay? I have officially graduated from the kiddie-pool.\" </p>\n<p>\"Stiles, I…\" Derek shakes his head and punches out a long sigh. \"It wasn't a sex thing, okay? Or, wasn't <i>just</i> a… I mean… look, you never backed down. Ever. From anything! Even when I could smell the terror on you, you were always so…\" Derek stops, shakes his head, and Stiles bites his tongue to keep himself from interrupting; he wants to know what Derek's getting at. \"You were an asset to the pack, to me, even when you had no reason to help us. And you never let me intimidate you, even when you were terrified of me. Even when you knew I had to know that. You fascinated me. I didn't really figure out the…the other part until it was too late.\" </p>\n<p>\"Too late to what?\" </p>\n<p>\"To stop myself from feeling it,\" Derek says. He's not looking at Stiles now, is staring out at the vista of the town below them. Stiles wants to touch him, doesn't. \"I tried not to. You were a high school student and I wasn't going to be… look, it doesn't matter. I'm glad you didn't know. I did everything I could to get rid of it, to keep you from noticing; I didn't want to make you uncomfortable.\" </p>\n<p>\"What if I wouldn't have been uncomfortable?\" Stiles says, shifting a little against the cold rock of the outcropping. \"What if I would've been like, 'Hey, awesome, the hot werewolf I've been fantasizing about for months is totally into me, how sweet is that?'\" </p>\n<p>\"That would've been worse,\" Derek says, his voice raw. \"You've got no idea the kind of damage that could've done, the kind of damage <i>I</i> could've done, if I'd had you in that position.\" </p>\n<p>Stiles takes another swig of coffee, considering. \"Did you <i>want</i> to damage me?\" </p>\n<p>\"Of course not,\" Derek spits. \"How can you ask me that? Why else would I have kept it--\" </p>\n<p>\"Slow your roll, dude, just making a point.\" Stiles waits a second, two, until Derek lifts his head, eyebrows furrowed in confusion. Then Stiles smiles, slow and warm, and reaches for kindness after all. \"You're not going to hurt me with your feelings, Derek. You don't even want to, and I'm pretty fucking sure you couldn't at this point, you know? I mean, aside from everything else, people have failed to hurt me with chainsaws. And axes. Feelings are kind of easy to defend against, comparatively, and I'm not really looking to defend against them anyway.\" </p>\n<p>\"You should be,\" Derek says, but he hasn't looked away yet. </p>\n<p>\"My call, isn't it?\" Stiles doesn't break Derek's gaze as he takes another sip of coffee, just watches him over the rim of the cup. \"So. I guess that explains all the glaring and avoiding me and general dickish behavior when I was in high school, huh?\" </p>\n<p>Derek tilts his head in acknowledgement. \"Well. Sometimes you were just annoying.\" </p>\n<p>\"And sometimes you're just a dick,\" Stiles returns gleefully. Derek rolls his eyes and reaches for his drink, and Stiles makes a mental note to take a photography class at some point in his college career; Derek sipping on a mocha frap is something that definitely needs professional capturing. </p>\n<p>\"Stiles,\" Derek says, \"are you going to answer <i>my</i> question now?\" </p>\n<p>\"In a second,\" Stiles says. \"I want to know why you wrote back first. You could've stopped me from bothering you a hundred different ways, but--\" </p>\n<p>\"You weren't bothering me,\" Derek says, cutting him off. He looks annoyed now, which is, at least, familiar. \"Are you not <i>listening</i>? Is that what's wrong here? I told you: I was fascinated. Am fascinated. Whatever! I don't understand how you work, and I couldn't ask because I couldn't risk what might happen if I let myself get close to you. I didn't want to--\" </p>\n<p>\"Make me uncomfortable, yeah, I got it, you <i>don't</i>, can we skip ahead?\" </p>\n<p>\"You started dropping notes in my car, Stiles,\" Derek says, exasperated. \"Detailed, emotionally revelatory notes that I didn't have to reciprocate or know how to react to. That talked to me like we were friends, like you could trust me, even though I know I went out of my way to <i>avoid</i> giving you that idea. I didn't ask you to stop because I didn't want you to stop. I wrote back because <i>I didn't want you to stop</i>. It was selfish, but I couldn't help myself. I got hooked on it. Finding the damn things became the best part of my day.\" </p>\n<p>\"Oh,\" Stiles says. He tries not to, tries to swallow it back, but he finds a huge, helpless grin spreading over his face anyway. There's a sensation swelling in his chest he doesn't think he's ever encountered before, this heady combination of relief and surprise and affection, and before he can stop himself, he says, \"I thought you'd think it was weird.\" </p>\n<p>Derek's eyes crinkle at the corners, a faint hint of humor lingering there. \"Of course I thought it was weird. Everything you do is weird. That doesn't mean I don't like it.\" </p>\n<p>\"My mom was the most self-possessed person I've ever met,\" Stiles blurts out. It's a total non-sequitur, but it's necessary, because Stiles wants to kiss Derek more than he's ever wanted anything in his life, and he can't. He has to get through what he came here to say first; if he doesn't, he won't say it at all. \"She always knew exactly what she was saying and exactly what it meant. She used to say that she was the love of her life, and that she was lucky my dad didn't mind the competition--I didn't really understand what she meant until I got older. And Scott… Scott's never been anybody but Scott, has he? Even when he got turned into a freaking werewolf, he was still Scott. It's, like, my favorite thing about him. He's a universal constant.\" </p>\n<p>\"Stiles, what--\" </p>\n<p>\"I don't think love works the same way for everybody,\" Stiles says. He sucks in a huge breath and almost hopes Derek will interrupt again, but he doesn't, just watches Stiles with hooded eyes. \"And I meant it, when I said I didn't know why I started writing to you. I still don't know. I just do things, and I've always got a million reasons, and none of them ever feel like the right ones. I wanted to talk to you. I wanted you to want me to talk to you. And…\" he trails off, not sure if he can get to his point after all. Even Stiles can't be brave all the time; even Stiles has fears he can't overcome. </p>\n<p>But then Derek says, \"And?\" soft and prompting and pleading, all at once, and Stiles doesn't have any choice. </p>\n<p>\"I don't want someone to get me,\" Stiles says, rushed and embarrassed and so honest he feels naked in the cool fall air. \"That doesn't work for me, because <i>I</i> don't get me. I don't think I even want to. Sometimes I feel like I'm a hundred different people at the same time, and I'm sick of trying to pick the one that's going to win out, or work best for someone else. I'm sick of trying to choose the winning line on my own freaking personality. I want… fuck, Derek, I don't know. I get obsessed with things, you know? I get obsessed with <i>people</i>, and I want that to be okay. I want to not feel like I have to tone it down all the time, because I can't, I've tried and I'm not…I'm not good at it. I can't just turn it off. And having somebody who gets me…who could want that? Why would anybody want that? What if I didn't stay the same person? What if <i>you</i> didn't?\" He bites his lip when Derek's eyebrows go up, pleading still, and admits, \"I want somebody who gets <i>to</i> me.\"</p>\n<p>Stiles can barely think through the blush he knows is staining his cheeks, the choking sensation that he's come to recognize as the aftermath of honesty, what always happens when he's waiting for judgement this way. But Derek looks shocked and maybe even hopeful, and his voice cracks when he says, \"And I do?\"</p>\n<p>A little more honesty, Stiles thinks. It's the least he can do, and he probably owes it to both of them. He meets Derek's eyes, blue and flecked with hazel, and takes one more deep, steadying breath.</p>\n<p>\"You do,\" Stiles says. \"You always have.\" </p>\n<p>When they kiss this time, there's none of the desperate, frenetic heat from last night, no rush of mouths slamming together hard enough to hurt. Instead, Derek's hand lifts off his thigh and flexes in midair, not-quite-reaching for Stiles as he makes a small, pained noise from the back of his throat, and Stiles leans in and makes the contact for him. He eases his lips over Derek's carefully, like a question, like an invitation, and Derek takes a shuddering breath and opens his mouth. His right hand comes to rest at the side of Stiles' neck, thumb swiping in wide strokes over Stiles' cheek, and Stiles reaches around to bury a hand in Derek's hair. It takes some maneuvering, but Stiles twists around, opens his whole body up to the kiss, sliding his free hand beneath the breast of Derek's jacket; Derek's left arm snakes around Stiles' body, a bar between Stiles and the edge of the cliff, and his hand comes to rest at the small of Stiles' back. </p>\n<p>Stiles isn't sure how long they sit there, sharing space like it's all they've got to give, kissing slow and exploratory and so careful it's almost surreal. He doesn't care, because it's good in a way nothing has ever been good for Stiles before; he's shown Derek as much of himself as he could bear to, has spent months handing himself over, and Derek's right here anyway, kissing back like Stiles is all that he wants. It releases the part of Stiles that's always been there before, sitting in the back of his mind and critiquing him through every touch, every kiss, every look he's shared with everyone else he's ever wanted. He's never been able to let it go like this before, never been able to stop wondering how much is too much--now, he lets himself trace the inside of Derek's mouth with his tongue, drag his palm down the soft cotton front of Derek's shirt. He lets himself touch Derek, kiss Derek, with all his coiled intent to map Derek's ins and outs right at the surface, and Derek shudders against him, pulls him closer, doesn't ask him to stop. </p>\n<p>\"I can't promise you anything,\" Derek says eventually, almost a whisper as he breaks away. He rests his forehead against Stiles', rubs his thumb against Stiles' cheek again; it's a wistful gesture this time, and the sadness in his eyes is heartbreaking. </p>\n<p>\"Who's asking you to?\" Stiles says, and Derek sighs, but he doesn't pull back. </p>\n<p>\"I mean it, Stiles,\" he says. \"Not anything, I don't--there are things I haven't told you. I don't know what I'm doing. I don't know how much I'm going to be <i>able</i> to do, and I don't want you to think--\" </p>\n<p>Stiles kisses him silent, sharp and brief and pointed, just enough to shut him up. When he leans away again, Derek's eyes are wide and wet and just this side of shocked; Stiles can't help but dart back in, lingering this time, before he screws his self control to the sticking place and finally separates them. </p>\n<p>\"Tell you what,\" Stiles says, \"let's do what we always do.\" </p>\n<p>Derek's eyes are still wide and wet, and his hand is shaking against Stiles' neck, but the corners of his mouth twitch up. \"And what's that, out of curiosity?\" </p>\n<p>Stiles grins with his whole heart in it, doesn't let up until Derek's smiling back. \"Oh, you know,\" he says. \"Make it up as we go along.\"</p>\n<p></p>\n<p>\n<b>Epilogue:</b>\n</p>\n<p class=\"desc right\">[Found inside an envelope hand-delivered by a confused, but grinning, Arif, and written on the back of a piece of paper Stiles very much did not intend Derek to find:]</p>\n<p class=\"derek\">Stiles. We’ve been fooling around for three months, and writing for more than twice that time. You can officially STOP KEEPING COUNT OF THE NOTES, what the fuck. Please reroute whatever energy you’re spending on keeping this tally to doing something useful, like creating an accurate list of every potential serial killer in your Econ class. Or remembering to buy condoms. </p>\n<p class=\"desc left\">[Left on Derek’s freshly remade bed:] </p>\n<p class=\"stiles\"><u>Reasons You Shouldn't Worry About What Just Happened: A List</u><br>\n<br>\n1. Shit happens. Is there anybody on the planet who knows that better than us?<br>\n<br>\n2. I mean this in the nicest way possible, but: dude. If I was looking to be with somebody who didn't have any issues, I would not be with you. I am aware that your shit is complicated and messy. I'm not scared of it. I'm not scared of <u>you</u>. I will keep saying that until you hear it. IF I HAVE TO, I WILL LEARN TO FLY A PLANE AND SKY-WRITE IT. (I guess I could hire somebody to do that, but who wants to spend ridiculous money on sky-writing if they're not learning to do it themselves, am I right?)<br>\n<br>\n3. How many times have you seen ME have a full-blown, balls-to-the-wall actual panic attack? Like, seriously. Remember that time with the centaurs when you found me in that cave by the sound of my freaking heartbeat? Remember that time we thought Scott had been murdered by banshees and I completely checked out of reality? In the grand scheme of freak-outs, Derek, this is small potatoes. This is fingerling potatoes. This is <u>hash browns</u>.<br>\n<br>\n4. Whatever it was that set you off? I will NEVER DO IT AGAIN. For real. I promise. It would be great if you could find a way to tell me what it was, but if you can't, that's cool too; rest assured that I'm already taking advantage of my incredible memory powers to obsessively catalog everything I did and said tonight. If you can't tell me which thing was the bad thing, I'll just, uh, avoid all of it until you've told me otherwise, okay?<br>\n<br>\n5. You can tell me. Like, okay, obviously I don't know if you actually can tell me or not, because that's your call and everything, but I mean that whatever it was? I'm not gonna be mad or freaked out or whatever it is you've decided I'm going to be this time, alright? If the jokey pet names do not work for you, we can axe them forever. If you've developed a sudden aversion to blowing me, I will say a heartfelt goodbye to blow-jobs! I'm not fucking around here--whatever it was, I will cut it out permanently, no questions asked.<br>\n<br>\n6. Except the question of why the hell you took a pillow with you. I have a dorm room, Derek! And a bedroom IN THIS HOUSE that isn't your bedroom. You can kick me out, you know. You live here.<br>\n<br>\n7. I'm leaving this note because I thought it might be better for you if I wasn't here when you got back. If I was wrong about that, the keycard taped to the paper was supposed to be a spring break present, but whatever, circumstances are circumstances and all that shit, and I'm only a few days early. It's a student ID card (please do not ask who I had to bribe to get it) and you can swipe it for access to any building on campus. Arif's at Suzanne's for the weekend, so feel free to break into my dorm room. It'll be just like old times! You can even watch me sleep Edward Cullen-style. I promise not to mock you, just this once.<br>\n<br>\n8. That thing we don't say? I mean it. A lot. I'll be around when you're ready to talk.<br>\n<br>\n</p>\n<p class=\"desc right\">[Found inside an empty box of Frosted Flakes left on Stiles' pillow:]</p>\n<p class=\"derek\">It grrrrrrrrrrrravely irritates me when you do this. Throw the damn box away when you're done with it, you threw off my whole morning. -D</p>\n<p class=\"desc left\">[Left stuffed inside a half-finished box of Trix:]</p>\n<p class=\"stiles\">Silly werewolf! Being obsessive about cereal is for kids, and people who aren't gigantic babies about doing the grocery shopping. You are disqualified on all fronts. PLUS, you totally ate the rest of my pizza the other night. We're even. -S</p>\n<p class=\"desc right\">[Found taped to the front of an unopened box of Apple Jacks:]</p>\n<p class=\"derek\">I eat what I like. You know this. If you didn't want me to finish your pizza, you should have finished it yourself. That's no excuse for leaving an EMPTY BOX of cereal in the cupboard. -D</p>\n<p class=\"desc left\">[Rubber-cemented to the front of a fresh box of Cocoa Puffs:]</p>\n<p class=\"stiles\">You don't even like Apple Jacks. Which means you bought a box of cereal you'll never eat JUST to make a reference I'm not even old enough to get, and had to google. Which makes you…<u>cuckoo</u>.<br>\n<br>\nBeat that. -S</p>\n<p class=\"desc right\">[Found inside a box of Life that has been emptied of cereal and refilled, very carefully, with dirt:]</p>\n<p class=\"derek\">Life is full of surprises. -D</p>\n<p class=\"desc\">[Found shoved underneath Derek &amp; Stiles' door:]</p>\n<p class=\"everyone\">YOU GUYS ARE NOT THE ONLY PEOPLE IN THIS HOUSE WHO EAT CEREAL. STOP. IT.<br>\n-EVERYONE</p>\n<p class=\"desc left\">[Left inside Derek’s suitcase:]</p>\n<p class=\"stiles\">Dear Derek,<br>\n<br>\nBy the time you find this, you will be in a hotel room in Toronto! While my primary feelings about that are still a) I cannot fucking believe that they hold werewolf safety conferences in Toronto, b) I cannot fucking believe that they scheduled the ONLY ONE THIS DECADE during my last finals week ever, c) I cannot fucking believe that you're actually going to go play happy lycanthropes with these people and d) I cannot fucking believe that you have an up-to-date passport, I thought I would leave you this little gift.<br>\n<br>\nSo: while you are attempting to schmooze (<i>SHmo͞oz</i>, verb: the act of exchanging pleasant, non-essential conversation that does not feature in growling, scowling, prowling, or other things that end in -owling; have fun with that) I will be here. In our bedroom. By myself. And while you might think, Derek, that I will use this time to study for my LAST FINALS EVER (!!!), you would think wrong, because what I will in fact be doing is impaling myself on the brand-new vibrator I bought when you told me about this little trip. It's even bigger than you are--I hope that doesn't make you jealous. It doesn't, does it? Because you don't get jealous of inanimate objects, do you? Because, as we all know, you are perpetually and steadfastly level-headed and rational in all things. Right?<br>\n<br>\n(I've named it Barnabus. You know, so you can have something to call it when you're swearing at it in your head.)<br>\n<br>\nSo you have fun, Derek, with your schmoozing and your boozing (please do not actually booze, I suspect it will harm your ability to schmooze), and I'll be here, burying my fingers in my ass until I'm loose enough to fuck myself on this beautiful, beautiful new toy. Maybe I'll even spread my legs out wide and drip lube all over the sheets the way you like. I'd talk you through what I was doing, describe how it felt to fuck myself and think about you do it, if you wanted me to. Hell, I'd even consider renaming the vibe Derek, assuming you’d consider actually staying on the phone with me while I did so.<br>\n<br>\nIn conclusion: good luck continuing to object to phone sex on grounds of it being undignified. Really. Force of will is very sexy. Just like Barnabus.<br>\n<br>\nKisses!<br>\nStiles </p>\n<p class=\"desc right\">[Found tucked into Stiles’ hand upon waking up after surgery:]</p>\n<p class=\"derek\">Stiles,<br>\n<br>\nI’m writing this from the hospital, which I point out in the hopes that when you someday reread this (I know you still keep these, even if I can’t figure out where), you will remember that I wrote it from your bedside. Where I’m sitting. Again. Do you know I’ve gotten so used to being in here that, when I fall asleep in these stupid fucking visitors chairs, I wake up and realize where I am from the way the plastic digs into my skin before I notice the smell? This is a werewolf thing I’m not going to be able to explain, but I can’t tell you how fucking unsettling it is that muscle memory has taken over the <u>scent of death</u> as my initial identifier in this building. It means you’re in here too much. It means you’re in here MUCH too much.<br>\n<br>\nI know it’s useless to tell you that your tendency towards reckless heroics is unnecessary. I know it’s useless to point out that Scott is <u>better at them than you anyway</u>, and doesn’t want you doing this either. I know that, after seven and a half years of having you as pack, I should just accept the fact that you’re always going to be doing this shit. I know you think you’re lucky, and I know Alan thinks so too, and I know you both think there’s something more than human about that luck. Hell, I even agree with you--the fact that you have managed to stay alive this long is fucking unbelievable, when I think through every stupid stunt you’ve pulled over the years.<br>\n<br>\nBut luck runs out, Stiles. If that bullet had hit an inch closer to your heart, I would’ve had to bite you to keep you alive. And I know you’ve said you’d forgive me, that if it was the only option you’d want it, but it makes me sick to think about it. I promised myself after the mistake with Victoria, and again after Gerard, that I would never give the bite against someone’s will--I don’t want to break that promise. I don’t want to take the chance that you’d end up hating me for turning you, and if your body rejected it, if my bite ended up being what killed you, I honestly don’t think I’d be able to go on. I know how cliche that sounds, but I don’t care. I need you to understand what I’m saying. I need you to understand that I mean it.<br>\n<br>\nPlease. Stop. Doing. This. Wolfsbane or not, there is always a better option than you taking a bullet for me. Clusterfuck or not, there is always a better option than you ending up in the hospital, AGAIN, especially because you’re not a fucking teenager anymore. The older you get the slower you heal, and I’m sick of waiting for you to get that through your head. I’m sick of avoiding your father’s eyes in the damn waiting room, and I’m sick of you FAILING TO UNDERSTAND that I need you to be ALIVE more than I’m ever going to need you to be idiotically self-sacrificing! If you can’t keep your own best interests at heart, if you are as COMPLETELY INCAPABLE of valuing your own life as you seem to be, then think of me and the pack. We don’t need you to bleed for us, because WE HEAL AND YOU DON’T. What we need you to do--what I need you to do--is stay the fuck alive, Stiles. This isn’t complicated.<br>\n<br>\nIf you wake up and find this note and not me, assume I’ve been kicked out and will sneak back in when I can. Melissa’s covering me on disobeying visiting hours, but her shift may be up before you come out of it. I’ll be back. Please AVOID DYING while I am gone.<br>\n<br>\nI still don’t get you.<br>\n<br>\n-D</p>\n<p class=\"desc left\">[Written on the back of Arif’s wedding invitation and stuck to the refrigerator with Allison’s “Did you eat a bowl of stupid for breakfast?” magnet:] </p>\n<p class=\"stiles\">WE ARE GOING TO THIS, DEREK. BOTH OF US. WE WILL DRIVE TO NEW YORK IF YOU’RE GOING TO BE WEIRD ABOUT PLANES, BUT WE. ARE. GOING. THERE IS NO AMOUNT OF POUTING, WHINING, COMPLAINING ABOUT WEARING BLACK TIE, OR INSISTING I’M THE ONLY PERSON HE WANTS TO SEE THAT WILL GET YOU OUT OF THIS. I AM THE BEST MAN IN THIS WEDDING AND SO HELP ME, I WILL <u>DRAG</u> YOUR WEREWOLF ASS ACROSS THE COUNTRY IF I HAVE TO.<br>\n<br>\nAlso, you’re getting fitted for a tux tomorrow, I stuck the appointment in your phone, and if you skip it you’re answering to Lydia. She seems to be very excited about dressing you up. I told her to feel free to instruct the tailor to stick you with pins, because I saw your google searches looking for something to commit to for this weekend to get you out of this. THERE IS NO GETTING OUT OF THIS. Deal with it. </p>\n<p class=\"desc right\">[Found inside the locked metal box buried next to a very specific patch of bushes on the side of a Beacon Hills country road, on top of the notes Stiles has been storing inside of said box for a decade:]</p>\n<p class=\"derek\">In retrospect, I can’t believe it took me ten years to figure this out. Sentimentality meets paranoia; charming as ever, but you could still work on your subtlety. -D </p>\n<p class=\"desc left\">[Left inside the carefully hollowed-out tree trunk in Stiles’ father’s backyard, on top of the notes Derek has been storing inside of said tree trunk for a decade:] </p>\n<p class=\"stiles\">I found this six years ago, you absolute lunatic, and you’re lucky my father and Melissa are understanding about the fact that you sneak back here every few months. Subtlety’s on you this round. Love you. -S </p>"
}