{
  "id": "541020",
  "url": "https://archiveofourown.org/works/541020?view_full_work=true",
  "author": [
    "zosofi"
  ],
  "title": "This is Ridiculous",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Vernon Boyd/Erica Reyes",
    "Allison Argent/Scott McCall",
    "Lydia Martin/Jackson Whittemore"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale",
    "Scott McCall",
    "Allison Argent",
    "Jackson Whittemore",
    "Lydia Martin",
    "Danny Māhealani",
    "Vernon Boyd",
    "Isaac Lahey",
    "Erica Reyes",
    "Sheriff Stilinski",
    "Alan Deaton"
  ],
  "additional_tags": [
    "Humor",
    "Romance",
    "Future Fic",
    "Unicorns",
    "Mythical Beings & Creatures",
    "Violence",
    "BAMF!Stiles"
  ],
  "language": "English",
  "series": "",
  "published": "2012-10-19",
  "completed": "2012-10-19",
  "words": "35,818",
  "chapters": "6/6",
  "comments": "373",
  "kudos": "13,969",
  "bookmarks": "3,930",
  "hits": "254,532",
  "summary": "<p>There's a unicorn in Beacon Hills. A fricken' unicorn. In fricken' Beacon Hills, California. And it turns out that unicorns aren't drawn towards virgins in a happy-go-lucky let-me-lay-my-not-at-all-metaphorical-horn-in-your-lap way. No. They kill them. And guess who's the only virgin idiotic enough to get sucked into the Beacon Hills supernatural scene? Stiles, that's who.</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_1_endnotes\">notes</a>.)\n</p>\n<p>TBC</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">notes</a>.)\n</p>\n<p>Every time I buy nutella it somehow ends up at the back of my fridge for months. I know, it's abhorrent, really.</p>\n<p>TBC</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Is this a good cliffhanger or a bad cliffhanger? Meh, all cliffhangers rock.</p>\n<p>Anyway, I figure that if DC doesn't make a badass Batwoman movie then...well I guess my life won't change that much. BUT IT WOULD BE COOL, RIGHT? A BATWOMAN MOVIE!?</p>\n<p>TBC.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>TBC</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_5_endnotes\">notes</a>.)\n</p>\n<p>TBC</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_6_endnotes\">notes</a>.)\n</p>\n<p>FIN. </p>\n<p>If you're on tumblr, feel free to follow me at zosofi!<br>Edit 1/10/2013: Edited for visible mistakes/ technical errors.</p>",
  "text": "<p>\n<strong>Because I've never trusted unicorns. </strong>\n</p>\n<p>Stiles has a lot of weaknesses. He's always had a lot of weaknesses, but it's only in the, what, year and a half? Yeah, it's only in the year and the half since his brilliant idea to go search for a dead body in the woods (that resulted in Scott getting bitten by a <em>werewolf</em> and his life turning into a fucking supernatural TV show) that he's realized just how <em>many</em> weaknesses he has.</p>\n<p>He has a weakness for curly fries that's probably going to come back and bite him in the ass some day. He's human, which, according to everyone around him, is <em>the greatest</em> <em>weakness of all</em>.</p>\n<p>Stiles says fuck them. He likes being human.</p>\n<p>He's hyperactive, he cares too much about who he cares about, and he cares too little about who he doesn't. He's noisy (and nosy, for that matter), he's impulsive, he's clumsy, he has panic attacks, he lies <em>a</em> <em>lot</em>, and, well, since we're turning this into a shit-on-Stiles thing, he's also not the coolest dude in the dude bouquet.</p>\n<p>Whatever the fuck a dude bouquet is.</p>\n<p>Anyway, Stiles has a lot of weaknesses. But this… this weakness.</p>\n<p>This weakness just hits him where it hurts.</p>\n<p>\"I think I want to punch something,\" he says, because he does. Want to punch something. He wants to punch something hard, because this just… it… he just <em>can't</em> anymore.</p>\n<p>\"Won't de-virginize you.\" Jackson, leaning up against the column opposite him, sneers. He's still wearing his fucking sunglasses. They're <em>inside</em>. Who wears sunglasses inside.</p>\n<p>Oh, right. Jackson. <em>Because he's a douche</em>.</p>\n<p>\"I wasn't talking to you, fish lips,\" he snarls.</p>\n<p>\"Oh, fish lips.\" Erica, seated next to him on one of the chairs Stiles himself had brought over to Derek's unofficial headquarters (if, you know, an abandoned rail car inside an abandoned warehouse can be considered the headquarters to anything), grins. \"That's a good one.\"</p>\n<p>\"I will fucking <em>pummel</em> you, Stilinski,\" Jackson hisses, because, even though he's been a werewolf for a little more than a year, he still can't get rid of some of the funnier habits his stint as a kanima gave him. \"<em>Pummel</em> you.\"</p>\n<p>\"Oh, well, please, go right ahead.\" Stiles gestures at his face, already black and blue from when he <em>fell down a fucking cliff</em> while running away from a <em>murderous unicorn</em>. \"It's not like—\"</p>\n<p>\"Shut up,\" Derek interrupts. Fuck him and his glorious scruff. \"I can't think with you idio—\"</p>\n<p>\"Ohhh, I'm so scared.\" Stiles wonders if having a death wish qualifies as a weakness or a strength. \"It's not like I've just spent the last two hours running from a fucking <em>murderous unicorn</em>. And then <em>falling down a cliff</em>.\"</p>\n<p>\"You didn't fall down a cliff.\" Lydia gives him her best death glare, and he slouches, but only a little. \"It was more like a hill. And the black eye is from when you punched yourself in the fa—\"</p>\n<p>\"—because I was <em>falling down a cliff,</em>\" Stiles seethes. \"Thanks for helping me, by the way, Lydia. Really great team player. I mean—\"</p>\n<p>\"I thought you weren't a virgin any more,\" Scott, oh glorious Scott, interrupts. Stiles glares at him. He glares until he realizes everyone is just kind of staring at him, waiting for an explanation.</p>\n<p>The thing is, Stiles <em>is</em> a virgin. It's just… he hadn't really thought it was that big of a deal, until now. Sure, he hadn't, you know, done the whole <em>penetration </em>thing, but there had been some… incidences over the last year that had made him a little less desperate about the whole sex thing.</p>\n<p>\"Apparently I am,\" he mutters, ducking his head so no one sees when his face heats up. They can probably smell it on him or something. Fucking werewolves.</p>\n<p>\"But, dude!\" Scott's warmed up now. Oh god. \"There was that girl, uh, last summer? After the whole Alpha pack thing? At the party? You guys disappeared for—\"</p>\n<p>\"Nope.\" Stiles drops his head in his hands. The girl had been tall, dark, and mysterious. They had made out in a closet for thirty minutes, and then she'd told him if he let her suck his blood she would suck his dick. And she hadn't even been a vampire. Just a weird human with a blood fetish. He can hear someone trying to cover up their snickering. It sounds like Isaac. Fucking Isaac.</p>\n<p>\"And the guy!?\" Scott says, and Stiles cringes. \"At Jackson's Halloween party?\"</p>\n<p>\"… you testicles were at my Halloween party?\" Jackson sounds offended. Someone snorts.</p>\n<p>\"Nope.\" The guy… well, the guy had been dressed as a slutty Winne the Pooh (don't even ask, it worked at the time), and Stiles had dealt with it, being drunk and horny as hell, until he'd looked down, at where the guy had his dick in an awkward, too hard grip, and then back up, and realized that he was getting a hand job from <em>Winnie the fucking Pooh</em>. So he had screamed and run all the way home.</p>\n<p>\"Okay, the <em>other</em> guy?\" Scott sounds desperate. Stiles glares at him, because there's really no need to re-hash all of his sexual encounters one by one, is there? He thinks he would know if he had penetrated and/or been penetrated.</p>\n<p>Boyd, who's sitting on the top of a bunch of wooden crates, starts laughing, and Stiles wonders, briefly, why he's looking at Derek, who seems to be disturbed with the current conversation, if the way his eyebrows are practically converged above his nose are any indication, and then Erica and Isaac start laughing, and he doesn't give a shit any more.</p>\n<p>\"<em>No</em>, Scott. Drop it, dude.\"</p>\n<p>\"I mean, it's not a problem, Sti—\"</p>\n<p>\"It is, actually,\" Stiles points out. \"Because I'm being targeted by a unicorn—a fucking <em>unicorn</em>—who wants to kill me because I haven't fu—\"</p>\n<p>\"We kill it,\" Derek interrupts.</p>\n<p>\"Yeah!\" Stiles says. \"We kill it. That's a great idea, Derek. Wow, <em>why didn't I think of that</em>?\"</p>\n<p>Sarcasm, man. He <em>loves</em> sarcasm.</p>\n<p>\"We call Deaton,\" Scott suggests, then remembers that Stiles has just come from Deaton's, having run there right after he had gotten away from the, and, no Stiles is not going to <em>not</em> italicize this any time soon, <em>fucking murderous fucking unicorn</em>. \"Again.\"</p>\n<p>\"He's looking stuff up right now,\" Stiles says. \"I'll call him lat—\" his phone rings, and when he sees that it's his dad, he gets up, and limps outside before he answers. He may have twisted his ankle when he fell down the <em>cliff</em> (not a hill—hills aren't that fucking steep, thank you very much).</p>\n<p>\"Hey dad,\" he says, because that's what he usually says when his dad calls. If it's a little more morose than usual, well, he's just been chased by a <em>fucking unicorn</em> who wants to kill him because he's a virgin. So sue him.</p>\n<p>He almost wishes they were dealing with the Alpha pack again. Or the leprechauns from last March. At least he'd gotten to see Derek getting attacked by little green men. At least it had been <em>entertaining</em>, and not horribly embarrassing. Well, it had probably been embarrassing for Derek, but for Stiles it had been entertaining. This situation is probably… well, it seems like it's the opposite.</p>\n<p>\"Stiles, I assume you know something about bodies being found gored through the stomach? In the forest? About five miles outside of town?\" is his dad's greeting, and he sighs. \"With a horn?\"</p>\n<p>\"It's a unicorn, Dad,\" he says. \"Derek and them are on it.\"</p>\n<p>There's a pause. \"A unicorn.\"</p>\n<p>\"They're not white and ethereal, if that's an consolation,\" Stiles grumbles. No, the unicorn that had chased him through the woods had been a monster. He doesn't recall a lot of specifics, but he knows there was a horn—<em>duh— </em>and it's hooves had been strangely… elephant-like? Oh, and it had a deer's head. So, you know, there was that. \"Fuc—I mean fricken' ugly, more like it.\"</p>\n<p>\"Right.\" The Sheriff sighs. \"So an animal attack.\"</p>\n<p>\"And it's actually the truth this time, too, dad!\" Stiles puts some enthusiasm in his voice, because he's been trying to get his dad to, <em>at least</em>, see the morbid humor in the spectacle that is their lives. It's been working better, lately. At least it's a step up from being put under house arrest for the first month after Stiles had told him werewolves existed.</p>\n<p>\"You're not hurt?\"</p>\n<p>\"No.\" Stiles looks at where his arms are scratched up and bruised, then down at his jeans that are ripped and torn and muddy. He sighs. \"Well, not much.\"</p>\n<p>\"<em>Not much</em>? Stiles, I swear—\"</p>\n<p>\"Oh crap, sorry dad, the light's green, I gotta—\" Stiles hangs up and limps back inside the warehouse. Ahh, the old 'pretend you're driving' hang up. Works every—works <em>most </em>of the time.</p>\n<p>\"So, we kill the unicorn,\" Jackson says, and Stiles looks at him to see he's taken his sunglasses off. That pisses him off for some reason. Everything is pissing him off for some reas—oh wait. Everything is pissing him off because there's a goddamned unicorn who wants to kill him. To death, even. \"How do we kill the unicorn?\"</p>\n<p>\"Deaton will know,\" Scott says. \"He'll find something. Eventually.\"</p>\n<p>Derek growls, because after the whole Gerard thing sophomore year, he dislikes the vet intensely. Well, more intensely. It probably didn't help that Lydia had dragged Stiles to Deaton <em>before</em> contacting Derek. That's probably why he's in a pissy mood.</p>\n<p>Stiles wants to snarl at him, suddenly, for no apparent reason. Stupid werewolf with his stupid face and his stupid abs and his stupid everything.</p>\n<p>He hates everyone. He hates <em>everything</em>. Especially the way Derek's eyes—his normal eyes, not the red he likes to flash when he wants to make someone feel emasculated—change fucking color in the light.</p>\n<p>\"Why don't you just have sex?\" Erica asks. Derek, for some reason, snarls at that. Probably because the idea of Stiles having sex is visually upsetting to him. Well, again, <em>fuck Derek</em>. And not in the good way, either.</p>\n<p>Stiles pretends to be interested, just to spite him. \"Like, hire an escort service, or something?\"</p>\n<p>\"Oh, come <em>on</em>, Stiles.\" Isaac laughs. \"You can't be this blind. This is like the perfect opportunity. Derek—\" He looks at Derek, and Stiles squints his eyes. They probably already have a bet going. They probably started it as soon as he called them from Deaton's.</p>\n<p>Assholes.</p>\n<p>\"<em>Isaac,</em>\" Derek growls, and he makes a face. Stiles has gotten really, amazingly, <em>scarily</em>, good at reading Derek's many faces. Mostly because he stares at him a lot. But also because it's kind of necessary when you're frenemies with someone who seems to think that conversations are terrible, horrible, no-good things that should be avoided at all costs. What's weird, though, is that he's never seen this expression before. Or, no. He has. Just never in this context. Because Derek looks… panicked. And usually he only looks panicked when he's running for his life. Or whenever there's wolfsbane involved.</p>\n<p>\"Oh, come on, Derek, everyone kn—\" Lydia starts, but she's interrupted when he just snarls. Stiles doesn't resist the temptation to roll his eyes. He has no idea what they're talking about, and, really? He doesn't care. Because he has bigger things to worry about. Like, you know, not dying. <em>Because he's a virgin</em>.</p>\n<p>\"I'm going,\" he says, because he should've known coming here would be useless. He should've just gone home right after Deaton's and started researching himself. As it is, he's wasted almost an hour having to deal with giggly betas and a snarly alpha. He makes to stand, but Scott grabs his arm.</p>\n<p>\"But, the uni—the monster?\"</p>\n<p>\"What about it?\" Stiles sighs. His phone beeps, and he gets it out of his pocket to see that Deaton has texted him – ever since the dude got an iPhone 5 he's been using Siri to text people instead of just calling them… it's gotten annoying, actually – to get him back to the vet's office. Well, that was fast.</p>\n<p>\"Won't it come after you?\"</p>\n<p>\"Probably not,\" Stiles says, sends a text back telling him he's on his way. When no one says anything, he looks up, and, yet again, they're all just staring, waiting for an answer. \"It didn't come out of the woods to chase Lydia and I before, so I'm guessing it has at least a semblance of self-preservation. It won't come into town. Plus, it's not like I'm the only virgin in Beacon Hills. Maybe it's distracted.\" The two dead bodies he and Lydia had been looking for before the unicorn turned on him—the same ones his dad and the police department had found—had been virgins. So it's not like the unicorn is only after him.</p>\n<p>He just happens to be part of the population it likes to murder for no apparent reason.</p>\n<p>\n<em>Yay.</em>\n</p>\n<p>Stiles seriously wonders why he's staying home for college. He's probably a secret masochist at heart, or something. He could have gone to… to <em>anywhere</em>. Hell, his SAT scores had only been fifty points behind Lydia, and <em>she </em>was going to Princeton.</p>\n<p>Then again, Stiles is going to Berkeley (early admittance, fuck yeah!), so it's not like he's missing out. It's just… he should dorm. Yeah, he should definitely dorm. It's only an hour away, but there's probably some sort of field surrounding Beacon Hills that makes it into supernatural central. He should get out of that field. Or next year he's going to go nuts and—</p>\n<p>All right, brain tangent. Back to the topic, Stilinski.</p>\n<p>\"I'll call you when I have some more info,\" he says, and then he sprints (or, well, limps) to his jeep.</p>\n<p>It takes ten minutes, because Stiles <em>always</em> (heh) obeys traffic laws, to get to Deaton's, and when he walks inside, he finds him sitting in his office, scrunching his nose up at a book that looks like someone accidentally dropped it in an open sewer. Smells like it too, actually.</p>\n<p>Huh. Maybe someone <em>did</em> drop it in an open sewer.</p>\n<p>\"That book smells like shit,\" he greets, and is rewarded with Deaton's version of the Disappointed Adult look.</p>\n<p>\"It's been in storage for over five years, Stiles,\" Deaton says. \"It got… depressed.\"</p>\n<p>\"The book.\"</p>\n<p>\"Yes. The book.\" Deaton smiles at him, that mysterious smile that Stiles has really come to hate. \"It's the only one that describes the creature you told me about, though, so I think we can both forgive it for smelling like… excrement. Don't you think?\"</p>\n<p>\"Yeah, I mean. Yeah, totally.\" Stiles nods, shoving his hands in his pockets. God, he's tired. At least it's Saturday so he's not expected at school in the morning. \"Nothing to apologize for.\"</p>\n<p>\"The unicorn that chased you seems to have gone rogue,\" Deaton says. Stiles looks around, sees a stool, and sits, because this is probably going to take a while.</p>\n<p>\"Okay. Rogue as in it's unusual for unicorns to be killing virgins, or—\"</p>\n<p>\"No, it's not unusual. Apparently most modern mythology has translated that part wrong.\" Deaton frowns. \"Even I didn't know about this.\"</p>\n<p>\"So… the unicorn…\"</p>\n<p>\"Unicorns kill… sporadically. One or two vir—individuals every couple of hundred years, in order to remain immortal -- \" Deaton frowns again, reads a portion of the book under his breath --  \"or, immortal-<em>like</em>. This one, though, has killed, what three already, you said?\"</p>\n<p>Stiles thinks back to three hours ago, when Lydia and him had found the bodies. Of course it had been them, and not one of the werewolves, even though it had been Derek who had told them to go search in the first place. Since, according to him, something didn't 'smell right.' Fucking werewolves and their fucking senses of smell.</p>\n<p>He remembers blood. Lots of blood. Faces slack and terrified. Eyes empty and lifeless. And the <em>smell</em>.</p>\n<p>Stiles hopes he never gets used to the smell of a dead body. Really, he doesn't.</p>\n<p>\"Yeah, there were three bodies,\" he says.</p>\n<p>\"Well, that's… not normal behavior.\" Deaton looks down at the book again, traces the lines of text – not English, from what Stiles can see – as he reads them. \"It's gone rogue, and it says here there are multiple instances of rogue unicorns. Usually when their mates have died, or their territory has been breach—\"</p>\n<p>\"… are we in it's territory? We've been her—\"</p>\n<p>\"No, unicorn territories are transient.\"</p>\n<p>\"So, they travel.\" Stiles is already confused. And they haven't even gotten to the part on how to kill it yet.</p>\n<p>\"Not like <em>we</em> do, Stiles. It's here because it's here, but it's rogue because—\"</p>\n<p>\"—it's rogue?\" Stiles finishes for him, grinning when he gives him a look. \"So, do we save it or kill it?\"</p>\n<p>\"There's no way to save a rogue unicorn,\" Deaton responds, after a bit, and sadly, \"you need to — you should put it down.\"</p>\n<p>Stiles waits a beat, but when there's no answer, he sighs. \"All right, <em>how</em>?\"</p>\n<p>\"There's no special way to do it. Or, at least, I haven't found one yet. This is highly unusual, Stiles. But, for now, I guess… you just… kill it.\" Deaton blinks at him.</p>\n<p>\"Like, kill it dead,\" Stiles says. Because he's really not sure he get it.</p>\n<p>\"Yes, Stiles. Kill it dead. But unicorns aren't easy to kill. They're fast. They're strong. They're <em>cunning</em>, Stiles. You all are going to have to work together for this—\"</p>\n<p>\"—we always work together.\" Stiles snorts. \"We're like the goddamned A-team. Except younger. And slightly less militant. And also we don't really get hire-\"</p>\n<p>\"Your brain is fascinating, Stiles, as always, but I'm serious.\" Deaton gives him his serious face to show how serious he is. Stiles sighs.</p>\n<p>\"All right, all right,\" he says. \"I'll tell them, and maybe we can start planning tomorrow. Can you, uh, translate that boo—oh, all right, already did it then. Have I mentioned you're awesome, lately?\" He takes the sheaf of papers Deaton hands him, the ones that had been resting on his desk underneath the book. It's not everything, just a bulleted list of stuff they need to know to kill the thing. The <em>unicorn</em>. It's not a lot, actually.</p>\n<p>Stiles is probably going to have to research, and he's realized, in the last, oh, six months or so, that he dislikes research intensely. Mostly because a large majority of the research he does centers around the supernatural, and leaves him with more questions (and more nightmares) then when he started out. He supposes it's useful in the long run, since by the time he starts college he's already going to be a <em>pro</em> at research, but still. He wishes that, you know, his life wasn't so exciting.</p>\n<p>Oh, who is he kidding. Stiles gets off on exciting. He just wishes the excitement would come in a slightly less sexually-embarassing and potentially life-threatening way.</p>\n<p>\"Those are just the basics – I didn't have time to translate the rest for you. I'll work on that.\" Deaton smiles. \"Maybe by the end of the week you can add it to that bestiary you have on your computer, all right? Along with whatever else you manage to find.\"</p>\n<p>Sometimes it's terrifying how well Deaton knows him. Most of the time. No, all of the time. The dude is an enigma. Stiles <em>hates</em> enigmas. He hates enigmas like he hates leather jackets and being thrown up against various flat surfaces.</p>\n<p>Well, he doesn't <em>hate</em> leather jackets. It's more like he holds a begrudging sort of respect for them.</p>\n<p>\"All right,\" he says, getting up off the stool. \"I'll look through this and, I'll, uh, keep you updated.\"</p>\n<p>\"Thank you.\" Deaton sounds genuine. \"I know Derek would prefer you did—\"</p>\n<p>\"Derek's a fuc—an idiot,\" Stiles interrupts, maybe a little too harshly. \"He should know you did what you did to get Gerard. And that… you didn't have anything to do with what Morrell did.\"</p>\n<p>A year ago, when the Alpha pack had finally been taken care of, Ms. Morrell had, for lack of a better phrase, gone batshit insane, and tried to run Stiles over with her car. Turns out she was with them – or, more specifically, with <em>one</em> of the alphas in a very twisted, strange, kinky relationship – and didn't take too kindly to when Stiles had set him on fire with a well-aimed Molotov cocktail.</p>\n<p>What? Molotov cocktails are Stiles' <em>thing</em>, okay? Well, one of his things. He has many things. Molotov cocktails being one of them.</p>\n<p>Anyway, Stiles had gotten away with a sprained wrist, a couple broken fingers, and a nice-looking gash on the side of his face that had connected with asphalt when he had jumped out of the way.</p>\n<p>That… that hadn't really been all that entertaining <em>or </em>exciting. Mostly just confusing and terrifying. And then Derek had gone and gotten all weird about it and suspected that Deaton was somehow involved. And <em>then</em> his dad had demanded to know what the hell was happening, and, well, that had led to a month long house-arrest. And <em>then</em> Derek had gotten even <em>weirder</em> about it and slept in Stiles' room for a week (the weird thing isn't that he slept in his room, no, it's that his dad had <em>let him</em>).</p>\n<p>Scott still swears his room smells like Derek, which makes Stiles ridiculously glad that he's human.</p>\n<p>\"—iles?\" Deaton's looking up at him.</p>\n<p>\"Oh, right, sorry.\" Stiles waves the papers in his hand. \"So, I'll get on this.\"</p>\n<p>\"Right, good luck,\" Deaton says, and turns back to his book, which Stiles takes as a dismissal and makes his way outside and to his jeep.</p>\n<p>When he gets home, he realizes that he's still bloody and bruised, so he uses ten minutes to take a shower and tend to the more stubborn injuries, and then gets dressed in his pajamas (which is really just an old pair of boxers and a Mets t-shirt his dad had almost <em>thrown away, </em>how dare he), even though it's only five in the afternoon.</p>\n<p>He's had a long day. Pajamas are allowed.</p>\n<p>He grabs his laptop from his room, stomps down to the kitchen, because, hey, he's alone, and he's going to be alone for the whole night, so he can stomp wherever he wants, and makes himself a very large, very complicated sandwich. He has every intention, really, of starting to research rabid murderous unicorns while he eats, but all he does is sit at the kitchen table and watch YouTube videos for an hour, almost snorting soda all over his screen every time they make him laugh.</p>\n<p>Which is a lot. Because Stiles is sometimes disgustingly simple to please. Especially when he's trying to get away from the disaster that is his reality.</p>\n<p>He only stops because his phone starts buzzing <em>constantly</em> fifty minutes in, and he can only ignore it for another ten before he's seriously contemplating throwing it against a hard surface. And that's not good, because his phone was expensive, and he shouldn't take his bad taste in friends out on an innocent piece of technology.</p>\n<p>So, he answers it, even though he has a rather large piece of bread in his mouth because he eats really slowly when he's distracted.</p>\n<p>\"Stiles,\" Derek says, \"where are you?\"</p>\n<p>\"Home.\" Stiles says, although it comes out more sounding more like 'hrrrgghh' because of the bread.</p>\n<p>\"Stiles? Wha-\" Derek pauses, sighs. \"Are you eating?\"</p>\n<p>\"Yes,\" he attempts. It comes out sounding more or less affirmative, because Derek sighs again, and then says something to someone he's with. Stiles is gonna guess…Scott, because he's clingy but also too lazy to get in a car and come here himself.</p>\n<p>\"Scott wants to know how it went,\" he says. Pssh. Stiles doesn't need werewolf asshole-hearing to know that's a lie. Derek is the nosiest of all of them. Or, well, <em>Stiles</em> is the nosiest of all of them, but Derek comes in a close second.</p>\n<p>\"Horribly,\" he says, and he swears he can <em>feel</em> Derek tense up at that, \"you may as well just enjoy me while you can, because I'm going to be dead inside of a week.\"</p>\n<p>Stiles hears Erica guffawing in the background, and he's pretty sure Lydia is yelling at him to stop fooling around.</p>\n<p>\"I. You. Wha—\" Derek growls. \"Stiles, we can't kill it if we don't know ho—\"</p>\n<p>\"Relax, Heathcliff.\" He shoves a pretzel in his mouth, makes sure to chew as loudly as possible. \"I went to Deaton's and got some stuff, but I haven't started researching yet. I'll call you when I find something. By—\"</p>\n<p>\"We're coming over,\" Derek says, like it's final. Stiles blanches.</p>\n<p>\"N-no!\" He really can't deal with them tonight. He might go crazy and punch someone. Probably Jackson, because for some reason Stiles punches Jackson a lot. Oh, wait. That's right. Stiles punches Jackson because he's a douche.</p>\n<p>\"Stiles, we're coming ov—\" Derek starts, and Stiles tries to think how to get his way. Sarcasm won't work in this situation; Derek is in protective Alpha mode. Lying won't work, for obvious reasons. Deflecting will <em>definitely</em> not work. So, it has to be honesty.</p>\n<p>\"Derek, just—\" He makes himself sound put out and tired, makes it so that Derek can <em>hear</em> the desperation in his voice. Hey, technically, he's not lying. But in the year and a half he's been doing this, he's come to realize that while werewolves can smell when someone's lying, they can't smell when that same someone is just…exaggerating. When they're <em>acting</em>. \"I really can't deal with everyone tonight, all right? I'm fine, I swear. I just…I'll research and I'll tell you what I find. But we can meet…tomorrow. How about that?\"</p>\n<p>There's a long pause on the other end. Stiles resists the temptation to shove another pretzel in his mouth, since it would take away from the whole effect of being morose and downtrodden. He swears he can <em>see</em> all them giving each other their patented \"oh poor human\" looks. He's fine with them thinking he's the poor human, as long as it gets him a good ten, maybe fifteen, hours of alone time.</p>\n<p>He realizes that this may seem immature and stupid of him, seeing that it would be in his best interest to take care of the unicorn as soon as possible, but Stiles doesn't give a shit about maturity. He does give a shit about staying sane, however, and he has found out the hard way that overwhelming yourself with the supernatural is a good way to go in the opposite direction.</p>\n<p>\"Fine, Stiles,\" Derek says, finally. \"You find out what you can, you tell us <em>immediately</em>, all right?\"</p>\n<p>\"Yeah, yeah, I mean, most of the stuff Deaton gave me talks about how hard it is to kill a unicorn, but I'm pretty sure they're not as hard as leprau—\"</p>\n<p>\"There's no spell?\" Someone asks in the background. Sounds like Danny.</p>\n<p>\"No,\" he says, thinks, fuck it, and shoves another pretzel in his mouth, \"just strategy and some sharp teeth. Maybe a set of claws. Or, hey, Lydia still has that can of pepper spray, rig- Ahh, I gotta go!\" He makes it sound like he's being interrupted, and hangs up before Derek or anyone else can catch on. Then he tosses his phone back on the table, and goes back to watching some crazy French dude doing parkour.</p>\n<p>Because if there's one thing Stiles is good at, it's ignoring a problem for as long as humanly possible.</p>\n<p>He eventually does get around to researching, but only after he's eaten the rest of his sandwich, and pretzels, then scrounged around until he found an unopened packet of red vines and eaten those too.</p>\n<p>The conclusion that he comes to, three hours after starting, is that unicorns are assholes. And that whoever started the whole myth about unicorns getting drawn to virgins in a decidedly <em>un-violent way </em>is an even bigger asshole.</p>\n<p>He knows he should probably call someone, now that he is officially the pack expert on unicorns (among about a million other different <em>theoretical</em> monsters), but he really doesn't feel like it. They're probably still hanging around the warehouse, or maybe Derek took his wolfy minions back to his apartment. Maybe he took everyone. Maybe they're all having a stupid party and drinking stupid beer that they don't get drunk off of and laughing at how stupid Stiles is for not putting out.</p>\n<p>Fuckers.</p>\n<p>Shit. It's not like Stiles is saving himself or anything. It's just he would rather have sex with someone who he can at least remember without flinching. And he doesn't really know why everyone around him thinks it's such a big <em>deal</em> he's a virgin. Most seventeen year olds <em>are</em>, regardless of what they want everyone else to think.</p>\n<p>Of course, most seventeen year olds don't live over a portal to hell, but whatever.</p>\n<p>Stiles has a point here, he thinks. Something about why he shouldn't be embarrassed about this. Something like—</p>\n<p>His phone rings, and he sighs.</p>\n<p>\"Der—\"</p>\n<p>\"I'm coming up.\" Derek doesn't even let him finish before he hangs up, and Stiles sighs again. So much for avoiding everyone until tomorrow.</p>\n<p>At least Derek had called. Although, well, that's not really new. Derek doesn't do the creep thing any more. Not with him. Not in his room. Not since he walked in on Stiles while he was naked, looking for a pair of clean(ish) boxer briefs.</p>\n<p>Stiles still wishes he had quick enough reflexes to have taken a picture of Derek's face, because while it had been a particularly mortifying experience, Derek's expression had been… <em>priceless</em>.</p>\n<p>He doesn't even bother getting up. His window isn't locked, and Derek will just—yup, there he is.</p>\n<p>\"Hey, Derek.\" He twirls his chair around.</p>\n<p>\"Hey,\" Derek says, looks around like he hasn't been in Stiles' bedroom thousands of times before. His hands rub at his jean pockets nervously, and Stiles sighs.</p>\n<p>\"I finished researching,\" he says, and Derek's face turns from vaguely uncomfortable to interested. \"Turns out we're going to have to get some cowboy lessons, becau—\"</p>\n<p>\"Show me.\" Derek walks over – <em>god</em>, how does someone even naturally walk like that – and bends down so he's level with Stiles, looking at the computer screen. A pause, and then. \"You're on… Reddit.\"</p>\n<p>\"… yeah, well, I finished researching. It's not like I go into hibernation until your werewolf ass needs me, Dere—\"</p>\n<p>\"Just tell me what you have.\" Ohh, exasperation, Stiles likes exasperation. He grins and shoves the papers Deaton had given him in Derek's face.</p>\n<p>\"That's what Deaton—\" There's a growl when he says Deaton's name, but Stiles chooses to ignore it. \"-- gave me. Just a bulleted list of the basics. Big. Strong. Evil. Scary. Likes to inhale virgin souls by goring them with their horns. Common in temperate climates. The usual—\"</p>\n<p>\"What about how to kill it?\" Derek walks over to plop down on his bed, his eyes skimming down the papers in his hands.</p>\n<p>\"Uh, with violence and a master plan?\" Stiles shrugs when Derek looks at him. \"I don't know, man. Deaton says you don't need magic, so we just have to… find it and put it down before it kills me for not putting out.\"</p>\n<p>\"… are you not telling me something?\" Derek tilts his head, glares at him, and Stiles deflates.</p>\n<p>\"It relies on olfactory memory,\" he says, hesitantly, because this is the part where Derek is going to—yup, there's the snarl, and, oh, yup, no more personal space. <em>Hello</em>, Derek stubble. Haven't seen you in… a couple of months, actually.</p>\n<p>\"Are you saying,\" Derek asks, glaring down at Stiles from where he has him caged in his chair, \"that it knows your <em>smell</em>, now?\"</p>\n<p>\"I am implying that, yes.\" Stiles nods. Derek growls and turns away, running his hands through his hair, and Stiles <em>does not like</em> the type of images that makes him think of.</p>\n<p>\"So, it's going to come after you.\" Derek turns back, hands still in his hair.</p>\n<p>\"Probably,\" Stiles concedes. Then he blinks. \"Oh. <em>Oh</em>. That's right—Derek, you're… you're brilliant!?\"</p>\n<p>\"… why is that a question? And what do you mean—\"</p>\n<p>\"Bait!\" Stiles holds his hands out like it's the most obvious thing in the world. Which it <em>is</em>. \"I can be bait! I'm great at being bait, Derek!\"</p>\n<p>\"We don't need bait, we just need to kill it,\" Derek snarls.</p>\n<p>\"Yeah, but to kill it we need to find it, and it's already gotten a good whiff of eau de Stilinski, so why not use tha-?\"</p>\n<p>\"No, Stiles. You need to stay sa—\" Derek cuts himself off, gets that pursed lip squinty look that means he's getting aggravated because <em>feelings</em>, and goes to sit back on his bed. \"How are your injuries?\"</p>\n<p>\"Huh?\" Stiles doesn't know why they've changed topics. He's pretty sure, though, that tomorrow he'll be able to convince the rest of the group that he makes <em>awesome</em> bait. And while Derek is still the alpha, he has no hope of winning against eight whining teenagers.</p>\n<p>\"Your injuries, Stiles,\" Derek says again.</p>\n<p>\"Fine…?\" Stiles looks down at his arms that are covered in small nicks and bruises. \"No mortal wounds, if that's what you're wondering. Although there's this bruise on my ribs that's going to hurt like hell come practice on Monday.\" He lifts his shirt to show it, mostly because he relishes the panic that flashes across Derek's face.</p>\n<p>\"It's fine, you really do—<em>fuck</em>, Stiles that looks bad.\" Derek's up again, squinting at the bruise like his Alpha vision is going to zap the pain away. Man, Stiles wishes that would happen. He could start calling him Laserwolf and then—</p>\n<p>\"Woah,\" he says, because now Derek is touching it. For a split second, he's caught up in the way his hand looks against Stiles' skin—tanned and dark against his, well, yeah, he'll call it fish belly white, even though he has fuckin<em>' abs </em>now, and there is <em>definitely</em> no belly there—and then Derek's veins start turning a sickly black, and the dull ache that he's been fine with up till now is disappearing. \"Dude, <em>stop</em>. That's not even necessary. It doesn't even <em>hurt</em>.\"</p>\n<p>\"It's helping, though, isn't it?\" Derek says, sounding on edge and a little (a lot) pissy. \"Just shut up for a second. I don't even know how you did this. Lydia was with you and she's not injured.\"</p>\n<p>\"Yeah, well, the raving virgin-hating unicorn wasn't after her, was it?\" Stiles leans back in his chair. \"I don't hear anyone saying, 'oh, hey, Stiles, great job on outrunning the mythical beast who wanted to run you through with it's large, thick, black <em>horn</em>… 'and <em>god</em> there are so many sexual innuendos I could be making right now with that.\" Stiles doesn't let himself grin when Derek lets out a bark of laughter. \"No, it's all, 'oh silly Stiles, fell down a hill and got himself banged up. <em>Such a klutz.</em>'\"</p>\n<p>\"I don't think tha—\" Derek looks up at him, eyebrows furrowed, and – woah, he's too close again, because Stiles has a front row seat to the way his eyes get all <em>intense</em> and <em>broody</em>.</p>\n<p>\"Yeah, yeah.\" Stiles looks down pointedly at Derek's hand, still splayed on his ribs. \"Are you feeling me up here, or-?\"</p>\n<p>\"… oh, right.\" Derek takes his hand away, and Stiles tries not to let his disappointment show too much as he pulls his shirt back down. Although, he's also kind of proud that he managed to not get a boner in the last five minutes. Or put off any noticeable arousal vibes.</p>\n<p>\"So, I'll e-mail you the rest of the stuff I found, and you can take those\"  -- he gestures at the papers on his bed --  \"back to your mancave. Sounds good? And we can meet at HQ at noon tomorrow.\"</p>\n<p>\"Eight,\" Derek says. Stiles groans.</p>\n<p>\"Come <em>on</em>, Dere—\"</p>\n<p>\"I'll see you at eight.\" Derek makes to walk towards his window, pauses right before he jumps out, and glares at Stiles. \"In the <em>morning</em>. Eight in the <em>morning</em>, Stiles.\"</p>\n<p>\"… <em>fine,</em>\" Stiles hisses, then gets an idea. \"I bet Lydia would be less homicidal if you got us coffee and doughnuts, though, for said meeti—\"</p>\n<p>\"Don't do anything stupid before then,\" Derek says, although he sounds more amused than frustrated, and then he's out the window.</p>\n<p>Stiles does not watch his ass as he climbs out. He <em>so</em> does not.</p>\n<p>He does, though, entertain the notion, but only for the briefest of moments, of what it would be like – it being sex, of course – with Derek. He gets flashes of hot. Hard. Wet. Raw. And then realizes he's drudging up things that should better be left denied and ignored and most definitely <em>repressed</em>, and goes back to Reddit.</p>\n<p>\n<strong> </strong>\n</p>\n<p>\"…it says here they can speak, on average, three hundred known languages?\" Danny says from where his head is buried in his iPad. Stiles, stretched out on the only sofa in the warehouse, ignores as the others grumble their general anger at the entire situation.</p>\n<p>\"Why are we even here, Hale?\" Jackson grouches, wrapped around Lydia on one of the wooden crates. \"We find it. We kill it. It's not like it's gonna take any team work. Not like we could actually work as a—\"</p>\n<p>\"Because it's already killed three people, and the sheriff is trusting us to take care of it.\" Derek sounds pissier than usual. Maybe he didn't get much sleep. Stiles didn't. Partly because he <em>swears</em> he kept hearing neighing below his window, and partly because he couldn't get the idea of Derek naked out of his head.</p>\n<p>He knows what Derek looks like shirtless – fuck, <em>everyone</em> knows what Derek looks like shirtless – the part that kept him up was imagining what's underneath those jeans. And that belt. Muscled thighs and calves and jutting hip bones. Dark hair and a co—</p>\n<p>Stiles remembers that he's in the middle of a bunch of werewolves, and stops before this gets even more embarrassing than it already is. Already, Derek is glaring at him with flared nostrils, and he's learned that Derek usually smells things about thirty seconds before the others do. So now's a good time to get distracted.</p>\n<p>Jumping up, he walks over to the crate that's serving as an impromptu table, and grabs himself another doughnut. Yum, jelly filled.</p>\n<p>\"Yo, get me an éclair, Stiles,\" Scott says. \"And do you know who Pliny is? This mentions him a lot.\"</p>\n<p>\"Wasn't he Roman?\" Lydia asks.</p>\n<p>\"Yeah.\" Stiles hands Scott his éclair, and takes a bite of his doughnut…and promptly gets jelly all over his hand. \"Roman. Wrote some book. Apparently he's the only one who's ever seen a <em>real</em> unicorn because that's pretty much what it looks like—<em>fuck</em>.\" He licks up the jelly, ignoring the snickers from around the room. They can all go fuck themselves. It's early. He's hungry. He's <em>allowed</em> to be clumsy.</p>\n<p>\"Will you…will you just use a <em>napkin</em>?\" Derek snarls, and Stiles glares mid-lick.</p>\n<p>\"No,\" he says, because if nothing, he will always have spite, and licks the rest off.</p>\n<p>\"Dude, it has a deer's head?\" Scott asks.</p>\n<p>\"Yes, yes it did.\" Stiles walks back to the sofa, only to see that Boyd and Erica have stolen it, and are currently wrapped around each other, looking behind him and laughing about something. He turns, sees Derek glaring at him, or maybe it's at them?</p>\n<p>\"Anyone in the mood for some horn jokes?\" he asks, and jumps up to sit next to Danny. \"I was thinking of some last nig—\"</p>\n<p>\"God, <em>no</em>.\" Jackson looks at in disgust. \"Why don't you just poke my eyes out?\"</p>\n<p>\"I could arrange that,\" Stiles says around a mouthful of doughnut, \"or I could just sneak some wolfsbane in your protein shake. Deaton's been teaching me how to mask the smell.\" He grins when Jackson visibly blanches. \"Or, hey, I could just punch you again. That's just the <em>most fun.\" </em></p>\n<p>\"You are seriously nuts sometimes, Stiles.\" Danny sighs, shoves the iPad in his face. \"And it says here the unicorn has you in it's sight—err, smells?\"</p>\n<p>\"Yeah, it does. And yes, I am.\" Stiles eats the rest of his doughnut. His hands are sticky, again, so he just starts licking the jelly off. God, he can practically <em>feel</em> the awkwardness around him. It's <em>glorious</em>. \"That reminds me! Bait!\"</p>\n<p>\"What? Jailbait?\" Danny looks at him, then looks at where Derek is pacing and muttering something to himself. \"I think, yeah, Stiles, maybe you should—\"</p>\n<p>\"Yes, Danny, Jailbait. I'm going to hire a prostitute.\" Stiles makes a face at him.</p>\n<p>\"Really?\" Scott scrunches his nose up. \"I don't think you really nee—\"</p>\n<p>\"No, you idiot, <em>actual</em> bait. For the unicorn. That has my scent? So you can catch it? And kill it?\"</p>\n<p>\"Oh, right.\" Scott nods.</p>\n<p>\"I'm for it,\" Jackson says.</p>\n<p>\"It's a good idea,\" Lydia agrees, begrudgingly.</p>\n<p>\"We don't need bait,\" Derek growls.</p>\n<p>\"Yeah we do,\" Boyd, ever the voice of reason, says. \"When you sent us out to look for it last night we couldn't smell <em>anything</em>. We need to find it before it kills again, and it's not like we have another willing virgin to act the part, so—\"</p>\n<p>\"Yeah, plus, Stiles is <em>awesome</em> at being the bait,\" Erica points out. As always with Erica, Stiles is not sure if that's a compliment or an insult. \"And it's not like,\" she adds in a strangely complacent voice, \"he's going to be in danger, Derek. You'll be there, right?\"</p>\n<p>Strangely enough, Derek suddenly looks more agreeable to the idea.</p>\n<p>Stiles narrows his eyes at him. \"Oh wow, when Erica says it, you get all agreeable, but when I said the exact same thing last night you gave me the constipated look?\"</p>\n<p>\"Last night?\" Lydia suddenly looks interested. \"You were together last night? I thought you—\"</p>\n<p>\"I went over for the research,\" Derek grunts.</p>\n<p>\"Oh, right,\" Isaac says. \"The <em>research</em>.\" He brings out the air quotes, and Stiles is suddenly confused.</p>\n<p>\"Am I missing something?\" he asks. \"Because I feel like I'm miss—\"</p>\n<p>\"Yes, you are.\" Erica nods. \"But let's talk about how we're going to throw you in front of a murderous unicorn, instead.\"</p>\n<p>The plan is…the plan is not much of a plan, actually. Mostly it's just wait until they either smell and/or hear about a gruesome death by goring, bring Stiles there to find and distract the unicorn, and then have the werewolves kill it.</p>\n<p>Unfortunately (or, fortunately, actually) all traces of the unicorn disappear, even with Derek and his pups out running the woods at night, and before Stiles knows it, or wants it, it's Thursday, and he's in the cafeteria, eating an apple because it's Taco Thursday and the last time Stiles participated in Taco Thursday he had diarrhea for a week.</p>\n<p>\"I think the AP English teacher is a vampire,\" he says to no one in particular, because no one is really paying him any attention. Lydia and Jackson are cooing at each other, as are Erica and Boyd. Danny is typing on his laptop, and Scott and Isaac are snorting about something across from him. He sighs, chews a bit, then continues. \"She keeps looking at my neck like she wants to bite it.\"</p>\n<p>A couple of freshmen walking past their table give him strange looks, and he smiles and waves until they scurry off.</p>\n<p>\"She's not the only one,\" Erica mutters, then feeds Boyd a carrot stick. Stiles wonders whether he should respond, but just decides to get up and walk away, because sitting at a table with two couples and the epic bromance that is the friendship between Scott and Isaac is a form of torture. Really, it is. Plus he's got an AP calculus quiz tomorrow and he has yet to study.</p>\n<p>He passes Allison on the way out, sitting at one of the corner tables with her group of friends, and she offers him a wide smile. He smiles back, of course, but it's just…awkward. Every time he looks at her he sees Gerard, and every time he sees Gerard he feels the way the man's fist had felt against his face and his ribs and…yeah, it's just awkward.</p>\n<p>He's in the hallway when he feels his phone vibrate, checks to make sure there are no adults nearby, then answers.</p>\n<p>\"Stiles.\" His dad sounds relieved. Which usually means something horrible has happened. \"Where are—\"</p>\n<p>\"They found another body?\" he asks. \"Where? I'll tell Derek and them—\"</p>\n<p>\"Twenty miles north of here, and another one ten miles from the Hale property. I would've thought Derek—\"</p>\n<p>\"I'll call and check,\" Stiles says, then sees Mr. Harris turning the corner. \"Crap, there's a teacher. I'll see you…tonight?\"</p>\n<p>\"I don't know, son. Maybe tomorrow morning.\"</p>\n<p>Stiles sighs. \"Yeah, cool. I'll be fine, dad. Just…be careful.\"</p>\n<p>He hangs up, passes Harris, who gives him a look, and then sprints outside to call Derek.</p>\n<p>\"Derek,\" he says, as soon as the idiot answers, \"dad found two more bodies. One of them is ten miles north of your house.\"</p>\n<p>There's a pause. \"Where are you?\"</p>\n<p>\"School, I can skip my last two periods, though,\" he says. \"I'll call the others and get them to meet us at the house?\"</p>\n<p>\"…I'll come pick you up.\"</p>\n<p>\"Dude, I have my jeep, I'll be fi—\"</p>\n<p>\"I'm in town. I'll pick you up.\"</p>\n<p>Stiles grits his teeth. \"<em>No</em>, I'll meet you at your house, Derek.\"</p>\n<p>There's a snarl on the other end, but Stiles ignores it and hangs up, sending a mass text to the others as he jogs to the jeep. Excitement, he thinks. Entertainment. Just…treat it like that until it's over, and then you can have your little anxiety attack.</p>\n<p>In the privacy of your own room.</p>\n<p>Without anyone there to look at you like you're made of glass.</p>\n<p>Right, okay.</p>\n<p>Anti-pep talk done with, he unlocks the driver side door, flings his bag in the back seat, straps his seat belt on, and is out of the school parking lot before any of the security guards can stop him.</p>\n<p>It's ten minutes later, just as he's turning down the long road that leads to the <em>other</em> long road that leads to the Hale house, that something large, angry, and supernatural rams into the passenger side door.</p>\n<p>He wakes up, and the jeep is rocking from side to side. For a second, he doesn't know who he is, why he is, or, man, <em>how</em> he is, and then everything comes rushing back, along with a headache and a variety of other aches and pains all over his body.</p>\n<p>His steering wheel is bloody, so he guesses that he probably bashed his head against it, which explains the headache. His seat belt is digging into his chest and waist, and it <em>hurts</em>. There's blood in his mouth, and did he mention that the jeep is rocking from side to side?</p>\n<p>It is, because there's a horn – long, black, thick, and fucking pointy as hell - stuck in his passenger side door, and the unicorn it belongs to is roaring as it struggles to get free. He tries to scramble back, limbs flailing everywhere and a very manly squeak coming from his general mouth area, only to be held down by his seat belt. It takes about five million years, because his breath is shallow and everything <em>hurts</em> and his fingers are trembling, to get free, but when he does he opens his door and promptly falls to the hard ground below.</p>\n<p>He's still on the road, but his jeep is at an angle, and one of the tires – on the passenger side – is flat. He tries to think, eyes locked on the unicorn that has now <em>seen him</em>, then remembers that his phone – his glorious, glorious phone – is in his pocket.</p>\n<p>His thumbs aren't really working, neither are his other fingers (he thinks his left pointer finger is broken, because it's big and swollen and is bent at an odd angle), so all he can do is press the re-dial button, and—</p>\n<p>\"Stiles, what do you—\"</p>\n<p>\"Derek,\" he tries to say, but it comes out slurred and breathy and a bit squeaky. Damn it. He's never going to live this down, is he? \"Unicorn. It's here. Stuck in—oh <em>fuck</em>. Oh fuck. <em>Crap.</em>\"</p>\n<p>It got out, oh god oh god, it's out. He watches, frozen, as it shakes itself off, glaring at the jeep with black eyes that <em>burn</em>. It's weird, to describe black eyes as burning, but they are. They do. Burn that is. And it's terrifying. There's a voice yelling from his phone, but he can't really be bothered to understand it over the sound of his own frantic heartbeat.</p>\n<p>And then the beast – it really just takes away from the horror of the situation if Stiles refers to it as a unicorn in his head – sees him, and freezes.</p>\n<p>He scrambles to his feet, and, oh, yup, ankle is <em>definitely </em>twisted.</p>\n<p>It sniffs at the air, shaking it's mane out and clacking it's elephant hooves against the asphalt underneath, once, twice, three times. Something that sounds like a mix between a whinny and a snarl comes out of it's mouth, and then it's charging, and Stiles is running.</p>\n<p>He's not running away – hell no, it would catch him in a second, and he <em>does not</em> want to die a virgin, thank you very much – he's running towards his jeep, and dropping to his stomach, and rolling under to grip at the whatever he can get a good grip on. Someone will come to help him. Someone has to come.</p>\n<p>This time. Someone will come.</p>\n<p>And maybe this is him acting the part of the bait. It's just…a bit more improvised than he would've liked it, a bit less safe. But if it ends with a dead unicorn and a calm, boring weekend, he's fine with it.</p>\n<p>As long as someone fucking gets here and just saves his ass, already.</p>\n<p>Because it knows where he is, and it's knocking his jeep around (which is <em>rude</em>, really, because the jeep never did anything to it) and bending down to snort hot, stinky, <em>acrid</em>, air in his face, and nipping at the air, and he <em>really</em> just wants it gone—</p>\n<p>He curses, and, okay, yeah, he might be panicking a bit as well, but seriously, he's just been in a car accident and is currently hiding under said car to avoid being <em>impaled</em>, and grips harder onto what is probably a very important part of the jeep. He should really start learning auto mechanics. At least so when he's forced to hide under one he can label what he's holding onto.</p>\n<p>As the unicorn butts against the side over and over again, the jeep slides, and he slides with it. His vision gets spotty, and he really just wi—</p>\n<p>Something roars, and it's not the unicorn.</p>\n<p>He knows it's not the unicorn because it comes from up the road. And he's heard that roar enough now to recognize it as well as he can recognize his own squeak of relief.</p>\n<p>Fucking <em>finally</em>.</p>\n<p>There's another roar, and then a howl, and then a hiss, and then the unicorn is, <em>fuck</em>, running away, and everything is suddenly very silent.</p>\n<p>Stiles can hear himself wheezing. He can hear his heart beating loud and frantic and far too fast. He feels the vibration of running hooves, and then paws, and then the sound of someone calling – yelling, screaming - his name. Slowly, he lets go of whatever it is he was holding, only to gag when he sees bits of his own skin still hanging there as he does so.</p>\n<p>Some part of his mind knows that should hurt. Some part of his mind knows that he has at least second degree burns on his hands from hanging onto a hot car part. Some part of his mind knows that he's in shock, and should really crawl out from under the jeep so he can get some medical attention.</p>\n<p>At least from Dr. Deaton.</p>\n<p>Maybe the dude will give him horse morphine or something. He's seen it—the horse morphine – in his medicine cabinet. Closet. Room. Whatever. He's pretty sure it would knock him out for a good two days.</p>\n<p>And right about now that sounds <em>awesome</em>.</p>\n<p>\"Stiles!\" Erica? Lydia? It's a girl's voice, he knows that much.</p>\n<p>\"I'm good, I'm good,\" he says, the words slow and awkward in his mouth. He tries to move, then realizes, when he tries and everything hurts, that he really doesn't want to. \"could you just grab my ankle – <em>fuck not that one!\" </em></p>\n<p>It's Erica, because he's suddenly surrounded by blonde hair and leather. She's holding him in her lap, which is nice, and yelling something.</p>\n<p>\"<em>God</em>, stop yelling,\" he says, and his voice is still slurred, but much better now that he can breathe easy. Well, breathe <em>easier</em>. \"Up. Please. The others?\"</p>\n<p>\"Scott and Boyd are with Derek, after that <em>thing,</em>\" Erica snarls, wraps her arms around him and pulls him up. He looks around and sees Isaac on the other side of the jeep, inspecting the hole in his door.</p>\n<p>\"Apparently,\" he says. \"It's dangerous to drive while virgin.\"</p>\n<p>\"You have a concussion or something, right?\" Erica is pawing at him, her nose scrunched as if she can <em>smell</em> whether he's okay or not. Actually, she probably can.</p>\n<p>\"Are we going to Deaton's?\" he asks. \"I want some morphine.\"</p>\n<p>\"Yeah,\" she says, turns to Isaac. \"you want to go with us or go find Derek?\"</p>\n<p>\"…I'm going with you.\" Isaac grins, lopes over to grab at Stiles, until his arms are stretched over both their shoulders and he's limping with his good leg.</p>\n<p>\"You smell burnt, Batman,\" Erica murmurs, and Stiles cringes. He knows he's in bad shape, because Erica only calls him Batman when he's at least got a sprain or two. Crap.</p>\n<p>\"Hands.\" He gasps when they dump him in the back seat of…oh, Jackson's Porsche. Nice. Leather seats. <em>Comfortable</em>. Well, relatively, considering everything fucking <em>hurts</em>. \"I grabbed onto… something hot.\"</p>\n<p>The next time someone speaks is when Isaac opens the door again, and Stiles thinks, for a moment, that he's going to throw him out, or something, then he sees Deaton, and grunts his hello. So, blackouts. Those are always a good sign.</p>\n<p>He's carried in to one of the exam rooms, and then Erica and Issac are shooed out while Deaton does…stuff.</p>\n<p>Painful stuff. Like setting broken bones stuff. And cleaning out scrapes and burns stuff.</p>\n<p>He lets his mind wander.</p>\n<p>His dad is probably going to find out about this. And he's going to be disappointed. Stiles wonders if he'll let him have a sip of his whiskey when he starts drinking it again.</p>\n<p>Derek is never going to let him drive his car alone again. Hell, <em>dad</em> is probably never going to let him drive his car <em>at all</em>.</p>\n<p>He hopes he'll still be able to take the AP calculus quiz tomorrow. Maybe he can write his answers with his mouth. People do that. Write with their mouths. He could try.</p>\n<p>He wonders how he can turn this into a joke. Like, oh, is that a horn or are you just happy to see me? No, too obvious. Ugh, he's way too tired to think of jokes, why is he even tryi—oh, Derek.</p>\n<p>\"Yo, Derek.\" Stiles isn't too surprised that he blacked out again. It must be something other than a concussion that's making him do it, though, because he's pretty sure you're not allowed to let concussed patients sleep. \"You kill it?\"</p>\n<p>\"No,\" he growls from where he's standing over him.</p>\n<p>\"Fuck,\" Stiles says, then looks at Derek, sighs, and makes to pat his arm until he sees that his hands are bandaged. Blegh.</p>\n<p>\"You should've waited for me,\" Derek growls a little bit later. Maybe a minute? Maybe an hour? Stiles isn't so good with the time thing right now. He makes a face, goes to sit up, only to be waylaid by an apparent complete and utter lack of upper body strength. Or, well, Derek's hand on his chest. Huh, his bare chest. So, no shirt. Okay, then. He looks at it, looks up at Derek, looks at it again…</p>\n<p>\"Uh, can I sit up, or…?\" he asks.</p>\n<p>\"Your ribs are bruised.\" Derek glares at him.</p>\n<p>\"That's…a no?\" Stiles guesses, keeps trying to sit up anyway.</p>\n<p>\"Your ankle is sprained. Your finger is broken. Your hands are <em>burnt</em>, Stiles.\" Derek keeps glaring at him, but helps him sit up anyway. Sitting is actually better. Yeah, it hurts more. But now Stiles doesn't feel like an invalid. Or, he doesn't feel like <em>as much of</em> an invalid as he did lying down. Yeah. \"I called the sheriff and told him you're staying at the apartment tonight.\"</p>\n<p>\"Wha—<em>why</em>?\" Stiles wants to go <em>home</em>. Not to Derek's stupid-ass apartment that he shares with Isaac. \"Can't I stay with Sco-?\"</p>\n<p>\"Scott agrees that you should stay at the apartment.\" Derek pauses. \"Or should we call the sheriff and tell him that you totaled the jeep. <em>Again</em>.\"</p>\n<p>\"…he's gonna find out anyway,\" Stiles grumbles, looks down to see that someone – Deaton,<em> please say it was Deaton</em> – had removed his jeans too. So now he's in his boxers, and his ankle is wrapped up, and so is his knee? Huh, must've banged it against something. <em>God</em>, Stiles is glad he's on painkillers. Or else his semi-nakedness would be a little more embarrassing. Everything would also hurt more, of course. Which is the real reason he's glad he's on painkillers…yeah.</p>\n<p>His torso is black and blue, and the areas that the seat belt had dug into are an angry red. Plus there's the scrapes. And the nicks. And the achy heaviness everywhere. Blegh. Stiles doesn't want to know what his face looks like. He really doesn't.</p>\n<p>\"Any clothes I could—great.\" Stiles makes to grab the shirt Derek holds out – it's black, and it's large, so it must be his – only to realize his hands are pretty much useless. Or, well, no. He can figure it out. \"Where are the others?\"</p>\n<p>He uses both hands to take the shirt, holding it between them like a panda or something, and it would be funny, really, if it wasn't him.</p>\n<p>\"Searching. They'll meet us back at the apartment tonight.\" Derek growls and pulls the shirt back. \"Hold your arms up.\"</p>\n<p>Stiles does, too surprised to actually say anything, and then the shirt is over his arms, and his head, and then his chest. He flinches, but only a little, when Derek accidentally hits his knuckles over one of the more tender bruises, but other than that, he feels pretty good. Probably because he's at least somewhat dressed now.</p>\n<p>\"So,\" he says. \"Why're you here? Shouldn't you be out searching for Horny?\"</p>\n<p>\"Horny? Really?\" Derek makes a face. \"We're giving it names now? Can you get up, or—?\"</p>\n<p>\"I think?\" Stiles looks at the floor dubiously, starts sliding himself off, only to squeak when Derek puts his hands under his biceps and pulls. \"Ow! Fuck, dude. Be gentle…\"</p>\n<p>\"Sorry, sorry,\" Derek grumbles. \"Hor— the unicorn stomped on my leg, so—\"</p>\n<p>\"That's why you're on Stiles duty?\" Stiles glances down at Derek's leg, which seems fine. Fucking werewolves. \"Lucky you.\"</p>\n<p>\"Yeah yeah, come on.\" He pulls him forward again, but, thankfully, a little less abruptly this time, and Stiles manages to put half his weight on his good leg, before slinging his arm over Derek's shoulders.</p>\n<p>\"Well, fuck,\" Stiles says. \"This sucks.\"</p>\n<p>\"I could just carry yo—\"</p>\n<p>\"<em>No.</em>\" Stiles glares at him, although when he turns his head their faces are a little too close, so he can't really glare for <em>too long</em>, or he'll start noticing the length of Derek's eyelashes, or the sharp contrast of his cheekbones, or the way his lips are—yup, see, he'll start doing that.</p>\n<p>\"You—\" Derek suddenly growls, and Stiles looks to see him staring at him squinty-eyed. It's not a glare so much as an…intense look.</p>\n<p>\"Yes, me.\" Stiles pushes Derek forward. \"Come on, I want to get horizontal on a comfy surface as soon as possible.\"</p>\n<p>\"That—\" Derek sounds like he's getting strangled, and Stiles raises his eyebrows at him. Maybe he's worried about Stiles taking his bed or something?</p>\n<p>\"Don't worry, dude, I'll sleep on your couch. Or maybe you could sleep with Isaac and I could sleep in his bed? Or, wait --\" Stiles shifts to a position that makes it easier to bear weight on his sprained ankle. \"-- weren't you guys talking about getting an inflatable mattress, or something? A couple months ago? Back when Erica kept—\"</p>\n<p>\"Sti—\"</p>\n<p>\"Could we at least stop by my house and get a change of clothes or something? So I don't have to walk around in boxers?\"</p>\n<p>Derek sighs. \"…I'll tell Scott to pick up something at your house.\" He says, and then they're outside, and Derek is easing him into the passenger seat. He eyes the seat belt suspiciously while Derek walks around to the driver's side.</p>\n<p>\"Are you planning on any sudden stops?\" he asks when he's seated, and Derek gives him a look. \"I'm not really feeling the seat belt thing right now, so…\"</p>\n<p>\"It's a five minute drive through town. Put your seat belt on,\" Derek growls, and, kind of surprised, Stiles does.</p>\n<p>\"Oh my <em>god</em>,\" Stiles moans. \"Your bed is <em>amazing</em>.\"</p>\n<p>\"Shut up,\" Derek says, but it's more of a sigh. \"And go to sleep, Stiles\"</p>\n<p>\"It's not like I could get up if I tried,\" Stiles grumbles. \"What with the <em>sprained ankle</em>. Ya know, I always thought I'd get a sprained ankle from lacrosse or something. But no, I got it running from a unicorn. A unicorn that wants to kill me because I ha—\"</p>\n<p>\"We're going to kill it,\" Derek growls, \"and it won't be a problem any more.\"</p>\n<p>\"Maybe I should have sex, though.\" Stiles is pretty sure this is because of the mix of Adderall and whatever Dr. Deaton gave him in his system. Or maybe it's just him. Stiles is really never sure.</p>\n<p>\"You can barely walk,\" Derek growls. \"How the hell do you expect-?\"</p>\n<p>\"I don't know,\" Stiles sighs. \"It's not like I need to walk to have sex, right? I could just call someone. An escort service, or something. I could probably do it tomorrow. It's not like I need it to—\"</p>\n<p>\"No,\" Derek says, and there's something in his voice – it's not anger, or the Alpha growl, it's not disgust, or amusement…it's something different, something that makes Stiles thinks he knows what he's talking about. \"You shouldn't—you'll regret it. You stay here until we kill it. No magic; no baiting. We find it, we rip its throat out.\"</p>\n<p>\"…because all of our plans go <em>so well</em>, Derek.\" Stiles gives him a look, only a little bit surprised when Derek visibly deflates.</p>\n<p>There's silence, very awkward silence that Stiles doesn't know what to do with, so he's about to start talking again, when Derek just up and walks out, closing the bedroom door behind him.</p>\n<p>He's kind of glad, actually, that Derek gave him his bed. Actually, really glad, because Stiles was not looking forward to sleeping on the sofa. It's lumpy. And smelly.</p>\n<p>It's nice that he did. Let Stiles sleep on his bed, that is. But Derek is, underneath all that grime and stubble, a surprisingly nice guy. It only took a year for him to get the hang of the whole Alpha deal, and now it's like he's almost…healing.</p>\n<p>Healing from the marathon of increasingly horrible circumstances Derek has had to deal with. Stiles doesn't think he could've survived what Derek did. His entire family <em>gone</em>. Killed by self-proclaimed vigilantes. Or, no. Killed by Kate. Kate who was-<em>oh</em>. Oh. That's why Derek sounded like he knew what he was talking about.</p>\n<p>Because he and Kate. Kate and him. They had-</p>\n<p>Stiles is suddenly <em>angry</em>. If Kate wasn't already dead, he would seriously consider at least injuring her. Because sleeping with someone to get to their family? That's just fucked up in every possible way.</p>\n<p>And, <em>god</em>, Derek had just been a kid. Younger than him. A year younger…</p>\n<p>He scrunches his nose, because suddenly he wants to know what sixteen year old Derek looked like. Would he have been lanky? Or do werewolves have six packs from birth? Would his back muscles ripple every ti—</p>\n<p>\"Go to <em>sleep</em>, Stiles!\" Derek yells from somewhere, and Stiles is <em>really </em>glad that werewolves don't read minds. Because <em>awkward</em>.</p>\n<p>What would Derek do, he thinks, if he knew that Stiles sometimes jerked off to him? Probably growl. Actually, that's kind of ho—</p>\n<p>\"I swear to fuc—\"</p>\n<p>\"Sleeping, sleeping!\" Stiles yells. \"Shit, you leave a seventeen year old dude alone, Derek. What do you expect?!\"</p>\n<p>\"Sleep!\" And it sounds like Derek is going to start crying any second now. Or come in and rip him into shreds. Although the dude tolerates him now, so Stiles at least <em>hopes</em> he would think twice before doing that…</p>\n<p>He does go to sleep, eventually, but he dreams about his face getting smashed to bits under elephant hooves, and his intestines ripped out by a long horn, and he wakes up to Scott shaking his shoulder.</p>\n<p>\"Stiles, you look like shit, dude,\" Scott greets, and Stiles grins.</p>\n<p>\"Fuck you, Scott,\" he says fondly. \"Fuck you sideways.\"</p>\n<p>\"You know I like girls, Stiles. Try Derek, though. I'm sure he wouldn—hey!\" Scott laughs when Stiles kicks him. Or, kicks <em>at</em> him. He misses, sadly. \"Can you get up?\"</p>\n<p>\"Depends on how long I've been asleep,\" Stiles decides.</p>\n<p>\"Uh, a couple of hours I'm guessing? I don't know. Lydia wanted me to make sure you were alive.\"</p>\n<p>\"Fine, fine.\" Stiles lets Scott manhandle him into a stand. Well, more of a slouch, really. He actually feels much better, surprisingly. Okay, not so surprisingly. Sleep, even horrible sleep with nightmares and probably a ridiculous amount of flailing, works wonders for injuries. Stiles is less achy, even though the painkiller has since worn off and every move jolts about a dozen or so bruises. And he's less panicked about almost being gored.</p>\n<p>Of course, maybe he <em>should</em> still be panicked about almost being gored. By a unicorn. A normal person with a normal life would still be panicking.</p>\n<p>He sighs, and lets Scott lead him out of the room and down the hallway.</p>\n<p>\"You look like shit,\" Jackson says from one of the chairs in the living room. He sounds positively gleeful. Fucker.</p>\n<p>\"Wolfsbane, Jackson,\" Stiles growls. \"I'll sprinkle it in that cream shit you spread on your face when you think no one's looking.\"</p>\n<p>\"I love it when you growl, Stiles,\" Erica says, sitting on the floor by Boyd. Now that he can see them, they're all muddy and dirty and sweaty. \"Makes it easier to see why De—\"</p>\n<p>\"We didn't find it,\" Isaac suddenly interrupts, and Stiles catches him eyeing Derek, who is, actually, eyeing Erica from where he's leaning up against the kitchen counter. Sometimes Stiles really think he's…missing something. \"It sprinted all the way to the next valley over and then just…disappeared.\"</p>\n<p>\"So,\" Stiles pushes Scott away when he starts getting to handsy, lowers himself to the sofa – still lumpy and uncomfortable, but whatever – and glances at where Danny is doing something on his laptop before continuing. \"either you all suck at being werewolves, or we're missing something about unicorns.\"</p>\n<p>\"Deaton said he's still looking at his other resources,\" Scott says, plopping down beside him, \"something about not being sure we've got all the necessary information?\"</p>\n<p>\"…he's been looking since <em>Saturday,</em>\" Stiles groans. \"<em>I've</em> been looking since Saturday. What's there to know? Is it something to do with the people it targets? Or maybe how it—oh, maybe how it moves?\"</p>\n<p>\"What do you mean 'the people it targets?'\" Lydia frowns at him. \"There is something—all of you are virgins.\"</p>\n<p>\"No, <em>something else</em>.\" Stiles waves his hands around. It's actually more expressive with the bandages wrapped around them. Like he's wearing gloves. \"Like, something serial killer-ish. Something like 5'11 and brunette, or—\"</p>\n<p>\"Have you asked your dad?\" Danny asks. Stiles winces.</p>\n<p>\"No?\" He says, because the last thing he wants to do is tell his dad any more details about <em>this</em> particular situation.</p>\n<p>\"Hey, he'll probably be happy you're still a virgin, Stiles.\" Erica shrugs. \"And you won't even have to mention that you're only not <em>technically </em>a virgin.\"</p>\n<p>Everyone has a good snicker at that, except Derek, of course, who frowns, and Stiles, who glares.</p>\n<p>\"Very funny,\" Stiles leans back a little into the sofa seat. \"I'll ask my dad tomorrow whether he's found any connections between the victims. And then I'll go to Deaton's to — \"</p>\n<p>\"— why don't <em>I</em> ask Deaton?\" Scott says, suddenly, his voice doing that 'I'm a hero here to take care of you' thing it likes to do. \"Since I <em>work</em> there, Stiles. And Derek can go to your dad. You're not in this alone, you know.\"</p>\n<p>\"… I love it when you get emotional.\" Stiles sniffs, nuzzles into Scott's side until everyone is laughing and Scott starts pushing him away. \"It makes you so attractive. Can we make out? Seriously, this time. Just one kiss…\"</p>\n<p>\"… So how likely is it that unicorns can teleport?\" Stiles asks Derek, three hours later, when everyone is either asleep or watching late night infomercials or, in his case, leaning up against the kitchen counter and eating nutella with a spoon.</p>\n<p>Derek, leaning across from him, his arms crossed and his expression pained, raises an eyebrow.</p>\n<p>\"I was just thinking, that since you guys keep losing the scent… nothing else makes sense, you know?\" Stiles sighs, puts the nutella on the counter. \"Maybe it has a nest somewhere. Or a cave. Or…some evil lair. And it's coming here to kill, and then, when it senses dang—\"</p>\n<p>\"Isn't it rogue? As in crazy?\" Derek says after a bit. \"If it is, it's running on instinct now, and—\"</p>\n<p>\"And maybe instinct is telling it not to kill things in it's own backyard.\" Stiles shrugs. \"I kind of feel like it would be easier to trap the thing if we knew <em>more</em>. All we know is that it's—\"</p>\n<p>\"— we know it wants to kill you. We know it has your scent. We know it's fast -- faster than any werewolf.\" Derek snarls, but the anger isn't directed at Stiles, which is always good. \"Maybe it's smarter than the typical horse, but it's an animal. We need to stop <em>waiting</em> and go out and <em>hunt</em> it.\"</p>\n<p>\"...hunt it, huh?\" Stiles says, and then… \"Holy <em>fuck</em>, Derek. We… shit.\" Stiles deflates, then steels himself, because Derek is looking at him expectantly.</p>\n<p>\"Yeah?\" he says.</p>\n<p>Stiles grimaces. \"We <em>know</em> hunters.\"</p>\n<p>It takes Derek a second, but when he gets it, he snarls, and takes a step towards Stiles. \"<em>No.\"</em></p>\n<p>\"Hear me out, Dere—\"</p>\n<p>\"<em>We're</em> hunters, too, Stiles.\" Derek cuts him off. \"We're better than <em>them</em>!\"</p>\n<p>\"Hey, I totally agree, you're better than them in <em>all </em>ways, but they might know someth—\"</p>\n<p>\"<em>Deaton</em> didn't even know, Stiles,\" Derek growls. \"Why the hell would the <em>Argents</em> know anything?\"</p>\n<p>\"<em>I don't know</em>, Derek, maybe because they hunt supernatural creatures for a living?\" Stiles looks back at the living room, where everyone else is trying way too hard to not pay attention to them. It's sad, really, that he doesn't even need to be a werewolf to know they're eavesdropping the hell out of their little conversation. Or argument.</p>\n<p>Stiles kind of secretly loves that he gets to argue with Derek. He hopes no one figures it out, because there would be no end to the teasing. <em>No end</em>.</p>\n<p>\"If they knew about it, they would've already dealt with it, Stiles,\" Derek says, and, yup, there he is, taking another step closer. Stiles is glad he's not up against a wall, because Derek would probably cage him against it or something.</p>\n<p>Actually, he hasn't been slammed up against a wall in a while. Kind of misses it, now that he's on the subject.</p>\n<p>\"Maybe they don't know about it.\" Stiles shrugs. \"We really haven't talked with them since the Alpha pack, and even then it was kind of limited. Maybe they're taking a step back…\" He sees that Derek is going to interrupt him, flails around a bit to distract him (it's crazy, but it actually works), and continues. \"but that doesn't mean that they don't have some creepy hunter network thing that may <em>help us</em>. Deaton's been looking at the books for almost a week, and the dude's found nothing.\"</p>\n<p>\"I trust Deaton more than I trust the Argents, and I don't trust Deaton at all,\" Derek growls.</p>\n<p>\"Aww, look at you, king of one liners.\" Stiles grins. \"We all know you have trust issues, Derek. And, believe me, I don't trust the Argents as far as I can throw them, and, yeah, sure, I've got some muscles goin' on now, but I still am sure I could not throw a human body <em>that</em> far.\" Stiles pauses, tries to remember where he was going. He can't, so he sighs, and changes tactics. \"All right, compromise. You talk to my dad – don't mention my jeep or anything, all right, please? – and Scott will talk to Deaton. And if you find something, then there's no <em>need</em> to go to the Argents. But if you don't, I go.\"</p>\n<p>\"No.\"</p>\n<p>\"I'm being reasonable here, Derek,\" Stiles sighs. \"And you're being stupid.\"</p>\n<p>\"Why the hell do you want to go to the Argents so much?\" Derek hisses. \"Gerard <em>kidnapped</em> you. He <em>beat</em>you. His daughter—\"</p>\n<p>\"The whole family is screwed, Derek,\" Stiles points out. \"I mean, even Chris threw me up against a wall that one time—\" he realizes that's the wrong thing to say when Derek snarls and comes even closer. \"But, <em>but</em>, Derek, it's better that I go because one, I'm a good talker, and two, they owe me.\"</p>\n<p>\"Owe you?\"</p>\n<p>\"For when Gerard kidnapped me and beat me up. Guilt is an amazing thing, Derek.\" Stiles grins. \"I'll even let you come along and hide in the bushes, so if they turn out to still be crazy and try to electrocute me or something you can save my sorry ass. All right?\"</p>\n<p>\"I don't li—\"</p>\n<p>\"<em>Or</em> I could just wait until you're at my house to sneak out and talk to them anyway.\" Stiles looks down at his bandaged hands as innocently as possible.</p>\n<p>\"You wouldn't—\"</p>\n<p>\"You know that's exactly what I'll do.\" Stiles looks up, crosses his arms, then uncrosses them and picks up the jar of nutella again. \"You should go grocery shopping, by the way. All you have in your fridge is nutella and lettuce. And who the hell puts nutella in the fridge, is what I'm really worried about.\"</p>\n<p>He hears someone snickering from the living room sofa, but that just might be the infomercial on the T.V. He glances, sees a blonde head peeking at them from the sofa, and grins. Nope, not the infomercial.</p>\n<p>\"You wait for me,\" Derek says after a beat.</p>\n<p>\"Of course. I'm not stupid.\" Stiles grins at him around a spoon of nutella.</p>\n<p>\"You were just threateni—\"</p>\n<p>\"I knew you'd cave.\" Stiles holds out the jaw of nutella when Derek's expression goes mutinous. \"Nutella?\"</p>\n<p> </p>\n<p>\"Have I ever told you you're a horrible driver?\" Stiles says, glancing sideways at where Derek is glaring at the road. Or, no, he's not glaring. That's his neutral face—ahh, that there, that's glaring.</p>\n<p>\"Numerous times,\" Derek says. \"It's getting old.\"</p>\n<p>\"No, it's not, because you still drive horribly.\" Stile grips at the sides of the passenger seat when Derek screeches to a stop at a red light. \"And, <em>dude</em>, injured still here? Okay, could we ease up on the abrupt jerking and shit?\"</p>\n<p>\"Shut up.\" Derek glances at him, though, when he tries to adjust his seat belt so it's not cutting into his bruises from the day before, and grimaces. \"Sorry.\"</p>\n<p>\"No, no, it's cool.\" Stiles waves it away, because, and this is top secret, it's good enough for Derek to even think about apologizing. <em>God</em>, he's so easy. \"You've gotta take your aggression out somewhere, and—\"</p>\n<p>\"Really, Stiles, really?\"</p>\n<p>\"—and since Dr. Deaton doesn't know anything—\"</p>\n<p>\"He <em>says</em> he doesn't know anything.\"</p>\n<p>\"—and dad can't find any connections between the victims other than their virginity… what, no 'he <em>says</em> that's the only connection?'\" Stiles laughs when Derek just raises one of those glorious eyebrows at him. \"Anyway, it's not like I'm looking forward to this either. Showing up unannounced at the Argent household is really just a horrible, horrible way to spend a Friday evening. I should be at a club, or something, trying to get rid of my—\"</p>\n<p>\"If I hear anything, I'm coming in. And then we're taking care of the uni—the <em>beast</em>—my way,\" Derek interrupts, a little too quickly.</p>\n<p>\"It's not like your way is different from my way.\" Stiles fidgets when they start driving again until he's comfortable. \"Both ways are just as stupid and idiotic and –\"</p>\n<p>\"<em>Hey</em>.\"</p>\n<p>\"—not getting any results, whatsoever.\"</p>\n<p>\"We're the ones that are going to have to kill the damn thing,\" Derek grouches, and Stiles glares at him.</p>\n<p>\"Oh, says the completely <em>uninjured</em> person, right?\" He snorts. \"Yeah, sourwolf, that's just great.\"</p>\n<p>\"That got old the first time you said it,\" Derek snarls.</p>\n<p>\"Oh, <em>sourwolf</em>, you mean?\" Stiles bares his teeth. \"How about Heathcliff? That's my newest one. I think it has a good ring to it. Or I could go with Kujo? Or Pluto? <em>Spike</em>. Oh my god, <em>Spike</em>. That's it. You're Spike.\"</p>\n<p>\"Spike was a vampire.\"</p>\n<p>\"Not <em>that</em> Spike, but,\" Stiles pauses, turns to Derek. \"I can't believe you know Buffy.\"</p>\n<p>\"…fuck you.\"</p>\n<p>\"Well, I mean, if you're offering.\" It's meant as a joke, but Stiles realizes, even as he says it, that he kind of, no, really, means it, and that, in itself, is terrifying. The Camaro suddenly swerves, and he looks over to see Derek looking wide-eyed and…surprised?</p>\n<p>Well, crap. Either he just swerved to avoid something in the road, or he can, like, smell that Stiles actually…well, double crap. He can't even say it was a joke because Derek would <em>know</em> he was lying.</p>\n<p>Again, <em>crap</em>.</p>\n<p>\"Crap,\" he mutters, because apparently his mouth is just going to dig itself a deeper hole now that it's already broken ground, \"that was…uh…\" he grimaces. \"No need to make things awkward, of course. That was just, ah, um, a <em>slip of the tongue</em>.\"</p>\n<p>Oh <em>god</em>, tongues. Don't think about tongues, Stiles, <em>don't</em>. Don't think about how Derek's would—<em>no</em>.</p>\n<p>He hears the creak of leather, glances over to see Derek's nostrils flared and his hands gripping the steering wheel like it's just insulted his penchant for hair gel and straight jeans. Oh no.</p>\n<p>Stiles is gonna die. The past year and a half of shaky-camaraderie is ruined, and now he's gonna die because Derek fucking Hale is going to kill him. He's going to kill him until he's not of this world. No longer living. A corpse in the ground. Or ashes. He doesn't know. Maybe his dad will keep him in an urn in the living room.</p>\n<p>He's debating whether or not he would break his neck if he just jumped out of the car right now, and his hand is actually on the car door, when Derek growls a low warning.</p>\n<p>\"Calm down, Stiles. I'm not…I'm not going to kill you.\" His voice cracks, though, as he says it, and Stiles doesn't know whether Derek is laughing at him or holding his claws back. He doesn't care. What he cares about is that, for now, there's not going to be any confrontation. Physical or otherwise.</p>\n<p>\"<em>Good.\" </em>Stiles slumps in his seat, not even daring to look over at the driver's side of the car until they come to a stop a couple of houses down from the Argent's. Which is actually just another five minutes, but feels like it takes <em>eons</em>.</p>\n<p>He stares up at the house – at the driveway surrounded by lush bushes and green grass, at the portrait windows and the curving arches - while Derek puts the Camaro in park, and his nerves are suddenly for an entirely different reason.</p>\n<p>He hasn't been here since Gerard Argent. He hasn't even been in this neighborhood, actually, since Gerard Argent. It's a little interesting that, even after all this time, he's still freaked out by the sight of that goddamned door. The same door Gerard had just…shoved him out of. Because he hadn't been a threat. Because he was being sent as a <em>message</em>.</p>\n<p>He knows that inside that house – inside those innocent looking portrait windows and past that sculpted garden – is a room filled with weapons, and a basement with shackles and electrocution machines and he <em>knows</em> he's been through <em>a lot</em> since sophomore year. Hell, there are about a dozen different classrooms at school that he has to <em>force</em> himself to walk into on a daily basis. But something about this place…something about it just rubs him the wrong way.</p>\n<p>\"…iles. <em>Stiles</em>.\" He jerks at his name, glances over to see Derek staring at him, looking constipated, then back at the house. \"You don't have to—\"</p>\n<p>\"Shut up, Derek,\" he says, then he unbuckles his seat belt, gets out of the car, and limps up the sidewalk. It's twilight, and there are lights on in the house, so he knows that at least <em>someone</em> is home. That doesn't really make him feel better, though, when he walks up the porch steps and rings the doorbell.</p>\n<p>He's kind of hating, actually, that this was his idea in the first place. Stupid brain. Stupid mouth. Stupid <em>Stiles</em>.</p>\n<p>He hears bare feet approaching the door, and then it's opening, and he's staring at Allison, who's staring back at him like she's seen a ghost.</p>\n<p>\"St—Stiles,\" she says, then her face hardens. \"What happened? Did they—\"</p>\n<p>\"Unicorn,\" he interrupts before she says what he thinks she's going to say. And if his voice is a little harder, a little rougher, if he spits out the word with a little more bitterness than usual…well, he'll blame it on the aches and pains the painkillers aren't really doing anything for. It's not at all because, still, <em>still</em>, Allison jumps to the conclusion that it's the werewolves that are the monsters, and not…and not, well, anything else.</p>\n<p>\"What?\"</p>\n<p>\"A unicorn wants to kill me because I'm a virgin, and we haven't been able to find anything that would make it easier to kill. I was wondering if you, uh, know of anything.\"</p>\n<p>\"…I thought unicorns—\" Allison kind of collapses against the door frame.</p>\n<p>\"<em>Like</em> virgins? Approach them and put their horns in their laps because <em>that's not kinky at all</em>?\" Stiles snorts. \"Yeah, total bullshit. They're ugly as fuck, too. So, do you-?\"</p>\n<p>\"I, uh, we can look in the basement,\" she says, gesturing behind her with her thumb. Stiles clenches his jaw, proud that he only imagines turning tail and running for the hills for a second. \"That's where we keep a lot of the older books. Plus, I have a couple bestiaries on my laptop. Come on in, oh, and take your shoes off.\"</p>\n<p>She steps back, motions for him to come in. If he could make his bandaged hands into fists, he would, but he can't, so he just swallows, and follows her in.</p>\n<p>\"Your dad isn't here?\"</p>\n<p>\"Conference in Texas,\" she says, watching him toe his shoes off.</p>\n<p>\"Aweso—I mean, oh.\" Stiles rubs his hands, awkwardly, over the back of his head. \"So, there are books?\"</p>\n<p>\"Yeah, down in the basement.\" Allison gestures towards the door at the end of the hallway, and Stiles realizes that she <em>doesn't know</em>. Holy fuck. She doesn't know that Gerard had him here. That he beat him here. She doesn't know…well shit. \"I just… I'll just get my laptop and meet you down there? The switch is right at the bottom of the stairs, so…\"</p>\n<p>\"Yeah, oh, okay. That's great.\" He starts walking—limping—then stops and turns to her. \"Thanks for this, Allison. I know you don't want to—\"</p>\n<p>\"If it keeps you alive, Stiles,\" And now her voice is lower, her expression sadder. \"I'm willing to help. It's…awkward, I know. But I'm always willing to help…help you.\"</p>\n<p>He nods, then starts limping his way to the basement door, then down the steps. When he turns the lights on, his eyes go automatically to where Erica and Boyd had been strung up, and he cringes.</p>\n<p>They're safe, now. They're happy. They're fine. <em>He's</em> fine.</p>\n<p>Okay. Books.</p>\n<p>He goes over to the large bookshelf and starts pulling things out at random, stacking them on the nearby table. Most of them are bestiaries, written in different languages, with notes in English along the margins, or on sticky notes folded haphazardly in between the pages.</p>\n<p>All of it screams of disorganization, and it makes his fingers itch with the need to categorize and label and…nope, that's not what's happening now.</p>\n<p>He wants to be out of here as soon as possible. As he starts flipping through pages, though, he realizes that this is going to take a while, and Derek will probably want to know.</p>\n<p>\"Derek,\" he says, keeping his voice low. It's easier to do this than text, because his fingers are useless right now. And, knowing Derek, he's probably already eavesdropping. \"This is gonna take a long time. So if you need to be somewhere I'll just call you when I find something.\"</p>\n<p>He hears the door open, then, and goes back to the book in front of him.</p>\n<p>The information that the Argents have is amazing. None of it is on unicorns—yet—but it's varied and detailed and Stiles is really amazed how thorough someone can be when they really want something dead.</p>\n<p>He finds out about selkie and pixies and witches and <em>really</em> wishes he had photographic memory, or maybe continued access to everything he's reading. He doesn't even really pay attention to Allison as she sits at the table, sometimes typing things and sometimes reading.</p>\n<p>It's still weird as fuck, though, being here. Because he still knows the exact place where Gerard had held him down and punched him until his ears rang. It's over by the stairs, and, this is probably his imagination, but he keeps thinking that the wood there is discolored, like it's stained. Maybe from where his nose had kept bleeding.</p>\n<p>He feels his heart rate start to pick up, and forces himself back to the research.</p>\n<p>Time passes—he doesn't know how long exactly, but long enough that he finishes looking through two big books and is a third of the way done with another – and then Allison makes a high pitched squeak, and he looks at her to see her eyes wide.</p>\n<p>\"Does this unicorn,\" she starts, \"have… the head of a deer, the hooves of an elephant, the… tail of a boar?\" She sounds like she's reading off something, and he nods, scooting closer.</p>\n<p>\"Yeah, exactly, and a horn. Black. Long as fuck. Pointy, too.\"</p>\n<p>\"Great, okay, so.\" She types something in. \"I'll send this to you tonight—it's a big file—but, uh, read it.\" She pushes her laptop at him, and he starts reading.</p>\n<p>\"So,\" he says five minutes later, when he's done, \"wow. That's promising.\"</p>\n<p>\"Yeah, right? I know the horn part is a bit much, but the rest—\"</p>\n<p>\"Is useful, yeah.\" He looks at her. \"And you're willing to…send this to me?\"</p>\n<p>\"It's not like I'm getting any use out of it, Stiles.\" Allison shrugs. \"I don't even know why I still have them.\"</p>\n<p>\"Well, thank you,\" he says, leans back in his chair, suddenly feeling much better about the whole thing.</p>\n<p>Because he has a way to kill the unicorn. He has facts—well, hopefully they're facts—that no one else has. And those facts are going to keep his virgin ass alive.</p>\n<p>The unicorn is practically undefeatable. At least, usually. It's fast, and strong, and <em>smart</em>. But that only applies to unicorns that haven't gone rogue. The good thing is that Allison's bestiary talks <em>exclusively </em>about rogue unicorns.</p>\n<p>Which, apparently, have a surprising amount of weaknesses.</p>\n<p>The biggest of all being the horn in the middle of their heads. Which is the only thing that can kill them.</p>\n<p>Kind of like Achilles' heel, except…hornier. Yeah, hornier.</p>\n<p>The bottom line is that, somehow, someone is going to have to break that horn off, and then use it to stab the unicorn in the heart.</p>\n<p>Not simple. Not simple in the fucking least. But hey, at least it's…proven. And Stiles has a pack of werewolves to do all the dirty work for him, so all he has to do is, well, yeah, be the bait. And this time it has to <em>work</em>.</p>\n<p>\"Not a problem,\" Allison shrugs, stands, then leans over to type something into her laptop. \"So, hopefully I'll see you at school? On Monday?\"</p>\n<p>He nods. \"Yeah, yeah. Definitely.\"</p>\n<p>He knows there's so much more he could say. Knows there's so much he <em>should</em> say. But…but it's been more than a year. And, yeah, he was angry with her when all that crap went down when they were sophomores. <em>So</em> angry. Just like he had been angry at Scott, just like he had been angry at Lydia, and at Jackson, and, well, everything and everyone, really. But now…now all that is over. And Gerard is dead, and the kanima is now a douchey werewolf, and the alpha pack is long gone, and even Morrell is in jail, and Stiles is…Stiles is fine.</p>\n<p>Well, fine-<em>ish</em>.</p>\n<p>He gets up and follows Allison up the stairs and to the front door. The silence between them is definitely <em>awkward</em>, now that there's nothing to do.</p>\n<p>\"So,\" Stiles says, shoving his good foot into his shoe, \"thanks, again, Allison. I know you'd rather not be anywhere near this shi—\"</p>\n<p>\"It's <em>fine</em>, Stiles.\" She smiles at him. \"Just, uh, be careful?\"</p>\n<p>\"What, me?\" He scoffs, lets her open the door for him, and starts backing out. \"That's kind of like telling… yeah, I don't got anything.\"</p>\n<p>She laughs. \"See you in school.\" And then the door closes, and he's outside. He doesn't resist the temptation to shake himself off, because, shit, he hadn't realized how <em>heavy</em> it was in there until he was out.</p>\n<p>Out here—it's night now—he can finally breathe.</p>\n<p>Well, that is, until he realizes he's going to have to go back to Derek's car. The car that has Derek in it. The same Derek that he had just recently – <em>accidentally—</em>propositioned.</p>\n<p>Crap, he's gonna die.</p>\n<p>\"I think you should make T-shirts,\" Stiles says when he's sprawled over Derek's sofa an hour later, his bad foot propped up on the opposite arm rest, eyes on the TV, where the Mythbusters are blowing things up, purposefully <em>ignoring</em> the confused looks Derek keeps giving him (the same looks he's been giving him ever since he got in the car after Allison's). \"They should read 'Stiles Stilinski: there was never a person more right in the history of rightness' or something. We can wear them on full moons. I'll even let you wear your jacket over it, since you get grouchy without leather. Or, maybe—\"</p>\n<p>\"So, we're going to have to break it's horn off—\" Derek shoves something at his face, and he flails for a minute before realizing it's a can of Coke.</p>\n<p>\"Fu—oh, thanks. Yeah, break it off.\" He grabs the can, opens it, then sighs when he has to scoot up to take a sip.</p>\n<p>\"—and then stab it in the heart,\" Derek finishes, goes to sit over in one of the chairs. The one that faces Stiles.</p>\n<p>\"Exactly.\"</p>\n<p>\"That sounds fun,\" Isaac says from the other chair. He was here when Derek and Stiles got in. The others are either at their respective homes, or, in Erica and Boyd's case, out on a date. Which Stiles thinks is fucking adorable. He would pay good money to see Boyd making goo goo eyes. Oh god, maybe sharing a milkshake with Erica. The potential for blackmail would be <em>infinite</em>.</p>\n<p>\"Isn't it always?\" Stiles sighs. \"Anything happen at school today?\"</p>\n<p>\"Nah, same old.\" Isaac pauses. \"Although, some girl in English asked whether you were all right?\"</p>\n<p>\"Huh.\" Stiles glances at him. \"… the only girl I know in English is Lydia. Lydia was asking if I'm all right? Couldn't she have just—\"</p>\n<p>\"No, idiot. Some girl. A junior?\" Isaac looks at Derek, scrunches his nose up. \"Brunette? Nose ring?\"</p>\n<p>\"…I think it's a fake nose ring, Stiles grumbles. \"Isn't that Kara? Kara Kelson, or something? I think we're working together on the final project.\"</p>\n<p>\"<em>Oh,</em>\" Isaac says, then gets his phone out and starts texting something. A minute later, Stiles' phone beeps, and he takes it out to see that Isaac is texting…him.</p>\n<p>\"Why are you texting me? I'm right here.\" He looks at the message. \"And, <em>no</em>, dude, she doesn't like me. She has, like, a boyfriend in Oregon or something.\"</p>\n<p>\"…weren't we discussing how to kill the unicorn?\" Derek growls. Isaac snickers and texts something again. Stiles sighs, because, really, this is getting ridiculous.</p>\n<p>\"Yeah, it's kind of straightforward, though, isn't it? Plus, it's not like we can do anything when only us three are here. I'm practically—no, I <em>am</em> an invalid—and you're all brawn and no brain, and Isaac is, well, he's a lover not a fighter. So…\" Stiles shrugs. \"I mean, if you want I can go home. Dad's gonna freak when he sees me, though, so—\" He gets another message, glares at Isaac. \"What do you mean she <em>smells like arousal </em>when I'm around? And no, I'm not texting back my response. This is stupid.\"</p>\n<p>\"<em>Isaac,</em>\" Derek snarls. \"Will you fuc—and <em>no</em>, you're not going home. I told the sheriff you were staying here for the weekend.\"</p>\n<p>\"…and you couldn't have told me that earlier.\" Stiles finishes off the last of his drink, places it on the coffee table, and sinks back into the sofa. \"You seriously need a new sofa. I swear, the lumps are sentient.\"</p>\n<p>\"I like texting.\" Isaac leans back—or, well, Stiles can't see him, but it <em>sounds</em> like he leans back—into his chair. \"And I agree, we need a new sofa.\"</p>\n<p>\"Then buy one,\" Derek snarls, again, then gets up and stalks off to—oh, that's the bathroom door slamming. Stiles thinks it's part awesome, part sad, that he knows what each door sounds like when it slams. The bathroom door has a click to it; Derek's room has a click and then a screech; Isaac's a low whine.</p>\n<p>\"Touchy.\" Stiles grins back at Isaac. \"He probably needs to reapply his hair gel or something.\"</p>\n<p>\"… you are a complete and utter idiot.\" Isaac says, but he says it fondly, so Stiles isn't too insulted.</p>\n<p>\"Says the idiot who decided to have a text conversation in front of Derek?\" Stiles scoffs. \"You know Brooder McBrooderson hates being left out. You're lucky he didn't just break the phone. Or your <em>arm. </em>It's not like we were discussing anything b—\"</p>\n<p>\"An idiot. Clueless. It would be cute if it wasn't so sad.\" Isaac leans forward and steals the remote from his hand. \"I get to choose what we watch.\"</p>\n<p>\"<em>Fine</em>.\" Stiles isn't really sure what he means, but he's too tired—even though all he's really done today is laze around the apartment and then go to Allison – to try to finagle an answer out of Isaac. So he just gets as comfortable as he can (which isn't actually, all that comfortable) and provides Isaac with his own commentary on the bad Syfy movie he chooses to watch.</p>\n<p>Seriously, the dude has questionable tastes.</p>\n<p>Derek joins them again, maybe an hour later, but by that time Stiles is in so much of a television-induced state of brain decay that he really can't think of any witty remarks to welcome him back. Actually, about thirty minutes after that—just as one of the hot guys in the show has to tear off all his clothes for some reason that's important to the plot—Stiles falls asleep.</p>\n<p>He doesn't dream, at least, he doesn't think he does, and when he wakes up, feeling better than he has in <em>days</em> (even <em>with</em> the aches in his back from the lumpy couch), he lets himself stretch until he hears something crack.</p>\n<p>A good crack, not a bad crack.</p>\n<p>\"Your dad called,\" someone—Derek, of course—growls from…somewhere. He can't tell because all the lights are off, \"to check in.\"</p>\n<p>\"Cool, cool.\" Stiles yawns, moans as he sits up. Yeah, he feels better, but still, pretty sore. At least his ankle isn't hurting as much.</p>\n<p>\"So did Scott, he said sorry.\"</p>\n<p>\"For what? Where's Isaac? What time is it?\" Stiles twists his back. \"Why are we sitting in the dark?\"</p>\n<p>\"… which one of those do you actually want me to answer?\"</p>\n<p>\"All of them?\"</p>\n<p>\"Right, of course.\"</p>\n<p>His eyes are adjusting to the light now, so he sees that Derek is sitting in the chair he was in previously. \"… have you moved since I fell asleep? Or have you been watching me and plotting how to kill me?\"</p>\n<p>\"Scott's sorry because Isaac and him are at Batwoman without you—\"</p>\n<p>\"Fuckin' Scott!\" Stiles crosses his arms, then thinks better of it when his hands sting. \"He <em>knew</em> I wanted to see that—!\"</p>\n<p>\"And it's 9 pm. We're sitting in the dark because you were sleeping. And I haven't been… plotting how to kill you.\"</p>\n<p>\"So you've been watching me. Which is not terrifying at all.\" Stiles gets up, and starts walking towards the kitchen. Or, hobbling, because he really hates walking around in the dark. \"Where are the lights in this—<em>fuuuuccking dicksticks assfuck douchenozz—\"</em></p>\n<p>He hates walking around in the dark because he inevitably stubs his toe against something. In this case – because he just stubbed his fucking toe against something – the kitchen counter. He leans against the offending counter, biting his lip and maybe punching the counter-top a couple of times just because he can.</p>\n<p>\"…fucking christ, Derek,\" he says, or, squeaks, really, \"you could've warned me?\"</p>\n<p>\"Sorry.\" Derek sounds much closer than he was, and, yup, he's two steps behind Stiles, his arm outstretched like he wants to help him. \"I didn't thi—\"</p>\n<p>\"Fine, fine.\" Stiles waves it away, limps over to the kitchen light and switches it on. \"My life should come with a fucking hazard sticker.\"</p>\n<p>He hears a chuckle—a full-on <em>chuckle</em>—and turns, astonished, to see Derek bent over, one hand on the counter, the other over his face. His shoulders are shaking, and, holy shit, he's laughing.</p>\n<p>\"Holy shit,\" he says, because, strangely enough (okay, actually, considering this is Stiles, and <em>that's</em> Derek, and when he laughs, his face lights up like…like…like something that lights up, it's not all that strange) the sight of a happy Derek, of an <em>amused</em> Derek, turns him on.</p>\n<p>Well fuck, it's not even all that surprising, since a lot of the things Derek does turn him on. But, hey, he's a seventeen year old virgin, and this is <em>Derek Hale</em>, who was sculpted from brooding granite and polished with angsty manpain oil.</p>\n<p>Oh god, Derek and oil…</p>\n<p><em>No</em>, Stiles, be the better man. Don't let yourself get turned on by a goddamned metaphor. Even if it <em>is</em> a pretty hot meta-</p>\n<p>He spins around before Derek can start smelling the arousal on him, limps over to the fridge, and grabs a bottle of water. He's uncapping the bottle when Derek stops laughing.</p>\n<p>\"Are you…\" Derek's voice is rough, and, Stiles freezes. Because, really, leave it to Derek to be all confrontational and upfront when Stiles wants to do the opposite. He swears, the dude is infuriating. \"Are you <em>attracted </em>to me?\"</p>\n<p>At least his voice cracks, Stiles thinks. It means this is as awkward for him as it is for Stiles. He sighs, taking his time as he closes the fridge door and turns around to lean against it. He looks down at the bottle of water in his hand, glances underneath his lashes at Derek, who's just staring at him, then goes back to staring at the water bottle. It's the safer choice.</p>\n<p>\"It doesn't have to be awkward,\" Stiles grumbles a little later, \"you really don't have to concern yourself. I'll deal with it.\"</p>\n<p>\"So…\" Derek gulps, and Stiles does not imagine the step he takes towards him. His heartbeat, damn it, picks up, and he doesn't even care that he's being obvious when he takes a couple of steps to the right, <em>away</em> from Derek. \"You are.\"</p>\n<p>\"Uh,\" Stiles scratches back of his head. \"You can, kind of smell it, can't you? I mean, it's not like I can contro—okay, I probably <em>can</em> control it. I mean, I <em>will</em> control it. In the future. Now, I mean. I'll start controlling it now.\"</p>\n<p>Oh <em>god</em>, does Derek look awkward. Like he's just swallowed something unpleasant. Or, maybe, <em>heard </em>something unpleasant. Damn. Stiles inches away a little bit more.</p>\n<p>\"Hey, dude, I told you. It's <em>fine</em>. But maybe I should lea—\"</p>\n<p>\"I…don't want you to control it,\" Derek finally says, and Stiles freezes, because <em>what the hell</em>. He looks at Derek, and his eyes look wide and kind of… surprised. Like they had back in the car. His cheeks are slightly red, which is adorable, even on—no, <em>especially</em> on Derek. He looks, well, panicked. And awkward, but Stiles already mentioned that.</p>\n<p>He knows Derek can hear his heartbeat. Hell, even <em>he</em> can hear his heartbeat, and it's fast and nervous. But that doesn't mean he knows what this is. Derek is a confusing dude, and his ability to use the English language to actually convey emotion is…limited. So while this <em>may</em> be some kind of weird ass confession – which Stiles hadn't even known he had wanted in the first place, but apparently <em>he does</em>, want it, that is – it might also be something completely unrelated.</p>\n<p>\"What does that mean?\" Stiles asks.</p>\n<p>\"I—\" Derek seems to choke on his own words. \"Fuck.\" He finishes with, quite eloquently. \"It means I don't want you to control it, <em>okay</em>?\" Derek snarls a little later, when Stiles doesn't say anything.</p>\n<p>\"Yeah, but I don't know what <em>that </em>means.\" Stiles shrugs when Derek growls.</p>\n<p>\"I like it,\" Derek says, quiet, eyes searching Stiles' face, like he's trying to tell him something. Stiles doesn't care that he can feel his chest turn over. If this is some kind of fucking joke…well, it's not funny.</p>\n<p>\"If this is a fucking joke, Derek,\" he says. \"It's not cool.\"</p>\n<p>\"It's not a joke.\" Derek takes a step forward. Stiles takes a step back.</p>\n<p>\"Then what is it? Because I've been smelling like…<em>that </em>\" -- he waves his arms around --  \"for a while, and it's kind of weird that you bring it up now.\" He pauses, a horrible idea occurring to him. \"Oh god, is this some kind of protective fucking Alpha thing? Are you trying to seduce me so the unico—\"</p>\n<p>\"<em>No</em>.\" Derek rubs his hand over his face. \"No, definitely not.\" He takes a deep breath. \"I didn't know it was…for me.\"</p>\n<p>\"You didn't know…\" Stiles squints his eyes, because he's missing something. Right? He has to be missing something. It hits him a second later, and it makes him swallow. \"You didn't know I was attracted to <em>you, </em>is what you're saying. You thought I was just smelli like tha—oh.\"</p>\n<p>The whole flared nostrils thing makes so much more sense, now.</p>\n<p>\"And… and…\" Stiles gulps. \"And you <em>like</em> it that I… uh, am attra—that I like you.\"</p>\n<p>Derek nods, once, curtly.</p>\n<p>Stiles is still suspicious. He's a suspicious dude, and his suspicions usually turn out right. Look how Matt turned out. And he sure as hell had his suspicions about Ms. Morrell before she tried to kill him. So he forgives himself for not collapsing at Derek's feet.</p>\n<p>Or maybe he's not suspicious, maybe he just can't believe it.</p>\n<p>Because, first of, he hadn't even known Derek was into dudes. And second, if he was so into dudes, why would he be into Stiles? Not that Stiles is <em>all</em> bad. Shit, he's fucking adorable, if he says so himself. But people like Derek go for people like, well <em>Derek</em>. Dark and beautiful and silent.</p>\n<p>Of course, Stiles goes for people like Derek too, which makes him worry for his future. But <em>back to the fucking point here</em>…</p>\n<p>\"So this is…a confession?\" Stiles asks.</p>\n<p>\"<em>No</em>, it's a…it's a discussion,\" Derek says, and at least even <em>he</em> winces. \"I just…I don't want you to think--\" He stops, seems to center himself. \"I'm not good at this.\"</p>\n<p>\"No shit,\" Stiles says, but his voice is way too breathy to sound unaffected. Fuck. \"Does this mean… you like me?\"</p>\n<p>Derek growls, closes his eyes, and nods. \"It's not because of the unicorn. It's because… it's because I didn't know. Before now.\"</p>\n<p>\"Y-yeah, well, it's not like I've really been able to hide it all that well,\" Stiles grumbles. Now that he thinks about it, he has been sickeningly obvious about his attraction. At least, more obvious than Derek. And, <em>holy shit</em>, he gets what the others have been hinting at, now. All the giggling and the laughing and the half-finished sentences. How oblivious could one idiot get?! Well, then again, Stiles had never even entertained the idea of Derek ever liking him <em>in that way</em>. \"The others figured out you… uhh… yeah.\" Stiles can't, for the life of him, finish that sentence.</p>\n<p>Derek winces. \"Yes.\"</p>\n<p>\"And you weren't going to tell me about this because…?\"</p>\n<p>\"Because I—\" Derek rolls his eyes. At himself? At Stiles? No one knows. \"Because I thought it would go away.\"</p>\n<p>\"Well, that's flattering.\" Stiles leans against the counter. \"I knew you were screwed up, dude, but, like, wow. Isn't that, like, self-flagellation, or something? Or pining? Is it called pining?\" He pauses. \"Holy shit, were you <em>pining</em> for me?\"</p>\n<p>\"<em>No,</em>\" Derek growls. \"Fuck, Stiles. I'm twenty-three and you're seventeen. This is embara—I don't even know why I started this—\"</p>\n<p>\"Wow, <em>again </em>with the flattery.\" Stiles snorts. \"I'm so sorry you're attracted to me, Derek. Really, it's all my fault.\"</p>\n<p>\"If you hadn—\"</p>\n<p>\"What? What did I do?\" Stiles is angry now. \"I didn't do anything you couldn't ignore, so stop blaming me. Shit, you're the one that was pining.\"</p>\n<p>\"I <em>wasn't pining,</em>\" Derek snarls.</p>\n<p>\"Meh, beg to differ.\" Stiles shrugs. \"You're the one that says you like that I smell like arousal when I'm around you, so—\"</p>\n<p>\"I <em>do,</em>\" Derek snarls, and oh, maybe they're getting back on track? On track to what, Stiles doesn't know. \"I just… don't understand.\"</p>\n<p>\"Don't understand?\"</p>\n<p>\"<em>Why</em> I like it.\" Derek rubs his forehead again.</p>\n<p>\"Because…. you're attracted to me?\" Stiles feels like they're going around in circles here. He sighs. \"Shit, dude, you shouldn't be the one being weird about this. <em>I </em>should be the one being weird about this. As far as I know, this is all some plot to sacrifice yourself to the virgin so I don't die. Or a joke, or something. I mean, seriously, Derek, you're <em>you</em>, and I'm <em>me</em>, and—\"</p>\n<p>\"What does <em>that</em> mean?\" Derek looks angry, and then sad, and then his faces goes carefully blank, and when Stiles goes over his words again, he sighs, rubs his temples.</p>\n<p>\"Are you,\" he starts, \"serious, right now? You're going for the 'he only likes me for my good looks' argument. Because you know that's bullshit, Derek. Come on, I shouldn't have to even—oh my god, <em>I'm </em>the virgin and I'm more emotionally stable than you-!\"</p>\n<p>\"No, you're not,\" Derek interrupts. \"You're just better at hiding it.\"</p>\n<p>\"… that's a discussion for an <em>entirely different scenario</em>.\" Stiles gives him a look, tries to ignore the pang of <em>something</em> the statement makes him feel. \"Right now we're talking about why I'm going to have to say I like you as a person and not just as a sexual object.\"</p>\n<p>\"What.\" Derek turns red. Good, maybe if he's embarrassed enough he'll <em>shut up</em>. Stiles is aware that Derek isn't being purposefully obtuse and difficult, that he's just trying to protect himself, but that doesn't make this any more frustrating. Stiles shouldn't have to deal with stuff like this. He hasn't even <em>been</em> in a relationship yet, so why does the first one he even comes close to having turn out to be all sorts of complicated and angsty?</p>\n<p>\"You were kind of an asshole when we first met,\" Stiles starts, and Derek's face droops. It would be funny, if it wasn't so sad. \"Don't give me that look, dude. You know perfectly well you were an asshole, but you had good reasons. Your life sucked. You were lost, scared, <em>angry</em>. I get it. But, I mean, you're kind of…nicer now. At least, I mean, I thought we were friends. You don't think I would hang out with you if I didn't actually like you as a perso—?\"</p>\n<p>\"You hang around Jackson.\"</p>\n<p>\"…yeah, okay, but he's kind of like Cartman,\" Stiles says.</p>\n<p>\"Cartman. From South Park.\" Derek blinks.</p>\n<p>\"Yeah, he's the friend you love to hate.\" Stiles shrugs. And then Derek starts laughing again. Yup, still an amazing sight. Stiles is about to start spouting poetry in 3…2…1…</p>\n<p>\"I don't like you just because you smell like that, Stiles, I'm not an animal,\" Derek says when he can speak again. The words sound like they're being ripped from his mouth. Okay, back to serious time. And Stiles was enjoying the smile on Derek's face. Damn.</p>\n<p>\"Says the werewolf.\" Stiles nods. \"Who <em>smells </em>people. Of course.\"</p>\n<p>\"Shut up.\" Derek sighs, looks at the ceiling, sighs again. \"Just… I trust you.\"</p>\n<p>\"Cool,\" Stiles says, although his voice is a bit squeaky. \"I trust you too.\"</p>\n<p>\"Yeah?\" Derek swallows, looks at him.</p>\n<p>\"…yeah,\" Stiles says, and he's instantly reminded of treading water in a pool, holding Derek up for two hours, because he's kind of amazed that they've gone from <em>that</em> to…this. \"So, I mean, since we like each other. And we trust each other. If you wanted to, I guess, <em>act</em> on that, uh, arousal, then I don't think I would mind at all.\"</p>\n<p>\"I —\" Derek is already walking—and <em>goddamn</em> the way Derek walks should be illegal—towards him, hesitant almost, slow, even when he puts a hand on his shoulder, curls his fingers into his shirt. From this close, Stiles can watch the way his jaw clenches, and how his eyebrows furrow almost all the way over his eyes, at the way his Adam's apple bobs up and down when he swallows, and – there — the way his nostrils flare out when he inhales. \"F<em>uck</em>.\"</p>\n<p>Stiles would say something witty and sarcastic – he's kind of, actually, reliving the good old days, when Derek used to pin him against things because he thought it i<em>ntimidated</em> Stiles (hah, silly Derek) – but he's too busy wondering how the hell he got here. How the hell he's allowed to, apparently, stare at Derek like he's staring at him, how he is allowed to <em>touch</em>. And yeah, there is definitely much to discuss—or not discuss, probably, more like avoid until it goes away, yeah, that sounds like a good plan—but right now all he wants is to do is just kind of…forget all of that.</p>\n<p>\"So that's a yes, then?\" He asks, and he wants it to come out sounding all nonchalant and cool, but it's more of a squeak. His vocal chords are probably affected by how close Derek is to him. Like, really close. Chests almost touching close. Staring at his mouth as it moves, close... \"Or is it a—\"</p>\n<p>Oh, okay, so now they're kissing.</p>\n<p> </p>\n<p>So, Stiles is kissing Derek.</p>\n<p>… or, Derek is kissing Stiles.</p>\n<p>Meh. Fuck semantics. There is some major kissing going on, is what's really important.</p>\n<p>Stiles is pretty sure, that if this isn't some kind of joke, that if this—the kissing—is going to become a common <em>thing</em> with them (holy crap, he's probably getting really ahead of himself here, but does that mean that Derek and him are…like, in a <em>romantic relationship?)</em>, that if he's allowed to <em>touch</em> now, well, he's going to get pretty fucking addicted.</p>\n<p>Because kissing Derek is like…woah.</p>\n<p>It's pretty fucking fantastic.</p>\n<p>It's actually kind of surprising, though, how hesitant Derek is being about it. There's no, like, fervor. No hot, dirty breathing, or hard, demanding grips or anything. No growls or snarls or angry snapping. Derek is pressing, yeah, but he's pressing with light, almost dreamy touches, like he's just as surprised that this is happening as Stiles is. His hands are ghosting along Stiles sides, not stopping in one place long enough to give Stiles something to focus on.</p>\n<p>Other than how <em>strange</em> this is, that is. Because he really had expected Derek to be all instinctual want and predatory need. But then again, this makes sense, if you actually know Derek. If you know what he's been through, if you know that his life has been a clusterfuck of death and destruction and betrayal and Very Bad Happenings. It makes sense that he would be hesitant about something that he wants (and, holy shit, Stiles is something Derek Hale <em>wants</em>) after all of that.</p>\n<p>\"<em>Stiles</em>,\" someone—oh, right, Derek—moans. \"<em>Stop thinking</em>.\"</p>\n<p>Stiles could say about a dozen different things to that, all of them either heartfelt declarations of his undying lust and/intense like <em>or</em> embarrassing puns. He doesn't. Instead, he pulls Derek closer, until their bodies are flush against each other and he's pinned against the counter. He can feel Derek's heartbeat like this—and yeah, that's corny as hell, but it's true—and it's hard and fast and nervous. It matches his own. Actually, it's maybe a little faster.</p>\n<p>So, Derek is nervous. God, that's adorable, if he is. Stiles doesn't want him nervous, though. He wants him…well, he wants to get back to the kissing, actually, which has stopped because Derek seems to be waiting for him to respond.</p>\n<p>\"Make me,\" he says. And then has a little internal freakout, because Stiles has <em>always</em> wanted to say that. In a sexual context, of course.</p>\n<p>Derek's eyes go squinty, and his heartbeat picks up, and—oh, that's a growl. A good growl, apparently. But Derek still doesn't move. His hands grip at Stiles' sides a little harder, but he doesn't move. He looks frozen, and unsure of himself, and a little—no, a lot—terrified.</p>\n<p>So Stiles says fuck it and attacks him with his mouth. Hey, if Derek doesn't want it, he can't always just throw him across the—oh, okay, so he does want it.</p>\n<p>Before Stiles really knows what's happening, he's been hoisted to sit on the counter, and Derek is in between his knees, plastered up against his front. Derek's mouth is hot and open over his; Derek's tongue is licking and sliding against his; Derek's <em>teeth are </em>biting at his lips, and then his jaw, down his neck, then back up.</p>\n<p>It happens so fast that it takes a bit for Stiles to catch up, but when he does, he can't help the groan that spills out of him, or the way he pulls Derek in closer with his legs, or the way his hands slide up underneath Derek's shirt to rest against bare skin (although, not really, because the bandages are still on, which he suddenly <em>despises</em>), or even the way he goes kind of crazy, kissing and licking and just abandoning any semblance of cool because he's making out with <em>Derek</em>.</p>\n<p>Who is, since we're on the subject, <em>fantastic</em> at making out. Or, no, it was <em>fantastic</em> when Derek was hesitant and almost terrified. Now… now it's like… nirvana. A transcendent experience.</p>\n<p>… just fucking awesome, really.</p>\n<p>It's not perfect, by far. Derek's hands are gripping his sides almost too tightly, his stubble is probably going to make Stiles' face and neck red for days, the angle is a little off, with him sitting up on the counter, and Derek standing, so Stiles has to lean down to get at his mouth and neck. Stiles is, understandably, a little too enthusiastic about the whole thing, so his hands are extra grabby, and his kisses are kind of sloppy…</p>\n<p>But that's not the point. The point is, that despite all of that, it's still amazing.</p>\n<p>\"<em>Stiles,\"</em> Derek moans again, grabs his hips and pulls him closer. Stiles didn't even think they could <em>get</em> closer, but then Derek shifts, changes the angle somehow, and <em>woah</em>, Derek's half hard. Well, Stiles is half-ha—no, wait, he's full hard. Yup, all the way. Straining against his jeans, sensitive to any and all touches, <em>hard</em>. They're both hard.</p>\n<p>Oh fuck, they're both hard.</p>\n<p>Stiles is aware that he's mumbling — has been mumbling things ever since Derek picked him up, deposited him on the counter, and started to ravish him. He's aware that he's cursing and gasping and all-out <em>moaning</em> into Derek's mouth, but he's kind of been distracted by everything else that's happening to even think about turning on his brain-to-mouth filter. He hopes Derek doesn't mind.</p>\n<p>He doesn't think he does, if the way he keeps moaning his name is any indication.</p>\n<p>And, wow, Stiles never realized he could get hard from just…this. Whatever this is. Usually there at least has to be someone's hand around his dick area. But not now, nope. He doesn't even know what he's going to do <em>if</em> Derek decides to take this further. As it is he's having trouble stopping his hips from canting forward and grinding against Der—</p>\n<p>\"<em>Oh my god</em>, not the<em> kitchen</em>, Derek!\"</p>\n<p>Derek is suddenly at the far end of the living room, his back plastered against the wall right next to the hallway, and Stiles is frozen for a second, looking at Erica and Scott looking at him, and then he loses his balance, and falls to his ass on the kitchen tiles. If he wasn't so mortified, he would probably just curl into a ball and cry away the aches and pains (because knowing his luck, he cracked his tailbone or something), but he is. Mortified, that is. So the aches and pains and self pity will have to wait until he's alone.</p>\n<p>Damn it. His boner's gone too.</p>\n<p>Or wait, that's probably a good thing, considering that Erica is here now. And Scott. Oh joy.</p>\n<p>\"H-hey, guys.\" Stiles grabs on to the nearest counter edge and pulls himself up, making sure to glare at Derek on the way. Doesn't really do much, though, because all Derek is doing is staring at the carpet like he wants it to swallow him up.</p>\n<p>\"You're bleaching that counter.\" Erica points at where he had been previously perched, flounces over to put a take-out container in front of him. Smells like…oooh, curly fries. \"Boyd and I picked you up dinner…but apparently you were planning on eat—\"</p>\n<p>\"Nope. No. Do not go there. Just… no.\" Stiles winces, glancing past her to look at Scott, who seems…frozen. \"And. Thank you. For the food. Where are… Isaac and Boyd?\"</p>\n<p>\"Boyd's teaching Isaac how to park,\" Scott says, but his voice is squeaky.</p>\n<p>\"Oh, well that's—\" Stiles purses his lips, scratches the back of his head awkwardly.</p>\n<p>\"In <em>my</em> car?\" Oh, and Derek suddenly has words. How fucking lovely.</p>\n<p>\"He's doing fine,\" Erica says, and Stiles kind of jumps when he feels her hand on his shoulder. \"He didn't even hit anyone on the drive back ho—<em>and he's gone</em>.\"</p>\n<p>Derek stalks past Scott and out of the apartment, and Stiles is a little peeved that he's so obviously running away from him, but also a little relieved because <em>holy shit</em>, he was just making out with that <em>Derek</em>, and that is some…heavy shit. Heavy shit that needs evaluation and lots and lots of over-thinking. And mental play-by-plays. Also, space.</p>\n<p>But there's also a sadistically satisfied part of Stiles, because that crazy, wide-eyed, <em>hunted</em> look in Derek's eyes in because of <em>him</em>. Because of <em>Stiles</em>. So, yeah, he's satisfied that he's made Derek terrified enough to flee his own home. That's not crazy at all.</p>\n<p>…whatever, Derek is <em>affected</em> by him. And that's all that matters.</p>\n<p>So, hah.</p>\n<p>\"<em>Dude.</em>\" Scott walks over to him after he closes the front door. \"In the <em>kitchen</em>, really?\"</p>\n<p>Stiles winces, opens the take-out container to see a burger and a shitload of curly fries. \"… it was kind of… no. I'm not explaining this. I have no idea what happened.\" He contemplates on how to shove some curly fries in his mouth without getting his bandaged hands dirty, and watches as Erica moves to the fridge, her nose wrinkling.</p>\n<p>\"Smells like sex in here, so yeah, you <em>do,</em>\" Erica says. \"I want details.\"</p>\n<p>\"<em>I</em> don't want details,\" Scott whines. \"No details until I leave! I thought this was a one way thing!? You <em>like</em> Derek? He's such a… such a <em>butthole</em>, Stiles.\"</p>\n<p>\"Turns out it's a two way thing?\" Stiles shrugs, and, in a fit of idiocy (and possibly, hunger) starts unwinding his bandages. There is no way he's going to let <em>bandages</em> get in the way of some stress-eating. <em>No way</em>.</p>\n<p>Except… underneath, his hands are red and raw and kind of disgusting, covered in Deaton's special poultice that is supposed to make them heal quicker. It must be working, because as nasty as they look, they were nastier yesterday. He looks at his hands, looks down at the burger, whimpers.</p>\n<p>\"You have stubble burn. And hicke--\" Erica says from behind him, then. \"What the <em>hell</em>, Stilinski? Why are your banda—<em>god</em>, you're an idiot. Just hold still. We have more in the bathroom.\"</p>\n<p>\"I want my <em>burger</em>.\" Stiles looks at Scott. \"Feed me?\" Then he narrows his eyes. \"A one way thing? Wait, you knew I attract—you knew I liked Derek?\"</p>\n<p>Erica snorts on her way down the hall, while Scott gets that shifty eyed look that means he's uncomfortable.</p>\n<p>\"Uh, no.\"</p>\n<p>\"Uh, no?\"</p>\n<p>\"No, I didn't know you liked <em>Derek</em>. Why would you like <em>Derek?\" </em>Scott snaps, then catches himself. \"I mean, yeah, he's actually been really helpful, lately, but <em>still</em>. There are like, <em>loads </em>of people out there, Stiles. All of them <em>not Derek</em>.\"</p>\n<p>\"…we knew Derek liked you!\" Erica yells from the bathroom. Stiles blinks.</p>\n<p>\"Y-yeah?\" He asks, not at all worried that he's happy this has been more embarrassing for Derek than him. Well, the liking thing. The killer-unicorn thing is still pretty embarrassing.</p>\n<p>\"God, this is mortifying,\" Scott groans.</p>\n<p>\"Hey, if it's mortifying for you, what do you think it is for me?\" Stiles kicks him with his good leg, then eyes his food, still untouched. It's a crime, really. He sighs. \"I bet he's not coming back tonight. That's probably a good thing, right?\"</p>\n<p>\"… please don't talk about your relationships problems with me.\" Scott lowers his head to the counter. \"I have absolutely <em>zero </em>answers for you, dude. I'm, like, the <em>worst</em> at relationships.\"</p>\n<p>\"True.\" Stiles waits until Erica comes back in, carrying about five boxes of bandages, before he speaks again. \"I should probably leave, right? Go home for the night? Because I don't thi—\"</p>\n<p>\"Why don't you just have sex with him?\" Erica looks at him like he's crazy. \"He wants you; you want him. It'll stop you from getting killed. I can keep Isaac occupie—\"</p>\n<p>\"<em>No</em>.\" Stiles thinks he might get nauseous. He turns to Scott. \"You're taking me home. Please? Yes? Good plan?\"</p>\n<p>\"I'm actually fully behind that plan.\" Scott nods. \"But, let's never talk of sex and Derek? Again? Ever?\"</p>\n<p>\"… you are so lucky your break-up with Allison was painful enough that I can't tease you for doing the <em>exact </em>same thing to me,\" Stiles hisses.</p>\n<p>\"<em>Hey</em>.\" Scott gives him his wounded look. Crap. \"Uncalled for, man.\"</p>\n<p>\"Yeah, well, so was going to see Batwoman without me.\" Stiles holds his hands out when Erica eyes him, watches as she starts wrapping the new bandages.</p>\n<p>\"Boyd didn't like it,\" Erica snorts. \"Said Emily Blunt didn't make a good Kate Kane. I just think he was-\"</p>\n<p>\"--seriously? You went on a <em>double-date</em>?\" Stiles glares at Scott, who looks confused for a second.</p>\n<p>\"But I'm not dating Isaac. I like girls,\" Scott points out.</p>\n<p>\"Please. You two are so in bro-love it's pathetic. It's like the bromance of the century. A bromance of epic proportions. The bromance to end all broma—<em>ow</em>, not so tight, Erica.\"</p>\n<p>\"I almost forgot how whiny you are when you're injured.\"</p>\n<p>\"I'm human. The injury lasts longer. And I'm emotionally fragile right now.\" Stiles grins when Erica finishes his right hand, moves to his left. \"Plus, I think I cracked my tailbone falling off the counter.\"</p>\n<p>\"If it makes you feel any better.\" Erica grins her predator grin, and Stiles feels, more than sees, Scott flinch. \"You distracted Derek enough that we snuck up on you.\"</p>\n<p>\"How is that a--<em>oh</em>.\" Stiles clears his throat, ducks his head because he can already feel his cheeks heating up. \"Well, crap.\"</p>\n<p>\"… I don't think I can ever look Derek in the face again,\" Scott says. And then the door slams open, and Boyd and Isaac come through.</p>\n<p>\"Why does it smell like sex?\" Isaac, of course, is the one to ask. Mostly because Boyd is too busy scrunching his nose up in distaste.</p>\n<p>\"You owe me thirty bucks,\" is all Erica responds with, but it's apparently enough, because Boyd and Isaac just start laughing… and laughing… and laughing…</p>\n<p>Fucking werewolves.</p>\n<p>When Scott drops Stiles off at his house, it's thirty minutes later, and all Stiles wants to do is go in his room and curl up into a ball (well, not too much of a ball, because that would probably aggravate a couple of his injuries), take an ill-advised amount of painkillers, and sleep until everything is like it was two weeks ago.</p>\n<p>But seeing as how this is Stiles, and his life never really gets any less horrifying, his dad is not only home, but awake and sitting at the kitchen table—the same kitchen table with a front-and-center view of the front door – doing what looks like a shitload of paperwork. So when Stiles walks in and meets his dad's gaze, watches as it goes from pleasantly surprised, to confused, to angry, he sighs, and walks over to sit at the chair opposite him.</p>\n<p>\"Hey dad,\" he says. \"How's the case?\"</p>\n<p>\"… I'm assuming you weren't planning on coming home this weekend because—\"</p>\n<p>\"I look like shit?\" Stiles winces. \"Yeah.\"</p>\n<p>\"And why do you look like shit, Stiles?\"</p>\n<p>\"Uhh, the unicorn,\" Stiles says, and the sheriff squints his eyes, leans back in his chair. Oh no, that's his cop stance. The one he uses when he's trying to figure something out.</p>\n<p>\"You were attacked, again,\" he starts. \"by the unicorn. And you weren't going to, oh, I don't know, let me in on this?\"</p>\n<p>\"Well, I mean…\"</p>\n<p>\"… you didn't just get those injuries chasing after it, did you?\"</p>\n<p>\"No,\" Stiles groans. This is going to get embarrassing, fast, isn't it?</p>\n<p>\"You're a vir—\"</p>\n<p>\"Let's not.\" Stiles holds his hands out in front of him, then remembers they're bandaged, and quickly puts them back on his lap.</p>\n<p>\"I don't know whether this is making me angry or proud.\" The sheriff glares at him. \"Where's your jeep?\"</p>\n<p>\"… at the mechanics.\"</p>\n<p>\"<em>Because</em>?\"</p>\n<p>\"Because the unicorn punched a hole through the door.\" Stiles is doomed. He's going to be grounded until he's eighteen. Well, that's only six months, but—<em>no</em>. He doesn't want to be grounded for six months! He has commitments!</p>\n<p>\"Really.\"</p>\n<p>\"Yes.\"</p>\n<p>\"Derek told me he was taking care of it.\"</p>\n<p>\"Yes, he is.\" Stiles tries not to pout too much at the mention of Derek.</p>\n<p>\"Are you sure? Because this -- \" Dad gestures towards Stiles. \" -- doesn't look like he's taking care of it.\"</p>\n<p>\"This happened yesterday. We know more about it now.\" Stiles <em>does not</em> sound like a petulant child. He does <em>not</em>.</p>\n<p>\"What? I know it's rogue, I know it kills virgins. I know it's huge, and that my deputies are starting to think this is some weird cult ritual killing thi—\"</p>\n<p>\"Derek and them,\" -- he makes sure to not include himself in the description --  \"have to break the horn off and stab it through the heart. Only way, apparently, to kill it….uh, permanently. They've just gotta find it, so—\"</p>\n<p>\"They'll be careful?\" Dad sighs, looks at him. \"<em>You'll</em> be careful?\"</p>\n<p>\"Yeah, dad, we're good.\" Stiles grins. \"I'll be fine, all right?\"</p>\n<p>\"I doubt it,\" he says, but it's with a sigh, so Stiles knows they're done, for now. \"You know, I'm proud of you for no—\"</p>\n<p>\"Again, <em>no</em>. Let's not.\"</p>\n<p>\"Good, let's not.\"</p>\n<p>\"Yeah.\"</p>\n<p>\"Great.\"</p>\n<p>\"Can I…?\" Stiles gestures upstairs, and practically trips over himself when the sheriff nods. He's halfway up when he hears his name, and looks back.</p>\n<p>\"Love you, son.\"</p>\n<p>\"Love you too, dad.\"</p>\n<p>Stiles ends up doing homework instead of curling up on his bed in a pill-induced stupor (eventually, after, he, uh, takes care of some <em>business</em> in the shower). He doesn't want to do it – the homework- but he figures that now is a good a time as any, and seeing as how he doesn't know how his weekend is going to turn out, it's the smart choice to get it done as quickly as possible. He also needs the distraction, because, well, of the whole making-out-with-Derek-Hale thing. Who apparently has <em>feelings</em> for him.</p>\n<p>Well, he hadn't really said anything except that he trusted him. And that he liked that Stiles was attracted to him. That he liked the way he <em>smelled.</em> But shit, Stiles is pretty sure that if Derek <em>hadn't</em> had feelings for him, he wouldn't have kissed him…</p>\n<p>Right?</p>\n<p>Derek wouldn't do something like that. Even if he was just <em>attracted</em> to him, in like, a purely sexual way (yeah, that still doesn't make sense to Stiles, but whatever), he wouldn't make a move because…well, because they're friends. And pack. It would just be too awkward.</p>\n<p>Yeah?</p>\n<p>Fuck.</p>\n<p>Unless Derek <em>is</em> doing the protective Alpha thing. And everyone is involved. And they all had a meeting on who would be the one to de-virginize Stiles. And Derek drew the short straw. And… and... and…</p>\n<p>And if that's the case, then Stiles is pretty sure dad will let him move to Berkeley early. He could even start going by his real name. Dorm for the first couple of semesters, meet a couple friends, get an apartment. Start a new life… adopt a couple hundred cats.</p>\n<p>Or, a not-so saner part of his brain reminds him, you could remember that this isn't that big of a deal. Hey, if the guy wants sex, he wants sex. Even if it is with you in all your deliciously self-flagellating glory. And you obviously want it, so why not treat it like a good thing? Beat the players at their own game. Make <em>Derek </em>as obsessed with the way you look shirtless as you are with the way he does.</p>\n<p>… yeah, okay, maybe not that last one.</p>\n<p>Maybe none of that, actually.</p>\n<p>Stiles finishes his anatomy and physiology homework (a case study on lock jaw, which is horrifying…and <em>awesome</em>), and is about halfway done with his essay on the prevalence of witch hunts in modern Africa, when his window slides open.</p>\n<p>He doesn't hear it, because he has his earphones on, but he does feel the sudden draft in the room, then the vibration of feet hitting the floor. He doesn't freak out, although he should, on principle. He doesn't, though. He just pauses his music, turns around and raises an eyebrow at…ahh, of course. Who else would come into his bedroom at…oh, wow, it's almost two in the morning.</p>\n<p>Meh, at least it's Saturday tomorrow. Or wait, it already is Saturday.</p>\n<p>\"I could've been naked,\" Stiles can't help saying. Although, considering what had happened between them earlier tonight, it's probably not the best thing to—ahh, yup. That's Derek's deer-in-headlights look.</p>\n<p><em>Ugh</em>, why does it have to be so cute. Damn it. It wouldn't have been cute a year ago. Hell, it probably would've annoyed the hell out of him a <em>week</em> ago. But a week ago he didn't know that Derek had the hots for him. Now that he does…yeah, it's cute.</p>\n<p>\"You're not.\" Derek looks around, probably for somewhere to sit, then just leans against the window seat. Hah, the safest place, really.</p>\n<p>\"Nope. What do you want?\" This isn't awkward at all. Nope. Least awkward situation ever.</p>\n<p>\"You left,\" Derek says. \"I thought you were staying for the wee — until we killed the unicorn.\"</p>\n<p>\"Uhhh, I didn't really —\" Stiles takes his earphones off. \"I didn't think it would be a good idea to stay?\"</p>\n<p>\"You could've gotten attacked again.\" Derek glares.</p>\n<p>\"Didn't.\"</p>\n<p>\"You could've.\"</p>\n<p>\"Yes, well, <em>didn't</em>.\" Stiles leans back until his chair squeaks. \"What else, Edward?\"</p>\n<p>\"I'm not a vampire.\" Derek seems to relax, walks over to sit on his bed. \"Why are you always comparing me to vampires?\"</p>\n<p>\"I wasn't comparing you to <em>that</em> Spike. I was saying you're Spike as in the dog name. You know, 'fetch, Spike!' or 'no, bad dog, Spike!'?\"</p>\n<p>\"Dog jokes are below you, Stiles.\"</p>\n<p>\"They're really not.\" Stiles grins when Derek leans down and starts taking his shoes off, although it might be sort of a manic grin. Since <em>Derek</em> is taking his <em>shoes</em> off, and, placing them by his night stand, and oh god, now he's lying on the bed, head pillowed on his arms.</p>\n<p>Why is Stiles panicking? Derek has been in his bed before. At least a couple times a month Stiles comes home from school to Derek sleeping in it, and…<em>oh</em>.</p>\n<p>Well.</p>\n<p>That needs some further investigation.</p>\n<p>Actually, a lot of Derek's past interactions with him need some further investigation. Maybe then Stiles will figure out when Derek started to like him. Hell, maybe <em>he'll</em> figure out when <em>he</em> started to like Derek.</p>\n<p>It would've been after the alpha pack, and maybe they were semi-friends when Derek had stayed at his house after Morrell had nearly run him over… after that? Before the leprechauns but after the warlock?</p>\n<p>\"Hey,\" he says. \"I thought your whole 'run out of the apartment' deal was so you could get away from me. Weren't we doing the space thing? I thought we were doing the space thing. That's why I came home.\"</p>\n<p>\"I…\" Derek winces, eyes on the ceiling. \"I panicked.\"</p>\n<p>\"Yeah, got that part.\"</p>\n<p>\"Shut up.\"</p>\n<p>\"You ran out of your apartment. If you were in Alpha form your tail would've been plastered—\"</p>\n<p>\"I <em>panicked,</em>\" Derek seethes.</p>\n<p>\"Great.\" Stiles thinks a change of subject is in order. \"So <em>why are you here</em>?\" Hey, he said a change of subject was needed, not that he was willing to change it. Stiles' brain is very cantankerous like that.</p>\n<p>\"God, you're so <em>annoying</em>.\" Derek brings a hand to cover his face, and Stiles pouts.</p>\n<p>\"Well, you're the one that—\"</p>\n<p>\"I don't even know why I <em>like</em> that,\" Derek interrupts him, and Stiles shuts up. \"I don't know <em>why</em> I keep—why I <em>like</em> it. Would you just… stop asking? I wasn't even going to—and you keep <em>interrupting</em> me, and I <em>like </em>it, and—and just, <em>fuck</em>.\"</p>\n<p>Derek is breathing hard. Apparently emotional honesty is more exhausting than anything physical. Stiles is kind of flabbergasted. Not that Derek is breathing hard—although that does kind of make his chest (and other parts) clench—but that he <em>gets</em> what Derek is saying. Or, what Derek isn't saying. He gets it, and he realizes that he doesn't need Derek to put it into words. At least, not yet.</p>\n<p>He trusts Derek. He trusts him, and, yeah, it terrifies him (and, lets not kid ourselves here, it also makes him feel fucking<em> awesome</em>) but Derek…Derek <em>likes</em> him. Likes him as a person. Likes him in a sexu— no, that's awkward, better to say he's attracted to him. To <em>him</em>. To Stiles. Stiles Stilinski. <em>Him</em>.</p>\n<p>Wow. He kind of feels… honored. Is that weird? That's weird.</p>\n<p>\"Just…\" he says, \"stay there. Gimme a minute.\"</p>\n<p>Stiles saves his essay and closes his laptop. He straightens up his desk, shoving his papers and books into somewhat organized stacks, then gets up, and goes to brush his teeth.</p>\n<p>His face, in the bathroom mirror, looks fine. It's everywhere else—his torso is pretty much just one giant bruise, as is his right leg—that looks like shit. He has to unwrap his hands, again, to wash his face, and they're slightly less red than they were. They still hurt like a bitch, though, and rubbing Deaton's poultice all over the burns doesn't really dull the pain as much as make everything <em>tingle</em>.</p>\n<p>When he's done, he walks – his ankle is less painful than it was earlier today, so it's definitely a walk, and not a limp – back to his room, and grins at where Derek is still in his bed, staring up at the ceiling, already half asleep.</p>\n<p>\"Move over,\" he says, and doesn't wait until he plops to lie down next to Derek, their sides pressed together. He decides to ignore the way Derek stops breathing the second he gets on the bed. \"I think your stupid sofa gave me a back ache.\"</p>\n<p>\"It was on sale.\" Derek takes a breath, long and deep, through his mouth. \"What are you doing?\"</p>\n<p>\"You're the one that's on my bed.\" Stiles tugs until he's under the covers, fidgets until he's comfortable, then chances a glance at Derek to see him frozen, eyes squeezed shut, fists clenched, lips a thin line. Stiles starts laughing so hard he snorts. Or, well, it actually doesn't take a lot for Stiles to snort, so never mind. \"<em>Dude</em>, you look terrified. Calm down. If you want we still have that mattress you used—\"</p>\n<p>\"This is good,\" Derek interrupts, and the way he says it makes Stiles think it has a deeper meaning. \"I'm good with this.\"</p>\n<p>\"Good,\" Stiles says.</p>\n<p>\"Good,\" Derek sighs. Slowly, Stiles feels Derek calm down, feels him sink in the mattress, and when - even though he's really tired of sleeping, because it seems like he's been doing a lot of that lately, and, being a seventeen year old boy with a hot man in his bed, it's really blasphemous that he would even <em>consider </em>sleeping – he feels his own eyelids start to droop, he doesn't fight it.</p>\n<p>He wakes up, and the sun is shining in his eyes—which is wrong, because he usually sleeps facing the other way, towards the wall—then realizes that he's half splayed over something warm and bodylike, his face is smashed into smooth muscle, and a warm hand is rubbing at the back of his neck.</p>\n<p>\"Stiles,\" Derek says. Of course he knows he's awake. \"You're drooling on me.\"</p>\n<p>\"Says the dude who <em>pined</em>.\" As far as comebacks go, it's not his best. But considering that he's just woken up, and it usually takes longer for him to even start forming words, he counts it as a win. He wipes his mouth, though, but doesn't attempt to move, because he is <em>really</em> comfortable right now. Even if he does have a boner. But whatever, so does Derek.</p>\n<p>Oh god, Derek has a boner.</p>\n<p>Derek must smell something on him, because Stiles hears him sniff (it's sad that he knows exactly what he looks like without looking at him –flared nostrils, squinted eyes, pursed lips), and when he responds, his hand is pressing down a little harder than it was, and his voice is gruff. \"I wasn't pining.\"</p>\n<p>\"I prefer to think you were pining.\" Stiles' voice comes out rough and a little cracked, but he's not too embarrassed. \"So you were. What time is it?\"</p>\n<p>\"If I was pining,\" Derek growls. Maybe they're having a competition to see whose voice can go lower. Stiles is pretty sure Derek will win, what with the whole growling advantage. \"Then so were you. And it's eight.\"</p>\n<p>Stiles is pretty sure his dad is off-duty today. So he should still be sleeping. And if he is going in to the station, then he probably already left.</p>\n<p>Just to see what happens, Stiles skims one of his hands up Derek's arm. He's not wearing his jacket—that's folded up on his desk—just one of the millions of black t-shirts Derek seems to own. He probably buys them in bulk, gets them delivered once a month. The skin is warm and soft and Derek makes a noise that sounds like it's between a whimper and a sigh.</p>\n<p>Stiles wants to jump up and shout that <em>he </em>did that—<em>he</em> made Derek make that noise—but he doesn't, because he's playing it cool. And cool people who wake up cuddling with werewolves don't stop cuddling with said werewolf to do a little victory dance.</p>\n<p>… they wait until they're alone. And <em>then</em> they do a victory dance.</p>\n<p>\"So, this is kind of weird. And awesome. Us two. Have I said that before?\" Ahh, nevermind. Stiles can never be cool. His mouth is too undisciplined for him to be cool. Who wants to be cool, anyway? Cool is overrated.</p>\n<p>\"You hinted at it.\" Derek's hand doesn't move, which is a good sign. Actually, his other hand comes up and starts skimming up Stiles' arm…which is a <em>better</em> sign. God, he's bad at this. The only times he's ever made out before (leaving out last night, of course) have been when he's half drunk and slightly desperate. Right now…well, right now he's more than slightly desperate, but he's definitely not drunk.</p>\n<p>Plus they're in <em>bed</em>. Together. Which makes everything a billion times more intimate.</p>\n<p>\"Just checking,\" he mumbles, then, a little bit later, raises his head to see Derek looking at the ceiling. \"But it makes sense, though, when you think about it. The whole opposites attract thing, right? Two people who don't seem to get along, who seem like complete <em>opposites</em>, just kind of ending up per—<em>oof</em>.\"</p>\n<p>He's suddenly staring up at the ceiling. Or, staring up at Derek and maybe like half a centimeter of ceiling. Derek, who's kneeling over him, face maybe a couple of inches away from his, eyes all dark and intense, his mouth doing that thing where it hitches up on one side. Stiles gulps, because this is entirely new territory, and he has <em>no idea what he's doing</em>.</p>\n<p>Right, so, he's definitely nervous. This is very nerve-racking situation. A very nerve-wracking and strange situation. It just gets stranger because all Derek does is <em>stare </em>at him. And, sure, he's gotten used to Derek's silent stares, but this stare is <em>not</em> silent at all. His eyes are raking all over Stiles' face and he looks <em>hungry.</em></p>\n<p>God, that's hot.</p>\n<p>Stiles gets a hand in Derek's hair before he actually realizes it, and then he's leaning up and kissing him. It's a slow, hot, drawn-out, open-mouthed, <em>filthy</em>, kiss, and Stiles is kind of proud of it. Until Derek, who has been frozen for maybe a good ten seconds, groans and starts kissing back, which makes Stiles incapable of any thinking whatsoever except <em>god, yes, good, do that again, please, ugh, awesome</em>.</p>\n<p>Somehow, his hands end up in Derek's pants, squeezing his ass and pushing down until he collapses on top of him. The weight is nice. What's nicer is that now he can grind his dick against Derek's and maybe actually <em>come</em> before someone inevitably interrupts them.</p>\n<p>\"Your fucking <em>mouth</em>, Stiles,\" Derek growls, biting and licking at said mouth. \"Just—\"</p>\n<p>\"Shut up,\" Stiles snarls, and he's actually kind of surprised that he doesn't give a damn what Derek thinks about his mouth (okay, he does, because holy <em>fuck</em>, Derek thinks his mouth is hot) because all he wants is to get them both naked. \"Take off your pants.\"</p>\n<p>He doesn't know where the snarl came from, but Derek apparently likes it, because he shivers, and stops kneading his fingers over Stiles' skull to reach down and start undoing the button to his jeans. The movement gives Stiles enough room to bring his own hands down and start shimmying out of his boxers. He gets them down to his knees, sees that Derek is having trouble with his zipper, and goes to help.</p>\n<p>\"We should—\" Derek starts, just when Stiles conquers the zipper and starts pushing his jeans down.</p>\n<p>\"--come. Come many times. Multiple times. In many different positions,\" Stiles finishes for him, breathless, licking his lips as he pushes Derek's boxers down, over jutting hip bones, and then dark hair, and then a thick, red, wet cock.</p>\n<p>… is it slutty of Stiles to want that in his mouth? Because he wants it in his mouth.</p>\n<p>Suddenly, his shirt is off, flying across the room to land on his laptop, and Derek is leaning down and running blunt fingernails down his sternum, rib cage, over his abs, then down, circling over his hip bones, fucking <em>teasing</em>, until Stiles makes to grab at Derek's dick with his own hand, only to stop with a pitiful whine he realizes they're still bandaged.</p>\n<p>Derek laughs—he <em>laughs</em>, what happened to awkward, embarrassed, hesitant Derek?—but then his hand is on Stiles' dick, and really, Derek can laugh at him all he wants. As long as he keeps his hand right where it is. Or, maybe not <em>right</em> where it. Maybe he could start moving it. You know, this <em>century</em>, maybe.</p>\n<p>\"<em>Fuck</em>,\" Stiles groans when Derek <em>does</em> start moving his hand, up and down, with just enough pressure, but not enough speed. \"You too. Together. I can't—my hands.\"</p>\n<p>His voice is cracked and hoarse, but Derek gets what he means, because he moans, nips at Stiles' jaw, and changes their positions so he can get both their dicks in his grip. And, <em>oh god</em>, Stiles really never thought about what it would feel like to have another dick touching his. Well, he <em>thought </em>about it. But more in the theoretical sense, not in the <em>holy shit this is the best feeling in the world</em> sense.</p>\n<p>Derek's cock is hot and wet against his, and all Stiles can do is watch, and maybe thrust his hips up and down with no rhythm or finesse whatsoever, as Derek works his hand up and down, squeezing and pulling and driving Stiles completely fucking <em>insane</em>.</p>\n<p>\"Come on, dude,\" he moans out when the ache just gets to be too much. \"F<em>aster</em>.\"</p>\n<p>\"Don't—ah—call me dude—<em>fuck</em>.\" Derek does go faster, though, leans in so that their chests are mere centimeters apart, and Stiles can feel the heat rolling off of him in waves. He grabs at Derek's arms, starts biting and licking at his collar bone and shoulders, because his hands are fucking useless and he really can't get enough of the way Derek's skin feels under his mouth.</p>\n<p>\"<em>Dude</em>,\" Stiles says. Or, croaks, because there's a pressure building in his pelvis and his dick is licking pre-come like crazy and the edges of his vision are starting to get a little fuzzy and white. \"I'm gonna come.\"</p>\n<p>Derek growls, and his grip tightens. Stiles gasps at that, a filthy, open-mouthed, embarrassing gasp, complete with arched back and everything. His fingernails dig into Derek's arms hard enough that they would bruise if he wasn't a werewolf, and then there's hot liquid all over his stomach and chest, because Derek is <em>coming</em>, holy fuck, and his eyes are closed, his mouth open, canines elongated and features morphing under his skin, stuck between human and wolf.</p>\n<p>Stiles is stunned for a split second that the idea of Derek struggling for control—struggling because of <em>him</em>—is such a turn on. But then he remembers that everything Derek does is apparently a turn on to him, and gets past it. He leans up, licking into Derek's mouth and grabbing at his hair with one hand, moaning when Derek starts moving his hand up and down Stiles' dick again, thumbing at the tip and then stroking fast and hard and amazing. Stiles feels his breath stutter, feels his muscles clench up, feels the pain-pleasure ache in his balls get almost unbearable, and then he's coming with a groan.</p>\n<p>He collapses back on the bed, then, looking down to see his chest streaked with come and wet with sweat and probably a little saliva. It should be disgusting, but right now Stiles is still way too turned on to think of it as anything other than <em>hot</em>. Like, really hot. Kinky hot.</p>\n<p>Derek is looking too, his expression kind of surprised, his breathing hard, mouth still open. He rears back to sit on his heels, straddling Stiles' thighs, eyes still locked on Stiles' chest.</p>\n<p>\"What are you—<em>fuck</em>, dude,\" he breathes out, flabbergasted, when Derek just starts smearing the come in circles around his stomach—fuck, <em>their come</em>, and, oh crap, Stiles just came, with another person, in his bed, and it wasn't horribly embarrassing or terrifying or—</p>\n<p>\"Don't call me <em>dude,</em>\" Derek growls. His pupils are blown wide, and his fangs are still out, and his eyes… yeah, his eyes are red and glowy. Stiles' cock twitches.</p>\n<p>\"Wh—why <em>not</em>, holy <em>fu—uu.\" </em>Stiles whimpers, because Derek is…licking him. He's <em>licking </em>him. His tongue is flat and broad against Stiles' ribs, his stomach, his dick. Derek's mouth is on his dick. He's licking and breathing and his fingers are trailing down to his ba…and someone's cell phone is ringing.</p>\n<p>It's Derek's, because the ringing is coming—hah,<em> coming</em>, and Stiles is probably still a little orgasm-high—from his jacket. Plus, Stiles would never have the default ringtone. <em>Boring</em>.</p>\n<p>At first, Derek ignores it. Or, he doesn't ignore it so much as growl his frustration and keep licking at Stiles' cock, then up again, to nuzzle against his clenching stomach muscles and nip at the skin, possibly in retaliation for what Stiles had been doing to his shoulders before. But then the ringing keeps on…ringing. And ringing.</p>\n<p>And Stiles is kind of all on board for the ignoring plan, but it only takes five minutes, maybe less, before Derek throws himself off the bed and stalks over to his jacket, leaving him cold and naked and <em>sticky</em>.</p>\n<p>Blegh. Yeah, he's half hard, and, yeah, having Derek walking around with <em>his </em>half-hard dick hanging out of his jeans and no shirt (although, Stiles doesn't really remember when he got rid of the shirt…he's pretty sure he had one on when Stiles woke up) isn't doing anything to make him <em>less</em> aroused, but now, with Derek out of bed, glaring at his phone, everything is suddenly…awkward.</p>\n<p>He sighs. Of course it is. Because with him it's always two steps forward and one step back. Ugh, he knows it's bad when he's starting to think in clichés.</p>\n<p>\"Scott,\" Derek growls. \"What—\"</p>\n<p>Stiles sits and pulls his boxers up. His t-shirt is across the room, so he heaves himself out of bed and is just pulling it over his head when Derek growls.</p>\n<p>\"Don't go near it, Scott. Got it? Don't let it smell you, don't let it do <em>anything</em>. I'm leaving now—\" He hangs up, and Stiles knows this is about the unicorn, because he's looking at Stiles like he wants to tie him up (and not in the good way).</p>\n<p>\"Boyd tracked the unicorn. We're going to take care of it,\" he says, tucking himself in and zipping his jeans up. The asshole doesn't even bother with a shirt before he's half out the window. \"Stay here, Stiles. Okay?\"</p>\n<p>And then he's gone.</p>\n<p>Stiles snorts. Stay here? <em>Fuck that</em>.</p>\n<p>It takes Stiles two minutes to find a pair of jeans and a t-shirt, and then he's running out of the house, jumping in his dad's patrol car, breaking about a thousand different laws in the process, and pealing out of his driveway. He goes through his phone's contact list, trying, and failing to get ahold of anyone until Isaac finally answers.</p>\n<p>\"Where are you?\" he asks, trying to sound nonchalant but not succeeding in the least.</p>\n<p>\"Derek said—\"</p>\n<p>\"Fuck Derek, where are you?\" He tries again.</p>\n<p>\"Sti—\"</p>\n<p>\"Isaac!\" He hits the steering wheel, not even caring that it hurts. He has bigger shit to worry about. Although, now that he's concentrating on his hands, his bandages are all stinky and sweaty and <em>come-covered</em>, for fuck's sake. It's probably not that good for the burns. But he's in a hurry. And plus, <em>a lot </em>of him is come-covered.</p>\n<p>He should still be in a post-orgasmic bliss right now, not speeding down a road in a stolen car. A stolen <em>cop</em> car. Stupid Derek. Stupid <em>unicorn</em>.</p>\n<p>\"They split up!\" Isaac whines. \"Derek is by the old house. Scott and Boyd are in the preserve. I think Erica and Jackson are somewhere east—\"</p>\n<p>\"The Hale house? It's at the Hale house again?\" Stiles takes a sharp right and steps on the gas. \"Thanks. See you.\"</p>\n<p>Then he hangs up, and he drives.</p>\n<p>Fucking Derek, he thinks. This is already all screwed up. They weren't supposed to split up. Splitting up is <em>never </em>a good idea. Splitting up is what people in horror movies do. And they should avoid acting, at all times, like they are in a horror movie.</p>\n<p>Then again, their lives are kind of like a horror movie.</p>\n<p>…which is <em>exactly</em> why they shouldn't give in to the stereotype. By <em>not splitting up</em>. For fuck's sake. This is the same problem they had with the leprechauns, and look how that turned out.</p>\n<p>Stiles takes a left to avoid a red light, keeping to the back roads until he has to turn on to the main road or miss the exit that leads to the Hale house. It takes ten minutes for him to get to the place where he was attacked (the second time), and he maybe speeds up, takes the turn fast enough that, for a second, he thinks he's gonna pop a wheelie.</p>\n<p>He doesn't, which is a relief, but then he realizes that the unicorn could be <em>anywhere</em>. It could be watching him. Right now. Charging at him with it's glowing black eyes and that weird, out of place head connected to a body that doesn't seem like it should work, but it does.</p>\n<p>He speeds up, his head hitting against the ceiling with every bump and swerve, and in another five minutes, he's in front of the Hale house.</p>\n<p>It's still depressing out here. He hasn't been out since the leprechauns—actually, he doesn't think anyone but Derek has been here since the leprechauns—and the house itself seems to have gotten <em>darker</em>. More <em>bent</em>. Decrepit and ruined. Like something Tim Burton would love. Dark and foreboding and twisted. Of course, Tim Burton movies are whimsical and maybe (he's not sure) allegorical, and the Hale house is…not. It's definitely not. It's a horrible memorial to a horrible event, and it's never going to be anything other than a rotting testament to how <em>monstrous</em> people can be.</p>\n<p>He turns the car off and jumps out, leaving the door unlocked and the keys in ignition just in case he needs to make a quick getaway. Shoving his phone in his pocket, he heads into the woods at a brisk jog.</p>\n<p>It doesn't matter which way he goes, because he's pretty sure that the unicorn is going to hear him. He's not exactly being stealthy. He's not <em>trying </em>to be stealthy. He's the bait. He's what's going to keep the unicorn <em>here</em>, chasing something, <em>concentrating</em> on something, while the others move in and kill it.</p>\n<p>There's a howl from somewhere—maybe a mile away—and he speeds up, crashing through the undergrowth and jumping over roots and downed trees, not really headed anywhere except <em>deeper</em> into the forest.</p>\n<p>His plan is stupid. He <em>knows </em>it's stupid. Hell, <em>most </em>of Stiles' plans are stupid. But he also knows that the others aren't going to get near the unicorn unless it's distracted. And he's here to be a distraction.</p>\n<p>So, it'll work. It has to work.</p>\n<p>There's another sound, closer than the howl. It starts of like a whine. A low, constant thrum that he feels, more than hears. And then it gets louder, and it turns into a wail. A scream, really. It sounds like an animal in pain, mindless with rage and terror and <em>instinct</em>. It gets louder, deeper, and turns into a roar.</p>\n<p>Stiles recognizes that roar.</p>\n<p>He recognizes that roar because it's the same roar he heard in the forest with Lydia, and when he was trapped underneath his jeep.</p>\n<p>He hears heavy hooves pounding over hard-packed dirt, hears a howl, farther away, that sounds like Derek. He's breathing hard, now, but he keeps going. Goes faster, actually. He runs and runs so that when the unicorn finally does appear—charging at him from the right—he's fast enough that he dodges it easily enough. He jumps, rolls, avoiding heavy elephant hooves and a wicked quick horn, sharp teeth out of a wide, foaming, deer mouth.</p>\n<p>\"Derek!\" He yells, kicking out blindly and hitting at the unicorn's flank. He's pretty sure he breaks a toe. \"Now would be a good time to play hero!\"</p>\n<p>Derek doesn't come, but he does hear a howl—it's close, maybe a fourth of a mile—so he scrambles back, falling over roots and rocks, pulling his legs back just before they're crushed by giant hooves. He keeps moving, crab-walking until his back hits a tree, and then rolling away just as the unicorn charges.</p>\n<p>It's screaming now, its head moving restlessly from side to side, seeing him but not <em>really</em> seeing him. He dodges when it charges at him again, spinning to keep the tree in between them, edging along with his back to the wood as it circles, and then charges, then backs off, and charges again.</p>\n<p>Maybe eons later—or a minute, who cares, it seems like eons—something black and furry leaps out of the trees from Stiles' left, snarling as it latches sharp, pearl-white teeth into the unicorn's jugular and <em>tears.</em></p>\n<p>There's blood everywhere, on Stiles and the trees and Derek's muzzle. On the unicorn too, as it rears up on it's hind legs, then starts jumping and bucking to try and shake Derek off. Stiles finds himself frozen, watching, part horrified, part fascinated, as the unicorn slams Derek into a tree until he lets go with a whine. It's all a blurr after that, really. Or well, for maybe five minutes. Stiles gets the impression that there's a lot of throwing and biting and general maiming, but he can't focus on anything, really, because they're both moving too fast. And then, something screams.</p>\n<p>Stiles hears bones crack. It's a sickly noise, wet with blood and strangely loud. It echoes in his ears, and when the two stop fighting enough for him to see what happened, he gags. The unicorn has a hoof on Derek's chest, another on his leg, and he's twisted all wrong. He's whimpering, still in his alpha form, and his leg, where the unicorn has its weight, is flat and crushed, his chest concave and deformed. The unicorn has its horn at Derek's neck, but it can't get close enough to actually puncture skin.</p>\n<p>It—the unicorn—is bleeding from a deep gash in its side. Deep enough that Stiles can see tissue and muscle past all the blood. There's a similar gash right underneath its horn, where the skin is flapping over to show bright red muscle, and it's favoring its right hind leg, which is bent backwards.</p>\n<p>Stiles doesn't throw up. He doesn't have the time.</p>\n<p>There's a branch in his hand, long and thick and heavy, something he picked up in a daze, and he lunges, swinging it fast and hard until he hears it connect with the unicorn's head with a satisfying <em>crack</em>. It doesn't kill the unicorn—of course not, that would be easy, and nothing about this is going to be easy—but it does get it to move off of Derek.</p>\n<p>He grabs at Derek's fur with one hand, ignoring the growl that probably means something along the lines of 'I told you not to get involved you fucking idiot,' and starts pulling him.</p>\n<p>Stiles can't talk, because he's out of breath, and is also about to vomit because there's <em>so much blood</em>, but if he could, he would be calling Derek an idiot too. A fucking idiot. A stupid he-man with a hero complex the size of the fucking moon. An asshole. He would also, probably, be crying a bit, because a lot of the blood on Derek is… Derek's. It's leaking from tears to his crushed chest and oozing past white bone over his crushed leg and it's terrifying. So, Stiles doesn't talk, but he pulls. He pulls until they're crouched behind a trio of relatively large boulders, set on a slight incline so the unicorn can't see them but they can see it.</p>\n<p>He hears howls as he leans down to arrange Derek into a better position. He whimpers when Stiles gets him on his good (well, <em>better</em>) side, his features morphing like he's trying to change back.</p>\n<p>\"Stop, stop.\" Stiles keeps his voice low, because he can hear the unicorn snorting, following the blood trail straight to their boulder. The others need to get here fast, because Derek isn't going to heal before it finds them. \"You suck at taking down unicorns, by the way. What was that? Were you <em>trying</em> to get injured?!\" he hisses. He knows it's bad when Derek just whimpers again, instead of growling.</p>\n<p>\"Fuck,\" he says. Theoretically, Derek will live. He's going to take a while to heal, but he's going to live. But it's still…it's still bad. It's still his fault that Derek is in this much pain. In this much <em>agony</em>. It's still his fault that Derek is spitting up his own blood and that his chest is caved in from where the unicorn crushed his ribs, still his fault that Derek's leg looks like someone took a hammer to it and just kept hammering until there was nothing but pulverized flesh and bo—</p>\n<p>There's a growl, and Derek nips, hard, at his hand, glaring at him with red, glowing eyes.</p>\n<p>\"<em>I'm allowed to feel guilty, fuckface</em>!\" he hisses, his voice too watery for him to <em>not</em> be crying. Damn it. \"Asshole. Doucheba-<em>fuck</em>.\"</p>\n<p>He throws himself to the ground just as the unicorn lunges at him, rolls until he's far enough away from Derek that it won't see him, even <em>if</em> the idiot is snarling and trying to get up. He scrambles back as it stomps at where his leg had been before, jumping to his feet and running.</p>\n<p>The unicorn is fast, but it's injured, and it hasn't healed enough to catch him. Not yet. It's also rogue, and blind with rage and whatever else that's making it do what it's doing, so Stiles runs. And, even with an ankle and knee that twinge with every movement, and hands that itch and sting underneath dirtied bandages, and a chest that aches every time he so much as turns his head, he gets away.</p>\n<p>Or, well, he's not trying to get away. He's trying to get the unicorn away from Derek.</p>\n<p>There's hot, stinky, iron-smelling breath at the back of his neck, and he swerves, flailing as he almost trips over a root, then turning to put a tree trunk in between the unicorn and him.</p>\n<p>It stares at him, lunges to the right, and he fakes to the left. It lunges to the left, and he goes right.</p>\n<p>And finally<em>, finally</em>, Erica's here. And so is Scott, and Jackson, and Boyd. Oh, and Isaac. They're all wolfed out, snarling as they surround the thing, slicing at the air with long, razor sharp claws and making the ground vibrate with their growls.</p>\n<p>It's all very intimidating. Stiles kind of sinks back, letting the tree support his weig—only then the unicorn jumps, starts galloping (or, semi-galloping, it's really more of a canter, what with the deformed leg and all), and, and, and…and it's fucking <em>sparkling?</em></p>\n<p>This has to be the teleportation thing. The reason why they kept losing the unicorn's scent at random intervals. Fucking crap.</p>\n<p>Stiles finds himself sprinting, and the unicorn is slow enough that he catches up before the others know what's happening. Actually, he catches up before even <em>he</em> knows what's happening. And then, being the stupid fucking idiot that he is, when he does catch up, just as the unicorn is turning translucent, he lunges at it, gets a handful of greasy, bloody mane, and then everything turns black.</p>\n<p>When he can see again, he's alone, with the unicorn, in a completely different part of the forest. Hell, is it still <em>the </em>forest? The Hale forest? Or are they even still in Beacon Hills? Or they even in <em>California</em>?</p>\n<p>Fuck.</p>\n<p>This was not a good idea. Definitely not a good idea. Stiles remembers something about horror movies and splitting up and…yeah, he's an idiot. Someone needs to punch him.</p>\n<p>He's on the ground, and the unicorn is staring down at him looking almost…confused. He doesn't move for a second, then it huffs out a breath of hot, blood-tainted air at him, and he scrambles away.</p>\n<p>\"Fuck,\" He croaks, looking for something—<em>anything</em>—to use as a weapon. There's nothing within reach except fucking leaves. He jumps to his feet, whimpering when the unicorn starts pawing at the ground, swaying its head from side to side, it's black beady eyes glowing at him. Those eyes prove him immobile for maybe a second, and then he's running again.</p>\n<p>This part of the forest—whatever forest <em>this</em> is—is dense, thick with underbrush, and hilly. He has no idea where he's going, so really he's running to find something to either hide in, or use to kill the unicorn.</p>\n<p>The terrain, even as hilly as it is, doesn't seem suited for caves. And there are no boulders to hide behind. Just underbrush that is thick enough to slow him down but low enough to not provide any shelter whatsoever. So, he runs. He runs, then runs faster when he hears the roar behind him, then the crackling of large hooves against leaves and the rushing noise of foliage being crushed.</p>\n<p>Crushed like bone.</p>\n<p>Ugh, Derek is going to kill him. He's going to kill him, and then he's going to ban him from ever touching him again. All because Stiles never thinks except when he shouldn't.</p>\n<p>Damn it, they should've had sex last night. Or this morning.</p>\n<p>He doesn't want to die <em>because</em> he's a virgin. That's even worse than just dying <em>as</em> a virgin.</p>\n<p>Stiles yells when he feels hot breath against his neck, throws himself to the side—hitting his ribs up against a tree and maybe seeing stars for a split second—just as the unicorn charges past him, head bent low, horn glinting in the sun. He lays there for a bit, stunned, then pushes himself to his feet and starts running the opposite way.</p>\n<p>Something vibrates in his pocket – his phone-and he really does want to answer it, but then he trips over a fallen branch, and face plants into the hard dirt. He either has a broken nose or a black eye. Or both. Either way, something hurts.</p>\n<p>Well, a lot of things hurt, but now his face hurts too.</p>\n<p>He twists himself to lie on his back, takes a good look at the branch he tripped over, and something like a plan starts forming.</p>\n<p>The unicorn turns, starts charging at him again, and he doesn't think, just grabs the branch—it's thick and heavy and long and seems like it would make a good weapon—and starts running again. He plasters himself, maybe a minute later, maybe five, behind one of the thicker trees, branch held like a sword in both hands, eyes closed, trying to concentrate on the sound of hooves as they get closer.</p>\n<p>He probably only has one chance at this. And it's not even guaranteed to work. It's just Plan A. Plan B is start running again and call someone. But then he'll have to <em>keep</em> running until they come and save him. And Stiles isn't sure he's going to be able to keep running. Not fast enough to outrun the unicorn. It's already healing; already galloping too fast for Stiles to have any hope if he has to keep running.</p>\n<p>He should've realized he had his phone with him earlier. Then he could've at least dialed someone and hoped they tracked him fast enough.</p>\n<p>This is why his teachers keep saying he needs to apply himself more. Because he just doesn't think things <em>through</em>.</p>\n<p>Stiles isn't even sure he's <em>strong</em> enough to—</p>\n<p>Fuck, the unicorn.</p>\n<p>He swings the branch upwards at an angle, arms burning from the strain, eyes closed, holding his breath for—</p>\n<p>The branch vibrates, painfully, as it connects with something hard. Stiles hears a horrible sound that he can't catalog, a mix between a scream and something stronger than bone breaking, and opens his eyes to see the unicorn careening into the tree right in front of him, blood pouring out of a horn that is now…only half of a horn.</p>\n<p>He lets a little part of him thank luck, and his own awesome on-the-spot physics calculations (ha, yeah right, it was all just luck). He doesn't have time to really celebrate, though, because the unicorn, as bloody and hornless as it is, is still dangerous. And it's turning, flaring it's nostrils at him, gnashing it's teeth, and…yeah, it's pissed.</p>\n<p>Fuck.</p>\n<p>Wildly, he looks around for the horn, sees it glinting on the ground, black and bloody, ten feet away, and drops his branch (now broken in two, the parts held together by a flimsy strip of bark) as he scrambles towards it.</p>\n<p>A lot of what happens next is blurry and confusing—even more so than what has already been happening—but he's suddenly on his back, horn in his hand, with the unicorn seconds away from trampling him.</p>\n<p>He hears himself start cursing, and then his hand comes up, the one with the horn in it, and he watches as the sharp point stabs through skin and muscle and sinew. There's a sickening squelch, and something that sounds like suctioning, and the unicorn freezes. Stiles is pretty sure he hit the heart—he's <em>pretty sure</em>. Nothing happens for too long. The unicorn just…stays there. Frozen, black eyes locked on him in…disbelief? There's blood leaking from where the horn is lodged in its chest, dripping down to pool around Stiles' hand.</p>\n<p>His breathing is harsh and shallow, wheezy, even, and there's a rushing in his ears that's not the start of a panic attack, but is definitely caused by some sort of anxiety. Someone moves—Stiles isn't sure if he lurches backwards or if the unicorn pulls away, but suddenly there's blood everywhere. More than when Derek had been injured. More than he's ever seen, and Stiles has seen a lot. He's covered in it, and it's dripping down his face and covering his skin.</p>\n<p>The unicorn collapses against the tree opposite him, sliding to the ground in an unnatural tangle of limbs, soft, confused moans escaping its slack mouth. He stares at it; it stares back.</p>\n<p>He's not sure what to do, except he… he feels guilty, suddenly. He guesses that's a good thing—means he still has a soul, or whatever. But it doesn't feel great, knowing that the thing dying in front of him is dying <em>because</em> of him.</p>\n<p>Stiles stares for a bit, because he can't think of anything else to do. He's just kind of…frozen. In shock, maybe, a little. In pain…a lot. He's shivering, which must be from some sort of adrenaline high.</p>\n<p>He knows he should stop looking. He knows he should go over there and give it a mercy blow, or something. <em>Anything</em>. Anything to stop those pitiful whines that are growing weaker as the unicorn loses more blood. But he… he can't.</p>\n<p>Shit, he thought this was going to be a quick kill. Stab the thing in the heart; it explodes in, like, glitter and rainbows. But… it's not. It's horrible and wrong and bloody and <em>slow</em>.</p>\n<p>Or maybe it's not, Stiles is pretty sure his grasp of time right now isn't the most objective. Maybe this is all taking seconds but his brain is high on survival and is making everything move slower than…nah, that's bull.</p>\n<p>He gets up, his whole body shaking with the need to stay <em>as far away as possible</em>, but limps over anyway (because Stiles has gotten <em>great</em> at ignoring what his body wants him to do), to where the unicorn is lying, breathing heavy, on it's side, eyes wide and terrified, blood gushing out onto the forest floor with every heartbeat.</p>\n<p>\"Fuck,\" he says. Its eyes aren't as black anymore. They're… brown. Dark brown. And they're looking up at him with fucking <em>intelligence</em>. Shit. He falls to his knees, a little confused because he really feels like crying, all of a sudden.</p>\n<p>Maybe he's just overwhelmed?</p>\n<p>His hand comes out, trembling, and he flinches when the unicorn screams, scrambling to get away from him.</p>\n<p>\"I'm sorry,\" he says, and isn't too surprised that he means it. \"So sorry, I just—<em>fuck</em>.\"</p>\n<p>It's probably not normal to apologize to the enraged beast that wanted you dead mere minutes ago. But Stiles isn't normal. He's also pretty sure that the unicorn is staring back at him now with something that looks like understanding. Like it <em>understands</em> that he had to do what he had to do, even if it doesn't necessarily like that he had to do it.</p>\n<p>He shouldn't be surprised, though—hadn't Danny said unicorns could speak about a thousand different languages? Maybe, now that it's dying, it's not rogue anymore.</p>\n<p>Which is really horrible and unfair.</p>\n<p>His hand comes out again, and he strokes at the unicorn's flank with trembling fingers.</p>\n<p>\"I'm sorry,\" he says again, and he doesn't imagine when it nods back at him, a hot breath of air hitting his knee. \"I'll… I'll stay with you, I guess. If that's all right. Or, if you—\"</p>\n<p>It blinks up at him, eyes already half-mast, nods again, movements slow and lethargic.</p>\n<p>He stays there, kneeling next to the unicorn's head, for what seems like eons. He stays there until it's not breathing anymore, until its eyes flutter closed and stay that way. He maybe breaks down and starts sobbing.</p>\n<p>Maybe.</p>\n<p>And then he's pretty sure he gets into kind of a daze, because he's suddenly on his back, staring up at the cloudless sky overhead, lying next to a dead unicorn, and his phone is buzzing in his pocket.</p>\n<p>Numb, he fumbles with it until he can squint at the screen.</p>\n<p>It's Scott.</p>\n<p>\"Hey,\" he croaks out a greeting when he finally manages to make his fingers work and answers it. There's a sharp intake of breath from the other side, and then a lot of rustling and shouts and panicked growls. \"I killed it.\"</p>\n<p>There's silence, after that. Which is good. Stiles likes silence.</p>\n<p>Or, wait, no he doesn't.</p>\n<p>Crap, he's confused.</p>\n<p>\"I killed it,\" he says again, and this time his voice cracks. \"And, uh, I don't… know where I am, Scott. And I'm pretty sure I stole my dad's cruiser, so could you get someone to return it to the house, for me? The keys are in the ignition… it's unlocked. And—\"</p>\n<p>\"<em>Stiles!\"</em> Derek snarls from the other side. Behind him, he can hear the others talking in high-pitched, panicked voices. \"Where are you? Are you injured? We can't—you disappea—\"</p>\n<p>\"I don't know.\" He glances over at the unicorn—still dead. \"My phone has GPS, though.\"</p>\n<p>\"Stiles…\" Derek sighs.</p>\n<p>\"I don't think I'm in Beacon Hills,\" he says. \"The forest is different.\"</p>\n<p>\"We'll find you.\" Derek growls.</p>\n<p>\"Yeah, well, it's not like I'm going to be moving any time soon.\" Stiles sniffs, groans as he pulls himself to sit. \"How are your—\"</p>\n<p>He can hear Derek moving, so he must have him on speaker phone.</p>\n<p>\"I'm fine.\"</p>\n<p>\"You're lying.\" He sighs. \"Erica, he's lying, isn't he?\"</p>\n<p>\"Ye—I mean, no, he's fine,\" Erica says.</p>\n<p>\"Fine as in walking around with a set of broken ribs and leg? Yeah, right. <em>Sure</em>.\"</p>\n<p>\"I was handling it before you came.\" Ouch. Derek's voice is cold and angry.</p>\n<p>\"Obviously, you weren't,\" Stiles can do cold and angry. He can do mean. He's a killer now, he can do anything, right? \"because it took a human to kill it, you fucking asshead.\"</p>\n<p>He hangs up, then, because he doesn't need to be on the phone for them to find him, and, really, right now he's not up to trading barbs. Not with anyone. Right now he just wants… silence.</p>\n<p>And if silence means ignoring the buzzing of his phone every ten minutes, well, Stiles is nothing if not persistent when he wants to ignore something.</p>\n<p>He slides himself backward until he's leaning up against a tree, maybe twenty feet away from the…body, and he just sits there. He's calm, surprisingly. No, that's not right. He's <em>too</em> calm. He's numb.</p>\n<p>The kind of numb that means later, maybe hours, maybe days, maybe months, later, he's going to remember this, and he's going to panic. His throat is going to close up and his chest is going to hurt and his vision is going to…</p>\n<p>Yeah, well, that's not going to happen. Not yet. At least for now, he's calm. Numb. Whatever.</p>\n<p>He's pretty sure he blacks out again, because when he wakes up, it's late afternoon, there's the smell of death and rotting blood in the air, and something is crashing through the woods, headed straight towards him. No, not something. Some <em>things</em>.</p>\n<p>He knows who it is before he sees them, and plasters a smile on his face, the kind that he hopes says <em>hey guys, I'm great…nothing to see here. No need to worry, really</em>. Except it probably doesn't, because when they stop, maybe ten feet away, all of them (well, Boyd, Isaac, Scott, and Derek are here, he doesn't know where the others are) just kind of…stare. At him. And then at the unicorn. And then back at him.</p>\n<p>Isaac whimpers.</p>\n<p>Then Scott's pulling him to his feet and crushing him in a hug.</p>\n<p>\"Holy shit, dude.\" Scott hits him over the head. \"You're a badass. And an idiot.\"</p>\n<p>Derek is looking at him all pinched-like. Stiles resists the temptation to stick his tongue out.</p>\n<p>\"Dad's car?\"</p>\n<p>\"Jackson drove it back,\" Boyd says, walking over to look down at the unicorn. His nose wrinkles. \"It smells like death.\"</p>\n<p>\"<em>You</em> smell like death.\" Scott punches his arm, and Stiles raises his eyebrows at him.</p>\n<p>\"Scott, you take Stiles to the apartment. We'll take care of… this,\" Derek growls. Stiles glares at him. He doesn't know why they're angry at each other, but he's not missing the opportunity to show his anger. Even if he doesn't know why he's angry.</p>\n<p>… it's the principle of the thing, really.</p>\n<p>\"I need Deaton.\" Stiles tries to move, winces at the pain. \"Then I'm going <em>home</em>.\"</p>\n<p>\"Sti—\" Scott grimaces, shakes his head at him. He ignores the looks Boyd and Isaac are giving him.</p>\n<p>\"Are you going to carry me or what?\" he asks. \"I don't think I can walk very well on my own. I probably re-sprained my ankle. Or broke it. Either way, hurts like hell.\"</p>\n<p>\"Take him, Scott,\" Derek growls.</p>\n<p>Stiles <em>does </em>stick his tongue out this time, and lets Scott piggy-back him all the way back to the car.</p>\n<p>Turns out they're three towns and a two hour's drive over from Beacon Hills.</p>\n<p>Stiles decides not to think about what would've happened if he hadn't killed the unicorn. Instead, he rests his head on the leather seat, and stares up at the sky while Scott rambles.</p>\n<p>\"You know you're grounded, right, son?\" The sheriff says when he opens the front door, moving out of the way as Scott helps Stiles limp inside the house.</p>\n<p>\"At least two weeks, I hope.\" Stiles doesn't want to leave his room. He doesn't want to leave his <em>bed</em>. He just wants to shower—he had washed off some of the blood back at Deaton's (and there had been <em>a lot</em>), but his clothes are still covered with the stuff—and get in his bed, and sleep for a very long time. A <em>very</em> long time.</p>\n<p>\"I'm thinking three.\" The sheriff grabs hold of his other arm. \"You stole my <em>patrol car</em>, Stiles. And you look like you were jumped by a gang.\"</p>\n<p>\"Ugh, don't remind me.\" Stiles maybe leans into his dad's hold a little more than he needs to. \"Or, remind me all you want, just after I sleep for two days.\" They come to a stop at the bottom of the stairs, and Stiles is just about to lift up his leg to the first step with Scott picks him up.</p>\n<p>\"Deaton said you weren't concussed,\" Scott grunts. \"So that's fine. The sleeping. Just make sure to keep your bandages dry this time. And, Mr. Stilinski, I have some, uh, medication in the car that Deaton told me to—\"</p>\n<p>\"Just tell me what to do, Scott.\" The sheriff holds open the bathroom door as Scott maneuvers Stiles so his head doesn't hit the frame, then sets him down to lean against the sink. \"I'll be home all tomorrow, so—\"</p>\n<p>\"Oh man, are we going to have a <em>talk</em>?\" Stiles whines, already trying to get out of his shirt. He's going to burn these clothes. Or tear them up. Or something equally dramatic.</p>\n<p>\"Yes. After you shower and sleep.\" The sheriff eyes him, then goes to lift his shirt over his head. \"<em>Christ</em>, Stiles. You look like—\"</p>\n<p>\"—I got jumped by a gang, got it.\" Stiles shrugs the shirt off, looks at Scott and his dad. \"I can, uh, do this alone, if you two would—\"</p>\n<p>\"You can't get your hands wet. Or your ankle. Or your knee. \" Scott points at his hands, newly wrapped. \"Deaton gave me some plastic wrap to wrap around them for you, so I'll get them from the-\"</p>\n<p>\"Yes, great. <em>Go</em>.\" Stiles shoos him out, looks at his dad. \"You really don't need to be in here for this. It's just going to be lots of screaming and sobbing.\"</p>\n<p>\"Hilarious, Stiles, really.\" The sheriff eyes him. \"I already got your bed ready for you—\"</p>\n<p>\"Aww, you're so awesome.\"</p>\n<p>\"Shut up. You're staying home Monday and Tuesday—you're back to school on Wednesday, and curfew is now set at nine.\"</p>\n<p>\"I really don't have a problem with that.\" Stiles really doesn't. He's not going to be much use to anyone for at least a month, anyway—his body is sore and sprained and bruised. Plus he's so <em>tired</em>.</p>\n<p>\"Yeah, well…\" The sheriff sighs, then, and seems to give up. \"I'll be downstairs, Stiles.\"</p>\n<p>\"You're hovering, Scott,\" Stiles drawls, a little less than an hour later, lying on his bed, laptop on his stomach. He's clean, if a little emotionally scarred from having Scott stay with him in the bathroom while he showered, and exhausted. And Scott is hovering. Sitting at his desk, looking at him with raised eyebrows.</p>\n<p>\"I'm allowed to hover. My best friend almost got killed by a fricken' unicorn, dude.\" He smiles. \"You remember back when we were still dealing with the kanima crap? You told me you couldn't do the things I do?\"</p>\n<p>\"Oh god, are we being nostalgic?\" Stiles groans, starts perusing the new releases on Netflix. At least his pointer finger isn't broken. It's the little things, really. He needs, like, a comedy or an indie or something. Nothing depressing. Nothing with explosions or blood or running. \"I don't think I have the energy, Scott.\"</p>\n<p>\"Hey, I'm being serious here.\" Scott chucks a paperclip at him, aims a little bit too high, and they both watch it bounce off the opposite wall. At least Scott looks sheepish. \"You don't <em>need</em> to be a werewolf, Stiles, you're kind of badass enough already. I mean, shit, you <em>saved</em> Derek <em>and</em> killed the thing. <em>Alone</em>. That… that's more than I could do as a human.\"</p>\n<p>\"You're making me tear up here, Scott.\" Stiles is pretty sure they've had this conversation before. Doesn't mean he's going to complain about the ego boost it gives him.</p>\n<p>\"Yeah, well, go to sleep, dipshit.\"</p>\n<p>\"I'm so tired I can't sleep.\" Stiles gestures at his laptop. \"Pick one: Wilfred marathon or White Collar marathon?\"</p>\n<p>\"Wilfred, all the way, dude. Why would you watch White Collar? It's boring.\"</p>\n<p>Stiles shrugs. \"Neal's hot.\"</p>\n<p>\"… aren't you a <em>thing</em> with Derek, now?\"</p>\n<p>\"I don't know. Plus, if I am, doesn't mean Neal's not hot.\" Stiles eyes him. \"Are we talking relationships now? I thought we weren't talking relationships.\"</p>\n<p>\"I'm just making an observation, asshead.\"</p>\n<p>\"As am I, wolf-boy.\"</p>\n<p>\"How come you have a boyfriend and I don't?\" Scott whines.</p>\n<p>\"I thought you weren't in to dudes. If you ask Isaac I'm pretty sure—\" Stiles grins when Scott throws another paperclip at him—it doesn't miss this time.</p>\n<p>\"I mean—\" He sighs. \"You know what I mean, Stiles.\"</p>\n<p>Of course Stiles know what Scott means. He's only ever thought of Allison. The dude is nothing if not optimistic. Or just crazy in love. Emphasis on the crazy part. But it's a good crazy. A hero kind of crazy.</p>\n<p>\"It…it's been, what, a year?\" Apparently they're discussing relationships now. Damn it.</p>\n<p>\"Yeah.\" Scott looks down at the floor. \"I thought it would be easy, ya know? Give her space, wait a couple of months… talk it out. But, it just…\"</p>\n<p>\"Hasn't happened?\" Stiles nods, clicks on the first episode of Wilfred, puts subtitles on and mutes it.</p>\n<p>\"Yeah.\"</p>\n<p>\"Maybe you should just go talk to her. You guys have English together, right?\" He looks up to see Scott staring, shrugs. \"When I talked to her… she seemed lonely, man. Maybe it would be nice to hang out again.\" He pauses. \"She also has some <em>amazing</em> bestiaries. Like. Top of the <em>line</em>. I want—\"</p>\n<p>\"I'm leaving. And you're not thinking about anything supernatural for at least a week. Derek's orders.\" Scott stands, makes a face. \"I can't believe I'm playing messenger for <em>Derek</em>, of all people.\"</p>\n<p>\"Aww, you like him, Scott. You're just jealous because he's better at the whole regally depressed hero thing.\"</p>\n<p>\"… sometimes I think you live in a different reality, Stiles.\"</p>\n<p>\"I do. It's better than yours. Now <em>leave</em>.\"</p>\n<p>Stiles doesn't get out of bed for a day— it's <em>awesome</em>. He spends Monday and Tuesday watching B-rated movies on Netflix and catching up on homework. On Wednesday, he only leaves the house because his dad practically shoves him in his car and drives him to school.</p>\n<p>He makes sure to mutter the entire way there, and maybe limps dramatically when he gets out of the car and walks over to where Scott and the others are waiting for him standing around Jackson's car.</p>\n<p>\"Derek's pissed at you,\" Erica greets. Jackson looks positively fucking gleeful, the douche.</p>\n<p>\"Good to see you too, Erica.\" Stiles limps—less dramatically, now that his dad is pulling out of the parking lot—over to lean on the bicycle rack next to Scott. \"Isn't Derek <em>always</em> pissed at me when I save his furry ass?\"</p>\n<p>\"… true.\" Isaac shifts to stand farther away from Jackson, who isn't paying attention, because he's too busy smelling Lydia's hair. Blurgh.</p>\n<p>\"No, he's different pissed,\" Boyd says. \"More… mopey than usual.\"</p>\n<p>\"… I don't understand.\" Stiles scrunches his nose up. \"How does Derek get <em>more</em> mopey?\"</p>\n<p>\"If anyone could do it, he could.\" Danny comes up from behind them, leaning against Jackson's car.</p>\n<p>\"You should probably talk to him,\" Scott says. \"He's coming to pick up—\"</p>\n<p>\"No.\" Lydia looks up from where she's been texting…someone. Stiles never really knows. Maybe she's on twitter or something. \"Don't go. Not today.\"</p>\n<p>\"Finally realized you're too good for liza—\" He grins, all teeth, when Jackson snarls at him.</p>\n<p>\"No. Don't go over until you're not covered in bruises and bandages.\" They all stare at her until she shrugs. \"Having sex around bandages is awkward.\"</p>\n<p>Someone starts choking—it's either Danny or Scott. Or Isaac. Nope, all three. Erica looks interested. Boyd… does not. Then again, he has a natural poker face. Jackson has gone back to smelling Lydia's hair, so no reaction there. Stiles… well, Stiles remembers why he had a crush on Lydia for ten years. Because she's <em>smart</em>.</p>\n<p>\"Good point,\" Stiles says, just to get the others to start choking again. He's not disappointed.</p>\n<p>\"I know,\" Lydia says, then the bell rings, and he lets Boyd and Isaac escort him to anatomy because their classroom is right next to his.</p>\n<p>School is exhausting, as usual. Or, well, more than usual. He doesn't see anyone at lunch because he's stuck making up his AP calculus quiz. And when the day is finally over, his dad picks him up and drops him off at home with threats of violence if he even thinks about leaving the house.</p>\n<p>He takes three ibuprofen, does his homework, and collapses in bed before eight.</p>\n<p>The entire week pretty much goes like that. He hangs out with Scott and Isaac on Saturday, watches some weird ass indie flick when Erica and Boyd and Danny come over on Sunday, and doesn't even contemplate texting Derek.</p>\n<p>Okay, he does. He even contemplates driving to Derek's apartment when he gets his jeep back on Monday, but he doesn't. Because he has discipline. And Derek is being an asshead.</p>\n<p>Seriously, who gets pissed at someone for saving their life?</p>\n<p>Derek, that's who.</p>\n<p>It's Tuesday—during English, because Mrs. Lee is more monotone than usual, and Stiles needs <em>something</em> to keep himself from jumping out the window—when he decides that he's had enough of the silent treatment. Also, his injuries are all pretty much healed.</p>\n<p>Or, well, at least the bandages are gone.</p>\n<p>So when school ends, he hops in his jeep, drives to Derek's apartment, grabs the last guest parking space, and jogs to the elevator before he loses his nerve. It's a good thing Derek had given them all access fobs a couple of months ago, because he's pretty sure that if he had to call up to be let in, Derek would just ignore him. As it is, he's probably going to ignore him anyway, but at least he can annoy him with his presence.</p>\n<p>Stiles is pretty sure his addiction to annoying Derek is what got him all hot and bothered for the dude in the first place. Well, that and Derek's predilection with not wearing a shirt.</p>\n<p>Anyway, Derek isn't home when he opens the door, which is actually good thing, he guesses, so he stations himself at the living room coffee table, sends a text to tell the others where he is, and then gets out his laptop and starts his homework.</p>\n<p>What? Stiles is nothing if not efficient.</p>\n<p>Well, when he wants to be.</p>\n<p>He's in the middle of wondering why he registered for AP calculus in the first place when Derek opens the door and walks in. No, he <em>slams </em>the door open and <em>stalks </em>in. Of course he does. It's Derek. Pissed off Derek. Although, the bags of groceries in his hands take away from the image a little bit.</p>\n<p>\"Stiles,\" he greets, \"get out.\"</p>\n<p>\"No.\" Stiles grins, turns back to pretend to do his homework, even though he knows he won't be able to concentrate. Derek can probably hear how fast his heartbeat is, but that's never stopped Stiles from acting like he's not nervous before.</p>\n<p>\"Stiles.\"</p>\n<p>\"Derek.\"</p>\n<p>\"Why are you—nevermind,\" Derek growls, slams the door shut, and stomps over to the kitchen, where he starts putting away the groceries. Angrily. It's kind of hilarious.</p>\n<p>Usually, Stiles would start talking. He would annoy and bug until Derek was forced to either talk back or go insane. But right now, he's pretty sure that would get his fob confiscated. And Stiles likes having access to Derek's apartment. If he didn't he wouldn't be able to do stuff like this. So, instead, Stiles goes back to his homework. Or, well, he goes back to trying to remember why he signed up for AP calculus when he's never going to use it anyway.</p>\n<p>Mostly he just ends up doodling all over his notes.</p>\n<p>\"Why are you here, Stiles?\" Derek finally asks, maybe ten minutes later. He leans against the arm of one of the living room chairs, glaring down at him.</p>\n<p>\"Homework.\" Stiles looks up at him, leans back against the sofa. \"It needed doing.\"</p>\n<p>\"You—\"</p>\n<p>\"And I came to apologize.\" Stiles grins when Derek blinks at him, slow and surprised, but then the dark, brooding eyebrows and the red, glinting eyes are back.</p>\n<p>\"You don't get to—\"</p>\n<p>\"I wasn't thinking, and I was angry at you for leaving me alone, so I just acted on impulse. I should've stayed with you when the unicorn started ya know, <em>sparkling</em>, but I just…\" Stiles shrugs. \"I didn't think. And I'm sorry.\"</p>\n<p>Derek stares at him for a long while. It—the stare—reminds him of the first time they had met, back in the woods after Scott had first been bitten. It's wary and angry and a little bit of something else. Confusion, maybe. Stiles stares back.</p>\n<p>\"You could've been killed,\" Derek says, a little later. Okay, a <em>while </em>later. Shit, the man could win the Olympic gold for intense staring. Stiles blinks, nods, picks at the frayed cuff of his jeans.</p>\n<p>\"I didn't die, though,\" he points out, remembering blood and fear and the sound of the unicorn's last, wheezing breath.</p>\n<p>\"But you <em>could have</em>, Stiles,\" Derek growls at him. \"You can't—I don't… I can't handle another—\"</p>\n<p>Stiles gets it then, and he winces. Of course Derek is mad at him. \"I'm sorry,\" he says again. He can't promise he won't be in danger again, and he can't promise he won't be impulsive again. So… an apology will have to do. \"I did take care of myself, though, Derek. I mean—\"</p>\n<p>\"I know.\"</p>\n<p>\"<em>And</em>, in the scheme of things, you were the one that got injured more than I did. Maybe I should be angry at you—\"</p>\n<p>\"—I'm a werewolf, Stiles. We <em>heal</em>. You <em>don't</em>.\"</p>\n<p>Stiles shows off his un-bandaged hands. \"Uh, yeah I do. Just slower than you. Plus, that doesn't mean you get to act like it's nothing when you're <em>crushed</em>. I was covered in your blood, Derek. A <em>lot </em>of it. More than usual.\"</p>\n<p>\"I healed.\"</p>\n<p>\"Yeah, you did. But --\" Stiles sighs, scratches the back of his head. \"-- that doesn't mean—and shit I swear we've had this conversation before, dude—that you have to get injured <em>all the fucking time</em>.\"</p>\n<p>\"It's not like I <em>try</em> to get injured all the time, Stiles,\" Derek says. \"Unlike you.\"</p>\n<p>\"I don't <em>try</em> to get injured, either!\" Stiles shrugs. \"It just happens. I'm human. Our injuries last longer.\"</p>\n<p>\"So you should <em>listen</em> when someone tells you to <em>stay put</em>.\"</p>\n<p>\"Ha!\" Stiles smirks. \"Hell no, dude. You should know better. Telling me to stay out of something pretty much guarantees the opposite.\"</p>\n<p>\"You're ridiculous.\" Derek shakes his head at him, walks back over to the kitchen.</p>\n<p>\"<em>You're</em> ridiculous.\" Stiles crawls up to sit on the couch, watches as Derek opens the fridge. \"Get me a drink.\"</p>\n<p>\"Get yourself a drink.\" Derek grabs a bottle of water, makes a point of slamming the fridge closed.</p>\n<p>\"Are we good, though?\" Stiles gets up, walks over to the fridge and gets himself a coke. \"Because I kind of like hanging out with you.\" He takes a swig, eyes Derek over the can for a moment. \"Also, are we gonna make out again, or is that over?\"</p>\n<p>He doesn't laugh when Derek spits out the water he had been attempting to swallow, but he wants to. Instead, he walks back over to sit at the coffee table, and starts his homework…again. Or, tries to. Fuck, he needs a study session with Lydia or something.</p>\n<p>\"I—\" Derek sounds like he's choking.</p>\n<p>\"It's, uh, okay if you don't want to.\" Stiles keeps his eyes on his notes in front of him, and maybe his pen is pressing a little too hard into the paper. \"I mean, if that's why you were avoiding me, and not because you were angry…\"</p>\n<p>\"That's not it.\" Derek comes over, falls back on one of the chairs facing Stiles. He sighs when Stiles doesn't talk, looks around the room for a bit, then sighs again. \"I was angry.\"</p>\n<p>Stiles nods, ducks his head so Derek doesn't see his cheeks turning red.</p>\n<p>\"Cool.\" He clears his throat. \"So, are you still angry?\"</p>\n<p>\"Yes.\"</p>\n<p>Stiles closes his notes and leans his elbows back to rest on the sofa cushions. \"Like how angry? Angry enough that you're going to avoid me for another two weeks? Or just angry enough for makeup sex?\"</p>\n<p>Derek gives him his wide-eyed, deer-in-headlights look, and Stiles watches his Adam's apple bob as he swallows. Fuck, that's a turn on. And it's not even a weird turn on. Now he's imagining how Derek had looked, back…what, had it been a week ago? He's imagining what he had looked like a week ago, tongue laving at his chest and his stomach. He's imagining what Derek's mouth would look like around his dick.</p>\n<p>\"That's cheating.\" Derek's nostrils are flared, and his eyes are glowing red. Stiles shrugs.</p>\n<p>\"Doesn't mean you have to do anything about it if you don't want to.\" He gets up, starts shoving his homework in his bag—just in case it turns out Derek <em>doesn't </em>want him and he has to leave quick.</p>\n<p>\"I want to,\" Derek says, just as he's zipping up his bag. Stiles freezes, and places his bag, carefully, slowly, on the couch.</p>\n<p>\"Oh,\" is all he manages to say. He actually never thought that Derek would…well, crap. Talk about situations escalating quickly.</p>\n<p>\"Or,\" Derek says. Stiles glances up from where his eyes have been glued to the coffee table. \"If you were just joki—\"</p>\n<p>\"No!\" Stiles shakes his head a little too hard. \"I wasn't joking.\"</p>\n<p>\"Oh.\"</p>\n<p>\"Yeah.\" Stiles is pretty sure they're at a standstill. Because of course they would be. It's not like Stiles could ever, you know, <em>not </em>be awkward.</p>\n<p>They stare at each for a while, and then Stiles realizes nothing is going to happen if he doesn't start it. He's pretty sure the constipated expression Derek has on his face is nerves, not anger. It's kind of heady, actually, that he makes Derek nervous.</p>\n<p>Heady, and <em>hot</em>.</p>\n<p>Stiles gets up and walks over to sit on the coffee table in front of Derek's chair. He starts fidgeting, then, because he doesn't really know what to say or <em>do</em> that's going to make this situation any less awkward. Derek is still just…staring at him. That's not new. The intensity is newish, though, and it's making him re-think himself. Re-think if he's up for… this.</p>\n<p>\"Stiles,\" Derek says, and Stiles feels goose bumps break out on his arms.</p>\n<p>\"Yup,\" he croaks out, meeting Derek's eyes and finding them half-mast and glowing red. He's pretty sure this is going to devolve into them just staring silently at each other for hours until Isaac bursts in or something. Unless one of them does something. As it is, Derek kind of looks frozen.</p>\n<p>So, it has to be him. Because, shit, he wants this. Last week hadn't been enough. Last week had been the tip of the fucking iceberg, and Stiles wants the whole fuckin' thing. Wants the whole fuckin' thing in multiple positions, in various rooms, and really, anything Derek will say yes to.</p>\n<p>He's pretty sure some of that desperation is because he's a seventeen year old virgin, but most is because this is <em>Derek</em>.</p>\n<p>He gets up, standing just long enough to think it's strange looking down on Derek from so close, and then he leans down, takes a breath to steady himself, and presses his lips to Derek's.</p>\n<p>Someone moans—he's pretty sure it's both of them, actually—and suddenly he's being pulled to straddle Derek's lap, and Derek's tongue is in his mouth, and his hands are under his shirt and kneading into the skin of his back.</p>\n<p>\"<em>Finally,</em>\" he mutters, smoothing his hands over Derek's shoulders and into his hair. Derek snorts and dips his head to nip at Stiles' neck.</p>\n<p>They kiss. Or make out. Or whatever. There's a lot of petting and enthusiastic grinding of pelvises and tongues against tongues and various sounds of approval and arousal. Stiles doesn't really concentrate on the specifics, mostly because he's unable to. Derek is frying his brain. Frying his brain in the best way possible, and, yup, he's pretty sure he's addicted.</p>\n<p>He's addicted to the way Derek's hands are soft and firm, and how they press hard against his skin and linger over his muscles. He's addicted to how the kisses change from demanding to teasing to filthy and open-mouthed and <em>hot </em>and then back again. He's addicted to the way Derek's hips cant up, probably involuntarily, every time Stiles lets out a moan or a whimper (which, uh, happens a lot, actually). He's addicted—crap, he's getting poetic now, isn't he?</p>\n<p>\"<em>Derek</em>,\" he moans. \"this is—mmmnnh-great and all—but could we—\"</p>\n<p>\"Bed?\" Derek cuts him off, his voice breathless and low and…yeah, okay, Stiles is never going to admit that he almost came in his pants from that. Nope, never. He shudders, dropping his forehead to Derek's shoulder.</p>\n<p>\"<em>Yes,</em>\" Stiles grits out, slides off Derek's lap and pulls him up after him.</p>\n<p>The journey to the bedroom is slow and hot and <em>awesome</em> because Derek keeps pushing Stiles up against whatever wall they're nearest to and kissing him until his jeans are tight (<em>tighter)</em> and painful (<em>more </em>painful) against his dick and he can't breathe, let alone think. Eventually, though, his back bounces on a plush mattress, and Derek's weight presses him in further, his fingers working at the buttons of Stiles' jeans, his mouth fast and desperate and messy over Stiles'.</p>\n<p>\"Come <em>on,</em>\" Stiles hears himself say, past the fuzzy daze of arousal that's making his fingers clumsy as he tries to push Derek's shirt over his shoulders. \"Too many clothes.\"</p>\n<p>Derek groans a response, something low and throaty that sounds like <em>fuck</em>, but Stiles doesn't hear it so much as feel it, because his jeans and boxers have disappeared, and clawed fingers are dragging up his flanks, taking his shirt with them, and he's focused on the feeling of bare chest against his. Stiles isn't sure whether he should be angry because he's more naked than Derek, or turned on because Derek is looking at him like he's—</p>\n<p>\"<em>Fuck</em>, Stiles.\" Derek noses at his stomach, pressing hot, open-mouthed kisses to the skin, and Stiles bites at his forearm, whimpers as Derek presses his jeaned-covered thigh in between his legs. \"You're—\"</p>\n<p>\"Clothes,\" Stiles manages, gestures towards Derek when all he does is looked confused. \"<em>Your</em> clothes, for fuck's sake, Derek.\" He pushes up, grabs at Derek's shirt that's rucked up over his shoulders and tears it off, then starts working on his jeans again, although it's a little distracting when his dick keeps getting in the way. The fifth time he somehow grabs at <em>it</em> instead of Derek's zipper, he gives up and flops back down to his back with a sigh. \"Can we just have sex with your jeans on?\"</p>\n<p>\"You're an idiot.\" Derek grins though, wide and…wolfish, leans to one side, and slides out of his jeans, and his briefs and…yeah, that's a nice cock.</p>\n<p>\"You're the one that—oh <em>fuck</em>.\" He bites his tongue when Derek's hand closes around their dicks, narrows his eyes when Derek starts working it up and down. <em>God</em>, that feels amazing, but…\"No, wait. Derek—\"</p>\n<p>Derek freezes, eyes going wide as he tries to scramble away. \"What? You don't—\"</p>\n<p>\"We've <em>done</em> this already,\" he says, starts laughing when Derek's eyes go even wider, and his hands, grip at Stiles thighs <em>hard</em>. \"I want—\"</p>\n<p>\"We don't need to, Stiles,\" Derek croaks. \"If you're not sure. If you—\"</p>\n<p>Stiles sighs. \"You're going to make me say it, aren't you? Seriously?\"</p>\n<p>\"What?\" Derek says, but his expression tells Stiles he already knows <em>exactly </em>what Stiles is going to say.</p>\n<p>\"I want <em>you</em>,\" Stiles tries to make his voice low and growly and… it <em>kind of</em> works, \"to fuck <em>me</em>.\"</p>\n<p>\"<em>Fuck</em>.\" Derek swallows, looks down at the sheets while Stiles watches Derek's cock harden and leak pre-come. Fuck <em>yes</em>.</p>\n<p>\"You've got—?\" Stiles nods his head towards the nightstand.</p>\n<p>\"Yes.\" When Derek meets his eyes again, they're hard and intense and, so fucking <em>hot</em>. \"Are you sure?\"</p>\n<p>\"Are you?\"</p>\n<p>There's a long pause, during which Derek just looks at him with that same stare. The sad thing is that his cock doesn't get any less hard. If anything, it gets <em>harder</em>, just because of the anticipation. Maybe Derek puts off, like, werewolf pheromones just for him. Ones that make anything and everything a turn on. Or, well, that could just be Stiles being a horn-dog. Whatever.</p>\n<p>\"Yes,\" Derek finally says. When he doesn't move, Stiles realizes he's waiting for a response.</p>\n<p>\"What do you think, asshole?\" And then he grabs at Derek's shoulders, pulls him down, groaning at the feel of naked skin against naked skin, and starts kissing him, grinding his dick up into Derek's thigh and wrapping one leg around his ass to get <em>closer</em>.</p>\n<p>Derek's hands are everywhere, pressing and kneading and ghosting along the few areas of Stiles' torso that are still tender. And then he's placing kisses at Stiles' jaw, leaving a trail of marks along his jugular and across his collar bone, nipping at Stiles' chest and watching, eyes dark and red and strangely enough, <em>content</em>, as he watches Stiles curse and arch up off the bed. He keeps going, lower and lower, and Stiles grabs at his hair and massages his scalp, babbling incoherently and probably making an idiot of himself.</p>\n<p>It seems to work for Derek, though, because he keeps at it. Keeps at it until he's licking a wet trail up Stiles' dick, one hand skimming down lower to trace right above Stiles' ass, the other hand on his own cock, stroking up and down in a rhythm that's making Stiles kind of crazy.</p>\n<p>Stiles pushes his hips up, wanting to get <em>closer</em>, much <em>closer</em>, and digs his nails into Derek's shoulders. His dick is leaking pre-come like crazy, there's an ache in his balls, and he's been about five seconds from coming for the last twenty minutes or so, but he needs Derek <em>in</em> him. Fuck, he wants it.</p>\n<p>\"<em>Derek.</em>\" He pulls his hair with one hand, gestures towards the nightstand with the other. \"Lube. Condom. <em>Come on</em>. \"</p>\n<p>Derek eyes him for a second, then leans over to reach the nightstand. He comes back to sit on his heels, already squeezing lube onto his fingers, and pulls Stiles until his ass is in the air—it's embarrassing until it's not, really—and his legs are spread open on either side of Derek's thighs.</p>\n<p>\"If you'd stop fucking staring and get <em>on</em> with it, already—<em>holy fuck</em>.\" Stiles keens—he wasn't even fucking aware he was <em>capable</em> of keening—when a lubed finger pushes in. Yeah, yeah, okay, this is happening. He's done this before, with his own fingers, but the angle is different, and the <em>finger</em> is different, and, oh wow, it's good. So good. The best kind of good, the—<em>oh</em>, and it's moving.</p>\n<p>Stiles bites at his lip and pushes back into Derek's finger, laughing when he hears Derek's cut off curses, only to moan when Derek's finger catches his prostate and he has to think of Coach Finstock so he won't come.</p>\n<p>Damn it, he'll forever be haunted by the dude.</p>\n<p>When Derek adds a second, and then a third, and then a fourth finger, Stiles is pretty sure he's going to go crazy. Not the good kind of crazy, either. The bad kind. With, you know, hallucinations and shit. And when there's suddenly nothing, and he opens his eyes—sometime during between the second and third finger, he found out it was easier not to come if he didn't see how dazed Derek looked, or how his dick was leaking pre-come all over Stiles' thigh, or how his eyes were flashing red and his canines were sharp—he sees Derek staring down at him, unopened condom wrapper in hand.</p>\n<p>\"I—\" Derek starts. \"Werewolves don't have knots.\"</p>\n<p>\"Y-yeah?\" Stiles is too mind-fucked (literally? Yeah, literally) to think of a good comeback for that one. \"Good for you, bud.\"</p>\n<p>\"We also don't get… diseases.\"</p>\n<p>\"No condom?\" Stiles asks, because he's pretty sure that's where this is going. And <em>fuck</em>, okay, he's good for that. He's great. That just sounds fucking awesome actually. Derek licks his lips, nods as he breathes into Stiles' knee. \"Okay.\"</p>\n<p>The condom is thrown across the room hard enough that it hits the opposite wall with a loud <em>snap</em>—Stiles catalogs that so he can make fun of Derek for it later—and then he feels Derek's dick pressing against him, and then it's pressing <em>in</em>.</p>\n<p>He's pretty sure he keens again. It's a manly keen, really.</p>\n<p>Derek pushes in slow, <em>too</em> slow, slow enough that Stiles can feel every inch as it slides against his insides. It hurts, yes, of course it does, but once Derek is all the way in, and his balls hit up against Stiles' ass, the pain turns into a dull pressure. It's a throbbing ache, hot and heavy, that slowly turns into pleasure, enough pleasure so that Stiles hear Derek murmuring nonsense against his knee over the rush of blood in his ears, his eyes squeezed shut and his breaths coming out hot and heavy against the skin of Stiles' thigh.</p>\n<p>They stay there, frozen, until Stiles gets fed up, and starts nudging Derek's back with his feet, pulling him forward and canting his hips up until little sparks of white pleasure start zipping through the ache. Derek groans at that, grabs Stiles' ass, and seems to get the message, because he starts thrusting in and out. Deep, thorough, agonizingly <em>good </em>thrusts that make Stiles' dick hard and hot and heavy again. Stiles grabs at it, pumping up and down in time with the movement of Derek's hips until the ache gets too much, turns into a white, hot, bright mix of pleasure and pain, and he's coming all over his chest and the bed.</p>\n<p>He's still in an orgasm induced daze when Derek whimpers, and then groans, and then <em>growls</em>, grabs his ass, and starts thrusting in hard and fast. His dick twitches, because of course it does, and he pushes back, arching up so that Derek slides along his prostate with each thrust in. He feels Derek's fingers skim around where they're connected, then he shudders, half collapsing to bite at Stiles' neck and nipples and stomach. He feels it, when Derek comes, and he…he likes it. It's a strange feeling. A strange <em>good</em> feeling. It's hot and dirty and <em>wet</em>and-</p>\n<p>\"<em>Fucking hell</em>, Stiles,\" Derek whines from where his face is smashed against Stiles' shoulder, almost lazily nipping at his skin. \"So good.\"</p>\n<p>\"Y-yeah.\" Stiles fidgets, just to feel where Derek is still in him, his hips pressed <em>hard</em> against Stiles, like he's trying to keep his come insi—<em>oh</em>. \"This is a… is this a werewolf thi—<em>fuck</em> that's hot.\"</p>\n<p>\"Just, let me,\" Derek's voice is amazing like this. Like it's broken. Pleading. Like he's <em>begging</em> Stiles. <em>Ugh</em>, Stiles is going to get hard again soon. \"Let me stay… in. Please.\"</p>\n<p>Stiles wraps his legs around Derek's torso, shifting so he's more comfortable, and pushes down on Derek's back with his heels. \"Yeah, yeah. It's good.\"</p>\n<p>Derek hums in the back of his throat, reaching up to kiss along Stiles' neck, nosing at his jugular and then just… staying there. His hands skim at Stiles' sides and when Stiles looks down, his eyes are closed and he has a blissed out smile on his face.</p>\n<p>Wow. Derek smiling is… yeah, that's some powerful stuff.</p>\n<p>Stiles brings his hand up and cards his fingers through Derek's sweat-damp hair, gulping when Derek presses his head into the touch and cants his hips forward, just enough so Stiles can feel that he's already—or is it still?—half hard.</p>\n<p>\"So...\" Stiles clears his throat. \"That was awesome.\"</p>\n<p>\"Yeah,\" Derek mumbles into his skin.</p>\n<p>\"Guess we're over the anger thing?\"</p>\n<p>\"Almost.\"</p>\n<p>\"I'd say that was a pretty spectacular loss of virginity, except I haven't fucked you yet.\" Ahh, now <em>that</em> gets a response, in the form of Derek's dick twitching where it's still inside Stiles, and Derek's head rearing up so he's looking at him with wide eyes. \"I mean, only if you're cool with that, and later, since, ya know, you're still—\"</p>\n<p>\"Yeah.\" Derek licks his lips, eyes roving over Stiles face. He must find something he likes, because he grins, and leans forward—that gets a gasp from Stiles, because, shit, that <em>angle</em>—to lick into his mouth. \"I know.\"</p>\n<p> </p>"
}