{
  "id": "546446",
  "url": "https://archiveofourown.org/works/546446?view_full_work=true",
  "author": [
    "Etharei"
  ],
  "title": "Hide Of A Life War",
  "rating": "Explicit",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Derek Hale",
    "Scott McCall (Teen Wolf)",
    "Erica Reyes",
    "Vernon Boyd",
    "Isaac Lahey",
    "Peter Hale"
  ],
  "additional_tags": [
    "Suspense",
    "Crimes & Criminals",
    "Hostage Situation",
    "Alpha Derek",
    "BAMF!Stiles",
    "Angst and Humor",
    "Family",
    "stilinkski feels",
    "Pack Family",
    "implied underage (past)",
    "Misunderstandings"
  ],
  "language": "English",
  "series": "",
  "published": "2012-10-26",
  "completed": null,
  "words": "26,105",
  "chapters": "1/1",
  "comments": "1,105",
  "kudos": "31,877",
  "bookmarks": "13,413",
  "hits": "708,850",
  "summary": "<p><i>“We have received confirmation that there is a hostage situation in progress at a warehouse compound two hours out of Los Angeles, following a multiple-vehicle pileup on Highway 101 this morning...”</i> </p>\n<p>The one in which Stiles has lived to (legal) adulthood and, along the way, become a bit of a badass himself.</p>",
  "notes": "<p>It has taken me two months to write this fic, most of which was spent angsting over <i>how long it was taking me to write this fic</i>. I mean, nothing wrong with two months, the story will take however long it damn well wants to take, I just hadn’t expected it to get quite so long or so involved.</p>\n<p>Accordingly, <b>a world of gratitude and love and baked goods to <a href=\"https://archiveofourown.org/users/xsilverdreamsx/pseuds/xsilverdreamsx\" rel=\"nofollow\">xsilverdreamsx</a></b>, who essentially held my hand and told me to keep writing this and then beta’d it for me once I filled in all my capslock placeholders. THANK YOU MY LOVE.</p>\n<p><b>Podfic:</b><br>+ There is now a podfic of this fic, thanks to a wonderful <a href=\"https://archiveofourown.org/users/lovetheboys/pseuds/lovetheboys\" rel=\"nofollow\">lovetheboys</a>! The link is at the end.</p>\n<p><b>Translations:</b><br>+ <a href=\"https://archiveofourown.org/users/bosia/pseuds/bosia\" rel=\"nofollow\">bosia</a> has kindly translated this story into Chinese <a href=\"http://m10forever.weebly.com/12304sterek12305hide-of-a-life-war.html\" rel=\"nofollow\">HERE</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I don’t actually know if there’s a Greyhound bus that goes from North California down to South, or if it goes on the 101 at all. I'm not entirely sure where Beacon Hills is supposed to be fictionally located? The only area in California I’m familiar with is Orange County, so apologies for any and all inaccuracies.</p>",
  "text": "<p></p>\n<p>\n<img src=\"https://78.media.tumblr.com/5357780740fe6bf16c0b5e6e0092097e/tumblr_messaging_pc4i39TzqC1ud3r1o_1280.jpg\" alt=\"Banner with black background and Stiles in a red hoodie\" width=\"400\"><br><i>Banner by <a href=\"https://faladrast.tumblr.com\" rel=\"nofollow\">faladrast</a></i>\n</p>\n<p></p>\n<p>\n<i>“We have received confirmation that there is a hostage situation in progress at a warehouse compound two hours out of Los Angeles, following a multiple-vehicle pileup on Highway 101 this morning...”</i>\n</p>\n<p>Rough hands grab him by his shirt. There are sirens, cops everywhere, there are <i>news helicopters</i>, and guns on all sides. Stiles sees his dad being taken, and that's it, he goes pliant, because no way is he letting anyone separate them. He thinks he confuses the guy holding him when he not only stops trying to get away but practically throws himself into their vigorously dented van after his dad. There's a lot of shouting and Stiles catches maybe one word out of ten, but it's enough for him to get a vague idea of the situation - he once reconstructed an ancient ritual from a single line of text in Ancient Latin, okay, operating under pressure is kind of his thing.</p>\n<p>In short: drug smugglers.</p>\n<p>Seriously. <i>Drug smugglers.</i></p>\n<p></p>\n<p>.</p>\n<p>- and follows it to waking.</p>\n<p>Metallic taste on his tongue. Hello, old friend. And with a lovely garnishing of dirt. </p>\n<p>Sound sweeps over him in a wavering tide: his own harsh breathing, somebody else huffing and speaking nearby, furious whispering elsewhere far away, sets of heavy footsteps that echo through the surface pressed against his face. Or his face is pressed against. He recognizes the cold hardness as concrete.</p>\n<p>He's alive. Which is a good start!</p>\n<p>He runs his tongue over his teeth. All present and accounted for. </p>\n<p>He's hurt. Definitely a-hurtin'. But this is neither new nor surprising.</p>\n<p>He opens his eyes. </p>\n<p>The first thing he sees is his father's face, anxious and hovering over him.</p>\n<p>\"Nyargh,\" he says.</p>\n<p>A warm hand settles on his shoulder. \"Stiles, stay down, stay down, they hit you pretty hard, we don't know how bad-\"</p>\n<p>\"Bruises,\" Stiles groans, \"Just. Lots and lots of bruises.\" He tries to push himself up, and has to bite down on his lip to keep from making a sound, or possibly throwing up; pain erupts in a firestorm all across his upper body, a swathe of sharp nasty sparks, burning up the breath in his lungs. The first flash is too intense for him to make out any specific injuries. He breathes deep, waits for the initial wave to die down; then shifts his shoulders, his arms, opening and closing his hands, working his way down his body. \"Nothing feels broken. I don't think. Well, something's off with my knee.\" </p>\n<p>Which means no running for long, probably, but he might be able to stand and fight.</p>\n<p>Familiar fingers brush over said knee, as if Dad is trying to magically make it better, like he'd done when Stiles was younger. Gravity had been Stiles' arch-nemesis, growing up. Still is, if he's honest; they've just brokered a truce that holds up 80% of the time. 60% on days that have a high volume of werewolves. Dad's touch is exactly as he remembers, which is comforting and heartbreaking at the same time, because it only makes Stiles aware of how so very far these hurts are from the kind that can be soothed away by hot cocoa and Batman bandaids.</p>\n<p>At least nothing seems to be openly bleeding; even the cuts and scrapes on his arms have scabbed over. He has a flash of worry about just how thoroughly Dad has checked him for injuries, but he's pretty sure Dad would have said something if he'd gotten a good look under Stiles' clothes.</p>\n<p>\"Anything happen while I was out?\" Stiles asks. </p>\n<p>He goes slower and actually achieves sitting. Dad's hand on his back, warm and solid, maybe helps a little.</p>\n<p>\"No. The guys guarding us walked the same rounds. A couple of helicopters passed over. I think more of their people arrived, I heard cars approaching and there was shouting outside right after they hauled you back here.\" Dad rubs a hand over his face. He looks <i>old</i>, worn down and haggard, and Stiles can't blame it on anything other than his own self. \"Damn it, Stiles, the police already know we're here. What was so important that you had to go and sneak off with a cell phone?\"</p>\n<p>He swallows. Pulls his face into a grin, which hurts, lets him know where the bruises-in-progress are; he keeps it up because he deserves the sting for saying, all flippancy, \"Baseball scores. Had to check if I've won a bet with Scott.\"</p>\n<p>There's an in-joke there, about baseball bats and the McCalls, that anyone sufficiently involved in Stiles' life would have picked up on.</p>\n<p>The look on Dad's face is almost worse than the pain in Stiles' body. It's not the first time Dad's stared at him as if seeing a stranger, but there's a new bleakness to it, like maybe he's starting to believe that they'd gone past the point of no return. </p>\n<p>Like he can't recognize Stiles at all, and he's <i>given up</i>.</p>\n<p>And the worst part, the <i>worst part</i>, is that Stiles knows his dad blames himself. Because the Sheriff is the parent who works long hours and isn't home much, who's had to sacrifice his personal life for his job; he doesn't know how deeply Stiles shares the blame, how much of the distance between them has been orchestrated by Stiles himself. </p>\n<p>Stiles wants to shout at him and hug him and tell him that it'll be okay, that he's still <i>Stiles</i>; he's just had to hide so much of himself these days that the bits his father does see aren't always the very best part of him. </p>\n<p>But they're in danger, and there are eight other people in danger with them. His main priority has to be getting everyone to safety. Personal crises would have to wait.</p>\n<p>This is but one lesson, among many, he's had to learn.</p>\n<p></p>\n<p>.</p>\n<p>\"Stiles.\" His dad's voice is soft, damn <i>concerned</i>, and this has always shut Stiles up more effectively than shouting and anger. \"I'm glad you have more friends now. Really, I am. For a long time, I was pretty sure it was going to be just you and Scott forever - which would have been fine, too - but it's good that you have other people looking out for you.\"</p>\n<p><i>You have no idea</i>, he wants to say, except he's pretty sure this the point Dad is gearing towards.</p>\n<p>\"I remember what it's like to be in high school,\" Dad continues, \"Everything feels huge and important; all your decisions seem like life-or-death. I get it, I do. But. I have no idea what's going on with you anymore. I'm lucky to see you every other day. You spend all your time with your friends. Don't think I don't know that you lie about staying over at Scott's. I went past the video store once and saw you inside with Boyd and Derek Hale, when you were supposed to have been at the McCall's.\"</p>\n<p>\"In my defence, Scott ditched me that night to hang out with Allison,\" Stiles grouses. He hadn't minded, though; it'd been a particularly chilly night in the middle of winter, but they'd set up something that Derek refused to admit was a blanket fort inside the abandoned train carriage, and popped a DVD into Erica's laptop, and Stiles had shamelessly cuddled up to Derek because werewolves generate so much more body heat, <i>duh</i>, while the betas bickered and hogged the popcorn.</p>\n<p>It's a good memory, happy, and of course just reminds him of how absolutely <i>shit</i> his day has been.</p>\n<p>Clearly, it's not done with him yet.</p>\n<p>Dad holds up his hand in a clear <i>let me finish</i> gesture. \"I'm not even going to bring up all the times you've shown up at crime scenes or came within a hair of getting arrested or came home with injuries you won't tell me about, because I'm tired of trying to ask you what's going and listening to you lie to me. You've gotten so good at it that I can't even tell anymore.\"</p>\n<p>A harsh breath escapes Stiles, and he has to look at the floor. Protecting his dad, keeping him away from the things with teeth and claws and magic that regularly decide to liven up Stiles' existence, has been a hard but necessary part of Stiles' life since Scott had been bitten. He's never liked it, but he's accepted it, sort of. </p>\n<p>\"You're a good kid.\" Dad reaches out, then hesitates, as if he's afraid Stiles will reject physical contact. <i>Stiles has made his dad hesitate to touch him,</i> he is the absolute <i>worst</i>. \"I've never doubted that. And I love you. That's never going to change, either. I just - I want you to <i>talk</i> to me again, Stiles. Please, tell me what's going on with you.\"</p>\n<p>God, this is the last thing he needed today. <i>The very last thing.</i> First Derek, then Scott, and now a reminder that he's a failure of a son who keeps hurting his dad. He's aware of a heat behind his eyes and a tightness in his throat, signalling possible tears in the very near future, and <i>no</i>, he can't handle that extra kick of humiliation on top of everything else.</p>\n<p>Dad sighs heavily when Stiles doesn't say anything, the hand on Stiles' shoulder dropping in defeat. This new show of disappointment shouldn't matter after so many others, but it's like salt on a wound, magnified, and Stiles has to duck his head to hide his face, forcing himself to take steady breaths. Shame and guilt and <i>failure</i> burn wretchedly in his gut. </p>\n<p>\"Okay.\" Dad runs a hand through his hair, clearly frustrated and upset and trying not to let on. \"I was pretty sure Plan A wouldn't work, which is why this little trip we're going on is Plan B. One week away, just you and me. Go pack your bags. Make sure you have enough clothes for at least seven days. We're leaving first thing tomorrow. I told the Department not to contact me even if the whole of Beacon Hills is on fire.\"</p>\n<p>Stiles nods numbly. He's turning towards the stairs when Dad stops him, hand grasping Stiles' shoulder again and gently pulling him in for a tight hug. There are bruises on Stiles' back, half from lacrosse and half from an unexpected encounter with a hunter's ATV, and Stiles doesn't even care that they hurt. </p>\n<p>\"We're going to get through this,\" Dad promises, \"You're my son and I love you and I'm never giving up on you. You hear that? <i>I'm never giving up on you</i>.\"</p>\n<p></p>\n<p>.</p>\n<p>There's something cathartic about watching some other poor bastards, fictional though they may be, getting their asses kicked and escaping death by the skin of their teeth.</p>\n<p>The thing is, when one of the cars chasing after the good guys careens into regular traffic, when one of the bad guys shoots at a crowd to clear a path, when the good guys jump out of their car or truck or motorcycle and the vehicle crashes off-screen in an impressively flammable fashion - nobody ever thinks about the collateral damage.</p>\n<p></p>\n<p>.</p>\n<p>The guy who's been guarding them for the last ten minutes - Stiles has mentally nicknamed him Bobcat because of his ragged haircut - doesn't look any more moved than the previous guy. </p>\n<p>On a mat made out of everybody's jackets and hoodies, which is the best alternative they'd been able to provide to the cold concrete floor, seven-year-old Patrick twitches and lets out a low moan of pain. His older sister is gripping his hand tight enough that it must be hurting them both. She's been quiet save for whispering Patrick's name. Stiles has no idea how she's managed to keep her composure; he'd be a sobbing mess, in her place.</p>\n<p>There's a long, deep, ugly gash down Patrick's left leg that hasn't stopped bleeding since the bus crash. He'd still been able to walk, at first, so it had been overlooked, but then Patrick had bled through the makeshift bandages and then became semi-delirious. </p>\n<p>Patrick's lips move, and Stiles just barely manages to catch the mumbled words, a mix of Spanish and English. He ignores the ache in his ribs and leans in close. \"<i>Abuela</i>? Is that where you guys are going?\" he asks gently. \"You're on your way to visit your grandma?\"</p>\n<p>His voice gets Patrick to open his eyes. A sweet brown gaze locks onto his, young and beseeching, and it reminds Stiles of Scott so strongly that he has to swallow hard and fight down a surge of protective anger; he thinks, grimly, <i>this boy is not dying here</i>. </p>\n<p>\"Hey,\" he says to the sister, \"you're Paula, right? Look at me.\" He waits until Paula meets his eyes. She must be around fourteen, but her fear and exhaustion are making her look older. <i>Ghost-like</i>. \"Help me talk to Patrick. He can hear us. I'm sure listening to your voice will make him feel better.\"</p>\n<p>She swallows tightly and nods.</p>\n<p>\"Okay, good.\" Talking, Stiles can do. Stiles is an expert at talking. \"Patrick said something about your grandma. Are you guys on your way to see her?\"</p>\n<p>Paula's voice is barely audible. \"Yes.\" She seems to gather herself, then, and adds, \"Mama wanted to come, but she couldn't take any time off work. It was okay, it <i>should</i> have been okay. We've made this trip before.\" On their own, her tone implies. Which probably isn't, like, legal, but Stiles nods sympathetically, because the stuff he's been doing since the age of sixteen puts him in no place to judge.</p>\n<p>\"They're both probably thinking about you guys right now, wondering if you're all right,\" Stiles says.</p>\n<p>There's a distinct clearing of a throat. Everybody looks up - Stiles realizes that he hadn't even noticed Nurse Karen drifting over to stand behind him - and there's Bobcat, holding out what looks to be a small suture kit.</p>\n<p>\"Oh, thank you, <i>thank you</i>,\" says Karen. She carefully takes the kit and opens it up on the floor next to the mat. </p>\n<p>The scissors had been removed; there's nothing sharp other than the sewing needle. Stiles gropes along his belt until he finds the tiny flashlight disguised as an ornamental keychain. He has a bigger one on his keyring, but that's in his backpack, which is in a garbage bag near the door where the smugglers had piled up everything they'd confiscated from the hostages. This one is better than nothing, though. He looks away before turning it on, hears people quietly cursing at the sudden light. He points the flashlight at the wound. The blood looks startlingly red under the extra illumination.</p>\n<p>\"Thanks,\" says Karen, looking surprised. \"Most people don't realize how much it helps to actually be able to see what you're doing.\" Karen lays out the various dressings and the iodine.</p>\n<p>Stiles shrugs; he's heard plenty of Deaton telling Derek to <i>stop blocking the light, you're being ridiculous</i> while patching up Stiles. Stiles casts a glance at Bobcat. The man is eyeing his flashlight suspiciously, but doesn't move to take it. </p>\n<p>Hey, maybe some drug smugglers have consciences. </p>\n<p>Stiles focuses on talking to Patrick and Paula. \"I'm not gonna lie, Patrick, this is going to hurt, but I'll try to give you something else to think about besides the pain, okay? Paula, can you tell me about your grandma? Does she live in LA?\"</p>\n<p>\"No,\" answers Paula. Stiles' flashlight makes her look a little more solid. Patrick lets out a pained noise when Karen dabs the iodine on his leg. Stiles nods encouragingly. Paula takes a deep breath and elaborates, \"Cerritos. But she meets us at LA. She lives with Uncle Andy and his family, because he has five kids and needs help looking after them.\"</p>\n<p>\"Wow, five kids,\" whistles Stiles. \"They must be fun to hang out with, right? Your cousins. Does your grandma do the cooking? I can't imagine having to make food for five kids.\"</p>\n<p></p>\n<p>.</p>\n<p>Then he looks to the side and sees his dad. He doesn't remember deciding to move, just his fingers pawing at Dad's neck. Dad stirs before Stiles can check his pulse, obviously alive, and Stiles maybe has to slump forward and breathe for a few minutes out of sheer, utter relief.</p>\n<p>\"Stiles?\" Dad mumbles.</p>\n<p>\"I'm here,\" Stiles says immediately. He coughs. \"I think - there's been accident. The bus hit something, maybe, and we need to get out, there might be a fire, so if you can wake up all the way <i>right now</i>, that would be really, really awesome.\"</p>\n<p>He can hear people shouting, their fellow passengers gradually coming to. Not all of them - he doesn't think the couple seated across from them will be getting up ever again, and there's a humanoid shape on the aisle floor that he's very carefully not looking at. Dad is alive, though, he can focus on that.</p>\n<p>\"Can you move?\" he asks.</p>\n<p>Dad grimaces, but slowly nods. \"I think so. Give me a second.\" Their seats are a lot closer together than they had been before, the metal wall next to Stiles distorted, and Dad has to do a bit of wiggling before he can extract himself. Stiles watches him carefully for signs of pain, but there's nothing notable, and Dad seems to be moving normally. Once Dad is up and out, Stiles is able to squeeze out of his window seat, and more or less fall into the aisle. </p>\n<p>\"Dad,\" Stiles says, taking in the mess of twisted metal and broken items that now make up the inside of the bus; it's a scene right out of every disaster movie he's ever watched. \"We've got to get people out of here.\" Dad nods.</p>\n<p>\"Attention, please!\" Dad shouts over the din. \"If you are able to move on your own, you need to get out of here as quickly as you can. There may be a fire under the bus and it is not safe to stay here. If you need help, please call out, and we'll come and get you.\"</p>\n<p>There's a predictable burst of voices, mostly passengers trying to locate one another, though there are a few questions directed at Dad. The most painful to hear are the shrieks and sobs when loved ones are found dead. But people are also getting up and moving towards the doors, and while most are bleeding in one way or another, a large percentage seem to be ambulatory.</p>\n<p>Stiles ends up helping a man whose leg is very probably broken. The man is his dad's age, grim-faced, his dark skin shiny with sweat. Stiles remembers nearly passing out from pain the last time he'd broken his leg, he can't imagine trying to <i>walk</i> with it, but the guy lets Stiles sling one arm over his shoulder and only grunts a few times during the awkward shuffle towards the front door. Getting down the steps is trickier, but Stiles finds plenty of hands reaching up to help, the passengers with minor injuries lingering around the door or even climbing back inside to lend Dad a hand. Stiles passes the man to someone else, and then takes the chance to slip back to their seats and grab his backpack. </p>\n<p>Outside, the fire is not as bad as Stiles had been afraid of. He doubts there will be any movie-worthy explosions, but he doesn't relax until Dad comes out and says that there's no one alive left inside the wreck of the bus. Which means Dad had had to check all the bodies. This is confirmed when a woman who'd been helping Dad identifies herself as a nurse and explains that she'd gone over the bodies as well. It occurs to Stiles that it would have been useful to have one of the werewolves here, to listen for heartbeats and to help shift twisted metal.</p>\n<p>Then again, when he sees the way the other passengers gather around Dad, and Broken-Leg Man claps Dad on the shoulder and tells him, \"Your son's a good kid, steady as a rock, you should be proud,\" and Dad looks over at Stiles and they just nod, together, taking pride in each other and in-sync in a way they haven't been in a long, long time - Stiles realizes that they do just fine. </p>\n<p>Who needs werewolves, anyway? Stilinskis totally kick ass without them.</p>\n<p>Dad eyes Stiles' bag and says, \"Really?\" in the exact same tone as when he'd first seen what Stiles wanted to bring along on their trip.</p>\n<p>Stiles shrugs and checks that his lacrosse stick is still securely attached to his backpack. \"As you so often tell me, these sticks ain't cheap.\"</p>\n<p>The road around the bus is littered with debris, and there are a handful of vehicles in varying degrees of crumpledness scattered over the asphalt. It's a setting that makes someone half-expect a zombie horde to come shuffling around the bend. Dad's just starting to lead everyone away from the bus, towards the side of the road in case other cars come barrelling down highway, when Stiles catches movement from an overturned van. </p>\n<p>He knows what it means when someone is crouching behind a barrier like that, when someone reaches down and, surprise, comes up with a gun.</p>\n<p>A gun that’s pointed right at the bus.</p>\n<p>\"<i>Get down!</i>\" yells Stiles. The voice of authority, he distantly thinks with gratitude, as the group of passengers immediately drop down just before something whistles right over their heads and punches through the metal wall of the bus.</p>\n<p></p>\n<p>.</p>\n<p>Stiles' head snaps up from where he'd been slumped against the crate. Way to be subtle.</p>\n<p>One of the smugglers, dubbed by Stiles' brain as Jaws Boss, smirks down at them. Dad has pointed out that Jaws Boss seems to be some kind of leader, from the way he's been bossing all the other guys around. Right now the man seems to be trying to loom over them - yeah, totally not impressed, Stiles is well acquainted with damn <i>experts</i> in the art of looming.</p>\n<p>\"I am,\" Dad admits tersely after a moment.</p>\n<p>Stiles' brain immediately shouts <i>who told?</i> He barely stops himself from slanting a suspicious eye at their fellow hostages. He'd made Dad leave his badge behind at home, arguing that if they're supposed to be taking a break from their life in Beacon Hills, they shouldn't be bringing important aspects of that life with them. </p>\n<p>Then Stiles mentally checks himself, because he knows how easy it is to let information slip even if one doesn't mean to. Besides, Stiles had also agreed to leave his shit behind, and yet his backpack is definitely carrying more than just clothing; he's got to have inherited that mule-headedness from somewhere. </p>\n<p>Also, there are some things you can never truly walk away from, and some jobs you can never stop doing.</p>\n<p>\"That your kid?\" Jaws Boss jerks his head at Stiles.</p>\n<p>\"He's my son, yes.\"</p>\n<p>\"Already makin' trouble, I hear.\" Jaws Boss narrows his eyes, leans down to peer at Stiles' bruised face. \"I know your type. Daddy's the big gun in town, so you think you can get away with shit. You think you're so smart. You should see your face right now. Should be careful, that skin of yours bruises something nice. I bet you'd make a pretty bitch for someone, wouldn't you?\"</p>\n<p>Stiles doesn't need to look at his dad to get the <i>don't say anything!</i> warning loud and clear. He forces himself to look down, to look cowed, instead of glaring at the guy or running his mouth off like he wants to.</p>\n<p>It's weird - he's used to being the most vulnerable one, the most breakable.</p>\n<p>\"Hmm.\" Jaws Boss looks at them both with a considering expression, then nods towards the other hostages. \"I'm making you responsible, <i>Sheriff</i>, for keeping your people in line. One of 'em make trouble, and I'm taking it out on your kid.\"</p>\n<p></p>\n<p>.</p>\n<p>\"They're going to kill us all, aren't they?\" moans Zhe. He reminds Stiles of Isaac, always flinching at things, though Zhe is older than Derek. There's blood on the sleeves of Zhe's light blue button-down; his arms must have gotten in the way of some broken glass in the crash. Karen had been worried about the cuts, but at least they've scabbed over, and he doesn't look to be in pain.</p>\n<p>\"The authorities are negotiating with them,\" says Dad in his most reassuring tone. \"There's no way to tell how this will pan out. But if we keep calm, and do what they tell us to do, and we stick together, we'll all walk out of this. All right?\"</p>\n<p>All of them must know that Stiles' dad has no way of knowing that their captors will be that reasonable; that Stiles' dad must be just as unsure and scared shitless as the rest of them. But there are nods, anyway. Because it's better than dwelling on the alternative.</p>\n<p>Dad has this talent for getting people to listen to him even when they clearly don't want to. Stiles has seen him step into the middle of vicious arguments and, if not resolve the conflict right away, at least settle things down enough that any makeshift weapons are put away and all parties involved are speaking at normal, indoor-voice volumes. So it doesn't surprise Stiles when Dad goes from hostage to hostage and talks to them, checks how they're doing, calms them down if they need it. He's pretty sure that, within the hour, Dad will be able to recite each person's name and life history.</p>\n<p>Stiles swallows his urge to crow <i>that's my Dad and his pretty awesome</i>, and turns his attention to their surroundings.</p>\n<p>It's a huge warehouse, larger than the previous two and possibly the largest in the whole compound. He can barely see the other end, but that may also be because half the lights in the structure aren't working, and most of the functioning light bulbs are in the corner where the smugglers have set up operations. The hostages have been put in the adjacent corner, boxed in by large metal crates on two sides and watched over by at least two guards at all times. Neat rows of metal crates, in various sizes, fill up the rest of the warehouse, suggesting that it still functions as some kind of storage. </p>\n<p>In between being herded around and shouted at to move faster, the hostages have mostly been left alone, the smugglers occupied with arguing with each other and dealing with the police presence outside the compound. Their guards watch any movement suspiciously, but don't stop the hostages from talking to each other as long as they're not too loud about it. Stiles reads that as the smugglers not taking the possibility of the hostages escaping seriously, but he can't tell if it's because the smugglers are overconfident enough to think ten scared-as-shit people would not be able to do it or if there's a hidden threat unknown to the hostages that make escape an impossibility. By all accounts, it's most likely overconfidence, but.</p>\n<p>Stiles' senses are tinglin'.</p>\n<p>The smugglers have confiscated all their possessions, as well as their shoes. Stiles had briefly considered resisting when his backpack was yanked from his clutches, because there's a lot of stuff in there that he doesn't want to lose. Luckily, their stuff had only been put into garbage bags and then piled up near the table. A table that's being used for discussions and poring over maps and the occasional hurried meal and, thus, constantly within view of the smugglers.</p>\n<p></p>\n<p>.</p>\n<p>Jocelyn, aged thirty-four and on her way to Pasadena for a big job interview, starts to have a panic attack.</p>\n<p>It takes Nurse Karen and Dad and Chandan to talk her down from it and keep her from making too much noise. Chandan, who hadn't been on the bus but whose car had been caught in the multi-car pile-up, and then had had the additional misfortune of being grabbed by the fleeing smugglers to be used as a body shield, produces a crumpled McDonald's paper bag from his pocket and hands it to her to breathe into. </p>\n<p>The incident makes Stiles realize that he's due to take his Adderall. When Dad comes back to sit with Stiles, Jocelyn dozing fitfully next to Patrick and Paula, he's clearly remembered the same thing. \"Stiles, I'm going to ask them if we can get your meds from your bag.\"</p>\n<p>The guard - not Bobcat this time, unfortunately - refuses to let Dad get the meds, or to call one of his buddies over to get the meds, or to let anybody else get the meds. He only asks Dad if Stiles will die from not taking them, and when Dad admits that he won't, basically shuts Dad down and tells him to sit before he shoots Stiles in order to definitively solve the problem.</p>\n<p>\"Asshole,\" Dad mutters. He pats Stiles on the shoulder. \"I'm sorry, son.\"</p>\n<p>\"It's okay,\" Stiles assures him, pulling Dad down before the patented Stilinski stubbornness gets them both into trouble. </p>\n<p>\"You'll be okay,\" Dad says, \"and if it gets rough, I'll help you through it, okay?\"</p>\n<p>\"No, really, it'll be okay.\" Stiles hesitates, biting his lower lip. But he can practically hear Derek's voice in his head going, <i>this is exactly what contingency plans are for, stop being stupid.</i> </p>\n<p>Kind of rich, <i>really</i>, Derek-in-his-head, considering all the stupid decisions Derek-in-real-life has made in the past. </p>\n<p>He pulls the right leg of his jeans up past the knee. He peels off a skin-coloured, waterproof packet from the back of his knee, tearing open the plastic to reveal one capsule of Adderall. He swallows it dry.</p>\n<p>Dad is staring at him. </p>\n<p>\"What, you're always telling me that it's good to be prepared!\" Stiles exclaims. \"You should be proud. Didn't you basically force me to carry a box of bandages in my bag all through middle school? I don't know how many times that box saved Scott and me from death by paper cuts, let me tell you.\"</p>\n<p>\"Yeah, I guess.\" Dad looks away, frowning. \"I did notice that you carry a whole first aid kit, now. And a bigger one in the Jeep. And there's that antique knife I saw in your backpack that you, and I quote, 'didn't steal from a museum because Deaton gave it as a Christmas gift which is totally normal to do for the best friend of an employee', after which you assured me that the knife is 100% purely decorative. Not to mention the flashlight on your belt. And that chain around your neck is way too thick for a necklace.\"</p>\n<p>Stiles shrugs. \"I don't know what you're getting at, Dad. Like I said, I'm just embracing the whole 'being prepared' thing.\"</p>\n<p>Dad shakes his head. \"Maybe I'm starting to realize that I should have been thinking about what, exactly, you're prepared <i>for</i>.\"</p>\n<p></p>\n<p>.</p>\n<p>Jumping between Scott and Derek, both of them fully wolfed-out, is probably not the smartest thing he's ever done. It's also the only reason, he's pretty sure, that things don't disintegrate into a full-out death match right there and then. </p>\n<p>Well, it makes Scott pause long enough for Isaac to tackle him to the ground. </p>\n<p>\"Scott!\" shouts Allison. She's got her jacket bunched up and pressed against the wound on her arm. Her crossbow's still in her hand. She's not bleeding too badly, at least. Stiles isn't sure why she sounds so concerned - it's not as if Isaac would ever really hurt Scott. </p>\n<p>\"Lydia,\" Stiles calls over his shoulder. \"Can you and Scott take Allison home, please?\"</p>\n<p>Lydia gives him the look she gives everyone who tries to tell her what to do. But, to his surprise, she nods, pushing back a few strands of hair that had escaped her practical ponytail, and snaps her fingers at Allison. \"Keys.\"</p>\n<p>Scott shakes Isaac off and gives Stiles a look that makes his stomach squirm uncomfortably. He knows every one of Scott's looks, okay, he's got them catalogued and indexed and can probably draw up a pie chart on frequency of use for the top ten, and this is one he's never thought would be aimed at him: angry and betrayed and maybe a little bit hateful.</p>\n<p>He watches the three of them disappear into the trees in the direction of the cars. A few minutes later, there's the faint sound of Allison's car driving off.</p>\n<p>The werewolves around him visibly relax. Stiles pats Isaac on the shoulder the way Derek does when giving approval; Isaac believes in actions more than words, and while Stiles loves words, everyone knows how much he loves words, when it comes to Isaac he does his best to show instead of tell. Isaac gives him a grateful look in return. Actually, Boyd and Erica are smiling at him, too. </p>\n<p>\"Go back to base,\" orders Derek, and oh right, Derek's still behind Stiles. It's probably a bad sign, evolutionary instincts-wise, how little it worries Stiles now to have a wolf at his back. Actually, if pressed, he might even say he finds it <i>comforting</i>. Derek doesn't sound pissed, exactly, but his voice is laced with that extra oomph of the alpha. The four remaining werewolves scatter into the woods.</p>\n<p>\"So,\" says Stiles, turning around, \"That could have gone a lot worse.\"</p>\n<p>\"He's been angling for a fight since this thing started,\" says Derek.</p>\n<p>\"Won't argue with you there,\" says Stiles.</p>\n<p>\"That's a first.\" </p>\n<p>Stiles snorts. \"But hey, asshole hunters are gone, everyone's alive, we didn't even have to go to Peter for anything. I'm definitely counting this as a win.\"</p>\n<p>Derek doesn't say anything. Which, not unusual, Stiles has made himself at home with Derek's silences. But when he turns to look at Derek, something about the werewolf's posture looks <i>defeated</i>, and it drops a heavy weight into Stiles' stomach.</p>\n<p>\"What are you still doing here, Stiles?\" Derek crosses his arms. Despite himself, Stiles' eyes drift over Derek's chest and shoulders - totally out of scientific curiosity about how, exactly, Derek's shirt hasn't burst at the seams yet from keeping all those muscles in - before he forces his gaze back up to Derek's face.</p>\n<p>\"Um, because I don't take orders from you?\" Stiles smirks. \"Well, not those kinds of orders, anyway.\"</p>\n<p>\"Stiles. <i>What are you doing here</i>?\" And oh, oh shit, Derek's giving him a <i>look</i> now, too. He almost laughs, because normally it's Derek who's glaring angrily at him and Scott who's all fond resignation, and now they've swapped, wouldn't they <i>hate</i> that comparison? But Stiles has a feeling he knows where this is going, and at this moment he'd do anything to have Derek glaring at him again.</p>\n<p>\"Where else would I be?\" he asks carefully. </p>\n<p>Maybe he's just jumping to conclusions. Maybe the way his stomach is twisting up like it's full of barbed, spiky wires is only because he always anticipates the worst.</p>\n<p>Derek lets out a long breath, looking down at the ground. He doesn't say anything for a while. Then, slowly, \"Scott's your best friend. He's been your best friend for a long time. He and I - we can get along, sometimes, but he thinks being a werewolf is a curse, and a werewolf is all I've ever been.\" Derek looks up, meets Stiles' eyes. \"We might get past this one. But what about the one after that? The next time he decides he doesn't need an Alpha? I don't-\" Derek looks away. \"I don't want to... divide your loyalties.\"</p>\n<p>Stiles stares at him. The minutes tick by.</p>\n<p>\"Say something,\" Derek says. To the tree.</p>\n<p>\"Seriously?\" Stiles sputters. \"That's it? That's your big break-up excuse? You don't want to <i>'divide my loyalties'</i>?\"</p>\n<p>\"It's true.\" Derek's face is calm, implacable, which means this is something he's been thinking about. Had he let Allison get hurt on purpose? No, cold-blooded is Peter's gig, not Derek's. But Derek and Scott have been on shaky terms with one another for weeks, after the last tussle with the supernatural; not unreasonable to expect that something would come up eventually.</p>\n<p>\"Shit.\" And Stiles remembers that he always anticipates the worst <i>because the worst is what usually happens</i>. \"Look, you don't have to pretend that it's about Scott. I'm a big boy, I can handle someone telling me that they're no longer interested, it's not like I expected this to be some long-term thing-\" not a lie, not a lie, he'd <i>hoped</i> but hadn't <i>expected</i>.</p>\n<p>He's reminded of how fast werewolves can move when, whoa, Derek is suddenly all up in his space. \"But it <i>is</i> about Scott.\" Derek's hands twitch and rise up, as if he's about to grab Stiles' arms. Luckily, he seems to remember himself and puts them back down again, fingers clenching into fists like he doesn't trust himself not to touch. \"It's about you putting yourself in danger to keep him and me from fighting. It's about you spending so much time trying to help us get along that you forget to look after yourself. It's about you <i>hesitating</i>, even when we're <i>under fire</i>, because you don't know if you should follow him or me.\"</p>\n<p>\"I would like to point out that my hesitation totally saved our lives,\" says Stiles. \"Also, doesn't really sound like you're talking about <i>Scott</i> here.\"</p>\n<p>\"You think I want to do this?\" Derek steps away, and Stiles shivers from the loss of body heat. Werewolves are literally furnaces. \"I thought I could handle it, having only part of you and not the whole. But I <i>can't</i>.\"</p>\n<p>\"Wait,\" says Stiles. He feels light-headed from trying to figure out <i>what the hell is going on here</i>. \"Are you giving me an ultimatum? Is that what this is? You're making me choose between you and Scott?\"</p>\n<p>\"No. I already know. I knew, from the start.\" Derek smiles - bitterly, without a trace of humor. \"You'll always choose Scott.\"</p>\n<p></p>\n<p>.</p>\n<p>He must have dozed off, because he startles awake when Dad gently touches his arm. His neck aches. He hurriedly wipes his mouth and, yup, he'd been drooling; he's developed the ability to sleep anywhere, but hoping to do so while looking dignified is probably a lost cause, and- \"Dad, why are you staring at me?\"</p>\n<p>Dad nods downwards. Stiles hurriedly looks down at his body, already gearing up to be horrified at his stupid adolescent hormones, it wouldn't be the first time he'd started dreaming about a certain Alpha at the least appropriate time, and- sees nothing embarrassing, \"What?\"</p>\n<p>\"That pendant. You were clutching it in your sleep,\" Dad says. After a moment's hesitation, \"I've never seen it before.\"</p>\n<p>Stiles looks down again and, oh right, Dad means the object currently hanging at the end of the long silver chain around his neck, which Stiles has been holding tightly enough that there are red marks on his palm where the edges have dug into his skin. It looks like a twisted length of metal - mainly because that's what it is. He never takes it off, but he usually keeps it under his clothes. <i>Like a lot of other things</i>, an insidious thought wisps by. He forces himself to let the pendant go. \"It's a gift.\"</p>\n<p>\"From?\"</p>\n<p>\"A friend of Scott's.\"</p>\n<p>Dad hums. \"Must mean a lot, from the way you've been holding it.\"</p>\n<p>\"I can't be held accountable for my subconscious actions,\" he says defensively. \"Besides, can't a guy have a security blanket without being <i>eyebrowed judgingly</i>, especially when we're in a legitimately high-stress situation?\"</p>\n<p>\"Eyebrowed?\" Dad repeats. </p>\n<p>\"See: legitimately high-stress situation.\"</p>\n<p>Dad settles down next to Stiles. \"That's another thing. You've been remarkably calm about all of this.\"</p>\n<p>\"What?\" squeaks Stiles. He flushes when he sees one of their guards glance his way, and lowers his voice until it's barely a whisper. \"I'm nowhere near the vicinity of calm. If I seem calm now it's because I've been freaking out since all of this started and, you know, it's been half a day, my body's probably taking break, it'll be good for another round in an hour or two.\"</p>\n<p>\"You've been restless, and anxious,\" says Dad, \"And, yes, you're scared, like any person would be - but you're also very <i>controlled</i>.\" Dad looks intently at Stiles, like he can figure out the crockpot of crazy that is Stiles' life if he examined his face closely enough. Stiles kinda wishes he could, to be honest. \"I won't lie, I was kind of expecting you to have a panic attack at some point. I can't remember the last time you had one. Back there, with Patrick, the way you kept talking to him and his sister, keeping them calm - Karen says that you knew what you were doing. Like you've dealt with that kind of situation before.\"</p>\n<p>\"Gee, Dad, some people would say those are <i>good</i> things.\"</p>\n<p>Dad ignores him, clearly on to his deflective ways. \"You also weren't bothered by the blood. Everybody else flinched. You made a face, but you focused on the kids. I remember a time when you would have been complaining about seeing that kind of wound.\"</p>\n<p>\"I still complain - just not when there's a <i>kid</i> bleeding out in front of me,\" Stiles mumbles. \"And you know that Scott has me helping out at the vet's, sometimes.\"</p>\n<p>\"There you go again, lying without really lying.\" Dad sighs. He doesn't look as resigned as he has been, though. If anything, he's giving off vibes of the newly determined. He leans back on the crate, crossing his arms in a clear <i>I'm going to take a nap now</i> way. \"Wake me up if anything happens.\"</p>\n<p>\"Sure.\" Stiles sits up straighter. Shuffles away from the crate so he isn't tempted to close his eyes again. </p>\n<p>\"By the way,\" Dad mumbles, sounding half-asleep already. When he was younger, Stiles always envied his Dad's ability to drop off anywhere. Now he knows, from personal experience, that it's an inevitable consequence of having to deal with emergencies at any hour - 'inevitable' in the sense that one either picks up the skill or eventually dies from sleep deprivation. </p>\n<p>\"Dad?\" Stiles prompts when nothing else is said, though softly in case the man's already fallen asleep. </p>\n<p>\"Oh, hmmm.\" Dad yawns. \"You were muttering in your sleep. About a certain someone named <i>Derek</i>.\"</p>\n<p>Stiles flushes, and buries his face in his hands with a heartfelt, \"Damn it.\"</p>\n<p></p>\n<p>.</p>\n<p>\"Come on, Scott. Even you must know that it wasn't Derek's fault she got hurt.\" Stiles slumps over Scott's desk. His head is throbbing. He's had no appetite since the talk with Derek, though he'd forced down a slice of toast before heading over to Scott's, because missing meals messes with his meds. \"He couldn't have predicted that they'd have a half-crazy omega locked away, and Derek would have gotten there sooner if he could. You thought yourself that the coast was clear. It was a collective fail in the 'knowing what we're getting into' category. Allison's healing up fine, her dad hasn't tried banning you guys from seeing each other <i>yet again</i>. I suspect he's starting to get that it's not gonna stick. I know you've got a midnight rendezvous planned already - I'm failing to see what the problem is here.\"</p>\n<p>\"It's just <i>Derek</i>, okay?\" Scott flops over on his bed, punching one of his pillows. \"It's not really about today. I'm just sick and tired of how he always keeps us in the dark, how he treats us like kids and then expects us to be okay with <i>killing people</i>.\" He turns his head and gives Stiles a dirty look. \"You wouldn't understand. He's got <i>you</i> wrapped around his little finger.\"</p>\n<p>Stiles narrows his eyes. \"What the hell does <i>that</i> mean?\"</p>\n<p>Scott huffs. \"Look, I didn't want to say anything. But don't you think it was kinda sudden, how he went from ignoring you to being all over you? I can't help thinking, you know,\" Scott kicks at his mattress, \"that he knows I'll go wherever you go.\"</p>\n<p>It takes Stiles a full minute to figure out what Scott is implying - not because of the idea itself, Stiles' roving thoughts have covered all possible bases up to and including 'reprogrammed by aliens' - but because he can't believe Scott actually <i>went there</i>. </p>\n<p>He then takes another minute to get his voice working again. \"Are you saying that, what, he was only fucking me to get you?\"</p>\n<p>Scott winces, but there's a stubborn set to his jaw. \"Erica told me that he'd had her in mind for you, at first. Maybe he just decided to do it himself.\"</p>\n<p>Stiles closes his eyes and counts to ten backwards in his head. Reminds himself that it's not Scott's fault Stiles never told him about all the times Derek had shown up in his room, initially to get Stiles to research something, and then staying longer and longer on increasingly flimsier excuses; about Derek gradually teaching him how to fight, teaching him how to hold his own against werewolves; about traipsing through the woods and feeling safe because he knows Derek is always lurking nearby. About how it had been Stiles who'd initiated things. Scott seldom asks what Stiles does on Scott's date nights with Allison, and Stiles had been more than fine with that. </p>\n<p>It's never occurred to Stiles that what had felt like months of increasingly comfortable company and hilariously inept flirting might have appeared, to those on the outside and especially to someone with Scott's somewhat selective attention, like a sudden shift from maybe-acquaintances to, well, whatever Stiles and Derek are. Had been.</p>\n<p>\"That's all I'm good for, right?\" Stiles says quietly. He can't move from Scott's chair, can't stand to look at Scott's face at that moment, so he points his gaze at a nondescript patch of wall. \"I mean, why else would <i>Derek</i> be interested in someone like me?\"</p>\n<p>Scott must be realizing that he'd gone too far, because he says, \"No, of course not, that's not what I meant. Shit.\" The bedsprings creak. Stiles can feel Scott's earnest, puppy-dog eyes staring at him. \"You know I don't think that, right? And - I didn't really mean what I said, I was just pissed off. Of course Derek cares about you. I'm angry at him, it wasn't fair of me to take it out on you, you carry his scent so my wolf keeps thinking you're him-\"</p>\n<p>\"Guess you won't have to worry about that anymore,\" Stiles interrupts. He's been thinking about conversation with Derek non-stop since it happened, but the meaning of it is only hitting him now. He feels oddly numb, hollowed-out; there's an ache in his chest that he's pretending is the gruesome, still-healing wound from two months previous. \"We broke up.\"</p>\n<p>He finally looks at Scott. He half-expects Scott to appear happy, or at least relieved. But Scott just looks - confused, maybe even dumbfounded, like he can't process what Stiles had just told him. \"What?\"</p>\n<p>\"Derek. And I. Broke up.\" It's a weird thing to say, really, when neither of them had ever actually said that they were together. They hadn't hidden it - couldn't, anyway - but all the people they would have told already knew without anyone having to put words to it. </p>\n<p>\"Did he. I mean.\" Scott blinks. \"I didn't think he'd ever actually let you go.\"</p>\n<p>\"Okay, I'm going to ignore how creepy that sounds, but it was. It was his idea.\" Stiles looks away. Saying <i>Derek was the one who dumped me</i> would have been more pathetic than he could handle right then. </p>\n<p>Scott keeps on looking like a startled fish. </p>\n<p>\"What's with the face?\" Stiles asks. \"I don't get it - I thought you'd be happy that Derek no longer has his dirty little claws in me.\"</p>\n<p>Scott grimaces. His hands make a vague, indecipherable gesture. \"I guess I thought the two of you were, you know.\"</p>\n<p>Stiles swallows heavily. \"Yeah,\" he admits, and pretends that his voice is totally normal, \"Me too.\" He sucks in a deep breath. \"Look, just because Allison is clearly the only one for you doesn't mean it works that way for the rest of us.\"</p>\n<p>\"But. It's not.\" Scott rakes a hand through his hair. \"What about the Alpha thing - weren't the two of you working on that?\"</p>\n<p>\"Dude, just because we're broken up doesn't mean I won't still help if he asks me to.\" Stiles shrugs. \"I wasn't able to do much, anyway. He still can't shift to the full Alpha form. I'm pretty sure there's something Peter's not telling us. But he's Derek's problem.\" He stands up. \"I think I'm gonna go home. My dad wants to talk to me after he finishes work.\"</p>\n<p>\"Stiles?\" Scott does a full-body wriggle and ends up in a sitting position. He is an actual puppy, Stiles has long decided, the werewolf thing just gave him an excuse. \"I'm sorry.\"</p>\n<p>Stiles nods. \"Yeah. Me too.\"</p>\n<p></p>\n<p>.</p>\n<p>He senses rather than sees the sudden stillness in the body sitting next to him. \"Are you-\" Dad coughs, lowers his voice. \"You're serious.\"</p>\n<p>Stiles nods. He's absurdly glad that all the other hostages seem to be asleep. Well, Zhe is shifting every few minutes, but he's on the far edge of their little prison, and probably can't care less about Stiles' personal drama.</p>\n<p>Dad breathes out loudly. \"I... suspected you were dating somebody. And I wondered why you wouldn't tell me.\" He side-eyes Stiles. \"I guess that makes sense, now.\"</p>\n<p>Stiles cringes. \"I wanted to tell you, if it's any consolation.\"</p>\n<p>\"It is, actually.\" Dad shifts. After a long moment, he continues, \"You know, Stiles, if I don't exactly <i>approve</i>, it's because he's older than you and with a bit of a history, and not because he's, you know-\"</p>\n<p>\"Yeah, dad, I know.\" After a moment, Stiles adds, \"Thanks.\"</p>\n<p>Dad elbows him gently. \"This is something you don't ever have to thank me for.\" He pauses. \"That night outside the gay club a couple of years ago, when you said you were there with Danny - were you trying to come out to me then? Because I wouldn't have joked if I thought you were being serious.\"</p>\n<p>\"Relax, Dad, I was joking too. Mostly.\" Stiles smiles. Then his face falls. \"And don't worry, Derek and I - it's not happening any more. I just wanted you to know. And it's not Derek's fault I didn't tell you - he wanted you to know, too. I was the one who was too chicken-shit to say anything.\" And he'd been unsure, back then, about how long whatever-it-was would last, if it'd be worth going through the stress just for Derek to get tired of him after a few weeks. </p>\n<p>Oh, sweet irony.</p>\n<p>\"I see.\" Out of the corner of one eye, Stiles can see Dad casting him worried looks. \"He didn't... hurt you, or anything, did he?\"</p>\n<p>\"Well, yeah, of course he did, it came out of nowhere.\" After a flash, he realizes what Dad is getting at. \"What? No, I just meant, you know, <i>emotionally</i>, like in a normal break-up! Which, fine, yes, he's the one who broke up with me, there you have it, but it was a peaceful parting of ways! Like consenting adults do all the time! There weren't even angry words, I might call it <i>amiable</i> if not for the cliche factor; we're still friends and everything.\" </p>\n<p>Dad chuckles, which, even if it is at Stiles' expense, is definitely preferable to Dad thinking that Derek had been mistreating him.</p>\n<p>One of the guards - Bobcat again - gives him an ugly look. Right, hostage situation. Stiles tries to look both sheepish and cowed at the same time, but suspects he looks more like Boyd after his first experience of Scott's cooking.</p>\n<p>\"All right, fine, I'm not going to hunt him down with a shotgun,\" says Dad. He pats Stiles on the arm. \"I'm sorry. For your first break-up. Wait, this is your first one, right? You haven't turned into a Casanova behind my back?\" He coughs. \"Not that there's anything wrong with that! Just, I can live with not catching on that my only son has started dating, but I should just turn in my badge if I missed you having a string of boyfriends. Or girlfriends. Boyfriends and girlfriends?\"</p>\n<p>\"<i>Oh my God</i>, Dad,\" Stiles complains, hiding his face in his hands. \"Please, no more. Yes, Derek's my first.\" And wow, good decision on hiding his face, because all the implications of those words go tumbling through his head only <i>after</i> he's said them. The worst part is that it's unintentional but <i>true</i>: Derek had been his first in a lot of things. Especially sex things. Oh God. Stiles' face is <i>burning</i>, and he bites his tongue to keep anything else from falling out. Maybe his dad won't pick up on it?</p>\n<p>The enormously awkward silence tells him that his dad, in fact, has, because his dad puzzles people's guilty secrets out of them for a living. </p>\n<p>After what feels like an <i>eternity</i>, Dad clears his throat. \"So. Uh. I guess it was serious, then?\"</p>\n<p>Stiles swallows. \"Yeah.\"</p>\n<p>\"Wait, exactly how long were you two, ah, seeing each other?\"</p>\n<p>Stiles cringes pre-emptively. \"Um. About a year?\"</p>\n<p>\"<i>Stiles</i>.\"</p>\n<p>\"We went really slowly! Seriously, can you imagine me doing anything I don't want to? I'd also like to point out that I'm legally an adult now. In case you've forgotten.\"</p>\n<p>\"Yes, you're an adult <i>now</i>\" Dad glares at him. \"You weren't <i>one year ago</i>.\"</p>\n<p>\"We didn't-\" wait, no, they totally did, and <i>why</i> had he tried to say otherwise, Dad obviously caught the aborted statement and looks ready to go after Derek right there and then. Good thing they're being held hostage by drug smugglers, really. \"Look, Dad, there's no way I can reassure you that everything was fine and consensual and taken slowly, we're talking <i>glacial pace</i> slow here, without descending to a level of detail that will leave us both unable to look each other in the eye <i>ever again</i>, so, can you please just take my word for it?\"</p>\n<p>After a long moment, Dad sighs and puts an arm around him. \"Did it have to be <i>Derek Hale</i>?\" He chuckles at Stiles' glare. \"While I am tempted to go back on the whole shotgun thing,\" he waves a hand at Stiles' squawk of protest, \"I'll trust you if you tell me, in no uncertain terms, that he didn't take advantage of you, and it really was an amiable break-up.\"</p>\n<p>\"Yes, it was, there was definitely zero advantage-taking going on,\" Stiles says quickly. \"If anything, I was the one who went after him, I practically had to- you know what, I'm going to stop right here, I'm pretty sure we've already reached our quota for embarrassing pieces of TMI today.\"</p>\n<p>\"Yes, please stop,\" Dad says weakly. His arm tightens around Stiles, giving him a manly side-hug, and then lets go. \"I gotta hand it to you - Derek was definitely <i>not</i> on the list of people I thought you might have been sneaking around with.\"</p>\n<p>\"Hey, I feel you there; <i>I</i> was totally surprised that he liked me back,\" says Stiles. He makes a face. \"Ugh, that's sounds so <i>high school</i>.\"</p>\n<p>\"Funny you should mention that, because it's definitely not slipped my mind that <i>you are still in high school</i>.\"</p>\n<p>\"<i>Dad</i>.\"</p>\n<p>\"<i>Stiles</i>.\"</p>\n<p>They glare at each other for approximately 3 seconds before bursting into laughter, both trying to keep it as quiet as possible, and Stiles realizes it's the first time in a long time that he's felt like a normal teenager talking to his dad. And even so, there are armed men within shouting distance, and there's a very real chance that they won't get out of this alive. But such is the recurring theme in Stiles' life, and he won't ever trade any of the people he loves just for the illusion of normalcy, so he'll take what he can get.</p>\n<p></p>\n<p>.</p>\n<p>He just keeps an eye on Dad, and somehow Dad manages to keep all the survivors from the bus crash together and out of harm's way. There are people shouting - mostly the people with guns, especially when more people with guns show up. </p>\n<p>They're too far away to hear words clearly, but the first gunman is gesturing wildly towards their group. They're all still crouched down, some people lying flat on the asphalt, near the side of the road. Several vans come screeching up the road, going the wrong direction if there'd been the usual traffic. </p>\n<p>Stiles hears sirens in the distance, sees the people with the shiny guns looking towards their group, and has a very bad feeling about everything.</p>\n<p></p>\n<p>.</p>\n<p>Dad had called it a pendant. Stiles has never thought of it as one - it is <i>literally</i> a piece of metal, twisted and warped, impossible to figure out what it used to be unless the observer knows what they're looking at to begin with. </p>\n<p>Jaws Boss and one of his muscle guys, Boxer, show up and toss a couple of bags of sliced bread into the group. Dad takes the bags and carefully hands out one slice per person, first, and then offers seconds to whomever wants one, warning them that it might be better to save the food for later. He insist on Patrick taking a second slice, though.</p>\n<p>Stiles finds himself sitting by Patrick and Paula and Mari. Everyone's looking worse for wear, but Stiles feels strongly protective of these three in particular. He can't look at Patrick without seeing seven-year-old Scott. Paula is a mix of Derek and Boyd - stoic in a way that seems learned, and learned ungently, yet clearly hurting to see a loved one in pain. Mari makes him think of Allison, in the hard months following the loss of her mother and betrayal of her friends. Mari's dark skin makes her eyes appear particularly bright; she's shy around the others, but she'll smile at Stiles and Paula, and let Patrick play with her long curly hair.</p>\n<p>They're too old to ask outright, even Patrick - which breaks Stiles' heart a little - but Stiles well knows the look of pups seeking reassurance. \"I know that this looks pretty bad,\" he says quietly, \"And I'm terrified, I won't lie. I'm scared that they're going to start hurting us, that something will happen and the situation will get worse. I can tell you that everything is going to be okay and we're all going to make it out, but I feel like you've been telling yourselves that, anyway. I'll tell you this, though.\" He holds out with both hands, palms up, and lets them grip him hard enough that he can feel the grinding of his bones, because some hurts are good hurts \"I promise you that I'll do what I can to protect you. I promise you that I won't leave you here. Maybe you've heard other people say the same thing to you and not follow through on it - I definitely have, and I know how much it sucks. Which is why I mean it. Whatever happens here, <i>you won't be alone</i>. Got that?\"</p>\n<p>Later, when the three of them have fallen asleep, Stiles sees his dad beckoning him to the other side of their little prison area. Stiles carefully extracts his hands from three sweaty grips.</p>\n<p>\"I heard a bit of what you said, earlier,\" says Dad. He's looking at Stiles with a strange sort of intensity, making Stiles shift nervously. \"I've always known that you're good at taking care of people, seeing as how you've taken care of me since your mom- and I'm real proud of you for keeping it together here, I am.\"</p>\n<p>\"What's wrong, Dad?\" Stiles frowns.</p>\n<p>\"I just don't want you making promises you can't keep.\"</p>\n<p>Stiles swallows. \"I'm keeping this one.\"</p>\n<p>Dad sighs. \"I know you'll try, and that's what scares me.\" Then, unexpectedly, he smiles at Stiles. It's a tired smile, and both of them are in desperate need of a good shower, but pride in his eyes is on par with Stiles being MVP at a lacrosse game or getting a semester of straight As. \"Just remember that protecting people is <i>my</i> job.\"</p>\n<p>There's activity at the main doors. Half a dozen people they'd never seen before saunter in - four men and two women - and the one in the lead immediately gets into an argument with Jaws Boss. Stiles takes one look at the way that they're standing, the not-so-subtle sniffing of the air, the very distinct aura of danger radiating from them, and mutters, \"No, Dad - I think it just became mine.\"</p>\n<p></p>\n<p>.</p>\n<p>Stiles yelps. He's spinning around, lacrosse stick gripped solidly in his hands, before Peter has finished talking.</p>\n<p>\"I'm guessing it's because it's dangerous,\" says Stiles. He forces himself to relax, because uncles of uncertain mental stability probably get off on other people's fear. He keeps his stick in his hand. </p>\n<p>Peter is <i>so</i> not the werewolf he'd come out to the woods after practice to see. </p>\n<p>\"Yes.\" Peter saunters closer. \"I know what it is you're wearing around your neck. Or, rather, where it came from.\"</p>\n<p>\"You do.\" Stiles lifts his chin up, challenging.</p>\n<p>\"I do. And I know what it means for you to have been given it.\" Peter cocks his head to one side. \"Has Derek told you about the werewolves who go native? Who turn feral?\"</p>\n<p>Stiles is used to the way Peter seemingly jumps topics; there's usually a common thread there that only Peter can see. \"You mean, when they lose their human selves and can't shift back?\"</p>\n<p>Peter, fortunately, stops just out of range of the lacrosse stick. \"You know, of course, that there are downsides to being a werewolf. The heightened senses and better healing and various tools for violence, all have a price. Loss of control. Vulnerability to certain plants. Has Scott talked to you about his wolf?\" </p>\n<p>\"Kind of.\" Stiles hesitates. But this might be important. And all the other werewolves in his life aren't exactly great at sharing information with him. \"He says his wolf sometimes feels like this separate animal living inside him, like it's got a mind of its own.\"</p>\n<p>\"Scott still hasn't fully embraced his wolf; it's natural that he would sometimes be at odds with his instincts.\" Peter nods sagely. \"And even when the wolf has settled, it brings its own problems. Rarely will werewolves willingly talk about this, so I'll speak plainly - every werewolf has this secret, burning desire to embrace the wolf completely. To forget about all those pesky human problems and just submerge themselves in the animal.\" </p>\n<p>\"Those wolves, huh,\" Stiles says weakly, while his brain turns the idea over. It's a rule instigated by Lydia and himself: every piece of information from Peter has to be triple-checked and source-identified and essentially handled in the mental equivalent of a fume cupboard.</p>\n<p>\"Actually, the desire comes from the human side,\" says Peter. \"Wolves have fairly straightforward needs. Food and safety and territory and <i>pack</i>. They don't get existential crises or worry about their destiny in the universe. Now, think about what I've just told you, and combine it with the knowledge that the wolf is, naturally, strongest and closest to the surface when we've shifted into our wolf form.\"</p>\n<p>Stiles frowns. He's familiar, by now, with the way Peter likes to lead people to knowledge he knows they want, taking delight in laying out the breadcrumbs of information. Stiles knows it makes him easier to play than the others, but he still can't help wanting to jump ahead of the trail and make sense of it all before Peter is ready for him to. He casts his mind back to how Peter started this conversation. \"The full alpha form is... like being shifted, but a hundred times more intense?\"</p>\n<p>Peter nods. \"Very good. Yes, the full form is the closest a werewolf can come to being a <i>real</i> wolf. The wolf is strong in that form, easily stronger than the parts that are human, until the Alpha has shifted enough times to acclimatize. Half the Alphas who try to shift that far end up losing themselves. They become their wolf, losing all traces of their human identity. The irony is that there's just enough human bits left behind to drive the wolf insane, because real wolves aren't built to handle human perception, however fractured it may be. You can imagine their life expectancy once hunters get wind of them.\" Peter shrugs. \"Derek's been a werewolf his whole life, and even he doesn't trust his control enough to get there.\"</p>\n<p>\"How were you able to do it?\" asks Stiles. He suspects it's the question Peter has been waiting on tenterhooks to be asked.\n</p>\n<p>Instead of appearing pleased, Peter gives him a wry look. \"There's nothing I can tell you that Derek doesn't already know. The key to achieving the full form is - wait for it - the same thing that gives us control over our usual transformation.\"\n</p>\n<p>Stiles frowns. \"You mean, your anchor?\"\n</p>\n<p>\"That's right. The only difference is that this anchor has to be something that can withstand the pull of the wolf.\"\n</p>\n<p>A stronger assault calls for better defences. Stiles nods. \"Derek's anchor is his anger.\"\n</p>\n<p>\"Which has served him well up to this point,\" Peter concedes, \"But anger is volatile, consuming. It's a lot like fire - it's strong, but it can run out of fuel and die. The slightest wavering, and the wolf will take advantage. You may find it hard to believe, but my nephew does, occasionally, have a sense of self-preservation. His instincts tell him that his anger is not enough, not against the full Alpha form, and so he's not pushing himself hard enough to get there.\"\n</p>\n<p>Stiles considers this. Considers Peter. \"Revenge was your anchor,\" he realizes.\n</p>\n<p>\"Right on the dot - you're <i>on fire</i>, tonight.\" Peter grins at him, probably because Stiles has pointedly refused to comment on the repeated references. \"My main objective was to track down and kill all the people who murdered my family. There was rage and grief and all that messiness as well, but the focus was always cold, hard vengeance. Not unlike what a kanima's master would use. The Alpha's anchor has to be something constant, something he can embrace fully and without question, without a single doubt in his mind.\"\n</p>\n<p></p>\n<p>.</p>\n<p><i>Oh</i>.</p>\n<p>Huh.</p>\n<p>\"Stiles?\" Dad shuffles over to him from where Karen and Chandan are sitting together; he must have been checking on the others.</p>\n<p>Stiles wipes his hand over his eyes. \"I think I've been an idiot.\"</p>\n<p>Dad huffs, gives Stiles a knowing look. \"This is about Derek, isn't it?\"</p>\n<p>Their guards of the hour are either dozing or extremely fascinated by the dusty rafters, so Stiles says, \"I've been helping him on this... project, and we've been stumped for a while over it, but he might have figured out the solution. Only, he's stupid and doesn't know what to do with, like, actual <i>emotions</i>. And I'm stupid because I totally fell for the <i>I'm breaking up with you for your own good</i> gambit because he disguised it by making it seem like I had to choose between him and Scott <i>and then making the choice for me</i>, thereby pissing me off and covering up the fact that it was a pre-emptive break-up because he believes that no one would ever choose <i>him</i> and he doesn't deserve to have good things. He'd rather cut me out and risk not, um, finishing the project, than admit he needs help, and I want to be pissed off at him but mostly I'm sad <i>for</i> him and a little bit shocked because I'm apparently, uh, more important to the success of this project than I realized?\"</p>\n<p>\"And now I regret asking,\" says Dad, blinking like the slew of words had whacked him right on the brain. It's a reaction Stiles is well familiar with, though really, he'd assumed Dad's pretty immune at this point.</p>\n<p>\"How can you be thinking about your love life at a time like this?\" hisses Jocelyn, which, huh, Stiles is more distracted than he thought, he hadn't even noticed her being close enough to hear, and he's gotten fairly good at spotting intrepid eavesdroppers, takes one to know one and all that. The expression she's directing at him reminds Stiles, weirdly, of Mr. Harris. </p>\n<p>\"Because I'd rather think about that than what's happening here,\" Stiles snaps back. \"It's not like dwelling on our situation is going to magically make it any better.\"</p>\n<p>\"Stiles,\" Dad admonishes him, at the same time as one of the guards seems to wake up and barks out, \"Shut your people up, Sheriff, if you don't want me shutting them up for you.\"</p>\n<p>Dad nods and holds up his hand, <i>won't happen again</i>.</p>\n<p></p>\n<p>.</p>\n<p>Derek's tongue relocates from where it had been getting really well acquainted with Stiles' to licking over the bump of Stiles' Adam's apple. The werewolf lets out a gruff, \"Yeah, you can,\" before pressing his lips to Stiles' neck. Stiles shivers when Derek slowly begins to suck. In no time at all, he knows, the red will rise up on his ridiculously pale skin. School's out, so he doesn't bother reminding Derek to keep the possessive marking under his clothes. </p>\n<p>Stiles waves his arms vaguely. \"I have no idea what you even mean-\" Derek's hand deftly unzips Stiles' jeans and slips inside, and Stiles' whole body bucks up at the touch of Derek's hand on his cock. </p>\n<p>Derek swears loudly when he registers the total absence of underwear. \"<i>Stiles</i>, fuck, one of these days - I <i>knew</i> I could smell, in the denim, oh God. I need - I have to-\" and then Stiles' head is hurting from a sudden impact with the door because Derek basically just <i>pounced</i> on his cock <i>with his face</i>, specifically his <i>mouth</i>, swallowing Stiles down to the root like he's literally starving for Stiles' dick.</p>\n<p>\"Oh God, oh <i>God</i>, you're, you're really - <i>Derek</i>,\" Stiles moans. He has a vague feeling that his arms and legs are flailing everywhere, but it's hard to spare the attention when his entire brain is <i>being sucked out through his dick</i>. All he can think about is heat and wetness and suction and <i>so much heat</i>, and that is Derek Hale bent right over the gear stick of his Camaro, head buried in Stiles' lap and hands pinning his hips to the leather seat.</p>\n<p>The suspected faeries they'd been scoping out could have flown out of their rented cabin and danced a magic ring around the car without Stiles noticing. Or caring.</p>\n<p>Derek normally takes his time blowing Stiles, he has a thing for getting Stiles desperate to the point of speechlessness, but he doesn't mess about now, using all the tricks that Stiles likes best. When Derek takes the head of Stiles' cock down his throat and <i>growls</i>, Stiles punches the roof of the car and comes so hard that the beehive that is his brain can't squeak out a single thought for over a minute. </p>\n<p>Stiles resurfaces to Derek nuzzling his neck and - huh, Stiles hadn't even noticed Derek undoing the top few buttons of his button-down shirt - fingering the half-melted piece of metal the end of its sturdy chain. Derek hasn't talked about it since giving it to Stiles. Doesn't acknowledge it, either, except in times like this: Stiles quiet and soft after orgasm, with the possibility of something interrupting at any moment. </p>\n<p>\"Do you-?\" Stiles gestures towards the sizable bulge in Derek's crotch.</p>\n<p>\"Later,\" says Derek, not taking his eyes away from the metal glinting on Stiles' chest.</p>\n<p>\"Okay.\" Stiles tips his head back and tries to catch his breath.</p>\n<p>\"You nearly took a bullet for Scott last month.\"</p>\n<p>Stiles shrugs. \"Was that last week? These rogue hunter encounters are starting to blend together. That's probably not a good thing. Or maybe this faerie crisis - a phrase which I used in Danny's hearing today, by the way, so you need to help me find a casual way of letting him know that I did not mean it as any kind of slang or derogatory term - anyway, this fairy crisis feels like it's taking forever. I've finished all my homework for the break, <i>that's</i> how long I've spent stalking these guys. My usual researching gig feels glamorous in comparison.\"</p>\n<p>\"You nearly got shot protecting Scott,\" Derek persists, \"The month before that, you covered Erica with your body to keep wolfsbane powder from touching her. Last full moon, you found Isaac and pulled him out of those hunters' trap.\" He presses a hand onto Stiles' chest, sliding under his shirt through the gaping opening and stopping right where the skin and muscle are still tender, pink-new. \"<i>This</i> one could have killed you, and it had been meant for me.\"</p>\n<p>Stiles tilts his head at Derek. \"I don't get what you're trying to say.\"</p>\n<p>\"Just that all the others <i>will</i> listen to you. Scott will listen to you more than he'll ever listen to me.\" Derek's gaze bores into Stiles', like he's trying to tell Stiles something important.</p>\n<p>\"I... know that? I guess?\" Stiles says.</p>\n<p>\"Good.\" Derek seems to ponder saying more, but then he suddenly turns to look at the cabin. \"One of them is moving around. Packing a bag. They must be getting ready to leave.\"</p>\n<p></p>\n<p>.</p>\n<p>\"But how are we supposed to even get out of here?\" counters Karen. </p>\n<p>None of the suggestions are anything Stiles hasn't thought of before, so he tunes out most of the talk. The only way they'd have a chance is if most of the smugglers inexplicably leave the warehouse and the hostages get their hands on some weapons. And that's not taking into account the reinforcements. The new group had been integrated into the group that had been there from the start.</p>\n<p>The curious thing, though, is that Jaws Boss won't let any of the newcomers get too close to him. And yet, he'd been the one to announce that the new group was joining the old and ordered the various jobs redistributed. The other smugglers had simply shrugged and treated the new people with no less suspicion than they'd treated each other. </p>\n<p>Stiles suspects that Jaws Boss knows <i>exactly</i> what the newcomers are - and he's the only one who does.</p>\n<p>\"What do you think, Stiles?\"</p>\n<p>\"Huh?\" Stiles tears his gaze away from Plaid Surfer - one of the newcomers, who'd been slotted into the hostage-guarding roster. \"Oh, I think it's probably better if we stay put.\"</p>\n<p>\"Are you serious? They're going to kill us!\" Jocelyn shakes her head and turns back to the others, the 'ignore him, he's just a kid' dismissal as clear as if she'd said it aloud. </p>\n<p>Dad gives him a curious look. Stiles shrugs. He can't tell them that Plaid Surfer and Blue Eyes, if not all the other newcomers, can hear every word being said, without explaining how he knows. Can't reveal that, if they wait long enough, help will come, in one form or another. </p>\n<p>He never used to be good at waiting. Still isn't. But he's painfully aware of how easily things can go wrong, how much he has to lose by being reckless here. He definitely owes Derek an apology for never appreciating what Derek must go through every time Stiles finds himself in danger. He thinks he can try a little harder to keep out of it, after this.</p>\n<p></p>\n<p>.</p>\n<p>Deaton nods. \"A good night's sleep should get the rest of the wolfsbane out of their system. It's a good thing the hunters didn't realize that not all of you are werewolves.\"</p>\n<p>\"Lydia was the one who broke us out, though,\" Stiles admits. He jams his hands into the pocket of his hoodie. \"Hey, doc, would it be okay if I stayed here overnight?\"</p>\n<p>\"That is probably for the best,\" Deaton says, surprising Stiles. \"I had to give them a sedative, and they're all a little out of it. He probably didn't tell you, but the last time I patched Derek up - you had to go home because your father had a day off, if I remember correctly - he woke up in the middle of the night and stumbled around looking for you, riling all the animals up. Luckily Isaac had stayed and assured him you were safe.\"</p>\n<p>\"No, he didn't tell me,\" Stiles says softly. </p>\n<p>Deaton gives Stiles a curious look. \"I just got a delivery of mountain ash this morning. Come help me bottle them up.\"</p>\n<p>Half an hour later, there's a neat row of bottles, clearly labelled, across Deaton's operating table. \"I didn't realize how quickly this would go with a second pair of hands,\" Deaton says cheerfully. He gives Stiles the enigmatic smile that always makes Stiles start worrying. \"I see that you've regained full range of motion in your arm. That's a relief - it looked pretty bad after that faerie was done with you.\"</p>\n<p>Stiles shrugs. Pops open another bottle. \"A lot of the blood wasn't mine, actually. And my body was used to healing weird and inexplicable injuries long before Scott became a furry creature of the night.\" He brightens. \"Hey, it's kinda like my childhood was preparation for all the stuff going on now.\"</p>\n<p>\"Including losing a loved one?\" </p>\n<p>Stiles' mouth snaps shut so fast he hears his jaw click. Before he can feel anything beyond the shock, Deaton leans forward and says, in the voice of a kindness that kills, \"Because that is where this leads. Even when records say that packs live in peace, their territory established and settled and well-guarded, that does not mean there are no deaths. It just means that the deaths are less obvious. The lives of werewolves are danger and violence and pain - and, yes, ultimately loss.\" Deaton draws back. \"You can walk away from this, Stiles. I see the way you look at the pack. No, don't give me that look, I'm not just talking about Derek. Or Scott. You're loyal beyond reason, and once you care about somebody, it's for life. Can you imagine losing any one of the pack? More than one? Because it's going to happen, no matter how hard you try to prevent it.\"</p>\n<p>Minutes pass, the seconds marked by an obnoxiously loud clock on the wall. Eventually, Stiles says, the words measured and even, \"Do you wish you'd walked away? That you'd never known any of the Hales?\"</p>\n<p>They stare at each other. If there'd been werewolves in the room, Stiles is sure, claws and wolf-faces would have come out.</p>\n<p>\"Touché,\" Deaton says softly. \"And no. Even now, I wouldn't have traded it for anything.\"</p>\n<p>\"There were eighteen people in that house,\" Stiles says, equally soft. \"That's double the size of my pack. Losing <i>all</i> of them - I can't even imagine.\"</p>\n<p>\"I knew you're in it for the long run,\" Deaton concedes, \"I just wanted to see if <i>you</i> knew.\"</p>\n<p>Stiles puts in the funnel and starts pouring mountain ash into the new bottle. \"You were out of it for years, though. You could have stayed away.\"</p>\n<p>Deaton smiles. \"I tried - though, admittedly, not as hard as I could have. If I'd really meant to retire, I would have moved out of Beacon Hills, quit being a vet altogether. But I've always had a weakness for helping lost pups, and I'd grown especially fond of Scott, who needs a guiding hand so very often.\"</p>\n<p>\"It does take a village,\" Stiles agrees, \"plus him and Derek not setting off each other's issues.\"</p>\n<p>\"They're very lucky to have you.\"</p>\n<p>Stiles hesitates. \"You know about - Derek and Kate Argent.\"</p>\n<p>\"Afterwards, yes, I managed to piece together the story.\"</p>\n<p>Stiles doesn't quite have it in him to ask if Deaton had blamed Derek for the fire. He knows Deaton doesn't <i>anymore</i>, and a teenager making extremely poor life choices is practically the unofficial town motto of Beacon Hills, but Stiles hadn't really known any of the Hales, can't begin to imagine how he could have dealt with such a thing happening to <i>his</i> pack.</p>\n<p>Because Deaton is very probably a mind-reader - seriously, Stiles legitimately believes the town vet is a) not human, and b) possessed of heretofore undisclosed psychic ability - he says, \"You're right to be curious about why I decided to actively help you, though.\" Deaton picks up a rag and efficiently wipes off granules of mountain ash that had spilled over the table. </p>\n<p>\"Yeah, I guess.\" Stiles shrugs.</p>\n<p>That smile again. \"Maybe I realized that - between the Alpha being descended of the old Alpha, the territory still remaining the same territory, and all the current werewolves having been made by a Hale - the pack here in Beacon Hills remains, in every way that matters, still the <i>same</i> pack.\" Deaton meets Stiles' gaze. \"The pack <i>lives</i>.\"</p>\n<p></p>\n<p>.</p>\n<p>Stiles sucks in a sharp breath. The words are too low for even enhanced hearing to pick up, but it doesn't take a genius to figure out what it means when a bunch of people's heart rates suddenly speed up at the same time without any obvious cause. </p>\n<p>The only functioning restrooms are in a small building halfway between the main gate into the compound and the warehouse they're in. Stiles has only needed to go once so far, and he'd scoped out the area while trying to walk as slowly as he can without making it obvious to his scowling guard. It would be useless to run towards the main gate, seeing as the smugglers are manning it, but if Brian heads for one of the other warehouses, and stays hidden until he finds a gap in the fence, he might make it out. </p>\n<p>Stiles could have made it, he's pretty sure. The police have surrounded the compound, from the heated discussions between the smugglers and the distant sound of vehicles and helicopters; he'd just have to get past the fence.</p>\n<p>Ten minutes pass, and then the side-door bangs open. Whiskey stomps in, followed by Frank, the guard who'd gone with Brian and also coincidentally the only one whose actual name Stiles manages to remember. </p>\n<p>They're dragging a bloodied and struggling Brian between them.</p>\n<p> </p>\n<p>\"Look, we need to have a way of contacting someone if we're in trouble,\" Stiles says patiently. He holds up the cell phone. \"I've given you all the number to this. Learn it. Love it. You need to be able to dial this number when you're blindfolded and tied up and have to dial using your thumb behind your back, using a phone that is not your own and therefore does not have your handy speed-dials.\" No one scoffs, because this is actually a thing that has happened, thank God for Stiles' memory for numbers.</p>\n<p>\"We'll take the phone in shifts,\" Derek says, coming to stand behind Stiles, \"Three days per person. The phone must <i>always</i> be charged. If you're going somewhere that has no coverage, leave it with somebody else. If it rings, you <i>must</i> answer it. The idea is that there'll always be someone we can immediately talk to in an emergency.\" Stiles discreetly elbows Derek, because he can tell without looking that Derek is giving Scott a pointed look.</p>\n<p>\"Obviously, don't call it unless it's an emergency,\" Stiles adds drily.</p>\n<p></p>\n<p>.</p>\n<p>\"I thought we said we weren't gonna shoot them?\" cuts in Bobcat.</p>\n<p>Jaws Boss sends him an ugly look, but grins at the hostages. \"We won't be <i>shooting</i> them.\"</p>\n<p>Brian screams when Boxer grabs him. Stiles is not surprised to be yanked to his feet as well, his abused shirt tearing under Whiskey's grip, and manages to hold in a yelp of pain from the stretch of his bruised ribs.</p>\n<p>Jaws Boss points at Dad. \"I told you I'd take it out on your kid if your people step out of line, Sheriff.\" The man grins. \"But I'm not a bad guy - I'll let <i>you</i> pick which one of them gets thrown to the <i>dogs</i>.\" Stiles looks sharply at Jaws Boss.</p>\n<p>The agonized look on Dad's face makes Stiles' decision for him.</p>\n<p>\"It was my idea!\" he improvises. If his voice squeaks, well, he's never going to be the manliest growler. \"I was the one who told him what to try, how to escape.\" And in case that doesn't get his point across, he adds, \"So you should punish me, not him.\"</p>\n<p>\"No - he didn't - <i><b>Stiles</b></i>!\" </p>\n<p>He doesn't look at his dad, doesn't dare to. Jaws Boss probably knows it's a lie, but the man shrugs, like it makes no difference to him, and nods at Whiskey. Brian is thrown back towards the group of hostages. Stiles doesn't resist when he's grabbed. Boxer starts dragging him towards the door.</p>\n<p>Then one of the newcomers calls out, \"Not outside.\" </p>\n<p>Jaws Boss snarls a \"Shut the fuck up\", but the guy just repeats, \"That was part of the deal. Those helicopters out there have cameras on them. And yeah, those snipers can't kill us, but they can still fucking <i>see</i> through their fucking scopes. You can sic us on your competition, but we are not getting compromised just so you can lord it over some fucking kid.\" He's mostly standing in shadow, but Stiles catches a flash of blue where his eyes would be.</p>\n<p>Which is how Stiles finds himself getting dragged towards to a clear area a little further into the centre of warehouse. More lights flare into life in the rafters far above - huh, maybe the dead light bulbs in the rest of the warehouse are not so much dead as kept deliberately dark. Stiles blinks at the additional brightness. Both the prison area for the hostages and the corner where the smugglers have set up shop would have a good view of the proceedings.</p>\n<p>Oh, goody.</p>\n<p>Just as they pass the pile of stuff confiscated from the hostages, Stiles ducks and practically throws himself away from Boxer, putting his weight into it. He hears his shirt rip, but he gets a few seconds of freedom, which he uses to dive into the garbage bag containing his backpack.</p>\n<p>He comes up clutching his lacrosse stick.</p>\n<p>The men pause. Jaws Boss calls out, \"Let the kid keep it. A bit of sportsmanship, yeah? Now that things are about to get <i>freaky</i>.\"</p>\n<p>Boxer and Whiskey drag him all the way to the spotlighted area, being none too gentle about it now. Stiles is not at all surprised when Boxer's fist comes flying out of nowhere and hits him right in the gut. Stiles doubles over, and Whiskey takes a swing, a solid punch to the side. Stiles flails his lacrosse stick at them, which they contemptuously bat away. The next hits his jaw, he doesn't even know who threw it, but the other gets him in the gut again.</p>\n<p>The blows hurt. It's not easy, it never gets easier, not since the first time with Gerard Argent. He doesn't think about his dad. He knows that the men are holding back. He looks the very definition of a pale, lanky nerd teenager, and they're thugs, the muscle of the group. Well, the human muscle. They're trying to make a point more than they're trying to kill him. </p>\n<p>And then Boxer and Whiskey are stepping back. Stiles sees the figures moving out of the shadows: Blue Eyes and Tattoos and Big Guns and Plaid Surfer and a couple of others.</p>\n<p>He thinks, <i>finally</i>.</p>\n<p></p>\n<p>.</p>\n<p>To be fair, he's not exactly convincing, what with the way he's unzipping Derek's jeans and slipping his hand inside.</p>\n<p>\"Didn't you have the phone over the weekend?\" asks Derek, breathing right into Stiles' ear; the movement of his lips catches against the shell, making Stiles shiver. </p>\n<p>\"And whose turn would that make it today?\" A muscle on Derek's stupidly broad shoulders flexes right under Stiles' nose, inviting, so Stiles bites it. The captured flesh is blood-warm, mildly salty to his tongue. Derek's so very careful when it comes to his teeth and nails on Stiles' skin, understandably - they're all fairly sure that the lycanthropy isn't catching when Derek is in human form, but Stiles appreciates the precaution, he's not at all smug that he makes Derek unsure about his control in the heat of the moment - and somehow, this translates to Derek really, really liking it when Stiles uses teeth and nails on him. Which Stiles is more than happy to oblige.</p>\n<p>\"Scott-\" Derek's breath stutters when Stiles digs his teeth in. Hard. Derek tilts his head the other way, unsubtly baring more of his skin. \"-yeah, okay, you're right, the phone's better off with you.\"</p>\n<p>\"Mmm, it really turns me on when you tell me I'm right.\" Stiles mouths his way up Derek's neck. His pants finally succumb to the combined efforts of Derek and gravity and flop down to the ground, pooling around Stiles' feet. They're loose enough for him to step out them. He still manages to trip on the way to the bed, but Derek is well-versed in the hazards of Stiles in the bedroom, has one hand on Stiles' back and the other hand palming his ass, and the two of them barely stumble. </p>\n<p>\"Good thing a lot of things turn you on.\" Derek's legs are bare when he lowers himself onto the mattress on top of Stiles. Stiles doesn't remember when Derek had shed the jeans and boxer-briefs; Stiles gives himself a mental high-five for a job well done, anyway, and moves on to pulling up Derek's shirt.</p>\n<p>\"I'm detecting sarcasm and a veiled insult there,\" says Stiles, \"But I'm going to ignore them because your chest is ridiculous and has paralysed my brain with lust, I'm pretty sure tactical advantage is the reason you show it off so much. Also, I may not have your wolfy nose but I know for a fact, mister, that you love how easy it is to get me going.\"</p>\n<p>Derek's hand cups the bulge in Stiles' boxers in response, stroking Stiles lightly through the cloth. Stiles lets out a soft noise and eagerly parts his thighs. He slings one leg over Derek's hip. Derek kisses him and says, \"Did you just call yourself easy?\" Derek's smirking, but Stiles can also hear a faint growl at the end, the kind that comes out when Derek's feeling unexpectedly possessive.</p>\n<p>\"I said it's easy to turn me on!\" says Stiles. \"Which is not the same as being easy. Well.\" He frowns thoughtfully. \"I guess it <i>can</i> mean I'm easy. But, like - specifically for, you know, you. Not easy for anybody else!\"</p>\n<p>\"Easy for me,\" repeats Derek, \"I like that.\" He kisses Stiles hard, claiming, tongue delving deep and lips on the verge of bruising. Stiles moans at Derek's relentlessness, barely registers Derek's hands peeling his boxers down. They're both breathing hard by the time Derek releases him.</p>\n<p>\"I've always been easy for you.\" The words slip out of Stiles before he can think about them. Which applies to half the stuff that comes out of Stiles' mouth, really. He might have held these ones back, though; they're a little too serious, a little weighed down by meanings that the two of them haven't acknowledged yet.</p>\n<p>Derek reaches over and places something on the bedside table. Right, the Emergency Phone. His face is hard to read. He doesn't look displeased, though. Maybe mildly uncomfortable? Stiles can work with that, that's his default state of being. </p>\n<p>\"How is it that even when you don't say anything, I can still hear the words speeding through your head?\" Derek grumps. Stiles chuckles. Before he can speak, Derek kisses him again. This time it's slower, though no less thorough; Stiles lets Derek in easily, savouring the way Derek's exploring his mouth. Derek's body settles over his, the friction of their bare skin building the heat between them. Stiles' hand makes its way to Derek's hair, while the other slips over Derek's shoulder and scratches at the skin between his shoulder-blades, exactly where his tattoo is. </p>\n<p>Derek groans. The hot length of his cock slides next to Stiles' own. Stiles arches up, cradles Derek's hips with his thighs. Derek doesn't seem to be in any hurry. His hands caress Stiles' neck, shoulders, arms, stomach. They kiss, and kiss, and kiss, until Stiles' jaw is aching from it, his lips stinging. He drinks in Derek's taste, breathes in breath from Derek's mouth, and quietly, secretly, <i>wants</i>.</p>\n<p>A while later, might be hours, Derek's human-blunt fingers digging into Stiles' thighs as his hips jerk forward, thrusting and burying himself deeper inside Stiles. He muffles Stiles' moan with his lips. Half out of his mind from the slow-burn pleasure, Stiles nearly misses, between one gasping breath and the next, Derek's whispered admission: \"Me too.\"</p>\n<p></p>\n<p>.</p>\n<p>Getting people out of a burning bus, keeping people together in a bad situation, shielding people from humans of a criminal persuasion - all of that, he's willing to concede, are things people like his dad are better trained, better prepared to do.</p>\n<p>But protecting people from werewolves, from other deadly things right out of legend and superstition - that's Stiles' job.</p>\n<p>He hears, distantly, Karen shouting, \"What the hell is that?\" Dad's alternating between calling his name and asking, \"Who are these people? What's happening to them?\"</p>\n<p><i>Werewolves, </i> he wants to say. <i>Surprise!</i> </p>\n<p>He's exhausted, and he hurts, and the hard part is just beginning.</p>\n<p>It's weird. He's been in a lot of tight spots before, but he's never felt this worn down.</p>\n<p>And that's when he realizes that he's never, before, been so utterly <i>alone</i>.</p>\n<p></p>\n<p>.</p>\n<p>He finds Derek on the second floor, next to one of the windows facing out the front of the house. Light from the sickle moon carves out the cuts and dips of Derek's body; it's one of those moments when Stiles can't quite believe that Derek is real, that Derek is someone Stiles is allowed to <i>touch</i>.</p>\n<p>\"I found something,\" Derek says quietly. He opens his hand. Stiles drifts closer and sees that there's a twisted length of metal resting in the middle of Derek's palm. \"My mom had a habit of stepping out whenever the weather was good and taking a walk around the woods. She hated carrying bags, but she always forgot to take her house keys out. It wasn't a big deal, there was usually someone else home, but she accidentally locked herself out enough times that she got a spare made and wore it around her neck.\"</p>\n<p>Stiles' eyes widen. Now that Derek has identified it, he can see the hole on the bow end where a necklace chain can be passed through. The blade half is badly warped, the bittings melted nearly smooth. </p>\n<p>Derek is looking at the key like he doesn't know if he wants to hide it away or throw it as far from himself as possible. It hits Stiles then, <i>Derek's mom died wearing that</i>, and <i>Derek knows exactly where his mom died</i>. He leans in towards Derek. Rests a hand on Derek's arm. Derek doesn't shake him off, continues standing there like a statue, so Stiles winds his arms around Derek's shoulders and presses their bodies as close together as he can. The house is cold, dead things are cold - but Derek is <i>alive</i>, running hot, and Stiles wishes he knows a better way of telling Derek just how glad he is of that. Of this.</p>\n<p>Stiles doesn't know how long they just stand there. He listens to Derek breathing, listens to the peaceful night noises coming from the woods outside.</p>\n<p>Finally, Derek rolls the piece of metal to the tips of his fingers, the piece of metal that had once been a key, and holds it out to Stiles. \"You keep it.\"</p>\n<p>Stiles gapes. No, seriously, he would not have been surprised to find his jaw on the floor.</p>\n<p>\"Or you can throw it away. Whatever you want.\" Derek shrugs, as if it doesn't matter to him.</p>\n<p>As if a key, to their little group, doesn't immediately bring to mind Lydia braving a monster with blood on its hands and Jackson willingly going to his death <i>and then coming back</i>. </p>\n<p>It's something, Stiles thinks distantly, that only people who'd been present that night can really understand.</p>\n<p>The metal is warm from Derek's skin. Stiles closes his fingers around it and tries to calm his pulse. He lets his head dip down to press his nose against the side of Derek's neck. He feels and hears Derek breathing deep, shivers at the cold press of Derek's nose against his own neck.</p>\n<p>Time goes syrupy-slow. Derek's arms slowly wind around Stiles' middle, his big hands resting low on Stiles' back. Stiles returns his arms over Derek's shoulders. They're the same height now, which Stiles likes, but Derek's distinctly broader, and Stiles maybe loves feeling enveloped by the heat of Derek's body. He never stops feeling restless, not really, but like this, it is as if Derek's touch dampens the edges of his thoughts, makes it easy to centre himself.</p>\n<p>When it no longer feels as though questions like <i>what does this mean?</i> and <i>how long can we keep not talking about this?</i> are about to burst out of him, Stiles clears his throat and says, \"Hey, let's get out of here?\" and Derek follows.</p>\n<p></p>\n<p>.</p>\n<p>Really? Cheesy villainous taunts? </p>\n<p>There's blood in Stiles’ mouth, he has to spit it out. He adjusts the cloth tied around his head. The ragged tail of it trails down the side of his face: a flash of red at the edge of his vision, his own personal flag. The stick is a comforting weight in his hand. </p>\n<p>\"You can't hide from us, kid. We can hear your heart, like a little rabbit's. Come out, come out, and give us a good chase-\"</p>\n<p>Two steps bring him out of the nook and back into the harsh light, and he can feel the attention of the werewolves settling on him, focusing, practically a physical weight. He shivers, feeling the cool air over his bare chest. He's never been comfortable about showing off his body, despite the way shirts don't last long around his friends. He's filled out some over the past year, at least, but he'll never be much more than pale and lean. </p>\n<p>He's on display now. Vulnerable. And yet - he knows what they're looking at.</p>\n<p>The scars.</p>\n<p>Three vertical lines down his right side. A thick slash across his abdomen. Puncture marks around one shoulder. A mess of lines high up his left arm. Blooms of once-burnt skin on his left side. Dozens of smaller cuts and bites at various stages of healing. Most prominent of all, and the most visually arresting: a deep mound on his chest, right over his heart, shaped unmistakably like a large claw. </p>\n<p>He'd made a note of it, earlier, because Stiles is the one who pays attention to details: everybody but Blue Eyes has visible scarring. For some reason, Blue Eyes is also the one who looks the most uncertain, now. He can't seem to take his eyes off the claw mark. </p>\n<p>\"He smells of wolf,\" says Blue Eyes. \"Why didn't any of you smell it on him?\"</p>\n<p>Tattoos shrugs. \"Thought it was one of you.\"</p>\n<p>\"He's like us?\" asks Big Guns.</p>\n<p>Stiles directs a look of, <i>seriously, where did you find these guys?</i> at Blue Eyes. The werewolf looks faintly abashed.</p>\n<p>\"No. It means he has a pack.\" Blue Eyes steps closer. \"Where are you from?\"</p>\n<p>So, no longer 'kid' now. Stiles considers answering. Before he can decide, Bobcat calls out, \"Some town I've never heard of.\" Right, Stiles had seen him going through all the hostages' stuff.</p>\n<p>\"<i>Where?</i>\" Blue Eyes repeats, a growl seeping through. </p>\n<p>\"Beacon Hills,\" Stiles answers. He grins. </p>\n<p>Well, he bares his teeth. </p>\n<p>Blue Eyes suddenly goes still. A couple of the other werewolves let out a low whine at whatever they're smelling from him.</p>\n<p>\"Boss?\" asks Big Guns.</p>\n<p>\"I've heard about the Beacon Hills pack,\" says Blue Eyes. He glances between Stiles and the other werewolves. \"They say that when hunters burnt down the home of the pack, the pack returned from the dead and killed every human responsible. They say that an Alpha pack visited and ran out like Death herself had their scent. They say that nothing supernatural leaves that territory alive without the pack's permission; that the pack has fought demon-creatures and death curses and beasts out of the old stories, and always won.\"</p>\n<p>\"To be fair, that dragon was a close call,\" Stiles says, resisting the urge to touch the corresponding scar. He starts spinning his lacrosse stick idly.</p>\n<p>\"It is said that an aspect of Old Vengeance, a <i>kanima</i>, was set loose upon the town, and the pack defeated it.\"</p>\n<p>\"The kanima was killed, yes,\" says Stiles, \"But the <i>human</i> was saved. It’s a thing we try to do.”</p>\n<p>Blue Eyes slinks closer, the gleam in his eyes looking more intrigued than bloodthirsty. \"They say that the pack has an archer who never misses, and a firestarter who is immune to an Alpha's bite; that of the humans who fight alongside tooth and claw, the most dangerous is a boy with a name no one knows, who bears a red standard-\" He halts, his gaze catching on the cloth around Stiles' head.</p>\n<p>Stiles waves. \"Hi. I bet you were expecting something a little more impressive, huh?\" The way that Blue Eyes and all the other werewolves are suddenly growling, irises flashing and elongated canines visible, tells him that they, apparently, find him impressive enough. </p>\n<p>Shouts of alarm are coming from the direction of the prison area, the other hostages, but there's nothing he can do about their fear; the best he can manage is to keep the werewolves' attention on him. One thing he's realized is that no matter how prepared he tries to be, at crunch time, his options are usually reduced to: try not to die in a gruesome and painful manner. </p>\n<p>At least he's had a lot of practice. </p>\n<p>Half the werewolves still look a little uncertain. So he smiles, grim and cocksure. \"For those of you who are new, welcome to the wonderful world of lycanthropy. I'm afraid there's no handbook - which, if there were, would have made my life a lot easier, somebody should get on that - but it's okay, you'll either pick it up quick, or you stop having to worry about it.\" The lacrosse stick makes a solid <i>tap tap tap</i> sound when Stiles strikes the butt of it on the concrete as he talks, hard enough to jar the wood. \"Here's the thing to remember: you may be a big, bad killing machine now, but there's always something out there that wants to kill <i>you</i>.\"</p>\n<p>Stiles's hands glide over the lacrosse stick, almost caressing it. Strange, how no one ever asks him why he’s carting around a <i>defensive</i> lacrosse stick. To put it simply: they’re longer. \"I'll give you guys a secret, because I'm generous like that: the thing that eventually kills you? Doesn't have to be bigger or badder than you are.\" He moves as if to spin the stick again- </p>\n<p>and then slides his grip along the shaft and pulls off a whole section at the end, including the head, separating what had appeared to be a continuous length of wood – a rarity in the sport, now, though they’d painted the stick to look like it’s carbon fibre – in a tricky but practiced twist of his hand. </p>\n<p>The newly-revealed end of the stick catches the light as he points it towards the wolves: a sharp, gleaming blade, curving towards the tip. \"On that note - have any of you heard the story of Little Red Riding Hood?\"</p>\n<p></p>\n<p>.</p>\n<p>Scott gives him an incredulous look, like he can't believe Stiles is refusing this tool of sparky protection after Stiles fought loud and hard for weeks that he ought to be trained to defend himself. Mr. Argent, on the other hand, gives him a rare look of - kindness? sympathy? - and puts the Taser away. </p>\n<p>His objection might have been a touch too strong, though, judging by the look on Scott's face, and Stiles doesn't feel like explaining. So he assays a half-hearted chuckle and says, \"Dude, I nearly shot you in the face with Allison's crossbow that one time. Can you, in good conscience, set me loose on the public with something that can electrocute people? Knowing my luck, next time we're at the mall I'll fall into the fountain and, like, barbecue the food court or something.\"</p>\n<p>Stiles doesn't look at Erica and Boyd, half-hidden amidst the trees behind him, doesn't look at Derek. But later that night, Derek shows up in his room and says, \"Erica and Boyd don't blame you for what the Argents did to them.\"</p>\n<p>\"I left them there,\" Stiles says, staring at the floor while the burn of <i>shame</i> licks up his insides, \"I could have tried harder to get them out.\"</p>\n<p>\"You couldn't have, not without risking Gerard hurting you worse.\" Derek's fingers close around Stiles' arm. \"You knew that he wasn't going to kill them. You did what you were supposed to. And they're okay, now. Werewolves heal.\"</p>\n<p>\"I'm not taking the Taser.\"</p>\n<p>\"It'll keep you safe.\"</p>\n<p>\"I'll find a way to keep myself safe that doesn't involve reminding you guys of traumatic experiences!\"</p>\n<p>Derek's face is so close to Stiles' own that he's basically breathing Stiles' air. \"Pain is part of being a werewolf, Stiles. You don't have to be <i>kind</i> to us.\"</p>\n<p>Stiles lets out a long breath. \"I know I don't.\"</p>\n<p>And then Derek is crowding him against his door, his rough hands cradling Stiles' face so gently that Stiles <i>hurts</i> from it. The kiss is slow, tender in a way that sets Stiles' heart pounding harder than any of Derek's past threats ever managed to.</p>\n<p>\"I'm going to keep you safe,\" whispers Derek harshly, in a way that Stiles knows means, <i>thank you</i>.</p>\n<p></p>\n<p>.</p>\n<p>Blue Eyes makes a run at him. He's inhumanly fast, and Stiles knows better than to try and track the werewolf's every move with his eyes. Instead, he predicts where Blue Eyes is going to be and <i>thrusts</i>. He feels his weapon meeting resistance before his eyes can register that he'd caught the werewolf right in the belly, a good four feet away and with his claws already mid-swing. </p>\n<p>Deaton calls the weapon in his hands a <i>glaive</i>, which Wikipedia described as a type of pole weapon, a spear with more of a knife at the end instead of a pointy tip. The metal blade is older than Beacon Hills, and the original weapon must have been a really fancy piece of work, from the designs etched into the blade. He doesn't know what happened to the original wooden pole body, but the scorch marks around the socket attachment give him some idea. The blade looks too thin to be practical; something Stiles should be grateful for, according to Deaton, since that may be why it hadn't been refashioned into a functional weapon again until it had fallen into Stiles' hands.</p>\n<p>The blade is sharp, and for all that it probably looks like a nail file to supernatural creatures, it's got no ordinary metal; this baby bites <i>deep</i>.</p>\n<p>Blue Eyes screams and spasms backwards, his hands automatically going to the deep puncture wound above his stomach. It's hard to see with all the black clothing - what is it with werewolves and dressing from the catalogue of Hot Topic, Stiles always means to ask - but he knows that blood is blooming out of the wound, a bright hot flower, spreading and soaking the cloth. He sees the red on the werewolf's hands, knows that it hurts, it's designed to hurt. Blue Eyes must be wondering why it's not healing instantly as it should. </p>\n<p>The other werewolves are taken aback for a few seconds, and then two of them charge at once. Stiles spins the stick and the blade whistles through what his brain thinks is empty air. Plaid Surfer and Guns howl in pain. Fabric from their shirts flap open, followed by skin, a testament to how ridiculously sharp that thin, thin blade is: it had sliced clean through the cloth and leather.</p>\n<p>The instinct to pump his fists and feel like he might actually have a chance at this fight is strong; experience tamps that shit down, no thank you, because he knows how wolves fight and these had only been taken by surprise. He knows how long werewolves can keep fighting; knows that no matter how much he bites he's still <i>cornered prey</i> here, one way or another, he can't leave without the other hostages and <i>Dad</i>; knows he might be able to take down one werewolf but he's up against a <i>pack</i>.</p>\n<p>Stiles isn't a natural fighter. He doesn't have the killing instinct - whatever the hell that means, Jackson - and he's more than fine with it, since his life is full of people who do, and from the number of times Stiles has had to save all their asses, it doesn't seem to be doing anyone much good anyway. Point is, he knows the score here, he's aware of the odds. These werewolves will wear him down eventually.</p>\n<p>He's just refusing to make it easy for them.</p>\n<p></p>\n<p>.</p>\n<p>\"How come our training is more like throwing ourselves at Derek and getting knocked to the ground?\" complains Isaac.</p>\n<p>Erica chuckles throatily and casts a knowing look at where Stiles and Derek are working on the practice mat. \"Well, Stiles is not getting knocked to the ground, anyway.\"</p>\n<p>Stiles ducks his head, feeling his face flush.</p>\n<p>\"What makes you think Derek's not the one throwing himself at Stiles?\" pipes in Boyd.</p>\n<p>Derek huffs a breath that tickles the back of Stiles' neck. \"Shift back this way, pull the stick in - you can lean back a bit more.\"</p>\n<p>Stiles ends up leaning back too far, or at least he thinks it's too far, because his ass is pressed firmly against Derek's upper thighs now, if they were sitting he'd be in Derek's lap, and he jerks upwards, not really thinking, and - oh.</p>\n<p>Nice to know that Stiles hasn't been the only one practically drowning in lust at having Derek pressed up against him and moving him around and breathing right into his space <i>for over an hour</i>. </p>\n<p>\"We should take a break,\" Derek suggests, low and heated; Stiles feels the vibration of Derek's chest against his back. \"Switch to the... real thing.\"</p>\n<p>The stick in Stiles' hand is a plain wooden one, though its shape and weight are almost identical to Stiles' modified lacrosse stick. He uses it to practice, and then spars with Derek using the real one after Derek puts on gloves. </p>\n<p>Gorgeous leather gloves, which have featured in a number of Stiles' more creative fantasies.</p>\n<p>It's a good thing Stiles has given up on being embarrassed by his bodily functions around werewolves, because being a teenager is... hard.</p>\n<p>Damn it.</p>\n<p>\"Sounds like a good idea,\" Stiles says, swallowing, and tries not to think about the way Derek's eyes drop down to his throat. \"You should, um, gloves. Get gloved up.\"</p>\n<p>\"Change your shirt,\" says Derek. \"The gloves are in the house, upstairs.\" Where the extra practice shirts are.</p>\n<p>Stiles nods. Arousal sings through his body, a heady tension under his skin; he's been on edge for so long he thinks his <i>bones</i> are aching from it.</p>\n<p>As they walk towards the front door - at a sedate pace, not hurrying at all - Stiles hears Boyd asking, \"So, pizza? I liked that place we went to last week.\"</p>\n<p>\"The one with the mystery meat toppings?\" says Erica doubtfully.</p>\n<p>\"It also happens to be on the other side of town.\"</p>\n<p>\"I'm sold.\"</p>\n<p></p>\n<p>.</p>\n<p>He doesn't. Blood splatters out over the concrete. </p>\n<p>Stiles senses Plaid Surfer creeping up on him too late to properly turn around. Instead, he thrusts backwards with the glaive, a blunt hit that happens to land squarely on the werewolf's chest. Plaid Surfer grunts, a sudden expulsion of air, and Stiles gets enough time to sweep the butt of the pole across the werewolf's legs, half-crouching and bracing the weapon with his body so he can put his whole weight into it. </p>\n<p>This move never works on Derek, because Derek is a crazy acrobat from another life and won't walk down stairs if he can somersault over them. But Plaid Surfer actually <i>falls on his ass</i>, what the hell, it makes Stiles simultaneously proud of himself and embarrassed on behalf of all homicidal supernatural creatures. </p>\n<p>Tattoos lets out an inarticulate cry of rage. It's all the warning Stiles gets before a hundred-and-something pounds of angry female werewolf crashes into him. He suspects being half-crouched actually saves him from getting his neck snapped off. As it is, he lands hard enough to knock his teeth together and just barely jerks his head back away from her sharp, pointy teeth. </p>\n<p>He'd somehow managed to bring the point of the glaive around in the right direction, though he doesn't actually remember doing it; the whole blade and a few inches of pole are <i>inside</i> her, <i>shit</i>, he thinks he can see the tip of the blade poking out of her back. Gross. Hot blood runs down his hands. She makes this wet, gurgling noise, and tries to pull away. Only his death grip on his weapon keeps it from being wrenched out of his hands.</p>\n<p>They separate. Stiles stares at her in horror and wonders if this is a killing blow. It wouldn't be for Derek or Scott, and probably not even the betas, a werewolf is stronger with a pack and all that. But nobody's going to Tattoos' side, nobody's guarding her while she tries to heal, they're all still focused on Stiles - and they should have brought Stiles down by now, not just mildly knocked him about, if they were a proper pack that actually works together.</p>\n<p>\"You're all omegas,\" he says, suddenly. \"You don't have an Alpha. One of you is a born werewolf, but you're all just Omegas who happen to be working together. You're not a <i>pack</i>.\"</p>\n<p>Blue Eyes snarls at him, and one of the unfamiliar werewolves stalks forward, but none of those are objections. They rush him. Stiles manages to get a few cuts in, and an accidental hard knock to someone's head that he's pretending is intentional. But he's tiring, and finally sharp claws tear into his grimy, unprotected skin. </p>\n<p>The sharp, bright pain makes him shout, though the adrenaline allows him to ignore it. His blood joins the layers of werewolf juices on the concrete floor. He sucks in breath after breath and spins his glaive like a man possessed. Big Guns tries to grab the pole at one point and ends up swearing the air blue while his hands revert back to human, the skin hissing and turning a toasty red.</p>\n<p>\"You guys suck as werewolves,\" Stiles says to Blue Eyes, \"I mean, my standards are not high, believe you me; but even by them, you kinda suck.\"</p>\n<p>He ignores the wetness on his side, the blood soaking into his jeans. There's a deep ache on his back, high up near his shoulder-blades; he ignores that too. His previously injured ribs are <i>screaming</i>. Tattoo's tackle must have strained his knee further so he's careful not to put much weight on it. His vision is starting to waver at the edges. </p>\n<p>He takes a claw to the arm on the next attack and barely manages to thrust the glaive left-handed to fend off a slash towards his neck. </p>\n<p>He hears the growl but can't turn fast enough to meet the werewolf - Big Guns, he thinks - and then his feet are off the ground, and the rusting surface of a large crate is rushing towards his face. He cries out when he hits it, taking the brunt of the impact in his shoulder and upper arm, his teeth knocking together. He's whipping the glaive around even as he crumples to the floor; a werewolf rears back, making a wet, choked sound as he bleeds from the neck.</p>\n<p></p>\n<p>.</p>\n<p>Stiles knows, objectively, that Derek is okay, that Derek has made a full recovery after going head-to-head with a dragon. A freaking <i>dragon</i>. He's been reassured by Scott, Lydia, Isaac, Allison, Scott, Allison-and-Scott, Allison-and-Lydia, Erica, Boyd, Scott, Erica-and-Boyd, Isaac-and-Scott, and even Deaton himself. But the last time he saw Derek, there'd been fire and bodies being <i>torn open</i>, he'd had to plead food poisoning for throwing up at the smell of his Dad making burgers at the grill, and it's ridiculously unfair that he's basically the last person in the pack to see Derek.</p>\n<p>\"Dude, Isaac showed you pictures,\" Scott is saying, \"You spoke to Derek on the phone. He's fine, not a single mark left on him, which is definitely more than I can say for you-\"</p>\n<p>And then Derek is walking through the door, and Stiles has never really thought of himself as being particularly aerodynamic, but it's like his body just <i>flung</i> itself through the air at Derek, and naturally the rest of him had to go along with it. Fortunately for everyone, Derek has lightning-quick reflexes and also werewolf strength, and is capable of not just taking Stiles' weight but adjusting him so that he can lift him properly, hands like vices around Stiles' thighs and Stiles' legs locked around Derek's waist.</p>\n<p>Derek's mouth is wet and hot and the single best thing Stiles has ever attached his mouth to. He's seriously considering never letting go of it, his dad would just have to deal. He keeps trying to talk, to tell Derek, <i>don't ever do that to me again</i> and <i>I may have serious-type feelings about you</i>, except <i>kissing</i>, so all that comes out are these desperate-sounding noises punctuated liberally by wet-sloppy-happy noises.</p>\n<p>\"Are you - really, you guys couldn't wait until I left the room?\" Scott's irritated voice floats over from somewhere. \"Stiles, you still have bandages - you know what, never mind. I won't make out with Allison in front of you <i>ever again</i>. Good to see that you're not dead, Derek. Call me when you're done - oh God, I did not mean that literally, I'll just - see you both later!\"</p>\n<p></p>\n<p>.</p>\n<p>Stiles breathes hard and locks eyes with the werewolf standing over him. Blue Eyes draws back his hand - and drops it, claws retracting.</p>\n<p>\"I can't,\" says Blue Eyes. \"You don't know what it means, to kill a pack's human. I'll be worse than dead when his pack finds out. I'll be <i>hunted</i>, and not just by his pack. Every pack with a human member will be after my blood.\"</p>\n<p>A shot rings out, making Stiles jump. Blue Eyes emits a high whine of pain. He staggers back. The bullet wound on his shoulder is already healing before Jaws Boss takes his place in looming over Stiles.</p>\n<p>Stiles swallows down a whimper. At least Jaws Boss can't hear how fast his heart is beating, even if the werewolves can. There's something trickling down the side of his face, and he's pretty sure it's not sweat.</p>\n<p>He's going to die. He's going to be shot, right here, in front of his dad, and all he can think about is how much he wishes Dad wouldn't have to see it. The <i>dying</i> part is still terrifying, he doesn't want to die, but he's used to it, too, and he kind of wants to laugh, a little, because there's some sweet irony in hanging out with a bunch of hormonal teenage werewolves, in being the target of countless curses and spells galore, in beating a ridiculous number of monsters right out of the Argent bestiary, only to be killed by a normal human with a gun.</p>\n<p>The barrel of said gun, a dark circle that fills and sucks up the entirety of Stiles' vision, is held at level with Stiles' eyes. Head shot, then. And Jaws Boss is carefully standing out of reach of the glaive.</p>\n<p>His father is shouting, trying to get to him.</p>\n<p>Stiles' body is shaking viciously, abject fear bursting up and choking him, the pain of his injuries forgotten in rush of instinctual, primal terror. </p>\n<p>He refuses to look away.</p>\n<p>He doesn't see Jaws Boss squeezing the trigger, but the gunshot echoes through the warehouse; his body jerks-</p>\n<p></p>\n<p>.</p>\n<p>\"Hello?\"</p>\n<p>\"Isaac, thank God,\" Stiles says, \"Turn on the news, big accident on the 101, I've been taken hostage-\" One of the smugglers is patting his pockets, frowning. Stiles panics and ends the call. He slides the cell across the floor.</p>\n<p>A rough hand grabs him by the shoulder. \"What the fuck do you think you're doing, kid?\" The smell of whiskey makes Stiles wrinkle his nose.</p>\n<p>Stiles doesn't know why the man bothers asking; the first punch lands before Stiles can even open his mouth to respond.</p>\n<p></p>\n<p>.</p>\n<p>It takes a couple of breaths for him to realize that he's <i>not dead</i>.</p>\n<p>His eyes focus and the shape in front of him resolves into a very familiar head. The back of a very familiar head, anyway.</p>\n<p>\"Oh my God, <i>Derek</i>,\" he gasps.</p>\n<p>A low growl is all he hears from Derek, worrying the part of Stiles' brain that never forgets he's soft and squishy and <i>prey</i>, but Stiles pushes the fear down, because this is <i>Derek</i>. It's been a while since Derek's gotten so caught up in the shift that he's not using words. Somehow, Stiles can still hear the <i>are you all right?</i> under all the wolf-whining and gnashing of teeth.</p>\n<p>\"I'm awesome,\" Stiles answers, \"So very, very awesome, because, you know, <i>alive</i>, it's real nice of you to drop in-\"</p>\n<p>Another gunshot cuts off his words. Derek's body stiffens, and Stiles can see drops of blood falling onto the concrete floor. He winces, this part's still not easy and he hopes he'll never be callous about it; but Blue Eyes is already fully healed, so the bullets can't have wolfsbane in them.</p>\n<p>Stiles looks to the side where all the hostages are, and sees his dad staring at him. At him and Derek, probably. Actually, all the hostages and some of the smugglers are staring at them. Stiles wants to go, <i>what, you guys haven't seen superhuman healing before?</i> </p>\n<p>\"The others?\" whispers Stiles.</p>\n<p>Derek's sideways glance says, <i>Nearby</i>. Derek catches sight of the other werewolves, and the growling amps up another notch, he seems to be <i>getting bigger</i> and loom-ier. Is Derek more pissed about the presence of other werewolves than <i>being shot full of bullets</i>? Stiles has never claimed to understand the supernaturally-inclined. Another low growl, and this one Stiles feels in his <i>bones</i>, wow, those are some serious vocal chords - Stiles blinks repeatedly, worries that a concussion is messing up his vision, because Derek is very definitely <i>getting bigger</i>-</p>\n<p>\"Holy shit,\" gasps Stiles, \"The Alpha form. You figured out the Alpha form.\"</p>\n<p>Derek's only response is a loud roar. He drops down to all fours, fur rippling up over his skin.</p>\n<p></p>\n<p>.</p>\n<p>Derek sighs, then lowers himself down next to Stiles. Stiles has never considered himself to be an outdoors person, but - he casts an appreciative eye at the spread of smooth skin over rippling muscles sprawled loosely over the grass - sometimes the scenery is a powerful motivator. </p>\n<p>\"That rogue pack,\" Derek says. \"They nearly killed everyone.\" Not exactly - they'd nearly killed <i>Stiles</i>. All the others who'd gotten caught in the ambush had been able to heal their injuries. </p>\n<p>\"I don't think you could have gotten there any earlier, even with the Alpha form,\" Stiles points out.</p>\n<p>\"We'll never know,\" Derek says, \"But the point is that we've been getting a lot of close calls lately, and we need all the strength we can get.\"</p>\n<p>Now it's Stiles' turn to sigh. \"Fine, I'll see what I can dig up.\" </p>\n<p>To his surprise, Derek rolls to his side and pushes himself up on one elbow, until he's looking down at Stiles. Derek closes the distance, kisses Stiles slowly. Stiles is fairly well-versed in the shape of Derek's kisses, and this one is most definitely all gratitude.</p>\n<p>Stiles gets lost in the kissing for a while. It’s a nice night, and there are currently no life-or-death situations looming over their heads. After a time, he feels Derek’s hand shifting over his body, shivers from the tease of fingers down his sides. He’s anticipating a sexy and clothing-minimal turn in the proceedings when those fingers dig bluntly into his waist, pinching and scratching in a very unmistakable way.</p>\n<p>“No, Derek, <i>hah</i>, you filthy cheater!” Stiles squeals, trying to wriggle away. Unfortunately, Derek is a literal wall of muscle on top of him. “Hahahaa, oh my God, <i>stop it</i>, are you five years old? Hah, no, <i>hahahaha</i>, I hate you so much, no no <i>not the knees</i>-“</p>\n<p></p>\n<p>.</p>\n<p>The human smugglers fall into disarray. The pack lets them go. Stiles sees Isaac, looking totally human, appearing at the main doors and opening them, letting the smugglers run outside but likely keeping a careful nose out for any werewolves attempting the same. It makes sense - killing a human, however criminal the human may be, is never a good idea if it can be avoided.</p>\n<p>The werewolves, however, are more than fair game.</p>\n<p>Stiles sees Scott and Allison teaming up against Big Guns, Boyd chasing after Tattoos, Lydia and Erica knocking out Plaid Surfer. Derek has clearly put dibs on Blue Eyes.</p>\n<p>\"Guys, try not to kill them, okay?\" Stiles says. He doesn't shout - they can all damn well hear him.</p>\n<p></p>\n<p>.</p>\n<p>But somehow the fates have conspired to have only Allison and Lydia, intent on having best-friend time that doesn't involve weaponry or the middle of the woods, being the only ones available for At The Movies Night. Which is different from Movie Night, which takes place far more regularly and usually, these days, at the Stilinksi residence. </p>\n<p>So Stiles has been kissing Derek for long enough that his jaw is starting to hurt, and enthusiastically ignoring the actual movie, when it hits him that <i>Derek is the only werewolf here</i>. </p>\n<p>Derek growls something when Stiles' hand finds its way into Derek's jeans. No actual words, though - probably due to the fact that Stiles is sucking on Derek's tongue. But Derek doesn't stop him. In fact, Derek <i>spreads his legs</i> to give Stiles a little more room.</p>\n<p>Luckily, the movie is full of city noises and dramatic soundtrack. Stiles still can't help but be aware that he's basically <i>jerking Derek off in public</i>. They're in the back row and it's not like anybody can see them, and really, who <i>hasn't</i> attempted a bit of inappropriate fondling at the movies? Derek's cock is hot and hard in his grip, and after a while the smell of him reaches even Stiles' human nose.</p>\n<p>Stiles' mouth starts to water. He really, really wants to get his mouth all over that heated skin, the cockhead now beading slick with precome. It's not like Lydia and Allison are going to judge. Instead, he mouths at Derek's neck, licks into Derek's ear. A couple of times, Derek's hand reaches out to cover his, stilling his movements, just before the movie goes silent, presumably for some kind of dramatic effect. Each time, Stiles can hear the unevenness of Derek's breathing, can see the look of concentration on Derek's face as he tries not to make noise; he looks beautiful, on edge - and <i>Stiles</i> had made him that way. </p>\n<p>The music starts up again. Grabbing Derek by the wrist, Stiles uses his free hand to bring Derek's fingers up to his mouth. He sucks two fingers in, eyes locked onto Derek's. <i>This is what I would be doing to your cock,</i> he hopes his face says. Stiles slides his tongue between the two fingers, and Derek shudders, <i>holy shit</i>, cock twitching in Stiles' grip.</p>\n<p>He keeps up the finger-sucking and hand-jerking combo until Derek lets out a deep groan and hauls Stiles in, mashing their mouths together. Stiles sloppily licks into Derek's mouth while Derek comes, hot fluid splattering over his hand and arm and both their clothing. The smell of semen is unmistakable, but Stiles is too turned on to care; he just got Derek off at a public movie theatre, sitting <i>right next to his friends</i>.</p>\n<p>Not that said friends have been oblivious. Stiles is trying to figure out if he should use his sock to clean up the mess when a pack of wet wipes falls onto his lap. His whole face heats up, but he looks over his shoulder at Lydia and says, \"Thanks.\"</p>\n<p>\"You're welcome.\" She sits back, seemingly focused exclusively on the screen ahead. \"It was a good show. Totally worth the price of admission.\"</p>\n<p></p>\n<p>.</p>\n<p>But, first things first.</p>\n<p>\"Derek?\"</p>\n<p>The Alpha form looks <i>huge</i> up close. A continuous, low growl is coming from Derek, and he looks at Stiles curiously. Stiles almost balks when those red eyes land on him, because there's no <i>recognition</i> there. He's been scared of wolfed-out Derek plenty of times in the past, but he's never seen Derek not being, well, Derek. </p>\n<p>Derek suddenly whips around and snarls. Boyd, who'd been cautiously approaching, hunches down and hurriedly backs away. </p>\n<p>\"Derek,\" says Stiles. His voice sounds too tentative. He clears his throat and tries again. \"<i>Derek</i>.\"</p>\n<p>When the Alpha's attention is back on him, Stiles takes a deep breath and makes himself step closer. His heart is pounding away, despite his exhaustion, and he knows all the wolves can hear it. In fact, there's a puzzled tilt to Derek's inhuman head, like he's wondering why the terrified jackrabbit of a prey is coming <i>towards</i> the predator.</p>\n<p><i>He did this for me,</i> goes the whisper in Stiles' head. <i>He's like this because of me.</i></p>\n<p>The dark fur is unexpectedly soft, though it has the appearance of bristles. \"Derek in a nutshell,\" he mutters under his breath. Derek goes still under his touch. Not in a about-to-bite-off-this-arm way, Stiles hopes. He strokes the fur on Derek's back, Derek's shoulder.</p>\n<p>\"Maybe you should talk to him,\" Scott's voice calls out.</p>\n<p>Derek growls, which makes Stiles automatically go, \"Stop that,\" before he can think better of it. He looks up and sees Scott crouched on top of a crate. Evidently this Derek is even more possessive of Stiles' attention. \"Are you sure that's a good idea, Scott? I don't know if he has the vocal capacity to tell me to shut up, he might just bite my face off.\"</p>\n<p>\"I'm pretty sure it'll help,\" Scott says. \"And he's not going to hurt you - look, all that stuff I said before, I didn't mean it, I told you, and even if I did, it's not true. When you called, and we saw the news, he was - Boyd and Isaac literally had to hold him down so he didn't come after you on his own.\"</p>\n<p>\"That was not a fun time for anyone,\" Isaac grumbles from somewhere among the crates.</p>\n<p>\"And he knew exactly where you were, and that you were in trouble,\" Scott continues, \"He could pick out your heartbeat.\"</p>\n<p>Stiles blinks. \"Like you can with Allison?\"</p>\n<p>\"Yeah,\" Scott says, though he looks reluctant, \"I - I think it's <i>exactly</i> like that.\"</p>\n<p>It’s not a new thing, it’s <i>not</i>, but still Stiles can feel his heart rate picking up. Stiles nods. \"Okay. But what does this have to do with me talking to him?\"</p>\n<p>\"I think it'll help him know it's you. Dude, your voice, the way you talk, it's as big a part of you as your scent.\"</p>\n<p>\"He means that your babble is practically an entity in its own right,\" Peter supplies, oozing out of the shadows in his usual manner. \"And Scott has a point. Clearly Derek realized that there <i>is</i> something he's willing to risk losing his identity for.\" Peter shakes his head. \"Of course, normally you're supposed to establish some kind of pathway <i>back</i>. Figures my nephew would ignore the issue for months and then throw his whole self into it in a life-or-death situation.\"</p>\n<p>\"Seriously? The power of love, again?” says Isaac.</p>\n<p>Scott shrugs. \"At least Derek's not paralysing people and letting himself be used as a weapon?\"</p>\n<p>At the edge of his range of hearing, Stiles just barely picks up his dad going, \"Suddenly the last few years make so much more sense.\"</p>\n<p>He resists the urge to pinch the bridge of his nose. He also realizes that he still has one hand buried in Derek's fur, that he never stopped petting Derek and, maybe, has started leaning a bit of his weight on Derek because his body's pain and exhaustion are empathically making themselves known. At some point, Derek had shrunk to approximately his human size, though he still remains on all fours. Derek is nosing at the wound on Stiles' side, whining in distress at the blood. He also keeps staring at the key-pendant, like he knows what it is but can't remember.</p>\n<p>Stiles is just glad Derek hasn't tried to lick anything.</p>\n<p>\"Stiles.\" Allison steps out of the shadow she'd been lurking in. \"We should see to the hostages.\"</p>\n<p>Oh, right. \"Good idea. Um. Let them know we'll let the cops in, I just need to talk to, ah, one of our rescuers.\" He can't quite make out the hostages' faces from here, too far and too much light on this side, but he can only imagine their state of mind right now. \"Um, maybe you, Allison, and Lydia should go first? Since you're human. And, sorry, gender stereotyping makes women seem less threatening.\"</p>\n<p>\"Hey!\" protests Lydia. \"I'm carrying a <i>flamethrower</i>.\"</p>\n<p>\"Yes, trust me, I'm very appropriately terrified. I would totally ask Scott and Isaac, because who can resist those puppy faces-\"</p>\n<p>\"Aw, thanks,\" says Scott, genuinely pleased and obligingly producing the aforementioned puppy face.</p>\n<p>\"-but yeah, society's stupid. Also, the hostages have just seen all the werewolves brutally savaging people, that kind of thing does not a good first impression make.\"</p>\n<p>\"Oh good, I'm so not someone you want dealing with trauma survivors,\" Erica says.</p>\n<p>Stiles sends all the werewolves except for Scott out of the building via a hole in the roof they'd made to get in. The werewolves also carry out all the enemy werewolves, dead or still-unconscious, so as not to leave evidence of the supernatural behind. Stiles has no idea what Allison and Lydia are telling the hostages, and doesn't quite care, at the moment.</p>\n<p>He looks down at Derek. Right, babble. \"So, your Alpha form is pretty cool, huh? How different is it from your normal shift? I want to know all about it, you know I'm going to talk your ear off until you satisfy my curiosity, so you should totally shift back and tell me.\" He ignores Scott's quiet snort. \"Dude, you have a <i>tail</i>. I don't remember if Peter had a tail. Too busy being terrified. Until I set him on fire. I'm not scared of you, though, am I? Well, okay, a little bit, but not much, just the part of my brain I can't really control, like how I always want to jump you when I see you. Current situation notwithstanding.\" Scott makes a strangled noise. \"Aaand moving on, because my father is over there and Scott is looking like a strangled rat, as if I haven't had to listen to him make out with Allison everywhere. Seriously, come back, you're <i>not</i> saddling me with the kids <i>and</i> a new wolfy pet. That was not in the pre-nup.\"</p>\n<p>Derek sniffs at his hand, and Stiles realizes that he's been clutching at the melted-key pendant. He uncurls his fingers, letting Derek see it. At first he thinks it's his imagination, but then Derek looks up properly, and- Derek's eyes are human.</p>\n<p>Faster, as if now that the change back has started, Derek's body is able to figure out the rest, the fur under his hands turns into hair - because his hand had ended up on Derek's head - and the rest of the fur recedes into human-looking skin. Stiles gives himself a moment to think, <i>holy shit Derek's naked</i>, before firmly pushing that detail to the side. Nothing he's not seen before. Nothing he can ever get tired of seeing, either, but <i>priorities</i>. He gently urges Derek up, \"that's it, great job, bipedal is the way to go,\" and the red eyes are still glowing strong, but Derek mostly resembles his normal wolf form now, and he's staring desperately at Stiles' face like he's scared Stiles will disappear if he looks away. Which is fine, since Stiles has one hand clutching at the back of Derek's head like he has no intention of releasing him, ever.</p>\n<p>His other hand finds one of Derek's, tangles their fingers together. He thinks Derek can probably finish the shift back on his own now, but he doesn't try to move away, and Derek doesn't let him go. Actually, Derek is pulling him closer. His body is producing crazy amounts of heat, which feels amazing against Stiles' bare and bruised upper body. The physical changes slow, Derek still looking not-quite-human. There's an uncertainty in his expression, and Stiles wants to be pissed at him for it, because Derek had been the one who had tried to make Stiles go away despite knowing that he needs Stiles.</p>\n<p>Or maybe <i>because</i> he needs Stiles.</p>\n<p>\"You make the worst decisions,\" Stiles tells him. \"Seriously. The absolute <i>worst</i>. Especially when you try to make them for other people. You don't tell someone that they have to <i>choose</i>, and then make the choice for them. Shitty choices are shitty choices, but at least they'll be <i>mine</i>. I don't know why I put up with you.\" He pauses. \"Well, okay, I do. And I'm going to tell you, for future reference, so you don't pull this kind of stunt that, believe you me, we'll be having a lot of <i>talks</i> about when we get home. But first, there's something you need to know.\"</p>\n<p>He leans in until their lips are touching. It's a chaste kiss, close-mouthed, though he can feel the press of too-large canines through the skin. When he speaks, it's a whisper over Derek's mouth.</p>\n<p>Three words.</p>\n<p>The only person close enough to hear anything is Scott. If anyone ever asks him, he'll say that the first word is \"I\" and the last is \"you\". As for the middle - well, that belongs to Derek alone.</p>\n<p></p>\n<p>.</p>\n<p>\n<i>.epilogue</i>\n</p>\n<p>\"Hmm? Oh, cool!\" Stiles wanders over to the kitchen table. He spots the postcards right away. \"They're from Mari and Paula!\"</p>\n<p>\"Nice of them to keep in touch,\" Dad remarks, because of course he's read them. But after discovering just how much his son had been keeping from him for years, Stiles doesn't blame the man for being especially nosy. To a point.</p>\n<p>\"As if you don't get letters from Karen and Chandan.\"</p>\n<p>Dad scowls. \"Who told?\"</p>\n<p>\"The whole Sheriff's department knows, Dad.\" Stiles weeds out the spam mail and brings the rest to the couch. \"They're very proud. Beacon Hills' own local hero!\"</p>\n<p>\"Stop that.\" Dad shifts uncomfortably. \"You know I hate taking all the credit when all I did was stand there and watch you-\"</p>\n<p>\"<i>Dad</i>.\" Stiles sighs. \"I'm okay. And the pack is very grateful to you for taking the credit for 'releasing the wild dogs', because this whole secrecy thing is, like, ridiculously important. Actually, you're kind of saving our asses by not making other packs come down on us for not disguising all the werewolf-inflicted violence better, so you really are a hero in that sense.\"</p>\n<p>\"It still doesn't sit right with me.\"</p>\n<p>Stiles chews on his bottom lip thoughtfully. \"You remember, when mom was in the hospital, and I complained about having to worry you'd get hurt and asked why somebody else couldn't do your job?\"</p>\n<p>\"And I told you that I was good at my job, and it wouldn't be fair to all the people I help if I give it to someone else who might not do as good of a job. I know, I know.\" He pats Stiles' knee. \"Look at you, all grown up. I'm sorry I missed it.\"</p>\n<p>\"You didn't miss it at all, Dad,\" Stiles says quietly. \"Scott's dad missed him growing up. You were right here, the whole time. Just because we only saw each other a few hours a day doesn't make us any less of a family.\"</p>\n<p>They stare at the TV for several minutes. Eventually, Dad clears his throat and asks, \"So, what do Mari and Paula say?\"</p>\n<p>\"Paula says she wants to become a veterinarian now, and Patrick keeps asking about what park rangers do.\" Stiles chuckles and turns to Mari's card. \"Mari says her college is offering to let her have a semester off to recover from, you know, what happened, and she's considering taking it and traveling for a bit. She also wants me to swing by and say hi when I get to southern California.\"</p>\n<p>Not all of their fellow hostages have kept in touch. Jocelyn and Brian have fallen off the face of the Earth, for all they know. But Karen and Chandan and, surprisingly, Zhe, regularly email the Sheriff, and Mari, Paula, and Patrick chat with Stiles every week on Facebook. So far, only Patrick's directly asked Stiles about werewolves. The kid's weirdly taken with Derek, and seems utterly convinced Stiles is <i>magic</i>. Stiles has made it clear to the other two that he's willing to talk about it if they want to, but he's not going to push.</p>\n<p>\"I still have no idea how you all managed to get into colleges within an hour's drive of each other.\"</p>\n<p>\"Lydia with a map is a force to be reckoned with,\" Stiles says. </p>\n<p>\"Deaton says that it's practically unheard of for a whole pack to move into south California without challenge. He says the packs there are old and very territorial.\"</p>\n<p>\"I may or may not have figured out which pack Blue Eyes came from,\" Stiles admits.</p>\n<p>\"Blue Eyes?\"</p>\n<p>\"Oh, I mean Mark Prahn, the only one who's a born werewolf. Anyway, turns out he ran away from home and has been a disgrace to werewolfkind since. His family's based in LA, but they have a lot of influence over most of SoCal. We sent him back to them in exchange for safe passage over the next five years.\"</p>\n<p>Dad gives him an impressed look. \"I hope none of you ever decide to run for office.\"</p>\n<p>Stiles makes a face at him. Just then, the doorbell rings. \"Pack's here!\"</p>\n<p>\"Oh, I forgot tonight's Movie Night,\" Dad says. He moves to get up from the couch.</p>\n<p>Stiles forestalls him. \"You're welcome to stay, you know. You're pack now, too.\"</p>\n<p>Dad looks up at him. \"Are you sure?\"</p>\n<p>\"Of course.\"</p>\n<p>The doorbell rings again, because Stiles' pack is a bunch of impatient puppies. Stiles rolls his eyes and goes to open the door.</p>\n<p>Scott is first in, and makes a beeline for the kitchen with barely a \"Hey Sheriff!\" called over his shoulder. The rest of the pack pour into the living room. No one seems surprised to see Stiles' dad still there, not even Lydia or Allison, and they all just find places to sit around him.</p>\n<p>Stiles pounces on the person who skulks in last and drags him over to where Dad is sitting on the couch, looking surprisingly relaxed to find himself surrounded by werewolves on all sides.</p>\n<p>\"Dad, this is Derek,\" says Stiles. \"Derek, this is my dad.\"</p>\n<p>It's supremely ridiculous, they've obviously met and already know each other. But Derek nods and sombrely holds out his hand with a subdued, \"Sir.\"</p>\n<p>Stiles wants to laugh, because he can practically feel the fabric of time and space warping in the room under the amount of effort the rest of the pack are putting into <i>not</i> staring at Derek and the Sheriff. </p>\n<p>From the kitchen, incongruously, Stiles can hear Scott whistling happily as he makes popcorn. Allison looks like she's torn between rushing in there to shut him up or blithely ignoring it like everyone else.</p>\n<p>Dad finally clasps Derek's hand. For all that the Sheriff is sitting down and Derek is standing, somehow there's a very definite sense of the Sheriff looming over Derek. \"You'll take care of my son, Mr. Hale?\"</p>\n<p>\"With my life,\" Derek says automatically. The tips of his ears blush red, but he holds the Sheriff's gaze.</p>\n<p>\"You've done a good showing of it so far, and a man can't ask for more than that.\" The Sheriff shuffles to the side to make space on the couch. Isaac gets dislodged, but his expression is sheer relief, and he does not look like he minds being consigned to the floor. The Sheriff waves at Stiles and Derek to sit. \"Come on, make yourself at home.\"</p>\n<p>\"Some of us <i>are</i> at home,\" Stiles stage-whispers, bouncing down onto the couch. He doesn't miss the way Derek firmly places Stiles between himself and the Sheriff.</p>\n<p>\"Thank you, sir, for your hospitality,\" says Derek. There's a formality in his tone that only comes out when he's speaking for the pack, as an Alpha. </p>\n<p>The Sheriff clearly picks up on it. \"Well,\" he smiles, settling back, \"I've been reliably informed that you're all family now.\"</p>\n<p></p>\n<p>\n<i>.end</i>\n</p>"
}