{
  "id": "5600752",
  "url": "https://archiveofourown.org/works/5600752?view_full_work=true",
  "author": [
    "JemKay"
  ],
  "title": "I feel safe in the 5 a.m. light (love in my arms and the sun in my eyes)",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "방탄소년단 | Bangtan Boys | BTS"
  ],
  "relationships": [
    "Jeon Jungkook/Kim Taehyung | V",
    "Kim Namjoon | Rap Monster/Min Yoongi | Suga"
  ],
  "characters": [
    "Kim Taehyung | V",
    "Jeon Jungkook",
    "Kim Namjoon | Rap Monster",
    "Min Yoongi | Suga",
    "Park Jimin (BTS)",
    "Jung Hoseok | J-Hope",
    "Kim Seokjin | Jin"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2016-01-03",
  "completed": null,
  "words": "8,031",
  "chapters": "1/1",
  "comments": "183",
  "kudos": "10,471",
  "bookmarks": "2,025",
  "hits": "122,191",
  "summary": "<p>And Taehyung thinks he’s never loved anyone more in his life than the boy above him who’s a little bit rough and sometimes a bit insensitive and maybe a little bit mean, but he’s also so soft and so gentle, and he treats Taehyung like he’s something so precious to him. And maybe he’s like that because of Taehyung, or maybe it’s because underneath everything, underneath the tough exterior and the sky-high walls, his heart’s more delicate than Taehyung’s, but all Taehyung knows is that Jeongguk fills up all of Taehyung's vulnerable pieces with parts of himself.</p>",
  "notes": "<p>listen....i've had this as a wip for so long because of <a href=\"https://galaxyfxn.tumblr.com/post/132761151807/jinned-v-jungkook-pick-him-up-you-just-gotta\" rel=\"nofollow\">this</a>, <a href=\"https://galaxyfxn.tumblr.com/post/132761191172/bangtenboys-squishes-arm\" rel=\"nofollow\">this</a>, <a href=\"https://galaxyfxn.tumblr.com/post/135608307972/jung-koook-q-what-you-wish-the-members\" rel=\"nofollow\">this</a>, <a href=\"https://galaxyfxn.tumblr.com/post/135652958642/tranquaos-taev-hyung-jungkook-struggling-to\" rel=\"nofollow\">this</a>, <a href=\"https://tae-nim.tumblr.com/post/122408705411/jungkook-the-cold-boyfriend\" rel=\"nofollow\">this</a>, and <a href=\"https://fy-taekook.tumblr.com/post/114063680710/love-on-top-do-not-edit\" rel=\"nofollow\">this</a>, so i'm kind of a huge mess rn. this was also supposed to be like 4000 words but do i ever stick to a plan. also!!! HUGE thank you to trish (@tranquaos on tumblr) who screamed with me abt taekook and abt this fic ily</p>\n<p>also p.s. u know i always have to include sugamon in my taekook fics bc i'm actual sugamon trash so... (be on the lookout my next fic will be sugamon!!!!)</p>",
  "text": "<p>i.</p>\n<p> </p>\n<p>The first time Taehyung really notices it, Jeongguk has him pressed down on the obnoxious orange couch in their living room that Taehyung found on a recycle Facebook page and fell in love with at first sight.</p>\n<p>Jeongguk has one hand up his shirt, stroking the soft skin just under Taehyung’s ribs, as his tongue delves between Taehyung’s lips, and it’s unhurried and gentle and tender, Jeongguk a heavy warmth against the chill of the heavy rain and dark clouds outside.</p>\n<p>And Taehyung loves it, but he’d probably be enjoying it more if his grip on Jeongguk’s shoulders wasn’t mostly due to half his body slowly sliding off the couch. The pillows, iron man blanket, and giant lion plushy he’d been sleeping with half an hour ago take up too much room, and Taehyung’s halfway off the couch before he realizes it, his upper body suddenly dropping off the cushions, and he yelps in surprise, hands fisting in Jeongguk’s shirt in an attempt to catch himself, eyes squeezing shut.</p>\n<p>But he never reaches the ground, because Jeongguk’s arm catches him, tight and secure around his waist, and the stronger boy easily hauls Taehyung back up onto the couch – which Taehyung doesn’t help with at all, he’s mostly dead weight in his surprise – and Jeongguk resettles Taehyung into his lap, strong hands keeping a firm but gentle grip on Taehyung’s hips, and teeth immediately sinking back into the warm skin of Taehyung’s neck.</p>\n<p>And Taehyung, who’d been the one to initiate the slow and relaxed and unhurried pace, who'd been teasing Jeongguk's patience, is suddenly ten degrees hotter and ten times needier about getting Jeongguk's hand down his pants. The rush of heat is so sudden that he’s positive his face is bright red, and he can feel the almost painful press of his dick against his jeans. He bites down his lower lip, knows he’s about to moan, and from what? From being picked up? Taehyung’s got more pride than that, except he’s suddenly very aware of the flex of Jeongguk’s shoulders and biceps under Taehyung’s fingers, and the curl of Jeongguk’s rougher hands on his hips and Taehyung lets out a half whimper half moan, something so erotic and obscene that Jeongguk pauses and leans back to get a good look at the smaller boy. And Taehyung might’ve been more embarrassed about it if he wasn’t so turned on by this point, and before Jeongguk can voice his confusion, Taehyung grinds down onto thicker thighs, delights in the way Jeongguk throws his head back and tightens his grip on Taehyung’s waist, loves the press of each finger into his skin, one hand sliding down to get a firmer grip on his ass.</p>\n<p>“<em>Jeongguk.</em>” It’s barely spoken, a mix between a moan and a whimper and a plea, and Taehyung’s stuck somewhere hazy and hot and heavenly. His shirt’s been tossed somewhere behind him, and Jeongguk’s other hand is sliding up to thumb over Taehyung’s nipple.</p>\n<p>“Yeah,” Jeongguk says, voice raspy and rough, and he presses a quick kiss to Taehyung’s swollen lips. “Yeah, okay.”</p>\n<p>He stands then, hands warm and sure in their grip on Taehyung’s thighs, and this time, the shift doesn’t make Taehyung yelp in surprise. It does make him even hotter though, enough for Taehyung's toes to feel tingly, and he wraps one hand around the muscles of Jeongguk's arm, wants to feel the flex of strength just under the skin.</p>\n<p>Jeongguk bumps into a few walls on his way to the bedroom, distracted by Taehyung’s pleading whimpers and the slight thrusts against Jeongguk’s solid form, but his hand cups the back of Taehyung’s head before it can hit the wall, gentle and reassuring and protective despite the roughness of Jeongguk slamming him back to grind up against him.</p>\n<p>Taehyung whines again, barely holding himself back from rutting up against Jeongguk’s steady form as Jeongguk carries him to their bedroom, so he settles for pressing kisses onto Jeongguk’s cheek and ear, not holding back the breathy moans because of the knowledge, the sudden realization, that Jeongguk is much <em>much</em> stronger than him.</p>\n<p>And Taehyung really, <em>really</em> likes that.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>ii.</p>\n<p> </p>\n<p>They’re walking back from Hoseok and Seokjin’s place when Taehyung sees the top of a Ferris wheel from a few streets over, and immediately begs Jeongguk to go.</p>\n<p>“Please please <em>please</em>,” he wheedles, tugging on Jeongguk’s arm before latching himself to his boyfriend’s side. “I never ask for anything!”</p>\n<p>That’s a lie, because Taehyung’s the type to ask Jeongguk to bring him back a souvenir when Jeongguk goes grocery shopping.</p>\n<p>Jeongguk glances between Taehyung’s puppy dog eyes and the red flag at the top of the Ferris wheel before sighing heavily – even though Taehyung knows that the quirk in his eyebrows means that Taehyung’s done something cute and Jeongguk wants to indulge him. He lets Taehyung tangle their fingers together and drag him up and down five different streets before Jeongguk actually googles the fair on his phone and leads Taehyung down one street and to the entrance with a fond smile, never once letting go of Taehyung’s hand.</p>\n<p>The fair itself is really fun, like the ones Taehyung remembers from his childhood. He plays the fishing game and the ring toss game and he wins an iron man stuffed figure that Jeongguk was eyeing at the milk bottle game.</p>\n<p>They don’t go on any of the roller coasters because even though Taehyung loves the rush of adrenaline, Jeongguk doesn’t, a mix of fear of heights and hating the twisting feeling of free fall in his stomach. And by this point in their relationship, it’s routine to skip over the roller coasters.</p>\n<p>(They’d gone through the awkward stage where Jeongguk tried to go on the rides but felt sick afterwards, and when Taehyung tried to go alone but it was no fun to be by himself, and when Jeongguk apologized every time they’d pass a roller coaster, but now – it’s comfortable. It’s a compromise.)</p>\n<p>Of all the rides, the Ferris wheel has always been Taehyung’s favourite, so Jeongguk sucks up his nerve to join his excited boyfriend. He’s not too scared about it any more, not after how many Ferris wheels he’s been on, but it still takes him a few seconds to get used to the shakiness of the compartment.</p>\n<p>“This is great!!” Taehyung exclaims, cheering as they’re moved upwards, and when they stop somewhere near the top, he turns to tuck himself against Jeongguk. “You doing okay?” he murmurs, petting Jeongguk’s hair as if soothing a spooked puppy.</p>\n<p>(It <em>is</em> really comforting, though.)</p>\n<p>“Yeah,” Jeongguk says, and there isn’t any tension in his voice, so Taehyung knows Jeongguk’s not lying to make him feel better. “I’m glad we came.”</p>\n<p>“Me too!” Taehyung grins up at him, cheeks turning pink in delight when Jeongguk curls both arms around his smaller form so Taehyung can cuddle into his chest.</p>\n<p>“The Ferris wheel is my favourite,” Taehyung tells him, drawing hearts on Jeongguk’s jean-clad thigh.</p>\n<p>“I know,” Jeongguk murmurs.</p>\n<p>“I love you,” Taehyung says.</p>\n<p>He can feel Jeongguk’s lips curl into a smile against his temple. “I know.”</p>\n<p>Taehyung gets a stomach ache from eating too much cotton candy at the fair, and Jeongguk, who’d given him disapproving glances and stared Taehyung down with an <em>I-told-you-so</em> look, rubs Taehyung’s tummy as the smaller boy whines about it.</p>\n<p>“Why didn’t you stop me?” Taehyung complains.</p>\n<p>“I tried,” Jeongguk reminds him. “You know you always crash hard from a sugar high.”</p>\n<p>He knows, and he does, because his emotions feel all out of whack and his stomach hurts. He glares down at it. “I hate my tummy.”</p>\n<p>“I don’t,” Jeongguk smiles a little crookedly, like he’s joking but also being totally honest. “I love your tummy.”</p>\n<p>Taehyung has nothing to say to that, ears turning red, because his tummy is soft and a little pudgy from his love of sugar and it’s nothing like Jeongguk’s strong abdomen, but Taehyung feels immense love for his soft tummy in that moment, for making Jeongguk smile so affectionately.</p>\n<p>“If you love my tummy,” Taehyung says, moving over to Jeongguk so he can snake his arms around Jeongguk’s shoulders and rest his chin on the firm shoulder. “Then please help it.”</p>\n<p>“Okay,” Jeongguk laughs, so warm and solid and secure beneath Taehyung’s hands. “What do you want?”</p>\n<p>“Carry me and my tummy home?” Taehyung pleads.</p>\n<p>“Yeah, okay,” Jeongguk agrees easily, laughter fond and something else, maybe something loving, and he turns so that Taehyung can clamber onto his back. And Taehyung’s not light or small by any means, but he’s smaller than Jeongguk which means he can reap the benefits of having a stronger boyfriend.</p>\n<p>He still feels a little bit guilty though. “I’m sorry,” he mumbles sleepily into Jeongguk’s shoulder. The sun is setting and the crash from the sugar high is making him feel tired. Jeongguk hasn’t stopped walking, and hasn’t complained either.</p>\n<p>“Don’t be,” Jeongguk reassures him, hiking Taehyung up a little higher, and Taehyung feels his stomach flip flop in a way that has more to do with how full his heart feels and less to do with Jeongguk’s rocking movement.</p>\n<p>“Thank you,” Taehyung makes sure to say, because at the end of the day, no matter how many times Jeongguk carries him when he’s sick or picks him up when he falls or saves him from a bad situation, it’s not something Taehyung can ever be ungrateful for.</p>\n<p>He’s so, so thankful, every day, even after four years, that he has Jeongguk in his life. That Jeongguk let him in when he was shutting everybody else out. It’s a position in Jeongguk’s life that Taehyung won’t ever give up, that he’d fight to keep, that he’d protect with his whole entire being.</p>\n<p>“I love you,” Jeongguk reminds him softly, nudging the side of Taehyung’s sleep-heavy head with his chin. “Go to sleep. I can still carry you.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>iii.</p>\n<p> </p>\n<p>The second time he notices it, Taehyung’s hiding from his boyfriend because he didn’t <em>mean</em> to splatter gold paint all over Jeongguk’s notes for a case study for his law class, and Jeongguk <em>had</em> said all the paper in the bin next to his desk were waste, but Taehyung couldn’t <em>really</em> be expected to tell the difference when he saw the notes just beside the bin. They all looked the same to Taehyung – useless.</p>\n<p>So he’s crouched behind the sofa, in the small space between the back of the neon orange fabric and the cream-coloured wall, both hands plastered over his mouth to quiet his giggles as Jeongguk’s footsteps fade down one of the hallways. He peeks his head around the side of the couch, and the room is empty, still, and quiet. He knows Jeongguk’s not as mad as he could be (and Jeongguk’s made the habit of always making two copies of his notes ever since he met Taehyung), but he still jumps in shock when Jeongguk’s suddenly above him, hands reaching for Taehyung.</p>\n<p>“<em>Found you</em>.”</p>\n<p>Taehyung scrambles away, hands trying to push away Jeongguk’s persistent ones, laughter falling from his lips. Jeongguk follows, shoving the couch to one side and leaving Taehyung trapped where the couch meets the wall and forms a ‘V’.</p>\n<p>“You really thought I wouldn’t find you?” Jeongguk asks, and Taehyung tries to squirm out of Jeongguk’s hands, but Jeongguk’s grip is strong, and he easily picks Taehyung up and slings him over one shoulder, butt pointed to the sky.</p>\n<p>And Taehyung freezes, hands limply gripping the back of Jeongguk’s shirt, because – <em>oh.</em></p>\n<p>He presses his face into Jeongguk’s lower back and tries to will away any sign of arousal before it’s apparent, because the first time this happened, it was okay, it was part of the <em>mood</em>, but this, now – it’s embarrassing.</p>\n<p>Jeongguk’s not even out of breath when he plops Taehyung down onto their bed, lips curled into a smirk, but it dissolves into a look of confusion when he takes in Taehyung’s flushed cheeks and otherwise motionless form aside from his heaving chest.</p>\n<p>Jeongguk frowns. “What’s wrong?”</p>\n<p>Jeongguk’s voice, his innocent bewilderment, is what draws Taehyung back from where his dick is begging him to go, and he blinks up at his boyfriend before launching himself upwards and forwards off the bed in attempt to tackle Jeongguk, fully expecting Jeongguk to catch him.</p>\n<p>“You’ll never take me alive!” he yells.</p>\n<p>The thing is though, the thing he’s always known, and just recently come to realize, is that Jeongguk’s going to catch him. Jeongguk’s always going to catch him. Jeongguk’s hands would be there before he even starts to fall.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>iv.</p>\n<p> </p>\n<p>Taehyung’s not embarrassed to admit that he’s a lightweight.</p>\n<p>Alcohol, coffee, even caffeinated tea, affect him stronger, and faster, than any of his friends. He even has to buy the kid’s medicine at the drug store because when he took the adult one he was knocked out for the whole night and half the next day.</p>\n<p>(Jeongguk, after calming down from his panic and being reassured that nothing was wrong, had laughed for <em>days</em>.)</p>\n<p>(But the kid’s medicine tastes way better anyway, so Taehyung thinks he’s the real winner here.)</p>\n<p>But the thing about alcohol, unlike caffeine or medicine, is that it makes Taehyung extra outgoing. Extra friendly. Extra boisterous.</p>\n<p>And sometimes, that friendliness comes across as flirting.</p>\n<p>It’s nothing Taehyung intends, and it’s never how he means for it to be, and Jeongguk knows it too, knows Taehyung’s level of curiosity and his disregard for personal space is sometimes interpreted to be something it’s not. And Jeongguk would never stop Taehyung from drinking, he’d never set rules for Taehyung like that, but he does make sure to pay extra attention to Taehyung when they go out to Seokjin and Hoseok’s house party.</p>\n<p>So when Seokjin makes his way to Jeongguk with an armful of water bottles, an exasperated look on his face, and says, “I think you should check on Taehyung”, Jeongguk doesn’t hesitate to look for his boyfriend (who’s wearing a black mesh shirt and a pair of black leather pants that look like they’re painted on, and Jeongguk had a really hard time letting Taehyung out of the apartment because of how good he looked).</p>\n<p>(There <em>is</em> a bright red mark on Taehyung’s neck though. Just above the collar of the shirt where everyone can see.)</p>\n<p>He finds Taehyung talking animatedly with another guy. The boy is shorter than Taehyung, milky-skinned and blond-haired, but it’s not the boy that made Seokjin come to find him. It’s the tall – taller than Jeongguk – darker-skinned boy just behind the shorter one, jaw clenched and eyes narrowed in annoyance as he looks between Taehyung and the blond boy, and Jeongguk knows if he doesn’t step in soon that the situation could get a lot worse.</p>\n<p>(It’s happened before.)</p>\n<p>“Hey,” Jeongguk says, and he slides an arm around Taehyung’s waist, settles his hand low on Taehyung’s hips.</p>\n<p>“Hey!” Taehyung smiles brightly back at him, lips stained red and rosy-cheeked. “You found me!”</p>\n<p>“Yeah, I found you,” Jeongguk smiles indulgently. He hands Taehyung the half-filled water bottle he’s carrying. “You know how sick you feel when you drink too much,” he reminds the slighter boy, and Taehyung nods in agreement, happiness and contentment rolling off him in waves.</p>\n<p>“Oh!” Taehyung says quickly, turning back to the smaller boy, excitement in his voice. “This is Yoongi! He’s also from Daegu!! And his boyfriend Namjoon. They just moved in across the hall!” He pats Jeongguk’s firm chest. “This is Jeongguk, my boyfriend.”</p>\n<p>“Nice to meet you,” Jeongguk smiles at Yoongi, and the boy behind him, whose jaw is unclenching and shoulders relaxing.</p>\n<p>“I <em>told</em> you,” Seokjin grumbles when he finds the four of them later, and Namjoon looks a little embarrassed. “I told you he has a boyfriend. Stop thinking every guy Yoongi talks to his hitting on him.”</p>\n<p>“Huh?” Yoongi says at the same time as Taehyung’s “what?”</p>\n<p>And then Yoongi sighs and rolls his eyes. “Kim Namjoon, I swear to god…I thought you said we were supposed to make friends tonight?”</p>\n<p>Namjoon splutters for a few second in protest. “I just – you’re <em>cute</em>. I’m always going to think people are hitting on you!”</p>\n<p>Yoongi scoffs but his ears are pink and he leans a bit further into the taller boy. “So dumb,” he says, and maybe he wanted it to be mean but the small smile and the way he curls his smaller fingers around Namjoon’s bigger ones makes it more affectionate. “I bet Taehyung’s boyfriend doesn’t think that every guy who talks to him is flirting with him.”</p>\n<p>Jeongguk tries to keep his face as blank as possible, but Yoongi catches <em>something</em>. “Oh, you’ve got to be kidding me.”</p>\n<p>“What?” Taehyung turns to look back at Jeongguk. “<em>Really?</em>”</p>\n<p>“No,” Jeongguk denies immediately.</p>\n<p>“He’s such a liar,” Yoongi says, and Jeongguk doesn’t even deny it because Taehyung has a pleased curl to his lips when he looks coyly up at Jeongguk, and Jeongguk starts to realize that maybe Taehyung always knew about Jeongguk’s jealous side. And maybe Taehyung likes to test the limits of it, just to see what Jeongguk will do.</p>\n<p>So he drops his gaze to the glimpses of golden skin he can see through the mesh of Taehyung’s shirt, dragging his gaze down to the way the leather pants hug Taehyung’s long legs, staring maybe a bit too long at the slope of Taehyung’s hips down to his inner thigh, and when Jeongguk’s eyes flicker back up, Taehyung’s no longer wearing a smug expression. If anything, he’s starting to look a little needy, and Taehyung’s biting down on his lower lip like he does when he’s starting to get a little bit desperate.</p>\n<p>So Jeongguk turns his gaze back to Yoongi and Namjoon and Seokjin, pretending to ignore the way Taehyung lets out the barest hint of a breathy whine against his neck when he presses into Jeongguk’s side.</p>\n<p>Jeongguk smirks.</p>\n<p>He’s the <em>only</em> one who can make Taehyung like this, can make Taehyung this desperate without even touching him, and maybe Jeongguk does it often enough that it’s a little bit mean, but he always makes sure to get Taehyung off in the end.</p>\n<p>But to Jeongguk – it’s like a reassurance to Jeongguk, seeing physical proof of just how deeply he can affect Taehyung, of just how much trust Taehyung places in his hands.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>v.</p>\n<p> </p>\n<p>Taehyung has this one bracelet, thin brown leather wrapped intricately around a delicate silver pendant, that he wears every day.</p>\n<p>It’s almost a part of Taehyung now, and Jeongguk wouldn’t care about it, except that the bracelet was given to him by his ex-boyfriend. The one before Jeongguk. The one who moved to Australia, which was the only reason for their break up, and when Jeongguk and Taehyung started dating, when they’d go out to cafes and restaurants, the waiters would always ask where <em>Minjun</em> was.</p>\n<p>So when Taehyung doesn’t bother to mention that Minjun is back in town, that Minjun is the person he met up with for dinner, and Jeongguk has to find all this out when Jimin asks about it, he’s not happy. At all.</p>\n<p>He’s stands at the kitchen counter silently, and Hoseok, who’s rummaging through the fridge, finally pokes his head out, brows furrowed in confusion at Jeongguk who’s stopped making any noise, but all Jeongguk’s forced to listen to is Taehyung’s excited laughter about seeing Minjun again.</p>\n<p>And maybe Hoseok sort of starts to get it, because he glances out the doorway into the living room, where Jimin and Taehyung are, and then back to Jeongguk’s still form, robotically pouring a bag of chips into a bowl. “Did you not know?” He asks, tone slightly clueless.</p>\n<p>Jeongguk pauses his movements for a second, and then sets the empty bag back down, and picks up the bowl without answering Hoseok. He doesn’t think he can.</p>\n<p>Taehyung’s still talking about Minjun when Jeongguk walks out into the living room and places the bowl of chips down on the coffee table. Both Jimin and Taehyung immediately dive for it, the soju bottle on the table mostly empty, and he tries to ignore the rushing in his ears and the way his stomach clenches when Taehyung says, “<em>We went to this fancy restaurant, and he knew the guy who owns it! I got to try really fancy wine and they gave us this super good chocolate cake for dessert but we had to share because it was so big!</em>”</p>\n<p>“Wow,” Jimin says, face a litte flushed from the alcohol. He glances up at Jeongguk, who moves to walk back to the kitchen because he doesn’t want to be forced to listen to this. “I haven’t heard about Minjun in a long time. I’m surprised Jeongguk was okay with you seeing him.”</p>\n<p>Except Jeongguk’s <em>not</em>, and he hadn’t even <em>known</em>.</p>\n<p>“Ah,” Taehyung says dismissively, uncoordinated hands betraying his tipsiness. “Jeonggukie doesn’t care!”</p>\n<p>And Jeongguk tries – he really does try – to ignore it, but he <em>can’t</em>. “…I do care.”</p>\n<p>Jeongguk says it so quietly that Taehyung almost misses it. Taehyung lets out a snort of drunk laughter.</p>\n<p>“No you don’t!” Taehyung’s still laughing, like it’s funny, like Jeongguk doesn’t feel as if every word about Minjun is like he's listening to nails on a chalkboard. “You didn’t say it bothered you before I had dinner with him!”</p>\n<p>Jeongguk takes a deep breath, because this is <em>Taehyung</em>, <em>drunk</em> Taehyung, but he can’t stop the swirl of annoyance and irritation itching beneath his skin. And there’s a feeling of betrayal too, so small but so powerful, the whisper of it like a jeering voice in the back of his head.</p>\n<p>“You never told me,” Jeongguk says, so coldly, so unable to reign in the sliver of frostiness in his voice, that the smile slips off Jimin’s face and he suddenly starts to look very, very uncomfortable, stuck between Jeongguk’s still form near the entrance to the kitchen and Taehyung next to him on the couch.</p>\n<p>“Oh,” Taehyung says, uncaringly, giggly. “Oops.”</p>\n<p>It’s silent for a moment, broken only by Taehyung’s breathless laughter, and he’s drunk, and it’s probably why he can’t tell that something’s wrong, that Jimin’s soft, “<em>Taehyung…</em>”, and Jeongguk’s clenched jaw are worth paying attention to.</p>\n<p>Jimin looks as if it’s painful to be sitting in between them, but Jeongguk’s glad for Jimin, because right now, he doesn’t want Taehyung anywhere <em>near</em> him.</p>\n<p>“What?” Taehyung asks. “Jeongguk’s not <em>mad</em>.”</p>\n<p>The way he scoffs it, like Jeongguk has no right to be upset about Taehyung practically going on a date with his ex-boyfriend, make indignant walls slam up inside Jeongguk, and suddenly he’s more than mad. He’s almost furious.</p>\n<p>And then Taehyung’s reaching out for him, because alcohol always makes him extra clingy, but Jeongguk’s <em>not</em> having it, especially not when he can still see Minjun’s bracelet on Taehyung’s wrist, branding Taehyung as if Taehyung could never fully belong to Jeongguk. And that’s the core of it, really, of Jeongguk’s rawest fears. That Taehyung would up and leave him one day, that Jeongguk would be left behind with only the ugliest parts of himself, that Taehyung, who’d taken the time to pick out every good thing about Jeongguk, would decide that Jeongguk wasn’t worth it, that he could do better, that Jeongguk could never treat him gentle enough.</p>\n<p>Taehyung’s hand wraps around his wrist and Jeongguk immediately tenses up, face hardening and eyes shuttering closed, body unyielding to Taehyung’s tug on his arm, and he shrugs Taehyung’s hand off, a kind of roughness in his movements that’s unfamiliar to Taehyung. Taehyung, for a split second, looks shocked.</p>\n<p>Jimin gets up and disappears into the kitchen at some point, grabbing Hoseok and fleeing the apartment, but Jeongguk barely notices, not when it feels like there’s something hard and heavy on his chest, making it difficult to breathe.</p>\n<p>Taehyung looks up at him in askance and confusion, maybe getting it finally, that something’s wrong, says, “What’s wrong with you?”</p>\n<p>“What’s wrong with <em>me</em>?” Jeongguk’s ice cold, unfriendly, and cruel, and it’s something Taehyung’s rarely, if ever, had directed at him. “I don’t know, maybe I’m just a little <em>upset</em> that you were having dinner with your ex-boyfriend. <em>Without telling me</em>.”</p>\n<p>Taehyung’s expression clears, and he starts to look annoyed, and sullen too, says crankily, “So what?”</p>\n<p>“You didn’t <em>tell</em> me,” Jeongguk says.</p>\n<p>“I <em>forgot</em>,” Taehyung crosses his arms over his chest, juts his chin out petulantly.</p>\n<p>It’s silent for a moment, as they glare at each other, and Jeongguk doesn’t know whether to blurt it all out, every single insecurity he’s ever had about <em>Minjun</em>, or to turn around and walk away, to leave it festering and then go meet up with one of his own ex’s so Taehyung can know exactly how it feels. Maybe he could hurt Taehyung just as badly as Taehyung’s hurt him.</p>\n<p>But he can’t do that to Taehyung, no matter what, not even when Taehyung’s hurt him the most right now, after four years of dating.</p>\n<p>“You still wear his bracelet,” Jeongguk says suddenly, eyes the brown leather.</p>\n<p>“Huh?” Taehyung says, eyes glancing down at it too. “So?”</p>\n<p>“I hate it,” Jeongguk says, a little bit fiercely, too rough to be anything less than brutally honest. “I fucking <em>hate</em> it. When I see it – it’s like…it’s as if you can never fully be mine, like you’re holding onto something with <em>him</em>.”</p>\n<p>Taehyung looks shell shocked, sober for the first time all night. “But…you never said anything before.”</p>\n<p>Jeongguk only shrugs, looking for a better answer from Taehyung, something to reassure him, to take away four years worth of insecurities.</p>\n<p>“It doesn’t mean anything to me,” Taehyung says softly, so softly, and his voice quivers a little too, like everything’s catching up with him and finally making sense. “I just like the bracelet, it never meant anything. I’m not holding onto Minjun, I <em>swear</em>, I promise, <em>Jeongguk</em>, I – <em>please</em>.”</p>\n<p>And maybe it’s the pleading tone, or the wetness of Taehyung’s eyes, or just Jeongguk’s own resolve breaking – never very strong when it comes to Taehyung – but some of the ice in Jeongguk’s expression melts away, a crack forms in the rough exterior, and Taehyung throws himself at Jeongguk.</p>\n<p>Jeongguk barely rocks backwards as he catches Taehyung’s lithe body, curling tight arms around Taehyung’s waist, just shy of possessive, and Taehyung buries his face somewhere in the space between Jeongguk’s neck and shoulder, muffling these pathetic little sobs that make Jeongguk’s heart hurt.</p>\n<p>And despite the instant reassurance from the strong arms that come up to catch him, and hold him close, Taehyung has to be sure, so he blubbers apologies into Jeongguk’s neck. Because it’s so strange to him, almost an alien feeling, for Jeongguk to be unyielding to Taehyung’s hands. Like the walls Jeongguk built between himself and the rest of the world are suddenly keeping Taehyung out too. And all he can think about is how Jeongguk had turned cold eyes and an uncaring voice on him, and how Jeongguk didn’t even want to be touched by Taehyung. It was like the Jeongguk of four years ago, when they first met, so callous and mean and unsympathetic, but even back then he never acted like that towards Taehyung. Even back then Taehyung was different to him.</p>\n<p>So it hurts to get that now, four years later, when Taehyung knows Jeongguk like the back of his hand and knows that Jeongguk wouldn’t act like that if he wasn’t truly upset.</p>\n<p>And Taehyung was the cause of that.</p>\n<p>“Taehyung,” Jeongguk says, and it’s soft again, gentle and soothing, the side of Jeongguk that Taehyung never intended to take for granted. “It’s okay, calm down.” Taehyung’s so relieved to hear it that he can’t stop crying into Jeongguk’s neck, hands gripping tight fists into the back of Jeongguk’s shirt as he trembles in Jeongguk’s arms, barely keeping himself together. It’s half because of how fuzzy the alcohol makes his head feel, and half because they’ve never had a fight like this before, leaving Taehyung an emotional wreck.</p>\n<p>When Jeongguk tries to pull back, Taehyung panics and grips onto his boyfriend tighter, and his own insecurities slip out in his fear. “<em>Don’t let go of me!</em>”</p>\n<p>Jeongguk freezes for a moment, large hands on Taehyung’s shoulders, before he slides them back down to curl around Taehyung’s skinny frame, and Taehyung’s wrapped in warmth and safety and love, and <em>why can’t he stop crying?</em></p>\n<p>“I’m sorry,” Taehyung says thickly, voice watery. “I’m so sorry for what I said, and what I did. Just – <em>please</em>, don’t let go of me.”</p>\n<p>“I won’t,” Jeongguk says, voice both gentle but rough at the same time, somehow, the very contradictory mix that makes up Jeongguk, and he cups the back of Taehyung’s head, fingers working through messy locks soothingly. “I won’t let you go.”</p>\n<p>“Promise?” Taehyung asks, voice small and meek, legs weak and unsteady and he’s held up almost entirely because of Jeongguk’s immovable form and the steady grip he has on Taehyung’s smaller one.</p>\n<p>“I promise.”</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>vi.</p>\n<p> </p>\n<p>Taehyung’s always been a pretty light sleeper, unlike Jeongguk, who could probably sleep through an earthquake if it ever happened – (he sleeps through thunderstorms, which is annoying because Taehyung always jerks awake at the first crack of thunder) (Jeongguk, even asleep, seems to feel it anyway because he always ends up reaching to tug Taehyung closer to him) – so Taehyung’s the only one whose eyes snap open to the creaking sound of footsteps coming from the hallway.</p>\n<p>He blinks, confused and disoriented for a few seconds, stuck somewhere between dreams and reality, but then he hears it again, muffled footsteps and the front door closing, and something cold like fear settles in his stomach.</p>\n<p>“Jeongguk,” he whispers, nudging the sleeping boy beside him. Jeongguk doesn’t wake, doesn’t even move, and when Taehyung hears the noise again he panics, shaking Jeongguk, his whispered voice wavering in his anxiety. “Jeongguk!”</p>\n<p>Jeongguk’s eyes flutter open, and he stares up at Taehyung for a second, brow furrowed in confusion, until a noise from the front of their apartment cuts through the silence of their bedroom, and Jeongguk props himself up on one arm, staring in bewilderment at their closed bedroom door.</p>\n<p>“Jeongguk,” Taehyung’s shaking hands settle on Jeongguk’s arm, wrapping around the lean muscle because he can’t tell if he wants Jeongguk to go check what it is or to stay with him, but Jeongguk decides for him.</p>\n<p>The younger sits up and presses a dry kiss to Taehyung’s forehead, smiles gently down at him. “Stay here, okay? I’ll go check it out.”</p>\n<p>“No, don’t.” Taehyung doesn’t release his grip on Jeongguk’s arm, because he’s <em>seen</em> stuff like this on t.v, and in horror films too, and all he’s learned from those movies if that you’re never supposed to go check out the noise!</p>\n<p>But Jeongguk takes hold of Taehyung’s hand that’s wrapped around his arm and presses a kiss to the palm of it, and with a, “I’ll be right back”, he heads out the door, annoyance and irritation set in his features before he shuts the door behind him.</p>\n<p>It’s silent for a few moments, and Taehyung grips the comforter between white fingers as he strains to hear any sound at all. He startles when he hears a muffled bang and Jeongguk’s, “Oh, what the <em>fuck</em>?!”</p>\n<p>Taehyung’s up and grabbing Jeongguk’s dance trophy off the shelf at that point – (the one that had actually fallen off the shelf and hit Taehyung’s head one time when they were wrestling, and Taehyung had to go to the hospital and get staples in his head because it wouldn’t stop bleeding, and Jeongguk had felt so bad about it that he treated Taehyung so delicately for a solid month afterwards, even though Taehyung didn’t blame him for it, but still, it was nice, so nice, to be treated like the most precious thing in Jeongguk’s life). His worry for Jeongguk overrides his fear, and he bursts out of their bedroom door with the trophy held high above his head.</p>\n<p>He finds Jeongguk in the hallway outside the kitchen, sprawled out on the floor with a drunk Jimin curled into his chest, and then Taehyung and Jeongguk blink at each other, Taehyung still holding the trophy as if it were a baseball bat.</p>\n<p>Jeongguk’s irritated expression morphs into laughter. “Coming to save me?”</p>\n<p>Taehyung lowers the impromptu weapon sheepishly. “Yeah.”</p>\n<p>It’s silent for a moment, until Jimin mumbles something about ‘Hoseok’ and ‘stupid head’, and then Taehyung sets the trophy down and moves to help get his best friend up and off of his boyfriend.</p>\n<p>Jimin wakes up when Taehyung slips his arm under Jimin’s armpits to heave him up. “Taetae!” he exclaims, pushing off of a disgruntled Jeongguk to face plant into Taehyung’s arms. “I told the taxi guy driver man to take me home….to you! My favourite best friend Taetae!” he pauses for a minute, eyes trying to focus on Taehyung. “I love you so much, did you know that? Also I think I drank too much.”</p>\n<p>“I think you did too,” Taehyung laughs, half-dragging Jimin to their guest bedroom. Jeongguk moves to lift Jimin into his arms, because Taehyung’s struggling a little bit under Jimin’s drunk weight, so Taehyung goes to fluff the pillows and get a glass of water to place by the bed. Jimin’s still slurring about Hoseok (his crush), and about ‘stupid-head’ (aka Hoseok), and how ‘stupid-head’ doesn’t even like him back (Hoseok probably had to leave the club early and Jimin’s drunk brain probably took it personally).</p>\n<p>He pets Jimin’s hair as he settles under the sheets. “Don’t die in the night, okay Jiminie? Get a good sleep.”</p>\n<p>“I love you Taetae,” Jimin mumbles. “You always take care of me the best, and I love you.”</p>\n<p>“I love you too Jiminie,” Taehyung pets his head one last time before turning off the lights and leaving the room. Jeongguk’s waiting for him in the dimly light hallway. “Everything okay?”</p>\n<p>“Yeah,” Taehyung says, and suddenly yawns, and he feels ten times more tired now, after the adrenaline wares off.</p>\n<p>Jeongguk reaches for Taehyung’s hand and tugs him back to their bedroom. “Let’s get you to bed.”</p>\n<p>“M’kay,” Taehyung nods sleepily, and ducks under Jeongguk’s arm so he can tuck himself against the lean line of muscle. Taehyung could probably fall asleep standing up, in Jeongguk’s arms, because everything’s warm and soft and safe, except Jeongguk urges him forward with a warm hand on his lower back, and Taehyung follows, crawling onto the bed until he reaches his side, and flops down under the covers. His eyes snap back open though, when he suddenly remembers. “Hey Jeonggukie?”</p>\n<p>“Yeah?”</p>\n<p>“Could you, just like, check all the windows? And double check the door? That everything’s locked?” Taehyung tries to sound nonchalant, because sometimes people find paranoia laughable or annoying, but Jeongguk only smiles in understanding and presses a third kiss to Taehyung’s cheek, just under his eye, and a fourth one to Taehyung’s forehead.</p>\n<p>“Be right back.”</p>\n<p>Taehyung sits cross-legged in bed until Jeongguk returns, because it wouldn’t be fair of him to sleep, and he gives Jeongguk a sleepy smile when he gets back.</p>\n<p>“All good,” Jeongguk says, and he closes the bedroom door behind him before sliding into the bed next to Taehyung. The slighter boy immediately cuddles into Jeongguk’s warm body, really sleepy now, eyes barely opening with each blink.</p>\n<p>“Thank you, I love you,” Taehyung makes sure to say though, and even in exhaustion the words are so different from how he says them to Jimin, the words holding weight in them, heavy with affection and tenderness.</p>\n<p>He’s almost asleep when he hears Jeongguk’s warm, “I love you too”, one arm curling tighter around his body, and he knows that the delicateness with which Jeongguk treated him when he was hurt didn’t end after that month. Taehyung’s always been the most precious thing in Jeongguk’s life.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>vii.</p>\n<p> </p>\n<p>The time Taehyung realizes that it’s a thing, that he really, <em>really</em> has something for Jeongguk’s strength – for how easy it is for Jeongguk to pick Taehyung up and move him around, for how much raw power Jeongguk has, for knowing how strong Jeongguk is but being someone Jeongguk reigns that strength in for – it’s when they’re wrestling for the remote, because Jeongguk wants to watch a crime show on t.v., but Taehyung wants to watch an elephant documentary on the discovery channel.</p>\n<p>They’re on the bed, on the thick, plush comforter, and Taehyung’s trying to stretch his arms up to where Jeongguk can’t reach, but Jeongguk’s pressing him down into the bed with his larger body so that Taehyung can’t move, even though he tries his hardest to squirm out of Jeongguk’s grip (he’s not trying very hard though, because being under Jeongguk is probably Taehyung’s most favourite place in the world).</p>\n<p>Jeongguk traps his wrists above his head with one hand, the other one plucking the remote out of Taehyung’s now limp fingers. Because Taehyung’s completely forgotten about the remote by this point, the slight burn of the stretch of his arms above his head sending a sudden shock of heat scorching through his body. Even his toes are tingling.</p>\n<p>“Let’s not watch t.v.,” Taehyung blurts out when Jeongguk starts to push himself up, and Jeongguk pauses his movements, glancing down at Taehyung. He takes in Taehyung’s flushed features, his dilated pupils, the raggedness in his breathing, and then something quirks in his lips, and Jeongguk settles more heavily atop of Taehyung.</p>\n<p>“No?”</p>\n<p>“N-No,” Taehyung stumbles over his words, but he manages to meet Jeongguk’s heated gaze. “Let’s do something more fun.” It’s almost a question, a slight hint of Taehyung’s natural submissiveness surfacing, always peeking through whenever he finds himself under Jeongguk’s broader form.</p>\n<p>Jeongguk smirks, slow and lazy, like he’s completely unbothered about Taehyung’s trembling form beneath him. “Fun? What did you have in mind?”</p>\n<p>Taehyung huffs in annoyance, because it’s <em>obvious</em>, what he has in mind, and he opens his mouth to say something maybe a little bit meanly, but then Jeongguk rolls his hips downwards, and Taehyung’s mind goes blank in pure pleasure.</p>\n<p>“Tell me,” Jeongguk’s voice is low, rough, and commanding, and Taehyung’s thoughts are all jumbled up and tangled together, and the only thing he can really focus on is the strength in Jeongguk’s hand that holds his wrist together and the gentleness of his other that’s stroking the smooth skin of Taehyung’s hip.</p>\n<p>“T-Touch me,” Taehyung manages to whimper out, squirming again but this time it’s not to get out of Jeongguk’s grip, but to get closer to the source of heat above him.</p>\n<p>“I am touching you,” Jeongguk says, in mock confusion, like he doesn’t know what Taehyung wants him to do. Where Taehyung wants him to touch. “You’re going to have to be more specific, Taehyung.”</p>\n<p>Taehyung whines in response, because it’s embarrassing to say, especially when Jeongguk looks so unbothered above him while Taehyung’s practically gagging for it.</p>\n<p>“Say it,” Jeongguk commands, and Taehyung’s mind falls somewhere white hot and completely delicious, a place where the only thing that matters is the strong body above him and large hands that tether him to it. So when that body moves, upwards the scant few centimeters to create space between Taehyung and its reassuring warmth, Taehyung whimpers in need, his socked feet curling around the ankle of the muscular leg between his own slender ones.</p>\n<p>“<em>Fuck me</em>,” Taehyung manages to get out, something between begging and demanding, and then Jeongguk drops his body back down, rough and dominating in his movements, and Taehyung squirms needily, practically rutting against the thigh between his legs. “Please, oh please, <em>Jeongguk</em>.”</p>\n<p>Jeongguk’s eyes darken then, and both of his hands yank Taehyung’s shirt off, followed by his own, and then Taehyung’s eyes catch on the smooth stretch of muscle across Jeongguk’s shoulders and down his chest, the faint lines of his abdomen, that he doesn’t realize Jeongguk’s worked off both of their pants too.</p>\n<p>He pauses then, sitting up on his knees and his chest heaving in a way that lets Taehyung know Jeongguk’s just as affected, that he’s not as nonchalant as he pretends to be. And his eyes rake down Taehyung’s naked frame, from the hands still crossed over each other above Taehyung’s head, down to the smooth golden skin of Taehyung’s tummy, the pink flush on Taehyung’s cheeks and between his legs, the way Taehyung’s legs fall open so naturally to accommodate Jeongguk’s larger body.</p>\n<p>“<em>Fuck,</em>” Jeongguk breathes out, fingers gliding smoothly over the skin of Taehyung’s legs to grip at the flesh of Taehyung’s thighs. One hand moves further, thumb pressing into the jut of Taehyung’s hip and following the line down towards Taehyung’s cock, but then deliberately moving away again, down Taehyung’s inner thigh and barely grazing his quivering hole. “Fuck,” Jeongguk says again. “I want to leave marks all <em>over you</em>.”</p>\n<p><em>Yeah</em>, Taehyung thinks, almost sobbing in his need to be touched, and he squirms desperately, trying to rock downwards and closer to those warm hands. “Do it, then,” he dares, but it comes out as more of a plea, and there’s quick flash of a smirk from Jeongguk’s lips before he’s sinking his teeth into the soft skin of Taehyung’s inner thigh, leaving a trail of bruises upwards, towards the painfully hard cock.</p>\n<p>He doesn’t touch Taehyung where he needs it most, <em>again</em>, moving to the other thigh to give it the same treatment, pressing chaste kisses and possessive marks into the smooth skin until he finally leans back, satisfied, hands roaming over the marks.</p>\n<p>Taehyung huffs in annoyance. He <em>still</em> hasn’t been touched, and Jeongguk’s not even <em>looking</em> at him. “What if someone sees them?”</p>\n<p><em>This</em> makes Jeongguk glance up sharply, hands curling around Taehyung’s thighs. “Who exactly would be looking at you down here? Who, except me, would see you here?”</p>\n<p>He leans back over Taehyung, settling over the smaller boy, and finally, <em>finally</em> grinds downwards, and Taehyung throws his head back, hurtling towards a sea of white. “<em>No one.</em>” Jeongguk tells him, and Taehyung knows that, obviously, but he loves this, loves how he can rile Jeongguk up until Jeongguk presses him down into the mattress, loves that he can push at Jeongguk’s buttons until Jeongguk reminds him who he belongs to.</p>\n<p>“No one,” Taehyung agrees, locking his feet around Jeongguk, and he brings his arms down to wrap one around Jeongguk’s neck, strokes a thumb over Jeongguk’s cheek with the other. His eyes say more than words ever could, and then he smiles up at Jeongguk, warm and wide and boxy, eyes crinkling into crescents, and his hand, pressed to Jeongguk’s chest, can feel how Jeongguk’s heart beats just a little bit faster. And Taehyung thinks he’s never loved anyone more in his life than the boy above him who’s a little bit rough and sometimes a bit insensitive and maybe a little bit mean, but he’s also so soft and so gentle, and he treats Taehyung like he’s something so precious to him. And maybe he’s like that because of Taehyung, or maybe it’s because underneath everything, underneath the tough exterior and the sky-high walls, his heart’s more delicate than Taehyung’s, but all Taehyung knows is that Jeongguk fills up all of Taehyung's vulnerable pieces with parts of himself.</p>\n<p>“Do it slow, okay?” Taehyung whispers, his entire world narrowed down to Jeongguk’s soft breath against his face and Jeongguk’s warm heartbeat under his palm.</p>\n<p>Something in Jeongguk’s expression shifts, softens, goes so gentle that it’s almost too hard for Taehyung to look at, and then Jeongguk whispers back, “Okay.”</p>\n<p>Jeongguk draws everything out, fingers Taehyung until he’s falling apart and begging for something more, something to fill him up like fingers never could, and even though Jeongguk’s hands are gentle his movements are rough, never able to completely hold onto his strength when he’s lost within Taehyung.</p>\n<p>And Taehyung – he <em>loves</em> it.</p>\n<p>He loves the slow breakdown of Jeongguk’s resolve, the way Jeongguk’s biceps clench beneath his skin when he fists his hands in the sheet beneath Taehyung, the roughness of Jeongguk finally pushing into him, and the power behind each slow thrust, the bruises on Taehyung’s hips that Jeongguk’s fingers leave behind.</p>\n<p>Taehyung’s pleas for <em>more</em> are almost loud enough to cover the sound of slapping skin on skin, and Jeongguk’s curled above his body, hair messy and sticking to his forehead, and Taehyung presses his lips to his temple in a barely-there kiss, whispers an “I love you” because he does, he really, really does, and he always wants Jeongguk to know.</p>\n<p>“Yeah,” Jeongguk breathes, eyes fixed on the raw expressions of Taehyung’s face, and then he finally leans down to kiss Taehyung, hot and wet and completely dominating the smaller boy until Taehyung breaks the kiss, panting and eyes half-lidded.</p>\n<p>Jeongguk presses gentle kisses to Taehyung’s nose and eye lids, so contradictory to the raw strength of his thrusts deep inside Taehyung, and that juxtaposition is so significant to Taehyung, so precious to him, that his eyes suddenly feel a little wet and he has to turn his head to the side, too overwhelmed with the rush of emotion making his throat constrict.</p>\n<p>He catches sight of Jeongguk’s wrist next to his face, the strain of his muscle, and the swirl of blue veins under the skin that remind Taehyung that as strong as Jeongguk is, he has a delicate weakness in him too. Because Jeongguk had been so aloof and distant and unsociable when they had first met, so hardened by the world already. But Taehyung had been determined, and broken down the callous and apathetic walls surrounding Jeongguk’s heart, rebuilding them with himself inside, pumping life back into Jeongguk, and maybe Taehyung’s sometimes stronger than Jeongguk. Not physically stronger, but stronger at something else, at something Taehyung can’t put a name too.</p>\n<p>And that delicate weakness is something Taehyung protects with his whole entire being, so he leans forward to press a soft kiss to the fragile skin on the inside of Jeongguk’s wrist.</p>\n<p>Jeongguk stills for a second, above him, and then tangles their hands together, next to Taehyung’s face, and thrusts even harder, but just as slow, until Taehyung’s toes are curling and the sparks of electricity running up and down his spine make his body feel like it’s too hot and he’s coming, <em>oh god he’s coming</em>, shooting white between them, face pressed into the space between Jeongguk’s neck and shoulder. Jeongguk thrusts a few more times, his pace never faltering until Taehyung can feel him coming too, the jerkiness of his hips not letting up in his bruising pace.</p>\n<p>Afterwards, when Jeongguk’s cleaned them up and Taehyung’s tucked under the blanket and Jeongguk’s arm, he presses a soft kiss to Jeongguk’s pectoral, whispers, “I love that you’re strong enough to carry me.”</p>\n<p>“Yeah?’ Jeongguk asks, one hand brushing Taehyung’s bangs out of his eyes.</p>\n<p>“Yeah,” Taehyung murmurs. “But…” he’s flushed a pretty pink from embarrassment, and tucks his face against Jeongguk’s warm skin, so that the words are barely audible, more felt than heard. “But I love it more that you treat me…gently. Like I’m precious to you or something.”</p>\n<p>Jeongguk’s silent for a moment. “You <em>are</em> precious to me.”</p>\n<p>Taehyung doesn’t hide the wide grin that graces his features, happy and pleased and delighted, and filled with so much love. And he feels like his heart might burst from the amount of love in it for Jeongguk, for this boy who fits Taehyung like a puzzle piece that wasn’t supposed to, like a puzzle piece that came from another box but somehow fit to Taehyung, and all Taehyung knows is that he doesn’t care if he’s supposed to fit one puzzle and Jeongguk’s supposed to fit another, because he superglued Jeongguk to him and nothing’s going to pull them apart. Nothing could separate them back into those two different puzzles.</p>"
}