{
  "id": "562294",
  "url": "https://archiveofourown.org/works/562294?view_full_work=true",
  "author": [
    "drunktuesdays"
  ],
  "title": "anything, anything",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [],
  "additional_tags": [
    "Woke Up Married"
  ],
  "language": "English",
  "series": "",
  "published": "2012-11-14",
  "completed": null,
  "words": "5,242",
  "chapters": "1/1",
  "comments": "304",
  "kudos": "13,634",
  "bookmarks": "2,607",
  "hits": "187,957",
  "summary": "<p>set about 5 years in the future, for a prompt from kalpurna: Stiles wakes up in Derek’s bed in a world where they’re married now, and Derek keeps leaving the room every time he tries to have a conversation about how this happened, since they weren’t even dating. Betaed by giddygeek.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>Derek woke up on a Thursday morning, just after dawn, with a gold band on his left hand and Stiles tucked up under his arm. He had about thirty seconds to lie there, reeling in confusion before Stiles stirred too, blinking awake. </p>\n<p>“Holy shit,” he said, jerking out from under Derek’s arm, sitting up in a rumpled mess. “What the hell?”</p>\n<p>The air was cold where Stiles was disturbing the covers, so Derek yanked the blankets closer, burrowing in. </p>\n<p>“How did we get here?” Stiles said, voice verging on hysterical. “What’s going on? Derek, pay attention. Were we drugged? Why aren’t you freaking out? Did you do this? Did you kidnap me?”</p>\n<p>“Yes,” Derek said. “I kidnapped you as part of my nefarious plan to murder you by letting you drool on me.” He should be freaking out, he knew it, but this bed was pretty comfortable, and Stiles seemed to be doing well for both of them. </p>\n<p>“Shut up,” Stiles said, flushing. He looked around. “Where are we?” Derek didn’t know, so he didn’t answer. Stiles threw up his hands, and shoved off the bed, crossing to the window. “Okay, still Beacon Hills,” he said, peering at the street sign. “Over by the school.” </p>\n<p>“Okay,” Derek said, and contemplated going back to sleep. </p>\n<p>There were strange creaking noises, however, so Derek cracked an eye open again to find Stiles across the room, looking in drawers. “These are my socks,” he announced. </p>\n<p>“Good find,” Derek said. </p>\n<p>“They’re touching your socks,” Stiles said, like it clarified his objection. “Why would someone go through the trouble of moving our socks? Oh my God, are you going back to sleep? Why are you going back to sleep?”</p>\n<p>“I don’t have a job,” Derek said, unbothered. “Why not?” </p>\n<p>“Fuck,” Stiles said. “Work!” He flew around the room, pulling random drawers open, muttering angrily as he located his clothes. He was gone in a hurry, and Derek listened as the Jeep roared out of the driveway. He dozed for a little while longer, then rolled out from the covers. Stiles had been correct, their clothes were all here, and mixed together. It smelled right, though, in a way that was hard for him to explain. Everything smelled right, like it had been that way for years, like there had been time for Derek’s scent to soak into everything, like this was home. </p>\n<p>It was powerful magic, whatever it was. </p>\n<p>Derek wandered the house. There were pictures on the wall, pictures of the betas, of Scott, of Jackson and Lydia, of the Sheriff with his arms tight around Melissa McCall. There were strangers too, people Derek only vaguely knew as friends of Stiles. And there was were pictures of them. Derek with his arms around Stiles on the beach, picking him up over his shoulder, clearly about to throw him in the surf. Stiles, mugging and holding up devil’s horns behind Derek’s head at what looked like a diner. A candid, the two of them laughing in front of a campfire. There was a life splayed out here, and he stopped to trace over one in a large frame, just the two of them, in tuxes. Their faces were happy, and he stared at the smile on his own face. It was their wedding, he could tell. He ran his finger over the gold band on his finger, the surface warmed by his own body heat. </p>\n<p>He went outside and looked at the house. It was red, with a neat driveway and big windows. It looked nothing like his parents’ house, but he supposed it was pretty nice. He made the rounds of it. There was a stair broken in the back, and he thought how strange it was for those little details to exist in this--whatever it was that was going on. </p>\n<p>He went into the kitchen. There wasn’t much in the cupboards or fridge to eat so he made himself a sandwich from the odds and ends he could find, and then went out. There was a grocery store he liked to go to on the opposite side of town, that was less crowded and terrifying than the supermarket downtown. He wandered through the aisle, grabbing random things off shelves. He guessed at things Stiles might eat, and then brought everything to the register. </p>\n<p>“Morning, Derek,” the cashier said cheerfully. “How’s everything?”</p>\n<p>“Good,” Derek said automatically, hands tightening on the edge of the counter. He had never talked to her before, but he had seen her nearly every time he came in. “How are you?” </p>\n<p>“Well,” she said, and launched into a story about her grandchildren, as if this was a topic they regularly discussed. He nodded at intervals, watching as she waved his items in the air as she talked. He belatedly realized she had hit the punchline of the story, and laughed, just a beat too late. “Everything okay?” she said, narrowing her eyes at him. </p>\n<p>“Yes,” he said. “I’m fine.”</p>\n<p>“And Stiles too?” </p>\n<p>He coughed uncomfortably. “I guess,” he said. “He’s at work.”</p>\n<p>“Oh honey,” she said, and patted his hand. “Don’t you fret too much if you’re having problems. Marriage is tough work. Jim and I have been married forty years, and we still fight all the time.” </p>\n<p>“Thanks, June,” he said, and paid his bill. He realized when he got back to the house, that she had snuck a candy bar in the bag. He ate it slowly, savoring each bite.</p>\n<p>He started going through the house more closely in the afternoon. There was a room that was clearly an office, and he went through the drawers. There was mail, some of it his, some of it Stiles’s, some of it addressed to both of them. The bottom drawer had bills in it, and he recognized his scrawl on them, noting the date they had been paid. There was a safe in the corner, and on a whim, he tried Laura’s birthday and it popped open. Inside was the deed to their house, the titles to their cars, and their marriage certificate. He texted a picture of it to Stiles, and fifteen minutes later, his phone rang. </p>\n<p>“My job is the same,” Stiles said, in lieu of a greeting. “Everything's the same, but everyone asked how you were. Did you know we went to see the new James Bond movie last night?”</p>\n<p>“I heard that was good,” Derek said, balancing the phone on his shoulder as he went through the rest of the documents. They apparently had written each other into their wills. Made as much sense as anything, he supposed. </p>\n<p>Stiles made an outraged noise, and Derek could just picture him flailing. “Can you just once react like a normal person about something?”</p>\n<p>“What time are you coming home?” Derek said.</p>\n<p>“Stop calling it home. Also, why?” Stiles said. “Do you have a plan to deal with this?”</p>\n<p>“I just wanted to know when to start dinner.”</p>\n<p>Stiles was quiet for a long moment. “I’m gonna sleep at my dad’s,” he said eventually. </p>\n<p>“Okay,” Derek said, and hung up without saying goodbye. </p>\n<p>In the morning, he woke up in the bed that smelled like Stiles and him. He took a shower, and dried off with a large towel that smelled like the detergent he preferred most. He poked around until he found a door that led to the basement. He could tell right away that this was mostly his domain, Stiles’s scent was almost nonexistent down here. The washing machine and dryer were down here, along with boxes and a few exercise.machines. But there was a corner with tools and a drop cloth, and on the drop cloth was a motorcycle. It was rusted and half taken apart, and there was a mess of broken parts and gears littered around. He had always wanted to customize a bike. He sat down on the stool near it, and carefully ran his hands over it. </p>\n<p>He took himself out for lunch at a nearby diner when his stomach started growling. The place was pretty empty, so he just picked a random booth in the back to slouch into. When the waitress walked up, he opened his mouth to place his order, but closed it again when she slid into the booth across from him. </p>\n<p>“June said you and Stiles are having problems,” she said without preamble. Her name tag said Sheila. He felt certain he had never talked to her before. </p>\n<p>“June talks too much,” he said, hunching his shoulders. It seemed like the thing to say. His social skills were getting a workout. </p>\n<p>“Don’t I know it.” she agreed. “But I saw his Jeep in the Sheriff’s driveway last night.” She focused her eyes on him like laser beams. “All night.”</p>\n<p>“Did you,” he said flatly. </p>\n<p>She seemed unbothered by his uncommunicativeness. “Now, I saw the good Sheriff at the drugstore yesterday, and he seemed fine, and I know Melissa is doing fine. So it seems June might be onto something.”</p>\n<p>“The roast beef looks good,” Derek said pathetically, tracing a finger on the menu. </p>\n<p>She ignored him. “Now if it is serious enough that you kicked him out, Derek, I would have to say--”</p>\n<p>“I didn’t kick him out,” Derek interrupted. It was the truth, strictly speaking. </p>\n<p>Her entire demeanor changed instantly. “Oh honey,” she said, sympathetically. “He left?” He nodded. “You poor thing,” she said, rising. She pulled the menu out of his hands, and stalked off. Derek hadn’t actually ordered, but he sat there quietly, and stared at his hands. When Sheila returned, she was carrying several plates, all of his favorites. He didn’t know how she knew, but there was even whipped cream on a sliver of pie. Every time she walked by, she squeezed his shoulder reassuringly. He left her a huge tip when he finished. </p>\n<p>He went to Autozone next. He had a list of things he needed for the motorcycle, and he spent a satisfying amount of time picking them out. When the man at the counter rang him up, he handed over the receipt with a gruff, “Keep your chin up.” </p>\n<p>“Thanks,” Derek said, and went home. </p>\n<p>Around six, Stiles slammed into the house. Derek was outside, flipping burgers on the grill, but he could hear Stiles shouting his name and stomping around. When he finally stuck his head outside, Derek calmly shut the top of the grill, and turned to face him. </p>\n<p>“Did you sic everyone in this damn town on me?” Stiles said, furious. </p>\n<p>“No,” Derek drawled. </p>\n<p>“Fernando at the coffee shop refused to serve me,” Stiles shouted. “Do you know how long he’s known me? Since I was <i>five</i>. When I asked him what his problem was, his wife told me you were a <i>nice boy</i> and I shouldn’t be so mean.”</p>\n<p>“I am a nice boy,” Derek said, smirking a little. </p>\n<p>“You are a gigantic asshole, is what you are,” Stiles informed him. </p>\n<p>Derek noticed the duffel bag on his shoulder. “What’s that?” he said, gesturing. </p>\n<p>Stiles rolled his eyes, color coming to his cheeks. “My dad said he wasn’t aiding and abetting my giving up without a better reason.”</p>\n<p>“You didn’t tell him it was a spell?” Derek asked. </p>\n<p>“No,” Stiles shot back. “I like not being committed for insanity.” He shifted his weight from one side to the other, suddenly uncertain. “I can get a hotel room if you’d rather.”</p>\n<p>“It’s your magic house too,” Derek said, turning back to the grill. “Go get me a plate.”</p>\n<p>“Yes dear,” Stiles said dryly but he was smiling when he turned away. </p>\n<p>When Stiles started yawning, and dropped his head back on the couch, Derek said, “Take the bed. I’ll sleep out here.” </p>\n<p>“Yeah, okay,” Stiles said, and disappeared down the hall. Derek watched his slim hips as he walked away. </p>\n<p>In the morning, Derek did the laundry. Stiles had left his duffel next to the bed, and Derek picked through it enough to take out the things that smelled worn, and added them to his own pile. He’d been doing his laundry at the laundromat previously, and he was man enough to admit that this was better, easier. It was nice to be able to leave the dryer unattended as he puttered around the house, doing the stuff that needed to be done. Maybe when the spell was done, and his life went back to normal, he’d find this house and buy it. If it really existed. </p>\n<p>When he was done, he went grocery shopping again. Stiles had eaten cereal standing up this morning, and he supposed they’d need more milk sooner than not. June smiled at him when he walked in.</p>\n<p>“Couldn’t help but notice the Jeep in your driveway last night,” she called. </p>\n<p>“Couldn’t help but drive by to check, you mean,” an older man loitering by the beer snorted. </p>\n<p>“Shut up, Jimmy,” June snapped, but turned a beaming grin on Derek. “Planning a welcome home dinner?” she said hopefully. </p>\n<p>“Um,” Derek said, caught off guard. </p>\n<p>“I thought so,” she said. “Jimmy, didn’t I say so? I said, I bet Derek Hale’ll be in today to buy some of that swordfish for his man, just you wait.” </p>\n<p>“Could use some of that fish myself,” Jimmy said.</p>\n<p>“Shut up, Jimmy,” she said, and grabbed Derek by the wrist, towing him towards the back. </p>\n<p>He stopped for gas on the way home. At the pump, a familiar cop car pulled up behind him. “Derek,” the Sheriff said, slamming the door shut. </p>\n<p>“Sheriff,” Derek said, knuckles squeezing tight around the handle. </p>\n<p>“Stiles come home last night?” he asked, sticking his hands in his pockets. </p>\n<p>“Yes sir,” Derek said. </p>\n<p>“Good,” the Sheriff said. “You know, I expected this years ago.”</p>\n<p>“Did you?” Derek said, aiming for casual. </p>\n<p>“Don’t play stupid, son,” he snapped irritably. “I know I didn’t have much faith in the beginning, especially considering how young Stiles was. But I told him, and I’ll tell you now that there are things worth fighting for and your family is one of them.”</p>\n<p>“I know that,” Derek said. </p>\n<p>“Yes,” the Sheriff said. “I’m sure you do.” </p>\n<p>The fuel pump clicked as it finished, and Derek busied himself with putting it away, trying to avoid Stiles’s dad’s eyes. </p>\n<p>“I’ll expect you Saturday as usual,” the Sheriff said, finally, turning away. </p>\n<p>“No problem,” Derek said, and got in the car. </p>\n<p>Stiles came home just as everything was beginning to fill the house with good smells and he made an appreciative noise, coming into the kitchen. “What’s this?” he said, looking in the oven. </p>\n<p>“Nothing,” Derek said. “I had time.”</p>\n<p>“It looks good,” Stiles said. “I always liked fish.”</p>\n<p>Watching Stiles eat was mildly horrifying. He talked the entire time, not even pausing to chew. Derek listened to his complicated story about a coworker’s fight with the water cooler, which turned into a rant about tap water, which went into a rant about climate change. Stiles’s brain worked so differently than his own, it was fascinating to listen to. </p>\n<p>“Sorry,” Stiles said abruptly, cutting himself off. “You should have stopped me. What’d you do today?”</p>\n<p>Derek shrugged, chasing the last bite of fish around his plate. “Did laundry,” he said. \"Fixed the back steps.”</p>\n<p>“You’re a regular househusband,” Stiles said. “Must be why I keep you around.”</p>\n<p>It was the first time Stiles referenced anything about their situation being positive, but it was hard not to scowl at Stiles’s tone. </p>\n<p>“Hey,” Stiles said, catching his face. “Sorry, I didn’t mean--”</p>\n<p>“It’s fine,” Derek said, picking up his plate. “I’ll be upstairs if you need me.”</p>\n<p>He was reading in the office when he heard a car pull up. “Stiles,” Scott yelled from the driveway. His voice was tinged with anger, and Derek tensed. </p>\n<p>He heard Stiles open the door. “Stop yelling, you know the neighbors are nosy as hell.”</p>\n<p>“Why did I have to hear that you and Derek are divorcing from the guy at the liquor store?” Scott squawked as he came inside. “Have you even been to counseling? Why didn’t you <i>call</i> me?”</p>\n<p>It was a good point. Why didn’t either of them think of Scott? Derek put a bookmark in his book, and closed it. </p>\n<p>“It wasn’t a big deal,” Stiles said grumpily. “I slept at my dad’s house <i>one night.</i>”</p>\n<p>“Like you’ve ever done that before,” Scott said. “I’m surprised Derek didn’t sleep on his roof.”</p>\n<p>“Jesus, Scott. He’s right upstairs,” Stiles hissed, and Derek took that as his cue to come down. </p>\n<p>“Scott,” he said, nodding. </p>\n<p>“Hey,” Scott said, ducking his head. “Sorry about--”</p>\n<p>Derek waved him off. It wasn’t exactly an unfair judgment. </p>\n<p>“Dude, so have you noticed anything strange going on lately?” Stiles said. “Or smelled anything with your wolf nose?”</p>\n<p>“Like what?” Scott said, confused. </p>\n<p>“Like magic?” Stiles suggested. “Has anyone new come to town? Anything freaky?”</p>\n<p>Scott looked between them both like they were nuts. “Does this have anything to do with why you were fighting?”</p>\n<p>“I’m going out,” Derek said, grabbing his coat. “I’ll be back later.” He wasn’t all that invested in finding out what was going on anyway. </p>\n<p>When he returned, Stiles was alone. “Did you tell him?” Derek asked. </p>\n<p>“Tried,” Stiles admitted. “He didn’t understand, like at all. He thinks we lost our memories.”</p>\n<p>Derek grunted, shedding his jacket and hanging it up. </p>\n<p>“Hey,” Stiles said suddenly. “Do you want to switch off who gets the bed?” </p>\n<p>“That’s okay,” Derek said. “You take it.”</p>\n<p>“No,” Stiles said, determined. “It’s not fair. We could share, then.”</p>\n<p>“What,” Derek said.</p>\n<p>“It’s a big bed,” Stiles said. </p>\n<p>Derek thought of the soft blankets and the pleasant smell that permeated every square inch. “If you’re sure.”</p>\n<p>“I’m sure,” Stiles said. </p>\n<p>Stiles was terrible at bedsharing, as it turned out. They started off on their own sides, bodies stiff and not touching. Then, Stiles drifted off, and relaxed. Not long after that, he rolled, tucking his body against Derek’s, an arm swung over his chest. Derek thought about what Scott’s theory, that they had lost their memories. Stiles hadn’t agreed with it, continuing to argue for an alternate universe, or something like that. </p>\n<p>Derek sort of thought it was all wish fulfillment, on his side at least. It sort of sucked for Stiles to be caught up in it. </p>\n<p>The next day was Saturday, which meant that Stiles didn’t have to go to work. Derek carefully shoved Stiles off and went for a run. He stuck to the woods mostly, avoiding his family’s burned out house, but circled the rest of the territory. On the way home, he cut through some residential streets, and there were people standing in their driveways, getting the paper, mowing their lawns, and many of them nodded to Derek, like he was a part of the community, like he was someone not to be afraid of. </p>\n<p>That was the part of all this that freaked him out the most, he thought. </p>\n<p>When he got back, Stiles was watching TV in his pajamas, looking rumpled and sleepy-eyed. Derek tossed a paper bag on his chest, and Stiles immediately attacked it, ripping it open to find the pastry Derek bought him.</p>\n<p>“Dude, sweet,” he said gratefully. </p>\n<p>Derek parked himself on the couch next to him and tried not to find it endearing when Stiles managed to get powdered sugar and cream filling all over himself in his haste to devour it.</p>\n<p>“Your dad mentioned dinner,” he said eventually. </p>\n<p>“Apparently it’s a regular thing,” Stiles said reluctantly. </p>\n<p>“We don’t have to go,” Derek said. “Or you can go, and I’ll stay home.”</p>\n<p>Stiles shook his head. “He’d probably freak out. Better to just get it over with.”</p>\n<p>Derek had never been in the ground level of the Stilinski home before. It was nice, bright and airy, and the house smelled good, like pot roast. </p>\n<p>“Derek, Stiles,” the Sheriff said as he opened the door. His gaze was assessing, and Derek was pretty sure he was going to fail whatever test the Sheriff was throwing at him. </p>\n<p>Scott and Allison were there already, sitting on the couch, talking to Melissa. Stiles got involved in whatever they were discussing pretty quickly, hands moving in a blur as he talked. Derek stood there, trying not to loom and not succeeding. </p>\n<p>“Sit down,” the Sheriff ordered, pointing to a chair near his own. “You’re making me nervous.” </p>\n<p>As a kid, Derek’s house had always been full of people. He had five sisters, and their friends were usually tramping down the stairs yelling, while the adults of the pack came in and out. People were always trying to see his grandmother, who had been alpha, and his father who had been her second. He had disliked it at the time, always trying to slip away, to get some time on his own. </p>\n<p>When he got it, all those long years of time on his own, he had surprised himself with how much he hated it. He didn’t know how to change it, couldn’t seem to be less alone. Apparently in this world he had, and it was clear from the way Scott was easy with him, the way Melissa directed conversation at him, that he was considered family here. </p>\n<p>He had no idea how that could possibly have happened. It seemed an insurmountable task for even magic to achieve. </p>\n<p>After a while, he settled into the chair more easily, content. He met the Sheriff’s eyes at one point, and they seemed slightly warmer. Maybe the test was easier than he thought. </p>\n<p>Stiles was tense on the way home. Derek couldn’t figure out why, because he seemed fine, happy even, at dinner. It had gone well, he thought, minus how there had been a weird moment when Melissa had hugged Derek goodbye, and he hadn’t been expecting it. His arms had gotten trapped at his sides and he had been stiff as a board, but Melissa had hung on until he managed to wiggle his arm up to pat her on the back. </p>\n<p>Then they had stepped out into the cold air, and Stiles had been rigid, radiating unhappiness everywhere. Derek didn’t know what he’d done, but he waited, sure Stiles would tell him.</p>\n<p>He was right. The moment they stepped through their door, Stiles whirled on him. “We have to figure out what’s doing this,” he said tightly. “This can’t just be our lives now.”</p>\n<p>Derek took a moment to figure out how to react, hanging his jacket on the coatrack, but Stiles misinterpreted his silence as Derek ignoring him. </p>\n<p>“I’m serious,” he said. “I don’t understand why you’re not. We need to be hunting this, or investigating. We should go to Deaton, or find some books, do <i>something.</i> Derek, come on, you know I’m right.”</p>\n<p>“Of course you’re right,” Derek said, anger beginning to color his words. “I know, I know you’re miserable and you hate this. I know this is your nightmare, but it’s not mine, so don’t act like you don’t know why I’d want to stay here.”</p>\n<p>“You think this is a <i>punishment</i> for me?” Stiles yelled. “You’re wrong. Jesus, why do you think I’m so mad? You didn’t even like me, and now we’re <i>married</i>, we’re together, and you’ve never wanted--”</p>\n<p>Derek kissed him, trying to stop the flow of words. It didn’t work at first. Stiles was still trying to yell at him, aggrieved noises escaping out of his mouth but his hands came up to wind around Derek’s neck, hauling him closer. Derek let him, clutching at his hips, and kissed him all the harder, trying to convey exactly how much he has wanted. Stiles stopped trying to talk after a bit, and tugged backwards, forcing Derek to take a few lumbering steps towards the couch. They fell together, Derek shooting his hands out to catch his weight before he landed on Stiles. </p>\n<p>“This is the opposite of what I was going for, actually,”, Stiles said breathlessly, but his hands were busy at Derek’s waist, shoving his shirt up around his armpits. Derek took it off, tossing it to the floor. “God, you’re ridiculous,” Stiles groaned, and his nail scraped over Derek’s nipple, making him hiss and arch. Stiles did it again, and Derek dove forward, hiding his moan into in Stiles’s mouth. The way his lips curved into a smirk under his said Stiles had heard it anyway. </p>\n<p>Stiles’s hands were everywhere, running up Derek’s back, his arms, cupping the back of his neck. It made Derek shiver, and his skin felt like it was on fire everywhere Stiles touched. He twitched when Stiles bit his lip, and the movement made their cocks align, made them both groan. </p>\n<p>“Back up,” Stiles hissed, shoving at Derek’s chest. “The pants have gotta go, they gotta,” but the rest of his sentence was bitten off when Derek moved backwards onto his heels, absolutely ripping at Stiles’s fly until he got it open and got his hand around Stiles. He leaned down to take it in his mouth immediately, reveling in the taste. Stiles arched, body strung tight with surprise and Derek gripped his hips, holding him down as he sucked. “Oh my God,” Stiles said, voice low, like the words were being torn out of his chest. “Derek, fuck.”</p>\n<p>He let go of Stiles’s hip with one hand, and shoved at Stiles’s thigh until Stiles got it, and bent it, spreading himself wider. Derek stroked his hand down the inside of his thigh and then cupped Stiles’s balls. He ran a finger behind, pressing between Stiles’s cheeks, just testing, and Stiles grunted his approval, opening his legs wider. Derek pressed the tip of his finger into Stiles’s hole, dry, and Stiles howled, his whole body tightening as he spilled down Derek’s throat. </p>\n<p>Derek made to back off but Stiles shook his head. “C'mon,” he urged. “Do it.”</p>\n<p>They were going too fast, Derek thought, Stiles was probably going to regret this, regret <i>him</i> tomorrow, but he couldn’t stop himself from wetting two fingers and fingering Stiles open. Stiles was shaking a little under his hands, but he was starting to push back down on Derek’s fingers, his cock twitching like it could be ready to go again. Derek had to shove his own cock against the couch cushions, still encased in his jeans to keep from blowing it too soon. “I don’t have anything,” he gritted out. “I don’t know where in this house--”</p>\n<p>Stiles barked out a laugh. “I do, found it this morning.” He reached up, the long line of his arm stretching to reach the deep pocket on the side of the couch, and produced a tube of slick. Derek surged up to kiss him again, and Stiles gasped as his cock dragged against the rough of Derek’s pants. “C’mon,” he said again, plucking weakly at Derek’s belt. Derek stood up long enough to get them off, kicking them sideways, and then dropped back down over Stiles. </p>\n<p>“Are you sure,” he said intensely, trying to read Stiles. “We don’t have to, we could stop--”</p>\n<p>“I’ll kill you if you do,” Stiles said, taking himself in hand. He was hard again and was flushed with it, sweat running down his neck. “We’re doing this.”</p>\n<p>Derek kind of thought it might kill him if he did, but he wrapped a hand around his cock, slicking it as best he could and guided it in. </p>\n<p>“Oh my God,” Stiles said, his eyes going impossibly wide. He clutched at Derek’s back, nails digging in as Derek pressed farther and farther until he couldn’t get any closer. </p>\n<p>“You’ve done this before, right?” Derek said, the thought only just occurring to him. </p>\n<p>“Sex, yes,” Stiles said, shifting his hips experimentally. “This, in particular? No.”</p>\n<p>“Oh,” Derek said, and buried all the ridiculous feeling his words triggered. “I should’ve--”</p>\n<p>“You should move,” Stiles ordered. He smacked at Derek’s shoulder, and Derek huffed out a laugh and did as told. He kept a slow pace, replacing Stiles’s hand on his dick with his own, and jacked him in time with his thrusts. Stiles unraveled underneath him, eyes bright and lips so red where he was biting them. Derek wanted to burn this all into his memory, the sight of Stiles like this for him, the feel of him where Derek was inside, the sounds that were coming out of his mouth, unabashed and loud. </p>\n<p>“Stiles,” he had to say, too soon. “I’m close, I’m gonna--”</p>\n<p>“Yeah,” Stiles said. “Yeah, c’mon, let me see.” Derek came with a groan, shuddering with his orgasm. His grip on Stiles slowed and slackened, and Stiles arched underneath him, fucking himself into Derek’s fist until he was coming again, warm and sticky between them. </p>\n<p>“Rocks, paper, scissors you for cleanup,” Stiles said after a minute or two of afterglow. </p>\n<p>“Could shower together,” Derek said. Stiles’s eyes lit up and he held his hands out imperiously. Derek grabbed him and hauled him to his feet, and led him upstairs. </p>\n<p>He fell asleep, with a gold band on his left hand and Stiles tucked up under his arm. </p>\n<p>He woke up alone in the train station, on the cold, hard pallet in the corner. It was inevitable, he thought to himself. None of it was real to begin with, so what was the point of mourning it? He forced himself to close himself off, to squash the softness of the last week out of him, but he found himself dressing anyway, jumping in his car to trace the streets back to that red house. </p>\n<p>It existed in reality, he found. It was for sale too, sitting empty and quiet on the street. None of the neighbors waved to him but their eyes were open and curious and he held up a hand in greeting. </p>\n<p>He leaned against his car, studying the house, and tried to pull himself together. He heard the Jeep before he saw it, rec ognized the heartbeat that was pounding just a little faster than normal. </p>\n<p>“It’s real,” Stiles said when he had shut off the car and climbed out. “I thought maybe it’d be an empty lot or something.”</p>\n<p>“It’s real,” Derek said, and refused to look at him. Stiles came over and leaned against the car with him, sides barely brushing. </p>\n<p>“You should buy it,” Stiles said, and Derek froze. “I would, but I have about ten dollars in the bank.”</p>\n<p>“What would I do with it?” Derek said. </p>\n<p>“Well, I’m not having sex in your train car, so that’d be reason one.” </p>\n<p>Derek looked at him then, turning his whole body to stare. Stiles’s color was high in his cheeks, and his fists were clenched in determination, but there was also hope in his eyes. </p>\n<p>“You still want all that?” Derek said, incredulously, gesturing at the house. His chest was tight and he clenched his fist to keep his hands from shaking. </p>\n<p>“I think we should maybe date first,” Stiles said. “We don’t have to skip all that this time.” He emphasized “this time” with a wry tone to his voice, smiling.</p>\n<p>“Date,” Derek said dubiously, and he knew he was saying it like other people would say “shark attack.” </p>\n<p>“Date,” Stiles repeated firmly, but he bumped his hip against Derek’s. </p>\n<p>Derek turned and pinned him against the car, kissing him. “I’ll make an offer on Monday,” he said hoarsely. </p>\n<p>“Good,” Stiles said, and pulled him close.</p>"
}