{
  "id": "566131",
  "url": "https://archiveofourown.org/works/566131?view_full_work=true",
  "author": [
    "blinkiesays"
  ],
  "title": "Then You Think Again",
  "rating": "Mature",
  "archive_warnings": [
    "Underage"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Scott McCall"
  ],
  "additional_tags": [],
  "language": "English",
  "series": "",
  "published": "2012-11-18",
  "completed": null,
  "words": "22,550",
  "chapters": "1/1",
  "comments": "360",
  "kudos": "17,093",
  "bookmarks": "4,832",
  "hits": "284,126",
  "summary": "<p>\"Holy crap!  Why the hell did you <em>lie</em> to incredibly powerful magical beings with <em>trust issues?</em>  How was that <em>Plan A?</em>\"</p>\n<p>Derek says, \"We're not arguing about this, it's already done.\"</p>\n<p>\"Like hell we're not fighting about this,\" Stiles says, indignant.  \"What were you <em>thinking?</em>\"</p>\n<p>\"I was thinking it was worth the risk if it kept you alive!  And it worked, so drop it.\"</p>\n<p>\"You had no idea that it was going to work!\" Stiles throws his hands up.  Why is Derek the most frustrating werewolf in the history of ever, why is Stiles even helping him, <em>why is this his life?</em>  \"Why did they even believe you in the first place?\"</p>\n<p>Derek says, \"You reeked of me,\" which is unfair.  Stiles only smelled because he'd gotten covered in Derek's bodily fluids trying to <em>staunch the bleeding</em>.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>Sound of silver talk to me<br>Makes you want to feel like a teenager<br>Until you remember the feelings of<br>A real life emotional teenager<br>Then you think again</p>\n<p>- \"Sound of Silver\" by LCD Soundsystem</p>",
  "text": "<p>When Stiles had been a freshman there'd been a girl, he couldn't remember her name, who was 17 and a senior because she skipped a grade and who everybody knew was dating some sketchy 25-year-old guy with a kid that she met salsa dancing.  All the kids at school were totally <em>brutal</em> to her about it and like halfway through the semester she had to transfer to a magnet school half an hour away. </p>\n<p>Stiles heard she graduated Salutatorian and was going to Princeton now, but his point is she had to frickin' <em>change schools </em>the stigma was so bad.</p>\n<p>\"Which is why this is a bad idea,\" Stiles says, in summation.</p>\n<p>Derek looks at him and grunts like, <em>of course this is a bad idea</em>.  Well, ok, <em>fine</em>, they're on the same page then.</p>\n<p>\"I just think we haven't fully explored the repercussions,\" Stiles whines.</p>\n<p>Derek glares at him, then says, \"I don't want to die.\" He pauses, says, \"I don't want you to die either.\"</p>\n<p>He has a point.</p>\n<p>\"Fine.\" Stiles says.  \"Do it.\"</p>\n<p>As vows go, they need work.</p>\n<p>\n<strong>3 DAYS EARLIER</strong>\n</p>\n<p>\"Lay on, McGruff,\" Stiles says. \"And damned be him that first says hold enough.\"</p>\n<p>Derek glares.</p>\n<p>\"Ok, ok,\" Stiles says, \"Dog reference, I'm an asshole - but that was Shakespeare.  That was, literally, the Shakespeare of racist dog jokes.\"</p>\n<p>Derek sighs and looks… disappointed.  Oh, that's the <em>worst</em>.  That's so much worse than just being angry.  Angry Derek is something Stiles is used to.  Derek being disappointed in him?  <em>Sucks.</em></p>\n<p>So Stiles trails after Derek into the woods and apologizes.  And then he takes back his apology because Derek is ignoring him like a dick.  And then Stiles apologizes for calling Derek a dick.  And then Derek stops walking and Stiles nearly runs into him because apparently they're there.  For some value of <em>there</em>.</p>\n<p>Stiles cannot tell the difference between this nondescript patch of woodlands and the other twenty they walked through to get here.  But, whatever, werewolf knows best.</p>\n<p>\"Hey big guy, where do you want me?\" Stiles asks and Derek winces.  He gestures vaguely at the clearing they're in.  Oh, that's helpful.</p>\n<p>Derek says, \"Wherever is fine, we just need an unobstructed view.\"</p>\n<p>Stiles picks a protected alcove next to a sunny spot and sets up there.  It doesn't take very long, but Derek is off smelling trees and stuff by the time Stiles finishes.</p>\n<p>Stiles yells, \"Holy solar-powered Wi-Fi hotspot, Batman!\"</p>\n<p>That gets his attention all right.</p>\n<p>\"We can now watch squirrels 24/7.\" Stiles announces, triumphant.  \"How much do you love me?\"</p>\n<p>Derek raises an eyebrow.  Ok, dumb question!</p>\n<p>Never before has anyone put forth this much effort to spy on the Beacon Hills squirrel population, but Scott's been freaking out because Derek has been freaking out because the animals in these parts have been freaking out and Stiles is <em>sick of hearing about it.  </em>So, Stiles to the rescue! <em>with technology!</em>  because claws and stalking are all well and good, but Stiles is gonna drag Derek's problem-solving strategies into the 21st century kicking and snarling if he has to.</p>\n<p>Derek watches the awesome homegrown nature documentary on Stiles' phone for a while and he looks genuinely pleased.  Stiles can count on one hand the number of times Derek's been <em>visibly</em> satisfied with something Stiles has done for him.   Seriously.  It's rare, it's like <em>finding a unicorn,</em> and it's <em>awesome</em> and <em>that's</em> why Stiles stupidly keeps trying.</p>\n<p>Sadly, that's also why he's in the middle of nowhere with a werewolf on a Saturday morning.  He could be sleeping.  But no, he's here.</p>\n<p>Stiles is the master of doing like six things simultaneously so he's totally capable of watching his webcam feed (it works! it's awesome! he can zoom!) and walking back to the car through the woods at the same time.  Derek doesn't need to keep shoving him when he gets too close to trees.  Stiles can see the trees coming, he isn't going to run into them.  Probably.</p>\n<p>Movement catches his eye, and though Stiles doesn't understand completely what he's looking at, he's looking at <em>something</em>.  It's definitely <em>something</em>.  \"I got something,\" he says, and waves his phone at Derek to get him to stop.  What he's got looks like… shoes?  Probably it's a whole person, it's just that Stiles, in what now seems like a terrible decision, aimed the camera at squirrel height.</p>\n<p>\"Hunters, from out of town,\" Derek says, and then he cryptically adds, \"I've seen them before.\" So, ok, history there.  Stiles doesn't even have to ask if these hunters are bad news because pretty much all of Derek's history is empirically <em>awful</em>.  That and there's a look on Derek's face that clearly states, <em>We're screwed</em>.</p>\n<p>\"Why are they…\" Stiles starts to ask but then, of course.  Derek.  These are <em>Derek's</em> woods, these guys are deliberately messing with <em>Derek's</em> squirrels.  \"You? Specifically.\"</p>\n<p>Derek grimaces.  \"Me,\" he says.  \"Specifically.\"</p>\n<p>Stiles watches dejectedly as the shoes turn, stomp on, and destroy Stiles' camera.  Damn.  That thing was like $80.</p>\n<p>\"And now they know we know,\" Stiles says.  \"Awesome.  This was a great plan when we were just spying on the squirrels.  Now?  Less so.\"</p>\n<p>Unexpectedly, Derek says, \"It's still a good plan.\"</p>\n<p>Stiles has about a million questions - <em>what kind of weapons do they have?  Are they using magic?  What did they do to you?  Why do you look scared?</em> <em> </em>Before he can ask any, Derek closes his hand over Stiles mouth to quiet him and all that comes out is vowels.</p>\n<p>Derek says, \"Come with me.\"</p>\n<p>Stiles follows.</p>\n<p>\"Where are we going?\" Stiles asks when as it becomes more and more apparent that they're not headed towards the Camaro anymore.  \"Besides not out of the dangerous woods full of hunters?\"</p>\n<p>Derek gives some vague directions that sound like they could end with <em>to Grandmother's house we go</em> but he has a place in mind, so that's good.  That's a plan, they can work with that.</p>\n<p>\"My family had allies there,\" Derek says.  His tone is less than comforting.  \"They may help.\"</p>\n<p>\"May?\" Stiles asks.  There are verbs he likes better.  <em>Can</em> is good.  <em>Will </em>is great.  <em>May</em> is… problematic.</p>\n<p>Derek looks conflicted, like there's something he just really doesn't want to tell Stiles about this plan.  Eventually, he grits out, \"They don't like humans.\"</p>\n<p>Stiles almost, almost stops.  \"How is that our best option?\"  He asks, aware his voice is getting embarrassingly high pitched.</p>\n<p>\"They <em>probably</em> won't kill you,\" Derek says.  Probably?  Oh God he's going to die.  \"Those hunters <em>absolutely</em> will.\"</p>\n<p>Christ.  Ok.  To Grandmother's house they go.</p>\n<p>The hunters catch up with them before they get to wherever it is they're going because <em>of course</em> they do.  And because they're hunters and therefore predictable they announce their presence by shooting Derek <em>in the back</em> with an arrow.  In the <em>back</em>, Jesus, these guys are complete assholes.</p>\n<p>Derek immediately starts sweating and looking pale so. Yay. Poison.  He doesn't break stride, if anything he starts moving faster.  Stiles can barely keep up, but he isn't falling behind -- his physical fitness level has improved dramatically since he's so often <em>running for his life</em> these days.</p>\n<p>Derek takes two more arrows to the shoulder, one after another, rips them both out, snarling.  He's starting to slow, a little -- the entry wound around the first arrow is turning unnatural colors.  Stiles is distracted by it, doesn't notice a hunter coming up on him until the guy is like <em>right there</em>.</p>\n<p>\"I'll get you my pretty,\" the hunter drawls, \"And your little dog too.\"  From this close Stiles can see his missing teeth, smell his foul breath.</p>\n<p>Great, these hunters are over-dramatic <em>morons</em>.</p>\n<p>Short, Rank, and Ugly levels a shotgun at Stiles and he panics, but Derek is suddenly <em>there</em>, shoving the hunter back and away, catching a bullet his side.  Crap!  Holy crap!  That happened!</p>\n<p>Derek growls, \"Go, we're almost there.\"  Stiles does not need to be told twice.</p>\n<p>Derek starts to stumble.  Stiles grabs him, hauls him in so his arm's across Stiles' shoulders and they keep moving.  Stiles can feel the warm wet of Derek's blood seeping into his clothing, smell the scent of decay coming off Derek's skin from this close.  They press forward until they must cross some line that only Derek can see and he stops. </p>\n<p>Stiles can't get his feet under him right, lurches forward, sending them both stumbling to their knees.</p>\n<p>Derek rears back and <em>howls</em>. </p>\n<p>Stiles is oddly familiar with wolf howling now (more than most, he'd say) but he's never heard anyone sound like <em>this</em>: pained, helpless, <em>desperate</em>.  It makes the hairs stand up on the back of his neck.</p>\n<p>Whatever Derek is trying to do, it works.  Stiles blinks and a woman is just <em>there</em> next to Derek.</p>\n<p>She says, \"Why have you come here?\"</p>\n<p>\"Hunters,\" Derek grinds out, \"Help.\"</p>\n<p>\"This one is yours?\"  She asks, without as much as a glance in Stiles' direction.   \"He has your smell.\"</p>\n<p>Derek says, \"Yes.\"  And what? What? Ok, they'll talk about that part later!</p>\n<p>She nods, says, \"We will help you.\"</p>\n<p>All the fight goes out of Derek at once and he straight up passes out, leaving Stiles alone with this strange woman and forest full of Deliverance-looking hunters.  Great!  Awesome! Stiles' day is just getting <em>better and better</em>.</p>\n<p>Nothing happens for a minute and then a hunter comes creeping forward out from behind the tree he was using as cover.  He must think that with Derek out he can take Stiles and Vaguely Menacing Woman here on his own.</p>\n<p>And, wow, turns out he's very very wrong about that.  Miss Menacing just <em>looks </em>at him and he <em>catches on fire</em> without her <em>moving</em> or <em>saying a word</em> and OK THAT JUST HAPPENED.</p>\n<p>Miss Menacing says, \"Come with me.\"  She turns her back on the hunters, unconcerned.</p>\n<p>Stiles looks helplessly at Derek's slumped over body -- no way Stiles is strong enough to carry him.  He glances at Miss Menacing's retreating back, torn, and when he looks to Derek again there are two new creepy-strange women with him.  They lift him effortlessly between them, like they do this <em>all the time</em>.  Maybe they do!  Maybe they get half-dead werewolves on their doorstep <em>daily</em>.</p>\n<p>Stiles has to jog to catch up to Miss Menacing as she winds deeper and deeper into the close, dark woods.  He's never felt so claustrophobic outside, but the dense dampness of these trees makes him feel more like he's surrounded by walls than he's comfortable with. </p>\n<p>Stiles follows Miss Menacing, executing a disorienting number of twists and turns before she finally stops.</p>\n<p>She says, \"Remain here.\"</p>\n<p><em>Here</em> being the Forest Moon of Endor equivalent of a room at the Motel 6: a queen-size patch of soft-looking moss, a couch-ish toppled tree, and another fallen log that looks flat enough to use as a table.</p>\n<p>Miss Menacing leaves, silent.  It's nearly full dark before she comes back with Derek.  <em>Most</em> of Derek.</p>\n<p>\"Oh my God!\" Stiles shrieks, and shoves past her once she's set him down on the moss-mattress.</p>\n<p>Derek is pale and shaking, his visible wounds still bleeding sluggishly.  Stiles has never seen him look worse, and he remembers Peter <em>shoving his hand</em> through Derek's chest.</p>\n<p>\"What did you do to him?\" Stiles asks, frantic.  \"Is he going to be ok?\"</p>\n<p>Miss Menacing leaves <em>again</em>, still saying nothing, and Stiles has to trust that since Derek isn't dead already, he's going to be fine.</p>\n<p>He's going to be <em>fine</em>.</p>\n<p>Stiles phone is dead (not that it was getting a signal anyway) and since he wasn't <em>planning</em> on spending a significant amount of time in the forest when they set out on Saturday, he didn't brother to bring a book.  Stiles is <em>bored</em>. </p>\n<p>Derek doesn't say much, but that hasn't stopped Stiles from having a pretty awesome conversation with him <em>for the last three days</em>.  Stiles' ability to amuse himself with his the sound of his own voice is resolutely undeterred by adverse circumstances.  It's like terrorism:  Anytime.  Anywhere.  Anyplace.</p>\n<p>Stiles is about to ask the hulking, unconscious mass that is Derek Hale about his thoughts on anti-bacterial hand soap (good hygiene or the mother of the modern day superbug, you decide!) when a lady-<em>witch?</em> -lady drifts into their… grotto? glen?  Without making eye contact or uttering a single audible syllable she sets down a bowl of, sigh, nuts and frickin' berries on the fallen tree that Stiles has been using as a coffee table.  And then she drifts out again.</p>\n<p>Ok, bowl is an exaggeration.  Hunk of moss-covered bark.  Whatever.  Stiles is kind of done with living trapped in the forest.  His lipids and triglycerides are probably amazing right now, but holy crap does he miss curly fries.</p>\n<p>Derek needs to know this.</p>\n<p>\"These ladyfriends of yours,\" Stiles says, \"They seem unclear on the concept of actual food.\"  Stiles should really be grateful that they've been periodically showing up to feed him at all, but…  \"I've been living on, seriously, <em>nuts and berries</em> while you've been taking this stupid power nap of yours.  I need you to wake up and kill me a squirrel already.\"</p>\n<p>\"They don't eat,\" Derek says.</p>\n<p>Stiles has a small heart attack, he's sure it's a heart attack.  He takes his eyes off Derek for <em>one minute!</em></p>\n<p>\"You're awake!\" Stiles squeaks, once his heart starts beating again.  \"When did you!\"</p>\n<p>\"Hags don't eat,\" Derek says, \"They live on magic.\"  His voice is rusty but flat, informative.  Not the tone Stiles would have expected.  It's like Derek's giving a lecture instead of <em>waking up from a brief coma</em>.</p>\n<p>\"Hags?\"  Stiles asks, because, really?  <em>Hags</em> makes Stiles think of like, 60 year old crones covered with warts.  \"What do you mean?  These women?  But they're all like… your age.\"</p>\n<p>Derek snorts.  Stiles tries not to be overly insulted.  Derek says, \"These women are all at least 100 years old.  And they're not really <em>women</em>.  They forgot how to be human long before either one of us were born.\"</p>\n<p>Ok, that's vague as hell.  And has elevated Miss Menacing and her buddies to a whole new level of terrifying.</p>\n<p>Derek rolls over, a little, says, \"You gonna share those?\"</p>\n<p>Stiles hands over the moss-bark-bowl because, hey, who's Stiles to deny Derek the joy of hag cooking?</p>\n<p>Derek is sleeping again, but it's <em>just</em> sleep now, he's going to wake up this time.  Stiles is more than a little uncomfortable with how easily he can recognize the tiny, subtle differences between a nap and a coma these days.</p>\n<p>Miss Menacing comes in and sits on the edge of the moss-bed by Derek's feet, without bothering to acknowledge Stiles' presence.</p>\n<p>Derek shifts a little, opens his eyes.</p>\n<p>Miss Menacing says, \"You are much recovered.\"  It's the first thing she's said (that Stiles has been able to hear) since they got here.  Stiles was thinking that maybe they didn't really want to talk <em>at all</em>, but nope, they just didn't want to talk <em>to Stiles</em>.</p>\n<p>\"Thank you,\" Derek says.  He sounds, looks a little better than the first time he woke up.</p>\n<p>\"We knew the Hale family to have left these lands.  I am glad that is not true.\"  Miss Menacing has a strange, old-fashioned cadence to her speech patterns.  It makes it easier to comprehend that she's probably older than <em>California</em>.  \"We may have need of each other again.  It was so in the past, so may it be in the future.\"</p>\n<p>Derek nods, solemn, and Stiles understands that she's told Derek something really significant, though Stiles has no idea <em>what</em>.  Times like this he wishes he had a vague-supernatural-being-to-English dictionary.</p>\n<p>She stands and starts to leave, pausing just before she's all the way gone and saying, \"The human-child cannot remain here unmarked.\"</p>\n<p>Derek looks startled, then <em>terrified</em>, and then a stoic expression slams down over his face like a guillotine.  \"I understand,\" he says.</p>\n<p>\"Tonight then?\"  Miss Menacing asks.  Derek nods again, but this time it looks like it's costing him.</p>\n<p>\"Good,\" she says, and leaves.</p>\n<p>Something has obviously just happened that has Derek freaked out, something that involves Stiles.  From the way he's still visibly tense and anxious after she's gone, it's not something good.</p>\n<p>Derek opens his mouth a few times like he's going to say something, but keeps closing it and then shaking his head.   When he finally gets a whole sentence out, what he says is, \"The only reason they've let you stay here is they think you're my mate.\"</p>\n<p>Interestingly enough, Stiles kind of put that part together already.  What with the whole <em>he has your scent</em> thing.</p>\n<p>Derek says, \"Which you aren't.\"  Like Stiles had maybe missed that detail.  \"But I <em>said</em> you were and until now I haven't been strong enough to prove it in a manner they would accept.\"</p>\n<p>Stiles does not like the sound of <em>prove it</em>.</p>\n<p>\"And now that you are…\" he starts, and then realizes.  <em>\"Oh</em>.\"</p>\n<p>Stiles reels a little.  He says, \"But we're not-\"  He cuts himself off before he says <em>in love</em>.</p>\n<p>Christ, they're not even really <em>friends</em>.  They're working on being <em>allies</em> and even that's been <em>really effing hard</em>.</p>\n<p>Derek says, \"It doesn't matter.  It'll take, regardless.\"</p>\n<p>Stiles has read up enough about werewolf mating to know it's not just a thing that miraculously and spontaneously <em>happens</em>.  But other than that, he doesn't really know <em>anything</em>.  He didn't think it was <em>pertinent</em>.</p>\n<p>Stiles asks, \"They won't just take your word for it?\"</p>\n<p>\"No,\" Derek says. \"They only recognize magic.  Humans have lied to them too often.  There's a reason they live this deep in the woods.\"  He sounds a little envious about that part.</p>\n<p>\"Fantastic, they just have massive trust issues.\"  Stiles wants to meet a well-adjusted magical creature, just once.  For kicks.</p>\n<p>Stiles asks, \"And what happens if they find out you were <em>lying?</em>\"</p>\n<p>Derek looks concerned.</p>\n<p>\"Holy crap!  Why the hell did you <em>lie</em> to incredibly powerful magical beings with <em>trust issues?</em>  How was that <em>Plan A?</em>\"</p>\n<p>Derek says, \"We're not arguing about this, it's already done.\"</p>\n<p>\"Like hell we're not fighting about this,\" Stiles says, indignant.  \"What were you <em>thinking?</em>\"</p>\n<p>\"I was thinking it was worth the risk if it kept you alive!  And it worked, so drop it.\"</p>\n<p>\"You had no idea that it was going to work!\" Stiles throws his hands up.  Why is Derek the most frustrating werewolf in the history of ever, why is Stiles even helping him, <em>why is this his life?</em>  \"Why did they even believe you in the first place?\"</p>\n<p>Derek says, \"You reeked of me,\" which is unfair.  Stiles only smelled because he'd gotten covered in Derek's bodily fluids trying to <em>staunch the bleeding</em>.</p>\n<p>\"What if we refuse to, you know, make it official?\" Stiles asks.</p>\n<p>Derek looks like he's thinking, comes back with, \"They'll cast us out, leave us to the hunters, and the alliance my family worked for generations to forge will be irreparably broken.\"  Super!  That sounds <em>great</em>.  Good option.</p>\n<p>Derek says, \"We could leave.  Now.\"  <em>Without pissing off the hags</em> going unsaid.  It <em>sounds</em> like a good plan, except where it has <em>exactly the same consequences</em> as the other, terrible one.</p>\n<p>\"No,\" Stiles says, because <em>no</em>. \"No way!  Get that out of your head, <em>you'd die.</em>  No way are you strong enough for that.  No offense to your delicate Alpha sensibilities, but you couldn't take those guys on at full strength and you're nowhere near that.\"</p>\n<p>Derek looks like offense was taken to his Alpha sensibilities, but Stiles doesn't <em>care</em>.  Because <em>no</em>.</p>\n<p>Derek says, \"The hunters might not kill you if you go without me.  Or if I'm already dead.\"  And that's lovely and noble and <em>pointless</em>.</p>\n<p>\"Oh my God, no.  All kinds of no.  They are <em>absolutely</em> going to kill me.  You said so yourself.  They did not seem partial to, um..\"  Stiles struggles a little for a word that means <em>teenagers who hang out with werewolves</em>.</p>\n<p>\"Sympathizers.\"</p>\n<p>\"Yeah,\" Stiles says.  \"So our options are: get thrown out of here and be killed by hunters, leave voluntarily and be killed by hunters, or… uh.\" No way is Stiles saying it out loud.  It's just too frickin' weird, even by his new and improved standards for weird.</p>\n<p>\"Ok,\" Stiles says.  They don't have a choice, not a real one, not really.  But this is still, it's gotta be Stiles' decision.  He has to own this one.  \"Ok.  What do we have to do?\"</p>\n<p>\"Fine,\" Stiles says, \"Do it.\"</p>\n<p>Derek looks at him again, a kind of <em>are you sure you're sure</em> check, like all that matters is Stiles' opinion. Like this is not going to completely <em>fuck Derek's shit up</em>.</p>\n<p>Stiles shoves down his impending panic attack because if they don't do this <em>they will both die</em>.  Derek has already committed to this, Stiles owes him to go through with it.</p>\n<p>Stiles nods.</p>\n<p>Derek takes a deep breath and then, holy crap, <em>claws open his chest </em>over his heart.  Stiles has gone through <em>a lot</em> recently to get Derek to <em>stop</em> bleeding and he just… but the wound's already healing.  Derek only bled enough so that it's coating the palm of his hand, like especially disturbing finger paint.</p>\n<p>Stiles is paralyzed into inaction, too freaked out to move.  Derek places his non-bloody hand against the side of Stiles' neck and slowly, deliberately places the other one high up on Stiles' back, between his shoulder blades.  And.  It doesn't hurt, exactly, but it's warm.  Uncomfortable.   Like how your skin feels when you know you're getting a sunburn.</p>\n<p>Stiles says, \"I can hear your heart beating.\"  Because he<em> can</em>.</p>\n<p>He can hear the sound of a brook all the way across the clearing.  He can see every hag that's watching from the darkness just outside of the ring of light cast by the fire.  He can smell Derek, but more than just <em>smell</em>, he can…  Derek is <em>exhausted</em>.  Derek is exhausted and scared and Stiles kind of knew that from the context, but now he just <em>knows</em>.  And <em>holy crap</em> Derek is in a lot of pain.  It's a relief, for the both of them, when he loses consciousness.</p>\n<p>Stiles doesn't catch Derek so much as assist in Derek falling down semi-gracefully, because Derek is <em>heavy</em> and Stiles is <em>weak</em> and <em>overwhelmed</em>.</p>\n<p>Miss Menacing says, \"It's done,\" <em>of course</em> she does, and two hags come forward to move Derek.  Stiles gets a full-on rush of <em>don't you touch him</em> and.  Yeah.  That's something he's going to analyze and freak about <em>later</em>.</p>\n<p>Stiles says, \"I can do it.\" </p>\n<p>He really can't, but adrenaline is <em>amazing!</em> and Derek's only mostly out, apparently, so Stiles hauls him up and half-drags, half-carries him back, dumps him on the moss-mattress and crawls in after him.</p>\n<p>Stiles' back itches.</p>\n<p>Ok, his back <em>doesn't </em>itch but it feels like it <em>should</em> and that's way worse.</p>\n<p>Why couldn't Derek have picked some part of him that Stiles could <em>see</em>?  As opposed to laying his big wolfy paw down on Stiles' corporeal blind spot.  When Stiles touches it the skin feels normal, unchanged, but he can't stop himself trying to get a look at it, keeps craning his neck around until it hurts, but all he can see are the dark smudgy edges of what he knows... thinks… <em>thinks he knows</em> is there.</p>\n<p>He'd ask Derek what his back looks like now, if Derek wasn't busy being passed out for, you know, ever.  <em>Again</em>.</p>\n<p>\"Hey, big guy, do you think I should be putting ointment on this thing?\"</p>\n<p>Nothing.</p>\n<p>Stiles hadn't really spent a lot of time imagining his wedding night, he wasn't <em>a girl</em>, but he'd had ideas.  Vague, sexy ideas.  Dragging Derek's unconscious body back to their forest glen? not what he'd had planned.</p>\n<p>\"I just want you to know that so far this honeymoon sucks.  For one, the food is awful.\"  Stiles listlessly picks up another so-called 'bowl' of 'food.'  \"Also, the amenities are terrible.  Where's the exercise room?  The hot tub?  The conference center?  I expected more for my money.  Oh and the staff?  Well let's just say this place won't be getting five stars from me on tripadvisor.\"</p>\n<p>Stiles nearly falls off his perch when <em>Derek laughs</em>.  When did he even wake up?  And since when did Derek <em>laugh?</em></p>\n<p>Derek says, \"I'll kill you a squirrel.\"</p>\n<p>Stiles asks, \"Are you ok?\"  Though obviously Derek is going to be fine if he's making stupid jokes.</p>\n<p>Derek says, \"You'd know if I wasn't.\"  He <em>looks</em> like warmed-over wolfcrap, but his eyes are open!  He's talking!  He's attempting to sit up!  He shouldn't do that.</p>\n<p>\"Whoa there, lay your furry butt back down.\"  Stiles moves in, pushes Derek back, and Derek goes without protest because he's weak as a baby kitten.  In this state, even <em>Greenburg</em> could take him in a fight.</p>\n<p>\"Take it easy, babe,\" Stiles says, aiming for a tone in the range of <em>magnanimous</em>.  \"We're paid up at Chez Hag through the end of the week.\"</p>\n<p>Derek laughs, <em>again!</em> and doesn't try to get back up, double-win there.  He falls asleep, actually, which sucks hard but hey, for like a minute there Stiles was talking to someone that talked back.  That part was awesome.</p>\n<p>Stiles wakes up, rolls over, doesn't see Derek, and immediately, embarrassingly, he panics.</p>\n<p>Derek could be anywhere.  He could be out in the woods killing/getting killed by the hillbilly hunter squad!  Or the hags could have done something awful!  Maybe they've been biding their time until he was stronger so that they could do something magical and unspeakable to him!  Or maybe…</p>\n<p>Maybe Stiles is over-reacting, Derek is just out of sight, and Stiles <em>knows that</em> because ever since the, uh, ever since That Happened he can <em>sense where Derek is at all times.</em></p>\n<p>God, he's such a dumbass.</p>\n<p>Stiles stumbles out of their glen, follows the gut-feeling turn-by-turn directions he's getting from his newfound Derek GPS.  And boy is he glad, because what he finds is <em>glorious</em>.</p>\n<p>\"Oh thank every god ever,\" Stiles gushes.</p>\n<p>Derek raises an eyebrow, turns his attention towards Stiles and away from the (oh, oh yes) skinned, dead rabbits he's roasting over a campfire.</p>\n<p>They're literally dripping with fat.  It's easily the best sight Stiles has ever seen.  He <em>wants</em>.</p>\n<p>Stiles reaches out towards the rabbits instinctively, Derek growls and smacks his hand away before Stiles can burn himself.  Stiles tries to growl back, a little and Derek looks at him like, <em>Yeah. Right.  </em></p>\n<p>Stiles huffs.  He's just so <em>hungry.</em></p>\n<p>Even though it's totally weird! he lets Derek claw off hunks of the still-cooking rabbits and hand them over bit by bit.  It makes more sense to eat this way -- they don't have trivets, or plates, or forks, or knives, or anything except werewolf claws and moss.  Stiles is really sick of everything he eats tasting faintly of moss.</p>\n<p>At some point, Stiles remembers human manners (what? he's lived for like a week with just hags and an unconscious werewolf) and asks, \"Did you want some?\"</p>\n<p>\"I ate,\" Derek says flatly.</p>\n<p>Stiles has a brief, horrifying visualization of Derek picking rabbit fur out of his teeth.  Stiles stops chewing, totally grossed out for a few seconds.  But only a <em>few</em> seconds because oh my God the rabbit tastes <em>amazing</em>.</p>\n<p>\"Thanks, man, thank you so much.  Man was not meant to live by nuts and berries alone.\"</p>\n<p>Derek nods in agreement.  Stiles would feel conflicted about eating something fuzzy and cute if he wasn't so starved.  Peter Cottontail here died so that Stiles might live, it's a noble cause.</p>\n<p>\"So is this like,\" Stiles starts, unable to stop himself from looking a gift-bunny in the mouth, \"So is this like a thing?  Providing for me?  Is that part of this?\"  Stiles flails awkwardly, trying to encompass in one gesture the totally of their…</p>\n<p>\"Yes,\" Derek says.</p>\n<p>\"Yes?\"</p>\n<p>\"Yes.  Providing for your mate is part of it.\"</p>\n<p>\"So you like… have to.\"</p>\n<p>\"I don't have to do anything,\" Derek says.  \"But if you were hurt, or starving, or… I would feel it.  I'd have to be a pretty sadistic bastard to want that.\"</p>\n<p>Stiles nods, because yeah.  Ok.  That makes sense.  Mi casa es… Derek's casa?  Scratch that thought.</p>\n<p>\"But it's not like I can be all <em>make me a sandwich</em> and you'd actually do it.  Because that would be messed up, man.\"</p>\n<p>\"I'd do it if you really needed a sandwich,\" Derek says.  \"Also we'd need bread.\"</p>\n<p>Stiles is always too startled to laugh when Derek's funny on purpose.</p>\n<p>\"Mustard would be difficult.\"</p>\n<p>Stiles nods.  \"Let's stick to rabbits then.  For now.\"</p>\n<p>Stiles would have thought the Michigan Militia hunter squad would have given up and gone home after consecutive days hanging out in the suburbs of Hagsville (population: two dozen ancient and powerful not-women, one Alpha, and one Stiles), but Stiles is for some reason <em>always wrong.</em></p>\n<p>Well. He <em>hopes</em> he's wrong about what he's thinking Derek is thinking right now -- because Derek is projecting a jumble of <em>protect pack</em> a lot of anger and violent aggression mixed in for good luck.  That makes Stiles think that Derek's forming an aggressively terrible plan, one that involves a lot of people dying.</p>\n<p>\"Dumb question?\" Stiles asks. \"Can the witches, uh, sorry, hags? Can they bamf us back to the Camaro?  Skipping over the part of your plan where you kill like half a dozen people?\"</p>\n<p>Derek raises his eyebrows at Stiles, startled.</p>\n<p>\"Hmm?\"  Stiles says, \"What?  I am getting, like, <em>strong emotions </em>from you.  Like, you know, Deanna Troi.  Captain, I'm sensing a lot of murderous rage?\"</p>\n<p>Derek doesn't laugh, but he looks like he wants to.</p>\n<p>\"But really,\" Stiles continues, \"These chicks are seriously scary and powerful, and I think the want us gone.  I <em>know</em> they want <em>me</em> gone.  They're all, you know, they give me significant looks.\"</p>\n<p>Derek says, \"Bamf?\"</p>\n<p>\"I didn't want to say apparate,\" Stiles says, sheepish.</p>\n<p>Derek furrows.  \"Teleportation is impossible.\"</p>\n<p>Well that's disappointing.  \"That's not fair. Werewolves? Fine.  Lizard monsters? Bring it on.  Freaky centuries-old ladies who still look like the cast of Gossip Girl? Why not! But beam-me-up-Scotty, that's out of the question.\"</p>\n<p>Derek sighs. \"Magic is arbitrary and capricious.  Get used to it.\"</p>\n<p>\"Fine,\" Stiles concedes. \"But how do we get from here to not-here without them filling you with poisoned arrows again?  And without you killing everybody like you so obviously want to?\"</p>\n<p>Derek pulls his claws back in.  Oh God, when did claws happen?</p>\n<p>Derek furrows more, Stiles assumes that means he's thinking deep thoughts, and that just kickstarts Stiles' Adderall-less brain down stupid paths like <em>do werewolves get wrinkles like everybody else? </em>and <em>those hags all look awesome for their age, could I become one?</em> <em>I'd totally be more cool living in the woods if I was all-powerful and eternally hot, too</em>, and <em>hey it's like we got green card married so we could stay in Hagsville!  It'd be stupid to leave just so we can be brutally murdered.</em></p>\n<p>Derek says, \"We could be invisible.\"</p>\n<p>\"Sweet!\"</p>\n<p>Derek scowls.  \"Not like that.\"</p>\n<p>Stiles doesn't know why he keeps getting his hopes up like this.</p>\n<p>\"They're tracking me somehow,\" Derek says, \"Or else they wouldn't have found me in the woods and they wouldn't still be waiting for me out there.  They're using magic.  If we can neutralize that, then we might be able to get by them undetected.  We'll have a chance.  <em>A chance.</em>\"</p>\n<p>Ok, fine, not <em>Cloak of Invisibility</em> invisible, but invisible to magic radar invisible.</p>\n<p>\"Magic stealth,\" Stiles chirps, excited because <em>magic stealth</em> is a real thing in his life now.</p>\n<p>\"Yes.  I'll talk to the elder about it.  Stay here.\"  Derek growls a lot on the last part, like he's super afraid <em>now</em> is the moment Stiles decides to wander off.  Not when Derek first got shot up with poison arrows.  Not when they first stumbled, bleeding, into Hagsville. Not when Derek was passed out for three days.  Not when they were politely forced to get wolf-married.  Now.  <em>Now</em> is when he thinks Stiles makes a break for it.  Guy has got some <em>issues</em>, probably some justifiable fear of abandonment.</p>\n<p>Stiles stays put, the sun sets, he gets hungry and bored.  He thinks really loudly about how much he hates Derek Hale and his stupid face and hopes that Derek's picking it all up on his Stiles-dar the way Stiles is picking up Derek's location and vague impressions.  Anger, anger, hey look: some more anger, and fear.  Well, it sure is nice to know that Stiles isn't alone in being scared shitless all the time.</p>\n<p>Stiles isn't even hating on Derek anymore by the time Derek comes back, Stiles is too bored for that.  He's been trying to remember all the words to American Pie for the last ten minutes and singing the ones he does know at the top of his lungs.  The hags, no doubt, appreciate his musical genius.</p>\n<p>\"Take this,\" Derek says, and hands him a crystal on a hemp chain (typical!).  \"We're leaving.\"</p>\n<p>Derek is already wearing a matching necklace and Stiles' addled brain thinks it's fitting, since they didn't have wedding rings.  They should have <em>some</em> piece of matching jewelry, even if it makes them look like new age stoner frat boys.</p>\n<p>It's well past the time for them to return to society if Stiles is starting to think any of this makes any sense.</p>\n<p>\"Once more unto the breach,\" Stiles says, follows close as Derek stalks off.</p>\n<p>The car radio is too busy and loud after days of forest quiet, so Stiles switches it off almost immediately after he turns it on.</p>\n<p>\"This was nice and all,\" he says, \"But you owe me a destination vow renewal in like, Hawaii.  Aruba.  Martinique.  Petit St. Vincent.  All of those, not just one of those.  Like, the whole Caribbean at this point.\"</p>\n<p>Derek huffs, fingers still white-knuckle tight on the steering wheel even though they'd slipped quietly past the hunters and their ATVs and their empty cases of Old Style like ten minutes ago.  It'd been both terrifying and mildly anti-climactic.</p>\n<p>\"Hey,\" Stiles says. \"Hey, we're fine.  See?  Fine.\" He lays his hand on Derek's shoulder, which sparks a little comfort-frission-feeling up Stiles' spine and Derek visibly relaxes.  He cuts the steering wheel sharply, nearly swerving into a PT Cruiser in his sudden haste to make the next exit.</p>\n<p>\"Whoa! Hey!\" Stiles starts.</p>\n<p>\"You're hungry,\" Derek says.</p>\n<p>Stiles says, \"What does that have to-\" but stops the second he realizes that Derek has pulled into the parking lot of an Arby's.  \"I take it all back,\" Stiles says, \"You're the best werewolf-husband ever.\"</p>\n<p>Derek sinks into his seat, unpries his hands from the steering wheel.  He says, \"Make it quick.\"</p>\n<p>Derek makes no indication he wants anything, Stiles brings him back a milkshake and curly fries anyway.</p>\n<p>The rest of the ride home passes in something like companionable silence, Stiles falling in and out of sleep.  He wakes up fully, realizes Derek has stopped the car in front of a park about half a mile from Stiles' house.</p>\n<p>\"It wouldn't be a good idea for us to be seen together right now,\" Derek says.  \"Get out.\"</p>\n<p>Stiles is confused, irrationally hurt before he remembers: former person of interest in multiple murder investigations plus Sheriff's son gone missing for a week, not a good combo.</p>\n<p>Stiles half-falls out of the car, stands by the side of the road without really having anything to say.  \"The romance is dead,\" he says, anyway.  \"I knew this would happen.\"</p>\n<p>Derek says, \"Don't lock your window.\"  He drives off.</p>\n<p>Stiles walks the last few minutes home muttering to himself about stupid werewolves and renegade hunters until he turns onto his street and <em>HOLY CRAP</em>.</p>\n<p>He's not sure why he expected less than a statewide manhunt.</p>\n<p>If Stiles had known he was going to be on CNN, he would have worn a different hoodie.  The one he has on now started off a light gray, but over the last week or so has morphed into the dingy, awful brown color of Bruce Willis' tank top at the end of Die Hard.  Why didn't he wear more black?  Black would have at least hid the bloodstains.  Well, some of them.   Ok, Stiles is <em>covered in blood</em> (Derek's mostly), nothing is going to make him look less awful.</p>\n<p>Still, he'd have liked to have bathed before his nationally televised debut.</p>\n<p>\"I'm just happy to be home,\" he says.  It's what everybody in this kind of situation says on TV, because apparently it's true.  Stiles is ecstatic to see his house, hug his dad, even to be prodded by EMTs, though he's totally fine!  \"It's been a long week.\"</p>\n<p>The CNN lady looks like she wants to ask more, but one of Stiles' dad's deputies hustles Stiles off camera before Stiles can spout of another platitude.  He was thinking something along the lines of <em>we'll just take it one day at a time</em>. </p>\n<p>The deputy they always put in front of the cameras -- because she's pretty and can string together complete sentences -- says something about the Stilinski family requesting privacy in this difficult time and just like that Stiles' moment in the spotlight is done.</p>\n<p>He's gently prodded, pushed into the house and set down in the living room, and that's when he realizes he's <em>exhausted</em>.  Farewell, adrenaline, we hardly knew ye.</p>\n<p>\"I'm going to bed,\" Stiles says to the deputies camped out around the dining room table, most of them hunched over cups of what smells like terrible coffee.  They all look like they haven't slept in a week and Stiles is trying not to feel guilty about that.</p>\n<p>Hauling himself off of the couch takes monumental effort, getting up the stairs is a Herculean feat, but when he gets to his room and finds Derek there it's worth it for the palpable rush of relief Derek feels at seeing him.  At seeing <em>Stiles</em>.  No one besides blood relations has ever been this happy to see Stiles, it's kind of nice.</p>\n<p>Derek says/asks (how does he do that?), \"The Sherriff.\"</p>\n<p>\"Out,\" Stiles says.  \"Along with 30 of his closest interdepartmental law enforcement buddies.\"</p>\n<p>Derek raises an eyebrow.</p>\n<p>\"He may have been lead to believe that I was kidnapped by a gang of heavily armed men.  He may have also been given license plate numbers and GPS coordinates.\"  Stiles half-smiles. \"He's not gonna find them, but it should be enough to make them stay away from here.\"  Stiles thinks/doesn't say, <em>Stay away from you</em>.  Those hunters weren't going after <em>Stiles</em>.</p>\n<p>Derek says. \"Yes.\"  And then, without even sounding begrudging, he says, \"Good work.\"</p>\n<p>\"De nada,\" Stiles says with feigned casualness.  \"They did most of the work, I mean, they already <em>had</em> the rape-van.\"  There'd been pelts, <em>pelts</em>, in the back of it.  Stiles had thrown up when he saw them.  \"And what are they gonna say?  No officer, we didn't kidnap your son, we were just going to shoot him for associating with werewolves?  They're smart enough to leave town, even if they're not smart enough to have not come to town in the first place.\"</p>\n<p>Stiles tries to walk, but stopping at all has made his knees freeze up and he pitches forward a little instead.  Derek steadies him with a hand on Stiles shoulder and <em>huh</em>.  It's that same shock to the system he felt in the car before, like being tazered with calm, soothing feelings instead of electricity.</p>\n<p>Stiles says, \"You're way better than Xanax, man.\"</p>\n<p>Derek raises his eyebrow <em>even further</em>, but he catches Stiles as he turns into a total girl and passes out.</p>\n<p>Stiles wakes up gradually to the smell of <em>good</em> coffee (Dad's home then) and the sight of Derek asleep in his bed.  Crap.</p>\n<p>\"Ok, hey, big guy! Up and at 'em!\"</p>\n<p>Derek growls, will not be moved.  Stiles freaks out a little.</p>\n<p>\"Nope! No! Nyet! You cannot stay here, not with what is <em>certainly</em> the cast of CHiPs in my kitchen!\"</p>\n<p>Derek rolls over (oh hi where did his shirt go?), but he doesn't open his eyes, and Stiles can <em>feel</em> his cozy-warm let's-sleep-in-today contentment.  It's an addicting feeling, and Stiles wants to crawl back in bed with him, except, right, suspected murderer (sigh, Stiles' fault there) in his bedroom in a <em>house full of cops</em>.</p>\n<p>\"You have to go,\" Stiles says.  He's starting to panic a little, Derek <em>has</em> to feel that, right?</p>\n<p>Even if he doesn't feel Stiles' <em>get-out-get-out-get-out</em> vibes he can <em>absolutely</em> hear Stiles' dad calling for Stiles to wake up already.</p>\n<p>Derek's eyes snap open.  Within seconds he's fully dressed and gone.</p>\n<p>Aware that it looks like he's talking to an empty room (and not caring!), Stiles says, \"What?  No goodbye kiss?\"</p>\n<p>Stiles' phone chirps with a text message a few seconds later.  It just says: NO.</p>\n<p>Ha! Derek <em>did</em> hear him.</p>\n<p>Stiles phone chirps again: COME BY WHEN YOU CAN.  BRING CARDBOARD BOXES.</p>\n<p>Ladies and gentlemen: Derek Hale, fan of capslock.</p>\n<p>Stiles is just about to go downstairs in search of breakfast when he hears his dad yell, \"Scott's here.\"</p>\n<p>Scott!  Stiles is really, really excited about seeing Scott until he actually opens his door and crap!  it's Scott! <em>werewolf</em> Scott!  Stiles is totally not very prepared to talk to Scott about what happened in the woods yet.</p>\n<p>Scott's eyes narrow and he… yeah, he breathes in with his nose really obviously and Stiles is screwed.</p>\n<p>Scott gets super wolfy, growls, \"<em>What did he do?</em>\"</p>\n<p>Stiles backs up a little because it's been kind of a long time since Scott's lost control but he looks <em>unhinged</em>.  And Stiles doesn't need to be saved like a damsel in distress but being closer to the window can't <em>hurt</em>, right?</p>\n<p>\"Calm down,\" Stiles says, putting his hands out in that gesture that everybody does in this situation.  Why would his hands out be calming?</p>\n<p>Scott growls, \"What did he do?\"</p>\n<p>\"Can you keep your <em>voice down?</em>\" Stiles hisses, then Scott kind of, like, jukes into Stiles personal space in a surprisingly scary way and Stiles shouts, \"He SAVED MY LIFE! That's what!\"</p>\n<p>Scott falls back, surprised.  \"How? What?\"</p>\n<p>\"He had to, uh, claim me,\" Stiles says in a rush, hoping Scott won't hear it but, sigh, werewolves.</p>\n<p>Scott says, \"WHAT?\" And then at Stiles' glare, he says really quiet, \"What?\"</p>\n<p>Stiles shakes his head, pulls up his shirt, and shows Scott his back.</p>\n<p>\"Holy crap!\" Scott says, too loud.  And then he whispers, \"Holy crap!  Do you know what that means?  You mated with Derek!\"  Scott looks betrayed.  \"You didn't tell me you guys were together!\"</p>\n<p>\"We're not!  We weren't!  We still aren't!\"</p>\n<p>Scott gapes at him.  It's not his best look.</p>\n<p>\"It was, like, a <em>platonic</em> claim!  Or the hags would have let the hunters kill us!\"</p>\n<p>Scott gapes more.  \"The who?  What?  Tell me everything,\" he says.</p>\n<p>So Stiles gives him the highlights.  Scott stares, silent, for a long time.</p>\n<p>\"This is like,\" Stiles says, \"I've become one of those backwards Kentucky people who all get married at fourteen.  We had a shotgun wedding!  There were shotguns involved!  Actual shotguns!\"  Stiles sighs and puts his head in his hands.</p>\n<p>Scott shakes his head.  \"I have cousins from Kentucky.  They're nice people.  Lay off Kentucky.\"</p>\n<p>Stiles stares and stares and stares at him, in awe.</p>\n<p>\"How is that what you have to say to that,\" Stiles says, just <em>amazed</em>.</p>\n<p>\"Stiles,\" Scott says, serious.  \"If I actually let myself think about it, my brain's gonna explode.\"</p>\n<p>Fair enough.</p>\n<p>\"I'm not old enough to even have this legally,\" Stiles says, morose, and tugs his shirt back down over the massive Derek-shaped handprint <em>magically inked</em> between his shoulder blades.</p>\n<p>Stiles asks, \"Are you gonna be cool with this?\"</p>\n<p>\"Probably not,\" Scott says.  At least he's honest.  \"You don't even want to know what you smell like now.\"</p>\n<p>Stiles' dad yells again, inviting them down to breakfast.</p>\n<p>Stiles lets his head fall against his desk with a dull thud.  \"What am I going to tell my dad?\"</p>\n<p>He's not grounded, his dad just isn't letting him out of his sight <em>at all</em>.  That makes leaving the house to go see his super-secret werewolf ball-and-chain difficult.  (Derek keeps leaving him voicemails with increasingly fewer and fewer words and more and more growling.)  Stiles can't turn around without running into his dad and his dad's concern until he's <em>done with it</em> and he shouts, \"OH MY GOD LEAVE ME ALONE FOR LIKE FIVE MINUTES I'M GOING <em>OUT,</em>\" and storms out of the house.</p>\n<p>Not his best move, but it's effective.</p>\n<p>When he gets to Derek's house, though, he's not sure what to say so he starts with, \"So.  What does this. Uh.\"</p>\n<p>Derek looks tired.  Like he needs a nap and a beer, but all Stiles has for him are questions.  Such as: he figured the process would involve more… <em>mating</em>.</p>\n<p>\"It is what you want it to be,\" Derek says.  \"It's rare to have mated pairs who aren't involved, but it's not unheard of.\"</p>\n<p>\"So people have done it before just to get an all-access pass to <em>oh God what is that smell</em>?\" Stiles asks, disbelieving.</p>\n<p>\"That and other things.\" Derek sighs. \"I don't know everything, Stiles.  It's not like I've done this before.\"</p>\n<p>Obviously.</p>\n<p>\"Were your parents…\" Stiles trails off, the tattered remnants of his tact catching up with him a beat too late.</p>\n<p>Derek says, only, \"Yes.\"</p>\n<p>This close, Stiles can read an anthology of information in that <em>yes</em>.  Stiles has another hundred questions about <em>that</em>, things even <em>Stiles</em> knows to leave well enough alone.  He sits and stares at the charred-out floorboards for a while, thinking.</p>\n<p>\"What am I going to tell my dad?\" Stiles asks.</p>\n<p>Derek looks back at him blankly.  \"Tell him that I claimed you as mine.\"  He doesn't even say it like it's weird.  It's not hard to believe he was <em>raised by wolves</em>.</p>\n<p>\"I cannot say that.\"</p>\n<p>\"Your dad is just grateful you're alive.  He won't be as angry as you think.\"</p>\n<p>Stiles sighs, \"You obviously don't know my dad.\" </p>\n<p>Derek doesn't reply, which isn't helpful, and Stiles suddenly realizes that Derek isn't just walking back and forth at random, Derek is packing.  The duffle bag and shipping boxes really should have given that away, but Stiles has been justifiably distracted.</p>\n<p>Derek carefully rolls up a black T-shirt, places it into an unmarked brown cardboard box and Stiles panics.</p>\n<p>\"Where are you going?\" Stiles voice goes a little wavery and high pitched.</p>\n<p>Derek stops and looks at him with this expression Stiles can only interpret as <em>I wolf-married a dumbass</em>.  This is probably true, Stiles wouldn't want to be wolf-married to him either.</p>\n<p>\"You're my mate.  I have to protect you,\" he says, matter-of-fact again, which just blows Stiles mind because WHO SAYS THAT, WHO.</p>\n<p>\"By skipping town?\"  There isn't even a tiny part of Stiles that thinks this is a good idea.  \"Please don't be doing some crazy thing where you're all noble and - you know that never works, ever, right?\"</p>\n<p>Derek pauses, yet another T-shirt in his hand.  He must have a lot of those.  They get ripped to shreds like, all the time.  Good to have backups.</p>\n<p>\"I'm not leaving town.  That wouldn't make sense,\" Derek says.  \"I can't protect you unless I'm close to you.\"</p>\n<p>\"Ok and living in the middle of nowhere, obviously, that's not close enough.  Are you going to, um, get a place in town somewhere?\"  Derek looks at him again like he's being a moron on purpose.</p>\n<p>\"No,\" Derek says slowly.  \"That's not close enough.\"  He looks away from Stiles, then, deftly doing that thing where you overlap the top of a box to keep it closed.  That always takes Stiles like, 10 minutes.</p>\n<p>\"What is close enough?  I need you to use your words here.\"</p>\n<p>Derek says, through gritted teeth, \"I need to live with you.  If I'm not <em>with</em> you, I can't <em>protect</em> you.\"</p>\n<p>Stiles squeaks slightly at Derek's tone, which is serious and possessive and not something that Stiles thinks he can argue against.</p>\n<p>\"Oh crap,\" Stiles says.  \"How the hell am I going to explain you <em>moving in</em> to my Dad?\"</p>\n<p>Derek grabs the box and hefts it like it weighs nothing and isn't full of like 50 pounds of nondescript black and gray shirts.  \"You're smart,\" he says.  Stiles preens, slightly, until, \"You'll think of something.\"</p>\n<p>Stiles does not think of something.  He shows up at home and parks the Jeep and stares at the house for a long time, knowing that Derek is about to arrive at any minute with all of his worldly possessions.  It says something about Derek, really, that everything he owns fits inside a Camaro.</p>\n<p>Things Stiles has thought of to say and immediately discarded:</p>\n<p>1) You'll hardly notice him!  He won't even use the front door!</p>\n<p>2) You know that rabbit problem that Mrs. Frost's been having next door?  I think I have a solution, you'll love him!</p>\n<p>3) You've always wanted a dog! (This is nixed for good on the basis of it being horribly, <em>horribly</em> racist.)</p>\n<p>Stiles rests his forehead against the steering wheel in defeat, doesn't move again until Derek knocks on the window.  Derek gestures at Stiles in a <em>hurry up, asshole</em> kind of way and Stiles bangs his head against the steering wheel for good luck, unlocks the car door and gets out.</p>\n<p>What Stiles did think of on the way over was a fairly terrible plan that's probably going to lead to Derek getting shot.</p>\n<p>\"My dad is probably going to shoot you,\" Stiles says.</p>\n<p>\"It'll be fine,\" Derek says. \"I've had worse.\"</p>\n<p>Stiles can absolutely verify that.</p>\n<p>\"Maybe he's not home?\" Stiles says, aware he sounds whiney and pathetic.</p>\n<p>Derek says, \"He's home,\" and refuses to elaborate on that.  It didn't occur to Stiles when they did their little death-do-us-part blood pact in the woods, that he was signing himself up for an <em>eternity of vague</em>.  <em>Awesome</em>.</p>\n<p>Stiles steels himself, turns towards the house.  Maybe if he distracts his dad with his new, horrifyingly large tattoo, his dad won't notice Derek living with them.  Derek's pretty quiet.  And it's a really big tattoo.</p>\n<p>Stiles is a little jealous, for a moment, of other teenagers who only have to confess to their parents that they've gotten busted with pot or pregnant.  Those problems sound nice, easy to explain.</p>\n<p>Derek growls, \"Move.\"</p>\n<p>Times like these, Stiles really wishes Derek possessed the capacity to look non-threatening, but it's too late for that.  And it's too late for the element of surprise -- the door to the house opens from the inside and there's Stiles' dad, leaning against the doorjamb, one hand casually resting on the heel of his gun.  Great.</p>\n<p>\"Mr. Hale,\" he says in his full-on <em>tell me why I shouldn't shoot you</em> voice.  \"To what do I owe the pleasure?\"</p>\n<p>Derek nods, stiffly, says, \"Sheriff.\"</p>\n<p>Stiles feels unnervingly like he's trapped in an old western.</p>\n<p>\"Whoa there, Dad!\" Stiles says, aiming for casual, missing by miles.  \"Don't shoot him, you'll just make him mad.\"  Which a) is true, and b) his dad loves Blazing Saddles.  Gotta work!</p>\n<p>True to form, his dad relaxes slightly, moves his hand off (but not away from) his sidearm.  Victory!</p>\n<p>Stiles looks hopefully between his dad and Derek, but even when he's trying not to, Derek still looks like a sociopath.  It's obvious that gaining his dad's trust on this one is going to be an uphill battle.</p>\n<p>\"Can we go inside?\" Stiles asks, and it's pretty obvious that this is going to go badly if Stiles has to negotiate entry into his own house.</p>\n<p>Stiles' dad steps to the side with an after-you gesture, but he gives Derek his best <em>I'm watching you and I'm armed</em> glare the whole way inside.</p>\n<p>\"Who wants pizza rolls?\" Stiles asks in a futile attempt to dispel some of the tension.  \"Everyone?  Great!\"  He kills like five minutes screwing around with the microwave as his Dad and Derek glare at each other with suspicion from opposite corners of the kitchen.</p>\n<p>\"Stiles?\" his dad asks, \"You want to let me in on what's going on here?\"</p>\n<p>Stiles sighs. \"I really, really don't, no.\"  Both Derek and his dad give him matching looks of disapproval and oh, that would be hilarious <em>any other time</em>.  \"But since that's not an option, you should probably sit down.  Both of you.  Yes you, you're less creepy when you're not lurking in shadows like that, jeeze, have a pizza roll.\"</p>\n<p>Everything Stiles needs to tell his dad starts with the one thing he really didn't ever want to have to say out loud, but. Ok.  Here goes.  \"Dad, werewolves are real.\"</p>\n<p>\"No they're not.\"</p>\n<p>Derek says, \"Yes they are.\"  And then he stands up and wolfs out in Stiles' dining room.  Stiles wishes there was a less obvious and dramatic way to do this part, but.  <em>Werewolves</em>.  You really do need to see it to believe it.</p>\n<p>Right, so Stiles' dad actually jumps up and pulls his gun out! in the house! over pizza rolls!</p>\n<p>\"Whoa!\" Stiles says, and steps in front of Derek, between him and <em>Stiles' dad's gun</em>.  Except, of course, dumb move!  Derek's crazy must-protect-Stiles instinct kicks in and he grabs Stiles and puts <em>himself</em> in front of Stiles' dad instead.  Great! That's just the <em>opposite</em> of what Stiles wants.</p>\n<p>Derek snarls.  <em>That's regrettable</em>.</p>\n<p>\"Dad!  Dad!  Calm down!\" Stiles squeaks, \"He's just trying to protect me!\"</p>\n<p>Stiles' dad looks super unconvinced, but he gives Stiles the <em>Are you sure about this?</em> look in spite of it.  At Stiles' vehement head nodding, he finally lowers his gun.</p>\n<p>Stiles jabs Derek in the back, says, \"You, too.\"</p>\n<p>Derek takes a few audible breaths and then the claws and fangs are gone and the situation is back to something vaguely resembling normal.  Well, normal for Stiles, so probably closer to <em>batshit crazy</em> for the average bear.</p>\n<p>Stiles' dad says, \"So. Werewolves.\"</p>\n<p>\"Yep.\"</p>\n<p>\"The animal attacks last year?\" Figures he'd put that together this quickly.</p>\n<p>\"<em>Not Derek!</em>\" Stiles yelps, because they don't need to go down that path a <em>third</em> time. \"But yeah.\"</p>\n<p>\"Matt Daehler?\"</p>\n<p>Stiles sighs, says, \"No, no, that was something called a kanima, it was totally different.  I feel like we're getting off track here.\"</p>\n<p>\"Well, ok.\" Stiles' dad sits down.  Actually eats a pizza roll.  The room is oddly quite for a few minutes.  Stiles thinks he owes his dad that.  \"Now tell me the bad news,\" Stiles' dad says.  Stiles freezes.  \"I know you wouldn't just tell me that for no damn reason, Stiles.  Something else is going on, so spill.\"</p>\n<p>Stiles is bad at serious.  Flippant he's got nailed, but being glib about this when it affects his <em>dad</em>, really his whole <em>life</em>…  \"Last week when I was missing -- I wasn't exactly kidnapped, Dad.  We were hiding out from people that were trying to kill us.  Assholes that hunt people like Derek for <em>fun</em>.  Like it's a <em>sport</em>.\"  Stiles knows he sounds worked up, but just thinking about those hunters, remembering the smell of their breath, it turns his stomach.</p>\n<p>He must be freaking out more than he realizes because Derek reaches out and touches the back of Stiles' neck to calm him down.  It works, Stiles gets that Xanax feeling again.  (He's figured out by now that it's just another strange side-effect of it all, like his half-Betazoid powers and werewolf GPS and heightened ability to tell that they really, really need to take out the trash.)</p>\n<p>Stiles' dad, of course, notices Derek <em>touching Stiles</em> and immediately draws the obvious, but wrong conclusion.</p>\n<p>He says, \"When you say <em>we</em>-\"</p>\n<p>\"Oh Jesus,\" Stiles says.  \"No.  Wow, no, that would be <em>easier</em> to explain!  <em>We're</em> not…  Uh.  It's not like that.\"</p>\n<p>\"If it's not like that,\" Stiles' dad says, \"What <em>is</em> it like?\"</p>\n<p>\"Dad.  You need to know that Derek did what he had to do to <em>save my life</em>.\"</p>\n<p>Stiles' dad says, <em>\"What did he do?\"</em></p>\n<p>Derek says, \"I claimed Stiles as my mate.\"  Just like that.  Stiles is still amazed at his ability to <em>say</em> these kinds of things.  They were gonna be here <em>hours</em> before Stiles got around to that part, the way he was going.</p>\n<p>Stiles' dad looks blank.  \"What does that mean?  I know what it <em>sounds like</em>, but I don't want to make any assumptions.  So tell me, what does that <em>mean?</em>\"</p>\n<p>Good question.  Stiles looks helplessly to Derek.</p>\n<p>Derek says, \"I don't know of a good way to explain it to humans.\"  Awesome.  \"I marked your son as part of my family, as part of me.\"  Derek looks a little helpless.  \"I don't know how else to say it.\"</p>\n<p>Stiles <em>gets</em> that.  He really does.  Stiles grandfather was born in Poland and his English was never really stellar and sometimes he'd try to say something to Stiles and it wouldn't translate because there wasn't a word for it in English.  Words like <em>zalatwic</em>.  He'd talk around it and then give up and Stiles would get the impression he was never going to completely understand what his grandfather had really been trying to say.</p>\n<p>Derek says, \"I need to keep him safe.\"</p>\n<p>Stiles' dad, says, \"Well we have that in common.\"  He slumps a little, pinching the bridge of his nose.  \"Don't expect him to make it easy.\"</p>\n<p>\"Hey!\" Stiles would take more offense at that if it was… less accurate.</p>\n<p>\"Is that everything?\" Stiles' dad asks and oh man does Stiles wish he could say yes.</p>\n<p>Turns out that Stiles' dad can deal with Derek moving in, but he's <em>pissed as hell</em> about the tattoo.  <em>Figures</em>.</p>\n<p>They technically have a guest room.  It used to be the master bedroom, but Stiles' dad hasn't been able to go in there since…  Just the sight of the quilt on the bed makes Stiles hurt all over.  So.  Yeah.</p>\n<p>\"You could stay in here,\" Stiles says and he points at the closed door, but he doesn't move to open it.  Derek continues down the hall to Stiles' room like Stiles hasn't spoken.</p>\n<p>Close.  Derek meant, uh, <em>close</em>.  Apparently.</p>\n<p>\"Oh my God,\" Stiles screeches, \"It's been like <em>three days</em>, how is this happening <em>again?</em>  You'd think we'd have learned some kind of important lesson by now about leaving well enough alone.\"</p>\n<p>Derek growls, \"It's an occupational hazard.\"</p>\n<p>There's Something In The Woods, <em>again!,</em> but this time it's very <em>slightly</em> mauling the deer and local sportsmen.  Derek won't say what <em>it is</em> but he had Stiles pack cold iron and a satchel full of dried herbs like he knew what he was asking for.</p>\n<p>Stiles isn't completely sure what they're doing here.  This thing hasn't <em>actually</em> threatened Derek yet, but Derek has a whole Spider-Man kind of <em>with great big teeth comes great responsibility</em> complex about his territory and Stiles apparently has a complex about <em>not letting Derek die in the </em>woods.  So.  There you go.  At least this time they brought the step-kids as back-up.</p>\n<p>Boyd says, \"Three days sounds like a long time for you to <em>not</em> be in mortal peril.\"</p>\n<p>Stiles tries glaring on for size.  \"Feel free to stop having a point any time now.\"</p>\n<p>He's pretty grateful he missed the part where Derek got together his little trio of emotionally damaged werewolf delinquents and told them all that they were going to be getting a new mommy.  Mostly because he can pretend that that's <em>exactly</em> how Derek told them, though he probably just said, \"I claimed Stiles as my mate, do you have a problem with that?\" and glared.</p>\n<p>Stiles had thought maybe it would be awkward at school after, but when he saw them they hadn't treated him any different.  Isaac had laid off him a little during lacrosse practice and that was it.  It's not like their lives weren't already weird enough that it was a <em>significant event</em>, he guessed.</p>\n<p>\"Isaac, Boyd,\" Derek says, pointing, \"On me.  Erica, stay here and watch Stiles.\"</p>\n<p>What?  Ok, that is a completely new and bizarre plan right there.  Why waste super-strength on killing the bad guy when you can dispatch a werewolf to <em>babysit</em>?</p>\n<p>Stiles, unable to really stop himself, says, \"No way-\"</p>\n<p>\"Do. Not. Argue.\" Derek says in his <em>alpha voice</em>.  Whoa.</p>\n<p>Erica, who'd been visibly itching for a fight when she arrived, deflates.  She looks at Stiles, their eyes meet and Stiles can see the matching look of confusion on her face.  She mouths, <em>Seriously?</em> and Stiles shrugs, hands up.</p>\n<p>\"If we're not back in two hours,\" Derek says, \"Move out of California.\"</p>\n<p>And then they're gone, leaving Stiles alone with Erica on the edge of the preserve.</p>\n<p>\"So,\" Stiles says.  \"It has come to this.\"</p>\n<p>Erica rolls her eyes.</p>\n<p>Derek and Isaac and Boyd come back one hour and fifty-five minutes later, smiling and laughing and shoving each other.</p>\n<p>Erica pops up and rummages through a duffle bag in the back of her car, coming up with a still-in-the-packaging basic undershirt and handing it over to Boyd, whose white polo looks like a bloody Rorschach print.</p>\n<p>Isaac says, \"Mission successful,\" and beams at Stiles.  He looks so hungry for approval that Stiles shoves down hard on the urge to ruffle his hair, but then thinks <em>eff it</em>, and does it anyway.  Stiles regrets <em>nothing</em>.</p>\n<p>Boyd claws the shirt he's wearing off and hands it to Erica who seriously has produced a biohazard bag from her car.  The whole thing has the boring, practiced rhythm of a routine.</p>\n<p>\"Next time I can take Stilinski duty,\" Boyd says.  His tone suggests that hanging out with Stiles would be a <em>terrible burden</em> that he's willing to shoulder, while anyone with an ounce of common sense would rather be following dangerous things through the woods.</p>\n<p>Everybody, including Stiles, whips their heads around and stares at Erica when she all but shouts, \"<em>Screw that.  </em>I call dibs.\"</p>\n<p>That's… flattering?  What?  He didn't think they'd been setting the night on fire or anything out here.</p>\n<p>Really, they'd spent the first 10 minutes or so staring at each other blankly, Erica asking, \"Is Derek dead yet?\" and Stiles saying, \"Nope,\" at regular intervals.  At some point Stiles had broken down and said, \"Hey, we've got that Econ test this week, help me make flashcards?\" and Erica had said, \"Oh my God I <em>forgot</em> about that.  Being a werewolf is like, the world's most attention-sucking extra-curricular.\"</p>\n<p>So Stiles and Erica had acted out supply and demand scenarios and it had actually been kind of… nice?  Relaxing.  There weren't a lot of distractions out here in the middle of nowhere and since half of Stiles brainpower was taken up analyzing the background noise of Derek <em>stalking and killing something</em> what he had left over was actually able to focus, for once.</p>\n<p>Boyd asks, \"You <em>want</em> to babysit Stiles next time?\"</p>\n<p>\"What of it?\" Erica says.  She gets up in Boyd's face until he backs off looking at her like, <em>Have it your way, you psycho</em>.</p>\n<p>Erica grabs Stiles arm possessively, says, \"I <em>finally</em> understand elasticity.\"</p>\n<p>Derek growls, pulls Stiles out of Erica's grasp.  Stiles is simultaneously touched and freaked out that Derek's pack is yanking him back and forth like a chew toy.</p>\n<p>\"How often do you expect there to <em>be</em> Stiles duty?\"  Stiles asks.  Derek glares.  \"Can we talk about how uncomfortable I am with you deciding these kinds of things without me?\"</p>\n<p>\"Um,\" Isaac says, \"Could I watch Stiles sometime?  I'm still failing Chemistry.\"</p>\n<p>Stiles squeaks, \"No really, is this going to be a <em>regular thing?</em>  How often do you guys get together and kill things in the woods?\"</p>\n<p>All the werewolves glare at each other, ignoring Stiles in favor of having a supernatural staring contest.</p>\n<p>\"Fine,\" Erica says, shoulders slumping slightly, \"We'll switch off.\"</p>\n<p>Scott is over for a full ten minutes, sitting on Stiles' bed and looking confused, before Stiles gets around to saying, \"So Derek lives here now.  He moved in.  Derek moved in two weeks ago.  It's weird.\"</p>\n<p>Scott releases this heavy sigh, like he's been holding his breath since he walked into the room.  Stiles wastes a second wondering why he would do that before realizing.</p>\n<p>\"Oh my God does it smell that bad in here?\" Stiles asks, horrified.  He can totally smell things better now, yeah, but not werewolf-good.  As far as he knows his room now smells to Scott like Derek peed on everything, Stiles really would not put it past him.</p>\n<p>Scott winces, says, \"Not <em>bad</em>.  Just like maybe you needed to tell me something?\"</p>\n<p>Oh my God, how is Scott <em>this dumb?</em></p>\n<p>\"Tell you something?  Something like I'm <em>sleeping with Derek</em> and didn't bother to mention it?\" Stiles asks and seriously?  Seriously, this is how Scott's brain works.  \"It's mind-blowing that you think something like that would just <em>slip my mind</em>.  Or that I wouldn't tell you!\"</p>\n<p>Scott gives him that <em>please-stop-being-mad-at-me</em> grin that… sadly always works on Stiles.</p>\n<p>Stiles says, \"If I ever start <em>having sex with Derek</em> I promise you will be the first to know.  After me.  And Derek.  Jesus!\"</p>\n<p>Scott nods and smiles and watches as Stiles methodically dumps out the contents of his dresser drawers, making room for Derek's <em>surprisingly large</em> wardrobe.  He'd assumed Derek didn't have a lot of stuff because Derek lived in a burned-out husk of a house that did not seem to possess <em>closets</em> but no.  Derek has more clothes than Stiles does, and he looks really pathetic living out of cardboard boxes.</p>\n<p>\"So how does the whole thing with Derek like… work,\" Scott asks.</p>\n<p>It's really only been a couple of weeks of Stiles and his dad adjusting to living with a werewolf, Derek adjusting to living around other people like a normal, reasonable human being.</p>\n<p>Stiles came home yesterday to Derek sitting on the couch, watching Jeopardy! and shouting out the answers in the form of a question.  Stiles had walked back outside and checked the address to make sure he was in the right house.</p>\n<p>But actually -- actually what's weird is now not-weird it is.</p>\n<p>So far, everything's been pretty much the same except for how Derek keeps smelling him and looking at him and insisting he has to hide behind trees when things get dangerous.  Which, ok, when Stiles thinks about it, he used to do that anyway.</p>\n<p>Stiles says, \"I don't think we've really figured that out yet.\"</p>\n<p>Scott nods, sage.  It's not a very believable look on him.</p>\n<p>\"So if you're really not… um.   Can you like,\" Scott says, \"Date other people?\"</p>\n<p>Stiles hasn't actually thought about it.  The possibility that he would ever actually meet someone who <em>wanted</em> to date him had always seemed so remote.  And he's been too busy freaking out about Derek sleeping in his bedroom and eying Stiles' dad warily over the kitchen table during family meals to think about, like, his future.  Their future.</p>\n<p>\"I, uh,\" Stiles says.  \"I really don't know.\"</p>\n<p>\"From what I understand,\" Scott starts, and that's never ever never a good beginning to sentences in Stiles experience, \"I think Derek is like...  I mean, like, you're it, man.  For him.  But I don't think it works that way on humans.\"</p>\n<p>\"When would I even have the opportunity?\" Stiles says. \"It doesn't matter.\"</p>\n<p>Because really, he'd resigned himself to an eternity of loneliness a long time ago.</p>\n<p>Scott looks around the room in the least subtle way possible.</p>\n<p>\"So, where exactly does Derek sleep?\" Scott asks, because Scott apparently <em>hates him</em>.</p>\n<p>\"Uh,\" Stiles says.</p>\n<p>It's just that while Derek <em>had </em>been spending the night on the floor he'd looked so sad and pathetic in Stiles' ancient green plastic Coleman sleeping bag that Stiles had…  Whatever,  it started off being weird but Stiles sleeps <em>really great</em> now, damn it.</p>\n<p>Stiles says, \"I don't want to talk about it.\"</p>\n<p>Scott winces in sympathy.</p>\n<p>He keeps thinking about it.</p>\n<p>\"Scott says I'm <em>it</em> for you,\" Stiles says. \"Doesn't that bother you?\"</p>\n<p>Derek says, \"Not really, no.\"</p>\n<p>\"You cannot mean that,\" Stiles says, gaping.</p>\n<p>Derek looks up at Stiles, his hands carefully, methodically chopping celery.  Derek looks at him like he's asking, <em>Why can't I mean that?</em>  He's even serious about it.</p>\n<p>\"What if you meet someone and they're like, the most awesome ever and you want to marry them and have their puppies?\"  Derek raises an eyebrow.  \"I take back the word puppies.\"  Derek pushes the finely diced celery off the cutting board into a bowl, moves on to the carrots.</p>\n<p>\"If I'd had a choice,\" Derek says, finally.  \"I wouldn't have dragged you into this.  But meeting someone else and <em>having puppies </em>wasn't in the cards.\"</p>\n<p>\"What?\" Stiles squawks.  He stops stirring the pancetta he's frying and stares until something in the pan pops and sprays his hand with hot pork grease.  \"Ow.  But no, I mean, <em>what?</em>\"</p>\n<p>Derek won't turn around, won't look at Stiles, chopping onions now with single-minded determination.  When he's finished, he hands off to Stiles a bowl of the most perfect, evenly diced vegetables Stiles has ever seen.</p>\n<p>\"Holy crap,\" he says, \"These are like… I want to take pictures of these and put them on the internet.\"</p>\n<p>Derek kind of half-smiles and stays close for a minute, watching as Stiles dumps the contents of the bowl into the pan.  After what feels like an eternity of stirring and strange silence, Derek says, \"After what happened to my family, I didn't want to put myself in that position again.\"</p>\n<p>Stiles looks at him, horrified.  <em>Didn't, </em>past tense.  Too late now.</p>\n<p>Derek says, \"I also wanted to live past 23.\" </p>\n<p>Stiles shuts his mouth with an audible click, turns back to the stove.</p>\n<p>The soup turns out great.  Better than usual.</p>\n<p>Stiles didn't anticipate how much being wolf-married meant that Derek got to share Stiles' family (see: Monday Night Football/Taco Night with Sheriff Stilinski) -- but he also didn't think about how it meant Stiles' life would now regularly include Crazy Uncle<em>-in-law</em> Peter.  Derek easily, easily got the better half of that deal.</p>\n<p>\"Peter's here.\" Derek says, easing the Camaro up the driveway to the Hale House.  \"Don't mention the part where you set him on fire.\"</p>\n<p>\"<em>That</em> is how you get through seeing him?  By ignoring all the murder?!\"</p>\n<p>Derek grimaces.  Says, \"Yeah.\"</p>\n<p>There is nothing Stiles can really say to that.  Peter's the only family Derek has left (<em>thanks to Peter</em>, how messed up is that?) and Stiles… is just gonna have to suck up and deal.  He just wishes Peter wasn't so frickin' creepy <em>all the time</em>.</p>\n<p>Peter's waiting for them on the porch for no discernible reason.  As he approaches, he bares his teeth, says, \"Welcome to the family.\"</p>\n<p>Just talking to him makes Stiles feel just… gross.  Unclean.</p>\n<p>\"Yeah,\" Stiles says, \"Uh, thanks.\"</p>\n<p>Peter says, \"You didn't invite me to the ceremony.  I'm hurt.\"</p>\n<p>Derek growls and shoves past Peter into the house and Stiles follows because… right, they were here for a reason?  He's sure they were.  A reason besides getting like, leered at by the undead.</p>\n<p>Derek goes straight upstairs for the book Stiles wanted (right! a book! that's why they were here!) and Stiles hangs back… with Peter.</p>\n<p>\"If I'd known, I would never have offered,\" Peter says and he sounds genuinely apologetic.</p>\n<p>\"What the hell,\" Stiles says, \"Jesus would you stop breathing on me like that?\"</p>\n<p>Peter backs off very, very slightly.  Were all the Hales raised wrong?  Did no one learn about personal space?</p>\n<p>Stiles wants to say, <em>Remember that time we all got together and killed you?  That was fun, let's do it again sometime!</em>  But he promised he wouldn't.  Suck.</p>\n<p>Derek comes back downstairs and goes a little berserk, grabbing Peter and pulling him away from Stiles, shoving his huge frame between them.  Stiles would be more freaked out by the caveman behavior if it wasn't pretty much exactly what Stiles wanted him to do.</p>\n<p>Derek says, \"We're leaving.\"  He doesn't let Peter near Stiles again.</p>\n<p>As they get to the car again Peter calls out, \"I'm sure you'll be very happy together!\"</p>\n<p>Derek winces.</p>\n<p>When they're back home and Stiles is buried in the section of the book covering different types of wolfsbane, Derek says, \"I'm sorry.\"  He's so quiet Stiles almost misses it.</p>\n<p>Stiles really doesn't know what he's talking about, asks, \"For what?\"</p>\n<p>The book says wolfsbane is just as potent dried as fresh, so there's no reason they couldn't just keep like a storage locker with every kind they can find, just for emergencies.  They shouldn't have to rob hunters every time things go south.  Maybe he can talk Chris Argent into hooking up Stiles with his supplier.</p>\n<p>Derek hasn't said anything for long enough that Stiles looks up at him.  \"What's up, big guy?\"</p>\n<p>\"For Peter,\" Derek says.  \"I'm know you're afraid of him.\"</p>\n<p>Stiles says, \"In my defense, there's a lot there to be afraid <em>of</em>.\"  He shudders.  \"But why are you apologizing?  Did you know he was going to be there?\"</p>\n<p>\"No.\"</p>\n<p>\"So it's all good.\"  Derek still looks conflicted.  Well, more than usual.  \"You aren't responsible for him.  You can't pick your family.  I know, man, not all Stilinksis are worthy of the name.  Wait until you meet my Aunt Gayle.  If you think <em>I'm</em> racist…\"</p>\n<p>Stiles gently kicks Derek's ankle, because sometimes that snaps him out of it when he gets like this.</p>\n<p>\"Hey,\" Stiles asks, \"Can you think of a downside to say, owning a shed full of wolfsbane?\"</p>\n<p>Whoever said bad moods were contagious doesn't know the <em>half of it. </em> Derek apparently woke up on the wrong side of (sigh) Stiles this morning and he's been pissy <em>all day</em>.  It's been making <em>Stiles</em> more and more short tempered until he finally snaps and yells at <em>Danny</em> of all people.  Danny.</p>\n<p>\"So you… don't want to do the write-up,\" Danny says, hands up, backing away from Stiles slowly.  Oh crap.</p>\n<p>\"No, no, I can do it, it's fine,\" Stiles says.  What Stiles <em>wants </em>is for Derek to get a massage, do some yoga, drink some herbal tea, and stop bleeding second-hand stress all over Stiles.  \"I'm sorry, I'm just going through some stuff.  It's fine.\"  He doesn't say what he wants to say, because what he wants to say is, <em>Sorry I'm being such an ass, it's just that the asshole werewolf I'm emotionally tethered to is having </em>issues<em> today</em>.</p>\n<p>Danny pats Stiles awkwardly on the shoulder and says, \"Just get it done by Tuesday?\"</p>\n<p>Stiles nods, dumps his backpack into his locker and unthinkingly pulls his shirt off to change into his useless-for-bench-sitting pads and jersey.</p>\n<p>Danny wolf-whistles, says, \"I didn't think you were an ink kind of guy, Stilinski.\"</p>\n<p><em>What?</em>  Stiles is momentarily confused and then.  <em>Oh crap</em>.</p>\n<p>\"What is it?\" Danny asks, like it's not obviously someone's hand.  A guy's hand.  Not Stiles' hand.  (Getting a tattoo of his own hand-print would be beyond weird and pathetic, now that he thinks about it.  Like getting your own initials.  People do that.  Sad, dumb people.)</p>\n<p>Stiles says, \"Uh, it's personal.  I don't want to talk about it.\"  Not a lie, not really.</p>\n<p>\"That's cool,\" Danny says, \"Can I touch it?\"</p>\n<p>His hand moves towards Stiles back and Stiles involuntarily freaks out a little bit, shouts, \"<em>No!</em>\"</p>\n<p>Danny has a specific <em>look</em> for when Stiles crosses the line from behavior that's a little odd to full-on Weird Shit mode.  This is that look.</p>\n<p>Stiles says, \"Right, um, yeah.  It's just really, yeah.  Personal.  Symbolic.  There's a lot of… personal symbolism there.\"</p>\n<p>He quickly pulls on a shirt and turns so he's got his back to his locker, crisis totally averted! nothing to see here!  But when he looks out he doesn't just see Danny looking confused, he sees Scott, Isaac, and Jackson nearby tensed up.  Uh.</p>\n<p>Danny says, \"Tuesday.\"  He backs away and the nearby supernatural beings relax, casually go on about their business.</p>\n<p>Right.  Um.  What?</p>\n<p>Scott plunks down next to Stiles before practice starts, picks at his net like nothing <em>completely weird</em> just happened.</p>\n<p>Stiles says, \"So, about what happened just now?\"</p>\n<p>\"What?\" Scott asks, and Stiles just sort of looks at him a while because, right, obviously <em>Stiles</em> is the crazy person here.</p>\n<p>\"Um, when you guys all looked like you were gonna, you know, <em>claw Danny to death for touching me?</em>\"</p>\n<p>\"Oh, that,\" Scott says, \"I don't know man, but it was like when Peter was mackin' on my mom.  It felt all wrong and messed up.\"  Scott shrugs.</p>\n<p>\"This is gonna be a werewolf thing I never really understand, isn't it.\"  Scott shrugs again.  <em>Useless</em>.</p>\n<p>Finstock calls the valuable people off the bench and Stiles spots Derek, loitering at the edge of the woods.</p>\n<p>Stiles mutters to himself, \"Yeah, that's not creepy.\" </p>\n<p>Stiles attempts to do homework, but the dumbed-down, oddly bloodless account of the French Revolution in his textbook resoundingly fails to hold his attention.</p>\n<p>Eff it.</p>\n<p>\"What the hell is your deal today?\" He asks, hissing quietly, under his breath.  \"Your epic, hours-long shitfit made me yell at Danny.  <em>Danny</em>.\"</p>\n<p>Stiles glances up long enough to catch Derek's scowl.</p>\n<p>\"Yeah,\" Stiles says.  \"That.  That right there.\"  He almost stabs his pen through his worksheet.  \"You're not an island, dude, not anymore.  I can't be <em>losing it</em> in public and airing our dirty laundry in front of innocent, Danny-shaped bystanders whenever you're,\" Stiles kind of makes a gesture he hopes construes the whole Angry Caveman Derek situation.  \"So whatever it is?  I need you to deal with it.  Ok?\"  Stiles looks discretely at Derek. \"Ok?\"</p>\n<p>Derek nods, Stiles closes his eyes in relief, and Derek's gone when he opens them again.</p>\n<p>When Stiles gets home after practice the kitchen smells like chamomile and Stiles finds Derek in the living room watching Nova.</p>\n<p>He doesn't apologize, but he does say, \"Sometimes I forget.\"</p>\n<p>Stiles shoves him over, settles into his side of the couch. </p>\n<p>Derek says, \"I'm trying.\"</p>\n<p>Can't ask for more than that.</p>\n<p>It's not something that Stiles is actively thinking about, has been thinking about at all, so it's a surprise even to him when he asks, \"Why did Peter say, <em>If I'd known, I wouldn't have offered</em>?\"</p>\n<p>Derek says, \"Aren't you supposed to be writing a history paper.\"</p>\n<p>Stiles has 300 words on the Napoleonic Code and its influence on Louisiana's legal system open on his laptop, but he's mostly been staring at a line about communal property for the last 15 minutes.  And thinking about his creepy in-laws apparently.</p>\n<p>\"It's a weird thing to say, though.\"  Not that Peter says <em>normal</em> stuff very often.  \"If he'd known what?\"</p>\n<p>Derek says, \"He wouldn't have offered you The Bite if he'd known I had prior claim.\"  Derek looks uncomfortable.  \"It's considered encroaching on another wolf's territory.  It's frowned upon.\"</p>\n<p>\"What, was he supposed to ask permission first?  Oh my God, that's totally it, he was supposed to ask you for permission first.\" </p>\n<p>Derek nods.</p>\n<p>\"I'm not sure I like being considered territory.  No, wait, I'm <em>sure</em> I don't like it.\"  It's not like he doesn't know that he has <em>Property of Derek Hale</em> literally tattooed on his back, he just does not appreciate that he's been cast in the role of some sort of Regency heroine.  Werewolf society is totally <em>backwards</em> and <em>stupid </em>and <em>inegalitarian</em>.</p>\n<p>Stiles pauses, thinks.  \"So if even <em>offering</em> me the bite is like, mortally insulting, that totally means… <em>crap</em>.\"  Stiles throws his hands up in frustration.  \"I want to point out how colossally unfair it is that in the last year I've been downgraded from Batman to Robin to <em>Jimmy frickin' Olsen</em>.\"</p>\n<p>Derek half-laughs, turns Stiles' chair around until he's facing his laptop again.  \"Shut up, Stiles.\"</p>\n<p>Seriously.  Unfair.</p>\n<p>Stiles is whining about how much he hates trigonometry (it's all memorization, how frickin' pointless is that!) when Scott seriously <em>yells</em>, \"Stop talking about <em>Derek!</em>\"</p>\n<p>Under the impression they'd been discussing <em>math</em>, Stiles feels justified in saying, \"What?\"</p>\n<p>\"You mention him like, at all times.  Can you not hear yourself?\"</p>\n<p>Stiles mentally rewinds and plays back the last few minutes, how he'd said, <em>When am I ever gonna need to know the cosign of the tangent blah blah blah,</em> and Scott had said, <em>Yeah I know,</em> even though he didn't because Scott wasn't in the same math track and wouldn't be taking trig until next year.  (At which point <em>Stiles</em> would get to hear <em>Scott</em> complain about the exact same crap…)  Oh, and then Stiles had said that Derek had told him he never used trig once after high school and that's what computers were for anyway.</p>\n<p>Oh.</p>\n<p>That.</p>\n<p>And when they'd been talking earlier about video games, Stiles had mentioned that <em>Derek was looking forward to the new Assassin's Creed, wasn't that weird?  Who knew he even played video games?  Did werewolf reflexes help on Xbox?</em></p>\n<p>And when they'd been talking about what they wanted to do for lunch Stiles had been all, <em>Hey, did you know Derek went to culinary school?</em>  Because Stiles had wheedled that information out of him after like the 20th time he casually did something impressive while helping Stiles make dinner.</p>\n<p>And it occurs to Stiles suddenly that the phrase <em>Derek said</em> has played heavily into this conversation without him noticing.</p>\n<p>\"Uh,\" Stiles says, dumbfounded.</p>\n<p>Scott puts on his teen angst face and says, \"It's bad enough that you always smell like you just rolled around in him,\" UM WAIT <em>WHAT?</em> \"But now you're always bringing him up, too.  I know he's your… uh, you know… but could you remember that he's also someone that like, ruins my life?  Constantly?\"</p>\n<p>Stiles really kind of wants to point out that Derek's been too busy Chiffonading basil in the Stilinski kitchen to ruin Scott's life <em>recently</em>, but errs for once on the side of tact and keeps his mouth shut.</p>\n<p>Also, Scott is the world's biggest kettle here.  Stiles could tell you things about Allison Argent that only a mother or an overly-invested werewolf boyfriend should know, because even when they're off-again, Scott still <em>never shuts up about her</em>.   In fact, right after Stiles had said, <em>Dude, he went to CIA, that's like a big deal</em>, Scott had said, <em>Allison really likes Top Chef</em>.  So there.</p>\n<p>And Stiles really has no idea what point he just proved to himself, except that apparently Stiles talks about Derek as much as Scott talks about Allison and that is just.  That is something that is really frickin' strange.</p>\n<p>Whatever, Derek <em>lives with him</em>, it's not Stiles' fault that they have conversations and stuff.</p>\n<p>Still, Stiles is capable of being the bigger man here, so even though Scott is total and complete hypocrite, Stiles says, \"For you, buddy?  I'll stop.\"</p>\n<p>Scott says, \"<em>Thanks</em>.  God.\"  And then he says, \"Allison said she'd tutor me in trig next year.\"</p>\n<p><em>Ugh</em>.</p>\n<p>Her name is Jenny, she has dyed red hair, Buddy Holly glasses, and a Dr. Who patch on her messenger bag.  She's drop-dead gorgeous and Stiles' heart stops, a little, when she's introduced in his trig class as the new transfer student.</p>\n<p>Halfway through class when Stiles looks over and sees that she's not paying attention by way of drawing Chutulu in her notebook, he nearly falls out of his chair.</p>\n<p>It's like she was made for Stiles.  Even Jackson says so, though what he says is, \"Don't you dare breed.  We do not need another generation of you.  Please, consider sterilization.  For the good of the planet.\"</p>\n<p>Whatever, he's a jackass.</p>\n<p>Allison invites Jenny over at lunch because Allison can just do things like that, it's one of her magical powers.</p>\n<p>Jenny says, \"Oh my gosh really?  <em>Thank you!</em>\" and trots up to the table.</p>\n<p>Allison says, \"I remember being the new girl - I just started last year.\"</p>\n<p>What Allison <em>isn't</em> mentioning is that if Jenny gets too socially maladjusted around here, Derek's gonna end up offering her The Bite.  It’s like he can't help himself, and Stiles really doesn't need any more step-kids.  Three is enough.</p>\n<p>\"Oh my gosh, thanks,\" Jenny says, \"I've never been outside of Wisconsin before, it's a lot to take in.\"</p>\n<p>Stiles watches the exchange with rapt attention, aware that his mouth is hanging open and he looks like an idiot, but her hair is <em>shiny</em>.  He's never seen that color before.</p>\n<p>Stiles unsubtly shoves Scott and Scott's tray down the table so that there's an open spot next to him and <em>oh my God!</em> Jenny sits down in it.  And turns towards Stiles.  And smiles.  And says, \"Hey, aren't you in my math class?\"</p>\n<p>Stiles says, \"You.  Math.  Lovecraft!\"  Smooth, yes, but her eyes light up anyway and she laughs like Stiles is doing it on purpose.</p>\n<p>Miraculously, Stiles manages to start stringing together real sentences and he and Jenny talk all the way through lunch.  She plays WoW, just moved here from Madison, she calls water fountains <em>bubblers</em>, and she mentions deep fried cheese curds <em>a lot</em>. </p>\n<p>Stiles is mesmerized by her voice -- her flat, nasal vowel sounds and the different, Midwestern cadence to her sentences.</p>\n<p>When the bell rings Jenny says, \"We should do something tomorrow, like you could show me around?  Noonish?\" and Stiles says, \"Yes we absolutely should, that would be fantastic.\"  So Jenny gives Stiles her phone number and Stiles gives her his address and when she gets up to leave it hits Stiles that he has a <em>date </em>with a <em>girl</em>, a real one!</p>\n<p>He spends the rest of the day floating on air until after school when Scott finds him and says, \"There's something weird about Jenny.\"</p>\n<p>\"What? No there isn't.\"</p>\n<p>\"She smells weird.\"</p>\n<p>\"She smells awesome.\"  She <em>does</em>.  Stiles knows that for a <em>fact</em>.  His sense of smell is off the chain these days.  \"You don't know what you're talking about.  Also, you got the last new girl, it's only fair that I get a turn.\"</p>\n<p>Scott looks offended that Stiles would <em>dare</em> compare Jenny to Allison.  Stiles is insulted on Jenny's behalf.</p>\n<p>Scott shakes his head, says, \"Be careful, man.\"</p>\n<p>\"You're one to talk,\" Stiles says.  It's not like Jenny's family's going to turn out to be hunters.  No way that happens twice.  Right? \"I'm in love.\"</p>\n<p>\"No you're not,\" Scott says.</p>\n<p>\"No, I'm not,\" Stiles admits. \"But I could be!  She likes me, you <em>saw</em> her liking me.\"</p>\n<p>\"What about Derek?\" Scott asks.  And winces.</p>\n<p>\"What? He's fine?  He's… wandering in the woods.\"  He does that a lot.  Like, all the time.</p>\n<p>\"Ugh, no, I didn't mean <em>that</em>.\"  Scott looks a little weirded out.  \"I meant is he ok with you, you know, like there being a <em>you and Jenny</em>.  Are you two ok?\"</p>\n<p>Stiles really, almost asks, <em>why wouldn't he be?</em>  But then he remembers (because he actually forgot!) why, exactly, Derek lives at Casa Stilinski.  Why Stiles knows where he <em>is right now.</em>  Why Stiles could tell you that Jenny smells like Rockstar and Pop Tarts.</p>\n<p>\"Uh,\" Stiles says.</p>\n<p>\"You never asked?  You never asked!  How could you not ask?\"  Scott does that almost-hyperventilating-except-werewolves-don't-do-that thing that he does and wow, he's gonna be super dramatic about this apparently.</p>\n<p>Stiles says, \"It didn't come up!\"</p>\n<p>\"He sleeps in your bed!\"  Oh my God, Stiles thought they <em>weren't ever talking about that!</em>  \"How did you not ask?\"</p>\n<p>\"I <em>tried</em> to bring it up!\" Stiles says, and he doesn't know why he sounds defensive.  \"And it hit home pretty hard that I've ruined his life!  Forever!  I wasn't gonna follow that up with - hey, Derek, is it ok if I have a girlfriend seeing as you're like, committed to being alone forever?\"</p>\n<p>\"Well, are <em>you?</em>\"  Scott asks.</p>\n<p>Stiles doesn't follow.  \"Am I what?\"</p>\n<p>Scott asks, \"Committed to being alone forever?\"</p>\n<p>\"No,\" Stiles says, slowly.</p>\n<p>He's not alone.  He'd just also like to make out with someone like, once in his life.</p>\n<p>When Stiles gets home his Jenny-induced euphoria smacks right into the reality of <em>oh-right-you</em>.</p>\n<p>\"You smell like someone new,\" Derek says instead of <em>Hi, welcome home, how was your day, honey?</em> Raised. By. Wolves. Why does Stiles always forget that part?  Why?</p>\n<p>Stiles says, \"Good to see you, too?  Did you have a good time today wandering aimlessly through the woods and/or working out?\"  Stiles doesn't especially care, but <em>someone</em> has to feign politeness in this household.  \"Wow, you did the dishes.  Thank you, thank you so much for that.  That's awesome.\"</p>\n<p>\"Who is she?\" Derek asks, undeterred.</p>\n<p>\"You know what sucks?  When all your friends are werewolves,\" Stiles grumbles.  First Scott, now Derek.  Can no one else see why Stiles expanding his social circle is a good thing?</p>\n<p>Derek stares.  Stiles thinks about not telling him who it is to teach him a lesson, but then Derek stares some more and Stiles caves.  Stiles always, eventually caves, and Derek could out-wait iPhone lines.</p>\n<p>\"There's a new girl at school.  Her name is Jenny and she inexplicably wants to spend time with me.\"</p>\n<p>Derek says, \"I'm sure she has her reasons.\"  That's sweet.  And insulting, probably.</p>\n<p>\"We have a date on Saturday, is that…\"  MAN UP AND ASK, STILINSKI, \"Is that ok?  We never talked about this.\"</p>\n<p>Derek has a lot of <em>feelings</em> about that question, all of them too fast and too intense for Stiles to interpret.  And of course his face gives away absolutely <em>nothing</em>.</p>\n<p>\"It's fine,\" he says.</p>\n<p>It's probably not fine, but Derek's not feeling murderous or betrayed, Stiles would able to <em>tell</em>.  He's… resigned?  Stiles wants to be more concerned, but he has a <em>date</em> with a <em>girl</em>.  This is the greatest thing that's ever happened to him, ever.</p>\n<p>Stiles spends the 20 minutes before Jenny comes over frantically cleaning the house in an attempt to disguise the fact that he lives with a werewolf.  Derek sheds.  Derek sheds on everything.  Stiles has become immune to just how much fur he lives with on a day to day basis but if Jenny comes over and sees it all then she's going to ask to meet Stiles' dog and no.  Just no.  No forever.</p>\n<p>Stiles is smacking the crap out of the side of the pet hair attachment to the vacuum (why doesn't it ever just work?) when he stops.</p>\n<p>What is he <em>doing?</em></p>\n<p>If he can't explain Derek to Jenny now, how would he <em>ever?</em>  Please pay no attention to the intimidating man in the corner?  Do you mind if my incredibly overprotective friend lives with us, honey?  I forgot to mention that I'm already kind of married, but it's not recognized by the state of California so we should be ok?  Now children, I know you want a cat, but I'm afraid Uncle Derek may eat it?</p>\n<p>Logistics aside, wow, what a <em>horrible</em> thing to do to Derek.  Is Stiles really going to build a future with someone and drag Derek along for the ride?  Jesus, Stiles is an <em>asshole</em>.</p>\n<p>And Jenny is great, but… no.  Stiles really doesn't want to be yet another monumentally shitty thing that happens to Derek, he's had <em>plenty</em>.</p>\n<p>Stiles calmly puts away the vacuum cleaner.</p>\n<p>He hears Jenny's car pull up into the driveway, walks outside, and finds her rummaging through the trunk of her POS Chevy Lumina.  Even the trunk of her car is awesome, filled with back issues of She Hulk and Y The Last Man, plus what looks like the tattered remnants of a half-dozen complicated board games.</p>\n<p>\"Hey handsome,\" she says, and smiles when she sees him.  Her T-shirt is covered in Space Invaders and her hair is bright and shiny, almost magenta in the sun.  She's beautiful and perfect and Stiles is going to break up with her because he doesn't want to make Derek Hale sad.  Sadder.</p>\n<p>Stiles is clearly going to die a virgin.</p>\n<p>\"Hey.  Jenny.\" Stiles sounds stilted, even to his own ears.</p>\n<p>\"What's up?\" She asks and she sounds so open and friendly and concerned.  She's like the anti-Derek, really.  Stiles has obviously gone insane from prolonged exposure to the supernatural.</p>\n<p>\"I don't think we should go out.\"  There.  He's said it.  <em>Holy crap, he actually said it!</em></p>\n<p>Jenny looks crushed. Well, score one for Stiles' ego.  \"What?\"</p>\n<p>\"Would you believe me that it's really, really not you?\"  Jenny turns away from Stiles, back to her car trunk.  Stiles thinks she's maybe crying?  \"It's just… my life is more complicated than you realize.\"</p>\n<p>Jenny says, \"No, it isn't.\"  Then she hits him over the head with a tire iron.</p>\n<p>Stiles wakes up with a splitting headache and the suspicion his life has gone very wrong.  Again.</p>\n<p>He's chained, shirtless (why? who was his shirt hurting?) to the wall in what he recognizes from bad decisions gone by as the abandoned chemical plant on the outskirts of town.  Stiles can make out his own terrible attempts at tagging on some of the walls.  Ahhh, his carefree pre-werewolf youth, when his nights had involved teenage rebellion and spray paint instead of subterfuge and crossbows.</p>\n<p>Stiles spots Jenny sitting on top of an old steel vat, picking at her tights and twisting the hem of her skirt.  Well, she doesn't <em>look</em> evil, but she probably is.  Stiles <em>hates his life.</em></p>\n<p>\"How long before he gets here?\" Jenny asks.</p>\n<p>Stiles is gonna address whatever the hell she's talking about in a minute, but he wants to clear something up first.  \"I want you and everyone else in the world to know I <em>officially!</em> broke it off with you before any of this happened!\"</p>\n<p>Jenny looks unimpressed.  \"Fine.  You're a great judge of character,\" she says, and slow claps.  Wow, apparently she's a <em>dick</em>.  \"All that did was make it harder on both of us.  I wouldn't have had to use the tire iron if you'd come willingly like we'd planned.  I packed a picnic, Stiles.  We could have had a nice romantic picnic and I could have romantically roofied you instead.\"  Ok, yeah, that would have been better, he's man enough to admit that. </p>\n<p>\"Now,\" she says, \"Tell me how long before the big bad wolf arrives?\"</p>\n<p>Oh crap, Derek.  Of course, this is a trap for Derek.  Because Stiles is <em>Jimmy Olsen</em>.</p>\n<p>\"I thought you liked me,\" Stiles says, whiney.</p>\n<p>Jenny laughs.  She has an evil laugh.  How did Stiles not notice that before? \"You know what the funny thing is? I do! I totally like you, Stiles, that never happens to me!  I'm kind of thinking about not killing you after I deal with the Alpha, what do you think?\"</p>\n<p>\"Who the hell are you?\" Stiles thinks about his life for a minute.  \"<em>What</em> the hell are you?\"</p>\n<p>Jenny looks at him like he's dumb.  Not fair.  Stiles knows nothing about her except a) she's probably trying to kill Derek (who isn't?) and b) until she hit him with a blunt object Stiles was writing STILES + JENNY 4 EVA all over his notebooks.  After knowing her for most of a day.</p>\n<p>Stiles <em>voluntarily cleaned</em> for her.</p>\n<p>\"Holy crap you're a succubus!\"</p>\n<p>\"And that's why I like you!\" Jenny claps.  \"You're smart!\"</p>\n<p>Stiles is flattered, really.</p>\n<p>\"What do you want with Derek?\"</p>\n<p>Jenny ignores him.  \"You're the first guy who's ever broken up with me.  Ever.  But I think we can work past that.\"</p>\n<p>\"No, we can't, because you eat people.\"</p>\n<p>Jenny smiles with too many teeth to be human.  \"And wolves, too.  The bigger the better.\"</p>\n<p>Stiles had been holding out mild hope that her plan was…. something other than that.  But no, predictable! Stiles' life is horribly, strangely predictable.</p>\n<p>A scary-ass succubus apparently has a thing for Stiles and any minute now an alpha werewolf is gonna bust in here and fight her for him.  Stiles' Saturday has become a horrible, horrifying version of Twilight -- but, in this scenario? he is <em>firmly on team Jacob</em>.</p>\n<p>\"Baby, don't look so sad.  No one killed your puppy.  Yet.\"</p>\n<p>Stiles growls, lunging forward against the chains, getting nothing but choked for his troubles.  He can feel that Derek's moving closer and closer, pace breakneck and unrelenting.  All Stiles wants is for him to stop, turn around, stay away, but Stiles knows from personal experience that Derek has always been 100% dumb where Stiles' safety is involved.  And that… <em>huh</em>.</p>\n<p>Stiles says, when he gets his breath back, \"Don't you touch him.\" It's neither useful nor original, but it's heartfelt.</p>\n<p>Jenny rolls her eyes.  \"I think we really have something together, Stiles.  Once we've fixed your little canine problem, you should come with me.  See the world.\"</p>\n<p>\"Kill half of it?\"</p>\n<p>Jenny grins, predatory.  \"Sounds right.\"</p>\n<p>Stiles shakes his head.  \"You are crazy and I do not like you.\"</p>\n<p>Jenny hums <em>We Can Work It Out</em> and drums her heels against the side of the vat, impatiently.</p>\n<p>All at once Stiles can feel Derek right outside, his presence an electric live wire against the back of Stiles' neck.  Thank God, though, he's waiting -- not immediately barging in guns (or claws) a-blazin'.  Maybe, just maybe, that means he actually has a plan.</p>\n<p>Then the door comes crashing in, kicked off its hinges, and it's pretty obvious, pretty quickly that he doesn't.</p>\n<p>Derek is in full-on wolf mode, huge, the stuff of nightmares, and he looks <em>mad</em>.  Jenny quickly hops off the vat she's perched on and then she's just not there anymore.  In her place is a horrifying-looking thing with an open, gaping ring of teeth where Jenny's mouth used to be.</p>\n<p>Stiles is absolutely not going anywhere with that.  Ever.</p>\n<p>Derek slams into her/it at full speed and Stiles expects it/her to go flying except she/it has like <em>four inch claws</em> sunk into Derek's hide.</p>\n<p>The fighting is brutal, tooth-and-nail, <em>vicious</em>.  Stiles can't watch, but he can't do anything else so he doesn't look away either.  Not having a lot of experience with succubus vs. werewolf fights, Stiles can't tell who's winning at all until he hears a wet, crunching, <em>viscerally awful</em> sound and he sees Derek spitting out Jenny's limp body onto the floor.</p>\n<p>It's really not helpful to keep thinking of the succubus as <em>Jenny</em> -- she was never real, the mangled creature on the ground looks nothing like a 17-year-old redhead from Wisconsin, but Stiles can't help it.</p>\n<p>Derek stands and shifts back to human, satisfied that Jenny's really most sincerely dead, and advances toward Stiles, still chained up in the corner.  Derek meets his eyes and Stiles can <em>feel</em> his anger, panic, fear.</p>\n<p>Stiles says, \"Derek, I'm sorry, I'm so so sorry.\"  Derek kind of growls, continues stalking towards Stiles --  naked and covered in greenish blood.   \"Hey,\" Stiles says, \"I'm ok.  See?  Ok!\"  It's obvious that Stiles isn't getting through on this level, but he keeps talking in what he <em>thinks</em> is a soothing tone until Derek gets to him.</p>\n<p>The relief that washes through them both when Derek finally reaches out and grabs Stiles' arm (and  Derek starts to process that he's real, here, unhurt) is palpable, makes Stiles' knees go weak and his whole body starts trembling uncontrollably.  Since he's shirtless (because, of course, <em>supervillians</em>), with the adrenaline wearing off he's now also freezing cold.</p>\n<p>Derek keeps touching him roughly, checking for injuries, and when his hand brushes over the handprint on Stiles' back he sets off an emotional <em>trip-wire</em>.  All at once Stiles has <em>full access</em> to everything Derek and the inside of Derek's head is a <em>mess.</em></p>\n<p>\"Jesus,\" Stiles whispers and he opens his eyes (when did he close them?) and Derek is <em>right there</em> and without conscious thought Stiles leans forward and Derek catches him and then they're kissing -- full-out, movie-ending, <em>epic</em> making out.  Derek has one hand on Stiles' shoulder to keep him from falling over, but the other is still pressed into the mark and Stiles can <em>feel it</em> in these constant little electric shocks of sensation. </p>\n<p>Things are <em>bright</em> and <em>focused</em> and <em>intense</em> -- every sight and smell and sound swamped out by Derek and an overwhelming <em>this-is-right</em> feeling, until he can hear Scott shouting, \"STILES! DEREK! STILES!\"</p>\n<p>Derek jerks back, suddenly aware and in-focus and his hand pulls off Stiles back like he's been burned.  Everything snaps back to normal, half-Betazoid levels and…</p>\n<p>Holy Jesus in Heaven.  He's not Jimmy Olsen.  He's <em>Lois fucking Lane</em>.</p>\n<p>Stiles' dad takes a lot in stride these days -- \"new friend from high school turned out to be a succubus and kidnapped me for a couple hours\" plays so much better than the time Stiles disappeared for a week and came back married to a werewolf that it doesn't even rate.</p>\n<p>Stiles' dad just looks from Stiles (still shirtless with Derek's leather jacket wrapped around his skinny chest) to Derek (the knees of his jeans covered in dried and flaking succubus blood) and says, \"Pizza ok?  I'll get the whole wheat crust?\"</p>\n<p>Derek grunts and nods and Stiles says, \"Yes, yes, thank you,\" and goes upstairs to take a shower.  He comes downstairs to find his Dad and Derek watching NFL Rewind and drinking beer on the couch, completely at ease with each other, comfortable.  Normal. </p>\n<p>Derek says something disparaging about Jay Cutler and Stiles' dad says, \"I'll drink to that,\" and laughs.</p>\n<p>Stiles kills some time watching them, an unexplained warmth taking up residence in his chest.</p>\n<p>Derek's jaw is clenched hard enough that on a human he'd have sprained something by now.</p>\n<p>\"What happened at the chemical plant,\" he says.  \"I'm sorry.  I shouldn't have lost control like that, it won't happen again.\"</p>\n<p>\"What?\" Stiles squawks.  And stares, because wow.  Derek is <em>dumb.</em>  Derek doesn't know a good thing when he sees it.  Makes out with it, whatever.  \"No! Stop that, it's totally going to happen <em>all the time</em>.\"</p>\n<p>This conversation is not going how Derek planned, Stiles can feel his confusion coming in shocked little waves.</p>\n<p>Stiles says, \"We're dating.\"  It's not a question, it's a statement of <em>fact</em>.</p>\n<p>Derek says, \"No, we're not.\"  When Derek grinds his teeth together hard enough, muscles in his face twitch.</p>\n<p>Stiles says, \"Yes, <em>we totally are</em>.\"  Stiles feels simultaneously smug (he <em>knows</em> how Derek feels about him, it's totally <em>awesome</em>) and six years old, since the argument has devolved into <em>are no/ are too</em>.</p>\n<p>\"You're <em>seventeen</em>,\" Derek says, \"You don't know what-\"</p>\n<p>Stiles cuts him off with an elaborate hand gesture he'll probably never be able to repeat. \"Hold it right there, big guy.  I know exactly what I'm doing, give me more credit than that, I'm not <em>Scott</em>.\"</p>\n<p>Derek frowns, well he frowns <em>more</em>, but he <em>has</em> to know that not all seventeen-year-olds are created equal.  Werewolf business aside, Stiles hasn't ever been a typical, dumb, carefree teenage.  He hasn't had the <em>chance</em>.  Derek, of all people, should know what that's like.</p>\n<p>\"I get that it's weird, because it's absolutely weird.  I mean, right, most people date <em>then</em> move in together <em>then</em> get married, but you and me?   Not most people.  Some of us?  Not even technically people.\"  Oh wow, he should probably not insult someone he's trying to convince to date him.  \"Ok, sorry, sorry, I'm racist.  <em>You love me anyway</em>.\"</p>\n<p>Derek doesn't even try to deny it.</p>\n<p>\"Stiles, where is this coming from?\"  Derek asks.  \"You never…\"  He cuts himself off with a small noise of frustration.</p>\n<p>\"I <em>never?</em>\"  Stiles sputters, \"<em>You never</em>.\"</p>\n<p>Stiles will be the first to admit that he was slow on the uptake on this one.  How the hell was he supposed to know Derek <em>wanted</em> to be stuck with him, wanted to hang out with Stiles' dad, wanted to listen to Stiles complain about Harris?  Even the vague notion of it still seems impossible, it's pretty frickin' hard to process that it's <em>actually happening</em>.</p>\n<p>\"And oh my God,\" Stiles flails. \"I used to have a thing for <em>Kermit The Frog</em>.  Things change!  People change!\"</p>\n<p>\"I can't do this with you,\" Derek says, \"We're not having this conversation.\"</p>\n<p>Oh but they are.  They so are. <em> Are too.</em></p>\n<p>Stiles takes advantage of a lull in Chemistry class to ask Scott, \"Are you still emotionally scarred from seeing me make out with Derek?  Because don't expect that to stop happening.  Ever.\"</p>\n<p>\"It's fine,\" Scott says, and that's sweet of him to say, since he still looks really grossed out.  \"I just thought you weren't into him like that.\"</p>\n<p>Well, ok, yeah.  That's sort of true.  Stiles <em>wasn't</em>.</p>\n<p>Objectively, Derek is attractive.  This isn't really up for debate -- it's a provable, empirical <em>fact</em>.  When Stiles and Scott ran into Derek in the woods that first time, pretty much Stiles thought process had been:</p>\n<p>HOLY CRAP WHERE DID THAT GUY COME FROM?</p>\n<p>HOLY CRAP I THINK THAT'S DEREK HALE!</p>\n<p>HOLY CRAP DEREK HALE GREW UP HOT.</p>\n<p>So, ok, that's what Stiles had been focused on for like, a second.  But Derek was all, you know, blah blah blah, get off of my land, here let me give you Scott's inhaler in the creepiest way possible.</p>\n<p>It's not like they met cute.  Seriously, the <em>she needed a pen, I gave her a pen</em> start to the McCall/Argent saga is way better by comparison.</p>\n<p>If Stiles hadn't been constantly afraid for his life and/or convinced Derek had killed people and would kill again… well, he'd have probably still have thought Derek was really, really ridiculously good looking and moved on without thinking about it again.  With the neon, glaring exception of Lydia, Stiles is smart enough not to waste time and effort on things that aren't going to happen.  Psychotic hot guys you meet in the woods falling firmly in that category.</p>\n<p>The way things <em>did</em> turn out, Derek's absurd appeal came second to a lot of more salient details, like the whole <em>werewolf thing</em>.  And all the <em>murders</em>.</p>\n<p>In conclusion: Derek is hot, but no, Stiles didn't think about him <em>that way</em> because it wasn't productive.  Well, he <em>hadn't</em> thought about Derek that way until <em>now</em>.  Now it's pretty much all he's thinking about.  24/7.</p>\n<p>Stiles realizes a second too late that he's started drooling.</p>\n<p>Scott winces and when Harris' back is turned he hisses, \"Can we go back in time to when you just used to <em>talk</em> about him all the time?\"</p>\n<p>Stiles mutters, \"Hypocrite.\"</p>\n<p>Stiles knows for a <em>fact</em> that the only way Scott gets through the day is by picturing Allison naked like, at all times.  It's pretty much the reason Scott's failing Spanish.  Scott has a <em>thing</em> for romance languages.  Hey, Stiles doesn't judge.</p>\n<p>Stiles says, \"You're just mad I don't think you're the prettiest wolf at the ball anymore.  You had <em>years</em> to get in on this action, don't be a hater.\"</p>\n<p>Harris doesn't even turn around, just raises his hand in a gesture Stiles has long since interpreted to mean <em>Stilinski I'll see you after school</em>.  Sigh.</p>\n<p>It really didn't take long before the standing, semi-weekly <em>Who Is Trying To Kill Us Now?</em> meetings migrated from the creepy-ass train depot to Casa Stilinski, mostly because their house has food and running water and doesn't smell like dormice have been nesting in it for years.  Also Derek lives here and sometimes he's actually really lazy and doesn't want to bother driving that far.</p>\n<p>Anyway, upshot of that -- every once in a while Stiles' house is full of werewolves.  And sometimes Lydia and Allison, when their relative counterparts aren't being idiots so really, it's mostly just werewolves and Stiles.</p>\n<p>Erica and Isaac are bickering about something pointless and Boyd looks moderately homicidal, so Stiles takes the opportunity to de-rail (ha, train joke, get it) the meeting they aren't actually having by saying, \"Derek and I are dating.\"</p>\n<p>The reaction is expectedly mixed.</p>\n<p>Isaac asks, \"You weren't before?\"</p>\n<p>\"We're not dating,\" Derek says, flat.  He's wrong.</p>\n<p>Jackson says, \"Are we really having an entire conversation about this?\"  It's cute how he thinks his time is like, worth something valuable.  \"I have places to be.\"</p>\n<p>Erica says, \"We've seen you shirtless, Stiles.  We can <em>smell</em> <em>you</em>.\"</p>\n<p>Stiles sometimes misses the old, frizzy Erica.  That Erica was too miserable to be sassy <em>all the time</em>.</p>\n<p>Boyd says, \"You live together.  Right?  Derek lives here.\"</p>\n<p>Derek growls, \"Not like that.\"</p>\n<p>\"It wasn't like that <em>before</em>,\" Stiles says.  \"Does no one remember my horrifying date with Jenny the Succubus?  That was only last week.\"</p>\n<p>Everyone grimaces.  Yeah.  Yeah, they all remember Jenny the Succubus.  They arrived 10 minutes after Derek killed it (thank God Erica kept pants in that emergency clothes kit of hers) and since they were all there <em>anyway</em>, they all had to help clean up.  Stiles still hasn't gotten the stains out of Derek's jeans and Jesus, how did Stiles not realize before that they were a<em> couple?  </em>For God's sake he <em>does Derek's laundry</em>.</p>\n<p>Scott breaks the <em>yeah-that-was-icky</em> silence they're all sharing by saying, \"That's why I thought it was weird!  But I wasn't gonna be like, <em>Hey man stop stepping out on Derek</em>.  You were being all, whatever.  I thought you'd had a fight.\"</p>\n<p>Derek doesn't exactly storm out (he lives there), but he does leave the room.</p>\n<p>Stiles watches him go, turns back to everyone else.  \"He loves me.\"</p>\n<p>Jackson makes a retching noise.</p>\n<p>Scott says, \"Duh.\"  He also says, \"I have no idea <em>why</em>.\"</p>\n<p>Stiles frowns, a little.  \"Me neither,\" he admits.</p>\n<p>Scott knocks his shoulder into Stiles, gives him a lopsided smile.  After Jackson and the step-kids leave, Stiles lets him win at FIFA.</p>\n<p>Stiles comes up with things for the two of them to do together (there's a fish fry in the basement of the Methodist church every Friday night!  Chili cook-off behind the IGA on Thursday!  Pumpkin chunking this weekend!) and Derek goes because Stiles goes.  Stiles calls it <em>dating</em> and tries to hold Derek's hand and Derek glares a lot and tries to keep his distance, but Stiles <em>knows</em> that Derek likes being near Stiles, likes the taste of toffee apples and pumpkin ales.</p>\n<p> </p>\n<p>The emotions bleeding off of Derek are so frickin' intense that Stiles only narrowly avoids plowing the Jeep into oncoming traffic.  He jams the car into park the second he hits the driveway and sprints into the house, nearly throwing the screen door off its hinges as he propels himself inside.</p>\n<p>\"Oh my God, Derek, are you ok, what's wrong?\"  Stiles asks, skidding to a stop on the linoleum inches away from Derek who looks <em>totally fine</em> but he's not, he can't be, because Stiles can feel how <em>frightened</em> he is.  \"Should I call Scott?  Babe, come on, <em>what's going on?</em>\"</p>\n<p>Derek's face is a blank, expressionless mask, but he jerks his eyes and his chin to the right and Stiles runs to the living room to see what's wrong… and runs right back out again.</p>\n<p>\n<em>\"Why is Erica crying?\"</em>\n</p>\n<p>There's a sobbing werewolf in the living room and Derek is just <em>letting that happen</em> and hiding in the kitchen.  In fact, Erica crying is <em>why</em> Derek is <em>terrified.</em>  Stiles is going to mock him for that.  Later.</p>\n<p>\"She won't stop,\" is all Derek says, but it's enough to prove to Stiles that Derek is not equipped to handle this kind of thing.</p>\n<p>Stiles takes a deep breath, shakes himself out and mentally braces for impact.  He can handle this.  Unlike certain <em>alpha werewolves</em>, he is not afraid of crying girls.  Much.</p>\n<p>He says to Derek, \"I got this, calm the eff down,\" and grabs a diet Coke from the fridge because it's Erica's favorite and he knows that because he's <em>awesome</em>.</p>\n<p>\"Don't hit me,\" Stiles says, sitting down next to Erica on the couch and handing her the soda as a peace offering.  She doesn't say anything, just turns and buries her face in Stiles' shoulder.  He holds on and lets her snot up his plaid shirt and waits until her shoulders stop shaking to ask, \"Do you want to talk about it?\"</p>\n<p>Erica shakes her head against his chest.</p>\n<p>\"Is it because you're devastated you're never gonna hit this?  Because I'd understand that.\"  Erica snorts, gets even more snot on Stiles' shirt, as though that's possible at this point.</p>\n<p>\"You are something else, Stilinski,\" she says, muffled.</p>\n<p>\"Yep,\" Stiles says.  \"And if you ever <em>do</em> want to talk about it for the love of God <em>do not go to Derek</em>.  That is a horrible idea, why did you come here with feelings?  He cannot handle that shit.\"</p>\n<p>Erica finally detaches herself from Stiles.  She looks blotchy and awful, but werewolf healing is probably good on busted capillaries so she'll be back to supermodel in no time.  Her voice is oddly wobbly when she says, \"I thought you might be here.\"</p>\n<p>And that is, wow.  He just pulls Erica back into another hug because what can you possibly say to that?  There aren't words.</p>\n<p>Erica calms down and they watch a rerun of How I Met Your Mother and eventually Derek drifts in from the kitchen, having actually <em>calmed the eff down</em> himself.</p>\n<p>Erica doesn't bother to clue them in on why she was crying on their couch in the first place, but she seems better when she leaves.</p>\n<p>Derek doesn't ask, but Stiles can tell he's curious.</p>\n<p>\"My mom used to say that sometimes girls just need to cry and then they're fine.\"  Stiles shrugs.  \"Yeah, I don't get it either.\"</p>\n<p>Stiles really doesn't give his dad enough credit for being a single parent.  Just having the bizarre and ill-defined relationship he does with the step-kids is<em> hard</em>.  But someone has to help Isaac with his homework and tell Erica that if her hemline gets any shorter she's gonna get kicked out of school and hug Boyd every once in a while or he's gonna explode.  That someone <em>has</em> to be Stiles, because Derek is too busy imbuing the pack with the skills they need to keep themselves alive.  Not that Stiles is the picture of emotional wellbeing or anything but oh my God is Derek never going to like, set boundaries or be anything other than terrible at handling high school drama.</p>\n<p>Stiles says, \"Admit it, you'd be lost without me.\"</p>\n<p>\"She'd have left eventually,\" Derek says.  \"I admit nothing.\"</p>\n<p>Stiles spaces out in history (seriously, Mrs. K's hard-on for Napoleon is downright disturbing), but wakes right the hell up when he reaches for his anti-scrying amulet and it's not there.</p>\n<p>And, right, ok, he goes a little absolutely frickin' psycho looking for it.  He drives all over town checking everywhere he's been in the last week and a half and then he tosses his Jeep and his room and the Hale house and even the <em>train depot</em> even though he hasn't been to the train depot in like a <em>month</em>.</p>\n<p>After the third time he checks the McCall's couch cushions he's forced to admit to himself that he's not going to find it.</p>\n<p>\"What's the big deal,\" Scott asks.  \"I thought you said you checked up and those hunters all went back where they came from?\"</p>\n<p>\"That's not the point!\"</p>\n<p>\"Ok,\" Scott says slowly, \"What is the point?  You said it made you look like a douchebag anyway.\"  Scott looks genuinely confused.</p>\n<p>\"I wouldn't - I didn't want to - Jesus, Scott, it's was pretty much - it's like losing my <em>wedding ring!</em>\"  Stiles knows full well he <em>sounds</em> as scattered as he <em>feels</em>.  Crap, Derek's going to think he's really in trouble and he's gonna show up any minute and then Stiles will have to tell him… And Stiles doesn't want him to be disappointed.  Stiles would do a lot of painful, embarrassing, awful things just so that Derek isn't ever disappointed in him.</p>\n<p>Scott chokes, a little.  \"Wedding ring?\"</p>\n<p>Stiles buries his head in his hands, embarrassed. \"It's the symbol of our epic love, oh Jesus, how could I just lose it like that?\"</p>\n<p>Scott says, \"<em>Our?</em>\"</p>\n<p>Stiles hyperventilates a little because yes, <em>our</em>.  This thing that he's realizing <em>right now</em> is their mutual, crazy, magically-bound love.  And it's not abstract, <em>sonnets about Lydia's hair</em> love.  It's <em>Derek steals the covers and then kicks them off in the middle of the night and Stiles just grumbles and takes them back but doesn't get mad</em> love.  It's <em>Stiles makes racist dog jokes </em>all the time<em> and Derek just laughs at them now because Stiles has </em>broken<em> him</em> love.  It's <em>sometimes Stiles sees rabbits in the backyard and gets nostalgic for their awful honeymoon</em> love.</p>\n<p>It's <em>Stiles can't breathe when he tries to picture a life without Derek in it</em> love.  It's <em>love</em>.</p>\n<p>Scott says, \"Hey Stiles, what's wrong? Stiles?\"</p>\n<p>\"I'm fine,\" Stiles lies.</p>\n<p>But then suddenly he <em>is </em>fine, because.  Derek.  Derek as arrived in Scott's living room without knocking on the front door or announcing his presence in any way.</p>\n<p>\"Are you dying?\" Derek asks, serious.  Stiles shakes his head, no.  How panicked has he <em>been</em> over this stupid necklace (and other, important! uh, realizations) that Derek rushed across town to make sure he wasn't <em>dying?</em>  Stiles is the <em>worst</em>.</p>\n<p>After an awkward moment where it's obvious that Stiles isn't dying and therefore Derek's purpose in being there has run its course, Derek reaches into his jacket pocket and holds something out.  The amulet.  Except now instead of strung on a woven hemp cord it's in a plain jewelry setting on a (probably not silver) chain.</p>\n<p>Stiles says, \"How did you?\" and \"Where did you?\"  Derek doesn't answer, moves his hand like he's going to take it back and Stiles lunges for it because nope, that can't happen, that amulet is Stiles', forever.  \"Thank you,\" Stiles says, heartfelt.</p>\n<p>Derek looks mildly embarrassed and Stiles can see the shiny new chain around <em>his</em> neck and Stiles melts.</p>\n<p>Yeah, ok, love.  No big deal.</p>\n<p>Scott looks a little grossed out, but on this?  He owes Stiles.  He can deal.</p>\n<p>\"No, ok, just no.  This is a better plan and you know it,\" Stiles says, because it <em>is</em>.  He's right.  Derek's plan sucks and <em>everyone</em> knows it, but Derek just cannot <em>handle</em> that.  Also he's a <em>dick</em>.</p>\n<p>Derek snarls, \"Sometimes I really hate you.\"  He means it.  Stiles <em>knows</em> he means it.</p>\n<p>It's like getting punched in the gut.</p>\n<p>Stiles says, \"Oh go fuck yourself,\" and leaves.  He gets as far as getting into his car and then he just sits there, because he doesn't have anywhere to go.  Even if he took off, Derek can always find him.  He's <em>everywhere</em> all the time and it's <em>suffocating</em> and Stiles is <em>sick of it</em>.</p>\n<p>The passenger side door opens and closes.  Stiles doesn't have to open his eyes to know it's Scott.  Scott smells comforting, now that Stiles can smell that kind of thing.</p>\n<p>Why wasn't he magically bound to <em>Scott?</em>  Scott's great.  Scott isn't a colossal <em>asshole</em> with the emotional access of a brick wall.  Scott occasionally <em>appreciates</em> Stiles.</p>\n<p>\"He didn't mean it,\" Scott says.</p>\n<p>\"He did when he said it.\"  Scott can't argue with him on that.  Stiles says, \"I'll come back in a minute, ok?  I just need a minute.\"</p>\n<p>Scott says, \"Sure,\" and slips out of the car.  Stiles concentrates on breathing, attempts to clear his mind.</p>\n<p>He opens his eyes when there's a knock on the driver's side window.</p>\n<p>\"Wake up,\" Derek says.  \"Everybody else went home.\"</p>\n<p>Stiles wipes drool off his face, gets out of the Jeep.  It's dark, when did it get dark out?</p>\n<p>Derek says, \"I don't hate you.\"</p>\n<p>\"Yes you do,\" Stiles says, \"Sometimes.  It's fine.\"</p>\n<p>If Stiles was expecting Derek to argue, he doesn't.</p>\n<p>\"It's harder to deal with you being mad at me now.  I don't like getting it in stereo.\"  He doesn't say the other thoughts that are ricocheting around his head, they're all exceptionally needy and pathetic, but nothing can stop the needy and pathetic way he reaches out, touching Derek's shoulder for reassurance.</p>\n<p>Derek says, \"I'm still here.\"  It doesn't make sense -- Stiles was the one who left -- but it's nice. To hear it.  \"I'm not going anywhere.\"</p>\n<p>\"Yeah,\" Stiles says.  \"I know.  You liked it, you put a ring on it, you're stuck with me.\"</p>\n<p>Derek laughs and all Stiles can read from him is warm, open affection.  Derek says, \"We voted.  Everyone went with your idea.\"</p>\n<p>\"It's just natural charm, man,\" Stiles says. \"And bribes.\"</p>\n<p>He sighs, swipes his hand over his face, why is he so <em>tired?</em>  He says, \"You know how when you were a kid and you asked your mom for something and she said no but then you turned around and asked your dad for the same thing and he said yes?  And then your mom got mad at you, yeah, but she also totally got mad at your dad, too?\"</p>\n<p>\"Yeah.\"</p>\n<p>Stiles lets himself lean further into Derek.  \"Yeah.\"</p>\n<p>They walk into the house, and Stiles whistles the chorus to Single Ladies under his breath because he can't help himself.</p>\n<p>Stiles says, \"You're still kind of a dick.\"</p>\n<p>Derek says, \"It's amazing I only hate you some of the time.\"</p>\n<p>\"Oh God, that movie was terrible,\" Stiles says, laughing.</p>\n<p>It's a cool night, but they hoofed it to the theater because Derek is a freak and thinks anything within a three mile radius is a reasonable walking distance.  Stiles appreciates it right now, it feels good to put some physical distance between himself and the exceptionally terrible way that movie ended.</p>\n<p>Stiles bumps his shoulder against Derek's, because Derek is being quiet and it's not the usual way he's quiet.  Don't ask Stiles how he knows the difference.</p>\n<p>Derek stops walking, so Stiles stops too, and he's about to ask Derek what's up when out of the blue, Derek leans in, put his hand on Stiles' face, and kisses him.  <em>Kisses him</em>.</p>\n<p>Oh holy Jesus, no way in hell is this actually happening.</p>\n<p>Even Stiles knows his fake-it-'til-you-make-it plan to bludgeon Derek into admitting they're in a real relationship is flawed.  Seriously.  He's not dumb and he's aware his life is not a romantic comedy.  Empirically his life is a horror movie slash coming of age drama.  His life is Stand By Me with werewolves, it really is, the analogy made more horrifyingly accurate in that everything started when Stiles went looking for a body in the woods.  This is not even <em>slightly</em> lost on Stiles.</p>\n<p>So even though he really knows better, and should enjoy this while it lasts, he is a dumbass and says, \"What?\"</p>\n<p>Derek says, \"You were right.\"</p>\n<p>The three greatest words in the English language <em>in combination</em> and the hottest werewolf in existence saying them -- Stiles, yeah, doesn't believe it.</p>\n<p>\"About what?\"  Derek looks at him in a way that Stiles interprets as, <em>are you serious?</em> </p>\n<p>\"This is a date, we're dating,\" Derek says, slowly.  \"You were right.\"  Derek looks off into the distance, serious, and Stiles is an <em>idiot</em> -- they could be making out right now!  Does he really need to qualify this moment?</p>\n<p>Ok, no, he really does, that's how he works.</p>\n<p>Derek says, \"Did you know your father calls me his son-in-law?\"  Stiles blinks.  \"On the phone.  He always forgets I can hear him.\"  He did not know that.  Not the hearing bit, the other thing.</p>\n<p>Derek doesn't immediately say anything else and Stiles, for once, shuts himself up, lets Derek not talk.</p>\n<p>\"I thought that if I didn't have any attachments I couldn't lose anybody else.\"</p>\n<p>This has always been the one thing that Stiles wishes they didn't have in common.  He'd had more friends than Scott before his mom died -- he'd been over at the Mahealani household enough that he called Danny's mom <em>makuahine</em>.  Scott just never let Stiles push him away.  Screw super-strength, Scott's superpower was sheer dumb determination.</p>\n<p>\"You don't get to choose, do you?\"</p>\n<p>\"No, you don't,\" Stiles says.</p>\n<p>Derek starts walking home and Stiles starts walking, too, helpless to do anything but trail after Derek into the deepening dark. </p>\n<p>\"This is a date,\" Stiles says, trying it out, mildly disbelieving still.  Stiles' heart does a backflip and Derek smiles a little at that.  Really, it's awesome what werewolves find romantic.</p>\n<p>Werewolves are cheap dates, apparently, and <em>this is a date</em>.</p>\n<p>Stiles says, \"I don't put out on the first date.\"</p>\n<p>Derek laughs.  \"Yes, you would.  But no, that's not happening.\"</p>\n<p>Stiles makes a face, \"What, we're dating in the <em>fifties</em>?  Are you gonna carry my books?  Are we going <em>steady?</em>\"</p>\n<p>Derek snorts, says, \"Gee, Veronica, I sure think you're swell.\"</p>\n<p>They walk the rest of the way home in silence, but it's a good quiet -- calm, contemplative.  Unhurried.  Sometimes their shoulders brush together and Stiles heart starts beating a little bit faster.</p>\n<p>When they get home they actually <em>stop on the front porch</em> (like people do on TV and only on TV) and look at each other.</p>\n<p>Embracing the cliché, Stiles decides <em>why-the-eff-not</em> and says, \"I had a good time tonight, we should do this again sometime.\"</p>\n<p>Derek half-smirks, just a small uptick at the corner of his mouth.</p>\n<p>Stiles says, \"I'd invite you in but you live here.\"  Other, more important words get caught, trapped in his throat.</p>\n<p>And then Derek must have his own <em>eff it</em> moment, because he leans in and kisses Stiles goodnight.</p>\n<p>\"Dad?\" Stiles asks.</p>\n<p>\"Yes, Stiles?\" His dad doesn't even look up from the newspaper.</p>\n<p>\"You know how I said Derek and I weren't like that? We're, uh, like that. Now.\"</p>\n<p>\"OK.\"</p>\n<p>Stiles is aware he's staring, open-mouthed, but really?  <em>That's it?</em></p>\n<p>\"That's it?\" Stiles asks.</p>\n<p>Stiles' dad looks up at him, unsurprised.  \"That's it,\" he says.</p>\n<p>\"You're not…\" Stiles says, though his fears about his dad were unspecific at best.  He's not what?  Mad about the age difference?  Concerned about Derek's intentions towards his son?  He already calls Derek his son-in-law, apparently.</p>\n<p>\"Nope.\"</p>\n<p>\"I'd thought you'd be more…\"</p>\n<p>\"You thought wrong.\"</p>\n<p>\"Huh,\" Stiles says.  \"Ok then.\"</p>\n<p>Stiles' dad finishes the sports section, sets his paper down.  He says, \"You could have done much worse.\"</p>\n<p>Because this is his life now, Stiles is married to a werewolf (the hottest werewolf ever, oh my God) that he's <em>actually, officially dating</em> and he's <em>still a virgin</em>.</p>\n<p>Well, at least they've crossed the invisible boundary Derek had set <em>before</em> and they can make out now.  Which they do.  They make out <em>all the time</em>.  Stiles totally gets now why Scott became such a spectacular dumbass when he'd first started dating Allison, because Stiles get distracted thinking about Derek <em>at all times</em> and he runs into things a lot.  Like walls.  And doorways.</p>\n<p>He comes home with new bruises, sometimes.  And almost always, Derek lays his hands over them and looks at Stiles with an exasperated fondness like… like <em>you're a dumbass but I like you anyway</em>.</p>\n<p>Really, it's out of hand at this point.  Stiles' relationship is so awesome he's making <em>himself</em> sick… except they're, right, not having sex.</p>\n<p>It's not for lack of trying on Stiles' part. </p>\n<p>Ok, some of it's his fault.</p>\n<p>Like one night he'd asked, \"When was the last time you dated someone?\"  Which seemed like a <em>completely innocuous</em> question at the time.</p>\n<p>When Stiles found out about Derek and Kate Argent he <em>threw up</em>.  An over-reaction by any <em>human</em> standards, but when Derek had said her name Stiles had been slammed with this overwhelming, sickening betrayal, stronger than anything he'd ever gotten before.  And that wasn't <em>it</em>, wasn't <em>all</em>, bringing it up had opened the <em>floodgates</em> and Derek didn't say anything, but it was all there under the surface -- raw, painful, and Stiles could read <em>all</em> of it.</p>\n<p>Derek had been <em>in love</em> with her, he'd… Stiles couldn't even <em>think</em> about it.</p>\n<p>He doesn't believe that your first time <em>has</em> to be special, he just thinks your first time shouldn't be with someone who <em>murders your entire family</em>.  Jesus.</p>\n<p>So Derek had very quietly and stoically freaked out while Stiles heaved up his low-fat mac &amp; cheese and that pretty much killed all the romance right there.</p>\n<p>Anyway, the virginity?  Ends now.  Stiles has a plan.</p>\n<p>\"We're having sex,\" Stiles says.</p>\n<p>\"Stiles, you're seventeen.\"</p>\n<p>Derek likes to point out Stiles' age a lot.  It's like a once a day thing.  Stiles is more aware of how old he is than anyone else on the planet.</p>\n<p>\"Yes,\" Stiles says, and rolls his eyes.  \"And I'm saving myself for marriage -- oh wait.\"</p>\n<p>Stiles takes his shirt off.  Luckily this is not his entire move because the sight of shirtless Stiles doesn't whip Derek into the lust-driven frenzy Stiles was hoping for.  (That was Plan B anyway.)</p>\n<p>Stiles crawls into Derek's lap (Plan C? also a no-go) and carefully, no-sudden-movements grabs Derek's hand.  Derek resists when Stiles pulls at it, only relaxes at Stiles', \"Please, let me.\"</p>\n<p>Because Stiles has figured out Derek's major malfunction: he's <em>just like</em> the frickin' <em>hags</em>.  He doesn't believe what Stiles <em>says</em>.</p>\n<p>Stiles concentrates on how much he really, really wants Derek, how he's <em>totally ready for </em>this, how his consent is so informed he's thinking about writing it down and having it <em>notarized</em>. And then in what is one of the more awkward, least smooth maneuvers ever, he works Derek's hand onto his back, presses it into the mark there.</p>\n<p>\"<em>Please</em>,\" Stiles says, voice just <em>wrecked</em> over the surge of shared <em>everything</em>.</p>\n<p>Derek <em>snarls</em> his name and grabs his hips, fingertips pressing bruises into Stiles' skin, finally, finally giving up on being <em>careful</em>.</p>\n<p>Derek says, \"You want this.\"  Not a question.</p>\n<p>Stiles says, \"Yes,\" anyway.</p>\n<p>\"Good,\" Derek says, \"Because ever since I was 16, everything in my life has been a <em>fight</em> and I'm done fighting this.\"  Derek kisses him, biting at his lower lip and <em>holy crap</em> growling into Stiles' mouth.</p>\n<p>\"Yeah,\" Stiles gasps, \"Fighting bad.  Can't we all just -- <em>oh my God</em> -- get along?\"</p>\n<p>Derek pants, breath cooling against the damp side of Stiles' neck.  He mutters, \"<em>You</em> <em>drive me crazy</em>,\" and other, inaudible things Stiles is too distracted to interpret.  He hauls Stiles in, closer, and <em>grinds</em> into him and.  Oh.  Yes.</p>\n<p>Stiles is kind of half-drunk from being <em>absolutely exhausted</em>, it's not his <em>fault</em> that he says, \"Feel free to tell me why you're <em>madly in love</em> with me.  You know.  Whenever you're ready.\"  He just honestly cannot stop himself.</p>\n<p>He doesn't actually expect Derek to respond.</p>\n<p>Derek says, \"You smell like you belong to me.\"</p>\n<p>When Stiles imagined Derek's epic confessions of love, never did he put the way he <em>smells</em> front and center.</p>\n<p>And, ok, if that's not supposed to be a turn on, then they have a problem.</p>\n<p>Stiles can't help himself, tries to surreptitiously sniff his wrist.  Derek sees him, of course, and laughs, and it's a <em>good</em> laugh.  Deep.  Real.  Stiles <em>loves</em> Derek's laugh, he wishes he could get him to do it all the time.</p>\n<p>Derek smiles, lost in some memory, a happy one.  \"My mom used to say, <em>I'd have mated with your daddy if he was stone ugly or I was blind as a bat, just because of how good he smelled in the rain.</em>\" Derek's impression of his mom's voice sounds warm, southern, like she was someone who made good cornbread.</p>\n<p>\"So this is all, like, a weird werewolf across-a-crowded-room thing?  Was it love at first sniff?  When you were all <em>hey kids get off my creepy-ass lawn?</em>\"</p>\n<p>Stiles had entertained a couple possibilities, but more or less he figured it was some time after the whole kanima aquatic aerobics thing, because lifesaving is <em>sexy</em>.   He hadn't considered all the way back, when he was a complete ass and kept <em>accusing Derek of murder.</em>  Wow, were they ever gonna <em>leave that part out</em> when they told the grandkids.</p>\n<p>Derek looks embarrassed, grits out, \"I thought it was Scott.\"</p>\n<p>\"What?\"</p>\n<p>Derek sighs.  \"Until you showed up in the Sheriff's cruiser, I thought it was Scott-\"</p>\n<p>\"Oh my God, you thought you were having a love connection with <em>Scott?</em>\"</p>\n<p>\"I was <em>obviously wrong.</em>\"</p>\n<p>\"Wow, see if I ever trust your judgment ever again.  Scott.  <em>Scott</em>.  You wanted to get it on with <em>Scott</em>.  Oh my God, that's the worst idea ever.\"</p>\n<p>Derek and <em>Scott</em>.  It's horrifying to even think about.</p>\n<p>Derek says, \"You really shouldn't put yourself in confined spaces with angry werewolves, Stiles.\"  What?  When did he?  Oh, his dad's cruiser.  </p>\n<p>Stiles yelps, \"There were extenuating circumstances!\"</p>\n<p>\"It was still a dumb idea,\" Derek says.  \"When you were that close, it was difficult to ignore, to not act on it.\"</p>\n<p>Stiles thinks, <em>so act on it already</em>.</p>\n<p>\"You were never gonna do anything, were you?\" Stiles asks and when Derek just… clenches his jaw, saying nothing, he adds, \"You <em>dumbass</em>.\"</p>\n<p>Derek says, \"If you weren't with someone in a few years, I thought about asking.\"</p>\n<p>\"<em>Thought about</em>.\"  That means he thought about <em>not asking</em>.</p>\n<p>And ok, it's a little irrational, but Stiles is getting angry.</p>\n<p>\"There isn't anyone else, there will <em>never be anyone else</em>,\" Stiles says. \"I turned down a <em>succubus</em>, Derek!  She was literally <em>the perfect woman</em>.  I looked it up, that's how it <em>works</em>.  So, empirically, you're it for me.  That's <em>proof</em>.\"</p>\n<p>Derek looks at him like, <em>How are you this much of a dumbass</em>?</p>\n<p>This is probably the wrong moment to bring up evil ex-almost-girlfriends, yes. </p>\n<p>Regardless -- Derek really thought that <em>Jenny the Succubus</em> was better for Stiles than him.  Derek is <em>insane</em>.  Stiles is married to an <em>insane werewolf</em>.</p>\n<p>Whatever, he does the dishes.</p>\n<p>Derek says, \"I wanted you to have a <em>choice</em>.\"</p>\n<p>\"I love you,\" Stiles says, quickly, like ripping off a Band-Aid.</p>\n<p>He says, \"If you'd asked, I would have said yes.\"</p>\n<p>\"You can't know that.\"</p>\n<p>\"Fine,\" Stiles kind of yells.  \"You're right.  They <em>took that away from me</em>.\"</p>\n<p>Stiles only hates the hunters, the hags, what happened in the woods <em>sometimes</em>.  Stiles is actually pretty damn thrilled, really, with how his life has turned out.  That doesn't change the facts.  What should have been his choice <em>wasn't</em>.</p>\n<p>\"<em>Ask me now</em>,\" Stiles says.  \"<em>Right now</em>.  You never asked before.  We were communicating mostly through significant looks at the time.\"</p>\n<p>Derek stares at him, a little confused, for a long second.</p>\n<p>\"Now?\" he asks, \"Even though it doesn't mean anything?\"</p>\n<p>\"Right now,\" Stiles says.</p>\n<p>Derek closes his eyes, says, \"I swear to God, Stiles, if you're fucking with me…\"</p>\n<p>\"No, no, I would <em>never</em>,\" Stiles says and, wow, Derek can kind of <em>read his mind</em> but still can't tell Stiles is serious about this.</p>\n<p>\"Please,\" Stiles says, quiet.</p>\n<p>Derek rolls over, bracing himself above Stiles.  He takes a deep breath and makes eye contact, holds it.  A shiver goes down Stiles' spine, he can feel the hair on the back of his neck standing up.</p>\n<p>\"Stiles,\" Derek says, \"<em>Will you be my mate?</em>\"</p>\n<p>\"Yes,\" Stiles says.  Yes, yes, yes.</p>\n<p>As vows go, much better the second time around.</p>\n<p>Stiles looks up that girl.  Her name is Miranda and it turns out that she <em>did</em> get into Princeton.  Oh and she ended up marrying that guy she was dating in high school.  The pictures of their family on Facebook are adorable.  She totally turned out fine.</p>\n<p>Stiles is an idiot.</p>\n<p>It was a <em>great</em> idea.</p>"
}