{
  "id": "5744635",
  "url": "https://archiveofourown.org/works/5744635?view_full_work=true",
  "author": [
    "astolat"
  ],
  "title": "Timeshare",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter"
  ],
  "characters": [
    "Harry Potter",
    "Draco Malfoy",
    "The Dursleys",
    "The Malfoys"
  ],
  "additional_tags": [
    "Canon What Canon",
    "Summer",
    "timeshare"
  ],
  "language": "English",
  "series": "Part 1 of Harry Potter works",
  "published": "2016-01-17",
  "completed": null,
  "words": "14,156",
  "chapters": "1/1",
  "comments": "476",
  "kudos": "23,239",
  "bookmarks": "3,613",
  "hits": "295,490",
  "summary": "<p>“It’s not for long,” Hermione said. “By the time we get back to Hogwarts, the Unfettering Brew will be ready.”</p>\n<p>“Listen to you!” Ron said. “He’s got to get through a month with the Dursleys and a month at <em>Malfoy Manor</em>. With <em>Draco Malfoy</em>.”</p>\n<p>“Yeah, thanks,” Harry said, because he hadn’t just spent the last week contemplating just how much more horrible his summer holidays were about to be than they’d ever been before.</p>",
  "notes": "<p>There's no actual place in canon where this fits, but in my head it's summer after sixth year, the attack on the Department of Mysteries never occurred and Voldemort has been off doing no one knows what in preparation for the coming war.</p>\n<p>With heaps of thanks to lim and Ces for beta! &lt;3</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>All feedback loved! If you like, <a href=\"https://astolat.tumblr.com/post/137490776253/timeshare-14158-words-by-astolat-chapters-11\" rel=\"nofollow\">reblog</a>! ♥</p>",
  "text": "<p>The train ride to King’s Cross was a stony, silent affair. Draco sat next to him, on the grounds that “at least that way I don’t have to <em>look</em> at you,” which suited Harry fine, but Crabbe had taken Draco’s other side, and Goyle and Ron and Hermione were opposite them, all of them glaring and being glared-at and fingering their wands, so it didn’t really help all that much. Nobody said a word until the tea trolley came past. “Anything for you, loveys?”</p>\n<p>“Not unless you have a bottle of Infilcher’s Insensibility Draught,” Draco said. His arm and shoulder were a rigid straight line, pressed up all against Harry’s equally stiff one. It felt horribly nice. Every few moments Harry had to catch himself before he relaxed into it.</p>\n<p>Harry had never been <em>glad</em> to get home before, and he still wasn’t, but it was at least a temporary relief when the train finally ground into the station and they had to get up and get their trunks down. Draco’s was double-height, but spelled with so many Featherlight charms it nearly floated: he stalked out ahead of Harry and started marching down the platform without a pause. Harry gritted his teeth. It was like having a string tied around his guts, trying to drag them out of him. He held position and turned round determinedly. “Have a good holiday,” he told Ron and Hermione, who were watching him anxiously.</p>\n<p>They didn’t say <em>you too</em>. “Do be careful, Harry,” Hermione said.</p>\n<p>“Don’t close your eyes for a second,” Ron added. “I don’t trust that rotter one inch.”</p>\n<p>“Well, it’s not like he can hurt Harry right now,” Hermione said.</p>\n<p>“If anyone can find a way round that, it’s Malfoy,” Ron said darkly.</p>\n<p>“If he <em>did</em> find a way round this, I wouldn’t <em>care</em>,” Harry said. Hermione bit her lip and stepped forward and hugged him.</p>\n<p>“It’s not for long,” she said. “By the time we get back to Hogwarts, the Unfettering Brew will be ready.”</p>\n<p>“Listen to you!” Ron said. “He’s got to get through a month with the Dursleys and a month at <em>Malfoy Manor</em>. With <em>Draco Malfoy</em>.”</p>\n<p>“Yeah, thanks,” Harry said, because he hadn’t just spent the last week contemplating just how much more horrible his summer holidays were about to be than they’d ever been before. He took a deep breath. The string was still tugging, a tight sore pain starting in the middle of his back. “See you,” he said, and turned around to catch up. Draco had halted maybe ten yards on, his back rigid and furious. Crabbe and Goyle were looking at him sideways, like they didn’t dare even speak.</p>\n<p>“This way,” Harry muttered, dragging his own trunk past. Up ahead, kids were running off the platform to their mums and dads, everyone hugging and laughing and talking at once, a happy crowded noise. Uncle Vernon was waiting at the back, scowling and arms folded across his chest. Harry had been sure the Dursleys wouldn’t have Draco—he’d had a bad few days thinking he’d have the <em>entire summer</em> with the Malfoys—but Dumbledore had somehow talked them into it. Of course, it was maybe even more hideous that Harry had to be glad for spending any time with the Dursleys. He was really looking forward to a whole summer getting to decide which was worse. </p>\n<p>“Well, come on,” Uncle Vernon growled, when they got up to him, and turned around and stalked off to the car without a pause. Harry followed him, then glanced back: Draco had slowed down. He was looking searchingly around the crowd, like he expected to see somebody.</p>\n<p>“Bye, Draco,” Goyle said a bit uncertainly, going past him with his own dad.</p>\n<p>Draco only gave him a chin-jerk of a nod, then turned away from the platform, his lips pressed together. He didn’t say anything the whole ride to Little Whinging, sitting in the back seat next to Harry and staring straight ahead as though he wasn’t seeing anything around him. Uncle Vernon led the way into the house and on to the living room, where Aunt Petunia was sitting on the sofa waiting for them, her face primmed up into tight disapproval.</p>\n<p>“Now then,” Uncle Vernon said, turning to face them. “You may be sure I wouldn’t have stood still for this outrageous imposition, if it didn’t mean we’d have our August holiday without you. That’s worth having to put up with <em>two</em> of you freaks in the house for a month. But I intend to make it perfectly clear from the outset that we will have <em>none</em> of your funny business around here. No tricks, no waving around those rotten little sticks of yours. None of it!”</p>\n<p>Harry rolled his eyes privately. “Yes, Uncle Vernon.”</p>\n<p>“And you,” Uncle Vernon added, looming over Draco, who blinked as if he were coming awake and very slowly turned his head to stare up at him. “I don’t know what sort of jiggery pokery you’re used to getting away with at home, but I won’t have it in my house. Is that understood?”</p>\n<p>Draco stared up at him a moment longer, and then said, in amazed tones, “Potter, is this filthy Muggle kenneller of yours <em>speaking to me</em>?”</p>\n<p>Uncle Vernon gawked down at him, and Harry had one appalled moment to realize things were going to go even worse than he’d ever dreamed, and then Draco was advancing on Uncle Vernon, drawing his wand out of his sleeve. “Listen very carefully, <em>worm</em>,” he said through his teeth. “I don’t know what sort of behavior Potter lets you get away with, but <em>I</em> am not a pathetic Muggle-loving excuse of a wizard. It’s bad enough I have to spend half of my holidays in this wretched hovel,” waving his arm around the living room, taking in the marble fireplace and the two massive sofas and the sixty-inch telly, “enduring Merlin knows what sort of hellish conditions. I will <em>not</em> tolerate disrespect. For as long as I am gracing your home with my presence, you will do your best to keep out of my way, and when you speak to me, which should be as infrequently as your duties permit, you will address me as <em>Master Malfoy</em>.”</p>\n<p>“Why you little—” Uncle Vernon spluttered, his face reddening. “You can’t put anything over on <em>us</em>, you aren’t allowed to use magic—”</p>\n<p>Draco laughed, high and sharp and cutting. “Oh, did Potter go off half-cocked and get a finger-wagging from the Ministry? Don’t be stupid.” He jabbed his wand up under Uncle Vernon’s chin, sparks spilling off the end, backing him up to the sofa until he fell backwards into it with a yelp and a squeaking of springs, Aunt Petunia clutching at his shoulders. “<em>I</em> won’t suffer any consequences if I have to use magic to teach you proper respect. My parents will file a self-defense exemption with the Head of the Improper Use of Magic Office, we’ll meet with him at our solicitor’s office, I’ll apologize very sincerely for having been <em>forced</em> to turn you and your family into red-tailed salamanders, then we’ll all shake hands and there will be an end of it.”</p>\n<p>He whisked his wand back into his sleeve and straightened up. “Now take my trunk up to my rooms,” he spat, “and if they aren’t suitable, you will make them so before dinnertime. Potter! Where do you go to fly around here?”</p>\n<p>He whirled on his heel and held out his hand for his broomstick, which jumped into it, and stalked back out to the hall. Harry stared after him, then looked back at the Dursleys. Uncle Vernon and Aunt Petunia were still shrinking deep into the sofa. “Um,” Harry said. “I’ve—got to go with him.” He took a step backwards towards the door cautiously, half feeling as though the whole room was a bomb that might go off. He backed up another step, then another, and then he was safely out of sight in the hall.</p>\n<p>He’d left his trunk at the foot of the stairs, Hedwig’s cage on top. She hooted inquiringly at him. “Yeah,” Harry said to her. “I don’t know what just happened either.”</p>\n<p>“Potter, is there some inconceivable reason you’re <em>lingering</em> in this shack?” Draco snapped from the porch.</p>\n<p>Harry rolled his eyes. “There’s nowhere to go flying, Malfoy! The whole neighborhood is full of Muggles, we’ll be seen for sure.”</p>\n<p>“Don’t be an idiot. There’s cloud cover not three hundred feet up, it’s legal conditions. What’s the matter, scared you’ll fall off?”</p>\n<p>“Not before <em>you</em> will,” Harry shot back, but fine, it wasn’t like he <em>wanted</em> to stay in the house. He took Hedwig out of her cage—he didn’t trust the Dursleys with her for a second if his back was turned—and took his broomstick to the door. Draco was impatiently tossing a gold ball in his hand up and down. “You’ve got a Snitch!” Harry said.</p>\n<p>“What, you haven’t?” Draco said sneeringly. “<em>Will</em> you come on?”</p>\n<p>#</p>\n<p>They came back to the house four hours later, when it finally got too dark to see the Snitch. Harry had caught it twelve times and Draco nine, they’d nearly fallen off a dozen times between them, and he’d accidentally worked out a brilliant looping trick that you could only do because the Firebolt’s foot grips let you keep traction even in a twisting dive. When they came in, their trunks <em>had</em> been taken upstairs, there wasn’t any sign of the Dursleys at all—Harry could see a light coming from under their bedroom door at the top of the stairs, but it was shut tight—and there were plates keeping warm in the oven.</p>\n<p>“What is that monstrosity?” Draco said, going straight past the kitchen and dropping himself into the chair at the head of Aunt Petunia’s polished dining table. He jerked his chin.</p>\n<p>“It’s an epergne,” Harry said, sitting down with his own plate. He wasn’t going to bloody well serve Malfoy.</p>\n<p>“I can see it’s <em>meant</em> to be an epergne,” Draco said. He scowled over at Harry’s plate and then got up and went and got his own. “Why is it sitting on the table? It’s putting me off my dinner.”</p>\n<p>“It was a wedding present,” Harry said. He’d heard a lot of bragging on the subject from Aunt Petunia whenever a new guest came to the house, not to mention the lectures to keep his grubby hands off it. “It cost five hundred pounds.”</p>\n<p>“Yes, I can <em>tell</em>,” Draco said, except he made it sneering. “What a ghastly life you lead, Potter. I suppose you eat this sort of common swill every night, too?”</p>\n<p>He tucked in pretty enthusiastically, for all his claims of delicacy. Both plates were full of lamb shank and mashed potatoes and stewed mushrooms and green beans. Harry hadn’t eaten anything like it at the Dursleys’ table his entire life except as cold table scraps: it had to be the special dinner Aunt Petunia had been planning to welcome Dudley back tomorrow. They both cleaned their plates, and there was even a cheesecake in the fridge, which Malfoy commandeered without hesitation. Harry hadn’t ever tasted a piece of Aunt Petunia’s cheesecake, either: she always took a slice, and then Dudley and Vernon gobbled all the rest, moaning about how wonderful it was.</p>\n<p>It <em>was</em> fantastic. Even Draco said, grudgingly, “That was adequate, at least. Now, where are my rooms?” pushing his dirty plates back.</p>\n<p>“First there’s the washing up,” Harry said pointedly, because he wasn’t going to clean up after Malfoy, either, but Draco sniffed.</p>\n<p>“If your family are so poverty-stricken they can’t afford to keep a decent servant, it’s nothing to do with <em>me</em>,” and he stood up and headed for the stairs.</p>\n<p>Harry looked down at the plates, but the <em>pull</em> was tugging him along, and anyway he was sure Aunt Petunia and Uncle Vernon would shriek if Draco came into their room by accident. He followed Draco upstairs. “Straight ahead,” Harry said, and Draco opened the door to the spare bedroom and stood on the threshold surveying the big king-size bed and the heavy wood furniture and the expensive carpet with an expression of disgust.</p>\n<p>“Ugh, it’s unbearable,” he said. “This is where you sleep?”</p>\n<p>“No, I sleep over here,” Harry said dryly, opening the door to his room across the landing. Draco looked even more appalled after a glance inside.</p>\n<p>“You might as well live in a cupboard,” he said. “Honestly, Potter, I’m almost starting to feel <em>sorry</em> for you.” He swept into the spare room.</p>\n<p>Harry looked longingly over at his room—his own room, small or not, with no Draco Malfoy in it. The bedrooms weren’t <em>that</em> far apart. He tried going inside and sitting down on the bed for a minute, just to see—</p>\n<p>It was no use. The tugging wasn’t that bad at first, but it just <em>kept going</em>. He sighed and got up. Uncle Vernon had left Harry’s trunk pushed just inside his door, but it wasn’t hard to shove it along the hall and into Malfoy’s room. Draco was already changing, into a long black nightshirt, trimmed in silver. He scowled as Harry came in, but didn’t say anything: he’d felt it, too.</p>\n<p>“If you kick, I’ll shove you off the bed,” he informed Harry as they got into bed.</p>\n<p>Harry rolled his eyes. “<em>Night</em>, Malfoy,” he said, pointedly, and shut off the light.</p>\n<p>His eyes were closing even on the way down, and they didn’t open again until the sun came in and hit him in the face, at which point he woke up feeling absolutely fantastic and <em>cuddling Draco Malfoy</em>.</p>\n<p>“Oh <em>no</em>,” Harry said, appalled, which made Draco wake up.</p>\n<p>“Tomorrow you’re sleeping on the floor!” Draco said, glaring at him from the other side of the bed after they’d scrambled out in opposite directions.</p>\n<p>“I’ve got a better idea, why don’t <em>you</em> sleep on the floor,” Harry fired back.</p>\n<p>Draco made a face. “It can’t really be much worse than this <em>bed</em>. Do your loving relations stick Bruising Peas under the mattress or something?”</p>\n<p>Aunt Petunia was already in the kitchen frying bacon; she jumped nervously, eyes darting at Draco, when they came in. “I prefer my eggs shirred,” Draco informed her. “Don’t overcook the bacon. Where’s the <em>Daily Prophet?</em>” he asked Harry, then sulkily took the <em>Times</em> from where it was waiting at Uncle Vernon’s place and sat down in his chair with it, muttering about ignorant Muggles.</p>\n<p>Harry looked between him and Aunt Petunia, half fascinated. She hesitated and opened her mouth to speak. Then Draco looked up from the paper and frowned at the teapot, already on the table. It jerked out from under its cozy, floated over to his place, and poured him a cup. The milk and sugar trundled over to help.</p>\n<p>Aunt Petunia went to the fridge and got out the eggs and cream. She made some for Harry, too, and for once he even got bacon.</p>\n<p>“How’d you do that, with the teapot?” he said to Draco, after they’d gone out with their brooms again. </p>\n<p>“Do what?” Draco said.</p>\n<p>“You made the teapot pour!” Harry said.</p>\n<p>Draco looked at him as if he were deranged. “That’s what teapots <em>do</em>, Potter. Pour tea.”</p>\n<p>“Usually you have to pick ours up with your hands,” Harry said.</p>\n<p>Draco sniffed. “You’ve no one to blame but yourself if your crockery is undisciplined, Potter. Naturally the dishes will take advantage of you if you let them sit around getting lazy.”</p>\n<p>It was another overcast day. They shot up over the low cloud layer into brilliant sunshine and spent the morning racing. Harry won the sprints, but Draco had the edge at distance, even though his Nimbus was a bit slower: he knew all sorts of ways to coax his broom along.</p>\n<p>At lunchtime, Harry surreptitiously tried frowning at the salt cellar, but it didn’t do anything. Draco noticed, naturally. He sniggered and then crooked a finger at it, and the cellar slid right across the table to his plate and sprinkled his potatoes.</p>\n<p>The sky had cleared by the time they had finished: no more flying. “What else do you <em>do</em> in this miserable slum?” Malfoy said, contemplating the length of Privet Drive with all its neat and tidy houses.</p>\n<p>“I mostly spend it inside my room reading,” Harry said. Usually he was locked in, anyway. “There’s a park down by Magnolia Crescent.”</p>\n<p>“Is there anything interesting in it?”</p>\n<p>“Um. No,” Harry said. “It’s just a park.”</p>\n<p>Draco was deeply unenthusiastic. There wasn’t much other choice, though, so they walked down anyway. They stopped by the pond and he chucked stones at it irritably, skipping them a dozen times at a go. It was getting hot with the sun out. Dragonflies buzzed, and Harry yawned and stretched out on his back on the grass. After a while, Draco sighed and lay down next to him, arms brushing. A steady glow of warmth and comfort radiated out through Harry’s entire body. He felt heavy and sleepy, a faint noise like distant windchimes tinkling. He squinted and the barely-there little yellow butterflies fluttering over Malfoy’s head resolved into pond pixies, giggling and darting around.</p>\n<p>“Where’d they come from?” Harry said.</p>\n<p>“They’re everywhere,” Draco said, yawning, and waved a hand lazily through the cloud. “They like wizards: we give off magic. At least, <em>some</em> of us do,” he added, but it was a halfhearted jibe at best.</p>\n<p>Harry spent the next ten minutes trying to persuade himself he couldn’t just lie here tucked up next to Malfoy. His eyes just kept drifting shut, and his limbs didn’t want to move.</p>\n<p>“Oo, look at the lovebirds,” a sneering voice said. “All cozy with your new <em>boyfriend</em>, Potter?”</p>\n<p>“Hi to you too, Dudley,” Harry said, resignedly, opening his eyes.</p>\n<p>Dudley sniggered. He’d come to stand over them, his buddies Piers and Malcolm already with him. He was still wearing his Smeltings uniform. “Should’ve known you were bent, Potter. What, aren’t you going to introduce us?”</p>\n<p>Draco pushed up on one elbow. “My name is Draco Ignatius Abraxus Malfoy, thirty-seventh of my line,” he said, as cold and drawling as he could go. “You needn’t bother to tell me yours.” He reached out, cupped a handful of the pixies out of the air, and whispered something to them briefly before he blew them off his palm straight at Dudley.</p>\n<p>Dudley swatted at the pixies, scowling, and then started swatting again, more urgently, his eyes going wide. The pixies were darting at him and the other boys, pulling their hair, their clothes—Harry saw one dive in, land on Dudley’s ear, and— “Ow!” Dudley yelled. “Ow! Get off!” and smacked himself on the side of the head: the pixie had <em>bitten</em> him. He and Piers and Malcolm all started backing away, waving their arms around in the air more and more wildly, tiny red spots flaring as the pixies kept finding bare spots to bite. They finally turned tail and fled, jumping and hopping and smacking themselves all over, the cloud of pale yellow butterfly-wings trailing after them.</p>\n<p>Harry laughed so hard his stomach hurt, falling back to the ground. Draco was wheezing with laughter too, and then he thumped Harry hard in the shoulder. “I <em>knew</em> you couldn’t be such a ridiculous prig as you make out at school. Honestly, Potter, what d’you do it for?”</p>\n<p>Harry stopped laughing. “What?”</p>\n<p>“You can’t <em>really</em> think those useless lumbering clods are as good as we are!” Draco said, waving an arm after the fleeing gang. “Just <em>look</em> at them!”</p>\n<p>“<em>Dudley</em>’s an arsehole!” Harry said. “That doesn’t mean all Muggles are like him. For that matter,” he added pointedly, “I could name a wizard or two who’s as bad as he is.”</p>\n<p>Draco rolled his eyes. “Oh, I’m so <em>sorry</em>, have I hurt your ickle feelings, Potter? I’m not in the business of pretending the pathetic aren’t. Don’t try to tell me you didn’t like watching those Muggles run.”</p>\n<p>Harry sprang up, fists clenched. He could have punched Draco in the face, except he’d already learned the hard way back at Hogwarts that it would’ve felt like punching himself in the face twice as hard. He turned and stalked away instead, ignoring the burning tug in his belly until Draco finally had to get up and follow, seething on his heels the whole way back to the house. There was a lot of noise and yelling going on in the yard, Aunt Petunia and Uncle Vernon chasing Dudley around with tea towels trying to smack away the pixies, all of them red-faced and ridiculous.</p>\n<p>Harry <em>did</em> like seeing it. He couldn’t help the mean hot glad feeling in his belly. He jerked open the front door and went inside, teeth clenched over it. Draco caught up and shoved him in the middle of his back; Harry stumbled down the hall and turned.</p>\n<p>Draco had put one hand on the wall to brace himself against the return shove, like he <em>had</em> thought through how to get around it. “You can’t bear anyone looking down at you for your filthy Muggle relations, is that it, so you’ve got to pretend there’s nothing wrong with their sort—”</p>\n<p>“<em>Nothing wrong with them?</em>” Harry said, savagely. “I <em>hate</em> them!” He grabbed the cupboard door and jerked it open. The little cot with its threadbare stained blanket was still in there, buried under umbrellas and shoeboxes and dust, spiders scurrying into the corners away from the light of the one swinging bulb. “Tell me, how d’you like <em>this</em> room? That’s where they kept me, before my letter came. Anything odd happened round me, they’d lock me in there day and night, weeks sometimes. Once they forgot I was in there and didn’t feed me for two days. When they did let me out, they treated me like a house elf—made me scrub dishes and do the sweeping up, talking all the time how generous they were taking me in at all. They never told me anything about magic. They even told me my mum and dad died in a car crash. <em>I hate them</em>, and I’m not going to be anything like them, and <em>you are</em>, with all your <em>rot</em> about being better than other people and looking down your nose at anyone who’s not your kind.”</p>\n<p>He slammed the cupboard door and shoved past Draco before he could say anything else back. He went upstairs into his own room and shut the door. He could faintly hear the Dursleys still howling outside on the lawn, Dudley gone into blubbering now. He gritted his teeth, and then he went to the window and opened it and called Hedwig. “Do you think you can run off those pixies?” he asked her. She hooted with faint indignation, like he really had to ask, and swooped away.</p>\n<p>The ache had been steadily climbing. Harry breathed deeply through his nose and went out and crossed the hall to the other bedroom. Draco was sitting in the one armchair glaring at a school book, not really reading it. Harry ignored him and went over to the bed and threw himself on it flat on his back. It wasn’t like touching, but this was close enough to be bearable.</p>\n<p>Draco said abruptly, “I’d have killed them.”</p>\n<p>“Easy for you to say. I bet you’ve never actually thought about killing anyone.”</p>\n<p>“I’ve thought about killing <em>you</em> twice a day since first year.”</p>\n<p>“Have you?” Harry said. “<em>Really</em>? Not just how great it would be if I was gone, but thought it through? How you’d do it, every step of the way, imagined me lying dead on the ground in front of you after?” Draco didn’t say anything. “Killing people’s a lot harder than it sounds.” Harry rolled on his side to face the wall. “Hermione says that’s a good thing,” he added after a moment. “Otherwise it means you’re a psychopath.”</p>\n<p>#</p>\n<p>The Dursleys avoided them like plague, after. Aunt Petunia lay in wait for Harry the next morning and in a hissing whisper informed him when she’d leave their meals, eyes darting every moment to the bathroom door where Draco had just gone into the shower. She retreated to her room as soon as she’d said. The food stayed at dinner party levels, too, like she was afraid if it wasn’t, Draco would track her down and make a fuss.</p>\n<p>“As I <em>would</em>, if it got worse than <em>this</em>,” Draco said, turning his nose up at a plate of Chicken Forestiere, another of Aunt Petunia’s specialities.</p>\n<p>“Will you stop complaining for once?” Harry said. “It’s almost as good as Hogwarts.”</p>\n<p>“You say that like the Hogwarts mess is anything other than revolting,” Draco said. “My father says it’s meant to build character.”</p>\n<p>Malfoy could say whatever he liked; Harry would take it. He’d—take all of it, actually. Decent grub, scarcely seeing any of the Dursleys between the hours of one day, no chores and no bullying, not being locked in his room, and even <em>company</em>. Which Draco oughtn’t have been, and wasn’t if they <em>talked</em>, but they didn’t need to talk. England obligingly provided clouds six days in seven, and they both spent every minute they could flying. And flying with Draco was brilliant. He really was good to begin with, and though he’d always been a lot lazier about practice than Harry, after a couple of weeks of going from morning to night, he made it up, and they were pretty evenly matched. Harry ashamedly had to admit to himself it was even more fun than flying one-on-one with Ron, who couldn’t catch the Snitch one in ten. </p>\n<p>He didn’t mention that in his letters. With Hedwig loose, he could actually write, too, and Hermione and Ron wrote to him like they’d worked out a schedule—knowing Hermione, she had—so he was hearing from one of them practically every day. Ron’s letters always ended <em>Write back soon so I know he hasn’t killed you!</em> Harry didn’t fancy trying to explain anything about how it was going.</p>\n<p>Especially anything about the nights. At all.</p>\n<p>In mid-July, though, they hit a stretch of beautiful hot sunny days. After five days Harry woke up to find Draco scowling out the window at the golden weather, and he turned the scowl on Harry. “I am <em>not</em> moping around this benighted backwater for another minute,” he announced.</p>\n<p>Harry sighed. “What d’you want to do about it, Malfoy? We can’t help the weather.”</p>\n<p>“We can help the <em>location</em>,” Draco said. “Get dressed, Potter, we’re going to London.”</p>\n<p>Harry blinked. “What, on the train?”</p>\n<p>“<em>I</em> don’t see a properly certified carpet around here, do <em>you?</em>” Draco said.</p>\n<p>“My uncle’s not going to give me train fare,” Harry said.</p>\n<p>“<em>Money</em> is not a concern,” Draco said, and it turned out not to be: when the conductor came round, he reached into a leather sack tied onto his belt and produced a fifty pound note.</p>\n<p>“You’d better not be about to get us taken up for counterfeit,” Harry muttered under his breath, watching it go.</p>\n<p>“Don’t be idiotic, Potter,” Draco said. “It’s just a ’change purse. A service Gringotts offers their elite clientele,” he added, smug, but for once Harry let him get away with it, watching the countryside whip by. They came out in Kings Cross station and Draco took him into a cupboard marked <em>No entry unless authorised</em> and through its back wall into a little cul-de-sac just off Diagon Alley. “Civilization at last,” Draco sighed, and made a bee-line straight for the Leaky Cauldron.</p>\n<p>He even stood Harry lunch without making anything of it, probably because he didn’t think anything of it; the bill came to him and he scrawled his name across the bottom and it was whisked away without any further ado. “Your parents let you spend whatever you like?” Harry said, half incredulous. Not even the Dursleys went that far with Dudley, which was just as well, since he’d probably have eaten them straight into a second mortgage. </p>\n<p>“Naturally they trust my judgement,” Draco said loftily.</p>\n<p>They spent the afternoon wandering around the shops. They both stared wistfully in at the window at the just-released Nimbus 2020, which had eyes painted on the broomstick just above the twigs behind the rider’s seat, and claimed to convey perception of the entire field of play. Harry nudged Draco. “If you’re so rich—”</p>\n<p>“I’m expected to be <em>responsible </em>with my money, Potter,” Draco said snottily, but when Harry gave him a hard look of disbelief he scowled and muttered, “And I’d be cut off if I tried to buy anything that expensive.”</p>\n<p>Harry had a few Galleons in his pocket, so he got a broomstick tuning kit. Malfoy did pick up a Cup-quality Snitch, nearly twice as fast as the ones they used at Hogwarts. “Too much for you to handle, Potter, do you think?” he said, holding it up.</p>\n<p>“I’ll take <em>you</em> best two of three,” Harry said.</p>\n<p>“We’ll see,” Draco said, eyes narrowing, and put down his money.</p>\n<p>They didn’t get back to Little Whinging until after dark. Harry picked up a map of the Surrey line at the train station. “We can try taking our broomsticks to the old RAF station near Kenley, if it’s still nice tomorrow,” he said. “Bet there won’t be anyone round there during the week.”</p>\n<p>“Right,” Malfoy said, yawning.</p>\n<p>It wasn’t a long walk back to the house. The Dursleys had already gone upstairs. They ate the waiting supper and went upstairs and got into bed. “Night,” Harry said, switching off the light.</p>\n<p>“Night,” Draco said.</p>\n<p>Nothing that happened after they said goodnight counted. They’d made a rule of it.</p>\n<p>#</p>\n<p>The rest of July slid by as easily as a term at school, except with no work and more sunshine. They spent most of the two weeks flying at the RAF base, until the day they accidentally discovered to the dismay of everyone involved that the airfield was also used by the local hang-gliding club, and they had to make a dash for it. “I still think we should just have Obliviated him,” Draco said peevishly, panting and damp inside the cover of a big cumulonimbus.</p>\n<p>“Then the Ministry would hear of it for sure, even if he hadn’t fallen straight out of the sky and broken his neck!” Harry said. “He’s not going to tell anyone he saw two kids flying on broomsticks, they’d be sure to think he’d gone daft.”</p>\n<p>Harry had never seen Uncle Vernon as happy as the day they changed houses. He was actually humming the whole while as he carried the trunks down to the car and drove them the two hours west. Draco gave directions at the end in short, clipped tones, the narrow road plunging into a dense forest without so much as a turnoff for miles. But even when it petered out into gravel, Uncle Vernon didn’t make a peep of complaint: only when he took a turn and the road crossed a narrow strip of wet marsh and came up to a pair of iron gates across the road. “What’s this?” he said, slamming on the brakes. “Have you taken us the wrong way? It’s a dead end!”</p>\n<p>“It’s my <em>drive</em>, you blithering Muggle,” Draco said icily. “How does this glass open?” Harry reached over him and rolled down the window, just as Uncle Vernon screamed: pale arms had started to claw out of the marsh, heads emerging, ghastly white things with empty eyes. “It’s all right, it’s <em>me</em>,” Draco said loudly out the window, and they all slid back into the murky water, never taking their eyes off the car, as the gates creaked open on their own.</p>\n<p>Uncle Vernon shot down the drive as fast as the car could go, gravel pinging the undercarriage all the way. In a minute the gates were out of sight behind them on the twisting road, and it kept going after that, that dark forest still everywhere on all sides with no sign of a break. “Where’s the <em>house?</em>” Uncle Vernon finally demanded, and then said, “Ah, finally!” as it came into view: a three story stone cottage with a pointed roof set into a low stone wall running across the road, with another gate set into it. He pulled up to the gate and parked.</p>\n<p>“What an unspeakable idiot you are,” Draco said in a contemplative tone, not making any effort to get out. A man in leather clothing had just come out of the house, but it wasn’t his dad. “Hello, Winchley.”</p>\n<p>The man bowed. “Welcome home, Master Draco,” he intoned, and turned to wave at the gate, which swung open.</p>\n<p>“Well?” Draco said to Uncle Vernon sarcastically. “Are we ever getting there?” which Harry was beginning to wonder, himself, and Uncle Vernon must have, too; he picked up more and more speed down the road until they came around a turn and the woods suddenly broke open completely, and he slammed to a halt, staring. Harry stared, too. They weren’t up to the house, yet: the house looked like it was another mile straight away from them, down a long drive between eight-foot-tall hedges. It wasn’t hard to make out at the distance, though. It had four towers rising up into the sky, all golden stone and enormous mullioned windows and delicate ironwork, like the National Trust house near Little Whinging that Aunt Petunia liked to visit at weekends in spring. Only it was bigger.</p>\n<p>Draco sighed. “Must I ask why we’ve stopped <em>again?</em>”</p>\n<p>“You don’t live <em>there</em>,” Harry said, still staring.</p>\n<p>“I certainly don’t live in the <em>gatehouse</em>,” Draco said snidely.</p>\n<p>Harry had always figured when Malfoy went on and on about his money and his house that he was showing off just to be unbearable. On some level, he didn’t really believe there was anybody this rich who wasn’t the Queen, or at least American.</p>\n<p>After a moment, Uncle Vernon drove on, wearing a confused expression. His eyes repeatedly darted to the mirror, taking looks back at Draco. It was probably throwing his brain for loops trying to work out whether the gigantic heaps of money trumped the magic.</p>\n<p>When he finally pulled up in front of the house, the front door was already open, and Draco’s mum was standing at the top of the stairs. She wore a long white dress with robes of spiderwebby black lace over it, her white-and-black hair pinned up and her hands folded in front of her. Harry swallowed.</p>\n<p>Draco swallowed too, and got out of the car. She came down the stairs and met him at the foot. She didn’t hug him or anything, just touched his face with one hand. Her mouth trembled for a moment. “I’m glad you’re home safe, darling,” was all she said, before looking over at Harry. She stared at him intently for a long moment, and then she put on a smile that didn’t get anywhere near the rest of her face and held her hand out. “You must be Harry Potter.”</p>\n<p>“Er,” Harry said. “Yeah.” He stared at her hand: it definitely wasn’t in the right position for shaking. He shot Draco a look, but Draco wasn’t being any help at the moment; he was standing rigidly still, his mouth downturned, like he wasn’t even happy to be home after all his endless complaining about everywhere else. After a moment Harry took her hand in his fingers and fumbled a sort of bow over it without actually kissing it.</p>\n<p>She at least took her hand back, afterwards, and glanced over at Uncle Vernon, who’d uncertainly got out the trunks. She said to Harry, “Is this your driver?”</p>\n<p>“His uncle,” Draco said briefly.</p>\n<p>“Oh, I see,” Mrs. Malfoy said. She put the smile back on. “I hope Draco has minded his manners properly while staying with you.”</p>\n<p>“Er,” Uncle Vernon said.</p>\n<p>Mrs. Malfoy smiled and nodded just as if he’d said <em>oh yes beautifully behaved</em>. “Please convey my thanks to your wife. There’s no need to worry about the trunks. Have a pleasant drive home.” She turned and went back up the stairs into the house, a clear dismissal. Uncle Vernon stood staring up after her a moment. Then the trunks abruptly vanished with two loud bangs, and he jumped a foot straight up, then flung himself back into the car and peeled out, gravel and dust spinning up from the wheels as he shot away.</p>\n<p>Harry stared after the vanishing car, then turned round to face the house. It <em>looked</em> like a National Trust stately home, but it didn’t <em>feel</em> anything like one. He couldn’t imagine tourists going in voluntarily. It loomed over him, all the windows dark and the front door standing open like a mouth. Mrs. Malfoy had already gone inside, and Draco was climbing the stairs after her, the leash tugging away. Harry squared his shoulders, reminded himself the Malfoys couldn’t do anything to him without hurting Draco, and followed him in.</p>\n<p>The light from the huge windows didn’t seem able to get far into the house. There wasn’t really an entryway or anything: they came right into a cavernous great hall, the walls paneled in heavy wood and draped with hangings, fireplace roaring and hanging lanterns full of flickering magical light. Mrs. Malfoy didn’t pause: she walked through the room and disappeared through a door at the far end. Harry followed her and Draco out of the room and up a big stone staircase to the first floor.</p>\n<p>At the top she turned to face Draco. The smile had gone, and her lips were pressed together. She didn’t look happy—worried, maybe. Harry eyed both of them warily, wondering what was going on. “Your father is in his study,” she told Draco.</p>\n<p>Draco didn’t move a moment. Then he jerked a single nod and turned and went to the wooden door at the side of the landing and walked through it. Harry uncertainly took a step after him. “I’ll show you to your room,” Mrs. Malfoy said, sharply, and started walking up the next flight of stairs.</p>\n<p>“I can’t,” Harry said, louder than he meant to: his voice seemed to echo weirdly off the dark walls. She turned, a few steps up, and stared coldly down at him. He cleared his throat. “I can’t go that far from Draco.” He was already too far: Harry could feel him drawing away, on the other side of the door.</p>\n<p>She stood looking down at him, her mouth a hard straight line. “Very well,” she said abruptly. “You can wait for him here, then.” Then she whirled and was gone, skirts swirling behind her as she vanished up the stairs. Harry hesitated, then he went to the door and opened it. There was a gigantic sitting room on the other side—smaller than the one downstairs, but still bigger than all the Dursleys’ house put together. A vast tapestry ran the entire length of the wall, with velvet-cushioned wooden chairs lined up in front of it.</p>\n<p>After a moment, Harry sat down. Draco was somewhere behind the last door at the end of the room. Harry felt him there like a piece of himself that had wandered off by accident. But the walls swallowed noise: he could faintly hear a buzz of muffled voices, but he couldn’t make out the words or even who was talking. The talking went on a while. Harry got up and started looking at the tapestry: it was a woven picture of the entire house, with little woven figures moving through it, wearing really old clothing, neck ruffs and big dresses and balloon trousers with hose. He got interested and started following some of them around. There was even a little stray cat, and he was crouched down to watch it lapping at a dish of milk in the kitchens when the blow cracked down on his shoulders, sharp and hot, and he nearly fell to his knees with a gasp of surprise.</p>\n<p>He was turning, groping for his wand, before he realized it wasn’t <em>him</em>, being hit. The second blow landed, lower on his back, a long hot stripe of pain. Harry swallowed a yell and took a step towards the door—then he heard it, right as the pain bloomed again. The thwack of a rod, long and narrow, coming down on bare skin. He stood gasping. He didn’t know what to do. He couldn’t go <em>in</em> there? Two more blows came—carefully, deliberately spaced, as if he was meant to be just getting his breath back before the next one landed and knocked it right back out of him.</p>\n<p>Somehow that finally pushed him into movement. He gripped his wand in his fist and took a step towards the door. Another blow made him stumble, though, and then—then the next one didn’t come. Harry had his hand on the doorknob. He stood, hesitating, and then it jerked open under his hand. Draco was on the other side. His face was flushed and sweaty, his eyes bright and wet. He glared at Harry, furiously, and jerked his chin forward: <em>get out of my way!</em> Behind his back, Harry could see Lucius Malfoy seating himself in a big armchair behind a desk, and picking up a book he’d left marked on the table. He glanced up at the door and caught Harry’s eye for a moment with a narrow, reptilian look. Then he looked away, and went back to his reading even as Draco forced Harry back and pulled the door shut.</p>\n<p>Harry was shaking with anger, his fist clenched tight around his wand. Draco shoved past him and walked back to the stairs. “What the hell was that?” Harry said, through clenched teeth, following him. “Draco!”</p>\n<p>“What do you <em>think</em>, Potter?” Draco said icily, over his shoulder. “In my family, there are consequences when you’re stupid enough to go bumbling into a binding-spell, much less when you do it with an enemy of your house.”</p>\n<p>He didn’t act like it was anything new. He’d been <em>expecting</em> it, Harry realized, and suddenly remembered, horribly, that time the students had come back from Christmas break and Draco had spent a few days limping and looking a little ill. <em>Probably ate too much roast baby unicorn</em>, Ron had said, and they’d snickered about it. He’d even overheard Snape saying, “Mr. Malfoy, you should see Madame Pomfrey.”</p>\n<p>“I’m fine,” Draco had said. “I just had a flying accident over break.” Right, of course he had. When you had a flying accident, why wouldn’t you just go to the infirmary?</p>\n<p>“Bet the bastard didn’t mind he got to beat me right along with you,” Harry said savagely. “If he tries it again while I’m here, I’m going to hex him.”</p>\n<p>Draco wheeled around on him furiously. “Don’t you <em>dare</em> threaten my father!”</p>\n<p>“He beat you with a stick!” Harry yelled. “At least Uncle Vernon doesn’t pretend he <em>loves me</em>.”</p>\n<p>“Shut up,” Draco snarled, and whirled and stormed up the stairs—too fast, it was making his back hurt and his head spin. Harry gritted his teeth and caught up to him, and got Draco’s arm slung over his shoulders just as he sagged and almost missed his footing.</p>\n<p>“Come on,” Harry muttered. “Which way’s your room?”</p>\n<p>Draco’s room was ridiculously huge, too, with an enormous four-poster wooden bed in the middle of the back wall draped all in dark blue velvet. Harry got him over to it, and Draco crawled onto it and lay face-down with his feet sticking off the side, head pillowed on one arm. He didn’t talk. Harry stood by the side of the bed, his hands clenching and working. He could feel the throbbing pain of all the strokes, only getting worse.</p>\n<p>He turned away and rummaged in the desk and found a pair of scissors, and cut Draco’s shirt off him. Draco didn’t protest. The strokes had left big, inch-wide angry red welts, a few of them with broken skin, trickles of blood the black shirt and trousers hadn’t shown. There were a few pale older scars on Draco’s back beneath them—cuts <em>left</em> to scar, even though Madame Pomfrey or any mediwizard could have healed anything like that with a wave of a wand. Harry wished he could call Hermione and ask her what to do; he wished he could call <em>Dumbledore</em>, who’d know what to do about Draco’s father beating him bloody on a regular basis.</p>\n<p>He got up and went to the bathroom. If he’d been at home he’d have given Draco a fistful of paracetamol out of the medicine cabinet, but the Malfoys probably didn’t believe in anything as Muggle as painkillers. The cabinets had some unlabeled ointments in jars, but he didn’t know what any of them did, so he just got a cold flannel instead.</p>\n<p>Draco made a choked gasping noise the moment Harry tried to lay it down on his back, and Harry jerked back and stared: the welt where his fingers had brushed it was melting away. Warily, he tried just barely touching the edge of the welt—Draco gasped again. The puffy swollen flesh was deflating, the redness fading straight out of it. Harry could feel the ache of it disappearing from his own body. He slowly traced each welt with just the tip of his finger, as carefully as he could, each one sinking straight away into smooth unmarked skin. Even the ones where the skin had broken, the cuts closed right up, blood drying up and flaking away. Harry lifted his hand and stared down at it: there was nothing left but the few faint scars—then he put his hand on one of those, too.</p>\n<p>Nothing happened, to start. Harry gritted his teeth and tried to—<em>pull</em>, like tugging on the leash, only on purpose. Abruptly he felt a fresh sharp pain in his back, flaring for just a moment, and then the scar wiped away under his fingers like a chalkmark. Draco was panting, and he pushed himself up and stared at Harry. “What are you <em>doing?</em>”</p>\n<p>“I don’t know!” Harry said. They stared at each other.</p>\n<p>Draco swallowed and after a moment muttered, “Well, stop it.” He got off the bed and went to the wardrobe. Harry stayed sitting on the bed, staring down at the heap of ruined shirt, the bloodstains showing dark against the fabric.</p>\n<p>“It’s not right,” he said through his teeth.</p>\n<p>Draco was buttoning up a clean shirt in front of a tall mazy-glassed mirror. He paused, staring into it: even in the reflection he wouldn’t look over and meet Harry’s eyes. “Try not to be stupid,” he said after a moment. “<em>You</em> know what’s coming. Or <em>who</em>.”</p>\n<p>“Vol—”</p>\n<p>“Don’t <em>say it</em>,” Draco said. “What d’you think <em>he’s</em> going to think of it, if he comes back and finds my father hosting <em>The Boy Who Lived</em> in his house, finds my father’s let his son and heir get <em>Fettered</em> to Harry Potter?”</p>\n<p>“I don’t know,” Harry snapped. “Maybe that you’ve all come to your senses and don’t want anything to do with him?”</p>\n<p>Draco turned round, his face tight. “Right in one, Potter,” he said. “Think he’s going to take that well, do you? ‘Nice having you, no hard feelings, take care, never mind that silly oath of loyalty?’” Harry stared at him. “He’ll <em>kill my father</em>, you idiot.”</p>\n<p>“So your father <em>beat</em> you to prove he’s really loyal?”</p>\n<p>“I suppose you wouldn’t take a caning to have <em>your</em> parents back,” Draco said.</p>\n<p>Harry jumped off the bed and faced off with him. “And <em>then</em> what, Malfoy? When You-Know-Who says right, I’ll forgive you that one, now go murder a dozen wizards for me, <em>really</em> prove you’re loyal—”</p>\n<p>Draco looked away. “A bunch of blood traitors and Muggle-borns—”</p>\n<p>Harry shoved him, didn’t even care that he nearly fell over himself, and Draco turned and swung a fist at him wildly. It connected with Harry’s cheek and they both went down, like hitting the floor in twice as many places at once, and started rolling around punching each other furiously. Harry couldn’t keep doing it, it was like beating your own head against a wall, but it almost felt good for a moment until the doubling pain flattened them both and they went limp, crumpled together and half sobbing for breath.</p>\n<p>“What do you want me to say?” Draco said, his voice cracking. There was blood running from his lip; he wiped it away. His face was twisted up, tears sliding out of his eyes. “I don’t get to walk away.”</p>\n<p>“You expect me to feel <em>sorry</em> for you?” Harry dragged himself up to his feet, stood over Draco with his fists clenched. “Your father had a choice, didn’t he? He <em>picked</em> Vol—<em>fine</em>, he picked You-Know-Who. My family didn’t get to choose. He came to our house, murdered my mum and dad—he tried to kill me in my <em>crib</em>. That’s what your dad signed on for, and if you sign on for it, too, don’t expect me to care that you’re doing it for him. I <em>wouldn’t</em> murder someone else’s family to have mine back. I <em>wouldn’t</em>, and if you would, you’re as big a beast as he is.”</p>\n<p>He turned and limped out of the room, his whole body aching. The leash didn’t want him to go, but he shoved through the feeling. There was another bedroom next door: his trunk was in it. Harry went inside and slammed the door. His stomach was roiling. He snuffled into his sleeve, wiping his eyes. After a moment, he went and sat down against the adjoining wall. He could feel Draco sitting on the other side, back to his.</p>\n<p>#</p>\n<p>Dinner showed up on a tray at the stroke of eight—really showed up, it just appeared on the table in the corner of the room, complete with big silver candlestick and three plates stacked up along with a bread plate and a finger bowl and nine pieces of silverware. Harry went over and stared down at it: there was only a tiny bit of food on the top plate, a mini pancake sort of thing with odd stuff he didn’t recognize piled on top of it, thin circles of red and yellow, a single dollop of cream, a green leaf on top. He wondered if it was some sort of magic thing that filled you up in a bite. Or maybe just poisoned you: Harry wasn’t sure at this point that he <em>would</em> put it past Lucius Malfoy to make his own son ill just to get him, after all. <em>That</em> would show how loyal he was, wouldn’t it.</p>\n<p>He had to eat at some point, though, so he picked it up and popped it into his mouth. It tasted—it did taste almost like magic, weird and a bit crunchy and a bit sour and then this odd pop of something spicy and unrecognizable out of nowhere at the end, but after he swallowed, he was still just as hungry as he had been. At least he didn’t feel immediately poisoned, so probably they weren’t going to kill him tonight, anyway.</p>\n<p>He wasn’t going to starve either, as the top plate vanished and some more strange-looking food appeared on the next one down, and also a roll of bread showed up. Harry didn’t really know what to make of it all: it didn’t taste or look like food, exactly, although he filled up eventually. Some of the food really was magic, including one clear lump of jelly sitting inside a bowl of soup that had tiny live fish swimming around inside it—Harry gave that a wide berth—and the dessert, which was a gingerbread house with working door and a fireplace really going, puffs of warm smoke coming out the chimney. He watched it too fascinated to eat until suddenly the oven popped open and a tiny gingerbread man jumped out and ran straight out the door of the house and off the plate, and started racing around the table squeaking “can’t catch me!” in a maddening high pitched voice.</p>\n<p>Harry <em>couldn’t</em> catch him, though he nearly took out the wine glass and the pepper mill trying. The gingerbread man waggled his tiny arms jeeringly from behind the candlestick while Harry glared. After another five minutes of failure and taunting, Draco barged into the room. “Honestly, Potter,” he said, grabbed the side pitcher of tarry molasses-smelling stuff, and poured it across the gingerbread man’s path. The cookie dashed into it, stuck fast, and stood there yelling. “There, go ahead.”</p>\n<p>“Um,” Harry said. He wasn’t sure how he felt about eating it.</p>\n<p>Draco rolled his eyes and snatched it and popped it in his mouth. “It’s a <em>cookie</em>.”</p>\n<p>“How does it <em>do</em> that?” Harry said, peering inside the house again.</p>\n<p>“It’s an American wizarding recipe,” Draco said. “My great-grandmother brought it with her. If you’re not going to eat the men, start eating the house before it makes more.”</p>\n<p>“What, I’m shocked, one of your relatives married a colonial?” Harry said. He broke off the chimney and bit into it: the gingerbread was warm through and just the right sort of chewy and soft.</p>\n<p>“She was proper German wizarding stock, of course, they just made their <em>money</em> in America,” Draco said, irritably. He took a bit of the front door.</p>\n<p>Harry was pretty sure that he’d learned in Muggle Studies that American wizards intermarried more than anyone else, and there wasn’t a single pureblood line longer than three generations that anyone could prove. He didn’t want to end up punching himself in the head any more, though, so he didn’t argue the point. They picked at the house together while the rest of the dishes cleared themselves off.</p>\n<p>“You don’t eat like this every night, do you?” Harry said.</p>\n<p>“What, in a civilized manner?” Draco said. “When I get the chance I do. This was always my favorite pudding, when I was little,” he added, taking another piece of sugar-glazed roof.</p>\n<p>It had gone dark outside, but there were lights coming up throughout the gardens outside, bobbing in the air like paper lanterns. After they finished, Harry said, “Look, can we go out? I want a walk.”</p>\n<p>“Fine,” Draco said after a moment, and led him downstairs and through a back door. They wandered along the paths winding through the hedges and formal gardens. The air was full of the smell of summer flowers, the magical lights glittering everywhere, the windows of the house shining. Draco walked without even looking around, eyes mostly fixed on the ground, and fine, Harry <em>did</em> feel sorry for him. He didn’t know how you’d give up—not the stupid house, but <em>belonging</em> to it, to a family.</p>\n<p>He glanced up at the house as they came back inside. Narcissa Malfoy was standing at a window on the second floor, watching them—watching Draco. She met Harry’s eyes a moment, and then she turned away and vanished inside. “Well?” Draco said, standing inside the door.</p>\n<p>“Yeah,” Harry said, and went in.</p>\n<p>#</p>\n<p>Dear Harry,</p>\n<p>I’m really concerned! I looked up what you’re describing, being able to heal a cut Draco got, and that’s an advanced form of pain-sharing. It shouldn’t be happening unless the  bond’s become really strong. Have the two of you been doing anything that might make you more in sympathy with each other? What I mean is, if you’ve been doing things that make you both feel the same way—angry at the same time, or happy at the same time—that’s the sort of thing that can intensify the bond.</p>\n<p>You should completely avoid touching him. Definitely <em>don’t</em> heal him again! I wrote to the St. Mungo’s archivists, and there are seventeen cases in the literature where a Fettering Curse has transmuted into an Indissoluble Bond, and fifteen of those involved one of the cursed pair healing the other of a serious injury. The other two pairs had a baby together, which obviously isn’t something you need to worry about, although you probably shouldn’t have sex with him, either, just to be safe. (That’s a joke!)</p>\n<p>Love, Hermione</p>\n<p>#</p>\n<p>Harry stared at the letter. “What’s your Muggle girlfriend on about now?” Draco said, yawning as he stretched his arms over his head in the bed. Harry turned the stare over at him, and Draco frowned and sat up and grabbed the letter out of his hands and read it. His head jerked up. “We could get <em>stuck</em> this way?” They both leaped out of the bed hurriedly.</p>\n<p>They agreed they’d have to spend the rest of the month as far apart as they could manage. “It’s only another four weeks,” Draco said.</p>\n<p>The problem was they couldn’t actually <em>do</em> anything without each other, except sit in their rooms on either side of the wall and read, which wasn’t helping at all with the <em>sympathy</em> part, because it left them both feeling the same way: desperately bored out of their skulls. When Harry thumped his head backwards against the wall and heard an echo of Draco doing the exact same thing at the exact same time, he gave up. “We need to find something you want to do that I’ll hate, and something I want to do that you’ll hate, and take turns,” Harry said.</p>\n<p>“Splendid, let’s go and set some Muggles’ houses on fire,” Draco said sarcastically.</p>\n<p>Harry glared. “That’s not funny!”</p>\n<p>Draco folded his arms. “We’re trying to avoid getting <em>bound together for life</em>, Potter! I’m <em>perfectly</em> willing to burn down a few shacks to that end.”</p>\n<p>“No Dark magic, no torturing anybody, and no breaking the law!” Harry said. “I don’t know how your family haven’t all ended up in prison before now.”</p>\n<p>“Money and charm,” Draco said. “All right, fine, I want to go to the seaside.”</p>\n<p>“Um,” Harry said. “That sounds like fun.”</p>\n<p>Draco scowled. “Skiing? I could probably prevail upon my mother to take us.”</p>\n<p>Harry shrugged helplessly. He’d never gone, but he was game to try.</p>\n<p>“You come up with something, then!” Draco snapped.</p>\n<p>Harry wasn’t really used to trying to think of things he wanted to do during the holidays. He’d never had much of a choice in the matter. “Wait, I know!” he said. “Let’s go to the pictures.”</p>\n<p>“Why wouldn’t I like going to the pictures?” Draco demanded. “Unless you want to see something <em>stupid</em>.”</p>\n<p>“It’s Muggle, isn’t it?” Harry said. “Why do you go?”</p>\n<p> “Even ants can build something impressive if you give them enough time,” Draco informed him, with a superior air. “It doesn’t mean I want to pal around with them.” Then he paused, and Harry got a horrible sinking feeling in his stomach even before Draco said, “<em>That’s</em> it. I’ll invite Crabbe and Goyle to come for the day.”</p>\n<p>“Oh <em>no</em>,” Harry groaned.</p>\n<p>“Perfect,” Draco said, smugly.</p>\n<p>#</p>\n<p>Crabbe and Goyle came over the next morning. Their capacity to come up with fun things to do was badly hampered by the fact that they couldn’t chase Harry off or beat him up. “Let’s go to the clubhouse,” Goyle said finally, after a massive mental effort.</p>\n<p>“Fancy you remembering that old thing,” Draco said. “All right.”</p>\n<p>The clubhouse turned out to be an ruined old watchtower half-lost in the woods. Apparently they’d used it as a place to play, when they were kids. It looked like a deathtrap, and also amazing. The steps up to the top had fallen down, and the rope they’d hung as kids broke as soon as Goyle tried to put his weight on it, dumping him on his arse. Harry snickered.</p>\n<p>Crabbe and Goyle both glared at him. “We’ll build the stairs back up,” Draco decided, and set them to hauling in rocks.</p>\n<p>Harry perched on the side and watched them grunt and sweat, but he got interested despite himself. “What d’you use this place for?”</p>\n<p>“The usual,” Draco said, waving a hand. “I’d be Merlin, and Goyle and Crabbe would be wizard-knights of the Order, defending Camelot against the wizard-hating Saxons, that sort of thing. Sometimes we’d do Jack the Giant-Killer or defeating the Sphinx.”</p>\n<p>“Not Robin Hood?” Harry said, looking up at the trees overhanging the tower.</p>\n<p>Draco made a face. “Who wants to be a fat friar?”</p>\n<p>They kept tossing ideas back and forth while Crabbe and Goyle built the staircase, until they both got bored of sitting and pitched in to help. Even then, Draco ended up talking to him more than either of them, and Harry ended up having something too much like a good time.</p>\n<p>“<em>That</em> didn’t work,” Harry said to Draco, that night, as they ate dinner in his room—they were both tired of eating alone. “Tomorrow—” he paused and tried to decide what would be worse for Draco; he thought it was a toss-up, but after thinking it through he decided he didn’t completely trust Fred and George to keep in mind that <em>he’d</em> end up feeling anything they did to Draco. “Tomorrow, we’re going to visit Hermione.”</p>\n<p>“Ugh, you’re mad,” Draco said, scowling. “Why don’t we just go visit your relations again, that sounds suitably awful.” </p>\n<p>“<em>I’d</em> hate seeing them, too!” Harry said.</p>\n<p>Hermione met them at the door with a scroll thirty inches long full of questions and marched them into the living room and spent the entire day putting them through detailed experiments. “There’s never been a Fettering Charm properly documented!” she said when Harry tried to get out of the ninth test of how hard a pin-prick had to be before the other one felt it, and if it changed depending on how far apart they were at the time.</p>\n<p>He was grateful when Draco announced, “My mother’s expecting us, Potter, we’re leaving now,” and they made their escape. “Well, that was brilliant,” Draco said to him as they waited for the train. “Tonight we’ll have dinner with my parents.”</p>\n<p>Harry sighed.</p>\n<p>They got back to the Manor around two and spent the afternoon doing school reading. At half past seven Draco stood up. “I’m going to dress.”</p>\n<p>“Er,” Harry said. “You are dressed.”</p>\n<p>“I’m not dressed for <em>dinner</em>,” Draco said. He paused. “You do have something decent, don’t you?”</p>\n<p>What Draco meant by decent was that Harry’s formal dress suit he’d worn to the Yule Ball was an unacceptable set of rags. He dragged Harry over to his bedroom and threw shirts at Harry’s head until they found one he could wear. “There’s no help for the jacket, though,” he informed Harry, impatiently taking over buttoning him up. His fingers brushed the hollow of Harry’s throat—the first time they’d touched each other in a week, and Harry’s whole body rang like a clamoring bell.</p>\n<p>Harry caught Draco’s head and pulled him down. They kissed hungrily, eagerly—Draco’s hands deep in his hair, one kiss after another—they jerked apart.</p>\n<p>“Don’t <em>look</em> at me!” Draco yelled.</p>\n<p>“You’re looking at <em>me</em>!” Harry said.</p>\n<p>Draco grabbed him and kissed him again. His hands slid under Harry’s shirt. “Oh, God,” Harry groaned. It wasn’t even <em>dark</em>. He reached for Draco’s collar—</p>\n<p>Draco managed to pull away. “My tie!”</p>\n<p>They both stood, panting. Draco ran a shaky hand back through his hair.</p>\n<p>“We could just—” Harry said, then he shut his eyes and pulled himself together. “I’m going back to my room.” They finished dressing separately, and carefully didn’t touch at all going down the stairs. </p>\n<p>The dining hall was so long that Harry got to really enjoy the feeling of impending doom, walking towards the Malfoys. Huge iron lamps hung from the high ceiling, and the walls were lined with family portraits. All of them had something uncomplimentary to say about his jacket, and one old fellow with an ear horn halfway down the room said loudly to Draco, “Never try to re-tie a tie, boy! Always take a fresh one if you make a mistake!” Draco scowled up at him.</p>\n<p>Lucius and Narcissa were both in full evening wear, too. She had jewelry on and everything. Draco sat down on her left, but when Harry tried to sit next to him, he hissed, “<em>No</em>, you’ve got to sit on my mother’s right!”</p>\n<p>“That’s all right, darling,” Narcissa said. “We’re only eating <em>en famille</em> tonight, we can be informal.”</p>\n<p>Harry was pretty sure <em>informal</em> didn’t mean what she thought it meant. He gave up trying to keep track of what he was supposed to be using when, since it didn’t seem to help: Draco just reached over at the start of every course and yanked whichever utensil Harry had picked up straight out of his hand and put a different one in. Once it was a <em>completely identical</em> spoon. “You’re just doing this on purpose!” Harry hissed at him.</p>\n<p>“That was for the <em>last </em>course!” Draco hissed back.</p>\n<p>“Why didn’t you give it to me then?”</p>\n<p>“Because you refused the soup, like the mannerless troll you are!”</p>\n<p>“It’s the <em>same spoon!</em>”</p>\n<p>“It wasn’t in the same <em>place</em>,” Draco said.</p>\n<p>Harry defiantly put down the absolutely correct spoon and picked back up the completely wrong spoon and glared at him. Draco glared back.</p>\n<p>The Malfoys had an epergne on their table. It was a good three feet long, shaped like a giant old Viking longship with a dragon’s head at the prow, full of Norman warriors on horseback with their shields, riding up and down with the moving silver waves. They eyed Harry suspiciously, and some of them even fired bee-sting arrows at his fingers when he flubbed some bit of etiquette, which was often. Half the dishes tried to skip serving him, too, and then there was the conversation, which was either gossip about people he didn’t know or Draco’s parents quizzing him on how his classes were going. Harry didn’t mind, he was just as glad to be left out of it, until he wasn’t. “Do you have a favorite class, Harry?” Mrs. Malfoy unexpectedly asked.</p>\n<p>“Uh,” Harry said, after gulping the bite he’d just put in his mouth—some kind of bright red noodles that he devoutly hoped he’d only imagined moving on their own. “Care of—” Draco kicked him under the table, and Harry belatedly remembered the Malfoys’ case against Buckbeak, which made him glare at Draco, but the atmosphere of crushing formality got the better of him, and he said, “Transfiguration’s all right. I like Quidditch best, really.”</p>\n<p>“Hm,” she said, eyeing Draco. “I hear a great deal of it, myself.” She didn’t sound as if she really approved, either. Draco scowled at his plate. “Have you considered your prospects after school?”</p>\n<p>“I’d—like to go for Auror.”</p>\n<p>“Indeed,” Lucius Malfoy said, raising his eyebrow. “A challenging course of study.”</p>\n<p>He had a little smile on his face. Harry clenched his teeth. “At least it’s for something that’s worth it,” he said. “Protecting people.”</p>\n<p>“Yes,” Lucius said, mockingly. “I can see why you might find such a goal compelling.”</p>\n<p>Next to him, Draco looked down at his plate, his mouth tightening. Narcissa Malfoy was watching him. “Speaking of which, I’ve been meaning to ask you, darling,” she said. “There’s been a collapse in the wall along the southern border of the estate. Do you suppose you might mend it for me tomorrow?”</p>\n<p>“Yes, of course,” Draco said.</p>\n<p>“And then we must think of going to get your things for next term,” she said. “It’s only another two weeks until school begins.”</p>\n<p>“Only two weeks more,” Draco said, as they went upstairs.</p>\n<p>“Yeah,” Harry said.</p>\n<p>“It can’t matter much what we do,” Draco said.</p>\n<p>“Yeah,” Harry said.</p>\n<p>Draco opened the door to his bedroom and held it. Harry swallowed and went inside. He turned round as Draco shut the door and then they were kissing again, furiously, tearing at each other’s clothes all the way across the room—Harry fell backwards onto the bed panting, and Draco paused, propped over him. “Wait,” he said, harshly, and got up and went into his bathroom. He came back with one of the jars.</p>\n<p>“What’s that for?” Harry said warily.</p>\n<p>“I’m going to have you,” Draco said. There was color in his cheeks, his eyes glittering. “Take your clothes off.”</p>\n<p>Harry swallowed. The things they definitely hadn’t done at all in the dark hadn’t included—but Draco was there, kissing him, his hands shoving under Harry’s borrowed shirt, pushing his trousers down—Harry gave up trying not to want it and heeled his trainers off, lifted his hips from the bed so Draco could strip him. He was shivering, almost violently. Above him, Draco looked half mad, his lip bitten red, and he pushed Harry down and started <em>working</em> on him. Harry shoved his hands into his hair, staring up at the canopy and gasping as Draco touched him and rubbed him and then climbed onto him and <em>oh</em>, it was like touching, like kissing, only <em>more</em> like that, <em>better</em>. Draco was <em>inside</em> him, like taking a deep breath after holding it forever with lungs bursting, sweet and cool rush of relief, and Draco kissed him, blindly, his eyes squeezed shut.</p>\n<p>#</p>\n<p>They got a late start the next morning since they weren’t saving it for in the dark anymore. Harry woke up already starting to mess around with Draco, drowsy kissing, nuzzling into him—it felt so much <em>better</em> the closer he got. Draco moaned a little underneath him, squirming as Harry got a spot on his neck, and Harry groped over for the jar they’d used last night. Draco gasped under his hands and then rolled over onto his stomach and sprawled out for it, huffing out small choked breaths as Harry worked into him, both of them groaning together, moving together—</p>\n<p>Anyway, it was close to noon before they actually made it outside. They took their brooms, because <em>the border of the estate</em> was a good mile and a half away, and as long as they stayed low enough, there wasn’t any chance of being seen: a sea of dark trees all below, stretching all the way to the horizon until they reached the place where the border wall carved a small canyon through them. Draco turned to follow the line of the wall, and another five minutes of fast flying brought them to the breach.</p>\n<p>“What did this?” Harry said, poking at one of the stones: most of them were bigger than his head, and they’d been scattered nearly thirty feet around the wall in either direction, opening a big gash in the wall.</p>\n<p>“I’ve no idea,” Draco said, frowning around at the mess. “A giant could do it, but there aren’t any round here.” There weren’t any footprints, though, and no real traces in the trees, either.</p>\n<p>Draco shrugged finally and gave up trying to figure it out. “All right, come on, let’s just get it fixed.” He took out his wand and pointed it at a rock. “<em>Wingardium</em>—”</p>\n<p>“What’re you doing?” Harry said. “You’ll get dinged for underage magic.”</p>\n<p>“No we won’t! We’re on wizard property, there’s no Muggles to see, and my mother gave us the task,” Draco said. “I promise you, Potter, she didn’t mean me to lift rocks with my <em>hands</em>.”</p>\n<p>They floated the rocks one after another back into place, starting with the ones furthest away. It took a long time: the wall was a couple of feet above their heads, and each boulder was huge and heavy and almost as unwieldy to levitate as they would’ve been to lift. Hours dragged by—at first it had been fun to use magic again, especially for something real, but by the end it started to pall.</p>\n<p>“<em>There</em>,” Harry said, thumping down the last boulder. “And if it comes down again, your mum can fix it <em>herself</em>.”</p>\n<p>“She can hire <em>goblins</em>,” Draco agreed, wiping sweat from his forehead. He turned to go back to the brooms, and then Harry heard a faint rumbling behind him, turned round to look, and the heavy thumping blow took him right in the chest. He sailed through the air and hit the ground, stunned and dazed, breath knocked out of him. He stared up at the sky overhead. “Ow,” he said.</p>\n<p>Footsteps came running, and Draco dropped to the ground at his side, his hands reaching out towards him, shaking. “I’m all right,” Harry said, coughing, and pushed himself up—tried to push himself up. His elbow gave out from under him, weird and noodle-limp, like nothing more than the time Lockhart had turned his bones to jelly. Harry gasped for breath and coughed again, and his lips were wet—a metallic taste in his mouth. Draco was shoving at his clothes, jerking them apart. Harry just managed to crane his head up and see his chest—his chest half smashed open, ribs jutting out, red everywhere. A red-stained boulder had rolled away near his side; the wall had collapsed again behind them.</p>\n<p>His head fell back. Everything was going blurry and cold and dim around him. Draco was pressing a fist to his own chest, his teeth clenched. Distantly, Harry could hear his breath coming in gulps, almost sobs.</p>\n<p>Then abruptly Draco leaned over and put both his hands on Harry’s chest, over the wound. Harry gasped. The pain flared for a moment, getting <em>worse</em>, and Draco made a strangled, gargling noise. But he didn’t move his hands, and abruptly the stabbing pain started to fade from under them. <em>All</em> the pain started to fade, so fast Harry could feel it ebbing, warmth and light rolling back into the world in its place. His ribs creaked, shifting back to position, skin closing up over them. He gasped for breath, in relief, pins and needles prickling all over his arms and legs.</p>\n<p>Draco was still bent over him, his hands warm and heavy over Harry’s heart. Harry managed to reach up and put his own hand weakly over Draco’s. He meant it as <em>I’m all right</em>, <em>you can stop now</em>, but Draco didn’t let go. His teeth were clenched, his neck straining like he was still trying to fix something, and slowly a strange, horrible sensation began creeping all over Harry’s body, like—like there was something else wrong, something so deep he hadn’t even noticed it was there before.</p>\n<p>But now it <em>hurt</em>, it hurt so much there were tears starting in his eyes, and tears dripping on him—<em>Draco</em> was crying with it, his whole face screwed up desperately and still <em>pulling</em>. Harry started trying blindly to <em>push</em> at it, too. He didn’t know what it <em>was</em>, but he could feel it now, a horrible filmy thing over every part of him that didn’t want to come off. They both yelled together, a wordless furious final push, and abruptly Draco was toppling back from him, hands covered with blood and something worse, something green and miasmic clinging to his hand, and it was out, it was <em>out</em>.</p>\n<p>Harry was shaking all over, gasping, but he pushed himself up wobbly. Draco was frantically wiping his hand off on the dirt; Harry grabbed Draco’s wrist. “<em>Scourgify!</em>” he said, hoarsely. The stuff finally and reluctantly dripped off Draco’s fingers and fell sizzling to the ground, leaving his hand clean.</p>\n<p>They collapsed back to the ground together, side by side, panting. Harry felt—different. He couldn’t put his finger on how exactly, but after a moment more, he started to notice that Draco was pressed up against him, and it wasn’t a <em>relief</em>. It didn’t feel like something had stopped bothering him. It just felt <em>good</em>. Harry reached out and tentatively touched Draco’s hand, bare skin to bare skin.</p>\n<p>Draco opened his eyes and looked down at where their hands were touching. He looked back up. “Harry—” Then he stopped and pushed himself up sitting, staring down at him.</p>\n<p>“What?” Harry said warily. He sat up too.</p>\n<p>Draco said slowly, “Your scar’s gone.”</p>\n<p>Harry put his hands up, feeling all over his forehead. The skin was smooth, unbroken. Draco was right. The lightning bolt scar had disappeared. Harry dropped his hands. “I don’t understand,” he said helplessly. “What does that even <em>mean</em>?” He looked over at the still-smoking dirt where they’d wiped off the horrible <em>stuff</em> Draco had pulled out of him. “What did you do?”</p>\n<p>“You know what I did,” Draco said flatly. He got up. He walked away from Harry—all the way back to the wall. He finally turned around there, twenty yards and more away, and Harry scrambled up to his feet, realizing only then that the pull wasn’t there anymore, tugging at him. They weren’t leashed together anymore.</p>\n<p>There was something else, instead. Because he could still <em>feel</em> Draco over there, almost as if Draco were right next to him. Harry shut his eyes, and he could tell exactly where Draco was, could almost—and then he gave a little push and he <em>was</em> doing it, looking back at himself with Draco’s eyes, and when he opened his own again, he had two separate pictures of the clearing in his head.</p>\n<p>Harry shook it off, pulled back into his body. “An Indissoluble Bond,” he said. “The curse <em>did</em> flip over.”</p>\n<p>Draco gave a short hard nod.</p>\n<p>They both jerked around at the <em>crack</em> of an Apparition. Harry grabbed his wand back up from the ground and then stopped: it was Narcissa Malfoy, gripping her own wand. She looked over at Harry, saw him standing there, and her lips pressed together. Draco stood frozen as she came over to him and caught his shoulder, searching his face. Harry could feel him shaking, <em>terrified</em>, he had no idea what he was going to do, he had no idea what came next—</p>\n<p>She said, low, “It’s happened, hasn’t it. The binding...”</p>\n<p>He flinched, looking away, and she reached up and turned his face back to her. “Draco,” she said. “My darling boy. <em>He’s</em> coming.” Draco stared at her. “To the house, now. And he’s ordered us to bring you to him…you and Harry.”</p>\n<p>“Mother—” Draco said. She put her fingers on his lips.</p>\n<p>“You must go, at once,” she said. She reached up and took off the necklace she was wearing, a double string of enormous pearls that didn’t go with her dress. She pressed it into Draco’s hand. “Go to Dumbledore. He’ll protect you. He has to, now.”</p>\n<p>“I’m not leaving you!” Draco said.</p>\n<p>She cupped his face with both hands. “Listen to me,” she said, fiercely. “You’re a Malfoy. That’s more than just us, any of us. Never forget your duty to your line.” She kissed his cheek and pulled him close, for one moment, then stepped back. “Go,” she said. “Go now.”</p>\n<p>She whipped her wand around herself and Apparated away again, vanishing with another <em>crack</em>. Draco just stood there, his face crumpled. Harry could feel a hundred horrible things tumbling over themselves in his head, everything he was afraid of all jammed in together. He looked back towards the house: dark and greenish clouds were gathering overhead above the golden towers, throwing them into shadow.</p>\n<p>Harry swallowed. He picked up their brooms and carried them over. “Come on,” he said, quietly. “Come on, Draco. We’ve got to go.”</p>\n<p>#</p>\n<p>They had to go to ground: moments after Narcissa left them, black-cloaked wizards on broomsticks came pouring out of the house, splitting off in every direction, looking for them. Draco took them diving down into the forest, weaving between the trees. He led the way, but Harry felt the paths like he’d known them all his life, too; familiar glimpses of things he’d never seen before out of the corner of his eye, memories like thorns grabbing at him as he flew past.</p>\n<p>The howling clamor of Hunting Charms rose behind them, baying for blood. A wind was picking up, too cold and bitter for August, and the branches of the trees lashed the air uneasily all around them. The sky was darkening above, and suddenly the Hunting Charms were bursting out of the trees on their heels: glowing red-mouthed hounds with slavering tongues, translucent and ragged, howling wildly, and the Death Eaters were right behind.</p>\n<p>A red flash of <em>Stupefy</em> barely missed Harry’s head; a green killing bolt splashed against a tree just before Draco whipped past, and its limbs stiffened into grey death instantly, pine needles falling like rain around them. “<em>Crucio!”</em> Harry heard a woman’s voice shriek, and for a moment his leg flared into agony as the edge of the curse caught it. He couldn’t think or focus, but he kept flying anyway, his hands and eyes working for a moment without him, and then Draco was next to him, grabbing his thigh, and the pain drained out instantly.</p>\n<p>They wove and darted furiously between the trees, every flying trick they’d learned all summer long. Half a dozen of the Death Eaters ran themselves into tree-trunks or flipped themselves off their brooms, trying to keep up, but there were more of them behind. “Almost there!” Draco shouted, and Harry couldn’t spare the time to ask <em>where</em>: then the trees abruptly halted, and they were over the stretch of grey marshland, and Draco shot across and landed on the other side.</p>\n<p>“What are you doing!” Harry yelled, as the Death Eaters all burst out of the trees. Draco pointed at them and shouted, “Enemies of my blood!” and even as the Death Eaters dived, nests of squirming white tentacles shot out of the marshes and lashed around their brooms, dragging them down towards the surface. The marsh-creatures surfaced and started reaching out, grabbing and moaning, pulling the Death Eaters into the swampy ground. They all frantically started firing off spells and curses, trying to get free, and the spectral hounds all halted on the other side, yelping and unwilling to cross.</p>\n<p>Draco jumped back onto his broom, and he and Harry took off again, plunging back into the forest. After half an hour of straight hard flying with no more sign of pursuit, they came to the end of the trees: hills rolling away dotted full of houses, villages, roads rising up and down. The long sunset was still lying over the ground, and there wasn’t any cloud cover. “Come on,” Harry said. He led Draco down to the roadway going past, and put out a thumb as they started walking.</p>\n<p>They were walking for a long time: people would slow down, see they were two teenage boys, and keep going. The sun went down. Draco trudged along next to him, broomstick slung over his back, head down. He ached all over, but it wasn’t anything Harry could make go away.</p>\n<p>Draco said abruptly, “She did it on purpose, you know.”</p>\n<p>“What?”</p>\n<p>“The wall,” Draco said. “That was a Triggering Mine spell on it, aimed at you.”</p>\n<p>Harry swallowed. “She thought you’d let me die?”</p>\n<p>Draco laughed, gasped; there was something half hysterical in it. “She thought it worked out either way. If I’d let you die, I wouldn’t be Fettered anymore, and we’d have done for you—Voldemort would have to be pleased. And if I saved you—well, your side’s got to look out for me now, don’t they?” He dropped his head again and kept on walking.</p>\n<p>Finally a lorry driver gave them a lift as far as Chippenham, and they walked to the train station. Draco sat down heavily on a bench, his face blank. Harry leaned the broomsticks next to him and went into the train station. Draco had shoved the change from their train trips at him all summer, as if he couldn’t be bothered to understand what a twenty-pound note was worth. Harry found a ticket machine and got them two singles to London, and some Aero bars and crisps out of a vending machine. He didn’t feel a pull at all. He could’ve gone to the whole other end of the platform if he wanted. He could’ve gone anywhere he wanted.</p>\n<p>He went back out and sat down next to Draco and handed him one of the chocolate bars. Draco stared down at it dully. “Try it,” Harry said. Being chased through the forest by the Death Eaters and those hounds, it had reminded him of Dementors. Draco opened the bar and broke pieces off and ate them little by little.</p>\n<p>“This stuff is terrible,” he said after a while: trying, though his voice wavered a little.</p>\n<p>“We’ll get the hand-dipped singing Belgian truffles next time,” Harry said. He reached out and put his arm round Draco’s shoulders, drew him close. Draco shut his eyes and leaned into him. Together, they waited for the train.</p>\n<p># End</p>"
}