{
  "id": "574801",
  "url": "https://archiveofourown.org/works/574801?view_full_work=true",
  "author": [
    "orphan_account"
  ],
  "title": "It Was We Who Were The Cliché (But We Carried On Anyway)",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter",
    "Pansy Parkinson/Ginny Weasley",
    "Hermione Granger/Ron Weasley"
  ],
  "characters": [
    "Draco Malfoy",
    "Harry Potter",
    "Teddy Lupin"
  ],
  "additional_tags": [
    "Resolved Sexual Tension",
    "Babysitting",
    "HP: EWE",
    "References to Suicide"
  ],
  "language": "English",
  "series": "",
  "published": "2012-11-26",
  "completed": null,
  "words": "31,075",
  "chapters": "1/1",
  "comments": "170",
  "kudos": "10,938",
  "bookmarks": "2,292",
  "hits": "141,459",
  "summary": "<p>When the reconciled Black sisters go on holiday together, Andromeda entrusts Draco, rather than Harry, with five year old Teddy Lupin for three weeks. Harry is convinced she made the wrong choice, and he decides the way to fix this is simply to keep turning up at the manor and refusing to leave Draco alone.</p>",
  "notes": "<p>Written for H/D smoochfest 2012.</p>",
  "text": "<p>It is Sunday morning, and Teddy Lupin, only two months or so into his fifth year of age and currently sporting snitch covered pajamas and brilliant turquoise hair, is sitting at the kitchen table at 12 Grimmauld Place. He is drawing a great black dragon with the wax crayons he has scattered all around him; on the dragon's back sits one figure with round glasses and dark hair sticking up all over the place, another with an orange line across the top of its head and a very long nose, and another with a lot of bushy brown hair.</p>\n<p> </p>\n<p>Harry, who is still wearing the boxers and t-shirt he slept in, as well, places two plates of scrambled eggs and toast down on the table, comes round behind Teddy, and says, \"Hey, I know what this is.\"</p>\n<p> </p>\n<p>Teddy looks up at him and smiles, his left cheek dimpling. \"It's you and Ron and 'Mione when you rode the dragon out of the bank!\" he says. This is one of Teddy's favorite stories, and Ron in particular never tires of telling him all about it.</p>\n<p> </p>\n<p>\"Oh,\" says Harry, leaning closer and squinting. \"Never mind. I suppose I was wrong.\"</p>\n<p> </p>\n<p>\"You knew what it was, Harry, you're joking,\" says Teddy.</p>\n<p> </p>\n<p>\"I could have sworn this was meant to be you,\" says Harry, pointing at the dragon, and Teddy laughs.</p>\n<p> </p>\n<p>\"You didn't think that, Harry!\" he says. \"I don't look like that. I never even changed to look like that.\"</p>\n<p> </p>\n<p>Harry really loves Teddy's little, childish laugh. The bubble of warm affection in his gut pulls his lips into a smile, and he leans over to drop a rare kiss in the turquoise hair. He feels silly right away, and, glad no one else is around to have witnessed it, bustles back over to the counter to get his cup of tea. \"Love you,\" Teddy says absently in response, going back to his drawing.</p>\n<p> </p>\n<p>\"Yeah,\" Harry says to his tea. \"You, too, mate.\" He feels like the actual words might sound stupid coming out of his mouth, like he always does at the last minute in these situations, even if he means it as deeply as he can, even if he knows how important it is to tell people, especially small children, you love them – how important it is that they know. He knows how easily they disappear or misunderstand or adopt the wrong ideas about themselves. But sometimes it's hard to do it properly. It's easier when it's just obvious, like it is with Ron and Hermione. They don't have to say \"I love you;\" they never really did. All they had to do was go through a trapdoor together in first year, and ever since then they've all just known.</p>\n<p> </p>\n<p>And Harry loves Teddy, too, very much. After the war, one of the first things Harry did was report to Andromeda and tell her that, as Teddy's godfather, he should take care of the child. \"You don't have to,\" he said. \"I could do it. I feel like it's my responsibility.\" He wanted to be there for Teddy like Sirius could not be there for him. </p>\n<p> </p>\n<p>Andromeda gave him a funny look and said, \"You think a lot of things are your responsibility, don't you?\" and then, without waiting for an answer, \"But taking care of a child isn't one of them, love. You've done enough, and anyway, you're still a child yourself. I won't have any more babies raising babies.\"</p>\n<p> </p>\n<p>Harry bristled, at the time, at being called a child – he was nearly eighteen and had just <em>defeated Voldemort</em>, after all. He could handle raising a child, couldn't he? Now he knows he couldn't have. He has spent a great deal of time with his small godson since the war ended, and it is obvious to everyone, according to Hermione, that they adore each other, and though Harry thinks he's an alright godfather, he's not so sure he could manage being a parent. Andromeda knows and does so much, so much that did not even occur to Harry, and Harry is still learning how to be a proper person himself – he can't make sure Teddy becomes a proper person if he still hasn't gotten there himself.</p>\n<p> </p>\n<p>Despite this, Harry and his friends see Teddy a lot, because Harry, whether he's an actual guardian or not, is still determined that this parentless boy grow up surrounded by tons and tons of people who love him. Harry wants him to have friends and toys and books and proper birthdays and Christmases that bear loads of presents. He wants him to have people to talk to, so he must never resort to telling cupboard spiders about his hopes and his nightmares, people to hug him so he never feels strange saying, \"I love you,\" especially when he really means it.</p>\n<p> </p>\n<p>When Harry sits down at the table across from Teddy, Teddy looks up, smiles at him, and promptly allows the colour black to chase all of the turquoise out of his hair. \"Look,\" he says. \"I look like you now!\"</p>\n<p> </p>\n<p>Harry laughs. \"You'd have to change your eyes, too. Then we'd be practically twins.\"</p>\n<p> </p>\n<p>Teddy crosses his eyes and wrinkles his nose, and his light brown eyes melt to green.</p>\n<p> </p>\n<p>\"Hey, well done!\" says Harry. \"Do you think you can add things to your face, as well, scars and things?\" He touches his forehead.</p>\n<p> </p>\n<p>\"I never tried that,\" says Teddy thoughtfully.</p>\n<p> </p>\n<p>\"Well, how about you eat your breakfast before it gets cold,\" Harry remembers as Teddy begins to screw up his face again, \"And then you can try.\" Sometimes he forgets that he's supposed to be the grown up; he's really very tired of being a grown up, sometimes, and that, too, makes him think it's really a good job he didn't insist on raising Teddy on his own. Teddy needs someone who knows how to be a grown up.</p>\n<p> </p>\n<p>\"OK, Harry,\" says Teddy, tucking into his eggs as if he's only just remembered their presence himself.</p>\n<p> </p>\n<p>Harry was a bit too preoccupied with his immediate life-threatening concerns to think about whether or not he liked or disliked small children when he was at Hogwarts, or if he might one day want one, or anything like that, and at first, he felt quite nervous with Teddy. By now, he's realized children are actually very easy to talk to, sometimes easier to talk to than adults, and maybe he even likes them quite a bit. He likes the way they are curious and excited about things, and he likes the way they are genuine. Teddy, anyway, is honest about his feelings, and never worried about how he might sound. It's obvious when he likes or does not like something, and why he feels that way. He does not pretend to like or dislike people and things. Harry knows that Teddy just likes him. That's all. There is no angle.</p>\n<p> </p>\n<p>Of course, there are some adults in Harry's life like this, too; he is reminded of this as a swishing sound from the kitchen fireplace announces the presence of Ron's ginger head. \"Hey, Harry, you in there?\" he calls out. \"Can we come through?\" There's no need to ask who 'we' is; Ron and Hermione have been living together for half a year now, and it appears to be going well, whether they were a bit nervous about the whole thing at first or not. Harry didn't really think it would be a problem. In his mind, Ron and Hermione are perfect together, and he can't imagine anything happening to them like what happened to Harry and Ginny.</p>\n<p> </p>\n<p>Well, that's mostly because they're not likely to announce to each other that they're gay any time soon, but – Harry just means he thinks they make each other far too happy to split up.</p>\n<p> </p>\n<p>Teddy, as usual, is delighted by the presence of a head in the fireplace. \"Hello, Ron!\" he says excitedly, scrambling off his chair to get closer.</p>\n<p> </p>\n<p>\"Oh, hey, mate!\" says Ron. \"What's up?\"</p>\n<p> </p>\n<p>\"Come through and I can show you my drawing!\" says Teddy.</p>\n<p> </p>\n<p>\"All right!\" says Ron. \"Can't say no to that, can I?\"</p>\n<p> </p>\n<p>His head disappears, there is a pause, and then another whooshing sound brings Ron and Hermione into the kitchen, brushing soot off their clothes before stepping out of the fireplace and onto the floor. Hermione stumbles a bit and Ron steadies her with a gentle hand at the small of her back. \"I don't need any help, Ron,\" she chides him, but she laughs and smiles, anyway. Sometimes it's impossible not to notice how in love they are. Harry thinks it's a bit strange that Ron snogged Lavender Brown all over the place in sixth year, but it's with Hermione, who he does not snog everywhere but instead exchanges smiling looks and gentle touches like that hand on her back, that his feelings are obvious.</p>\n<p> </p>\n<p>\"I didn't realise Teddy was here!\" says Ron, beaming and making his way to the table. \"Hey nice, you're looking like Harry today.\" Ron and Hermione are just as charmed by Teddy as Harry is, and it makes Harry feel a bit better, the way Ron can't seem to hide his affection for a five year old boy, either. \"Show me your drawing, then, small Harry,\" he says, leaning over to look more closely.</p>\n<p> </p>\n<p>As Teddy explains his drawing to Ron, Hermione smiles at Harry and says, still a little breathless from floo travel, \"Oh, honestly, you're just now eating breakfast? It's noontime.\"</p>\n<p> </p>\n<p>\"I honestly hadn't checked the time,\" says Harry, yawning and twisting in his chair to crack his back. \"But Gin's still in bed, so don't yell at <em>me</em>.\"</p>\n<p> </p>\n<p>\"Well, <em>she</em> had a game yesterday, didn't she?\" says Hermione.</p>\n<p> </p>\n<p>\"And I chased a five year old all round the stands,\" Harry says defensively.  </p>\n<p> </p>\n<p>\"Oh, stop, I'm joking,\" says Hermione, leaning over to kiss his cheek before sitting down next to him. \"I hope she joins the living some time, I wanted to tell her sorry we couldn't make it. George said they won, though.\"</p>\n<p> </p>\n<p>This is Ginny's second year playing chaser for the Holyhead Harpies, and it's also the second year she's shared a house with Harry, who does not actually have any sort of job at all at the moment, not since he quit the aurors. He knows he wants to do something else with his life; he's restless and bored most of the time. Sitting around has never worked well for him. Harry Potter is not meant to sit around. He just doesn't know <em>what</em> he wants to do.</p>\n<p> </p>\n<p>After the war, Harry, Ron, and Neville were all offered jobs as aurors by Kingsley, the newly elected Minister For Magic. All three of them accepted the offer, and eventually, all three of them dropped out. Ron was the first to do so, leaving before even completing training – he decided George, who was still grieving his twin and sorely needed help running his shop, was his priority. Neville and Harry completed training and spent a short time as partners before Neville decided his real love lay in Herbology, and after barely a year in the field, Harry had a sort of – early mid-life crisis. The feelings leading up to it had existed since Harry had gotten the initial offer to join the Aurors, but they didn't explode until Ginny, still his girlfriend at the time, had said in a strange, fierce way, reminding Harry quite a bit of the first time she'd kissed him, \"Do you think we're getting to the point where we ought to move in together?\"</p>\n<p> </p>\n<p>It was like she'd touched a mine; he exploded in typical Harry fashion, in a whirlwind of shouting and \"I don't think I can do this anymore\" and \"I've always done what people have expected me to do, you know?\" and \"this is too easy\" and \"I don't know what I actually <em>want</em>\" and \"I think I'm tired of chasing dark wizards, I think I'm tired of this being my destiny, this is my life, my actual life, it isn't <em>Star Wars</em>, can't I be normal for once\" and \"also, I think I fancy men.\"</p>\n<p> </p>\n<p>He hadn't meant to actually admit the last part yet, as he was still in the early stages of admitting it to himself due to dreamy thoughts about the muggle boy working at the coffee shop down the road, but when Harry gets started he has a hard time controlling which thoughts come out of his mouth.</p>\n<p> </p>\n<p>Ginny reacted in a way that was the exact opposite of Harry's expectations, a tendency of hers that he recalled, at that moment, he always liked about her. She sighed, ran a hand through her hair, and said, \"<em>Thank you</em>. See, I was going to tell you I fancied women and just get that over with, but I was afraid if I didn't get you to admit you were gay, too, you'd never do it. I honestly thought Hermione and I might have to stage an intervention. That was a test – if you'd agreed to move in with me, you'd obviously have been delusional and there'd have to be an intervention. Fuck's sake, we haven't had a proper conversation, let alone had sex, in months. What sort of business would we have moving in together? And more importantly, what the fuck is <em>Star Wars</em>?\"</p>\n<p> </p>\n<p>Except they did actually end up moving in together. In a typical whirl of sudden, stubborn determination, Harry quit the Aurors, came out to his friends and surrogate family, and set out renovating 12 Grimmauld Place. He had been holding onto ownership of the house, unsure what he felt about it, since the end of the war, and he came to the sudden – albeit muddled – conviction that he would make the place some kind of physical representation of the way he planned to change his life. Really, he wanted to take something back from the war, something filled with painful memories and pure blood bullshit, and transform it into something pleasant, something good and belonging only to him. Except after a while, he felt rather lonely in this big house, and Ginny came to the realization that she really couldn't stand living at home anymore, but didn't really have the money or desire to live on her own.</p>\n<p> </p>\n<p>She's probably got enough money now, but they're used to living together. It's actually quite fun, living with Ginny; without the strain of trying to make a relationship work, they get on much better. Besides, Harry really can't imagine going back to the crushing loneliness of living in this place alone, even if none of their friends have quite stopped making fun of them for being each other's beards. He reckons he can deal with the teasing, because it's a lot better than a genuine lack of support. He knows he and Ginny are lucky to have been supported by the important people in their lives.</p>\n<p> </p>\n<p>\"Well, you were never really exposed to it, were you?\" Hermione had said to Harry in the way she says nearly everything, businesslike and as if she's known all about it for all this time – she's only been waiting for you to ask. \"Any time you<em> could</em> have been exposed to it you were too absorbed in yourself to notice. I don't blame you, of course, I imagine Voldemort was a bit more of a pressing matter than noticing Colin Creevey had a crush on you, and eventually a boyfriend – I think he was a Hufflepuff. And anyway, I imagine your sex education was abysmal, I can't really see the Dursleys talking about any of that, especially not homosexuality.\"</p>\n<p> </p>\n<p>Ron, on the other hand, instead of responding with a well thought out and matter of fact analysis of Harry's childhood, was a bit bewildered by the whole affair at first – but it was more from a lack of foresight than any sort of problem, and after a few days of staring at Harry and Ginny with a wrinkled forehead and a pensive expression whenever they saw each other, he clumsily tried to set Harry up with some friend of George's and told Ginny she was too young to be shagging anybody, anyway. Ginny responded to this with, \"Fuck off, you great wanker, at least you didn't have to <em>walk in on </em>your sibling having sex, <em>last year</em> when you were <em>my age</em>,\" instilling Harry with a great horror of inadvertently experiencing the same thing that has not yet left him.</p>\n<p> </p>\n<p>It took Mrs. Weasley a while to get used to the idea that Harry and Ginny would not be getting married, making Harry an official member of the family and providing her with several grandchildren, but she loves them too much not to have come round. Mr. Weasley had said, \"We didn't fight a whole war over insignificant differences only to hate our own family for this kind of thing,\" and that had been that.</p>\n<p> </p>\n<p>The fireplace makes another swishing noise, bringing Harry back to earth, and he hears Luna's voice say, \"Hello? Is Ginny there?\"</p>\n<p> </p>\n<p>\"She's still asleep,\" Harry calls over, getting up and feeling like he may never actually eat his breakfast. He peers over Ron and Teddy to see Luna's head in the fire; her earrings look like carrots today. \"Did you want me to take a message?\"</p>\n<p> </p>\n<p>\"Hi, Luna!\" says Teddy, clapping his hands with delight at the appearance of another head in the fire.</p>\n<p> </p>\n<p>\"'Lo, Luna,\" says Ron, reaching over and stealing a piece of toast from Harry's plate and shoving it in his mouth.</p>\n<p> </p>\n<p>\"Oh, hello, everyone,\" says Luna. \"I haven't seen you in ages, Ron and Hermione. I suppose you've been very busy together.\"</p>\n<p> </p>\n<p>\"Hmm,\" says Ron around his mouthful of toast, amused. He speaks unintelligibly through the food in his mouth and then chokes a little, causing Hermione to give him a look of disgust and absolutely no sympathy. Teddy pats Ron on the back.</p>\n<p> </p>\n<p>\"I think he might be asking if you'd like to come through,\" says Hermione.</p>\n<p> </p>\n<p>\"I'm a bit worried about you being able to understand him with his mouth full now,\" says Harry.</p>\n<p> </p>\n<p>\"If I didn't, we'd probably never have a proper conversation,\" says Hermione.</p>\n<p> </p>\n<p>\"Oh, I'd love to!\" says Luna. \"I feel like I haven't seen you lot properly in such a long time – do you mind if Dean comes through, as well?\"</p>\n<p> </p>\n<p>\"I want to see Dean!\" says Teddy. \"I want to show him my picture because he's good at pictures!\" Dean does political cartoons for the Quibbler, and he and Luna, inspired by Teddy, have been working on a children's picture book together. They've often stopped in to ask Teddy's opinion of their progress. </p>\n<p> </p>\n<p>\"Might as well,\" says Harry. \"I'm only in my pants.\" But Luna's head has already disappeared. Harry doesn't really mind – it's only Luna and Dean, who fell in love somewhere during the time they spent together at Shell Cottage, have been together since, and have been particularly supportive of Harry and Ginny over the past couple years.</p>\n<p> </p>\n<p>Teddy giggles, Ron snorts, and Hermione says, \"It's not our fault you're not dressed at noon.\"</p>\n<p> </p>\n<p>By the time Ginny arrives in the kitchen, it is populated not only by Harry, Teddy, Ron, and Hermione, but by Luna and Dean, who wanted to talk to Ginny about the game they missed, and Neville, who came through a few minutes later wanting to speak to Harry, although Harry isn't sure what about, because he seems to have been distracted by the presence of everyone else. Harry grew even closer to Neville when they worked at the Aurors together, and this hasn't changed – they often come to one another for advice. It probably helps that Neville's attraction to blokes was part of the reason Harry started wondering about himself, and they have this to relate to in each other, along with all the rest of their similarities. And even without that, Neville, like Ginny, is another good person to have around when Ron and Hermione are busy being together, and Harry thinks this with no bitterness; Ron and Hermione will always help when he asks. He just doesn't always like to ask, because they've done so much for him already, and they are so happy together, and he wants them to be happy and together and without any worry for him as much as possible.</p>\n<p> </p>\n<p>\"What's this?\" says Ginny as she squints at everyone sitting about drinking tea and stretches in the doorway, wearing pink pajama trousers and a t-shirt of Harry's. \"Who invited you lot, what time is it?\" She looks at Harry. \"Why are you entertaining our guests in your pants?\"</p>\n<p> </p>\n<p>\"Is this yours?\" says Harry, holding up his middle finger.</p>\n<p> </p>\n<p>Ginny laughs loudly, and Hermione clears her throat and says, \"There<em> is</em> a <em>child</em> in the room.\"</p>\n<p> </p>\n<p>Harry looks guiltily over at Teddy, but he doesn't appear to be paying attention. \"Good morning, Ginny, come see my picture,\" he says absently. </p>\n<p> </p>\n<p>\"You should, it's brilliant,\" says Dean, flashing Teddy his wide, attractive smile.</p>\n<p> </p>\n<p>Teddy smiles proudly, picks up the drawing, and holds it up for Ginny to see. As she says, \"Ooh, yeah, brilliant, I suppose the great ugly monster is Ron, right?,\" Harry glances down at the stack of completed drawings the dragon picture was atop, then does a double take and looks more closely.</p>\n<p> </p>\n<p>The picture that was beneath the dragon drawing is of a tall, thin man in all black. The figure has a swathe of yellow hair and a pointy nose, and he is leaning over a cauldron producing colourful fumes. Harry recognizes the figure instantly, whether it's a wax crayon rendering of the man or not, and he feels a familiar sharp tug of irritation.</p>\n<p> </p>\n<p>It still rankles whenever Harry is forced to remember that thanks to some kind of recent reunion between Andromeda and her younger sister – a reunion that is, in Harry's opinion, baffling and no doubt ill-advised – Teddy sometimes spends time with the Malfoys. Even worse, he appears to be inexplicably <em>fond</em> of them, particularly of <em>Draco</em>. Why anyone at all would be fond of Draco Malfoy is a mystery to Harry – a complete <em>mystery</em>, <em>obviously</em>, he thinks viciously – but someone as nasty as Malfoy getting along with a small child is an image he especially can't get his head around, though he tries often.</p>\n<p> </p>\n<p>He may have saved Malfoy's life and testified at his family's trial, he may have helped to keep them out of Azkaban, but it doesn't mean he likes them, or even trusts them, especially with an impressionable child. Harry repaid Narcissa for what she did for him. That's all. Now they are even, and he can get on disliking them and doubting their worthiness as role models in peace. Harry wants Teddy to have plenty of people to love him, but he's not sure <em>Malfoy</em> is the sort of person he wants Teddy looking up to.</p>\n<p> </p>\n<p>Maybe the man is not <em>evil</em>, maybe Harry can admit he was probably forced to make some choices, too, but he still didn't make very good ones, it's a fact, and Harry imagines he remains as selfish and arrogant and rude as ever. He hasn't actually seen Malfoy anywhere in ages, but he never thanked Harry for testifying at his trial, never even spoke to him again – even when Harry tried to return Malfoy's wand, he interacted only with a house elf, who said, \"Master Draco is being very busy, Mr. Harry Potter sir, and has no time for visitors. Krupnik is being instructed to thank Mr. Harry Potter for Master Draco and show him out.\"</p>\n<p> </p>\n<p>Malfoy's reply to the press when they asked him about his father's very publicized death - rumored a suicide - a while back was also incredibly rude, although Harry's not sure he can blame him for that and keep a clear conscience. He knows how awful it is to deal with intrusive press over something that has hurt you, and he imagines, what with the way Draco used to talk about his father, his death would hurt, even if the world is probably much better off without the man.</p>\n<p> </p>\n<p>\"That's my cousin Draco,\" says Teddy when he looks up and sees what Harry is looking at. Everybody else gets rather quiet all of a sudden. \"I don't know if you remember what he looks like. I asked him when I was drawing a picture of you and me at the manor and he says he doesn't remember what <em>you</em> look like. I said, 'even though he's a bit famous?' and he said he didn't even know you were famous.\"</p>\n<p> </p>\n<p>Ginny snorts in a fashion rather similar to her brother.</p>\n<p> </p>\n<p>\"I'm sure,\" Harry says irritably. Of course Malfoy <em>remembers</em> him; why would he say something like that?</p>\n<p> </p>\n<p>\"Did you know I'm staying with him for <em>ages</em> this summer?\" Teddy continues. \"Three whole <em>weeks</em> while Auntie goes on holiday with Aunt Cissa. He's going to be like my replacement Auntie except he's a boy and not as old and he'll probably spend the whole time making potions and asking me what they smell like and writing numbers on parchment and sending owls.\"</p>\n<p> </p>\n<p>Harry chokes on his tea. \"You're going to <em>what</em>?\"</p>\n<p> </p>\n<p>Ron and Ginny both frown; Hermione puts a hand to her forehead, elbow on the table, and sighs; Neville winces; Dean makes a strange, shifty face, avoiding Harry's eyes and rubbing the back of his neck; Luna just smiles in an odd, fond way.</p>\n<p> </p>\n<p>\"I'm going to live in the manor!\" says Teddy. He rambles on, which he only does when he's very, <em>very</em> excited about something. \"In just one week I'm going. I'll have my own room and everything because it's <em>ginormous </em>there, even bigger than here. The Aunts are going on a <em>very</em> long holiday. Aunt Cissa says they deserve such a long holiday. I don't know why. She wanted Draco to come, but he never goes anywhere, he's too busy with his potions and his papers. Aunt Cissa says when I come round is one of the only times Draco ever gets out of his study, except when he's with his bad influences, so Auntie thought it'd be good if I stayed at the manor. He'll probably make me play with his pretty friend a lot, though, instead. That's okay. She's nice, even though Auntie Cissa says she's one of the bad influences. I like her laugh.\"</p>\n<p> </p>\n<p>Harry feels strange, suddenly. \"Who's his pretty friend?\" says Harry.</p>\n<p> </p>\n<p>\"She's called Pansy,\" says Teddy.</p>\n<p> </p>\n<p>\"Oh,\" says Harry. Draco and Pansy are still together, then. For some reason Harry did not expect Draco to have any kind of love life, and he doesn't know why, and he doesn't know why it feels weird to imagine it. Whether Harry has seen him around or not, Draco <em>does</em> have a life, and why shouldn't he have a girlfriend? And then Harry remembers what the point of all this is and says, \"You're meant to be spending three weeks at Malfoy Manor? <em>Alone</em> with <em>Malfoy</em>? And maybe Pansy Parkinson?\"</p>\n<p> </p>\n<p>\"Yes,\" says Teddy. \"But I bet you can visit!\"</p>\n<p> </p>\n<p>\"I need to talk to your Aunt,\" says Harry.</p>\n<p> </p>\n<p>\"Why?\" Luna asks.</p>\n<p> </p>\n<p>Dean reaches out as if to touch her, then seems to think better of it, putting his hands back onto his lap and straightening up. \"Well, Teddy does appear to be in one piece even after all the time he's already spent with Malfoy,\" he says reasonably. \"I'm sure Andromeda has a good reason for giving him the responsibility.\"</p>\n<p> </p>\n<p>Everyone stares at him. Harry feels an automatic sting of irritation; Dean doesn't have any business being reasonable about Malfoy. Only Hermione is allowed to be reasonable about Malfoy, because she can't help being reasonable about everything, and she hasn't even spoken up yet.</p>\n<p> </p>\n<p>\"And Draco quite likes Teddy, really,\" says Luna. \"You love each other, don't you?\" she says to Teddy, patting him on the head.</p>\n<p> </p>\n<p>\"Yes,\" says Teddy. He frowns at Harry. \"Cousin Draco is my friend, Harry. He looks after me and saves me from the peacocks and tells me all about his potions. He's very clever, you know. He's going to be a <em>master</em> at potions. It means he's going to be the best.\"</p>\n<p> </p>\n<p>Harry suddenly feels a bit like a bully, and he doesn't appreciate being made to feel this way over <em>Malfoy</em>. \"I know what it means,\" he says childishly, which doesn't help anything at all and only causes Hermione to give him an incredulous look.</p>\n<p> </p>\n<p>\"He saves you from…the peacocks?\" Neville repeats.</p>\n<p> </p>\n<p>\"The peacocks at the manor are a bit wild,\" says Luna.</p>\n<p> </p>\n<p>\"Luna…\" says Harry. \"How do you know all this?\"</p>\n<p> </p>\n<p>\"Oh, I noticed the peacocks at Draco's birthday party,\" she says, tucking her hair behind her ear and revealing one of her dangling carrot earrings. Dean reaches over and places a hand on Luna's, as if in a show of support; she smiles at him gently, obliviously.</p>\n<p> </p>\n<p>\"You were at Malfoy's birthday party?\" Harry demands.</p>\n<p> </p>\n<p>Hermione sighs. Harry gives her a look; she has no reason be <em>sighing</em> at him.</p>\n<p> </p>\n<p>\"Yes,\" says Luna, frowning. \"Didn't you know? We see each other from time to time. For lunches and things. You know, he used to bring me bits of better food and such and talk to me when he could, when I was in his basement during the war. We got to know each other a bit.\"</p>\n<p> </p>\n<p>Harry stares. Malfoy talked to Luna when she was a prisoner in his house? He brought her bits of food? How did he manage that, with Voldemort skulking around? And only Luna would talk about \"getting to know\" someone who was keeping her prisoner in such a casual way.</p>\n<p> </p>\n<p>\"And you never thought to mention this to any of us?\" says Ginny, looking as flabbergasted as Harry feels. \"Not once? Not even whenever Harry got started?\"</p>\n<p> </p>\n<p>\"Didn't I?\" says Luna quite casually. \"I thought I had. Well.\" She shrugs. \"Now you know, I suppose.\"</p>\n<p> </p>\n<p>\"'Whenever Harry got <em>started</em>?'\" says Harry, bristling. \"What's that supposed to mean? Surely I don't talk about Malfoy <em>that</em> much.\"</p>\n<p> </p>\n<p>\"Yeah, no comment,\" says Ginny, and Hermione presses her lips together and makes a weird \"hmm\" noise.</p>\n<p> </p>\n<p>\"To be fair, it has been a while,\" says Neville.</p>\n<p> </p>\n<p>\"If by 'a while' you mean maybe two weeks,\" says Ginny.</p>\n<p> </p>\n<p>\"No, I think it's been at least a month,\" Neville insists calmly.</p>\n<p> </p>\n<p>\"It's not my fault,\" says Harry, forgetting who is in the room in his irritation, \"That my godson is always spending time with an enormous prat, and I'm forced to consider his existence in the world.\"</p>\n<p> </p>\n<p>Teddy throws down his crayon. \"Cousin Draco is <em>not</em> a prat,\" he says. \"He's clever and he's funny and he's nice. He talks to me like a grown up and not like I'm a baby. Why do you hate him?\"</p>\n<p> </p>\n<p>Harry is back to feeling like an awful bully, and he doesn't like it at all. \"I don't…\" he says. \"I don't <em>hate</em> him, Teddy.\"</p>\n<p> </p>\n<p>\"You act like you hate him,\" says Teddy, his bottom lip wobbling.</p>\n<p> </p>\n<p><em>Fuck</em>, Harry thinks. \"I don't, Teddy, I promise,\" he says.</p>\n<p> </p>\n<p>\"Harry is just acting like a big baby,\" says Ginny. \"Don't listen to him.\"</p>\n<p> </p>\n<p>\"You don't like Malfoy, either!\" says Harry, feeling betrayed.</p>\n<p> </p>\n<p>\"I don't even know Malfoy,\" says Ginny, running her fingers soothingly through Teddy's hair. \"It's been five years.\"</p>\n<p> </p>\n<p>\"Traitor,\" Harry mouths at her.</p>\n<p> </p>\n<p>\"And we never even knew him in the first place, really,\" says Dean.</p>\n<p> </p>\n<p>\"I think we knew him well enough – \" Harry starts, but Hermione tuts and looks pointedly at Teddy, and Harry falls silent.</p>\n<p> </p>\n<p>They manage to avoid a meltdown by distracting Teddy with the promise of practicing flying at the Burrow. Teddy isn't old enough for a real broom yet, but he got a training broom for his birthday, and he's enamored with it, which delights Harry. The Burrow is the best place to practice, because it is the most private, and Teddy cannot go terribly high up.</p>\n<p> </p>\n<p>When Harry comes down the stairs, fully dressed now, feeling like a terrible godfather, and wondering how he can convince Teddy that he doesn't hate Malfoy when, well, he sort of does, he runs into Hermione, who is coming up from the kitchen.</p>\n<p> </p>\n<p>\"Hey,\" she says. She fusses with his denim jacket even though it doesn't need to be fussed with, tugging to straighten it, and fruitlessly smoothes down his hair. \"All right?\"</p>\n<p> </p>\n<p>\"Yeah, I'm all right,\" Harry shrugs.</p>\n<p> </p>\n<p>She moves her eyebrows incredulously, opens her mouth as if to speak, seems to change her mind, and only kisses him on the cheek again. \"I love you,\" she says. \"We all do, and so does Teddy, no matter who he's staying with. I don't think you have any reason to worry over him. OK?\"</p>\n<p> </p>\n<p>\"If you say so,\" says Harry.</p>\n<p> </p>\n<p>\"I don't see any reason you can't visit him while he's at the manor,\" says Hermione. Harry makes a face. \"I know it's Malfoy, and he's a great ferrety git, OK, I <em>agree</em>, I do – \" she laughs, taking Harry's face in one hand, squeezing her fingers into his cheeks as if he's her pet and finally making him laugh.</p>\n<p> </p>\n<p>\"Stop,\" he says, moving his face away from her.</p>\n<p> </p>\n<p>\" – but <em>really</em>, Harry, you're nearly twenty-three, and I think we can all be adults about it, at least. Maybe if you actually speak to him about Teddy you'll feel better.\" When she sees the look on his face, she adds, \"<em>Don't</em> take that as an excuse to go storming in and picking a fight with him, that's <em>not</em> what I meant, and Teddy doesn't need to see that.\"</p>\n<p> </p>\n<p>\"I wouldn't do it in front of Teddy,\" says Harry. \"Especially not now, did you see his face? He's not very happy with me.\"</p>\n<p> </p>\n<p>Hermione sighs. \"He'll forgive you,\" she says, hugging him tightly, and he hugs her back, resting his chin on her head and bringing one hand to rest in her bushy hair. It is not hard to be affectionate with Hermione; she's always the one to initiate it.</p>\n<p> </p>\n<p>\"Hey, you're not trying to steal my girlfriend, are you, mate?\" Ron butts in, appearing from the kitchen with Neville.</p>\n<p> </p>\n<p>\"Yeah, I am, actually,\" says Harry, pulling her closer and twisting her away from him. \"What are you going to do about it?\"</p>\n<p> </p>\n<p>Ron jumps onto Harry's back, and Hermione shrieks.</p>\n<p> </p>\n<p>\"<em>Harry</em>, let go of me,\" she says as Ron beats his fists on Harry's back and Harry falls over a bit, stepping on Hermione's foot. \"Ouch, you <em>two</em>, stop it, I will hex you!\" Harry relinquishes Hermione and tackles Ron back onto the stairs with a <em>thump</em>.</p>\n<p> </p>\n<p>\"What are they doing?\" Harry hears Luna ask as she returns from the loo.</p>\n<p> </p>\n<p>\"Fighting over Hermione,\" says Neville. \"Shall we go now?\"</p>\n<p> </p>\n<p>\"Yes,\" says Ginny, who is coming down the stairs holding Teddy's hand. Their progress is impeded by Harry pretending to bash Ron's head against the staircase. \"I vote we leave them here. They're clearly not old enough for this.\"</p>\n<p> </p>\n<p>\"I'm older than <em>you</em>,\" says Ron.</p>\n<p> </p>\n<p>\"Then what's <em>he</em>?\" says Harry, climbing off Ron and running up to Teddy. He swings him away from Ginny and up into his arms. \"If <em>he's</em> old enough to go flying, <em>I'm</em> old enough to go flying. You're not leaving me behind.\"</p>\n<p> </p>\n<p>Teddy only pouts at him, which makes Harry feel a nervous flutter in the pit of his stomach - surely Hermione is right, and Teddy will forgive him for disliking his beloved cousin?</p>\n<p> </p>\n<p>Of course he will. Harry will just have to make absolutely sure he does and not give up. And if he's anything, he's admirably persistent.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>On whatever planet Pansy must actually be from, it appears \"I swear one of my tits has gotten bigger than the other\" is an appropriate greeting.</p>\n<p> </p>\n<p>\"<em>Fuck's</em> sake – \" Draco nearly knocks over his bottle of ink when she steps out of the fireplace without warning. \"Put them away.\"</p>\n<p> </p>\n<p>\"I don't have them <em>out</em>, Draco, what do you think this is?\" Pansy says, bursting into a round of her usual phlegmy cackles.</p>\n<p> </p>\n<p>Draco looks up to give her a long-suffering look. Pansy, like Draco, has followed the trends after the war and taken up muggle fashion, one of the many things Draco's father is likely rolling in his grave over, and, as usual, she is wearing an extraordinarily tight dress that assures an unobstructed view of her ample cleavage. Draco likes the muggle clothes; they're far more comfortable, and if his father would have disapproved, well – at this point it's an added bonus. Besides, Draco has reached a very different point of life, where he likes feeling like he's Draco, and not his father at all. \"It's a place where you feel entirely too comfortable, is what it is,\" he says darkly, dipping his quill in the ink well and turning back to his notes. \"Could you give a little warning next time, maybe, before storming in going on about your tits? Anyway, isn't that fairly common?\" He is at his desk in the room in which he does most of his work, part study, part lab. The desk is covered, on one side, with neat stacks of parchment, different coloured bottles of ink, broken quills, and fat books the size of which rival anything Granger carried round at school; after a divide, there are three cauldrons, one currently bubbling with a pale grey-green concoction, and several knives, silver instruments, sets of scales and phials, and jars, bottles, bowls, and packets of ingredients.</p>\n<p> </p>\n<p>He's been working to receive his Potions Mastership for the past year or so, reading and researching and doing exams – the worst part, not because he has any particular problem writing exams, but because he cannot stand going to the ministry, where they are held and where people always stare at him and give him nasty looks. Everybody thinks he should go out more, but what's the point, when people only look at him like he's something to gawk at in a zoo? It's a much more constructive and less miserable use of his time to stay home working to be the best at something he can possibly be, a goal he has always had and never quite managed to achieve. But he will this time – despite the things his father said to him before he died, despite the way people look at him. He will do something in his own right, and he will be the best, and he will not be Lucius Malfoy's son but Draco Malfoy, top expert in Potions, perhaps a professor, perhaps the owner of a hugely successful business, perhaps the person who discovers something brilliant and tremendously, unequivocally helpful to wizardkind. This is the plan, and Draco sees no reason to distract himself with anything else.</p>\n<p> </p>\n<p>\"What's fairly common, me 'storming in going on about my tits?'\" Pansy says. Her impression of Draco's voice is spot on.</p>\n<p> </p>\n<p>\"<em>No</em>,\" Draco says. \"Well, yes, unfortunately, but I meant the bit about – \" He nods in her direction. \"Oh, you know. One being bigger than the other.\"</p>\n<p> </p>\n<p>\"You're pathetic,\" she says. \"You've seen my bare tits enough to be able to talk about them without shame. How do you even know that?\"</p>\n<p> </p>\n<p>\"I like to think I've successfully repressed all that,\" Draco says grimly. \"And – well, I must have heard it – oh, I don't know, Pansy, is that all? Why are you <em>here</em>?\"</p>\n<p> </p>\n<p>She cackles happily and, to Draco's immense exasperation, hops right up onto his desk, swinging her legs over the hardwood surface so she's facing him. She flashes him in the process.</p>\n<p> </p>\n<p>\"Merlin, mind the <em>ink</em>,\" he says, grabbing on to the inkwell again. \"I'm not prepared to re-start this, do you know how much vital information is on this parchment? And I didn't really want to see your knickers.\"</p>\n<p> </p>\n<p>\"That's why I like you,\" she says, reaching out no doubt to ruffle his hair with those long, red-tipped fingers; he manages to dodge it, scowling, making her cackle again. \"It's a rare man that doesn't bend over backwards trying to see my knickers – and just think of it, you've slept with me and plenty of <em>them</em> haven't  – \"</p>\n<p> </p>\n<p>\" – if by plenty you mean maybe one or two out of the whole lot – \"</p>\n<p> </p>\n<p>\" – you're so special, Draco. Anyway, yes, I think lots of people's tits are uneven, but <em>mine</em> never were. I was a bit proud of it, if I'm going to be honest with you.\"</p>\n<p> </p>\n<p>\"Pansy, honestly, what gave you the idea that I care to hear about your tits when I'm trying to accomplish something?\" says Draco irritably. \"Or <em>ever</em>?\"</p>\n<p> </p>\n<p>\"You're <em>always</em> trying to <em>accomplish</em> something,\" says Pansy. \"Come out with Blaise and me.\"</p>\n<p> </p>\n<p>Draco sighs. \"I'm not in the mood.\"</p>\n<p> </p>\n<p>\"You're never in the mood,\" says Pansy. \"Except when <em>Loony Lovegood</em> comes round, of course. If you weren't such a big queer I'd say you fancied her.\"</p>\n<p> </p>\n<p>\"Don't call her that,\" Draco glares. \"She makes for far more stimulating conversation than the drivel you've been feeding me this evening.\"</p>\n<p> </p>\n<p>\"Oh, get stuffed, Draco. It's Friday <em>night</em>.\"</p>\n<p> </p>\n<p>\"So?\" he says. \"It's just another night.\"</p>\n<p> </p>\n<p>\"For boring people.\"</p>\n<p> </p>\n<p>Draco makes a noncommittal noise and leans over to peer at the bubbling cauldron. Pansy looks over at it, too, wrinkling her pert nose. \"Ergh,\" she says. \"What's that meant to be? It looks like bogeys.\"</p>\n<p> </p>\n<p>\"What's it smell like to you?\" says Draco, tapping his quill against his parchment.</p>\n<p> </p>\n<p>\"Is this a trick?\" says Pansy, narrowing her eyes. \"Will I pass out again?\"</p>\n<p> </p>\n<p>\"Smell it,\" says Draco.</p>\n<p> </p>\n<p>\"I will hex your balls off if I faint again,\" she says sharply.</p>\n<p> </p>\n<p>\"I've been warned.\" Draco smirks. \"And you can't pretend you didn't deserve it last time.\"</p>\n<p> </p>\n<p>Pansy rolls her eyes. \"I still don't see why you couldn't have done it to Blaise,\" she says snippily, pulling her long, dark hair over to one side, as if to get it out of the way. She leans over and sniffs delicately. Once she seems sure that she's not going to pass out, she sniffs again. \"Hmm,\" she says. \"A bit like my bedroom at home, and that muggle shop with all the lovely expensive underthings – \" She stops. \"Hang on. This smells like amortentia! But – this isn't amortentia, it doesn't look like it!\"</p>\n<p> </p>\n<p>\"Brilliant,\" says Draco, scribbling down Pansy's analysis. \"No, yes, it isn't amortentia – it's a very strong painkiller, actually, but for – mental pain. You know.\"</p>\n<p> </p>\n<p>Pansy frowns, her eyes suddenly alight with concern, and says, \"I know.\"</p>\n<p> </p>\n<p>\"Yes, well, it's a fairly new invention,\" says Draco briskly, trying to ignore the sudden display of emotion; he hates when Pansy does that. \"And normally it smells revolting – tastes awful, too. What I'm trying to do is make it more appealing, because it's – it's sort of a last resort thing. People don't normally want to take it, anyway, and – I just thought – it wasn't helping that it wasn't very appealing.\" Suddenly, he feels a bit on display; he coughs awkwardly and sticks his quill behind his ear. </p>\n<p> </p>\n<p>\"Couldn't you just make it – any sort of generic good smell?\" Pansy asks gently.</p>\n<p> </p>\n<p>\"I want it be alluring, not just pleasant,\" says Draco, hating her gentleness. \"I want people to feel compelled to take it.\" He pauses, and before she say anything in response to him, he adds, \"Your amortentia smells like a muggle <em>lingerie</em> shop?\"</p>\n<p> </p>\n<p>\"Fuck you,\" says Pansy. \"Lingerie is sexy, isn't it? What's yours smell like, then?\"</p>\n<p> </p>\n<p>The scent is still lingering in Draco's nose from his last moment leaning over it – the deep, floral tang of his mother's perfume – the strange, damp, mixed chemical and parchment scent of the Hogwarts potions lab – and something else, a bit like leather and wet grass, a smell that reminds him of brisk air and Quidditch and something he can't place.</p>\n<p> </p>\n<p>\"That is none of your business,\" says Draco.</p>\n<p> </p>\n<p>\"I told you mine,\" says Pansy, pouting.</p>\n<p> </p>\n<p>\"I didn't ask,\" Draco points out.</p>\n<p> </p>\n<p>Pansy throws back her head and sighs, loud and long, her legs dangling over the desk and her red heels dangling from her toes. \"Well,\" she says, \"It looks like you've made good progress, so why don't you come out with us, then?\"</p>\n<p> </p>\n<p>\"I haven't really,\" says Draco. \"I still have to make sure the ashwinder eggs haven't cancelled out the effects of the – \"</p>\n<p> </p>\n<p>\"<em>Ugh</em>,\" says Pansy. \"I'm going to make Blaise come through. He'll make you see reason.\"</p>\n<p> </p>\n<p>Draco snorts. \"That's likely.\"</p>\n<p> </p>\n<p>Pansy dashes over to the fire, grabs some floo powder, and sticks her head in, arse in the air. Draco rolls his eyes and returns to his notes.</p>\n<p> </p>\n<p>Following a familiar swooshing noise, Blaise's voice announces, \"Draco Malfoy,\" as if he intends to scold him. Draco chooses to respond only with the most derisive eyebrow raise he can muster. Blaise is standing in the fireplace and brushing dust and ash off of his tall, imposing figure, also wearing muggle clothing – a blazer and stylish trousers – and smiling at Draco in his obnoxiously self-assured way.</p>\n<p> </p>\n<p>\"Oh, stop it with that <em>look</em>,\" says Blaise, loud as ever. \"Pants and I just want to take you out, you miserable bugger, seeing as you're to be saddled with a small child for the next three weeks and we won't get another chance for <em>all that time</em>.\" He says \"small child\" like he might say \"Gryffindor,\" suggesting bemusement and some distaste about their necessity in the world despite his basic understanding of their function. Blaise had reacted to Teddy Lupin's presence at Draco's recent birthday party by ignoring him with a barely perceptible air of baffled mistrust whenever he toddled into view; Pansy, on the other hand, had been surprisingly charmed, especially after Teddy had asked after her as \"the pretty lady.\"</p>\n<p> </p>\n<p>\"Oh, he's just like a little person!\" she said, clutching her face.</p>\n<p> </p>\n<p>\"Imagine that,\" Draco replied dryly.</p>\n<p> </p>\n<p>\"Don't start,\" said Pansy, slapping him on the arm. \"I mean he's not a messy brat at all, he's a lovely, polite little thing. He's got Black blood for certain.\" Draco's not sure about the polite way Teddy behaves coming from Black blood; he has a mischievous edge, and the way he behaves tends to remind Draco quite strongly of his parents, particularly Remus Lupin.</p>\n<p> </p>\n<p>Whenever Draco thinks of Teddy, he feels so strange and tender. It's something he has only ever felt for his mother and Pansy and Blaise, and even Gregory and Vincent, though he doesn't think he realized he felt that way about them until he watched Vince die – and maybe he felt it for his father once, too, when he was small. But it's something he is not used to feeling for someone so small and vulnerable, with a charming little laugh and big brown eyes and little fingers. When his mother first reconciled with her sister, and Narcissa insisted Andromeda bring the child to the manor for tea, Teddy was a year old, and Draco had no clue how to handle him. He imagined they'd all have tea together and his Aunt would look after the messy, foreign child, but Teddy instantly toddled over to Draco, babbling and laughing and wanting to hold onto his hand and causing him to become increasingly alarmed.</p>\n<p> </p>\n<p>\"It won't leave me alone, what am I supposed to <em>do</em> with it?\" he hissed to his mother in a brief moment of privacy, and she <em>laughed</em> at him, the miserable woman. </p>\n<p> </p>\n<p>But Draco has learned by now that he does not have to talk to children the way some people insist upon doing, with simpering baby talk, and perhaps it is not the fault of small children that stupid adults talk to them like they don't understand a thing and fail to properly discipline them. Teddy is properly disciplined – he's being raised by a Black, after all – and really very polite, even he does get food on his face sometimes, or get a bit talkative and silly. Teddy understands Draco just fine, and in fact seems to do so more quickly than most adults. He talks to Teddy about his work, in the simplest terms he can, and Teddy does not roll his eyes or say he works too hard but looks up at him with shining admiration. He reacted to his first glimpse of Draco's dark mark with, \"Ooh, that's proper scary, why's it there?\" and had accepted \"I made a mistake\" with a grave nod and nothing else. Draco thinks he loves his little cousin, who is so much better than the noisy, messy brats he imagined all children to be. The last time Andromeda and Teddy came round, Teddy fell asleep on Draco's lap while he read one of his giant texts, and the rise and fall of his little chest and the lolling of his little turquoise tufted head filled Draco with a strange warm fondness he didn't know what to do with.</p>\n<p> </p>\n<p>Of course, all that doesn't mean he wants a small child around for three weeks while he tries to complete a report on his research. Teddy may be polite and interested, and Draco may have learned how to talk to him, but that doesn't mean he knows how to <em>live</em> with a child, to do all the things they need done every day. He will have to focus on things other than work, provide Teddy with food and baths and entertainment and some kind of bedtime ritual, and whether Draco likes the child or not, that's a bit too much like <em>parenting</em> for his taste. His mother, however, will not allow him to refuse Andromeda – \"She needs a holiday, and it will be good for you, darling,\" she keeps saying.</p>\n<p> </p>\n<p>\"Can't she make his irritating boy hero godfather do it?\" Draco keeps asking in response. \"Doesn't he normally jump at the chance to make people owe him things?\" Narcissa only ever responds to this with a raised eyebrow, and the conversation inevitably ends with an eyebrow heavy stare-off, and Draco is most definitely going to be stuck with a toddler for three weeks.</p>\n<p> </p>\n<p>Potter's probably too busy doing Merlin knows what he does nowadays - something stupid and heroic, probably - to look after his own godson. How selfish of him. This is only proof that Potter doesn't <em>really </em>do things <em>for</em> people; he does things because he thinks they'll make him look good. Merlin, Draco can't stand him, Potter and his heroism, and his stupid face in the papers all the time looking all intense, and his making Draco <em>owe</em> him by testifying at his fucking trial. </p>\n<p> </p>\n<p>Draco realizes that he is mentally ranting about Potter again and blinks. Blaise and Pansy are just staring at him. \"<em>Hello</em>, Draco,\" says Blaise. \"Did you hear me? This is your last chance, love. You're nearing three weeks without us inviting you out.\"</p>\n<p> </p>\n<p>\"Thank Merlin for small miracles,\" he says. The lack of Pansy and Blaise forcing their way into his home to make him do things will definitely be an upside.</p>\n<p> </p>\n<p>\"You are an utter useless prat,\" says Pansy.</p>\n<p> </p>\n<p>\"<em>Useless</em>?\" says Draco. \"<em>I </em>am trying to accomplish something. You lot spend all your time swanning about London spending all your money.\" He stubbornly pretends not to be aware that, had it not been for the war and everything that happened to him during and after, if he had left the country like Blaise or been largely uninvolved like Pansy, he would probably be doing the exact same thing.</p>\n<p> </p>\n<p>Pansy sighs. \"When did you become so boring?\" she says. \"Sometimes I think you ought to have been in Ravenclaw.\"</p>\n<p> </p>\n<p>Draco bristles. \"I am <em>ambitious</em>,\" he says.</p>\n<p> </p>\n<p>\"I am, as well,\" says Pansy. \"About getting you laid tonight. Well, mostly about getting myself laid tonight, but I imagine it'd be nice for all of us if you could get that stick out of your arse and put something else up it for once.\"</p>\n<p> </p>\n<p>Draco closes his eyes and puts two fingers to his temple, his elbow on the desk and his other hand reaching up to push his hair out of his face. He is horrified to find it a bit greasy; he gets a mental image of himself with Snape's hair and feels a bit sick. He may have respected his former professor immensely, and that may be part of the reason for Draco's interest in potions, but that doesn't mean Draco wants to let himself go to the point of <em>bad hair</em>. Maybe he <em>is</em> going a bit far with the dedication-to-his-work thing.</p>\n<p> </p>\n<p>\"At least come to dinner,\" says Blaise. \"I'll treat you, even. You can buy the most expensive meal at the restaurant out of spite. And then if you still want to shag someone, and you're not up for meeting strangers, we can all just shag each other.\"</p>\n<p> </p>\n<p>\"Absolutely not,\" says Pansy. \"I thought we agreed we were never doing that again.\"</p>\n<p> </p>\n<p>\"Well, yes, but is that what you'll be saying after a couple of bottles of wine?\" says Blaise. \"We are all fairly irresistible.\"</p>\n<p> </p>\n<p>\"You're not getting us into bed again, Blaise,\" says Draco.</p>\n<p> </p>\n<p>\"Draco's far too anti-twat for me,\" says Pansy. \"Of course <em>you</em> want to, Blaise, you get the most attention.\"</p>\n<p> </p>\n<p>\"Of course,\" says Blaise, flashing her a wicked smile, and then he puts a hand on Draco's shoulder and says solemnly, \"I shall never give up. Come to dinner, Draco? Please? You don't have to pay for a thing, not even with sex. I just want to see your gorgeous ferrety face.\" Draco scowls.</p>\n<p> </p>\n<p>\"Pretty please?\" says Pansy. \"I bet you've been working all <em>day</em>, Draco.\"</p>\n<p> </p>\n<p>\"Come to dinner with Pants and I,\" says Blaise. \"We will have a lovely time.\"</p>\n<p> </p>\n<p>\"We will if you don't keep calling me Pants,\" says Pansy. \"You're a nightmare, Blaise.\"</p>\n<p> </p>\n<p>Draco looks over at his potion, inhaling the wonderful perfume-chemical-parchment-Quidditch-<em>something</em> smell, and he feels suddenly quite good, inflated with a sense of having accomplished something. He feels like talking to <em>people</em>, not to mention forcing Blaise to pay for him to eat expensive food, might be an attractive idea after all.</p>\n<p> </p>\n<p>\"<em>Fine</em>,\" he says, tossing his quill to the side and running his fingers through his hair. <em>Ugh</em>, he thinks – and perhaps he really doesn't fancy becoming Severus Snape, either.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>When Harry goes to see Andromeda about her holiday, it only results in a telling off.</p>\n<p> </p>\n<p>\"Draco is perfectly capable of looking after Teddy, whatever you think of him,\" she tells him sternly. \"It will be good for them both. And it might do <em>you</em> well to learn that people <em>change</em>, Harry Potter. You've certainly changed over the years, haven't you?\"</p>\n<p> </p>\n<p>So, seeing that Andromeda clearly does not plan to back down, Harry has instead come up with one of his characteristically brilliant plans, all about the one thing he is certain he's best at: persistence.</p>\n<p> </p>\n<p>It's really all thanks to Hermione's suggestion that he go to the manor and talk to Malfoy. He knows she meant something polite and civilised and adult, but it's sparked another thought – perhaps Andromeda won't back down, but that doesn't mean Harry has to back down in response. He's not the type to let things go so easily. Maybe, <em>maybe</em>, he can just – keep turning up at the manor, insisting that he should be allowed access to his godson. Malfoy can't forbid Harry from visiting his godson, can he? That's not his place, is it? If Harry turns up nearly every day, perhaps Malfoy will get sick of it and give in and allow Teddy to stay with Harry – and if he doesn't, well, Harry will have spent nearly every day with Teddy, anyway.</p>\n<p> </p>\n<p>In all honesty, all this matters because it feels like a competition, like everything with Malfoy has always felt. It's not <em>fair</em> that Malfoy gets to have Teddy for three weeks, making Teddy like him even more, perhaps like him so much that he likes him <em>better</em>. It's not fair that Harry accidentally upsets Teddy and Draco impresses him. And it's definitely not fair that Harry does not get precedence over an ex-Death Eater in decisions about who gets to look after a small child.</p>\n<p> </p>\n<p>However, as Harry's not entirely sure when Andromeda is dropping Teddy off, showing up on the first day might mean accidentally running into her and making her even more cross with him than she already is, so he waits until the second day Teddy's meant to be at the manor before preparing to apparate to the front gates.</p>\n<p> </p>\n<p>Unfortunately, Ginny wakes up before he can leave and finds him in the kitchen, having his tea and toast. \"You're dressed,\" she says, ambling into the room in her pajamas, swiping a piece of toast out of the toaster before he can, and tearing a large bite out of the bread.</p>\n<p> </p>\n<p>\"Some people get dressed during the day,\" he points out.</p>\n<p> </p>\n<p>\"Yeah, some people,\" she says. \"Usually not you, if we're honest.\" She regards him thoughtfully, chewing her toast with one hand on her hip. \"Are you going to try to go to Malfoy's?\"</p>\n<p> </p>\n<p>\"Why would you think that?\" he says weakly.</p>\n<p> </p>\n<p>She rolls her eyes. \"I thought you'd go yesterday. Why didn't you?\"</p>\n<p> </p>\n<p>He sighs. \"Andromeda.\"</p>\n<p> </p>\n<p>\"Afraid she'd catch you?\" Ginny laughs, loudly and openly like she does, with her head thrown back. \"Mr. Boy Who Lived is afraid of Andromeda Tonks.\" She takes another large bite of toast.</p>\n<p> </p>\n<p>\"She'd be angry,\" he mumbles.</p>\n<p> </p>\n<p>\"No, she is quite scary when she's angry, I'll give you that,\" says Ginny with her mouth full, patting him on the shoulder as she wanders over to get more bread. \"I'm not even going to bother to try to stop you,\" she says more clearly. \"I know it's a waste of breath. Go be an obsessed idiot. Just don't upset Teddy again.\"</p>\n<p> </p>\n<p>\"What - I'm not <em>obsessed</em>, Ginny,\" Harry tells her back as she stands on tiptoe to reach the cups in the far right cabinet.</p>\n<p> </p>\n<p>\"Yeah, yeah,\" says Ginny, waving him away and putting two cups down on the counter.</p>\n<p> </p>\n<p>Harry frowns. \"Why are you taking out two cups?\"</p>\n<p> </p>\n<p>\"Oh, good, you didn't notice,\" she says lightly, flashing him a smirk before going about making tea. \"One of my teammates is upstairs.\"</p>\n<p> </p>\n<p>\"Ah,\" says Harry. \"Right.\" He gives her a thumbs up and apparates.</p>\n<p> </p>\n<p>He lands outside the elaborate, wrought-iron front gates of Malfoy Manor and blinks, his eyes adjusting from the dim Grimmauld Place kitchen to the bright sunshine. He peers through at the expansive grounds, impeccable and bright green in the summer sun. Sure enough, an albino peacock is strutting across the stone walkway leading to the imposing manor house, a place Harry has not been since the war. As he imagined, there are all sorts of wards keeping him out of the actual grounds - he can feel the magic rolling off the place - but his proximity to them must have caused some sort of alert. There's no way they haven't.</p>\n<p> </p>\n<p>So - he reckons he'll just - wait, then.</p>\n<p> </p>\n<p>By this time in his life, Harry is getting the distinct impression that most of his plans could be thought through just a bit more.</p>\n<p> </p>\n<p>The sun beats down on Harry's head, and it's not long before he's sweating and wondering about the best method for letting Malfoy know he's here. He holds onto the bottom of his t-shirt and flutters it back and forth a bit, trying to generate some sort of breeze. It's just when he does this that the gates creak open unexpectedly, making him jump back.</p>\n<p> </p>\n<p>He looks around. When nothing else happens and no one turns up, he assumes this means he's allowed to walk up to the house.</p>\n<p> </p>\n<p>He's about halfway up the long, hedge-lined walk when the peacock he spotted before ambles over the pathway again and spots him; it stops strutting and cocks its head to the left.</p>\n<p> </p>\n<p>\"Hello,\" Harry says, and then feels a bit ridiculous for speaking to a peacock. Ginny is always making fun of him for his tendency to speak to animals as if they can understand him. \"Well,\" he always says, \"Snakes understand, anyway,\" and she always rolls her eyes.</p>\n<p> </p>\n<p>The peacock responds to this by running up to him and, before he can properly react, pecking at his knee. \"What - <em>ow</em>!\" he says. He suddenly remembers Teddy's claim that Draco \"saves him from the peacocks.\" The bird pecks at him again, and before Harry knows it, he's running up the Malfoys' front walk being chased by a peacock, and he's pretty sure that if Malfoy sees this, he is not going to save him. Mocking is more likely.</p>\n<p> </p>\n<p>Sure enough, when he reaches the front doors, he hears familiar derisive laughter, and he knows who's standing there without looking - and he can't be bothered looking, anyway, because he's too focused on getting into the building and away from the feral peacock.</p>\n<p> </p>\n<p>When Harry skids into the wide, open foyer, feeling like he's probably just narrowly escaped death again, Malfoy simply says, \"Shoo - <em>shoo</em>, rabid fucking thing,\" waves the bird away, and shuts the door.</p>\n<p> </p>\n<p>\"What the <em>bloody</em> hell is wrong with your bird, Malfoy?\" says Harry, whirling to face him.</p>\n<p> </p>\n<p>He blinks, feeling a bit disoriented - probably from suddenly running all that way, especially in this heat.</p>\n<p> </p>\n<p>Malfoy...doesn't look exactly as Harry remembers him. He's wearing muggle clothes, for one thing, a dark sweater that looks really soft and the kind of jeans that are certainly a lot more expensive than Harry's. His features are not quite as pointy as Harry remembers; it's as if he's manage to properly grow into his cheekbones and his chin and his nose, and now he looks less like a peaky child and more like a haughty adult, though he's still even paler than Harry. His hair is not gelled like it was in school, but loose and just long enough for some of it to fall in his face in a fringe. He is also glaring at Harry.</p>\n<p> </p>\n<p>\"I have a better question, Potter,\" Malfoy says, leaning against the door and crossing his arms. \"What the fuck are you doing hanging around my house?\" A flicker of confusion intrudes on his steady glare for a moment, betraying how utterly baffled he is at Harry's appearance.</p>\n<p> </p>\n<p>Harry bristles and quiets the little voice in the back of his head reasonably informing him that he <em>has</em> just turned up unannounced at the home of someone who tormented him all through school, and he'd probably say the same thing if Malfoy turned up at his house without warning. \"Well, <em>you're</em> obviously just as rude as ever,\" Harry says, and the thing is, at this point in his life, he recognizes it as a stupid thing to say – but just a few words come out of Malfoy's stupid mouth in his stupid posh accent and Harry seems to lose all chance at reason.</p>\n<p> </p>\n<p>Malfoy sighs long-sufferingly. \"Is this what we're doing already, Potter?\" he says, sounding almost bored. \"<em>You</em> are obviously just as ignorant of basic social graces. You couldn't owl me with whatever it is you want? Or at least to inform me that you intended to turn up at my house after vanishing from my life for five years?\" He holds up a long-fingered hand and regards the back of it, purportedly examining his fingernails.</p>\n<p> </p>\n<p>\"'Vanishing from your life?'\" says Harry, aggressive and infuriated by Malfoy's indifferent tone. \"What, did you want me to stick around or something? I got the distinct impression from the years I was in your life that you weren't too keen on having me there. I had to return your wand to a house elf.\"</p>\n<p> </p>\n<p>Interestingly, Malfoy's cheeks flush, and he stops examining his hand. \"Why are you in my house, Potter?\" he asks again.</p>\n<p> </p>\n<p>\"Where's Teddy?\" says Harry.</p>\n<p> </p>\n<p>Malfoy arches an eyebrow. He's still leaning against the doorway, his arms crossed again, and he looks so superior that Harry remembers very strongly why he spent a lot of his time at school wanting to punch that arrogant look off his face. \"Is that any of your business?\"</p>\n<p> </p>\n<p>\"He's my godson,\" says Harry irritably. \"Of course it's my business.\"</p>\n<p> </p>\n<p>\"And right now I'm in charge of him, Potter,\" says Malfoy.</p>\n<p> </p>\n<p>\"Okay,\" says Harry. \"But I want to know where he is, <em>Malfoy</em>.\"</p>\n<p> </p>\n<p>\"He's in the garden with Pansy,\" he says. \"Why do you need to know?\" He frowns and straightens up a bit. \"Is everything alright with Andromeda?\"</p>\n<p> </p>\n<p>\"Yes,\" says Harry. He falters, realizing that he has not rehearsed anything to say, and really has no idea what he needs to convey to make his muddled plot work. He blinks.</p>\n<p> </p>\n<p>\"Okay,\" Malfoy says slowly, relaxing again. He slows his voice to an exaggerated crawl and says, \"So – why – are – you – <em>here</em>, Potter?\" When he again receives no answer, he finally seems to flare up, straightening up entirely and snapping, \"Merlin, did you quit the aurors because you sustained brain damage or what? I don't intend to spend my day standing around watching Harry Potter do a fish impression.\"</p>\n<p> </p>\n<p>Harry runs a frustrated hand through his hair, but he feels oddly triumphant at having finally caused some anger. \"I want to see Teddy because I'm his godfather,\" he says, \"And <em>I</em> should be the one looking after him, and quite frankly, I don't trust you with him! I don't trust you at all.\"</p>\n<p> </p>\n<p>Malfoy narrows his eyes. Harry notices that they're grey eyes, and then realizes that he knew that, actually - but that's okay. It's normal to notice the colours of people's eyes.</p>\n<p> </p>\n<p>\"And how did you know I quit the aurors?\" Harry adds, dropping the hand in his hair.</p>\n<p> </p>\n<p>\"I read the <em>papers</em>, Potter,\" Malfoy spits, and Harry knows he has <em>really</em> gotten him angry now, and this sends a little thrill down his spine. It's been so long since he really flat out <em>fought</em> with anyone, and Malfoy's always been the absolute best person to fight with, the sort of person who can give to Harry everything Harry gives him to him without blinking. \"<em>Everyone</em> knows you quit the aurors,\" Malfoy continues. \"People seem to find the inane ins and outs of your life <em>newsworthy</em>, Merlin knows why.\"</p>\n<p> </p>\n<p>\"Nobody's forcing you to read the bits about me,\" says Harry.</p>\n<p> </p>\n<p>\"I'm not prepared to stand here talking about your press coverage,\" says Malfoy.\"I'm sure you do it enough, and that is not what we are doing. What you are doing, apparently, is turning up without warning at my home and insulting me, and what I am doing is telling you to get the fuck out of my house. Teddy is my family, as well, and I'm perfectly capable of looking after him, thanks much for your concern.\"</p>\n<p> </p>\n<p>\"You're not even with him right now!\" says Harry. \"You've got your girlfriend looking after him!\"</p>\n<p> </p>\n<p>Malfoy lets out a derisive snort. \"Pansy's not my <em>girlfriend</em>,\" he says. Harry feels a strange pang of triumph, or validation, or <em>something</em>; Luna eventually told him this yesterday, but for some reason, he wanted to hear it from Malfoy. \"Though it's not any of your business. And of course I'm not with Teddy right now, as I am being forced to stand in my foyer and listen to an uninvited, brain damaged Gryffindor with a disgustingly black and white worldview and absolutely <em>no</em> knowledge of me, whether he thinks he does or <em>not</em>, babble about how <em>untrustworthy </em>I am.\" He takes a big breath and says, raising his voice even more, \"Kindly get <em>out</em>, Potter, before I hex you, and don't think I won't – I'm <em>really</em> not bothered about what everybody will think if I hurt their precious saviour one more time.\"</p>\n<p> </p>\n<p>Malfoy's eyes are positively burning with rage. Harry can <em>feel</em> it, feel the crackle of Malfoy's magic against his own. For a moment he feels quite breathless.</p>\n<p> </p>\n<p>\"I'm not <em>joking</em>, Potter,\" Malfoy snaps, taking out his wand.</p>\n<p> </p>\n<p>Harry's hand flies automatically to his own in his back pocket. For a moment he is quite prepared to duel Malfoy, even excited about it, and then he remembers Teddy. He remembers the little boy's wobbling lower lip, the one that appeared when Harry acted like he hated Malfoy. Hexing Malfoy with Teddy just outside is not exactly a good way to fix this.</p>\n<p> </p>\n<p>He lowers his wand. \"Fine,\" he says, and he realises he's breathing quite heavily. \"I'm not going to hex you with Teddy just outside.\"</p>\n<p> </p>\n<p>\"Oh, you're so fucking merciful, Potter,\" Malfoy scoffs.</p>\n<p> </p>\n<p>\"It's for Teddy,\" says Harry. \"Not you.\"</p>\n<p> </p>\n<p>Malfoy lets out a harsh breath, like he almost wants to laugh, his fringe blowing up out of his face, and rolls his eyes in as exaggerated a fashion as possible. \"Thank you <em>so</em> much for clearing that up,\" he says. \"I was wondering.\"</p>\n<p> </p>\n<p>\"I'm leaving for now,\" says Harry, tucking his wand cautiously back into his back pocket. \"But don't think it means I trust you.\"</p>\n<p> </p>\n<p>\"Wouldn't <em>dare </em>dream of it,\" says Malfoy.</p>\n<p> </p>\n<p>\"And don't think this means you've seen the last of me.\" This came out with a bit more drama than Harry intended, and Malfoy's contemptuous look indicates he hasn't failed to notice how stupid it was. Harry's face heats.</p>\n<p> </p>\n<p>\"Oh, you're scary, Potter,\" Malfoy says. \"What are you, some kind of film villain?\"</p>\n<p> </p>\n<p>Harry blinks. \"Film?\" he repeats. \"Do you watch muggle films?\"</p>\n<p> </p>\n<p>\"None of your business, Potter. Could you just get the fuck out of my house? And <em>please</em>, for Merlin's sake, let this be <em>the last I see of you</em>.\" His voice is dripping with disdain for Harry's earlier comment, and Harry really, <em>really</em> wants to hit him, but Malfoy suddenly grabs onto his arm. Before Harry can properly react, Malfoy opens the door and shoves him unceremoniously out of it, slamming it hard and leaving Harry breathing heavily on the doorstep. If he'd expected Malfoy to touch him, he wouldn't have let him do it. He would have hexed him. He does not want Malfoy to touch him.</p>\n<p> </p>\n<p>Now he's standing here dazed and furious, a lingering scent of cinnamon in his nostrils which he imagines must be the scent of Malfoy, and he reckons as it is his best plan would be to apparate now and try again tomorrow.</p>\n<p> </p>\n<p>He arrives on the front steps of Grimmauld Place the moment that Ginny and a pretty girl with dark skin and curly hair he presumes to be the Harpies player are leaving. \"I assume that went well,\" says Ginny.</p>\n<p> </p>\n<p>\"Sod off,\" says Harry, storming into the house and not really caring if he's offended the sensibilities of her one night stand.</p>\n<p> </p>\n<p>He's overwhelmed with energy in a way like he hasn't been in a long while; he can't sit down, but he doesn't know what to do to keep moving, so he paces all round the kitchen until he decides he needs to rant to <em>someone</em> and grabs some floo powder off the mantelpiece.</p>\n<p> </p>\n<p>\"Neville!\" he calls, sticking his head in the fireplace. \"<em>Neville</em>!\"</p>\n<p> </p>\n<p>He is greeted instead by Ernie Macmillan, who is sitting on the couch reading a book. Harry's been finding him at Neville's flat fairly often lately, which is not a surprise, as apparently he is the new boyfriend. Harry doesn't have a <em>problem</em> with Ernie as a person, but there's something about this that annoys him. Ginny asked him if this meant he was actually in love with Neville; he tried to imagine it and his body responded with a <em>no, no, weird</em>, <em>really weird</em>, so he doesn't think this is the case. But then he doesn't know why it makes him feel strange for Neville to have a pompous blond boyfriend.</p>\n<p> </p>\n<p>Ernie peers over the binding and says cheerfully, \"Harry! To what do we owe the pleasure?\"</p>\n<p> </p>\n<p>\"Is Neville there, Ernie?\" Harry says impatiently.</p>\n<p> </p>\n<p>\"Yes, he's in the kitchen making tea, come right through!\"</p>\n<p> </p>\n<p>Harry scrambles through the fireplace with no regard for the soot he gets all over the place. \"I've been to see Malfoy,\" he says as Neville pokes his head round the kitchen doorway.</p>\n<p> </p>\n<p>Neville sighs.</p>\n<p> </p>\n<p>\"Oh, dear,\" says Ernie. \"What would possess you to do something like that?\"</p>\n<p> </p>\n<p>\"He's hoarding my <em>godson</em>,\" says Harry. \"And his peacock chased me!\"</p>\n<p> </p>\n<p>\"Can you <em>hoard</em> a child?\" says Neville. \"Harry, he's just looking after him.\"</p>\n<p> </p>\n<p>\"His...peacock?\" says Ernie.</p>\n<p> </p>\n<p>\"He wouldn't let me see him!\" says Harry, ignoring Ernie. \"He just got pissed off and threatened to hex me.\"</p>\n<p> </p>\n<p>\"Well,\" says Neville patiently. \"What did you say to him?\"</p>\n<p> </p>\n<p>\"Just the truth!\" says Harry, refusing to feel embarrassed, because it is perfectly reasonable of him to have told the truth.</p>\n<p> </p>\n<p>\"Which is?\"</p>\n<p> </p>\n<p>\"That I don't trust him!\"</p>\n<p> </p>\n<p>Neville sighs again and says, \"Come have some tea, Harry.\"</p>\n<p> </p>\n<p>\"I don't want any tea,\" Harry grumbles.</p>\n<p> </p>\n<p>\"Of course you do,\" says Ernie, bustling over to the kitchen. \"It will calm you down.\"</p>\n<p> </p>\n<p>\"I'm <em>calm</em>,\" says Harry, grabbing at his soot covered hair, which is standing on end even more than usual from constantly running his fingers through it.</p>\n<p> </p>\n<p>When they're sitting in the kitchen with their tea, Harry getting more and more irritated every minute by Ernie's bustling about and tutting, Neville says, \"I haven't seen you this riled up in a while.\"</p>\n<p> </p>\n<p>\"I haven't been forced to see Malfoy's ugly face in a while,\" Harry says, except when he says this it occurs to him that it comes along with the strange pang he always feels when he lies. Okay, so he noticed that Malfoy's face isn't exactly <em>ugly</em>, but - <em>whatever</em>, it doesn't make a difference.</p>\n<p> </p>\n<p>\"Hmm,\" says Ernie thoughtfully, peering at Harry in an irritatingly knowing way over his teacup.</p>\n<p> </p>\n<p>\"Well,\" says Neville. \"Exactly.\"</p>\n<p> </p>\n<p>\"What do you mean, <em>exactly</em>?\" says Harry.</p>\n<p> </p>\n<p>\"I never see you this irrationally riled up unless it's something to do with Malfoy,\" Neville says bluntly.</p>\n<p> </p>\n<p>\"Yeah, well – because he's a <em>git</em>,\" says Harry. \"Why does everybody keeping pointing out that I get irrational about Malfoy like it's some meaningful thing? He is a <em>git</em>, and it makes me <em>mad</em>, and I think I have a right!\"</p>\n<p> </p>\n<p>\"Okay, okay,\" says Neville. \"I know he's a git. But...Teddy must like him for some reason, Harry. And I really don't think Teddy's in any danger at the Malfoys. You know they care about their family, and Andromeda knows what she's doing.\"</p>\n<p> </p>\n<p>Somewhere inside himself, Harry really does know he's being ridiculous, and yet nothing within him seems to have any inclination to stop him from standing up, kicking over his chair, and announcing, \"Nobody <em>gets</em> this,\" before storming off to the fireplace.</p>\n<p> </p>\n<p>\"Goodness,\" he hears Ernie say, \"Has he not grown out of that sort of thing yet?,\" which only makes Harry angrier.</p>\n<p> </p>\n<p><em>What</em> is it about Malfoy that makes him carry on like he's fifteen?</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>\"<em>Fuck's</em> sake!\" Draco yells, kicking the wall as he hard as he can. It was a bad idea; his big toe throbs heavily. \"Merlin's <em>fucking </em>- \" He waves his fists around and remembers at the last minute that planting one in the wall would be just as terrible as, if not worse than, the toe incident. \" – <em>balls</em>!\"</p>\n<p> </p>\n<p>Pansy pokes her head around the corner, eyebrows approaching her hairline. She has her red tipped fingers pressed over Teddy's ears. \"What's got your knickers in a twist?\" she demands. \"Who breached the wards?\"</p>\n<p> </p>\n<p>\"Would you believe - \" he starts, and then he looks at Teddy's shocked little face and swallows his words. He clears his throat. \"Hello, Teddy,\" he says, unable to keep his voice from sounding oddly strangled. \"Are you tired of the garden?\"</p>\n<p> </p>\n<p>\"We heard you shouting,\" says Teddy, his brown eyes wide.</p>\n<p> </p>\n<p>\"Yes, I'm just a bit - I'm a bit angry,\" says Draco quickly. He sounds hysterical. He can't help it. He <em>is</em> hysterical. He cannot believe that Harry fucking Potter just turned up at his front gates, hair all over the place, eyes exactly as green as Draco remembers, and told him off like they're still sixteen. Draco has not had to deal with his incredibly irritating, irrationally aggressive, stupidly fit presence in <em>years</em>. <em>Stupidly fit</em>, he thinks hysterically. <em>Even in terrible ratty jeans and a t-shirt. What an absolute arsehole. </em>\"It's nothing to do with you,\" Draco insists to Teddy. \"I - why don't you go to my study and get your - your drawing things and let me speak to Pansy for a moment?\"</p>\n<p> </p>\n<p>Teddy throws him an unsure look, biting his lip. \"Go on,\" says Pansy, patting him on the bum and pushing him in the right direction. He looks between them for a moment, then dashes off towards Draco's study.</p>\n<p> </p>\n<p>\"Who was it?\" Pansy whispers.</p>\n<p> </p>\n<p>\"Would you believe <em>Harry bloody Potter</em>?\" he hisses.</p>\n<p> </p>\n<p>\"Ah,\" says Pansy. \"No wonder you're having a fit.\"</p>\n<p> </p>\n<p>\"I'm not – \" Draco starts, and then realizes the complete pointlessness of that and just says, \"Fuck,\" again.</p>\n<p> </p>\n<p>\"What did he want?\" asks Pansy.</p>\n<p> </p>\n<p>\"To storm in unannounced and tell me I'm not trustworthy, apparently!\" rages Draco. \"He wants to look after Teddy because he doesn't <em>trust</em> me to do it. What does that <em>mean</em>? What does he expect, that I'll boil him in one of my cauldrons? Stuff him in a vanishing cabinet? Brand him with the dark mark? Fuck's <em>sake</em>, it's been five years! I'm an adult! I can look after a child! Apparently it was <em>wrong</em> of me to ask you for help, or whatever – 'You're not even looking after him, you've got your girlfriend doing it' – what makes Potter any more qualified? At least <em>I'm </em>not likely to come up behind a bloke in the toilets and <em>slice him to pieces</em>!\"</p>\n<p> </p>\n<p>\"Hang on,\" says Pansy. \"Are you serious? He just turned up unannounced and told you he didn't trust you to look after your own cousin?\"</p>\n<p> </p>\n<p>\"<em>Yes</em>.\"</p>\n<p> </p>\n<p>\"The <em>nerve</em>,\" says Pansy, straightening up and sticking out her chest, which has quite an impressive effect. She seems properly outraged and does not point out that Draco has been complaining about being stuck with Teddy, and this pleases Draco. \"What an arsehole. Wait 'til we tell Blaise. Fucking Gryffindors, think they've got a right to stick their noses into everything.\"</p>\n<p> </p>\n<p>Draco gets a closer look at Pansy's hot pants and says, \"Were you in the garden playing with a child wearing that?\"</p>\n<p> </p>\n<p>\"Have you got a problem?\" says Pansy, putting a hand on her hip. \"You know, I've half a mind to turn up randomly at <em>Potter's</em> and tell <em>him</em> he's not fit to babysit.\"</p>\n<p> </p>\n<p>Draco, who has finally managed to regain some level of control, rakes shaky fingers through his hair and says heavily, \"Don't. You know – honestly – I'd rather just forget it.\"</p>\n<p> </p>\n<p>Pansy gives him a strange look, furrowing her brow. \"Forget it?\" she repeats.</p>\n<p> </p>\n<p>\"Yes. Pansy. I'd rather just – I really don't need – \" He hates himself for his sudden failure to find the proper words, especially when Pansy suddenly purses her lips.</p>\n<p> </p>\n<p>\"Still looking fit, then?\"</p>\n<p> </p>\n<p>\"Shut <em>up</em>,\" Draco snarls. He counts the day Blaise and Pansy got him drunk and started him talking about Potter as one of the most embarrassing of his life. He never meant to confess to <em>anyone </em>that around sixth year he'd realised, before everything went to shit and with a vague sense of horror, that he found Potter really rather – attractive – and that maybe his obsession had had a bit to do with that for a while. Draco still thought Potter was an arrogant idiot, but he was also getting more and more obnoxiously attractive, and it made Draco even angrier. Arrogant idiots who were not at all quiet about how much they hated Draco had no right to go round all the time looking all windswept and fit, with nice arms and shoulders and hands and <em>arse</em>. Quidditch is a terrible, horrible thing. Draco hates Quidditch, and he hates Potter, and he hates Blaise and Pansy, who <em>know</em>.</p>\n<p> </p>\n<p>\"Eloquent,\" says Pansy lightly.</p>\n<p> </p>\n<p>\"I <em>loathe</em> you, Pansy. He's <em>not</em> attractive. He's a prat.\"</p>\n<p> </p>\n<p>\"They're not really mutually exclusive traits, darling – you yourself are a perfect example of that.\"</p>\n<p> </p>\n<p>\"I don't – \" Draco stares at her, unsure how to take this, as it at least half a compliment. \"Pansy, I'm not attracted to him. I had a bit of a – when I was <em>sixteen</em> I thought he was a bit – it's nothing, okay? I just don't have time to worry about Potter. Let him go round being an idiot. I couldn't care less. I have things to do and no time to give him the attention he's obviously begging for. I'm going to look after the child I'm apparently not to be trusted with.\"</p>\n<p> </p>\n<p>Draco and Pansy find Teddy sitting at Draco's desk, colouring with quiet concentration. It's with a sense of great dread that Draco realises his research notes are in the process of being covered by doodles of Pansy.</p>\n<p> </p>\n<p>Draco places two fingers to his temple, where he can already feel a headache blooming. These next few weeks are going to be a pain in the arse.</p>\n<p> </p>\n<p>Next day, Luna comes round with a phial of Salamander Blood, as Draco's run out, needs it for his potion, and doesn't really feel prepared to nip out to Diagon Alley with a small child, and Luna's father always seems to have ingredients like this lying around. Draco is always pleased to see her; Pansy was right about that. She is much quieter and more thoughtful than his other friends, and so wonderfully forgiving that Draco almost feels guilty sometimes when he speaks to her. He doesn't care if people think she's a bit mad. She is, but Draco's probably a bit mad himself, and sometimes it's Luna's sudden moments of off-the-wall inspiration that cause Draco's potion work to be a success.</p>\n<p> </p>\n<p>\"Yes!\" he says when she hands over the phial, giving her a rare \"Thank you\" and hurrying to check the amount indicated in his notes. The measurement, luckily, has just missed being obscured by a bit of crayon-Pansy's hair. Draco never had crayons when he was small; he had colour changing paints and inks. Crayons are a muggle thing, and of course when Draco asked Teddy where he'd got his set, he'd said, \"From my godfather Harry!,\" and Draco had to pretend this didn't make him irrationally angry. He doesn't need reminders of Potter's episode of self righteousness <em>everywhere</em>.</p>\n<p> </p>\n<p>\"Where is Teddy?\" Luna asks, leaning to peer into Draco's cauldron. \"Ooh, this is rather nice. You've really got it to smell properly, I think – dirigible plums and pudding and paint like Dean uses – this must be right, I rather like all that. What's your amortentia smell like?\"</p>\n<p> </p>\n<p>\"Teddy's just run off to get his crayons,\" says Draco. \"He'll be here in a moment. My amortentia – it's – not important.\" He always feels obnoxiously bad deceiving or keeping things from Luna; it must have something to do with how wide and innocent and <em>sincere </em>her eyes always seem, no matter what she's saying. Though he's not really sure why he has to keep the scents he experiences with amortentia a secret – everybody else seems to be quite open about it. It just feels – private. He thinks of that Quidditch-like smell and opens the drawer containing a few droppers rather aggressively. \"Luna,\" he says, picking one, \"Is Harry Potter criminally insane?\"</p>\n<p> </p>\n<p>Luna laughs. \"He's just as sane as we are, I think,\" she says.</p>\n<p> </p>\n<p>Draco sighs. \"I don't know that I'm reassured.\"</p>\n<p> </p>\n<p>\"Why do you ask?\"</p>\n<p> </p>\n<p>\"He came round here yesterday, shouting about not trusting me with Teddy.\"</p>\n<p> </p>\n<p>Luna frowns. \"That's really very rude of him,\" she says. \"Sometimes he doesn't seem to think about whether or not he's being rude. Especially when it comes to you.\" She blinks, looking thoughtful. \"He's always going on about you, Draco.\"</p>\n<p> </p>\n<p>\"Fabulous,\" says Draco. \"Saying wonderful things, I imagine.\"</p>\n<p> </p>\n<p>\"It's strange,\" says Luna. \"<em>I</em> think it's like he <em>wants</em> to find reasons to talk about you. He found out we're friends just last week, and all day he asked me questions about you. I didn't really tell him anything, but he wanted to know what you did with Teddy, and was Pansy your girlfriend, then, and why did you still live with your mum, and what you've been doing cooped up in the manor, and things like that.\"</p>\n<p> </p>\n<p>\"I don't blame him,\" Draco shrugs, carefully putting three drops of salamander blood into the cauldron with soft hisses. \"I <em>am </em>fascinating.\"</p>\n<p> </p>\n<p>Luna smiles in her dreamy way. \"You are,\" she says. \"I think he fancies you a bit.\"</p>\n<p> </p>\n<p>Draco, who was just about to begin stirring his potion seven times counter clockwise as appropriate, nearly knocks the cauldron right off his desk. \"<em>Fuck</em>, Luna,\" he says, steadying himself. \"<em>What</em>?\"</p>\n<p> </p>\n<p>\"I think he fancies you a bit,\" she repeats.</p>\n<p> </p>\n<p>\"No, I – <em>heard</em> you, just – what sort of comment is that? Potter <em>hates</em> me, he's just – annoying, that's why he – does he even – he's not <em>gay</em>, is he?\"</p>\n<p> </p>\n<p>Luna gives him her interested look, something he's seen more often directed at a potion or an animal or a page in the Quibbler than a person. Draco realizes how incoherently he responded and feels himself flush, which probably makes it even worse.</p>\n<p> </p>\n<p>\"Yeah, he is,\" she says carefully. \"He dated a muggle for a bit, this younger blond boy from a coffee shop. <em>I </em>thought he looked a bit like you, and Harry thought he was right gorgeous. Don't tell anybody that might tell the Prophet, OK? I mean, it's not a big secret, all of us know, but he and Ginny don't really feel like having it all over the papers yet.\"</p>\n<p> </p>\n<p>\"Does it really matter what Weasley feels about it?\"</p>\n<p> </p>\n<p>\"Oh, I just mean she's gay, as well.\"</p>\n<p> </p>\n<p>Draco nearly chokes on his own spit. \"They're <em>both</em> – they were – \" He laughs, suddenly and loudly, surprising even himself. \"Merlin, that's really good. That's fantastic. Of <em>course</em> they are.\"</p>\n<p> </p>\n<p>\"Draco,\" Luna says in a warning tone.</p>\n<p> </p>\n<p>\"<em>What</em>?\" says Draco. \"I'll keep it to myself, alright?\"</p>\n<p> </p>\n<p>He feels a bit lightheaded. Potter is gay? Fit Potter with his awful eyes is <em>gay</em>. Draco begins stirring the potion as appropriate. Well – it <em>is</em> true that he seemed to have a bit of a thing for flat-chested athletes at school.</p>\n<p> </p>\n<p>Draco remembers what brought on this conversation and says, heart pounding for some stupid reason, \"Luna, why would you think he <em>fancied</em> <em>me</em>? Just because he dated one bloke who you think looked a bit like me? He can't stand me.\"</p>\n<p> </p>\n<p>\"Well, that's the thing,\" says Luna. \"He hasn't seen you for ages and he still goes on and on whenever he can about you. It's very irrational. I think maybe he thinks you're a bit of a prat, but also he fancies you a bit, or at least he notices you're fit, because you are, and it gets him really cross. And you know – fine line and all that.\"</p>\n<p> </p>\n<p>\"That makes no sense whatsoever,\" says Draco, remembering how angry it made him when he realized Potter was annoying levels of attractive. He blinks. \"You think I'm fit?\"</p>\n<p> </p>\n<p>Luna shrugs. \"Oh, hello, Teddy,\" she says brightly, and Draco turns around to see the little boy walking through the doorway, pad of paper and box of crayons in hand. \"I suppose you're responsible for Pansy being all over Draco's notes?\"</p>\n<p> </p>\n<p>\"I said sorry,\" Teddy says quickly.</p>\n<p> </p>\n<p>Luna laughs. \"I'm sure you did,\" she says.</p>\n<p> </p>\n<p>\"And I said I forgive you,\" Draco reminds him, not wanting Luna to think he's a complete tyrant over this child. Teddy walks over and, quite unexpectedly, hugs Draco's legs. \"Oh,\" says Draco. He cannot really hug Teddy back, and is not very used to hugging, anyway, so he awkwardly pats Teddy's head. \"What's the matter, then?\"</p>\n<p> </p>\n<p>\"Nothing,\" says Teddy. \"I wanted to hug you because I love you.\" He lets go, then climbs up onto Draco's chair to continue his colouring.</p>\n<p> </p>\n<p>\"Right,\" says Draco, bewildered. \"Right. Yes. Er – I – love you, too.\" He's not sure he has ever said this to the child, but he thinks it's probably true.</p>\n<p> </p>\n<p>Luna smiles.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>When Harry comes downstairs the morning after his visit to Malfoy and admittedly embarrassing fit of temper in Neville and Ernie's kitchen, he is in the mood to sulk. Instead, he nearly has a coronary at the sight of Ginny calmly having tea with Pansy Parkinson.</p>\n<p> </p>\n<p>Pansy Parkinson, a person he never expected to see again, the girl who was prepared to turn him over to Voldemort for her own safety, is having tea in his kitchen in a rather revealing v-neck jumper and very short shorts, and once again, he is in only his pants.</p>\n<p> </p>\n<p>Pansy puts down her cup with a <em>smack</em> next to her silver handbag; there is pink lipstick along the rim. \"Good,\" she says. \"You're up.\"</p>\n<p> </p>\n<p>\"Er,\" he says, too effectively gobsmacked to say anything approaching actual words.</p>\n<p> </p>\n<p>Pansy stands and places her hands on her hips. \"I thought I'd just turn up unannounced and tell you you're an arsehole,\" she says. \"Seeing as you seem to feel qualified to do it to other people.\"</p>\n<p> </p>\n<p>\"Er,\" Harry says again.</p>\n<p> </p>\n<p>\"My face is up <em>here</em>, Potter,\" she snaps, and Harry realizes with faint horror that he's been staring at her cleavage. He has no idea how to convey to her that it's not out of lechery but simply out of not having been prepared to see that much of it ever in his life, or if he really wants to communicate that to her at all.</p>\n<p> </p>\n<p>Ginny, from her spot at the table, snickers. \"You can't really blame him, can you?\" she says innocently.</p>\n<p> </p>\n<p>\"What do you mean by that?\" Pansy snaps, tossing her dark hair over her shoulder as she turns to glare at Ginny.</p>\n<p> </p>\n<p>\"Keep your hair on,\" says Ginny. \"I meant it as a compliment.\" She smirks.</p>\n<p> </p>\n<p>Pansy gives her an odd look and turns back to Harry. \"Anyway,\" she says. \"You're an aresehole, and you'll kindly <em>not</em> go storming back to Draco's to insult him when he's done absolutely nothing to you – \"</p>\n<p> </p>\n<p>\"What do you mean he's done <em>nothing </em>– \" Harry begins, finally finding his voice.</p>\n<p> </p>\n<p>\" – for <em>the last five years</em>, Potter, fuck's sake, we're adults. Maybe it's <em>you</em> who shouldn't be allowed near a child if you're still storming around picking fights with somebody who called you a mean name in first year.\"</p>\n<p> </p>\n<p>\"Sorry?\" says Harry. \"I don't know where you were, but it was a <em>bit</em> more than a mean name in – \"</p>\n<p> </p>\n<p>\"You're boring me,\" says Pansy. \"I'm leaving. And you'll leave Draco alone, if you know what's good for you. Weasley here might think she's an expert at Bat Bogey Hexes, but none of you have ever had to cross me.\" She snatches her handbag up off the table and slings it over her arm. \"And for the record, Draco adores that child, however surprising it might be to you that former Death Eaters can have feelings. Get over yourself, Potter. Gryffindors don't have a monopoly on love.\" She struts out of the kitchen.</p>\n<p> </p>\n<p>Harry and Ginny listen to her heels click on the stairs, through the hallway, and out the front door before Ginny says, \"Phwoar.\"</p>\n<p> </p>\n<p>Harry rounds on her. \"Honestly?\"</p>\n<p> </p>\n<p>\"A bit,\" says Ginny. \"<em>You</em> were the one staring at her tits. What's that about? Changing your mind again?\"</p>\n<p> </p>\n<p>Harry groans. \"I've never changed my mind and I never will,\" he says firmly. \"It was just a bit impossible to <em>avoid</em>, wasn't it?\"</p>\n<p> </p>\n<p>\"I'm not complaining,\" Ginny shrugs, sipping her tea.</p>\n<p> </p>\n<p>\"You're horrible,\" says Harry.</p>\n<p> </p>\n<p>\"<em>You</em> just got told off by Pansy Parkinson in only your pants,\" says Ginny, reaching over to thoughtfully examine the lipstick stain on the other cup.</p>\n<p> </p>\n<p>\"I think I need to start dressing before I come downstairs,\" says Harry, setting about making his own tea.</p>\n<p> </p>\n<p>Pansy's visit is not going to change his mind about anything. He doesn't trust her, either. She's the one who wanted to hand him over to Voldemort, after all. Maybe it's obvious by now that Slytherins do care about a few things outside themselves, namely their family and close friends, but Harry is not about to change his mind just because Draco's apparently-not-girlfriend turned up to tell him off.</p>\n<p> </p>\n<p>However, his disastrous first attempt and the visit from Pansy does tell him one thing, and it's that he needs a new approach. He may be impulsive, but he's not an idiot, whatever Malfoy thinks. If he storms and rages, he has learned, Malfoy and Pansy will just storm and rage back, and he'll never accomplish anything.</p>\n<p> </p>\n<p>So he sends Malfoy an owl, asking to visit Teddy. Surely sending an owl, rather than turning up unexpectedly, will get him a little bit closer to Malfoy's good side, and surely Malfoy has no right to forbid him to visit his own godson. Harry will visit Teddy, because he misses him, really, and while he's at the manor, he will keep a discreet eye out for anything shady.</p>\n<p> </p>\n<p>The first response he receives simply reads, <em>No. Fuck off. – DM</em></p>\n<p>\n<em> </em>\n</p>\n<p>Frustrated, Harry writes back, <em>You can't forbid me from seeing my godson, Malfoy. I only want to visit him. I miss him, and he probably misses me, and if you don't let me see him you're being pretty awful to Teddy, as well, and it's only fueling my mistrust. Besides, surely you wouldn't mind a break?</em></p>\n<p>\n<em> </em>\n</p>\n<p>Malfoy's response is, <em>You truly are an arsehole, Potter. As I doubt you will give up and leave me the fuck alone any time soon, I will allow you to come round at 2, as long as you stay out of my face.</em></p>\n<p>\n<em> </em>\n</p>\n<p>So Harry throws on jeans and a t-shirt and apparates to Malfoy Manor at two o'clock. It's a cooler, more breezy day, and by the time Harry's evaded the rabid peacock and is standing on the wide front steps of the Manor, his hair is more all over the place than usual. Malfoy opens the door in another muggle ensemble, khaki trousers and another dark jumper, this time with a collared shirt underneath. His hair is long enough to curl a bit at the shirt collar. For a moment, he looks a bit startled – then his features morph into the glare Harry's used to, and he says, \"Well, come in, then, if you must.\" As he shuts the door behind Harry with a long, fine-boned hand, he says, \"I'd like to see as little of you as possible, Potter, if we can manage that.\"</p>\n<p> </p>\n<p>\"Feeling's mutual,\" Harry grunts, looking away from Malfoy's hand.</p>\n<p> </p>\n<p>\"Fabulous,\" says Malfoy. \"This way.\" He stalks off through the foyer, and Harry hurries to catch up with him, wondering about the way Malfoy walks with his ridiculous good posture. He tears his eyes away from Malfoy's back.</p>\n<p> </p>\n<p>They make their way through a couple of long hallways before reaching an open, airy parlor filled with elegant furniture in white and pale yellow. The windows are thrown open, blowing the yellow curtains out into the room, and a pair of French doors looks out out into a bright and expansive garden. Teddy is sitting in the center of the floor with a strange game Harry assumes to be a wizard game, considering he has it at the Malfoys' – it's a large rectangle, and wherever he touches it, different colours appear, apparently according to his whim, because he keeps saying, \"yes!\" softly whenever it changes, and his hair keeps changing colour at the exact same instant.</p>\n<p> </p>\n<p>\"Harry!\" says Teddy, throwing the game aside and running to embrace him.</p>\n<p> </p>\n<p>\"<em>Hey</em>, mate!\" says Harry, and he forgets, a moment, about the way Malfoy makes his whole body buzz with exhilarated anger. He really has missed his godson. He drops to his knees to hug him back properly and ruffles his currently pink hair. \"Hello! How have you been? What are you doing?\"</p>\n<p> </p>\n<p>\"Draco's shown me what he used to colour with!\" says Teddy. He runs over to display the rectangle to Harry. \"This is one of the magic ways. Isn't it so cool?\"</p>\n<p> </p>\n<p>\"It is cool,\" Harry admits.</p>\n<p> </p>\n<p>\"But you didn't have one when you were little, did you, because you lived with muggles?\"</p>\n<p> </p>\n<p>\"That's right,\" says Harry. \"I just had my crayons.\" They weren't his crayons, really – they were Dudley's, and Harry had them because he stole them one evening when Dudley fell asleep at the kitchen table, head in a bowl of cereal.</p>\n<p> </p>\n<p>\"I like the crayons, too,\" Teddy assures him.</p>\n<p> </p>\n<p>Malfoy makes a soft, amused noise, and Harry remembers him and turns around to see him leaning against the doorframe with crossed arms. He has a strange, soft look on his face, and Harry feels startled by such softness on those sharp features. Malfoy notices Harry looking and clears his throat. \"Anyway,\" he says, straightening up. \"Here's the parlor. I'll be in my study. Don't leave this room – unless you feel like going into the garden, I suppose, Teddy likes the garden – don't touch anything, and stay out of my way. I will know if you leave, I've cast a detection charm on the doors and windows. I suppose if you're hungry or something, you can call for Krupnik.\"</p>\n<p> </p>\n<p>\"You're not going to stay, Draco?\" says Teddy, looking a bit disappointed.</p>\n<p> </p>\n<p>\"I have quite a lot to do,\" says Malfoy, except his eyes go oddly soft again.</p>\n<p> </p>\n<p>\"Maybe Harry can smell your potion!\" says Teddy.</p>\n<p> </p>\n<p>Draco looks amused, and not in a way that's at someone else's expense, and this, too, is new for Harry. \"I think I've had quite enough people smell my potion,\" he says. Suddenly, he frowns. \"Actually...\" he says. \"Not since I added the porcupine quills.\"</p>\n<p> </p>\n<p>\"Let me smell it again!\" says Teddy. He looks at Harry. \"I'm a good helper.\" He grabs Harry's hand, urging him to stand, and says, \"Come on, we can smell Draco's potion for him!\"</p>\n<p> </p>\n<p>\"Smell it?\" says Harry, confused and flustered.</p>\n<p> </p>\n<p>\"It's supposed to smell like a love potion,\" Teddy explains. \"It's <em>not</em> a love potion, it's a potion for when you're very, very sad and nothing else will make you happy again, but it <em>smells</em> like one, one that smells different for everyone. Draco has to make sure it keeps smelling right. For me it's like a bit like your house and a bit like the manor and a bit like Auntie, but it doesn't smell very strong. Draco says it gets stronger as you get older. <em>His</em> smells like his mummy's perfume and – \"</p>\n<p> </p>\n<p>\"All right,\" Malfoy says quickly. \"Thank you for explaining, Teddy.\"</p>\n<p> </p>\n<p>\"Amortentia smells like your <em>mother</em> for you?\" says Harry incredulously, unable to resist.</p>\n<p> </p>\n<p>\"Shut up,\" says Malfoy. \"I didn't date my mother's look-a-like.\"</p>\n<p> </p>\n<p>Harry has never thought of this and has no idea what to say in response. For some reason, though Malfoy's the one who spoke, he looks a bit startled himself. They look at each other for a long, confusing moment.</p>\n<p> </p>\n<p>Teddy looks curiously back and forth between them.</p>\n<p> </p>\n<p>\"Right,\" says Malfoy. \"Did you want to help, Teddy?\"</p>\n<p> </p>\n<p>\"Harry should help, too,\" says Teddy. \"You did say the more people to help, the better!\"</p>\n<p> </p>\n<p>\"I did say that, didn't I?\" says Malfoy faintly.</p>\n<p> </p>\n<p>So Harry finds himself in Malfoy's study, a dark wood paneled, bookshelf lined room which smells heavily of books and parchment and chemicals, and leaning over the rich brown desk to smell a bubbling concoction of a shiny yellowish green. He inhales, and there it is – treacle tart, and the woody smell of a broomstick handle, and something – different from the last time he smelled this potion, although he reckons that makes sense. This time, it's something vaguely like cinnamon and just a little bit familiar, though he can't quite place it. It feels like something <em>recently</em> familiar, though, he's sure of that, and that's strange, because he hasn't found himself especially attracted to anyone recently. Maybe he just really likes cinnamon.</p>\n<p> </p>\n<p>\"So – what is it, some kind of – happiness solution?\" Harry asks after telling Malfoy that yes, it smells like amortentia, but refusing to tell him what exactly that smells like. He's sure Malfoy would find something to mock him about. Probably the treacle tart.</p>\n<p> </p>\n<p>Malfoy snorts, though Harry can't pick out why. He glances at Teddy, who is peering into a jar of beetle eyes with a wrinkled nose. \"It has a component of the Elixir to Induce Euphoria,\" he says. \"It's for curing – mental illness, Potter. Or – helping, anyway. Curing is optimistic to the point of imbecility.\"</p>\n<p> </p>\n<p>Harry remembers the rumors about Malfoy's father's death – that it was a suicide – and looks carefully at Malfoy's face. His eyes have darkened dangerously and his jaw is set, and it's sort of – Harry blinks and clears his throat. \"Why are you making it?\" he asks.</p>\n<p> </p>\n<p>\"None of your business,\" says Malfoy. \"Now the two of you can get out of my study.\"</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Somehow, Draco manages to get through the first week of Teddy's stay without terribly fucking up the child <em>or</em> murdering Potter, who insists upon turning up <em>every single afternoon</em> right after lunch and leaving right before dinner.</p>\n<p> </p>\n<p>\"Just tell him to fuck off,\" says Pansy when she shows up one evening for dinner, furious that her demands for Potter to leave Draco alone have not been met. \"Do I need to do it for you again?\"</p>\n<p> </p>\n<p>\"<em>No</em>, you do not need to do it for me, and you<em> never </em>needed to,\" Draco insists. \"I can handle Harry Potter, Pansy.\"</p>\n<p> </p>\n<p>\"I'm sure you'd<em> like</em> to handle him,\" says Pansy, raising her eyebrows and crossing her arms over her low cut dress.</p>\n<p> </p>\n<p>\"Pants, I'm going to tell <em>you</em> to fuck off in a minute,\" says Draco.</p>\n<p> </p>\n<p>\"Don't call me Pants.\"</p>\n<p> </p>\n<p>\"Leave it alone, then.\"</p>\n<p> </p>\n<p>The truth is, even if it makes no sense to Draco whatsoever, Potter's continued presence at the manor in the afternoon is actually a great deal of help. Pansy is very charmed by Teddy, but bores easily, and however much she likes running about the garden with him in inappropriate clothing, she's not inclined to show up every single day. She apparently has shopping to do, and dinners to attend, and mysterious owls to send and receive; that same evening, an unfamiliar owl drops off a letter that makes a very specific smirk cut across her face – the Pansy Is Going To Get Laid Shortly smirk – but when Draco asks, she will not share anything.</p>\n<p> </p>\n<p>Essentially, Pansy can be flaky, and Potter's dependable presence guarantees Draco a break from his five year old charge to attend to his potion and his studies every day, no matter how strange it is to have Potter sitting around his house somewhere, out of his view. Ever since the first day, he has not raged stupidly at Draco, but has stayed in the parlor with Teddy, looking as shifty and vacant as usual, but keeping the child occupied – and also making it quite clear to Draco that he and Teddy really do care for each other quite a bit.</p>\n<p> </p>\n<p>It makes Draco feel strange, to catch them in moments of affection, but he can't work out if it is a good or bad strange. Whenever Potter leaves, Draco feels more inclined, somehow, to do things, like hug the child or carry him to the dinner table or read him books, that he did not imagine to be in his nature. Teddy welcomes this affection, but gives Draco lots of long, searching looks.</p>\n<p> </p>\n<p>Really, Draco should have known that this weirdly relaxed and peaceful arrangement wouldn't last.</p>\n<p> </p>\n<p>It's Tuesday andnearly the usual time for Potter to leave. Draco yawns, stretches, scratches his nose with the end of his quill, and heads off to the parlor a bit earlier than usual, tired of staring at his own handwriting scrawled across parchment. As he walks down the hall, he scratches his nose again, then notices that his fingers have got ink all over them and regards them carefully, frowning.</p>\n<p> </p>\n<p>\" – <em>really</em>, Harry,\" Teddy's little voice is saying from inside the parlor. \"Maybe you should have a date.\"</p>\n<p> </p>\n<p>\"A <em>what</em>?\" says Potter.</p>\n<p> </p>\n<p>\"Ginny told me about dates, because she went on one the other night – how you get together and you eat food or have drinks so you can have fun and also talk to each other so you know each other better. I think if you had a date with Draco, then you would know him better and not hate him. And you could ask <em>him </em>all the questions.\"</p>\n<p> </p>\n<p>Draco freezes. He has not quite forgotten Luna's claim that Potter might fancy him. Even if he thinks she's just being mad as ever, he still can't help but remember it, when Potter appears windswept or sweating at the doorway, or when he messes up the back of his hair and doesn't quite meet Draco's eyes whenever Draco is forced to speak to him.</p>\n<p> </p>\n<p>\"I never <em>said</em> I hated him,\" Potter insists rather tiredly, as if he's said this many times before. \"I'm just asking questions.\"</p>\n<p> </p>\n<p>\"You've asked <em>loads</em> of them,\" says Teddy. \"And it's because you don't trust him, but I <em>told</em> you, he's nice and he's clever and he doesn't do anything bad. He does all the things he should and even reads books to me before I sleep. He doesn't say anything about wars or about you except sometimes he says your hair is <em>ridiculous</em> – \" He says the word carefully, as if wary of messing it up. \" – and it <em>is</em>, Harry, so that's okay.\"</p>\n<p> </p>\n<p>\"A date is the last thing I will ever do with Draco Malfoy, Ted,\" says Potter, although his voice sounds a bit strangled.</p>\n<p> </p>\n<p>\"But if you knew him, you wouldn't hate him,\" Teddy says stubbornly.</p>\n<p> </p>\n<p>\"I never said I hated him,\" Potter repeats. \"But – I don't really have any interest in getting to know him, either.\"</p>\n<p> </p>\n<p>\"Of course not,\" Draco blurts out, rounding the corner. <em>Fuck</em>, he hates losing his composure, and it always seems to be Potter he does it around, but he feels angry and stupid and <em>hurt</em>, for some reason, which is the most ridiculous part. It's as if he expected that he and Potter had reached some sort of agreement, allowing themselves to coexist in peace for a few hours every afternoon, and he doesn't know why he imagined this meant Potter maybe trusted him a bit more. It's a completely stupid thing to have thought – if Potter trusted him, Potter would have left it alone, but he didn't. Draco has proved nothing to him, as he had hoped this strange coexistence would cause, despite forcing himself with all of his energy to be polite, to be accommodating, to let Potter see his godson and prove that the child is alive and well. Draco feels so ridiculously stupid for thinking that might work. \"You just want to <em>spy</em> on me and try to get a five year old to report whatever awful things I must be doing all day. <em>I</em> would never <em>use</em> Teddy like that, and <em>I'm</em> the one who shouldn't be looking after a child?\"</p>\n<p> </p>\n<p>Potter scrambles up from the floor, where he was apparently sitting with Teddy and a set of blocks in all shapes that used to belong to Draco. One of his few memories of being very small is the moment he figured out he could make these blocks move without touching them if he wanted; it was his first sign of magic, and there was a big fuss, a lot of kissing and hair ruffling and exclamations over his cleverness and even a present from his father. Draco suddenly wonders, despite being quite prepared to start an argument, when Potter first displayed magic, and how the muggles reacted.</p>\n<p> </p>\n<p>\"I'm not using him!\" Potter says hotly. Teddy stares up at him, wide-eyed.</p>\n<p> </p>\n<p>\"You told me you wanted to come round to see him,\" says Draco. \"And all you really want is to spy on me. Did the war's end escape you, Potter? I was under the impression you were a rather significant – \"</p>\n<p> </p>\n<p>\"I'm making sure he's <em>safe</em> here, because I care about him!\" Potter insists.</p>\n<p> </p>\n<p>\"Why wouldn't he be <em>safe</em> here?\" Draco says, above Teddy's meek little assertion, \"Harry, I <em>am</em> very safe here, I said – \"</p>\n<p> </p>\n<p>\"Well, the last time <em>I</em> was here, apart from the time this week,\" Harry says, ignoring Teddy, \"I was locked in the basement while my best friend was – \"</p>\n<p> </p>\n<p>\"<em>Five years ago</em>!\" Draco shouts, losing his temper completely. \"Five years ago during a war, at which point my family had hardly any control over the proceedings! At which point this house was a completely different place and my father was already falling apart! He's done himself in now, you've defeated the Dark Lord, my family is <em>trying</em> to do what we can to repair what's – \"</p>\n<p> </p>\n<p>\"What, by throwing money at a load of charities like your parents did the last time, before crawling back to Voldemort?\" Harry retorts before Draco can even finish, stepping right up close to him.</p>\n<p> </p>\n<p>Draco feels quite helpless, suddenly. He thinks of all the work he's done and is continuing to do, all the effort he's put into becoming a successful member of society in his own right, and sees the results of all that – or lack thereof – in front of him, in Potter's assertions. It doesn't matter, and it <em>won't </em>matter. Harry Potter still thinks this way about him, about his family, and as long as Harry Potter does, so will everyone else. Draco <em>hates</em> to feel helpless.</p>\n<p> </p>\n<p>\"You're <em>infuriating</em>, Potter!\" Draco spits, humiliated that he cannot think of anything else to say. \"At least when I was completely incapable of working out that people lived lives different from mine I was basically a <em>child</em>.\"</p>\n<p> </p>\n<p>\"I know that people have different lives, idiot!\" says Potter.</p>\n<p> </p>\n<p>\"You may <em>think</em> you do, but in reality you're a mentally challenged – \"</p>\n<p> </p>\n<p>\"Please don't hex each other!\" Teddy says tearfully, and Draco starts, reminded of his presence.</p>\n<p> </p>\n<p>Potter swears.</p>\n<p> </p>\n<p>\"Nobody's hexing anybody, Teddy,\" says Draco, furious that they let themselves shout about the war this way in front of a small child.</p>\n<p> </p>\n<p>\"You looked like you might,\" says Teddy, and Draco realises he took out his wand defensively the moment Harry stepped towards him; he hardly noticed.</p>\n<p> </p>\n<p>\"I'm sorry, mate,\" says Harry, looking quite miserable now.</p>\n<p> </p>\n<p>Teddy glances back and forth between them, as if sizing them up. Draco is afraid he might cry – there are certainly tears welling up in his eyes – but instead, he puts his hands on his hips, screws up his face, and announces, \"You will have a date whether you want to or not.\"</p>\n<p> </p>\n<p>\"I – sorry?\" says Draco, taken aback.</p>\n<p> </p>\n<p>Teddy marches over to the couch, picks up his crayons, and marches over to the doorway, glaring all the while. \"If you are going to be <em>babies</em> who fight and call each other names,\" he says, turning up his nose. \"I am going to be a grown up. And I give you one time-out, which will also be a date.\"</p>\n<p> </p>\n<p>\"Teddy...\" Potter starts.</p>\n<p> </p>\n<p>\"No, no, no,\" says Teddy, stomping one foot. \"Now you are in time-out. And also on a date.\"</p>\n<p> </p>\n<p>\"It's nearly dinner time, Teddy,\" says Draco. \"Potter has to leave. Okay?\"</p>\n<p> </p>\n<p>\"No he doesn't,\" Teddy says dismissively. \"He'll just go home and walk around in his pants.\" Draco is greeted with a completely unhelpful mental image of Potter walking around in his pants. Potter's cheeks flush. \"Ginny's not even home. She's on a date, too, and Pansy won't come round because she's the one Ginny's on a date with.\" A startled look passes over his face, and he covers his mouth. \"Oops. That was a secret.\"</p>\n<p> </p>\n<p>\"<em>What</em>?\" says Potter. \"Ginny has – <em>what</em>?\"</p>\n<p> </p>\n<p>\"Ginny and Pansy are being like <em>real</em> grown ups,\" says Teddy. \"You are being like babies, so you are in time-out while I go be the grown up.\"</p>\n<p> </p>\n<p>\"What do you expect to do?\" says Potter. \"While you're being a grown up?\" Some amusement shines through his exasperation as he regards the small child in front of him.</p>\n<p> </p>\n<p>\"It better not involve my study,\" says Draco. \"And anyway – <em>no</em>, Teddy, we are not in a <em>time-out</em>, I'm the one looking after you, and you – \"</p>\n<p> </p>\n<p>\"Krupnik!\" says Teddy, snapping his fingers like he's seen Draco, and probably Narcissa, do countless times. The wizened house elf appears with a <em>crack</em>.</p>\n<p> </p>\n<p>\"Yes, Master Teddy?\" he says.</p>\n<p> </p>\n<p>\"I can't do big magic yet,\" says Teddy. \"So I order you to seal the doors and windows in this room so Draco and Harry can't get out.\" He seems to remember himself and adds, \"Please.\"</p>\n<p> </p>\n<p>\"Krupnik,\" says Draco. \"You will do no such thing. I am the one in control of this house elf, Teddy.\"</p>\n<p> </p>\n<p>\"Krupnik is a <em>Black</em> house elf, not a Malfoy house elf,\" says Teddy. \"Aunt Cissa told me he can listen to me, too, because I have some Black blood.\"</p>\n<p> </p>\n<p>Draco looks at Krupnik, and Krupnik looks back. Draco knows, in that instant, from the look on his wrinkled old face, that Krupnik is remembering this morning, when Draco, at the end of his rope, told him off rather colourfully for spilling tea on Draco's trousers, and Teddy patted him on the arm and said, \"It was probably a mistake, right, Krupnik?\"</p>\n<p> </p>\n<p>Draco has had quite enough of karma.</p>\n<p> </p>\n<p>But whether he's had quite enough of it or not, he still ends up sealed in the East wing parlor with Harry Potter, in a \"time-out\" and also a \"<em>date</em>,\" while a five year old has free reign of the rest of the manor.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>\"So,\" Malfoy says after what feels like an agonisingly long time, although when Harry casts a tempus charm he realises it's only been about twenty minutes since Teddy managed to, in a daring and really rather impressive maneuver, seize their wands and escape with Krupnik. \"Apparently we're on a date, Potter.\"</p>\n<p> </p>\n<p>The moment Teddy and Krupnik disappeared, Malfoy threw himself into an armchair by the window, and he has been sitting there since, looking contemplatively outside while Harry paces. This is the first time either of them have spoken.</p>\n<p> </p>\n<p>\"Apparently,\" says Harry, wrong-footed when he looks over and sees the smirk on Malfoy's face. That smirk disappears, however, the longer Harry looks at him; eventually he scowls and looks back out the window. He's had a streak of ink on his nose since he entered the parlor, and Harry can't be bothered to tell him.</p>\n<p> </p>\n<p>Harry doesn't know how to handle this situation. On one hand, he does feel awful about upsetting Teddy – he never meant to have a row with Malfoy in front of Teddy, especially in reference to the war – and on the other hand, he feels that Teddy cannot possibly understand the situation, and this is useless, and he <em>really </em>doesn't want to talk to Malfoy.</p>\n<p> </p>\n<p>\"I know you're gay,\" Malfoy says suddenly.</p>\n<p> </p>\n<p>Whatever Harry expected Malfoy to say next, if he said anything, it wasn't this. \"Sorry?\" he says, his stomach twisting.</p>\n<p> </p>\n<p>\"I know you're gay,\" Malfoy repeats. He is still looking out the window rather than at Harry, his elbow on the armrest and his sharp chin in his hand. \"And so's the Weaslette.\"</p>\n<p> </p>\n<p>\"All right,\" says Harry, carefully setting up his defenses. \"Have you got a problem?\"</p>\n<p> </p>\n<p>Malfoy lets loose a snort, a completely unrefined noise Harry's never heard from him before. \"I'm trying to tell you we have something in common,\" he says. \"Reckoned we could start off the conversation with common ground, if we're doing this.\"</p>\n<p> </p>\n<p>Harry blinks. \"Oh,\" he says. This, too, was the last thing he expected, although he wonders, as he looks Malfoy over carefully, from his neat, filed fingernails to his almost eerily perfect posture, if he <em>should</em> have expected it. He's not very good at working out whether or not people are gay, to Ginny's chagrin.</p>\n<p> </p>\n<p>Malfoy turns around and shrugs his bony, sweater clad shoulders. He makes the movement look, somehow, so much more graceful than Harry imagines he himself looks when he shrugs. How does he manage that? At least the ink blot on his nose makes him look a bit more human.</p>\n<p> </p>\n<p>When Malfoy arches one eyebrow, Harry starts and realizes he's been staring, which is not the best response to someone coming out to you. \"Are we actually going to talk, then?\" he blurts quickly.</p>\n<p> </p>\n<p>Malfoy sighs and says in a tired, resigned way, \"There's nothing else to do. Although I expect most of it will be you shouting at me about things I've done in the past and refusing to hear a word I have to say.\"</p>\n<p> </p>\n<p>With an enormous effort, Harry stems the indignation bubbling up inside of him at this remark and tries to find the truth in it. He knows he really <em>hasn't</em> listened to much of what Malfoy's said, preferring to move through the points simmering together in his own head whenever they've argued. However, they appear to be stuck here now, and <em>that</em> approach has not exactly helped anything. \"Well,\" says Harry, flopping down on the sofa across from Malfoy and heaving a sigh himself. \"Fine. What is it you have to say, then?\"</p>\n<p> </p>\n<p>Malfoy clearly didn't expect him to say this; he sits up, his hands falling into his lap, and considers Harry with a quirked eyebrow and surprised eyes. \"In regards to what, exactly?\" says Malfoy finally. \"You've been rude to me. You don't seem to recognize that I'm not the person I was during the war.\"</p>\n<p> </p>\n<p>\"So what sort of person are you, then?\" Harry demands.</p>\n<p> </p>\n<p>Malfoy shrugs his thin shoulders again. Harry, for a very peculiar moment, is seized with curiosity over Malfoy's skinniness, and the amount he might eat every day, holed up in his study when Teddy's not about. Harry recalls the way Molly Weasley goes on about his own underfed appearance, the way <em>he</em> holes himself up in Grimmauld Place when Teddy's not about, talking only to Ginny and not even getting dressed properly.</p>\n<p> </p>\n<p>\"I'm trying,\" says Malfoy. He looks out the window again. \"I can't believe I am about to defend myself to you, as I doubt you deserve an explanation, but – I'm trying to get my Potions Mastership, so perhaps I can teach, or start a business. Do something of my own. My father wasn't particularly interested in potions, not unless they had some particular manipulative use for him.\" He wrinkles his pointed, ink stained nose. \"I'm thinking – hoping, I suppose, that if I can accomplish this and get a real career going – that can be something. To prove myself. I can try to do something – helpful. This potion I'm working on – there's a potion already, for – depression, but it's not as effective as it could be, not at all, there are people who just aren't helped by it. And it's also absolutely dreadful to take – nasty, and painful to swallow, and for something you have to take every day – I mean, really I'm trying to make it work better in the long run, that's the main goal, but I thought – it could be nice, it could be helpful, to make it nicer, more alluring. People give up taking it, it's so vile. I just think the people who have to take it have suffered enough without having to take that gruesome thing, that it should be something nicer, something they won't easily give up taking.\"</p>\n<p> </p>\n<p>Harry listens carefully, leaning against the sofa armrest, his chin in his hand in a mirror of Malfoy's earlier position. He guesses all that makes sense, although he does wonder why Malfoy feels so strongly about it. That, though, is something that might be easy to figure out. \"Did your father really do himself in?\" he asks, remembering Malfoy's earlier declaration.</p>\n<p> </p>\n<p>Malfoy winces, and Harry winces in turn at the insensitivity of the phrasing, even if he was quoting Malfoy directly – even if it <em>is</em> Lucius Malfoy they're talking about, and he probably deserved it. He was still Malfoy's father, Harry supposes.</p>\n<p> </p>\n<p>\"Yes,\" Malfoy says shortly.</p>\n<p> </p>\n<p>\"Oh,\" says Harry, trying to find it within him to say he's sorry, because that's probably the polite thing to do.</p>\n<p> </p>\n<p>\"AK'd himself,\" says Malfoy before Harry can muster up the proper feeling. He draws his knees up to his chest, wrapping his arms around them and bringing his socked feet onto the chair. \"Mother found him. I don't think he could deal with – the humiliation of everything. It was all his own fault, anyway.\" He looks up and fixes Harry with sudden fierce eye contact. \"I don't labor under the delusion he was a helpless victim in all this. The state of his life was all due to his choices. The wrong choices – by the by. I knew that by the time I was seventeen. The Dark Lord was a lunatic. I hated him. He ruined my father. He made me do things I didn't want to do. Is that what you needed to know?\" When Harry doesn't answer, Malfoy continues, \"It doesn't mean I didn't love my father. He was an idiot, but he was my father. It doesn't mean it wasn't upsetting, seeing him in pain, and it doesn't mean I don't want to help other people going through something fucking awful like that, because they probably <em>don't</em> deserve it.\" Malfoy exhales heavily, blowing at his fringe, and throws his head back against the chair. \"Cheers, Teddy,\" he says to the white moulded ceiling.</p>\n<p> </p>\n<p>Harry isn't sure what to say. He wonders what he would do, if his father was somebody like Lucius Malfoy. He thinks of the pain of seeing his father taunting Snape in the pensieve, of finding out he didn't know everything about Dumbledore at all, that in fact some of his past was a bit shady, after all. He remembers that he knew, in those moments of horrified disillusionment, that part of his horror was knowing he'd never be able to stop loving them, that those feelings of love and disapproval and betrayal would likely coexist and chafe against one another forever.</p>\n<p> </p>\n<p>\"If you've been so sure we're terrible people all this time, why did you testify at our trial?\" Malfoy asks suddenly. \"Why did you keep us out of Azkaban? So you could play hero again and make us owe you?\"</p>\n<p> </p>\n<p>Harry frowns, uncomfortable. \"I wasn't trying to make you owe me anything,\" he says. \"<em>I </em>owed your mother, was what it was. She saved my life.</p>\n<p> </p>\n<p>\"But you've still thought of us as terrible people,\" says Malfoy. \"Apparently.\"</p>\n<p> </p>\n<p>\"I didn't say...\" Harry tucks his legs underneath him on the sofa, feeling guilty. \"I didn't think you were <em>terrible people</em>. That was – the thing. I knew she really loved you, she must have, to do what she did. So you couldn't be <em>all bad</em>.\"</p>\n<p> </p>\n<p>\"So what was so terrible and untrustworthy about me, that made you think I couldn't look after Teddy?\" Malfoy insists.</p>\n<p> </p>\n<p>Harry groans and buries his face in the armrest. What is he supposed to say after all that painfully honest stuff from Malfoy – you're all arrogant snobs and I don't want Teddy to be one, too? I don't want Teddy to like you more than he likes me? I think I sort of wanted to argue with you? \"Knee jerk reaction?\" he tries pathetically to the scratchy armrest.</p>\n<p> </p>\n<p>To his surprise, Malfoy laughs, in a sort of broken, exasperated way. \"Harry Potter, having a knee jerk reaction,\" he says. Harry peers over at him and sees that he's still looking at the ceiling, a funny smile on his face. \"Life is so bloody shocking.\"</p>\n<p> </p>\n<p>\"Yeah,\" Harry grumbles, cheek still against the armrest. \"I've heard it's a thing I've got a problem with.\"</p>\n<p> </p>\n<p>Malfoy laughs again, genuinely. Harry feels rather proud of himself, but decides it's justified for him to say, \"I guess also I thought you were a bit – arrogant.\"</p>\n<p> </p>\n<p>\"If you don't want Teddy to be around arrogant people,\" Malfoy says, voice colder as he makes eye contact again, \"You might want to keep him away from yourself, as well.\"</p>\n<p> </p>\n<p>\"I'm not <em>arrogant</em>,\" Harry insists, looking up properly. \"I'm – a mess.\" Malfoy quirks an eyebrow. \"I'm a bit of a mess, all right?\" Harry says. \"And I know I am. I haven't got a job, and I've no idea what kind of job I want. I haven't got a boyfriend, and I don't see <em>that</em> changing anytime soon, after everything the last one had to say about me. Teddy's right – if I'd left, I'd just be walking about the house in my pants. I suppose yelling at you was a thing to do. And I did miss Teddy. I did come round because I want to see him. Ginny's out a lot, for Quidditch and with girls and things, and Ron and Hermione have got each other, and Dean and Luna have got each other – and <em>apparently</em> Luna's got you to talk to, as well – and Neville's got Ernie Macmillan now, which is – sort of annoying, and – Teddy's – \" Suddenly, Harry feels especially embarrassed, and he can't meet Malfoy's eyes. \"Teddy is – good company,\" he finishes pathetically.</p>\n<p> </p>\n<p>\"Teddy's company for me, too,\" Malfoy says, so quickly it's as if he doesn't want Harry to actually hear him – he rushes right into the next sentence. \"What'd the last one say about you? Your boyfriend.\"</p>\n<p> </p>\n<p>Harry glares. \"Is that really your business?\"</p>\n<p> </p>\n<p>\"I told you my worst.\"</p>\n<p> </p>\n<p>It's only the truth of this statement, and Harry's guilt and stupid compulsion to be <em>fair</em> all the time that makes him say, \"Well – partly, he was a muggle, and he said he'd never be able to understand me, because – he didn't get – the magic things. He didn't really understand everything that happened, but I suppose I didn't really tell him everything – I don't really <em>like</em> having to go over it again and again. And that was the other thing, apparently I'm no good at talking about my feelings, or apparently – just – having feelings – at all.\"</p>\n<p> </p>\n<p>Malfoy lets out another rough snort. \"There's some more common ground,\" he says. \"Although I imagined you were all right at feelings, what with how obvious yours always are.\"</p>\n<p> </p>\n<p>Harry frowns. \"How do you mean?\"</p>\n<p> </p>\n<p>\"Your feelings are all over your face, all the time,\" says Malfoy, though he looks a bit embarrassed. \"The whole room always knows whether you're angry or happy or what – or at least, it was like that in school. And your whole thing with the Dark Lord was about – love, and all that rubbish.\" Malfoy is looking down at the yellow rug now.</p>\n<p> </p>\n<p>\"Yeah, I guess,\" says Harry. \"But I don't know, it's not – really so easy for me. Hermione reckons it's, er. You know, to do with the whole – living – in a cupboard as a child, and – things.\" It's surreal enough that Harry is talking to Malfoy about his <em>feelings</em>; he reckons he might as well go all the way with it.</p>\n<p> </p>\n<p>\"A cupboard?\" Malfoy repeats. He has become much more comfortable in his chair now, it seems, slouching all over it, although, of course, he manages to make that look much more elegant than Harry could probably hope to achieve. Harry notices the ink on his nose again and feels a sudden, inappropriate urge to laugh.</p>\n<p> </p>\n<p>\"Yeah,\" says Harry, swallowing his improper laughter. \"I, um, I lived in a cupboard under the stairs. My Aunt and Uncle weren't – they weren't too fond of me, actually. They didn't really pay much attention to me, except to use me as a bit of a servant.\"</p>\n<p> </p>\n<p>\"I'd heard rumours,\" says Malfoy. \"I guess I always imagined they couldn't be true because – you were Harry Potter.\" He clears his throat. \"I heard all about you as a child – I imagined your life must be perfect.\"</p>\n<p> </p>\n<p>\"Yeah, er,\" says Harry. \"It wasn't.\"</p>\n<p> </p>\n<p>\"Apparently.\"</p>\n<p> </p>\n<p>\"Apparently yours wasn't either,\" Harry offers into the stretching moment of silence.</p>\n<p> </p>\n<p>\"No,\" says Malfoy.</p>\n<p> </p>\n<p>After another silence, in which Harry lays his head back down on the scratchy upholstery of the sofa's armrest and Malfoy turns himself sideways, so his legs are dangling off his own armrest, Malfoy adds, \"I hope Teddy isn't in my study. He's already drawn Pansy all over my notes.\"</p>\n<p> </p>\n<p>Harry finds himself laughing genuinely. \"Speaking of that...Pansy and Ginny?\"</p>\n<p> </p>\n<p>\"Pansy and Ginny, indeed,\" says Malfoy, raising his eyebrows.</p>\n<p> </p>\n<p>\"I didn't know Pansy was gay.\"</p>\n<p> </p>\n<p>\"She's not really,\" says Malfoy. \"She's – whatever.\"</p>\n<p> </p>\n<p>\"Bisexual?\" Harry suggests.</p>\n<p> </p>\n<p>\"I suppose so,\" says Malfoy. \"She doesn't like to have words for it. She just likes to fuck everyone.\"</p>\n<p> </p>\n<p>\"A worthy goal, I suppose,\" says Harry, stretching, and he is pleased when Malfoy laughs again. \"I'm going to have to have a word with Gin. I <em>knew </em>she couldn't keep her eyes off Pansy when she came round, I just didn't think she'd actually <em>do</em> something about it. By the way, Teddy's not going to hurt himself or get lost or anything, is he?\"</p>\n<p> </p>\n<p>\"I imagine Krupnik's looking after him,\" says Malfoy. \"When I was small, I used to boss the house elf about, but he always knew what was reasonable for a child and what wasn't.\"</p>\n<p> </p>\n<p>Harry realises something and says, \"Dobby?\"</p>\n<p> </p>\n<p>\"Oh, yes – you knew him, didn't you?\"</p>\n<p> </p>\n<p>\"Yes.\"</p>\n<p> </p>\n<p>\"Luna says he died. I was sorry about that.\"</p>\n<p> </p>\n<p>\"Me, too,\" says Harry, looking out at the sky outside, which has now almost fully darkened, and trying not to remember too vividly the taste of salt and grit in his mouth and the wind blowing his hair about as he dug Dobby's grave. \"Luna said you used to give her food and things when you could,\" he remembers. \"When she was prisoner here.\"</p>\n<p> </p>\n<p>\"Yes,\" says Malfoy.</p>\n<p> </p>\n<p>\"How'd you manage that?\"</p>\n<p> </p>\n<p>\"I don't know, really,\" Malfoy admits. \"It was a stupid thing to do. If he'd found out he would have – well – it would not have been good, and I was weak at occlumency. I had to learn to be stronger. I don't know that I even knew what I meant by it, then, I just – it felt like – something.\"</p>\n<p> </p>\n<p>\"I can understand that,\" says Harry.</p>\n<p> </p>\n<p>Malfoy makes a soft noise of amusement. \"Never thought you'd say something like that to me.\"</p>\n<p> </p>\n<p>\"Here's another, then. I think it was really brave of you.\"</p>\n<p> </p>\n<p>Malfoy rolls his eyes. \"Oh, thanks, Potter.\"</p>\n<p> </p>\n<p>\"Was not turning me in another <em>something</em>?\" says Harry, recalling that he's wanted to ask about this moment forever. \"I knew you recognized me – when you saw my face. Even with the way it was – you <em>must</em> have recognized me.\"</p>\n<p> </p>\n<p>\"Yes,\" he says, not meeting Harry's eyes. \"It was – something. Do you think Teddy plans to set us free any time in the next century?\"</p>\n<p> </p>\n<p>\"He didn't specify how long the time-out was,\" says Harry.</p>\n<p> </p>\n<p>\"Or the <em>date</em>,\" says Malfoy, amused. He makes eye contact, and Harry suddenly feels weird and sets about examining the spotless moulded edges of the ceiling.</p>\n<p> </p>\n<p>\"Yeah,\" says Harry. \"The date.\"</p>\n<p> </p>\n<p>\"It'll be his bedtime soon enough,\" says Malfoy.</p>\n<p> </p>\n<p>\"Do you really read to him?\"</p>\n<p> </p>\n<p>\"Yes,\" says Malfoy defensively, even though Harry only meant it out of curiosity. \"Do <em>you</em> ever read to him?\"</p>\n<p> </p>\n<p>\"Not really,\" Harry admits. \"I bring him flying. And for ice cream. We play games. I don't – really like my speaking voice.\"</p>\n<p> </p>\n<p>\"You have a good speaking voice,\" says Malfoy, and then he throws his head back and drops his hand down to graze the floor, making a noise of frustration and apparent embarrassment. The arch of his pale neck catches Harry's eye, and he finds it difficult to look away. He watches the Adam's apple as Malfoy swallows.</p>\n<p> </p>\n<p>\"Er – thanks,\" says Harry. \"How do you know?\"</p>\n<p> </p>\n<p>\"I've heard you give speeches,\" he says. \"In the time right after the war it was a bit hard to avoid.\"</p>\n<p> </p>\n<p>Harry wrinkles his nose. \"Right,\" he says. \"Unfortunately.\"</p>\n<p> </p>\n<p>\"Unfortunately?\" says Malfoy, picking up his head to look back over at him properly.</p>\n<p> </p>\n<p>\"I hate public speaking,\" Harry explains. \"I hate – all that attention. It was – tiring. Even worse back then. I still don't like speaking every year at the anniversary, and I hate having my picture in the papers all the time, but – at least it's not like it was back then anymore.\"</p>\n<p> </p>\n<p>\"Hmm,\" says Malfoy, laying his head back down. \"In school I always thought you liked the attention.\"</p>\n<p> </p>\n<p>\"Yeah, well,\" says Harry.</p>\n<p> </p>\n<p>\"Yeah, <em>well</em>,\" Malfoy sighs.</p>\n<p> </p>\n<p>At this, Harry feels the pushing intrusion of magical energy, and a moment later, Teddy's turquoise head peers around the corner. \"Hullo?\" he says carefully.</p>\n<p> </p>\n<p>Harry and Malfoy both scramble to sit up. \"Hello, Teddy,\" they say in unison. They exchange a startled look.</p>\n<p> </p>\n<p>\"Have you talked?\" says Teddy, taking a cautious step in side.</p>\n<p> </p>\n<p>\"Yes, Potter and I have talked,\" says Malfoy.</p>\n<p> </p>\n<p>Teddy frowns. \"You're still doing last names.\"</p>\n<p> </p>\n<p>Harry and Malfoy exchange another glance. Okay, so Harry has heard some interesting things tonight, things he needs to sleep on, and Malfoy has heard some fairly personal things from him, but – he's not sure he's ready for first name basis.</p>\n<p> </p>\n<p>He promptly realises how ridiculous that sounds. He's told Malfoy a bit about his childhood and his ex-boyfriend and other things besides, and Malfoy's told him about his father, and surely that's all much more personal than using <em>first names</em>.</p>\n<p> </p>\n<p>\"Right,\" says Malfoy finally. \"Yes. <em>Harry</em> and I have talked.\"</p>\n<p> </p>\n<p>Harry's name sounds very strange coming out of Malfoy's – Draco's? – mouth. \"Right,\" says Harry. \"Yes. We talked. Er – Draco and I. Have talked.\" The name is strange, all hard consonants, not rolling off the tongue the way he expects when he thinks of what to call this ornery blond man he's used to disliking. \"And Draco,\" he adds, still practicing the name, \"Did you know you've got ink on your nose?\"</p>\n<p> </p>\n<p>\"What?\" says Malfoy – Draco, startled.</p>\n<p> </p>\n<p>\"Right here,\" says Harry, and something possesses him to reach forward and touch the spot.</p>\n<p> </p>\n<p>Once again, he has a prompt moment of embarrassed realisation – he has just reached over, out of the blue, and touched Draco Malfoy's nose, of all places. This is probably the least sensual and strangest touch he could have gone for. Although he's not sure – if any place on his body would be all right to touch, or why it not being sensual would be a <em>bad</em> thing. He removes his fingers quickly. Malfoy – Draco – stares at him like he's sprouted a few extra limbs.</p>\n<p> </p>\n<p>Teddy gives them a satisfied smile. \"Well done,\" he says. \"You two can be grown ups again, I think.\"</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Pansy reacts with a great deal of amusement when Teddy informs her that he forced Draco and Potter – Harry, as Draco is trying to call him lately, <em>Harry</em> – into \"a date.\" That is, until Draco gets her alone and points out that she <em>actually</em> went on a date with Ginny Weasley, to which she responds, \"Fuck off, she's always been fit and you know it. She's also good in bed, although <em>you</em> wouldn't have a clue what to do with her.\"</p>\n<p> </p>\n<p>\"I really don't <em>care</em> to know what to do with her,\" says Draco.</p>\n<p> </p>\n<p>\"I bet you care to know what to do with Potter.\"</p>\n<p> </p>\n<p>\"Pansy, give up. I <em>don't</em> care, in the way you're trying to imply, but for the record, I <em>would </em>know exactly what to do. I have absolutely no doubt that I am capable of blowing his mind.\"</p>\n<p> </p>\n<p>\"What do you mean, blow his mind?\" Teddy says, wandering in the room, and Pansy cackles away and leaves him to the wolves.</p>\n<p> </p>\n<p>And Draco meant what he said to Pansy. He <em>really</em> doesn't care about Potter – Harry – in the way she's trying to imply. It doesn't matter if calling him Harry makes him seem a bit different somehow, or if now he smiles that crooked smile of his and says hello when he comes round. It doesn't matter that the first thing he did the day after their \"time out\" was turn up at the manor and <em>apologise</em>, ask Draco, tentatively using his first name, if maybe they ought to try to behave a bit more like adults now they've spoken, like Teddy wanted – such a surprisingly sensible action that Draco wonders if Teddy has special and very real persuasive powers and no one's realised yet. It doesn't matter that suddenly Harry has expressed interest in Draco's progress with the potion, and volunteers to smell things and sits with Teddy in Draco's study a few times, actually speaking to him, and even brings ingredients so Draco doesn't have to go out. Teddy, for his part, is beside himself and pats himself on the back frequently, both figuratively and literally, whenever either of them smiles or laughs at the other.</p>\n<p> </p>\n<p>Every once in a while, Draco can't help but remember Luna's assertion – \"I think he fancies you a bit\" – and then promptly and a bit hysterically squash it down. Luna is a complete nutter. She has no idea what she's talking about.</p>\n<p> </p>\n<p>\"I understand about not wanting to go out,\" says Harry when he presents Draco with a package from the apothecary in Diagon Alley, about a week after the \"time-out\" and two weeks into Teddy's stay. Teddy is sitting on the floor of the study, drawing again, this time what appears to be Krupnik. Harry's always wearing the same sort of t-shirts, and it's not as though they're very <em>stylish</em>, which is the sort of thing Draco tries to pay attention to, but they – well, Draco can see Harry's collarbones, and his arms, and the soft looking fabric stretches across his shoulders in a certain way, and – yes, fuck, okay, he <em>is</em> still fit, Pansy is right about that part, but it just doesn't <em>mean</em> anything. \"Maybe we should both make a bunch of polyjuice,\" he continues. \"Use that to go out. I suppose it's a bit like hiding, and I've never really liked to hide – but I'm not kidding anyone, staying in my house all the time is hiding, too.\" Harry looks thoughtfully at the bubbling potion. \"What try is this?\"</p>\n<p> </p>\n<p>\"Eighth go,\" Draco sighs. He fingers the package. \"I'm sure this will help to prevent the ashwinder eggs from fu – er.\" He glances at Teddy. \"Messing it all up.\"</p>\n<p> </p>\n<p>\"Hope so,\" says Harry, flashing a fond smile at his godson and leaning over to ruffle his hair. \"We should take Teddy out.\"</p>\n<p> </p>\n<p>\"We should – I'm sorry?\" says Draco. Teddy looks up, eyes bright.</p>\n<p> </p>\n<p>\"We should take Teddy out somewhere.\" Harry looks at him with a stupidly earnest expression he has adopted some time over the past week. Draco knows it to be a Harry Potter expression – he saw it enough across classrooms and the Great Hall – but he's not used to it being directed toward him, all bright, green eyes and sincere, hopeful smile.</p>\n<p> </p>\n<p>\"We?\" says Draco.</p>\n<p> </p>\n<p>Harry's smile falters. \"I, er,\" he says. \"Yeah. I thought – we – could do it. Unless – I didn't mean to – you can stay here if you like and maybe Teddy and I can go somewhere? I just thought – maybe you'd like to take a break.\"</p>\n<p> </p>\n<p>He looks sheepish. <em>\"I think he fancies you a bit,\"</em> Luna's voice offers cheerfully in the back of Draco's head. Draco wonders idly if he has finally cracked; hearing Luna Lovegood's voice in one's head all the time is surely not a sign of perfect sanity.</p>\n<p> </p>\n<p>\"I want you both to come!\" says Teddy, scrambling to his feet and scattering crayons everywhere. \"Draco, please, you never go <em>anywhere</em>. Come out with Harry and me. We can get ice cream or go flying or even both. Come on, Draco, it will be loads of fun!\"</p>\n<p> </p>\n<p>\"I don't go out,\" Draco says weakly.</p>\n<p> </p>\n<p>Draco goes out. He thinks he has found his weakness – <em>earnest</em> people. He can deal with saying no most of the time, but the moment somebody looks at him with complete, innocent <em>earnestness</em>, he finds himself, to his utter horror, faltering. It is the fault of obnoxiously earnest people that Draco is in Diagon Alley, in broad daylight, getting ice cream. (Teddy's sweet face does not help anything, and neither do Harry's eyes or shoulders.) He's certain they get strange looks, and he also thinks it's very likely they'll be some sort of picture in the Prophet tomorrow, because every time Harry Potter <em>moves</em> there's a picture in the Prophet, and Harry Potter getting ice cream with a former Death Eater is probably something to talk about.</p>\n<p> </p>\n<p>\"What do you both want, then?\" says Harry when they get to the ice cream parlor. He gestures grandly to the tubs of ice cream on display and says, \"You have – \" He glances at a blue painted sign hanging on the wall behind the counter and says, \"A grand total of twenty-four choices.\" He grins.</p>\n<p> </p>\n<p><em>This is stupid</em>, Draco thinks viciously.</p>\n<p> </p>\n<p>Teddy decides on \"the mint kind,\" and Draco chooses chocolate and peanut butter, which earns him a hum of approval from Harry, who gets the same thing and then insists upon paying for all their ice creams.</p>\n<p> </p>\n<p>\"We really do have some things in common,\" says Harry when they sit down at a table in the back, his tongue flicking out to lick his ice cream.</p>\n<p> </p>\n<p>Draco swallows and looks away. \"Yes,\" he says. \"The ice cream really <em>means</em> something.\"</p>\n<p> </p>\n<p>Harry laughs. His real laugh, a laugh with no mocking or derision, is rough and pleasant. \"Why are you wearing a sweater? It's hot as – \" He looks at Teddy, who is making short work of his mint chocolate chip, his hair the same colour green. \"It's hot.\"</p>\n<p> </p>\n<p>Draco, stricken with discomfort, says, \"None of your business,\" more quickly and rudely than he intends. Harry looks taken aback and ready to snap in response, before Teddy speaks up.</p>\n<p> </p>\n<p>\"Is it because of the bad mark?\" says Teddy. He has ice cream all over his mouth and cheeks.</p>\n<p> </p>\n<p>Draco sighs. \"Yes,\" he says shortly. \"You're a mess.\" He reaches across the table to wipe Teddy's face with his napkin. He starts, shocked, when Harry takes this opportunity to grab his arm and, very carefully, roll up his sleeve. \"We're in <em>public</em>,\" he hisses, heart hammering. \"You can't just – people will <em>see</em> it, Potter.\" People will also see Harry holding onto Draco's arm.</p>\n<p> </p>\n<p>People will <em>also</em> see Harry running a finger down the marked skin, which, <em>what is he doing</em>. \"Harry,\" Harry says absently. \"Not Potter. Did it hurt?\"</p>\n<p> </p>\n<p>Draco, apparently, absolutely loses his mind, because he responds, \"When I fell from heaven?\" The logic was that he does not really want to talk about his mark at <em>all</em>, but then he realizes that instead he has implied Harry is hitting on him. He looks up, horrified, but Harry is wrinkling his nose and laughing the way he does sometimes when Teddy says ridiculous things.</p>\n<p> </p>\n<p>\"Yeah,\" says Harry, squeezing his wrist, and Draco's breath catches. \"<em>No</em>.\" Harry laughs again. \"You know what I mean.\"</p>\n<p> </p>\n<p>\"Yes,\" says Draco, reclaiming his arm and pulling his sleeve down roughly. \"It did.\" No one else has ever asked him this before, nor has Potter – Harry – ever touched him before, apart from the times he's hit him, or that odd moment when he touched Draco's nose.</p>\n<p> </p>\n<p>This. Is. <em>Stupid</em>.</p>\n<p> </p>\n<p>The next day, Harry manages to convince Draco to bring Teddy flying with him, and they watch Teddy zip around on his training broom before having a race, which Draco narrowly, but <em>definitely</em>, wins. They argue, but it is not malicious arguing, and Teddy seems to realise this after a while and watches with interest, rather than anxiety. And then, to Draco's chagrin, he ends up playing <em>hide and seek</em> with them, of all things. It's all his fault for mentioning that, as a child, he found the manor a <em>brilliant</em> place for hide and seek – so it follows that it's all his fault he ends up hiding in a wardrobe with Harry, who happened to already be there when he dove in at the last second, dealing with Harry's warm, near body and Harry's breath on the back of his neck for what feels like ages.</p>\n<p> </p>\n<p>\"You're breathing so fucking hard,\" Draco hisses, and then tries not to think of the word <em>hard</em>. \"Have you ever heard of breathing through your nose?\"</p>\n<p> </p>\n<p>\"Sorry,\" Harry says very tensely.</p>\n<p> </p>\n<p>The moment Teddy finds them, Harry says, \"Toilet,\" and dashes off, leaving Draco blinking and a bit dizzy and overpowered by a familiar wet grass and leather sort of smell.</p>\n<p> </p>\n<p>That night, Draco dreams of Harry's warm body pressed against his back in the wardrobe, of the smell of amortentia and Harry's mouth curving into a real smile, and wakes up hard and guilty and <em>furious</em>.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>\"You look like your arch enemy just popped in and told you he's your father,\" says Ginny, who has brushed up on her knowledge of muggle films since living with Harry.</p>\n<p> </p>\n<p>Harry, who has been sitting at the kitchen table staring hollowly into the middle distance for the better part of the night and into the morning, starts and spills – thankfully cold – tea all over his fingers. \"Fucking hell.\" He reaches for his wand, casts a drying charm, overdoes it, and clears away all his tea. \"Merlin's sodding <em>balls, </em>I can't even drink tea,\" he mutters, glaring into his empty cup.</p>\n<p> </p>\n<p>Ginny snorts. \"Someone is <em>brooding</em>,\" she says, making her way over to the toaster, pajama clad and hair pulled back as usual. \"Are you still all worked up about Malfoy, then?\"</p>\n<p> </p>\n<p>Harry groans. This is the problem. This is the <em>really</em> <em>fucking weird</em> problem, and this is not what he wants to talk about. \"Can we just,\" he says, dropping his head to the table with a <em>thump</em>, \"Not talk about Draco?\"</p>\n<p> </p>\n<p>\"Draco?\" says Ginny.</p>\n<p> </p>\n<p>Harry cannot see her face, but he can imagine there is amusement in her expression, and he'd really rather she <em>wouldn't</em>, thanks.</p>\n<p> </p>\n<p>\"Are you on first name basis now, then?\" Ginny pushes. \"You have been at that manor every fucking day.\"</p>\n<p> </p>\n<p>\"You're the one shagging Pansy Parkinson!\" he says, naturally <em>before</em> realising that nobody has mentioned shagging anybody, and he's probably gone a bit further than really necessary or wise. Even if Ginny <em>has</em> actually kept up this thing with Pansy – rare, as her attention span with girls is typically short.</p>\n<p> </p>\n<p>\"Yeah, I am,\" says Ginny, and he can tell, though his face is still pressed into the wood of the kitchen table, that she is sitting down next to him, and also incredibly fucking amused. Well, he's glad <em>she's</em> entertained. \"But I don't think anybody mentioned <em>shagging</em>.\" After a pause, she says, \"Harry. Is this the moment? Have you <em>shagged Malfoy</em>?\"</p>\n<p> </p>\n<p>\"No!\" Harry insists, looking up so quickly he practically gives himself whiplash. \"No, I have not <em>shagged</em> Malfoy!\"</p>\n<p> </p>\n<p>And of course he <em>hasn't</em>, he just – this is <em>ridiculous</em>.</p>\n<p> </p>\n<p>One moment, he was finally speaking to Draco, having that stupid \"time-out\" and then trying to behave like an adult for Teddy's sake, and then the next moment he was thinking to himself, <em>well, if he's not an awful person, and gay, even, I guess it </em>is <em>all right to notice he's grown into his stupid face</em>, and then they went flying together and everything went to shit.</p>\n<p> </p>\n<p>They decided to have a race, at Teddy's encouragement, and okay, Harry was allowing himself to accept, at that point, that he thinks Draco's potion work is admirable, and he's been noticing his face, and maybe watching him bend over to fish for quills and droppers in his desk drawers is not <em>entirely</em> objectionable, either, especially in those muggle clothes, but – Harry's got friends he admires and recognizes are attractive. But then – they were flying, and Draco looked over his shoulder and laughed openly, breathlessly, shouted, \"As if you could beat me, Potter!,\" his smile wide and bright and his cheeks flushed pink and his hair all loose and tousled from the wind and Harry – Harry – quite suddenly he felt a sharp tugging in his stomach, his chest, a bittersweet twist that made him stop his broom, feeling like he had to if he didn't want to fall off. Then stupid Draco <em>won</em>, of course, and everything was <em>terrible</em>, and Harry couldn't even be in a wardrobe with him for hide and seek without feeling strange and inundated with the smell of cinnamon and expensive material and fucking <em>aroused</em>.</p>\n<p> </p>\n<p>And maybe he had a wank about it, but that's – harmless. Isn't it? It <em>is</em>, it's harmless.</p>\n<p> </p>\n<p>It's not.</p>\n<p> </p>\n<p>And the thing is – Harry knew. He just didn't want to admit it. All this time, he really was thoroughly convinced Draco Malfoy was a complete wanker, and he still isn't convinced he's not, but. But. Harry knew Draco wasn't ugly, and he knew he'd noticed, in a strange, dull, confused way, right after seventh year, and when he came out he allowed himself a moment of <em>I think I wanted to shag him just a little bit</em>, before burying it under horrified layers of <em>of course I didn't, he's a wanker</em>.</p>\n<p> </p>\n<p>He wasn't supposed to turn out to be a little less of a wanker than Harry imagined, the type of person who doesn't fall at Harry's feet or take any shit from him at all, who talks to a five year old like an adult in a way that makes Harry laugh, who gets ink all over his hands and face and doesn't seem to notice, staring into his cauldron with hair falling in his face and ink on his nose and a look of deep concentration over his sharp features that stirs something low down in Harry's gut.</p>\n<p> </p>\n<p>\"Are you sure?\" says Ginny. \"Are you sure this isn't the moment?\"</p>\n<p> </p>\n<p>\"We've been looking after a <em>child</em>,\" says Harry. \"When would I have shagged him?\"</p>\n<p> </p>\n<p>\"What if you weren't looking after Teddy?\" says Ginny. \"Would you shag him then?\"</p>\n<p> </p>\n<p>\"I'm not ready for this conversation,\" Harry says to the kitchen floor.</p>\n<p> </p>\n<p>\"Wow,\" says Ginny, leaning forward on her elbows. \"I expected outright denial.\"</p>\n<p> </p>\n<p>\"I don't know why I didn't give it to you,\" Harry says miserably.</p>\n<p> </p>\n<p>\"Are you afraid he doesn't want to shag you?\" says Ginny. \"Pansy reckons he does.\"</p>\n<p> </p>\n<p>\"She <em>what</em>?\" says Harry, nearly knocking his cup off the table this time.</p>\n<p> </p>\n<p>\"She thinks you want to fuck each other,\" says Ginny matter-of-factly, putting her feet up on the chair across from her. \"And hey, she was half right. Or at least, she said something like...it'd probably do you and everybody else some good to just stop posturing and fuck each other.\"</p>\n<p> </p>\n<p>\"Is that what everyone thinks?\" Harry blurts, feeling stupid and hating it.</p>\n<p> </p>\n<p>Ginny wrinkles her freckled nose. \"What do you mean, exactly?\"</p>\n<p> </p>\n<p>\"Is that what everyone <em>thinks</em>?\" Harry repeats. \"Everybody's always – you lot are always going on about the way I talk about<em> Malfoy</em>, saying I'm so irrational about Malfoy and everything else. Have you all thought – all this time – I just wanted to shag him?\"</p>\n<p> </p>\n<p>\"<em>Did</em> you just want to shag him?\"</p>\n<p> </p>\n<p>\"I asked you a question first.\"</p>\n<p> </p>\n<p>\"I wondered,\" Ginny shrugs. She at least has the decency to flick an apologetic glance in his direction. \"I think Hermione wondered, too – and maybe Neville.\"</p>\n<p> </p>\n<p>Harry buries his head in his arms again. \"This is so fucking embarrassing.\"</p>\n<p> </p>\n<p>\"Doesn't have to be,\" says Ginny, pulling her feet back to her own chair and hugging her knees to her chest. She rests her chin on her knees and contemplates him carefully. \"So you want to shag him.\"</p>\n<p> </p>\n<p>\"I don't want to think about it,\" Harry grumbles.</p>\n<p> </p>\n<p>Except he's going to have to think about it, because he's meant to go to the manor this afternoon, just like he has every other day. Teddy's expecting him, after all.</p>\n<p> </p>\n<p>And that's all it is – that Teddy is expecting him.</p>\n<p> </p>\n<p>When it comes time, Harry goes through his usual routine of apparating to the front gates, sprinting up the hedge-lined pathway with the mad peacock in hot pursuit, and dashing through the front doors to the sounds of Draco's laughter. It's not really so derisive anymore, and Harry's not sure of the way it makes him feel.</p>\n<p> </p>\n<p>This is the problem. He's never quite sure of the way he feels when it comes to things like this. He wishes it were all solid, like Ron and Hermione and Dumbledore and his firm belief in being on the right side of a war, but it just never is – he thought he loved Ginny, but it turns out he doesn't even like girls that way, and he thought he loved the boy from the coffee shop, but he couldn't seem to tell him anything, the way he thought he should. How does he <em>know</em> how he feels, when it comes to blokes he fancies? How can he know how to express it, when he can't work out quite how he feels, or quite how it feels to love someone that way at all?</p>\n<p> </p>\n<p><em>Draco</em> doesn't seem like he's likely to be a very solid thing for Harry, either. There's that mark on his arm, that obvious indicator of his time on the wrong side of the war Harry was so sure of, and he can be quite rude, when he wants to be, and makes disparaging remarks about Gryffindor values – and yet he's working so hard at his potion, and at doing something on his own, and Harry has trouble not thinking about him, and what he might be doing when Harry's not around, and how it feels good to be around someone willing to really argue with him. And when he smiles like he's doing now, for once unguarded and sincere, Harry feels that twisting in his belly and forgets what to say.</p>\n<p> </p>\n<p>\"I think that peacock has a personal vendetta against you,\" says Draco as he shuts the door.</p>\n<p> </p>\n<p>\"A true Malfoy, then, isn't it?\" says Harry.</p>\n<p> </p>\n<p>Draco rolls his eyes. \"I haven't got a personal vendetta against you,\" he says.</p>\n<p> </p>\n<p>\"Maybe now you haven't,\" Harry concedes, swallowing. \"Where's Teddy?\"</p>\n<p> </p>\n<p>\"With – Pansy, actually,\" Draco says, oddly hesitant. \"She – turned up wanting to play with him. They're in the garden.\"</p>\n<p> </p>\n<p>\"Oh,\" says Harry. It occurs to him that this means Teddy is occupied, and he probably doesn't need to be here, but he doesn't want to leave. He doesn't want to go back to Grimmauld Place and wander about in his pants, eating toast and crisps and trying not to think of Draco – <em>especially </em>not in the context of wanking, which honestly has only happened once. Or twice. He looks at Draco's mouth, currently a bit twisted and unreadable, and tries to keep the sudden panic building inside of him from coming out. God, why does he <em>feel</em> this way; why did it happen so quickly?</p>\n<p> </p>\n<p><em>Probably because it's been building for a bit longer than these few weeks</em>, whispers his treacherous subconscious, but he chooses to ignore it.</p>\n<p> </p>\n<p>\"You could have a look at my potion,\" Draco says, shrugging and looking down at the hall, rather than at Harry's face. \"I've redone it. It's the ninth go now, and I haven't had anybody smell it yet.\"</p>\n<p> </p>\n<p>\"All right,\" Harry says quickly. Draco smiles, and Harry's stomach feels all stupidly effervescent again. \"Why do you need other people to smell it?\" Harry asks as they make their way to the study, walking awfully close – or maybe Harry's just particularly aware of any bit of proximity. \"Can't you tell yourself?\"</p>\n<p> </p>\n<p>\"I can,\" says Draco, \"But I like to test it with other people. I'd never feel comfortable having only one test subject. You don't know that everyone is going to react the same. Of course, if I'm successful, there'll need to be Ministry trials, more professional stuff – but I'd like to do everything I can before that to make sure it's all right.\" Draco pushes open the smooth, dark door into his study, and Harry is instantly greeted with the familiar blend of study and Draco and amortentia scents.</p>\n<p> </p>\n<p>\"I think I can smell it already,\" says Harry.</p>\n<p> </p>\n<p>\"Good,\" says Draco, making his way over to his desk. \"I was fairly confident about this one.\"</p>\n<p> </p>\n<p>Harry approaches the cauldron and leans closer. \"Yes,\" he says. \"Definitely smells all right. A bit stronger than the others, I think.\"</p>\n<p> </p>\n<p>\"Brilliant.\" Draco leans over to make a mark on a roll of parchment, and Harry tries to keep his eyes away. \"Smelled particularly strong to me, too, but not in a bad way.\"</p>\n<p> </p>\n<p>\"No, not in a bad way,\" says Harry. He watches Draco irritably swipe hair out of his face with an ink stained hand and asks, \"What's it smell like for you?\" He smirks. \"Apart from your mum's perfume.\"</p>\n<p> </p>\n<p>Draco glowers. \"It's a comforting smell, all right?\" he says defensively. \"It reminds me of – home. The good parts of home.\"</p>\n<p> </p>\n<p>\"That makes sense,\" says Harry, coming round to peer curiously at Draco's notes. His handwriting is a bit loopy but incredibly neat. \"I'm only joking.\" He turns to grin at Draco and realizes they're rather closer than he intended them to end up. Draco raises an eyebrow. \"If you tell me yours, I'll tell you mine,\" says Harry, not moving, though he probably should. \"What could be so embarrassing about it?\"</p>\n<p> </p>\n<p>\"It's – I just imagine it to be – private,\" Draco insists, looking back down at his notes.</p>\n<p> </p>\n<p>\"Come on, exchange of information,\" Harry needles. \"Your private amortentia scent for mine.\"</p>\n<p> </p>\n<p>Draco rolls his eyes, but he can't seem to keep a small smile from flickering across his face. Encouraged, Harry nudges him, and Draco sighs loudly and says, \"Yes, yes. All right. My mother's perfume, and – a sort of potions lab smell, like parchment and chemicals, a bit – and then...\" Harry nudges him again, and he responds with a direct and strangely defiant look. \"Quidditch, I suppose,\" he says. \"Something like Quidditch.\"</p>\n<p> </p>\n<p>\"Quidditch?\" Harry repeats.</p>\n<p> </p>\n<p>\"Yes,\" says Draco. \"Something – it reminds me of Quidditch. Sort of – wet grass and – leather.\"</p>\n<p> </p>\n<p>It occurs to Harry at this moment that they really are standing <em>very </em>close. \"Oh,\" he says. \"Okay. Well. Mine's like – treacle tart.\"</p>\n<p> </p>\n<p>Draco lets loose a silly laugh, the kind that blows his fringe up a bit, and leans closer to him, though Harry has no idea if this is a conscious or unconscious action. He can feel Draco's hair tickling his cheek for a moment. \"Food,\" Draco says.</p>\n<p> </p>\n<p>\"It's nice,\" says Harry. \"Not my mum.\"</p>\n<p> </p>\n<p>\"Shut up about my mum,\" says Draco, still shaking a bit from laughter; he's so close Harry can actually feel him moving, and it's – well, it's – hard to concentrate.</p>\n<p> </p>\n<p>\"Also it's – wood, like a broomstick handle,\" Harry continues. \"And.\"</p>\n<p> </p>\n<p>\"And?\" Draco says softly.</p>\n<p> </p>\n<p>Harry can smell Draco clearly from up close, and he <em>knew</em> this, he must have known on some level what this meant, but it's the first time he's really let it float to the surface and make a real bid for his attention. \"Cinnamon,\" he murmurs.</p>\n<p> </p>\n<p>\"Hmm?\"</p>\n<p> </p>\n<p>\"Cinnamon,\" says Harry, kissing him.</p>\n<p> </p>\n<p>He can't help it. He felt drawn to him, pulled to him like a magnet, under the influence of these lovely smells and his impossible closeness. Draco starts and makes a noise of surprise, and then he relaxes, and Harry almost gasps when he kisses back, soft and wet and warm. Draco's hands rise up onto his chest, his shoulders, rougher and firmer than Harry expected, and Harry's hands drop to grip bony hips.</p>\n<p> </p>\n<p>It's at the moment when Draco's lips part, and Harry takes in a sharp breath at a brief touch of tongues, when Teddy's small voice says, \"Oh!\"</p>\n<p> </p>\n<p>Harry and Draco startle badly, jumping away from each other. Dazed, Harry stumbles over Draco's chair and knocks into the cauldron on the desk; helplessly, he watches it tip and spill onto the floor.</p>\n<p> </p>\n<p>\"Oh, no,\" Teddy says forlornly.</p>\n<p> </p>\n<p>\"Shit!\" says Draco, heedless of Teddy's ears. He grabs the cauldron, but already, most of it has soaked into the rich red rug. \"<em>Shit</em>.\"</p>\n<p> </p>\n<p>\"I'm sorry,\" Harry says quickly. \"I'm sorry. <em>Bugger</em>, Draco, I'm sorry – \" He drops down to his knees with his wand, ready to help clean, but Draco's hand flies out and grabs his wrist.</p>\n<p> </p>\n<p>\"No,\" says Draco.</p>\n<p> </p>\n<p>\"What?\"</p>\n<p> </p>\n<p>\"No, just – leave,\" says Draco.</p>\n<p> </p>\n<p>Harry stands up. \"<em>What</em>?\" he repeats.</p>\n<p> </p>\n<p>\"Can you just – leave?\" Draco says, eyes manic. His hair is a bit mussed, and his cheeks are flushed, and for a moment he looks more upset than Harry has seen him in quite a long time. \"Please?\" he adds, his voice breaking. He clears his throat. \"Potter,\" he says with more authority. He straightens up, his eyes hardening.</p>\n<p> </p>\n<p>\"I didn't mean it,\" Harry says desperately. \"I'm sorry.\" Everything has changed direction so quickly he can't quite get his head around it.</p>\n<p> </p>\n<p>\"It's all my fault!\" says Teddy, clapping his hands to his cheeks in dismay.</p>\n<p> </p>\n<p>\"It's not your fault, Teddy, it's mine,\" says Harry.</p>\n<p> </p>\n<p>\"It's not anybody's fault,\" Draco says tersely. With a graceful flick of his wand, the spilled potion vanishes. There is only a small puddle left in the bottom of the cauldron. \"It was an accident. It was a new start. I can recreate it. I've only lost a few days. I would just prefer – if you would leave, Potter.\"</p>\n<p> </p>\n<p>\"Harry,\" Harry says helplessly.</p>\n<p> </p>\n<p>Draco's eyes soften briefly. \"Harry,\" he concedes. \"I just – you should leave. Teddy will see you in a few days.\"</p>\n<p> </p>\n<p>\"I – you don't want me to come back – at all?\" Harry blinks.</p>\n<p> </p>\n<p>\"I would prefer it if – you didn't.\"</p>\n<p> </p>\n<p>Harry doesn't understand what's just happened. They <em>kissed</em>. They kissed, and Draco's strong hands were on his chest and his shoulders, and there was just barely <em>tongue</em> involved, and his heart was hammering and it still is and he doesn't understand why Draco wants him to <em>leave</em>, and not even come <em>back</em>. Draco isn't looking at him, choosing instead to stare fixedly at some spot on the wall.</p>\n<p> </p>\n<p>\"Why?\" Teddy asks in small voice.</p>\n<p> </p>\n<p>\"Teddy?\" Pansy appears in the doorway in a very short skirt. \"Draco, did the child – oh, <em>there</em> you are, Merlin's tits, kid – \" She appears to get a good look at everyone's facial expressions at this point, because she stops mid-thought and says, \"What on earth's the matter?\"</p>\n<p> </p>\n<p>\"Why does Harry have to leave?\" Teddy repeats. His bottom lip is trembling again.</p>\n<p> </p>\n<p>\"I – don't worry about it, Ted, I'll just leave,\" says Harry, suddenly entirely sure he doesn't want to have this argument in front of a five year old and Pansy Parkinson.</p>\n<p> </p>\n<p>\"But you were <em>kissing</em>!\" says Teddy. \"Doesn't that mean – \"</p>\n<p> </p>\n<p>\"You were <em>what</em>?\" says Pansy.</p>\n<p> </p>\n<p>\"I'll just go then,\" says Harry quickly, his face heating. He remembers Pansy told Ginny that he and Draco ought to fuck, and now he feels stupid, and even more confused and rejected. \"I'll just – I'll go.\"</p>\n<p> </p>\n<p>He barrels out of the room and apparates the first moment he can, not without a completely uncalled for peck from the stupid rabid peacock. The first thing he sees when he opens the door to Grimmauld Place is that Ron and Hermione appear to be visiting; they're standing in the hall looking flushed and happy and chatting away to Ginny.</p>\n<p> </p>\n<p>\"Harry!\" says Ginny. \"You're back early.\"</p>\n<p> </p>\n<p>\"We've got – \" Ron starts proudly, and then he frowns. \"You don't look so good.\"</p>\n<p> </p>\n<p>\"I kissed Malfoy,\" Harry blurts out.</p>\n<p> </p>\n<p>\"<em>Oh</em>,\" says Hermione. Ron's face drains of color completely.</p>\n<p> </p>\n<p>\"But apparently he doesn't – so – I guess I've probably fucked it all up. I don't know. Sorry. Cheers.\" He turns and storms up the stairs, not in the mood to speak to them like he thought he might be at first. Their startled expressions have turned him off the idea completely; he thinks he'd rather wallow instead.</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>\"Do you and Harry fancy each other?\" Teddy demands. \"If you were kissing, don't you fancy each other?\"</p>\n<p> </p>\n<p>Draco heaves a sigh, an hysterical bit of laughter finding its way into the exhalation. He is sitting in the same stupid fucking parlor in which Teddy forced he and Harry into a time-out, sprawled over the armchair and waiting for Pansy to return with tea. The moment Harry left, she scrutinized him carefully and finally said, \"Go to the parlor. Sit down. I'll bring you tea.\"</p>\n<p> </p>\n<p>Pansy rarely performs any type of chore or refreshment related task, and she even more rarely does things for other people, so Draco knows she is probably trying to work out what to say to him. That, and she is truly his friend, but he's known that for a while.</p>\n<p> </p>\n<p>\"It's complicated, Teddy,\" he says.</p>\n<p> </p>\n<p>\"Why?\" says Teddy. He peers at Draco over the armrest. \"Is it my fault? Did I mess it all up?\"</p>\n<p> </p>\n<p>\"No,\" says Draco. \"You didn't mess it all up, Teddy.\"</p>\n<p> </p>\n<p>\"Then why did you want him to go away?\" Teddy insists. Draco can feel a headache coming on, and Teddy's high voice is not helping matters. He shuts his eyes tight and presses his knuckles against them. \"Does he fancy you and you don't fancy him?\" Teddy continues. \"Why not? I think he's a very nice person to fancy. <em>I</em> might fancy him, if <em>I </em>were a grown up and I did gross things like that. Harry used to have a boyfriend who was all right but I think I'd like it better if <em>you</em> were Harry's boyfriend. I think you should fancy him, Draco.\"</p>\n<p> </p>\n<p>\"You can't just,\" Draco mumbles, fists still pressed to his eyes, \"Tell me who to fancy.\"</p>\n<p> </p>\n<p>\"I don't understand why you're cross with him,\" Teddy says stubbornly. \"He didn't <em>mean</em> to knock over your potion. I startled him. He smiles at you nicely, now that he knows you. See, I <em>said</em> if you had a date he'd like you. Now he likes you so much he fancies you! That's no reason to be cross.\"</p>\n<p> </p>\n<p>\"Do you think he really does fancy me?\" says Draco, and he cannot believe he is asking <em>anyone</em>, let alone a five year old, this question. He drops his hands to his lap, feeling utterly pathetic. He has just turned twenty-three; surely he should be better equipped for this sort of situation.</p>\n<p> </p>\n<p>\"Well, he was <em>kissing</em> you, wasn't he?\" says Teddy. He wrinkles his nose. \"It's yucky that grown-ups do that, but I <em>know</em> what it means, and it means you fancy each other.\"</p>\n<p> </p>\n<p>Draco lets out another crazed exhalation of laughter. \"I suppose he<em> was</em> kissing me.\" There's no way Teddy can understand Draco's apprehension; there's no way he can understand that Harry might just sleep with him and then regret it, and Draco doesn't know that he can face that. Teddy doesn't understand that they were surrounded by the scent of amortentia, and maybe that had something to do with it, and that <em>Harry Potter</em>'s not likely to feel anything substantial for <em>Draco Malfoy</em>, no matter what Luna said, or how odd these few weeks have been, or how Draco has felt since sixth year. He doesn't understand that kissing him was likely a humiliating mistake.</p>\n<p> </p>\n<p>\"All right.\" Teddy turns around and Draco peers at the doorway; Pansy is striding in with a tray of tea and biscuits, looking all business now. She slams the tray down a bit more forcefully than necessary and declares, \"What's the problem, then? You kissed him. Why are you mad?\"</p>\n<p> </p>\n<p>\"That's what <em>I</em> keep asking!\" says Teddy, throwing up his arms in exasperation.</p>\n<p> </p>\n<p>\"Teddy – darling – \" says Pansy, affording him an affectionate smile. \"Draco and I need to have a bit of a grown-up chat.\"</p>\n<p> </p>\n<p>\"I don't know about that,\" says Teddy darkly. \"I don't think grown-ups are very good at making sense with each other.\"</p>\n<p> </p>\n<p>\"That's just a grown-up boy thing,\" says Pansy. \"Girls, on the other hand, know everything, which is something you'll do well to remember.\" She scratches gently at his head with her long red fingernails. \"Go on, have a biscuit and go play in your bedroom, darling. I promise one of us will be right there to play with you. Boss Krupnik about if you want to play with someone.\"</p>\n<p> </p>\n<p>Teddy sighs as if he has now seen everything, all in five years, takes a chocolate biscuit, and wanders out of the room.</p>\n<p> </p>\n<p>\"I think you've been a terrible influence on him,\" says Pansy. \"Look at him – no patience at all.\"</p>\n<p> </p>\n<p>Draco snorts, his head in his hands. \"Probably,\" he concedes.</p>\n<p> </p>\n<p>\"Now, really,\" says Pansy, and her voice goes obnoxiously gentle the way it does when they have to talk about his father – except the next words out of her mouth are, \"What the fuck's wrong with you?\"</p>\n<p> </p>\n<p>\"Oh, thank you for your sensitivity,\" says Draco.</p>\n<p> </p>\n<p>\"Never been my strong point, never will be,\" says Pansy dismissively. \"Talk to me. Why'd you snog Harry Potter and then kick him out of your house? For Merlin's sake, I had Teddy covered, you could have shagged him, even. And I <em>know</em> you want it, don't give me any of your shit.\"</p>\n<p> </p>\n<p>Draco glares, but he supposes being caught kissing Harry Potter by a five year old sort of ruins any chance he has of denying that he – well, wants to kiss Harry Potter.</p>\n<p> </p>\n<p>\"Because – it's not as if he <em>actually</em> wants me!\" says Draco.</p>\n<p> </p>\n<p>Pansy performs a rather impressively disdainful eyebrow raise, her mouth twisting. She's probably been spending too much time with him, too. \"Rubbish,\" she says. \"Why'd he <em>snog</em> you, then? Was it him who kissed you, or you who kissed him?\"</p>\n<p> </p>\n<p>\"He kissed me,\" Draco admits. \"But – \"</p>\n<p> </p>\n<p>\"But what? Did you curse him or something? Are you making <em>actual</em> amortentia?\"</p>\n<p> </p>\n<p>\"<em>No</em>.\"</p>\n<p> </p>\n<p>\"Then what the fuck do you think? He was suddenly possessed by blibbering whatsits or whatever other rubbish creatures Loony Lovegood's probably telling you about all the time? If you're actually starting to believe all her nonsense I'm not letting you hang round with her anymore.\"</p>\n<p> </p>\n<p>\"Shut up about Luna,\" Draco says. \"It stank of amortentia in the place. There's just – he can't really. It's – why would he?\"</p>\n<p> </p>\n<p>\"Because you're <em>hot</em>, you piece of shit,\" says Pansy. \"Are you serious? Because you're dead gorgeous, and those muggle trousers flatter your arse like you wouldn't believe. And also you're a fairly decent human being – you're clever and you're funny and you're good to the people you love. Arsehole. I'm not saying any of that again.\"</p>\n<p> </p>\n<p>\"I,\" says Draco, startled. He is not very good at \"thank you,\" nor is very good at returning compliments, so he mumbles, \"I know all that. I just thought he was too stupid to realise. And people won't – getting involved with him is not a good idea.\"</p>\n<p> </p>\n<p>\"Why the fuck not?\" says Pansy. \"He's fit and the war was ages ago. You need to get laid, according to Weasley<em> he </em>needs to get laid, you're willing to snog each other – it's not that difficult.\"</p>\n<p> </p>\n<p>\"Not for you, maybe,\" Draco mutters.</p>\n<p> </p>\n<p>\"Yes, because I don't insist upon being a <em>drama queen</em> about everything.\"</p>\n<p> </p>\n<p>\"Oh, yes, of course you don't.\"</p>\n<p> </p>\n<p>\"I shagged Ginny and the world didn't collapse in on itself,\" says Pansy. \"Come on, Draco. Now the war's over and we're not being prats, our dating pool is so much larger, and you are just being thick by not taking advantage of it.\"</p>\n<p> </p>\n<p>\"It's <em>Harry Potter</em>, Pansy!\" Draco bursts out.</p>\n<p> </p>\n<p>\"Why do you care?\" says Pansy. \"You're always going on about not caring about his name, not wanting to worship him like everybody else – \"</p>\n<p> </p>\n<p>\"That's not what I <em>mean</em>,\" says Draco. \"I <em>mean</em> – I've been attracted to him since <em>sixth year</em>, Pansy, this is – I wasn't prepared for him to turn around and start fancying me! This is – he hasn't got a clue what he wants.\"</p>\n<p> </p>\n<p>Pansy's dark eyes go soft. \"Darling,\" she says. \"This means something to you.\"</p>\n<p> </p>\n<p>Draco rakes a hand through his hair, frustrated. \"I suppose,\" he says to his knees. \"Yes.\"</p>\n<p> </p>\n<p>\"How do you know he hasn't got a clue what he wants? Has he said that to you?\"</p>\n<p> </p>\n<p>\"No,\" Draco admits.</p>\n<p> </p>\n<p>\"Teddy's right. Grown-up boys don't make any sense with each other, and the thing they need to do to fix that is <em>talk</em>. He forced you on that <em>date</em> for a reason. And it worked well enough, didn't it? You got to the point where you were snogging, which is a lot closer than you were before that <em>date</em>.\"</p>\n<p> </p>\n<p>\"I believe he said <em>all</em> grown-ups don't make any sense with each other,\" says Draco weakly.</p>\n<p> </p>\n<p>\"And I believe you're an idiot,\" says Pansy, \"And the only thing that will change my mind is if you actually ask Potter his opinion, instead of assuming you know what it is.\"</p>\n<p> </p>\n<p>\"What am I supposed to do,\" Draco grumbles, \"Just turn up at his house?\"</p>\n<p> </p>\n<p>Pansy shrugs. \"He did the same to you.\"</p>\n<p> </p>\n<p align=\"center\">***</p>\n<p> </p>\n<p>Harry is curled up on the windowsill of his bedroom when somebody knocks at his door. He groans softly into his folded arms and says, \"What?\"</p>\n<p> </p>\n<p>\"Harry?\" Hermione's voice says tentatively.</p>\n<p> </p>\n<p>\"<em>What</em>?\" he repeats, automatically feeling bad about his ornery tone of voice; none of this is Hermione's fault. He's been sitting here plotting the ways he can return to Malfoy Manor tomorrow – will Draco let him in? Is there a way he can get in if he doesn't? All he knows is, there's simply no way he's going to give up after one confusing kiss, not when Draco's given him no proper explanation at all – and his chest hurts. He's been sitting up here with an ache in his chest that sharpens every time he remembers the brief moment when his tongue touched Draco's, that makes him think he really <em>can't</em> just mope and give this up as a bad job.</p>\n<p> </p>\n<p>\"There's, er – someone downstairs to see you,\" says Hermione.</p>\n<p> </p>\n<p>Harry lifts his head. \"Someone?\" he says suspiciously.</p>\n<p> </p>\n<p>\"Yes. I think it'd be best if you came downstairs.\"</p>\n<p> </p>\n<p>Harry scrambles to the door and flings it open. \"Who's downstairs?\" he says. \"Is it – \"</p>\n<p> </p>\n<p>\"Malfoy,\" says Hermione. She gives him an appraising look.</p>\n<p> </p>\n<p>\"Look,\" they both say at the same time, then, \"You first.\"</p>\n<p> </p>\n<p>Hermione laughs. \"Let me,\" she says. \"Because all I want to say is – I don't know what's going on, exactly, and I don't know that I approve of it yet – but I do know I've wondered – and – I suppose you should do what you feel – you ought to do. Just be careful. Okay?\"</p>\n<p> </p>\n<p>\"Okay,\" says Harry. He looks at the hand she's gripping the doorframe with and does a double take. \"What – is that – \"</p>\n<p> </p>\n<p>Hermione pulls her hand back toward her, unable to conceal a grin. There is a diamond ring on her finger. \"Sort yourself out first,\" she says. \"Then we'll talk.\"</p>\n<p> </p>\n<p>\"<em>Hermione</em>,\" he says. \"I – brilliant – I thought – \"</p>\n<p> </p>\n<p>\"Go sort your rubbish out,\" she says, pushing him out of the door and then regarding him carefully. \"Although you might want to put some trousers on.\"</p>\n<p> </p>\n<p>\"Fuck it,\" says Harry.</p>\n<p> </p>\n<p>Naturally, he regrets this a little bit when he gets to the bottom of the stairs and finds Draco – of course fully clothed, and in well-fitting trousers, at that – standing awkwardly with Ron and Ginny.</p>\n<p> </p>\n<p>\"We'll see you later, then,\" says Hermione, grabbing Ron's hand. Ron shoots Harry a quizzical look before letting Hermione lead him out the door. Ginny leans over and says, \"I really wouldn't worry about him, I imagine he'll just stare at you for a bit and then get over it,\" before following them out.</p>\n<p> </p>\n<p>\"Right,\" says Draco into the silence. He crosses his arms over his chest as if attempting to hold himself together. He really does look pretty brilliant in those muggle clothes.</p>\n<p> </p>\n<p>\"Right,\" says Harry, reminding himself that he is feeling defensive right now and this isn't the proper time to stare at Draco's clothes. \"What did you mean by kicking me out?\"</p>\n<p> </p>\n<p>Draco closes his eyes. \"What did you mean by kissing me?\" he asks, his voice breaking slightly.</p>\n<p> </p>\n<p>Harry looks at the tense set of Draco's jaw and his shoulders, his ramrod straight posture and tightly folded arms, and is seized by the urge to do it again, to soften him up and make him look like the warm, pliant, cinnamon scented person he kissed.</p>\n<p> </p>\n<p>Harry shrugs. \"I wanted to,\" he says.</p>\n<p> </p>\n<p>Draco opens his eyes. \"Why?\"</p>\n<p> </p>\n<p>\"Because,\" says Harry. \"Lately I just – want to.\"</p>\n<p> </p>\n<p>\"Want to kiss me?\" Draco says incredulously. \"But <em>why</em>? I'm asking you <em>why</em>.\"</p>\n<p> </p>\n<p>\"You smell good,\" Harry blurts out, and then he really feels like an idiot. You <em>smell</em> good?</p>\n<p> </p>\n<p>Draco laughs in that way that makes Harry think he's feeling more hysterical than happy. \"Is that all?\"</p>\n<p> </p>\n<p>\"You look good in muggle clothes,\" Harry continues, still struggling helplessly. \"I like your smile, when you're not taking the piss. I like – I think it's – good, what you're doing, or trying to do – I think you'll do it. I, er – I think you might be sort of brilliant, actually.\"</p>\n<p> </p>\n<p>Draco makes a strange, distressed noise. \"It was only about three weeks ago you were telling me I couldn't be trusted,\" he says, finally making eye contact, though it is defensive and unsure.</p>\n<p> </p>\n<p>\"Well,\" says Harry. \"I'm a bit of an idiot. A lot of the time. And I don't always – mean what I say, one hundred percent – I know people think I do.\" He clears his throat. \"Well, I mean, sometimes – I meant all those things about you and – wanting to kiss you, and, er, things. I think what it is really is I've got a particular skill, uh, with – deluding myself.\"</p>\n<p> </p>\n<p>Draco snorts. \"Merlin,\" he says quietly, and then, \"You want to <em>kiss me and things</em>.\" He rolls his eyes. \"Even though I'm Draco Malfoy, and you're Harry Potter? Even though I used to be – despite everything I've done and all my – <em>untrustworthiness</em>?\" He says it scathingly, but Harry imagines it's a real question.</p>\n<p> </p>\n<p>\"Yes,\" says Harry. \"I think so. And I don't think you're untrustworthy.\"</p>\n<p> </p>\n<p>\"Do you <em>know</em> so?\"</p>\n<p> </p>\n<p>Harry bites his lip. \"I think I have to – try first,\" he says honestly. \"But I <em>think</em> – I really, really think so. I – you're trying, aren't you? I see you trying, and you really love Teddy and it's so – I can tell, and I like it – and you're gorgeous, and – yeah.\"</p>\n<p> </p>\n<p>\"You're shit with words,\" says Draco.</p>\n<p> </p>\n<p>\"Yeah,\" says Harry dejectedly, looking at the floor.</p>\n<p> </p>\n<p>He is surprised when Draco's feet come into his vision. \"Me, too,\" says Draco, and then they are kissing again, and Harry feels he's practically melting with relief.</p>\n<p> </p>\n<p>Draco is warm and firm and smells so wonderful, and his mouth is soft and slick, and Harry feels like he hasn't kissed anybody like this in a long time. He wants to touch everywhere at once – soft hair, narrow hips, back, shoulders, arse. He's snogging Draco Malfoy. Somewhere, in the past, his schoolboy self has no idea, and he's snogging <em>Draco Malfoy</em>.</p>\n<p> </p>\n<p>Harry doesn't know how long they're kissing, how long he's trying to touch all of Draco at the same time and through his clothes, before Draco murmurs, \"I think – we need – to find a surface.\"</p>\n<p> </p>\n<p>Harry realises with a tiny thrill that Draco's hard, and he can feel it through Draco's trousers, and he's just as hard himself. It'd be embarrassing, actually, how hard he is, especially because it's incredibly, unavoidably obvious when he's standing here in his pants, but – Draco is the same, and it's all right. <em>I really want him</em>, he realises. <em>I really, really do</em>. And apparently, Draco wants him back.</p>\n<p> </p>\n<p>\"What sort of surface were you thinking?\" says Harry, pressing his lips to Draco's jaw, Draco's neck. \"Wall?\" he suggests. \"Table? Bed?\"</p>\n<p> </p>\n<p>Draco laughs softly, and Harry feels it in his neck, his chest, and is filled with unexpected warmth.</p>\n<p> </p>\n<p>\"It's your house,\" he says. \"Maybe you should choose. You – \" His breath hitches as Harry sucks on the skin above his Adam's apple. \" – you – know all the best surfaces.\"</p>\n<p> </p>\n<p>Something about that little breath makes Harry think of the vulnerability in Draco's eyes before, when he mentioned Harry's earlier mistrust. It bothered Draco, that mistrust, and – this, and the rigidity of his posture when he turned up, and his earlier dismissal – which Harry realises he still hasn't really gotten an explanation for, though he thinks he can guess about it – are all hints of how vulnerable Draco is making himself in this moment, allowing Harry to do this.</p>\n<p> </p>\n<p>\"I think I know what I want to do,\" says Harry, struck with inspiration. Carefully, he backs Draco to the wall and hopes nobody decides to come back to his house any time soon before sinking to his knees. Draco inhales sharply. \"For you,\" Harry says softly, unbuttoning Draco's trousers, swallowing hard at the closeness of the bulge there to his face.</p>\n<p> </p>\n<p>\"For me,\" Draco says weakly.</p>\n<p> </p>\n<p>It's when Harry pushes Draco's pants out of the way and grips his cock that what he's doing seems to sink in. <em>I've actually got Draco Malfoy's cock in my hand</em>, he thinks weakly, and he wonders what himself-from-three-weeks-ago would say to that. Probably favorable things, really, if he's honest.</p>\n<p> </p>\n<p>Draco is staring at him with dark, lust-filled, disbelieving eyes. Harry smiles, and Draco can't seem to keep a returning smile from twitching onto his face. To Harry's surprise, he reaches out and runs his fingers through Harry's hair; it feels nice.</p>\n<p> </p>\n<p>\"You're so hard,\" Harry whispers, beginning to stroke his hand firmly along the long, hard flesh, and then he wonders why he whispered.</p>\n<p> </p>\n<p>\"Yeah,\" Draco whispers back. \"Do something about it, then.\"</p>\n<p> </p>\n<p>\"Aren't I doing something about it?\" Harry runs his thumb over the head, and Draco sighs softly at the touch and tries – and fails – to present him with a properly raised eyebrow. It is so endearing that Harry is filled with that soft warmth again, and he doesn't hesitate to take Draco into his mouth.</p>\n<p> </p>\n<p>Harry likes doing this. He's always liked the feeling of doing something for someone else, and he revels in the way Draco grips his hair and lets out long sighs and, a few times, pushes carefully further into Harry's mouth. Harry likes that last bit a lot, actually; he really doesn't mind having somebody else take control of things. He urges Draco to push further, humming around him and staring up at him and taking him deeper, and Draco says, very quietly, \"Fuck,\" before clutching Harry's hair tighter and moving his hips.</p>\n<p> </p>\n<p>After a while, Harry can't resist slipping his hand into his pants to stroke his own erection along with his increasingly wanton endeavor with Draco's. He can't stand it anymore, not with the salty weight of Draco on his tongue, and Draco's sighs and soft groans and tugs at his hair, and the wet sounds of his own mouth and throat working over Draco's cock. He's so fucking hard and already so close, and he doesn't bother being anything but frantic about it, tugging desperately at himself.</p>\n<p> </p>\n<p>\"Are you – \" Draco's eyes widen as he watches him, and he holds tight to Harry's hair. \"<em>Fuck</em>, Harry,\" he says, and he tenses, then shudders and comes.</p>\n<p> </p>\n<p>Harry feels his lips tugging into a smile after he works Draco through his orgasm and swallows, hand still working frantically in his pants.</p>\n<p> </p>\n<p>\"I can – \" Draco begins.</p>\n<p> </p>\n<p>\"Too late,\" Harry sighs, and he comes too, sticky over his fist, pressing his nose to Draco's hip and groaning softly.</p>\n<p> </p>\n<p>\"Fuck, Harry,\" Draco says again, his fingers still winding through Harry's hair. \"I could've helped.\"</p>\n<p> </p>\n<p>\"I don't mind,\" says Harry, and before he really thinks about it, drops a kiss on Draco's hip. \"I wanted – that.\"</p>\n<p> </p>\n<p>\"That,\" says Draco softly, deft fingers moving from Harry's hair to his jaw. \"You've got brilliant eyes,\" he says after a while, and Harry feels suddenly overwhelmed.</p>\n<p> </p>\n<p>It's dinner time by now, and they end up making big sandwiches and sitting together at Harry's kitchen table, and the whole thing is incredibly surreal. Harry has just given Draco Malfoy a blow job in his hallway, and is sitting rather close to him in his kitchen, eating a sandwich in his pants and mostly in silence like the whole day's been very casual.</p>\n<p> </p>\n<p>\"Well,\" Draco says finally, popping a last bit of bread crust into his mouth. \"I suppose this is happening.\"</p>\n<p> </p>\n<p>\"Yeah,\" says Harry, examining him carefully; his face is hard to read. \"I reckon it is.\"</p>\n<p> </p>\n<p>\"I think Teddy will be happy with us, anyway, if no one else is,\" says Draco, the corners of his lips quirking. Harry really likes his mouth; he wonders if Draco will return the favor soon, in regards to that blow job. He seemed pretty interested in doing so before.</p>\n<p> </p>\n<p>\"He is the one who forced us on a <em>date</em> in the first place,\" says Harry, tearing his eyes away from Draco's mouth.</p>\n<p> </p>\n<p>\"He is,\" says Draco. \"I probably ought to go back to him.\"</p>\n<p> </p>\n<p>\"Oh,\" says Harry, trying to conceal his disappointment. \"Right.\"</p>\n<p> </p>\n<p>Draco bites his lip. \"You could – come as well.\"</p>\n<p> </p>\n<p>Harry looks up at those anxious grey eyes and realises he'd really like that. He won't get a blow job out of it, with Teddy around, but he will get those eyes, and Draco's laugh, and Draco's smile, and Draco's smell. He realises he wants that, to talk to him, to laugh with him, to touch him in any way he can, even the little ways – to know him even better. There is something behind all that determination to complete that potion, all that stubbornness and secret vulnerability, that Harry wants. This feeling might not be Ron-and-Hermione-solid, but that sort of thing, he reckons, takes time; and this is certainly a start.</p>\n<p> </p>\n<p>They apparate to the manor together, after Harry finally puts his trousers back on, and find Teddy with Pansy and, surprisingly, Ginny in the parlor. Ginny is whispering something in Pansy's ear, making her laugh and look soft, something she, apparently, is capable of, too, and that's interesting.</p>\n<p> </p>\n<p>Teddy scrambles over to Harry and Draco as quickly as he can, hair turquoise again, brown eyes wide with anticipation. \"Did you speak to each other?\" he asks. \"You took ages.\"</p>\n<p> </p>\n<p>Harry hears one of the girls snort from the sofa.</p>\n<p> </p>\n<p>\"Yeah, we spoke to each other,\" says Harry.</p>\n<p> </p>\n<p>\"Well?\" Teddy demands.</p>\n<p> </p>\n<p>\"Well, what?\" Draco teases him.</p>\n<p> </p>\n<p>\"Do you admit that you fancy each other or <em>what</em>?\"</p>\n<p> </p>\n<p>Harry looks over at Draco, in his muggle clothes, with his fringe falling in his face and his back straight and his eyes surprisingly warm, and says, \"I reckon we do.\" </p>\n<p>  </p>"
}