{
  "id": "622042",
  "url": "https://archiveofourown.org/works/622042?view_full_work=true",
  "author": [
    "Mithen"
  ],
  "title": "Interview with a Batman",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "DCU - Comicverse"
  ],
  "relationships": [
    "Clark Kent/Bruce Wayne"
  ],
  "characters": [
    "Clark Kent",
    "Bruce Wayne"
  ],
  "additional_tags": [
    "Identity Porn",
    "Secret Identity",
    "Angst",
    "First Kiss"
  ],
  "language": "English",
  "series": "",
  "published": "2012-10-05",
  "completed": null,
  "words": "7,112",
  "chapters": "1/1",
  "comments": "386",
  "kudos": "15,361",
  "bookmarks": "2,116",
  "hits": "120,681",
  "summary": "<p>Batman offers Clark Kent a deal--an interview with him, in exchange for information about Superman.</p>",
  "notes": "",
  "text": "<p>The <i>Daily Planet</i> offices were mostly deserted, virtually everyone heading home for the evening. Clark Kent handed in his finished story and walked through the quiet bullpen toward the elevators. Lois Lane gave him a small wave and a smile as he left the offices, but no one else seemed to notice him.</p>\n<p>Which was just the way he liked it.</p>\n<p>Slipping into the elevator, he glanced both ways down the hall, then pressed the \"up\" button. He should probably go home to change, but lately he'd been working so late that he'd had to cut some corners.</p>\n<p>The great golden sphere that turned the building into a landmark cast its shadow across Clark. He looked up at the starlight reflecting off its burnished curve, the reflection of the city lights shining within it. He hooked his fingers into the knot of his tie and loosened it, his fingers moving to the top button of his shirt--</p>\n<p>\"Kent.\"</p>\n<p>He froze in place as a dark shadow detached itself from the surrounding gloom and dropped down before him. He hadn't seen him, hadn't even <i>heard</i> him. The figure stepped forward, the dark sweep of stylized ears framing the starry night, and Clark frowned. He'd wondered when he would meet the vigilante from Gotham, but he had always assumed it would be as Superman, not--</p>\n<p>Black-gloved fingers snapped in front of Clark's eyes, and he realized he was staring in silence. A sharp retort rose to his lips, but he bit it back: mild-mannered reporter Clark Kent would never snarl at Batman. \"You--you're that bat guy,\" he stammered instead. \"From Gotham.\"</p>\n<p>The corner of Batman's mouth twitched, but he said nothing else.</p>\n<p>\"What are you doing here?\" Clark quavered when it became clear the conversational ball was being left in his court.</p>\n<p>\"I should think that would be obvious.\" Batman's voice was low and rough, obviously disguised. He took a step forward; Clark fell back a step rather than look confrontational. \"You and Superman.\" Another step, another retreat by Clark. \"Don't try to deny it.\"</p>\n<p>This time when he moved forward, Clark's step away brought his back up against the brick wall of the stairwell. Batman's face was intent and predatory, and Clark felt a <i>frisson</i> of alarm go through him. Had he figured it out? \"I--that is--\"</p>\n<p>\"You meet him up here, don't you?\"</p>\n<p>Clark blinked. \"No!\"</p>\n<p>The denial, however true, didn't seem to satisfy Batman. \"Don't lie to me, Kent,\" he snarled. \"You and he are close. I can tell from your articles about him.\"</p>\n<p>\"What?\" Alarm sharpened his voice. He had dodged writing about Superman as much as possible, but sometimes it had been unavoidable, and one of his greatest fears was that he would be less than scrupulously fair writing about himself. \"But I never--I try so hard not to--\"</p>\n<p>This time the twitch at the corner of Batman's mouth was closer to a smirk. \"You don't give yourself away like Lane, no. No gushing, no hero worship. You're so completely dispassionate and balanced that you <i>must</i> be over-compensating for something. And I don't think it's hatred.\"</p>\n<p>\"I know him, sure. But it's a sheerly professional relationship.\"</p>\n<p>Batman reached out and snagged his loosened tie, letting the undone knot side down his fingers until it parted completely. \"Yes. You definitely look like you're here for a <i>professional meeting,</i>\" he said, holding the ends of the tie in each hand.</p>\n<p>Clark could hear his heart pounding, a mix of anger and something like fear. He hadn't shared his secret with Jimmy, with Lois, not even with Pete--he certainly wasn't going to tell some stranger in a mask. \"Just what the hell are you doing here?\" he blustered. \"Go back to Gotham.\"</p>\n<p>Batman tugged on the tie, reeling Clark in like a fish until they were almost nose to nose. \"I don't think so. I want information on your boyfriend.\"</p>\n<p>Clark would have laughed out loud if he hadn't been so close to Batman's face that he could feel his breath. \"My boyfriend?\"</p>\n<p>\"You're too worried. Whatever you feel for him, it goes deep.\"</p>\n<p>\"We're not--like that.\" He resisted the sudden urge to wrench away from Batman's grip.</p>\n<p>\"Maybe he doesn't reciprocate. But I think it's clear you feel more for him than for a mere friend.\"</p>\n<p>He was too close. Too close in more than one way. Clark sagged as if unable to maintain his <i>bravado</i> any longer. \"You're not here to hurt him, are you?\" he muttered, hating to submit, knowing that his apparent concern would confirm Batman's suspicions without having to actually lie. Let him think he'd ferreted out the truth.</p>\n<p>The cowl obscured most of the man's face, but Batman still managed to look surprised. \"I have no intention of hurting Superman.\"</p>\n<p>Clark felt thrown off again, and the confusion in his answer was genuine. \"Then why are you here harassing me? Looking for blackmail fodder? Hoping if you threaten me--\"</p>\n<p>Batman released Clark's tie and stepped back, shaking his head. \"No threats. Just a...proposition.\"</p>\n<p>\"A <i>proposition</i>?\"</p>\n<p>\"An exchange of information. You tell me about Superman. In return, I'll grant you an interview.\"</p>\n<p>Clark's eyebrows shot up involuntarily. \"An interview?\"</p>\n<p>\"You don't get any essential information,\" Batman said quickly. \"You don't get to find out who I am under the mask. But you get to talk with me. That alone would be quite a scoop.\"</p>\n<p>The understatement made Clark snort, even as his mind was racing. If he didn't say yes, Batman might go to Lois next, and who knew what Lois might say about Superman. This way he could control the information Batman received. And he would in turn learn what made this man in a bat suit tick, perhaps. If they ever had to work together someday, that could be valuable.</p>\n<p>Plus it <i>would</i> be the scoop of the century.</p>\n<p>\"Let's say I agree,\" he said slowly. \"What would I do?\"</p>\n<p>\"Come to Gotham. I'll meet with you for three nights. We talk for a few hours each night. Simple.\"</p>\n<p>Clark had a suspicion that nothing was \"simple\" with this man, but... \"Okay.\"</p>\n<p>He stuck out his hand, and after a moment Batman reached out and shook it.</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Clark looked at the slip of paper in his hand again. Yes, this was definitely the address. The doorknob of the aging brownstone rattled in his hand and threatened to fall off entirely; the whole building seemed similarly dilapidated. Dim bulbs flickered in the halls above stained and cigarette-burned rugs as he made his way in, and suspicion fluttered against his rib cage: was this all some kind of trap? Had Batman seen through his denials?</p>\n<p>The room number on his directions hung askew over a peephole in a door. Clark knocked, and after a moment the door swung open.</p>\n<p>Clark walked into a spotless room filled with shining metal equipment, glowing LED lights, and a bank of computer screens. Intersections, banks, bridges, and landmarks graced the screens.</p>\n<p>The door swung shut behind him with a pneumatic sigh and a rather ominous click, but Clark was walking forward to confront the man who swiveled to meet him, his fingers steepled.</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Bruce watched Kent on the monitors as he made his way through the crumbling corridors. The man looked nervous: probably wondering if Batman was going to use him as some kind of pawn or hostage against the Man of Steel. To be honest, it hadn't even occurred to Bruce that their relationship might be so close until he'd seen Kent on the roof, undoing his tie and looking up at the stars. He'd acted on a hunch, and Kent's reaction had confirmed that there was at least some strong emotion on the reporter's part. Batman frowned at the image of the man hesitating in front of his door, one hand outstretched toward the doorknob. Kent wasn't bad-looking, in a geek chic sort of way, but Bruce would have expected Superman to go for someone with a little more spark to them.</p>\n<p>When Kent didn't flinch or spin around as the door clicked shut behind him, however, Bruce began to wonder if maybe the man had more spine than he seemed at first sight.</p>\n<p>\"Mr. Kent,\" he said, standing.</p>\n<p>\"Nice place you've got here,\" Kent said.</p>\n<p>\"<i>Mi bolthole es su bolthole</i>. I've got a few scattered around Gotham--and if you are so unwise as to mention the location in your paper, this one will vanish within hours.\"</p>\n<p>\"I wouldn't dream of it.\" Kent's eyes met his in something not quite a glare, then he swallowed hard and dropped his gaze. Rummaging in a messenger bag, he extracted a notebook and a pen--a good pen, not just a flashy one, the kind of pen that someone who cared about their writing would use. \"So,\" he said, not meeting Batman's eyes. \"What's up with the bat theme?\"</p>\n<p>His studious carelessness almost startled a snort of laughter from Bruce. Almost. \"It doesn't work that way,\" he said instead. \"I ask you about Superman first.\"</p>\n<p>Kent's lips thinned, but he didn't argue. \"Okay.\"</p>\n<p>\"Look, why don't you sit down?\" Batman waved at another chair. \"You're here until midnight, you don't have to stand in the middle of the room like an interrogation victim.\"</p>\n<p>Kent looked around the room. \"No thumbscrews that I can see.\"</p>\n<p>Bruce had to choke down that traitorous laugh once more. \"I save them for special occasions.\"</p>\n<p>\"I assume you do have to use some kinds of... 'enhanced interrogation techniques' when dealing with criminals?\"</p>\n<p>\"Not as much as you might think,\" Batman said as Kent sat down in the offered chair. \"I've found if you scare people badly enough before asking questions, they're more likely to spill the information without resorting to coward's techniques like physical torture.\"</p>\n<p>\"Mmm?\" Kent's eyebrows went up. \"Some people would say that so-called torture is necessary to keep the streets safe.\"</p>\n<p>\"Well, I'm not one of them,\" Batman retorted. \"Torture generally yields poor intel. Pragmatics aside, I find it distasteful. I'm not saying I'm gentle with criminals, and I'm sure Superman would disapprove of my techniques at times, but cold-blooded torture is monstrous.\" He stopped the flow of angry words abruptly and glared at Kent. \"We're here to talk about Superman,\" he growled. The man had a gift for diversion.</p>\n<p>Kent's smile was offensively cherubic. \"But you're <i>so</i> much more interesting,\" he said.</p>\n<p>\"More interesting that a flying super-strong alien who shoots lasers out of his eyes? I sincerely doubt that.\"</p>\n<p>\"You'd be surprised,\" Kent muttered, looking down at his notebook, and Bruce made a mental note: friction between the two?</p>\n<p>\"Why is he here?\"</p>\n<p>Kent frowned. \"That's all on the public record, you can read Lane's interview--\"</p>\n<p>\"--Yes, yes, last son of a dying planet, desperate hope, rocketed to Earth.\" Batman waved a dismissive hand. \"What I mean is, why is he dressed up in spandex and running around helping people? He can crush coals into diamonds. Why isn't he a multimillionaire playboy, accepting tribute from all and sundry?\"</p>\n<p>An amused look. \"You mean why isn't he Bruce Wayne?\" Kent chuckled. \"Maybe he is. Maybe he's taken on the persona of a wealthy dilettante as a cover for the fact that he's actually trying to make the world a better place.\"</p>\n<p>\"I sincerely doubt Superman is Bruce Wayne,\" Batman said with some asperity.</p>\n<p>The chuckle became an actual laugh. \"That would be a trick.\"</p>\n<p>\"But I am curious how he spends his non-Superman time. And if he came here as a baby, where he grew up.\"</p>\n<p>The smile disappeared. \"Lane described his Fortress in the article. I've been there. Trust me, a baby could grow to manhood there with all his needs met.\"</p>\n<p>\"Except the need for social interaction,\" Batman countered. \"There's no way an alien baby growing up alone at the North Pole becomes the kind of person who really cares about human beings, who wants to help them.\"</p>\n<p>\"You can tell Superman really cares about human beings?\"</p>\n<p>Batman made an impatient gesture. \"That's obvious.\"</p>\n<p>Kent tilted his head, seeming somehow pleased. \"Then that's the answer to why he does what he does.\"</p>\n<p>Bruce growled to himself. This line of questioning wasn't getting him anywhere. Or maybe-</p>\n<p>\"You said you'd been to his Fortress. You and he are clearly quite intimate.\" Lane had said he was polite but distant. Bruce wondered if he was so distant about this man. \"Do you know where he grew up?\" He looked at Kent's eyes, reading him. \"Did you know him before he was Superman?\"</p>\n<p>He saw the hit go home; Kent's eyes flickered. After a moment, he said, \"Yes. I've known him longer than he's been Superman.\" His gaze flashed up to meet Batman's. \"But I'm not telling you where or how we met. Only that I've known him a while, and yes, as more than a superhero.\"</p>\n<p>\"So you know him as a man?\" Batman put just enough stress on \"know\" that it sounded suggestive.</p>\n<p>\"I said we're not like that,\" Kent said.</p>\n<p>Batman stood up, walked over to the chair where Kent sat, and put his hands on the arms, leaning over him. \"But did you think there was a possibility you could be 'like that'? Do you know something about him--that he prefers men to women, perhaps?\" Kent was staring up at him, eyes wide. \"Is the Man of Steel perhaps--\"</p>\n<p>Kent stood up abruptly, knocking Batman's arms away and coming up face to face with him. \"If he were gay, don't think you could use that to blackmail him!\" he gritted. \"It's nothing to be ashamed of--he wouldn't deny it, and it wouldn't stop him from helping people. So you can just--\"</p>\n<p>This time Bruce couldn't help it, he did laugh. The image of Kent's face, flushed with righteous rage on behalf of Superman, was too delicious. \"As it so happens, I'd be quite the hypocrite if I tried to blackmail him for that.\"</p>\n<p>He probably shouldn't have said anything--he regretted his words a moment later--but the bewilderment on Kent's face more than made up for any chagrin. Kent sank back down into his chair, frowning. For a long moment, neither of them said anything. Then Kent looked up at him with an unexpected twinkle in his eye. \"Are you thinking about dating Superman?\"</p>\n<p>Batman sputtered. \"He's--not my type,\" he finally said.</p>\n<p>\"Oh,\" said Kent, looking pensive for a moment as Bruce tried to get his head around the man setting himself up as some kind of matchmaker to superheroes. \"And...what <i>is</i> your type?\"</p>\n<p>Batman shook his head firmly. \"Remember the deal. We're focusing on Superman,\" he said. \"Not me.\"</p>\n<p>\"For now,\" Kent shot back.</p>\n<p>Batman took a deep breath. If Kent was this unpredictable all the time, he was beginning to imagine he might keep even Superman on his toes. \"You can ask me questions tomorrow,\" he said. \"Let's get back to Superman.\"</p>\n<p>But as it turned out, Kent was maddeningly vague on the topic of the Man of Steel. He was happy to talk about what Superman had told him about Krypton, or to describe the Fortress in detail, but when he talked about the actual man his descriptions lapsed into generalities without any spark. If Kent were to be believed, he was a nice guy who liked to help people, and there wasn't much else to report. Bruce had seen this kind of bland personality in his life, but never attached to an alien who could fly.</p>\n<p>When midnight rolled around, Batman had a lot of information about the things Superman surrounded himself with, and the places he'd come from, but very little of the man himself.</p>\n<p>Eventually, Kent glanced at his wristwatch and said \"Looks like my carriage is going to turn into a pumpkin, huh? Unless you'd like to talk longer.\"</p>\n<p>The thought was surprisingly tempting, if only to try and pry more information out the man, but Batman shook his head. \"I have to go on patrol. We can continue tomorrow.\"</p>\n<p>\"I wouldn't miss it for the world,\" said Kent, standing and holding out his hand. \"Same bat-time, same bat-place?\"</p>\n<p>Batman snorted as he shook his hand. \"Yes.\"</p>\n<p>\"And no dodging my questions tomorrow night.\"</p>\n<p>\"The third night it's back to Superman,\" Batman warned. \"This isn't an equal exchange.\"</p>\n<p>Kent's smile was crooked. \"I'm unlikely to forget that,\" he said.</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Clark spent the next day placating Perry with promises of a huge scoop, staring out his hotel room at the Gotham skyline, and thinking about last night's conversation. With only a few emergencies calling for his attention through the day, he had a lot of time to puzzle over the mystery of the Batman. He'd gone into the room expecting a harsh, confrontational cross-examination, and instead he'd found himself...enjoying himself. The man had a sense of humor as well as a sense of ethics.</p>\n<p>He also, Clark was forced to admit, had an extremely sensual mouth and a voice that could do strange things to one's internal organs.</p>\n<p>If one were attracted to that sort of man.</p>\n<p>He found himself arriving at the run-down brownstone a half hour early and forced himself to sit down on the doorstep and wait for at least twenty minutes before going inside. Batman's bolthole looked much the same as it had the night before--sleek and modern, monitors lining the walls that showed different Gotham landmarks--but there was a table now, with two mugs on it.</p>\n<p>\"I thought you might like something to drink,\" Batman's low growl said.</p>\n<p>Cream and sugar, just the way he liked it. Clark raised an eyebrow at Batman as he took a sip and Batman looked as innocent as a man dressed in black leather and a pointy-eared cowl could. Which wasn't terribly innocent, but was alarmingly attractive.</p>\n<p>Clark sat down at the table and took out his notebook and pen once more. \"Okay, I get to talk about you this time.\"</p>\n<p>\"Agreed. But I have the right to refuse--\"</p>\n<p>\"--To answer any question, yes, of course.\" Clark made a little doodle in the corner of the notebook. \"So...what's up with the bats?\"</p>\n<p>Batman sat down as well. \"I was frightened by bats when I was a child. They're elusive, unpredictable, obscurely threatening without being some kind of testosterone fantasy of a predator. I thought they would serve my purpose well.\"</p>\n<p>\"And that purpose was...?\"</p>\n<p>Batman frowned. \"To make Gotham safer, of course.\"</p>\n<p>\"I've heard people say you're just a guy who likes to beat people up and you've found a way to do it without getting locked up.\"</p>\n<p>A low growl. \"Did you get that from Superman?\"</p>\n<p>\"No, no!\" Clark held his hands up. \"Superman hasn't said anything of the sort to me. He has nothing but respect for you.\"</p>\n<p>\"Really?\" Clark had the impression Batman was surprised, and once again he had to resist the temptation to peek beneath the mask. He had come last night planning to, but soon had decided it wouldn't be fair, taking advantage of the fact Batman didn't know he was Superman.</p>\n<p>\"Well, from what he knows of you, you seem to have similar goals to his. It's just...you have to go about achieving them in a different way.\"</p>\n<p>Batman made a neutral sound.</p>\n<p>Clark gestured at the utility belt. \"So...did you make all these gadgets yourself?\"</p>\n<p>\"I designed most of them. Put them together from material ordered in bulk, untraceable.\"</p>\n<p>\"Seriously? You make all of those little...bat-dart things?\"</p>\n<p>\"Batarangs,\" Batman corrected with a straight face. He took one out of his belt and slid it across the table to Clark. \"And yes. What,\" he said, looking at Clark's face, \"Did you think that I had an assembly line of people helping me out?\"</p>\n<p>The batarang was heavy and delicate in Clark's hands, perfectly balanced. \"It seemed a lot to pull off on your own.\"</p>\n<p>\"I'm a solo act,\" Batman said, and Clark's ears pricked up at some indefinable undertone in his voice: worry? Defensiveness? He made a mental note and put it aside--for now.</p>\n<p>\"Okay, let's give the newspaper readers something to impress them: how many languages do you speak?\"</p>\n<p>\"I'm not giving specifics, obviously, but it can't hurt for criminals to know I speak Mandarin, Spanish, Punjabi, Cantonese, Hausa, Ukrainian, Dutch, Kazakh, Czech, and Xhosa with some degree of fluency. Plus a few more that I believe I shall keep to myself,\" he added with a wolfish grin.</p>\n<p>&lt; That's a little hard to believe, &gt; Clark muttered in Xhosa.</p>\n<p>The grin sharpened further. &lt; No harder to believe than a newspaper reporter speaking it. &gt;</p>\n<p>Clark shook his head with a rueful smile and switched back to English. \"I traveled in Africa a fair amount after high school, and I'm lucky enough to pick up languages easily.\" He took a sip of coffee. \"So...you say you're a solo act. Isn't there anyone you trust with your secret? Friends, parents?\"</p>\n<p>The smile vanished and Batman opened his mouth, but before he could say anything an insistent klaxon sounded and a red light flashed on the bank of monitors. Batman leapt to his feet, taking in the sight of a man in some kind of suit with jet packs, spouting flame at shrieking bystanders outside a nightclub. \"Firefly,\" he muttered. \"Have to deal with this,\" he said to Clark. He pointed at him. \"Stay here. I'll come back.\"</p>\n<p>The door closed behind him, and Clark peered at the monitors. The scene was unfolding just around the corner, he realized.</p>\n<p>Luckily Batman hadn't thought to lock him in, he thought as he slipped out of the brownstone and began to run toward the flickering flames down the block.</p>\n<p>He didn't want to change costumes--for starters, it would reveal he had a suspiciously instantaneous means of communication with Superman. It also seemed to show a lack of faith in Batman, who, it was clear from the moment Clark arrived, had the conflict well in hand. Firefly was already on the ground, struggling but outmaneuvered. The greater danger to civilians seemed to be the risk of being trampled in the panic to get away. Clark scooped up a child who had fallen down and returned her to her parents, then grabbed a couple of people who were running aimlessly, their eyes wild. \"Help me get him out of there!\" he yelled, gesturing to a man trapped in a car Firefly's jets had overturned. Soon he had a small group of people helping him restore order and direct traffic away from the area.</p>\n<p>He was picking up a piece of rubble when something slammed into him and he found himself being hoisted through the air.</p>\n<p>Going limp, he waited until he was dumped on the roof of a nearby building, looking up to see Batman standing over him with his fists clenched and shoulders hunched. \"I told you to <i>stay in the bolthole</i>,\" Batman snarled.</p>\n<p>Clark started to stand, dusting off his pants. \"I didn't interfere, I couldn't just--\"</p>\n<p>\"--You stupidly put yourself at risk,\" Batman said, jabbing a furious finger at his chest. \"I don't need well-meaning civilians getting involved and trying to be heroes and maybe <i>getting themselves killed</i> because of me, because I was some kind of god damned <i>inspiration</i> to them, I am not willing to accept that responsibility!\"</p>\n<p>He stopped speaking abruptly, his mouth snapping closed, and the two of them glared at each other in silence. The air smelled of smoke, and the sound of distant sirens drew ever nearer.</p>\n<p>\"What is it?\" said Clark, looking steadily at him. \"Tell me about it.\"</p>\n<p>Batman's shoulders sagged and he turned away, looking out at the city. He took a deep breath, then another. \"There's this...kid,\" he said at last. \"He says he wants to help me. He's <i>inspired</i> by me.\" He spat the word like a curse. \"I never...I never wanted to inspire anyone to this kind of life, this kind of risk. But this kid. He burns for it. To do good.\" He looked down at his hands, then up at Clark. \"He's just a kid,\" he said hoarsely.</p>\n<p>\"You're afraid he'll get hurt?\"</p>\n<p>Batman stared. \"Of course he'll get hurt, Kent!\" He waved a vehement hand at the smoke rising from the street. \"There are people with flamethrowers out there, people with poison gas and--and guns!\"</p>\n<p>\"If you say no, will he give up?\"</p>\n<p>Batman scrubbed at his jaw. \"Not this kid.\"</p>\n<p>Clark looked around, found a sagging chair someone had abandoned on the roof, and sat down. \"Tell me more about him.\"</p>\n<p>It was like a floodgate had opened, fears and frustrations spilling into words as Batman paced back and forth on the roof. He talked about the kid--vaguely enough that Clark didn't have much to go on, but certainly a young man who had suffered a recent tragedy, something that affected Batman strongly. From there he talked about himself, his travels and training, the years of preparation. There were hints of more as well: some older man whose opinion Batman cared about deeply, some painful past that drove him onward into the dark. Clark asked a few questions, but mostly let him talk.</p>\n<p>He didn't take notes, and he didn't try to commit the facts to memory. He just listened.</p>\n<p>Batman was talking about the Himalayas, the cold and isolation of them: \"But beautiful too, how they lift up into the infinite blue like hope itself, shining--\"</p>\n<p>Far off, a deep tower bell started chiming, and Batman fell silent. When it reached twelve, he shook his head, a wry smile on his face.</p>\n<p>\"I've probably said too much,\" he murmured.</p>\n<p>\"I won't use anything you've said here,\" Clark said.</p>\n<p>Batman snorted. \"I'll believe that when I see it.\"</p>\n<p>\"You will.\"</p>\n<p>Clark stood up and looked out at the skyline. The sirens were long gone, the night quiet. \"I guess I'd better get down off of here and--hey!\" he yelped as Batman scooped him up into a bridal carry. \"Put--put me down!\"</p>\n<p>\"You're not <i>that</i> heavy,\" Batman said, amused, as Clark thanked Rao that his strength didn't come from muscle mass. His arm shifted against Clark's back, preparing a grapple. \"Come on, put your arms around my neck.\"</p>\n<p>The skyline was a dizzy whirl of darkness and light melded together. Clark took a breath, feeling Batman's solid human strength against him. He wanted to lean into it, rest against its indomitable frail power. He wanted to snatch Batman into the air like thundering Jove with a leather-clad Ganymede, wrestle across the sky with him in a wild dance. He wanted--</p>\n<p>\"Don't be afraid,\" Batman murmured, stepping forward.</p>\n<p>\"I'm not,\" Clark lied.</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Batman looked at the chronometers one more time. They all resolutely agreed that Kent was ten minutes late. Annoying. He drummed his fingers on the table. Probably off writing his story about all the things Bruce had let spill last night. He'd gone back over the evening meticulously and was fairly certain that he had let slip no fact that could trace Batman back to Bruce Wayne, but it was still...unnerving, how much he had said.</p>\n<p>It was even more unnerving how much more he wished he had been able to say.</p>\n<p>When Kent appeared within range of the cameras outside, Batman jumped to his feet, then forced himself to sit back down. Ridiculous. But by the time Kent was in the bolthole, he was sitting down again, his eyes on the monitors rather than the door. \"Don't get comfortable,\" he said as Kent started to speak.</p>\n<p>Kent closed his mouth. \"That's pretty unlikely,\" he muttered.</p>\n<p>\"I just mean we're not staying here.\" Batman stood up and pressed a button; a door slid open in the wall to reveal an elevator.</p>\n<p>Shooting Batman a dubious look, Kent went into the elevator with him and watched as he hit the \"down\" button. He let out a low whistle as the doors opened into a basement garage, sharp fluorescent lights snapping on to reveal the sleek streamlined profile crouched in the center.</p>\n<p>The doors of the car swung open as they approached with a sinuous hiss. Kent looked at Batman. \"You're kidding. I get to go in your car?\"</p>\n<p>\"You've proven yourself unable to stay out of my way,\" Batman retorted. \"So I'm not going to try tonight.\"</p>\n<p>Kent stroked the black leather seat with a reverent hand before settling in, his head swiveling to take in all of the lights and gadgets. \"This is amazing,\" he breathed.</p>\n<p>Batman started the car. There was, he conceded, no practical reason to rev the engine as they left the garage by the hidden exit.</p>\n<p>However, it made Kent grin gleefully.</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Kent deftly snagged a potsticker from the take-out carton. \"--and I ran around with a lightsaber made out of a cardboard tube all summer. My mother was relieved when it finally fell apart,\" he added with a chuckle, popping it into his mouth.</p>\n<p>\"Don't get any duck sauce on the upholstery,\" Batman grumbled, picking out a piece of orange chicken from his own carton.</p>\n<p>\"I'm guessing you don't do take-out in the Batmobile very often?\"</p>\n<p>\"I don't usually have someone to go in and pick up my order for me without attracting too much attention.\" Batman wasn't sure exactly how they'd ended up ordering Chinese food, but he also wasn't sure how the evening's conversation had ended up being entirely about Kent instead of about Superman. Instead of digging for information about the Man of Steel, Batman had ended up hearing stories about growing up on a farm, about high school, about travels in Africa and Europe, and life in Metropolis. Not a word about Superman.</p>\n<p>Bruce had to admit that Clark Kent seemed much more interesting.</p>\n<p>Clark snorted as another pedestrian did a double-take and gave the car a wide berth. \"You don't exactly blend in.\"</p>\n<p>\"It's okay, the windows are opaque from the outside,\" Batman said. \"No one's going to see Batman hanging out and eating orange chicken.\"</p>\n<p>\"No one can see us?\" Clark peered out at the dubious pedestrian and waved, garnering no response. \"Hey, that's cool.\"</p>\n<p>\"Great for dates,\" Batman said. Clark blinked at him. \"You know, in case we wanted to make out.\"</p>\n<p>He'd meant it as a joke--hadn't he?--but was taken aback when Clark looked down at the dashboard. \"Oh. In--in case,\" he stammered.</p>\n<p>\"You're really not involved with Superman?\" Batman heard himself ask.</p>\n<p>\"I'm--not seeing anyone,\" Clark said.</p>\n<p>Batman pondered for a moment. <i>Stop right there,</i> a part of his mind muttered. <i>Don't be ridiculous.</i> He sneaked a quick look at Clark's profile. Was he <i>blushing</i>? Impossible. <i>Just let it drop.</i></p>\n<p>\"So he wouldn't come pounding on the windshield if I kissed you?\"</p>\n<p>Clark looked up at him. \"No,\" he said. There was a challenging, belligerent tilt to his chin--<i>put up or shut up</i>--that contrasted with the shyness in his eyes to create a whole that was completely irresistible.</p>\n<p>So Batman gave up resisting.</p>\n<p>He'd expected a tentative response, and was surprised once more--was there no end to this man's surprises?--to find Clark meeting the kiss with fervor and confidence. The car's seats were not exactly created with make-up sessions in mind, and the gap between them seemed almost unbridgeable, but they did their very best. After some energetic grappling, Bruce found himself nearly draped on top of Clark, with the stickshift digging into his thigh and--oh, that wasn't the stickshift. He did some quick reconnaissance with the hand that wasn't tangled in Kent's hair and was rewarded with a throaty groan.</p>\n<p>\"I think I might have gotten some duck sauce on your seat,\" Clark gasped, and Bruce couldn't help it, he started to laugh, leaning his head against Clark's chest.</p>\n<p>Clark bit his ear--the cowl's, that is--and gave him a gentle, terrier-like shake. \"Don't laugh when I'm trying to seduce you,\" he mumbled around the ear.</p>\n<p>\"I thought I was trying to seduce you,\" Bruce said, extricating himself.</p>\n<p>\"I've been trying longer than you have.\"</p>\n<p>\"I sincerely doubt that.\"</p>\n<p>Clark's chuckle turned into a sigh. \"I don't want--I think we'd better stop,\" he said. \"It's not that I'm not interested, believe me,\" he added hastily. \"It's just the opposite. I just...there are too many secrets between us right now.\"</p>\n<p>Batman drew a deep breath, sitting back up. Clark opened his mouth, but he held up a hand to cut him off. \"You're right,\" he said. It was crazy. The man was a reporter, for God's sake, he could be out for the scoop of the <i>millennium.</i> But impossibly, every instinct Bruce had was telling him Clark Kent could be trusted. Before he could begin to second-guess his instincts, he started the car and threw it into gear.</p>\n<p>\"Where are we going?\" said Clark.</p>\n<p>\"I want to show you where Batman was born,\" Bruce said. \"No more secrets.\"</p>\n<p>\"Okay,\" murmured Clark as the car slid down the Gotham streets. \"No more secrets.\"</p>\n<p>\n<b>: : :</b>\n</p>\n<p>Clark felt like he was still trying to get his breath as they drove into the heart of the city. The gargoyles on the buildings leered down at him as if mocking his agitation. How had he ended up kissing and groping Batman in the front seat of his car like a horny teenager? All of his reserve had been swept away in an instant, and it was only remembering that he still had his costume on under his suit that had prevented him from moving right into eager clothing removal. <i>Too many secrets</i>--he had blurted it out in his chagrin, and Batman had taken it as meant for him. Was he truly going to tell Clark who he truly was? It seemed incredible--and yet Clark found himself almost believing it, somehow.</p>\n<p>They turned a corner into an alley, the buildings on either side of them seeming to squeeze together, constricting. The car purred to a stop and the doors hissed open once more. \"Here,\" Batman said, his voice low.</p>\n<p>\"Wait, you were born here?\" Clark peered out of the car at the dingy alley. At the far end, an empty movie theater with a battered marquee sat in a pool of light, but the alley itself was dark. Batman didn't respond, just climbed out of the car and began to walk deeper into the alley.</p>\n<p>Something skittered in the darkness as they walked across cobblestones half-covered with a desultory layer of tar. There was a stillness to Batman that Clark hadn't felt before, a sort of hush to his movements. He stopped halfway down the alley and took a deep breath. \"Clark, this is where--\"</p>\n<p>It happened so quickly.</p>\n<p>A clatter of heels on cobblestones, and a woman came around the corner into the alley running full-tilt. Two men charged after her. When they spotted Batman, their predatory snarls gave way to wide-eyed shock, and they staggered backwards.</p>\n<p>Clark heard a small sound from Batman, something halfway between a laugh and a snarl, and then he was moving forward like liquid night.</p>\n<p>Clark looked around for the woman, found her fallen to her knees on the stones. \"Let me help,\" he murmured, lifting her up, supporting her as she limped toward the other end of the alley--</p>\n<p>A third man stepped into the alley from the other side. \"Thought I didn't know how to head you off, eh?\" he snarled. \"Now hand over the purse.\"</p>\n<p>Dim lamplight glinted on the barrel of a gun.</p>\n<p>Behind him, Clark could hear sounds of a fight: apparently the first two muggers had summoned enough courage to take a couple of swipes at Batman. A quick glance at the gun confirmed there were only two bullets left in it. The fight would be over soon and Batman would have no problem dealing with this guy. He just needed to buy Batman some time. Just a little time.</p>\n<p>He put the shivering woman behind him, got between her and the leveled gun. \"No one needs to get hurt here.\"</p>\n<p>The sounds of fighting behind Clark were becoming distinctly one-sided; the man glanced over his shoulder and his eyes widened. \"\"Back off, man!\" he barked at Clark.</p>\n<p>\"Let's all just stay calm and--\"</p>\n<p>There was a clatter as someone was thrown into a pile of trash cans and the thug flinched. Clark saw his finger tighten on the trigger, heard (with preternatural clarity, slow and distinct) the click.</p>\n<p>One gunshot, then another, rang through the alley.</p>\n<p>He felt the impact of the two bullets against his chest, like ping-pong balls. Years of training made it possible for him to jerk back as if hit, crumpling on his side to the ground.</p>\n<p>The woman's gasp was drowned out by a cry from the far end of the alley, full of rage and terror. It must be one of the hapless thugs--but no, a quick listen indicated both were already unconscious. Lying with his eyes closed, Clark heard boots on stone, and then a another shriek--this one of mortal fear from the gun-wielding mook, followed by the emphatic <i>thud</i> of a fist striking someone's head.</p>\n<p>Clark heard the third crook slump to the ground, heard Batman's raw-edged breathing echo through the alley. \"Go,\" rasped a thick, ragged voice, and a set of high heels begin to click on the pavement, slow at first, then faster, breaking into a limping run. As they faded away, Clark was about to open his eyes, to tell Batman he was all right, when he heard someone fall to their knees next to him, felt strong hands pull him over onto his back.</p>\n<p><i>\"Clark,\"</i> Batman said, his voice tight and oddly young. \"Oh, Clark. No.\"</p>\n<p>As Clark opened his eyes to reassure him, Batman yanked open his suit jacket with urgent hands. Fabric tore, buttons springing free to hit the cobblestones, eerily distinct: <i>ting. Ting ting. Ting.</i></p>\n<p>Batman made an inarticulate noise, a sound strangling between a howl and a sob, and tore Clark's shirt open.</p>\n<p>The first thing Clark saw on opening his eyes was Batman hunched over him, his eyes fixed on the golden shield revealed on his chest. His shoulders were knotted, his hands clenched into fists clutching the edges of Clark's shirt. He was completely immobile, every atom of his attention riveted with furious intensity at the bloodless cloth, the inviolate gleam of gold..</p>\n<p>Then he drew a sharp, sobbing breath, a whipcrack of sound, and bent his head to Clark's chest, his shoulders shaking.</p>\n<p>\"I'm sorry,\" whispered Clark, and Batman flinched, gripping his shirt harder. Tentatively, Clark reached up and touched his shoulder. \"I was going to tell you. Tonight. I swear. I'm--\"</p>\n<p>A rough hand clapped over his mouth. \"Shut up,\" rasped Batman, not looking up.</p>\n<p>\"I'm sorry,\" Clark mumbled against leather that tasted of sweat and blood.</p>\n<p>Batman's shoulder was still trembling, but when he looked up at Clark his face was calm. \"You're alive. Don't apologize for being alive. I'm--God, when I saw you fall--\"</p>\n<p>This time the kiss had nothing of the horny teenager about it: it was gentle, awed, a benediction of breath. Even the shadows of the alley seemed to still, watching.</p>\n<p>After a timeless time, Batman chuckled against Clark's mouth. \"Much as I would love to continue, I'm not sure those thugs would appreciate waking up to this sight.\"</p>\n<p>Clark stood up as Batman went to slip restraints on the three unconscious bodies, vainly trying to pull the ruins of his shirt over his costume. His task complete, Batman returned to stand before Clark, slipping a hand through the torn cotton, his fingers caressing alien cloth.</p>\n<p>\"Here,\" said Clark, handing him two crumpled bits of metal. \"I caught them so they wouldn't ricochet.\"</p>\n<p>Batman looked at the two spent bullets in the palm of his hand, his face expressionless. Then he closed his fingers over them almost tenderly. \"Thank you,\" he said, putting them into a pocket in his utility belt and clicking it shut. \"Let's go.\"</p>\n<p>\"Where are we going?\" Clark said, following Batman as he swept back toward the mouth of the alley.</p>\n<p>\"I owe you a new shirt,\" Batman said. \"I'll take you home and loan you one of mine.\"</p>\n<p>\"Take--take me home?\"</p>\n<p>Batman stopped at the car, looking at Clark over the hood. \"Do you promise not to mention any of this in your article about me?\" His voice was stern, but Clark was beginning to be able to discern the glint of humor under the steel.</p>\n<p>\"It depends,\" he answered, getting into the car. \"On just how big a scoop it is.\"</p>\n<p>\"Oh,\" said Batman, \"I think I can give you a pretty big scoop.\"</p>\n<p>\n<b>: : :</b>\n</p>\n<p>\"Are you <i>kidding</i> me?\" Lois Lane brandished the newspaper in front of Clark Kent. \"You--you made this up.\"</p>\n<p>\"Actually, I got it straight from the bat's mouth,\" said Clark.</p>\n<p>Lois threw the paper down on the desk. \"Batman told you that he and Superman are <i>dating</i>?\"</p>\n<p>\"Actually, Miss Lane, I believe he said that--\" Jimmy Olsen cleared his throat and read out loud, \"<i>According to Batman, he and Superman are lovers, and he's the luckiest man on Earth.</i>\"</p>\n<p>Clark tried not to look embarrassed: Bruce had insisted on that exact wording. It had been around four in the morning and they were both pleasantly exhausted and he had thought it best not to argue. \"It's a little grammatically ambiguous,\" he muttered. \"It could probably mean Superman's the lucky one and not him, actually.\"</p>\n<p>\"As if,\" snorted Jimmy.</p>\n<p>\"Did you corroborate this crazy assertion with Superman?\" Lois demanded.</p>\n<p>Clark took a deep breath. \"Actually, I did,\" he said. \"And Superman confirmed that he is very much in love with Batman.\" His heart was pounding as if he'd made a momentous confession, but Lois and Jimmy took no heed of him, turning back to the article with exclamations of surprise.</p>\n<p>The elevator doors opened and Clark could hear Perry White's voice: \"--introduce you right now. Ah, there he is, Clark Kent. He's the one who wrote the story.\" He pointed at Clark. \"Kent, this man liked your story about Batman and has come from Gotham to speak to you about it.\"</p>\n<p>Clark looked up into the smiling face of Bruce Wayne. \"Delighted to make your acquaintance, Mr. Kent. Perhaps we can talk over lunch?\" said Bruce, holding out his hand. \"Or maybe drinks?\"</p>\n<p>Clark took his hand, his fingers brushing against callouses hidden by manicured skin. \"It would be my pleasure,\" he said.</p>"
}