{
  "id": "624143",
  "url": "https://archiveofourown.org/works/624143?view_full_work=true",
  "author": [
    "afullrevolution"
  ],
  "title": "Your Mark on my Skin",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale"
  ],
  "additional_tags": [
    "Original Character(s)",
    "Alternate Universe - College/University",
    "Slow Build",
    "Soulmates",
    "Marks",
    "OFC - Freeform",
    "Oblivious Derek",
    "Werewolves",
    "no!fire",
    "Derek!POV"
  ],
  "language": "English",
  "series": "",
  "published": "2013-01-04",
  "completed": null,
  "words": "5,551",
  "chapters": "1/1",
  "comments": "217",
  "kudos": "17,881",
  "bookmarks": "2,653",
  "hits": "250,651",
  "summary": "<p>Everyone had a mark scrawled somewhere across their body. A name, usually a signature to represent their soul mate, their one and only true love. Stiles has known who his mark belonged to since the third grade. He doesn't understand how Derek can be so oblivious.</p>",
  "notes": "<p>Rating for language. Not beta read.<br>Minor grammatical fixes.</p>\n<p> </p>\n<p>Because ideas build on each other, this started developing out of something else at the same time as \"Once Upon a Dream\" and has (what I see as) a lot of overlap. Thought that I would get it off my desktop. Seriously. I write these things in the notes function between to do lists and ideas for dinner. </p>\n<p>But - more importantly - thanks to whoever wrote the fic I read months ago about personal marks. I can't remember who wrote it, but the idea stuck with me.<br>I have been informed - and correctly at that! - that the story I was looking for is hoars' \"My Name Over Your Heart\". I put into the association.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Schlager is a type of German music that is ... sparkly and sort of like a weird mix of (middle aged) people singing a cross between pop and country. Really, you just have to listen.</p>",
  "text": "<p>Everyone had a mark scrawled somewhere across their body. In different places for different people, but the mark of the person right for them. A name, usually, a signature to represent their soul mate, their one and only true love.</p>\n<p>Whatever it was, the name appeared when the person was born, kept track of their health. If the skin under the name dried, flaked away like a rash and healed blank, then you knew to stop looking. Psychologists specialized in helping those unlucky individuals deal with the trauma of having never even met their other. Love after loss was a popular theme in the dozens of movies about moving on after the one for you was gone.</p>\n<p>Derek's mark appeared on his left clavicle when he was four. He had spent hours poking at it, wondering who it matched. He spent days worrying if his person was being properly taken care of. If he was being sung to at night. At eight weeks, he wanted to know if they were being taught to howl. His mother thought not, thought that the signature looked human. Probably American from how the 'g' was shaped. But his mum promised that they would keep their eyes out, keep looking, and swore to the worried Derek that they would offer the person the bite if he was human. </p>\n<p>Derek had stretched the collars of half of his shirts to stare at the name before the fascination began to pale. Although, like so many others, he developed a nervous habit of rubbing his thumb across the name whenever he was worried. For safety, for luck. </p>\n<p>-----</p>\n<p>The first time Derek met Stiles, he was twelve. Sixth grade, almost in middle school, almost grown up if you were to ask him about it. Certainly big enough and – more importantly – in control enough to walk his younger sister Dani (three years younger, in fourth grade due to the dates of their births and still with tenuous control) home by themselves.</p>\n<p>On the second Wednesday after the school year started, Stiles was standing with his sister in front of the school. The two tiny (in Derek’s grown-up opinion) children had that awkward stance of two people who weren't quite sure what to say to one another. Derek had nodded curtly and motioned Dani to leave. He hadn't known what to say either and Dani hadn't introduced them. Just told Stiles goodbye and demanded Derek \"come on already\", Backpack sweeping precariously close to the ground as she swung it. She was such a child.</p>\n<p>Stiles stared after them as they had walked away, as Dani regaled Derek with an assessment of just how loud and weird Stiles was. Evidently he was her partner in a science experiment. Which was ok she figured. According to her, Stiles said strange things, but got good grades. </p>\n<p>Derek didn't really care about it one way or another. Put up with or ignored most of her rabbling monologue while he tried to stand straight and look responsibly controlled.</p>\n<p>------</p>\n<p>Without being concerned one way or another, Derek would surreptitiously begin to become acquainted with Stiles and his many weirdnesses. The staring that had so marked their first encounter would prove to be one of Stiles’ more enduring personality quirks. But Derek continued not to particularly care all through middle school and into high school. Dani started as a freshman when he was a junior and Derek was given firm instructions by both Laura and his mother to keep an eye on that girl. She was trouble through and through. Derek agreed. He'd lost too many things - books, cds, clothes - to her rampaging ways to do anything but agree.</p>\n<p>For all the warnings about Dani, what Derek hadn't reckoned on was that Dani's arrival at the school would bring Stiles. A Stiles that he now saw everywhere. Stiles, who seemed to have developed a gift for teleportation. He began to appear constantly and suddenly at Derek’s elbow at any and very odd moments. Although never when he was with that friend, the asthmatic one with the sweet smile. But even when the friend (the one Dani claimed fell asleep in class), Stiles watched Derek. Apparently, his staring-skills had leveled up.</p>\n<p>Even as prone to day-dreaming as Derek might have been, even he couldn't help but notice that Stiles was becoming a constant. Couldn't overlook the kid, certainly not with how often he'd show up at Derek’s after-school job at the bookstore. Would just sit with his homework in the café, buy a comic book, and talk incessantly to Scott (when he was there) or at Derek (when Scott wasn't). Stiles would tell Derek about things he really didn't care about, but were usually somehow absurdly useful on his next round of tests. It happened to often to be a coincidence and Derek wondered just how Stiles knew the junior curriculum better than Derek did. </p>\n<p>But however he did it, Derek was getting used to his smell. Was slightly perturbed to realize that the bookstore smelled right when Stiles was camped at his usual table. </p>\n<p>Derek asked his sister what the hell the kid's deal was. Dani just shrugged and gave an impressive monologue about the strangeness that was Stiles. Stiles, which was a terrible nickname for a real name so horrible teachers blanched to see it, were relieved when Stiles gave them an out. Really smart, but weird. And small. Like his body was having trouble with the idea of growing. She waxed long about Halloween costumes and bullies, about ineptitude at sports, but a clearly healthy brain. Dani announced she had decided she wanted to be a neurologist. She would be going to MIT one day. Just try and stop her.</p>\n<p>That was also the year the kid's smell turned bitter during the spring quarter. But his voice kept steady and his mouth didn’t seem to know that something was wrong. Derek didn’t ask about the sour notes when Stiles told him about prohibition and covalent bonds. Or when Stiles outlined PanAm's role in the development of intercontinental flight. Derek just shrugged, privately wondering what was going on and assuming it was none of his business. </p>\n<p>Stiles smell became increasingly astringent over the weeks. Soured until the day he showed up with a pale face, a rabbiting heart, and clothes reeking of iodoform. His hands trembled and he looked like he was about to start shaking, like he was barely keeping his body in one piece. Derek was stationed at the coffee counter and he didn't quite know what to do when the kid didn't say a word outside of his coffee order. When Stiles slid exact change across the counter in exchange for a vanilla chai Derek started panicking slightly. Felt caught as he watched Stiles squeeze packet after packet of honey into the already sticky-sweet drink. </p>\n<p>He stated as Stiles stood there next to the condiment bar, toying with a last packet and not drinking that monstrosity on the counter. Stayed still another moment, taking deep breaths before he turned to Derek, looking at him with weirdly intense eyes, reminiscent of how Laura looked at him when she was displeased. Aggressive and angry somehow. </p>\n<p>\"You don't like me much, do you,\" Stiles had asked, voice dipping down, cracking out of a tight throat, certain. Any verbal queues for the question mark missing. Derek hadn't been sure of what to say, felt his body break out in a cold-sweat. Desperate not to say the wrong thing, he shrugged. </p>\n<p>Stiles nodded, as if Derek's non-response confirmed his all his worst beliefs. He didn't come back to the book store for weeks. </p>\n<p>Derek almost missed him, particularly during tests. </p>\n<p>Senior year was filled with college applications, baseball games, and very little Stiles. He still saw the kid around school, but he didn't talk at Derek any longer. Just nodded vaguely and withdrew. Every now and again his clothes carried a hazy smell of vodka. Even then, Stiles still talked a mile to his friends. Although Derek couldn't help but notice that he didn't quite smile anymore. Derek asked Dani if anything had happened, mentioned the smells, but she just repeated her claims of how weird some of her classmates were before expounding on her plans to become a marine biologist. Sea cucumbers were just the coolest.</p>\n<p>-----</p>\n<p>College was a new kettle of fish. Smelled like one too. The campus was full of new, overpowering smells and new faces, adding up to something of a constant terror for Derek. He couldn't have said he particularly liked it. In truth of fact, while he refused to admit it aloud, he was horribly homesick. But, he went to his classes and did well from the get go. </p>\n<p>He swore to himself that it would get better. Told himself that he'd get used to it. He'd grow to like it.</p>\n<p>His oaths didn't amount to much in the end. By the end of his sophomore year, Derek had developed a deep hated of the campus. Loathed coming back after breaks. Couldn't stand how people vanished between one semester and the next, how the smells changed, how the classes turned over. Nothing here was stable. It made Derek's skin crawl, feel like he'd lost his grounding.</p>\n<p>Derek was morose, pouting, brooding, hang-dog as he arrived back at the beginning of his junior year. He assumed he would continue to loath the very air he had to breath. Found his expectations met and perhaps even exceeded when he discovered that his preferred pizza venue had closed down. </p>\n<p>Campus life was miserable.</p>\n<p>That is until Stiles showed up the first week of the year and announced his presence without any compunction. With a surety of acceptance that demanded acquiescence. The guy almost startled Derek with their first meeting by calling loudly across the campus lawn. Shouting Derek’s name, Stiles had tripped towards him. Adding in a wild wave, as if Stiles felt the need to make extra sure that Derek saw him. </p>\n<p>Derek winced at the volume, but felt a rush of giddy relief at seeing someone so familiar. An old constant. Someone happy to see him. He brushed away any question of why Stiles might feel the need to acknowledge him. Particularly so very loudly.</p>\n<p>The kid had gone through a growth spurt in the two intervening years and had managed to become taller than Derek. He was still thin, almost gaunt and looked impossibly owlish with huge eyes that seemed to stare out at the world. Those eyes were glowing as they focused on Derek. He smelled delighted. </p>\n<p>Having Stiles around made college, made living away from family, peculiarly easy. Particularly as Stiles slotted himself into Derek's life and insisted through actions that they become something like friends. As Stiles reclaimed his place as one of Derek's constants, wedging his way back in without asking.</p>\n<p> Stiles started the process by showing up at the end of Derek's shifts at the campus library to drag him off to study. He claimed it helped him concentrate when he had someone around. Specifically, someone to tell him to shut up when he got too loud and rambled on too long. Besides, Stiles told Derek, punching his shoulder lightly at a college coffee shop where they had their books spread out, Derek had always been so very good at ignoring him. </p>\n<p>Derek had frowned long at that, twisted his pencil through the fingers of his left hand as he said “I didn’t ignore you.” </p>\n<p>Stiles’ attempt to copy Derek didn't go well, his bright purple pen flew across the table, skidding to a halt on Derek’s notebook. “Dude, you totally did. We never actually conversed. It was like I was talking to a giant, solemn teddy bear.” Stiles laughed and reached for his drink with the apparent purpose of chewing on the straw. He made a horrible sucking sound.</p>\n<p>Derek handed Stiles’ pen back with a sigh. “No, I listened. I just. Never knew what to say. I’m not exactly adept with words. Do you have any idea how much your chatter helped me on tests?” </p>\n<p>“Ahhh” Stiles said, flushing and kicking Derek under the table. “You shouldn’t say things like that. You’ll never get rid of me now.”</p>\n<p>-----</p>\n<p>That barely friends status evidently meant that Stiles felt entitled to show up at the end of Derek’s shift two weeks later and announce that he was taking Derek out for Stiles' birthday. According to Stiles, Derek was \"obligated as a friend to come.\"</p>\n<p>Derek had muttered about forewarning and better things to do, but went. Threw his books together and didn't actually hesitate. Just asked as Stiles dragged him along if it wasn't the friend who was supposed to pay. </p>\n<p>Stiles shook his head with a lopsided smile. “No, no,” he'd answered. “You don’t know me well enough for that.” </p>\n<p>Still, over eggplant in miso sauce Derek raised his green tea to Stiles' nineteen years. </p>\n<p>\"Eighteen\" Stiles corrected, shoveling rice into his mouth.</p>\n<p>Derek raised an eyebrow. \"Dani's turning nineteen.\"</p>\n<p>\"Yup, Dani's a year older than I am every year. It happens\" Stiles shrugged and gave him a toothy, shit eating grin, a grain of rice stuck to the corner of his mouth. At Derek's look, his twitch of eyebrow, Stiles set down his bowl and started in about how, sometimes, when a child is bright enough, they let him – or her of course – start kindergarten when they are four. Amazingly, said child can never quite catch up to the age of his – or her – classmates, no matter how hard he – or she – might try. Stiles knew all of this from hard earned experience. Because, man, had he tried. Stiles’d been horrified when he’d realized in first grade that he’d <i>never</i> be as old as Scott.</p>\n<p>-----</p>\n<p>It took until fall break for the subject of the marks to come up. Which, Derek thought in retrospect, was odd. As much as Stiles talked, he never brought the marks up. As many personal questions as Stiles threw out there, Stiles hadn’t asked that one or inappropriately shared as he was wont to do on almost any other subject.</p>\n<p>Which was particularly curious as marks featured as one of those topics that complete strangers asked about when desperate for conversation. The whole - where did you come from? What do you do. Whose mark do you have? Girl? Guy? Met them yet?</p>\n<p>But, the first day of fall break, and the topic hadn’t yet been touched when Stiles showed up at Derek’s apartment (Derek hadn’t been aware Stiles knew where he lived) and announced that they were going to the beach. He’d already packed the food. Derek had ten minutes and then should be in the car to drive them out. </p>\n<p>Stiles had then proceeded to spread himself out on Derek’s couch and bury himself into the cushions, groaning about how comfortable it was. “I could sleep here. Man, I didn’t know you had such taste” he sighed, breath spilling across the cushions. He rubbed his face into the material.</p>\n<p>Derek wasn’t going to be able to get the smell out without shampooing the damn thing. </p>\n<p>The half an hour drive to Derek’s preferred beach was peaceful in the way Derek only felt when Stiles was telling him at length about some apparently random topic. In this instance, tar deposits on California beaches.</p>\n<p>Unpacking the car, Derek discovered that Stiles actually had packed a picnic, complete with wicker basket. When Derek laughed, Stiles informed him not to mock his efforts or he wouldn’t be eating. And everyone knew that salt air made people hungry, so it would be a drawn out and cruel torture. As they carried blanket, towels and basket over rocks and down to the sand, he painted a lurid picture of Derek shivering on the beach for hunger while Stiles lounged like a dragon over the treasures locked in the basket. </p>\n<p>Blanket spread on the sand, Derek starting stripping down, pulling his shirt over his head. He noticed Stiles eyes brush over his collarbone and flick away again. He smelled nervous. It struck Derek as strange. Odd that he was anxious, surprising that he didn't ask. Most people did. The name was unusual, after all, and the mark was so solid. None of those delicate lines that some people carried. Derek wondered, usually very very privately in the quiet of his own room, about what kind of person could make such a mark. </p>\n<p>And he realized that he had no idea who Stiles' other was. Derek had a sudden flash of concern that perhaps Stiles' mark was gone. Or had never been, that Stiles might be alone in all of this. </p>\n<p>Derek frowned, his fingers automatically going to his mark and Stiles looked almost uncomfortable. He turned away, toying with the hem of his own shirt, voice squeaking as he started up about water tables. How the area needed rain to replenish the reserve. “Because, man, there was a high risk of fire.” Stiles reeked of embarrassment, hands fidgeting nervously. </p>\n<p>Derek actually asked. Leaned forward to get a better smell \"Do you have a mark?\"</p>\n<p>Stiles froze. His laugh a little high, a little hysterical, as he told Derek that of course, of course he had a name. He wasn't that unlucky. This day might not be going quite as planned, but you know, some things were exactly in the middle of the bell curve.\"</p>\n<p>\"And? what's the name?\" Derek asked, refusing to be distracted. </p>\n<p>Stiles mastery of the art of evasion was non-existent, but today it was as if he was trying to juggle red balls in an effort to get people to look away. \"Does it matter?” he equivocated. “It's just a name. And what's in a name? People don't always get along with their others. Sometimes they don't even like them.\" Stiles flushed.</p>\n<p>\"That's absurd. I'm sure he'll like you.\" </p>\n<p>Stiles scoffed. Derek didn’t know if Stiles had ever sounded so unsure. \"There are no guarantees, man. Sometimes life doesn't go as planned or expected. Like today. Today is unexpected. You know the saying about assumptions, but then you already are an ass so it’s not like they can actually do anything.” Stiles was grinning again, but that bitter smell that Derek remembered from high school had cropped up with just a touch of stringency. Just a bit, but there. </p>\n<p>Derek shook his head and let it go, curious why Stiles would be so concerned. “You know who the person is, don’t you? You’ve actually met him.”</p>\n<p>Stiles threw himself back on the blanket. “You don’t give up. You don’t. Which is probably good. You’ll get far in life.”</p>\n<p>“And I know the person as well.”</p>\n<p>“Give the man a hand!” Stiles clapped his hands over his chest, looking over at Derek expectantly. </p>\n<p>“You didn’t make a good impression, did you?”</p>\n<p>Stiles closed his eyes “Oh my fuck” he gasped. “How is this possible?” he opened his eyes again and stared at Derek, looking for the world like the conversation was causing him pain. “No, no I didn’t make a good impression and I’m not sure he likes me.”</p>\n<p>“So work on it. Woo him,” Derek suggested, attempting to lighten the situation. Trying to make Stiles laugh.</p>\n<p>Derek didn't feel as if he'd succeeded when a pained chortle escaped Stiles mouth. “Woo him? Seriously? You think that I should bend my not inconsiderable efforts toward wooing?”</p>\n<p>“Sure. Why not. It couldn’t hurt. After all, the guy's supposed to be perfect for you.”</p>\n<p>Stiles grinned, seemed to think that the idea was hilarious. “Alright then. If you think I should woo, then woo I will. Who am I to tell you no?”</p>\n<p>Lunch was good and the day enjoyable even if Stiles never did take off his shirt even to go into the water. He rather absurdly claimed he burned easily even as he spread 40 proof sun protection across his arms. Derek didn’t ask. Felt like he'd pressed enough for the day.</p>\n<p>-----</p>\n<p>Not having kicked Stiles out on his first visit evidently meant that Stiles thought he could just show up and drag Derek out. Stiles tried it two days after the beach episode, bringing flowers of all things and claiming that he was taking Derek to “that burrito place I like, you know?” Derek did.</p>\n<p>\"What are you doing Stiles?\" he asked staring at the flowers that Stiles was holding out for him. </p>\n<p>\"I'm working out a plan to woo! Wooing does not come naturally to me. You said to woo.\" Stiles looked down at the flowers. “But evidently flowers are a ‘no’. Let’s put them in the ‘no’ column.” </p>\n<p>\"You decided to test this all out on me? \"</p>\n<p>\"Well, yes. Who else would I do this for?\"</p>\n<p>Derek rolled his eyes. There seemed to be a lot of that. </p>\n<p>“See, that – that right there – clearly I need practice. But you can't count the first few attempts against me.”</p>\n<p>“I didn't realize I was supposed to be counting at all.”</p>\n<p>Stiles spread his hands, knocked the flowers into the doorframe and said \"That’s because you are a special snowflake Derek. Evidently you need to be told things. Things that should be <i>obvious</i>.\" </p>\n<p>-----</p>\n<p>Which was arguably why, another three days later, Stiles was sitting in Derek's living room at the coffee table making a colored list of Derek's favorite things. </p>\n<p>Derek was watching absently over his neurology textbook, responding to Stiles’ periodic and rather invasive questions. Derek wasn't sure if being grilled was more embarrassing or that Stiles seemed to know the answers to most of his inquires already. His questions were apparently more for confirmation than for information.</p>\n<p>\"Isn't it supposed to be more romantic when you surprise the person?\" Derek finally asked when Stiles started expounding on his guesses about Derek's preference for weekend getaways. According to Stiles, Derek would hate ski lodges. But Stiles felt that Derek liked hiking and was expounding on the desirability of hiking in the Grand Canyon, particularly as the weather was cooling.</p>\n<p>\"No, no,\" Stiles assured Derek confidently, then paused saying \"well, perhaps, depending on the person. But in this case, it's a moot point. You don't like surprises and anticipation is something you do in fact enjoy. So, really, planning this all up front for you should get me more points.\" Stiles waved at his bullet-pointed, colorful screen. </p>\n<p>\"I'll give you the points\" Derek conceded, feeling confused as to the point of the exercise. A little uncomfortable with Stiles' efforts. \"When do you stop?\" </p>\n<p>\"Well, when I have enough points for you to like me,\" Stiles looked up at Derek, his face of mask of earnest interest, eyes opened as wide as possible. \"<i>Do</i> you like me Derek?\" </p>\n<p>Derek rolled his eyes and snorted, going back to his textbook. It was safer.</p>\n<p>-----</p>\n<p>One of the double-underlined items on Stiles’ list was ‘relaxing evenings at home’ (Stiles showed Derek as he checked it off, keeping Derek continually up to date on his efforts and practice). It was a favorite of Stiles', one which apparently included afternoons battling to the death over Mario Kart or FIFA Soccer accompanied by cheap take out. Stiles almost always lost. </p>\n<p>After the sixth such episode included a rather appalling trouncing, Stiles threw down his controller and turned to Derek. He curled his feet up, cross-legged on the couch and peered at him. An eye lash was stuck to his cheek and Derek wanted to wipe it away. </p>\n<p>“Alright, Derek” he said, tone clearly meant to be full of import. “You, as we discussed, are not such a fan of secrets and don't like surprises. So, in honor of that and to work up the ladder of important-confessions before climbing through the veils-of-great-secrets, I have something to say.\" Stiles paused for dramatic effect, making sure Derek was looking at him. \"Please note the double-goals being filled here. Efficiency in action.” He gave a thumbs up.</p>\n<p>Derek shook his head, as he leaned forward toward the coffee table said “But not in words Stiles. You are never efficient with those.” Derek picked up his chopsticks and started back in on his fried lotus root. Stiles was making him nervous with all his pent-up intensity and the food gave him something to do with his hands to keep him from touching Stiles' face.</p>\n<p>“No, I leave that to you. It's why you do so well editing my papers. My brilliant ideas combined with your brevity!” </p>\n<p>Derek let his sigh empty his lungs, took a deep breath before prompting his slightly-absurd friend on “Your confession Stiles.”</p>\n<p>“Right, right. It's that I know about the whole...” and Stiles performed a series of complex hand gestures that appeared to indicate that Stiles knew about Derek's possession of eyebrows and teeth. Derek said as much.</p>\n<p>Stiles huffed at him. Clearly disappointed in Derek's lack of skill with charades. “No, dude, I know. About the, whole ... pull of the moon and the transformations.”</p>\n<p>Derek chopsticks snapped in his hand \"What the hell is that supposed to mean?\" A chill moved along his spine. </p>\n<p>Stiles looked at Derek, his face poised like a fish, lips puckered slightly and eyebrows drawing in “Man, you're kidding me, right? You're going to make me say it?\" He seemed apprehensive, but began to gently pry Derek's fingers open,letting bits of chop-stick fall to the table.</p>\n<p>Derek watched Stiles examine his hand for splinters, gently dragging finger tips along his palm. Stalling and feeling breathless, Derek inanely said “Stiles, why are you always so afraid to say anything outright?” Stiles moved back, spread his hands up, shook his head, making a 'tsk' sound with his tongue. Derek gripped the couch cushions and accepted his fate, continued before Stiles could actually start in on an answer \"But how could you know?”</p>\n<p>Stiles's shoulders relaxed and he picked at the seam of his jeans. \"I very clearly - obviously! so openly! - watched you and Dani for years. And, I have an over active imagination. That sort of helped. </p>\n<p>\"It sort of came together once I started thinking about it, you know, back in middle school. Your family living out next to the preserve. You always go home over the full moon now and even in high school you took the day off at school if the peak of the full moon fell during daylight hours. I mean, dude, you had rage issues when you were little that you have mostly gotten a handle on now. You also have this thing about sniffing, admittedly subtly, when you don't think anyone is looking. There were also all those wolf howls where there really shouldn't have been wolves. I mean, you guys don't sound like coyotes.\"</p>\n<p>Derek smiled at that and gave a startled laugh. Said \"No, we really don't.\"</p>\n<p>Stiles' looked a little dazed. \"Man, you laughed. You always sound good when you laugh.\"</p>\n<p>“It you’ve known since middle school. You could have said.”</p>\n<p>“Dude, I spent a couple of weeks worried you’d have to kill me or something if I said that I knew. And I bet the confession would have gone over so well on school grounds. Just think about it,\" Stiles tapped his fingers to his forehead \"I could have been all ‘Oh, Derek, full moon yesterday, you feeling ok today? Eat anything furry?’ I could have batted my eyes after that and hoped for the best.” Stiles demonstrated what he meant, clasping his hands in front of his breast and batting what were surprisingly long lashes in Derek’s direction. “You would have slammed me into something. You had all those supposed 'anger' issues” Stiles said dropping his hands and picking up the console controller. </p>\n<p>-----</p>\n<p>It was like a damn had burst and Derek found it hard to keep from acting the wolf around Stiles. Particularly when Stiles’ response to Derek reaching out and touching him was always a flush of happy scent and a grin. Which prompted Derek to treat him like pack, sniffing him and touching his shoulders and neck, even moving to throwing his arm around him. Stiles laughed the first time he did it and Derek didn't want to stop. It felt too nice to have family close by.</p>\n<p>They studied with increasing frequency in Derek's apartment instead of out. An apartment that began to smell like Stiles, particularly after he started treating it like his own space.</p>\n<p>Yet, somehow everything Stiles did was still ostensibly with the aim of wooing. He didn’t bring flowers again, but he also never showed up empty handed. He gave Derek snacks, snickering when Derek sliced the packages open with his claws. He cooked Derek dinner, helping himself to the kitchen. Because, evidently and as Stiles explained at length, Stiles had a theory that food was the key to a werewolf’s affection.</p>\n<p>To make matters worse, Stiles started doing his laundry at Derek's apartment. Derek - Stiles had pointed at him accusingly - had a washing machine and dryer. Stiles had to use the laundromat and waste precious time to study. Ergo, he was going to bring his laundry here. </p>\n<p>Derek just shrugged at the long rant about green energy and saving the environment, responded jokingly that if Stiles felt so strongly about it, then he could do Derek's laundry as well. More efficient that way, after all. Stiles had sputtered about not being a maid, but derailed himself in his explanation about the various differences between pack, friends, and pack animals, to ask if laundry counted towards wooing. When Derek flippantly agreed, Stiles took him at his word. He added it to his list of steps to “woo the beast”.</p>\n<p>Derek regretted it. Because between the laundry, the time spent at the apartment, and the touching, it meant that Stiles began to smell like him. And Derek's clothes began to smell like Stiles. It happened when someone used their hands to fold pants and to smooth wrinkles out of shirts. </p>\n<p>-----</p>\n<p>Derek didn't ask again about marks until the beginning of summer and Stiles’ went right on 'practicing' wooing. Right up until the day they spent piling boxes of Stiles’ things for summer storage in Derek’s living room. To keep safe until Stiles’ new dorm room opened up in the fall. A new dorm room, which would have a new roommate. Who, Stiles complained at length, might turn out to be cruel. Or worse. Might be a fan of Schlager music. Could Derek imagine? </p>\n<p>“You should just. Stay.” Derek said suddenly, breaking into Stiles' rant, his words stopping Stiles in the middle of carrying in the final box. It hit the ground with a thud. </p>\n<p>“Dude, what the hell?” Stiles asked, flinging his hands up in the air. </p>\n<p>“Look,” Derek said, hefting the box and moving it to the pile. “All your stuff is here now anyway. And you know I don’t like Schlager.”</p>\n<p>Stiles eyes narrowed. Derek thought the air felt heavier. Tense. Derek didn't really like the idea of Stiles living with someone else. Being so consistently far away. </p>\n<p> His eyes flicked to Stiles' collar bone.</p>\n<p>“It's me, isn't it?\" Derek asked, reaching out and touching Stiles’ shirt over his collarbone.</p>\n<p>Stiles's eyes popped, he looked at Derek with wide eyes that flicked over to Derek's collarbone. His breath was speeding up again, mouth parting as if his teeth couldn't keep back the words piled on his tongue. Derek rushed on \"You have the right birthday. You name is ... different ... but it's you.\" Stiles was glancing toward the door, his muscles tensing with that familiar flight response. Derek crowed him toward the couch until he fell back. </p>\n<p>\"You knew. Back in grade school. You knew and that's why you kept following me around.\" Derek frowned. \"But something happened when we were in high school\" he paused when Stiles' face blanched. Derek sat down next to him and took his hand, his thumb stroking slowly over the pulse on his wrist. Stiles opened his mouth and closed it again. It sounded like he was having trouble swallowing. </p>\n<p>\"Oh. That was the day your mother died and I ... I\" Derek stopped and pulled Stiles in. Stiles didn't say a word. Just dropped his head onto the proffered shoulder. Derek buried his nose in the Stiles hair just above his ear. His apology was muffled into Stiles skin. </p>\n<p>When Stiles smell evened out, Derek pulled back and kissed his nose. \"I like you Stiles\" he told him, trying for reassuring. His voice sounded scared in his ears, timid. Wasn't that just grand? Because everyone knew how desirable a timid werewolf was.</p>\n<p>Stiles didn't seem to mind, his answering grin blinding. \"I like you too.\" He knocked his foot into Derek's.</p>\n<p>Derek grinned and his fingers twitched down to the collar of Stiles' shirt, earning him a cheeky smirk. \"Forward today, aren't you?\" Stiles said, shaking his head. </p>\n<p>Derek stopped, pulled back. Stiles laughed and reached down to the hem of his own shirt, pulling it off over his head. Derek stared. There it was. His mark. He ran a thumb across it.</p>\n<p>\"You're right, this should have been obvious.\" Derek told Stiles, resting his chin on Stiles shoulder.</p>\n<p>\"I know, I mean. Dude. I just spent almost two full semesters wooing you. I do your laundry. Tell me that's not love?”</p>"
}