{
  "id": "6283759",
  "url": "https://archiveofourown.org/works/6283759?view_full_work=true",
  "author": [
    "iiscos"
  ],
  "title": "I myself have torn myself to shreds",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Star Wars Prequel Trilogy",
    "Star Wars - All Media Types"
  ],
  "relationships": [
    "Obi-Wan Kenobi/Anakin Skywalker",
    "Padmé Amidala/Anakin Skywalker"
  ],
  "characters": [
    "Anakin Skywalker",
    "Obi-Wan Kenobi",
    "Padmé Amidala",
    "Shmi Skywalker",
    "Sheev Palpatine",
    "Yoda"
  ],
  "additional_tags": [
    "mostly obikin",
    "a hint of anidala",
    "Time Travel Fix-It",
    "painful af but still counts"
  ],
  "language": "English",
  "series": "",
  "published": "2016-03-18",
  "completed": null,
  "words": "5,922",
  "chapters": "1/1",
  "comments": "346",
  "kudos": "9,183",
  "bookmarks": "1,609",
  "hits": "79,390",
  "summary": "<p>\n<i>The Force whispers in its ageless voice, its touch peaceful and lulling against Vader’s ancient soul, “Tell me your biggest regrets.”</i>\n</p>\n<p>Or the five times Anakin traveled back in time with the intention of making things better, and the one time that it actually worked.</p>",
  "notes": "<p>Ready for some painful time-travel? Inspired by The Butterfly Effect which effed me up as a child and the Obikin hell where I currently reside. Title comes from “The Blue Octavo Notebooks,” Franz Kafka.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Originally planned for the Obikin Big Bang, but it's not long enough, and alas, I am out of ideas again. Feel free to drop by my tumblr jamesalarcon, because I am always open to Obikin ideas!</p>\n<p>Thank you so much for reading! Feedback will be cherished as always xx</p>",
  "text": "<p>The Force whispers in its ageless voice, its touch peaceful and lulling against Vader’s ancient soul, “Tell me your biggest regrets.”</p>\n<p>\n<b>i.</b>\n</p>\n<p>The first time, Anakin kills Obi-Wan.</p>\n<p>Two rays of ethereal blue clash and clash against the fiery hell of Mustafar—harsh, violent, and unrelenting as they traverse in an inexorable pattern of swing and dip, push and pull. Each inhale casts cinders to Anakin’s paper lungs, each tireless step upheaves the black gravel beneath. Anakin forces his old Master to retreat, until lava chars the backs of his stumbling heels.</p>\n<p>“Anakin!” Obi-Wan shouts, but his pleas fall to deaf ears. “Anakin!”</p>\n<p>With rage roaring in his veins, Anakin poises his lightsaber for execution, his vision as red as the blood-soaked sky of this firestorm planet. He cuts Obi-Wan down with an unwavering resolve and leaves the Jedi to collapse at his feet, the black-crusted gash of cauterized flesh marring Obi-Wan’s shoulder, his chest, and across his heart.</p>\n<p>Anakin stands over the fallen Jedi and watches the pain on his face ease, the stormy blue of his eyes fading to lifeless gray. He waits for a dying word, a final taunt from that clever mind and razor-sharp tongue that somehow will twist into Vader’s blackened heart, evoking pain and unspeakable misery from a part of himself that begs for death as his old Master dies before him.</p>\n<p>But no words part with those waning breaths. Only silence echoes hollowly in Anakin’s ears.</p>\n<p>~~</p>\n<p>Vader returns to the present to find his body intact, his skin smooth and untouched by the fires of Mustafar. He removes his mask and inhales, the artificially cool air tasting nothing short of sweet and soothing on his ravished tongue.</p>\n<p>Padmé is still dead, their child still gone. Even Palpatine has passed some years ago, slain by his young apprentice who had surpassed him in power, swiftly and without pity.</p>\n<p>Vader sits on his empiric throne aboard his monstrous, metal planet, terrorizing the galaxy in his right as the new Galactic Emperor, the last Sith Lord—powerful, untouchable, eternally alone.</p>\n<p>Not even Obi-Wan’s ghost visits him in his dreamless sleep.</p>\n<p> </p>\n<p>\n<b>ii.</b>\n</p>\n<p>Anakin saves Padmé.</p>\n<p>He sends clones to her apartment on Coruscant and relocates her to the safety of the Emperor’s starship before he even lands a foot on Mustafar. Afterwards, with the adrenaline of combat still rushing in his blood, sweat and ashes tangled in his unruly hair, Anakin returns to find Padmé in his personal chamber—heartbroken, heavily pregnant, but <em>alive</em>.</p>\n<p>“Obi-Wan was right,” her voice quivers, “You’ve changed.”</p>\n<p>“I don’t want to hear any more about Obi-Wan,” Anakin responds coldly, and Padmé’s face crumbles, her shoulders trembling as she openly sobs, and even then, Anakin finds her achingly beautiful.</p>\n<p>“You’re going down a path I can’t follow! You’re breaking my heart!”</p>\n<p>Anakin grits his teeth, forcing away the familiar rage, the burning betrayal upon learning that Padmé—his love, his <em>wife</em>—would cast him away after all that he has done to save her, to ensure a future for their unborn child.</p>\n<p>He leaves without another word, terrified of what he might do in his emotional tumult. Only when he reaches the seclusion of an empty sparring chamber does he roar with reckless abandon, unleashing from his heart the black dragon that whispers his fears and strangles his soul.</p>\n<p>~~</p>\n<p>In the weeks that follow, Anakin keeps Padmé safe, living in luxury and served with the richest, most delectable foods the galaxy has to offer. He brings her crowns made from Maelibi gold, jewels found among collapsing stars, and the finest silks and satins weaved by Lashaani maidens. He promises riches and prosperity for her people on Naboo, monuments in her name and in the names of their child and future children. He does everything he can for her, caters to her every whim, stopping only short of kneeling at her feet and begging for forgiveness.</p>\n<p>“Padmé,” he whispers, threading a gentle hand through the lavish, brown waves that spill across her shoulders, down her back, “Join me, please, Padmé.”</p>\n<p>She turns from him the moment fingers touch skin—her jaws firm, her expression impassive, her doleful, dark eyes brimming with a hatred that pricks ice into his veins.</p>\n<p>“Leave,” she whispers, just as last night, and the nights before. Anakin stiffens under her stare, thins his lips, and obeys without a sound.</p>\n<p>~~</p>\n<p>“Medically, she’s completely healthy. For reasons we can’t explain, we are losing her.”</p>\n<p>“She’s dying?” The cold bite of fear sinks into his heart.</p>\n<p>“It appears,” comes the infuriatingly, apathetic voice of the medical droid, “She has lost the will to live.”</p>\n<p>Anakin’s face twists in anger, his eyes unseeing towards the transparent wall between him and his dying wife. “Why?” he demands viciously.</p>\n<p>“We do not know, but we must operate quickly, if we are to save the babies.”</p>\n<p>“Babies?” His voice hitches in his throat, as he spins around to face the droid only to find it already gone.</p>\n<p>Hours later, the droid returns, holding two small bundles in its metallic arms. Leia fusses and cries, her small body turning inside the sheets, tears spilling from dark, umber eyes—<em>Padmé’s eyes</em>. Meanwhile, Luke is calm and still beside his sister, and it takes a moment for Anakin to recognize the unmistakable blue—luminous and clear like the skies of Tatooine. Those eyes, the eyes of his son, remind him wretchedly, achingly of a young man he once knew, who died beside his broken Master in the fires of Mustafar.</p>\n<p> </p>\n<p>\n<b>iii.</b>\n</p>\n<p>Anakin chooses Obi-Wan.</p>\n<p>He bolts down the peaceful halls of the Jedi temple, feeling every desperate step against the hard, unforgiving marble. The Chancellor’s words rasp cruelly in his ears, taunting him, stirring the black dragon that weaves in his fears, his guilt.</p>\n<p>\n<em>Perhaps it’s simply a question of whether you love Obi-Wan Kenobi more than you love your wife.</em>\n</p>\n<p>Years ago, lifetimes ago, Anakin had chosen Padmé, but not this life, not this moment. He will not abandon Obi-Wan a second time.</p>\n<p>A meeting is in session, with all the Masters gathered in the Council Hall behind the thick, impenetrable walls that insulate them from the rest of the world. Under Palpatine’s personal request, Anakin has been granted the rank of Master, the Chancellor’s representation in the Jedi Order. His omission from this meeting leaves a bitter twinge in his mouth, but that is beside the point, he reminds himself, as he shoves away the Jedi youngling guarding the entrance, bolting through the double doors to meet the stunned eyes of the Masters inside—Obi-Wan’s among them.</p>\n<p>“The Chancellor is a Sith Lord!” he shouts without a quiver of doubt.</p>\n<p>~~</p>\n<p>Anakin fights beside his former Master, their movements perfectly in sync in undulating phases of power and composure. Anakin attacks first, as he always does, lunging forward with swift, forceful strikes, driving their enemy to defend and jarring their self-assurance. Obi-Wan’s movement would then merge seamlessly with Anakin’s, clever and calculated and beautiful in its simplicity, taking advantage of the weaknesses revealed in the previous frenzy.</p>\n<p>They are a force to be reckoned with, the unstoppable heroes, the perfect team revered in all corners of the galaxy. They cannot lose—certainly, they cannot—not when they are fighting side by side, their bond through the Force so resonating, so complete, as if their very souls are merged to one.</p>\n<p>But they do falter, and Anakin knows, the moment he stumbles and falls as a bolt of Force lightning jolts through his veins. He collapses on the carpeted floor of the Chancellor’s office, within the four walls of this garish trap that he had willingly entered so many times as a foolish young Knight, spilling his secrets of fear, anger, jealousy, and disappointment. Anakin flutters close his eyes, willing away the regret threatening to tarnish his unwavering hope. This time is different. This time he will set things right. He has Obi-Wan by his side.</p>\n<p>Paralyzed from the pain, Anakin needs time to recover, and it leaves him open, poised, and ready for execution. He can only watch on, blearily with half-hooded eyes, as Obi-Wan guards him in his momentary weakness, defending against the Sith Lord alone.</p>\n<p>A diagonal swing leaves him vulnerable on the left, and if Anakin had been by his side, the weakness would undoubtedly be protected. Instead, Anakin is on the floor, useless and horrified, as he watches a flash of red disappear into Obi-Wan’s stiffening body, through the gaps in his ribcage and into the chamber of his heart.</p>\n<p>“NO!”</p>\n<p>A familiar darkness twists in his heart, as his former Master falls to the feet of a Sith.</p>\n<p>Anakin pushes himself to stand and lunges at the Chancellor—no gimmicks, no rules this time, just raw power and unadulterated hatred. One, two, three blows are all it takes to disarm the Dark Lord, leaving the gray, wrinkled monster scrabbling on the floor.</p>\n<p>“N-No, don’t kill me. I can train you, young Skywalker. Help you purge this fear from your heart, I can—”</p>\n<p>Anakin inhales and closes his eyes, and then, there is silence.</p>\n<p>He rushes to Obi-Wan, hovering once again over his former Master’s dying body, but this time, he crumbles to his knees, anguish and grief shaking his core.</p>\n<p>“You’ll be alright,” the quiver in his voice betrays him, hot tears wetting his cheeks. “Just hang on, help is on the way. You’ll be alright.”</p>\n<p>Obi-Wan blinks slowly at him, mustering the last of his strength to touch Anakin’s face. With his thumb, he smears a tear welling just beneath his lashes.</p>\n<p>“Well done, Anakin.” The blue of his eyes are fading, but the smile he wears is serene. “I’m proud of you.”</p>\n<p>~~</p>\n<p>Anakin emerges a hero but rescinds the Jedi Order upon his return to the Temple. Padmé is alive and well, giving birth shortly to two healthy babies—Luke and Leia Skywalker. Anakin leaves with her to Naboo, where they raise their children in happy, peaceful bliss, surrounded by lush gardens and perpetual sun.</p>\n<p>Leia grows up to be a headstrong, energetic young girl—dark-haired, dark-eyed like her mother, but possessing all the petulant curiosity of his father. Luke, meanwhile, has sandy blond hair and impossibly blue eyes, an uncanny doppelganger of Anakin as a boy on Tatooine. But from his mother, he inherited gentleness and serenity. He will be a better man than Anakin would ever hope to be.</p>\n<p>Both of his children are strong with the Force. Both Anakin loves with all his heart.</p>\n<p>Five years pass, and they are as content as they can be, except for the days surrounding the anniversary of the new Republic’s rise. His family knows not to trouble him during these trying times, as he locks himself away in the lonely hours of the night, brooding in darkness with only a bottle of Corellian rum for company.</p>\n<p><em>Obi-Wan would be proud</em>, Anakin tells himself. <em>Obi-Wan is dead</em>, comes the resounding truth.</p>\n<p>He smashes the bottle in his drunken misery, his anguish ripping from his throat and into the taunting silence. Not even in a life where he is happy—with his loving wife and two beautiful children—can he cope with the loss of Obi-Wan.</p>\n<p> </p>\n<p>\n<b>iv.</b>\n</p>\n<p>Anakin returns angry.</p>\n<p>He storms down the empty corridor of the Republic cruiser with only one goal in mind, and when the doors of Obi-Wan’s bedchamber slides open, he barges in without a word.</p>\n<p>“Anakin—”</p>\n<p>The rest of the protest is muffled by his lips against Obi-Wan’s, as the young Knight presses his former Master against the nearest durasteel wall, framing the older Jedi with a firm grip on each side. Obi-Wan shifts and twists beneath his touch, blue-gray eyes wide with shock. His words are swallowed once again, when Anakin licks between his parted lips.</p>\n<p>Anakin already knows what Obi-Wan has to say, and he has had lifetimes to ponder a proper response. He is Obi-Wan’s former Padawan, and the sixteen years that separate them are nevertheless significant. Though the Council does not strictly demand celibacy even between Jedi, loose morals are adamantly frowned upon, especially for a newly ranked Master serving as an example to his Jedi learners. And most importantly of all, attachment is forbidden, but Anakin can hardly care at this point, as self-aware as he is of their hypocrisy and pretense.</p>\n<p>Time and again, they have risked their lives for one another, compromised their ethics, wavered in their faith. Faded is their Master-Padawan bond, dutifully severed with Anakin’s braid, but in its place emerged something far more potent that simmered with an intensity beyond the oath between brothers, the longing between lovers. It is a connection that has no language to manifest itself, no outlet from the unfitting cages of their chests or the wordless bemusement in their minds.</p>\n<p>They are attached, whether Obi-Wan admits it or not. So what is one more thing to add to their list of grievances? One more spiral down this vicious, endless cycle?</p>\n<p>Obi-Wan wants him too. There is little doubt in Anakin’s mind from the way he would catch his former Master’s eyes linger as they spar, or the faint blush that would tint his cheeks whenever Anakin leaned close to whisper something that very well could have been divulged aloud. Even as they kiss now, Anakin can feel Obi-Wan shift against him in an unimpressive attempt to hide the maddening hardness between his legs. Cruelly, Anakin presses his thigh against it, drawing a surprised gasp. Of all the emotions Obi-Wan conceals so masterfully behind his calm façade, desire is not one of them.</p>\n<p>Anakin takes Obi-Wan—rough, hungry, dominating, and possessive—manhandling him until he is on his stomach, pulling at his hips with a grip hard enough to bruise. He thrusts at a fast, punishing pace, teeth tearing into shoulder as he marks Obi-Wan, claims him, <em>owns</em> him.</p>\n<p>He probably should have taken longer to prepare, slicked them both with something more than pre-come and saliva, but these are merely afterthoughts as Anakin grinds into the tight, consuming heat, spreading himself on top of Obi-Wan and crushing him against the mattress, pressing his chin to the crook of his former Master's shoulder to listen to the quiet gasps and moans.</p>\n<p>“Anakin. Oh, Anakin,” Obi-Wan murmurs, his voice soft and caressing, a stunning contrast to Anakin’s raw, brutal strength. Anakin reaches around him and grips his length, stroking in the same relentless rhythm.</p>\n<p>When Obi-Wan comes, Anakin feels him tighten impossibly, waves of bliss undulating across their bond and sending molten fire through his veins. Anakin joins soon after, his moan strangled against Obi-Wan’s shoulder as every shred of pleasure is wrenched from him, leaving him boneless and spent.</p>\n<p>Afterwards, he settles in the warm embrace, heartbeat languid and eyes laden with sleep.</p>\n<p>“I love you, Obi-Wan,” he confides to the darkness and feels a soft thrum along their undeniable and unbreakable bond.</p>\n<p>~~</p>\n<p>Obi-Wan falls. And oh, does he fall.</p>\n<p>“It’s no use!” Aayla Secura frantically shouts into her damaged transmitter. “We’ve been outmaneuvered. He has the exit gate surrounded, and we only have—”</p>\n<p>The call ends abruptly with a sizzle of static, leaving only stony silence inside the Council Hall. Anakin shifts uncomfortably, the emptiness of the seat beside him a stagnant distraction in the corner of his eye.</p>\n<p>Mace Windu is the first to speak. “The closest Jedi are Master Billaba and Padawan Dume, but they are preoccupied with their assignment on Umbara.”</p>\n<p>Yoda’s wizened lips thin to a small, grim line. “Spread thin, the Jedi are, but send a rescue mission, we must.”</p>\n<p>“Then, let me go!” Anakin shouts, as all eyes fall on him, mixed with varying degrees of scrutiny and reservation. <em>Unbecoming of a Master</em>, Obi-Wan’s voice echoes in his memory, but his former Master is not here anymore. “You can’t just keep me locked up in the Temple when we’re losing Jedi left and right.”</p>\n<p>“Twisted by darkness, your former Master has become.” Yoda’s refusal is infuriatingly calm, untouched by the younger Jedi’s outburst. “The man you knew, gone he is. Clouded by fear, your judgment is. A suitable mission for you, this is not.”</p>\n<p>“I can bring him back,” Anakin insists, his voice steady despite a darkness looming in his heart, “I know I can.”</p>\n<p>His efforts are useless—Anakin soon realizes—even after his persistence have grated the Council’s last nerve, before Master Windu finally granted him the go ahead to depart for Dantooine. There, Anakin spends months on the arid, savanna planet chasing ghosts, arriving always a fraction too late, and finding only Obi-Wan’s taunting Force energy among the ruins they search.</p>\n<p>Obi-Wan is clever, masterful, and above all deceptive, and perhaps the Jedi never truly appreciated his ingenuity until he has fallen to the Dark Side. They lose their hold on the distal posts of the Outer Rim, as well as support from key planet systems whose leaders were swayed by the luring words of the former Negotiator. War continues to rage in the sky, earth, and seas, but Anakin forces himself to turn a blind eye for now. His mission is to bring back Obi-Wan—safe, sane, and sound—and until then, the galaxy will have to wait.</p>\n<p>Another month passes, before a distress call from Coruscant sends Anakin rushing back, swallowing the horror in his throat as he steps over the bodies of fallen Jedi, young and old alike, littered in a trail of death to the forbidden Jedi Archives. Anakin descends the winding stairs—his eyes unfocused, his heart echoing in his ears—and finds Master Yoda at the base, head bowed and shoulders hunched before the open Holocron vault.</p>\n<p>“Master,” he whispers, misery brimming from his failing shields, “I must know.”</p>\n<p>Yoda shakes his head sullenly. “If into the security recordings you go, only pain will you find.”</p>\n<p>~~</p>\n<p>If every action is but a ripple in the waters of fate, then all streams must lead to Mustafar somehow. Anakin contemplates as he faces the image of his former Master, hooded in a brown dark enough to be black, with awful gold speckled inside irises once lucid, pure, and blue.</p>\n<p>Guilt. Obi-Wan has always been driven by guilt. Guilt over Qui-Gon’s death, Darth Maul’s revenge, and in many lifetimes, but not this one, Anakin’s fall.</p>\n<p>But in this life, Anakin has given him something new to feel guilty about.</p>\n<p> </p>\n<p>\n<em>Obi-Wan had stumbled over his words that night, an uncharacteristic nervousness and fear strumming in their shared bond.</em>\n</p>\n<p>\n<em>“We can’t, Anakin. It’s too dangerous—We’re Jedi, and this kind of—”</em>\n</p>\n<p>\n<em>“This kind of what?” Anakin bit harshly.</em>\n</p>\n<p>\n<em>“—Attachment.” Obi-Wan’s voice is stiff. “It will only lead to suffering. I cannot share this with you any longer, even though I wish I could.”</em>\n</p>\n<p>\n<em>Anakin felt his heart clench and his stomach turn, the fire of his anger consuming the sullenness of rejection. “Why?”</em>\n</p>\n<p>\n<em>“Jedi must let go of their attachment.”</em>\n</p>\n<p>\n<em>“Why don’t you let go—” Anakin shouted, “—Of this sanctimonious, deceitful, self-punishing Code? What do you wish to gain from this deprivation? To hold yourself above love and loss, so you can say you’re better than everyone?”</em>\n</p>\n<p>\n<em>Obi-Wan looked visibly taken aback, marginally appalled. “These are the vows we took as Jedi.”</em>\n</p>\n<p>\n<em>“And we have broken them, long before this—” Anakin waved indignantly with his durasteel hand. “—Any of this, even happened. You brought me here, you trained me, you loved me! It’s your fault that I love you back! I’m like this because of you, so don’t think you can just tell me to let go as if it’s some magical solution. You can be the perfect Jedi, Obi-Wan, but you will die loveless and alone, detached and forgotten—is this what you want? Is this what you want for me?”</em>\n</p>\n<p>\n<em>Obi-Wan grew pale, pain shown vividly in his defenseless blue eyes as he inadvertently took a step backwards. Only then did Anakin restrain from his Force-driven rage, blind anger dissipating long enough to feel the profound sorrow humming through the Force. They were connected now, infinitely and irrevocably. Fear sank in his chest, as Anakin wondered what Obi-Wan must have felt on his end—the searing, black dragon that strangled him with its taunting whispers and eyes of dead stars.</em>\n</p>\n<p>\n<em>Anakin watched as Obi-Wan moved past him, collapsing into the chair by his writing desk. He reached a hand to his forehead, shielding his eyes but not the silent tears wetting his cheeks. Anakin’s apology afterwards never really quite cut it.</em>\n</p>\n<p> </p>\n<p>And here they stand, on opposite sides of a great chasm, hell rumbling beneath their feet. Through the power of the Dark, did Obi-Wan wish to absolve himself of this guilt? If anything, Anakin should be the one consumed by regret—more regret than his former Master can possibly accumulate in all his lifetimes combined.</p>\n<p>“Join me, Anakin,” Obi-Wan shouts, “On the Dark Side, we can be together!”</p>\n<p>“No, no we can’t,” Anakin returns, soul aching, “The darkness consumes all. I know this, Obi-Wan. I know.”</p>\n<p>Anger twists into those features, a cruel insult to the memory of the good man, the revered Master. “If you are not with me, then you’re my enemy!”</p>\n<p>They strike and parry for what feels like an eternity, but only one can rise victorious. Anakin watches helplessly as his Master lies in pieces before him—consumed by hatred, by pain—chin pressed to the dark sands of Mustafar and robes catching ablaze in the impending sea of lava.</p>\n<p>Anakin aches—wretchedly and unbearably—to know that Obi-Wan has fallen because of him, because of the mistakes he had made in his selfish desperation. Towering over Obi-Wan, he cannot even begin to fathom the profoundness of his failure to a man he has both loved with wild abandon and destroyed irreparably.</p>\n<p>“I hate you!” Obi-Wan shouts, as the smell of burnt, bubbling flesh enters Anakin’s nostrils, stirring nausea into his clenching gut.</p>\n<p>He decides this is the worst of his lives, yet.</p>\n<p> </p>\n<p>\n<b>v.</b>\n</p>\n<p>Anakin saves his mother.</p>\n<p>He abandons his post the moment they arrive on Coruscant, leaving Obi-Wan to handle the briefings alone. He never reacquaints with Padmé.</p>\n<p>Anakin pilots a small starfighter to Tatooine and finds Cliegg Lars by his moisture farm, banding together his small group of brave men to rescue his wife from the Tusken Raiders.</p>\n<p>“My name is Anakin Skywalker, son of Shmi!” he shouts, stumbling across the desert dune just in time to halt their departure. “Let me come with you!”</p>\n<p>The sand wanderers stood no chance, as Anakin tore and pillaged through their clan, striking down all who dared to obstruct his path. No moisture farmers died that day, and neither did Lars lose his leg. They find Shmi bound in a secluded hut, her hair windswept and disheveled and the hem of her sandy dress torn to shreds. A bruise blooms high on her cheekbone, her lower lip split and bloodied, but otherwise, she appears whole—terrified but alive.</p>\n<p>Anakin frees her from her ropes, falling into her embrace as she laughs and sighs in disbelief. “Ani. Oh, Ani. Is that you?”</p>\n<p>“I’m here, Mom.” He wraps his arms around her trembling form, feeling every bone within her fragile, breakable body. “You’re safe.”</p>\n<p>“Oh, you look so handsome, my son. My grown-up son,” she smiles at him through her tears. “I’m so proud of you, Ani.”</p>\n<p>Anakin swallows the lump in his throat, burying himself into her chest, just as he did as a boy of nine years.</p>\n<p>“I love you, Mom,” he sobs into the folds of her dress, “I missed you so much.”</p>\n<p>~~</p>\n<p>Anakin paid little regard to the injury he sustained during the rescue, a small gash on his side a few centimeters long, which drew a decent volume of blood but not deep enough to reach bone. But the sand and dirt of Tatooine caused his wound to fester, a fever igniting his already burning flesh as they trek beneath the unforgiving sun. Anakin collapses into a heap only an hour into their journey home on the second day.</p>\n<p>When he wakes, he sees Beru gently cleaning his wound, reapplying fresh bandages to his flank.</p>\n<p>“Mom,” he startles in his cot. “Where’s Mom? Is she alright?”</p>\n<p>“Shmi is tending to the farms with Cliegg,” Beru’s voice is gentle despite the firm hands holding him still. “You need not to worry. She has recovered fully.”</p>\n<p>Anakin stares at her long and hard, before finally settling into his sheets once more. “What happened?” he asks blearily.</p>\n<p>“Sun poisoning, a bad infection, and no immediate access to medical supplies,” Beru explains, “You were delirious with a fever. But it’s gone now—mostly. You still need time before regaining your strength.”</p>\n<p>“Time,” he repeats, and suddenly, panic rises in his chest. “How much time has passed since—since we returned?”</p>\n<p>“Two weeks.”</p>\n<p>“<em>Two weeks?</em>” he shouts, jolting from the cot and knocking over the small basin of water by his feet. He stumbles into the living quarters, ignoring Beru’s protests and grasping for his Commlink on the kitchen table.</p>\n<p>Padmé was assassinated in her apartment on Coruscant. Obi-Wan died on Ryloth, his body recovered just yesterday, battered and broken within an abandoned Separatist stronghold. His Master’s distress call for Anakin to retransmit to Coruscant was never received.</p>\n<p>On the brink of dusk, Anakin takes his lightsaber and steps onto the burning sand, ambling aimlessly towards the blood-red suns. His weapon switches on with a familiar drone, strumming against his ear as he shears off his Padawan braid and drops it to the grains beneath his feet. It is a long, thin ribbon, grown throughout the span of ten years—beginning and continuous since the moment he became Obi-Wan’s Padawan and until now.</p>\n<p>Coruscant is light-years away, and truly, he has no right to return to the Temple now. Anakin watches as dunes of sand swallow the fiery suns, casting darkness into the sky to surround every pinprick star.</p>\n<p align=\"center\">  ~~</p>\n<p>The Sith overruns the Jedi, the galaxy falls apart. Five years later, Palpatine approaches Anakin in exile, aimless and broken from a hundred years’ grief. The Emperor steps inside his small, sandy hut and extends a shriveled, gray hand.</p>\n<p>“You are powerful in the way of the Force, young one. Fear, hatred, anger, despair—you can harness them to your strength. I can show you how.”</p>\n<p>Anakin laughs—manically and hauntingly, he laughs—and when he sees the look of startled bewilderment twisting into those hideous, wrinkled features, Anakin laughs even louder.</p>\n<p>“Join me, be my apprentice, and together, we can rule the galaxy.”</p>\n<p>Anakin spits on the hem of the Emperor’s robes.</p>\n<p> </p>\n<p>\n<b>vi.</b>\n</p>\n<p>The last time, Anakin returns as a boy.</p>\n<p>The day Qui-Gon arrives in Mos Espa in search for parts, Anakin runs away to the market to hide among the storage behind tent shops. He curls into the sand mats and draws his knees close to make himself small. He has even packed a ration of granola to stave off hunger, as he waits with only the light of day as an indication of time passing by. He doesn’t budge from his hiding spot until the suns hang low in the sky, and he doesn’t dare to return home, until dawn breaks the next morning.</p>\n<p>Watto appears absolutely livid when he spots Anakin ambling into the junk shop. “Where have you been, boy?” the Toydarian junk dealer rasps, gripping harshly onto Anakin's small shoulders, “Think you can run away?”</p>\n<p>“I wasn’t running away!” Anakin protests. “And what does it matter, I’m here now, aren’t I?”</p>\n<p>Watto reaches for a rough strip of leather piled atop of his scraps, certainly ready to beat him bloody, and Anakin stiffens his shoulders and pinches his eyes closed, readying himself for the blow.</p>\n<p>Someone enters the shop just then, and the possibility of them being a customer halts Watto mid-swing.</p>\n<p>“My Master was here yesterday,” comes a familiar voice—melodic, but sharp in a distinctively elegant Coruscanti accent. “To inquire about a T-14 hyperdrive generator.”</p>\n<p>“I’m not taking Republican credits,” Watto wheezes.</p>\n<p>“I am well aware. We now have something more <em>real</em> to offer, as you requested, and I—”</p>\n<p>During this brief exchange, Anakin has kept his head timidly bowed. He only dares to sneak a glance when the smooth, confident voice inexplicably tapers off, and looks up to find, staring back at him, a young Obi-Wan Kenobi—still a Padawan by his bristly hair and single, long braid, and no beard to hide his boyishly handsome face.</p>\n<p>Obi-Wan appears at a loss for words, brows furrowed bemusedly as he approaches, staring down at Anakin as if he had seen him in a dream that he could not quite remember. Anakin panics as the older man draws close, twisting in Watto’s grip in an attempt to escape.</p>\n<p>“What’s gotten into you, boy?” Watto rasps, more surprised than offended.</p>\n<p>“Let him go,” Obi-Wan commands, his hand reaching for Anakin as well.</p>\n<p>Anakin screams and struggles, screams and screams, until his current Master and his Master in a different lifetime both release him as if they had been stunned. He scrambles away, knocking over scraps of metal as he staggers out the door, Watto’s angry yowling fading as the distance between them stretches.</p>\n<p>As fast as his small feet can take him, Anakin traverses the busy market, tears spilling down his sun-burned cheeks and the image of Obi-Wan’s startled bemusement branded in his memory.</p>\n<p>Two days pass before Obi-Wan haggles the generator from Watto, and the Jedi’s ship leaves without their Chosen One, grounded in the endless sands of Tatooine.</p>\n<p>~~</p>\n<p>Anakin is no longer a Jedi, but he still has access to the Force, and the Force has been kind to him indeed, guiding him with gentle whispers and warnings of danger, allowing his reflexes to be lightning quick and his decisions fool-heartedly lucky to those watching with an untrained eye. That year, he becomes the first human to win the Boonta Eve Classic, earning enough credits to free both him and his mother from slavery.</p>\n<p>At first, they struggle with their newly earned freedom. Shmi finds a job clearing tables at the local cantina, while Anakin wanders around the market during the day, freelancing for work as a mechanic. They never manage to make enough credits to sustain a second home, until a moisture farmer by the name of Cliegg Lars, struck by the lightning bolt of love, stumbles into the cantina where Shmi works and proposes to Anakin’s mother the same night.</p>\n<p>They move to Cliegg’s moisture farm, and Anakin is ecstatic to finally have a room to himself, with the exception of his new half-brother Owen also living there, of course, but that is a minor detail he is willing to overlook.</p>\n<p>He grows tall and strong, his connection with the Force only deepening with age, brimming with confidence and raw power that allows him to ignite even the most battered cruisers to life. Anakin earns his living as a mechanic, a pilot, parting from Tatooine at the age of nineteen to explore the galaxy with merchants, smugglers, and bounty hunters.</p>\n<p>And when the time comes for the galaxy to tremble, Anakin perches on his stool inside a Corellian cantina, his drink barely touched, his soul in his throat, as he salvages every word transmitted from the flickering HoloNet News, of the skies above Coruscant exploding with fire in the final battle that would determine the fate of the galaxy. When the word finally arrives, the cantina erupts in deafening cheers.</p>\n<p>“The Separatists have surrendered!”</p>\n<p>“The Republic has won!”</p>\n<p>“War is over, finally! War is over, now!”</p>\n<p>~~</p>\n<p>The HoloNet broadcasts every second of the victory parade on Coruscant. Anakin watches Padmé emerge from her Naboo cruiser, draped in rich velvet and glittering silver, her hair fashioned in an intricate, woven bun. Behind her are her husband—the newly elected Senator of Taris—and their three-year-old daughter. The camera zooms to Padmé's radiant, smiling face, before lowering to the swell of her belly, thinly concealed beneath her pleated dress. A part of Anakin aches deeply, knowing that their beautiful children will never exist in this life, but he braves a smile nonetheless, wishing Padmé all the happiness in the galaxy.</p>\n<p>Obi-Wan receives a medal for his courage, markedly for his ingenious tactics during the last battle of Coruscant, that allowed the Republic to infiltrate the Separatist battleship and reveal Chancellor Palpatine as the mastermind behind the Sith ploys. Anakin watches as he steps onto the platform, clad in white Jedi robes that is somehow both modest and stunning, a simple smile on his lips as he bows before the young Naboo Senator. Obi-Wan Kenobi—the name will be remembered in history as a fearless warrior, a cunning strategist, a noble Master, and the only Jedi to have defeated two Sith Lords in the darkest years of their millennia.</p>\n<p>Some find it enigmatic that a revered Jedi such as Obi-Wan has refused to take a learner, but Anakin supposes it’s fitting that Obi-Wan would have no one else as his Padawan, just as Anakin would have no one else as his Master.</p>\n<p>Fate does bring them together, despite Anakin’s adamant refusal to step anywhere near Coruscant, Alderaan, Naboo, any and every system that evokes the hauntingly sorrowful memories of lifetimes ago. His speeder breaks on the skylanes of Bespin, forcing him to pull over by the pedestrian paths beneath.</p>\n<p>“Blasted thing,” he curses under his breath, bending to inspect the black smoke gushing from a busted pipe. He will need to find a replacement before rewiring the generator, which of course, will require the expenditure of his remaining credits.</p>\n<p>Sighing, Anakin straightens beside his speeder, stretching out his lower back as he contemplates his methods. At least he is in the metropolis of Bespin instead of an arid, inhospitable planet like Tatooine.</p>\n<p>Something familiar tremors in the Force, and his eyes immediately lock to blue-gray irises from across the street, like the positive pole of a magnet finding the opposite. Obi-Wan stands motionless amidst the bustling crowd, a cacophony of emotions thinly disguised by a calm veneer. Only when a passing Rodian collides against his shoulder does the Jedi jolt into action.</p>\n<p>Anakin watches with rising panic as Obi-Wan weaves against the current of bodies between them. He contemplates running away, knowing he can certainly lose a pursuer in such a busy metropolis. Something keeps him planted to the ground, however, as his body shudders with anticipation, teeming with both wild hope and crushing dread.</p>\n<p>Obi-Wan is close enough now, for him to recognize all those obscure emotions in the stormy blue—bemusement, intrigue, trepidation, and a touch of recognition.</p>\n<p><em>Please</em>, Anakin squeezes his eyes shut, pleading to unknown deities and wishing he could disappear, <em> Nothing good will come of this. The galaxy will be torn apart. Please, please, leave.</em></p>\n<p>A hand reaches to his face, fitting the curve of his cheek perfectly into the calloused palm. Anakin’s breath hitches, hot tears welling at the corners of his eyes. He feels a thumb swipe along his quivering lashes, catching on to the first drop before it falls.</p>\n<p>“Obi-Wan,” Anakin rasps—agony ripping at his heart, shame coloring his cheeks. Finally, he garners the courage to open his eyes.</p>\n<p>Obi-Wan smiles through unshed tears. “I missed you, my friend.”</p>\n<p>~~</p>\n<p><em>It has been said something as small as the flutter of a butterfly's wing can ultimately cause a typhoon halfway around the world.</em><br>—Chaos Theory</p>"
}