{
  "id": "6314905",
  "url": "https://archiveofourown.org/works/6314905?view_full_work=true",
  "author": [
    "bear_bell"
  ],
  "title": "Seriously, on the Jumbotron?",
  "rating": "Explicit",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Avengers (Marvel Movies)",
    "Iron Man (Movies)",
    "Captain America (Movies)"
  ],
  "relationships": [
    "James \"Bucky\" Barnes/Steve Rogers",
    "James \"Bucky\" Barnes/Steve Rogers/Tony Stark",
    "Tony Stark/OFC (minor)",
    "Past Tony Stark/Pepper Potts",
    "James \"Bucky\" Barnes/Tony Stark",
    "Steve Rogers/Tony Stark"
  ],
  "characters": [
    "James \"Bucky\" Barnes",
    "Tony Stark",
    "Steve Rogers",
    "Natasha Romanov",
    "Clint Barton",
    "Bruce Banner",
    "Thor (Marvel)",
    "Jane Foster (Marvel)",
    "Darcy Lewis",
    "Sam Wilson (Marvel)",
    "James \"Rhodey\" Rhodes",
    "Pepper Potts",
    "Ivan Vanko",
    "Tiberius Stone",
    "Edwin Jarvis",
    "DUM-E"
  ],
  "additional_tags": [
    "Natasha Is a Good Bro",
    "Light Angst",
    "Fluff",
    "Threesome - M/M/M",
    "Mentions of Rape",
    "because Tiberius Stone is an ass",
    "jumbled universe/timelines",
    "Tony Stark Needs a Hug",
    "Friends to Lovers",
    "Dirty Talk",
    "Humor",
    "Team as Family",
    "Sexy Times",
    "Possessive Steve Rogers",
    "Possessive Bucky Barnes"
  ],
  "language": "English",
  "series": "",
  "published": "2016-03-21",
  "completed": null,
  "words": "9,677",
  "chapters": "1/1",
  "comments": "186",
  "kudos": "14,152",
  "bookmarks": "2,571",
  "hits": "167,278",
  "summary": "<p>When Bucky was rescued from Hydra, Steve took him to Avenger's Tower and the two of them started right back up where they'd left off. Things were going well, until Natasha started gossiping.</p>\n<p>Bucky couldn't believe he hadn't noticed before.</p>",
  "notes": "<p>I just saw the trailer for Civil War, and it made my soul hurt (I hate it when the people I love fight). I wrote this to cheer myself up. Hope it cheers you up, too!<br>Warning: There are vague mentions of rape. Nothing specific or graphic, but it's there.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>And BAM! I have officially joined the legions of people who have posted erotica online! Is there an official club for that? Do I get a membership card or achievement plaque? </p>\n<p>I was trying to do Possessive!Steve and Possessive!Bucky, and I hope it came across as such. Tell me what you think!</p>",
  "text": "<p>\"Aren't you a superhero? Can't you do something about this?\"</p>\n<p>Sleepy as he was, Steve rolled his eyes as Bucky squirmed and fidgeted below him. After all, Bucky was a big boy and he could take Steve's weight – Even during the war, after Steve had been given the serum and before Bucky's had been activated by Hydra, Bucky could fall asleep with Steve's form draped across his chest, stomach, and legs.</p>\n<p>\"I have enhanced strength, speed, agility, and tactile capabilities,\" Steve listed. \"I do not have the ability to shrink and grow at will.\"</p>\n<p>\"You should probably fix that,\" Bucky groused. \"Talk to Fury. Or Bruce. Maybe write to your state's congressman.\"</p>\n<p>Steve shifted atop Bucky, pressing his face into Bucky's ribs and willing the man to calm down.</p>\n<p>Most of the time, Bucky was right as rain (except for when he was having vivid flashbacks to the days when he was under Hydra's control). He loved Steve. Unconditionally. Always. He'd loved Steve before the serum, after the serum, during the war, and decades later when both of them were taken off the ice. Bucky loved that Steve could now hold him in his arms with Bucky's head tucked under his chin and big steel-cable arms tightly wrapped around him. And Bucky loved to hold Steve the same way, just as he had been for years – decades, now.</p>\n<p>Every now and again, though, Bucky would get into a mood where he wanted nothing more than to roll Steve into a compact ball and completely envelop him, the Bucky used to when Steve was still small, frail, and sick.</p>\n<p>For some reason, the notion was far more comforting to Bucky than it was or ever had been for Steve, and Bucky only ever got into these moods when he was worried about something.</p>\n<p>Smoothing his hands over Bucky's chest and flesh shoulder, Steve grumbled mutinously as Bucky continued to shift beneath him.</p>\n<p>\"What's the matter, Buck?\" Steve finally murmured.</p>\n<p>\"Tell Coulson to fuck off,\" Bucky immediately demanded, and Steve blinked in surprise because Bucky <em>liked</em> Coulson.</p>\n<p>\"Bucky?\" Steve pressed.</p>\n<p>\"Tell him to send Natasha or Barton. Hell, tell him to send Stark. I just... Cripes, Steve, do you have to work so damn much?\"</p>\n<p>\"I hardly work at all! SHIELD only sends me on missions once a month, if even,\" Steve pointed out as he propped himself up on his elbow to get a real good look at Bucky. \"And the rest of the time, I'm here in New York.\"</p>\n<p>\"That's right. Here, in New York. Not in Italy getting into God knows what trouble for who knows how long-\"</p>\n<p>Ah. Italy, where Bucky fell from the train and everything went wrong.</p>\n<p>\"I'll ask Clint to take this one,\" Steve allowed.</p>\n<p>Bucky settled and calmed as soon as Steve made this declaration. Steve was finally able to properly lay down and rest, pressing his face into Bucky's skin as the other man began running his fingers through Steve's hair.</p>\n<p>\"I miss it,\" Bucky eventually admitted just before Steve drifted off to sleep. \"I miss how small you used to be, so if I didn't want you going anywhere or doing anything, all I had to do was wrap my arms around you and hold you against me, and you couldn't do a damn thing about it.\"</p>\n<p>Steve remembered those days well. Usually, Steve had been fixing to do something stupid and get himself hurt,and Bucky was just looking out for him, but <em>oh</em>, it had pissed Steve off when Bucky pulled something like that.</p>\n<p>So he responded to Bucky's confession with a muttered, \"Ass.\"</p>\n<p> When Steve moved into the Tower, he had Tony. When Bucky moved in, he had Natasha.</p>\n<p>\"What do they even do together?\" Tony muttered when Steve wandered down to the workshop.</p>\n<p>Clint was in Italy and Natasha always got a little high strung when the archer wasn't within shooting distance, so Bucky had taken it upon himself to distract her.</p>\n<p>\"They speak Russian, people watch in Central Park, and then go watch old film noir movies and harass the other people with them in the theaters. I'm not invited,\" Steve answered as he looked around for one of his sketch books – he was <em>sure </em>there were at least a dozen in the workshop, but he had discovered that things had a tendency to mysteriously move around (DUM-E) or disappear entirely (this one he blamed on Tony) when left sitting around Tony's shop. Sure enough, as Steve looked around, he could see two of his sketchbooks in plain view. One was sitting on top of a pile of Stark Industries paperwork but beneath several used coffee mugs, and the other one was being used to prop up the corner of a tool bench where one of it's wheels had broken off.</p>\n<p>With a sigh, Steve removed the dirty coffee cups from his sketch book and carried them to the sink on the far side of the room, then he grabbed his sketchbook from atop the mound of papers. He wandered over to the couch sitting catty corner from Tony's work bench, originally placed there as something for Tony to fall into when he went on work binges and forgot to sleep. These days, though, the couch was usually occupied by Steve, Bucky, or both of them.</p>\n<p>\"You're not invited because they're doing secret spy things that they can't do if they're noticed by anyone, and they're probably being mean to people. You, however, are a beacon of moral superiority. The beacon part meaning that if you joined them, they wouldn't go <em>anywhere</em> unnoticed, and the moral superiority part meaning that you'd be a total kill joy when they're trying to scare the bejesus out of innocent, peaceful movie goers.</p>\n<p>\"Hey, when I'm done with this, let's go have ourselves a little outing of our own,\" Tony suggested. \"We'll speak nothing but slang, go to Central Park and have dozens of people follow us around and watch us while we do mundane things like smile at children and feed ugly birds, and then we can go to a baseball game and heckle the Yankees.\"</p>\n<p>Steve grinned at Tony's suggestions. When they'd first met and started living together, he and Tony had hated each other. Like, <em>they couldn't be left alone in a room without adult supervision</em> hated each other. That had been directly after the Battle of Manhattan, the Avengers had still been learning to work with each other, they were widely distrusted by the public, and the city was still a mess.</p>\n<p>Three months after the attack, the Avengers as a team had been gifted tickets for a Yankees vs. Dodgers game. When they attended, most of the Avengers sported Yankees hats because they were officially New Yorkers. Steve would sooner attack a Hydra base by himself than wear any Yankees gear, however, so he had supported the Dodgers. When he saw Tony wearing his own Dodgers hat, Steve thought the older man had been making fun of him. Tony soon set the record strait, stating, \"I lived in LA for over half of my life. I've been to more Dodgers games than you have, buddy.\"</p>\n<p>They'd had so much fun at the game and the publicity had done so well in boosting public support for the Avengers that Tony and Steve began to regularly attend Dodgers games together after that, even if the team wasn't in New York. They also occasionally went to Yankees games just to be jerks.</p>\n<p>As Steve settled in to sketch while Tony finished up his project, Steve smiled, thinking that if spending time with Natasha made Bucky as happy as spending time with Tony made him, then they were lucky to have these people as friends.</p>\n<p>In fact, spending time with Natasha <em>did not</em> make Bucky feel particularly happy that day.</p>\n<p>\"What, are you on your period or something?\" Bucky asked when harassing the pretentious hipster couple sitting a few rows in front of them hardly garnered so much as a twitch from the woman.</p>\n<p>Natasha responded by delivering a vicious kick to Bucky's calf – in the exact same place where he'd been injured while sparing with Thor and Clint a week prior. Bucky was a professional, though, so he gave no indication as to how much the kick hurt.</p>\n<p>Natasha knew regardless.</p>\n<p>\"This is your fault,\" she muttered as Humphrey Bogart and Mary Astor had a heated confrontation on the big screen in front of them. \"This was supposed to be <em>Steve's </em>mission. But you bat your eyelashes and <em>as usual</em>, Steve folds faster than one of Tony's suits.\"</p>\n<p>\"Why do you care?\" Bucky asked. \"The mission is nothing Barton can't handle.\"</p>\n<p>\"We had plans,\" Natasha stated, and she began throwing popcorn at the couple in front of them so that it stuck in their hair.</p>\n<p>\"Date plans?\" Bucky asked while suggestively wiggling his eyebrows at her. Because no matter how much she and Clint both denied it, he <em>knew</em> they were in some sort of relationship together.</p>\n<p>\"Not the kind of date you're thinking of,\" she answered. </p>\n<p>At this announcement, Bucky gathered himself for story time. Natasha in gossip mode was his favorite Natasha.</p>\n<p>\"We were going to put some real time and energy into finding someone to set Tony up with,\" the woman finished.</p>\n<p>\"Stark?\" Bucky asked, blinking. \"I thought he was married to his machines.\"</p>\n<p>\"Oh, Bucky,\" the woman sighed. \"I sometimes forget that you haven't been around the tower for that long. Tony Stark is a total horn dog. He only stopped sleeping around when he got the arc reactor. Huh, you weren't around for Pepper, either.\"</p>\n<p>\"Pepper Potts?\" Bucky asked. \"Nat, I've met her dozens of times. She's in Stark's workshop every other day.\"</p>\n<p>\"Yeah, but Tony and Pepper used to date,\" Nat revealed. \"For a while, actually. They broke up about half a year after the Avengers were formed.\"</p>\n<p>\"Why has no one told me this?\" Bucky asked, his eyes wide.</p>\n<p>Natasha shrugged. \"I guess no one thought to since Tony and Pepper were simply... common knowledge. Like how the sky is blue, and Bruce likes tea. Tony and Pepper used to date, and now they don't, and all of it happened while the <em>most</em> of the world was watching.\"</p>\n<p>\"Why didn't <em>Steve</em> tell me?\" Bucky wondered, because once his programming had been broken and he had joined the Avengers at the tower, Steve had done a pretty good job of giving him the down low on his teammates and catching him up with all of their hurdles they'd jumped and the sore spots they'd acquired over the years.</p>\n<p>Beside him, Natasha responded to Bucky's idle question by making a very, very strange noise, then she said. \"Oh.\"</p>\n<p>\"<em>What</em> oh?\" Bucky uneasily pressed.</p>\n<p>\"Oh, I just remembered that most of the reason Pepper broke up with Tony was because she couldn't handle dating a superhero, and the rest of the reason she broke it off was because of Steve.\"</p>\n<p>\"<em>Excuse me?</em>\" Bucky replied, his voice raising to inappropriate volumes in the small theater. After an obnoxious amount of shushing had made its way around the theater, Bucky hunkered down in his seat and muttered, \"What are you talking about?\"</p>\n<p>\"I'm talking about how Steve and Tony were dancing around each other for months.\"</p>\n<p>\"<em>Steve</em> was dating Tony Stark?\" Bucky asked, feeling as if he was falling from that train all over again.</p>\n<p>\"Hardly,\" Natasha dismissively answered as she popped some popcorn into her mouth. \"The team thought it was only a matter of time before someone made a move, but then you were rescued from Hydra and it just never happened. Things were pretty tense around the tower for a couple of weeks, but it was nothing compared to when Tony and Steve first met, or when Pepper and Tony broke up, and they got over it and moved on.\"</p>\n<p>Bucky stared at the movie but didn't really process what was happening on the screen as Natasha continued talking.</p>\n<p>\"Tony got over Steve <em>ages</em> ago. But it's obvious he's lonely. He simply doesn't put himself out there anymore. Not after what happened with Obadiah Stane. So Clint and I were planning to take Tony out on the town or try setting him up with someone from SHIELD. We thought we'd try something to help get him out of this funk, you know?\"</p>\n<p>Bucky <em>didn't</em> know. He had never noticed if Stark was in some kind of <em>funk</em> one way or the other.</p>\n<p>Once a week, the Avengers and Friends had movie nights. These nights could go one of two ways, and it was all dependent on Tony Stark's energy level.</p>\n<p>Bucky, Clint, Bruce, and Darcy liked it when Stark was energetic and kicking. If Stark was in fully swing, it meant there would be incessant talking during the movie – the group would debate who's ass looked best in which pants, how corny the special effects were, or how plausible the science. When Tony was in a talking mood, the group usually ended up watching either action movies or bad horror movies (they'd once watched <em>Lincoln vs. Zombies</em> three weeks in a row because it was pure comedy gold).</p>\n<p>Natasha, Thor, Steve, and Jane much preferred the evenings when Stark was sleepy and quiet. That meant there was no running commentary during the movie, and they could watch their soulful romantic dramas without anyone interjecting with, \"I'd tap that.\" And when they watched epic tales of conquest and valor, no one interrupted the heroic speech right before the final battle with, \"Wait, that's your big plan? You're good men fighting for a good cause, so just... give it all you got, guys, and hope for the best?!\"</p>\n<p>This was one of the latter nights, where just as everyone settled into their seats and prepared to pick which film to watch, Tony Stark wandered into the commons with his feet dragging and his eyes half closed.</p>\n<p>\"Damnit,\" Clint muttered when he realized that Tony would probably be asleep within the first five minuets of the movie. \"I was in the mood for some senseless violence.\"</p>\n<p>\"Maybe next week,\" Jane happily hummed, already trying to talk Natasha and Steve into watching some Jane-Austinesque period piece.</p>\n<p>Stark shuffled across the space to the other side of the room without paying much attention to his surroundings. That was why he didn't notice the man sitting in his recliner until it was almost too late.</p>\n<p>Blearily staring at the person sitting in his favorite chair, the one he always sat in, Stark asked, \"Who the hell are you?\"</p>\n<p>\"I'm Sam Wilson. We've met, like, two dozen times. You gave me a room and a key and promised me unlimited upgrades to my wings in an attempt to bribe me into moving here from DC.\"</p>\n<p>Blinking, Stark said, \"That... sounds like something I would do. Did my attempts to bribe you work?\"</p>\n<p>\"Yes,\" Sam stated. \"Yes they did.\"</p>\n<p>\"Is that why you're sitting in my chair?\"</p>\n<p>\"Aww, Tony, your spoiled rich kid is showing,\" Darcy called. \"Leave the cute new guy alone and come sit on our couch with us.\"</p>\n<p>\"Can I use your boobs as pillows?\" Stark asked, already stumbling away from the recliner and toward the couch were Darcy and Thor were sitting, waiting for Jane and the others to finish picking the evening's movie.</p>\n<p>Steve and Jane both stuttered at Tony's rude and kind of offensive question, but Darcy grinned. \"Sure you can! That's what they're there for!\"</p>\n<p>Bruce <em>clearly</em> wanted to argue that particular point, but wisely kept his mouth shut.</p>\n<p>Sure enough, ten minutes into the movie, Tony was asleep. Ten minuets after that, Darcy was muttering, \"Okay, not that I don't love Tony Snuggles, but the guy's not as light as he looks. Thor?\"</p>\n<p>Thor had been cuddling with Jane. However, at Darcy's plea, he easily turned and pulled Stark over so that instead of sprawling across Darcy, he was laying across Thor and Jane's laps.</p>\n<p>\"He's like a giant cat!\" Darcy cooed.</p>\n<p>\"Except worse,\" Clint agreed.</p>\n<p>Bucky was watching, now. He was watching for any sign, any indication, that Steve or Stark were still interested in each other.</p>\n<p>What he noticed was that Steve treated Stark almost exactly the way he treated Bucky, except without the kissing or the sex, and that he spent a great deal more time in Bucky's company. Otherwise, though...</p>\n<p>It kind of set Bucky's teeth on edge. He wasn't sure how he hadn't noticed before, except that maybe he hadn't wanted to.</p>\n<p>Stark was harder for him to piece out.</p>\n<p>One day, when he was looking for Steve, he went to Stark's workshop half expecting to find him there.</p>\n<p>When Stark saw who it was that had wondered in, he smiled and told Bucky, \"Hey. You just missed Steve. He and Bruce went into SHIELD to do some work. Want to keep me company while my science buddy is out?\"</p>\n<p>Stark had surprisingly good taste in music, and Bucky had always liked it when the music was so loud that he almost couldn't hear himself think. Therefore, Bucky agreed, and he went to lie down on the couch in Stark's workshop.</p>\n<p>Before he could properly get comfortable, though, something jabbed him in the back. Reaching between the couch cushions, he pulled out one of Steve's notebooks. Settling, he flipped through the book, noting the subject matter of the pictures and the dates scribbled into the corners of each page. There were groups of pages where the dates were all within a few days of each other, and then from one group to the next, there would be a massive gap in time, spanning anywhere from weeks to months.</p>\n<p>The first half of the notebook was full of drawings and sketches dated back to before he was rescued from Hydra. Almost every picture was of Tony. Pictures of Bucky filled the last half of the book.</p>\n<p>\"Hey, Stark?\" Bucky called.</p>\n<p>\"What? Yeah?\" the man answered, glancing up from whatever project he was working on.</p>\n<p>Bucky wasn't sure what he meant to ask, so settled for, \"Want to go get some pizza?\"</p>\n<p>\"I could go for a pie, sure.\" And Stark must have really been hungry, because he eagerly abandoned his work.</p>\n<p>While they sat in a tattered booth and ate Brooklyn style pizza, Bucky told Stark, \"I hear you used to date Pepper.\"</p>\n<p>\"A while ago, yeah,\" Stark answered, and it had been long enough that he didn't show any discomfort with the subject.</p>\n<p>\"What happened?\"</p>\n<p>Stark shrugged. \"Lots of things. Pep has always been my best friend. And after everything that happened with the arc reactor, she was all I had. Turns out 'you're the only person I can trust' isn't very good ground work for a healthy, long term relationship, though.\"</p>\n<p>Bucky wanted to ask about the Avengers' (Steve's) part in the breakup, but he made the mistake of starting his next question with, \"Natasha told me-\"</p>\n<p>And Stark immediately responded by throwing down his pizza and pointing a finger at Bucky. \"She talks to you!\" he cried, except that it sounded like an accusation. \"I knew it! What's she like? I mean, what's she <em>really</em> like? She's not as murderous and level-headed as she makes herself out to be, right? Right?!\"</p>\n<p>Bucky wasn't sure how to explain that everything Stark knew about Natasha was real, except that she was also an insatiable gossip. So he settled for saying, \"Of course she is.\"</p>\n<p>The next time they had a movie night, Stark wandered into the commons looking alert and alive. He introduced himself to Sam <em>again</em>, and they squabbled over the recliner for a bit, but then Stark settled for sitting at Bruce's feet and leaning against his legs as they watched the new <em>Star Trek</em> movie.</p>\n<p>Stark and Darcy spent the entire movie arguing over Chris Pine and Zachary Quinto, and Darcy ended the argument by declaring, \"I'd die happy if I was the filling in a Chris-Zachary sandwich!\"</p>\n<p>\"Here, here,\" Jane mumbled.</p>\n<p>\"Hey!\" Stark cried. \"You've already got yourself a God of Thunder! Don't be stingy!\"</p>\n<p>The conversation somehow devolved from there, and no one paid much attention to the end of the movie when they were treated to the much more entertaining spectacle of Thor going into great detail (broken furniture included) of how he would defend Jane's honor in a battle against the crew of the <em>Enterprise</em>.</p>\n<p>Bucky wasn't sure how he'd been roped into this. He'd spent the morning with Steve, helping him train new SHIELD recruits, and he'd just wanted a few moments to enjoy some food in SHIELD's cafeteria.</p>\n<p>Instead, he found himself studying the head shots and accompanying biographies of some very intelligent, rich, and powerful people.</p>\n<p>\"Isn't this woman in prison for attempting to kill a Chinese embassador?\" he muttered around the food in his mouth.</p>\n<p>\"Tony likes a good challenge,\" Clint told him.</p>\n<p>Rolling her eyes, Natasha snatched the page from Bucky, placing it in a pile with the the other options that she had already deemed unsuitable. \"Clint, I know that Villainous Tony is your favorite Tony, but <em>nyet</em>.\"</p>\n<p>\"He gives me the best toys when he's in morally ambiguous moods, though,\" Clint argued.</p>\n<p>\"I will kill you,\" Natasha promised, \"and I will let Pepper help.\"</p>\n<p>\"<em>Fine</em>,\" Clint pouted. \"Who's your pick, then?\"</p>\n<p>\"Timothe Dubois,\" Natasha answered proudly. \"A French chemist with a fantastic smile and a great ass. His family has money, and most of them are philanthropists, but Timothe decided to actually make something of himself. He's smart, handsome, driven – but not to the point that he'd need to use Tony as a crutch.\"</p>\n<p>Bucky was surprised when he saw the man's picture and realized that he was older than Stark. It was hard to imagine the two men together.</p>\n<p>\"Well my vote's for Kiraz,\" Clint announced.</p>\n<p>\"Who?\" Bucky asked, because he didn't recall seeing a name like that when he was sifting through the profiles Clint and Natasha had thrust at him.</p>\n<p>Natasha rolled her eyes as she explained, \"She's a Turkish super model – former super model. She just announced that she intends to follow her life long dream of going to veterinary school, and she wants to open a refuge/rehabilitation center for mistreated and abandoned exotic animals.\"</p>\n<p>\"And she's already in New York, so it won't be difficult to arrange a cute-meet,\" Clint finished.</p>\n<p>Bucky almost suggested that the two of them should put this much energy into their own relationship, but then he realized that this was probably their form of Date Night. Therefore, he kept his mouth shut as he inspected the photos of the people Clint and Natasha thought would be suitable candidates as dates for Stark.</p>\n<p>\"Why are you getting involved?\" Bucky asked. \"Seems to me, if the guy wanted to date someone, he'd just go out and date someone.\"</p>\n<p>\"He's given up,\" Clint stated. \"He figures if he couldn't get it to work with Pepper, then he probably won't work with anyone.\"</p>\n<p>\"We're battling almost forty years of poor self esteem and near constant betrayal,\" Natasha said with a nod. \"Tony can use all the help he can get.\"</p>\n<p>Their next movie night was a sleepy one. Clint had gotten injured during a battle that day, so when Stark draped himself over an entire couch and started falling asleep as soon as he wandered into the common room, Clint collapsed on top of him. Their loud snoring kind of killed the mood as the group tried to watch Jack and Rose's tragic romance.</p>\n<p>Bucky was in one of his moods, Steve noticed. The other man pressed tight against his back and kept Steve tightly wrapped in both arms, even though that meant that Steve was lying on top of Bucky's flesh and bone arm, and the limb was no doubt numb within minutes.</p>\n<p>\"What is it?\" Steve asked.</p>\n<p>\"What would you have done?\" Bucky wondered. \"If you hadn't gotten me away from Hydra?\"</p>\n<p>\"I would have kept going after you until I did,\" Steve immediately responded.</p>\n<p>\"No, I mean... What if Hydra never had me. What if I had died... And you were here alone, without me. What would you have done?\"</p>\n<p>Steve shivered, remembering the aching loneliness that had enveloped him after he had come out of the ice, even though that particular ache had begun before he'd gone into the water.</p>\n<p>\"I guess I would have done the same as before we knew you were alive. Take it one day at a time and try to survive,\" Steve finally answered.</p>\n<p>\"Is that what you were doing? Surviving? You were never happy?\" Bucky pressed.</p>\n<p>\"I was sometimes,\" Steve allowed, thinking of those Dodgers games that Tony had taken him to. It was nice to get away from New York, from the Avengers, from SHIELD, to dress up like normal people and do normal things, and for a little while Steve could pretend that he was someone else. Idly, he wondered when the next Dodgers game was. \"It got better when I moved into the tower and started making friends. There was always something missing, though. I may have started healing from loosing you, but I was a long, long way off from being okay... Why do you ask?\"</p>\n<p>\"Just thinking,\" Bucky muttered.</p>\n<p>Steve waited patiently. Bucky could be a real knucklehead sometimes, but Steve could out-stubborn him any day of the week.</p>\n<p>And sure enough, Bucky eventually told him, \"Natasha and Clint are trying to set Stark up on a date.\"</p>\n<p>\"Shit,\" Steve breathed, sitting up.</p>\n<p>\"What?\" Bucky asked, and he sat up as well. \"Why's that such a bad thing?\"</p>\n<p>\"It's not – I don't – You weren't there,\" Steve realized.</p>\n<p>\"Where?\" Bucky asked with a frown.</p>\n<p>\"You weren't there when he and Pepper broke up. Buck, he was drinking constantly, he was unnecessarily reckless in the field, and whenever anyone tried to talk to him, he looked trapped. It was <em>horrible</em>. I can't believe they're setting him up to be in that position again.\"</p>\n<p>\"Natasha said he's been in a funk,\" Bucky told him.</p>\n<p>\"That's not...\"</p>\n<p>Steve was going to say <em>that's not true</em>, but then he realized that it was. Tony's drinking was under control, he wasn't endangering himself and his teammates during battle anymore, and he made an effort to join the team during group events. Steve had been so caught up in Bucky, though, in Bucky being alive, back, safe, and happy, that Steve had stopped really watching Tony.</p>\n<p>\"He doesn't smile like he used to,\" Steve realized.</p>\n<p>The Avengers had their demons. Steve and Bucky had Hydra. Thor had Loki and a great deal of other Asgardian and otherworldly enemies. Bruce had members of the US military. Natasha and Clint had a veritable army of assassins and spies and hostile governments they had managed to piss off over the years.</p>\n<p>Tony's were the worst, though.</p>\n<p>\"How are they the worst?\" Bucky asked as he, Steve, and Sam hurried through midday traffic back to Avengers Tower.</p>\n<p>\"Seriously,\" Sam agreed. \"I thought that Hydra was the Big Bad. Are you saying there's something out there worse than them, and it isn't Thor's brother?\"</p>\n<p>Steve shook his head, \"Not like that. I mean... Hydra attacks Captain America because Captain America is a symbol of everything they hate. Loki attacks Thor and Earth because he's crazy. But these guys... they aren't attacking Iron Man or a symbol. They're attacking Tony.\"</p>\n<p>\"Who are they?\" Bucky asked from the passenger seat as Steve drove like a madman to get back to the Tower. \"What's the situation?\"</p>\n<p>Steve took a deep breath, trying to dispel his panic. He wondered how freaked out Bucky and Sam must be after his cryptic announcement of, \"The Tower's under attack. We need to go.\"</p>\n<p>\"Tiberius Stone grew up with Tony. They were... What's the word Darcy uses? Enemy-friends?\"</p>\n<p>\"Frienemies,\" Sam supplied.</p>\n<p>\"Right,\" Steve said with a nod. \"Long story short, Howard used Tony's relationship with Stone to spy on the company run by Stone's family, and the investigation ended with Stone's parents in jail and his family's company destroyed. Stone blamed Tony. And now he's teamed up with Ivan Vanko.\"</p>\n<p>\"Whiplash?\" Sam asked with a hiss.</p>\n<p>Steve nodded. \"Jarvis sent me an SOS. They're attacking the Tower. Tony is in trouble.\"</p>\n<p>Bucky had done a bit of reading up on Whiplash. The villain was part of Iron Man's file, so the name was familiar.</p>\n<p>Tiberius Stone was new.</p>\n<p>Bucky didn't understand what Steve meant about the duo attacking Tony and not Iron Man, though. Not until they got to the tower and found JARVIS offline, Pepper bleeding and unconscious in her office, and the rest of the Avengers trapped in the common area of the tower while Stone and Vanko ganged up on Tony in his workshop.</p>\n<p>\"You still pretend to be good,\" Bucky heard Vanko taunt as the man slowly and purposefully dismantled one of Tony's Iron Man suits so that he could get at one of the arc reactors. \"The thing you are really good for is destroying people, though.\"</p>\n<p>\"He gets it from his father,\" Stone agreed as he stood over Tony with a gun trained on his head. \"It's the <em>only</em> thing he got from the guy.\"</p>\n<p>Stark was on the ground, his face bloody, but Bucky was gratified to see that he'd gotten in a few hits of his own before going down.</p>\n<p>The two villains weren't counting on Sam, Steve, and Bucky arriving at the tower so quickly (why did everyone assume that Steve drove like an old man?), and they managed to quickly subdue the two attackers.</p>\n<p>The damage had been done, though, and that night, Bucky saw what happened when Tony Stark drank.</p>\n<p>He was a happy drunk, at first. He was friendly, and charming, and the life of the party. Halfway into the bottle, though, he started to spiral. He made a point of picking apart his every inadequacy and putting it on display, and then starting in on the people around him. And damn, but Stark was good at finding people's sore spots.</p>\n<p>\"What would you know?\" he asked Bucky at one point during the evening. \"You weren't even here for the worst of it! We were the ones who had to put him back together and keep his head above water!\"</p>\n<p>That particular analogy had the duel effect of making Steve cringe, as well.</p>\n<p>Eventually, they called Pepper, even though she was spending the night at the hospital. It turned out that she couldn't do much for this particular tantrum, though.</p>\n<p>\"Call Rhody,\" was her suggestion. \"He and Tony actually met during the whole Tiberius-Viastone destruction disaster. He's the only one who can pull Tony out of it when he gets like this.\"</p>\n<p>\"Pulling Tony out of it\" ended up meaning that the Avengers had <em>two</em> drunk, raging men on their hands. They watched in awe, though, as Rhodes accomplished what the rest of them couldn't: he distracted Stark from focusing on his mistakes and any mistakes made by the people around him and he got Stark talking about Stone's mistakes, instead.</p>\n<p>Which was terrifying in its own way.</p>\n<p>\"That son-a-ma-bitch,\" Stark slurred, and Rhodes repeated the sentiment while waving around a bottle of beer. \"One time, that ash-hole – he made me think...\"</p>\n<p>\"I know,\" Rhodes told him.</p>\n<p>\"I thought I got <em>so</em> shit faced at a party, that I <em>raped</em> a girl. He made me think that!\"</p>\n<p>\"But he did it!\" Rhodes cried.</p>\n<p>\"And she – she was so, <em>so</em> scared of him that she wouldn't go ta the cops,\" Tony raged.</p>\n<p>\"Son-a-ma-bitch,\" Rhodes muttered yet again.</p>\n<p>\"And Jarvis – Jarvis had this-this pearl lace. Necklace. Belonged to his mother. And one time Stone – that son-a-ma-bitch Stone – durin a party, he convinced some lady that it was <em>her</em> necklace, and Jarvis had stole it from her! So her husband's yellin, in the middle of the Christmas party, and this strange woman is tryin in take his mother's necklace, and Stone just keeps laughin!\"</p>\n<p>\"It was'n your fault,\" Rhodes announced. \"Guy talked and talked and talked and talked and talked until he had your head spinnin. Did it to everyone. Thought there was somethin wrong with everone but him, and he make everone else act just as crazy as him. Like... like rabies. He had rabies. And he gave um to everone else.\"</p>\n<p>\"Wish he did have rabies,\" Stark muttered.</p>\n<p>\"Good reason to put him down,\" Rhodes agreed.</p>\n<p>Rhodes and Stark raged about Tiberius Stone for close to an hour that night.</p>\n<p>Rhodes got obstinate when it was time to go to bed, and it took both Steve <em>and</em> Clint to bully him into a guest room.</p>\n<p>Bucky was left with Stark.</p>\n<p>Stark had wound down by that point, and he was just tired. Tired and sad and worn.</p>\n<p>\"You were lucky,\" Stark told him as Bucky dumped the man into his bed.</p>\n<p>\"Lucky about what?\" Bucky asked. Because ever since Hydra, he didn't <em>feel</em> lucky.</p>\n<p>\"Growin up. Lucky about having Steve. <em>I</em> had Tiberius Stone.\"</p>\n<p>Bucky had a hard time falling asleep that evening.</p>\n<p>Natasha and Clint arranged a party in which both Kiraz (<em>just</em> Kiraz, no last name) and Timothe Dubois both attended. They put money on who Tony would end up going out with.</p>\n<p>The winner ended up being Bruce, who introduced Tony to Miranda Grosser, a SHIELD medic with a dry sense of humor and take charge attitude.</p>\n<p>It helped that she was the one who made the first move and asked Stark out before he could make excuses and wander off to another conversation.</p>\n<p>A hard glance from Bruce convinced him to give the woman a winning grin and tell her, \"Sure. Pick you up at 8:00?\"</p>\n<p>It took a few weeks, but once Stark decided that he liked Miranda, and once Bruce convinced him that she really liked him, and once Natasha convinced him that the woman wasn't a SHIELD plant, and once Pepper smacked him over the head, Stark buckled down and really tried.</p>\n<p>Trying turned out to mean loading the Quinjet with flowers so that after a battle, when his sweetheart showed up to treat Natasha and Steve for injuries, he could totally distract her while she was trying to do her job.</p>\n<p>It also meant jetting the woman off to a private island for a weekend away.</p>\n<p>Stark also paid the the New York Philharmonic Orchestra to preform her favorite symphony pieces at the birthday party that SHIELD threw for her (everyone else just signed a card for her).</p>\n<p>Pepper told them that the overly grand gestures were Tony's way of vetting people he wanted to get serious with. He made bad decisions sometimes, and he liked to know early on how people would react to him when he pulled stupid stunts.</p>\n<p>Miranda mostly reacted with a disinterested, unimpressed air. The only time she <em>really</em> got upset with Tony was when he tried to buy her clothing, and she told him that he already had plenty of dolls, and if he wanted to play dress up with his Iron Man suits, he was more than welcome to do just that.</p>\n<p>\"She'll do fine,\" Rhodes said with an approving nod when he heard the story.</p>\n<p>Next, Stark began inviting her to do things with the team. When she finished patching them up after fights, she joined them for their post-battle meals. Next time Stark and Steve went for a Dodgers game in Los Angeles, she went with them to Malibu. Then, she started joining in on movie nights, and Bucky saw Stark smile.</p>\n<p>He hadn't realized that the thing he'd see during the months he'd been living in the tower were Stark's paparazzi smile.</p>\n<p>The difference was tangible. Stark was lighter. Brighter. Goofier. Way, way goofier.</p>\n<p>Stark was a total sap.</p>\n<p>His changed mood began seeping into other areas of his life, as well. He was more social, in general, spending less time in his workshop and doing more work on his tablet in the common areas. He joked with Clint, teased Bruce, and prodded at Natasha. He encouraged Thor's more outlandish behavior instead of simply watching the man with fond tolerance. He went out with Darcy and Jane, and bugged Rhodes to come around more often.</p>\n<p>He was fun to be around.</p>\n<p>For a while, at least.</p>\n<p>After three months, it was obvious that while Miranda genuinely liked Stark and enjoyed spending time with him, she wasn't as invested in the relationship as he was.</p>\n<p>Miranda was a career gal, as were most of the people employed by SHIELD, and work came first. So when she was offered the opportunity to study medicine under one of the best doctors in India on SHIELD's dime, she jumped at the opportunity. She was on a flight out of the US barely a week later.</p>\n<p>Stark was sad to see her go, but apparently his post-breakup blues were nowhere near as dramatic or self destructive as when he and Pepper broke up.</p>\n<p>And apparently, his brief relationship with Miranda was all Stark needed to feel comfortable and confident reentering the dating scene. Over the next few months, he went on dates with both Timothe Dubois and Kiraz, as well as a number of other people that the Avengers and Friends set him up with (Natasha had to have a talk with Darcy about <em>not</em> setting the man up with her college-aged classmates. Darcy responded by asking, \"What about my professors?\").</p>\n<p>He was still friendly. Still outgoing. He didn't retreat back to whatever shell he'd been in when Bucky first met him.</p>\n<p>His smile wasn't the same, though.</p>\n<p>\"Seriously,\" Bucky said, his voice barely audible over the loud music Stark was playing in the workshop that day. \"Do you have a crush on Tony Stark?\"</p>\n<p>Steve had been doing a sketch of the last threat they'd battled as a team – some sort of alien creatures that looked like cats but acted like wolverines. However, at Bucky's question, he flinched so hard that a hard line of graphite smeared across the entire page, ruining the picture. Steve didn't care though. He was staring at Bucky. \"What?\" he asked.</p>\n<p>\"I get it,\" Bucky announced. \"If you do, I mean. When he's not show boating or moping around the tower, he's a fun guy. And he's not bad to look at. And I already know that you have a thing for pushy brunettes with attitude, so-\"</p>\n<p>\"<em>Bucky</em>,\" Steve hissed, his eyes flying over to where Tony sat at his work station, bobbing his head to the music as he alternated his attention between the suit he was repairing and what <em>appeared</em> to be an educational show about various ways to treat leather.</p>\n<p>\"He can't hear you,\" Bucky hedged. \"So admit it. You totally have a crush on him.\"</p>\n<p>\"Okay, maybe, at one time, I was interested in him. I started to like him-\"</p>\n<p>\"You still like him.\"</p>\n<p>\"What, you really think I've been stuck on some other guy while I'm seeing you?\"</p>\n<p>\"No,\" Bucky said, because he'd been watching the two for a while. And sure, he could see shadows of something that may have been there once, but it was like everyone said – there was nothing serious between Steve and Stark, or at least nothing serious that lasted after Bucky was rescued from Hydra.</p>\n<p>The thing was, Bucky was friends with Stark, too.</p>\n<p>In all the months they had lived in the tower together, Stark had never given any indication that he'd held a torch for Steve, and he'd never held it against Bucky for getting in the middle of any dancing around that the two had been doing.</p>\n<p>Bucky was just as welcome in the workshop as anyone else – just as welcome as Steve.</p>\n<p>Bucky and Stark ate Brooklyn style pizza together at least once a week. They went to the shooting range every now and again. And while Stark couldn't stand for anyone else to so much as breath his father's name, he liked listening to Bucky tell stories about the reckless stunts Howard only got away with during the war because he was a civilian, and all of the stupid ways the guy would make a fool of himself in front of the local women whenever the Howling Commandos went into town and let off steam.</p>\n<p>Bucky <em>liked</em> Stark. And he liked it when Stark smiled.</p>\n<p>\"Where did you get that?\" Steve asked when he saw the notebook Bucky was flipping through.</p>\n<p>\"Found it stuffed between the cushions of that couch down in Tony's workshop,\" he confessed.</p>\n<p>Steve sighed. \"I was trying to hide it from DUM-E. Whenever I leave a sketchbook down there, it's mysteriously missing the next time I visit.\"</p>\n<p>\"I was the one to snatch it this time,\" Bucky told him with a grin.</p>\n<p>\"Why?\" Steve asked when he dropped into bed next to Bucky. \"The only time you've ever been interested in my drawing is when I'm doing nude studies.\"</p>\n<p>\"Close enough,\" Bucky muttered, showing Steve the sketch of Tony he was looking at. \"I get it, now.\"</p>\n<p>\"Get what? The crush on Tony that you've suddenly decided I have?\"</p>\n<p>\"Nah,\" Bucky told him. \"That, I already get. I mean, I get what you meant when you said he doesn't smile like he used to. The pictures I see in here? He didn't even smile like that when he was with Miranda.\"</p>\n<p>Steve sighed, studying the picture Bucky was looking at. \"That was his Pepper smile.\"</p>\n<p>\"Yeah? And where was she when you saw him grinning like this? Standing right behind you?\"</p>\n<p>Steve ended the conversation with one of those delightful new sayings that he'd taken to using since waking up in the new century.</p>\n<p>\"Shut up.\"</p>\n<p>It had been happening for a while. Bucky noticed it around the time that Tony and Miranda broke up. He started pointing it out to Steve not long after that.</p>\n<p>It didn't start in earnest until one of Tony's sleepy movie nights, though.</p>\n<p>Ever since Sam stole his recliner, Tony regularly invaded the other couches in the common area. He liked Thor's couch the most for sleepy movie nights, though, because Darcy and Jane liked to cuddle, and Thor was warm.</p>\n<p>Darcy was introducing her new SHEILD nerd tech boyfriend to the group, though, so Thor's couch was full.</p>\n<p>Therefore, Tony collapsed into the spot next to Bucky, where Bruce usually sat.</p>\n<p>When Bruce returned from the kitchen, popcorn in hand, he sighed when he saw Tony occupying his spot, but then moved to sit in the space that Clint and Natasha cleared for him on their couch.</p>\n<p>Tony was asleep within the first five minutes, and most of the room forewent watching the movie in favor of staring at the man as he slept soundly in his place slouched against Bucky's metal arm.</p>\n<p>\"That <em>cannot</em> be good for his neck,\" Sam muttered.</p>\n<p>Rolling his eyes, Bucky repositioned himself and Tony so that the man was lying down draped over Bucky's lap instead of pressed against the cold metal of his arm. There were indentations in Tony's skin from the pressure of his weight against the arm's plating, but Tony slept soundly on.</p>\n<p>And... huh. Bucky had forgotten how comfortable the weight of a non-serum enhanced person could be.</p>\n<p>\"What are you even <em>saying</em>?\" Steve asked.</p>\n<p>\"I'm saying that while I was trying to figure out why you liked the guy so much, I may have started kind of liking him myself,\" Bucky told him.</p>\n<p>This wasn't what their conversation post mini-sex-marathon was usually like, but Bucky <em>may</em> have let some of his dirty talk that evening get a little out of hand.</p>\n<p>\"Come on, don't tell me you haven't thought about it,\" Bucky pressed. Because Steve liked to pretend that he was a prude, but Bucky had been having sex with the guy since they knew what sex even was, and he'd seen enough of some of the more <em>creative</em> portraits Steve had done of Tony. He knew what went on in Steve's head.</p>\n<p>\"Okay, yes, I've thought about it,\" Steve finally admitted. \"But that was <em>ages</em> ago.\"</p>\n<p>\"Well I'm thinking about it <em>now</em>,\" Bucky announced. To make his point, he grabbed Steve's hands and pressed the other man's large palm over his erection. \"I'm thinking of how your dick would look sliding between his ass cheeks-\"</p>\n<p>Steve turned his face to hide his groan in his pillow, even as his hand spasmed and his fingers wrapped around Bucky.</p>\n<p>Chuckling, Bucky pushed at Steve until the taller man was laying on his back, Bucky straddling his hips and licking at his nipples. \"I bet he's loud,\" Bucky muttered. \"I wonder if he's bossy, like you. Or do you think he'd just lie back and let us take care of him? Let us do whatever we wanted? What do <em>you</em> want, Stevie?\"</p>\n<p>Steve was panting, his head thrown back and his eyes closed.\"Buck...\" he muttered.</p>\n<p>\"And?\" Bucky asked, delighted at Steve's reaction. Steve had been sensitive ever since the serum, but damn, Bucky was hardly touching him. He'd always been a little jealous of Steve's vivid imagination. \"Say it,\" Bucky demanded.</p>\n<p>Steve came as he moaned Tony's name, and Bucky grinned into Steve's skin.</p>\n<p>Bucky and Steve always, always, <em>always</em> sat next to each other during movie nights. Until the night when Tony sat between them.</p>\n<p>No one but Natasha seemed to notice, least of all Tony himself. Instead, he, Clint, and Darcy muted <em>Monty Python and the Holy Grail</em> and recited the lines for the entire movie themselves, voices and accents included.</p>\n<p>One day, after a battle, Tony made an off handed comment about all of the spandex clad butts on their team.</p>\n<p>Bucky responded by telling him, \"You're one to talk. Your fine ass is forever immortalized in metal.\"</p>\n<p>Tony turned to him and blinked.</p>\n<p>The next time Tony suggested he and Bucky head for a slice of pizza, Bucky invited Steve to join them, and at the end of the meal, Steve sucked Bucky's fingers clean while Tony sat in the booth across from them and blatantly stared.</p>\n<p>When Tony bought tickets for a Dodgers game in Kansas City, Bucky tagged along. At the game, Tony sat between them. When the Jumbotron panned over the three of them, Bucky braced a hand on Tony's knee while he and Steve leaned over Tony and kissed each other.</p>\n<p>The best was their next sleepy movie night, though, when Tony automatically fell into the seat between them and pulled his feet into Bucky's lap while very aggressively pushing his face into Steve's legs.</p>\n<p>At the end of the night, when the rest of their friends had finished the movie and gone to bed, Bucky and Steve made the executive decision of taking Tony to their room instead of his own for the rest of the evening.</p>\n<p>It was worth it for the expression on Tony's face when he woke up between them the next morning.</p>\n<p>\"I've had dreams that started like this,\" he stated.</p>\n<p>\"Then let's finish it,\" Bucky suggested as he slid his fingers into Tony's underwear.</p>\n<p>When Steve started sucking at Tony's neck – Steve's tongue was magic, Bucky knew – Tony muttered, \"What is even <em>happening</em>?\"</p>\n<p>Bucky and Steve made sure that he understood.</p>\n<p>Bucky was right – Tony was loud in bed. As Steve fingered him, Tony lay on top of Bucky, their erections pressed together, and any speech Tony was capable of more closely resembled nonsensical babble than coherent thought.</p>\n<p>Bucky was the <em>real</em> talker. As Tony writhed on top of him, Bucky cupped Tony's cheek in his hand, keeping the smaller man's attention on him whenever Steve got a little overwhelming. Bucky probably wasn't doing too much to help, though, as he muttered into Tony's ear. \"He's more than you ever imagined, right? All those nights you spent alone in bed, thinking of your new teammate, of how nice he was, how sweet, how handsome – Anything you made up inside your head doesn't compare to the real thing, though. Let me guess – you thought you'd have to seduce a bashful forties boy, wine and dine him, treat him good before he'd give you even so much as a taste.\"</p>\n<p>Behind Tony, Steve licked a stripe up Tony's lower back, and Tony gasped into Bucky's neck, bracing his hands on Bucky's shoulders.</p>\n<p>\"Did you think you'd have to talk him into bed? Explain to him that it was okay to want things a little rough, teach him to let loose and just take what he wants? Sorry to break it to you, Tony, but Stevie and I are <em>way</em> past that.\"</p>\n<p>This time, when Steve leaned down to lick at Tony, he licked at Tony's hole and his own fingers as they thrust in and out. At this, Tony keened, and Bucky wrapped his arms around him to keep Tony from thrashing too hard and making Steve loose his purchase.</p>\n<p>Chuckling, Bucky told him, \"You should have seen that little punk, five foot nothing and bossy as fuck in the bedroom. <em>On your knees, Buck. Spread yourself, Buck. Hold yourself open for me, Buck.</em> Our first time after the serum, but <em>damn</em>, he did all the things he'd always wanted to do before.\"</p>\n<p>At this, Steve apparently decided that Tony was ready enough. Instead of crawling up the bed to position himself, though, he grabbed Bucky's hips and pulled with enough force that Bucky and Tony <em>both</em> were pulled towards the edge of the bed and between the cradle of Steve's thighs.</p>\n<p>Steve did the thing, just for Bucky, where he pressed his dick between Tony's ass cheeks and just rubbed for a moment, slowly, but with purpose. When Steve was ready, he leaned over the pair of them until his lips were pressed to Tony's ear as the man lay panting on top of Bucky, his eyes so dilated they were almost black.</p>\n<p>Steve spoke the words into Tony's ear, but they were meant for Bucky. \"Spread him. Hold him open for me, Buck.\"</p>\n<p>Bucky was all too happy to oblige.</p>\n<p>\"Your ass is a fucking work of art,\" Bucky announced as he did as Steve commanded and grabbed either of Tony's cheeks, palming the flesh and spreading Tony as Steve positioned himself.</p>\n<p>At this angle, Bucky couldn't see like he wanted to, so even as he held Tony open, he felt around until he found Tony's hole, probing his fingertips against the opening as Steve slid in.</p>\n<p>Tony damn near screamed with the pleasure of it, and Steve was panting hotly as he kept his lips pressed to Tony's ear.</p>\n<p>As Steve began to thrust in and out, Bucky began rubbing his and Tony's dicks together.</p>\n<p>The friction was great, and the sounds that Tony was making were addictive, and Steve had begun chanting, \"<em>Yes, yes, yes,</em>\" into Tony's ear even as he slid one of his hands under Bucky's neck and just held onto him as he worked into Tony.</p>\n<p>Bucky's favorite part, though, was where he could feel Steve stretching Tony and Tony taking all of him in, right there against Bucky's fingertips.</p>\n<p>Bucky was a little embarrassed that he was the first one to come, just from rubbing up against the two of them for a while.</p>\n<p>Once he was finished, though, it was a different kind of show – Steve released his neck, pulled Tony up onto his knees even as the man's face stayed pressed into Bucky's chest as Bucky caught his breath after his climax, and Steve began to fuck Tony in earnest.</p>\n<p>Tony came with a wail, the force of his orgasm almost making him sob.</p>\n<p>When Steve came, he met Bucky's eyes and grinned.</p>\n<p>When Tony regained his ability to form words after resting for a few minuets, he gasped, \"Best idea <em>ever</em>,\" with the widest, silliest, most content grin Bucky had ever seen.</p>\n<p>Bucky was smaller than Steve. Kind of. Technically. He was only about two inches shorter, and his muscles were far more bulkier than Steve's. And that metal arm didn't have the same give to it as the rest of Bucky's body, not even those muscles of Bucky's that sometimes seemed like they were hard as rock, but really weren't.</p>\n<p>Steve had never really held someone smaller than himself. Not outside of battle, not when he could be still, and calm, and enjoy the contact for the sake of pure, quiet comfort.</p>\n<p>He hadn't known what he was missing out on. He suddenly understood why Bucky liked the idea so much.</p>\n<p>Tony was quietly snoring into Steve's chest. His hair and neatly trimmed beard were far more coarse than Bucky's, but the sensation of the curls beneath his fingers was pleasant. Tony's head easily tucked under Steve's chin, and his arms were curled between Steve's stomach and his own. Tony's legs were tucked against Steve's, as well, his toes digging into Steve's shins.</p>\n<p>This was nice. It wasn't so much that he felt like he had to protect Tony. It was that Steve felt secure in protecting Tony. It was a peace of mind that Steve was unfamiliar with, but could quickly get used to.</p>\n<p>The sensation was only compounded by having Bucky at his back. Literally, their backs were pressed together, similar to the way they stood during battle, covering each other. Steve could feel Bucky's lungs expanding and contracting with air, the rhythm steady and smooth.</p>\n<p>At his front, Tony shuffled a bit, pressing his face further into Steve's neck and taking a few long, deep breaths before settling again and falling into a deeper sleep, his entire frame going completely boneless in Steve's arms.</p>\n<p>He got it, now. He got why Bucky missed being able to hold him like this from time to time.</p>\n<p>But this was fine. This was good. He and Bucky could still hold each other, but now they could hold Tony, too. They could regain that last little something, that last little bit of security and comfort, that had been missing ever since they'd gone to join the war and had started loosing bits of themselves to fighting. Here, with Tony, they could be safe.</p>\n<p>Good Lord, but Tony Stark was good at sex. Like, really really good. Bucky and Steve had never been with anyone but each other, and while they both had dirty, filthy minds and numerous kinks that they had explored together over the years, they hadn't realized exactly how much more there was to try.</p>\n<p>Tony was glad to show them, though. Vigorously. Non stop. For days.</p>\n<p>\"Come on, boys,\" he teased. \"I'm looking to set some records here. Today: most number of orgasms achieved in one sitting. Tomorrow: most positions tried. Oh, fuck, going through the kamasutra with you two is going to be <em>epic</em>. Between your super strength and super flexibility, I wonder how many new positions we can come up with!\"</p>\n<p>It turned out, they could come up with a lot. Steve had always had quite the imagination, but when he teamed up with Tony to make some of his dreams (Tony called them Sex Epiphanies, or Sexpiphanies) come true, they made for some of the most entertaining evenings of Bucky's life.</p>\n<p>None of them noticed how long they'd been shut up in their room until someone came and knocked on their door.</p>\n<p>Steve and Tony were sleeping hard, and they deserved it, so Bucky roused himself from bed, threw on some sweats, and went to answer the door.</p>\n<p>\"What the fuck?\" he hissed in greeting when he opened the door and found Clint and Natasha standing on the other side. \"It's -\" Bucky looked over to the bed, past where Tony was sprawled out on top of Steve in plain view, and to the clock sitting on the bedside table, \"- 5:00 in the morning!\"</p>\n<p>\"It's 5:00 in the evening,\" Natasha corrected.</p>\n<p>\"Wow,\" was Clint's contribution to the conversation as he peered around Bucky and into the rest of the room. Which, yeah, now that Bucky looked around, it was kind of obvious that the three of them had been having a lot of sex. It was also kind of obvious that they'd been having very <em>kinky</em> sex.</p>\n<p>Turning back to the pair with a sigh, Bucky asked, \"Why are you here?\" Because the Avenger alert hadn't gone off (and wouldn't for at least another month, if it knew what was good for it), and JARVIS would have told them if there were any calls from SHIELD.</p>\n<p>\"It's movie night,\" Natasha announced. \"We're ready to start the show, but there's a big empty couch smack dab in the middle of the living room where you three usually sit, and the innuendos are starting to get a <em>little</em> out of hand.\"</p>\n<p>Crap. Movie night. If they missed movie night to sleep off their exhaustion from having too much binge sex, they would never hear the end of it.</p>\n<p>\"Alright, alright,\" Bucky said. \"We'll be there in half an hour.\" Then, with a smug grin, Bucky told Natasha, \"You, Jane, and Thor can go ahead and pick tonight's movie, Nat. Tony's a little worn out.\"</p>\n<p>\"I'm sure,\" Natasha said with a smug grin of her own.</p>\n<p>\"About time,\" Clint agreed.</p>\n<p>\"What?\" Bucky asked, looking at Clint and Natasha with narrowed eyes.</p>\n<p>\"Nothing,\" Natasha said as her eyes widened in faux innocence.</p>\n<p>But Clint stated, \"Mission Objective: Convince Bucky and Steve to get their heads out of their assess and invite Tony into a super hot superhero threesome!\" Then, he fell into a victory pose and announced, \"Mission accomplished!\"</p>\n<p>Rolling his eyes, Bucky shut the door in the pair's self-satisfied faces.</p>\n<p>Still, though... He'd have to get Tony to build Natasha some new knives or rocket boots or night vision goggles or something. If what Clint said was true and this had been the woman's goal all along, she deserved a slow clap, at the least.</p>"
}