{
  "id": "639437",
  "url": "https://archiveofourown.org/works/639437?view_full_work=true",
  "author": [
    "accordingtomel"
  ],
  "title": "Inevitability (About Damn Time)",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Scott McCall (Teen Wolf)"
  ],
  "additional_tags": [
    "Future Fic",
    "Romance",
    "Fluff",
    "Oblivious Stiles",
    "Pining",
    "First Kiss",
    "First Time",
    "Accidental Relationship"
  ],
  "language": "English",
  "series": "",
  "published": "2013-01-14",
  "completed": null,
  "words": "9,707",
  "chapters": "1/1",
  "comments": "369",
  "kudos": "14,171",
  "bookmarks": "2,832",
  "hits": "206,747",
  "summary": "<p>“So?” Scott says.</p>\n<p>“<i>So</i>?” Stiles sputters, kicking his shoes into the corner and locking the front door behind him. He’d whipped out his phone the second he’d pulled up to the house, and miracle among miracles, Scott actually answered. Of course, he’s not so pleased about that now. “My dad thinks Derek and I are <i>dating</i>, Scott. Did you miss that part?”</p>\n<p>The asshole actually has the audacity to laugh. As if this is somehow hilarious to him. Worst best friend ever. “No, I didn’t.” </p>\n<p>“This is not funny, Scott.”</p>\n<p>“Yeah, it actually kind of is, though.”</p>",
  "notes": "<p>So, I've had writer’s block for a good year now. But then I got sucked into TW fandom and suddenly ideas were finally flowing again. I came up with a new mission for myself then: To try and write a fic that was short and one that I was happy with. Clearly the “short” part didn't work out all that well, but I'm pretty pleased with the end result, so I'm going to call it a success anyway. </p>\n<p>Huge thanks to sonicbookmark for pre-reading/providing me with initial feedback, to adelagia for being super supportive and encouraging throughout the whole process, and especially to popfly for the amazing (and super quick) beta. You gals are the best!</p>\n<p><b>ETA:</b> Massive thanks to chupaChak for translating my fic into Polish, and now to Igni1LB for translating it into Spanish! I AM SO EXCITED ABOUT THIS, WOW!! Thank you both so much! \\o/</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>This was loosely inspired by <a href=\"http://teenwolfkink.livejournal.com/7250.html?thread=6189394#t6189394\" rel=\"nofollow\">this prompt</a> on the TW kinkmeme. Thanks so much for reading!</p>",
  "text": "<p>Stiles has always prided himself on being in the know. He’s usually one of the first people to figure out what’s going on when no one else has any idea, and it takes a lot to throw him off these days. Especially after nearly a decade of dealing with crazy supernatural business. So if someone were to say something particularly weird or off-putting to him, Stiles is one hundred percent certain that he’d have some sort of witty, intelligent retort at the tip of his tongue, ready to go. It’s sort of his thing, after all. Stiles does not get taken by surprise, he does not get easily thrown off his game, and he certainly isn’t ever at a loss for words.</p>\n<p>Right now, though? Right now, Stiles is thoroughly and completely baffled.</p>\n<p>“I-- wait, we’re, <i>what</i>? Dad, what the hell are you talking about?”</p>\n<p>His fork stops midway between his plate and his mouth as he stares open-mouthed at his father. This is supposed to be just another Sunday morning brunch with his dad and Derek, like they’ve been doing for years. It isn’t supposed to be... well, whatever this is now.</p>\n<p>“What do you mean?” the Sheriff asks.</p>\n<p>“You just said-- About me and Derek. I mean, maybe I misheard you or something, because what?”</p>\n<p>His dad frowns, looking at Stiles like <i>he’s</i> the one who’s completely lost his mind here. Which is clearly not the case. Like, at all.</p>\n<p>“It was nothing. I was just talking to your great aunt and I mentioned to her how you and Derek are dating,” the Sheriff repeats, slower this time, as if he doesn’t think Stiles heard him the first time. But oh, Stiles heard him all right. Loud and clear. He just... doesn’t understand what’s going on. “Should I not have said anything to her? I know we never talk about it, but there’s no reason to keep pretending like that’s not what’s going on here. Don’t worry, she’s not going to judge you.”</p>\n<p>Stiles continues to gape at his dad, and for once, he thinks he might be speechless. A good five seconds pass in silence before Stiles chances a glance over at Derek, who is sitting frozen to the spot, eyes wide and mouth hanging open just slightly. It would be completely hilarious if Stiles wasn’t internally freaking out about the exact same thing. Because, apparently, his father thinks that he and Derek are dating.</p>\n<p>The Sheriff’s forehead creases, mouth pulling down into a slight frown and he places his coffee cup down on the table. “Stiles, calm down. Surely you can’t think I’ve been that blind, son.”</p>\n<p>“But Dad, I-- we-- we’re not. I mean. I don’t know where you got that idea, but it’s--”</p>\n<p>Some flicker of confusion seems to be setting in now, as his dad’s eyes dart back and forth between Stiles and Derek. “What are you talking about?”</p>\n<p>“Dad! Derek and I,” Stiles says, gesturing wildly in Derek’s direction, “are not dating. We never have been. I don’t-- I have no idea where you got that from.”</p>\n<p>Much to his immense surprise, the Sheriff snorts incredulously, as if the suggestion is preposterous. “Oh, come on, Stiles. Don’t be absurd. I’ve known about you two for years and I should hope it’s obvious that I support you both. You’re not a 16 year old kid any more. You don’t need to keep this from me.”</p>\n<p>Years? Stiles feels himself paling, fingers tapping out a restless pattern on the tabletop as he finally drops his fork back to his plate. It lands with a noisy clang, and the sound causes him to wince briefly. His dad thinks they’ve been together for <i>years</i>? How is this even Stiles’s life?</p>\n<p>Two feet over, Derek continues to sit there in stony, stunned silence, and Stiles would actually really appreciate if he would decide to contribute to this conversation some time, say, this century. So, he kicks Derek’s foot, hard, under the table. He manages to somehow bang his knee against the top of the table in the process, shaking the entire thing, and wow, great job at subtlety there, Stiles. But it seems to be enough to snap Derek out of it, as his head jerks around to glare at Stiles.</p>\n<p>“Some help would be nice,” Stiles bites out.</p>\n<p>“Uh, yeah.” Derek turns to face the Sheriff, eyes still wide as he meets Stiles’s dad’s expression. “What Stiles said. We’re, uh. Not dating.”</p>\n<p>Wow, that was helpful. Stiles rolls his eyes as he tries to sort out how this misunderstanding even happened in the first place. Derek glances down at the kitchen table awkwardly.</p>\n<p>For the first time, the Sheriff’s expression falters, and he looks genuinely confused now. “Are you guys seriously trying to tell me that you’re not dating?” he asks with that same incredulousness that Stiles just does not understand.</p>\n<p>“Yes!” Stiles says, voice squeaking, but just barely. It probably wasn’t even noticeable.</p>\n<p>His dad continues to stare, blinking several times before he says, carefully, “But that doesn’t make any sense. You two have been living together for almost two years.”</p>\n<p>Which, right. It’s just a short-term arrangement, though. Or, well, it was originally supposed to be, anyway. Stiles was fresh out of college, but wasn’t quite financially stable enough to branch out on his own just yet. But considering he was in his twenties already, and he’d finally had a taste of freedom, living at home seemed lame in comparison. When Derek had offered him a place to stay in the renovated Hale house for a few months, he’d jumped on the chance. </p>\n<p>It isn’t that he intended on staying for nearly two years. It’s just... they’d come a long way since Stiles was in high school, and living with Derek was so -- and he legitimately never thought he’d say this, ever, but -- easy. It worked well for both of them, especially when supernatural shit went down, which wasn’t nearly as frequently as it used to be, thank god. Eventually, Stiles stopped looking for another place, and Derek didn’t seem to mind, and somehow a few months turned into nearly two years. But, like, that didn’t mean they were involved.</p>\n<p>Of course, he doesn’t say any of that. What he says instead is, “We’re just roommates,” then cringes, because they’re so much more than that. “Okay, not just roommates. We’re good friends. Really good friends.” (Scott will always be his best bro for life, but it’s entirely possible that Derek is his closest friend these days. The strangest part is how not weird it actually is.) “But, like, friends can live together, Dad.”</p>\n<p>“I know that. But what about Scott and Allison’s wedding? Or cousin Grace’s wedding last year? And Aunt Marie’s remarriage? Our family reunion a few months ago?” The Sheriff gestures between the two of them with a significant look on his face. </p>\n<p>Stiles glances over at Derek who lifts a single shoulder and gives him a confused look.</p>\n<p>“You were each other’s ‘plus one’ for all of those things,” Stiles’s dad says. He’s entirely abandoned his coffee now, mug pushed off to the side of the table. Breakfast too, by the looks of it. “I don’t understand you two at all.”</p>\n<p>Before Stiles can even think of anything to say, he continues talking. “What about how you two touch each other all the time? Derek’s constantly wrapped around you like a scarf or something.”</p>\n<p>Stiles is absolutely, positively not going to blush. He’s not. He refuses. Because, um, his dad might have a bit of a point there. Maybe. Like how Derek always touches him -- on the arm or the shoulder or on his neck or even his back when they’re walking somewhere. Or, like, sometimes Stiles will fall asleep in Derek’s bed if they’re up late watching movies (because he has the bigger and better flatscreen in his room), and in the morning he’ll wake up either wrapped around Derek or vice versa. They’ve never talked about it, but it’s happened more times than Stiles can count, and if he’s being honest with himself, he likes it. A lot. Maybe too much.</p>\n<p>“That’s kind of a pack thing, actually,” Derek says, and Stiles thinks, <i>finally, thank you</i>, because what the hell is he supposed to say to that? Especially knowing his dad has caught them more than once, curled up together on the couch, in his time.</p>\n<p>“A pack thing?” He doesn’t exactly sound convinced. Or look it, for that matter, what with the furrowed brows and the suspicious glances back and forth between them.</p>\n<p>Derek glances down at his hands for a second, and Stiles would swear -- swear on his life, in fact -- that he looks almost... sheepish? Embarrassed? The little red tips of his ears give him away the most though, and Stiles isn’t going to think about how he knows that about him to begin with. “Yeah. It’s just... werewolves aren’t like real wolves, of course, but we have some of their characteristics, and touch is one of them. It’s especially heightened when there are human members of the pack. It’s partially for protection, but also to identify pack members to other werewolves, and since I’m the alpha...” Derek shrugs, very pointedly ignoring the way Stiles is boring a hole through the side of his head, even though Stiles knows he can feel his stare.</p>\n<p>“But what about--”</p>\n<p>“Dad, no,” Stiles interrupts. He doesn’t want to hear any more, doesn’t think his brain can handle it right now.</p>\n<p>“So, let me just get this straight. What you’re telling me is that you’re not in a relationship with each other?” The Sheriff eventually asks. “<i>Really</i>? ‘Cause I gotta tell you, I’m not really buying it, kiddo.”</p>\n<p>Stiles sighs, tries to ignore the way he knows his entire body is flushed red and hot with embarrassment (and maybe something else, but he’s resolutely not going to even start thinking about that right now). “Well you should, because it’s the truth.”</p>\n<p>And thankfully -- praise be to whatever deity is looking down and smiling at him for once in his ridiculous life -- his dad drops the conversation. Everything goes strangely quiet after that, as they finish off the rest of their breakfast without saying anything.</p>\n<p>“I’ve, uh, actually got to go in to work for a few hours,” Derek finally says, breaking the awkward silence that’s settled over the room. He stands, brings his dishes over to the counter and turns to the Sheriff. “Thank you for breakfast, as always. I’m sorry I can’t stick around to help out with dishes.”</p>\n<p>The Sheriff waves a dismissive hand at Derek. “Don’t worry about it, son. You can get them next time. Besides, I’ve got Stiles to help me out.”</p>\n<p>Stiles tries very hard to ignore how his heart skips a beat at his dad calling Derek ‘son.’ But if the curious look Derek gives him is any indication, it obviously didn’t go unnoticed. Stupid werewolf hearing abilities.</p>\n<p>“I should be home by dinner,” Derek says. “Do you want me to pick something up on the way, or--?”</p>\n<p>“No, don’t worry about it,” Stiles says, doing a mental catalogue of what’s in their fridge back at the house. “There’s enough Sheppard’s pie leftover from yesterday that we can reheat.”</p>\n<p>“Okay. I guess I’ll see you later then,” he addresses Stiles, then turns back to Dad. “Thanks again for breakfast. You’re still coming over to watch the game on Thursday?”</p>\n<p>The Sheriff smiles and nods. “Yup. I’ll see you then, Derek.”</p>\n<p>Stiles walks Derek to the door. “So, that was fun, wasn’t it?” he asks with a smile that’s a little too bright, a little too forced.</p>\n<p>But Derek merely shrugs, his face frustratingly blank. After all these years, Stiles feels he’s mastered the art of reading Derek’s subtle expressions, so it always irritates him when he purposely hides what he’s thinking. This is one of those rare times when it would be really nice to know that things are still good between them, what with the recent dating accusations. Dating suggestion? Dating enquiry? It wasn’t really an accusation, per se. Whatever. With the whole Dad Thinks We’re Together thing, capital letters.</p>\n<p>“Stop stressing,” Derek says eventually, quiet, reaching over to squeeze Stiles’ shoulder before turning to go. “I’ll see you later.” Stiles remains rooted to the ground, scratching absently at the back of his neck as he watches Derek walk to the car.</p>\n<p>Derek is long gone by the time he finally closes the door and turns back to the kitchen. He’s just avoiding facing his father, he reasons, which is why he’s taking his sweet time. He isn’t, however, expecting his dad to be standing a few feet away, arms folded across his chest, a knowing look on his face. Shit, how long has he been there?</p>\n<p>“Seriously, son?”</p>\n<p>Stiles groans.</p>\n<p></p>\n<p>~*~</p>\n<p>“So?” Scott says.</p>\n<p>“<i>So</i>?” Stiles sputters, kicking his shoes into the corner and locking the front door behind him. He’d whipped out his phone the second he’d pulled up to the house, and miracle among miracles, Scott actually answered. Of course, he’s not so pleased about that now. “My dad thinks Derek and I are <i>dating</i>, Scott. Did you miss that part?”</p>\n<p>The asshole actually has the audacity to laugh. As if this is somehow hilarious to him. Worst best friend ever. “No, I didn’t.” </p>\n<p>“This is not funny, Scott.”</p>\n<p>“Yeah, it actually kind of is, though,” he says with what Stiles imagines to be a huge shit-eating grin plastered to his face. “I just don’t see what the big deal is. I mean, I’m not surprised, to be honest--”</p>\n<p>“Wait, what?” Stiles interrupts.</p>\n<p>“Oh, come on, Stiles, you’re kidding me, right?”</p>\n<p>“Why does everyone keep saying that?” He flops down on the couch with a loud groan, letting his feet dangle off the edge. This is not the kind of conversation he can do standing up.</p>\n<p>“Do you need me to explain it to you?”</p>\n<p>“Oh my god, no! My dad already did that just fine, than--”</p>\n<p>“Because honestly, Stiles, for a while I thought you two were dating too,” Scott continues, as if Stiles hadn’t said anything at all. “For one, you guys smell like each other. All the time.”</p>\n<p>“We live together, dude,” Stiles points out.</p>\n<p>“No, it’s more than that. It’s like... it’s not that you smell like Derek and Derek smells like you. It’s like you both smell like <i>DerekandStiles</i>, one word.”</p>\n<p>“That doesn’t even make any sense.”</p>\n<p>“Yes, it does. Like, you can get someone else’s scent on you by hanging out with them, touching them, sharing some of the same stuff. But you’re still gonna smell predominantly like you, but with other people’s scents mixed in. Like you and your dad, or me and my mom. With you and Derek, though, it’s like...”</p>\n<p>Stiles doesn’t want to ask, but he thinks he kind of needs to know. “Like what, man?”</p>\n<p>“Like your scents have combined. Like you share the same space often, or wear each other’s clothing. Which, actually, I know you do both. But also it’s like... like you’re regularly physically, I don’t know, rolling around with each other or something.”</p>\n<p>“Oh my god, Scott!” Stiles sputters. He pulls the phone from his ear and glares at it for a second in horror. He can feel his entire body flush red and hot. In fact, he’s sure every werewolf in the entire state can probably sense his embarrassment right about now.</p>\n<p>“I didn’t mean it like that,” Scott says, and he sounds like he’s holding back another laugh, the asshole. “Though you might actually enjoy rolling around with Derek in that way, if you know what I mean. Naked. In case that wasn’t obvious.” And yup, now he’s definitely laughing. Mocking Stiles. Like the evil, horrible friend that he is.</p>\n<p>“What the hell was your point?” Stiles demands in an attempt to interrupt the laughing fit at his expense.</p>\n<p>“Just that you and Derek... well, you smell like a couple. Kind of like me and Allison, or Erica and Boyd. Minus the sex. Though there’s definitely a lot of unresolved tension hanging in the air whenever you’re together, so,” he says, when he finally calms enough to keep speaking.</p>\n<p>“Do you even know what ‘unresolved tension’ means? Also, who the hell says shit like that?”</p>\n<p>There’s a brief pause, and then, “I do. And duh.” Clearly they’re both grown adults, that much is painfully obvious.</p>\n<p>Stiles throws an arm over his eyes and tries to tries not to groan. “Shut up, Scott. I don’t want to hear any more from you.”</p>\n<p>“Look, you called me about this, so now you’re stuck listening to what I have to say.”</p>\n<p>“No, I don’t. I’m hanging up.”</p>\n<p>“Liar,” Scott says. “You won’t.”</p>\n<p>And damn him, he’s right. Scott doesn’t even need to have werewolf hearing to know when Stiles is full of shit, as long as he’s actually listening. He sort of both loves and hates that about Scott at the same time.</p>\n<p>“Fine.”</p>\n<p>Scott sounds almost gleeful when he says, “Good. Now, next point: Derek was your date to mine and Allison’s wedding.”</p>\n<p>“That doesn’t mean anything, dude. We were both single, and it made sense to go with each other...”</p>\n<p>“You danced together.”</p>\n<p>Stiles makes a ‘pffft’ sound and reaches up to scratch at his forehead. The back of his neck is itchy too, but he doesn’t feel like moving from his position sprawled out on the couch to do anything about it.</p>\n<p>“<i>Slow</i> danced.”</p>\n<p>“That was just... us fucking around, being silly. Also, I was totally hammered, so it doesn’t count.” He pulls his arm away from his face and waves it around for emphasis, belatedly remembering that Scott can’t actually see him. Though, uh, yeah... In retrospect, that dance had been incredibly intimate, Stiles shamelessly pressing up against Derek’s body, and it may occasionally feature in some of his--</p>\n<p>No. No, he is not doing this. He refuses to see the logic in any of this. (Though a tiny part of his brain keeps asking ‘why?’ Why is he so resistant to the idea of other people thinking he’s dating Derek Hale? Stiles is sure there’s an answer in there somewhere, but he doesn’t want to dwell on it right now, okay?)</p>\n<p>“Are you shitting me, Stiles? Really?” Scott says with a huff. That’s his ‘I mean business’ huff too, so yeah... great. This is gonna be fun. “Okay, look. Who do you spend the vast majority of your time with? Outside of work,” he tacks on, before Stiles can give a smart ass response about his students or any of his educational assistants.</p>\n<p>“I don’t know, I guess Derek. But we live together, so I don’t think that really counts..”</p>\n<p>Scott carries on, apparently undeterred. “Who do you talk to when you’re upset or stressed out about something?”</p>\n<p>“Sometimes you, sometimes Derek. Occasionally my dad. Or Lydia, though usually that’s a bad plan.”</p>\n<p>“When what you’re upset about doesn’t have something to do with Derek, then?”</p>\n<p>Stiles huffs. He gets Scott’s point, because fine, maybe it’s true that he and Derek talk about pretty much everything. Or, well, Stiles does most of the talking, but now that Derek’s loosened up a considerable amount, he actually has a lot more to say than Stiles ever would’ve imagined.</p>\n<p>Apparently Scott takes his silence for acceptance that he’s correct. “Exactly. Look, it’s not a huge deal. You guys make each other happy, right? So who cares what anyone thinks, either way? But, like, why don’t you just talk to him, dude? You’re basically already dating, except without the fun stuff.”</p>\n<p>“<i>Scott</i>,” Stiles groans, even as his brain starts to imagine some of the ‘fun stuff’ he and Derek could get into, and fuck, the mere idea of having sex with Derek is suddenly turning his insides to mush and awakening his dick.</p>\n<p>“Shut up, you know it’s true.” He sounds so smug. Stiles suddenly really wishes Scott was here so he could punch him in the face. “But, if you really think you’re not dating Derek, then when’s the last time you went on an honest-to-god date, Stiles? And don’t bullshit me, because I’ll know if you’re lying.”</p>\n<p>Stiles is tempted to make up something anyway, just to spite him. But Scott’s right -- he would know if Stiles is lying, even without being able to hear his heart right now. He glares up at the ceiling balefully, trying to remember the last time he actually went out with someone and called it a date.</p>\n<p>Nothing’s coming to mind, though. Not a single, fucking thing. And fuck, has Stiles’s life really been this pathetic, because come on, he damn well knows he’s been on dates before. Plenty of dates. Plenty of awesome, enjoyable dates. But like, has he really gone on anything since he graduated from college? That’s almost two years. Two goddamn years.</p>\n<p>He continues to wrack his brain for something, but every time he remembers going somewhere -- like to the museum, or out for dinner and a movie, or to the county fair, or to some weird art gallery exhibit -- it inevitably leads back to Derek. There was Lauren, a girl he went to college with who was also from Beacon Hills that he’s seen a few times since returning home. But no, wait, come to think of it, Stiles thinks she might actually have a boyfriend already. There’s also that one EA that maybe asked him to hang out a few times, but he had to turn him down because of a couple pack meetings and then prior plans with Derek, and eventually he’d just stopped asking altogether. Which means...</p>\n<p>Oh. <i>Oh</i>. Well, fuck.</p>\n<p>Since when did Scott decide to go and get so fucking observant?</p>\n<p>Finally, after a good several minutes have passed (damn, Scott’s patience has improved considerably since high school), Stiles reluctantly admits, “I... don’t know.”</p>\n<p>At first, Stiles thinks that maybe Scott hung up on him, the line eerily silent all of a sudden. “What do you think that means?” he asks eventually. But despite having every reason to, Scott doesn’t sound smug at all. In fact, if Stiles didn’t know any better, he’d say that Scott was actually being supportive... gentle, almost.</p>\n<p>“Jesus <i>Christ</i>.”</p>\n<p>“No, it’s just me, Scott.”</p>\n<p>Yeah, okay, that supportive streak ended pretty quickly.</p>\n<p>“Shut up. That’s not even a little bit funny or clever. It’s like the oldest joke in the book. You suck.”</p>\n<p>“I don’t. But I bet you Derek wo--”</p>\n<p>“Oh my <i>god</i>. I hate you,” Stiles says sincerely.</p>\n<p>“I love you too, buddy,” Scott replies with another laugh. “Good luck with Derek. I’ll make sure to keep the rest of the pack away from you guys for a few days, in case you want to make up for lost time or whatever.”</p>\n<p>And fuck him, Stiles can actually <i>hear</i> his suggestive eyebrow waggle.</p>\n<p>“You are the worst friend ever. Nope, the legit actual worst, man,” he says and hangs up the phone to the sound of Scott’s hysterical laughter ringing in his ears.</p>\n<p>Stiles is so incredibly fucked.</p>\n<p></p>\n<p>~*~</p>\n<p>There’s just the small matter of where he’s apparently been dating Derek for the past couple years without actually realizing, despite the fact that everyone else around him seems to be quite in the loop on that little revelation.</p>\n<p>And he may or may not have fallen for Derek without even having any conscious awareness of it. Which, okay, maybe that’s not quite true. Stiles has had a thing for Derek since high school, but back then it mostly consisted of lust and a hopeless teenage fantasy. In recent years, sure, he’s thought about it one or two (or four hundred) times -- what it would be like to be with Derek, now that they were actually friends and Derek no longer hated him (most of the time).</p>\n<p>Fuck. Stiles is supposed to be the <i>smart</i> one in their little group. Well, that title probably officially goes to Lydia, but he figures he’s a close second. How had he missed all the signs?</p>\n<p>He hadn’t even really tolerated Derek until sometime in his junior year, despite his crush, and only started liking him towards the end of senior year. But then college happened, and everything sort of just shifted on its axis. At first it was just the occasional text or e-mail, then phone calls, when something important was going on. But somewhere along the line, the crises slowed down, and yet the texts and e-mails and phone calls continued. Then one day, Derek just showed up in Stiles’ dorm room, uninjured and with no apparent reason for being there. It’d been a little strange and somewhat awkward, but Stiles had liked it. Apparently so had Derek, since he kept returning, at first once a month, and then, in the last year of college, he visited Stiles almost as much as Stiles visited home (which was almost weekly).</p>\n<p>And it isn’t even the fact that they moved in together, or the fact that he hasn’t been on a date in ages (thank you very much for that little reminder, Scott). Stiles hasn’t had sex in... God, he can’t even remember the last time he had sex, is how long it’s been. Ugh, that’s ridiculous and pathetic, and how had he not noticed something was up (ha, <i>up!</i>) with him this whole time? Stiles had a few relationships while he was in college. Nothing that lasted particularly long, but he still enjoyed them all the same. Sex used to be a semi-frequent occurrence. But then he’d moved in with Derek and... not so much anymore. Which is not to say that there’s been <i>nothing</i> since moving into the Hale house, because Stiles still has needs, all right, but his hand has kept him company more often than not over the past two years.</p>\n<p>Stiles sighs heavily and scrubs a hand down his face. Why did his dad have to be so observant? And worse, why did he have to go and talk about it openly, like it’s no big deal, when it kind of, sort of, maybe is?</p>\n<p>The real problem, though, isn’t that people think he and Derek are dating, because looking back on all the evidence, Stiles is forced to admit that it’s actually a logical conclusion to make. The problem is that now that the idea has been presented to him, now that Stiles has accepted that he may have missed a few things over the last several years, he literally cannot think of anything else in the entire world that he wants more than to <i>actually</i> be dating Derek Hale. And that in and of itself wouldn’t be an issue if Stiles knew he felt the same way. But what he has with Derek is pretty amazing as it is, and the last thing Stiles wants to do is risk screwing it all up.</p>\n<p>He may still be pacing in the living room when Derek returns from work.</p>\n<p>“Please tell me you haven’t been doing this all afternoon,” is the first thing Derek says to him. He peels off his leather jacket and hangs it by the door before coming to stand in front of him.</p>\n<p>Stiles wants to joke about it, to play it off like he totally hasn’t been freaking out about all of this all afternoon. <i>Of course not, what do you take me for?</i> Or <i>Please, I’m not that lame.</i> But that would be stupid, because Derek will know he’s lying, or at least deflecting. Besides, this isn’t one of those things he can keep ignoring until it goes away, because Stiles is pretty sure he’s already tried that strategy for years, and look where it’s gotten him.</p>\n<p>Instead, he says, “Well, not the entire time” and then winces. He’s sure Derek can smell his anxiety.</p>\n<p>For a few blissful moments, Derek is silent, still standing stiffly in the doorway, and Stiles can almost convince himself that they’re not going to have this conversation just yet. It’s not that he’s scared of Derek, or scared of talking about this. But Stiles has always guarded his feelings and there’s a part of him that’s terrified that now that he’s realized just how much he wants Derek, the sentiment won’t be returned.</p>\n<p>That hope is quickly shattered, however, when Derek finally says, “Stiles, can we talk?” It’s said in a carefully neutral tone of voice that Derek usually only saves for Serious Business conversations, which is not something they have, like, ever.</p>\n<p>Stiles nods, stilling momentarily, before following Derek over to the couch. He tries to make eye contact, but Derek refuses to meet his gaze. It only serves to further increase his anxiety. Stiles settles against the cushions at the far end of the couch away from Derek and tucks his legs underneath him in an attempt to contain the restless energy buzzing beneath his skin. He so desperately wants to say something, anything to break the suddenly deafening silence, but he tamps down on the urge, because Derek is the one who started this and so Derek’s the one who also needs to take the lead here.</p>\n<p>“About earlier...” Derek begins slowly, and Stiles thinks, <i>this is it, this is where he lets me down easy</i>. Ugh, being dumped before you even start dating is the worst.</p>\n<p>“I’m sorry,” Derek continues, without any preamble.</p>\n<p>Stiles blinks, because what? What would he have to be sorry about? Unless...</p>\n<p>“What do you mean you’re sorry?” Stiles asks slowly, ignoring the growing sense of dread forming in the pit of his stomach.</p>\n<p>“I just. Earlier, today. With your dad and the whole--” Derek waves a hand around (it’s eerily similar to Stiles’s own frenetic flailing, and he vaguely wonders when Derek picked up the habit). “It was. It’s my fault. That he thinks we’re dating, I mean.”</p>\n<p>“I-- How could you be responsible for dad thinking we’re--?” Stiles’ brain catches up with his mouth about half a second later, and his eyes bug out of his head in shock. “Wait, did you, like. Did you actually <i>tell</i> Dad that we’re--”</p>\n<p>“No,” Derek interrupts hastily. And for the briefest of moments, something like guilt passes across his face before it disappears. “But I might as well have.”</p>\n<p>Stiles blinks, because in all the versions of this conversation he ran through his head earlier today, this was definitely not one of the possible scenarios.</p>\n<p>‘I... don’t understand.”</p>\n<p>Derek shifts on the couch, one hand reaching up to scratch at the back of his neck. The fingers of his other hand dig into his thigh in a way that looks just shy of painful, and he’s staring down at the couch cushion as though it just wished him harm.</p>\n<p>“Look, Stiles. You know how your dad and I have grown pretty close since you went away to college?” he asks, and Stiles nods in affirmation, even though Derek still isn’t looking at him. “The thing is, I sort of talk to him. A lot.”</p>\n<p>He doesn’t mean to do it, but the scoff sort of just... falls out of his mouth. “You?” he snorts incredulously. And yeah, fine, so Derek talks significantly more now than he did during the first few years Stiles knew him, but no one would ever accuse him of being ‘chatty.’ Ever.</p>\n<p>Derek’s head shoots up then, his glare so fierce that Stiles feels himself tamping down a smile at the familiarity, despite it’s relative rarity these days.</p>\n<p>“Yes, me. You of all people should know how much I can talk.” A beat passes before he adds, “When I want to.”</p>\n<p>“Yeah, I guess so,” Stiles says thoughtfully. He suddenly feels incredibly restless, like every muscle in his body is vibrating, but at least his earlier fears have been assuaged. For now. “So, what do you talk about with my dad?”</p>\n<p>“Lots of things. But, uh, mostly you.”</p>\n<p>“Me?” Stiles says in what might be considered a high-pitched voice. (Slightly higher pitched. He absolutely does not squawk. Not even a little bit, and anyone who suggests otherwise is a big, fat liar.)</p>\n<p>Derek glances back down at the couch, picking at the slightly frayed cuff of his dark blue Henley and resolutely avoids eye contact. Stiles is buzzing with energy and a certain desperation to find out what Derek has to say, but he knows that pushing him to talk when he’s not ready is pointless. So Stiles fiddles absently with the hemline on his jeans and gives Derek the space he clearly needs.</p>\n<p>“Sometimes I think your dad figured it out before I did,” Derek says, eventually, voice soft and considering. “I complained about you a lot, you know. About how you never listened and how you were so frustrating and stubborn. How you drove me crazy sometimes. And I mean, I never intended to tell your dad all that stuff, but I did. And he’d look at me in this certain... way. Like he could see through me. Then he’d tell me about your latest conversation, and he always made sure to mention the fact that you missed everyone, even if he knew I’d literally just been down to visit you.”</p>\n<p>Silence fills the air and for a moment, Stiles wonders if he’s done. But then Derek takes a deep breath and keeps talking. “When I first met you, you drove me up the fucking wall. I’d leave most of our conversations feeling irritated and confused, like I wanted to claw my face off--”</p>\n<p>“Wow, harsh, man,” Stiles interrupts, but immediately shuts his mouth when Derek pins him with an icy glare.</p>\n<p>“Can you just be quiet for, like, five minutes? For once in your life?” Derek snaps, but it lacks any real heat.</p>\n<p>All the same, Stiles nods and mimes zipping his lips.</p>\n<p>Derek shakes his head suddenly, frowning. “Fuck, I’m sorry, I’m not good at this.”</p>\n<p>“You’re doing fine,” Stiles tells him honestly. Derek looks more restless and skittish than Stiles can remember seeing him in a long time, and after only a moment’s hesitation, he reaches over and gently rests a reassuring hand on Derek’s knee.</p>\n<p>“I guess, the thing is, it’s really-- It’s my fault that everyone thinks we’re dating. Because despite fighting it at every fucking turn, you somehow still managed to claw your way under my skin and just... stayed there. I didn’t want you there. Hell, I don’t know how you even <i>got</i> there. But you were anyway. </p>\n<p>“And I guess, after a while, I gave up on fighting it, because I was so sick of pretending that it wasn’t true, that I didn’t want to be around you all the time. But I did. And I started to miss your scent, and when I’d visit you, I tried to touch you as much as I could so it would linger and stay with me until you came home. I was so fucking obvious about it that I may as well have hired a skywriter to broadcast my feelings for you across the sky so the entirety of Beacon Hills would know, instead of just the majority. So, uh,” Derek reaches up and rubs at the back of his neck, head finally peeking up to meet his gaze, “I’m sorry. That I never told you, and that it makes you uncomfortable that people think we’re together.”</p>\n<p>Every muscle in Derek’s entire body looks tense as he stares at Stiles, but his expression is more earnest and open than Stiles can ever remember it being, and it literally sucks the breath from his lungs as he grasps the enormity of what Derek’s just confessed to him.</p>\n<p>“Oh my god,” Stiles says, when he finally finds the words to speak. His heart is literally swelling up with affection for Derek right now, the feeling so intense that it’s almost suffocating. Leave it to Derek to be the biggest fucking closet romantic in the history of the world, without even realizing it. He thinks his chest might literally burst with all the emotion he’s suddenly feeling.</p>\n<p>“Stiles,” Derek starts slowly, when he doesn’t follow up with anything else. Derek’s got that worried look in his eyes that he gets when he thinks he’s messed something up and can’t let it rest until it’s resolved. But Stiles is having none of that tonight.</p>\n<p>“No, no, be quiet,” Stiles says. “No more talking. You had your turn, now it’s mine.”</p>\n<p>Stiles is suddenly acutely aware of how far apart they’re sitting on this couch. It’s like Derek’s on another continent, and he doesn’t like it. So, Stiles scoots forward, until he’s a couple inches away from Derek, settling back down against the cushions. Despite the fact that Derek seems to startle a little at the movement, he doesn’t protest or try to run away, so Stiles considers it a success, overall.</p>\n<p>“First of all, you’re a moron,” he says, but can’t help the grin when he sees Derek’s surprised expression. “Because I’ve basically been, like, totally crazy for you since high school, and I have no idea how you never figured it out, because I thought you were supposed to have your special werewolf smelling powers, or whatever.”</p>\n<p>Derek scowls at the last part (he hates it when Stiles calls their heightened senses ‘werewolf powers’, so, naturally, Stiles makes a habit of saying it as often as possible, just to piss him off), but some of the tension leeches out of his body as he slumps forward. His lips twitch up at the corners then, briefly, but still noticeable, and Stiles recognizes it as one of Derek’s small, private smiles that he chooses to believe belongs to him alone.</p>\n<p>“What I don’t understand is why you never said anything, man. It’s been years.”</p>\n<p>“I--” Derek says, stops. “It’s been so long since I’ve allowed myself to want something, some<i>one</i>, again. I guess I was just... scared.” He swallows, sucking in a shaky, shuddering breath that would likely go unnoticed by anyone who didn’t know Derek incredibly well.</p>\n<p>And it hits Stiles then that no matter how much Derek has matured, no matter how much he’s healed from some of his old wounds, it still costs him so much to admit fear of anything, but especially to admit to being afraid of opening his heart to someone again. All the same, they need to be on the same page for this one, so he can’t let something like this drop, much as he doesn’t want to push.</p>\n<p>“Of what?” asks Stiles, furrowing his brows.</p>\n<p>“Of you not feeling the same. Of losing you. God, Stiles, it’s complicated. I don’t exactly have a great history when it comes to, you know,” he throws a hand out again, “the people I love. And I just... couldn’t risk it. With you.”</p>\n<p>“So, what, you just made the decision for both of us?”</p>\n<p>‘No, it’s not. It’s not that, Stiles, and you know it. I just... things were so good, and I didn’t want to upset that, to risk it. I... couldn’t.”</p>\n<p>There’s something more there, something underneath those words that he’s not saying. But Stiles has known Derek for far too long now, knows him better than probably anyone, and by this point, he hears what’s not being said almost as loudly as what <i>is</i> being said.</p>\n<p>“You can’t honestly think... after all this time that I’d-- that I would just up and leave you. That I wouldn’t want to have anything more to do with you over this. Or, like, anything.”</p>\n<p>Derek’s silence is answer enough -- and it should make him mad, he should be <i>furious</i> that after all this time, Derek still thinks that people are going to abandon him, that <i>Stiles</i> is going to abandon him like he means nothing and can be so easily tossed away. But before Stiles can think better of the action, he pushes up onto his knees and climbs into Derek’s lap. It’s a little awkward for a second, until Stiles positions himself so he’s straddling Derek, and it’s oddly comfortable when he settles back down.</p>\n<p>“You are a stupid, fucking idiot, you know that?” Stiles asks, before leaning forward and wrapping his arms around Derek’s shoulders, burying his face in his neck and sighing heavily into the warmth of his skin. Stiles has learned over the years just how tactile of a guy Derek really is, and he knows that sometimes touch speaks volumes over what any words could say.</p>\n<p>For a moment Stiles thinks he may have overstepped his bounds, but just as he’s about to pull away he feels Derek’s arms wrap around his waist, pulling him impossibly closer, before one hand snakes up the back of his neck and buries in his hair. They hold each other for what feels like hours, and Stiles thinks, <i>yes</i>, and <i>home</i> and <i>iloveyou</i>, and he hopes Derek understands what he means, what he’s trying to convey with touch instead of words.</p>\n<p>When he finally pulls back to look at Derek, Stiles feels his mouth go dry, like the air is being slowly sucked from the room and he can no longer breathe. Derek’s eyes are dark, his gaze so intense that Stiles’ stomach drops, heart thundering in his chest. Unconsciously, his tongue darts out to lick his lips, and Derek’s gaze follows the entire movement, mesmerized. He’s not sure who moves first, but one moment they’re looking at each other, and the next, they’re kissing.</p>\n<p>Derek’s lips are soft and a little chapped, but they move with such precision that if Stiles didn’t know better, would think came from years and years of practice. Or maybe it’s just a natural werewolf talent. It’s a thought that dies almost immediately, however, when Derek licks his way into the heat of Stiles’s mouth, deepening their kiss, and he can’t quite tamp down the low moan in response. Derek’s hands slide underneath Stiles’s shirt, blunt nails dragging down the muscles of his back, and it’s so hot and intimate at the same time that it makes Stiles shiver. One of Stiles’s hands fists in Derek’s hair, the other still gripping desperately at the front of his shirt, holding him close.</p>\n<p>Stiles groans as Derek trails hot kisses down his jaw line and throat, and he knows he’s already getting hard. Experimentally, Stiles grinds down on Derek’s lap and is rewarded with a moan from Derek as he instinctively arches up to meet him, just as hard and turned on as Stiles. Derek’s hands grip at his hips, fingers digging into the bones, just shy of painful, and Stiles’s hands find their way back into Derek’s hair, pulling him back into a wet, dirty kiss as they continue to grind against each other.</p>\n<p>Pleasure courses through him every time their cocks meet, even between four layers of clothing, and Stiles knows, embarrassingly so, that he’s not going to last long at this rate. It’s not just what they’re doing, because Stiles has done this more than once in his lifetime and it’s never turned him on quite like this. He knows it’s because it’s <i>Derek</i> that he’s with, gorgeous, stubborn, beautiful Derek, that has always been there for him unwaveringly, even when he didn’t always want to be. Derek, the one person that Stiles fell in love with despite everything. And as Derek continues to kiss him desperately, driving up into him like he’s afraid this is the only chance they’re going to have to be together, Stiles feels a thrill at the idea that this is just the beginning.</p>\n<p>“Fuck, Stiles, I need--” Derek gasps against his mouth, fingers reaching down to the fly of Stiles’s jeans. “I just-- I need to touch you.”</p>\n<p>Stiles barely has time to grunt his complete and total acceptance of this plan before Derek is undoing his fly, fingers hot on his hips as he starts to slide Stiles’s jeans and boxer briefs down. Stiles arches up, giving Derek more room to push down the offending articles of clothing. Then his cock is finally freed from the confines of his underwear, straining hard against his stomach, already leaking precome. Derek stares down at it for a few moments, eyes soft and almost reverent, before wrapping a hand around his length and giving an experimental tug.</p>\n<p>“Fuck,” Stiles moans, pressing forward to lick back into Derek’s mouth as Derek runs his thumb back and forth across the slit of Stiles’s cock. Pleasure shoots down his spine and all Stiles can think is <i>fuck</i> and <i>Derek</i> and <i>yespleasemore</i>. He slides his hands back under Derek’s shirt, running his fingers over the muscled planes of Derek’s body. He’s seen him shirtless too many times to count, but he’s never been able to touch, to explore his body in this way, and it’s incredible. Amazing. Everything he could’ve imagined and more. Stiles runs a thumb over Derek’s nipple before pinching it gently, and the sound Derek makes sends heat straight to Stiles’s groin.</p>\n<p>“Too much clothing,” Stiles groans then, because he wants Derek’s nipples in his mouth and his cock in his hand and he can’t do either of those things while Derek’s fully clothed.</p>\n<p>Reluctantly, Derek loosens his grip on him, and Stiles climbs out of Derek’s lap long enough for them to both shuck their clothes before settling back in. Derek’s cock is slightly longer than Stiles’s, uncut and full, and he gasps when it brushes up against Stiles’s as he repositions himself. Derek stares at him with wide, dark pupils, his hair wild, lips red and swollen, and Stiles thinks that Derek has never looked so gorgeous in his entire life.</p>\n<p>“You’re so fucking beautiful,” Stiles murmurs before swooping in and kissing Derek breathless, hands roaming and touching and feeling every inch of Derek’s body. He wants to memorize every mole, map every dip and curve, trace every muscle, with his hands and his mouth and body until he knows Derek better than he knows himself.</p>\n<p>“<i>Stiles</i>,” Derek groans, pulling away just before Stiles feels like he’s about to run out of oxygen. He brings his hand up, palm facing towards Stiles, and it takes him several moments to understand what Derek’s even asking.</p>\n<p>“You want me to--?” Stiles asks, sticking out his tongue briefly, and Derek just nods, once, lips quirking up at the corners.</p>\n<p>Stiles doesn’t need to be told twice. Grasping the back of Derek’s hand, he trails his tongue from the bottom of his palm to the tips of his fingers, making sure it’s wet. It’s so fucking hot and so intensely intimate at the same time, that Stiles feels himself blush in spite of himself. When he’s done, Derek grins at him and shifts beneath Stiles, lining them up, before reaching down and wrapping his hand around both of their cocks, stroking lazily.</p>\n<p>A jolt of heat courses through Stiles’s body as their cocks rub against one another and he instinctively rocks into Derek’s hand, urging him on. Stiles’s hands move to grip at Derek’s biceps as he leans forward to trail kisses down his jaw line, to lick the skin underneath his Adam’s apple, to suck gently at the soft skin where neck meets shoulder. Derek moans, heady and breathless, quickening his his strokes as Stiles continues to move down his body. Stiles moves his thumbs to circle each of Derek’s nipples, before leaning down and taking the right one into his mouth, running his tongue over the raised nub.</p>\n<p>“Stiles... <i>fuck</i>,” Derek gasps, nails digging into his lower back, his breaths coming out in short puffs now. Stiles bites at the nipple, then sucks for a few more seconds before shifting to the other side.</p>\n<p>Stiles can feel his orgasm building steadily, the pleasure curling in his belly, and based on Derek’s erratic breathing, Stiles can tell that he’s close too. Stiles drags his mouth away from Derek’s nipple to lick back into his mouth, and he reaches one hand between them, wrapping his hand around Derek’s to help him jerk them off. He barely gets a few strokes in before he cries out and is coming, his orgasm hitting him with such ferocity that he feels like he might pass out. Derek strokes him through the aftershocks, drawing every last ounce of pleasure out of him, and that seems to be all that Derek needs to push him over the edge before he’s coming too, Stiles’s name on his lips like a plea.</p>\n<p>The air is heavy with the scent of sweat and sex, even to Stiles’s human nose, and he slumps forward, resting his forehead on Derek’s shoulder as they struggle to catch their breath and come back down. One of Derek’s hands trails lazily up and down the curve of Stiles’s spine, soothing and gentle, and Stiles thinks he could get used to this.</p>\n<p>“Oh my <i>god</i>,” he finally says into Derek’s shoulder, when his breathing has mostly stabilized. “That was pretty fucking incredible. Why the hell did we wait so long to do that?”</p>\n<p>“I have no idea,” Derek says. He moves his clean hand to the side of Stiles’s face, guiding him back up in order to press a kiss to his mouth. Stiles sinks into the kiss, parting his lips for Derek’s tongue as his hands grip at Derek’s shoulders, and it’s several minutes before they part again.</p>\n<p>Stiles pulls back, glancing around at the mess around them before saying, “We should probably clean up or something. And have dinner, maybe?”</p>\n<p>Derek tilts his head to the side, giving Stiles a lopsided grin. “I don’t know about you, but I’d be okay with going straight for dessert instead?”</p>\n<p>Stiles groans loudly and laughs, in spite of himself. “I’m going to pretend that you didn’t just say that, because dude, wow is that lame, even for you.”</p>\n<p>“Yeah, but you love it,” Derek counters.</p>\n<p>And Stiles can’t do anything except agree. So, instead, he kisses the smirk right off Derek’s smug face, feeling happier than he can remember being in years.</p>\n<p></p>\n<p>~*~</p>\n<p>By the time he arrives home, his dad and Derek are already in the living room, watching the game. He waves and calls out a “hello” before toeing off his shoes and dumping a stack of quizzes that need marking on the floor. Derek will nag him about putting it away later, but right now he doesn’t particularly care. He’s tired and hungry. Speaking of which...</p>\n<p>The lingering smell of Derek’s homemade lasagne floats through the air and Stiles all but runs into the kitchen to grab some for himself.</p>\n<p>He’s standing in front of the microwave, watching the numbers slowly count down as his lasagne heats up, when he feels a strong pair of arms wrap around his middle. Almost instinctively, Stiles leans into the touch, smiling brightly when Derek presses his face into the side of Stiles’ neck and inhales deeply.</p>\n<p>“Hey,” Derek murmurs into his ear, low and gruff, tightening his grip around Stiles’s waist.</p>\n<p>It should feel weird, probably. Things are still so new between them, in a lot of ways. But it doesn’t. Not at all. In fact, it feels perfect, like they’ve been together forever already. Of course, in a lot of ways it’s true, so maybe it’s not so strange after all. (And <i>god</i>, when did he become such a schmoopy sap? He’ll find time to feel embarrassed about it later, though.) His sixteen year old self would laugh and probably punch him in the face if he ever suggested that he would end up falling completely in love with Derek freaking Hale, of all people. But, well, his early sixteen year old self would also have scoffed at the ideas of werewolves and kanimas and witches... so really, what does he know anyway?</p>\n<p>Stiles turns in Derek’s embrace until they’re facing one another and he brings his arms up to wrap them around Derek’s neck, smiling broadly at Derek’s stupid, attractive face. “Hey yourself. Miss me?” he asks, lips brushing against Derek’s, too light to be a kiss, but firm enough to be a promise of more.</p>\n<p>“Not even a little bit.”</p>\n<p>“Good, ‘cause the feeling’s mutual,” Stiles says, and then Derek’s kissing him for real.</p>\n<p>Even though they’ve only been doing this for a few days (and he’s not even thinking about all the time they <i>could’ve</i> been having incredibly hot sex over the past few years), Stiles thinks that he might never get tired of kissing Derek, of the feel of his lips and his stubble and his tongue (oh my god). So when Derek’s tongue slips inside his mouth, deepening the kiss, Stiles really can’t be faulted for the soft moan that slips past his lips. Especially when Derek’s hands have slid under his shirt, fingers ghosting down the back of his spine, and up and down his sides like he absolutely needs to touch Stiles as much as humanly possible.</p>\n<p>To be fair, they’re both pretty distracted, what with the hot making out that’s going on -- Stiles’s lasagne long since forgotten -- so it naturally comes as a surprise to them both when they realize they’re not alone any more in their kitchen.</p>\n<p>“Hey, do you have any more bee-- whoa, holy crap, I’m sorry, I didn’t realize you were-- Jeez, do you really have to do that in public, where I could just walk in and see?”</p>\n<p>Derek wrenches away from Stiles as if he’s been kicked and they both turn with wild eyes to see Stiles’s dad, sputtering in shock at them in the kitchen entranceway.</p>\n<p>“Nah, it’s totally fine Dad, we’re not busy,” Stiles tries for nonchalance, pointedly ignoring the way his face is burning. He feels a little light-headed and he hopes to god he doesn’t look as blissed out as he feels right now.</p>\n<p>“Stiles,” Derek grumbles, lightly smacking him in the arm.</p>\n<p>The Sheriff puts a hand to his forehead with an expression on his face that clearly reads, <i>how is this even my life?</i> Stiles knows the feeling. “Oh my god, please tell me you’re not just screwing around with me here, because <i>that</i>--” he points at their faces and makes some sort of weird, puckering thing with his lips that’s almost as embarrassing as what he just caught them doing “--is not how friends act, and if you think that’s the case, then I think we need to sit down and have a serious, and clearly belated, talk about appropriate social boundaries, son.”</p>\n<p>Derek moves so he’s standing beside Stiles now, facing the Sheriff. Without even thinking, Stiles reaches for his hand and slots their fingers together, tugging Derek closer. The tips of Derek’s ears turn red (<i>oh my god, and how fucking adorable is that?</i> Stiles thinks) and he reaches up to scrub a hand through his hair before saying, “Yeah, I’m sorry. I guess I should have told you earlier, but I didn’t really know how?”</p>\n<p>“Yeah, Dad,” Stiles pipes in, “turns out you were actually kind of, like, right?”</p>\n<p>“Don’t sound so surprised, kid.” The Sheriff still looks mildly suspicious, which is probably fair. “So, this isn’t some big elaborate prank to get back at me then? Because you two may be family, but that doesn’t mean I’m not willing to use my power against you.”</p>\n<p>Stiles scoffs loudly. “Please, you can’t arrest us for pranking you, even though that’s not what we-- wait, what did you just say? Did you just call us family? As in me and Derek, plural? Not just me?”</p>\n<p>“Wow, nothing gets past this one, hey?” The Sheriff aims the comment at Derek, who blinks at him a few times as if he doesn’t understand, before eventually smirking.</p>\n<p>“He’s smarter than he looks.”</p>\n<p>“Hey, excuse you both, but I’m fantastic and you’re obviously jealous of my awesomeness.” And then he remembers that he was trying to make a point before he got sidetracked. “Wait, though, Dad. Do you really consider Derek family?”</p>\n<p>“Yes, son, where have you been the last few years?”</p>\n<p>“I-- what? I mean. Oh. Oh. Okay. That’s, um, that’s awesome.”</p>\n<p>“It is,” the Sheriff agrees, before striding forward and pulling them both into a hug. It’s a little awkward and a little lopsided, but it feels nice, all the same.</p>\n<p>“I’m happy for you guys,” he tells them when he pulls away. “And can I just be the first one to say it’s about damn time? Now, let’s get back in there before the game is over.”</p>\n<p>Later, when he’s finished eating and has curled up next to Derek on the couch, face pressing into the warmth of Derek’s broad chest, one of his arms curled around Stiles’s shoulders, Stiles thinks that yes, it <i>was</i> about damn time.</p>"
}