{
  "id": "640449",
  "url": "https://archiveofourown.org/works/640449?view_full_work=true",
  "author": [
    "ignatiustrout"
  ],
  "title": "Here's The Pencil, Make It Work",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter",
    "Hermione Granger/Ron Weasley",
    "Harry Potter/Ginny Weasley",
    "Draco Malfoy/Original Male Character",
    "Neville Longbottom/Ginny Weasley"
  ],
  "characters": [
    "Harry Potter",
    "Draco Malfoy",
    "Ron Weasley",
    "Hermione Granger",
    "Original Characters",
    "Ginny Weasley"
  ],
  "additional_tags": [
    "HP: EWE",
    "Coffee Shops",
    "Muggles",
    "Alcohol",
    "Recreational Drug Use",
    "Smoking",
    "Bisexuality",
    "Post-War",
    "Coming Out",
    "Draco Malfoy in the Muggle World",
    "Mental Health Issues",
    "Misunderstandings"
  ],
  "language": "English",
  "series": "Part 1 of Here's the Pencil",
  "published": "2013-01-15",
  "completed": null,
  "words": "49,493",
  "chapters": "1/1",
  "comments": "585",
  "kudos": "16,277",
  "bookmarks": "5,630",
  "hits": "350,655",
  "summary": "<p>Harry thinks \"Why is Malfoy working in a coffee shop in muggle London?\" is a much simpler question than, \"Are you going to accept that auror offer and, if you don't, what will you do?\"</p>",
  "notes": "<p>My submission for the final year of hd_holidays. :) Stole my title from Richard Siken's \"Litany In Which Certain Things Are Crossed Out.\"</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p></p>\n<p>\n<b>May 1999</b>\n</p>\n<p>He's at a muggle pub, naturally; it's much easier for Harry to go out in muggle places. This is what makes the running-into-Draco-Malfoy part especially weird.</p>\n<p>It's no secret that before and during the war, Harry was likely to be recognised among the magical public – and it's no surprise to anyone that this remains true now the war has ended. But things are not quite the same. </p>\n<p>Back then, he was a novelty, a celebrity, a source of giddiness, speculation, and, a lot of the time, contempt, whose accomplishment had been stewing in the wizarding public for eleven years before he needed to face it. Back then, he could still go out, if he wanted, and suffer only whispering and giggling girls and covert glances most of the time. Now, his achievement is fresh in everyone's minds, and he is a source of awe.</p>\n<p>He thought it was awe before, back then with all the looking and whispering – but it was nothing like this. It was nothing like the way people drop what they're carrying and stare openly when they see him, the way they take his hands without permission and thank him earnestly for everything he's done, the way they tell him about the pain the war caused them without asking, like he should be pleased to hear these awful things that trigger awful memories, because he's the one thing that stopped it – because they want him to know how much suffering he managed to end, as though he did it singlehandedly. Everything before the war ended was nothing like this <i>reverence</i>.</p>\n<p>People have shoved gifts into his hands, and kissed them, and touched him anywhere they could reach for good luck. They have crowded him into corners in shops, and burst into tears at the sight of him, and asked him for advice he is totally unqualified to give. He gives speeches that Hermione helps him write and ministry officials edit. He appears on the Wizarding Wireless Network and the covers of magazines, at funerals and ceremonies and Ministry dinners. He tries to keep it all as limited as possible, but there is not a lot he can do without appearing disrespectful. He doesn't want to appear as though he does not understand the solemnity of it all, the importance of Voldemort's death and the honouring of the people who fought and died for it. They matter too much for him to disappear from the world completely, and when he is around, the focus is inevitably pushed to him, however much he wishes it wasn't – he <i>didn't</i> singlehandedly destroy Voldemort, but nobody really wants to hear that.</p>\n<p>In school, he thought his picture was in the paper far too much; now it's there nearly every day, and all he has to do to achieve it is step into a wizarding area. Now he's of age, Witch Weekly has gotten their opportunity to name him the year's Sexiest Wizard Alive, which his friends are never, ever going to let him live down; Ron has stuck the poster on the fridge in their shared flat in muggle London with an ill advised permanent sticking charm, and it scowls at them through every meal, reflecting the real Harry's feelings. Journalists speculate about his next move, discuss his career options and his friends and his girlfriend and his accomplishments as though they are his proud parents – as though he belongs to them.</p>\n<p>They talk about him like he's one of the most powerful wizards in the world.</p>\n<p>He reads about himself like that while sitting at the kitchen table of his and Ron's little flat, usually in his pants, often nursing a hangover and eating leftover takeaway for breakfast. He hasn't bothered to finish school – only Hermione, of the three of them, has bothered with that – and the offer to both Harry and Ron from the auror department to enter their training program, NEWTs or no NEWTs, weighs heavily on Harry's mind. He doesn't know that he wants to be an auror anymore, but it's the only thing he's ever thought to be. He feels restless a lot, and takes walks so long that when he returns, Ron is hovering awkwardly at the door, having worried about him, probably, though he never says so.</p>\n<p>So going out to magical places is overwhelming, and going out to have fun is nearly impossible – especially if Harry doesn't want pictures of himself wasted plastered all over the front page of the Daily Prophet, and then every tabloid the wizarding world has to offer. He can barely imagine how people would react to that; he knows he's their darling now more than ever, but he also knows from experience how easily people turn on their favourite public figures, especially for daring to behave like normal human beings.</p>\n<p>Accordingly, Harry and Ron are in a muggle area as far from Diagon Alley as they can manage tonight. They've brought Hermione and Ginny, kidnapped from Hogwarts by their boyfriends after the ceremonies they were forced to attend earlier in the day, and Neville and Luna, of course, and Dean, Seamus, and Parvati and Padma, because Dean has been dating Luna recently and also happened to be with Seamus and Parvati and Padma when they ran into him apparating out of Hogsmeade. It's an interesting group, considering Harry has not really seen Seamus or the twins much this year, but they have all spent a very long day remembering days on the run and in hiding, and the losses of family members and close friends, and right now it's nice to be with a big group of peers again, a bunch of people who have always treated him fairly normally, the sort of people who are good to get drunk with, to laugh with and act like normal fucking teenagers with, even though Harry's not really one of those at all.</p>\n<p>It's the third pub of the night, and Harry was already making ample use of the champagne at the Hogwarts ceremonies, and he's at the point where he <i>knows</i> Hermione is shooting him her funny, mothering looks despite her own flushed cheeks. He's pretty sure he hears Ron shout to her over the music and voices, \"Just leave him alone, Hermione, let him do what he has to, yeah?\" but Harry can't bring himself to care too much, because Ginny is leaning all over him and doing shots with him and he hasn't seen her in a while and he's had to give about a hundred hollow speeches today and shake about a hundred old people's hands.</p>\n<p>Ginny, unlike Hermione, seems nothing but incredibly amused as Harry and Seamus attempt to drink each other under the table, Seamus shouting a lot about being Irish. Somehow, they've gotten onto the topic of the Yule Ball and how horrifying it was in fourth year, and Parvati is making fun of Harry for being a terrible date, and he is apologising profusely to her.</p>\n<p>\"No, really,\" he says, grabbing her hands, to Ginny's continuing amusement, \"Parvati.\"</p>\n<p>\"Harry,\" she says, overcome with a fit of giggles.</p>\n<p>He realises he is making a whole lot more eye contact than is strictly necessary, but he holds it, anyway, hoping he is judging distances alright, anyway, and says, \"I really should have danced with you.\"</p>\n<p>\"It's really very okay, Harry,\" she says, removing her hands from his and patting them gently, giving Ginny a look Harry interprets as apologetic, but Ginny doesn't mind. She's laughing. She's good like that. \"I met all those lovely French boys. And I get to tell people I went to the Yule Ball with the Sexiest Wizard Alive.\"</p>\n<p>The table erupts with laughter, and Harry sighs heavily. \"Okay,\" he says. \"I just...I can't have anybody thinking I'm a bad person, you know?\"</p>\n<p>Parvati goes somber suddenly. \"'Course not,\" she frowns.</p>\n<p>Harry does not like her facial expression. \"More drinks?\" he says quickly, and he grabs Ron and forces him up to the bar.</p>\n<p>This is when Harry sees him.</p>\n<p>They are in a <i>muggle </i>pub, and Harry is sloshed and talking very loudly and tripping over his feet, so it takes a moment for him to understand why the bright blond head he hasn't seen for months is familiar. And then, brain to mouth filter woefully out of commission, he positively shouts, \"Malfoy!\"</p>\n<p>Draco Malfoy is sitting at the bar – and in muggle clothing, too. He's in the sort of button down shirt that Ginny thinks Harry ought to own more of, sleeves rolled up, stark black against his pale skin, and he's smoking a cigarette. Harry calls out when he's mid-drag, and Malfoy jumps and coughs, smoke spilling out into Harry's face.</p>\n<p>\"Merlin's <i>pants</i>,\" he swears, his voice more drawling than Harry's possibly ever heard it, and Harry realises that maybe this means he's fairly drunk, himself. Harry's eyes flicker again to Malfoy's rolled up sleeves. The Dark Mark is clearly visible there, and Harry feels a little sick. None of the muggles, of course, will have any idea what that is. He remembers how desperately he wants more drinks.</p>\n<p>\"<i>What </i>did you just say?\" says the person next to Malfoy curiously, a boy around their age, also holding a cigarette and sitting awfully close. Harry doesn't recognise him. He's got long dark hair that reminds Harry of Sirius, which doesn't help him to feel any better.</p>\n<p>\"What the fuck are <i>you</i> doing here?\" Harry says. He doesn't mean to sound hostile, actually, even looking at that ugly mark on Malfoy's arm. Harry's just a very loud drunk, and he's very surprised, more surprised than anything else. Truth is, in the end, he doesn't really have too many qualms with Malfoy – not as many as he used to, anyway. There's so much more to worry about in the world without pathetic old Malfoy to add to the mix. He wouldn't say he thinks of the family with <i>fondness</i>, but certainly not with the quite the old level of intense antagonism, either. Even during that year of hunting horcruxes, even when Malfoy appeared in the Room of Requirement to try to turn him in to Voldemort, Harry did not hate him, really. Harry felt more – a vaguely disgusted sort of pity, if anything. He could have left Malfoy in the fire, after all, and didn't. And it's Malfoy's mother, really, that Harry has to thank for his life, however fucking weird that is to think of – it's why Harry spoke at their trial. It's why they're not in Azkaban.</p>\n<p>\"What the fuck are <i>you</i> doing here?\" Malfoy retorts, clearly not on Harry's wavelength, because he looks pissed off.</p>\n<p>\"What do you think, mate?\" Harry continues over all the noise. \"I'm not prepared to visit Diagon Alley tonight – \"</p>\n<p>\"Harry,\" Ron says, placing a hand on his shoulder and giving Malfoy a weary look. Harry recognises that he shouldn't be shouting about Diagon Alley around all these muggles.</p>\n<p>\"Mate?\" says Malfoy, lifting an eyebrow. \"I hardly think we were ever <i>mates</i>.\" He lifts the cigarette to his lips again.</p>\n<p>\"Drake?\" says the boy next to him, \"Who is this?,\" like he's quite prepared to get Harry out of Malfoy's face if he needs to, which is really quite unfair, because Harry's only curious. Malfoy, to Harry's surprise, regards the boy with contempt, lip curling. He wonders if it's the \"Drake.\" He's certain he never heard anybody call Malfoy that at school. It doesn't really seem to suit him, this skinny pureblood blond with impeccable posture and a posh accent, taking a drag on a cigarette and looking around the bar, and now even at his companion, like these people couldn't ever hope to be on his level.</p>\n<p>\"Hey, you know, there's no need for that,\" says Harry earnestly. \"I don't have the energy for all that, Malfoy, this isn't school. I just never expected to see you <i>round here</i>, you know?\"</p>\n<p>Malfoy narrows his eyes, examining him carefully. He releases the smoke from the corner of his mouth. Harry watches closely. He always likes the look of smoke; it reminds him of fires in a comforting way. \"You're trashed,\" Malfoy says.</p>\n<p>\"Yeah, I think so,\" says Harry.</p>\n<p>\"Yeah, I think we'd better be going, mate,\" says Ron, when more beer materializes at the bar in front of them, clapping Harry on the back. \"See you then, Malfoy – or not – whatever.\"</p>\n<p>\"That boy called him Drake, did you hear?\" Harry yells as Ron begins shepherding him back towards their friends. Some beer sloshes over Harry's front.</p>\n<p>\"Right, yeah, I heard, mate, you wanna lower your voice a bit?\" says Ron. \"Have you got that?\" He nods to the drinks in Harry's hands, and, irritated now, Harry nods curtly. He's not <i>that</i> drunk, Merlin, and even if he is, he <i>can</i> take care of himself. He's eighteen, isn't he, nineteen in a couple months, and well, what exactly does this day commemorate? Something that proves he's a capable wizard, that's for sure. Well, sort of. People seem to think so.</p>\n<p>\"I'm not <i>that</i> drunk,\" Harry tells Ron very seriously when they return to the table with everybody's drinks. He eyes the liquid on his shirt apprehensively.</p>\n<p>Hermione snorts.</p>\n<p>Harry glares at her as he sits. \"I'm <i>not</i>, Ms. Know It All – \"</p>\n<p>\"Hey, watch it,\" says Ron calmly, sliding next to her.</p>\n<p>\"<i>You </i>watch it,\" says Harry. \"I <i>love</i> Hermione and the way she knows it all.\" He reaches over the table and takes Hermione's hand, patting it. Hermione raises her eyebrows. \"Listen,\" Harry continues, not letting go of her hand, to her obvious amusement. \"Do you know who's at the bar? Who I really could've kept talking to, you know, except Ron had to go and treat me like I'm a small child or – \"</p>\n<p>\"I'm sorry, I'm sorry,\" Ron concedes. \"I didn't mean – \"</p>\n<p>Harry waves it off. \"It's okay, Ron,\" he says grandly, letting go of Hermione's hand and throwing an arm around Ginny instead. \"It was only <i>Malfoy</i> at the bar.\"</p>\n<p>\"Malfoy?\" Ginny repeats, promptly settling in against him. \"You're not serious.\"</p>\n<p>\"It's Malfoy, it's really him,\" says Harry, pleased by her increased closeness. The flowery scent he likes so much is all mingled with alcohol and smoke, but it's there, her, something he hasn't gotten to smell in quite a while, and it makes him happy.</p>\n<p>\"I don't believe you,\" says Padma. \"There's no way.\"</p>\n<p>\"This is a <i>muggle</i> place,\" says Dean, lowering his voice. \"Wouldn't be caught dead, would he?\"</p>\n<p>\"It really was him,\" Ron confirms.</p>\n<p>\"Perhaps he doesn't mind muggles so much anymore,\" Luna suggests.</p>\n<p>\"Somehow I fucking doubt it,\" says Seamus. \"You ever hear him speak at school?\"</p>\n<p>\"A lot of things have happened since then,\" says Luna.</p>\n<p>After a beat, during which everyone looks thoughtful, Hermione says, \"We were wondering what happened to him.\" She cranes her neck, squinting through the crowd and the smoke to locate the bar. She doesn't have a hope of spotting him from here. \"He didn't come back to school this year.\"</p>\n<p>\"I know, you lot said,\" says Harry.</p>\n<p>\"Wouldn't expect him to, though, right?\" says Ron. \"I mean, people aren't too pleased with his family at the moment. Tables have turned in a big way. He'd be the one getting bullied all the time, old ferret face, wouldn't he?\"</p>\n<p>\"I would hope not,\" says Hermione sharply. \"Certainly not to the extent that he'd be denied an education.\"</p>\n<p>\"He'd deserve it,\" says Ron. \"Sorry, but he would. Don't pretend you don't agree, Hermione, you've hit him, and you don't hit anybody.\"</p>\n<p>Dean, Seamus, and Neville snicker.</p>\n<p>\"I'm still disappointed I didn't witness that,\" says Seamus.</p>\n<p>\"Did you really?\" says Padma, amused.</p>\n<p>\"I told you about that, didn't I?\" says Parvati. \"She hit him right round the face. When we were thirteen. Back with all that Hagrid stuff going on. When he got slashed by the Hippogriff for being a prat and blamed it on everybody else, as usual?\"</p>\n<p>\"Oh, yes, I remember, when he whinged about it for ages,\" says Padma.</p>\n<p>\"I'm going to owl my Daddy,\" Seamus whines in a high pitched, exaggeratedly posh voice. \"My Daddy won't stand for this. My Daddy's going to sue you. Have you heard of my Daddy? Have you heard that he's rich? Have you heard I don't have the balls to do anything myself, so I normally just call on him?\" Everyone bursts out laughing; Neville chokes on his beer.</p>\n<p>\"Well, he is pretty horrible,\" Hermione admits, blushing with what Harry suspects is pride about hitting him despite herself, \"But still. We didn't – \" She glances at Harry. \"People shouldn't just switch who's being picked on. That can't be a good way to start.\"</p>\n<p>\"You're no fun, Hermione,\" says Seamus.</p>\n<p>Hermione rolls her eyes, and Ron gives Seamus a look. \"I see what you're saying, 'Mione,\" he says. \"I do. But if anybody deserves to be roughed up a bit it's Malfoy. Mummy loves him, though – probably didn't want him back at school to keep him safe.\"</p>\n<p>\"Well,\" says Harry. \"It's probably good his mother likes him. You know.\"</p>\n<p>There is an extremely awkward silence. Ron, Hermione, and Ginny all know about Harry's death, and the way Narcissa saved him – and even if they don't know about his death, everyone else knows, because Harry spoke at their trial, some approximation of Narcissa's importance in the end of the war.</p>\n<p>\"Right,\" Ron says in a very small voice.</p>\n<p>Harry clears his throat. \"But now he turns up at a <i>muggle pub</i>,\" he says quickly. He doesn't really want to think about it right now. He wishes he didn't say it. He doesn't want to think about dying, anything but that. \"What makes Draco bloody Malfoy wanna be at a <i>muggle</i> place, in muggle clothes with some <i>muggle</i>? Well, I <i>suppose</i> I don't know that he's a muggle, but I've never seen him in my life – \"</p>\n<p>\"Well,\" says Hermione, giving him one of her <i>looks</i>, like she knows everything and she is exasperated at you for not keeping up. \"You weren't always the best at names or faces or – knowing about most of the people in our class, Harry.\"</p>\n<p>Padma snorts.</p>\n<p>\"I resent that,\" says Harry. Ginny laughs a little louder than necessary, perhaps relieved that the awkward atmosphere has dissolved. \"Hey,\" Harry protests, kissing her to occupy her mouth with something else. \"Don't laugh at me,\" he insists quietly, even though he likes it, actually, when she teases him. Hermione and Ron are both looking at them fondly. They like Harry and Ginny together. They are a nice foursome. Neville, on the other hand, has looked pointedly away. Neville and Ginny helped each other out a lot during the war, apparently, and Harry doesn't understand why they barely seem to speak anymore. \"I had a lot of things to <i>do</i> during school, maybe you remember – and anyway, also he called him <i>Drake</i>.\"</p>\n<p>\"Well...\" says Parvati, \"It could be a nickname.\"</p>\n<p>\"Does he look like a <i>Drake</i> to you?\" says Harry, finally looking away from Ginny. He has been happily examining her freckles.</p>\n<p>\"Well, I don't know,\" says Parvati, amused. \"What does he look like to you, Harry?\"</p>\n<p>\"I don't know, some bloody ponce, not somebody called Drake,\" says Harry to more laughter.</p>\n<p>\"You're really very drunk,\" says Hermione. Her hand is now on Ron's on the table. \"You're <i>sure </i>it was Malfoy?\"</p>\n<p>\"Definitely Malfoy,\" Ron confirms, lacing his fingers through hers, although in Harry's opinion Ron is quite as drunk. \"And definitely a ponce. He was totally <i>with</i> that bloke, if you catch my drift.\"</p>\n<p>Harry did not notice <i>this</i>. \"With him?\" he repeats. \"Like <i>with</i> him, like you think he's <i>gay</i> or something?\"</p>\n<p>Luna raises an eyebrow. \"So?\"</p>\n<p>\"What'd be wrong with that?\" Dean says, backing her up and earning himself an odd look from Seamus.</p>\n<p>\"Nothing,\" says Harry, quite uncomfortable all of a sudden. \"No, I didn't mean – I don't care if people are <i>gay</i>, or whatever, I – Malfoy, though, really?\"</p>\n<p>\"Well, here they come,\" says Ron, nodding.</p>\n<p>Malfoy and his friend appear to be leaving, and the other boy's hand is on the small of Malfoy's back. He is quite close, talking into Malfoy's ear, and they certainly look like they might be <i>together</i>. Malfoy is smiling. Harry can't remember whether he's ever seen Malfoy smile for real, without malice lurking behind it. For no good reason at all, the moment they're within earshot, Harry calls out as loudly as he can, \"See you, then, Malfoy!\" Hermione puts her head in her hands, and Parvati, Ginny, and Seamus immediately erupt into laughter.</p>\n<p>Malfoy turns, usual sneer back in place, and calls back, \"Doubt it, Potter,\" before he and his friend melt into the crowd by the door.</p>\n<p>\"Definitely <i>together</i>,\" says Ron, wiggling his eyebrows.</p>\n<p>Uncomfortable again, Harry becomes extremely interested in the sticky spot in front of him on the table, picking at it with bitten fingernails. He never really thought about the possibility of Malfoy liking blokes. Wasn't Pansy his girlfriend or something? Wasn't he lying all over her on the train in sixth year? But Harry never really thought about the possibility of anybody in his class being gay, really, because he just didn't – it never occurred to him. He's never had much exposure to it, though he's heard rumours about Dumbledore, and though he – </p>\n<p>It's not that he has a problem with gay people, he really doesn't, it's just.</p>\n<p>He's not gay. He doesn't know a lot of things about his life now, actually, with the war over, but he <i>knows</i> he loves Ginny like he's never loved anybody else – he loves the way she talks about Quidditch and the way she isn't afraid to curse people when they deserve it, her laugh and her smell and her handwriting in letters. He loves kissing her, and he loves sleeping with her, as he got the glorious opportunity to realise this past summer, and then every possible moment of alone time after that. He <i>really</i> loves her, and she's not the only girl he's ever had feelings for.</p>\n<p>Harry kisses Ginny again, probably too deeply, but nobody seems to mind.</p>\n<p>Ginny isn't all concerned about him like the others, even if he is swaying and stumbling a lot and slurring his words. He <i>knows</i> they're concerned, because he catches them exchanging looks when they think he isn't looking, and whispering together, probably about him, like everybody always seems to be. Ginny, though – she knows, especially after all the things he's done, he can look after himself. She knows he's got a right to get really sloshed if he wants to, and she has fun with him and laughs joyfully when he carries her out of the pub and down the street like they're newlyweds, her shoes dangling off her feet.</p>\n<p>\"You're going to drop her, mate,\" says Ron, whose arm is flung over Hermione's shoulders.</p>\n<p>\"Ronald,\" says Ginny. \"Shut the fuck up.\" She leans to whisper close in Harry's ear, \"How am I supposed to fuck you with him around?\"</p>\n<p>\"Ginevra and I are turning in early,\" says Harry, pretty much as transparently as possible, and he sets off at a jog to get in front of everyone and nearly does drop her.</p>\n<p>\"<i>Ginevra</i>,\" she snorts, still laughing with him, Harry still loving the way they laugh together, \"Don't you dare unless you want bats flying out your nose, Mr. Sexiest Wizard Alive – \"</p>\n<p>\"You two are what, I'm sorry?\" Ron yells after them, and Harry drops Ginny to her feet, grabs her around the waist, and apparates.</p>\n<p>Their laughter seems much louder in the quiet of his bedroom.</p>\n<p>\"Oh my god,\" Ginny says, breathless. She grabs her head, her breasts, her waist, and gasps, \"We could have splinched ourselves!\"</p>\n<p>For a moment, Harry thinks she is going to hit him – it's extremely dangerous and highly illegal to apparate under the influence, and he's shocked he actually landed in the spot he meant to – but then they burst into laughter, and they fall onto the bed still laughing. Harry's sure Hermione's having a coronary back where they left them, but that's really not what he needs tonight. He needs this – laughing with Ginny, and kissing her smile, and her red hair fanned across the pillow. He needs the way she grins and sighs and encourages him the whole time he's fucking her, the way she laughs and teases him, the way she makes him feel very normal and young and alive – not like someone who has had a whole lifetime's worth of loss, not like someone who has died. He's drunk and silly and fucking his girlfriend, and Ginny doesn't expect anything else from him. It's lovely. It's wonderful. He's not confused about anything at all.</p>\n<p>\"Cheers, Harry,\" Ginny laughs breathlessly when they're through, her nose touching his as she faces him on the pillows.</p>\n<p>The room's sort of spinning at this point, and Harry can feel an ache worming its way to the front of his skull, but he's happy, and he says softly, gazing at the freckles on her nose, \"I love you.\"</p>\n<p>\"Yeah,\" she whispers, smoothing back his hair. After a pause, she says, \"You, too.\"</p>\n<p></p>\n<p>\n<b>July 2000</b>\n</p>\n<p>He's still living with Ron, who has finally decided to forgo auror training in favour of helping George out at Weasley's Wizard Wheezes. Ron thinks George, who has been having a rough time, needs him more. Harry still hasn't made a decision, though the MLE insists their NEWTs or no NEWTs offer remains. Hermione, meanwhile, has passed her NEWTs with flying colours and is attending magical law school in London, and she's at their flat more than she's not. Ginny is the newest member of the Holyhead Harpies, playing Chaser, and she is not Harry's girlfriend anymore; she's Neville's instead.</p>\n<p>Harry's not really over it.</p>\n<p>He doesn't blame her. He <i>can't</i> blame her. She didn't do anything wrong, except fall out of love with him and fall for Neville instead. People can't help those things. \"I thought we could make it work,\" she told him through tears, while he stared at her like an idiot across the kitchen table. She hardly ever cries; she didn't cry over their last break up, and he certainly didn't expect her to do it this time. Everything about the situation felt alien. It was like looking at his life from the outside, like he was watching it happen in a pensieve. It had a sense of bleakness that all this time after the war has had, when it's supposed to have been so wonderful. Harry doesn't know what's wrong with him, how ungrateful he must be, that it should feel this way.</p>\n<p>\"When the war was over I was so happy to see you – I thought – I was so happy you were back, Harry,\" Ginny says. \"I thought this was how it was supposed to be, I thought we could be together, but I don't – I don't think I feel the same way anymore, and I don't think it's fair to you to keep doing this.\" She knew she was breaking his heart, he could tell by the tears, but she spoke fiercely, anyway, her eyes hard, the way she is when she's absolutely certain about something.</p>\n<p>Apparently, while Harry and Ron and Hermione were off hunting horcruxes, and Ginny was at school, she and Neville spent a lot of time together. Nothing ever happened between them, she insisted, but they bonded over what was happening in a way that Harry and Ginny never did, and she had feelings for him, and she thought he might've had them, too, though they never discussed it. \"We just weren't close during the war,\" she said of she and Harry. \"You broke up with me, and you disappeared – I'm not saying it's your fault. I'm not blaming you. I know what you had to do. But it was a long time, Harry, with a lot of other things to think about, and there are things I'll never understand – and things you'll never understand – \"</p>\n<p>\"Then who is?\" Harry asked. \"Who <i>is</i> going to understand, then? It's not like anybody else – \" He didn't want to say \"died,\" that sounded far too melodramatic, so he just said, \"That's stupid, Ginny. That doesn't make any sense.\" But he thinks he knows what she meant, in a way – he noticed, during the time after Ginny's graduation, the way things were strange between them after a while, after they were suddenly able to spend as much time together as possible. He noticed the way she shirked away from him sometimes, the way she regarded his nightmares and insomnia with strange anxiety, the desperate way they seemed to bury everything with false lightheartedness – but he tried desperately not to, because he did love her, despite it. He loved her when he stared longingly at the marauder's map in a tent pitched all over the United Kingdom, when apparently she wasn't thinking about him very much at all. He loves her still.</p>\n<p>\"Maybe I'm trying to justify it,\" Ginny admitted. \"Trying to make myself feel better. Harry, I can just – tell that you love me – in a way that I – \"</p>\n<p>\"That you don't,\" said Harry hollowly.</p>\n<p>\"Well, I – I thought I could, but – \" Ginny looked at him like he was a puppy she was stepping on, and he will never forget that look and how much he hated it, the pity in it. \"Yes,\" she whispered.</p>\n<p>She and Neville did not get together right away after that. It took a few months. But it happened eventually. Ron and Hermione were angry at her, at first, but this only whipped Harry into a temper like he hadn't experienced since the war. \"It's not her fault!\" he shouted at them. \"She didn't do anything wrong! It – sucks, but it's not her fault, okay?\" It felt good to yell about something again; it felt like there hadn't been anything concrete to yell about for so long.</p>\n<p>This, however, was when it came out, thanks to Ron's inability to keep his mouth shut sometimes, that Ginny thinks she never actually loved Harry for real, that her crush had its roots in his fame, and though she loves him as a person and a friend now, the romantic bits were confused, leftover – but she did not tell Harry for fear of making him feel worse.</p>\n<p>There is nothing that Harry hates more than pity – or at least, it's very prominent on his list of hated things. He refuses to be the subject of pity. This made him furious. This made him find her and shout at her, this is what made them fight – he made it not about her failure to love him, but the way she had babied him by not telling the whole truth, though in reality he wasn't sure which part hurt more.</p>\n<p>They've since made up, but the idea of Ginny's pity still burns. Harry will suck it up and smile at every single Weasley family event he attends for the rest of his life now, even the ones Neville attends, no matter how long it takes him to stop missing her. He will go to pubs with friends when Neville and Ginny are there, he will chat with them both, he will do anything it takes to make it look like he doesn't need <i>anybody's</i> pity. Because he doesn't. It's not any of their business if he still thinks about her, or doesn't date other girls, or spends a lot of time sitting around his flat in his pants without any idea of the direction his life is going, even after all this time. It's not for them to worry about. It's his problem. He can handle it – and besides, everybody's spent far too much of their lives worrying about him already.</p>\n<p>Harry wakes up this morning to rain, a steady London drizzle that's likely to last all day.</p>\n<p>He just misses breakfast with Ron and Hermione, stumbling into the kitchen with his hair all over the place just as they're preparing to leave. It's Harry and Ron's flat, technically, but it's not unusual for Hermione to have spent the night. It's so commonplace by now that it's lost any of its awkwardness – and besides, there is not a lot of awkwardness between them in the first place, after living quite closely in dormitories and hideaways and tents for so long. Harry thinks maybe he's supposed to be jealous or bitter or awkward about his two closest friends dating, but he's just not; even the initial pangs of exclusion are gone by now. It's fine, because it hasn't really changed much. It hasn't changed the way they know more about him than anyone else, even more than Ginny does or ever did. It doesn't make it any less wonderfully comfortable when they stay up all night together talking around Hermione's conjured blue flame because it is lovely and familiar, sometimes only joking or reminiscing, other times wondering about their futures. Hermione always leads these conversations with enthusiastic plans and passions, Ron and Harry hovering on the edges with the occasional disclosure of anxieties or tentative hopes. Harry keeps a lot to himself, but he says more to Ron and Hermione than to anyone.</p>\n<p>And anyway, Hermione's pretty good about silencing charms at bed time.</p>\n<p>\"Oh, good morning, Harry,\" says Hermione as Harry enters the kitchen, yawning and rubbing the back of his neck. She is shuffling around in her briefcase, a bag expanded much like her beaded bag from the war.</p>\n<p>\"Morning,\" Harry says, voice cracking from disuse during sleep.</p>\n<p>\"Morning,\" Ron mimics him, croaking exaggeratedly from the fridge, which he is leaning against, and tearing off a large chunk of the burnt toast in his hand with his teeth. The old Sexiest Wizard Alive poster from over a year ago scowls at them all at Ron's side. Other joke photos and clippings have accumulated there, too, things like rediscovered notes they passed around class during school, including a doodle of Draco Malfoy being pushed off a cliff at Durmstrang, and mostly the most ridiculous of the Harry Potter press, including a Witch Weekly quiz Ron took with the utmost seriousness only to discover he fit into the category of Harry's dream girl.</p>\n<p>\"Yeah, that's exactly what I sounded like, good job,\" says Harry, shoving Ron forcefully away to open the fridge. Ron chokes on his toast.</p>\n<p>\"I <i>know</i> I have an umbrella in here...\" Hermione mutters.</p>\n<p>\"I normally don't bother,\" says Ron, giving Harry the finger as he stumbles over his feet.</p>\n<p>\"Of course you don't,\" says Hermione. \"But as usual you fail to realise that your way of life is not absolutely everybody else's, and I have – all <i>this</i> to deal with.\" She gestures to her bushy hair.</p>\n<p>\"All this?\" says Ron, amused, taking another bite of toast, seemingly undeterred by the choking of seconds before.</p>\n<p>Hermione makes a disgusted face in his general direction. \"If you want me to look like the bride of Frankenstein by the time I get to class – \" Hermione is taking summer classes in the hope of finishing her education and getting into the Ministry as quickly as possible. In her view, there is no time to waste, and the end of Voldemort, of course, has not meant the end of discrimination and dubious magical creature related legislation.</p>\n<p>\"The who?\" says Ron, mouth full. He says a few unintelligible things which finish with, \"Ever heard of drying spells?\"</p>\n<p>\"Drying spells are shit on hair,\" says Harry, peering dubiously into the fridge, wondering if there are eggs. He and Ron are still not very good at grocery shopping.</p>\n<p>\"Yeah, Harry?\" says Ron.</p>\n<p>\"Shut it, I've got <i>unmanageable hair</i>, I know what it's like to accidentally look like a wild animal,\" Harry says, shutting the fridge when he realises there are definitely no eggs in there. His poster self mirrors his expression.</p>\n<p>\"Yeah, I can see,\" Ron snorts. \"Except you can't really be bothered to do anything about it, can you?\"</p>\n<p>\"I understand you perfectly, Hermione,\" Harry continues, kicking Ron in the shins and wandering off to the bread, which seems to be the only option.</p>\n<p>\"Merlin's fucking...\" Ron stumbles again, muttering under his breath about Merlin's something or other – it could be anything, really, with him – as he limps toward the front door.</p>\n<p>\"Thank you, Harry,\" says Hermione, laughing and finally a pulling an umbrella from her bag. \"There we go.\" She bustles over to give Harry a quick kiss on the cheek, affectionate and familiar, and then to the door. \"We've got to go. Ron, you're going to be late for work, you could have left without me, you know – \"</p>\n<p>\"Nah, I wanted to walk with you,\" says Ron, bending to kiss her head as he pushes open the door. \"Also I quite like 'all this,' you know.\" He touches her hair and says, \"See you, Harry.\"</p>\n<p>\"Yeah, see you, thanks for leaving me bread,\" says Harry, indicating the shit heel of the bread that no one likes, the only thing left for him.</p>\n<p>\"Well, if you knew how to locate shops...\" says Hermione.</p>\n<p>\"<i>Bye</i>, Hermione!\" says Harry significantly.</p>\n<p>She laughs and shakes her head. \"<i>Bye</i>, Harry! I'll probably be back before Ron. We were thinking Thai tonight, all right?\"</p>\n<p>\"Yeah, all right,\" says Harry, and they leave.</p>\n<p>He sits down at the table with the stupid heel of the bread. The place suddenly seems very empty.</p>\n<p>Perhaps he'll go out for breakfast – get a pastry or something, and a coffee, as he's become rather attached to the stuff in the past year or so. He supposes there are worse things to be attached to.</p>\n<p>Harry doesn't leave muggle London much. Maybe things have changed – maybe going out in magical communities will be easier after this long. He's not in the paper quite as much; they've run out of interesting things to say, probably, as he doesn't do much of anything newsworthy. He doesn't do much of anything at all, unless feeling restless and anxious all the bloody time counts.</p>\n<p>The last time he was in the papers for anything significant was when Rita Skeeter got wind of Ginny splitting up with him; there were articles speculating about the reasoning day after day after day, painting him as a tragic figure until people got bored, at which point they wondered if it was his fault. Nobody considered the possibility that it was no one's fault. The whole ordeal is only just petering out, and it's been horrifying enough for Harry to still feel rather put off to the idea of associating with the wider magical community. He hasn't tried being around them yet, and he's not really in the mood to try now. <i>Maybe tomorrow</i>, he thinks, like he does every day.</p>\n<p>He likes to apparate to random places he's never been and see what he can find there. It's a good way to get to know the city, though it's not always the best plan if he has a specific destination, like his current specific need for caffeine. This time, though, he gets lucky – after only a few moments of wandering in the drizzle and wondering why he didn't find an umbrella himself after all that talk of accidentally looking like a wild animal, he encounters a coffee shop. It's a little local place with a quaint striped awning and tables outdoors, though these are empty now, of course. It looks fairly empty inside, too, actually, and as Harry walks inside, he hopes its emptiness is more a result of the disagreeable weather and lateness of the morning than bad product.</p>\n<p>The few people inside are scattered here and there among round wooden tables, reading newspapers or books. One boy, perhaps Harry's age, is using a laptop on a window seat. It looks nice and cozy, actually, to be sitting there like that. His back is to Harry, and for a moment Harry's glance lingers over it, over the boy's wide shoulders in his t-shirt and the way his dark hair curls at his neck, noticing like he tends to notice these things – until he realises what he's doing, shakes himself mentally, and approaches the counter.</p>\n<p>The boy at the till has his back to the shop, his bony elbows on the counter as he speaks to the tall, pretty girl behind there with him. This back is thinner than the other boy's, sharper and longer, shoulder blades quite obvious, and Harry wonders why he's paying so much attention to people's backs. \" – a great big hulking thing like that,\" the boy is saying. The upper class accent is familiar, though for a moment Harry's can't imagine why. \"I couldn't trust myself, and if you lot forced me you'd be personally responsible for setting a menace on the country. The people of London – of all of England – would live in terror, and it would be your fault.\"</p>\n<p>The girl, who has a very short haircut Harry always rather likes on girls, snorts. \"So much bloody drama,\" she says, and then she nods in Harry's direction. \"Sorry, hello, can we help you?\"</p>\n<p>The boy turns around, and it's Draco fucking Malfoy.</p>\n<p>He's wearing uniform muggle clothing and a smock, and the plastic name tag pinned to the smock reads <i>Drake</i>, but he is unmistakably Malfoy, as blond and pale and pointy as ever.</p>\n<p>They stare at each other.</p>\n<p>Malfoy's hair is falling in his face, in need of a trim, not as polished as it used to look, but his fingernails, hovering awkwardly at the till, are more clean and managed than Harry can ever hope for his uneven, bitten nails to look. The collar bones and bony wrists poking through his shirt make Harry realise that Malfoy should probably look <i>less</i> pointy than he did in the last couple years of school, when the war was making him sick, but he doesn't. He's still quite as skinny.</p>\n<p>After a very long, awkward moment, the girl, whose nametag says \"Caitlin,\" raises her eyebrows and clears her throat.</p>\n<p>Malfoy, who has been looking rather like he might be sick, seems to come to his senses. \"So, er, can I help you then?\" he asks, straightening up. He swipes a hand through his hair, attempting nonchalance.</p>\n<p>\"What are <i>you</i> doing here?\" Harry returns, completely gobsmacked. The last time he saw Malfoy, he was <i>wasted</i>, and he remembers it in flashes – Malfoy blowing smoke out of the corner of his mouth, Malfoy smiling with the unfamiliar boy, himself sleeping with Ginny in the end, which he really doesn't want to think about at all. Now Malfoy is standing in a muggle place, presumably <i>working</i> there. Malfoy is wearing a <i>smock</i>.</p>\n<p>Malfoy sighs heavily, as though he hoped Harry might go along with it and pretend not to know him. \"What does it look like, Potter?\" he says, defeated. \"I'm working.\"</p>\n<p>\"Well, obviously,\" says Harry, \"But <i>why</i>? And why here? And your name's not Drake.\"</p>\n<p>Harry can admit that Malfoy has always been quite good at withering looks. The girl, Caitlin, presumably, looks at Malfoy as if this is news to her.</p>\n<p>\"Thank you for reminding me what my name is,\" Malfoy says coolly, shooting Caitlin a quick, anxious look back. \"However, I am at my job, as you have also noticed. I doubt you have attended a job a day in your life, so perhaps you don't understand the way they work, but I can't stand here chatting to you all day, so you might as well order whatever it is you want and get out of my face.\"</p>\n<p>Harry thinks it's a bit rich of Malfoy to berate Harry for never having a job when he grew up spoiled rotten in a sprawling manor, and by rights shouldn't have a job himself. It's also unnecessary to respond to simple and justified curiosity with \"get out of my face.\" \"This how you always talk to customers, Malfoy?\" he says, annoyed. \"Or is it just reserved for me?\"</p>\n<p>\"Oh, it's reserved <i>especially</i> for you, Potter,\" says Malfoy, rolling his eyes. \"After all, when has anything ever been about anyone but you?\"</p>\n<p>Caitlin raises her eyebrows.</p>\n<p>Harry almost rises to the bait. Almost. He can feel the anger prickling under his skin, threatening to burst through, but he takes a moment to think about this. Ever since he exploded at Ginny about babying him during their break up, ever since how horribly and stupidly he felt over it, he has tried to force himself to take moments to think before going mad and shouting at everybody in sight. Now he's really being tested. Malfoy used to be able to get under his skin in school. This isn't school. He'll be twenty at the end of the month. Is he going to let Malfoy get under his skin like he did when he was sixteen, with these muggles looking on? Is he going to make a scene in a public place?</p>\n<p>He takes a deep breath and simply says, \"Look, Malfoy. I didn't mean to start anything. I was only surprised. I think that – makes sense.\" He sighs with relief, feeling really rather proud of this level of restraint.</p>\n<p>Malfoy gives him a long, hard look. Caitlin looks back and forth between them. Harry wonders if this is an exciting event for her, in comparison to what normally happens working at a coffee shop.</p>\n<p>Eventually, Malfoy heaves another loud, drama heavy sigh. \"All right,\" he says.</p>\n<p>\"All right?\" Harry repeats, unsure of what this means, exactly, but it seems that Malfoy might've managed to cultivate some level of restraint over the past couple of years, as well.</p>\n<p>\"All right, whatever, Potter,\" says Malfoy. \"I was, uh – surprised, as well.\" Looking quite out of his element, which Harry is glad of, because it means they are on even footing, Malfoy adds, \"I suppose I can't be angry with you for walking into a shop.\"</p>\n<p>\"No,\" says Harry, probably a little too smug, \"You can't.\"</p>\n<p>Well, maybe his restraint is better now, but it's certainly not perfect.</p>\n<p>Malfoy quirks an eyebrow. \"Yes, I suppose I can only be angry with you for the usual reasons,\" he says dryly.</p>\n<p>\"The usual reasons?\" Harry repeats.</p>\n<p>\"You're breathing, etcetera,\" says Malfoy, gesturing as though he's waving everything away.</p>\n<p>Harry stares at him.</p>\n<p>\"I'm attempting to joke with you,\" Malfoy sighs. \"For some reason. What do you want, then, Potter? Coffee? Tea? A pastry? To stare at me with your mouth open like that all afternoon?\"</p>\n<p>Harry has absolutely no idea what he can do now but order something – he is hungry, after all, and someone else is now waiting to order – so he asks for a coffee and a croissant and ends up at a table in the corner, shooting glances at Malfoy and <i>knowing </i>he notices. He wants to say more to Malfoy, of course, to ask him questions, to understand why this has just happened – to feel like things make sense again. But now he's just sitting around in a coffee shop, picking the flakes off a croissant and feeling like he has dropped very suddenly into an alternate universe, and his head is still spinning.</p>\n<p>Malfoy is working. He is wearing a nametag and a smock. He is counting muggle money and making various drinks with practised ease, and chatting to his obviously muggle co-worker like they do it all the time. He is flirting with the customers, most prominently with the old lady who comes in shortly after Harry sits down. He is humming along and even <i>dancing </i>a bit to the muggle music on the radio, swaying and mouthing the words as he pumps flavoured syrup into someone's latte like a normal, chipper fucking person.</p>\n<p>What the <i>fuck</i>.</p>\n<p>Harry's memories of Malfoy are not normal, happy, chipper-fucking-person ones. There's all the jibe exchanging at school, of course, but most prominently there are memories of war – Malfoy's hand shaking as he gripped his wand in the astronomy tower, Malfoy's face screwed up with terror and revulsion as he performed the Cruciatus curse in one of Harry's visions, Malfoy's face, pale and close and terrified, at Malfoy Manor, saying, \"I can't be sure,\" and later watching helplessly as Harry took his wand. Malfoy with his arms tight around Harry's waist, heart hammering against Harry's back, as Harry flew him out of the flames engulfing the Room of Requirement. Malfoy in his mother's arms in the Great Hall, his family looking starkly out of place among the celebrating people. When Harry thinks of Malfoy, he thinks of all this, all this and the addendum of that strange evening at the pub; he does not imagine someone cheerfully humming and making lattes for muggles, and he does not know what to do with this alarming dissonance.</p>\n<p>A tiny voice at the back of his head, perhaps Hermione's voice, suggests that, first of all, despite the war, Malfoy has probably always been a real person with the ability to hum and chat and drink coffee like anybody else – in fact, Harry's seen him at it before, in the Great Hall – and second of all, it's none of Harry's business; Malfoy working at a muggle place doesn't really matter to him personally at all, and there's no reason to feel quite so worked up about it.</p>\n<p>But this just doesn't make any <i>sense</i>. Harry doesn't like when things aren't making sense to him; he likes to get to the bottom of things.</p>\n<p>Harry stays in the shop for a quite a bit longer than he would normally, trying to work out what he can say to Malfoy, how he can justify wanting to know more when he's not sure why it matters himself. Many customers have come and gone, and Harry has begun to wonder if Hermione has returned to the flat yet, when Malfoy appears before Harry's table, looking down his pointed nose. He's holding a cloth, as though ready to wipe down tables, and he looks tired. If Mrs. Weasley could see him, she'd force a five course meal down his throat – well, if he was anybody but a Malfoy, anyway. Harry's fairly sure her motherly nurturing would not extend that far.</p>\n<p>\"Going to stay here all day, Potter?\" Malfoy says, free hand on his hip. \"Because I don't know what you think that will accomplish.\"</p>\n<p>\"I – \" Harry looks up from the cold dregs of his coffee, directly into Malfoy's eyes. He grips the styrofoam cup tightly in his palms. \"Why are you here, Malfoy?\" he asks. \"Really?\"</p>\n<p>For a moment, an incredulous anger flashes in Malfoy's eyes – and then he says firmly, but more calmly than Harry expects, \"None of your business.\"</p>\n<p>\"I'm just curious. I – \"</p>\n<p>\"You're just unable to keep your nose out of other people's business,\" says Malfoy. \"Do you really think I owe <i>you</i> an explanation, Potter? Why would I owe you that?\"</p>\n<p>Harry doesn't really know.</p>\n<p>\"You've been here long enough,\" Malfoy continues. \"You're loitering now, all right? And I think you should leave.\"</p>\n<p>Harry glances over at the boy in the window seat, who has been there since before Harry turned up. He has looked over in their direction, and with a sudden jolt, Harry realises it's the boy who he saw with Malfoy in the pub, except he must have gotten a haircut, or <i>something</i> is different – but it's definitely him.</p>\n<p>Malfoy follows his gaze and is not sympathetic. \"You should leave,\" he repeats, eyes flashing. Harry looks round at all the muggles, including boy-from-the-pub and Caitlin-behind-the-counter, who are both eyeing him suspiciously, like he might be mad or something, and thinks listening is probably in his best interest. Malfoy appears to be reaching the end of his new restraint. The hand clutching the cloth is shaking, just slightly.</p>\n<p>Leaving now, though, does not mean Harry's going to give up. He's never been one to do that.</p>\n<p></p>\n<p>***</p>\n<p>Hermione places a mug before Harry on the kitchen table, looking at him closely. \"You okay?\" she asks.</p>\n<p>\"Fine,\" says Harry. He stares at the fridge for a bit, at the little doodle of Malfoy falling off a cliff, the mouth a wide \"O\" of fear, and then, before he can stop himself, blurts it out: \"Guess who I saw today?\"</p>\n<p>With a slight eyebrow raise, Hermione sits down across from him with her own tea cupped in her hands. \"Who?\"</p>\n<p>\"Malfoy.\"</p>\n<p>Her eyebrows rise much further. \"<i>Malfoy</i>?\" she says. \"Where?\"</p>\n<p>\"You won't believe it – he was <i>working</i>, working behind the counter at a coffee shop. A <i>muggle</i> coffee shop.\"</p>\n<p>Hermione sets down her mug and straightens. \"He was not.\"</p>\n<p>\"He really was! He was there, and he told me he was working and to piss off, basically, but then he went a bit funny and started acting all – he was joking and got me coffee. And then eventually he told me to piss off again. The whole thing was weird.\"</p>\n<p>\"You're – sure it was Malfoy?\"</p>\n<p>\"Of course I'm <i>sure</i>, Hermione, I know what <i>Malfoy </i>looks like.\" The silence after this feels awkward, especially with the odd, shrewd look Hermione gives him. Harry clears his throat. \"We spoke. It was obviously Malfoy. Thing is, he had a fake name on his name tag. Well, it said Drake, and I really don't think people call him that, or at least, they didn't used to.\"</p>\n<p>\"Well.\" Hermione picks up her tea again, sipping it. \"I did hear – that he'd left home, and that it wasn't on very good terms with his parents.\"</p>\n<p>Harry frowns. \"Where'd you hear gossip about Malfoy?\"</p>\n<p>Hermione gives him another strange look, and Harry revisits the eager tone of his question with a pang of embarrassment. He didn't mean to sound quite so interested; he doesn't know why things about Malfoy always end up embarrassing. \"You may remember I go to school,\" she says. \"With other Hogwarts graduates.\"</p>\n<p>Harry scowls.</p>\n<p>\"Blaise Zabini is there, specifically,\" Hermione concedes. \"I don't know what <i>he's</i> doing trying to work in law, the smarmy bastard, I don't like where that's going.\"</p>\n<p>Harry snorts. \"Me neither,\" he says.</p>\n<p>\"But I overheard him talking to Anthony Goldstein about it,\" says Hermione. \"About Malfoy. Said he hasn't spoken to Malfoy in at least a year, but he heard from his mother that he's fallen out with his parents.\"</p>\n<p>\"Wonder why,\" Harry says thoughtfully. He stares in the direction of the kitchen window, not really seeing it, until something occurs to him – \"Do you think it could be because he's gay?\"</p>\n<p>Surprised, Hermione says, \"Is he gay?\"</p>\n<p>\"Well, I thought,\" says Harry, flushing. \"I thought we'd assumed that from – when we saw him in the pub.\"</p>\n<p>\"I suppose, but we were only assuming,\" Hermione says slowly.</p>\n<p>\"That boy was in the coffee shop today, though! The boy we saw him with. In the pub. Perhaps they're – you know.\"</p>\n<p>\"<i>You know</i>?\" says Hermione, rolling her eyes. \"What, you can't say it? Dating? Shagging?\"</p>\n<p>\"I can say it,\" says Harry, determined to look as though this idea does not cause him any discomfort at all. He will not have Hermione thinking he's some kind of bigot. \"Maybe they're <i>shagging</i>. And if they are, purebloods aren't really best pleased with that, are they? You know, they've got that whole thing about heirs and bloodlines. And Malfoy's an only child, as well. Could you imagine Lucius Malfoy being all loving and accepting with his gay son?\"</p>\n<p>\"I suppose that could be it,\" Hermione says. \"Especially considering the only child thing...it'd be the end of the Malfoy line, wouldn't it? I can't see them taking too kindly to that. But then – why would Malfoy only just be leaving home recently, when we saw him with that boy so long ago?\"</p>\n<p>\"Maybe his parents didn't know until recently,\" Harry suggests. \"If I were to – if I was – I think it'd make sense, if you knew people weren't going to like it, to not say anything at first – to wait and see when it was worth making the fuss.\"</p>\n<p>Hermione gives him another curious look, and for a moment Harry's heart seizes up, and he remembers the boys' backs in the coffee shop, <i>Malfoy's</i> back, and other things – the hip bones that appear when boys lift their arms too much and their shirts lift, too – the flexing of arms reaching for the snitch or swinging bats at bludgers – Quidditch changing rooms – and he's afraid he's said too much. He thinks, panicked, of Ginny, and yes, the hollow in his stomach is still there, and the memories of her smile and her breasts and the way she would curl up to him in bed, smaller and softer but still able to knock him out, if she had to. It's okay.</p>\n<p>\"Would you?\" Hermione says lightly. \"I don't think I would. I'd want to be honest about it.\"</p>\n<p>\"Yeah,\" says Harry, staring into his mug. \"Well.\"</p>\n<p>They sit quietly while they finish their tea, and when Hermione goes up to the sink to wash her mug, she stops suddenly, back to him, and says, \"Harry?\"</p>\n<p>Harry swallows the last dregs of his own tea and says tentatively, \"Yes?\"</p>\n<p>She takes a deep breath, as though afraid of starting something she doesn't want to start, and blurts out, \"Is there anything you want to talk about?\" as if she cannot restrain it anymore.</p>\n<p>Harry shrugs, staring determinedly back at his mug, tracing the edges with his thumb. \"Not particularly,\" he says.</p>\n<p>There is a long silence, so long Harry thinks Hermione is going to drop it without further comment, but finally she says, \"Okay.\"</p>\n<p>Harry clears his throat and looks up. Hermione is facing him now, arms crossed, looking at him closely. \"Just wondering what Malfoy's doing <i>there</i>, really, specifically,\" he says. \"I mean, that's a big leap – leaving home and then working in a muggle place when all your life you've hated muggles.\"</p>\n<p>\"Well,\" says Hermione. \"Think about it logically. If his parents really aren't pleased with him, do you think they're funding him? If he tried to get a job in a wizarding establishment, do you think he'd get it with a dark mark?\"</p>\n<p>\"True,\" says Harry. Possession of a dark mark counts as serious criminal history in a background check, and is therefore very likely to prevent someone from earning a job. </p>\n<p>Hermione sits back down at the table and fixes him with one of her shrewd looks, making him feel, as usual, uncomfortably as though she can read his mind. \"You have that manic look in your eye,\" she says. \"You're not planning to stalk him like you did in sixth year, are you?\"</p>\n<p>\"That <i>manic</i> look?\" says Harry, startled into laughter. \"I do not have a <i>manic</i> look. And I hardly <i>stalked </i>him, either.\"</p>\n<p>\"Oh, hardly,\" says Hermione. \"When Ron gets back I suggest we ask him about that.\"</p>\n<p>\"Okay, I suggest we do,\" says Harry. \"Because I did not <i>stalk</i> Malfoy. Ron will have my back.\"</p>\n<p>Ron is a filthy traitor.</p>\n<p>\"Mate, you were watching him on the Marauder's Map at night,\" says Ron when Harry protests above Hermione's laughter. \"Don't think I didn't notice.\"</p>\n<p>\"Oh, fuck you, Won Won,\" says Harry, and Hermione laughs harder. \"What were you doing, hovering round my bed at night?\"</p>\n<p>Ron snorts. \"Just living right next to you with my eyeballs in working order, git,\" he says. \"Maybe if you'd shut your curtains before wanking to Malfoy's little dot – \"</p>\n<p>Harry chokes, and Ron roars with laughter.</p>\n<p>\"Oh, disgusting,\" says Hermione. \"You always have to take it too far – \"</p>\n<p>\"You're going to kill me,\" Harry wheezes.</p>\n<p>\"Isn't he gay?\" says Ron. \"Maybe he'd like to know – \"</p>\n<p>\"Okay, okay, okay,\" says Harry, and he thinks he might actually be <i>blushing</i> for no good reason at all. He is almost twenty and entirely able to joke about wanking with his friends without getting all embarrassed, okay. Just because it's being implied that he'd wank to a bloke doesn't mean he has to get embarrassed. It's not like he's ever gone that far. ...more than a couple times. Accidentally.</p>\n<p>What is wrong with him?</p>\n<p>By the time Harry goes to bed, he's still thinking about Malfoy.</p>\n<p>He hasn't felt so curious about anything in a long while. In school, and during the war, he was always running after something, always burning with curiosity over what something could mean, what someone was up to, what was going to happen next. His life since then has had nothing like that. From here, it looks like an expanse of nothingness, of sleep and caffeine and alcohol and missing people, where the only big questions are <i>are you going to accept that auror offer</i> and <i>if you don't, what will you do</i> and <i>is there anything you have to do anymore?</i> and these are bigger, more open ended questions than <i>what will Voldemort do within the next month</i> and <i>what is Malfoy trying to accomplish for him as soon as possible</i>. Harry cannot hunt desperately for the answers in other people and other things; he cannot walk through halls at night in the hope that he'll overhear a key conversation or find an important clue. He can't fight for the answer or run to seize it. He has to figure it out quietly, within himself, he has to think and think and think, and he doesn't know why it's so hard to do.</p>\n<p><i>Why is Malfoy working in a coffee shop in muggle London</i> is a much simpler question, he thinks. It has a concrete answer, probably, and a clear path to working it out, the sort of path he's always followed – nosy persistence. It's a new, fresh question, with a straightforward but not especially easy solution, a solution that requires he get out of this flat and put on actual clothes and speak to people other than Ron and Hermione. Finding out what's going on with Malfoy is something to do, something to discover, and he hasn't had anything like that in what feels like so long.</p>\n<p></p>\n<p>***</p>\n<p>It's drizzling out. Harry is surprised to find Malfoy outside, having a cigarette with Behind The Counter Girl from yesterday. They're not wearing their smocks and name tags. She sees Harry first, over Malfoy's shoulder, and must mutter a warning, because Malfoy turns around. He lifts an eyebrow. \"Hello, Potter!\" he calls, his tone obviously mocking or at least very false, and the girl looks away, laughing quietly into one fist. \"I'm very surprised to see you here,\" Malfoy continues with heavy sarcasm. \"Nothing to do, I suppose?\" He takes a drag on his cigarette and looks at Harry expectantly.</p>\n<p>Harry doesn't know what to say. Malfoy is behaving very oddly again, unlike the angry version of Malfoy who kicked him out of the shop at the end of the day, and it throws him off.</p>\n<p>Harry's certainly <i>not</i> a stalker; he knows that.</p>\n<p>\"Can I talk to you?\" Harry says finally.</p>\n<p>\"About what?\" says Malfoy.</p>\n<p>\"Well, I was thinking – maybe – we could – have lunch or coffee or a drink or something some time?\"</p>\n<p>Malfoy, who was lifting the cigarette to his lips again, pauses, and his eyebrows seem ready to disappear into his hairline forever. His friend looks up very quickly; she seems to be making an extraordinary effort to keep back an incredulous smile or a laugh, and Harry does not appreciate it.</p>\n<p>\"Potter...\" says Malfoy. His eyebrows don't seem prepared to lower any time soon. \"Did you just ask me out?\"</p>\n<p>Harry blushes and is furious with himself for doing so. He didn't think of it sounding like <i>that</i>. \"Not like...\" he falters. \"<i>No</i>, I just want to talk to you, Malfoy!\"</p>\n<p>\"Forgive me if I'm surprised by your desire to speak to me,\" says Malfoy. \"You weren't always so keen on it at school.\" He smirks. \"And what do you mean <i>not like</i>, Potter? Not like what?\"</p>\n<p>Harry is intensely embarrassed. \"Oh, shut up, Malfoy, I just want – \"</p>\n<p>\"To talk to me, I thought, but now you're telling me to shut up.\"</p>\n<p>Harry is now growing frustrated in a way he'd forgotten he could feel, in a way worse than yesterday, a way that he hasn't felt since – well, the last time he <i>really</i> argued with Malfoy, in school. It seems only Malfoy winds him up quite like this; it's not the same as the hurt he felt when Ginny broke up with him, or the way he sometimes feels living with Ron, though he couldn't tell you why it's different. It prickles differently, stays there under his skin, just irritating enough to make him unable to forget it. And Harry has no idea why he is here trying so hard to speak to someone who only winds him up. \"I don't know why I'm bothering with this,\" says Harry.</p>\n<p>\"Me, neither,\" says Malfoy, tossing his cigarette to the pavement and grinding it out with his toe. \"But my shift's over and I've got plans, Potter, so I'll be seeing you. Or not, if I'm lucky.\"</p>\n<p>Before Harry can say anything else, Malfoy and his coworker stride off down the street toward the tube, leaning close and talking rapidly; Harry hears Caitlin – he remembers her name at the last minute – say, \"- the <i>fuck </i>– \" through laughter, and he kicks the side of the building, instantly regretting it when the pain blooms in his big toe.</p>\n<p>Okay, so Harry just needs to get here earlier if he doesn't want Malfoy to storm off and avoid him. If Malfoy's working, he won't be able to run away.</p>\n<p>This sounds a little creepier than Harry meant it to, even in his head.</p>\n<p>He's not a stalker.</p>\n<p>The next day, Malfoy's not there. Caitlin is, and he quickly backs out of the shop, stealthily avoiding her because he fears if she sees him, she will misread his intentions – he's really, really <i>not</i> a stalker.</p>\n<p>Sunday, Harry can't escape his friends, not when Ginny, Neville, Dean, and Luna are coming round for tea. He smiles and laughs at the right places and lets them discuss what to do for his upcoming birthday, knowing they know him well enough not to do anything that involves loads and loads of people. When Ginny hugs him good bye, he lets her, because it's normal and fine and they're all friends. He thinks she's wearing new perfume. She doesn't smell like flowers like he's used to.</p>\n<p>Monday, Malfoy's back at work, and he's behind the counter with two other people, who he is not chatting to as much. When he sees Harry walk through the door, his eyes narrow, and he bustles off to busy himself with something behind the counter, sending another bloke to the till.</p>\n<p>After ordering, Harry inches over to the other side of the counter, to the glass cased filled with pastries, over which he can see Malfoy. \"Malfoy,\" he says.</p>\n<p>Malfoy ignores him.</p>\n<p>\"Malfoy,\" Harry repeats.</p>\n<p>He is again ignored.</p>\n<p>\"Malfoy.\"</p>\n<p>Malfoy slams down the bottle he's holding and storms off into a room beyond the public space. The other people behind the counter are staring. Harry slinks shamefully out of the shop.</p>\n<p>Tuesday, Malfoy hides behind the counter again, ignoring Harry hovering about until one of the other boys behind the counter says ominously, \"You need something, mate?\" and he has to leave in shame again.</p>\n<p>Wednesday, Malfoy's nowhere to be found, and Harry must once again stealthily avoid Caitlin.</p>\n<p>Thursday, Malfoy's back, wiping down a table when Harry walks through the door.</p>\n<p>Harry quickly approaches him, reckoning this is a perfect time to speak to him, when he isn't behind the counter doing anything for a customer in particular. \"Malfoy,\" he says, the moment he's right behind him.</p>\n<p>Malfoy jumps and bangs his knee on the chair next to him. \"<i>Fuck</i>!\" he bursts out, throwing down his cloth, \"Are you trying to <i>annoy me into submission</i>?\"</p>\n<p>The few patrons scattered about the shop stare. Caitlin is back behind the counter, and she looks quite alarmed. Harry wonders if she is debating interference.</p>\n<p>\"What is wrong with you?\" Malfoy continues, glaring.</p>\n<p>\"There's nothing wrong with me,\" says Harry, staring determinedly back at him and not entirely sure he is telling the truth.</p>\n<p>The look on Malfoy's face indicates that he does not on any level believe this. He has very expressive eyebrows, Harry notices.</p>\n<p>\"Why do you keep coming <i>back</i> here?\" Malfoy insists. \"Caitlin says you turned up yesterday, and Saturday as well.\"</p>\n<p>Well, so much for stealth on those particular occasions.</p>\n<p>\"I told you,\" says Harry, fighting embarrassment. \"I want to talk to you.\"</p>\n<p>\"I have nothing to say to you!\" Malfoy insists.</p>\n<p>\"Why not?\"</p>\n<p>Malfoy's brow is wrinkled with incredulity. \"Are you – you're desperate. What is...I don't understand.\" He looks toward the heavens, as though consulting with a deity for some kind of explanation, and stays like this for a few moments, arms outstretched and palms facing upwards.</p>\n<p>\"Er,\" says Harry.</p>\n<p>\"I have no idea,\" Malfoy says finally, moving a hand to his hip, the other pressed to his face, \"Why you want <i>so desperately</i> to speak with me, but I think perhaps you have gone completely off the rails, and I'd really rather you bother somebody else with that. Haven't you got <i>friends</i> to annoy with your mental breakdown?\"</p>\n<p>\"I <i>haven't</i> gone mad,\" says Harry.</p>\n<p>\"Also,\" Malfoy continues, \"I think you are alarming everyone who works here, and before long it will reach a breaking point and someone will phone the police.\"</p>\n<p>\"Drake, is he bothering you?\"</p>\n<p>Harry turns. The boy from the pub is back. His dark hair is shorter now but still falling in his face, he is dressed well enough to be wearing a tie, and he is glaring at Harry. Harry didn't notice him when he entered the shop; he was too focused on Malfoy.</p>\n<p>Like he did in the pub, Malfoy reacts to this with a glare completely at odds with the boy's protective expression. \"I can handle myself, Patrick, thank you,\" he says, his tone polite but his eyes looking daggers.</p>\n<p>\"Well, he doesn't appear to be getting the message,\" says the boy, Patrick, apparently.</p>\n<p>\"I really don't need you helping me,\" Malfoy insists, and Patrick's mouth twists with some undefinable, but certainly negative, emotion. \"Potter, I don't know why you're being so weird, but I'd really appreciate it if you – were not. I have no desire to explain myself to you.\"</p>\n<p>It is at this point that it really hits Harry what he has been doing, how weird it must have looked to everyone, how weird it probably <i>is</i>, that he's trying to force someone from his childhood he didn't even get along with to tell him about his life, when he's expressed very clearly that he doesn't want to. He's hit with that same sense he got when Ginny broke up with him, when Sirius fell through the veil, when Dumbledore died, when he died himself – that sense that he's watching himself from the outside with vague horror.</p>\n<p>He feels humiliated.</p>\n<p>He doesn't know how these innocent ideas of his always get so blown out of proportion. Maybe it's something to do with how little he thinks them through before starting. But Malfoy wasn't supposed to get <i>freaked out</i> or anything. He was just supposed to – give in, eventually, and tell Harry everything, and – Harry doesn't really know what else, after that.</p>\n<p>\"His name's really Draco, you know,\" says Harry, for no good reason, what is <i>wrong</i> with him, and he all but runs out of the coffee shop.</p>\n<p></p>\n<p>\n<b>September 2000</b>\n</p>\n<p>September has just begun, and Harry likes September. It always feels more like a new year than January does, bright and crisp and reminding him of the smell of new parchment and ink and books. Hermione tells him that the Jewish new year is, in fact, in September, not January, and he thinks they've got it right. He always feels on the edge of something in September.</p>\n<p>This September, Harry feels alright – not wonderful, but definitely more hopeful than he has in a while, like he usually does. At least, when he has to put a Weasley sweater on to go outside, he thinks of unwrapping these sweaters in his four poster in Gryffindor tower, and that makes him feel like himself. He's him, Harry, even if he's not in Gryffindor tower anymore, and even if nobody is actively trying to kill him, as far as he knows. He starts taking walks again, and he spends long nights around Hermione's conjured blue flame, laughing and discussing their friends and Hermione's new classes and the first new products George is creating since the war, which have now, in trials, singed off Ron's eyebrows, stuck his tongue to the roof of his mouth, turned his hair purple (\"<i>All</i> of my hair,\" he informs them darkly, which sends Hermione into a giggle fit), webbed his feet, given him a lisp, sealed his mouth shut, shrunk only one of his arms, and coated him in fungus, among other colourful things. According to Ron, though he doesn't put it in quite the same words, George has suddenly emerged from his grief as more of a mad scientist than he's ever been, more recklessly creative and excited than Ron has ever seen him. \"I really am glad,\" says Ron, \"But I don't remember signing up for test subject. I'm afraid I'm going to come home one day missing a bollock.\"</p>\n<p>Harry starts reading books, muggle and wizarding, that Hermione gives him, for something to do. He also borrows a cookbook from Molly Weasley, because cooking is something he's actually quite good at, and it's a been a very long time since the Dursleys. He doesn't have to think about being told he \"might as well be useful,\" or getting up early to cook their breakfasts, or Aunt Petunia whacking the back of his hands with a wooden spoon when he made mistakes or didn't understand what he was meant to do. </p>\n<p>He finds out from Ginny that Ernie Macmillan is seeing a bloke now, and he allows himself to wonder for a moment if he feels a certain way about blokes, but quashes it again in a panic, because he doesn't understand how that can be. He still thinks about Ginny a lot, though he can go for days at a time now without thinking of her smile and feeling an ache in his chest. </p>\n<p>The only time Harry is really reminded of Malfoy, other than his embarrassed, confused thoughts at night when he can't sleep, is when he visits his godson because he hasn't done so enough. Teddy is two and growing fast; he babbles a lot and toddles about Andromeda's house and knows Harry's name, and this pleases Harry rather a lot, actually, hearing this little boy say his name in his little voice. His hair changes like Tonks', and he has Remus Lupin's eyes, but Harry finds he can look at him now without any violent tugs of despair. He buys him presents, because he thinks this must be how you let a child know you love him; Dudley got loads of presents, and Harry got none, and that seemed to mean a whole lot when he was small. While Harry chats to Andromeda over tea and plays with Teddy, he remembers that Teddy is technically Malfoy's cousin, though they've obviously never met, and it's strange. </p>\n<p>And then comes the third Malfoy encounter.</p>\n<p>It happens in a pub again.</p>\n<p>Harry is out with Ron and Hermione and Dean and Luna – Ginny and Neville are otherwise occupied, and Harry is <i>not </i>relieved, of course – and he's approaching the bar for more drinks when he sees Malfoy. He's sitting at the end of the bar, throwing back shots with a group of girls; Harry's pretty sure he's the only bloke among them. They're all laughing and singing loudly, a song Harry doesn't recognise, and most of them are off key, Malfoy included.</p>\n<p>It's definitely Malfoy – there's no mistaking him with that hair colour and that particular set of those particular bony shoulders, not that Harry has ever spent an extraordinary amount of time examining Malfoy's appearance, and anyway, Harry thinks he sees his co-worker from the coffee shop among the girls, too.</p>\n<p>This time, Harry feels a pang of despair and tries desperately to avoid him. He is <i>not</i> going to embarrass himself again. It's September; things are supposed to be looking up. <i>I'll tell the others we need to go somewhere else</i>, he thinks frantically.</p>\n<p>It doesn't work.</p>\n<p>\"Fucking hell, is that Harry Potter <i>again</i>?\" Malfoy shouts, and Harry realises that he is now experiencing the inverse of their last pub encounter – while Harry is only a little bit drunk, just enough to have been grinning a lot before he left his friends, Malfoy is very clearly wasted. \"Hold on a moment, ladies,\" Malfoy says grandly, and he strides over to Harry, who simply stands there, shell shocked. The girls are all staring; two have burst into giggles.</p>\n<p>\"Potter, are you stalking me?\" Malfoy asks, but thankfully, he lowers his voice and leans conspiratorially close, in the way of a drunk telling a secret. His breath smells of whiskey. </p>\n<p>\"I'm not,\" says Harry. \"I swear I didn't have a clue you'd be here – \" Great, he sounds desperate and defensive. \"I could, ah – leave, if – \"</p>\n<p>\"No, no,\" says Malfoy. He looks at Harry carefully, grey eyes a bit bleary. A lopsided smile steals across his face; Harry's never seen an expression like that on him, and it's. Well, it's better than a sneer, he acknowledges. \"Let me buy you a drink, Potter.\"</p>\n<p>\"<i>What</i>?\" says Harry.</p>\n<p>\"Look, I said I couldn't be mad at you for walking into a place,\" says Malfoy, and Harry has no idea what he's on about, \"So I'm going to buy you a drink, okay? You wanted to have a drink with me. You said it. Come on.\" He grabs Harry by the elbow and hauls him over to the bar before Harry can even think to protest. He glances back at his friends and sees them all staring, probably alerted to the situation by Malfoy shouting his name like that; he hopes there aren't any <i>other</i> wizards or witches in hiding in this pub. He stares forlornly back at them. He doesn't know if he is conveying \"help\" well enough, because they do not move.</p>\n<p>\"My friends think you're my crazy ex,\" Malfoy informs him happily after ordering. He rests sharp elbows on the bar and grins at him. The sweater he's wearing is too big, making him look even skinnier, but it's clearly more stylish and more expensive than Harry's, and a colour that makes Malfoy's grey eyes look almost blue. </p>\n<p>Harry splutters. \"Have you told them they're wrong?\" he asks.</p>\n<p>Malfoy shrugs one of those bony shoulders of his, still grinning away like a madman. Harry feels distinctly wrong footed. He resists the urge to pinch himself. \"It's not my fault if you go round stalking people like a crazy ex,\" Malfoy insists.</p>\n<p>\"I do not <i>stalk</i> – \" Harry begins.</p>\n<p>Malfoy puts a finger to Harry's lips, startling him.</p>\n<p>\"Ssh,\" he says, and he removes the finger as quickly as he put it there. Harry licks his lip and tastes the strange, salty taste of skin. <i>Malfoy's </i>skin.</p>\n<p>\"Did you just...\" Harry says, trailing off, because it is quite apparent that yes, Malfoy just shushed him.</p>\n<p>\"I touched you,\" says Malfoy. He puts a hand to his own mouth, then laughs loudly, sharply, and Harry jumps. \"Sorry, Potter, that's awfully rude of me. You see...\" He leans closer, as if to tell a secret. \"I'm drunk,\" he whispers. He smells not only of whisky but of something like vanilla, and coffee, and cigarette smoke. </p>\n<p>\"I noticed,\" says Harry.</p>\n<p>\"<i>Quite</i> drunk, Potter, you have to understand. Drunker than I <i>meant</i> to be, I mean. I'm sure this lot thinks it's very funny.\" He waves his hand in the direction of his friends, hits a passing woman on the arm, and does not apologise. \"It's <i>odd</i>, that I'm running into you again, isn't it? This is all quite surreal.\"</p>\n<p>\"Yeah, it is,\" Harry says. This he can emphatically agree with. He has tried to make peace with his embarrassment and accept that Malfoy is no longer a part of his life, though he doesn't like to think too hard about why it matters whether Malfoy's in his life or not – and now here he is, out of the blue, buying Harry a drink and smelling like bloody vanilla. Two months ago he didn't want a thing to do with Harry, and now he has offered to <i>buy him a drink</i>. \"My life's fucked up,\" he informs Malfoy.</p>\n<p>\"Cheers to that,\" says Malfoy, grabbing his own pint, clinking it against Harry's, and taking a large swig. Harry wonders if he should really be consuming more alcohol. \"Well, why the fuck are we sitting here just <i>chatting</i> on?\" Malfoy continues, as though they've been talking for ages. \"Obviously you've got <i>reasons</i> you wanted to have a drink with me, way back two months when. Nosy reasons, as fucking always with you.\" He reaches into his pocket for his cigarette packet, and he says, \"You don't mind, do you? Well, I don't care, anyway, I don't know why I asked.\" He lights up.</p>\n<p>\"You smoke a lot, don't you?\" Harry observes.</p>\n<p>Malfoy shrugs. \"I've done worse,\" he says, cigarette between his lips, and the way he smiles when he removes it makes Harry feels very odd indeed. \"Do you smoke?\"</p>\n<p>\"Sometimes,\" says Harry.</p>\n<p>\"You could have one, if you want, I suppose,\" says Malfoy, and Harry reckons why the fuck not – the situation could not get any stranger any faster – and lights up, too, with the very muggle lighter Malfoy offers.</p>\n<p>He glances over at his friends. Ron is still gaping, while Hermione and Dean seem to be deep in conversation, glancing repeatedly in his direction. He wonders if they're debating whether or not to interfere. Luna is looking happily around the pub, twirling several strands of hair around her finger.</p>\n<p>Next to Harry, meanwhile, Malfoy is sighing happily. He appears to be in the midst of a religious experience with his cigarette. \"Oh...Merlin, I mean, Christ, I mean, <i>oh</i>, I can say Merlin in front of you!\" He sits up very straight, straighter than even usual, and gives Harry a wide eyed look. He breaks it with another laugh. \"I forget this makes me feel drunker. I'm <i>so</i> very drunk, Potter, I shouldn't be talking to you. Oops.\"</p>\n<p>\"Oops,\" Harry echoes. He takes a drag on the cigarette and wonders if he should be letting Malfoy chat to him like this. He thought, for a moment, <i>maybe Malfoy will tell me things now</i>, and now he feels awful for thinking it. He can't take advantage of people. It's not okay. </p>\n<p>\"So, what <i>is </i>going on in the magical world, then?\" Malfoy asks, having enough good sense left to lower his voice a little, at least. He does not meet Harry's eyes, choosing to stare at the drink in front of him instead. \"I've been wondering. I haven't, ah – heard a lot lately. Can't really get the Prophet where I am, you know.\"</p>\n<p>Harry doesn't know, actually, but he says, \"Nothing much, really.\" He pauses. \"I mean, how long have you been – out of it?\"</p>\n<p>\"Haven't heard anything since April,\" says Malfoy stiffly. \"Not even on my bloody birthday.\" He drops his head in his hands suddenly, sighs, and looks back up, raking a frustrated free hand through his hair. Harry wonders if he would have shared that last bit sober.</p>\n<p>\"Well,\" says Harry, awkward. \"Yeah, nothing much, really, since then.\"</p>\n<p>\"You and your ex-girlfriend out of the papers yet?\" Malfoy says, a little more maliciously than is really necessary, lifting his cigarette back to his smirking lips.</p>\n<p>Harry feels the familiar sharp pang he gets whenever this is brought up. He scowls. \"I think so, finally.\"</p>\n<p>\"What happened with that, really?\"</p>\n<p>\"Is that any of your business?\"</p>\n<p>\"I don't know, is <i>my</i> life any of <i>your</i> business?\" says Malfoy, quirking an eyebrow in a gesture Harry has come to notice as familiar after only a week of hovering around the coffee shop – and then a couple months of thinking about it. Once or twice. \"I seem to recall you obsessing over what could be the cause of my muggle life. Or at least, that was how I interpreted your stalking.\"</p>\n<p>\"Have you got a muggle life?\" says Harry, choosing to ignore the stalking part with dignity. A little bit of dignity.</p>\n<p>\"Well, I'm only working at a muggle shop and wearing muggle clothes,\" says Malfoy slowly, as though speaking to a small child. \"I've only got muggle friends right over there. I'm only <i>living </i>in a muggle place with them, so <i>yeah</i>, I'd say so.\"</p>\n<p>\"Well,\" says Harry. \"I didn't know <i>all</i> that.\"</p>\n<p>\"Well, now you do, happy?\" says Malfoy. \"Now you have to tell me about you and the Weasley girl.\"</p>\n<p>\"Er,\" says Harry.</p>\n<p>\"You have to,\" Malfoy insists, brandishing his cigarette rather dangerously close to Harry's face.</p>\n<p>\"Okay, watch it,\" says Harry. \"She split up with me. It's not that dramatic. She...didn't want to keep it up.\"</p>\n<p>Malfoy looks at him closely, as though analysing him. Harry feels strange. He's not sure Malfoy has ever looked at him this intensely, and at this close a range. \"She didn't <i>love</i> you,\" he sighs, smirking, and he tips his head back a bit and takes a drag on his cigarette as though all is right with the world.</p>\n<p>Harry bristles. \"You don't have to look quite so pleased about it,\" he says, hurt and unsure why he should expect Malfoy to do anything but make him feel hurt and frustrated.</p>\n<p>\"My boyfriend didn't love me, either,\" Malfoy volunteers.</p>\n<p>\"Oh,\" says Harry. Well, there's confirmation for – the gay thing, although perhaps the confirmation came when he implied Harry could conceivably be his ex. Even though he couldn't. And does Malfoy realise that in saying this, he's put them on common ground? Did he do it intentionally? Surely Malfoy would rather have power over him than be on common ground, Slytherin that he is.</p>\n<p>\"And I'm stuck living with him still.\" Malfoy wrinkles his sharp nose, and then adds abruptly, \"It's <i>not</i> really that dramatic, you know, for me, either. I don't know what kind of <i>drama</i> you expect.\"</p>\n<p>\"Er, what's not? The thing with your – boyfriend?\"</p>\n<p>\"Why I'm here in muggle London, you twat. Fucking – having a drink with <i>you</i>, for some reason. It's just I wanted to stop being an idiot and having an idiot life.\"</p>\n<p>\"An idiot life?\" Harry repeats.</p>\n<p>\"Yes,\" says Malfoy. \"An idiot life, not knowing anything about the world around me. Living in my little manor bubble. It was driving me mad. I was already practically mad after – all that war shit, you know.\" He squints at Harry, leaning quite a bit closer than necessary. \"You know,\" he repeats, as though he's telling himself so, as well.</p>\n<p>\"I...yeah,\" says Harry, alarmed by the proximity.</p>\n<p>\"Yes, well, I felt stupid,\" says Malfoy, pulling back. \"I don't like to be stupid, Potter. I'm not stupid.\"</p>\n<p>\"I don't think you're stupid,\" says Harry, because this is actually true. He has always thought Malfoy was a bit of a prat, was nasty and rude in school, but he never thought he was stupid. Mad, though, he's beginning to think he can't account for, although he reckons he's no stranger to making a prat out of himself when he's been drinking.</p>\n<p>\"Good,\" says Malfoy. \"That's one thing that isn't stupid about you, and there are not a lot of those.\"</p>\n<p>\"Gee, thanks,\" says Harry.</p>\n<p>\"You are very welcome, Potter,\" says Malfoy graciously, and then he launches back into his explanation, hands and cigarette flying everywhere dangerously, gestures becoming bigger as he goes. \"But you see, stupid is just – it's not a good thing for me to be. I'm used to being the smart one, compared to my friends – and did you know I was second in our class? I was, 'til sixth year fucked me up, and then seventh year – wasn't a real year, really, and I never got my fucking NEWTs. It's mostly about being the best, really. You can't be the best when you're stupid – then mud – muggleborns beat you in school. And it's also being ignorant, and Slytherins, we can't be <i>ignorant</i>, that's – you have to know what's going on around you. You have to be aware of your surroundings, your position, the position of the people around you. How can you expect to gain any type of power if you don't know what's going on <i>around</i> you, do you know what I mean? And I didn't know anything about muggles. I just walked around assuming I was better, that my family was better, and then my family – lost. I didn't know enough. I just listened to the people feeding my ego and assumed that was enough, and it wasn't. I lived in my manor <i>bubble</i>, like I said, it was a bubble.\" Malfoy takes a breath and frowns. \"I have just told you quite a lot.\"</p>\n<p>There is a long moment after this in which neither of them talk, because Harry doesn't know what to say, the only noise coming from the people talking and laughing and drinking around them. Harry smokes his cigarette and watches Malfoy do the same, that frown still on his face. Harry wonders if there's more to the story; he <i>knows</i> Malfoy fought with his parents, and that must be involved somehow. He glances back at his friends, who seem to have opted for not interfering for now, and then at Malfoy's friends, who are all talking and laughing unconcernedly again.</p>\n<p>Meekly, worrying over taking advantage of Malfoy's intoxication but blundering on anyway, Harry says, \"Does it have anything to do with your parents?\"</p>\n<p>Malfoy whips around on his stool, narrowing his eyes. \"Why would you say that?\"</p>\n<p>Harry shrugs. \"I don't know,\" he mumbles. Bringing up the gay part, even if Malfoy has just told him about his ex-boyfriend, is probably not the most tactful way to do this, and it makes him nervous, so he says, \"<i>They're</i> not very fond of muggles, are they? Thought maybe you – had a disagreement. Or something.\"</p>\n<p>Malfoy sighs loudly, puts his cigarette out, and reaches for another. Harry, who has put his out, too, refuses when Malfoy holds the pack out to him. \"It wasn't that they were <i>disagreeing</i> with me,\" Malfoy says, the cigarette dangling out of his mouth as he fumbles with that muggle lighter he can apparently work just fine, despite it being a muggle creation – although Harry supposes if he's been among them since April with a smoking habit, he'll have learned quickly. \"It was sort of the opposite. <i>Sort </i>of.\" He manages to get the cigarette lit, takes a drag, and takes a long moment to continue. Harry watches Malfoy issue a stream of smoke out of pursed lips and waits. \"They <i>did</i> disagree with me, about a lot of things,\" he says finally. \"But they were just – letting me do what I wanted, anyway.\"</p>\n<p>\"Isn't that a good thing?\" Harry says. \"Isn't that what parents are sort of – meant to do, sometimes?\"</p>\n<p>Harry supposes he doesn't know loads about what parents are or aren't supposed to do, and he waits for some kind of slight about his lack of them, but it does not come. Malfoy just shakes his head, rather harder than necessary. \"It's hard to explain,\" he insists, still gesturing quite a lot while he speaks, something Harry recognises from across the Great Hall at school. \"They were – walking on eggshells, you know? They're guilty. They're not guilty about the right things, though – or not <i>all</i> the right things. Mainly, they're guilty about putting me through shit. So they're really very aware of it, of putting me through shit. So, see, I started to do all sorts of things they didn't like, sort of on purpose. I mean, I wanted to do them, anyway, but I really shoved it in their faces. I used to be afraid to let them know certain things about me, but I just stopped being afraid, when I realised I could do things they didn't want, if they did things I didn't want, you know what I mean?\"</p>\n<p>\"Er,\" says Harry.</p>\n<p>Like any drunk person uttering the words, \"You know what I mean?,\" Malfoy doesn't really seem to expect an answer. He continues. \"I wanted to see what they'd do. And <i>what</i> did they do?\"</p>\n<p>\"What did they do?\" Harry says.</p>\n<p>\"<i>Nothing</i>,\" says Malfoy. He blows smoke out of the corner of his mouth, then adds, \"Not a <i>thing</i>.\"</p>\n<p>Harry takes a moment to wonder if Malfoy has always had this flair for the dramatic, or if perhaps he is just very drunk – and then he remembers several impressions of fainting in front of dementors across the Great Hall, and a certain Hippogriff related \"injury.\" Yes. Malfoy has always been like this. </p>\n<p>And also he's very drunk. </p>\n<p>\"Er – what sort of things were you doing?\" Harry asks, wondering if this is going too far, but Malfoy just answers, as though by now he's on a roll and might as well keep going.</p>\n<p>\"Blokes, for one,\" he says, and Harry must be visibly shocked by his candour, because Malfoy smirks at him. \"Does that make you uncomfortable?\" he asks, like the idea delights him.</p>\n<p>Harry feels a blush creeping up his neck and to his cheeks, and he knows it's obvious, but he says, \"No.\"</p>\n<p>Malfoy snorts gracelessly. \"Well, I exaggerate a bit. It was one bloke. I had a boyfriend. The one who didn't love me, remember? I <i>was </i>pretty mad about him, but I made sure they knew. And I was collecting muggle things.\"</p>\n<p>\"You were <i>what</i>?\" says Harry, head reeling not only from the idea of Malfoy up and deciding to <i>collect</i> muggle things, but also from the openness with which Malfoy is discussing being \"mad about\" someone. Malfoy is really drunk, he thinks, and this is really bad, the way Harry's letting him go on and say things he might regret.</p>\n<p>\"Collecting muggle things!\" Malfoy repeats, eyes now alight with enthusiasm. \"They have so many fascinating things, you must know that, you grew up with them. They've got <i>televisions</i>, and films and cinemas and things. Films are <i>marvelous</i>. It's like photos and portraits and all that, except you can't talk to them. I learned that the hard way, in public, you know, that you can't talk to them, but sometimes I still can't help it.\" He says this as though it's a problem to which anyone could relate. \"And also they've got CDs and tapes and stereos and those clickers for the television – my friends keep getting angry because I take them apart so thoroughly that nobody can get them back together and we have to buy new ones unless we want to get off our arses, which nobody does. But just think – these things, they work <i>without magic</i>. And I like muggle clothes. I like them much better. You've got so many more options.\"</p>\n<p>Harry stares.</p>\n<p>Malfoy rambles on and on about \"marvelous\" muggle things.</p>\n<p>If there's one thought Harry never expected to have in his life, it's \"Draco Malfoy might get on with Arthur Weasley,\" and he is having it now. It is happening.</p>\n<p>Except then Malfoy adds, \"Don't like cars, though. They frighten me. I'd much rather apparate. Or fly. Or just walk, I suppose, or take the tube, but that makes me rather nervous, too. I don't like to be underground.\" He frowns. \"Anyway, what was I saying? Oh, I was doing all that, and I was going into muggle London, and I would only wear muggle clothes...and they didn't do anything. My parents. They didn't say a word about it. I could tell my father was furious with me, especially about my boyfriend, I was seeing someone who was a bloke <i>and</i> a muggle, that's just not done, neither of those things, and he said nothing. Not a thing.\"</p>\n<p>\"Perhaps they're trying to be good to you now?\" Harry suggests. \"Trying to understand – you know, that it's okay if you're different from them.\"</p>\n<p>Malfoy laughs, sharp and humourless. \"I believe you've met my parents, Potter. Can you imagine the words 'it's okay if you're different from me' coming out of my father's mouth? I could <i>tell</i> they were furious. That my father was, anyway.\"</p>\n<p>\"What about your mum?\" says Harry.</p>\n<p>Malfoy seems not to hear him, or to feign not hearing him, anyway. \"And I just wanted them to be honest with me, you know what I mean?\"</p>\n<p>\"Yeah,\" says Harry, because he does, actually, this time. \"So – they weren't making you stop, so – you – left?\"</p>\n<p>\"Essentially, yes,\" says Malfoy, though Harry wonders, when Malfoy bites his lip, if there's even more to the story than this. He also wonders what it says about him that he understands Malfoy's logic, in a way. \"I don't need their help,\" Malfoy continues. \"I can do it on my own.\" Uncertainty flashes in his eyes for a moment, but it disappears quickly. \"I've had a job now since May! I'm living with people. Last couple months I could pay the rent!\"</p>\n<p>\"How did you find these people you're living with?\" says Harry.</p>\n<p>\"In pubs and clubs and things, when I was going out and still living at home,\" says Malfoy. \"I started going out the year I was supposed to be finishing school, you know, because seventh year was so fucked, and – didn't. There's a girl...\" A small smile blooms on his face. \"She says she picks up strays. There's too many of us in that flat, but we can't afford much else, and it works.\" The smile disappears. \"I've never been poor in my life,\" he says quietly, putting out his cigarette.</p>\n<p>\"Perhaps it's good for you,\" says Harry.</p>\n<p>Malfoy scowls. \"<i>You</i> don't know what's good for me,\" he says.</p>\n<p>\"'Spose not,\" says Harry.</p>\n<p>There is a brief lull in the conversation, and then Malfoy blurts, \"I've been thinking about you.\"</p>\n<p>\"What?\" says Harry, alarmed, pushing down the admission that he's thought of Malfoy, too.</p>\n<p>\"I've been thinking about how maybe I should have talked to you, because it'd been so long since I'd talked to anybody who knew about magic – or the war – or anything. And look. Now we've spoken. And you didn't have much to say about magic at all. I'm going to be very angry in the morning.\" He gazes toward his friends, pointy chin in hand, and Harry realises with a start that his friends appear to be chatting with Malfoy's.</p>\n<p>\"I could be your source,\" Harry says thoughtlessly.</p>\n<p>\"My what?\" says Malfoy. He's frowning at the merging friend groups.</p>\n<p>\"I could update you on magic things,\" says Harry. \"If you wanted. We could see each other once in awhile, and I could – tell you what's going on.\"</p>\n<p>\"You want so desperately to see me,\" Malfoy says, and Harry thinks he's <i>teasing</i> him.</p>\n<p>\"You're the one who just grabbed me and forced your life story on me,\" Harry points out.</p>\n<p>\"Hardly my <i>whole</i> life story,\" Malfoy drawls, rolling his eyes. \"And you wanted to hear it, stalker. We should go see what our friends are talking about. I am very worried.\"</p>\n<p>Harry doesn't see what Malfoy could be worried about, now he's said so much to Harry, but they slide off their stools. Malfoy wobbles. Without thinking, Harry grabs his shoulders to steady him. He's so very thin, but Harry reckons he can't really talk, when it comes to people being too skinny. For one mad moment, he wonders if Malfoy's eating enough, in that crowded flat.</p>\n<p>He is rewarded with that lopsided grin he's never seen before tonight, and then Malfoy turns and goes back to his friends, Harry trailing awkwardly behind him. He is still conscious of the feel of Malfoy's thin sweater on his sweaty palms.</p>\n<p>\"Draco's like a posh little alien, yeah?\" one of the girls is chattering, not without affection. One of Harry's friends appears to have asked her about him. She has a cheerful but easygoing sort of voice that reminds Harry of Luna, or any sort of person who seems to be more at one with the universe than everybody else. \"Like he'd never listened to pop music ever in his life before us, and he didn't know anything about any celebrities! But of course I know plenty of people like that, it's just, with Draco – he didn't even know the Prime Minister's name, you know?\" </p>\n<p>\"I thought they called you Drake,\" Harry says in a low voice.</p>\n<p>\"Well, you told Patrick my real name, didn't you?\" says Malfoy. \"And I really hate the name Drake. I just thought it sounded more muggle. Turns out all I had to do was tell them my family were all crazy people obsessed with astronomy. They <i>believed</i> me, and now all they do is call me Draco, because they think it's brilliant and I don't like it, and apparently for them 'friendship' is synonymous with 'torture.' Little do they know I'm getting one over on <i>them</i>.\" He looks exceedingly pleased with himself.</p>\n<p>\" – and he gets excited about, like – toasters and microwaves and staplers and bits and bobs like that,\" the girl continues. Harry thinks she might be pretty drunk as well. \"He keeps taking apart our remote controls – bless him, the nutter, I have no idea what kind of life he could've been leading in Wiltshire. He's fantastic, though, mad in a good way, and he's a really good mate. He really helped me out when I was having problems with my boyfriend, you know? He's a really good listener.\"</p>\n<p>\"Aren't I just?\" Malfoy says loudly.</p>\n<p>\"Oh, there you are, love,\" says the girl, beaming at him.</p>\n<p>\"And there <i>you</i> are, beautiful as ever,\" he says. \"Hello Weasley, Granger, Thomas, Loony. I trust you have been well. Have there been proper introductions? Well, Potter needs them anyway – Potter, this is Sadie going on about me because she is obsessed with me, she owns our flat, and that's Caitlin who works with me and thinks you're raving and is not wrong, and that's Teresa over there, who is a bitch – \" A blonde girl with glasses tuts loudly. \" – and Abigail, as well.\" A small, dark girl smiles and waves. \"I have nothing bad to say about her because she is actually the loveliest person you will ever meet. We are the best of mates. Best of mates, this is Harry Potter. He is a raving lunatic. In school he sometimes had fits in the middle of class and they reported it in the newspaper. Well, that was because I told the newspaper myself. But the point is he is a famous nutter.\"</p>\n<p>Ron splutters.</p>\n<p>\"Hello, famous nutter,\" says the girl called Teresa.</p>\n<p>\"I'm not,\" says Harry, but he can't bring himself to finish the sentence.</p>\n<p>\"Hello, Harry Potter,\" Abigail grants him, smiling wider.</p>\n<p>\"I think you might need to go home now, Draco,\" says Caitlin with a gentle pat to Draco's arm. Harry decides he likes her. She clearly has sense.</p>\n<p>\"And why is that?\" says Malfoy.</p>\n<p>\"Because you are oversharing and talking rubbish,\" says Teresa helpfully, and Harry decides he likes her, too.</p>\n<p>\"Oh, oversharing,\" says Malfoy, waving his hand. \"You don't know the half of it.\"</p>\n<p>\"I'm sorry,\" Abigail tells Harry, apparently on behalf of Malfoy.</p>\n<p>\"Well,\" says Harry. His friends are all looking at him curiously. \"Not your fault, really.\"</p>\n<p>\"Abigail is sorry for everything, she apologised to the couch the other day for walking into it,\" says Draco. He falls back onto Sadie's lap and throws his arms around her neck. </p>\n<p>\"Well,\" says Abigail, embarrassed. </p>\n<p>\"Come on, up you get, Draco,\" says Caitlin. Draco is now nuzzling Sadie's neck in earnest. \"Before you start talking about your magic wand.\" She gives Harry and his friends a look as though they are supposed to laugh. They all smile uneasily.</p>\n<p>\"Magic's not real, you absolute nut,\" says Malfoy, voice muffled, as his face is pressed against Sadie's shoulder.</p>\n<p>When they finally do leave, it is with Malfoy riding on Caitlin's back because she is the only one tall enough to manage this and singing a song Harry suspects is by the Weird Sisters, spectacularly off key.</p>\n<p>\"What <i>is </i>this fucking song?\" he hears Teresa ask. \"Are you going to be singing this fucking song all night again?\"</p>\n<p>\"I think he wrote it,\" says Sadie.</p>\n<p>\"Well, it's terrible,\" says Caitlin.</p>\n<p>\"I think it's catchy,\" says Abigail.</p>\n<p>\"Are you bringing me to the underground?\" Malfoy demands. \"I refuse, there will be <i>drunk fools</i> there this time of night – \" and they disappear around the corner.</p>\n<p>\"Merlin's balls,\" says Ron, eyebrows higher up than Harry thought they could go. They are standing outside the pub, staring after Malfoy and his muggle girlfriends.</p>\n<p>\"What just happened?\" asks Dean.</p>\n<p>\"I'm,\" says Harry, \"Not sure myself.\"</p>\n<p>\"His friends asked us if he used to be part of a gang,\" says Dean. \"They said he won't explain his 'tattoo' but he says it reminds him of a bad part of his life or something, and they wondered if he was part of a gang. We just said we didn't know.\"</p>\n<p>\"What was he talking to <i>you</i> about?\" Hermione demands.</p>\n<p>\"He looked very into the conversation,\" Luna observes.</p>\n<p>\"Well,\" says Harry. He doesn't know what is right to divulge. \"His life, I suppose.\"</p>\n<p>\"His life?\" Dean repeats. \"Like why he's hanging around with muggles, maybe?\"</p>\n<p>\"You're going to tell us what he said, aren't you?\" says Ron, and Harry already feels guilty, but Ron is staring at him imploringly, and the rest of them are turning to do so, too, and how can he not?</p>\n<p></p>\n<p>***</p>\n<p>First, he considers sending Malfoy an owl, but then he remembers the muggles, and even if Pig can find Malfoy, wherever he's living, it's not a good idea to send a messenger owl to a flat filled with muggles. The only way Harry knows how to find Malfoy is the coffee shop.</p>\n<p>It's just – he offered to be Malfoy's source to the magical world, and he meant it. He thinks Malfoy would like to have someone to tell him what's going on, and to have someone to discuss magic with, as well. He remembers the way Malfoy's eyes lit up when he realised he could say \"Merlin\" in front of Harry, and it makes him feel – like he wants to – well, saying he wants to make that happen for Malfoy again sounds awfully gay, and even if Harry has feelings like <i>that</i>, he certainly doesn't have feelings like <i>that</i> about <i>Malfoy</i>, but he can't imagine living cut off from his world again, and he especially can't imagine what it might be like for Malfoy, who grew up steeped in magic and completely ignorant of muggles. And Harry's still curious. And thinking of how mad Malfoy was that night, and if this is what he's always like when he knows you.</p>\n<p>The moment Malfoy sees Harry walk through the door, the colour drains from his face. Caitlin appears to cringe with empathy and hurries up to the till, elbowing Malfoy out of the way and taking his place. This isn't exactly promising, but Harry holds his ground. \"Hello,\" he says, trying his best to smile in as charming a way as possible. \"Caitlin. Malfoy. How are you?\"</p>\n<p>Caitlin blinks. \"Harry Potter,\" she says politely. \"I'm doing well.\"</p>\n<p>\"I'm well,\" Malfoy mumbles, not meeting his eyes. \"As well.\"</p>\n<p>\"And you?\" says Caitlin.</p>\n<p>\"Pretty well,\" says Harry. Well is starting to sound as though it isn't a word, and Harry wonders, when he sees the humour in Caitlin's eyes, if she feels the same way. \"I was wondering if I could speak to you, Malfoy. I just wanted to, ah – to clarify something.\"</p>\n<p>Malfoy stares at him with pained eyes. \"I <i>suppose</i>,\" he sighs, resigned. \"I get off at five. Do you want anything while you're here, or are you going to get lost for now?\"</p>\n<p>When Harry returns a little after five, Malfoy is outside waiting for him, still in his uniform black trousers and shirt, and grinding a cigarette into the pavement with his shoe. For the first time, Harry knows what he's going to say to him – but Malfoy seems to be feeling the same way, because he straightens up instantly and says, \"Potter. I want to apologise.\"</p>\n<p>\"I want to apologise, as well,\" Harry says.</p>\n<p>Malfoy gives him that eyebrow quirk. \"Do you?\" he says.</p>\n<p>\"Yes,\" says Harry. \"I want to apologise for bothering you over the summer, and I want to apologise for – I shouldn't have let you – talk to me like that last weekend.\"</p>\n<p>\"You're apologising for not saving me from making a fool out of myself?\" Malfoy says with disdain. \"Oh, thank you, Potter.\"</p>\n<p>\"I just mean,\" Harry says hurriedly. \"I mean, you didn't make a fool out of yourself – \"</p>\n<p>\"Yes, I did,\" says Malfoy, fierce in a way that reminds Harry suddenly of Ginny. \"Don't you lie to me. I hate people lying to me. I wanted to apologise for that.\"</p>\n<p>\"Well, you don't have to,\" says Harry. \"That isn't what I meant. I've been a much bigger prat while drinking before. You saw me – that one time. A while back. The first anniversary of – the battle, you know.\"</p>\n<p>\"That's right,\" says Malfoy. \"I did.\"</p>\n<p>\"Well, yeah. I don't blame you or anything. You were drunk, everybody's – been like that before. I just wanted to tell you that I meant what I said. About being your – source? To the magical world? I could – update you on things. I could really do that, if you wanted.\"</p>\n<p>Malfoy stares.</p>\n<p>Harry shifts from foot to foot.</p>\n<p>\"You're trying to make friends with me,\" says Malfoy, sounding just as resigned as he did when Harry turned up at the shop today asking to speak with him.</p>\n<p>Harry realises this is exactly what he's doing.</p>\n<p>He shrugs.</p>\n<p>\"Why?\" says Malfoy, frowning, eyes searching Harry's face.</p>\n<p>Harry shrugs again. \"Why not?\" he says, and it's probably a stupid answer, which Malfoy only confirms with his responding eye roll, but Harry doesn't have anything else to say about why, and he suspects Malfoy doesn't either.</p>\n<p>\"I don't remember you being very interested in our past,\" says Malfoy, picking imaginary lint off his black shirt, presumably to appear unruffled. For one of the first moments in his life, Harry sees through him.</p>\n<p>\"Well,\" says Harry. \"We're older now. Things – aren't the same.\" He holds out his hand.</p>\n<p>Malfoy stares at it like as though Harry as held out some kind of disgusting item for him to take, but when he looks up and meets Harry's eyes, Harry can see something significant there. He remembers the way he refused Malfoy's handshake on the Hogwarts Express and wonders if Malfoy is thinking of that, too, and if he will do it to him now, just to get him back.</p>\n<p>\"I already know a lot about you,\" Harry points out. \"I'm, er – interested in figuring out just how mad you actually are.\"</p>\n<p>Malfoy scowls. \"You better be planning to tell me your life story, as well,\" he says.</p>\n<p>\"I can – \" Harry hesitates. \"I can tell you things,\" he says vaguely.</p>\n<p>Malfoy sighs and takes Harry's hand in a strong grip that for some reason surprises Harry, what with how frail he's always looking. He shakes it firmly. When he lets go, he sighs and looks away, somewhere down the road. \"What I have done?\" he murmurs. \"I am going to regret it, aren't I?\"</p>\n<p>\"We'll see,\" says Harry, smiling tentatively.</p>\n<p>\"I suppose we will,\" says Malfoy, looking up at the sky in a now familiar gesture, as though hoping for an explanation from a god. \"I don't know why...I think we'll find you're the mad one.\"</p>\n<p>\"Maybe we're both mad,\" Harry suggests.</p>\n<p>\"Maybe you have to buy me a drink because I bought you one,\" Malfoy proposes, and somehow, Harry spends another night drinking with Draco Malfoy.</p>\n<p></p>\n<p>\n<b>November 2000</b>\n</p>\n<p>It takes a bit for Malfoy to loosen up around Harry, but as he slowly thaws from cool and defensive to the boy who has left home and made friends with a gang of muggle girls, Harry learns a lot of things about him, both from hanging around with him and from listening to stories from Caitlin and occasionally another one of his friends, if they join them for drinks. Harry learns Malfoy drinks too much coffee and smokes too many cigarettes, and he doesn't eat or sleep enough. He sings along to the radio all the time, even though he cannot sing very well, and even when he does not know the song, at which point he makes up the words. He embellishes every story he tells to the point where his friends hardly ever believe him, and he always gets away with accidentally mentioning magic because they think he's just on about his usual rubbish. He does brilliant impressions, which Harry realises when Malfoy turns to him one day to insult him and chooses to do it by performing the most accurate impersonation of Professor Snape Harry's ever seen – and there were a lot of nasty Snape impressions going on in the Gryffindor common room. He's the sort of person who talks during films, he spends far too much of his money on the cinema, and he still gets confused over muggle money sometimes if he's too excited over whatever he's buying, particularly all the differently shaped and coloured coins, though you'd think that would be the part he'd understand.</p>\n<p>Sometimes he has days when his chatty good humour suddenly vanishes, in which he is quiet and moody and snaps at anybody who tries to speak to him. Harry thinks he understands this. Anybody brave enough to try to talk to Malfoy on one of these days must be prepared for the possibility of truly nasty and usually uncalled for insults. Apparently, Patrick, the boy from the pub and, it turns out, the ex Malfoy was discussing, split up with Malfoy partly because he cannot handle this, which Harry doesn't think he likes. How can you split up with a person for getting angry sometimes?</p>\n<p>He remembers shouting at Ginny for lying to him, when they split up, and the look on her face, and he wonders if Malfoy shouted, when Patrick split up with him.</p>\n<p>Harry doesn't really know how he feels about Patrick. He's only met him a few times, and every time he has been incredibly polite. He still calls Malfoy \"Drake,\" because he thinks it's rude for everybody to call him \"Draco\" when he presumably doesn't like it. He's always pointing out when he thinks Malfoy's jokes are rude, and Harry hates the way the light goes out of Malfoy's eyes when he does that. The moment Malfoy proclaimed Harry acceptable to speak to, Patrick changed accordingly and stopped being angry with Harry for skulking around the coffee shop alarming everybody, speaking politely and smiling a lot and generally being so fucking pleasant that Harry is annoyed. Patrick is a \"no hard feelings\" kind of bloke, and Harry doesn't know how to be that kind of person. He gets a weird, probably sick satisfaction over the fact that there was a time when Patrick had to tell Malfoy he didn't love him; it was probably awful for Patrick to have to admit it. He probably felt terrible. And Patrick's done something as sad as break somebody's heart, which means he is not perfect, and sometimes there <i>must</i> be hard feelings.</p>\n<p>Harry knows he's a terrible person for feeling this way, just like he's a terrible, ungrateful person for feeling a lot of ways he's felt since the end of the war. Patrick's a nice bloke, and he has not done a thing to bother Harry that Harry didn't deserve. </p>\n<p>Malfoy's not a nice bloke. He has those nasty days. He has that dark mark on his arm, though he hides it as often as he can, an easier feat as the weather gets colder. He does not suffer fools; anybody not on his wavelength is usually subject to incredible disdain. He takes great pleasure in mocking Harry, and Harry takes great pleasure in mocking him right back.</p>\n<p>\"I don't know why people think you're special, Potter,\" Malfoy says this morning, after Harry trips over his untied shoelace on his way to the shop counter. \"You can't even walk. My grandfather would have an easier time walking through this shop, and he was confined to a wheelchair. He would have an easier time today, as a corpse.\"</p>\n<p>\"Draco,\" says Caitlin in the tone she uses when she thinks he is being insensitive.</p>\n<p>\"Don't 'Draco' me,\" says Malfoy. Harry never \"Draco\"s him. He's Malfoy, and Harry can't imagine how strange it might be to call him anything else. He can't imagine how strange it might be if Malfoy called him \"Harry,\" either.</p>\n<p>\"I guess we're choosing to ignore last night, when you tripped and fell on those girls on the tube?\" says Harry, leaning forward with elbows on the counter.</p>\n<p>\"I was drunk. You are sober. That is hardly an argument. Also, they were thrilled.\"</p>\n<p>\"Oh, yeah, they looked it,\" says Caitlin dubiously.</p>\n<p>\"They did,\" Malfoy insists, busying himself with Harry's coffee order without even asking, because at this point it's a thing he can do. \"One of them tried to slip me her number.\"</p>\n<p>\"That would have gone brilliantly,\" says Caitlin, \"When she tried to phone you and you <i>shouted</i> through the fucking thing. And that's if you could work out how to answer it before it stopped ringing.\"</p>\n<p>\"It would have gone brilliantly when she found out I'm a great big queer, as well,\" Malfoy points out. \"By the way, Potter, your hair is especially offensive this morning, did you stick your finger in an electrical outlet?\"</p>\n<p>He looks incredibly pleased with himself for that one, probably because he got to say \"electrical outlet\" in a way that made sense. Malfoy's favourite insults are the ones that involve muggle things, though he doesn't always get them right.</p>\n<p>(Harry is still failing to understand what Malfoy meant the other day when he said, \"You look like you had a run in with a toaster.\"</p>\n<p>\"What does that<i> mean</i>, Draco?\" said his friend Teresa. \"Do you mean it looks like he <i>made toast</i> this morning?\"</p>\n<p>\"It is not my fault,\" Malfoy said, \"You plebes do not understand all of the elevated material coming out of my mouth.\")</p>\n<p>\"I don't know, Malfoy,\" says Harry. \"Did you have a run in with a toaster?\"</p>\n<p>Caitlin snorts, and Malfoy turns around to give him a long-suffering look before turning back to the machine in front of him. </p>\n<p>\"And at least I don't spend about three centuries in front of the mirror every morning dealing with my hair,\" Harry adds when Malfoy's no longer looking at him. </p>\n<p>\"You don't know how long I spend with my hair,\" says Malfoy. \"Don't listen to my so-called friends. I emerge from my bed looking as marvelous as this every morning, with no effort at all. I emerged from the womb like this, in fact.\"</p>\n<p>\"You forget that I knew you at age eleven,\" says Harry.</p>\n<p>\"I try to,\" says Malfoy, handing him his coffee in exchange for the correct amount of muggle money.</p>\n<p>As has become the routine, Harry settles himself at a table in the corner, reading one of the muggle books Hermione has given him and hiding it desperately from Malfoy, because he tends to take one look at the covers of these books and spoil the entire thing instantly in a mad rush to prove he knows things about muggle books, as well. He casually asks things like, \"The fat asthmatic dies at the end, right, and the little pushover boy, after they all go mad over the pigs?\" or, \"He falls down the stairs and dies, right? And it's a shame because they were completely gay for one another.\" Well, he started this up after looking genuinely shocked to see Harry reading and said, \"Potter, do you <i> know how to read</i>? I always thought Granger read the textbooks to you and perhaps just never had time to get to the Potions one until sixth year.\"</p>\n<p>When he mentioned sixth year, they exchanged a strange searching look until Malfoy cleared his throat and bustled over to clean tables, singing along to the pop song on the radio as though nothing happened.</p>\n<p>He reads in the busy moments, and chats to Malfoy and Caitlin and whoever else is working in the dead moments. He has slowly increased the amount of coffee he consumes, and therefore the amount of caffeine he needs to become a functioning human being has risen alarmingly, too. \"Welcome to our lives,\" Malfoy's friend Abigail told him solemnly when he brought this up on one of their nights out.</p>\n<p>\"We're fighting to render sleep useless once and for all,\" said Teresa, and Harry finds this a worthy goal; things may be better than they were in the year after the war, but he still has nightmares he'd rather not.</p>\n<p>Harry likes these muggles and the way they mock Malfoy and conquer sleep and have no idea he's ever done anything worthy of fame, or that he's supposed to be an incredibly noble person. He can say mean things without feeling afraid that it's not expected of him – in fact, they seem to find him quite funny, especially Malfoy, though he pretends otherwise, and Harry keeps this knowledge stowed in a special, warm place inside of him, pretending not to know even a little bit why it matters that Malfoy thinks he's funny.</p>\n<p>Harry has not, however, told Ron and Hermione about his new friends. They remain under the impression that the bizarre incident in the pub was the last anybody saw of Malfoy.</p>\n<p>Harry can be friends with whoever he wants, he knows that. He's twenty years old and thinks he can be a pretty good judge of character. He knows Malfoy's got that mark on his arm, but he's also different now. He also goes to the cinema every week with a group of muggles, and works hard for many hours with grumpy, caffeine requiring people to pay his share of their rent, and makes Harry laugh more than he's laughed in a long while.</p>\n<p>Whenever he imagines explaining this to Ron and Hermione when they're not around, he finds it perfectly reasonable. When they are there, he remembers, \"You'll be next mudbloods,\" and \"We couldn't find rhymes for fat and ugly – we wanted to sing about his mother, you see,\" and \"Granger, they're after muggles, do you want to be showing off your knickers in midair? Because if you do, hang around, they're moving this way and it would give us all a laugh,\" and distressed, Harry pretends to have been reading around the flat all day, or \"takes walks\" at night or \"turns in early\" and apparates to pubs. He drinks with Malfoy and tries to connect that nasty boy from school with this boy who listens with rapt attention to his muggle friends' family and boy troubles after long days earning meager wages. </p>\n<p>When it's time for Malfoy's lunch break, he and Harry usually disappear somewhere nearby where Harry insists upon buying Malfoy food. They eat quickly while Malfoy reads the day's Daily Prophet under cover of a muggle newspaper, and Harry keeps reading his book, or answers any questions Malfoy has.</p>\n<p>\"Did you read this yet?\" Malfoy asks today. </p>\n<p>\"Nope,\" says Harry, mouth full of chip.</p>\n<p>Malfoy quirks a disdainful eyebrow. He is the opposite of a messy eater, always thoroughly wiping his mouth and chewing carefully before opening it. He has even placed a paper napkin on his lap to eat fish and chips on a park bench.</p>\n<p>\"Well,\" says Malfoy, wiping the grease and vinegar off his fingers with another napkin and a look of vague disgust on his face, \"You're in it.\"</p>\n<p>Harry is actually surprised. It's been awhile since he has been, and he hasn't done anything at all lately – that involves the wizarding world, anyway. \"What does it say?\" He slides closer to peer down at the paper and is greeted with that vanilla, coffee, and cigarette smoke smell that Malfoy always seems to have. </p>\n<p><b><i>Where In The World Is Harry Potter?</i></b> blares a large headline only a few pages in. Harry's eyes travel quickly over the text, sentences popping out at him: <i>Not seen in public since ceremonies for Anniversary of Battle of Hogwarts....no information on whether Mr. Potter intends to complete auror training...Head of Magical Law Enforcement declines comment...rumoured to be living in a muggle neighborhood...rumoured to be suffering from mental complications related to time in the war...</i></p>\n<p>\"Oh, for fuck's sake,\" says Harry. He thinks of his insomnia and his nightmares and his purposelessness. \"I haven't got any – mental complications.\"</p>\n<p>\"Mm,\" says Malfoy with another eyebrow flick, taking another bite of fried fish and otherwise declining to comment.</p>\n<p>\"Shut up,\" Harry says anyway. \"Why is this news? Who cares what I'm doing?\"</p>\n<p>Malfoy chews and swallows carefully. \"Hear, hear,\" he says when his mouth his clear, dabbing at it with his napkin. \"I certainly don't know why anybody cares. You're very boring, Potter.\"</p>\n<p>\"I <i>am</i> very boring!\" Harry insists. \"I don't see why everybody needs to know what I'm going to choose as a career. Or whether I choose a career at all, really!\"</p>\n<p>\"You don't like just sitting around,\" says Malfoy. He picks up the wax cup next to him and takes a large sip of Coke. Harry is fairly sure Malfoy is consuming caffeine whenever he sees him, unless it's alcohol or a cigarette. \"You'll work out something to do.\"</p>\n<p>Harry pauses, surprised. \"You think so?\"</p>\n<p>\"Yes,\" says Malfoy. \"I've been hanging around with you enough to notice that. Don't think you're too bothered about being an auror, though, or you'd have done something about it by now. What do you want to do instead? Unspeakable? Healer? They'd let you do anything, even without your NEWTs.\" Harry doesn't miss the trace of bitterness in Malfoy's voice. He still doesn't know why Malfoy never got his NEWTs. \"Something with books?\" Malfoy continues. \"You read a lot.\" He shrugs. \"Not that I care what you do,\" he adds, becoming very interested in crumpling up his rubbish to throw away.</p>\n<p>\"I don't know,\" Harry says honestly. He thinks about what Malfoy said about the books, and then of all the cooking he's been doing at the flat lately, to great praise from Ron and Hermione, who seem pleased he's got some sort of hobby. \"I do like books, I guess. But I don't love them like Hermione does.\" </p>\n<p>\"I'm fairly certain nobody loves books like Granger does,\" says Malfoy. \"I think Granger gets off on books.\"</p>\n<p>\"I'm really,\" says Harry, \"Not too interested in what Hermione gets off on, thanks.\"</p>\n<p>\"You don't discuss that with your friends?\" says Malfoy, fishing for his lighter in his pocket.</p>\n<p>\"Discuss what?\"</p>\n<p>\"What you get off on?\"</p>\n<p>Harry nearly spits Coke all over the place. \"What – no, we do not. My best mates are shagging, Malfoy, I don't really want to hear about it.\"</p>\n<p>\"Oh, no,\" says Malfoy. \"You're not a prude, are you, Potter?\" He places a cigarette between his lips and lights it.</p>\n<p>\"I'm not!\" says Harry.</p>\n<p>Malfoy makes a small humming noise as though he does not believe it for a second. \"Some of my mates are shagging and I don't mind hearing about it,\" he says after releasing the smoke from his lungs. Harry has taken a strange liking to watching Malfoy smoke, something he's not sure he can explain in any sane way.</p>\n<p>\"Who?\" Harry asks, curious. All of Malfoy's friends appear to be girls; are some of them gay, as well?</p>\n<p>\"Patrick and Sadie,\" says Malfoy. \"You didn't know that?\"</p>\n<p>Harry blinks. \"What?\" he says.</p>\n<p>\"Are you deaf as well as stupid, Potter?\"</p>\n<p>\"I just – weren't <i>you</i> shagging Patrick?\"</p>\n<p>\"Yes.\" Malfoy shrugs his bony shoulders. \"It's alright, Potter, Sadie asked me permission, and she needn't have, anyway. I don't mind. I'm over him, you know.\" He says this last bit probably a bit more fiercely than necessary.</p>\n<p>\"Yes, well, okay, but,\" Harry says, \"Isn't Patrick <i>gay</i> then?\"</p>\n<p>Malfoy sighs. \"Do you need someone to hold your hand through literally everything?\" he says. Slowly, he continues, \"Patrick is <i>bisexual</i>, Potter. He likes <i>both</i>. Or well, I suppose <i>both</i> leaves out a whole lot of gender possibilities, doesn't it? Patrick says he likes to think of bisexual as he likes the <i>same</i> gender and also <i>other</i> genders, because then it doesn't leave anybody out.\"</p>\n<p>Harry stares. </p>\n<p><i>Bisexual, Potter</i>, Malfoy's voice echoes in his head. <i>He likes both</i>.</p>\n<p>\"Potter?\" says Malfoy after a beat. Something in Harry's expression seems to be enough to make even Malfoy sound a little alarmed. \"What's wrong with you? Do you have a problem with that?\" </p>\n<p>Harry makes a noise that is supposed to be \"no,\" but doesn't really sound like that at all.</p>\n<p>Malfoy looks at him, smoking his cigarette calmly, and after a while he tries, \"Did you…not realise it was possible to like more than one gender?\" </p>\n<p>Harry shakes his head.</p>\n<p>\"Potter,\" Malfoy sighs. \"You truly are an idiot.\"</p>\n<p>\"I have to go,\" says Harry, standing up and scrambling for the paper in which his fish and chips were wrapped.</p>\n<p>\"What?\" says Malfoy, now even more alarmed.</p>\n<p>\"I have to, uh,\" says Harry, \"I just remembered – a thing – I – will see you tomorrow – or something.\" He tosses his rubbish in the bin near their bench and sets off.</p>\n<p>\"What?\" Malfoy calls after him. \"What? Potter, you madman! What am I supposed to do with this paper? I can't bring this back to my flat! The pictures are moving! How am I meant to explain that? There's an article about you! <i>Potter</i>! Are you afraid of bisexuals? It's perfectly normal, you know!\"</p>\n<p>Harry ignores him. He needs some time to himself. He's too focused on this feeling like the hard knot that's been in his stomach for a very long time, since he was maybe thirteen, fourteen years old, that lump that has hardened and twisted and burned hotter as life has gone on is – suddenly dissolving, dissipating, making him lightheaded.</p>\n<p>As he walks briskly down the road in the vague direction of his flat, he thinks about the way he notices boys. He's always known he notices them; he's just pretended it's not a big deal, that it's something any straight boy might do, because he notices girls, too. He loved Ginny; he's had a terrible time getting over her, and he's not sure he's all the way there yet. He fancied Cho Chang something fierce. He notices girls in public, the way their clothes fit them, their legs, their hair, their breasts, their feminine smells. But he <i>does</i> notice boys, as well – backs and arms and straighter hips, broad shoulders and wiry muscle and bigger hands. Harry<i> noticed</i> things sometimes, in the dorms, and felt wracked with guilt. Sometimes he looks at blokes and, just like it is with girls, he feels like – touching, except it feels more dangerous, forbidden. </p>\n<p>Not, he supposes, that things like \"dangerous\" or \"forbidden\" have ever stopped him before. </p>\n<p>It has literally never occurred to him that <i>perhaps he's just attracted to all kinds of bodies</i> – perhaps <i>any gender</i> is attractive to him – and he feels so embarrassed. Now it seems so obvious. It's just – it's not his fault nobody ever sat him down and told him about the plethora of sexual and gender identities that apparently exist in the world, apparently enough to render \"bisexual\" worthy of explanation beyond \"two genders\" for Patrick. It's not Harry's fault he was busy in school worrying about Voldemort while surrounded by straight people, that nobody was kind or smart enough to utter the word \"bisexual\" in his presence. He's not an idiot; he knew some people liked people of the same sex, and he reckoned it was silly to have a problem with that, but he was attracted to Ginny and Cho, so he didn't think it could apply to him <i>personally</i>, despite any confused feelings in the dormitories or the Quidditch changing rooms. </p>\n<p>All this time, he's wondered if he'll have to choose, but perhaps he doesn't. Perhaps he <i>isn't</i> straight, but he isn't gay, either. Perhaps he's. Bisexual, or whatever. Perhaps that's a thing.</p>\n<p>\"You're twenty,\" he mutters to himself in awe, in the middle of the crowded pavement. \"You're twenty and you only just realised...I <i>am</i> an idiot. I am an idiot.\"</p>\n<p>An old woman gives him a wary look and dodges him neatly.</p>\n<p>\"Sorry to hear that, mate,\" says a blond boy his age, dodging him on his other side.</p>\n<p>This boy his age is <i>attractive</i>, Harry thinks, turning to watch him go, and <i>Harry is allowed to think this while also remaining attracted to Ginny and other girls</i>.</p>\n<p>\"I'm an <i>idiot</i>,\" Harry says again, awed at his inability to figure this out for himself. </p>\n<p>When he gets back to the flat, he finds that nobody's home yet. He dashes to his bedroom, slams the door, throws himself onto his back on the bed, and stares at the ceiling. \"I think I am attracted to blokes,\" he tells nobody, heart beating wildly all the same, because he <i>said it out loud</i>. He's never, ever said it out loud. He's never even wanted to think about it, even though he's known it was there. He thinks about noticing boys in public, and possibly fancying Lupin a bit in third year, though it hurts to think of him, and Bill Weasley in fourth, and the way he felt when it turned out Malfoy is gay, and when Ginny told him Ernie was seeing a bloke. </p>\n<p>He remembers those times where he's sort of accidentally thought about a bloke while getting off, and then felt really weird and guilty about it.</p>\n<p>He doesn't have to feel weird and guilty. Other people think about girls <i>and </i>boys, as well. It's a <i>thing</i>.</p>\n<p>\"Merlin's pants,\" he announces to the empty room, promptly sticking his hand down his own pants.</p>\n<p>He wanks to that boy he saw in the street, who is thin and blond and sort of too familiar in his fantasy for somebody who he saw just once in the street, but it's no big deal, it's fine. He wanks to thoughts of kissing a man and maybe also touching another man's dick like this and comes really hard and<i> doesn't feel guilty</i>.</p>\n<p>\"Wow,\" he says to the ceiling.</p>\n<p>Ron and Hermione turn up a couple hours later. Harry is very jumpy. His heart doesn't seem able to slow down. He's been in a weird state of excited panic all afternoon, unlike anything he's felt since the war. He's been imagining what will happen if he kisses a boy, if he'll ever get an opportunity to kiss a boy, what he'd have to do to go about it – what will happen if he gets real <i>feelings</i> about a boy, what will happen if the boy has feelings <i>back</i>, what they could do together and what everyone will say. He's been wondering if dating blokes is the same, or if it's different. He's been wondering how seriously people will take him, if he tells anybody he's not only interested in girls, or only interested in boys. </p>\n<p>\"Where's the paper?\" Hermione asks as she and Ron bustle about getting settled and wondering about dinner, which Harry has been cooking lately and today has not. \"I didn't get a chance to read it this morning.\"</p>\n<p>\"No idea,\" Harry lies.</p>\n<p>Hermione frowns. Harry realises he is tapping his fingers restlessly on the kitchen table. \"Are you okay, Harry?\" she says.</p>\n<p>\"Yeah, I'm fine,\" he says. \"What's for dinner, then?\" </p>\n<p>Hermione decides, apparently, to let it go, and they end up ordering a pizza and sitting around chatting, as they do, updating each other on their days. Hermione complains about Blaise Zabini being obnoxious in class, and talks about how fascinating one of her professors is, and Ron talks of having to spend part of the day with one ear because George thought it would be hilarious if every person working in the shop had only one ear.</p>\n<p>\"Anything interesting happen to you today, Harry?\" Hermione asks politely, like she does every day even though Harry never does anything (that he tells them about, anyway).</p>\n<p>Harry, who has spent the entire meal having difficulty swallowing because he feels as though his heart is in his throat and quite in the way, drops his half eaten pizza slice. He stares at them with wide eyes.</p>\n<p>\"Er,\" says Ron. \"All right, Harry?\"</p>\n<p>\"Did you know it was possible to like girls <i>and</i> blokes?\" Harry blurts.</p>\n<p>He is such an idiot. </p>\n<p>It is impossible for him to keep words in his head instead of spilling out of his mouth.</p>\n<p>\"Er,\" says Ron.</p>\n<p>\"Well...\" says Hermione, in the same tone she used to adopt when Harry or Ron were shocked to learn something they ought to have found in their textbooks or lessons ages ago, \"Yes.\"</p>\n<p>\"Well then,\" says Harry stupidly, \"Why didn't you <i>tell</i> me that?\"</p>\n<p>Ron and Hermione stare at him.</p>\n<p>\"Harry,\" Hermione says, voice gentle now. \"Is this the moment?\"</p>\n<p>\"What do you mean, is this the <i>moment</i>?\" says Harry.</p>\n<p>\"Well,\" says Hermione. \"Have you been having a crisis?\"</p>\n<p>\"I don't know, what do you mean by crisis?\" he says wildly.</p>\n<p>\"Well,\" Hermione repeats with maddening patience, \"Are <i>you</i> attracted to girls <i>and</i> blokes?\"</p>\n<p>Harry looks determinedly at his pizza. \"Er,\" he says. He has a million explanations tripping over his tongue, a million ways to try to make them understand exactly what he means, but he doesn't know that any of them are the right thing to say. He's so terrible with words. He just says, \"Yes.\" He does not look at them. He is sure he is about to vomit his heart out onto his plate, and then he will never be able to finish this pizza.</p>\n<p>\"Okay,\" says Ron.</p>\n<p>\"Is there a boy in particular that made you realise this?\" Hermione asks.</p>\n<p>Harry looks up.</p>\n<p>Ron is stuffing half of his fourth pizza slice into his mouth at once, and Hermione is looking politely interested as she takes another for herself.</p>\n<p>\"Er,\" says Harry. \"No, there's nobody in particular.\" <i>There's not</i>, he thinks intently, banishing the thought of fantasies involving anybody blond. \"I just sort of...realised.\"</p>\n<p>\"Oh, alright,\" says Hermione, biting into her new slice.</p>\n<p>\"Hm,\" says Ron, thoughtful. \"So, is there, like, one you prefer, do you think? Or is it just both equally?\"</p>\n<p>Harry stares at them, feeling quite disoriented, actually. Aren't they supposed to be shocked? Isn't this shocking? Because Harry's pretty shocked. Isn't Ron supposed to feel weird and call him a ponce or something, the way he and Dean and Seamus used to call Malfoy a ponce? Isn't Hermione supposed to be suggesting a million books about figuring out you're gay and coming out? In fact, he half expected some scoffing at the idea that a person could be attracted to more than just one gender – he might have scoffed at it himself, if he wasn't so sure he's – felt it. If he hadn't felt that wave of intense relief when Malfoy pointed it out.</p>\n<p>\"Er,\" says Harry, rubbing the back of his neck. \"I, uh. I don't know, I don't think I prefer either any more than the other? I haven't really thought about it that way. I just realised – I'd be interested in, um – a man probably just like I've been interested in – women. Or I guess just anybody. Apparently there are – more.\" <i>According to Malfoy</i>, he almost says, but he saves himself.</p>\n<p>\"Hm,\" Ron says again, shrugging as though to say \"sounds legitimate\" and getting back to work devouring his pizza.</p>\n<p>There is a long moment of silence, in which Ron and Hermione keep eating and Harry keeps staring at them, and finally he says, \"That's it?\"</p>\n<p>\"What do you mean, that's it?\" says Ron. \"What do you want, a parade?\"</p>\n<p>\"Ron,\" says Hermione, frowning. </p>\n<p>\"I just thought...\" Harry doesn't really know what to say.</p>\n<p>\"Thought what, we'd have a problem?\" Ron says fiercely. </p>\n<p>\"Well,\" says Harry. \"I guess not, I – \"</p>\n<p>\"You <i>guess</i> not?\" says Ron. \"If you think I'm going to camp all over the fucking country and save your arse when you're stuck in a frozen pond and stab a fucking demon locket and all that rubbish I've done for you, and then have a problem if you want to shag a bloke some time, you're an idiot.\" He stands abruptly, with a slight clatter of his plate, and moves to bring it to the sink.</p>\n<p>Hermione hides her smile behind her glass.</p>\n<p>\"Okay,\" says Harry, his heart suddenly back in the right place and feeling far too big for his chest. \"I didn't mean, to, er – offend you or anything.\"</p>\n<p>\"Alright,\" Ron says. He sits back down. \"We don't have a fucking problem with you, you prat.\"</p>\n<p>\"Alright,\" says Harry. \"Good.\"</p>\n<p>\"Good,\" says Ron. \"Now, do you want to go to the cinema? Hermione and I were thinking about it.\" Ron is quite fascinated by the cinema himself, especially when the films showing involve car chases.</p>\n<p>\"Yeah,\" says Harry. \"Yeah, that sounds good.\"</p>\n<p>When Ron disappears to the toilet before leaving, Hermione runs to Harry to throw her arms tight around his waist. \"You okay?\" she asks.</p>\n<p>\"I'm okay,\" he says, hugging her firmly back. </p>\n<p>\"I'm very glad you told us,\" she murmurs.</p>\n<p>\"Yeah,\" says Harry. He finds, embarrassingly, that he doesn't actually want to let go, and they are still in the midst of a silent embrace when Ron reappears. He doesn't say anything, just waits for them to notice him, and as they leave the flat, Ron gives Harry a reassuring slap on the back. </p>\n<p>Harry didn't imagine that another overwhelming moment of friendship like this, one as loyalty affirming and wonderful as Ron and Hermione following him through that trap door, or to the Department of Mysteries, or camping with him all around the country, could happen after the war. But it has, it feels that way to him despite how simple it looks, and maybe that's the problem – that Harry never thought much about after the war, not concretely – not until it was upon him. </p>\n<p>He has Ron and Hermione, still, anyway; of this he can be certain. </p>\n<p>It isn't until halfway through the naturally car chase heavy film that Harry remembers the stupid, invasive newspaper article he read over Malfoy's vanilla and cigarette shoulder, and the way Malfoy said with such certainty that Harry obviously didn't want to be an auror. </p>\n<p>When he and Ron get home, Harry, spurred by the adrenaline of coming out to himself and his best friends in the same day, immediately writes a letter to the Auror Department, declining their offer to join their program, and sends it off with Pig.</p>\n<p>As he watches the tiny owl go, he wonders if he really ought to buy his own owl. </p>\n<p>It has been three years. He should be able to buy a new owl.</p>\n<p>\"All right, mate?\" Ron asks from behind him, apparently having just entered the sitting room.</p>\n<p>\"Yeah,\" Harry says, blinking. Pig has disappeared from sight. He turns to face Ron, who is hovering in the doorway, tapping his fingers on the doorframe and looking down at his feet, giving off the same, comforting attitude he always is – uncomfortable about feelings, but ready to discuss them if need be. \"It's been a weird day,\" Harry offers. \"Things are – different.\" </p>\n<p>\"In a bad way?\"\" says Ron, looking up and meeting Harry's eyes. \"Or a good way, do you think?\" </p>\n<p>Harry sighs and, for no reason he can work out right now, a laugh bubbles out of his chest, coming out odd and unlike his usual laugh. \"When I have a clue,\" he says. \"I'll let you know.\"</p>\n<p></p>\n<p>***</p>\n<p>Ron and Hermione still don't know about this new friendship, but they're supposed to be at Hermione's parents' house tonight for her mother's birthday, and staying the night with the rest of the family. Malfoy is upset about something, though he won't say what, and doesn't want to go back to his flat, but none of his friends are interested in going out. Harry reckons it's perfectly acceptable to invite him over for dinner and drinks, the kind of thing a person does for a friend who doesn't want to go home and has nowhere else to go, and that's all.</p>\n<p>He forgets, of course, about every embarrassing part of his flat until Malfoy walks into it, and his eyes fly immediately to the fridge. </p>\n<p>\"You've got <i>this</i> up on your fridge?\" says Malfoy, and Harry takes one look at the Sexiest Wizard Alive poster and Malfoy's delighted face and is overcome by the wild urge to whip out his wand and forcefully obliviate him. \"Look at you <i>scowling</i>, Potter,\" he says. \"How fetching.\" Malfoy turns to make a silly face and bat his eyelashes, and Harry's stomach leaps oddly; he refuses to examine that reaction further. \"I remember when this came out,\" Malfoy continues, looking back at the poster. </p>\n<p>\"Were you a frequent Witch Weekly reader?\" Harry asks dryly. It is <i>strange</i> seeing Draco Malfoy standing in his kitchen, among the familiar tiled floor and round table and little curtainless window and clipping covered fridge, wearing jeans and a leather jacket like a muggle. Harry has noticed that he has a lot of very nice clothes for somebody who is meant to be just barely paying rent and keeping up a smoking habit, but Malfoy has explained he bought most of these clothes before he left home, when he was rebelling at the manor.</p>\n<p>\"Yes, Harry Potter, and I had every clipping of your heroic arse on my bedroom walls,\" Malfoy says in a silly voice Harry thinks might be an attempt to sound like a simpering fangirl, and then, \"No, wanker. Pansy had a subscription. She wanted to make fun of you with me.\"</p>\n<p>Harry remembers the copy of Witch Weekly Pansy provided he, Ron, and Hermione in fourth year, to read about the supposed Harry, Hermione, and Viktor Krum love triangle, and the way Snape had read it aloud to the class, Slytherin laughter echoing through the dungeon, Malfoy's louder than anybody else's.</p>\n<p>Uncomfortable, Harry asks, \"What happened to Pansy?\"</p>\n<p>Malfoy stiffens, just slightly. \"She was in Paris, last I heard,\" he says in an offhand tone Harry has come to recognise as meaning the opposite of what Malfoy is trying to convey. He cares.</p>\n<p>\"Why don't you talk to her anymore?\" Harry pushes, reckoning Malfoy mustn't speak to her, if Harry's supposed to be his only source to the magical world.</p>\n<p>\"We had a fight,\" says Malfoy shortly. He turns back to the fridge and continues, \"What <i>is </i>this, Potter, a shrine to your press coverage?,\" and then, \"This is a drawing of <i>me</i>!\" Harry winces, waiting for an indication of his feelings about the depiction of him falling off a cliff, courtesy of fourth year, Harry totally forgot about; finally, Malfoy sighs, \"You cared enough about me in school to plot my demise,\" apparently touched.</p>\n<p>Harry does not know what he expected from a lunatic.</p>\n<p>It does not occur to Harry that cooking Malfoy dinner might be odd until he places a plate of pasta and a bottle of wine in front of Malfoy at the kitchen table, and Malfoy says, \"Well, this is very romantic, Potter.\"</p>\n<p>\"Shut it, or you can leave,\" says Harry, trying not to blush or do anything equally stupid. Of course, now he is trying to remind himself, whenever he feels uncomfortable about these sorts of things, that it is perfectly okay and acceptable to admit he is attracted to men, and he doesn't need to feel awkward over it. Except somehow, he still finds himself feeling awkward around Malfoy.</p>\n<p>Malfoy never asked Harry about his sudden dashing off after the reveal of Patrick's bisexuality. They simply haven't brought it up again, and Harry wonders if Malfoy has any suspicions about it, though it's not like him to fail to bring up possibly mock worthy suspicions about Harry. </p>\n<p>\"I thought we could use some alcohol,\" Harry continues.</p>\n<p>\"Cheers,\" Malfoy concedes, picking up the bottle to read the label. Harry wonders if Malfoy will have some kind of snotty comment about its quality, but he simply sets it back down, and Harry remembers his current living conditions and imagines his friends don't have the means to buy anything fancy and expensive to get drunk. Really, they shouldn't even go out as much as they do, but Sadie says, \"Sometimes you just need to get fucked up,\" and Harry thinks he might understand, even though he wants to pretend he doesn't.</p>\n<p>Harry opens the bottle with his wand, and Malfoy's eyes widen with delight the way they always do when he's reminded he can talk about magic in front of Harry. </p>\n<p>\"I haven't seen anybody do magic in such a long time,\" says Malfoy wistfully, propping himself up with an elbow on the table, chin in hand. \"It makes life so much easier than I even realised, doesn't it? The shit you have to do when you can't find a bottle opener and you don't have magic...\"</p>\n<p>As Harry sits down and begins to put pasta on his plate, he says curiously, \"How long has it been since you did magic? Since you left?\" </p>\n<p>Malfoy's face hardens. \"Yes,\" he says, suddenly starving, apparently, as he arranges a napkin on his lap and digs into his pasta with intense focus.</p>\n<p>\"Where is your wand?\" Harry asks, pouring them wine and trying not to remember Malfoy saying the word \"romantic.\"</p>\n<p>\"At home,\" says Malfoy, looking irritated by this interruption from shoveling pasta into his mouth with enthusiasm quite incongruous to his upright posture and the way he's neatly arranged his napkin. \"I knew I couldn't use it when I left, and I reckoned it'd be safe there.\" </p>\n<p>They eat the rest of the meal in relative silence, Harry mulling things over, and finally, when Malfoy seems to be through with eating his third helping as though he's never eaten before, as he always eats when Harry provides him with food, Harry says, \"You wanna do some magic?\"</p>\n<p>\"What?\" says Malfoy, frowning after he drains his second glass of wine.</p>\n<p>\"I'm thinking,\" says Harry, \"Your wand worked pretty well for me – when I had to use it.\" Malfoy's eyes darken. \"So,\" Harry continues hurriedly, \"Maybe mine will work for you.\" </p>\n<p>\"Why do I need to do magic?\" Malfoy demands.</p>\n<p>\"I just thought you might – like to,\" says Harry.</p>\n<p>Malfoy gives him a long, complicated look, and before long, Harry is sitting on the living room floor watching Malfoy go mad summoning and levitating and transfiguring things and laughing more than Harry's ever seen him laugh, with genuine and intense pleasure. </p>\n<p>\"I can still do it,\" says Malfoy as he beams at the couch he has transfigured into a wide, very comfortable looking bed for no apparent reason. </p>\n<p>\"That's quite good Transfiguration,\" says Harry, examining the very solid bed post, impressed. \"That's really hard stuff.\"</p>\n<p>\"I was always excellent at Transfiguration,\" says Malfoy without a trace of modesty. He turns to Harry with a sly smile Harry doesn't understand until he points Harry's wand right at him and says, \"Rictusempra!\" Harry is instantly hit with the sensation of being tickled in all his most ticklish spots, and he doubles over laughing, to Malfoy's obvious delight.</p>\n<p>\"I should have,\" Harry gasps, \"Known – better – <i>Malfoy</i>, take it off.\"</p>\n<p>\"Take it <i>off</i>?\" Malfoy repeats, laughing loudly. \"If you insist.\" </p>\n<p>He unzips his jacket with verve, and through uncontrollable laughter, Harry wheezes, \"You know what I <i>meant</i>, stop!,\" and he thinks he would be laughing with or without a tickling charm on him.</p>\n<p>Malfoy tosses his jacket off to the side with a flourish, revealing a white t-shirt that only exemplifies how skinny he is, but then he appears to take pity on Harry, who is now laughing so hard he isn't making any noise – or at least, Malfoy gets bored of the torture – and lifts the charm.</p>\n<p>Harry gasps and massages his aching stomach. He's lightheaded; he thinks he might have passed out, if the charm hadn't been lifted when it was. \"Bastard,\" he wheezes. </p>\n<p>\"I know,\" says Malfoy proudly, flopping down onto his transfigured bed. </p>\n<p>When Harry regains his breath, he says, \"You should do your NEWTs.\"</p>\n<p>He can't see Malfoy's face from where he's flopped onto the bed, but his voice has lost its humour when it responds quietly, \"I don't think so.\"</p>\n<p>\"You can go back and take them any time,\" Harry insists. \"You can do them by correspondence, can't you? Neville's doing that now. He didn't really like auror training much, and now he's thinking he might want to teach – \"</p>\n<p>\"I'm not doing them, Potter,\" says Malfoy sharply, and Harry falls silent. It does not seem like a topic to push. </p>\n<p>\"More alcohol?\" he suggests instead, repentant. </p>\n<p>\"Always,\" says Malfoy. </p>\n<p>Harry reckoned they'd get a little drunk, and Harry'd make sure Malfoy got home properly, and that'd be that. But Malfoy really likes to drink, and can be <i>very</i> persuasive, and somehow, they end up lying side by side on Malfoy's big transfigured bed, far drunker than Harry expected – drunk enough to be chatting freely. </p>\n<p>They have been laughing about something, something Harry's fairly sure wouldn't be nearly as funny if they were sober, and the moment their laughter dies out, Malfoy says abruptly, \"My mother owled me.\"</p>\n<p>Harry holds himself up on his elbow and says, \"Really?,\" squinting down at Malfoy's pointy, pensive face. They're really quite close together. </p>\n<p>\"Yes,\" says Malfoy, gazing steadily up at him, eyes bleary with intoxication. \"This is the first time she's tried. I wondered if she ever would. She says she wants me to come home. She<i> misses </i>me.\" He looks away from Harry and begins picking aimlessly at the soft sheets beneath him. </p>\n<p>\"Is that why you were upset tonight?\" says Harry.</p>\n<p>Malfoy sighs. \"Partly, yes.\" </p>\n<p>\"Why does that upset you?\" Harry asks, resisting the strange urge to reach out and touch Malfoy's hair, or face, or something, in an effort to comfort him. Something about their position seems to invite such a thing; Harry can't explain why. </p>\n<p>Malfoy huffs and seems to try particularly hard to avoid Harry's eyes, presumably examining the sheets with great interest. </p>\n<p>\"Do you miss your mother?\" says Harry. \"Your parents?\"</p>\n<p>He half expects a \"none of your business,\" but Malfoy looks back at Harry's face and says adamantly, \"Of course I miss them.\"</p>\n<p>\"Then why don't you want to go back, if they miss you, too?\" </p>\n<p>\"Well, who knows how my father feels,\" Malfoy admits. \"But I want – I don't need them. I can be successful without them. I told you.\"</p>\n<p>\"Doesn't mean you can't speak to them at all,\" says Harry. </p>\n<p>\"I couldn't stand being back there,\" Malfoy insists. \"Knowing they're furious or disgusted or whatever they are by – a lot of things, but they're not saying it – wondering how they must feel about me and what they're not saying. There's always been – so much we don't say. I know they love me, and I've always known that, and they probably miss me, but it doesn't mean they really know what's best for me, do you know what I mean?\"</p>\n<p>It registers to Harry that they have reached the \"do you know what I mean\" phase; Malfoy is most certainly a chatty, \"do you know what I mean\" kind of drunk, something proved by many evenings out after the first pub encounter. </p>\n<p>\"I'm not giving them an heir,\" Malfoy continues, once again not waiting for an answer. \"I refuse. I'm afraid they're going to suggest – it's a thing, you know, that gay purebloods have done, not that anybody will <i>admit</i> it's a real thing, in <i>polite company </i>– married to produce an heir and then had somebody on the side, like an arrangement. I don't want that. All those pureblood secrets. I don't want a child. I'd fuck a child up. And I'm sick of the Malfoy thing. The Malfoys are <i>fucked</i>, and the Blacks are <i>fucked</i>, do you know how long we've probably been fucking each other to keep <i>pure</i>?\"</p>\n<p>Harry snorts. He and his friends often joke about people like Malfoy this way, but Harry never expected to hear Malfoy say it himself.</p>\n<p>\"I'm sick of worrying about what it means to be a Malfoy, and what it means to be a pureblood, and honour and legacy and all of it,\" says Malfoy. \"I just want to – do what I want. I feel like I've always gotten everything I wanted, but I haven't – really. If I had a child, he or she or whatever – they'd have to deal with all that, too, and it's all rubbish. Look where it got us. It's rubbish. I know they probably won't <i>make</i> me do anything, not after the war, but they'll <i>strongly suggest </i>it, and I'll know I'm disappointing them all the time. And it's stupid, because they fucked me up so much, but I don't want to disappoint them – or to be reminded of disappointing them all the time, at least, because there's no way I won't disappoint them, at this point.\"</p>\n<p>Harry, because he is drunk and stupid, gives into his urge and strokes a strand of Malfoy's hair, which has fallen over his eye, back into place. Malfoy starts and stares at him. He doesn't look like he feels any better at all. Harry doesn't like not being able to help people. Distressed and feeling very stupid, he says, \"I don't understand about parents. But I do understand about disappointing people.\"</p>\n<p>Malfoy looks thoughtful now. After a long moment in which they look pensively at one another, Malfoy says, \"I suppose you would.\"</p>\n<p>\"Is that why you came to live with muggles?\" says Harry. He lies down again, so they're facing each other on the same level. \"The – not wanting to deal with the Malfoy thing? I've been wondering about that. I know you were – rebelling. But you could have moved out and found a flat in a wizarding quarter or something, right? You didn't <i>have</i> to give up magic altogether, did you? Like you said, they won't <i>make </i>you do anything, and – being pureblood doesn't necessarily mean – giving into all the pureblood shit. I mean, Ron's pureblood, isn't he?\" </p>\n<p>\"I guess it's partly the pureblood shit,\" says Malfoy. \"And also – Muggles have no – preconceived notions of me.\" He looks away again.</p>\n<p>\"Preconceived notions,\" Harry repeats, with particular care in his inebriated state. He gazes at Malfoy as Malfoy stares off in the direction of the flat's bedrooms, face flushed with intoxication, hair falling over one eye again, after the movement of his head. This time Harry tries even harder not to touch it. </p>\n<p>\"When I try to get jobs in magic places, they know who I am,\" says Malfoy quietly. \"I'm sure it'd be the same if I tried to find a flat, or anything like that. Even when I would walk down Diagon Alley...they know what I've done. I know I deserve the way they look at me. <i>I</i> know what I've done. But it does make it a bit hard. And I can't be around all that without feeling – guilty.\"</p>\n<p>\"You feel guilty,\" Harry repeats. \"So...you ran away.\"</p>\n<p>Malfoy doesn't say anything. </p>\n<p>\"So you ran away from your guilt,\" Harry slips out, too angry and too drunk to prevent it, \"Instead of doing anything about it.\" </p>\n<p>He wants to think he wouldn't dare assert this kind of thing out loud while sober, but he's not entirely sure. He's also not entirely sure why he feels so angry all of a sudden, when a moment ago the pain in Malfoy's voice made him want to comfort him. </p>\n<p>Malfoy whips around to glare at him. \"Excuse me?\" he says. \"Don't you dare tell me what I've done.\"</p>\n<p>\"Well, you could try to repair things in the wizarding world,\" Harry says. \"You could <i>do </i>something that shows you feel differently about blood and things now, you know.\"</p>\n<p>\"How do you know I feel differently?\" Malfoy demands, almost baring his teeth with the way he sneers, but Harry knows he doesn't mean that, that he's being contrary the way he is when he's upset. Harry's seen him smile at those muggle girls, seen him sweep them up into his arms and run with them down the street and kiss their foreheads and listen raptly to their problems. He's seen Malfoy gaze lovingly at the coffee machine and the laptops people bring into the coffee shop and the televisions in shop windows. </p>\n<p>\"You do, you prat,\" says Harry. \"Shut up. Your situation with our world – it's not a situation you absolutely can't repair. You made mistakes, yeah, but you could do something to repent, or to help people, or to right wrongs. But you don't bother, do you, you just hide with muggles feeling sorry for yourself!\" </p>\n<p>Harry tries not to think about how much time he spends sitting around feeling sorry for himself, about the way he refuses to be among wizards and witches other than his friends when he doesn't absolutely need to, due to what they expect him to be – because it's completely different. </p>\n<p>Malfoy sits up abruptly, then blinks, as though this did not do anything good for his head. After a few moments of careful blinking, he says, furious, \"Don't tell me what I do or do not do, Potter. Don't get on me because we're not all perfect do gooders like you are. I <i>told</i> you I know I deserve the way they feel about me. You've no idea what my thoughts on all this are, though you always seem to assume you do.\"</p>\n<p>\"So what are they?\" says Harry, staring up at him. \"What are your thoughts?\" </p>\n<p>\"I just want to know how successful I can be without any preconceived notions at all!\" says Malfoy, and Harry really marvels at the way he's rolling \"preconceived notions\" off the tongue whilst drunk. \"Is that alright with you, your highness Boy Who Lived? Or am I expected to grovel to the entire world for stupid mistakes I made as a child until every single one of them forgives me? Because they never will, not all of them, and I don't see <i>you</i> having to grovel for all the mistakes you made. I just want to know how good I am without people prioritising me for my blood or hating me because of my stupid dark mark, okay? I don't want people to hate me, but I don't want special privileges, either, not anymore. That pureblood shit is <i>bullshit</i>, alright, is that what you want to hear me say? Pansy and I fought because she said the Dark Lord was mad but he was right in trying to keep blood pure, and my father said the same thing, and when he said it, I left. I told him off and I left and I've no idea how he feels about me now. But I'd been wanting to leave, because I think – if I can succeed on my own, I'll know I'm – I don't know. Good enough. Worth something. I suppose. The muggles don't know a thing about me. I can see what I'm really worth with them.\" </p>\n<p>Harry frowns, anger quelled somewhat. Malfoy told off his father. He imagines all of Malfoy's talk about his father in school and thinks that must have been very hard. \"Everybody's worth something,\" Harry offers, startled that Malfoy doesn't know this, but thinking now maybe it makes sense that he doesn't. \"No matter what they do.\"</p>\n<p>From nowhere, Harry's mind pulls up a memory of hiding in a cabinet in Borgin and Burkes and hearing Malfoy's father say, \"I hope my son will amount to more than a thief or a plunderer, though if his school marks don't pick up, that may indeed be all he is fit for.\" Harry remembers Malfoy's angry, embarrassed flush, and he stares at Malfoy's stiff back and thin, scowling face, and the urge to smooth out all that tension revisits him. </p>\n<p>\"It doesn't matter how – successful you are,\" Harry insists. \"Not with – money or jobs or grades or things like that. I mean, it does, sort of, but that's not how you figure out what you're <i>worth</i>.\" </p>\n<p>\"What a Gryffindor thing to say,\" says Malfoy, spitting it out like an insult. \"Always thinking you're better than the rest of us, worth more than the rest of us, because you're too stupid to avoid running headlong into danger. That's not how it is for me. What's the point of life if you're not trying to succeed? What's the point of you, if you're not doing anything, or if you don't really deserve everything you're credited with? Why do you matter?\" </p>\n<p>This hits uncomfortably close to home, and deflecting, Harry says, \"Look who's talking about their house thinking they're better than the rest of us. Gryffindors don't think some people are <i>worth </i>more than others. What do you think we fought for?\" </p>\n<p>\"Don't you talk to me about Slytherin,\" Malfoy snaps, looking angrier than Harry imagined he would because of a little house related slight. They joke about their houses all the time. \"You know nothing about Slytherin. What would you have us do, when everyone hated us? When it seemed like even the adults had it in for us, sometimes? Somebody had to like us. Somebody had to have faith we could do something other than go mad and try to take over the world, or whatever you lot always expected of us. I always wonder if it ever occurred to them, at Hogwarts, that we were <i>children</i>, that they could cultivate us and encourage us in a certain way and then maybe we'd realise there were ways to be powerful and successful and cunning, ways to use our talents, without turning to the dark arts. I certainly would have liked that kind of influence a little earlier. We could have been great. We could have been great for <i>you</i>. But we weren't really told that very much, were we, and we weren't about to let you think you could get to us – that's not how you <i>win</i> anything, Potter. Shouldn't you know about winning things all the time?\"</p>\n<p>Harry stares, Malfoy's words circling in his head. He's never thought of Slytherin this way. He's never really reconsidered how quickly he dismissed it as a viable option, how easily everybody assumed every Slytherin was not nice, no Slytherin would want to be part of the DA, no Slytherin had loyalty to Hogwarts or Dumbledore. He wonders if it was always every single Slytherin, who laughed at him in the dungeons or in the Great Hall.</p>\n<p>\"I know I can't really blame everybody else for my choices,\" says Malfoy, flopping back down on his back and holding a hand to his forehead, as though steadying himself, or feeling for a fever. \"They're still my choices, and they were still stupid, and the pureblood thing is <i>still</i> bullshit. But don't talk about Slytherin when you don't have a clue about it.\"</p>\n<p>There is a long silence, and finally, Harry says simply, \"Okay.\"</p>\n<p>\"I am very drunk,\" Malfoy says after another long pause.</p>\n<p>\"Me, too,\" says Harry.</p>\n<p>\"Why is it I'm always rambling on about my life when we're drunk together?\" says Malfoy, turning to him with a pout. Harry looks at his lips and feels a very weird, low down twinge he doesn't think he wants to feel. \"Why don't you ramble on about yours so I can feel better? Surely you're not as perfect and noble as everybody imagines.\"</p>\n<p>\"No,\" says Harry. \"No, I don't think I'm what they think I am.\"</p>\n<p>\"Of course you're not,\" says Malfoy.</p>\n<p>\"I'm probably not much good at all.\"</p>\n<p>Malfoy rolls over to stare down at Harry with a shrewd glare. \"Well, that's getting a bit dramatic, isn't it? You <i>did</i> kill the Dark Lord, Potter, I saw you do it. That was fairly useful for everybody, I think.\"</p>\n<p>\"Who's talking to me about dramatic?\" says Harry, petulant. </p>\n<p>He gets an arched eyebrow in response, and then, \"Just because you're not as ridiculously noble as all that press says doesn't mean you're not any good at all. <i>Nobody</i>'s as perfect as they make you out to be in the papers. Come on. If you've been thinking you're not any good, when I – when I tortured people and helped Dumbledore – get killed, and – other things, I'm going to have to hex you again. But this time – \" He gestures frighteningly. \"Right in the bollocks.\"</p>\n<p>Harry closes his eyes against a sudden, embarrassing tide of emotion. <i>Nobody's as perfect as they make you out to be in the papers</i>. It's true, and he's known it, but nobody's ever <i>said</i> it to him. Well, probably because he's never actually voiced his concerns, but how is it Malfoy manages to so succinctly describe his worries and their possible answers, when he's been confused over them for years? </p>\n<p>\"Potter,\" says Malfoy, sounding alarmed. \"You're not – crying, are you?\"</p>\n<p>\"No,\" Harry says, wrenching open his eyes. \"Merlin.\"</p>\n<p>\"Good,\" says Malfoy. \"We're getting uncomfortably close enough as it is, without you crying all over me.\"</p>\n<p>Harry takes into account their positioning, the way he is staring into Malfoy's eyes now he's opened his, the way he's so close he could twitch his pointer finger just a bit and touch Malfoy's hair. Malfoy says they're too close, but he's not moving.</p>\n<p>\"I've seen you crying,\" Harry points out, embarrassed, and then he remembers Malfoy's blood all over the bathroom floor and his heart in his throat and Myrtle yelling, \"<i>Murder</i>!\" and the look on Snape's face when he saw, and he's not so glad he brought it up.</p>\n<p>Malfoy glares. \"Yeah, and then you sliced me up,\" he says. \"And you never apologised, you bastard. I've got scars all up and down my torso, you know. I didn't know <i>what</i> to tell Patrick, it looks like I've been been attacked by a shark or a bear or something, but no, it was just a sixteen year old idiot.\"</p>\n<p>Harry remembers with a thrill of horror that he never <i>did</i> apologise. He just...let it happen, let Snape and Madame Pomfrey take care of it and...worried over Quidditch and kissed Ginny. </p>\n<p>\"See?\" says Harry miserably. \"I <i>am</i> awful. I am so much worse than people think I am.\"</p>\n<p>Malfoy tuts. \"Rather than do your martyr bit,\" he says, \"You could always just apologise.\"</p>\n<p>\"My <i>martyr bit</i>?\" says Harry, quite offended.</p>\n<p>\"Yes,\" says Malfoy. \"Looking mopey and brooding and tragic all the time might make you <i>feel </i>like a heroic, self-sacrificing person, but really you're just being an arsehole. You can't tell me to do things about my life and then never do anything about yours.\"</p>\n<p>Harry bristles. \"I'm trying to tell you that I <i>am</i> sorry, you wanker!\" he says. \"I'm trying to say I'm sorry, and I know it was awful of me, and I didn't know what that spell did, and I think at the time I thought that was an excuse, and it made it okay, but I realise now it didn't. It was a bad thing to do. And I'm sorry.\"</p>\n<p>Malfoy blinks. \"Well, all right, then,\" he says. He shifts on the couch-bed, and his socked feet graze Harry's bare ones. He stares at Harry for a long time, and Harry stares back and wonders if their proximity is weird.</p>\n<p>\"Speaking of martyrs, though,\" Malfoy says finally. \"You know when you pretended to be dead?\" </p>\n<p>With a sharp intake of breath, Harry has to fight not to close his eyes again. </p>\n<p>\"You know, when my mother – \"</p>\n<p>\"I didn't pretend,\" says Harry.</p>\n<p>Malfoy frowns. \"What?\" </p>\n<p>\"I died,\" says Harry – no preface, no tact, because he's tired and drunk and he just doesn't know how. \"I really did die. Only Ron and Hermione and Ginny know that. And you now. I guess.\"</p>\n<p>He moves his fingers. They brush Malfoy's forehead. </p>\n<p>Malfoy narrows his eyes at Harry with his purest disdain, but he doesn't seem to have noticed Harry's touch. \"What's that supposed to mean? You think you're going to convince me I'm talking to a ghost? This isn't that film with the dead man, Potter, what's it, I am not that small boy. I am <i>certain</i> other people see you.\"</p>\n<p>\"No,\" says Harry. \"I'm not saying I'm a ghost. I died and came back. It was different than a ghost. I'm not dead anymore. It was some rubbish with – with the horcruxes Voldemort made, and what Dumbledore had planned – I saw Dumbledore, and – I had a choice. To come back or stay there. I came back. To end things. And your mother came to me after I'd come back, but she didn't tell anybody – that I'd come back.\"</p>\n<p>Malfoy stares and stares at him, and then he flops over and stares and stares at the ceiling, thought creasing his forehead. \"Okay,\" he says. \"Well. You really <i>are</i> stupidly, obnoxiously good and noble and just like the papers say, then.\" </p>\n<p>\"What?\" says Harry, confused. </p>\n<p>\"I would have stayed dead,\" Malfoy says bluntly.</p>\n<p>\"Oh,\" says Harry.</p>\n<p>\"At that point in my life, I certainly would have,\" Malfoy says defensively, as though Harry has disagreed with him instead of providing a meaningless, one syllable answer. \"If I were you, I wouldn't have seen the point in coming back, because there was nothing here for you, was there? So many people had died, and you must have been so <i>tired</i> of it all – you came back thinking of everybody else, obviously. You have this – capacity to think about everyone else. It's stupid. It's infuriating. If I were you, I would been so tired of it. I would have given up. It probably would have been nice to be dead.\"</p>\n<p>\"I <i>was</i> tired of it,\" says Harry. \"And it <i>was</i> nice to be dead.\" Malfoy sucks in a sharp breath. \"But there were my friends,\" Harry continues. \"My – sort of family. There was Ginny. I thought of them all. They were all – here for me. It wasn't just that I wanted to help them, it was – I wanted to be with them, selfishly. I wanted to be with them, to be with Ginny, and not have anybody else be with her. And I thought of not coming back, too. That's what I'm trying to tell you, really. Dumbledore looked – happy – safe. I mean – I'd done what I had to.\" There is a long silence, in which Malfoy remains staring hard at the ceiling. \"I didn't tell the others that,\" Harry admits, and this time he moves the fingers of his other hand, and they touch Malfoy's long, pale fingers, and he doesn't move them, and Malfoy doesn't move his.</p>\n<p>\"I guess I've never had friends like – <i>Ron and Hermione</i>,\" Malfoy offers, wrinkling his nose at the use of first names. Harry sees through the disdain to a genuine confession. \"That I'd want to – come back for. I've never – \" He looks back over at Harry, eyes so much closer than Harry expects, for some reason, grey and intense. \"I do love my mother.\"</p>\n<p>\"She would be miserable if anything happened to you,\" Harry insists, because he does not want Malfoy to really have no one he'd want to come back for. He thinks of Malfoy at school, of the way he spoke to Crabbe and Goyle, of how close they really could have been, and he notes the way Malfoy did not mention his father. \"I imagine she really does miss you a lot, you know. You're why she saved my life, after I came back.\"</p>\n<p>\"I really do miss her,\" Malfoy says quietly. His eyes widen in realisation. \"Wait a moment. I suppose <i>I'm</i> the reason you're alive, then!\" </p>\n<p>\"Well,\" says Harry. Trust Malfoy to take all the credit right away. He suddenly becomes very aware of their touching fingers. \"You were important, I suppose. Your wand, too.\"</p>\n<p>Malfoy sighs and stands unsteadily, and Harry's fingers curl back to himself. \"I think I need to drink even more,\" Malfoy announces. \"It is nobody's fault but my own that you are still here on this planet to bother me.\"</p>\n<p>\"It's not <i>only</i> your fault,\" says Harry. \"And I think I'm here to be your friend, actually. Wouldn't have thought that at all a few years ago, but here we are.\" </p>\n<p>He doesn't know why he lets some things come out of his mouth.</p>\n<p>Malfoy turns and gives him a strange, unreadable look, his hair rumpled and his t-shirt clinging to his bony frame. Finally, he sighs, long and low. \"You weren't supposed to <i>say it out loud</i>, Potter,\" he says, \"You sentimental undead freak. You know what you are, actually? You are a <i>– </i>what are they, the muggle inferi, you know, in the films – you're a <i>zombie</i>.\"</p>\n<p>Harry laughs. It feels so good to laugh, and to laugh about that, too. His other friends would never joke about his coming back from the dead – even Ron has never done it. It is all too serious, too desperately serious, and of course Draco Malfoy would laugh at him about it, and Harry doesn't know what it says about him, that he likes it. He likes the way Malfoy makes him laugh at everything, the way he always manages to be quite funny even when he argues with Harry, even though Harry pretends otherwise. He remembers Ginny used to make him laugh like this, too.</p>\n<p></p>\n<p>***</p>\n<p>\"What,\" he mumbles, lifting his head and realising he has been drooling, despite how dry his mouth feels now. He jerks his head in an attempt to right his glasses, fails, and attempts to move his numb arm to do something about them. </p>\n<p>When he moves, the weight on his back shifts a little and makes small, sleepy smacking noises.</p>\n<p>Harry jerks, fixes his glasses, and rolls onto his back. The weight is Malfoy, hair ruffled, breathing gently, hands curled slightly in the posture of sleep. He is, for all intents and purposes, snuggling up against Harry like a small child. When Harry moves, Malfoy lets loose a bit of discontent mumbling, sits up, and then drops back down, still asleep, his hand landing heavily on Harry's chest.</p>\n<p>\"What,\" Harry says again, and then he casts a hurried, wandless tempus charm. It's after <i>one in the afternoon</i>; Ron and Hermione were supposed to be back around noon. Harry's heart is somewhere in the region of his stomach and growing cold.</p>\n<p>\"Malfoy,\" he hisses, nudging his shoulder hard against Malfoy's body.</p>\n<p>Malfoy lets out a discontented little whine and burrows his face as close to Harry's chest as possible. Feeling funny all of a sudden, Harry swallows, the action bringing a dull ache to his dry throat. It occurs to him that he's not used to being this close with another boy. Hermione hugs and kisses him all the time, and naturally he's been very close to Ginny, but he and <i>Ron</i> have never been <i>physical </i>about their affection; the idea of snuggling with Ron, or Neville or Dean or anyone like that, is absurd. Harry remembers the way he touched Malfoy's hair last night, and his fingers, and the way he felt looking at those pouting lips, and feels a little thrill of fear not unlike the moment when he realised he never apologised for slicing Malfoy apart.</p>\n<p>\"Malfoy,\" Harry says helplessly, staring down at the messy blond head burrowed into his chest. He has no idea where Ron and Hermione could be, and he doesn't want them to see this, not now – unless they've already seen, he thinks with an overwhelming sense of panic. It doesn't help that one of his arms has been overcome by pins and needles. \"Malfoy, it's one o'clock in the afternoon,\" he says, pushing at him helplessly. \"Wake <i>up</i>, my friends are supposed to be back, and aren't you meant to be at work? <i>Malfoy</i>.\"</p>\n<p>Malfoy punches him swiftly in the shoulder, <i>hard</i>, and Harry yelps in surprise.</p>\n<p>\"What the fuck's wrong?\" Malfoy demands thickly, sitting up and rubbing his eyes, looking disoriented.</p>\n<p>\"We fell asleep,\" says Harry, rubbing his shoulder and embarrassed over the noise he just made.</p>\n<p>\"Yeah, I can <i>see </i>that, thank you,\" says Malfoy. His hair is more rumpled than Harry's ever seen it, and there is a pink impression on his cheek from pressing his face so hard against Harry all night. He presents Harry with a wounded look; Harry thinks of a disgruntled cat and is overcome by a strange rush of – something like tenderness.</p>\n<p>Horrified, Harry realises the feeling must show on his face, because Malfoy's expression morphs into confusion.</p>\n<p>They stare at each other, and Malfoy suddenly looks scared, too, and before Harry can do anything to fix it, Ron, Hermione, and Ginny, of all people, stride into the living room, and his dismay grows.</p>\n<p>Harry does not know why he should feel so guilty. He reminds himself that he can hang around with anybody he wants to hang around with, that Malfoy is different now, and he has proof from last night, and that all he's done is fall asleep after a night of drinking with his new friend. There's nothing wrong with that. The, er, snuggling was a total harmless accident. </p>\n<p>\"Oh, you're awake,\" says Ginny, and she does not sound pleased, and Harry just can't help but feel guilty, anyway. She has her hair pulled back in a ponytail, which is always very pretty on her, and she's wearing a blue coat Harry thinks might be new, which looks nice on her. He looks at her and has no idea how he feels. </p>\n<p>Malfoy stiffens next to him; he's still so close Harry can feel it. </p>\n<p>\"Yeah,\" Harry says stupidly.</p>\n<p>Ron and, unusually, Hermione, seem to be at a loss for words; they just stand behind her, looking at Harry like they're not quite sure who is in their living room. It occurs to Harry that not only have he and Malfoy been, apparently, snuggling all night, but they've transfigured the couch into a bed, and this implies they had a reason for doing so, which they did not – Malfoy was just messing about, but Harry has no idea how to go about explaining that in a convincing way, whether it's true or not. </p>\n<p>\"Hello, Weasleys and Granger,\" says Malfoy, accent sharpening, voice drawling heavily like Harry heard much more often in school. It makes him sound like he used to, like he thinks he's better than everyone in the room, and it occurs to Harry that he is witnessing the readying of a defense mechanism. \"How are you this morning?\"</p>\n<p>\"What are you doing here?\" Ginny demands.</p>\n<p>Malfoy slips out of the couch-bed and stands. Somehow, he manages to look very dignified and disdainful, with his rumpled hair and clothes and that pink mark on his cheek, and probably feeling as hungover as Harry feels. \"Potter invited me,\" he says. \"It is <i>his</i> flat, and not yours, I believe?\"</p>\n<p>Harry scrambles to his feet, too, certainly not looking nearly as dignified, especially because he stumbles over one of the empty wine bottles on the floor. \"We were just hanging out,\" says Harry, \"And we fell asleep.\"</p>\n<p>Ginny stares. \"You were <i>just</i> hanging out?\" she says. \"Like you <i>hang out</i> with Malfoy all the time?\" She speaks as though the idea is absurd, and Harry reckons to her, and probably to most people, it is.</p>\n<p>A strange look steals across Malfoy's face, like suddenly he's not sure of his footing. He looks back and forth between Harry and his friends for a moment, like he's waiting for someone to say something to the contrary, but of course, it never comes, and Harry's sense that he has done something wrong increases.</p>\n<p>\"Yes,\" Harry says quickly, because the look on Malfoy's face makes him feel more distressed than he imagined it would, \"I have been lately, actually, yes. He works at a coffee shop nearby, remember?\"</p>\n<p>Ginny stares. She puts her hands on her hip, and Harry is reminded vividly of her mother. \"Oh, okay, he works nearby,\" she says. \"<i>That</i> makes perfect sense. Might as well start getting matey with former Death Eaters if they work nearby! Might as well turn your couch to a bed and sleep with them on it!\" </p>\n<p>Malfoy does not help anything by laughing.</p>\n<p>\"Not...\" says Harry helplessly, though he knows Ginny didn't mean \"sleeping with\" like that. </p>\n<p>\"Not like...\" Malfoy mocks him, and Harry does not know why he is bothering with this person.</p>\n<p>\"The sleeping was an accident,\" Harry says. \"But he is my friend.\"</p>\n<p>Malfoy turns to him sharply, as though he did not expect this to come out of Harry's mouth. But Harry told him last night, didn't he? They're friends, and besides, Harry reckons if he's told Malfoy he died and laughed with him all night and, ah, snuggled with him, they can't really get around it.</p>\n<p>\"He's your <i>friend</i>,\" Ginny repeats.</p>\n<p>\"Yes,\" says Harry.</p>\n<p>\"Well,\" says Malfoy into the ensuing awkward silence. \"As much as I love it when people fight over me, and as exciting and dramatic as this one is sure to be, I am <i>monstrously</i> late for work and absolutely cannot afford to be fired, so I will see you later, Potter, if you don't have bats coming out your noise for the next several hours. I know what she's like.\"</p>\n<p>Malfoy picks his jacket up off the floor and slips it on, with Ron, Hermione, and Ginny staring at him. </p>\n<p>\"You know what I'm <i>like</i>?\" says Ginny. \"You're not going to be talking about me like I'm not in the room, thanks.\"</p>\n<p>\"Do you,\" Harry says helplessly, \"Do you – want some hangover potion?\"</p>\n<p>\"<i>Hangover potion</i>,\" Malfoy says, as though Harry has just announced that the second coming of Christ will be occurring in his flat any moment now, \"I'd forgotten. That would be positively a miracle, Potter.\"</p>\n<p>Ron, Hermione, and Ginny stay in the living room while Harry brings Malfoy to the kitchen, provides him with hangover potion, and swallows the last of it himself, sighing with relief at the familiar feeling of his stomach calming and his headache being chased away. </p>\n<p>\"I'd forgotten how marvelous this is,\" Malfoy says. He glances toward the living room. \"I,\" he says. \"I really shouldn't have told you all that last night. I mean, I'm quite sure I was obnoxious.\" His angular cheeks flush pink.</p>\n<p>\"That's all right,\" says Harry. \"Really, it wasn't. I mean, I – said some things.\"</p>\n<p>They look at one another for a long, awkward moment, in which neither seems to know what to do next, and it occurs to Harry that they woke up spooning – that their fingers touched, and they didn't move them for a long time.</p>\n<p>\"I'll see you, then,\" Malfoy says quickly, and he leaves the flat, leaving Harry dreadfully confused.</p>\n<p>Now Harry just has to face his friends.</p>\n<p>After the toilet.</p>\n<p>He, Ron, Hermione, and Ginny end up sitting together around the kitchen table, Harry eating toast while he waits for them to let him know what it is, exactly, that they want him to explain. He doesn't know where to begin. He doesn't know why it feels so complicated; they're friends, and they met again at the coffee shop. Malfoy's different now. That's what he'd been planning to say when this happened – Malfoy's different. </p>\n<p>Hermione shocks him completely by saying, pained, \"Harry...are you sleeping with Draco Malfoy?\"</p>\n<p>Ginny whips around to stare at her, ponytail just barely missing Harry's face.</p>\n<p>Harry chokes on his toast. \"<i>No</i>!\" he says, once he has gotten the bread out of his throat. </p>\n<p>\"Do you <i>want</i> to be, though?\" says Ron, and Harry is horrified to realise this is <i>exactly</i> where Ron and Hermione's minds leapt; Harry hoped he might have just been being paranoid, although he doesn't like the idea of <i>why</i> he'd feel so paranoid.</p>\n<p>\"No!\" Harry insists. \"We're friends. Look, I know that's probably – really strange for you, but I swear, he's not the same person he was.\" </p>\n<p>\"Hold on,\" says Ginny, looking back and forth between Harry, Ron, and Hermione. \"Harry. Are you gay?\" She stares at him with wide brown eyes, looking almost betrayed. He remembers there was a time when he told her things.</p>\n<p>\"I'm,\" says Harry, feeling a bit sick, \"Bisexual.\" He was not really ready to tell the whole world. He's not sure what he really wants to call himself, actually, or how he wants to go about telling people. He's also not sure when Ginny moved from \"close\" to \"the whole world,\" separate from Harry's safe bubble that knows everything straight away, and this makes him sad. </p>\n<p>\"<i>Really</i>?\" says Ginny.</p>\n<p>\"Really,\" says Harry.</p>\n<p>She shrugs. \"Okay,\" she says, just like Ron. \"Is there one you<i> prefer</i>, though?\"</p>\n<p>\"Honestly, both of you, is that really the polite response?\" Hermione says snippily, and Harry feels a rush of warmth for her and her defensiveness. Ginny turns to look at her, affronted. </p>\n<p>\"It's okay,\" Harry says, before they can argue. \"I – no. I'm just – bisexual.\"</p>\n<p>\"Okay,\" says Ginny. She frowns. \"So <i>are</i> you sleeping with Malfoy?\"</p>\n<p>\"<i>No</i>, I just said!\" says Harry. \"Malfoy did help me realise, okay, but not because – it was just because he was talking about it. His ex boyfriend is bisexual, and he was talking about it, and I realised – anyway, the point is not that I'm – whatever I am, the point is Malfoy's been working really hard to do his own thing, to separate himself from his family, and he's good friends with all these muggles and feels so differently now about muggles and all that. He's quite different, really, I promise, and I like him this way.\" They all stare at him, and he adds hurriedly, \"As a friend,\" pointedly ignoring the memory of that low down twinge at the sight of Malfoy's lips so close to his face.</p>\n<p>Harry picks at his toast and waits for a response.</p>\n<p>\"Harry, I'm sorry,\" says Hermione finally, all in a rush, \"But I don't know that I can ever be friends with Malfoy.\" Harry is surprised; she was sort of his defender, so long ago at the pub where Harry first saw Malfoy in muggle clothing, and he imagined she might be the easiest to convince in a room in which the other inhabitants are hot headed Weasleys.</p>\n<p>\"Well,\" Harry says, swallowing. \"I'm not asking you to be.\"</p>\n<p>Hermione looks so pained at this that Harry instantly feels awful. She means so much to him, and she defended him, and he hates that he has put that look on her face. </p>\n<p>\"Hermione,\" Ron says gently, \"Maybe – I mean. He <i>is</i> living a muggle life now. That's – quite a step.\"</p>\n<p>Harry gapes; this is not how he expected this conversation to go <i>at all</i>.</p>\n<p>Hermione looks at Ron for a long time, in such an intense way that Harry suddenly feels like he's intruding, and then she says, \"I understand that he's living with muggles now, I – \" When she falters, Ron takes her hand. \"I suppose you've never been called a mudblood,\" she says. \"But it's not exactly easy to forget, after – everything.\"</p>\n<p>\"Right,\" Harry says softly. He wants to say Malfoy is sorry, and he <i>thinks</i> he is, after last night, and yet – it's not as though he said so, in so many words.</p>\n<p>\"I haven't heard any apologies for that,\" says Hermione. </p>\n<p>\"Too right,\" says Ron, squeezing her hand, though moments ago he seemed willing to give Malfoy a chance. </p>\n<p>\"Yeah, he didn't look particularly repentant this morning,\" Ginny agrees. \"Just like a smug bastard, as usual.\"</p>\n<p>\"I think,\" says Harry, \"That's how he defends himself.\"</p>\n<p>They sit in silence that makes Harry feel miserable and guilty, though he told himself he wouldn't feel that way. He wishes Malfoy never opened his mouth and said, \"Mudblood.\" He wishes Malfoy never got that mark on his arm. </p>\n<p>\"Well,\" says Hermione. \"We can't tell you who to be friends with, Harry. I'm just telling you that I'm not sure we can ever get along.\"</p>\n<p>\"That's fair,\" Harry says, feeling very small.</p>\n<p>Eventually, Hermione goes to class, and Ron disappears into his bedroom, and Ginny goes home, and Harry sits at the kitchen table feeling restless. He hopes his friends don't think he's an awful person. He hopes Malfoy is not in too much trouble for being so late to work. He doesn't like the way he feels about waking up with Malfoy pressed, soft and sleepy, against his back. He's <i>not</i> sleeping with Malfoy, and that's okay. He doesn't want to sleep with Malfoy.</p>\n<p>He apparates to the coffee shop.</p>\n<p>Caitlin and another few people are there, but Malfoy is not. </p>\n<p>\"Called in saying he's <i>ill</i>,\" says Caitlin. She is giving him a sly look, and Harry doesn't see why she should. He shifts from foot to foot, intensely uncomfortable for reasons he doesn't – or doesn't want to – understand. \"But I'm just getting off work in about five minutes. Do you want to go back with me to the flat?\"</p>\n<p>Harry doesn't know whether this is odd or not. Malfoy came over to his last night – does that make them at a point where they're allowed to drop in to see each other? Harry can't really work out what's odd and what's not anymore, anyway, after the conversations of last night and the strangeness of this morning.</p>\n<p>\"We were thinking of going out tonight,\" says Caitlin. \"You could just come with us straight away instead of meeting us there.\"</p>\n<p>Harry remembers how much alcohol he consumed last night, and how he felt this morning, and somehow decides this is a good idea, anyway.</p>\n<p>Malfoy's flat is indeed too small for the six – and oftentimes more – people who live there. The neighbourhood is a bit dodgy, and without silencing charms, they can hear people stomping about upstairs, talking and shouting outside, creaking around in the hallway and up and down the stairs. Somebody has put loud rock music on the stereo, possibly Teresa, because she is the one sitting next to it bobbing her bare feet as she reads through a battered book that's probably for university, which he knows she attends. He can hear someone rifling around in the miniscule kitchen. Malfoy is sitting by the window with Sadie and Patrick and a boy unfamiliar to Harry, and the four of them appear to be passing a joint around, in front of a fan strategically positioned to get rid of the smoke and the heady smell with mixed success.</p>\n<p>Harry suddenly feels very, <i>very</i> weird, weirder than he did before, as though he shouldn't be here, though he doesn't know why – but of course, this feeling has never stopped him from doing anything before. </p>\n<p>\"I brought a guest,\" Caitlin announces as she opens the door.</p>\n<p>\"Harry Potter!\" Sadie says, \"<i>Hello</i>!\" It occurs to Harry only as he stares at her dragging smoke into her lungs that what he has always taken as a particularly friendly, peaceful disposition is probably a particularly weed inspired disposition, and he wonders why he never notices things like this until they smack him in the face.</p>\n<p>\"You're here in time for dinner,\" says Abigail in her pleasant way – a different kind of polite pleasantness than Sadie's stoned pleasantness – and she emerges from the kitchen and drops a pile of takeaway menus on the couch. \"We're splurging tonight.\"</p>\n<p>Harry looks at Malfoy, trying to discern how <i>he</i> feels about his presence. He stares back for a long while in silence, eyes slightly red, and then he gives Harry a slow smile that makes Harry want to turn around and run away, except he's not the type of person who runs away. He's not. So he holds eye contact for a moment longer, and then he turns to Teresa and says, \"Isn't this music pretty old?\"</p>\n<p>Teresa gives him a withering look rivaling Malfoy's. \"Are you an alien like Draco?\" she says. \"Have you never heard of Led Zeppelin, either?\"</p>\n<p>At Harry's blank look, she sighs as though the weight of the world is on her shoulders and says, \"Was your boarding school on <i>Mars</i>?\"</p>\n<p>\"Yes,\" says Malfoy, standing up and stretching languidly at the window. </p>\n<p>He has changed into a sweater – it's <i>cold</i> in the flat – and different jeans, and Harry finds that it is a struggle not to stare at him. </p>\n<p>\"Shut up, Draco Malfoy, obviously it was, because you're named after a <i>constellation</i>,\" says Teresa.</p>\n<p>\"Old <i>news</i>,\" Malfoy sighs, and he falls against her on the couch to examine the takeaway menus. \"I'm starving.\"</p>\n<p>\"Harry,\" Sadie says, strolling up to him to hug him around the waist. Cautiously, he hugs her back. \"Would you like,\" she says, as though she sees herself as a benevolent spirit in this moment, \"To get high?\"</p>\n<p>When they are in a usual pub of theirs later, Harry rather regrets saying yes.</p>\n<p>Well, he regretted it the moment he took a hit, really, when he was unable to hold back a thick cough and Malfoy smirked and drawled, \"Take it like a man, Potter,\" and Harry felt those words curling in the pit of his stomach and stretching to his groin in a fairly alarming turn of events.</p>\n<p>He should have taken this as a sign.</p>\n<p>He has done this before, but only a few times, and this time it is not as pleasant – which might have something to do with the addition of alcohol and preliminary stress. The light in the tube seemed particularly harsh on the way to the pub, and the swaying of the train knocked his shoulder against Malfoy's, sharp but warm, and all the people seemed far too close to him, and he couldn't wait to get off, even with Malfoy's lazy, content eyes flicking to him so frequently. Harry noticed this new bloke, a friend of Sadie's he's already forgotten the name of – he thinks it's something with a C – staring at Malfoy a lot, too, and he didn't like it at all, even though he doesn't want to sleep with Malfoy.</p>\n<p>Now, he keeps looking at Malfoy for long periods of time, and then feeling <i>certain</i> that people know he's doing it and they know exactly why, even though he doesn't know himself. He keeps thinking about Hermione saying, \"I suppose you've never been called a mudblood,\" and wondering what his friends are doing, and what they think he's doing – and this new bloke is chatting up Malfoy, and Malfoy seems really quite receptive to it. He laughs at his jokes and lets him buy him drinks and drinks recklessly, so Harry drinks recklessly, too.</p>\n<p>When Harry manages to tear his eyes away from Malfoy, he stares at the bar, instead. It holds his interest for quite a long while, until Abigail sits down next to him and says, \"Do you feel okay, Harry?\"</p>\n<p>Harry blinks and looks up at her kind face, feeling as though he's been pulled right out of the grain of the wood. \"Of course,\" he says, blinking.</p>\n<p>\"You don't look so good,\" she says.</p>\n<p>\"I'm really fine,\" he says. </p>\n<p>\"Okay,\" she responds, but she stays with him, and that's that.</p>\n<p>This is nice, and it makes Harry feel like maybe he really is okay, until he turns and his heart drops to his stomach; Malfoy and bloke-whose-name-starts-with-a-C are kissing on the other end of the bar.</p>\n<p>Harry realises he has never seen Malfoy kiss anybody. </p>\n<p>The boy pulls Malfoy closer by the waist, his hands ghosting lower than they should go in a public place, and Malfoy has a long-fingered hand tangled in the boy's hair, and Harry is hit by a wave of hurt and longing so hard that his gut roils and he cannot ignore it. </p>\n<p><i>No</i>, he thinks desperately, <i>no</i>, he can't. He can't want Malfoy. It's <i>Malfoy</i>. He takes apart remote controls, and he's named after a constellation, and he used to call Hermione a mudblood. He's mad, and Harry wants to sleep with him.</p>\n<p>It doesn't matter that Malfoy's a bloke, but can't it be a different one? Can't it be someone who isn't kissing anybody else against the bar, with a dark mark hidden beneath his sweater?</p>\n<p>\"Oh, no,\" says a voice next to him, and Harry whips his head around to see that Caitlin has joined Abigail next to him, and they are looking at him with <i>pity</i>, pity like Ginny looked at him when she didn't love him, and now Harry feels furious. \"Harry,\" says Caitlin, \"I don't think he realises – \"</p>\n<p>\"Don't!\" he shouts, like the idiot he is, and then, at the girls' alarmed faces, he says, \"Sorry. Sorry. I'm going to go home now. But I'm <i>fine</i>. It's – I don't care. There's nothing for him to realise. I don't know what you're talking about. I'm not gay, you know.\"</p>\n<p>This is such a stupid thing to say, because Harry <i>knows</i> he's not straight, either, but he just wants them to believe he doesn't have feelings for Malfoy, even though – he does. He just wants those pitying looks wiped off their faces. He didn't need anybody's pity when Ginny didn't love him, and he doesn't need any pity because Malfoy doesn't – love him. It's <i>Malfoy</i>. And Harry can take care of himself.</p>\n<p>He remembers Ginny's pitying face again, and he thinks if Malfoy ever looks at him like that he doesn't know that he'll be able to take it. Malfoy doesn't <i>pity</i> him. Malfoy says things like, \"I don't know why people think you are special,\" and, \"You sentimental undead freak,\" but also, \"Nobody's as perfect as they make you out to be in the papers,\" and Harry doesn't want that to go away. Oh, <i>fuck</i>.</p>\n<p>Harry apparates back to the flat even though he's too drunk and probably still too high for that, even though he's already nauseated and confused, and he means to end up in his bedroom, but he ends up in the kitchen instead, where Hermione is sitting with a cup of tea. Ron is nowhere to be found; perhaps he's in his bedroom. Harry's gut roils again, and he feels grateful he did not splinch himself. He's so <i>stupid</i>. </p>\n<p>\"Hello, Harry,\" Hermione says, quiet, reserved.</p>\n<p>\"Hello, Hermione,\" says Harry, head spinning.</p>\n<p>Hermione's eyebrows wrinkle. \"Harry?\" she repeats. </p>\n<p>\"Whassup, Hermione?\" he says, and he knows his words are slurring.</p>\n<p>\"Are you drunk? Did you apparate drunk?\"</p>\n<p>\"I don't need this,\" he says.</p>\n<p>\"Did you apparate <i>drunk</i>?\" she repeats. \"Where were you? With Malfoy?\"</p>\n<p>\"None of your business, <i>mum</i>,\" he says, and he only just makes it to the toilet before vomiting spectacularly.</p>\n<p>He shouldn't have spoken to Hermione that way, and yet when he's through throwing up, forehead hot against the cool porcelain of the toilet, she gets him a glass of water and puts him to bed, not saying another word. Ron must be asleep, sleeping like the dead as he does, because he doesn't turn up.</p>\n<p>It's so lovely of Hermione to do this for him – he remains so overwhelmed by people doing things for him, genuine things that have nothing to do with The Boy Who Lived – and he remembers the way she and Ron behaved when he told them about being bisexual, or whatever he is. She loves him.</p>\n<p>\"'Mione,\" he mumbles, after she's pulled the blankets over him and begun to leave the room.</p>\n<p>\"Yes?\" she says, turning back around. Her hair is fighting its way out of the messy bun she's stuck it in, frizzy strands highlighted against the light of the hall as she stands in the open doorway.</p>\n<p>\"How did I get you to love me?\" </p>\n<p>Hermione steps back toward him, but she seems, for the second time that day, lost for words due to something Harry has done. This is quite an achievement, but he doesn't feel pleased about it. </p>\n<p>\"Was it because I saved you from the troll?\" he continues miserably, because he feels he has to, now. \"No, I saved Ginny from Tom Riddle, and she doesn't – and I saved Draco from the Room of Requirement, and – \" He stops. <i>Draco</i>. Who is Draco? This is <i>Malfoy</i> he's talking about. Right?</p>\n<p>He shoves his face into the pillow and swears to never drink – or smoke – again. </p>\n<p>\"Oh, Harry,\" Hermione says quietly. He feels the bed dip slightly as she sits next to his curled up form, and fingers come up to stroke at his hair. \"No, it wasn't because – it <i>wasn't</i> because you saved me from the troll. I mean – that's all – a part of you, of who you are, it's – the sort of thing you'd do. But it was just because – you were, I suppose.\"</p>\n<p>\"I was what?\" Harry croaks, blankets pulled tight to his chin.</p>\n<p>\"You were Harry. That's all. Harry, I just love you. And so does Ron – and all the Weasleys, even Ginny, she – she does <i>love</i> you, just not in – a certain way. Just because you're you, that's all.\"</p>\n<p><i>Everybody's worth something</i>, Harry remembers telling Malfoy, <i>No matter what they do</i>, and he realises he's a filthy hypocrite, because he doesn't really believe that at all – or he believes it about everybody else, firmly, intensely, but he doesn't believe it about him, though he never actually noticed he didn't believe it. It's just, when he was a child, he was worthless, except perhaps if he was cooking or cleaning or helping around the house, and then his worth was very small, judging by the looks and the snide comments and the way it felt to be tossed into a cupboard by the scruff of his neck. At Hogwarts, the whole point of him was Voldemort, and then he died, and – why exactly did he come back? </p>\n<p>\"Hermione,\" he announces, turning to look at her and tossing the blankets dramatically away from himself to achieve this, \"I think the papers are right about me.\"</p>\n<p>\"What do you mean?\" she says, and Harry is horrified to see tears in her eyes. </p>\n<p>\"Oh, don't,\" he says, reaching for her small wrist and gripping it tightly. \"It's okay.\"</p>\n<p>\"I love you,\" she insists.</p>\n<p>\"I love you,\" he insists back, and then Ron appears in the brightened doorway, disheveled with sleep, rubbing the back of his neck and squinting into the darkness of Harry's room. </p>\n<p>\"Wassamatter?\" he mumbles.</p>\n<p>\"Harry's a bit upset,\" says Hermione, wiping her eyes with the back of her sleeve.</p>\n<p>\"<i>Hermione</i>,\" Harry sighs. \"Don't do that, don't <i>cry</i>.\"</p>\n<p>\"I'm not,\" she says sharply, even though she is.</p>\n<p>Ron blinks, his forehead creasing in a frown, and he shuffles into the room and sits heavily next to Hermione, wrapping his arms around her waist. \"Why're you upset, Harry?\" Ron asks, chin on her shoulder.</p>\n<p>\"We love him, right?\" says Hermione. \"Just because, right?\"</p>\n<p>\"I mean,\" says Ron, bewildered. \"Yeah. I mean, for loads of reasons.\"</p>\n<p>\"We love him for who he is, though, he doesn't – need to do anything special.\"</p>\n<p>\"'Course,\" says Ron. \"He's just brilliant as is, isn't he, the wanker.\" He tries not to yawn and fails. Harry is not sure Ron is entirely awake.</p>\n<p>\"I just think I have <i>mental complications</i>, that's all,\" says Harry.</p>\n<p>\"Yeah, you are pretty mental,\" Ron says agreeably.</p>\n<p>\"What is <i>wrong</i> with you?\" says Hermione, tugging herself out of his embrace.</p>\n<p>\"<i>What</i>?\" says Ron. </p>\n<p>\"It's okay, I am,\" says Harry. \"I had a bit of a dark lord's soul in my head. I had fits in the middle of class, and all that,\" he says, remembering Malfoy's words, except it hurts to think of Malfoy, who is probably hooking up with bloke-whose-name-starts-with-a-C, while Harry lies here being fucked up and utterly pathetic. \"I just think I – don't know what I have to do next.\"</p>\n<p>\"You don't <i>have</i> to do anything, mate,\" says Ron.</p>\n<p>\"Exactly,\" says Hermione. \"I think now you get to choose what you have to do yourself. No one else is going to tell you what to do, but – isn't that liberating? Now your life can be – all for you.\"</p>\n<p>Harry has always wanted his life to be his. It's never quite felt that way.</p>\n<p>\"Yeah,\" he says. \"Yeah, I suppose. I shouldn't be upset, anyway. I could be – I mean, so many people died and I – well, I did, but – I should be grateful I got to come back.\"</p>\n<p>\"Harry,\" says Hermione. She reaches out and smooths back his hair with cool, gentle fingers, eyes still sad. \"I think you've been through quite enough to allow for being upset.\"</p>\n<p>\"Yeah, if you're not allowed to be upset, the rest of us are bloody ungrateful arseholes,\" says Ron. </p>\n<p>\"And being upset sometimes doesn't mean you're not grateful for the good parts,\" says Hermione. \"It's okay to feel both, you know. They're not mutually exclusive feelings.\"</p>\n<p>\"Yeah, I suppose,\" Harry repeats, his stomach unclenching like it did when Malfoy said, \"He likes <i>both</i>,\" and somehow he ends up sleeping with both Ron and Hermione in his bed, Hermione curled up between the boys, Ron too long to be sharing with Hermione <i>and</i> Harry, his big feet hanging off the edge. Harry listens to Hermione's quiet breathing and Ron's snores, and his head hurts and his stomach feels painfully empty, but he has not felt so safe and content in a long while.</p>\n<p></p>\n<p>\n<b>December 2000</b>\n</p>\n<p>It doesn't <i>really</i>, anyway, not in a day to day sort of way. Harry still hangs around his flat with Ron and Hermione, and sees his other friends, and cooks and reads a lot. He still turns up at the coffee shop every morning, and Malfoy still has his coffee order ready, and chats to him like a madman about the silliest things, and eats lunch with him over the Daily Prophet like he's never eaten before, though always with his napkin incongruously on his lap. It's just now, Harry expends most of his energy around Malfoy trying desperately to quash the the longing feelings that flutter up whenever he smiles, or laughs, or holds a cigarette to his lips, or lights up with enthusiasm over the most normal of muggle things. It's as though these feelings snuck up on Harry, these stupid, tugging, longing things, and then, in one moment, they pounced, and Harry hasn't a hope of disentangling himself from the mess.</p>\n<p>That bloke with the C name has disappeared, anyway. He was a friend of Sadie's only \"passing through,\" or something, and for Malfoy, he was a one night stand, Harry guesses, or something like that – he doesn't know if they slept together, and it's not like he's going to ask. He doesn't like to think about it. He barely likes to look at \"no hard feelings\" Patrick, who is a fucking poncey idiot, in Harry's newly decided opinion, and has definitely seen Malfoy naked, and had permission to touch the small of Malfoy's back like he did all those months ago, the first time Harry saw them in a pub.</p>\n<p>Harry spends his days now cursing the rationale for falling for someone, because it seems there isn't one. Malfoy isn't gorgeous and flawless like a film star. Harry's seen plenty of more attractive people. Malfoy is too skinny, and too pointy, and too pale, and he is, indeed, Harry discovers one evening as Malfoy changes out of his work clothes, covered in scars, crisscrossing all over his torso as a reminder of Harry's stupidity. He has that ugly mark on his arm, too, and he smokes too much, and drinks far too many cups of coffee a day, so he's always on edge. He's argumentative and rude and completely mental and even ugly when he sneers. And when he leans close to Harry to show him something from the Prophet, smelling like vanilla and coffee and cigarettes, Harry wants to kiss him, and it's so, so stupid. It doesn't make any sense at all.</p>\n<p>Harry never tells Ron and Hermione how he feels about Malfoy, but he thinks they've worked it out. They simply don't talk about Malfoy very much. Ron and Hermione know where he goes when he's gone, and that's that. Harry wants to apologise for wanting to kiss someone who called Hermione a mudblood, but he doesn't know that it's his fault. He doesn't want to blame himself for this, because he doesn't want to blame himself for things anymore, not unless it's absolutely, certainly his fault, and not if he can't control it. Blaming himself has gotten him nowhere good.</p>\n<p>And despite all of these awful feelings, the year carries on. Signs of the holidays are turning up everywhere now, in shop windows and adverts, over the coffee shop radio and on its chalkboard of special drinks and snacks. Malfoy is thoroughly charmed by Christmas films and specials and music, and now everyone has to deal with him shouting things like, \"Keep the change, you filthy animal!\" at unsuspecting customers, and drinking more coffee than is usual or advisable because he really likes the gingerbread and peppermint lattes.</p>\n<p>Caitlin and Abigail, it seems, have kept their mouths shut about Harry's reaction to seeing Malfoy snog someone else, and Caitlin has not brought it up to Harry again, either. Harry feels weirdly guilty about having told them he is not gay when it's only half true – sort of – and that feeling seems to colour all his interactions with Caitlin in the coffee shop. He finds himself avoiding her eyes more often than not, especially when Malfoy is around, obliviously chatting on and ruffling Harry's hair and leaning over his shoulder to look at his books.</p>\n<p>One completely good thing has happened, though – at least, Harry is choosing to classify it as a good thing. He asks Ginny to lunch one day, because he realises he misses her in a way that is not pining; he misses her like he misses Hermione when she disappears to study for exams and doesn't turn up at the flat as much. He loves her because she is his friend, and a part of his surrogate family. And as he eats with her, and they make fun of Ron and speculate about how much Weasley's Wizard Wheezes will make over the holidays and discuss the Quidditch season, Harry realises he does not want her, not in the way he did. She is very pretty, and it's obvious as she sits across from him in a new dress, with her long, red hair pulled back with a barrette. She makes Harry laugh a lot, and she's clever and talented, and she talks Quidditch with enthusiasm that nearly rivals Ron, and Harry doesn't feel as though he wants to be dating her again. He feels like he wants her back in his close circle in a different way – as a friend. </p>\n<p>He still feels a twinge of bitterness when he imagines her pitying face at the kitchen table, and Harry's love life's probably not any better, now he's managed to go and fall for someone just as unavailable – but he allows himself to think of this as progress. </p>\n<p>It's two weeks 'til Christmas when Malfoy invites Harry to a Christmas party.</p>\n<p>They're eating sandwiches for lunch on Malfoy's break, in a place just a couple blocks from the coffee shop. Malfoy is reading the Daily Prophet inside a muggle newspaper, as usual, and Harry is watching him and pretending not to, as usual. They've already discussed the article about Harry inside; the Daily Prophet has finally got wind of Harry's decision not to go through auror training. He doesn't know how they could have found out and wonders if they have some kind of source in the auror department. Again, the article is more sensational than necessary, and speculates about his mental health and what he might pursue as a career instead. Harry can't say whether their ideas are very accurate or not, because he doesn't even have an idea himself. </p>\n<p>\"We're having a Christmas party next week,\" Malfoy says, putting down the paper and taking a long drink from his wax cup. </p>\n<p>\"Yeah?\" says Harry, covertly watching Malfoy's throat working as he swallows. When they walked in here, they were freezing – Malfoy is still wearing his gloves – and now it suddenly seems rather warm. Harry averts his eyes. </p>\n<p>\"Yes,\" says Malfoy, \"And I'm inviting you. And we would also...\" He looks down at the table, tapping his gloved fingers on the sides of the cup he's still clutching. \"We would also like to extend an invitation to your friends. Granger and Weasley. If they'd like to come.\"</p>\n<p>\"Really?\" says Harry, completely blown over.</p>\n<p>\"Really,\" says Malfoy. He surprises Harry with a fierce look, that look that reminds Harry sometimes of Ginny, and says in a hot, defensive tone, \"I've been thinking about what you said about – righting things, rather than running away, about how there are things I could do. And I think if I apologised to Granger and Weasley – that would be – a thing to do.\"</p>\n<p>Harry blinks. He feels as though he's having trouble keeping his heart in his chest, with the way it's swelling, and then he feels like Malfoy might be making him go soft, which is ridiculous, because Malfoy is not a soft person at all. </p>\n<p>Except he is, Harry remembers, sometimes. He thinks of Malfoy singing <i>Rudolph The Red Nosed Reindeer </i>at the top of his voice on the way here, getting all the reindeers' names wrong, and beaming at anybody who smiled instead of stared at him like he was raving. He thinks of Malfoy listening earnestly to a little girl in the coffee shop yesterday, and Malfoy ruffling Harry's hair, and Malfoy soft and sleepy in the couch-bed with him, and Malfoy soft and drunk, with his fingers and socked feet brushing Harry's, as they had their conversation about running away and lots of other things. Harry thinks of these things and then wishes he could obliviate himself, because it makes him want to kiss Malfoy even more, to have been able to take his hand on the street even though he was singing \"Rudolph with your nose so bright, won't you guide my sleigh tonight?\" like a fucking prat. And he can't. Harry can't do those things, and he wishes that that was okay with him, but it's not. </p>\n<p>\"You're staring at me,\" says Malfoy, lifting an eyebrow. Harry can see right through this disdain to Malfoy's insecurity about inviting Ron and Hermione to the party, and he hates how tender his feelings about Malfoy's insecurity are. He never expected to feel anything like tenderness towards Malfoy.</p>\n<p>\"I – thanks,\" Harry manages. \"I mean, for inviting them, yeah – thanks. I'll let them know.\"</p>\n<p>\"It's next Friday,\" says Malfoy.</p>\n<p>\"Brilliant,\" says Harry. \"We'll be there.\"</p>\n<p>There is a long moment of eye contact, confusing with how intense it is, and then Malfoy clears his throat and says, \"I should be getting back.\"</p>\n<p>\"Yeah, okay,\" says Harry, standing at once. </p>\n<p>Startled, clearly not having expected Harry to react so quickly, Malfoy stuffs the last of his sandwich in his mouth and scrambles to stand, too. \"All right, then, let's go,\" he says.</p>\n<p>\"Er – sorry,\" says Harry as he watches Malfoy scramble.</p>\n<p>\"What for?\"</p>\n<p>\"I was a little – I didn't mean to be so – never mind.\"</p>\n<p>\"What?\" Malfoy insists.</p>\n<p>\"Never mind,\" Harry insists back.</p>\n<p>When they get to the door, both Harry and Malfoy attempt to go through first, and then they both attempt to back away and hold the door for the other, and Harry can't believe how fucking awkward this is. \"You go,\" he insists, leaning back against the door, and Malfoy sighs and passes him. </p>\n<p>The moment he's back in the cold air, Malfoy lets out a low whistle and says, \"I am going to lose my bollocks.\" Harry wants to joke with him like he usually does, say something like a sarcastic, \"We wouldn't want that,\" but he is afraid of how it sounds, thinking of his new feelings, so he says nothing. Suddenly, he is sad. Is this how it's going to be now? Will Harry always be so awkward and quiet and unable to joke with Malfoy like he loves to do? Has he made a mess of everything?</p>\n<p>Malfoy flicks him a petulant sort of look, and Harry knows he is displeased that Harry is not paying attention to his temperature related distress. He shivers with great drama. Twice. When this produces no effect, either, he catches Harry completely off guard by jumping forward and grabbing onto Harry's waist, insinuating himself into the warmth of Harry's still unbuttoned coat. </p>\n<p>\"Uh!\" says Harry, his breath expelling in a big, white cloud.</p>\n<p>\"I need more layers,\" says Malfoy. \"Button it over me.\"</p>\n<p>\"I will not,\" says Harry. Malfoy smells lovely and familiar, and with his arms tight around Harry's waist like this, he can probably feel Harry's heart pounding.</p>\n<p>\"You would have me contract hypothermia and die,\" says Malfoy, pressing his face into Harry's shoulder. He's taller than Harry, but not by too much to comfortably do this, and not by so much that their hips and chests don't press close together inside the coat. </p>\n<p>\"Yeah,\" says Harry, swallowing, his arms still sticking out from his sides in stupid, snowman fashion, because he refuses to put his arms around Malfoy.</p>\n<p>People passing them on the pavement are starting to stare.</p>\n<p>\"Malfoy,\" Harry hisses. \"People are looking.\"</p>\n<p>\"Oh, I forgot,\" Malfoy sighs. \"You're such a straight man, Potter. God forbid people think you're gay.\"</p>\n<p>\"Um,\" says Harry. \"No. I just – \"</p>\n<p>\" – would rather watch me slowly turn to frostbite and crumble before your very eyes than look like you might be gay, I understand,\" Malfoy says loftily.</p>\n<p>\"Malfoy...\" says Harry. Malfoy's breath is hot against his neck. \"First of all, I hardly think that's how it works.\"</p>\n<p>\"You have no idea.\"</p>\n<p>\"I have some idea. I just – this coat won't fit around both of us.\"</p>\n<p>\"Yes, it will,\" Malfoy insists. \"You dress like you were once obese and couldn't be bothered buying a new wardrobe when you lost the weight.\"</p>\n<p>Harry sighs loudly, long-sufferingly, and realises he hasn't a hope. He only just manages to button his coat over Malfoy's taller, thinner body, and they hobble slowly back to the coffee shop like this, earning themselves a great deal of entirely deserved stares. Malfoy keeps his arms wrapped around Harry's waist, and his head tucked into Harry's neck so it won't be in the way of Harry's vision, and it's such awkward positioning for walking, but Harry soaks in his warmth and feels him breathing and feels his hair soft against his jaw and wants to close his eyes and stop for a while, but doesn't. </p>\n<p>Even after sleeping in the same bed, Harry's fairly certain he's never been quite this close to Malfoy, and he wonders what it'd be like to be this close to him often, whenever he felt like it. Malfoy looks like a sharp, cold person, but he's not really. His body is comfortable, pliant, and it fits very well against Harry's. They could lie like this comfortably. It's not strange at all that Malfoy has no breasts, and such broad shoulders, and such narrow hips. Harry is definitely attracted to men. Harry is definitely, hopelessly attracted to Malfoy. </p>\n<p>They're about three quarters of the way there when Malfoy abruptly stops walking. Harry steps on his toes. </p>\n<p>\"Fuck,\" says Malfoy. \"You fucking oaf.\"</p>\n<p>\"You stopped!\" Harry says, feeling pretty good natured about it, actually, because all this proximity is making him light headed and happy, even if he shouldn't be letting it. </p>\n<p>\"Yes,\" Malfoy says in a tight, angry voice, and Harry stops laughing at him at once, because he doesn't sound like he's simply upset about his feet.</p>\n<p>\"What's wrong?\" says Harry.</p>\n<p>\"I'm too warm now,\" says Malfoy. \"Unbutton it.\"</p>\n<p>\"What?\"</p>\n<p>\"Unbutton your coat!\" says Malfoy, and Harry is so startled by the urgency in his voice that he does it, without even complaining about being bossed about.</p>\n<p>Malfoy steps away from Harry, turns on his heel, and strides away, hardly waiting a second. Harry just stands where he's been abandoned, coat flapping open, utterly confused. He looks around. There's hardly anybody on this street, and besides, they've just walked through lots of people, laughing off their stares. There's nobody either of them know here, either, as far as Harry knows. They were laughing. They were having fun. What could possibly have caused Malfoy to behave that way?</p>\n<p>When Harry trails awkwardly into the coffee shop a few minutes later, Malfoy is already settling himself behind the counter. When Harry tries to speak to him, he is brushed aside. He reads for a while at his usual table, but he can hardly concentrate, and even when the steady stream of customers dies down, Malfoy doesn't come to speak to him. </p>\n<p>Eventually, he approaches the counter and says, \"I'm just going to leave now, then, Malfoy.\"</p>\n<p>\"Yeah, alright,\" Malfoy says dully, and he turns to Caitlin and begins chatting to her in earnest about something involving Patrick.</p>\n<p>Harry blinks. \"Okay, bye,\" he says pathetically, and leaves.</p>\n<p></p>\n<p>***</p>\n<p>Harry is so confused. He knows Malfoy now, and he knows when Malfoy freezes up, hardens, becomes the Draco Malfoy that antagonised him in school, it's because he's unsure of himself, unsure of where he stands with whoever he's interacting with. Malfoy approaches everybody like this at first – guarded, cool, infuriating, and underneath all that, under the stiff posture and immaculate appearance, ready to strike at a moment's notice, ready to snap at anybody who shows even the slightest hint of disliking him, embarrassing him, hurting him. Draco Malfoy does not stand for that. Draco Malfoy is boss, and nobody does anything to him he doesn't want, or else – or at least, that's what he'd like everyone to believe.</p>\n<p>And Harry doesn't know he managed to get himself back on this side of Draco Malfoy. He doesn't want to hurt him or embarrass him. He doesn't dislike him at all, not really, because he knows the brilliant but insecure person underneath all that. He knows the person who is obsessed with muggle technology, who laughs and sings unreservedly, who ran away from home to prove himself. He knows this person, and he wants this person, and he is distressed that Malfoy might be unsure of where they stand. He hopes desperately that it isn't his fault, that Malfoy hasn't worked out how Harry feels and reacted with this freeze out. He knows Malfoy doesn't feel the same way, couldn't possibly want him back, but he doesn't want this to end their new friendship, and he is so afraid that it will.</p>\n<p>Malfoy may be behaving strangely, but Harry's sure his invitation to the party still stands, and he doesn't know what to expect when he tells Ron and Hermione they're invited to Draco Malfoy's Christmas party, too. But when he explains what Malfoy said about wanting to apologise, something he assumes must still be true, <i>has</i> to be, Ron manages to convince Hermione to come and give it a chance. This is the opposite of what Harry expected when he first imagined telling his friends he was friends with Malfoy, but it works. </p>\n<p>The day before the party, Harry decides to do his holiday shopping, surprising even himself with the timely nature of this venture. He wonders if he ought to buy something for Malfoy and has no idea what he might want, or what he already has. He wishes he didn't want so desperately to impress Draco Malfoy, but he suspects this isn't actually a new desire.</p>\n<p>He does find some things for his godson, though, and after this, he decides to pay him a visit, cellophane bag of Christmas themed chocolates in hand, even though Teddy and Andromeda will be at the Weasleys' big family Christmas. They have been invited since the war, because they don't really have anyone else to celebrate with anymore. Harry is not glad they lost so many people, but he is glad Teddy gets to experience a big, happy Christmas, where everybody fusses over him and chatters to him about Santa Claus and gives him more presents and sweets and hot chocolate than he should have in one day.</p>\n<p>When Harry gets to Andromeda's house, Teddy is sitting at the kitchen table in his little overalls, \"helping\" her make biscuits, rolling the dough into lumps of all different sizes and stuffing it into his mouth with sticky fingers despite Andromeda's best efforts to prevent this. </p>\n<p>\"Harry!\" Teddy cheers when he sees him, standing up on his chair and demanding a hug. Harry scoops him up into his arms, and Teddy gives him a wet kiss on the cheek, threading those sticky little fingers in Harry's hair.</p>\n<p>\"Teddy,\" Andromeda sighs.</p>\n<p>\"It's alright, my hair's hopeless anyway,\" says Harry. He looks at her tired eyes and greying hair and says, \"Andromeda, you know my offer to look after him whenever you need it still stands. I'm not doing anything else.\"</p>\n<p>\"Yes, the Prophet does like to go on about that, I noticed,\" says Andromeda, flicking her wand and eliminating the flour all over the kitchen counter.</p>\n<p>\"Yeah, well,\" says Harry.</p>\n<p>\"The Prophet's such rubbish. As far as I'm concerned, you could use a break.\" She eyes Teddy's handiwork and says, \"I will bring something to eat this Christmas whatever Molly Weasley says. That woman overworks herself.\"</p>\n<p>\"Yeah, she does,\" Harry agrees, placing an impulsive kiss in Teddy's turquoise hair.</p>\n<p>Andromeda smiles. \"I really ought to take you up on that offer,\" she says, leaning against the counter and wiping her hands with a washcloth. \"You are very good with him.\" </p>\n<p>Surprised, Harry says, \"Am I?\" He always thought he was just as useless at this as he is at most social things, and that Teddy likes him by some miracle or accident. Teddy starts to play with the collar of Harry's coat, folding it up and down, up and down.</p>\n<p>\"You are,\" says Andromeda. \"He adores you. You are patient with him.\"</p>\n<p>\"Well, that's a first,\" says Harry, \"Nobody's ever called me patient before,\" and Andromeda laughs with him.</p>\n<p>\"You're patient with him,\" she says, and Harry is inordinately proud. He is certainly not patient by nature, but he always tries to behave in an understanding way with Teddy, knowing how awful it felt to be shouted at and misunderstood as a child. Besides, children are different from adults; they don't know how to be any quicker, or understand any better, and they can be excused for things adults can't. Harry wishes he had been excused for things as a child; perhaps then he'd be able to forgive himself sometimes.</p>\n<p>\"Have you ever considered working with children?\" Andromeda asks. </p>\n<p>Harry blinks, surprised again. \"No,\" he says.</p>\n<p>\"I remember Dora saying you had an organisation at Hogwarts,\" she says, \"In which you taught Defense Against the Dark Arts. Did you find you enjoyed that?\"</p>\n<p>\"Yes,\" Harry says honestly, remembering the pride he always felt when everyone in the D.A. learned something.</p>\n<p>\"Well, that's always an option, isn't it?\" she says. \"Might need your NEWTs for that, but look at the Longbottom boy, he's doing it later. And there's always primary school, as well – less magic and more reading and writing and maths and basic skills like that, but it's an option. They're putting in a sort of basic muggle studies at the wizarding primary schools now, too, I heard.\"</p>\n<p>\"Yeah,\" says Harry, \"Kingsley's been backing that.\" He looks at Teddy, who grins at him, wide and toothy now. He smiles back. \"Yeah,\" he repeats. \"That's always an option.\"</p>\n<p>Later, as Harry and Andromeda have tea and Teddy sits on the floor playing with little toy Quidditch players on broomsticks, making many creative zooming and whooshing and crashing sound effects, Andromeda says, lowering her voice, \"I got a letter from my sister the other day.\"</p>\n<p>Harry chokes on his tea. \"Your sister?\" he splutters.</p>\n<p>\"Yes,\" says Andromeda. \"It was – unexpected, to say the least. But it was a very long, very heartfelt letter, and I think – I might go to see her soon.\" She looks closely at Harry. \"Have you heard anything recently about her son? Draco?\"</p>\n<p>\"Er,\" says Harry. <i>Yes</i>, he thinks. <i>I might be a little in love with her son, actually</i>.</p>\n<p>In <i>love</i>. He thought of it as <i>love</i>. He hates himself. He's fucked.</p>\n<p>Andromeda raises an eyebrow and reminds Harry so strongly of Malfoy that he feels even more taken aback. \"Er?\" she repeats. \"According to Narcissa, he has left home without a trace. She is disconsolate over it. He is her only son, after all. She has no idea how he is keeping. She wrote to him once, and he didn't write back. Apparently it was this that made her want to contact me. She says she has seen the way her views have lost her far more than she's gained from them. She says Draco was the last straw, and that the universe must be punishing her for being wrong about things.\"</p>\n<p>\"Why are you telling me this?\" says Harry.</p>\n<p>\"I want you to know that people change,\" she says simply. \"That they learn from their mistakes.\"</p>\n<p>\"I do know that,\" says Harry. \"I – I know where Draco is.\"</p>\n<p>Andromeda raises her eyebrows. \"You know where my nephew is?\" she says sharply.</p>\n<p>\"Yes,\" says Harry. \"He's okay. He has a place to live. He works at a coffee shop. He's got loads of muggle friends. And – we're – er – friends, as well. I don't know if he's responded to his mother, though. He says he misses her, and I know she wrote a letter, but – yeah.\"</p>\n<p>\"You hesitate on 'friends,'\" Andromeda observes.</p>\n<p>To Harry's dismay, a blush blooms across his face, and there is absolutely no way she does not notice.</p>\n<p>\"Oh,\" says Andromeda, eyes wide. </p>\n<p>\"No,\" Harry says helplessly. \"I – \"</p>\n<p>\"I know that Draco is – \"</p>\n<p>\"Yeah, but it's not – \"</p>\n<p>\"That would be alright. I know you don't need my approval, but all the same.\"</p>\n<p>Embarrassed or not, Harry appreciates this sentiment. \"Thanks,\" he says quietly. \"But I'm pretty sure Mal – Draco doesn't, er.\"</p>\n<p>\"It's alright, Harry, you don't have to talk to me about this,\" she says kindly. \"It's not any of my business. But I will report to my sister that her son is well.\"</p>\n<p>\"Yeah, do that,\" he says. \"I know – how she, er, feels about him. I mean – because she helped me, and everything. Tell her he's doing really well.\"</p>\n<p>\"Of course,\" says Andromeda. </p>\n<p>Teddy toddles over with his Quidditch player figurine, flying it along in his little fingers. \"Harry,\" he says. \"Look.\"</p>\n<p>\"Yeah, I see, mate,\" says Harry.</p>\n<p>\"You fly, Harry,\" says Teddy. \"Right?\" </p>\n<p>\"Yeah, I fly sometimes,\" says Harry. \"I did all the time at school.\"</p>\n<p>\"Play with me,\" Teddy demands, grabbing Harry's sleeve and tugging him toward the floor. </p>\n<p>\"Politely,\" says Andromeda.</p>\n<p>\"Please,\" says Teddy, and Harry spends the rest of the afternoon playing with tiny little Quidditch players with a two year old, thinking of teaching and Narcissa Malfoy. Andromeda has given him a lot to think about.</p>\n<p></p>\n<p>***</p>\n<p>But he can't do that, and Hermione is meant to arrive at the flat some time after dinner to join Harry and Ron, at which point they will get to Malfoy's by public transport; nobody wants to risk apparating into an area anywhere near Malfoy's unsuspecting muggle friends. This really is a perfect opportunity to get Ron and Hermione to spend time with Malfoy, and Harry does not run away from things he's nervous about. He's fought dragons and evil administrators and Lord Voldemort; he can handle a potentially awkward Christmas party.</p>\n<p>Harry and Ron are watching television without paying attention, Harry counting down the hours and trying not to betray his anxiety in any way, when Ron asks, \"How are things, er – going with Malfoy, anyway?\" </p>\n<p>Harry brings his feet up onto the couch and chooses to look at his mismatched socks instead of his friend. So his friends <i>do</i> know how he feels, or suspect it, anyway. He shrugs. \"Fine.\"</p>\n<p>\"Are you...\" Ron doesn't continue. </p>\n<p>\"Am I what?\" says Harry.</p>\n<p>\"I mean – you and Malfoy – you're not – a <i>thing</i>, are you? I mean, you'd tell us, right, before we went into this party and – yeah.\"</p>\n<p>\"We're not a thing,\" Harry says, and he instantly hates himself for the gloomy way this comes out.</p>\n<p>\"I'm sorry, mate,\" says Ron. He doesn't even ask if Harry wants them to be a thing. Harry wants to get defensive and point this out, but he reckons there's no use. He'll only embarrass himself in the long run.</p>\n<p>\"Nothing to be sorry about,\" he says, even though it sort of is.</p>\n<p>\"Are you sure you – er, you know, won't be?\" says Ron.</p>\n<p>Harry finally looks at him. Ron looks back, blue eyes awkward but earnest. \"Hermione would kill me,\" Harry responds. \"Your mum would kill me. No, they wouldn't get to, because the <i>entire bloody wizarding world</i> will already have crucified me on the front page of the Daily fucking Prophet.\" He can't decide if Malfoy's sense of the dramatic has worn off on him or if this is true. They certainly made a fuss about Ginny in the papers, and she was a nice, decent girl-next-door. Malfoy is not only an ex-Death Eater, and the son of an even more prominent ex-Death Eater, but a male. Harry can only imagine Rita Skeeter's delight at getting a story like that. </p>\n<p>He hasn't thought much yet about the way the Prophet will react if he's seeing a bloke, the way they'll mess it all up and say he's gay, full stop, and not get anything right, and his insides twist and curl with even worse anxiety. It's not that he'd mind being called gay as though there's anything wrong with that; he'd mind because it's not who he is, and he's tired of reading about this person he does not know next to his face in the papers.</p>\n<p>Ron shrugs. \"He wouldn't be <i>their</i> boyfriend,\" he says, and Harry can't help feeling warm and pleased at this show of support.</p>\n<p>After a long moment in which they avoid each other's eyes, Harry says, \"Thanks, mate. But.\" He remembers Malfoy wrenching himself away from Harry's coat and striding away, Malfoy kissing that bloke against the bar and chatting about Patrick to Caitlin. \"He doesn't – feel that way about me, so.\" The warm, pleased feelings seem to melt away. </p>\n<p>\"Do you know for sure, though?\" Ron insists. \"Because the idea of you fancying him – I mean, that is weird – \"</p>\n<p>\"Sorry?\" Harry bristles.</p>\n<p>\"Sorry, but it is,\" says Ron, not sounding sorry at all. \"It's fine, though. I suppose you can't help it. I know you, and you probably beat yourself up about it, and you don't have to do that. But that's the part that surprises me, the part where you fancy him. The idea of him fancying you, though – I wouldn't be surprised.\"</p>\n<p>\"What do you mean?\" Harry says, sitting up a little straighter.</p>\n<p>\"Well, he always wanted your attention at school, didn't he?\" says Ron, probably uncomfortable now but forging ahead. \"When we found out he was gay, I wondered – I mean, he didn't always hate you. At first, he wanted to be your friend. And then – he was always popping out of nowhere, wanting you to notice him.\"</p>\n<p>Harry's never thought of it like that. For a moment, his heart aches with hope, and then he reels it back in. He can't think like that. He can't be disappointed again, like he was with Ginny.</p>\n<p>\"I don't think he's interested, Ron,\" says Harry.</p>\n<p>Ron sighs. \"Well,\" he says. He seems to cast around for something supportive to say, and then he brightens and says, \"Maybe you can hook up with one of Malfoy's mates! I mean, you're into anything. The whole party's open to you, isn't it?\"</p>\n<p>Harry laughs. \"Maybe,\" he says, knowing this will not happen.</p>\n<p>When Harry, Ron, and Hermione get to Malfoy's flat that night, Sadie opens the door. She smells strongly of weed, and she hugs all of them, though she's only met Ron and Hermione once and briefly enough not to have actually learned their names. They both look startled, and Harry's nerves return quickly. She says, \"Happy Christmas! Sort of! Draco will be <i>so </i>pleased to see you. I think he's already had a bit too much eggnog, but that's okay, you'll just have to catch up! Have some drinks! Have some biscuits!\"</p>\n<p>There are more people here than Harry has met, crammed into the tiny flat having drinks and snacks and listening to Christmas music. For a moment, Harry feels lost, and then there is a crash from the tiny kitchen, and someone shouts in an American accent, \"Look what ya did, ya little jerk!,\" tugging a smile onto Harry's lips whether he likes it or not.</p>\n<p>\"That'll be Malfoy,\" he says. </p>\n<p>Hermione raises her eyebrows, and Harry gestures for his friends to follow him, leading them into the kitchen, where sure enough, Malfoy is on his knees sweeping up the remnants of a glass that has shattered on the floor, Patrick hovering over him, and Teresa is leaning on the counter saying, \"I'm never showing you a film again for as long as I live.\"</p>\n<p>\"What about after you're dead?\" Malfoy asks. </p>\n<p>\"After I'm dead, I'll be haunting you for the rest of my life, shithead,\" says Teresa.</p>\n<p>\"Is that really necessary?\" says Patrick, and Harry barely resists the urge to roll his eyes. \"Drake, you don't have to do it, really, let me.\"</p>\n<p>\"Patrick, stop acting like Drac<i>o</i> can't do anything for himself,\" says Teresa, and Harry wants to hug her. \"It makes him lazy. He still needs to practise not having servants. Oh, hello, Harry, good, you can take Draco away.\"</p>\n<p>\"Potter, Granger, Weasley, hello!\" says Malfoy, dumping the broken glass into the bin and standing up.</p>\n<p>\"Are you already drunk?\" says Teresa before they can respond.</p>\n<p>Patrick tuts and hurries forward to introduce himself, apparently displeased with Teresa not doing the same. Harry tries to convince himself that Patrick means well, and then he remembers that Patrick has kissed Malfoy, probably a lot, and doesn't seem to have it in him. </p>\n<p>\"I'm not the one dropping my glasses,\" Malfoy points out while Patrick introduces himself to Ron and Hermione.</p>\n<p>\"It was one glass!\" says Teresa.</p>\n<p>\"The point is,\" says Malfoy, waving her away, \"I am not drunk. I am just a bit merry. And that's okay, because it is Christmas time.\" He approaches Ron and Hermione, and to Harry's surprise, shakes both of their hands. \"Thank you for coming,\" he says politely, and they scramble to appear polite, as well.</p>\n<p>\"Yeah,\" says Ron, obviously bewildered. \"'Course.\"</p>\n<p>\"Did you two go to school with Drake, as well?\" says Patrick.</p>\n<p>\"Yes, we did,\" says Hermione. Harry has fed them the story he and Malfoy have told the others – that they attended an old, posh boarding school in the middle of nowhere, Scotland that closed shortly after they graduated. Malfoy's friends seem reasonably convinced of its existence, and of the fact that everyone who went there was filthy rich and at least a little bit mad.</p>\n<p>\"Hermione was top of our class,\" says Malfoy. \"She beat me at everything before I dropped out.\"</p>\n<p>\"Oh,\" says Hermione, surprised. \"Well, yes – I mean, I <i>was </i>top of the class.\"</p>\n<p>\"<i>Really</i>, and what are you doing now?\" asks Patrick, and Ron not-so-subtly takes Hermione's hand at his overeagerness, making Harry laugh.</p>\n<p>\"I'm studying law,\" she says cautiously.</p>\n<p>\"<i>Really</i>, where?\" says Patrick, and Hermione surprises Harry by providing him with a perfectly prepared muggle cover story. He doesn't know why he should be surprised – it is Hermione, after all, who had her beaded bag packed for days before they escaped Bill and Fleur's wedding. As the evening goes on, it becomes obvious she has helped Ron come up with a good cover story, as well, and the fact that they carefully prepared for this party they are attending only for Harry fills him with fondness for them.</p>\n<p>Malfoy is not acting strangely tonight, either, to Harry's surprised delight – he mocks Harry like Harry has grown used to, and sings along to the music, and laughs at Harry's jokes, and ruffles Harry's hair to annoy him. Perhaps it has to do with the festive season, or the alcohol, or something Harry doesn't even know about. Either way, Harry is so filled with intense warmth and relief that he allows himself to loosen up, to laugh and smile at Malfoy and drink, though he knows Ron and Hermione are looking at him funny whenever he and Malfoy share a joke, or Malfoy leans to say something in his ear (because it's loud in here, that's all), or when Malfoy insists Harry dance with him at least once, even though there's hardly room to dance and it's more like flailing and everyone stares. Somehow, Malfoy always convinces Harry to do the stupidest things.</p>\n<p>A couple hours in, Harry gets sucked into a debate with Teresa, Caitlin, and Abigail – Sadie and Patrick are nowhere to be found, and Harry suspects their disappearance has something to do with either weed or sex, as both bedroom doors are firmly shut – and when they're through arguing over the merits of different holiday songs, and Teresa is saying, \"Where is Draco Malfoy? Where's Draco? He will be on my side!,\" Harry realises Draco really is nowhere to be found, and he's been gone for quite some time.</p>\n<p>He hopes he's not in one of those bedrooms, if anybody is at all.</p>\n<p>Except Hermione is missing, too. Ron is having an enthusiastic conversation with someone Harry has not been introduced to, about biscuits, Harry thinks, and Hermione is not with him, or, it seems, anywhere else in the flat.</p>\n<p>Harry makes his way downstairs and outside, where snow has begun to fall thickly, and finds Malfoy and Hermione together on the front steps of the building. This is shocking enough without Hermione also smoking a cigarette, which she is – Harry is fairly sure he's never seen her do so before, and he wonders how Malfoy managed that. They sit side by side, bundled up, their cigarette tips glowing in the chill dark, snow sticking to their hair and clothes, and Malfoy is speaking. Harry freezes just outside the door. They don't seem to have noticed him. </p>\n<p>\" – don't really expect you to forgive me,\" Malfoy is saying. His voice sounds oddly hoarse, unlike Harry has ever heard it. \"I had a terrible enough time in that war, and I can't even imagine what it must have been like for you. I just wanted you to know, like I said – I know my place. Or – I am trying to know my place. And I <i>am</i> truly sorry, for what it's worth – even if that isn't very much.\"</p>\n<p>Harry can tell Malfoy's still a little drunk, but deadly serious, and Hermione regards him solemnly in the dark. To Harry's anxious surprise, she looks as though she might have been crying, and the hoarseness of Malfoy's voice registers in Harry's mind again – he hasn't been crying, too, has he? There's no way.</p>\n<p>\"Harry likes you,\" she says finally, and Harry wants to dissolve into the front door and never come back. </p>\n<p>\"Mm,\" says Malfoy, revealing nothing at all, and he wipes his eyes with his arm. Harry is confused by this, and longs to comfort him, looking at him sitting there on the steps, so stiff and tense.</p>\n<p>\"I don't know that I completely forgive you yet,\" says Hermione. \"But I can accept your apology. I can accept you trying. And I can try, too.\"</p>\n<p>\"Well,\" says Malfoy. \"That's more than I ever expected.\"</p>\n<p>\"Malfoy,\" says Hermione. She looks away from him, then back, and says, \"There was nothing you could have done.\"</p>\n<p>\"There was,\" says Malfoy.</p>\n<p>\"There wasn't,\" she says, confusing Harry until she says, \"She would have just tortured you, too,\" and Harry realises with a thrill of horror that Malfoy was there when Bellatrix Lestrange tortured Hermione in the drawing room at Malfoy Manor. He remembers Malfoy coming to the basement at one point, but other than that – he was there, watching.</p>\n<p>\"I could have been brave,\" says Malfoy, his voice breaking. \"But I never have been.\"</p>\n<p>\"It's not too late to be brave,\" says Hermione. \"I think letting your family know how you feel about blood status now was brave. I think talking to me like this – so honestly – that was very brave.\"</p>\n<p>\"I'm also drunk,\" says Malfoy, and Hermione actually laughs, and Harry suddenly feels like an intruder to their conversation, like he really shouldn't be eavesdropping so obviously, and he steps back, attempting to slip inside – and stumbles, skidding on the snow slippery stoop. </p>\n<p>Malfoy and Hermione turn around.</p>\n<p>\"Goodness, you scared me,\" says Hermione. \"Have you been there all this time?\"</p>\n<p>\"No,\" Harry says quickly. \"No, I just came out.\"</p>\n<p>Malfoy snorts. \"I'm sure.\"</p>\n<p>\"<i>Really</i>, Malfoy!\"</p>\n<p>\"Well,\" says Hermione, sniffing like someone who has just been crying and standing up. \"I'm freezing. I'm going to go inside now.\" She puts her cigarette out in a pile of snow, but does not leave it there, apparently prepared to take it inside and throw it out properly. \"But I'm very glad to have talked to you, Malfoy.\"</p>\n<p>\"Likewise,\" says Malfoy.</p>\n<p>Hermione reaches out and shakes Malfoy's free hand, then pats gently Harry on the shoulder and disappears inside.</p>\n<p>\"How long were you really there?\" says Malfoy.</p>\n<p>\"Just at the end,\" says Harry, plopping down next to him. The cold wet of the steps seeps instantly into his jeans, and he shivers with displeasure. \"Really.\" He reaches over, takes the half smoked cigarette out of Malfoy's hand, and takes a drag. Malfoy scowls, but lets him. \"Er,\" says Harry after a few drags, letting the slightly lightheaded feeling overtake him and passing the cigarette back to Malfoy. \"You all right, then?\"</p>\n<p>Malfoy snorts. \"Concerned about me, Potter?\"</p>\n<p>\"A little,\" Harry admits, because Malfoy looks so stiff still, so defensive and so small, and so attractive with a cigarette at his lips and snow falling in his hair. Harry allows himself a fleeting glance at Malfoy's lips and bites back a frustrated sigh.</p>\n<p>Malfoy snorts again. </p>\n<p>After a while, he admits, \"Yeah, I'm all right,\" and to Harry's surprise, he leans against him, bony shoulder against Harry's. Harry wants to lean back, or to put an arm around him, or something to actively comfort him, but he doesn't. Malfoy offers the cigarette to him again, and he takes another couple drags, watching the smoke curl attractively in the dark among the snow, before passing it back.</p>\n<p>\"Your mother wrote a letter to her sister,\" says Harry as Malfoy finishes the cigarette off. \"Did you know? Andromeda.\"</p>\n<p>\"Well, certainly not the other one,\" Malfoy says darkly.</p>\n<p>\"No, certainly not,\" Harry agrees.</p>\n<p>\"I didn't know she wrote her,\" says Malfoy. \"What did she say? Do you know?\"</p>\n<p>\"She said she misses you,\" says Harry, \"And she's frantic, not knowing how you are. She says – that you leaving helped her to see she was wrong about things. Something about – how she realised now that she's lost more than she's gained, thinking the way she did, and losing you was sort of – the limit.\"</p>\n<p>\"You're not serious,\" Malfoy says roughly.</p>\n<p>\"I am,\" says Harry.</p>\n<p>\"Well, she's stupid, isn't she?\" says Malfoy. \"Because she hasn't <i>lost</i> me. I would never – I couldn't abandon <i>her</i>, not forever.\"</p>\n<p>Harry looks over and sees that fierce, determined look on Malfoy's pointy features, and he allows himself to recognise, in that moment, how much he really, really does want him, how much he wants to back him up against the railing and tangle his fingers through that snow filled hair and kiss him. But he can't do that, so he says, \"I think it <i>was</i> brave of you to leave home. Maybe I had it wrong, about you running away.\"</p>\n<p>\"No,\" Malfoy sighs, putting the cigarette out in the snow. \"I ran away. I won't do my NEWTs because I'm running away. I know I could do them, but I'm scared of being a part of that world anymore.\"</p>\n<p>\"You don't have to be scared,\" says Harry. \"Hermione's right, you know – there is still time to be brave.\"</p>\n<p>\"Thanks for that, zombie boy,\" says Malfoy. He sighs. \"But I suppose there is.\" He buries the cigarette butt in the snow, intending to leave it there. \"And I suppose I'm going to have to write my mum.\"</p>\n<p>\"I think that's a really good idea,\" says Harry. </p>\n<p>\"I think going inside is a really good idea,\" says Malfoy. \"I've had enough of this serious business for tonight. And I'm freezing my arse off.\" He stands and grabs at himself. \"I literally cannot feel my arse. This is a tragedy.\"</p>\n<p>\"I can see how it would be,\" says Harry.</p>\n<p>\"Let's go and dance some more, even though you are probably the worst dancer I have ever had the misfortune of encountering.\"</p>\n<p>\"I <i>told </i>you I was,\" says Harry.</p>\n<p>\"I suppose you did,\" says Malfoy. He stares at Harry for a long moment, and it occurs to Harry that they are standing very close, here on the front stoop in the snow – close enough for Harry to notice the snow that has got in Malfoy's eyelashes, and for the wisps of their breath, visible in the cold, to mingle.</p>\n<p>\"The snow suits you,\" says Malfoy finally, voice low and different than Harry has ever heard it. </p>\n<p>And then he walks inside, leaving Harry bewildered on the steps.</p>\n<p>The night goes on. Ron seems to be getting on very well with Teresa and Caitlin – they are arguing over something television related that Harry has never heard of – and Hermione has taken a great liking to Abigail, chatting to her about university. Harry is hanging around with Malfoy and Sadie and Patrick, drinking more than is advisable and wondering if he really ought to take a break from all this alcohol consumption after the holidays. Although, drinking is making something odd happen tonight – the drunker Malfoy gets, the more tactile he gets, ruffling Harry's hair and dragging him places by the arm and hand and insisting he help Malfoy warm up, and by the time Sadie notices the snow outside, and how thick and fast it has begun to fall, Malfoy is lying against Harry, head on his shoulder, insisting that he is simply attempting to leach away all his warmth.</p>\n<p>Sadie gets very excited about the snow. She insists they all run out and play it in like children, and this causes a lot of arguing and debating and drunkenly scrambling for extra layers and general confusion, and before Harry knows it, everybody else has left the flat. Teresa is the last to go, calling, \"Hurry up, you pair of sloths!,\" and then the door shuts behind her, and neither Harry nor Malfoy have moved.</p>\n<p>\"Are we going outside?\" Harry asks.</p>\n<p>\"Mm,\" says Malfoy, fingers gently stroking Harry's wrist. It is a strange gesture, and it is making Harry's heart speed up far more than necessary. \"I've been outside, and I nearly lost my arse. I'm not prepared to do it again. There could be permanent damage already.\"</p>\n<p>\"I think your arse is fine, Malfoy.\"</p>\n<p>\"<i>Do</i> you?\" says Malfoy.</p>\n<p>\"Oh, shut up,\" says Harry. \"You're such a prat.\"</p>\n<p>\"You're the prat,\" says Malfoy. \"You are a big, ugly prat.\"</p>\n<p>\"Oh, thanks. And when I said that about your arse.\"</p>\n<p>Malfoy lifts his head and laughs delightedly, breath ghosting against Harry's cheek. \"I want to tell you a secret,\" he says, and his voice is so soft and so <i>sweet</i> against Harry's ear, and Harry never imagined he'd think a word like that about Malfoy. He feels the warmth of Malfoy all against him and his heart aches.</p>\n<p>\"What?\" says Harry, falling into a whisper for no good reason. \"What's the secret?\" </p>\n<p>\"You're not really ugly,\" says Malfoy, whispering, too.</p>\n<p>\"Oh, really?\"</p>\n<p>\"Oh, really,\" says Malfoy, still talking in Harry's ear. \"I think you're so fit.\"</p>\n<p>Harry thinks his heart might stop for a moment.</p>\n<p>\"What?\"</p>\n<p>\"I think you're so fit, Harry Potter. I meant that about the snow suiting you. You've got really lovely eyes.\"</p>\n<p>\"Oh,\" says Harry, heart kick starting again, pounding hard in his chest.</p>\n<p>\"Tell me a secret back,\" says Malfoy, fingers reaching out to, inexplicably, turn Harry's head towards him and touch his scar.</p>\n<p>Malfoy's fingers are touching him so gently, and he's smiling in his silly lopsided way, and he thinks Harry's fit with lovely eyes. Harry's drunk, and he wants him so much.</p>\n<p>\"I want you,\" he whispers.</p>\n<p>\"Oh,\" says Malfoy. His eyes flick to Harry's lips, and then back up to his eyes.</p>\n<p>In one swift movement, Harry tangles his hands in Malfoy's hair, presses him against the back of the couch, and kisses him. He shouldn't. It's too quick. He's taking one little hint and running with it, running too soon, like he always does, but Malfoy kisses him back with no hesitation, and Harry's heart has never felt quite so full before, excitement and anxiety and want spilling over the edges. Malfoy is kissing him back. Malfoy is gripping onto his waist, his arse. Harry wants to touch everywhere at once. His hands are in Malfoy's hair, on his shoulders, his chest, down to his waist – it all goes by so quickly, so surreally. Malfoy is making small, deep noises that Harry wants to hear more of, touching him back, kissing him like maybe he's wanted this, too, his mouth hot and wet and tasting of eggnog and cigarettes, his tongue in Harry's mouth.</p>\n<p>\"It's <i>fucking </i>freezing!\" somebody yells outside, and they startle and stop snogging.</p>\n<p>For a moment, Malfoy's eyes, pupils wide and dark with lust, are startled – and then a slow smile crosses his flushed face, a positively predatory look that Harry's never seen on Malfoy's, or perhaps anybody's, face before. \"Harry,\" he says for the first time without \"Potter\" after it, rolling it off his tongue, his fingers playing softly at the back of Harry's neck, and if Harry wasn't hard already, he'd be hard <i>now</i>.</p>\n<p>\"Draco,\" he pants out harshly, feeling like a big, dumb caveman of a person, certainly not as seductive as all that, but Malfoy doesn't seem to think so; he just bites his lip.</p>\n<p>\"Come to my room,\" he says. It's not a polite request, it's an order, and Harry's not surprised. He's also completely powerless to fight it.</p>\n<p>Malfoy locks the door behind him. It's not just his room; there are two beds crammed into the tiny space. Harry doesn't know who Malfoy shares a room with. He doesn't care right now. He's really not sober, and neither is Malfoy, but apparently that's not how they do things. Malfoy shoves Harry hard onto the bed that must be his, surprising him, but Harry loses any desire to protest when Malfoy instantly crawls over him and presses a hand between Harry's legs.</p>\n<p>Harry makes an embarrassing noise, something that catches in his throat.</p>\n<p>Malfoy laughs, but not maliciously. Harry looks at his face; he looks extremely pleased with himself and totally unconcerned, but his fingers, shaking as they trace Harry's erection through his jeans, give him away. \"You want me, Potter?\" Malfoy says, and Harry doesn't know if it's okay that this return to \"Potter\" only makes him feel more turned on.</p>\n<p>\"What does it look like?\" Harry says; Malfoy's nervous fingers make him feel bolder.</p>\n<p>\"Okay,\" Malfoy says simply, and he climbs back up Harry and kisses him again, tongue hot against Harry's, and – <i>fuck</i>, Harry bucks his hips reflexively, surprised, when Malfoy's come into contact with his and he's hard, too. Harry's erection is touching another erection, and it's through layers of clothing, but <i>fuck</i>. And it's <i>Draco Malfoy's</i> erection, which is a whole other world of weird and exciting.</p>\n<p>Harry remembers his fantasies about blokes, the way he imagined he'd kiss them, and touch their cocks, and wondered what it could be like to fuck them, and as Malfoy keeps kissing him and rolling his hips against Harry's, Harry can't believe he didn't imagine what it'd be like to touch his cock with somebody else's.</p>\n<p>And he's still marveling about this when Malfoy stops kissing him and whispers harshly against his lips, \"I want to suck you off, Harry Potter.\"</p>\n<p>Shit. Harry nearly comes right at that, but thank Merlin he doesn't, thank Merlin he manages to only say, \"Okay,\" because then Malfoy is down between his legs again, unbuttoning his trousers. Harry's mind is having trouble catching up with the images in front of him. Malfoy is between his legs. Malfoy is unzipping his jeans. Malfoy wants to suck him off.</p>\n<p>There are voices outside in the living room. They ignore them.</p>\n<p>Malfoy pulls Harry's jeans and underwear down just enough to get them out of the way, Harry eagerly pushing up his hips to help – but then, when Malfoy looks between Harry's legs, for a wild moment Harry wants to cover himself. Draco Malfoy is looking at his cock – his hard cock, for that matter. He's never done anything like this with a man, who also has a cock, and for some reason this seems to matter, and for some reason he feels embarrassed. And then Malfoy smirks like the cat who ate the canary, and wraps his long fingers around the base of Harry's erection, and starts stroking, and Harry loses his embarrassment just as instantly as it turned up. With all the other things he's feeling, there doesn't seem to be room for it.</p>\n<p>\"I'm going to tell you another secret,\" says Malfoy, not taking his eyes off Harry's cock as it pushes through his fist. His tongue darts out to lick his bottom lip, unconsciously, Harry's sure, and Harry didn't think he could get harder, but apparently he can.</p>\n<p>\"What's the secret?\" says Harry breathlessly, staring and staring at Malfoy's long fingers wrapped around him. He never imagined he'd really get to see those fingers touching him like this. He never imagined Malfoy would want him back.</p>\n<p>\"I <i>really</i> want to suck you off,\" says Malfoy. His thumb brushes over the head, and Harry's breath catches. \"Like, I keep thinking about it.\"</p>\n<p>\"You keep thinking about it,\" says Harry, \"Now? Tonight?\"</p>\n<p>\"No,\" Malfoy says. His eyes finally flick back to Harry's face, nearly black now with lust. \"For a long time. I love doing this. I wanted to do it to you.\"</p>\n<p>\"Oh,\" says Harry, and Malfoy ducks his head and takes Harry's cock into his mouth.</p>\n<p>Harry does not know what he imagined Malfoy would be like, sucking cock, because every time he realised he was fantasising about Malfoy, he'd feel guilty and try to reel it in, think of someone faceless instead. Only one other person has ever sucked him off, and Ginny wasn't bad at it – in fact, she approached the whole thing with a great deal of enthusiasm – but Malfoy is really <i>good</i> at it, like he really knows what he's doing, and like he really does love doing this, and there's absolutely no way Harry is going to last very long. Harry watches, wide eyed, as Malfoy takes him practically all the way into his mouth like it's nothing, down his throat over and over again, his eyes fluttering closed as though he's enjoying the whole thing immensely, and he's not the one getting his cock sucked. Harry's given up hope with regard to not making embarrassing noises, because there's no way he can bite back his groans with Malfoy attacking him like this, and besides, there's no way to get rid of the wet noises of Malfoy's throat working, and nothing is going to be more ridiculous, and yet incredibly, weirdly hot, than that. Harry is more aware than ever of people being outside – people including <i>Ron and Hermione</i> – and at least tries to keep his moans little, quiet ones. </p>\n<p>Harry threads his fingers through Malfoy's hair, and Malfoy opens his eyes and looks directly into Harry's, mischievous, tremendously impressed with himself like he always fucking is, his mouth stretched over Harry's cock, and Harry comes, abrupt and hard, fingers scrambling for purchase in Malfoy's hair. He manages to hold back any noise but a quick, very stupid sort of grunt as Malfoy swallows his release, but he hopes the upside of this is that nobody in the flat heard him. He also hopes he did not pull too hard at Malfoy's hair.</p>\n<p>When Harry has finished coming, and feels like the room might spinning from the combination of alcohol and orgasm, Malfoy sits up between his legs, hair rumpled beyond repair and lips red and wet and smug, and Harry only just manages to avoid staring at him open mouthed.</p>\n<p>Somebody in the living room laughs. Malfoy turns to look at the door, frowning slightly, and it hits Harry what has just happened. Malfoy has just sucked him off. <i>Malfoy</i>. Malfoy who sings along to the radio while he makes lattes, Malfoy who reads Harry's Daily Prophets at lunch, Malfoy who mocks him for every move he makes – mad, rude, stubborn, silly Malfoy, Malfoy for whose Harry's feelings have become so hopelessly tender. Malfoy has just sucked him off, and has wanted to for a long time.</p>\n<p>\"Draco,\" says Harry, trying it out again, and Malfoy whips back around to stare at him. \"Draco,\" Harry repeats, and he sits up and kisses him, cupping his sharp face, exploding with jubilation, not even caring that he's tasting his own come in Malfoy's mouth and it's a little bit weird. He kisses Malfoy and Malfoy kisses him back, and when Harry presses Malfoy onto his back onto the bed, he realises he is trembling and feels stupid until he remembers Malfoy's shaking hands on his jeans, and until he remembers that Malfoy wants him back, like he never expected to happen, and nothing else matters. </p>\n<p>Harry has never touched another bloke before, but he takes Malfoy's cock into his hand with excited interest, working out the difference in the angle, figuring out what Malfoy likes. He doesn't know whether to look at Malfoy's flushed cock pushing in and out of his fist, or Malfoy's flushed face as he sighs and bites his lip. When Harry meets his eyes, Malfoy smiles, genuinely, with no mischief this time, just unguarded happiness, and Harry is overwhelmed.</p>\n<p>Harry considers trying to suck Malfoy off, feeling bold and ready to do anything for Malfoy and his smile, Malfoy who wants him back, but Malfoy sighs, \"Fuck, Harry,\" throws back his head, and comes over Harry's hand before he can. Harry works him through his orgasm and marvels at his name sounding like that coming out of Malfoy's mouth.</p>\n<p>\"I meant to suck you off,\" says Harry, examining his sticky hand.</p>\n<p>Malfoy laughs. \"That's okay,\" he says, apparently unable to come up with any sort of disparaging response, possibly for the first time in their history, and Harry is so happy it hurts his chest. </p>\n<p>He performs a quick wandless cleaning charm, to Malfoy's apparent delight, and, overcome by this joy on Malfoy's face, crawls up next to him and kisses him again, softly, like he hasn't kissed anybody since Ginny. \"Draco,\" he whispers.</p>\n<p>\"Harry,\" Malfoy laughs, reaching up to run a hand through Harry's hair, which Harry's sure must be an utter wreck if Malfoy's is so rumpled. </p>\n<p>\"You're marvelous,\" Harry says, stealing Malfoy's word, and Malfoy laughs again.</p>\n<p>\"Of course I am,\" he says. </p>\n<p>There is absolutely no way to avoid post party sex embarrassment, not when Harry is meant to be responsible for Ron and Hermione in this strange environment. They attempt to fix their dishevelment as much as possible – after a long while of leisurely kissing, because Harry is amazed they're suddenly allowed to do so – but it is painfully obvious what they've been doing alone in Malfoy's bedroom. Harry wants to stay there all night, wants to sleep with Malfoy soft and close to him again, but there's Ron and Hermione, and there's Teresa, the person who shares this room with Malfoy, and it's probably best that he goes home. </p>\n<p>Everyone politely refrains from commenting when Harry and Malfoy slink out of the bedroom pretending they're invisible, but Harry can tell Malfoy's friends are pleased, and even Ron and Hermione smile in the face of Harry's delight, making Harry even happier. It's a little strange, to have this post-coital audience, even if they're not saying anything, and this is what Harry decides must be responsible for the slight uneasiness in Malfoy's posture. But Harry's too elated to care too much, and when he, Ron, and Hermione leave the party, Harry cannot stop himself from pulling Malfoy close and kissing him on the mouth, several times, to cheers and whistles. </p>\n<p>\"I told you,\" Ron says as they make their way to the tube, Ron and Hermione holding hands and Harry feeling like he might actually be walking on air. He's still unable to wipe the grin off his face. \"Didn't I?\"</p>\n<p>\"Yeah, you did,\" says Harry, laughing. \"Cheers, Ron.\"</p>\n<p>\"Well,\" says Hermione, cautious. \"I'm glad you're happy.\" She looks bothered about something.</p>\n<p>\"Are you upset?\" says Harry. </p>\n<p>\"No,\" says Hermione. \"I really am glad you're happy, Harry.\" He still thinks she looks uneasy, but he knows, thinking of her conversation with Malfoy earlier tonight, that things will be okay. He remembers Malfoy's genuine smile, his gentle kisses, the way he looked after sucking Harry off. Malfoy wants him back. <i>Draco</i> wants him back. Everything's going to be okay.</p>\n<p></p>\n<p>***</p>\n<p>When Harry gets to the coffee shop, Malfoy is looking especially pale and discontent behind the till, and Harry sympathises with him, having to get up for work this morning. When Malfoy looks up and sees him, his eyes widen, and he looks back down at the till, agitated. It's a strange reaction, but Harry barely registers it, too pleased and warmed at seeing him. \"Hello,\" he says, approaching the counter, because there's nobody in line. He wishes he could lean right over the counter and kiss him, because he's allowed now, but he doesn't do it. It wouldn't be very professional of Malfoy.</p>\n<p>\"Hello,\" Malfoy says, not meeting his eyes.</p>\n<p>\"I thought you might need – \" Harry lowers his voice and pulls the flask covertly out of his bag. \"Some hangover stuff, maybe.\" </p>\n<p>\"Oh,\" says Malfoy. He blinks. \"Yes, that would be nice.\" He takes it from Harry's hands and stares at it for a few moments. \"Thank you,\" he says, and downs it quickly, sighing with relief when he's through. \"I drank about a million glasses of water, I think, but there's nothing like this. And that was a mistake, now I need the toilet about a million times an hour.\" </p>\n<p>Harry laughs, and Malfoy flashes him a brief smile, then looks away. \"I'll make you your coffee,\" he says.</p>\n<p>Harry doesn't get to actually speak to Malfoy until his lunch break, and he spends the whole morning jittery with excitement, thanks to too much coffee and watching Malfoy behind the till and thinking, <i>he wants me, I can kiss him</i> and feeling like his heart is going to burst.</p>\n<p>When Malfoy walks out from behind the counter, Harry scrambles up instantly, and they leave the shop with Caitlin smiling after them and Harry humming with happy, nervous energy. \"Where do you want to go?\" Harry asks, knocking their shoulders together, unable to resist touching him in some way.</p>\n<p>Malfoy hugs himself, looks at his feet, and says, \"Do you want to get something and eat in the park?\"</p>\n<p>This is strange. It's very cold out, the streets wet with snow and slush, and lately, Malfoy has wanted to run into the nearest warm place. He looks up and smiles, but it's not like that genuine smile from last night; it's strained, and his eyes are uneasy, and for the first time, anxiety wraps itself around Harry's heart.</p>\n<p>He doesn't know what else to do but agree, and he doesn't know why Malfoy should be uneasy. All the park benches are damp, frigid, and Harry doesn't understand why they're here, why they haven't kissed, until, after a while of eating sandwiches in relative silence, Malfoy says, \"Harry, look.\"</p>\n<p>Last night, the use of his first name filled Harry with joy; today, it feels ominous. </p>\n<p>\"What's the matter?\" says Harry, heart sinking. He starts to suspect that they are here because Malfoy did not want to have this conversation in a restaurant or café, with people close by and free to listen in.</p>\n<p>Malfoy plays with the napkin in his lap, avoiding Harry's eyes. \"We shouldn't have done what we did,\" he blurts out. </p>\n<p>Harry stares, refusing to absorb those words. </p>\n<p>\"I'm sorry,\" Malfoy adds helplessly.</p>\n<p>\"What do you mean?\" says Harry. \"Why not?\"</p>\n<p>\"We were drunk,\" says Malfoy. \"I wouldn't have if I wasn't drunk. I'm sorry that I did it.\"</p>\n<p>The lightweight sensation Harry's been experiencing since last night inverts very quickly; now he feels as though something heavy is pressing down on his chest. \"You're sorry that you did it,\" he repeats, and his voice doesn't even sound like his own.</p>\n<p>\"I mean, I'm sorry,\" says Malfoy. \"Look. Harry.\" His first name again. It sounds like pity, and Harry suddenly feels so angry he is past yelling, so angry that he might cry, and that <i>is</i> pathetic. No, no, no, Malfoy is supposed to roll his eyes at him and call him a freak because he knows he can take it. Malfoy is not supposed to sound like this. He's not supposed to look at him like this and say, \"We're friends.\"</p>\n<p>\"Right,\" says Harry, in that same hollow voice. His hands are shaking. He cannot explode at Malfoy like he did at Ginny. He won't. He definitely won't cry.</p>\n<p>\"I just mean,\" says Malfoy, looking away, \"We're friends. You can't – if you're going to experiment, it can't be with me.\"</p>\n<p>\"To – experiment?\" Harry repeats, the vulnerability worming its way into Malfoy's voice prodding at him painfully.</p>\n<p>\"Yes,\" says Malfoy. \"If you want to – if you think you might – want to fuck blokes, too, then, you know, welcome to the club, that's great and all, but you can't just try it on with me because I'm the only gay man you know. That – that's the kind of shit that ruins people's friendships, okay, just – please don't do this to me.\" He clears his throat. \"Well, we already did it, but – we can fix it, probably, we just can't – do it again.\"</p>\n<p>Harry stares at Malfoy, sitting there stiffly on the park bench and hugging his jacket closely to himself with his gloved hands, shivering in the face of a sudden harsh winter wind. His hair blows up from his face, getting all messed up, surely to his displeasure, but he doesn't seem to notice. He does not look at Harry. It is possible he looks the most vulnerable he's looked to Harry since Harry walked into that bathroom and saw him crying, even with everything that has happened since then.</p>\n<p>\"The kind of shit that – Malfoy, no,\" says Harry. \"No, I – you've got it wrong.\" He almost laughs with relief. \"I don't need to <i>experiment </i>with anything. I know. I'm bisexual, or whatever – I like whatever. I like you. I'm not experimenting.\"</p>\n<p>Malfoy turns to look at him, still shivering and clutching his jacket, his expression hunted, defensive. \"Caitlin and Abigail said you were adamant you weren't gay,\" he says. \"Only recently.\"</p>\n<p>Harry wonders when they reported this, and in what context, but he doesn't ask. \"I was being stupid,\" he says. \"I knew even then I'm attracted to blokes. You, particularly.\"</p>\n<p>\"Why did you never tell me?\" says Malfoy. </p>\n<p>\"About – you?\"</p>\n<p>\"About how you're <i>queer</i>, Potter,\" he says impatiently. \"I mean, I don't know, it was something we had in common, wasn't it? And I kept calling you straight all the time. Surely you might've mentioned it. And when we talked about Patrick – \" He falters. \"That's when you realised, isn't it?\" he says, eyes alight with realisation. \"That's why you ran off? You couldn't work it out for yourself. You needed somebody to tell you. Jesus, Potter.\"</p>\n<p>\"Yes, thank you for pointing out, yet again, how stupid I am,\" says Harry, bristling. \"I feel like an idiot about it already, thanks. Some people don't realise 'til they've been married for years, though, you know. It doesn't matter. The point is, I'm – whatever I am, and I'm attracted to you, and I know it.\"</p>\n<p>\"Well,\" says Malfoy. He looks away again, rubbing his arms, presumably in the hope that this will warm him up a bit.</p>\n<p>\"Malfoy,\" says Harry. He swallows. \"Draco,\" he tries softly, and Malfoy stiffens further. \"How do you feel about me?\"</p>\n<p>Malfoy doesn't answer.</p>\n<p>\"Just tell me the truth,\" says Harry. \"Please. I can't – deal with people lying to me anymore, okay?\"</p>\n<p>\"I'm,\" says Malfoy. He still doesn't look up. \"Attracted to you,\" he says quietly.</p>\n<p>Harry suddenly remembers Malfoy's recent strange behavior, the way he avoided him and acted like that Malfoy who is afraid of being disliked or embarrassed. Harry inches a little bit closer on the bench. \"Is that a problem?\" he asks.</p>\n<p>Instead of answering the question, Malfoy asks, \"How long?\"</p>\n<p>\"What?\"</p>\n<p>\"How long have you – been attracted to me?\"</p>\n<p>Harry reflects. \"A while, I think,\" he says. \"Possibly since I first saw you working at the coffee shop.\"</p>\n<p>Malfoy snorts, letting out a white cloud of a breath. \"That's not a while,\" he says.</p>\n<p>\"Er, okay,\" says Harry. \"So what's 'a while,' then?\"</p>\n<p>Malfoy seems to sink down into his jacket a bit, sliding down the bench and pulling his collar up to shield his neck better from the wind. He mumbles something.</p>\n<p>\"What?\" says Harry.</p>\n<p>\"Since fifth year is a while,\" Malfoy snaps.</p>\n<p>\"Oh,\" says Harry. He can't help it; the exhilaration his heart pumps through him at this admission pulls his mouth into a grin so wide he thinks he might split his face open. He's so happy he accidentally laughs, which he knows is a mistake the moment it's out.</p>\n<p>\"Don't laugh at me!\" Malfoy snaps, sitting up impossibly straighter and whipping around to glare at him. \"You think laughing at me is going to get me back into bed, Potter?\"</p>\n<p>\"I'm not laughing <i>at</i> you,\" Harry says quickly. \"I'm just – \"</p>\n<p>\"If this is a joke to you,\" says Malfoy, \"Then you can forget it.\"</p>\n<p>It occurs to Harry at this admission, at the wounded look in Malfoy's eyes, at the way he continues to shiver in that hunted posture, that – this is serious to Malfoy. This is serious to him, as well. Harry is overwhelmed with soft affection again, and he can't help but reach over and put a hand on Malfoy's knee. He wants to do more, but he also wants to avoid being punched in the face.</p>\n<p>\"Don't touch me, Potter,\" says Malfoy, but it comes out weakly.</p>\n<p>\"It's not a joke,\" says Harry. \"I really – I'm thinking of you all the time. I don't just want to – to get you back into bed, either. It's not a joke to me. It's serious.\"</p>\n<p>\"I can't believe you,\" says Malfoy, staring at the hand on his knee and sounding a bit hysterical.</p>\n<p>\"What do you mean?\" says Harry.</p>\n<p>\"It's <i>serious</i>,\" says Malfoy.</p>\n<p>\"Yes,\" says Harry. </p>\n<p>\"It's ridiculous, actually,\" says Malfoy, and Harry recognises by the note of hysteria in his voice that he is about to be treated to a Draco Malfoy tangent. \"It is completely ridiculous. We <i>hated</i> each other. I am the <i>worst</i> match for you, probably on the <i>planet</i>, and you're <i>serious</i> about me. You want me – out of anyone. You're clearly an idiot. I don't know what – \"</p>\n<p>\"You're talking out of your arse, Draco Malfoy,\" says Harry, and kisses him.</p>\n<p>Harry is flooded with gleeful relief when Malfoy kisses him back, right here on this park bench in muggle London, where anybody stupid enough to be out in this frigid weather could see them. </p>\n<p>\"It should be very distressing to you, Harry Potter,\" Malfoy murmurs against his lips, as Harry strokes his hair, the back of his neck, \"That the things that come out of my arse are at least fifty times more intelligent than the things that come out of your mouth.\"</p>\n<p>Harry laughs. \"You are brilliant,\" he says, kissing him again, and Malfoy seems to give up on any kind of response, content to be kissed and brilliant.</p>\n<p>They spend far too much time kissing and laughing delightedly on this bench, so much that Malfoy is late returning to work, but Caitlin doesn't seem to mind when they return, cold and disheveled and holding hands, something Harry did not expect Malfoy to agree to. He did call Harry a sentimental undead freak again when Harry grabbed his hand, but he did not let go, and suddenly the familiar streets and the coffee shop awning and the regulars tucked into the tables and window seats with their laptops all look very different, somehow.</p>\n<p></p>\n<p>\n<b>New Year's Eve</b>\n</p>\n<p>\"Christmas has passed, Draco,\" says Teresa. \"This is the universal sign for the end of Christmas music.\"</p>\n<p>Malfoy pays her no mind, continuing his off key rendition of <i>All I Want For Christmas Is You</i> with gusto as he pours champagne for everyone. He and his friends are having a New Year's party. This time it's just the six of them, and they have asked Harry to invite all his closest friends; Harry is touched by this, and when he said as much the other day, Sadie said, \"We loved Ron and Hermione! They're lovely, aren't they? And now you're Draco's boyfriend, of course we've got to include your mates and be a big happy family.\"</p>\n<p>\"You disgust me,\" Malfoy told her, but did not dispute her saying the word \"boyfriend,\" though he and Harry have not actually said it yet.</p>\n<p>Harry doesn't mind if they have a word for it. He has spent nearly every night with Malfoy since the Christmas party, getting to touch him wherever and whenever he wants, and learning all about the merits of sex with blokes, and knowing when Malfoy kisses him that he's serious about it, and he's not going to kiss anybody else. Malfoy is a ridiculous person, but when he smiles at Harry at certain moments, it's a serious, genuine smile, a real, meaningful softening of his eyes, and Harry is so pleased and excited about him it almost hurts. Sometimes he remembers that this is <i>Draco Malfoy</i>, and he wonders what his Hogwarts self would say, but – he's not his Hogwarts self anymore. And that's alright, actually.</p>\n<p>After much deliberation with Malfoy, Ron, and Hermione, Harry has asked Ginny, Neville, Dean, and Luna to come with he, Ron, and Hermione to the party, and they have all, to Harry's admitted surprise, turned up. Everyone is dressed up and looking lovely and grown up and actually not as awkward as they could be, given the circumstances; Malfoy's friends are not too difficult to get on with, really, and Malfoy is behaving himself. Well, mostly. </p>\n<p>\"I just want you for my own,\" Malfoy keeps singing.</p>\n<p>\"More than you could ever know,\" Dean slips in, surprising everyone and delighting Malfoy.</p>\n<p>\"Make my wish come true!\" sing Malfoy, Dean, and now Caitlin.</p>\n<p>\"All I want for Christmas is you!\" Now Luna, Sadie, and Patrick have joined in. Harry has felt a lot more forgiving toward Patrick lately, now he's seeing Malfoy and Patrick is most definitely not. He knows it was stupid not to like Patrick in the first place, especially as he watches him spin Sadie around happily. Well, it was mostly stupid, he amends as he remembers how shocked Patrick is whenever Malfoy continues to creatively insult the person who is meant to be his boyfriend now, or whatever he is. Harry likes the way Malfoy speaks to him. He doesn't understand people who are never, ever angry, or never, ever mean, and he hates people who walk on eggshells around him, just as much as Malfoy does.</p>\n<p>Before long, everyone is singing, even Ron, even Teresa, even Harry. Harry has no idea how Ron and Ginny know this song, but they are as enthusiastic as everyone else as they reach their big, extremely pitchy finale. Caitlin, who actually has a decent voice, looks deeply pained. Malfoy cackles happily and leans close to Harry, running fingers absently through his hair. Harry knows this must be weird for his friends, but they don't say anything, and he is supremely grateful to them and imagines that, though Malfoy still has some apologising and proving himself to do, and Harry probably does, too, things really <i>are</i> going to be okay. </p>\n<p>Malfoy shocked everyone by deciding Christmas Eve morning that he was going home for Christmas. He didn't go into a lot of detail about what happened, but he says things \"might be a little better\" with his parents now, though he's not planning on quitting or moving any time soon, and he admits to Harry that it was \"really marvelous\" to see his mum. </p>\n<p>\"Besides,\" he admitted, in a small voice he uses that always alerts Harry to the private nature of what he's saying, to the fact that Harry had better not ever repeat it, \"I've never had Christmas without my parents, except at the Yule Ball – and during the war we didn't really have Christmas, I suppose. The Yule Ball, though – that was a terrible evening. I wanted to go home. I really missed my parents. Also, I tried to snog Pansy and was forced to admit I was too gay for that.\"</p>\n<p>The evening goes well, with only a little bit of awkwardness, and by midnight everyone is cheery drunk and very excited to yell, \"Happy New Year!\" Both Sadie and Hermione get emotional; Hermione embraces all her friends and, to everyone's surprise, Malfoy, and Sadie starts kissing people. She kisses Harry on the cheek about eight times, going on about how happy she is for him and Malfoy, before Malfoy finally says, \"Will you back off?,\" narrowing his eyes, and Harry knows Malfoy's partly joking, but he's secretly quite pleased. </p>\n<p>When Malfoy goes outside to have a smoke with Sadie and Caitlin, Ginny manages to get Harry alone in the kitchen and says, \"I don't know that I understand it yet. Why him, I mean.\" She shrugs her lightly freckled shoulders, exposed in the lovely purple dress she's chosen to wear, and says, \"But as Ron insists upon pointing out to me on a nearly constant loop, he's not <i>my</i> boyfriend, so – I suppose I don't have to understand it. And maybe one day I will. The point is – you look happy, and I'm glad. I'm happy for you.\"</p>\n<p>\"Thanks,\" says Harry, embracing her. \"I'm glad you're happy, too.\" He has gotten used to the smell of her new perfume, and he likes it – but not like he likes the smell of vanilla and coffee and even the cigarette smoke that seems to permeate Malfoy's clothes, just because it's him. </p>\n<p>\"Potter, where'd you go?\" Malfoy's voice calls suddenly from the living room.</p>\n<p>Neville says, \"Are you ever going to call each other by your first names?\"</p>\n<p>\"No,\" says Malfoy. </p>\n<p>Malfoy comes back to Harry's flat when the party's over, because Harry having a bedroom to himself makes it the best place to go, and it almost doesn't feel weird at all, walking into the flat chatting to Ron and Hermione with Malfoy holding onto his hand, and fucking Malfoy even though he knows Ron and Hermione are in the same flat – he reckons Ron and Hermione do it all the time, and if they lived through school dormitories, they can live through this. </p>\n<p>Malfoy is as snarky and ridiculous in bed as he is any other time; he teases Harry and eggs him on, and Harry likes it. He gets a great deal of satisfaction out of responding to, \"Is that the best you can do?\" by fucking Malfoy into the mattress so hard that he ends up swearing at length and with great gusto; the silencing charm might be Harry's absolute favourite charm.</p>\n<p>When they are lying together afterwards, Malfoy stroking his fingers along Harry's scar again, tracing it back and forth like he seems to like to do, Malfoy says, fighting back a yawn, \"Happy New Year.\"</p>\n<p>\"Happy 2001,\" says Harry, watching Malfoy lose his battle and yawn widely. Malfoy removes his hand from Harry's face, and Harry slides an arm around Malfoy's bare waist, feeling thoroughly optimistic for the first time in a long while. </p>\n<p>\"What are you going to do this year, Harry Potter?\" asks Malfoy, running a hand along the arm around his waist.</p>\n<p>\"Well,\" says Harry. \"I've been thinking – \"</p>\n<p>\"There's a first.\"</p>\n<p>\"How original. I think I want to teach,\" says Harry. </p>\n<p>\"Really?\" says Malfoy.</p>\n<p>\"Really,\" says Harry. \"I don't know if I want to do Hogwarts or primary school, though.\"</p>\n<p>\"Primary school?\" Malfoy wrinkles his nose. \"Who wants to deal with brats all day?\"</p>\n<p>\"Well, I deal with you all day, don't I?\"</p>\n<p>\"You are <i>hilarious</i>,\" says Malfoy scathingly.</p>\n<p>\"Either way,\" says Harry, kissing him quickly, impulsively, because he can. \"I need to get my NEWTs to teach. And I was thinking – we should both do them.\"</p>\n<p>Malfoy sighs and closes his eyes, presumably to avoid eye contact.</p>\n<p>\"You're so brilliant,\" says Harry. \"You can't just never – \"</p>\n<p>\"That's got nothing to do with it,\" says Malfoy. \"But if you must know, I've been thinking I should do them.\"</p>\n<p>\"Really?\" says Harry, beaming and pulling him closer. </p>\n<p>\"Really,\" Malfoy says, opening his eyes again and rolling them. \"I think – it would give me options. I don't know what I want yet. I love my friends here. But I also love magic, and my mother, and I could make so much more in a magical profession, because I'm trained for that, and – also there's you.\"</p>\n<p>Harry gives him a slower, lingering kiss. \"I don't see why you can't have all those things,\" he says. </p>\n<p>\"Well, you wouldn't, would you, optimist,\" says Malfoy, like it's an insult. </p>\n<p>\"I think you can do anything you want, Draco Malfoy.\"</p>\n<p>\"Shut up, Harry Potter.\"</p>\n<p>\"Make me.\"</p>\n<p>Malfoy smirks and rolls on top of him, straddling him, and Harry beams, heart full. \"Oh,\" Malfoy laughs. \"I will.\"</p>"
}