{
  "id": "6427408",
  "url": "https://archiveofourown.org/works/6427408?view_full_work=true",
  "author": [
    "astolat"
  ],
  "title": "Unseen",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter"
  ],
  "characters": [
    "Harry Potter",
    "Draco Malfoy",
    "Ron Weasley",
    "Hermione Granger"
  ],
  "additional_tags": [
    "Invisibility Cloak",
    "First Time",
    "EWE",
    "Post-War"
  ],
  "language": "English",
  "series": "Part 4 of Harry Potter works",
  "published": "2016-04-01",
  "completed": null,
  "words": "10,885",
  "chapters": "1/1",
  "comments": "289",
  "kudos": "19,509",
  "bookmarks": "3,136",
  "hits": "193,330",
  "summary": "<p>When he wasn’t wearing it, he got jumpy, always waiting for someone to come at him wanting something—and now they did it even more urgently, if they ever saw him, because most of the time, nobody did.</p>",
  "notes": "<p>This is inspired by <a href=\"https://alekina.tumblr.com\" rel=\"nofollow\">Alekina's</a> beautiful <a href=\"https://alekina.tumblr.com/post/140686506565/astolat-alekina-i-see-old-habits-die-hard\" rel=\"nofollow\">Harry/Draco piece with the Invisibility Cloak</a>!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Many many thanks to Cesperanza and lim! All feedback loved. If you like, <a href=\"https://astolat.tumblr.com/post/142081953093/unseen-10885-words-by-astolat-chapters-11\" rel=\"nofollow\">reblog!</a></p>",
  "text": "<p>Harry started wearing the cloak in desperation at first. He thought a couple of weeks after the war would’ve done it, and the press did back off a little, but that was when ordinary people started pushing in. They waylaid him on the way to the Department of Aurors, they came up to him in shops, they stood outside in the street on Grimmauld Place and waited for him to come out. He didn’t know what they even <em>wanted</em> from him. Half of them only told him thanks and shook his hand, but some of those kept coming back every so often, as if they needed another dose. Others wanted photographs of him and didn’t ask before taking them, flashbulb lights going off in his face, and others wanted to show him photos of other people that Voldemort and the Death Eaters had killed, and others wanted to tell him all about what they’d done to help, which generally didn’t seem to be a lot, when you actually let them get down to it, and they’d talk longer and longer the less they’d done.</p>\n<p>Sometimes a whole pack of them started pushing in on him and he had to shove through and literally run, and once in a while they <em>chased</em> him. He couldn’t even Apparate to get away, it was impossible to focus on where you were going when there were five people all clamoring at you loudly and trying to grab you, and the one time he tried taking the Floo, somehow a man grabbed him <em>in the Floo</em> and jerked him out into the dressing room at Madame Malkin’s two streets down, much to the dismay of all concerned except his beaming captor, who seemed as pleased as if he’d just hooked an enormous fish.</p>\n<p>Finally, one morning looking out his window at the milling crowd outside, Harry looked at the coatrack, swung on the cloak, and just slipped easily past all of them. He got to the office in a leisurely and blessedly uninterrupted walk, and he got to his desk and took off the cloak and stroked it gratefully after he put it away in the drawer.</p>\n<p>He wore it more and more after that. He’d already been avoiding shops, sending Kreacher out for things instead, and restaurants had been given up entirely. People mostly left him alone when he was working, as if that were all right, he was allowed to be doing things for the public, just not left to his own devices, but after he’d spent a few weeks successfully avoiding the hunters, some of them <em>did</em> start showing up outside the department.</p>\n<p>“Here, that’s enough from you,” Ron said sharply, holding one of them off as he tried to press an autograph book into Harry’s face. “Wasting Auror time is a criminal offense, you know!” but Harry couldn’t arrest people just for wanting his autograph, so he started slinging the cloak on to go out on assignment, until he got to wherever they were headed.</p>\n<p>He kept it with him all the time, after that, and started wearing it more often than not—he’d forget he had it on, and if he was doing a shift at one of the desks, people would come by and then go away again without asking him to do anything and he’d belatedly realize they hadn’t been able to see him. He tried using it to go out to lunch with the others, which seemed like a good solution at first, but sometimes they’d forget he was <em>there</em>, and then he’d say something and they’d all jump, and they started to get a bit uncomfortable round him after. “Sorry, Harry,” Ron said apologetically. “It’s just—it’s a bit creepy, isn’t it? If we don’t know if you’re there or not—you might be there <em>all the time</em>,” and Harry knew he only made it worse by forgetting in training sessions, or out in the field, and then there was the horrible day when he forgot while he was down in the records vault, and one of the older Aurors, one of their <em>instructors</em>, came in and started preying on the clerk, a pureblood girl a few years older than Harry, whose extended family had produced two Death Eaters and who did her work efficiently and kept her head down and never talked to any of them.</p>\n<p>Harry didn’t notice at first, trying to figure out whether his case file ought to go under the name of the primary victim or under the responsible creature, and then he decided to ask the clerk’s advice and looked up and Gorthley had gone round her desk and was putting a hand on the back of her neck and nuzzling at her, and she was cringing away in obvious horror, saying in a voice barely above a whisper, “Please don’t, just—stop, please, I—”</p>\n<p>“What are you <em>doing?</em>” Harry said, appalled, and Gorthley jerked up and looked around wildly, and that was when Harry realized he was <em>invisible</em>, and he jerked off the cloak and Gorthley’s face went a sickly pale white.</p>\n<p>And Harry was glad he’d been wearing it, he <em>had</em> to be, because they kicked Gorthley out on his unswerving testimony even though the girl refused to so much as admit he’d done anything—“I won’t!” she told Harry flatly when he tried to tell her he’d support her story. Her face was hard and proud. “My family wouldn’t let me keep coming if I admitted to them anything like it had happened, and we need the money, my father lost his job and my brothers can’t get hired anywhere.”—but after that—after that, everyone looked at him askance, even the ones who were just as disgusted by Gorthley’s behavior as he was.</p>\n<p>He tried to remember to take it off more often, but it was more than a habit by then: it was a <em>comfortable</em> habit. He relaxed when he put the cloak on, and when he wasn’t wearing it, <em>he</em> got jumpy, always waiting for someone to come at him wanting something—and now they did it even more urgently, if they ever saw him, because most of the time, nobody did.</p>\n<p>#</p>\n<p>All that first year, they were hunting the remnants of Voldemort’s army. Only about half of the Death Eaters had actually been at the Battle of Hogwarts, loads of others had fled their Ministry positions and strongholds after the loss, hidden themselves away. Of course, for every one of them who’d actually escaped, the Aurors got a hundred false reports, people either excited or paranoid—or one memorable time, wanting to <em>meet Harry</em>. They <em>did</em> arrest that particular celebrity-hunter, and fined him a thousand Galleons, which Harry hated but Shacklebolt insisted had to be done to prevent others from doing the same thing.</p>\n<p>And sometimes, the false reports were meant to harass another wizard. They got a report of Dark activity at Malfoy Manor every other day, generally from people who clearly had never so much as been inside the gates and couldn’t have seen the things they reported. Most of the reports got binned, but every once in a while something remotely credible showed up. Harry tried to avoid those cases—he didn’t really want to go back to the Manor, and he didn’t really want to see Draco or Lucius or Narcissa again. He’d testified at their joint trial on their behalf, of all things—he’d told everyone that Narcissa had lied for him to Voldemort, that Draco had refused to identify him and had tried to stop Crabbe killing him. And by then everyone knew that Harry had beaten Voldemort with Draco’s wand, which the solicitor brilliantly suggested that Draco had <em>let</em> Harry take from him, so Harry could escape.</p>\n<p>The solicitor hadn’t put Draco on the stand, he’d just spun out the narrative in his beautifully delivered closing speech: a wizard who at sixteen had disarmed the great Dumbledore had simply <em>lost</em> his wand, to an unarmed wizard who had just been subjected to torture, and while standing on the grounds of his own house? Surely it stretched the bounds of credulity—and Harry hadn’t been able to say that the story wasn’t true, even though the prosecutor and Ron and Hermione and everyone had wanted him to. He couldn’t remember anything but desperation and panic and fury, grabbing the wand out of Draco’s hand because he <em>had</em> to, but—his face had still been swollen up, he’d barely been able to see. It probably <em>should’ve</em> been harder. He didn’t know about Draco doing it on purpose, but—he wasn’t going to say for certain that Draco hadn’t, not to make better odds of sending him to Azkaban.</p>\n<p>But he certainly hadn’t any desire to see Draco again. There were plenty of other people willing: most of the Aurors resented the Malfoys’ escaping prison, and Ron wasn’t the only one sure they were helping some of the missing Death Eaters escape. Lucius and Narcissa had left the country three times since the trial—“For his health, they say,” Ron sneered. “More like so they could slip another one of their pals out in a trunk, if you ask me,” even though their baggage had been thoroughly searched each time.</p>\n<p>“I don’t think they’d stick their necks out that far, personally,” Hermione said. “They’re far more interested in protecting themselves and repairing the family image. They wouldn’t be smuggling Death Eaters out to Paris or Milan or Madrid—they’re traveling to be seen at parties where no one cares enough about the war to snub them.”</p>\n<p>Harry didn’t care to argue about it either way. He let other people go to the Manor, and the complaints came in and were dismissed at the same rate, until one day they got six separate reports in a single morning that the Death Eater Byronus Shent had been seen on the grounds. Chief Auror Skadden came in to their training room and said, “Weasley, we’ve got a live one, we think. Find Potter and report to Redmayne’s unit, I want everyone who knows the Manor grounds on this one.”</p>\n<p>Harry stood up from the corner—he hadn’t actually been wearing the cloak, just then, but he sat out of the way all the time, now, so that if he <em>was</em> wearing it, people didn’t trip over him. He slung it on as they left the building, automatically, and Ron muttered, “Reckon you’d better keep it on for this one, Harry. We might really get Malfoy this time, and better odds if he doesn’t see you coming.”</p>\n<p>Draco met the unit at the gates, looking irritated. “Do you lot never get tired of wasting your time and mine?” he demanded coldly, swinging the gates open after they’d handed through the warrant. “Have at it, and if you trample the garden <em>again</em>, my mother will be calling the president of the National Gardens Scheme <em>again</em>, so if you want to endure another Ministry inquiry on Aurors causing damage to historical property, by all means enjoy yourselves.”</p>\n<p>Harry slipped inside the gates. He didn’t follow the rest of the Aurors as they trooped onto the grounds, just stayed near Draco, who was standing at the gates with one hand on them, frowning after the team.</p>\n<p>Draco looked well. He’d been shadowed and silent at the trial, pale in his stark black robes and barely looking up, except when he’d stood to hear the verdict. Thin to the point of gaunt, worn down; but he’d put some weight back on, now, his cheekbones not quite so sharp, and he was actually wearing clothes with some color in them: a deep green that was <em>almost</em> black, but not <em>quite</em>, and embroidered in gold. He stood a moment longer, tilting his head contemplatively, and then said, “As though I’d hide a Death Eater on the grounds of the <em>house</em>,” with a cool, contemptuous air, and then he stepped <em>out</em> of the gates.</p>\n<p>Harry darted back out after him and just made it through before the gates slammed shut. Draco set off into the woods across the road, pushing through a wall of brush and disappearing. Harry stood on the roadside for a moment, weirdly reluctant—of course he had to go after Draco, but—he didn’t <em>want</em> Draco to be hiding a Death Eater somewhere in the woods. He didn’t want to end up in court again, testifying to send him away.</p>\n<p>But he pushed through after him, onto a narrow overgrown path that wound through the woods for a stretch. Draco was already some distance along, his silver head bright among the dark trees. Harry trotted to catch him up as he came to a hedge maybe ten feet high, with another ironwork gate set into it, the Malfoy M worked into the metal. Draco opened it and went inside, and Harry dived through again just in time, into a small circular garden. A potions-brewer’s paradise: at least, if you wanted to brew poisons and Dark infusions. Amanita mushrooms and faintly glowing phosphorescent fungi grew in tidy beds, death’s-head ivy fought with charnel roses for the trellises overhead, and a tiered black stone fountain stood in the center: water silently bubbling up from beneath and softly waterfalling over the sides, steaming hot at the top and falling to cooler levels below.</p>\n<p>Draco was already halfway across the garden, passing through the clouds of mist towards a door at the other end. Harry couldn’t go through the steam: he went around the outer rim of the garden instead, breaking into a run, and as he dashed, a vine lying across the path suddenly raised up into his way, and as he tripped and fell, more of them came lashing out from the wall of thick ivy behind him, loops and thick thorny coils grabbing hold of him: Devil’s Snare.</p>\n<p>Harry went limp and the coils started to ease back at once, but before they’d let him go, the sizzling spark of a Shocking Jinx hit the vines. As they tightened again, Draco stalked right up to him, and he reached up and pulled the cloak off Harry’s head.</p>\n<p>He didn’t look in the least surprised. He had his wand out, held low and dangerous right at Harry’s gut, immobilizing position. “You know, Potter, it’s funny, this warrant you lot handed me applies only to the grounds of Malfoy Manor,” Draco said icily. “It doesn’t cover our park, home farm, or kitchen gardens. Which means that <em>you</em> are trespassing.”</p>\n<p>None of that sank in; Harry was too busy staring at him. “You knew I was there.”</p>\n<p>Draco snorted. “You always did think flinging that cloak on took you to the heights of subtlety.”</p>\n<p>Harry felt more relieved than anything. “You’re not hiding Shent, are you.”</p>\n<p>“If I were hiding someone, you lot certainly wouldn’t find him by looking,” Draco said. “Is that the idea that impelled this grand invasion? Lately these searches have been getting so perfunctory, I’ve started to feel as though I’m being unsociable not to offer tea.”</p>\n<p>“We got six different reports he was here,” Harry said. The vines had loosened up again; he shrugged them off and stepped out of their reach.</p>\n<p>Draco’s eyes narrowed. “Did they come from Malstoke?”</p>\n<p>“Yeah,” Harry said; it was the village just south of the Manor. “Do the inhabitants have it in for you or something?”</p>\n<p>Draco looked away. “Greyback and some of his lot liked to go and amuse themselves round there,” he said shortly. He stood frowning a moment. “Six is rather elaborate, however. It seems rather a coordinated effort just to waste your time…”</p>\n<p>He abruptly took off running back towards the gate, and Harry blinked and then ran after him. There were some old broomsticks leaning against the hedge, outside the garden, and Draco snatched one and shot off through the woods. Harry grabbed another and went after him, speeding wildly through the trees—across the road, just barely dodging a blaring lorry with a staring, goggle-eyed driver, who probably would decide not to believe what he’d just seen—and across the Malfoy estate. Harry caught glimpses from the corner of his eye of the Aurors working their way systematically through the formal gardens and the flash of Seeking Spells from the windows of the house and the orangery. Draco was skimming dangerously low and close to the trees, obviously keeping out of their sight. He came to a low half-crumbled stone wall and turned west to follow it along the edge of the property, flying slower now and scanning the edge.</p>\n<p>Harry caught up to him just as Draco dived to the ground and came off his broom, leaning it against a tree. He crept slowly towards a small hillside where the ground fell away from the trees and sloped down to the wall, with tree roots and moss hanging down over the edge. As they came closer, Harry saw there was a small ragged cave behind the roots, barely a depression in the rock, and a shaggy-beared man sleeping inside, wrapped in a tattered cloak with ragged flappy-soled boots poking out.</p>\n<p>Draco stood there, his hand clenched round his wand, and then he ducked underneath the curtain of moss and nudged the man’s boot. “Shent,” he said, and the man jerked awake and stared up at him, one eye so bloodshot it glared almost solid red. “The Aurors are on your trail,” Draco said, “and now you’ve got ward-fever. What possessed you to come here? You must’ve known my father revoked permission.”</p>\n<p>Shent stared up at him. His hands were protectively wrapped round a large hunk of bread in his lap, the remnants of what had clearly been a much bigger loaf. “They gave me the bread,” he said, his voice hoarse. “If I’d cross the wall.”</p>\n<p>Draco’s lips thinned. He looked round at Harry, and Harry slowly lifted a fold of the curtain of roots and vines and came in. Closer, he could see what Draco was talking about: there were spiderwebbing lines of green visible all over every bit of exposed skin, pulsing faintly, and Shent’s hair and clothes were matted with fever-sweat. “Do I need to keep him suffering, or will you witness he came onto the grounds without permission?” Draco said tightly.</p>\n<p>“Yeah,” Harry said quietly. Draco immediately turned and said, “You’re welcome on my family’s lands,” and the green lines almost instantly began to fade out of Shent’s flesh, his face sagging with relief, and he sank back against the wall limp and half unconscious.</p>\n<p>Draco looked away, his jaw clenched. “Call your fellow jail-feeders,” he said flatly. “And treat him gently. I’ll have a lawyer at headquarters for him in an hour.” He turned and walked out of the cave.  </p>\n<p>#</p>\n<p>The next day, Harry went back to Malstoke and interviewed all the people who’d sent in the reports: he’d volunteered for the job. None of them were at all happy to meet him. They avoided his eyes while he asked them questions about when they’d seen Shent, and when he finished with those, he went and interviewed everyone else who’d previously sent in reports about the Manor.</p>\n<p>At the end of each interview, when he stood up, he said quietly, “I understand being angry at the Malfoys. But there’s loads of Voldemort’s people still out there. The kind who really liked what he was doing and wanted him to win and want to keep hurting people now. And every time we get a report that sends us chasing the other sort, it makes it harder to find them. Just something to keep in mind,” and they all darted ashamed looks at him and muttered their goodbyes as he walked out.</p>\n<p> It was getting late and colder when he finished, the sun going down, and he slung on the cloak automatically as he left the last house. He walked to the Apparition point at the edge of the town, dodging the people coming home from work, and paused there a moment. The Manor was visible in the distance up on its hill, lit golden from inside, and Harry understood without any trouble how the people here could still be angry, knowing the lords of the castle had brought in werewolves and Death Eaters to prey on them and their children.</p>\n<p>He looked up at it a while longer, and then abruptly he kept going and hopped the wall. The wards were only a faint tingle on his skin that faded right away: it was a stretch to call this official business, but not too much of one, and the warrant was still valid. He climbed up the hill and came through the gardens—sadly it looked like an entire plot of Imperial Snapdragons <em>had</em> been trampled, so there went a dozen afternoons being lectured by angry gardeners.</p>\n<p>From here, he could see that it was only the dining room lit up, making ready for service. A white cloth was smoothing itself out over the table, and the silver was hopping out of the drawers and lining up to be polished. He couldn’t see who was going to eat, though: all the second floor was dark, and no one at all seemed to be moving through the house. Harry had to walk a long way down the path before he finally found Draco, alone in a mostly dark sitting room with a handful of candles ablaze around him, a single small illuminated island at a desk in the corner. He was writing a letter, a long velvety-black feathered quill with its silver tip moving rapidly over the parchment, and when he finished, he folded it up and sealed it with green wax.</p>\n<p>He got up and came to the window and opened it, and called, “Bellerophon!” The eagle owl swooped downwards, snatched the letter from his hand with its enormous talons, and shot off into the sky. Draco stood with his hand on the open window, watching the bird go, and then he frowned suddenly and turned and looked right at Harry. “Potter, not that I don’t appreciate your trying to hand me more grounds to sue the Aurors for harassment, but what are you <em>doing</em>?”</p>\n<p>Harry stared back at him from under cover, then slowly pulled the cloak off, bewildered. “How could you even tell I was there?”</p>\n<p>Draco rolled his eyes. “I had to watch my back around Death Eaters. You’re such an incompetent Occlumens, you could wear ten of the things in layers and toss on a couple of Silencing Spells, and I’d <em>still</em> notice you. And you haven’t answered my question.”</p>\n<p>“I was down interviewing the people who’d sent in the reports,” Harry said.</p>\n<p>“And?” Draco said. “I assume they swore up and down that Shent burst out of our grounds, charged through town blasting innocents left and right, howling ‘Long live the Dark Lord, whom the Malfoys serve!’ as he went, then returned straight to our house, where I was waiting to receive him with noisemakers and cake.”</p>\n<p>Harry choked half a laugh. “They had a hard time looking me in the face, actually. I don’t think they’ll do it again. But you know, Draco, it wouldn’t kill you to try making some peace with your neighbors.”</p>\n<p>Draco glared at him indignantly. “Would that be the neighbors who just had a bloody good go at sending me to Azkaban?”</p>\n<p>“And they’ve no right to be angry?”</p>\n<p>“How exactly do you think I’m going to make <em>peace</em> with them? I’m sure they’d be delighted if I publicly confessed to a litany of crimes and offered myself up to be pilloried, but you’ll forgive me if I don’t.”</p>\n<p>“There’re a lot of families down there that look like they’re having a hard time,” Harry said quietly. “I saw a lot of medicinal potions and herbs about, and more than a few kids who weren’t at school. A lot of the houses could do with some repairs.”</p>\n<p>Draco’s face was hardening as Harry spoke, going rigid, his mouth turning down at the corners. “Thanks ever so, I’ll give it thorough consideration. Was there anything else, or would you like to get back to lurking silently outside my window?”</p>\n<p>“I’ll do that,” Harry said dryly. Draco shut the window and went back to his solitary desk and started writing again, and Harry walked away.</p>\n<p>#</p>\n<p>That Sunday, Harry was reading the <em>Daily Prophet</em> leisurely at breakfast—he got through it cover to cover these days, as he didn’t leave the house at the weekend if he could help it—and saw a small advert blinking on the lower corner of the front page saying <em>War Victims Fund for Wiltshire</em> with a note saying <em>Individuals residing in Wiltshire and having suffered injury or damage to property as a consequence of the War are advised to contact our offices for assistance. All cases considered promptly.</em> He couldn’t help but feel glad, seeing it; like he’d got something right, a hunch that had paid off.</p>\n<p>He was nearly to the office the next day when he spotted Draco coming out of a building further down the street, a solicitor’s office, and Harry hesitated a moment and then hurried to catch him. He pulled off the cloak first, this time—he didn’t need Draco to make any more pointed digs about him lurking—and got to him on the corner, before Draco had stepped into his carriage. “Draco,” he said.</p>\n<p>“Potter,” Draco said coolly.</p>\n<p>“I saw the advert,” Harry said.</p>\n<p>Draco shot him an irritated look. “Yes, and if you talk about it some more and ideally just a bit louder, people will figure out I’m behind it, and then no one will take the money,” he said pointedly.</p>\n<p>“Don’t you want them to know it’s you?” Harry said.</p>\n<p>Draco made an impatient gesture. “<em>Eventually</em>,” and then he frowned suddenly, and Harry jumped as a big meaty hand came down and landed on his shoulder.</p>\n<p>“Harry Potter!” the man said, beaming—Harry sighed inwardly, it was one of the hand-shakers, back for maybe the eleventh time, <em>and</em> he was also one of the would-have-been heroes, with a particularly excruciating story he’d told Harry four times about how he’d secretly mislaid several forms filed by superiors back while the Death Eaters had been in charge of the Ministry.</p>\n<p>“Um, yeah, hello,” Harry said unenthusiastically, while the man grabbed his hand and pumped it up and down.</p>\n<p>“It’s Murglethump,” the man said helpfully. “Warwick Murglethump. Just wanted to say thanks again for all you did. Can’t tell you what a relief it was, to me and all the fellows down in the Population Records Division, seeing You-Know-Who go down. We did our small bit, of course—why, that fellow Thicknesse sent down all sorts of orders to my office, you know—well, let’s just say, they weren’t all filled promptly, were they, ha ha!”</p>\n<p>“Right,” Harry said, unsuccessfully trying to extricate his hand. “Look, I’ve got to…”</p>\n<p>“Murglethump, is it?” Draco said suddenly, and Murglethump jerked his head round and did a double-take at him. Draco was regarding him with the incredulous expression of a man who’d just been triumphantly served a plate full of caterpillars. “Let’s see, where did I hear your name? Population Records, is it? That’s right, ‘remarkably cooperative,’ Yaxley called you. ‘Served up the addresses of two dozen Muggle-borns in three days, worth recruiting.’ ”</p>\n<p>Murglethump’s face was draining of color, and his whole mouth was trembling. “You, you’re,” he blurted. “That’s not—I never, I—” He threw a look at Harry, stricken.</p>\n<p>Draco snorted. “Get out of my sight, you pathetic cur, before I make Potter here an offer to give testimony against you. The Aurors keep pestering my family, I wouldn’t mind giving them something else to do,” and Murglethump dropped Harry’s hand like a live coal and fled down Diagon Alley, blundering into half a dozen people before he vanished into the crowd.</p>\n<p>Harry gaped after him a moment, stunned, and looked at Draco. “What—how did you—you’d <em>heard</em> of that man?”</p>\n<p>“Of course not,” Draco said. “I was at <em>school</em> last year, Potter, how would I have heard any reports from the Ministry? I didn’t need to. He might as well have been yelling it in full voice, that performance he was putting on. Why on earth were you tolerating him, anyway? <em>Thanks for all you did</em>? Do you really not get enough attention that you need to let strangers grovel at your feet?”</p>\n<p>“Not<em>—</em>not—<em>get enough attention</em>,” Harry strangled out, almost choking, and then Draco whipped his wand out and snapped, “<em>Expelliarmus!</em>” and a woman standing three paces away taking aim yelped in dismay as the camera in her hands went flying and smashed on the cobbles.</p>\n<p>“I only wanted a picture!” she said, wringing her hand as if it hurt her.</p>\n<p>“Go and photograph your own friends, if you <em>have</em> any, since you’re the sort of grotesque who’ll go around shoving cameras in strangers’ faces without permission,” Draco said. “Umbral! Come down here, and if any more of Potter’s <em>adoring fans</em> show up, clear them out.”</p>\n<p>The enormous coachman clambered down from the seat, all massive many-caped overcoat with a tall turned-up collar and a top hat, with nothing actually visible in the dark space between, like the uniform had taken service with the Malfoys back in the Regency and was still going without anyone needed inside. The woman retreated before him, wide-eyed, and he took up position blocking them from the street.</p>\n<p>Draco looked back at Harry with a frowning, half-astonished expression. “Wait a minute, are you actually so helpless that you’re skulking around in an Invisibility Cloak <em>all the time</em> just to avoid dealing with these people?”</p>\n<p>“Er,” Harry said, because the answer to that did seem to be yes, only he wouldn’t quite have put it in those exact words.</p>\n<p>“That’s possibly even more appalling than <em>they</em> are.”</p>\n<p>“Sorry, I’m not good at being rude to people,” Harry said defensively.</p>\n<p>“Is that a joke? You’re <em>smashing</em> at being rude to people, you’ve never <em>stopped</em> being rude to me a day in your life!” Draco said. “The first time we <em>met,</em> you all but spat in my face.”</p>\n<p>“I did not!” Harry said. “The first time we met, <em>you</em> insulted Hagrid and Muggle-borns and every other house but Slytherin.”</p>\n<p>“What are you even talking about?”</p>\n<p>“At Madame Malkin’s!” Harry said. Draco looked utterly blank. “When we were getting fitted for robes! You don’t even remember, do you, it’s all a giant blur of sneering at people.”</p>\n<p>Draco glared at him. “See, Potter, no trick to it, is there?”  </p>\n<p>“Yeah, well, I <em>know</em> you,” Harry said. He sighed.</p>\n<p>“Pathetic,” Draco said. “Come on, get in.”</p>\n<p>“What?”</p>\n<p>“The <em>carriage</em>,” Draco said. “I’ll drop you at your office, so I don’t have to experience the existential horror of watching you turn yourself into a ghost to haunt us all before you’re even dead.”</p>\n<p>He climbed into the carriage without another word, and Harry hesitated a moment, torn, but <em>haunt us all before you’re even dead</em> had an uncomfortable taste of accuracy to it. Draco had always had a gift for finding the sorest spot to push on. Harry got in. The Malfoy carriage was a small sitting room on the inside, full of comfortable armchairs and tea waiting on a low table. A cup was already pouring for him, milk and sugar mixing in just to his taste.</p>\n<p>“You’ve got money, why haven’t you set up a carriage of your own?” Draco demanded as it lurched into motion.</p>\n<p>“I like walking!” Harry said. “Not all of us want to be shut up pretending the rest of the world doesn’t exist.”</p>\n<p>“No, your solution is pretending <em>you</em> don’t exist,” Draco said. “You weren’t even lurking round me on purpose at all, were you? No wonder it was such an appalling shock to you that I noticed you were there. Nobody else <em>does</em>, do they.”</p>\n<p>Harry flushed and looked away.</p>\n<p>“Hand it over,” Draco said abruptly.</p>\n<p>“What?” Harry said, jerking back. Draco was beckoning at him.</p>\n<p>“The cloak. Hand it over, I’m keeping it for a day. You owe me for running off those two, that’s my price. What, don’t think you can manage without it for that long? I’ll give you a lift to your office tomorrow morning, and you can have it back then, as long as you haven’t, I don’t know, dissolved yourself in acid or immolated yourself just to avoid facing the world.”</p>\n<p>There was a wealth of scorn in his voice, so cutting that Harry glared and chucked the bundled-up cloak at his head. Draco caught it and hung it over the arm of his chair. “Bravo,” he said. “Off you go, Potter, try not to shock anyone too badly by walking into rooms or saying hello or anything.”</p>\n<p>The carriage door swung open onto the doors of Auror headquarters, and Harry glumly got out, wondering what had possessed Draco and what had possessed him, except he had the weird and horrible suspicion the first was pity, which was probably why the second was mortification. Draco Malfoy of all people feeling <em>sorry</em> for him—Harry really wanted to say he hadn’t fallen that far, but maybe he <em>had</em>.</p>\n<p>“Harry!” Ron said in surprise when he walked in, blinking at him.</p>\n<p>“Er, hi,” Harry said. The rest of the morning rush went like that. He and Ron were on duty together at the Misdemeanors Desk that day, and people came past on the way to their offices, doing double-takes when they saw him. Harry winced a bit at how puzzled everyone was, saying hi.</p>\n<p>Eventually the tide finished coming in, and they could settle down to work, but not ten minutes later, Ron said, “Something more with the Malfoys?” as he caught one of the folders flying out of the chute, on its way to their inbox. “Well, that’s new.”</p>\n<p>“What?” Harry said, looking up. Ron did <em>another</em> small double-take at him and then said, “Yeah, it’s some woman complaining Draco blasted her camera out of her hands in the street today. Sounds a bit thin—but we might as well look into it. At least we can help his lawyers suck some more gold from the vaults.”</p>\n<p>“Oh, er,” Harry said, and cleared his throat. “Actually, if you don’t mind…” Ron looked up questioningly. Harry gave up feeling guilty and said, “Look, let’s just bin it, all right? He did it—for me. She was trying to take a photo of me, I mean.”</p>\n<p>Ron frowned. “What, just shoved a camera in your face without asking?”</p>\n<p>Harry sighed. “They never ask.”</p>\n<p>“Ugh.” Ron screwed up his face with distaste. He looked down at the report, gave a small regretful sigh, then tossed it in the <em>Do Not Investigate</em> bin with the other nine-tenths of the reports that got skipped for being too insignificant or pointless to investigate.</p>\n<p>They worked until lunch, and then Ron said, “D’you want to go out and get something?”</p>\n<p>Harry didn’t want to, but he had to leave the building at some point. He took a deep breath. “Yeah, okay,” he said, and got up. Ron kept eyeing him all the way outside. “What?” Harry said.</p>\n<p>“Er,” Ron said. “Nothing.” Then a moment later, “You’re not wearing it.”</p>\n<p>“Um,” Harry said. “I let Draco—borrow it.”</p>\n<p>“You what?” Ron said blankly.</p>\n<p>“He…he sort of…he bet me I couldn’t live without it for a day,” Harry said, which wasn’t exactly right, but close enough, he figured.</p>\n<p>“Wait, you what?” Hermione said that night, after Ron finished telling her, to Harry’s private dismay. “You <em>gave</em> your cloak to Malfoy? Harry, who knows what he might use it for!”</p>\n<p>“It’s just for a day!” Harry said. “He’s giving it back to me tomorrow.”</p>\n<p>“But—I can’t understand—what did he <em>say</em> he was going to use it for?” Hermione said. “Why did he even <em>claim</em> to want it—”</p>\n<p>“He didn’t!” Harry said, although she was making him feel a bit stupid. “He just—he thought I was—using it too much,” he finished, in a mutter.</p>\n<p>“What, just because you’re using it to get past the crowd who hang about outside Grimmauld Place every morning?” Hermione said, bewildered.</p>\n<p>Harry squirmed. He would’ve liked to avoid the question, except—he darted a look at Ron, who was starting to look a bit uncomfortable himself, and Hermione was frowning as she looked between them. “Er, well,” he said, and it came out in bits and drabs.</p>\n<p>“You’ve been wearing it <em>all the time?</em> At the office, too? <em>Indoors?</em>” Hermione said.</p>\n<p>“Er,” Harry said lamely. “I just—forgot I was wearing it, sometimes.”</p>\n<p>Confused was shading rapidly to appalled. “Is that supposed to be a <em>joke?</em>” Harry stared at her. “Harry, I’ve <em>worn</em> that cloak! Who are you lying to exactly, me or yourself? You can’t <em>forget</em> you’re wearing it! The whole world looks odd!”</p>\n<p>“You—you get used to it!” Harry said.</p>\n<p>“Maybe you do if you’re wearing it <em>every waking hour!</em>” Hermione said. “How did you get to that point?”</p>\n<p>Harry opened his mouth and shut it again.</p>\n<p>Hermione kept staring at him a moment longer before she threw up her hands and whirled on Ron, who backed away with a guilty and alarmed expression. “And <em>you</em> just let it get to this state? It takes <em>Draco Malfoy</em> staging an intervention, for who <em>knows</em> what awful reasons of his own, for me to even find out about this—”</p>\n<p>#</p>\n<p>Ron and Hermione had half convinced Harry he’d need to go and beat down the gates to Malfoy Manor to ever get his cloak back, but Draco’s carriage arrived the next day just as he was finishing his eggs. It rather carelessly swiped the curb, knocking down the eight people who made up the regular morning crowd. Their determination hadn’t been dampened by the months-long lack of an appearance. Harry thought for some of them it had just become a social thing—one of them brought croissants, another brought coffee, they all stood about chatting outside his gates.</p>\n<p>Draco swung open the top half of the carriage door when they all picked themselves up and started yelling. “If you don’t want to be run over, don’t congregate in the street. And by all means <em>do</em> call the authorities, they can cart the whole lot of you away for loitering and harassment. Are you <em>littering?</em>” he added, even more icily, to the one who’d dropped a coffee cup.</p>\n<p>Harry made a dash for it, and got into the carriage before any of them recovered enough to try for him, although one of them did run up to the carriage and put her hand on the door, calling, “Wait, wait, Mr. Potter—”</p>\n<p>“If you care to keep your fingers, you can, but it’s all the same to <em>me</em>,” Draco told her, and slammed the upper half shut in her face—she did jerk her hand back just in time—before he set the carriage going. “I’m sure I’m going to regret asking this question, but why exactly are you permitting people to gather on your porch, Potter?”</p>\n<p>“I can’t just run them off,” Harry said. “They’re on the pavement, not my house.”</p>\n<p>Draco rolled his eyes. “Get some Repelling Yew and throw in some wild mint. To attract razorwing butterflies,” he added, when Harry looked blank. “Your hangers-on will back well off if they know what’s good for them, and if they don’t, they won’t be troubling you for long. Besides, that’s a ridiculous excuse to begin with. Of course you could run them off. You’re <em>you</em>. You could start flinging Unforgivables in broad daylight and no one would make a peep.” </p>\n<p>“I don’t want to start flinging Unforgivables at people!”</p>\n<p>“Throw jinxes instead,” Draco said. “Or don’t, endure the endless siege, I’m already bored.” He waved a hand towards the table: the cloak was neatly bundled up on top. “There it is. Are you crumbling in desperation, or can you manage without it another day, do you think?”</p>\n<p>Harry swallowed. Hermione had lectured him for an hour, and he’d promised not to use it anymore—<em>after </em>getting it back from Draco—and then three people had accosted him on the way home from her and Ron’s flat. He’d only managed to evade one of them, the other two had followed him the whole way. There’d be more tonight. If he had it with him… He looked away. “Yeah, fine,” he said tightly.</p>\n<p>When he got to the office, he did get the phone book out and rang up a gardening service. “Er, would you have any—Repelling Yew?”</p>\n<p>“Neighborhood riffraff hanging about outside your house?” the assistant on the other end said in knowledgable tones. “Not a problem. It’s a terrace, is it? Right, you’ll want four of the big ones, in pots, and if you like we can come by once a week for the maintenance.”</p>\n<p>“Yes, please,” Harry said. “And—some wild mint?”</p>\n<p>“Certainly,” she said. “Just remember you’ll need to explicitly invite anyone you <em>want</em> to come in!”</p>\n<p>Everything had already been delivered by the end of the day. Harry gratefully spotted the tall plants behind the fence as he got to the house—a woman at his heels for the last six streets, talking at him without a pause about how much she <em>admired</em> his <em>heroism</em> in the war, how <em>young</em> he was for such <em>heroism</em>, how <em>heroic</em> his <em>heroism</em> had been. When they got to the gates, she finally stopped long enough to take a deep breath and got a strange look on her face. Harry opened the gate and went inside, and before he’d even finished locking it, she had backed across the street and was looking after him with a longing and vaguely queasy expression.</p>\n<p>The next morning, the crowd had thinned to just four, and they were all on the pavement across the way when Draco’s carriage pulled up for him. The horses put their ears back unhappily, and Harry hastily said, “Draco Malfoy’s welcome at my house!” from the front door, and they shook their heads and relaxed.</p>\n<p>“Amazing, Potter, you can be taught,” Draco said, when Harry had climbed unmolested into the carriage. “Here.” He tossed Harry a small black box with an elaborate jeweled clasp.</p>\n<p>“What is this?” Harry said, trying to open it, except halfway through the sentence he got it open and something glowing came hiccuping up his throat and out his mouth and went into the box, which slammed shut on it, and his lips finished moving without a sound.</p>\n<p>“It’s a Voice Box,” Draco said. “For when people in the street insist on yowling at you.”</p>\n<p>Harry opened it again, and the glowing lump shot back into his mouth. He swallowed it down into place. He made sure the lid was firmly closed before he said, “Thanks.”</p>\n<p>Draco nodded coolly. “Do you suppose you could endure the rest of the week?” he asked, and Harry opened his mouth to say he didn’t need Draco keeping hold of the cloak anymore. He could just give it to Ron, at the office.  </p>\n<p>And then he tried to imagine Ron refusing to give it back, or even so much as giving him a hard time for asking for it, if they were out together and someone started to… Harry swallowed. “Yeah, fine,” he said.</p>\n<p>“Then I’ll see you on Monday,” Draco said, as he deposited Harry at the Auror Department.</p>\n<p>Harry went out for lunch with Ron again. About ten minutes in, the historian popped up tableside. He wasn’t really a historian as far as Harry knew, he just liked to ask detailed questions about every event of the War, and especially to gleefully call Harry out for any details he misremembered, like maybe he was lying about having been there or something.</p>\n<p>Harry said to Ron, “Don’t say anything for a minute,” and opened up the Voice Box. The man’s mouth kept moving, but he went completely silent, and then he stopped, open-mouthed and shocked. Harry clenched his hand on the box and said tightly, “Look, I don’t know why you think it’s all right to barge in on me when I’m having lunch, but I’m not having it anymore! If you want your voice back, stop bothering me, and I’ll let it out again.”</p>\n<p>The man stared at him stricken. Harry determinedly looked back at Ron. “You were saying about the budget?”</p>\n<p>Ron was a bit open-mouthed himself, but he rallied and said valiantly, “Yeah, er, yeah—the supplies, you know,” which didn’t actually make sense, but they managed to keep talking somehow, and after a few minutes the man slunk away to his table in the corner, and Harry opened the box and let the voice slip back out.</p>\n<p>He used it again on the way home, for a woman who tried to proposition him. He hated that almost more than anything else, especially when they started listing horribly obscene things they were willing to do. Maybe they thought their best chance was him secretly wanting something grotesque, something an ordinary person wouldn’t do. Sure enough, this one started in on, “<em>Anything</em> you’d like,” with what she probably thought was a seductive smile, and tried to take his arm. He yanked loose so hard she nearly fell. He pulled out the box, vengefully shut her voice up with a snap and said, “Stay away from me, or the next time I’ll chuck the box in the Thames!”</p>\n<p>He stalked the rest of the way back home almost shaking. It wasn’t <em>fair</em>, it wasn’t fair he had to <em>do</em> this sort of thing to people just to get them to leave him decently alone, and his eyes were prickling and hot, but he was angry too, wildly angry, and when another man came towards him at the corner of Grimmauld Place, Harry didn’t let him get out a word, just spat, “Let me guess, you’re my biggest fan? Fuck off, go and find your own life and stop trying to cling on to mine! If I wanted toadies I’d get <em>better ones</em>,” as rude as even Draco could have liked him to be.</p>\n<p>The man recoiled, wide-eyed. Harry shot past him and was at the safety of the pavement in front of his own house, with the sweet fragrance of mint and yew branches in the air, and he banged his gate shut behind him and slammed inside the house, and then he sat down in the hall and put his head against his knees.</p>\n<p>#</p>\n<p>Harry spent the rest of the week angry. People at work eyed him a bit nervously, especially after the incident on Thursday morning where a woman came in supposedly with a complaint and stopped by his desk to ask for an autograph, just in passing. “Do I look like a tourist attraction?” he said savagely. “This is a working office. If you haven’t any business being here, <em>get out</em>,” and she flinched back and literally fled the building.</p>\n<p>Nobody except Ron talked to him at all the rest of the day. Harry kept his head down and plowed steadily through half a dozen case files, none of which were even worth leaving the building. He stayed late, because at least that way the streets wouldn’t be as crowded, and just as he was walking downstairs to leave, an alert blared out and the alarms began to flash: a Class 5 dangerous beast, threatening imminent harm.</p>\n<p>Harry turned and dived down the stairs to the locker rooms and threw on his combat gear with a whisk of his wand before the night shift had even made it downstairs. “I’m going!” he shouted as he dashed past them, going back up, and Hodges nodded acknowledgement. The Apparition booster was primed with the coordinates, but there were no details yet; Harry shouted, “<em>Apparate!</em>” and threw up a Shield Spell the instant he landed, without even looking to see where he was.</p>\n<p>Then he blinked, because he knew the place: he was standing at the Apparition point in Malstoke, and then a horrible shrieking wail raised up all the hair along the back of his neck. He was shaking with induced fear, but he already knew where it was coming from, and real fear made him move: he managed to grate out the Cheering Charm and steady himself, and then he was racing up the hill towards the Manor, his heart thumping in his throat.</p>\n<p>The gardens were littered with broken glass, all the windows and glass doors in the back wall of the building shattered. The Fury was already inside the house, roaming the corridors: Harry glimpsed her ragged white train floating past the dining room. She wailed again, sounding baffled and enraged: at least that meant she hadn’t caught Draco yet. He ran ahead to the sitting room and hit the window latch with a quietly hissed Opening Charm. Then he climbed in and crouched low as he crept towards the door. Furies were almost impossible to summon and to kill, they only came if you offered them your own heart in a horrible and complicated Dark ritual, and they only ever went away again after they’d devoured the heart of the target, too. Harry couldn’t even imagine how someone could have hated Draco enough—hated anyone enough—to send one after him.</p>\n<p>He leaned out from the sitting room and fired a Stunning Spell, but it barely made her wince away a moment, and then she came flying down the hall at him, hissing and with hands outstretched, a huge metal-studded scourging whip in one hand and the other full of bloodstained talons. Harry backed away throwing a Charm of Entanglement, which did some good: two of the massive tapestries on either side of the corridor flung themselves on the Fury and wrapped her up in a thrashing heap of heavy fabric.</p>\n<p>But her claws came ripping through in a moment, and then her head came snarling out and she drew a deep breath to shriek again directly in his face. Harry snatched the Voice Box out of his pocket and opened it just as the Fury started to scream her rage, and an enormous glowing knot came erupting out of her throat and hurled itself inside the box so hard that Harry staggered back a few paces.</p>\n<p>The box immediately began to heat up uncomfortably in his hand. Harry turned and ran for what he devoutly hoped were the kitchens, as faint wisps of smoke came threading out from under the lid. The Fury finished tearing her way out of the tapestries and came flying after him even more agitated, her mouth open in a soundless wail. Harry flew down the stairs and scrambled out into the kitchen and pulled open the freezer. He chucked in the Voice Box and slammed it shut before whirling round again and shouting, “<em>Protego Maximus!</em>” and throwing up a shield wall in front of the kitchen door just in time.</p>\n<p>The Fury crashed into it full tilt and started scrabbling at it wildly. Harry had never seen a detailed illustration of a Fury’s face, no one usually lived long enough to get one. She had five bloodshot-red eyes and the suggestion of a sixth, staring in all directions, bright blue snakes writhing wildly for hair like a medusa, and her mouth and all the way down her throat was like a pit of concentric saw-edged rings. He had a good view because she kept trying to shriek at him. Every time she did, the whole freezer behind him rattled violently, banging against the wall and groaning, but thankfully the Malfoys must have updated the kitchens recently, because it was a massive squat thing built of stainless steel, obviously the single most expensive model you could possibly get, and it held.</p>\n<p>Harry concentrated on keeping up the shield while the Fury clawed more and more desperately, letting out one silent howl after another, until she finally stopped a moment, panting, and glared at him. Harry glared right back at her. “The rest of the Aurors will be here in a minute, want to see if we <em>can</em> figure out a way to kill a Fury?” he yelled, and she hurled herself against the shield afresh, beating her horrible flail wildly at the barrier, tearing away paint and plaster from the walls, cracking the door frame. But fortunately they were down in the cellars and the walls were solid stone, so she didn’t make much headway, and she finally had to stop again. She stared at him with her claws flexing and working in mid-air, her whole face twisted with mad frustration.</p>\n<p>“You’re not getting him!” Harry said to her. “I don’t <em>care</em> why they sent you. I’m sorry they were hurting, I’m sorry they—I’m sorry for whatever they lost, whatever they went through that was so bad they couldn’t bear it anymore. But it wasn’t his fault.”</p>\n<p>The Fury was still staring at him, her chest rising and falling, but the writhing snake-nest of her hair had begun to droop as he spoke, her arms lowering and her mouth closing up a bit, as if she was actually listening to him.</p>\n<p>Harry stared back at her and swallowed. “Draco made mistakes,” he said after a moment. “He made a lot of them. But he didn’t make the <em>real</em> ones. He didn’t kill. Even when he thought his own life might depend on it, he didn’t kill. And—I don’t know if he tried to help me in the war, if he really meant to—but I do know he’s sorry. He’s <em>sorry</em>,” he finished softly, suddenly sure of it himself, and the snakes were smoothing into a solid blue that went spilling down her back like fabric.</p>\n<p>The Fury’s face was smoothing too, going calm and oddly miserable. It was somehow harder to bear than her rage, tears prickling at Harry’s eyes involuntarily as she looked at him, and then she reached up her arm and took hold of the blue and pulled a long heavy fold of it over her face and the front of her body, like a shrouding veil. Harry stared in sudden shock. Suddenly she looked just like an <em>Eleos</em>, one of the mercy spirits that people almost never saw, no one knew where they came from—</p>\n<p>—and then the veil kept sweeping round, and she whirled away and vanished with it entirely.</p>\n<p>Harry stood panting. His shield had come down. On the steps just behind where the Fury—or the Eleos—had been, there was a sudden stirring in the air, and Draco slowly pulled off the cloak. Harry almost gasped with relief, and then he saw that Draco’s face was—was wet, dripping with tears, stricken.</p>\n<p>Harry ran to him. Draco’s whole left cheek was badly scratched like he’d been hit with flying glass, and his hand and arm were bloody, the sleeve of his jacket and shirt shredded, the Dark Mark scored with gashes so the skull was weeping blood. But when Harry got to him, Draco choked out, “I am. I’m sorry. I’m <em>sorry</em>,” his voice breaking, and Harry put his arms round him, and Draco buried his head against his shoulder and wept.</p>\n<p>#</p>\n<p>The night-shift team got there soon after, with the emergency healer; she saw to Draco’s injuries, although she said there would probably be some scarring. The rest of the team went after the Fury’s trail, and they reported in an hour later: they’d found the summoner dead in Malstoke, a woman alone in a run-down cottage with photographs of the husband and child she’d lost, lying in a summoning circle made of lumps of turquoise, with her heart torn out of her chest.</p>\n<p>“What was the address?” Draco asked, and after Harry told it to him, he was silent and then said, low, “I just sent her money. That’s how she bought the supplies,” and he got up and walked out of the room.</p>\n<p>The other Aurors packed up, carefully—there was still broken glass everywhere, it would be an ungodly time cleaning up the mess. “Reckon we can take care of the report, Harry,” Hodges said to him. “Although I’m sure the research people are going to want to grill you all day tomorrow.”</p>\n<p>“Yeah,” Harry said, and after they’d all gone, he went upstairs looking for Draco. He found him in a bedroom at the front of the house, its windows still intact, just standing by them looking out towards the gates and the woods beyond.</p>\n<p>“I’d give you back your cloak,” Draco said, a little dully, “but I’m afraid I put it down somewhere, and now I don’t know where I left it.”</p>\n<p>“It’s all right,” Harry said. “It’ll turn up sometime.”</p>\n<p>“I don’t think it <em>will</em>, actually,” Draco said dryly.</p>\n<p>“That’s all right, too,” Harry said. “I’m glad you’re okay.” And he <em>was</em> glad, he was almost desperately glad that Draco had made it; he’d had one awful sickening moment of thinking what if he’d come later, what if he’d said <em>no, give it back to me</em> in the carriage three days ago, and Draco hadn’t had the cloak; if he’d walked in through the shattered doors and found Draco lying on the ground with his heart torn out of his chest, horror and agony written on his face in punishment for the war that should’ve been over.</p>\n<p>Draco didn’t say anything, then after a moment he huffed out a small laugh. “Do you know, I am too,” he said, and turned and looked at Harry, half-smiling, and Harry smiled back helplessly. He had a sudden vivid impulse to hug Draco again, properly this time, without the blood and tears and shaking, although he couldn’t actually imagine, <em>hugging</em> Draco Malfoy—Draco would probably think he’d lost his mind. Then Harry suddenly decided he didn’t care, and took a step in, and Draco did just stand there like a perplexed hatstand for a moment, but then he actually put his arms round Harry, too, and his hand curled round the back of Harry’s neck, and Harry gulped as a shiver ran over his skin.</p>\n<p>He turned his head, just a little—not enough that Draco couldn’t just ignore it, but Draco didn’t, and he didn’t stare at Harry, either; he didn’t say anything like <em>who’d have thought Harry Potter was gay?</em> or <em>I can’t believe this is happening to me</em> or even just <em>wow, really?</em> He only paused a moment, and then his hand tightened a bit, and he turned and fitted their lips together. His hand came up to cradle Harry’s cheek and he kissed him over and over, sweet lingering kisses, and Harry pulled him in even closer and wrapped his arms round Draco’s back.</p>\n<p>“I should probably be calling someone to come and fix my windows,” was all Draco said, breathlessly, as he broke away and reached up to tug open the collar of his shirt. “But really, fuck it all.” Harry laughed, joyful, and he grabbed his own shirt and pulled it off over his head.</p>\n<p>Draco caught him by the hips, pressing him backwards to the bed with kisses, and when they hit, he pushed Harry flat and nudged him to keep going. Harry heeled off his shoes and scooted himself up, and Draco climbed up after him and straddled his thighs, looking down at him almost curiously: <em>look what turned up in my bed, I wonder how it got here</em>. “I have no idea when I even started to <em>like</em> you,” he said, half accusingly, as he bent down and started nuzzling along Harry’s jaw, kissing him everywhere, stroking his hands over every part of him.</p>\n<p>Harry laughed. “I started liking <em>you</em> as soon as you stopped being a vicious bastard to me all the time,” he said, wonderingly, and gasped as Draco nipped at him in punishment. “Oh, fuck, <em>Draco</em>,” and Draco kissed his mouth again, hot and sweet, and pushed him back into the pillows.</p>\n<p>#</p>\n<p>Harry did have to spend the whole next day in with half a dozen deliriously happy people from the Research Division, and a sketch artist who covered almost an entire wall with illustrations of the Fury-Eleos with Harry’s best guidance. They got curry delivered for lunch and kept working, asking him endless questions and making him try to dredge up exactly what he’d said, the timing of when Draco had undertaken his fund—“It certainly would have had a thaumaturgical impact!” one excitable researcher told Harry gleefully, groping around the table for the pen that she’d stuck into her falling-down knot of hair. “The fact that the materials came from his own act of compassion—”</p>\n<p>“It wasn’t the compassion!” another one said. “It was the <em>remorse!</em> It was clearly an expression of remorse which triggered the—”</p>\n<p>“No! They’re spirits of <em>mercy!</em>” the first one said, and they went tearing off again into the debate.</p>\n<p>Harry thought he would just slip out of the room while they were all embroiled, but he’d barely taken half a dozen steps towards the door before the conversation suspended and all their heads swung round towards him. “You’re not <em>going</em>?” one of them said.</p>\n<p>“Er,” Harry said bemusedly, “Well, er, I think I’ve told you all I can, and I’m going out for dinner, actually…”</p>\n<p>They looked at the clock as if they were all surprised that it was half past six, and rather reluctantly conceded that yes, okay, he was allowed to go for the night and they couldn’t really stop him. “But if we do have any other questions…”</p>\n<p>“I’ll be in the office on Monday,” Harry said firmly.</p>\n<p>He walked home quickly. Draco was picking him up at half-past seven, and he’d given Harry strict orders to dress properly. “I’m taking you somewhere I can rely on the staff not to tolerate any interlopers more monstrous than a photographer for the society pages,” he’d said firmly. “Not that I’m not <em>prepared</em> to deal with any cretinous intruders as they deserve, but that’s hardly the mood I want you in when I take you home after.” He’d purred that last bit meaningfully, so Harry hadn’t exactly argued very hard or anything.</p>\n<p>It was late enough on a Friday that rush hour traffic had died down a bit, and no one came at him until just the end of Diagon Alley, when he heard someone come running up from behind him. “Harry! I mean, Mr. Potter!” she called, a bit breathlessly, and caught up to him. “Sorry—sorry, I hate to bother you, I just wanted to say—”</p>\n<p>And he almost said <em>well you are bothering me, so shove off,</em> but instead he stopped in the street and turned round and looked her straight in the face. She was a younger witch—vaguely familiar, actually; he thought she’d been a Ravenclaw seventh-year, when he’d first come to Hogwarts. “Look, I’m sorry, but I want a quiet walk home after work like anyone else, all right? Is this something really important?”</p>\n<p>She stopped, staring back at him like she’d only then noticed she was pushing herself on a stranger. “Oh—no, I’m—no, sorry,” she said, stifled, and promptly turned and darted right into the nearest shop.</p>\n<p>Harry blinked, and then he turned and kept going, a bit surprised but deeply relieved. The Voice Box was still in the freezer, which had been carefully chained up and carted away whole to Auror Headquarters this morning. They were still debating whether it was safe to try and open it. “Sorry we’ve got to take your freezer,” Ron had said to Draco, a bit dubiously.</p>\n<p>“I think I’ve come out of the bargain reasonably well,” Draco had drawled, and then he’d smirked at Harry and made him turn pink, just in time for Ron to notice, and then to notice also that Harry was still there at the Manor, for no apparent reason.</p>\n<p>“Er,” Ron had said to him, as they were leaving, “weren’t…weren’t you wearing those clothes yesterday?”</p>\n<p>“Was I?” Harry had said, trying valiantly not to turn more red. “Look, I’d better get going, they want me down in Research,” but he was seeing Ron and Hermione Sunday, so he was going to have to come clean then. He didn’t really mind. He knew they were going to give him a hard time, but it was only going to last until they saw he was—happy, no matter how improbably.</p>\n<p>“Am I up to standard?” he asked, when Draco came in to get him.</p>\n<p>“Hmm,” Draco said, and promptly subjected him to what Harry felt was either an excessively or insufficiently thorough examination, which involved looking him all over and also for some reason checking just how snug his waist was and running his hands over Harry’s arms. “I suppose you’ll do,” Draco finally allowed.</p>\n<p>“Are you sure?” Harry said wistfully. “You could, um. Look a bit more closely.”</p>\n<p>“Oh, I mean to,” Draco said, and kissed him.</p>\n<p># End</p>"
}