{
  "id": "6668308",
  "url": "https://archiveofourown.org/works/6668308?view_full_work=true",
  "author": [
    "birdsofshore"
  ],
  "title": "Higher and Higher (Temptation)",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Draco Malfoy/Harry Potter"
  ],
  "characters": [
    "Harry Potter",
    "Draco Malfoy",
    "Hermione Granger",
    "Theodore Nott"
  ],
  "additional_tags": [
    "Dom/sub Undertones",
    "Collars",
    "Kneeling",
    "Auror Harry Potter",
    "Curse Breaker Draco Malfoy",
    "Ministry of Magic",
    "Injury Recovery",
    "Curse Breaking",
    "Moral Dilemmas",
    "Anal Sex",
    "themes of consent",
    "HP: EWE",
    "Post-Deathly Hallows",
    "Unresolved Sexual Tension",
    "Resolved Sexual Tension",
    "All of the sexual tension",
    "Pining",
    "Flirting"
  ],
  "language": "English",
  "series": "",
  "published": "2016-04-26",
  "completed": null,
  "words": "28,482",
  "chapters": "1/1",
  "comments": "471",
  "kudos": "13,458",
  "bookmarks": "2,991",
  "hits": "231,237",
  "summary": "<p>Only Harry Potter could manage to put on a magical collar on impulse and find himself unable to take it off again. Now following Draco’s direct orders gives him intense pleasure, and Draco has a whole heap of troubles to deal with, not least the way Potter looks when the collar has him gasping with bliss. The whole situation would test the morals of a saint... and Draco’s no saint.</p>",
  "notes": "<p>Many thanks to lomonaaeren for a prompt that nearly broke my brain. Writing a long and smutty fic for a fest was not really how I planned to spend my spare time over the last six weeks, but her wickedly-good scenario would not be denied.</p>\n<p>Thank you so much to my wonderful beta for her endless stores of patience and smart advice. Thank you also to the mods for their generosity with extensions, and for running this fantastic fest.</p>\n<p>Title is from <i>Temptation</i> by Heaven 17.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Comments are love, either here or <a href=\"http://dracotops-harry.livejournal.com/322066.html\" rel=\"nofollow\">at LiveJournal</a> ♥</p>",
  "text": "<p>“So, are you doing anything interesting tonight?”</p>\n<p><em>This</em> is why my heart sank when I saw I was paired with Auror Potter again today. The constant bloody interruptions.</p>\n<p>“Not particularly.” I screw up my eye more firmly to hold the small Cognoscope eyepiece in place. The horned skull on the desk in front of me seems harmless enough, but there's no way I'm going to touch it before I've checked it over completely.</p>\n<p>Potter brushes my arm as he leans across the desk to get a better look. “Nasty little thing. Is it real?”</p>\n<p>“Yes.” I squint at it. “Probably a Grindylow’s.”</p>\n<p>“Would that be used for Dark magic?”</p>\n<p>This house belonged to Irving Lafarge, founder of the neo-Death Eater group Nox Anima, and I can guess all too clearly at the kind of things that happened here before Lafarge went on the run. I and my fellow Curse-Breakers will be working here in shifts all week, I’d imagine - probably longer. “If you’ll stop talking, I can do my job and find out,” I tell Potter.</p>\n<p>He falls silent, but his mere presence is a distraction. He parks his backside on the desk, clearly intending to watch me work. It shouldn’t be a problem - wouldn’t be, with anyone else - but Potter is a special case. Being close to him… it’s just unsettling. Like an itch under the skin. It used to be an urge to push him up against a wall and wipe the cocky grin from his face. It’s now a little more than that, but… well. There’s little point in dwelling on it.</p>\n<p>I can feel his eyes resting on me. I don’t know what it is that he expects to see. “Haven’t you got anything better to do?” I say, irritation apparent in my voice.</p>\n<p>“Not really.” When I look up, he’s smiling at me again, though it falters when he sees my expression. “I checked all the rooms as soon as we came in. There’s no-one left here; Lafarge must have been tipped off.” Potter’s face shows the distaste he feels for the name. “He was long gone by the time the Aurors came in, and last week’s raid cleared the rest of them out. I’ve warded the whole place nice and tightly. Now I’m just here to provide back-up if anything nasty jumps out at you.”</p>\n<p>I grit my teeth and turn my attention back to the skull. The spell to reveal magical traces is so familiar I can perform it wordlessly. As I thought - nothing except the merest glimmer of pale pink, indicating magic has been used in the vicinity... but only at normal levels, and nothing to interest us. I flick my wand over it, leaving a glowing seal bearing the initials <em>DM</em> to show that I’ve checked it.</p>\n<p>“You’re very thorough,” Potter observes softly.</p>\n<p>I don’t answer, just move on to an inkwell which looks like it’s carved from jade.</p>\n<p>“I was working with Breaker Marchant yesterday and he doesn’t check half of the stuff that you do.”</p>\n<p>I can’t tell if he’s mocking me or not and it makes my shoulders stiffen with irritation. “Yes, well, if he wants to take early retirement because he’s lost an arm...”</p>\n<p>Potter looks thoughtful. “Now you mention it, there was a fire last week at a site he was working on.”</p>\n<p>I snort. “There you are, then.”</p>\n<p>“It livened things up a bit.”</p>\n<p>I turn my attention back to the inkwell. There’s a mild Jinx on it, probably to deter thieves, and I disarm it with a couple of passes of my wand. “I prefer to keep all of my fingers, thank you.”</p>\n<p>He falls silent and when I glance at him again, he’s staring at my hands with a oddly intent gaze. “Yep. I see your point.”</p>\n<p>“Potter.” There’s a tension at my temples and I fight the urge to massage it away. “I really can’t work with you sitting there breathing all over me.”</p>\n<p>He frowns, his dark eyebrows pulling together. “Right.”</p>\n<p>“Bugger off for a bit, will you? Go and check the attic for Boggarts, or something.”</p>\n<p>A smile pulls at his mouth. “You’re scared of Boggarts?”</p>\n<p>“<em>Potter</em>.” I don’t know what it is about him which gets me so riled up. Sometimes I think he does it on purpose to annoy me. Sometimes I think perhaps he knows that I feel the way I do, that he finds this amusing...</p>\n<p>He looks disappointed, then summons up the smile again. I suppose he’s learned that charm will usually get him what he wants. “OK. Just scream if that inkwell bites you, then.”</p>\n<p>I keep my eyes fixed on my work as he walks away.</p>\n<p>I’ve given the inkwell, a pair of gloves, and tattered book of poetry a clean bill of health, and am just securing the eyepiece more firmly to examine a small black dagger when his voice comes from the other room.</p>\n<p>“Malfoy.”</p>\n<p>It doesn’t sound anything urgent. I cast the revealing spell, and squint carefully at the results.</p>\n<p>“Malfoy.”</p>\n<p>“Mmm?” Now <em>this</em> is more like it. There's a distinct flicker of indigo in the magical traces around the handle. Remnants of Dark magic, without a doubt. Could be the imprint of someone who used it frequently. Or possibly some kind of curse. If so, it <em>looks</em> like it's all but faded away, but I can’t be sure, until—</p>\n<p>His voice calls again. “Come and see this.”</p>\n<p>“I'm busy.” I wonder about using a Levitation charm so I can examine the other side of the blade. Possibly too risky.</p>\n<p>“Found something weird.”</p>\n<p>I lower my wand. “Potter, everything in here is weird.”</p>\n<p>“Come and look.”</p>\n<p>I snatch the eyepiece from my eye and stash it back in my waistcoat pocket. Why can’t he just do his blasted job and guard the place? He’s not here to satisfy his childish curiosity about the contents. However, I know from experience that ignoring him is pointless. He's as stubborn as a troll.</p>\n<p>He's crouching in a dusty corner of what must have been the library, his head bent over something silvery lying in a flat wooden box. I look over his shoulder. It's certainly unusual – like a loop of liquid metal, not quite fixed in shape, which gleams against the black velvet lining the box.</p>\n<p>“Did you open that box?” I ask curtly.</p>\n<p>“Yeah.”</p>\n<p>“You're not meant to be poking around in here. They don't send Breakers in to these places for a laugh, you know.”</p>\n<p>“I know, but this caught my eye and...” He looks up at me, as if seeking my approval. “I really wanted to see what was inside.” He shrugs.</p>\n<p>Only Potter would be so infuriatingly arrogant. “Don't touch anything else,” I tell him.</p>\n<p>“OK,” he says, his attention already back on the silvery thing. There is something rather fascinating about it, the way it stirs in the box, looking almost alive. I imagine I can feel a sort of humming in the room, and I'm not sure if it's coming from the thing, or—</p>\n<p>Potter pokes at it with his wand, and I flinch, and then feel foolish when nothing happens.</p>\n<p>“Steady on, Malfoy.”</p>\n<p>I don't know why I even react; he only does it to wind me up. Well, if he wants to get himself Hexed, that's his look-out. But I'll wager I'd be the one to get the blame back at the Ministry. “Stop dicking about, can't you?” I tell him. “I've got work to do.”</p>\n<p>He peers closer at it. “Wait though. I've got this hunch that it's a collar. See that clasp there?”</p>\n<p>“How could anyone wear something that squirms around like that? Leave it where you found it and I'll take a look at it later.” I turn to go, but from the corner of my eye I see a flash of silver, and when I look round, the damn thing is in Potter's hands, like a fine rope of shimmering silk.</p>\n<p>“What the hell are you doing?”</p>\n<p>“Showing you I'm right.”</p>\n<p>“Don't— Potter! Fuck's sake—”</p>\n<p>But he already has it looped around his neck. It settles neatly into a circle as soon as it touches his skin. “There. I told you.”</p>\n<p>“Merlin! Take it off!”</p>\n<p>“Wow. It feels kind of...” His fingers trail across it. “It actually fits really nicely.”</p>\n<p>He stands up, and I can see the silvery coil shiver and then lie still against his skin.</p>\n<p>“Take it off. Now.”</p>\n<p>“Calm down. No need to have a pole up your arse about everything.” But his hands move to the back of his neck, seeking out the clasp. He takes so long, I have to resist the urge to knock his clumsy hands aside.</p>\n<p>“Can't find the... Malfoy? Could you look?” He turns his back to me, pulls the fabric of his tunic down to expose the messy hair at the nape of his neck and the band of metal now lying flush and still against his skin.</p>\n<p>There's no fastening at all. It's seamless, all the way around. I feel a cold throb of panic in my chest. I check in case it's got twisted around to the front, but— “The clasp's not there.”</p>\n<p>“What?” He twists his neck around, feels with his thick fingers again. His eyes dart to mine, then he pulls at the collar, trying to loosen it. “Shit.”</p>\n<p>“What the fuck have you done, Potter?”</p>\n<p>“I— There was a fastening. Like a catch. It was so easy to put on.” He yanks at it, and I see the band dig into his throat.</p>\n<p>“Stop that.”</p>\n<p>He yanks again. It's not shifting, and his throat is getting red, and if he gets hurt in here, <em>I'm</em> the one who'll answer for it— “<em>Stop</em>!”</p>\n<p>His fingers fall away and then – fucking hell – his face changes. “<em>Uhh</em>.” His eyes shut, and his mouth opens, but only a tortured exhalation comes out. “<em>Uhhhhhh</em>.”</p>\n<p>“What is it? Are you hurt?” I try the first counter-curse that comes into my head, but the odds of guessing the right one are pathetically low.</p>\n<p>Potter's eyes open again and he blinks at me. He looks more surprised than scared. His fingers seek out the collar again.</p>\n<p>“Don't touch it,” I snap, and he brings his hand down to his side, but then he's gasping, eyes closed, and I see a fresh shudder run through him. <em>Fuck</em>. We need to get help. There’ll be an investigation, and I knew this would happen, I knew trying to work with Potter was the worst kind of madness. He’s undisciplined - unpredictable - and I can’t keep a clear head when he’s around at the best of times...</p>\n<p>The spasm seems to pass, and he opens his eyes, wide. “<em>Shit</em>.”</p>\n<p>“What was it?”</p>\n<p>He just shakes his head. “I don't know.”</p>\n<p>Merlin. Maybe I can just get the thing off his neck. “Stand still.”</p>\n<p>He does, but then he's shuddering again, one arm groping out towards the wall for support, and, god, the groan that comes from his mouth... it's a strange, breathy thing, and it scares me.</p>\n<p>I aim my wand at his throat. The collar encircles it, taunting me. “Don't move,” I tell him, and almost as soon as I speak, the fucking thing shimmers, iridescent colours playing over its surface. Potter <em>moans</em>, and I don't dare cast, not while he's in the throes of it, his hand clenching against the wall as if he can hardly stay upright. As soon as it seems to fade away, I'm channeling my magic in readiness, and then more broken sounds come from Potter's throat and I realise he's laughing.</p>\n<p>Merlin. Is the thing sending him mad?</p>\n<p>“Oh, hell.” He rubs a hand across his face. “This is really fucked up.”</p>\n<p>“Where does it hurt?”</p>\n<p>He looks at me, flushed and surprised. “It doesn't <em>hurt</em>.”</p>\n<p>I lower my wand slightly. “But...”</p>\n<p>He looks a little crazed around the eyes. His fingers twitch towards the collar again, as if he can't resist.</p>\n<p>“Leave the bloody thing <em>alone</em>,” I snap, and his hand flies away as if burned. Then his eyes close, and he leans back against the wall, and I watch, horror and curiosity mingling inside me, as he pants his way through the latest bout.</p>\n<p>“It—<em>ahhh</em>— doesn't hurt at all,” he says breathlessly, and his eyes open and latch onto mine, as green as glass. “It feels fucking incredible, Malfoy.”</p>\n<p>The words jolt through me. Potter sinks down onto the ground, breathing hard. “Oh, god,” he says, an odd smile on his face.</p>\n<p>“It's every time you try to touch it,” I tell him.</p>\n<p>“No, no.” He wipes his face again. Sweat is beading on his top lip. “It's not that. I don’t know.”</p>\n<p>“We've got to get it off. It's dangerous.”</p>\n<p>“Yeah,” he says, but he sounds wistful.</p>\n<p>“Can you keep still while I look at it again?”</p>\n<p>“I think so,” he says. “It seems to have stopped, anyway.”</p>\n<p>I crouch down beside him warily. He's flushed and sort of loose-limbed, and I pull my eyes away and concentrate on the collar.</p>\n<p>“<em>Diffibulo</em>,” I try, the simplest Loosening Charm in the book, but nothing happens. I daren't try anything else without knowing something of the magic involved. “Can you breathe normally?” I ask him.</p>\n<p>He nods.</p>\n<p>“Turn your head,” I say, and as he does, his face contorts, eyes screwing shut.</p>\n<p>“Oh, god...” he moans. “Yes.”</p>\n<p>“What's happening?” I ask. “What does it feel like?”</p>\n<p>“<em>Uhhh</em>.”</p>\n<p>“Potter. Tell me.”</p>\n<p>“So good,” he moans, and then shudders deeply as another wave hits him. “<em>Uhhhh</em>, yes, yes. So good.”</p>\n<p>I can't do anything but stare for a moment. He looks... god, the way he looks. His face is so different like this. And just for a minute, no matter how I try, I can’t take my eyes off him.</p>\n<p>But then a wave of fury rises up in me. I'm going to get hauled through ten types of hell for this, there'll be a fucking enquiry for sure, and Potter's just sitting there, making noises like that, making those bloody faces, his hair sticking to his face, and his mouth hanging open in bliss.</p>\n<p>If only I could think straight. I'm still staring at Potter like a fool, and I haven't got the faintest clue what we're dealing with here. I'm going to have to take him in. I can just imagine the look on Head Curse-Breaker Rivett's face when I explain that my escort got cursed at the Lafarge house.</p>\n<p>“Can you stand up?” I ask him.</p>\n<p>“Yes,” he says, but he doesn't move, just smiles at me, a little spaced out, as if this whole thing is some kind of joke.</p>\n<p>“Merlin. Take my arm.”</p>\n<p>His hand wraps around my forearm and then he's making those noises again, high and breathy, his fingers gripping tightly through my robes, and it's far too distracting to Apparate, we'd be Splinched in an instant—</p>\n<p>I stare as the wave passes through him. “Malfoy... hell. Don’t talk any more.” He closes his eyes, his breath fast and shaky. “Just... shhh for a moment. Then, when I say <em>now</em>, Disapparate us straight away.”</p>\n<p>I watch as he gets control of his breathing. His hand on my arm is trembling slightly. “OK. Don’t speak,” he tells me, then takes a deep breath. “<em>Now</em>.”</p>\n<p align=\"left\">I can feel the heat from his body pressing against my side as the room squeezes impossibly tight around us and we whirl away into blackness.</p>\n<p align=\"center\">~***~</p>\n<p>“Describe to us again where you were when the collar became fixed around Auror Potter’s throat.” Auror Halston runs a finger down the side of her quill.</p>\n<p>I fight the urge to let my head sink into my hands. “I was with him in the library. He was in the far corner near the bookshelves, and I was near the door.”</p>\n<p>“And you claim he put it on entirely by his own choice?” Auror Weasley says, not even trying to hide the disbelief in his voice.</p>\n<p>“<em>Yes</em>. For god’s sake, I’ve gone through this already!” Heat is rising under my collar and I hope they don’t notice. I probably look guilty. I <em>feel</em> guilty, and I didn’t bloody do anything. “Why don’t you ask <em>him</em> why he did it?”</p>\n<p>“Auror Potter’s story corroborates yours, so far.” Halston looks at me steadily. “What we want to rule out is any outside influences at work. Do you have any contact with members of Nox Anima or their sympathisers?”</p>\n<p>“No I bloody don’t.”</p>\n<p>“Kindly keep your temper, Curse-Breaker Malfoy.”</p>\n<p>“It’s hard to keep my temper when I went through all this in great detail before I was accepted for training.”</p>\n<p>“It can’t be a surprise that someone with your background is always going to be… Well.” Halston shrugs as if it’s obvious.</p>\n<p>“Always going to be <em>what</em>, exactly?” I knew it. This has stirred up things that I hoped were dead and buried years ago, unease swirling cold and heavy in my stomach. And Weasley sits there looking as if my existence is a personal insult to him.</p>\n<p>“Look, I don’t know what you think I had to do with this,” I tell them. “I was just trying to do what I’m paid for. It was Potter who decided to play dress-up with the contents of Lafarge’s house, for god’s sake—”</p>\n<p>Weasley brings his fist down on the table. “Harry would never do something so stupid unless there was a reason.”</p>\n<p>“Oh, really? You find him to be someone who likes to follow the rules, do you? Stickler for procedure?”</p>\n<p>He just glares at me.</p>\n<p>“Yes, that’s it,” I continue. “Harry Potter, the voice of reason. Never one to rush in and make a complete fucking mess of things, just on a whim.”</p>\n<p>Weasley makes a low noise in his throat. “That’s enough, Malfoy.”</p>\n<p>“So, what’s it been, three or four hours, now? Have you got the bloody thing off him yet?”</p>\n<p>Halston flicks an uneasy glance at Weasley. “Not yet, no.”</p>\n<p>“Is he still having those... spasms all the time?” I feel an odd shiver at the thought of Potter’s body, racked with sensation. His face knotted into such unfamiliar expressions.</p>\n<p>“Luckily, he appears to be in perfect health,” she says.</p>\n<p>“If he’s fine, then what exactly is this about?”</p>\n<p>Halston leans forward. “As we don’t know the magical properties of the collar, Auror Potter could be vulnerable to attack for as long as he continues to wear it.”</p>\n<p>“Haven’t you got someone working on that?” A reminder that this is their problem, not mine, seems like a good move.</p>\n<p>“Of course we have.” Weasley’s face is a deeper shade of pink than usual. “We’ve got the best people possible on it.”</p>\n<p>“Breakers? Let me guess... Theo Nott?”</p>\n<p>Weasley grunts in agreement.</p>\n<p>“Who else?”</p>\n<p>“St Mungo’s are working with us. They’re monitoring any effects on Harry and looking for a solution.”</p>\n<p>“Hmm. Top people at St Mungo’s. Your wife, perhaps?”</p>\n<p>He nods, his face challenging me to say more, and I’d love to have an excuse to. But I’ve worked with Granger before and she is actually a bloody fine Healer. This wouldn’t be the first time she’d been brought in to sort out a cock-up that the Ministry couldn’t cope with.</p>\n<p>“Potter’s in good hands, then.” At least I sound confident.</p>\n<p>Halston taps her quill on the parchment in front of her. “If you don’t mind. Back to the report. What <em>exactly</em> were Auror Potter’s words when he first found the collar?”</p>\n<p>I sigh, and try not to think of Potter’s face, slick with sweat, in thrall to god knows what. I try not to pay attention to the little voice in my head whispering <em>it’s just as you feared. You have never really been trusted here at all</em>. Instead I answer the question and hope I describe everything in enough detail that this will be the end of it.</p>\n<p>~***~</p>\n<p>Over a week passes. I don’t get called back for further questioning, thank Merlin, and Weasley has to content himself with glowering at me whenever we pass in the Atrium. I hear Potter is in St Mungo’s for observation. Then word is that he’s back in the Auror department. Every time I’m sent out to a location I expect him to be assigned to work with me, but it always turns out to be Hennings or Patil or Varley instead.</p>\n<p>It’s not that I’m disappointed. I’m just interested in hearing whether or not they ever got to the bottom of it. But somehow it doesn’t seem like a good idea to be asking around.</p>\n<p>It’s Monday morning and I’m in the lab working on a bloody tricky counter-curse. I’ve got the cursed item - it’s a jewelled comb, the kind my mother might use to hold up an elaborate hairstyle - held in a network of Shield spells, and I’m attempting to discharge the first of the curses on it within this safety zone when there’s a knock at the door.</p>\n<p>I swear, loud and heartfelt. The sign on the door saying “Do Not Disturb - Extreme Danger of Death” is no joke. One wrong move and I’d be the posthumous subject of a beautifully tragic speech from the Minister. Luckily the worst that’s happened this time is that the Shield spells have got a little snarled up around one side.</p>\n<p>“Whoever that is, you can fuck right off!” I shout, carefully looping the strands of the spells back together and knotting them more tightly than before. I’m working on adding an extra layer for safety’s sake when the knock comes again, louder and more forceful than before.</p>\n<p>I place an ultra-strength Stasis Charm around the whole lot and fling open the door.</p>\n<p>It’s Potter.</p>\n<p>Of course it’s Potter.</p>\n<p>I step outside the lab and slam the door shut. “What the fucking hell do you want?”</p>\n<p>His jaw juts out mutinously. “To speak to you.”</p>\n<p>He’s wearing a high-collared tunic, but as he shifts on the spot I see a glint of silver beneath.</p>\n<p>I gesture towards the lab. “I’ve got a delightful little trinket in there, and I strongly suspect that the main curse on it is poised ready to splinter it into a million razor-sharp pieces that will lodge in my flesh.” I pause. “That’s just the main one, Potter. I don’t even know what the others might do. And you come and batter on the bloody door while I’ve got my wand pointing at it.”</p>\n<p>He has the grace to look a little abashed. “I... needed to talk to you. And this was the first chance I got.”</p>\n<p>“Well?”</p>\n<p>“I wanted to say... I’m sorry. If you got a load of shit about...” He reaches up and pulls the neckline of his tunic down, revealing the shining circle of the collar. It sits so snugly around his neck, close to his Adam’s apple.</p>\n<p>The sight of it seems to take the bite out of my anger. His throat looks so vulnerable, somehow. “They didn’t manage to get it off.”</p>\n<p>“Not yet. They’re still meant to be working on it, but honestly I think Robards is just hoping everyone will forget about it.”</p>\n<p>He straightens his tunic back up so it’s no longer visible, and I find myself staring at the spot where it was.</p>\n<p>“Do you... I mean, have you...?”</p>\n<p>“I haven’t had any more episodes, no.” His face is unusually serious.</p>\n<p>I clear my throat. “Well, that’s good.”</p>\n<p>He gives me a look that I can’t quite decipher, then nods. “I suppose so. Anyway. I am sorry. I imagine they questioned the living shit out of you.”</p>\n<p>I give a rather humourless smile. “Ten points to Gryffindor.”</p>\n<p>“Me too. Apparently no-one can accept the fact I just decided to put the bloody thing on.”</p>\n<p>Now I’m smirking. “I would have expected them to know you better than that.”</p>\n<p>A smile pulls at his lips. “Hah. Perhaps.”</p>\n<p>“So what have they tried?”</p>\n<p>“On the...?” He gestures to his throat again, and I nod.</p>\n<p>“Loads of things. I felt like one of those spiders Moody kept in a jar after all of the stuff they cast at me. Endless tests. Different spells. I was ready to Hex the lot of them by the end of it. But after about a week, when they couldn’t shift it, and they realised it doesn’t do me any harm anyway, I think they gave up.”</p>\n<p>It’s a discomfiting thought, knowing the collar is right there, next to his skin. That he’s walking around the Ministry wearing it… I wonder how many people know about it. I bet they’ve kept it pretty quiet.</p>\n<p>“Meanwhile, I’m on desk duty. They can’t risk letting me in the field in case... you know. <em>Unknown forces</em>.”</p>\n<p>My eyes flick to the closed door of my office, then back to Potter’s tunic, pulled high over his throat, hiding what I know lies beneath. “Do you want me to take a look at it?”</p>\n<p>His eyes widen for a moment. Then he pushes his glasses further up his nose. “Would you?”</p>\n<p>I’d be mad to try. They had Nott working on it. He’ll have exhausted every option already. And if word gets back to the Auror office that I’ve so much as cast <em>Accio</em> in Potter’s vicinity... well, I’ve no desire to be hauled in for questioning again.</p>\n<p>I find myself nodding. “If you like.”</p>\n<p>The surly expression has vanished now. “It’s funny... I don’t mind wearing it. You know, the feel of it. But I fucking hate being stuck behind a desk.” He looks around. “Where should we...?”</p>\n<p>It should be in the lab, really. But there’s that damned comb and the mess of Shield Spells, and I can easily lock the door to my office. Perhaps Potter is not the only one who can break the rules. “How about here?”</p>\n<p>He nods.\"OK.”</p>\n<p>I gesture to a seat and he sinks down into it while I perch on the desk next to him. “Can you...?” I mime loosening my shirt.</p>\n<p>He pulls the tunic down again, and there it is. There’s something compelling about the sight of it around his neck. The way it almost constricts his Adam’s apple.</p>\n<p>I draw my wand. “I need your hands well out of the way.”</p>\n<p>He frowns. “The neckline’s designed to stay up.” He lets go of the fabric, and just as he says, the tunic covers the collar again. “I guess I’d better take it off?”</p>\n<p>I suddenly remember that I haven’t locked the door yet. I flick my wand and there’s a satisfying click. “I suppose so,” I tell him.</p>\n<p>Potter takes hold of the hem of his tunic and pulls it over his head in one smooth motion, and something about it is so unexpected that I’m taken aback, just for a moment.</p>\n<p>It’s not that I’m prudish. It’s only that I don’t usually have men stripping off in my office on a Monday morning.</p>\n<p>I stand up abruptly and move to rummage in one of the desk drawers, turning my back on half-naked Potter. I might need the Cognoscope... there it is. I take a deep breath and turn around. Potter’s still sitting there, his tunic tossed onto the desk beside him. I can’t help my eyes flicking across his torso. There’s a lot more lean muscle than I’d imagined. The way those tunics are cut, they don’t give you much idea of what’s underneath. I guess I should have known to expect the dark hair which rings his nipples and trails lazily down—</p>\n<p>I tighten my grip on my wand. “Right.” I can’t meet his eyes for a moment. I need to concentrate, so I look at the collar instead. He swallows, and the collar moves along with the bobbing of his throat.</p>\n<p>I force myself to look him in the face, and it’s lit with hopefulness and I have to look away altogether. “Face that way,” I tell him, pointing to the door, and he turns, and then <em>oh fuck</em>, I see the first tremor of it begin and then a great wash of rapture hits him and ripples through his whole body. I see his stomach tighten and his fingers curl into fists. The <em>sound</em> he makes - it sears through me. His chest flushes, and his— <em>holy fuck</em>, his nipples are tightening and he’s gasping with it, and I feel my own body tremble, too. I should never have done it. I should have slammed the door in his bloody face as soon as I saw him. His eyes open and fix on me and his mouth is soft and open and amazed and, god, I’m so fucked.</p>\n<p>“Christ,” he says, and his voice is slightly hoarse. “I’d forgotten how good it was.”</p>\n<p>“Fuck! Don’t—!” I say, and there’s panic in my voice, because if something bad happens to Harry Potter right here in my office, with the door locked, I may never see anything beyond Azkaban’s four walls again.</p>\n<p>“Don’t what?” he asks, and there’s a hint of a smile to it, the bastard.</p>\n<p>“Don’t move. Don’t do <em>anything</em>,” I say, and he’s off again, as bad as the first time. He <em>groans</em> with it, and watching him is so intense that it’s as though I feel it right in my own core, reverberating through me. His chest and throat mottle with pink, he lets his head fall back and his face is twisted and blissful.</p>\n<p>“Oh, god, yes,” he croaks. “I knew it.”</p>\n<p>“Knew <em>what</em>?” I ask.</p>\n<p>“I can tell when it’s going to happen.”</p>\n<p>“How?”</p>\n<p>“The collar gets warm, and my skin kind of tingles.” He takes a shaky breath. “It's when you speak— no, that’s not it. Not every time, but when you tell me to do something. I feel it around my throat, at first, but it spreads out, and then...” He puts a hand up to his throat, touches his own skin tentatively. “And then...”</p>\n<p>“What?”</p>\n<p>His voice is low, but clear. “And then I really want to do what you say.”</p>\n<p>There’s a buzzing in my ears. What the fuck is this? Potter piles madness upon madness. But something inside me, something hungry, sits up straight as if it has scented fresh meat.</p>\n<p>“What the hell do you mean?” I ask.</p>\n<p>“I just... it feels like it would be a really good idea. I can’t explain it. Actually, I sort of can. Did you ever take Felix Felicis?”</p>\n<p>I shake my head.</p>\n<p>“Ah. Pity. It’s a bit like that. You just <em>know</em> that if you do such-and-such a thing, something brilliant is going to happen.”</p>\n<p>A terrible energy is swelling inside me. This isn’t right. Can’t be. Hell, I’m meant to be helping Potter, not feeling some gloating interest in the effects of the thing… “You feel forced to do it?”</p>\n<p>“No, not at all. It’s entirely my choice. But I’d be a fool to go against it when it feels this good.”</p>\n<p>I can’t quite take it in. Potter wants to do things when I tell him to. But— “You mean, it just happens with me? Nobody else?”</p>\n<p>He shakes his head. “Definitely not. Robards is a bossy fucker. I’d be like a bloody Flobberworm on the floor if this happened every time he gave me an order.”</p>\n<p>“Merlin.” Just me. The words thrum in my head. <em>Just me</em>. “Did you tell them about this when they questioned you?”</p>\n<p>“No. I wasn’t sure. I was a bit distracted at the time, you know, when we were in the house. “ He gives a little laugh. “I only really worked it out afterwards.”</p>\n<p>“I— I don’t believe it. You must be mistaken.”</p>\n<p>“Tell me to do something,” and his eyes flare with heat as he looks at me.</p>\n<p>“What?”</p>\n<p>“Tell me to do something. Anything. Just tell me.”</p>\n<p>“Potter. I can’t—”</p>\n<p>“Don’t you want to know? Don’t you want to know if I’m right? Come on, Malfoy.”</p>\n<p>My throat is so dry. I can’t think of a single thing to say.</p>\n<p>“I—”</p>\n<p>“Anything. Come on. Tell me— tell me to close my eyes.”</p>\n<p>I’m looking at him as if he’s dangerous. He<em> is</em> dangerous. I swallow hard. “Close your eyes.”</p>\n<p>His eyes flash at me, brilliant green, and then they flutter closed, and it’s almost instantaneous. First a low shaky sound pulls from his chest, and then he grips the edge of the desk, his knuckles turning white. “Oh, fucking hell, yes,” he moans. “Malfoy, oh god.”</p>\n<p>I don’t have a clue what to do. This is madness. Potter gets what looks like a rush of pure unadulterated bliss when he does what I say. <em>Anything</em> I say.</p>\n<p>“Put your hands on your head.”</p>\n<p>His hands are moving almost before I finish speaking. <em>Oh, fuck</em>. His hands reach his head and his body is bucking with it, his mouth hanging open, eyes closed, his stomach taut with what looks like waves of sensation. God help me. It’s true. Why the hell does this feel the way it does? I’m dizzy with it. The possibilities. Heat floods through me and something like the desire to laugh bubbles up inside, wicked and shameless.</p>\n<p>I look at Potter, his breathing fast and ragged, but returning to normal. My hands are shaking with a nauseous excitement, and suddenly I’m disgusted with myself. I remind myself exactly whose house the collar came from. Who would make such a thing? The kind of twisted sod who’d enjoy someone being in thrall to them against their will, that’s who. It’s like a bloody sickness - what kind of a bastard am I, to even think of <em>using</em> this?</p>\n<p>“I told you.” There’s the ghost of a sly smile on Potter’s face. “Do you believe me now?” He’s sitting there in the chair, looking— god, he looks pretty much like he’s been well-fucked.</p>\n<p>I wet my lips. “Yes.”</p>\n<p>“So, should we tell someone?”</p>\n<p>“No.” Shit. “Yes.” <em>Shit</em>. “I don’t know!”</p>\n<p>He grins. “Bit fucking weird, isn’t it?”</p>\n<p>How can he sit there and <em>laugh</em> about it? “Aren’t you worried?”</p>\n<p>“Not really. I’m pretty sure I can resist it if I want to. I just don’t want to. And...” He looks up at me. “You’re not going to use it against me.“</p>\n<p>He should know better than to be so trusting. It makes something squirm in my chest before anger rises up instead. “How can you be so sure?” I ask him sharply.</p>\n<p>“Well. Are you?” He looks stern, then, his brows pulled down.</p>\n<p>This is so screwed up. “I’m not going to use it at <em>all</em>.”</p>\n<p>If we disclose this to Robards, to my boss Rivett, everyone’s going to lose the fucking plot. Me, having power over Potter? Hell. At worst, it will confirm all of their suspicions. That I did this for some nefarious reason. I have to admit it looks unbelievably bad.</p>\n<p>The alternative: we say nothing. And go about our lives with the knowledge that I have some weird kind of power over Potter’s desires, which I can choose to use at any time.</p>\n<p>Salazar fucking Slytherin. How can I keep quiet about this? “We have to tell Robards.”</p>\n<p>Potter looks pretty unhappy at the mere thought. “More tests.”</p>\n<p>“More interrogations for me.”</p>\n<p>“Can’t we just... wait and see?” He waves a hand. “It might wear off.” He sees my sceptical expression. “Well. It could do!”</p>\n<p>“I suppose— They might yet find a way to break whatever enchantment’s been placed on the collar.” It sounds unlikely, even to my own ears.</p>\n<p>Potter nods. “Yeah. They might. They probably will, you know?”</p>\n<p>I look at him, taking in the beads of sweat at his temples, the flush at his throat. The lean strength of his body. God, he could tempt a man to do terrible things.</p>\n<p>“You know what we <em>should</em> do.” It feels intoxicating. Thinking about conspiring with Potter like this.</p>\n<p>He pulls a face. “Yeah, I know.” He shakes his head and a thick lock of hair falls across his forehead. “But how about we just give it a week and see?”</p>\n<p>I hesitate.</p>\n<p>“Just a week, Malfoy. We don’t have to be around each other during that time. Think about it - if I hadn’t turned up here this morning, we’d still be none the wiser.”</p>\n<p>My eyes narrow. “Why <em>did</em> you come here this morning?”</p>\n<p>His jaw juts out again. “To apologise. Remember?”</p>\n<p>I give him a hard look that he doesn’t seem entirely comfortable with.</p>\n<p>“OK. I admit... I did wonder.” He runs a hand through his hair. “I just... had a hunch about it.”</p>\n<p>“You and your fucking hunches!”</p>\n<p>The infuriating smile is twitching at his lips. “My hunches are usually spot on.”</p>\n<p>“Your hunches are going to get me thrown into Azkaban.”</p>\n<p>His face drops and his voice turns serious again. “I don’t want to get you into trouble, Malfoy. I’m just saying, why don’t we give it some time? Keep away from one another. They’re not going to assign us to work together again. Not after what happened.”</p>\n<p>He’s probably right. It makes a lot of sense. For both of us. So why is there a knot clenching in my stomach at the prospect? “All right. One week. And then...”</p>\n<p>“And then we’ll see,” he finishes for me.</p>\n<p>I can’t honestly think of a better alternative. My eyes flick down, unwilling, over his body again, past the neat dip of his navel to the V of muscle peeking above his waistband, and irritation flares inside me. “Put some clothes on, for god’s sake, man.”</p>\n<p>He frowns. “No need to get arsey.” As he reaches for his tunic, I realise what I’ve said.</p>\n<p>“Potter— no. You don’t have to—”</p>\n<p>But he’s already pulled the tunic over his head and is shivering with pleasure even as he pulls it down over his body. “<em>Ahhhh</em>.” He bites his lip, white teeth digging into the softness of it, and I force myself to look away. Not to watch him in this moment which feels so very intimate, no matter how much I’d like to.</p>\n<p>I don’t look back until he’s still again and I can hear his breathing slowing down. The collar is hidden once more, lying apparently innocent under the stiff fabric of his tunic.</p>\n<p>“I didn’t mean for that to happen,” I say quietly.</p>\n<p>“I know,” he says. “I— It’s OK.”</p>\n<p>After he’s gone, I sit at my desk, trying to regain the necessary focus to resume work in the lab again. Trying to stop thinking about what might have happened if instead of telling Potter to put some clothes <em>on</em>, I’d asked him to—</p>\n<p><em>No</em>. I close my eyes and dig my nails into my palm until my eyes prick with water and the images of Potter are replaced by red and black splotches of nothingness. Merlin, it’s been too damn long since I took anyone to my bed. That’s why this is affecting me so much. That’s why my mind is spinning lurid fantasies about someone who would never have the slightest interest in pursuing anything with me.</p>\n<p>That’s all it is.</p>\n<p>~***~</p>\n<p>It’s been a very long week indeed. They’ve decided I can be trusted to work on the contents of the Lafarge house again, but since the incident with Potter, the Ministry has deemed it too dangerous to work at the site itself. Instead, one item after another is transported under top-level security to my lab for me to deal with. The paperwork alone is horrendous, and there’s pressure to sift through the objects quickly in order to get the job completed. With this in mind, I would have been coming in early every day anyway. The fact that I want to make sure I arrive for work long before Potter usually shows his face in the Atrium is purely incidental.</p>\n<p>We don’t see one another. I don’t leave the lab for hours at a time, and seldom venture out of my office if I can avoid it. I wonder from time to time how he’s getting on. Whether they’ve pulled him back in for testing. I imagine him in one of their observation chambers, restless and irritable, the collar gleaming about his throat. Perhaps they’ve found a way to remove it by now. That’s the most likely thing.</p>\n<p>I can’t spare the time for a lunch break, but I’m sitting at my desk with a sandwich in one hand and a well-thumbed copy of Bardin’s <em>Heinous Curses</em> in the other when there’s a knock at the door.</p>\n<p>“Come,” I say irritably.</p>\n<p>Theo Nott’s head appears round the door. “Can you spare five minutes?”</p>\n<p>I slide an old memo into the book to keep my place. “Certainly, if you don’t mind me finishing my lunch while we talk.”</p>\n<p>He steps inside, looking at his pocket watch. “Rather late for lunch, isn’t it? I know they’re working us all ragged, but a man’s got to eat.”</p>\n<p>I tug at my hair distractedly. “The Lafarge house. Got something vile from there in the lab and I’m not sure where to go with it next. Some days I think it will never end.”</p>\n<p>He tilts his head. “The Lafarge house was what I wanted to speak to you about, actually.”</p>\n<p>“Yes?”</p>\n<p>“The Potter case. You know.” He gestures to his own throat and I feel something turn over in my stomach.</p>\n<p>“Mmm? Oh, that,” I say, sounding as if the subject doesn’t interest me in the least.</p>\n<p>“I can’t get anywhere with it. We can’t try half the stuff we’d like to because it’s around Potter’s precious neck. What is it - two weeks now? And they’re still furious that they can’t get the bloody thing off. They’ve had me and Hartnell working on it - even got some terrifying old witch over from Russia who’s meant to be the troll’s bollocks at working with Dark magic, and no-one can make so much as a dent in it.”</p>\n<p>I don’t know what my face is doing, but he gives me an odd look. “You were there, yes? When it happened.”</p>\n<p>I give a small grunt.</p>\n<p>“I know they’ve pumped you for information already, but... you don’t have any ideas for me, do you? Even some quite random detail might give us something to work on. You know, changes you noticed in the magical activity in the room, or any little thing Potter might have said at the time.”</p>\n<p>I push my plate away. The sandwich is stale anyway. “I don’t remember.”</p>\n<p>“Potter said he experienced some strange effects when he first wore it, but we haven’t been able to recreate those in tests at all. How did he look when he first put it on? Did you notice him getting overheated, perhaps, or did he go quiet, or—”</p>\n<p>“I really <em>don’t</em> remember, Nott.”</p>\n<p><em>There was sweat beading on his top lip, and he gasped with every shudder that ran through him. At first I thought he was in pain, can you imagine that? And then I realised that this was how he looked when he was lost in pleasure. Too far gone to even speak. He looked so fucking </em>carnal<em>, the way he gave himself over to it. And you know the thing I can’t stop thinking about? </em>I<em> did that to him. A few words from me is all it takes for that to happen.</em></p>\n<p>“I’m sorry I can’t help you.” I stand up abruptly. “I must get back to the lab now.</p>\n<p>There’s a crease at the top of Theo’s nose. “I see.” An awkwardness hangs in the air and I feel pretty sure he knows something is up. “Well, sorry to have bothered you,” is all that he says.</p>\n<p>“It’s not a problem.”</p>\n<p>He shuts the door behind him and I lock it with a flick of my wand. It’s <em>not</em> a problem. I’m fine as long as I don’t think about it. I open to page 170 of <em>Heinous Curses</em> and begin taking quick notes about how to distinguish the jay’s wing sheen of a Blood-Thinning Curse from the petrol-blue shimmer of a classic Entrail-Expeller.</p>\n<p>~***~</p>\n<p>Three o’clock on a Friday afternoon and I’ve already finished for the week. One of the advantages of starting work an hour or two early every day. Diagon Alley smells wonderfully fresh after the sulphurous curse-haze of my lab. It’s sunny enough to have me unbuttoning my robes as I walk over the cobblestones towards Scribbulus.</p>\n<p>And then, amongst the crowds, I see him. Looks like he’s on patrol with Weasley, the gold buttons on their scarlet tunics catching the sunlight. Potter’s eyes sweep left and right, scanning the crowds for signs of wrong-doing. He spots me long before Weasley does. He falters in his stride and almost stumbles until Weasley catches him by the elbow, frowning.</p>\n<p>I pause in the doorway of Twilfitt’s, the breath gone out of me for a moment. Weasley sees me, then, and treats me to a fine glare. Potter’s resumed his Auror stance – shoulders square, chin up – but there’s something dark and wild about his eyes as they meet mine.</p>\n<p><em>Oh, Potter</em>. There’s the briefest glint of silver at his throat as he passes and I must be half-crazed with exhaustion from the long week, because all I can think is that I could have him on his knees if I wanted to. Right here, in front of all of these people. Shivering, and moaning, and trembling at my feet.</p>\n<p>I clench my fists in my pockets as a great wave of desire batters at me. God, temptation is a terrible, cruel thing. Potter merely keeps walking until his scarlet uniform disappears into the crowds again. I stare, expressionless, at a display of hats in the window until the wayward drumbeat of my heart calms itself.</p>\n<p>~***~</p>\n<p>Elf-made wine is always worth the extra you pay for it. This vintage has a deliciously spicy afterglow, and I close my eyes and let it warm my throat, all the way down to my stomach. It’s mild enough this evening that I didn’t really need to light a fire, but the flickering at the hearth just adds to the sense of comfort and contentment I feel as I unbutton my robes and let my head fall back against the armchair. This promises to be the most relaxing evening I’ve had for a long time.</p>\n<p>A sudden jangling of the wards jars me upright. My first instinct is to ignore whichever mannerless bastard has turned up unannounced, but there’s a note of urgency to it.</p>\n<p>As I open the door, a flurry of wind blows in and there is Potter, on the doorstep, his hair ruffled and a snug woollen roll neck jumper covering his chest and throat.</p>\n<p>His smile is genuine and surprising but there’s something – a nervousness, a tightness – around his eyes. “Can I come in?”</p>\n<p>“Why?” I ask, as coldly as I can.</p>\n<p>“Need your help?” His voice lilts up at the end.</p>\n<p>I hesitate, looking him up and down. No cloak. His boots look like they’ve been hastily pulled on over his jeans, the laces all anyhow, as if coming here was a spur of the moment decision. Another gust of wind circles the street and tries to blow in at the door.</p>\n<p>I frown. “Come in, then.”</p>\n<p>I gesture to Potter to take the other armchair and we sit by the fire. It seems churlish to enjoy my wine without offering any to a guest, and god knows I do feel the need of another drink now. Potter smiles when I summon a glass for him and fill it near to the brim. “Cheers.” He tips his head back to drink and I see the rim of the collar peeking over the soft blue of his jumper, and the bob of his throat as he swallows.</p>\n<p>“So, what’s the problem?” I ask, rather curtly.</p>\n<p>He doesn’t meet my eyes, then, instead looking down at his lap. “Hmm. Maybe I shouldn’t have come.”</p>\n<p>“We agreed it was best to keep our distance.”</p>\n<p>He nods ruefully. “Yeah. That was a good plan. Except...”</p>\n<p>“Except what?”</p>\n<p>He pulls the neck of his jumper down, revealing the silver band. It seems to glow a little in the dim light. He meets my eyes again and holds them. “Except this.”</p>\n<p>“That’s nothing to do with me, Potter. Talk to Nott. Talk to Granger.”</p>\n<p>“They can’t help.”</p>\n<p>“Well, neither can I.”</p>\n<p>His eyes flicker with something I don’t recognise. “Ah, but you can.”</p>\n<p>I shift in my seat. I should never have let him in. “What do you mean?”</p>\n<p>“It keeps feeling... itchy.”</p>\n<p>I let my lip curl. “I’m not a skin Healer.”</p>\n<p>His mouth twitches briefly with amusement. “Not like that. Like... it wants something.”</p>\n<p>Merlin. There’s a flare of heat in my stomach, beyond the spice of the wine. “I don’t know what you’re talking about.”</p>\n<p>He reaches for his glass, takes a sip. His mouth glistens with wine for a second and then he swipes his tongue over his lip. “It— I can feel what it wants.” He takes another swallow of wine as if to give himself courage, then says, slowly, “It wants me to do things for you.”</p>\n<p>There is no conceivable answer to this, so I stay silent.</p>\n<p>He looks down at his lap again. “I was... hoping you could help me out a bit.” He glances up at me. “I know it sounds mad.”</p>\n<p>Everything feels slightly unreal. “Help you... how?”</p>\n<p>“Tell me to do stuff. You know, like before. Just... anything, really. It wouldn’t take much to keep it happy, I don’t think.” He looks so bloody hopeful, but all I can think of is him stripped to the waist and moaning. Here on the floor, before my fire.</p>\n<p>There’s a long pause, and then he’s on his feet. “No. Sorry. I shouldn’t have asked.” He’s not meeting my eye. “I’ll go.” He attempts an unconvincing grin. “I just thought you might be glad of the chance to get me to do your washing up, or something.”</p>\n<p>“I just don’t know if I can,” I blurt out.</p>\n<p>“No. Course not. I’ll leave you alone. Apologies.” He turns to go.</p>\n<p>“Potter.” I’m breathing hard as I stand up, and I think perhaps he is too.</p>\n<p>He turns to look at me. His eyes are so unguarded.</p>\n<p>I close mine for a moment. “It just... it would be wrong. To take advantage of you when you can’t help it.”</p>\n<p>He frowns. “When I can’t help it?”</p>\n<p>I gesture to the collar. “If I tell you to do something, and you’ve no choice about it.”</p>\n<p>He shakes his head. “No. No, that’s not how it is at all.”</p>\n<p>“But...”</p>\n<p>“I told you. It’s up to me whether I do what you say or not.”</p>\n<p>“You said that before.” I wave my hand impatiently. “But that’s not how it works, is it? You <em>always</em> do what I say.”</p>\n<p>“I don’t <em>have</em> to.”</p>\n<p>“Really,” I say, not hiding my scepticism.</p>\n<p>His jaw is jutting again. “Listen, Malfoy. I can shake off Imperius if I want to. This?” He touches the collar lightly. “This is nothing. Nobody makes me do something unless I agree.”</p>\n<p>“So you say.”</p>\n<p>His eyes flash. “OK, then. Try me.”</p>\n<p>“What?”</p>\n<p>“Try me. Tell me to do something.”</p>\n<p>“All right.”</p>\n<p>He looks so bloody cocksure, it would almost be a pleasure to prove him wrong.</p>\n<p>I wet my lips. Something simple would be best. “Are you ready?”</p>\n<p>He nods.</p>\n<p>“Then sit down.”</p>\n<p>He doesn’t move, but almost immediately, I notice a tension in his body. As if he’s having to check himself. I don’t say anything. Potter just stands there, but after a minute, I can see he’s gritting his teeth.</p>\n<p>“See?” he says.</p>\n<p>I’m not letting him off that easily. “I said, <em>sit down</em>.”</p>\n<p>This time, he lets out a small unhappy sound. There’s a vein pulsing at his temple. I keep my eyes fixed on him.</p>\n<p>“<em>Uh</em>,” he says after a few long moments. “OK, it’s actually harder than I was expecting.” He lets out a choked little laugh.</p>\n<p>“Want some more?” I ask.</p>\n<p>“All right,” he says, and I see him clench his fists at his side in readiness.</p>\n<p>“Potter. <em>Sit down</em>,” I tell him, and this time he looks as if it’s painful. There’s a trickle of sweat making its way down from his forehead. I watch, entranced. I can’t remember whether I want him to resist or not.</p>\n<p>He lets out a long, shaky breath. “I can do this. It’s just... I know how good it would be. That’s all. It makes it a little difficult. “ Again the little laugh. “Have you had enough, yet?”</p>\n<p>I’m not sure. Part of me wonders what would happen if I were to continue. I look at him, the tightness in his jaw, the strained look on his face. There’s something deeply fascinating about the whole process, the idea of him struggling against it. The thought of trying to break down his resistance, to— “Yes. Of course I have,” I tell him.</p>\n<p>“You admit I can resist it?”</p>\n<p>“Yes. But it wasn’t <em>nothing</em>, was it?”</p>\n<p>His smile is lopsided. “No. No, it wasn’t. But I did it. I win, right?”</p>\n<p>“Yes. You win.” I watch his body relax, watch him roll his shoulders to release the tension. “Now, sit down.”</p>\n<p>He begins to tense up again before I see him make the decision to let go. He sinks into the chair and then it’s as if the intensity of what’s flooding through him takes him by surprise. “<em>Ahhh</em>,” he moans, and his whole body seems to surrender to it, and, Merlin, it’s beautiful. His face is transported with it, each shiver that runs through him seeming to take him deeper, and I can’t take my eyes from him.</p>\n<p>It still feels wrong to be watching this. To collude with him in letting this happen. But for a brief time, I find that I can’t resist any more. I can’t resist <em>him</em>— not like this, not in this moment of blissful surrender. Something in me lets go, too, and it feels as inevitable as night after day.</p>\n<p>A log falls in the grate and the fire flares up, throwing intriguing patterns of light and shade over his face as the shivers start to subside. His eyes open again and fix on me, and he smiles, looking a little embarrassed. “Uh. Wow,” he says. He lets his head fall back again for a moment. “I still win, though, right?”</p>\n<p>This time I laugh as well. “Yes.”</p>\n<p>“That was... that was really good.”</p>\n<p>“I could tell.”</p>\n<p>“Malfoy... is this OK?” He lifts his head again to look at me. “I mean, oh, god.” He shakes his head. “I don’t want you to feel uncomfortable.”</p>\n<p>My palms are prickling with sweat.“I was uncomfortable about you having no choice about it.”</p>\n<p>“You don’t need to worry about that. Really.” He looks at me, his face serious, until I nod.</p>\n<p>“OK.”</p>\n<p>“But... you don’t have to do this, if... you know. You don’t have to do anything at all.” The firelight on his face is hypnotic.</p>\n<p>“I know. I can help you out. If you’re sure.” Merlin, what a hypocrite I am. Pretending it’s all for his benefit.</p>\n<p>He looks so serious, but also so hopeful. “Yes.”</p>\n<p>“Do you want me to...?”</p>\n<p>He inclines his head. “Yes.”</p>\n<p>I let out a long breath. “I just— I worry about what’s going to happen. If we do this.” <em>I worry about how I will feel</em>. But I can hardly say that. I can’t tell him that I’ll still be thinking about this, long after he’s gone, thinking about the way he looked and the way that it makes me want him...</p>\n<p>“You don’t have to worry,” he says quietly. “Just let it happen. If you want to.”</p>\n<p>I can’t think of what to say. “Stand up,” I say, and then realise my mistake as he starts to stand and has to hold onto the armchair for support as his legs shake. </p>\n<p>“<em>Uh</em>, fuck. Mmm. God.”</p>\n<p>I don’t wait for it to pass before I speak again. “Sit down.”</p>\n<p>His teeth dig into his lip as if to stop himself crying out, but a ragged sound still emerges. “Yesss...”</p>\n<p>This one lasts longer, and I’m dizzy just from watching him by the time it’s finished. “Do you want more?” I ask him.</p>\n<p>“Yes.” His head lolls against my armchair, and I’m glad he seems too out of it for the moment to notice the look on my face.</p>\n<p>“What should I tell you to do?”</p>\n<p>“Anything. It doesn’t matter.”</p>\n<p>Telling him to stand seems to make it unnecessarily hard for him. I can hardly think straight.</p>\n<p>“Just tell me to do it, Malfoy.” His eyes are so bright; I feel pinned by them. He speaks slowly, emphasising the words. “Anything you like.”</p>\n<p>I don’t know I’m going to say it until I hear the word come out of my mouth. It seems to come from a place I keep fairly well-buried, but there he is, eager and willing, and “<em>Kneel</em>,” I tell him. Just like that, he’s sliding onto the floor at my feet and groaning aloud, and I’m lost, I’m so fucking lost. His shoulders are shaking, and his head falls back, and it’s almost too much. He’s trembling, and making a low crooning sound, and I want to touch him, but I don’t.</p>\n<p>He takes a little while to open his eyes this time, and when he does, he looks... there’s something so grateful about his face that it kills me. “Uh. That was... well, uh. Thank you.”</p>\n<p>I don’t know why I do it. I’m sitting forward in the armchair now. “Come here,” I say, and he shuffles forwards on his knees until he’s between the V of my legs, groaning as he does. His mouth falls open, his eyes close, and for a moment I forget that it’s only the collar making him feel this way. For just a moment, it feels like it’s me that he wants, that he makes these sounds out of desire for me.</p>\n<p>My hand goes out to cup his jaw, and the scratch of his stubble against my palm makes sparks of heat jolt up my arm. I breathe in the scent of his arousal, and I’m drunk on it: Harry Potter, at my feet, incoherent with need. His breath hitches as he turns his face as if to brush his lips against my wrist, and I see the cursed collar at his throat, and I remember it’s just some fucked-up magic from the hand of Irving Lafarge. Of course Harry Potter doesn’t want Draco Malfoy. This isn’t <em>real</em>.</p>\n<p>I pull my hand away as if the touch of his skin has burned me. It takes him a minute to notice, lost in his own pleasure as he is. “Malfoy...” he murmurs. “God, don’t stop.”</p>\n<p>There’s a hot ache in my chest. He just craves more and more of what the collar can give him. His face is soft and open; I have no doubt I could take whatever I want from him, but, damn it, haven’t I got more self-respect than that?</p>\n<p>I pull away from him, from the seductive strength of his body, acquiescent at my feet.</p>\n<p>“Malfoy...” He croons my name, full of yearning.</p>\n<p>“No,” I say. It comes out far more harshly than I intended, and he flinches back. “That’s enough,” I tell him, and something in his stance becomes wary, as if expecting a blow.</p>\n<p>“You said it wouldn’t take much to fix it,” I say. “We’re finished now.”</p>\n<p>His eyes are still soft, but he turns them to the floor and then he nods. “OK.”</p>\n<p>He’s still down there, kneeling at my feet, and I want to tell him to get up, for god’s sake, but we both know what will happen if I do. Instead I get up myself and turn away, walk to the bookshelf with my hands stuffed into my pockets.</p>\n<p>There’s a rustling and then a cough from behind me. I turn my head and he’s on his feet, looking rather embarrassed.</p>\n<p>“Well, thanks, Malfoy.”</p>\n<p>I incline my head in acknowledgement.</p>\n<p>“I’m sorry to have disturbed your evening,” he says.</p>\n<p>“It’s nothing.” My mother used to tell me my tongue would turn black if I told lies. Merlin, mine must be as black as pitch.</p>\n<p>Potter’s face is guarded again, his brows pulled low. But his eyes still flick across my face as if searching for something.</p>\n<p>“Do you want to use the Floo?” I ask, but Potter shakes his head.</p>\n<p>“Think I’ll walk for a while. Clear my head.”</p>\n<p>I go with him to the door, then, when he’s on the step, the wind ruffling at his hair: “If you came again.” I stop myself there, not even sure what I’m about to say. “I mean... if it was necessary.” I hate the way even the thought of it sets heat roaring through me. “I understand.”</p>\n<p>Some emotion I can’t place crosses his face, but all he says is, “I’ll try not to bother you any more.”</p>\n<p>~***~</p>\n<p>Another week passes. Ten days. I go to work early. I deal with object after object. I eat lunch at my desk. I do my paperwork. I go home. I sleep. I go to work again. One night I go to a bar and buy drinks for a tall, rugged-faced stranger, but my heart’s not in it and I skulk off to the gents and Apparate home without saying goodbye.</p>\n<p>At home I toss and turn and not even a slow, thorough wank can relax me. The next day I’m tired enough to sleep through the alarm and wake to find my wand vibrating furiously on the bedside cabinet. It’s well after eight o’clock and I rush through my shower and breakfast to arrive at the Ministry a scant minute before nine. As I step out into the Atrium there’s a flash of red and I know without looking that it’s him. Twenty strides will take me to the fountain. His hair needs combing. I can’t see the collar. If it’s still there, it’s tucked safely under his tunic.</p>\n<p>Another twenty to the lifts. Potter stops to greet a witch wearing brilliant turquoise robes. His eyes crinkle at something she says, and I’m nearly past them when a movement catches my eye near the Welcome Desk. It’s just a brief scuffle, but then I feel the crackle of Dark magic. Working with curses all day, one gets sensitised to it. It’s only a flicker at first, but it makes my skin crawl. My wand is in my hand, and then I see it — a blue shimmer, streaking towards the fountain. Towards Potter.</p>\n<p>I cast a nice solid <em>Protego</em>, but it’s not going to be enough, and I’m yelling, too. “Potter! Get down!” My voice is harsh and urgent. He looks up, sees the flash of blue and, my god, his reflexes are stunning. He hits the floor, graceful and fast, and the curse flies over his head, slices through my Shield Charm and just keeps on going.</p>\n<p>Then all fucking chaos breaks loose.</p>\n<p>The curse hits the fountain. Potter’s on all fours on the floor. And he’s moaning, god, he’s moaning really <em>loud</em>, the sound echoing across the Atrium, and for a second I think the curse got him after all, but then I see his face, and the way his body arches, and I realise. He followed my fucking order. And now he’s reaping the rewards.</p>\n<p>Then one of the statues from the fountain wobbles and falls, crashing to the floor, and people are screaming. A tall, scrawny wizard by the Welcome Desk shouts “In the name of Nox Anima!” and then three Aurors have him in a Body Bind. It’s bedlam, but I don’t think anyone is hurt. I know it’s a fool’s response, but I can’t help myself: there is a ring of people gathered around Potter, and I push my way to the centre. I wonder who saw. Do all these people know? I have to fight a mad urge to turn and run. Potter’s rocking back on his knees, panting through the familiar aftermath of the collar’s thrall. He squints up at me and pulls what I think is intended to be a wry face. A sort of <em>Oh shit, what now?</em> face.</p>\n<p>Perhaps in the confusion, no-one noticed exactly what happened... There’s another creak from the statues and several people stagger back in alarm. Then I feel a tap on my shoulder. I turn to see Rivett behind me, his eyebrows drawn together.</p>\n<p>“My office. Immediately,” he says, and my heart slumps, sick and heavy in my chest.</p>\n<p>~***~</p>\n<p>I can’t face the questioning. I just can’t. It’s going to come out, and it’s just a matter of doing it in the way that’s least painful and mortifying. So I tell Rivett everything. Well, no. That’s not true. I don’t tell him about Potter’s little extracurricular visit to my house. I don’t tell him about the sheer fucking eroticism of having Potter shuddering when I speak.</p>\n<p>I give him... selected information. And Rivett hits the roof, just as I knew he would. How dare I withhold information from the Aurors? How dare I withhold information from <em>him</em>? And — almost worse — how could I <em>disappoint</em> him like this?</p>\n<p>After a while he calms down, of course. He rubs a hand across his face and closes his eyes for a moment.</p>\n<p>“Look at it this way.” He leans across the desk towards me, his face grim. “We have a young Curse-Breaker in the department. He used to be a Death Eater. Everyone knows this. But we stand by him, not least because he aces the aptitude tests. He checks out well enough under Occlumency, too. But he’s been out of training for less than a year when he goes to a Nox Anima stronghold with Harry fucking Potter. The two of them are alone there for a couple of hours, and when they come back, Potter’s got a magical collar around his neck which he says he “just felt like trying on\", and what it does — what it apparently does — is give him the thrill of his life when this particular Breaker gives him an order. And no fucker can get it off him.”</p>\n<p>I see his point, of course. In fact... for a moment I wonder if I did actually plant the collar there for Potter to find. Whether I might have influenced him to put the bloody thing on. Stranger things have happened. There was a Senior Breaker a couple of years ago, Jeremiah Falkirk. Never committed a crime in his life, upstanding moral character, all of that shit. He was working at a site — some seriously screwed up stuff there — and the next thing you know, he’s gone home from work and murdered his father and his sister. He couldn’t remember a thing afterwards, cried like a baby when he heard what he’d done. Salazar only knows what evil was in that place. The Ministry destroyed the whole site in the end and sealed the wreckage under a layer of spells; they couldn’t risk anyone else going in.</p>\n<p>“I... look.” I put my hand palm up on the desk and look Rivett in the eye. “I honestly don’t believe I had anything to do with it.”</p>\n<p>He shakes his head, his face sombre. “You don’t sound so sure as you did last time, Malfoy.”</p>\n<p>“I was just remembering Falkirk.”</p>\n<p>There’s silence as this sinks in. Falkirk’s still in the Janus Thickey ward, as far as I know.</p>\n<p>“OK,” says Rivett eventually. “But Robards is going to have my neck on the block for this. I implore you, Malfoy, if there’s anything else you’re keeping to yourself... don’t let me find out in front of a crowd of gawping quillpushers.”</p>\n<p>\n<em>No, nothing else. Only that something in Potter calls to me like a lodestone draws an iron nail.</em>\n</p>\n<p>“I won’t,” I tell him.</p>\n<p>He takes his glasses off and rubs the bridge of his nose. “Well. I don’t know what Robards and his lot will have in store for you. All I ask is that you co-operate fully.”</p>\n<p>“Of course,” I say tightly.</p>\n<p>“Honestly, Malfoy... I wouldn’t like to be in your shoes.\"</p>\n<p align=\"center\"> ~***~</p>\n<p>The uncomfortable prickle of monitoring spells hangs in the air. I look at Potter, trying to keep my face dispassionate. He’s sitting on a hospital bed, wearing loose white patient’s robes with bare feet and hairy calves sticking out of the bottom, and the collar glinting brazenly around his uncovered throat. Granger runs her wand a couple of inches above his legs in a slow, methodical motion.</p>\n<p>I can see how tense and restless he is from his the set of his shoulders, but he catches my eye and pulls a little face that I assume is meant to be conspiratorial. Granger’s too focused on her spellwork to notice, but Theo sees, his eyes darting from me to Potter with an appraising look. Granger’s results don’t satisfy her, judging by her frown, and she runs her wand back over a section of Potter’s spine again, and then again.</p>\n<p>Potter wrinkles his nose at me over her shoulder. “Sorry,” he mouths.</p>\n<p>Merlin. That disarming smile, that murmured <em>sorry</em>. How is Potter always so blasted heroic? We’ve been here for over half an hour while he gets layered up to the eyeballs in monitoring spells, though it’s clear that it’s hard for him to sit still, let alone submit to this boring and intrusive process. It’s painful to watch, frankly. But in the middle of all this, he’s still thinking about other people, the bloody fool.</p>\n<p>“I just can’t get the reading on your skeletal system,” Granger tells him. “Ah. Got it. Yes.” She makes a note and tucks the piece of parchment into Potter’s bulging medical file. I can’t deny I’m intrigued about what else is in there, but Granger takes out a quill — lime-green to match her robes — from her desk drawer and fiddles with it for a moment. She mutters a couple of phrases before leaving it poised over a long scroll of parchment, and after a moment it begins to move by itself. “Right.” Granger nods at Theo. “I’m done. The Medi-Quill will record Harry’s stats for us. Do you want to check that the shield spells have held before we begin?”</p>\n<p>Theo gestures with his wand, but it’s just for form’s sake. When he shields something, it stays shielded. “All in place.”</p>\n<p>“Good.” Granger rifles through Potter’s file before finding the sheet she’s looking for. Then she turns to me and takes a deep breath. “Well, Breaker Malfoy. We need you to try a few things for us today.”</p>\n<p>I can see tension shadowing Potter’s face. I try not to look at him.</p>\n<p>“We understand that Harry has been experiencing certain... effects since wearing the collar.”</p>\n<p>I nod.</p>\n<p>“And it appears to be connected to you. To your voice.”</p>\n<p>I nod again.</p>\n<p>“When this happens, do you yourself experience anything out of the ordinary?”</p>\n<p>I keep my face completely still.</p>\n<p>“For instance... do you have any unexpected physical symptoms?”</p>\n<p><em>Merlin’s balls</em>. Perhaps I can play for time. “Define <em>unexpected</em>.”</p>\n<p>She raises her eyebrows. “Ah. Perhaps you could describe the symptoms that you <em>do</em> have.”</p>\n<p><em>Damn</em>. “Well. It’s a little alarming, as I’m sure you can imagine.” I dodge.</p>\n<p>She shakes her head. “No, I’m not sure if I can. I haven’t seen it myself. But obviously that’s one of the things we’re hoping to observe today.”</p>\n<p><em>Fuck</em>. I knew it was coming, of course. But to hear it confirmed makes a cold squirm of discomfort twist in my stomach.</p>\n<p>“So I’d appreciate anything you can tell me,” she presses. “It could be important.”</p>\n<p>“I would say that it makes me rather anxious.” <em>That’s not the half of it</em>. “Potter looks as if he’s... ah, well. It’s hard to describe.” <em>He looks like he’s having the best sex of his life, actually, Granger. So you can put that on your little chart</em>. “But, yes. It makes me feel worried.”</p>\n<p>I can’t help glancing at Potter while she makes a note. He’s staring at a spot on the floor.</p>\n<p>Theo leans forward. “Would you say that you feel any connection with Potter while this is going on? Either mental or physical?”</p>\n<p>I don’t miss the quick glance that Potter gives me before returning his attention to the floor. “No.” <em>Just the intimacy that comes from watching someone have a really, really good time</em>.</p>\n<p>Granger turns back to Potter, quill in hand. “And you said that you get some warning that it’s about to begin? How far in advance would you say that is?”</p>\n<p>He shrugs. “A few seconds? It depends whether I go along with it straight away or not.”</p>\n<p>“Can you clarify that: <em>go along with it</em>? What does that entail?”</p>\n<p>Potter frowns at his own bare feet. I can see why. My god, even his toes are hairy. “First it feels warm. The collar, that is. Then the heat radiates out. The skin on my throat gets tingly, and then it starts to spread, and I get this really strong feeling that if I just do what Malfoy says...” His forehead creases. “Well. That it’s going to be amazing. So I do it.” The tiniest smile pulls at his mouth.</p>\n<p>Granger looks as if a bad smell has just wafted under her nose. “And what happens if he says something that you don’t want to do?”</p>\n<p>Potter brings his head up. “But he never does.” He looks as though he finds the question offensive.</p>\n<p>Granger gives him a long look, then writes some more, the quill moving rapidly along. “I’d like to do a basic reading on you, Malfoy, before we begin.”</p>\n<p>“Wonderful.” I don’t try to keep the sarcasm out of my voice.</p>\n<p>She puts the parchment down. “Are you taking any Potions?”</p>\n<p>“No.”</p>\n<p>“Any Spell Damage during the last twenty-eight days?”</p>\n<p>“I cut myself shaving yesterday. Is that the sort of thing you’re interested in?” I can see Potter smirk.</p>\n<p>“Any trouble with mood swings? Difficulty sleeping?”</p>\n<p><em>Yes, but it’s none of your business.</em> “No.”</p>\n<p>She approaches, wand in hand. “Just a light monitoring spell, if that’s all right with you.”</p>\n<p>I don’t ask what happens if it isn’t all right with me. Her magic rustles over my skin. It feels officious and I resist the urge to brush it away. I remind myself: she’s just doing her job.</p>\n<p>“Your heart rate is elevated.”</p>\n<p>I give a humourless smile. “Lime-green robes syndrome, I expect.”</p>\n<p>She doesn’t respond. “Temperature normal. Breathing... a little on the fast side. OK.” She makes an arc with her wand. “We’ll take those as a baseline for now, anyway.”</p>\n<p>Theo’s scribbling away in the scruffy notebook he carries everywhere, black spiderlegs scrawling across the pages. His face is so bored-looking, it gives no clue as to whether he’s making a note of my allegedly excitable heart rate or writing a shopping list for his supper.</p>\n<p>“I’d like to begin,” Granger tells Theo. “Can you stand by? In case...” She gestures towards the collar, in clear view around Potter’s neck. It glints as he shifts his head with a restless motion.</p>\n<p>“Of course.” The hand holding his wand looks relaxed, but his eyes are trained on Potter’s throat.</p>\n<p>“Harry. Tell us if you need to stop at any point. If you feel unfamiliar changes in the collar. Or if it physically becomes too much.”</p>\n<p>Potter’s eyes flick to mine. He looks... unsettled, would be the best word, but his jaw is set in a determined line.</p>\n<p>“Malfoy. Can you give Harry a simple instruction? For instance, tell him to raise his hand.”</p>\n<p>Theo lowers his wand for a moment. “It would be useful from my point of view to try a control first.”</p>\n<p>“Of course.” She turns to Potter. “Ready?” He nods. “Please raise your hand.”</p>\n<p>“Do you want me to actually do it, or...?”</p>\n<p>“Do you feel any urge to comply?” Granger asks him.</p>\n<p>He grins. “Only because you asked so nicely.”</p>\n<p>“Does it make a difference how Malfoy asks you?”</p>\n<p>“I don’t know.” His eyes flick to me again. “He’s usually a bit crosser than that, to be honest.”</p>\n<p>I stifle the urge to snort.</p>\n<p>“Raise your hand,” she tells Harry, more sharply this time. We all wait, but Potter doesn’t move. “Anything?” she asks him.</p>\n<p>“Not a thing. Sorry.”</p>\n<p>She looks at Theo. “Enough for the time being? OK. Malfoy. Could you please ask Harry the same question?”</p>\n<p>I curl my lip. “Politely, or...?”</p>\n<p>She makes an impatient gesture. “Just do what comes naturally.”</p>\n<p>Potter looks as if he wants to laugh again, but when I meet his eye, his face becomes serious.</p>\n<p>My mouth is so dry. I half expect Granger’s infernal monitoring spell to start chiming an alarm or something. I take a breath. “Raise your hand.”</p>\n<p>It doesn’t have a lot of conviction to it, but I can see straight away the effect it has on Potter. The collar seems to glimmer with pearly light, and his face softens to a look of rapt expectation, which rapidly takes on an edge of discomfort.</p>\n<p>“You didn’t say if you wanted me to obey or not,” he tells Granger, his voice a little breathless, and that word, <em>obey</em>... a long, delicious shiver slides eloquently down my spine.</p>\n<p>“Oh! Well.” Granger thinks about it. “Do you want to?”</p>\n<p>His lips twitch as if it’s a stupid question. “Of course.”</p>\n<p>“Go ahead, then.”</p>\n<p>His breath hitches even before I see the movement of his arm, as if just the anticipation of it brings him to the edge. His right hand lifts to his ear and his eyes close and he’s — god, I can see he’s trying to suppress it, but it still looks pretty powerful. His chest swells and his left hand clenches into a fist on his thigh. A soft, profound sigh escapes from his lips and his right hand falls back to his lap.</p>\n<p>Granger looks concerned, but she waits until Potter opens his eyes to speak. “Was that about normal?”</p>\n<p>He has that slightly sleepy look on his face. “A bit less than normal.”</p>\n<p>Theo scrawls a quick note. I crane my head but I can’t make out the words from this angle.</p>\n<p>“Are you all right to continue?” Granger asks.</p>\n<p>Potter’s eyes flick over to me. “Yes.”</p>\n<p>“Again, please, Malfoy. The same instruction.”</p>\n<p>“Raise your hand.” I say quickly. Perhaps we can get this over with. Perhaps it won’t be so bad.</p>\n<p>The collar shimmers, Potter’s hand lifts and this time it’s an outright moan that emerges from his mouth. I turn my eyes from him, but I can’t avoid seeing Theo’s eyebrows go up.</p>\n<p>“Again.” Granger is a frightful harridan.</p>\n<p>“Raise your hand.” If I say it quietly, perhaps Potter won’t hear, but it makes no difference. I don’t look at him. It’s enough to have his groans ringing in my ears. To see Granger’s pink, anxious face.</p>\n<p>“Potter.” Theo’s voice is clear and firm. “Describe what’s happening.”</p>\n<p>I risk a look. Potter’s eyelids are drooping, his face still semi-blissed out. “Uhhh.” He runs his tongue over dry lips. “Uh. Really good. Feels really good.”</p>\n<p>“In what way?” Granger asks.</p>\n<p>“In every way.” Potter smiles beatifically.</p>\n<p>“Is it the same every time?” Theo asks.</p>\n<p>“Hahhh.” Potter lets out a long breath. “Funny you should ask. It’s not quite as good this time. It’s not so good as when it’s just me and Malfoy.”</p>\n<p>I feel a rush of blood to my cheeks.</p>\n<p>“But it’s still pretty damn good,” Potter tells us all and, fuck, I could happily hex him right now.</p>\n<p>Theo’s trying to catch my eye but I can’t look at him. I know he’s taking in my flushed face. I wipe a hand over my forehead.</p>\n<p>“Why does it only happen with Malfoy?” Granger asks Theo.</p>\n<p>Theo wrinkles his nose. “Seems likely that it imprinted on him when Potter put the collar on. Draco just happened to be there. Unless...” He turns to Potter. “One question — purely in the interests of understanding how this works. Are you attracted to men or women?”</p>\n<p>It’s not as if I haven’t wondered about this myself. But I didn’t want to find out like this.</p>\n<p>“How is that relevant?” Granger asks.</p>\n<p>“I’d like to know whether Auror Potter usually associates this type of physical gratification with males or females.”</p>\n<p>Potter’s jaw juts. “Er. Both,” and a frisson of interest shivers across my skin.</p>\n<p>Theo makes a note. “Sometimes these spells are a bit choosy. Let’s see if it will work for me. Raise your hand, Potter.”</p>\n<p>We all watch, but Potter doesn’t react. “No.” Theo scribbles in his notebook again. “My guess is that it’s just Draco, then. Draco was the first person that Potter saw after he put the collar on.”</p>\n<p>Of course I was. There’s nothing more to this. There’s no genuine connection between us. I was just in the wrong place at the wrong fucking time, as usual.</p>\n<p>Granger is leaning over the Medi-Quill, and Merlin, I hope that thing’s not recording my heartrate as well. “Pulse 98 and falling. Are you OK to continue, Harry?”</p>\n<p>He nods, the traitor.</p>\n<p>“Can you describe where you feel the sensations?”</p>\n<p>Potter looks a little red in the face. “Uh. If you want.” His eyes dart to me before he continues. “Well, it starts around the collar, as I said. Like a rush of heat. And if I do what Malfoy says, it spreads... down to my chest, at first.” He shifts in his seat. “It’s hard to explain.</p>\n<p>“Would it help if you described it while it was happening?”</p>\n<p>He looks... fuck, he looks <em>shy</em>, and it makes something stutter inside me. “Uh, I can’t really talk much while it’s happening. You could probably tell that.”</p>\n<p>“The more information you can give us, the more likely we’ll be able to find a solution.”</p>\n<p>He squares his shoulders a little. “OK, it travels sort of everywhere. It feels warm at first, and then it’s like— It’s like pure, er, I don’t know. Like a pure essence of pleasure. I feel it everywhere. In my veins. My skin. Sometimes I feel it in my <em>hair</em>. He stops to snort at that. “It’s like a big wave of it. It feels like it’s crashing over me.”</p>\n<p>Theo whistles. “Where can I get something like this?”</p>\n<p>Potter smiles. “Yeah. Except, sometimes... “ His eyes stray across to mine again. “Sometimes it feels like I might not be able to bear it. Like it’s too much. Then it starts to ebb away. And afterwards... that feels pretty wonderful, too.” His eyes run over my face. I can feel a trickle of sweat in between my shoulder blades. And Potter’s eyes are full of heat, and such a vivid green behind his glasses, and—</p>\n<p>Granger clears her throat. “Right. I think we’ve got that covered. So. Resuming the test. Again, please, Breaker Malfoy. And this time, something different.”</p>\n<p>I feel a rush of annoyance. I’m not a performing Crup. “I can’t think of anything.”</p>\n<p>“Tell Potter to do something he doesn’t want to do,” suggests Theo.</p>\n<p>Several very inappropriate things instantly pop into my mind. “Like what?”</p>\n<p>Potter looks wary, as well he might.</p>\n<p>“Tell him to dance?” Granger suggests.</p>\n<p>“Oh, thanks a bunch.” Potter scowls at her.</p>\n<p>“No,” I say. “I’m not using this to humiliate him.”</p>\n<p>Potter looks at me, his eyes softening. “It’s OK, Malfoy. I can resist it. Remember?” he tells me quietly.</p>\n<p>“I’m still not doing it.”</p>\n<p>“You state that you can resist it.” Theo tells Potter. “But we only saw you do that for a few seconds. Are you sure?”</p>\n<p>“He can,” I tell him. “I’ve seen him do it.”</p>\n<p>Granger is flicking through his file with a pinched expression. “When did this happen? At the Lafarge house?”</p>\n<p>Potter and I exchange looks, but I don’t say anything.</p>\n<p>“It— There was another time,” Potter says. Something unspoken travels between him and Granger.</p>\n<p>There’s a silence. I can see Theo looking at me quizzically, but after another moment, Granger moves on. “OK. Look, tell Harry to get up and walk around. And Harry, you try to stay where you are.”</p>\n<p>Potter grips the edge of the bed in readiness, and then, when I speak, he closes his eyes tightly. “<em>Mmf</em>,” is the only sound he makes. I know I could ramp it up, really make him squirm, but I stay silent, and Granger, thank goodness, doesn’t prompt me to say anything more.</p>\n<p>“The collar’s moving,” Theo observes, and it’s true, it appears to be flexing, very subtly, around his neck, like a snake coiling, wrapping itself around a victim.</p>\n<p>“Does that hurt?” Granger asks.</p>\n<p>“Not— the collar’s not a problem. It’s just sort of… reminding me.” Potter grits his teeth for a moment. “It just feels – <em>uh</em> – rather uncomfortable. To ignore Malfoy.”</p>\n<p>“Pulse 108. Indicative of stress,” Granger notes. “Where? Where is the discomfort?”</p>\n<p>“It’s passing now. Give me a moment.” We watch him take a couple of deep breaths. “It was... around my temples. In my chest. And just... all over my skin. Like an itch.” He rubs at his arm. “It’s gone now.”</p>\n<p>“That lasted around a minute and a half,” Theo points out.</p>\n<p>“Do what he says again this time,\" Granger tells Potter. She turns to me. “Tell him to say something. Tell him to say your name.”</p>\n<p>I could tell him, “Say my name.” That’s what Granger means, and if I do, I’m sure Potter will oblige and say, “Malfoy,” for me, as easy as pie. But somehow... somehow, between my brain and my lips, the order translates into something different. “Say <em>Draco</em>,” I tell him.</p>\n<p>I regret it as soon as I’ve said it, but then that look, soft and happy and thrilled comes over his face again, that look of anticipation and delight, and “Draco,” he says, quiet and shy, the <em>O</em> sound lengthening into a moan, and he drops his head down, panting through it, his shoulders quivering beneath the thin hospital gown.</p>\n<p>“Pulse 112,” Granger says. “Again.”</p>\n<p>I won’t be so foolish twice. “Say my name,” I tell him, but the reply comes back, “Draco,” once more; this time, a breathy exhalation, his hands clenching in the bedsheet, his face contorted, eyes shut tight.</p>\n<p>“Merlin,” Theo says quietly to me, while Potter makes a low crooning sound. “He really gets off on this.” He sounds amused, the bastard, and I feel like throttling him. Nothing about this is funny, for god’s sake. Potter’s chest is heaving, and his hair is sticking to his face, and “117,” says Granger, and I could throttle her, too.</p>\n<p>Potter looks up, his eyes unfocused but still a brilliant green. “Do we have to—”</p>\n<p>“Again,” Granger says, but she sounds unsure.</p>\n<p>I do as she asks, the words flat on my lips. Potter, however, makes my name sound like poetry. He sighs it out, his voice shaking with pleasure. “Draco.” His whole body shudders and he says it again without prompting, “<em>Draco</em>.” His eyes open. Latch onto mine. I can’t swallow. Can’t breathe without an ache catching in my chest. Potter sounds <em>rapturous</em> and I think about how it might feel to hear him say it of his own free will. Somewhere quiet, private. Without Granger and Nott watching and gawping.</p>\n<p>Anger rises up in my throat, hot and fierce, at the thought of them seeing this, seeing Potter so exposed. How dare they watch him like this? And still Potter moans on, apparently beyond caring, past the point at which he can stop. “Oh, god. <em>Ahhhh</em>.”</p>\n<p>“I think that’s enough,” Granger says, her face screwed up. “129. Oh, Harry, stop now.”</p>\n<p>“How does that heart rate compare with someone having sex?” Theo asks, and I’ve changed my mind — throttling is too good for him. I concentrate instead on sending a wordless hex in his direction; I seem to remember a great one we used to use after lights out in the Slytherin dorm, but he just keeps talking. “I’m only curious, you understand,” he adds.</p>\n<p>Granger’s lips are pursed. “Let’s keep the questions professional, please.”</p>\n<p>Theo turns to wink at me and then, I don’t know, something about my appearance seems to catch his attention and I see his bloody appraising eye sweep over me. He takes in every inch of me, and even though I look away, I’m damned if I can hide all that I’m feeling.</p>\n<p>Granger is still frowning at her bloody chart, thank god, and hasn’t noticed a thing. Potter’s eyes are closed, his head hanging down. I stare determinedly at a poster on the wall. <em>Don’t Drink and Apparate. We treat dozens of Splinchings each year at St Mungo’s. Don’t be one of them!</em>. For a minute I think Theo will keep quiet and then he clears his throat, “I must say, seeing this in action certainly sheds new light on the matter.”</p>\n<p>Granger doesn’t look up. “Hmm?”</p>\n<p>“Oh, definitely.” Theo nods. “For instance, I didn’t realise it wasn’t just Potter who was affected.”</p>\n<p>Granger looks up. “Pardon?”</p>\n<p>Fuck. Potter’s looking half-stunned after his last bout with the collar. Perhaps he didn’t hear. I shoot a warning look at Theo. He should fucking watch his back. Having a psychopath in your house for a year, you learn a thing or two; I haven’t forgotten.</p>\n<p>“Oh, yes,” Theo continues airily. “You must have noticed. It’s having quite the effect on Draco, too.”</p>\n<p>“What?” Granger’s voice rises as she snaps her head back to look at the chart again. “107!”</p>\n<p>“Potter?” Theo arches an eyebrow.</p>\n<p>“No.” She points. “This line here is Malfoy. 107. That’s ridiculously high for someone just sitting in a chair.”</p>\n<p>Theo makes a note in his blasted book. Potter’s eyes are still closed. Oh, god, I pray he hasn’t heard. I consider blasting Granger’s scroll out of existence.</p>\n<p>Granger’s bending over to scrutinise it. “In fact, your pulse rate is all over the place, Malfoy — my god, look at this, Theo — his breathing, here and especially <em>here</em>, when Potter was in the middle of the worst of it, and... “</p>\n<p>Potter’s coming out of it, his eyes fluttering open. “I don’t want to do this any more,” he says, as firmly as he’s able, but Granger’s attention is all on me now, her wand arm extending towards me.</p>\n<p>“Malfoy. Let me just—”</p>\n<p>“No.” I bark it out and she flinches back. But I refuse to go along with this any more. Rivett can sack me if he wants to. I think of just walking out, but who knows what they’d find to do to Potter after I left.</p>\n<p>“Hermione,” Potter says, his voice stronger now. “I don’t want to do this.”</p>\n<p>Of course he doesn’t. He doesn’t want to sit here and say my name, pant it out like a lover would at a moment of ecstasy. He doesn’t want my voice to be the thing that makes his breath stutter, makes his face twist into that look of tortured sweetness.</p>\n<p>“Have you got your readings?” I snap.</p>\n<p>Granger and I both look at the scroll, the quill still moving of its own accord. “Yes.”</p>\n<p>“Then don’t you think you’ve done quite enough?”</p>\n<p>Granger looks taken aback. “I— Well, no. I need more time. It’s important that we understand—”</p>\n<p>“It’s important that you understand that Potter is not some specimen to be prodded and poked and made to perform.”</p>\n<p>She turns to Potter. “Harry. I know it’s a nuisance, but we need to—”</p>\n<p>I butt in. “I withdraw my consent for the tests. I don’t think you’ll get very far without me here to set him off, will you?”</p>\n<p>Theo’s watching, his eyes amused.</p>\n<p>“Harry needs you to co-operate.\" Granger smooths back a section of hair which has come loose. “We can’t get him out of this mess unless you work with us.”</p>\n<p>Potter speaks low and firm. “I’ve had enough of testing for today.”</p>\n<p>“Nott.” Granger looks at him for back-up. “We’ve hardly started—”</p>\n<p>Theo shrugs. “I’ve got quite a lot more to go on, now, as it happens. I’d say further observation might be useful in the future, but observing the collar in action was the main aspect of what I needed. If I could just go over the charts with you before I leave?”</p>\n<p>Granger waves a hand in exasperation. “Am I the only one who thinks it would be senseless to stop just when we’re—”</p>\n<p>I stand up. “I’m sure you’ll be signing Potter off for the rest of the day. I expect he could do with a break.”</p>\n<p>Potter puts up a hand. “I’ll be fine. Just give me a minute.”</p>\n<p>Granger seems to look at him properly for the first time; he looks confused and unhappy. She bites her lip. “Actually... he’s right, Harry. You may feel depleted. Some time to rest would be a good idea.”</p>\n<p>“All they let me do these days is sit at my desk anyway,” he says bitterly.</p>\n<p>“I insist,” she says, and another look passes between them before Potter gets to his feet.</p>\n<p>“Well. I’m pretty much desperate to get out of these robes,” he tells her.</p>\n<p>“Of course.” Granger says. “Hold still while I remove the monitoring spells.” She slashes her wand in the air a number of times. “You can get dressed next door.”</p>\n<p>As soon as Potter’s left, Granger speaks, low and insistent. “This is dangerous for him, Breaker Malfoy. These Curses can be very unpredictable. You have no idea what effects it’s having on his system, and I also need to check what’s going on with you while the collar is working on him. We had no clue you were affected by it too.”</p>\n<p>Theo looks up from his jottings. “Are your results definitely an effect of the collar, though?”</p>\n<p>“Well, what else would it be?” Granger asks.</p>\n<p>“Looked to me like Draco simply enjoys watching Potter when he’s—”</p>\n<p>“For fuck’s sake, Theo!” I snarl.</p>\n<p>His smirk is the most annoying thing I’ve ever seen. “Just a thought. And while we’re on the subject, Draco... have you and Potter ever...? “ His arched eyebrow finishes the question for him.</p>\n<p>Granger flushes again. “I thought we agreed to keep the questions professional?”</p>\n<p>“It’s highly relevant.” Theo twirls his quill between his fingers. “Now I’ve seen it in action, I suspect the collar was designed to be used between, well. Consenting couples.”</p>\n<p>Granger looks appalled. “Couples don’t use curses on one another!”</p>\n<p>“I’m not convinced now that it’s a curse at work at all. I never have been able to test it to my satisfaction, because it happens to be around Auror Potter’s throat.”</p>\n<p>“But that’s warped! What else could it be but a curse? Harry can’t take it off. He’s got no choice about how it affects him, and—”</p>\n<p>Theo narrows his eyes. “Consider this: would you say he seemed to be suffering while it was in use?”</p>\n<p>Granger draws a furious breath as if to speak, then seems to deflate suddenly. Instead she glares at Theo before turning back to the scroll of results, her shoulders stiff under her green robes.</p>\n<p>This seems the perfect moment to leave, but Theo taps his notebook with his quill.</p>\n<p>“So, Draco, you didn’t answer my question. Have you ever...?”</p>\n<p>I keep my face as expressionless as I can, ignore the heat I can feel around my cheeks. “Me and Potter?” I try to curl my lip a little. “You’re delusional.”</p>\n<p>Theo gives me that blasted appraising look before scratching another note, and I long to rip the book from his hands and tear it to pieces.</p>\n<p>The door opens and Potter walks in wearing his Auror uniform. He’s all buttoned up, his tunic pristine, his boots polished, but his hair looks like he’s just gone five rounds in a duel. “We’re finished?” he asks.</p>\n<p>“I have several more questions,” Granger tells him, but Potter just shakes his head.</p>\n<p>“Enough for today, Hermione.”</p>\n<p>As soon as we’re outside the door, Potter grimaces. “Fuck. That was... Well. Pretty bad. Thank you. For what you said about stopping.”</p>\n<p>I’m damned if I’ll let him see that I care about any of it. “Well. I’m sure this is not pleasant for you. I can see that.”</p>\n<p>He gives a little frown, then his expression changes. “Well, actually, there are compensations. In fact...” He hesitates, then tilts his chin up. “Do you have time for a drink? I appear to have the rest of the day to myself.” His smile is disarming. But still.</p>\n<p>“I have to—” I wave my arm. “Get back. To the Ministry.”</p>\n<p>He touches my arm lightly, just for a second. I can feel the warmth of his fingers through my robes. “I really wanted to ask you something.”</p>\n<p>He heard what they said. I knew it. He wasn’t that out of it. He probably saw my reactions, too. Fuck. <em>Fuck</em>. And it’s all there, on Granger’s scroll, and in Nott’s notebook, and they’ll get together and have a cosy chat about it, no doubt, and then—</p>\n<p>“I have to go.” I turn away.</p>\n<p>“Malfoy,” he calls, but I’m already walking, fast and unwavering, towards the stairs, and when I get there, I hurry down, taking them two at a time.</p>\n<p>~***~</p>\n<p>When the knock comes at the door, it’s not really a surprise. I’d be lying if I said I wasn’t half-expecting it. I could have gone out. I could have cloaked the door in an Imperturbable Charm and gone to bed. But I chose not to. I chose to be in, to leave the wards down low. To open a bottle of wine and drink enough of the way down it that my judgement is skewed, so that when I open the door and find Potter there, looking windswept and breathless, the air around him bristling with some weird energy, I step back and let him in without a word.</p>\n<p>He steps in and there’s not enough room in my hallway. He’s too close, too real, always too <em>much</em>.</p>\n<p>“What do you want?” I ask, and my voice sounds odd and parched.</p>\n<p>“I really need to talk to you, Malfoy,” he says, and he steps even closer, and I back away to the sitting room, watching him follow me, his shirt open at the throat and the collar winking at me all the way.</p>\n<p>I offer him a drink and refill my own glass. I throw the wine down my throat as if it will quench whatever’s inside me.</p>\n<p>“About today,” he begins.</p>\n<p>“No.” I run a hand over my face. “I don’t want to talk about it.”</p>\n<p>“I think we need to.” His eyebrows draw together. “It really fucking bothered me.”</p>\n<p>I pour more wine, splashing some on the table. “Did you come here just to tell me how repulsive this is for you?”</p>\n<p>He narrows his eyes. “What? No. Who said anything about repulsive?”</p>\n<p>“Well. Distasteful, then. I can imagine being bound to someone like this is bad enough. The fact that it’s me...” I don’t need to finish. The wine tastes suddenly sour, tainted by self-pity.</p>\n<p>“Malfoy. Stop being an arse. I saw how you reacted.”</p>\n<p>I can’t even look at him. Instead I look at a crystal vase on the mantelpiece. I could shatter it into a thousand shards with a word. It would be so easy.</p>\n<p>“Malfoy.” His voice is urgent. “God, haven’t you been thinking about it?”</p>\n<p>I let my voice drip with disdain. “About what?”</p>\n<p>“About this. <em>Us</em>. Fuck, I have.”</p>\n<p>I turn my head back. He’s leaning forward in the armchair. I don’t know how to describe the way he’s looking at me.</p>\n<p>“The reason today was so difficult was because I’ve thought about being like that with you.”</p>\n<p>“You’re not making the least bit of sense.” I’m dizzy. Too much bloody wine.</p>\n<p>“I’ve thought about saying your name that way. Merlin, yes. But I never wanted it to be like that. In a hospital room, with people watching us.” His hand makes a fist on his thigh. “God, I wish... I wish I’d come to you again sooner.”</p>\n<p>“Come to me... why?” My voice is tight with disbelief.</p>\n<p>“Come on, Malfoy. Think about it. What it would be like. Not just <em>sit down</em>, and <em>raise your hand</em>, and all that shit.” He drops his voice lower. “Can’t you think of anything else you’d rather have me do?”</p>\n<p>“I don’t know what you mean.” I want another drink.</p>\n<p>“Shit, Malfoy, if you want me to spell it out: I’d do anything you tell me.”</p>\n<p>I <em>desperately</em> want another drink, but my hands are shaking too much to pour it. “I would never take advantage,” I tell him. I wouldn’t. I <em>wouldn’t</em>.</p>\n<p>“Take advantage?” His face is fierce. “Hell, I want it. I’ve been <em>dreaming</em> of it.”</p>\n<p>“It’s wrong. The collar—”</p>\n<p>“Fuck the collar. I don’t care about that. I want this, Malfoy. I want to go down on my knees again for you.”</p>\n<p>My body responds with a shocking spike of arousal, and I’m pretty sure he sees.</p>\n<p>“I want you to fuck me, and I’m sick of pretending otherwise,” he says.</p>\n<p>The way he looks, sitting there, fizzing with need, his shirt tight across his chest, the cold metal glinting against his throat, and those words on his lips. He has no fucking idea how close he has me to losing control. A wave of fury rises up and I snarl the words out. “OK. You want it. Well, how about this? How about if I wanted you to do those things because you wanted <em>me</em>?” I feel my face twist in self-loathing. “Not because you want the thrills the collar brings you.”</p>\n<p>“You wanker. It’s you I want.”</p>\n<p>I grimace. “Yes, because when I speak, the collar—”</p>\n<p>“<em>No</em>, not that.” His voice is harsh with frustration. “I’ve wanted you for god knows how long. Why do you think I always swung it so that I could be your escort when you were working in the field?”</p>\n<p>“That was <em>you</em>?” This is beyond belief.</p>\n<p>“Of course. I sweet-talk Doris — the witch who does the rotas — almost daily. You’re such a hard nut to crack, though. All buttoned up, with your protocols and your paperwork, never any time for a little bit of banter...” A smile threatens to sneak across his face. “I’d decided you were immune to my attempts at bad flirting.”</p>\n<p>“Potter— you— you drive me fucking insane! Distracting me all of the time. We could both get killed, you imbecile!”</p>\n<p>And now he does smile, slow and heated. “Ah, Malfoy. Don’t you think danger can be a bit of a turn on?”</p>\n<p>There are no words.</p>\n<p>He leans forwards again. “Listen.” As if I could do anything else with him looking like that. Saying these things. “You know what they said? About how the collar connected with you because you happened to be there?”</p>\n<p>I nod.</p>\n<p>“But what if that wasn’t it? What if it was designed to bond with the person that the wearer desired most?”</p>\n<p>“You don’t know that.” This could all be part of the collar’s power. To make him think... to make him really <em>believe</em> that he’s attracted to me. That he has been for some time.</p>\n<p>“I don’t. But it could well be.” He shuts his eyes for a moment. “OK. This is the truth. Before this happened... “ He touches his throat and my eyes are drawn to the narrow band which encircles his neck so perfectly. “I was wondering whether I should have a bit of dignity and give up on you. But now...” He reaches for his wine and takes a draught, his tongue swiping across his top lip to catch a stray drop. “Can you honestly tell me that you’re not interested?”</p>\n<p>My mouth is so dry I’m not sure I can answer.</p>\n<p>“Tell me. Am I fooling myself about what I think I’ve seen? Tell me I am, and I’ll go.”</p>\n<p>My voice sounds like it’s cracked from disuse. “No.”</p>\n<p>His eyes are burning into me.</p>\n<p>“No, you’re not wrong,” I tell him.</p>\n<p>He scrambles across the few feet separating us so that he’s crouching on the floor in front of my chair. “Hell, Malfoy. <em>Draco</em>... please...”</p>\n<p>I can’t take any more. He’s at my feet, begging me, his face tilted up expectantly and his eyes blazing with heat. I kiss him, opening his lips with my tongue, and he groans into my mouth. My hands run over the muscles of his back, and I feel the heat of his body through his shirt. And I want him. I want him so badly. I want to have him right here, to throw him down on the floor and leave him in no doubt about how much I ache to possess him.</p>\n<p>“Uhh... please,” he murmurs. “Oh, god, tell me what you want.”</p>\n<p>I remember what he said before about the collar’s nagging demands. “It’s bothering you again?”</p>\n<p>“Not really. I just... uhh. It would be so good. Wouldn’t it? You know it would.”</p>\n<p>My imagination supplies the proof of this in vivid detail. Potter, naked and kneeling, my cock nudging between his lips. Potter, spread-eagled on my bed. On his stomach. His arse open and ready for me, his body shivering at my command, moaning with gratification every time I speak...</p>\n<p>I close my eyes at the intense wave of desire running through me. How can it hurt just to try? Just a little bit.</p>\n<p>He wants it so much.</p>\n<p>“Open your mouth,” I say, and before I can press my lips to his, he’s crying out, his body arching towards me, hands clenching in my robes. I kiss him, feel his body shake as the peak hits him and I go deeper, crushing my lips against him. The collar is pulsing between us like a living thing, reminding me of its power. Of <em>my</em> power. And he gasps and twitches in my arms and I forget to care about what is right.</p>\n<p>I let myself do what I want — and I want everything. I take my fill of his mouth until he’s too unsteady to kneel any more, and then I lay him down on the floor instead. He’s so perfect like this, all wanting and needy and fierce and he does everything I tell him, everything. His shirt is undone now, his flesh mine to touch, to taste. I tell him to undo my robes and his fingers tremble so much that I have to tell him again and again, and he moans and curses more each time until I laugh and do it for him.</p>\n<p>“Fuck me,” he begs. “Oh, god, fuck me.”</p>\n<p>His hair is all over his face, his breath coming fast and desperate. Blood is rushing in my ears. I could take him right now. He wants it so much. And he’d fall apart so beautifully. I can imagine his cries ringing in my ears; I picture myself spilling deep inside him, holding nothing back, and damn it, I’m certain his arse is just as hot and sweet as his mouth.</p>\n<p>“I can’t,” I tell him.</p>\n<p>“Oh, holy fuck, Draco, please. For the love of Merlin.”</p>\n<p>“I can’t.” The words are hollow and final. I just can’t do it. Fuck, I can’t be that person any more. I know what he says... but what if they <em>do</em> find a way to break the enchantment and then he regrets it? How can he consent — <em>really</em> consent — when he’s under the power of the collar? What if his supposed attraction to me is just part of the whole sickening deception?</p>\n<p>I think again of that twisted bastard, Lafarge, and a cold, sick shiver creeps down the back of my neck. He’d love this, wouldn’t he? Harry Potter, half-naked and so drunk with lust that he hardly knows what he’s saying. Trembling and whining for my cock. I curse under my breath and when that’s not nearly enough, aloud, pure loathing in my voice. “Fuck you, Lafarge.”</p>\n<p>“What the hell?” Potter’s voice is edged with misery.</p>\n<p>“Listen, Potter. If I were to have you — and you have to believe me, there is nothing more in life that I want at this moment. If I ever do, I want it to have nothing to do with that evil fucker.”</p>\n<p>“It’s not to do with him.” Potter’s face is a picture of misery and confusion. “It’s to do with <em>us</em>. Damn it, listen to me!”</p>\n<p>I shake my head. “As long as you’ve got <em>that</em> on.” I flick my fingers contemptuously at the collar. “It’s to do with him.”</p>\n<p>“Hell and Fiendfyre, Malfoy.” Potter pushes himself up on his elbows to look me in the face. “You’re actually serious.”</p>\n<p>“I’m deadly serious. I can’t do it if there’s a possibility you might regret it later.”</p>\n<p>Potter closes his eyes and shakes his head. “You stupid, bloody, noble, shitty <em>bastard</em>.”</p>\n<p>There doesn’t seem any answer to that. I stand up and walk over to the fireplace, and stare at the dregs of wine left in my glass. What I need is a large brandy.</p>\n<p>“Fuck.” Potter reaches down to adjust himself and I feel a lurch of heat in the pit of my stomach. He leans back against the sofa and sighs. “And there was me hoping Slytherins were easy.”</p>\n<p>I want to lay him down again. I want to kiss him, taste the sweet warmth of his mouth pulling me in. I want to feel the length of his body hot and firm alongside mine, his erection rubbing against my hip. I don’t have to fuck him. I could rock against him, line up our cocks. Even through his jeans, through my trousers, it would feel like pure satisfaction, the friction pulling raw sounds from our throats. I could watch him come apart and then... Then he could stay for a nightcap, and wouldn’t he look fine, sitting there sipping my brandy with the firelight flickering on his face. Merlin, how I want him. Surely we could just do that—</p>\n<p>“Do you want me to leave?” he asks, and the collar seems to ripple against his throat, bright and mutinous.</p>\n<p>“Yes,” I say. “I’m sorry.”</p>\n<p>He runs a hand through his hair and sighs. “Don’t apologise. I get it. Even if I wish I didn’t.” He touches the rim of the collar, twitches his neck as if the sensation of it bothers him, then gets to his feet. His eyes rest on my face, my lips. The pull towards him is so strong, like a hook in my guts, but I don’t move.</p>\n<p>“It had better be goodbye, then,” he says, and when I don’t speak, he turns to go. I don’t watch, but instead grope for my wand to Summon the brandy bottle. The door clicks shut behind him. The wards shudder as he leaves, then seal closed around the house again as if Potter had never been there.</p>\n<p>~***~</p>\n<p>My head aches, a dull, grating pain just over my left temple. I loathe working under pressure like this, and I can’t remember the last time I slept restfully. Whenever I manage to drop off, taunting images fill my dreams, tormenting me until I wake, sodden with sweat.</p>\n<p>They say the whole Lafarge job is taking too long; they want to seal the site and free up Breakers to work in the field again. But they daren’t seal it without knowing what exactly is left in there. There’s a constant stream of objects coming in, and barely enough time to glance at some of them before I need to make a decision. I massage my forehead with one hand while Summoning the next item with the other.</p>\n<p>A pair of gloves — seems harmless. Strong traces of magical activity, but no more than to be expected with an item worn on the hands. Probably had frequent contact with the owner’s wand. I dismiss them with a flick to the pile marked ‘safe’.</p>\n<p>I hear someone walk past outside, laughing, and for a split second I think it’s Potter. The only bright spot in this whole work situation is the fact that it leaves me next to no time to think about anything else. Doesn’t stop me dreaming about him at night, though.</p>\n<p>Next. A marble egg. Nothing untoward showing up. However, there could be something hidden inside. Marble is a useful masking agent for certain types of magic... I spin it around, looking for any sign of an opening... Ugh, it could take half an hour to penetrate the thing in a controlled way, and there’s no reason to think there would be anything inside worth the trouble. I send the thing on its way and beckon to the next item with my wand.</p>\n<p>There’s a whole pile of books. A shelf-full, in fact, and I know all too well there are more to come. A book. Hmm. Bound in leather, with a hand-drawn cover of runes and sigils, and a distinct whiff of Dark magic coming from it. I sit up a little bit straighter in my seat. My first impression is that it feels like an old Pureblood curse. Things like this are often passed down from generation to generation and not shared outside one’s own family. Fascinating to study. I could happily spend a day teasing apart the tangles of a curse like this, strand by strand. But, of course, there’s no bloody time.</p>\n<p>I rotate the book in mid-air. My best option, if I can’t work it out during the next five minutes, is simply to destroy it within the containment of the lab. I’d have to log that, though, and because it’s a book, there’s always the risk of destroying valuable information. Questions would be asked. I sigh and raise the Cognoscope to my eye.</p>\n<p>Yes. Blue with a shimmer of violet. Nasty. I bet this one has quite a kick to it. I’d sooner not mess with it at all without the time to set some proper containment spells... but I can’t just write off the contents without checking.</p>\n<p>I sit back and squint at it. I don’t need to disarm the entire curse if I can simply find a spot weak enough to let me in for a few seconds. I test it a little bit, only as much as I dare, probing gently around the edges of the spellwork with my mind. Quite a lot of power to it... but rather chaotic. I get the feeling the caster was in a rush, which is handy for me. I fix the eyepiece more firmly against my eye and take up my wand again. It’s pretty impenetrable all the way round this side. I rotate the book another ninety degrees. <em>This</em> section is weak, but it’s right next to a great vicious clump of ... I don’t actually know <em>what</em> that is, but I’m not touching it at all.</p>\n<p>Hmm. I leave the book where it is, and shift my chair to the right to get a better look. I feel like just... under... here... there’s a sort of... <em>ah</em>. Something feels like it's about to give and I back right off and cast some quick Shield Spells. This would go better with two Breakers working on it, one to contain the worst of it if something goes wrong, and one to try and gently prise it open. I know everyone else is just as busy as me, though.</p>\n<p>I take a couple of breaths. My skull feels as if there’s an Erumpent thumping through it. Now, where was that spot? Not here. Not here. Maybe... <em>yes</em>. I slide my magic inside, just a small amount, ready to retreat as soon as I feel any resistance. I feel the seam of the curse loosen and allow me to slip between its edges, and I gently, gently, widen the gap and start to ease my way in. I can’t release the book from the curse, not like this, but if I can hold the weave of the magic open, just enough... I pin the layers apart with my mind and then use my wand... with the gentlest motion, I can riffle the pages of the book without the curse even noticing.</p>\n<p>I peer in, not daring to open it any wider. The writing inside is neat and cramped. I suspect it’s not from the same hand as this rather haphazard curse-work.</p>\n<p><em>Priapus Potion. Warning. Causes unwavering arousal for up to six hours.</em> I raise an eyebrow and turn a few more pages. <em>Engorgio Phallus - a charm to</em>— Interesting. But I think I get the gist without reading further. There are dates and what looks like account after gloating account of the use of the potions and spells. So, a sort of journal, with recipes for home-brewed sex aids, and a record of the results. Perhaps I’ll flag the book as needing further investigation — Theo would undoubtedly find the contents amusing. But my hold on the parted edges of the Curse can’t last for much longer. I flutter through the pages once more, just to make sure the rest is more of the same before I contain it and log it.</p>\n<p>\n<em>The Voluptas Collar.</em>\n</p>\n<p>My heart stutters inside my ribs. There’s a sketch of a collar, a sinuous, twisting thing. <em>This Collar provides irresistible delights for its lucky wearer when—</em>, I read, and, oh, Salazar, the edges of the spell begin to slip out of my hold. My mind scrambles to regain a grip, but the curse snaps shut, eager to protect the secrets of the book. And the little questing tendril of my magic, which I used to lever the spellwork open, is crushed inside as if in a steel trap. My mouth opens, but I’ve no breath left with which to cry out as blackness rushes up and engulfs me.</p>\n<p>~***~</p>\n<p>The first thing I notice when I wake up is scratchy cotton against my bare feet. The second is the bruised, tender feeling in my ribs every time I breathe in.</p>\n<p>A light flicks on and I screw up my eyes.</p>\n<p>“Mr Malfoy? Decided to rejoin us in the land of the living, then?” I don’t recognise the voice.</p>\n<p>“What the bloody hell happened?” Talking <em>hurts</em>. A stabby sort of shiver in my midriff.</p>\n<p>It’s a short, round witch in pale yellow nurse’s robes. She opens the curtains with a fierce twitch. “Curse damage. The Healers will be doing their rounds shortly.”</p>\n<p>I remember now. The Curse— The sickening feeling as it clamped tight around my magic. <em>The book</em>. I push myself up on one arm and wish I hadn’t as the pain increases. “I need to see Granger.”</p>\n<p>“Healer Granger? You’ll be lucky. Healer Lackjoy is dealing with your case.”</p>\n<p>“It’s not about my case... it’s about Harry Potter.” My breathing feels laboured. “It’s urgent!”</p>\n<p>“Calm yourself. Rest is what’s advised at the moment. You can speak to Healer Lackjoy presently. No over-exertion.”</p>\n<p>I flop back against the pillows. I’m an unspeakable idiot. To let myself be distracted like that while I was working. But the fucking book. How much information is in there about the collar? Is there a spell to release it? “I really do need to speak to Healer Granger,” I say, but my voice sounds feeble and the nurse just shakes her head.</p>\n<p>“All in good time,” she tells me, sounding a little more sympathetic. “Now, how about a cup of tea?”</p>\n<p>That actually sounds... a bloody marvellous idea. My mouth feels like a Blast-Ended Skrewt shat in it. But first... I look around the room. “Where’s my wand?”</p>\n<p>“Time for that soon enough. No magic yet. Healer’s Orders. Tea?”</p>\n<p>No magic? I open my mouth to argue, then think better of it. “I would love some tea, thank you.”</p>\n<p>As soon as she’s out of the room I edge cautiously forwards till I can reach the parchment roll which I can see on the table at the foot of the bed. As I guessed, it contains my notes. I’m so shaky that moving is a bit of a trial, but I ease myself back against the pillows and scan the orderly writing.</p>\n<p>\n<em>Unspecified Curse-Damage.... injury sustained while at work... major impact to the patient’s magical core...</em>\n</p>\n<p>\n<em>Treatment: Fortificus potion, 2 fl oz every two hours. Invigoration therapy twice daily. Bedrest. Abstinence from all magical activity until core regains 60% strength.</em>\n</p>\n<p>Hell. I let myself flop against the pillows. I feel pretty wrecked, to be honest.</p>\n<p>I hear brisk footsteps in the corridor, then Granger’s bushy head of hair appears round the door.</p>\n<p>“Ah. Awake?”</p>\n<p>“Evidently.\"</p>\n<p>Her eyes flick to the notes in my hand. “Interesting reading?”</p>\n<p>I don’t know why she sounds accusatory. “They are <em>my</em> notes.”</p>\n<p>“They are for the benefit of your Healers.”</p>\n<p>I shrug. “They said my Healer was Lackjoy.”</p>\n<p>“I’ve been keeping an eye on things too. For obvious reasons.”</p>\n<p><em>For the reason that you can’t keep your nose out of anything.</em> “Magical depletion?”</p>\n<p>“Yes. You’ve suffered from it before?”</p>\n<p>“Only in training. I was inexperienced, and, well. A Strength-Sapping Curse went off in my face. It felt nothing like this, though.”</p>\n<p>“No, it wouldn’t have. Whatever was protecting that book began feeding on your magic, sucking it from you to fortify itself. I’m afraid you were unconscious for quite some time. If Theo hadn’t found you when he did...”</p>\n<p>Something to thank the bastard for when I next see him. “The book.”</p>\n<p>“Yes.” Granger inclines her head. “It took three of them to disarm it.”</p>\n<p>“I can see why the owner would have been keen to keep its secrets.”</p>\n<p>“Did you read any of it?” She looks disapproving.</p>\n<p>I nod. “Some. I had to try to find out what it was before I destroyed it.”</p>\n<p>“That collar thing.” Her mouth curls in distaste. “The details were all in there.”</p>\n<p>“So... Potter. Is he... Could they...?”</p>\n<p>She nods. “Harry’s free.” And I don’t know why something cold and heavy settles in my chest at the words.</p>\n<p>“That’s— That’s wonderful,” I say. It sounds flat and unconvincing. I try again. “I’m glad.” Potter will be delighted, I’m sure. No more desk duty. No more inconvenient itchy cravings. “Did they find out much about how the thing worked?”</p>\n<p>She shrugs. “I’m not sure. Breaker Nott would know. The main thing is that Harry’s OK. No after-effects at all.”</p>\n<p>“He feels completely normal?”</p>\n<p>“Absolutely. Now, I need to check you over.”</p>\n<p>“But... Lackjoy...?” I ask, but I’m no match for a determined Granger at the moment.</p>\n<p>“I’m between patients, and I have more knowledge about that side of the case. It won’t take long.”</p>\n<p>I lie back and let her do as she wants, my teeth on edge at the sound of her Medi-Quill scratching on parchment.</p>\n<p>“Hmm. The depletion is more extensive than I’d feared.” As if I couldn’t feel that from the sore, hollow feeling inside me. She consults my notes. “I’m going to increase the dose of Fortificus Potion.”</p>\n<p>“When can I go home?”</p>\n<p>Her forehead wrinkles. “Oh, not for a while.” Something like a smile twitches at her lips. “I hope you like hospital food.”</p>\n<p>~***~</p>\n<p>I don’t know why I thought Potter might visit. I just...</p>\n<p>I don’t know. I can see now it was a stupid idea. You do get to thinking all kinds of bloody idiotic things when you’re lying in bed for days on end, that’s all.</p>\n<p>~***~</p>\n<p>Being back at my place is a huge relief. The warm, rich scent of wood and polish and a fire burning in the grate, instead of astringent herbs and the pervasive stink of Dittany. The softness of fine sheets in my bed. And the delights of a plate of good roast beef and a generous glass of elf-made wine.</p>\n<p>The wine is not strictly allowed under Healer’s orders. But, damn, it slips down like silk, warming me from within, smoothing out the tension I can feel in my shoulders. And Granger will never know.</p>\n<p>By the second evening at home I’m beginning to feel more myself again, although an ill-considered Aguamenti leaves me dizzy and cursing. Even the simplest spells take more effort than I would have believed. But Lackjoy is pleased with my progress, and says another fortnight should see me right.</p>\n<p>The wind is blustering about outside again. It’s natural I would think of the night Potter blew in off the street. He was really quite believable — that fiery conviction he has. Anyone might have been fooled into thinking that he actually meant what he said.</p>\n<p>I allow myself one glass of brandy and sit brooding over it. When the knock comes, I know I shouldn’t hope, but I do. And there he is, in uniform this time, his face lined with tiredness, a fresh cut standing out livid across one cheek.</p>\n<p>“Can I come in?” His throat is unfettered, now, of course. Somehow I wasn’t expecting it to look so naked without it. He’s bloody smiling at me, his eyes crinkling and his whole face lit up by it.</p>\n<p>I don’t want to feel this way. Don’t want to feel hope bounding in my chest. It will be worse, afterwards.</p>\n<p>I block the doorway. “Why are you here?”</p>\n<p>He sounds as if the answer should be obvious. “I wanted to see you.”</p>\n<p>“But why <em>now</em>?” Now, when I’d just about – not quite, but nearly – given up.</p>\n<p>He leans heavily against the doorframe. “They sent me to bloody Peru for two weeks. I just got back. We got the bastards, anyway. Two more members of Nox Anima – they’d gone to ground there. And a lead on where Lafarge might be hiding.”</p>\n<p>I stare at him.</p>\n<p>“Sorry, I should have owled first, I guess? I couldn’t get in touch while I was away. In case it was traced.” His smile starts to falter as I still don’t speak. “Maybe I shouldn’t have come.”</p>\n<p>I gesture to his throat. “They got it off.”</p>\n<p>“Yes. I heard what happened to you with the book.” He grimaces. “I’m sorry. But it’s amazing that you found it. I would have thanked you sooner, but within an hour of getting it off, they decided I was urgently needed on this mission.”</p>\n<p>“That’s why you came? To thank me?” I don’t want his gratitude.</p>\n<p>“I came because I wanted to see you. But I can go, if...”</p>\n<p>A sudden wave of dizziness has me clutching at the door frame for a moment.</p>\n<p>“Hell, Malfoy. Are you OK? Should you be lying down?”</p>\n<p>I wave a hand. “I’m fine. It happens.”</p>\n<p>“Can I help?”</p>\n<p>“Really, it’s nothing.” I take a deep breath. “I do need to sit down, though. You’d better come in.”</p>\n<p>“Are you sure?”</p>\n<p>I nod, and he stays close to me as we go into the sitting room, as if ready to catch me. He winces as he sits down, and I notice he holds his arm at an odd angle, cradling it across his chest.</p>\n<p>“What have you done to your arm?”</p>\n<p>“Oh.” He looks sheepish. “I’m not sure yet. I’ll drop in at St Mungo’s later.”</p>\n<p>The Knut drops. “You’ve come straight from deployment?” Something is jittering in my chest, but I push it down. I’m damned if I’ll let myself get carried away again.</p>\n<p>“Well. The Ministry first. Had to debrief. Then Ron told me that you were back at home. So here I am.”</p>\n<p>“Merlin, Potter, you need a Healer!”</p>\n<p>He smiles a crooked smile. “Well, yeah. Maybe.”</p>\n<p>“Nothing you do ever makes the slightest bit of sense.”</p>\n<p>“I just wanted to see you.” He lowers his head and looks at me from under his fringe. “I’ve been thinking about you. The whole time I was away. Does <em>that</em> make sense?”</p>\n<p>I swallow. It’s so hard not to take him at his word when he looks that way. To remember that someone like him can’t, really <em>can’t</em>, be interested— “Not really. I thought—” I gesture to his neck. It looks so very pale, and bare.</p>\n<p>“What? You thought I wouldn’t feel the same way when the collar was off?” He looks angry. “Merlin, Malfoy, I fucking told you—” He moves, and it must jar his arm, because he clutches it. “<em>Ah</em>. Bugger.”</p>\n<p>I can’t stop myself wanting it to be true, and my voice shakes. “You need to get that seen to.”</p>\n<p>“In a minute. I just had to see if you were all right. How’s your magic doing?”</p>\n<p>I make a face. “Weak as a Kneazle. But they say it’s to be expected.”</p>\n<p>“I’ll let you get some rest.” But he doesn’t move, just sits there, looking fierce, suddenly, in his scarlet uniform, until he seems to make up his mind to speak. “Malfoy, just tell me... was I wrong to think about it?” He runs his hand through his hair. “It kept me going out there, if I’m honest. There were some long nights on stakeout...” He closes his eyes briefly. “But maybe I got the wrong idea. You’ve had some time to change your mind now.”</p>\n<p>My mouth’s so dry; I’m glad Granger isn’t here to check my pulse. A shaky kind of excitement is swelling inside me. “To think about...” I need to hear him say it.</p>\n<p>“About you and me. You read that book, right? About how the person wearing the collar chooses who it works with?”</p>\n<p>“What? No. I only saw inside it for a few seconds.”</p>\n<p>“I made them show it to me. <em>The collar provides irresistible delights for its lucky wearer when following the commands of their desired partner</em>.”</p>\n<p><em>That</em> was it? The collar works for me because--</p>\n<p>“That’s <em>you</em>, you prick,” he continues. “You’re my desired partner. And what I can’t stop thinking about is where this will end up.”</p>\n<p>I try to keep my voice light, to hide what this means to me. “With you in my bed, I’d hope.” He doesn’t need to know that an unfamilar elation is flooding, rampant, through my veins.</p>\n<p>His eyes flash and he moves towards me, but then his face twists into a mask of pain.</p>\n<p>“Merlin, your arm, Potter!”</p>\n<p>He takes some deep breaths. “I know. I guess I do have to go and get it looked at.” There’s a sheen of sweat on his top lip as he stands, cradling his arm. “I just— Ah, fuck, Malfoy. When will you be well again?”</p>\n<p>“Well, that depends. Well enough for what?”</p>\n<p>“You know what,” he says, his voice rough with vexation. “I want you. The same as I did before. I want you <em>inside</em> me.”</p>\n<p>I have a flash of him beneath me, his strong body laid out for my delight, and I swear to Merlin, if it wasn’t for that injured arm, I’d have him right now, and damn my recovery to blazes. My tongue feels thick and clumsy but the words come all the same. “I’m ready whenever you are.” I get to my feet myself, willing my traitorous legs not to shake.</p>\n<p>He looks at me and shakes his head. “No, you’re not. You look like shit.”</p>\n<p>I make a sound of protest, and he laughs. “It’s OK, you’re still sex on legs. But you’re exhausted, aren’t you? I know how it is. Feels like the Hogwarts Express ran you over.”</p>\n<p>I don’t have the energy to deny it. I let out a discontented sigh instead.</p>\n<p>“Sit,” he tells me. “Rest. I’ll go and get myself fixed up.”</p>\n<p>I sink down on the sofa. “Use my Floo.”</p>\n<p>“Think I will, thanks. Shall I come back? When you’re recovered?”</p>\n<p>“If you don’t, I may have to track you down.”</p>\n<p>“Oh, I’ll come. Owl me when you’re better. I would come sooner, but...” A smile pulls at his mouth. “I don’t trust myself.” He reaches for the Floo Powder, takes a pinch between his fingers. He turns once more, a smile spreading over his face again. “I suppose a quick grope would be a bad idea before I go?”</p>\n<p>“Potter,” I say. “Fuck off out of here.”</p>\n<p>He grins. “I’m gone.” There’s a brief flash of green in the hearth, and then he’s true to his word.</p>\n<p>~***~</p>\n<p><em><em>15th March</em></em><br>\n<em>How’s your arm?</em><br>\n<em> DM</em></p>\n<p>\n<em>All healed. Why does Skele-Gro have to taste like dog’s vomit?<br>\nHarry</em>\n</p>\n<p>\n<em>To take your mind off the pain, of course.<br>\nDM</em>\n</p>\n<p><em>Makes sense.</em><br>\n<em> So how are you feeling today?</em><br>\n<em> Harry</em></p>\n<p><em>Not so bad. These endless practice spells are bloody tedious, though.</em><br>\n<em>DM</em></p>\n<p>\n<em>Oh, hell, I know. Thought I’d die of boredom last year when I had to recover from magical exhaustion after a really bad string of raids. Stick with it, though. You’ll regain strength much faster if you do.<br>\nHarry</em>\n</p>\n<p><em>I’m working at it. Your visit was actually quite inspiring.</em><br>\n<em> I think you should come over for drinks tonight and check up on my technique.</em><br>\n<em> DM</em></p>\n<p>\n<em>Nice try. That’s a no.<br>\nHarry</em>\n</p>\n<p>\n<em>I’ve rested all day in between bouts of practice. I’m perfectly capable of having drinks with a colleague.<br>\nDM</em>\n</p>\n<p>\n<em>I’m not capable of sitting all cosy by the fire without jumping on you. It’s my turn to be a principled prat.<br>\nHarry</em>\n</p>\n<p>\n<em>I’m sure I could handle anything that you could dish out.<br>\nDM</em>\n</p>\n<p><em>Draco, I don’t think you understand. I want to ride you so hard that I can’t walk the next day. I want you to fucking </em>ruin<em> me.</em><br>\n<em>I’m not coming over until the Healers sign you off.</em><br>\n<em> Harry</em></p>\n<p>\n<em>Merlin, Potter. Are you trying to finish me via owl post now?<br>\nDM</em>\n</p>\n<p>\n<em>I’m trying to ensure you survive, you arse.<br>\nHarry</em>\n</p>\n<p>\n<em>Very well. I’ll just have to lie here on the sofa and wank myself senseless, then.<br>\nDM</em>\n</p>\n<p>\n<em>Fuck, Malfoy, I’m due in Robards’ office in 5 minutes and I’ve got a hard-on the size of the Astronomy Tower.<br>\nHarry</em>\n</p>\n<p>\n<em>What rotten luck. Enjoy your afternoon, won’t you? I’ll be in touch...<br>\nDM</em>\n</p>\n<p>\n<em>You do that, you bastard.<br>\nHarry</em>\n</p>\n<p>~***~</p>\n<p><em><em><em>26th March</em></em></em><br>\n<em>I went for my final check up this morning. Healer Lackjoy says my magical core is back at 95% strength and he doesn’t need to see me again.</em><br>\n<em> I don’t know if you’re free this evening for a spot of supper?</em><br>\n<em> DM</em></p>\n<p><em>I can probably leave here in an hour. How about if I come straight over?</em><br>\n<em>I’m sure you’re a great cook and everything, but... food is not really what’s on my mind.</em><br>\n<em> Harry</em></p>\n<p><em>Quiet at the Ministry today? I’m surprised.</em><br>\n<em> Come whenever, then. I’m at home.</em><br>\n<em> DM</em></p>\n<p><em>No, it’s total bedlam here to be honest, but I can’t concentrate on a fucking thing now. I’ll tell Robards I’m coming down with Spattergroit or something.</em><br>\n<em>Can you lower your wards for me?</em><br>\n<em> Harry</em></p>\n<p><em>Done.</em><br>\n<em> Do you know your handwriting is even more appalling than usual?</em><br>\n<em> DM</em></p>\n<p><em>You understood me, didn’t you?</em><br>\n<em>Fuck. I can’t find Robards. I’m just going to leave anyway. I’ll be there shortly.</em><br>\n<em> Harry</em> </p>\n<p>~***~</p>\n<p><em><em><em>Pop</em>. </em></em>I’m in the kitchen when I hear it, putting a bottle of wine under a chilling spell.</p>\n<p>“Malfoy?”</p>\n<p>“In here.”</p>\n<p>He enters in a whirl of robes and his lips are on mine before I can even get a look at him. His mouth is hot and urgent as he presses me up against the cupboard, his hands in my hair, the length of his body firm and insistent against mine.</p>\n<p>Dear, sweet Merlin, he makes me burn for him. I push back against him, my hands making fists in his robes and our mouths rough and needy. He lets out a deep groan and grabs my arse, grinding against me like an overgrown teenager, his hands strong and possessive and—</p>\n<p>There’s the sound of something being knocked over, and then the tinkle of broken glass. One of Great-Aunt Vega’s crystal goblets is on the floor in pieces.</p>\n<p>“Oops,” Potter mouths against my skin, not pausing in the heady motions of his hips, his hands.</p>\n<p>“Stop,” I tell him. I can feel his erection, solid against my leg as he thrusts. I could come from this. “Do you want this all to be over in a minute?”</p>\n<p>He’s kissing my jaw, his stubble scratching against my cheek. “Don’t much care,” he says. “Want you.”</p>\n<p>“It’s mutual, but for Merlin’s sake, Potter, stop now.” I pitch my voice low and firm and he responds, his mouth softening against my skin, his body pliant against mine.</p>\n<p>He leans against the cupboard, one arm on either side of me. He’s breathing hard. Fuck, so am I.</p>\n<p>“Huh. Sorry.” His eyes run all over my face, lingering on my eyes, my mouth. “I’ve been thinking about this for quite a while.”</p>\n<p>“All the more reason not to rush it.” My chest feels tight with wanting him. “Now, come and have a drink like civilised people.” I clear up the broken glass with a gesture, then lead him through the hall, the wine floating ahead of us, and two as yet intact glasses bobbing along behind.</p>\n<p>“Nice charmwork.” He’s grinning. “No more practise spells?”</p>\n<p>I make the glasses do an elegant somersault in mid-air. “No. I’m officially recovered.” The glasses swoop down onto the table, then each do a small, wobbly, pirouette.</p>\n<p>He snickers. “Show-off.”</p>\n<p>I pour the wine. It’s crisp and clean and, unlike most wine, leaves your head feeling clearer than before.</p>\n<p>Potter takes a swallow. “It’s good.” He looks so restless, like a ball of energy, his hair especially wayward today. “So you’ll be back at work on Monday?” he asks.</p>\n<p>I nod, trying not to show the mixed feelings I have on the matter. I wouldn’t be the first Breaker to get caught out by something nasty. But… it was bad enough having my loyalty questioned. The last thing I need is anyone doubting my ability to do my job.</p>\n<p>“Rivett will be pleased. I hear he keeps griping about how tough it is with you off sick.”</p>\n<p>“Well, if your lot will keep piling the work on us… It’s always going to be hard if the team is a Breaker short.”</p>\n<p>He takes another drink. “Yeah. But not just that. They found some ivory ornament at a farm out in Dorset last week. Horrible little thing; it didn’t look much, at all, but somehow just going near it gave you the shivers. I was the escort for Holloway and he couldn’t handle it – he was scared, to be honest. They called Rivett in and he was all, <em>The sooner Malfoy gets back, the better</em>.”</p>\n<p>“He said those exact words?”</p>\n<p>“Yeah. I was right there.”</p>\n<p>I wave a hand. “I’m sure Nott could deal with it.”</p>\n<p>“Yeah, course. He did, but Rivett told him before he started, ‘Watch yourself. I don’t know where we’d be with both you and Malfoy out of action.’”</p>\n<p>I take a swallow of wine, let it slide cool and steadying down my throat. I have the stupidest feeling my cheeks are getting warm. “Well,” I say, keeping my voice neutral. “It’s nice to be missed.”</p>\n<p>Harry looks as though he’s making up his mind about something, then rummages in his robes. “I, er, actually brought something to show you.”</p>\n<p>“Oh yes?”</p>\n<p>“I’ve done something a little... well, you might not approve.” He grins, then, and there’s a worrying hint of wickedness to it.</p>\n<p>“You’ve done <em>what</em>?” God help us.</p>\n<p>He fumbles with the robes again, then slides something out of the pocket. It’s wrapped in soft black fabric, and as he unrolls it, I see a flash of silver.</p>\n<p><em>No.</em> It can’t be.</p>\n<p>He lifts the fabric, letting the contents slither onto his knee. The collar. It’s the bloody collar, large as life and twice as tempting.</p>\n<p>“Potter. What in the name of Salazar—”</p>\n<p>He raises his eyes to mine and pulls a rueful face. “Well, if they will leave these things just lying around...”</p>\n<p>“You <em>stole</em> it?”</p>\n<p>“I— Well. If you put it that way... yes. I did. I don’t think anybody’s missed it.”</p>\n<p>I have no words. I gape at him, at the length of bright silver sitting innocently on his lap.</p>\n<p>“I got quite attached to it, you know?” He holds it up, and it snakes around his wrist as if seeking the warmth of his skin. He flicks his eyes up to me again. “I know what you said.” I can see the tension around his jaw. “About Lafarge. But I thought it might be different, you know?” He scans my face. “If I put it on knowing what it does. Because I wanted to.”</p>\n<p>I can hear the blood pounding in my ears. The reckless, idiotic... And he’s just sitting there, waiting for me to speak. Has he the slightest idea what his suggestion does to me? “Knowing what it does,” I echo. My voice sounds odd and expressionless.</p>\n<p>“Yes.” He watches my reaction carefully. “It would be entirely my choice.” He turns the length of metal over in his hands, and it coils around his arm again. “Wouldn’t you say that would be different?”</p>\n<p>A hundred images flash into my brain of him collared, willing, <em>biddable</em>. Submissive by his own choice. I close my eyes for a moment against the intoxicating flood of heat that rolls through me. When I speak again, I pitch my voice deeper. “Oh, yes. That would be quite different.”</p>\n<p>“I had Nott check it over,” he says. “There’s no curse on it. There never was.”</p>\n<p>I can’t keep the disbelief out of my voice. “<em>Theo</em> checked it for you?”</p>\n<p>Harry nods. “Yeah. I took a chance on telling him. I like him, actually. He’s not overly bothered about playing by the rules.”</p>\n<p>“Fuck, Potter. Does he know...?”</p>\n<p>“What I took it for? I think he can probably guess.” Potter doesn’t even try to hide his grin.</p>\n<p>I feel like letting my face sink into my hands. Having failed to get us both killed, Potter’s new ambition is to have us both sacked. I fix him with a glare, but his hands are lifting the collar towards his throat, the fluid metal shifting and twisting as if eager to be close to him again.</p>\n<p>“Shall I?” His voice is low, his face expectant. “I mean... I don’t have to. I want you without this, Malfoy -- fuck, I feel like I’ve wanted you forever. But I know how good this could make us both feel.”</p>\n<p>“Come here,” I say, indicating the sofa beside me. He sits down close enough that I can feel the heat from his leg next to mine. His pupils are wide and black as I reach out to touch the skin of his throat, and he shivers as my fingers slide down it, tracing the line of his neck down to the collarbone.</p>\n<p>“Is that what you want?” I ask him.</p>\n<p>“Hell, yes. I want it for both of us. I’ll be honest… I get a kick out of the thought of you telling me what to do anyway.” His face flushes, but he doesn’t break eye contact. “That’s a bit weird, right?”</p>\n<p>There’s a rich, raw joy throbbing through me. “It’s a little unusual, perhaps.”</p>\n<p>“But you like it.” He searches for something in my face and apparently finds it. “You do like it, don’t you?”</p>\n<p>I incline my head. “Yes. I do like it.” The words are inadequate but they seem to satisfy him, his eyes closing as my fingers brush against his Adam’s apple, briefly letting my hand rest around his throat where the collar would lie. I can feel his pulse beating beneath the skin, strong and rousing. “The collar... you can take it off again when you want to?”</p>\n<p>“Any time I like. It’s a simple incantation.”</p>\n<p>I feel on fire with want and anticipation. “Do it,” I say, and the heady rush of giving him an order throbs through me.</p>\n<p>He barely has to bring it to his skin before it coils itself around his throat. He lets out a groan as it settles into place, the end clasps melting into one another until only a smooth, unbroken circle remains. It looks as if it were made for him.</p>\n<p>His eyes close for a moment, and when they open, they’re fixed on me. His lips are parted, expectant, and god, I can’t resist him, not for another second.</p>\n<p>“Kiss me,” I say, and the collar shifts, pulsing and transmuting, for a scant moment before he leans towards me and his whole body seems to rack with the force of it. I hold him steady as it roars through him, tasting his mouth and the piquancy of the wine on his lips. I can feel him give in to it, leaning against me as his body floods with delight, and I rest my fingers against the collar and kiss him until I feel the last trembling pulse of it die away.</p>\n<p>“Oh, Malfoy, god, don’t stop.”</p>\n<p>I draw back to look at him. His face blazes with need, the collar snug around his throat, shining against his skin. I want to touch him; I want to <em>own</em> him. I stroke the line of his jaw, see his eyes flutter closed and for a moment there’s no filter between my thoughts and my tongue. “You look so fucking beautiful like this,” I tell him, and he moans again, his body shivering beneath my touch. I pull my hand away.</p>\n<p>“What’s wrong?” he asks.</p>\n<p>“The collar... That wasn’t an order, but it still—” I feel the cold drip of panic in my chest. “Something’s gone wrong with it.”</p>\n<p>He frowns. “Shit, Draco. That wasn’t the collar.”</p>\n<p>“But—”</p>\n<p>“You fool, that’s how you make me feel.”</p>\n<p>I stretch out my hand again, let my fingers brush over the cool surface of the collar and then trace along his throat beneath. He closes his eyes, a small gasp spilling from his lips. I want to stop thinking, questioning. I want to lose myself, the way he does. But—</p>\n<p>“What if the collar has trained you to be receptive to me?” I don’t stop touching him, though, even as I try to remember where I’ve heard of the idea. “Like that Muggle, you know. With the bells, and the dogs—”</p>\n<p>Potter’s brows draw down. “I may be wearing a collar, but I’m not a fucking dog, Malfoy.” He looks ready to pull his wand on me. “I’ve told you how I feel. Now shut up.” His eyes move across my face, seeking out my lips again. “Shut up and tell me what to do.”</p>\n<p>“Kneel.” The word bursts from my lips in a hot rush. I don’t know if it’s right or wrong. I just know I can’t hide from this any longer.</p>\n<p>He doesn’t hesitate, just drops to the floor, a heartfelt groan spilling from his lips as he goes. I have to have him. Nothing on earth could stop me now.</p>\n<p>“Take your tunic off.”</p>\n<p>He’s wearing the type with buttons down one side today. His eyes burn into me as he moves his hands to the top button, and as his fingers slip it free, I see a long shudder pass through him. “<em>Uhhh</em>.”</p>\n<p>“Keep going,” I tell him, before it’s even over, and his fingers falter over the next one. His mouth falls open, the sounds he makes beyond anything I could have dreamed. His tunic parts to reveal the line of his collarbones, and, lower, that delicious trail of black hair. I want to take his tunic and yank the last buttons free, ripping it from his body, but instead, I give him a minute to work at them, watching the fascinating planes of his muscles shifting as he moves.</p>\n<p>“Take it off,” I tell him, and he’s slipping it from his shoulders and moaning in bliss as it falls to the floor. My eyes run all over him, drinking him in. Harry Potter, shirtless on my silk rug and Merlin, he looks so fine that it hurts. A throbbing ache settles just under my ribs. He looks so <em>powerful</em>, his body lean and strong, a new scar on his ribs making my fingers twitch with the urge to trace it. His fists clench at his thighs, and beneath the scarlet wool of his trousers I can see the thick line of his cock pressing against his fly. He’s on his fucking knees for me, and it’s because he wants to be there. Because he wants to give himself to me and to the satisfaction of the collar. And it’s so good that I feel like something inside of me might tear apart with how perfect it is.</p>\n<p>I stand up, and he looks up at me, head tilted in expectation. He looks fearless. As if nothing bad could ever happen to him. I run my hand over his jaw and he turns to press his lips to my palm. His eyes flick up to mine, his lips parting damp against my skin and Salazar, how can he hold such power when he’s down on his knees? I feel as shaky and off-balance as I did when I first came home from St Mungo’s.</p>\n<p>“Tell me, Draco,” he whispers. “Tell me what to do.”</p>\n<p>I gesture with my hand. “Stand up.”</p>\n<p>He gets to his feet, the wave hitting halfway through. I hold his elbow to steady him and he leans against me and pants it out. His chest is flushed, his neck mottled with pink.</p>\n<p>“I need you in my bed,” I say, nothing in the world more important than those six short words. I hear his breath hitch and I don’t give him any further warning, just picture my room in my mind and make a sharp twist to the right, my arm round his waist. We land in the middle of my four poster, Potter losing balance and tumbling on top of me, his stubble scratchy against my cheek.</p>\n<p>We’re both breathing hard again. Potter pushes up on his arms and gazes at my mouth hungrily before leaning in. I lie back and let him kiss me, relishing the hard press of his body against mine and the softness of the bed beneath us. Potter’s mouth moves hot and damp over my skin, his hands greedy on my body. His lips are on my throat, his hands squeezing at my arse when I wind my hands into the thick softness of his hair and tug, just enough to get his attention.</p>\n<p>“Stop,” I say, and he does. I feel every inch of the shudder that rocks through him, his moan loud and almost tortured.</p>\n<p>He looks at me from under heavy lids as it dies away. “Hell, Malfoy. <em>Ohhh</em>.” He takes a few shaky breaths and then his hands are under my shirt, fingers moving over my ribs, the sensitive skin of my waist. “Please.”</p>\n<p>“Clothes off,” I tell him, and he rolls over and reaches for his boots.</p>\n<p>“Stand up first,” I say, and he scrambles to his feet and then clutches at the bedpost, bent double with his eyes closed, crooning and cursing. I watch, drinking in every detail. When it’s passed, his fingers work quickly at buckles, belt, and buttons, and then he’s pushing his trousers to his ankles, the jut of his cock mouth-watering against the cotton of his underwear. He’s making so many sounds that I can’t tell where one bout ends and the next begins. “Strip,” I tell him, and he tucks his thumbs into the elastic of his pants and gets them to mid-thigh before his fingers shake so hard that he has to stop. His cock is flushed and thick and it twitches in mid-air, once, twice, three times, Potter gripping the bedpost again, his muscles strained taut. He looks exactly as if he’s about to come, his balls drawn up high, his face contorted.</p>\n<p>“Fuck,” I whisper, and he gulps in a breath and pushes his underwear the rest of the way down and steps out of them. He’s naked except for the collar, a scrawl of black hair across his chest and lying in thick curls around his cock. There are scars here and there, a deep one running across one thigh, the skin drawn uneven in the characteristic pucker of a curse-scar. His body is so strong. So flawed, so <em>real</em>. He pulls off his glasses, places them on the bedside table. He looks vulnerable, suddenly, standing there with his brows pulled down, as if he’s unsure whether I’ll like what’s on offer.</p>\n<p>I’ve never seen anything I’ve wanted more, and what rips through me with the most dazzling sweetness is that I can have him – sweet Merlin, I can have him.</p>\n<p>“Come here,” I say, and he crawls onto the bed, his shoulders curling inward with pleasure, soft huffs falling from his lips as he comes.</p>\n<p>“Help me undress,” I tell him, and our fingers move together over the fastenings of my robes, his quivering uselessly at first as another wave hits him. He pants into my hair, soft noises and parts of words spilling from his lips. “Draco… <em>Oh</em>.” His fingers linger over every inch of my skin as it is revealed.</p>\n<p>“Don’t tell me to do anything.” He bends to my shoulder, his mouth soft, and hot, with just a hint of teeth in the kisses he trails towards my throat. “Not for a bit.”</p>\n<p>My brows draw together. “Do you want to stop?”</p>\n<p>“No! God, no.” He screws up his face. “I just— I can’t concentrate on you while the collar’s... you know. And I want to make it good for you.”</p>\n<p>I want to laugh at the idea of this being anything but good. But I don’t protest. Instead I let him finish taking off my shirt, trailing his mouth over my skin as he undoes each button. I prop myself up on one arm to watch as he takes off my trousers.</p>\n<p>“You see, I can go slow if I want to,\" he tells me, and I have to stifle the sounds that bubble up as he presses one open-mouthed kiss after another along my stomach, his strong hands resting on my thighs. He dips his head to nuzzle my prick through my underwear and Merlin, he looks like something from a potions-dream – the sort they sell on the top shelf – his lips reddened and plump, and hungry sounds building in his throat.</p>\n<p>I have to remind myself that this is far too good to rush. I let him slide my pants slowly down, his nose, his lips, moving against my thigh, and I resist the urge to thrust against him. Oh, hell, his breath on my skin, hot, damp, and teasing. I’m so fucking hard, my cock straining up towards the ceiling.</p>\n<p>His hands reach up to stroke across my ribs and down, settling at my hips and resting there. His tongue licks a wide swipe from the base of my cock to the tip and I moan, a strangled sound of need, as startling sweetness rips through me. When he looks up at me, his pupils are wide enough to drown in, and his voice is a low rasp. “Uhh… Waited so long for this.”</p>\n<p>It’s not as if it isn’t written all over his face, but I ask him anyway. “You want me?”</p>\n<p>“More than ever,” he says.</p>\n<p>“Want me to fuck you?” I ask him.</p>\n<p>“You know I do.”</p>\n<p>“Say it,” I tell him, a little steel in my voice.</p>\n<p>“<em>Uhh</em>. Fuck me.” The words become ragged as the collar takes hold. He forces the words out even as his body curls in on itself with the force of it. “Oh, god, I need it.”</p>\n<p>Desire pulses through my veins, hot and intense. I summon a small glass bottle of lube and pass it to him. “Prepare yourself,” I tell him.</p>\n<p>I’ve thought about this. What I could have done, if I had given him what he asked for that night. I’ve imagined him like this, stripped, on my bed, his legs drawn up. Holding himself open for me to see. His hand slick with oil, fingers pushing inside, readying himself for me. I’ve imagined his moans and sighs, the way his body would buck at my command. And it’s the thought of that becoming a reality which makes my hands shake as I hold out the bottle.</p>\n<p>He takes it from me, but hesitates. The collar is pulsing and I can see him swallowing, his Adam’s apple bobbing above it. Is he <em>shy</em>? The thought of him being self-conscious just spurs me on.</p>\n<p>“Prepare yourself,” I tell him, giving my voice an edge.</p>\n<p>He looks up at me, his hair falling in his eyes. “I, er.” His grin is more hesitant than normal. “I already did it.” He hands back the bottle.</p>\n<p>“What?”</p>\n<p>“I did it earlier. After you owled. I... well. I thought we might not want to wait around.”</p>\n<p>“You—”</p>\n<p>“It was in the loos at work.” His grin is broadening now. “Ron came in to piss while I was doing it. He was chatting to Carstairs at the sinks and I was in a cubicle...”</p>\n<p>I close my eyes briefly. Potter, in the Ministry toilets. Working himself open, thinking of me. I have to take a deep, steadying breath.</p>\n<p>He runs a hand over my back, his palm warm and firm against my spine as he lies back against my sheets and pulls me down next to him. His cock slides across my thigh, leaving a trail of sticky heat. “I thought we might just do it on the floor or something. As soon as I got here. Or, you know. Up against the wall.” His eyes crinkle with amusement.</p>\n<p>My body reacts instantly to the suggestion, my cock jerking with eager interest, and I wonder if he notices. My words are more controlled. “You thought wrong.”</p>\n<p>“I know. I’m just not very good at waiting sometimes.”</p>\n<p>“Wait next time, though. Don’t do it until I say.”</p>\n<p><em>Next time</em>. Who says there’ll be a next time? But he doesn’t seem to think it strange.</p>\n<p>“I won't.”</p>\n<p>My hands move over his body, his thighs parting for me at the merest pressure. He’s all heat and drive and tension, with a tingling energy that seems to spark under my fingertips. “I want to watch you. Next time,” I tell him, and then my fingers seek out the puckered skin of his arsehole and find it wet and ready for me, and I nearly lose my head.</p>\n<p>I slide my finger inside and he makes a small, fierce sound of encouragement. I don’t wait, adding another finger, pushing past the ridged rings of muscle. He’s lubed, but – <em>Merlin</em> – he’s certainly not loose. I push inside again and twist, feeling the resistance, the friction and heat, while Potter shudders as much as he ever did for the collar.</p>\n<p>He mouths at my neck, his hands gripping my biceps. “Fuck, I want you inside me.” He growls it out against my skin like a threat. “Damn you, Malfoy, I <em>need</em> you inside of me.”</p>\n<p>Hell, the feel of him around my fingers, slippery and tight. His words are like liquid fuel tossed onto a flame. I fumble with the bottle and slick myself up, quick and impatient, and it <em>still</em> takes too long.</p>\n<p>Potter watches me with ravenous eyes. “Yes, now. Come on, yes.”</p>\n<p>“Quiet,” I say, sharply. I can’t bear the ache of wanting him so much. The collar pulses and he bucks on the bed and moans. <em>Oh, god</em>. I go to part his legs again while he’s still writhing and he draws his knees up and holds them apart for me. <em>Sweet Salazar</em>. I think I might hurt him with how quickly I have to be inside him. It feels like life and death.</p>\n<p>“Draco. Draco,” he pants, and I feel a fierce flash of hunger for him. “Wider,” I tell him, and he stretches himself open, letting out a deep groan that sounds right on the border between pain and pleasure.</p>\n<p>The sight of him holding himself ready for me, his powerful body quivering for it, stirs a kind of madness in me. I thrust into him, savage and deep and determined. His body struggles against the fullness before yielding to me, and I’m glad. It makes it all the sweeter when I’m finally seated inside him and he’s under me, wild-eyed and breathless and fiery.</p>\n<p>It’s better than I ever dreamed. So much better.</p>\n<p>“Fuck... you’re still so tight,” I grit out.</p>\n<p>“Good. Wanted it like that. Wanted to feel you,” he pants. His legs wrap around me, as if urging me on, and I drive into him with hard, relentless strokes until he can’t speak, can’t do anything except lie there and take it. His eyes are shut, his mouth hangs open, and he’s gasping with the intensity of it. I feel far too close to the edge. Far far too close to losing myself in him. I have to summon every shred of self-control to stop myself just ramming into the sweet tightness of his body until I’m spent.</p>\n<p>“Look at me,” I tell him, and he takes a great shuddering breath and opens his eyes, and somehow keeps them open all through the wave of sensation from the collar. His body clenches around me, achingly erotic, and again I teeter on the edge, but more than that, the intimacy of the whole act jolts through me, strange and shocking. The way it feels to have Potter under me, so willing and so full of need.</p>\n<p>As the peak passes he pulls me in, hand clasped on the back of my neck, for a kiss, his mouth open and greedy, sloppy and rough and tender all together. He tastes of salt and heat and something dark and smoky, something I could lose my head over. I move inside him, wanting to bottle the moment that he arches up to meet me and I sink even deeper.</p>\n<p>I move again and he’s lost in it, head tipped back and hands tightening around my hips to pull me closer. He holds nothing back, and it almost frightens me, the rawness of it. I nuzzle his neck as I fuck into him, breathing the bright tang of his cologne and the scent of his skin, warm and intoxicating. Hot coils of delight flood through me – my thighs, my stomach, my balls, the very core of me, all thrilling with sharp bursts of pleasure as my prick drives deep into him.</p>\n<p>He’s making little desperate growls in his throat. “Don’t stop. Don’t stop. God, fuck me hard.”</p>\n<p>And finally, it’s like a dam bursting. All of my reservations. My scruples. My self-control and my doubts. All swept away in the face of Potter’s desire. I give him everything I’ve got, and I feel as if I might break with the bliss of it. The bed is rocking against the wall. I hear myself grunting, low and brutish, and I can’t stop.</p>\n<p>“<em>Yes</em>. Draco. You beautiful bastard.” He looks wrecked, his hair damp with sweat, face flushed and wild. I thrust in, almost cruelly, one more time, and then hold every muscle in my body rigid as I struggle against the ferocious tide of orgasm waiting to flood through me.</p>\n<p>He’s panting beneath me. He grinds our bodies together, his mouth falling open at the friction. “So close...” he moans. “So fucking close.”</p>\n<p>I look down between our bodies, at the slick pool of sweat and pre-come gathering on his stomach. At his cock, cruelly hard and flushed such a deep pink. I pull out a little and watch it jerk, his stomach clenching, his arse gripping me sinfully tight.</p>\n<p>He makes a tortured sound. The tendons in his neck are standing out above the collar. I’d almost forgotten he was wearing it. Almost, but not quite.</p>\n<p>“Tell me how it feels,” I whisper.</p>\n<p>“<em>Uhhh</em>. Can’t.” The collar flickers and he twists his neck from side to side.</p>\n<p>“<em>Tell me</em>, Harry.”</p>\n<p>“<em>Uh.</em>”</p>\n<p>I should feel bad for insisting. He’s almost beyond speech.</p>\n<p>“Feels so good.” As soon as he’s spoken, another surge passes through him and he’s gasping, high and out of control.</p>\n<p>“Tell me. More.”</p>\n<p>“Oh, hell. Feels like... fucking heaven, Malfoy.” The next rush hits him, and he pants and moans while his arse twitches around me. “You inside me, I could die happy, you know?”</p>\n<p>“Yes. More.”</p>\n<p>“Ah. I knew you’d be like this.” He shudders beneath me, his hands clutching at the sheets. I can’t take my eyes off him. His eyes squeeze shut, his face twisted, and I don’t know if it’s the collar or simply the roll of my hips that makes him gasp as I seek out every last hidden, secret inch of his body. “Ahh. “You’re so fucking – <em>uhhh</em> – proper all the time. I knew you’d be filthy once you got going.”</p>\n<p>Every muscle in my body is poised ready to dive over the brink, every nerve clamouring to empty myself inside him. “Come,” I say, and his eyes widen for a moment as the collar flickers with muted colours. “Come, Harry. Come <em>now</em>,” I tell him, low and insistent, and then his prick twitches again and he groans so low, so profound, like it’s being dragged out of him. His breath is erratic, juddering, and then his body is arching so hard that he nearly unseats me. The first long spurt of come hits his chest and I drive in, deeper and deeper, a raging, roiling heat rising and simmering over as he comes apart underneath me. I cry out, his cock jerking between us, the collar pulsing furiously, and then I don’t know anything except pleasure, pure, unstoppable pleasure, bursting white hot and dazzling inside me.</p>\n<p>~***~</p>\n<p>And then there’s afterwards.</p>\n<p>After sex, Potter apparently likes to behave like a large, rather hairy blanket. His limbs are loose and heavy and wrapped around me, keeping me ridiculously warm. His eyelids are heavy, too, sleepy and sated as he lets his gaze wander over my face. I find I don’t actually mind it. In fact, I could even sleep like this, and sleep well, I’d wager, with Potter draped around me instead of the bed linen. I have no idea what time it is, but it looks like dusk is falling outside.</p>\n<p>“Can I stay?” he asks.</p>\n<p>“Mmm,” I answer. “All right.”</p>\n<p>Perhaps we can have some dinner. Split a bottle of wine by the fire. And then...</p>\n<p>“Might drift off for a bit, if you don’t mind,” Potter mumbles. “I was on stake-out three nights this week.”</p>\n<p>“Be my guest.” The thought of him curled up in my bed has an appeal of its own. My eyes fall to the collar, and I run my fingers over it appraisingly. “Are you keeping this on?”</p>\n<p>“Hmm. I could do. I kind of got used to it, you know? But it’s probably better to take it off for sleeping, I guess.” He opens one eye to squint at me. “Although it might be entertaining when you tell me to stop snoring or something.”</p>\n<p>“You snore?” I ask, in unimpressed tones.</p>\n<p>His hand trails across my hip. “And what if I do? Going to make something of it, Malfoy?”</p>\n<p>“Absolutely. You can sleep in the other room if you do.” I wind my hand through the hair at the nape of his neck, pull him close to me so that our mouths almost touch and I can taste the smoky heat of his breath.</p>\n<p>“Oh yeah?” He smiles against my mouth. “Try and make me.”</p>\n<p>“Perhaps you had better keep the collar <em>on</em>,” I tell him, tightening my grip just a little bit. Just enough for him to feel the tug on his scalp.</p>\n<p>He raises an eyebrow. “Perhaps I better had.”</p>\n<p>I can feel his cock stirring against my leg. “Not so sleepy now?” I ask.</p>\n<p>“Mmm. Maybe not. I knew this was one of my more brilliant ideas.”</p>\n<p>“Which?” I prop myself up on one arm and stare at him sternly. “Do you mean messing about with potentially Dark objects? Stealing Ministry property? Or blatantly seducing a work colleague?”</p>\n<p>I feel his laugh resonate against my shoulder. “Oh, all three, I’d say, wouldn’t you?”</p>\n<p>“At least one of those is illegal and the other two are extremely inadvisable.”</p>\n<p>He laughs some more, then pulls away looking sober. “Malfoy… Er. I don’t want to make any assumptions.”</p>\n<p>I wait as he runs a hand through his hair, rumpling it into even more of a mess while he considers what to say.</p>\n<p>“But, is this going to happen again, do you think?” he continues. “Because it would probably be smart to tell Robards… if we don’t want to both get the sack, that is. And I doubt I’d be allowed to be your escort any more.”</p>\n<p>He has a point. No more Potter cracking bad jokes while I’m disarming a particularly vicious Spine-Crushing curse? No more Potter parking his distracting arse wherever I’m trying to work? That alone would be incentive to continue. But there are other, more pressing reasons.</p>\n<p>My hand fits itself to the small of his back, pulling him in so that he can feel my prick hardening against him.</p>\n<p>“It’s certainly going to happen again. In fact, I think it’s going to happen again <em>right now</em>.”</p>\n<p>That makes him laugh again, and I realise how addictive a sound it is. Low, and rich, and warm. I kiss him hard, the taste of his mouth making need flame through me. How shall I have him this time? On his knees? On his stomach? Merlin, the way he’d look straddling me, every muscle taut as he rides my cock—</p>\n<p>Potter interrupts this pleasant train of thought. “It is a bit of a shame, though, don’t you think?”</p>\n<p>“Oh?”</p>\n<p>“Yeah. I mean, Doris on rotas will be devastated not to have me popping in all the time.”</p>\n<p>“Potter.”</p>\n<p>“Yeah?” he breathes, as I take his cock in my hand, marvelling at the smooth, hot heaviness of it.</p>\n<p>“Shut up and let me fuck you.”</p>\n<p>The collar flickers, and as he begins a slow ecstatic croon, I cover his mouth with mine and drink in every sound, every sigh, every glorious, heaving breath.</p>"
}