{
  "id": "6678169",
  "url": "https://archiveofourown.org/works/6678169?view_full_work=true",
  "author": [
    "itsmylifekay"
  ],
  "title": "unintended consequence",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "One Piece"
  ],
  "relationships": [
    "Roronoa Zoro/Sanji Vinsmoke"
  ],
  "characters": [
    "Roronoa Zoro",
    "Sanji Vinsmoke",
    "Nami (One Piece)",
    "Nico Robin",
    "Monkey D. Luffy",
    "Tony Tony Chopper",
    "Usopp",
    "Franky (One Piece)",
    "Brook (One Piece)"
  ],
  "additional_tags": [
    "Getting Together",
    "Post-Time Skip",
    "Translation Available"
  ],
  "language": "English",
  "series": "",
  "published": "2016-04-27",
  "completed": null,
  "words": "7,772",
  "chapters": "1/1",
  "comments": "386",
  "kudos": "20,742",
  "bookmarks": "3,414",
  "hits": "145,645",
  "summary": "<p>Imagine person A making person B a friendship bracelet, expecting person B to never wear it, but when it’s given to them person B puts it on and is rarely seen with it off.</p>\n<p>A group of marines charge, Zoro slices through them, and in that instant Sanji feels his own eyes grow wide. Because there, on the arm now outstretched towards him, steel glinting in hand, is the stupid bracelet he’d given Zoro. The bastard is actually wearing it.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p> </p>\n<p>Fragrant strands of flowers sway above Sanji’s head, various shades of purple and pink that create a soft petal sky overhead. The island they’ve docked at this time is extraordinarily beautiful, endless fields of lush grass and delicate wildflowers, buildings webbed with blooming vines, air heady with nature’s perfume. The market is beautiful as well, of course, and the food they have to offer is a pleasant change from the heavier fare the last couple of islands had to offer.</p>\n<p>There are delicate pastries, sweet jellies, various kinds of honeys and sauces and vinaigrettes. Sanji’s fingers are already itching to try some of his own combinations and recipes. For now, he’s just looking, mentally cataloguing the different shops so he can come back later and be as efficient and cost effective as possible, but he takes the time to stop into a small cafe, always eager to try what the locals have created with their years of experience with what their island has to offer.</p>\n<p>He’s just finished his meal when he spots it, a rather rickety looking stall across the street and a few shops down. There’s an elderly woman standing behind it with a pipe between her lips and an easy smile crinkling her face. Finishing his tea in a few careful swallows, he stands and heads out, leaving his money on the table and sauntering over to the stall that has caught his eye.</p>\n<p>The old woman smiles up at him, barely coming up to his ribs. “How can I help you, young man?” Then she gets a better look at his face, where his gaze has fallen to the small jars at her elbow, and a knowing glint comes to her eyes. “Ah, you have a keen eye, don’t you? Not many passing through here take the time to look so closely.”</p>\n<p>Sanji returns her smile, “I try my best to appreciate beauty, especially when it comes to food.”</p>\n<p>The jars are a light coloured honey, comb submerged, with an assortment of tiny wildflowers pressed onto the lid. They’re dainty and elegant, certainly something the ladies of the ship would appreciate.</p>\n<p>Then he notices the colorful bracelets hanging from the overarching sign, almost a mimicry of the petals overhead, pink and purple threads woven together.</p>\n<p>“Those are a traditional craft here on the island,” she explains, “they’re meant to signify friendship, colors chosen by the one who gives it to depict the nature of their bond.”</p>\n<p>Sanji’s eyebrow lifts. <em>Friendship, eh?</em></p>\n<p>“So there are colors besides purple and pink?”</p>\n<p>The woman’s gaze becomes shrewd, eyes twinkling. “What did you have in mind?”</p>\n<p>-----</p>\n<p>[A few days earlier]</p>\n<p>“Oi, oi, what is that??”</p>\n<p>A gull squawks overhead, followed by a burst of feathers and a triumphant cry from Luffy.</p>\n<p>“It’s the paper!”</p>\n<p>Quick as a flash, half the crew is crowded around him, eager for the latest news and the possibility of updated wanted posters. Their voices all run together until Luffy’s voice suddenly carries above the rest, “Eh? Zoro, Sanji, why are you in the paper?”</p>\n<p>“What? Why do they get their own article?” Usopp shouts, wrestling the paper from Luffy and looking for himself. “What about the great Sogeking?”</p>\n<p>Sanji exhales a stream of smoke and starts walking over, ignoring Usopp’s continued clamoring and the subsequent battle for the paper. “An article?” A thought suddenly hits him and a spark of hope flares in his eyes. “Is there a picture?”</p>\n<p>“Mmmm,” the paper rustles some more as the squabbling stops long enough to check. “Ah,” Luffy yells. “There is, there is! Awesome, you guys look so cool! Hahahaha.”</p>\n<p>A rubber arm bursts out of the small huddle and Sanji comes face to face with what is indeed a picture of him and Zoro, taken in the middle of their latest fight with a rowdy and brutish group of pirates. Sanji can already tell Zoro has that demonic look on his face, the way the photo is framed immediately drawing the eye to his crazed grin and shadowed face, single sword glinting as he finishes slicing through a swath of the other crew’s men. Sanji is only a few paces away, in the middle of a spinning handstand, legs outstretched and...derriere in full view of the camera. Not even a glimpse of his face.</p>\n<p>“Fucking assholes,” he grumbles, teeth clenching around his cigarette. “Don’t they know how to take a picture?” Because really, how hard can it be to take one decent shot of him? Especially with the infamy surrounding their crew and how often Luffy got them mixed up in world affairs.</p>\n<p>“What is the article about, Luffy?” Robin asks, voice soft and face impassive behind her sunglasses. But there’s just enough of a faint smirk to her lips to have Sanji glancing warily at the swordsman still napping on the other side of the deck, apparently unbothered by all of the commotion. The stupid moss-head.</p>\n<p>“Inside the Strawhat Pirates: Roronoa Zoro and Blackleg Sanji,” Chopper reads, which isn’t too surprising considering the similar piece written on Luffy the previous month, so Sanji doesn’t understand why the little reindeer’s eyes go wide until he continues, “A-A bond forged in hell.”</p>\n<p>“Bond?” he repeats. “What the hell does that mean?”</p>\n<p>Usopp is laughing at Chopper’s fretting while Luffy looks on in confusion. Franky thinks it’s <em>super</em> but Sanji is far from convinced. After all, what kind of <em>bond </em>could people possibly think they have?</p>\n<p>“Apparently you and that idiot are the best of friends,” Nami snickers, answering his unspoken question. She’s managed to swipe the paper in the moment of confusion and flicks it once before reading out loud, “Based on their ability to combine their individual fighting skills in the midst of the most heated battles, despite their ruthless and unyielding reputations, it must be that their relationship has surpassed that of crewmates. The feared Pirate Hunter Zoro and Black Leg Sanji have found a best friend in one another. After all, such an ease with one another can only come from a profound depth of understanding, truly a friendship forged in the firey pits of hell.”</p>\n<p>A howl of laughter from Usopp only makes Nami’s cat-like grin grow wider and Sanji can see that Zoro’s eye has finally opened, surveying the scene with a carefully schooled expression.</p>\n<p>“Eh? Best friends?” Luffy asks. “That’s awesome! But nakama are <em>supposed </em>to be best friends.”</p>\n<p>“Not all crews take being nakama in such a way,” Robin explains. “The paper is simply highlighting the special connection between our dear cook and swordsman.”</p>\n<p>And that, that is just too much for Sanji to handle.</p>\n<p>Whoever wrote the article obviously doesn’t know what friendship looks like, or at least has never actually seen he and Zoro together, because anyone who’s ever watched the strawhats for more than fifteen seconds knows Sanji and Zoro bicker like cats and dogs. Hell, they end up arguing and fighting with each other during battles as much as they fight their opponents.</p>\n<p>“Robin-swan, not you too!” he cries, twirling towards her and Nami and fixing them with his best puppy look. “The only special bond I have is with you lovely ladies~” He hears a low snort and whips around to glare at the stupid marimo still nestled in place on the deck. “Got something to say, moss-head?”</p>\n<p>There’s a beat of silence, a deep sigh, and then, “Annoying.”</p>\n<p>Sanji’s eyes glint. “Hah?”</p>\n<p>“I said you’re annoying,” Zoro growls. “Your ears as shitty as your cooking?”</p>\n<p>“You-” Sanji grits his teeth, stalking away from the rest of the crew to kick Zoro in his stupid, ugly mug, but gets the sword that comes up to block him instead, heel and blade colliding and pushing against one another. “Say that again you shitty marimo.”</p>\n<p>Zoro grunts at him, flinging his leg away with a quick slash and getting to his feet, sword still drawn and ready.</p>\n<p>Escalating from insults to blows to a brawl, they soon end up panting and staring at each other, swords and shoe locked together until Nami yells at them to shut up and stop disturbing everyone else. They step apart and head their separate ways, but not before Sanji hears Zoro mutter, “As if we could ever be friends.”</p>\n<p>-----</p>\n<p>Over the following days as they had approach the island, Zoro continues to bristle any time someone brings up the joke. And the more Zoro bristles, the more Sanji pushes the issue. After all, he and Zoro always fight and push each other’s buttons, and if he’s found a new button to push it’s not like he’s going to pass up the opportunity.</p>\n<p>It certainly isn’t his fault the marimo is taking the article the wrong way. Because really, he and Zoro? Best friends? Don’t make him laugh. And the fact that some random reporter is the one who decided that they were somehow closer to each other than the rest of the crew, and was spreading that crap across the world, just made it more hilarious.</p>\n<p>So when he’d heard the old lady’s story and seen the inoffensive piece of jewelry he just couldn’t help himself and had subsequently spent the next twenty minutes of his precious shopping time picking out and braiding strands of black and green threads.</p>\n<p>When he gets back to the ship, having recruited Franky to be his pack mule since the marimo was nowhere to be found, he can hardly suppress a mischievous smile as he sees Zoro slouched down at the foot of the foremast. The bracelet is safely bagged and tucked away in his breast pocket and it stays there as he unpacks and sorts through the new supplies, putting everything in their proper places and locking the fridge before strolling back out onto the deck. Zoro hasn’t moved and Sanji is soon standing in front of him, throwing him into a shadow that has Zoro blinking and grunting up at him in displeasure.</p>\n<p>“What do you want, shit-cook?”</p>\n<p>Sanji plucks the small bag from his pocket and tosses it towards Zoro’s chest, keeping his face carefully neutral as Zoro inspects it. “I got you a gift,” he says, taking a drag of his cigarette to hide the smile tugging at his lips. “It’s a friendship bracelet, apparently they’re a tradition on the island.”</p>\n<p>Now he doesn’t bother hiding his grin, lets it curve smug and triumphant across his face. And Zoro’s just staring at the thing, like he can’t quite comprehend what he’s holding.</p>\n<p>His moment of glory is cut short when Luffy suddenly crashes into the deck, nearly knocking Sanji off his feet with the force of the impact and throwing up a cloud of dust.</p>\n<p>“Sanji,” he yells. “I need meat! This place stinks, they keep trying to feed me flowers.”</p>\n<p>As if on cue, Robin and Nami step back onto the deck, Nami’s arms full of shopping bags. “Are we having dinner soon, Sanji?”</p>\n<p>“I’ll be curious to see what you do with some of the local fare, cook-san.” Robin walks past him with a few new books tucked under her arm and Sanji can’t help but swoon.</p>\n<p>“I’ll get started right away, Nami-chwan, Robin-swan~”</p>\n<p>And just like that, the joke is over. Not as eventful as he’d hoped it would be, but he got to see the blank look on that bastard’s face at the very least. Most likely Zoro had already thrown the thing overboard, with a scoff and a glare and a silent vow to slice him in half.</p>\n<p>------</p>\n<p>Sanji’s sure Zoro threw the thing overboard. He’s sure of it.</p>\n<p>He doesn’t see the swordsman the rest of the night, their respective duties and sleeping schedules keeping them from really crossing paths, but the next morning they come face to face bright and early, Franky waking them all up because of a navy ship coming into the area faster than he’d like.</p>\n<p>It’s a flurry of activity, preparing the ship to sail on such short notice, Sanji and Chopper dashing into town to get a few last supplies as the others stay on board and try to keep their captain from going into attack mode. (Nami’s recently made a rule that they can’t just pick fights with anything that comes their way. They need to be more economical with their time, which often means physically restraining Luffy from flying off towards oncoming ships.)</p>\n<p>This particular morning they’re only partially successful. They pull out of harbor and head out to sea but the ship has already spotted them and adjusted its course, gaining fast with the oncoming wind. They could use a coup de burst but Luffy is literally bouncing with energy so Nami sighs and acquiesces, telling him to at least finish up quickly. Unfortunately, Luffy’s version of a quick and tidy victory is grabbing both Sanji and Zoro from their positions on deck and sending them all flying (and crashing) to the enemy ship.</p>\n<p>“What?” “Holy-” “Is that-?” “Strawhat!”</p>\n<p>A voice booms over the rest, “Stop them!”</p>\n<p>And just like that the boat bursts to life around them, marines yelling and taking up arms, charging at them from all sides. Luffy is a blur of fists already and Sanji huffs out a breath, taking a long, relaxed drag of his cigarette and looking at the sky. Honestly, Luffy didn’t even need to bring him or Zoro along, but he’s not going to pass up the opportunity to blow off some steam, and apparently neither is Zoro, who’s gripping the hilt of one sword with a familiar, bloodthirsty glint to his eye.</p>\n<p>A group of marines charge, Zoro slices through them, and in that instant Sanji feels his own eyes grow wide. Because there, on the arm now outstretched towards him, steel glinting in hand, is the stupid bracelet he’d given Zoro. The bastard is actually wearing it.</p>\n<p>He doesn’t have time to dwell on what that means before he’s forced into action himself, delivering a sweeping kick to the marines who’ve advanced his way. It’s only one ship and it’s not heavily armed, with no high ranking officers on board, so they finish up fairly quickly, back on their own deck in a new cloud of Luffy-induced dust in no time at all.</p>\n<p>And that bracelet is still on Zoro’s wrist.</p>\n<p>And it stays there for the rest of the day and into the next, sitting tauntingly against tan skin and driving Sanji slowly mad. Because Zoro hasn’t brought it up, hasn’t used it to tease or goad him, has just been going about his normal business as if nothing’s changed at all.</p>\n<p>Sanji’s convinced it’s some kind of scheme.</p>\n<p>Obviously, Zoro knew how eager Sanji had been to mess with him and had decided to turn the tables, and is now enjoying watching Sanji slowly suffer, dragging it out like the sick bastard he is. Sanji’s close to snapping when they sit down for dinner, his eyes unconsciously flicking to the dark threads looped around Zoro’s wrist.</p>\n<p>Then, as if his life couldn’t get worse, Nami notices. Her eyebrows lift and she gives Zoro a curious look. “Are you wearing a bracelet?”</p>\n<p>Zoro hardly spares her a glance, just keeps eating what’s in front of him and gives a guttural, “Ah,” between swallows.</p>\n<p>Usually, Sanji would knock him upside the head for having such terrible manners towards a lady, but today he lets it go in the hopes that the conversation (limited though it may be) might offer some insight into the situation.</p>\n<p>Chopper leans over to get a closer look, “It’s nice. Where’d you get it?”</p>\n<p>Sanji tenses at that, but Zoro just says, “Last island,” and takes a generous swallow of the drink at his side.</p>\n<p>And the conversation dies at that, no one finding the topic interesting enough to pursue, especially not when prying information out of Zoro might as well be labeled a feat of God. Dishes clink and clatter and Sanji’s heart rate slowly returns to normal as the dinner winds to a close, nothing else out of the ordinary happening outside of Robin’s mysterious smile as she leaves the kitchen.</p>\n<p>Except he’s still confused, because Zoro had had the perfect opportunity to get him back and didn’t do it. And it only gets worse as days pass and that bracelet continues to live on Zoro’s left wrist. It becomes like his stupid bandana, always right there, somehow never getting sliced off in the middle of a fight.</p>\n<p>And Sanji...really doesn’t know what to do with that.</p>\n<p>And he especially doesn’t know what to do with the little spark of satisfaction he’s started to get every time he sees it.</p>\n<p>-----</p>\n<p>Somehow, things start to change. It’s so slow and subtle that the rest of the crew doesn’t seem to notice, honestly Sanji probably wouldn’t have realized it himself if he wasn’t so weirded out by the whole thing. As it is, he’s acutely aware of every incremental softening in the tension that’s always existed between him and Zoro.</p>\n<p>They still argue, Sanji would be worried about the state of the world if they didn’t, but it’s not as intense, less of a fight and more of a way to test each other and get rid of excess energy. They share space. They get through entire dinners without glaring in the other’s direction.</p>\n<p>One day, when Sanji feels the need to test what’s going on between them, when he has to make sure that this all isn’t some wild hallucination, he heads up to Zoro’s training room in the crow’s nest, a small box in one hand and a bottle of sake tucked under his arm. Zoro’s attention is on him as soon as he emerges from the hatch-- it’s not overt, Zoro’s still counting his reps and looking resolutely at the wall, but Sanji can just <em>tell </em>the swordsman’s watching him out of the corner of his eye<em>. </em>Finally, after Sanji’s walked over to the bench and taken a seat, Zoro shifts his full attention Sanji’s way.</p>\n<p>“Need something, ero-cook?”</p>\n<p>Sanji takes his time lighting a cigarette, leaning over to crack a window when he sees Zoro’s eyes narrow. “A break from Luffy. He’s been worse than usual, claims he’s still making up for the lack of meat on that last island.” He nudges the box in Zoro’s direction and places the sake bottle beside it. “I’ll even reward you if you let me stay.”</p>\n<p>There’s a flash of worry that he’s showing his hand a bit too much, but it’s overtaken by the warm feeling that grows in his chest as his eyes flick down, catching on the dark band around Zoro’s wrist before snapping back up to the swordsman's eye.</p>\n<p>“I’m not a dog,” Zoro grumbles, dropping his barbell carefully to the ground. “And who says I’d want your food as a reward anyway?”</p>\n<p>A spark of anger flares up and Sanji opens his mouth to shoot something back, take his peace offering and shove it up Zoro’s ass, but stops when Zoro suddenly sits down beside him, picking up the box and opening it carefully to inspect the onigiri nestled inside. Sanji forces himself to relax, lets a smug grin color his response, “My food is the best and you know it. Besides, I brought you booze. You never say no to booze.”</p>\n<p>Zoro lets out a low, noncommittal hum, already working on demolishing the snack Sanji provided. The water is glistening in the late afternoon sun and Sanji allows himself to drift, smoke curling from between his lips as they sit in silence, not exactly comfortable but not bad either, something he feels like they could get used to with time.</p>\n<p>But thanks to their captain the tentative peace doesn’t last for long, Sanji’s hiding place discovered when he’s halfway through his second cigarette, silence shattered when he’s forced to lean out one of the windows and holler back at Luffy’s whining, threatening all manner of bodily harm if the idiot dares go near his kitchen. Blowing out a thick cloud of smoke, he steps away from the window and towards the hatch, “It’s close enough to when I usually start fixing dinner, might as well go guard the kitchen.”</p>\n<p>“I’ll bring these down when I’m done,” Zoro says, surprising Sanji with how easily he says it. Surprising him further when he actually does it, appearing in the galley doorway an hour later covered in a fresh sheen of sweat with the empty box and bottle in hand. What surprises Sanji most of all, however, is when Zoro sets them near the sink then turns to Sanji and asks, “Need any help?”</p>\n<p>Normally, Sanji would say thanks but no thanks. Normally, Sanji would say like hell are you touching anything in my precious kitchen. Normally, Sanji wouldn’t be in this predicament at all.</p>\n<p>He looks at Zoro thoughtfully for a moment then clears his throat, turning back to the sink to quickly wash Zoro’s dishes as he says, “You could guard the door.”</p>\n<p>He’s aware it’s not exactly what Zoro meant, but he can’t help it (it <em>is </em>his precious kitchen after all). But Zoro doesn’t seem to mind, just settles himself by the door and starts to doze, waking up to shout at their captain when he tries to break in a third time.</p>\n<p>It’s convenient, enough so that when Zoro asks a second time Sanji says yes, again, and again, until days slip into weeks and Zoro’s become a near fixture in his kitchen, napping by the door or doing small tasks beside him at the counter.</p>\n<p>They’d started small, carrying supplies up from the storeroom, boiling water, grinding spices. Simple, safe.</p>\n<p>Then Sanji had armed him with a knife.</p>\n<p>He’d seen the flash of a smile on Zoro’s face as he sliced fruit for some afternoon smoothies and knew right then there was no going back, not when that stupid bracelet was still tied tightly around Zoro’s wrist, soaking up sweat and strawberry juice and doing funny things to Sanji’s heart.</p>\n<p>-----</p>\n<p>“Luffy you idiot!” Usopp yells. “Why would you attack marines for no reason?”</p>\n<p>“They were eating all the meat,” Luffy whines back, ear caught between Nami’s fingers as she drags him through the latest city’s narrow alleys and backstreets with the rest of the crew in tow.</p>\n<p>Once they make it to a fairly safe distance Nami slows and knocks Luffy upside the head. “Now we have to leave and you don’t get any meat. And we can’t get supplies.”</p>\n<p>It’s quiet for a moment, Luffy nursing the bump on his head while everyone else stands around to see what they’re doing next, no one particularly concerned with the circumstances except Usopp and Nami. Luffy looks between the two of them then at the rest of the crew; his eyes lock on Zoro’s a bit longer than the rest and then he’s laughing, jumping to his feet with a hand on the back of his hat. “I don’t want to run. I want meat.”</p>\n<p>“They’ve already seen us,” Zoro shrugs. “We should just kill them and take their supplies.”</p>\n<p>Nami sighs, “You two are impossible.”</p>\n<p>And that’s how they end up running around the city fighting marines, split up to cover the most ground with Nami, Sanji, and Chopper heading to the marine ship; Franky, Usopp, and Brook guarding Sunny; and Zoro, Robin, and Luffy left in the city to contain any of the marines who get in the way.</p>\n<p>It’s also how they end up with as many stolen goods as the three of them can carry, meeting Franky at the Thousand Sunny so he can help lift them onto the deck, leaving Sanji free to head back into the city and collect Luffy and Zoro, since Robin had already made her way back to the ship, perfectly timed as always.</p>\n<p>Luffy is easy to find, with his loud voice and louder laughter, and he’s easy to convince as well, springing back to the ship as soon as Sanji mentions the treasure map Nami had found, the promise of new adventure always too good for him to resist. Finding Zoro takes a bit more finesse, a certain skillset that Sanji has gotten better with over the years. And once he finds him, leading him back to the ship is a different skillset all together. It’s gotten easier, though, as of late. Zoro fights him less, sticks closer. When he turns down a wrong side street, Sanji can reach out and tug him back, take another drag on his cigarette and let the sound of the ocean guide him back to Sunny.</p>\n<p>Getting the supplies had been laughably easy, and Sanji finds out why when he hears Luffy whining about Zoro stealing all the fun. Apparently he’d come upon a large part of the unit and its leader trying to get in contact with headquarters and taken it upon himself to cut the conversation short. Which meant the rest of them were left alone while Zoro created his own personal bloodbath. Fighting with swords is always messy, it’s why Sanji doesn’t usually worry too much when he sees Zoro sticky with blood, it’s why <em>Zoro </em>doesn’t mind being covered with the stuff. Sanji’s seem him clean his swords and eat his dinner and pass out on the deck still red and tacky from an afternoon’s fight.</p>\n<p>In fact, Zoro’s inclination towards personal hygiene is alarmingly low. Sanji likes to keep himself and his clothes fresh and clean, which means daily showers and regular sessions of doing laundry. It’s a good week if Zoro’s showered twice, a good month if he’s done his laundry. (He’ll rinse off in the ocean nearly every day, but Sanji doesn’t consider that bathing. Or doing the laundry... no matter what Zoro insists otherwise.)</p>\n<p>So he’s understandably surprised when he walks into the kitchen and sees Zoro standing at the sink, washing his hands and scrubbing at his arm with a determined look on his face. He’s about to blow a gasket and punt the man out of his kitchen for washing his grimy self off in the kitchen sink instead of the bathroom but stops when he notices what <em>exactly </em>Zoro is washing. Or trying to wash, would probably be the more accurate description. And it’s that damn bracelet.</p>\n<p>Stepping up beside the other man, Sanji bumps him carefully, shoulder to shoulder for just a moment. “What’s wrong, marimo?”</p>\n<p>“Nothing,” he says, still scrubbing and not looking up.</p>\n<p>Sanji considers his options, eyes the knife block just an arm’s length away and prays he’s read the situation right. Carefully, with as much nonchalance as he can muster, he reaches out and wraps his fingers around Zoro’s arm, pulling it towards him and tracing over the wet threads with his thumb. Some of the green is slightly stained, a bit darker than the rest, and Sanji spares a moment to wonder if one day the entire bracelet will be black. But for now it’s not what Zoro wants, so he releases Zoro’s arm, holds out his hand instead.</p>\n<p>“Give it here, I’ll clean it for you.”</p>\n<p>There’s a beat of silence, Zoro leveling a piercing stare at Sanji before he finally looks down, unties the bracelet with careful fingers before dropping it into Sanji’s waiting palm. There’s a strip of paler skin in a band around Zoro’s wrist and Sanji has to stop himself from reaching out to touch it, to feel warm skin and know that somehow he had a part in creating the mark beneath his fingers.</p>\n<p>Cold water, a dash of salt, and a fair amount of elbow grease later the bracelet is nearly back to its original colors. He rinses it one last time then shuts off the sink, takes a steadying breath in the sudden silence and runs the pad of his thumb over the knots in the threads. Zoro’s still waiting by the sink, one eye watching Sanji carefully as he lifts his arm, palm down, an invitation that Sanji finds himself unable to resist as he carefully loops the band around Zoro’s wrist and ties it back into place, letting his fingers linger slightly longer than necessary, tips sliding along the space between skin and thread before he steps back and digs in his pocket for a cigarette.</p>\n<p>Something sparks in his chest, something warm and entirely too familiar. He glances up at Zoro, breathing in a lungful of smoke and sighing it out again.</p>\n<p>He might just be well and truly fucked.</p>\n<p>-----</p>\n<p>It’s a slow afternoon on the Sunny, another in a recent line of uneventful days. Franky and Usopp are in their workshops, the ladies are relaxing on deck, and Brook is amusing Luffy and Chopper with a new piece he’d created the night before. Taking a last look out at the horizon and deciding they aren’t in any imminent danger, Sanji heads for the crow’s nest, grabbing a glass of water and his recipe book from the kitchen on his way.</p>\n<p>The space is filled with afternoon sun, glinting off the metal of the weights as Zoro lifts them again and again, the curve of his muscle bunching with each repetition, thick vein standing out along the side. Sanji sets the water down.</p>\n<p>A window is already propped open to let in the cooling sea breeze and Sanji leans against the sill, lights up a cigarette and lets smoke curl out into open air while Zoro continues his counting, voice quieter now that Sanji’s there. They tend to spend their time together in a comfortable silence more often than not, (at least until one of them gets bored and picks a fight). But the laziness that’s fallen over the ship is infectious and neither of them move to break the calm, sharing space as if they’ve been doing it all their lives instead of just a few careful months.</p>\n<p>When his third cigarette burns down to nothing, he snuffs it out in an ashtray he’s taken to keeping just beside the window-- his window-- the one he now finds open when he comes up to fetch Zoro for a meal or help in the kitchen, or simply to escape. The sun is sinking lower but there’s still a couple hours until he needs to start fixing dinner, so he settles down on a bench instead, recipe book open in his lap and glass of water now half empty by his side, Brook’s newest song drifting in through the window.</p>\n<p>Time passes peacefully and far too quickly. In what seems like the blink of an eye, Sanji knows it’s time for him to get up and get started in the kitchen. He loves his work, that still hasn’t changed, but he’s come to savor these quiet moments nearly as much as the food he makes.</p>\n<p>“Oi, dartbrow,” Zoro calls, the sun lower and clouds drifting in, weight held deceptively still against his shoulder as Sanji looks back at him from the hatch. “I’ll be down later. After this set.”</p>\n<p>Sanji smirks, eyes the ridiculously large piece of metal and taps the recipe book against his own shoulder. “Don’t strain yourself, marimo. Wouldn’t want to lose my pack mule.”</p>\n<p>Zoro scoffs at that and adjusts the weight in his hands just to show off, swings it in Sanji’s direction so he has to duck quickly down the hatch with a last shouted curse at the swordsman’s thick head.</p>\n<p>He’s halfway through preparations when Zoro finally walks into the galley, knocking once on the doorframe to draw Sanji’s attention. “Nami needed me to adjust one of the sails,” he says in way of explanation, “She says we’re close to another island and wants to steer clear of it to save time, so if Luffy asks don’t say anything.”</p>\n<p>“Not big enough to be worth stopping?”</p>\n<p>Zoro shrugs and leans against the table, “She doesn’t seem to think so.”</p>\n<p>“Then I’m sure it’s not,” he quips, always ready and willing to support his crewmates of the more delicate persuasion.</p>\n<p>Zoro grunts dismissively and grabs a knife from its holder, getting to work preparing the apples and strawberries for dessert. There’s not much left that he can help with this far along in the process, not much left to do at all but keep an eye on things as they cook until it’s time to put them all together, so Sanji takes the opportunity to watch Zoro work.</p>\n<p>His brow is furrowed in concentration and there’s a squint to his eye that says he’s trying to follow Sanji’s advice, cutting things just so in order to get the most out of the produce. He’s not wearing a shirt, so Sanji can easily see the movement of his muscles as he works, from the nimble work of his fingers to the shifting of his back. Sweat darkens the hair at his temples and the nape of his neck, running in small beads down his back before disappearing into the thick cloth of his haramaki.</p>\n<p>Sanji swallows and forces himself not to look away-- he knows it’s time to take the feeling in his chest and confront it, to stop trying to ignore what’s staring him in the face.</p>\n<p>Zoro’s not soft, he’s not pale and curvy like the women Sanji favors, but he’s still attractive in his own way. He’s someone Sanji trusts, can be comfortable with. He’s someone Sanji respects.</p>\n<p>Then, Zoro lifts his arm and wipes at his face, he’s smart enough to keep his hand out of the way but Sanji still bristles, kicking the other man in the hip so he nearly loses his balance, catching himself on the edge of the sink.</p>\n<p>“What the hell, shit-cook? What was that for?”</p>\n<p>“For being an idiot in my kitchen!” Sanji snarks back. “Next time, shower before you come, or at least make sure you’re not going to be dripping all over the food. You’re throwing off the salt content.”</p>\n<p>Zoro grumbles under his breath but acquiesces, washing his hands and forearms in the sink before throwing Sanji a look, smirking in a way Sanji definitely doesn’t like right before he dunks his head under the stream as well.</p>\n<p>“Idiot! What the fuck are you doing?”</p>\n<p>Laughing, Zoro rights himself, squinting through the water dripping down his face to smile in Sanji’s direction.</p>\n<p>All of the fight leaves Sanji in a whoosh, leaving him standing there feeling like he’s been punched in the chest. Zoro looks...he actually looks <em>cute </em>and Sanji is one hundred percent not ready to handle that. So he throws a dishtowel at the bastard’s face instead, effectively shielding himself from the deadly combination of Zoro dripping wet and <em>smiling </em>in Sanji’s direction, that stupid bracelet taunting him as Zoro ruffles the towel through his hair.</p>\n<p>Sanji doesn’t know whether he wants to kick him out or...do something else entirely.</p>\n<p>Thankfully a timer goes off and he’s able to shift his attention elsewhere, working at juggling all the pots and pans coming off the stove and resolutely not looking in Zoro’s direction. It works well enough, lasting him until he calls the rest of the crew for dinner and the galley explodes into a whirlwind of food and noise and conversation. Seeing everyone happy and well-fed around him takes most of the edge off, leaving him much more relaxed when dinner winds down and he’s once again skirting around Zoro in close quarters, picking up dishes with Robin’s help.</p>\n<p>Then they’re alone, Robin excusing herself to her books while Sanji and Zoro wash and dry, both lost in their own thoughts as the sun sets and night folds in around them.</p>\n<p>It’s dark outside when the kitchen is back in order, gauzy clouds masking most of the moonlight and painting the Sunny with blotchy shadows. Sanji leans out over the rail, obscures his own piece of the horizon as he blows smoke from between his lips. Waves lap gently at the ship, the sound as lulling as the gentle rocking they produce, and before long Sanji hears a yawn from below his elbow where Zoro’s propped himself up at Sanji’s side. The night is quiet, the stars muted, and the rest of the crew has already turned in for the night, so Sanji allows himself a gentle smile before he looks back out over the sea.</p>\n<p>When his cigarette is nothing but forgotten ashes, ember long burnt out in the water below, he feels a soft weight against the side of his thigh and freezes for just a moment before he looks down and sees a familiar shock of mossy green.</p>\n<p>“Oi, I’m not a pillow,” he says, but makes no move to extract his leg.</p>\n<p>Zoro snores softly in response.</p>\n<p>The ship moves forward and the stars move with it and Sanji can’t stop the warm feeling blooming in his chest, filling his whole body with a tingling weightlessness that makes the night seem somehow longer, stretched out and sweet like taffy. It’s not until a cool breeze pushes past the buttons of his shirt that he stirs, pushes himself up from the rail and glances back down at Zoro’s sleeping form.</p>\n<p>“Idiot,” he murmurs, sounding far too fond for his liking. He runs his hand over soft green hair, surprised at the softness he finds before he threads his fingers through the strands, catching and tugging ever so slightly until Zoro grunts and shifts against the deck. “Oi, sleep in a real bed, shitty marimo.”</p>\n<p>Zoro rumbles a response, something too low and garbled for Sanji to actually understand, but he holds out his hand, keeps it there until Sanji huffs, grabs it and pulls him to his feet. He rubs at his eye for a moment but still doesn’t let go, their fingers loosely tangled as he follows Sanji’s silent path to the bunks. (Sanji pretends it’s so Zoro doesn’t get lost, tries to ignore the soft look on Zoro’s face and the half-asleep trust he’s put in Sanji’s hands.)</p>\n<p>It’s dark downstairs but Sanji’s eyes can still pick out Zoro’s shape as they part and head to their respective beds. He can see the way Zoro settles down, right hand touching his left wrist in an unconscious confirmation before sighing and drifting off to sleep.</p>\n<p>Lying in his own bed, Sanji stares up at the ceiling, imagining the stars above and trying to ignore the lingering warmth against his fingers.</p>\n<p>-----</p>\n<p>Time passes, weeks go by, new islands come and go, and the strawhats are still getting themselves into all kinds of trouble. No matter where they are, the sleepiest of city’s or the loneliest of seas, adventure always finds them and Luffy sends them crashing into it at breakneck speeds. Not that the rest of them are guiltless, just as eager for new challenges as their captain, ready to take on the world.</p>\n<p>“You ready, shitty marimo?”</p>\n<p>Zoro smirks around his sword, “Try to keep up, ero-cook.”</p>\n<p>The air reverberates with the sound of thousands of voices come together in a single shout, countless marines charging at them with guns and swords held ready. An explosion rocks the ground as Luffy battles a captain not too far off in the distance and Sanji can see the rest of their crew fighting on the wings. But the majority of the fighting, that’s always left for him and Zoro. Luffy gets the big guns, the top dogs, but it’s he and Zoro who are left to take care of the rest, to look after the crew, to face whatever comes their way and have faith in their captain. They’re two parts of the monster trio and they take pride in that. And they’ve always been good at their job.</p>\n<p>But now, fighting together, it’s even better than before. It’s like they’re seamless, moving together across dusty cobblestones as a single force, linked by an invisible thread as they raze the men around them to the ground. Separating and coming back together, brushing shoulders and exchanging insults and wisecracks along the way; the entire thing is over in a flash, the air cloudy and the ground wet with blood.</p>\n<p>Neither he nor Zoro have a scratch.</p>\n<p>The energy crackling between them is nearly palpable, adrenaline singing in their veins as the fight ends and the high lingers. Their eyes lock and Zoro smirks, Wado going back between his teeth.</p>\n<p>Sanji huffs a laugh and can’t keep the smile off his face as he jumps, throwing a kick at Zoro’s chest that would send a lesser man flying. They go back and forth, shouting and kicking up dust, until they hear Nami shout from the edge of the destruction.</p>\n<p>“This isn’t the time for that, you idiots! Get back to the ship!”</p>\n<p>Sanji pulls back with a cheerful cry of, “Of course, Nami-chwan~” and Zoro sheaths his swords, falling in step beside Sanji as they make their way back. Their shoulders bump and Sanji can see the hint of a smile beneath Zoro’s cool exterior, can still remember it in his head as they’d fought, wild and free and full of slightly crazed laughter. He’s gone and fallen for an idiot but he can’t help himself, can’t help that he’d do anything to keep that smile alive.</p>\n<p>Chopper squeaks and runs around them as soon as they set foot on deck, jumping all over them to make sure they aren’t hurt.</p>\n<p>“We’re fine,” Zoro says, catching the little reindeer in the crook of one arm. “Those marines were useless.”</p>\n<p>“Don’t lie!” Chopper cries, struggling in Zoro’s hold to look him over more thoroughly. “You only look this happy after a challenge.”</p>\n<p>Zoro’s eyes widen slightly at that and Sanji hides a chuckle in his sleeve, lighting a cigarette to give himself something to do while Zoro stammers and tries to yell out excuses. Finally, Sanji knocks him in the back of the head then leans down to look Chopper in the eye. “There was a challenge, but it wasn’t the marines. We’re both fine.”</p>\n<p>There’s a beat of silence then Chopper’s yelling again, “You- Why were you fighting each other?? I’ve told you not to take it too far!”</p>\n<p>“Look closer, doctor-san,” Robin says, appearing out of nowhere to smile knowingly in their direction. “I think you’ll find they’re both in better condition than usual.”</p>\n<p>For some reason, Sanji finds himself blushing and excuses himself to the railing to smoke in peace, letting Chopper fuss over him for a few minutes before the doctor is truly convinced that they’re both unharmed.</p>\n<p>“Chopper those idiots are fine,” Nami says, leaning over the upper deck to glare at Sanji and Zoro. “Get your asses in gear and let’s get out of here! It’s your fault we’re late!”</p>\n<p>“Oi, what the hell’s that supposed to mean?” Zoro glares back.</p>\n<p>Sanji moves back into Zoro’s space. “It means shut up and get to work, stupid marimo. Didn’t you hear the beautiful lady?”</p>\n<p>“You shut up, dartbrow!”</p>\n<p>Swords come out and shoes fly but they don’t get very far before they’re sent crashing to the ground.</p>\n<p>“Both of you!” Nami lands twin punches to each of their heads. “Stop fighting and do your jobs!”</p>\n<p>They both stand, grumbling and glaring at one another, and walk off to get ready to sail, preparing to flee from whatever reinforcements the marines are sending their way.</p>\n<p>Hours later, out of dodge and out from under Nami’s thumb, they come right back together, Sanji looking out to sea with Zoro dozing at his side.</p>\n<p>-----</p>\n<p>They’ve fallen into a familiar routine by the time they reach the next island. They tease and spar and terrorize each other. They share space and quiet moments and the adrenaline of a good fight. The crew’s finally become privy to the change as well, recognizing the lack of real malice between their words and the way they’ve come to gravitate towards one another.</p>\n<p>To Sanji’s embarrassment, most of the reactions range from thinking it’s adorable to deeming it hilarious. But all in all he can’t complain, the crew’s happy that they’re happy and it doesn’t get better than that.</p>\n<p>He’s brought Zoro along to the market, ostensibly to serve as pack mule but he’s not bought anything yet, still in the stage of surveying all of the options. But when he turns to make a comment on the outrageous price of kiwis he finds that he’s alone. Heaving a sigh and running a hand through his hair, all Sanji can do is resign himself to his fate. That idiot got lost all the time, he’d find his way back eventually or Sanji would find him. There was no sense worrying about it now.</p>\n<p>And true to form, about an hour later Zoro wanders up to the stall he’s at, complaining about the streets moving and Sanji wandering off and everything looking the same. Sanji insults his sense of direction and piles his arms with supplies and doesn’t question it until later that night, when Zoro’s putting away the last of the dishes and clears his throat.</p>\n<p>“I got you something,” he says, fishing in his haramaki and dropping a small, gauzy bag into Sanji’s hand.</p>\n<p>He pulls the drawstring and a thin bracelet falls into his palm, black leather with a golden clasp. “This-” he starts, then stops, not quite sure what to say. His eyes flick to the bracelet on Zoro’s own wrist then up to meet his eye, gaze filled with challenge. But now Sanji can also see the tiny hint of uncertainty behind it, not in himself because Zoro doesn’t do things in halves, but in Sanji’s response.</p>\n<p>Now, Sanji can see the slight widening of his eye when Sanji’s gaze drifts down to Zoro’s lips, exhales a cloud of smoke, sharp and sweet before snuffing out his cigarette and pulling Zoro close, mouths coming together sharp and sure.</p>\n<p>Now, Sanji can smell the salt on Zoro’s skin and taste the sake on Zoro’s lips as he deepens the kiss. He licks and bites at Zoro’s bottom lip and revels in the soft groan it gets him, can hear the relief and the want and the trust in just that small sound. Their foreheads meet and their eyes lock and Sanji reaches down to trace the worn and faded threads that started it all, kisses away Zoro’s slight intake of breath.</p>\n<p>He pulls back just enough to let Zoro fasten the thin leather around his wrist, clasp a glint of light against pale skin.</p>\n<p> </p>\n<p>He never takes it off.</p>\n<p> </p>\n<p> </p>"
}