{
  "id": "6713596",
  "url": "https://archiveofourown.org/works/6713596?view_full_work=true",
  "author": [
    "xShieru"
  ],
  "title": "Fight club",
  "rating": "Mature",
  "archive_warnings": [
    "Underage"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "僕のヒーローアカデミア | Boku no Hero Academia | My Hero Academia"
  ],
  "relationships": [
    "Midoriya Izuku/Todoroki Shouto"
  ],
  "characters": [
    "Midoriya Izuku",
    "Todoroki Shouto",
    "Bakugou Katsuki",
    "Iida Tenya",
    "Uraraka Ochako"
  ],
  "additional_tags": [
    "Sexuality Crisis",
    "Fluff and Smut",
    "Minor Violence",
    "Frottage",
    "wherein midoriya freaks out because he has hot friends",
    "bakugou is an asshole and knows everything",
    "Getting Together",
    "Sexual Tension",
    "they're like fifteen so underage yo"
  ],
  "language": "English",
  "series": "",
  "published": "2016-05-01",
  "completed": null,
  "words": "7,766",
  "chapters": "1/1",
  "comments": "138",
  "kudos": "12,080",
  "bookmarks": "1,469",
  "hits": "117,003",
  "summary": "<p>In his defense, Izuku would mention the fact that they are <i>fifteen</i> and that sparring with an extremely attractive male – it‘s just the adrenaline rush, <i>really</i> - is bound to result in this. Social media had taught him that much, at least. </p>\n<p>It‘s just his rotten luck that his 'handsome sparring partner' happens to be his friend Todoroki Shouto. Which is entirely unfair and really bad for Izuku‘s poor rabbit-heart.</p>\n<p>(alternatively: Midoriya fights his sexuality, inferiority complex, feelings, and his crush)</p>",
  "notes": "<p>i honestly just dont wanna get rusty with my typing skills because ever since my last update i only opened word to type out 654651 page long essays and whatnot. </p>\n<p>also bokuaca is really damn good (even more so than it was like a year ago) and i die, tododeku is love.<br>(i have a lot of work to do, forgive me for the typos n grammar mistakes xoxo love you all)</p>",
  "text": "<p>Midoriya Izuku has never been a complete stranger to appreciating the finer details of those around him. Sure, he doesn‘t define one‘s personality based on what color their eyes are or how long their hair is, but he enjoys admiring the beauty of others whenever the chance presents itself. He often recalls his middle school years, remembers hormones awakening and running wild along with quirks. To say the least, that had left some weird memories of his old classmates in back then quirkless Midoriya‘s thirteen-year-old mind.</p>\n<p>Midoriya never had to deal with explosive hormones and quirks randomly acting up, setting his limbs on fire or gigantizing his nose whenever he talked to a pretty girl. He liked looking at pretty people, just like any other average joe out there, but that was it. Nothing more, nothing less.</p>\n<p>Some of his <em>not-quite</em> friends – courtesy of Kacchan who'd threatened every single person that actually tried to befriend Izuku, and you simply <em>did not </em>defy Bakugou Katsuki and get away unscratched, what a fucking prick,<em> really</em> – used to shove pornographic content in the form of mags and vids right into Midoriya‘s blushing, virginal face. He‘s never learned to appreciate that kind of stuff, dubbing himself as a love-type guy instead of an overly-sexual one, unlike everyone else around him. Well, it's not like Izuku <em>never</em> ventured into the dark depths of the internet, sometimes forgetting to delete his internet history afterwards, and then desperately trying to decipher the weird stares that his mother would send him over the breakfast table. In the end, looking at porn only made him feel disappointed in himself and left a bitter sort of aftertaste in his mouth at how fake everything was. Certainly, not his thing.</p>\n<p>Midoriya was fine with not projecting himself onto fake edits of five-minute-long videos. He never felt more than a simple appreciation towards the prettier girls in his old school, perfectly content with not having to see their panties just to feel this way.</p>\n<p>Because of that, he‘s been called <em>weird</em> and many other demeaning names, so naturally, once he got accepted into U.A., he had decided that it was the perfect time to start lying. Katsuki had stared him down, disbelief written across the small pinch of his ever-present frown, when he saw Midoriya nodding along to Kaminari‘s rants which involved dirty fantasies of Yaoyorozu in tight spandex and even tighter bikinis or whatever - honestly, Midoriya had been zoning out for the last six minutes. For all intents and purposes, this sort of 'mindless agreement' made him stand out less.</p>\n<p>However, despite his best efforts, trouble seemed to find Izuku fast, faster than he could wish it away.</p>\n<p> </p>\n<p> </p>\n<p>The girls in his class are pretty to say the least, and for some reason, Izuku always feels bad that even though he is well on his way to sweet sixteen, the hormonal panty-starved urges are yet to kick in. Why is it like that? Does he lack some vital nutrients, or is he still just a kid, not only appearance-wise?</p>\n<p>He does have a dream or two involving Uraraka Ochako, the swish of her green skirt vivid in his mind the morning after, but the dreams themselves aren‘t sexual in nature. They leave Midoriya‘s heart squeezing painfully inside his chest and his face flushing hot with shame and strange contentment. It isn‘t often that he dreams of the girls he likes. He's a rather heavy sleeper and tends to forget most of his dreams two seconds into awareness.</p>\n<p>“Maybe there‘s something wrong with me?“ Izuku muses yet again, mood dampening rapidly as he purchases a strawberry milk from the vending machine. He fiddles with the straw, trying to poke the foil seal open. It doesn’t abide.</p>\n<p>He'd managed to slip away from yet another heated debate involving the girls of Class 1A, getting a bit uncomfortable with the sudden onslaught of images involving his best friend in a pop idol outfit that left little to nothing for Izuku’s abused imagination. It makes Izuku wonder as to what had changed in the span of the last three months that he no longer wants to think of Uraraka in <em>that</em> kind of way. Perhaps the near-death experiences had left their mark on his psyche, who knows. Or it could simply be the fact that the topic was so rundown and overused that it no longer managed to catch Midoriya‘s interest whatsoever.</p>\n<p>The ever-present flush on his cheeks no longer surfaces at the mere mention of thigh-highs and Ashido‘s new boots.</p>\n<p>“Need help?“</p>\n<p>Midoriya startles and almost lets the milk box slip through his fingers like a foamy bar of soap. He lets out a sigh of relief when he manages to catch it just in time, glad that he somehow does it without accidentally activating One For All. He doesn’t want to end up cleaning the mess like the last time.</p>\n<p>“Iida, don‘t scare me like that,“ he huffs, heart pounding.</p>\n<p>“Sorry, I somehow didn‘t think you‘d get this affected,“ the taller teen replies and wipes at his damp forehead. Only now does Midoriya notice that one of his best friends is lacking the ever-tidy school blazer, the sleeves of his white shirt rolled up high on his meaty forearms. Iida slightly pants from blatant exertion. Without meaning to, Izuku‘s eyes trace the single drop of sweat that rolls down Iida‘s pointy nose. He swallows down the ball of nerves that has suddenly lodged itself deep in his throat and clears it for good measure. The awkward feeling doesn’t go away.</p>\n<p>“So, what‘s up?“ Midoriya tries, hoping his voice doesn’t quiver as he hands Iida the milk box, waiting for the other to open the darn sly thing already. “Were you working out in your school clothes?“</p>\n<p>Iida only huffs a light laugh, eyes trained on the pale pink straw. Thankfully. “No, I‘d never do such a thing. I just didn‘t expect... <em>uhh</em>, the entire second-floor gym when they said ‘cleaning duty‘, s‘all. I'm not exaggerating when I say this, but some dumpsters probably look neater.“ Blue eyes meet Midoriya‘s green ones and that lodged ball in Izuku’s trachea grows. It’s beginning to occur to Izuku that his best friend looks <em>unfairly good</em> when he’s tousled like that. From a purely objective point of view, of course, it’s not like—</p>\n<p>Iida then puffs out his wide chest, a proud smile gracing his lips. “I cleaned it up in fifteen minutes! All of it! Still can’t believe that I had to overuse my quirk for something so small, but it went better than expected.“</p>\n<p>And shit. <em>Shiiiit.</em></p>\n<p>Iida… <em>well</em>. Iida is <em>kinda hot</em> now that Midoriya takes a better look at him, suddenly forgetting the milk box. Perhaps he’s coming down with something. Or maybe it’s just the trick of the soft light filtering through the huge windows, a divine green glow cast by the clusters of leaves.</p>\n<p>“That‘s,<em> uh</em>. That‘s great, man.“ Midoriya forces a smile and tries very hard not to ogle his friend‘s bare forearms, the strain of those sleeves. Since when did Iida have nice forearms like that? <em>Always</em>, a small voice inside his head whispers, and Midoriya makes a desperate sound in his throat akin to the squeak of a mouse that’s been stepped on.</p>\n<p>“Are you alright, Izuku?“ <em>Izuku</em>. It kills him when his name gets used like that, it‘s far too... <em>intimate</em> in this situation. “You look a little flushed. Do you have a fever?“</p>\n<p>Midoriya stares, and somehow things are starting to make a whole lot of sense, as though he‘s been trying to look at a blurry picture for months now and he just came out of the o<span class>ptometrist's</span> with a prescription for new glasses. It‘s still hazy and he‘s not quite used to it, his head hurts, but it‘s a bit more-</p>\n<p>“I‘m fine,“ he squeaks awkwardly when he feels Iida‘s cool palm brush his forehead. He almost topples over, forcefully grabbing the milk from Iida‘s other hand. He has to look pathetic. “I just. Don’t feel too well, uhh, upset stomach! Bathroom, yes. My bowels feel like they‘re going to explode.“ <em>Stop talking stop talking, oh my god, what a charmer.</em></p>\n<p>“Ah,“ is all that Iida says, face colored with surprise, but before he can recommend Izuku to go to the nurse‘s office, the short boy is scrambling away, tripping over his feet.</p>\n<p>Heart beating wildly in his ears and pulse hammering against his throat, Izuku leans against a wall located somewhere far away from their class and that cursed vending machine. He slides down its surface, knees weak as though he's just gone through five rounds with a villain, and he really does feel like he needs to use the bathroom to empty his stomach of this feeling, of this strange dread.</p>\n<p>Perhaps he never truly felt those teen urges before because he's been... looking at the wrong people? Maybe it‘s never been girls and thighs and green skirts and poofy brown hair that bounced with every step. Maybe it‘s always been toned forearms and porcelain skin glistening with sweat, the scent of dust and, <em>and...</em></p>\n<p>And while Iida is still his friend, his <em>best friend</em>, Izuku cannot help but think that his view of the other teen has shifted somehow. It feels as though a lot of things will be different from this point on, not necessarily involving Iida Tenya, just. Change in general. The kind that leaves Izuku feeling cold instead of giddy like he usually does whenever he encounters a challenge.</p>\n<p>He decides to go back. There‘s no point in worrying everyone. He‘s certain that Iida will tell the teachers that he‘s feeling sick, involving his classmates in the process, too. Such are the duties of a Class president and a very worried friend.</p>\n<p>He throws the fruity milk into a trash can.</p>\n<p> </p>\n<p> </p>\n<p>Needless to say, the changes come way sooner than Midoriya expects them to.</p>\n<p>Suddenly it feels like he's developed hypersensitivity - every single guy in his class has attractive features and Midoriya doesn’t know what to do about it or what to do with<em> himself</em> when he has to change into his hero outfit in front of the rest. More often than not, he makes some excuse just to go to the bathroom and change there. Lately, he’s been getting suspicious stares, i.e. Katsuki. Seems like the constantly-angry blond is the only one who isn’t buying those meek excuses of chronic stomach pains and diseases.</p>\n<p>Iida keeps telling him to go see a doctor. Midoriya guiltily looks away, unable to feel any resentment even though Iida is technically the one who's made his life <em>literal hell</em> with his tousled hair and sculpted forearms.</p>\n<p>While Midoriya is busy drowning in self-pity and newly discovered sexual attraction to, <em>well</em>, tall males with pretty forearms, he completely misses the worried, mismatched stare constantly drilling into the back of his head during hero prep and the more-boring classes. Thankfully, Midoriya can still manage to muster up at least some level of focus on those, but it’s hard to look up whenever Bakugou sits in front of him during Advanced Math. His back is wide and seemingly goes on for days. The gray blazer shifts against Katsuki’s tense back muscles and Midoriya feels really disgusted with himself for thinking of his childhood friend/tormentor in that way.</p>\n<p>It’s not like he can lie and tell himself that Kacchan isn’t very handsome and would probably have everyone swooning if only he fixed his attitude problem and smiled more often.</p>\n<p>Right when Izuku is mentally cursing <em>stupid sexy Katsuki</em>, his phone vibrates inside the pocket of his blazer. Extremely glad that this isn’t Aizawa’s class – the man’s detentions tend to border the edge of extreme,<em> god forbid he sees you texting</em> - Midoriya thinks that he can risk a peek. He rarely gets texts during class - usually, they’re from his mom asking what he’d like for dinner. Food is a preferable distraction from the analysis of the slope of Katsuki’s broad shoulders, as though the blond is boiling with anger and ready to jump over the desk at any given moment to blow off the teacher’s head.</p>\n<p>Plus, it’s not like Midoriya is listening or taking down any notes.</p>\n<p>\n<strong>‘Is everything alright? Do you need to talk?’</strong>\n</p>\n<p>Midoriya almost drops the phone in surprise when he sees the name of the sender. Todoroki isn’t exactly one to text or initiate texting, especially during class, so to get one is a shock. Has he been acting that out of the norm?</p>\n<p>Miffed, Izuku looks over his shoulder. The other teen doesn’t even acknowledge him, focused on writing something down. Everyone around seems to be doing the same. For a second, Izuku panics that he’s missing some vital pop quiz information, but he hasn't heard a word of what the teacher's been saying to begin with.</p>\n<p>He contemplates his response.</p>\n<p>\n<strong>‘everything’s alright. just a lot on my mind, i guess’</strong>\n</p>\n<p>\n<strong>‘Oh.’</strong>\n</p>\n<p>Todoroki isn’t one to pry unless it’s absolutely necessary. This time, Midoriya appreciates this quality. He doesn’t want to lie.</p>\n<p>Another buzz.<strong> ‘I’m glad youre ok then. But if you ever need someone to talk to, I’m here for you.’</strong></p>\n<p>\n<strong>‘Also pay attention to class’</strong>\n</p>\n<p>Midoriya huffs a breathy laugh at the frowny face attached at the end of the last message. That’s a bit unlike Todoroki, though not completely unexpected and <em>very</em> endearing. Izuku shakes his head to the sides, warmth seeping into his chest, and Kacchan growls at him to <em>stop fucking giggling like some braindead fuck</em>.</p>\n<p>Nevermind, Bakugou’s really not <em>that hot.</em></p>\n<p>He texts back a reply without forgetting to add some emojis.</p>\n<p>\n<strong>‘on it’</strong>\n</p>\n<p> </p>\n<p> </p>\n<p>Bakugou drags him out of the closet.</p>\n<p>Like, <em>literally</em>. Brooms fly every way and Midoriya trips over his red sneaker, barely managing to pull up his pants.</p>\n<p>“<em>Wh-wh</em>-what?” he stutters out as Katsuki drags him towards the changing rooms and grumbles something about how he<em> fucking knew it that goddamn shitstain Deku was faking it all along for the sake of causing drama and being the center of attention, and that he’s had it up to here with the other guys constantly bitching about Midoriya’s fucking fake illnesses every time hero activity classes rolled around.</em></p>\n<p>Normally, Midoriya would've elbowed him in the fucking ribs, but he goes back to the changing rooms obediently, knowing perfectly well that if he refuses, not only will Bakugou warp his story, but he'll also feel guilty for being unable to face his problems and half-naked guys. Which is, like, the exact same problem.</p>\n<p>Kirishima asks Izuku if he’s alright now, and Izuku nods along, pulling off the damp undershirt, trying his best not to stare at anyone. As if sensing his distress, Bakugou changes next to him, probably just for the sake of being an asshole, denying the shorter boy any sort of escape. Midoriya’s too bummed out to appreciate the wonders of puberty that had hit his childhood friend like a bullet train. He noses at a clean shirt after toweling off – someone has busted the showers in the boys’ locker room <em>yet again</em> – and accidentally looks up at the worst time possible.</p>\n<p>Todoroki is facing away, oh thank <em>Buddha</em>, but Midoriya’s mouth goes dryer than tumbleweed tossed by the winds of the Sahara desert. A towel rests around the boy’s thin neck and <em>he’ll be damned.</em></p>\n<p>When the hell did Todoroki Shouto get so <em>jacked</em>?</p>\n<p>Midoriya almost has a minor heart attack when the towel slips away from his wiry neck and Todoroki flexes out the kinks plaguing his back. Midoriya stares at the ripples of those taut muscles, focuses on the hollows that dip in the spine - <em>honestly, this is bad for Midoriya’s heart,</em> because <em>what is this</em>, how come all of his guy friends are so <em>hot</em>?</p>\n<p>He knows, for a fact, that Todoroki was certainly less, uhh,<em> beefy </em>three months ago, but Midoriya’s not complaining. Maybe only mildly, especially when Shouto turns around as though he's <em>felt</em> Izuku’s lewd, heated stares, and smiles slightly, wiping at the corner of his mouth where some water has slipped through after he'd taken a swig from his sports bottle.</p>\n<p>Midoriya doesn’t need a mirror to know that he looks fucking stupid. Katsuki snaps him out of his reverie with the loud bang of a locker and a snarl that sounds suspiciously like <em>‘gay’</em>.</p>\n<p>And Midoriya is <em>oh so very gay</em> at this exact moment.</p>\n<p>He trips on his way out and bashes his head open on the corner of the lockers. The Recovery Girl isn’t happy to see him again. Izuku spends the next two periods lounging on one of the uncomfortable mattresses in U.A.'s nurse's office, mind looping the image of Todoroki’s glistening abs and the subtle upturn of those lips.</p>\n<p> </p>\n<p> </p>\n<p>The next hero prep class is absolute <em>shit</em> and downright ridiculous, and Izuku would gladly curse if he wasn’t, well, <em>Izuku</em>. Instead, he clenches his jaw and gets his ass handed to him by <em>Bakugou</em>. It feels like it’s middle school all over again, and sweet <em>All Might, </em>it frustrates the living shit out of him. It also feels like the aforementioned hero has set them up to brawl <em>on purpose</em>. Damn it.</p>\n<p>“Weak, Deku! You’re fucking weak!” Katsuki taunts as he dodges another punch, this one too rushed, driven by annoyance rather than determination. “You’d lose a street brawl in a second! You suck without your fucking quirk, jackass!”</p>\n<p>Katsuki’s words no longer get under his skin, but when All Might - the man whom Izuku has idolized since before he could read - says the exact same thing, it feels like all meaning in life has been lost and nothing matters anymore.</p>\n<p>“Don’t be so down, my boy! This is something you can certainly fix!” All Might reassures, his deep voice making Izuku’s spirits lift a little. “You just need to find a good partner, who could not only duke it out with you, but also teach you some valuable moves.”</p>\n<p>They make an agreement that Izuku is going to find himself a fitting partner, and even though Izuku has many options to choose from, Ojiro turns him down, saying that he’s not very patient when it comes to teaching, Kirishima outright laughs into his face and says that he sucks too bad for him to even get started with – <em>come back when you at least learn the basics of side-stepping, dude!</em> – Bakugou is out of the question, he’d rather not ask Yaoyorozu, and that leaves…</p>\n<p>Todoroki is a little surprised when a jittery Midoriya asks him for extra practice on good ol' quirkless sparring, and in a blink of an eye, he says yes. Izuku goes back home with a pounding heart, clutching his phone tightly to his chest and heatedly replying to every message Todoroki sends, trying to set up a time and place.</p>\n<p>He’s happy that Todoroki doesn’t find him an inconvenience and he’s a patient teacher, only sometimes getting frustrated whenever Izuku fucks up on something very basic. Shouto offers the smaller boy to visualize kicking Kacchan’s ass whenever he throws a punch or a kick, and while that extracts some giggling from Midoriya, it does help him get into the zone more easily. All throughout middle school, he’s been kicked and pushed around by the explosive blond and his<em> lackeys -</em> for the lack of <em>a</em> <em>better word -</em> so naturally, Izuku didn’t fight back much.</p>\n<p>Sometimes he crumbles when Todoroki aims a kick at him, covers himself in the wrong places, usually his head, and cowers instead of dodging or defending. If Todoroki notices the remains of past bullying-related abuse, he wisely stays quiet and tells Izuku to try again.</p>\n<p>They spend a week together like this, sparring, and Midoriya is so focused on the image of defeating Kacchan in something this simple that he doesn’t notice Todoroki’s lithe and quick form too much. The guy wears long sleeves even though it’s sweltering, but he seems comfortable enough, and he does have his ice side to keep the body temperature pleasantly cool. Midoriya envies him as he peels off layer after layer until he’s left only in pants.</p>\n<p>After that, he usually manages to sneak in a few good punches, apologizing profusely afterwards. Maybe his mobility is better without the extra material restraining the movements?</p>\n<p>Todoroki just rubs at his own bruises, says that it’s fine, and usually calls it a day, hurriedly leaving the archery club’s third gym that they’ve been using as a sparring room.</p>\n<p>It’s not until they have so much homework that they can barely sleep that Todoroki makes new arrangements. They've barely had any time to talk to each other, no less spend time together, so it was only natural that sparring was out of the question.</p>\n<p>On Monday, it’s humid. Midoriya’s brain is melting along with the cheap popsicle, that Uraraka has kindly purchased for all three of them each, stuck in his mouth. Todoroki stands before the trio, looking like a hyper-realistic mirage with those short, rolled-up sleeves, the sun hitting his two-toned hair <em>just right,</em> making everything seem even more surreal. Midoriya bites at the frozen treat to distract himself and promptly gets a brain freeze.</p>\n<p>“If you don’t mind it, you could come over to my place tomorrow. My old man will be stuck at some conference for the next three days, and my sis is going somewhere with her friends, so we’ll have the entire place to ourselves. I, <em>uh</em>, have a dojo,“ Todoroki scratches the back of his head, almost shyly, and beside Izuku, Uraraka snorts. Her best friend only gapes instead of replying, the popsicle slowly beginning to drip sticky blue onto his white summer shirt.</p>\n<p>There’s a silence.</p>\n<p>Uraraka subtly elbows Izuku in the ribs, and he coughs, feeling his tongue numb from the cold. He slurs a warped <em>\"yesh shure, I’ll go to your dojo any day,\" </em>and tries to ignore the brunette’s muffled laughter, along with Iida’s amused snort. Todoroki, however, mostly looks relieved, completely blind to others’ reactions.</p>\n<p>“Good. I’ll text you the time later. See you in class.”</p>\n<p>“Uhh, yeah!” Izuku barks lamely, and tries to ignore Uraraka’s sing-song voice as she coos \"<em>someone’s got a daaaaate!\".</em></p>\n<p>He wonders what he should wear for it, somehow not bothered by the ‘date’ taunts that the bubbly girl throws around for the rest of the recess.</p>\n<p> </p>\n<p> </p>\n<p>Turns out that Izuku didn’t even have to wear anything at all or even consider wearing something, because on that day, the heat suddenly reaches the highest extremes. It feels as though it’s sticking to Izuku like a second skin and he gets lost at least three times trying to find Endeavor’s mansion. Todoroki was pretty humble with his house’s description and there were at least ten mansions with ‘traditional Japanese architecture’ in the pro-hero neighborhood. Alas, he finds it only because he can see Todoroki’s duo-colored hair through the gaps of the fancy gate, decorated with intimidating steel dragons on the top. There’s fire coming out of their muzzles. Midoriya doesn’t have the time to admire the steely creatures and simultaneously be terrified of them when the gate opens automatically.</p>\n<p>Todoroki is wearing a paper-thin, white tank top that leaves little to Midoriya’s imagination which is suddenly going rampant, and he really does <em>hate</em> being a teen and having attractive friends who are great in every way that he can think of. Todoroki is impossible to dislike, impossible to ignore, and most of all, impossible to forget, especially during nighttime. Midoriya feels dirty almost, as though he’s invading his friend’s privacy in some way or acting like a creepy, albeit unwilling, stalker, but Todoroki’s smiling face is always there in Izuku’s thoughts, along with the rest of him, which happens to be quite divine.</p>\n<p>They chatter mindlessly as Todoroki answers Midoriya’s fanboy-self driven questions with a bit of a bored, monotone tone like he’s used to it by now. Midoriya wonders how many people Todoroki has brought over before. He feels his heart sink at the thought that he isn’t the first one to be here, the first one to see how this<em> wunderkind</em> loved by the press and pro-heroes alike, lives.</p>\n<p>The dojo is an old, unused thing with suspicious burn marks on the old floor and just enough cool air for Midoriya to feel like he’s finally out of the devil’s pot. He sees Todoroki walk around as though he’s checking for people, and maybe they have servants and all that - Izuku wouldn’t be too surprised - but there’s no one. He bandages his knuckles for protection and Midoriya does the same in deafening silence, suddenly feeling as though the walls are closing in around him. Being in the Todoroki household like this, with <em>no one</em> around, feels… Izuku can’t explain it well, but it feels like the air between him and Shouto has somehow changed, become electric.</p>\n<p>He gnaws on his lower lip when Todoroki commands him to take a stance and attacks him relentlessly. The heat returns and Midoriya feels himself short of breath not even ten seconds in. He feels pathetic but keeps going, clumsily dodging out of Todoroki’s roundhouse kick. He doesn’t have the chance to react before Todoroki’s heel is firmly set against his spine, and Midoriya heaves against the ground, enjoying the press of the cool floor. He can hear Todoroki scoff.</p>\n<p>“Concentrate. You can rest later, we barely got started. Get up and let’s go once more.”</p>\n<p>Three rounds later Midoriya thinks that Todoroki has a secret bully side and enjoys smacking him around almost as much as Kacchan does. The guy is a relentless force, he does kickboxing as a hobby, whereas Midoriya can barely throw his own punches without <em>One For All</em> buzzing in his limbs, enhancing strength. It’s not until a bit later that Midoriya notices a pattern – Shouto comes up with a new one for every session they have and tortures Midoriya until he figures out how to defend – that he actually manages to land a good uppercut.</p>\n<p>It leaves a blooming bruise on the side of Shouto’s unblemished jaw, but he quickly cools it, breathing a bit heavily himself. Midoriya takes that time to fetch a water bottle, and when he turns around, he nearly hacks out a lung. Todoroki has peeled off the paper-thin, mock-shirt and is now standing before Midoriya in all of his half-naked glory, just like on that day in the locker rooms when Izuku had busted his head open. It feels almost the same as it did back then, if not even more intense.</p>\n<p>If he squints, Midoriya can see steam rolling off the other’s ice side, as he cools himself off. He wants nothing more than to cross that distance and burrow himself there, feel Todoroki’s wet skin and the slight muscle twitches the taller teen’s body produces after some more-intense sparring. Izuku forcefully drags his green eyes away, only to meet Todoroki’s heterochromic gaze dead on, staring him down, some calculating look flashing in those glistening depths. Izuku can’t read the other's expression, but he feels a bit set off anyway - as though he’s facing off a villain and doesn’t know what quirk they have. He feels exposed, to say the least, and that’s just <em>bad.</em> Midoriya reassures himself that Todoroki is incapable of reading his mind, swallows down nerves, and asks to go once more, this time on offense.</p>\n<p>It’s a fucking tragedy. His focus drifts in and out, it’s<em> hot,</em> and sometimes he focuses too much on the swish of the black material of those loose pants, remembers Uraraka, remembers the dreams of forest-green skirts, and thinks that while this is, perhaps, not the <em>same</em> – especially when he has to roll on the ground if he wants to avoid Todoroki smashing his ribs in – this is good in its own way. Special.</p>\n<p>\n<em>Real.</em>\n</p>\n<p>In a burst of sudden energy, Izuku launches himself at the taller boy, leaping high and barely suppressing his quirk. He aims for that pretty, scarred face and it’s a certain dead on, but Todoroki probably sees three moves ahead or some shit like that - maybe he’s a born ninja - because he easily snags Izuku’s thin wrist mid-swing. The shorter teen can’t seem to land properly with his body shifting forward like that, stumbles along, slips on the floor. Todoroki attempts to grab a hold of him, but fails, and they fall back in a tumble of limbs, torsos meshed together, only Izuku’s damp, black shirt separating them.</p>\n<p>Izuku’s head spins from the fall, and he feels Shouto wincing, having heard the painful crack that his skull had produced as it connected with the floor. Midoriya feels like his nose is bleeding because he's bumped it harshly against the taller one’s shoulder. He ignores the vicious sting and sits up, holding himself up to examine his sparring partner instead, scanning over for injuries. There’s no blood in sight, and that’s where Izuku draws the line, body going rigid when he notices the position he’s currently stuck in.</p>\n<p>Todoroki’s underneath him. Shirtless, rubbing at the side of his injured head, eyes lidded slightly. Unconsciously, Izuku’s depraved gaze shamelessly roams the other’s perfectly toned torso, noticing small battle scars in the dips of his strong muscles. He’s breathing rather heavily and Izuku can feel every intake of breath with his entire body. He feels as though someone has just thrown him into an active volcano because, oh<em> shit</em>, he’s sitting on <em>Todoroki Shouto,</em> and if the other shifts one more time, Izuku is going to have a really bad time running away from the Todoroki household and then faking his own death. He’s fifteen, and he had his first sexual awakening, like, <em>a few weeks ago</em>. It seems as though it’s been <em>years, </em>but with Todoroki, everything feels new. It’s almost funny, except that it <em>isn’t</em>, and Izuku feels his face heating up so bad that he no longer notices the heat hanging in the air between them, rolling off in hot waves from the body pressed lightly between his thighs.</p>\n<p>He’s ready to apologize and maybe bail, trying to come up with some valid excuse all the while, when his world tilts once more, and he’s left lying on his back. Izuku assumes that he’s having a rather vivid fever dream because he’s only ten or so centimeters away from Todoroki’s face, and there’s no way that any of this is<em> real.</em> He has to pinch himself. Todoroki does the same thing that Midoriya's been doing not too long ago, searching for visible injuries. Concern creases his thin eyebrows.</p>\n<p>“Midoriya! Are you hurt anywhere?”</p>\n<p>Izuku opens his mouth, closes it, inhales, and then gapes some more. It’s unfair. It’s very, <em>very unfair</em> that he’s literally being pinned down by his hot classmate and friend, who radiates warmth and genuine worry. Izuku is undeserving, he’s <em>nothing</em> but a horny teenager, suddenly all too aware of the heat growing in his lower regions.</p>\n<p>Todoroki is shifting his legs, one of them conveniently placed between Midoriya’s quivering thighs, centimeters away from what is slowly growing to be <em>quite a problem</em> and possibly the end of not only his social life, but his friendship with this amazing guy as well.</p>\n<p>Izuku’s <em>fifteen</em> and he <em>wants</em>, wants all of <em>Todoroki,</em> would love to reach out and place his palms on that face, if only to find out whether there’s a difference in temperature. He wants Todoroki’s palms kneading at his temples, just like they tend to whenever Todoroki's kicks connected and he patted Izuku down for injuries, using ice to cool them. All those bruises had been worth it, and Todoroki is <em>so close,</em> but Midoriya is far too scared to make a move, because, thinking logically, he knows what he <em>needs, </em>but not necessarily what he wants. Todoroki is probably the same, and Izuku knows with certainty that someone like Shouto would never like back a nerd <em>like him</em>. Or want him, for that matter.</p>\n<p>Midoriya desperately tries to kill his semi hard-on with depressing shit, but it’s nearly impossible when Todoroki stares at him like that, as though he’s being magnetized, pulled in, and he shifts a bit, snapping Midoriya out of his haze. The shorter teen almost yells in a warning.</p>\n<p>“Oh gosh, <em>don’t</em> move your legs like th—“</p>\n<p>Time stands very still for three seconds at least. Todoroki’s eyes grow impossibly wide, never breaking contact with Midoriya’s frightened stare. His rabbit heart hammers away its frantic beat in the back of his throat, and Midoriya waits for disgust, for Todoroki to jump away. He’s ready to tell the other teen his secret, ready to degrade himself to save this friendship, but all that reaches Izuku’s ears is a breathy “<em>Oh</em>.”</p>\n<p>Midoriya Izuku is often rendered speechless, but never to this extent of<em> awkward</em> and downright <em>terrifying</em>. He finally peels his eyes away, and focuses them somewhere to the side, unseeing. Tense seconds tick by. Midoriya almost feels uncomfortable, feels obliged to push Todoroki away and go. It’s the least he can do for embarrassing them like this.</p>\n<p>That is, until he feels a cool palm rest on his face, feels the zing of a quirk, ice-cold fingers pressing down into his skin, tracing timid patterns.</p>\n<p>Midoriya almost wants to cry and ask <em>‘why’</em> at the same time Todoroki whispers, as though he’s afraid someone might overhear. “Your nose got a little bruised,” he says like it’s <em>normal</em>, and Midoriya swallows heavily, shivering. It seems that the shiver transfers to Todoroki too, because he worries at his lower lip, swipes a pink tongue over it, and continues tracing the bridge of Midoriya’s nose with utmost care.</p>\n<p>They stare each other down as Todoroki carries on with the motion, transforming from timid to more daring over time. Midoriya lets out a shaky sigh when he feels those fingers spread wider, slide lower. It would almost tickle if this were any other situation, he thinks, when those chilled digits press softly against the throbbing pulse line of his neck. Instead, it only fuels the budding sensation of what Izuku recognizes to be desire, making him twitch.</p>\n<p>His thighs involuntarily trap Shouto’s knee, and the sudden movement makes their breaths hitch simultaneously. Izuku’s still hard, and those playful fingers on his neck aren’t doing their job properly, because he seems to be getting hotter and hotter, <em>and this is really no good</em>. They should stop this before it can escalate, but they’re fifteen and they <em>just finished sparring,</em> and Izuku is still <em>very gay</em> for messy hair and forearms and heterochromia, and... Todoroki Shouto <em>in general</em>, he realizes with a jolt, when Todoroki experimentally spreads the wintery fingers at the center of his chest, chilling Midoriya through that thin barrier of material.</p>\n<p>He’s pretty damn sure that his shirt frosts over, but he couldn't care less, and makes a keening noise instead, urging the other to continue. Todoroki hesitates, only for a beat, and moves his fingers dangerously close to Izuku’s left nipple. He’s almost glad that Todoroki is far too busy eyesexing him. Midoriya would be pretty embarrassed if the other noticed the traitorous show of his painful arousal.</p>\n<p>Izuku sucks in his lip and notices Todoroki shivering as he mimics the action, eyes glistening. Izuku almost wants to kiss him, nibble on that lip in his sparring partner’s stead, but feels it to be inappropriate. They’re <em>not</em> lovers, and kissing is pretty intimate, right? He’s certain that the magic of the moment would be broken, so he holds back, takes what he can get. Everything that Todoroki is willing to give.</p>\n<p>Shouto’s palm continues its experimental journey, fooling around with the prickling feeling of his quirk, almost teasing. Midoriya endlessly appreciates it, makes soft keening noises every now and then, when it feels especially nice against his rapidly cooling skin. When Todoroki’s pinky grazes his nipple, an accidental move judging by the muttered curse, Izuku yelps. The shirt gets pushed up and Todoroki’s hand dives in, searching.</p>\n<p>“Fuck, sorry,” he apologizes, sounding winded as though he’s just run a marathon, and Izuku understands, but doesn’t think about it too much. Nimble fingers - thankfully, almost back to normal human temperature - roll the stiff bud. Midoriya can’t bear the embarrassment anymore and closes his eyes, nosing at the arm holding up Todoroki’s weight. He feels it trembling from prolonged strain and <em>desire</em>. Sometimes it’s far too easy to forget that Todoroki, too, is fifteen, and he has just as much shit to deal with as Midoriya does.</p>\n<p>He doesn’t play around for too long, and that’s good because if Midoriya has to suffer a few more pinches, he’ll bust his load in his pants a bit too soon. He thinks about the barriers separating them, shifts, and lightly grinds down on Todoroki’s knee, thighs clamping as they both hold in lewd sounds. The tension is driving Izuku crazy, but he can’t be bothered to complain when Todoroki is thumbing at the sharp V of his hips like that, distracting.</p>\n<p>Instead, he tries to overcome himself, reach out,<em> touch</em>, afraid he might get pushed away. Maybe Todoroki doesn’t want <em>him</em>. With a trembling palm, he strokes over the scorching side of the taller teen, the heat almost burning Izuku’s hand. He smooths a palm over Todoroki’s tense, trembling bicep, kneading slightly. The taller teen gives him such a watery look that Midoriya would scream if this were a dream instead of reality. No one’s ever looked at him like that before, <em>with so much affection, </em>and his heart soars happily, heat pooling in his stomach right as Todoroki shyly tugs at the band of his sweatpants, resting his fingers there.</p>\n<p>He looks afraid, as though if he were to go any further, all of this would crumble apart, and Izuku can relate, <em>would relate,</em> but at this point, he cares less and wants more. He tries to convey it somehow with his eyes. Speaking is a bit awkward - this moment feels sacred and he’d ruin it somehow with his blabbering. His vocal cords get all weird whenever he’s around the other, and lately, his mind hasn’t been cooperating with his mouth too well.</p>\n<p>He slides a hand to rest on the side of Todoroki’s torso - a silent reassurance, an invite. Todoroki leans in, red-white hair tickles Izuku’s numb nose, and they rest their foreheads together, connecting in a strange way. It’s almost heavenly.</p>\n<p>Todoroki clumsily palms him through his straining, <em>very much tight</em> pants, and Midoriya mindlessly snaps his hips up in short movements, seeking more friction, embarrassment dwindling. He feels good, safe. Wanted. It’s all that he needs. Izuku’s other hand comes up to join the one tracing light circles on the other boy's side, meeting over the broad expanse of the taller teen’s back, resting there in a loose embrace. He doesn’t feel awkward anymore. Just happy, especially when Shouto sighs contently against his mouth, and it almost feels like a kiss, a brush of warm breath on Izuku’s bitten-at, damp lips.</p>\n<p>He shifts and, a little awkwardly, hooks one leg over Shouto’s lower back, muscles straining in a weird way. He whines at the loss of that wicked hand on his crotch, but the taller teen shushes him and quickly moves around, readjusting. After some fumbling and a few shaky laughs, Todoroki’s hips are flush against Midoriya’s, his hands fixing the shorter boy's thighs. Midoriya relaxes, feeling boneless, and spreads his arms out on the floor. It feels as though they've already gone all the way. The ridiculous bubble of joy and ecstasy, floating in Izuku’s chest, keeps expanding, but he knows that better things are yet to come.</p>\n<p>Todoroki finds his curled palms, and laces their fingers together almost sweetly, filling in the spaces. He presses a cheek into Midoriya’s and breathes evenly against a flushed ear, rolling his hips. It’s a mess of emotions and pleasures, and Midoriya feels as though he just stuck a fork into a socket. The pleasurable sensation leaves him gasping. Todoroki handles grinding as he handles sparring and everything else - even, determined, <em>ceaseless</em> - and Izuku pants, writhes, cries out, and almost completely loses it when Todoroki shudders, groaning a ragged <em>Izuku</em> against his sensitive ear.</p>\n<p>His fingers tighten on the longer, slimmer ones, and his legs keep milling about, heels digging into strong thighs, pulling the taller teen closer, beckoning to go faster. He feels like this will be over far too soon, especially when Todoroki slides lower, back bowed, kissing the rabbiting pulse line on Izuku’s neck softly,<em> barely there.</em> Midoriya babbles warnings that sound weird to his own ears – <em>stop, stop, I’m gonna cum like this, just like this, pleasepleaseplease.</em></p>\n<p>He hears Todoroki make a primal noise, something close to a growl, and the other tries to still his hips, but it’s a hard task to accomplish when Midoriya’s bucking up and joining him in earnest. Reluctantly, he unlaces their fingers and stiffly moves away. Izuku’s face flushes at the sight of Todoroki’s obvious bulge.</p>\n<p>He doesn’t get the chance to revert back to virginal embarrassment because Todoroki’s yanking at his pants and Izuku assists him by kicking them down awkwardly, not slipping out of them completely. This time, Todoroki’s the one trapping his leg, hissing at the layers, <em>at the friction.</em> Midoriya surprises himself when he hooks his fingers under all that elastic and material, separating Todoroki’s arousal from relief. It springs free, and the taller teen slightly hisses at the rough brush of material and humid air while Midoriya ogles. It’s heavy, flushed, and when it drips right onto Midoriya’s light blue boxers, he thinks that he has some kind of eyesight orgasm. Todoroki looks away in shame, and Izuku inhales a sharp breath, reaching out again.</p>\n<p>It’s a weird feeling - not like he has a lot to compare to, because Midoriya hasn’t exactly been going around tugging at a lot of junk - but not unpleasant. He feels it throb, and Todoroki moans loudly, a sound that sends shivers down Midoriya’s spine. He’s unsure as to what he should do, so he decides to improvise, thinking of what he’d like. He experimentally jerks his hand a few times and twists the wrist, glad for the slickness of Todoroki’s arousal, otherwise, he imagines that this kind of thing would be unpleasant for the taller teen.</p>\n<p>He thumbs at a throbbing vein and listens to Todoroki gasping in quick, short breaths. Izuku almost startles when he digs a fingertip right into the leaking head of that flushed cock and the taller teen’s arms finally give out. He sinks to his elbows, framing Midoriya’s head, and continues moaning into his wavy, green hair. Midoriya keeps playing around, growing more confident when Todoroki starts to fuck into his loose wrist, the feeling of it almost surreal and strangely arousing. He sighs against the hollow of Shouto’s neck, and the other teen makes quick work of bringing down his hand back to Midoriya’s damp boxers, this time sliding off the material without hesitation. They’re both far too gone, and Izuku sobs in relief at the feeling of Shouto’s palm stroking him.</p>\n<p>His grip is a bit loose and Midoriya whines while trying to synchronize their movements, shifting his other hand to Todoroki’s clumsy grip, tightening it. It’s enough for Todoroki to moan his name loudly, eyes screwed shut. Izuku tightens his grip on Todoroki’s hand even more and jerks him off with more vigor, knowing that they’re both close. He arches his back and they’re almost chest to chest when Midoriya feels the wreckage coming and yells out <em>Shouto</em>, voice hoarse.</p>\n<p>Todoroki spills in his hand at that, sticky and warm, and his eyes open, meeting Midoriya’s. The barrier that they've kept between them finally crumbles and breaks, and Shouto swoops down, clumsily kissing Midoriya through his orgasm. Their teeth click together painfully, but it feels too good. Midoriya wouldn’t mind Todoroki smothering him like this for the rest of their lives, slick tongue twining with his.</p>\n<p>He forgets how to breathe, and the light moans of pleasure that Todoroki produces are enough for him to forget the mess caked on his stomach, cooling off. Todoroki keeps sucking on his tongue, and Midoriya thinks that if this continues, they will soon have to get off again. Thank god, it’s his first time. His strength has seeped instantly and Izuku feels no more stamina left. Todoroki, who lies on top of him, crushing him down in the best way imaginable, seems to be stuck in the same predicament. Their mixed semen sticks between their stomachs, making Izuku shiver a bit with arousal and somewhat disgust.</p>\n<p>They stop sucking face exactly five minutes later, and Todoroki looks dazed, <em>fucked</em>, or, well… jerked off, in this case. Maybe they’ll have some time in the future for that other thing, too, Izuku ponders, as he glances at Todoroki’s cherry-red lips, glistening from saliva. They press their foreheads together and the taller teen sighs in contentment.</p>\n<p>“This was definitely the best part,” he whispers, and Izuku smiles, a light laugh bubbling in his chest. He pushes some red strands from the boy’s mismatched eyes, lightly thumbing at the uneven skin of his scar. “I mean, not that sex with you isn’t good or anything.”</p>\n<p>Midoriya lets the laugh slip and his eyes close, savoring the moment. “No, I get it, same here. Sex is an acquired skill, and I don’t know about you, but I didn’t have any practice before.” Izuku shrugs and Todoroki’s face colors a bright pink. “It’s like sparring, you need to have techniques and practice, right?”</p>\n<p>“I guess?”</p>\n<p>Midoriya sighs and almost doses off when he hears Todoroki speak up again. “Izuku?”</p>\n<p>His heart jumps at the use of his name, “yes, Shouto?”</p>\n<p>“Would you like to… Uh, practice sex with me?”</p>\n<p>“I don’t know… That’s not very romantic. Would you like to practice kissing with me, instead?”</p>\n<p>“Are you asking me out here?”</p>\n<p>“Are you?”</p>\n<p>Shouto awkwardly clears his throat and averts his gaze, “…yes. And yes, I’d love to practice kissing with you. Every day, if you don’t mind?”</p>\n<p>And Izuku doesn’t mind. They spend the rest of the day in that dojo, except instead of sparring, they start working on other things, and, well… Todoroki proves himself to be a <em>great partner</em> once again.</p>\n<p>On the following day, no one is surprised to see them kissing at school. Kacchan yells <em>‘gay’</em> and stalks away.</p>"
}