{
  "id": "699898",
  "url": "https://archiveofourown.org/works/699898?view_full_work=true",
  "author": [
    "drunktuesdays"
  ],
  "title": "Patterns of Intention",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Alan Deaton",
    "Scott McCall (Teen Wolf)"
  ],
  "additional_tags": [
    "Magic",
    "First Time",
    "Pining",
    "Jealousy",
    "Rimming",
    "Fingerfucking"
  ],
  "language": "English",
  "series": "",
  "published": "2013-02-26",
  "completed": null,
  "words": "17,085",
  "chapters": "1/1",
  "comments": "419",
  "kudos": "26,256",
  "bookmarks": "6,726",
  "hits": "538,907",
  "summary": "<p>Derek looked like the stuff of his deepest fantasies. His shirt was rumpled where Stiles had his hands in it, and he was breathing hard as well, chest heaving. His eyes—his eyes were glazed over and he looked stunned, like he’d been—like Stiles had—</p>\n<p>“No,” Stiles said, blood draining from his face. The word was croaky and felt like it had to be wrenched out of his chest. “God, <i>no</i>.”</p>",
  "notes": "<p>As usual, this story is co-parented by Kalpurna, who held my hand the whole way. Beta and massive improvements by giddygeek and drlense. </p>\n<p>There is no actual dubcon in this story, but you have a dubcon trigger, please read the notes at the end.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Stiles believes he is dubconning Derek into wanting to have sex with him, but he isn't.</p>",
  "text": "<p>“It’s time for all of you to know more about what you’re facing,” Deaton said. His head was bowed over the disgruntled cat he was examining in what Stiles thought was an excessively serene manner. </p>\n<p>They were in the animal clinic’s operating room, and Stiles was sitting on the counter behind Deaton. He just barely managed to drag his eyes away from the proceedings he had been watching with sick fascination. “Was that offer <i>always</i> on the table?” he said. “Because it would have been helpful, say, any time in the past year.”</p>\n<p>“We’ll start with remedial lessons for the alphas,” Deaton said, ignoring him. </p>\n<p>“Scott’s not a real alpha,” Derek said, sulking in the shadows along the back wall. </p>\n<p>“But you’re a real dick,” Scott fired back and Derek bared his teeth at him. </p>\n<p>“Children,” Deaton said mildly. He turned towards Stiles, keeping a placating hand on the cat. “You, Mr. Stilinski, will also receive instruction.”</p>\n<p>“I’m definitely not an alpha,” Stiles said. He had been kicking the heel of his foot relentlessly against the cabinet, but paused, surprised into stillness.</p>\n<p>“That’s for sure,” Derek said. Stiles sneered at him. </p>\n<p>Scott wheeled around, even more outraged than Stiles himself. “He's done more for us than you ever have.”</p>\n<p>Derek stepped forward. “Maybe if I wasn’t being betrayed every thirty seconds, we’d be having a different conversation.”</p>\n<p>“Oh, get over it,” Stiles said. “So you didn’t get to be the big hero. Take your ego somewhere else.” Derek snarled, and Scott sprang into a crouch in front of Stiles. </p>\n<p>Deaton slammed his fist down on the table. The cat yowled miserably. “If you are not going to take this seriously, then get out,” he said. </p>\n<p>Scott straightened. “I’m not putting up with him, and I don’t need more werewolf crap in my life. I’m out of here. You can do what you want, Stiles.” He slammed his way out, and Stiles winced but stayed put on the counter where he was perched. </p>\n<p>“And you, Derek?” Deaton asked, not sounding like he particularly cared one way or another.</p>\n<p>“I’ll stay,” Derek said reluctantly crossing the room to stand under the lights. </p>\n<p>“I want in,” Stiles said, when Deaton turned his gaze on him. </p>\n<p>“Wonderful,” Deaton said dryly. “Since it’s just the two of you, I can hold sessions together or separately, but I would prefer to do them together. Do you two think you could possibly maintain a truce while you’re here?”</p>\n<p>“Well, I know I can, but you’ll have to remind Derek to control his massive aggression issues,” Stiles sniped. </p>\n<p>“You'll have to remind Stiles that I'm <i>easily provoked</i>,” Derek said, drumming his fingers on the counter. They were glaring directly at each other. Stiles couldn't have looked away if he tried. </p>\n<p>He took a deep breath. “I can play nice if you can,” he said, a little calmer. </p>\n<p>Derek nodded once, a sharp, jerky motion. </p>\n<p>Deaton clapped. “Well then. We meet tomorrow, nine a.m.”</p>\n<p>*</p>\n<p>Nine o’clock was early. That was a thing that Stiles had forgotten since school let out, and he’d become a nocturnal slob. “Scott,” he whined sadly, slumping completely over the counter.</p>\n<p>“Scott’s not here,” Derek said from behind him, wearing his ever-present leather jacket.</p>\n<p>“I know,” Stiles said, rubbing at the pillow marks still on his cheek.. “I thought maybe if I said it anyways, he’d come bring me coffee.”</p>\n<p>Derek stepped fully into the operating room. “You could drive down the street and buy some,” he suggested, taking a long sip from a protein shake.</p>\n<p>Stiles stared at him balefully. “You don’t even have to drink those. Your bullshit werewolf muscles don’t have to be maintained.”</p>\n<p>“I like the way they taste,” Derek said, scratching the stubble of his beard.</p>\n<p>“Ugh, I hate you,” Stiles said and sunk to the floor.</p>\n<p>“Ditto,” Derek said obnoxiously, and they fell into silence. </p>\n<p>Deaton stuck his head in. “Come into the office,” he said, and disappeared again around the corner. They followed him into a small, warmly lit room with bookcases lining every wall. Stiles itched to touch, but he held himself still. Deaton’s desk was in the corner of the room, but the center was occupied by a large, long table. On one side of it was a small, plain candle in a metal dish, and on the other was an old decrepit book that looked to be held together by tape and not much else. </p>\n<p> “Good morning,” Deaton said brightly, and ushered them all the way in, shutting the door behind them. </p>\n<p>Stiles edged closer, eying the objects dubiously. “I thought this was going to be lectures and note-taking and stuff,” he said. “Like real school.”</p>\n<p>“Now where’d the fun be in that?” Deaton said, crossing to stand in front of the table. “Stiles, since you just volunteered, we’ll start with you.” </p>\n<p>Stiles made an outraged noise, but settled into a chair at one end, too curious to really protest. </p>\n<p>Deaton pushed the candle towards him. “We’re going to work on your abilities, and getting you centered enough so you can call on them at will. Be <i>more</i> than the spark now, be the flame. Get the wick to light.” </p>\n<p>Stiles’s mouth dropped open. “You’re serious? I’ve only ever done anything with the mountain ash, and that was already magical!”</p>\n<p>“Mountain ash is just dead tree,” Deaton said peaceably. “You have to find <i>your </i>magic.” Dismissing Stiles, he turned to Derek. “As for you, we’re going to work on your knowledge gaps today, I think. We’ll start with this chapter.” He opened the book to a marked page, and pushed it towards him. Derek’s mouth turned down, but he accepted the book without comment, and both he and Stiles settled in. </p>\n<p>It was quiet for at least an hour before Stiles hit his breaking point. “This is impossible,” he said, frustrated and developing a headache. </p>\n<p>“You have to believe it’ll work,” Deaton repeated, for what Stiles was estimating to be the fifteenth time. </p>\n<p>“I’d rather pretend to read books like Derek,” Stiles said, resting his chin on his folded hands and staring unblinkingly at the stupid candle. </p>\n<p>Derek sat up so fast his chair made a protesting noise. “I’m not pretending,” he said unconvincingly. Stiles shot him an insulting look, and Derek bristled. “You try reading a chapter about goblins written four hundred years ago.”</p>\n<p>“In a heartbeat,” Stiles assured him. “You can make angry eyebrow face at this candle, we’ll all be happy.”</p>\n<p>“I’d like to remind you,” Deaton said, looking up from the paperwork he’d been going through. “I’m not forcing either of you to be here, nor am I getting <i>anything</i> out of this.” He hummed thoughtfully. “But it might be a good idea to change things up. Derek, give your book to Stiles.” He disappeared for a moment and then returned with a chessboard and a small case filled with pieces. </p>\n<p>“I don’t know how to play chess,” Derek said, his voice sounding mildly panicked. </p>\n<p>“No kidding,” Stiles said but when he got twin looks from Deaton and Derek, he subsisted and opened the marked chapter. It was more interesting than Derek had seemed to think, and Stiles got lost in a description of a goblin that had terrorized a small Brazilian village and what the villagers had done to rid themselves of it. </p>\n<p>When he surfaced, it was probably an hour later, and he and Derek were alone in the room. </p>\n<p>“Where’s Deaton?” Stiles said, blinking. </p>\n<p>“He went to check on the animals,” Derek said, staring at the board. </p>\n<p>Stiles stood, stretching. “What’s your deal?” he said, nodding at the board. </p>\n<p>“I’m not allowed to make a move until I’ve thought about it for five minutes,” Derek said, resentfully, and gestured towards a small kitchen timer next to him. </p>\n<p>Stiles took Deaton’s abandoned chair across the board. “You’ve only got a minute left,” Stiles said. “Think of something?”</p>\n<p>“I thought of it ten seconds in,” Derek said. They both watched until the kitchen timer dinged. Then Derek leaned over and moved one of the pieces, taking one of Deaton’s. “Yeah,” he said to himself. </p>\n<p>“That’s terrible,” Stiles said. “You just set yourself up.” Before he could stop himself, he leaned over and showed Derek. “Check,” he said. </p>\n<p>Derek growled and stared at the board, clearly trying to challenge it, but failing badly. “Of <i>course</i> you can play this too,” he said. </p>\n<p>“I had computer lab last period three years in a row,” Stiles said offhandedly. “I used to finish the work in thirty seconds and play internet chess for the rest of the time.”</p>\n<p>He grimaced at the board. “I can’t move my king.”</p>\n<p>“Think about it for longer than that,” Stiles said, rolling his eyes. “No wonder your plans are all such shit.”</p>\n<p>“That was the entire point of the exercise, although I would have phrased it differently,” Deaton said, coming back in the room. He waved Stiles off when he stood to surrender the chair. “No need, you can continue playing my side.”</p>\n<p>“Okay,” Stiles said, shrugging. Deaton walked over to the cabinets, took out a small pot with what looked like a foul, dark liquid, a bag of Reese’s Pieces and disappeared again. </p>\n<p>“That dude is the strangest guy in the world,” Stiles said, kicking Derek under the table. </p>\n<p>“Kick me again and I’ll rip your throat out,” Derek said but there was no heat behind his words. “Go play with your candle.”</p>\n<p>Stiles kicked him one last time and then slid off the chair, traipsing back to his stool.</p>\n<p>*</p>\n<p>The next Saturday, Stiles couldn’t get out of bed any easier. He swore to himself when he <i>again</i> didn’t have time to stop for coffee, and prepared himself for another tragically caffeine-less day. </p>\n<p>Then he walked into the clinic and found a battered old coffee pot sitting on Deaton's desk. </p>\n<p>“What is that?” Stiles said, stopping dead in his tracks. “Dude, <i>Deaton,</i> you do love me.”</p>\n<p>“Still no,” Deaton said, looking up from the newspaper he was reading. “I didn’t buy it, Mr. Hale did.”</p>\n<p>Derek looked away, embarrassed. “It was cheap,” he said. “Don’t get excited.”</p>\n<p>“Are you kidding me?” Stiles said, thrilled. “I love Wanda. Wanda is <i>my best friend.</i>’</p>\n<p>Derek smacked himself in the forehead, but Stiles wasn’t listening. He was too busy crooning sweet nothings to to the coffee pot.</p>\n<p>Deaton disappeared and then came into the room carrying a box of wood and tools.</p>\n<p> “Whoa,” Stiles said, eyeing him. “Is that a saw?”</p>\n<p>“Not for you,” Deaton said, and gestured to the candle. Stiles ignored him in favor of pouring himself more coffee.</p>\n<p>Deaton set his armload down on the table, and Derek gingerly took a seat in front of him. “Today you’re going to build a birdhouse,” Deaton said, laying out the pieces of wood. </p>\n<p>Stiles guffawed, and Derek kicked out at him without looking. “A birdhouse,” he said, flatly.</p>\n<p>“A birdhouse,” Deaton agreed. “And you’re going to narrate your reasoning every step of the way as you do it, out loud.”</p>\n<p>Derek looked horrified, and Stiles was literally shoving his face into his own elbow to keep his laughter silent. “Can’t I play chess?” Derek said desperately. “Pull my nails off with pliers?”</p>\n<p>Deaton shrugged. “I’m not forcing you to be here,” he said lightly. “You can do as you wish, if you’re too nervous.”</p>\n<p>“I’m not scared,” Derek said immediately. He glared angrily at the table for a moment, and then stood up. Deaton cleared his throat pointedly. Derek rolled his eyes. “I’m going to the bathroom,” he bit out. “Because I think it’d be a bad idea to pee on the birdhouse.”</p>\n<p>Stiles laughed so hard he cried.</p>\n<p>*</p>\n<p>“Are you still going to Werewolf Summer School?” Scott asked one afternoon, collapsing in the grass next to Stiles. The sun beat down on them, and Stiles regretting being the one to demand they practice in full lacrosse gear.</p>\n<p>“Yeah,” Stiles said, uncapping his water bottle. “You should have stayed. It’s kind of fun. I feel like I know so much now, and the bestiary is gonna be so good, not so cobbled together or pilfered from Argents.”</p>\n<p>Scott made a face. “Derek though. He’s so—” He made a vomit noise.</p>\n<p>Stiles shrugged. “He’s not so bad, sometimes.”</p>\n<p>Scott frowned. “Are you joking?” he said. “You’re talking about Derek? Derek <i>Hale</i>? I can’t believe you can stand being in the room with him that long without trying to kill him.” </p>\n<p>Stiles hesitated. “He’s trying,” he said eventually. “It’s like, Deaton keeps giving us weird, hard things to do. I’m getting off easy, he mostly just makes me sit quietly and meditate, or whatever. Sometimes I learn horrifyingly cool stuff, and read weird books. But Derek, he has to do these things he hates, but he <i>does them</i>.” He shaded his eyes from the sun, watching shapes on the edge of the field begin to take form as people approaching. “I think he knows he messed up last year. I think this is his way of trying to be different.”</p>\n<p>Scott made a noise, obviously still dubious. “That’s what Isaac said,” he said. “I’ll believe it when I see it.”</p>\n<p>“Can’t see it if you keep avoiding him,” Stiles said. He was weirdly bothered by the conversation; he wanted to keep defending Derek, and didn’t know why. “You should come, sometime. You could learn things with us.”</p>\n<p>“Why would I do that?” Scott said, laughing. “That’s what you’re for.”</p>\n<p>Stiles threw his stick at him.</p>\n<p>“Hey,” one of the guys approaching them said. “Working hard?” He moved out of the sun, and Stiles realized it was Danny, with a group of friends Stiles didn’t know. </p>\n<p>“We’re done,” Scott said, smiling up at him. “C’mon Stiles,” and Stiles moved obligingly to gather their stuff. </p>\n<p>“Don’t go on our account,” one of Danny’s friends, a blond guy with a charming smile, said, winking at him. </p>\n<p>“That’s all right,” Stiles said, accidentally hitting himself with his own stick. “We’re baking out here anyway.” </p>\n<p>“Smooth,” Danny said, laughing at him. Stiles gave him the finger, and moved off, surrendering the field to them. </p>\n<p>*</p>\n<p>Saturdays quickly started becoming both something he looked forward to and simultaneously dreaded. He had made no more progress on the candle front, couldn’t even get it warm, never mind cause a flame. </p>\n<p>But the other stuff, he kind of enjoyed. The world was so much bigger than he ever realized it was, and it was insane how many myths and legends he had known as a kid were actually true, and how many more that he hadn’t even know to dream of. </p>\n<p>He would probably always be haunted by a chapter he found on the reproductive habits of a six-armed demon-type thing that looked like a koala drawn by a six-year-old. He still didn’t fully understand why so much oozing was required. <i>So much oozing.</i> </p>\n<p>Deaton told them stories sometimes, when he was in the mood and it became <i>incredibly</i> clear that the dude had been in the shit. Stiles couldn’t help but look at him with a new respect now, and a healthy amount of fear. </p>\n<p>The chessboard made an appearance a few more times, but Deaton had Stiles playing Derek, which Stiles thought was an <i>excellent</i> distraction from his total lack of magical abilities. </p>\n<p>He and Derek ended up talking too, sometimes, over the games. Deaton would leave the room, going to deal with his vet responsibilities and they would kick back, bantering and trash-talking each other until Derek inevitably lost again. </p>\n<p>Sometimes, his least favorite times, they caught themselves rehashing old territory.</p>\n<p>“If it <i>had</i> been Lydia,” Derek said, controlled and rigid. “Or if Lydia had loved Jackson less, or not even, I wouldn’t have been wrong. We couldn’t stop it, we couldn’t—people <i>died.</i> You can’t say I’m fucked up when you didn’t care about how many people died because you had the hots for some girl.”</p>\n<p>“I didn’t do it just because of a crush,” Stiles said, angry. “I wasn’t the only one who thought, hey, maybe there’s another way. Scott said it too, Scott—”</p>\n<p>“Sometimes it might look like there’s another way,” Derek said, and upended a pawn meaningfully. “But it could be a trap. You need to learn when to <i>listen</i> to me. Scott doesn’t know everything. He doesn’t know what he’s doing and he’s going to make mistakes that could ruin his life.” Derek shook his head. “Jesus, he’s just a stupid kid.”</p>\n<p>“Oh he’s a stupid kid?” Stiles said, gesturing to himself pointedly. “Then what does that make me?” </p>\n<p>“Smarter than that,” Derek said, looking at Stiles, irritated. </p>\n<p>“You’re right,” Stiles said tightly, moving his knight to put Derek’s king in check. “But Scott’s my best friend, and he’s doing the best he can. I’m always going to take his side.”</p>\n<p>“Even if he’s wrong?” Derek snapped out, slamming a piece down. </p>\n<p>“Yes,” Stiles said, and his heartbeat didn’t waver. </p>\n<p>“And that’s why I don’t trust you,” Derek said.</p>\n<p>“Yeah,” Stiles said. “And that’s why you lose. Checkmate.”</p>\n<p>“Enough,” Deaton said, stepping towards them. Stiles hadn’t even heard him re-enter the room. “This accomplishes nothing, and you’re both very close to breaking the agreement here.”</p>\n<p>“Give me a book then,” Derek said. “Or talk to me, I don’t care. Just stop making me work with him. It’s <i>not</i> the reason I’m here.”</p>\n<p>Deaton gave him a look. “I know you’re not stupid enough to think there’s only one reason why you’re here.”</p>\n<p>“If this is a subtle pack merging attempt,” Stiles said, crossing his arms over his chest. “Then you should have kept Scott, not me.” Deaton shrugged, giving nothing away in his expression. </p>\n<p>“That speech you gave me last year about trust,” Derek said, abruptly. “That <i>was</i> about Scott, wasn’t it?”</p>\n<p>“Maybe,” Deaton said. “Or maybe things work out as they were meant to.” He left the room again, with one warning glance at the two of them. </p>\n<p>The anger was leaving Stiles, replaced by curiosity. “What were you talking about? What speech about Scott?” he asked, turning his whole body towards Derek. </p>\n<p>“Nothing,” Derek said grumpily. “Just once, I wish that guy would say something I’d like to hear.”</p>\n<p>“I think you have a better chance of flying,” Stiles said and Derek’s mouth quirked up a bit, and his foot brushed against Stiles’s, a little like a kick but more like an apology.</p>\n<p>*</p>\n<p>Saturday came around again, and Stiles swung himself out of bed easily, shedding his pajamas and throwing on jeans and a tee. </p>\n<p>“Morning, Wanda,” he sang out to the coffee pot as he came into the clinic and started her up. “You look ravishing today.” The coffee pot rumbled happily, growing warm under his hand. </p>\n<p>“It’s not even plugged in,” Derek said, frowning at him. </p>\n<p>“Oops,” Stiles said, grabbing for the cord. “I must have just pulled it out.” But he could still hear Wanda burbling, even before he got the cord back into the outlet. “Okay,” he said slowly. “So that’s happening.” </p>\n<p>“You are <i>supposedly</i> magic,” Derek said, dubiously. </p>\n<p>Stiles eyed the coffee pot. “I guess,” he said. “Would be nice if I knew how it worked.” He looked around. “Where’s Deaton? He should probably see this.”</p>\n<p>Derek shrugged. “Didn’t see him yet.” </p>\n<p>“Okay,” Stiles said, and backed away from Wanda entirely to take his normal seat at the table. “How’s the train car of misery and desolation?”</p>\n<p>“Desolate and miserable,” Derek said. “Last night we had a group recital of The Raven.” </p>\n<p>“I’d pay to see Boyd do that,” Stiles said in earnest. He focused in on what Derek was doing, which was studying the pages of Teen Vogue. “Are you seriously reading that?”</p>\n<p>“I hang out with teenagers,” Derek said, solemn. “It’s very important for me to keep up with the trends.”</p>\n<p>Stiles shoved up next to him, leaning on him to read over his shoulder. “How to Get Voted Most Popular,” he read. “This is surreal.”</p>\n<p>“There’s some good tips,” Derek said loftily. “In case any of them want that, I’m ready for advising them.”</p>\n<p>“Oh of course, it’s for them,” Stiles said. “Are you sure you’re not reading for yourself, for Pack Superlatives?”</p>\n<p>“I’m the alpha,” Derek said. “Everyone would already have to vote for me.”</p>\n<p>“Not me. I told you,” Stiles said, laughing. “Ten out of ten times, I’m gonna pick Scott.”</p>\n<p>“What about Most Banging Beach Bod?” Derek drawled, kicking his feet up onto the counter. “Surely I win that one.” He drew his hand from the top of his chest down the line of his abs, tugging on the hem of his shirt. </p>\n<p>“Scott’s pretty beachy,” Stiles said, but his voice was too high and his tongue felt suddenly too big for his mouth. Derek smirked like he didn’t need to hear Stiles’s heartbeat to know he was lying. </p>\n<p>Luckily that was when Deaton came in, and Stiles was saved from saying anything else. </p>\n<p>“Hey,” Stiles said cheerfully. “Would you like some coffee?”</p>\n<p>Deaton spared a look at him. “No,” he said. </p>\n<p>“Are you sure?” Stiles said, raising his eyebrows. “You wouldn’t want to think about that a little more, maybe inspect Wanda a little closer?” </p>\n<p>Deaton stared at him, unamused. </p>\n<p>“The coffee pot isn’t plugged in,” Derek said.</p>\n<p>“Oh, you’re a damn fun ruiner,” Stiles accused him, outraged. </p>\n<p>Deaton crossed the room instantly, to see for himself. “You did this?” he asked Stiles. </p>\n<p>“Well,” Stiles said, deflating. “I don’t know. It was like that when I came in.”</p>\n<p>“No it wasn’t,” Derek said. “It wasn’t on when I came in.”</p>\n<p>“It’s your spark,” Deaton told Stiles. “This is what I’ve been talking about. You should be able to feel it, if you concentrate.”</p>\n<p>Stiles closed his eyes and tried to concentrate. He didn’t feel any different, didn’t know how to give Deaton what he was looking for. He felt a lot like he had when he was eleven, and hoping Harry Potter was real, to be completely honest. </p>\n<p>Wanda burbled, and Stiles’s thought process immediately jumped to the coffee pot. It was entirely possible, he thought, that it wasn’t his effort at all. Maybe Derek had found a magic coffee pot. Maybe it was all a coincidence and Wanda was a person trapped in a coffee filter. Maybe this was all independent of him, and it was Wanda who should be getting the praise and attention. Maybe he should bring in some hazelnut grounds next week and reward her. </p>\n<p>He felt it then, suddenly and abruptly. It was like something under his skin, but not far, gathering and swirling through him. It perked up when he recognized it, and Stiles wanted to say <i>hello there</i>, like greeting an old friend. </p>\n<p>“I got it,” he said, opening his eyes. “I know what the spark is.”</p>\n<p>Deaton pushed the candle towards him. “Use it,” he urged. </p>\n<p>Stiles stared intently at the candle, and focused on everything Deaton had said. <i>I believe the candle could light</i> he thought to himself, over and over and over. <i>I believe, I believe, I believe.</i> </p>\n<p>Nothing happened. The candle stared back at him. </p>\n<p>“Coffee’s good though,” Derek said, sniffing as he poured a cup. “Is this hazelnut?”</p>\n<p>* </p>\n<p>It wasn’t always Saturdays either. It was a Wednesday, the first time Stiles’s phone buzzed with a text, and he opened it to see the message <i>come out</i> from a strange number. He rolled his eyes, saved the number, and went outside. </p>\n<p>Derek was a block down, leaning against his car, the long lines of his body bathed in the light of the moon. Stiles bit his tongue, hard, when he saw him. Stupid happy-go-lucky dick. This was <i>not</i> becoming a thing.</p>\n<p>“Can you look at something with me?” Derek said, straightening as Stiles approached. </p>\n<p>“I think this exact scenario was in one of my dad’s pedophile lectures,” Stiles said, and Derek gave him a look before turning to slide back into his car. Stiles wanted to protest over Derek just assuming the answer would be yes, but truth be told, he was kind of curious so he climbed in. </p>\n<p>Derek’s “something” was in the woods, because everything creepy happened in the woods. Derek stuck close to him, arms brushing as they walked. Stiles shivered, as the heat from Derek’s body made his goosebumps rise on his skin. </p>\n<p>“Cold?” Derek said, breaking the comfortable silence. Stiles shook his head, unwilling to make up an explanation when Derek would hear the lie anyway. Derek nodded. “It’s just up here,” he said, and pointed to an ancient-looking rock. </p>\n<p>There was a symbol drawn on it, an old looking rune. Stiles was abruptly and instantly fascinated. “Shit,” he breathed, and then wrinkled his nose. “Wait, <i>is</i> that?” </p>\n<p>“No,” Derek said.</p>\n<p>“Really?” Stiles said. “Because I want to get closer, but it looks like it and that’s gross.”</p>\n<p>“I think I could tell,” Derek said, rolling his eyes. </p>\n<p>“Get a lot of flaming bags on your doorstep?” Stiles muttered, but he stepped forward to examine it. </p>\n<p>“More like send them,” Derek said and crouched next to him. “Do you know what it means?”</p>\n<p>“No,” Stiles said, reluctant. “But I feel like it’s familiar, like I’ve seen it. It’s definitely not good. You don’t think it’s the alpha pack coming back, do you?” </p>\n<p>“No,” Derek said, and looked off in the distance, as if he was done speaking, before visibly reconsidering. “I mean, I don’t think so. It’s not their style, and plus, it smells off. Like weird magic, not like yours or Deaton’s. Just off. I took a run around, looking for something weird, but I didn’t see anything.”</p>\n<p>“You mean anything weirder than usual,” Stiles said. He gave Derek a look. “Birdhousing?” he said, impressed. Derek gritted his teeth and nodded. “Okay,” he said, trying to meet Derek halfway. “Appreciated.” He snapped a picture with his cell phone, and then tucked it in his pocket. “I guess that’s all we can do until Saturday. I bet one of Deaton’s books will help.” </p>\n<p>“Yeah, okay,” Derek said, and herded him back to the car, his hand warm on the small of Stiles’s back. “We'll work on it Saturday.”</p>\n<p>*</p>\n<p>“Look at this one,” Derek said the next time they met, shoving an open book across the table. “None of these symbols are right, but it’s close.”</p>\n<p>“Hey,” Stiles said, scrutinizing the book more closely. “Didn’t Deaton give you this last week? I thought you usually faked reading to spend more time contemplating the hollowness of life.”</p>\n<p>“Sometimes I accidentally pay attention,” Derek said, rolling his eyes. “You gonna look or what?”</p>\n<p>“This does look similar to our thing,” Stiles said, reading on. “I think maybe it’s a making something spell? Or a moving something spell?”</p>\n<p>“Wow,” Derek deadpanned. “That narrows it down.” </p>\n<p>“Feel free to do it yourself,” Stiles said, shoving the book back at him. Derek put one index finger on the top of the book, and effectively halted the book’s movement towards him, no matter how hard Stiles pushed. Stiles opened his mouth to fight about it, but Deaton took that moment to walk in. </p>\n<p>“Today, I thought we could—” he started, hefting a large box in his arms but Derek interrupted. </p>\n<p>“We’re actually working on something else, if that’s okay.”</p>\n<p>Deaton looked surprised, but not displeased. “Sure,” he said, and did an about-face through the door. </p>\n<p>“We could ask him for help,” Stiles said, under his breath.</p>\n<p>“Not yet,” Derek said quietly. “I don’t trust him.”</p>\n<p>“You don’t trust anyone,” Stiles sniped. “That’s your thing, that’s why you suck.”</p>\n<p>“I don’t trust <i>you</i>but I’m letting you help,” Derek said grumpily. </p>\n<p>“Oh sure, letting. Like you’re not incredibly lucky I’m here.” But he took the book back, studying the page Derek had opened it to. </p>\n<p>*</p>\n<p>They couldn’t find the exact symbol in any of the books they looked through. The best Stiles could hypothesize was that it was for generating energy, but he didn’t necessarily think it was someone getting power for themselves. It made his brain hurt. </p>\n<p>“I’m done,” Stiles said, shutting the book. “We don’t even know if this person was even being malicious.”</p>\n<p>“Everything is malicious,” Derek said darkly, but he stood up too. “C’mon, I’ll drive you home.” </p>\n<p>“Pessimist,” Stiles said, but he grabbed his hoodie and bag of Weird Werewolf Things and followed Derek out. </p>\n<p>*</p>\n<p>Stiles hated when Derek was right. It grated on him like nails on the worst, most annoying, grumpiest chalkboard. There was a figure in the road, and if it wasn’t making hell-hound level growls, it would have been kind of sweet looking, like a gingerbread man. It wasn’t tall, about half their height, and it was made out of the same stuff they had found painted on the rock. </p>\n<p>Derek hit the brakes so hard they squealed and Stiles would have rocketed forward if not for how Derek’s arm shot out to restrain him. </p>\n<p>Stiles said, \"Oh, great, it's the Pillsbury Poop Boy,\" but Derek wasn't around to appreciate his witty summation of events; he had slammed his door open as soon as the car stopped. He started running, wolfed out, and slashed the thing.</p>\n<p>Stiles reached for the zipper of his bag, and fumbled for one of the powders he’d gotten from Deaton. He dumped a handful on the center of his palm and slid out if the car, looking for an opening to douse the stupid thing.</p>\n<p>“Stiles!” Derek gritted out, throwing the thing to the ground. It paused, dazed, but recovered too well, reaching for Derek again. </p>\n<p>“I can’t get it,” Stiles said, frustrated. “It won’t stop <i>moving</i>.”</p>\n<p>“Do something,” Derek yelled, before attacking it again. </p>\n<p>“What am I supposed to do? Just ask it nicely? Hey guy, mind being nice and holding still for a sec so I can blow some powder over your gross little body that’ll kill you dead?” </p>\n<p>Shockingly, the figure stopped, staring weirdly at Stiles. It held still, waiting for something; Stiles didn’t know what, but he knew an opportunity when he saw it. He showered the thing with the powder, and willed it to work. “Die motherfucker,” he whispered, feeling the magic thrum through his body, coiling around his bones.</p>\n<p>The thing shriveled, dried up like a dead leaf in autumn. “Nice one,” Derek said, standing up and shifting back. </p>\n<p>“Thanks,” Stiles said, preening a little. “I wonder why it stopped. Do you think that was my magic?”</p>\n<p>“I guess,” Derek said, and buried the body. </p>\n<p>*</p>\n<p>It was comfortable there, in the passenger seat of Derek’s car. Usually he hated not being the driver, so much more confident being the one behind the wheel, but it felt okay in the Camaro. Plus, the heated leather seats were much nicer than the Jeep’s. </p>\n<p>“It ripped my jacket,” Derek grumbled, speeding faster than Stiles thought was necessary, and he hoped his dad wasn’t anywhere near them. </p>\n<p>“It also gouged a hole in your thigh,” Stiles added, admiring the way the bloody cords of Derek’s muscles were still disgustingly visible, even as the wound was beginning to close.</p>\n<p>“That will heal,” Derek muttered. “Leather doesn’t.”</p>\n<p>“You big baby,” Stiles said and snuck him up to his bedroom. They both got cleaned up, and Stiles made Derek help him get everything down into the bestiary Stiles was compiling and by the time they finished, it was late. </p>\n<p>“I probably shouldn’t have taken you with me,” Derek said disapprovingly. “That thing almost got you.”</p>\n<p>“I’m not even the one who got hurt,” Stiles pointed out. </p>\n<p>“Next time, I’m deciding—” Derek started. </p>\n<p>“Yeah yeah,” Stiles said. “Of the two of us, one of us is qualified to make decisions, and it ain’t you, Hale.” He couldn’t stifle a yawn behind his fist in time, and Derek tipped him out of the chair and shoved him into bed. </p>\n<p>“You’re a bully,” he said, burrowing into his sheets. </p>\n<p>“And you’re an idiot,” Derek said, and brushed his knuckles over the side of Stiles’s jaw. Stiles heard rather than saw the window open and close behind him. </p>\n<p>The last thing he saw before he passed out was Derek’s stupid torn jacket tossed over his chair. “Hey litterbug,” he slurred, thinking Derek might still be in hearing range, but fell asleep before he could get out the rest of the sentence. </p>\n<p>*</p>\n<p>He never did remember to get Derek to take the jacket back, and weirdly, it started to taunt him. Stiles always had a hard time putting stuff out of his mind, and every time he passed the stupid thing, he was distracted by thoughts of Derek. He put it on twice, looking in the mirror to if he looked like a wolf, looked intimidating and attractive like the rest of them, but he mostly just looked like Stiles, in someone else’s jacket.</p>\n<p>One night, bored and alone, having already jerked off twice, he Googled “how to repair leather.” It actually didn’t look that hard, and he’d never done it before, which made it all the more interesting. </p>\n<p>“You <i>are</i> a sexy-ass jacket,” he told it, running his finger over the tears. “Dude, I can’t believe he just wants to toss you. What kind of closet do train cars have that he can just afford to lose you?” He uncapped the fabric glue, and eyed the patch in his hands. Couldn’t make it worse, right?</p>\n<p>To distract himself, he kept talking. It was what he did best, mostly. “I’m not saying it’s your fault. I mean, he’s a giant idiot and throws himself into the dumbest situations, and you can’t help that.” He hummed, pressing the rip delicately around the edges. He was distracted for a moment by the sense of his magic poised at his fingertips and coiling around his wrists, but dismissed it. “You would tell him no, to knock it the fuck off if you could,” he assured the jacket. “Don’t blame yourself. You’re protecting him the best you can.\"</p>\n<p>The repair didn’t actually hold the first time, nor the second. The third time was passable, but he ripped it out anyway, because he didn’t like the look of one of the edges. As he worked, he kept his steady stream of words going, telling the jacket all the weird things that came into his brain. He tried not to let it bother him that it was almost entirely a monologue about Derek.</p>\n<p> It was only polite, he told himself, since Derek <i>was</i> the only person that he and the jacket had in common. </p>\n<p>*</p>\n<p>Stiles was making absolutely no progress with the candle. They had tried it the other way now, with Deaton lighting the wick, and letting Stiles try to put it out. </p>\n<p>The fourth time Stiles had accidentally just extinguished it with his breath, Deaton had finally lost it. “Stiles,” he said, exasperated and tired. “You are capable of magic, and I know you know that. I don’t understand why you can’t hold onto the mindset and <i>use</i> it.”</p>\n<p>“Because it doesn’t make any sense,” Stiles yelled. “How am I supposed to just will an object to do anything?. I don’t understand—every time it does work, when I manage to do something, anything, I don’t <i>know</i> what I’m thinking. I’m not a spark or a flame—I’m not—this is all so stupid!” He threw himself backwards in the seat, and willed himself not to panic, to breathe, not to fucking <i>cry.</i></p>\n<p>“You’re usually talking,” Derek said, into the angry silence.</p>\n<p>“Thanks,” Stiles muttered, shoving his chair back and standing up. “More mockery, that’s what I need.”</p>\n<p>“No,” Derek said, closing the book he wasn’t reading anyway. Stiles could sort of tell now, when he was faking. “I mean, when it works. You’re usually talking at whatever it is, telling it what you want it to do.” He didn’t make eye contact with Stiles, ducking his head like he was embarrassed to have been caught noticing.</p>\n<p>Stiles couldn’t focus on him for long. His eyes met Deaton’s, who looked surprised but made the “go ahead” gesture. Stiles sank back into his seat and stared at the candle again. </p>\n<p>“I’d appreciate if you’d put the flame out,” he said politely. “You’re really good at being a candle, but it’d be great if you just—” and the flame went out, suddenly and completely. Stiles gaped at it, completely startled by his success.</p>\n<p>Deaton was smiling, but he all said was, “Try lighting it back up now, Stiles.”</p>\n<p>Stiles fixed his gaze back on the candle, flush with success. “That was great,” he said, enthused. “That was so good, but now I’m like, oh see, that was definitely a mistake. You were so great at being a candle, you should just light up again, and let everyone see how talented you are. All good-smelling and warm.” He was probably overdoing it with his chatter, but this was it, this was the key, he thought; the breakthrough. </p>\n<p>The candle wick flared up, burning bright and merry, and the scent of jasmine filled the air. It was Stiles’s favorite smell, actually. His mom had burned it when he was a child, and it was part of Lydia’s favorite shampoo. It was a good smell, he felt, and inhaled sharply to admire it. </p>\n<p>“That candle was plain wax,” Deaton said, confused, but Derek stood, slapping Stiles on the back. </p>\n<p>“Nice job,” he said. “Now if the power goes out, we’ll finally have a use for you.”</p>\n<p>“You’d have to <i>have</i> power for that joke to even remotely work, you hobo weirdo,” Stiles retorted, turning to try and glare but he was still grinning so hard that even the edges of Derek’s mouth had to curl up in response. It just made Stiles feel happier, until he had to turn away, had to stop staring and smiling stupidly at Derek. </p>\n<p>That night when he got home, he lasted about thirty seconds in the empty house before he was jerking his pants open, stroking himself hard and intense. He came all over himself in record time. </p>\n<p>*</p>\n<p>It wasn’t the end of the gross cookie-looking guys. There was another one, then another, and more late night visits from Derek that ended with Stiles luring the stupid things to their death. Stiles’s strange vocal magic kept working on them. He and Derek worked out a routine where Derek would flush them out, Stiles would speak to them, then dust them, and Derek disposed of them.</p>\n<p>Then they’d go get food, mock each other’s choices and eat it in the car. Derek would drop him off and Stiles would finish off the routine, masturbating alone.</p>\n<p>He should be kind of disturbed by how many of his jerk-off sessions happened right after horrifying life-threatening adventures. It was hard to worry about it, though, when it was too good to twist himself up on his sheets, panting and squirming down on his fingers before jerking himself off. It was just the adrenaline, a post-stress reaction that got him revved up.</p>\n<p>The denial thing only worked for so long before he had to admit to himself how often he thought of Derek, imagining it was Derek’s fingers inside, Derek’s hand wrapped around his cock, Derek on him and in him, shoving him down and touching him. “Fuck, you want this, Derek,” he moaned, rocking down on his fingers. “You want this, you fucking want this, you want <i>me</i>.”</p>\n<p> </p>\n<p>*</p>\n<p>Derek liked it when Stiles showed off. </p>\n<p>He never said anything, didn’t go as far as actually <i>encouraging</i> Stiles, but somehow Stiles knew it all the same. </p>\n<p>They were playing chess, and Derek was getting better, good enough that Stiles couldn’t just go back to his book for awhile so Derek could scowl his way through his turn. Stiles had to watch, had to think about his own moves. But he was still Stiles, so pretty soon he figured out that he could ask the chess pieces to move for him, to cross the board when he wanted them to. </p>\n<p>“What a good bishop you are,” Stiles said approvingly, when one slid into the right space for him. He could feel his magic responding now, content like a cat purring in his lap. There was almost a warm hum of approval when he used it, now that he knew how it worked. </p>\n<p>“Too bad it was a terrible move,” Derek said, but he was smiling, his posture loose and relaxed in a way that Stiles still couldn’t fully get used to seeing. It was a thrill, something that glowed in him, that he could make that smile appear, and more than anything, it made him <i>want</i> Derek. </p>\n<p>He had wanted people before. There was Lydia, for years and years, and Danny, off and on. There was a girl who worked the late shift at a sandwich shop downtown who made Stiles’s heart flutter every time she wielded the mayo bottle. </p>\n<p>None of it compared to the way he wanted Derek. He couldn’t help but let it swell in his chest how much he wanted Derek, how stupid he was for him.</p>\n<p>The smile faded from Derek’s face, little by little, replaced by something else, something more complicated. </p>\n<p>“Okay,” Stiles said, standing up suddenly, embarrassed. “So if we—” and without him hearing, noticing, Derek was on him, touching his shoulder, pulling him gently against the line of Derek’s body. Stiles sucked in a short, sharp breath and then Derek was dipping his head to kiss it right out of him. </p>\n<p>It was a shock, but Stiles was kissing him back before he even processed what was happening. His magic sung out, coursing through him everywhere they were touching. He fisted his hands in Derek’s shirt and hauled him even closer, until they were pressed chest to chest and Derek was cupping the back of his skull, holding him still to kiss him, deep and wet, until Stiles had to pull back, had to breathe. </p>\n<p>He opened his eyes. Derek looked like the stuff of his deepest fantasies. His shirt was rumpled where Stiles had his hands in it, and he was breathing hard as well, chest heaving. His eyes—his eyes were glazed over and he looked stunned, like he’d been—like Stiles had—</p>\n<p>“No,” Stiles said, blood draining from his face. The word was croaky and felt like it had to be wrenched out of his chest. “God, <i>no</i>.”</p>\n<p>“Stiles,” Derek said, confused. He reached forward, hand grazing Stiles’s elbow, but Stiles ripped it away, slid out from where Derek had him pinned.</p>\n<p>It wasn’t real. He had done this, like the little men, like the coffee pot and the candle, and everything else. He had wanted Derek, had jerked off to Derek in his own imagination countless times, <i>had poured his belief into each and every fantasy</i>. Now he had gotten it. </p>\n<p>Stiles could be a selfish person, but not this selfish. <i>Not like this</i>, he thought viciously at whatever part of himself did crap like this, could make something like this happen. “I don’t want this,” he said clearly and loudly, forcing conviction behind the words. “You don’t want this,” and that was easier, truer. </p>\n<p>“You seemed to like it just fine a minute ago,” Derek said, face going hard and closed off. His voice was biting, and Stiles flinched. He sounded like he had all those months ago, when they first started Saturdays together. </p>\n<p>“Yeah, you misunderstood,” Stiles said. “I can’t. Not,” he hesitated, knowing it was a low blow. “Not with you.”</p>\n<p>Derek reeled back like he’d been hit. His mouth opened, and then closed again and Stiles hated the look on his eyes, the raw, split open pain. He was racking his brain for something else to say, some middle ground he could walk, when Derek turned and left, so quickly he might have been running.</p>\n<p>Stiles slumped down against the wall and stayed there for a long time. </p>\n<p>*</p>\n<p>He couldn’t be around Derek. Couldn’t look at him, talk to him, couldn’t be trusted to be near him. Not until he could learn to control himself, and Stiles had never been very good at that to begin with. </p>\n<p>“I want separate lessons,” he told Deaton, restlessly fidgeting in the middle of Deaton’s office. </p>\n<p>Deaton stopped, looking up from the paperwork he had been sorting and eyed him. “Separate from Derek, you mean.”</p>\n<p>“Yeah,” Stiles said, twisting his fingers together. He didn’t know why he was so hesitant to tell Deaton what he’d done. Deaton could help, probably, could teach him how to stop, but Stiles couldn’t imagine getting the words out, facing Deaton with the cold facts. He was no better than a frat kid with a roofie and he didn’t want to see the look on Deaton’s face when he realized it. </p>\n<p>Luckily, after a beat of silence, Deaton nodded. “Fine,” he said. “Wednesday.”</p>\n<p>Stiles still woke up early on Saturday, and he rolled over, swinging his legs over the bed before he remembered. “Well, this is awful,” he said, and tried to smother himself with a pillow. </p>\n<p>It didn’t stop being awful. All week, he found himself reaching for his phone, looking for Derek’s car, forgetting again and again before it all crashed down, like a punch to his chest. </p>\n<p>Another Saturday morning went by, and Stiles threw himself into video games, headphones jammed on his head, blocking everything out. </p>\n<p>“Stiles,” his dad yelled, shaking his shoulder, like he’d been repeating it for awhile. </p>\n<p>“Yeah?” Stiles said, blinking as he tore his eyes away from the screen. </p>\n<p>“Do you want dinner?” his dad said, frowning at him in concern. </p>\n<p>“Not really,” Stiles said. Was it that late already? Hadn’t he only had breakfast an hour ago? He shook his head to clear it. “You heading out?”</p>\n<p>“Yeah,” his dad said, his voice concerned. “I can stay though, if you need something.”</p>\n<p>“No,” Stiles said flatly, and unpaused his game. His dad hesitated for another minute, and then left. Stiles listened until he heard the front door open and close again. </p>\n<p>It got late, and eventually Stiles got in bed, only to lay there, staring at the ceiling. Sleep eluded him, was about as possible as him growing wings. He was just contemplating giving up, going downstairs to eat his feelings, when his window slid open and Derek was there. </p>\n<p>“You stopped coming to Deaton’s,” he said, subdued. He leaned back against the window, eyes on Stiles. </p>\n<p>Stiles sat up, averting his eyes, resolutely thinking safe, blank thoughts. “Scheduling conflict,” he said. “My dance card just got too jampacked and I had to make some adjustments. You know how it is. Living the crazy life.”</p>\n<p>“Jesus, Stiles,” Derek said, low and pained. “I wouldn’t have—I’m not going to touch you again. You don’t have to think—”</p>\n<p>“I don’t,” Stiles rushed to assure him, to stop this in its tracks. “It’s not you, you’re—I just need more time,” he said, and it sounded lame in his own ears. <i>It’s not you, it’s me</i>, he almost said but he wasn’t trying to piss Derek off more than he already had. </p>\n<p>Derek nodded, stiff and jerky. “I’m sorry,” he said. “For what it’s worth. You were right to stop—I know I’m not—anyway, it was smart. It’s fine.”</p>\n<p>This was agony. Pure and utter torture. He wished a meteor would fall from the sky and land right on him, to crush him into a million battered pieces, anything to end this conversation. Derek was beautiful in the moonlight, the long lines of his body mouth-watering as he leaned back against the window, and he was <i>apologizing</i> for wanting Stiles, under the impression Stiles thought he wasn’t worth it, wasn’t good enough. There weren’t enough meteors in the world for the explosion Stiles wanted to happen right now. </p>\n<p>“You should take your jacket,” he said, for lack of literally anything else in the world to say. He gestured at it, where it sat draped over the back of Stiles’s computer chair. </p>\n<p>Derek blinked, confused as he followed Stiles’s gaze. “You still have that,” he said that, slow and confused. “I thought you must have thrown it out.”</p>\n<p>“No,” Stiles said. “I mended it, the rips, I mean. I fixed it.”</p>\n<p>“Thank you,” Derek said politely, examining it. He stepped back towards the window, clutching the jacket in his hands, and then stopped, turning back. “Come back,” he said, desperate. “To Saturdays, at least. Please.”</p>\n<p>“Soon,” Stiles said, and his voice was wrecked. “When I can.”</p>\n<p>Derek left then, without another word. Stiles locked the window behind him. </p>\n<p>*</p>\n<p>“I really want to help you, though,” Scott said earnestly, passing him a blue raspberry slurpee. “You’re always there for me with Allison, and I’m trying here, but it’s kind of hard when you won’t tell me what’s wrong.”</p>\n<p>“I know,” Stiles said, and mangled the straw viciously. “I appreciate it anyway, dude.”</p>\n<p>Scott slapped him on the back, and they headed back to the car together, Stiles kicking rocks the whole time. </p>\n<p>“Hey,” someone said, chasing them out of the 7-11. Stiles turned and vaguely recognized him as the guy who winked at him on the lacrosse field. Rob? Rick? Ron?</p>\n<p>“I thought it was you,” the guy said easily, giving Stiles a smile. He stuck out his hand. “Hi, I’m Ryan.”</p>\n<p>“Stiles,” he said, shaking it. </p>\n<p>Ryan held his hand a beat too long, and then turned to Scott. “Are you Stiles’s—” and he let the sentence hang a moment while Scott and Stiles stared at him. </p>\n<p>“What?” Stiles said, appalled. “Dude, gross.”</p>\n<p>“Best friend,” Scott said, grinning. “I’m gonna get something out of the car, I’ll just be, yeah,” and he ducked sideways into the passenger’s seat and closed the door. </p>\n<p>Ryan smiled at him, his blond hair falling into his face. “That makes this much less awkward,” he said. </p>\n<p>“What does?” Stiles said. He kind of saw where this was going, but he was intrigued by how calm he was, how his magic was asleep, not alive and dancing up and down his skin. </p>\n<p>“You not being with him,” Ryan said, nodding at the car where Scott sat, big stupid smile on his face. “Because I would have asked you out anyway.”</p>\n<p>Stiles felt nothing about this kid. Totally, completely nothinged him. It was perfect. He grinned and stole Ryan’s phone, and typed his number in. </p>\n<p>When he finally slid in behind the wheel, Scott punched him lightly on the shoulder. “This is good! This will cheer you up! Maybe you and Ryan will fall in love tonight and go on double dates with Allison and me all the time!”</p>\n<p>“Maybe,” Stiles said, but couldn’t really picture it, no matter how hard he tried. </p>\n<p>*</p>\n<p>Ryan took him to a pizza place on the outskirts of town. He was a nice guy, and Stiles could see why Danny liked him. He was funny, easy-going and <i>interested</i>, leaning slightly towards Stiles, listening attentively when he talked. It was charming, and Stiles was into it, because no one, with the exception of Scott sometimes, ever made a point of letting Stiles know they were listening. </p>\n<p>“Okay,” Ryan said, leaning back with the air of someone issuing a challenge. “Favorite Adult Swim show, go.”</p>\n<p>“Past or present?” Stiles said, eyes narrowed. </p>\n<p>“Either,” Ryan said, licking the grease off his fingers. </p>\n<p>Stiles clapped his hand over his heart. “Damn,” he said, grimacing. “Don’t go for the easy questions, or anything.”</p>\n<p>Ryan shrugged at him, smirking. “No pressure, but if you answer wrong, I’m gonna dine and ditch.”</p>\n<p>Stiles laughed, and tapped his fingers against his lips, thinking, when he glanced up to see Derek standing a few feet behind Ryan, frozen, with a devastated look on his face. </p>\n<p>“Uh,” Stiles stammered out. “I’ll be right back.”</p>\n<p>“Are you ditching without even answering?” Ryan said. “I didn’t think the date was going <i>that</i> bad.”</p>\n<p>“It’s not,” Stiles said, internally dying over the way he <i>knew</i> Derek heard the word date. “I just—seriously, five minutes, sorry, so sorry.” He squirmed out of the booth and headed for Derek, who only seemed to unfreeze when Stiles approached. “What’s up?” Stiles hissed, dragging Derek by the wrist towards the entrance. “Is something wrong? Is everyone okay? Derek, don’t leave me in suspense, dude. Just tell me how bad it is.”</p>\n<p>“Nothing’s wrong,” Derek said, and his skin actually felt a little chilled where Stiles was holding him. </p>\n<p>“Okay,” he said. “So why are you here? Are you—you’re not following me?” and his mind conjured up an image of Derek as a lemming, falling mindlessly off a cliff, will forever subjugated by Stiles.</p>\n<p>“Order for Hale,” the guy at the counter said, and Stiles flinched with his whole body. </p>\n<p> Derek just looked at him, face still so crushed and pinched. “Enjoy your date,” he said, his voice like a car crash, before he pulled his wrist free and walked away. </p>\n<p>Ryan was still incredibly sweet when Stiles got back, and he stayed sweet, even when Stiles asked to go home, and neither of them brought up another date.</p>\n<p>*</p>\n<p>“Okay,” Scott said the next day, bumping his shoulder into Stiles’s after dropping off a bag to Scott’s mom at the hospital. “So Ryan wasn’t your Allison. You can’t just give up!”</p>\n<p>“I’m pretty sure I can,” Stiles said, bumping his shoulder back. “Or maybe not giving up, but pausing. For a while. Maybe until I’m eighty.”</p>\n<p>“I guess,” Scott said. “If <i>you’re</i> happy.”</p>\n<p>Stiles was debating how to answer that one when Scott suddenly jerked at his side, inhaling in the way that Stiles knew meant he was fighting a shift. “Scott,” he hissed, grabbing Scott’s arm and digging his nails in before he saw what Scott saw—one of the little dirt guys standing there, in the bushes outside the hospital. </p>\n<p>It had more of a human shape then the other’s had, was closer to his and Scott’s height, and had <i>eyes</i> which was possibly the creepiest part of all of it. They were mostly just divots, dips in its sort-of face but they lent menace to its appearance, something that sent shivers down Stiles’s spine. </p>\n<p>“What is it?” Scott asked, fierce and low. </p>\n<p>“The monster things I’ve been telling you about,” Stiles said, already moving forward. “The ones we can’t track, can’t figure out where they’re coming from.”</p>\n<p>“But you can kill it?” Scott said, his voice taking on more and more of a growl. “Dude, we’re at my mom’s <i>work.</i>”</p>\n<p>“Yeah, yeah,” Stiles said, already fumbling for the stupid emergency kit of defensive crap he’d made up to fit in his school bag. He readied a palmful of the powdered herbs he’d perfected on these things and started speaking calmly and steadily. “You’re going to hold still and quiet. You can do that for me, can’t you?”</p>\n<p>“Yes,” Scott said, behind him.</p>\n<p>“Not you,” Stiles snapped. “You are going to kill it!” The creature twitched, and Stiles abruptly lowered his voice back down, crooning sweetly to it until he got close enough to dust it. “Now, Scott!” he yelled, and Scott swiped at it, right where its guts would have been if it was a person. </p>\n<p>Nothing happened, except that bits of clay went flying. “Dude,” Scott said. “How does it work when you and <i>Derek</i> do it?” </p>\n<p>“He just kills it,” Stiles said, mostly hysterical by now. “It’s not usually this hard!” He dusted it again, for good measure, and Scott ripped out its throat, separating the head from the body. The eyes moved still, and Stiles could see the limbs still twitching as if it wanted to get back up, to put itself together again. But then, finally, the magic went out of it, and it crumbled into clay and herbs again. </p>\n<p>“Holy shit,” Scott said, slumping against the brick wall of the hospital. “That was awful.”</p>\n<p>“No kidding,” Stiles said, slumping next to him. “Trying dealing with it ten more times.”</p>\n<p>“You still haven’t figured out who’s causing it?” Scott said. “Deaton doesn’t know?”</p>\n<p>“We haven’t exactly told him,” Stiles hedged, and Scott rolled his eyes. </p>\n<p>“Derek’s a real good influence on you. Come on,” he said, marching towards the Jeep. “Let’s go see Deaton.”</p>\n<p>“I don’t want to,” Stiles said, already knowing it was a lost cause. “It’s <i>Saturday</i>.”</p>\n<p>*</p>\n<p>He was half hoping Derek wouldn’t be there, or that Deaton would see them separately, or maybe a giant asteroid would crash into the earth, directly on top of Beacon Hills. </p>\n<p>But nothing ever worked out the way he wanted, so Stiles got to watch as Derek picked up his head and let his expression soften hopefully when Stiles entered, and then fall again, turning his attention resolutely away. Stiles wished even harder for a painful, explodey death. </p>\n<p>“Stiles needs everything you have on magic dirt,” Scott said to Deaton, entirely ignoring Derek. </p>\n<p>“Dirt,” Deaton said, raising his eyebrows. “You’re going to have to be more specific I think.”</p>\n<p>“Clay,” Stiles said, and he could feel Derek’s attention on him. “It’s more like clay. Someone’s making Play-Doh people, but out of magic clay.”</p>\n<p>Deaton hummed thoughtfully, and then turned, disappearing towards his office. There was an awkward minute of dead silence before he returned, brandishing books at Stiles. </p>\n<p>“You might need the use of this,” he said, and placed a Hebrew to English dictionary on the top of the stack.</p>\n<p>Stiles grimaced and settled down. </p>\n<p>“You,” Deaton said to Scott, “owe me some cage scrubbing.” Scott groaned and trudged out of the room with him, leaving Stiles alone, reading quietly, with Derek. Derek didn’t say anything, didn’t move to help, but his presence was soothing anyways, and Stiles stayed hyper-aware of him, even as he read. </p>\n<p>He knew the moment he found it. His magic, which had been busy tingling at him in that way that signified Derek being close, (which he knew, <i>thanks for nothing</i>) immediately traveled down his body and centered around his hands where they held the book, like his skin was singing out that this was right. </p>\n<p>He read and he read, and then he took notes, and read some more. A plan was taking shape in his mind, but it wasn’t fully formed yet. “I’m taking this book,” he yelled in the direction he thought Deaton and Scott were, and grabbed his bag, dashing for the door. </p>\n<p>Derek was in front of him, blocking the way. “What did you find?” he said, and his eyes were laser focused on Stiles in a way that made him squirm. “Stiles, what is it,” and he reached his hands out, like he was going to touch Stiles’s hand where it was clutching the book.</p>\n<p>It was too much. Too much magic and weird stuff going on and <i>Derek</i> and Stiles still was rolling with guilt over Derek seeing him with Ryan and he just—“Stop,” he said, shifting away, stepping back. “Don’t do that. Don’t, just let me through.”</p>\n<p>“Late for another date with your boyfriend?” Derek said, folding his arms against his chest. “Tell me what you found.”</p>\n<p>Scott coughed once from behind Derek, eyes darting speculatively between them.</p>\n<p>“Nothing, he’s not my boyfriend,” Stiles said, and took the opportunity to duck past all of them. </p>\n<p>*</p>\n<p>Stiles had been up all night making plans. Scott had let him be, had hung out around most of the night, trying to keep Stiles from ramping himself up higher and higher, but had eventually gone home when Stiles had decreed they both needed to crash. Stiles, however, hadn’t slept a wink, and the second the sun had come back up, he was climbing out of his own window and sliding down the tree. </p>\n<p>“Coffee?” Derek said, from the passenger seat as Stiles snuck his way into the Jeep.</p>\n<p>“Fuck,” Stiles swore, smacking his wrist on the back of the steering wheel. “What the hell, man?” He accepted the Starbucks cup Derek was holding out to him, but didn’t lessen his glare even a little.</p>\n<p>“You think after two months of working together, I can’t tell when you’re up to something?” Derek drawled, settling back in the seat.</p>\n<p>“I’m not up to—why would you—you’re seriously—” Stiles blustered, but Derek just sipped his own coffee, bracing one foot against the dash. “Ugh, fine,” Stiles said, giving up. “But you’re not going to like it.”</p>\n<p>“I’m sure I won’t,” Derek said, smug with triumph.</p>\n<p>“It’s a golem,” Stiles said, blowing the air out of his chest with a sigh. “They’ve all been golems, practice ones I think. That’s why they’ve been getting stronger, more formed. Whoever’s making them, they’re getting better. And the full moon tomorrow, I think that’s when the trial goes live.” </p>\n<p>“Okay,” Derek said slowly. “So why didn’t you just tell me that yesterday?”</p>\n<p>Stiles started the car, and put it in drive, mostly to have something to do with his hands. “I wasn’t sure. I don’t think you’re supposed to be able to kill them the way we have been,” he said grimly. “I think it’s been a fluke, and the one last night, that one with Scott and me, we almost didn’t get it.” He chanced a look at Derek, and then darted his eyes away. “There’s words, or a word, or a symbol that the caster has to use, has to draw on it somewhere. You’re supposed to have to destroy that to stop a golem, so—”</p>\n<p>“We must have been doing it by accident,” Derek said, relaxing in the seat. “So what’s the big deal? We aim for anything that looks written next time.”</p>\n<p>“We still have to find the caster,” Stiles reminded him. “But the one he’s gonna make tomorrow, the big one? I don’t think it’s going to be that easy to kill.” </p>\n<p>“But you have an idea of how?” Derek said, getting impatient.</p>\n<p>“Yeah, this is where you get mad at me,” Stiles said, and started talking.</p>\n<p>*</p>\n<p>They pulled into the parking lot for the dingy liquor store, three blocks from their actual destination. “This is the stupidest thing we’ve ever done,” Derek fumed.</p>\n<p>“I would like to remind you that I didn’t <i>invite</i> you,” Stiles said, slamming his way out of the Jeep.</p>\n<p>Derek was right with him, hot on his heels. “You don’t even know that it’s going to work! It’s a stupid risk, Stiles!”</p>\n<p>As Derek had now repeated this argument at least six times, Stiles felt justified in snapping. He whirled on Derek. “Look, you want me to keep being the spark? You want me to help you and your friends with whatever stupid magic I can do? Then this is the trade-off! I am going to break into this museum, and I am going to steal a blessed dagger, and then I’m going to stab a honking big monster with it. Because I’m the only one who <i>can.</i> Okay?”</p>\n<p>Derek clamped his mouth shut, still clenching his fists furiously. Stiles threw his hands up and kept walking, sticking more to the shadows as they approached. It was still early morning, and the street was quiet without the sounds of the morning commute. Stiles stuck his hands in his pockets and tried to look completely unobtrusive.</p>\n<p>“They’re your friends too,” Derek muttered as he caught up.</p>\n<p>“That’s what you got out of that?” Stiles said, but he didn’t argue the point.</p>\n<p>“How do you know that book was even right?” Derek said, nudging him towards a window of the museum that Stiles could just barely make out was cracked open. “It might not even be the right dagger.”</p>\n<p>“I don’t,” Stiles said, absently, looking for something to use as a stepladder. “I just have this feeling. I think I knew this was here all along.”</p>\n<p>Derek huffed, and crouched under the window, lacing his fingers together, palms up. “C’mon then,” he said.</p>\n<p>Stiles grinned, and stepped up into his hold.</p>\n<p>*</p>\n<p>It was the right dagger. Stiles didn’t know how to explain it, but after Derek broke the case open, the dagger seemed to leap into his hands. He felt something deep, like an electric current but through his chest, sizzle when he touched it and he immediately tucked it away, stowed it in the bag he had brought with him. </p>\n<p>“Shit,” Derek said, whipping his head around towards the entrance. “Someone’s coming. We have to go.” They barreled back down the way they had come, towards the open window, but even Stiles could hear the footsteps coming. With no time to doubt himself out of it, Stiles ducked behind a tapestry, pulling Derek with him. “Hide me,” he told it. “Please hide us, please make them move on, please please please.” The guard was there, huffing and puffing as he ran, but his feet never paused and Stiles heard him skid to a stop down the hall and around the corner, where the broken case was. </p>\n<p>Derek was grabbing him then, shoving him forward and up until his fingers were scrabbling on the open windowsill and they were out.</p>\n<p>Stiles opened his phone as soon as they got back into the car and called Scott to tell him, but when Scott answered, he was half-hysterical. </p>\n<p>“The little dude things are everywhere,” he yelled into the phone. </p>\n<p>“Golems,” Stiles said, like he had known that more than twenty-four hours. Then the words kicked in. “Wait, what?”</p>\n<p>“Stiles,” Scott nearly shrieked. “You have to come, there’s two outside the hospital and my mom’s at work, and I think your dad is on his way. You have to come do your dust thing.”</p>\n<p>“Shit,” Stiles said, panicking. The edge of the dagger was gleaming at him from the top of the bag. “Dude, there’s a bigger one, there’s a guy and he’s controlling it—”</p>\n<p>“It’s my mom,” Scott yelled, and Stiles winced and held the phone away from his ear “How can you not want to save her?”</p>\n<p>“She’s not in danger, Scott!” Stiles said, wounded. “She’ll be with my dad, and my dad has a <i>gun</i> which will definitely <i>slow</i> the little ones down. But the big guy, <i>that’s</i> what’s going to kill us all.”</p>\n<p>“You think,” Scott said accusingly, and Stiles faltered. He felt rather than heard Derek press in closer, the warm line of his body a solid presence against his back. </p>\n<p>“Derek says so too,” Stiles said, without needing to turn and check Derek’s reaction. “You can do what you want, but I want—I have to go with Derek.”</p>\n<p>“Fine,” Scott said, and his voice was angry and tight but he exhaled, clearly trying to calm himself down. “Be careful,” he said more gently. “I don’t want—I’m not there. Just, don’t get hurt. Tell Derek I’ll murder him if you get hurt.”</p>\n<p>“Yeah, okay,” Stiles said, clutching the phone a little tighter. “You too. And If my dad asks, just tell him—”</p>\n<p>“Yeah, yeah,” Scott said, already hanging up. “I’ll cover you.” Then he was gone, silence on the other end.</p>\n<p>Stiles bent and picked up the dagger, careful to avoid the wicked edge of the blade. </p>\n<p>“Can you do this?” Derek said, watching him intently. </p>\n<p>“Yeah—yes,” Stiles said, as much to convince himself as Derek. “I got this.”</p>\n<p>“Okay,” Derek said. “I trust you.”</p>\n<p>*</p>\n<p>They found the mega-golem at the same place they had found the first rune. It was beyond tall, and for a bizarre moment, Stiles almost laughed, looking up at the monster. It had rudimentary eyes and a half-formed mouth, but its hands were perfectly capable, as it proved when it picked Derek up, dangling him above the ground. </p>\n<p>“Stiles,” Derek barked at him. “Do it now!” He was sweating and red-faced, struggling against the thing’s iron grip.</p>\n<p>“Yelling at me doesn’t help!” Stiles shot back, and pointedly turned his back. “Okay,” he addressed the dagger. “Activate!” The dagger gleamed, cold and unimpressed. “Start,” Stiles tried. “On. Go.” </p>\n<p>There was no reaction and Derek yelped as the golem dropped him onto the ground. </p>\n<p>Stiles’s hands shook and he felt fear lick down his spine. “Hey,” he yelled. “It’s 2013. How many chances do you think you’ll have to slay a monster? Don’t you think there’s a million daggers out there that would gladly trade your position? You’re being an absolute idiot to let this pass you by. MaybeI should go find another dagger, one more brave and awe-inspiring.” </p>\n<p>The dagger twitched infinitesimally, and Stiles felt a mean sort of satisfaction break through the mind numbing fear. “After all, the dagger that kills this golem, well, I’m pretty sure there’s nothing but glory and admiration in its future. It’d probably be revered among all daggers, as the best, most strong dagger in <i>legend.</i>”</p>\n<p>The dagger glowed finally, with a touch of indignation, Stiles felt. That was all right. It could be mad all it wanted as long as it worked. “Thank you,” he said heartfelt, and darted forward with the dagger as it glowed brighter and brighter with each step. “Come on,” he muttered to himself. “You can do this.” He drew his arm back, summoning all the will and belief he had, and brought the sacred dagger down in the meatiest part of the golem’s belly, drawing a jagged line directly through a line of script drawn there. </p>\n<p>It felt like stabbing a hoe into the ground. It slid in, and then the clay began to crumble and the golem fell, shaking the earth as it did. </p>\n<p>There was a warm touch to his hand, and he looked to see Derek, mouth twisted and worried. “You’re burned,” he said, and Stiles looked down to see his hand was red and blistered where he had been gripping the dagger. </p>\n<p>“It doesn’t even hurt,” he said, flexing his fingers. Derek’s hand suddenly tightened around his wrist, and he yanked Stiles behind him as a figure dashed from behind the rock towards the treeline. </p>\n<p>“Fuck no,” Derek snarled and leapt forward, dragging the man to the ground. </p>\n<p>It was an odd sort of dude to be their villain. He was short and balding, with small framed glasses and a sweater vest. But his face was twisted in a sneer, and his hands were streaked with clay and blood. “Fuck you, mongrel,” he hissed, and brought his hand up, another dagger hidden in his fist</p>\n<p>Stiles moved, but not quick enough, and the dagger slashed him, a thin, deep line down his bicep. He hissed and dropped to one knee, trying to stop the bleeding.</p>\n<p>Derek roared, furious and vicious, and brought his claws down, slashing the man’s throat. </p>\n<p>“Oh my <i>God</i>,” Stiles said, and he listed sideways, losing the adrenaline and fear that had kept him moving. </p>\n<p>Before he could do more than stumble, Derek was there, taking his weight with a hand on the small of his back. He growled, herding Stiles impatiently into his car. “I’m taking you to see Deaton.”</p>\n<p>“In the morning,” Stiles said, slumping back in the seat in exhaustion.</p>\n<p>“You’re bleeding,” Derek said, shaking his head. </p>\n<p>“It doesn’t hurt,” Stiles said. “Derek, I promise I’ll see him first thing.” He let his head loll against the window. “Please,” he said, hoarsely.</p>\n<p>Derek didn’t look happy, but he didn’t argue further, just turned the car towards Stiles’s house. </p>\n<p>The car was silent, and Stiles leaned his head back against the headrest. There was a part of him that revelled in his proximity to Derek, in being in Derek’s car again, just the two of them. He didn’t know what Derek was thinking, whether Derek was still being affected, so he kept his thoughts, and hopefully his magic, to himself.</p>\n<p>“My dad’s fine,” he said, after the silence had gone on too long. He thumbed his phone open to read Scott’s text yet again. “When you killed that guy, they all crumbled. They’re all at the station, giving statements. He’ll probably be gone til morning.”</p>\n<p>Derek nodded, and pulled into the driveway. Before Stiles could even begin to move towards the door, Derek was out of the car and coming around, opening Stiles’s door and helping him out. “Not an invalid,” Stiles said grumpily, trudging towards his front door. </p>\n<p>“Stop getting hurt and I’ll stop treating you like one,” Derek retorted.</p>\n<p>Stiles rolled his eyes and unlocked the door. “I’ll work on that,” he said. “You have a good night, now.”</p>\n<p>“Yeah, right,” Derek said, and bulldozed his way into the house. Before Stiles knew it, he was being herded upstairs to his room, bullied towards the computer chair, and held tight under Derek’s hands as Derek carefully bandaged the slice on his arm</p>\n<p>“You’re gonna need to take those off,” Derek said, when he was satisfied with his handiwork, nodding at Stiles’s clothes. </p>\n<p>“You’re not going to leave until I do,” Stiles said, sighing hopelessly. Derek shook his head. “At least turn your back?” he said edgily, hands on the fly of his jeans. Derek’s mouth pulled down, but he turned, facing out the window while Stiles shucked the bloodstained guts-covered clothes off and pulled on pajamas. He should probably have showered, but standing was no longer on his list of things he wanted to do. </p>\n<p>He flopped down on his back sideways over his bed, staring at the ceiling. “Okay,” he said. “I’m fine. Time for you to go.”</p>\n<p>“I will,” Derek said, clearly unwilling to do so. “Do you want me to call...someone?” He bit out the word like it was the last thing he wanted to offer. </p>\n<p>“No,” Stiles said, rolling his eyes. “Since you’re clearly going to keep bringing it up, I’m not going to see him again, okay? I’m Stiles the dateless wonder, once again.” </p>\n<p>“Okay,” Derek said, in a marginally less grumpy tone. “Are you going to be able to sleep?” </p>\n<p>“Yes,” Stiles said, staring at a section of ceiling that still retained spots of the double sided tape he’d used to hang glow-in-the-dark stars when he was eight. “I’m fine.”</p>\n<p>“You said that already,” Derek said and suddenly he was there, standing between Stiles’s thighs. Stiles tipped his head up to look at him, immediately on alert. He hadn’t thought he’d been thinking about Derek particularly, but maybe he was doing it unconsciously now. Derek was looking down at him in a way that made Stiles’s throat close up when he tried to swallow. </p>\n<p>“You, with that dagger tonight,” Derek said. “You looked—” he trailed off, like he didn’t have an answer. </p>\n<p>“Ridiculous, I’m sure,” Stiles said. He should have tensed, should throw Derek out, but he didn’t want to, didn’t have the energy. </p>\n<p>“No,” Derek said quietly. “You looked like a hero.”</p>\n<p>Stiles did tense at that. “Don’t,” he said roughly. “Don’t use that word.” </p>\n<p>He twisted away, meaning to sit up when Derek stilled him with a hand to his chest. “I told you I wouldn’t touch you like that again if you didn’t want it,” Derek said, “and I’ll hold myself to that.” </p>\n<p>He didn’t say anything else, just <i>looked</i> at Stiles, waiting, watching. </p>\n<p>If Stiles were a good person, he’d have said no. He’d have told Derek to get out, would have curled up alone under his sheets. If he were a good person, the second Derek was out the door, he would have bought a plane ticket to a Tibetan monastery and not spoken to another human being until he was sure he wasn’t as bad a monster as the one they had killed that night.</p>\n<p>If Stiles were a good person he wouldn’t have shot his arm out to catch at Derek’s wrist as Derek moved to back up, to hold Derek there. “I do,” he said, trying to give Derek as much wiggle room as he could. “But only if you do.”</p>\n<p>Derek must have been barely holding onto his self-control because Stiles had only just said the words when Derek was on him, pulling him up, up, up until Stiles’s back was against the pillows. “I always want you,” he was saying roughly, kissing Stiles in frantic bursts. </p>\n<p>“Shut up,” Stiles said, abruptly tired of the guilt welling up in his chest and unable to resist. “Shut up and get these stupid, ridiculous things <i>off</i>” and he yanked at Derek’s jeans. </p>\n<p>Derek wasn’t helping, was barely cooperative. He didn’t seem to want to stop touching Stiles, to stop kissing him, and Stiles almost couldn’t handle it. He finally got his knee up, got some leverage on the mattress and pushed Derek over. </p>\n<p>Derek was fighting him, protesting, but subsided when Stiles took the extra room to pull his shirt up over his head. His hands were on Stiles immediately, ghosting down over his ribs, tracing a line up his chest. </p>\n<p>Stiles couldn’t take the overwhelmed look on Derek’s face. “Your turn,” he said, and didn’t wait for Derek to listen, just stripped him. </p>\n<p>Derek let him this time, lifted his hips obligingly when Stiles got his hands back on Derek’s zipper. But once they were both naked, bare in the moonlight, Derek was rolling back over him, pinning his wrists to the mattress. Stiles arched when he lowered his head, licking over and around his nipple before sucking a red mark right under his collarbone.</p>\n<p>“Stiles,” he started, lifting his head to stare, and Stiles didn’t want to hear it, didn’t want him to finish the sentence. He was still wound-up, still riding the crest of adrenaline, and he felt like he was racing something, probably the moment when he was going to check back into Logictown.</p>\n<p>“Don’t,” Stiles said, partly to himself, and partly to Derek. “Don’t, just,” and he hesitated for a second, before pulling his wrists out of Derek’s grasp. “How about if I blow you?” he said, licking his lips. Derek tracked the movement, a muscle ticking in his jaw. “I’d like it. You could fuck my mouth, you could do anything,” he was babbling but he needed to, needed Derek <i>do</i> something, but he didn’t want to order—couldn’t order him. “Whatever you want.” </p>\n<p>“We have all night,” Derek said, hoarse. </p>\n<p>Stiles shook his head. “No, no, Derek, I need,” and he couldn’t finish the sentence, couldn't think, he just felt brittle, and only held together where Derek was touching him. </p>\n<p>“I know what you need,” Derek said, and he was moving, spreading Stiles's legs wide and shoving the sheets and blankets out of the way. Stiles couldn't take his eyes off him, couldn't look away even as Derek got his hands on Stiles's hips, curled around them tight and sucked him down. </p>\n<p>It was good that his dad wasn't home and that Mrs. Angleham, whose house bordered their backyard, had a faulty hearing aid, because Stiles <i>yelled</i>. Derek's mouth was hot and wet, and he didn't seem to need <i>oxygen</i>, just took Stiles in and sealed his lips tight around his cock. He could go deep, deeper that Stiles had ever been able to go, in his short, limited experiences, and he wasn't holding back, even a little. </p>\n<p>“Derek,” Stiles got out, gasping. “You gotta breathe.”</p>\n<p>“You didn't want it slow,” Derek pulled off to remind him. He fisted Stiles's cock, flicking his wrist over it like he wasn't wrecking Stiles. “You're gonna let me, sometime. Let me hold you down, maybe tie you up, and then I'm just going to take my time, and make you scream.”</p>\n<p>“You're already most of the way there right now,” Stiles said, huffing out a laugh and Derek's eyes darkened. </p>\n<p>“Let's see if I can get all the way there,” he said, and hiked Stiles's legs up over his shoulders, spreading him wide. Stiles yelped when a spit-slick finger touched him, pressed up behind his balls. Derek squeezed his thigh reassuringly, and worked it in, twisting and curling inside him. </p>\n<p>Stiles stared at the ceiling, wild and shaking apart, caught between wanting to shove down on Derek's finger, and squirm away, pull Derek up and away from where he felt too spread open, too exposed. But then Derek touched his tongue there, licked around his finger, and the choice was gone. Stiles keened, losing his breath and every nerve ending felt alive under his skin. </p>\n<p>Derek kept going, licking at him, getting him wet and sloppy before slowly, carefully working a second finger in and Stiles felt it, felt his body stretch to accommodate him, but it was still good, he was still so desperately in. Derek's tongue pushed in between his knuckles, like nothing Stiles had ever felt before. He was overwhelmed and overheated, and this, none of this, was what he was expecting. </p>\n<p>“Derek,” he groaned. “You have to do something, you can't just, ah,” he lost the plot for a second, as Derek spit, working his fingers in deeper. “You could fuck me,” he said, finally. \"I'd let you.\"</p>\n<p>“Do you have anything?” Derek said, and his voice was cracked, like he was affected too, and Stiles was so thrown off by that, he didn't process what Derek was saying for a minute. Then he was moving, twisting out of Derek's grip to fumble through his sock drawer, feeling desperately for the tube he kept in a gym sock. His fingers scrabbled around uselessly, and there was a panicked moment where he thought it was gone, that his dad had chucked it, that he wasn't going to get to have Derek like this. Then he felt the hard edge of the tube and yanked it, almost knocking the whole nightstand over as he did. Derek laughed, a rumbling fond noise and Stiles kicked him as he scooted back into Derek's space. </p>\n<p>Derek took the tube from him and pushed him back down, shoved him open again and put his fingers to Stiles again, this time sliding in with ease, slick and so good. “Have you ever done this?” he said, watching Stiles's face intently as he fucked him with two fingers. </p>\n<p>“I'm seventeen,” Stiles said, curling his hands into the sheets. “I've gotten myself off every way I know how.”</p>\n<p>“Has anyone else?” Derek said, and he punctuated his question with a wicked twist to his fingers. “Tell me.”</p>\n<p>“Isn't it bad manners to ask me about my sexual history?” Stiles asked, his voice reedy and unsteady. </p>\n<p>Derek gave him another finger, fitting it in beside the others. Stiles struggled to draw a breath, feeling fuller than he had even been, like he was going to bust out of his own skin. Derek’s shoulder was sweaty where his leg was hooked over it and he had to struggle to hold on, to keep it there. </p>\n<p> “Has Ryan seen you like this, Stiles?” Derek said, urgently, squeezing his thigh a shade too tight. “Has he?”</p>\n<p>Stiles managed a laugh. “How the hell do you know his name?” he said. “You big weirdo creep.” He wasn't going to answer, wasn't going to give Derek the satisfaction. </p>\n<p>Derek ignored that. “He wouldn't know what to do with you like this,” he murmured, watching where his fingers were buried deep in Stiles. “Wouldn't have any clue.”</p>\n<p>“And you do?” Stiles asked, smirking at him. </p>\n<p>“Yes,” Derek said, and slid a fourth finger in. </p>\n<p>Stiles howled, jerking against Derek's grip, mouth open and gasping helplessly. “Fuck,” he grit out. “Shit, Derek, my <i>God</i>, you total ass,” and he wanted to come, wanted this over, wanted this to never end. </p>\n<p>“I warned you,” Derek said, unrepentantly. “I told you I wanted to make you scream.” He flexed his fingers experimentally. “I bet I could make you come just like this.”</p>\n<p>Stiles was lost, was barely verbal, couldn’t answer him if his life depended on it. His whole world had narrowed to where Derek was holding him open, and he writhed on it, begging, pleading for what exactly, he didn’t know.</p>\n<p>But then he did know, because Derek bent, took Stiles’s cock back in his mouth and sucked him down, until Stiles could feel the flutter at the back of his throat. At the same time, he moved his wrist just so he brushed against Stiles’s prostate, and that was it, game over. Stiles was coming, harder than he ever had, to the point where he didn’t know if he was going to ever come down. </p>\n<p>He did eventually, opened his eyes, and found Derek over him, his wrist frantically moving over his cock, pupils blown. “Wait,” he said, croakily. “Let me do something, get up here, let me—”</p>\n<p>“Can’t,” Derek said, wrecked. “I have to—” and then he was shooting all over Stiles, striping his hip and stomach. </p>\n<p>“Gross,” Stiles said, satisfied and staring at the mess. Derek rolled his eyes, but got up, snagging the towel off the back of the door, and wiped him up, but Stiles couldn’t help but feel like he was just rubbing it in. </p>\n<p>Then Derek was manhandling him over and around until he was half draped over his chest, Derek’s hand warm and possessive on the nape of his neck. </p>\n<p>“Don’t fall asleep,” Stiles said, turning his face to scrape his teeth against Derek’s breastbone. “My dad will be home at some point, and I’m not in the mood to make up an elaborate story about my friend Pogo the runaway circus wolf.”</p>\n<p>Derek tugged on his ear. “I have no idea why I like you.” </p>\n<p>He said it with affection, clearly meant nothing by it, but it was a cold slap in the face, effectively shaking off Stiles’s afterglow. Stiles picked up his head. “You don’t know at all?” he said, aiming for casual, but his voice was unsteady.</p>\n<p>“I'm just drawn here against my will like a magnet,” Derek said, body loose and relaxed. </p>\n<p>Stiles was up and off the bed in the next second. “Get out,” he said.</p>\n<p>“Stiles,” Derek said, sitting up in alarm. </p>\n<p>“This was a mistake,” Stiles said, stomach rolling and heaving. He couldn’t puke until Derek left. He had to keep it together until then. “I need you to go.”</p>\n<p>Derek was off the bed and walking towards him. “You don’t mean it,” he said. “You’re tired, it’s been a long day. Come lay down, I won’t, we don’t have to—”</p>\n<p>“No,” Stiles said, and he was yelling. “God, no, don’t touch me, you can’t be here, you can’t—” and he covered his mouth to hide the gasp of a panic attack lurking right around the corner.</p>\n<p>“Goddamnit Stiles,” Derek snapped, his claws reflexively shrinking and sharpening, over and over. “When are you going to stop fucking with my head?”</p>\n<p>“Now,” Stiles said, and his voice was shaking. “Right now. Get out and don’t come back.”</p>\n<p>“No,” Derek said, and as suddenly as he lost it, he was in control again. “I’ll be back in the morning to take you to Deaton’s.” His voice was even, but Stiles could hear the underlying threat of what would happen if Stiles didn’t cooperate in the morning.</p>\n<p>“I'll call Scott,” Stiles said. “Just go.” </p>\n<p>Derek left, slamming the window behind him. Stiles stayed awake all night, sitting guard over his own treacherous, monstrous mind. </p>\n<p>*</p>\n<p>Stiles didn’t want Scott in his bedroom, locked the window and waited for him outside on the steps. Scott could be oblivious, mostly, but at the worst times he often sharpened, and Stiles couldn’t think of anything worse than the disappointment in Scott’s eyes when he realized what Stiles had done. </p>\n<p>He shivered, even though it wasn’t cold, and waited, watching for Scott, tucked up as small as he could make himself. </p>\n<p>When Scott got there, he leapt off his bike, and was hurtling towards Stiles, pulling him in as close and tight as he could. Stiles exhaled and held on, taking the reassurance that he probably didn’t deserve, but couldn’t resist. </p>\n<p>Scott finally let him go, and his face was bright and happy. “We survived again,” he said.</p>\n<p>“Yeah,” Stiles said, mustering up a smile. “Thanks for watching my dad’s back.”</p>\n<p>“Always,” Scott said, and snagged the Jeep’s keys from Stiles. “Come on, let’s get you to Deaton.” </p>\n<p>He was glad Deaton took him into the operating room, instead of his office. It had only been about three weeks since the last time Stiles had been at the clinic with Derek for one of their Saturdays, cracking jokes and kicking each other. It seemed about as far away from him now as anything could be. Stiles didn’t feel like laughing, and if anyone kicked him now, he’d probably shatter into deeply pathetic pieces. </p>\n<p>Deaton examined the cut. “The dagger was enchanted,” he said. “It’s not deep, and I have salves, though it’s not going to feel especially good.”</p>\n<p>“Yippee,” Stiles said and hopped up on the exam table.</p>\n<p>There wasn’t any movement, but Stiles was suddenly, completely sure Derek was there. He didn’t know how, but he knew. A moment later, Scott stiffened, and Stiles knew he was right. </p>\n<p>“Mr. Hale,” Deaton said pleasantly, uncapping a weird-looking bottle. </p>\n<p>“Why are <i>you</i> here?” Scott said rudely. </p>\n<p>“I wanted to make sure Stiles got here,” Derek said, and when Stiles looked up, he wasn’t looking at Scott, his eyes were trained right on him. Stiles flinched, and Derek’s face hardened, and they both looked away. </p>\n<p>Scott looked at both of them, eyebrows drawing together in concern. “Well,” he said. “He did.” His phone dinged, and he looked down. </p>\n<p>“Allison?” Stiles asked. </p>\n<p>“My mom,” Scott said. He looked at Stiles. “You okay if I leave you with him?” he said, eyes flicking towards Derek. </p>\n<p>Stiles wasn’t okay with Derek there, but not because <i>Stiles</i> was in any danger. “Yeah,” he said. “Go. Toss me my keys.”</p>\n<p>Scott slid them across the table beside him, and left, shutting the door quietly behind him.</p>\n<p>“Ready?” Deaton said, drawing his attention back to the problem at hand. Stiles nodded, and held his breath as Deaton applied the salve. </p>\n<p>Not feeling especially good was the understatement of the year. His skin tingled and itched so much it felt like he wanted to claw it off his body. He started to squirm but Deaton fixed him with a look, so he held still, biting deep into his lip. </p>\n<p>“Talk,” Derek said finally, edging closer to him, arms folded across his chest. </p>\n<p>Stiles snorted, trying desperately to sound normal, amused. “First time you’ve said <i>that</i>,” he cracked.</p>\n<p>Derek didn’t so much as blink. “It’ll distract you,” he said. </p>\n<p>Stiles huffed. “I don’t think anything will distract me.” Derek stepped even closer, as if to offer comfort, but Stiles shied back, earning himself a glare from Deaton. </p>\n<p>Derek’s face reflected the briefest moment of hurt for a moment before he gained control again. “Sorry,” he said, gritting his teeth. </p>\n<p>“No problem,” Stiles said, knocked unsteady once again by the boatloads of guilt he was just barely keeping at bay. </p>\n<p>Deaton finished tying off the bandage, and then released Stiles’s hand. “Keep it dry and covered until tomorrow,” he advised. Turning his attention to Derek, he surveyed him carefully. “Are you hurt?”</p>\n<p>Derek startled. “No,” he said. “I would have healed anyway.”</p>\n<p>“Mmm,” Deaton said, and Stiles couldn’t tell if he was agreeing or disagreeing. “I’ve long been curious about that jacket of yours,” he said, unexpectedly. “May I see it for a moment?”</p>\n<p>Derek shrugged it off without a word, handing it to Deaton. It was the old one, the one Stiles had mended for him. Deaton examined it, and Stiles watched as he sought out the stitching where Stiles had sown it back together. “I see. Just as I suspected,” Deaton said, giving it back to Derek. “Someone cast a very powerful protection charm on it.”</p>\n<p>“I bought it new in town last year,” Derek said, bewildered.</p>\n<p>“I’d be very surprised by that. See, it’s woven in right here,” Deaton said, touching Stiles’s work. “That kind of work, a charm that can last for a long time like that, it feeds off intense emotion. It can’t be done without a great deal of love.”</p>\n<p>Stiles stopped breathing. Derek went tense and stiff immediately, eyes snapping to Stiles. “You mean—” he started, but Stiles was already hopping down and making for the door.</p>\n<p>“Don’t you dare,” Derek snarled, hooking Stiles by the hood and dragging him back. Stiles fought to wiggle free, thinking desperately, <i>Nope, can’t do this, I can’t, I need to hide, I need him to let me <b>go</b></i> and the hoodie he was wearing was warm suddenly, burning against his skin. Derek let go with a yelp, and Stiles flung himself away, crowding against the edge of the wall. He was breathing heavily, the air feeling like it wasn’t quite making it to his lungs. </p>\n<p>“Stiles, get back here,” Derek roared, and he was reaching blindly through the air, but he wasn’t even close to where Stiles was, and after a minute, Derek was out the door, still calling for him. </p>\n<p>“Perhaps you want to come take a seat over here with me,” Deaton said gently, as if whatever Stiles chose to do was of no consequence to him. </p>\n<p>“I’m sorry,” Stiles said wretchedly, face twisting up. He was possibly going to cry. “I didn’t mean to.”</p>\n<p>“I know you didn’t,” Deaton said, and he patted the chair again. Stiles trudged over, and flopped gracelessly into it. </p>\n<p>“I tried to control it,” he said, guilty and awful. “I tried to stop, I didn’t mean to make him feel—but he was always around and I couldn’t stop.”</p>\n<p>Deaton paused. “When you say ‘made him feel’,” he said delicately. “You mean—”</p>\n<p>This was the moment. He just had to say it, even if Deaton called whatever the magical police were on him. He deserved it. “I made him want me,” he said, and swallowed past the lump in his throat. “I made him want me like I can make everything else happen. I’m no better than that guy he killed last night, I made <i>Derek</i> like that, like a golem. It isn’t real, whatever he thinks it is. None of it is real.”</p>\n<p>There was a moment of shocked silence, and Stiles could feel his eyes blurring with tears. </p>\n<p>Deaton’s hand closed, gentle and warm, on Stiles’s shoulder. Stiles’s head snapped up in disbelief. “I don’t think you understand,” Stiles said, strangled. </p>\n<p>“No,” Deaton said gently. “I don’t think <i>you</i> understand. Your magic cannot alter free will.”</p>\n<p>Stiles felt his heart stop. “No, that’s not right,” he whispered. </p>\n<p>“I promise you it is,” Deaton said. “If anyone has done wrong here, it’s me. I continue to underestimate you and what you can do, Mr. Stilinski, and you should have known something like that from the beginning. Perhaps I should be be apologizing to you. But in any case, you could no more force Derek to feel something than he could force you.” </p>\n<p>“But that means,” Stiles said and trailed off, and his eyes fell on the jacket again, thrown haphazardly over the exam table.</p>\n<p>“Yes,” Deaton said, and patted him twice. “I’m going to make us some coffee. This amount of teenage melodrama is exhausting.”</p>\n<p>*</p>\n<p>Eventually, he had left the clinic, had gotten back in the Jeep and had driven off, headed nowhere and barely seeing the road. </p>\n<p>He ended up at the lacrosse field, sitting on the deserted bench, looking out over the empty field. A year and a half ago, this was his biggest concern. A year and a half ago, this was all he had to look forward to. </p>\n<p>His phone rang, and Stiles didn’t have to look to know it was Scott’s eerie sense of Stilesradar. </p>\n<p>“Hey,” he said. “I had sex with Derek last night.”</p>\n<p>There was a moment of dead silence and then Scott was fake-retching in his ear. Stiles grinned and waited him out. </p>\n<p>“That’s the grossest thing I’ve ever heard,” he said after a minute. “Him? Really?”</p>\n<p>“Him,” Stiles agreed. “Really.” </p>\n<p>Scott made a pained noise. “But he’s <i>Derek.</i> He’s the <i>worst</i>. Remember we even made that list once?”</p>\n<p>“Yeah,” Stiles said. He might still have it in a notebook somewhere. “I think I’m prepared to move Richard Simmons higher up.” </p>\n<p>“Maybe you’re broken,” Scott said. “Maybe you’re possessed.” </p>\n<p>“Scott,” Stiles interrupted. “I think he’s my Allison.” He overrode Scott’s howls of outrage. “It’s just, he’s pretty funny. Actually funny, like, dude’s got jokes. And he does care about stuff, and helping people. He was just bad at it for awhile.”</p>\n<p>“No kidding,” Scott said, still sounding miffed. </p>\n<p>“And he likes me,” Stiles said, quietly. It was the first time he’d said it out loud, without the familiar punch of guilt to his chest. </p>\n<p> “Duh,” Scott said, as if everyone would. “So why have you been <i>moping?</i>”</p>\n<p>Stiles took a deep breath and told him. It was easier this time, than at Deaton’s, and Scott listened quietly until the last part, the greatest part, the “I didn’t actually do anything part.”</p>\n<p>“You should have told me,” Scott said, when he was done. “You don’t always have to be so alone.”</p>\n<p>“I wanted to,” Stiles said. “I’m working on it.” </p>\n<p>When he hung up, he felt lighter, freer for having confessed. Even in his darkest moments, he hadn’t really believed Scott would hate him, couldn’t see Scott giving up on him, but it made him feel brighter and stronger for having that confirmed. </p>\n<p>There was only one more person left to talk to, and he sat there for another hour, trying desperately to work up the courage for that conversation. </p>\n<p>He had only just made the decision to seek Derek out, to track him down, when the little tingle in his chest let him know that the decision was out of his hands. Derek had found him, and moments later, slid onto the bench next to him. </p>\n<p>“Hi,” Stiles said, heartbeat kicking up.</p>\n<p>“Been looking for you,” Derek returned evenly. “You were a little hard to track down.”</p>\n<p>Stiles cringed. “Sorry,” he said. “I just needed time.”</p>\n<p>“I eventually went back to the clinic,” Derek said, “when I couldn’t track you down. You weren’t there, so I checked your house, and you weren’t there either, so I figured I’d go threaten Scott. But he was on the phone.”</p>\n<p>Stiles’s heart leapt into his chest. “I’ve been trying to teach him to be more aware of his surroundings,” he said.</p>\n<p>“That’s the thing,” Derek said. “He knew I was there. You know how I know? Because after he hung up, he leaned out of the window and said ‘he’s at the lacrosse field, asshole,’ and then listed the body parts he’d cut off if I hurt you.” </p>\n<p>“That’s my Scott,” Stiles said, fighting the urge to panic. “So you heard all of it then? What I thought I did?”</p>\n<p>Derek scoffed. “That you thought you were mind-controlling me and that’s why you kept shoving me away? Yeah, I heard.”</p>\n<p>“Don’t sound too concerned for your mental autonomy or anything,” Stiles said, kicking his feet hard against the dirt.</p>\n<p>“I’m not,” Derek said, but didn’t elaborate. </p>\n<p>Stiles pressed him, in disbelief. “You’re not at all worried about the idea that you could have been acting on feelings I forced you to have for me?”</p>\n<p>Derek shrugged. </p>\n<p>Stiles pressed the heels of his palms into his eyes. “So in summary, today I found out after literally <i>weeks</i> of torturing myself, that I <i>haven’t</i> been making someone I want want me back against his will, essentially making him a slave of my whims, but if I <i>had</i>, he’d totally be okay with it.”</p>\n<p>“Out of the two of us, only one of us is qualified to make the big decisions and it ain’t me,” Derek quoted, and Stiles flushed at the memory. </p>\n<p>“You’re taking that out of context,” he said. </p>\n<p>“Doesn’t make it less true,” Derek said.</p>\n<p>Stiles couldn’t stifle his laugh. “You’re insane. I’m dating a crazy person.” Derek sucked in a breath and only then Stiles heard what he had said. “I’m sorry,” he said right away. “You don’t have to still—I thought now—”</p>\n<p>“I could have told you that you hadn’t forced me into anything,” Derek said, cutting him off. “It wasn’t just <i>want</i>. I’m pretty head over heels for you and I wouldn’t have—I think I’d know now if it wasn’t right.” Derek swallowed convulsively, looking away for a second. “But there’s still good reasons not to date me. You picked a stupid fake one, but there are real ones that are good enough. I thought of all of them last night after you threw me —after.” Stiles winced, and Derek shook his head. “You can still say no,” he said seriously. “Just because what I feel is real doesn’t mean you have to say yes.”</p>\n<p>“Yeah,” Stiles said, breathless and overcome. “It kind of does.” It occurred to him then that it had been Derek every time, closing the distance between them, initiating everything. He changed that then, turning and sliding a thigh over Derek’s thighs until he was straddling Derek’s lap. Derek spread his legs to better support Stiles, but when Stiles leaned in to kiss him, he stopped him, one hand in the center of his chest. </p>\n<p>“I’m not kidding, Stiles,” he said. “Birdhouse this. You have to think about it so you’re sure. I can’t—I can’t keep doing this, thinking I’m getting somewhere, that you feel the same and then having you change your mind, having you take it all back again. I want you, but you can’t keep,” and he trailed off, frustrated.</p>\n<p>Stiles was going to have to be earnest. Fuck, he hated that. “I thought I was making you,” he said, slow and steady. “And I know you think that was dumb, but I don’t think you understand what it means. It means I thought about you. A lot. I pictured what you would say, what you would do, how you would touch me if I ever got up the nerve. I touched myself thinking about you, constantly,” and Derek squirmed underneath him. Stiles inhaled at the contact, but kept going. “I looked at you, and I <i>wanted</i> you, so much that the wanting had passed out of my brain and into yours. Do you get that? Do you understand now?” </p>\n<p> Derek looked up at him, his eyes dark and pupils blown. “I’m saying <i>yes</i>,” Stiles said, cupping his jaw lightly, pressing until Derek’s head tilted up. Derek let him, eyes fixed intently on Stiles. Stiles met his gaze straight on, and repeated himself one last time. “Yes.”</p>"
}