{
  "id": "7053640",
  "url": "https://archiveofourown.org/works/7053640?view_full_work=true",
  "author": [
    "determamfidd"
  ],
  "title": "Hearts Will As Hearts Must",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "The Hobbit - All Media Types",
    "The Lord of the Rings - All Media Types"
  ],
  "relationships": [
    "Gimli (Son of Glóin)/Legolas Greenleaf",
    "Bilbo Baggins/Thorin Oakenshield",
    "Kíli (Tolkien)/Tauriel (Hobbit Movies)"
  ],
  "characters": [
    "Gimli (Son of Glóin)",
    "Legolas Greenleaf",
    "Bilbo Baggins",
    "Thorin Oakenshield",
    "Fíli (Tolkien)",
    "Kíli (Tolkien)",
    "Dís (Tolkien)",
    "Glóin (Tolkien)",
    "Glóin's Wife",
    "Thranduil (Tolkien)",
    "Tauriel (Hobbit Movies)",
    "Galion (Tolkien)",
    "Dwalin (Tolkien)",
    "mentions of other characters"
  ],
  "additional_tags": [
    "dain is a canny knowing old coot",
    "Bilbo Is A Boss",
    "Thrandy being a good if distant dad",
    "in which i take the quote 'Dwarf of Many Journeys' and go a bit bonkers",
    "Legolas is not perfect and has A Lot of Feelings",
    "Gimli is a young hothead and has ALL the feelings",
    "Alternate Universe - Everyone Lives/Nobody Dies"
  ],
  "language": "English",
  "series": "",
  "published": "2016-06-01",
  "completed": null,
  "words": "10,469",
  "chapters": "1/1",
  "comments": "335",
  "kudos": "9,401",
  "bookmarks": "2,182",
  "hits": "79,806",
  "summary": "<p>The Dwarves are returning to Erebor reclaimed, and the elves uphold their promise to safeguard the caravans as they pass through Mirkwood.</p>\n<p>One particular Dwarf has wit and spark enough to match Legolas Greenleaf - perhaps even outmatch him.</p>\n<p>It's hate at first sight.</p>",
  "notes": "<p>\n<strong>Prompt by Setari:</strong>\n</p>\n<p>AU where Gimli and Legolas first meet when Gimli and his mother travel to join Glóin at Erebor after it's reclaimed, and Legolas's squad is escourting them through Mirkwood. They immediately wind up arguing loudly and continue to do so the whole time, about everything under the sun. No one is at all surprised they hate each other.</p>\n<p>When Gimli reaches the mountain, something Legolas said is still bothering him, so he writes to him to continue their argument because he just can't not. What ensues is an increasingly fond, and then downright sappy series of letters, while everyone around them thinks they're still at each other's throats.</p>\n<p>+Bonus points if it all comes out at Gimli's seventieth birthday because he invited Legolas and they're absolutely terrible at keeping their affection hidden in person.<br>+Double bonus points if it's also an Everyone-Lives!AU.<br>+Triple bonus points if there's one single person who figured out what was going on pretty early on, and is sitting back laughing at everybody.<br>...+A cookie if that person is Dáin.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p><i>Sindarin</i><br>Ionneg - My son</p>\n<p> <i>Thank you so *so* much for reading - I hope you enjoyed it!!</i></p>",
  "text": "<p> </p>\n<p> </p>\n<p>“Quiet!”</p>\n<p>“I <em>am </em>being quiet! This is as quiet as we get!”</p>\n<p>“And yet you <em>still</em> speak, and you crash through the trees as though you were a herd of Oliphaunts! Do you mean to run into every single one?” Legolas growled, and he rubbed at his forehead. There was a tension headache building just behind his eyes. Why had he offered to scout ahead again?</p>\n<p>Oh yes, that was it. He had wanted some respite from the crashing, noisy, foul-mouthed and foul-natured Dwarves. They moved in slow, stately procession through the Greenwood now, returning to the seat of their old Kingdom. Elves had been set to guide and guard every wagon and train, to ensure their safety and protect their own lands.</p>\n<p>But his moment of peace was not to be: not to be outdone, the very worst of the lot had offered to join him. ‘Lightest, swiftest and youngest,’ he remembered the Dwarf saying, his peach-fuzz jaw out-thrust.</p>\n<p>The others had glanced warily up at their escort. None were outright hostile, but neither were they friendly. Cautious, that was the word. The older Dwarves were cautious; guarded and closed. They gave nothing away in word, expression or deed. Yet it was clear that they did not trust Legolas to leave them.</p>\n<p>Finally, the leader (a strong-shouldered Dwarf with blue eyes and dark hair and beard), had nodded. “Mind your path,” was all she said.</p>\n<p>Legolas had not cared for his tiny tag-along. He was noisy, and grumbling, and despite his claims he was neither light, nor swift. Young he surely was, by the look of the fluff upon his chin. Resentful and irritable, Legolas had not spared the Dwarf from the sharp side of his tongue, nor from the hardest paths he could take through the clinging forest.</p>\n<p>Yet the little one was not daunted by either his tone or his expression. He puffed his chest out in indignation, and his dark eyes flashed. “You needn’t stay and guard me, if my company irks you so.”</p>\n<p>“You would be lost in seconds,” Legolas said immediately.</p>\n<p>“So I must put up with your insulting words and insulting stares, and it is for my own good, you mean to say.” The Dwarf snorted loudly and derisively. “It would suit me better to be rid of you. I can see the paths ahead just as well as you.”</p>\n<p>That, Legolas doubted.</p>\n<p>“I am charged with your safety.” And Legolas cursed the fortune that had placed him upon guard-duty for this particular caravan - and not for the first time.</p>\n<p>“Yes, so you’ve said, every single time.” The Dwarf pushed past a liana, his violently-bright hair sliding into his eyes. His steps crushed the leaf-litter, crackling noisily, a dead giveaway to the dangerous creatures of the forest. And his breathing was clearly audible from yards away! “We know you do this under duress, you needn’t remind us.”</p>\n<p>Legolas was so shocked at this, he stopped short. Then he ran on light feet to catch up with the small Dwarf, his curiosity rising. “And what mean you by that?”</p>\n<p>The Dwarf did not look back at him. “Only what I say, your most lofty Highness. That you do not wish to be here with us, any more than I wish to be here with you. It would have been kinder not to say.”</p>\n<p>“You said it,” said Legolas, taken-aback by both the Dwarf’s bluntness and by his accuracy.</p>\n<p>The Dwarf looked at him then, and grim amusement was in the dark eyes. “Ah, well. I can claim no more than sixty-three summers under my belt, and am young and foolish. What’s your excuse?”</p>\n<p>Legolas opened his mouth, but had not the words to answer that.</p>\n<p>Then the Dwarf swore loudly, and unlimbered the axe he wore at his belt. Legolas flinched and reached for his bow, but the axe flew wide over his shoulder and struck something with a heavy, wet <em>thud.</em></p>\n<p>Turning, he saw the body of a spider toppling from its line onto the forest floor, its legs curling up around the bulbous belly.</p>\n<p>“These things! My father has spoken of them,” the Dwarf grunted, and he stomped forward with his dreadful noisy feet to yank his axe out of the thing and wipe it against the bristling hide. “And where one creeps, more are sure to follow.”</p>\n<p>“They make colonies amidst the trees,” Legolas said, still staring at the spider. How had the Dwarf even seen it? They had dull eyes and were inattentive creatures at best. How had he known? “This may have been doing even as we do: scouting.”</p>\n<p>“Then we had best move on before the others wonder where it has got to,” the small Dwarf said, tucking his axe back into his belt and hitching it up on both hands. Then he noticed the look upon Legolas’ face, and grinned broadly.</p>\n<p>It was the first open expression he had seen on the Dwarf’s face, and it transformed him completely. Gone was the bristling sour mistrust, and only clear mirth shone back at him.</p>\n<p>“Wondering how I saw it, eh?” the Dwarf said, still with that bright wide smile on his face. It was a pleasant smile, Legolas thought – before stifling it. “We have a saying, amongst our people. “Dark mines make for open eyes”. We’re not much for wide spaces and long distances and bright sunshine, that’s true enough. You want an Elf for that. But for seeing in the dark? Choose a Dwarf.”</p>\n<p>“I thank you,” said Legolas stiffly.</p>\n<p>The young Dwarf shrugged, before stumping back the way they came. “Come along, your noble Twigness. Your unpleasant duty still awaits you.”</p>\n<p>“I have enough of it here,” Legolas muttered, but sprang after the Dwarf nevertheless.</p>\n<p>…</p>\n<p>“It is <em>Mirkwood!</em> See, it even says so on our maps!”</p>\n<p>“<em>Dwarf</em>-maps, what would they know! Why not ask one who lives here, Master Mole? This is Greenwood the Great, and has been since before the lighting of the stars!”</p>\n<p>“Oh, and so much of it is green? Look at the bloody place, this is murkier than the bottom of a bog!”</p>\n<p>“Something I am sure you are well-acquainted with, smelling as you do!”</p>\n<p>…</p>\n<p>“Elves, obviously. All the great works of every age have been made by them. They are clearly the superior craftspeople.”</p>\n<p>“Why you, you <em>dirty - </em> you say such lies even when history is filled with instances of your folk gouging and robbing mine for the works of our hands! What of the Dragon-helm, what of Menegroth, what of Angrist, what of-”</p>\n<p>“I say only the truth. T’was an Elf made the silmarils-”</p>\n<p>“Oh yes, and so much joy came of them! Such an achievement, and so maturely handled!”</p>\n<p>“I have one word in answer to that, Master Mole! <em>Nauglamir.”</em></p>\n<p>“Or so your folk name it. Do you think we would name it such? <em>Treasure of the stunted ones: </em>how kind and gracious the fair folk can be!”</p>\n<p>…</p>\n<p>“An axe, naturally. Bows are all very good for those without the skill and courage to fight their foes face-to-face, but the axe is a far superior weapon.”</p>\n<p>“If you ambulatory shrubs were capable of even drawing the bow-”</p>\n<p>“Oh, we use them, and far stronger ones than you could bend, Twig-Princeling. Just saying what all know to be so. The axe is a better weapon.”</p>\n<p>“And yet I have slain more spiders than you have hairs upon your chin <em>with my inferior bow,</em> Master Mole. Though that is not doing my count justice, considering that pitiful beard…”</p>\n<p>“How DARE-”</p>\n<p>…</p>\n<p>Legolas deposited his unwelcome burden at the Gates of Erebor, and was escorted to the Throne Room where he was to be received. The curse of his father’s crown: even when he would rather slip back into his trees, he must pay the proper courtesies.</p>\n<p>He bowed stiffly to the King, Prince Consort and attendant Lords. “My duty is discharged, Majesty,” he said.</p>\n<p>“So I see,” the Hobbit replied, and thrust his thumbs into his belt. He rocked back upon his heels in thought as he squinted up at Legolas. “You seem a little… harried. I’ve worn that face a time or two, when expecting relatives over for tea. Was it an eventful journey?”</p>\n<p>Legolas did not allow so much as a muscle of his face to twitch. His father would <em>disown </em>him for showing weakness before the rulers of Erebor. “There were no major conflicts.”</p>\n<p>\n<em>Unless you count my near-hourly battles with young Master Mole.</em>\n</p>\n<p>“But plenty of skirmishes,” said the Leader of the caravan-train, entering without fanfare and with her pack still on her back, “and not with the spiders either.”</p>\n<p>“Sister!” The King flew from the throne to embrace her, and there was indeed a resemblance Legolas realised. The King smiled down at her, and she pushed good-naturedly at him with a laugh. A comfortable, sibling-like interaction.</p>\n<p>“Dis! Back safe!” cried the lord Dain, and he slapped the Dwarf’s back. “So cousin, from that statement I’m guessing that you haven’t been your normal serene self, eh? A few tempers flaring, that sort of thing?”</p>\n<p>Dis huffed in fond amusement. “I needn’t lose my temper at all, not when our youngest kinsman is around to do so for all of us combined, cousin. His puts mine to shame any day of the week. They <em>despised </em>each other.”</p>\n<p>Kinsman – to the Princess Dis, sister of King Thorin? Master <em>Mole?</em></p>\n<p>Oh curses. Legolas winced internally. Naturally, his grumbling little opponent had to be someone of consequence, thus risking a diplomatic incident. <em>Naturally.</em></p>\n<p>The King was watching Legolas now with a measuring look in his blue eyes. “I had hoped for peace between the Mountain and the Wood,” he said. “And he’s but a child still.”</p>\n<p>Dis rolled her eyes. “Oh, he got as good as he gave, don’t you fret none, Thorin. Theirs was the only real contention, and it mostly consisted of finding more and more inventive ways to give each other insult. There have been some truly beard-curling ones, too! They never came to blows, thank Mahal, and the only wounds were tender feelings. The rest of the Elves were all right: stuffy and snobbish, to be sure, but all right.”</p>\n<p>Stuffy!?<em> Snobbish!?</em></p>\n<p>Legolas was beginning to see that Master Mole was most definitely related to the Lady Dis.</p>\n<p>“It eases my heart to hear that,” said the King. He didn’t look eased; he looked highly satisfied that the elven Prince had been so thoroughly insulted.</p>\n<p>“And my nerves,” Bilbo added. “I don’t want to have to broker another peace like the one between you and Thranduil again. I nearly had to nail both your feet to the floor.”</p>\n<p>“Aye, and I had to guard the damn door. Not to keep you from interruption, but to stop you both from leaving in dramatic high dudgeon,” Dain grinned. Thorin glowered at his cousin with mock-annoyance. “Isn’t it nice that we all get along, eh?”</p>\n<p>“I shall box his ears, when I find him,” Thorin muttered, and Dis laughed.</p>\n<p>“Aye: right before you gift him with a fine new set of armour, or some such?”</p>\n<p>“I apologise for our young kinsman’s rudeness,” said Thorin, pulling himself straighter and turning away from his merrily chuckling cousin and sister. “I hope this can be marked down to his youth and inexperience. He is young and brash, not yet of age. No doubt time will bring him wisdom. I assure you, his words do not represent Erebor. We remain Thranduil’s ally and friend.”</p>\n<p>At the end of this (rather gritted) little speech, Bilbo patted his husband’s hand as though to say ‘there! Well done, dear!’</p>\n<p>Thorin’s face melted at once, and both Dis and Dain were repressing smiles.</p>\n<p>The words ‘stuffy and snobbish’ were still ringing in Legolas’ ears. He bowed to cover his confusion, and as he straightened he caught sight of his Master Mole, tucked into one of the deep shadows of the Throne Room. Then he smiled faintly.</p>\n<p>“I thank you for the apology, King Thorin, but it is no matter to concern you,” he said, allowing his voice to ring through the room. “Such pitiful arguments could not have swayed nor daunted me, and the ill-mannered temper of a beardless stripling is as the wailing of the wind.”</p>\n<p>He heard the low, shocked gasp in the shadows, and inwardly he smiled to himself. <em>And that is another to my count.</em></p>\n<p>“I will say, however,” he said, pretending thoughtfulness and allowing his voice to slow, “that it is long centuries since any have argued with me for so long and with such a passion, to such a sorry result.”</p>\n<p>And with his head held triumphant, Legolas turned from the Throne Room and left Erebor and Master Mole behind him.</p>\n<p>(Dain watched him go with his old, knowing eyes, and a faint suspicion dawned.</p>\n<p>No. No, surely not.</p>\n<p>Foolish notion.)</p>\n<p>…</p>\n<p>\n<em>Most High and Poncy Prince Twig,</em>\n</p>\n<p>\n<em>Nice try, you ASS. You know, that was a very good show of not giving a damn. But your ears heat when you are embarrassed or angry. They were brightest red, redder than my hair even. </em>\n</p>\n<p>\n<em>Caught you in your lie, that is one point to me.</em>\n</p>\n<p>\n<em>Signed,</em>\n</p>\n<p>\n<em>Gimli son of Gloin</em>\n</p>\n<p>…</p>\n<p>Legolas held the letter in clenched fingers. The writing was thick and blocky and somewhat unpractised: shaky and ill-formed, as though the author were far more used to writing in a different script than the curling loops of the tengwar.</p>\n<p>“Legolas, what are you scowling for?” asked Tauriel, glancing at him with concern in her eyes. “Are you well? Your ears are red.”</p>\n<p>Legolas growled and tore the letter in two in a sudden fit of annoyance. The halves fluttered to the ground behind him as he stalked away.</p>\n<p>Tauriel picked them up and scanned the contents.</p>\n<p>And began to laugh.</p>\n<p>…</p>\n<p>\n<em>Master Mole,</em>\n</p>\n<p>\n<em>Your information is incorrect. But no doubt you must be used to that. It must be wearisome to be so constantly wrong about the world. I would think it burdensome to know so little, but perhaps in your ignorance you find comfort. After all, you know no better.</em>\n</p>\n<p>\n<em>Also, my ears are no business of yours. </em>\n</p>\n<p>\n<em>Ever.</em>\n</p>\n<p>\n<em>Legolas Greenleaf</em>\n</p>\n<p>…</p>\n<p>Gimli read through the letter, and was roaring with laughter by the end. Kili nearly dropped his fork. “Gim, what in Mahal’s name…?”</p>\n<p>Gasping, speechless and weak with laughter, Gimli waved the letter in the air and let Kili snatch it from him. Then he subsided back in his chair, still giggling. “Oh, I got him, I got him all right,” he said between his wheezing.</p>\n<p>Kili’s eyebrows rose slowly as he read through the letter, and they were nearly crowding his hairline by the end. “Legolas Greenleaf? As in the Prince of Mirkwood Legolas Greenleaf?”</p>\n<p>“Aye, that’s the one. But it’s the Greenwood, if you ask him. Don’t call it Mirkwood, mind.” Gimli wiped at his eyes and slapped his knees. His grin was blinding. “He hasn’t a rejoinder, and all he can do is fume. Another point to me.”</p>\n<p>“That is a very rude letter,” Kili said, handing it back. “If uncle finds out-”</p>\n<p>“Pfft, what can it do? Everyone knows that our hatred for each other is personal and not political,” Gimli scoffed. “We’re not going to say anything to destabilise the peace. What do you take me for?”</p>\n<p>“A beardless little idiot,” Kili said promptly, and was immediately kicked in the shin beneath the table by Gimli’s steel-capped boot.</p>\n<p>“And what does that make <em>you</em>, with half as much beard and twice as much idiot?”</p>\n<p>Kili pulled a face at him, before nodding to the letter. “Don’t get carried away or do anything thick, eh?”</p>\n<p>“Sorry, <em>you’re </em>warning me… right, who are you and where is Prince Kili.”</p>\n<p>“You’re hilarious.” Kili turned back to his own mail, and brightened when he saw the star-embossed green envelope. “Ah!”</p>\n<p>“And you tell <em>me</em> not to get carried away,” Gimli said, shaking his head.</p>\n<p>…</p>\n<p>\n<em>Prince Jackass,</em>\n</p>\n<p>\n<em>Ah, a brave try! But your clumsy attempts at deflecting me have only highlighted the omission. I have seen more of the world than you, young though I am. And so that insult has fallen flat – rather like your singing voice.</em>\n</p>\n<p>\n<em>Your ears were burning, burning red. I’ve seen rubies with less fire. I shall cherish the memory always. </em>\n</p>\n<p>\n<em>I know you will never, ever, <u>ever</u> forget it.</em>\n</p>\n<p>\n<em>Sincerely,</em>\n</p>\n<p>\n<em>Gimli son of Gloin</em>\n</p>\n<p>…</p>\n<p>Thranduil was slightly concerned about his son’s behaviour. He tore at his hair and paced angrily, muttering all the while. Every so often he would peer at himself in the mirror, and one forefinger would come to rest upon the delicate point of his ear – an ear that was flushed cherry-red with fury.</p>\n<p>Then Legolas would spin away from his reflection in redoubled agitation, growling beneath his breath. He would go out and shoot at spiders for a few hours, only to catch sight of his reading-desk or mirror (what was so obnoxious about a reading-desk, for Elbereth’s sake?) and descend into thunderous simmering once more.</p>\n<p>He had enquired of Tauriel, discreetly, but his Captain had only smiled at him, unruffled and a little mischievous. She had reassured him that Legolas’ disquiet was nothing to raise alarm.</p>\n<p>“A dispute with a friend,” she said, her cheeks dimpling.</p>\n<p>“A friend? What about?” Thranduil had never seen his son this discomfited.</p>\n<p>“Oh, whether or not they can be friends,” Tauriel said, and with that cryptic statement and a flash of scarlet hair, she was gone into the woods.</p>\n<p>…</p>\n<p>\n<em>Hairy Earthworm,</em>\n</p>\n<p>\n<em>My singing voice is the envy of all Greenwood, and if certain Dwarves had ears of any discernment they would not say such pathetically embarrassing things. </em>\n</p>\n<p>\n<em>Still, with the ears you DO have, perhaps it is no surprise. You seem to love to speak of mine, but yours could double as one of the shovels you so love. Do they flap insects away in hot weather?</em>\n</p>\n<p>\n<em>You have seen more of the world, perhaps. You have made journeys then? Yet I have lived in this Middle-Earth for over two millennia. Your ridiculous posturing seems to me to be akin to that of the red squirrel, who chatters incessantly and says nothing of consequence.</em>\n</p>\n<p>\n<em>Have you even a beard yet?</em>\n</p>\n<p>\n<em>In some disgust,</em>\n</p>\n<p>\n<em>Legolas Greenleaf</em>\n</p>\n<p>…</p>\n<p>There was much stamping and grumbling and thudding going on next door.</p>\n<p>Gimli was in a foul temper this evening, thought Gloin, as he pushed a game-piece forward. Dain was his opponent, and the Lord of the Iron Hills was studying the board intently even as a crash came from the next room.</p>\n<p>“What in Mahal’s blessed name-” Gloin burst out, but Dain held up a hand at once.</p>\n<p>“Your boy’s getting a good education right now, don’t you go in an’ spoil it,” he said without looking away from the board. “He’s learning that one or two early victories do not win a war. Aha.” And he moved a piece.</p>\n<p>Gloin scratched at the scar over his eyebrow. “But I really ought to go and-”</p>\n<p>“Let him deal with his own bout of petulance, and clean up his own mess,” Dain said, and he leaned back in his chair. “Do him good.”</p>\n<p>“I should go find out what is bothering the lad, though.”</p>\n<p>Dain laughed lightly. “Ah, you’re a good father, cousin. Let him tell you if he wishes, but don’t go a-prying. That’s what I found helped the most, when my own lad was in his sixties.”</p>\n<p>Good advice, Gloin supposed, but he glanced back at the door anyway.</p>\n<p>“If it helps, I’ll keep an eye on him,” Dain offered. “He’s got a sensible head on his shoulders, when he doesn’t lose it due to that hair-trigger of his.”</p>\n<p>“But what could have upset him so?”</p>\n<p>Dain grinned. “I suspect the post just arrived.”</p>\n<p>…</p>\n<p>\n<em>Prince Haughty Cur,</em>\n</p>\n<p>\n<em>I’ve more beard than you. </em>\n</p>\n<p>\n<em>Gimli son of Gloin</em>\n</p>\n<p>…</p>\n<p>\n<em>Mud-eater,</em>\n</p>\n<p>\n<em>Is that your best effort? Come, you were doing well.</em>\n</p>\n<p>\n<em>Legolas Greenleaf</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>Conceited Prick,</em>\n</p>\n<p>\n<em>I’ve said all I wish to say to you. Leave me alone now.</em>\n</p>\n<p>\n<em>Gimli son of Gloin</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“Galion,” said Legolas, and there was a furrow in his brow that had not been there before. “I require a bottle of wine.”</p>\n<p>“A bottle of wine?” That was an unusual request. The Prince rarely imbibed, unlike his father. It usually signalled some inner distress when Legolas chose to take more than a glass at meals. “Red or white?”</p>\n<p>“It matters not,” Legolas said gloomily.</p>\n<p>Then he straightened at once, and said, “no – no, red. The Dorwinion, have we any of the pressing of fifteen years ago left?”</p>\n<p>“Barely any: you know it’s the King’s favourite,” Galion said, but he dutifully made his way to the rack in question and pulled down a dusty bottle. “It’s too fine a drop to waste on melancholy, my Prince…”</p>\n<p>“No, no I need it for, for something other than easing my mind,” Legolas said eagerly, and he took it in quick hands. “Thank you, Galion – it will be well, you shall see.”</p>\n<p>Galion watched him go, his tread far far lighter than it had been upon arrival, and shook his head. What was in that blond head these days?</p>\n<p>…</p>\n<p>\n<em>Gimli,</em>\n</p>\n<p>\n<em>I fear I have crossed a line.</em>\n</p>\n<p>\n<em>This wine is my father’s favourite: a Dorwinion Red. It is fearfully strong, so kindly pace yourself and do not make yourself sick.</em>\n</p>\n<p>\n<em>The colour is deepest red. It is the same shade as your hair – and my ears, when I am angry.</em>\n</p>\n<p>\n<em>If you would, I would like to hear about your journeys.</em>\n</p>\n<p>\n<em>Legolas Greenleaf</em>\n</p>\n<p>…</p>\n<p>“You’re distracted,” Dwalin barked. “Pay attention.”</p>\n<p>Gimli shook his head, wiping his brow with a forearm and blinking the sweat from his eyes. “I am sorry,” he said, before taking his pose again with the axe held up by the side of his face. His knees bent slightly as he prepared for Dwalin’s attack.</p>\n<p>The old warrior gave no quarter, and rushed him with all his strength and cunning. Gimli was his best student, and it was proving more and more difficult to give the lad a proper challenge. Yet today, he blocked and parried without his usual crisp flair, and his attacks were half-hearted at best.</p>\n<p>Dwalin disarmed him in half the usual time, and grunted deep in his throat. “You’re in no shape at all today,” he said. “Go and shower and come back when you have a mind to work!”</p>\n<p>“I- yes, Dwalin,” said Gimli, lowering his eyes.</p>\n<p>Dwalin softened. It was unlike the boy to not have a witty retort, or even a grumble. “I don’t know what’s preying on your mind, lad, but take care eh?”</p>\n<p>Gimli looked up, and his answering smile was small. “I will be well enough. I am simply confused. I don’t know.”</p>\n<p>“Whatever it is, don’t let it drag you down.” Dwalin cuffed the lad’s bright red hair, and Gimli’s smile broadened into a grin. Ah,<em> there</em> he was. “But do not strike before the metal is cold, neither. Allow yourself some time, and judge your moment. Like you would an axe-blow.”</p>\n<p>“Yes, Dwalin.” Gimli gathered up his axe and began to trudge from the training-floor. He looked deep in thought, and Dwalin wondered what <em>that </em>was all about.</p>\n<p>It was unlike Gimli to be so subdued, after all.</p>\n<p>…</p>\n<p>\n<em>Legolas,</em>\n</p>\n<p>\n<em>The wine is indeed very red. I thank you. I had two glasses, and nearly slept to noon the following day. I could barely train with my axe that afternoon. My teacher noticed my sluggishness and sent me away. I hope he could not tell the effects of Dorwinion wine upon a Dwarf!</em>\n</p>\n<p>\n<em>I confess that I overreacted. I do that on occasion. My ears are after all, very large. I cannot shoo flies away with them, alas. Too, I do not have much beard as yet, but I have hopes enough for the future. And I may not be two thousand years old, but I am no simpleton.</em>\n</p>\n<p>\n<em> I will also say that the part that stung the most was the sign-off. As much as you have irked and infuriated me, you do not disgust me.</em>\n</p>\n<p>\n<em> <strike>Further, I do not hate your singing in the slightest</strike> </em>\n</p>\n<p>\n<em>I have travelled all over the North with my father. I was born in the Blue Mountains, and we have travelled to the Shire for many winters over the years, selling our wares and crafts and skills in order to bring food when times are lean. I have been to Bree once, where few Dwarves are. The Men pay poorly, but the Hobbits are generous with their food, and for that we have been thankful.</em>\n</p>\n<p>\n<em>I have seen the ocean, gathering clouds over the endless expanses of blue that seem to swallow the eye. I have seen old ruins, left by the High Kings of Fornost, crumbling in stately decay. They knew their trade, those old Men of the West!</em>\n</p>\n<p>\n<em>The Misty Mountains are still the most fearsome journey I have made. We were beset by goblins at the pass. My mother and I held the rear as Lady Dis fought the in the van, and we nearly lost two of the wagons. I would rather face one of the Spiders of <strike>Mirk</strike> Greenwood again! </em>\n</p>\n<p>\n<em>Tell me of the passing of so many years. </em>\n</p>\n<p>\n<em>Gimli</em>\n</p>\n<p>…</p>\n<p>\n<em>Most Travelled Dwarf, </em>\n</p>\n<p>\n<em>Why, you have a touch of the poet in you, I think. That has come as something of a surprise.</em>\n</p>\n<p>\n<em>I am glad your teacher did not notice the aftereffects of the wine. I am doubly glad that you have accepted my peace-offering.  </em>\n</p>\n<p>\n<em>I have rarely been from under the eaves of my forest. But Greenwood the Great is she, and she stretches between Mountains and over lakes and rivers, a sea in and of herself – but one of rolling green instead of blue, shifting and deadly and beautiful. I have never grown tired of her infinite changes, or her many moods. She is gentle and merry in the spring, elegant and languid in summer, radiant and stormy in the autumn months, and stately as a queen in her frozen winter mantle. Her darkness has not detracted from her beauty, not at all: rather, she wears it as one does a proud scar, a sign of sorrow that makes all joys seem more bright and blissful. No matter how many centuries I live, I will never grow weary of the voices of the trees. </em>\n</p>\n<p>\n<em>The years do not weigh on me yet. I am not young as we account our people, though I am not old either. I do not know how it is, for mortals. I know you are young as yet, but I have read the words of ancients amongst the race of Man, and they seem to understand how years may roll together into a seamless cloth. It is only when one stands back that the pattern may be seen.</em>\n</p>\n<p>\n<em>I admit that I have not been fair to you, singling you out in such a way. I am an adult long grown, and you are not. Your tongue is quick and your wit keen, and I never felt as though I were trading blows with an unequal opponent – far from it! <strike>You do not disgust me, instead I find myself intrigued</strike></em>\n</p>\n<p>\n<em>You have seen the sea! Alas, for Elves have a great longing and love towards it. The call from long ago still resounds even in the little rivers and lakes of my home, but to hear the clarion bell of the ocean waves would stir such a yearning in my heart. What did you do there? Tell me more if it, I beg you. </em>\n</p>\n<p>\n<em>Legolas</em>\n</p>\n<p>…</p>\n<p>“I have something amusing to tell you,” said Tauriel, laying in Kili’s arms, her head pillowed upon his breast. She could hear his deep and steady heart under her ear, and thrilled at it. The scar under her fingers was still slightly red and proud, but it would fade over the years. “It concerns my Prince.”</p>\n<p>“Mmm,” said Kili indistinctly, his thick fingers toying with her hair. Then he began to snigger, his belly jolting her head up and down. “Does it have to do with a small, hotheaded cousin of mine?”</p>\n<p>“Indeed it does,” she said, and turned in his arms to grin up at his face. “They continue to write each other, though it has been nearly a year since the journey.”</p>\n<p>“I am astonished that the letters don’t actually catch fire,” Kili said. “There’s got to be some truly blistering insults in those. Gimli has a wicked tongue when he is on a roll!”</p>\n<p>“And Legolas can be as caustic and icy as a winter wind when he so wishes,” Tauriel agreed. “Yet my Prince no longer stalks about in fury after the messenger birds arrive. He is full of thoughtful looks and pauses now.”</p>\n<p>Kili hesitated, and then frowned. “Come to think of it, Gimli’s quieter than usual of late.”</p>\n<p>“I take it that is somewhat unusual,” Tauriel said mischievously, and kissed him.</p>\n<p>“You’ve met him, then.”</p>\n<p>“I am unlikely to forget the experience!”</p>\n<p>“He’s not thick, for all that he has a mouth on him.” Kili brushed the backs of his fingers against her face, his brow still furrowed. “I wonder what’s going on there.”</p>\n<p>…</p>\n<p>\n<em>Legolas,</em>\n</p>\n<p>\n<em>I have enclosed a shell from one of the little beaches I walked upon. The sand was grey-brown, but I could barely make it out beneath the thousands and thousands of these tiny shells. They crunched beneath my feet, which alarmed me greatly at first. But then my mother told me that the small creatures that once called them home had departed, and this was why the shells now lay empty and washed up upon the shore.</em>\n</p>\n<p>\n<em>I kept some, to remind me of that day. The wind was bitingly cold and laden with the smell of salt and the mustier scent of sea-weeds. There were birds that wheeled high, calling in piercing mournful voices. They were returning to their nests in the nearby cliffs that tumble down into the sea – the Blue Mountains have eroded and shattered still further since the waters swallowed so many of their number. Now no dwarves live in the westernmost halls, so treacherous and prone to collapse and flooding: only the sea-birds and bats and creeping animals come here now, roosting where my people once made lamps of light and glory.</em>\n</p>\n<p>\n<em>And of course, myself and my mother upon one memorable year, gathering salt to dry, fishing at dawn and dusk. The wind made my nose and eyes water and turn red, as I remember.</em>\n</p>\n<p>\n<em>The shell is like those Mountains, to me. It is cracked upon its rim, and the outside is tough and dull-looking, unlovely and squat. But turn it over, and the myriad shifting colours of white opal, pearl and moonstone shine back at you. </em>\n</p>\n<p>\n<em>The way you speak of your forest moves me. I have always felt attached to this place, this Lonely Mountain, though I never laid eyes on it until last year. It is our home, and yet it is not. We grow into it over time, and perhaps one day it will fit us as well as the shell once fitted its watery inhabitant.</em>\n</p>\n<p>\n<em>But you have lived beneath those trees for countless years and it is more than home to you, it is a skin you wear as close as your own. No wonder you took the name ‘Greenleaf’.</em>\n</p>\n<p>\n<em>I thank you for your forgiveness, and I must apologise once more for spoiling our game. You are gracious in victory.</em>\n</p>\n<p>\n<em>Gimli</em>\n</p>\n<p>…</p>\n<p>\n<em>Gimli,</em>\n</p>\n<p>\n<em>Nay! I do not count it a victory, for I overshot my mark and hurt you when I truly had no intent to do so. Do not hold yourself accountable when it was my part to play the role of the responsible one, and I failed. I count myself fortunate that you have forgiven me.</em>\n</p>\n<p>\n<em>Though – if you should care to play another game? I slew seven spiders only this week, with my bow. I await your answer, most noble Mole.</em>\n</p>\n<p>\n<em>I had not considered your people's troubles, not in all my ‘countless years’ (let me assure you, they are countable!). I think that we of the Eldar put out of mind the sufferings your folk have endured, for it is easier and more natural to us to dwell upon our own misfortunes. But to hear that your mother and yourself (I discern from your tale that you were a very young child at the time) were gathering salt in a dangerous place… your father journeying far and wide to sell wares to Men who cared little for its quality…. yes, hard times indeed. I sorrow for your people’s losses. </em>\n</p>\n<p>\n<em>I know in time that the Mountain shall fit you as well as the beautiful little shell. And, like the mountain, it shall house great beauty beneath its cap.</em>\n</p>\n<p>\n<em>It still smells of brine, and the colours upon the inside are a fascination to me. They shift and swirl so! I thank you from the bottom of my heart. To have such a token of the sea is a glorious gift, and proof of your kindness.</em>\n</p>\n<p>\n<em>Your mother was not among those in the caravan, was she? I do not recall her. I hope I did not give her insult!</em>\n</p>\n<p>\n<em>The leaves are turning red once more. The songs of the forest have turned from slow lazy melodies of basking in the midday sun to such a tempestuous defiant chorus! The trees claw and thrash against the winds, and they don their most radiant garb in the face of the encroaching frosts. I admire their steadfastness, and their ability to endure.</em>\n</p>\n<p>\n<em>Legolas</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“What do you think?” Thorin said, rubbing at his brow tiredly. “With Dain’s folk gone back home for the winter, we’re short on numbers…”</p>\n<p>“We’ve some promising young ones,” Dwalin rumbled. “Some of which are even of age.”</p>\n<p>Thorinj glanced up at him. “How many?”</p>\n<p>“Oh, couple of dozen.”</p>\n<p>“I will not condone sending children out to fight,” Thorin said, his jaw firming. “Not for all the mithril in the Misty Mountains.”</p>\n<p>“Aye, neither would I. But guard-duty? That they can handle, and well enough. Wouldn’t send them out on patrol.” Dwalin stopped, chewing his lip. “Except Gimli, perhaps. He’d learn a thing or two, and we could place him amongst the more experienced warriors to watch his back.”</p>\n<p>“Gimli?” Thorin pushed back the papers upon his desk, slumping in his chair and frowning up at Dwalin. “He’s sixty-five…”</p>\n<p>“An’ he’s my best student, Thorin.” Dwalin shrugged. “He’s the best I’ve seen in <em>decades</em>, to be frank. But he needs a challenge before he gets too complacent.”</p>\n<p>“Gloin will string our balls on a necklace if anything happens to the lad,” Thorin warned.</p>\n<p>“I’m not worried about that,” Dwalin said, waving a meaty hand in dismissal. And that, more than anything, told Thorin how very ready Gimli was for combat. “But now that he’s beating me in the ring I need to step him up to a proper skirmish. He’s faced goblins, to be sure, but not in an organised manner, and the only battles he’s seen since are friendly training bouts.”</p>\n<p>“I’ve trained alongside you: there’s nothing friendly about your duels,” Thorin said dryly. “All right, Gimli may be added to the patrol roster, but only in a limited capacity and only with sufficient numbers to protect him. I’m not having Gloin come at me with any accusations.”</p>\n<p>“Send him to me, I’ll deal with it.”</p>\n<p>“And have both my treasurer and my general dead of axe-poisoning? No thank you. I’ll get Bilbo to talk to him.”</p>\n<p>“Bilbo’s as ornery as you are. He’s just a lot more proper about it,” said Dwalin, folding his arms and looking unsatisfied.</p>\n<p>“Exactly. He won’t be swayed. And Gloin’s fond of him.” Thorin then wrinkled his nose. “Wait, Gimli’s beating <em>you?”</em></p>\n<p>Dwalin ignored that with beautiful disdain.</p>\n<p>…</p>\n<p>\n<em>Dear Legolas,</em>\n</p>\n<p>\n<em>I am to join the ranks of the patrols! As an apprentice-warrior still, but I shall be counted amongst journeymen and masters! It is a great honour to be promoted thus: the other apprentices are stuck on guard duties and border watches, and are heartily jealous of me. </em>\n</p>\n<p>\n<em>Sadly, o point-eared beanpole, I must concede that your tally outstrips mine. We are rather low on giant spiders in Erebor. I slew a fine mug of ale or two in celebration of my new-found fortune, however.  Perhaps on patrol I shall find an opportunity to match you again.</em>\n</p>\n<p>\n<em>Aye, my mother was indeed with me on our journey. And I am afraid you did give her insult, which did not endear you to me at the time! She is the dark-skinned Dwarf with the tightly-curled hair and beard, oftentimes seen at the side of the Lady Dis. Her name is Millis, and I have my eyes and complexion from her. </em>\n</p>\n<p>\n<em>The song of the trees is a strange concept to me, but a beautiful one. I cannot hear it, but from your descriptions it must be glorious indeed. I have stopped upon the slopes of the Mountain where the juniper and blackberry grow, pricking my ears to catch any hint of song, to no avail. The wind hissing in the branches is all I can discern. <strike>I would have you teach me how to hear it</strike></em>\n</p>\n<p>\n<em>But you bring to my mind something that you perhaps have not heard – or rather, felt. The songs of the earth are as varied and myriad as there are minerals in it, and standing in the halls of my forebears I can feel diamonds, quartz, black ore and emeralds humming back to me in their deep tones. In Ered Luin all was muffled by the woolly drone of sandstone, but here in this good black rock, forged in fire, their voices sound so clear and true. I have now held an uncut diamond in my hand and felt it calling against my skin, high and pure and thrilling, telling me which way to shape it so as to release its beauty. </em>\n</p>\n<p>\n<em>Gimli</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“What are you reading, that you smile so?”</p>\n<p>Legolas spun around, a swiftly-hidden look of guilt upon his face. Thranduil, standing in the doorway of his son’s solar, frowned ever so slightly. It was an expression that none could have discerned unless they knew him well.</p>\n<p>“Ah, nothing Ada.” Legolas seemed embarrassed, and he placed a hand with too-casual carelessness upon the papers of his table and shuffled them around.</p>\n<p>Thranduil knew his son, and knew when he was dissembling. He tilted his head. “Are you at peace?”</p>\n<p>That elicited a smile. “Oh yes! I am well enough, and content enough, though my feet itch for travel. May I go hunting in the northern reaches this moon, if you have no need of me?”</p>\n<p>Thranduil was still, silent, considering. “I have no requirement of you. Do that which makes you happy. Perhaps a journey will cure you of your unrest.”</p>\n<p>Legolas beamed as though he were a fifty-year-old once more. “Thank you, Ada!”</p>\n<p>“Bring back a report upon the doings of the Dwarves,” Thranduil added, as he swept from the room. His last sight was of his son’s rather chagrined face.</p>\n<p>…</p>\n<p>\n<em>Dear Gimli,</em>\n</p>\n<p>\n<em>This is fine news, and I congratulate you! Your skills with the axe must now be formidable indeed, for you were gifted enough when you cleaved spiders alongside me over two years ago.</em>\n</p>\n<p>\n<em>Two years! How fleet time can be! I would not have paid any attention to it, not so long ago. But now our correspondence places tide-marks along the smooth river of my life. How peculiar it is, to see time through your eyes! I thank you, it is a sight worth seeing.</em>\n</p>\n<p>\n<em>I have enclosed a gift for your new appointment. Wear it well and in safety!</em>\n</p>\n<p>\n<em>I am filled with dismay that I have offended your lady mother. I would pass on my sincere apologies, but I am unsure whether our correspondence is common knowledge amongst your kin. If so, please convey my deepest shame and contrition to her. </em>\n</p>\n<p>\n<em>I can already hear your rejoinder, my friend. No, our letter-writing is not widely known amongst the Elves here. My father remains unaware, but Tauriel knows of it (and finds it highly amusing). I think she believes that we are still at each other’s throat. Well, we did argue long and loudly - loudly enough to shake the birds’ nests from the trees! We shall become a legend of incivility, I think, and none shall ever believe that we have since become friendly.</em>\n</p>\n<p>\n<em>Ah, but what you heard in the juniper and blackberry bushes <u>was</u> the song! The wind, the percussive creak of bough, the hiss of leaves, the skitter of the burrowing insects just beneath the bark, the slow groan of new growth: these together and more make the song of the forest. You do yourself an injustice when you say you cannot hear it. You may not be able to make out the words, so to speak, but certainly you hear the melody.</em>\n</p>\n<p>\n<em>My heart is full of your words about the song of stone! What a wonder! It strikes me that perhaps I may be able to hear it one day, if you were to show me how best to listen. I have peered into the depths of my father’s favourite white gems, and found nothing but silence and a cool snowlike shimmer. </em>\n</p>\n<p>\n<em>Remain safe, </em>\n</p>\n<p>\n<em>Legolas</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“My Prince, what are we doing here? We are <em>far</em> past the borders of your father’s lands,” Tauriel hissed. “And if you mean to make for the Mountain I would welcome it. But it is the other way!”</p>\n<p>“Shh!” Legolas said, and peered around the craggy rock that sheltered them. Towards the western sky, framed against the sunset, could be seen the peak of the Lonely Mountain. Behind them, stretching on and on into the darkening dusk, lay the Iron Hills, somewhere east. “There they are!”</p>\n<p>Tauriel craned her neck, trying to see. Legolas grabbed her shirt-sleeve and tugged her down. “Their eyes are keen in the dark,” he muttered. “Stay by the stones!”</p>\n<p>“Why are we hiding here, and who from?” she asked in exasperation.</p>\n<p>Then the dull thump of heavy footsteps reached her ears, and her head whipped back to the dying glow of the sun. There, she was astonished to see a line of Dwarves, armoured and in tight-knit formation, making a careful investigation of their borders.</p>\n<p>“Is this why we are here?” she said, and ire on behalf of her beloved began to bubble in her belly. “To <em>spy</em>? On our friends and allies, my own beloved’s people, in their own…”</p>\n<p>“No, no, I simply wish to see that he is safe enough, then we shall- ” Legolas broke off, and all at once a truly dazzling smile split his face. “There he is!”</p>\n<p>“Who?” Tauriel blinked.</p>\n<p>“The smallest one, second from the end.” Legolas laughed in sheer delight. “Ah! He has his long-awaited beard at last – and he wears my gift! I knew he would. Look at him go, Tauriel! Half the age of the others, and yet he carries his share as easily as any of them!”</p>\n<p>With a dumbfounded jolt, Tauriel recognised the shock of bright, curly, untameable red hair.</p>\n<p>“Oh, Elbereth,” she murmured, and turned back to see the look of joy upon her Prince’s face.</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>Dear Legolas,</em>\n</p>\n<p>\n<em>The clasp is beautiful, and has earned me many admiring compliments. I have not said where I received it, lest the compliments turn ugly! I cannot thank you enough. It is too rich a gift, but I am too fond of it to give it up. It sits in my beard even now. </em>\n</p>\n<p>\n<em>Yes, my beard! My hopes have proven true, and I can now call what lives on my chin a beard without fear of argument. </em>\n</p>\n<p>\n<em>My count is not seven spiders in a week, to my sorrow! Still, I can count three Gundabad orcs to my axe. You still have the advantage over me, my friend. I must visit your forest again for a chance to catch up!</em>\n</p>\n<p>\n<em>I have enclosed a sapphire from my family’s mine. If you smooth your thumb over the facets, you may yet feel the silky glide like a descending note slipping down your spine, the sharp crispness of the edges, the glitter at its heart like the rustle of leaves given crystalline form. That is this stone’s song, and your skin knows it even if your ears do not. I heard it and shaped it for you with my own hands, my friend.</em>\n</p>\n<p>\n<em>I have grown inordinately fond of juniper and blackberry bushes, and my fellows think me addled as a result! But I like recalling your words as I sit by them, listening to the wind stir their leaves. </em>\n</p>\n<p>\n<em>I have finished my first patrol, and have so impressed my superiors that they wish to season me further. I am to be send with the next food-train to the Iron Hills, to protect it as it returns with supplies for the Mountain. Lord Dain still provisions us, you see, until Dale and Esgaroth have established themselves.</em>\n</p>\n<p>\n<em>A legend of incivility! I like that! And no, it is not well known amongst my people that we are still in contact, nor that we have made peace with each other. I believe Kili knows.</em>\n</p>\n<p>\n<em>And now my mother, also, for I have passed on your words. She gave me a long, hard look, and then nodded. Then she said something I did not quite understand, but perhaps you will? Her words were, “Hearts will as hearts must.” She is full of wise sayings, but I do not know what she means by this one. Your heart meant to insult her? Hers meant to forgive? Your heart meant to feel apology? I am perplexed, and wish for the wisdom of ages to help me!</em>\n</p>\n<p>\n<em>Gimli</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“You’re sighing like a maid in love,” said Dain bluntly.</p>\n<p>Gimli jerked to attention, dropping the small thing he had been fiddling with tucked amongst the thick red curls of his beard. “My lord!”</p>\n<p>“Now, don’t you be ‘My Lord’ing me, cousin Gimli. I’ve seen your naked infant bum racing down the hall. You call me Dain, or not at all.” The Lord of the Iron Hills stooped with some difficulty, picking up the little thing that Gimli had dropped.</p>\n<p>It was a golden clip, delicate compared to the usual style of Dwarvish adornments. There were no stones embedded in it, but it was cunningly contrived. To open it, the two golden leaves could be lifted up and apart, but would snap back together so closely and tightly that you could not see the join.</p>\n<p>“That’s a pretty thing,” Dain said, opening it and closing it to watch the leaves join together like parts of a puzzle. “And not made by Dwarves.”</p>\n<p>Gimli bit his lip. “Um.”</p>\n<p>Dain looked up at him from under his impressive brows. Gimli was nearly his height now, and was no longer a stripling. Continuous journeys and skirmishes had carved the young fiery lad into a bulky warrior, and there was little sign of the boy left in his face. But the panic in his eyes, that was <em>all </em>youth. “Now, lad. You don’t mean to tell me that my suspicions seven years ago were <em>correct?”</em></p>\n<p>“I don’t know what it is you suspected,” Gimli said, strangled, “and so I cannot possibly confirm it.”</p>\n<p>“That you and Thranduil’s son are a great deal more alike than anyone ever guessed,” Dain said, forthright as always. Gimli swallowed.</p>\n<p>“I commend you on your foresight,” he said eventually, his voice nearly a whisper.</p>\n<p>Dain looked down at the clasp again, and then held it out for Gimli to take. “If my foresight is of any use to you, lad,” Dain said, in a far gentler tone than Gimli was expecting, “don’t keep hiding away. Sure and certain, there’ll be those that disapprove. But do you really need them making your decisions for you – particularly when it comes to your heart?”</p>\n<p>Gimli watched the Lord stump away on his iron foot, the clasp held in his nerveless fingers.</p>\n<p>…</p>\n<p>\n<em>Dear Gimli,</em>\n</p>\n<p>\n<em>I rejoice with you upon the advent of your beard! I <strike>know</strike> am sure that my clasp sets off the brightness to fine effect. May it grow ever longer! Stay safe and vigilant upon your road, my friend...</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>My dear friend Legolas,</em>\n</p>\n<p>\n<em>I am returned! I now have a Warg to claim amongst my tally, and a fearsome foe he was too. It nicked me upon my shoulder with its claws as it writhed in its throes. It did not do anything lasting, but I shall bear the scar always, Dwalin says…</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>Dearest Gimli, </em>\n</p>\n<p>\n<em>You were wounded! That is ill-news indeed, and I am glad you were not grievously harmed…</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>“To your health!” Fili cried, toasting Gimli. “Sixty-eight!”</p>\n<p>“Soon you shall be as wise and venerable as we are,” Kili grinned.</p>\n<p>Gimli was not drinking ale, but a deep red wine that brought the flush in his cheeks forth and made his eyes glassy. He laughed, loud and deep and hearty. “Oh, such an achievement, to be as wise as you!”</p>\n<p>“Pfft, Tauriel says I am very wise,” Kili said, tossing his head. His own beard was beginning to fill in, much to his joy, but of the three playfellows it was already clear that Gimli’s was going to be the most magnificent.</p>\n<p>“Perhaps you can be,” Gimli said, leaning back in his chair. “Who knows what lies in the murky depths of that scruffy head?”</p>\n<p>Fili toasted Gimli again in appreciation for the quip, and grinned at his brother’s spluttering noises. “Now, Gim, got any plans for your birthday?”</p>\n<p>“Hmm. Not much,” Gimli said, taking another sip of his heady wine. “Perhaps go out to the Western foothills, listen to the blackberries growing. I like it out there.”</p>\n<p>Fili stilled, and shared a look with his brother. “Listen to them growing?”</p>\n<p>“That’s the sort of thing Tauriel says,” said Kili slowly.</p>\n<p>“Ah, but she is also suffering from the delusion that you are in any way wise,” Gimli said quickly, blustering a little to cover his slip. “Poor Tauriel, the stars must have addled her wits.”</p>\n<p>Kili bristled for a moment, and then all at once he grinned in savage satisfaction. “And is that what’s going on with your green leaf? Eh, <em>Master Mole?”</em></p>\n<p>Gimli blinked, and his fingers tightened on the stem of his glass. “You remember? But that was years ago.”</p>\n<p>“Not likely to forget,” Kili said, smug.</p>\n<p>“What’s this,” Fili asked, looking between one and the other with a growing suspicion.</p>\n<p>“Nothing, never you mind,” Gimli said, and the clasp in his beard clinked against the edge of his wineglass as he buried his face in it.</p>\n<p>Fili stared at the clasp, and wondered how Gimli had worn it for nearly a year without anyone pointing out how bloody <em>Elvish </em>it was.</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>Legolas, best of friends,</em>\n</p>\n<p>\n<em>Another journey! To the Blue Mountains again. A long one, and I shall be gone nearly a year if all goes aright. We go to remove the last of our people and escort them here, to the peace and prosperity of the Mountain…</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>My brave friend Gimli, </em>\n</p>\n<p>\n<em>Another? They must think highly of you! I am filled near to bursting with pride in your speedy ascent. Yet I cannot help but recall your injury, and hope with all my heart that no such fortune awaits you…</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>Most worrisome friend!</em>\n</p>\n<p>\n<em>I shall be well enough, now that I am almost grown and have my full height and weight – though I am sure you would say, it is not that impressive an achievement! I shall be back before the leaves of your forest turn as red as your ears again. And I swear upon my beard that I shall be careful…</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>The seasons rolled on, as they always did. Legolas grew morose.</p>\n<p>“What ails you?” asked Thranduil, sitting by his son’s side. Legolas did not even stir, looking out the window with his chin propped upon one hand.</p>\n<p>“I am restless, and filled with frustration,” he said.</p>\n<p>“The birds call out the advent of spring, and the forest wakes after winter,” Thranduil said, and he gently stroked Legolas’ fine golden hair. “My son, go walk the paths of the wood. They will bring peace to your heart.”</p>\n<p>“No, I have done so,” said Legolas, heaving a sigh. “They do not bring me comfort today. I wish to do something of use.”</p>\n<p>Thranduil paused. Then he recalled that, only yesterday, a small party of Dwarves had passed under the southern reaches and had entered the plains of the Beornings. That same party had occupied much of Legolas’ attention of late, and he had seemed happy. He had even voluntarily escorted them past the dark river before returning home.</p>\n<p>Thranduil thought on it for a moment, before standing in one swift motion. “If you would do something useful, perhaps you would make an embassy to Erebor for me?” he said, as casually as though he were remarking upon the weather.</p>\n<p>Legolas started and looked up slowly. That glint of guilt was back in his eye. He seemed more like the Elfling of fifty again, caught in some wrong-doing. “Ada, I-”</p>\n<p>“Your life is yours, Legolas,” Thranduil interrupted, if gently. “But do recall that we care for you. Would such a task please you?”</p>\n<p>“Yes,” Legolas breathed.</p>\n<p>My son is enamoured of the Dwarves, Thranduil thought, and inwardly he heaved a sigh. “At least you have not done as Galion does, and given your affection to the bottle.”</p>\n<p>A flicker of confusion crossed Legolas’ face, but he smoothed it hastily. “And what messages shall I give to King Thorin, Ada?”</p>\n<p>“Oh, my greetings, of course,” Thranduil said, waving a negligent hand. “See if you can get a better price on silver, for what they charge now is double the cost in Thror’s day.”</p>\n<p>Legolas’ eyebrow twitched. “I understand that they have only recently reopened the silver mines, and that the dragon had damaged much of the supports and workings. That may explain the cost.”</p>\n<p>Thranduil regarded his son steadily. “Did Tauriel tell you this?”</p>\n<p>The reddening of Legolas’ ears betrayed him, but he did not answer.</p>\n<p>Enamoured of Dwarves, and conversing with them – or at least one, thought Thranduil. Perhaps he should call on Galion before retiring for the evening. He could do with some of Galion’s preferred consolation at this moment.</p>\n<p>…</p>\n<p>\n<em>Most beloved friend,</em>\n</p>\n<p>\n<em>I’m on my way home! And I have a gift for you, a jewel of the sea! It is a black pearl, and as rare a gem as can be found in this Middle-Earth. They can only be found amongst the waters of the Gulf of Lhûn, it is said.</em>\n</p>\n<p>\n<em>I now have a troll to claim to my axe! I shall soon be accounted a journeyman warrior, once I have reached my majority. And that is in a matter of months only.</em>\n</p>\n<p>\n<em>I would have you there, my friend and dearer than friend. I would celebrate with you by my side.</em>\n</p>\n<p>\n<em>Gimli</em>\n</p>\n<p>\n<em>…</em>\n</p>\n<p>\n<em>My Gimli,</em>\n</p>\n<p>\n<em>I will be there.</em>\n</p>\n<p>\n<em>Legolas  </em>\n</p>\n<p>…</p>\n<p>“I must say, you are a great deal more pleasant to deal with these days,” said the Prince Consort, pouring a cup of tea and then offering it politely to Legolas. He nodded assent, consciously correct in all his manners. “Millis was saying only yesterday that it’s like talking to an entirely new person. Cream? Sugar?”</p>\n<p>“Sugar, please.” Legolas had no idea if he even liked Hobbit-tea with sugar, but he was flustered by the mention of Gimli’s mother. Upon taking a sip, he found it inordinately sweet. He forced himself to take another.</p>\n<p>“And you’ve knowledge of Dwarves and their doings that I am absolutely positive wasn’t there before,” continued Bilbo, taking a taste from his own cup and sighing in satisfaction. “Nothing like a cup of tea, is there?”</p>\n<p>“No?” Was there? Legolas wracked his mind. <em>Was</em> there anything like it, or was this another of his odd, opaque Shire sayings?</p>\n<p>The Hobbit narrowed his eyes, swirling the tea in his cup ever so slightly. “You know that the Dwarves are tremendously prickly about their secrets.”</p>\n<p>“Yes, I do.” Gimli had mentioned. He had also mentioned that he was cheerfully breaking several taboos by even saying as much. “I have learned nothing that was not willingly given to me.”</p>\n<p>“Mmm. I am sure about that, you Highness. You see, I’ve had a letter from our cousin Dain.”</p>\n<p>Bilbo leaned forward here, as though he expected this news to discomfit Legolas. But he only stared back in slight bewilderment. “I… hope the Lord is well?”</p>\n<p>Making a sound of amused exasperation, Bilbo said, “yes, yes, he’s as hearty as a brace of oxen. Do you care to know what Dain suspects?”</p>\n<p>Legolas only blinked at him in confusion.</p>\n<p>“That you and your ginger nemesis are beard over boots in love with each other.” Bilbo sat back, grinning. “Well, obviously not beard, in your case. Nor boots. But isn’t that the most preposterous thing you’ve ever heard?”</p>\n<p>Legolas carefully put down his too-sweet tea. His heart was pounding fit to rattle his ribs. “Excuse me,” he heard his own voice say, before he fled the room as fast as his feet would carry him.</p>\n<p>Bilbo sipped at his tea, unperturbed, and made a mental note to write a congratulatory letter to Dain.</p>\n<p>…</p>\n<p>Legolas hovered at the Gate of Erebor, and tried not to listen to all the whispers that followed him.</p>\n<p>“<em>…fought like cat and dog all the way! Never heard such a din!”</em></p>\n<p>\n<em>“Someone get the pails of water ready, we’re about to have another battle and I don’t think the Eagles will save us this time!”</em>\n</p>\n<p>\n<em>“Four on Gimli to throw the first punch!”</em>\n</p>\n<p>\n<em>“I came prepared. I’ve goats-wool ear-plugs for sale, three gold pieces a pair.”</em>\n</p>\n<p><em>“</em>Three<em> gold pieces? You dirty thief, that’s outrageous…! Um. All right, one set for me and one for her.”</em></p>\n<p>To his surprise, Bilbo came to wait with him, lighting his pipe and wriggling his furry toes. Gimli’s mother was an anxious, silent presence, though he felt her eyes resting upon his back every so often.</p>\n<p>Finally, the slow snaking train of wagons and footsore Dwarves had made it through the bowl of the valley, the early autumn sun high in the sky. Legolas fancied that he could see it glancing off the brilliant red hair of one – but that Dwarf was taller and broader than his. He could not make out Gimli amongst so many.</p>\n<p>The King and his sister came forth to greet the new arrivals, and there were many embraces and many tears as families were reunited for good. The Princes were there also, and Tauriel nodded to him from her place at Kili’s side.</p>\n<p>Finally the crowd began to thin, and Legolas caught sight of Gimli.</p>\n<p>So changed! What time wrought on a mortal – so <em>changed</em>! He was thickset and broad, his beard long enough to twine into two plaits that reached past his bullish neck. His hands were now enormous and bulky muscle moved on him as he made his way through the crowds, greeting his people as he came. No longer a brash youth, hotheaded and impatient. Here was a warrior tested, confident and calm in his skills, easy and assured.</p>\n<p>Then his eye landed on Legolas, and his mouth dropped open.</p>\n<p>“<em>Oh, here we go,”</em> he heard someone groan.</p>\n<p>There was a slight pressure on his back, and Legolas spared a second away from drinking Gimli in with his eyes to see who it was. Millis, her dark eyes warm and kind, was gently pressing him forward towards her son.</p>\n<p>“Go on then,” she said. “Hearts will as hearts must.”</p>\n<p>He thanked her with a brief, glad squeeze of her hands, and then glanced up to Gloin. The Dwarf looked entirely bemused, and Millis smiled.</p>\n<p>“I’ll handle that one, if you can manage the other,” she said. “Now, go to him. Ionneg.”</p>\n<p>Her accent was dreadful, but it gave him hope. Stumbling across to where Gimli stood locked in indecision, he licked his lips and drew himself tall. He was painfully aware of all the eyes upon them, awaiting the fight they expected.</p>\n<p>“Gimli,” he said, but there were no more words in him past that name.</p>\n<p>“I would tell you now that I have slain far more than seven spiders in a week,” Gimli said, and his eyes glittered with fondness. “Far, far more. You have a bit of catching up to do, Twig Princeling.”</p>\n<p>And just like that, Legolas knew what to say.</p>\n<p>“Oh, is that the case, Master Mole?” he said, and his cheeks hurt from smiling already, his whole body suffused with bright, nebulous joy. “Then I had best not stray far from you. I would not have you mistrusting my count!”</p>\n<p>“Aye, nor you mine!” Gimli retorted. Then one of his massive, battle-hardened hands was gripping Legolas' shirtfront and dragging him down into a long-overdue kiss.</p>\n<p>“<em>What.”</em> Legolas dimly heard King Thorin say, in a tone as flat and disbelieving as beaten metal.</p>\n<p>“Just think, dear,” said Bilbo cheerfully, “Thranduil’s own son, and your cousin! Isn’t it marvellous?”</p>\n<p>“<em>How.”</em></p>\n<p>And then the sweet scratch of hair upon his chin pulled him back to the moment, and Legolas surrendered. He buried his hands in Gimli’s hair and kissed him, and kissed him, and Gimli held him in arms as strong as iron and as gentle as milk.</p>\n<p>\n<em>“That’s Gimli landin’ the first hit. Hard luck, you lot.”</em>\n</p>\n<p>\n<em>“Oi, Nori, that’s a kiss! Not a hit! You miserable trickster, cough it up!”</em>\n</p>\n<p>“You’d better not have been wounded this time,” Legolas breathed against surprisingly soft lips, and Gimli chuckled.</p>\n<p>“Sadly, I must plead for forgiveness: I’ve a new scar upon my chest. An orc, just before we reached the Carrock.”</p>\n<p>“Oh?” Legolas let his fingers trail over the tunic’s lacings at Gimli’s broad throat. “I think I had better spend some time ascertaining your strength, then.”</p>\n<p>“I’d appreciate that,” said Gimli, his voice rumbling and his eyes aglow with interest. “Wouldn’t do to be in less than peak shape.”</p>\n<p>“Happy birthday,” Legolas said, and kissed him again.</p>\n<p>…</p>\n<p>Dain Ironfoot of the Line of Durin, son of Nain, hero of Azanulbizar and Lord of the Iron Hills, picked up his mail with a reluctant sigh. Rifling through the sketches of new mining proposals and trade tariffs, he came across a neat white envelope with Bilbo’s writing upon the front.</p>\n<p>Opening it, he scanned the contents.</p>\n<p>And began to <em>roar</em> with laughter.</p>\n<p>…</p>\n<p>END</p>"
}