{
  "id": "7327459",
  "url": "https://archiveofourown.org/works/7327459?view_full_work=true",
  "author": [
    "Methoxyethane"
  ],
  "title": "A Fish And A Bird",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Voltron: Legendary Defender"
  ],
  "relationships": [
    "Keith/Lance (Voltron)"
  ],
  "characters": [
    "Lance (Voltron)",
    "Keith (Voltron)"
  ],
  "additional_tags": [
    "Crack",
    "Except like crack with a plot?",
    "Lance how are you this dumb",
    "Keith needs better taste in men",
    "Shiro needs rest",
    "Please leave Shiro alone and let him rest",
    "Humor",
    "Romance",
    "Fluff",
    "Illustrated"
  ],
  "language": "English",
  "series": "Part 1 of A Fish And A Bird",
  "published": "2016-06-28",
  "completed": null,
  "words": "13,141",
  "chapters": "1/1",
  "comments": "422",
  "kudos": "15,872",
  "bookmarks": "2,948",
  "hits": "260,561",
  "summary": "<p>Lance has a boyfriend. Lance does not realize he has a boyfriend. Keith, understandably, does not react well.</p>",
  "notes": "<p>AN: Despite the fact that Voltron clearly does not take place in present day earth, I used an abundance of current pop culture references that aren’t even current anymore because I can't predict the future and don’t watch enough tv to even know what’s going on right now. Other than that, just don't take anything too seriously because I sure didn't :D</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>AN: And as you can tell from the final joke, this entire thing was actually just a remix/gigantification of my other Voltron fic The Hank-y Pank-y because the idea was too funny to let die before I beat it to oblivion like a horse corpse. I hope you guys had fun with this, because I know I did! Especially with Keith’s conspiracy theories. Writing those was like my favorite thing ever.</p>",
  "text": "<p> </p>\n<p>The original plan, as it was, HAD technically worked. In fact if you think about it, it had actually worked TOO well. Which had sort of been the problem, because things ended up getting <em> real </em> weird <em> real </em>fast. Which in total retrospect, had also been Lance's fault to begin with. Sort of. No, he was definitely blaming Keith for some of this.</p>\n<p>Okay, so the thing was, Lance wasn't ACTUALLY an idiot. As much as he may act otherwise, he really did understand the situation they were in. He understood that aside from being super cool, being a paladin was also literally the biggest responsibility in the entire universe. That a single slip at the wrong moment would mean death for not only him, but all of his fellow pilots <em> and </em>Allura and Coran and oh let's not forget everyone in the universe they still needed to save.</p>\n<p>He understood that saving the universe was going to take a very, very long time. Which wasn't COMPLETELY awful. Like, he'd been planning on spending all of his life as a space pilot exploring the farthest reaches of the galaxy and beyond or whatever, and he'd always known that that included missions that would take him away from Earth for years at a time. He'd just sort of hoped he'd like, get a chance to say goodbye to his family. Maybe grab few photos of them to take with, because he was already having trouble remembering what his brother's wife looked like and it had only been a few months. And God, she was pregnant! Had she already had the baby while he was away? If she hadn't yet, it was only a matter of time. Lance had a nephew whose name he didn't even know. Might never know, if he died out here in stupid space. So that sucked.</p>\n<p>But most importantly on a day-to-day every hour and every minute kinda basis, he understood that he had exactly six people, four mice, and lion that he could only speak to through vague ideas as his only companions. And this was for the next... rest of his entire life, most likely. And yeah they met cool aliens all the time, and no it wasn't ACTUALLY lonely for the most part, but. Six people, for the next several years at absolute minimum. Realistically speaking, if any of them didn't get along? It was going to be an absolute disaster and only get worse down the way.</p>\n<p>He could also admit he was the one who had issues in that area. Specifically, Keith-shaped issues. The guy just kinda got on his nerves, okay? Lance just had a PROBLEM with him. And Keith wasn't much better on his his part. Keith was kind of a dick, too. So, naturally, they spent a lot of time butting heads, sometimes resulting in stupidities like both of them flying their lions straight into the ground even though Lance swore to God they were both actually smart people. The situation was... Less than ideal.</p>\n<p>So... Yeah. Lance decided that maybe this was a thing he should work on. Keith was an asshole, sure, but there were times when the two of them worked together really well. Like, astonishingly well, even. And there were even times that they could speak to each other without it turning into a fight, which he figured was pretty darned good, right? He could work with this! Lance was determined not to spend the next however many years stuck with a guy he couldn't stand, even if it meant doing something as horrible as actually getting to know the bastard. Underneath that veneer of iciness and douchebaggery there had to be like. An actual human personality, right? He could not actually be a robot built for the sole purpose of flying as a paladin, no matter what Pidge and Hunk may of convinced Lance of that one time he was drugged up on space juice that turned out not to be safe for human consumption.</p>\n<p>Thusly determined, Lance set out to do the most annoying thing he could possibly do to himself – go out of his way to spend time with goddamned Keith. The problem was figuring out where to start. Because as far as Lance could tell the only thing the guy did in his free time was extra training, as that was NOT a good way to bond considering 85% of their fights happened while they were supposed to be cooperating. The goal for today was really only to hold like, a five minute conversation without devolving into an argument, and joining Keith in his sword room was not the way to accomplish that.</p>\n<p>The other thing Keith did, it turned out, was wander around the castle. For hours at a time. This actually sorta made sense though, since the castle was gigantically huge and they all now lived in it, so like. Mapping it out and seeing what's in all the rooms was kind of a really good idea. As much as Allura and Coran were trying to help them get to know the place, not even the two of them knew what was in every single room of the massive ship, especially after 10,000 years.</p>\n<p>This, Lance decided, was as good of a place to start as any. So steeling himself like a bamf and full of determination to make friends goddamn it – and he was sure he could, because he'd managed to befriend Pidge who had, and still kind of does, totally hate Lance – he approached Keith.</p>\n<p>The conversation had gone a bit like this. “Hey, Keith,” Lance started in a casual non-threatening manner.</p>\n<p>“Yes?” Keith had responded with an unnecessary amount of dubiousness.</p>\n<p>Lance kept his cool; hands in his pockets, friendly smile. “You were just about to take a walk, right? Mind if I join you? We can wander around together for a while.”</p>\n<p>Keith went from dubious down to suspicious, lowering his head to ask “Why?” Which, come on. What the hell kind of untoward intentions could he possible have, here? What a dick.</p>\n<p>Lance held the easy smile, “You know, to talk or whatever. Get to know each other.”</p>\n<p>And because Keith was a really freaking weird person, his response was a complicated maneuver went a little like such: First, confusion. “Get to know each other?” His expression turned contemplative, apparently trying to guess Lance's motivation. Then, his eyes widened with a startled “Oh! You mean...” and this is where things went wonky because his body language COMPLETELY changed. The vaguely wary tension he'd been carrying relaxed and his hand flew up to cover his mouth unconsciously, his stance softening from about-to-walk-away to... Embarrassed, maybe? “You're asking... I didn't realize...”</p>\n<p>Didn't realize that Lance wasn't as big of an asshole as he seemed? Didn't realize humans were expected to communicate with each other through speech? Why was this suddenly so weird? Lance knew the guy didn't get along much with other people, but had he really never been invited anywhere before if this was his reaction to someone trying to spend time with him? Lance was suddenly unsure how to handle this. “Uh, yes? So.” He pointed a thumb over his shoulder in a gesture towards the open hallway behind them. “Do you wanna..?” This felt weird now, why did Keith have to make this so weird?</p>\n<p>Keith continued being weird. He wasn't looking at Lance, like the idea of making eye contact was so reprehensible the humiliation would make them both explode the moment their eyes met. “Uh...” Why did this suggestion warrant so much considering? Was Lance really so awful that the idea of spending ten minutes together needed this much deliberation? Wow, that felt great. “Yeah, okay. Let's... Go for a walk.”</p>\n<p>So as you can see, the whole thing had started out weird from the get-go, and Lance couldn't REALLY be blamed for not noticing what was wrong with this picture. Or the exact opposite and Lance should have realized immediately what was going on from this first conversation.</p>\n<p>Either way, for all that the process of asking had been like pulling teeth, the walk itself went surprisingly smooth. Probably because they didn't actually speak to each other. Which Lance decided not to push, for once. He could still remember when Keith had been in the garrison with them, had been watching him apparently unnoticed for all the arguments they'd had, and in all that time he'd never seen Keith make anything even loosely resembling a friend. And more than that... Training to combine Voltron, they had all seen inside each other's heads just a little bit. And in those glimpses of Keith's mind Lance had seen the inside of a cockpit and a quiet shack with a warm bed but no <em> people </em>. So, if the dude had a hard time relating to other humans, Lance could at least make an effort to respect that, right?</p>\n<p>And that must be the problem, because even in the comfortable silence they shared Keith still managed to be awkward. His body language had never really recovered, so instead of his usual confident stride he was ambling slowly with slouched shoulders that made him look smaller than usual. But mostly it was the fact that he kept glancing up at Lance periodically, expectant look in his eye like he was waiting for Lance to say or do something with just a touch of what he almost wanted to call shyness. Except that even with no people skills this was still <em> Keith </em>and that made no sense. Curiosity, maybe?</p>\n<p>Eventually, Lance had to say something, if for no other reason than to break the monotony of their footsteps. “You seem nervous,” he commented stupidly.</p>\n<p>Keith hummed looking, if possible, more awkward than ever. “I guess a little. I've never, uh... Never been. You know.”</p>\n<p>No, he did not know, and never WOULD know what Keith was talking about because he never finished any of his damned sentences. “Of course,” Lance lied soothingly. “It's alright, I don't mind. I mean, we're just taking a walk, right? No pressure.”</p>\n<p>Keith, at least, managed to look a little relieved at the words, which, what the hell even if he didn't know what was actually going on at least Lance has stumbled on the right thing to say for once. He'd take whatever little victories he could here.</p>\n<p>So, it seemed like when it came to one-on-one interactions Keith was actually kinda shy, even if he had no problem throwing jabs at people he could barely remember and giving orders to complete strangers. Lance could understand that – people told him he was different when he was alone, too; Hunk had said multiple times that Lance was less annoying when he had no one to try to impress, which, WHATEVER, he was awesome. And he could deal with shy people, he'd done it before. His little cousin Jackie was the shy bookworm type, and he'd learned with her that all you have to do is lead the conversation and not get offended by one-word responses.</p>\n<p>“So, what kind of hobbies do you have?” Lance paused. “Or did you have, I guess, back on Earth.”</p>\n<p>“Uhhh...” Keith's brow furrowed, and it was probably not a good sign that this question took so much effort to answer. “I guess tracking down the Blue Lion was kind of a hobby, but. I kind of finished that.”</p>\n<p>Wow. What an answer. Way to work with a guy, Keith. This was going to be harder than he'd hoped. “Okay, but other than that. What kinds of things did you do in your free time?”</p>\n<p>The other pilot shrugged. “I don't know, mostly study? I never really had a lot of free time.” There were a few beats of silence as Lance allowed him as much time as he needed to elaborate. “I lived alone, so there was always something that needed to be done like shopping or cooking and cleaning or fixing things that went wrong.” He hummed little bit as he thought about it. “Actually, that part was usually kind of fun. I had to learn a lot about plumbing and roof tiling,” he finished cheerfully.</p>\n<p>“I see,” Lance said. “So your hobbies are cleaning the house and learn how to fix things?”</p>\n<p>Keith considered the question. “Yes.”</p>\n<p>“Wow, no wonder you seem to have no idea what to do with yourself up in space.”</p>\n<p>“I <em> like </em>space,” Keith defended.</p>\n<p>“Yeah, I noticed. You seem to like space the most out of any of us, actually. But I still haven't figured out what you do for <em> fun, </em> man.”</p>\n<p>This, at least, finally made Keith pause. “I have fun,” he said weakly after a while.</p>\n<p>Lance just leveled him with a flat look.</p>\n<p>“Well I've gotta be more fun than Shiro, at least.”</p>\n<p>“Sadly, I can honestly say you are not, because if that were true I would not owe he and Pidge four hundred dollars gambling on a game they made up using old Altean keyboard keys as tiles.”</p>\n<p>Keith looked both impressed and horribly depressed at this statement, his walk slowing down to a stop. “Oh. Am I actually so... Seriously boring?”</p>\n<p>Lance clapped a hand on his shoulder. “Nah, dude, I'm never bored when you're around,” he promised. Mostly because he was usually angry at him, but hey! Angry isn't bored! “You just aren't good at having fun yet.” He grinned, “Fortunately you're talking to the right man to teach you.”</p>\n<p>Keith looked supremely unimpressed. “All of your ideas are terrible, though.”</p>\n<p>Being a generous and benign person, Lance ignored that.</p>\n<p>Approximately ten minutes into their first day and space, Lance and Hunk and gotten bored and pestered Coran and Allura into finding them something to do that didn't still count as work like all of Shiro's suggestions. They had directed them to the playroom of the ship's daycare and nursery. This might seem offensive to one who did not recall that the paladins had gotten their asses handed to them by a training droid set for Altean children, and as such many of the toys were appropriately terrifying.</p>\n<p>“This one is like darts except more javelin-y, this one's like a skip-it but it weighs fifteen pounds and and ball gets hot and glows, that one's the squish toy Hunk had his hand stuck in for two days...” Lance rattled on, pointing to various implements scattered around the cheerfully-colored room. “And this,” he picked up a lightweight plastic hoop and began spinning it around his hand. “Is just a hula hoop. Turn out they're universal. Who'd have thought?” His innate need to show off shining through as usual, he popped the hoop up into the air mid-spin and caught it around his neck, less graceful than he'd have liked but still managing to maintain its spin.</p>\n<p>He had managed to impress Keith a little by the look on his face, but it looked begrudging and mostly baffled. “I've seen you trip over Pidge in the middle of an empty room, why are you good at <em> that </em>?”</p>\n<p>Lance let the hula hoop drop down to his waist because as impressive as it looked holy CRAP that trick hurts your neck. Hula hoops are not designed for faces. “This is nothing. I grew up with so many little girls man, you don't even know. Hopscotch, yo-yos, hula-hoop, I can do it all.” He finally let the toy drop to the ground. “I got so good at jump-rope that the little nieces stopped asking the older girls to teach them tricks and all come straight to me.”</p>\n<p>Keith snorted an aborted laugh through his nose, smiling openly. “A feat to be jealous of,” he retorted back with a bite of playful sarcasm. He looked around the room, poking a plain-looking white disc that was actually a truly awful Simon Says game that makes you guess the next color in the pattern it's presenting and shocks you if you're wrong. “So this is what you guys do all day?”</p>\n<p>“I actually spend a depressing amount of the day cleaning with Coran,” Lance answered flatly. “But yeah, this sorta ended up being where we hang out, since all of my original ideas apparently 'carry an inordinate likeliness of blowing up the spaceship.'” He mocked with air quotes and his best impression of Allura's accent. “Which, how she does she even keep finding out? Either Hunk is a tattle-tale or Allura is omnipresent, and both seem just likely to me.”</p>\n<p>He was rewarded with the closest thing to a smile he'd wrung out of Keith for... Probably the entirety of their relationship so far. So... Victory! “I'd believe either.”</p>\n<p>“Yeah, so...” Lance gestured with sarcastic grandness at the room. “This is the most interesting thing we're allowed to do on the ship. Space is vast and terribly boring, and that's why I don't think you're a bore. Because space makes EVERYONE boring. It's what space does. Bore people for millions and millions of empty light years and then kills you with lasers.” He set his foot on a hard palm-sized ball that was part of a strange shotput/skee-ball chimeric monstrosity of a game.</p>\n<p>“Yeah but on the turnside? <em> We get to fight with lasers </em>. In SPACE.”</p>\n<p>Lance laughed, kicking the ball at Keith's ankles and ignoring the secret part of him that wanted the ball to smack the other pilot in the ankle and trip him because Lance was better than his petty subconscious. Especially since Keith caught it with his foot anyway and popped it up to catch in his hand like it was a hackey-sack. “Kind of feels like a pool ball,” he observed, turning it in his hands.</p>\n<p>Lance shrugged. “I guess so? I mean, it doesn't explode or anything.”</p>\n<p>“No, I mean,” Keith looked at him meaningfully, nodding towards the pile of similar spheres on the floor next to them. “It <em> feels like a billiard ball </em>, you know?”</p>\n<p>Lance looked down at the heap of balls and, for once, understood what Keith was saying perfectly.</p>\n<p>A half half hour and a scavenger hunt later saw the two of them arguing over the best way to cut six holes into the surface of a vaguely porous tabletop, which was actually a lot more fun that most of their usual less-friendly debates.</p>\n<p>“Oh for god's sake, you're not using your bayard's sword!” Lance slammed a hand on the table. “The holes would end up way too big!”</p>\n<p>“No they wouldn't be, my precision is totally perfect!” Keith spat back. “And if your idea is to SHOOT the holes into than let me tell you right now-”</p>\n<p>Lance clicked his tongue, cutting off the other pilot. “I've got better ideas than that! I'm just saying, it's freaking SPACE, they probably have specialized tools for this kind of thing like light-saber hand saws!”</p>\n<p>“Well do you know where any lightsaber handsaws ARE?”</p>\n<p>That gave him pause. “No. The closest I can think of is Shiro's terrifying cyber-hand.”</p>\n<p>They looked at each other for a moment. And, because it was only the two of their stupid asses with no adult supervision available, couldn't think of any reason asking Shiro to abuse his robot arm dismantling a table could possibly not work out.</p>\n<p>Until they saw the look on his face anyway. “You want me,” he said slowly, “to cut half a dozen holes into this table. So that you can use it to play pool.”</p>\n<p>Lance and Keith exchanged uncomfortable glances, the distinct feeling of standing before your teacher and being asked why you thought it was a good idea to splatter paint on the shirts of every single girl in class. Or maybe that was just Lance. Either way, Keith was the one to speak first, weakly offering “We found billiard balls, so it seemed like the next step?”</p>\n<p>Shiro sighed a little. “So what, the balls can fall to the floor? And what was your plan for the side bumpers?”</p>\n<p>Lance gave a helpless shrug of his shoulders. “I don't know, nets or something? We're kind of winging it here.”</p>\n<p>Luckily for them, Shiro turned out to be just as goddamned bored as everyone else on the ship. “If you're going to build a pool table,” he said decisively, “then we do it<em> right </em>.”</p>\n<p>Thee next three hours were well spent in dedication to the crafting of a blackball table out of whatever kind of unused space junk they could find laying around. Shiro, to absolutely no one's surprise, was almost nonsensically competent and apparently understood the interior design of a pool table off the top of his head, and an almost terrifyingly short amount of time later saw the five paladins each fashioning themselves cues out of whatever pipes and mysterious rods lying around suited them best.</p>\n<p>“So: standard eight-ball, we split into three teams, one of which is Shiro by himself because I don't trust his robot arm,” Pidge started with decisive command.</p>\n<p>“I call Pidge on my team!” Lance snapped before anyone could stop him.</p>\n<p>“<em> Dude, </em>” Keith sounded righteously offended, which, when Lance thought about it, sort of made sense. They'd been hanging out together before this and the entire pool idea had been the two of them, right? It'd be kind of a dick move to ditch him at the last minute.</p>\n<p>“Right, good point.” He slung a friendly arm around Keith's shoulder. “Besides, with the two of us together there's no way we could lose!” He boasted with fictional confidence.</p>\n<p>They lost. Horribly. But that was okay because Pidge and Hunk didn't win either, as no one could figure out a rule that would give Shiro enough of a handicap to knock him back down to normal human levels of competence. But even with the wretched defeat they suffered, Lance had a hell of a good time and he could tell everyone else did, too.</p>\n<p>In fact the whole day had been a good time. Lance really had been surprised at how well he and Keith had gotten along; even when they'd argued it had been sort of fun instead of frustrating. So it had only seemed natural that even after the guys had all split up and wandered off to bed, Lance had still ended up with Keith, walking back to their rooms and chatting amicably.</p>\n<p>“You had to have watched TV though, right? EVERYONE watches at least once in awhile. Pidge won't admit it but he's totally hooked on trivia game shows, I've seen 'em shouting answers at Millionaire and cussing out Jeapordy.”</p>\n<p>That managed to pull a little chuckle out of Keith, which as far as Lance was concerned was his greatest accomplishment of the day so far. “Yeah, I watched television sometimes. It's good background noise, if nothing else.”</p>\n<p>“See, now we're getting somewhere!” Lance grinned, lightly knocking his shoulder against Keith's as they walked. “So, what kind of shows do you like? Trading Spaces and documentaries?”</p>\n<p>“Uhhh,” Keith suddenly looked a lot more hesitant to answer the question. “Yes. Documentaries.”</p>\n<p>Lance raised an eyebrow. “Oh?” Leaned over to peer at Keith's face, and when Keith turned his head away to avoid eye contact grinned and circled around to his other side to leer into his face. “What k<em> iiiin </em>ds?” He asked, injecting his voice with all the teasing childishness he'd learned from combined years of little siblings and cousins.</p>\n<p>Keith looked appropriately disgusted at the tone, but at least recognized the intended message of 'I will pester you into telling me' Lance was trying to convey. “Normal kinds,” he answered with forced casualness. “Ghost hunting and UFOs Declassified kinds.”</p>\n<p>Which was of course, the best thing Lance had ever heard in his entire life. “Alien conspiracies?!” He gasped in delight. “You watch shows about <em> alien conspiracies? </em>”</p>\n<p>Keith sputtered, “It's not,” he huffed in frustration, before turning on Lance and spitting “It's not ridiculous if ALIENS ACTUALLY EXIST!” He made a grand sweeping gesture at the spaceship around them. “And since I was CLEARLY right about that, there's no reason not to believe that some of these ten thousand year old aliens couldn't have been responsible for the pyramids when you consider they align perfectly on a grid with other megaliths like Easter Island and the Nazca within one tenth of a degree in latitude-” he cut himself off, red instantly flushing red with embarrassment. “And you probably watch garbage shows like Jersey Shore anyway!”</p>\n<p>“I certainly do not!” Lance defended dramatically. “I watch garbage shows like Project Runway and Top Model.”</p>\n<p>There was a beat of silence where Keith just stared at him, jaw dropped and eyebrows comically staggered. And then the most surprising thing ever happened and Keith started <em> laughing </em> . Actually really laughing, and maybe it was just the fact that in all the time they'd known each other he'd never heard it before, but Keith had an a <em> wesome </em>laugh. Kind of husky and raspy like his throat wasn't used to such a strange action, and Lance was pretty sure being the first person to make Keith laugh in the history of forever made him the coolest person to ever live. Just saying.</p>\n<p>Lance was almost disappointed when they eventually made their way to Keith's room, which considering his entire goal for the day had been 'don't punch him' was more than a little shocking. He'd had a really good time hanging out together.</p>\n<p>He might have said as much, but Keith beat him too it. “I, uh. I had a great time tonight,” he said as he lingered in his doorway, that odd shyness returning at the last moment.</p>\n<p>“Yeah,” Lance gave his best charming smile, Keith's sudden nervousness proving infectious. “We should do it again sometime.”</p>\n<p>Keith was still standing in the doorway, looking up at Lance like he was waiting for something What that was Lance couldn't begin to imagine, and everything was kind of getting more awkward by the second the longer he stood there trying to figure it out. Halfway to panicking, he did the first thing that came to mind, which was the unfortunate decision to ruffle Keith's hair like he was patronizing a child.</p>\n<p>Keith, understandably, looked confused beyond measure at the action.</p>\n<p>“Wow, that was weird.” Lance said, snatching his hand away and backing up a few steps. “I made that weird.”</p>\n<p>“Yeah, you really did,” Keith agreed, smoothing out his mussed hair at looking at Lance like he'd grown a second head that had immediately warned him to watch his back the second it sprouted.</p>\n<p>“Right, I clearly should not have done that.” He turned around, pointing at the empty hallway. “I'm gonna go now.”</p>\n<p>Keith nodded, calling out a soft bemused “Goodnight,” at the closing door.</p>\n<p>So obviously, as Lance had mentioned, the plan was a total baffling success. He and Keith really got along well after that, and not just in their free time. They worked smoother together in training and in combat, and even their (only slightly) less frequent arguments felt lighter; even fun on occasion. Keith, to his total surprise, turned out to be completely freakin' cool.</p>\n<p>They spent a lot of time together after that. Keith must have just needed that little nudge to open up, because he wasn't nearly as much of an ice queen as he seemed at first impression. He was warm and funny and almost astonishingly willing to spend time with Lance, which turned out to be something Lance was not used to. Never mind friends, Lance had siblings and ex-girlfriends who enjoyed his company less than Keith seemed to, which didn't even make sense. It was awesome, but. No sense.</p>\n<p>And also this was where the weirdness started to kick in. Not just the fact that Keith seemed to like him as a person, which WAS pretty strange by itself, but. Like, WEIRD weird, okay? Like, do-you-understand-how-human-friendships-work kind of weird.</p>\n<p>Alright, so eventually Coran found out that one of the lounges in the castle still had a working entertainment center, including a buttload of old Altean movies. Approximately five minutes after this discovery, the first Movie Night was officially declared, and everyone was piled into the room and spilled over moderately comfortable couches.</p>\n<p>Coran got to pick what movie they watched first, half because he found the stash and half because only he and Allura had any idea what the hell Altean movies were like anyway. He picked a comedy. Comedy, it turns out, is very subjective to culture. Coran and the princess were busting their gut at the antics onscreen while the five humans struggled to follow the plot, and by the end of the movie the best compliment anyone could come up with was “I learned a lot about ancient Altea.”</p>\n<p>“Tragedy is universal,” Lance declared when it was time for Allura to change movies. “So you should find us an action flick. Sword fights and <em> explosions </em>kind of tragedy. We could ALL appreciate that.”</p>\n<p>She considered this. “Universal appeal, huh?” And then, because she was in fact very much a girl, picked an action movie that was still mostly romance. To be fair, she was right about romance being universal too, so no one could complain.</p>\n<p>In fact fifteen minutes in it was already proving to be better than that weird “comedy” Coran had subjected them to, and Lance made himself comfortable by settling against the arm of the strange pleather space furniture, stretching out his legs. Keith had been sitting next to him the entire night so far, so the sudden weight of another body leaning against him didn't come as any real surprise. Except maybe for the fact that it was like. Keith cuddling on him? Sorta? Well, no, it was more like just leaning against his side. He was probably tired; didn't seem like the kind of person who could sit still for two entire movies without falling asleep. He wasn't even the only one: over on a loveseat Shiro had fallen asleep hours ago, splayed unconscious across the small couch practically the instant he stopped moving and sat down. Shiro, it seemed, had only three states of existence: At work, unconscious, and full PTSD.</p>\n<p>Not to mention on the other end of the long couch they were on now, Pidge was splayed out half upside down with their legs on Hunk's lap, and not a single one of them had thought it was strange for a moment because everyone cuddled with Hunk all the time. The guy was practically designed for it. So if Keith thought it was cool with leaning on him to take a nap, then it wouldn't be weird for Lance to just move that arm his friend was pressing against awkwardly a little bit to change their position. He tired to sling it over the back of the couch, but the back was a little too low for that – probably why Keith couldn't just lean back to snooze in the first place – and he wound up with his arm around Keith's shoulders. That ended up making it a lot more like cuddling, but at least now they were both finally comfortable, so screw it, right?</p>\n<p>Even if, yeah, in the end he could tell that as relaxed as he was Keith never did end up falling asleep. But that was mostly because the guy kept shouting opinions at the screen whenever one of the pilots in the movie made a move he considered 'completely moronic', or 'not how spaceships worked,' which was oddly sort of endearing to Lance and they were probably spending too much time together, weren’t they? It was still kind of nice, cuddled together like this. Keith, warm and only slightly bony curled against Lance's side, the steady rise and fall of his breath just a few hairs off rhythm with his own. Lance couldn’t have complained if he wanted to.                                             </p>\n<p>So that was probably what started all of the weirdyness, and from there it only escalated. Well, okay, the next one Lance could admit was all on him.</p>\n<p>So since they'd been spending all that time together it wasn't unusual for the two of them to hang out in one of their rooms and just do nothing with each other. One of these times was just after after a grueling session on the training deck where Lance may or may not have abandoned Keith and Pidge to be exploded by lasers while he hid behind Hunk, but that's neither here nor there because they were all friends now and friends forgave each other and anyway he’d TOTALLY sniped that gladiator’s feet out from there so he wasn’t even wrong in the first place. So it was after that and Lance followed Keith back to his room to make sure he wasn't still mad, and it he wasn't, and it was all cool and normal.</p>\n<p>Lance had thrown himself onto Keith's bed when they walked in the room, continuing to ramble on the conversation they'd been having in the hallway while Keith hung up his jacket and cracked his neck. And then he'd grabbed a comb to start brushing his hair, which made sense since it had gotten all sweaty and helmet-mussed while they'd been running around like mentally disadvantaged chickens. What DIDN'T make sense was what Lance did, which was to offer “Hey, can I brush your hair?”</p>\n<p>And what made the least sense of all was Keith, who's reaction was for some reason an almost immediate “Sure, if you want,” instead of 'What, why would you ask that' or even 'No I think I can handle it by myself,' which would have been more logical reactions to Lance's insane spontaneous outburst.</p>\n<p>Keith handed him the comb and sat down on the bed in front of where Lance was sitting, scooting back in the bunk until Lance had to open his legs to make room for him to sit between. With Keith sitting so close and the wall and low ceiling closing the space around the bed the atmosphere in the room ended up pretty intimate, and Lance was almost nervous when he brought the comb to Keith’s dumb fluffy mullet. And then Keith sighed a bit as the plastic teeth dragged against his scalp, and sound was… Embarrassing, Lance decided. He was embarrassed for them both.</p>\n<p>Keith’s waist was thin and his hips were slim and he fit in between Lance’s thighs easily, so easily that all he had to do was relax his spine and tip his head forward and they ended up with their bodies pressed together. Well, the red paladin had already proved himself to be a very tactile person once he let his barriers down, and Lance HAD asked to brush his hair of all damned things, so this was really to be expected.</p>\n<p>Realistically, it only took a few seconds to comb Keith’s mane free of tangles. And Lance could probably have used that as an excuse to stop, but he just sort of kept brushing instead, slowly and meticulously raking the comb through his dark hair. The tips of his fingers were just barely touching the soft ends of Keith’s hair on each pass, and of course it was soft he KNEW it’d be soft because he’d friggin’ actively spent time wondering about it before and yes, Lance had no choice at this point but admit that the desire to do this had not been spontaneous so much as it was recurring.</p>\n<p>By now nearly three minutes had passed of Lance pointlessly combing Keith’s already-perfect hair, but any incentive to stop was killed by a pleased hum rumbling from Keith’s throat as he tipped his head back. The exact thought that passed through Lance’s head at this moment was ’Ah, screw it,’ and he gave up all pretense of not playing with Keith’s hair by dropping the comb and raking his fingers through Keith’s bangs to brush them back out of his face.</p>\n<p>UGH, so <em> soft. </em> Keith was the worst. Stupid gorgeous-haired pretty boy, what was even up with this guy. Seriously, like, why was he just letting Lance pet his head like this? They were both insane. And Lance needed girls he wasn’t terrified of in his life.</p>\n<p>Keith, because he had lived his entire life alone and had apparently developed a desperate thirst for human contact, went from relaxed to downright liquified, melting against Lance’s chest like a boneless cat. His head dipped back to lean against Lance’s shoulder, and all Lance could think to do was keep stroking his fingers through the side of Keith’s hair he could still reach, his left hand hovering awkwardly in the air next to Keith’s waist for a moment before dropping down to settle on the bed.</p>\n<p>They stayed that way for a long time, though how much time actually passed Lance couldn’t say. Eventually they had to get up, because for as much free time as space provided they did still have crap to do, and he guessed Keith couldn’t help but make fun of Lance a little bit here because when he sat up he stopped for a second to peck a quick kiss on Lance’s cheek, obviously teasing Lance with the message that if he was gonna act like a little girl at a sleepover by asking to braid Keith’s hair Keith could play that game too. Yeah, kinda deserved that one.</p>\n<p>The stupidest part of this, he would later reflect, was that sitting in that silence with Keith’s head on his shoulder and his hand in Keith’s hair was the most peaceful moment he’d had since coming to space, and remained so for a long time to come.</p>\n<p>After that was the time when they were about to land on this planet that was strategically important to free from Galra influence, and were orbiting one of its moons while they finished up gathering the information they’d need to attack. It was a pretty tense time all around, but for the most part there was nothing anyone could do until Pidge’s dumpy little stolen droid got back.</p>\n<p>Lance of course, was determined to lighten the mood for whatever short duration of peace they had. Keith was liable to work himself into a coma on the training deck if left to his own devices, and the least Lance could do was distract the fool so he didn’t pass out in the cockpit of his lion when it was actually Go Time.</p>\n<p>So they went for a walk around the castle for a while, until they found an unlit hallway with a huge window currently overlooking the planet they were going land on with a nice view of moon they were orbiting taking up the left half of the window. They sat down there in the dark, side by side facing the moonlight with just enough space between their bodies for their pinkie fingers to be resting against each other.</p>\n<p>“Bigfoot?” Lance asked.</p>\n<p>Keith shook his head. “Guy in a costume. Real yetis have been extinct for centuries.”</p>\n<p>“Loch Ness monster?”</p>\n<p>“Even if the guy hadn’t admitted to the hoax, it’s. It’s a lake, you can’t actually hide an entire sea monster in a lake.”</p>\n<p>“Okay… Chupacabras.”</p>\n<p>“The goat-sucker?” Keith scrunched up his nose. “I don't know man, that's all. You keep asking about cryptozoology and that is just not my field.”</p>\n<p>“Oh, I see,” Lance said a bit too quickly, the words slurring together into ‘o-icy.’ “So you're more the government conspiracy type, then?”</p>\n<p>This finally got more of the reaction Lance had been going for. “Yeah,” he started, voice raising in pitch. “Because once again I've already been PROVEN RIGHT on that!” The conviction and fire in his voice sparked up instantly, like turning on a deranged pilot light. “You were there when Shiro landed, the military was all over him in seconds and sedated him when he tried to warn them about the Galra!” Which was a fair point, actually. “No to mention all of the other government cover-ups that the press already <em> did </em> manage to prove true, like the Nixon assassination plot and the erased Tulsa race riot!”</p>\n<p>Lance grinned to himself, having finally gotten Keith fired up in a tangent like he’d been hoping. “So then Area 51..?”</p>\n<p>“Now that’s what’s interesting,” Keith started excitedly, “you see the original ‘47 crash was just an air force surveillance balloon, and when the UFO rumors started up the government actually encouraged them in order to hide the truth from the soviets they were using it to spy on. But then when they later admitted it was just a military balloon, the reason was to throw suspicion off of the area and because by then they really WERE using it to cover up all of the alien incidents that really HAD happened by then, and were using Roswell’s reputation as being a town full of alien fanatics to make them all look like crazy people when they try to report strange incidents nearby. It’s completely genius, by admitting to the hoax the dismissed the possibility of any future conspiracies being brought to the public’s attention!”</p>\n<p>Lance had to actively suppress his glee, gently goading Keith with “So, what kind of things are they hiding in Area 51 then if there was no UFO crash?”</p>\n<p>“Well for one thing, that’s where they staged the original moon landing. They didn’t have the technology to safely bring a human back from the moon until the eighties, and Nasa didn’t bothering sending anyone or anything to plant the American flag up there until the early nineties when no one was paying attention to space travel anymore!” He paused to take a breath of air, stopping in his rant to suddenly look embarrassed. “How… Why are you asking me about this kind of stuff, anyway?” He gestured towards the window, two moons and the blue-violet glow of the planet providing the only light in the darkness of space. “It’s not like any of it matters anymore.”</p>\n<p>Lance shrugged. “I like listening to you talk about stuff that interests you. You’re really…” Fun to rile up. “Passionate, you know? It’s…” Entertaining to watch you rail on with all your hand gestures. “Nice to see you get all enthusiastic over stuff.” And also when you’re mad your nose scrunches up like a bunny and it’s like my favorite thing ever.</p>\n<p>He had either said something very strange or once again stumbled on the right thing to tell Keith by accident, because the red paladin turned bright cherry in a blush and stuttered “Oh. Uh…”</p>\n<p>And as great as Embarrassed Keith was he had a severe problem with actually finishing sentences, so Lance took it upon himself to change directions. “Also I don’t know anything about that sort of thing. The closest I’ve ever come is that one Halloween where my cousin Javier invited me and my sister to come to the graveyard with he and his friends to hunt ghosts, but it turned out just to be an excuse for them to drink beer and make out with each other. Me and Gwen were only like thirteen at the time, so we ended up sneaking around the cemetery trying to scare the older kids while they were off by themselves in pairs.”</p>\n<p>Keith snorted, a chuckle caught in his throat. “Why did he even invite you then?”</p>\n<p>“‘Cause me and my sister wanted to hang out with him?” He gave another shrug. “Like, when you’ve got a huge family like we do you just get used to some little sibling or cousin always wanting to tag along. Dragging a preteen with you when you hang out with your friends is like, how we pay our dues because at one point we were all that kid, too, you know?”</p>\n<p>“I guess I can imagine?” Keith said hesitantly. Which, of course he didn’t know, Keith didn’t <em> have </em>a family. Couldn’t have ever been the little brother trying to be cool with the big kids, wouldn’t have had someone to indulge him with the nod to his friends and the words ‘Don’t mind him, he’s cooler than he looks.’ And yeah there were times when Lance would have given his left foot for five minutes by himself but he still wouldn’t give up his massive annoying family for the world, and the thought that Keith had never had that kind of ubiquitous affection in his life was… Kinda sad.</p>\n<p>“You’ll have to meet them sometime,” Lance decided suddenly. He turned to look Keith in the eye. “My family, I mean.”</p>\n<p>Keith’s eyebrows raised, but he didn’t look as dubious as he honestly should at the prospect of meeting such a menagerie. “Seriously?”</p>\n<p>“Sure, they’ll love you.” They would more than love him; they’d adopt him as one of their own in two minutes. It had happened to when Merle brought home his friend Gene with the lousy dad; Gene had been as good as an extra sibling after that with how Moms had insisted he come over whenever he needed to get out of his house. Not to mention their oldest brother Artie’s wife, who had been attended every Thanksgiving in their house for years before they’d even officially started dating. With Keith’s big pretty eyes and tragically lonely past, they’d be have him swaddled in blankets with a plate of cookies on his lap before he even got a chance to take his shoes off. “The reason my family is so big is we get crazy attached to people. Like seriously, Grandma and Hunk have each other’s phone numbers and they’ve never even <em> met </em>. You’ll fit in so well no one will even notice the extra person in the house.” He paused, narrowing his eyes. “We might need to keep you away from Gwen, though. She’s only eight months older than me because I showed up early, and her personality is…” A viper in a push-up bra. “Sort of like me, but times five and in a miniskirt. So she’d definitely eat you alive.”</p>\n<p>Keith did not look appropriately horrified by the idea. Keith was for some reason, smiling warmly at Lance like the opportunity to meet his handsy not-twin was some kind of gift instead of the awful horrorshow the idea actually was. Geeze, did the idea of a family really mean that much to the guy?</p>\n<p>It must have, because the next thing to happen was Keith leaning over to close the space between them. It was as much as a kiss as it was Keith whispering the words “Thank you,” so quietly against his lips that if weren’t for the warmth of Keith’s breath brushing against his skin Lance might’ve thought he imagined them.</p>\n<p>When Keith pulled away he looked nervous. Prooooobably because of the dumb-stuck look of shock on Lance’s face. Uneasily, he asked “Uh, was that… Should I not have…”</p>\n<p>And to his credit, Lance’s FIRST thought was ‘Oh no don’t look like that, those puppydog eyes are gonna be the death of me.’ But it was really the next thought after that that did him in, which was the lizard-brained logic directing him ‘dude someone hot just kissed you make out with them right now before they change their mind.’ And so before he knew what he was doing, Lance was sputtering out a rapid “S’cool, just surprised,” and sitting forward to put a hand on Keith’s cheek and use it to draw him into a long, slow kiss.</p>\n<p>When they pulled away from each other Lance couldn’t be bothered to spare any kind of thought on how gay that had just been, ironically far too distracted by the uncharacteristically gentle look on Keith’s face and how goddamned <em> pretty </em> it was. Seriously, how could a guy be this gorgeous? Like, Pidge was actually girl-shaped and didn’t manage to be <em> half </em>this cute.</p>\n<p>There wasn’t any time to think about it, because it wasn’t long after that it the mission started. After that was a full nineteen hours straight of unbearable intensity where there wasn’t really time to think about the kiss(es) other than the fleeting notion that that had been really, really gay before he had more important things to consider, like imminent death on all sides. Stupid Pidge and her stupid need to liberate every single prisoner colony they could find. Okay it wasn’t stupid, because they were saving people or whatever, and would eventually be even LESS stupid when they actually did find his crappy brother, but. You know. It was still a lot of damned work. And that wasn’t even mentioning dumbass Mullet-Head and his inability to hold himself back from SUICIDE RUNS because that was never stressful for <em> anyone </em> involved, <em> WAS IT, KEITH?! </em></p>\n<p>It was of course, ultimately worth the stressful nineteen hours trapped in the cockpit of his lion. They did save like, eight hundred alien prisoner in less than a full day, which you had to admit was totally badass. They didn’t throw a parade or anything, but everyone seemed pretty grateful which counted for something. Even if it meant now began the long process of getting everyone back to their homes, and in the cases of many of them finding new places for the ones whose home plates had been destroyed, which proved true for a depressingly large number of ex-prisoners. No one was disheartened by their homelessness, though - the mood of everyone was light and warily relieved, something loosely resembling a celebration taking place as they all worked on commandeering Galra tech for people to start setting off in.</p>\n<p>There was one particular moment that stood out to Lance from that night, one short exchange of dialogue that he could remember even in the sleepless blur the last ten hours of his life had become. It had been some of the first prisoners released in the raid, and alien refugees were scattered all around the deck of a Galran command center, laughing and embracing in celebration of their freedom. Lance and Shiro had wound up caught in the middle of the revelry, and since it was the first time in about fifteen hours either of them had time to catch their breath without threat of imminent death the second they let their guards down, they took advantage of it by basically standing around staring dazed at the chaos. In front of them, a gilled and finned aquatic alien was caught in a lover’s embrace with a bird-like man covered in feathers, and Lance could remember the thought that if they could fall in love without even being the same species the obstacle that they were both dudes had probably never occurred to them for a second. Bigger issues, right?</p>\n<p>Next to him was Shiro, who by Lance’s calculations was now running on thirty-five straight hours with no sleep because he was Shiro and could not be stopped, had an entirely different perspective. Rather poetically, Shiro’s first thought at such a scene was to quote “‘A fish and a bird may indeed fall in love, but where would they make their home?’”</p>\n<p>Lance didn’t say anything for a moment, lost in the jubilation of the once hopeless crowd around them. And then, because he was an ass, answered with complete sincerity “Space, apparently.” But at least it’d gotten a laugh out of Shiro.</p>\n<p>So as he’d said, the better part of that twenty-four hour period was a blur to Lance. He didn’t remember eating but was somehow sure he had, didn’t remember flying or getting out of Blue but had ended up back in the castle. Wasn’t entirely certain how or why Keith had ended up in his room with him, but hey while he was there Lance might still have a few choice words for him about that utter disregard for his own safety and how it kept giving everyone freaking heart attacks. After a nap, though. Before anything else Lance was getting some sleep, and if Keith wanted to stay in here with him while he did so Lance officially did not even care anymore.</p>\n<p>His plans were quite upended when Keith sat on the bed with him when he was about to lie down, and before Lance could ask what his plans were on that Keith had crawled practically into his lap and was pressing a forceful kiss against Lance’s mouth. Keith, as it turned out, did not know how to kiss. And yeah Lance didn’t honestly have as much experience in the field as he may like others to believe but he HAD at least made out with someone before, so he instinctively carefully caught Keith’s tongue between his teeth to stop it where Keith was trying to cram it down his throat and gently started sucking on it, one hand tangling in Keith’s hair to direct his head to a better angle.</p>\n<p>At some point it did once again occur to Lance that this was really gay, but… He was tired, and Keith was beautiful and relaxing in his arms instead of trying to eat his face and he’d almost DIED that day <em> AGAIN </em> and Lance couldn’t do anything about it because he <em> never </em> could, and… And like, a fish and a bird, right? They’re in <em> space </em>. If there’s a time and place where queerness doesn’t matter it was definitely out here.</p>\n<p>Sooooo. That was sort of. Not even the only time they made out, after that. Which is where Lance could honestly admit he had definitely screwed up. He really, REALLY should have thought about this more, but he’d he’d been sort of casual make-out buddies once before with a friend of his sister and had honestly figured this was something like that. After all, Keith was a really touchy-feely sort of person once he opened up, like one of those bitchy cats that only liked one person or something. This was just some kind of weird extension of that, right?</p>\n<p>Yeah, obviously this did not turn out to be the case. Lance was an idiot, and he was honestly shocked it took as long for the shit to hit the fan as it did, because this had been a disaster cooking from day one and the oven had to explode eventually.</p>\n<p>They were in Keith’s room again, sitting on the floor playing a card game they’d been able to mostly translate into Diamondback as Lance told another story about his family because he couldn’t think of a single event from his Garrison days he’d be able to twist to sound flattering.</p>\n<p>“So at this point I’m already running twenty minutes late with no sign of Aunt Pilar and I can’t even FIND one of her kids, right? And suddenly my little brother Percy comes running in and dives right into my chest, sobbing against my shirt about how the girls had ganged up on him. I pry him off of me to see his face is all smeared in this awful makeup he’d half cried off, because our freakin’ cousins had gotten to him with the beauty kit they’d been playing with. I don’t even have time to try to deal with that because forty seconds later Gwen finally shows up to take over babysitting like she promised, even though she SHOULD have taken them when she got home ten minutes earlier instead of insisting she needs a shower before she does anything. I shove Percy at her and dash out the door, and I’m going at like a full run until I finally make it to the restaurant where I was supposed to meet with Monique, right? She takes one look at me, a half hour late with lipstick on my shirt just REEKING like sweat and cheap perfume and she just shakes her head and says ‘Yeah, this has been fun, but Dario’s been tryin’ to hit me up for a while and I just decided I’m gonna go to his party tonight after all.’”</p>\n<p>Keith raised an inquisitive brow. “So she just broke up with you? Didn't even stop to hear you out before she was off with another guy?”</p>\n<p>Lance waved a dismissive hand in front of his face, flipping over one of his cards. “Monique is not even the worst part of this story, dude. So I pay her bill and trudge home like an idiot, and when I get there I tell Gwen that my girlfriend just broke up with me. And she doesn't even look up from where she's filing her nails, just says 'That bitch thought she was too good for you anyway,' like that settles everything. Which is ridiculous because being with someone who's better than you is like, THE GOAL of dating, that's what you aim for in a partner, and I tell Gwen that and she just rolls her eyes and that's when Percy, sitting on the other end of the couch and painting her toenails for her like a servant-boy, looks up at me and says 'Yeah, but you can do better than <em> her </em>.' And I swear to God, not only had Gwen orchestrated the entire little scheme to get Monique to dump me but she openly admitted she had only done it because she knew it would be easy. So, you're lucky you don't have any siblings, man. The definition of a sister is someone who has the power to destroy you, and uses it at every available opportunity, I'm telling you.”</p>\n<p>Keith was smiling again, because he clearly did not understand the horrors of living with a teenage girl. Well, they all lived with Pidge, but Pidge was a less a girl than an agender being of nerdiness and rage and would never count as a girl any more than they’d ever counted as a boy. But either way he didn’t look appropriately sympathetic. “I kind of agree with your sister though. If she didn’t even stop to hear your explanation, she couldn’t have been a very good girlfriend.”</p>\n<p>Lance scratched at his ear, drawing two cards into his hand. “Well, either way Monique was my longest-lasting girlfriend at a whopping three months of bliss.” He shrugged.</p>\n<p>Keith flipped over the cards in his hand with a hum. “I’ve been on two and a half really bad dates, but up until now I’ve never had a real boyfriend before.”</p>\n<p>And for a second that sentence didn’t really register properly. Up until now. “Up until now?” He says. Boyfriend. Keith is gay and has a boyfriend. That can’t be right. Was that seriously true? Who the hell was Keith’s boyfriend? How did Lance MISS this?</p>\n<p>Keith looked sort of confused himself. “Yeah, until now,” he confirmed.</p>\n<p>And that tone of voice meant Lance was absolutely supposed to know who this was. Oh god, was it Shiro? Please don’t let it be Shiro. He wasn’t sure why but Lance was pretty sure he would explode and die if Keith and Shiro were… Yeah he wasn’t gonna finish that thought. There was no way around it, no matter how much he didn’t wanna know Lance had to ask “And your boyfriend is… Whom, exactly?”</p>\n<p>Keith’s brow was drawn low over his eyes. “Haha,” he said stiffly, clearly not finding anything funny. There was something of a staredown after that, Keith growing tenser by the second as he searched Lance’s eyes for any hint that this was an ill-humored joke. The longer Lance looked confused and desperate the more distressed Keith began to get, biting out “You.. You seriously… this entire time…” The cards he had been shuffling crumpled in his fist, his head hanging too low for Lance to see his eyes through his bangs. “More than an entire MONTH and you didn’t… we weren’t even really…” His hands were shaking, and a part of Lance wanted to reach out in some sort of comforting gesture but the rest was far too occupied with the dawning realization finally, finally crashing down on him. “I can’t believe I’ve been such an <em> idiot </em>.”</p>\n<p>And everything, all of the moments in the past few weeks that had been odd or too-personal or - all of the pieces slotted into place and he suddenly saw with perfect stunning clarity. A stunned “Oh my God,” was the most intelligent thing Lance could manage. “Oh my God, we’re dating.”</p>\n<p>Keith’s head snapped up, and oh good, there was the anger. “Well, what the hell did you THINK was going on?!” He stood up, and Lance had to follow because it would be really weird if only one of them was standing for this. “We had romantic walks under starlight! We MADE OUT, for Chrissake!”</p>\n<p>“I, I don’t know!” Lance defended helplessly. “I guess I just thought you were… Physically affectionate?”</p>\n<p>“‘<em> Affectionate </em>’ enough to make out with people I’m not even-” Keith cut himself off with a choked scoff, looking down at his shaking fist instead of at Lance. When he looked up again there was a spark of fire in his eyes, and as the punch came flying at his face Lance’s only thought was ‘Yeah, I probably deserve this.’</p>\n<p>He woke up later to find himself dumped in an unceremonious pile outside of Keith’s door. This, he reflected, was going to make things complicated.</p>\n<p>The next day was awkward. The day after that was worse. Keith was doing everything in his power to avoid Lance, and the times they were forced to interact were terse at their most polite. At worse Keith was just shy of actively trying to kill him and Lance… Lance’s brain was still broken, mainly. DATING. He’d been <em> dating Keith </em> for WEEKS, and it had all seemed so natural he had literally not even noticed the entire time. He’d managed to at least catch on enough to admit he was physically attracted to Keith, but somehow all the moments of intimacy and meaningful conversations had just sailed RIGHT over his head, and now everything was balls-up fucked and he couldn’t even get the guy to <em> talk </em> to him anymore.</p>\n<p>And out of all the weirdness in this last month, that was by far the strangest. He’d gotten used to having Keith around all the time, and for him to suddenly not be by his side anymore was… It felt like something had been physically cut out of Lance’s life. It was lonely.</p>\n<p>Unfortunately, he was not the only one Keith’s new attitude problem had an effect on. Their teamwork was functional at best, and while everyone was doing their level best to sI t the hell out of all this and avoid talking to either one of them, when days started to pass where the ice storm failed to let up Shiro felt the need to speak.</p>\n<p>“Look,” he said to Lance away from all the others, looking like he’d rather be strapped to a gurney than here talking about this. “I don’t know what’s going on or what you did, and quite frankly I don’t want to.”</p>\n<p>“That’s fair,” Lance agreed.</p>\n<p>Shiro kept on as if he hadn’t spoken. “But whatever’s wrong you have to fix. Or at least,” he made an odd sort of brief sweeping gesture with his hands, “smooth it over. Because at this point it’s kind of looking like if we got into a fight right now Keith would happily watch you get shot by a Galra and then spit on your corpse. And that’s not really going to work.”</p>\n<p>Lance also agreed with that. Which meant here was where he had to make some decisions, because he still didn’t even know what he <em> wanted </em>to do.</p>\n<p>It wasn’t that Lance had been avoiding thinking about it. Just the opposite; he hadn’t been able to STOP thinking about Keith. All the time they’d spent together ran through Lance’s head, every tiny vulnerability Keith had shown him that he wouldn’t have let anyone else see, every moment Lance REALLY should have noticed was actually super romantic. And the more he thought about all of it the more frustrated with himself he felt, ashamed that he’d managed to hurt his friend so badly with his stupid damned ignorance and denial.</p>\n<p>He missed Keith. Even though it made no sense, being with him had been some of the only times he could forget about never going home and just relax and enjoy being in the moment. He could drop his guard and be himself completely around him, and it was because he knew Keith was doing the same. Of course, Keith was only letting down his barriers because he was with his romantic partner, which means that Lance might never have even gotten to see that side of him if he hadn’t accidentally started dating him… Ah, quiznak, what a mess.</p>\n<p>So… It was obvious, wasn’t it? What Lance wanted was to go back to dating Keith. Then why was he hesitating?</p>\n<p>Because he was scared. Scared of hurting Keith again - look how badly he’d already fucked up once, and this was just after <em> one month. </em> Imagine all the time and opportunities Lance had to screw up in the future! And he’d already gotten a punch for this one; next time he’d probably meet the business end of Keith’s sword. Ugh, why did Lance have to be so miserable at relationships? He’d had three girlfriends in his life and not a single one would so much as look at him if he was drowning in dog piss now. And he never LIVED with any of them.</p>\n<p>And not mention he had no idea how to go about dating another guy. Sure he’d done alright for a few weeks, but that was because he didn’t know what was going on so he was running purely on instinct. It was starting to seem to Lance that when he actually TRIED with girls and dating he did a thousand times worse with them and he couldn’t see how that would be any better with Keith. Not to mention his go-to apology present of flowers would probably not go over well.</p>\n<p>Alright, so dating Keith was actually a really, really terrible idea. But if Lance thought about the flip side - the idea of NOT dating him was waaaaaayyy worse. For one thing, it meant they’d never get back to that level of comfortable intimacy where they could lie side by side in a bed talking about nothing for hours, and that sounded kind of devastating. And not to mention… You see, like. If Lance wasn’t dating Keith, that meant <em> someone else could. </em> And he couldn’t do anything about it! He’d have to just sit there and WATCH as attractive panselxual aliens hit on him, or even worse - the worst possible thing could happen. Keith might actually get together with Shiro, because who the fuck knew what Shiro’s type was, he was probably down for anything! And that anything could include Keith, and Lance had watched them have exactly three conversations in the days since he and Keith had split up and wanted to put his fist through a sheet of glass for every second of them. So. He’d probably actually die.</p>\n<p>Lance sighed. “I am going to need to pull one hell of an apology out of my ass.”</p>\n<p>Shiro’s eyebrows shot up to his hairline, and he whistled lowly. “You must have REALLY screwed up if you’re actually willing to admit it’s your own fault.” He paused, his face growing concerned. “How did you even <em> manage </em>…”</p>\n<p>Lance cringed. “Um, the words I am choosing to put it are that I was insensitive with his emotions and in my ignorance accidentally took advantage of his feelings.”</p>\n<p>Shiro looked at him as if trying to figure out if that line was previously rehearsed. It totally was, but that wasn’t the point. After a moment Shiro just closed his eyes and sighed painfully, a solid hand hitting Lance’s shoulder. “Good luck with that,” he announced with firm sympathy, and then proceeded to GTFO and abandon Lance to his own stupid devices like any sane person would at this point.</p>\n<p>--</p>\n<p>While Lance took his sweet time acting like a chickenshit and failing to come up with a plan, Keith apparently had his own ideas. He found Lance sometime the next day, cornering him when he was by himself. Well, if by by cornering one counted sitting on the opposite end of the couch Lance was occupying and not saying anything for about three minutes straight.</p>\n<p>That was all kinds of super uncomfortable. Lance was about to break the silence, knowing him with something completely inappropriate, when Keith cleared his throat.</p>\n<p>“So… you never told anyone that we weren’t really dating,” he said after a while.</p>\n<p>Well fucking of course he didn’t, everyone already thought he was enough of an asshole as it was. Lance kept his tone casual. “Yeah, well. You didn’t either.”</p>\n<p>Keith scoffed, anger flashing over his face “I’m already humiliated enough without sharing it with everyone we know.” Which was pretty reasonable. There was another break of silence, both of them sitting forward on the couch and staring at the vacant wall. “They all still think we’re dating. Just that we’re having a fight right now.”</p>\n<p>Lance thought about that. Looked at Keith from the corner of his eye and hesitantly said “Well that’s… a fairly accurate interpretation of what’s going on right now, I think.”</p>\n<p>Keith raised his eyebrow and said, flatter than the desert plains, “Is it, now?”</p>\n<p>Lance coughed a little to hide his nervousness. This was his chance, right? Say what you need to say while Keith is still listening, man. He sucked in a deep breath of air before he began, “So, it’s come to my attention that I’m an idiot.”</p>\n<p>Keith stared at him, face stony. “Oh, really.” Lance took the sarcasm as a good sign.</p>\n<p>He took his time, knowing he needed to find the right words. When he realized the only times he’d ever managed to say the right thing was when he didn’t know what was going on, he changed his mind to wing it. “So, like. I miss you, man. I miss you like crazy.” Keith was at least looking interested now, some of the hostility dropping. “I miss spending all of our time together, I miss talking to you. I miss our arguments, and will admit right now I sometimes took sides I didn’t even believe in just because I wanted to keep fighting with you.” That pulled a bit of a smile out of the corner of Keith’s mouth, and Lance took a chance with the next words, licking his lips and continuing “I miss kissing you. I’ve been thinking about that a <em> lot </em>.”</p>\n<p>Keith bit his own lip, looking away from Lance. His words were still biting when he spoke, though. “So what, you want to just want to brush over the fact that you never meant to ask me out and… Just go on and be boyfriends like it had been real the whole time?”</p>\n<p>Lance considered that. “Well, ideally I suppose we’d start over go out the right way, because I can TOTALLY come up with a better first date than losing at pool to Hunk. I’m way better at being a boyfriend when I know I am one, you know. Significantly less flirting with other people.”</p>\n<p>“I thought billiards <em> was </em> a good first date,” Keith muttered. He sighed heavily, still looking like there was no way in hell he was giving Lance another shot at this. “You don’t even understand what I’m really upset about.”</p>\n<p>Lance sat forward, scooting closer to Keith on the couch. “That’s because, and I don’t know if you noticed, but we kind of have a problem with communication,” he gestured between the two of them. “I feel like working on that would go a long way here.”</p>\n<p>Keith could apparently at least agree with that much, huffing a breath out of his nose. “I’m upset,” he started tersely, “because I thought that I’d found... I thought that we <em> understood </em>each other, and it turns out we were on completely different planets!” Keith was using his hands to talk again, and Lance was was pretty sure that that being distracted briefly by how cute he’d always found that was once again not appropriate. “You spent more than an entire month being completely clueless about my actions and motivations. You don’t even know who I really am, Lance!”</p>\n<p>“That WOULD be a good point,” Lance argued, “except that now that I have that one piece of vital information I was missing, and now everything that was confusing me about you makes sense!” Keith still looked unimpressed, but Lance was at least pretty sure he had this one covered. “And even if you’re right it doesn’t really matter. Like, when I first accidentally asked you out, I said I wanted to get to know you better, right? Well that’s still true! It turns out I still have a lot to learn about you, and that’ll still be true even if you don’t let me make out with you anymore. But right now you’ll barely even look me in the eye and I guess all I’m really asking for rather than a shot at dating,” he scooted closer to Keith, closing the space between them on the couch. “Is for the opportunity to understand you better. If you’ll let me.”</p>\n<p>And Holy Miracles on a freaking fuckstick, Keith actually looked like he was warming up to this. He uncrossed his arms, putting his palms on the couch seat and locking his elbows to hold his weight. Lance wanted to say more, had a thousand more things he wanted to tell Keith, but he wisely chose to bide his time instead, waiting for Keith to react. Finally, he admitted “I <em> have </em>missed you, too.”</p>\n<p>Lance grinned, sliding a diffident hand over to the other paladin on the couch, touching the tips of his fingers against Keith’s. “Plus you know, if you take me back and we start dating for real? You can use the fact that I didn’t know we were dating for the first month of our relationship against me for the rest of our LIVES. You can dump me in a week and in ten years you’ll still be able to win any argument by throwing that down, and I won’t be able to say a THING.”</p>\n<p>Keith smiled at that, sly but finally open and accepting in a way that made Lance’s heart stutter in his chest. “I do like the idea of having something I can hold over your head like that,” he teased warmly, tentatively threading his fingers with Lance’s. “And I suppose since I can throw you out at any time I haven’t got much to lose.” They were looking at each other now, heads tilted toward each other with just a few breaths of space between them. Keith’s voice was dropped low now, in that husky sexy way Lance decided he needed to hear more of. “You know you’re still far from off the hook, right? You totally fucked me up for a few days there.”</p>\n<p>“I am prepared to go to great lengths in the name of getting you to make out with me again,” Lance said confidently to Keith’s amusement. He tipped his head forward until their foreheads were touching, and dropped his own voice down to a whisper the he hoped was half as sexy as Keith’s to request “Is it alright if I kiss you now?” It was the first time either one of them had asked.</p>\n<p>Keith’s answer was as straightforward as he always was, closing his eyes and leaning up to close the last inches of space between them in a firm kiss.</p>\n<p>And Lance did in fact had a lot of un-fucking up to do, because it really was completely amazing that he’d ended up here. Seriously, Keith was WAYYYY too good for him. But, like he’d said earlier? That was kind of the ideal.</p>\n<p>--</p>\n<p>Epilogue:</p>\n<p>The plastic cord whipped against the floor of the playroom rhythmically, footsteps pounding against the linoleum in nearly perfect time.</p>\n<p>“Come on you can do this, keep up with the rhythm!” Lance called in manic glee, swinging one end of the cord in tight circles, the other end tied to a doorknob. “Cind-er-ella dressed in yella went downstairs to meet a fella…”</p>\n<p>Keith jumped frantically, eyeing the cord suspiciously every time is sailed over his head. “You’re swinging it too fast, how am I supposed to keep a rhythm when you keep speeding up at weird times! You’re the one rhyming for chrissake, keep your own time!” The makeshift jump rope slapped against his ankles on a missed leap and tangled around his feet, nearly tripping him until he hopped out of its way. “Damn it, Lance!”</p>\n<p>Lance rolled his eyes dramatically. “You’re the one who said you knew how to jump rope, it’s not my fault you suck at it.”</p>\n<p>Keith leveled a scowl at his boyfriend. “I’ll have you know,” he started angrily, “that I have PRIME jump rope experience. In first grade Melinda Chang declared we were a couple, and we played house and spent every recess together doing jump rope and pattycake for two weeks straight. Which in seven year-old time is pretty much an eternity. So you’re not even the only one of us whose had a girlfriend, how about that.”</p>\n<p>Lance looked fairly entertained at that, which Keith supposed had been the actual point of telling him in the first place. “So what I’m getting from that story,” he said with a pointed look, “is that you know how to play patty-cake.”</p>\n<p>Keith glared at him.</p>\n<p>That did not change the fact that ten minutes later saw the two of them sitting on the floor across from each other clapping hands to the tune of Bobo Ski Wotten Totten.</p>\n<p>Keith was just starting to remember how to play and fall into the flow of the game, when somewhere in the middle of “itty-bitty wotten totten” princess Allura appeared in the open doorway.</p>\n<p>Lance and Keith stopped mid-patty-cake. Allura opened her mouth as if to say something, but no sound came out. After a moment her jaw snapped closed with a click, and she turned around kept walking past the door.</p>\n<p>Lance looked at Keith. “Let’s go ahead and never explain that to her or mention this day again.”</p>\n<p>Keith nodded. “That’s a good plan. Let’s go with it.”</p>\n<p>THE END</p>\n<p>--</p>\n<p>\n<img src=\"https://68.media.tumblr.com/1deaf9795a4fbfa524ed4c3b469f3c29/tumblr_onb7gkMf4m1uzk66mo3_1280.png\" alt width=\"951\" height=\"1005\">\n</p>\n<p><img src=\"https://68.media.tumblr.com/dcacca4237b7c44f77c123139bcd2aec/tumblr_onb7gkMf4m1uzk66mo1_1280.png\" alt width=\"470\" height=\"512\"> <img src=\"https://68.media.tumblr.com/a199541f01d60d41e7fe5a6a7147c90f/tumblr_onb7gkMf4m1uzk66mo2_1280.png\" alt width=\"470\" height=\"515\"></p>\n<p>--</p>\n<p> <a href=\"https://tough-girl-freed.tumblr.com/post/150007376504/thank-you-inspired-from-the-klance-fic-a-fish\" rel=\"nofollow\">now with fanart</a></p>\n<p>\n<a href=\"https://linsoy.tumblr.com/post/158770455525/uh-was-that-should-i-not-have-go-read-a-fish\" rel=\"nofollow\">AND MORE FANART HOLY OH MY GOD</a>\n</p>\n<p>\n<a href=\"https://space-is-for-the-gay-kids.tumblr.com/post/173246101046/pepplemint-unreferenced-sketch-from-a-fish\" rel=\"nofollow\">EEEYYYYYOOOOOLLLYYYSHIUIUIIITTT</a>\n</p>\n<p>\n<img src=\"https://78.media.tumblr.com/6a47df432cd7a9de4458d09496d20260/tumblr_p0ptbwc4441qmu9f0o1_1280.png\" alt width=\"1177\" height=\"1407\">\n</p>\n<p> </p>\n<p> </p>\n<p>Also feel free to yell at me in any capacity at my junk tumblr <a href=\"https://yoyo-dodo.tumblr.com/\" rel=\"nofollow\">yoyo-dodo</a> or my writing blog <a href=\"https://thesmutwitch.tumblr.com/\" rel=\"nofollow\">thesmutwitch</a></p>"
}