{
  "id": "7332526",
  "url": "https://archiveofourown.org/works/7332526?view_full_work=true",
  "author": [
    "astrainclinant"
  ],
  "title": "the whole town's sleeping",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Voltron: Legendary Defender"
  ],
  "relationships": [
    "Shiro/Keith (Voltron)"
  ],
  "characters": [
    "Shiro (Voltron)",
    "Keith (Voltron)"
  ],
  "additional_tags": [
    "Speculation",
    "Slow Burn",
    "Developing Relationship",
    "Mutual Pining"
  ],
  "language": "English",
  "series": "",
  "published": "2016-06-29",
  "completed": null,
  "words": "17,716",
  "chapters": "1/1",
  "comments": "249",
  "kudos": "15,107",
  "bookmarks": "4,042",
  "hits": "89,630",
  "summary": "<p>Of inevitability and stars.</p>\n<p>Alternatively, how Keith and Shiro come together.</p>",
  "notes": "<p>This wasn't meant to be a nearly 18k word monster of a fic. I actually intended for it to be much, much shorter, but then there kept being <i>feelings</i>, so here we are. With this ridiculousness. Unsurprisingly, I've fallen into Voltron hell and I'm not sure if I want to find my way out, so I think I'm going to make myself a little comfortable in this fandom with my stupid ship.</p>\n<p>I did take a few liberties, considering this is a speculation fic. Also, this is entirely unbeta'd, so I'm sorry if I missed anything.</p>",
  "text": "<p>Outside, the night desert air was cool. Inside, the Galaxy Garrison it was equally as chilly. Maybe even more so, with its metal walls and constantly moving air. He could feel the cold of the walls where he leaned against it, regardless of the fact that he was wearing two layers.</p>\n<p>Something else was holding his attention, though.</p>\n<p>There were usually at least a few people in the training room, when it wasn’t the middle of the night. Shiro wasn’t sure exactly what time it was, but he was positive that a cadet wasn’t supposed to be out of bed so late at night. Then again, no one would call this kid well behaved.</p>\n<p>Volatile, rebellious, and singularly gifted. That was what Keith was considered, according to the rumor mill. Shiro didn’t make it a habit to listen to what his own peers had to say about the people around them, but ever since Keith had shown up and beat their head trainer in a one on one spar (Sven swore that he had been going easy on the kid so it didn’t really count) there had been the occasional name drop here and there.</p>\n<p>Shiro had never met the kid directly, so he didn’t have much of an opinion on him, yet he was somehow entirely unsurprised to find Keith the source of the noises coming from the training room. Nothing too fancy was going on, just Keith wailing on a training dummy. There was a fluidity in his movements that lent itself to the idea that Keith trained often, but there was also a roughness that spoke of his minimal formal training.</p>\n<p>“You should widen your stance,” Shiro said, breaking the silence that he had allowed for the past few minutes.</p>\n<p>He could see the way that Keith’s shoulders tensed and his body straightened in an immediate response to his name. Keith turned slowly, with almost jerky movements, and his face shifted from irritation to surprise and then resigned acceptance. His arms crossed. “You gonna rat me out?” he said with venom.</p>\n<p>Everyone griping about Keith’s apparent insubordination made sense, suddenly. Shiro just smiled though, amusement tickling at the base of his throat before pushing away from the wall. He made sure to uncross his arms to make himself more physically inviting. “That’s not exactly my M.O.,” he said with a laugh, stopping a few yards away from Keith, who still had an untrusting look on his face. “I did the same thing as a cadet, after all. When I couldn’t sleep, that is.”</p>\n<p>“The great Takashi Shirogane was a rule breaker when he was a cadet, who knew?” Keith said with a wry quirk of his mouth. It was more of a smirk than a smile.</p>\n<p>“We all have our dark pasts,” Shiro smiled a bit wider. He could practically see the way that Keith was unknotting himself, the set of his shoulders going looser and the way which he held himself becoming less angry. Less defensive. “You’re pretty good.”</p>\n<p>“Yeah,” Keith’s voice was halting before his nose wrinkled and he said, “I mean. Thank you, uh, Shirogane. I appreciate the observation.”</p>\n<p>“Please, call me Shiro,” he was aiming to placate and hoped he hadn’t missed the mark too much.</p>\n<p>“Keith.”</p>\n<p>“I know,” Shiro said, because he couldn’t resist the small, gentle jibe. It may have just been his imagination, but Keith colored a little bit at his cheeks and ears. “I meant it, by the way,” Shiro pressed onwards, “it would do you some good to widen your stance. Having a lower center of gravity is beneficial in a fight. Makes you harder to knock over. Here, let me see your positioning again.”</p>\n<p>It took a few moments before Keith uncrossed his arms and dropped back down into the stance he had been in earlier. Shiro walked closer, careful to watch Keith’s face for any sign of irritation or discomfort. Faintly, he felt a little bad for treating the kid a little bit like a wild animal, even though he didn’t mean to.</p>\n<p>When Shiro stopped moving forward he had definitely entered Keith’s personal space, but the younger man didn’t seem to be too put off by that. The only sign that he noticed, aside from visually following every one of Shiro’s movements, were his shoulders stiffening once more.</p>\n<p>Shiro smiled approvingly before sliding his foot forward and using it to nudge at Keith’s, pulling back when he was content with how he was standing. He made a quick circle around Keith, analyzing his posture and the way which he held his limbs, pressing a quick hand against a shoulder blade to keep him straight. Shiro had always been both a tactile learner and a tactile teacher, and Keith seemed to take to it well enough.</p>\n<p>When he was happy with Keith’s stance, Shiro took a few steps back and nodded approvingly. “How does that feel?”</p>\n<p>Keith rolled his shoulders a few times and settled back into the same position that Shiro had led him into, and then bounced up and down on the balls of his feet before stilling. “A bit weird,” he said with slow and deliberate honesty, “I’m not used to holding myself like this.”</p>\n<p>Shiro hummed noncommittally before pushing harmlessly at Keith’s shoulders, laughing when he righted himself immediately. “Yeah, but you feel more balanced, right?”</p>\n<p>“Yeah, I do,” Keith sounded almost reluctant to admit it, as if it were a slight to his own pride. Shiro couldn’t help but duck his head and grin at the sound of his voice.</p>\n<p>“You also might want to start wrapping your hands when training,” Shiro tapped two fingers against Keith’s bare hands once.</p>\n<p>“Not like I’m gonna be able to wrap my hands if someone attacks me at random,” Keith said reasonably. Or, at least, his words were pretty reasonable. His tone was rather petulant.</p>\n<p>“Alright, I see your point,” Shiro yielded and stepped around Keith again, patting his shoulder, “relax for a second, let me grab something.”</p>\n<p>He walked over to the wall and shed his jacket as he went, hanging it one of the exercise machines. When he got to the wall he pressed at a recessed button, stepping back as the wall slid out to reveal some training gear. Shiro grabbed for two bo staffs, and tossed one to Keith on his way back.</p>\n<p>“Have you used one of these before?” Shiro asked, because he had to.</p>\n<p>“Sort of,” Keith said, his foot tapping against the ground in front of the training dummy, which promptly disappeared into the ground. He looked a little winded, and a little surprised. It wasn’t a look that Shiro had expected to see on his face.</p>\n<p>Shiro stepped to the other side of the training ring and held his bo staff with evenly placed hands, stepping into a solid stance. He observed Keith as the younger man twisted the bo staff in his hands deftly, before settling both of his hands on one end, as if he were holding a sword. That got a raised eyebrow, but Shiro didn’t ask.</p>\n<p>They sparred a three times. Twice until first touch and the last spar was until one of them disarmed the other. Shiro came out the victor all three times, though Keith got closer than anyone else with his experience would have, to which Shiro actively admitted that he was impressed. Keith colored a bit again at the praise, and Shiro laughed heartily.</p>\n<p>After the third round Keith clearly wanted to keep on going, but Shiro knew that he had to be a somewhat responsible older figure, even though he wasn’t that much older. He took the bo staff from Keith gently and placed a hand on his shoulder to lead him to the door.</p>\n<p>“I will walk you to your dorm if I have to,” Shiro said sternly.</p>\n<p>“Alright, sir,” Keith said with cutting sarcasm, though it just made Shiro chuckle.</p>\n<p>Shiro leaned against the doorway to the training room with his arms crossed as he watched Keith walk away. He turned away when the younger man turned down another hall and went about cleaning up around the training room before going off to bed himself. The exhaustion he felt the next day was worth it.</p>\n<p>——</p>\n<p>Shiro wasn’t surprised to find Keith there a few nights later.</p>\n<p>“Widen your stance,” he said from the door before crossing the threshold.</p>\n<p>He grinned when Keith glanced over his shoulder with a considering expression before acquiescing. He knew that it really shouldn’t become a habit.</p>\n<p>It kind of did, anyways.</p>\n<p>——</p>\n<p>The next time Shiro was in a town, Adelina, his engineer, needed to stop by an athletics store to grab something. He let her go off on her own to find what she needed to buy, and he went off on his own to browse the store.</p>\n<p>When he came across their compression gear and he breezed past the socks, shorts, sleeves, and whatnot until he came across the gloves. Inspiration struck him, then, and he paused to stare at the collection of compression gloves. Shiro considered all of them seriously, before starting to rifle through the black ones.</p>\n<p>Nude compression gloves probably would have worked, too, but.</p>\n<p>“Those are a bit small for you, Shiro,” Adelina said when he met her at the register. “Is there somethin’ you wanna tell me?”</p>\n<p>When he turned she was smiling widely and he laughed, a little embarrassed. “They’re for a cadet who doesn’t like wrapping his hands like he’s supposed to, so I figure that these can help out a bit with support.”</p>\n<p>“Aww, what a special lil cadet,” Adelina cooed, “getting all this attention from you.”</p>\n<p>“Shush,” Shiro said with a faux stern look and he ignored her laughter gamely as he went to go purchase the compression gloves.</p>\n<p>——</p>\n<p>If Keith were a boastful person who actively cared about his reputation in the eyes of his peers, he probably would have bragged about Takashi Shirogane giving him late night training sessions. Keith, however, didn’t give a damn, so he didn’t say anything. He didn’t really talk to any of his classmates, anyways, so it was all pointless.</p>\n<p>Furthermore, if he were a different person, he would have been ecstatic to find a simply put together package with his name written on it on his bed. That being said, he only looked at it with some suspicion, wondering if it were a prank. Some of his peers didn’t like him much. Others were louder about it.</p>\n<p>Regardless, he opened it with a heavy dose of suspicion and caution, though when he found black gloves in there, he was more than surprised. His head tilted and he picked the gloves out of the box, turning them this way and that, noting that they were compression gloves, not just fingerless gloves.</p>\n<p>The confusion was stronger and when he saw a piece of paper on the bottom of the box he flipped it.</p>\n<p>\n<i>             Thought you could use these.<br>\n                        -Shiro</i>\n</p>\n<p>Something inside of him struggled and twisted for a few moments before he got up, clutching the gloves tightly in one hand. He was briskly walking down the hall faster than his mind could really comprehend and he stalked about the halls of the Garrison, looking from side to side. He had no idea where he was trying to get to, but he kept on looking, anyways.</p>\n<p>When he walked into the mess hall and saw Shiro sitting at a table near the center of the room with a few other people, he started walking that way immediately. Dimly, he realized that he was feeling a strange mixture of anger, frustration, and embarrassment, and he logically knew that his anger was unwarranted, but he had never been good at handling it.</p>\n<p>Hair trigger temper and all that.</p>\n<p>“What the hell is this?” Keith said, voice pitched just a little too loud. The mess hall didn’t fall silent, or anything, but there was definitely a decrease in sound in their immediate surroundings.</p>\n<p>Shiro looked at him with wide eyes and heavy confusion before his gaze flickered to the gloves that Keith was clutching in his hands. Keith watched the realization dawn on his face and felt more irritation over it. “Keith, hold on,” he started.</p>\n<p>“Sorry, am I being a bit too abrasive, sir?” Keith knew that he was being a little too harsh, sounding a little too mean.</p>\n<p>“Is there a problem over here?” said a man who had nothing at all to do with this situation, and Keith knew with a single glance that he was a higher up of some form.</p>\n<p>Keith’s mouth opened to say something that he doubtlessly wouldn’t regret but that absolutely would have gotten him in trouble. When a hand gripped at his forearm, though, his mouth audibly clicked shut and his mouth pursed.</p>\n<p>“Nothing at all, sir,” Shiro said with sincerity that Keith was sure he would never be able to replicate. “If you would please excuse us, though.”</p>\n<p>The next thing that Keith knew, he was being hauled out of the mess hall. It couldn’t really be called hauling, though, because Shiro was handling him with startling gentleness that Keith inherently resented. Even his grip was light. It wasn’t anything like what Keith instinctively expected.</p>\n<p>That would figure.</p>\n<p>They came to a stop around the corner from the mess hall where there was less general traffic. Shiro let go almost immediately and turned towards Keith, somehow having the gall to look nervous. Keith wordlessly waved the gloves in his face.</p>\n<p>“They’re compression gloves,” Shiro said needlessly.</p>\n<p>“Why did you buy them for me?” Keith said, brows furrowing.</p>\n<p>“Because I figured that you could use them,” Shiro said and Keith’s jaw set at the sheer genuineness that Shiro tended to talk with. He couldn’t imagine the man lying at any point in his life, which just seemed unnatural.</p>\n<p>“I don’t need them,” Keith said, still sounding angry and not trying to diminish the slight growl in his voice. “Take them back,” he thrust the gloves into Shiro’s chest.</p>\n<p>“I want you to keep them,” Shiro said with a tilt of his head. “I bought them for you, after all. You don’t have to use them or anything, I just wanted you to have them. They can give a good amount of support to your wrist and hands, which is ideal for hand to hand combat.”</p>\n<p>Keith could feel his face twist and he looked away from Shiro abruptly, grip tightening further. He was aware that he was resting his fist against Shiro’s chest, and Keith just turned on his heel and started to stalk away.</p>\n<p>He tried to tell himself that it wasn’t the act of doing something nice for him that was driving him up the wall, that it was just the presumptuousness of the purchase. Keith knew one some level, though, that that wasn’t the entire case.</p>\n<p>Being an orphan and getting a present wasn’t nothing.</p>\n<p>He shook the thought out of his head and, instead, made his way into the training room after throwing the gloves onto his bedside table. He felt a stab of vindictive joy when one of them fell off the table, and then felt annoyed because it was childish to be happy about a glove falling over, of all things.</p>\n<p>When he got to the training room he made an immediate beeline for the treadmill and ran until a warning for lights out was called. He dragged his feet back to his room, gamely ignoring his roommate as he went into their bathroom and showered.</p>\n<p>As he passed his bedside table he glanced down at the fallen glove. After struggling with himself for a few moments he stooped down with sharp, angry movement and threw the glove onto the table with its twin. Then, after a beat, he grabbed both of them and threw them into the drawer, slamming it shut.</p>\n<p>“What’s with you tonight?” asked his roommate whose name was either Eugene or Miles or something else.</p>\n<p>“Nothing,” Keith said flatly as he crawled into his bed and turned to face the wall.</p>\n<p>——</p>\n<p>Shiro wouldn’t say that he regretted buying Keith the gloves. It had been an impulse buy more than anything else, and Shiro wasn’t in the habit of acting compulsively. When he did, he made it a habit not to regret any of the choices, just to keep his head on straight.</p>\n<p>The gloves had been there, so he bought them. It was as simple as that.</p>\n<p>Keith’s reaction had been a little surprising, but Shiro imagined that it wasn’t anything personal. Not really. Keith was prickly and definitely had issues with authority, but in the weeks that they had started training together he had visibly warmed to Shiro. In return, Shiro had grown rather fond of Keith in general.</p>\n<p>So, the concern for him injuring himself by not wrapping his wrists in training was entirely called for, in his opinion. Ergo: the compression gloves.</p>\n<p>The first few nights after Shiro had given them to Keith, Keith was notably more distant, though still receptive to Shiro’s tips and being around him in general. He wasn’t wearing the gloves, which wasn’t much of a surprise after his initial reaction, and Shiro didn’t comment on it. It was a little awkward at first, with Keith making short, clipped responses to everything that Shiro said, but he didn’t mind.</p>\n<p>Shiro was running a little later than usual getting to the training room, though he and Keith had no set schedule nor time to meet up. He just felt later than usual, and the feeling was justified when he walked into the room to find Keith already standing there with a bo staff, practicing against a training dummy. For a few minutes, he lingered at the doorway, reminiscent to the first night that Shiro found Keith in here on his own.</p>\n<p>Keith twisted around the training dummy lithely, though still sharply. Shiro had surmised within their first few training sessions that Keith would likely always move a little jaggedly, a little roughly. It was part of who he was, perhaps.</p>\n<p>Eventually, Keith came to a stop with the bo staff against the training dummy’s neck, before looking at Shiro.</p>\n<p>“Hey,” Keith said, reaching up to wipe at his sweaty forehead.</p>\n<p>“You cut your hair,” Shiro said, the realization dawning on him rather belatedly.</p>\n<p>“Yeah,” Keith’s nose wrinkled a bit. It was a strangely endearing expression. “It stays out of my face more when it’s shorter.”</p>\n<p>Shiro blinked a few times, scanning Keith’s face as he grew closer. His gaze fell upon an uneven chunk of hair and he had to swallow a chuckle. He didn’t do that great of a job if the look that Keith gave him was anything to go by. “It’s just a little uneven,” he said gently, and when he got close enough he reached out to pinch the chunk of hair between two fingers.</p>\n<p>“Well —— I cut it myself,” Keith said, eyes darting away from Shiro’s face. His ears were turning red, again, and Shiro couldn’t quite swallow back his laughter properly, this time. “Besides, it doesn’t really matter if it’s even.”</p>\n<p>“I can trim it for you,” Shiro didn’t really think before offering. Another compulsive decision.</p>\n<p>Surprise flickered across Keith’s face, and it was something that Shiro had begun to associate with Keith not expecting people to offer kind things freely. He wasn’t sure if that was actually the case, though it pained him to think that it was. “But, training,” Keith said haltingly.</p>\n<p>“I think you can take one night off of training,” Shiro said with an encouraging smile. “Let’s put the staffs back and I can see what I can do about your hair.”</p>\n<p>Keith hesitated for a few more moments before he said, “Okay,” and then walked over to the storage wall to put the staffs up. Shiro waited for him by the door and led him to his own private room, scanning himself into it. The lights came on as they walked in, and Shiro walked them both into the bathroom immediately.</p>\n<p>“Your room is, uh, very neat,” Keith said and Shiro grinned down at him.</p>\n<p>“Thanks. Here, sit on the edge of the tub while I try to figure out if I still have some scissors in here,” he said, gesturing before turning away to the mirror.</p>\n<p>In the mirror, Keith looked a touch lost and a bit hesitant but not uncomfortable. Just a little out of his depth, maybe. Shiro watched him move for a few moments before opening the cabinet and rifling through the things that he had stored in there. It occurred to him that this was the first time he’s had someone in his room for a while. Not even his teammates tended to come into his room.</p>\n<p>He could hear Keith’s knee jumping behind him, heel tapping against the floor almost imperceptibly. When Shiro turned around, the movement ceased and Keith’s body stilled, except for his head tilting back to look Shiro in the face.</p>\n<p>“Alright, do you want me to cut your hair while you’re standing up or sitting down?”</p>\n<p>Keith stood up after a few moments and stepped forward when Shiro gestured for him to. “There are only a few uneven spots, mostly in the back, so this won’t take long,” Shiro explained, stepping around Keith and looking at both of them in the mirror.</p>\n<p>Shiro had always been well built, so it wasn’t surprising that Keith looked so much slighter than him in the mirror. In addition to their difference in build, Shiro also had half a head of height on the younger man. It made Keith look younger than he was, though Shiro knew better. The way that he knew better than to underestimate Keith’s abilities because of his slight form.</p>\n<p>“I’ll touch up the back first, okay?”</p>\n<p>“Okay.”</p>\n<p>Shiro slid his fingers through the bottom of Keith’s hair, trying to keep his touch light and considerate as he went. He touched briefly at the nape of Keith’s neck, before withdrawing the touch. His fingertips felt warm.</p>\n<p>He carried on with the cleanup of a haircut briskly, evening it out where it was rough. When he was done with the back he brushed some stray hairs away from Keith’s neck and shoulders and carefully didn’t pay attention to the way that his muscles knotted and then relaxed abruptly. When Shiro glanced in the mirror Keith was staring right at him, though he quickly averted his gaze.</p>\n<p>Going around to the front, he had to bend down to consider where Keith’s hair should be cut to. For once, they were directly eye-to-eye, though it wasn’t an awe inspiring moment. Shiro, in spite of their difference in rank, saw Keith as an equal. He shouldn’t have, maybe, but their nights training together had broken him of the habit of seeing Keith as just a cadet.</p>\n<p>Keith, however, wasn’t looking directly at him. He was looking right off to the side of Shiro’s face, though he didn’t comment on it. Instead, he moved to smooth down some of Keith’s bangs, and he chuckled a little bit when they popped right back up.</p>\n<p>“Your hair has some impressive body,” Shiro said teasingly.</p>\n<p>“Says you,” Keith said without heat, gaze dragging back to Shiro’s face, eyeing his own flop of hair.</p>\n<p>“Alright, I see your point,” Shiro jokingly conceded to their non-argument, before tilting his head this way and that.</p>\n<p>When he brought the scissors up to Keith’s face, the younger man’s gaze darted and their eyes caught for a moment, before skittering away. Shiro felt concern bubbling at his throat for a moment before swallowing it. Keith was mouthy enough that, if Shiro was doing anything off putting, Keith would have said something. Surely.</p>\n<p>Still, before he continued, he said, “You okay?”</p>\n<p>“Of course I am,” Keith said after a moment. A meaningful moment. Shiro knew the difference between an honest answer and one given in automatic panic. If Keith had said something immediately, he would have backed off.</p>\n<p>Shiro trimmed at the front of Keith’s hair quickly, and when he stepped back everything was even again Keith’s dark hair was framing his face in a way that made him look more handsome than he had before. It was definitely an improvement from his uneven haircut, though even that hadn’t detracted from his looks all that much. Objectively speaking.</p>\n<p>“Done,” Shiro said with a touch of pride, stepping aside to let Keith look.</p>\n<p>Keith stared at his reflection in the mirror for a few moments, before combing his fingers through it. He smiled, a slow and gradual sort of thing, and glanced at Shiro in the mirror. “Thanks, Shiro.”</p>\n<p>The pride in Shiro’s chest swelled at the sight of that smile. Making Keith smile felt like a privilege.</p>\n<p>——</p>\n<p>A month and a half later Keith was messing with his hair just a little too much during their late night training sessions and Shiro suppressed a grin at the sight of it.</p>\n<p>“Want me to trim your hair again?”</p>\n<p>“Sure,” Keith said with less hesitation than he had before.</p>\n<p>——</p>\n<p>The first day of flight simulation was something that Keith had been looking forward to. Which, he supposed, was saying something since he didn’t look forward to much.</p>\n<p>When he sat down in the simulation machine, it felt stagnant. He knew it was because the machine would never actually fly, but it was as close as he could get, given the circumstances. No one was going to give a green cadet access to an actual ship.</p>\n<p>A damn shame.</p>\n<p>Regardless, when it started up, he threw all of his empty disappointment to the metaphorical wind. It wasn’t real, and he knew that, but it felt real enough that it was good enough for him, for the time being. He gripped at the controls fiercely and piloted his way through their first simulation, which was easy even by a beginner’s standards. Coming into it, he had already known what was going to happen, since he wasn’t the first in their class to go.</p>\n<p>He was the best out of the ones that went, though. That wasn’t saying much, since one of the guys who went before him vomited, but still.</p>\n<p>It turned out, by the time the entire class had gone once, Keith had done the best. He felt a first sense of satisfaction curl around his spine, the amorphous feeling practically purring with contentment. Their instructor had thumped him on the shoulder on the wrong side of too hard, but he didn’t sway, and instead maintained a cool demeanor.</p>\n<p>Keith didn’t notice Shiro watching from an observation window until they were all almost dismissed. When Keith saw him, something molten weaved in between his ribs.</p>\n<p>By the time that everyone started filing out, Shiro had disappeared. Probably a good thing, since every one of his peers had a fascination with the man. Though their hero worship of him didn’t bother him, really. It was just annoying to see people act like that. As if Shiro were some untouchable thing. The man was barely older than them, after all.</p>\n<p>He started to walk away from the simulation room immediately. Behind him, someone was exclaiming, “I’ll get you next time, Keith!” but he didn’t bother to turn around, instead turning around the corner.</p>\n<p>“You’re going to make a great pilot, one day,” Shiro said later that night, well past lights out, as he walked into the training room.</p>\n<p>Keith slowed down the treadmill gradually until he was at a walking pace. “Thanks. The simulation was —— enlightening, I guess.” Always the best with words.</p>\n<p>“Simulations can do that to a person,” Shiro said as he strode over to the supplies wall, taking off his jacket as he went as per usual.</p>\n<p>Keith rubbed at his wrists for a moment as he turned off the treadmill, not quite feeling self-conscious, but aware that he wasn’t wearing the gloves. It had been weeks since Shiro had given him them, but the man hadn’t mentioned the fact that Keith hadn’t worn them once. “Yeah, I guess they can,” Keith said as Shiro turned back around.</p>\n<p>Tonight, he was holding two practice swords. At Keith’s lifted eyebrows Shiro laughed and said, “I figured we’d try out something new, tonight. We can start out with a spar until one of us gets disarmed,” before tossing him one.</p>\n<p>Keith caught it deftly and took his place at one side of the sparring ring. When Shiro settled in, he started forwards immediately, sliding beneath Shiro’s initial strike, twisting as he went.</p>\n<p>By the end of their first round, Keith was already more winded than he had been from his run. His sword had been twisted out of his hand and skidded a few paces away from him and he hunched over immediately, taking deep breaths until he could properly control his breathing again.</p>\n<p>When he stood up straight Shiro was holding a water bottle for him, which he took with a silent nod of thanks.</p>\n<p>“You sounded a bit disappointed about the simulation,” Shiro said, so abrupt that it took Keith a moment to catch onto what he was referring to.</p>\n<p>“No I didn’t,” Keith’s immediate reaction was to respond defensively. Probably not the best course of action, if the knowing look Shiro gave him was anything to go off of. There were a few moments of silence before Keith admitted, slowly, “It was just. Easy. Really, really easy.”</p>\n<p>Saying it aloud, to Shiro, felt less damning than he had thought it would be. If nothing else, Shiro had proven that he was not a harsh person in general. Takashi Shirogane was, potentially, the gentlest person that Keith had ever met. Shiro handled everything with care, soft like the warmth from an early morning sunrise.</p>\n<p>Keith didn’t really know what to do with that.</p>\n<p>“Too easy for you, I’m guessing?” Shiro said, sounding humored. Keith grunted and looked away. “Well, I will admit that you are a highly skilled pilot right off the bat. You have to remember, though, that not everyone is going to have the same skillset as you.”</p>\n<p>“I guess,” Keith said, still not looking at Shiro. It wasn’t that he felt small around Shiro, but the more time that Shiro spent training him one on one, the more he wondered if he was being looked at as a child. The thought shouldn’t bother him, because he didn’t care what people thought of him, but it did. “Some of the instructors compare me to you, sometimes.”</p>\n<p>He didn’t know why he said that aloud. It didn’t bother him, per say, the way that what other people thought about him didn’t bother him, but a part of him wanted to know how Shiro would react. The face that Shiro would make. What he would say.</p>\n<p>“Well, that’s weird of them,” Shiro said so good naturedly that Keith couldn’t even be offended for a single millisecond. “You’re your own person, after all. Comparisons can be all well and fine, I suppose, but we have different strengths. Plus, you picked up the flight simulations faster than I did.”</p>\n<p>Something inside of Keith jumped and clenched at the same time, and it felt like trying to land from a jump with locked knees. “You’re still a great pilot,” Keith said, gaze darting away from Shiro again. He hated it when that happened. Hated not feeling like he could look Shiro in the face. “And —— you’re a great leader.”</p>\n<p>It was ridiculous to say it out loud. Shiro had actual records for how well he did on flight simulations and was known to be skilled in practically every discipline possible, setting the bar impossibly high for most other students to try to reach. The fact that Shiro was a natural born leader was something that almost everyone gushed over, higher-ups pointing to him as an example of a good and solid leader. These were things that Shiro had to have known.</p>\n<p>“Thank you, Keith,” Shiro said, hand dropping onto his shoulder near the curve of his neck, his voice going so soft that Keith had to look at him again. His smile had gentled into something that Keith had never seen before, and his entire face had relaxed. Suddenly, Shiro looked even younger than he normally did, looking the age that Keith knew that he was. It felt like his insides were knotting and twisting and doing impossible loops at the sight of it.</p>\n<p>Keith hated it, except that he didn't.</p>\n<p>“No problem,” Keith said, before taking a long drink from his water bottle in an attempt to drown whatever he was feeling.</p>\n<p>When he finished drinking, Shiro dropped a hand onto his shoulder and squeezed it steadily once. “Alright, break time’s over. Let’s get back to it.”</p>\n<p>Keith just nodded silently and set the water bottle aside and took the offered practice sword.</p>\n<p>——</p>\n<p>“I want to show you something,” Shiro said when he found Keith one night, about an hour before lights out was going to be declared.</p>\n<p>Keith looked surprised and Shiro wasn’t sure if he was surprised that they were talking before lights out (it was a coincidental sort of thing, that they didn’t tend to cross paths in their day to day life) or if it was something else entirely. “What is it?” Keith said slowly, sounding suspicious.</p>\n<p>“Come on,” Shiro said, gripping Keith’s shoulder gently and leading him down another hallway. “It’s a good surprise, I promise.”</p>\n<p>“You didn’t buy me anything, did you?” Keith said, mouth thinning.</p>\n<p>“No,” Shiro laughed, jostling Keith’s body gently before letting go of his shoulder. “I was thinking the other day about the fact that you probably found the flight simulation a little underwhelming, so I thought that I could help you out there, at least a little bit.”</p>\n<p>Keith squinted at him for a moment before looking away. They turned down a few halls and Shiro noticed the moment when it dawned on Keith that they were heading towards the garages, because he could see Keith glancing at him wildly out of the corner of his eye. Shiro turned his head away to hide a grin, before tugging once on the sleeve of Keith’s jacket, leading him away from the larger hanger. His fingers brushed against Keith’s wrist.</p>\n<p>“I don’t have enough sway to get you into anything that’ll really fly,” Shiro said as he scanned himself into one of the rooms, “but not too long ago the Garrison gifted me with something to help me get around if I needed to leave the base at a moment’s notice.”</p>\n<p>“Holy shit,” Keith said beneath his breath as they walked past a few hover vehicles.</p>\n<p>Shiro stopped in front of his red hover speeder and had to grab at Keith’s sleeve again to stop him from going too far away and he gestured to his vehicle. “This one’s mine, and I programed it yesterday to respond to you, too. Here,” Shiro gently led Keith around to the side of the motorcycle and grasped his wrist before pressing his hand against the display.</p>\n<p>It came alive beneath Keith’s touch, the way that it would have come alive if Shiro had touched it, and he could feel the way that Keith stiffened and jumped a little bit beside him. “How did you —— how —— uh.”</p>\n<p>“Your information is stored in the Garrison’s database,” Shiro said with a shrug and a wry grin, “it was easy enough to get. No one else knows about this, though, so we should keep it a little hush hush for the time being. I’m not really supposed to give random students access to Garrison vehicles.”</p>\n<p>“This is —— uh,” Keith had that wide eyed look again, the one that he got when Shiro did something nice for him.</p>\n<p>Shiro felt a pang in his chest at the sight of it and pulled at Keith’s wrist, tilting his own body until the younger man was looking at him properly. He gave what he hoped was an encouraging smile, “You probably shouldn’t just ride off on it on your own, since that would be suspicious. I’m happy to go with you wherever you want to go, though.”</p>\n<p>Keith blinked a few times before glancing at the hover cycle again. His ears had gone a little red again, and that surprised expression hadn’t gone away. “Can we take it out for a ride tonight?” he sounded tentatively hopeful and it almost took Shiro’s breath away.</p>\n<p>“It’s almost lights out,” Shiro said with a little bit of regret, “it’d be best not to. We can take her out for a spin this weekend though, I think. I’d rather you get started driving her during the daytime, anyways.”</p>\n<p>Keith nodded and then bit his lip. Shiro waited patiently. “Why are you trusting me with this?”</p>\n<p>“You haven’t given me a reason not to trust you,” Shiro said honestly, “you’re a good kid.” He paused, turning that statement around in his head a few times, noting the way that Keith wasn’t quite looking at him again. “No, that’s not right. You’re a good man, Keith.”</p>\n<p>Their gazes caught once more and Shiro was suddenly very aware of the fact that they were standing very close to each other. Shiro had a tendency to be tactile in general, though even he had to admit that he tended to touch Keith quite often. He wasn’t sure if his tendency to touch Keith stemmed from the compulsion he felt to protect the younger man that had developed soon after they met, or if it was something else entirely.</p>\n<p>For a moment, Keith looked like he was struggling, never quite looking away from Shiro. It was more like his eyes were darting around his face, and Shiro waited again. “Thanks, Shiro.”</p>\n<p>“No problem,” Shiro said, before nudging gently at Keith. “Now, let’s head on back.”</p>\n<p>——</p>\n<p>Half an hour after lights out was declared, Keith quietly rolled out of bed and opened the drawer of his bedside table. He took out the black compression gloves and turned them over his grip, pulling at the fabric absently. After a few minutes he pulled the right one on and tightened the Velcro strap and flexed his hand a few times. They supported them well.</p>\n<p>When he took them off, he tucked them back into the drawer with care and shut it quietly before laying down to sleep.</p>\n<p>——</p>\n<p>Keith wasn’t really sure what to expect when the weekend came, but he wasn’t surprised when Shiro grabbed him when he was on the way to get some training in. Shiro was dressed casually and had a bag slung over his shoulder and an easy smile on his face and Keith couldn’t help but smile back. Just a little bit.</p>\n<p>Shiro smiling wasn’t anything unusual, but there was a tilt to his head and a particular curve to his mouth that Keith was pretty sure he didn’t see him have anywhere else. Wishful thinking, maybe.</p>\n<p>“Go get changed and meet me in the garage, okay?” Shiro said with almost tangible warmth.</p>\n<p>“Okay,” Keith said, because what else could he say? He made a beeline back to his dorm and changed out quickly before making his way to the garage. Shiro was waiting next to the hover vehicle and gave him a sunny smile when he got closer, and Keith stopped a few paces away.</p>\n<p>“I’m gonna drive us out of here and out a mile or so, and then we can swap out, okay? You’ve driven something like this before, right?” Shiro said, and Keith was struck for a moment by the idea that Shiro was going to let him drive it, even if he hadn’t.</p>\n<p>Keith had, slowly but surely, realized exactly why everyone idolized Shiro. It had taken some weeks, some months, if only because Keith wasn’t accustomed to respecting anyone in any capacity, but he could understand it. Yet it always seemed like no one liked Shiro for the right reasons. Sure, Shiro was a great pilot and an outstanding former cadet, but there was more. There was always more. </p>\n<p>“Yeah, I have,” Keith said nonchalantly, not wanting to expand further than that. No one really needed to know that he had, technically, stolen someone’s vehicle once. There had been a good reason. Honestly.</p>\n<p>Shiro accepted that answer without question and climbed onto the hover craft. Keith walked closer and took the helmet that Shiro offered him, sliding it on over his head. He hesitated for a moment, and then inwardly scoffing at himself because there was no reason for him to be hesitating. He slung a leg over the machine as well and slid himself on after Shiro, before having a mild predicament.</p>\n<p>“Ready?” Shiro glanced back over his shoulder and Keith nodded, shoving any inconvenient self-doubt down deep and wrapping his arms around Shiro’s waist, sliding forward on the seat as a result. Back to chest and Keith wasn’t flustered because he reminded himself that he had no reason to be.</p>\n<p>They inched forward incrementally as the door leading to the outside rolled upwards. Outside, the midmorning sun was high in the sky, and the desert was hot. Hot enough that the sand was shimmering in the distance and the warm was stifling, but the moment they cleared the building Shiro accelerated sharply, and Keith entirely forgot about the annoyance of the weather.</p>\n<p>When they got a mile and a half out from the Garrison, Shiro slowed the vehicle to a stop and twisted in his seat to glance back at Keith. “Wanna take a shot at it?” Shiro asked, and Keith could hear the smile in his voice.</p>\n<p>“Yeah,” Keith said and they swapped places. It felt like a wave was cresting in his throat when Shiro set his hands on his waist and he determinedly didn’t label whatever feeling that was. Instead, he leaned forwards a little bit and relished in the way that the hover craft came alive under him. “Hold on,” he said before they darted off.</p>\n<p>He chose a direction and headed off in it aimlessly, and he swallowed noiselessly when Shiro shifted his grip to wrap his arms around Keith’s waist. Neither of them said anything as they drove, sand being kicked up occasionally around them as they went. The sun was reaching its highest point in the sky when Keith noticed a shape on the horizon.</p>\n<p>A small house came into shape as they got closer and Keith slowed about half a mile out from it, squinting out at the building. He glanced back to find Shiro watching him and he could only see Shiro’s eyes because of the helmet, but he looked encouraging enough. Keith sped back up after that and game to a complete stop when they got to the house.</p>\n<p>“Looks like no one’s home,” Keith said as he took his helmet off, considering the house. It was small and wooden a little lopsided, as if no one had been there for a long, long time. Given that this was the middle of the desert, though, that wasn’t surprising.</p>\n<p>“Wanna take a look?” Shiro asked, even as he took off his own helmet and climbed off the vehicle. “We can use this time to eat some lunch, too,” he gestured to the bag on his back.</p>\n<p>“Sure,” Keith said, leaving the helmet with the bike and heading towards the house. The door was jammed but it only took him heaving his shoulder against it twice for it to swing open. Inside, everything was covered with a liberal layer of dust, but considering the couch that was shoved against a wall, the house couldn’t have been left to the elements for all that long.</p>\n<p>“Cozy,” Shiro said with a laugh, “looks like it’s been a few years since someone lived her, though.”</p>\n<p>“Wonder why someone would want to live in the middle of the desert,” Keith said, running a finger across the surface of the table in front of the couch. There was a door, on the other side of the room, but he left that undisturbed.</p>\n<p>“Maybe they were looking for something,” Shiro suggested, rapping his knuckles against the corkboard that was on the wall. “This is pretty old-fashioned, but the structure of the house seems pretty solid, if it can stand up to the desert sands so well. Everything in here is dust, surprisingly.”</p>\n<p>“Guess whoever lived here was just sick of being out here,” Keith said as he gingerly sat down on the couch. A small cloud of dust popped up, anyways, and he waved the particles away. “Can’t really blame them, though, there can’t be much out here.”</p>\n<p>“Living out here doesn’t seem so bad,” Shiro said, sitting next to Keith and unzipping his bag. “It seems like it would get lonely if you didn’t have someone else with you.”</p>\n<p>Keith took the sandwich that Shiro offered him and unwrapped it carefully. “This almost seems like somewhere to hide, rather than to live.”</p>\n<p>“I guess,” Shiro said as their elbows bumped together and their knees brushed and Keith coughed and pretended it was because of the dust. “This place seems about sixty miles out from the Garrison, though I can’t be sure since we didn’t go in any sort of linear path. Good job with driving, by the way, it’s good to know that I was right in trusting you with the speeder.”</p>\n<p>Shiro was giving him that same soft smile that was tinged with, if Keith dared to analyze it, pride. Seeing that smile made it difficult to swallow, for a moment, but something warm unfurled in his chest, anyways. Like a star was being born.</p>\n<p>“Thanks,” he said before tucking into his sandwich with a single minded sort of concentration. Keith was, reluctantly, starting to notice a pattern in pretending like eating or drinking required all of his attention so that he didn’t have to look at Shiro.</p>\n<p>The desert was shimmering.</p>\n<p>——</p>\n<p>Shiro found himself standing outside of the simulation room again, looking in on the cadets. No one had noticed him lingering, yet, so he stayed to watch the progression of the students, mostly watching the screen that showed what the pilot was seeing. Some cadets were decent with the simulations, and others still needed some refinement, which was expected for their skill level.</p>\n<p>Students started to lean towards each other when Keith walked up to the simulation, though Shiro had no idea what they were saying. He focused on the young man, instead, feeling a small inkling of pride at the way that he carried himself. Back straight, shoulders square, face set in something that could be seen as boredom, but Shiro could see the anticipation lingering at the edges of his expression.</p>\n<p>Predictably, Keith piloted his way through the simulation with ease.</p>\n<p>Some of Keith’s peers were looking at him with envy and others with something too close to anger and it confused Shiro, for a moment, before he remembered Keith’s tendency towards being prickly. It wasn’t really all that much of a surprise that he antagonized some of his classmates, though Shiro couldn’t imagine it being purposeful.</p>\n<p>When Keith stepped out of the simulation machine he had a placid expression on his face, but there was a faint tension in his body that was the same as he looked after driving the hover craft. Shiro knew that Keith was feeling leftover adrenaline, simulation or not, and that he had gotten at least a little caught up in the excitement.</p>\n<p>On his way back to the relative back of the simulation room, Keith looked over at the window that Shiro was standing at. The back of his neck prickled as their gazes met and there was a shift in Keith’s expression that, Shiro imagined, would have been imperceptible to anyone else, along with the slight lowering of his shoulders. The passiveness gave way to an undercurrent of anticipation that Shiro wasn’t sure Keith was aware that he was expressing.</p>\n<p>Shiro just smiled and smiled more when Keith’s mouth twitched, before he looked away.</p>\n<p>“There you are, Shiro,” Adelina said behind him and Shiro half turned to face her. “I’ve been looking for you.”</p>\n<p>“Sorry,” Shiro said as he stepped away from the window and followed her down the hall. He glanced back, once, and felt an inkling of disappointment when he saw that Keith’s expression had settled back into something uncaring.</p>\n<p>——</p>\n<p>When Keith came across Shiro one weekend, it only took their eyes meeting for Shiro to smile and tip his head meaningfully. Keith jumped at the chance, feeling keyed up and tense and wanting to get away. Out of the endless and cold walls.</p>\n<p>Shiro drove out of the Garrison, like last time, and let Keith take over. He drove and drove and pretended that Shiro’s grip on him didn’t made him hyperaware of every last inch of his body.</p>\n<p>They kept driving until the sun was going down, and Shiro didn’t complain once, even though Keith didn’t have a destination in mind.</p>\n<p>They just drove.</p>\n<p>——</p>\n<p>Shiro only heard about the fight because he overheard a few other people talking about it. When he heard the name Keith get thrown around he started towards the infirmary immediately. Inside of the infirmary, the nurse was nowhere to be found, and there were two different private rooms with the door closed, but one had a completely clear window whereas the other one was shaded. In that room was the nurse and another cadet who definitely looked worse for wear. That eye would bruise viscously and his lip was split, from what Shiro could see.</p>\n<p>He made an immediate beeline for the other room, instead of lingering.</p>\n<p>Keith was sitting on the bed in the other room, holding an ice pack to his cheek and looking more pissed off than anything else. When the door slid open Keith had looked up and there was a flicker of something in his eyes that Shiro couldn’t grasp before it was gone, just like that.</p>\n<p>“I already got chewed out by someone else, okay? I don’t need you to lecture me,” Keith said sourly.</p>\n<p>Shiro couldn’t help but laugh, because that was just something so classically Keith to say. He closed some of the distance between them and let the door slide shut behind him. “I’m not here to lecture you, I promise. I heard about the fight and got concerned.”</p>\n<p>“Why?” Keith said and his lips were thinning.</p>\n<p>Shiro opened his mouth and then closed it after a moment because he had a feeling that any answer that he gave Keith wouldn’t have appeased him in the least. Keith was keyed up and irate and would, probably, jump at any chance to tear into Shiro. Instead, he stepped a little closer and ignored the ways that his hands practically itched, inexplicably wanting to touch Keith. “You wanna talk about it?”</p>\n<p>“No,” Keith said with such immediacy that Shiro leaned back a bit, willing to wait him out. Everything about Keith was practically screaming how defensive he felt at the moment. His shoulders were tight and hunched inwards and his eyebrows were set in a hard line, furrowed in the middle, and he was looking at the ground, instead of at Shiro. It was almost reminiscent of how Keith looked after confronting Shiro about buying the compression gloves for him.</p>\n<p>Shiro knew, because he knew Keith, that the fight couldn’t have been unwarranted. Keith was antagonistic by nature but he was also tended towards being a loner in general. Shiro rarely ever saw Keith around other people when he did see him around the Garrison, and when Keith was with people, he wasn’t talking to anyone. He was prone to standing off on his own and generally not paying attention to anyone around him.</p>\n<p>“Some asshole said something,” Keith finally said after a solid minute of silence. His words were slow and stilted and deeply unhappy and he still wasn’t looking at Shiro.</p>\n<p>“Did you throw the first punch?” Shiro said.</p>\n<p>Keith’s chest visibly expanded as he took in a deep breath, “Yeah,” he said on the exhale, looking up but off to the side of Shiro’s face. “He just. Wouldn’t shut up.”</p>\n<p>“You shouldn’t let the things people say about you get to you,” Shiro said, but his words rang false in his own ears. Keith’s unaffected persona wasn’t false in the least —— he had never once cared what anyone else said about him, and instead forged onwards regardless of everything. It was something both admirable and worrying about Keith.</p>\n<p>“He didn’t say anything about me,” their gazes caught for a moment before Keith immediately looked away again, as if it was too much to keep looking right at Shiro. “He was. Saying bad things about —— you.”</p>\n<p>The words sounded forced out of his throat, as if they were barbed and digging into his skin and it was almost painful to say. At least as painful to say as they were to hear. It felt like Shiro had been punched in the solar plexus and he felt breathless with it. A billion things suddenly crowded his head, thoughts screaming and whispering and pushing and shoving in an attempt to make themselves known.</p>\n<p>Shiro was moving forwards before he really thought about it —— something about Keith made him compulsive in a way that he often wasn’t —— and he said, voice a little high and a little surprised, “Keith,” before cutting himself off. His hand was already reaching out for Keith, but paused a few inches from his face.</p>\n<p>Keith glanced at him and he still looked furious but there was embarrassment and something else softening the anger that had been lining his expression. After a moment, he tipped himself forwards and Shiro could feel his fingers brushing against Keith’s forehead. He took a slow, almost shuddering breath, and stepped a little closer, his hand shifting until he could cup Keith’s cheek, and then his jaw, tipping his head back and up so that they were looking at each other.</p>\n<p>“You got into a fight for me?” Shiro said, voice going soft.</p>\n<p>“Kind of,” Keith said, gaze finally settling on Shiro, no longer flitting around like a bird.</p>\n<p>There were a few heavy moments of silence before Shiro let a chuckle slip, “You were defending my honor, Keith.”</p>\n<p>Keith groaned audibly and his body lurched forward, jaw sliding out of Shiro’s grip. Instead, his forehead rested against Shiro’s chest, which he allowed. He settled a hand on Keith’s shoulder, even. “Don’t say it like that, saying it like that makes it sound like——”</p>\n<p>Silence fell again and Shiro glanced at the ice pack that had been left on the infirmary cot. His hand drifted from Keith’s shoulder to the back of his head and he buried his hand in his dark hair. It was getting a little long, again.</p>\n<p>“Can we get out of here?” Keith said, voice a little muffled.</p>\n<p>“How much trouble are you in?” Shiro said because he had to, though he knew it wouldn’t matter much in the end.</p>\n<p>“I’ll be on cleaning duty for a week.”</p>\n<p>Shiro ruffled Keith’s hair playfully before stepping back, offering a hand to help Keith up. “Alright, let’s go.”</p>\n<p>Luckily, the guy on guard knew Shiro personally and didn’t ask any questions when they drove out of there. Keith let Shiro drive and he already knew where to take both of them and started off in that direction. The moon was rising when they left and by the time he stopped outside of the small desert house stars were twinkling in the sky and the moon was high above them and the nighttime desert cold had settled in.</p>\n<p>“Do you stay the night here?” Shiro asked as they walked into the house, finding it just how they left it.</p>\n<p>“I’d rather not go back to the Garrison tonight,” Keith said and Shiro didn’t want to know what someone had said to him to make Keith more vindictive than he tended to be.</p>\n<p>“Let me see what I can do about the temperature situation, then,” Shiro said as he walked back to the front door, patting Keith on the shoulder once as he went.</p>\n<p>He circled the house and found a power generator on the back of it. Shiro opened the panel and clicked on the small flashlight he carried with him out of habit, checking the wires inside of it. He flipped a few switches and he straightened when he noticed a light flicking on out of the corner of his eye. He circled around the house twice more to make sure that he wasn’t missing anything before walking back into the house, shoving the door shut behind him.</p>\n<p>“Got the lights back on, but I can’t find anything that nods towards heat,” Shiro said, rubbing his hands together as he went.</p>\n<p>Keith was in the room right off of the main room which, to Shiro’s lack of surprise, was a bedroom. Keith had wedged the window open and was shaking out a blanket outside of it, getting rid of some dust. When he was done, Shiro took the blanket and handed him a pillow, and then switched out the pillow for another pillow and then the fitted sheet.</p>\n<p>“You can take the bed, I’ll sleep on the couch,” Shiro said as they put the bed back together.</p>\n<p>“There isn’t an extra blanket,” Keith said, brows furrowing again. “You should take the bed; I can sleep on the couch.”</p>\n<p>“Same issue,” Shiro said with a laugh. “How about this: we can share the bed. Body heat can be beneficial, since it’s only going to get colder.</p>\n<p>Shock drifted across Keith’s face for a moment, but it was different from the surprise that he displayed when Shiro did something nice for him. This was an expression that Shiro wasn’t familiar with, and Keith visibly struggled for a moment, and Shiro could tell that he was chewing on the inside of his cheek. “I guess we could share the bed,” he said hesitantly.</p>\n<p>“If you’re not comfortable with sharing a bed with me,” Shiro started reassuringly, because the thought of making Keith uncomfortable made something inside of him hurt.</p>\n<p>“It’s not that,” Keith interrupted him, staring right at him without even an ounce of distress in his expression. “It’s just —— it’s nothing. Yeah, let’s share the bed, it’ll be easier that way.”</p>\n<p>“Alright,” Shiro said before sitting down on the bed and leaning down to work his boots off of his feet. He took his jacket off after that and laid it down at the end of the bed, before slipping underneath the sheet. Normally, he was prone to sleeping shirtless, but he kept it on for the night.</p>\n<p>Keith shut off the lights and clambered into the bed soon after that, lying down with a heavy exhale. It was earlier than either of them would normally go to bed, but the drive out had taken about an hour, anyways. Lights out was probably being called back at the Garrison.</p>\n<p>The bed was big enough for two people but it wasn’t exactly spacious. There was palpable distance between both of their bodies, but Shiro could feel the heat rolling off of Keith’s body, anyways. Something settled in his chest, heavy and absolute and breathing around it was awkward.</p>\n<p>After a few minutes, Shiro turned onto his side and caught Keith turning away his head away sharply. Shiro grinned before rubbing at his cheek and wrestling he grin down. “How’s your face doing?”</p>\n<p>“It’s fine,” Keith said, hand reaching up to prod at where a bruise would doubtlessly form. Shiro grabbed at his hand instinctively, causing Keith to squint at him momentarily. “It doesn’t hurt that much. The bruise probably won’t be too bad.”</p>\n<p>“Is that the only place where you got hit?”</p>\n<p>“Yeah,” Keith suddenly sounded more intent when he said that, mouth curling with what Shiro imagined was pride. “I decked him and tried to walk away, but he surprised me. He tried to tackle me over, but I remembered to lower my center of gravity.”</p>\n<p>Shiro laughed warmly, squeezing Keith’s hand. “I shouldn’t say that I’m proud of you for using what I taught you in a fight against your own classmate, but you were defending my honor.”</p>\n<p>Keith pursed his mouth at him, looking momentarily put out. “He had it coming.”</p>\n<p>“I’m not condoning this behavior,” Shiro said sternly, though he was still smiling and he knew that Keith could see his smile in the darkness, “because I need to be a good upperclassman. Someone has to set a good example for you, after all.”</p>\n<p>“You’re not that much older than me,” Keith said incredulously, turning onto his side and smiling himself.</p>\n<p>“Those two years make a difference,” Shiro said with false solemnity, and he laughed when Keith rolled his eyes so hard that it actually looked painful.</p>\n<p>They fell asleep hours later and when Shiro woke up the sky was just starting to lighten outside and Keith was tucked up against his side. It took him a few moments to really register the fact that Keith’s head was on his shoulder and his hand was rested on Shiro’s stomach and it took a few more moments to realize that, objectively speaking, the right thing for him to do in this situation was to extricate himself from Keith’s body and go about his day. He did consider getting out of bed for a minute, but decided against it in the end.</p>\n<p>He didn’t want to wake up Keith, after all.</p>\n<p>——</p>\n<p>When Keith woke up, it was a slow and gradual sort of thing. The realization that he was pressed against Shiro was quick and abrupt and his heart stuttered and his hand immediately twitched before he stilled completely. When he glanced up, Shiro looked relaxed and asleep, and Keith took a few deep breaths.</p>\n<p>Then, he settled once more and relaxed back against Shiro, feeling the familiar and calming pressure of his hand on his shoulder.</p>\n<p>——</p>\n<p>A few days later, Keith opened his bedside drawer again and stared at the compression gloves that were lying harmlessly inside.</p>\n<p>“What are you doing?” asked his roommate whose name was maybe Sahil, sounding mostly confused and a little concerned, to Keith’s ears. It occurred to him that he had been staring at the inside of a drawer for too long to be considered normal, probably.</p>\n<p>“Nothing,” he said automatically, shoving the gloves into his pockets and tearing out of the room.</p>\n<p>——</p>\n<p>Shiro noticed Keith wearing the compression gloves the moment that he walked into the training room that night. He didn’t say anything and bit down his smile.</p>\n<p>When Keith asked him to cut his hair, again, he agreed with hesitation. He didn’t argue when Keith asked to get out of the Garrison a few days later, either, and he still didn’t argue when they spend the night at the desert house again, because it was convenient to.</p>\n<p>——</p>\n<p>“Can we spar hand-to-hand tonight?” Keith asked because he figured that it would be best to be straightforward about his request. It was also easier to be straightforward when exhaustion was pulling at him.</p>\n<p>Shiro looked surprised for a moment before his expression smoothed out and he nodded with a complacent sort of smile, “Sure we can. We can go until one of us is pinned. Let’s try to avoid causing any major bruises anywhere visible, though, okay?”</p>\n<p>Keith agreed and they set up the way that they normally did, and it felt strange for a moment, not holding something in his hands as he faced on Shiro. The oddity of it melted away faster than an ice cube thrown out into the summer sun, though, when Shiro started towards him.</p>\n<p>If there was something that Keith appreciate about Shiro, it was the fact that the older man didn’t handle him with kid gloves when it came to sparring. Keith wasn’t an expert at reading body language outside of knowing when someone wants to attack him, but he could tell when someone was holding back. Shiro didn’t hold back, though Keith guessed that he didn’t exactly just completely let go, either. They both were sweaty and panting in the aftermath of a spar, and while Keith had won occasionally, Shiro won the vast majority of them.</p>\n<p>The difference between sparring hand-to-hand and using a practice weapon was stark, though.</p>\n<p>Keith curved a punch at Shiro’s face, which was blocked seamlessly, and when he tried again Shiro ducked and darted forwards, arms going around his waist. The world flipped and spun and they grappled on the floor for a moment. Keith knew, instinctively, that if Shiro ended up above him the round would be over immediately, given the stark difference in their builds.</p>\n<p>When they stopped flipping, Keith had ended up on top, straddling Shiro’s waist. There was a split second where he considered being flustered by the position, his heartrate immediately spiking with the realization, but Keith was nothing if not pragmatic in the midst of battle. Not that this was a battle, but still.</p>\n<p>Technically, he could have won the spar if he tried to pin Shiro, but he also knew that it would be way too easy for Shiro to flip their positions.</p>\n<p>So he rolled off of Shiro and jumped to his feet, stepping back a few paces.</p>\n<p>Keith kept it up valiantly for a few minutes, but his grogginess was catching up with him fast. He movements weren’t getting sluggish, but they were getting sloppier, so when Shiro ended up on his back, holding his wrist against his back, he wasn’t particularly surprised.</p>\n<p>“You seem tired,” Shiro said, letting go of Keith’s wrist and kneeling up.</p>\n<p>Keith took a few moments to catch his breath before twisting so that he was lying on his back. Shiro was still kneeling over his body, and even though they weren’t touching at a single point, Keith felt breathless all over again seeing Shiro above him. It felt like electricity was crackling over his skin. “I guess,” he said, hand reaching up to rub at his cheek, before wincing when he pressed hard against his healing bruise.</p>\n<p>It was a different bruise, this time.</p>\n<p>Shiro fixed him with a chastising look before batting his hand away from his face. “Haven’t been sleeping well?”</p>\n<p>Keith grunted noncommittally, because the question was ridiculous. They had both been in the training room every night for the past four nights, so the answer was obvious. It would have been amazing that Shiro wasn’t tired, but Keith imagined that he had minimal problems getting to sleep when they parted ways.</p>\n<p>A part of him wanted to tell Shiro why he hadn’t been sleeping well. That part of him was bigger than he had expected it to be, but the part of him that wanted to keep that truth under wraps was slightly larger. Or it was just louder.</p>\n<p>Keith tensed slightly when there was a touch against his cheek and he turned his head, unsure when he had turned it away to begin with. Shiro ended up with his thumb slotted against the side of Keith’s nose and his fingers were spread so that he was skirting the bruise and Keith felt like he had just run a marathon. That star was burning inside of him and he wondered if it was going to burn him alive.</p>\n<p>Shiro looked solemn, face soft and head tilted and not a smile to be seen. Soon, though, that expression dissolved into that smile that Keith had (selfishly, maybe) started to associate with himself. “Happy birthday, Keith,” Shiro said quietly.</p>\n<p>Then he moved off of Keith.</p>\n<p>Keith had to lay there for a few moments to process what just happened. Sometimes he had to wonder if Shiro knew just the effect that he had on him, if Shiro had even the faintest idea. Shiro had appeared into his life with such abruptness that it should have been unsettling, yet Keith knew that Shiro wouldn’t have lingered if Keith hadn’t wanted him to. Everything that Shiro did was with such mindless gentleness that Keith was often at a loss with what to do with pretty much everything that Shiro did. It wasn’t even conscious kindness; it was just inherent to the man.</p>\n<p>Shiro gave him things without expectation and treated him like something important and shared parts of his life with him willingly and joked with him and treated him as an equal and wished him a happy birthday. That sort of thing shouldn’t have made his heart race and stomach twist in the way that it did, but Keith was an orphan kid, okay?</p>\n<p>Those things mattered to an orphan kid.</p>\n<p>He just wasn’t sure if Shiro knew that those things mattered.</p>\n<p>“How did you,” Keith began, before stopping. Shiro had used his data from the Garrison to program him into his hover craft. Shiro knowing his birthday shouldn’t have been so inherently shocking.</p>\n<p>A water bottle was placed into his line of vision and he took it wordlessly, looking up at Shiro, who was grinning softly. “I wish I could’ve gotten you a cake or something, but there isn’t anything like that here. Not surprising, considering the fact that this is an air force base. You can make a wish on the water, though, if you want.”</p>\n<p>Keith stared at him for a few moments before turning to his water and muttering, “I don’t want anything.”</p>\n<p>——</p>\n<p>Shiro wasn’t oblivious in the way that people tended to think he was. He was perfectly aware of the fact that people talked about him, that younger cadets looked up to him, that various people found him attractive. Some things escaped his notice, but he was self-aware.</p>\n<p>So he knew that Keith didn’t want nothing.</p>\n<p>That didn’t make it any less of a surprise when Keith showed up later that night when it was still his birthday, about twenty minutes after lights out was called.</p>\n<p>“Here to collect me for a late night training session?” Shiro asked, trying to sound humored. Keith was in his training clothes, but he looked dead on his feet.</p>\n<p>“Could I —— come in?” Keith said, sounding wan and the closest to defeated that Shiro had ever heard him. The immediate flutter of concern that he felt was less of a flutter and more an intense wave, really, but still.</p>\n<p>“Of course,” Shiro said, stepping back and letting Keith into his room.</p>\n<p>He lingered near the door as Keith took a few steps into his room and watched him as he looked around. Keith’s shoulders were sloped downwards and he looked smaller than he usually did and it occurred to Shiro, not for the first time but with more impact than the other times, that he was the only person that Keith had any sort of relationship with. Keith definitely wasn’t close with any of his classmates, and while all of the instructors praised him, they complained about him just as often. Keith was surrounded by people almost constantly because he lived in the Garrison, yet he was consistently alone.</p>\n<p>“Do you want to sleep here?” Shiro asked after a minute.</p>\n<p>Silence dragged before Keith said, “Yeah,” quietly and made a direct beeline for his bed. He kicked his shoes off and crawled underneath Shiro’s sheets in his training tank top and fitted shorts and Shiro lingered near the door for another few moments before starting forwards, himself.</p>\n<p>When he settled into his own bed, Keith was working at the Velcro on his compression gloves. Shiro watched as he twisted and leaned to put the gloves onto the bedside table and then settled there, facing away from him. After a few minutes, Keith flipped back over and pressed his head against the pillow, half of his face hidden.</p>\n<p>Shiro waited patiently.</p>\n<p>“My birthday is, uh,” Keith said, voice halting and small, before he cleared his throat. “My birthday is also the same day as the anniversary of my parent’s death.”</p>\n<p>Shiro was struck dumb for a moment, because while he had looked into Keith’s information, all that he had taken from it was his prints to program into the hover craft along with his birthday. It wasn’t his place to look into Keith’s past or anything else that, if Keith trusted him, he would tell him with time. The significance of Keith telling him this fact wasn’t lost on him, though he couldn’t dwell on that for very long.</p>\n<p>It just confirmed his suspicion.</p>\n<p>Shiro reached out for Keith and wove his fingers through his hair, palm cupping the back of his skull. He pulled, gentle and undemanding, leading Keith’s head until it was tucked beneath his chin. Keith moved with the motion easily enough, not hesitating. As if he craved the contact. Something inside of him felt hollow at the thought. “Is this okay?” Shiro asked, because this wasn’t unconscious cuddling in the middle of the night, and verbal confirmation was important.</p>\n<p>Keith shifted and then pushed at Shiro, who moved and ended up on his back. He held still as Keith shifted towards him and pressed against his side, head cushioning itself on Shiro’s shoulder. It was startlingly reminiscent of that night, weeks ago, in that old house in the middle of the desert. The major difference was the fact that Keith was curled in on himself, arms tucked between their bodies. “This is fine,” Keith said quietly.</p>\n<p>Shiro carefully settled an arm over Keith’s shoulders and moved the sheets a little bit so they were both covered sufficiently. He wasn’t sure if offering physical comfort was necessarily the right way thing to do in this situation, but it was what his instincts told him to do.</p>\n<p>His instincts hadn’t been wrong so far as Keith was concerned, so far.</p>\n<p>Shiro wasn’t sure when he fell asleep, but he remained awake and quiet until he was positive that Keith had fallen asleep, himself. It had taken a while for Keith’s breaths to even out and his body to go lax, but when it did Shiro closed his own eyes and let himself drift off, too.</p>\n<p>——</p>\n<p>A week later, Shiro was offered the chance to be the pilot for an exploration mission to Kerberos.</p>\n<p>——</p>\n<p>Keith heard the news through the rumor mill later that same day because their paths didn’t cross often when they weren’t purposefully trying to find each other.</p>\n<p>He may have accidentally broken a bo staff in the aftermath of the news.</p>\n<p>He avoided Shiro for a few days after that because he was petty and felt irrational anger towards the entire situation even though he knew that Shiro couldn’t have possibly turned such an offer down. Being offered such a chance at such a young age? No one would turn away from that. No one could turn away from that.</p>\n<p>Keith wouldn’t turn away from that. Furthermore, he didn’t have the right to be angry about Shiro agreeing to go away for an extended period of time. He had no legitimate reason to be angry about it. Yet he was still angry.</p>\n<p>So he avoided Shiro because Keith knew that he would lose his temper over it or over something else entirely and the idea of getting angry at Shiro was strange and didn’t sit well with him.</p>\n<p>The next time they met, Shiro looked worried and a little cautious but greeted him with a smile, nonetheless. Keith had expected to feel a spike of frustration and anger at the mere sight of Shiro, yet it felt an inexplicable calm wash over him. That was the effect that Shiro had on him, he thought dizzily, Shiro calmed him. Just like that.</p>\n<p>They didn’t talk about it.</p>\n<p>Or, Keith refused to talk about it. Same thing, really.</p>\n<p>——</p>\n<p>Shiro wanted to talk about it but didn’t, because he knew that Keith didn’t want to talk about it. He didn’t talk about the Kerberos Mission the way that he didn’t talk about the fact that the amount of drives they took had decreased significantly in the weeks after the mission was formally announced. The way that he didn’t talk about it when Keith’s hair was getting longer than the younger man preferred to keep it, yet he did nothing about it.</p>\n<p>Everything leveled out a month after Shiro accepted the assignment, anyways. Keith asked for another haircut and insisted on more drives and everything seemed normal.</p>\n<p>They both knew that it wasn’t, though.</p>\n<p>——</p>\n<p>The night before Shiro was supposed to leave the Garrison to prepare for the Kerberos Mission, he found Keith in the training room as he usually did. There was something bittersweet in seeing him, as there had been in the past few weeks ever since Shiro had accepted the position of pilot for such an important and esteemed mission. Something heavy drenched his veins and Shiro didn’t want to think of it as longing.</p>\n<p>“Let’s do something different tonight,” Shiro said with a smile and Keith, after a moment of hesitation because he threw himself into training with almost terrifying intent, agreed.</p>\n<p>He took both of them up to the roof of the Garrison, because leaving the grounds after lights out was too difficult for them to navigate that night. Shiro had, at least, taken a blanket with them to spread out on the metal roof and he grinned at Keith’s bemused expression, sitting down on top of it first.</p>\n<p>It felt a little bit like courting.</p>\n<p>Keith sat down next to him and said, “This is sappy,” in a dry tone.</p>\n<p>Shiro laughed, “We live in the middle of the desert, we may as well enjoy being able to see the stars in the sky.”</p>\n<p>They settled down into mutual and comfortable quiet and remained that way, just barely not touching up until the point that Keith shifted a little bit towards him and their shoulders pressed together. Shiro glanced at him and was, admittedly, charmed by the fact that Keith’s ears were turning red, and he shifted closer himself, until it was just natural for Keith to lean his head on Shiro’s shoulder.</p>\n<p>All of this felt inevitable, somehow. As if this was where they were going to end up that night when Shiro found Keith in the training room alone, no matter what. All paths would have led to this same exact situation.</p>\n<p>Keith was inevitable.</p>\n<p>“It’ll only be a year,” Shiro said, breaking their silence. He could feel the way that Keith tensed against him, and amended his statement, “There’s a chance it could take longer than that, but it’s not all that likely.”</p>\n<p>“I already knew that,” Keith said, sounding a little sulky, which made Shiro smile a little bit in spite of himself. “Everyone knows the basic details of the Kerberos Mission.”</p>\n<p>“I figured that you’d like to hear from me that I’d be coming back,” Shiro said honestly.</p>\n<p>“Why would you think that?” Keith still wasn’t looking at him, staring off to the opposite direction that Shiro was in.</p>\n<p>“Keith,” Shiro said gently, nudging at his hip.</p>\n<p>Keith turned, slowly and with apparent reluctance, and looked at Shiro. He didn’t say anything, though, remaining stubbornly silent. When Shiro repeated his name, sterner this time, Keith’s mouth twitched and he said, “Yes?” as if it were the biggest chore in the world to churn out that word.</p>\n<p>“What do you want?” Shiro’s tone had dropped to intent seriousness, holding Keith’s gaze and refusing to let him look away from him.</p>\n<p>Confusion colored Keith’s expression for a good ten seconds before it edged towards embarrassment and something else that Shiro couldn’t quite put a finger on. It wasn’t discomfort, because when Keith was uncomfortable he got angry, but it was something else entirely.</p>\n<p>Silence dragged before Shiro tapped his fingers gently against Keith’s jaw. “Keith, what do you want?”</p>\n<p>“I want —— I want,” Keith said, clearly struggling and wanting to look away from Shiro, eyes darting around his face. Shiro was aware that Keith was glancing at his mouth consistently, and he dropped his seriousness for a slow and careful smile.</p>\n<p>He curved his palm against Keith’s neck gently and pulled him forwards. Shiro could see the surprise flicker across Keith’s face and he swallowed a laugh before sitting up more and pressing his lips against Keith’s forehead, letting the kiss linger for a few moments before pulling away. A part of Shiro was delighted to see the way that Keith’s entire face slowly, but surely, turned a light shade of red, the blush spreading even to his forehead.</p>\n<p>“When I get back,” Shiro promised, leaning back down to pressed their foreheads together.</p>\n<p>“Why can’t you kiss me now?” Keith said because, apparently, a chaste kiss to the forehead abruptly gave him the ability to speak candidly about this. He definitely looked embarrassed about voicing the question aloud, but there was that stubborn set to his jaw again.</p>\n<p>“There are a few reasons,” Shiro said, because Keith deserved to know all of them. “For one, I know that I’m the only one you’re close to here, and I want you to be sure about whether or not you want this because you want this, not just because it’s convenient,” he gave Keith a look when he opened his mouth to argue. “For another, I’m leaving for a long term mission tomorrow, and I don’t want you to make this decision just because I’m leaving. Lastly, I’m not going to be back for a long time, and I don’t want to leave you here hanging and confused if we’re just starting whatever you want this to be. I don’t want to be that guy.”</p>\n<p>Keith’s jaw worked and Shiro knew that he was trying to point out any and all flaws in his reasoning, but there weren’t any. “You’re doing this because you respect me,” Keith said because even though he had a short temper and was irritable at the best of times, he was still a reasonable and analytical person.</p>\n<p>“Exactly,” Shiro said.</p>\n<p>Keith stared at him for a little bit longer before huffing and turning, pressing against Shiro’s side again and decidedly putting his hand on top of Shiro’s. Shiro could feel the fabric of the gloves against his hands and he leaned down to press a kiss to the crown of Keith’s head, shifting his hand so that Keith’s fingers slotted in between his.</p>\n<p>They watched the stars together in silence.</p>\n<p>——</p>\n<p>Keith wasn’t there to see him off the next morning, but Shiro wasn’t surprised. They said their goodbyes last night, after all, and Shiro knew that Keith understood.</p>\n<p>——</p>\n<p>The launch of the Kerberos Mission was broadcast on all of the Garrison monitors, though Keith would have watched it anyways. Class was paused in order to give all students a fair chance to watch the crew walk towards their ship, and there was a high hum of excitement and tension in the air. Keith lingered near the back of the room, arms crossed as he watched the monitor closely.</p>\n<p>Some of his classmates started a countdown for the ship’s takeoff, which he didn’t participate in. He thought about Shiro, instead, and the way that he fit against his side. Keith allowed himself a few moments to reminisce in those thoughts before pushing them away —— there was no use in stewing them.</p>\n<p>It would just make him miss Shiro more.</p>\n<p>Everyone waited with baited breath as the ship left the platform and there were only a few tight whispers until the ship left the earth’s atmosphere. The entirety of the class started cheering the moment that it did, boisterous noise that rolled over Keith in waves.</p>\n<p>“There he goes, my hero!” said a loud classmate who Keith was pretty sure was named Lloyd. Maybe.</p>\n<p>For a moment he considered making an acerbic comment about how the guy couldn’t have possibly known Shiro all that well, but he swallowed the words. No point in rocking the boat.</p>\n<p>Missing Shiro wasn’t surprising. He had expected it, and had prepared for it. Keith compartmentalized missing Shiro because that was all he could do, given the situation. He wrapped the faint hurt up tightly and tucked it away in his mind because he refused to be that person who made missing someone become debilitating.</p>\n<p>He wasn’t missing a limb. He was just missing a person.</p>\n<p>——</p>\n<p>Keith didn’t go looking for information about the Kerberos Mission.</p>\n<p>Then the crew disappeared five months in.</p>\n<p>——</p>\n<p>When Keith was younger and lived in an orphanage he got into trouble consistently. Surprise, surprise. His temper was short and his patience was thin and he was angry and lost in the world and got into at least two fights a week, brawling with other kids from the orphanage or kids from school. Every time it happened, the workers at the orphanage sighed resignedly and sat him down, lecturing him as they tended to his scrapes and bruises.</p>\n<p>Every last one of them told him, at one time or another, “We need to work on your impulse control, Keith.”</p>\n<p>They would be disappointed in him if they could see him in that moment. It was a good thing that Keith didn’t care what other people thought of him.</p>\n<p>Well, he cared what one person thought of him.</p>\n<p>“He’s not dead!” Keith was aware that he was yelling and that he was being restrained by two people and he had only the faintest memory of making his way into the colonel’s office. It was all a blur, to be honest, from the time that the news dropped in the middle of class until now. He was pretty sure that he had fought his way through several guards to get there, though.</p>\n<p>“Get yourself under control, cadet,” the man was demanding and Keith couldn’t even remember his name, “you may be the best pilot in your class but you do not have immunity. We will take more severe disciplinary action if you don’t leave this room right this second.”</p>\n<p>“You’re not even launching a rescue mission,” Keith pressed on, voice going louder and higher because he was furious and the anger was burning through his veins and this man’s face was infuriating him. “You don’t even fucking care.”</p>\n<p>“It was a crew error, cadet,” the colonel said, a disgusted look crossing his face. “There’s no sign of that crew, likely due to an error on Shirogane’s part, and they’re lost to the cold grip of space.”</p>\n<p>Keith twisted hard and kicked at one of the guards holding onto him and shoved the other one away while he was at it. It was like he flew across the room and he clutched at the colonel’s lapels, dragging him in close and glaring venomously. “Don’t talk about him like that, he was the best that this damn place had, and you’re leaving him to die.”</p>\n<p>“He’s already dead, cadet.”</p>\n<p>He knew that his face was turning into something ugly and wretched that Shiro would have taken one look at and smoothed out, both physically and verbally. A thumb between his eyebrows, palm against his cheek, a gentle and considerate smile on his face. Soft words saying wonderful things that would cause Keith to unclench, to relax, because it was Shiro.</p>\n<p>It felt like that star that Shiro had unknowingly ushered to life inside of him had collapsed. The black hole was going to swallow him alive.</p>\n<p>Keith shouted nonsensically and was very aware of the fact that he was throwing a tantrum, that he was letting his frustration and anger and grief fuel him. He grabbed the colonel’s desk because it was the most convenient thing and he heaved it, tossing it off to the side and feeling a cruel sense of satisfaction at the way that everything crashed to the ground.</p>\n<p>The colonel had crossed from stern and unamused and vaguely angry to looking as furious as Keith felt and, maybe, a little disappointed. That disappointment had no impact on him, though, and he glared, panting a little bit through his anger.</p>\n<p>“Expelled, cadet. Pack your things and get out of my base.”</p>\n<p>Keith stalked out of the room and started running when he turned a corner and ignored the fact that the guards that he knocked over were just picking themselves off of the floor. He sprinted to his room and skidded to a stop outside of his door, slamming into the keypad and wishing that he could slam the actual door open. His roommate wasn’t there, whatever his name was, and Keith wasn’t sure if he was glad for that or not.</p>\n<p>He grabbed the bag that he came to the Garrison with and threw all of his belongings into it. There wasn’t much. A few changes of clothes and he shoved some of the training clothes into his bag because he was feeling vindictive. The compression gloves were the last things to go into the bag and he jolted to a stop at the sight of them.</p>\n<p>His throat tightened and he tried to swallow but it felt like trying to ingest thumb tacks. Keith could feel his eyes burning and that jerked him back into motion as he jammed the gloves into his bag and shook his head hard, refusing to let tears fall because he couldn’t. He couldn’t.</p>\n<p>Keith didn’t get attached to people for a reason.</p>\n<p>He pulled his jacket on and started for the front door of the Garrison before thinking better of it and, instead, made a beeline for the garage. He shouldered past people roughly as he went, shoving his way into the garage and ignoring the few people who were already in there. No one quite said anything until Keith threw his leg over Shiro’s hover craft and started it up.</p>\n<p>That was when people started protesting.</p>\n<p>It didn’t matter, though, because he was already accelerating out of the building, not bothering with a helmet. Alarms started going off as he went, and a few people gave him chase, but he lost them easily as he darted through the desert, weaving and not once looking back.</p>\n<p>He made his way to a nearby city with dry eyes.</p>\n<p>——</p>\n<p>He started wearing the compression gloves constantly.</p>\n<p>Keith supposed that was how he was dealing with his grief. He wondered if there was something wrong with him, since he hadn’t cried yet. He had skipped right past the depression mode of grief and tripped into something close to acceptance.</p>\n<p>It wasn’t acceptance, though. Whatever he had settled on was too ugly and bitter and stricken to be acceptance.</p>\n<p>In the three weeks after he arrived in the city he found himself consistently looking towards the desert. There was something tethered to his heart that was tugging and pulling and yanking at him, an innocuous sort of feeling. It was nothing. It should have been nothing. There was something in his mind whispering to him, though.</p>\n<p>So he gathered his meager belongings and the money that he had made being a temporary mechanic and made his way back out into the desert. It had been months since he had returned to the desert house, so it took the better part of the day to find it, but he found it eventually.</p>\n<p>Keith cleaned up the house for the two weeks after he arrived there. He cleaned meticulously and carefully and cleared out the dust and went through what little was left there and followed his instincts in an attempt to figure out what had drawn him out there. In general, he had never really subscribed to the idea of magic and mysticism, but what else did he have?</p>\n<p>Shiro was dead and Keith had wrecked his own potential to become a fighter pilot.</p>\n<p>It took him another month to find the caves with carvings of lions and he analyzed them carefully. He ended up using the old corkboard that had been left in that book, pinning up pictures and trying to piece a story together. Another few months after that, he found some other caves with similar carvings inside of them.</p>\n<p>His hair was getting long. He didn’t cut it.</p>\n<p>Sometime between month six and seven he came to the belated realization that he was in love with Shiro and got irrationally angry at the man. Keith wasn’t sure if he was pissed off that Shiro went and died when he made a promise to come back or if he was pissed off that Shiro was logical and caring and didn’t want to push Keith into anything.</p>\n<p>Now it was too late.</p>\n<p>Keith worked himself into exhaustion to stop thinking about it.</p>\n<p>This was the thing: Keith wasn’t used to forming emotional attachments to people. It didn’t happen in his life. Attachments were inconvenient and not beneficial, as far as he knew. He didn’t even make the time to learn the name of his roommate or any of his classmates, because they didn’t have any impact on his life except for existing in his periphery. That was how he operated.</p>\n<p>Until Shiro came along.</p>\n<p>Shiro worked his way into his world and only settled himself in when Keith gave the okay for him to do so. Latching onto Shiro was, probably, not at all surprising considering the fact that Keith had gone for so long without any legitimate meaningful human contact. When Keith really thought about it, the belief that he had fallen in love with Shiro was, potentially, grief fueled and there was the chance that he wasn’t actually in love with Shiro.</p>\n<p>Losing him hurt a hell of a lot, though.</p>\n<p>So when, somewhere between month thirteen and fourteen, Keith felt the abrupt pull to go back to the Garrison, he went with it, because the hurt hadn’t dulled and he could only chase after some fairy tale for so long.</p>\n<p>Finding Shiro was a miracle that had relieved him so much that he could have collapsed underneath it. Finding Shiro a little more broken and a little more jaded and suffering from some amount of amnesia was all the convincing that Keith needed to swallow down his feelings and compartmentalize them and put them away. Keith refused to be that guy.</p>\n<p>——</p>\n<p>Sometimes, in quite moments, Keith would look at Shiro and catch him looking at him with a quiet and considering look. Then something would crash in and interrupt and somehow, some way, Keith barely got a moment alone with Shiro.</p>\n<p>A part of him was glad for that.</p>\n<p>——</p>\n<p>Shiro knew, on many levels, that he had to talk to Keith. That they had to sit down and have a proper conversation about whatever it was that laid between them, because he remembered. He did. His memory suppression only got rid of memories from his imprisonment, not the time before. So he remembered with startling clarity that he clung to because everything else was so muddled that he couldn’t bare turn away from something that was so clear to him.</p>\n<p>Things kept happening, though, and there was never a moment to rest. Between the lions and Voltron and trying to learn how to save the entire universe and everything with Pidge and the haunting flashbacks and training Lance, Pidge, and Hunk, there was just no time. When there was any semblance of downtime, Keith went straight to the training room and Shiro was pulled in some other direction.</p>\n<p>During his imprisonment, Shiro hadn’t been given much time to think, either. There were other things to worry about, other things to consider, like surviving and his escape from that place. He could remember, dimly, missing Keith just as often as he missed home itself, but it wasn’t something that he could allow to consume him. There had been guilt when he considered how he left Keith, but he had hoped that the younger man could forage on well enough on his own. Keith was strong and capable and had leagues of potential before him, and Shiro had both accepted whatever fate would come for him and allowed that to bolster him, because he wanted to witness the way that Keith would grow.</p>\n<p>He suspected that he had idealized Keith a little bit, stranded in an alien ship, since Shiro had forgotten to take into consideration Keith’s temper and tendency towards rash decisions.</p>\n<p>“Defended my honor again?” Shiro had said in one of the few moments that they had gotten alone. They both knew he was referring to Keith’s expulsion from the Garrison. Shiro had felt no small amount of distress when he learned of the fact that Keith had been alone for over a year, lost and wandering, but there wasn’t anything he could do about it, anymore.</p>\n<p>Keith had flushed a little bit at his ears, turning his head away with an irate expression, and Shiro had laughed, feeling familiar fondness twisting in his chest. Allura had summoned them, then, and off they went.</p>\n<p>So he watched from a distance, relearning the younger man from afar. Shiro was aware of Keith watching him in return. He was glad to see Keith unravel a little bit as he became accustomed to being around other people constantly and was proud to see him take so strongly to the new responsibility given to him.</p>\n<p>Neither of them were reaching out and Shiro wasn’t sure what that meant for them, and for whatever future they may have had before everything changed. He didn’t have much time to consider it, though, before the castle became a ship and then Allura was abducted and they went to save her and Shiro saved Keith and they were cast out of a wormhole.</p>\n<p>The last that Shiro had seen of Keith, his lion had been damaged and dead in space and Keith himself had just fought their greatest enemy in a fit of anger and frustration to try to protect Shiro. So, in the time that they were separated he worried. Incessantly. Absolutely. It was like an itch beneath his skin. They were all a little worse for wear after their battle against Zarkon from what Shiro could remember, but Keith was the only one whose lion couldn’t move at the time of their separation, and he agonized over it. Wished that he had held onto the Red Lion a little bit longer.</p>\n<p>Shiro moved forwards with a level head with the goal of getting back to his team, but his concern for Keith was a constant hum at the back of his head.</p>\n<p>Keith was his inevitability, after all. That hadn’t changed.</p>\n<p>So when they all managed to come back together again, it didn’t surprise Shiro in the least that he headed straight for Keith, and it didn’t surprise him that Keith didn’t resist the closeness between them.</p>\n<p>He reached and got a palm curved against Keith’s cheek and another on his neck and he was gently tipping his face this way and that. There were only a few scratches and some signs of exhaustion, but there was that same determination burning in his eyes that had always been there, and the relief that Shiro felt could have collapsed his chest inwards.</p>\n<p>“Are you okay?” he asked aloud anyways, just to make sure.</p>\n<p>“Yeah,” Keith said, subtly leaning into the hand on his face.</p>\n<p>“Uh —— guys?” Lance said confusedly.</p>\n<p>They didn’t quite jump apart, but they did disengage shortly after that, and Shiro made his rounds to check on the rest of the Paladins. By the time that he was done, Keith was already gone.</p>\n<p>——</p>\n<p>The resolution that he had made to lay his feelings for Shiro to rest in order to give the man space to find himself again held strong for a while. Longer than Keith had assumed it would, to be fair. His worry for Shiro was a consistent buzz in his mind, but he knew that distancing himself from Shiro was the right thing to do.</p>\n<p>Immediately turning away from his assigned mission to try and save Shiro didn’t undermine his decision in any way. Fighting Zarkon out of the instinctive need to protect Shiro in the way that Keith had wished he could have in the aftermath of the Kerberos Mission undermined it a little bit, maybe.</p>\n<p>A part of him wasn’t surprised when Shiro came to his rescue when he most needed it.</p>\n<p>Then they were separated and cast throughout the universe and when they came back together, Shiro had gone straight to him and touched him with something that could have reverence but was likely pure worry. The touch, though, sparked something inside of him that threatened to catch and turn into a wildfire. It could have been another star being tossed into him, too.</p>\n<p>Shiro had been watching him and Keith was keenly aware of it in the way that he was aware that he had been watching Shiro, in spite of the resolution he had made. It only took a few hours of training out some tension and ignoring the fact that he should probably see to his minor wounds to come to a decision.</p>\n<p>Keith knocked on the door and pretended like he didn’t feel unspeakably glad when it slid open and Shiro was standing behind it.</p>\n<p>(He was also pretty glad that Shiro was shirtless, but that was something else entirely.)</p>\n<p>“Keith,” Shiro said, quiet in the midst of the silent night. He didn’t sound surprised.</p>\n<p>“You asked me what I wanted,” Keith said, even though that was more than a year and a half ago. Shit, that was almost two years ago.</p>\n<p>Shiro nodded, head bobbing, before he stepped back and allowed Keith into the room. He took the silent invitation quickly, stepping into the room and glancing around it. Meticulously neat, the way that Shiro’s room at the Garrison had been, too. Something in him melted a little bit at the sheer familiarity of it.</p>\n<p>“Ask me again,” Keith said, an edge away from demanding, as he turned back to Shiro.</p>\n<p>They were standing close together because Keith hadn’t come in all that much from the door and he was, strangely, stricken by the fact that Shiro had someone gotten bulkier. The difference between their statures had always been obvious, but it was even clearer, now. Keith wondered if he should feel self-conscious about that, but with the intent way that Shiro was looking at him, he didn’t really care.</p>\n<p>“What do you want, Keith?”</p>\n<p>“I want you,” Keith said with sure confidence, because he had been given over a year to think about how he felt about Shiro. In that time, he had even ended up befriending other people, albeit not willingly, and his feelings for Shiro still persisted regardless of the fact that he had people that he could consider comrades and friends. There was no inherent and immediate thing that could separate them, as far as he knew, and Shiro would remain near him for the foreseeable future by sheer coincidence of their new occupations.</p>\n<p>Protectors of the universe. Amazing.</p>\n<p>Shiro stared at him for a few moments longer, eyes roaming his face. Looking for a sign of hesitation or something, probably. Keith understood his reservations but rolled his eyes, anyways, and stepped up close to Shiro, wanting to touch him. He didn’t, because he had no idea where to put his hands, but he did tip his head up and fix Shiro with an impatient look.</p>\n<p>The older man let out a huff of a laugh, a fleeting sort of thing that was meant to amuse and not insult, before curving his palm around the back of Keith’s skull and leaning down to kiss him.</p>\n<p>The last time Keith had kissed someone was years ago when he lived in an orphanage. One of the girls who lived there had wanted to kiss him and shyly asked if she could on Valentine’s Day, and he agreed because he didn’t really mind one way or another. It was a nice enough kiss, quick and fleeting, though it was awkward.</p>\n<p>This kiss was nothing like that one.</p>\n<p>It wasn’t a gut dropping, knee buckling, limb melting passionate kiss by any means, and it was probably a little weird because Keith’s mouth was slightly open going into it, but it was a firm and intent sort of kiss. Maybe it could be considered underwhelming, considering the amount of buildup they went through, but it was sincere and absolute and felt like the perfect culmination of everything that had led up to this moment. Keith ended up with his hands on Shiro’s arms and, when Shiro pulled away, he chased after him immediately to claim another kiss, much to Shiro’s amusement.</p>\n<p>Keith could tell because Shiro was smiling against his mouth.</p>\n<p>Shiro let Keith kiss him and kissed him in return, letting Keith press in and move out as he wished. Eventually, Keith wrapped his arms around Shiro’s neck and Shiro’s arms were around his waist and the kisses shifted from intent and seeking to lazy and slow.</p>\n<p>When they laid down, Keith tugged Shiro so that he was onto his back and, for a moment, considered the fact that he was being a little bossy. Then, he decided he didn’t care, and settled down with his head on Shiro’s shoulder, arm lying across his bare abdomen. Keith could feel Shiro trailing is fingers up and down his back, and he found that he didn’t mind. It was more soothing than anything.</p>\n<p>Exhausted from the journey to bring the lions back together, Keith felt himself dropping off more quickly than he expected. He still had his head about him, though, and pressed his mouth against Shiro’s collarbone, whispering against his skin, “Happy birthday, Shiro.”</p>\n<p>The hand tracing lines up and down his back paused for a moment and Keith felt, more than heard, Shiro's low chuckle, “How did you know just what I wanted?”</p>\n<p>Keith smiled against his skin and closed his eyes.</p>"
}