{
  "id": "7373302",
  "url": "https://archiveofourown.org/works/7373302?view_full_work=true",
  "author": [
    "Baneismydragon"
  ],
  "title": "A sure thing.",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M"
  ],
  "fandoms": [
    "Miraculous Ladybug"
  ],
  "relationships": [
    "Chat Noir/Ladybug",
    "Adrien Agreste/Marinette Dupain-Cheng"
  ],
  "characters": [
    "Marinette Dupain-Cheng",
    "Adrien Agreste",
    "Chat Noir (Miraculous Ladybug)",
    "Chloé Bourgeois"
  ],
  "additional_tags": [
    "Fluff",
    "Identity Reveal",
    "Snark",
    "marichat kinda...",
    "Adrien can totally be a little brat when he wants to",
    "Honestly I don't know why I keep writing these things",
    "I am such Trash"
  ],
  "language": "English",
  "series": "Part 3 of it was always you",
  "published": "2016-07-03",
  "completed": "2016-07-14",
  "words": "11,871",
  "chapters": "2/2",
  "comments": "419",
  "kudos": "9,105",
  "bookmarks": "1,461",
  "hits": "103,074",
  "summary": "<p>“Tell you what Princess, I will make you a deal. If you ask him out and he rejects you, like you seem to think he will, I will never drop by for any unscheduled visits that don’t involve purple butterflies again. However, if I am right and he says yes, then not only do I reserve the right to continue basking in your presence whenever I so choose, but you will also provide me with free croissants every Monday, Wednesday and Friday for the next two months.” </p>\n<p>“You don’t want to make this bet kitty.” </p>\n<p>“Oh, I am pretty sure I do.”</p>",
  "notes": "<p>This story is TECHNICALLY the alternate sequel to \"To Make You Smile\" But can honestly be read as a stand alone fic. </p>\n<p>Hope you enjoy and see the end for more notes!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>So yeah apparently my 1 shots end up being 11k+ words and two chapters because I have a problem &gt;_</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>Once again thank you so much to everyone who has taken the time to read this crazy little fic of mine! It really was fun to write and I was excited to have a chance to play with a more friendship take on the Marichat relationship. </p>\n<p>Hopefully I will see you again for some of my other stories! If you are following the \"It was always You\" series there are more chapters coming for \"To See the Forest for the Trees\" as well as the other alternate Ladrien follow up! </p>\n<p>Also I have two other massive multichapters that will be starting up here soon that I am really excited about! </p>\n<p>Please Please feel free to leave comments and reviews! The more I read the more I write so help inspire a lazy artist!! ^_^ And feel free to follow for snippets and other musings on my tumblr @baneismydragon </p>\n<p>Love to you all, till next time!</p>\n<p>Bwahahahahaa end of part 1. Part 2 will be out soon. It just started getting away from me. </p>\n<p>This was suppose to be a 2000 one shot. &gt;_&gt; Yeah. About that. </p>\n<p>Anyways I hope you liked it so far please leave comments or reviews as they feed my soul! <br>Also feel free to follow me on tumblr @baneismydragon if you like my work and want to see more of my random Ladybug trash! Or even if you are bored and want someone to bother with random questions, I am flexible!</p>",
  "text": "<p>Marinette was looking forward to going home, falling into her bed, and hopefully falling asleep as quickly as possible. It had been a particularly stressful day all around, and for once it wasn’t Papillion’s fault.</p>\n<p>No, her day had been ruined by his number one assistant, Chloe.</p>\n<p>Marinette was used to Chloe’s constant bullying and cheap insults, and normally just brushed off the attacks of her spoiled classmate. However, this time the spoiled pest had stepped up her game to a whole new level.  Scalding hot coffee dumped on her at the beginning of the day, getting knocked over in the halls on the way to and from different classes, even getting locked into the restroom and adding yet another tardy make to her already disastrous record. To give credit where it was do, Sabrina was doing most of the work.</p>\n<p>She knew why of course. Adrien. The more attention he paid to Marinette, the worse Chloe’s attitude became. It was a clear message- stay away from Adrien or else.</p>\n<p>Well Chloe could torture her all she wanted, because Adrien’s courteous attention was the highlight of her world. His hopeful smiles when he saw her in the mornings, his endearing attempts to include her in conversations during the day, his numerous invitations for her and Alya to join him and Nino for lunch. And lately, the long soul searching stares, his eyes full of an intensity that left her heart racing and her stomach in knots. Somehow, she had become someone that Adrien wanted to be around, someone he wanted to talk to and get to know, despite his obvious confusion at her constant awkwardness.</p>\n<p>If only she could be half as composed as he was when faced with this new wave of attention from the love of her life and, god willing, father of her future children.</p>\n<p>Sometimes she could manage whole conversations, especially if other people were present or they had a prearranged topic such as schoolwork. She even felt she could say they were truly friends now. But whenever she tried to instigate anything with him on a more personal level, she would often find herself reverting back into a blushing, stuttering mess.</p>\n<p>Marinette trudged up the stairs to her home, grateful that her parents were busy in the bakery so she didn’t have to tell them about her day until she had a chance to calm down and play off her frustration.</p>\n<p>She clambered up all three flights of stairs to her bedroom, looking forward to the calming familiarity of her own private space.</p>\n<p>Her entire expression darkened as she took in the jarring mass of black that stood in stark contrast to the soft pink of her comfortable, if occupied, room.</p>\n<p>“Chat, what are you doing here?”</p>\n<p> This was just getting ridiculous. It was the third time this week that he had visited her, and Marinette was reaching the end of her patience with the increasingly clingy cat boy currently grinning at her like he had just eaten a canary from his casually sprawled position in her desk chair.</p>\n<p>“I wanted to talk to you princess.”</p>\n<p>“I already told you not to call me that, I have no interest in your ridiculous flirtations Chaton.”</p>\n<p>“So you keep telling me, and yet I just can’t help myself.” He smiled, pushing off with his feet and spinning the chair in dizzying circles.</p>\n<p>“No! No spinning, no flirting, no nothing! It’s bad enough that I constantly find you nesting on my balcony, but now you have broken into my room!” Marinette seethed.</p>\n<p>“OK first- you left the trap door open so I did not break in.” Chat replied calmly, still not budging from the chair. “And secondly, I simply enjoy spending time with you and occasionally cat napping while I wait. Your balcony is wonderfully sunny you know. Besides I am not a bird, I don’t nest.”</p>\n<p>“You set up your own lawn chair on my roof!” She hissed through gritted teeth, grasping on to his arms and yanking to remove the smirking boy from HER chair. Unfortunately, without the strength granted to her with her transformation, it was proving to be a much more daunting task.</p>\n<p>“Well you didn’t like me stealing yours, as you put it, and the ground wasn’t as comfortable.” Chat grinned, clearly enjoying her struggles to dislodge him.</p>\n<p>Giving up on trying to pull him up Marinette, twisted the chair so that she could grip the back and simply tilted the whole things forward, dumping the irritating feline onto the floor.</p>\n<p>Instead of giving her the satisfaction of falling into a heap, Chat rolled into a summersault and vaulted gracefully to his feet, bouncing on his toes like a kid on a sugar rush. Marinette glowered. She was not impressed.  She absolutely was not. There was definitely nothing impressive or attractive about the fidgeting 6 feet of blond and leather currently smirking at her.</p>\n<p>Maybe if she climbed up to the terrace he would stalk after her and she could push him off the balcony. That might wipe that self-satisfied look off his face.</p>\n<p>Marinette sighed. She would never actually do it, even if she knew that he wouldn’t actually be injured by the drop while transformed. “Don’t you have other places to be?”</p>\n<p>“Probably. But this is far more important.” Chat replied lightly, hopping forward slightly towards her.</p>\n<p>“Just come back another time, I have had a really rough day Chat.” Marinette tried, hoping to maybe salvage her plan of a long stress free nap.</p>\n<p>“While I would normally never deny such a lovely lady anything that she asks for, there is a matter of utmost importance that I must speak with you about.”</p>\n<p>“And what is that?”</p>\n<p>Chat stepped forward closing the distance between them and placing his hands on her shoulders. Marinette froze against his touch, which was silly because this was just Chat. Chat whom she did not have feelings for. Chat who was not becoming an increasingly recurring character in her more romantic daydreams. Chat was not allowed to take her breath away with his cheeky smiles and soft expressions.  Chat who was leaning down towards her so that their faces were mere inches apart looking at her with a hungry expression that made her skin heat with something that definitely wasn’t irritation and that she knew she would later be filing in that increasing large mental folder of moments she pretended never happened.</p>\n<p>He flashed her a terrifyingly triumphant grin and before she could even process what he was doing spun her around so that she was now staring dumbly at the wall above her computer.</p>\n<p>“I think it’s time we had a chat about your choice of décor princess.” He whispered into her ear.   </p>\n<p>Marinette felt every ounce of blood drain from her face as she stared at the massive collection of posters plastered across her wall. She was never going to live this down. Chat was going to tease her until the end of time. Of all the people in the world to have discovered her collection this was the second worst scenario she could have envisioned, with Adrien himself being the first.      </p>\n<p>“I don’t know what you are talking about!” Marinette blurted out desperately. She immediately regretted the pathetic attempted at deflection when Chat dissolved into hysterical giggles.</p>\n<p>“You’re wall is plastered with photos of a boy your age, half of them surrounded by heart doodles.” He smiled at her, but his expression was less devious that she would have expected given how easily he could now tease her about her crush. If anything his countenance was sheepish, his eyes still sparkled with that ever present sense of mischief and a gleam of something else she couldn’t quite identify, but she could just catch the slight furrowing of his eyebrows behind the mask, and his lower lip was curved under his teeth. That was odd. She had only seen him bite his lip when he was bracing for another rejection from Ladybug.</p>\n<p>“So? What of it?” Marinette countered, but her anger and bravado had largely faded in light of his uncharacteristically shy demeanor, and her voice quavered.</p>\n<p>“Come on Princess, even I can figure out what that means.” His voice was soft and almost hopeful. It seemed out of place for her feline friend, but still it struck her with a strange sense of familiarity.</p>\n<p>Of course he is going to sound familiar, Marinette mentally scolded herself. He’s been your partner for almost 2 years after all!</p>\n<p>Besides she had bigger problems that nagging feelings of de ja vu. Specifically how to convince Chat that she was not, in fact, an insane stalker and unrepentant phone thief. Although he didn’t have any way of knowing about her various phone related activities. At least he hadn’t found the schedule, so there was still a small chance she could play this off instead of just hurling herself out the window in humiliated misery.</p>\n<p>“That is Adrien Agreste.” She stated with as much haughty indifference as she could muster.</p>\n<p>“I am well aware of that fact.” Chat retorted, raising one eyebrow.</p>\n<p>“His father, Gabriel Agreste is one of my favorite designers. I happen to like his work and use it for inspiration.” She smirked. There. That sounded believable right? After all Chat knew that she wanted to be a fashion designer. It had come up more than once in their conversations during his impromptu visits to her balcony.   </p>\n<p>“I see.” Chat deadpanned. “If that is the case then why don’t you have any shots of the women’s collection? This season’s formal wear selection was considered particularly inspired. Given the types of outfits you have said you prefer to work on wouldn’t that be a better choice? The 2014 Spring line wouldn’t be a bad way to go either.”</p>\n<p>Since when did Chat know anything about fashion? Marinette thought savagely. She wasn’t sure if she was more irritated by the fact that he was calling her on her bluff or that he was right about those being two of her favorite Gabriel lines.</p>\n<p>Well if Chat wanted to call her out and make her confess to her crush for his amusement he could dream on. She wasn’t going to give him the satisfaction.</p>\n<p>“Maybe I don’t want to be influenced by the oppressive standards of female beauty imposed on us by the fashion industry and its malnourished models.” Thank you Alya.</p>\n<p>Chat didn’t even bother to respond to that one, instead his eyebrow raised impossibly higher. How did he even manage to HAVE that much expression in his eyebrows! They were covered by his mask for god sake! </p>\n<p>“I just like looking at the clothes and… stuff.” Ok <em>she </em>didn’t even think it sounded believable anymore. Maybe she needed to reevaluate her plan of jumping out the window.</p>\n<p> Marinette could feel her face flaming into a deep crimson as she desperately tried to think of anything else she could say to save her rapidly waning credibility. She had already hit rock bottom after all.</p>\n<p>“If you were modelling high end fashion I would probably have posters of you all over my wall too!” Marinette muttered defensively.</p>\n<p>. It took about 2 seconds for her brain to process exactly what she had just done.</p>\n<p>Never mind, she had found a lower place.</p>\n<p>Chats eyes widened to slits and then an exuberant smirk stretched across his features.</p>\n<p>“Careful, you are going to get my hopes up Spots.” He teased.</p>\n<p>Marinette could feel every ounce of color draining from her face at the odd nickname.</p>\n<p>He knew. She didn’t know how he knew but somehow he must have figured out her identity. It would explain why he had begun consistently pestering her over the course of the last 2 months.</p>\n<p>“When did you find out?”</p>\n<p>“Find out what?”</p>\n<p>“Was it after the last akuma attack? I thought I heard someone following me before I transformed.”</p>\n<p>He had the audacity to laugh. “Actually no, but thanks for the conformation bugaboo.”</p>\n<p>“Don’t tell me that you didn’t know!”</p>\n<p>“Actually I only suspected. But to be fair I have been about 75% sure since we faced off against the Virtuoso and after that it wasn’t hard to find more evidence in my favor. Lately I’ve been hovering in the 90-95% sure range.”</p>\n<p>“So what’s with the nickname? If you didn’t KNOW then why would you call me Spots?”</p>\n<p>“You were blushing. You literally had bright red spots on your face.”</p>\n<p>“Oh. So wait… you really didn’t know?”</p>\n<p>“Nope. But don’t fret My Lady, it was sure to come out eventually, and as I said it wasn’t like this came as a surprise.”</p>\n<p>Marinette sank into her chair. It was unfathomable. How could he have known? She still had no idea who Chat was underneath the leather and puns and smirking. But somehow her partner had managed to find her. Of all of the hundreds of girls in Paris, he had found<em> her</em>, clumsy, insecure, phone stealing Marinette, and figured out her secret.</p>\n<p>“What gave it away?” She finally asked.</p>\n<p>Chat looked thoughtful for a bit, staring around her room idly. “It’s hard to say where it started. A lot of little things I guess. The way you phrase things, oh! and there is this weird arm thing you do when you get really flustered.” He waved his arms around his head in demonstration.</p>\n<p>Marinette just gaped at him.</p>\n<p>“Anyways, after the fight with Virtuoso when you yelled at Alya for being too close again, it sort of all just clicked together, so I started looking for proof that my hunch was right.”</p>\n<p>“What sort of proof?” Marinette asked dazed. She couldn’t believe that she was so transparent to this boy. Chat had never struck her as the overly observant type, but clearly he had been paying a lot more attention than she gave him credit for.</p>\n<p>“Just more of the same really.” Chat shrugged. “Looking to see if you disappear during akuma attacks, trivial stuff like favorite color or favorite foods. Honestly I was surprised I didn’t suspect you sooner, you act surprisingly similar in and out of costume.” He turned back to look at her with a soft smile. “Well… most of the time.”</p>\n<p>“Oh.” Marinette really didn’t know what to say. She was still stunned by this new twist of events.</p>\n<p>She was also extremely flattered. Despite Tikki’s constant reminders that she was the same person without her superhero guise, Marinette had always felt like an imposter. No one would even think that she was worthy to be the great Ladybug if they ever discovered the truth.</p>\n<p>Yet here was Chat, who idolized her, perfectly content with her civilian identity. It was the greatest compliment she had ever received, and her heart swelled with affection for her loyal partner.</p>\n<p>“So is this some sort of celebrity crush or should I be jealous?” Chat asked, creeping forward to squint at one of the doodles on a particularly large magazine cutouts.</p>\n<p>“It’s not a celebrity crush. We go to school together and are friends, well sort of, so I am not just some pathetic fangirl.” Marinette defended, giving up on the idea that she could convince him there was a less embarrassing reason why she had wallpapered her room with Adrien.</p>\n<p>“Even if you were just a fangirl I don’t think you know how to be pathetic My Lady.” Chat said kindly. “And what do you mean, “sort of” friends?”  He tilted his head questioningly and even made little air quotes with his claws. Marinette refused to call it endearing.</p>\n<p>“Well we are friends. He sits in front of me. We hang out sometimes and our best friends are dating so we are thrown together a lot, but in spite of that we aren’t really close I guess.” She couldn’t meet Chat’s eyes as she continued. “I sometimes have trouble acting normally around him. I sort of… stutter, and babble. Sometimes it’s worse. He never says anything and is really nice about it, but I wouldn’t be surprised if he thinks I am insane.”</p>\n<p>“I guarantee he thinks you’re adorable.” Chat said, and Again Marinette marveled at her partner’s unshakably high opinion of her.</p>\n<p>“So when should I expect the wedding invitation?” Chat taunted, his Cheshire grin back in place. “Once you have been snagged up I doubt this ‘sort of’ friend will be letting you go.”</p>\n<p>“We aren’t even dating.” Marinette rolled her eyes.</p>\n<p>“Well then what are you waiting for? Get to it love bug, chop chop.” He waved his hand at her as though shooing her off to go running after Adrien.</p>\n<p>“Shouldn’t you be telling me all the reasons why this is a terrible idea and how purrrfectly happy I would be with you instead?”</p>\n<p>Chat’s eyes lit up at her sarcastic pun. “No, I trust My Lady’s judgement.” He said brightly, grinning like a kid at Christmas.</p>\n<p>“Sure. You are going to be content to see me chasing after someone else.” Marinette stated unconvinced.</p>\n<p>“I think I am surprisingly ok with this particular turn of events.” Chat responded mildly, making a show of examining his claws the way Chloe would a new French manicure.</p>\n<p>“Isn’t my already loving someone other than you going to ruin your happy fantasies of whisking me off into the sunset?” She continued. After all Chat had been doggedly pursuing her for the entirety of their partnership. Not once had he ever wavered in his endless flirtations. With every passing month he would continue to avow his eternal and undying devotion to her.</p>\n<p>While she had never entirely believed him to be serious about any of it, this calm acceptance of her innocent crush… ok who was she kidding… her overpowering obsession, was not at all what she would have expected from her Casanova Kitty. It was… unsettling.</p>\n<p>“Oh contraire buginette, I have told you before I care only for your happiness and if browbeaten painfully oblivious models are your thing than I will do everything in my considerable power to aid and support you.” Chat purred out with a lethal twinkle in his eyes.</p>\n<p>Once again Marinette felt a looming sense of dread, like there was some sort of grand joke that she had been excluded from. A far cry from pouting or being put out by her admittedly self-imposed unavailability, Chat seemed almost gleeful about her crush.</p>\n<p>“So when do you plan on asking out this friend of yours?” Chat inquired.</p>\n<p> “I can’t just ask him out!” Marinette spluttered.</p>\n<p>“Do you want him to come to you instead?” He ask, with genuine curiosity.</p>\n<p>“It’s not that! I mean, that would be great if he did but I don’t expect… the point is I can’t just ask him out!”</p>\n<p>“Why not?” Chat pressed, his features scrunched into an adorable look of confusion.</p>\n<p>“Because he’ll say no.” Marinette said softly fixing her eyes on the floor and finally giving voice to her deepest fear. At least now, as ridiculous and awkward as she often was around him, she could still pretend that one day she would evolve into the kind of girl who could be confidant and sexy and deserving of his affections.  Maybe there would come the day where she could confess her feelings and they could be together. But right now? Right now she was just boring, insecure Marinette who had no real shot with a boy like that, no matter how much she wanted to.</p>\n<p>She looked up at Chat, expecting to see pity, or maybe even understanding. For all of Chat’s faults he was incredibly kind and loyal and he had always been very sympathetic and supportive of her own failings throughout their partnership. Perhaps that was why she decided to confide in him, he had always been a compassionate friend and never failed to make her feel supported in spite of her flaws.</p>\n<p>What she didn’t expect was the look of absolute disbelief plastered across his features. The astonished cat just stared at her, jaw hanging open for several seconds before he burst out into loud, genuine laughter.</p>\n<p>“It’s not funny!” Marinette shouted an odd combination of anger and hurt swelling up in her chest.</p>\n<p>“I’m sorry but yes it is” Chat managed to choke out between giggles. “You actually think anyone would say no to you My Lady?”</p>\n<p>Marinette’s head began to spin at the look of unabashed adoration shining out of her partner’s eyes even as he continued to laugh at her predicament, and she struggled not to melt in gratitude at his unwavering belief in her value, even knowing her real identity behind the mask. She knew that she would most likely lose a good deal of sleep in the near future re-evaluating the merits of keeping her superhero life strictly professional. She swallowed and forced herself to focus back on the original conversation about the other blonde haired green eyes boy who ruined her sleep.</p>\n<p>“I haven’t told him that I am Ladybug.” Marinette countered her voice still barely above a whisper.</p>\n<p>“I never for a moment thought you had.” Chat grinned. “After all it would be a-paw-ling if you starting telling your secrets to a random civilian before your own partner.” He teased. “Of course I also don’t know what that has to do with anything bugaboo.”</p>\n<p>“That was terrible. You’re puns are still always terrible.” She deflected, although she could feel the corners of her mouth lifting slightly.</p>\n<p>“They still make you smile.” He shot back, although his tone was gentle and his laughter had finally slowed. “So why do you think he would say no?” Chat asked.</p>\n<p>“I mean… look at me.”</p>\n<p>Chat raised an eyebrow suggestively his lips curving into an unholy smirk.</p>\n<p>“Not like that you jerk!” Marinette scowled grabbing the first thing her hand came in contact with on her desk and grinning when the flung object smacked him in the face.</p>\n<p>“Nice choice of weapon Princess.” Chat teased rubbing his nose and holding out…</p>\n<p>Oh dear god, she had literally thrown Adrien in his face, or at least her framed picture of him.</p>\n<p>“You’re loving this aren’t you?” She groaned.</p>\n<p>“Yeah I really kind of am.”</p>\n<p>Marinette sighed and dropped down into her desk chair, exhausted by what might be the most the worst non akuma related day in the history of her life.</p>\n<p>Chat squatted down in front of her, resting his elbows on her knees, his Cheshire grin back in place.</p>\n<p>“So where do you want go for your first date?” Chat ask, “I know Adrien you know, I could drop a few hints.” He wiggled his eyebrows at her again and in spite of her irritation she felt a little better hearing him act like her success was a foregone conclusion.</p>\n<p>“I already told you he would probably turn me down.” Marinette said.</p>\n<p>Chat frowned at her, eyes narrowing slightly and tail twitching in irritation at her continued protestations.</p>\n<p>“I am 100% confidant that if you walked up to him and told him that you wanted to be in a relationship that he would say yes. Well either that or just grab you up and kiss you, it could go either way really.”</p>\n<p>Marinette flushed deeply at the mental image of Adrien grabbing her and pulling her into a passionate kiss. What if they were still at school and everyone could see? She could imagine Alya and Nino shrieking in delight, mingled with Chloe’s and Lila’s banshee like screams of rage, but she could just tune it all out because Adrien was kissing her. Hesitantly nibbling at her lips to try and deepen the kiss as he cradled the back of her neck with…</p>\n<p>Yeah as if that would ever happen. She tried to banish the sudden jolt of warmth in her gut her fantasy had produced.</p>\n<p>“If you really think that Adrien would ever try something like that you clearly don’t know him very well.” Marinette huffed, crossing her arms in front of her.</p>\n<p>Chat Laughed again, hopping up from the floor and pacing around the room excitedly, clearly scheming.</p>\n<p>“Ok Chat you have had your fun, time to scamper back to wherever you came from.” Marinette stated, ready finally take her long overdue nap. “And no more coming into my room.”</p>\n<p>Chat stopped his pacing and stood completely still for a few seconds before turning towards her with a challenging glint in his eye.</p>\n<p>“Tell you what Princess, I will make you a deal. If you ask him out and he rejects you, like you seem to think he will, I will never drop by for any unscheduled visits that don’t involve purple butterflies again. However, if I am right and he says yes, then not only do I reserve the right to continue basking in your presence whenever I so choose, but you will also provide me with free croissants every Monday, Wednesday and Friday for the next two months.”</p>\n<p>“You don’t want to make this bet kitty.”</p>\n<p>“Oh, I am pretty sure I do.”</p>\n<p>“Your loss. Make sure you take your lawn chair with you.” She said airily. Happy to finally be getting the upper hand in the conversation.</p>\n<p>“You have three days to ask out you’re pretty model boy or the bet will be considered forfeit and you will have to face the consequences.” Chat stated solemnly.</p>\n<p>“Three days? What is this The Little Mermaid?” Marinette tried to sound flippant but her stomach felt like lead. Three days? She had been trying desperately to get the courage to confess to Adrien for the last two years and now she only had three days?</p>\n<p>“Three days is plenty of time to manage a single question to a boy you see every day.”</p>\n<p>“And what do you mean by consequences?” Marinette ask, hoping that if she kept him talking that he wouldn’t notice the color draining from her face or the shaking of her hands at the idea of confessing before the end of the week.</p>\n<p>“If you forfeit the bet, in addition to my unrevoked visitations, you will be providing croissants every weekday for the next three months.”</p>\n<p>Ok that didn’t sound too bad, Marinette considered.</p>\n<p>“AND” Chat continued “I get to kiss you. One time, at a time and place of my choosing. No questions, no complaining.”</p>\n<p>Marinette knew that her face must have gone as red as her suit. There were so many ways something like that could blow up in her face.</p>\n<p>What if Chat showed up at school and kissed her? What would everyone say? Alya would probably film the whole thing and post it all over the Ladyblog. What if her parents found out? Not to mention Chat’s crazy fangirls. She would probably be hunted down and murdered. Or worse, what if he waited and kissed her in front of Adrien? Adrien might think she was involved with Chat! Then she would never find a way to win him over! Adrien adored Ladybug and Chat Noir he would never try to compete! Besides that, Adrien totally bought into the crazy theory that Ladybug and Chat we destined to be together. What if it ruined their friendship? What if he blamed her for coming between his favorite celebrity couple? </p>\n<p>Oh god what if he tried to kiss her while she was Ladybug? What if he kissed her in front of the press after an akuma attack? It would confirm to every celebrity gossip site that they were more than just partners…</p>\n<p>She turned and glared at Chat who met her gaze with a cheerful smile and a raised eyebrow.</p>\n<p> “If this is too much for you Princess I could be persuaded to forget the whole thing for one kiss here and now, and a small box of Macaroons.”</p>\n<p>Marinette seethed at the knowing, gleeful expression on his face.</p>\n<p>This was exactly what he wanted. He had been chasing after his kiss from Ladybug from their first akuma and now he thought he had finally backed her into a corner. Well she was never one to back down from a challenge and she would not let her Tomcat of a partner win that easily.</p>\n<p>“Ok fine. I accept. I’ll do it.” She spat, “I’ll ask out Adrien and then I won’t have to deal with your uninvited interruptions anymore.” She glared at Chat as if she could banish him and his infuriating smirk with sheer force of will. No one stood up to the full force of her stare. Even Alya had been known to cower whenever Marinette truly lost her temper and dropped into a quite rage.</p>\n<p>Chat only grinned wider. “I look forward to my free croissants.”</p>\n<p>Marinette was not surprised to find Chat lying on her chaise lounge waiting for her in her room the next day when she came home from Alya’s.</p>\n<p>“Don’t get too comfortable kitty.” Marinette sang out happily, “I will have you know I had an entire conversation with Adrien today, AND we even went and had lunch together, at my suggestion.” He didn’t need to know that Alya and Nino had gone as well.</p>\n<p>“Ah but did you actually ask him out?” Chat replied smugly, not even bothering to open his eyes much less sit up.</p>\n<p>“No.” Marinette grumbled.</p>\n<p>“I didn’t think so.” Chat smirked. “Still, it sounds like you made some great progress. I am very proud of you My Lady.”</p>\n<p>There was a good chance he was teasing her, but Marinette found that she didn’t care. She was proud of herself too. It had been a fantastic day, made even better by Chloe’s absence due to “illness.” If Marinette had to guess she would say that Chloe had caught a bad case of ‘I don’t want to take my history exam’-itus.</p>\n<p>“Thank you.” Marinette replied graciously. “You know, maybe you will end up winning this bet of yours after all.” She smiled as she dropped down onto the chaise next to her partner, who finally opened one eye and looked at her, a soft smile of his own tugging at the corner of his lips.</p>\n<p>“I never doubted it for a second.” He said lightly closing his eyes again and snuggling back against the pillow. “Now I can go back to dreaming about my free croissants.” He joked.</p>\n<p>Marinette hummed in response, enjoying the companionable silence. <br> “Did you really have fun today?” Chat asked quietly. His eyes were still closed and he hadn’t moved, but Marinette could feel a slight tension emanating from her partner, and she knew he was anxious as to her reply. She considered what to say. Despite his protestations it couldn’t be fun for him to listen to her cooing over someone else. What if this whole experience broke him? She wasn’t sure what she would do if their friendship fell apart. Still… he had been nothing but supportive of her, and she owed him her honesty.</p>\n<p>“Yeah I really did.” She felt him relax and she let out a breath she didn’t realize she had been holding.</p>\n<p>“Good. You’re happiness is everything to me.” He said softly. Marinette smiled down at her partner. No matter how this whole bet went down, she had a feeling that things wouldn’t be so bad as long as he was on her side.</p>\n<p>“Hey Chat?”<br> “Yes My Lady?”</p>\n<p>“Want to play Ultimate Mecha Strike III?”</p>\n<p>“Of course!” He shot up from the chair excitedly and Marinette laughed.</p>\n<p>“Today is the day I will achieve victory over you Princess! You should know I have been practicing.”</p>\n<p>“That’s funny so have I.”</p>\n<p>“damn.”</p>\n<p> </p>\n<p>…</p>\n<p> </p>\n<p>“Chat? Chat are you here?” Marinette called poking her head up onto the Balcony, eyes scanning wildly for her feline companion.</p>\n<p>“At your service as always My Lady.” Chat replied from the comfort of his black and green lawn chair.</p>\n<p>“AAAAHHH!!!! Chat you are never going to believe what happened today!!!” Marinette cried dancing around in happiness.</p>\n<p>“Oh I’m sure I’ll believe it. I am pretty gullible after all.” He smiled at her.</p>\n<p>“So this morning I was running late, which really isn’t anything new to be honest, and when I got into class the teacher was scolding me about my horrible time management skills.”</p>\n<p>“Doesn’t sound like that great of a story so far.”</p>\n<p>“Oh hush! I am getting to it. Anyways, so I was fairly humiliated over the whole thing, but a few minutes after I sat down Adrien dropped a note on my desk asking if I was ok! He wanted to make sure that I was ok!”</p>\n<p>“I am glad to know your crush isn’t a cretin.” Chat replied lightly.</p>\n<p>“Of course he isn’t he is perfect, and that isn’t even the best part.” Marinette gushed.</p>\n<p>“The saga continues? I never would have guessed.” Chat replied with the most obnoxious tone of fake surprise Marinette had ever heard. She chose to ignore her partner’s sarcasm and instead pressed on.</p>\n<p>“So I wrote back that I was fine, I just was embarrassed that I can’t ever get anywhere on time, and then he WROTE ME BACK! We ended up passing notes for the entire morning! I don’t think I took a single note for class and I am going to have to beg Alya to let me copy her notes and I am sure she is going to tease me even worse than you are but I don’t care!”</p>\n<p>“You really are incredibly low maintenance aren’t you?”</p>\n<p>“And then he asked me to join him for lunch again.” Marinette trailed off with a dreamy sigh, ignoring the way Chat was shaking his head in exasperated amusement. “I think he might actually like me Chat.”</p>\n<p>“That’s literally what I have been telling you this whole time.” Chat drawled leaning back into his chair with a pout. “And at no point in this story have I heard mention of you following through on our bet.”</p>\n<p>Marinette had the decency to blush guiltily at his playful ire.</p>\n<p>“Well after that he had to leave for a photoshoot but still! And Chloe was out sick so I didn’t even have to worry about anyone spoiling it!”</p>\n<p>“Well I am glad your day went well.” Chat mumbled quietly.</p>\n<p>“How about you? Was it a good day for the famous Chat Noir?”</p>\n<p>“Parts of it.”</p>\n<p>“Oh? Is flirting and cat napping becoming too much for you Minou?”</p>\n<p>“I will have you know I lead an incredibly busy and stressful life. You would weep for me Princess.”</p>\n<p>“Ha! Says the cat lazing about my balcony.”</p>\n<p>“I find ways to relax every now and again.”</p>\n<p>“Well your days of lounging around my roof are coming to an end Chaton.” She poked at his booted foot with her toe.</p>\n<p>“You could at least pretend like you will miss me Princess.” Chat said with his usual trademark grin.</p>\n<p>Marinette was about to throw back a witty retort when she noticed that his cat ears were pressed flat against his head.</p>\n<p>Chat might have an excellent poker face under normal circumstances, but his feline appendages always betrayed him when he was truly upset. His day must have been terrible.</p>\n<p>“Maybe if you’re well behaved I’ll still invited you to visit every now and then.” She said, leaning down over him so that their noses were almost touching.</p>\n<p>Chat reached up and yanked her down so that she was lying on top of him, his arms loosely wrapped around her and she immediately snuggled into the comfortable embrace.</p>\n<p>It wasn’t the first time they had ended up like this. With their close partnership physical contact had quickly become something they adjusted too. Even in their less action heavy encounters they would often touch and pet at each other in a way that would belie their very platonic relationship to a casual observer.</p>\n<p>Marinette had never really put much stock into the intimacy, it was just how they were. It had never crossed the boundaries of friendship even with Chat’s constant flirting.</p>\n<p>But now she seemed to finally be on the verge of a real relationship with Adrien. Perhaps it wasn’t such a good idea to be sprawled across her partner’s chest. The last thing she wanted to do was give the impression that she was stringing on multiple boys.</p>\n<p>Chat must have felt her apprehension because he chuckled softly to himself, hugging her a little tighter.</p>\n<p>“Relax Bugaboo. You aren’t cheating on your scaredy-cat boyfriend by indulging me in some cuddling.”</p>\n<p>“He isn’t my boyfriend.” She huffed, but she found herself relaxing into his arms. “And he isn’t a scaredy-cat! Where did that even come from?”</p>\n<p>“Oh he is a total push-over. No self-confidence whatsoever.” Chat teased, although his amused tone was softer than normal. “Why I bet that he has been pining after you for ages and never had the guts to do anything about it. Probably tried to come up with some insane convoluted scheme to get you to notice him all the while being too oblivious to see what was right in front of his face.”</p>\n<p>“And how would you know?” Marinette asked gently. Somehow, she knew that this wasn’t just Chat making fun of a guy she liked. There was an underlying sadness to the usually cheerful voice that pulled on her heartstrings and made her question what life was like for her kitty on the other side of the mask.</p>\n<p>“It’s obvious. Terrible home life, lack of social skills, constant pressure to live up to a celebrity status? How could he be anything else?”</p>\n<p>Chat had often been well versed in a lot of details about Adrien’s life, rescuing him from numerous akuma attacks before she arrived and filling her in on his whereabouts and well-being on several occasions. It wasn’t a hard conclusion to assume that they moved in similar social circles and were probably acquaintances or even friends. </p>\n<p>Yet the hurt and insecurity in his voice was unmistakable. This wasn’t a theoretical guess about a friend. Chat knew what it was like to feel that way too.</p>\n<p>Marinette had suspected for a while that Chat had an unhappy family life. Aside from several off handed comments during their various adventures, he had always seemed so awed by her own loving relationship with her parents.</p>\n<p>It broke her heart to think that of all the things that Chat and Adrien might share in common, it was a sense of loneliness.</p>\n<p>“You know I love you right Chat?” She whispered, lifting her hand to run her fingers softly through her best friend’s hair.</p>\n<p>He held her tighter.</p>\n<p>“I love you too My Lady. Always.”</p>\n<p>…</p>\n<p>It was day three.</p>\n<p>Today was the day she was finally going to tell Adrien how she felt.</p>\n<p>Unfortunately, opportunities thus far had been few and far between. Her efforts to get Adrien alone (or at least somewhere slightly more private) had been consistently thwarted by Chloe. Her blond nemesis had obviously been informed of Adrien’s attention to her because the spoiled pest had clung to his side like a barnacle every second that wasn’t spent doing actual lessons.</p>\n<p>Even Adrien’s patience seemed to be wearing thin with his childhood friend, as his trademark smile had gradually fadled into what could more accurately be described as a frustrated grimace.</p>\n<p>Marinette had likewise found herself with an evil shadow, as Sabrina did her best to push and trip Marinette at every opportunity.</p>\n<p>Having learned from past experience, Marinette had made sure to enlist Alya’s company anytime she needed to go anywhere on her own.</p>\n<p>Lunch had been a complete disaster, with Chloe obstinately inviting herself along when Adrien suggested going to a nearby café. Alya had violently protested the idea, but the ensuing argument had only lead to their other classmates coming over to ask about the commotion. Ultimately more than half the class ended up traipsing over to the nearby restaurant with Alya and Chloe bickering loudly all the while. Marinette was fairly confidant she hadn’t managed to get a word in edgewise for the entire hour much less to Adrien, who had gotten trapped as the mediator in an argument between Nino and Kim over who the most dangerous Akuma to date had been. Personally she would have gone with Volpina. She still had nightmares about seeing Adrien dangling off the edge of the Eifel Tower, even if it had been an illusion.</p>\n<p>So that was how Marinette found herself at the end of the day an hour after classes had ended desperately hoping to catch Adrien after his fencing lesson. Alya and Nino, whom she had begged to allow her to postpone their scheduled trip to the arcade on the pretext of inviting Adrien, had wondered over to her parent’s bakery in search of sweets while they waited. If she was lucky they would stay away long enough for her to confess to Adrien without an audience. Given Alya’s unrepentant matchmaking, Marinette figured she should have at least 5 minutes of time alone with him once his lesson let out before either of her other friends put in an appearance.</p>\n<p>She gazed around the empty halls while she waited. They seemed so much larger without the hordes of students trekking to and from classes, only an abandoned janitors cart marring the sterile white expanse.</p>\n<p>She heard the repetitive tap tapping of footsteps from behind her and assumed that the custodian must had arrived to reclaim their supplies, when a cold, familiar laugh broke the silence into shards of dread.</p>\n<p>“Well, well, well. If it isn’t little Marinette.” Chloe drawled, coming around to circle her like a vulture inspecting a carcass of meat.  “Don’t tell me you have finally progressed to full out stalking.”</p>\n<p>“And what exactly are YOU doing here Chloe?” Marinette spat back.</p>\n<p>“I was finishing my physics project with Sabrina in the library and wanted to drop by and see if Adri-chou wanted to come by the hotel for dinner. After all, I am his closest friend.”</p>\n<p>Marinette wondered which was the bigger falsehood in that statement- that Chloe had actually contributed to a project or that she was Adrien’s closest friend? She almost wished that Nino was already back as she wouldn’t have put it past him to slap Chloe in the face. The mental image made her smile.</p>\n<p>“Actually I am meeting Adrien so we can all go to the arcade.” Marinette boasted, hoping to rub it in Chloe’s face that Adrien had many, and better, options for socialization now than he did 2 years ago before he started public school.</p>\n<p>“Liar.” Chloe stated with a satisfied smile. “Adrien has a rescheduled piano lesson today after fencing so there is no way he is going to have time to go out with you and your pathetic little crew tonight, which means at best you are hanging around here in the hope of asking him to join your little play date.”</p>\n<p>Marinette felt her face flush.</p>\n<p>“But if all you cared about was asking him to slum it with the loser trio you could have done so via text. So the question becomes, Marinette Dupain-Cheng, what could be so important that you are idling around an empty hallway waiting desperately for my Adrien to come by?”</p>\n<p>An Icy coldness settled in Marinette’s veins and for the first time in years she found herself completely cowed by the daggers in Chloe’s eyes and the Acid in her lilting tone.</p>\n<p>“Could it be that you were planning on finally confessing your pointless crush?” She said with false sweetness, a triumphant gleam in her eyes. “Why that must be it. Brava little Marinette, too bad it will all amount to nothing. But of course even you aren’t so stupid that you don’t know that, at least on some level.”</p>\n<p>Marinette’s throat went dry and she stood frozen, watching as Chloe perused the contents of the janitors cart beside them as if it was a department store cabinet.</p>\n<p>“I know that it can be tempting to think, ‘maybe I am special. Maybe Adrien will see me for the special little snowflake I am.’ After all he is just so nice isn’t he? He smiles at you, and he laughs at your stupid jokes and he listens to your stupid stories.” Chloe’s voice was smooth and calm, but the words burned and scratched at her soul. “But that’s the problem Marinette Dupain-Cheng. He is nice to everyone. He would be just as attentive to a homeless stranger he met on the street. And the saddest thing is, you already know that everything I am saying is true.</p>\n<p>Yet somehow in the last few weeks you seem to have lost sight of the reality of your situation, so let me make this perfectly clear. You will never deserve him, you will never be good enough for him. And no matter how nice or sweet or considerate he might be to you out of some form of well-meaning if misplaced pity, he will NEVER love you the way you love him.”</p>\n<p>And with a final flourish Chloe snatched up the uncapped bottle of cleaner she had been toying with and dumped it over Marinette.</p>\n<p>With a final chuckle, the blond turned on her heels and sauntered away in triumph.</p>\n<p>“Marinette?”</p>\n<p>She turned slowly at the sound of a familiar voice, cleaning fluid dripping from her hair and down her face as Adrien hurried to her side.</p>\n<p>“What on earth happened?” He asked, as he took in her stained, sodden appearance with horror.</p>\n<p>“Chloe.” Marinette managed to squeak out, her cheeks burning with humiliation. Adrien’s entire posture sagged and he sighed in understanding.</p>\n<p>“I am so sorry Marinette, I don’t know why she does things like that.” Adrien said. He pulled off his white over shirt and handed it out to her. “Here, I know it won’t fit, but at least it’s clean. You can go change, I’ll just wait out here.”</p>\n<p>Marinette hurried into the nearby restroom and almost collapsed onto the sink.</p>\n<p>“Oh Marinette are you alright?” Tikki cried, flying out of her bag and taking in the damage Chloe had caused.</p>\n<p>“Yeah I’m fine, it’s just stains.” Marinette replied, stripping off her ruined shirt and grabbing a handful of paper towels so that she could attempt to dry off her skin and hair.</p>\n<p>“She really is an awful piece of work isn’t she?” Tikki tutted, aiding as best she could with her tiny paws. “Don’t let it get you down Marinette, you know that nothing she said is true. Adrien adores you I know it.”</p>\n<p>“Thanks Tikki.” Marinette said fondly. However, her kwami’s words could only do so much to ease to hallow chill of self-doubt that had lodged into the pit of her stomach.</p>\n<p>She quickly finished cleaning herself up as best as she could and changed into Adrien’s too large shirt. She allowed herself a moment to indulge, pressing the fabric to her to her nose to breath in his scent. It was warm and comforting, much like the boy it belonged to, and she clung to the brief moment of contentment.</p>\n<p>With a final hug and a heartfelt “I believe in you,” from Tikki before she whipped back into her usual hiding place, Marinette squared her shoulders and headed back into the hallway.</p>\n<p>Adrien was waiting for her, pacing back and forth agitatedly like an irate jungle cat. He immediately halted when she let out a small cough, turning to inspect her for any lingering damage. He reached out a hand to touch her, but pulled back embarrassed.</p>\n<p>His obvious concern for her well being made her insides turn to mush, and her brain to wonder again how anyone could be so unendingly endearing.  </p>\n<p>“Thanks for the shirt.” She said quietly, fingering the edges nervously and refusing to meet his eyes. “I’ll wash it tonight and get it back to you tomorrow I promise.”</p>\n<p>“Don’t worry about it.” Adrien said gently. “Keep it if you want, it looks better on you anyways.” He ducked his head down so that she was forced to look at him before straitening, a shy happy smile tugging at the corners of his lips.</p>\n<p>Marinette’s heart thudded in her chest.</p>\n<p>This was it, this was her moment to ask him. To win her bet with Chat.</p>\n<p>Screw her bet with Chat, she didn’t care if she had to give him croissants for the rest of her life. This was something so much bigger than that. This was her chance to ask out the boy of her dreams, a boy that she had been desperately in love with for 2 years. A boy who was kind and thoughtful and who made her feel like everything she did or said was somehow important. It was her chance to finally get everything she ever wanted.</p>\n<p>Marinette stared up at him but no words were forming. Her throat felt tight and her knees were weak. Why couldn’t she do this? It was just a simple sentence, <em>will you go out with me</em>? She opened her mouth but no sound came out, not even an incomprehensible squeal.</p>\n<p>She could hear Chloe’s words rattling around in her head, magnifying her own fears as she gazed up at Adrien. He was so close she could feel the warmth of his skin and hear the even rise and fall of his breath.  His brilliant green eyes flickered with emotions as he waited for her to speak.</p>\n<p>She swallowed hard and opened her mouth again but it was no use. Her entire body shook as she realized that she couldn’t do it. She couldn’t block out the fear and the doubt. She couldn’t ask him.</p>\n<p>She could feel the tears welling up in her eyes, as Adrien still stood in front of her waiting patiently for her to do or say anything. The look on his face was a soft, fond expression, and Marinette had the feeling that he would have stood there waiting for the entire day so as not to make her feel abandoned or unappreciated. But she could also see the hints of worry and confusion dancing in his eyes, and perhaps even a touch of disappointment.</p>\n<p>She was such a failure. He deserved so much better than this. Than a girl who could barely function in his presence, than a girl who was so scared of not being with him that she couldn’t even fight for what she wanted.</p>\n<p>It was like her first akuma battle all over again, only this time Chat wasn’t here to reassure her that everything was going to be ok.</p>\n<p>Maybe Chloe was right after all.</p>\n<p>“I… I…” She finally stammered out. Her eyes were now swimming with unshed tears and even through the blur she could see Adrien’s expression had morphed into a look of genuine concern. “I can’t…” She squeaked out trying to will her mouth to work, her eyes to close and block out the sudden look of understanding on his face, or maybe for her legs to carry her out of the school and as far away as possible. Maybe her ladybug luck would kick in and Chat could come bursting in through the window and carry her away from her humiliation, it seemed like the sort of melodramatic thing he would do.</p>\n<p>“I have to go.” She finally managed to say, but she was still frozen in place unable to move or to look away from Adrien’s concerned, remorseful expression as the first tear finally spilled down the side of her cheek.</p>\n<p>Adrien reached forward and pulled her into a crushing hug, arms wrapped around her back, her chest pressed against his.</p>\n<p>“I am so sorry.” He said gently. “This is all my fault, I didn’t think. Please forgive me.”</p>\n<p>He must have figured out that Chloe was tormenting her because of him. And now here he was apologized for what? For being desirable? For being the object of their affections? For not preemptively riding the world of Chloe and her sycophant minion?</p>\n<p>She couldn’t stop the muffled cries that clawed their way out of her throat as the tears began to fall in earnest. She would never deserve him, she would never be good enough, and he would never love her the way she loved him.</p>\n<p>“Oh Mari.” Adrien sighed, “Its ok. I promise everything is going to be ok.” He squeezed her more tightly, laying his cheek against her head as he rubbed soft circles against her back.</p>\n<p>Marinette allowed herself to be held by him, too selfish and too in love not to indulge in the embrace while she had the chance, as she sobbed into his designer tee shirt.</p>\n<p>…</p>\n<p> </p>\n<p>Marinette didn’t know if she was relieved or disappointed that Chat was nowhere to be found when she stumbled up to her room a half hour later.</p>\n<p>No more than a few minutes after Adrien had pulled her into his arms Alya and Nino had found them and had begun immediately fussing over her. However, before they could even find out what had happened, Chloe and Sabrina had materialized as well, most likely looking for Adrien. Chloe had smiled at Marinette’s distress, letting out a patronizing giggle and clearly preparing to launch into round 2 of her verbal assault.</p>\n<p>In what might have been the most aggressive act any of them had ever seen from the mild mannered Adrien, he had grabbed both Chloe and her henchwoman by the arm and dragged them off down the hallway and out to Chloe’s waiting limo before she had gotten a complete sentence out. His cold scathing condemnation of her recent behavior echoed in the mostly empty hallway, but the words barely registered to Marinette through her continued weeping.  Alya and Nino had looked after the departing trio in shock, Nino letting out a soft whistle of approval.</p>\n<p>Both of her friends had tried to pry out an explanation for what had happened, but Marinette really didn’t want to try explaining anything about her failed attempts, Adrien’s unattainability, or her bet with Chat, so she merely shook her head and tried to control her tears. Adrien had never returned from depositing Chloe, most likely his driver had herded him into his own car and carted him off to the safety of the Agreste mansion.</p>\n<p>Eventually they had all made their way to Marinette’s where she had endured another round of fussing by her mother, who had not been oblivious to her red rimmed eyes or her change in shirt. At this point she had calmed down enough to throw together a brief explanation for her distress, largely focused on her confrontation with Chloe while glossing over the details of exactly why the blonde’s behavior had been so particularly ill timed.</p>\n<p>After Marinette had begged for some space to recover and sleep it off, her well-meaning friends and parents had hurried her up the stairs and headed back to their own activities with numerous promises to check on her later.</p>\n<p>Having found her room empty of any visitors, Marinette abandoned all pretenses of recovery and crawled up to her bed determined to cry herself out.</p>\n<p>Two hours, one shower, and 3 attempted pep talks from Tikki later, Marinette had finally managed to ebb the flow of tears. Just in time to hear the soft timid knock against her skylight.</p>\n<p>Chat was peering down at her, a forelorn expression on his face and a giant dufflebag of something under his arm.</p>\n<p>Marinette nodded him, granting him permission to enter, but remained curled in her bed. She had earned some quality wallowing time and she knew Chat well enough to know that he would most likely indulge her.</p>\n<p>“Hey Princess.” He said hesitantly, carefully climbing down onto the loft beside her.</p>\n<p>“I take it you heard about today?” She asked, not bothering to dance around the subject.</p>\n<p>“Yeah.” He ducked his head unhappily. No terrible pun, no enigmatic statement about how he learns so much about her life. Just a single word of acknowledgement. He clearly understood how heartbroken she was. It almost made her feel worse.</p>\n<p>Marinette didn’t say anything, she just stared at the defeated looking boy next to her, taking comfort from his presence and his sympathy.</p>\n<p>“I brought you something.” He said at last, shifting to open the dufflebag he had brought with him.</p>\n<p>Marinette’s eyes began to water again, but this time in awed gratitude as Chat pulled out a very large and undoubtedly very expensive bouquet of pink and white flowers. She reached up and accepted the gift, propping herself on her pillows so she could cradle the beautiful arrangement to her chest, inhaling the calming fragrance.</p>\n<p>She was about to thank her friend for such a thoughtful gesture when she felt the soft pressure of something being dropped onto her blanketed lap. Another followed.</p>\n<p>Marinette’s eyes widened as Chat began pulling dozens of small gifts out of the dufflebag and piling them hastily onto her bed. A box of chocolates, a small cat plush, some Dvds, a tub of ice cream… good grief was that a jewelry box?</p>\n<p>“Chat what are you doing? What is all of this?” Marinette gaped in stupefied wonder at the pile of goodies. It was like he had sat down with a list of every Rom-com cliché that you could purchase at a department store.</p>\n<p>“I didn’t know what you wanted!” He shouted, clearly embarrassed by his ignorance. “If you upset a girl you have to buy her things, and I didn’t know what to get you!”</p>\n<p>“Who on earth told you that?” Marinette asked, horrified.</p>\n<p>“Cl- a close friend of mine.” He stammered.</p>\n<p>“Your friend is a terrible person.” She replied, still taking in the several hundred dollars of worth of gifts.</p>\n<p>“That is a popular theory.” Chat muttered, slouching into the corner of her loft.</p>\n<p>He looked so miserable. He poor clueless kitten. Marinette felt her own misery withering away in light of his kindness and concern. She reached out and batted at the golden bell on his collar playfully. He looked up at her for a moment but quickly turned away.</p>\n<p>“You really didn’t have to do all of this minou.” She said softly.</p>\n<p>“Yes I did. It’s my fault you’re upset. I never should have pushed you to take this stupid bet.”</p>\n<p>“It’s not that, I am glad you did.”</p>\n<p>Chat did look at her then, his expression startled, mouth hanging open in an adorable pout.</p>\n<p>“What? Why?” <br> “Don’t you get it Chat? I have made more progress in my attempts to talk to Adrien in the past 3 days than I have in the past 2 years, and that is because of you. You have always been the person who makes it possible for me to be strong, to be brave. Without you I would never have become ladybug, and without you I never would have found the courage to even try to go after Adrien, not really. You bring out everything good and powerful and amazing in me, and I don’t know what I would do without you. I am the one who is letting you down Chat. You see so much in me that I just can’t ever be without you.”</p>\n<p>Chat stared at her, his eyes full of so much love and gratitude that she thought she might start crying all over again.</p>\n<p>“Oh My Lady. You will always have me, but I hope someday you will believe me when I tell you there is nothing that I see in you that isn’t already there. Even when you are at your worst you could never let me down.”</p>\n<p>If only she had fallen in love with him instead.</p>\n<p>“So.” Marinette looked away shyly, “I guess this means you get to kiss me now.”</p>\n<p>“I suppose so.” Chat replied lightly. “But I don’t really make a habit of kissing emotional distraught girls.” He gave her a deliberate wink, his cocky grin back in force.</p>\n<p>“Always the gentleman.” Marinette laughed a little and leaned into her partner, taking comfort in his steadfast support.</p>\n<p>“Well, maybe not always.” He teased, wiggling his eyebrows for effect and pulling the first genuine smile out of her all afternoon.</p>\n<p>Chat kissed her chastely on the top of her forehead.  “There is the smile I live for.” He said softly.</p>\n<p>…</p>\n<p> </p>\n<p>“Marinette?”</p>\n<p>“GAHHH!!” Marinette startled awake at the sight of Chat peering at her from her skylight. “What are you doing here?? What time is it?” She spluttered, thanking every star in the heavens that she had decided to sleep in a tee shirt and sweatpants and not one of her more revealing nightgowns.</p>\n<p>“It’s 7:30, shouldn’t you already be up for school? Class starts in an hour.” Chat looked genuinely confused by her sleepy state.</p>\n<p>“Yeah, which means I could have had another half an hour of sleep you worthless cat!” Marinette grumbled.</p>\n<p>“You only get up 30 minutes before class?” He ask, looking genuinely confused.</p>\n<p>“Why wouldn’t I? I live right next door!” Marinette whined. “It’s not like it takes that long to get ready in the morning. I mean how early do you usually get up before leaving for your school.”</p>\n<p>“6:00.”</p>\n<p>“No wonder you are so crazy. I suddenly have a whole new appreciation for your terrible taste in humor, you poor sleep deprived kitten.” Marinette sighed, pulling the blankets around her and snuggling back into the bed.</p>\n<p>“Hey, none of that now!” Chat chided. Flipping down into the room and yanking her covers away cruelly. “SOMEONE owes me a croissant, and I went through a lot of trouble this morning to collect it.”</p>\n<p>“Oh how awful for you. I weep for your pain.” Marinette drawled sarcastically, glaring at the pile of comforter held captive in her partner’s arms.</p>\n<p>“Don’t worry princess I have an idea for a much more effective delivery system.”</p>\n<p>“So why don’t we just use that and I can go back to sleep.” She moaned.</p>\n<p>“It won’t work yet. There is something I need to do first.” He said jovially.</p>\n<p>“You make no sense.” Marinette sighed, but she forced herself up and began climbing down her ladder to fetch her partner the promised prize. After all a deal was a deal.</p>\n<p>To say that her parents were shocked to see her up and about before the usual game of begging and bribing to leave her bed was an understatement.</p>\n<p>“Maman do we have any croissants?” Marinette asked, looking about the bakery but unwilling to venture into the front sales room still in her pajamas.</p>\n<p>“I don’t know dear. We may be sold out until the next batch. They were surprisingly popular today. Do you want me to set one aside for you for breakfast?”</p>\n<p>“No that’s ok.” Marinette said, grabbing a pain au chocolate and heading back up to the stairs. “I just need something to snack on while I finish up a project before school.”</p>\n<p>She trudged her way back up to her room.</p>\n<p>“Here.” She said dropping the plate in front of Chat, who had migrated down to her chaise.</p>\n<p>“That is not a croissant.” Chat said flatly.</p>\n<p>He continued to scowl at her as he picked up the sugary concoction and devoured it in several large hungry bites.</p>\n<p>“It didn’t stop you from eating it. So I say it counts.” Marinette retorted, sitting down at her computer. As long as she was up she might as well actually get some work done.</p>\n<p>“Well of course I am going to eat it, but I was promised a croissant. I have been dying to try one of them since…” He trailed off in a cough. “Never mind. But don’t think you are off the hook Buginette.”</p>\n<p>Marinette sighed. “I’ll make sure to put one aside for you and you can come by and grab it tonight.”</p>\n<p>“Excellent!” Chat beamed. Marinette couldn’t repress the small smile that came to her lips. He really did get excited about the smallest things.</p>\n<p>“So don’t you need to get headed off to your school?” Marinette asked, looking over at Chat.</p>\n<p>“I’ve got some time.” He smiled. Hopping up and coming over to examine the assignment she was working on. “You got number 6 wrong.”</p>\n<p>Marinette was about to protest but out of curiosity she went back and examined the problem.</p>\n<p>“Oh. Thanks.”</p>\n<p>For the next 20 minutes or so she proceeded to work on her assignment while Chat hovered over her shoulder. He nodded along encouragingly whenever she had trouble working through an answer and calmly pointed out any errors. It was nice, she realized, having him around. Despite his corrections he never scolded or tried to tell her the answers, instead trusting her to fix the problems on her own. </p>\n<p>“You’re rather good at this kitty.”</p>\n<p>“What, Maths?”</p>\n<p>“Well, that too, but I meant being a study partner. My friend Alya is a nightmare for this kind of thing. If you don’t get the answer as quickly as she does she will either try to just do it for you or complain about how obvious it is. It drives all of us crazy. I swear Adrien is the only one who doesn’t want to throttle her during study sessions. Although it might be that he’s just too polite to show it.”</p>\n<p>Chat chuckled. “I have a friend who is just like that.” He leaned down and wrapped his arms around her, both sets of eyes still locked onto the computer screen. “I am glad you are feeling better. You had me worried yesterday.”</p>\n<p>“I don’t know why I let Chloe get to me. It was stupid.”</p>\n<p>“It wasn’t stupid My Lady. Sometimes the hardest thing in the world is being honest with the people you care about the most.” Chat said softly.</p>\n<p>“Why do you say that?” Marinette asked, turning her head slightly to look at her partner, their noses almost brushing.</p>\n<p>“Because their opinions matter more.” He replied. Tilting his head to face her as well.</p>\n<p>“Well I should get going.” Chat gave her a friendly squeeze before straightening up and climbing up her loft towards her skylight. “Don’t forget you still owe me a kiss bugaboo.”</p>\n<p>“How could I possibly forget!” Marinette laughed, waving goodbye to her friend as he climbed out onto the roof.</p>\n<p>“Hey Chat?”</p>\n<p>“Yes My Lady?” He poked his head back through the trapdoor.</p>\n<p>“I know that the bet is over,” she began nervously, “but I think I am going to try again anyways.” She could feel a soft blush spreading across her cheeks as she met her partner’s surprised gaze. “I was kind of hoping that you could, maybe, wish me luck?” She gave him a sheepish smile.</p>\n<p>“I don’t think you WANT my luck My Lady.” Chat said with his trademark Cheshire grin. “Besides, you don’t need it. You can accomplish anything you set your mind to Marinette. I’ve always believed that.” And with that he disappeared in a flurry of blonde hair and glistening white teeth.</p>\n<p>…</p>\n<p> </p>\n<p>You can do this, you CAN do this. Marinette chanted to herself as she made her way towards the school half an hour later.</p>\n<p>She could see most of her class milling around the front entrance, not wanting to venture into the building until absolutely necessary. Neither Chloe nor Sabrina were in the crowd to her intense relief, but there standing on the top steps like a beacon of sunshine was…</p>\n<p>“Adrien!” She blurted out before she could lose her nerve.</p>\n<p>He turned towards her, ignoring whatever conversation he had been having with Nino and Alya and smiled at her.</p>\n<p>“Hey Marinette. Nice to see you this early.” He winked at her, and Marinette fought desperately to stay upright. She was going to do this. She was.</p>\n<p>“I was hoping that I could talk to you about something.” She said, managing to keep her voice steady by looking everywhere but at the boy she was addressing.</p>\n<p>“Sure, did you want to go somewhere? We have a little time before class if…” <br> </p>\n<p>“NO!” She shouted, instantly feeling like the world’s biggest idiot when she saw him back away startled. “I mean here is fine, I mean it’s as fine as it’s going to be I just need to tell you and if I don’t say it now then I won’t and then I will just be giving away croissants for no reason and…”</p>\n<p>“Marinette are you feeling alright?” Alya interjected, looking worriedly at her best friend.</p>\n<p>“I am fine! I just need to say this!” She slammed her eyes shut and dove in. “I mean, Adrien, you might not want to but that’s ok, because at least I will know right? And that’s ok because we are friends and no matter what we will still be friends because you are one of the greatest people I know and that’s why I have to say it because otherwise it will never happen, because I was the scaredy cat not you, never you.”</p>\n<p>“Ok is she having a stroke or something?” Nino stage whispered to Alya and Marinette made a mental note to smack him later, sometime when her heart wasn’t trying to leap out of her throat.</p>\n<p>“So, what I mean to say is…” She took a deep breath, “WILLYOUGOOUTWITHME?”</p>\n<p>YES!</p>\n<p>She opened her eyes and saw Alya and Nino’s dumbfounded looks but they were insignificant to Adrien’s joyous, proud expression. He was smiling at her. Not his usual soft smile that made him so popular to photographers, but a wide toothy grin that was both strange and achingly familiar.</p>\n<p>Without any more warning Adrien pulled her towards him and covered her lips in a deep, searing kiss.</p>\n<p>He was kissing her! Not some innocent peck on the lips, not a tentative pressing of lips. No, this kiss was hard and hungry. He kissed her like she was water and he was dying of thirst, he kissed her with a ferocity that made her knees buckle and her limbs shake, melting into a helpless mewling puddle in his arms. He kissed her like he loved her.</p>\n<p>It was everything she had ever dreamed it could be and so much more.</p>\n<p>She knew that around her people were reacting. You can’t just start making out with the hottest guy in existence in front of most of your class without some sort of reaction, but somehow nothing registered. It was as though she and Adrien were trapped in a perfect bubble of existence where nothing was real except the feeling of his lips against hers.</p>\n<p>She was drowning in sensations. She could smell his cologne mixed with that ever present sent of cheese that he always seems to carry. She could feel the soft texture of his hair against her fingers, although she had no idea when her arms had managed to wrap around his neck. She could taste the lingering traces of sugar and chocolate that clung to his mouth from the pastry he had eaten earlier… wait…</p>\n<p>“You still owe me a croissant My Lady.” He whispered as she gasp for air.</p>\n<p>Marinette’s startled cry was silenced as his mouth once again descended to claim hers.</p>"
}