{
  "id": "746374",
  "url": "https://archiveofourown.org/works/746374?view_full_work=true",
  "author": [
    "adelagia"
  ],
  "title": "Fools of Us All",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin/Arthur Pendragon (Merlin)"
  ],
  "characters": [
    "Merlin (Merlin)",
    "Arthur Pendragon (Merlin)"
  ],
  "additional_tags": [
    "Fluff",
    "Future Fic",
    "Humor",
    "Porn"
  ],
  "language": "English",
  "series": "",
  "published": "2013-04-03",
  "completed": null,
  "words": "11,141",
  "chapters": "1/1",
  "comments": "354",
  "kudos": "17,905",
  "bookmarks": "3,110",
  "hits": "201,731",
  "summary": "<p>Merlin accidentally makes everybody in Camelot fall in love with him. Everybody except Arthur, that is.</p>",
  "notes": "<p>Much, much love and thanks to jandjsalmon for getting her beta skills all up in here. Originally posted on LJ in 2009.</p>",
  "text": "<p>Merlin was getting out of hand. Or rather, the people around Merlin were getting out of hand, and Arthur wondered how much his reputation as a benevolent king would suffer if he ended up decking everybody who dared to impose themselves on his -- well, <i>Camelot's</i> resident sorcerer.</p>\n<p>Merlin was a little bit special, no doubt. Through no fault or much effort of his own, he tended to just charm the trousers off people everywhere he went. Cooks known to wield spoons like lances against trespassers plied Merlin with little cakes whenever he ambled through the kitchens; normally gruff knights smiled and waved at him when he walked past the training grounds; even restless destriers allowed him to pat their noses and ate things out of his hand without biting his whole arm off when he found himself in the area of the stables.</p>\n<p>There was nothing particularly disingenuous about it; Arthur had long ago accepted this phenomenon as part and parcel of Merlin, who was as much oblivious to it as he was with most everything else, his head stuck happily in the clouds half the time.</p>\n<p>Of late, however, Arthur had begun to find all the fawning over Merlin far more irksome than usual. Twice in as many days he'd passed little clusters of chambermaids shirking their duties in order to crowd around each other and titter about how gorgeous Merlin looked now that he'd taken to wearing a bit of a beard -- which had been Arthur's idea, thank you. It had been something of a dare, actually, because for some reason he'd been sure Merlin would look hilariously pervy and not kind of stunning instead. Not that Arthur had formed an opinion about it either way.</p>\n<p>And he was fairly certain that a minor scuffle had broken out yesterday after he'd heard Kay ask Bedevere what he thought Merlin's favourite flower might be. The answer, to which neither of them had even come close, was that Merlin was allergic to most flowers and therefore had not done extensive enough studies to appoint any species his favourite. Unrelatedly, Arthur decided that both Kay and Bedevere were morons.</p>\n<p>To further incur suspicion, just this morning he'd seen Merlin loping hurriedly across the courtyard with a courtier, a laundress and two stable hands in tow, at least one of whom appeared to have been spouting poetic verse -- in a rather loud, surly manner, to be sure, but as fast as Merlin had been running to wherever he was trying to get to, whispering romantic couplets in dulcet tones was probably out of the question. In any case, Arthur rather thought poetry was a massive insult to all of literature, and Merlin was right to run from it.</p>\n<p>It had been manageable, maybe a little amusing even, when the attention paid to Merlin had stemmed from more of a motherly sort of nature, when people made comments like, <i>what a precious little lamb, that Merlin, bless his soul,</i> or <i>oh, isn't he just a duck</i>. But something had changed overnight, it seemed, and now people didn't want to ruffle his hair or give him nice things to eat, they just plain <i>wanted</i> him.</p>\n<p>It was sick-making.</p>\n<p>Arthur himself hadn't even had a chance to speak to Merlin for a few days, as he'd ensconced himself in his chambers for hours on end trying to wrap his head around the myriad affairs of state that needed his undivided attention, so whatever virulent strain of Merlin-related madness that had taken hold of most of his staff apparently had just passed him by.</p>\n<p>He couldn't help but feel he'd missed something vitally important while he'd been busy looking out for the welfare of his kingdom. And it certainly wasn't helping that, if all the palaver was anything to go by, Merlin had apparently been swanning all over the castle grounds giving people the vapours, with said people coming out of their swoons just long enough to gush about how handsome and lovely and handsomely lovely Merlin was.</p>\n<p>Arthur didn't even know what the sudden attraction was; Merlin looked pretty much the same as he'd ever had. When he wasn't conducting official business, he still had the air of a callow, impecunious country boy, clad in too-loose tunics and scuffed shoes and silly scarves, and when he <i>did</i> conduct official business, he wore overflowing robes and Arthur's old boots and a silly hat (Arthur's idea also), so improvements in the wardrobe department were only by mere degrees. Merlin was really just a patchwork of oddities, bits and pieces moulded and beaten into an unlikely whole by someone's misguided force of will; his ears were ridiculous, face too long, hair a total disaster, cheekbones too high, lips too full, eyes the startling blue of a perfect midsummer morning sky, and -- well, now Arthur was just getting off track.</p>\n<p>The point was -- Arthur wasn't actually sure what the point was, but it was very displeasing nonetheless and left a weird, achy sort of feeling in the pit of his stomach when he thought about it for too long.</p>\n<p>He was saved from further investigation into intestinal troubles when his chamber doors fired open and Merlin catapulted in, eyes bright and colour high on his cheeks. Arthur felt unreasonably glad to see him, so much so that he didn't even bother dredging up the whole spiel on knocking, which Merlin had memorised by now anyway and would occasionally parrot to him behind his back.</p>\n<p>\"Arthur,\" Merlin squeaked, his back braced against the door he'd flung shut, as though he was expecting someone to batter it down. Behind him, a dull thud and muffled \"oof\" filtered through from the outside of the chambers. \"Help me.\"</p>\n<p>Arthur pushed aside the papers he'd been reading for the past hour (and failing for most of that hour to digest any salient information). He looked up at Merlin with practised imperturbability. \"You've been mentally unhinged for years; I think it's safe to say you're beyond help now.\"</p>\n<p>\"Not funny. I'm being hunted down!\"</p>\n<p>\"What did you do?\"</p>\n<p>Merlin bristled, abandoning his position at the door. \"Why are you so quick to assume <i>I've</i> done something wrong?\"</p>\n<p>\"<i>Have</i> you?\"</p>\n<p>\"Well,\" said Merlin, shifty.</p>\n<p>Arthur rolled his eyes, nearly spraining himself from the workout. He pushed past Merlin and pulled open the door, and upon seeing the distressed faces of the two stable hands he'd spied in the courtyard earlier, barked, \"You can't have him. Go away.\" Arthur was not fond of slamming doors, but he thought it was all right in this case and hoped it caused significant bruising. That would teach them to stalk his -- <i>Camelot's</i> resident sorcerer. He turned back to Merlin. \"All right. Let's have it.\"</p>\n<p>Merlin opened his mouth to confess and stopped short, suddenly looking at Arthur warily with a sidelong stare. \"Hang on. Aren't you attracted to me?\" he asked suspiciously.</p>\n<p>It was such an abrupt change of subject and so pointed and penetrating a question that Arthur felt his heart undergo a minor implosion. \"What? Where did you hear that? It's a lie. A filthy, horrible lie,\" he blurted, which might have also been a lie.</p>\n<p>Merlin looked stunned for a moment, like he'd just run into a stone wall, and then mustered up a relieved laugh. \"Oh, thank god, Arthur,\" he breathed. \"I'm safe with you!\"</p>\n<p>\"What -- Of course you are. I'd never let any harm come to -- Wait, are you hurt? Did someone hurt you?\" Arthur asked, his heart rapidly patching itself together just in time to clench painfully at the thought of someone laying hands on Merlin. Immediately, he stepped forward to check Merlin for injuries and find out who he needed to have killed, but the idiot only laughed.</p>\n<p>\"No, no, nothing like that,\" Merlin said, his smile warm like the sun. \"It's just that --\" his smile faltered \"-- er, I may have unleashed a fairly strong love potion on, er, you know, the castle?\"</p>\n<p>\"What?\" said Arthur, and it was really remarkable how many times he had to use that word when Merlin was involved. \"<i>Why?</i>\"</p>\n<p>\"It wasn't on purpose! I just -- fell.\"</p>\n<p>\"What were you doing with a love potion in the first place?\" Arthur demanded, appalled that Merlin would resort to such a thing, and simultaneously wondering which comely maiden in Camelot he'd have to destroy so Merlin could safely direct his affections elsewhere. Not that Arthur had a particular direction in mind.</p>\n<p>Merlin dragged a chair out from the table and flopped into it without asking for leave, the insolent whelp. \"You know how you were complaining last week about how the marshal was having trouble getting your two best horses together for breeding because they hated each other on sight and were doing a lot of biting and kicking?\"</p>\n<p>\"I recall remarking upon it in a calm and level tone, yes.\"</p>\n<p>Wisely, Merlin chose to leave that statement alone and said, \"Well, I wanted to help, so I did some research and modifications, and brewed up a potion that theoretically would have made the horses have, ah, amorous feelings towards one another.\"</p>\n<p>\"And?\"</p>\n<p>\"Inconclusive?\" Merlin ventured. \"See, I was on my way to the stables a couple of days ago with the potion, and I tripped in the courtyard and spilled it all over myself, so I assume the horses are still plotting against each other.\"</p>\n<p>\"I see,\" said Arthur, glad he didn't have to destroy anyone after all but also just a little exasperated. \"God, is that why everyone's been insane and mooning after you? I <i>knew</i> there was something horribly awry.\"</p>\n<p>\"Those flagstones are very uneven,\" Merlin said, slacking on the conversational pace.</p>\n<p>\"Merlin,\" Arthur groaned, for lack of anything better to say besides pointing out how thousands of other people managed to pass through the courtyard everyday without meeting their bloody ends. He knew Merlin. He'd seen Merlin rain down destruction on Camelot's enemies in the middle of a charred and bloodied battlefield, grapple with the ancient rules of the Old Religion and emerge the stronger, wield the balance of nature in his hands and willingly let that heady power go simply because he was better than that. Merlin was the most powerful sorcerer the world had seen in an age, and yet he still hadn't managed to master the basic fundamentals of <i>walking in a straight line</i>.</p>\n<p>Merlin smiled awkwardly, shrugging.</p>\n<p>\"So, every person in the castle has been madly in love with you since?\" Arthur clarified.</p>\n<p>\"Yeah. I suppose it would be flattering in a way, except for the part where it's just mostly really weird and awful,\" Merlin said slowly, his mouth gradually twisting downwards and face turning wan. \"Do you know someone tried to grab my bum yesterday?\"</p>\n<p>\"What? <i>Who?</i>\" Perhaps he'd been too hasty in assuming no one needed to be eviscerated after all.</p>\n<p>\"The rat-catcher. Said I was his favourite,\" said Merlin forlornly, and nodded when Arthur made a disgusted noise at the mental image of the crusty old man coming on to Merlin. \"That's just wrong. He hates <i>everybody</i>.\"</p>\n<p>The last word was said in a bit of a wail, so Arthur, feeling somewhat compelled to soothe away the worry and make Merlin feel less poorly about his invention being so inadvertently successful and potent, temporarily set aside his plans for accidentally heaving the rat-catcher off the battlements. \"It's not your fault,\" he said kindly, grasping at invisible straws. On second thought, \"All right, so it is actually entirely your fault, but, erm -- <i>I'm</i> not throwing myself at you, so that's something, isn't it?\"</p>\n<p>Merlin shot him an inscrutable look, and then sighed quietly, as though disappointed, which was preposterous. \"Yeah, you must have a constitution of steel.\"</p>\n<p>Of course he did. Arthur hadn't spent years undergoing Merlin's torturously slow hands peeling clothes off him and gently washing grime off his skin after a hard day's work without figuring out how to batter the sensory overload into submission and layer tar over his heart every time Merlin smiled warmly at him in the process. Some ill-conceived, botched magic wasn't going to catch him out now. Though if he'd known beforehand that any advances could be chalked up to being ensorcelled, he might have -- well, no, he still wouldn't have. It wasn't befitting behaviour for a king, and he liked Merlin too much to do that to him besides.</p>\n<p>Arthur dragged his focus back to the exigency at hand -- and it truly was a bit of a crisis; he couldn't have his best and only sorcerer constantly beset by lovesick, lust-filled fools, and if not for Merlin's health and sanity, then his own. He was fairly certain he'd have to start running people out of the castle soon if this didn't stop, and he really didn't want to since it wasn't their fault they couldn't help pawing at Merlin. \"Merlin, if that happened two days ago and people are still chasing you now -- how long is the enchantment supposed to last?\"</p>\n<p>\"No idea,\" said Merlin, his shoulders sagging. \"I mean, it'll wear off eventually; all spells do. But I did make this one rather strong. It <i>was</i> for horses. They're quite large, you know. And given that I poured the entire batch down my front, it may be a while. I've been trying to work up some kind of antidote, but people keep barging into my rooms and shouting poetry at me, so it hasn't been going very smoothly.\"</p>\n<p>\"Well, you can't hide in here forever just waiting it out,\" Arthur said reasonably, at which point an insistent voice in his head piped up with, <i>yes, he can, stop ruining everything, you </i>want<i> him to stay forever</i>.</p>\n<p>Arthur might have considered the thought a result of being in the very near vicinity of someone who'd just confessed to magically making everyone fall in love with him, but if he was being perfectly honest with himself -- which he tried never to do, because that way lay madness and also a little bit of heartache, and only an idiot of the greatest proportions would willingly subject himself to either of those things -- he knew it had nothing to do with the potion. The sad truth was that Arthur had been harbouring these kinds of horrible thoughts for years, and magic probably wasn't going to change that one way or the other. He told the voice to shut its gob, and put in a rush order for additional fortifications on his traitorous heart. He'd tar the sorry thing to hell and back if he needed to.</p>\n<p>\"-- pheromones,\" said Merlin.</p>\n<p>\"What?\" said Arthur, realising rather belatedly that while he'd been trying to wrestle with his mental health, Merlin had been speaking all this time, and at length about -- something.</p>\n<p>Merlin gave him a baleful glare. \"I took two baths. Didn't help,\" he said, enunciating each word like Arthur was hard of hearing on top of being dim.</p>\n<p>It was very irritating how Merlin didn't care what Arthur wore on his head, and was the only one of the court advisors who never hesitated to speak freely, whether he agreed with Arthur or not. Arthur rather liked that about him, which was also irritating. \"Didn't anybody tell you you can't speak to your king that way?\"</p>\n<p>\"You may have mentioned it. Probably while I wasn't paying attention.\"</p>\n<p>\"Yes, <i>that</i> narrows it down.\"</p>\n<p>Merlin chuckled, crinkling his eyes into little half-moons. \"This is a right mess. Sorry.\"</p>\n<p>\"Don't be,\" Arthur said at once. As far as Arthur was concerned, Merlin had already built up such a deep reserve of goodwill and magnanimity in everything he'd endured for Arthur's sake throughout the years that forgiveness was something he would never have to ask for.</p>\n<p>And it was probably a little silly, but in a way, Arthur welcomed this odd predicament. It felt a bit like old times, when it was often just the two of them running off on inadvisable adventures, when they understood and trusted each other implicitly even if nobody else did, when his crown wasn't so heavy and Merlin hadn't yet bloodied his hands in war. He wasn't so foolish as to think that youth could be recaptured in any way, but in the intervening years between his taking on the mantle of kingship and where he and Merlin stood now, their friendship had suffered a little from all the duties they'd taken on over the years, leaving less and less time for each other and their occasionally stupid ideas of entertainment, and he often wondered if it was all irrevocably lost.</p>\n<p>They were both remarkably busy most of the time now, what with keeping a kingdom running at full capacity, and sometimes Arthur wished there was nothing extraordinary about Merlin beyond being <i>Merlin</i> so that the promotion to court advisor wouldn't have been deserved or necessary, but he knew he was just being selfish when he thought it because without Merlin's magic, Camelot would have fallen ages ago. And loath as he was to admit it, Arthur missed having Merlin around all the time and getting underfoot, not just because it still threw him off that everything was done perfectly to his specifications now and there was nobody to berate about being useless and clumsy and Merlin.</p>\n<p>\"All right,\" Arthur said, making a snap decision. The kingdom could wait. \"Pack your things.\"</p>\n<p>\"What?\" said Merlin, and Arthur awarded himself a point for throwing him off kilter. \"You're not sacking me, are you?\"</p>\n<p>\"Why do you always think I'm going to sack you?\"</p>\n<p>\"Well, you've done it before,\" Merlin said mulishly.</p>\n<p>\"Only twice,\" Arthur pointed out, \"which I reneged on both times. And if I couldn't get rid of you then, when you were a lying, cheating, secret criminal sorcerer --\" Merlin formed a rude hand gesture \"-- I'm certainly not letting you go now. Put that away; you're not helping your case.\"</p>\n<p>Merlin's lips quirked upwards. \"Fine. What am I packing for, then?\"</p>\n<p>\"Well, <i>Merlin</i>,\" said Arthur, relishing the feel of the name on his tongue, \"we're going hunting.\"</p>\n<p>\"Aargh,\" said Merlin, drawing the groan out like the way some of their less talented bards chose to perform melodramatic death scenes. \"Is unemployment still on the table?\"</p>\n<p>\"No,\" Arthur said blithely. \"You missed your chance. Besides, do you want an afternoon out of the castle and away from prying eyes and filthy hands and insipid poetry or not?\"</p>\n<p>\"I see your point,\" Merlin conceded, propelling himself out of the chair and making for the door. \"But I'm not killing anything. Or skinning anything. Or baiting large beasts with my apparently very expendable person.\"</p>\n<p>\"Like you ever did any of those things to begin with,\" said Arthur, because he hadn't taken Merlin along on hunting trips all those times under the impression that Merlin was skilled or helpful in any way.</p>\n<p>In the beginning, he'd dragged Merlin out with him because he wanted to teach Merlin the ways of the wild. Then, sometimes it had been because Merlin had been impudent, and nothing dashed his spirits faster than crunching around in the undergrowth and being a decoy for big, scary things with lots of teeth. Eventually, though, Arthur had brought Merlin along just because it was boring without him there, and though Arthur went hunting a lot less frequently now, he still sort of missed Merlin gadding about and trying his stealthiest to shoo the cuter animals out of range whenever he did get the chance to put his crossbow to use. And now that Merlin sorely needed a respite from castle life, Arthur decided that here was a rare and perfect opportunity to get Merlin out there with him again, and felt rather pleased about it.</p>\n<p>So, of course, it was doomed for failure from the start.</p>\n<p>*</p>\n<p><br>They emerged from the depths of the forest a short time later, Merlin perched precariously on his horse, looking slightly pallid and queasy, and Arthur riding just ahead and feeling a little put out. Trailing merrily alongside, a cavalcade of impossibly docile woodland creatures who seemed unaware that Arthur had just murdered several brace of their brethren and were perfectly content to follow in Merlin's wake, hoping for a nice pat or two and possibly a lifetime of happiness. Occasionally, Merlin looked back at them with a mixture of wretchedness and curiosity on his face and tried to tell them to go home, but they only chirped or hooted or squeaked at him affectionately.</p>\n<p>\"Oh, god,\" Merlin said.</p>\n<p>\"Would you like me to shoot them?\" Arthur offered gallantly, eyeing their furry and feathered retinue with a mistrustful glare.</p>\n<p>Thankfully, by the time Merlin and Arthur reached open road, the animals' natural instincts kicked in and told them it would be extremely unwise to leave the shelter of the forest just for the unrequited love of the sad, pale man with a nest atop his head, and disappeared into the green expanse in short order.</p>\n<p>\"Oh, <i>god,</i>\" Merlin said again as the last of the creatures bounded out of sight and the castle bloomed into view.</p>\n<p>\"Well, at least now we know your love potion works on animals, too, great and small.\"</p>\n<p>\"You could have left the bear alone,\" Merlin grumbled.</p>\n<p>\"What -- No, Merlin. I could not have left the bear alone. It was about to attack you. Just because you have a criminally soft spot for furry things doesn't mean they feel the same about you. I mean, non-magically, anyway. Also, it was a <i>bear</i>. They will eat you, as a rule.\"</p>\n<p>\"He was only trying to be friendly. He wasn't going to maul me or anything.\"</p>\n<p>\"Well, it wasn't going to give you a nice hug and let you on your way, either. I don't think you fully understand the logistics of a bear attack, Merlin. I saved your life; now stop moaning about the bloody bear,\" Arthur said, wanting a little more credit for effectively stopping a giant animal's mad rampage (which, admittedly, had been less 'mad rampage' than 'quiet lumbering', but it was the thought that counted, or so Arthur had been told). \"Anyway, it'll live. I only just <i>scratched</i> it.\"</p>\n<p>Merlin worked up a smile, like he knew Arthur specifically hadn't killed the thing on the spot because it would have upset him. Arthur himself was choosing to believe that he'd been merciful purely out of practicality; lugging a bear carcass home between just the two of them would have been a nightmare. And also he hated when Merlin got sulky at him.</p>\n<p>They rode back in relative silence, with the occasional sparrow or thrush alighting on Merlin's shoulders, until Arthur decided that enough time had passed that he could rib Merlin about being just a dress away from larking through the forest and singing about his true love. When that didn't go over well, Arthur segued smoothly into awful, ribald jokes about bestiality, which Merlin countered by trying to push him off his mount, and in their ensuing bickering and mild violence, punctuated loudly with Merlin's boyish laughter and those disarmingly sweet grins Arthur was sometimes convinced Merlin reserved just for him, Arthur felt more content than he'd had in a long time.</p>\n<p>*</p>\n<p><br>\"I wonder,\" Merlin said quietly, when they reached home and the stabled horses whinnied and stamped loudly at the sight of his return. His eyebrows knotted together briefly.</p>\n<p>\"What?\" Arthur asked, dismounting.</p>\n<p>Merlin worked at removing his bay's reins while it chewed gently at his hair, a harmless habit Merlin had never really bothered to quell. \"It's just -- <i>our</i> horses. They haven't been acting any differently towards me,\" Merlin mused. He glanced at the other horses in their stalls. \"Those ones are getting excited, and there was that whole debacle with the forest animals -- which we will never speak of again -- but our horses are fine.\"</p>\n<p>Arthur frowned and thought on this for a moment as he watched Merlin absently pat at his horse. \"Well, considering the circumstances, that's easy, I think. We've used these two horses fairly exclusively for years, so they already know you and love you. You know mine won't let anyone but you or me touch him,\" he said, and stroked his palfrey's mane appreciatively, as though unbridled testiness and bad manners were desirable qualities in a mount. \"I don't think magic can force what's already there, can it? It wouldn't need to.\"</p>\n<p>Merlin threw him a sharp, curious look and then blinked it away. \"That can't be it,\" he said. \"If that was true, then it would mean that <i>you</i> love m-- Mm. Well.\" He coughed, strained, and then pretended very badly to have trouble with the reins.</p>\n<p>In the meantime, Arthur froze, his heart exploding in a horrific cascade of shrapnel and tar and denial. Unfortunately, none of those things managed to wreak any damage on the rest of his vital organs, so he remained alive and rooted to the spot while his mind worked furiously to calculate the exact formula that would send him back in time, so he could stop his idiot self from carelessly revealing things no one needed to know.</p>\n<p>Which was possibly the dumbest idea he'd ever thought of, but, all things considered, he <i>was</i> a bit desperate, not to mention being completely distracted by his stomach churning spitefully with the awful, sickening knowledge that the reason why the magic was having no effect on him was because there was no way he could love Merlin more than he already did.</p>\n<p>This, he remembered, was why he hated being honest with himself about Merlin. All it got him was an inordinate amount of gooey and inappropriate feelings that he had no idea what to do with, and a bad spot of indigestion besides. It was all extremely untoward. Arthur frowned very hard at his feelings, but they remained oblivious and stupidly in love.</p>\n<p>\"Yes. No. I mean, what?\" Arthur tried to salvage, but only managed to painfully shame his elocution tutors instead.</p>\n<p>\"Nothing,\" said Merlin quickly. And for good measure, added, \"Nothing. Ah, I'll just take these dead animals to the kitchens for you, shall I?\"</p>\n<p>\"Right. Yes. Good,\" said Arthur, relief strongly tempered by an odd disappointment. He watched Merlin, red-faced, fumble with the carcasses, and tried to think of a discreet way to throttle himself.</p>\n<p>*</p>\n<p><br>Arthur retired to his chambers ready to throw himself into a fit of blinding misery. He couldn't fathom how people the world over managed to be in love and not want to drown themselves in boiling oil all the time. He was the king, for pity's sake; he shouldn't have to deal with such trifles. He had a kingdom to run and people to protect; he didn't have <i>time</i> for things like love, or Merlin, or Merlin's stupid, beautiful face. Or Merlin's dexterous hands, or devastatingly brilliant smile, or wretchedly pretty eyes, or the way he got excited and curious about little things, or his exasperatingly, wonderfully soft heart, and Arthur was seriously <i>this close</i> to punching his feelings in the face.</p>\n<p>Distantly, outside the room, somebody slaughtered a cow. Arthur lifted his head and stepped out of his nice, warm, miserable wallow, shuffling over to the door to look into why his corridor had suddenly turned into an abattoir.</p>\n<p>The first thing that came into view was Merlin dashing past and shouting, \"No thank you!\" over his shoulder. The second was a burly squire, whapping at a lute and severely assaulting every ear within a five-mile radius with what Arthur generously assumed to be a romantic ballad that he seemed to be making up on the spot.</p>\n<p>\"Oh, sweet Merlin, you are my destiny!\" he belted with great bovine incompetence, lolloping past Arthur's door. \"You make my knees weak and my hands go clammy!\"</p>\n<p>Arthur wrenched the lute out of his hands and flung it against the opposite wall, where it splintered and twanged sadly. \"You,\" he ground out, glowering as hard as he could at the squire. \"Take your infernal instrument and get out of my sight before I do the world a favour and remove your larynx with my bare hands.\"</p>\n<p>The squire uttered a frightened peep and picked up the remains of his lute before beetling off in a hurry.</p>\n<p>\"Merlin,\" said Arthur to the corridor.</p>\n<p>Merlin peered at him from around a corner. \"Er, thanks,\" he said, coming forward. \"Very menacing, sire.\"</p>\n<p>\"That was the idea. People ought to fear their king anyway. Which is yet another lesson you've failed spectacularly to learn.\"</p>\n<p>Merlin laughed softly. \"It's probably because I didn't have a very good teacher. Your people don't fear you, Arthur, not really. They serve you because they love you.\"</p>\n<p>Arthur wasn't quite sure what to make of that, and certainly didn't want to read too hard into things for coded messages that may or may not exist, so instead he cleared his throat. \"I see it was imprudent of me to leave you to your own devices. It hasn't even been twenty minutes since I saw you last and already people are composing epic songs about you.\"</p>\n<p>\"Between that and the scullions who've set up camp outside my rooms, I'm not sure I'll survive the week,\" Merlin said, rather macabrely.</p>\n<p>These developments were slightly alarming; Arthur imagined a gang of scullions getting handsy with Merlin and wished he'd kept the lute so he could bash it over their heads. \"All right, that's it. You're staying with me from now on,\" Arthur ordered. \"Clearly, I'm the only sane person left in this entire castle, and I won't have you besieged in your own quarters like a treed beast.\"</p>\n<p>\"No, Arthur,\" Merlin sighed. \"I caused this problem and I'll get it under control.\"</p>\n<p>\"<i>Right</i>. I've seen you running away from people at least three times today. I would hardly consider that getting things under control, Merlin,\" Arthur scoffed, and with a sweep of his hand, ushered Merlin inside his chambers. Closing the door behind him, Arthur added, \"Besides, my presence seems to be something of a deterrent, so you should be safe here. And don't think you're imposing, either. This room's big enough for you and fifty of your idiot admirers.\"</p>\n<p>Merlin went silent for a moment, brows furrowed and lips twisting, clearly having some kind of internal debate, which Arthur increasingly feared involved Merlin trying to think of the gentlest way to say, <i>Oh, dear god, please no</i>. He was about to loudly rescind the offer when Merlin, shrugging hesitantly, smiled and said, \"Erm, okay.\"</p>\n<p>One voice in Arthur's head cheered, while another called him an arrant masochist. Between the voices pitching up all the time and the fact that he'd just invited the object of his secret affections to spend, given the unknown duration of the potion, possibly the rest of his life with him in complete chastity, Arthur wondered if, in centuries to come, historical annals would pin his legacy down to just four simple words: <i>King Arthur -- totally deranged.</i> He'd have to make sure he was extra nice to Geoffrey from now on for additional insurance that future generations wouldn't look back on him in mocking hilarity.</p>\n<p>They passed the rest of the day ankle-deep in work since kingdoms didn't stop running just because their king was hopelessly infatuated with his former manservant, and aside from a non-topical, heated discussion over who had saved the other's life more times (Merlin won, smugly, and wouldn't let Arthur count the bear attack), the afternoon sailed by fairly uneventfully. Arthur ordered a couple of servants to haul in and make up an extra bed, and glared daggers at them whenever they tried to curry Merlin's favour, which seemed to amuse and mortify Merlin at once. It turned his cheeks a becoming shade of pink, which Arthur tried very hard not to notice, and then silently pleaded with the floor to crack open and swallow him up when noticing was the only thing he seemed to be capable of doing.</p>\n<p>At dinner, since a cauldron of boiling oil wasn't readily available, Arthur attempted to drown himself in wine, in the hopes that annihilating his liver would be distracting enough that it would put him off the fact that Merlin was spending the night in the most platonic way possible and that making Merlin stay with him was probably the stupidest thing he'd ever done to himself, especially considering he might have to keep this up for who knew how long. On his sixth cup, Arthur silently revised his historical record to: <i>King Arthur -- severely mental; death by raging alcoholism.</i></p>\n<p>Incidentally, debating with himself over whether he wanted to be known for the rest of time as 'severely mental' or, more succinctly, 'completely fucking insane' was the last thing he remembered before a shaft of sunlight blazed holes in his eyeballs. Arthur awoke to a pounding headache and the suspicion that a vole had mistakenly crawled into his mouth sometime during the night and spontaneously combusted on his tongue.</p>\n<p>\"Arthur.\"</p>\n<p>\"Nngh,\" said Arthur, praying for the sweet release of death.</p>\n<p>\"<i>Arthur</i>.\" This entreaty was accompanied by a shake of his shoulders, and then a light slap across his cheeks.</p>\n<p>\"If you do that again, I will personally chop your head off and serve it to my dogs,\" was what Arthur wanted to say, but it came out more like, \"Snnx.\"</p>\n<p>\"Oh, for the love of --\" Merlin bodily pushed Arthur up and out of bed, directing him with some difficulty to the bath chambers, and stood him in front of a basin of clear, cold water. \"Wash,\" he said mildly. \"God, Arthur.\"</p>\n<p>\"Stop shouting,\" said Arthur, and obediently splashed water on his face, while Merlin dragged a damp towel over his neck. It left him feeling only minutely better for a brief moment before a procession of drummers started up a rousing march across his brain. \"I'll shower you with gold, Merlin, if you kill me now.\"</p>\n<p>\"I told you not to drink so much,\" Merlin admonished, and disappeared back into the bedroom to give Arthur some privacy now that he was at least conscious enough to make the rest of his morning toilet without risk of falling down.</p>\n<p>After torpidly getting through his usual morning routine, cleaning his teeth with a little extra vigour and thoroughly rinsing the vole's remains out of his mouth, Arthur returned to find the windows considerately shuttered against the bastard sun, and Merlin sitting cross-legged on his bed with a pillow laid across his knees and an overly polite, flourished gesture for Arthur to lie down, which made Arthur laugh in spite of his condition.</p>\n<p>Arthur did as he was told without argument, busy trying to think up valid reasons to get all percussion instruments permanently outlawed, and almost purred aloud when Merlin's fingers descended upon his scalp, gently soothing his ills away. As the thumping drumbeats faded away into oblivion, Arthur smiled and sighed, wondering how much offence Merlin might take if he demoted him to court masseur (whose services nobody but Arthur would be allowed to enjoy ever).</p>\n<p>Merlin's upside-down face appeared over his head. \"Better?\" he asked.</p>\n<p>\"Much,\" Arthur said gratefully, and made no move to get out of the nice cradle of Merlin's lap. He felt the slight vibration of a chuckle rumble through Merlin's body as Merlin's fingers moved downward to work the stiffness out of his shoulders, deep warmth suffusing his skin, which he wasn't sure was magic or just Merlin.</p>\n<p>They painted such a picture of domestic bliss that Arthur's heart felt fleetingly happy before being crushed by the slap of reality that told him in no uncertain terms that none of this was real, that Merlin was probably only doing this to be kind, and that Arthur was seriously delusional if he thought this was going anywhere. It was enough to drive a man to drink. Again.</p>\n<p>Which was exactly what Arthur did later that night, after a day of long walks with Merlin along lesser-used roads where only a few birds found them and declared Merlin's bony shoulders a perfect perch; intense scowling at anyone who dared make cow eyes in Merlin's direction; ordering squads of servants to clear out the abundance of dried flowers and love letters that had piled up outside Merlin's rooms; poring over dusty books to see if they couldn't find some way of making Merlin absolutely repellent to the rest of the population.</p>\n<p>The last clear image he had was of Merlin frowning at him, and the last coherent thought he recalled was that history might also celebrate him as <i>King Arthur -- the saddest and most pathetic man who ever lived</i>.</p>\n<p>There was also a vague, swimming vision of Merlin smiling sadly while sweeping the damp fringe off his forehead and cupping his cheek, but that one obviously could be ascribed to drunken hallucination. Obviously.</p>\n<p>*</p>\n<p>\"Arthur,\" said Merlin the next morning, rubbing Arthur's temples again while Arthur tried not to hum contentedly. \"Is something bothering you?\"</p>\n<p>Other than the distressing temptation to take up alcoholism as an avid hobby just to have an excuse for Merlin to touch him every morning because he was helplessly and idiotically arse over elbow for the man, no, life was just perfectly <i>perfect</i>. \"Why do you ask?\" Arthur hedged.</p>\n<p>\"Well, usually you're a little more -- <i>judicious</i> with your wine.\"</p>\n<p>\"Judicious? That's a very big word for you,\" Arthur said appraisingly.</p>\n<p>\"Oi,\" said Merlin, and gave him a weak clout on the side of his head. \"I'm trying to be concerned for your health and well-being.\"</p>\n<p>\"By <i>concussing</i> me?\" Arthur heaved himself up onto his elbows and twisted his body around so he could face Merlin and glare appropriately. \"Assaulting your sovereign is not kindly looked upon, Merlin. I could have you executed. I'll feed you to that bear you were so keen on.\"</p>\n<p>Merlin looked distinctly unruffled by his death threats. \"First of all, we're not talking about that. Secondly, if you really wanted to kill me, you'd have done ages ago, so I seriously doubt I'm getting eaten today,\" he said, with a rather complacent, happy gleam in his eyes. \"Besides, I'm pretty sure there's a royal charter somewhere that says it's perfectly acceptable to box your king's ears if he's being an incorrigible prat.\"</p>\n<p>\"Well, you must have missed the clause I appended, which states that King Arthur is well within his rights to retaliate in the event that his assailant happens to be a hapless wizard called Merlin.\"</p>\n<p>Said hapless wizard elevated a wary, possibly even challenging, eyebrow.</p>\n<p>\"So say we all,\" Arthur intoned solemnly, and tackled him.</p>\n<p>Merlin squawked in surprise, and then burst into a silver peal of laughter at the extremely unmanly sound, while he struggled valiantly and futilely underneath Arthur.</p>\n<p>\"Show some respect to your superiors, <i>Merlin</i>,\" Arthur ragged, obnoxiously gleeful, and manhandled him into a headlock.</p>\n<p>\"But there aren't any here!\" Merlin protested, trying to wrest some smidgen of control back and ultimately failing because he was laughing too hard, which, in turn, set Arthur off.</p>\n<p>His head was so thick with joy that it took a while for his thought process to catch up with his impulses, and when it did, it was like being struck in the face with a wooden plank. This was a stupefyingly, horrendously bad idea. Not only was he -- <i>the king</i> -- tussling with one of his court advisors like two adolescent boys with nothing better to do on a lazy summer afternoon, his body, deciding that it was going to get its fill of touching Merlin after years of deprivation, declared total secession from his brain and refused to let go of Merlin, who was writhing like a fish and <i>giggling</i>, of all things, and <i>oh god</i> Arthur was getting hard.</p>\n<p>Arthur slackened his grip at once, and Merlin, who'd always been a quick study when he wanted to be, seized his chance and rolled Arthur onto his back, effectively clamping his wrists to the bed. Arthur swallowed thickly. Given that Merlin was lying on top of him, there was no way he wouldn't have noticed Arthur's unfortunate reaction to their inadvisable wrestling match. His insides wrenched with a mixture of want and guilt.</p>\n<p>\"I win,\" Merlin said simply, his voice low and hoarse, which was odd, given that <i>he</i> wasn't the one trying to wrangle his feelings into something a little more manageable than the intense, overwhelming urge to pin his friend to the bed and undress him with his teeth.</p>\n<p>A flash of panic or desperation or something else entirely stole over Merlin's face. He let go of Arthur's wrists and moved, probably to get up and make a break for the opposite end of the castle, when Arthur suddenly became very aware of the fact that he hadn't been the only one to have found their little scuffle inappropriately stimulating.</p>\n<p>\"Merlin,\" he said quietly, nearly a question, and, in a fit of genius or lunacy, raised his hips experimentally to align flush with Merlin's, which caught Merlin in a tight, strangled moan.</p>\n<p>\"I --\" was all Merlin was able to utter before Arthur wrapped his fingers around the back of Merlin's neck and hauled him down for a kiss, or a thousand, if Arthur had anything to say about it.</p>\n<p>Startled at first, it took a few seconds for Merlin to acquiesce -- <i>typical,</i> thought Arthur -- but his mouth opened up to Arthur's soon enough, soft and yielding and sweeter than honeyed wine.</p>\n<p>Arthur had kissed his fair share of people in his lifetime -- often courtiers from whose families his father had wanted goodwill and favours; sometimes fellow knights on long campaigns away from home; that tart who'd tried to drown him in a lake. Those times had mostly been perfunctory, quick means to an end. This, with Merlin, outstripped them all so thoroughly, Arthur wished he could slot out those memories and replace them all with Merlin instead -- the lush curve of his lips; the warm sighs that shimmered over Arthur's skin; the protective curl of his hand on Arthur's cheek.</p>\n<p>Merlin reared upward suddenly, his face screwed in dismay. \"No, I can't -- I can't, I can't do this to you,\" he rasped. \"This isn't you. It's just the potion, isn't it? God, I --\"</p>\n<p>\"<i>Fuck,</i> Merlin, no,\" Arthur said, locking a hand around Merlin's wrist in case he tried to do something stupid, like run away. \"It's not. It's <i>not</i>. It's just -- <i>me</i>.\"</p>\n<p>Doubt flickered in Merlin's eyes, but he didn't seem inclined to flee either, so Arthur pushed.</p>\n<p>\"I want this. I want you,\" Arthur said, desperation creeping like choking vines into his voice. \"For -- since -- I don't know, always.\"</p>\n<p>Though he still didn't look entirely convinced, wide eyes wary and hopeful all at once, Merlin swallowed nervously and admitted in a small voice, \"Me too.\"</p>\n<p>The revelation hit Arthur like a tidal wave, surging almost painfully in his chest, its roiling current dredging up every urge he'd ever crushed, every wanton thought he'd buried for the sake of propriety. <i>Years</i> they had spent secretly wanting each other and not doing a bloody thing about it, and he'd be damned if he wasn't going to rectify that now.</p>\n<p>He dragged Merlin towards him, crushing their lips together, possessive. Merlin was his, had <i>always</i> been his, only he just hadn't known it until now, and he wanted to mark Merlin with his lips and hands and bites and bruises, so that the whole world would know it, too.</p>\n<p>The sweet, drugging kisses from before that had seemed so exquisite and heady couldn't hold a candle to the sheer burn with which they clutched at each other now, all tongues and teeth and relentless urgency that robbed the breath right out of Arthur's lungs, leaving him gasping for air and holding onto Merlin like he was the key to life itself.</p>\n<p>\"I need --\" Arthur grated, and instantly lost the thought as Merlin sucked a series of wet, dirty kisses down the column of his throat and into the hollow of his collarbone.</p>\n<p>Clothing suddenly seemed like the worst invention in all of mankind, and, clumsily, Arthur peeled -- almost ripped -- Merlin's tunic off and over his head, and spread his heated palms over the white expanse of skin, greedily mapping and claiming each plane and contour with his fingers. Merlin returned the favour in kind, only he <i>did</i> cause a large tear in Arthur's nightshirt, but Arthur couldn't be arsed to care, only revelling in the feel of Merlin's skin and warmth and weight pressing into his chest, and the strained curve of Merlin's cock flush alongside his own, at which point Arthur gave no further consideration to keeping clothing intact -- he'd buy Merlin the entire silk trade if he had to -- and tore at the laces on Merlin's trousers until he could ruck them down past the sharp jut of Merlin's hips.</p>\n<p>He slid his hand down Merlin's belly, fingers scraping past the wild thatch of dark hair, until Merlin's cock lay hot and heavy in his hand, working it in short strokes and swiping his thumb across the pearl of moisture at the slit. Merlin swore, rolling his hips and rutting against Arthur's hand, and Arthur felt almost hysterically giddy as he watched a deep flush overspread Merlin's cheeks and neck, knowing he'd put it there. He bit and soothed Merlin's swollen lips in turn, wanting to hear over and over again the low moans that emanated deep from Merlin's chest, feeling the tension ebb and flow in his sinewy frame.</p>\n<p>\"God, <i>Arthur,</i>\" Merlin breathed against his mouth, warm and wet, his hands splayed wide over Arthur's skin like he wanted to hold Arthur's whole being in his palms.</p>\n<p>As Merlin arched wordlessly beneath him, Arthur's free hand skittered across Merlin's ribcage and catalogued every one, wanting to know Merlin inside and out. He rested his palm over Merlin's sternum, pulse echoing to Merlin's heartbeat and racing in double time to the rhythm they were building up, Merlin thrusting into the tight curl of Arthur's jerking grasp.</p>\n<p>\"Faster, Arthur, please,\" Merlin managed between harsh breaths.</p>\n<p>Arthur pulled his hand away, chuckling softly at the glare Merlin levelled at him, quickly replaced by a low, breathy \"oh\" when Arthur licked his palm. He rewrapped his fingers around Merlin's cock, and stripped it, hard and rough. Merlin shouted something incoherent, his hips bucking wildly, knuckles bone-white as he clenched fitfully at the bed linens. Arthur stroked and twisted, sliding his fist up, down and around Merlin's cock, and watched, fascinated, as Merlin tensed and tightened, his gasps stuttered and broken. Merlin went rigid suddenly, before letting out a hoarse, shaky groan, falling completely apart and spilling all over Arthur's hand.</p>\n<p>Glassy-eyed and totally dishevelled, Merlin blinked at the canopy, lips still slightly parted, and then at Arthur, looking as though he wasn't quite sure what had just happened. Then, like the slow, flawless bloom of a flower, a smile spread over his face, and it was possibly the best thing Arthur had ever seen in his life. \"I want --\" Merlin said, but Arthur kissed the rest of the words out of his mouth, leaving nothing but a dazed grin.</p>\n<p>\"Anything,\" said Arthur, not knowing what he was agreeing to and not needing to know.</p>\n<p>Merlin made a short noise, drawing himself away from Arthur's grasp with slight reluctance. He shucked his trousers and made quick work of Arthur's, and though Arthur shivered lightly at the sudden rush of cool air, it did little to abate the heat banked underneath his skin. Merlin slid his fingers along the cambers of Arthur's thighs and the creases at his hips, like he intended to memorise every dip and curve, and when Merlin lowered his head and flicked his tongue over the wet shine on Arthur's belly that his cock had smeared there, a flame unfurled in Arthur's stomach, pitching upwards and fanning out into a string of profanities that swept like a storm across his mind's eye in large capital letters.</p>\n<p>Arthur gritted out a few choice curses as Merlin pressed a kiss to the base of his cock, a marker, and pushed his tongue against that spot, licking a long, hard line up the shaft.</p>\n<p>He tried not to shoot off the bed when Merlin took him into his mouth, and his hands scrabbled mindlessly all over the bed for purchase, finally settling on fisting in Merlin's thick hair. Arthur fought not to squeeze his eyes shut from the near overwhelming sensations coursing through his body, wanting to watch Merlin suck him off, the way his cheeks hollowed, the stutter of his lashes as Arthur's cock grazed the back of his throat, the sheer obscenity of Merlin's pretty mouth wrapped around his length.</p>\n<p>For the frustratingly long time they'd waited to touch each other like this, Arthur wanted to capture and prolong each moment as far as he could, preferably letting them stretch to the ends of forever. He could live this for the rest of his life, warm, falling, contained, with Merlin all around him, solid and real.</p>\n<p>On the other hand, \"Oh, <i>fuck,</i>\" Arthur groaned in four syllables as Merlin did something filthy with his tongue, feeling the taut curl of pleasure all the way down to the tips of his fingers and toes, reverberating at the edges of his skin. Renewed desperation cannoned back into the swell of his chest like an explosion, and distantly, he thought he heard himself swear some more and call out Merlin's name, but he couldn't be sure, over the fog in his ears, like every other part of him had just ceased functioning to direct every shred of focus onto the burn and quiver of his muscles as Merlin swirled his tongue just so, the blinding heat in his stomach raging like a wildfire, the stars sparking and bursting into life behind his eyes while Merlin sucked and hummed and dragged him mercilessly to the edge, and Arthur shattered.</p>\n<p>Arthur came into Merlin's mouth in devastating pulses; Merlin held him fast, and Arthur felt as though he might fall away into the ether if Merlin wasn't here to anchor him to the earth. When there was nothing left but the flutter of his shaky breaths as they juddered past his lips, Merlin released him. Arthur tugged him upwards, the slide of skin over skin delicious and comforting, and held him close, languidly playing the tattoo of his heartbeat over Merlin's side.</p>\n<p>With Merlin lying loose-limbed across him, breaths evening out and shallowing, Arthur closed his eyes and drifted, his heart happy and full.</p>\n<p>*</p>\n<p>Arthur wasn't sure how long he'd slept, but seeing as no one had come searching for him yet to solve some crisis or another, he was fairly certain he'd only been out a short while. Across the room, Merlin, trousers slung low on his hips and a thick tome open in the crook of one arm, and apparently unaware that Arthur had woken, paced up and down the length of the chamber. He scrubbed at the side of his head and muttered to himself, looking wretched.</p>\n<p>\"Merlin,\" said Arthur, blinking the sleep out of his eyes. Whatever Merlin was being antsy about surely could wait; they had better things to do. \"Come back to bed. You can have an episode later.\"</p>\n<p>Merlin snapped his gaze up and frowned minutely. \"I'm not having an episode.\"</p>\n<p>\"So it's your inner tranquillity that's wearing a groove into my floor, is it?\"</p>\n<p>\"I'm having an attack of conscience; it's a separate thing entirely,\" Merlin said, disgruntled, and shut his book. He shook his head, deepening the frown. \"I need to find a way to reverse the effects of this stupid potion. I can't -- You're not really --\" He looked helplessly at Arthur, and then tore his eyes away and mumbled to his feet, \"I just -- I've wanted you so badly, for so long, I couldn't help myself. I'm sorry. I'll fix it.\"</p>\n<p>Arthur sat up, aghast. \"You still think it's the potion that made me --\"</p>\n<p>Merlin shot him a miserable look, fingers twisting fretfully. \"Yeah.\"</p>\n<p>\"I already <i>told</i> you, Merlin, that has nothing to do with it.\"</p>\n<p>\"Well, if you were enchanted, that's what you'd say, wouldn't you?\"</p>\n<p>\"No,\" Arthur said peevishly. He flung the covers off and stood, and caught Merlin staring at his groin and turning red to the roots of his mussed hair when he realised he'd licked his lips, which, at the very least, assured Arthur that Merlin was still naturally attracted to him and not using the potion as a sorry excuse. Arthur dug around for his trousers and yanked them on.</p>\n<p>\"Well, yes, obviously you'd think so, at the moment, but that's only because it's the spell that's --\"</p>\n<p>\"<i>No,</i> Merlin,\" Arthur said again, frustration simmering. What the hell else was he supposed to do to prove himself? \"God, you have got to be the thickest person in the world. If I was enchanted, I'd write you asinine doggerels and throw flowers in your face, like everybody else has been doing. <i>I</i>, on the other hand, only happen to have been stupidly in love with you for ages, which I thought I'd made quite clear earlier, and frankly, Merlin, I'm insulted you think this is just some spell gone wrong when all I've ever wanted is <i>you</i>, you sod. There's no magic involved; it's just me and my horrible feelings that still want to be around you even though you're <i>bloody insufferable</i> when you think you're being noble, so stop it.\"</p>\n<p>Merlin blinked. \"What did you say?\"</p>\n<p>Arthur nearly tore his hair out. As though laying his heart bare wasn't bad enough, Merlin hadn't even had the courtesy to <i>listen</i>. \"Is this some kind of mad plan to make me want to hurl myself out of the window? Because, I must say, it's working <i>brilliantly</i>.\"</p>\n<p>\"What? No. No, it's just that everyone else has been extra nice to me ever since all of this started.\"</p>\n<p>Perhaps this was a dream. A very, very annoying dream. \"Yes, Merlin,\" Arthur hissed, exasperated beyond belief. \"That's because they've all been magically forced to fall in love with you. We established this <i>days</i> ago. Has it somehow slipped your mind in the past ten seconds? I know your cognitive skills can be somewhat lacking, but this is embarrassing, even for you.\"</p>\n<p>\"But you're not being any nicer than usual, not even after,\" said Merlin mostly to himself, determined, apparently, to work this out on his own very slow terms. His head tilted thoughtfully. \"You're calling me names.\"</p>\n<p>Arthur looked bewilderedly at him, wondering just in what incomprehensibly jumbled direction Merlin's thought process had scampered off. \"Well, you deserved it. And I've always called you names.\"</p>\n<p>Merlin thought on this for a moment, and then his lips widened into a grin. \"I know.\"</p>\n<p>\"Look, did you hit your head or something when you got out of bed?\" Arthur asked cautiously, trying to peer underneath all that thick fringe for bruised lumps. \"You're making less sense than usual. In fact, you're not making any sense at all.\"</p>\n<p>\"No, I am,\" Merlin said, beaming with something like awe. \"I think you might actually, truly love me.\"</p>\n<p>Arthur just barely managed to squash down the urge to vigorously shake Merlin by the shoulders. \"For god's sake, Merlin, that's what I've been saying all this time!\"</p>\n<p>\"Yeah. Yeah, you have,\" he said, his smile confidently standing its ground in the face of Arthur's outburst.</p>\n<p>\"There is something seriously wrong with you,\" Arthur declared.</p>\n<p>Merlin's eyes softened, and he stretched out a palm to stroke Arthur's cheek, the touch so fond that Arthur leaned into it instantly, feeling the sharp edges of his irritation melt away. \"No, I'm just in love with you, too, Arthur.\"</p>\n<p>\"Oh. Well, then. Good.\" He shifted uncertainly, unused to open reciprocation, and, as was his cultivated habit, frowned in retaliation to the burst of warmth in his chest. \"And you believe me now because... I insulted you?\"</p>\n<p>\"Yeah,\" Merlin laughed and ducked his head. \"Everyone else has been ridiculously affectionate, and you've been your normal self this whole time, but then in <i>bed</i>, well, that was a bit too good to be true, you know, and I thought maybe you'd just somehow managed to stave off the effects of the magic longer than everyone else until then. But you're still you, aren't you?\"</p>\n<p>\"Just me,\" Arthur said, and Merlin kissed him.</p>\n<p>*</p>\n<p>In between facing down Camelot's everyday, run-of-the-mill crises (murderous mystical beast one day; enraged mother of slain murderous beast two days after that; Arthur misplacing his favourite ring), Merlin continued to research possible antidotes to his potion -- a difficult task, considering no authors had been foresightful enough to record for posterity what specifically to do in the event of dumping a horse-related love potion that shouldn't have been made for horses in the first place on oneself, which Merlin thought was very unhelpful of them, and tutted disappointedly at his books.</p>\n<p>Soppy poetry, flora and other assorted lovesick flotsam and jetsam persisted in claiming squatters' rights outside his rooms, which, aside from being a giant fire hazard, caused Merlin fairly little grief, as he and Arthur had moved half his things into Arthur's chambers anyway, seeing as their new sleeping arrangements had taken on something of a permanent quality now.</p>\n<p>Arthur would have been over the moon, really, except for the times he caught Merlin looking at him speculatively, and knew there was still a little, niggling doubt in Merlin's mind whether their relationship was actually rooted in reality.</p>\n<p>Trying to deal with that was an exercise in pure frustration. Arthur had no idea what to do, and he hated that he couldn't find a solution to it. He could only reassure Merlin so many times before Merlin would squint at him suspiciously and ask if he was feeling all right, and although yelling had been instrumental in tipping the scales in Arthur's favour previously, shouting at Merlin all the time just for the sake of doing it was more than a little silly. All Arthur could do was <i>wait</i>, and of the many things he was marvellously good at, being patient ranked well far down the list.</p>\n<p>To cheer himself up, Arthur imagined all sorts of unsavoury fates he might deal out to the people who still chased Merlin up and down the castle, like stuffing them into crenels.</p>\n<p>Two weeks wore on in much the same manner, the long row of balistrarias in Arthur's head beginning to get quite full up, until breakfast arrived a little late one morning, and Arthur noticed that something was markedly different. Specifically, flowers, or rather, the lack thereof.</p>\n<p>The maidservant who brought their meals had made a daily habit, aided immeasurably by the potion, of presenting breakfast to Merlin with a large side helping of proclamations of undying love and trusses of wildflowers, heedless of Arthur's presence (and, as time had gone on, his stern glares, and then his pointedly chucking the flowers in the chamberpot). This morning, however, she only entered with a bowed head, cheeks flaming red, and set their trays down on the table, twitching anxiously and assiduously looking at anything except Merlin, until Arthur dismissed her, and she fled from the room like a pack of rabid dogs was at her heels.</p>\n<p>\"Well. That was -- odd,\" said Merlin, staring after her.</p>\n<p>Arthur sat up straighter. \"No flowers,\" he said meaningfully.</p>\n<p>\"How will you spruce up your chamberpot now?\" Merlin rejoined absently, and then caught on to Arthur's tone. \"Oh. <i>Oh</i>.\"</p>\n<p>\"Come on, we'll eat these on the way,\" said Arthur, springing up from his chair and nabbing two pieces of fruit from their breakfast trays. \"We have tests to conduct.\"</p>\n<p>\"Tests?\"</p>\n<p>Arthur tossed him an apple. \"Well, I thought you might go and stand outside for a while, and we'll see if anyone's still inclined to throw themselves at you, then we'll know for sure.\"</p>\n<p>Merlin crooked an amused eyebrow at him. \"You always were a dedicated man of science, weren't you, Arthur?\"</p>\n<p>*</p>\n<p>They passed through the corridors and down the stairs unmolested. Servants who crossed their paths bowed and greeted Arthur but seemed to either ignore Merlin completely or turn very interesting shades of purple at the sight of him. The squire who had tried to romance Merlin with song totally forgot himself and ran in the other direction when he saw them coming, which Arthur thought was rather rude, but ultimately heartening.</p>\n<p>After a little bit of mulling over what would be the most advantageous location to dangle the bait (\"Stop calling me that,\" said Merlin), Arthur finally decided on having Merlin sit down at the well in the middle of the courtyard, where foot-traffic tended towards heavy, and he'd be in plain view of pretty much everyone in the castle. Considering that for the past few weeks Merlin had tried to hole himself up in Arthur's room whenever he could help it so as to avoid unwanted advances, anyone still unnaturally pining after him would probably be beside themselves with joy to find him alone out in the open and propose marriage immediately.</p>\n<p>\"What if somebody launches himself at me in a fit of passion and we both go down the well?\" Merlin asked, as they stood unnoticed in the shadow of one arched entrance of the castle and watched the easy criss-cross of people streaming through the courtyard with the day's work ahead.</p>\n<p>\"Then it would give us definitive proof that the masses still find you a bit too alluring, wouldn't it?\" Arthur said reassuringly, and patted Merlin's shoulder, which did not appear to have the mollifying effect intended. \"Go on, then.\"</p>\n<p>He gave Merlin a gentle push, opting to stay behind at the doorway to act nonchalant and pretend he wasn't paying attention to anything so his presence wouldn't scare off Merlin's admirers, if there were any left -- and he sincerely hoped that the potion's effects had worn off completely and for good, because not only was he thoroughly sick of the whole mess and the occasional, quiet uncertainty Merlin thought he was hiding well, Arthur was also running out of creative amercements to mentally inflict upon those who insisted on forcing their company on his -- <i>Camelot's</i> -- no, <i>his</i> Merlin.</p>\n<p><i>Ha!</i>, a voice in his head shouted triumphantly, and shook its imaginary fist at the rapidly eroding layer of denial still clinging by its fingernails to Arthur's heart. After years of viciously trampling his feelings into oblivion, being able to love freely was taking quite a bit of getting used to and meant breaking a lot of old habits, but Arthur thought it was rather worth it.</p>\n<p>Merlin pulled at his elbow. \"Arthur, wait.\"</p>\n<p>\"No one's going to topple you into the well, Merlin.\"</p>\n<p>\"No, I know. I just wanted to do this first,\" he said, and curled his fingers around the front of Arthur's tunic, drawing him in for a kiss.</p>\n<p>There was a fierce edge of desperation to it, like a permanent goodbye -- <i>idiot</i>, Arthur thought, understanding at once -- and Arthur let himself be pulled into Merlin's tight embrace, fingers weaving shallow furrows in his hair.</p>\n<p>\"Don't think I don't know what you're doing,\" Arthur said softly against Merlin's cheek, making soothing circle patterns at the small of his back. \"If you even so much as hint that I'm going to change my mind about you just because the spell's gone, I will push you down the well myself.\"</p>\n<p>\"I wasn't -- <i>Fine,</i>\" Merlin conceded grudgingly. \"It always comes down to violence with you, doesn't it?\"</p>\n<p>*</p>\n<p>Merlin stood guard at the well for the better part of the morning, munching idly on his apple first, waving agreeably at passersby who became stricken with embarrassment rather than lust when he caught their attention, and then amusing himself with little magic tricks to while the time away. He eventually built up a small audience of excitable young pages, but they were really only interested in him making things disappear and reappear behind their ears, while everybody else seemed to either make wide berths around him or greet him while resolutely pretending that sappy, sweet nothings hadn't passed their lips days before. It was only when the rat-catcher scowled bitterly at him from one end of the courtyard, however, that Merlin returned to Arthur's side, convinced.</p>\n<p>\"It's over,\" he said, the slide of his nose a little pink from being in the sun too long.</p>\n<p>Arthur nodded. \"Good. <i>Finally.</i>\"</p>\n<p>\"And, erm, how are <i>you</i> feel-- <i>Ow,</i>,\" said Merlin, rubbing the sore spot on his arm where Arthur had thumped him. \"I was only trying to make polite conversation.\"</p>\n<p>Arthur made a huffy, scoffing noise. \"You know how I feel. It hasn't changed in the past few hours, just like it hasn't changed for years, so there's absolutely no reason to doubt me, <i>is there, Merlin?</i>\" he said, and waited for Merlin to shake his head like a good pupil. \"And if you ask me again --\"</p>\n<p>\"I know, down the well,\" Merlin sighed, the weary tone in his voice belied by the way the corners of his mouth hitched upwards.</p>\n<p>\"Come on,\" Arthur said, with an affectionate roll of his eyes, and beckoned Merlin to follow him back up to his chambers.</p>\n<p>They said little on the way back, mostly because Arthur didn't want to disgrace himself publicly with the overabundance of joy that kept building upon itself and threatening to burst out of him in a horrifying giggle each time he tried to speak. He imagined Merlin was feeling something similar; every time Arthur stole a glance at Merlin he looked as though he was fighting to suppress a manic grin. After years of dancing around each other, of doubt and guilt and secrets, of doggedly and fruitlessly labouring against the constant swell of their feelings, they had finally, <i>finally</i> got it right, and the force of it felt staggering.</p>\n<p>Once they reached the room and shut the door behind them, Arthur swung and pinned Merlin against the wall, bracketing him between his arms. He grinned widely. \"Do you know what this means?\"</p>\n<p>Merlin blinked at him, slightly confused. \"What?\"</p>\n<p>Arthur moved in closer, their faces just a hair's breadth apart, and closed a palm over Merlin's cheek. \"This means I'm going to kiss the ever living hell out of you, and you're going to like it, Merlin, because I fucking <i>love</i> you, you absolute clot.\"</p>\n<p>\"Oh. Okay,\" Merlin breathed, and wrapped his arms around Arthur, an incandescent smile brimming at his lips and spilling light and happiness everywhere. \"I can live with that.\"</p>\n<p>*</p>\n<p>\n<i>King Arthur -- <strike>totally deranged</strike> <strike>severely mental; death by raging alcoholism</strike> <strike>completely fucking insane</strike> <strike>the saddest and most pathetic man who ever lived</strike> lived happily ever after.</i>\n</p>"
}