{
  "id": "7515700",
  "url": "https://archiveofourown.org/works/7515700?view_full_work=true",
  "author": [
    "MereLoup"
  ],
  "title": "Stiles Stilinski, Boyfriend Extraordinaire",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale",
    "Laura Hale",
    "Talia Hale",
    "Danny Māhealani",
    "Jordan Parrish"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Alternate Universe - Human",
    "Meet-Cute",
    "Meet-Awkward",
    "Professor Derek Hale",
    "Fluff and Crack",
    "Crack Treated Seriously",
    "Derek Hale is nearly perfect",
    "Stiles Stilinski is a kickass fake boyfriend",
    "Fluff",
    "Romantic Comedy",
    "Danny is completely over it",
    "Derek has terrible luck with fires",
    "alternate Derek Hale backstory",
    "Stiles Wears Glasses",
    "Derek Wears Glasses",
    "Derek walks with a cane",
    "Yikes I am so bad at tagging",
    "Disabled Character",
    "Stiles is way too 'go with the flow'",
    "Fake/Pretend Relationship",
    "With a twist!"
  ],
  "language": "English",
  "series": "",
  "published": "2016-07-18",
  "completed": "2016-07-18",
  "words": "14,429",
  "chapters": "4/4",
  "comments": "934",
  "kudos": "22,349",
  "bookmarks": "5,427",
  "hits": "200,597",
  "summary": "<p><br><br><br>“Beacon County Sheriff's Department, this is deputy Mahealani speaking.” </p>\n<p>“Oh thank god!”</p>\n<p>“Stiles?” </p>\n<p>“I, uh, I need some advice.” </p>\n<p>“Advice?” </p>\n<p>“Yeah. So, hypothetically, say you met your boyfriend’s mother and sister for the first time ever. Completely by accident. In the grocery store. And they convinced you to help them make a dinner to surprise aforementioned boyfriend when he got home after work. What would you do?” </p>\n<p>Danny paused, and then, “Stiles, you don’t have a boyfriend.”</p>\n<p>“That’s not the point! And I said hypothetically.” </p>\n<p> “Stiles...what are you doing right now?”</p>\n<p> </p>\n<p>***</p>\n<p>Stiles never imagined he’d be in Derek’s kitchen cooking a surprise dinner with Derek’s family while they waited for Derek to get home from work. </p>\n<p>Partly because their visit was a complete surprise. </p>\n<p>But mostly because Stiles didn’t have a boyfriend. </p>\n<p>Or even know who Derek was. </p>\n<p>But he’d already come this far and Papa didn’t raise no quitter!<br><br><br></p>",
  "notes": "<p>[Update 2 June 2017] I would like to take a second to send a heartfelt thank you to the wonderful <b>Halisa</b>, who so generously offered to translate this story into Russian! :D Thank you for taking the time and effort to translate my wacky little story so that it could be shared with Russian speakers. I am very, very grateful for your efforts! &lt;3 <a href=\"https://archiveofourown.org/works/11074170/chapters/24698688\" rel=\"nofollow\"> Перевод на русский</a></p>\n<p>[Update 2 August 2017] I want to take another second to say thank you to <b>HClO</b> who offered to translate this story into Chinese! I can't even begin to describe how thankful I am to you for all the work you're putting in to help this story reach a larger audience base. You are truly wonderful and I am so, so grateful!!! </p>\n<p>[Update: 17 August 2018] I am so very pleased to announce that <b>PruePhantomhive</b> is translating this story into Spanish! Your hard work is much appreciated and I am extremely thankful for your efforts!! It's people like you who are to thank for spreading works around the world for people to enjoy. Muchas gracias for helping this story reach Spanish speaking Stereks! </p>\n<p>My life has been a roller coaster for the past several months! For those of you who don't follow me on tumblr (http://darkandstormynight.tumblr.com/) , due to work craziness, I had very little time to work on writing, but things have calmed down in a major way, and I am able to get back to the keyboard!</p>\n<p>So here is my attempt at a meet-cute/rom-com. I've never actually written anything that wasn't a smutty kink fest, it was an interesting experience, haha. It's pretty out-there, and I don't know if it makes any sense, but....*shrugs* yolo?</p>\n<p>I have no beta, all mistakes are my own.</p>\n<p>I'm not completely sure how I feel about it, but I decided to post it anyway.<br>Enjoy!! :D</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>(2 Aug 2017) I am absolutely <b>floored</b> by the amount of love and attention this story has gotten. I am so humbled by how much you guys love it, and it means the absolute world to me. Thank you to everyone who has commented, kudosed and read my story. You mean more to me than you'll ever know! :D<br><br><br>Feel free to hang out with me on tumblr!!! http://darkandstormynight.tumblr.com/<br><br><br>None of these pictures are mine, but I thought I'd share them because Dylan and Tyler are too good to be true.<br><img src=\"https://s-media-cache-ak0.pinimg.com/564x/17/60/a3/1760a30d48a204a77674836df29803fe.jpg\"><br><img src=\"https://s-media-cache-ak0.pinimg.com/originals/51/78/3c/51783ca96db2c7b44b4b621a5df261f8.jpg\"><br><img src=\"https://s-media-cache-ak0.pinimg.com/564x/e8/f5/34/e8f534561d96996cf89f8ad8c1df57c4.jpg\"><br><img src=\"https://s-media-cache-ak0.pinimg.com/564x/ba/31/82/ba31824b1b065486178d462cff90cc8c.jpg\"><br><img src=\"https://s-media-cache-ak0.pinimg.com/originals/a5/5f/f9/a55ff9e4eeba36ebffef5a6cb0590bd6.gif\"><br><img src=\"https://s-media-cache-ak0.pinimg.com/564x/58/26/38/5826381d5011390add2f32e89e9cda1e.jpg\"><br></p>",
  "text": "<p>*<br>\n*<br>\n*</p>\n<p>It was just after 4 in the afternoon and Stiles had <i>finally</i> left work for the day. </p>\n<p>Tomorrow was his first day off in almost a week and a half due to covering shifts for a flu ridden Greenberg. Stiles had been looking forward to spending the next two days lying on the couch and finally catching up on the shows on his DVR and squeezing in several much needed naps. </p>\n<p>He had big plans. </p>\n<p>On his way, home he had stopped by the grocery store to stock up for Greatest Day Off In The History of Days Off, and was pulled out of his deliberation between Cheetos or Doritos, when he thought he heard someone shout his name from across the store. </p>\n<p>He looked up casually and glanced around, but didn’t see anybody he recognized. </p>\n<p><i>Oooookay</i>. He had just turned back to the shelf when he heard it again, but closer this time. </p>\n<p> “STILES!” </p>\n<p>His head snapped up again and he turned around again scanning the aisle more intently. He still didn’t see anyone he recognized. However, he did see a woman approaching him purposefully with a giant smile and a determined, mischievous glint in her eyes. </p>\n<p>She locked eyes and waved at him, and he had a split second to think <i>Who the hell is that?</i> before the woman pulled him into a firm embrace, hugging him fiercely. </p>\n<p>“It <i>is</i> you! I didn’t think it was for sure, you had your glasses on this time, but I still couldn’t believe it!” She rambled excitedly, hugging him firmer. She pulled back and looked at him, emphatic grin on her face. </p>\n<p>Um.</p>\n<p> “We had a connecting flight at SFO, but then it ended up getting canceled because of mechanical problems, so we thought we’d swing by and surprise you guys!” </p>\n<p>Okay….what? <i> Did I miss something here?</i></p>\n<p>“Uh,” Stiles chuckled nervously. “Well…consider me surprised.” His voice sounded strange, even to his own ears. He didn’t think he’d met her before, but she sure as hell seemed to know <i>him</i>. </p>\n<p>Before he had time to ask where exactly it was that he knew her from, another woman rounded the corner of the aisle. When her eyes landed onto the first woman, who was still touching Stiles, she was momentarily confused. But then when her eyes landed on Stiles, Stiles could see the recognition settle onto her face and her face broke out into a smile as well. </p>\n<p> “Oh my- Laura, you can’t just pounce on him.” She laughed, approaching the two. “He’s going to think we’re insane!” </p>\n<p>Well, she’s not wrong. </p>\n<p>She had long, dark hair which was elegantly swept back. She walked up to Stiles and extended her hand with a warm, friendly smile. </p>\n<p>“You must be Stiles.” She had a strong resemblance to the first woman, but looked older. <i>Mother and daughter, maybe? </i> Stiles shuffled his shopping basket into his left hand and he took her extended hand, shaking it firmly. </p>\n<p>“The one and only.” he chuckled awkwardly.</p>\n<p>Since working for the Beacon County Sheriff's Department, Stiles was used to getting waved at by people he didn’t recognize, especially while in uniform. His dad had been the sheriff in Beacon Hills for nearly 30 years and a well-known face in the community. Stiles had made his own mark on the community earlier in the year when he made his debut in the local paper for his involvement in closing a huge case. </p>\n<p>He got his face in the paper and everything. </p>\n<p>It’s not like Stiles was a local celebrity or anything, but. Yeah. He tended to get noticed from time to time. But not anything like <i>this</i>. </p>\n<p>“I’m Talia Hale. Derek’s mother.” She grinned happily. </p>\n<p>That didn’t help.</p>\n<p>“Oh?” He nodded in what he hoped was an earnest and pleasant and not at all confused manner. </p>\n<p>Talia Hale. Derek. Derek Hale? Not ringing a bell. </p>\n<p>She stood back and wound her arm around the other girl. “This is Laura.” Laura smiled proudly while Stiles just waved limply. </p>\n<p>It was obvious that these people knew who he was, but it wasn’t until a few seconds of awkward silence had settled over the group that Stiles noticed their expectant smiles that he realized that <i>he </i> was supposed to know who they were as well. </p>\n<p>“Of course!” <i>Oh my god oh my god oh my god.</i> “It’s great to see you guys!” He smiled largely, hoping it was convincing enough.</p>\n<p>“Talia and Laura.” He repeated, shaking his head as if the realization had finally dawned on him. “Laura and Talia.” His hand flailed awkwardly. “The Hales!”</p>\n<p>He could feel the pinpricks of sweat developing on the back of his neck. </p>\n<p>He wracked his brain, trying to scan through all the faces of people that he knew from growing up or interacted with though work, hoping that he’d remember who the hell these people were before things got even more weird. </p>\n<p>Beacon Hills High School had a lot of substitute teachers all the time; <i>did she ever teach one of my classes? </i></p>\n<p>“So your flight got cancelled, huh? Man, what a bummer.” He cringed internally at how lame that sounded.</p>\n<p>“Yeah” Laura chimed in, rolling her eyes. “Our plane was having a lot of technical issues and got grounded indefinitely. They weren’t able to get anything out to New York until early tomorrow morning. So,” She spread her arms dramatically, “Here we are!”</p>\n<p>“Indeed you are. Here.” Stiles chuckled weakly, “You two. Laura and Talia.” <i>Stop. Talking. Stiles!</i> “This is just so…I can hardly believe it. What a surprise!” Stiles offered weakly. </p>\n<p>\n<i> A neighbor maybe? No, someone who worked in town? Family of an old lacrosse teammate? Shit, shit,<b> shit!</b></i>\n</p>\n<p>Oblivious to Stiles’ inner turmoil, Talia stood there with a pleasant smile on her face watching Laura and Stiles chat. Laura didn’t seem to mind that Stiles was a little lacking— okay, a lot lacking— on the conversational end, and she continued right on through.</p>\n<p>“Sorry that we’re so intense right now” She laughed. “It’s just that, like, Derek is <i>so</i> private all the time we never thought we’d get to meet you!” She grinned, biting her lip excitedly. “He’s <i>never</i> introduced us to one of his boyfriends before!”</p>\n<p>And…okay. Wait. </p>\n<p>\n<i>Boyfriend?</i>\n</p>\n<p>At that, Stiles’ brain came to a grinding halt. </p>\n<p>“What?” He swallowed hard. </p>\n<p>It seemed hot all of the sudden. Was it hot in here? It was definitely hot in here.</p>\n<p>Laura rolled her eyes and smirked deviously. “Yeah, he says that he doesn’t want us to scare them off.” Laura furrowed her brows, made her face look grumpier and crossed her arms over her chest, in an assumingly ‘Derek-like’ fashion.</p>\n<p> “Well…” Stiles chuckled uneasily. “You know Derek!” he said a little too loudly. He swallowed again and pulled at his collar. “Always so secretive.” </p>\n<p>Stiles would definitely have remembered if he had picked up a boyfriend recently. He hadn’t been in a relationship in <i>years</i>.</p>\n<p>Hell, he hadn’t even gotten any action in months. Except for this one time that he and Danny went to The Jungle and Stiles hooked up with a random guy. But making out with someone in a back alley at 3 a.m. after too many Sea Breezes next to a dumpster and a cooling puddle of someone else’s vomit, before going home to jerk off is not exactly how romantic entanglements begin. </p>\n<p>Not usually.</p>\n<p>But that was beside the point. </p>\n<p>Stiles knew for <i>sure</i> that he was boyfriendless at the moment. </p>\n<p>Talia, who had been weirdly silent since she first introduced herself, seemed to be studying Stiles. Her eyes scanned his face, looking for something and suddenly Stiles felt very self-conscious. Stiles wasn’t sure if this was an ‘I’m making sure this guy is good enough for my son’ look, or an ‘I <i>know</i> this guy is not good enough to date my son’. </p>\n<p>\n<i> I knew I should have changed before I left work. </i>\n</p>\n<p>Talia tilted her head to the side and smiled. <i>Oh god, what if she doesn’t approve of me? What if she thinks I’m not good enough for Derek? </i> Whoever the hell he is. </p>\n<p>Finally she spoke.</p>\n<p>“Laura, don’t overload the man,” Her voice was playful and she winked at Stiles. </p>\n<p>Laura sighed and looked back at her mother, “I’m not overloading!” She looked back over at Stiles, her expression sheepish and a faint blush on her cheeks, “Am I?” </p>\n<p>“No! You’re not!” he rushed to say. He put on his most assuring smile. “You’re not overloading at all. It’s great to finally meet you guys.” He said in played-up excitement, looking at the two of them. “If I knew you were coming I would have planned something.” </p>\n<p>\n<i>Understatement of the year.</i>\n</p>\n<p>“Well...” Laura’s eyes twinkled mischievously. “We were going to make dinner at Derek’s to surprise him.” She looked back at her mom and grinned before looking back at Stiles. “You can help!”</p>\n<p>Stiles felt the heat creep up to his face and he felt like he was going to drop his basket in the middle of the aisle. </p>\n<p>“Oh no—” He sputtered helplessly. “I don’t-” </p>\n<p>“C’mon! It’ll be fun!” Laura insisted, grinning and not giving Stiles a chance to wiggle his way out of it. </p>\n<p>Behind her, Talia laughed at the interaction between the two of them. “He’ll never see it coming,” she grinned.</p>\n<p>“No, he wouldn’t see it coming at all.” Stiles could feel his heart beating faster and his breath picking up. <i>Please don’t have a panic attack right now!</i> “Sure that sounds great!” He conceded finally. </p>\n<p>This was getting out of hand. Stiles needed to have a serious conversation with his brain to mouth filter.</p>\n<p>“Let me grab something I know he’d like to eat, and I’ll, uh, I’ll meet you at the front?”</p>\n<p>“Sounds good, Stiles!” Talia said gathering Laura. “We’ll see you in a bit.”</p>\n<p>Stiles smiled and waited to watch them walk down the aisle and around the corner. </p>\n<p>When they were finally out of sight, he spun around dramatically, nearly taking out a row of shelved quinoa with the corner of his shopping basket. </p>\n<p>“Oh my god!” he whisper-shouted, running a flustered hand through his already messy hair.<br>\n“What the hell!”</p>\n<p>He didn’t know what to do. </p>\n<p>He could either go back and tell Laura and Talia that he wasn’t who they thought he was. But that would look really weird, seeing as how he made so much of an effort to recognize them. </p>\n<p>And there’s no way they had recognized the wrong person, they knew his name and everything. Who else looks like this <i>and</i> goes by Stiles? They obviously didn’t mistake Stiles for someone else. No, they were convinced he was a friend of Derek’s. </p>\n<p>A boyfriend of Derek’s. </p>\n<p>Derek’s Boyfriend. </p>\n<p>If he told them that he wasn’t Derek’s Boyfriend, he doesn’t know what kind of damage that would do to Derek?</p>\n<p>Why would someone he doesn’t know even pretend that he was his boyfriend? How did Derek know Stiles was gay? How did Derek even know who Stiles was? </p>\n<p>\n<i>And who the hell is Derek anyway?!</i>\n</p>\n<p>Maybe Derek had never dated anyone before and his family was worried that he wouldn’t find anyone, so he made up an imaginary boyfriend to ease his suffering, and now by it being revealed to his family he would have to live with the embarrassment of his family knowing how pathetic he was that he’d fake a relationship and have to suffer relentless teasing, or worse, pity, and have to abandon his family forever leaving him to wander the country in shame and ridicule. </p>\n<p>Or. Maybe Derek was a secret agent who worked with some shadowy government-esque organization, like SHIELD and this whole thing was a part of a sting operation and Stiles was being followed. Maybe Laura and Talia were sent to bring Stiles into the home office and brief him because they needed his law enforcement prowess and his top of his class at the academy evasive driving skills to solve a crime of international mystery and intrigue. </p>\n<p>Or. Maybe they were agents, but they were actually Hydra. And the thing they were surveilling was Stiles. What if he was some sort of target and they had just marked him to be taken out by snipers!!! </p>\n<p>“Oh my god.” He whisper-shouted out loud. “I’m being followed by Hydra.” </p>\n<p>Stiles looked over his shoulders checking to make sure he didn’t see any suspicious patrons who could double as assassins. </p>\n<p><i>Jesus Christ, Stiles, <b>seriously?</b> Get ahold of yourself. </i> Stiles took a deep breath and let it out slowly. </p>\n<p>“You’re not being followed by Hydra,” he told himself. “You’re hungry, tired and reacting badly to a <i>very</i> strange situation. Get it together.”</p>\n<p>He was in desperate need of that day off tomorrow. Surely he could pull it together for a few more hours until this all blows over. Besides, what’s the worst that could happen? If this all fell apart over dinner, he could just kindly excuse himself and leave Derek to handle the fallout.</p>\n<p>“Okay,” he said aloud to the boxed organic grains that sat on the shelves. “I can handle this. I am deputy with the Beacon County Sheriff's Department. I can handle high pressure situations and I’m good at thinking on my feet. I can do this!”</p>\n<p>The grains didn’t look convinced.</p>\n<p>Stiles turned and scurried to the end of the aisle. Ducking down behind the endcap of canned asparagus spears, he peered around to make sure the Hales were far enough away that they were out of earshot. </p>\n<p>Laura was standing at the magazine rack, aimlessly flipping through a magazine and Talia was sitting on a bench, her brows furrowed, reading something on her phone. They were distracted enough for Stiles to put together some sort of plan. </p>\n<p>Stiles pulled back around the aisle and reached his hand into his uniform pocket, digging around for his phone. He pulled it out and frantically dialed the station. </p>\n<p>His foot tapped a fast-paced rhythm while he waited for someone to pick up. “C’mon, c’mon…” he muttered. </p>\n<p>Finally, someone picked up on the other end. </p>\n<p>“Beacon County Sheriff's Department, this is Deputy Mahealani speaking.” </p>\n<p>Stiles voice came out with a whoosh of air. “Oh thank god!”</p>\n<p>“Stiles?” </p>\n<p>“I need your help!” he squawked. </p>\n<p>“Are you alright?” Danny’s voice was simultaneously amused and not amused. He was really<br>\ngood at that. Like, scary good.</p>\n<p>Stiles peered around the aisle again, to make sure Laura and Talia were sufficiently distracted. “I’m in trouble.” He moved back into the aisle. </p>\n<p>“Do you need backup?” All warmth immediately slipped out of his tone, and he was suddenly stern and all business. “Where are you?”</p>\n<p>“No!” He said urgently. </p>\n<p>The last thing he needed was a fleet of BCSD cars rushing up to the grocery store, sirens blazing, and calling further attention to the fact that Stiles has a tendency to get himself into wildly ridiculous situations. </p>\n<p>He ran a hand through his hair again,“I mean... Kind of? I, uh, I need some advice.” </p>\n<p>“Advice?” And now Danny’s voice was back to just <i>Not Amused</i>. </p>\n<p>“Yeah.” Stiles took a deep breath. “So,<i> hypothetically</i>, say you met your boyfriend’s mother and sister for the first time ever. Completely by accident. In the grocery store. And they convinced you to help them make a dinner to surprise aforementioned boyfriend when he got home after work. What would you do?” Stiles thought if he spoke fast enough, Danny wouldn’t notice the weirdness of the question. </p>\n<p>Danny was silent for a moment and then replied, “Okay, well, if <i>I</i> just met my boyfriend’s family for the first time and they wanted me to help them with a surprise dinner, then I would say yes. It would probably be a good opportunity to get to know them and let them know what a great boyfriend you are.”</p>\n<p>Stiles nodded. </p>\n<p>“But, Stiles,” Danny paused, and then, “You don’t <i>have</i> a boyfriend.”</p>\n<p>“That’s not the<i> point</i>.” He said flustered. “And I said ‘hypothetically.’” </p>\n<p>He could practically hear Danny rolling his eyes. “Stiles, what are you <i>doing</i>?” </p>\n<p>Okay, so Stiles was going to go through with this. </p>\n<p>This was not how he planned on spending his evening. But he couldn’t let Derek down, because of reasons. </p>\n<p>If Derek needed him, he was there. </p>\n<p>\n<i>(Whoever the hell Derek Hale even is.)</i>\n</p>\n<p>“Alright. Thanks man.” He said into the phone.</p>\n<p>“Sure… uh, anything else I can help you with?” This is why Danny was Stiles’ favorite.</p>\n<p>“Yeah, actually. Can you, uh, can you not bring this call up to my dad?”</p>\n<p>Instead of answering, Danny just started laughing. (Stiles would have taken offence to that, however this was far from the first time he’d gotten himself tangled up in some sort of strange situation and asked someone to keep it away from the sheriff.)</p>\n<p>He didn’t know what kind of situation this Derek was in, but his family seemed like perfectly lovely people and Stiles did not want to let them down. </p>\n<p>He wanted to be the best damn boyfriend he could be and <i>show</i> them that Derek was in good hands. </p>\n<p>Derek deserved it. </p>\n<p>Maybe. </p>\n<p>\n<i>Oh hell.</i>\n</p>\n<p> </p>\n<p>*<br>\n*<br>\n*</p>\n<p>*<br>\n*<br>\n*</p>\n<p>\n<b>First order of business: Dinner. </b>\n</p>\n<p>Stiles wasn’t much of a cook, but he did have a few recipes up his sleeve for when he needed to impress someone. </p>\n<p>Most of his culinary expertise fell under one of two categories: Healthy Shit Dad Should Be Eating and Food That Is So Delicious It Results In Guaranteed Bedroom Activity. </p>\n<p>And for this occasion, Stiles needed to bring out the big guns, so #FTISDIRIGBA it was! </p>\n<p>Stiles left the aisle and set his shipping basket in one of the nearby holders, grabbing a nearby empty shopping cart instead. As he scrolled through his mental rolodex for delicious dinners, he roamed the aisles plucking things off here and there. </p>\n<p>He wasn’t sure exactly what to make, but he knew if he had a few core ingredients he could make something impressive enough to serve once Derek got home from work. </p>\n<p>\n<i>Shit, I don’t even know how long I have before Derek gets home!</i>\n</p>\n<p>Okay, so something doesn’t take too long to make, but is still equally delicious and impressive.</p>\n<p>According to Stiles’ watch, it was just after 4:17. Assuming Derek worked a 9-5 job, that gave him about an hour or so before dinner needed to be finished. Plus, he’s sure it wouldn’t be too big of a deal to have dinner still in the finishing stages when Derek arrived. It would give him a change to catch up with Laura and Talia, since they hadn’t gotten a chance to see one another in a long time.</p>\n<p>Oh my god. </p>\n<p>He was <i>too </i>invested in this. </p>\n<p>Stiles decided on skillet chicken with a creamy cilantro lime sauce. He’d made it before and had earned lots of positive feedback from his date. He could make pasta and a small side salad as well. That was simple enough to be made quickly, but also beautiful enough to garner applause. </p>\n<p>Stiles was an awesome boyfriend.</p>\n<p>He zipped around the aisles grabbing the herbs, broths, veggies, pasta and the chicken. For half a second he wondered if he should run home to grab a pot to cook everything in. </p>\n<p>Surely Derek had cookware.</p>\n<p>\n<i>Right? Probably. I mean….??</i>\n</p>\n<p> He’d take his chances. </p>\n<p>Stiles grabbed a bottle of wine and a few candles and made his way through the checkout. </p>\n<p>He spotted Laura and Talia and waved at them while he stood in line. He pointed down to his cart and mouthed, “Almost ready!” grinning excitedly. </p>\n<p>Laura looked at the items in the cart and gave an enthusiastic thumbs up while she mouthed, “Looks good!”</p>\n<p>Stiles’ gave a pleased grin and winked at them, while simultaneously finger gunning. (<i> Seriously, dude? You fingergunned at your potential future in-laws?</i>) </p>\n<p>He paid for the items and made his way to the front of the store. Talia put her phone back in her purse and got to her feet.</p>\n<p>“Well, I’ve got everything I need here.” He fished his keys out of his uniform pocket. “Did you guys take a cab here or did you rent a car?” He looked out of the giant window, but didn’t see a cab idling.</p>\n<p>“We rented a car.” Talia said, pulling out the rental keys from her pocket and holding them up. The three of them exited the store and headed into the parking lot. </p>\n<p>“It’s a good thing we ran in to you, actually,” Talia laughed. “We’ll have to follow you to Derek’s house since we don’t know how to get there.” </p>\n<p>Stiles felt his stomach drop into his toes.</p>\n<p>\n<i>Fuck.</i>\n</p>\n<p>“Oh!” <i>Shit.</i> “No problem!” <i>Huge problem</i>. “Let me load this in the car and I’ll pull around to where you’re parked.” He forced a smile, praying to all magical things that he was believable. </p>\n<p>Talia and Laura made their way to their own car, which happened to be on the other side of the lot from where Stiles was parked. He ducked down and began running, his shopping cart clattering loudly as he made his way to his cruiser. </p>\n<p>Shit. Shit. <b>Shit!</b> <i>Okay, get it together Stilinski. </i></p>\n<p>He made quick work of loading the groceries into the back before ditching the cart and jumping back inside behind the driver’s seat of the car. </p>\n<p>Stiles pulled out his phone and hit redial. He put the keys in the ignition, but didn’t turn on the ignition. </p>\n<p>“Beacon County Sheriff's Department, Deputy Mahealani speaking.”</p>\n<p>“It’s me. Again. I need you. Again.” Stiles buckled himself into the car a little too forcefully, pinching his hip in the buckle. “I need you to look up some information for me.” </p>\n<p>Danny sighed. “Alright, give me a second.” Stiles heard the sounds of the keys clicking as Danny logged into his computer. </p>\n<p>“Okay, what information?”</p>\n<p>Stiles set his phone on speaker and set it in the cradle mounted onto the dashboard. Safety first!</p>\n<p>“It’s a name. Hale, Derek. Male. Lives somewhere in Beacon Hills.” </p>\n<p>He turned on the ignition and backed out of his parking space. He drove to the other side of the lot, cruising the aisle slowly.</p>\n<p>Danny was silent for a few seconds while he typed. “I think I’ve got him,” Stiles could hear an intake of breath. “<i>Woah.</i>”</p>\n<p>“Have you got the file pulled up?” </p>\n<p>He spotted Talia and Laura’s car and pulled up behind it waving to them, and Talia waved back from the driver’s seat. He pulled the cruiser forward a bit so they could back out and begin to follow him.</p>\n<p>“Yeah.” Danny said. Stiles could hear what sounded like astonishment in his voice.</p>\n<p>“Oh god. He’s a murderer, isn’t he?” He knew it! This was going to end badly. He was going to find a body at this guy’s house, wasn’t he.</p>\n<p>“Yes, Stiles.” Danny snarked. “He’s a convicted murderer. But due to prison overcrowding, your Dad and the district attorney just agreed to slap a tracking bracelet on him and check in from time to time.” </p>\n<p>Scratch that. Danny was no longer his favorite. </p>\n<p>“Well you don’t have to be an asshole about it!” Stiles snipped. </p>\n<p>He exited the parking lot and turned onto the main street, glancing in the rearview mirror from time to time to make sure the rental car was still behind him. </p>\n<p>“What information did you want?” Danny was back to sounding just bored.</p>\n<p>“First, address. I need to know where the hell I’m going.” He muttered.</p>\n<p>“Huh?”</p>\n<p>“Nevermind, just-” Stiles was trying his best to not let the tension get the best of him. “What’s Derek Hale’s address?”</p>\n<p>“4813 Meadowlark. Need the zip?” </p>\n<p>Thank God! </p>\n<p>“No I’m good”</p>\n<p> Derek’s house was close by. Stiles knew where that was. Generally speaking. </p>\n<p>Last spring he had chased down a suspect who had taken to the streets after abandoning his vehicle mid-high speed chase. Stiles chased the man on foot through the backyards of the quiet neighborhood, jumped over nearly eight fences, ran through two sandboxes and one kid’s wading pool, and ended up tackling the assailant in a someone’s backyard. </p>\n<p>He was the talk of the station for a few days – until something else around town happened to de-throne him. But, for a few days, he was practically John McClane. It was a small moment of glory, but <i> that suspect</i> had been the last pieced needed for Stiles to close the case that got him in the paper. </p>\n<p>“What else did you need?” </p>\n<p>Right. </p>\n<p>Danny.</p>\n<p>Seeing as how he was having dinner with the family of a man he didn’t know, it would be a good idea to get more information on him so that he could better bullshit his way through a conversation. Right?</p>\n<p>“Age, occupation, any information you think is vital.” </p>\n<p>Danny didn’t answer immediately. Stiles could feel the judgement from the other side of the phone. </p>\n<p>“And you’re <i>sure</i> you don’t need backup? Remember what your dad said about you charging in without thinking plans through.”</p>\n<p>“Danny!” Stiles didn’t have the time for this right now. </p>\n<p>“Alright! Just making sure.” Danny was silent while he presumably read over his screen. “Okay, I don’t see anything criminal on his adult record. He was picked up once when he was a minor for vandalism, but that's it for his official record.”</p>\n<p>Well that wouldn’t help Stiles out very much. </p>\n<p>“And on the unofficial record?” He hedged. </p>\n<p>Stiles glanced up in the rearview mirror again. Laura and Talia were singing along to something in their own car.</p>\n<p>Danny sighed heavily. “Stiles...”</p>\n<p>“Please! Danny, please. I’ll make it up to you I swear. I’ll buy you coffee every morning for two weeks. The good stuff. From that place across town you like!” This was a serious situation. This was Defcon 5 and Stiles was <i>not </i>above begging. </p>\n<p>He was getting closer to Derek’s house, and turned off of the main road onto the smaller residential streets. </p>\n<p>He didn’t hear any movement on Danny’s end. </p>\n<p>“Fine!” Stiles said, flustered. “<i>Three </i>weeks. Just, can you—” he flailed vaguely.</p>\n<p>Danny sighed— and Stiles didn’t appreciate the <i>tone</i> of his sigh— and then Stiles heard the furiously quick-tapping of keys and Danny grumbling under his breath. </p>\n<p>Danny spoke quietly, trying to not draw attention to himself and his less-than-legal activities. </p>\n<p>“Derek Alexander Hale. Current age 34, born August 8th. He attended Beacon Hills High School, did his undergrad at NYU, bachelors in History. Moved back to Cali. Masters and doctorate at Berkeley… currently teaches at Cal State Beacon Hills.”</p>\n<p>Stiles snorted. “Ambitious.”</p>\n<p>Derek Hale had a doctorate. Stiles was dating a doctor.</p>\n<p> <i>Babcia will be so proud!</i></p>\n<p>“Appears he was a volunteer firefighter up until last May,” Danny continued on. “He got injured trying to save someone during a fire at an orphanage.”</p>\n<p>“Seriously?!” </p>\n<p>“The floor collapsed while he was inside.”</p>\n<p>Wow.</p>\n<p>Spending too much time around Derek Hale could make a lesser man feel bad about himself. Good thing Stiles didn’t consider himself a lesser man. </p>\n<p>But seriously.</p>\n<p>\n<i>Who even is Derek Hale!?</i>\n</p>\n<p>“…Participated in charity marathons, volunteers at the Good Samaritan homeless shelter every Thanksgiving and Christmas.”</p>\n<p> As Danny rattled on and on he sounded more and more like he was swooning. Which, <i>not </i>cool. Derek was spoken for. Kind of.</p>\n<p>“And during summers, he volunteers at the Beacon Valley animal shelter.” </p>\n<p>Oh my god. <i>My boyfriend is a literal saint. How did I <i>ever</i> get so lucky to land a guy like this?</i></p>\n<p>“What?” Danny asked suddenly. </p>\n<p>Stiles realized that he had said that last part out loud.</p>\n<p>“Nothing,” He said quickly.</p>\n<p>He turned the car onto Derek’s street and checked his rear view mirror. As expected, the Hales were right behind him. </p>\n<p>“Hey Danny, I’ve got to go. Thanks for everything.”</p>\n<p>“Stiles…” Danny paused, “I don’t know what you’re doing, but…be careful?”</p>\n<p>He doubted that if anything happened it would be because Derek did anything to him. The guy sounded more likely to be the one to save the day if shit went down. </p>\n<p>“Will do. Oh and, Danny?” </p>\n<p>Danny let out a put upon sigh. “Don’t tell your father, I know.”</p>\n<p>“You’re the best.” Stiles grinned. </p>\n<p>“Three weeks, Stiles. Starting<i> tomorrow</i>!” Danny hung up and Stiles pulled up to the house, parking in the driveway.</p>\n<p>Derek Hale lived in a moderately sized craftsman home in a quiet, picaresque neighborhood. </p>\n<p>His yard was well-kept, trimmed to perfection, and he had beautiful flowerbeds near the front of the house. The house was friendly and inviting, and pretty much everything that Stiles would have expected after hearing what Danny had told him. </p>\n<p>He even had an actual white picket fence. </p>\n<p>Stiles opened the door to the cruiser and stepped out of the car. </p>\n<p> “And the evening begins.” He said, pumping himself up. </p>\n<p>Operation: Stiles Stilinski, Boyfriend Extraordinaire was officially in full effect. </p>\n<p> </p>\n<p>In order to let Laura and Talia inside, Stiles needed to find a way into the house. And since Stiles didn’t have a key, that really only left one option: breaking and entering. </p>\n<p>“Okay, Stilinski. Phase One: Break in to Derek Hale’s house.” </p>\n<p>Which he could hardly do if Talia and Laura were standing there watching. </p>\n<p>\n<i>Back door, maybe?</i>\n</p>\n<p>He scanned the perimeter, making sure there weren’t any neighbors about that could provide a statement saying the saw a police deputy hopping the fence into their neighbor’s yard. The street was completely empty. The coast was clear. </p>\n<p>Talia and Laura stepped out of their car and made their way up the flower lined pathway to Derek’s porch. Stiles made a vague gesture over his shoulder toward the gate which led to the backyard. </p>\n<p>“I’m just gonna pop in around back, and I’ll come through the house to let you in.” Stiles said. </p>\n<p>Laura looked at Stiles, and then the house and then back at Stiles. “Why the back?” </p>\n<p>“I, uh- I just got off from work, so I only have my work keys on me. Derek’s keys are back at my place.” </p>\n<p>She nodded, accepting this answer. </p>\n<p>“Okay, well, I’ll just be right back!” he said awkwardly. </p>\n<p>He turned away before they could say anything else and sped walked down the driveway until he reached the fence. Looking back to make sure the two women were out of sight, he hopped the fence into the back yard. His foot got caught as he was turning around, and he sort of tumbled down the other side of fence onto the grass of Derek’s backyard. </p>\n<p>“Please don’t have a dog.” he muttered under his breath. </p>\n<p>From his crouched position he made a few kissy noises trying to attract the attention of any canine that might be in the backyard. </p>\n<p>There was no snarling from an animal, so he assumed at least the coast was clear. He looked around at his surroundings, and that is when he got a much better look at the yard.</p>\n<p>If Stiles thought Derek’s front yard looked nice, the back yard looked <i>even more</i> beautiful. It was like something out of House &amp; Garden magazine!</p>\n<p>There was lush greenery everywhere giving off a serene atmosphere.</p>\n<p>Delicate flowers in lavenders, pinks, and blues, were in beds and planters all around the yard and there was an archway wrapped in ivy that sectioned off a small fenced off vegetable garden. </p>\n<p>A brick pathway led throughout the garden and up to a pergola covered porch that had wooden deck chairs (that Stiles was pretty sure were handmade, and probably by Derek. ) and he even had a birdbath. </p>\n<p>A birdbath! </p>\n<p>\n<i>Who even is Derek Hale?!</i>\n</p>\n<p>He crept along the elegant brick pathway that wound through Derek’s yard and up toward the wooden deck. </p>\n<p>The back door looked nice enough and not too difficult to get into. Using the lock picking kit that he kept in his work utility belt, he slid the metal sticks into the lock and jiggled them around. It had only been a minute or so of fumbling (and swearing under his breath) before he was able to get the door open. </p>\n<p>\n<b>Phase Two: Enter Derek’s house and pretend like you’ve been there before. </b>\n</p>\n<p>“No big deal, just breaking into a stranger’s home.” Stiles muttered to himself, twisting the knob. He pushed the door open and slipped inside, shutting the door quietly behind him. </p>\n<p>The backyard opened up into what looked like a family room. There was a television mounted on the wall and a large L shaped couch that looked comfy enough to get lost in, and along the wall there were tons of framed photos, artfully hung. </p>\n<p>Stiles scanned them quickly, picking out Laura and Talia from what must have been a family reunion. </p>\n<p>The pictures on the wall that weren’t of family were all beautiful landscape shots from spots Stiles recognized around town.</p>\n<p>There were shots from lush green hiking trails, dusty desert scenery at sunset, sunrises over the Pacific Ocean and dense fog rolling in over a mountainous landscape. They didn’t look like professional photographs, but they looked damn close. </p>\n<p><i>Great so my boyfriend is apparently a talented nature photographer as well. This resume just keeps making me look like more and more of an uncultured ass.</i> </p>\n<p>Before he left the wall, another photo caught Stiles’ attention. It wasn’t the beautiful wilds of California. It was of two hairy arms— Stiles assumed they belonged to Derek— that held the cutest, furriest little kittens that Stiles had ever seen. The shirt that Arms was wearing read 'Beacon Valley Animal Shelter' and the two kittens were each wearing a bow around their neck that said “Just Adopted!”</p>\n<p>They were rescue kittens. </p>\n<p>Because of course they were.</p>\n<p>He turned away from the Wall Of Make Stiles Feel Like A Failure, and power walked through the rest of the house, getting a feel for the layout.</p>\n<p>He found the master bedroom – taking time to note how comfortable and luxurious the bed looked—a simple guest bedroom, an office, and the bathrooms. The last thing he wanted to do was come all this way only to be thwarted by accidentally sending Laura into a linen closet if she asked where the bathroom was. </p>\n<p>It had only been about two minutes since he’d been inside, but he thought if he kept them waiting it would look suspicious.</p>\n<p>He hurried back to the front of the house, but nearly tripped over a cat that had walked out from Derek’s room. Stiles recognized it as one of the cats from the photo in Derek’s family room. </p>\n<p>Instead of moving out of the way, the cat looked up at Stiles as if he were the one in the way, and then it sat down gingerly, its tail curling around itself. It looked up at Stiles, evaluating him intently, and then meowed loudly.</p>\n<p>“Hey, man. How’s it going?” He greeted. Stiles bent over and held his fingers out for the cat to sniff. When he had passed smell inspection, he reached his hand down to look at the tag hanging down from the collar. <i>Erica. </i></p>\n<p>“Hey, Erica. My name is Stiles. I’m your Daddy’s boyfriend.” </p>\n<p>Erica meowed at him, unimpressed. </p>\n<p>“Food. Maybe? Is that what you want?” Stiles asked scratching the fur behind her ears. “I’m sorry, I’m new to this. I’m more of a dog person.”</p>\n<p>Erica meowed again. </p>\n<p>“It’s not that I <i>don’t</i> like cats. I just have a better track record with dogs.” Erica meowed again, looking bored. Can cats look bored?</p>\n<p>“I’m not, like, prejudiced toward cats though. I’m sure if we got to hang out more I’d grow on you.” He rambled.</p>\n<p>Stiles reached down to pick her up, but Erica hissed at him. She swiped at his hand (without claws, thankfully) and Stiles put his hands up in surrender. </p>\n<p> “Alright, so you aren’t a Stilinski fan. No worries.” </p>\n<p> Stiles stepped backward, moving backward slowly so as not to appear threatening, and accidentally bumped into the bookshelf against the wall. He felt something run through his hair, and he whipped around, looking upward. Sitting up on the top of the bookshelf was a sandy, blond-ish cat a little bell on it's collar and <i>Isaac</i> engraved on the tag, with his paw dangling down, toes flexing like he was itching to take another shot at Stiles' hair.</p>\n<p>\n<i>Sheesh. Tough crowd.</i>\n</p>\n<p>Stiles moved away from the shelf and went into the kitchen in search of cat food. He found it in the fourth cupboard he opened, and he scooped some out into a ceramic bowl that had little fish bones painted on the inside. </p>\n<p>“I’m assuming this is yours?” He held the bowl out toward her. </p>\n<p>He hadn’t even set it on the ground yet before Erica was meowing and winding between his feet trying to get to the bowl. Stiles managed to step away without tripping and injuring himself --or stepping on Erica-- and he jogged to the front door to let Talia and Laura inside. </p>\n<p> </p>\n<p>He rushed back to the front door, only slightly out of breath, and opened it up. Laura and Talia were talking to one another in the porch. They broke into grins when they saw Stiles at the door. </p>\n<p>“Hey! I bet you thought I forgot about you, huh?” he chuckled awkwardly.</p>\n<p>“Not at all.” Laura laughed. </p>\n<p>Stiles moved to the side of the door to let the two women inside of the house. He hoped they didn’t notice how out of breath he was from scurrying around. </p>\n<p>“I didn’t mean to take so long, I had to feed Erica.” </p>\n<p>“That’s alright.” Talia shrugged out of her jacket. “We were just admiring the flower beds out front of the house!”</p>\n<p>“Yeah,” Stiles chucked, taking her coat to hang up…somewhere. He’d find a coat closet later. </p>\n<p>“That’s Derek for you. Man with the green thumb. If you think those are nice, you should see what he’s done with the back yard.”</p>\n<p>Stiles lay Talia’s coat over the back a chair that was situated near the door, and moved into the entry hallway to lead them further into the house.</p>\n<p>“Well let me show you ladies around really quick, give you a quick tour of the house.”</p>\n<p>Stiles led them through the house, offering them a brief, and probably insufficiently detailed tour of the house that he had only just become comfortable with moments before. He ended the tour in front of the small guest room off of the main hallway. </p>\n<p>“And here’s your room.” He opened the door, smiling nervously. </p>\n<p>It was getting pretty close to five and he needed to get dinner started before Derek got home. And, you know, still figure out how he was going to fake a relationship this entire evening. </p>\n<p>Talia’s tilted her head in confusion and looked at Stiles. “Oh. We were going to get a hotel room for the night.”</p>\n<p>“What? No way!” Stiles balked, throwing up his hands. “You guys are never in town, Derek will be thrilled to have you guys stay with him!” </p>\n<p>Laura and Talia looked at one another in disbelief, skepticism creasing their brows. After a moment, Laura smirked and shrugged as she looked back at Stiles. </p>\n<p>“If you’re sure…” Talia trailed off uneasily, but her eyes looked delighted at the idea. “We wouldn’t want to intrude.” </p>\n<p>“If I know Derek at all, then I know he’d love you two to stay with him.” Stiles said emphatically. </p>\n<p>\n<i>Oh god.</i>\n</p>\n<p>\n<i>What if he isn’t on good terms with his family? </i>\n</p>\n<p>Of course he is! He’s the kind of guy that sacrifices his well-being to save orphans from a blazing building and nurses wounded animals back to health at the shelter. Of course he loves his family and wants them to stay with him! </p>\n<p>Talia smiled again. “Alright. I guess we should get our things out of the rental car then.”</p>\n<p>Stiles ran his hands though his hair again. “Great, and uh, I’ll get the groceries from my car and start working on dinner.” </p>\n<p> </p>\n<p>While Laura and Talia gathered their bags from the trunk and headed back into the house, Stiles slumped against the side of the cruiser and reflected on all of the stupid decisions he had made in the last hour. </p>\n<p>“Dude, what the <i>fuck</i> are you doing?” He hissed at himself, running his hands down his face, knocking his glasses to the side. Stiles took them off, and cleaned them with the edge of his shirt. </p>\n<p>He put his glasses back on his face and pushed off of the car to open the trunk. He collected the bags and closed the trunk only to look up at see that Derek’s neighbor had just pulled into his own driveway and was looking at Stiles curiously. </p>\n<p>The guy’s eyes squinted in confusion as he looked back towards Derek’s house and back at Stiles. </p>\n<p>“Uh….hi!” Stiles smiled. “I’m Derek’s boyfriend!” He offered. The guy just stared back at him, not answering. </p>\n<p>“Family’s in town. You know how it is.” Stiles chuckled uneasily. </p>\n<p>The man furrowed his brow, throwing Stiles a suspicious look, but then continued on into his house.</p>\n<p>Stiles turned around and made his way back into the house. “Geez, what crawled up his ass.”</p>\n<p>He plopped the bags on the counter of Derek’s kitchen and took a deep breath, letting it out harshly. </p>\n<p>\n<b>Phase Three: Woo the Hypothetical-Potential-Future-In-Laws with exquisite culinary prowess and magical conversation skills.</b>\n</p>\n<p>“You made it this far, Stilinski. Now it’s time to get your head in the game and bring it home.”</p>\n<p>*<br>\n*<br>\n*</p>\n<p>*<br>\n*<br>\n*</p>\n<p> </p>\n<p>Stiles dashed around the kitchen, frantically looking in each of the cupboards for all the appliances and dishes he’d need. In a drawer he found a folded apron that had the cartoonish body of a woman in a bikini and put it on. </p>\n<p>While rooting around in the fridge, Stiles found a pitcher of homemade lemonade—because of course—and poured some for Laura and Talia. </p>\n<p>He showed them outside to the beautiful back deck and told them he was going to get started on dinner. He fiddled around with Derek’s sound system in the living room, turning on some relaxing music to play throughout the house, and left them to relax while he made dinner. </p>\n<p>With them outside it would give him a little more space to freak out in peace. </p>\n<p>Although Laura and Talia couldn’t see into the kitchen through the back windows, Stiles was paranoid about looking like he wasn’t familiar with Derek’s kitchen. </p>\n<p>They would think something was off if he was less than comfortable in Derek’s kitchen. </p>\n<p>….right? </p>\n<p>Surely he and Derek were at the We’re Always At Each Other’s Houses level. Of course they were! That’s the quickest way to make it to I Have My Own Key status. </p>\n<p>Wait! How long have he and Derek been together? </p>\n<p><i>Oh god! </i> Backstory!</p>\n<p>They needed a backstory. </p>\n<p>Stiles thought about possible scenarios while he prepared the chicken. </p>\n<p>“Let’s see, former student who seduced his teacher?” </p>\n<p>He couldn’t do the student thing, he was too old to be a student at CSBH. Besides, Derek wouldn’t break the rules like that. </p>\n<p><i>Pulled him over for speeding? </i> Derek wouldn’t speed. </p>\n<p><i>Volunteering? </i> That could work, but Stiles hasn’t volunteered since 8th grade, so he wouldn’t be able to bullshit about any experiences. </p>\n<p>Derek doesn’t deserve a boyfriend who doesn’t volunteer. </p>\n<p>“Oh my god, he’s going to leave me.” he muttered frantically. </p>\n<p>Stiles needed to up his game. </p>\n<p>Stiles slid the pan of asparagus into the oven and checked on the pasta before he slid his phone out of his pocket and ducked behind the island in the kitchen, squatting down to hide himself in case Laura or Talia came back inside.</p>\n<p>He hit redial once again. </p>\n<p>“Deputy Mahealani.” </p>\n<p>“What time does Derek Hale’s last class end?” he asked all in one breath. </p>\n<p>“Stiles! Are you trying to get me fired?” He whisper-shouted. Danny had never whisper-shouted at Stiles before. </p>\n<p>“I’m on a stakeout?” He tried pathetically.</p>\n<p>“I thought you said you weren’t working.” Danny wasn’t having it.</p>\n<p>“I <i>never</i> said I wasn’t working”</p>\n<p>“You left work.” He grumbled, clearly annoyed.</p>\n<p>“Stake outs don’t happen inside of the station, Danny. Even the rookies know that.” </p>\n<p>“Then what was all that talk about cooking dinner?” There was a note of smugness in his voice. “With your boyfriend’s family. Huh?”</p>\n<p>“That was <i>hypothetical</i>.” Stiles grumbled.</p>\n<p>Danny sighed heavily and Stiles could hear the disappointment. After a few seconds, he heard Danny’s furiously fast typing. </p>\n<p>“Last class ends at 5:20” He deadpanned.</p>\n<p>“Office hours?” Stiles squinted as he asked.</p>\n<p>“Not today.”</p>\n<p>“Meetings?”</p>\n<p>“None on the agenda.”</p>\n<p>“Thanks. Oh, and Danny, if you could, don’t tell my-” Danny hung up before Stiles could finish. </p>\n<p>“Well someone’s getting their bribery coffee downgraded to only two weeks.” He sassed.</p>\n<p>Stiles peered up over the counter to glance out at the two Hale women on the back porch. </p>\n<p>Talia and Laura were outside enjoying their lemonade, admiring Derek’s beautiful garden, and having a conversation while cooing over Erica who was curled up on Laura’s lap. <i>Traitor</i>.</p>\n<p>He hunched back down behind the counter and dialed another number as quickly as he could. </p>\n<p>“This is Parrish.” </p>\n<p>“Hey Jordan! I need a quick favor.” All this favor asking was going to get Stiles a reputation at the station. Well, <i>another</i> one.</p>\n<p>“What’s up, man?” Parrish asked. Stiles could hear the sounds of the patrol car cruising around. </p>\n<p>“Are you anywhere near Cal State Beacon Hills?”</p>\n<p>“Not at the moment. Do you need me to be?”</p>\n<p>God bless Parrish.</p>\n<p>“Well, yes and no. If you happen to find yourself in that area around 5:30-5:45 and see a black Camaro leaving the faculty lot, will you give me a call?”</p>\n<p>“Yeah, sure! Plate number?” Stiles recited the license plate number Danny had given him earlier. “You got it!”</p>\n<p>Okay. With Parrish giving Stiles a heads up when Derek was leaving, that gave him a feeling of a little more control over this situation. </p>\n<p>Stiles stood up from behind the island, only to find Talia standing in the doorway watching him. Stiles startled, nearly dropping his phone on the tile floor. </p>\n<p>She was standing there with her empty glass looking at Stiles curiously. “Everything alright?” </p>\n<p>“Yeah, I was just calling a coworker of Derek’s to have him text me when Derek’s on his way home.” Later, Stiles would have to have a talk with himself about why it was so easy for him to lie all the time. This was getting a bit concerning. “That way we have a heads up. You know, for the surprise.”</p>\n<p>“Oh, good idea!” She smiled. She looked back down at the island. “Why were you on the floor?”</p>\n<p>“Oh! I was….” Stiles ducked back down to the island and opened the cupboards pulling out the first thing he saw. He popped back up holding the item up. “Just looking for this” he said, out of breath. </p>\n<p>“An electric juicer?” Talia seemed confused. </p>\n<p>Stiles looked at his hand. It was indeed the juicer.</p>\n<p> <i>That explains Derek’s lemonade.</i></p>\n<p>Stiles just shrugged. “You never know.” </p>\n<p>She smiled, confused. “Oh, okay. Well anyway, it’s a good idea to have your friend help us out.” </p>\n<p>Stiles set the juicer on the counter and went to the refrigerator. “Can I get you more lemonade?”</p>\n<p>“Thank you.” He filled her glass. “You’re very considerate.”</p>\n<p>“Well I’ve got to make a good impression, haven’t I?” He grinned winningly, winking at her. </p>\n<p>She chuckled, batting his shoulder with her few hand. “You’re sweet.”</p>\n<p>Talia moved further into the kitchen and glanced that the giant bowl of salad that Stiles was preparing. Stiles opened the fridge door to set the pitcher of lemonade back inside, so his back was to her when she asked, “Aren’t you familiar with his schedule by now?” </p>\n<p>Stiles froze, his eyes widening comically.</p>\n<p> <i>She’s onto me.</i></p>\n<p>She seemed too curious. Granted, she was appropriately curious. But curious was not what Stiles needed right now. </p>\n<p>“Well, you know how Der is. Always going the extra mile.” He shrugged. Turning back around to smile at her. </p>\n<p><i>Der? </i>Was Derek a ‘Der’? </p>\n<p>Or did he have some other nickname like <i>Patron Saint Of Good Deeds </i>or <i> I Save Children And Animals From Perilous Situations When I’m Not Molding The Minds Of The Nation’s Youth</i>. Or maybe Rick.</p>\n<p> “You never know if he’s going to stay late to accommodate a student who couldn’t make office hours. Or something.”</p>\n<p>Talia nodded and Stiles took a sigh of relief. On the inside. </p>\n<p>“So what’s on the menu tonight?” She set her glass down and looked at the chicken in the skillet. “Do you need help with anything? We’d be glad to help out somehow.”</p>\n<p>“I’ve got skillet chicken with a creamy cilantro lime sauce, zucchini pasta with avocado pesto, and Mandarin orange spinach salad with teriyaki dressing.” He rattled off all the dishes, aiming for casual, but secretly hoping he was blowing her away. “And right now,” he said nodding toward the oven, “I’ve got some prosciutto wrapped asparagus cooking for an appetizer.”</p>\n<p>“Wow, Stiles! That sounds delicious! I’m impressed.” </p>\n<p>Mission accomplished. </p>\n<p>“Oh, you know…it’s nothing.” Stiles blushed.</p>\n<p>“Derek never told us what a good cook you were.” She was smiling warmly and lovingly the way that only a mother can, and for a split second Stiles felt a twinge in his gut and he missed his own mother so fiercely he thought he might be sick. </p>\n<p>“Well, to be fair, I don’t whip out the big guns too often. But for an occasion like this you’ve got to go all out!” He swallowed thickly.</p>\n<p>Talia laughed, “I like you.” </p>\n<p>Stiles wilted on the inside.</p>\n<p> <i> I’m starting to like you too</i>. </p>\n<p>He needed a change of subject.</p>\n<p>“So tell me about Derek,” he said turning back to the stove to stir the chicken. “When he was younger, I mean. No one spills the beans on all the embarrassing stories from the olden days quite like family.”</p>\n<p>“No I suppose they don’t.” Talia chuckled. She picked up her glass of lemonade, and moved around the other side of the counter to sit on one of the bar stools. </p>\n<p>While the food cooked, Talia told Stiles about who Derek was when he was younger. </p>\n<p>“Derek was always my sensitive child.” She had a soft smile on her face as she talked about her son. “Very empathetic and cared so much about the people around him.”</p>\n<p>“He was always on the quieter side and a little shy, but he was a good boy and did very well at school.”</p>\n<p>Stiles hummed under his breath. </p>\n<p>Talia’s brow furrowed for a moment, “In high school he had a bit of trouble. I guess he was having a bit of a hard time socially, and he fell into a tough crowd.” She fidged a bit and looked back up at Stiles “- well, I’m sure he told you about Jennifer.”</p>\n<p>Stiles nodded. </p>\n<p><i> Note to self: Jennifer Story. Find details later</i>.</p>\n<p>“Well, after the fire, we moved away New York for a bit of a fresh start. No one blamed Derek, of course, but he took it so personal, and he punished himself for several years.”</p>\n<p>For some reason, it was the word ‘fire’ that triggered something and Stiles’ mind flashed back to vandalism that Danny had mentioned earlier. </p>\n<p>Derek <b>Hale</b>. </p>\n<p><i>The fire at the Beacon Valley Wolf Sanctuary.</i> </p>\n<p>Beacon Hills was a pretty low key town. They didn’t have anywhere near the amount of crime that larger cities had, so when something big happened, everyone in the town knew about it. </p>\n<p>When Stiles was younger, after his mom had passed, he didn’t like being at the house alone. So, after school, he would hang out at the station while he was working.</p>\n<p>One night when he was in 7th grade, he was doing working on his math homework at his dad’s desk while he was out on patrol when he heard the dispatcher on the scanner send him to a possible B&amp;E at the edge of town. </p>\n<p>Hours had passed and Stiles’ dad hadn’t come back yet, so Mrs. McCall eventually picked him up from the station and he spent the night at Scott’s. The next day when his dad was taking him to school, he told Stiles what had happened the night before. </p>\n<p>Outside of Beacon Hills was the Beacon Valley Wolf Sanctuary, which was run by a researcher and animal rights activist Peter Hale. Wolves were rather rare in Beacon Hills and had been so for decades, but the general population in that region of northern California was suffering due to poachers and off season hunting. </p>\n<p>Several wolves that had been saved by activist groups had been brought to Beacon Valley Wolf Sanctuary to be taken care of. The sanctuary covered the entirety of the preserve, nearly 450 acres, and had received a lot of statewide recognition for the good work it was doing to help preserve the population. </p>\n<p>One night, a group of high school kids snuck into the sanctuary. Several of them had been smoking and drinking, and just generally making a mess out in the woods near the main road. One of the cigarette butts that hadn’t been put out properly caught fire on some brush, and the flames began to spread the outer edge of the property. </p>\n<p>Noticing the fire, the teens left the scene, jumping into their vehicles and speeding away. </p>\n<p>All except for one.</p>\n<p>Derek Hale. </p>\n<p>It was he who had called 911 and told them what was happening. </p>\n<p>Derek had managed to corral the wolves into the safety of the brick research facility on the property to keep them safe until the Fire Department showed up, and thankfully there were no casualties. When first responders arrived, they found a teary-eyed, visibly shaken Derek Hale using one of the garden hoses trying to put out as much of the fire as he could, to no avail. </p>\n<p>While everyone made it out alive, wolves included, there was severe damage to a huge portion of the property. </p>\n<p>Peter had arrived at the scene, wild eyed and furious with Derek. Screaming that he could have lost everything he had spent his life working for, and demanded that he be arrested.</p>\n<p>Stiles’ dad was the one who brought Derek to the station, and he waited with him until his parents had arrived. </p>\n<p>When questioned by officers, Derek had admitted that he hadn’t really wanted to go to the sanctuary that night, but his girlfriend had talked him into it. She was a part of a group of other kids from school that called themselves The Alphas, who included Ennis, Kali, Duke, and Ethan. </p>\n<p>Because the sanctuary was run by someone in the family, Peter didn’t press arson charges against Derek, but the city couldn’t ignore the larger potential damage that could have been caused to the surrounding area. </p>\n<p>Forest fires were not uncommon in that part of northern California, and if the fire had spread to Cielo National Park, whose border began at the very edge of the Beacon Valley Wolf Sanctuary, the case would have been out of the county’s hands and would have been a federal matter.</p>\n<p>Since Derek had stayed behind to accept responsibility and had actively worked to make sure all the wolves were safe and did his best to try to prevent the spreading of the fire, the city only charged with him vandalism. He received a small fine and had to complete some community service hours, but for the most part, he wasn’t blamed for the events of that night. </p>\n<p>The other students, who had abandoned the scene and already had a rather extensive record with the BHPD, several of whom had been arrested and previously charged with rather violent offenses, were sentenced more harshly and were sent to juvie. </p>\n<p>Several weeks after the incident the town had largely moved on, and nobody really brought up Derek Hale again. </p>\n<p> </p>\n<p>“Anyway, he had always been so closed off since the fire. He was much more reserved after that.” Talia looked up at Stiles and her tone changed to something much more positive. </p>\n<p>“Then about four months ago, just after his accident with the fire department, we noticed that he seemed happier.” She smiled in confusion, thinking of the memory. “Which was strange, given the situation, but about him was more and more positive, but we didn’t know why.”</p>\n<p>She looked at Stiles and grinned happily, “Then about two months ago, he spilled the beans.” Talia held his gaze, grinning knowingly. </p>\n<p>Stiles’ brow furrowed in confusion before—</p>\n<p>Oh. </p>\n<p><i>Oh!</i> </p>\n<p>Stiles was The Beans. </p>\n<p>Okay, so Derek and I met possibly around four months ago. Timeline established!</p>\n<p>The back door opened and Laura stepped into the family room. “Hello?”</p>\n<p>“In the kitchen!” Talia called out, leaning over in her seat to look at her daughter.</p>\n<p>Stiles turned back around to the stove and finished up with the cooking, thinking about the conversation he had just had with Talia. </p>\n<p>Was it weird that he was kind of starting to fall for this guy even though he didn’t even know him?</p>\n<p> </p>\n<p>Laura joined Talia at the counter, and the three of them chatted happily while Stiles darted around the kitchen preparing dinner. </p>\n<p>Eventually, Stiles’ phone started buzzing in his pocket and he quickly wiped his hands on a towel before reaching in to grab it. </p>\n<p>It was a text message from Parrish. </p>\n<p>\n<b>Blk Cam just left CSBH. Follow?</b>\n</p>\n<p>Stiles typed out a quick reply: <i> No, you don’t need to follow him. Thanks, man.</i></p>\n<p>\n<b>Anytime!</b>\n</p>\n<p>“Was that Derek’s colleague?” Talia asked.</p>\n<p>Stiles set him phone back on the counter. “Yes! He just left. So it should be about ten or fifteen minutes before Derek is here.” </p>\n<p>The two women stood up from the counter.</p>\n<p>“We’ll finish getting the table set!” Laura headed over to the dining table. </p>\n<p>Knowing there was a timeline kicked all of them into gear and placed a certain urgency over the house. But while Talia and Laura were excited to see Derek, Stiles found that he was getting increasingly and increasingly more nervous. </p>\n<p>Stiles rushed to the oven to take out the asparagus, burning his hand on the edge of one of the pans, and started to plate all of the food that he had made, making sure it looked as beautiful as it could. Laura and Talia set the linens and flatware and lit the candles that Stiles’ had bought. </p>\n<p>“Wine!” He said loudly looking over his shoulder, his hands busy drizzling teriyaki sauce. Laura was standing nearest him. “There’s some wine on the counter, you could open that!”</p>\n<p>Laura rushed over to the counter to get the bottle and hurried into the dining room, handing it to her mother. Talia opened the bottle and set it on the table to breathe. </p>\n<p>Stiles could feel his heart pounding in his chest and his blood rushing through his veins. He willed his hands to stay still.</p>\n<p>Talia appeared at his side and started carrying dishes over to the table, leaving Laura to arrange them artfully on the surface.</p>\n<p>“This looks amazing, Stiles,” Talia beamed at him. “He’s going to love this.” </p>\n<p>\n<i>I am killing this surprise dinner thing!</i>\n</p>\n<p> “We’ll go wait in the living room!” she said, heading out of the kitchen. </p>\n<p>Stiles placed the last dish on the dining room table, and headed back into the kitchen so he could calm himself down before the <i>real </i>awkward part of the evening began. </p>\n<p>He counted to himself, trying to get his heart beat to slow, and working through breathing exercises to stave of a panic attack as the reality of all of his strange decisions began to catch up to him. </p>\n<p>This wasn’t just pretending to be someone’s date while they were dancing at a club so that they could make an ex jealous. Stiles had broken into a stranger’s home and asked a fellow officer to do an illegal background search so that he could lie to his family about how well he knew him. </p>\n<p>\n<i>What the hell have I gotten myself in to?</i>\n</p>\n<p>Erica made her way into the kitchen and looked up at Stiles and meowed. </p>\n<p>“Thanks.” He said, choosing to take her meow as encouragement. “Okay, I just have to make it through dinner, and then Derek will be home free.” </p>\n<p>Erica rubbed up against his ankle and sauntered off.</p>\n<p>Stiles got back into action, tidying up the kitchen as quickly as he could and focusing his mind. Once everything was tidy, he joined Laura and Talia in the living room and turned the lights off to keep up the impression that no one was home. After all of this, it would suck if Derek’s surprise was ruined before he even got in the damn house. Laura crouched down behind the couch, pulling at Stiles’ uniform pants until he ducked down as well, Talia following suit.</p>\n<p>It was only awkward for a little while, because minutes later they heard the deep rumble of an engine and a black Camaro pulled up to the house front of the house.</p>\n<p>\n<i>Here we go.</i>\n</p>\n<p>His car stalled awkwardly mid turn as it reached the driveway, unable to pull in because of Stiles’ car. The car backed up, and parked in front of the house, behind Talia’s rental car. </p>\n<p>“Oh my gosh, this is so exciting!” Laura squealed. </p>\n<p>“That’s one way to put it,” Stiles muttered under his breath. </p>\n<p>They heard Derek shut his car door, and they counted the seconds of silence until they heard his keys jingling on the porch. They heard the sound of the key sliding into the lock, and the turning of the latch, and then the door knob began to turn.</p>\n<p>Derek opened the door slowly, peering his head in to scan the room while his hand fumbled for the light switch.</p>\n<p>Finally finding it, he switched it on, and Laura and Talia popped up from their hiding places behind the couch.</p>\n<p>“Surprise!!” Talia and Laura yelled, moving forward towards him in a fit of delighted laughter.</p>\n<p>Derek started, looking at his mother and sister for a second. “Laura? Mom?” </p>\n<p>He hugged them back, surprised, and a smile curled onto his face… </p>\n<p>… until his eyes landed on, </p>\n<p>“Stiles?!” he looked straight up confused. A flush appeared high on his cheeks and his jaw dropped open in shock. </p>\n<p>“Surprise?” Stiles offered weakly, waving a little at him. </p>\n<p>Derek closed his mouth, swallowing thickly, and his messenger bag slid off of his shoulder and dropped to the floor. </p>\n<p>“Oh my god,” He said, eyes wide.</p>\n<p> </p>\n<p>*<br>\n*<br>\n*</p>\n<p>*<br>\n*<br>\n*</p>\n<p>As strange as it sounds, Stiles hadn’t really given much thought to what Derek Hale looked like. </p>\n<p>He had heard ‘boyfriend’ and began his rapid, chaotic descent into freaking out about how to impress the Hales, and it never even crossed what this boyfriend would even look like. </p>\n<p>But even if he did try to imagine him, there’s no way that Stiles would have even come <i>close </i>to the slice of physical perfection that walked through that front door. </p>\n<p>‘Gorgeous’ was not descriptive enough to describe Derek Hale. </p>\n<p>Derek was the <b>epitome </b>of tall, dark, and handsome. He had sculpted cheekbones which led to a chiseled jawline and a well taken care of beard that just begged you to sit on his face. Behind his thick-framed black glasses, Derek had piercing green eyes and the most luscious pair of eyebrows Stiles had ever seen. </p>\n<p>He didn’t even know eyebrows could be luscious! </p>\n<p>Derek was only a few inches taller than Stiles and he walked with a cane, favoring his left leg a little as he moved. He wore gray slacks, and a white button down shirt beneath a burgundy cardigan that complimented his skin tone <i>perfectly</i> His first few shirt buttons were undone, and Stiles could see the faint curls of chest hair peeking out from under his shirt. </p>\n<p>\n<i>Who even is Derek Hale?! </i>\n</p>\n<p>Derek Hale was like a real life version of every single cover of every single smutty romance novel come to life. Or some kind of Porno Disney Prince sent to make everyone’s erotic fantasies become a reality. </p>\n<p>Stiles hadn’t needed to put this much effort into not popping a random boner since high school. </p>\n<p>It wasn’t until Stiles had taken in all the physical perfection that was Derek Hale, that he realized he was still wearing the cartoon-bikini apron that he had put on earlier. He ripped the apron off of his body ungracefully and tossed it onto the couch behind him. </p>\n<p>Laura and Talia untangled themselves from Derek and stood back to let him properly step inside of the house. Derek moved into the room and shut the door behind him, eyes never leaving Stiles’. He picked up his bag from the floor and carried it into the room and set it on a chair. </p>\n<p>“What are you guys doing here?” He asked finally dragging his eyes away from Stiles to look at his mother and sister. </p>\n<p>Laura was the first one to start talking. “Our flight got rescheduled to tomorrow, so we thought we’d surprise you.” She looked back to Stiles, “We ran into Stiles in the grocery store and convinced him to help us surprise you!” </p>\n<p>She was so wrapped up in her excited retelling of the day’s events that she didn’t notice that all of the color had drained from Derek’s face. </p>\n<p>He looked like he wanted to scream. </p>\n<p>Or cry. </p>\n<p>Or throw up. </p>\n<p>Or some combination of the three. </p>\n<p>“Oh my god.” Derek repeated. His panic filled gaze landed on Stiles a second time. Stiles gave a nervous wave.</p>\n<p>“Welcome home….dear.” he offered weakly.</p>\n<p>Talia laughed and looked back at Stiles “Derek, you never told us your boyfriend was such a cutie!”</p>\n<p>“Oh my god!” Derek was raising his voice, his voice taking on a frantic edge. </p>\n<p>“Uh, I’m going to go check on the dessert. Excuse me.” Stiles grabbed the apron from the couch and backed out of the living room, hurriedly making his way to the kitchen. </p>\n<p>Behind him he heard the voices of Talia and Laura as they recapped their day more thoroughly from start to finish.</p>\n<p>Stiles went back to his deep breathing exercises while folding up the apron and tucking it back inside the drawer. </p>\n<p>\n<i>My boyfriend is a Greek statue who came to life and then got lost in a GQ photoshoot on his way home. </i>\n</p>\n<p>Stiles ran his hand through his hair nervously. He bent to peek at his reflection in the microwave door, trying to tame it from all the abuse it has suffered in the last few hours.</p>\n<p>He didn’t think he looked too bad. Although standing next to Porno Disney Prince, by comparison he couldn’t possibly look that great either. But, you know, he looked pretty alright. </p>\n<p>\n<i>Pretty alright? </i>\n</p>\n<p>This evening was going to hell in a handbasket. </p>\n<p>After a few moments, he heard Derek excuse himself from his mother and his sister and make his way into the kitchen. Stiles could hear his footsteps and the tap of his cane on the wooden floor as he came closer to the kitchen.</p>\n<p>“Let me just say hello to Stiles really quick and I’ll be there in a minute! You guys go ahead and sit down.” he shouted over his shoulder. </p>\n<p>Stiles looked up from where he was standing, wringing his hands nervously, and was met with a very mortified Derek Hale standing there biting his lip. </p>\n<p>Derek opened his mouth before closing it again and shaking his head, exhaling in defeat. </p>\n<p>“I’m so <i> embarrassed</i>.” He said exasperatedly, furrowing his eyebrows. He looked up at Stiles. “I am <i>so</i> sorry.”</p>\n<p>That was not exactly what Stiles had expected. For Mr. Hottest Mother Fucker In America And Possibly The Western Hemisphere to apologize to <i>him</i>. The guy who had just broken into his house. Derek was worried about Stiles’ feelings? </p>\n<p>No. Just, no. How was this even fair? </p>\n<p>“Really, you don’t have to apologize.” Stiles said waving his hand to cut Derek off. He actually managed to sound much more laid back than he actually felt inside. </p>\n<p>“I don’t even know where to <i>begin </i> to explain.” Derek shook his head and cringed. “You must think-”</p>\n<p>“Hey,” Stiles interrupted, moving forward to place his hand gently on Derek’s arm. “Look, we’ve got guests to entertain tonight, huh? We can talk about it later. So for now, let’s pull ourselves together and go out there and fake the best damn relationship that anyone has ever seen, huh?” </p>\n<p>Stiles smiled what he hoped was his most winning smile, and Derek immediately relaxed returning a smile of his own. </p>\n<p>Derek nodded to himself, and took a breath to center himself. “You’re right.” </p>\n<p>Stiles turned around and grabbed the large serving spoon that was on the counter. </p>\n<p>“Here, carry this,” Stiles handed the spoon and grabbed a four wine glasses from the cupboard. “Our dinner is getting cold.” </p>\n<p>They walked into the dining room, where Laura and Talia smiled at the two of them. Derek and Stiles looked at each other one more time, before heading to the table.</p>\n<p> “Phase Three: Wow the fuck out of Derek’s Family” He said under his breath. Then, turning on a winning smile, he began serving food while Derek poured them each a glass of wine.</p>\n<p> </p>\n<p>Dinner went fantastically. </p>\n<p>Stiles was funny. Like, funnier than usual. </p>\n<p>He told anecdotes from work and recounted adolescent shenanigans that he and Scott got tangled up in during high school. Laura and Talia laughed along and offered up more stories about Derek in his youth, much to Derek’s displeasure, and overall everyone seemed to enjoy the light-hearted cheerful atmosphere. </p>\n<p>The weirdness of this entire situation magically seemed to dissolve immediately, and Stiles went from being paranoid about being convincing, to actually managing to have a great time. </p>\n<p>Stiles knew there wasn’t an award ceremony for this kind of thing. But if there was, he’d definitely go home with the <i>Most Convincing Fake Boyfriend of the Year</i> award. </p>\n<p>Stiles kept his arm loosely draped around the back of Derek’s chair while they ate, reaching his hand up every now and then to play with the hair at the base of his neck. He made up romantic little anecdotes about the beginning stages of their relationship and waxed poetic about how special Derek was, earning blushes from Derek, and “aww!’s and “so cute!”s from Laura and Talia. </p>\n<p>He used enough pet names to be endearing, but no too many to be nauseating. He touched Derek just enough to insinuate he couldn’t get enough, but no so much that it looked vulgar. </p>\n<p>Stiles was rocking this boyfriend thing. </p>\n<p>He’d never really done undercover work as a deputy, but he thought this might be the experience that has him taking up any offers that might come his way. Not that they really got many that required him to be a boyfriend. </p>\n<p>But, you know. If they did. Stiles would rock that shit. </p>\n<p> </p>\n<p>They finished eating dinner and Talia and Laura offered to do dishes since Stiles made all the food and Derek was probably tired from work. </p>\n<p>Talia pulled Laura into the kitchen with a wink in Stiles’ direction, and it was then that he realized that she was trying to give them some alone time. </p>\n<p>\n<i>Alone Time. </i>\n</p>\n<p>Derek, who hadn’t missed the wink, stood up smiled awkwardly at Talia. </p>\n<p>“Mom, if you’ll excuse us, I just want to talk to Stiles really fast in my room?”</p>\n<p>“Sure honey,” She smiled mischievously while Laura pulled a horrified face. </p>\n<p>Stiles set his napkin on the table and stood up from his seat. Derek tilted his head in the direction of his room, and Stiles followed Derek out of the room. </p>\n<p>They walked down the hallway into his bedroom –<i> Dear God he hoped this would not be the last time he took this trip</i>—and Derek shut the door behind him. The tenseness from Derek’s shoulders returned, and he looked nervous. </p>\n<p>“I think I owe you an explanation.” </p>\n<p>Stiles sat down on the edge of the bed—which of course was fluffy and comfortable and perfect-- and waited for Derek to speak. </p>\n<p>Derek reached up to scratch the back of his neck while the hand on his cane clinched and unclenched in obvious nervousness. Stiles could practically <i>see</i> Derek’s thoughts racing and he wanted to take some of the pressure off the situation. </p>\n<p>“Look dude, no matter what it is you have to say, just keep in mind that <i>I’m</i> the one who broke into <i>your</i> house and made your sister and mom dinner. So no matter how awkward you feel, just imagine how <i>I</i> feel right now.”</p>\n<p>Derek chuckled, his eyes crinkling as he smiled. </p>\n<p>After a few more seconds, Stiles decided to help him out a little. </p>\n<p>“So, uh, not that this evening hasn’t been wonderful so far, but… why does your family think we’re dating?”</p>\n<p>Derek let out resigned—and thoroughly embarrassed—breath, and moved toward the bed to sit next to Stiles. (Stiles almost started crying at how <i>glorious</i> his cologne smelled.) Derek rested his cane against the side of the bed, and massaged his knee a bit. </p>\n<p>“Well, it all started earlier this year.” He finally began, folding his hands and resting them on his lap. “I’m a professor at Cal State, and after last fall semester, I went on sabbatical so that I could finish a book I’m writing. Since I had more free time, I picked up a few more shifts volunteering with the fire department.” </p>\n<p>Stiles nodded to show that he was listening. </p>\n<p>“There was a call to the kids home, and it was pretty bad.” He let out a breath. “Most of the kids had made it out safely, but there was a little boy on one of the floors that no one could find. He’s hearing impaired, and even though we were calling his name as loudly as we could, he wasn’t able to hear us.”</p>\n<p>Derek paused his hands wringing his lap. Stiles reached down and softly put his hand over Derek’s, cupping them supportively. Derek looked up at Stiles briefly and gave him a shy, thankful smile. </p>\n<p>“My commander told us that the floors were no longer secure, and we were ordered to stay out, but I just couldn’t let—” he paused, shaking his head and looking down. “I went back in. Against orders. And by sheer chance, I came across the little guy on the third floor, and had just enough time to grab him and turn back and make my way out. The second floor collapsed as I was on the stairs, and I got trapped beneath a beam.”</p>\n<p>He cleared his throat for a moment. </p>\n<p>“Others could see us from in front of the house, and they came in to grab the boy and help free me. I was taken to the hospital in pretty bad condition. <i>Alive</i>, but in pretty rough shape.” </p>\n<p> Derek slid his hand down to his left knee. </p>\n<p>“I was in the hospital for weeks. Between the knee, which needed several surgeries, and severe smoke inhalation, I was in kind of a dark place.”</p>\n<p>Stiles heart ached for Derek, who had suffered through not just one, but <i>two</i> traumatic fire-related incidents in his life. </p>\n<p>“Because I disobeyed direct orders by my superior, I was let go from the volunteer fire group.” He shrugged softly. “I absolutely understand the reason. I could have been killed, and they can’t have people disobeying orders in times of crisis like that. I don’t have any hard feelings toward them, and the guys and I still talk. But, y’know.”</p>\n<p>“It still stings.” Stiles said softly. </p>\n<p>Derek nodded. “Yeah.”</p>\n<p>Derek looked up at Stiles again. The room was dim, the last rays of the descending sun spilling through the blinds, and the soft quiet of a summer afternoon drenched the room in a silent intimacy.</p>\n<p>In the distance, Stiles could hear Talia and Laura in the kitchen, and the sounds of a jingly collar and the pitter-patter of little cat feet playing around with something in the hallway, but Stiles felt as though he and Derek were the only one in the entire house. </p>\n<p>It was nice, and it felt magical in a way that Stiles hadn’t experienced before with someone else. </p>\n<p>Derek blushed and bit his lip, continuing with his explanation.</p>\n<p>“Anyway, I spent a lot of time in the hospital feeling sorry for myself. My family lives mostly on the east coast and I didn’t get many visitors. But every day without fail, I did get <i>one </i>visitor.” He looked up at Stiles again. “Sheriff Stilinski.”</p>\n<p>“My dad?” he asked incredulously.</p>\n<p>Derek nodded, smiling to himself. </p>\n<p>“I couldn’t really talk the first week that I was there because of the sore throat from the smoke inhalation, but your dad came just to keep me company. He would sit by my bed and talk and talk and talk, for hours. Making sure I wasn’t alone, making sure that I knew that someone was there for me.”</p>\n<p>Stiles thought back, and he could remember his dad mentioning he had somewhere to be after his shifts, but Stiles always assumed it was to spend time with Melissa.</p>\n<p>“He said he heard the story of what I’d done from one of the EMTs, and that he was very proud of the bravery I’d shown.” Derek shook his head and looked back at Stiles. “ I don’t know if you remember, but several years ago there was at the wolf sanctuary?” </p>\n<p>Stiles nodded. “I remember.”</p>\n<p>“Your dad drove me to the station and waited with me until my parents got there.” Derek shook his head, recalling the obviously upsetting memory. “My uncle was livid with me, understandably. The people who I thought were my friends had all abandoned me the second that things got really scary, and…” He trailed off. </p>\n<p>“I know that the fire was practically my fault anyway since I’m the one who told them how to get into the sanctuary in the first place, but I was just <i>so </i> scared and sick with all of the ‘what-ifs’ and your dad stayed with me the whole time and made sure I didn’t have to be alone.” </p>\n<p>That’s one of the reasons Stiles loved his father so much. There is just something about the man that oozes understanding and support and You’re Not Alone. In that moment, Stiles was so proud of his father for being who he was and for being with Derek for two horrible moments in his life.</p>\n<p>“It meant a lot that he sat with me in the hospital too, and here he was telling me how proud of me he was. And it just--” Derek shrugged and smiled a small, shy smile. “It just felt good to hear it from him.”</p>\n<p>Stiles hummed in confirmation. </p>\n<p>“Anyway, after a day or so, he ran out of things to say,” Derek smiled. Stiles laughed, because, yeah, that sounded <i>exactly </i> like his dad too. </p>\n<p>Stiles’ dad was a man of few interests, and a running joke in the Stilinski-McCall household was that Stiles did <i>not</i> inherit his loquaciousness from his dad’s side of the family. </p>\n<p>“I guess he doesn’t really have that much time to gather stories to tell bedridden ex-volunteer fire fighters, so he told me about you.”</p>\n<p>“Oh god.” Stiles cringed. Derek chuckled. </p>\n<p>“He talked about you growing up, about some of the weird trouble you got into in high school, all the situations that nearly got <i>him</i> in trouble. He told me about some of the weird papers you’d write for a class.” </p>\n<p>Stiles wanted to die. He half wondered if he could sneak out of the window while Derek was talking and drive off into the night, never to be seen again. </p>\n<p>“But mostly he just told me about how proud he was of you for the man you’d become, and how brave you were, and how much he loved you.”</p>\n<p>“Dad!” Stiles whined, burying his face in his hands.</p>\n<p>“You sounded really interesting!” Derek laughed, bumping his shoulder against Stiles,’ “And I always thought it’d be nice to meet you. And your dad mentioned that you were gay,” </p>\n<p>“This is it,” Stiles said from in between his palms. “This is how I die. I can feel it.”</p>\n<p>Derek tilted his head back and laughed loudly. </p>\n<p>“For a while my family had been pestering me about my dating life, and I mentioned that I was seeing someone just to get them out of my hair. One night, while I was on the phone with mom, I was looking through the paper and I saw your picture for that guy you caught.” Derek blushed again and brought a hand up to adjust his glasses. “I mentioned that I <i>was</i> dating someone, thank you very much, and I had to go because we were going out to dinner to celebrate your closing a huge case and making it on the front page of The Beacon.”</p>\n<p>“I take it they looked me up?” Stiles sat back up and glanced at Derek, raising an eyebrow. </p>\n<p>Derek smiled embarrassedly, his eyebrows rising in defense, “I didn’t think she’d actually look you up!”</p>\n<p>“Your boyfriend is a hero of the community; of course she looked me up!” He blurted dramatically. “I’m fascinating!” </p>\n<p>Derek laughed again, and Stiles was beginning to think that that sound was the thing that hopes and dreams were made of. </p>\n<p>“Thank you for what you did out there.” Derek said, tilting his head in the direction of the kitchen.</p>\n<p>Stiles winked at him, enjoying the way the tips of Derek’s ears reddened bashfully. </p>\n<p>“Of course, man. I wouldn’t leave you hanging.”</p>\n<p>This whole evening was a complete fluke, a complete statistical improbability, and such a <i>giant fucking coincidence</i> and Stiles wasn’t really the type to believe in destiny or the universe intervening, but….c’mon!</p>\n<p>There was no way he could leave here tonight and <i>not</i> see where this thing went. There were some serious vibes going on between them. Plus, Derek’s family loved him too!</p>\n<p> </p>\n<p>Eventually they made their way out of the bedroom and joined Derek’s mom and sister. </p>\n<p>They all sat on the back porch chatting, and Derek served them homemade ice cream (<i>who the hell even makes homemade ice cream? Seriously, Derek, you’re putting the rest of us to shame!</i>) and before Stiles knew it, it was almost 9:30.</p>\n<p>“I should probably head out,” he said rising from the deck chair, holding his empty ice cream bowl in his hands. </p>\n<p>Talia looked down at her watch. Derek looked briefly at Stiles and Stiles could have sworn that he looked disappointed. </p>\n<p>“Sorry we interrupted your evening,” Laura said, eyeing the two apologetically. </p>\n<p>“No, it’s no problem!” Stiles smiled, “It was really great to meet you two.” </p>\n<p>With one last bit of courage left over from an afternoon of bad decisions, Stiles used his last bit of bravery to look at Derek and ask: “Besides, if you’re not doing anything Saturday night, <i>darling</i>, maybe you’d like to get dinner. You know, for date night.”</p>\n<p>Derek blushed so prettily and bit his lip. “Yeah.” He swallowed thickly. “Dinner would be great.” </p>\n<p>“Awesome.” Stiles smiled so wide he thought he was going to strain a muscle. “It’s a date.” He winked. </p>\n<p>“It was wonderful meeting you, Stiles sweetheart.” Talia rose from her chair and wrapped Stiles in a warm hug. </p>\n<p>“Yeah!” Laura said, leaning around her mom to smile at Stiles. “Welcome to the family.”</p>\n<p>“Take care of our Derek.” Talia said, leaning in to place a kiss on Stiles’ forehead. </p>\n<p>“Mom!” Derek let out a pained groan of embarrassment. </p>\n<p>“I expect to see you at Christmas this year!” Laura said to Stiles, but she gave Derek a pointed look afterward. </p>\n<p>Stiles laughed. “We’ll see.” He untangled himself from Talia. “You know how things at the station are. There’s no guarantee I’ll be able to get the time off.”</p>\n<p> </p>\n<p>Stiles was finally able to make his exit, and head toward the front door. </p>\n<p>Derek excused himself from his mom and sister, and walked Stiles out front to his car. </p>\n<p>Stiles unlocked the cruiser, but just juggled his keys in his hand before he turned back to face Derek. </p>\n<p>Derek smiled at him, his eyes darting down to Stiles’ lips momentarily. “Stiles, thank you again for all that you did earlier.” In the stillness of the night, Derek’s voice felt much more private and sensual, and it was giving Stiles some seriously dirty thoughts. </p>\n<p>“Derek, I meant it when I said it was no big deal.” Stiles reached out and took Derek’s free hand in his. “I also meant it when I asked you out. Just to be clear.”</p>\n<p>Derek chuckled softly, a blush rising to his cheeks. “And I was serious when I said yes. Just to be clear.”</p>\n<p>“And, hey, bonus; we won’t have the whole meeting the parent’s thing hanging over our heads!” Stiles shook his fists in a fake cheer, “Yipee!”</p>\n<p>Derek’s eyes lit up as he laughed. “I guess we won’t.”</p>\n<p>Stiles shoved his keys in his pocket and stepped forward so that he could take Derek’s face in his hands. Derek stilled, and his eyes darted down to Stiles’ lips again. He leaned in toward Stiles, closing a little more of the gap between them. </p>\n<p>“Can I kiss you?” Stiles’ voice was barely above a whisper, but in the stillness of the night, Derek was able to hear him perfectly. </p>\n<p>“Yes.” Derek breathed in a whisper of his own. He licked his bottom lip and gently leaned in the rest of the way toward Stiles. </p>\n<p>And. This. <i>This</i> was Stiles’ favorite part about the whole day. </p>\n<p>Hell, it was his favorite part about his entire year. </p>\n<p>They continued kissing for a few minutes before behind them they heard,</p>\n<p>“Oh shit, mom, they’re going at it in the front yard!”</p>\n<p>followed by, </p>\n<p>“Laura! Give them some privacy!”</p>\n<p>Derek and Stiles broke apart, Stiles laughing, Derek sighing in exasperation and flipping the bird to the general direction of the house. </p>\n<p>They moved away from each other and Stiles pulled his keys back out of his pocket. </p>\n<p>“See you this weekend Derek.” Stiles smiled, getting in the cruiser. “Pick you up at seven?”</p>\n<p>Derek nodded, smiling brightly. “Seven is perfect.”</p>\n<p>Stiles started the cruiser and backed out of Derek Hales driveway, and off into the night. </p>\n<p> </p>\n<p>And yeah, it was official. </p>\n<p> </p>\n<p>Stiles Stilinski was <b>the </b>boyfriend extraordinaire. </p>\n<p> </p>\n<p> </p>\n<p>-fin-</p>\n<p> </p>\n<p>*<br>\n*<br>\n*</p>"
}