{
  "id": "7665130",
  "url": "https://archiveofourown.org/works/7665130?view_full_work=true",
  "author": [
    "TunaFishChris"
  ],
  "title": "5 Times Spider-Man Saved an Avenger's Ass (and 1 Time They Saved Him)",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "The Avengers (Marvel Movies)",
    "The Amazing Spider-Man (Movies - Webb)",
    "Captain America (Movies)"
  ],
  "relationships": [
    "Peter Parker & Avengers Team"
  ],
  "characters": [
    "Peter Parker",
    "Steve Rogers",
    "Tony Stark",
    "Natasha Romanov",
    "Clint Barton",
    "Bruce Banner",
    "Hulk",
    "Various Bad Guys",
    "Thaddeus Ross"
  ],
  "additional_tags": [
    "Winter Soldier-Compliant",
    "Not AoU-compliant",
    "AU Canon Divergence",
    "Injury",
    "Attempted Kidnapping",
    "Rescues",
    "BAMF Peter Parker",
    "Some angst",
    "Hurt/Comfort"
  ],
  "language": "English",
  "series": "",
  "published": "2016-08-03",
  "completed": "2016-08-05",
  "words": "7,222",
  "chapters": "6/6",
  "comments": "120",
  "kudos": "7,827",
  "bookmarks": "1,195",
  "hits": "82,469",
  "summary": "<p>What it says on the tin. </p>\n<p>Going through an angsty Spider-Man phase. I regret nothing.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Check out my tumblr! http://christinamariedza.tumblr.com/</p>\n<p>Slightly longer than the others. Sorry, not sorry. :)</p>\n<p>If you like this, check out my tumblr! (I am Christina \"DZA\" Marie) http://christinamariedza.tumblr.com/</p>",
  "text": "<p>Natasha Romanov was not a damsel in distress. </p>\n<p>She did not need rescuing. She did not need help. She was a perfectly capable, independent woman. </p>\n<p>However, like all people, she did occasionally require assistance in solving a particularly tricky problem. </p>\n<p>In this case, a Hydra kidnapping. </p>\n<p>They wanted a new Winter Soldier, or something. Nat wasn't entirely sure; she was kind of drugged at the moment. Stupid tranquilizers. </p>\n<p>And she's got to be hallucinating about now, because she could've sworn one of the kidnappers trying to drag her into the van just lost his weapon to a shot of spider-webs. </p>\n<p>A shadowed figure slammed into the man holding Nat upright. She staggered, but managed to find her balance. The Red Room had taught her how to fight while drugged. She'd pass out in a few minutes, certainly, but for now she could snap some necks. She stomped on the nearest agent's foot hard enough to break bone and elbowed his throat. Down like a rock. </p>\n<p>She took out two more before staggering and leaning against the alley wall. There had been three...four more? But they were all unconscious or in webs. And there was a man in brightly-colored spandex standing in front of her. </p>\n<p>\"Holy shit, you're Black Widow!\" </p>\n<p>Nat blinked at him. \"I've read your file. Spider-Man. Vigilante hero. Loner. Enhanced strength and senses. Inorganic webs shot from devices on your wrists. Young, projected age under thirty. Only been a hero for twenty-two months, including the six-month gap where you took a vacation or got kidnapped or hurt or something. Considering the fact that it happened right after the death of Gwen Stacy I imagine it has something to do with a mental or emotional crisis and where are we going?\" </p>\n<p>Spider-Man had his hands on her shoulders and was walking her down the sidewalk. \"We're going to get a phone and call an ambulance. Pretty sure you're drugged, Ms. Romanov.\" </p>\n<p>\"Oh, well, you're going to have to carry me because I think I'm gonna pass...\"</p>\n<p>\"Oh, hey, hey, don't pass out! Come on, you--god dammit.\" </p>\n<p>--</p>\n<p>Natasha woke up in SHIELD medical, Clint sitting in the chair next to her. He grinned. \"Ah, the rescued damsel awakens.\" </p>\n<p>\"I will murder you,\" she promised. \"After I murder <em>him</em>.\"</p>\n<p>Tony basically flew around in a metal computer. Of course he made sure it was protected against EMPs.</p>\n<p>So he's more surprised than anyone when his machine suddenly shuts off in the middle of a battle after the mad scientist does...something and he starts falling to the earth. </p>\n<p>Let's rewind. Two hours ago, there'd been a call to assemble. A Dr. Mad (super original, right?) had decided to take over the world with robots, starting with NYC. It was basically the Chitauri invasion all over again: the Avengers against an army that was led by a psychotic ass, only without Hulk punching Thor (such a shame). </p>\n<p>Tony had locked in on Dr. Mad's location. He was using his company's building in Manhattan to control the robots, which were nasty cyborgs with automatic weapons and a full encyclopedia of martial art techniques from around the world. Even Natasha was having a hard time with them. </p>\n<p>\"Thor, can't you use your lightning to take these things out?\" Cap asked over the coms. </p>\n<p>\"I am,\" Thor replied. \"But if I use much more power I fear I'll render the city to dust.\" </p>\n<p>\"Don't worry about it, Goldie. I think I see Papa,\" Tony said, zooming in on Dr. Mad's building. He was on the roof, probably to make sure the radio signal wasn't disrupted by anything. </p>\n<p>That's when Dr. Mad pressed a button on his control panel that did a thing, and now Tony was hurtling to the earth, his suit dead. </p>\n<p>\"Tony!\" Clint called, panicked. </p>\n<p>\"Suit's down!\" Tony gritted out. </p>\n<p>\"Thor, we need you!\" </p>\n<p>\"I am too far!\" </p>\n<p>\"Where's Hulk? We--\"</p>\n<p>A web latched onto Tony's armor, and he started swinging instead of falling, before being gently lowered to the ground. </p>\n<p>Tony pulled the release on his suit and stumbled out of it, panting hard. \"Christ.\" </p>\n<p>\"Tony?\" Cap called. </p>\n<p>\"I'm good. I'm grounded, but I'm good.\" Tony poked at the webbing on his suit. \"Uh, I don't know...\" </p>\n<p>\"Hey, Mr. Stark! Big fan.\"</p>\n<p>Tony looked up. Spider-Man was on the side of a building, a few stories up, nothing but his sticky fingers and toes keeping him attached to the glass. \"How's your neck?\" </p>\n<p>\"My what?\" </p>\n<p>\"Your neck,\" Spidey repeated. \"No broken bones or any of that?\" </p>\n<p>Tony shook his head. He supposed it was a valid concern. If Spidey had webbed him up any other way, there was a decent chance he would've broken his neck. </p>\n<p>\"You wanted to get to the crazy doc's control panel, right?\" </p>\n<p>\"Any chance I could get a ride?\" Tony asked. He could've sworn Spider-Man grinned under that mask. </p>\n<p>Swinging through the city on webs was <em>awesome</em>. Flying was great, but the ups and downs of the swings made the adrenaline in Tony's veins go off the charts. And he was practically naked in his t-shirt and jeans, no protection at all if something went wrong, not like the security blanket that was metal armor. (Granted, his armor hadn't really helped him five minutes ago, but still.) </p>\n<p>Spider-Man dropped him on the edge of the building, away from Dr. Mad and the five robot guards he had with him. \"I distract, you do computer magic?\" Spider-Man offered. </p>\n<p>\"Sounds good.\"</p>\n<p>\"Are we really trusting this guy to do this?\" Clint asked over the coms. \"He does low-level thugs and muggers. This is a bit above his caliber, don't you think?\" </p>\n<p>\"Hey, doc!\" Spidey shouted, on the other side of the roof from Tony. \"Where'd you get the tech? Apple or Best Buy?\"</p>\n<p>Oh, wow. Dr. Mad was doing exactly what Tony would've done if anyone had compared <em>his tech</em> to friggin' Apple and goddamn Best Buy: sent all five guards after him to destroy his ass. </p>\n<p>While Spidey danced between the robots' bullets, Tony crept up behind Dr. Mad and knocked him out with an elbow hit Steve had showed him. Dr. Mad went down like a rock. </p>\n<p>Forty-three seconds later, all the robots were remotely shut down and Tony had Thor pick up his suit and drop it off at Avenger Tower before SHIELD or some other villain could get their grubby little hands on it. </p>\n<p>\"Ah, shit.\" </p>\n<p>Tony looked up and winced. A bullet had found its way into Spidey's bicep. Tony took his arm to get a closer look, then frowned. \"Are you seriously wearing <em>spandex</em>?\" </p>\n<p>\"Shut up! Not all of us are billionaires,\" Spidey replied hotly. \"It's just a flesh wound. I'll fix it up when I get home.\" </p>\n<p>\"You know, you could drop by SHIELD medical,\" Tony suggested. \"They'll patch it up for you.\" </p>\n<p>Spidey paused for a moment, like he was unsure of what to do of the offer of proper medical attention. Then he shook his head. \"No offense, Mr. Stark, but after the whole SHIELD-is-actually-Hydra thing, I think I'll pass.\" </p>\n<p>\"Wow. First of all, no Mr. Stark bullshit. That was my dad, and he was an asshole. Second, SHIELD was <em>infiltrated</em> by Hydra; it's not actually Hydra,\" Tony pointed out. </p>\n<p>Spidey shrugged. \"Tom-ay-to, tom-ah-to. I gotta go.\" He jumped off the roof, webs flying as he shouted over his shoulder, \"This was a lotta fun. We should do it again after you fix up your Best Buy suit!\" </p>\n<p>Tony saw red. \"You DID NOT!\"</p>\n<p>Bruce had been living with the Avengers for three months now. Three glorious, comfortable, safe months. </p>\n<p>He was an idiot for thinking it could last. For forgetting that, Avenger or no, he was a monster. For forgetting about Thaddeus Ross. </p>\n<p>The Avengers had been called to deal with a situation just north of the city. Some ancient rock creatures had awakened and were set on destroying human civilization. Thor had gone into great detail about it; apparently they appeared in some of the other worlds he'd been to. Bruce and Tony were going to study them later, figure out their molecular structure, the anatomy and physiology, normal \"science bros\" stuff. </p>\n<p>That was all Bruce could recall. It'd gone to Code Green pretty quick, and his memories of the battle were hazy at best. </p>\n<p>Now he was lying half-naked in a crater with broken trees and crumbling buildings around him. He sat up and winced, both at the pain in his aching body (Hulking and de-Hulking took a lot out of a man) and the collateral damage the Other Guy had caused. Tony always wrote the checks to pay for it, and Bruce tried to make it up to him by helping him with Stark Industries tech. </p>\n<p>Somehow he'd gone from northern NYC to Central Park. Bruce stood and brushed the dirt off his skin, determined to find a phone so he could call the others and make sure they were all right. One of the Avengers was usually around when he woke up. The fact that they weren't either meant they were all caught up in the clean-up, or something was very, very wrong. </p>\n<p>Bruce didn't even see the soldiers coming until he was surrounded by armed men, pointing some very big guns at him. </p>\n<p>His stomach sank as he raised his arms. This again. </p>\n<p>A few trucks came in from the street, military-grade. Thaddeus Ross opened the door from one of them and stood. \"Good evening, Banner.\" </p>\n<p>\"General,\" Bruce replied. \"Weren't you given presidential orders to stand down?\" </p>\n<p>\"I was,\" Ross admitted. \"Unless I was given evidence that indicated you were becoming too great a risk for the American public. And I have that now.\" </p>\n<p>Bruce swallowed. \"How? What happened?\" </p>\n<p>\"You killed three women today, Banner.\" </p>\n<p>Bruce's heart stopped. \"What?!\" </p>\n<p>\"They were trapped in a car that you decided to throw at one of those rock-monsters. The good news is we're pretty sure they died instantly. But, they still died.\" Ross gave him a hard look. \"Didn't I warn you something like this would happen?\" </p>\n<p>Bruce felt sick, and he wanted to kick himself. He'd been so sure that by being on the Avengers team, he would be good. That Hulk would behave at least a little. That if nothing else the other Avengers could stop him before he did something like this. </p>\n<p>Stupid Banner. Stupid, <em>stupid</em> Banner...</p>\n<p>\"He's lying!\" someone shouted. </p>\n<p>Bruce jumped. Everyone looked around and up. A blue and red figure waved at them from one of the trees. </p>\n<p>\"Those women did die, but they were thrown by one of the rock-monsters,\" Spider-Man said. \"Hulk actually tried to save them, and when he couldn't, he got really pissed. Smashed Rocky pretty good.\" </p>\n<p>\"We're supposed to take the word of a vigilante?\" Ross challenged. </p>\n<p>\"Let's ask Captain America, then. He saw the whole thing,\" Spider-Man replied. He held out his hands as if balancing a scale. \"Should we trust the word of a corrupt, psychotic general, or the hero of WWII and the Chitauri invasion. Hmmm...\" </p>\n<p>Bruce could breathe again. He was innocent? </p>\n<p>\"You know, taking you out would get me a pretty good favor from the local police,\" Ross commented, as half a dozen guns turned to Spider-Man. \"How long have they wanted you behind bars now?\" </p>\n<p>\"One year, seven months, and sixteen days, sir!\" Spider-Man reported, complete with a salute. \"And according to my watch, about thirteen hours and maybe twenty minutes? Twenty-five?\"</p>\n<p>\"Shut him up,\" Ross ordered. </p>\n<p>\"Wait!\" Bruce called. \"Wait, don't hurt him.\" </p>\n<p>\"No, by all means, give it your best shot.\" Spider-Man sat on the tree branch, getting more comfortable. \"Betchya can't hit me.\" </p>\n<p>\"Fire,\" Ross ordered. </p>\n<p>\"Don't!\" Bruce cried, but it was too late. The soldiers were already pulling their triggers. </p>\n<p>\n<em>Click. Click. Click. </em>\n</p>\n<p>They looked down at their empty guns. </p>\n<p>\"Yeah, I feel I should mention the fact that I saw you guys gathering outside the city when the Avengers were called,\" Spider-Man said. \"And I overheard General Douchebag say that you were going to take Dr. Banner in no matter what. You don't really need ammo to do that, do you?\" </p>\n<p>Ross pulled out his handgun, checked to make sure it was indeed loaded, and aimed it at Spider-Man. </p>\n<p>Spider-Man jumped, a red and blue blur, as Ross fired. He shot a web with one hand, swung, and snatched Bruce with the other. Bruce yelped, then tried to cover Spider-Man's body as much as he could while Ross kept firing. Bruce wouldn't die if he got hit. Spider-Man couldn't claim the same. </p>\n<p>They finally stopped swinging twelve blocks away. Bruce staggered when he was set on the ground, his stomach lurching. He braced himself against a building. </p>\n<p>\"You okay?\" Spider-Man asked. </p>\n<p>\"I might vomit,\" he confessed. </p>\n<p>\"Sorry.\"</p>\n<p>Bruce took several deep breaths, meditating. When he was sure he wasn't going to be sick, he said, \"Thank you. For doing that.\" </p>\n<p>\"No biggy.\" </p>\n<p>\"Yes, it is,\" Bruce insisted. \"That...people don't do that. You shouldn't, either. You have a hard enough time with the cops. Don't add the military to the list.\"</p>\n<p>Spider-Man shifted his feet, suddenly serious. \"Dr. Banner, someone once told me that with great power comes great responsibility. I had the power to help you. That means I have that responsibility. It's the same reason you're on the Avengers. You don't do it for kicks and giggles, even if it is kinda fun sometimes. You do it because...you have to.\" </p>\n<p>Bruce looked at Spider-Man out of the corner of his eye. Even though the mask was still there, Bruce felt he was seeing the truest version of Spider-Man.</p>\n<p>The vigilante quickly switched topics. \"Hey, I read your thesis on gamma radiation's effects on the human body--obviously this was before the whole...uh, thing--and I was wondering if you think the same applies to enhanced bodies, like mine or Captain America's?\" </p>\n<p>Bruce stiffened. \"Why do you ask?\" </p>\n<p>\"Because if there's an emergency in, like, a nuclear plant, or something, it'd be really great to know if I was going to die or not going in there. Spiders aren't cockroaches; we don't really do well with radiation, but I'm technically a mutant and those guys tend to break the rules of science a lot, so...\" </p>\n<p>Bruce relaxed, even chuckled. \"I have no idea. I imagine you'd be able to be exposed to more radiation for longer periods of time before you started experiencing symptoms of poisoning, but I wouldn't know the exact amounts. I wouldn't go testing it, either.\" </p>\n<p>\"Eh, worth a shot.\" Spider-Man put a hand on Bruce's shoulder, tugging him away from the building. \"Come on. Let's get you back to your team. Wouldn't want you to get caught by General Douche again.\" </p>\n<p>\"Are they okay?\" Bruce demanded. </p>\n<p>\"They're fine. Just got caught in a bit of clean-up. Hulk doesn't like doing chores, does he? He left as soon as the fighting was over.\" Spider-Man grinned beneath the mask. \"Ready?\" </p>\n<p>Bruce hiccupped. \"Sure.\"</p>\n<p>Clint would just like to start off by saying he was already having a really bad day. </p>\n<p>He'd just come back from a SHIELD mission that was supposed to be only three days and ended up being eight. He hadn't slept in twenty-six hours. Fury was being a dick. Then, just as he was getting ready for bed, a team of sorcerers attacked New York and the Avengers were assembled. </p>\n<p>So Clint was firing arrow after arrow at the sorcerers and the monsters they were summoning from other worlds, and he was Not Amused. </p>\n<p>One of the sorcerers saw him and cast a spell. The roof Clint was perched on shook, then grew a mind of its own and bucked him off like a wild bull. Clint went flying. </p>\n<p>Luckily, there was a balcony just a couple stories down that he managed to grab onto. He hoisted himself up and re-surveyed his surroundings. He blinked. The bad guys and good guys had...swapped places. Weird. </p>\n<p>And his com was down. Just static fuzz in his ear. He couldn't even hear Steve barking orders. That was annoying. </p>\n<p>Clint notched and aimed an arrow. </p>\n<p>His bow was yanked from his hands by a rope of webbing. </p>\n<p>\"Hey!\" Clint reached for his backup bow, the collapsible one in his pocket. Spider-Man jumped on the balcony with him, holding up his hands. \"Don't do it, Hawkeye.\" </p>\n<p>\"You snatch my weapons in the middle of a battle and expect me not to kick your ass?\" Clint demanded. \"Whose side are you on?\" </p>\n<p>\"Yours! You were about to shoot Thor!\" </p>\n<p>\"No, I wasn't! I was about to shoot the guy in the yellow cape, the one with the giant scorpions.\" </p>\n<p>\"He's all the way over there.\" Spider-Man pointed to Natasha, who was on a giant wolf's back bringing it down. </p>\n<p>\"Is your head stuffed with webs?\" Clint demanded. </p>\n<p>\"Hawkeye, I don't know what's going on, but you just tried to shoot your teammates--\" </p>\n<p>\"Bullshit!\" </p>\n<p>\"--and your eyes are glowing blue. Which is concerning.\" </p>\n<p>Clint's blood turned to ice. He snatched a tiny mirror from another pocket and checked. </p>\n<p>\"What'd the mirror ever do to you?\" Spider-Man asked, watching it shatter at Clint's feet. </p>\n<p>\n<em>Not again not again not again not again not aga--</em>\n</p>\n<p>\"Hey, hey, Hawkeye!\" Spider-Man grabbed Clint's arms and shook him a little. \"Stay with me, okay? I think one of those sorcerers cast a spell on you. I'm gonna go take him out; just sit tight.\" </p>\n<p>\"I can't, I can't,\" Clint rambled. \"I can't do that again, I barely survived Loki, I can't, you can't make me do this, I don't want to hurt them, I don't--\"</p>\n<p>He was cut off by webbing. </p>\n<p>\"Okay, I've officially gone from annoyed and confused to full-blown freak-out,\" Spider-Man said. He plopped Clint down on the balcony. \"Sit here, sit tight, you won't hurt anyone. I'm gonna take down the sorcerer and then come back. Got it?\" </p>\n<p>Clint nodded, muted by the webbing. Spider-Man jumped off the balcony. </p>\n<p>Clint watched him punch someone who appeared to be Steve, before Natasha got him in a sleeper hold. As soon as \"Steve\" was down, Clint's vision flashed with blue, went blurry, and then re-adjusted itself. </p>\n<p>\"Steve\" was the sorcerer in the blue cloak. Clint's original target, who he thought was the one with the yellow cape, was indeed Thor. </p>\n<p>Spider-Man said something to Nat, who looked up at Clint. She made her way up the balcony while Spider-Man webbed up the unconscious sorcerer. </p>\n<p>\"He didn't make your panic attack any worse, did he?\" Nat asked, prying the webs from Clint's face. </p>\n<p>Clint shook his head. He'd managed to get his breathing under control and remind himself that he wasn't mind-controlled by Loki and he wasn't going to start shooting his coworkers and friends (who were now more of a family, not that he'd ever tell them that). </p>\n<p>The fight was over by the time Nat had Clint de-webbed and Clint had his bow back. That was fine. Even without Clint's hands shaking with nerves, he wouldn't trust himself to fire at any live targets for at least a couple of days. They made their way to ground level to regroup with the others. </p>\n<p>\"Man of Spiders, it is good to make your acquaintance!\" Thor boomed, slapping him on the back. \"Thank you for your assistance for this battle.\"</p>\n<p>\"Hey, I'm the lucky one. I'm about two seconds from completely fanboying on all of you. Fair warning,\" Spider-Man said. </p>\n<p>\"Want me to sign your spandex?\" Tony asked, lifting his face plate. </p>\n<p>\"Tony,\" Steve scolded. </p>\n<p>Spider-Man waved it away. \"Eh, he's just jealous 'cause he knows I look better in it.\" </p>\n<p>\"You wanna bet?\" Tony challenged. </p>\n<p>\"No,\" all the other Avengers said. Clint loved Tony to death, but he did <em>not</em> need to see that. </p>\n<p>\"All right, all right,\" Tony grumbled. \"How 'bout Italian, on me? Spidey, you're invited.\" </p>\n<p>Spider-Man looked like he was about to agree, when he paused. \"What time is it?\" </p>\n<p>\"Almost one in the morning. But don't worry, I know this great place that's open 24/7...\" </p>\n<p>Spider-Man shook his head. \"Can't. Other people deserve their fair share of Spider-Man.\"</p>\n<p><em>Or whoever your alter ago is</em>, Clint thought, but didn't say. The man had stopped him from killing the other members of the team (that was going to be fodder for this week's batch of nightmares, no doubt about it); he deserved his privacy. </p>\n<p>\"Are you cheating on us with another superhero group?\" Tony demanded. \"It's the Fantastic Four, isn't it?\" </p>\n<p>\"Well, Reed Richards looks almost as good as I do in spandex...\"</p>\n<p>\"Leave now, before I tear out your tongue,\" Natasha threatened. </p>\n<p>Spider-Man jumped away from her. \"Yes, ma'am.\" </p>\n<p>They watched him swing around the city's buildings until he disappeared. Clint turned to Steve and couldn't believe the words that came out of his own mouth: \"You know, the Tower has a lot of extra rooms...\"</p>\n<p>Steve blinked at him, then gave a hesitant sigh. \"We'll think about it. I'm not sure how much I trust a man who hides behind a mask.\"</p>\n<p>Steve was not a fan of Hydra, okay? </p>\n<p>Setting aside the whole Bucky thing (though that was obviously a problem), they were just so goddamn <em>stubborn</em>. They were supposed to die out in World War Two. Instead they take over SHIELD. Now they've been exposed and broken up again, except they're still running around killing and kidnapping people (Steve had destroyed five punching bags when Natasha had been taken to the hospital after her attempted kidnapping). </p>\n<p>That stubbornness was the reason Steve was in this problem right now. He'd gone into a small apartment building to meet with a contact who had a lead on Bucky. Steve had gone alone, out of uniform, without his shield. He was trying to go incognito, and the guy was trusted (actually <em>trusted</em>) by Natasha. It should have been safe. </p>\n<p>Or not. By the time Steve got there, the man was dead and there were fifty Hydra agents in the building swarming him. Not even Steve could take on that many unarmed. So after bashing a few heads, he jumped out the window. Six stories up, but thanks to the serum he didn't die or break any bones. It still hurt like a bitch. </p>\n<p>By now people were screaming and calling 911 due to the heavy gunfire. Steve ducked for cover behind a dumpster, right by a convenience store. There were a few unmarked vans parked nearby, a dozen more agents coming out. Steve growled in frustration. He was trapped. </p>\n<p>Steve pulled out his phone. The Tower was on speed dial. Tony was the one who answered. \"That was fast. Need a jet to get to your long-lost boyfriend, Cap?\"</p>\n<p>\"I need the Avengers here now!\" Steve shouted over the gunfire. </p>\n<p>That caught Tony's attention. \"I've got your location. Hang tight, Cap.\" </p>\n<p>Steve ducked as a bullet got a little too close. He put the phone away and tried to find a way out of this. </p>\n<p>The sniper who'd gotten close was suddenly gone. </p>\n<p>Steve frowned, poking his head out. The man had simply...vanished. </p>\n<p>Five agents came around the corner of the store, guns aimed at Steve. \"Stand down, Captain,\" one of them ordered. </p>\n<p>\"Wow, really?\" a voice called, before Steve could respond. \"This guy's kicked your collective asses, what, twice now? I know they say the third time's the charm, but he's got the Avengers now, with local police in the area. What exactly made you think this was a good idea?\" </p>\n<p>Spider-Man was perched on the roof of the store. </p>\n<p>One of the agents spoke into a radio, \"We have a second hostile on the store. Use lethal--\"</p>\n<p>Spider-Man jumped. So did Steve. </p>\n<p>Together, they took out the agents in seconds. Steve pulled the rifle from one of their hands and knocked him out with an elbow. \"We've gotta go!\" </p>\n<p>\"Hope you've got an iron stomach, Cap.\" Spider-Man grabbed Steve's arm and leaped into the air. </p>\n<p>They'd swung down two blocks before Spider-Man realized he had extra baggage. \"Why are you carrying <em>him</em>?\" </p>\n<p>Steve held the unconscious Hydra agent with his free hand. \"We're questioning him.\" </p>\n<p>\"Well, don't drop him!\" </p>\n<p>\"I wasn't planning on it!\" </p>\n<p>They saw Iron Man streaming by over head, then stop and do a 180. Spider-Man swung them up onto the roof of one of the smaller buildings in downtown Manhattan. Steve dropped the agent onto the floor just as he was coming to. </p>\n<p>\"Aw, come on, Spidey, I had dibs,\" Tony complained, landing on the roof. </p>\n<p>\"Well, develop your own Spidey-sense, and this won't happen,\" came the reply. </p>\n<p>\"Spidey sense?\" Steve echoed. </p>\n<p>Spider-Man shrugged. \"It's...kind of hard to describe. You ever see <em>The Sixth Sense</em>?\" </p>\n<p>\"You see dead people?\" </p>\n<p>\"No, but it's like an extra sense that tells me something bad's going to happen. Like, dangerous bad. Not 'there's heavy traffic today' bad or 'your girlfriend's gonna dump you' bad, which would've been nice...\" </p>\n<p>\"Well then what's the point?\" Tony asked. He pointed to the agent. \"We taking him to Nat?\" </p>\n<p>\"You know, I think that's one of the guys that tried to kidnap her...\" Spider-Man commented. </p>\n<p>\"I'm not sure whether I should tell her that, but if I deem the situation necessary, then I shall.\" Tony grabbed the man by the collar and hoisted him over his shoulder. \"By the way, Spidey, you should probably get those ribs taped up.\" </p>\n<p>\"Creeper!\" Spider-Man accused as Tony flew off. \"Just because that helmet gives you x-ray vision doesn't mean you should use it!\"</p>\n<p>Steve gave him a second look and realized he was favoring his left side. \"Was that during the fight?\" </p>\n<p>\"Uh...it was during <em>a</em> fight,\" Spider-Man said. </p>\n<p>\"How long ago?\" </p>\n<p>\"Last night,\" he confessed. \"Stupid drug dealer with a baseball bat. But it's fine; you have super-healing, so you get it. It'll be all patched up in a few days.\" </p>\n<p>\"Not if you keep swinging around the city carrying people, it won't,\" Steve countered. </p>\n<p>\"Well, I'm not taking the bus.\" </p>\n<p>Steve sighed. Maybe the reason he'd hesitated to talk with Spider-Man or invite him onto more team missions to feel him out as a potential Avenger was because he already recognized too much of himself in the young man. An inclination to get hurt combined with a stubborn streak a mile wide...good God, was this how Bucky had felt all the time? </p>\n<p>Remembering how well Spider-Man had responded to the idea of going to SHIELD medical after the Dr. Mad fiasco, Steve tried a different tactic: \"Well, if your healing abilities are similar to mine, you'll heal faster on a full stomach. Let's go.\" </p>\n<p>\"Uh...go?\" Spider-Man asked, watching Steve walking to the door of the roof that'd lead them to the stairs. </p>\n<p>\"There's a burger place on this block I've been meaning to try. My treat. Come on.\" </p>\n<p>Spider-Man hesitated. \"Cap, if this is some weird way of saying 'thank you,' you don't have to--\"</p>\n<p>\"It is and it isn't,\" Steve said. \"I am grateful you stepped in, and even more grateful for stepping in to help my teammates when they've needed it. But beyond that, we are two superheroes with the same goals in mind who live in the same city. I figure it's time we get to know each other, don't you?\" </p>\n<p>Spider-Man tipped his head at him. Then, \"Did you just come on to me?\" </p>\n<p>Steve made a face. \"You are worse than Stark, you know that?\" </p>\n<p>\"And prettier,\" he added, finally following Steve. \"You know, it'd be faster if we--\" </p>\n<p>\"No.\" </p>\n<p>\"Fine,\" he sighed. </p>\n<p>Steve looked at Spider-Man out of the corner of his eye as they walked down the hall of the office building (getting some very strange looks), toward the elevators. \"You grew up poor, didn't you?\" </p>\n<p>\"Huh?\" Spider-Man asked, an edge of panic to his voice. </p>\n<p>\"You're reluctant to accept any gifts or means of payment even if you've earned it, even from people who are well-off. Tony's offered to give you some tech at least a dozen times and you always turn him down, and you almost never accept anything from the people you've saved. You're definitely not rich, as you've pointed out yourself several times, so chances are good you grew up around poor people and feel guilty about taking anything from anyone even if it's freely given, because that means you're depriving them of a piece of their livelihood.\" </p>\n<p>Spider-Man stared at him. \"Did the serum give you psychic powers? If so, I'm thinking of a number between one and ten.\" </p>\n<p>\"Seven,\" Steve guessed. \"And no. I grew up in the Depression.\" </p>\n<p>\"Point. It was eight. Spider, remember?\"</p>\n<p>\"Ah.\" The elevator arrived. They got in. \"So why the mask?\" </p>\n<p>\"I'm a sucker for attention,\" Spider-Man replied. </p>\n<p>\"Nope. Try again.\" </p>\n<p>Spider-Man looked at him, then sighed. \"Do you know if I have a girlfriend?\" </p>\n<p>\"No,\" Steve said. </p>\n<p>\"Where my parents are?\" </p>\n<p>\"No.\" </p>\n<p>\"Any idea of where to find my friends and family and, say, use them against me as hostages, or hurt them to hurt me because I stuck you in jail for stealing a car?\" </p>\n<p>\"No,\" Steve conceded. </p>\n<p>\"There you go.\" Spider-Man paused. \"Plus, all this vigilante stuff is kind of illegal, so...\" </p>\n<p>Steve shook his head as they got out of the elevator, but he was grinning. \"Far, far worse than Tony.\"</p>\n<p>So the bad news was Peter was kidnapped and chained on a ship that was loaded with explosives and on its way to D.C., where the bad guys (some terrorist extremist group; Peter never got the name) were going to use him as a hostage to get something (money, probably)...and then probably kill him and blow up the ship to destroy all evidence. They also knew who he was, because they'd ripped off his mask and run him through facial recognition. Great. </p>\n<p>The good news was it was spring break, so he wasn't missing any classes, and since his aunt was out of town she didn't know he was gone and wouldn't freak out (assuming he didn't die). It was also mid-April, which meant if the ship blew up early and went down the water wouldn't be too cold. </p>\n<p>Stay positive. </p>\n<p>Peter sighed, leaning his head back against the grimy cage wall with a soft thunk. This was the down side to working alone (other than the occasional bouts of crushing loneliness that happened when Peter had problems with Spider-Man but couldn't share them with anybody because everybody who knew about Peter Parker being Spider-Man was either a villain or dead): </p>\n<p>No one was coming to get him. No one had his back. </p>\n<p>It wasn't like the Avengers, who, while definitely badass in their own individual ways, were unstoppable when they were together. If one of them went down, they all closed ranks and helped that person back up. Peter had seen it himself, when he'd taken a drugged Natasha to the hospital (Steve--he'd insisted on being called Steve after the burger joint--had almost slammed Peter into the wall demanding answers while Bruce glared at him with green eyes), after the battle with Dr. Mad (Thor had carried Tony's armor, and then Tony back to the Tower), after the thing with General Douche (it'd been all over the news: Stark Industries sued while Captain America got him dishonorably discharged), after Clint had his psychotic break with the sorcerers (Natasha hadn't left his side while Thor brought a friend from Asgard to come and make sure Clint's mind was squeaky clean), and after the Hydra shoot-out with Steve (none of them let him go anywhere on his own after that), as well as half a dozen other times. One time Ex-General Douche had managed to kidnap Bruce and bring him to a top-secret facility. Less than twenty-four hours later, that facility was a pile of rubble and Douche was rotting in a SHIELD prison. </p>\n<p>And yeah, Peter had hung out with the Avengers a few times, fought alongside them, joked around with Tony and helped Thor and Steve with modern tech, but that didn't change anything: Spider-Man was a loner. He wasn't a part of the team, so the team had no reason to care whether or not he dropped off the face of the earth. They probably hadn't even realized he was gone. </p>\n<p>Whatever. The up side to working with the Avengers every now and then was that sometimes you could pick up a few tricks. </p>\n<p>Like how to pick a lock. </p>\n<p>(That had been Natasha and Clint, during a post-attempted-alien-invasion pizza dinner. Once Peter had had it down, they'd had a racing contest to see who could break a dozen locks the fastest and...no, Peter, focus!)</p>\n<p>There was a guard standing outside the prison hold, but he was bored and playing solitaire. Peter took him out without even trying. </p>\n<p>He felt naked without his mask, but ignored the feeling. He scurried up the wall and crept along the ceiling. Getting off the ship would be good, but he had to stop it before it got to D.C. and...well, exploded. </p>\n<p>Peter considered his options, crouched in a shadowy corner of the ceiling. He could take out all the crew one by one, web them up. But then he'd have to deal with the ship. Peter may have been a smart nineteen-year-old and was on the fast track of graduating college a year early, but he'd never driven one of these things before, and it wasn't like a bike. And he couldn't just blow it up while the crew was still on it; they might be bad people, but they didn't deserve that. They deserved to be brought in, which wouldn't happen if Peter attached them to lifeboats before blowing up the ship because then they could easily escape, or drown. </p>\n<p>Peter needed help. </p>\n<p>Okay, new plan: web up the crew, then call someone on land to tell them what was up. Hopefully before they showed up Peter could find his mask--any mask--so he wouldn't blow his identity when they arrived. </p>\n<p>Satisfied, Peter got to work. </p>\n<p>--</p>\n<p>This wasn't working. </p>\n<p>If the crew had all been human, it would've been fine. But unfortunately Peter had been knocked out before spotting the guy with metal octopus limbs. Doc Oc. That was a problem. </p>\n<p>\"Ugh, didn't we do this already?\" Peter asked, ducking under another robot arm. \"We fought, I won, you went to jail. Sound familiar?\" </p>\n<p>\"I got out,\" Doc growled, thrusting another metal limb at him. Peter narrowly dodged it. \"And if memory serves, you had Tony Stark's help. I don't see him around, do you?\" </p>\n<p>Peter gritted his teeth. He knew he couldn't win this. Doc Oc was a tough fight even on a good day, and this was so far from a good day that it wasn't even funny. Peter considered just going overboard and swimming to shore, but shore was at least fifty miles away, just a thin line on the horizon. Maybe he could make it, but...</p>\n<p>But he hadn't been able to contact anyone on land yet. He HAD to do that, before anything else. </p>\n<p>Peter feigned a jump to the left, then dove right, summersaulting under Doc Oc's limbs and racing to the quarterdeck. He needed a radio, a cell phone, something! </p>\n<p>Metal clamped around his ankle. </p>\n<p>It went south very fast. </p>\n<p>Doc Oc smashed him into the deck, then some metal crates, then the deck again. He did this about half a dozen times before Peter lost count and was just trying to keep his head from getting bashed in, which was getting harder and harder. </p>\n<p>At one point, Doc Oc paused. Peter pushed himself up on wobbly arms and spat out a mouthful of blood and tried to string a thought together. He heard something like an engine getting closer. A plane, maybe? </p>\n<p>\"Say hi to your friends for me,\" Doc said. He smashed Peter into the crates one more time--hard--before swinging him off the ship. He went flying through the air and hit the water. He had already blacked out. </p>\n<p>--</p>\n<p>\"...no pulse...\" </p>\n<p>\"...not breathing...\" </p>\n<p>\"Come on, kid, you've gotta help me out here...\" </p>\n<p>\"Careful of the broken bones, Clint!\" </p>\n<p>Peter gasped, eyes snapping open. It was way too bright, he couldn't see. Couldn't really breathe, either. Someone rolled him on his side and he threw up half of the Atlantic. </p>\n<p>The person who rolled him over was now rubbing his back. It was so incredibly soothing, cutting through everything else that <em>hurt</em>, that Peter was pathetically grateful. </p>\n<p>\"Thatta boy, just breathe for me, okay? Nat's gonna land us and we'll get you patched up in no time.\" </p>\n<p>Clint. That was Clint's voice. What the hell was Hawkeye doing here? </p>\n<p>\"Saving your ass,\" someone else answered (oh, he'd spoken out loud?), \"although I had something to do with it, too. Lucky for you, this suit does okay in water, so we didn't both drown when I hauled you out of the ocean. You're heavier than you look, you know.\" </p>\n<p>Peter managed to tilt his head enough to see Tony, the Iron Man faceplate off. He was wearing a worried smile. \"Had a little too much fun with Doc Oc, didn't you?\" </p>\n<p>It all came rushing back to Peter. He gasped, and tried to sit up. But his own muscles were being a bitch, and Clint was pinning him down, too. \"Whoa, whoa, hey! Easy! Relax!\" </p>\n<p>\"Doc Oc!\" Peter wheezed. \"He's gonna...bombs...in D.C.\" </p>\n<p>\"We know, we know,\" Clint eased. He was practically sitting on Peter, one hand on his shoulder while the other hand was on Peter's cheek, keeping his focus on Clint. \"He has the ship loaded with C4. He was going to blow it up after using you to collect ransom money. Thor, Hulk, and Steve are all on it. If they need backup, Tony has their back, and Nat and I'll turn this quinjet around and give a hand, too. Doc Oc isn't going to get anywhere or blow up anything. Promise.\" </p>\n<p>His words were getting a bit fuzzy near the end there, but they sank into Peter's skin and calmed him down. He was getting dizzy, everything swimming around him. He needed a nap. </p>\n<p>Tony looked panicked. \"Wait, Spidey, don't go to sleep! You're concussed and I think you have internal bleeding and...goddamn it!\"</p>\n<p>--</p>\n<p>When Peter came back around for good, he was lying in bed. </p>\n<p>For a second, he thought it'd all been a dream. But this wasn't his bed at Aunt May's, or the empty bunk Mary Jane sometimes let him crash on at the university after a study binge. This bed was huge, for one thing. Hulk could've slept in it. And the sheets were unbelievably soft with a ridiculous thread count. Was he at a five-star hotel or something? </p>\n<p>Peter managed to get his eyes open and look around. It certainly looked like a hotel room. Well, a suite, more like. But he couldn't see any logos. </p>\n<p>His Spider-Man outfit was folded up on a chair. Peter got up on shaking legs and, after surfing over a wave of dizziness, went to it. It was clean, almost brand new clean, with all the holes from the latest fight stitched up. Someone had even ironed it. They'd gotten his mask, too. </p>\n<p>The knock on the door made him jump. He took a brief glance down to make sure he wasn't naked (he was wearing sweats and an Iron Man t-shirt that was similar to the one he had back home). \"Yeah?\" </p>\n<p>Steve poked his head in the room. \"Hey. How are you feeling?\" </p>\n<p>\"Um...less shitty than the last time I woke up. Did you get Doc Oc?\" </p>\n<p>\"He's in custody, with all of his accomplices.\" Steve came into the room and sat on the edge of the bed. \"We need to talk, Peter.\" </p>\n<p>Peter froze. </p>\n<p>\"Sorry,\" Steve said. \"There were some computer files on the ship that I grabbed on the way out. Doc Oc had your identity on there. But don't worry, we wiped them. Nobody outside the Avengers know.\" </p>\n<p>Peter relaxed. Slightly. He set his uniform on the dresser and sat on the chair. \"How long was I out?\" </p>\n<p>\"Three days. We were a bit worried about the broken bones and some slight internal bleeding, but the bleeding stopped and healed itself up within twelve hours. The bones should be at least halfway mended by now.\" </p>\n<p>All of Peter's limbs were functional, though his ribs hurt like a bitch and he was pretty sure his left wrist was sprained. \"Three days, huh?\" </p>\n<p>\"We called your aunt, disguised as a friend,\" Steve continued. \"You have the flu, but Tony--your friend from biology class--is taking care of you.\"</p>\n<p>The last of the tension in Peter's body melted. His identity was safe, Aunt May was safe, and Doc Oc was taken care of. \"Thanks.\" </p>\n<p>\"It's no problem, Peter,\" Steve said, smiling. </p>\n<p>\"How'd you find out about the ship?\" Peter asked. \"I hadn't even called anyone yet.\" </p>\n<p>\"Someone saw you getting kidnapped and reported it,\" Steve answered. \"We tracked you down as soon as we could.\" </p>\n<p>Peter was floored. Any words he might've said in response to that went right out the window. He couldn't remember a time of anyone going out of their way to save him. </p>\n<p>Steve didn't seem to notice. He continued: \"Which brings me to what I wanted to talk about. Don't make any decisions right now; you're still recovering and it's a big choice to make. But the team and I have been discussing it for a few weeks now, and we would like to invite you to join the Avengers.\" </p>\n<p>Of all the things Peter had thought would come out of Steve's mouth, that had not even made the \"least likely\" list. </p>\n<p>\"Peter?\" Steve asked, concern in his voice. </p>\n<p>Peter blinked out of his stupor and managed a smile. \"Uh, sorry. I think my head's still screwed on backwards. I'm gonna need you to repeat that in a few days when I'm pretty sure I'm not hallucinating from my concussion.\" </p>\n<p>Steve returned the smile. \"That seems fair. For now, though, we do insist that you stay here for another day, just to make sure everything's okay health-wise. Bruce especially wants to take another look at you before you go; Hulk wasn't happy to see you go down.\" </p>\n<p>Peter was still about 80% sure he was hallucinating. But he stood and followed Steve out of the room, through Avengers Tower (holy shit, he was in Avengers Tower, he was going to have a fanboy stroke), and to a general living area. The other Avengers were there, Clint and Natasha fighting over the remote while Thor ate poptarts, Bruce read a book, and Tony fiddled with a tablet. </p>\n<p>They all jumped on Peter when he walked in. They called him Peter, not Spider-Man. Bruce pushed the others away so he could check his pupils. Tony offered him something to drink. Thor gave him a poptart. Clint gave him the remote. Natasha told him they were even now and he got to be the damsel next time. </p>\n<p>Joining a team...might not be a bad idea. </p>\n<p> </p>\n<p>END</p>"
}