{
  "id": "7738513",
  "url": "https://archiveofourown.org/works/7738513?view_full_work=true",
  "author": [
    "nonna"
  ],
  "title": "Trembling Lips",
  "rating": "General Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Voltron: Legendary Defender"
  ],
  "relationships": [
    "Hunk & Lance (Voltron)",
    "Lance & Blue Lion",
    "Keith & Lance (Voltron)",
    "Lance & Pidge | Kate Holt",
    "Lance & Shiro (Voltron)"
  ],
  "characters": [
    "Lance (Voltron)",
    "Hunk (Voltron)",
    "Pidge | Katie Holt",
    "Pidge (Voltron)",
    "Shiro (Voltron)",
    "Keith (Voltron)",
    "Allura (Voltron)",
    "Coran (Voltron)"
  ],
  "additional_tags": [
    "Lance is an emotional guy",
    "who tries to control his panic and sadness by distracting himself with jokes and rambling",
    "Homesick Lance (Voltron)",
    "Hunk/Lance (Voltron) Friendship",
    "Latino Lance (Voltron)",
    "5+1 Things",
    "5 Things",
    "Implied Galra Keith",
    "Hurt Lance (Voltron)",
    "Langst",
    "Angst",
    "Emotional Hurt/Comfort",
    "lance is suffering"
  ],
  "language": "English",
  "series": "",
  "published": "2016-08-11",
  "completed": "2016-08-25",
  "words": "17,877",
  "chapters": "6/6",
  "comments": "593",
  "kudos": "11,029",
  "bookmarks": "1,890",
  "hits": "118,464",
  "summary": "<p>Lance is an emotional person who cries easily (and does the trembly-lip thing a lot) but tries to stay strong in front of the team.</p>\n<p>OR</p>\n<p>Five times Lance stopped himself from crying in front of his teammates, and the one time he couldn't hold it back.</p>\n<p>Lance falls under the illusions of Haggar's lies.</p>\n<p>Lance cares about his teammates ; u ; (more than he cares about himself).</p>\n<p>Lance gets sick ; u ;</p>\n<p>Lance is homesick. </p>\n<p>They're all homesick.</p>\n<p>Lance cannot hold back his tears.</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a>.)</p>\n<p>So just to clear up a few things before you guys read the chapter:</p>\n<p>- This does not directly follow the last chapter. That being said, it does not negate the ending of the previous chapter, of Lance's self-doubts (that is mainly something that will grow with this fic, and will be touched upon in a later chapter more specifically).</p>\n<p>- I'm getting carried away with plots, lol! I know the fic is focused mostly on Lance crying, but I felt that doing 5 scenarios of Lance randomly crying would not be as entertaining as perhaps making it part of his struggle in the overall chapter. I hope this is something you like?</p>\n<p>- Implied Galra Keith, but the team (including Keith) have no knowledge of it... Only Haggar does.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_2_endnotes\">more notes</a>.)\n</p>\n<p>I had so many ideas that grew with writing this chapter, and I feel like it's something that I could definitely move to a whole fic of its own later on if you guys like it enough. So if you do, please leave a comment or message me on tumblr @daminwayne letting me know if you would be interested to see the after effects of Haggar's revelations with Galra Keith and the doubts Lance will face!!</p>\n<p>I hope you enjoyed xx</p>\n<p>Prepare the blankets and the hot chocolate!!</p>\n<p>A bit of a longer chapter for you guys today :p one of my personal favourites so far!</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">more notes</a>.)\n</p>\n<p>Ahhh what did you think?</p>\n<p>Yay last chapter!!! Lance finally crying ; u ; but not without more pain oops.</p>\n<p>Please note, this goes on a weird deviation to the season 1 finale. I wanted it to have the similar conflict, but keep it tied up with my previous chapter.. and so you got this interesting situation.</p>\n<p>Enjoy!</p>\n<p>please let me know what you think!<br>all comments/kudos/subscriptions are greatly appreciated!! </p>\n<p>+ You can find me on tumblr @ daminwayne! :)</p>",
  "text": "<p>“Damn it, Lance,” Keith curses, running a hand through his hair. “This is serious, alright? Shiro is on the bench for this mission, that doesn’t mean you get to goof around and mess this all up.”</p>\n<p>Lance pushes down his irritation, but can’t help but bite back with, “also doesn’t mean you need to pretend to be Shiro.”</p>\n<p>This mission is taking a bigger toll on them than they would like to admit. Shiro had been injured in the previous mission, and had only been out of his healing pod for twenty minutes before another distress call sounded nearby. They had assured Shiro they could handle it without him, but now…</p>\n<p>Lance shakes his head. No, they can handle it. They <em>will</em> handle it. He’s totally not freaking out. Not panicking. He’s calm and collected, and he knows what he’s doing. <em>Lance</em> panicking? Pssh. Yeah, right. As if.</p>\n<p>“Maybe we can attack it from below, you know? Like, like maybe we can distract it by going around and around and around in circles until it gets like, dizzy? And then we attack it before it has a chance to stand still and––and you know, regain its senses, I don’t know, maybe, maybe Blue can ice it again, or maybe,” He’s definitely <em>not </em>rambling because he’s panicking, nope. “Maybe we can like, trick it into––”</p>\n<p>“Lance, for God’s sake!” Pidge shouts, distraught. “We need to focus, okay?”</p>\n<p>“Okay!” Lance exclaims, exasperated. “Okay! But if you haven’t noticed, we can’t exactly form Voltron right now! I mean if we could, then I could have used my bayard and we could have used it to shoot the heck out of this monster but––but Shiro’s not here, and we can’t form Voltron, and I’m trying to think of ideas!”</p>\n<p>If the other paladins notice his voice growing shaky and loud towards the end, they don’t comment on it. Instead, Keith brings Red to a halt and grounds out, “We’re all aware of that, Lance, but if you don’t have anything useful to contribute, then keep it shut.”</p>\n<p>Lance’s jaw clenches, and he exhales heavily through his nose.</p>\n<p>Then it occurs to him: the monster’s only using its right arm for attack, and its left arm for defence. If they can disable its defence system, then it would be vulnerable for attack on its left side, which would give them time to also distract it before it could fire again…</p>\n<p>“Hey, guys, I think I got an idea,” he says.</p>\n<p>He thinks he can hear Keith mutter something under his breath.</p>\n<p>“No, seriously,” Lance pushes on, shaking his head. “Look, it’s only using its left side for defence, and it’s right arm for attack, so if Hunk and I try to disable its––”</p>\n<p>But no, apparently the team has other ideas. Okay, that’s totally cool. Lance is not going to comment on how Keith, Pidge and Hunk all decided to attack the robot’s head (which they’ve <em>already tried</em>, but look how that went), leaving Lance behind, unsure of where to aim.</p>\n<p>So Lance decides to aim for left arm. Maybe that will make it more vulnerable to attacks from the other paladins, and it may distract it from them momentarily.</p>\n<p>But as he is Lance, and as the universe is never on his side, his plan for “distraction” ends up with his lion spiralling straight down to the ground after a turbo blast aimed right for it.</p>\n<p>“Lance!” Hunk calls out in concern. “You okay?”</p>\n<p>“Yeah,” Lance tries to reassure them, gulping nervously. He takes a look back up at the robot now towering above him, and notices that his attack, at least, had worked. Its left side is completely open. “Its left side is vulnerable, you guys should––ah, shit!”</p>\n<p>Blue crashes into the ground, hard, and Lance is thrown out of his seat. His shoulder collides with the wall, and he bites back against a scream as he feels a <em>pop</em>. He shuts his eyes, inhaling through his teeth, praying that that is <em>not</em> a dislocated shoulder.</p>\n<p>“Lance?” It’s Keith now, and Lance is surprised to hear the hint of concern lacing his voice. “You alright down there?”</p>\n<p>“Great,” Lance mutters, pushing himself to stand up. Yep, that is definitely a dislocated shoulder. And it hurts.</p>\n<p>A lot.</p>\n<p>He walks back to the cockpit, but before he slides back into the seat, he hears the other paladins calling out for him in alarm. When he looks out the window––technically, Blue’s eye––to see what’s going on, he feels his heart drop.</p>\n<p>Another turbo blast, headed right towards Blue.</p>\n<p>Before Lance can react, the turbo blast hits them, and the lion rolls over across the harsh terrain, taking quite the beating when it begins to roll down a hill.</p>\n<p>Lance takes an even worse beating, however, when he is sent to the other side of the cockpit, crashing against the wall, and <em>ow</em>, his shoulder, that <em>hurts</em>. Then he falls forward when Blue rolls over again, then falls back, then he’s thrown across the cockpit <em>again</em>––</p>\n<p>He doesn’t know how long it goes on for, only that when Blue finally stills, he rolls over to his side and vomits. His head is thumping, and black is dancing around the edges of his vision. Sometime during the process, his helmet had fallen off his head, now lying across from him with a crack running down its centre.</p>\n<p>His shoulder is burning, his ankle is pulsing with pain, his head hurts and he wants to throw up again… Sitting up is not something he even wants to <em>think about</em>, but he can hear his teammates calling for him through the coms. He just has to reach his helmet. Simple.</p>\n<p><em>You can do it, Lance</em>, he tells himself, and rolls over onto his stomach before pushing forward and crawling over to his helmet.</p>\n<p>His entire body screams in protest, but finally, he reaches the helmet. “Guys?” He croaks.</p>\n<p>“Lance!” It’s Shiro. When did Shiro get on the coms? “Are you alright?”</p>\n<p>Lance remains quiet for a few moments, contemplating an answer. Is he alright? No, not really. His lip begins to tremble as the pain washes over him, and he shuts his eyes. But he can’t tell Shiro that, can’t let him down––It was the <em>one</em> mission they had without him leading, and wasn’t it enough that Lance had gotten himself into this mess? “I’m good,” he lies in a small voice.</p>\n<p>Shiro pauses, skeptical of the boy’s answer, but lets it slide. “Okay. We’re heading your way now, with the castle. Can you fly Blue?”</p>\n<p>Shit. Can he? Lance closes his eyes, searching for the bond with Blue, searching for his lion’s thoughts. Can she fly?</p>\n<p><em>Yes</em>, he feels her say, albeit tiredly. He’s never felt her this tired before.</p>\n<p>“Yes,” he echoes to Shiro. Then, after a deep inhale, he pushes himself up to his knees, shutting his eyes when all he can see is black. <em>Inhale, exhale</em>. Slowly. Regain your footing. He opens his eyes again, then bites down on his lip when he grips the arm of the pilot chair and pushes himself to stand up.</p>\n<p>“Let’s do this, mi amore,” he whispers to Blue, and the seat slides back closer to the control panel, which glows at his touch.</p>\n<p>The flight is wonky, at best, but Lance manages to reach the castle. What he expects when he finally makes it to the ramp is to be carried off to the healing pod, where he can actually relax and sleep for as long as he needs to.</p>\n<p>What he does not expect is for the entire team to be scowling at him, and certainly not for Keith to rush over to him only to jab a finger into his chest.</p>\n<p>“What the Hell, Lance?” Keith is angry. Why is he angry? “Why don’t you ever listen to us? We were all attacking its head, and you––you decided to attack its arm! You didn’t help us, and you left yourself open for attack!”</p>\n<p>Lance flinches, his growing headache definitely not appreciating Keith shouting at such a close proximity. “You didn’t even <em>say</em> what you were planning to do! I was telling you we should attack its defence, ah,” his ankle throbs painfully again, “and you guys were just off attacking the head again!”</p>\n<p>“Well, we didn’t say it, but we all agreed on it,” Hunk chimes in, “you know, through the lions’ bond. It was like we all had the same idea, and then it was like we all just decided to go for it.”</p>\n<p>Pidge furrows her eyebrows. “You didn’t feel that?”</p>\n<p>Lance lets out a sharp breath, and looks down, shaking his head… which proves to be a bad idea when the world begins to tilt around him, and his nausea begins to creep up again. “No, I didn’t, and apparently you guys didn’t hear me trying to offer a better plan.” He argues weakly.</p>\n<p>“Of course you didn’t feel it,” Keith snaps, crossing his arms. “You weren’t taking the mission seriously!”</p>\n<p>“The paladins…” Allura hesitantly adds. “The paladins should all be able to feel this.”</p>\n<p>Oh, okay. Lance gets it. Paladins should feel it, and he didn’t, and it was his fault that the team decided to follow through with a dumb plan instead of listening to him, and it’s his fault that he can barely stand on his feet and his shoulder is hurting and his head feels like it’s about to burst open, yeah, okay. No, he gets it.  </p>\n<p>“Look, maybe you just need to work harder on your bonding,” Pidge says. “In another mission… that could have cost someone their life. We need to all be able to communicate through our bond, Lance, and if you can’t, then it might really hold us back.”</p>\n<p>His lip begins to tremble again, and Lance wants to curse this habit, wants to curse the fact that he has no control over it. He closes his eyes, and as he lets out the next breath, he drops to his knees, unable to keep himself upright any longer.</p>\n<p>If his mom had been here, then she would have led him right inside, laid him down on his bed and made him some soup and gave him some painkillers… She would have hugged him tight and… and <em>then</em> she would have disciplined him…</p>\n<p>But he’s in space now, he’s a defender of the universe.</p>\n<p>He lifts his eyes slowly, and when they meet with Shiro’s, he drops his gaze immediately.</p>\n<p>He can’t cry, not in front of his hero. Not in front of the team that already considers him to be their weakest. So he shuts his eyes, and tries to even out his breathing. He’s not going to cry.</p>\n<p>“I’m sorry,” he whispers instead. But Keith does not look smug when his eyes meet Lance’s; Instead, he looks very worried.</p>\n<p>“We should bring him inside,” Shiro says, limping closer to Lance. “You don’t look so great, kiddo.”</p>\n<p>“I always look great,” Lance fires back, attempting one of his big, toothy grins. It falls right off when Hunk touches his shoulder, however, and he hisses out in pain.</p>\n<p>“Oh, jeez, I’m so sorry.” Hunk apologizes. “Hey, do you think you could put your arms across my neck? You don’t look like you can walk very much, and I don’t want to carry you if your shoulder is hurting… so maybe I can give you a piggy-back ride, just like our days back in the garrison?”</p>\n<p>Lance nods, licking his dry lips, and wraps his good arm around Hunk’s neck when his friend gets into position. Pidge and Keith help him wrap his legs around Hunk’s waist, and Lance curls in on himself, shying away from their touch.</p>\n<p>He must look terrible if even <em>Keith</em> had stopped snapping at him.</p>\n<p>But as they make their way back to the castle, Lance cannot stop thinking about the fact that he could not feel the team’s bond.</p>\n<p>Was he really not meant to be part of this team?</p>\n<p>Allura had assured them that this would be nothing but a simple mission: jump onto the planet, attack what appeared to be a small fleet of Galran robots, bring safety and peace to the civilization…. the normal stuff. It was nothing new; Lance would have no problem shooting down a few Galran robots. He might even enjoy it!</p>\n<p>What Lance <em>does</em> have a problem with is the creepy Galran woman standing in front of him. She’s dressed like a witch––no, scratch that, she probably <em>is</em> a witch. A Galran witch. The same witch Shiro had mentioned?</p>\n<p>Oh. That’s probably not good.</p>\n<p>“Shiro,” Lance whispers into the coms, taking a cautious step back, his bayard gun trained on the witch. He receives no answer. “Guys!”</p>\n<p>After a few moments of the static cackling in his hears, Shiro’s voice sounds again. “Lance?”</p>\n<p>Lance breathes out a sigh of relief. “The weird Galran witch is here, and she’s staring at me. Like, directly into my eyes, and this is very unnerving…” He takes another step back. “Um, what do I do? I’m kind of trapped. Do I kill her? I mean, that shouldn’t bring me years of bad luck, right? Do I get cursed if I murder a witch?” Oh no, he’s rambling again. He gulps nervously. “But seriously, what do I do?”</p>\n<p>“Of course you can’t kill her!” Shiro hisses, and Lance flinches in surprise. “You stay put where you are, Lance.”</p>\n<p>Lance’s back hits the wall behind him, then, and he begins to feel his panic rising. The witch seems to be approaching him without actually… walking. It’s almost as though she’s floating towards him. “Okay… Hey, Shiro? I really don’t know what to do.”</p>\n<p><em>I’m scared</em>.</p>\n<p>“Of course you don’t,” chimes Pidge. “When do you ever know what to do?”</p>\n<p>Not helping, Pidge. Not helping.</p>\n<p>“Look, Lance,” Shiro says, and he sounds tired. Very tired. “We have a lot of things to cover over here––can you stall for a while? Just keep her busy. We need to get those civilians to safety. Can you do that for me?”</p>\n<p>Lance nods shakily to himself, gaze still locked with the witch’s. “Of course, Shiro.”</p>\n<p>He can hear Keith snort, and he can’t help but bite out with: “This isn’t funny, Keith!”</p>\n<p>Because for once, it’s not.</p>\n<p>It’s terrifying.</p>\n<p>Why is the witch staring at him? Why is she not attacking him, or speaking, or… you know, doing creepy witch stuff, like pulling out a wand or riding away on a broomstick?</p>\n<p>“Sure it is.” Keith argues. “It’s just funny that Shiro thinks you can handle that task.”</p>\n<p>Lance shuts his eyes, forcing himself to take a deep breath. <em>Don’t let him get to you</em>, he thinks. <em>Don’t let him get to you. You can do this, you can prove to all of them that you can handle this.</em></p>\n<p>But why doesn’t Shiro want the witch dead?</p>\n<p>“We’ll be on our way soon,” Shiro then reassures him. “Just stay with her, okay? Keep her busy.”</p>\n<p><em>Keep her busy, keep her busy. How am I supposed to do that! And why should I stay with her?</em> Lance wants to shout. But he doesn’t, because that would be proving to Keith that he doesn’t know how to handle the situation––and he can! He totally can, and he will.</p>\n<p> </p>\n<p> </p>\n<p>“Um, what do I do? I’m kind of trapped. Do I kill her? I mean, that shouldn’t bring me years of bad luck, right? Do I get cursed if I murder a witch?” Lance asks nervously. “But seriously, what do I do?”</p>\n<p>“Oh, no,” Shiro mutters. “Lance, you have to get out of there.”</p>\n<p>“Okay… Hey, Shiro? I really don’t know what to do.”</p>\n<p>Shirt’s heart clenches. Lance’s voice is small, so small, and he sounds scared. Shiro had seen the witch, had been under her spell himself… He does not want Lance to suffer through it.</p>\n<p>“Don’t worry, Lance, we’re almost done here.” Pidge chimes, sliding under a robot and zapping it in the back with her weapon.</p>\n<p>“Look, Lance,” Shiro says, attempting to hide the tinge of fear in his voice. “We’re on our way, yeah? Try to slip past her if you can. Fight her if you need to, but focus on escaping. We’ll be there soon. Can you do that for me?”</p>\n<p>“Of course, Shiro.” Comes Lance’s reply. He’s clearly attempting to sound more confident than he probably feels––and Shiro can respect that. Then: “This isn’t funny, Keith!”</p>\n<p>Keith, who is on an entirely different sector, furrows his eyebrows as he kicks off another alien. “What? Lance, I didn’t even <em>say</em> anything.”</p>\n<p>Lance doesn’t answer, but they can hear him inhale deeply.</p>\n<p>Shirt exchanges a worried glance with Hunk, who’s fighting by his side, and promises: “We’ll be on our way soon, Lance.”</p>\n<p> </p>\n<p> </p>\n<p>“So… You’re a Galran witch?” He pipes up, sounding a lot less confident than he would have liked.</p>\n<p>“Yes,” she answers, and Lance jumps in surprise. Her voice is… <em>inside</em> his mind, somehow. He shudders. “My name is Haggar.”</p>\n<p>“Haggar,” he muses, fingers tightening around the weapon in his hands. “What a lovely name. You, uh, work for Zarkon?”</p>\n<p>“I prefer to say I work with him,” Haggar says, a corner of her lips moving up slowly. “But you cannot say that about your princess, can you? You work for her, like slaves. I suppose you will not understand my status with Zarkon.”</p>\n<p>“Hey, that’s not––that’s not true!” Lance argues. “We’re a team. We’re a great team, and we’re going to bring you down, lady. You and Zarkon. You can’t stand a chance against Voltron.” His voice is a bit shaky, but he manages to build more strength into it.</p>\n<p>“A team?” She sounds amused. “A team with a Galran hybrid as your leader, with a Galran child riding the red lion.”</p>\n<p>Lance cocks his head to the side. “What are you talking about?”</p>\n<p>A Galran child riding the red lion?</p>\n<p><em>Keith</em>.</p>\n<p>“You’re messing with me,” Lance decides, raising the gun again.</p>\n<p>“I have no reason to ‘mess with you’, Blue Paladin,” Haggar says, and Lance can almost feel her rolling her eyes. “It simply pains me to see a child, such as yourself, fighting valiantly for a lost cause.”</p>\n<p>“It’s not a lost cause,” Lance grounds out.</p>\n<p>“Isn’t it?” Hangar asks, raising a hand to her chin. “Are you fighting against the Galra, or are you fighting with them?”</p>\n<p>Lance raises an eyebrow, taken aback by the question. “Of course I’m fighting the Galra!”</p>\n<p>“Wrong,” she murmurs. “You truly sadden me, child. Step out, Shiro.”</p>\n<p>When Shiro steps out from the shadows behind the witch, Lance feels nauseous. Shiro looks different––darker, somehow. His eyes meet Lance’s, and he smiles apologetically before shutting his eyes. When he reopens them, they are blank, they are yellow.</p>\n<p>They are Galra eyes.</p>\n<p>“Shiro?” Lance whispers in horror.</p>\n<p> </p>\n<p> </p>\n<p>“What is he doing?” Hunk asks. “He’s talking to the witch!”</p>\n<p>They can hear Lance’s side of the conversation through their coms, but they cannot hear whatever the witch is telling him.</p>\n<p>Then Shiro hears Lance call out his name in disbelief, and his stomach drops. “Yes, Lance? I’m here. I’m here, kiddo. We’re on our way, I promise.”</p>\n<p>“What the Hell, Shiro!” Lance exclaims, then, and Hunk startles. He turns to look at Shiro, confusion evident in his eyes. Shiro can only answer him with an equally puzzled look.</p>\n<p>“Lance, talk to me, buddy. What’s going on?” Shiro presses, speeding his pace and pushing his way through the rubble.</p>\n<p>“You––God, I can’t believe this. No,” Lance is saying, “No, you can’t… Shiro…”</p>\n<p>Realization dawns onto Shiro. “He’s under the witch’s control. We need to hurry!”</p>\n<p>Hunk nods, hurrying alongside the older man.</p>\n<p> </p>\n<p> </p>\n<p>“Lance, I’m sorry it had to come to this,” Shiro says. “But it’s time you knew the truth.”</p>\n<p>“What the Hell, Shiro!” Lance exclaims, heart beat growing erratic.</p>\n<p>Shiro then steps closer to him, and Lance pushes himself closer to the wall behind him, nearly curling in on himself. He doesn’t lower the gun, however.</p>\n<p>“Lance… I’ve really grown to like you. You’re a great pilot, you’re trustworthy. I would rather have you fight by my side than be my enemy, and I think you have a lot of potential to give to the Galran army. Eventually, we will have to destroy Allura and Coran, we will use Voltron to fight alongside Zarkon… and we cannot do that without you, Pidge and Hunk. We need you to be our pilots.”</p>\n<p>“You––God, I can’t believe this. No,” Lance wispers, “No, you can’t… Shiro…”</p>\n<p>“All those team building exercises proved to me that we can fight well together as long as we have a common enemy. We needed Allura to find the lions,” Shiro explains, and Lance finds that he has to look away from his yellow eyes. “However, she convinced you that Zarkon was the enemy… and to keep the lions, to keep <em>us</em> as a team, we needed to play along with her for a while.”</p>\n<p>“Shut up!” Lance shouts, shutting his eyes tightly. “Just shut up!”</p>\n<p>“Think about it, Lance! Look at this place. The Galran robots we fought were nothing more than guards to protect this planet and its people.” Shiro shakes his head. “Rover blew up the crystal that day not because of Pidge, or because of Galra… but because of Allura. She was the only one who had the knowledge to re-program Rover. You jumped in to save Coran, didn’t you? And yet we found him lying meters away from you, from the explosion…”</p>\n<p>Lance slides down against the wall, and the gun dematerializes back to the idle bayard. “Shut <em>up</em>, Shiro.”</p>\n<p>“Why do you think the red lion was on board the Galran ship? Why do you think I never cared to take back the black bayard from Zarkon?” Shiro prompts, crouching next to Lance. “Think about it, Lance. The truth has been right there, the whole time.”</p>\n<p>“I told you, he’s too stupid,” comes Keith’s voice. Something about it sounds more rough. “Look, Shiro, I said this before and I will say it again: maybe Lance isn’t the right guy for this mission. Look, Pidge and Hunk are already on board… Lance is too oblivious to details, he’s––”</p>\n<p>Shiro chuckles. “He won’t be this way once he begins training with us, Keith. After all, he’s never seen us in the training deck together, using our Galran enhancements and blood… But now he will, and he will understand our strength, our purpose.”</p>\n<p>“He’s not going to see anything if he keeps his eyes shut like a coward,” Keith glowers.</p>\n<p>Lance opens his eyes slowly, hesitantly, and inhales sharply when he’s met with Shiro’s yellow eyes once again. They’re not gone. His eyes then snap to the left, where he could hear Keith’s voice coming from and his stomach drops.</p>\n<p>That’s not Keith.</p>\n<p>It can’t be.</p>\n<p>“Keith, you’re…” <em>Galra… </em>But he cannot bring himself to say it. Instead, he stares at the man––creature–––standing before him, purple skinned and yellow eyed… and yet, the same smirk continues to line his lips.</p>\n<p>“Galra, yes.” Keith confirms, crossing his arms. “Half-Galra, anyway.”</p>\n<p>Lance’s arm wraps tightly around his knee, and the bayard drops from his grip.</p>\n<p>Shiro leans in closer to him, and grips his shoulder gently. “It’s too much for him to take in. We should give him some time to process it.”</p>\n<p> </p>\n<p> </p>\n<p>“Lance? Lance!” Shiro calls out, running into the room. The witch is absent; she must have left as soon as she heard their incoming footsteps. Lance, however, is sitting on the ground, a knee on the ground and the other acting as a rest for his forehead.</p>\n<p>“Lance, can you hear me? We’re here now, yeah? You’re okay, the witch is gone.” Shiro attempts to soothe.</p>\n<p>“Shut <em>up</em>, Shiro.”</p>\n<p>“Lance!” Hunk calls out, running into the room. He pauses, however, at the sight. Pidge and Keith follow, not too far behind.</p>\n<p>“Lance, whatever you’re seeing is not real.” Shirt tells the younger boy. How did Haggar’s magic manage to continue even after she had left? Hopefully it would not go on for much longer.</p>\n<p>“Lance, you okay?” Keith asks, stepping into the room. He turns to Shiro. “The witch got to  him?”</p>\n<p>“Seems like it.” Shiro confirms, jaw clenching. “Lance?”</p>\n<p>Lance then opens his eyes, slowly, and looks at Shiro. His eyes widen before snapping over to Keith, whom he gapes at. “Keith, you’re…”</p>\n<p>Keith furrows his eyebrows again, lost. “I’m… what?”</p>\n<p>Lance’s dematerialized bayard drops to the ground, and Shiro frowns, gently placing a hand on Lance’s shoulder. “Lance, kiddo, it’s me, Shiro. Whatever you’re seeing, it’s not real, yeah?”</p>\n<p>Lance remains tense, trapped in whatever vision the witch had laid onto him. Shiro lets out a heavy exhale, and leans in closer, wrapping Lance in his arms. Hopefully a hug would help him snap out of it.</p>\n<p>He can feel Lance’s breathing grow more laboured, and he wraps him tighter. “Lance, buddy, you’re good, you’re okay. Whatever Haggar made you see is not real.”</p>\n<p>“Lance?” Pidge calls out cautiously, stepping closer. “We’re here. I’m sorry we couldn’t make it sooner.”</p>\n<p>Lance looks up at that, and there seems to be a hint of recognition in his eyes. “Pidge?”</p>\n<p>Pidge beams at the recognition, and she crouches next to him and Shiro. Keith and Hunk follow suit. “Yeah, it’s me. How are you feeling?”</p>\n<p>The whites in Lance’s eyes begin to turn slightly red, and his lower lip trembles, ever so slightly. Hunk, unable to watch his friend like this any longer, joins the hug with Shiro. “Hey, whatever she showed you, it was all lies, man. You know that, right?”</p>\n<p>Shiro studies Lance carefully, and a painful feeling tugs at his heart at the sight.</p>\n<p> </p>\n<p> </p>\n<p>When Lance hears Pidge’s voice, he looks up again. Sure enough, Pidge and Hunk are standing there… and the witch is gone. “Pidge?” He croaks.</p>\n<p>Keith, too, stands next to them… but he looks human again.</p>\n<p>Lance’s eyes dart over to Shiro, and he sighs in relief at the sight of his grey irises.</p>\n<p>“Yeah, it’s me. How are you feeling?” Pidge asks, stepping closer.  </p>\n<p>How is he feeling? He doesn’t know. How should he be feeling?</p>\n<p>Hunk then envelopes him in a hug, joining Shiro, and says: “Hey, whatever she showed you, it was all lies, man. You know that, right?”</p>\n<p>“So we’re not working for the Galra?” Lance asks in a weak voice.</p>\n<p>Shiro’s eyes widen, and he shakes his head immediately. “No, Lance, of course not.”</p>\n<p>“So we’re not bad guys?”</p>\n<p>Shiro’s eyes close slowly, and he runs a hand through Lance’s hair. He hates how hopeful Lance sounds, how confused and <em>torn</em> he looks. “No, Lance. We’re trying our best to be the good guys.”</p>\n<p>Lance looks skeptical, but he gulps loudly, and nods, turning his gaze back to the ground. He can feel his eyes beginning to burn with unshed tears, but he refuses to let them fall.</p>\n<p>It was bad enough that Lance had fallen for the witch’s magic, and had been unable to escape. It was even worse that he actually <em>asked </em>whether or not they were the good guys.</p>\n<p>He will <em>not</em> cry like the weak idiot he feels like.</p>\n<p>“Lance, Hunk, Pidge: you guys head into the cave, fight the troops there, and keep the civilians calm. Keith and I will keep watch out here.” Shiro instructs. “All good?”</p>\n<p>He receives a few nods in return, along with an enthusiastic “yes, sir!” from Lance. They had come out here with only two lions (Red and Black), and so Lance, Hunk and Pidge entered the cave on foot, grips tightening around their bayards.</p>\n<p>“I don’t like caves,” Hunk stammers, growing nervous. “It’s so dark in here.”</p>\n<p>Lance nods in agreement, but Pidge scoffs. “Come on, Hunk. We’re guardians of the universe now. A cave shouldn’t scare us––even if it <em>is</em> very dark.”</p>\n<p>“Well, Hunk has a point,” Lance argues. “Caves are <em>terrifying</em>. I mean, with the ocean, it’s so wide and open… you can see the whole world around you! There’s sun, there’s land, there’s water… But caves? You can’t see anything, and there’s no fresh air…”</p>\n<p>Hunk nods aggressively. “And bats, on Earth. Which means there are probably alien bats out here, which are probably much scarier, and… what if they feed on our blood?”</p>\n<p>Lance pales. “Alien vampire bats.”</p>\n<p>As if on cue, a creature drops from above and flies over their heads. They shriek loudly, and Hunk begins patting away at his hair, trying to push it away. Once they realize it’s gone, they stand up straight again, exhaling slowly. Lance cracks a sheepish grin at the other two, who begin to giggle.</p>\n<p>“Is everything okay in there?” Shiro asks, concerned.</p>\n<p>“Yes, Shiro,” Hunk immediately answers, clearing his throat. “We just… saw a vampire alien bat, and freaked out a little.”</p>\n<p>“It was <em>not</em> a vampire alien bat,” Pidge says pointedly. “We didn’t even see how it looked!”</p>\n<p>“Do you think it sparkles in the sun, like Edward Cullen?” Lance wonders.</p>\n<p>Keith raises an eyebrow, having had listened to the conversation through the coms. “Who’s Edward Cullen?”</p>\n<p>“What, Keith, you don’t know Edward Cullen?” Lance exclaims, halting in his steps. “Hello, <em>Twilight</em>? Come on, even if you hated it, you gotta know it.”</p>\n<p>When he’s met with silence, Lance only shakes his head, letting out a dramatic sigh. He continues trudging into the cave, then, with Hunk and Pidge at his feet.</p>\n<p>They walk in silence and darkness for a few more minutes––though it feels much longer–-and thankfully they do not encounter any more alien-bat-vampires. They are getting irritated, however, at the fact that they are not encountering <em>anything</em>. They had received a distress signal, claiming the Galra were here, and they had indeed fought a few soldiers upon arrival…. but there appeared to be no sign of any civilians or Galra soldiers in those caves.</p>\n<p>“Okay, is it just me, or is this kind of sketchy?” Lance asks, a few minutes later. He stops, looking around the cave. They were walking in one straight tunnel, and it didn’t seem to be leading them anywhere. Where were the civilians who had called for them?</p>\n<p>“What do you mean?” Shiro questions.</p>\n<p>“There’s… nothing.” Lance answers slowly. “Are there any more Galra soldiers coming your way?”</p>\n<p>“No,” Keith answers. “It’s really quiet out here.”</p>\n<p>Pidge furrows her eyebrows, pushing her glasses up the bridge of her nose. “Do you think they ceased the attack?” A pause, then, “but even then, why haven’t the civilians come out? Maybe we should ask Allura to double check if the distress signal is still going?”</p>\n<p>Shiro is quiet for a while, presumably to contact Allura, and the trio in the cave wait in silence. Hunk kicks some rocks, humming a tune under his breath. The melody is cut off, however, when Shiro speaks up again: “Our communications are cut off from the castle.”</p>\n<p>Lance inhales sharply, and begins to tap his fingers on his bayard nervously. “What do you mean, we’re cut off from the castle?”</p>\n<p>“I can’t seem to contact them,” Shiro says helplessly. “The signal is just not going through, and I’m only getting static in response.”</p>\n<p>“Maybe they should head back out of the caves?” Keith suggests. “Something is really iffy. We can come back another day, make sure our com systems are back up and working well.”</p>\n<p>“Yes,” Hunk says in approval. “I like that idea. We should definitely get out of this place. I don’t feel good about this.”</p>\n<p>Lance wraps an arm around Hunk’s shoulder, then nods to Pidge. “Me neither, buddy. Well, let’s get out of here.”</p>\n<p>They turn around, walking a little faster this time, in a rush to escape the dark caves. A while later, Pidge stops and raises a hand. “Do you guys hear that?”</p>\n<p>Hunk and Lance come to a stop beside her, focusing carefully. Yes, they can. It sounds like… rumbling?</p>\n<p>Suddenly, the ground begins to shake beneath their feet, and Lance loses his footing, falling backwards and rolling down the path for a few metres before he crashes into a rock. He shakes his head, and pushes himself up. Thankfully, he doesn’t think he’s gotten too injured.</p>\n<p>“––Oh my God, is it an Earthquake? Are we––are we getting trapped in here? What’s happening, where’s Lance? Oh quiznak, is it going to crash down on us?” Hunk is rambling from the distance.</p>\n<p>“Hunk, please, calm <em>down</em>,” Pidge is saying, though her voice sounds shaky as well.</p>\n<p>Lance stands up, begins to step towards them, and winces when a small joust of sharp pain shoots through his side. He inhales, and steps forward again. “I don’t think that was an Earthquake,” he says slowly. “Or––a whatever-this-planet-is quake. I have a feeling this was all planned.”</p>\n<p>“What, we fell into a trap? Oh, dear. How did we not see it?” Hunk exclaims, his hands beginning to shake. “Did the Galra plan it?”</p>\n<p>“That would explain the communications being cut off from the castle,” Pidge notes. Then she shakes her head. “But come on, we need to get out of here. Maybe we can run out before  the entrance gets blocked.”</p>\n<p>Hunk nods quickly, and begins to run forward, Pidge at his side. Lance takes a deep breath, and springs into a sprint, following them closely. His side is throbbing, but Lance finds that he’s able to push through it for now.</p>\n<p>“Shiro?” He calls out, a little out of breath. “What’s happening out there? Is the cave being attacked from the outside, or should we watch out for infiltrators?”</p>\n<p>Silence.</p>\n<p>Static.</p>\n<p>Silence.</p>\n<p>“The communications are cut off!” He shouts to Hunk and Pidge. “Even from Shiro and Keith?!”</p>\n<p>Pidge cocks her head around in a haste, nodding at him. “Yeah. Must have been cut off before they could warn us.”</p>\n<p>“Hey, the entrance is still open!” Hunk exclaims, pointing ahead of them. Sure enough, light is now streaming into the cave, providing better vision for the panicked paladins. “Hurry!”</p>\n<p>They do. But the cave rumbles loudly again, and the ground begins to shake vigorously. Lance’s jaw clenches as he attempts to hold his footing, but he is thrown into the wall next to him. He lets out a soft grunt, pushing himself away from it and focusing on getting to the exit.</p>\n<p>Push through, Lance. Push through.</p>\n<p>He makes it.</p>\n<p>As soon as he’s out of the cave, he leans over, hands on his knees, and allows himself to suck in all the oxygen his lungs are burning for. As soon as he’s caught his breath, he stands up straight again and turns around to look at Pidge and Hunk. “We made it, guys, that was <em>close––</em>”</p>\n<p>But Hunk and Pidge are not there.</p>\n<p>The entrance is blocked now, piles and piles of rocks covering it up.</p>\n<p>“Pidge! Hunk!” He screams, running back over to the entrance. He pushes against the rocks with all his strength, but they won’t <em>budge. </em>“Hunk! Pidge!”</p>\n<p>“Lance!” It’s Keith who calls for him. The coms must be working for him now that he’s out of the cave––but that means he can no longer contact Hunk and Pidge. “Lance, are you alright?”</p>\n<p>“I’m––I’m––” Lance stammers, punching the rocks. “Hunk! Pidge! They’re––They’re inside! They’re––Shiro! Hunk and Pidge are stuck, they’re––they’re trapped, they’re––”</p>\n<p>They’re inside. What if the rocks had fell onto them, injuring them badly? Or… Or what if one of them was trapped under a rock, unable to pull their leg or arm from beneath it? What if they couldn’t see <em>each other</em> in there?</p>\n<p>Lance’s mind begins to run with endless theories, spiking his panic. His friends are trapped there, and he’s not. He made it out, somehow, despite having been behind them <em>and</em> having gotten a little injured. How did he manage to make it out first? That––that just wasn’t fair. It made no sense. They should have been the ones to get out. What if he had blocked their path when he ran in front of them? What if––</p>\n<p>“Lance, calm down,” Shiro commands gently. The black lion lets out a laser beam, taking down the last Galran fleet, and turns towards Lance and the cave entrance.</p>\n<p>Lance slips away from the entrance, looking up at the black lion. His eyes are glassy, red with unshed tears, and his hands have clenched into fists by his sides. “They’re <em>inside</em>, Shiro.” He says in a broken voice.</p>\n<p>Shiro lets out a shaky exhale. “I know, Lance. But don’t worry, we can get them out. I’m sure they’re alright… we just need to take down this wall of rocks. It shouldn’t be too hard when we got both Red and Black here to help us out.”</p>\n<p>Lance stares at him––well, stares at Black, but Shiro can still feel his gaze––for a long moment before blinking quickly and nodding. He doesn’t seem too convinced, but he doesn’t argue.</p>\n<p>“Why don’t you come up and ride with me in Black?” Shiro offers. Black then rests her chin on the ground, and opens her jaw, sliding down the ramp for Lance to climb.</p>\n<p>Lance nods, and makes his way up to the cockpit, standing next to Shiro.</p>\n<p>“You alright, kiddo?” Shiro asks, smiling weakly. Lance doesn’t appear to be physically hurt, but the look on his face is worrying.</p>\n<p>“I’m fine,” Lance answers, though visibly tense. “I’m just… They’re stuck there, Shiro.”</p>\n<p>“Red and I are going to start working on these rocks,” Keith announces.</p>\n<p>“Okay, Keith. Thank you.” Shiro says. “And yes, Lance, but like I said: we’re going to get them out.”</p>\n<p>“But I got out. And they didn’t.” Lance’s breathing begins to grow laboured. “I was behind them and I was more injured than them and.. and I pushed forward and made it out and they didn’t.” His voice is barely above a whisper by the time he finishes.</p>\n<p>Shiro furrows his eyebrows, and motions for Lance to come closer. When Lance steps towards him, Shiro gently squeezes Lance’s arm. “Hey, at least you’re out here, and we know that nothing too bad happened back there… you were all near the entrance, weren’t you?”</p>\n<p>Lance nods. “Yes. But––but what if a fleet attacked them after the entrance closed? I should have stayed to help them.” His shoulders sag. “Shiro, what if they needed my help? I ran alone, I didn’t check if they were caught up… They deserved to be the ones who made it out, not <em>me.</em>”</p>\n<p>“Hey, no, don’t do that to yourself.” Shiro presses. He unbuckles his belt, and stands up next to Lance. “They’re going to be alright. And why would you say that they <em>deserved</em> to be out here but not you?”</p>\n<p>Lance shrugs, lower lip beginning to tremble.</p>\n<p>“Lance.” Shiro pushes. “You <em>all</em> deserve to be safe and saved, none of you more-so than the other. We’re a team, Lance––”</p>\n<p>“<em>You’re</em> a team,” Lance grounds out, shaking his head. “You guys can communicate through your paladin bond, your lions can communicate very well together… You know I can’t do that. If you lose any of <em>them</em>, then you lose Voltron. If you lose <em>me</em>, then you can find another paladin who will probably do the job much better.”</p>\n<p>Shiro’s eyes widen. Had that mission not left Lance’s head? True, he had been unable to feel the paladin bond… but that did not mean that he was <em>undeserving</em> of being one, or that he was of any less value than his teammates…</p>\n<p>“Lance,” Shiro begins to say, before he is cut off by Hunk’s loud voice blaring through the coms.</p>\n<p>“Whoa, we’re <em>free</em>!” He exclaims, running out into the field and hugging Red’s forelimb. “Lance, we actually <em>saw</em> the vampire-bat-alien! And it wasn’t scary at all! It was actually very cuddly!”</p>\n<p>Lance lets out a soft breath, and turns around before Shiro can finish speaking. He makes his way down to the field, and hugs Hunk tight. When they break the hug, he immediately turns to Pidge, hugging her as well. He doesn’t care if she grumbles something under her breath…. She’s <em>alive</em>.</p>\n<p>“Are you guys okay?” He asks. “I’m so sorry, I didn’t realize you guys were behind until after I made it out and didn’t find you there…”</p>\n<p>Hunk giggles. <em>Giggles.</em> “No worries, man. It seems you guys did all the kickass fighting out there. I was really scared at first, but then Edward Cullen came and comforted us. I’m calling it that because it actually kind of glittered in the sun––can you believe it!”</p>\n<p>Lance stares at his friend for a long moment, before smiling weakly. They were alright. They were happy. He’s not going to be the one to break the mood… especially when he hadn’t been the one to even get trapped in that cave.</p>\n<p>So, he grins, and throws his hands up in disbelief. “What! I knew it!”</p>\n<p>He also misses the sad and concerned smile Shiro directs at him.</p>\n<p>“Lance, focus!”</p>\n<p>Lance snaps out of his trance, eyes widening as he turns to look at Keith. “Wh–what?”</p>\n<p>The team is sitting on the big, sunken couches in the main hall, discussing upcoming battle plans and new training ideas. Lance, honestly, does not remember how he fell out of focus––one moment he was listening, the other he was snapping back to reality at Keith calling his name. Whatever had had in between was a mystery.</p>\n<p>“This is important,” Allura scolds, crossing her arms. “Please, Lance, focus with us.”</p>\n<p>Shiro’s gaze travels from Allura, to Keith, to Lance. Lance looks very <em>pale</em>, and it’s not a look Shiro is used to seeing on the younger paladin’s face. He notices how Lance’s expression drops, shame colouring his cheeks, and decides to add: “You’re part of the team, Lance, that’s all. We really value your input, we want to make sure we’re all on the same page.”</p>\n<p>Lance nods, and sits up straighter. “I’m sorry, I don’t know what happened. I’m all ears.”</p>\n<p>“Very well. We were discussing the use of your bayards,” Allura says. “In the past, the paladins began to evolve new forms of their bayards. You may have started with a specific weapon, but you may find that it can form into something else as you need it to.”</p>\n<p>“Do you think mine could form into a bow and arrow?” Hunk wonders. “I’m actually good at archery. I’ve always wanted my own bow and arrow, you know? Especially if it’s a high tech bayard one.”</p>\n<p>Allura smiles. “That’s very possible.”</p>\n<p>Keith glances at Lance, furrowing his eyebrows. Normally, Lance would have taken this opportunity to make a countless number of inappropriate and/or aggravating comments. Keith nudges him with his shoulder, and says, “I bet that Lance’s bayard could <em>never</em> transform into a sword that’s as cool as mine, though.”</p>\n<p>Lance cracks a weak grin, and pushes Keith lightly. “No, but I bet it could make something way <em>better</em>. And your bayard could probably only transform into a water gun instead of an actual, badass long-range weapon like mine.”</p>\n<p>Keith places a finger under his chin, exaggerating a thoughtful expression. “Well, Blue is the water lion. Since Red is the fire lion, it would mean I could get a <em>flamethrower</em>, which is way cooler than your current weapon… so I still win.”</p>\n<p>Lance grumbles something under his breath, and rolls his eyes, enticing a few chuckles from around the room.</p>\n<p align=\"center\">~  ~ ~ ~ ~ ~ ~ ~</p>\n<p>“… And the blue lion should then activate its ice ray, to give the rest of you enough time to pass around the monster before it breaks free,” Allura instructs. “Is that all clear?”</p>\n<p>The team nods––all save for Lance, who’s nodding off. He’s leaning forward, arms over his head, and he does not appear to be listening to Allura. It spikes her anger. “Lance!” She shouts, clenching her fists. “Are you not listening?”</p>\n<p>Lance does not answer.</p>\n<p>Keith huffs out impatiently and shoves him, “Lance!”</p>\n<p>Lance topples to the side, then startles, eyes snapping open. “Ah––”</p>\n<p>Allura stands up, glaring him down. “Lance, that’s <em>enough</em>. You are the protectors of the universe, the defenders––and you think this is a time for you to be dozing off into sleep? You are a solider, not a child. The <em>lives</em> of people are at stake, we can’t afford to make any mistakes.”</p>\n<p>Lance furrows his eyebrows, not quite able to focus on what Allura is saying. His head feels extremely heavy, and his eyes are burning. When he attempts to sit up, he has to shut his eyes to stop the dizziness and the black spots.</p>\n<p>Keith’s hand is on him again, then, gripping tightly and attempting to move him. Allura is still angrily snapping at him. Hunk is muttering something under his breath. Pidge is making snide remarks.</p>\n<p>“I told you,” Pidge says with a small pout, “this is why he couldn’t feel the paladin bond!”</p>\n<p>Suddenly, everything is suffocating. The voices, the touch, the heavy air, the sounds of everyone’s breathing, the shuffling of fabric…. It’s too much.  It’s too much, and Lance has to fight to push down the nausea.</p>\n<p>“You are not listening to me,” Allura says in disbelief. “Do you think this is funny? You are being impeccably disrespectful, Lance. I expected better of you.”</p>\n<p>Lance wants to argue, wants to tell her that he’s <em>trying</em>, but he can’t. Instead, all that comes out is a soft whimper. Keith’s grip tightens on his arm (whether in anger or concern Lance cannot really tell), and Lance claws at it, pushing it away.</p>\n<p>Then, Lance thinks he can see his older brother, poking at him, gripping at his arm tightly as he teases him.</p>\n<p>“<em>Get off</em>,” he whispers, his eyes still shut.</p>\n<p>Keith is about to retort with an angry comment, but Shiro puts a hand on his shoulder and shakes his head. Keith crosses his arms and sits back, which gives Shiro some room.</p>\n<p>“Lance?” Shiro asks, voice gentle. He puts a hand on Lance’s cheek. “Are you feeling alright, kiddo?”</p>\n<p>“Papá?” Lance asks, leaning into the touch.</p>\n<p>Pidge lets out a soft snort. “Did you just call Shiro <em>Papa</em>?”</p>\n<p>“Pidge,” Shiro snaps, but without heat. He’s alarmed by Lance’s response. The boy’s face is <em>burning</em> to the touch, and he must be extremely tired if he is unable to keep his eyes open or his head lifted. But calling Shiro his papá? That is even more worrying.</p>\n<p>What if Lance has a fever? What if he’s… hallucinating?</p>\n<p>… How had they not noticed any earlier?</p>\n<p>“Lance, it’s me, Shiro,” Shiro says, now holding Lance’s head between his hands. “Can you open your eyes for me?”</p>\n<p>A shaky exhale from Lance, before he decides, “No.”</p>\n<p>Shiro gulps, beginning to grow nervous. He had never had to deal with someone growing ill back on Earth… what is he supposed to do when they’re in outer space? His head begins to race with questions; Lance is clearly ill. What virus had he contracted? How serious would it be? Did they have any medications for it?</p>\n<p>He can feel the rising anxiety in the room. Keith is now sitting up stiffly, looking tense and worried. Hunk is pale, and Pidge looks scared. Allura and Coran only seem to be puzzled, looking from Lance to Shiro and back.</p>\n<p>“What are you feeling, Lance?” Shiro asks, turning his attention back to the blue paladin.</p>\n<p>“No estoy bueno,” Lance admits, voice barely above a whisper. “Papá? Estoy en casa?”</p>\n<p>\n<em>I’m not okay. Papá, am I home?</em>\n</p>\n<p>“Lance, you’re burning up.” Shiro says, attempting to keep his voice level. “I’m not your Papá, but… but maybe you can pretend I’m your space Papá for now, yeah? Can you listen to your space Papá?”</p>\n<p>Everyone is now standing up, looking pale and concerned.</p>\n<p>“Sí.”</p>\n<p>“Okay. Okay, good. I need you to tell me what you’re feeling. In English, if you can.”</p>\n<p>Lance raises an eyebrow at that, but nods. “English? Sorry. Sí, I feel dizzy.”</p>\n<p>“Okay.” Shiro mutters. Then he strokes his thumb softly over Lance’s cheek, urging him to continue. “Anything else?”</p>\n<p>“Want to vomit.” Then, because he’s <em>Lance</em>, he actually cracks a weak smirk. “Like Hunk.”</p>\n<p>Hunk chuckles nervously, then licks his dry lips.</p>\n<p>“Like Hunk, huh?” Shiro gives him a small smile. “Okay. Do you think you can stand up at all?”</p>\n<p>“No,” Lance answers. “Wanna sleep.”</p>\n<p>Shiro exhales patiently, then turns his gaze to Allura. “He’s ill. That’s why he was not listening to you… as you can see. Do you have any medications?”</p>\n<p>Allura’s eyes widen, guilt resting heavy in her chest. She looks to Coran. “I… we’d have to run tests on him to see what’s causing it. Have any of you noticed him coming into contact with any unusual substances?”</p>\n<p>“No,” Hunk answers, fiddling with his jacket’s zipper. “And everything he ate we ate as well.”</p>\n<p>Pidge and Keith shake her heads…. then Keith’s eyes widen. “Our last mission was when we were lured to the cave and Pidge and Hunk got trapped. He mentioned that he got more injured than Pidge and Hunk… when he was talking to you, Shiro.” His cheeks tinge red, slightly ashamed. “I overheard you on the coms.”</p>\n<p>Shiro lets it slide. They <em>had</em> been on the coms, but they had not remembered that Keith could be listening. “You’re right. But that was over three, four days ago now.”</p>\n<p>“Well, viral infections tend to show symptoms after a few days, usually.” Hunk informs them. “That’s why when your sibling gets sick or something, you tend to get sick after them. It’s because by the time your symptoms begin to show, theirs have been treated. That’s what I learned, anyway.”</p>\n<p>Allura shakes her head, looking sadly at Lance. “Why had none of you informed us that he was injured that day? I thought he was alright, save for a few minor cuts and bruises.”</p>\n<p>Coran pales. “The cuts. He had a cut on his neck, that he said he obtained when he fell, but it hadn’t been deep at all. Do you think something could have entered through there?”</p>\n<p>“He had a cut on his neck?” Shiro questions. Lance had told Coran, but not him? Shiro feels a pang of… envy, perhaps? Or is it anger at himself, for the fact that Lance could not entrust him with such information?</p>\n<p>Or the fact that he had not noticed its presence to begin with.</p>\n<p>Coran nods, stepping closer. He pushes down the neck of the black under-suit (which Coran had helped him sew back in place of the cuts) to reveal the cut he had mentioned.</p>\n<p>Pidge scrunches her nose at the sight. “Oh, Quiznak… It’s <em>purple</em>. Why is it purple?”</p>\n<p>Keith does not like how unresponsive Lance is being to the whole situation. “Lance? Had the cut been purple for a long time, or was this sudden?” He asks. When Lance does not answer, Keith crouches down next to the couch, and places a hand on his knee. “Lance. How long has the cut been bothering you?”</p>\n<p>Lance stirs, now cradled in Shiro’s arms, and attempts to open his eyes. He manages to open them into narrow slips, but it’s enough to make Keith sigh out in relief. “Last morning,” he slurs. Then he clears his throat. “This morning it felt worse.”</p>\n<p>“Last morning?” Hunk sputters. “Lance, why didn’t you tell us?!”</p>\n<p>Lance simply shrugs, shutting his eyes again and resting his head back against Shiro’s shoulder. “Dunno,” he murmurs. “Didn’t matter.”</p>\n<p>\n<em>Didn’t matter.</em>\n</p>\n<p>\n<em>Didn’t deserve to be the one to make it out.</em>\n</p>\n<p>\n<em>Didn’t deserve to be a paladin.</em>\n</p>\n<p>Shiro’s jaw clenches, and he subconsciously tightens his grip around Lance, bringing him in closer.  The boy’s body is very, very hot. The armour can’t be helping with that. “We should get him in lighter clothes,” he suggests.</p>\n<p>“Good idea,” Coran agrees. “And we should run the tests on him as soon as possible.”</p>\n<p>“Why can’t you just pop him into the healing pod? That helps, doesn’t it?” Hunk asks.</p>\n<p>“Well, the pod does have its benefits… But it mainly aids in healing physical wounds and overall exhaustion. If Lance has an infection, then it would need to be treated separately before we can have him use the healing pod for overall energy restoration.”</p>\n<p>Keith curses under his breath.</p>\n<p>“Well, we should hurry. While Shiro and I get him out of his heavy armour, one of you kids should go grab him something else to slip into. The other two, please get him some water and nunville. Allura, I trust you’ll start up the testing station?” Coran instructs.  </p>\n<p>“Of course.” Allura assures him, then sets off to work. The three paladins look at Lance worriedly before nodding and following Allura outside the room.</p>\n<p>Shiro and Coran then begin to remove the armour carefully. Once the chest plate is removed, Lance inhales deeply, grateful for the oxygen he hadn’t realized he’d needed. As they work away on the rest of the armour, Shiro looks at Coran hesitantly. “When did he tell you about the cuts?”</p>\n<p>“Oh, he didn’t.” Coran answers, eyes still fixed on the armour. “I noticed that his hand kept rubbing at his neck underneath the ‘hoodie’ on his jacket, and asked him if he was alright. Of course, he jumped to say that he was. But then a while later he flinched, and his hand shot straight back to his neck, and I told him there was no good in hiding. He showed it to me, but it didn’t look… bad. He assured me it was just a little itchy, but nothing deep.”</p>\n<p>So Coran had been the one who noticed Lance’s discomfort… When Shiro couldn’t.</p>\n<p>“I know,” Coran continues. “I shouldn’t have let it pass. I should have gotten it tested. But this boy––he can be so convincing! He laughs it off and jokes around, makes you forget why you were berating him to begin with. I’m sorry.”</p>\n<p>“No, you don’t need to apologize, Coran.” Shiro says quietly. “I just… I guess I’m angry with myself for not noticing it. He <em>told</em> me that he’d gotten more injured than Pidge and Hunk, but I was focused on what he was saying about how he didn’t deserve…” Deep breath. “I should have asked him to elaborate about his injuries.”</p>\n<p>“S’okay, Papá,” comes Lance’s small voice. “Lo Siento.” Shiro startles, but soon collects himself. He’s unsure of what to say. Is Lance calling <em>him</em> Papá, or is he imagining his real father again?</p>\n<p>Coran studies Shiro carefully. “Don’t blame yourself, Shiro.”</p>\n<p>Shiro can only turn his gaze back to the armour.</p>\n<p> </p>\n<p> </p>\n<p>Fever is one thing. Pain is another.</p>\n<p>Keith doesn’t think he can handle it when he hears Lance scream out in pain. <em>Again</em>.</p>\n<p>“Lance, Lance,” Hunk is calling soothingly. “Lance, talk to me.”</p>\n<p>“Nnn—uh.” Lance moans, curling in on himself. “Hurts. Mama, it <em>hurts</em>.”</p>\n<p>Pidge tugs at Keith’s sleeve, subconsciously clinging to him for comfort. She’s close to tears, and Keith does not hesitate to wrap an arm around her shoulder, tugging her closer.</p>\n<p>“Lance, where does it hurt?” Shiro asks gently, running a hand through Lance’s hair. They’re back in the main lounge now, after having run the tests on Lance, and Lance is lying down across the sunken couch, head resting over Hunk’s lap. Shiro is sitting on the ground next to them.</p>\n<p>“Everywhere,” Lance breathes out. “Make it stop, Mama, por favor. Hazlo parar, <em>make it stop</em>.”</p>\n<p>Allura walks into the room, then, and she’s a little out of breath. She’d hurried immediately from the testing room. “The results are out,” she says. “He’s got an infection. Thankfully, it’s not a very foreign one––it’s one Altean children often deal with. It’s only because he’s not, well, Altean that the symptoms are so much more severe for him.”</p>\n<p>“Ghh-aaa!” Lance yells out. Then, in a hoarse voice, “Mari? Where’s Mama?”</p>\n<p>Allura raises an eyebrow in question. “Who’s Mari? And how is he faring?”</p>\n<p>“He’s in pain,” Shiro says desperately. “He’s in a lot of pain. And he’s got fever, and he’s unaware of his surroundings. If you have an antidote, Allura, please hurry with it.”</p>\n<p>“I have it,” Allura tells him, revealing a small bottle in her palm. “I’m just… I’m just worried.”</p>\n<p>“About what?” Keith demands, stomping over to her. He reaches out for the antidote. “He’s hurting! What are you waiting for?”</p>\n<p>“Keith, please!” Allura steps back defensively. “I don’t want to see him hurting any more than you do. It’s just that… this potion is meant for Altean adults. I’m not sure how well a human adolescent can tolerate it. I’m afraid of the counter effects.”</p>\n<p>“Anything is probably better than this!” Pidge exclaims, hands clenching into fists at her sides. “Please, Allura.”</p>\n<p>“He could <em>die!</em>”</p>\n<p>They are stunned into silence at Allura’s words.</p>\n<p>“I just… I need more time, that’s all I ask. I will dilute it, or I will figure out how much of it I can safely give him, or what doses he can tolerate… Please. Just give me a little more time.”</p>\n<p>Hunk’s eyes water, and he looks down at Lance, who is flinching. More time? That would only be more suffering for Lance.</p>\n<p>But if it means a better antidote, then perhaps it is worth the wait.</p>\n<p>Shiro nods weakly, and Allura thanks him before hurrying out of the room and to the lab. Pidge follows her out, keen on helping.</p>\n<p>The men sit in the room for another hour, soothing and comforting Lance as much as they can. The pain is not consistent, thankfully, as it comes in intervals, and it appears that Lance grows more incoherent with the stronger jousts of pain.</p>\n<p>“Papá?” Lance calls out a while later, when his pain has dimmed down. His voice is a little stronger, but still tinged with pain.</p>\n<p>Shiro turns to him immediately.  He can’t stop the stinging in his eyes, or the tears that brim his ducts. “Lance.”</p>\n<p>“Ah,” Lance notes. “Space Papá.”</p>\n<p>Shiro chuckles, despite himself. And for the first time in a long, long time… A tear slips out of his eyes, running a path down his cheek. “Yes, Lance? I’m here.”</p>\n<p>Lance cracks his eyes open, but just barely. He seems to study Shiro for a while. “You’re crying.”</p>\n<p>Shiro’s eyes widen, and he immediately wipes at his eyes. Lance does not need to see this––he needs to see a strong Shiro, one that will comfort him and––</p>\n<p>“S’okay,” Lance says, giving him a small smile. “M’sorry.”</p>\n<p>“No,” Shiro shakes his head. “You don’t need to apologize, Lance. No, just––No, don’t apologize. We’re all sorry, but you… You just rest, okay? We’re all here.”</p>\n<p>“… form Voltron.” Lance mumbles.</p>\n<p>“What was that, Lance?” Hunk asks. “Couldn’t hear you fully there, bud.”</p>\n<p>“You can’t form Voltron, ‘cause I’m sick. Sorry.”</p>\n<p>“Hey, we don’t really need to form Voltron right now anyway,” Keith says, stepping closer. “And if anything happens, then we’ll handle it with our lions. Don’t worry about us. Just worry about getting better, okay?”</p>\n<p>“You’re nice,” Lance notes. “Unusual. Am I dying?”</p>\n<p>Keith and Hunk share a surprised look, and Shiro shifts, disturbed by the blue paladin’s question. “No, Lance, of course not. Why would you think that?”</p>\n<p>“Hurts.” Lance explains. His lip begins to quiver. “Feel like I’m floating.”</p>\n<p>“That’s just the infection, Lance,” Shiro promises. “It’s the fever and the infection. You’re not dying, I promise you that. Allura is just fixing you some Altean antibiotics. Pretty cool, yeah?”</p>\n<p>“Yeah,” Lance agrees, albeit uncertainly. His gaze shifts up to Keith, then, with visible effort… and he’s surprised to see that Keith, too, is on the verge of tears. And he can hear Hunk and Coran sniffling behind him.</p>\n<p>He’s probably dying, then. Why else would they all be so sad?</p>\n<p>But he doesn’t want them to be sad, not when he’s dying. Lance has wanted to make everyone smile his whole life… he doesn’t want them crying when he’s on his deathbed. And so, he fights back his own tears, and tries to grin as big as he can. “Hey, Papá?”</p>\n<p>“Yes, Lance?”</p>\n<p>“If you’re my space Papá, then am I your space <em>hijo</em>?”</p>\n<p>“If you want to be my space son, then you can be.” Shiro says, smiling. “Even though I <em>am</em> only seven years older than you.”</p>\n<p>“No, not son.” Lance argues. “Keith ’n Hunk are your sons. M’your <em>hijo</em>, the latino son. Special.”</p>\n<p>That elicits a chuckle from everyone else in the room. “Of course you are, Lance,” Keith says, rolling his eyes––though a smile is still on his face.</p>\n<p> </p>\n<p> </p>\n<p>“We’ve got it!” Allura announces, rushing back into the room with Pidge. She’s carrying a small cup in her hands. “We’ve managed to work it into a diluted drink, with the perfect dosage for a human body. Pidge helped me figure it out.” She turns to Pidge. “Thank you.”</p>\n<p>Pidge smiles, and shrugs humbly. “How is Lance feeling?”</p>\n<p>“He’s sleeping again,” Coran tells her. “Although he was felling better just earlier. The pain seems to come and go. Hunk, or Shiro, perhaps you should wake him up now?”</p>\n<p>They do. He’s not quite as coherent as he had been earlier, cracking jokes and all, but at least he’s not in a lot of pain. They help him sit up, his back laying across Hunk’s chest. Shiro takes the drink from Allura’s hands, and presses it to Lance’s lips carefully.</p>\n<p>“Drink it slow, hijo,” Shiro says, smiling softly. “This should help you feel a lot better. Then you can rest in the healing pod for a day, and you’ll come back feeling better than ever. Okay?”</p>\n<p>Lance doesn’t open his eyes, but he attempts to nod before sipping away at the drink.</p>\n<p>He’s going to get better.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>Look at this wonderful drawing @voltic-mayhem on tumblr drew for this chapter! x</p>\n<p>\n<img src=\"https://68.media.tumblr.com/ba07c18249a55433a407c143f95ee681/tumblr_ogcflyQ1Ui1upd1cjo4_540.png\" alt width=\"304\" height=\"225\">\n</p>\n<p>Another wormhole. Another jump through time and space. Getting more and more distant from Earth.</p>\n<p>Getting more distant from <em>home</em>.</p>\n<p>It hurts to think about it… so Lance tries not to. He really does. Most days, he can push it to the back of his mind––focus on training, focus on the mission, focus on the simulations, meet new aliens. Talk a lot, joke around, lighten the mood. It helps with forgetting how dire the situation they’re living in really is.</p>\n<p>But every time he lays his head down on that pillow… it all comes crashing back down. The loneliness, the distance and the faces. Oh God, the faces. His mother smiling, then berating, then comforting… His little siblings looking mischievous, his older siblings rolling their eyes at him. His aunts, uncles, grandparents scolding him.</p>\n<p>And yet, there had always been a softness, a kindness in their eyes, that Lance had never appreciated enough.</p>\n<p>That Lance misses.</p>\n<p>Perhaps Hunk is the closest thing he has to family. Hunk is… well, Hunk. He’s kind, he’s caring. His eyes carry a similar warmth to his family’s.</p>\n<p>A warmth that Lance really, really misses.</p>\n<p>He turns to his side, tossing around in the sheets, and drapes an arm over his eyes. He needs to sleep, or else he will end up walking late for breakfast (or missing it), and he won’t be energized, and he’ll have his ears chewed off by the team…</p>\n<p>But if he was home, then his mom would have let him sleep in. She would have made him his favourite soup. She would have pulled him in close and listened to him ramble away, releasing all of his worries.</p>\n<p>His father would have hugged him tightly after scolding him, because he’d always wanted to remind Lance that he was not angry with him for making a mistake, but had simply wanted Lance to learn from it.</p>\n<p>And now making a mistake could result in his death. Or his teammates’.</p>\n<p>Or, you know, the whole universe.</p>\n<p>Lance no longer has time to learn from his mistakes––he just has to be perfect. And it’s <em>hard</em>. He was a seventeen-year-old (wait, maybe he turned eighteen? Who knew what date it was back on Earth), and seventeen-year-olds didn’t normally have the preparation, or experience, for being defenders of the universe.</p>\n<p>So yes, it’s hard. It’s hard that he and Hunk are reprimanded for joking around in a training session. It’s hard to see that Shiro never smiles, because he’s supposed to be the wise guy in the group, despite only being twenty-five. It’s hard that Pidge is only <em>fourteen</em>, and she’s orbiting outer space in search of her missing family.</p>\n<p>It’s hard that Allura can’t seem to grasp that.</p>\n<p>And Keith… Well, it seems that he has finally met his purpose in life, has found what he’s truly meant for. Which, you know––good for him! Except that Lance only feels like <em>he’s</em> breaking apart into tiny, tiny, uncollected pieces. That being in outer space is actually weakening him instead of helping him grow stronger.</p>\n<p>It’s killing him.</p>\n<p>But who can he tell that to?</p>\n<p>Pidge and Keith wouldn’t understand; this is where they’ve fought to be. Shiro would pity him––which is not good, because Lance doesn’t need pity, and he doesn’t need Shiro to lose his trust in him for being so weak. Hunk <em>would</em> listen, but… how can Lance vent about his problems when Hunk is suffering all the same?</p>\n<p>So Lance has to keep to himself. He has to! What else would he have himself do?</p>\n<p>He sighs, knowing the answer to that. He’ll just… have to push himself. Make-do with the new family, who are not really all that familial (save for Hunk, Coran, and recently… Shiro?). They’re his new family now, and Lance can’t afford to lose <em>them</em> too.</p>\n<p>So, he flops onto his stomach, burying his face into the pillow, and allows it to absorb his tears in silence.</p>\n<p> </p>\n<p> </p>\n<p>“What happened to you?” Keith asks the following morning, raising an eyebrow. “Didn’t you used to walk in here in your silk robe, with glowing skin and a steaming mug of tea?”</p>\n<p>“My skin is still glowing,” Lance grumbles, falling into his seat between Keith and Pidge.</p>\n<p>Keith snorts. “Right. And my hair is still in a mohawk.”</p>\n<p>Lance finds that he doesn’t have the energy to banter, so he sighs quietly and stares at the plate of food in front of him.</p>\n<p>Food. Huh. When did he start calling space goo that? When did “food” change from being spicy wraps, steaming hot soup, <em>pizza</em>? And to think he used to push away some of the food his mother used to make because “he didn’t feel like it”. God, what an idiot.</p>\n<p>He’d do anything––<em>anything––</em>to taste her cooking one more time.</p>\n<p>“Lance,” Allura begins, her gaze focused on him. “You are––”</p>\n<p>“Late to breakfast, I <em>know</em>.” He finishes. “And I’m not in paladin armour, I know that too. You don’t have to point it out every single time, Allura.”</p>\n<p>Well, that came out more snarky than he had expected. Not a good idea to piss off the Altean princess (especially when his fate, really, is in her hands at this point).</p>\n<p>“That’s exactly it!” She cries out. “There shouldn’t be an ‘every single time’, Lance. This happens far too often. Zarkon can attack at any moment, and we must be ready at all times. We must––”</p>\n<p>“Okay.” Lance interrupts, pushing away the plate of food-goo. Who needs to eat to get energy, anyway? Apparently getting dressed in paladin armour is more important. “I’m sorry. I’ll go change.”</p>\n<p>He stomps out of the room, hands shoved in his pockets and feet dragging across the ground. Right. Defenders of the universe and all that.</p>\n<p>Maybe this job really isn’t meant for him.</p>\n<p align=\"center\">- - - - - -</p>\n<p><br>“You know, Allura…” Hunk says slowly. “He’s right. You <em>don’t</em> have to point it out every time. He knows it, he clearly feels bad about it. The other time he was dying because of a space virus and we were all being really harsh with him.”</p>\n<p>Allura sighs. “I don’t mean to be insensitive,” she says. “I just… I think he needs to be reminded of the big picture here, of our real mission.”</p>\n<p>“He does well in the field,” Shiro offers. “He’s improved a lot. Being a bit late to breakfast isn’t really a problem for me so long as he’s improving.”</p>\n<p>“I’m not saying he isn’t.” Allura insists. “I just think his attitude needs to be set right. What if he’s late for something else? What if we go under attack during breakfast? I know it’s hard, but you’re defenders of the universe now.”</p>\n<p>“It’s not a job we actively signed up for, you know?” Pidge points out. “I wanted to leave at first. It wasn’t my priority. But then… I also realized that being with the team means I’ll be fighting whatever enemy has my father and brother. I found a personal purpose in all of this.”</p>\n<p>“I would think saving the universe is a good enough purpose.”</p>\n<p>“And it’s an even bigger responsibility.” Hunk notes. “It freaks me out, okay? I admit it. I’m always terrified. I <em>want</em> to go home, but I’m staying here because I have to. I have to help you, otherwise I would be a coward and I would be ruining Voltron. Doesn’t mean I love it out here all the time.”</p>\n<p>Allura gasps, her eyes widening. “But…” Her paladin does not <em>want</em> to be here? “But Paladins must find comfort in each other, in the lions. You must all believe in your purpose, it must be your top priority.”</p>\n<p>“Yeah, and we’re trying really hard to make it that.” Pidge snaps. “None of us chose to be here. None of us chose to be paladins. But we’re trying, Allura. Lance is trying, too. I can see it. He’s… he’s changed a lot.”</p>\n<p>Hunk nods. “I’m just saying… this is hard for all of us. You don’t need to…” a soft exhale, “… make it harder.”</p>\n<p>“Just… appreciate that we’re trying.” Pidge finishes off.</p>\n<p>Allura is stunned into silence. Then she lets out a shaky breath. “I do appreciate it. I appreciate all of you for being here. I just want us to be ready. We’ve seen that Zarkon can attack at any time, we’ve seen what he’s done… I need to keep pushing you harder. Especially when you’ve just revealed that you don’t even wish to be here.”</p>\n<p>Shiro shuts his eyes, mentally cringing. That was definitely not the point Hunk and Pidge had been trying to get across. In fact, Allura seemed to take it to the opposite direction.</p>\n<p>“She’s right,” Keith mutters. “Whether or not we like it… this is our new life, and we just need to work hard––”</p>\n<p>“And we all know you like it.” Lance chimes, returning to the dining room. He leans against the doorframe, now clad in his armour. “This is your jam, isn’t it? Fighting in outer space, being the coolest pilot and fighting with a sword because you’re just <em>that </em>good at hand-to-hand combat. Living in a place that doesn’t tolerate fun. Dry as your heart. This is your dream place.”</p>\n<p>It surprises Keith to hear it, because he can’t <em>deny</em> it, exactly. It also aggravates Keith to hear it, because Lance isn’t smiling, or giving him a teasing grin or smirk. No, Lance is being completely serious.</p>\n<p>“And if it is? What’s so wrong with that?” Keith fires back. “Maybe it means that I’m meant to be here, that I’m meant to have this duty. If you can’t handle it––if you would rather be helpless and cowardly, have others defending you, then that’s not my problem! No one’s stopping you from going back to Earth, you know! Go there, have fun. Leave the serious work to serious people.”</p>\n<p>He regrets the words as soon as they’re out of his mouth. “I’m––” He begins to say, fumbling. The rest of the team is staring at him in shock. Hunk’s hands are shaking. Allura’s fists are clenched.</p>\n<p>God <em>damn</em> his impulse speaking.</p>\n<p>“Then I’ll go,” Lance answers. But he’s not arguing back, he’s not fighting. Instead, his voice is low and raspy, just above a whisper. “Once you have another blue paladin, I’ll go. I don’t want to be a defender of the universe. I don’t want to eat space goo for the rest of my life. I don’t want to live with a team who can’t be my family.”</p>\n<p>His eyes begin to sting, and a lump forms in his throat. There. He said it.</p>\n<p>Then, in a soft, soft voice, and with a quivering lip, he says: “I want to go home.”</p>\n<p>No one says anything. He can’t tell if it’s a stunned silence, or a pleased silence. Is this what they’ve been waiting to hear? “You’re right. You are meant for this job… I’m not. Maybe my only job was piloting Blue for long enough to get you guys here.”</p>\n<p>He exits the room.</p>\n<p align=\"center\">- - - - - -</p>\n<p>As soon as Lance leaves, the paladins find the shock settling in, and they kick back into gear. Shiro stands up immediately, hurrying to follow Lance, but stops at the doorway, inwardly cursing himself. What would he do? What would he tell the Blue Paladin?</p>\n<p>Pidge punches Keith. In the face. Hard.</p>\n<p>“What the Hell!” She yells. “What the Hell was that!” She stands up, balling her hands into fists at her sides. “Is that what you think, huh? You were <em>meant</em> to be here, but he wasn’t? Oh, oh! And he should go home because he <em>can</em>. I thought I wasn’t allowed to leave back when we saved the Arusians, because you needed me for Voltron!”</p>\n<p>Hunk is shaking. “You think it’s that easy? That just because he can go home, then he should? Maybe you think I should go home too, then. Maybe Lance and I still need years of training at the academy before we can become worthy of fighting by your side.”</p>\n<p>“No!” Keith yells back, standing up. “I didn’t say any of that––I didn’t––”</p>\n<p>“That’s <em>exactly</em> what you said!”</p>\n<p>“Then what the Hell did you mean?”</p>\n<p>“It’s almost like you hadn’t heard anything that Hunk and I were saying earlier about how we missed home but we were trying––”</p>\n<p>Coran stops by the room, then. Shiro is standing in the doorway, watching the other paladins fight inside the room. Allura’s in there, but her eyes are shut, and she’s curled up into herself, resting her elbows on the table.</p>\n<p>What in the quiznak?</p>\n<p>“Shiro?” Coran prompts, tapping Shiro’s shoulder gently. Shiro startles, and turns around, eyes wide. “Whoa––It’s me! What’s going on? I just went to get some work done in the controls room, and I come back to this.”</p>\n<p>“Coran.” Shiro breathes out. “Lance. You need to go see Lance, please. I’m… I’m going to talk to the team, just settle them down… Please, go find Lance. He’s not doing good.”</p>\n<p>“<em>What</em> happened?” Coran repeats.</p>\n<p>“We’re all tired. We’re all tired, and Lance wants to go back to Earth because Keith lost it and said stuff…”</p>\n<p>“Alright. I’ll go find Lance. You make sure those paladins don’t kill each other. It’d be a miracle if you can form Voltron after this.”</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Lance doesn’t go to his room. Instead, he heads straight to the hangar, where the lions are kept. As soon as he enters, Blue’s particle barrier drops, welcoming him, ushering him over to her.</p>\n<p>Lance can feel her warmth, her embrace, as soon as he climbs into the cockpit. “Blue,” he greets, taking a seat. He slides down in the chair, crossing his arms over his lap.</p>\n<p>They sit in silence for a while, but Lance can feel Blue.</p>\n<p>She has a certain warmth that reminds Lance of <em>home</em>.</p>\n<p>Of the beach. Of his family. Of the sun.</p>\n<p>“You’re my new home,” he tells Blue. “You’re the closest thing I have to it.”</p>\n<p>He can feel her purr in appreciation.</p>\n<p>“I don’t want to leave you. But… But I can’t be a part of this team. I don’t deserve you.”</p>\n<p>She insists that he does. That she needs him, too.</p>\n<p>“You don’t need me,” Lance says. “You need a good pilot. I’m just a cargo pilot.”</p>\n<p>Then he can’t stop himself. The tears come despite his trying to push them back. He slumps even further down in the seat, and presses his palms up against his eyes, wiping at the tears. He can feel Blue’s mood immediately change to one of concern.</p>\n<p>He sniffs. “I’m sorry. I know I’m very weak. The weakest paladin you’ve ever had, I bet.”</p>\n<p>She denies it. But Lance argues. “I’m so sorry, Blue. You deserve so much better.”</p>\n<p>Then, she’s warm again, encompassing him with that embrace, that feeling of home.</p>\n<p><em>Home</em>.</p>\n<p>Because he’s her home, too. The pilot may not know that, may not feel it… But she has never had a bond this strong with any of her prior paladins. None who had been so compassionate, so refreshing and friendly. None who had been so open with her.</p>\n<p>And Lance is her home now, he’s her family. She doesn’t want him to leave. She’ll protect him from anything––and anyone––who brings him harm, whether physically or emotionally. She will keep him safe.</p>\n<p>It’s why when Coran eventually makes his way to the hangar while Lance is dozing off, she refuses to bring down her particle barrier.</p>\n<p> </p>\n<p> </p>\n<p>“That’s <em>enough</em>,” Shiro repeats for the third time. He pushes Keith back (not harshly) from where he’s towering over Pidge. “<em>Keith</em>.”</p>\n<p>They finally, <em>finally</em>, stop.</p>\n<p>“Shiro. I didn’t meant it like that. I was just––I was just annoyed by his attitude and I––”</p>\n<p>“And you told him to leave the team!” Pidge hollers. Shiro shushes her.</p>\n<p>“Stop it.” He snaps. “Stop. Keith, you need to apologize to Lance, okay? He, along with Pidge and Hunk, were more annoyed by <em>your</em> attitude. This place… it feels more like home for me and you. But that doesn’t mean it has to only be <em>our</em> home. Pidge and Hunk––you guys opened up about your feelings today, and I really appreciate that. We’re going work hard to take it into account, I promise. You guys are trying, oh… you’re trying very hard. I know that we inwardly appreciate you, but we need to show it more.”</p>\n<p>He looks to Allura, who turns her gaze away.</p>\n<p>“They didn’t have the training you had, Keith.” He continues. “And they don’t have the Altean strength, Allura. They’re <em>young</em>, we all are. Lance is… He’s very homesick. Has been for a long, long time. I never consulted him about it. I never comforted him, like I comforted you, Pidge. I never told him to improve so he can show his family, either, like I had told Hunk.”</p>\n<p>Pidge looks down to the floor, tears welling up in her eyes. “He said he doesn’t want to live with a team who can’t be his family.”</p>\n<p>“Well, we’re not <em>really</em> a family.” Hunk supplies. “We’re good friends, I think. Most of us. But… we’re teammates. We’ve never had a bonding exercise that wasn’t training related, or Voltron related. We’ve never played any games, we’re never allowed to go and have fun on planets we visit after a mission.”</p>\n<p>“We’re always alert,” Keith argues weakly. “We’re preparing––”</p>\n<p>“For what?” Hunk storms, then. His voice never rises this high, but he can’t help it. “For our own deaths? Lance has <em>changed</em>, Keith. He hasn’t spoken about his family in a long time. Not because he’s forgotten them, but because when he does mention them, his expression drops and he’s on the verge of tears. He doesn’t take care of himself anymore––you said it yourself today, his skin is no longer glowing. He’s grown more quiet, more distant. I’ve noticed it, but I… I never spoke up. I never knew what to say.”</p>\n<p>“He used to joke around a lot more.” Pidge adds.</p>\n<p>“Coping mechanism.” Shiro realizes. “The talking. The chatter. Someone who’s grown up in such a busy household would have gotten so used to the noise, to the activity. He was supplying it in hopes of this place feeling more homely.”</p>\n<p>But none of them had played along with him. None of them had noticed that if he wasn’t chatting mindlessly, then Lance would carry fear and anxiety on his expressions.</p>\n<p>“And what you said,” Shiro turns back to Keith. “Just wasn’t the right thing to say at the time. We’re going to have to apologize, okay? To each other, first, then to Lance when he comes back with Coran.”</p>\n<p>They stand in silence for the next few minutes, staring at their hands and shuffling their feet.</p>\n<p>“Well?” Shiro prods.</p>\n<p>“I’m sorry.” Allura begins, standing up from her seat. “I should apologize first. I… I am harsh. I heard Hunk and Pidge and I… I thought that I would need to make them work harder because their minds are elsewhere, thus I need to make them focus. But the only way to make you want to be here is by making you like this place. This… make-shift home, if you will. You’re my team. You’re paladins. But you’re also so much more… You<em> have</em> become my family.”</p>\n<p>Pidge smiles, surprised. Hunk’s eyes begin to water.</p>\n<p>“Thank you, Allura.” Shiro replies with a small smile. “And the same goes for me. I don’t want any of you to leave––not just because of Voltron, but because I care about you, I enjoy your company. I want <em>you</em> to be here.” He looks at Keith. “All of you.”</p>\n<p>“Me too,” Keith then blurts out, turning his gaze to the ground. “I don’t want any of you to leave, okay? Hunk was right when he said we were like brothers after that mission. You guys <em>are</em> the only family I’ve ever had. You––you have high expectations for what makes a family, but I <em>don’t</em>. I don’t know how to be a good brother. I don’t know what siblings do! I’m sorry. I was just… I just… I didn’t know any of you felt that way. I thought we were all content with this little family that we had.”</p>\n<p>“Awh, Keith,” Hunk murmurs, immediately softening up. “I didn’t know <em>you</em> felt that way, either. We can show you, you know? We can show you how siblings spend time playing random games, or how… or how we like, confide in each other. How we can just go crazy and not worry about someone judging us.”</p>\n<p>Keith nods, biting down on his lip as his eyes begin to turn red. “I always judge Lance for anything funny or crazy that he did.”</p>\n<p>Pidge nods in agreement. “Well, me too, sometimes. But being siblings also means arguing and throwing pillows at each other… It just never lasts. The anger, I mean. I think that’s what makes a family. At the end of the day, you know you have each other, even if you had been fighting and arguing for the past two weeks.”</p>\n<p>“Okay.” Keith says quietly, absorbing in all the information they were giving him. “Then… Then I’ll learn. I’ll try my best to be a good sibling. I promise.”</p>\n<p>Shiro chuckles whole-heartedly, bringing Keith in for a gentle hug. When he extends his other arm out, Pidge and Hunk immediately join the group hug.</p>\n<p>Then Coran walks in, and tells them that Blue wouldn’t allow him to see Lance. The mood drops, but Shiro assures them that Lance will hear them out whenever he feels a bit better.</p>\n<p> </p>\n<p align=\"center\"> </p>\n<p>Lance awakens to the sound of alarms blaring.</p>\n<p>“Paladins!” Allura is calling out through the coms. “We’re under attack!”</p>\n<p>Lance awakens to the sound of alarms blaring.</p>\n<p>“Paladins!” Allura is calling out through the coms. “We’re under attack!”</p>\n<p>Lance startles, sitting up in the pilot’s chair. He rubs at his eyes warily, trying to recall what had happened earlier, and…. Oh. He’d childly stormed out of breakfast because of a few words Keith had said. God <em>damn</em> it. His problem had been the team not believing he was good enough to pilot the blue lion, that he wouldn’t be good enough on the battle field because he lacked that paladin bond… and he’d only proven their accusations.</p>\n<p><em>I want to go home</em>, he’d said.</p>\n<p>Of course he wants to go home. So do Hunk and Pidge. No one wants to be out here, fighting Zarkon and facing the possibility of death at every mission. And he’d managed to be the selfish one, the cowardly one, who cared more about his own happiness and comfort than the rest of the <em>universe’s</em>.</p>\n<p>They’ll never forgive him.</p>\n<p>His hands begin to shake, and he shuts his eyes, allowing a soft sob to sound. He’d messed up, again. He’d told the team that they weren’t his priority, that fighting Zarkon wasn’t his priority… But that’s not true! They’re his priorities, along with his family back on Earth. He can have multiple priorities––he just… he gets homesick at times, he gets tired…</p>\n<p>But it’s too late for that, now. Why would the team give him another chance? Allura had said it herself; the paladins need to focus on their mission and their mission alone. Lance couldn’t do that––his mind kept drifting back to his family, to the ocean, to <em>Earth</em>. It was why his paladin bond was weak: he’d been focusing on the wrong things.</p>\n<p>And yet… he couldn’t help it. Yes, he was weak, and he will admit that. He is weak, and he can’t help but think about what he’s left behind, what he may never again see.</p>\n<p>“Lance, are you there?” Shiro’s voice comes, and Lance’s eyes snap open. When had he even shut them?</p>\n<p>He picks up his helmet, licking his lips drily. “Shiro?”</p>\n<p>Shiro lets out a sigh of relief. “Are you in Blue? We’re going to need you out here, buddy. Zarkon’s attacking the castle.”</p>\n<p>Lance freezes, hands hovering over the touchpad on Blue’s control panels. There is an attack, and he would need to go out there and fight––alongside the team? How in the seven hells are they supposed to form Voltron?</p>\n<p><em>Can</em> he fight alongside the team?</p>\n<p>“I am,” he rasps. Shiro is asking him to fight with them. After the childish fit he had thrown earlier. If they are willing to fight with Lance by their side, who is he to refuse? “I’ll get on it. Where are they located?”</p>\n<p>A hologram pops up on the display, highlighting the locations of the enemy with pulsing red dots. It seems that a fleet of Galra are nearing the castle from his direction, so Lance decides to take them on. Maybe fighting some Galra will help him focus on something else.</p>\n<p>“Let’s do this, Blue,” he encourages, trying to bring as much strength into his voice as he can.</p>\n<p>Blue stands up, bringing down the particle barrier, and the ceiling of the hangar opens up. Lance can feel her eagerness as they fly out, heading on to attack the Galran fleet.</p>\n<p> </p>\n<p> </p>\n<p>Shiro is almost thankful for the attack, only for the fact that he was able to speak to Lance and get him back up with the team without actually having to speak about what happened. They <em>will</em> speak about it, once they’ve taken down the enemy, but hopefully by then Lance will have fallen back into the team spirit and possibly recovered a bit from his previous conversation with Keith.</p>\n<p>And so, they fight. The fleets aren’t exactly strong, but there are a <em>lot</em> of them. It seems that whenever they take down one of them, three come in its place. There must be a wormhole open somewhere that’s far enough that they can’t detect it, but close enough that the fleets can easily make their way to them.</p>\n<p>It’s frustrating.</p>\n<p>“We’re going to have to start a wormhole,” Allura informs them. “The castle is taking harsh hits, and there are too many of them for you to fight.”</p>\n<p>“Alright,” Shiro responds. “Let us know when we’re ready to go!”</p>\n<p>“Of course.”</p>\n<p>The wormhole takes a few more minutes to form, and as soon as it does, Allura calls out, “We’re ready! Paladins, make your way to the wormhole immediately!”</p>\n<p>They do. The Galra fleet are on their tail, but they manage to all get in there. As Allura hurriedly presses the button to close the wormhole, however, they see a wide, long bolt making its way into the wormhole with them.</p>\n<p>Nothing happens at first, and Allura allows herself to sigh out in relief.</p>\n<p>But then the wormhole begins to shake, and the castle shake along with it. The paladins begin to yell out as their lions lose contact with the castle, falling away, and then….</p>\n<p>And then they fall out of the wormhole.</p>\n<p>Allura gasps, shaking her head frantically. “No!” She shouts. “Paladins, can you hear me? Where are you!”</p>\n<p>“Allura!” Shiro calls back. “Open the hangars so Pidge and I can get back into the castle!”</p>\n<p>She does. “And the others?”</p>\n<p>Shiro is silent for a few more moments, presumably as he finds his way to the hangar and climbs out of Black. Then, in a small voice, he answers: “I don’t know.”</p>\n<p>They reach their destination, then, and the wormhole shuts behind them. Allura falls back into her chair. “Oh no.”</p>\n<p> </p>\n<p> </p>\n<p>Lance wants to scream.</p>\n<p>Blue has shut down, <em>entirely</em>. The control panels are turned off, the communication system is turned off, their connection is off. He can no longer feel her, and it throws him off guard. He hasn’t realized how accustomed he’d grown to her voice, her warmth, in his head until… until he’s lost it.</p>\n<p>Until he’s lost <em>her</em>.</p>\n<p>He’s not sure when his screams turn into sobs. He’s lost Blue––he’s lost the closest thing he’s had to home.</p>\n<p><em>Home</em>.</p>\n<p>It is only getting farther and farther away…</p>\n<p> </p>\n<p> </p>\n<p>Lance wakes up when he’s thrown across the cockpit, and he lets out a soft groan, wrapping his arms around his head as he falls backwards again. It goes on for a short while before they finally come to a stop.</p>\n<p>Pushing down his nausea and the throbbing in his head, Lance brings himself to stand up. He limps his way over to the windows, realizing that he must have twisted his ankle during the crash.</p>\n<p>They’re surrounded by ice. Fields of ice and snow stretch out ahead of him, beside him. There are no mountains, no hills…. there is nothing but flat, icy land.  The sky is a blank, grey canvas. The atmosphere is suffocating.</p>\n<p>It makes him shudder.</p>\n<p>Blue is still out. Lance runs his hand over the control panel, urging her to wake up, hoping she will feel his touch. When she does not respond, his hands hover up to his helmet, gently prying it off. The light that normally flashes red for the communication system has lost its pulse.</p>\n<p>His gaze flickers back outside, and a hollowness fills up in his chest. His shoulders sag, and he lets his helmet drop to the ground, echoing inside the silent lion and rolling way from him.</p>\n<p>He’s alone.</p>\n<p> </p>\n<p> </p>\n<p>Eventually, it begins to grow chilly inside Blue. Then it gets colder. Lance can feel the coolness slip through the armour and onto his skin, somehow, and he curls in on himself. He wishes Keith and his Lion were here; at least Red could breathe fire, you know? He would warm the place up. But Blue could only make… more ice.</p>\n<p>If she can just wake up, if her systems turn back on… then Lance can at least activate the heating system. But she’s not waking up, she’s not even <em>stirring</em>.</p>\n<p>“Gah!” He yells out, throwing his head back against the wall in anguish. His teeth are chattering, and the tip of his nose is beginning to grow numb. So he leans forward again, cradling his head in his arms, and relies on his warm breathing to bring some heat.</p>\n<p>“Blue!” He calls out in a muffled voice. “Blue, please, <em>wake up</em>!”</p>\n<p>She doesn’t.</p>\n<p>Time passes. Lance isn’t exactly sure how long it goes on for. When he wakes up, he grabs all the fabrics that he can find around Blue, and is thankful for the emergency fire blanket. It keeps him fairly warm––for a little longer, at least. All he can do is sleep, really, before he wakes up to find that he’s kicked off the blanket and hurries to wrap it around himself again.</p>\n<p>The water and ration supplies are low, so he doesn’t allow himself to drink or eat more than the bare minimum. Who knows how long he will be out here?</p>\n<p>The longer Blue lies in the icy desert, the colder the cockpit begins to grow. Frost begins forming on the insides of the windows. Then it slowly makes its way to the walls.</p>\n<p>Lance can’t begin to imagine what Blue must look like from the outside. Is she covered in snow? Will anyone be able to spot her when they come looking?</p>\n<p>If. If they come looking.</p>\n<p>Who would find him out here?</p>\n<p>Sometimes, when Lance dozes off, he can see his family. His mother bringing him hot soup while his father wraps a warm blanket around him, fresh out of the dryer. His older sister knitting him ugly, but comfortable, gloves and socks. His little siblings building a blanket fort around him, all huddling by his side.</p>\n<p>Sometimes, he almost feels warm.</p>\n<p>But then he wakes up again, and he’s gasping, and his lungs are burning with every inhale of the cold air.</p>\n<p>He cries, at first. Allows the tears to drop. But they freeze, right on his cheekbone, and they become painful when they solidify around his tear ducts. So… no, he can’t cry anymore.</p>\n<p>But he can scream. So he does.</p>\n<p>He continues to scream. Time progresses. The sky outside does not change––there is no night, or morning. He is in eternal, suffocating greyness.</p>\n<p>He misses his family.</p>\n<p>No, he misses <em>both</em> his families. The one on Earth… and the one in space.</p>\n<p>How are they faring, he wonders? Did they end up stranded on other planets, too, or did they make it back safely with Allura? Oh, no. What if they were hurt? What if they were caught by the Galra? What if they needed Voltron, and his absence was stopping them?</p>\n<p>Or what if they’re all home, in the castle, eating Hunk’s make-do food? That. He would rather imagine that. The food is warm, and Keith and Pidge compete to shove it down. Shiro smiles at them warmly, sharing a fond look with Allura. Coran must be cleaning the pods all by himself. They’re probably training, and Hunk is grumbling about how Keith is too impatient during the group practices….</p>\n<p>Lance falls asleep thinking about his family.</p>\n<p> </p>\n<p> </p>\n<p>When Blue wakes up––God, is it days later? or is it weeks?––Lance does not feel her usual purring or the soothing warmth in his mind.</p>\n<p>No, he feels her anguish. He feels her screams.</p>\n<p>It throws him off, and he startles, sitting up abruptly. A headache begins to thump in his skull, and Lance shuts his eyes, squeezing his palms up against his temples. “Blue! Blue, what’s going on?”</p>\n<p>She relaxes, just a little, upon hearing Lance’s voice. But her screams do not falter.</p>\n<p>Lance makes his way over to the Pilot’s chair, which is now covered with frost. He gulps down heavily, attempting to calm his chattering teeth, and frantically runs his hands over the control panels. “Blue! Blue! Calm down, <em>please</em>!”</p>\n<p>A few moments later, Blue <em>finally</em> begins to calm down. Her screams turn to whimpers, and Lance finds himself joining along. “Blue, please, what’s hurting you?”</p>\n<p>She can’t move.</p>\n<p>The ice must have hit her pretty hard from the outside.</p>\n<p>“That’s okay, blue,” Lance soothes. “You’re back. You’re awake, oh God, I’ve missed you. Don’t worry. You’re––you’re the guardian of the water, aren’t you? You breathed out ice in that fight! This ice shouldn’t stop you. It won’t!”</p>\n<p>She’s a bit hesitant.</p>\n<p>“Look, now that you’re back online, you can start to heat up the interior of this place. It’s going to warm you up, and slowly you can melt off the ice that’s around you. Or maybe you can manipulate the ice?”</p>\n<p>She doesn’t reply, but he can almost feel her considering the question.</p>\n<p>She has never tried to manipulate existing ice.</p>\n<p>“Then––then you should! First time for everything, Blue!” His voice is growing higher and higher, and his hands are shaking. It’s <em>freezing</em>. “We can do this!”</p>\n<p>It takes a while for her confidence to build back up, but Blue eventually begins trying to move. She starts by activating the heating systems. Then, Lance can hear the ice cracking on the outside, and it almost sounds like the sound of shattering glass.</p>\n<p>It might work.</p>\n<p>“Are the communications on?” He asks. He hopes.</p>\n<p>They’re not. At least, not yet. But they’re getting back on, Blue assures him.</p>\n<p> </p>\n<p> </p>\n<p>Coran is first one to see the flashing signal.</p>\n<p>He can’t believe it, at first. Can’t believe that Blue’s whereabouts are suddenly present on the holographic map.</p>\n<p>When the information settles in, he rushes to the common meeting room, where he knows Allura will be sitting along with at least a few of the fellow paladins. He enters, short of breath, and calls, “Princess Allura! We’ve found the blue lion’s signal!”</p>\n<p>Allura stands up, eyes widening. “You’ve located it?”</p>\n<p>“Yes, Princess!”</p>\n<p>Keith and Hunk follow suit, rising to stand up. “What? Where is he?” Hunk asks.</p>\n<p>“It appears he’s not so far from here, actually. He’s in the same galaxy, for starters.” Coran informs them. He turns around then, hurrying back to the control room, and the others follow him. “But the stats don’t read it as a very… habitable planet. I do hope Lance has managed with his best.”</p>\n<p>“He’s been stranded out there for three weeks,” Keith says heavily. “Why didn’t Blue’s signal turn on earlier? You guys were able to find me and Hunk just a few days after we fell through the wormhole, because our lions were still online. Why would Blue turn off?”</p>\n<p>“She may have gotten a harsh hit,” Allura suggests. “Or they may have passed through something in the wormhole that temporarily disabled her.”</p>\n<p>“I would think the latter is more likely,” Coran notes. “You pass through all sorts of things in a wormhole, and if it’s a wonky one, you might just stay in a place long enough for it to cause some damage. Hopefully, this damage is not too serious.”</p>\n<p>“I’ll go tell Shiro,” Keith volunteers. “We’re going to have to head there as soon as possible.”</p>\n<p> </p>\n<p> </p>\n<p>“Lance!”</p>\n<p>Lance startles awake. When had he dozed off? It’s warmer inside Blue now, thank God, but he keeps the blanket wrapped around him for good measure. He can’t risk growing cold again. He doesn’t <em>want</em> to feel that.</p>\n<p>“Lance, can you hear us?”</p>\n<p>… What?</p>\n<p>He must be feverish. He must be imagining Shiro’s voice.</p>\n<p>“I don’t think he can hear us.” He can hear Keith grumble. It’s very realistic. “Maybe he’s asleep?”</p>\n<p>Lance begins to shake as a pulse of Adrenaline runs through him. Could it be real? Maybe… Maybe he’s not imagining their voices?</p>\n<p>Blue glows with that warmth again, and she assures him that yes, this is <em>real</em>.</p>\n<p>“Shiro?” He rasps.</p>\n<p>Well, it sounds more like: “Sh-yuh?” He hasn't spoken in <em>days</em>, and with all the cold air he’s been inhaling…. He clears his throat, and tries again. “Shiro.”</p>\n<p>“Lance!” It’s Hunk that calls out this time. “You’re awake! You’re <em>alive</em>!”</p>\n<p>The others chime in with “Lance, buddy!” and “Lance!!!” and “Oh, <em>Lance</em>!”</p>\n<p>A grin makes its way onto Lance’s face, and he finds himself laughing.</p>\n<p>He’s <em>laughing</em>.</p>\n<p>The laughter grows hysterical, but, hey… The team has contacted him. They’ve contacted him!</p>\n<p>“You guys found us?” He croaks, before giggling. “You found us.”</p>\n<p>“Yes, Lance. Yes, we did.” Shiro assures him. “We’re on our way––We’re already on the planet you seem to be on, but we’re not sure where you are, exactly. This is… a big field of ice. Hard to know where we’re going.”</p>\n<p>Yes. Yes, the field of ice that has been his brief home for the past… the past… “How long?” He manages to ask.</p>\n<p>Pidge seems to understand. “You’ve been out here for three weeks.” She lets out a shuddering breath. “We were really, <em>really</em> worried about you.”</p>\n<p>Three weeks.</p>\n<p>He honestly hadn’t expected he would make it that long.</p>\n<p>“I spot him!” Hunk calls out. “But Blue’s half-covered in snow!”</p>\n<p>“Hold steady, Lance. We’re going to dig you guys out of there.” Shiro says.</p>\n<p>Well, it’s not like Lance can really do anything else anyway. So he remains in his seat, hands fisting around the blanket, as his body shakes giddily. The grin does not fall off his face.</p>\n<p>Once they reach Blue, Red immediately activates its flamethrower and carefully melts the snow and ice surrounding the other lion. Once most of it has been removed, they hurry down to stand next to Blue and Lance, the other paladins following suit.</p>\n<p>All eager to see their friend once again, the paladins climb out of their lions, sliding down the face masks on their helmets to shield them from the cold. They walk in the semi-clear path Red had created, and stand before Blue’s mouth, urging her to open up.</p>\n<p>She does, and they rush inside.</p>\n<p>“Lance!” Hunk shouts, running to his friend. He wraps him in a hug immediately, squeezing tight, before letting go. “Wow, dude, your face is <em>cold</em>.”</p>\n<p>Lance stares at his friend, the smile frozen on his face… but his thoughts are starting to get jumbled as the reality of the situation begins to kick in.</p>\n<p>They’ve found him.</p>\n<p>His team, his <em>family</em>, is here.</p>\n<p>He thought he’d never see them again.</p>\n<p>He’s vaguely aware of the others hugging him, patting his head or shoulders, speaking excitedly. But he loses focus; He can’t hear what they’re saying, he can’t really focus on who’s touching him…</p>\n<p>The exhaustion, the pain, the loneliness, the sadness…</p>\n<p>It all comes crashing down on him.</p>\n<p>He’d been alone for <em>three weeks. </em>Three weeks without Blue, without the paladins, without… without <em>anyone</em>.</p>\n<p>He’d been alone, and he’d missed his families, and he’d prayed to see their faces just one more time, just… just one more time…</p>\n<p>And here they are. His prayers have been answered.</p>\n<p>The smile drops off his face, replaced by the immediate trembling of his lips.</p>\n<p>“Lance,” Shiro gently calls, placing a hand on Lance’s cheek. The others have quieted now. “Lance, you’re alright. You’ll be alright.”</p>\n<p>A sob shakes him, and Lance tries to shove it back, he really does, before it sounds.</p>\n<p>Another follows, then another. They grow louder, blending in together, and tears begin to cloud his vision.</p>\n<p>He thought he’d never see them again.</p>\n<p>Shiro pulls him in for a tight embrace, placing his human hand on the back of Lance’s head. “You’re alright, you’re alright,” he soothes. “You’ll be alright, Lance.”</p>\n<p>Lance’s body continues to shake with sobs, and they sound <em>heart wrenching</em>. Hunk wipes at his eyes, wiping at the tears that fall at the sight of his friend. Pidge sobs softly, hugging Lance’s side. Keith has to bite his lip to stop his own sob from forming.</p>\n<p>Three weeks. Three weeks since they’d last seen the blue pilot.</p>\n<p>Three weeks since Keith had told him to return home. Since Keith had told him he would not be needed in the team.</p>\n<p>One of Lance’s hands drops its grip on the blanket, and clutches onto Shiro’s shirt instead. A part of him wants him to pull it together, to stop being so <em>weak</em> in front of the team, to laugh it off and tease them about finding him so late.</p>\n<p>But he doesn’t have the energy for that.</p>\n<p>So he lets himself cry, and he lets Shiro hold him.</p>\n<p>“I was so cold,” he sobs, voice muffled by Shiro’s shoulder. “I was so cold.”</p>\n<p>Shiro shudders. “It’s a cold planet. I’m sorry we couldn’t find you sooner, Lance…”</p>\n<p>“Blue left me,” Lance continues. “She wouldn’t wake up. I was so cold.”</p>\n<p>Keith turns around, exhaling sharply, and allows a few tears to escape. Lance had been alone, and Blue had been powered down, <em>entirely</em>.</p>\n<p>“Thought I’d never see you,” Lance mumbles, another sob making its way through the sentence. “Lied. You’re my family. You’re all my family. Don’t want to leave you. I thought I’d never see you again.”</p>\n<p>“Hey, you’re right,” Pidge gently says. “We are your family. And we… we really wanted to bring you back. We’re so sorry, Lance, we didn’t––we didn’t want you to stay out here. I swear, as soon as we saw the signal, we rushed over here. We were so worried about you.”</p>\n<p>“I didn’t mean what I said, before you left,” Keith then adds, stepping closer. He sniffs. “I’m sorry. I wanted to apologize, but this all happened.” His voice is weaker, softer, than usual. “I didn’t mean it. You’re part of the team. I don’t want you to leave. We all missed you, and we were worried shitless. You’re… You’re my family, too, all of you. I’m sorry I wasn’t a good brother.”</p>\n<p>Lance doesn’t answer, but Shiro can feel his breathing slowly begin to relax.</p>\n<p>Then, “I was so cold.”</p>\n<p>The paladins exchange worried glances. Shiro then brings up the blanket again, wrapping it  tighter around Lance. “Then let’s get you someplace warmer, yeah? You guys focus on bringing back Blue. I’ll take Lance with me.”</p>\n<p>“S’ cold out,” Lance argues.</p>\n<p>“Just for a bit. Then we’ll get to Black, and you’ll get warmer. I promise.” He begins to walk towards the exit, then notes the way Lance is wobbling. “Lance, can you walk?”</p>\n<p>Lance sniffles, and shakes his head. He rubs at his eyes, and wipes away some of the tears trailing down his cheeks. “My ankle hurts.” And he’s fatigued. And he’s hungry. And cold.</p>\n<p>“Piggy back ride!” Hunk exclaims. “Come on, Lance. You can stay warm if you wrap your arms around my neck!”</p>\n<p>Lance’s lip is still quivering, but he nods. Keith helps him climb onto Hunk’s back, and Lance thanks him quietly, curling further into the blanket wrapped around him. Once they climb onto Black, and Hunk settles Lance onto the mattress/bench at the back, Shiro urges the blue paladin to rest. “You look like you need some serious rest,” he notes. “And a lot of Hunk’s cooking.”</p>\n<p>Lance attempts to crack a weak smile, nodding and sniffling.</p>\n<p>“Don’t worry. You’re safe now, okay? You're home.\"</p>\n<p> </p>"
}