{
  "id": "778759",
  "url": "https://archiveofourown.org/works/778759?view_full_work=true",
  "author": [
    "uraneia"
  ],
  "title": "Lord knows it would be the first time",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Scott McCall",
    "Lydia Martin",
    "Vernon Boyd",
    "Isaac Lahey",
    "Erica Reyes",
    "Jackson Whittemore"
  ],
  "additional_tags": [
    "mysterious child",
    "Angst",
    "Post-breakup",
    "Makeup",
    "Getting Back Together",
    "Lydia is not allowed to do magic without Stiles anymore",
    "Marking",
    "Derek Hale - Dog Walker",
    "Misunderstandings",
    "Kid Fic"
  ],
  "language": "English",
  "series": "",
  "published": "2013-04-29",
  "completed": null,
  "words": "12,287",
  "chapters": "1/1",
  "comments": "369",
  "kudos": "17,378",
  "bookmarks": "4,044",
  "hits": "238,409",
  "summary": "<p>Stiles is home from Berkeley for the summer, but only because he promised the pack. He'd rather not see Derek, because whatever the thing was that they were doing, they're not doing it anymore, and it sucks. </p>\n<p>Unfortunately, he doesn't have a choice. The betas tried a magical remedy for Derek's melancholy, and now Stiles has a three-year-old who looks like Derek. Stiles doesn't know how to deal with that, and he <i>definitely</i> doesn't know how to tell the betas he and Derek were secret fuck buddies for a year and a half.</p>",
  "notes": "<p>Title from The Smiths' \"Please, Please, Please (Let Me Get What I Want),\" which is basically The Derek Song.</p>\n<p>As always, thanks to <a href=\"https://archiveofourown.org/users/lupinus\" rel=\"nofollow\">lupinus</a> for the beta.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>PS I just joined Tumblr because this fandom is ruining my life, so <a href=\"https://hatfulofcrazy.tumblr.com/\" rel=\"nofollow\">come be fan-tastic with m</a>e.</p>",
  "text": "<p>“Don’t freak out,” Lydia says when he answers the phone, and Stiles already knows it’s going to be one of those days.</p>\n<p> </p>\n<p>Maybe even one of those summers.</p>\n<p> </p>\n<p>It’s not that early, not really, but Stiles just got in from Berkeley at one last night, and he hasn’t had a good night’s sleep in years, or that’s how it feels. He’s tired; even opening his eyes hurts. “What did you do?”</p>\n<p> </p>\n<p>When she doesn’t respond right away, he knows the answer. “Lydia, we talked about this. No magic without the whole pack present.”</p>\n<p> </p>\n<p>“Yeah, well, excuse me, but you haven’t exactly been present these past few months,” she points out. Which, not fair—Stiles had school, and so what if he chose a week-long drunken haze in Cancun for spring break instead of more sad, claustrophobic Beacon Hills? Stiles works his ass off. He deserved that. “You didn’t see him, Stiles. He’s—”</p>\n<p> </p>\n<p>Stiles can’t listen to this. “The same bitter, angry Broody McBrooderson he’s always been?” He rolls over. “Some things never change.”</p>\n<p> </p>\n<p>But Lydia says, “He’s miserable,” and she doesn’t sound like she means to other people, and Stiles hates himself a little for the way his stomach twists. “We had to do something, okay? The spell was supposed to strengthen pack ties, that’s all.”</p>\n<p> </p>\n<p>Stiles sits up and rubs the sleep out of his eyes, glances at the clock. Quarter past seven. “Let me guess: it didn’t work as intended.”</p>\n<p> </p>\n<p>“We really need you here,” Lydia tells him.</p>\n<p> </p>\n<p>God damn it. Even now, Stiles can’t say no. He sighs. “Give me half an hour.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Once upon a time when Stiles came back from a four-month absence and walked into Derek’s house, he got puppy piled. Erica, Boyd, Isaac, Jackson, Lydia—the house is enormous and there are plenty of guest rooms to go around, though Stiles has never used them himself, and werewolves and their pet humans tend to be tactile. They’re all here today—Stiles was the last to finish exams—but there’s a conspicuous absence of hugs.</p>\n<p> </p>\n<p>Instead there’s a baby.</p>\n<p> </p>\n<p>“What the f—” Stiles starts, but one look from Lydia and he cuts himself off.</p>\n<p> </p>\n<p>In fairness, it’s not actually a baby. It’s more toddler-sized, with a sloppy black ponytail and brown eyes, and it’s holding a stuffed wolf and screaming its head off.</p>\n<p> </p>\n<p>Or it is, until Stiles shuts the door behind him, and then it—she—sniffs the air, wipes her face on the wolf, and says, “Daddy?”</p>\n<p> </p>\n<p>“I hate you all so much right now,” Stiles tells them. This is his life now, with mysterious magical children popping up unexpectedly. But it’s not like he can just let her cry, so he squats down to the floor and says, “Hi, pumpkin.”</p>\n<p> </p>\n<p>And that’s where he is, sitting on the floor in the middle of Derek’s living room with a sniffling kid on his lap, when Derek appears at the top of the stairs.</p>\n<p> </p>\n<p>By design, Stiles hasn’t seen him in four months, and he could happily have gone another four. Because it <em>hurts</em>, looking at him now, seeing the shadows under his eyes, the gray cast to his skin, the way his nails lengthen where he’s gripping the banister. Derek never loses control like that, except apparently when Stiles shows up unexpected.</p>\n<p> </p>\n<p>Stiles isn’t exactly feeling the most in control right now himself, but he doesn’t have a dangerous alter-ego.</p>\n<p> </p>\n<p>“Someone had better explain what’s going on,” Derek says tersely before stalking out of the room to the kitchen.</p>\n<p> </p>\n<p>Stiles looks at the rest of the pack. “You guys know I hate to agree with Derek. But.”</p>\n<p> </p>\n<p>“We didn’t know this would happen,” Jackson protests, and Stiles rolls his eyes, because <em>obviously</em>.</p>\n<p> </p>\n<p>“We thought it didn’t work at all,” Erica says with a shrug. She’s staring at him intently, though, and Stiles can see her nostrils flaring like she’s playing What’s That Smell. “Then we woke up this morning and there she was.”</p>\n<p> </p>\n<p>“Just like magic,” Stiles says very pointedly, and suddenly nobody wants to look at him. Great. He was planning on avoiding them this summer, on maybe finally making up with Scott, but it doesn’t look like that’s going to happen now. Not for a while at least. He sighs. “What’s your name, sweetheart?”</p>\n<p> </p>\n<p>“Tori,” she tells him, and Stiles has to fight the urge to clench his fists, because nobody in this room knows it, but that was his mother’s name.</p>\n<p> </p>\n<p>Derek knows, of course, but Derek knows more about him than maybe anyone should.</p>\n<p> </p>\n<p>“Well, Tori,” Stiles says past the lump in his throat, “how about we go out for breakfast, huh? You like pancakes, right?”</p>\n<p> </p>\n<p>“Pancakes!” Tori affirms.</p>\n<p> </p>\n<p>“Awesome.”</p>\n<p> </p>\n<p>But before Stiles can make good his escape, Derek comes back in with two cups of coffee, one of which he hands to Stiles without comment. He can’t seem to keep his eyes off Tori, though, and Stiles wonders what it’s costing him, seeing a kid in this house again, a house that hasn’t seen children in more than a decade. Derek’s looking at her like he’s <em>starving</em>.</p>\n<p> </p>\n<p>“Alpha,” Tori says happily, and she climbs out of Stiles’s lap and latches on to Derek’s shin instead. “Pancakes?”</p>\n<p> </p>\n<p>Stiles doesn’t need werewolf senses to know Erica and Lydia just melted. He counts himself lucky that so far no one’s been sharp enough to see his heart breaking.</p>\n<p> </p>\n<p>It’s better not to go out anyway, he tells himself. If his father sees him around town with a kid who calls him Daddy, there are going to be questions. His dad may be hip to the whole werewolf thing now, but somehow Stiles thinks this warrants a special heads-up.</p>\n<p> </p>\n<p>Especially since the kid is named after his mom.</p>\n<p> </p>\n<p>“I’ll make them,” Lydia volunteers at last, breaking the tension. “Stiles, you can set the table.”</p>\n<p> </p>\n<p>Even now, sometimes Stiles has to thank God for Lydia.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>“Don’t start with me” is the first thing Lydia says when Stiles joins her in the kitchen. “I know.”</p>\n<p> </p>\n<p>He just nods and starts taking down the plates. It’s not like he’s never set the table for pack breakfast before; he could do it in his sleep. Stiles could berate her for this—could cheerfully wring her neck—but she wouldn’t have resorted to magic in the first place if she weren’t desperate. “Okay.”</p>\n<p> </p>\n<p>They hear the patio door sliding, and when Stiles looks out the window the pack has moved into the yard, Tori held safely in Derek’s arms.</p>\n<p> </p>\n<p>Lydia gets the milk out and starts whisking to cover their conversation. “I know you know what’s wrong with him.”</p>\n<p> </p>\n<p>Stiles lies to cover his guilt. “There’s nothing wrong with him. Same old Derek.”</p>\n<p> </p>\n<p>Lydia purses her lips. “I don’t think so. He was getting better.”</p>\n<p> </p>\n<p>Maybe. But not as better as he could have been. Not good enough to trust Stiles, not good enough to tell him anything. “I’ll get the orange juice from the basement,” he says, and that’s that. Conversation over.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Lydia makes Tori Mickey Mouse-shaped pancakes, which Tori eats with her hands, dipping the ears in syrup. She can’t reach the table and there’s no booster seat, so she spends breakfast in Stiles’s lap while he eats one-handed.</p>\n<p> </p>\n<p>Derek stares at them and barely touches his plate, but no one says anything.</p>\n<p> </p>\n<p>Stiles breaks the silence at last, when Erica and Jackson are cleaning up the dishes. “I guess I should go shopping. And I probably need a book. Or a lobotomy.”</p>\n<p> </p>\n<p>“You should tell your dad,” Derek says, standing abruptly. “I’ll take care of the rest.”</p>\n<p> </p>\n<p>Stiles doesn’t want him to. Doesn’t want this, this insane existence where at twenty he suddenly becomes primary caregiver to a three-year-old he’s never met. Doesn’t want Derek to have anything to do with him and his maybe-daughter.</p>\n<p> </p>\n<p>Or at least he doesn’t want to want those things.</p>\n<p> </p>\n<p>“Okay,” he says, because Derek’s right: he has to tell his dad.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>“Don’t freak out,” Stiles says, and cringes because he can practically hear his father raising his eyebrows.</p>\n<p> </p>\n<p>“The last time you opened with that I learned werewolves are real,” Dad says.</p>\n<p> </p>\n<p>Unfortunately true. “This is a significantly bigger shock, trust me.”</p>\n<p> </p>\n<p>“Is that why you’re calling from the Jeep?”</p>\n<p> </p>\n<p>And, well, his dad has a point. Stiles is sitting in the driveway, and his dad is home, and this probably looks really suspicious.</p>\n<p> </p>\n<p>But not as suspicious as it does when Stiles opens the door to the house with a toddler propped awkwardly on one hip and Tori squeals and kicks her feet and says, “Grandpa!”</p>\n<p> </p>\n<p>“Surprise?” Stiles says, the opposite of brave.</p>\n<p> </p>\n<p>His father covers his face with one hand. “You should come with a warning label.”</p>\n<p> </p>\n<p>“So should mysterious magical offspring,” Stiles says. “Trust me, I get it now.” He owes his dad so many apologies.</p>\n<p> </p>\n<p>But maybe this is one thing he doesn’t have to apologize for, because his dad doesn’t look angry. “Can I…?” he asks, and he has the same expression Derek wore this morning, all pinched hope and want overlaid with sadness.</p>\n<p> </p>\n<p>“That okay with you, pumpkin?” Stiles asks, and it must be, because she holds out her arms to be passed over.</p>\n<p> </p>\n<p>His dad is a natural with kids, always has been, and Tori’s no exception. Maybe he’s been hanging around with werewolves too long, but the first thing he does when he gets her is put his face close to her neck and breathe her in. It’s the same thing Stiles did, the same thing Tori’s doing to his dad now, only her version involves a lot more nuzzling.</p>\n<p> </p>\n<p>“Dad, this is Tori,” Stiles says a little hoarsely. “Tori… this is my dad.”</p>\n<p> </p>\n<p>“Grandpa,” Tori repeats firmly, and yeah, that works too.</p>\n<p> </p>\n<p>“Tori?” His dad’s voice breaks a little.</p>\n<p> </p>\n<p>Stiles would be lying if he said he weren’t feeling a bit verklempt himself. “The name was included.”</p>\n<p> </p>\n<p>“Aunt Lydia made Mickey Mouse pancakes,” Tori says brightly.</p>\n<p> </p>\n<p>“Early talker, huh?” Stiles’s dad says. “Wonder where you got that from.”</p>\n<p> </p>\n<p>Stiles isn’t sure that’s necessarily fair—she doesn’t look anything like him and probably isn’t biologically his. But he leaves it be, because they have more than enough crazy going on at the moment.</p>\n<p> </p>\n<p>“So how did this happen?” his father asks when they’ve found an old Disney DVD to pop in for Tori.</p>\n<p> </p>\n<p>“Magic, what else.” Stiles scrubs his hands over his face. “I don’t know. It was Lydia’s idea, I think. Something to bring the pack closer together. I think it’s been hard for them, splitting up for school.”</p>\n<p> </p>\n<p>“I haven’t seen much of Derek lately,” his dad segues unsubtly.</p>\n<p> </p>\n<p>“That just means you haven’t had to arrest him in a while,” Stiles mutters, because oh God he does not want to talk about Derek. Definitely not in front of his kid.</p>\n<p> </p>\n<p>Dad rolls his eyes. “And anyway, what do you mean, ‘them’? It hasn’t been hard for you?”</p>\n<p> </p>\n<p>The last four months have been the worst since Mom died, but Stiles can’t tell his dad that, because his dad will push and push until he finds out why. “It’s different for werewolves,” he says instead of answering. “I think they only did it without me because they knew I’d stop them if they tried to do it when I was here.”</p>\n<p> </p>\n<p>Dad nods. “Is it… I mean, is she here to stay?”</p>\n<p> </p>\n<p>Stiles wishes he could tell him what he so obviously wants to hear. Instead he says, “Lydia’s looking into it.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Because the universe hates Stiles, when he answers the door, Scott is on the other side.</p>\n<p> </p>\n<p>It’s not that Stiles and Scott aren’t friends anymore. It’s—</p>\n<p> </p>\n<p>Well, no, it is. They aren’t friends and haven’t been in months, maybe longer, so Stiles doesn’t know what Scott’s doing here, except obviously he came to gawk.</p>\n<p> </p>\n<p>“Isaac told me what happened,” he says, holding up his phone as if that explains everything.</p>\n<p> </p>\n<p>Stiles wants to close the door in his face. “Yeah, well, you know how it is. You’re a little late getting back into town and your friends summon a child from another dimension.” Or something.</p>\n<p> </p>\n<p>“Stiles?” Dad asks. Fucking perfect timing as always. “Who’s at the door?”</p>\n<p> </p>\n<p>And then of course Stiles has to invite him in, even though he doesn’t want to talk to Scott. Hasn’t wanted to talk to Scott in four months.</p>\n<p> </p>\n<p>He’s not sure anymore exactly what happened or how, but he knows it started with Allison, or maybe it started when Stiles dragged Scott into the woods to look for half a dead girl.</p>\n<p> </p>\n<p>Maybe it started when Stiles started sleeping with Derek and his best friend didn’t notice.</p>\n<p> </p>\n<p>When Scott comes in, Tori looks back from her movie with wide eyes.</p>\n<p> </p>\n<p>Scott takes a step back and Stiles curses, because fuck, of course. Of course this would happen. “Uh, Stiles,” Scott says.</p>\n<p> </p>\n<p>And yeah. This is his life.</p>\n<p> </p>\n<p>“Your kid’s a werewolf.”</p>\n<p> </p>\n<p>Fuck. “Yeah, you know, not really surprised there, just about everyone’s a werewolf these days.” His dad is taken aback, though, at least a little.</p>\n<p> </p>\n<p>“She smells like Derek,” Scott continues, and just, no.</p>\n<p> </p>\n<p>“She’s pack,” Stiles points out, gritting his teeth. “We just came from there. Of course she smells like Derek.”</p>\n<p> </p>\n<p>But Scott shakes his head. “No,” he says adamantly. “I don’t mean she has Derek’s scent on her. I mean she smells similar. To. Derek.”</p>\n<p> </p>\n<p>Stiles wasn’t going to think about it. Wasn’t going to think about her pretty dark hair or her skin or her eyes or the way she says “Alpha.” He’s just human, and he doesn’t have to think about why his maybe-daughter doesn’t actually look anything like him if he doesn’t want to, because probably she’s adopted. But Scott ruins fucking everything, as usual.</p>\n<p> </p>\n<p>“He has a point,” Dad says after a silence he apparently can’t read well enough to stay out of it. “If that’s not Derek Hale’s kid—”</p>\n<p> </p>\n<p>Jesus, Stiles cannot catch a break today. “Stop.”</p>\n<p> </p>\n<p>And to his surprise, they do. “Tori, pumpkin. Let Scott show you how to use the headphones, okay?” He doesn’t know much about how werewolf hearing develops, but he knows childhood trauma, and so does Scott.</p>\n<p> </p>\n<p>Tori wrinkles her nose. “He doesn’t smell like pack,” she says distrustfully, and Scott flinches. But she doesn’t actually try to claw his face off when he puts the headphones over her ears, so that’s something.</p>\n<p> </p>\n<p>Scott joins them in the kitchen after. “What the hell, Stiles?” he hisses. “This is fucked up.” Then he looks at Stiles’s dad. “Sorry, Mr. S.”</p>\n<p> </p>\n<p>Dad waves him off. “No, no, that’s valid. This is fucked up. Stiles. Is there something you’d like to tell us?”</p>\n<p> </p>\n<p>Stiles grits his teeth and barely curbs the urge to grind the heels of his hands into his eye sockets. “Derek and I aren’t together,” he says firmly.</p>\n<p> </p>\n<p>And then the reality of it washes over him in a way it hasn’t in four months, and for the first time he acknowledges the truth out loud. “Derek and I aren’t together <em>anymore</em>.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Stiles and his father have a lot in common, and one of those things is that they’re one great love kind of people. Stiles always thought Lydia would be his, but then he realized hers was Jackson, and after a while that was even okay and didn’t hurt. But Derek is a festering wound that scabs over but refuses to heal; it’s always tender and oozing, and it always hurts, <em>has</em> always hurt, even when they were together.</p>\n<p> </p>\n<p>The first time they slept together, Stiles’s dad was in the hospital with a broken wrist and a concussion after a banshee hunt, and Stiles was two weeks shy of eighteen, edgy and prickly, and needled Derek more than usual until Derek shoved him against his bedroom door and kissed him to shut him up.</p>\n<p> </p>\n<p>Stiles wasn’t in love with him, not then, but he was in love with Derek’s mouth, the rasp of stubble across his shoulder, the way their bodies fit together, the way he could <em>forget</em>. The way sex calmed the thing inside of him that wanted to do everything at once. In another life he’d have wanted his first time to be with someone he cared about, to be special, but this is <em>his</em> life, and he’s learned to make do with getting what he needs.</p>\n<p> </p>\n<p>He never expected that to mean semiregular sex with Derek Hale, but he never complained about it either.</p>\n<p> </p>\n<p>To his credit, Dad doesn’t look surprised, just resigned. He probably thinks the worst, which, in fairness, is probably pretty close to the truth. But Scott’s gone so pale he’s almost green, and he looks dangerously close to losing control. “What!?”</p>\n<p> </p>\n<p>Somehow this already very long day just got longer.</p>\n<p> </p>\n<p>“Don’t give me that.” It comes out in a snarl, and the tone of it takes Stiles by surprise, but then again he’s never been very good at pulling his punches when he’s hurt. “You don’t get to act surprised, Scott, okay, you have <em>werewolf senses</em>. If you’d been there for me even <em>once</em> when I needed you in that year and a half, you would have known.”</p>\n<p> </p>\n<p>Scott recoils, just like Stiles planned he would, but his dad—</p>\n<p> </p>\n<p>“A year and a half?”</p>\n<p> </p>\n<p>And because Stiles is a massive fuckup, especially where Derek’s concerned, now he’s hurt his father too, by keeping something this huge from him. But he can only deal with one of these conversations at a time.</p>\n<p> </p>\n<p>“I can’t believe you didn’t <em>trust</em> me with this,” Scott says, almost as much in anger as pain.</p>\n<p> </p>\n<p>“Like you trusted me, you mean?” Stiles snaps. “Like you trusted me with your genius plan with Gerard that got people kidnapped and tortured? Oh wait.”</p>\n<p> </p>\n<p>“Tortured?” Dad repeats. God, this whole conversation has spun out of Stiles’s control. “What are you talking about? Stiles?”</p>\n<p> </p>\n<p>Scott takes a step forward, eyes flashing, but Stiles holds his ground. “I was trying to protect everyone! I had to do something!”</p>\n<p> </p>\n<p>“Well, great job, Scott! How many people got hurt or killed because you had to protect someone? Because you couldn’t see past the edges of your own ego?” And that’s not even counting what he did to Derek, but Stiles can’t ever say out loud what that was, because that’s just as much of a betrayal. “You don’t have to trust Derek, but I was your best friend. You could have trusted <em>me</em>.”</p>\n<p> </p>\n<p>Then Scott’s chin crumples and he looks away, and Stiles just feels <em>tired</em>. It’s exhausting, his whole existence, it’s too much, and he has to let this go or it’s going to eat him alive.</p>\n<p> </p>\n<p>“I was there for you, with Allison, okay? I was there for you and you <em>owed</em> me, and believe me, I wanted to tell you. But you never—you hate him <em>so much</em>. You made it impossible. Every time I tried, every time I even said his name, you shut me down. <em>You</em> made me choose, Scott, so you don’t get to be angry I didn’t choose you.”</p>\n<p> </p>\n<p>And that’s it, finally: sixteen years of friendship, the past four filled with hurt after hurt, and now it’s over. Stiles can never unsay any of it, and he doesn’t want to. Derek broke his heart and Stiles picked him anyway. Would do it again. “You should probably go.”</p>\n<p> </p>\n<p>He does, and some piece of Stiles goes with him, something he’ll never get back. Stiles wants to crawl into bed and pull the covers over his face and not come out.</p>\n<p> </p>\n<p>His dad puts a hesitant hand on his shoulder and says, “Let me pour you a drink,” and that will have to be good enough for now.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>It was never very often or expected and never more than what it was, comfort, something to cling to when the world went to shit, a way to be less alone when Isaac and Scott were out together, when Stiles’s dad got injured on the job, when someone was in the hospital or clung to life by their fingernails. When the anniversary of the fire passed, or of Stiles’s mother’s death, or when the chaos in his head got too loud.</p>\n<p> </p>\n<p>Derek always knew.</p>\n<p> </p>\n<p>Stiles can’t pinpoint the moment it became something else for him, something beyond what they needed, but he thinks, maybe, that first Christmas he was home from college, and he didn’t get in until late, and Derek came in his bedroom window and it felt like <em>I missed you</em>.</p>\n<p> </p>\n<p>At that point, he didn’t know what to do. Stiles has always been good with words as long as they don’t matter.</p>\n<p> </p>\n<p>Tori gets bored of her movie and climbs into Stiles’s lap before he finishes, and the way she fits there scares the shit out of him. Somehow in the past few hours Stiles has become Daddy to Derek’s <em>werewolf baby</em>, and he doesn’t hate it.</p>\n<p> </p>\n<p>No, he wants it so bad his jaw aches from clenching.</p>\n<p> </p>\n<p>“Daddy,” she says, “you smell sad.”</p>\n<p> </p>\n<p>Parenting a werewolf is going to be tougher than he thought. “How could I be sad when I have you?” Stiles says, and he doesn’t quite choke on the words, but it’s close.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>He never does go back to Derek’s that night.</p>\n<p> </p>\n<p>After dinner, he picks up his cell phone (seventeen new calls) and hits speed dial three for Lydia.</p>\n<p> </p>\n<p>He should really bump her up to number two.</p>\n<p> </p>\n<p>“We’re staying at my dad’s tonight,” he says. “Back tomorrow morning. Sorry, I know you guys probably set up a nursery while we were gone and everything. Just, Tori’s already asleep—”</p>\n<p> </p>\n<p>“You’re avoiding Derek,” Lydia offers. “You’ve been avoiding him and you didn’t come home for spring break.”</p>\n<p> </p>\n<p>“And I will continue avoiding him and this conversation until I’ve had a good night’s sleep,” he tells her. Then he hangs up and turns off the phone.</p>\n<p> </p>\n<p>He dresses Tori in one of his old T-shirts as pajamas, shares his toothbrush, washes her hands and face, and snuggles them both into bed before it’s even eight o’clock. Scott was right—she does smell like Derek, even to a human nose.</p>\n<p> </p>\n<p>Stiles falls asleep with salt water drying on his cheeks—</p>\n<p> </p>\n<p>and wakes up some time later, in the dark, with the window open.</p>\n<p> </p>\n<p>“Old habits die hard,” Stiles says, rough with sleep, and he regrets it already, but he scoots backward, pulling Tori with him against his chest. Making room. “Come to bed, Big Bad, I can’t sleep with you watching me.” Which is a lie, but Derek doesn’t call him on it.</p>\n<p> </p>\n<p>He can practically taste the tortured silence, because he knows Derek knows what offering this costs Stiles, but it doesn’t matter and never has. Derek can’t help needing this any more than Stiles can help giving it to him.</p>\n<p> </p>\n<p>It only lasts a few seconds, and then the bed dips as Derek climbs in, curling his body around Tori’s so they form a protective bracket. “Sorry I woke you.”</p>\n<p> </p>\n<p>“This is not going to be a regular thing,” Stiles says, and that’s a lie too, because he’ll never be cruel enough to deny Derek the chance to know family again, in whatever temporary capacity.</p>\n<p> </p>\n<p>Derek makes a sound, something Stiles can’t analyze with his brain still mostly asleep. He closes his eyes. He can finish regretting his life choices in the morning, when Derek is gone.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Only because the universe is a cruel mistress, Derek isn’t gone in the morning.</p>\n<p> </p>\n<p>No, he’s asleep in Stiles’s childhood bedroom with a three-year-old on his chest, the blankets shoved down past his bare feet.</p>\n<p> </p>\n<p>In a year and a half, Stiles never once woke up to Derek in his bed, not even in the middle of the night. It’s patently unfair that this is happening to him now, when he can’t have it anymore.</p>\n<p> </p>\n<p>Silently, he gets up and drags himself downstairs to the kitchen, where his father, currently far and away Stiles’s favorite person, is making coffee. He doesn’t even say anything until halfway through the second cup, when they both hear movement upstairs of the decidedly non-toddler variety.</p>\n<p> </p>\n<p>“Don’t freak out,” Stiles says again, manfully resisting the urge to bang his head on the table.</p>\n<p> </p>\n<p>Which is when Derek comes in with Tori propped on his hip. She’s dressed in an adorable new outfit of baby-size jeans, a black T-shirt with a pink puppy dog on it, and a miniature leather jacket. He must have brought the clothes with him last night.</p>\n<p> </p>\n<p>Stiles’s father says, “Good morning, Derek. Morning, Tori,” like this happens every day.</p>\n<p> </p>\n<p>Stiles loves his dad, like, so much. “Dude, cute outfit, but I think it might be a little warm for leather.”</p>\n<p> </p>\n<p>“Morning,” Derek says after a beat. Apparently they’re all playing the this-is-totally-normal game today. But he flushes as he sets Tori down, and that does all sorts of terrible things to Stiles. Derek should never flush. “The jacket was Erica’s idea.”</p>\n<p> </p>\n<p>Erica is a terrible fashion enabler. “She’s going to grow out of that before it’s even cool enough to need it,” Stiles tells him, and then has a moment of extreme cognitive dissonance because <em>oh God he’s a parent</em>.</p>\n<p> </p>\n<p>His father’s expression tells him this isn’t lost on him either, but he just turns to Derek and says, “Coffee?”</p>\n<p> </p>\n<p>“Please,” Derek says politely.</p>\n<p> </p>\n<p>It’s like they’re living in the twilight zone. Stiles is pretty sure this cannot be his life.</p>\n<p> </p>\n<p>No matter how desperately he wants it.</p>\n<p> </p>\n<p>Somehow they manage to get through breakfast like that: Froot Loops for Tori, yogurt and fruit for Stiles’s dad, peanut butter toast for Stiles. Derek sticks his head in the fridge, pulls out a tray of eggs, cracks three in a glass, and drinks them, which is <em>disgusting</em>, but hey, alpha werewolf metabolism; needs must.</p>\n<p> </p>\n<p>“We have frying pans,” Stiles points out, but his protest falls on deaf ears.</p>\n<p> </p>\n<p>Derek just says, “I thought I’d take Tori to work with me today.”</p>\n<p> </p>\n<p>Stiles blinks at him. This is probably his fault. Two years ago, he pointed out that Derek really needed a job. Not because of money—Derek has plenty of that—but because it humanizes him, makes him less likely to be the target of vicious suburban gossip.</p>\n<p> </p>\n<p>Or, well, that was the original idea, anyway. It didn’t work out as planned, mostly because after much huffing and puffing (seriously, the Big Bad nickname is so appropriate), Derek finally took Stiles’s suggestion and became Beacon Hills’ premier dog walker slash obedience trainer, and suburban housewives love gossip almost as much as they love seeing Derek in track pants.</p>\n<p> </p>\n<p>To be fair, at least some of the suburban househusbands are equally in love with Derek’s ass.</p>\n<p> </p>\n<p>“You can’t expect Tori to keep up while you run for two hours,” Stiles says. That’s insane, even if she is a baby werewolf.</p>\n<p> </p>\n<p>“I bought a jogging stroller.”</p>\n<p> </p>\n<p>Stiles has a moment of affinity for the housewives. Derek’s going to show up on their doorsteps this morning for a run with a baby in a stroller. He will competently call the dogs to heel—treats and leashes are tools for lesser beings; Derek has <em>natural talent</em>—nod at their owners from the sidewalk, and then disappear into the misty California morning. Stiles wonders what Derek has done to the divorce rate of Beacon Hills dog owners.</p>\n<p> </p>\n<p>At least this will give him some time to discover what Lydia’s found out about the spell she never should’ve done without him. Everyone is treating this like it’s permanent, and everyone is going to get their heart broken. Especially Derek.</p>\n<p> </p>\n<p>Especially Stiles, come to that.</p>\n<p> </p>\n<p>“Okay,” Stiles agrees, swallowing past the lump in his throat. He bends over and presses a kiss to Tori’s baby-soft cheek. “Be good for your alpha.”</p>\n<p> </p>\n<p>Tori turns and smacks a sticky Froot Loops kiss on him in return. “I’m always good, Daddy. Can we have mac and cheese for lunch?”</p>\n<p> </p>\n<p>“Sure thing, pumpkin.”</p>\n<p> </p>\n<p>He and his dad watch Derek bundle Tori out the door. Then Stiles pushes his half-eaten breakfast away and puts his face in his hands. He feels like crying, but he can’t, not with Derek and his super hearing just a few steps away.</p>\n<p> </p>\n<p>His dad stands and puts a hand on his shoulder, and Stiles shoves down his emotions the way he’s been doing for the past four years and starts clearing the table.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>“Please tell me you found out something about the spell you used.” Stiles kicks his shoes off and slumps onto the couch. It’s deep and comfortable and sucks him in, and he’d be way too fond of it except now it holds a lot of bittersweet memories he doesn’t need to be thinking about around a pack of mostly-werewolves who don’t know he used to fuck around with their alpha.</p>\n<p> </p>\n<p>On first glance Lydia is as composed as ever, but when Stiles looks closer he can see the signs of a sleepless night; there’s a tiny bit of concealer under her right eye that didn’t get rubbed in all the way. “I found out something about the spell we used,” she tells him dutifully with more of a wince than an eye roll, and that’s how Stiles knows it’s going to be bad.</p>\n<p> </p>\n<p>“So,” he says with forced cheer, “how long do we have?”</p>\n<p> </p>\n<p>Lydia smooths a perfect strawberry curl behind her ear. “There was nothing in the original book the spell was in. Otherwise I wouldn’t have done it.” She sighs. “Over the years the name of the spell evolved. It took most of last night to track down—”</p>\n<p> </p>\n<p>She must finally take in the look on his face, because she stops and bites her lips. “The physical effects last until the next full moon. Two weeks,” she adds unnecessarily, because Stiles has had the lunar cycle memorized for years. “It’s a fascinating spell, actually. Apparently it can call spirits or swap people’s genders or make them blind in service of the pack.”</p>\n<p> </p>\n<p>Stiles stares at her. They must have done something wrong somewhere. “And it thinks what this pack needs most is giving its alpha a kid and then taking it away two weeks later.”</p>\n<p> </p>\n<p>Lydia looks surprised, and Stiles realizes that she knew—she knew Tori was Derek’s, but she didn’t think he did. Jackson probably filled her in with the whole smell thing.</p>\n<p> </p>\n<p>“This spell is an asshole,” Stiles says feelingly, and doesn’t resist the urge to bring his knees up to his chest and hug them.</p>\n<p> </p>\n<p>“I’m sorry,” Lydia says. She looks miserable. “The effects are supposed to last, but there wasn’t any information on the physical effects under the older name. I didn’t know this would happen.”</p>\n<p> </p>\n<p>He rubs both hands over his face. “You are never allowed to do magic without me again unless it’s an actual matter of life and death. Clear?”</p>\n<p> </p>\n<p>She doesn’t even try to fight him.</p>\n<p> </p>\n<p>Great. That just leaves them with one problem. “One of us has to tell Derek,” Stiles says quietly.</p>\n<p> </p>\n<p>Lydia puts a hand over her mouth. “It’s my fault,” she says. “I’ll do it.”</p>\n<p> </p>\n<p>But Stiles is thinking about it, about what it’ll do to him, about how Derek works so hard to appear strong. “No, I’ll tell him.” He closes his eyes and thinks of Tori and her request. “But not until after lunch.”</p>\n<p>*</p>\n<p> </p>\n<p>Tori falls asleep in her brand-new high chair and faceplants in her macaroni, and even though Stiles knows he’ll probably hate himself for it later, he can’t help but take a picture on his cell phone. Derek wipes down her hands and face with a washcloth, and Stiles sees his opportunity and starts unbuckling her.</p>\n<p> </p>\n<p>It has to be done, but the words still feel like betrayal. “Is there somewhere I can put her down for a nap?”</p>\n<p> </p>\n<p>Derek nods. “I’ll show you the nursery.”</p>\n<p> </p>\n<p>It hits Stiles right in the chest, and he doesn’t even try to cover up his sharp intake of breath as he lifts Tori from the chair.</p>\n<p> </p>\n<p>Upstairs, the middle bedroom smells like fresh paint; the walls are a cheerful mint green instead of their former lackluster beige. The room is big enough for a crib and a child’s bed, each covered in pink-and-green blankets, like an adorable cartoon watermelon threw up on them. There’s a bookshelf on the wall and a toy chest underneath, and the hardwood floor is covered with those interlocking foam puzzle pieces, also in pink and green.</p>\n<p> </p>\n<p>Stiles hates everything.</p>\n<p> </p>\n<p>Derek pulls back the quilt and Stiles lays Tori on the bed, and they tuck her in together like they’ve done it a thousand times before. Derek even produces the stuffed wolf from somewhere and presses it into her arms.</p>\n<p> </p>\n<p>And then Stiles hears himself say, “We need to talk.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>It goes about as well as Stiles thought it would.</p>\n<p> </p>\n<p>After the first sentence, Derek doesn’t look at him. That makes it easier, because then Stiles doesn’t have to look at Derek either. He focuses his gaze on the wall behind Derek’s head and tells him, in as few words as possible, what Lydia found out.</p>\n<p> </p>\n<p>It’s not fair, and Stiles hates being a part of this. He hates that he’s only had a daughter for a little over a day and the thought of losing her makes him want to die. He hates the blank expression on Derek’s face and the dead look in his eyes.</p>\n<p> </p>\n<p>He hates that when he gets to the end, when he asks if Derek wants him to stay, Derek says no.</p>\n<p> </p>\n<p>Stiles goes home, closes the door quietly behind him, and sits down on the bench to take off his shoes. Then he climbs the stairs to his room, crawls into bed with his clothes on, and shoves his face in a pillow that smells like family.</p>\n<p> </p>\n<p>Curled up as tight as he can, he falls asleep.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Stiles doesn’t see Derek the next day.</p>\n<p> </p>\n<p>When he shows up at the house, Derek’s already gone to work, and Jackson, Isaac, and Tori are watching <em>Blue’s Clues</em> on Derek’s stupidly large TV, bowls of cereal on the coffee table in front of them. It’s like a cross-generation sleepover.</p>\n<p> </p>\n<p>Stiles kind of wishes he’d been invited.</p>\n<p> </p>\n<p>He has thirteen days until the spell takes Tori back, and he plans to make them count. He takes her out for a nature walk, then back to Derek’s for lunch. Derek still isn’t there, but Isaac and Jackson volunteer to help Stiles teach Tori soccer, and it’s as good a way as any to pass the time.</p>\n<p> </p>\n<p>After, Lydia and Erica help him with bath time. The second-floor bathroom is a flood zone by the time they’re done, and both girls leave the room needing to touch up their hair and makeup, but it’s still nice.</p>\n<p> </p>\n<p>Derek’s bedroom door is closed when Lydia finishes helping Stiles with his first baby girl ponytail, and when she sees his face, she scoops Tori up under her arms and plants a smacking red lipstick kiss on her cheek. “Tell you what, moonshine—I think Uncle Boyd and Aunt Erica should take you out for a Happy Meal. Sound good?”</p>\n<p> </p>\n<p>Stiles can’t even be mad at her. It’s not like werewolf kids are susceptible to high cholesterol and childhood obesity.</p>\n<p> </p>\n<p>Boyd takes the car seat out of the Camaro and puts it in Erica’s little Saturn, and when they’re gone Lydia holds out her hand for Stiles’s keys. He doesn’t even bother resisting, just hops in the passenger side and lets her have her way with him.</p>\n<p> </p>\n<p>Lydia takes him out for grown-up burgers and milkshakes, and Stiles suddenly remembers why he was in love with her for eight years.</p>\n<p> </p>\n<p>But no matter how good it smells, Stiles can’t make himself touch the food once it’s in front of him. If he thought he was getting out of this without telling Lydia everything, he was clearly mistaken.</p>\n<p> </p>\n<p>Lydia takes a sip of her banana milkshake—gross—then pushes it aside and says, “Do you want to do this the easy way or the hard way?”</p>\n<p> </p>\n<p>“There is no easy way to tell you what you want to know,” Stiles tell her, rubbing at his eye with the heel of one hand. “There’s the hard way and the impossible way, and they both suck.”</p>\n<p> </p>\n<p>She rolls her eyes and picks up a french fry. “You can start talking, or I can start asking really pointed questions about you and everyone’s favorite sourwolf.”</p>\n<p> </p>\n<p>Stiles runs his fingers through his hair. “Don’t call him that.”</p>\n<p> </p>\n<p>That makes her pause in the middle of chewing a fry, a comical expression on her face.</p>\n<p> </p>\n<p><em>Kate said that once</em>. Derek was naked on his back in Stiles’s bed, staring up at the ceiling. <em>When she was looking for Peter</em>.</p>\n<p> </p>\n<p>Stiles went still, because Derek never told him anything, just talked around what he wanted to say in as few words as possible, and Stiles had to work at listening. This time he heard <em>when she was torturing </em>me, but that wasn’t what he wanted to know. <em>Said what?</em></p>\n<p> </p>\n<p>For the space of several heartbeats, Derek didn’t answer. Then: <em>She called me sour</em>.</p>\n<p> </p>\n<p>Stiles didn’t know exactly what to say, but he knew he wouldn’t be using that nickname again, and fuck Kate very much for that, because Stiles was proud of that one. <em>Screw her, you’re awesome and she’s dead</em>. Derek almost twitched into an expression at that, but he cut it off before Stiles could read it. <em>How do you feel about ‘kitten’ as a substitute?</em></p>\n<p> </p>\n<p>Lydia snaps her fingers. “Stiles?”</p>\n<p> </p>\n<p><em>Fuck</em>. He takes a sip of vanilla milkshake to give himself a second to think of something to say. What comes out is “I broke up with Scott.”</p>\n<p> </p>\n<p>It’s obviously not what Lydia was looking for, but it serves its purpose as a distraction, and to be fair, Stiles sort of needs to talk about it with someone. “Why?”</p>\n<p> </p>\n<p>“Because he made me choose.” Because after that first year, Stiles was always going to choose Derek. “And because it was a long time coming, and he was an asshole, and he deserved it. Also, I told him I slept with Derek.”</p>\n<p> </p>\n<p>Lydia looks down at the burger in her hands, the one that’s paused halfway to her mouth, like she might never actually get to eat at this rate. Then she shrugs and takes a bite anyway. She takes her time following up with that, which is probably a cruel trick to get Stiles to elaborate. When he doesn’t, she asks, “When did it start, when did it stop, how many times, was it as amazing as I think it was.” She ticks off the questions on her fingers as she asks them. “And most importantly, why did it stop?”</p>\n<p> </p>\n<p>Stiles dips a fry in his milkshake. “Senior year, I guess. I mean I always sort of….”</p>\n<p> </p>\n<p>“I have <em>seen</em> Derek Hale, yes,” Lydia supplies with a wry twist of her mouth.</p>\n<p> </p>\n<p>Nodding, Stiles pops the fry in his mouth. “And Christmas was the last time. I don’t know how many times, I didn’t count, and I have no idea how amazing you think it was so I really can’t comment. I’m disappointed in you for the unscientific question.” Which means yes, obviously, because even that first time Derek knew all the right ways to touch him to make him fall apart.</p>\n<p> </p>\n<p>Lydia raises one perfectly groomed eyebrow.</p>\n<p> </p>\n<p>“I don’t know.” It comes out miserable, because that’s how it feels. “You know how Derek is about talking. We never talked about it.”</p>\n<p> </p>\n<p>“<em>You</em> never talked about it,” Lydia repeats in disbelief.</p>\n<p> </p>\n<p>And yeah, he has to concede the point. “Believe me, I wanted to, okay, but I didn’t want to bring it up only to find out….” <em>Only to find out it meant something different to him</em>. “But then I couldn’t anymore. We both have intimate knowledge of what I’m like when I get attached to someone.</p>\n<p> </p>\n<p>“And by that I’m assuming you mean you spent a year and a half having the best sex ever with Derek and then broke it off because you recognized how stupidly in love with him you are and couldn’t continue being his late-night booty call because you actually wanted to get on with your life.”</p>\n<p> </p>\n<p>Stiles pokes moodily at his milkshake. “That would be an accurate assumption.”</p>\n<p> </p>\n<p>Lydia sighs and reaches across the table to take his hand. “You’re an idiot.”</p>\n<p> </p>\n<p>He nods. It’s true.</p>\n<p> </p>\n<p>Stiles hears a tuneful chirping noise—he recognizes the sound as the one that means a text from Jackson; everyone else’s texts are silent. She blinks down at her phone and makes Hale-pack eyebrows at it. Stiles might have thought twice about getting involved if he knew that expression was contagious. “Jackson says Derek’s been listening to the Smiths on his iPod for two hours.”</p>\n<p> </p>\n<p>“Derek hates the Smiths,” he says automatically. The past December Stiles was listening to <em>The Very Best of</em> in his room and Derek got a hunted look, said <em>who is this</em>, his mouth turning down at the corners. He turned it off with extreme prejudice.</p>\n<p> </p>\n<p>“Derek hasn’t been himself since Christmas,” Lydia tells him, and nothing he can do will douse the terrible spark of hope.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Stiles stays in Tori’s room that night, curled up in her watermelon-themed bed, with Buck the stuffed wolf tucked snugly between them.</p>\n<p> </p>\n<p>Derek’s gone before he wakes up again, which Stiles thinks is pretty ambitious even for a professional dog walker who gets his run in before going to work. Yeah, so Derek is definitely avoiding him.</p>\n<p> </p>\n<p>Which would be fine. Stiles is a grown-ass man. He can handle it.</p>\n<p> </p>\n<p>But Tori’s a kid and she needs her alpha.</p>\n<p> </p>\n<p>To distract her, Stiles takes her to the library for their kids’ day program and ends up staying to do research, watching from the stacks as she learns the motions to “Goin’ on a Bear Hunt” (he stifles a smile) and shouts aloud the best parts to <em>Where the Wild Things Are</em>. Apparently she’s heard that one before.</p>\n<p> </p>\n<p>During craft time, they make little plaster-of-paris casts of their hands, and Stiles can’t help seeing what hers would look like next to one of Derek’s pawprints.</p>\n<p> </p>\n<p>Stiles doesn’t know what’ll happen to the cast at Derek’s, so he takes it to his dad’s place to set.</p>\n<p> </p>\n<p>While Tori naps upstairs, Stiles has yet another heartbreaking conversation in the real-time tragedy that has become his life: he tells his dad Tori can’t stay.</p>\n<p> </p>\n<p>“There has to be something,” his father says. Stiles hasn’t seen him this stricken in close to ten years.</p>\n<p> </p>\n<p>“Believe me, we’re looking.” But Stiles’s two hours romancing the card catalog didn’t yield any results Lydia hasn’t already scoured. He’s pretty sure they’re hosed. You can’t make something out of nothing, after all.</p>\n<p> </p>\n<p>His father’s voice breaks when he asks, “So what happens to her then?”</p>\n<p> </p>\n<p>She’ll fade away. Like she never existed. Except for the scars, there will be nothing left behind.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Tori wakes up screaming for Derek, and it’s the last straw. Stiles says good-bye to his dad and bundles Tori into the car. Derek has wallowed long enough.</p>\n<p> </p>\n<p>He expects the house to be silent and empty when he pulls up, and he’s mostly right. Lydia, Jackson, Isaac, Erica, Boyd—their cars are gone and they’re nowhere in sight. But Derek throws open the door to the house before Stiles even has Tori halfway out of the car seat.</p>\n<p> </p>\n<p>The second Stiles pushes Tori into Derek’s arms, she quiets, nosing into the space beneath his chin, her tiny body still trembling with the aftermath of her sobs. Derek looks just as unhappy as she does, like holding her is killing him but he can’t let go either. Stiles knows the feeling.</p>\n<p> </p>\n<p>He shoves his hands into his pockets and wills Derek to meet his eyes.</p>\n<p> </p>\n<p>Finally he does, but it just makes Stiles feel worse. Derek is the Jedi Grand Master of emotionlessness. And right now he has heartbreak written all over his face.</p>\n<p> </p>\n<p>He gives Stiles a quick nod—<em>we’ll talk later</em>—and turns toward the house.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Stiles doesn’t know if it’s because Derek warned everyone off or if Lydia told them to stay away or if the rest of the pack is maybe just a little cleverer than Stiles usually gives them credit for, but nobody comes back to the house that night until Tori’s in bed.</p>\n<p> </p>\n<p>Stiles makes dinner while Tori and Derek do agonizing father-daughter stuff—Stiles wouldn’t swear to it but he’s pretty sure there’s a tea party involved—and then they eat together, with Tori in her brand-new high chair, feeding herself penne with a child-size plastic fork. It’s quiet but not as awkward as it should be, all things considered. After all, Stiles is eating dinner in his ex-friend with benefits’ (or friend ex-with benefits’, maybe; are they still friends?) house with a kid who’s clearly Derek’s but calls Stiles Daddy and whom neither of them knew a week ago.</p>\n<p> </p>\n<p>After dinner Derek does the dishes and Stiles puts Tori to bed with a chapter of <em>Alice in Wonderland</em>, and then they run out of excuses.</p>\n<p> </p>\n<p>Derek’s sitting on the couch when Stiles gets downstairs. His head is bowed, his shoulders slumped. He really obviously does not need the verbal smackdown Stiles had planned to lay on him.</p>\n<p> </p>\n<p>“So this sucks a lot,” Stiles says as he sits down on the other end of the couch.</p>\n<p> </p>\n<p>Derek nods, not looking up from his hands, which are folded between his knees.</p>\n<p> </p>\n<p>“But it isn’t her fault,” Stiles goes on, because he has to say something to fill the silence. “Just because she’ll be gone in a few days doesn’t mean her emotional well-being isn’t important, okay? She loves you. You need to be there for her.” He pauses, feeling like an asshole, and then says it anyway. “<em>I</em> need you to be there for her.”</p>\n<p> </p>\n<p>Derek flinches and tips his head back so he’s looking at the ceiling instead. “Yeah. I know.”</p>\n<p> </p>\n<p>“I get that it’s hard for you, okay? I’m not asking you to turn into Mr. Mom or anything.”</p>\n<p> </p>\n<p>That makes Derek actually look at him with one eyebrow raised. Stiles wonders how much effort it takes to hold it up. It probably requires alpha werewolf strength.</p>\n<p> </p>\n<p>His hand to God, Stiles can’t possibly stop the words that escape him next. “You’re, uh. You’re pretty good with her, you know.”</p>\n<p> </p>\n<p>Derek looks away again. “It’s easy. She smells like family.” His hands curl into fists. “Giving her up….”</p>\n<p> </p>\n<p>It’s going to be like his family all over again. Stiles gets it. He just nods and sighs. “Anyway. Do you think—I mean, we could make the best of it. Go on family outings. Take some pictures. Unless it’s too weird? Because of….” He gestures between them helplessly. God knows it’s hard for him sometimes.</p>\n<p> </p>\n<p>“I can handle it if you can.”</p>\n<p> </p>\n<p>Stiles smiles, but it’s like papering over a hole in a wall. “Challenge accepted.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>The next ten days are like something out of someone else’s life.</p>\n<p> </p>\n<p>Derek still works, but instead of his pre-dog-walking run he makes breakfast, sometimes just for the three of them and sometimes for the whole pack. Stiles usually sticks around to clean up after, and Isaac or Jackson or one of the girls takes Tori upstairs to get her dressed. She insists on wearing the leather jacket every day, even though it’s like eighty degrees.</p>\n<p> </p>\n<p>When Derek gets home from work, Stiles grinds his teeth together to remind himself not to stare, because Derek makes “just ran ten miles” look like “I’m ready for that sex marathon now.” It doesn’t help that Stiles has firsthand knowledge that he’s capable of a post-ten-mile-run sex marathon either. Derek hops in the shower, comes out of the bathroom without his shirt on like an asshole, then finally stops throwing Stiles’s terrible life decisions in his face and gets dressed.</p>\n<p> </p>\n<p>And then they play happy family and Stiles wishes he were a crappier temporary father, because the fact is it’s killing him a little more every day.</p>\n<p> </p>\n<p>Dad suggests family pictures, and even though Stiles can’t actually imagine ever being able to look at them, he can’t say no, and Derek doesn’t either. The photographer coos over Tori, over Derek, and over their dysfunctional family unit, though of course she doesn’t know how broken it really is. Stiles has gotten very good at pasting on a smile. He almost has himself fooled.</p>\n<p> </p>\n<p>He first sees the flyer when they’re checking out at the grocery store; Derek has Tori on his shoulders and he won’t let Stiles pay, so he wanders off to check out the community announcement board. There’s Derek’s ad for dog-walking services, and Lydia’s for bookkeeping, one for personal training. There’s even one for a therapist. But Stiles hardly notices those; somehow he can’t help unpinning <em>this</em> one. He folds it up and puts it in his pocket, where it feels heavier than it should.</p>\n<p> </p>\n<p>As the week wears on, they let Tori stay up later and later, until she starts sleeping in until Derek gets home from work. Stiles makes sure he’s there before she wakes up, sometimes finds himself sitting on the floor in her room, watching her sleep.</p>\n<p> </p>\n<p>He guesses he doesn’t have much grounds to call Derek a creeper anymore.</p>\n<p> </p>\n<p>With two days left before the full moon, Lydia meets Stiles on the front porch with an enormous sugary coffee. “You look like shit.”</p>\n<p> </p>\n<p>“I feel like shit,” he replies. “Recycled shit, even. What am I doing, Lydia?”</p>\n<p> </p>\n<p>“What you should have done the first time around.” She sips at her own coffee—black like her twisted, delightful little soul. God, Stiles loves her. “Allison’s getting married.”</p>\n<p> </p>\n<p>Stiles blinks at the subject change. “What?”</p>\n<p> </p>\n<p>“To some guy she met in college,” Lyida continues with a scowl. “They set the date for three weeks after graduation.” She’s probably pissed Jackson didn’t propose to her first.</p>\n<p> </p>\n<p>Stiles hasn’t heard from Allison in ages, not since the disaster that was their senior year. As far as he’s concerned she can die in a fire. “Long engagement,” he says, because he can’t come up with anything else.</p>\n<p> </p>\n<p>“She’s getting out of hunting for good, I guess.” Then she drops the rest of it. “Scott found out on Facebook.”</p>\n<p> </p>\n<p>Stiles makes a face, even if he can’t help feeling bad. Just because he and Scott aren’t friends anymore doesn’t mean Stiles wants him to suffer. “He should be someplace safe tomorrow,” he says at last. Even after all these years, Allison’s still his anchor.</p>\n<p> </p>\n<p>“Glad you agree.” And she keeps looking at him pointedly until Stiles sighs and says:</p>\n<p> </p>\n<p>“Fine. I’ll talk to Derek.”</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Which is how Stiles ends up coming back to the house with a big box of mountain ash and wolfsbane to find Derek and Scott in the living room, Scott on his knees on the floor with his head bent to the side, defeat written in every line of his body, and Derek standing over him with one hand on his head. It’s the opposite of sexual, but it’s still so far outside the realm of anything Stiles expected to see that it takes him aback.</p>\n<p> </p>\n<p>Derek meets Stiles’s gaze when the door closes behind him, but Scott doesn’t. By now Stiles knows that’s instinct; Scott’s theirs now, part of their pack, and Stiles outranks him. He’ll get over the eye contact thing when he’s feeling a little more human and less vulnerable.</p>\n<p> </p>\n<p>“I’d better lock these up,” Stiles says into the sudden awkward, because yeah, they have a kid in the house now, even if it’s only for a few more hours, and this stuff could be dangerous. He stocks up the cupboard in Derek’s creepy werewolf bat cave, which Stiles occasionally refers to as “the S&amp;M club downstairs,” and then makes his way back to the living room in time to catch the tail end of Derek’s explanation of what’s happening tonight.</p>\n<p> </p>\n<p>“The basement’s been reinforced. It’s comfortable but secure. Usually we’d run, but I can’t join you tonight.”</p>\n<p> </p>\n<p>Because Stiles and Derek have Plans. Sad, pathetic, heartbreaking plans that are only going to end in tears, but still.</p>\n<p> </p>\n<p>Scott just nods. Maybe he feels as lost as Stiles.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>It’s a quiet evening. There’s pizza for dinner, followed by an enormous chocolate cake Erica and Boyd baked together that Tori loves and gets everywhere. Stiles eats a piece, but when it’s gone and he’s looking down at his empty plate, he can’t remember what it tasted like.</p>\n<p> </p>\n<p>After cake, they leave the dishes in the sink. The betas and Scott slip downstairs, Lydia heads out for the evening, and Stiles picks up his illustrated copy of <em>Alice Through the Looking Glass</em> and Buck the stuffed wolf while Derek carries Tori upstairs.</p>\n<p> </p>\n<p>They give her a bath together first, and then Derek helps her into her <em>Blue’s Clues</em> pajamas before Stiles sweeps her up in a bridal carry and drops her in the middle of Derek’s enormous bed, where she lands with a bounce and a giggle.</p>\n<p> </p>\n<p>Derek climbs in more sedately, and Stiles follows, awkward and unsure. In a year and a half, never once had he touched Derek’s bed. It seems strange to do it now, especially knowing it’ll smell of him afterward.</p>\n<p> </p>\n<p>He’s been reading the book out loud for the past week, so they’re almost finished, just four chapters to go, but two are short ones and Stiles never reads chapter twelve because chapter eleven is a better ending. Stiles tucks Tori under his arm and flips open the book, uncomfortably aware of Derek’s gaze on him, intent and a little sad.</p>\n<p> </p>\n<p>Before he even makes it halfway through, Tori’s yawning, snuggling into his side. She falls asleep just after the Red Queen’s riddle, before Stiles can tease her into trying to find an answer, not that he thinks she could; she’s a clever girl but plenty of adults find Carroll’s riddles tricky. He keeps on anyway, long past the time when his voice grows hoarse, and Derek watches him the whole time until <em>and it really </em>was<em> a kitten, after all</em>, and Stiles blinks back tears.</p>\n<p> </p>\n<p>Outside, the moon begins to rise. Even Stiles can feel its pull now, some kind of magic side effect of joining a werewolf pack. It makes him want to howl.</p>\n<p> </p>\n<p>Derek says, “You should stay.”</p>\n<p> </p>\n<p>So he does.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>When he wakes up in the morning, he’s alone. No Tori, no Derek, no Buck. He thinks he should’ve been ready for it, but the pain rips through him, leaving him helpless. He can’t get out of bed but he can’t cry either, so for an hour after waking up he just curls into a ball and hugs Derek’s pillow.</p>\n<p> </p>\n<p>He’s just started to entertain the idea of getting up, of forcing himself to go home, when the bedroom door opens. Derek stands in the doorway, shoulders hunched. “You’re still here.” He sounds surprised but not disappointed. Not angry.</p>\n<p> </p>\n<p>But underneath the layer of sweat, he looks miserable. Stiles hasn’t seen him look like that in years.</p>\n<p> </p>\n<p>“I—yeah, sorry. I….” He doesn’t have an excuse. “You probably want to be alone.”</p>\n<p> </p>\n<p>Derek huffs, bitterness twisting his lips, and reaches for the hem of his shirt before turning away. “Sometimes I think you don’t know me at all.”</p>\n<p> </p>\n<p>Stiles flinches back, swallows the lump in his throat, and wills himself not to watch the play of muscles in Derek’s back. “Fuck you. You don’t exactly make it easy.”</p>\n<p> </p>\n<p>His shoulders sag. God, why are they so good at hurting each other? “You think it’s easy for <em>me</em>?” It would be better if he snarled, but his restraint cuts deeper than anger. “I haven’t been okay, Stiles. I let Lydia do magic, that’s how not okay I am. So don’t talk to me about easy.”</p>\n<p> </p>\n<p>“Yeah, well, maybe you should’ve thought of that before I got tired of being your dirty little secret.”</p>\n<p> </p>\n<p>Stiles knows it’s a mistake the minute the words are out of his mouth. Every line of Derek’s body tenses and he could swear the air in the room crackles. Then Derek whirls on him, eyes flashing red. “There was nothing dirty about it,” he snarls.</p>\n<p> </p>\n<p>Stiles was wrong about the snarling being better. He swallows hard and fights the instinct to crawl back against the headboard. “Yeah?” he says, and so fucking what if his voice trembles. He isn’t here to impress anyone. “Sure felt like it when you were sneaking in my bedroom window at two in the morning. It felt like it when you made it a point not to touch me in front of anyone else.”</p>\n<p> </p>\n<p>Derek glowers at him, but it doesn’t hold its usual weight. “You were the one who insisted I never mark you. <em>You</em> made sure none of the others could find out. <em>You</em> didn’t want to tell your dad.”</p>\n<p> </p>\n<p>“Oh gee,” Stiles says, rolling his eyes, “I wonder why seventeen-year-old Stiles didn’t want to tell his dad he was playing booty call for a twenty-three-year-old werewolf ex-murder suspect.”</p>\n<p> </p>\n<p>Derek makes a pained face the likes of which Stiles hasn’t seen directed at him since he was sixteen. “It was never a <em>booty call</em>.” He spits the words like they personally offend him. “It was never that, Stiles. I would have—I thought you didn’t want….” He looks anywhere but at Stiles, but Stiles still catches his expression, Insecure Angst Grimace No. 5.</p>\n<p> </p>\n<p>The truth hits him like a Mack truck, leaving him gaping and kind of breathless.</p>\n<p> </p>\n<p>“Derek. You are an actual moron.” A desperate hope curls in Stiles’s chest, and he clings to it with both hands, because after losing Tori it feels like all he has. “I can’t believe—did you think I was <em>ashamed</em> of you?”</p>\n<p> </p>\n<p>Derek clenches his jaw.</p>\n<p> </p>\n<p>Oh Jesus. Oh God, they’re dumb. Stiles can hear his heart beating a ridiculous staccato. “Derek. I know you’re not exactly Mr. Self-Esteem, okay, I know you well enough to know that. But don’t you see how far you’ve come? You used to be a creepy murder suspect who snuck in my bedroom window at night and you never listened to us when we didn’t want to kill people because they could be innocent. You were a shitty alpha who picked a group of teenage misfits for a pack.”</p>\n<p> </p>\n<p>“Thanks a lot,” Derek mutters.</p>\n<p> </p>\n<p>Stiles ignores him, because he cannot afford to get distracted. This is important, maybe the most important rant he’s ever delivered in his life. “You never smiled and people probably crossed the street so they didn’t run into you. Your life—I don’t even want to think about how hard it’s been. You were a mess. But you were the guy who was always there to save my ass.”</p>\n<p> </p>\n<p>It’s not enough—Stiles can see that much by the way Derek nods, his head still down. He still doesn’t get it.</p>\n<p> </p>\n<p>Fine. Stiles can do better. He just hopes he’s reading this right. “And now you’re somebody people wave at when they see you on the sidewalk. You’re the guy Erica goes to for career advice, the guy who keeps Isaac from falling apart, the alpha we can count on—even if you haven’t ditched the bedroom window habit. You think I’m ashamed of that? Are you nuts?”</p>\n<p> </p>\n<p>Derek’s hands have curled into fists, and Stiles forces himself to sit up straighter so he can grab one. Finally Derek lets him see his eyes, green this time, the same green Stiles fell in love with three years ago. “If I’d had a clue we were dating I’d have hired a freaking skywriter, Derek.” He pauses to make sure they’re still on the same page, then adds a little hoarsely, “That’s still on the table, actually.”</p>\n<p> </p>\n<p>Derek lets go of his hand, and for half a second Stiles’s heart sinks. But then Derek pushes him back on the bed and straddles his waist and leans down and kisses him.</p>\n<p> </p>\n<p>It’s nothing like any of their kisses before, too gentle by half, too slow, too deliberate. When Derek pulls away at last he says, “No skywriting necessary.”</p>\n<p> </p>\n<p>Stiles says, “I have a better idea anyway” and pulls off his shirt.</p>\n<p> </p>\n<p>He doesn’t actually mean the <em>sex</em>, he has something specific in mind, but it’s not like he’s going to complain. Two minutes later Derek has him naked with his face and shoulders pressed into the covers, one of Derek’s stupidly warm hands splayed flat between his shoulder blades and the other buried two—oh God, three—fingers deep in his ass. He still feels raw, like the top layer of his skin has been flayed off, like he needs something to hold him together. Needs <em>Derek</em>, because there’s a hole in his life the size of a little girl.</p>\n<p> </p>\n<p>And maybe because Stiles has always needed Derek, or Derek has always needed him.</p>\n<p> </p>\n<p>Derek rubs his stubble across she sensitive skin of Stiles’s ass, and that’s about all he can take. “God, <em>stop</em>,” he grits out, because if Derek keeps going Stiles is going to spontaneously grow werewolf claws and rip the sheets to shreds. It’s so <em>good</em>, the pleasure burning up inside him; another few seconds and he’ll be coming on the sheets—</p>\n<p> </p>\n<p>Derek stops, but before he can panic Stiles turns over and hauls him up by the shoulders. “You really need to be inside me, like, four months ago.”</p>\n<p> </p>\n<p>“<em>Yes</em>,” Derek agrees, and he reaches for one of the condoms that scattered all over the bed in the desperate bid for lube.</p>\n<p> </p>\n<p>Before he can get it open, Stiles catches his arm and shakes his head. “Do we need that?”</p>\n<p> </p>\n<p>Derek stares at him, probably because they always have, they’ve always been safe. Part of it was because it was normal, and so much of what they had really wasn’t, and Stiles wanted something to cling to. Well, fuck normal.</p>\n<p> </p>\n<p>“You know I’m safe.”</p>\n<p> </p>\n<p>Stiles licks his lips. “Just, I mean, I don’t want the betas thinking you’re—playing favorites or—”</p>\n<p> </p>\n<p>Derek cuts him off with a kiss and knee-walks a little closer. “Stiles. Everyone in Beacon Hills knows you’re my favorite.”</p>\n<p> </p>\n<p>God, Stiles really is an idiot. “Except me,” he finishes aloud. “Well, me too now.” He cards his fingers through Derek’s stupid hair, reveling in the shudder it earns him. “You’re going to fuck me now, right?”</p>\n<p> </p>\n<p>Derek freezes with his face pressed into Stiles’s neck. “Like this?”</p>\n<p> </p>\n<p>In their year and a half of sleeping together, Stiles made a lot of rules and most of them were mistakes. They never fucked more than once a week, they always used condoms even though Stiles knew damn well Derek couldn’t give him anything, they never spent the night together, and he never let Derek take him like this, with Stiles on his back baring his neck and belly, vulnerable.</p>\n<p> </p>\n<p>“Yeah, like this,” Stiles says, hooking his ankles around Derek’s thighs. They’re probably rushing things, but fuck it. They need this right now.</p>\n<p> </p>\n<p>Derek’s shoulders shake a little when he pushes inside, still nosing at Stiles’s jawline. He had his own rules: never in his bed, and neither of them would see anyone else—which Stiles never wanted to do anyway, and why would he? It wasn’t like sex could get any better than it was with Derek. He definitely should’ve figured out this wasn’t casual way sooner—he never did anything that would mark Stiles as his, and they never talked about it.</p>\n<p> </p>\n<p>They’re probably never really going to be the talking-about-the-relationship kind, but that might be okay. They have enough of the same hurts anyway.</p>\n<p> </p>\n<p>Derek pulls back far enough Stiles whines with it, and he arches, inviting the next thrust. It sparks all the way up his spine and back down again to settle in his dick.</p>\n<p> </p>\n<p>God, he needs to get his plan in action, because if he fucks this up again it might actually kill him. The plan is good; the plan says everything his stupid human brain won’t let him actually say out loud during sex, because some things are sacred.</p>\n<p> </p>\n<p>Derek shoves his face against Stiles’s neck and shuffles his knees a little closer and <em>hello</em>, fireworks; how did Stiles forget how fucking good at sex they are?</p>\n<p> </p>\n<p>Okay, so he didn’t forget, but this is a nice reminder.</p>\n<p> </p>\n<p>Stiles drags his nails down Derek’s back and finds the courage to give voice to his plan. “God. Derek. Bite me.” Derek nails his prostate with an absolutely beautiful thrust. “Oh my God.”</p>\n<p> </p>\n<p>Derek’s hips stutter and his face goes slack. “Stiles, you know what’ll happen if I—”</p>\n<p> </p>\n<p>Stiles does know, because the universe cursed him with Scott and Lydia for best friends and the term <em>overshare</em> doesn’t even begin to cover it. He’s never been able to decide if it’s worse to hear about Scott’s sex life or Jackson’s. Jackson would win hands down except that his is Lydia-adjacent.</p>\n<p> </p>\n<p>The point is: he knows, and he’s not backing down. “Human teeth only,” he pants, digging his feet into the mattress for leverage; <em>why is Derek stopping?</em> “I don’t want to end up furry once a month.”</p>\n<p> </p>\n<p>Derek flashes red eyes at him and draws his fingers through the hair beneath Stiles’s navel. Stiles groans and wills it to keep traveling downward, but Derek’s always been a fucking tease. “You’re sort of furry all the time.”</p>\n<p> </p>\n<p>Stiles laughs, and even if it feels a little like he’s betraying <em>her</em>, he can’t help it. They should have had this stupid talk years ago. “Shut up, you like it and I am not letting you wax it off.” Seriously, Derek cannot resist Stiles’s belly fuzz. He probably wants to come in it and let it dry that way, which, actually, yeah, Stiles is totally on board with that. They should get on that immediately.</p>\n<p> </p>\n<p>“I’d never,” Derek says, and his tone misses dry by half a mile.</p>\n<p> </p>\n<p>They’re breaking all the rules tonight except the one about seeing other people, and if Stiles is honest that’s the only one he’s never been tempted to break. He tilts his head back on a particularly beautiful stroke and doesn’t miss Derek’s sharp intake of breath against his neck. “Stiles—”</p>\n<p> </p>\n<p>“Are you gonna do it or what?” he asks breathlessly, grinding up to rub his dick against Derek’s stomach. Oh God, Stiles hangs out with werewolves way too much and now he has a marking kink. Whatever. Who doesn’t want to come all over Derek’s body? “’Cause I’m gonna come any second and I’d really like to do it with your teeth in my—”</p>\n<p> </p>\n<p>Derek’s rumbling growl vibrates through Stiles’s body, and that would be enough to set him off, but then he also noses down Stiles’s throat and opens his mouth against the skin there with a desperate sound.</p>\n<p> </p>\n<p>For two seconds it’s hot and wet and glorious, and then it’s <em>sharp</em>, it <em>hurts</em>, just enough to make Stiles forget everything else that hurts, and he chokes out half a ragged curse and comes, digging his fingernails into Derek’s shoulders. Above him, Derek shudders, lets out a wounded sound, and then sits back, slicks his hand through Stiles’s come, and jerks off on Stiles’s stomach, his dick, his hole.</p>\n<p> </p>\n<p>Then he runs his fingers through it. Yeah, that’s going to be a thing.</p>\n<p> </p>\n<p>When Stiles catches his breath again, he meets Derek’s eyes. They’re wide, pupils blown, but sad. Maybe wet too, though Stiles won’t call him on it. The world rushes back in before Stiles is ready, and he reaches up to tug Derek back down into the sheets with him. “We’re not getting out of bed today,” he says fiercely. “Anyone who thinks they’re more important than our grief can suck my dick.”</p>\n<p> </p>\n<p>Derek laughs, bitter and brittle, and tucks in close to him. He touches the sore spot on Stiles’s neck. “They really can’t,” he says solemnly.</p>\n<p> </p>\n<p>Stiles doesn’t bother with a comeback.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>And then life goes on. Stiles gets a job doing clerical work at the station for the summer, which may be nepotism at its finest but at least it’s working in his favor. It’s nice because it means he gets to see his dad more often than he would otherwise, especially since he’s basically moved into Derek’s bedroom and has no intention of moving ever. The way Derek marked him, that’s a pretty clear statement. For a human it’d be an engagement ring, but Derek’s not human and Stiles doesn’t really need that anyway.</p>\n<p> </p>\n<p>Scott settles in as their lowest-ranking member, and somehow it seems to work with minimal angst on all sides, which is great because there’s enough of that going on in the house.</p>\n<p> </p>\n<p>After a week Stiles and Derek stripped the pink-and-green bedding and packed it away in cedar boxes, and Derek locked the door to Tori’s bedroom. But it’s right there, right next to Derek’s, so they walk past it several times a day, and the pain is still fresh.</p>\n<p> </p>\n<p>On the third Thursday after the full moon Stiles forgets his lunch and runs to the grocery store. Pack shopping is technically one of Scott’s duties now, but he sort of sucks at it, so Stiles isn’t really surprised to run into Derek at the checkout with a basket of eggs and sausage and peanut butter and other things you only get to eat for breakfast without paying for it if you have a supernatural metabolism. Something inside him twinges and he remembers being here with Tori, the way she’d looked perched on Derek’s shoulders with her tiny chubby hands in his hair like she was using it to steer.</p>\n<p> </p>\n<p>Derek must feel the same way, because he doesn’t say anything, just leans his head against Stiles’s in a display of almost-weakness Stiles never thought he’d see, at least not in public.</p>\n<p> </p>\n<p>Then his head goes up, and his nostrils flare, and Stiles watches as his eyes track a brown-haired woman coming in through the doors with a stack of fliers.</p>\n<p> </p>\n<p>“What?” Stiles asks as his heart pounds in his chest. That spark inside him that he keeps so quiet is burning, <em>yearning</em> to get out, and he doesn’t understand what’s happening.</p>\n<p> </p>\n<p>“Her scent,” Derek says. His voice is raw. “She smells like….”</p>\n<p> </p>\n<p>Stiles watches as she pins the flyer to the bulletin board.</p>\n<p> </p>\n<p>And he remembers. With shaking fingers, he reaches into his wallet and withdraws the folded-up piece of paper he put there weeks ago.</p>\n<p> </p>\n<p>It matches the one she’s just pinned up:</p>\n<p> </p>\n<p>\n<em>Surrogacy Services.</em>\n</p>\n<p>\n<em> </em>\n</p>\n<p>Holy fuck. Stiles’s throat goes dry. It’s—this is completely insane. He’s too young, he knows he’s too young, and he and Derek are only just starting to know each other this way, but he doesn’t <em>care</em>. The universe is speaking to him. This is as much of a sign as anyone could hope for.</p>\n<p> </p>\n<p>This is Stiles listening with his heart instead of his brain.</p>\n<p> </p>\n<p>“We’ll have to tell her,” he says. “About, you know. What to expect when you’re expecting a half werewolf.”</p>\n<p> </p>\n<p>Derek nods, but his body language is distant, like he can’t believe this is happening. He turns his body toward Stiles and kisses him right there in the store.</p>\n<p> </p>\n<p>Stiles ends up skipping lunch to stand close to Derek like that, lean into his space, and hope.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>Scott’s phone goes off on the counter while they’re making dinner that night, the same tone Stiles’s makes when he gets an e-mail, because it’s a new phone and he hasn’t had time to download something silly to replace it. He’s been a space cadet all day.</p>\n<p> </p>\n<p>He’s just finished the final layer of eggplant in the lasagna when Scott makes a noise.</p>\n<p> </p>\n<p>“What?”</p>\n<p> </p>\n<p>After that first day with Tori, Stiles really thought they wouldn’t ever be friends again. He picked Derek, even when they weren’t together, and would continue to pick Derek because he didn’t know how to do anything else anymore. But Stiles never counted on Scott joining the pack, never counted on how his bowed head and silences would prey on him, never counted on needing someone he could just be around in the quiet when Tori was gone. Things will never be like they were, but he’s happy to be wrong.</p>\n<p> </p>\n<p>Scott makes a face. “I’m sorry, dude, just—we have the same phone, I guess. I opened your e-mail.” Then he shrugs apologetically and holds the phone out to him, screen forward. “You should probably….”</p>\n<p> </p>\n<p>Stiles takes it, aching. The photographer has forwarded the pictures from their session last month, him and Derek and Tori in their impossible dysfunctional family unit. After today he has hope, at least, that they can have something like that again, even if it’ll never be the same. Just because the baby won’t be Tori doesn’t mean they won’t love it.</p>\n<p> </p>\n<p>But looking at the pictures is still too hard right now, and Stiles tries to hand the phone back.</p>\n<p> </p>\n<p>Scott flips to one of Tori clutching Buck and shakes his head. “No, Stiles. <em>Look</em>.”</p>\n<p> </p>\n<p>And he zooms in.</p>\n<p> </p>\n<p>It’s asinine, is what it is. It’s a detail that shouldn’t mean anything. For all Stiles knows it’s a cruel trick of the camera.</p>\n<p> </p>\n<p>But he stares at it anyway, at the stupid blown-up tag on Buck the stuffed wolf’s furry ass.</p>\n<p> </p>\n<p>\n<em>© 2019</em>\n</p>\n<p> </p>\n<p>Stiles says, “Oh my God.”</p>\n<p> </p>\n<p>When Derek comes in, eyes wild like he can hear Stiles’s heart beating too fast, Scott makes himself scarce.</p>\n<p> </p>\n<p>*</p>\n<p> </p>\n<p>“Congratulations,” the doctor says a year later. “It’s a girl.”</p>"
}