{
  "id": "781057",
  "url": "https://archiveofourown.org/works/781057?view_full_work=true",
  "author": [
    "DevilDoll"
  ],
  "title": "My Heart Comes Tumbling Down",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [],
  "additional_tags": [
    "Friends With Benefits",
    "Happy Ending"
  ],
  "language": "English",
  "series": "",
  "published": "2013-05-01",
  "completed": null,
  "words": "5,689",
  "chapters": "1/1",
  "comments": "768",
  "kudos": "19,785",
  "bookmarks": "4,276",
  "hits": "258,552",
  "summary": "<p>\"This is a casual, adult relationship based on sex, and it is awesome.\" In which Stiles and Derek have a great time buddyfucking until a burrito ruins it all.</p>",
  "notes": "<p>Thanks to agentotter for beta reading. This story is for nonyx6, who responded to my wee ficlet prompt request back in (WINCE) October of last year with \"any Sterek from you.\" Hope you're happy with this one!]</p>\n<p>You can find my transformative works policy (podfics, translations, etc) for my stories <a href=\"https://archiveofourown.org/users/DevilDoll/profile\" rel=\"nofollow\">here in my AO3 profile.</a></p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>You can find my transformative works policy (podfics, translations, etc) for my stories <a href=\"https://archiveofourown.org/users/DevilDoll/profile\" rel=\"nofollow\">here in my AO3 profile.</a></p>",
  "text": "<p>Everyone has an opinion on it, and nearly everyone's opinion is that sleeping with Derek isn't a very good idea.</p>\n<p>\"Do you, you know…understand what you're getting into?\" Scott asks carefully, because they are bros, forever bros, and Scott has learned a lot about navigating the rocky waters of young adult relationships in the last two years. Stiles nods, touched by his concern, and Scott winces like he'd prefer it weren’t happening—Derek is never going to be his favorite person--but he doesn't try to talk him out of it. </p>\n<p>\"I'm not listening to anyone whine about their broken heart,\" Erica sneers. Which is just fine, because Stiles' heart is not involved in this at all. This is a casual, adult relationship based on sex, and it is awesome.</p>\n<p><i>I'm silently judging you,</i> Boyd's eyebrows say, and Stiles makes a face back that says, <i>I'm a mature, responsible adult and I know what I’m doing and I know this is some kind of pack thing because he's the alpha but it's between me and Derek so butt out.</i> Or at least Stiles hopes that what his face says.</p>\n<p>\"What's he like in bed?\" Isaac asks when they're alone, and Stiles should be put off by the blatant curiosity but so far Isaac's the only one who hasn't rained on Stiles' HAVING SEX WITH DEREK NOW WHOOHOO parade, so Stiles leans back and grins smugly and says, <i>\"Phenomenal.\"</i></p>\n<p>~*~</p>\n<p>The first time they have sex, Derek looks into Stiles' eyes, and murmurs in his ear, and moves the pillow so Stiles' neck isn't bent at a weird angle, and makes sure Stiles comes first. It's all very devirginizing-the-prom-queen style, and not at all what Stiles expects, but still pretty great. The second time, two nights later, Stiles doesn't give him a chance to slip into sweet and tender mode--he goes down on Derek as sloppily and nastily as he knows how, and Derek looks a little stunned, sprawled on his couch with his jeans pulled down past his hips, hanging onto Stiles' shoulders for dear life. </p>\n<p>Stiles clambers astride and gets his dick out while Derek's still panting at the ceiling in some kind of post-orgasm fugue state that Stiles will totally gloat over later when he's not desperate to get off. He gets a couple good strokes in before Derek finally notices what's going on and gets with the program, spitting into his palm and taking over. Derek jerks him off while he licks the taste of his own come out of Stiles' mouth, and Stiles thinks, <i>Yeah. This is more like it.</i></p>\n<p>Derek wants to cuddle in bed after that, and he's a primo cuddler, and never forgets his freaky werewolf strength or that Stiles needs to breathe, so that’s cool. Cuddling leads to kissing, which leads to the bottle of lube, which leads to Stiles pulling Derek up against his back and moving his leg enough so Derek can ease inside. Derek fucks him hard when Stiles asks for it, using his hips to push Stiles' straining cock into his fist. He pants in Stiles' ear and holds him down by the neck with his teeth when he comes in his ass, and Stiles is right behind him, coming so hard he can't even make a sound. All he can do is just writhe on Derek's cock and ride it out while Derek shudders against him. </p>\n<p>So Stiles isn't exaggerating—Derek really is phenomenal in bed. Stiles is, admittedly, working from a small sample size (two others before Derek, but it's hard to keep any kind of relationship going when you're constantly having to cancel dates in order to perform an exorcism or take a werewolf to the vet for a life-saving procedure). But before this he'd never had the luxury of a partner who was around enough to get to the experimenting stage, where Stiles can figure out if he likes being blindfolded (he does not) or having his hair pulled while he's giving a blowjob (he does) and Derek just rolls with it all. </p>\n<p>Derek is willing to try just about anything once, and afterwards remembers what Stiles liked and what he didn't. When it's time to reciprocate, it turns out most of Derek's kinky wishlist items are actually sort of run-of-the-mill, but they're still fun, and Derek's enthusiasm for them makes them mind-blowingly hot, so Stiles is more than happy to indulge him. It's not like letting Derek come on his face is a <i>chore</i>.</p>\n<p>And Stiles never gets tired of watching Derek when they fuck, the way his usual guarded expression melts away, and he looks so young and happy. The way Stiles can touch him in ways that make his eyes squeeze shut and his breath catch, and it's a heady feeling, getting Derek to make a lot of noise, lose control a little bit. The way he looks so <i>hungry</i> for it when Stiles slowly unzips Derek's jeans and tells him, one quietly confessed detail at a time, exactly what he wants Derek to do to him.</p>\n<p>\n<i>Phenomenal.</i>\n</p>\n<p>~*~</p>\n<p>Things roll along really smoothly for several months, or at least as smoothly as things ever roll in Beacon Hills, which is to say covered in blood and fueled by occasional pants-shitting levels of terror. But in between the episodes of blood and terror—and sometimes directly after—Stiles and Derek find the time to hook up and screw each other's brains out, with gradually increasing frequency and intensity.</p>\n<p>Senior year starts, and because Stiles took a buttload of classes his first three years, he's got a light schedule now, coasting to the high school finish line. Scott's still trying to make up ground for the shitshow that was his sophomore year, plus he's working for Deaton more than ever, and somehow he's miraculously managed to get Chris Argent to accept his relationship with Allison, so he's not around as much. He and Stiles don't even have a single class together this year, and free time is hard to come by, so they cram all the quality they can into the few minutes a day they see each other, plus dozens of text messages an hour.</p>\n<p>In fact, the only werewolf Stiles has any classes with is Boyd. They're both taking Family &amp; Consumer Science, which used to be called Home Economics and is mostly cooking and sewing. Boyd can stitch a mean hem, but Stiles kicks his ass at making pot pies. Boyd is only going to school half days, though, because he's in an accelerated program that has him taking classes at the community college in the afternoon; Danny's doing the same. </p>\n<p>This leaves Stiles—who, in addition to his laughably light class load, has a part-time job printing stuff on T-shirts for one of his dad's friends, but is otherwise free to do what he wants—with a lot of time on his hands. Time Derek only seems to be too happy to fill, because being an independently wealthy werewolf leaves him with a pretty flexible schedule. </p>\n<p>Scott will forever be Stiles' BFF, but now Derek is the guy who goes to see the new Avengers movie with Stiles for the third time, and checks out the new sushi place when it opens. Derek gives him a jump when the Jeep's battery dies in the 7-11 parking lot and Stiles can't get ahold of anyone else, and follows him home to make sure he makes it. He even buys Stiles a Big Gulp, and blows him on his bed before he takes off, to make up for his shitty day. It's kind of sweet. </p>\n<p>Stiles makes Derek a T-shirt that says \"Alpha Knows Best\" on it. It's supposed to be a joke, but Derek actually wears it. A lot.</p>\n<p>Because Stiles is eighteen already, he's able to actually call in his own school absences, which he doesn't abuse too often, because he doesn't want his dad to start paying too much attention to his attendance record. But sometimes, when there isn't much going on at school, he takes a sick day and spends it with Derek, in bed, and it's pretty freakin' great. </p>\n<p>That's what they're doing the day Stiles screws up.</p>\n<p>\"I want a burrito,\" Stiles says forlornly. There's no way he is in any shape to get out of bed and walk down the block to the taqueria; having sex with Derek Hale is exhausting. \"With extra meat.\" He needs his protein if they're going to go again before he heads home.</p>\n<p>\"I think your pants are behind the TV,\" Derek says contemplatively, like it matters where Stiles' pants are, like he's capable of getting out of bed right now.</p>\n<p>\"Burritoooooo,\" Stiles says again, drawing out the O as long as he can, until it turns into a whimper as Derek tries to get Stiles to finally move off of him. </p>\n<p>Derek laughs and says, \"You've got a problem. You need burrito rehab,\" but he gives Stiles the fondest little kiss on his forehead before he shoves him off onto his own side of the bed. </p>\n<p>Stiles wakes up later to Derek sitting next to him on the bed, fully clothed but in Stiles' T-shirt instead of his own, and his hair looking like someone ran their hands all through it while Derek sucked their cock. Which is exactly what happened.</p>\n<p>\"You have blowjob hair,\" Stiles mumbles, taking a moment to leer appreciatively at the way Derek's improbable biceps are stretching the hell out of Stiles' shirt sleeves. Then Derek holds up the instantly recognizable fat, foil-covered shape that is definitely a burrito. </p>\n<p>\"Extra meat,\" Derek says triumphantly, and places it in Stiles' grateful hands before peering back into the paper bag in his lap, presumably looking for his own burrito. There's another bag next to his hip that probably contains chips and queso, because Derek cannot resist tortilla chips to save his life.</p>\n<p>\"Oh my God, you're awesome. Have I told you how much I love you?\" Stiles says fervently, tearing into the foil, and Derek lifts his head and smiles, the softest smile Stiles has ever seen on him. As Stiles blinks up at him, confused, Derek leans down and carefully cups his hands around Stiles' face, thumbs rubbing his cheekbones, and kisses him. Gently, so gently, and Stiles has a really bad feeling about this that's exactly the right feeling to have because after he stops kissing him, Derek bumps his nose against Stiles' and says, still smiling, \"I love you, too.\"</p>\n<p>And Stiles thinks, <i>Oh shit.</i></p>\n<p>~*~</p>\n<p>Things change after that.</p>\n<p>No, things don't just change. They get <i>weird</i>. Really effing weird.</p>\n<p>Derek buys Stiles a toothbrush—a Batman toothbrush—that lives in the plastic holder in Derek's bathroom, next to Derek's toothbrush, which is just plain boring green. He cooks actual meals for Stiles—with vegetables and everything—and starts grumbling when Stiles tries to go home after sex. It's easier to just stay, and Stiles is comfy and sleepy anyway, so sometimes he does, even though he thinks he shouldn't encourage Derek. His Dad thinks he's at Scott's, so what does it matter? </p>\n<p>It's all just little stuff, Stiles tries to tell himself, and not that unexpected when they spend so much time together and the sex is so damn good. It's convenient, that's all. He can deal.</p>\n<p>But then Derek brings up Christmas. In October. </p>\n<p>\"You think you could somehow swing a couple days away during your break?\" Derek asks, after he hands a hopeful zombie football player a couple extra mini Snickers, and then helps himself to one, too. He's wearing a headband with a crooked wire halo sticking out of it. Stiles, who won the coin toss, is wearing devil horns.</p>\n<p>Derek's theoretically helping Stiles hand out Halloween candy at the Stilinski house, though mostly he's standing around looking grumpily adorable in his halo and eating all the candy himself. Stiles normally handles candy dispensing duties alone, because the sheriff's department is always in all-hands-on-deck mode, watching for stranger danger. During the few overlapping years after Stiles' mom died and he was still young enough to go trick-or-treating, Mrs. McCall took him around with Scott so he could get candy.</p>\n<p>\"To do what?\" Stiles asks while he fishes through the orange plastic bowl for a Kit Kat. He comes out with three tucked into his fist. Perfect.</p>\n<p>Derek shrugs as he steals another Snickers. It's Stiles' experience that the more casual Derek acts, the greater the importance of what he's about to say, and the greater his reluctance to say it. Stiles concentrates on tearing one of his Kit Kats open with his teeth so Derek doesn't feel like he's being stared at.</p>\n<p>\"There's this place in Tahoe that's kind of nice. I've been there before,\" Derek says, all his consonants softened by caramel. \"You could go snowboarding.\"</p>\n<p>\"You don't snowboard,\" Stiles says, dumbfounded, before the gears in his brain fly into motion. Derek's asking him to go away for the weekend, and Stiles doesn't need a secret decoder ring to figure out that \"I've been there before\" probably means \"I went there with my family.\" Derek wants to take him somewhere that means something, a place where he was probably happy, years ago. \"I mean—what would <i>you</i> do?\" Stiles asks.</p>\n<p>Derek shrugs again. \"I just thought, if you wanted to go. I'd pay for it.\" He's really intent on finding another Snickers, even though there are like four of them right on top of the candy pile.</p>\n<p>The doorbell rings. Stiles can hear giggling and tiny piping voices outside. \"I don't know if I—my dad…\" he says, floundering.</p>\n<p>\"It's okay if you can't,\" Derek says quickly, and Stiles hates how easily he accepts it, like he's so used to never getting what he wants that it doesn't even faze him anymore.</p>\n<p>The doorbell rings again, a demanding four times in quick succession, which must kill Derek's ears, but he just gives Stiles a quick Snickers-scented kiss and urges him toward the door with a hand curved warmly over his ribs. Stiles opens the door and doles out the goods to a fairy princess and a Captain America, the bowl of candy bars clutched tightly to his chest, holding in his aching heart.</p>\n<p>~*~</p>\n<p>Derek tells him he loves him twice more, once while they're fucking, and Stiles is too busy coming to respond and then so is Derek, and he doesn't bring it up later that Stiles never actually said it back. The second time Stiles has already opened his mouth and is just about to say, \"Yeah, uh, about that…\" when the window suddenly explodes inward and they're in the middle of the most conveniently-timed warlock attack ever.</p>\n<p>Stiles knows he needs to tell Derek the truth, but just the thought of it makes him want to crawl under his bed and hide forever. And this is the thing about being a mature, responsible adult who is in a sexual relationship with another adult: you have to deal with adult shit, and you're supposed to do it in an adult manner. So hiding under your bed is probably out.</p>\n<p>Except Stiles is not an adult, he realizes way too belatedly. He's a stupid kid—a high school kid—who hasn't ever done anything like this before, and so even though he thought he knew the rules, now he isn't quite so sure how to handle the fact that <i>Derek</i> apparently doesn't.</p>\n<p>So Stiles does what comes naturally, which is go to Scott and freak out. It takes a few days to schedule it in, but he eventually manages to be off work when Scott is home for the evening. </p>\n<p>Even so, life is unpredictable, so Stiles doesn't waste any time on pleasantries. He races up the stairs to Scott's room, scrabbles the door open, and says, \"Derek told me he loves me. <i>Help</i>.\"</p>\n<p>Scott is taking all of the socks out of his sock drawer for some reason. \"I warned you!\" he says, bizarrely. That was the last thing Stiles expected to hear.</p>\n<p>\"What? No, you didn't!\" Stiles says. He sounds a little shrill even though he's trying really hard not to, and it's annoying. \"At no point did you say 'Stiles, you absolutely must not sleep with Derek because he will fall in love with you and make it weird.' <i>You never said that!</i>\"</p>\n<p>\"Well, that's what I meant,\" Scott says stubbornly, dropping more socks onto the pile on the floor. He glances at Stiles' outraged face and then goes for backup: \"Erica said she warned you, too.\"</p>\n<p>\"No, she didn't!\" Stiles insists. \"She said she didn't want to listen to me whine—\"</p>\n<p>Except—wait a minute. Erica didn't say she didn't want to listen to <i>Stiles</i> whine about his broken heart. She said she didn't want to listen to <i>anyone</i> whine. And it had never, ever occurred to him that Erica had been talking about <i>Derek</i> getting his heart broken. In fact, if Stiles had ever taken the time to make a list of people whose hearts were capable of being broken, Derek would probably be somewhere at the bottom of it, because sometimes he acted like he didn't have a heart at all.</p>\n<p>But that wasn't entirely true, was it? Derek only <i>acted</i> like he didn't have one. Which was what people tended to do when they, in fact, did have one and it was particularly vulnerable. And Derek has apparently given Stiles access to his, which is such a bad, bad, horrible idea that Stiles has to actually sit down on Scott's bed to effectively contemplate the enormity of how bad it is.</p>\n<p>And they hadn't ever really talked about it in depth, had they? There had been a conversation, but it was mostly along the lines of \"You wanna?\" (yes, they did) and \"Let's not let this make things weird,\" (they agreed not to) and \"How many condoms should we buy?\" (two boxes of twelve, for starters). It had actually made Stiles feel kind of experienced and grown-up, being totally cool about the whole thing, talking about it like it was no big deal. It had seemed easy.</p>\n<p>Too easy, in retrospect.</p>\n<p>Stiles had thought they were buddyfucking, but maybe this whole time Derek had thought they were <i>dating</i>.</p>\n<p>\"You need to tell him the truth,\" Scott says, interrupting Stiles' increasingly uncomfortable internal flashback episode. \"Right away. Don't drag it out.\" </p>\n<p>Stiles nods. \"I know.\" He needs to swallow, but his throat won't let him. \"I will.\"</p>\n<p>~*~</p>\n<p>Stiles intends to tell Derek, he really does. But when he goes over to Derek's place unannounced, Derek looks so happy to see him, so beautiful and relaxed in the golden afternoon light, that they end up having sex, followed by a completely different conversation than Stiles intended. Stiles blames the post-sex cuddles. They cloud his judgment.</p>\n<p>\"Hey, my dad left for that terrorism conference, you want to come over later?\" Stiles asks, as he's putting his shoes back on, and Derek says, \"Sure,\" and shows up at Stiles' house that night with an overflowing duffle, and some vegetables in a grocery bag. It isn't until Derek's stashing the food in the fridge and saying, \"I figured this stuff wouldn't last until I go back home,\" that he realizes Derek thought Stiles meant come over for <i>the whole week</i>, not just the night.</p>\n<p>Okay, so they're going to be together all week, Stiles thinks, tamping down his impending freak-out. That's not the worst thing that could happen. Surely somewhere in there he'll find the time to tell Derek the truth.</p>\n<p>Except he doesn't.</p>\n<p>The week is full of great sex followed by no one having to get up and go home, and that kind of weakens his resolve. Actually, it liquefies his resolve and then evaporates it. He keeps telling himself it's time to be an adult, and part of being an adult is doing difficult things, but he never gets around to it on the first day, or the second day, or the third. And then he starts to think this spending the week together thing is pretty enjoyable, so why wreck it by breaking up? They can just break up on the last day and not miss out on all the good stuff in the meantime. It's a brilliant plan!</p>\n<p>They're too busy to have a serious break-up talk anyway. Stiles goes to school—most of the time—and goes to work for a few hours, and then when he gets home Derek is there, glad to see him, and there's all kinds of grown-up, responsible stuff to do together. They shop for groceries and do their laundry and take the Camaro to the carwash, and Derek fixes the sagging hinge on the basement door, and Stiles makes pot pies. There's also a lot of the aforementioned sex to be had. They've never had sex in Stiles' bed before, which is tiny and bangs against the wall, or in Stiles' shower, which got updated in the remodel last year and actually has more space than his bed, and the novelty of all this good sex in new places is enjoyable.</p>\n<p>Stiles forgets, for hours at a time, that he's supposed to be cutting Derek loose. But when he does remember, he does a poor job of hiding his anxiety over it. </p>\n<p>\"You okay?\" Derek asks him on the last night, concern written all over his face. Since lying to Derek is impossible, Stiles kisses him instead, and keeps kissing him until they both forget Derek even asked.</p>\n<p>\"I know I'm probably not very good at this,\" Derek says in the dark, a little later. Derek's the little spoon, so Stiles can't see his face, only the back of his head. \"I'm kind of fucked up,\" he confesses. Like Stiles--and probably everyone else Derek has come into contact with over the last eight years--doesn't have that figured out.</p>\n<p>Then, completely without any prompting at all from Stiles, Derek tells him why he's so fucked up. Derek tells him the truth about Kate Argent. </p>\n<p>He's slow, and methodical, and he doesn't get choked up, he doesn't ever pause or hesitate over word choice or particularly awful details. He just quietly shares the whole story, and Stiles clings to his back and doesn't make a sound, and hates himself.</p>\n<p>There's no way to kid himself about his behavior: Stiles has been cruel, and he's been thoughtless, and he was so, so blind. He assumed he could get what he wanted from Derek and not give a shit about what Derek wanted beyond convenient access to orgasms. He hadn't even actually known what Derek really wanted, because they hadn't talked about it in depth, and Stiles had just assumed Derek was the perfect choice for casual sex. In the hugest of ironies, it turns out there's nothing casual about sex for Derek. Stiles had somehow equated \"older\" and \"good-looking\" to mean \"will fuck on demand\" and that's <i>awful</i>.</p>\n<p>\"So I don't really know how to be normal about this,\" Derek says at the end.</p>\n<p>\"You're doing fine,\" Stiles says, and pulls him a little closer and kisses the back of his head. He's not lying. Derek, for all his issues, is loyal and thoughtful and awkwardly sweet, and will make someone a great boyfriend someday. \"You're perfect.\"</p>\n<p>\"Thank you,\" Derek says, and he falls asleep pretty quickly after that--exhausted from all the sharing, probably--but it takes Stiles a lot longer. A lot longer.</p>\n<p>They have sex one last time in the morning, slow and sweet how Derek likes it, with lots of eye contact and whispered pleas and joined hands. Stiles hadn't understood, the first time, what it meant. He wishes he didn't understand now. </p>\n<p>After breakfast, Derek goes back home, and Stiles absolutely doesn’t sit on his bed and choke back tears for poor Derek Hale, who's about to get his battered heart broken again, because he was stupid enough to trust Stiles with it.</p>\n<p>~*~</p>\n<p>\"I talked to Rosa,\" Dad says that evening, when Stiles comes home soaked to the skin from an impromptu run in the rain, which he spent brooding about Derek. Stiles goes on immediate alert, because his dad has that <i>tone</i>, and Rosa is the lady across the street who knows everyone and everything. \"She says there was a black Camaro parked here all week.\"</p>\n<p>Stiles slowly unties his muddy shoes and lines them up on the rubber tray next to the door as he sorts through his options. Does he try to cover it up? Does he admit something was going on, but that he's going to end it anyway? </p>\n<p>\"I only know one guy in your social circle who has a black Camaro,\" Dad goes on. \"Though I seem to recall you assured me he was on the outer edge of your social circle.\"</p>\n<p>\"It was Derek,\" Stiles admits, just to save them both time. This is already unbearable enough. \"He spent the week here.\"</p>\n<p>\"Because you're….?\" Dad says, trailing off and using his eyebrows to finish the question, making a face he possibly believes communicates the many filthy things he (correctly) suspects Stiles and Derek have been doing.</p>\n<p>\"Yes,\" Stiles rushes to say, because he's afraid his dad might resort to hand gestures next and his brain can only handle so much trauma. \"For a while now.\"</p>\n<p>His dad sighs and pinches the bridge of his nose with his fingers. Then he sighs and stares up at the ceiling. Then he sighs and stares at the refrigerator. It's a three sigh problem. That's not good.</p>\n<p>\"Listen, kid,\" he says at last. \"I know you're eighteen, and you're technically an adult, but you're still in high school, and you're still living under my roof.\"</p>\n<p>Stiles nods along—yes, yes, got it, he knows—but his mind is already barreling ahead because that's his mind's specialty. He's already picturing his dad telling him he's not allowed to see Derek anymore. He's picturing having to tell Derek that, and the way Derek's face will look, the way he'll probably just fucking accept it like he did when Stiles hedged about the Tahoe trip. Like he was expecting it all along, because it's been years since Derek's had anything pleasant in his life that lasted more than three seconds except for Stiles, and now he's going to lose that, too. </p>\n<p>Stiles is picturing having to stay away from Derek, not see him or talk to him or text him every day. Not doze on the couch nestled into the solid curve of his body, not watch the way his mouth opens on a choked cry when Stiles makes him feel really, really good. Not see the way Derek smiles at him when Stiles stomps through his front door and throws his backpack on Derek's couch.</p>\n<p>He pictures his life without Derek in it, and Derek's life without him in it, and it's depressing. And even though Stiles has spent the last week trying to work up the nerve to make that happen, now it's the absolute last thing he wants. Just the thought of it makes his heart feel like it's cracking in two and holy shit, he does love Derek. He does.</p>\n<p>\"It's not just sex,\" Stiles says, over whatever his dad is saying. He has no idea what it is, he wasn't listening.</p>\n<p>\"All right,\" Dad says slowly, and Stiles isn't sure if he just made things better or worse. </p>\n<p>\"We really—care about each other,\" Stiles barrels on, because he needs to make his dad understand. This is important. \"We care about each other a lot. And so I hope you're not going to say I can't see him anymore, because that would make us both miserable. And Derek's already been dealt enough misery for a dozen people, more than you even know, Dad. It's so much worse than you know, and I'd rather not be another thing for him to be miserable about.\"</p>\n<p>And this is where Dad being the sheriff comes in really, really handy, because he might not know all of it—not even half of it—but he knows some of the big stuff. He <i>was there</i> for some of the big stuff. And Dad isn't an asshole. He's a cop because he wants to help people. He doesn't want bad things to happen to anybody.</p>\n<p>Dad looks like he might be equal parts alarmed by the fact that things are more serious than he'd thought and pleased his kid isn't a sociopath. \"You're saying you have feelings for Derek? This is all kind of sudden.\" He gives Stiles a suspicious squint. \"Unless it <i>isn't</i>.\"</p>\n<p>Stiles suddenly isn't sure of the answer himself. \"The…\" Stiles searches for a Dad-appropriate euphemism \"…physical stuff is recent. Really recent. Like, totally of age and legal recent. But…\" He stalls out while he thinks—no, while he <i>realizes</i>. Dad just watches him patiently. \"But it's been building for a while.\" That seems the best way to describe it.</p>\n<p>Stiles isn't really surprised by the next question, because his dad's a cop, for chrissake. He's putting two and two together. \"Have you been sleeping over at his place? When you said you were at Scott's?\"</p>\n<p>\"Sometimes,\" Stiles winces. \"I'm sorry I lied. I didn't think you'd let me and I…\" Oh, God, this is just one belated epiphany after another. \"I just wanted to spend time with him.\"</p>\n<p>Dad crosses his arms over his chest and gives him a hard look. \"You know about safe s—\"</p>\n<p>\"YES!\" Stiles says, because NO. He does not want to have this talk. He goes to a public school in a very liberal town, and when his mother was alive she believed in being open and honest with kids about awkward topics. He's known all the ins and outs of condoms since fifth grade.</p>\n<p>\"That's good,\" Dad says, projecting sincere gratitude Stiles doesn't need a sex ed refresher. \"Just be honest with me from now on, though, all right? I want to know where you really are and who you're really with.\"</p>\n<p>Stiles nods and nods, so relieved. This is going better than he could have hoped for, really. Nothing so far about not being able to see Derek, and it sounds like even the sleepovers at Derek's are still a go. If he plays it right, he might even be able to make that trip to Tahoe happen. There's still the sticking point on the honesty that involves all kinds of crazy shit like full moons and other supernatural crap, but he's going to tell his dad the truth about Derek in regards to their personal relationship at least. It's a relief, really.</p>\n<p>\"And as long as you keep your grades up,\" Dad continues, \"no restrictions. But if you start letting him get in the way—\"</p>\n<p>\"I won't,\" Stiles promises, without hesitation. His schedule is so easy this year he'd probably have to put more effort into failing than keeping his grade point average afloat. \"Sometimes I just do my homework there,\" he volunteers, because that seems like something that will earn them both a couple bonus points. \"And then we watch TV.\"</p>\n<p>His dad looks happily surprised by that. It makes Stiles' heart feel warm. \"Well, you guys could do that over here,\" he says after a moment, and Stiles see it for the peace offering it is, and God, Stiles loves his dad so damn much. \"If he wants to come over some night, watch <i>Bunheads</i>…\"</p>\n<p>\"Absolutely not,\" Stiles says immediately. \"I don't want anyone to know you watch <i>Bunheads</i>.\"</p>\n<p>~*~</p>\n<p>Stiles lets himself into Derek's place with the key Derek gave him months ago, which really should have been a clue. Derek's just shrugging out of his jacket, and still has his boots on, so he just got here, too. He's wearing that stupid shirt Stiles made for him. Another clue that went right over Stiles' thick head.</p>\n<p>\"Everything okay?\" Derek asks, as soon as he looks at Stiles, because he always knows within a fraction of a second if he's upset about something, and <i>that's</i> not new, either. Stiles really has been a dumbass.</p>\n<p>Stiles nods, but it's kind of jerky and weird-feeling, and only makes Derek look at him a little more sharply. Derek tosses his jacket over the back of the couch and crosses the room, covering the space between them in just a few long strides, straight back and handsome face and broad shoulders, and he's Stiles' <i>boyfriend</i>. Stiles feels a little weak in the knees.</p>\n<p>He had a huge speech planned, but it all goes out the window when Derek stops in front of him, concern tightening his mouth, hands pulling Stiles in where he belongs. Stiles wraps his arms around Derek's back and hides his face in Derek's neck, where he's so warm and smells so good. Derek's hand comes up and cups the back of Stiles' head, thumb rubbing gently behind his ear. He's so big and strong and stoic, it's easy to forget he can be hurt, too. Stiles is never going to hurt him, if he can help it.</p>\n<p>And he's going to go to Tahoe with him, no matter what he has to do to make it happen.</p>\n<p>\"Stiles? You all right?\" Derek asks him, mouth moving against his temple.</p>\n<p>Stiles takes in a big, shuddery breath, and he can feel the tension singing through Derek's body, bracing for whatever Stiles is about to say.</p>\n<p>\"Yeah, I'm fine. I just—I just wanted you to know that I love you,\" Stiles says, and it's almost painful how true it is. \"That's all.\" That's the easy part. He'll tell Derek about his dad and <i>Bunheads</i> later. Baby steps.</p>\n<p>He feels Derek relax immediately. His hand slips down and squeezes the back of Stiles' neck as he kisses the side of Stiles' face. It feels like he's smiling. \"I know you do,\" Derek says, and maybe he always knew. Maybe he knew before Stiles did. \"I know.\"</p>\n<p>\n<b>The End</b>\n</p>"
}