{
  "id": "785571",
  "url": "https://archiveofourown.org/works/785571?view_full_work=true",
  "author": [
    "ZairaA"
  ],
  "title": "That's His Name",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin/Arthur Pendragon (Merlin)"
  ],
  "characters": [
    "Merlin (Merlin)",
    "Arthur Pendragon (Merlin)",
    "Leon (Merlin)",
    "Gwaine (Merlin)",
    "Hunith (Merlin)"
  ],
  "additional_tags": [
    "Alternate Universe - Canon",
    "Humor",
    "Oblivious Merlin",
    "Pining Arthur",
    "Magic Revealed"
  ],
  "language": "English",
  "series": "",
  "published": "2013-05-05",
  "completed": null,
  "words": "6,834",
  "chapters": "1/1",
  "comments": "393",
  "kudos": "31,859",
  "bookmarks": "4,557",
  "hits": "276,705",
  "summary": "<p>In a world where Arthur and Merlin never went to Ealdor, Merlin is home visiting his mum. People soon are getting annoyed about all his talk about this Arthur chap, they don't believe for a second that Merlin of all people could be close to the king. Until the king pays a visit.</p>\n<p>Written for prompt #87 at Merlin Muses Prompt Fest</p>",
  "notes": "<p>A wonderful person agreed to beta this for me on a very short notice and totally saved my arse – Thank you so much!</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>Dear prompter, if you read this I really hope it was to your liking! Thank you for the inspiration. :)</p>",
  "text": "<p>It was strange to be back. Good strange, he immediately felt the need to add, even in his own thoughts, but strange nevertheless. Ealdor was a small village, but it had changed since he had left for Camelot all those years ago. It had prospered. There was even a tavern now. Well, John Alberry had built an extension to his hut and sent his children to sleep in the hayloft, but still. There were tables and chairs and, most importantly, there was ale.</p>\n<p>It wasn't that Merlin was such a huge fan of taverns. He seldom had the opportunity to visit one, despite what ideas Arthur had thanks to Gaius. But it was his time off and he was home to visit his mum and there was not even the smallest threat of a single bandit or magical beast, so... Merlin could relax for once.</p>\n<p>He went to the bar, handed John a shilling, and accepted the mug of ale with a broad grin, letting his gaze wander across the small room. The tavern obviously was a success, if the amount of people enjoying the wares in the early evening was any indication. He took a deep gulp from his cup and hummed appreciatively.</p>\n<p>''This is good stuff,'' he told John. ''I bet even Arthur would like it.''</p>\n<p>John looked at him with a puzzled frown but nodded with the stoicism of a born barman.</p>\n<p>''It's not like Arthur is that picky, mind. I know, you would think he was, what with his station and all, wouldn't you? But he has the stomach of a horse. I mean, the rat didn't go well, that time, but I can hardly blame him. He made me eat it, though, the bastard.''</p>\n<p>Merlin rolled his eyes at John, as if John knew exactly how much of a bastard Arthur was.</p>\n<p>''He hardly deserved better. I mean, it was his fault after all. I told him, didn't I? Don't shoot the unicorn, Arthur, I said, but would he listen? Ha! As if he ever would. The number of times Arthur could have saved himself so much trouble, hell, could have saved <em>me </em>so much trouble, if he would. Just. Listen. But no...''</p>\n<p>Merlin sighed and drained his cup, pushing it towards John with another shilling.</p>\n<p>''Arthur did drink the poison in the end, though,'' he admitted begrudgingly. ''Wouldn't let me do it. Then of course it wasn't poison, thank the gods. Just imagine what would have happened, eh? Stubborn bastard, that's what he is. And sneaky.''</p>\n<p>For a moment Merlin stared in his cup with a frown.</p>\n<p>''How would he even know that mum wrote me, that she missed me and wished I would come visit some time?'' He looked up at John who had just been about to walk away. ''You think Arthur read my letter? Now, that would be really rude, wouldn't it be? I mean, just because I read all of <em>his </em>secret letters and documents and what not, doesn't mean he can read my private mail. And anyway, leaving them lying on his table is practically an invitation, isn't it? It's not like it's state secrets! Well, I guess they are, but it's not as if I would tell anyone, right?''</p>\n<p>He looked at John imploringly.</p>\n<p>''Right?''</p>\n<p>John sighed. “Merlin, I have no idea what you are talking about. Who the hell is this Arthur?''</p>\n<p>And then he left Merlin with his ale and a very gob-smacked expression on his face.</p>\n<p align=\"CENTER\">~*~ </p>\n<p align=\"LEFT\">The next morning, Merlin wasn't so sure the tavern had been a great idea after all. His head felt like it had grown to twice its size during the night and was also filled with lead. He stumbled from his bedroll and out the back door to unceremoniously plunge the offending appendage into the trough.</p>\n<p align=\"LEFT\">For a moment he just contemplated leaving it there, in the cool water, but breathing became an issue after a while and so he pulled it out reluctantly. With his hands gripping the rough stone, he hung his head, water dripping from his soaked hair.</p>\n<p align=\"LEFT\">That's when he heard them.</p>\n<p align=\"LEFT\">''You know, Merlin was always a strange one, even before he went off to the big city, but now he is positively crazy. I had no idea what he was talking about half the time, yesterday.''</p>\n<p align=\"LEFT\">''Me neither. All this talk about unicorns and poisoned drinks, quests and bandits. One would think he believes himself a knight rather than a footman.''</p>\n<p align=\"LEFT\">''Yes, and what's the matter with this Arthur he keeps complaining about?''</p>\n<p align=\"LEFT\">''I have no idea, but he seems mighty obsessed, that I can tell you.''</p>\n<p align=\"LEFT\">Merlin stood straight, blinking the water from his eyes, as he watched through the bushes as the two women, friends of his mother's by the names of Agnes and Hannah, walked away chattering. After a moment he decided that his hang-over must be the reason why that conversation had made so little sense to him.</p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Since autumn was heavy in the air and the harvest had already been brought in, there was little work that Merlin was skilled enough to help with. He didn't know how to tan the skin of sheep or dear, was too clumsy for basketry and even worse with spinning or weaving.</p>\n<p align=\"LEFT\">So he got stuck with the daily routines like fetching water from the well, or gathering fire-wood from the forest. Work that was mostly done by the children of the village. But the little boys and girls were good company, asking curious questions about his life in Camelot and whether the knights were really that strong and the citadel really that big and beautiful, or whether there were feasts with jugglers and magicians.</p>\n<p align=\"LEFT\">''Oh, yeah!'' Merlin answered that last question with a frown. ''You have to be careful, though, because most often they want to assassinate Arthur.''</p>\n<p align=\"LEFT\">''Who is Arthur?''</p>\n<p align=\"LEFT\">''Oh, he is a bit of a clotpole to be honest. But also very handsome, and brave and strong.''</p>\n<p align=\"LEFT\">The children exchanged a look with each other.</p>\n<p align=\"LEFT\">''Yes,'' one of the older girls said with badly concealed exasperation, ''but who <em>is</em> he?''</p>\n<p align=\"LEFT\">That made Merlin stop short.</p>\n<p align=\"LEFT\">''Who-... you mean, you don't know who Arthur is?'' he asked uncertainly.</p>\n<p align=\"LEFT\">Surely that could not be.</p>\n<p align=\"LEFT\">They shook their heads.</p>\n<p align=\"LEFT\">''Well, you see, in Camelot, that's where the land is ruled. So there is a king-''</p>\n<p align=\"LEFT\">''Yes, King Arthur!'' a little boy piped.</p>\n<p align=\"LEFT\">''Exactly! King Arthur. See? I knew you know that much,'' Merlin said with some relief.</p>\n<p align=\"LEFT\">''Yeees,'' the older girl started again. ''But surely you haven't been talking about the king?'' she asked.</p>\n<p align=\"LEFT\">Merlin grinned at her. ''About the very same.''</p>\n<p align=\"LEFT\">''But you called him a clotpole.''</p>\n<p align=\"LEFT\">''And a prat.''</p>\n<p align=\"LEFT\">''And a bastard.''</p>\n<p align=\"LEFT\">Merlin suddenly felt himself surrounded by accusing eyes. Maybe he should rethink his choice of company.</p>\n<p align=\"LEFT\">''That's because he's my friend,'' he explained. Then he cocked his head. ''And also because it's true.''</p>\n<p align=\"LEFT\">''You're friends with the king?'' the little boy asked wide-eyed.</p>\n<p align=\"LEFT\">''Well, kind of, sometimes, I guess... yeah?''</p>\n<p align=\"LEFT\">''But... you're just... Merlin.''</p>\n<p align=\"LEFT\">Well, that was true. Although Merlin didn't really understand what the logical connection was, or why everyone was so surprised. After all, it was the most normal thing in the world, wasn't it?</p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Okay, so apparently it really wasn't. Apparently it was some kind of huge deal, and even his mum seemed to think so. She was his mum, and she didn't come right out and chide him, but she still very cryptically asked him over bowls of rabbit stew.</p>\n<p align=\"LEFT\">''Merlin?''</p>\n<p align=\"LEFT\">''Yes, mum?''</p>\n<p align=\"LEFT\">''I know you've been gone for a long time, and your life in the city must be very different. In Ealdor, though, we are a very small community, with small concerns. But they are important to us, and... not everyone appreciates to be made fun of, you know?''</p>\n<p align=\"LEFT\">''Of course, mum. You know I wouldn't!''</p>\n<p align=\"LEFT\">''No, maybe not, but... Merlin, you know it's not nice to boast, don't you?''</p>\n<p align=\"LEFT\">''To boast?''</p>\n<p align=\"LEFT\">''All this talk... about the king.''</p>\n<p align=\"LEFT\">''I don't talk that much about Arthur!'' Merlin objected indignantly.</p>\n<p align=\"LEFT\">''And calling him Arthur.''</p>\n<p align=\"LEFT\">''What? That's his name!''</p>\n<p align=\"LEFT\">''No, Merlin. His name is His Royal Highness King Arthur of Camelot,'' his mother snapped. ''That's his name!''</p>\n<p align=\"LEFT\">''I know, mum, but...'' Merlin flailed a little, ''that's not what I call him.''</p>\n<p align=\"LEFT\">''Merlin. You call the King of Camelot... Arthur?''</p>\n<p align=\"LEFT\">Merlin shrugged. ''Mostly, yes. Sometimes I call him a royal prat, though. Or a dollop head. But the last one only if he is especially obnoxious.''</p>\n<p align=\"LEFT\">Hunith stared at him. Then she slapped him around his ears. ''Merlin! I raised you better than this!' </p>\n<p align=\"CENTER\">~*~ </p>\n<p align=\"LEFT\">The next morning Merlin was reminded of an universal fact. Mothers are always right. And so was Hunith. The people of Ealdor really didn't see the humour in Merlin's pretending to be friends with the king. Or actually, they did, but they thought the joke was on him.</p>\n<p align=\"LEFT\"> ''Oh look, there comes Merlin, the king's best mate!'' A young lad named Allen jeered when Merlin stepped out into the morning sun, stretching.</p>\n<p align=\"LEFT\"> ''Hurry, hurry, take him his ablutions, he surely must be used to being pampered, what with being the king's true friend,'' another one called.</p>\n<p align=\"LEFT\">''Here you are, Merlin,'' Agnes said kindly, stepping up beside him with a bucket.</p>\n<p align=\"LEFT\">And then Merlin was left spluttering when the cold water was tipped out over his head.</p>\n<p align=\"LEFT\">The street was filled with roaring laughter and clapping, but it was dampened by the water in his ears.</p>\n<p align=\"LEFT\">''And here is your breakfast, my Lord. Our freshest apples,'' a voice, that he was sure belonged to Bert the smith said with false sweetness.</p>\n<p align=\"LEFT\">Merlin was probably lucky he was still blinking from the unexpected shower, because that way at least his eyes were closed when someone shoved a hand full of horse dung in his face.</p>\n<p align=\"LEFT\">There was more laughter as Merlin started to beat wildly and blindly around hmself, trying to fend off any further attackers, which only made them laugh harder.</p>\n<p align=\"LEFT\">Suddenly, there was the sound of hooves, coming to a stop not far away, and then someone cleared his throat rather loudly.</p>\n<p align=\"LEFT\">''<em>Mer</em>lin. I know I told you to enjoy yourself like a pig in its pen, but I didn't think you would take it quite so... literally.''</p>\n<p align=\"LEFT\">Merlin rubbed at his face, although that probably only helped to spread the dung even further, and blinked up at the imposing figure, sitting on horseback, shadowed against the sun like it was his own personal halo.</p>\n<p align=\"LEFT\">''Arthur?'' he croaked.</p>\n<p align=\"center\"> ~*~ </p>\n<p align=\"LEFT\">It would have been a lot more satisfying to see all those gaping mouths and wide eyes of the surrounding villagers, if Merlin himself had not been in this slightly embarrassing predicament, giving Arthur the perfect excuse to mock him.</p>\n<p align=\"LEFT\">Merlin braced himself but, strangely enough, Arthur wasn't forthcoming. He only watched Merlin with what could almost be called fond amusement for a while. Then, as he seemed to realize that everyone around was staring at him with apprehensive expectation, he schooled his features back to the noble indifference he normally wore for diplomatic functions.</p>\n<p align=\"LEFT\">''Yes, well. We were in the area, and thought we'd stop by. Didn't we Sir Leon?''</p>\n<p align=\"LEFT\">Only then did Merlin become aware of the two knights flanking Arthur. Leon, whom Arthur now watched with a slight frown, didn't quite manage to hide his grin.</p>\n<p align=\"LEFT\">''Of course. Just as you said, your Highness.''</p>\n<p align=\"LEFT\">Gwaine, on Arthur's right, just rolled his eyes and winked at Merlin.</p>\n<p align=\"center\"> ~*~</p>\n<p align=\"LEFT\"> ''But,'' Merlin objected when they had retreated to Hunith's home - well her back-yard at least - so that Merlin could pay a second visit to the trough. ''I thought this was Cendred's kingdom and you couldn't come here without starting a war?''</p>\n<p align=\"LEFT\">Arthur rolled his eyes, leaning against the door frame with his arms crossed. ''Don't be an idiot, Merlin. Cenred's dead, and since we won the battle at Camelot, I made damn well sure that Ealdor was one of the villages his heirs relinquished as war debt to us.''</p>\n<p align=\"LEFT\">''So...'' Merlin squinted at him. ''This is like a first official visit?''</p>\n<p align=\"LEFT\">Arthur looked to the side, apparently becoming very interested in Hunith's rosemary bushes.</p>\n<p align=\"LEFT\">''Well, it's not <em>that</em> official. It's more like... a good opportunity to have a look at my new realms.''</p>\n<p align=\"LEFT\">''What, me visiting my mum?'' Merlin asked with a frown.</p>\n<p align=\"LEFT\">''Don't be ridiculous, Merlin,'' Arthur scoffed. ''This has nothing to do with you.''</p>\n<p align=\"LEFT\">''So you don't want me to come back with you, then?''</p>\n<p align=\"LEFT\">''Well, you've been gone for quite some time...''</p>\n<p align=\"LEFT\">''Barely a fortnight!''</p>\n<p align=\"LEFT\">''...<em>and</em> it would certainly be safer for you, if you would travel with us, so...we will stay for another day or two. And after that...''</p>\n<p align=\"LEFT\">Arthur shuffled his feet, and it was such an un-kingly thing to do, that Merlin couldn't help but smile.</p>\n<p align=\"LEFT\">''Yeah, sure,'' he said with a goofy grin. ''I guess you'll need me back for all that polishing and scrubbing and such. No idea how you could manage even so long without me.''</p>\n<p align=\"LEFT\">''It's not like you do a particularly good job with any of it,'' Arthur said with an eye-roll. ''But... I guess I got used to you- it, I mean. Yes.''</p>\n<p align=\"LEFT\">Merlin smiled brightly at him. ''Well then, do you want to meet my mum?''</p>\n<p align=\"center\">~*~</p>\n<p align=\"LEFT\">It was a strange meeting. Probably because Merlin went in with, ''Mum, this is Arthur.''</p>\n<p align=\"LEFT\">And Arthur, who took it graciously in his stride, offered Hunith his hand with a boyish smile.</p>\n<p align=\"LEFT\">''Pleased to meet you, ma'am.''</p>\n<p align=\"LEFT\">Merlin's mum, though, went white as a sheet, staring for a few seconds before dropping into a deep curtsey.</p>\n<p align=\"LEFT\">''Your Highness,'' she stuttered, clearly thrown way out of her comfort zone, because Merlin would swear he had never heard his mother speak anything but clear and calm. ''It- it is an honour.''</p>\n<p align=\"LEFT\">''Oh, please, none of that,'' Arthur said, clearly uncomfortable. ''Merlin has told me so much about you. I feel like I've known you for years.''</p>\n<p align=\"LEFT\">He laughed nervously, and Merlin was staring at him now, because this was very un-Arthur-like behaviour. Arthur didn't get nervous. And if he did, he didn't show it.</p>\n<p align=\"LEFT\">''Yes, well,'' Hunith said, grabbing for words, ''I didn't know Merlin was so... closely acquainted with... the king.''</p>\n<p align=\"LEFT\">''Oh yes,'' Arthur assured her, clapping Merlin on the shoulder. ''Merlin has been pretty much essential to me ever since he came into my service.''</p>\n<p align=\"LEFT\">Merlin gave Arthur a dubious look. That was certainly the first time <em>he </em>heard about it.</p>\n<p align=\"LEFT\">''Oh. That's... that's wonderful! He's a good lad, my Merlin.''</p>\n<p align=\"LEFT\">''Yes. Though, I am curious,'' Arthur leaned in conspirationally, ''Can you tell me what the whole story was about the horse dung this morning?''</p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Gwaine and Leon had gone to find them a lodging, which had proved difficult since there was no inn at Ealdor. There were plenty of people offering their homes though, but the knights were uncomfortable with dislodging anyone from their own beds.</p>\n<p align=\"LEFT\">Merlin, who had fled the house when his mother had overcome her initial inhibition and had started to cater to Arthur, all the while praising her only son's virtues and abilities, was just seeing to the knights' horses when John Alberry found him.</p>\n<p align=\"LEFT\">''Merlin, lad, there you are.''</p>\n<p align=\"LEFT\">''John. What brings you around?''</p>\n<p align=\"LEFT\">''Oh, I was just thinking, you know, because the king needs lodgings I have heard, and... you know, I would be happy to offer him my own home.''</p>\n<p align=\"LEFT\">''That's very kind of you, John. Best speak to Sir Leon, the tall guy with the red hair, about it.''</p>\n<p align=\"LEFT\">''Ah, yes, it seems the noble Sirs have some... misgivings about it. So I thought, if <em>you </em>could speak to the king... it's just that it would mean great advertising, you know, if I could tell people that the king has spent the night in my tavern. It would be really good for business, and I would make it worth your while. All the ale that you can drink while you're visiting, what say you?''</p>\n<p align=\"LEFT\">Well, in Merlin's opinion, the room above the tavern was as good as any to house the king, and who would say no to some free ale? So he went to tell Arthur that he had found them a place to stay the night. Gwaine, of course, was all for it, having immediately realized the strategical advantage of being housed in a tavern.</p>\n<p align=\"LEFT\">Arthur frowned though, and upon inspecting the room immediately pointed out the problem. The room was quite small and only had one bed, which would easily fit two people who were not too opposed to getting into close contact, but three would definitely become a challenge. So Arthur shook his head.</p>\n<p align=\"LEFT\">''You two take this room,'' he said to his knights. ''And I will stay with Merlin. It's the easiest solution.''</p>\n<p align=\"LEFT\">Gwaine and Leon just shrugged, but Merlin bit his lip. He was quite sure that two knights, however noble, weren't even half as good as a king in regard to furthering Ealdor tavern's reputation.</p>\n<p align=\"LEFT\">''Ehm... Arthur, you do realize that there is no bed to sleep in for you in my mother's house either, do you?''</p>\n<p align=\"LEFT\">Arthur frowned.</p>\n<p align=\"LEFT\">''So where do you sleep?''</p>\n<p align=\"LEFT\">''Just... in front of the fireplace, on my bedroll.''</p>\n<p align=\"LEFT\">''So? What's the problem? I sleep on a bedroll all the time.''</p>\n<p align=\"LEFT\">''Yes,'' It was Merlin's turn to frown now. ''But you could just as easily...''</p>\n<p align=\"LEFT\">But when he saw Gwaine rising an eyebrow and vehemently shaking his head behind Arthur's back, he drifted off with a sigh.</p>\n<p align=\"LEFT\">''You know, never mind.''</p>\n<p align=\"LEFT\">Free ale was highly overrated anyway, and Merlin had a sneaking suspicion that he was a bit of light-weight.</p>\n<p align=\"center\"> ~*~ </p>\n<p align=\"LEFT\">John only frowned at him with an odd look on his face, when Merlin told him that Arthur preferred to spent the night with Merlin. But he stood to his offer and seemed a bit placated when Arthur, Gwaine and Leon sat down in the downstairs room and ordered some lunch. Arthur called for Merlin to join them, but before Merlin could do so, he was dragged into a corner by none other than Bert.</p>\n<p align=\"LEFT\">''Merlin, my boy, I just wanted to say, I'm sorry about this morning. All in good humour, eh? Just a bit of a laugh between friends.''</p>\n<p align=\"LEFT\">Bert was a bull of a man, strong from his work, and his grip was slightly painful, so Merlin only nodded, giving the other man a weak smile.</p>\n<p align=\"LEFT\">''That's what I thought. So, you've got some rapport, after all, haven't you? With the king, I mean. A bit of a favourite, yeah?'' And here he was actually wagging his eye-brows in a lewd gesture. ''So you could maybe show him around a bit. Show him the good stuff here in Ealdor, the craftsman-ship. Like the smithery, for example. I would be all to happy to show him my work.''</p>\n<p align=\"LEFT\">''Yeah, sure...'' Merlin tried to stealthily wriggle himself out of Bert's grasp, which became more and more painful with the minute. ''I mean, I don't know if he would be interested, you know, since he has the royal smithery which does all the weapons and other stuff for the knights and the household,-''</p>\n<p align=\"LEFT\">''I'm sure you have a way to convince him,'' Bert sneered, grip getting impossibly tight.</p>\n<p align=\"LEFT\">''Of- of course.''</p>\n<p align=\"LEFT\">''Merlin?''</p>\n<p align=\"LEFT\">Suddenly the grip on his upper arm was gone, and when he looked up, there was Arthur, standing at his side, looking at the two of them with a frown.</p>\n<p align=\"LEFT\">''I think I asked you to join us for lunch, Merlin. Do you need an official invitation?''</p>\n<p align=\"LEFT\">''No! I just had to... there was just something I had to clarify.''</p>\n<p align=\"LEFT\">Merlin unconsciously brushed his hands down over his sleeves.</p>\n<p align=\"LEFT\">''You should order the roast pork, if Judith still has some,'' He said, going for cheerful and missing by a few inches. ''It's really good.''</p>\n<p align=\"LEFT\">Arthur clapped him on the shoulder and let his hand rest there in an almost possessive gesture. Merlin didn't quite know what to make of it.</p>\n<p align=\"LEFT\">''If you say so,'' Arthur said, while putting on a fake smile for the room, ''then I'll take your recommendation.''</p>\n<p align=\"LEFT\">Merlin saw the gleam in the eyes of the good people of Ealdor, and sighed in trepidation.</p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Lunch was even better than Merlin had expected. There was roasted pork, but the servings were much bigger than what Merlin had gotten the day before. And there was thick gravy too, and freshly baked bread, none of the three-days old crusts.</p>\n<p align=\"LEFT\">Gwaine was telling tales of what had happened in Merlin's absence, steadily interrupted by Arthur objecting to his version of events and apparently setting things straight, while Leon was just grinning to himself.</p>\n<p align=\"LEFT\">When their cups had run empty, the tall knight dragged Merlin with him to the bar to fetch them some more.</p>\n<p align=\"LEFT\">''It's good to see Arthur smile again,'' he said. ''He was in a really bad mood these last few days.''</p>\n<p align=\"LEFT\">''Isn't he always?'' Merlin asked with a mocking eye-roll.</p>\n<p align=\"LEFT\">''No. This time he was in a <em>really</em> bad mood.''</p>\n<p align=\"LEFT\">''He was pining,'' Gwaine supplied from behind them suddenly, reaching around them, where John had two cups already filled.</p>\n<p align=\"LEFT\">''What?'' Merlin asked with a surprised laugh, ''Don't be ridiculous Gwaine, Arthur doesn't <em>pine</em>. I have that on good authority.''</p>\n<p align=\"LEFT\">''Well, and I'm telling you, I can see when a man has his eyes on something that is not there. And it's called pining,'' Gwaine flipped his hair back with a broad grin. ''He might even drag his friends across half of the kingdom because of it.''</p>\n<p align=\"LEFT\">He gave Merlin another wink and set off with his drinks.</p>\n<p align=\"LEFT\">Merlin looked at Leon for comprehension, but the knight just shrugged.</p>\n<p align=\"LEFT\">''Maybe he just really wanted his boots polished,'' he said dryly. </p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">When Merlin suggested that he could show them around a little after lunch, Arthur was all for it. But unfortunately Arthur had a very divergent idea of what would make an interesting destination. When Merlin tried to tempt him with the smithery - after all any self-respecting knight should favour some weaponry display, shouldn't he? - Arthur only waved his hand. </p>\n<p align=\"LEFT\">''Oh, come on, Merlin, I can look at swords every damn day, and no offence to your friend's business, but I am sure it can hardly compete with Camelot's best.''</p>\n<p align=\"LEFT\">''Then... what do you want to see?''</p>\n<p align=\"LEFT\">''Well, you grew up here, didn't you? You must know the best places to catch some trout. I haven't been fishing in ages, and your mother would surely be glad if we brought some home for dinner.''</p>\n<p align=\"LEFT\">''Fishing?'' Merlin looked at the smiling, blond man before him dubiously. ''You want to go fishing?''</p>\n<p align=\"LEFT\">Arthur rolled his eyes. ''I believe that's what I said. Do try to keep up, Merlin''</p>\n<p align=\"LEFT\">Merlin indeed knew the best place to cast a rod, so he took the king and his knights to a quaint little stream for some nice fishing. Well, Arthur at least did attempt to. Gwaine flopped down under a willow tree as soon as they arrived at the clearing, declaring it was the best place for a little nap. Leon kicked him in the side, but all that brought forth from Gwaine was a grunt and a rather offensive hand-gesture. Leon proceeded to walk around the clearing, apparently to look for any stray threat. Merlin wished he could have thought of that as ridiculous, but he had had to thwart too many attempts on Arthur's life to ever be able to mock anyone for taking the task of protecting Arthur too seriously.</p>\n<p align=\"LEFT\">Arthur picked up one of the fishing rods and sat down at a small point that allowed the stream to flow a little slower, making it a good resting and feeding place for the trout. He cast his rod expertly, and Merlin raised a brow at him.</p>\n<p align=\"LEFT\">''What, Merlin? Did you think I wouldn't know how to fish?''</p>\n<p align=\"LEFT\">Merlin shrugged and smiled sheepishly.</p>\n<p align=\"LEFT\">''It's not as if I have ever seen you do it.''</p>\n<p align=\"LEFT\">''I am the king, Merlin, I hardly have the time for it, do I?''</p>\n<p align=\"LEFT\">''Then how did you learn?''</p>\n<p align=\"LEFT\">Arthur looked out over the stream for some time before he answered, a melancholic smile on his face.</p>\n<p align=\"LEFT\">''Bors showed me when I was still too young to be a proper squire. Must have been five or six, still too weak to carry a full armour or handle a sword. But not too young to pester the knights. Bors was always really patient with me, answering all my questions. And he showed me things, things I already <em>could </em>do. Things like this.''</p>\n<p align=\"LEFT\">Bors had been an older knight who had died from a bad fever in Merlin's first winter in Camelot. Arthur had been in an awful mood for weeks after, but it was only now that Merlin realized what the man must have meant to a boy who had no mother and a father who seldom had a warm word for his only son.</p>\n<p align=\"LEFT\">Merlin sat down next to Arthur, his rod lying forgotten in the grass. It was not everyday that he got to see this Arthur. A pensive, almost vulnerable young man, who had to learn to carry the weight of responsibility at far too young an age. Maybe that was why he sometimes acted almost childish, well, with Merlin at least.</p>\n<p align=\"LEFT\">Merlin bit his lip. ''My best friend when I was a boy, his name was Will, his dad showed us this place when we were six. Taught us where the fishes are, what bait to use, how to throw the line, how to reel in the fish. He was forced to join Cendred's army a few weeks later. He never came back. Will died during an attack of bandits a few years ago. I haven't been here since.''</p>\n<p align=\"LEFT\">Arthur looked at him then, and his face was an odd mixture of sympathy and determination.</p>\n<p align=\"LEFT\">''I am sorry. These things shouldn't happen. But I promise you, I will do my very best to make things better for your people, for Ealdor, just like for all the people of Camelot.''</p>\n<p align=\"LEFT\">And Merlin believed him.</p>\n<p align=\"center\">~*~</p>\n<p align=\"LEFT\">It was a strangely peaceful afternoon, sitting next to Arthur at the stream, their shoulders almost touching, with nothing much to do but holding their rods and waiting for a fish to bite. The sun, filtering through the leaves, was still warm on their skin, and there wasn't much sound apart from the stream gurgling happily beneath them and the wind whispering in the trees above. Well, and Gwaine's occasional snores drifting over from the willow tree.</p>\n<p align=\"LEFT\">So Arthur and Merlin were up on their feet in a heartbeat, when there was a sudden shout from Leon.</p>\n<p align=\"LEFT\">''Who's there? Show yourself!''</p>\n<p align=\"LEFT\">Arthur had his sword in hand. And Merlin had his magic pulled around him like an invisible cloak.</p>\n<p align=\"LEFT\">The shrubbery trembled and rustled and then a blond girl scrambled out of it. Followed by a redhead, and a dark haired boy, and... then four little girls and three little boys were standing in the clearing, looking at the knights with wide eyes.</p>\n<p align=\"LEFT\">Merlin stepped forward, frowning at them. ''What are you doing, sneaking up on us like that?''</p>\n<p align=\"LEFT\">''My... my mother said that the king was here,'' the little blond girl stuttered. ''Is that true?'' She looked at Arthur imploringly. ''Are you really the king?''</p>\n<p align=\"LEFT\">Arthur's mouth creased with amusement.</p>\n<p align=\"LEFT\">''Yes,'' he said. ''I am.''</p>\n<p align=\"LEFT\">''But...'' another girl objected, ''A king has to sit on a throne. Don't you have a throne?''</p>\n<p align=\"LEFT\">''I do. It's back in Camelot. But, I will tell you a secret.'' He motioned for her to come closer and leaned down to whisper at her. ''I don't have to sit in it all the time.''</p>\n<p align=\"LEFT\">He winked at her and the girl giggled.</p>\n<p align=\"LEFT\">''And your crown?'' the dark haired little boy piped up.</p>\n<p align=\"LEFT\">''Oh, that's-''</p>\n<p align=\"LEFT\">''Actually you most often stuff it behind your sleeping trousers,'' Merlin contributed, adding a cheeky, ''Sire.'' when Arthur glared at him.</p>\n<p align=\"LEFT\">''Yes, thank you, Merlin, for handing out that information.''</p>\n<p align=\"LEFT\">''No problem, sire.''</p>\n<p align=\"LEFT\">''Why are you calling him 'Sire'?'' the redhead asked Merlin suspiciously.</p>\n<p align=\"LEFT\">''Well, what should he call me?'' Arthur asked amused.</p>\n<p align=\"LEFT\">''Clot pole.''</p>\n<p align=\"LEFT\">''Or a royal prat.''</p>\n<p align=\"LEFT\">''Dollop head.''</p>\n<p align=\"LEFT\">''And a right bastard.''</p>\n<p align=\"LEFT\">Slowly, Arthur turned to Merlin, his eyes promising hell and damnation to come raining down on hapless manservants.</p>\n<p align=\"LEFT\">''Merlin? Care to elaborate?''</p>\n<p align=\"LEFT\">''But mostly he has just been talking about 'Arthur' pretty much non-stop since he came back,'' the little blond girl said with an equally little eye-roll, which Merlin would have found adorable, had it not been directed at him.</p>\n<p align=\"LEFT\">There was a snort coming from their right, where Gwaine still pretended to be sleeping, and Leon turned away from them with a suspicious cough.</p>\n<p align=\"LEFT\">''That's-... I didn't...''</p>\n<p align=\"LEFT\">Mortified, Merlin felt himself blushing. His eyes flew to Arthur, who studied him with his eyebrows raised and a smug smile playing on his lips. Merlin held his breath, waiting, waiting to hear Arthur's voice say something condescending.</p>\n<p align=\"LEFT\">But he didn't. Instead the smugness slowly faded from his smile and then he cocked his head, eyes narrowing. For a moment he looked questioning, almost uncertain and even vulnerable, somehow. Then he coughed, looking away, and... was that a blush on Arthur's cheekbones?</p>\n<p align=\"LEFT\">Just when a very warm feeling hesitantly started to spread in Merlin's chest, Arthur opened his mouth again.</p>\n<p align=\"LEFT\">''Yes, well,'' he said with a wink in the children's direction. ''Merlin has a bit of a mental affliction, so it's best not to listen to him too closely, you know?''</p>\n<p align=\"LEFT\">When the children all started to giggle, Merlin was certain that it was only because they were easily impressed by all that king-business. </p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Things weren't all too peaceful afterwards. The children had taken a shine to Arthur and, strangely enough, Gwaine, who entertained them with tales of knightly quests and fair princesses, thankfully extenuated for their young ears.</p>\n<p align=\"LEFT\">Arthur had actually managed to catch two trout over the course of the afternoon, to the loud applause of the children, and had endlessly mocked Merlin who had only caught one, although Arthur actually called it 'a half' since it was so small. Still, it was enough to bring home to Merlin's mum for dinner, since Gwaine and Leon immediately declared their intent to eat at the tavern, since they didn't want to inconvenience Hunith more than was necessary.</p>\n<p align=\"LEFT\">While Hunith prepared the unexpected blessing of fish, Arthur went to look after the horses. But when Merlin stood up to go with him, he waved him off, declaring that he was certainly capable to do this on his own. To be fair, Merlin had never doubted Arthur's ability to take care of his own horse, just as he was certain Arthur was able to dress himself and turn down his own bed. It was just that it never seemed to occur to Arthur to put these abilities of his to any use.</p>\n<p align=\"LEFT\">So Merlin sat back down at his mother's sturdy table with a frown. Hunith gave him a worried look.</p>\n<p align=\"LEFT\">''Did you two have a fight?''</p>\n<p align=\"LEFT\">''What? No! I mean, it would hardly be appropriate for me to have a fight with the king, now, would it?'' Merlin asked a little sullenly.</p>\n<p align=\"LEFT\">''Oh, Merlin.''</p>\n<p align=\"LEFT\">His mum's smile was warm when she sat down across from him.</p>\n<p align=\"LEFT\">''It's just... I didn't know him. And I couldn't imagine that someone like the son of Uther Pendragon could see the worth in my own lovely but a little awkward son.''</p>\n<p align=\"LEFT\">''What- what's that supposed to mean?''</p>\n<p align=\"LEFT\">''I've seen you two together, Merlin. And believe me, it is quite obvious how highly he regards you.''</p>\n<p align=\"LEFT\">''It... it is?''</p>\n<p align=\"LEFT\">''You are like two sides of the same coin. I wouldn't have believed it if I hadn't seen it with my own two eyes.''</p>\n<p align=\"LEFT\">''What is it with everyone and coins...?'' Merlin mumbled grumpily, but he couldn't help the blush that came back to his cheeks. At least his face got enough circulation these days.</p>\n<p align=\"LEFT\">Hunith just laughed and ruffled his hair, and then got up to see to dinner. </p>\n<p align=\"center\">~*~</p>\n<p align=\"LEFT\">Dinner was a quiet affair, mostly streaked by polite conversation, like Arthur complimenting Hunith's cooking and her thanking him for the trout (''Hey, I caught one too!'' Merlin exclaimed at that), or topics concerning the village, like the last harvest, their stores for the winter and whether Cendred's heirs had given them any trouble in the last months (they hadn't).</p>\n<p align=\"LEFT\">Arthur was, every fibre, the king of Camelot.</p>\n<p align=\"LEFT\">So it came all the more as a surprise to Merlin when, after dinner, Arthur slung an arm around his shoulder and asked:</p>\n<p align=\"LEFT\">''Care to join me for a cup at the tavern, Merlin?''</p>\n<p align=\"LEFT\">And that's how he ended in his current predicament. Because by now all the good people of Ealdor had gotten the message loud and clear. And so Merlin found himself constantly dragged into corners, where he would be asked to advertise anything, from Hannah's basketwork to Agnes' eldest daughter, to the king.</p>\n<p align=\"LEFT\">It was quite exhausting, and also very annoying because all Arthur did was laugh, when he came back to their table with the next offer.</p>\n<p align=\"LEFT\">''You wouldn't happen to be interested in wicker baskets, would you?'' Merlin would ask with a frown, and Arthur would throw his head back and laugh, in that way that had Merlin inexplicably staring at his long throat.</p>\n<p align=\"LEFT\">It probably didn't help that Merlin drained his cup every time he got dragged away, fearing it would be empty on his return anyway, because Gwaine was sneaky like that.</p>\n<p align=\"LEFT\">When he came back with the final offer of the evening, Merlin realised he was probably a little drunk.</p>\n<p align=\"LEFT\">''So... care to marry Agnes Blackbridge's daughter? I hear she is great at embroidery,'' he asked, dropping down next to Arthur.</p>\n<p align=\"LEFT\">Arthur looked at him with one of his odd expressions, and said, ''I fear I don't have much use for embroidery, myself.''</p>\n<p align=\"LEFT\">''No?''</p>\n<p align=\"LEFT\">''No.''</p>\n<p align=\"LEFT\">''Then what are you looking for in a wife? It's only, they've been asking me all evening long and it's getting a bit tiresome.''</p>\n<p align=\"LEFT\">Arthur smiled at him fondly then. ''I fear, I have fallen for a special case of insanity already,'' he said.</p>\n<p align=\"LEFT\">Leon and Gwaine stared at him for a moment before looking at each other with raised eyebrows. Merlin didn't get it.</p>\n<p align=\"LEFT\">''I don't get it,'' he said.</p>\n<p align=\"LEFT\">''No, Merlin,'' Arthur said with a sigh. ''I know you don't.''</p>\n<p align=\"CENTER\">~*~</p>\n<p align=\"LEFT\">Merlin wasn't quite sure how he had made it back to his mother's house, although he vaguely remembered strong arms around him and huffs of warm breath on his cheek. But he didn't care all too much at the moment, because he was <em>really </em>comfortable right now.</p>\n<p align=\"LEFT\">He lay tucked under blankets on his bedroll in front of the fire-place, the alcohol was still a distant hum in his blood, but his head felt almost clear. He was vaguely aware hat tomorrow morning would probably see him paying a visit to his favourite trough again, but that was a worry for another day. He was warm, he was cozy and, he realized, Arthur was lying next to him.</p>\n<p align=\"LEFT\">The weak glow of the embers in the fireplace was just enough to make out the silhouette of Arthur's body and the shadows on his face. And his eyes, which were watching Merlin.</p>\n<p align=\"LEFT\">''Hi,'' Merlin said dumbly, when he realized Arthur was awake too.</p>\n<p align=\"LEFT\">Arthur smiled his fond smile again. ''Yeah,'' he said softly, ''hi to you too.''</p>\n<p align=\"LEFT\">''I don't remember going home.''</p>\n<p align=\"LEFT\">''That might be because I had to carry you.''</p>\n<p align=\"LEFT\">''Yeah?'' Merlin asked. ''I have a suspicion that ale and me don't get along all that well.''</p>\n<p align=\"LEFT\">''Do you? I would have thought you had some training, with all the time you spent at the tavern at home.''</p>\n<p align=\"LEFT\">Merlin sighed. ''That's not really-''</p>\n<p align=\"LEFT\">''Where you spent your time when you are nowhere to be found? Yes, I guessed as much.''</p>\n<p align=\"LEFT\">''You did?''</p>\n<p align=\"LEFT\">''Mhm. I just wonder...'' and here Arthur's eyes roamed over his face like it was his favourite puzzle, ''where it is you do vanish to.''</p>\n<p align=\"LEFT\">''I-... want to tell you but...''</p>\n<p align=\"LEFT\">''Yeah. I know,'' Arthur said with a sigh. ''Big secret-keeper, that's what you are.''</p>\n<p align=\"LEFT\">''Are you mad at me?'' Merlin asked weakly, and Arthur huffed a laugh. It sounded sad, somehow.</p>\n<p align=\"LEFT\">''No, Merlin. I just... there is something I want to tell you too-''</p>\n<p align=\"LEFT\">He broke off, and the way he looked at Merlin now, all intense and serious and almost tender, it made Merlin's heart beat like a wild thing. Arthur's hand reached out to him, and then the tips of his fingers brushed over the corner of Merlin's mouth.</p>\n<p align=\"LEFT\">Merlin gasped, and the hand was withdrawn, Arthur's eyes cast down, when he continued.</p>\n<p align=\"LEFT\">''...but I don't know if I can, whether it's worth the risk if you won't trust me.''</p>\n<p align=\"LEFT\">And suddenly Merlin understood, and his heart ached like it had been stabbed.</p>\n<p align=\"LEFT\">''It is,'' he rushed to say. ''I do.''</p>\n<p align=\"LEFT\">In a display of utter recklessness he grabbed Arthur's hand and pulled it back to his face.</p>\n<p align=\"LEFT\">''I will tell you,'' he promised. ''I'm scared, because I don't know if you can forgive me, and I don't know what I would do if you can't.'' He looked into Arthur's wide, awed eyes. ''Because I can't lose you.''</p>\n<p align=\"LEFT\">''You... you won't,'' Arthur whispered.</p>\n<p align=\"LEFT\">They stared at each other in the almost darkness for what felt like years.</p>\n<p align=\"LEFT\">''I'm a sorcerer,'' Merlin said.</p>\n<p align=\"LEFT\">For a moment there was no reaction. Then Arthur sagged, closing his eyes as all breath seemed to leave him.</p>\n<p align=\"LEFT\">''I- I know that is bad, but... I promise you, Arthur, I only ever used it to protect you. You and... and Camelot. I was born that way, I-''</p>\n<p align=\"LEFT\">When there was still nothing but silence, Merlin whispered brokenly, ''I'm sorry, Arthur.''</p>\n<p align=\"LEFT\">He wiped at the traitorous tears that spilled down his cheeks and sat up, suddenly not able to stand the rejection, the contempt he knew he deserved, the way he had tarnished and destroyed everything between them.</p>\n<p align=\"LEFT\">He threw off the blankets but, before he could scramble up on his feet, there was a hand on his wrist, holding him fast.</p>\n<p align=\"LEFT\">Merlin froze. In the few seconds that followed, every horrible version of his own ending, executed by the man he had come to respect and admire and love, was running through his jumbled head. Then-</p>\n<p align=\"LEFT\">''Merlin...'' Arthur looked up at him, his face such a mixture of outrage, disbelief and wonder that Merlin had no idea what would come out of his mouth next. ''You utter, absolute, impossible <em>idiot</em>!'' He sat up with a huff. ''You are a sorcerer. And you come to Camelot?! Of all the places in the world, when you-?'' He broke off, shaking his head. ''My father would have <em>killed</em> you! Do you understand that!? If he had ever found out...''</p>\n<p align=\"LEFT\">And now Arthur was trembling, staring at Merlin with his blue eyes impossible wide.</p>\n<p align=\"LEFT\">''He would have... and I might not have... and you could have <em>died</em>, Merlin!''</p>\n<p align=\"LEFT\">Merlin nodded reluctantly. ''I... know.'' He pulled his face into a grimace. ''It was kind of hard to miss with the pyres burning and the heads rolling...''</p>\n<p align=\"LEFT\">And then Arthur slapped him. It didn't hold any force, and Merlin was shocked more by the emotion in Arthur's eyes than by the light sting on his cheek.</p>\n<p align=\"LEFT\">''Don't you ever dare... you don't get to gamble with your life like that... and then joke about it! You...'' Arthur looked away, shaking his head when he whispered, almost to himself, ''I could have lost you, every damn day, I was just one step away from losing you. And I didn't even know...''</p>\n<p align=\"LEFT\">''I- I am sorry.''</p>\n<p align=\"LEFT\">Arthur eyes were fierce when he found Merlin's again. ''Oh, you will be sorry, Merlin, believe me, you will be.''</p>\n<p align=\"LEFT\">And then Arthur grabbed him, with both hands clawing into Merlin's hair, and dragged him forward, smashing his lips to Merlin's slack ones. It wasn't a great kiss. There was too much desperation and to much force, and too much teeth, because Arthur was biting at him as much as he was kissing him, but Merlin still fell into it. Head over heels. Just like he had fallen for Arthur, he now realised, a long time ago.</p>\n<p align=\"LEFT\">They kissed for a while and, when they finally stopped, they were still clutching at each other, like the other would vanish if one of them let go.</p>\n<p align=\"LEFT\">''So...'' Merlin said when his breath had settled a little. ''What was it that you wanted to tell me?''</p>\n<p align=\"LEFT\">Arthur drew back, his hands gripping Merlin's bony shoulders, and looked at him with all the disbelief one man alone could muster.</p>\n<p align=\"LEFT\">''<em>Mer</em>lin,'' he said, and the exasperation was fighting with the fondness in his voice. ''You really are a bit of an idiot, aren't you?''</p>\n<p align=\"LEFT\">And Merlin had to admit, he probably was.</p>\n<p align=\"LEFT\"> </p>\n<p align=\"LEFT\">FIN</p>\n<p align=\"LEFT\"> </p>\n<p align=\"LEFT\"> </p>\n<p align=\"LEFT\"> </p>"
}