{
  "id": "788543",
  "url": "https://archiveofourown.org/works/788543?view_full_work=true",
  "author": [
    "Chi-chi-chimaera (gestalt1)",
    "gestalt1"
  ],
  "title": "The Mongoose Hunts The Snake",
  "rating": "Mature",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Hannibal (TV)"
  ],
  "relationships": [
    "Will Graham & Hannibal Lecter",
    "Will Graham/Hannibal Lecter"
  ],
  "characters": [
    "Will Graham",
    "Hannibal Lecter"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Serial Killer!Will",
    "dark!Will"
  ],
  "language": "English",
  "series": "Part 1 of Hannibal Fic Collection",
  "published": "2013-05-07",
  "completed": "2013-05-09",
  "words": "8,095",
  "chapters": "2/2",
  "comments": "184",
  "kudos": "12,702",
  "bookmarks": "2,412",
  "hits": "170,008",
  "summary": "<p>Written for another kink meme prompt <a href=\"http://hannibalkink.dreamwidth.org/1375.html?thread=105567#cmt105567\" rel=\"nofollow\"> here </a>: You know William has those big green eyes and that floppy haircut and an obvious affection for dogs like a big old softie</p>\n<p>but I kind of want it to turn out that he’s playing Hannibal just as hard as Hannibal’s playing him. I’d like to see that as a fic, that turnaround where it’s Will doing the string pulling and Hannibal only realizes it at that very last second… and can’t help but respect how clever it is.</p>",
  "notes": "<p>I really need to stop jumping from prompt to prompt but I JUST CAN'T. Everything is Hannibal and nothing hurts.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>Sam007 has done a wonderful cover <a href=\"https://archiveofourown.org/works/3774163\" rel=\"nofollow\"> here </a></p>",
  "text": "<p>Will Graham is meticulous in the masks he wears. The presentation he puts on for the outside world. He knew from a very young age that he was neither normal nor ordinary; that he had the power to look into eyes and see souls staring back, that he knew what people felt sometimes better than they did themselves. He won’t deny that it was hard, in those early years. Overwhelming, even, until he learned to get a better handle on it. To a certain extent he can’t be sure how much of his personality really comes from him, and how much is a parasitic patchwork stolen from others, scraped together over two decades. He doesn’t really mind. Although you would never know it by looking at him, he has come to terms with what he is. </p>\n<p>The act, the fragile, damaged man that he pretends to be, allows him a surprising amount of leeway. People pity him, and pity means they don’t want to look too close. They avert their eyes as though his own instability will rub off on them, as though he could project unpleasant emotions rather than just pick them up. They treat him delicately, sometimes, give him space. Social exclusion isn’t questioned. If they don’t see or hear from him for days it’s just Will Graham being his autistic self, nothing to worry about too much. </p>\n<p>Autism is... inaccurate, for what he is. He doesn’t like people; has seen too many dirty little secrets for that. He’d rather be with his pets, his loyal hounds, than subject himself to petty small talk, little insignificant minds, banal socialising. He has better things to do. Other... hobbies. Fitting in would be a pretense too far. But it isn’t because he doesn’t <i>understand</i> people, or finds himself unable to relate to them, or awkward around them. He just finds them unpleasant, mostly. </p>\n<p>He’s not entirely sure why he let Jack Crawford convince him to come and work for him. Perhaps it’s just that it will give him an even better in at the FBI. Teaching for them is all very well, but he can always be closer to the investigative side of things, and to the Behavioural Analysis Unit most of all. Wouldn’t want them poking where they don’t belong, after all. He has to admit, there’s a certain lure in the chance to see crime scenes again. It was those first few murders that wormed their way into his brain and gave him the hunger, after all, and there’s a part of him that wants to taste some-one else’s psychology for a change. It’s been too long without new inspiration. </p>\n<p>And oh, it’s good, it’s so very good. He steps into that room and sees the carefully arranged corpse of Elise Nichols, lets the emotions of the killer sink under his skin filling up his empty spaces. Sorrow and longing and hunger and the lust for something precious... Foreign feelings always seem to be stronger than any of his own. Sometimes he thinks he doesn’t even have emotions at all when he’s not picking them up from someone else. He stands there and revels in everything he can pick up from the scene. </p>\n<p>He knows after that that he has made the right decision. Jack has promised him only the most difficult cases, the most obscure and eclectic, supposedly to spare him any unnecessary pain. Will could laugh. If Jack knew what he was inviting into his home... </p>\n<p>The dreams come that night, when he’s back home in Wolf Trap, such beautiful dreams. He wakes up shivering and sweating and hard, and he jerks off with his back arching against the bed and the taste of the girl’s blood in his mouth. Once upon a time he might have felt guilty about what he has become, but that was when he had still been trying to fight it, to put up barriers between himself and the killers he takes on. Easier to just let them all the way in, make them a part of himself. A psychic cannibalisation. </p>\n<p>Jack almost sours things the next morning when he pushes too hard for answers, but he entirely makes up for it when the day after that Will walks into his office and sees Hannibal Lecter for the first time. At first he does not think much of the man, bland in beige, seeming like just another consultant to delve futilely into a killer’s psychology. But then they start to talk, of the tastiness of thoughts and of what is seen in another’s eyes, and Will meets his gaze to prove a point and sees an empty well staring back at him. </p>\n<p>There is murder behind Dr Lecter’s eyes. He is dripping with it, blood lapping around his mind like an ocean. Will’s breath catches. He is thrilled, there’s no other word for it. He doesn’t even mind that Jack brought him here to psychoanalyse him, although of course he pretends otherwise, to not seem suspicious. He sees Hannibal and he grasps the outlines of him, but there’s such depth there that he cannot so easily delve it. He wants more. Lecter claimed his thoughts were not tasty, but Will thinks they will be very tasty indeed. </p>\n<p>If he needed proof, Hannibal is quick to give it to him. Crawford brings him to a new crime scene in the sun-warmed fields of Minnesota and Will is struck mute by the artistry of it. He calls it theatre, and that’s what it is, a show, a soliloquy. The light hits pale skin and slick blood and he can read intention in every angle. There’s no love in this, just pride, sadism, and it’s so perfect a negative of what it should be that it must have required exacting knowledge of all that has come before. It is a gift to him, and he knows just who sent it. </p>\n<p>A murder all for <i>him</i>. He’s not sure he’s ever been so flattered. Being able to step into Hannibal’s mind, even if it’s just the quickest dip under the surface, is just the icing on the cake. He lets Crawford and the forensic crew think his lack of words down to disgust, but it is quite the opposite. Even better, seeing it all laid out like this lets him burrow deeper into the other killer’s mind, the one they’ve taken to calling the Shrike. </p>\n<p>He preserves the memory of it all in a neat little box inside his head, like a treasured jewel. When he sleeps that night it comes out in his dreams as a stag with a crow’s feathers, watching him from the shadows. Will watches it right back. This is just the first steps in the dance. He knows it’s best to come at this slowly. He wants to see what Lecter is planning to do to him, what games he’s thought up in that unfathomable skull. He wonders if Hannibal will see him as he truly is, or whether he’ll have to show him. </p>\n<p>The next morning the man himself is at his motel, and he has brought breakfast. Will doesn’t miss how closely he watches when he lifts the first fork-full of sausage to his lips. Knowledge blossoms like a flower turning its head to the sun. He has never eaten a person before, but he sees no reason not to start. He lets the flavour explode over his taste-buds in the full awareness of what it is and imagines what it is Hannibal must be feeling right now. It’s delicious, in every sense. </p>\n<p>Will takes a certain joy in their conversation over the meal, and the subtleties half-hinted at from either side. Hannibal calls him a mongoose, and Will thinks it apt. He devours the thoughts of murderers, ignores the venom of these snakes. Their poison inside him is a slow creep. This man already has a sense of him, even if it doesn’t seem to go quite deep enough. There’s a part of him that wants to come right out with it now, but it’s too soon. He doesn’t know if Hannibal will see him as a threat. And Will <i>does</i> want to see what he wants to do with him. </p>\n<p>----</p>\n<p>Will doesn’t realise what Hannibal must have been doing back inside the office at the construction site until they reach the house and Garret Jacob Hobbs pushes his wife out of the door with her throat cut. For a moment everything is all <i>wrong;</i> he’s not in control of this, the victim’s emotions are getting all over him and into him and it<i> hurts</i>, but then the light is leaving her eyes and all there is is the blood, hot and sticky and sweet and all over his hands, and that is much more familiar. He can centre himself again. He goes for the gun at his waist that they gave him all so innocent and unsuspecting and he is the predator, the hunter. The door splinters under his heel and he stalks inside.</p>\n<p>In the kitchen is his prey, holding more prey like a barrier as though that will stop anything. He knows the girl though, the daughter, seen through borrowed eyes. Golden ticket. Beloved. That makes him hesitate, because she is suddenly as precious to him as she is to Hobbs himself. But his blood is up and he has no intention of negotiating. </p>\n<p>He shoots, to wound at first then again and again so that gore splatters out and paints the trace of exit patterns on the wall behind. He keeps his mouth pressed closed so as not to bare his teeth in delight. But... The daughter. His/Hobbs’ daughter. She’s bleeding. </p>\n<p>He doesn’t know how to stop it though. He’s used to taking life, not giving it back. He fumbles, until Hannibal steps past him and takes over with sure and steady fingers clamped tight over the spurting artery. Will looks up at him gratefully. It hits him then, that this was another gift. An opportunity. A kill in the open that he doesn’t have to justify. </p>\n<p>Interesting. </p>\n<p>----</p>\n<p>He has to pretend to be damaged for Jack and Alana, as though this latest murder is cutting him up inside. Clamps his mask down tight and almost exults when they send him along to see Dr Lecter. No doubt Hannibal foresaw this as part of his plan. Does he want to dig his way inside Will’s mind as Will does so easily to those around him? Will rather hopes he does. </p>\n<p>It’s interesting, this dancing about they both do. Each concealing the truth from the other. Playing at normality. With each session as the latest case goes on (Stammets, the Mushroom Gardener) Will begins to see more clearly the outline Hannibal would press upon him. Control. Connection. To a certain extend Hannibal wants to push him to see how far he will go before he snaps, what beautiful destruction his meltdown would be. But there’s another part of him that would wake the monster inside of Will, unknowing that it has been awake, and hungry, and ever-learning for years now. Hannibal is not lonely; nothing so simple and vulgar. He merely... likes the thought of company. Will can hardly blame him. The same thought is heavy in his mind. </p>\n<p>Of course, he may just be picking that up, another transference, but does it really matter so much if that’s the case? Will no longer believes in barriers. Transference is to be encouraged. Constantly changing kills and motivations makes him harder to catch. </p>\n<p>He’s aware he’s already picked things up from Hobbs, both predator and prey. Hannibal was right to assign responsibility for Abigail to the both of them. He can hardly help the paternal feelings he has towards her now, even if he hadn’t killed her father, which in a way is like asking to take his place. In Jack Crawford’s opinion darkness already exists inside her. Will knows he is right, but is less sure that it has ever come out to play. Still. Still. There’s a kinship there. A kinship that has drawn him to her bedside again and again.</p>\n<p>When it comes to the end, to Stammets beneath the barrel of his gun he is tempted, so very tempted, to kill him too. Just because he can, because maybe he can get away with it in broad daylight once again. But he discards the idea; it will look too suspicious. Still, he aches for it. For the sharp bark, for the jump in his hand, for the gasp of another’s pain. He’s been reliving his last kill over and over, imaging Hobbs jerking against impacts every time he’s in the firing range. There are too many murderers around him; his need is great. He will need to hunt again soon.</p>\n<p>He talks to Hannibal about it. Flirts with confession, pretends that admitting to enjoying his kill is frightening, like it is some great sin. Hannibal drinks it up, luxuriates in it. Will can see his hunger; he is torn between the wish to devour Will and to keep him. It would be too easy to get caught up in it, to offer him his throat, his wrists, his flanks. A bad idea. A <i>terrible</i> idea. He is not generally self-destructive.</p>\n<p>Hannibal tells him about God and power, and Will pretends he does not agree with every word.</p>\n<p>----</p>\n<p>Alana comes to his house. Uninvited. It is an unpleasant surprise, and he would be surprised at her rudeness except he is sure he has offered unspoken permission in the past. Or perhaps his mask of fragility allows her subconsciously to think it does not matter. That, like a child, he is unable to refuse. He doesn’t want her so close to where he has killed. Not that he has done so here often, but sometimes he likes to take his time, and it is very isolated out in the woods. </p>\n<p>Still, he cannot prevent her from coming in, and the news she brings is good. Even if she insists it would be better if she saw Abigail first. Perhaps it genuinely would. He isn’t capable of being objective. </p>\n<p>Later on, he is sure to time his lecture on Hannibal’s gift to him so that the good doctor himself walks in whilst Will is in the middle of complimenting him. Will does not bother to do more than gloss over his admiration for this ‘mysterious’ copy-cat. He speaks only truth, and the truth speaks for itself. Hannibal’s lips twitch into a subtle smile. Will feels like a fisherman, with a pike nibbling at the baited hook. </p>\n<p>There is little time for more teasing. The pair of them have finally been given permission to visit Abigail, and her father’s memories are pushing at him. It’s insistent, this love. He’s not sure how long it will last. Similar things have happened before, but it is easy for the emotions to be overwritten by the next thing to come along. Yet it seems that Hannibal feels <i>something</i>, unfamiliar and indescribable, for her too that may yet bolster his own affections until they are truly incorporated into his psyche. </p>\n<p>He tries to offer Abigail some measure of comfort, when they meet. As her father would have. Hannibal, he suspects, has different intentions, but those are long term. The both of them want her stable for just now. She is... precious, and Will would not see her fracture.</p>\n<p>There is the problem of Freddie Lounds. Does she see through his masks and disguises, or does she merely guess and hit too close to home? Will is not sure it even matters. His false face can only do so much, and it is too close to his real self to avoid rumours entirely. It might be possible to hide as well as Hannibal does, but he’s not sure he could bear it. That level of control would be too restrictive, like a straightjacket. </p>\n<p>So for now she is an irritating fly to be snapped at or ignored. A tick burrowing under skin. He tries to root her out and is stung for his troubles. He could kill her, but if he really meant to he ought not have threatened her so openly. He doesn’t mean to invite even more suspicion. If she went missing people would notice.</p>\n<p>----</p>\n<p>The visit to the Hobbs house is a shadow theatre of subtle digs and things not said. Abigail knows Hannibal called her father, Hannibal knows she knows, doesn’t know that Will knows. He enjoys spinning it out. “Did you recognise his voice?” he asks, knowing she could hardly fail to. Hannibal’s accent is... distinctive. And her eyes flick to him, right on cue. It’s <i>wonderful</i>. </p>\n<p>“He may have been contact by another killer,” he continues, “a copy-cat.” Although that’s far from what Hannibal is or was trying to do. Rather the opposite. He could laugh when later she throws it in Hannibal’s face, suggesting it via re-enactment. Two murderers and one who might yet be, playing their games. A pity it can’t last longer. </p>\n<p>----</p>\n<p>He dreams sweetly, that he is standing in Hobbs’ place, that his knife is to Abigail’s throat. He does what he does out of love for her. Her whimpers and the hot spray of blood just make things better. It’s still too mixed up in her father’s feelings to be sexual. He’s not sure what it might become in future. He’s willing to see how it all plays out.</p>\n<p>He should have seen Marissa’s death coming when she was rude to her mother. Should have seen Hannibal turn predatory. It’s another little piece of the puzzle; a man as cultured and put-together as he is cannot abide vulgarity. Eat the unworthy. Will feels saliva trickling into his mouth; reflected hunger. She hangs impaled on antlers, mostly naked not for any reason of sexuality but for the artistry of it, pale skin against pale horn, her dark hair falling in a curtain about her face, hiding her breasts. </p>\n<p>He calls Jack’s team because it is expected of him. A pity that they will disturb the installation. It belongs in a museum; modern art of the sensual serial killer, an ode to death. Hannibal joins him while they wait for Crawford and all the rest. Their conversation is quiet, hushed whispers in confidence, a pair conspiring together without awareness of the act. Will does not miss how Hannibal subtly nudges him towards contemplation of the young man who caused the disturbance earlier. A scapegoat. A convenient target to paint with the brush of copy-cat.</p>\n<p>If he was not a party to the truth it would have made him angry and confused that his assessment of a killer could be so wrong. That he could have misjudged one of his kin so badly. Will has no doubts that this was part of Hannibal’s plan. To have him doubting himself and off-balance, susceptible to being pushed one way or another. Uncertain in himself, it would have been far easier to mould him as Hannibal might desire. He cannot fault the aim, but that does not mean the execution does not have its sting. </p>\n<p>Will doesn’t like it when someone tries to trick him. </p>\n<p>So he lets Jack’s words of recrimination wash over him and tries not to let them hurt. It is in Jack’s nature to push, to work his people hard, to be unrelenting. He lets evil get to him, work its way under his skin, and the only way to exorcise it is to catch those responsible, by any means necessary. It makes his colleagues respect him, but it has never made him friends. Will knew this even before he became personally acquainted with the man. He can’t judge.</p>\n<p>Hannibal leaves to take care of Abigail. </p>\n<p>Will only hears later what happens; about Nicholas Boyle attacking Alana and Abigail. He knows the truth hides somewhere else, but without seeing the scene itself he can’t find it, can’t dig it out. They won’t let him inside the house, there is nothing to go on, and it makes his skin prickle in thwarted curiosity. He wants to ask Hannibal, but he’s not quite ready to give the game away yet. It’s coming, but these are still the opening moves. The dénouement is for the future. </p>\n<p>----</p>\n<p>He finds himself inside Hannibal’s office once again, sitting in a too-comfortable chair and allowing himself to be psychoanalysed. Or allowing Hannibal to try and analyse him. When the truth does not pass his lips unaltered, even the good doctor must find it hard to truly know him. It’s a pleasing thought. It is Will’s role to see the minds of others without effort. It is not right that it be turned upon him. </p>\n<p>As much as he can be without also being obvious, he is honest. He describes looking at his house and seeing a ship at sea during the night, the wind rustling the branches of trees like waves. He does not mention how peaceful it is when he stands in the dark and relives the things he has done beneath that comforting blanket. When the memory of blood turns his hands black in the moonlight. Those select occasions that he has taken his prey out there, desecrated them, fallen on them with animal fury or cold intensity or calm precision. </p>\n<p>It’s easy, to speak of his gift. To describe the intensity of feeling, of becoming, to embody someone so perfectly that they become a part of you for ever and ever. His memory is excellent; he never forgets kills real or seen through shadows. Connection with killers is facile, simple. They begin to link even across space and time, actions mirroring actions in impossible, fractured patterns. That is what it feels like. Will is less sure how accurate it really is. He’s willing to admit he may be delusional about part of that, but what’s a little delusion amongst friends?</p>\n<p>“I’m not Garret Jacob Hobbs, Dr Lecter,” he says, and it is only half a lie. He is a hundred killers, and somewhere, he is himself. </p>\n<p>----</p>\n<p>For all the lives that have crept inside his head, family is still an unfamiliar concept to Will Graham. It itches under the skin, too tight, an idea that never quite fits. He had a father growing up, but they were never close. He was more familiar with strangers, with dark secrets and dark psyches. Family means... what? Moving around all the time, being an outcast, being alone. Back when he still bothered to put up walls and build forts. Childish, thinking a few mental sheets and pillows and blankets would keep the monsters at bay. </p>\n<p>You might think this case would attach some meaning to the term. It doesn’t. He feels the abandonment, the never fitting in, the longing for connection, but it doesn’t sink more than skin deep. He has connections of his own. He has Hannibal, he has Abigail. He is hesitant to apply the word family to the tentative web that brings them slowly together, fragile adhesive that it is. It is a maybe thing. It doesn’t really exist yet, although he thinks it will eventually. Certainly Hannibal is working to force it into reality. </p>\n<p>Will did not miss the fact that the fishing lure he so carefully left out was completed on his return. A faint stain of dark blood is just visible on the barb, and he can’t help running his fingers along the cold metal over and over again. A little talisman. A piece of Hannibal Lecter to carry with him wherever he goes. Of course the man would not have been able to resist toying with it, leaving an imprint on Will’s life, in his home. He had been counting on it. It’s another thing bringing them together. </p>\n<p>Nor does Dr Lecter bring up the topic of family idly in their next session. It’s as calculated as everything else he does, dropping hints of personal truths to force Will to repay them in kind, to persuade him to open up. Will is aware he’s being played, but he allows it to happen. It does not bother him when it is Hannibal. </p>\n<p>“I think we’ll discover that you and I have a great deal in common with Abigail,” Hannibal says. He pushes the concept on, even when Will deflects it with deliberate misunderstanding. Family. Family. What a pair of fathers they would make. He can’t deny that it’s alluring. He likes Abigail, wants to protect her, nurture her. He is responsible for her. He’s just not sure he knows enough about family to be worthy. </p>\n<p>It doesn’t stop him buying her a gift, then thinking better of it. He doesn’t want to push. Leave that to Hannibal, who can do it just up to the limit where the stress makes little cracks in the facade but not enough to break. The cracks will heal, the stronger for the experience. In his frustration he leaves the house late at night, ventures into town on the hunt. Hobbs is a bright spark in his mind, his longing is Will’s longing. He puts up a rare disguise, the one where he seems entirely normal. Goes to a bar, flirts and laughs and looks girls in the eyes. Finds the one he needs. </p>\n<p>It’s a merciful kill because Garret Jacob Hobbs was nothing if not merciful. It isn’t until he has the body back in the basement under the house that the realisation dawns that he cannot honour her as he wants to. He might have Hobbs’ emotions but he has none of his experience, his skill. He cannot tan hide, craft from bone. The anger shudders and he slips from this mind into another. Weaves selves from past selves, seasoned with a slight dash of Hannibal, what little he has gleaned from him. </p>\n<p>He feasts like an animal, like a wild beast. He tears flesh raw, revels in it, gluts himself on still-warm meat. It is not pretty, it is not refined as his friend would like – for they <i>are</i> friends, strange as that would seem – but if he cannot have Abigail he will settle for owning this woman, for taking her strength as his own. </p>\n<p>After he is full he recovers enough from his frenzy to butcher the carcass properly, carve up cuts for later. Then he lets his dogs down to lick the blood and gore from his skin, feeds them titbits and scraps. He is sated, satisfied. The monsters in his head are quiet. </p>\n<p>----</p>\n<p>The sleepwalking is a new development. Maybe welcoming so many new residents to the inside of his head so quickly wasn’t that wise. He hasn’t given them time to settle in yet. Their wants and needs and psychopathologies are so different that they war amongst themselves, dragging him this way and that in indecision. And yet it all comes down to connection in the end. Hobbs fearing the connection to his daughter would be sundered, Stammets reaching out for a connection of self made physical, lost boys trying to connect into a new family. He’s not sure why this would force him out of bed though. </p>\n<p>Habit and desire draw him to Hannibal’s door, despite the early hour. He is not disappointed. Dr Lecter’s plans for him are as fresh as ever, each day a new thrust towards dependence and a fall. Watching him make coffee in dressing gown and night-wear as formal as all his other clothes, hair soft and messed before product slicks it back into control and conformity, Will has cause to wonder how sexual this seduction might be. If the feelings creeping up on him are all his own or if some are a reflection, something he is picking up. Either option would be fine with him. Generally his sexuality is filtered through a mesh of rapists and paraphiliacs. It would be nice to have something a little more normal. </p>\n<p>This latest manifestation of Hannibal’s plan is to drive a wedge into the working relationship between Will and Jack. Playing on the fact that for Jack Crawford, the ends always justify the means, that doing what Jack asks of him is doing nothing for Will’s mental health. It’s a strong move, if only because it draws so much from the truth, or what would be the truth if Will were as he once was. If he was still an upright and moral man. </p>\n<p>“Are you experiencing difficulty with aggressive feelings?” Hannibal asks, and Will has to look away before he laughs. </p>\n<p><i>If only you knew,</i> he wants to say. Deflects instead. </p>\n<p>Their case of the week is yet another with a flair for the dramatic. Angels of flesh and blood and bone, their wings reaching up to the sky. Will loves it, exults in it. Yet the man himself he cannot find. Can’t quite grasp. He understands when they have their diagnosis, gleaned from the traces of medication in his stomach. He cannot absorb truly abnormal thoughts, motivations that have no twins in human minds. Budish is all his own, utterly unique. </p>\n<p>It strikes him, when Jack mentions the Chesapeake Ripper, that he has not given much thought to exactly who Hannibal has killed other than the Shrike fakes, only knowing that he has, that he has eaten from them. The reference has him bringing up the memories of old case files, and with it another piece of the puzzle slots into place. There has been no word of the Ripper in two years, so he does not feel <i>too</i> foolish for missing it. Hannibal has been careful. There must have been many they have not found, or who have masqueraded as the kills of someone else.</p>\n<p>Clever, skilful man. Clever cannibal. </p>\n<p>In some ways this latest case gives him breathing space. He can admire the art for what it is, without the pressure of its maker in his head. He feels no desire to make angels of his own. He has his dogs to guard his sleep; needs no artificial watchers. That does not stop him from playing up the myth of his own instability however. He knows word of it will get back to Hannibal, let him think his machinations are having the desired effect. What will be his next step, Will wonders?</p>\n<p>It is to lure him with promises of peace. Parallels drawn between killer and one he does not yet know is also a killer. Will sees where this is going. Finding peace in murder. In letting go. In tearing down barriers that – in Hannibal’s mind – are what causes him grief and guilt. It’s true – Will ceased to be painfully haunted when he gave in. Now his ghosts are a comfort. </p>\n<p>Hannibal is no respecter of personal space when it comes to him. Ignores barriers put up by the masks Will wears. He stands what ought to be too close. He’s trying to put his stamp on Will, his mark of ownership. Will doesn’t mind. He’d do the same if he were in Hannibal’s position. He minds it even less when Hannibal leans in to scent him. Will wonders how he would taste, if he smells as much like food as he does like a companion. Of course Hannibal brushes it off with a comment about his aftershave. Will wishes he could tell him he needn’t. He would bear his throat to this man, not even sure whether the inevitable bite would sink deep enough to kill. </p>\n<p>----</p>\n<p>The fact of his sleepwalking is troubling enough that some part of Will wants to use the excuses Hannibal has given him to take a break and get his head on straight, to batten down and weather assimilation, to give his subconscious time to incorporate new minds and new motivations. Despite that, when the time comes and Budish’s corpse is hanging like a Christmas decoration from the rafters above him, he finds that his compulsion to feel more and more is too strong. He mouths words and arguments to Jack like platitudes, but when the ultimatum comes he does not take the out. </p>\n<p>It probably isn’t wise. The road he’s walking, whilst not the kind of treacherous path that Hannibal has been trying to push him down, still has its dangers. Most killers are not as careful or meticulous as Will or Dr Lecter. They are too eager, or too stupid, or simply make mistakes. If he allows some part of one of them to take too much control of him he might slip up without even realising it, and then the murderer they are all hunting would become him. </p>\n<p>Still, he has a new hunger for it, more so than ever before. The types of cases Jack’s team handle have an addictive quality Will never encountered in his days working homicide or sweeping the internet and the papers for inadequate details of other murders around America. The emotions he picks up from each crime scene are fresh and new and <i>exciting</i>, and he wants more, always more. He wants the vicarious thrills of a hundred kills without the risk of carrying them out for real. </p>\n<p>He’s aware this could become a problem. Addictions are always problematic, because they remove reason, poison logic. But this one has already sunk its teeth into him too deep, and he hasn’t the willpower to tear free. Perhaps when he finally tells Hannibal what he is, he can count on the support system he provides to rein him in when he needs it. That would be enough reason to reveal his nature, even without Will’s desire for companionship, for acknowledged kinship, for tentative family. He will hold out a little longer. Just a little longer. </p>\n<p>----</p>\n<p>Will knows the time has come when Jack escorts him up the stairs towards the entrance to Baltimore State Hospital for the Criminally Insane. Jack has explained to him on the way their reason for being called in; the murder of a member of staff – one of the nurses – in a way that is a perfect echo of the last confirmed Chesapeake Ripper kill. Even before meeting Dr Gideon, Will feels almost personally affronted by the mere suggestion. He knows who the Ripper is, knows something of Hannibal’s character, and is well aware that the only reason the FBI knows about any of his kills is because he meant them to know. To have the credit for his artistry stolen, to have his work plagiarised... to say he wouldn’t be pleased is the least of it. </p>\n<p>So it is that anger is seething quietly under Will’s skin to join the nervous apprehension that always comes around places like this. Prisons, psychiatric facilities. Asylums. If by some cruel turn of fate the world at large ever found out the monster hiding under his skin, it would be here they’d send him. He would truly loose his mind if they locked him up. Unable to hunt, unable to live through the hunts of others... his neuroses and psychoses would eat him up like a cancer, too many strains of sociopath competing and yearning inside his skull. </p>\n<p>Walking through the doors sends a shiver up his spine. His survival instinct is screaming for him to get out. Not even the promise of death, touching one of Hannibal’s kills through the mirror of this imposter, is enough to quiet the impulse to turn around and flee. He fights it down though. To show guilt is to admit he has something to hide. No reason to make anyone here look any closer than they already are. </p>\n<p>In the world of animal metaphors, Dr Frederick Chilton is a worm trying to pretend it can understand a snake. There’s something slimy and unpleasant about him that makes Will want to wipe his hands clean on his pants after touching him. A fakeness, a carefully constructed paper mask, trying to make himself seem smarter and more cultured than he really is. Will cannot help thinking that Hannibal would chew him up and devour him utterly. He’s certainly rude enough. He doesn’t even try to hide the fact that he thinks of Will as something that belongs under a microscope. </p>\n<p>He’s not even wrong. Will is sure his particular amalgamation of homicidal desires would be catnip to any criminal psychologist; he’s merely insulted that someone like this thinks he could get anything out of him that he wasn’t willing to give. Will knows all the tricks. He can present a thousand faces, facets of a jewel that never show it in its entirety. Chilton is... small fry. </p>\n<p>The man lets him see the scene in the end, despite what he might prefer. It’s a striking sight; another piece of art, a thing of beauty. Which doesn’t change the fact that it’s merely a copy, no understanding of the deeper meaning. There’s something vulgar about dull draughtsmanship that makes borrowed irritation prickle under his skin. Hannibal’s irritation. It doesn’t stop Will from stepping into Dr Gideon’s mind, reconstructing step by step and letting his blood warm and thrill as he methodically crushes the woman’s trachea, gouges her eyes from their sockets, pierces her through the heart to watch her shiver and die like a speared fish. </p>\n<p>This plagiarist didn’t have the stomach for Hannibal’s punishments. He killed her too quickly. Will finds himself disappointed. He can appreciate Gideon’s pleasure at post-mortem mutilation, but he knows it’s a pale imitation of what it could have been. It was good, reliving that, but it has the bitter aftertaste of thwarted expectations.</p>\n<p>The trouble is that the timelines fit too well. Gideon isn’t the Ripper, but it would be easy for anyone to come to the conclusion that he could be, based on the evidence. He shouldn’t have known the details of the last murder, not the finer points of technique which had never been released to the press. Somebody must have told him. Someone with a vested interest in having the Ripper behind bars, most likely. </p>\n<p>Will can tell them as much as he likes that this is a fake, but without hard proof his word isn’t worth all that much. And he can’t see Hannibal’s work devalued like this. Attributed to some wannabe who puts on the airs of a Hollywood serial killer, chewing the scenery like a bad actor. Interviewing the man doesn’t make him think any better of him. He knows, when he leaves the Hospital for the second time, that he can’t let this stand. He has to act. </p>\n<p>What better way to reveal his true face to Hannibal than through a gift. After all, it’s just returning the favour.</p>\n<p>----</p>\n<p>The Chesapeake Ripper kills in threes. He kills the rude and unmannered. He kills pigs. He’s doing the world a service, really. Will is not entirely sure how to pick out a trio of the crass to slay in Hannibal’s name, since he doesn’t typically get out enough to meet enough people to be insulted by. Freddie Lounds would be a good choice, but she’s still too close to them. Also, he suspects that if Hannibal wanted her dead, she would <i>be</i> dead by now. </p>\n<p>So, a challenge. He takes to wandering the streets of Baltimore or sitting in cafes people-watching. The difficulty of it only makes him respect Hannibal more. Eventually he is forced to simply follow someone in order to drug them and dump them in the boot of his car. It means he has no-one else lined up to follow at the appropriate intervals, but it’s hard to find out where strangers live without attracting attention. </p>\n<p>A pleasant aspect of his gift; he has never suffered from a lack of imagination. The businessman who was so rude and aggressive to the Starbucks barista has boiling coffee poured down his throat until he can swallow no more and drowns screaming and bubbling milky froth. Will is as careful as he can be splitting the chest with scalpel and rotary saw, but he doesn’t have the experience Hannibal has. Since he’ll likely be called to see wherever he dumps this body, he supposes he can just palm it off as the Ripper’s anger at his copy-cat. As the sternum parts, the ribs spring back like opening a shell, splattering him with specks of blood. Will licks it from his lips. </p>\n<p>The lungs are marinating in coffee and hot to the touch. Foam sprays from the bronchi as he cuts them, mixing with blood from the vessels, pretty and pink. It seems appropriate that this will be his first gift to Hannibal, in honour of the first meal the man cooked for him. Carefully he lifts both lungs out once they are finally loose and settles them, wrapped in plastic and packed in ice, in a cooler for later. Now he has a body to dispose of. </p>\n<p>----</p>\n<p>He waits until they find the corpse he has so carefully created before he visits Hannibal. He wants Hannibal to wonder who else has decided to mimic his work before pulling back the curtain, for his curiosity to be inflamed and for him to formulate whatever theories come to his mind. He wants to see the look on his face as he lifts the lid from the cooler once Will has handed it over. </p>\n<p>“Did you miss dinner?” Hannibal asks, when he opens the door to his office and sees Will standing there with the cooler in hand. </p>\n<p>“Just a little something for later,” Will replies, allowing himself a wry grin. Inside, the room is as comforting as ever. He likes the space, the eclectic, varied ornamentation, the library on the mezzanine, the curtains striped like barber’s poles. “Jack’s filled you in on the latest case? The new Ripper murder?”</p>\n<p>“Yes,” Hannibal replies. “I suppose we have our proof that Dr Gideon is, as you posited, merely a copy-cat?” His voice lifts at the end of the sentence, half a question. </p>\n<p>“It looks that way. I’m not sure if Jack is pleased or not. It would have made him look foolish if it had turned out the Ripper had been behind bars all this time, but he doesn’t want anyone else to die just to prove him right.”</p>\n<p>Hannibal moves to lean against his desk. Will follows his usual pattern, pacing at the edges of the beautiful Persian carpet. “And you are sure that this <i>is</i> the work of the Ripper?” he says. “Not just another plagiarist drummed up by tattlecrime.com and Ms. Lounds’ publicity.”</p>\n<p>“It matches everything we know about how the Ripper operates. The humiliation of the victims, his brutally artistic staging of their bodies, the surgical trophies...” How long does he want to draw this out? Will has to admit, he does enjoy watching Hannibal squirm like this. He can see the frustration burning in the back of his eyes. </p>\n<p>“Of course if it <i>is</i> the Ripper there’ll be more to come,” he continues. “Jack’s eager to catch him, says there’s only a narrow window of opportunity. He needs me at my best.”</p>\n<p>“So you come to me,” Hannibal says, smiling faintly. “I’ll do my best Will, but I can’t work miracles. Jack has put you under a lot of stress recently and I worry about the effect it is having on your mental health.”</p>\n<p>Will sighs, makes a show of rubbing his face, affecting weariness. “I know the Ripper’s close,” he says. “Sometimes it feels like I could just reach out and touch him.” Hannibal is watching him with the same intense gaze he always has. Will admires his poise. He gives very little away. If Will were less practised at getting inside killers’ heads, he would never have seen him for what he truly is. </p>\n<p>“Do you feel some sort of kinship with this killer, as you felt with Garret Jacob Hobbs?” Hannibal asks.</p>\n<p>“Yes. I can see what he’s trying to do.” He says it as though it’s being dragged out of him. This is <i>fun</i>. “He doesn’t think these people are worthy of life, of existence. They’re just animals to him. Meat.”</p>\n<p>Hannibal cocks his head. Will doesn’t think he’s imagining the flash of something... not nervous but... predatory. Dangerous. That’s fine. Will is dangerous too, and Hannibal has nothing to fear from him. </p>\n<p>“I think... I’m not so sure the organs he takes are just trophies.”</p>\n<p>“Why not? Many serial killers are compelled to keep some part of their victims. It’s a natural human impulse to collect mementos or keepsakes, aiding our memories of better times.”</p>\n<p>Will shakes his head. “He doesn’t need to remember them. They’re not really individuals to him, they’re a disease, or a symptom of a disease. No, he’s taking their organs because they deserve to be... eaten.”</p>\n<p>Hannibal is very still. A coiled viper. But Will is immune to his venom. “An... interesting theory. Have you shared this with Jack yet.” He moves suddenly, circling his desk, pretending it is nothing but casual motion. </p>\n<p>“I thought I should talk to you about it first,” Will says. He is letting his masks fall. He is no longer so tense, so twitchy. “After all, all those dinners you throw... you’re something of an expert on food, aren’t you?”</p>\n<p>“Will.” It’s disappointed. Almost chiding. Will is pleased to find out that even before knowing the truth, Hannibal does not want to kill him. </p>\n<p>“Speaking of food, I brought you something. A little thanks for all those times you fed me. It’s in the cooler.”</p>\n<p>Hannibal is too controlled an individual to really show confusion. Still, there’s wariness to his steps as he fetches the box from over by the door. His eyes never leave Will. Perhaps he thinks this is just a ploy to distract him, so that Will can make a break for it – theory confirmed – and phone the FBI. </p>\n<p>“I do hope you like it,” Will says. “I picked it out with you in mind.”</p>\n<p>Hannibal sets the cooler down on his desk, works the lid free with exquisite care. Will watches his face avidly. Doesn’t miss the way his eyes widen with sudden realisation, then crinkle up at the corners in pleasure. The slow smile that starts to stretch across his features. </p>\n<p>“Oh Will,” he says, as though this is the best present he has ever received. “Will.” He looks up. Empathy connects and Will feels reflected a pure wave of affection. </p>\n<p>“I suppose I should apologise for lying to you for so long,” he says, grinning. There’s an electric charge in the air, a giddy excitement. Everything is coming to a head and it is <i>glorious</i>. </p>\n<p>“I confess that I find myself astounded to have missed this,” Hannibal says. His hand dips to lift one lung out of the cooler, pinked coffee froth pooling in the corners of the bag. “How long have you known who I am?” </p>\n<p>“I knew from our first meeting,” Will confesses, “I would have said something, but I wanted to see what you would do with me.” </p>\n<p>“I do hope I didn’t disappoint.” </p>\n<p>“Not in the slightest.”</p>\n<p>“Come back to my house,” Hannibal offers, with the speed of a decision suddenly made. “I’ll make something special with these. A celebration would appear to be in order.”</p>\n<p>“Well, I feel I should apologise for cutting off your plans before they really got started,” Will says, “so if you’ll take this as making up for that, then of course I’ll come. It’s the first time you’ve invited me, isn’t it. Aside from when I just turn up at five in the morning, of course.”</p>\n<p>“A chef’s kitchen is a mirror of his soul,” Hannibal tells him. “I was wary of what you might see in mine.”</p>\n<p>“Nothing that would put me off, I promise,” Will replies. “You wanted me a killer, well, here I am. No more lies, no more masks.”</p>\n<p>“You really are extraordinary,” Hannibal says softly. </p>\n<p>“So are you,” Will confesses. “That’s why I couldn’t let Gideon take the credit. He wasn’t worthy of what you do.”</p>\n<p>Hannibal looks more than a little in love. Will can’t wait to get him back to his house, to see him in his element, for them to know each other as they truly are without pretence. If after they eat, things take a turn for the sexual, then it will hardly be a surprise. Some part of him has been waiting for it since they met. He realises that his teeth are bared in unrelenting joy.</p>\n<p>“So. About that dinner.”</p>"
}