{
  "id": "813300",
  "url": "https://archiveofourown.org/works/813300?view_full_work=true",
  "author": [
    "dea_liberty"
  ],
  "title": "Foolishly, Completely Falling",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "One Direction (Band)"
  ],
  "relationships": [
    "Harry Styles/Louis Tomlinson"
  ],
  "characters": [
    "Harry Styles",
    "Louis Tomlinson"
  ],
  "additional_tags": [
    "Friends to Lovers",
    "First Time"
  ],
  "language": "English",
  "series": "",
  "published": "2013-05-22",
  "completed": null,
  "words": "8,042",
  "chapters": "1/1",
  "comments": "186",
  "kudos": "6,188",
  "bookmarks": "1,314",
  "hits": "130,364",
  "summary": "<p>\"Now that he’s actually gone and done it, there seems to be no way of going back - no rinse and repeat, no ctrl+alt+del, no abort button, no help to be had. He’s fallen into a black hole and he cannot seem to find a way out. The black hole is also known as Tumblr. More specifically, it’s known as Tumblr’s Larry Stylinson tag.\"</p>\n<p>OR: The one where Louis becomes a Larry shipper by accident.</p>",
  "notes": "<p>All standard disclaimers of \"this is entirely fictional, not even close to being in any way based on real events, I don't know anyone in this fic\" etc. apply here! This entire thing is a figment of my overactive imagination.</p>\n<p>A huge, huge thank you to Kwen for the beta, and to Vae for the cheerleading! I love you guys.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I'm <a href=\"https://dea.tumblr.com/\" rel=\"nofollow\">dea</a> on Tumblr if you'd like to drop by and say hi!</p>",
  "text": "<p>Curiosity killed the cat. Louis is beginning to suspect it’s going to kill him too. At the very least, he’s pretty sure it’s going to kill his social life and his friendship with his best mate, but now that he’s actually gone and done it, there seems to be no way of going back - no rinse and repeat, no ctrl+alt+del, no abort button, no help to be had. He’s fallen into a black hole and he cannot seem to find a way out.</p>\n<p>The black hole is also known as Tumblr. <i>More specifically</i>, it’s known as Tumblr’s <i>Larry Stylinson</i> (and related) tag(s).</p>\n<p>He’d been <i>curious</i>, that was all. He’d just wanted to know what they were talking about and <i>why</i> they were saying the things they were saying. He and Harry got along well, yeah; that was kind of a given seeing as they’d clicked on X-Factor and had pretty much decided they didn’t want to spend another moment apart. They were <i>best mates</i> - each other’s partners in crime, the troublemakers and pranksters extraordinaire. Together, they were absolutely unstoppable and that was absolutely <i>awesome</i>, but thinking they were genuinely in a relationship that went beyond that? Seemed kind of crazy, really. There were so many people who <i>believed</i> it though, and Louis had just wanted to understand so he’d looked it up.</p>\n<p>Big. Mistake.</p>\n<p>Possibly the biggest mistake of his life.</p>\n<p>The first three posts had been funny. The first video had been brilliantly executed and he’d been <i>impressed</i> with the storytelling skills required to create such a believable argument. But it’s four hours later, and he’s still clicking on posts, jumping from one Youtube video to another, reading and watching and, scariest of all, finding himself <i>agreeing with</i> analysis after analysis. It’s actually <i>terrifying</i>.</p>\n<p>He’s about to hit “next page” and he <i>stops himself</i>. He reminds himself that he <i>is</i> Louis Tomlinson, and that “Larry” is <i>not real</i>. He’s not secretly dating Harry. They are not hiding their illicit love. They do not secretly fuck each other behind closed doors. He hits “next page”.</p>\n<p>\n<b>\n<i>I don’t believe in Larry, I believe in true love, lolz.</i>\n</b>\n</p>\n<p>Louis nods and scrolls (<b><i>OMG LARRY FEELS</i></b>) down (<b><i>Is it just me or does Harry look like he’s imaging taking Lou’s clothes off?</i></b>) a little (<b><i>OMG DID THEY KISS?</i></b>) further (<b><i>OH THEY ARE SO IN LOVE I’M GONNA LIGHT MYSELF ON FIRE</i></b>). </p>\n<p>The next one catches his full attention. He stops scrolling.</p>\n<p><b><i>If for some reason these idiots aren’t already in a relationship, they should be.</i></b> And there’s gif of Harry reaching out to brush his finger against Louis’ skin, and Louis shifting his arm back to get a little more contact and –</p>\n<p>Louis kind of wants to set himself on fire too.</p>\n<p>He stares at it as if he doesn’t recognise it. Because he <i>doesn’t</i> recognise it. He hadn’t even noticed he’d <i>done that</i>. It’s like watching a movie of an actor that looks scarily like you but isn’t you because <i>Louis doesn’t remember doing that</i>. It hadn’t even been a conscious action. He remembers the interview, yeah - remembers everything else except that point of contact.</p>\n<p>The post under it has him looking at Harry like he’s the fucking sun.</p>\n<p>It’s a fucking adorable picture. Louis’ never really paid attention at the way he looks at Harry - mostly because Harry’s just...special. He’s someone who is infinitely special to Louis and his <i>best friend</i>, and Louis loves him (completely platonically). But he really likes the idea of people believing in love, and Harry is really fucking adorable. Imaginary!Louis could definitely do worse.</p>\n<p>Louis hits reblog without even thinking about it. <b><i>Loving you is like looking into the sun</i></b>, he adds, and before he can really think about what he’s actually doing, he posts it.</p>\n<p>--</p>\n<p>It all goes downhill from there.</p>\n<p>He makes his own edit three days later.</p>\n<p>Two days after that, he becomes Tumblr famous.</p>\n<p>He’s collecting together some pictures together for an AU picture set when he starts getting frustrated. He just can’t find the <i>right</i> picture to complete it and, the thing is, he knows one exists. He huffs out a breath and grabs his phone, sending the picture to his email - and crops it enough that it could possibly be anyone. Maybe.</p>\n<p>Probably.</p>\n<p>Whatever. It’s late and he wants to post this so he can finally go to bed already and he’s not thinking of much else beyond that.</p>\n<p>He wakes up to somewhere close to 5000 notes on his post and close to 300 asks. Only then does he realise the enormity of what he’d done. </p>\n<p><b><i>JKAFNHKSFJSKFJSL WHAT</i></b>, says one ask eloquently.</p>\n<p>\n<b>\n<i>THAT PICTURE...OH MY GOD KILL ME NOW.</i>\n</b>\n</p>\n<p>\n<b>\n<i>Is that new?</i>\n</b>\n</p>\n<p>\n<b>\n<i>WHERE DID YOU GET THAT LAST PICTURE?</i>\n</b>\n</p>\n<p>\n<b>\n<i>SOURCE PLS OMG IT’S SO FUCKING SDKLAFJLSJFLSKJDF</i>\n</b>\n</p>\n<p>\n<b>\n<i>That is - oHMY ICAN’T EVEN TYPE, THAT PICTURE OMG!!!!!!!! CRYING</i>\n</b>\n</p>\n<p><b><i>That’s totally fake. That isn’t even Harry’s arm, dumbass.</i> </b> That one actually makes him laugh - and it’s a fucking great feeling, especially with the horror that’s been slowly descending on him as realisation sinks in.</p>\n<p>He keeps laughing when he opens another one to find, <b><i>Tell me the truth. You’re really Harry, aren’t you? OH MY GOD, LARRY IS REAL!!!!!!!!</i>.</b></p>\n<p>It goes on, but Louis doesn’t bother reading any more of them. He posts a quick<b> <i>Oops. Didn’t mean to make Tumblr meltdown. I found the picture on the internet !</i></b></p>\n<p>He tries not to be too happy with himself for the fact that he has several thousand more followers than he did yesterday or the fact that the Larry tag is more active than usual. And it’s <i>happy</i> active rather than full of the angst that’s been all over the place lately. He’s made someone happy today, at least. That counts for something, right?</p>\n<p>His email inbox is practically exploding by the time he’s finished breakfast, and he has to turn off the email notifications before he can even think about leaving the house. He dreads to even think about the state of his Tumblr ask box. The few messages he does take time to read in the car on the way to their interview has him grinning like a loon by the time he steps into the studio. </p>\n<p>It seems Tumblr is torn between thinking he’s an inside man and thinking he’s a fake. There also seems to be a very small percentage who seem to have spent the entirety of last night trying to figure out what he googled to find the picture. There are even a couple who are convinced he’s Harry. Those are his favourites, and he follows them back immediately. Which just sets them off all over again. It’s <i>brilliant</i>.</p>\n<p>He throws an arm around Harry’s waist as soon as he sees him, and Harry tucks himself into Louis’ side easily, his arm going to its customary place around Louis’ shoulder. </p>\n<p>Louis has a momentary flashback to a post he’d seen recently on Tumblr and his step falters. Harry stumbles a little with him - and then falls back into step beside him.</p>\n<p>“Everything okay?” Harry asks, looking a little concerned. Louis grins at him and shrugs, reaching over to tug at one of Harry’s curls. It appears to be staging a rebellion, trying its hardest to resist the oppression of the hairspray and gel that’s been applied to make Harry’s hair look artfully quiffed. </p>\n<p>“Everything’s good.” He digs a finger into Harry’s side and Harry squirms closer to him, laughing. Within moments, Harry’s relaxed again, at home against Louis’ side, and Louis finds himself smiling a little wider. <i>Tumblr’d have a field day,</i> he thinks, and tilts his head a little to watch Harry fondly.</p>\n<p>He can definitely see where they’re all coming from.</p>\n<p>There are a lot of “Larry” moments during the interview. If Louis is completely honest with himself (which he tries to be but knows he isn’t always), he instigated more than a few of them himself. On purpose. Harry looks at him a little strangely afterwards - curious, not angry or anything else - and with something Louis can’t quite identify in his eyes, and their publicist and PR team <i>glare</i>.</p>\n<p>“I thought we were going to tone it down?” one of them says, and Louis looks back as innocently as he can manage.</p>\n<p>“Tone what down?” he asks and ignores the dirty looks they send his way.</p>\n<p>Tumblr has a field day. Louis goes to bed with a huge grin on his face (and still ignoring most of his ask box).</p>\n<p>--</p>\n<p>Louis continues to hang around Tumblr, reblogging things and making his own gif and picture sets, adding witty captions whenever he can think of them. Sometimes, he’s more amused by them than anyone else, he thinks, because a few of them are even inside jokes that barely anyone understands. He’s ended up with a rather large following for some unknown reason, and people are still arguing over who he actually is and what he actually knows. He ignores most of it. Being Tumblr-famous is possibly even weirder than being actually famous.</p>\n<p>He makes a few friends. There’s one blogger in particular that he spends hours talking to whose sense of humour is fucking <i>brilliant</i>. He calls himself “Dusty,” and he keeps Louis entertained like no one else, shares his opinions on so many things - and not just the entire conspiracy that is Larry Stylinson. For a laugh, he decides if this person’s going to go around using Harry’s cat’s name as their pseudonym, Louis’ going to use “Ted.” More likely than not, everyone’ll just think they’re taking the piss - another one of those “let’s call ourselves by something related to our ship” sort of things.</p>\n<p>(Why is he even considering himself a shipper? How has this become his life?)</p>\n<p><b><i>New Larry interview!</i></b> comes through in his ask box after their most recent interview makes it online. <b><i>Is it just me or are they getting more obvious</i></b></p>\n<p><b><i>HAHAHA,</i></b> Louis sends back. <b><i>They’re so good to us shippers. I’m starting to think they’re playing it up just to keep us entertained.</i></b></p>\n<p>\n<b>\n<i>If they’re playing, they’re really good actors. You can fake that kind of look, right? I mean, c’mon, they’re totally made for each other.</i>\n</b>\n</p>\n<p>It makes Louis pause. It makes Louis <i>think</i>. Lately, he’s been playing it up, yeah. He loves the narrative of the whole Larry Stylinson thing. It’s fascinating and brilliant and so insanely creative, even <i>he</i> wants to believe in this love story. But if he lets himself really think about it...</p>\n<p><b><i>What if,</i> </b>he types, <b><i>hypothetically. What if they aren’t together?</i></b> Louis kind of expects to be laughed at. That’s pretty much what every single other Larry shipper would do; laugh and laugh and tell him to open his eyes and look and - he understands, really, and that kind of conviction is amazing but -</p>\n<p>But Louis also knows the <i>real</i> truth.</p>\n<p><b><i>Then maybe they just haven’t seen it yet,</i></b> comes the reply almost immediately. It surprises him more than he’d care to admit. <b><i>And maybe they’ll realise, one day, that they’re made for each other.</i></b></p>\n<p>Made for each other.</p>\n<p>Louis leans back and stares. </p>\n<p>Maybe they’ll realise they’re made for each other. He thinks about Harry and how easy it is - thinks about how he fits perfectly against Louis’ side, or how he’ll still duck down and tuck his head into Louis’ neck like he did on X-Factor when they were much closer in height, how everything is easier - calmer, more focused - when Harry’s touching him. </p>\n<p>Harry is his <i>best friend</i>. He is <i>not</i> in love with Harry.</p>\n<p>He slams his laptop shut and vows to stay off Tumblr.</p>\n<p>--</p>\n<p>That particular vow lasts all of two days.</p>\n<p>Their PR team seems to have been in discussion with a great many people. They have come to the conclusion that whatever Harry and Louis have been up to, they’ve got to stop it. Louis starts by playing the innocent card - “I have no idea what you mean!” - but their publicist keeps pushing. The powers that be have decided that warning them isn’t work and that the “Larry Stylinson” thing has got out of control.</p>\n<p>They aren’t allowed to sit next to each other in interviews. They’re not allowed to stand next to each other for photos. They are to keep touch to a minimum - and are definitely not allowed to hug or throw their arms around each other.</p>\n<p>Louis feels like the breath’s been punched out of him. He turns to look, wide-eyed, at Harry, who looks back at him with the same expression.</p>\n<p>Harry’s his <i>best mate</i>. How can they be telling them to stop interacting?</p>\n<p>“I - “ Louis starts, just as Harry says, “But - “</p>\n<p>But their publicist interrupts them both. “This isn’t up for negotiation,” he says firmly. “Now get out there; it’s almost time for the interview.”</p>\n<p>They go through make-up in a daze, constantly glancing over to each other. The interview is even worse. Louis finds himself constantly looking past the others, eyes searching for Harry automatically, trying to catch Harry’s eyes. Both their answers are a little shakier than usual, a little more absent-minded. They’re both clearly distracted, and the boys are doing more than their fair share in trying to keep the interview alive and interesting.</p>\n<p>Louis has never realised exactly how much he needs Harry’s touch - how much Harry’s mere presence beside him steadies him - until now.</p>\n<p>As they slip back into the dressing room, Louis feels Harry step up behind him more than he hears the exhaled, “Lou”, and he reaches back to slide his arms around Harry’s waist and draw him closer. Harry wraps his arms around him in return and tucks his face into the crook of Louis’ neck, just breathing slowly. It feels almost like Harry’s found breathing through that interview just as hard as Louis has.</p>\n<p>Tumblr’s on fire by the time Louis gets home. Everyone’s noticed. There’s about a million gifs of him and Harry staring at each other across the couch, and theories range from them breaking up to management conspiracies. Looking at the way Harry’s watching him in those pictures is painful - made worse by knowing <i>first-hand</i> exactly how hard the whole thing was.</p>\n<p>He shuts down the computer without even checking his asks. He doesn’t have the energy.</p>\n<p>--</p>\n<p>It gets worse when the “interview” is published a few days later - their PR team doing their jobs and explaining away the “change” in Harry and Louis’ relationship. </p>\n<p>“It’s affected our friendship,” his PR self is quoted saying. “It changes how we behave in public.” His PR self is kind of an arsehole. And the bit about the girlfriend’s kind of in-your-face, like everyone’s scared people are going to forget. Tactless, that’s what it is. His PR self has no tact at all. It’s a disaster, really, as far as Louis’ concerned.</p>\n<p>Harry makes up for their lack of contact anywhere public by being even clingier than normal when they’re together in private. He sprawls across Louis on their sofa, keeps his foot tucked under Louis’ thighs in the bus, brushes his fingers against some part of Louis’ body as they pass in the hallway - doesn’t ever stop <i>touching</i> him unless he physically can’t - and Louis soaks in every single point of contact as desperately as Harry does.</p>\n<p>PR approaches them again. Harry’s spread out on the sofa, his head pillowed in Louis’ lap, as they wait for make-up to be ready for them. “You two really still need to tone down the lo - “</p>\n<p>“If you’re telling me I have to stop looking at Harry now, I’m going to hit you,” Louis says matter-of-factly, and tugs at one of Harry’s curls. Harry glances up at Louis, smiles at him for a moment, and tilts his head further back to stare at PR.</p>\n<p>The PR guy goes away.</p>\n<p>Harry grins at him - and Louis has to consciously stop himself from leaning down and kissing those lips.</p>\n<p>He freezes, eyes widening a little in horror. He has just been thinking about kissing Harry. </p>\n<p>He’s been thinking about <i>kissing</i> Harry.</p>\n<p>He’s thinking about kissing <i>Harry</i>.</p>\n<p>“Lou?” Harry asks - and Louis’ saved from answering by make up calling them.</p>\n<p>--</p>\n<p>That night, he seeks refuge in Tumblr but it’s a fucking <i>depressing</i> scene. All anyone is doing is talking about how sad they look, how upset, how close they are to cracking. None of them - not a single one - has any idea how true that is.</p>\n<p><b><i>Man, it’s all so fucking depressing out there. What do you think happened?</i></b> he sends to Dusty.</p>\n<p><b><i>Not a clue,</i></b> is the reply. <b><i>But I’m sure everything’ll be fine.</i></b></p>\n<p>Louis bites his lip. <b><i>How can you be so sure?</i></b></p>\n<p><b><i>They’re made for each other, aren’t they?</i></b> There’s so much conviction in that one message. <b><i>Whatever’s going on, I just know they’re finding a way to cope. I don’t believe that bullshit that says they aren’t friends though - and I won’t until they stop looking at each other like they’re the only things that matter. We only see what the media want us to see.</i></b></p>\n<p>It makes Louis feel so much better. And it gives him an idea.</p>\n<p>--</p>\n<p>Two days later (so he doesn’t look too suspicious), he leaks a backstage picture. It’s nothing huge - just a picture of all of them waiting in the wings to go on stage. Harry’s standing close to him and, if anyone looked closely - Louis just knows that someone will - they’d see Harry’s hand tucked casually just under the edge of Louis’ jacket to press very lightly against Louis’ side. Tumblr goes crazy.</p>\n<p>It becomes a routine. Every time the shippers get too depressed or the tag gets too full of angst, Louis will find a picture that’s not too revealing - that could be from <i>anywhere</i> - and leaks it online, or he’ll tweet something that’s ambiguous enough to be anything from his public account and watch it become a trend.</p>\n<p>He's more invested in this non-existent relationship than he'd care to admit. Somehow, he thinks, if these people still believe in him and Harry, they're going to make it through somehow. He's not even sure what they're going to make it through but their faith gives <i>him</i> hope.</p>\n<p>If he's completely and utterly honest with himself - something that only happens very late at night when he's very, very tired, and possibly when Harry's curled against his side like he belongs there - it gives him hope that he and Harry are going to work out in the end. When he's being honest, he admits that he's thinking about kissing Harry on a regular basis now. </p>\n<p>It kind of terrifies him a lot.</p>\n<p>--</p>\n<p>Things come to a head a few weeks later when they’re called in to talk to their management and PR teams. </p>\n<p>“Harry has to move out,” they say, and Louis is standing up before he’s even registered his own movement. Harry’s right beside him.</p>\n<p>“Why?” Harry demands, fingers curling into a fist beside him. “What’s where I live got to do with anyone else?”</p>\n<p>“No one believes this whole thing is affecting your friendship,” they say. “We think it’s partly to do with the fact that you still live together. Since Louis’ with Eleanor – oh, stop flapping around, Louis. For all extents and purposes, you’re still with Eleanor.” Louis huffs out a breath and crosses his arms. He’d broken up with her almost two weeks ago. He’d actually kind of broken down and spilled everything to her while eating ice cream from the carton and trying not to sob. El had laughed and laughed and laughed, and had eventually tried to be sympathetic. Louis had gone out the next day and bought her the Burberry bag he knew she’d been eyeing and (still laughing) she’d told him he was the best gay friend ever.</p>\n<p>He’d insisted he was bisexual. She’d laughed some more.</p>\n<p>And then management had told them they weren't actually allowed to break up, and please could they at least <i>pretend</i> to still be dating if they weren’t going to give it a go. El had laughed at that <i>particularly</i> hard. Louis now owed her that stupidly expensive Hermes purse she’d dropped a (very unsubtle) hint about. He was definitely billing management for that. </p>\n<p>“It makes more sense,” the PR guy continues, “for Harry to be the one to want his own bachelor pad and move out.”</p>\n<p>Harry glances at him helplessly. Like always, Louis can read everything in his expression; he’s afraid Louis actually agrees with their management. “That’s insane,” Louis says, and Harry visibly relaxes, taking an unconscious step towards Louis. “Harry’s not moving out.”</p>\n<p>\n<i>You’ll never leave Louis, will you?</i>\n</p>\n<p>\n<i>No.</i>\n</p>\n<p>Louis takes a conscious step towards Harry, reaching out to brush against Harry’s hand - which immediately uncurls out of the fist, and Harry relaxes a little more. He turns and gives Louis a soft, sweet smile.</p>\n<p>“Listen, guys, we know - “</p>\n<p>“Look,” Louis says, interrupting them. He can feel Harry starting to tense next to him and he doesn’t want to see that gorgeous smile turn back into a frown again. “I get it. PR, image, blahblahblah - but let’s just clear something up, yeah? These rumours don’t <i>really</i> affect our friendship - that’s something <i>you</i> want people to believe. We are not actually going to let these rumours <i>really</i> affect our friendship, so stay the hell out of our personal lives, okay? Harry’s not fucking moving out unless he <i>wants</i> to.”</p>\n<p>“And I don’t want to.”</p>\n<p>Management tries to argue. Neither of them listens. The meeting ends without a conclusion, according to their team, but for Louis, the conclusion’s really fucking simple. </p>\n<p>Harry’s not moving out. </p>\n<p>No one can separate them if they don’t want to be separated.</p>\n<p>--</p>\n<p>Their PR team drops hints that Harry’s moving/moved out anyway. It spreads like wildfire - and if everywhere else is feeling the smoke, Tumblr’s up in flames. It’s a little funny how everyone blames the shippers for it; he even has hate from fans in his ask box. It would have been <i>hilarious</i> if it wasn’t for the fact that the “Larry” corner of fandom seems to be taking it all particularly badly.</p>\n<p>People insult him. People insult Harry.</p>\n<p>Mostly, people blame him - which is better than people blaming Harry, of course - but it still hurts.</p>\n<p>\n<b>\n<i>How could they do that OMG I’M CRYING. I DON’T BELIEVE IN LOVE ANYMORE.</i>\n</b>\n</p>\n<p>\n<b>\n<i>HOW THE FUCK DID LOUIS LET IT AFFECT THEM LIKE THAT.</i>\n</b>\n</p>\n<p>\n<b>\n<i>HARRY’S CLEARLY HEARTBROKEN, LOOK AT HIS FACE - CRYINGOMG.</i>\n</b>\n</p>\n<p>\n<b>\n<i>Harry loves Louis more than Louis loves him.</i>\n</b>\n</p>\n<p>\n<b>\n<i>LARRY SHIPPERS HAVE DESTROYED THEIR FRIENDSHIP</i>\n</b>\n</p>\n<p>\n<b>\n<i>Goodbye, Larry Stylinson.</i>\n</b>\n</p>\n<p>It hurts.</p>\n<p>He knows there’s nothing he can do - he knows the <i>truth</i> - but it’s all a little overwhelming all the same. He only hesitates for a moment before he opens up Dusty’s ask box and sends, <b><i>What do you think?</i></b></p>\n<p>\n<b><i>That it’s bullshit. It’s all bullshit. Harry would never move out, and Lou’d never let </i>anything<i> ruin their friendship.</i></b>\n</p>\n<p><b><i>Yeah,</i></b> Louis replies, reassured. At least one person still has faith in him; chances are if one person still believes, there are others. <b><i>You’re right. They’d never let it happen.</i></b></p>\n<p>\n<b>\n<i>“won’t stop ‘till we surrender...”</i>\n</b>\n</p>\n<p>Louis smiles. He’s just closed the lid of his laptop when his door creaks open and Harry pokes his head in. Louis’ smile softens and he shifts over in the bed, tugging his duvet back in silent invitation. Harry dives into the space and tucks himself against Louis’ side, head on Louis’ pillow. Harry shifts around a little to get comfortable.</p>\n<p>“What’s wrong?” Louis asks, accommodating Harry’s movements until he’s found the position he wants to be in. Louis rearranges himself around that.</p>\n<p>“Couldn’t sleep,” Harry mumbles, and it’s just like X-Factor all over again. Louis wraps an arm around Harry and tugs him closer - which results in them shifting around all over again, but this time it’s easier. Natural. Harry tucks himself into a smaller ball and lets Louis curl around him. Just like X-Factor all over again.</p>\n<p>It doesn’t seem to matter that Harry’s taller than him now - bigger, bulkier - and they’re the biggest boyband in the world. It doesn’t matter that Harry’s a Big Deal, probably more famous than any of them, the sex symbol of the ages. He’s curled against Louis like he’s still sixteen, young and excited, overwhelmed and terrified and in desperate need of approval. He tucks himself in under Louis’ chin, breathes out slow and steady against his chest, fingers clinging slightly to Louis’ shirt like he’s the same boy who’d tucked Louis’ namesake bear into his blazer as a good luck charm because Louis believed in him when he wasn’t sure he believed in himself.</p>\n<p>And Louis still wants to protect him from the world.</p>\n<p>He still can’t believe that this brave, beautiful boy gives himself over so completely and without reserve to Louis’ care.</p>\n<p>\n<i>Made for each other.</i>\n</p>\n<p>Holding Harry like this - being in Harry’s orbit - is the most natural thing in the world. Louis tightens his arms around him, strokes a hand lightly through Harry’s curls, loose from the hairspray and gel and slightly damp from the shower, and lets the realisation of something he’s been trying to avoid for a while now come.</p>\n<p>Harry’s his best mate. And Louis is hopelessly in love with him.</p>\n<p>“What’s on your mind?” Louis prompts softly after a few more minutes of silence, when he feels like Harry’s relaxed enough to maybe talk to him about whatever it is. He tips his head to press his lips to Harry’s hair in mute encouragement. </p>\n<p>Harry doesn’t answer him immediately. When he does, his words are slow - slower even than usual - and measured. “It’s gonna sound really weird.”</p>\n<p>“When the hell’s that mattered with us, Haz? Talk to me.”</p>\n<p>Again, it takes a few moments for Harry to answer, but Louis isn’t worried. He knows well enough that there’s no point trying to force answers from Harry and he knows Harry will tell him when he’s ready to - when he’s found the right words to express himself. </p>\n<p>“I... Lou, I’m tired,” he lets out on a sigh. “I’m tired of pretending. Everything is... Everything’s so complicated.”</p>\n<p>Sometimes, Louis forgets that Harry’s only 19. He’s only two years older, he knows, but Harry’s been in the spotlight since he was far too young, and he acts far too mature for his age now. It sometimes hurts to think that Louis couldn’t protect Harry like he’d always wanted to.</p>\n<p>“I know,” Louis says, sliding his hand down to Harry’s neck to rub his thumb lightly over Harry’s skin, comforting.</p>\n<p>“No, I don’t - “ Harry huffs out a breath and leans back slightly to meet Louis’ eyes, slowly enough that he doesn’t dislodge Louis’ grip. “I don’t just mean... I mean everything. I mean... Are the rumours so bad that we have to go through all this just to contradict them?” Louis blinks at him, surprised. “I mean, is it so bad that people think we’re in some long term, loving relationship? Is being gay and so fucking in love <i>so bad</i> that they have to do every fucking thing to make me into some womanizing whatsit that’s up for a tumble any time?”</p>\n<p>Louis feels like someone’s hit him in the stomach. Harry’s so fucking <i>hurt</i> by the whole thing - and Louis had known (of course, he had) that it’s been hard for Harry to pretend they’re barely friends anymore, just as it’s been for Louis. But he’d honestly had no idea exactly how much pain this public persona they’ve given Harry has been getting to him.</p>\n<p>“Harry...” He trails off because he honestly has no idea what he can say to make it better. “Haz.”</p>\n<p>Harry closes his eyes and lets out a breath, curling back up close again, clinging even more tightly than before. </p>\n<p>“Is it so bad,” Harry mumbles against Louis’ neck. “That people believe I’m in love with you? I like that me better than the other one.”</p>\n<p>Louis shifts so he can press a kiss to Harry’s forehead, pulling back because he wants to say this to Harry and not to Harry’s curls. Harry resists for a few moments, but he eventually tilts his head back and reluctantly meets Louis’ eyes. Louis smiles at him. “I like <i>this</i> Harry the best.”</p>\n<p>When Harry smiles back at him, all Louis thinks is <i>hallelujah</i> because it’s like the sun coming out from behind a cloud, and Louis feels like he can breathe freely again - but that only lasts a moment because Harry’s smile dims just a little and Harry looks away.</p>\n<p>Louis frowns and tilts Harry’s face to meet his eyes again. “Haz, what is it?”</p>\n<p>Harry seems to have an internal debate with himself, eyes flickering anywhere but to Louis’ face, and he frowns, biting his lip absently as though trying really hard to figure out what he should say. He finally gives a resigned sigh and meets Louis’ eyes - and there, in Harry’s familiar green eyes, are emotions Louis’ never seen directed at him before.</p>\n<p>Wariness. Trepidation. A little fear.</p>\n<p>Louis immediately vows that he will do everything in his power never to see this look on Harry’s face ever again.</p>\n<p>“What if,” Harry begins slowly, “this Harry’s not actually all that different from...one of the others?” The question is tacked on almost as an afterthought.</p>\n<p>“Don’t be stupid. I know better than to believe that woma - “ And then Louis’ brain catches up with his mouth and he snaps his mouth shut. “Oh.”</p>\n<p>Harry gives a soft, self-deprecating little laugh. “Yeah,” he says. “Oh.” And then he tries to pull away. Louis doesn’t let him. “Lou - Louis, let me - just. Let go.”</p>\n<p>“No.”</p>\n<p>“This isn’t funny. I don’t - just - let me go and - Louis.” Louis’ name comes out as a whine - the same sound Harry makes when Louis’ being particularly stubborn or idiotic or both of the above. Holding onto Harry when he’s struggling to get away is something of an art form, but, luckily for Louis, he’s perfected it over the years. The fact that this situation is actually almost <i>normal</i> for them despite the pretty much paradigm-shifting statement Harry’s just dropped on him actually makes Louis laugh. Harry stills as though the sound surprises him and he finally <i>stops</i> and looks - well, glares - at Louis. He tries to stop laughing but he can’t completely wipe the amusement from his features. “Don’t laugh. This isn’t funny.”</p>\n<p>“Oh, that’s where you’re wrong, Styles,” Louis says, brushing his fingers over Harry’s scowl and pinching his cheeks, immediately morphing Harry’s face into a smile. It gets the desired reaction; Harry smiles despite himself.</p>\n<p>“It’s not funny,” Harry says again. The smile’s still there but it doesn’t quite reach his eyes, and Harry’s voice is uncharacteristically small, tentative.</p>\n<p>“It’s very funny,” Louis says firmly. “Because, you see, I’m a fan of <i>that</i> particular Harry too.”</p>\n<p>Harry blinks, and Louis watches as realisation dawns, and the wariness in Harry’s eyes turns into a tentative, heartbreaking kind of hope. He worries his lower lip in an achingly familiar gesture and looks at Louis before asking carefully, “...really?”</p>\n<p>“Yes,” Louis says, and he just can’t keep the shit-eating grin off his face. This is... he doesn’t even know what this is. Brilliant, he thinks, that’s what it is. “You see, I’ve been following this rather wonderful love story unfold on this social media site. In the story so far, our two heroes are really hopelessly, stupidly in love, but they’re being kept apart by a manipulative and <i>terrible</i> management that - “</p>\n<p>“Forbids them to do so much as touch,” Harry finishes, and <i>laughs</i>. “You little shit, you’re on Tumblr.”</p>\n<p>“Oh yeah,” Louis admits, laughing. “I’m a huge Larry shipper.” He leans in a little closer. “See, I think Harry and Louis are made for each other.”</p>\n<p>Harry, to Louis’ surprise, narrows his eyes at him suspiciously - and then jabs him <i>hard</i> in the stomach. “I know who you are! You - I should have fucking <i>known</i>. No one else could have had some of those photos.” He’s laughing again, jabbing harder even as Louis tries to squirm away without letting Harry go. Now that he’s got his hands on him properly, he’s not sure he ever wants to let go. “You’ve been sharing <i>private photos</i>, you arse!”</p>\n<p>Harry only puts up a minimal amount of resistance when Louis goes on the attack, rolling them over, catching Harry’s wrists and pinning him to the bed. Harry just beams up at him and doesn’t even fight his grip. “I was helping the narrative along,” Louis says, eyes drawn to Harry’s mouth as Harry’s tongue darts out to lick his lips. “When it seemed like it needed a little...push.”</p>\n<p>He’s still staring at Harry’s mouth when Harry licks his lips again, and Louis mimics the movement unconsciously.</p>\n<p>“Louis,” Harry breathes, and Louis watches his mouth move to form Louis’ name, absolutely captivated. “Lou, for the love of <i>everything</i>, please - <i>please</i> kiss me.”</p>\n<p>Louis kisses him.</p>\n<p>Everything falls into place. It’s terrible and cliched and Louis <i>doesn’t care</i> because his world narrows to just this - just them - just Harry’s lips moving against his, Harry’s tongue licking at the seam of his mouth, teasing, drawing Louis deeper into the kiss. Harry tastes like toothpaste and <i>Harry</i>, and it’s more addictive than anything he’s ever tasted in his life. He moans low and licks deeper into Harry’s mouth, fingers tightening around his wrist - and Harry <i>mewls</i>, mouth going a little slack before he surges up into that kiss, harder, hungrier, needier. The sound turns into a moan as Louis shifts their positions, nudging Harry’s legs apart so he can fit between them, and rubs their dicks together.</p>\n<p>“Fuck,” Louis breathes as they break for air. Harry doesn’t let Louis move away - and Louis doesn’t, just turns his head and tries to suck in oxygen despite the fact that he thinks he might need <i>Harry</i> more than he needs to breathe right now. Harry nuzzles against his cheek, panting softly. “Fuck, Harry.”</p>\n<p>“Yes,” Harry mumbles, arching his hips to rub against Louis shamelessly. “Fuck Harry. That’s a good idea. Louis should fuck Harry.”</p>\n<p>Louis laughs breathlessly, feeling a little desperately because - <i>fuck</i> - that’s possibly the hottest thing he’s ever heard. “Are you answering the question of who tops, finally?” he teases, trying to give himself a little time to calm down.</p>\n<p>Harry gives a little growl, but it sounds half-hearted - and tapers off into a slow, drawn out moan as Louis grinds down against him deliberately. “We - we can switch,” Harry manages to stutter out. “Like Mario Kart. But today - but right now - god, Louis, I’ve waited for too fucking long, so <i>get on with it</i>. Please.”</p>\n<p>Right.</p>\n<p>Well then.</p>\n<p>Louis has to take a moment to actually find his <i>brain</i> because he’s pretty sure it just melted from the combined hotness that’s Harry rocking against him and Harry moaning and Harry talking in <i>that voice</i> and saying <i>those things</i>. He thinks he might have grossly underestimated exactly how destructively <i>gorgeous</i> Harry actually is - he and the rest of the known world - and he’d rated Harry’s ability pretty damn high to start with.</p>\n<p>He tries to get to his bedside draw without actually moving away from Harry. He doesn’t succeed. He huffs out a breath and kisses Harry again, rocking down hard against him just to hear that gasp-moan, just to swallow it in his kiss, just to feel Harry melt into the bed, feel his cock twitch against Louis’ - and then he uses an inhuman amount of effort to pull away, crawling over to the side of the bed to search for his supplies.</p>\n<p>He makes the mistake of glancing back at Harry as he does so and he has to bite back a moan, and it takes twice the amount of effort as usual to locate the lube. He can’t tear his eyes away. Harry’s shrugged out of his shorts and curled his hand around his dick, stroking lazily, not even really focused on that at all. His eyes are fixed on Louis, pupils expanded until Louis can barely see the green of his irises anymore. His mouth’s red and puffy, parted as Harry draws in soft panted breaths - and he looks absolutely perfect. Sin and temptation personified.</p>\n<p>And Harry looks like this for <i>him</i>.</p>\n<p>He lets out a low moan and has to grasp the base of his cock firmly just to stop himself shooting his load. He’s not ready for this to be over quite yet because <i>fuck</i>, Harry looks like this for him - waiting for him - but on the other hand - <i>fuck</i>. He really needs to fucking get on with it. He finally locates the lube and starts to crawl back to Harry when he realises something.</p>\n<p>He stops and glances back at his bedside table, hesitating before he shifts the last few centimeters to Harry. He leans down and kisses him hard. “Don’t take this the wrong way, love,” he says carefully, and it’s torture in itself that he’s going to have to say this at all. “But I don’t think I can fuck you tonight.”</p>\n<p>Harry <i>whines</i>. “Louis - Louis, please. I need - I want - I don’t want to wait. I’ve waited and - I <i>need</i> you.”</p>\n<p>“Love,” he says again, and really, he needs to be sainted for this. “No condoms.” His sex life hasn’t exactly been anything to brag about - except if it’s a bragging competition about who has been having the <i>least</i> sex. He’d just thrown away a box of expired condoms last month.</p>\n<p>“I don’t care,” Harry says, tugging Louis back down so he can kiss him. “I mean, I’m clean.” He nips at Louis’ lower lip. “I’m <i>clean</i>. I’ve never even - You are too, right?” Louis doesn’t miss the abrupt change in the direction of that last sentence.</p>\n<p>“Yeah,” Louis answers, but he pulls back despite Harry grabbing at him, despite Harry trying to follow his lips with his own. “You’ve never even what?”</p>\n<p>Harry pouts at him - but no, this is too important and Louis’ not giving in that easily. </p>\n<p>Harry sighs, dramatic and impatient. “I’ve never gone all the way,” he mumbles, flushing, but determinedly grabbing Louis’ shirt and tugging it over his head, throwing it to the side somewhere to join the rest of the mess on Louis’ floor.</p>\n<p>“Wait - wait, I - “ Harry shuts him up with a solid kiss. </p>\n<p>“Don’t. No. No waiting,” Harry says, sliding his hand down to push Louis’ boxers off his hips as well. “No more <i>waiting</i>, Lou, please. I haven’t because I didn’t want to. Because I was <i>waiting</i>. Because none of it - none of them - felt right. I was waiting for it to feel right and - it’s <i>you</i>. I was waiting for you.” They both know Harry’s rambling - he’s always rambling, especially when he’s excited and nervous all at once - but it’s stupidly perfect anyway and the entire concept of it just blows Louis’ mind.</p>\n<p>\n<i>Made for each other.</i>\n</p>\n<p>No one will ever know how right - how fucking perfect - that statement really is.</p>\n<p>“Okay,” Louis says. He shifts to slide the boxers off, using the moment to tug Harry up so he can get rid of the flimsy t-shirt Harry has on as well. “But we’re going to go slow.”</p>\n<p>Harry gives an impatient huff. “I’m not a complete virgin, okay? I’ve had more than a few things in my arse - just no one’s fucked me yet. So please, please, please, Lou - please don’t make me - oh <i>fuck</i>.”</p>\n<p>Louis slides the finger in a little deeper, grinning at the expression on Harry’s face. His breathing’s gone a little ragged and there’s even more colour in his cheeks than before. Louis’d always known that his knowledge of Harry’s tendency to not pay attention to anything except his own rambling when he really got started would come in handy one day.</p>\n<p>“That feels so - that’s. God, <i>Lou</i>.”</p>\n<p>“Yeah,” Louis says, absurdly proud of himself. “You look fucking gorgeous, Harry.”</p>\n<p>Harry opens his eyes and smiles at Louis and it’s so achingly sweet, achingly beautiful that Louis’ breath physically catches. This is so much more than just about desire; he’s filled with so much <i>love</i> for this boy under him that he thinks he might be bursting at the seams. He finally understands every single cliche in the world.</p>\n<p>“I love you,” Louis says, shifting so he can lean down and kiss Harry. “I love you so fucking much, Haz, you don’t even know.”</p>\n<p>“I <i>know</i>,” Harry says, rocking back against his fingers - but his eyes tell Louis everything he needs to know; Harry does know. Harry knows because - “I love you too, now please, Louis, I need - “</p>\n<p>Louis slides in another finger next to the first, slow and patient and - god - Harry’s so fucking tight. He hears the sharp inhale that tells him it hurts and he stills, wriggles his fingers just a little, gentle and patient, waiting until - “Okay,” Harry breathes, eyes opening again. “I’m okay.”</p>\n<p>Louis takes it slow after that - so fucking slow - despite Harry’s attempts to hurry him along, all moans and rocking and pleading, but Louis won’t hurt him - won’t let this hurt any more than it has to, because Harry’s given him this gift, Harry’s trusting him with this, giving himself over, and Louis’ going to take care of Harry, body and heart and soul.</p>\n<p>Finally, when Harry’s thrashing against the bed, arching and rocking, flushed and panting, body opened and relaxed, and <i>begging</i>, Louis flicks out his fingers and slicks up his dick and - stops. He puts his hands lightly on Harry’s hips, tilting them up a little. “Haz,” he calls, and he watches lust-blown eyes open to meet his gaze. “This would hurt less if you were on your hands and - “</p>\n<p>“No,” Harry croaks out and reaches up to wrap his arms around Louis’ neck. “No,” he repeats firmly. “I want to see you.”</p>\n<p>Louis smiles. “Good,” he says, and he shifts again, reaches down to line himself up and presses in <i>slowly</i> as he leans forward to distract Harry as best as he can with a kiss. Harry’s moan is edged with pain - and Louis forces himself to go even <i>slower</i> despite the tight-amazing-heat of Harry’s body and - <i>fuck</i>, this is really happening.</p>\n<p>When he’s finally in, when he feels Harry’s body relax around him, when Harry’s breathing goes from stuttered-pain to need-and-want-and-please and Harry rolls his hips, Louis feels like everything is blindingly and <i>obviously</i> right with the world. They find a rhythm almost immediately - as natural as everything else they do together.</p>\n<p>It’s perfect. Everything about it is perfect.</p>\n<p>Louis leans up to meet Harry’s eyes and laughs at the expression mirrored there, leans in to kiss him even as breathless as they both are until the kisses turn into just lips touching, just panting against each other’s mouths, smiling because nothing’s ever felt this good, this right - smiling because they’re together, they’re two pieces of a puzzle, two halves of a whole and every other cliche in existence - and it’s <i>perfect</i>.</p>\n<p>When they come, they come almost in unison - a hot rush of amazing and liberating and every other adjective Louis can’t even come up with, doesn’t even know. It’s too much and not enough and just right and - and when they come down from the high, they’re still giddy with it, still trading soft, sweet, breathless kisses.</p>\n<p>“I love you,” Louis says as they curl up together, cleaner courtesy of a warm washcloth. They’re pressed up close against each other, avoiding the wet spot on the bed. </p>\n<p>Harry smiles brilliantly. “I love you too,” he says. “I have for a while actually.” He kisses Louis’ neck softly before he shifts, craning his neck up to catch Louis’ lips. His smile widens and he does it again, and Louis knows how that feels. He can’t quite believe he gets to do this as well. He’d never actually dared to really imagine what it would be like; he’d just lived vicariously through other people’s faith and other people’s imaginations.</p>\n<p>“Why didn’t you ever say anything?”</p>\n<p>Harry shrugs, settling his head back on Louis’ shoulder. “What was I meant to say? I guess I thought… I don’t know, maybe it wasn’t time yet. Maybe it was too soon to say anything, and maybe you’d figure it out eventually.”</p>\n<p>Louis raises an eyebrow and shifts to look down at Harry. “Figure what out?”</p>\n<p>Harry smiles a little more and shrugs again. “That we’re meant to be together. That we’re made for each other. That you complete me and vice versa.”</p>\n<p>“That’s awfully presumptive of you,” Louis teases, but Harry just laughs and gives him a knowing grin. </p>\n<p>“You know it’s true,” he points out, and Louis has to concede the point. It is true. He’s nothing without Harry. Even before – before Tumblr and the shipping, before being told to stop touching, before all of that – Harry has been the best thing X-Factor helped him find. Niall, Liam and Zayn, and One Direction too, of course – but <i>Harry</i> most of all.</p>\n<p>Louis bites Harry’s neck in retaliation, not even pausing to think about the consequences of that tomorrow. It’s only when he pulls back that he realises he’s left teethmarks.</p>\n<p>“Oops,” he says, completely unapologetically. </p>\n<p>Harry laughs. “Oops,” he echoes and cuddles closer.</p>\n<p>He’s about to fall asleep when something occurs to him. “Harry,” he says, nudging Harry lightly until he gets a sleepy “huh?” in reply. “You said you knew who I was on Tumblr, right?” Another sleepy affirmative. Louis pauses. “<i>How?</i>”</p>\n<p>“Pictures,” Harry mutters against his skin. “Told you that.”</p>\n<p>Louis prods him in the cheek right where his dimple would be if he was smiling. “I mean, does that mean you’ve read my Tumblr?”</p>\n<p>“Idiot,” Harry says fondly, nipping at Louis’ skin, before he nuzzles him again. “I talk to you almost everyday there. Now go to sleep. I’m exhausted.”</p>\n<p>Louis blinks and lets that sink in. And then he starts laughing. That makes so much sense. He tucks Harry in against him as close as he possibly can. He’s still smiling when he drifts off to sleep.</p>\n<p>--</p>\n<p>A few days later, Louis decides to spread some of his happiness to others.</p>\n<p>The picture is grainy, taken from far away. To him, him and Harry are immediately recognisable, but he supposes there’s enough distortion in the picture that they could <i>arguably</i> be a couple that looks a <i>lot</i> like them. Anything that would leave no doubt as to the fact that it’s them – their tattoos, mostly – are not distinguishable in the photo. Louis knows it’ll be enough even if he really wants to give them more, leave absolutely no doubt as to who he belongs to now that it’s really the <i>truth</i>. </p>\n<p>Harry wraps his arms around Louis’ waist and props his chin on Louis’ shoulder as Louis composes the rest of the post.</p>\n<p>“PR’s going to kill us,” Harry says, laughing. </p>\n<p>“They can’t prove it’s us,” Louis argues, turning around to steal a kiss and he happily lets himself be momentarily distracted before he goes back to finishing up.</p>\n<p><b><i>It is what it is,</i></b> he writes. <b><i>Can’t hide what’s real. Can’t deny what’s meant to be.</i></b></p>\n<p>\n<b>\n<i>Won’t stop ‘till we surrender.</i>\n</b>\n</p>\n<p>He tags it <b>#bravery</b> and <b>#larry stylinson</b> and <b>#larry is real</b> and posts it. Almost immediately, the number of notes goes up to 20. Louis’ insanely pleased with himself and it must show on his face because Harry laughs.</p>\n<p>“Tumblr fame’s gonna get to your head,” he says, nosing lightly at Louis’ cheek. </p>\n<p>For a moment, Louis thinks about checking the tag, checking the reblogs, seeing what everyone else is saying about the picture. He wants to know if it helps people to <i>believe</i> - but he looks back at Harry and thinks, <i>I don’t care</i>. What he has – what they have – is real and it doesn’t <i>matter</i> what anyone else believes. </p>\n<p>He knows for a <i>fact</i> that this is real. </p>\n<p>This is meant to be.</p>\n<p>This – Louis and Harry, Harry and Louis, Larry Stylinson – whatever name you want to give to this thing between them – is <i>love.</i></p>\n<p>And love is real.</p>"
}