{
  "id": "8163464",
  "url": "https://archiveofourown.org/works/8163464?view_full_work=true",
  "author": [
    "platonic_boner"
  ],
  "title": "True Love",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Merlin (TV)"
  ],
  "relationships": [
    "Merlin/Arthur Pendragon (Merlin)"
  ],
  "characters": [
    "Merlin (Merlin)",
    "Arthur Pendragon (Merlin)",
    "Lancelot (Merlin)"
  ],
  "additional_tags": [
    "Canon Era",
    "Soulmate AU",
    "Angst with a Happy Ending",
    "Mutual Pining",
    "Misunderstandings",
    "Based on a Tumblr Post"
  ],
  "language": "English",
  "series": "",
  "published": "2016-09-29",
  "completed": null,
  "words": "6,927",
  "chapters": "1/1",
  "comments": "595",
  "kudos": "44,324",
  "bookmarks": "6,441",
  "hits": "370,727",
  "summary": "<p>AU where soulmates can’t lie to each other.</p>\n<p>(That’s okay, Merlin wasn’t planning to lie to Arthur anyways! Haha.. ha.. ha…)</p>",
  "notes": "<p>This was inspired by a tumblr post. I started writing it months ago and I have long since lost the post I saw, but I thiiiink it was <a href=\"https://youareemrys.tumblr.com/post/97684827589/dyleon-soulmate-au-where-you-cant-lie-to-your\" rel=\"nofollow\">this one</a>.</p>\n<p>Translation into Russian available <a href=\"https://ficbook.net/readfic/018b5c15-5e6e-7034-9266-8b9422faee0f\" rel=\"nofollow\">here</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p>\n<strong>MERLIN</strong>\n</p>\n<p>Merlin’s in trouble.</p>\n<p>Firstly, he’s a sorcerer in Camelot, of all places. And as he found out upon his recent arrival, the ban on magic is definitely <em>not</em> taken lightly (unlike sorcerers’ heads). To add to that little problem, he’s just been appointed as Prince Arthur’s manservant, which means that not only does he have to have to scrub floors and muck stables, he has to try to be <em>polite</em> to someone who can otherwise have him thrown in the stocks. And politeness does not come naturally to Merlin. So, yes, he’s definitely in trouble.</p>\n<p>He doesn’t know just how <em>much</em> trouble he’s in until the day he tries telling Arthur how hideous he looks in that particular shade of red. It’s a perfectly normal thing to tell the prince you’re serving when he asks if he looks all right, thank you very much, and Merlin has previously insinuated a number of insulting things about the prince, so he expects no problems with uttering this one.</p>\n<p>But instead of an insult, what comes out of Merlin’s mouth is, “You look very majestic, sire.”</p>\n<p>He then promptly stumbles and drops the bucket of water he’s carrying. Merlin did not mean to say that. Merlin meant to say the opposite of that, but instead the truth came out. Oh no. No no no.</p>\n<p>Arthur snorts at the dropped bucket and growing puddle. He doesn’t seem to think anything is amiss, probably because he already knows that Merlin trips and breaks things and throws things around way more than is normal.</p>\n<p>\"Go fetch a rag and clean that up,\" Arthur says. Merlin scurries to obey; Arthur calls after him, \"And Merlin? Cut the sarcasm.\"</p>\n<p>Merlin wonders, as he attempts to mops at the puddle with a rag, if maybe his tongue <em>had</em> just decided all on its own to be sarcastic? Merlin quite likes that explanation. It sounds much more pleasant than the other option, the one Merlin thought of immediately, which is that <em>Merlin can't lie to Arthur because Arthur is his soulmate</em>.</p>\n<p>Merlin pauses his mopping to bang his head on the stone floor.</p>\n<p>Merlin is a <em>sorcerer</em> who can't lie to the <em>Prince of Camelot</em>. How long can he possibly expect to live?</p>\n<p>*</p>\n<p>Merlin spends the next few days saying very little to Arthur at all, because ignorance is bliss and denial is very healthy for the soul, and all that. But this annoys Arthur and bores Merlin, and besides, ignorance is probably pretty dangerous in this instance. So Merlin decides to test it.</p>\n<p>(After all, a few days after the original incident, he’s almost convinced himself that he <em>was</em> just being sarcastic. Clearly he’s not <em>soulmates</em> with <em>Prince Arthur</em>; that would be ridiculous.)</p>\n<p>So, as he and Arthur walk down the steps into the courtyard, Merlin says, \"The sky is a beautiful shade of green today.\"</p>\n<p>At least, he tries to.</p>\n<p>Of course, what actually comes out is blue.</p>\n<p>Arthur looks at him like he’s out of his mind. \"Have you been drinking, Merlin?\"</p>\n<p>Drinking. Now <em>that</em> sounds like a great idea.</p>\n<p>*</p>\n<p>Gaius notices something is wrong, of course, because he always does.</p>\n<p>\"What have you done now?\" he asks, demonstrating a worrying lack of faith in Merlin that is, sadly, entirely warranted.</p>\n<p>\"I haven't really <em>done</em> anything,\" Merlin says. (He finds he appreciates the ability to lie much more now that he realizes he's taken it for granted all his life.)</p>\n<p>Gaius fixes him with a beady gaze and a raised eyebrow.</p>\n<p>\"I can't lie to Arthur,\" Merlin blurts.</p>\n<p>\"Merlin!\" Gaius scolds. \"You <em>must</em> keep hiding your magic from him. I know you feel guilty about lying, but he'd feel even worse about beheading you!\"</p>\n<p>\"No, you don't understand,\" Merlin says. \"I <em>literally</em> can't lie to him. He's my soulmate.\"</p>\n<p>Gaius stares at him in horror.</p>\n<p>\"Sorry?\" Merlin says. He’s not quite sure what he’s apologizing for. In fact, he thinks the universe owes <em>him</em> an apology for this whole, awful situation.</p>\n<p>\"You're going to be the death of me,\" Gaius says.</p>\n<p>Merlin supposes that’s likely to be true, but he’s also pretty sure he’ll be the death of himself first.</p>\n<p>*</p>\n<p>The dragon thinks it’s <em>hilarious</em>.</p>\n<p>*</p>\n<p>Merlin finds he can get around the not lying to Arthur problem by judiciously using a combination of sarcasm and silence. It helps that, when it comes to the magic, it's not like Arthur would ever believe him. He just laughs every time Merlin claims to have been using sorcery to save his life.</p>\n<p>\"Daydreaming this much can't possibly be good for you,\" he’ll say. \"Or for the state of my chambers.\"</p>\n<p>Arthur doesn't seem to mind that Merlin and he have this running joke about Merlin being a sorcerer. In fact, he seems to think it’s funny. The only time he got annoyed was the one time Merlin mentioned using sorcery in front of other people.</p>\n<p>It was only a couple of guards, but they had their hands on their swords almost immediately.</p>\n<p>\"He means nothing by it,\" Arthur had assured them, putting a hand on Merlin's shoulder protectively. \"He's very new here and he has a horrible sense of humour. Too thick to realize magic <em>isn't funny</em>, aren't you, Merlin?\"</p>\n<p>\"No,\" Merlin had said defensively, because he’s very clever, actually, and he knows magic isn't funny. Magic is going to get him beheaded.</p>\n<p>\"Very thick,\" Arthur had said, shaking him slightly. \"I'll get it through his head, don't worry,\" he'd told the guards. \"There's no need to mention this to...anyone.\"</p>\n<p>\"Yes, sire,\" they'd agreed, and Arthur had dragged him off and given him a lecture about how he couldn't talk like that in front of anyone else, <em>especially</em> not nobles and absolutely <em>never</em> in front of the king.</p>\n<p>Merlin had nodded and agreed that it was dangerous, treasonous, and stupid, but he'd only been able to promise to <em>try</em> not to do it in front of other people. Fortunately Arthur has taken it to heart that his manservant is incredibly loose-lipped, and has stopped asking him hard questions like \"Where were you last night?\" anywhere other than the safety of Arthur's chambers.</p>\n<p>Merlin is incredibly grateful to have such a dunce as a soulmate.</p>\n<p> </p>\n<p>\n<strong>ARTHUR</strong>\n</p>\n<p>Arthur notices from the minute he meets Merlin that there’s <em>something</em> about him. Perhaps several somethings.</p>\n<p>First of all, ugly uneducated peasant or no, Merlin’s <em>funny</em>. Arthur first ends up laughing at Merlin’s humour unwillingly, when Merlin’s insulting him in front of his own knights and the townspeople of Camelot. It’s not exactly the best first impression, but when Arthur finds himself forced to keep company with Merlin, Merlin’s humour is something he actually appreciates. It ensures that his company isn’t boring in the slightest. Most people are either too respectful of Arthur’s position to tease him or not clever enough to come up with witty remarks, but Merlin has precisely the opposite of both those problems. Arthur would claim that Merlin’s banter is his favourite thing about him, but that would be a lie, because Merlin’s got even more impressive qualities.</p>\n<p>Because, ugly peasant or no, Merlin is the bravest person Arthur has ever met. Arthur notices this, too, when they first meet: Merlin stands up to him even though he’s the prince, even though he’s way bigger than Merlin, and even though he’s clearly able to kill Merlin with his bare hands. Arthur notices it again when Merlin hunts monsters with him, and when Merlin drinks poison for him, and many other times between. Arthur’s known hundreds of warriors, some of whom have been hailed as heroes, but none of them have had courage to equal Merlin’s.</p>\n<p>And finally, frankly, Merlin’s just… <em>good</em>. He has faith in people. He acts with kindness and compassion. He genuinely believes in justice and equality. From time to time, mainly when Merlin is disappointed in him, Merlin’s goodness makes Arthur ashamed of himself. But mostly it makes Arthur want to be a better man himself.</p>\n<p>Yes… there’s definitely <em>something</em> about Merlin.</p>\n<p>(Also, not that it’s important, but for an ugly peasant, Merlin has really pretty eyes and gorgeous cheekbones and adorable ears and possibly he isn't actually ugly at all. So. There’s that.)</p>\n<p>*</p>\n<p>Regardless of what exactly the <em>something</em> about Merlin is, it has a very strong and unusual effect on Arthur.</p>\n<p>Case in point, around two months after being blessed/cursed with Merlin’s servitude, Arthur comes back to his chambers earlier - and more quietly - than usual, and receives a rather large shock. Merlin is poking at the embers and slightly damp wood in Arthur’s fireplace, and as Arthur watches, he sighs with frustration and mutters something.</p>\n<p>Merlin’s eyes glow gold, and the fire bursts to life.</p>\n<p>Arthur will reflect later that, as the crown prince who is sworn to uphold the laws of Camelot, he should have drawn his sword and run Merlin through immediately. The thought of doing so doesn’t even cross his mind now, however. Instead, he immediately and silently backs out of his own room.</p>\n<p>Arthur leans back on the wall just outside his room and takes one deep breath, then another.</p>\n<p>Merlin is a sorcerer. That’s news. Merlin is an incredible fool. That’s not news, though it is a problem.</p>\n<p>Once the shock passes, Arthur finds himself… forgiving. He can’t summon any anger. He feels vaguely upset and betrayed to have been lied to, but this is tempered by the fact that Merlin can’t have known he’d be safe in telling Arthur, given that Arthur himself can’t believe he’s not going to turn Merlin in.</p>\n<p>And he’s definitely <em>not</em> going to turn him in. Arthur cannot think of an instance in which he has ever disobeyed one of his father’s laws so flagrantly, or with so little cause, but he is absolutely not going to report Merlin’s sorcery. He flinches from the mere idea. The thought of Merlin dying is… well, it’s unthinkable.</p>\n<p>Arthur collects himself with a final steadying breath, and then enters his chambers again, making sure to slam the door loudly this time around.</p>\n<p>In the time Arthur spent in the hall, Merlin has moved across the room and is tidying Arthur’s clothes. Upon Arthur’s entrance, Merlin turns and his face brightens with a huge smile. He drops what he’s holding, transferring all his attention to Arthur, and starts some inane tale about his day, as if it’s <em>Arthur’s</em> job to listen to <em>Merlin’s</em> stories.</p>\n<p>Arthur half-listens to Merlin’s animated tale of his misadventures with the hunting dogs, as he comes to a realization. He’s going to have to protect Merlin, the <em>absolute fool</em>, from the entire world and from his own foolish self. But there’s absolutely nothing Arthur would rather do, and absolutely no one Arthur would rather be stuck with.</p>\n<p>Merlin is annoying and disrespectful and aggravating and brave and beautiful, and, in short, Arthur’s in love with Merlin, <em>something</em> and all.</p>\n<p>  </p>\n<p>\n<strong>MERLIN</strong>\n</p>\n<p>After a couple months of living in Camelot and serving Arthur, Merlin’s perspective has changed slightly.</p>\n<p>First: he’s willing to admit that the universe might be onto something after all. About Arthur being his soulmate, that is. True, the prince is a huge prat and occasionally a big bully. But he’s also brave, kind, honourable, and frankly gorgeous. Merlin has only known him two months, but he’d lay down his life to protect him, and he’d do anything to earn one of his smiles. So, yes, <em>maybe</em> he’s a little bit in love.</p>\n<p>Second: Merlin may be in slightly less trouble than previously feared.</p>\n<p>Arthur clearly hasn’t found out about the magic yet, as Merlin is still in possession of his head. Merlin would think it was just a matter of time, except that he’s quickly discovered Arthur is the most oblivious person Merlin has ever known. (This is evidenced by the fact that two entire <em>months</em> have passed and Arthur still hasn’t realized they’re soulmates.)</p>\n<p>With the immediate danger postponed until Arthur gets a clue, which will seemingly take a very long while, Merlin can focus on the positive. Specifically: he’s found the love of his life and he gets to spend every single day with him. It’s kind of great. Sometimes when Merlin wakes up, he just lies there grinning for a few minutes before Gaius yells at him to get out of bed.</p>\n<p>Merlin finds it hilarious that Arthur hasn’t figured out that they’re soulmates. How could Arthur <em>not</em> notice that he can't lie to Merlin? They talk almost constantly. How hasn't Arthur tried to lie to him even once?</p>\n<p>To be fair, it does make <em>some</em> sense that Arthur would be the last to know. Besides his general lack of observation skills providing a hindrance, it’s also definitely true that Merlin has a lot more to lie about.</p>\n<p>Merlin doesn’t want to outright tell Arthur, though. First of all, there’s no fun in that. Also, Arthur often reacts badly to being told things outright. No matter what it’s about, it’s much better for all involved for Merlin to drop hints and help Arthur figure out what’s going on, and then let him believe he found out on his own.</p>\n<p>So Merlin hints. He prattles on about soulmates and stories of true love, to no effect.</p>\n<p>(Okay, not <em>no</em> effect, just not the <em>intended</em> effect. Instead, Arthur concludes that Merlin’s an incorrigible romantic and starts teases him by making him lie to random passersby in case they’re his soulmate.</p>\n<p>“Try that woman, Merlin,” Arthur says, gesturing to an old woman across the courtyard from them.</p>\n<p>“Try what?” Merlin asks.</p>\n<p>“Go on, check if you can lie to her,” Arthur says.</p>\n<p>“Her? She’s got to be older than Gaius!” Merlin says.</p>\n<p>Arthur shoves him until Merlin crosses the courtyard towards the woman and tells her that grass is blue. She glares at him and says, “I know what you’re trying, laddie, and I’m too good for the likes of you!” and beats him away with her broom. Arthur nearly pisses himself laughing.</p>\n<p>This event happens to coincide with Merlin’s decision to find new tactics.)</p>\n<p>Next he starts asking questions he thinks Arthur will lie to, but this fails as well because Arthur just refuses to answer. Sometimes he also shoves Merlin for his impertinence in asking, and sometimes he tackles Merlin and they end up play-fighting or wrestling, which is fun and so Merlin keeps prying, though he never succeeds at his main objective.</p>\n<p>Merlin drops all the hints he can think of, but Arthur never reacts - never realizes.</p>\n<p>And eventually - after three months living in Camelot, after an entire month of increasingly bold hints about their status as soulmates - Merlin comes to terms with the idea that there is no way Arthur hasn’t noticed by now. He <em>must</em> have realized, right? But - he hasn’t said a thing, hasn’t started treating Merlin any differently, hasn’t reacted to any of Merlin’s hints. He has to know, but he’s not saying anything.</p>\n<p>Merlin stops dropping hints.</p>\n<p>It’s clear that Arthur’s rejecting him.</p>\n<p>Merlin tries not to take it personally. They’re <em>soulmates</em>; Arthur <em>has</em> to love him back. Sometimes Merlin even sees flashes of that in Arthur’s eyes, or in the way Arthur touches him. He tries to console himself with the notion that Arthur must want him, at least a little.</p>\n<p>Merlin’s pretty sure he knows what the problem is. Arthur is the only heir to the throne of Camelot; Merlin is a peasant and a boy. Arthur needs to marry a princess, someone who will make Camelot stronger and who will be able to bear Arthur’s children. Merlin can’t do that.</p>\n<p>If Arthur wasn’t the prince, if he didn’t have a duty to Camelot to secure an alliance through marriage and produce heirs, then maybe…</p>\n<p>But he does have that duty. And he obviously prioritizes that over Merlin. Not that Merlin blames him - he loves that Arthur’s so dedicated to his people - but it still hurts to know that Arthur doesn’t love Merlin enough to fight for him. (Doesn’t even love Merlin enough to offer him an explanation, or any discussion - but Merlin’s not going to challenge that, it’s fine, he can deal with it. As long as Arthur lets him stay.)</p>\n<p>The only thing that makes it bearable is that Arthur’s letting Merlin stick around. Merlin isn’t sure he can bear living without his soulmate’s love, but he <em>knows</em> he couldn’t deal with Arthur being far away from him, with not being able to protect him and cheer him up and hear his laugh. The only thing that could be worse than sticking around to watch Arthur marry some princess someday would be not being at Arthur’s side when he does. So Merlin suffers through the torture of watching his soulmate but not being allowed to have him, because the other option is so much worse.</p>\n<p> </p>\n<p>\n<strong>ARTHUR</strong>\n</p>\n<p>It’s another couple months after discovering Merlin’s magic that Arthur figures out the “something” about Merlin is not his magic, or his personality, or whatever. It’s that Merlin is his soulmate.</p>\n<p>In Arthur’s defense, he just hasn’t <em>bothered</em> lying to Merlin. Lies are things Arthur uses in politics, when trying not to offend a lord by telling him his son resembled his neighbour more than him, or a lady by telling her his truthful opinion on her dress. Lies aren't things he should have to bother with when talking to his servant. He’s the prince, and Merlin isn't allowed to judge him. Telling Merlin things is easy, anyways. So, he hasn’t tried to lie to Merlin enough to notice he can't lie to Merlin, if that makes any sense.</p>\n<p>But then, as Arthur is putting away his old cloak after he's gotten a new one, Merlin asks him about it. Well, the way Merlin asks about things.</p>\n<p>“That isn’t where that <em>goes</em>, Arthur, give it here and I’ll put it in the usual storage. Why are you trying to tidy up after yourself, anyways?”</p>\n<p>Arthur opens his mouth to give a perfectly reasonable explanation about Merlin’s incompetent cleaning skills and/or mothballs.</p>\n<p>\"I'm putting it away for your Christmas present,\" Arthur says instead, then freezes.</p>\n<p>That was supposed to be a <em>surprise</em>.</p>\n<p>\"Aww,\" Merlin coos. \"You're getting me a present? Should I get you one too?\"</p>\n<p>\"Maybe not anymore,\" Arthur snaps back.</p>\n<p>He doesn't mean that, but he could say it. Does that mean he's not -? Or is it because he said maybe?</p>\n<p>\"Merlin,\" Arthur says, slowly.</p>\n<p>\"Arthur,\" Merlin replies in kind, looking at Arthur questioningly.</p>\n<p>\"Your ears are incredibly large,\" Arthur says, and winces, because he just tried to call them tiny. \"You could use the cloak to cover them.\"</p>\n<p>\"Ha, ha.\" Merlin crosses his arms.</p>\n<p>Arthur stares at his <em>soulmate</em>. His gorgeous, amazing, wonderful soulmate, whom Arthur is already madly in love with. This means Merlin loves him <em>too</em>. This is the best day of Arthur’s life. He can walk over there and grab Merlin and kiss him <em>right now</em>. There’s nothing stopping him. In fact, why haven’t he and Merlin been kissing <em>already?</em> Like, <em>all of the time</em>?</p>\n<p>Does Merlin know? No, wait, of course Merlin knows. He probably tried to lie to Arthur a lot when he was first assigned as Arthur’s servant, and kept breaking things and making messes instead of cleaning them up. Why hasn't he said anything? Has he been laughing at Arthur this whole time? Does he think it’s funny that Arthur’s completely oblivious?</p>\n<p>“Arthur? Why’re you staring at me? Do I have something on my face, or have you just forgotten how to hold a conversation again?”</p>\n<p>He <em>does</em>, doesn’t he? He’s probably snickering into his sleeve all the time; it’s hilarious to him that Arthur hasn’t figured it out yet. Actually, set Merlin aside for a second, <em>Arthur</em> thinks it's ridiculous he hadn't noticed. He'd spent all day, every day for <em>four months</em> with Merlin, and half that time he'd been in <em>love</em> with him, and it had taken him until now to realize Merlin was his soulmate? Arthur feels like the biggest fool in the room, which is saying something considering who's in the room with him.</p>\n<p>He can't believe he didn't think to try lying to Merlin when he realized he was in love, but it honestly hadn't crossed his mind. He supposes he'd just unconsciously assumed Merlin wasn't, based on the improbability of going months without even <em>trying</em> to lie to Merlin, and the hundreds of love-at-first-sight soulmate stories he's heard all his life. But that's not important. What's important is that Arthur knows now. So what is he going to do about it?</p>\n<p>Arthur grins. Yes, swooping over and kissing Merlin right now would be <em>highly</em> enjoyable, but there’s something to be said for delayed gratification, too. Merlin’s been laughing at Arthur for ages, and now Arthur can turn the tables on him. He can keep acting oblivious, and start courting Merlin, and see how long it takes Merlin to crack. This is going to be hilarious.</p>\n<p>Arthur can’t wait.</p>\n<p>*</p>\n<p>A few days later, Arthur is at Merlin’s door with a small wrapped gift for him in one hand. Arthur’s got <em>lots</em> of plans for courting Merlin: flowers and candy and picnics and dinners with just the two of them, for a start. And even though he thought this up as a joke to turn the tables on Merlin, he’s also really looking forward to it seriously. It’ll be nice to court Merlin, to treat him like someone precious to Arthur for once, and to make him happy, and …</p>\n<p>Arthur decides to stop smiling at nothing outside Merlin’s door, and barges inside.</p>\n<p>Merlin’s back is to him, so Arthur can’t see Merlin’s eyes, but he knows they’re golden, because everything in Merlin’s room is hovering a few inches off the floor. Merlin must hear him, though, because he frantically ends the spell and whirls around.</p>\n<p>“Did you see that?” he asks.</p>\n<p>“See what?” Arthur asks, as always.</p>\n<p>“Uh, never mind, there was… a total lack of nothing that was not natural to see here! Nothing that wasn’t illegal definitely didn’t not happen here!”</p>\n<p>Arthur cannot, after several moments of trying, figure out what Merlin is saying, although that’s not an unusual occurrence for him. Merlin is weird. But this reminds him of something that makes his heart sink into his boots: Merlin has lied to him.</p>\n<p>Merlin has pretended not to be a sorcerer for <em>months</em>. He must’ve told Arthur countless lies - <em>successful</em> lies - in that time. Merlin can lie to him.</p>\n<p>\n<em>Merlin can lie to him.</em>\n</p>\n<p>Arthur shoves the present down deep into his pocket. He mutters an excuse to Merlin about forgetting what he was doing here. Halfway through Merlin’s teasing reply, he turns and stumbles back out the door. He nearly trips down the stairs in his haste to get away, and maybe because his vision is a little blurry from tears.</p>\n<p>Merlin can lie to him.</p>\n<p>Merlin is Arthur’s soulmate. But Arthur isn’t Merlin’s.</p>\n<p> </p>\n<p>\n<strong>MERLIN</strong>\n</p>\n<p>Arthur’s been acting weird for a couple weeks when Lancelot shows up.</p>\n<p>Lancelot is brave and noble and handsome and wonderful, but the thing is, he’s not Arthur. He isn’t a great big blond prat and apparently, in Merlin’s eyes, that’s a bad thing, so when Lancelot asks him out, Merlin blushes and turns him down as gently as possible.</p>\n<p>“I’m flattered, really I am,” Merlin stammers out. “You’re great! You’re really great. But, there’s someone else. I mean, there’s <em>the</em> someone else, so…”</p>\n<p>“Oh! Oh, congratulations!” Lancelot says. He then takes in the sour look on Merlin’s face and adds, “Or not.”</p>\n<p>“Yeah, well,” Merlin says. “It’s complicated, but… he’s it, for me.”</p>\n<p>Lancelot wishes him luck and is exactly as chivalrous about it as you’d expect him to be. Anyways, there isn’t time for it to be awkward before Lancelot leaves again, as quickly as he’d come.</p>\n<p>And it turns out that the fact that Merlin didn’t ever technically sleep with Lancelot doesn’t stop him from bringing it up with Arthur the next time Arthur’s being a huge prat. It’s not very mature, of course, but who ever said Merlin was mature? And is Merlin <em>really</em> expected to hold on to civility when Arthur’s shoving Merlin’s lack of lover in his face, like it’s not entirely Arthur’s fault Merlin doesn’t have anyone?</p>\n<p>It happens during a night at an inn with Arthur’s knights, who are competing for the serving girl’s favour. Arthur leans over to Merlin and teases, “Not even trying? Have you given up because you know you don’t stand a chance?”</p>\n<p>On one hand, it’s the same sort of insulting mockery Arthur hassles Merlin with continuously about absolutely everything else. If they weren’t soulmates, Merlin would expect and accept this subject of teasing from Arthur as well.</p>\n<p>But Arthur <em>is</em> his soulmate, and he’s rejected Merlin, and Arthur can’t seriously think it’s okay to tease Merlin about not being good enough.</p>\n<p>So Merlin snaps back - hoping this wounds Arthur at least a little, that he experiences at least a fraction of the agony Merlin would in his shoes - “I’ll have you know I’m highly attractive to <em>many</em> people. Lancelot, for one.”</p>\n<p>“Yeah?” Arthur says, and <em>yes</em>, he winces. It makes Merlin feel simultaneously victorious and awful.</p>\n<p>“You slept with <em>Lancelot</em>?” Arthur asks.</p>\n<p>Merlin doesn’t feel awful enough to outright deny it, though. “A gentleman never kisses and tells.”</p>\n<p>Arthur gives a very fake-sounding chuckle. “You’re no gentleman, Merlin, spill.”</p>\n<p>Merlin crosses his arms over his chest and keeps his lips firmly shut.</p>\n<p>If he tells, he’ll lose Arthur’s jealousy - the only proof he has that Arthur cares at all.</p>\n<p>  </p>\n<p>\n<strong>ARTHUR</strong>\n</p>\n<p>Arthur draws his sword and viciously attacks the practice dummies set up on the training grounds.</p>\n<p>He’s in a quandary.</p>\n<p>It’s all Lancelot’s fault. Arthur hates Lancelot.</p>\n<p>No, that isn’t fair. It’s not <em>all</em> Lancelot’s fault. If Arthur hadn’t brought it up, he’d still be blissfully ignorant. If only he hadn’t thought, <em>I should tease Merlin about girls; it’s weird if I don’t</em>, then he wouldn’t have had to listen to Merlin talking about <em>sleeping with Lancelot</em>.</p>\n<p>And he shouldn’t hate Lancelot. Lancelot saved Merlin’s life. He also saved Arthur and Camelot. Arthur shouldn’t detest someone just because his manservant likes them better than he likes Arthur.</p>\n<p>…Arthur hates Lancelot.</p>\n<p>Arthur brutally stabs a practice dummy; straw rains down onto the ground.</p>\n<p>The thing is, even though Arthur feels like he’s being stabbed every time Merlin mentions his admiration of and attraction to Lancelot.</p>\n<p>Even though Arthur has made himself sick thinking about Lancelot and Merlin sharing Merlin’s tiny room with its single, tiny bed.</p>\n<p>Even though Arthur may have cried himself to sleep last night.</p>\n<p>There is one, very small, piece of goodness to come out of this whole debacle with the gryphon and the gorgeous warrior: Arthur now knows Merlin likes men.</p>\n<p>And Lancelot is gone. Which is of course unfortunate, because he was a strong warrior and a valiant knight, but Arthur isn’t going to ignore the positive implications. Specifically: for the moment, Merlin’s heart is free.</p>\n<p>Arthur knows that he isn’t Merlin’s soulmate, and Arthur will, inevitably, always love Merlin more than Merlin loves him. But what if he could have some small amount of happiness with Merlin anyways? He could court Merlin, and even if it doesn’t last, maybe it would be better to have a small taste of what it could be like, than to never have anything at all.</p>\n<p>On the other hand, what if it ruined everything? If asking to court Merlin changed their relationship forever and destroyed their friendship? Arthur has managed to live without courting Merlin so far, and he thinks he could bear it if friendship was all he was ever allowed; but he isn’t so sure he could live with less than that.</p>\n<p>Arthur gives a low yell and hurls his sword into the dirt at his feet. He stares at the small army of practice dummies he has decimated. Suddenly he is exhausted, and sad, and defeated.</p>\n<p>The worst part of having problems with your soulmate, Arthur thinks, is that you can’t go cry on the shoulder of the one person that always makes you feel better.</p>\n<p> </p>\n<p>\n<strong>MERLIN</strong>\n</p>\n<p>Being rejected by his soulmate isn’t exactly a pleasant experience. Merlin can’t bring himself to date anyone else, and his constant solitude (and celibacy) earns him mockery from some and concern from others. Some days he mopes around, wondering what the <em>point</em> is when his life is doomed to never include a partner to share it with. The bards’ stories about soulmates are probably not just there to taunt Merlin, but it feels like it. And some days Merlin can’t keep his bitterness from invading his attitude and he’s going to ruin even his friendship with Arthur at this rate.</p>\n<p>And yet, Merlin swears he would never complain about any of this ever again, if only the damn Princess Deidre would go away.</p>\n<p>The rumours of her and Arthur’s impending betrothal have been flying for days, and it’s making Merlin miserable. Even worse, Arthur <em>isn’t</em> miserable. Usually he frowns and objects when Uther brings up the inevitability of Arthur’s strategically arranged marriage, but he isn’t doing much frowning at the princess.</p>\n<p>They go riding together (Arthur compliments her seat) and on picnics together (Arthur smiles when she politely thanks Merlin for carrying the food and blankets). Arthur gives her flowers and makes her laugh when they sit beside each other at dinner.</p>\n<p>Merlin has never hated anyone this much in his entire life.</p>\n<p>It’s not that he thought he had a <em>chance</em>. He wasn’t that naive. If he had a bloody chance Arthur would’ve mentioned it by now.</p>\n<p>But, okay, maybe a little part of him <em>did</em> wonder if Arthur’s objection to arranged marriages had to do with his soulmate being <em>right here</em>. Maybe that part of him <em>had</em> thought he had a chance.</p>\n<p>*</p>\n<p>Merlin had thought he couldn’t feel worse, until he and Arthur talk, and he discovers that not only does he not have a chance, he apparently isn’t even a <em>consideration</em>.</p>\n<p>Arthur opens the conversation out of the blue. Merlin is just minding his own business, mending Arthur’s shirt (and regretting being snappish with Gwen), when Arthur ambushes him with, “Princess Deirdre is very beautiful.”</p>\n<p>Merlin jabs the needle through his finger. “If you say so, sire,” he mutters, sucking on his injury before the blood can stain Arthur’s shirt.</p>\n<p>“She’s kind, intelligent, a good rider - <em>far</em> better than you,” Arthur says.</p>\n<p>“Right, well, that’s not hard.” Merlin somehow manages to choke out the self-effacing joke despite the needle of pain stabbing his heart. How can Arthur compare Merlin to someone else, and think <em>Merlin</em> is the one who falls short? Merlin is his <em>soulmate</em>, his <em>destiny</em>, how can he -</p>\n<p>“I think she’ll make a very good queen.”</p>\n<p>Merlin gapes at him. Actually, he gapes at Arthur’s back, which is turned to him as Arthur stares out the window, because Arthur isn’t even bothering to <em>look</em> at Merlin for this horrible conversation. It’s not that something interesting is happening outside - all is quiet and it’s dark as pitch out there, clouds covering the full moon, so Arthur can’t be seeing anything but blackness. It’s just that Merlin apparently isn’t worth his attention.</p>\n<p>Merlin closes his mouth before Arthur turns around and demands what Merlin’s problem is. He knows Arthur will get cranky if he doesn’t respond, so he manages a halfhearted, “Oh?”</p>\n<p>“Of course, I obviously don’t love her now,” Arthur says. And then he stops Merlin’s heart with, “But maybe, someday…”</p>\n<p>“<em>Oh</em>,” Merlin repeats, the sound practically punched from him.</p>\n<p>Arthur finally turns away from the window. “Can you say <em>anything</em> else?” he asks, crankily.</p>\n<p>Merlin blinks back his tears and snaps, “I can say <em>clotpole</em>.”</p>\n<p>Arthur smirks. “Congratulations. Anyways. I suppose marrying the princess won’t be so bad.”</p>\n<p>“<em>Really</em> now,” Merlin says.</p>\n<p>Apparently some of his bitterness seeps through - how did that happen! like maybe he has too much to contain or something! - because Arthur scowls and demands, “Just what is that supposed to mean?”</p>\n<p>“Well, I always thought you cared a little about marrying someone you loved?” Merlin says, because he is a fool, an absolute fool, and likes to poke bears and sleeping dragons.</p>\n<p>Arthur’s eyes turn steely and cold. “Did I ask for your opinion, Merlin? No. And frankly, your opinion on who I should marry is completely irrelevant.”</p>\n<p>“<em>Oh.</em>”</p>\n<p> </p>\n<p>\n<strong>ARTHUR</strong>\n</p>\n<p>A week later, Uther tells Arthur that the treaty is going to be possible without a marriage, and that Arthur would be better off marrying a richer princess anyways. Arthur is perhaps a little rude in receiving this news, because his manservant hasn’t been speaking to him in a week and he discovered partway through this meeting that his shirt has a huge and only half-mended hole in it. Uther doesn’t notice, though, as he thanks Arthur for his cooperation and praises him on his dedication to his duty.</p>\n<p>Afterwards, Arthur goes back to his quarters to change his shirt. Merlin is there, cleaning his armour in total silence.</p>\n<p>Arthur’s been trying to keep up their conversations, no matter how one-sided they’ve been lately, and Uther’s news is good in that it gives him a new topic. As Merlin brings him a new shirt without actually looking at him, Arthur tells him about it.</p>\n<p>“So I’ve just been to see my father,” he says. “Apparently I’m not to be asked to marry Deidre after all. Her father asked for help from some of Camelot’s knights, you see, and Father thinks that having some of our knights move to his lands will be almost as solid a link between us as a marriage.”</p>\n<p>Merlin’s eyes actually flick towards Arthur. Encouraged, Arthur goes on, “So nothing’s to come of it, although I suppose it wasn’t a total waste of time to court Deidre. At least I know now that it won’t be so horrible to marry a princess - might actually be quite nice.”</p>\n<p>Apparently that was the wrong thing to say, as Arthur now has two ripped shirts.</p>\n<p>*<br>\nArthur endures another entire week of Merlin being respectful and subservient and just generally giving Arthur the cold shoulder before he cracks.</p>\n<p>“By your leave, highness,” Merlin says as he goes to leave for the night.</p>\n<p>“Merlin, wait,” Arthur says to his back. “Look, I’m <em>sorry</em>, all right? I don’t know exactly why you’re mad, but I know I’m, well, a bit of a clotpole sometimes, so I’m sure you’re in the right - but will you just forgive me and be my friend again? Please?”</p>\n<p>Merlin’s shoulders are stiff, and there’s a few moments of silence. Arthur waits. Then Merlin blows out a huge breath of air, shoulders relaxing, and turns around. His eyes are bright and wet.</p>\n<p>“You’re a <em>huge</em> clotpole. The absolute biggest,” Merlin says.</p>\n<p>It’s the first time Merlin’s insulted him in <em>days</em>, which makes it the most beautiful thing Arthur’s ever heard.</p>\n<p>“Try not to make me regret apologizing already,” Arthur says, and throws a pillow at him.</p>\n<p>Merlin goes, and Arthur’s chest feels lighter knowing they’re back to normal, even if normal is nothing near what Arthur actually wants.</p>\n<p> </p>\n<p>\n<strong>MERLIN</strong>\n</p>\n<p>Merlin has given up all hope of living with his soulmate by the time he and Arthur get captured by enemy soldiers just outside Camelot’s border. (What were they doing in hostile territory outside the border? you may ask. It has absolutely nothing to do with Merlin running away from a bear, thank you very much.)</p>\n<p>Fortunately, their cell isn’t closely guarded, and they quickly liberate themselves into the relative freedom of the maze-like castle they were stashed in. Unfortunately, there’s about twenty guards and soldiers between them and the way out - and they don’t even have any weapons.</p>\n<p>“I’ll distract them,” Merlin hisses. “You run.”</p>\n<p>Merlin is about to jump out at the guards without waiting for agreement - Arthur can’t argue with the logic that the crown prince’s life is more important than a servant’s, after all - but he’s quickly yanked back by a strong grip on the back of his neckerchief.</p>\n<p>“I’m not letting you sacrifice yourself for me,” Arthur says. “There must be another way out.”</p>\n<p>“Must there?” Merlin says sarcastically. “Every second we waste arguing about it means we’re that much closer to <em>both</em> of us being caught.”</p>\n<p>“Fine,” Arthur says. “Then <em>you</em> run, and <em>I’ll</em> distract them.”</p>\n<p>Merlin laughs humourlessly. “Arthur, even if you weren’t the prince of Camelot, I would never let you do that. I’m not living without you. <em>I</em> can’t bear living without my soulmate, but <em>you</em> were planning to anyways. So just leave me and <em>go</em>.”</p>\n<p>“What?” Arthur says. He’s staring at Merlin in shock, his grip on Merlin’s neckerchief loosening like he’s forgotten all about the enemy guards that Merlin wants to throw himself at. “What - I’m not - but you can lie to me!”</p>\n<p>Arthur didn’t <em>know</em>? “Wait, you didn’t <em>know</em>?” Merlin demands. “Test it, right now, tell me you’re a dancing bear.”</p>\n<p>“I know <em>I</em> can’t lie to <em>you</em>,” Arthur says. “But you can, to me.”</p>\n<p>“When have I ever lied to you?”</p>\n<p>Arthur stares pointedly at him and says, in an imitation of Merlin that for some reason involves a very high-pitched voice, “No, Arthur, I’m not a sorcerer! It’s just that I have very good luck and trees have very weak branches!”</p>\n<p>What.</p>\n<p>Merlin was ready to have a conversation about how he and Arthur are utterly doomed soulmates. He’s been preparing for this conversation for a while now. He’s pictured having it in various different situations, from yelling it in front of the court to whispering it under the covers of Arthur’s bed. He’s <em>more</em> than ready.</p>\n<p>He is not ready to have a conversation about how he’s a sorcerer and <em>Arthur apparently knows</em>.</p>\n<p>He steps back. “Oh <em>gods</em>,” he says, and then puts the sorcerer thing aside for a minute - because what <em>else</em> is he supposed to do with it - and addresses the other issue at hand. “I think you’ll find what I said was, ‘yes Arthur I’m the most powerful sorcerer you’ll ever meet,’ and then I relied you being too much of <em>an enormous clotpole</em> to believe me.”</p>\n<p>Arthur takes a minute to think about this, then he whispers, “Oh.”</p>\n<p>Merlin takes that minute to think as well, about what must have been going through Arthur’s mind, if he thought Merlin could lie to him. When he realizes, he wants to wrap Arthur up in a big hug and never let go. “You thought I didn’t love you?” he asks.</p>\n<p>“Yes,” Arthur admits. “And...so did you?”</p>\n<p>Merlin shrugs slightly. “I thought you loved me, just… not enough.”</p>\n<p>“Well, I’ve always said you’re an idiot,” Arthur says. “I guess now we have proof.”</p>\n<p>“And you’re a prat,” Merlin says.</p>\n<p>They beam at each other.</p>\n<p>“So,” Arthur says. “How’s this for a plan: you knock all those men out with magic, and then we run away and make out?”</p>\n<p>“Sounds good to me,” Merlin says.</p>\n<p> </p>\n<p>\n<strong>EPILOGUE</strong>\n</p>\n<p>It always seems, during their life-or-death experiences, that life won’t go back to normal afterwards. It seems impossible to go on as usual after, for example, Arthur nearly sacrifices his life for Merlin’s, or gives one of his grand speeches about equality. Still, somehow Merlin always ends up back to polishing armour and fetching meals, with only a new scar or two to show for their adventures, and this time is no different.</p>\n<p>“Merlin, once you’re done staring at absolutely nothing, how would you like to polish my armour?”</p>\n<p>“I’d love to, sire,” Merlin says. He stretches out a hand and his eyes flash gold, and the armour starts polishing itself. He smiles cheerfully at Arthur, and then flops back onto Arthur’s bed.</p>\n<p>Well, maybe this time is a little different.</p>\n<p>Arthur smiles back as he reclines in his chair. It’s not a very restful smile; it’s almost predatory. “You know what I find amusing, Merlin?”</p>\n<p>“I imagine you find many small things amusing, such as poop jokes and children’s clowns,” Merlin says.</p>\n<p>“You can’t lie to me,” Arthur says, ignoring Merlin’s hilarious witticisms. “You really would love to polish my armour. You like to pretend you’re being sarcastic, but you forget that I know now that everything you say to me is completely true.”</p>\n<p>Merlin blushes and tries to redirect with, “Took you long enough.”</p>\n<p>Arthur cannot be distracted. He goads, “I know I’m your favourite person. You liiiike me.”</p>\n<p>Merlin retorts brilliantly, “I do <em>not</em>.”</p>\n<p>Except, of course, he obviously <em>doesn’t</em> say that, because it is the opposite of true. Instead what comes out is, “I like you a lot.”</p>\n<p>Arthur grins in delight. “I bet you think I’m handsome.”</p>\n<p>“Ridiculous,” Merlin says, because it is: “It is ridiculous how adorable you are. I mean, you’re easily the most handsome man in Camelot, but you’re just so <em>cute</em>.”</p>\n<p>“I am a <em>warrior</em>,” Arthur says. “I have been trained to kill from <em>birth</em>, I am not <em>cute</em>.”</p>\n<p>Merlin sits up, realizing he has the upper hand. “But Arthur, I can’t lie to you, and I think you’re <em>adorable</em>. You’re the absolute <em>cutest</em>. You’re like, so beautiful and cuddly and I just <em>can’t</em>.”</p>\n<p>“You’re the adorable one!” Arthur argues. “With your ears and your … everything. You’re the cute one!”</p>\n<p>Merlin stares at him, and Arthur stares back. Finally Merlin breaks and starts giggling.</p>\n<p>If all he and Arthur have to fight about is who’s cuter, Merlin thinks they’ll be okay.</p>"
}