{
  "id": "826928",
  "url": "https://archiveofourown.org/works/826928?view_full_work=true",
  "author": [
    "briecheesie",
    "daunt"
  ],
  "title": "A (Sort of) Fairytale",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings",
    "No Archive Warnings Apply"
  ],
  "categories": [
    "Gen",
    "F/M",
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Stiles Stilinski & Scott McCall Friendship",
    "Allison Argent/Scott McCall",
    "Lydia Martin/Jackson Whittemore",
    "Vernon Boyd/Erica Reyes"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale",
    "Scott McCall",
    "Allison Argent",
    "Lydia Martin",
    "Jackson Whittemore",
    "Erica Reyes",
    "Vernon Boyd",
    "Isaac Lahey"
  ],
  "additional_tags": [
    "Alternate Reality - Post Season 2/Disregards Season 3",
    "Epic Friendship",
    "Magic Curse",
    "Hurt/Comfort",
    "Romance",
    "Angst",
    "Teen Wolf Reverse Bang"
  ],
  "language": "English",
  "series": "",
  "published": "2013-06-04",
  "completed": null,
  "words": "25,800",
  "chapters": "1/1",
  "comments": "694",
  "kudos": "15,760",
  "bookmarks": "6,065",
  "hits": "238,704",
  "summary": "<p>The summer after senior year starts normally enough, with the gang spending their final months before college together at the Martin family's lake house. Then Jackson stumbles onto the burial ground of a witch's ex-husband, Stiles is magically turned into a fox, and things somehow manage to get worse from there. The gratuitous <i>Princess Bride</i> references are only of moderate help.</p>\n<p>Art by <a href=\"https://daunt.tumblr.com\" rel=\"nofollow\">Daunt</a>.<br>Story by <a href=\"https://briecheesie.tumblr.com\" rel=\"nofollow\">Brie</a>.</p>",
  "notes": "<p>This was actually for the Teen Wolf Reverse Bang due in January, but unfortunately there were delays in production from both artist and author, so here it is over five months later, oops. Continues in the same universe as Season 2 and thus totally disregards and ignores everything about Season 3, including the existence of new characters and old characters leaving. </p>\n<p>Art by <a href=\"https://daunt.tumblr.com\" rel=\"nofollow\">Daunt</a>.<br>Story by <a href=\"https://briecheesie.tumblr.com\" rel=\"nofollow\">Brie</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>&lt;3 <a href=\"briecheesie.tumblr.com\" rel=\"nofollow\">brie</a> &amp; <a href=\"daunt.tumblr.com\" rel=\"nofollow\">daunt</a></p>\n<p>Thanks for reading!</p>\n<p> <img src=\"http://i.imgur.com/PaWHuzQ.png?1\"></p>",
  "text": "<p align=\"center\">\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB-title-small.jpg\" alt width=\"700\" height=\"478\">\n<u>\n<br>\n</u>\n</p>\n<p align=\"center\">\n<strong> </strong>\n</p>\n<p align=\"center\">\n<strong> </strong>\n</p>\n<p>\n<em>Well, who said life is fair? Where is that written? Life isn’t always fair.</em>\n</p>\n<p><em>–</em>       <strong>The Princess Bride</strong></p>\n<p> </p>\n<p> </p>\n<p></p>\n<p> <img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\"></p>\n<p> </p>\n<p>“It could be worse,” are Derek’s first words when it happens, the implication of “at least you’re not dead,” and “at least you can still talk,” and “opposable thumbs aren’t really that great anyway,” sitting thinly above the uncomfortable tone. It’s marginally better than Scott’s reaction, but only because Derek hasn’t passed out from blood loss and there’s not a gaping wound in his side.</p>\n<p>Stiles would sigh, but he’s not sure his current body is capable of such a reaction.</p>\n<p>Instead, he headbutts Derek in the gut.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The summer after senior year starts with tears, the required hugging, fond farewells, and Lydia demanding that everyone spends the next few months at her family’s old lake house, just outside the county line of Beacon Hills. Come fall, they’ll be scattered across the state and country - some as far away as the Northeast coast - and she refuses to waste the summer apart, only seeing each other when they need her expertise in dead languages.</p>\n<p>The fun lasts all of a week, with even Derek letting loose on the tire swing, before Jackson stumbles onto a cursed burial ground containing the ex-husband of an angry witch (because witches, why not?).</p>\n<p> It all goes to hell from there.</p>\n<p>Derek, Erica, and Boyd suggest the all-out offensive approach, attacking with everything they’ve got. Scott suggests they try to talk to the witch. Stiles suggests they offer Jackson as a sacrifice.</p>\n<p>Predictably, no one gets on board with Stiles’ idea. Which is why he thinks everyone shares the blame when the witch sarcastically compares him to a fox - clever and pretending he’s an animal with the wolves - and Stiles finds himself walking on four legs moments later.</p>\n<p>The witch and her dead ex-husband disappear after that.</p>\n<p>Deaton is pretty useless, with a promise to check in if he finds anything.</p>\n<p>Jackson sort of apologizes for the mess he’s caused.</p>\n<p>Scott heals just fine.</p>\n<p>Stiles is still a fox.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Growling, Stiles takes a running leap at Derek, legs tangling clumsily in his now oversized red hoodie as his paws awkwardly hit the ground. He manages it anyway, headbutting Derek right in the gut, and Derek grunts, the attack catching him off guard as he gets shoved into the tree behind him by the surprisingly strong little animal. He slides down the trunk until he’s sitting on a damp bed of leaves, which just barely protect him from painful knotting roots underneath. It’s uncomfortable, but preferable to the raging glare coming inches from his face, annoyed brown eyes somehow still the same even when surrounded by red fur.</p>\n<p>“You will <em>fix this</em>,” Stiles hisses, a paw coming up to poke threateningly at Derek’s chest. The sleeve of his hoodie covers it, dangling far below where his foreleg ends, and the sight only fills Stiles with more rage.</p>\n<p>“Wh-“ Derek tries to get out, expression completely bewildered. He glances up helplessly at the others, who respond with either concerned looks or hopeless shrugs. Stiles snaps his teeth and Derek turns his face back to him.</p>\n<p>“This? This is <em>your</em> fault,” Stiles growls, paw poking again. This time Derek peeks over specifically at Jackson, who’s doing an excellent job of finding the moss on a rock interesting.</p>\n<p>“But,” Derek argues, feeling a pressure beginning to build behind his eyes, “How-“</p>\n<p>“<em>Your fault</em>.”</p>\n<p>Derek allows a growl of his own to escape, tempted to experiment and see if his alpha powers will work on all supernatural canines. He doesn’t shove Stiles off him, reminds himself that the kid is no bigger than a bob cat, and less than gently picks him up from his lap instead, dropping Stiles in the dirt next to him. Stiles bristles at the treatment.</p>\n<p>“I’m not the one who decided to go off on his own and piss off a witch,” Derek snaps, gesturing toward Jackson in a way that he hopes conveys how very much he wishes they had gone with Stiles and sacrificed the asshole.  The response isn’t enough to appease Stiles, who leaps to his feet and starts an odd hopping motion from side to side, riled up as if he’s ready to pounce.</p>\n<p>“Dude! He’s <em>your</em> beta!” Stiles barks, “You’re supposed to have that shit on lockdown!”</p>\n<p>“Excuse me,” Jackson speaks up finally, stepping forward with his lips curled in disdain. “I am <em>no one’s</em> beta.”</p>\n<p>Lydia shushes him before Stiles can act on the impulse to bite a chunk out of Jackson’s thigh; she pets his chest patronizingly, muttering a cloying, “Not now, honey.”</p>\n<p>Rolling his eyes, Derek pushes himself up from the ground. He brushes the dirt off his pants, front and back, and steps over Stiles to head back toward the lake house.</p>\n<p>Stiles contemplates finding something of his to pee on.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB-final-small.jpg\" alt width=\"800\" height=\"618\">\n</p>\n<p> </p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>It takes a day, during which time Stiles finds every single way to be a pain in the ass to Jackson short of actually biting him, but Deaton’s SUV eventually makes its way up the dusty driveway. He comes inside and sets his briefcase on the kitchen table. When he opens it, revealed is what seems to be a mix of CSI equipment and things more likely found in a magic shop.</p>\n<p>“Uh, are you gonna do experiments on me?” Stiles wonders nervously, trying to scuttle off the kitchen table. “'Cause I’m not so okay with that.”</p>\n<p>Scott stands behind Stiles, blocking his exit, and puts a comforting hand on his back to hold him in place.</p>\n<p>Deaton laughs.</p>\n<p>“Don’t worry,” he assures, voice warm, “I’m just going to take a few samples of your fur, saliva, and skin cells to see if there’s any magic I can trace.”</p>\n<p>“Ehhhhh,” Stiles wiggles, not sure he wants to go through whatever the process of that entails. “I don’t-“</p>\n<p>Rolling her eyes, Lydia grabs a brush from Deaton’s kit and steps forward, dragging the bristles down Stiles’ back hard enough that the teeth dig into his skin. He shivers at the feeling, something tingly traveling over his spine.</p>\n<p>“There,” she says, holding the brush out to Deaton. “Hair and skin cells.”</p>\n<p>Deaton takes the brush with visible amusement, placing it inside a clear plastic bag and zipping the bag shut.</p>\n<p>Without asking, Lydia digs through Deaton’s things again, coming up with a petri dish. She uses her perfectly manicured nails to pry it open, then holds the bottom half under Stiles’ mouth.</p>\n<p>“Lick,” she commands. He does so, too startled to do much else, and watches as she snaps the petri dish shut, handing that to Deaton as well.  She smiles disarmingly, gives a feminine shrug of her shoulders as she says, “All done!”</p>\n<p>Deaton shakes his head with a wry grin as he places the petri dish securely back into his briefcase.</p>\n<p>“All right,” he begins, pulling out a few more sampling kits. “Who’s going to show me where this witch’s burial ground was?”</p>\n<p>Scott goes to volunteer, but Lydia cuts him off with a look.</p>\n<p>“I think Jackson would like to go,” she offers sweetly. An indignant noise escapes from Jackson’s mouth. He folds his arms across his chest, taking a step back.</p>\n<p>“I’m not going to-“</p>\n<p>“Jackson!” Lydia snaps, then smiles again as she regains her composure. “You were the one who found it in the first place remember?”</p>\n<p>There’s a very audible threat under her words.</p>\n<p>“I…” Jackson grimaces, shoulders sagging as he sees no way out. “Fine. Whatever.”</p>\n<p>Turning toward the door, he mutters, “Follow me,” lowly, as if hoping no one would hear him and actually heed his words.</p>\n<p>Unfortunately for Jackson, Deaton is trailing right behind him.</p>\n<p>As soon as they leave, Lydia begins caressing Stiles’ back thoughtfully, lips pursed as she considers him.</p>\n<p>“You know,” she says, after watching him long enough that Stiles is beginning to feel anxious, “I’ve always wanted to see what wearing fox felt like.”</p>\n<p>“Uhhh,” Stiles glances around the room, makes sure Scott is still within close range. “You know what, that’s really interesting, Lydia, thanks for the info. I’ll keep that in mind for your next birthDAY-!” His words end on a squeak as Lydia lifts him off the table, draping him around her neck like an old fashioned shawl.</p>\n<p>“What do you think?” she asks Allison, posing dramatically, throwing Stiles’ tail over her shoulder like it’s not a fucking appendage. Allison giggles, reaching over to scratch behind Stiles’ ear.</p>\n<p>“I don’t think your accessory likes it very much,” she says with a smile. When Lydia scoffs, the movement of her shoulders jostles Stiles.</p>\n<p>“My accessory has an infinite wardrobe of plaid,” she breezes, “He doesn’t get a say in fashion.”</p>\n<p>“Wow, this really blows,” Stiles tries conversationally.</p>\n<p>As expected, he’s ignored in favor of Lydia asking Allison about the shade of lip-gloss she’s wearing, which is somehow more important than the fact that one of her best friends is a fox and currently wrapped around her neck in a sick facsimile of something dead and stuffed.</p>\n<p>He shoots Scott a pleading look, but his best friend just shrugs helplessly.</p>\n<p>This is going to be a fucking terrible summer.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p>\n<em> </em>\n</p>\n<p>\n<em>Isn’t that a wonderful beginning?</em>\n</p>\n<p><em>–</em>       <strong>The Princess Bride</strong></p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>A furry ear twitches at the first chirps of morning, catching the sounds of birds waking from miles away where the sun has already risen.  It’s still dark out, there’s still silence from the immediate vicinity, but Stiles hears the birds, <em>feels</em> morning, and when he peeks an eye open, the clock on the TV unit says it’s barely after four.</p>\n<p>His irritation makes its way out of him as a snarl and he starts up, surprising himself with the noise. A glance around the room informs him that Erica and Boyd are still asleep, curled around each other, and he takes a moment to consider how entirely unfair it is that neither of them have been forced awake by birds in the next county over. </p>\n<p>Jumping down from his perch on the sofa chair, he quietly makes his way to the door, paws barely making any noise against the wood. It had taken him a full day to figure out how to walk without his claws extended, and he appreciates that skill now as he awkwardly noses the door open as silently as possible.</p>\n<p>He creeps through the hallway, listening to the snores coming from Jackson and Lydia’s room, can hear the sheets rustling as Isaac tosses and turns a few doors down.  Carefully, he hops down the steps, fighting back a yawn.</p>\n<p>When he gets downstairs, he ignores Scott and Allison on the couch, where they fell asleep watching movies, and wanders straight to the kitchen. In the corner, by the garbage can, are two bowls on the ground, and as he approaches, a pitiful whimper escapes before he can stop it when he realizes they’re empty.</p>\n<p>“This fucking sucks, man,” he mutters to himself, padding over to the fridge. He stares up at the looming appliance, trying to measure the distance from the floor to the handle. He’s kind of scrawny for a fox, but he’s not small; he knows he can theoretically make it easily. Length and height don’t help him, though, when he’s not sure he can control his limbs enough yet to pull off the task.</p>\n<p>Rearing up onto his hind legs, Stiles drops his front paws against the fridge, bringing him level to the handle. He considers trying to use his arms to drag the fridge open, then decides on his mouth being the more effective option. He grips the handle in his jaw and pulls, squeaking when the door flies open and he falls, hitting the island roughly.</p>\n<p>From the couch, Scott mumbles something and Stiles can hear the springs creak as someone gets up. The lighter footfalls means it’s Allison, and within a few seconds she’s appearing around the corner, looking sleep mussed and confused.</p>\n<p>“What are you doing?” she wonders, blearily gazing at the fridge.  Her eyes wander from the fridge to the empty bowls on the floor and she tsks as she wipes the sleep from her eyes.</p>\n<p>“Jackson forgot to feed you last night,” she sighs, “Of course.”</p>\n<p>“I don’t need someone to feed me,” Stiles snaps, bristling at the way she smiles at him and nods.</p>\n<p>“Of course not.”</p>\n<p>Rolling his eyes – which is more like rolling his head in this vulpine body – Stiles leaps onto the kitchen island, tail flopping behind him as he sits by the edge.</p>\n<p>“I want waffles.”</p>\n<p>Allison shoots him a skeptical glance over her shoulder, pulling out the orange juice.</p>\n<p>“It’s not even five yet,” she retorts. She places the juice bottle by Stiles and reaches down to grab one of the bowls. “It’ll wake everyone else up.”</p>\n<p>Stiles makes a snorting sound, claws tapping against the countertop as he fixes her with the best unimpressed stare he thinks his face can manage.</p>\n<p>“Allison, I’m a fucking fox. Do you really think my priority right now is other people’s comfort?” He pauses. “Has my priority <em>ever </em>been other people’s comfort?”</p>\n<p>Laughing softly, she drops the bowl next to the juice and reaches over to scratch Stiles behind the ear. He resists for all of a second, before letting out a pleased noise, tilting his head to give her better access.</p>\n<p>“You’re right. You’ve always been kind of an asshole,” she says fondly. Stiles takes a little pride in it.</p>\n<p>“Okay, waffles it is,” she decides, grinning at the way Stiles’ tail begins to beat rapidly against the counter.  He looks over when he hears Scott coming, the boy yawning as he blindly tumbles into the kitchen.</p>\n<p>“Waffles?” he mutters, still half-asleep.  Allison kisses him on the cheek and shoves him into a stool at the island, where he drops his head down into his arms. Stiles feels a weird urge to sidle over and curl up beside him.</p>\n<p>He gives in when Allison begins mixing the batter, tucking himself beside the crook of Scott’s neck, dropping his front paws on top of his best friend’s head. It’s warm and he feels safe and cozy and he wonders if this is what being a cat is like.</p>\n<p>It’s an hour later when he wakes up from the nap he slipped into, only budging because Scott is moving. Derek and Isaac have joined them in the kitchen, talking to Allison as she takes the pancake batter out of the fridge to start preparing breakfast, and Stiles wonders how he could have slept through it when birds singing a mile away had kept him awake this morning.</p>\n<p>Scott shifts positions, softly snoring again, and Stiles thinks maybe he could go back to sleep even with the added noise. He thinks back to cats, thinks about the fact that he was alone on the chair in the guest room and now he’s with his best friend and maybe it’s instinct – maybe his foxbrain doesn’t feel like it needs to be as alert when he’s secure.</p>\n<p>He’d dwell on it further, but then Isaac is gently running his fingernails over Stiles’ back, scratching at the skin beneath the fur and Stiles still can’t get over how certain touches make his mind go blank.</p>\n<p>“You’re gonna spoil him,” Derek snorts from somewhere above.</p>\n<p>“Bite me,” Stiles mutters. After a moment, Derek’s hand lands on his head, rubbing between the ears. With the smell of waffles in the atmosphere and hands caressing him as he lays on top of Scott, Stiles thinks that maybe being a fox for a few days isn’t going to be so bad.</p>\n<p>His opinion changes by the time breakfast is served and Stiles’ plate is set on the floor by Scott’s feet.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB02-scottstiles.jpg\" alt width=\"600\" height=\"433\">\n</p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“This sucks,” Stiles groans for not the first time, head dangling upside down. He watches from the couch as Isaac and Boyd play Mortal Kombat on the SEGA console Boyd had brought with him.  Isaac is pressing all the wrong buttons and Stiles would run over there and grab the control out of his hands if he could.</p>\n<p>Allison scratches his tummy as she reads her book and Stiles pretends not to love it.</p>\n<p>“We’re working on it,” Jackson snaps, lounging in a chair and clearly not working on it. Stiles huffs, rolling over.  Shaking his fur out, he stretches, hearing some bones crack, then crawls into Allison’s lap. She makes an amused noise and runs her fingers through his fur.</p>\n<p>Scott walks into the room, takes in the sight and says, “Dude, get off my girlfriend.”</p>\n<p>“I’m a fucking fox,” Stiles retorts, because that’s become his go-to defense for anything he does that might not be kosher.  He may be among werewolves, but he’s pretty sure none of them have ever been an <em>actual</em> animal before, and so his trump card remains an active weapon that he utilizes as much as possible.</p>\n<p>Scott rolls his eyes and wanders over, shoving Stiles off of Allison’s lap. Stiles barks at him, a noise that surprises them both, then scowls and looks away to hide his embarrassment.</p>\n<p>“Did he just <em>bark</em>?” Jackson chokes, a snort or two away from laughing. Stiles bares his teeth, provoked, but Scott chucks a pillow at Jackson’s head before Stiles can embarrass himself further with another feral sound.</p>\n<p>Good ol’ Scott.</p>\n<p>With a little leap, Stiles drops down to the floor from the couch. He makes a purposely threatening noise as he passes by Jackson, mutters something about potentially having rabies and not being afraid to test it on the boy, then skips out of the room before Jackson can take a swing at him.</p>\n<p>As soon as he’s clear, he hears Allison tell Jackson that he’s an asshole, and he can tell by the way he hears fabric shift that Jackson’s only real response is to shrug.</p>\n<p>Stiles still isn’t sure why they didn’t just sacrifice him.</p>\n<p>Making his way up the steps a few at a time, Stiles turns to head to his little pile of blankets in Erica and Boyd’s room, when the sound of typing makes his ears twitch. Everyone was downstairs except for Derek and Lydia, and the shower running down the hall in the master bedroom tells Stiles exactly who it is. He follows the rapid taps to Derek’s door as he expected, sticking his nose in the crack and pushing it open.</p>\n<p>Derek doesn’t look up from the computer he’s working on, but his fingers slow over the keyboard.</p>\n<p>“They get sick of you already?” he asks dryly, clicking to a browser tab with some kind of foreign language on it. Stiles snorts, approaching the desk with curiosity.</p>\n<p>“I got sick of <em>them,”</em> he answers, standing up on his hind legs to rest his paws on the corner of the desk. “What’re you doing?” he wonders, arching his head to see the screen.  The language doesn’t get any easier to read up close. He notices a window blinking in the taskbar.</p>\n<p>“I’m seeing if any of my contacts from up north have any idea how to make you look less ridiculous,” Derek retorts, glancing at Stiles from the corner of his eye. Stiles lets the dig go, instead focusing on the more interesting part of that sentence.</p>\n<p>“’Contacts’?” he grins, jumping up so that he’s perched fully on the desk. He leans forward into Derek’s space. “Dude. <em>You</em> have <em>contacts</em>? Like have your people call my people?”</p>\n<p>“My people <em>are </em>your people,” Derek grunts, lifting a hand to shove Stiles’ snout away. “When Peter moved up there, he got involved with the supernatural community and they’ve got more than just werewolves. They might know something.”</p>\n<p>Stiles pauses, looking between the screen and Derek. He repeats the motion a few times, then makes what he thinks might be a foxy sound of amusement, and smoothly slips into Derek’s lap before the man has a chance to react.</p>\n<p>“I didn’t know you cared, you big burnt marshmallow,” he preens, shifting so that he can easily see the monitor.  He knows Derek is rolling his eyes.</p>\n<p>“You peed on my jacket,” Derek responds blandly, but he doesn’t try to force Stiles off of him. Instead, he clicks on the blinking tab where Stiles sees someone has sent Derek a list of links waiting to be searched. “I want you human as soon as possible so I can punch you and not feel bad.”</p>\n<p>“Uh huh, sure sure,” Stiles says, eyes scanning the list of links. “Do that one.”</p>\n<p>“Specific would be better.”</p>\n<p>Stiles huffs and reaches a paw out to awkwardly move the mouse so that the cursor is hovering over the link he wants.  Derek bats his paw away and clicks.</p>\n<p>Stiles is pretty sure that Derek is just tired of researching when he basically hands Stiles the reins an hour later, letting the fox decide what to search for and what to select as he acts as Stiles’ hands.</p>\n<p>They don’t get much closer to any solid results, but Stiles feels a little less useless than he had lying on the couch.</p>\n<p>He’ll take what he can get.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Did you find anything?” Scott murmurs, already half asleep, as Stiles uses his teeth to drag his blankets into the room; his fox excuse did little to prevent him from being sexiled by Boyd and Erica. His voice is muffled from the sheets, but he’s pretty sure Scott gets the message that his answer is an irritated negative.</p>\n<p>“Something will turn up, man.” Scott sounds less certain and more close to passing out, so Stiles doesn’t take much stock in what he says.</p>\n<p>Allison comes out of the bathroom, smelling clean and minty. She takes the blankets from Stiles, placing them on the room’s sofa chair, and makes a comfortable nest out of them. Stiles feels his tail wag, pleased.</p>\n<p>“You’re the only one who doesn’t get rabies,” he promises, unable to help himself from leaning into her fingers scratching his chin. She chuckles and wishes him goodnight, then steps over to the bed.</p>\n<p>Stiles hops onto the chair, snuggles into the blankets, and tries to sleep.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The birds wake Stiles again, obnoxious chirping long before the sun rises.  Scott is snoring and Allison is curled next to him, breathing soft and steady.  Carefully, he makes his way off the couch and through the cracked open door.  It was Isaac’s turn to leave food for him last night, so he’s sure there’s water and some dry cereal down there waiting for him in those stupid bowls. He creeps down the steps as quietly as possible in a house full of werewolves and pauses when he hears noise from the kitchen. He sniffs the air, the scent of lavender shampoo hitting him. As he wanders into the kitchen, he finds Erica sitting on the island as he expected, munching on a few crackers.</p>\n<p>“Hey, cutie,” she grins when she sees him. Stiles rolls his eyes at the name she’s taken to calling him, making his way to his food bowl.</p>\n<p>“I’m not cute,” he mutters, between licks of water. “I’m a lean, mean, fighting machine. Rawr.”</p>\n<p>“’Course you are,” she patronizes, pushing off the stool to kneel beside him. Her sharp nails dig into the skin of his back and his body shudders involuntarily in pleasure.</p>\n<p>“I’m gonna fucking bite you,” he growls in irritation. She laughs.</p>\n<p>“And?” she says, using both hands to give him a good rub down.</p>\n<p>Stiles isn’t sure how he ends up lying on the floor with his belly exposed to Erica’s scritches – it’s possible he blacked out – but she knows just where to hit and it’s so much easier for Stiles to just go with it.</p>\n<p>“Whatever,” he grunts, foot thumping obscenely against the ground. “Just don’t start cooing.\"</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The face looking back at Stiles is orange and fuzzy, something he doesn’t think he will ever get used to seeing reflected. Baring his teeth reveals four fangs that melt off into jagged little mountains toward the back of his jaw and, after spending the last part of his life surrounded by werewolves, they’re not very impressive. He snarls at the mirror, just to see what kind of shape his face makes.</p>\n<p>“Scary!” Isaac shouts as he passes by the bathroom.</p>\n<p>“Hey, go fuck yourself!” Stiles returns with mock cheer.  Scowling, he leans forward and opens his mouth to let his breath fog up the glass. When the mirror is sufficiently cloudy, he uses his nose to draw a poor approximation of a human face.  Sitting back and looking at it just makes him feel worse.</p>\n<p>His ears twitch at the sound of hushed human voices, the murmur somehow louder and more distinct than the previous tones of casual conversation. Curious, he drops from the bathroom sink and lightly treads along the hallway to the top of the staircase, pausing when he's able to make out the noise more clearly.</p>\n<p>\"There has to be more that we can do,\" Scott is muttering, sounding almost like he's having as hard of a time as Stiles is with the new situation. Stiles gives him bro-points for the sympathy pains. Lydia clicks her tongue and huffs.</p>\n<p>\"We've gone to the local libraries, where I have <em>personally</em> poured over everything we've found. We have Deaton and the resources in New York working on it, and Derek's trying, too. I'm not sure what you think we can do unless you want us to all pile into the Mystery Machine and travel accross the country looking for answers.\"</p>\n<p>Scott grunts a a weak affirmation and the disheartening news is not exactly the way Stiles had hoped that conversation would end.</p>\n<p>Still, he does have to admit that he'd make an awesome Scooby.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles has learned two very important things over the past three years about Allison Argent, and both are directly related to each other:</p>\n<p>Boyd, in spite of the incident several years ago when Allison nearly shot him to death, is currently failing to keep those things in mind. He smirks as he knocks her Jigglypuff off the virtual island in Super Smash Bros. for the final time, resulting in his victory.</p>\n<p>She smiles, nods, bites her bottom lip a little, and says, “Okay, I think I understand now.”</p>\n<p>Stiles buries his head in Scott’s shoulder for their next round, because managing his second hand embarrassment was never something he was good at.</p>\n<p>Over the cursing and laughter, Stiles hears heavy footsteps trekking up the stairs. With Boyd losing his dignity in front of the TV, Stiles realizes that it must be Derek, the only other person in the house with such a weighted gait. He moves away from Scott and jumps off the couch, trotting over to the stairs.</p>\n<p>When he gets there, he can still smell Derek in the air. He takes the steps two at a time and doesn’t bother doing anything else but unceremoniously barging in.</p>\n<p>Derek’s just on the computer, the TV on in the background, and it’s a little bit of a letdown that he didn’t catch Derek doing something embarrassing.</p>\n<p>“Need something?” Derek asks without taking his eyes off the screen, and Stiles realizes that Derek probably heard him coming when his paw touched the first step. Being a fox apparently doesn’t mean that Stiles is any closer to getting the jump on Derek.</p>\n<p>“Are you doing more research?” he wonders, hopping over to the desk. The page on display is in the same strange language.</p>\n<p>“No,” Derek retorts, clearly lying. Stiles scoffs, leaping onto the desk and then down into Derek’s lap.</p>\n<p>“Without me? I am wounded.”</p>\n<p>“We’ll see about that.” Even though the words are spoken gruffly, it’s an idle threat. Derek merely shifts so that there’s enough room for Stiles in front of the desk.</p>\n<p>“So, what news are your ‘contacts’ giving today, huh? A recipe for woodland creature stew? The weather updates from Narnia?”</p>\n<p>“Yeah,” Derek snorts. “Cloudy with a chance of annoying.”</p>\n<p>Stiles looks up at him and grins.</p>\n<p>“You know just how to flatter a girl, you know that?”</p>\n<p>Derek rolls his eyes.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles tries sleeping in Isaac’s room again, on the spare bed that had been his initially.</p>\n<p>It doesn’t work. The restless movements from Isaac’s side of the room keep him awake, his ears too sensitive to let the sounds go.</p>\n<p>He jumps off the bed and quietly exits the room, searching for a door that’s open enough that he can sneak in.</p>\n<p>The only room that becomes a potential option is the master bedroom, and as amusing as Jackson’s expression would be when he wakes up covered in fox hair, right now Stiles wants as little to do with Jackson as possible.</p>\n<p>Making a frustrated noise, he meanders down the stairs and heads to the couch.</p>\n<p>He feels lonely and a little cold, but at least it’s quiet.</p>\n<p>He wakes up covered with a blanket and he’s not sure where it came from. </p>\n<p> </p>\n<p> </p>\n<p></p>\n<p><br><img src=\"http://dauntingfire.com/tw-rbb1/RBB02-fox-redeux2.jpg\" alt width=\"500\" height=\"296\"> </p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>If you rush a miracle man, you get rotten miracles.</em>\n</p>\n<p>-          <strong>The Princess Bride</strong></p>\n<p>\n<strong> </strong>\n</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The sun is filtering through the trees in the backyard, creating patterns of branches and leaves that Stiles watches as they change in the wind. The porch is warm underneath him and he can hear the laughter of Erica and Lydia by the lake. Blowing out a heavy breath of air, Stiles lowers his head to rest on his paws.</p>\n<p>“You know what really sucks?” he asks Scott, glancing over to his friend. Scott is in the middle of trying to piece back together a water gun he accidentally broke yesterday.</p>\n<p>“What, man?” he asks distractedly, tongue peeking out between his lips. Stiles rolls his eyes.</p>\n<p>“World hunger,” he says flatly, staring at the boy. Scott doesn’t look up, just makes a sound feigning interest.</p>\n<p>“Yeah?”</p>\n<p>Stiles has been friends with Scott for way too long to be fooled.</p>\n<p>“No, dumbass,” he snaps, jumping to his feet. “<em>Being a fox</em> really sucks. Jesus.”</p>\n<p>That does get Scott to glance up, his expression apologetic.</p>\n<p>“Sorry, dude,” he says, pausing only briefly before going back to his gun. He at least sounds like he means it.</p>\n<p>Huffing, Stiles circles around Scott, watching him as he works.</p>\n<p>“Dude, I don’t know why you’re even trying,” he mutters. He throws himself dramatically onto his side and sulks. “Allison and Lydia are going to kick your ass, anyway.”</p>\n<p>“I can at least take down Jackson and Erica,” Scott reasons, messing with a screw. “Maybe Boyd and Isaac.”</p>\n<p>Stiles shakes his head.</p>\n<p>“No, man,” he counters, already knowing how their water gun war will play out. “Lydia will be teaming up with Jackson until she takes out everyone else. And then, like the master assassin she is, she’ll turn on him.”</p>\n<p>Scott hums in thought, pursing his lips as he studies the pieces of his gun. With a small grin, he moves his gaze to Stiles, who perks up instantly at the mischievous edge to his best friend’s expression.</p>\n<p>“So what do I do?” he whispers conspiratorially. Stiles pushes himself onto his feet with renewed enthusiasm, bouncing on his paws.</p>\n<p>“Finally, you’re-ah talking some-ah sense,” he says in an over exaggerated Italian accent. He’s not really sure what he’s going for, and neither is Scott, but they don’t question it. Instead, they delve into strategy.</p>\n<p>Two hours later, when the war officially begins, Derek sits down next to him on the porch.</p>\n<p>“My money’s on Lydia,” Stiles offers, munching on the piece of watermelon Scott brought out for him. Derek makes a noncommittal sound, which Stiles sees as encouragement to keep going. “Allison’s got better aim, obviously, but she’s probably going to overestimate or underestimate exactly where the water will go. Not as predictable as bullets. Lydia probably did all the calculations.”</p>\n<p>Derek remains silent, but when Stiles glances up at him, he’s got his head tilted toward Stiles even as he watches the pack race around the trees ahead. Stiles thinks that means maybe he’s listening.</p>\n<p>“Like, I know you werewolves have got the speed thing going for you, but, dude, Scott can’t shoot for shit, and Erica’s not that great either. Boyd and Isaac at least know how to shoot real guns.”</p>\n<p>A snort comes from Derek and Stiles frowns, looking over at him again.</p>\n<p>“What?” he glowers. Derek shakes his head, leaning back on his hands. His lips are pursed, fingers drumming against the wood of the porch.</p>\n<p>“My own personal sports commentator,” he says dryly, cocking an eyebrow in Stiles direction.</p>\n<p>Whipping Derek with his tail, Stiles mutters, “Fuck off.”</p>\n<p>The battle ends exactly the way Stiles expected it would: Lydia betraying her boyfriend for an easy path to victory. Allison is a close third, an epic upside down attack from a tree branch earning her MVP status, and Scott actually makes it past Boyd thanks to Stiles’ help. Isaac gets him in the end, though.</p>\n<p>By the time the group is making their way back to the house, all dripping with water except for Lydia, the sky is turning orange and pink and Stiles can hear the crickets waking up.</p>\n<p>“If I were in there, it’d totally be me and Lydia at the end,” he says confidently, gnawing at the residual watermelon rind. “I’d kick so much ass. Take out Jackson guerilla-style so she’d have no one to protect her. Man, it’d be awesome.”</p>\n<p>As the images run through his mind, Stiles feels a faint bite of regret; he’s sure once he’s turned back into a human, he’ll have a few more chances to participate in things like water gun fights – maybe. But this summer was meant to be about them all being together before college tore them apart, and Stiles hates that he’s missing even a second of it.</p>\n<p>He tries to ignore the depressing thoughts and looks over to Derek for a distraction.</p>\n<p>“You’d make it farther than Isaac,” he muses, going over the various scenarios in his head. Derek’s the fastest and the best at stealth – even in the middle of the day – so there’s no question that he would last the longest of the werewolves. Derek can also shoot, was taught by the Argents themselves, so he’d be good on the offensive end as well. But Allison would probably catch him off guard; he’d get cocky, she’d use Lydia as a distraction and then do her move popping out from some fucking tree to soak his ass.</p>\n<p>Derek snorts again, which Stiles chooses to take as a sound of agreement.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Everything going good?” Stiles’ father asks over the phone a day later. “Haven’t heard much from you guys.”</p>\n<p>Scott is holding the cell up to Stiles’ head, balancing it in just the right position where Stiles can speak into it clearly.</p>\n<p>“Uh, yeah, dad,” he replies, forcing out a casual laugh. “Everything’s going great. You should see Lydia in a bikini, she’s like—SHIT!“ Expectedly, something gets thrown at him for the almost remark. Unexpectedly, it’s much more painful than he’d anticipated. When he looks down he sees that it was Lydia’s stiletto.</p>\n<p>“Stiles?” the Sheriff says, concerned. “Everything okay?”</p>\n<p>“Yeah, fine. It’s just raining shoes over here, you know how it is.”</p>\n<p>The Sheriff chuckles.</p>\n<p>“Yeah, right.”</p>\n<p>They talk for a short while longer, Stiles trying not to make his father suspicious by hanging up too quickly. As the Sheriff finally gets off the line, telling him to have fun, Stiles lets out a heavy breath of air.</p>\n<p>“By the way, dad,” he says depreciatingly to the dial tone, “your only child is a fox at the moment. No, no, yeah, I know. Cool, right?”</p>\n<p>Using the phone, Scott lightly smacks Stiles upside the head, rolling his eyes.</p>\n<p>“Deaton’s working on it,” he says, like that’s supposed to make Stiles feel better.</p>\n<p>With a grumble, Stiles splays himself out in front of the TV and glowers at Scott.</p>\n<p>“Dude, that was totally animal abuse,” he says solemnly, “I demand ear scritches as penance.”</p>\n<p>Scott raises an eyebrow, but leans over nonetheless.</p>\n<p>“Ah, ah!” Stiles pulls back, holding up a paw. “From your girlfriend,” he clarifies.</p>\n<p>Scott stares at Stiles, then drops a pillow on him and walks away.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles is trying to pretend the butterfly flitting around outside the window isn’t distracting him, when the smell of bacon hits his nose.  Isaac hisses an excited “Yes!” in the kitchen, heard over the good-natured insults and laughter being thrown around the table. Stiles listens as several plates are slid onto the wood and the bacon continues to sizzle on the stove.</p>\n<p>With a yip, Stiles drops down from the windowsill to race into the kitchen, making it there just as Boyd is pulling the bacon from the pan. He separates a few pieces into a bowl and slides the rest onto a larger platter.</p>\n<p>Stiles can’t find himself too disappointed that he’s eating out of a bowl on the ground when it’s filled with breakfast meat. He munches happily as everyone talks at the table, nestled in by Scott’s feet. Far too soon, Stiles is left licking the bowl for the grease and last few crumbs and he can still smell uneaten bacon on the table above him.</p>\n<p>Stealthily, he creeps away from Scott, moving around until he’s located the perfect angle. He slowly raises his head, peering over the edge. The bacon is only a few inches away from his snout, on the empty side of the table where all of the food has been placed. As he opens his mouth, slants his head to grab a piece, he freezes, feeling a steady gaze on him.  Jaw still open, Stiles’ eyes move directly across the table, finding Derek watching him with a cocked brow. Everyone continues talking around them.</p>\n<p>Unsure of how to take Derek’s silence, Stiles cautiously continues his task, peering at Derek the entire time, even as his jaws close over a slice of bacon.</p>\n<p>Derek goes back to the newspaper article he was reading.</p>\n<p>Stiles is victorious until Lydia catches him and smacks him in the back of the head.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The mirror never lies; it’s something Stiles figured out the hard way when he was going through puberty. The mirror tells the ugly truth, no matter how painful it is, in clinical, glaring detail.</p>\n<p>Currently, the mirror is telling Stiles that he actually is kind of adorable.</p>\n<p>And that he is still a fox.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p> <img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\"></p>\n<p> </p>\n<p>Stiles learned early on that being wet when covered in fur was nowhere as fun as being dry, despite Lydia’s attempts to convince him that foxes love water. He also learned early on that all of his friends are dicks who find it hilarious to use their wolfy strength to throw a poor little fox-human into the lake while they’re swimming.</p>\n<p>Which is why Stiles finds himself alone in the house, while everyone else is down by the water instead of hunting for ways to fix him. Lydia was right when she said that they’ve got their resources working on it, that there’s not much <em>they</em> can physically do until they hear back from Deaton or Peter - that they can’t possibly go home without Stiles being human or their parents will definitely ask questions. The witch is gone, her burial ground is gone, and no amount of screaming or shouting for her has brought her back.</p>\n<p>Stiles knows all of this, but it doesn’t stop him from feeling bitter.</p>\n<p>Skulking to the guest bathroom, Stiles pokes his nose through the door crack and pushes it open.  His feet pad against the tile in the spacious room as he circles around the shower and heads toward the laundry basket. With a leap he’s inside, curling up to nestle into the towels.</p>\n<p>It’s kind of gross with them all being dirty, but they’re just towels, and they smell like his friends.  And as much as his friends are giant assholes, the scent of being surrounded by them makes him feel secure when he’s got no one to snuggle up to.  He blames his delicate fox sensibilities.</p>\n<p>Lydia just blames him when she pulls out chunks of red fur from the lint filter, Jackson bitching that the guest bathroom always smells like fox now, as if it’s not entirely his fault.</p>\n<p>Huffing, Stiles rests his chin on his paws, nosing at a towel that smells like Scott. The basket’s been emptied recently, so he can fit himself in with enough room to feel like he’s hidden in a hole, and he closes his eyes to enjoy his private little space.</p>\n<p>He’s startled awake by the sound of the shower running and a towel being thrown on top of him. It smells like a combination of Derek, sweat, and lake water, and when the shower door closes with a rattle, Stiles knows exactly what’s happening. The problem, he guesses, with the bathroom always smelling like fox is that the bathroom <em>always</em> <em>smells like fox</em>, and so Derek must have no idea that he’s actually in here.</p>\n<p>He doesn’t curse, just awkwardly moves around so he’s not being suffocated by Derek’s towel and tries not to make any noise that wouldn’t be drowned out by the falling water.  As long as he stays hidden, he can avoid an awkward moment for both of them.</p>\n<p>His plan is hit with a fatal flaw when, just around the time Stiles is wondering what could possibly be taking Derek so long, he hears a soft hitch in Derek’s breath, sensitive ears picking up the sound.  His first thought is that he just imagined it, or that maybe the water got too cold. When he hears another hitch in breath, his second thought is that, while the idea of Derek being an angsty shower crier makes perfect sense, the guy has been surprisingly good-humored lately (for him) and Stiles knows that Derek is terrible at hiding it when something is bothering him.</p>\n<p>Curiosity overpowers his need to stay hidden, and Stiles peeks over the lid of the basket. He’s able to see just into the shower, through the glass door, that Derek facing away from him into the spray. When Stiles catches the repetitive motion of Derek’s right arm, the elbow bent just so, he wishes he were human again so he could smack himself in the face for not going with the obvious option.  He ducks down into the basket, feeling warm all over from embarrassment, the fur making it all the more uncomfortable.  The breaths continue, still hitching, like Derek is trying so hard to be quiet, but Stiles can hear every choked back whimper.  Stiles wonders if that means that Derek is usually loud, usually doesn’t hold back. His mind wanders, because it’s not as if he hasn’t noticed Derek is stupidly attractive, but getting turned on as a <em>fox </em>is not something Stiles has ever wanted to experience, so he tries to stop the thoughts dead. It’s hard when the towel still partially on top of him smells like Derek.</p>\n<p>A stuttered moan escapes, still not loud enough to be heard by anyone but Stiles.  He knows it’s wrong, it’s totally wrong, but whatever Derek has started doing must be enough to make his throat emit those breathy sounds, barely stifled groans, noises that make Stiles think of porn stars trying to make it good for the audience.</p>\n<p>There’s no audience here but Stiles, and Derek has no idea.</p>\n<p>Shifting again, Stiles raises his head high enough that he can see just over the basket’s rim, and he has to hold back his own whimper.  Derek’s other hand has slid back to his ass, and this time Stiles has a perfect view of the way it’s working forward and back.</p>\n<p>It doesn’t take a giant leap for Stiles to figure out what Derek’s fingers are doing.</p>\n<p>Derek’s legs are spread, his thigh muscles taut and tight as he tries to find the right angle. When he does, he makes a noise that is going to haunt Stiles for the rest of his life, then rises up to his toes, entire body tensing in pleasure.</p>\n<p>Squeezing his eyes shut, Stiles dives into the basket, burrowing deeper into the towels, trying to find one that smells like Jackson to balance out the visuals, the sounds.</p>\n<p>He doesn’t move until after Derek has grunted his climax, until after Derek has let out a satisfied noise, until after Derek has gotten out of the shower and toweled himself off, until after Derek has gotten dressed and fucking <em>hummed</em> as he fixed his hair because of his great fucking orgasm.  He doesn’t move until after the bathroom door opens and the door to Derek’s room clicks shut down the hall. Then he jumps out of the basket, races outside and throws himself into the chilly lake.</p>\n<p>He’s not sure if he’s trying to cool himself off or drown.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“What’s gotten into you?” Allison laughs, rubbing him down with a towel.  He feels like a dog, and if Allison keeps acting like he is, he’s going to bite her.</p>\n<p>He’s lying to himself; she’s one of his saving graces during this hell and she gives great belly rubs. That doesn’t stop him from glaring darkly at her.</p>\n<p>She puts on a feigned, exaggeratedly stoic face and nods, continuing to dry his fur.  Lydia mentions something about a blow dryer and he swears he will contract rabies just to kill everyone in this house.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Dude, what are you doing?” Scott wonders, eying Stiles warily as he refuses to look away from the ceiling. Directly above is the master bedroom, where Jackson and Lydia have just retired after saying good night.</p>\n<p>“Wishing physical harm on Jackson,” Stiles answers mildly, eyes squinting. His nose itches. “Not like anything bad like torture. Just death or something.”</p>\n<p>“I don’t think that’s gonna work.”</p>\n<p>“You know, your negativity is neither wanted nor needed, thanks,” he retorts, muttering the word “asshole” in a way that Scott is meant to hear. He gets a fond pat on the head that he’s too slow to duck away from.</p>\n<p>“Just don’t strain yourself,” Scott laughs.</p>\n<p>“Har, har. You’re a fucking riot, McCall.”</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>When Stiles sees Derek again, he’s eating cereal at the kitchen table, reading one of the texts they’d borrowed from the local library and had quickly found to be useless.  Stiles considers bailing, either turning around or quickly running past, but then Derek says, “You hungry?” without looking up and Stiles is reminded that he hasn’t really eaten all day.</p>\n<p>“I’m sick of cereal,” Stiles says tersely, feeling like every hair of his is on edge. Derek shrugs, taking in another spoonful, still reading.</p>\n<p>“So don’t eat cereal.”</p>\n<p>Giving a little foxy frown (Stiles still isn’t really sure how emotions work on this face), Stiles chances coming closer. He leaps onto the table, but stays on the opposite end, trying his hardest not to look anywhere near Derek’s hands.</p>\n<p>“I want hot dogs,” he says.  It sounds like a demand, he thinks – hopes – and not like nervous wavering. If he notices, Derek feigns ignorance. He grabs a pen by his bowl, marks the page in the book where he stopped reading and stands to make his way to the fridge.</p>\n<p>Stiles does not look at his ass and he definitely does not wonder how he never noticed how fitted Derek’s jeans were before. Instead, he distracts himself by padding over to the book on Derek’s side of the table. It’s in a language he doesn’t understand – a different one from the strange text he’s been seeing during his research with Derek  --  and there are old, sketched pictures of things Stiles can’t really decipher. He realizes that it’s not one of the library books at all.</p>\n<p>“Where’d you get this?” he wonders, pawing at the page. He can’t really feel sensation the same way as he can with human hands, the bottom of his paws meant to be thick and strong enough to make even rocky terrain bearable, but he can tell the paper is at least thinner than the average page of a book.</p>\n<p>Derek shuts the door of the microwave, a beep following before the muted humming signals Stiles’ food cooking. Stiles hears him come back to the table, doesn’t remove his eyes from the book, and feels Derek <em>lean over</em> behind him, almost pressed against him.</p>\n<p>“Peter sent this. Thought it might help.”</p>\n<p>Stiles squints at the pages, does not wonder how Derek smells so good for someone always running around and maiming things.</p>\n<p>“What language is this?”</p>\n<p>“It’s a dialect of a werewolf language,” Derek says simply. Stiles eyes widen and he turns his head to stare at Derek, who’s looking back at him with his brow raised challengingly.</p>\n<p>“That’s so stupid,” Stiles says anyway. “Werewolves don’t have their own language.”</p>\n<p>At the beeping of the microwave, Derek straightens up and walks to the appliance. As he’s pulling the hot dogs down onto the counter he says, “How exactly did you think we recorded centuries worth of our history without hunters, humans, or anything else out there finding it and being able to understand it?”</p>\n<p>If he’s being honest, Stiles has never really thought about it – the fact that werewolves are their own little secret society and probably have their own history, their own stories and views of the world that need to be passed on through each generation without any potential threats being able to discover any of it. It doesn’t make a werewolf language sound any less stupid, but it does make more sense.</p>\n<p>“It’s still stupid,” Stiles reiterates out loud, stomach growling as Derek brings the plate of food over to the table. He sets the plate down at a seat next to his own, instead of the floor, and Stiles makes a confused noise.</p>\n<p>“You’re not actually an animal,” Derek snaps, “Get in the chair and eat like a normal human being.”</p>\n<p>Stiles feels like maybe there’s more baggage in that statement than he really wants to examine on an empty stomach, so instead he hops off the table into the chair and turns around to face his meal.</p>\n<p>“Good boy,” Derek smirks, and Stiles rips off a piece of hot dog in what he hopes is a threatening manner.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Watching Isaac die repetitively while he tries to play Halo is actually physically painful for Stiles. He sits there in tortured silence for a while, bored as he waits for Scott to come back from getting groceries, but at a certain point, enough just becomes enough. Jumping off the couch, he trots to the space behind the entertainment system and, using his teeth, yanks out the XBOX’s plug.</p>\n<p>Isaac shouts a cry of dismay as soon as the power shuts off, and Stiles proudly comes around to the front of the TV.</p>\n<p>“<em>No,</em>” is all Stiles says, before darting into the kitchen.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>A cheesy romance movie ends up being on tap for the night, and, as completely cliché as it is, Stiles ends up getting sexiled from every paired up room in the house. Isaac is not an option, with the first attempt having not worked out so well (and also because Stiles is pretty sure Isaac still wants to pound him for the stunt he pulled that afternoon).</p>\n<p>It leaves only Derek’s room or the couch for Stiles to call his home for the night, and Stiles has long since realized that something in his innate foxy senses prefers company to sleeping alone in a wide open space. He’s sure it’ll be fine as long as Derek keeps his clothes on.</p>\n<p>Derek doesn’t look surprised as Stiles slinks his way in, pile of blankets between his teeth, dragging on the floor behind him.  He mirrors the pointed look that Stiles throws him in an attempt to get him to put Stiles’ blankets on the chair, and doesn’t move.</p>\n<p>“Just get on the bed,” Derek sighs, reaching over to turn off the lamp. In the darkness, Stiles can see clearly as Derek’s form shifts under the covers and Stiles is pretty certain that it’s not a great idea.</p>\n<p>“Uh, no, dude, I’m fine-“</p>\n<p>“Stiles,” Derek grunts, tone impatient. His voice is muffled by his pillow, and Stiles isn’t sure he’s ever seen Derek sleepy before.  Tired and exhausted is a given, but the concept of Derek being <em>sleepy</em> seems foreign, even though he’s completely aware the guy sleeps. Maybe.  “Get on the bed. You’re not gonna sleep on a pile of sheets like a dog.”</p>\n<p>“Oh, but sleeping at the foot of the bed like a dog is so much better?” Stiles snaps, backing up to park himself challengingly on his little nest. Derek doesn’t sit up, so there’s no real effect. Stiles huffs.</p>\n<p>“So don’t sleep on the foot of the bed,” comes the mumble.</p>\n<p>The stupid fox part of Stiles’ brain makes a compelling argument for how much better sleeping next to a solid form that makes him feel safe sounds, rather than sleeping alone on the floor. The rational part of Stiles’ brain tells him exactly how unsafe it is, but then traitorously adds that a bed is so much more comfortable than a pile of sheets on the ground.</p>\n<p>Huffing again, Stiles pads over to the bed and leaps onto it, Derek barely moving from the slight bounce Stiles’ landing caused.  Just to be a pain, Stiles avoids the foot of the bed and goes further north. He pauses at Derek’s hip, realizes he does not at all want to wake up to Derek’s crotch or ass in his face if Derek turns onto his side during the night, and bypasses it to Derek’s back.  He contemplates just laying himself on top of Derek like a cat, but the bed does seem pretty damn comfortable, and he’s not gonna push his luck.  So instead, he continues to move up Derek’s body, and finally settles on stretching out next to Derek’s bent arm, Derek’s hands shoved under his pillow.  Stiles drops his head on his paws, blinking at Derek’s face.</p>\n<p>“What?” Derek groans, eyes remaining shut.</p>\n<p>“I was just thinking that you look like Sleeping Beauty,” Stiles quips with a snicker. Derek does open an eye at that, peeking down at Stiles.</p>\n<p>“Go to sleep.”</p>\n<p>“You’re not the boss of me,” Stiles bristles, shutting his eyes even so.  He hears Derek snort and flicks his tail in irritation at the man.</p>\n<p>Stiles sleeps better than he has since being human.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>When he wakes up, the first thing Stiles sees is Derek’s face.  It’s still lost in sleep, there’s an imprint on his jaw from where Derek didn’t take off his watch, and Derek’s hair is mussed ridiculously.</p>\n<p>Ever since Derek began letting his guard down years ago, allowed himself to let people in and trust, he’s become fully human in Stiles’ mind, rather than the sardonic human-like wolf robot Stiles always saw him as. He still has some walls, still tries to put up a rough exterior, but he’s become human to Stiles nonetheless.</p>\n<p>Now, Derek looks touchable in a way Stiles hasn’t yet had the chance to experience.</p>\n<p>Not in the pervy sense that Stiles does not at all want to think about; he looks accessible, like someone who is going to wake up and smile and laugh and have a conversation and not feel like he’s on some other plane of existence that Stiles will be able to catch glimpses at, but never quite reach.</p>\n<p>When Derek’s eyes do open, they’re bleary instead of immediately alert like Stiles would have expected, and it does nothing to hinder the mood.</p>\n<p>Derek stares at Stiles for a moment, mind obviously working though his expression stays neutral, and Stiles thinks the color of Derek’s eyes when the morning sun is reflected in them is impossibly <em>stupid</em>.</p>\n<p>“I didn’t crush you, did I?” Derek croaks, voice throaty and raw from sleep (and also stupid). He asks it casually, like he’s just making sure rather than being honestly concerned. Stiles shakes his head slowly, and with that Derek is sitting up and Stiles is suddenly glad he’s covered in fur to hide the warmth he feels on his face.</p>\n<p>Derek yawns, runs his fingers through his hair, and glances around the room like he needs a moment to get his bearings. He probably doesn’t, probably had this room and all possible exits and entrances, as well as everything that could be used as a weapon against him or by him, noted in his brain the second he walked in.  Something inside Stiles shifts when he wonders if maybe Derek is going through the motions because he can, because he knows he’s safe, because he’s not running, and because it makes those feelings real to him.</p>\n<p>Stiles is pretty sure that the first year they knew Derek, the barest creak from a mile away would have the man up and out of bed and ready to attack.  He’s not sure why he suddenly feels guilty about that.</p>\n<p>“So what now?” Stiles wonders, curling up even as Derek begins getting out of bed. “You begin your day with the blood of your enemies?”</p>\n<p>Derek mimes a sarcastic laugh, grabbing his towel hanging from the back of the door.  Instantly the images from days ago filter back into Stiles brain, and he hides his face in the folds of blankets.</p>\n<p>“Dude, didn’t you just, like, take a shower yesterday?” he says, voice muffled in the dark.</p>\n<p>“Some of us take a shower more than once a week.”</p>\n<p>The need to defend himself overtakes Stiles’ embarrassment, and he sits up indignantly to retaliate. Derek is already gone.</p>\n<p>Stiles buries his face back in the covers.</p>\n<p>They smell like Derek and it doesn’t help.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>It’s not that bad…Well, I'm not saying I'd like to build a summer home here, but the trees are actually quite lovely.</em>\n</p>\n<p>-          <strong>The Princess Bride</strong></p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>He tells himself that he can’t hear anyone else moving around the house, that everyone else is still asleep, and that’s why he doesn’t leave Derek’s bed.  Derek comes back smelling fresh and clean and Stiles does not look away from the TV he managed to turn on to see what kind of expression Derek is wearing.</p>\n<p>“This show will rot your brain,” Derek snorts, and he sounds amused, ruffling the fur on Stiles head as he walks by. Stiles is pretty sure he knows why Derek is in a good mood post-shower and he keeps his eyes on the bluebird and raccoon talking on the screen.</p>\n<p>“Wow, no. This show is hilarious,” Stiles retorts. “What do you think is funny? Horror movies?”</p>\n<p>“I like normal movies, Stiles,” Derek drawls, tossing his towel over the back of the desk chair. He turns on his laptop, letting it boot up as he moves around the room to finish getting dressed. He puts a shirt on over his undershirt and lifts them both to slide on his belt. Stiles surreptitiously steals a glance at the defined hip bones that disappointingly get covered as Derek pulls his pants up and fastens the belt.</p>\n<p>“Oh yeah?” he challenges, looking away. “What’s your favorite movie?”</p>\n<p>Derek doesn’t answer, instead sitting down at the desk and logging in to his computer. Stiles gives it a minute, then realizes that Derek has no intention to respond.</p>\n<p>“Dude, are you avoiding the question?” he laughs, jumping down from the bed so that he can leap up to the corner of the desk. Pursing his lips, Derek gives Stiles a sidelong glance.</p>\n<p>“I’m not avoiding it. I’m just not going to answer.”</p>\n<p>“Oh man,” Stiles cackles, the noise coming out as more of a hissing sound in his fox form, “It’s something really embarrassing, isn’t it?” He gets in between Derek and the computer screen. “It’s My Little Pony, isn’t it.”</p>\n<p>“It’s ‘The Longer You’re Obnoxious, The Longer You’re a Fox’,” Derek says pointedly.  Stiles pouts, hunching his shoulders.</p>\n<p>“What a buzzkill,” he huffs. Derek rolls his eyes and slides his chair out, looking at Stiles expectantly.</p>\n<p>On the one hand, Stiles knows exactly what Derek just did in the shower and sitting in his lap seems more than a little awkward.</p>\n<p>On the other, Stiles loves researching with Derek because it makes him feel less useless.</p>\n<p>On the third hand -- which totally counts, because as a fox, Stiles kind of has four hands – Stiles just checked Derek out and didn’t feel too bad about it, so he guesses certain sacrifices have to be made.</p>\n<p>He’s the noble type, and all.</p>\n<p>Slowly, he slips down into the space between Derek’s legs and maneuvers so that he’s facing the computer.</p>\n<p>Derek scratches the back of his ear absently and Stiles isn’t sure if he feels guilty or seriously fucked.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB05-small.jpg\" alt width=\"600\" height=\"431\">\n</p>\n<p> </p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>They research for about an hour and a half, before Stiles gets an itch in his bones that he’s beginning to associate with Derek and he needs to get away. He makes some terrible excuse about having to go outside to use the bathroom, and makes a detour into Scott and Allison’s room to hide under the bed.</p>\n<p>He has blessed solitude for all of twenty minutes, before Scott’s head is peeking under the bed skirt.</p>\n<p>“Dude,” Scott laughs, “What are you doing?”</p>\n<p>Stiles rolls onto his back, looking at his best friend upside down.</p>\n<p>“Having an existential crisis,” he says casually, “Why?”</p>\n<p>Scott shrugs.</p>\n<p>“Wanna play Mortal Kombat?”</p>\n<p>Stiles considers.</p>\n<p>“Are you gonna act as my hands?”</p>\n<p>Like a good best friend, Scott replies, “Dude, of course.”</p>\n<p>Shifting back over to his stomach, Stiles begins to crawl out.</p>\n<p>“Sweet.”</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Perching on the couch by Scott’s shoulder, Stiles feels almost like it could be like old times, if old times meant he was a fox perched on the couch by Scott’s shoulder, telling Scott which buttons to press to kick Boyd’s ass. He gnaws at Scott’s head when his friend makes a wrong move, allowing Boyd to get in a critical hit.</p>\n<p>“That’s it!” he exclaims when Boyd gets a K.O. “Our friendship is officially null and void.”</p>\n<p>Scott swipes half-heartedly behind him without looking, and Stiles easily dodges it.</p>\n<p>He can smell Derek approaching before the man appears in the doorway to announce that it’s his turn to do the grocery run.</p>\n<p>“If you want anything, tell me now, or don’t complain when I come back without it.”</p>\n<p>“Sunny D!” Isaac shouts from his spot sprawled in front of the TV. Erica echoes an affirmation and adds, “Get the pink kind!”</p>\n<p>“We need more Doritos,” Boyd calls and Allison follows up with, “Some fruit?”</p>\n<p>Jackson and Lydia are noticeably absent, the door to their room shut, and Derek makes no effort to go find out what they want.</p>\n<p>“You want to come with?” he asks Stiles, nodding to the door.</p>\n<p>Stiles first instinct is to be offended; he’s not a dog, he doesn’t need to be taken on rides in the car. But when he considers the several instances where Derek has explicitly affirmed his position that Stiles is <em>not</em> an animal, the offer seems weirdly sweet, like Derek knows Stiles has been cooped up in the house and wants to give him a chance to get out.</p>\n<p>He gnaws on Scott’s head again for good measure, then bounds off the couch and races pass Derek to the door.</p>\n<p>“Put this on,” Derek says when they’re in the car, shoving Stiles’ red hoodie at him. Stiles hadn’t even seen it in Derek’s hands.</p>\n<p>“Dude, I’m a fox,” he laughs, “Freeballin’ all day and all night.”</p>\n<p>Rolling his eyes, Derek turns the key in the ignition and the car begins to rumble pleasantly. Stiles’ nose twitches as he watches the way Derek’s neck becomes exposed as the man twists and arches to look out the rear window, backing the Camaro out of the long, curving driveway.</p>\n<p>“Stiles, exactly how long do you think it’ll take before someone calls animal control on the guy with a fox in the front seat?” Derek ventures with a mockingly conversational tone.  Point to Derek, Stiles’ mind supplies as he realizes that Derek might be right.  The fact that Derek thought about it, had brought Stiles’ hoodie just in the event Stiles wanted to go, makes Stiles feel kind of like when he’s snuggled in clothes that smell like Scott – like he’s obnoxiously warm and happy.</p>\n<p>“Ohhhh, I see,” he says instead of analyzing the emotion, or Derek’s potential motives.  He uses his nose to find the appropriate holes and slips the hoodie onto his frame. The sweatshirt pools around him on the seat, the hood big enough that Stiles can barely see anything above his snout, but he guess he could probably pass for a normal dog now, so it serves its purpose.</p>\n<p>“Don’t ever let anyone tell you that you’re nothing but a pretty face,” he quips, turning his head to what he thinks is Derek’s general direction.  Little pools of light come in under the hood, but other than that, it’s darkness.</p>\n<p>Derek makes a noise that sounds eerily familiar to an actual laugh – no dry humor involved – and Stiles is at once disappointed and relieved that he can’t see Derek to verify.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Derek is visibly conflicted, though he tries his best to hide it, when it comes to leaving Stiles in the car with the window cracked. Stiles understands, he can’t go inside and leaving the car on would just attract attention. He promises Derek that he’s not offended and Derek doesn’t say that he’ll be quick, but Stiles knows he’s thinking it.</p>\n<p>He amuses himself by making everyone who passes by the car think they’re hearing voices, speaking lowly when they’re not paying attention, then panting like an innocent puppy, tongue out, when they turn around.  One kid actually sees him, shouts to his mom that there’s a talking dog in the Camaro, but of course she doesn’t believe him. Stiles slides his paw across his neck threateningly anyway.</p>\n<p>Derek’s back within fifteen minutes and Stiles can’t say he’s surprised; he’s never met someone with as much focus as Derek.</p>\n<p>Also the guy has werewolf speed, so.</p>\n<p>As Derek opens the trunk and begins to load in the groceries, a middle-aged woman walks by, cooing at Stiles in the window.</p>\n<p>“Oh, how precious he is in his little sweater!” she squeals, hands folded up to her chest.  She looks over at Derek. “Is he some sort of collie mix?”</p>\n<p>In the silence, Stiles can imagine Derek’s blank stare before the man says, “Sure,” and shuts the trunk with a snap.</p>\n<p>She smiles, stares at Stiles fondly, and Derek doesn’t give her a chance to say anything else, briskly walking around the Camaro to get inside. As soon as he’s in, the smell of food hits Stiles’ nose, and he notices the bag Derek’s sat in his lap.</p>\n<p>“Here,” Derek mutters, pulling out a plastic container, steam creating condensation on the sides. He opens it, releasing the scent even more potently in the car, and reveals a mass of steak tips, piled almost all the way to the top.</p>\n<p>Stiles gets that weird warm feeling again, blames the lack of A/C, and blurts, “It’s poisoned, isn’t it? You brought me along to kill me.”</p>\n<p>Derek rolls his eyes, nestling the container onto the seat in front of Stiles so that it’s secure enough that it won’t fall unless he breaks abruptly.</p>\n<p>“That’s what’s going to happen if you get any on my car.”</p>\n<p>Snorting, Stiles ducks his head to bite at a piece, then sits up and turns his snout toward Derek to chew obnoxiously. He gets a hand shoving his face away for his efforts.</p>\n<p>It’s quiet inside the car as they drive, the only sounds being Stiles’ munching and the low volume of the radio – a classic rock station, which Stiles decides would have been his first choice if asked what kind of music he thought Derek enjoyed listening to. The relative silence gives Stiles’ mind a chance to wander, traveling to places and on paths better left alone. He lands on a specific thought, something that has been nagging at him in the back of his head for a while now, fixates on it until his mouth is working without permission.</p>\n<p>“Dude, why are you being so nice to me?” he wonders, licking the gravy from around his mouth.  Derek gives him a sidelong glance, then quickly returns his gaze to the road. “I mean, not just this. All the researching and stuff. No one else is bothering to go that extra mile.”</p>\n<p>“No one else can read werewolf,” Derek retorts, taking a turn slow enough that he doesn’t jar Stiles’ food too much. Stiles still thinks a werewolf language is stupid, but he doesn’t comment on it.</p>\n<p>“Okay,” Stiles huffs, because Derek is clearly avoiding the question. “Then what’s all <em>this</em>?” He doesn’t gesture around with his paw, because he doesn’t want to risk knocking over the steak, but he thinks maybe his tone relays his meaning. While Derek doesn’t speak, his fingers tighten imperceptibly on the steering wheel, and Stiles knows it has.</p>\n<p>The silence resumes and Stiles has long given up on waiting for an answer by the time Derek finally responds.</p>\n<p>“I know what it’s like when people forget that you’re human,” he says flatly.</p>\n<p>Suddenly, it’s Stiles turn not to reply, feeling the words twist like an ugly thing behind his ribcage. He tears at a piece of meat and swallows.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Even though it’s Allison and Scott’s turn to house Stiles for the night, and no one is actively trying to sexile him, Stiles follows Derek up the stairs when the man heads to his room. He slips in just before Derek closes the door, and Derek doesn’t seem at all surprised when Stiles makes himself at home on the bed.  He turns on the TV and sets the remote down in front of Stiles, then moves around the bed to start getting undressed. Stiles flips to a random channel to distract himself from staring at Derek’s slowly revealed body, not really registering what’s on the screen until he hears Derek mutter, “Inconceivable,” to himself in time with a voice coming from the speakers.</p>\n<p>He whips his head around without thinking, the shock enough to make him forget his original goal. Derek is just pulling on a t-shirt.</p>\n<p>“Dude,” Stiles gapes, not quite able to reconcile his thoughts in a way that makes sense to him. “You can quote <em>The Princess Bride</em>?”</p>\n<p>Derek halts the adjusting of his shirt, eyes remaining glued to the hem for a long minute, like Stiles said some magic word and froze him in time.  When he finally moves, his expression is pinched and Stiles does not miss the faint dusting of pink on Derek’s cheeks.</p>\n<p>“Laura used to watch it all the time when we were kids,” he mutters. “She loved it.”</p>\n<p>Stiles can hear the, “And so did I,” in the way Derek’s gaze avoids the TV, and is reminded of all the hours he’s spent in front of <em>The Never Ending Story</em>, reminiscing about the times he would watch it with his mother – how it somehow made what was already his favorite movie even more precious to him.</p>\n<p>Nearing the bed, Derek reaches for the remote to change the channel, but Stiles knocks his hand away with his snout.</p>\n<p> “No, I want to watch it,” he insists. He’s not doing it solely for Derek – it’s a great movie – but he kind of feels like he is when Derek looks at him in surprise, expression wary. “It features me, after all.”</p>\n<p>When Derek’s stare goes blank, Stiles rolls his eyes. “You know, R.O.U.S’s? Rodents of Unusual Size?”</p>\n<p>“Foxes aren’t—“</p>\n<p>“Oh my <em>god</em>, shut up and watch the movie.”</p>\n<p>Derek hesitates only for a second, before sliding into bed. He sits up against the headboard and pulls the blankets over his lap, leaving a space beside him that looks far too comfortable for Stiles to pass up. He bounces into the spot, the mattress shaking from the movement, and curls up with his tail around him. Derek makes a sound of amusement, fingers rubbing gently against the top of Stiles head.</p>\n<p>As the movie runs, Derek’s caresses don’t stop. Stiles eyes drift closed despite his efforts to stay awake, the attention mixing with the warmth he feels lulling him. He falls asleep to the sound of Derek’s rumbling chuckles and the murmured echoes of lines from the film.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stealing bacon is much easier when he has an accomplice, Stiles realizes in the morning. The second his head crests the table, Stiles catches Derek’s gaze. This time, however, the man doesn’t just go back to reading the newspaper. Instead, he leans forward slightly and begins to ask Lydia – the closest to the plate of bacon – if she thinks she’ll be able to work some of the spells in an old book Deaton gave her. She scoffs, turning fully away from Stiles and the bacon to lay down on Derek exactly how she’ll be able to work <em>all</em> of the spells in the book.</p>\n<p>His friends are focused on the conversation between Derek and Lydia, totally distracted, and Stiles decides to go big or go home.</p>\n<p>Opening his mouth wide, he slides the bottom of his jaw under the slices, managing to shovel in the majority of the bacon before he snaps his teeth shut. Involuntarily, he makes a pleased noise, stilling when everyone looks over.</p>\n<p>“<em>Stiles</em>!” Lydia screeches, reaching for him. He’s too fast, bouncing off the table with his treasure secured, cackling as he runs down the hall.</p>\n<p>He turns a corner and slows, beginning to chew his prize.</p>\n<p>Derek has always made an excellent partner-in-crime.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB-bacon.jpg\" alt width=\"600\" height=\"307\">\n</p>\n<p> </p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Grrr.” Stiles wrinkles his nose, pressing the tip against the mirror. He watches the way his alien facial muscles shift and change.</p>\n<p>It’s been almost three weeks and he’s still a fox.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles is staring distractedly at a finch fluttering in a tree out the window, Derek reading pages of a text scanned and emailed to him on the computer, when Stiles tunes back in and says, “Teach me werewolf.”</p>\n<p>He turns his head away from the window to look at Derek, and Derek returns the gaze with a cocked eyebrow.</p>\n<p>“Don’t tell me it’s like different pitched howls, man. That’d be really anticlimactic.”</p>\n<p>Derek rolls his eyes.</p>\n<p>“You don’t speak it,” he dismisses, like it’s something that’s supposed to be obvious. With a shrug, Stiles settles himself in deeper in Derek’s lap.</p>\n<p>“Cool. That makes it less stupid.”</p>\n<p>“Stiles.”</p>\n<p>“I’m serious! Okay?” he insists, “I really wanna learn to read this bizarre wolfy language of yours.” Dropping his head against Derek’s chest, Stiles stares at the bottom of his chin. “Or are my bicuspids not sharp enough to be worthy? Be honest, you can tell me if this new look isn’t working for me.”</p>\n<p>“You’re an idiot.”</p>\n<p>Stiles leans up and nips at Derek’s jaw in retaliation, definitely not thinking of how it’d come off if he were human.</p>\n<p>“An idiot who will know how to read Werewolf,” he agrees good-naturedly, awkwardly trying to elbow Derek’s stomach. “Ah? Ah? Suck on that, Lydia.”</p>\n<p>Derek flicks Stiles in the ear.</p>\n<p>“It’s complicated,” he admits, shifting to sit straighter. It jostles Stiles, who tries to re-arrange himself without falling off. “Don’t say I didn’t warn you.”</p>\n<p>Tail smacking Derek in the face as he darts up, Stiles puts his front paws on the desk, excitedly leaning forward.</p>\n<p>“I won’t, I won’t. C’mon.”</p>\n<p>A sigh escapes from Derek, tinged with a long-suffering edge to it, as he begins to explain.</p>\n<p>‘Werewolf’ turns out to be a strange mix of pictograms and letters – or, if he’s being specific, pictograms that <em>look</em> like letters. Letters that are some hybrid of Asian, Arabic, and Russian. Derek was right; it’s complicated. Disguised as a fluid series of words in the traditional sense, each “letter” is actually a symbol with its own, specific meaning that changes depending on what it’s grouped with.  Hieroglyphics for a mythical race. </p>\n<p>Stiles guesses it really is a non-werewolf-proof way of concealing sensitive information, throwing off anyone who stumbles upon it. They’d be sent in the wrong direction with almost any attempt to decipher the text, kind of like the text itself is booby-trapped.</p>\n<p>He has to give the wolves credit where it’s due: It’s pretty badass.</p>\n<p>Derek explains the concept of dialects, how it’s similar to those of spoken languages; there are werewolves all over the world and sometimes symbols are drawn or translated differently.</p>\n<p>By the time the lesson is over, Stiles can make out the words “hunter”, “human”, “wolf”, and “pack”. He feels accomplished. Proud, even, when Derek sounds impressed.</p>\n<p>The sky has become darker outside the window and the finches are long gone. Stiles settles back into Derek, nestling himself into the crook of Derek’s arm as it rests on his knee. He watches quietly as Derek continues to research, clicking on links sent to him by whoever is on the other side of the IM window.</p>\n<p>“Is that Peter?” he hazards after a while, blinking as the bright illumination from the computer screen becomes the only source of light in the room, the sun setting fully outside.</p>\n<p>“Yeah,” Derek mutters distractedly, fingers moving quickly over the keyboard.</p>\n<p>Turning his face into Derek’s arm, Stiles nuzzles into it, trying to hide himself from the monitor’s glow.</p>\n<p>“Tell him I hate him,” he says tiredly.</p>\n<p>The fingers pause on the keyboard, and then Derek chokes back a laugh, something that sounds like he’s genuinely amused but is trying not to be. If Stiles weren’t so comfortable, he’d be heading out the door to get away from the tickling warmth that floats down his spine at the noise.</p>\n<p>He’s just really comfortable, is all.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>A month passes and no one is any closer to finding a cure.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>That day, she was amazed to discover that when he was saying \"As you wish\", what he meant was, \"I love you.\" And even more amazing was the day she realized she truly loved him back.</em>\n</p>\n<p>-          <strong>The Princess Bride</strong></p>\n<p> </p>\n<p> </p>\n<p></p>\n<p> <img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\"></p>\n<p> </p>\n<p>The first time Stiles gets sick from eating cereal, he thinks it must have been a bad batch. He stays away from it the rest of the day, nibbles on pieces of fruit Allison sets out for him, and has a few slices of the pizza they order for dinner. By the time night falls, he feels sluggish and achy, hot all over. He curls up with Scott on the couch, whimpering as his best friend scratches his head.</p>\n<p>“Sorry you feel sick, buddy,” Scott says, fingers moving down Stiles’ back.  It feels good, but as Stiles tries to shift closer, bury his face into Scott’s thigh, it isn’t enough. He whimpers again, just wanting the gross feeling to stop.</p>\n<p>Reaching across Scott’s lap, Allison drops a reassuring hand on Stiles’ neck. He appreciates the gesture, but it does little to soothe him.</p>\n<p>When Derek passes by a few minutes later, something tugs at Stiles internally and he lets out a pained whine. He hears Derek take a few steps back until he’s behind the couch, looking down at the fox.</p>\n<p>“Stay,” Stiles mutters, weakly pushing away from Scott to maneuver himself into the empty end of the sofa. Stiles keeps his eyes closed, he’s not sure what – if any – looks are passed around between Scott and Derek. But within a few seconds, Derek is lifting him up and taking a seat on the cushions, holding Stiles in his lap.</p>\n<p>Some of the pain goes away, leaving him with just a tender feeling in his muscles instead. He nuzzles at Derek’s hand, which obediently starts rubbing his back.</p>\n<p>He doesn’t know what it means that Derek can do this for him when Scott can’t; he just knows that, in the moment, he doesn’t want it to stop.</p>\n<p>He wakes up in the morning still feeling ill and it’s decided that Derek will be the one to take him to see Deaton, Derek voted as the one most likely to be able to get in and out of Beacon Hills without anyone stopping him to chat.</p>\n<p>When they get into the car, Stiles doesn’t get the hoodie treatment. Instead he gets a blanket to lay on and Derek keeps his hand on Stiles’ back the entire ride.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Food poisoning,” Deaton says simply, pulling his fingers out of Stiles’ mouth. Stiles’ feels distinctly violated after the examination.</p>\n<p>“I knew that cereal was bad,” he mutters, laying down on the cold steel. Derek’s fingers playing with his tail make it a little better.</p>\n<p>“Yes,” Deaton agrees, putting away his instruments one by one into the drawers. “It was the cereal. And the pizza. And the brownies and candy.”</p>\n<p>“Come again?” Stiles says, lifting his head up enough that he can eye Deaton suspiciously. The doctor sighs and shakes his head, coming to stand next to Derek.</p>\n<p>“Stiles, you’re a fox now, as much as your brain doesn’t think you are. And while you could get away with it at first, as your body becomes more used to being a fox-”</p>\n<p>“He needs a diet for foxes,” Derek finishes. He doesn’t sound surprised and tugs a little at Stiles’ tail. Stiles has enough energy to lean over and lightly gnaw on Derek’s hand in retaliation.</p>\n<p>Deaton silently watches the affection play out, waiting until Stiles finally unhinges his jaw, leaving Derek’s skin littered with bite marks. Derek’s still got his fingers twisted in the fur of Stiles’ tail.</p>\n<p>“You two have bonded quite well during this,” Deaton observes with a smile. Derek shoots him a dark look that Stiles doesn’t really understand.</p>\n<p>“He’s okay,” Stiles shrugs, twisting himself so that he can bite at Derek’s wrist instead. “He hasn’t tried to throw me against a wall yet, so.”</p>\n<p>“Oh, I don’t know,” Deaton muses, something secretive in his tone. “I don’t believe you’re in any danger from Derek.” He pauses and it seems like it’s more for dramatic effect than anything else. “At least not in that regard.”</p>\n<p>Stiles looks up from where he’s using his teeth to tug at Derek’s shirt sleeve. He spits out the material to talk.</p>\n<p>“What, you mean like he’s gonna bite me?”</p>\n<p>“<em>Yes,</em>” Derek cuts in before Deaton can answer, glaring at the doctor warningly. “That’s exactly what he means. Can we skip to helping Stiles not feel like shit?”</p>\n<p>Deaton’s expression is smug for some reason, which increases the intensity of Derek’s scowl.</p>\n<p>“Of course.”</p>\n<p>It comes down to Stiles having to stay away from any processed human food, Deaton being lenient enough to allow Stiles to indulge once every few days if he can’t hold off his craving. He gives Derek some vitamins and medication to help get Stiles on track and tells them to call in two days if Stiles isn’t doing better.</p>\n<p>Stiles wishes that didn’t imply that in two days he’ll still be a fox.</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles doesn’t mind that he’s adorable, he decides as he stands up on his hind legs in front of the mirror, tail wagging.</p>\n<p>There are worse things than being adorable.</p>\n<p>Like still being a fox.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The pack is having another water gun fight and this time, instead of sitting beside Derek, Stiles is lying in his lap as they watch the group engage in mock warfare. There’s this sort of restless sensation that feels a little like it’s tearing at Stiles from the inside when he’s away from Derek for too long, and Stiles could examine it but he won’t. Instead, he just gives in and curls around Derek as much as possible.</p>\n<p>“Jackson’s going to let Lydia trick him again,” Derek predicts, letting Stiles partake in his new favorite activity of gnawing on Derek’s hand. When a particular patch of skin gets raw, he merely gives Stiles a new area to mouth around.</p>\n<p><em>That’s exactly what’s going to happen</em>, Stiles wants to say, but he can’t quite get the words out. He can feel the pulse of Derek’s fingers, the rush of blood, and something like that sense of restlessness is wondering what would happen if Stiles were to just—</p>\n<p>Derek winces, but doesn’t jerk, doesn’t even really make a sound. The metallic taste is already on Stiles’ tongue before he realizes what he’s doing.</p>\n<p>Jolting out of Derek’s lap, Stiles stumbles away, horrified at what he’s done. It’s not bad, Derek just shakes out his hand and the teeth marks heal almost instantly; it’s something a playful animal would do, which is what’s making a repulsive shiver crawl along Stiles’ back.</p>\n<p>Stiles is not an animal.</p>\n<p>“Oh god, I’m so—“</p>\n<p>“Stiles, it’s okay.”</p>\n<p>“I’m gonna go now,” Stiles says anyway, despite Derek’s attempts at reassurance. He races back into the house, up to the guest bathroom, the room that always smells like fox, and hides himself in the towel basket. It’s the one place Derek might not be able to find him.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Derek is upstairs, Stiles can <em>feel</em> him, but aside from a concerned look Derek briefly threw him on his way up, he hasn’t tried to initiate any sort of contact with Stiles.</p>\n<p>Stiles isn’t really sure if he’s offended or relieved or thankful. Whatever he is, he’s still acutely aware of Derek’s presence even while sitting with Scott on the couch.</p>\n<p>Lydia drops beside him, pokes at his thigh, and he halfheartedly kicks at her.</p>\n<p>“Stop sulking,” she demands, grabbing the remote from the coffee table to change the channel on the TV.</p>\n<p>“Hey, I was watching that!” Isaac snaps. Lydia smiles sharply at him, waving the remote in her hand.</p>\n<p>“And now you’re not.”</p>\n<p>Rolling his eyes, Isaac sinks back into his beanbag chair.</p>\n<p>“I’m not sulking,” Stiles grunts, turning his head into Scott’s fingers as they scratch behind his ear. He closes his eyes and he knows exactly when Derek leaves his room to go to the bathroom. Groaning, Stiles rolls over onto his back.</p>\n<p>“That’s exactly what you’re doing,” she says, continuing to flip through the channels, lips pursed as she eyes the screen. Scott makes a few aborted movements every time she passes something he might be interested, like he thinks he wants to stop her, but then remembers who he’d be going up against. Eventually, she settles on something about astrophysics on the SPACE channel that nobody wants to watch but her.  “I don’t know what you did – Derek wouldn’t tell us what happened,” she continues, “But you’re overreacting because he’s not even mad. So stop sulking.”</p>\n<p>Stiles is only mildly surprised that Derek didn’t mention the biting incident to the others; he didn’t really think Derek would, figures it’s not even a big deal for someone who’s been shot by bullets and arrows on a regular basis.</p>\n<p>The fact does nothing to make Stiles feel better.</p>\n<p>He sleeps at the foot of Scott’s bed, tries not to be as fitful as he wants to be, and when he wakes up he’s curled next to Derek, with Derek’s arm creating a secure nest around him. He’s not really sure how he got there – whether he sleepwalked or Derek came and grabbed him somehow without waking him up – but when he starts to shift, Derek cracks a tired eye open and mutters, “Go back to sleep.”</p>\n<p>“Fine,” Stiles grouches. To show how begrudging he is, he waits all of three seconds before nuzzling his snout under Derek’s chin and heeding the orders.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>No one seems surprised when Stiles follows Derek downstairs in the morning.</p>\n<p>He hates every one of them.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Boyd had gotten Stiles a small, red ball as a joke, teasingly throwing it across the room and telling Stiles to go “fetch”. That had been several weeks ago, and while the angry claw marks on Boyd’s thigh have long since disappeared, Stiles still gets a sharp pang of irritation whenever he looks at the ball.</p>\n<p>He also has recently started getting the urge to pounce on it.</p>\n<p>He watches with wide eyes as Allison absentmindedly uses her toe to roll the ball around on the floor in front of the couch, attention focused on the book in her lap. She pulls it in, then lets it go, the object travelling across the carpet. It doesn’t get far, before Stiles leaps onto it, the plastic squishing between his teeth, his claws grabbing at it. He lets out a happy sound and his struggles throw him onto his back as he continues to attack the ball in his grasp. It slips out from between his teeth and goes flying and Stiles darts up to chase after it.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“I want to research fox mythology,” Stiles announces as he gets into Derek’s lap, the man only shifting to get comfortable under the new weight. Stiles peers at the screen and can understand only the word “human” of all the text on the page Derek has up. “I want to see what would happen if I became a werefox. Like, I wouldn’t be affected by the full moon, right? I think that’s pretty much just a wolf thing.”</p>\n<p>Derek doesn’t argue with him, or tell him he’s an idiot (which, to be honest, Stiles was kind of expecting); he just googles the requested fox mythology and allows Stiles to take the lead.</p>\n<p>Stiles figures he has enough to worry about without adding in Derek’s new silent act, so he doesn’t concern himself with wondering why Derek barely says a single word the entire time, and why his chest twists uncomfortably just from the aura Derek seems to be giving out. It’s deeply pensive and distracted, like Derek can’t even pull away from his thoughts enough to do more than go through the motions when Stiles asks him to type something or give the mouse a click.</p>\n<p>Stiles doesn’t want to know, so he doesn’t ask.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles bounces around the kitchen, jumping up on his hind legs to block people from walking over him, get them to pay attention. He drops his paws briefly on the island, then pushes off the counter, darting back and forth in front of Scott as he tries to pass by.</p>\n<p>“I wanna go outside!” he yips, musical notes of the birds in the woods hitting his ear, giving him an edgy feeling of wanting to run, to <em>pounce.</em></p>\n<p>“Dude, you just went to the bathroom like an hour ago.”</p>\n<p>Shaking his head violently, the motion moving all the way down his body, Stiles yips again, this time a more feral noise. His nerves feel constricted, like they’re bursting with something powerful and itchy, and all Stiles can think is that the house is so <em>small</em>.</p>\n<p>“No, no, no! I wanna go <em>outside,</em>” he pleads, “You know, commune with nature. Paint with all the colors of the wind!”</p>\n<p>“Someone been giving the little guy sugar?” Boyd chuckles, lifting Stiles up with a single hand. He tucks Stiles under his arm like a football, completely unaffected by the struggles and cries of indignation. Stiles bites at Boyd’s bicep and the asshole doesn’t even wince.</p>\n<p>“I think he just woke up like that,” Scott shrugs, pulling out the apple juice now that he’s free to get to the fridge. “I heard him running around Derek’s room when I got up.”</p>\n<p>Stiles gnaws a line down Boyd’s forearm, legs scratching anything he can reach as he thrashes and tries to get away.</p>\n<p>“Derek finally sick of him?”</p>\n<p>“Hey!” Using everything he’s got, Stiles leverages his hind paws against Boyd’s back and bicep, roughly yanking his body, wiggling to slide through the grip. He pops out behind Boyd, squawking as he tumbles into the wall.</p>\n<p>“He’s taking a shower,” he huffs, glowering at his friends upside down, the lower half of his body propped against the wall. “He can’t get sick of me. You guys, I’m adorable.” He’s finally come to terms with it.</p>\n<p>Flipping over to right himself, he chooses to ignore the incredulous snorts.</p>\n<p>“Sorry, bro,” Scott says as he approaches. He leans down to scratch at the top of Stiles’ head. “Allison, Jackson, Lydia, and I are heading back to Beacon Hills for the day to meet up with Dr. Deaton.”</p>\n<p>Stiles halfheartedly snaps his teeth at Scott’s hand. “Why can’t I come?”</p>\n<p>“Because if we run into your dad,” Allison cuts in, bending low to get down next to them, “then Scott doesn’t have to lie to him when he says you stayed back at the lake.”</p>\n<p>Stiles splutters, feeling betrayed by the one with fingers of gold.</p>\n<p>“Whoa, hey,” he objects, jumping up to his feet. He feels jittery still, like those days when he had taken too much Adderall – or not enough Adderall – before he switched to his non-stimulant medication; he wonders if maybe Scott put too much of his Strattera into his food last night.  “Who’s side are you even on?”</p>\n<p>Eyebrows raising the slightest fraction, Allison stares at Stiles like she’s not sure if he’s joking.</p>\n<p>“Scott’s,” she says flatly, the corner of her mouth quirking up. “I’m on Scott’s side. Of course I’m on Scott’s side.” With a laugh, she cups Stiles’ face in her hands and pulls him up to place a kiss on the top of his head. “No matter how adorable you think you are.”</p>\n<p>“He thinks he’s pretty adorable,” Isaac adds with a smirk, totally unnecessarily, and Stiles will remember this when he has opposable thumbs again.</p>\n<p>Not that he can do much to Isaac even when walking on two legs.</p>\n<p>“When this is over, you can all lose my number,” he grumbles, narrowing his eyes when Erica ‘aww’s at him. His ears perk up as the bathroom door opens upstairs, fur rustling over his body when the scent of Derek’s aftershave reaches him.</p>\n<p>Everything happening in the kitchen is lost to him, as Stiles experiences a rapid surge of that same giddy energy, manic and coursing and almost painful. He races up the steps, arriving just as Derek’s sitting on his bed to pull on his sneakers.</p>\n<p>“I wanna go outside!” Stiles tries again, flying at Derek’s feet. He gnaws playfully at the shoes, staring up at Derek with wide eyes, tail pounding the floor behind him. Derek does a terrible job at looking more irritated than amused, and Stiles knows he was right.</p>\n<p>He is fucking adorable.</p>\n<p>“So go outside,” Derek retorts dryly, batting Stiles’ face away so he can tie his shoelaces.  “Scott can take you.”</p>\n<p>Stiles flops dramatically onto his side, then rolls over to gaze at Derek imploringly.</p>\n<p>“Scott is going out for the day! And so is Allison!” Whimpering, Stiles ducks his head down, dropping his chin onto his paws. “Everyone else makes fun of me and I might have to give them rabies. No one wants that.”</p>\n<p>“Stiles,” Derek says, with a surprising amount of patience, “Werewolves can’t-“</p>\n<p>“Oh my goddddd, shut up and just take me outside!”</p>\n<p>“Stiles-“</p>\n<p>“Too late!” Stiles cries, bouncing to his feet. He hops around the room, arms extending to pounce on every little object lying on the floor. “I’m gonna go outside and you have to come because there are things that eat little foxies out there and sarcasm is my only defense.”</p>\n<p>“Stiles!”</p>\n<p>Cackling, Stiles bounds out of the room, breaking into a run. Erica is there to open up the door for him when he gets downstairs, finally consenting when she hears Derek calling his name and knows that he’ll be safe with Derek coming after him. He barks happily at her and darts into the yard behind the house, racing into the growth of trees just beyond. It feels exhilarating, like something is cracking open inside of him, and Stiles can see and smell and breathe in the world and it’s so different than it was before; it feels like this is how it should be.</p>\n<p>It doesn’t take long for Derek to catch up with Stiles. He can hear the werewolf approaching, leaves and branches crunching, the heavy pounding of feet on the ground. Stiles knows he can’t outrun Derek even if he tries, but he doesn’t slow down, his gleeful laughter echoing as Derek tackles him, scoops him off the ground so that as they tumble and land he doesn’t crush the small animal. Derek breaks their fall, grunting in discomfort, and Stiles can’t stop laughing, blood still hurtling through his veins.  There are claws in Stiles’ side, just on the edge of painful, but they don’t break skin; even when lying on the forest floor, panting as he stares up at the tree canopies like he’s wondering why whoever is up there hates him, Derek remains in complete control.</p>\n<p>Pushing himself up to his feet, Stiles crawls up Derek’s chest, looking down at the man’s face with a grin. Derek glowers at him, unamused, and all it does is tempt Stiles’ limbs to break off into another sprint.</p>\n<p>As if sensing the urge, Derek wraps his arms fully around Stiles, pulling him down to his chest.</p>\n<p>“Stay,” he orders. It sounds like a terrible idea, like it’s the last thing Stiles wants to do, and he’s just about to break away when he catches movement out of the corner of his eyes. Unbidden, every muscle in his body freezes, and he’s not sure what’s happening, except that it feels like what’s supposed to happen. Everything shifts to autopilot, as Stiles lowers himself to Derek’s chest, gaze seeking out the rabbit he can smell somewhere up ahead.</p>\n<p>“Stiles,” he hears Derek say fuzzily, the words slurring in his mind. He compresses his body, tightens everything together, and slips out of Derek’s arms easily. He can hear the animal munching on thistles, knows exactly where it is by sound and smell alone. Silently, he maneuvers over the landscape, his paws landing just where he needs them to for him to avoid detection, nose dragging on the ground to keep on the correct path.  Twitching ears become just visible over blades of grass and Stiles straightens, the calculations already in his head, already answered for him, just how far he needs to jump, at what angle, at what speed.  His entire body lifts off the ground as he propels himself at his prey, a high arc that lands him exactly where he needs to be, jaws closing in around coarse fur, a rapidly beating heart against his tongue. As he applies pressure, he hears bones crunch satisfyingly, tastes the still warm blood that coats his teeth. When the rabbit finally stops moving, when Stiles’ tongue can no longer feel the heartbeat, he drops his prey on the ground and begins to tear into it, devouring bone and chunks of flesh that still taste like life.</p>\n<p>Soon, there’s nothing left but a few clumps of fur in a mass of red in the dirt, and he’s still hungry, still needs to hunt. His next potential meal comes in the form of squeaks from a short distance away, and his brain supplies him with the knowledge -- a small group of field mice, just beyond the trees. He dashes toward where he knows the mice will be, navigating the land with ease. He has the clearing in his sights when a massive wolf steps out before him, howling, bellowing, demanding that the fox turn back around. The fox tries to sneak by it, off to its side, but the wolf meets him there with a menacing growl. Its eyes flash red, raising the fox’s hackles—</p>\n<p>Stiles blinks, staring up at Derek in confusion as the man stands in full Alpha mode, eyes glowing, features morphed.</p>\n<p>“Derek?” he croaks, wondering why it takes effort to use his voice.  Derek instantly melts back into his human self, looking concerned and focused on Stiles in a way that fills the pit of Stiles’ stomach with bile.</p>\n<p>His mouth tastes weird – raw and rancid and <em>wrong.</em> When his gaze moves down to his paws, he sees the fur matted with blood – blood that he knows is not his own – and it all comes back to him.</p>\n<p>In more ways than one.</p>\n<p>Derek gently runs his fingers over Stiles’ back as he vomits.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>“Am I a monster?” Stiles asks weakly, eyes following Derek’s every motion as he scrubs the blood from Stiles’ paws. The scent of the soap is grounding in how human it is.</p>\n<p>“You ate a rabbit,” Derek mutters, running the rag under the water.  “You didn’t massacre a village.”</p>\n<p>Stiles nods sullenly. His stomach lurches and twists as he watches the blood coat the sink, travel down the drain. He thinks of the way the betas all tensed when Derek carried him into the house, could probably smell the rabbit’s death on him, and thinks he might throw up again.</p>\n<p>“Am I an animal?”</p>\n<p>Derek’s response is instant.</p>\n<p>“No.”</p>\n<p>After placing Stiles down by the kitchen sink more gently than necessary when they’d arrived back at the house, Derek had demanded everyone leave the room and had then disappeared upstairs. When he came back, he was talking on his cell phone, a new tooth brush in hand, and Stiles could hear Scott’s voice on the other end.</p>\n<p>He’d wondered how hard it would be to shove his snout into the drain and turn on the garbage disposal.</p>\n<p>“Am I becoming an animal?”</p>\n<p>This time Derek hesitates. It’s only a split second, would be completely imperceptible if Stiles were human. But he’s not, and that’s the problem.</p>\n<p>“…No.” It’s not convincing, not with the underlying layer of concern. He looks back at the metal of the sink and does not wonder if the clump that just washed out of his claws was a residual piece of rabbit.</p>\n<p>“If I do, can I be your plucky pet fox?” he says casually, trying to lighten the mood, if only for himself. “I’ll be an awesome pet. I’ll learn tricks. I won’t pee on things unless you’re a dick.”</p>\n<p>“Stiles, you’re not turning into an animal.” More conviction from Derek this time, but Stiles is sure it has more to do with Derek’s frustration than his belief. “We’ll figure this out.”</p>\n<p>Stiles appreciates the attempt but–</p>\n<p>“Yeah, but what if we don’t, man? I mean, what if there’s nothing we can do, and I can never go home and see my dad again, and he’ll have lost his son, and I won’t even care because in a week I won’t even remember his name?”</p>\n<p>“Stiles,” Derek says firmly, “We will.”</p>\n<p>Stiles is not in a place where he feels like being patronized, the idea of what would happen to his father if he never turned back, if he lost himself again, only just hitting him as he speaks.</p>\n<p>Ducking his head, Stiles meets Derek’s eyes and says seriously, “Derek. But what if we don’t?”</p>\n<p>Derek holds his gaze for a long moment, then looks down, scrubbing harder at the darker red on Stiles’ orange colored fur. It hurts, but Stiles doesn’t wince, just stares at the way Derek’s shoulders are tensed, how he seems like he’s trying to get himself under control.</p>\n<p>Finally, Derek glances up, his eyes dangerous, his voice grim and flat when he speaks.</p>\n<p> “If we don’t, then I’m gonna find that witch,” he promises. “And I’m gonna kill her.”</p>\n<p>Stiles is silent as Derek grabs the tooth brush and rips open the packaging, but his heart hurts.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles feels physically cleaner once his mouth and fur have been scrubbed to remove all traces of his kill, but he’s not sure the taste will ever go away.</p>\n<p>There’s a part of him lurking in the shadows of his mind that doesn’t want it to and that terrifies him.</p>\n<p>All the jokes he’s made about the werewolves eating cute little forest animals, crunching the bones of their enemies, are suddenly not funny anymore.</p>\n<p>He wonders if this was what Scott felt like when he turned.</p>\n<p>It’s not as cool as he thought it’d be.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>The pit of despair! Don't even think about trying to escape. The chains are far too thick. Don't dream of being rescued, either; the only way in is secret.</em>\n</p>\n<p>-          <strong>The Princess Bride</strong></p>\n<p>\n<strong> </strong>\n</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>He needs to get away from Derek, needs a break. There’s a foul pressure in his chest whenever he thinks of the wrath in Derek’s expression – that the rage was on his behalf.</p>\n<p>So he lies down next to Isaac in front of the TV, listlessly telling him what buttons to press to get through the water temple in Zelda. Isaac follows his advice, probably feels sorry for him, but it’s better than the concern and flashes of fear that Derek gets when he looks at Stiles.</p>\n<p>Up until now, Stiles had been confident that, even with the increasing moments of shifting into something more feral, he’d still eventually return to being a human. He’s never lost himself like he did today, though, and now the future is far more uncertain.</p>\n<p>When he thinks about Derek, he realizes he’s never once toyed with the idea of what might happen between them if he were to become human again – not even when he’d fully expected that he would turn back to normal. He figures he had probably assumed that everything would just translate to his <em>Homo sapien</em> form, that he’d still harbor a stupidly awkward crush on the guy and do his best to ignore it and hope it went away. It should be easier when he’s not constantly curling up to Derek, or nestling in his lap, unable to use the excuse of being a small animal anymore.</p>\n<p>He wonders if that means he’d no longer get the glimpses into Derek that no one else sees – the laughs and smiles of genuine pleasure in quiet moments, the way Derek loves reaching out and having something living next to him to touch, the way he can quote a 1980’s romantic comedy from beginning to end. He’s never stopped to question if Derek was only letting his guard down so fully because Stiles was a fox -- something Derek subconsciously translates to “not human” for all of his insistences that Stiles isn’t an animal -- or if it was something about Stiles just being <em>Stiles</em>.</p>\n<p>He lets his mind wander to thoughts of what would happen if today was a sign of some sort of deterioration, if it means that maybe he can’t be changed back after all, will eventually become fully wild. He swallows thickly around the feeling of nausea. If he doesn’t get changed back, he can’t go home, can’t hug his dad, can’t go to college, can’t drive his jeep. There’s a path that he allows his mind to follow that leads to Derek and it feels clearer, no more detour signs posted now that it’s something that he might have a chance of losing.</p>\n<p>He doesn’t want to lose those glimpses, those secret moments of intimacy, the way he’s so familiar with Derek’s body that he recognizes his stupid deodorant. He doesn’t want to lose the feeling of Derek’s ribcage expanding as he breathes underneath him, the way his very human heart beats in a steady rhythm in contrast to Stiles’ own slightly off kilter tempo.</p>\n<p>It’s so much easier to be braver, Stiles thinks wryly, when having the things you love ripped away from you is such an enormous possibility. But he does feel braver in his head now, where he's human again and he tells Derek how he feels, tells him all the ridiculous things he loves about him, tells Derek he can still flick his ears and pet his head and teach him how to read stupid mythological languages, but that he absolutely cannot just go back to being just a friend with no deeper connection than repeatedly saving each other’s lives.  </p>\n<p>Stiles learned the hard way that you really don’t know what you have until it’s missing from your life. And while, if Stiles stays a fox, he’ll probably never know what he’s missing, the thought of not having it, not ever having it, is enough to make him walk away in the middle of Isaac’s game to go find Derek.</p>\n<p>He’s passing through the kitchen when Derek comes in through the hall and stops short when he sees Stiles, keys spinning in his fingers.</p>\n<p>“Are you going out?” Stiles frowns, trying to hide his disappointment. Derek rolls his eyes and holds up Stiles’ hoodie.</p>\n<p>“We are,” he corrects. Stiles instantly brightens, tail wagging behind him as he follows Derek out the door to the Camaro. Once he jumps inside, he obediently squirms his way into the sweatshirt.</p>\n<p>“Where are we going?”</p>\n<p>Shrugging, Derek starts the engine. He turns on the headlights, the sun fading in the distance.</p>\n<p>“For a drive.”</p>\n<p>Stiles mouths a silent “oh,” Derek’s response clearing up nothing; it’s obvious the man has a destination in mind. Rather than worrying about it, he curls up in the seat and spends his time enjoying the way he can hear Derek breath, the sounds of classic rock on the stereo. Whenever he would drive with Derek as a human, their silence was always companionable; now it teeters on the edge of intimate.</p>\n<p>He doesn’t want to lose this.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles has kept his head down for the majority of the drive, hasn’t been paying attention to the turns Derek’s made. When the car finally idles, Derek putting it in park, Stiles feels something sharp rattle inside him as he sits up. A block away is his house, the kitchen light on, clearly visible in the darkness.</p>\n<p>“Wh…What-“ he stutters, turning to Derek for an explanation.</p>\n<p>Derek shrugs again.</p>\n<p>“I wish I’d known that losing my family was a real risk the last time I saw them,” he says simply, watching the Stilinski house. “Even if it was just when I was watching my mom water her garden as we drove away in Laura’s car.”</p>\n<p>He doesn’t give Stiles a chance to speak, just reaches over and opens the passenger side door for Stiles to get out.</p>\n<p>“Go.”</p>\n<p>Everything feels so immense about what’s happening; the sensation hurts, wants to claw its way out of his skin. Swallowing, Stiles nods, carefully slipping out of his hoodie and dropping out of the car. He turns to look at Derek over his shoulder.</p>\n<p>“You’re not gonna leave me are you? Like, this isn’t just some plan to get rid of me so that someone comes along and tries to shoot me and—“</p>\n<p>Derek gives him a pointed look and closes the door on him.</p>\n<p>“Wow, rude,” he huffs. “Taking the hint!”</p>\n<p>Sticking out his tongue at the car, even though he knows Derek can’t see him, Stiles begins his trek to his house. The streets are empty, no one around to spot him and call animal control or scare him off, and Stiles just hopes that remains the case. Still, he speeds up his pace.</p>\n<p>As he climbs up the steps of his porch, he hesitates, unsure if he really wants to do this. When he looks back at the car, he can’t see anything through the tinted windows, but he knows Derek’s gaze is on him. He has no way of identifying what the expression would be, but it’s encouraging all the same. Nodding to himself, Stiles continues the way up the rest of the stairs, before creeping up to the brightly lit window.</p>\n<p>He peers over the edge of the windowsill timidly, hoping to whatever god is up there that his father isn’t facing in his direction; he’s not, distracted by Scott’s mom as she cooks him dinner.  They’re laughing, having what looks like a date night, and everything aches at the thought of Stiles not having this again, of reaching a point where he doesn’t even care. The lines on his father’s face are warm, he looks happy, and Stiles has trouble breathing. He remembers what his father looked like when they lost Stiles’ mom, remembers how broken he was. He doesn’t want to think about the expression he’ll be wearing if Stiles never comes home.</p>\n<p>He hears someone come up behind him, and by scent alone can tell it’s Derek.  A hand rests on his back, Derek quietly says, “C’mon,” and Stiles has to tear his gaze away from his window with the knowledge that it might be the last time he sees his father.</p>\n<p>He’s glad he got the chance.</p>\n<p> </p>\n<p></p>\n<p> <img src=\"http://dauntingfire.com/tw-rbb1/RBB-house-small.jpg\" alt></p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>They head to the Hale house with bags of junk food, the first junk food Stiles has been allowed in weeks, and the area is deserted enough that they can sit on the hood of Derek’s car without worrying about Stiles being seen. The stars are bright little pinpricks in the sky, even with the glow from Derek’s headlights filling the area, and the familiar terrain makes Stiles feel a little less alien.</p>\n<p>He hasn’t thanked Derek for what he’s done – not just tonight, but since this whole ordeal started – and somehow he knows he doesn’t have to. For years, he and Derek have had the ability to communicate things without words, like Stiles can also do with Scott. He never realized how big it was that he could have that same kind of understanding with Derek.</p>\n<p>Maybe his interactions with Derek over the past few weeks hadn’t come out of nowhere after all.</p>\n<p>Leaning over, he digs his snout into the bag on Derek’s lap and emerges with a mouthful of curly fries, looking up at Derek guilelessly.</p>\n<p>“You have your own,” Derek points out, tone dry.  Stiles shrugs, chewing obnoxiously. When he swallows, he licks his lips with purpose.</p>\n<p>“Obviously yours taste better.”</p>\n<p>“Obviously,” Derek echoes with a snort. He moves the bag off his lap and places it beside Stiles, so Stiles will have easier access to it, then finishes up his burger in a few more bites.</p>\n<p>“Hurry up,” he says as he stands, wiping the crumbs from his jeans.</p>\n<p>“Uh, why?”</p>\n<p>“Just hurry up.”</p>\n<p>Stiles huffs, but Derek’s not acting like anything is wrong, and Stiles’ foxy senses aren’t tingling, so he’s not concerned about any immediate danger.</p>\n<p>“You know, cryptic is not a good color on you, dude,” he mutters, before digging in to the remaining curly fries. He finishes both his and Derek’s portions quickly, then jumps off the hood as Derek crumples up the trash. In a matter of minutes, they’re back in the Camaro and Derek is driving the bumpy path through the woods, down to the main road.</p>\n<p>This time, Stiles keeps his head up and remains alert, trying to deduce their destination. It rapidly becomes apparent within a few turns. Deaton’s office becomes visible in the distance and Stiles can see Allison’s car parked outside.</p>\n<p>Stiles makes a breathy noise that he hopes sounds like a sigh and throws himself back into his seat as they park.</p>\n<p>“And here I was thinking you were trying to cue me into the fact that you’d be into some bestiality. I mean dinner under the stars?” He pauses, feigning thought. “Is it bestiality if you’re part wolf? Anyway, man, super disappointing.”</p>\n<p>Stiles isn’t really sure what kind of a reaction he was expecting from Derek after his crass remark, but he’s positive the choked coughing fit wasn’t one of the potential options.</p>\n<p>“Get out,” Derek tries to growl, the effect ruined by his constricted throat.</p>\n<p>Stiles gleefully rolls down the window and leaps out.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>His good humor is hampered by the grave looks that greet Stiles when he and Derek enter through the waiting room. Even Jackson looks worried.</p>\n<p>Stiles isn’t an idiot.</p>\n<p>“There’s no fix, is there?” he states more than asks, surprised by how easily it feels like he’s accepting his fate. His dad will be all right; he’s got Scott and Momma McCall. He’ll be fine.</p>\n<p>“Not necessarily,” Deaton counters. He sounds cautious, but there’s no reason to believe he’s lying, so Stiles perks up. “It’s just that we still have an unlimited amount of resources to consult, which was fine before but now…”</p>\n<p>“There’s a timer on me?” Stiles supplies, putting it together himself. Deaton nods and Stiles subconsciously shifts so that he’s leaning against Derek’s legs. “How long?”</p>\n<p>“It’s hard to say,” Deaton admits. He eyes the physical link between Stiles and Derek in a way that Stiles isn’t quite sure he likes. “It could be days, weeks, months. I’ve never seen anything like this before. It just means now we have a new sense of urgency, not that you still can’t be fixed.”</p>\n<p>Derek must have caught Deaton’s gaze as well, because he gets down on one knee to scratch reassuringly down Stiles’ back as he listens, his expression suspicious.</p>\n<p>“I’d like to try something,” the veterinarian announces, before he disappears into the kennel. Scott has just begun to move over to Stiles, when Deaton returns with a familiar face. In his arms is a German Shepard puppy, one Scott lovingly named Scout, who had taken a particular liking to the wolves of the group. Deaton places the dog on the floor by Scott, who looks confused by Scout’s presence, but leans down to pet him anyway.</p>\n<p>Stiles isn’t really sure what’s going on, but he watches all the same as Scout barks excitedly, rolls over as Allison joins Scott in giving the puppy love.  Lydia extends her hand to pat at Scout’s head, but keeps her distance.</p>\n<p>“Derek,” Deaton says after a moment. “Would you call Scout over?”</p>\n<p>Derek’s eyes are narrowed as he glares at Deaton, and Stiles knows Derek is aware of what’s happening.</p>\n<p>He wishes someone would tell him.</p>\n<p>“Come here, boy,” Derek says with gritted teeth, like the words are being forced out of him. He doesn’t stop running his fingers through Stiles’ fur, actually starts pressing in harder.</p>\n<p>Scout bounds over happily, gets up on his hind legs and licks a sloppy trail where he can reach the bottom of Derek’s face. He drops his front paws on Derek’s raised knee and wags his tail.</p>\n<p>Stiles is not any less confused.</p>\n<p>“Stiles, could you come here for a bit?” Deaton asks, giving nothing away. Derek’s hand freezes on Stiles, holding him down.</p>\n<p>“Stiles,” he hisses. “Don’t.”</p>\n<p>“Derek, what-“</p>\n<p>“Derek,” Deaton admonishes, but there is a threat layered in the name. With tangible reluctance, Derek pulls away from Stiles, who looks at him questioningly. The man doesn’t remove his gaze from Deaton.</p>\n<p>“Go,” he mutters.</p>\n<p>Hunching his shoulders, Stiles warily begins to make his way to Deaton. He’s only gone a few steps when he hears Scout bark excitedly at Derek, his ears hone in on the sound of the mutt rubbing himself against Derek’s hand, his leg.</p>\n<p>His hackles rise and he whips back around, growling threateningly at the other animal. The mutt yelps, tripping over himself to hide behind Derek, pressing in close. Snapping his teeth, the fox lowers himself to the ground, back arching to appear more intimidating, showing his intent. The mutt lets out a whimper and darts to the other side of the room, trying to find safety with the other humans. The fox gives a menacing bark, a warning, and circles around his territory.</p>\n<p>He’s lifted into the air, brought against something solid, and the fox struggles until he’s hit with the scent of curly fries and Sprite.</p>\n<p>Stiles feels his lungs expand and constrict rapidly, it’s impossible for him to breathe. He gasps for air, feels like he’s drowning, and panic attacks are not any more fun when he’s not a human.</p>\n<p>Derek gets him to the examination table, keeps a comforting hold on him as Deaton slides an oxygen mask over his face.</p>\n<p>He can hear Derek yelling at Deaton, Deaton’s calm responses, and Stiles just wants it all to go <em>away</em>.</p>\n<p>He doesn’t want this stupid mask; he wants his inhaler, his human inhaler. He wants his dad and his mom and he doesn’t want to hear the anger in Derek’s voice because he knows he doesn’t deserve for Derek to care that much about him.</p>\n<p>It hurts, everything hurts, and Stiles pleads for it to stop.</p>\n<p>It does.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>When Stiles opens his eyes, Scott is looking down at him worriedly, scratching behind his ear. He’s in Scott’s lap, and when Stiles looks around, everyone else is gone. Tiredly, Stiles bumps his head against Scott’s chest, stares up at him.</p>\n<p>“Allison took Lydia and Jackson back to the lake. Derek is talking to Deaton.”</p>\n<p>“Sure that’s a good idea?” Stiles gets out, throat feeling thick and scratchy.  Scott laughs, gives a careless shrug.</p>\n<p>“Only reason I’m pretty sure it is, is because we probably need Dr. Deaton alive to fix you.” Scott grins slyly. “And Derek seems pretty invested in that, dude.”</p>\n<p>Groaning, Stiles buries his face in Scott’s arm.</p>\n<p>“I don’t wanna talk about it.”</p>\n<p>“Well, you’re talking about it.” A pause and then, “Stiles, he’s your anchor, man. That’s some serious stuff.”</p>\n<p>“I’m sorry you’re not my anchor,” Stiles mumbles, finding himself meaning it despite his using it as a diversion tactic. Scott scratches behind his ear again.</p>\n<p>“You’re not my anchor either,” he reminds Stiles, sounding stupidly logical. “We’re still best bros.”</p>\n<p>Stiles breathes in deeply, his chest still aching. “I’m gonna stay a fox forever and die a fox. Still wanna be best bros with a dead fox? I’ll start to smell.”</p>\n<p>Poking Stiles in the side, Scott laughs. “Well, Deaton thinks that as long as you stay with Derek, it’ll give us more time. He’s pretty sure that’s probably why you’ve still been you for so long. You’re constantly all over the guy.”</p>\n<p>Stiles makes a hissing sound. “Dude! I said I don’t wanna talk about it!”</p>\n<p>“Sorry,” Scott says, not sounding sorry. Grumbling to himself, Stiles turns more into Scott, trying to block out the harsh light of the room.</p>\n<p>“Do you love him?”</p>\n<p>“Well, I think I hate <em>you</em>.”</p>\n<p>“Oh man, that’s totally a ‘yes’.”</p>\n<p>“Dude, I will rip out your jugular and watch with glee as it heals so I can do it all over again. Like I’m the king of your own personal <em>Dante’s Inferno</em>.”</p>\n<p>Scott has the nerve to chuckle.</p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The drive back to the lake isn’t as awkward as Stiles had anticipated it would be. The radio isn’t off, the silence is only slightly tense, and Stiles feels more at ease with Derek at the wheel and Scott holding him close. He rests his head on Scott’s shoulder and stares out the passenger side window, counting down the mile markers</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>When they get back to the lake house, the lights are off and everything is quiet. Once they step inside, Scott gingerly hands Stiles off to Derek, who takes Stiles with equal care, then seamlessly navigates through the dark house to head upstairs.</p>\n<p>Derek doesn’t follow, looks lost in thought like he has been since he stepped out of the operating room with Deaton.</p>\n<p>Stiles smacks Derek’s shoulder with his head, snapping the man back to the present.</p>\n<p>“You want anything?” Derek asks with a start, stepping over to the fridge. Stiles shakes his head and throws his neck over Derek’s shoulder, staring into the dark living room. He hears Derek open the fridge and pull something out, but doesn’t really care much about what it is. He closes his eyes, ready for the day to end.</p>\n<p>Derek carries him through the house and upstairs to his room.</p>\n<p>“I do want something, actually,” Stiles says just as Derek is laying him down on the bed. Derek hovers over him, looking concerned, always looking so fucking concerned lately, and a hysterical laugh bubbles out of him because when he thinks about asking for a kiss, just to throw it out there, he realizes that he’s a fucking fox. He’s a fox and Derek is at least mostly human and if Stiles stays a fox he will never get the chance to try and blame it on alcohol or exhaustion or the moment or a joke or whatever bullshit would eventually spew out of his mouth after he pulled away. Derek would stare at him, wouldn’t believe him, and Stiles would dart away before he could get a rejection.</p>\n<p>Instead Stiles croaks, “Can you put <em>The Princess Bride</em> up on your computer?”</p>\n<p>From Derek’s expression, he clearly believes that Stiles has cracked; he’s closer to the truth than he realizes.</p>\n<p>“Sure,” Derek says regardless, instantly moving to the desk so he can search for a stream of the film, of course he does. Because behind the gruff and tough and scary alpha act and the dry sarcasm and the silent manpain, he is actually stupidly fucking sweet. Stiles closes his eyes and congratulates himself for waiting so long to pick up on that little tidbit.</p>\n<p>He falls into a light sleep, only waking up when the bed moves as Derek slips under the covers. He doesn’t open his eyes, had no plan to actually watch the movie. He just thought that if he’s on a timer, if his days being conscious of his life and who he is are numbered, he’d like to be able to enjoy the experience of being wrapped in Derek’s scent while the memorable lines are spoken in the background.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>When Stiles wakes up in the morning, his first conscious thought is that he’s still a fox. His next is that at least he hadn’t escaped in the middle of the night to go live with his kind, cut off from civilization and modern plumbing.</p>\n<p>Derek is breathing next to him, still asleep, and Stiles is reminded every time he looks at the man of that great big fucking “if”.</p>\n<p>He knows so many things about Derek now. Things that are totally useless and mean absolutely nothing, but that Stiles still prays that someday he’ll have a chance to take on the Derek trivia game and kick ass with his new knowledge. When he can wake up and pour Derek cereal that has way too much milk in it, remind Derek before he goes to sleep to take off his watch so it doesn’t leave a mark on his face because he sleeps with his cheek pillowed on his hands, change the radio station in his jeep to classic rock whenever he gives Derek a ride.</p>\n<p>He’s always known that Derek is a good guy, learned that early on. From the beginning, Derek seemed to take his wolf powers as a gift; one that he felt responsible to use as a way to help people – any people – who were in danger, like some kind of hairy Spiderman.  Stiles has known that Derek puts everything he is into keeping those he cares about safe, making sure they’re ready to take on anything that could hurt them. Stiles has known that sometimes Derek likes to sneak away and put on his sunglasses and drive a little too fast down back roads to release some of the tension.</p>\n<p>But now Stiles knows that Derek’s trust is earned just by being quiet, by being a companion that doesn’t judge him, that can sit with him when there’s no need for words. He knows how brutally serious Derek is about taking care of people who rely on him, an exhausting amount of emotion put into it, and Stiles isn’t sure how Derek has any of it left for himself. He knows how to tell when Derek is honestly annoyed and when it’s just for show, just by the angle of his mouth. He knows that even though Derek has a laptop, he prefers using an external mouse for some reason, and that he can touch type unless he has to write out numbers. He knows the lines of Derek’s hands, the scars on them that Derek doesn’t talk about, because the only reason for them not to have healed is if they had been laced with wolfsbane. He knows that Derek’s lashes touch his cheek when his eyes are closed and that he doesn’t snore, but that sometimes he mumbles.</p>\n<p>He knows all of this and more and they mean nothing and they mean so much and all Stiles wants is a chance for this knowledge not to have been wasted.</p>\n<p>He’s supposed to stay by Derek, it might be what’s keeping him human, and Stiles uses that excuse to watch Derek as he sleeps.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>You truly love each other and so you might have been truly happy. Not one couple in a century has that chance, no matter what the story books say. And so I think no man in a century will suffer as greatly as you will.</em>\n</p>\n<p>-          <strong>The Princess Bride</strong></p>\n<p>\n<strong> </strong>\n</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>He’s watching <em>The Princess Bride</em> again – actually watching it this time – when Derek finally gets up. Derek doesn’t say anything about it, just rubs Stiles’ head as he stands, and leaves to go to the bathroom. He comes back with his towel draped over his shoulder, and a tray of breakfast for the both of them.</p>\n<p>It actually physically pains Stiles that Derek didn’t detour back to the room to drop off his towel after his shower before going downstairs to get Stiles food – that Stiles was that much of a priority.</p>\n<p>“You’re really obnoxious, did you know that? Like, oh my god,” he mutters, throwing himself back into the sheets dramatically. Derek purses his lips, raises his brow, but doesn’t respond, most assuredly used to Stiles’ dwindling sanity by now.</p>\n<p>“I hate you so much,” Stiles whines, trying to suffocate himself with a pillow that smells like the asshole.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>By the time they finally make it downstairs, everyone has gathered in front of the big screen TV in the living room for a movie. He and Derek had spent most of the day watching television, Stiles afraid that if he strayed too far from the security of the room, he would lose himself and not be able to change back. His fears are irrational, he knows they are, knows Derek thinks they are, but Derek never actually says anything – never even implies it – and wow, Derek is the worst and Stiles might take out a chunk of his face so that Derek knows how much it hurts for Stiles to want him.</p>\n<p>He’s seen Derek make fun of people for less. Snort derisively, judge with a single glance. He doesn’t want to think about what it means that Derek is being so generous in this case.</p>\n<p>Derek passes on the movie for the both of them and they head out to the porch, which Stiles’ knows is Derek’s way of telling him it’ll be okay. They’re outside, and Stiles still has the mind of a human, and it’ll be okay.</p>\n<p>Stiles is reassured for the time being, but not convinced, as Derek takes a seat on the steps. Stiles follows suit, lying down in a way that allows his chin to rest on Derek’s thigh.</p>\n<p>If it won’t be okay, he thinks he should at least spend more time with everyone else – with Scott, and Boyd, and Allison, and Isaac and… just everyone. But as painful as the concept of losing all those little things he’s grown to appreciate about Derek is, it pierces an even bigger hole inside of Stiles to think about having all knowledge of all of his friends ripped away from him. Lydia’s shrewd smile; Allison’s inner badass; Erica’s love of corsets, leather, and Saturday morning cartoons. The fifteen years he’s known Scott, known everything there is to know about him. It’s so much easier to just avoid it all, feign ignorance on the situation and pretend, like Derek is pretending, that everything is going to be okay -- that he doesn’t need to soak up as much as he can before it’s too late.</p>\n<p>“You should go be with them after the movie,” Derek says to break the silence, because somehow he knows, of course he knows. And he suggests it like it’s the easiest thing in the world, just like saying it’ll be okay seems so easy for him.</p>\n<p>“No, they smell like fuckwaffles and assholes,” Stiles mutters, glowering up at Derek, wondering if the man always knew him this well or if it was just a recent development from all the time they’ve been spending together. “And as a fox I have a very sensitive nose, so.”</p>\n<p>“Yeah?” Derek says dryly, “And what do I smell like?”</p>\n<p><em>Like your stupid deodorant, and soap, and the dark, and warmth,</em> Stiles does not say.</p>\n<p>“Like a douchebag.”</p>\n<p>“Cute.” Derek flicks his ear and Stiles playfully snaps his teeth at the finger.</p>\n<p>“You’re damn right, I’m fucking adorable.”</p>\n<p>They haven’t talked about it – Derek being Stiles’ anchor. Derek is clearly aware of it, but he hasn’t said anything, hasn’t even started acting differently.  Stiles isn’t sure what that means; he wonders how long exactly Derek has known. Evidently he had figured it out even before Deaton’s little experiment, and Stiles isn’t used to being the last to put the puzzle pieces together.</p>\n<p>He’s not exactly sure how anchors work – he knows in the case of Scott and Allison, it’s love. He’s got an agonizing feeling that it’s the same in his situation, and it’s something he definitely does not want to think about. Not when he can’t do anything about it.</p>\n<p>“Laura and I used to quote <em>The Lion King</em> as kids when we’d lay outside the house at night,” Derek offers, squinting up at the sky.</p>\n<p>“Fireflies stuck in that big bluish black thing?” Stiles grins, rolling over so that he’s looking up at Derek, the back of his neck braced on Derek’s leg. “You guys were big movie fans, huh?”</p>\n<p>Derek shrugs. “We weren’t allowed out except for school until we were old enough to control our transformations. Had a lot of time.”</p>\n<p>Stiles watches the way Derek’s jaw sets, tight as he remembers his sister.</p>\n<p>“I don’t know how you can forgive Peter for what he—“</p>\n<p>“I haven’t,” Derek snaps, and Stiles might hear the way the wooden step splinters from the grip Derek has on it. “The second he stops being more useful to have on our side than not, I’m going to rip his throat out a second time.”</p>\n<p>“That’s… probably not gonna happen,” Stiles laments, fully realizing Derek’s dilemma. When perpetually in a war with the world, you don’t get the luxury of turning away allies.</p>\n<p>“No,” Derek spits out, like the word is a foul taste in his mouth. Wanting to change the subject, do something to get rid of the tensed shoulders, squared jaw, Stiles sits up and bounces off the porch.</p>\n<p>“Dude, speaking of fireflies, I bet there are some around here somewhere,” he says with an excited hop. Derek raises his brow, but stands with Stiles, shoving his hands into his jean pockets.</p>\n<p>“You want to go see fireflies?” he asks skeptically. Stiles scoffs, prancing in a circle around Derek.</p>\n<p>“Yes, I’m a fox. I like to chase things,” he says seriously. He stops behind Derek and headbutts the back of his legs to get the man moving. Derek takes a step forward, but doesn’t go further than that.</p>\n<p>“Isn’t that what we’re trying to avoid?” he says reasonably, and, yes, okay, it is. But Derek needs cheering up and somehow that seems more important to Stiles in the moment. He presses his head against the inside of Derek’s knees again.</p>\n<p>“You know what? I don’t need your sass right now. I wanna go see the fireflies.”</p>\n<p>Letting himself be pushed, Derek finally begins walking on his own, slightly behind Stiles, and lets Stiles lead him around to the back of the house. When Stiles looks over his shoulder, Derek is typing something into his phone.</p>\n<p>“If you’re googling ways to seduce a fox, man,” Stiles says casually, “Just get me more steak tips.”</p>\n<p>Derek looks a strange mix between horrified and completely unsurprised that Stiles would say that, but doesn’t glance up from his phone.</p>\n<p>“I’m looking up ways to bury the body,” he says just as lightly. Stiles sticks his tongue out at Derek as he waits for him to catch up so that they can walk at the same pace.</p>\n<p>The sound of feet hitting the ground as they race toward him hits his ears suddenly, but he has no time to turn and look before he’s tackled.</p>\n<p>Erica’s perfume is the only thing that keeps him from freaking out and clawing at the weight around him.</p>\n<p>“What are you doing here?” he gasps, his heart pounding as she lifts him into her arms. Behind her, Stiles can see the rest of the group joining them. He shoots a dark look at Derek, but the man appears completely unapologetic.</p>\n<p>“What are you doing trying to hunt down fireflies without us?” she counters. Stiles pulls back to look at her flatly, but she just grins and kisses the top of his snout.</p>\n<p>He sighs dramatically and allows himself to go limp in her arms, a dead weight. She rolls her eyes and hoists him into a position that’s easier to carry him in.</p>\n<p>He doesn’t miss how Derek makes sure to stay close to her.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>They find the fireflies over a ridge about a mile through the woods, their little pack laughing loudly and shoving at each other like the group of obnoxious teenagers they are.  Stiles walks alongside them, occasionally darting between them to join in.</p>\n<p>It’s nice, he thinks, and he’s thankful Derek invited the others now. He wants to remember his friends just like this.</p>\n<p>Scott is the first to spot the flickering lights over the horizon, a sound of awe escaping as he stops dead. Stiles runs into him, is about to yell at the boy, but cuts himself off when he sees the field as well, the glow of fireflies littering the grass below.</p>\n<p>“That is disgusting,” Jackson groans, ruining everything about the moment. Lydia elbows him. “What? That’s disgusting. The only thing down there is a bunch of bugs.”</p>\n<p>“A true romantic,” she sighs. Stiles does her the favor of biting Jackson’s ankle, dashing off before Jackson can retaliate.</p>\n<p>“You little shit!” Jackson shouts after him as he races down to the field.  He feels energetic and excited, bursting with something that’s less primal and more gratified. Derek catches up to him, just in case, and Stiles isn’t worried in that moment about changing, but he still wants Derek near.</p>\n<p>He plays around with the lightning bugs, pouncing, catching them in his paws, trying not to feel too much like a cat.  The laughter he hears from his friends is infectious and he never wants to let that sound go. When he looks over his shoulder, Derek is sitting on the grass, legs outstretched and leaning back on his hands as they balance him from behind. He’s watching the pack dance around in the lights, slipping and sliding where the ground is muddy, tackling each other, giving piggy back rides. He looks content, proud even, and maybe a little in awe. It’s an expression Stiles hasn’t seen on him before. When he stares at Derek, he gets the feeling that Derek is savoring the moment just as much as he is, like maybe Derek never imagined he’d get to experience his world not engulfed in flames, or what it was like to have a family again and truly believe he could be happy.</p>\n<p>Sinking low into the grass not at all like a real fox would do (and he is more than okay with that), Stiles gets ready to attack. He knows Derek is completely aware of where he is and what he’s doing even without looking, but that doesn’t stop Stiles from taking a flying leap onto Derek’s chest.</p>\n<p>Derek allows himself be taken to the ground with a grunt, letting loose a long-suffering sigh as he looks up at Stiles. Stiles grins.</p>\n<p>“You need something?” Derek drawls, a few lights flickering over his face. Stiles had every intention of saying something smarmy and ridiculous – something about how marvelous Derek looks by candlelight – but he’s caught by the green glow and how it makes everything softer, like when Derek is asleep. Except, right now, Derek is wide awake and watching him.</p>\n<p>Swallowing, Stiles fights the urge to do something stupid like lick into Derek’s mouth. Derek frowns, tensing when he realizes something is wrong, which would kind of be sweet if Derek wasn’t actually the problem – or at least part of it.</p>\n<p>Stiles whimpers, feeling something break.</p>\n<p>“I want to go home,” he says quietly, not even sure if he’s referring to his house or something more.</p>\n<p>Derek doesn’t tell him he can’t go home, doesn’t tell him to suck it up or ask Stiles to elaborate, or even change his expression.</p>\n<p>He just runs his hand over Stiles back and says, “I know.”</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB03-fireflies-small.jpg\" alt width=\"800\" height=\"599\">\n</p>\n<p>  </p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Peter calls with news a week later, when Stiles can feel nature clawing at his insides, tearing at his mind, at his chest, even when touching Derek.</p>\n<p>There’s a summoning spell they can use that will force the witch to make herself known and keep her trapped long enough that they can at least talk to her. They’ll need Deaton to help locate some of the ingredients, it might take a bit longer, but it’s the first real lead they’ve got.</p>\n<p>Stiles stares blankly at Derek’s computer screen as Buttercup is forced to marry Prince Humperdinck.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles’ words start being vocalized as growls by the time the majority of the ingredients are found. He’s still him, can still think, emote, and control himself with his human consciousness; he thinks it doesn’t really matter when no one can understand him.</p>\n<p>By the time they’re waiting on the last ingredient, Deaton has given Derek drugs to administer to Stiles. They keep him tired, make him spend most of his day sleeping, and Stiles is okay with it. If he’s sleeping, barely awake, he’s not wishing the meat he’s swallowing was covered in fresh blood. The animal in him remains dormant.</p>\n<p>Time passes weirdly after that. Stiles has no sense of day or night or how many hours or weeks or months it’s been. Derek wakes him up to eat, takes him outside to go to the bathroom, and then he loses himself in the darkness again.</p>\n<p>When the summoning spell is ready, they take Stiles out into the forest where the initial confrontation took place. Derek sets him gently on a tree stump, and goes to help Scott and Lydia prepare.</p>\n<p>Stiles remains asleep through it all, misses it entirely. </p>\n<p>He finds out later that it was incredibly anti-climactic.</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>The witch stares blankly at the small group of teenage werewolves and humans, looking as though she’s trying to come up with a plausible reason for them to have brought her here. She squints when they try to refresh her memory, pushing Jackson out in front of them and explaining his misstep onto her ex-husband’s grave.</p>\n<p>Her lips purse as she considers.</p>\n<p>“Wait…”she says finally, hands dropping down to her hips, fingers tapping against her beaded dress. “Which husband, again?”</p>\n<p>Derek reminds himself that disemboweling her will get them nowhere.</p>\n<p>“The one that was buried here,” he growls instead, gesturing emphatically to the ground they’re standing on. Her eyes widen as if maybe that turned a light on in her brain.</p>\n<p>“Oh! You mean Aldridge?” She snorts, a stifled cackle. “Right, right. Okay, yes. I remember you. Somewhat.”</p>\n<p>Rubbing the spot where pressure is building behind his skull, Derek lets Scott take over.</p>\n<p>“Okay, well…” he begins. Derek rolls his eyes. “When Jackson <em>accidentally</em> offended you back then… You kind of turned my best friend into a fox.”</p>\n<p>He turns and points out the sleeping animal. The witch looks bemused.</p>\n<p>“Did I?” She laughs. “I mean, maybe I did. That sounds like me when I’m having a rough day, you know?”</p>\n<p>“Sure,” Derek snarls, hands clenching into fists. The witch gives him a sidelong glance partnered with a dismissive wave of her hand.</p>\n<p>“So what do you want me to do about it?”</p>\n<p>“Uhm,” Scott tries, looking stunned by her response. Shaking his head, he clears his throat and straightens his spine, putting on a brave face. “Change him back?” His act fails when his voice raises an octave at the end, and even more so when he tacks on a hurried, “Please?”</p>\n<p>The witch shrugs.</p>\n<p>“Okay.”</p>\n<p>Scott falters, her answer taking the fight out of him and replacing it with confusion.</p>\n<p>“O-…What?”</p>\n<p>She repeats her shrug, bringing a hand up to inspect her nails.</p>\n<p>“Okay. I don’t really care one way or another what species your little friend is.”</p>\n<p>“Just… like that?”</p>\n<p>“Just like that?” she echoes with a scoff. “You ripped me out of the middle of my vacation in the 17<sup>th</sup> century. If it keeps you from ever contacting me again in your adorable desperation, then I’ll turn him back and make him a king.”</p>\n<p>The expression on Scott’s face says that he’s actually considering her offer, probably thinking about how cool it would be to be best friends with a king. Allison steps in front of him and intervenes.</p>\n<p>“Not necessary,” she says, placating. “Just making him human again will be fine.”</p>\n<p>“Whatever,” the witch sighs and her eyes glow, her mouth moving without a sound leaving her lips. When she finishes, Stiles is still a fox. Derek takes a menacing step forward, grunting when he suddenly feels restrained, unable to move.</p>\n<p>The witch shoots him a dark look, her palm open and facing him. “Calm down. The spell will wear off in a few hours.”</p>\n<p>“So that’s it?” Isaac wonders, glancing around the clearing as if he’s missed something. The witch rubs the bridge of her nose and mutters something about, <em>“Werewolves, ugh.”</em></p>\n<p>“That’s it. Contact me again and the earth will open below your feet and swallow you and everything you love,” she says disarmingly.</p>\n<p>And then she’s gone.</p>\n<p>Lydia lets out a low whistle.</p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>\n<em>Is this a kissing book?</em>\n</p>\n<p><em>–</em>       <strong>The Princess Bride</strong></p>\n<p>\n<strong> </strong>\n</p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/foxprints2.jpg\" alt width=\"650\" height=\"65\" align=\"middle\">\n</p>\n<p> </p>\n<p>Stiles wakes up feeling dizzy, aching all over.  He rolls onto his stomach, burying his face into the pillow, and pauses when he registers his head taking up more surface area than he’s used to.</p>\n<p>Groaning, he pushes himself up. He keeps his eyes closed, squeezes them, and prays to every god that may or may not exist that the sensation of his fingers spreading on the mattress isn’t the same painful fantasy he’s been experiencing since Deaton started him on the drugs.  As he finally pries his eyes open, he slowly brings his gaze down to what he hopes are his hands, letting out an amazed cry when he sees human skin instead of fur.</p>\n<p>Relief floods into Stiles so sharply, so overwhelmingly, and excruciatingly, that he loses his breath, feels like he might vomit, like he’s dizzy and he just wants to curl up and sob because he has no idea how to properly emote anything that he’s feeling.</p>\n<p>He does cry, heavy, wrecking movements making him quake, keep him from being able to breathe.  He can go home to his dad, he can play lacrosse in college with Scott, he can watch Lydia conquer the world and Isaac finally learn how to play a fucking video game.</p>\n<p>He can touch Derek with sensitive fingers that will truly appreciate the curves of bone and muscle through skin and the stings of stubble, rather than with thickly padded paws.</p>\n<p>“Derek,” he gasps, forcefully pushing himself up. He wipes his face on the arm of the shirt he’s been put in, ignores the way tears and snot stick to the material.</p>\n<p>With a painful sense of desperation, Stiles spills out of bed, stumbling on legs he’s not used to as he sprints out of the room. He almost trips going down the stairs, catches himself on the railing, then continues his race down. Feet skid on the wooden floorboards as he takes a sharp turn into the living room, almost falling over as he comes to a stop in front of his friends.</p>\n<p> They look up at him warmly, expectantly, and Jackson only barely rolls his eyes.</p>\n<p>Scott comes in for a hug, grinning the widest of them all, but Stiles ducks out of it, dropping to his knees to slide on the floor until he’s in front of the couch where Derek is sitting. The man looks at him in bemusement, cocking an eyebrow, and Stiles pants, trying to catch his breath.</p>\n<p>“Dude, I need to know. This past…however long it was,” he wheezes. “Were you like that with me because you felt bad for me or because it was more than that?”</p>\n<p>Stiles can <em>hear</em> the silence in the room, but he doesn’t look away from Derek’s eyes as they go wide, surprised, shocked. Stiles knows Derek’s expressions by now, has watched them even when Derek didn’t know what he was showing on his own face.  And Stiles knows from the panicked edge to Derek’s stare that he had assumed that everything would go back to normal after Stiles became human again. That Stiles would leave his intimate spaces and go back to being a buddy and they’d never speak of the way Derek held him when he was scared, took care of him in ways that made Stiles’ heart hurt, shared with him so many secret moments, anchored him. It angers Stiles, pisses him off, that Derek would have been okay with that. After all the time Stiles had spent just praying to any god that would hear him to not let him lose what he’d found with Derek, Stiles can’t understand how Derek would be able to let it go so easily.</p>\n<p>Without waiting for a response, Stiles grabs Derek’s hands in his own, staring up at him seriously.  He doesn’t care how crazy he looks to the others; he knows none of them can be surprised by any of this.</p>\n<p>“Tell me to do something,” he demands, clutching Derek’s fingers tightly, loving how he can feel the ridges and the scars. Derek stares at him like he’s not sure if Stiles came back wrong.</p>\n<p>“Derek, I’m fine,” Stiles snaps. “Just…tell me to do something. Anything.”</p>\n<p>The corner of Derek’s mouth twitches and his apprehension grows.</p>\n<p>“<em>Derek</em>.”</p>\n<p>“Oh my god,” Lydia groans. “Just tell him to stop being ridiculous.”</p>\n<p>Derek glances up at her briefly, then back down at Stiles. He motions his head toward Lydia, implying that he’ll go with her question.</p>\n<p>Stiles doesn’t think he can roll his eyes any harder.</p>\n<p>“Good. Great. Now <em>say it.</em>”</p>\n<p>Huffing, Derek yanks his hands away, dropping them on his thighs. He rubs his palms against his jeans, stares at Stiles suspiciously, and then says, “Stiles, stop being ridiculous.”</p>\n<p>Stiles is sure he looks manic with the grin that suddenly spreads upon his face. He rises up with a jolt, Derek looking more and more concerned for Stiles’ sanity, and it just fills Stiles with a sense of exhilaration because he’s human and he’s allowed to appreciate it.</p>\n<p>“As you wish,” he murmurs, resting his hands on the back of the couch, arching slightly so that he’s hovering over Derek.</p>\n<p>Derek’s eyes snap to his, realization dawning visibly. He starts turning white in a way that Stiles thinks might be dangerous, his eyes flickering to the hushed group of people surrounding him. Stiles kind of feels like a dick doing this in front of everyone, knowing that however much Derek let his walls come down for Stiles, he’s nowhere near that stage with their friends. He feels a little like he’s betraying the trust he built with Derek, but he’s spent too long watching Derek and needing Derek and not being able to act on it, wondering if he would ever get the chance.</p>\n<p>He shifts to block Derek’s view of the others, a poor attempt at giving Derek the illusion of privacy.  Derek’s fingers are curled on his thighs, tense like the rest of his form, and he looks pained and angry at the same time.</p>\n<p>Stiles isn’t about to step away and say he was just kidding, because he means this, really means this, has had emotional breakdowns over this; he <em>is </em>close to giving Derek his space, when Derek sullenly quotes Princess Buttercup.</p>\n<p> “You mock my pain,” he mutters like he really believes it.</p>\n<p>Which is stupid as hell, because if Derek thinks that Stiles is playing with him, then he clearly does not understand anchors as well as he thinks he does and needs to take a trip back to werewolf school.</p>\n<p>Stiles grins ruefully, bringing a hand down to rest it reassuringly on Derek’s shoulder</p>\n<p>“Life is pain, Highness,” he recites. “Anyone who tells you differently is selling something.”</p>\n<p>Derek doesn’t look any less embarrassed, or any less pissed off, but his expression does morph from anxious to something a little closer to skeptical.</p>\n<p>“It doesn’t sound too bad…” he begins warily, and Stiles feels a thrill go up his spine when Derek continues to play along. “I’ll try and stay awake.” The last words are said as a mumble.</p>\n<p>Stiles knows that their friends are watching, probably getting off on this, the sickos. He knows they’ll never let him and Derek hear the end of this, he knows Derek is pissed. But he also knows the hesitance, the quotes used, can only indicate how very much Derek feels the same. That it wasn’t just empathy making Derek become something Stiles felt he could cling to.</p>\n<p>And so Stiles really doesn’t give a shit about anything else.</p>\n<p>Beaming, he reaches down to yank at Derek’s hands and, surprisingly, the man comes, standing up to his full height before Stiles. Stiles releases Derek and slowly, cautiously, giving Derek time to pull away, he brings his fingers up to curl around the back of Derek’s head, angling it just right.</p>\n<p>“Your vote of confidence is overwhelming,” he grins, surging forward to finally get his kiss.</p>\n<p> </p>\n<p>\n<em>Since the invention of the kiss, there have been five kisses that were rated the most passionate, the most pure. This one left them all behind. </em>\n</p>\n<p>\n<em>The End.  </em>\n</p>\n<p><em>–</em>       <strong>The Princess Bride</strong></p>\n<p>\n<strong> </strong>\n</p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB04-kiss-small.jpg\" alt width=\"700\" height=\"906\">\n</p>\n<p> </p>\n<p>(\"That was, uh,\" Jackson coughs, breaking the stunned silence as Derek and Stiles try to see whose tongue can go deeper down the other's throat. \"That was really nauseating.\"</p>\n<p>Erica smiles and punches him in the kidney.)</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p></p>\n<p>\n<img src=\"http://dauntingfire.com/tw-rbb1/RBB-reading.jpg\" alt width=\"550\" height=\"247\">\n</p>"
}