{
  "id": "828942",
  "url": "https://archiveofourown.org/works/828942?view_full_work=true",
  "author": [
    "copperbadge"
  ],
  "title": "Hard Rock Swing",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Marvel",
    "The Avengers (2012)"
  ],
  "relationships": [
    "Steve Rogers/Tony Stark"
  ],
  "characters": [
    "Steve Rogers",
    "Tony Stark",
    "Bruce Banner",
    "Pepper Potts"
  ],
  "additional_tags": [
    "Alternate Universe",
    "Age Difference",
    "Post-Traumatic Stress Disorder",
    "Hurt/Comfort"
  ],
  "language": "English",
  "series": "",
  "published": "2013-06-03",
  "completed": "2014-02-26",
  "words": "18,395",
  "chapters": "4/4",
  "comments": "252",
  "kudos": "9,525",
  "bookmarks": "2,213",
  "hits": "172,942",
  "summary": "<p>It turns out, in the 21st century, Steve's best friend is an eighteen-year-old genius named Tony Stark. This might be trouble.</p>\n<p>Four years on, Steve is never gonna give him up.</p>",
  "notes": "<p>Written for Machinate, who wanted a young Tony with an older Steve. It incorporated many from the List Of Marr's Favourite Things, which I deduced by reading her Tumblr: Tony being tiny, age differences, Steve crying, butts, and blankets (many). Sorry I couldn't incorporate vampires, babies, and dragons, Marr.</p>\n<p>Beta thanks to Knotta and Jenny, who fixed what was broken!</p>\n<p>There is also a Chinese translation available (with site registration) <b><a href=\"http://www.mtslash.com/forum.php?mod=viewthread&amp;tid=90032&amp;page=1&amp;extra=#pid1631933\" rel=\"nofollow\">here!</a></b></p>\n<p>I wrote this fanfic for Machinate/Ironfries, who ended up doing some art of Tony and Steve a few years on, and it inspired an epilogue fanfic. All the art is hers and is linked to her original tumblr posts.</p>",
  "text": "<p>Steve had been given dossiers on the Avengers Initiative, with a metaphorical wink and the statement, \"It's an old, defunct project. But you might find it of interest.\"</p>\n<p>He had. There were four files, then -- Clint and Thor would come later. As it stood, there was a giant green ogre like something out of a fairy tale, a Russian woman trained as a spy, himself, and Anthony Stark.</p>\n<p>Anthony was eighteen years old, a fighter of some renown in this new world. When he was sixteen, already an orphan, he'd been abducted and held for ransom by a gang of would-be terrorists while on a trip with his father's business partner, Obadiah Stane. Stark promised to make the rebels weapons and instead had built a sort of walking tank, immensely powerful, and escaped. He'd returned to America a more-or-less hero, and announced that when he inherited the company at twenty-one he would shut down weapons manufacturing. Obadiah Stane -- still his legal guardian, then -- had died in a second attempt to kill him.</p>\n<p>A woman named Virginia Potts had seized control of his company and guardianship of Stark, but SHIELD said Stark directed the company's progress through her. Potts had already discontinued their defense contracts and steered the company towards technology. Others had died since, trying to kill Stark (and Potts) or steal what was his.</p>\n<p>Anthony was a child with blood on his hands. Steve understood the feeling. And yet -- the Iron Man armor had been withheld from the military for as long as it could be, and Stark didn't fight on any particular side. He fought for himself, defended only himself.</p>\n<p>He was also Howard's son, fathered in the twilight of Howard's life with a very young, a scandalously young wife. He'd been raised mostly by tutors and household staff, but Howard had clearly had some influence before he died. Even in the flat, static photographs, Steve could see Howard's defiant, clever spark in his son's eyes, the father's closed-off self-interest in the boy's expression. Anthony was so thoroughly modern, a part of this self-obsessed era of America, and his antics in the press were outrageous if even half of them were true.</p>\n<p>The first time they met, Anthony was loud rock music and strange nicknames, eyerolls and sarcasm and pointed remarks (perhaps Steve took them rather more pointedly than intended) about his age. Then, between his own angry confusion about the twenty-first century and Loki's staff prodding them all into antagonism, he perhaps hadn't shown Anthony as much compassion as he could have. Of course the boy fought for himself; he had to defend what was his, and nobody else would do it while men thirty years older than him were trying to kill him because of <i>corporate politics</i>.</p>\n<p>Anthony's voice had been so young when he'd taken control of the bomb, that day they fought the Chitauri.</p>\n<p>\"You know that's a one-way trip,\" Steve had said.</p>\n<p>Anthony hadn't answered. And Steve had given him at least this much respect: he hadn't told him he was too young for that sacrifice. After all, he'd seen younger men die in war.</p>\n<p>The day they sent Loki and Thor home, Anthony had come up to him, all gangling limbs and high cheekbones and messy hair, and stuck out his hand and said, \"Pleasure working with you, Captain.\"</p>\n<p>\"You too,\" Steve had replied, shaking the offered hand. Dr. Banner and a tall, pretty redheaded woman were waiting nearby.</p>\n<p>\"I guess I gotta go,\" Anthony said.</p>\n<p>\"That your girl?\" Steve asked, tipping his head slightly at the woman.</p>\n<p>\"Hah! I wish. She runs Stark Industries, that's Pepper.\"</p>\n<p>\"Are all of you kids?\" Steve asked, and had then instantly regretted it.</p>\n<p>Anthony just grinned. \"She's twenty-nine, she'll be flattered. Made her first millions writing code for social media when she was fifteen, but she likes business better. Got her MBA at twenty. I don't call us kids; I call us prodigies. She's setting Dr. Banner up on the payroll, I'm giving him a lab.\"</p>\n<p>\"Generous of you.\"</p>\n<p>\"It's <i>Dr. Banner</i>,\" Anthony said, a note of awe in his voice. \"I've been studying his work since I was twelve. Hey, is that your ride?\" he added excitedly, peering past Steve at his motorcycle.</p>\n<p>\"Yeah, I was thinking of doing some traveling,\" Steve said.</p>\n<p>\"What've you got, eighty horsepower?\"</p>\n<p>\"Hundred and twenty.\"</p>\n<p>\"Is it street legal?\"</p>\n<p>\"I won't tell if you won't,\" Steve said, and then on impulse, \"Want a ride? I can leave you at the Tower.\"</p>\n<p>\"PEP!\" Anthony yelled, cupping his hands around his mouth. \"I'm riding with Cap! See you back at the Tower!\"</p>\n<p>Ms. Potts made an annoyed face and began shepherding Dr. Banner towards a waiting car. Steve, pleased that at least something impressed the kid, tossed Anthony his helmet and straddled the bike.</p>\n<p>\"At your service, Stark,\" he said, and the young man hurried onto the bike behind him, wrapping an arm around his waist, helmet knocking gently against Steve's shoulder. \"Or do you prefer Anthony?\"</p>\n<p>\"Tony's fine,\" he said, flipping the visor down. It didn't in the least muffle his whoop of enthusiasm as Steve started the bike and pulled onto the street.</p>\n<p>***</p>\n<p>He'd taken off after leaving Anthony -- Tony -- at the Tower, and for three weeks didn't really have much contact with people. He saw a little of the country, got a little more comfortable with what it was and what it meant, and returned to New York feeling...not happy, but happier than he had since waking up.</p>\n<p>Ten minutes after he got back to his musty-smelling apartment, Tony called.</p>\n<p>\"I hear you're back in town,\" he said.</p>\n<p>\"Yeah. How'd you know?\"</p>\n<p>\"Little bird told me.\"</p>\n<p>\"Fury?\" Steve guessed.</p>\n<p>\"Nah, I put a tracker on your bike.\"</p>\n<p>\"You did what?\"</p>\n<p>\"Remember when you gave me a lift home?\"</p>\n<p>Steve pinched the bridge of his nose. \"How long have you been following me?\"</p>\n<p>\"That would be creepy, Cap. I just checked up occasionally, made sure you were moving around, not dead in a desert somewhere. Did you a favor, really.\"</p>\n<p>\"Anthony...\"</p>\n<p>\"Tony, I told you. Want to come see the Tower? I have something for you.\"</p>\n<p>\"If I do, will you take the tracker off my bike?\"</p>\n<p>\"Well, if you don't, I definitely won't, so it's in your best interest to try,\" Tony said.</p>\n<p>\"All right. Let me wash off the road dust and I'll be there in an hour or so.\"</p>\n<p>\"Come hungry.\"</p>\n<p>\"Fair enough,\" Steve said, and rang off. He tapped the phone thoughtfully against his lips.</p>\n<p>***</p>\n<p>Across the city, in the heart of Manhattan, Pepper walked into the living room of the penthouse and found Tony soaking in his own triumph. She'd learned to recognize the signs. He was also slightly damp.</p>\n<p>\"You bathed,\" she said. \"What's the occasion?\"</p>\n<p>\"I bathe every day,\" Tony replied. She kept ominously quiet. \"Nearly every day. No occasion.\"</p>\n<p>\"Then what are you celebrating?\"</p>\n<p>\"Absolutely nothing.\"</p>\n<p>\"Tony.\"</p>\n<p>\"I can't be happy I am rich, alive, young, beautiful, and a superhero?\"</p>\n<p>\"Your are all of those things all of the time,\" she said. \"Do you have time to go over some of the paperwork for the acquisition you've pestered me to make for the last two months?\"</p>\n<p>\"Yeah, but only like ten minutes.\"</p>\n<p>\"Why, what's in ten minutes?\"</p>\n<p>\"Cap's coming over, I said I'd have a look at his bike.\" Tony made the face -- she hadn't yet trained him out of it -- that said he was only telling a little lie.</p>\n<p>\"Cap, huh?\" she asked, crossing her arms.</p>\n<p>\"Yeah! He's back in town.\"</p>\n<p>\"Captain hunk of beefy muscle and old-fashioned manners?\"</p>\n<p>\"I didn't call him that,\" Tony said, blushing a little.</p>\n<p>\"Everyone thinks it, though.\" She grinned. \"Aw, you got all prettied up for Captain Rogers.\"</p>\n<p>\"I did not.\"</p>\n<p>\"You totally did.\"</p>\n<p>\"I did not! Maybe a little. Have to keep up the rep in front of American Bandstand,\" Tony admitted.</p>\n<p>\"You have a crush,\" Pepper teased.</p>\n<p>\"I don't get crushes.\"</p>\n<p>\"You do! You adorable little ball of barely-subsided hormones, you have a crush.\" She patted his head. \"Oh my God, is that styling wax? Did you do your hair?\"</p>\n<p>\"Pepper! Firing you!\"</p>\n<p>\"Stark Industries would fall apart in a week,\" she said, shaking her head. \"Don't worry about it, we can go over the paperwork tomorrow.\"</p>\n<p>\"You know that if you ever decided to be evil and take over my company I would be left penniless and alone,\" Tony said. \"Please don't do that.\"</p>\n<p>\"You'd get a job as a mechanic and be blissfully happy,\" she replied. \"It'd be good for you. I should do it for your personal growth. Have fun with tall, blond, and ninety,\" she called over her shoulder as she left.</p>\n<p>***</p>\n<p>Steve hadn't really thought about where he should go once he reached Stark Tower. He had no idea what floor Tony was on, let alone what he should do with his bike. Fortunately, about two blocks away from the Tower, while he was stopped at a red light, his phone buzzed in his pocket.</p>\n<p>He pulled off to the side, checked the caller name, and answered. \"Tony?\"</p>\n<p>\"My apologies, Captain,\" said a deep voice in an English accent. \"My name is JARVIS. I'm Mr. Stark's AI.\"</p>\n<p>\"Is that like a PA?\" Steve asked.</p>\n<p>\"Slightly more pleasant,\" JARVIS replied. \"If you would please pull your vehicle around to the loading dock of Stark Tower, a cargo elevator is waiting to take you to Mr. Stark's garage.\"</p>\n<p>\"Uh, okay,\" Steve said. \"Nice to meet you, JARVIS.\"</p>\n<p>\"The pleasure is mine, Captain. Please proceed to the loading dock.\"</p>\n<p>Steve pulled the bike around the building, looking for a convenient alley, and eventually managed to find the dock -- a lot cleaner and better-smelling than any loading dock he remembered. Then again, New York was sort of...that way now. Not clean, exactly, just clean<i>er</i>. He shut the bike off and walked it up the ramp, and the security guard grinned at him.</p>\n<p>\"You must be the guest Mr. Stark's expecting,\" he said. \"Over there,\" he added, pointing to a wide platform surrounded by rails. Steve obediently got onto the platform, hauling the bike up after him, and it immediately began to sink into the ground.</p>\n<p>\"Well, this is all very...foreboding,\" he said, when it ground to a stop in a dark, cavelike room. There was a clank, and the lights came up. The room appeared to be a strange mixture of garage and workshop; a row of cars lined one wall, a row of Iron Man armor another. In the middle were tables littered with tools, bits of armor, and what looked like the guts of robots. Tony was standing in front of one, hands in his pockets, looking about as awkward and nervous as Steve felt.</p>\n<p>\"I do love a little drama,\" Tony said, grinning but not moving.</p>\n<p>\"And cars,\" Steve observed.</p>\n<p>\"Cars, robots, motorcycles, suits of high-tech armor, anything with moving parts, to be honest,\" Tony replied. \"Leave the bike, I've got food.\"</p>\n<p>Steve threw the kickstand on the bike and crossed the floor to the table, where a box of pizza and a couple of bottles of beer were laid out.</p>\n<p>\"Less classy than you were expecting?\" Tony asked.</p>\n<p>\"No. This looks great,\" Steve said, seating himself. \"Aren't you a little young, these days, for...?\" he asked, waggling one of the bottles of beer at Tony.</p>\n<p>\"When did you have your first beer?\" Tony asked.</p>\n<p>\"Fifteen,\" Steve said with a grin. Tony spread his hands. \"Well, fair enough. Hey, you said you had something to show me?\"</p>\n<p>\"Food first,\" Tony said. \"I skipped breakfast.\"</p>\n<p>\"Why?\"</p>\n<p>\"Why not? I was busy.\"</p>\n<p>\"Because it's bad for you.\"</p>\n<p>\"Everything's bad for me,\" Tony said with a roll of his eyes. \"I got thrown off the top floor of the building once, and you're worried about breakfast?\"</p>\n<p>\"Free fall is involuntary. You control your breakfast,\" Steve said, but he grinned. \"You're a growing boy, Anthony, you need proper childhood nutrition.\"</p>\n<p>\"Yeah yeah, walking billboard for better living through chemicals,\" Tony grumbled. \"I'm eighteen, you know. Sadly, I have probably grown all I'm going to.\"</p>\n<p>\"Good thing you can fly.\"</p>\n<p>\"Hey!\" Tony threw a crust of pizza at him, and Steve ducked. It bounced off a robot behind him, which squealed in outrage.</p>\n<p>\"You do that again, son, and we're going to have words,\" Steve said, and they both cracked up laughing.</p>\n<p>Tony didn't bring up whatever he had to show Steve again, so after lunch Steve followed his lead and they spent most of the afternoon working on the bike. It was fun; Tony never stopped chattering as he went over every inch of the bike with loving care, so Steve didn't feel his occasional lapses into awkward, uncertain silence were even noticed. As promised, Tony took the tracer off his bike, a little slip of metal that Steve held up to the light and studied.</p>\n<p>\"You could put it back on,\" he said, when Tony had finished his examination.</p>\n<p>\"What?\" Tony asked.</p>\n<p>\"Well, it might be smart to know where I am, you know, in case...\" Steve spread his hands.</p>\n<p>\"Oh. You don't mind?\" Tony asked, peering at him curiously.</p>\n<p>\"Not now that I know it's there,\" Steve replied. \"Plus, then if it gets stolen I can go knock some heads in.\"</p>\n<p>\"Your logic is flawless,\" Tony said, and took the tracer from him, hooking it back under the seat of the bike. \"And if you go to a strip club, I will know, and blackmail you into taking me along.\"</p>\n<p>\"Not really my thing,\" Steve said, as Tony stood up, wiping his hands on a rag. He caught the rag when Tony tossed it to him, cleaning the oil off his fingers as best he could.</p>\n<p>\"Ready for your surprise?\" Tony asked. \"Have I kept you in suspense long enough?\"</p>\n<p>\"I wasn't going to ask,\" Steve said, with dignity.</p>\n<p>\"I know you weren't. Come on,\" Tony said, and grabbed his wrist like a child, dragging him up and towards the elevators in the far corner.</p>\n<p>\"What is it, anyhow?\" Steve asked, as the doors opened silently and Tony pulled him inside.</p>\n<p>\"You'll see. Hey, close your eyes.\"</p>\n<p>\"Tony, come on,\" Steve said.</p>\n<p>\"Do it!\" Tony insisted.</p>\n<p>\"Brat,\" Steve answered, but he closed his eyes.</p>\n<p>\"Trust me, old man,\" Tony said. The elevator slid smoothly upwards, stopping long after Steve's ears had popped.</p>\n<p>\"Is this the penthouse?\" he asked.</p>\n<p>\"Keep your eyes shut!\" Tony insisted, as he led Steve through the elevator doors. He maneuvered him carefully, one hand on his wrist and the other on the small of his back, until they reached wherever they were going and Tony tapped him lightly on the chest to stop him.</p>\n<p>\"Open,\" he said. Steve obediently opened his eyes.</p>\n<p>They were standing in what had to be an apartment somewhere in the upper floors of Stark Tower. In front of him there was a comfortable-looking sofa, sitting on a rag rug in the middle of a hardwood floor. Beyond that was a wall of glass that looked out over Manhattan, a truly spectacular view.</p>\n<p>\"Wow,\" Steve said, circling the couch to stare out at the city. \"This is amazing. Is this your place?\" he asked, turning back to Tony briefly. \"You can see half the island from here.\"</p>\n<p>\"No, it's...uh, it's yours,\" Tony said. It took Steve a moment to comprehend this, stunned as he was by the view, and then he turned sharply.</p>\n<p>\"Mine?\" he asked.</p>\n<p>\"Sure. I had...some empty space, this is actually a suite off the main penthouse, I made them for all the Avengers,\" Tony said, looking downright nervous now. \"I've seen your crappy apartment SHIELD got you,\" he blurted. \"Not the inside, I mean, but I went past it on, uh, on my way to somewhere else, and it looks tiny, so I thought...\"</p>\n<p>\"Tony, that's really...really keen of you,\" Steve said.</p>\n<p>\"<i>Keen</i>,\" Tony mumbled.</p>\n<p>\"But I can't accept this. I could never pay you back for it.\"</p>\n<p>\"It's a gift,\" Tony said. \"I don't expect you to. We should be together as a team, right?\"</p>\n<p>\"Yes, but that doesn't mean you have to -- \"</p>\n<p>\"But I want to,\" Tony said. There was an edge of desperation to his voice that Steve didn't understand. He cocked his head, silent while he puzzled it out.</p>\n<p>Tony was young, <i>so</i> young, and Steve knew what it was like to lose your parents early. The boy'd had to defend himself since he was sixteen. And Steve remembered, too, how proud and nervous he'd been, hoping Bucky's soldier friends would accept him, how desperately happy he was when they did. He'd almost forgotten how it felt to be on the outside looking in, at least in that fashion.</p>\n<p>\"You're staring at me,\" Tony pointed out.</p>\n<p>\"I'm figurin' you out,\" Steve replied.</p>\n<p>\"Hah, good luck. Many have tried.\"</p>\n<p>\"I'll bet they have,\" Steve said, but he turned back to the window. \"It sure is some view.\"</p>\n<p>Tony was silent behind him, but he could see him twiddling his hands together in the reflection of the glass.</p>\n<p>\"It would be good for the team to spend time together,\" he said. \"And I s'pose if the floor was going to be empty anyway, we might as well make use of it.\"</p>\n<p>\"It's a tax write-off too,\" Tony said eagerly.</p>\n<p>\"And you could use some supervision.\"</p>\n<p>\"Bullshit,\" Tony said cheerfully.</p>\n<p>\"This is very generous of you. Thank you,\" Steve said.</p>\n<p>Tony lifted his nose so high in the air Steve almost laughed. \"Well, yes, it is. You're welcome.\"</p>\n<p>\"So do I get the nickel tour, or what?\"</p>\n<p>\"Nickel tour,\" Tony repeated, rolling his eyes. \"Come on, I'll show you around.\"</p>\n<p>Tony explained as they walked, an unceasing and soothing stream of noise. He, Steve, and Bruce were on this floor, three suites encircling a central area used for a lab. Below them was a kitchen and common room for the team, and below that was the same configuration for Natasha, Clint, and Thor, if Thor ever came back, with a gym instead of a lab in the middle. Steve got the idea Tony had enjoyed arranging everything more than he'd let on.</p>\n<p>When he got home that afternoon, with the keycard to Stark Tower in his pocket and a couple of boxes he'd scrounged on the drive back, he looked around the apartment SHIELD had found for him.</p>\n<p>It seemed really quiet, and really empty.</p>\n<p>***</p>\n<p>Moving in didn't take long. He didn't have much. Nor, apparently, did anyone else -- Clint showed up with two apple crates of belongings aside from his bows and guns, and Bruce had already moved in.</p>\n<p>Natasha was the only one who brought more than a few boxes. As she explained to Steve while he helped her haul them to her room, most of what was in them was for undercover work. Steve looked askance at an entire box labeled <i>Shoes (Heels [5\"+])</i> but figured it wasn't his place to judge.</p>\n<p>It took some adjustment, living with these people in particular, but in general Steve enjoyed the close quarters. He'd never lived alone in his adult life -- first rooming with Bucky, then Basic, then the Army, where even if you could escape the rest of the platoon you couldn't escape their smell. Even in the Star Spangled Road Show, he'd shared a hotel room with Bobby, his unfortunate stage Hitler. (\"Well, it'll be somethin' to tell the kids about, that I used to play Hitler in a revue,\" Bobby had said to him once.)</p>\n<p>He sought out the common areas, the kitchen and sometimes the lab or Tony's workshop. Tony was sociable and so was Natasha, at least when she wanted to be. Clint was awkward and stiff, the first few weeks, but once it became clear that he wasn't going to be held responsible for Loki's actions, he relaxed a little. Bruce still seemed shy, but Steve left Tony to lure him out, since Tony seemed to be good at that. The kid had a knack for leaping into adventures and dragging the reluctant along behind him. He sometimes reminded Steve so much of Bucky that it was almost painful, but he was certainly his own person. The week Tony dyed his hair bright blue confirmed <i>that</i>.</p>\n<p>Steve did his part for the team by insisting they drill together at least twice a week and eat together whenever they could, dragging Tony and Bruce in from the lab and Clint from the firing range next to Tony's garage, making sure Natasha knew to tell them when she'd be gone (even if she couldn't say where, or why).</p>\n<p>\"You know, you should really be the den father,\" Tony said to Bruce one time, as Steve was shooing them towards the elevator down to the kitchen. \"You're the oldest.\"</p>\n<p>\"I'm ninety,\" Steve said firmly. He somewhat relished his status as leader, and Bruce wouldn't enjoy it at all. \"As you continually remind me, Tony.\"</p>\n<p>\"I'm just saying -- hey, how old is Natasha? Are she and Clint older than you?\" Tony asked. \"Are you second-youngest?\"</p>\n<p>\"Still eight years older than you,\" Steve replied. \"Don't get ideas, upstart,\" he added, putting Tony in a gentle headlock. Tony flailed and squawked, but didn't struggle very hard. Steve let him go before the doors opened; Tony stood on a lot of dignity for a teenager, at least in front of Clint and Natasha. Bruce gave Steve a tolerant grin as he followed Tony out of the elevator.</p>\n<p>\"It's fine,\" he said. \"I'm not that good at giving orders.\"</p>\n<p>\"I know,\" Steve said, and Bruce laughed.</p>\n<p>***</p>\n<p>That had been one of the good days, of which there were many. On those days, Steve enjoyed joking with Tony, eating with everyone, and even the jokes at his expense. Most of the days were good days, at least now. He was adjusting, more than mere survival now.</p>\n<p>Sometimes there were...not so good days, true, but he generally soldiered through them. On the not-so-good days, he'd still eat with the team and get out of his suite at least long enough to drill, but he spent most of his time in his bedroom instead of the gym or the common areas. He drew, once in a while, but often he just sat, staring blindly past a television show he'd put on for the noise or looking out at the city.</p>\n<p>On the really-actually-bad days, he half-wondered if the Serum would allow him to survive a drop from the top of Stark Tower. He'd never have done it; there were people who needed him, and he wouldn't do that to Tony. He'd make it seem like an accident, if he did, so nobody would blame themselves.</p>\n<p>He really didn't like the actually-bad days.</p>\n<p>Most of the time, even then, he made it to meals all right, and managed to act normal enough that nobody worried. After all, it never lasted long. And he figured he was allowed a few bad days, given everything he'd lost.</p>\n<p>He was having a fiercely not-so-good day, missing home and his Commandos, but he'd have been okay if he just hadn't missed dinner. Sometimes he set a timer to remind himself, but this time he forgot both the timer and the time. So when someone knocked on his door he looked up from his sketchbook, saw the clock, and flinched.</p>\n<p>\"Yeah!\" he called, pushing himself to his feet and tossing his sketchbook on the bed.</p>\n<p>\"It's Tony,\" Tony's voice came through the door. \"You missed dinner so I thought -- \" he paused briefly as Steve opened it, then smiled up at him, a tray in his hands. \"I brought you some leftovers.\"</p>\n<p>\"You should have come get me,\" Steve said, frowning. \"I mean -- thank you. You didn't have to do that.\"</p>\n<p>\"Clint figured you were probably busy. Not like you to miss a meal, after all,\" Tony said, brushing past him and heading for the drafting table in the corner, one of the few really permanent pieces of furniture Steve had bought since waking up. With a practiced air, Tony kicked the tension gear loose and lowered the tilt of the table until it was flat, sliding the tray onto it.</p>\n<p>\"Natasha made chicken. It's in a sauce. I don't know what the sauce is, but it's pretty good,\" Tony continued, whipping the cover off the tray with a flourish.</p>\n<p>\"Thanks,\" Steve said. \"I'll eat it in a bit.\"</p>\n<p>\"So whatcha up to?\" Tony asked, settling on the edge of Steve's bed like he owned it. Technically, Steve supposed he did. \"Don't tell me SHIELD's got you doing homework.\"</p>\n<p>\"No. Just...working on stuff,\" Steve said, shoving his hands in his pockets. \"You don't have to stay.\"</p>\n<p>\"I don't mind,\" Tony said, flopping back on the bed, arms over his head. \"My neck is cricked from working on the whiteboard all day. Bruce writes his math up high on purpose, I swear. Why is everyone taller than me?\"</p>\n<p>It drew a smile from Steve, and he was opening his mouth to reply, but Tony turned his head to the side and spotted the sketchbook.</p>\n<p>\"Hey, were you drawing?\" he asked, pushing himself up on an elbow and leaning over the open book. \"This is pretty good.\"</p>\n<p>\"It's nothing,\" Steve said, reaching for the book, but Tony had it in both hands now.</p>\n<p>\"He's cute,\" he said. \"He looks a little bit like that guy who pulls coffee at the place down the street. Is that who it is?\"</p>\n<p>\"No,\" Steve said, snatching it out of his hands and closing it. Tony looked up at him, startled.</p>\n<p>\"It was open,\" he said defensively.</p>\n<p>\"Yeah. Sorry,\" Steve replied. He cast about for an excuse or a reason Tony ought to leave, but Tony was looking up at him with narrowed eyes.</p>\n<p>\"You missed dinner doing drawing?\" he asked.</p>\n<p>\"I wasn't hungry,\" Steve said, turning away to set the book on a shelf. \"Thanks for the food though. I'm sure I will be. Later.\"</p>\n<p>\"Hey, Cap, are you okay?\" Tony asked.</p>\n<p>\"I'm fine, Tony. Promise I won't miss breakfast tomorrow,\" Steve said, with a try at a smile.</p>\n<p>\"Who was that in the book?\" Tony pressed.</p>\n<p>\"Nobody. I'm just tired. You should go.\"</p>\n<p>\"Nuh uh. Something's twisty with you, Cap. Come on, you can tell me. I tell you everything. Well, nearly everything. Everything you'd find interesting. Not the point,\" Tony added. \"Oh my God, do you have a crush?\"</p>\n<p>\"No!\" Steve said, turning around. \"Just leave it, okay?\"</p>\n<p>\"Because you know that's cool and all now, right?\"</p>\n<p>\"Tony -- \"</p>\n<p>\"I mean, if it is the coffee guy -- \"</p>\n<p>\"It's not the coffee guy!\" Steve said sharply. \"It's just an old friend. From...\" he choked a little, but got himself under control. \"From back before.\"</p>\n<p>Tony's eyes widened. \"Ohh.\"</p>\n<p>\"<i>Please</i> go,\" Steve said, because he could feel tears pricking behind his eyes. He didn't want to cry at all, soldiers weren't supposed to, but he desperately didn't want to do it in front of Tony.</p>\n<p>\"Steve,\" Tony said, with what was either pity or sorrow in his voice.</p>\n<p>\"You remind me of him, you know,\" Steve said, heaving in a deep breath, the words pouring out now. \"Bucky. He was a wiseass. And pretty good with machines. Nothing on your dad, but -- \"</p>\n<p>He tried to breathe again and his chest hitched. His jaw ached from clenching.</p>\n<p>\"Aw, Steve, no,\" Tony said, throwing himself off the bed and into a hug Steve didn't want. He felt like he was cracking up inside, and he tried to shove Tony off, but he was like a limpet.</p>\n<p>\"Sorry, I'm sorry,\" Tony added, and Steve knew he must just be talking about looking at his drawing but it felt like more, and he pitched forward into the embrace with a sob.</p>\n<p>\"I miss them,\" he heard himself mumbling into Tony's hair. \"I miss everything. I don't belong here, there's so much to know, everything's so complicated. I don't understand half of what people say and sometimes it just hits me and I never had <i>many</i> friends but everyone I did have is dead now -- \"</p>\n<p>\"Shh, yeah, that sucks,\" Tony said, and Steve's next sob was half a laugh because it was so ridiculously <i>modern</i>. He let Tony walk him to the sofa near the window and push him onto it; Tony climbed up next to him and pulled Steve's head down to his shoulder. It was humiliating, and the humiliation made it worse, and he couldn't stop crying. He was setting a bad example, he was letting the side down, but he couldn't help it. He buried his face in Tony's slightly bony shoulder so at least he wouldn't see it.</p>\n<p>Tony had a hand in his hair and was making soft soothing noises, but Steve could feel his awkward tension as well.</p>\n<p>\"JARVIS, call Bruce,\" he heard Tony say softly.</p>\n<p>\"Tony?\" Bruce's voice rang over the speakers. Steve cringed further into Tony's shoulder.</p>\n<p>\"Bruce, I'm having a need-someone-older-than-me moment,\" Tony said. \"Can you come to Steve's?\"</p>\n<p>\"Sure,\" Bruce said, sounding puzzled. \"Be there soon.\"</p>\n<p>Steve tried to catch his breath, but his nose was all congested and he was shaking. He was still working on pulling himself together when his door opened and he heard Bruce inhale.</p>\n<p>\"Help,\" Tony called. \"I broke him.\"</p>\n<p>Steve laughed a little hysterically into his shoulder, which didn't help with the hitching sobs. Tony untangled his arm and pushed him back gently. Steve slumped over, elbows on his knees, head bowed. He could see Bruce's shoes, and the stretch of his trousers over his knees as he crouched in front of him.</p>\n<p>\"Steve?\" Bruce asked gently. \"Are you okay?\"</p>\n<p>Steve nodded. Then, readjusting, shook his head.</p>\n<p>\"Are you in pain? Are you hurt?\"</p>\n<p>\"No,\" Steve managed. \"Just...\" he covered his face. \"Just having a really bad day.\"</p>\n<p>\"Yeah, I know how those go,\" Bruce said. \"What brought this on?\"</p>\n<p>\"The bad day?\" Steve asked. \"Well, missing seventy years will do that to a fella.\"</p>\n<p>\"Yes, I agree,\" Bruce said carefully. \"But this in particular.\"</p>\n<p>\"I was a brat,\" Tony offered.</p>\n<p>\"He wasn't. I'd just like to be left alone,\" Steve said. Neither of them moved to go.</p>\n<p>\"Tony, would you go get a glass of water from the kitchen?\" Bruce asked.</p>\n<p>\"Are you -- \"</p>\n<p>\"Now, please, Tony,\" Bruce said, a little more steel in his voice. Tony huffed, but he got up from the couch. Steve missed him almost as soon as he was gone, which made no sense.</p>\n<p>\"I'm sorry, I know I'm not supposed to,\" Steve said. \"Bad day,\" he repeated.</p>\n<p>\"We all have them,\" Bruce said.</p>\n<p>\"That's why I can't. I'm supposed to be the leader -- \" Steve broke off, wiping his cheeks.</p>\n<p>\"Well, let's take a minute out from what you're supposed to do,\" Bruce said.</p>\n<p>\"I have a handkerchief in the dresser,\" Steve said. Bruce squeezed his knee and stood up, going to the dresser. \"Top drawer.\"</p>\n<p>Bruce nodded and returned with the handkerchief, offering it to Steve, who wiped off his face and turned away to blow his nose. \"Sorry.\"</p>\n<p>\"It's fine,\" Bruce said, waving it aside. \"You don't know embarrassment until you wake up naked in a pile of rubble that used to be a nice apartment building in the suburbs.\"</p>\n<p>Steve gave him a damp smile.</p>\n<p>\"Officers shouldn't show this kind of thing,\" he said, shoving the handkerchief into his pocket.</p>\n<p>\"Well, rank notwithstanding, you're not really in the Army anymore. And definitely not in the forties anymore,\" Bruce said. \"Nobody's going to hold it against you.\"</p>\n<p>\"I scared Tony.\"</p>\n<p>\"Trust me, he's seen worse,\" Tony said, returning with a glass of water. \"You just aren't as intimidating as a nuclear bomb, Steve.\"</p>\n<p>Steve took the glass of water, sipping from it. \"Thank you.\"</p>\n<p>\"Any time. If you want water carried during a crisis, I'm clearly your man,\" Tony replied. \"I accept tips.\"</p>\n<p>\"You can't have scared him that badly,\" Bruce added, amused. Tony flopped down next to Steve again. Bruce gave him a scrutinizing look. \"Can I ask you some questions, Steve?\"</p>\n<p>Steve nodded.</p>\n<p>\"Are you going to be honest?\" Tony asked, turning to face him, crossing his legs on the couch cushion.</p>\n<p>\"Tony,\" Bruce said warningly. Tony held up his hands, innocent, and Bruce turned back to Steve.</p>\n<p>\"Do you have bad days often?\" he asked.</p>\n<p>\"Not often,\" Steve said. \"Sometimes.\"</p>\n<p>\"Does anything bring it on?\"</p>\n<p>\"Just memories,\" Steve murmured.</p>\n<p>\"Do you ever think about harming yourself?\"</p>\n<p>Steve chewed his lip. Bruce reached up and brushed a hand over Steve's cheek, nodding.</p>\n<p>\"Are you now?\"</p>\n<p>\"No,\" Steve said. \"It's not -- it's really nothing, it's not that often. I wouldn't. I have a job to do here.\"</p>\n<p>\"And you haven't told anyone because -- \"</p>\n<p>\"Soldiers don't cry. You just put your head down and keep going,\" Steve said. Tony made a soft, distressed noise. Steve glanced at him.</p>\n<p>\"Something my dad used to say,\" Tony said.</p>\n<p>\"It's the way we are,\" Steve said, trying to explain. \"Were,\" he corrected quietly.</p>\n<p>\"Well, modernize,\" Tony said. Bruce shot him a sharp look. \"No, I mean it. We don't think that way anymore and we may all be messed up but at least we don't have to like, pretend we're okay anymore, we can be messed up. That's half the reason we do this, right? Because we're profoundly <i>not okay</i>.\"</p>\n<p>Steve frowned at him. \"But someone has to keep it together.\"</p>\n<p>\"I thought that was the point of a team. I don't even like teams but look, here I am, because when one of us doesn't keep it together the rest of us can, I don't know, whatever. What do we <i>do</i> for you anyhow?\" Tony asked Steve.</p>\n<p>\"Tony!\" Bruce said sharply.</p>\n<p>\"Well, I don't know, that's why I called you but you're not making it any better,\" Tony replied.</p>\n<p>\"I'm not a psychologist,\" Bruce said. \"I'm doing my best.\"</p>\n<p>Steve looked at them, bickering, Bruce equal parts frustrated and perplexed by Tony like always, Tony being sensible and a little careless with the feelings of others. And he just burst out laughing.</p>\n<p>\"Great, now we broke him in the other direction,\" Tony said. Steve fought down another snort of laughter.</p>\n<p>\"Just, the two of you,\" he said, feeling a warm surge of fondness for them. \"You're ludicrous, you know that, right?\"</p>\n<p>Tony looked offended. Bruce just smiled and pushed his glasses up his nose.</p>\n<p>\"I'm fine, I'm really okay,\" Steve said. \"Just...don't tell Clint and Natasha, okay?\"</p>\n<p>\"They wouldn't think less of you,\" Bruce said.</p>\n<p>\"Still.\"</p>\n<p>\"Your call,\" Bruce replied with a shrug. \"You look like you could use some rest.\"</p>\n<p>\"I have sedatives, if you want some,\" Tony said. Both of them looked at him. \"What? A doctor prescribed them. I had nuke nightmares.\"</p>\n<p>\"You did?\" Steve asked.</p>\n<p>\"Sure. Bruce gets nerves too,\" Tony added.</p>\n<p>\"Thank you, Tony,\" Bruce sighed. Steve turned to him. \"I told you we all have bad days.\"</p>\n<p>\"Oh,\" Steve said. His voice sounded small, even to him.</p>\n<p>\"So,\" Tony said, bringing his hands together and rubbing them. \"Evening in. You're stuck with me at least and probably Bruce until your life stops sucking.\"</p>\n<p>\"I'm okay,\" Steve protested.</p>\n<p>\"Then you won't mind hanging out. You do it all the time anyway,\" Tony said. \"Video games? No, too much brainpower required,\" he said, before Steve could say anything. \"Movies, eh, I can take or leave movies...\"</p>\n<p>\"I wouldn't mind a game,\" Steve said. \"Not a video game, though. Maybe...cards? A board game?\" he ventured.</p>\n<p>\"Are board games still a thing?\" Tony asked Bruce. \"Do people do them?\"</p>\n<p>\"Yes, I'm fairly sure board games still exist,\" Bruce said.</p>\n<p>\"Well, I don't think I own any.\"</p>\n<p>\"I can only imagine how you'd do at Monopoly,\" Bruce said drily.</p>\n<p>\"JARVIS, find me a board game,\" Tony said. \"Wait, no. Fire up the fabrication units and make me one.\"</p>\n<p>\"Did you have a preference for type?\" JARVIS asked.</p>\n<p>\"Surprise me,\" Tony said. \"Let's get snacks while JARVIS prints.\"</p>\n<p>\"But you -- \" Steve said, gesturing at the now somewhat cold chicken on his drafting table.</p>\n<p>\"Snacks,\" Tony insisted. Steve let himself be tugged off the couch, though he did stop and check his reflection before he allowed Tony to drag him downstairs to the kitchen. The Serum was good for a lot, including healing up red-rimmed eyes and congested noses.</p>\n<p>They raided the kitchen, including several hiding spots where food had been stashed without Steve knowing it. He suspected some was Clint's, but some stashes appeared to have been designed specifically for Tony to squirrel food away in. Steve glanced at Bruce, arms full of snack foods, eyebrows raised.</p>\n<p>\"Tony likes options,\" Bruce said with a shrug.</p>\n<p>\"I like hiding things too,\" Tony called, head-and-shoulders inside the pantry, rummaging for something. A bag of rice cakes flew over the door of the pantry, and Steve grabbed it before it could smack Bruce in the chest. \"It makes eating like a treasure hunt.\"</p>\n<p>Steve tucked the rice cakes under one arm and followed Tony into the common room, mostly just going where he was told. Tony settled them in plush chairs around a card table and then took off running for his workshop.</p>\n<p>What he returned with was certainly, per request, a surprise.</p>\n<p>\"Monopolife,\" Bruce read aloud from the box lid. \"An exciting new fusion of two time-honored classics.\"</p>\n<p>\"Look!\" Tony said, flinging the lid aside and shaking out the contents. \"Little figurines and cards and things. This looks complicated.\"</p>\n<p>\"You built a suit of armor that flies,\" Bruce said.</p>\n<p>\"Yeah, and you'll notice that unlike this game, in that, nothing was left to chance,\" Tony said, but he did start setting up the board and placing piles of cards on the appropriate spots. Steve picked up one of the player pieces that tumbled out of the box and studied it.</p>\n<p>\"Very funny, JARVIS,\" Bruce said, holding up one of the other figures.</p>\n<p>\"I do my best,\" JARVIS answered.</p>\n<p>\"They're us,\" Steve said in surprise, offering the Iron Man helmet figurine to Tony. He picked up another one, a bow and arrow on a little stand, and set it aside along with a hammer and a spider. Bruce was holding a tiny pair of glasses, which left Steve's shield, standing upright on a wide base.</p>\n<p>It turned out that Bruce wasn't wrong about Tony's skill at Monopoly, even this strange hybrid version. He'd played Monopoly back in the thirties, at least; the orphanage had a Monopoly set donated by some thoughtful society matron, carefully preserved and only given out to especially well-behaved children who wouldn't lose the pieces. He knew how long it could take to play the game to a standstill, but after about an hour and a half he and Bruce were both out of money and facing defeat at the hands Tony, who had chosen to become a supervillain.</p>\n<p>\"That's what you get for being honest and brave and stuff,\" Tony said, tossing his gigantic stack of money on the board. \"Well, this was wholesome.\"</p>\n<p>\"I enjoyed it,\" Steve said quietly. Tony glanced at him and grinned.</p>\n<p>\"Good. Okay, I'm rethinking my stance on movies,\" he said. \"I want popcorn and violence.\"</p>\n<p>\"That seems to be this century's motto,\" Steve said, cleaning up the game as Tony went to the kitchen. Bruce took the money and began sorting it neatly while Steve packed away the cards and game pieces.</p>\n<p>\"Sex, too,\" Bruce offered. Steve gave him an eyebrow. \"Popcorn, violence, and sex. I can see why it would be hard to adjust.\"</p>\n<p>\"Aw, just leave it,\" Steve mumbled. Bruce clapped him on the shoulder.</p>\n<p>\"You look a little less freaked out.\"</p>\n<p>\"I wasn't...that,\" Steve said. \"I just...\"</p>\n<p>\"I know. A bad day. Feeling better now?\"</p>\n<p>\"A bit, yeah,\" Steve said, putting the lid on the box. \"Thank you.\"</p>\n<p>\"Sometime soon we're going to have a longer talk about this,\" Bruce said. \"Not today.\"</p>\n<p>Steve didn't know how to reply to that, so he didn't; he drifted over to the couch and said, \"JARVIS, movie directory please.\" </p>\n<p>A directory appeared on the television screen, and Steve wasn't sure he'd ever get used to that; books that weren't books, movie theaters in peoples' homes, and any film from the history of cinema available to him at any time.</p>\n<p>\"JARVIS, find something Steve can handle that won't bore me to tears,\" Tony yelled.</p>\n<p>Steve and Bruce exchanged a look.</p>\n<p>By the time the film wound down, Tony had fallen asleep; apparently not even the explosions on the screen could keep him stimulated. His head was butted up against Steve's thigh on the couch, legs draped over the opposite arm. Every once in a while he'd shift, mumbling to himself in his sleep.</p>\n<p>\"He'll be sorry he missed the end,\" Bruce said.</p>\n<p>\"Let him sleep,\" Steve replied, tugging on Tony's shirt-sleeve to straighten it where it had twisted around his arm. \"He's still young, he could use it.\"</p>\n<p>\"Not so young.\"</p>\n<p>\"Young enough. It must be strange for you,\" Steve said. Bruce, slumped back in a nearby chair, gave him a querying look. \"Working with Tony in the lab, I mean.\"</p>\n<p>\"Why?\" Bruce asked.</p>\n<p>\"Must be like working with an impatient monkey.\"</p>\n<p>\"Oh, I don't know. He's a professional. It's no different from when you drill with him.\"</p>\n<p>\"Well, that's Iron Man,\" Steve said.</p>\n<p>\"I don't know if you've heard this,\" Bruce said, sounding amused, \"but Tony is Iron Man.\"</p>\n<p>\"It's just different, that's all.\"</p>\n<p>\"For you, perhaps. Anyway, he's more grown-up than some people I know in their forties. Had to, I think,\" Bruce replied. \"Born old, maybe.\"</p>\n<p>\"Sure doesn't show it out of the armor.\"</p>\n<p>\"Well, not around you,\" Bruce replied. Steve frowned at him. \"He gets to be himself around us. In the lab, when he's working at Stark Industries, when he's Iron Man, he has to be the adult. Here, he doesn't have so much responsibility. Besides, you treat him like a little brother. How do you expect him to act?\"</p>\n<p>Steve looked down at Tony, absently brushing a stray curl of hair away from his temple. \"How should I treat him?\"</p>\n<p>\"There's nothing wrong with it. I think he likes having people who like him around. God knows he needs role models. But I don't know that little-brother is what he wants from you.\"</p>\n<p>\"I can hardly treat him like an <i>older</i> brother,\" Steve said with a smile.</p>\n<p>\"Well, that's for you and him to work out,\" Bruce said, standing and stretching. \"I'm going to bed. Feeling better?\"</p>\n<p>\"Yes, thank you,\" Steve said.</p>\n<p>\"If you have another bad day tomorrow, come and find me,\" Bruce said, giving him a serious look over his glasses from the doorway. \"I've been there.\"</p>\n<p>\"I will. It usually doesn't last long.\"</p>\n<p>\"Good night, Steve,\" Bruce said.</p>\n<p>\"Good night,\" Steve said, turning back to Tony, who had inched his head up onto Steve's thigh, still asleep. He should let him sleep, get him a blanket and leave him here, but --</p>\n<p>Well, it didn't sit right, and he knew -- one of the few real, personal things he knew about Tony, being honest with himself -- that Tony had problems sleeping in unfamiliar places, and doubly so waking up in them.</p>\n<p>\"Tony,\" he said, shaking Tony's shoulder gently. \"Movie's over. Wake up.\"</p>\n<p>Tony's eyes opened, eyelashes fluttering dark for a second against his cheek, and he looked up at Steve with hazy eyes.</p>\n<p>Something warm and protective and deeply unsettling surged up in Steve. He'd felt it a few times before, drilling with Tony or sitting with him at breakfast or once watching him and Bruce bicker in the lab. He felt it when he saw Tony pat Dummy absently on his casing, and sometimes when he (carefully, gently) rough-housed with him, like the headlock in the elevator. </p>\n<p>He didn't know what it meant, and it frightened him. Because Bruce sure had put a point on it: it wasn't the feeling a man had for a brother. More like he'd felt for Peggy, back in the war. And, in secret, hidden ways, for Bucky.</p>\n<p>\"Hey,\" Tony said, unmoving. \"What time is it?\"</p>\n<p>\"Time for soldiers to be in bed,\" Steve said.</p>\n<p>\"I keep telling you I'm not a soldier,\" Tony said, but he curled upward and slid his legs around, flopping up to a sitting position. \"I'm not sure you're catching on that you aren't either.\"</p>\n<p>The words fell out of his mouth before he stopped to think. \"If I'm not a soldier I haven't got anything left.\"</p>\n<p>Tony leaned forward, raising a hand to Steve's neck, and pulled their foreheads together.</p>\n<p>\"So what am I, chopped liver?\" he asked, and Steve broke down and laughed, pulling back.</p>\n<p>\"Get to bed,\" he said. \"Drills after breakfast tomorrow.\"</p>\n<p>\"Sure,\" Tony said, angling lithely up off the couch. \"You too, huh?\"</p>\n<p>\"On my way now,\" Steve said, as Tony stumbled off. \"Night, Tony.\"</p>\n<p>\"Night, Steve,\" Tony said, around a yawn.</p>\n<p>Steve ran a hand over his face and went to his room. He should have felt more ashamed by what had happened, he thought, but he just couldn't summon the energy for it. Let it wait until morning.</p>\n<p>Sleep was easier in coming than he thought it would be. </p>\n<p>***</p>\n<p>\"I think we should go out tonight,\" Tony said, halfway through drill the next morning. \"I know half a dozen clubs that'll pretend I'm 21, and another dozen that are under-21 friendly.\"</p>\n<p>\"Yeah, I want to party with teenagers,\" Clint drawled, firing arrows at Steve's shield, trying to calculate ricochets.</p>\n<p>\"Hey!\" Tony yelped, offended, and darted upwards to catch a grappling rope thrown by Natasha.</p>\n<p>\"Present company excepted,\" Clint corrected. \"But only because you party like it's what you were born to do, Tony.\"</p>\n<p>\"I might have been,\" Tony said, a little sniffily.</p>\n<p>\"Certainly seems to be genetic,\" Steve remarked.</p>\n<p>\"Oh <i>snap</i>, what was that?\" Tony asked. \"Did my dad once maroon you in a speakeasy or something, old man?\"</p>\n<p>\"Focus, Tony,\" Steve replied.</p>\n<p>\"Yeah, you only ever say that when you don't want to answer something,\" Tony said. \"Wait, hold up,\" he added, dropping low and hovering. \"I want to try a new maneuver. Hawkeye and Black Widow, ledges, not together,\" he said, pointing to one of the irregularly-spaced ledges in the gym wall. \"Clint, Natasha's got about a fifty percent success rate trying to lasso me.\"</p>\n<p>\"Most of my targets are slower than you,\" Natasha said. \"You know, like you, out of the suit.\"</p>\n<p>\"Tut,\" Tony said. \"Don't be hurt, baby, I'm hard to catch. But if you do need to rope me to get a ride somewhere, I don't want you falling when your rope doesn't reach.\"</p>\n<p>\"I gotcha,\" Clint said, disassembling one of his grappling-hook arrows. \"See if I can shoot a line past her and make it stick to you. Timing'll be a little tricky, but -- \"</p>\n<p>\"You're better with timing than aim, long-distance,\" Tony said to Natasha.</p>\n<p>\"What is this, dump on Black Widow day?\" she asked.</p>\n<p>\"He's not wrong,\" Steve said, watching as Clint knotted a loop in the end of his rope. \"Next time we'll all pick on Tony, how's that?\"</p>\n<p>\"What else do you punks do all day long but pick on me?\" Tony asked. \"Ready when you are, Clint.\"</p>\n<p>\"Get a little motion,\" Clint replied. \"If you're hovering anyone can hit you.\"</p>\n<p>Steve, clearly not needed for this exercise, stepped back and watched. It took them half an hour to execute it perfectly, but if he rotated it into their regular drill schedule, by the time they had to do it in battle they'd be fine.</p>\n<p>After a while he felt Bruce's presence at his elbow, and glanced over to see him watching, StarkPad tucked under one arm. Normally Bruce attended drill, sat on a bench against the wall, and worked quietly; Steve kept threatening to take them all camping so they could let the big guy out and see how he played with others, but Tony was set against it. Steve suspected his only real reason was that he didn't want to go camping.</p>\n<p>\"You seem better this morning,\" Bruce remarked.</p>\n<p>\"I do like drills,\" Steve replied, looking back at where Tony was trying to catch the loop with his booted foot. He keyed off his comm as Bruce turned to him. \"I told you, it never lasts long.\"</p>\n<p>Bruce was opening his mouth to speak when the lights flickered and a klaxon sounded, loud enough Steve felt it in his bones.</p>\n<p>\"That's the SHIELD sensor mirror,\" Tony yelled over the noise.</p>\n<p>\"I don't know what that means!\" Steve yelled back.</p>\n<p>\"Something big and ugly coming Earth's way,\" Tony called, and with a gesture cut the noise. He dropped to the gymnasium floor, flipping his faceplate up. \"If it's something to worry about we should get a call from Fury in about two minutes,\" he said, holograms flying up around him. Steve glanced at Natasha and Clint, giving them the nod, and Natasha ran for the armory (Clint's spare quiver, guns for Steve and herself) while Clint made for the landing pad.</p>\n<p>\"What the hell...?\" Tony was staring at the holograms, looking perplexed.</p>\n<p>\"What are you seeing?\" Steve asked, leaning over his shoulder on one side. Bruce was already manipulating things on the other.</p>\n<p>\"Okay, well, Bruce, I would take off your shirt just in case, if it's one you like,\" Tony said. \"But I want you here riding the servers, not Hulking all over Manhattan.\"</p>\n<p>\"Good grief,\" Bruce said. \"Is that what I think it is?\"</p>\n<p>\"Yup,\" Tony replied. He turned to look up at Steve. \"The energy readings I'm picking up -- well, getting through SHIELD -- are identical to the signature I recorded going through the wormhole.\"</p>\n<p>\"Where is it?\" Steve asked.</p>\n<p>Tony looked grim. \"Everywhere.\"</p>\n<p>Which was when Fury called.</p>\n<p>***</p>\n<p>The situation wasn't <i>as</i> dire as the last time, given nothing seemed to be coming through the portals that were covering the sky, but it still wasn't precisely safe. Manhattan was being evacuated, air traffic had been routed around the entire state, and looking at the sky was not a good idea. It was like someone had asked Salvador Dali to repaint reality. Colors twisted in on themselves. In some places, some of the taller skyscrapers seemed to be made out of other skyscrapers.</p>\n<p>The series of small wormholes filling the airspace over Manhattan didn't seem to connect to actual outer space, not in the way the big one had before. But as Tony hovered around one of them, studying it intently, he said what Steve didn't really want to hear:</p>\n<p>\"I don't think there's any real way of knowing where they lead without going through one.\"</p>\n<p>Steve rubbed his forehead.</p>\n<p>\"If we map the network, there might be a pattern,\" Bruce said. \"If we can figure out where each one leads...\"</p>\n<p>\"Well, at least they seem bidirectional. I mean, if you fly through one of them, and then fly back in where you came out, you're not going somewhere new. I hope,\" Tony said.</p>\n<p>\"Iron Man,\" Steve said, standing on the ground, ready for anything but not really prepared for the sheer lack of action they were seeing. \"Do not fly through a wormhole.\"</p>\n<p>He could see, even at this distance, Tony reach out to drift his hand in front of one of them, thoughtfully. \"No, I'm not doing that.\" Tony said. \"I got just the thing.\"</p>\n<p>\"Tony -- \"</p>\n<p>\"It's fine. JARVIS, how many of the mini-mes do we have?\"</p>\n<p>\"The <i>what?</i>\" Steve asked.</p>\n<p>\"Pop culture,\" Clint said. He waved at Steve from the roof of a nearby building, then made a gesture with his pinky that Steve didn't understand. \"I'll show you the movie, you'll hate it.\"</p>\n<p>\"Oh good,\" Steve sighed.</p>\n<p>\"Guys, don't freak out,\" Tony said, which was usually a sign that they should at least be wary. Steve fell back into a fighting stance, but instead of anything falling out of the wormholes, as he'd expected, there were several low whining noises and --</p>\n<p>\"INCOMING!\" he yelled, ducking back behind his shield as the air filled with tiny missiles.</p>\n<p>\"FRIENDLIES!\" Tony yelled. \"DON'T SHOOT!\"</p>\n<p>The missiles converged on Tony, and Steve watched in awe as they formed a little floating cloud behind him, clearly obeying some command Tony was giving that Steve couldn't see. Not missiles, then; little repulsor-driven robots, perhaps.</p>\n<p>\"All right, JARVIS, track every mini-me individually,\" Tony said. \"I want a three-dimensional wireframe of where they go and a map of imaginary space between in and out. Bruce, are you picking up what I'm laying down?\"</p>\n<p>\"How much money did each of those cost?\" Bruce asked down the comm.</p>\n<p>\"More than you'd be comfortable with, not so much they're not expendable,\" Tony said.</p>\n<p>\"Unlike you,\" Steve said.</p>\n<p>\"I told you, I'm not going through any wormholes, I've had enough panic attacks,\" Tony said. \"On three. And three, two, one, bots away!\"</p>\n<p>The little robots fanned out and began disappearing through holes in the sky, sometimes reappearing through others. Tony conducted it like an orchestra, head thrown back dramatically, clearly enjoying himself as he hovered above them.</p>\n<p>Steve lowered his guard a trifle as he watched the robots dance in and out of the wormholes, dipping and weaving gracefully around Tony. Clint reached out and snatched at one as it went past, hanging by one hand over open air until it deposited him on another roof. It circled and zipped down past Steve, a clear invitation, and he could hear Tony laugh as he jumped and caught it like Clint had, hitching a lift up to where Clint was standing.</p>\n<p>\"Pretty cool,\" Clint said, as Steve released the little robot and landed. \"Kid's got some bright ideas. Hey Tony, I want one!\"</p>\n<p>\"They're not pets, Clint,\" Tony said.</p>\n<p>\"But you could program one to come when I called and sleep on my bed at night, right?\"</p>\n<p>\"I'm getting a good image now,\" Bruce interrupted. \"There's a definite pattern coming through, but...it doesn't...\"</p>\n<p>He trailed off.</p>\n<p>\"Bruce, toss it on my HUD,\" Tony said.</p>\n<p>\"Uh,\" Bruce said. \"Tony, I think you should land.\"</p>\n<p>\"Why?\" Tony asked, drifting down towards the rooftops. \"What is it -- ohhhh, noooo.\"</p>\n<p>\"Gentlemen, you want to clue us in?\" Steve asked.</p>\n<p>\"The conduits are forming a pattern similar to the ones SHIELD picked up whenever Thor traveled,\" Bruce said. \"They're forming a giant...a giant knotwork pattern. In the sky.\"</p>\n<p>Steve was only half-listening, senses alert as the air began to feel thick and staticky. There was a buzzing noise somewhere nearby, and it seemed to be getting closer.</p>\n<p>\"Brace for Asgardians,\" Tony yelled.</p>\n<p>There was a roar like the world was ending, and Steve could see a familiar silhouette with hammer upraised, tumbling through one of the wormholes.</p>\n<p>And then the sky fell in.</p>\n<p>It took Steve a second to understand what had happened. By the time he had, they were already under attack. A swarm of creatures, winged and fanged and no longer than his forearm, was pouring out of the wormholes. Tony was cursing and Bruce was yelling something over the comms; Steve felt Clint's quiver press against his back, and the flex of one of Clint's arms as he drew on the bow.</p>\n<p>\"What are they?\" he yelled. \"Widow, location!\"</p>\n<p>\"Your three,\" Natasha called. \"On the street.\"</p>\n<p>\"You need cover?\"</p>\n<p>\"Nope. Happiness is a warm gun,\" she replied, and Steve heard distant gunfire.</p>\n<p>\"Tony?\"</p>\n<p>\"Little busy here!\" Tony yelled, and Steve could see him massing the robots, some of them already engaging with the small, winged, blue-skinned --</p>\n<p>\"The hell ARE these?\" Clint yelled, firing into the swarm.</p>\n<p>\"HELL FAIRIES!\" Tony cried. \"FAIRIES FROM HELL.\"</p>\n<p>\"I saw Thor,\" Steve said. \"Clint, did you see that?\"</p>\n<p>\"Sorry, busy shooting,\" Clint replied. \"Booya! Eat arrow, hell fairy!\"</p>\n<p>\"Stop calling them that!\" Natasha said.</p>\n<p>\"Where are they coming from? All these wormholes lead to each other!\" Tony said, sounding bewildered.</p>\n<p>\"Deal with that later,\" Steve replied. \"Can you find Thor for me, Tony?\"</p>\n<p>\"Ohhh, this is freaksome, the wormholes shifted,\" Tony said, ignoring him. \"We've got a conduit direct to Asgard here. Scanning for Thor now. Are you sure you saw him?\"</p>\n<p>There was a crunching noise, and a shift in the air; up through the swarm of creatures came a hammer, followed by Thor. He landed on the roof, swinging wildly at the creatures.</p>\n<p>\"Never mind, I got him,\" Steve said faintly.</p>\n<p>\"Comrades!\" Thor bellowed. \"My apologies!\"</p>\n<p>\"Say sorry later,\" Steve said. \"How do we get rid of these things?\"</p>\n<p>\"I'm on it,\" Tony replied. \"JARVIS is running some calculations. Buy me five minutes and I'll seal up the sky again.\"</p>\n<p>\"Thor, what did you do?\" Clint demanded, still firing into the swarm.</p>\n<p>\"Loki was attempting to escape,\" Thor replied, swinging his hammer. Steve blocked a dive-bomb with his shield and threw it just in time to bounce off the head of a hell fairy menacing Clint. \"He summoned them as a diversion while he opened the portal. I leapt through the portal before he could; they followed me.\"</p>\n<p>\"Figures,\" Clint said, sounding hard and angry.</p>\n<p>\"Volstagg had Loki, last I saw; we have only to worry about these little menaces,\" Thor answered. He looked a lot happier than Steve felt anyone had a right to look just now.</p>\n<p>\"Someone tell Thor I need him,\" Tony said. \"We need a high-frequency electric charge to knock these babies out and close the portals.\"</p>\n<p>\"I hear you, Iron Man,\" Thor said.</p>\n<p>\"You do?\" Tony asked.</p>\n<p>\"Aye, through the radio in the Captain's ear. I understand what must be done. Prepare to meet your doom, enemies of Midgard!\" Thor bellowed.</p>\n<p>Tony yelled \"Wait, stop!\" at the same time Steve yelled \"Not at me!\" and Thor brought the hammer around and down, for the second time in their acquaintance, on Steve's upraised shield. The impact threw Steve down on his knees, and the shockwave spread out in an expanding hemisphere, sweeping the hell fairies with it in a cloud of blue glitter.</p>\n<p>Steve heard the crackle as Tony's radio shorted out, and a second later he saw the glowing repulsors in his boots fail.</p>\n<p>Tony wasn't as high up as he'd been last time, and it was clearly a controlled dive; Steve watched as Tony tucked his body down and fell, angling for a building, probably to try and slow his descent.</p>\n<p>\"I got him,\" Steve heard Clint say.</p>\n<p>\"You <i>what?</i>\" Steve asked, voice rising.</p>\n<p>\"I got him,\" Clint repeated, tracking Tony with an arrow. \"Little lower, little more -- \"</p>\n<p>Steve watched in awe as Clint put two arrows in the armor, filament lines playing out behind the shafts, the other ends wrapped around Clint's arms in readiness. It was an ingenious solution, but if he tried to catch three hundred pounds of armored teenager with two ropes he'd take his hands off at the wrist. Steve dove forward, hooking the shield's handles through the lines and letting the leather take most of the sharp snap, throwing himself backwards as the lines finally caught Tony's weight. His feet skidded forward and Clint hooked his arms around Steve's, pulling hard. Their weight, the ropes, and physics all conspired to slam Tony into the building below them.</p>\n<p>\"Let go!\" Clint gritted, and Steve let the line play through his hands and off the shield. He was turning almost before they left his grasp, running for the doorway to the stairwell.</p>\n<p>It wasn't hard to tell where Tony had landed. They just followed the dust cloud, and then the trail of debris, to where the armor lay half-propped against a wall. When Steve knocked on Tony's helmet, frantic with fear, it popped up and Tony howled with laughter.</p>\n<p>\"That was fucking AWESOME!\" he said, straining to get the unresponsive armor to obey him. \"Better than a roller coaster! Ugh, Clint, nice shooting,\" he added, rolling over, revealing the broken-off stubs of Clint's arrows in the back of his armor.</p>\n<p>They'd gone clean through two joints, hooking in the shoulder plates. And in flesh, Steve saw, as Clint tugged them free.</p>\n<p>\"I'm gonna be so bruised,\" Tony said, still clearly high on adrenalin. Blood began to seep through the plates.</p>\n<p>\"Oh, my god,\" Steve murmured, pulling the plates apart, yanking the back-armor off.</p>\n<p>\"Hey, watch it with the -- <i>ow</i>,\" Tony said.</p>\n<p>\"Lie still,\" Steve ordered, tugging his gloves off and pressing them over the wounds. Clint reached out and took over for him while Tony complained about being pinned face-down.</p>\n<p>\"Can I call out somewhere on this thing?\" Steve asked, fiddling with his earpiece.</p>\n<p>\"Captain,\" a voice said in his ear, suddenly.</p>\n<p>\"JARVIS?\" Steve asked.</p>\n<p>\"I cannot contact the armor.\"</p>\n<p>\"Tony's hurt. We need medics.\"</p>\n<p>\"To your location?\"</p>\n<p>\"Please, quickly,\" Steve said.</p>\n<p>\"Summoning. Agent Romanoff will meet them and guide them to you,\" JARVIS replied crisply. \"How badly is Sir injured?\"</p>\n<p>\"He took two of Clint's arrows and did a header into a building,\" Steve replied. \"He's lucid, mostly.\"</p>\n<p>He could hear the tremor in his voice. It was objectively better than hitting the pavement, and much better than Tony's first, terrible fall, but also worse -- because now Tony wasn't just a mouthy braggart he sort of knew. He was...he was <i>precious</i> to Steve, in a way he shied away from defining.</p>\n<p>By the time the medics arrived, Steve was breathing hard, after-battle stress taking over. They took a look at him and split up, one of them to stabilize Tony while the other forced an oxygen mask over Steve's face.</p>\n<p>***</p>\n<p>They debriefed in Tony's hospital room, Tony propped on his stomach on a pile of pillows.</p>\n<p>\"Could have been worse,\" he said, through a painkiller-happy grin. \"Could have been my ass.\"</p>\n<p>\"I aim to please,\" Clint replied.</p>\n<p>\"Really, it's very good workmanship,\" Natasha said, examining Tony's stitched-up wounds. \"Not that deep or long. Were you gauging tension in the bow?\" she asked.</p>\n<p>\"Course I was. I wanted to catch him, not impale him,\" Clint said, affronted.</p>\n<p>\"It was quick thinking,\" Steve said. \"Next time, however, let's make sure we don't cause a huge electrical charge while Tony's in the air?\"</p>\n<p>Thor looked sheepish. \"I did not consider it.\"</p>\n<p>\"Understandable,\" Steve replied. \"We'll work on it in drills, if you're sticking around.\"</p>\n<p>\"I fear I may have to,\" Thor said. \"The return to Asgard will require considerable energy. My father may not be able to summon me for some time.\"</p>\n<p>\"The good news is, you vaporized pretty much all of whatever they were,\" Bruce said, entering the room. \"SHIELD's doing glittery blue cleanup now. Apparently the only uh...hell fairies left are the ones you all personally dismembered.\"</p>\n<p>\"Not sorry,\" Clint and Natasha said in unison.</p>\n<p>\"Well, it'll be interesting for the xenobiologists,\" Bruce sighed.</p>\n<p>\"We have xenobiologists?\" Tony asked. \"Plural, even?\"</p>\n<p>\"Brave new world,\" Bruce said, patting the small of Tony's back absently. Steve bristled, then tamped it down.</p>\n<p>\"We could still go clubbing tonight,\" Tony said, but the effect of his enthusiasm was somewhat dampened by the way he was faceplanted into a pillow.</p>\n<p>\"How about you just have a private party right here,\" Clint said kindly.</p>\n<p>\"Hospital rave,\" Tony agreed. \"Works for me, I'm already on the good stuff. Hey, thank you for saving my life by shooting me in the back.\"</p>\n<p>\"Anytime. I'm going to go get some food and shuteye,\" Clint said. \"Anyone who wants a ride back to the tower, quinjet leaves in ten.\"</p>\n<p>\"I'll stay,\" Steve said, because everyone else looked exhausted except Bruce, who looked faintly stressed every time he glanced at Tony's bare back and saw the stitches there. \"Thor, let's talk tomorrow. In the meantime, Tony set up a place for you at the tower. Bruce can show you where.\"</p>\n<p>\"My thanks,\" Thor said from the doorway. \"I apologize for the mess.\"</p>\n<p>\"Not your fault. Well, mostly,\" Steve said. \"See you tomorrow.\"</p>\n<p>\"Let us know how he does. Don't let him go anywhere,\" Natasha ordered.</p>\n<p>\"I'm not a <i>child</i>,\" Tony grumbled.</p>\n<p>\"That's what we're afraid of,\" Natasha replied, patting him on the head (harder than necessary, to judge from Tony's yelp) and following Bruce out. Steve slumped down in the chair, partly from fatigue, partly because it gave Tony an easier view of his face. Tony turned his head and crossed his eyes at him, and Steve snorted.</p>\n<p>\"Hey, how about in like, an hour you do a burger run?\" Tony wheedled. \"I hate hospital food.\"</p>\n<p>\"We're on the helicarrier. I think they'll notice if I hijack a quinjet and take it around a drive-through,\" Steve said. Natasha had introduced him to drive-throughs; Steve thought they were one of the better inventions in food technology that had taken place while he slept. \"Tell you what, if you're good I'll buy you a Hershey bar from the commissary.\"</p>\n<p>\"You're so ooooold,\" Tony groaned.</p>\n<p>\"No respect,\" Steve teased. \"No respect at all for helping save your life.\" He sobered a little, catching Tony's eye. \"Honest, though. You gotta stop falling out of the sky, Tony. My nerves can't take it.\"</p>\n<p>Tony smiled. \"Do you know the myth of Icarus?\" he asked.</p>\n<p>Steve cocked his head.</p>\n<p>\"Icarus and Daedalus built wings to escape from a prison. Wax, covered in feathers. Icarus loved flight, and flew too close to the sun. The wax melted and he fell,\" he said.</p>\n<p>\"Yes, I know the story,\" Steve said quietly.</p>\n<p>\"But I bet you, if Icarus was anything like me, he was only thinking one thing as he went down,\" Tony said. \"He was thinking, <i>worth it.</i>\"</p>\n<p>\"Tony.\"</p>\n<p>\"There's this saying, y'know, goes like, <i>with great power comes great responsibility</i>,\" Tony continued. \"But I always thought that got it backwards.\"</p>\n<p>\"With great responsibility comes great power?\" Steve tried, not liking the way it sounded.</p>\n<p>\"Great power is <i>worth</i> great responsibility,\" Tony said. \"I love flying. Being Iron Man is my favorite thing in the whole world. If I fall for good one day, it...it'll have been worth it.\"</p>\n<p>\"You know,\" Steve said, \"You keep saying we're not soldiers, but then you keep talking like one.\"</p>\n<p>\"Well, I'm high, I can't be held responsible,\" Tony said. Steve clapped him gently on the shoulder, then frowned.</p>\n<p>\"You're cold,\" he said.</p>\n<p>\"Little bit,\" Tony agreed.</p>\n<p>\"You want some more blankets?\"</p>\n<p>\"Please.\"</p>\n<p>He had one already, pulled up around his waist, and Steve unfolded it carefully over his shoulders. There was another one under the bed, and he spread that one out too, then tucked a third around his feet. Tony sighed happily, curling one of them around his arm with a fist, burrowing his face into the soft fabric.</p>\n<p>\"Are you staying?\" he asked.</p>\n<p>\"I said I would,\" Steve replied.</p>\n<p>\"You don't have to.\"</p>\n<p>\"I want to.\" Steve ruffled his hair. Tony closed his eyes, leaning into the touch, so Steve left his hand resting on his head, just above his ear.</p>\n<p>\"If I were older,\" Tony began, clearly on the brink of sleep.</p>\n<p>\"God save us all from what you're planning when you get older,\" Steve said, amused. \"What, Tony?\"</p>\n<p>\"Hmm. Nevermind,\" Tony mumbled, breath evening out. Steve drew back and settled into the chair, ready to sit vigil until Tony could be taken home.</p>\n<p>***</p>\n<p>Pepper arrived on the Helicarrier around dinner time; when she appeared in the doorway, Clint was lurking guiltily behind her, and Steve surmised that she'd browbeaten him into bringing her here. Pepper was nice, but there was no saying no to her, even as a superhero.</p>\n<p>She woke Tony by the simple expedient of pulling the blankets off before Steve could stop her. Tony yelped and flailed a little, then pushed himself up and glared.</p>\n<p>\"Cruel, evil genius,\" he said, and Pepper shoved a bundle of fabric in his face.</p>\n<p>\"Put on the t-shirt, it's to keep you from bleeding on the sweater,\" she said. \"Steve, I'd like you to know I'm blaming you.\"</p>\n<p>\"Yes, ma'am,\" Steve said, because he didn't really see why she wouldn't. He was the team leader, after all. She gave him an exasperated look.</p>\n<p>\"Can you put your own shoes on?\" Pepper asked Tony, who was easing his arms through the sleeves of the shirt.</p>\n<p>\"Why, does being in the hospital suddenly devolve my fine motor skills?\" Tony replied peevishly. Apparently the painkillers had worn off.</p>\n<p>\"Try bending at the waist,\" Pepper said. She made a vindicated-but-unsatisfied noise when Tony tried, then stiffened and caught his breath. Steve knew the way sudden, sharp pain could prick up tears even if you weren't particularly hurt -- the surprise of it was more than enough. He ignored Tony's blinking eyes and gently guided Pepper out of the way, kneeling to pick up the shoes she'd brought, socks tucked neatly inside them.</p>\n<p>\"Well, they earn their keep, I'll give them that,\" he heard Pepper say, and smiled as he bent over Tony's foot, resting it on his thigh while Tony struggled to pull on a sweater.</p>\n<p>\"I do try to make myself useful, ma'am,\" he said, lacing up one of the shoes. He avoided Tony's gaze as he lifted the other foot and completed his task, and by the time he'd stood up and dusted off his trousers, Pepper was hustling Tony out of the room, back towards the Quinjet hangar. Steve gathered up his shield and followed, feeling slightly ridiculous to be in full uniform, trailing behind Pepper in her nice skirt set and Tony and Clint in casual clothes.</p>\n<p>Tony managed to stay awake for the jet ride, possibly because the occasional jolt of turbulence hurt his injuries. When they reached home, Steve waited somewhat fruitlessly and aimlessly outside Tony's suite while Pepper got him settled.</p>\n<p>\"Anything I can do?\" he asked, when she emerged.</p>\n<p>\"Not unless you can add two more hours to my day,\" she said with a smile. \"And that's not a jab at Tony. I need two more hours added onto <i>every</i> day. Fortunately, the evacuation means my evening is clear.\"</p>\n<p>\"Not the most ideal way to get yourself a holiday,\" Steve said.</p>\n<p>\"No, but I'll take what I can get. Besides, at least life's never dull, right?\" Pepper said. She gave him a knowing look. \"Tony's asleep again, if you want to go in and sit with him. Really I should have let you get him settled.\"</p>\n<p>\"Why?\" Steve asked, baffled.</p>\n<p>\"Well, he listens to you more than most people. He's become immune to me through exposure.\" She patted his shoulder.</p>\n<p>\"He should probably rest,\" Steve said reluctantly. \"And I need to talk to Thor.\"</p>\n<p>\"Eat first, if you haven't. I think I heard Bruce say he was leaving some Chinese in the fridge for you.\"</p>\n<p>\"Thanks, Pepper,\" Steve said.</p>\n<p>She gave him an odd look as she left. \"You're the ones who brought him back alive.\"</p>\n<p>***</p>\n<p>The next morning, Steve came back from his run to find Tony's damaged backplate mounted on a wall in the common room. Someone had written \"TEAMWORK!\" on the metal in thick grease-pencil letters, with lines pointing to the two dents that Clint's arrows had left.</p>\n<p>He found Tony alone in the kitchen, slumped over the big table they ate at, face-down, hands gripping a mug of coffee.</p>\n<p>\"Morning,\" he said, amused, and received a groan in reply. \"How's the back?\"</p>\n<p>\"Stiff,\" Tony replied. \"I'm all cramped everywhere from sleeping wrong. Prescription strength Tylenol, come to me.\"</p>\n<p>He made grabby hands at a pill bottle sitting just out of reach. Steve took pity on him and moved it into his grasp.</p>\n<p>\"That stuff'll stunt your growth,\" he teased, as Tony downed a pill with half the mug of coffee.</p>\n<p>\"Bite me,\" Tony replied, no real venom in his voice. Steve poured himself a glass of milk and settled into the chair next to Tony, bumping his shoulder gently.</p>\n<p>\"You want some food?\"</p>\n<p>Tony shook his head, staring at his coffee. He looked like he was working up to something, so Steve kept silent, sipping his milk.</p>\n<p>\"Clint told me you freaked out when you guys found me,\" Tony said finally.</p>\n<p>\"I wouldn't call it that,\" Steve answered, feeling a little defensive. \"We were coming out of combat, that's all.\"</p>\n<p>\"Why didn't you tell me?\"</p>\n<p>\"Well, first you were bleeding, then you were in the hospital, then you were asleep,\" Steve said. \"Besides, it's not relevant. They gave me a little oxygen, I was fine.\"</p>\n<p>\"You're always fine.\"</p>\n<p>\"I try,\" Steve agreed.</p>\n<p>\"You shouldn't try so hard,\" Tony said. \"I can't get a read on you sometimes.\"</p>\n<p>\"I don't mean to be inscrutable,\" Steve said, smiling.</p>\n<p>\"Well, you are,\" Tony said, turning to him. \"Y'know, when I was sixteen I almost died and I thought, wow, my life has sucked, how useless, and I had regrets.\"</p>\n<p>\"You were sixteen,\" Steve said. \"You're only eighteen now. How useful were you hoping to be?\"</p>\n<p>\"More than I was. So I said to myself, when I got out, I wasn't going to have any regrets. I wasn't going to lie about who I am or miss opportunities to be awesome.\"</p>\n<p>\"How's that going for you?\" Steve asked.</p>\n<p>Tony kissed him.</p>\n<p>It startled him for a second, the sudden movement, the slight pained sound Tony made against his lips as it pulled his stitches. Steve tasted coffee and morning breath, and became suddenly, acutely aware of how sweaty he himself was, how Tony's hand was curled in the smelly, damp shirt he wore. Tony's mouth opened and Steve was in no way prepared for this, for Tony kissing him or for <i>anyone</i> kissing him.</p>\n<p>He lifted a hand, searching for some way to anchor himself, and heard Tony hiss in pain. He jerked back, catching Tony's jaw with his hand.</p>\n<p>\"Please don't be pissed off,\" Tony said, breathing in short little pants. \"I know you probably think of me like a little brother or a fellow soldier or something but I've had a crush on you since like, the first time I saw you in those really tight Captain America pants and I almost died yesterday and you stayed the whole time I was in the hospital -- \"</p>\n<p>Steve made a quiet, hushing noise, and Tony fell abruptly silent. With the hand on his jaw, Steve pushed him back slightly, easing the strain on his wounded shoulders.</p>\n<p>\"Better,\" he said, and leaned in and kissed Tony this time, teeth clicking against Tony's for a second before they sorted out just the right angle.</p>\n<p>The sun was shining in through the kitchen windows, and Tony smelled like coffee and soap and felt impossibly delicate under his hand. Steve swept his thumb up across Tony's cheek as they kissed, feeling the soft play of muscle under skin, the jump of Tony's pulse. For just a minute, the whole world was golden light and warmth, and he felt warm and content.</p>\n<p>There was one thin thread of guilt running through it, though, itching at him like a chore left undone. When he realized what it was, he sighed and leaned back.</p>\n<p>\"What, why, no stopping,\" Tony complained, trying to lean forward. Steve put his other hand on his chest to keep him there.</p>\n<p>\"Tony,\" he said, choosing his words carefully. \"I'm eight years older than you.\"</p>\n<p>\"I can do math.\"</p>\n<p>\"I know you can. But you are -- look, I remember being your age,\" Steve said. \"And you don't have many people who can...give you advice on this sort of thing.\"</p>\n<p>Tony gave him an incredulous look. \"Are you seriously telling Iron Man that he needs parental guidance?\"</p>\n<p>\"No. I'm telling <i>Tony</i> that I want him to be sure,\" Steve said. \"I don't want you to make a mistake. To have regrets,\" he added.</p>\n<p>Tony nodded, apparently considering it, and Steve's heart fell for a brief second.</p>\n<p>Then Tony moved, sliding out of his chair and smoothly onto Steve's lap, straddling his thighs. Steve's hands went down automatically to frame his waist, keeping him steady. He could feel the slightness of him, the wiry muscle.</p>\n<p>\"I'm a big boy, Steve,\" he said, nosing against Steve's jaw. He lifted his head and kissed him. \"I can make my own mistakes. And I don't care if you don't.\"</p>\n<p>\"Can't really bring myself to,\" Steve said, relief flooding him. \"But I thought I ought to say.\"</p>\n<p>\"Very devoted to duty, admirable,\" Tony replied, against his mouth. \"I -- \"</p>\n<p>He was interrupted by the noise of a throat clearing nearby. Steve jerked back, looking to one side, and saw Bruce standing in the doorway.</p>\n<p>\"Well,\" Bruce said, adjusting his glasses. Tony made no move, and Steve couldn't very well push him off his lap. \"<i>Finally.</i>\"</p>\n<p>He left without another word. Steve blinked, then looked back at Tony.</p>\n<p>\"I think,\" Tony said, an impudent grin on his face, \"you just got the closest thing you're going to get to parental approval to date me.\"</p>\n<p>Steve grinned back. \"In that case, let me take you to dinner tonight.\"</p>\n<p>\"No clubbing?\"</p>\n<p>\"No clubbing,\" Steve said, fingers flexing on his waist. \"Let me do this right, Tony.\"</p>\n<p>\"Do you really think, considering it's me, you could do it wrong?\"</p>\n<p>\"Yes. I think a lot of people probably have, in the past,\" Steve said, raising one hand to his jaw again. \"So indulge my old-fashioned notions, please.\"</p>\n<p>Tony leaned into the touch, eyes betraying the uncertainty he wouldn't show any other way. It was heartening, almost; at least it meant Tony understood the seriousness of what they were doing. Steve doubted he'd ever been serious about anyone in his young life.</p>\n<p>\"If you're scared, if you're not sure, it's all right,\" he murmured, remembering how mysterious and terrifying sex had seemed to him at eighteen. Tony'd probably already had plenty, but not like this -- not when it meant something, with someone he knew like he knew Steve. \"We don't have to do anything about this if you don't want to. And if we do, we can go slowly.\"</p>\n<p>\"I'd like to,\" Tony said. \"Dinner, right?\"</p>\n<p>Steve smiled, easing Tony back gently until he got to his feet. Steve rose too, trying not to tower over him, and kissed him quickly.</p>\n<p>\"It's been a crazy couple of days,\" he said. \"Get some rest. I have after-actions to review and I have to speak with Thor. Six o'clock tonight, I'll meet you out here. Don't get dressed up, we're not going anywhere fancy.\"</p>\n<p>\"Soldier's salary?\" Tony asked with a tilt of his lips.</p>\n<p>\"Not that fond of high-class eats,\" Steve replied. \"See you at six.\"</p>\n<p>Tony sometimes forgot that Steve had very good hearing; as Steve walked down the hall to his room, he heard Tony cry, \"<i>Yes!</i>\" and then grunt in pain as he got too enthusiastic.</p>\n<p>When he first moved into the Tower -- really, when he first came out of the ice -- Steve suffered some setbacks in trying to find places he felt at home. He ached, at first, for a real diner, a place he could just get a cup of joe and something fried. All the places he encountered were either cheap, painfully clean burger joints or cheesy \"themed\" diners done up to look like an era that he'd passed in the ice.</p>\n<p>He finally found one, tucked down a side street near the tower, that at least approximated what he wanted. The booths were cracked vinyl, the counters were stained with decades of mug rings, and at a certain time of day it was always filled with old men who would share their newspapers with him as they drank their coffee. He'd spent a lot of time there, at first, a little haven away from the so-modern bustle of Manhattan.</p>\n<p>He'd meant it as a gift to Tony, someplace special to him for their date (how strange to be able to think that, a date with a man, something dark and forbidden in his time). When they arrived, he realized he may have miscalculated, seeing the diner with Tony's eyes: grimy, dilapidated, and smelling faintly of hot grease.</p>\n<p>Then Tony turned to him, beaming, and said \"Time travel, huh?\" and Steve smiled back.</p>\n<p>\"They do a nice chicken and waffles,\" he said, leading him to his usual booth. The waitress, passing with a coffee pot in one hand, set down two faded menus.</p>\n<p>\"Leave the pot,\" Tony said, winking at her, and she smiled and set the coffee down, turning over the two mugs already on the table.</p>\n<p>\"Friend 'a yours?\" she asked Steve. \"I like his style.\"</p>\n<p>\"Fond of it myself,\" Steve said.</p>\n<p>Tony nevertheless seemed nervous, fidgeting with his menu and making, for him, frankly awkward small talk. He seemed relieved when the waitress returned to take their order, and once she was gone Steve reached over and touched his fingers where they were tapping against his mug.</p>\n<p>\"It's only me,\" he said.</p>\n<p>\"<i>Only</i> you,\" Tony repeated sardonically.</p>\n<p>\"You know I don't expect anything from you, don't you?\" Steve asked. \"You don't have to do anything, Tony. Besides, I figured you'd be used to this kind of thing. God knows I'm not.\"</p>\n<p>\"You're not?\"</p>\n<p>\"Nah. Every other date I ever had...\" Steve shook his head, time giving him enough distance to be amused instead of sad. \"Bucky used to set me up. It never went well.\"</p>\n<p>\"Bucky, I remind you of him.\"</p>\n<p>\"Sometimes. Both troublemakers. Braver'n you'd let on. Fast talkers.\" Steve smiled. \"But you're different to him.\" He glanced away. \"Sweeter, I think, a little.\"</p>\n<p>\"I don't remind you of my father?\"</p>\n<p>\"I didn't know your father all that well, really. And he always made me feel...\" Steve shrugged. \"I guess you'd say uncool. Like he knew all the mysteries of the world, and wasn't gonna share them with me.\"</p>\n<p>\"Huh.\"</p>\n<p>Steve tipped his head at Tony, questioningly.</p>\n<p>\"That's how he made me feel too,\" Tony said quietly. \"Oh God, we're talking about my <i>dad</i> on our first date, this is awful.\"</p>\n<p>Steve topped off Tony's coffee. \"Clears the air, I think. I did know him well enough to know he'd be proud of what you've accomplished.\"</p>\n<p>Tony snorted. \"Maybe.\"</p>\n<p>\"He'd get a kick out of Thor.\"</p>\n<p>That drew a laugh. \"Yeah, he probably would. How's he settling in? You talked to him, right?\"</p>\n<p>\"Sure. He thinks JARVIS is the best thing since hammers were invented. When I left he was asking him every question under the sun.\"</p>\n<p>\"We're going to have to work him into the drills,\" Tony said. \"And I'm going to put some more shielding on the armor.\"</p>\n<p>It was easier then, falling into talk of strategy, how the team would shift with Thor back, how they would incorporate him into the dynamic. They talked through dinner and more coffee, through a shared slice of pecan pie. Every time Tony waved a hand -- and he talked with his hands a lot -- Steve felt a mild, sweet pang of attraction. Tony probably saw him looking, but he couldn't make himself care.</p>\n<p>It was late by the time they left, huddling in coats against the chill in the air as they walked back to the Tower. Tony stuck close, shoulder bumping his, curly hair ruffled by the breeze.</p>\n<p>In the elevator, on the way up to the floor they shared anyway, while Steve was contemplating the awkwardness of what was going to happen next, Tony turned to him.</p>\n<p>\"So you wanna come up and see my etchings?\" he asked, grinning.</p>\n<p>\"That line was old when I was young.\"</p>\n<p>\"Sorry, should I have asked if you want to come inside and see me naked?\"</p>\n<p>Steve meant to say no. He didn't want to push Tony, and honestly he could probably use a little time to get used to the idea himself. He meant to be a mature, sober man and say no.</p>\n<p>But surely a kiss goodnight first couldn't hurt, and he didn't want Tony to think he didn't <i>want</i> this. He wanted it a lot.</p>\n<p>So he bent his head without bothering to explain and kissed Tony, tugging him up with a hand at the base of his skull. Tony went eagerly, pressing against him, nipping on his lip to stop him when he pulled back. Steve gave in, tasting too-sweet pie as Tony licked against his tongue.</p>\n<p>The elevator door opened and Steve pulled back, aware he was breathing more heavily than he should be.</p>\n<p>\"Do you want to?\" Tony asked, leaning into Steve's hand, still resting on the back of his head. \"I -- I want to, but maybe I'm not known for always making smart decisions.\"</p>\n<p>\"Maybe smart decisions are overrated,\" Steve said faintly.</p>\n<p>\"Come on,\" Tony said with a grin, grabbing his hand and dragging him down the hall and through the conveniently open door to Tony's room.</p>\n<p>\"I'm not fragile, you know, I won't break,\" he continued, leaning up to kiss Steve again as the door closed. \"It's not like I'm new at this.\"</p>\n<p>\"That makes one of us,\" Steve answered, letting himself be pushed towards the bed. Tony stopped abruptly, mid-shove, and looked at him.</p>\n<p>\"But you must have...\" he said, frowning. \"I know it was war and all...\"</p>\n<p>\"I never...I never worked it out,\" Steve admitted. \"I never figured out how people get to this point. Once I woke up in this time, it just seemed like there were more important things. And eventually you get so far from ordinary you just...\" he shrugged.</p>\n<p>\"So I'm the jailbait and you're still the one getting debauched?\" Tony asked, looking sly. \"Fun.\"</p>\n<p>\"Don't do that,\" Steve said, flushing.</p>\n<p>\"Do what?\"</p>\n<p>\"Make it...tawdry. I don't want that for us.\"</p>\n<p>\"What, you want to <i>make love?</i>\"</p>\n<p>\"Yes,\" Steve said. \"Don't you?\"</p>\n<p>Tony gave him a hard stare. Steve hadn't exactly gone in blind; he knew about Tony's past, and he knew enough to understand that Tony was used to people his own age, from his own time, and people Tony's age were...well, eager to impress. Unsure of themselves, willing to let Tony lead. Steve would do that to an extent, but he wouldn't let Tony lead him into something less than what they could have together.</p>\n<p>\"It's not a game, Tony,\" he continued. \"I care about you. I take this seriously.\"</p>\n<p>\"You think I don't?\"</p>\n<p>\"I think you're afraid to.\"</p>\n<p>Tony stepped forward, chest to chest with him now, head tipped up. \"I'm not afraid.\"</p>\n<p>Steve smiled. \"Well, good.\"</p>\n<p>Tony spent a moment looking startled that Steve had outsmarted him. Steve found himself enjoying Tony's expression a little more than he probably should have.</p>\n<p>He rested a hand on the small of Tony's back, keeping their bodies close together, hooking his thumb in Tony's belt. Tony's hands rose to spread across his stomach, almost defensive, until Steve bent and kissed him. Nothing defensive about the way Tony kissed.</p>\n<p>It was easy to just stand there and kiss, soaking up the warmth of Tony's body, feeling the muscles shift under his hands as Tony stretched a little more, pushed a little further. He liked Tony's mouth, the curve of his lips.</p>\n<p>Tony's hand insinuated itself under Steve's shirt, skirting his ribcage before tucking under his waistband in the back to --</p>\n<p>\"Hey!\" Steve yelped, as Tony grabbed him. Tony just grinned and held on, palm warm against his ass, and Steve considered headbutting him for a second.</p>\n<p>In that second, Tony managed to get his other hand on Steve's fly and was tugging at it, leaning back up to kiss him while his hand worked between them. Steve arched back a little, giving him space to work, and Tony laughed into his mouth as he brought his other hand around to help.</p>\n<p>\"You're a squirmer,\" he said.</p>\n<p>\"I am not,\" Steve argued. \"I'm being <i>helpful</i>.\"</p>\n<p>\"Mmhm,\" Tony answered distractedly, nuzzling into his neck. Steve could feel the button on his jeans and his zip come undone, but then there was a pause; Tony's hands were gripping either side of his fly, just holding his pants up.</p>\n<p>\"Tony?\" he asked carefully, leaning back. Tony was looking up at him with huge, wide eyes.</p>\n<p>\"I may have made an unwise implication,\" he said. Steve frowned. \"I uh. I lied.\"</p>\n<p>\"About what?\" Steve asked.</p>\n<p>\"I haven't actually done this with a dude before.\"</p>\n<p>Steve couldn't help it. He tried to suppress the laughter but it came out as a snort, and then he gave up and wrapped Tony's shoulders in his arms, pulling Tony's head against his chest, laughing some more.</p>\n<p>\"It's not <i>funny</i>,\" Tony said, voice muffled, sounding indignant. Steve stroked his hair and kissed the crown of his head.</p>\n<p>\"Look at you, trying to impress me,\" he said, tipping Tony's chin up. \"My God. Life with you's never going to be dull, at least, is it?\"</p>\n<p>\"Probably not,\" Tony said ruefully. \"Who wants dull, anyway?\"</p>\n<p>\"Good point. Do you, um, want to keep going?\" Steve asked. \"I mean. I suppose we can fumble around uselessly <i>together</i>...\"</p>\n<p>\"I bet I've seen more porn than you have,\" Tony announced, apparently deciding to brazen it out.</p>\n<p>\"That would be difficult, I shared barracks with forty other men,\" Steve said drily.</p>\n<p>\"Not like this, you haven't,\" Tony said, gripping him through his underwear, nimble hand sliding up and down around his prick. The rasp of the fabric made him whine softly, a noise that shocked him. He wasn't certain Tony was aware, either, that even as he shoved Steve's underwear down around his thighs he was rocking against one of them, erection nudging into Steve's leg.</p>\n<p>Steve pulled his own shirt off and then twisted a little to try to get Tony's, but his brain was hazy -- so much touch, all at once, and Tony's hand still stroking him slowly made it hard to think. Tony leaned up close, nuzzling into his bare skin and making it nearly impossible for Steve to get at his clothing. He nipped Steve's shoulder, sharp little teeth leaving momentary red marks on his skin.</p>\n<p>Steve slung an arm around his waist and turned them both, stripping off Tony's shirt before they tumbled onto the bed. Tony wriggled out of his grasp and lunged across him, straddling his stomach. He leaned in very close, hair hanging over his eyes, until their noses were touching, faces both lit dimly by the arc reactor.</p>\n<p>\"I've never given a blow job,\" he said. Steve fought down another laugh.</p>\n<p>\"I've never had one,\" he replied.</p>\n<p>\"Good, then you won't notice if I'm bad at it,\" Tony said.</p>\n<p>\"I don't know, depends how bad you are,\" Steve said, and watch Tony's eyes light up at the challenge.</p>\n<p>Tony kissed his nose, which made him wrinkle it, and then under his chin, down the line of his throat to his pectorals. Steve fought the urge to prop himself up on his elbows and instead contented himself with ruffling Tony's hair, stroking his fingers through the curly strands as Tony worked his way down. He couldn't deny he was...nervous, concerned with making sure this went <i>right</i>, that Tony's skittishness and his own inexperience didn't get anyone hurt.</p>\n<p>Then Tony licked the skin just below his navel and bent his head, sucking Steve into his mouth, and Steve's eyes rolled back. Warm and wet, clutching erratically around him --</p>\n<p>He kept himself from arching up into the slick heat of Tony's mouth, but only just. Tony's teeth lightly grazed his skin, adding a brief counterpoint of pain that made the rest of it feel more intense, more real. Steve drew a deep lungful of air, made himself exhale and loosed his grip on Tony's hair.</p>\n<p>Tony, without Steve's hand keeping him back, ducked his head and tried to go deeper. After a second he choked and sat up, coughing.</p>\n<p>\"Sorry,\" Steve mumbled, still breathing heavily.</p>\n<p>\"Don't be, this is awesome,\" Tony replied, cracking his jaw. \"Good?\" he asked, not quite looking at Steve.</p>\n<p>Steve pushed up on an elbow, kissing him. \"Yeah,\" he said. \"That was...wow, Tony.\"</p>\n<p>\"As a compliment, I'll take it,\" Tony said, shifting back, but Steve caught his arm and reeled him in again, kissing him. Tony went lax against him, sinuous as a snake, and Steve leaned back, pulling Tony on top of him.</p>\n<p>\"Easy, Cap,\" Tony laughed. \"Don't you want me to finish the job?\"</p>\n<p>\"No,\" Steve said. \"I like kissin' you.\"</p>\n<p>Tony rolled his eyes a little, but he lay still enough as they kissed, fingers cradling Steve's head, reactor a cool pressure on his ribcage. Steve drew one leg up, shifting their weight, and their hips bumped together gently. Tony moaned into his mouth.</p>\n<p>\"I like this,\" Tony mumbled, sliding his thigh down Steve's and rutting against him. Steve bucked, planting a hand in the small of Tony's back to give him a little leverage. They ended up thrusting together, Tony's face buried in Steve's throat, Steve's head thrown back so he could gulp more air like he was dying.</p>\n<p>Fine way to go, he thought to himself, and Tony let out a sharp, breathy gasp as he came. Steve realized his fingernails were digging into the top of Tony's ass, hard enough to leave marks. He relaxed his hands, startled.</p>\n<p>Tony surged up, caught Steve's lip between his teeth, and bit down. The shock and pain seemed to zing from his mouth down his body, making his fingers twitch and his hips buck. He came with Tony's mouth on his, Tony's slim body warm against him. Came on Tony, shameless, groaning.</p>\n<p>By the time he settled down a little, Tony had slid off and was lying, sticky, against his side. He had one hand firmly planted on Steve's chest. When Steve glanced at him, Tony leaned in and kissed the side of his pectoral, eyes never leaving his. Steve reached across himself and chucked Tony under the chin.</p>\n<p>\"Good?\"</p>\n<p>\"Good,\" Tony agreed. He let his head fall by Steve's side. \"Can I ask you something?\"</p>\n<p>\"Nnnn,\" Steve answered. \"Don't expect much intelligence, Tony.\"</p>\n<p>He felt the tip of Tony's nose press into his skin. \"Does it bug you because I'm younger than you, specifically, or just because you think I'm a kid in general?\"</p>\n<p>Steve pushed himself up. \"What?\"</p>\n<p>\"Or do you like it, and <i>that</i> bothers you?\" Tony continued. \"Because if that's a kink, I mean, I can put on the knee socks and the school uniform -- \"</p>\n<p>\"No!\" Steve said, startled. \"Tony, why would you think that?\"</p>\n<p>Tony pushed himself up on an elbow. \"I just want to know. I mean, is it because there's an age difference? Or because I look young?\"</p>\n<p>Steve tugged on Tony's arm gently, pulling him up against his side again.</p>\n<p>\"What bothered me wasn't that you look young,\" he said gently, \"but that you are young. I don't want to take advantage of you, Tony. Or hurt you. Even if you were my age -- if you were older than me -- I'm still...enhanced. I'd still worry about hurting you physically.\"</p>\n<p>\"I can go put the armor on,\" Tony offered, smiling, and Steve laughed.</p>\n<p>\"No, not this time anyhow,\" he said.</p>\n<p>\"The armor gets you hot, huh?\"</p>\n<p>\"It's beautiful, that's all,\" Steve said. He stroked Tony's hair. \"Right now, I'd like to just be still for a little while and enjoy this. I don't usually get much of that, you know.\"</p>\n<p>\"Can we clean up, first?\" Tony asked, and Steve released him. Tony rolled off the bed. \"How much do you like this shirt?\"</p>\n<p>Steve glanced over and waved his hand. \"Not that much.\"</p>\n<p>\"Good, 'cause mine's vintage,\" Tony replied, grinning as he cleaned them off enough to avoid discomfort. He tumbled back onto the bed and against Steve, but not before Steve caught a wince, and felt his fingers brush against Tony's shoulders, where the bandages over his wounds were. He pulled Tony over gently so that he was lying half-on-Steve, back off the blankets.</p>\n<p>\"Like this,\" he said, tucking Tony's head under his chin and getting one hand into Tony's hair.</p>\n<p>\"You should be aware I'm a fidgeter,\" Tony said, but he yawned, too.</p>\n<p>\"I may have noticed,\" Steve answered, kissing Tony's forehead. \"It's okay. I only want a minute.\"</p>\n<p>\"Mmhm,\" Tony agreed. Steve lay there, feeling the gentle pressure of Tony's arc reactor against his side, Tony's hair sifting under his fingers.</p>\n<p>\"You want to go see a movie tomorrow?\" he asked quietly.</p>\n<p>Tony didn't reply, but he exhaled in a gentle snore against him. Steve smiled and relaxed, closing his eyes.</p>\n<p>\"So, Captain,\" the interviewer said, even though Steve had asked to be called Steve. \"You're turning thirty this year.\"</p>\n<p>\"Or ninety, depending,\" he joked. \"Yes. July fourth, I'll be thirty.\"</p>\n<p>\"Any thoughts about settling down?\" she asked.</p>\n<p>\"Well, I suppose that depends on how you mean 'settling down',\" he replied. \"I have no plans to leave the Avengers, certainly.\"</p>\n<p>\"Despite the fact that you have been a member of the team for nearly half a decade?\"</p>\n<p>\"Well, I've dedicated my life to public service. Folks sign on to six years with the military pretty regularly.\"</p>\n<p>\"What about a family?\" she asked.</p>\n<p>\"I think as Avengers, we consider each other family,\" he said truthfully. \"And we have a certain duty to the team. I could leave, if I wanted, but I like the work. I like serving the people.\"</p>\n<p>\"So there's no special woman for Captain America?\" she asked coyly.</p>\n<p>Steve inhaled. He'd prepared for this; he'd worked out what he'd say in any situation, how he'd bring the topic around.</p>\n<p>\"I'm afraid I am taken,\" he said, keeping his voice steady.</p>\n<p>***</p>\n<p>In the green room, before the televised interview, Tony had straightened his tie and patted his chest, hiking himself up on tip-toe to kiss him.</p>\n<p>\"It'll be great,\" he said. \"You sure this is how you want to do it?\"</p>\n<p>\"Yeah,\" Steve replied, though he was scared and uncertain. He'd been firm, for the last few months: he was older, he was more secure in his position, he had less of a reputation than Tony and Tony would already have to go through this with the board of directors. It should be him to do it in the public arena.</p>\n<p>\"You don't have to,\" Tony said, eyes searching his face. \"We can do it together. I've said we should.\"</p>\n<p>\"No, this is better. I want to protect you.\"</p>\n<p>\"I don't need your protection, Steve, I'm a grown man.\"</p>\n<p>\"But I want to,\" Steve had said. \"This isn't a battlefield, Tony. Let me take this hit for you. Please.\"</p>\n<p>\"I'm not sure I like that.\"</p>\n<p>Steve caught Tony's chin, thumb brushing the ridiculous little soul patch Tony was trying to grow to look more adult.</p>\n<p>\"You are going to get enough fire from the board,\" he said.</p>\n<p>\"Fuck the board.\"</p>\n<p>\"You can't afford that. We agreed to wait until you inherited the company and had a firm grip on it, but I did not agree to put you through the wringer of public opinion. You handle the board. I'll handle the media. In a couple of days the whole thing will blow over,\" Steve had said. He bent and kissed Tony a second time. \"Wish me luck.\"</p>\n<p>\"Good luck,\" Tony said softly.</p>\n<p>***</p>\n<p>\"Who's the lucky woman?\" the interviewer asked, clearly preparing to smile and tease him about whoever it was.</p>\n<p>\"I prefer to think of myself as lucky,\" Steve said. \"He's a very good man, and I feel fortunate to have been in his life for the past few years.\"</p>\n<p>The smile dropped off the interviewer's face for the briefest of seconds before she rallied. \"You're romantically involved with a man?\" she asked, sounding a little careful.</p>\n<p>\"Tony and I have been together just about four years now,\" he said.</p>\n<p>\"Captain, I have to ask, are you coming out on national television right now?\" the interviewer said.</p>\n<p>\"Yes,\" Steve replied calmly.</p>\n<p>\"You are in a sexual relationship with a man?\"</p>\n<p>\"I wouldn't quantify it as sexual,\" Steve said. \"Though that's an aspect of it. I'd call it love. After four years of each other, I can't otherwise explain why we're still together.\"</p>\n<p>\"Are we speaking of Tony Stark?\" she asked.</p>\n<p>Steve allowed himself a fond smile. \"Yes. We started stepping out when he was just shy of nineteen.\"</p>\n<p>\"You're a good deal older than Mr. Stark.\"</p>\n<p>\"Eight years,\" he agreed.</p>\n<p>\"How do you think the country will respond to Captain America in a gay relationship with a man so much younger than himself?\"</p>\n<p>\"Well, I love my country, but I don't believe they get a say in who I go out with,\" Steve said. \"I'd hope people would be happy I found someone who brings me joy.\"</p>\n<p>\"What do you say to the people who will say you have a moral obligation to be a role model to the youth of the country?\"</p>\n<p>Steve cocked his head. \"Are you saying that, ma'am?\"</p>\n<p>\"No, but surely you anticipate it happening.\"</p>\n<p>\"Not really. I don't see that I'm less a role model than I was twenty minutes ago. I've been seeing him for four years.\"</p>\n<p>\"Yet you hid that fact from the public.\"</p>\n<p>\"It isn't actually the public's business who my sweetheart is.\"</p>\n<p>\"You are a public figure, however.\"</p>\n<p>\"In love with someone who treats me kindly, who understands my work and shares in it, and who is dedicated to public service, as I am,\" Steve said. \"I really don't see how I could have chosen better than Tony Stark, or how I could be a better role model without him than I am with him.\"</p>\n<p>\"Even with his history of public scandal?\"</p>\n<p>\"Especially so,\" Steve said, smiling. \"Tony knows exactly what he ain't missing when he's with me, ma'am.\"</p>\n<p>***</p>\n<p>\"No no,\" Tony had said, weeping with laughter, on their one-year anniversary. \"You don't understand.\"</p>\n<p>\"What don't I understand?\" Steve asked, honestly confused. \"It's a nice song.\"</p>\n<p>\"It's -- it's very romantic, the sentiment,\" Tony had agreed. \"It's just, that song in particular, it's like...you know how we talked about in-jokes? Memes?\"</p>\n<p>Steve nodded. They'd had them in the Army, of course, like Kilroy Was Here and FUBAR. And he sort of understood most of them. The cat meme was quite funny.</p>\n<p>\"Well, there was this meme, I don't know how it started, but you'd say you were linking someone to a cool website, or a news article, and instead you'd link them to that.\"</p>\n<p>\"But why?\" Steve asked. \"Wait, no -- do you do it to people you love?\"</p>\n<p>\"Well, yes, but not to show them you love them,\" Tony said. \"It's a prank.\"</p>\n<p>\"Oh.\" Steve knew his face had fallen. \"I didn't mean -- \"</p>\n<p>\"But that's why it's so funny! You took it <em>so seriously</em>,\" Tony had said, grinning again. \"I think it's nice. You wanted to sing me a nice song. And you know, I have to say, at least our life together is never boring.\"</p>\n<p>They'd been slow-dancing in the penthouse of Stark Tower, no actual music required, and Steve had just hummed a few bars of what he'd <em>thought</em> was a nice romantic song, before singing under his breath.</p>\n<p>\n<em>Never gonna give you up,</em><br>\n<em>Never gonna let you down...</em>\n</p>\n<p>It was funny, later, after Tony had soothed his ruffled feelings and assured him he knew Steve loved him very much, and Steve had stopped sulking about how awful the twenty-first century could be.</p>\n<p>\n<a href=\"https://ironfries.tumblr.com/post/77451884564/more-fanart-of-teentony-from-hard-rock-swing-or\" rel=\"nofollow\">\n<img src=\"https://25.media.tumblr.com/81700f9a4bc294b80cfdba866e13c782/tumblr_n1dt5lItPi1qd557ro1_500.png\" alt></a>\n</p>\n<p>\n<a href=\"https://copperbadge.tumblr.com/post/77451945712/ironfries-more-fanart-of-teentony-from-hard\" rel=\"nofollow\">Original Artwork Post</a>\n</p>\n<p>***</p>\n<p>\"You were awesome,\" Tony said, when Steve came off the air and back into the green room. \"I watched the whole thing. You were perfect.\"</p>\n<p>\"Easy to do,\" Steve said, dropping onto a sofa, knowing Tony would follow him down, either at his side or in his lap. After four years together, Tony liked to say Steve had trained him; Steve preferred to think they simply knew each others' habits. Tony settled next to him, shoving under his arm and turning into his shoulder.</p>\n<p>\"Not that easy,\" Tony said, picking up one of Steve's hands, shaking from the adrenaline aftershock. He rubbed it with the callused pads of his fingers, smoothing out the tense muscles in the heel of his palm, the meat of his thumb. \"You want to go out? We could go out. Get dinner, <em>be seen</em>.\"</p>\n<p>\"No,\" Steve said. \"I don't care about that. I want to go home.\"</p>\n<p>\"Okay. Happy's got the car, lemme text him,\" Tony said, taking his phone out with one hand, continuing to rub at Steve's palm with the other. He texted Happy for a pickup, then gathered up the messenger bag where he kept the portable version of the armor and slung it over his head, tugging on Steve's arm to get him standing again. Steve followed him obediently through the maze of the studio backstage, out a door that he was sure wasn't the one they'd come in through, and into the alley where the town car was waiting. Once they were settled in the back seat, Tony once more tucked under Steve's arm, Tony took out his phone and began reading the news.</p>\n<p>\"It was a good idea to do it live,\" he said thoughtfully, scrolling through. \"The internet's lighting up, but nobody's dissecting yet; they gotta get it up on streaming before they can take it to pieces. The Board of Directors is probably going to fall apart -- \"</p>\n<p>\"Is this hurting SI?\" Steve asked, worried.</p>\n<p>\"No, them falling apart is a good thing, means Pepper can take the reins and lead their reaction,\" Tony said. \"Anyway, the way the company's set up now, they can get rid of Pepper or they can get rid of me but they can't replace both of us at once.\"</p>\n<p>\"But -- \"</p>\n<p>\"Steve. We <em>agreed</em>. We agreed you were going to do this and I would handle SI, so stop worrying.\" Tony smiled up at him, fond and a little indulgent of Steve's propensity to fret. \"I'm filthy rich. Even if I lost SI, we'd survive.\"</p>\n<p>\"It's not about the money,\" Steve said. \"You know that.\"</p>\n<p>\"Yes, I know you'd be happy in a cold water flat with one of those humorous fold-up beds and mice running over our toes as long as I was there,\" Tony sing-songed. \"But I prefer to keep you in the style to which you've become accustomed. Which reminds me,\" he added, as they pulled into the underground garage at Stark Tower. \"I got you a present.\"</p>\n<p>\"Did I miss an anniversary?\" Steve asked with a smile. Tony liked presents; Steve thought he probably liked giving them to other people more than he liked getting them, because Tony had all the stuff he could ever need and Howard, bless and damn him in equal measure, had installed in Tony a deep insecurity about whether anyone liked him. Ever.</p>\n<p>\"No, I just saw this on a streetcorner and thought you'd like it,\" Tony said, as the elevator let them out onto the floor they shared -- Steve still technically had his own apartment, but nearly all his things were here. Tony was here.</p>\n<p>\"A streetcorner?\" Steve asked. Tony led him into the bedroom, tumbling back on the bed with a huff of satisfaction and then propping himself up to dig under the covers. \"Look, we've talked about, um, toys, and you know I'm ah. Behind that, but streetcorners, Tony -- \"</p>\n<p>Tony looked up at him and laughed. \"Well, it is a toy, but not the kind you're thinking of, you filthy old man.\"</p>\n<p>\"Hey!\"</p>\n<p>\"Here,\" Tony said, and pulled an object out from under the pillows. It took Steve a moment to work out what it was.</p>\n<p>\"Is that a Captain America doll?\" he asked.</p>\n<p>\"It's a <em>plush</em>,\" Tony said, with exaggerated dignity. The little toy had red gloves and boots but no hands or feet, which was a little unsettling; its giant round head had an A embroidered on the blue cowl, and huge blue felt eyes. Tony's eyes, equally huge, peered over the top of the head, between the felt wings of the cowl.</p>\n<p>Steve, veteran of a world war, puncher of aliens, super-soldier, two hundred and fifty pounds of muscle in a six-foot-six frame, felt himself melt from the inside out.</p>\n<p>\"It's <em>so cute</em>,\" he rumbled, surging forward to pin Tony down and kiss his forehead. Tony let out a yelp and struggled, flailing. But not flailing too hard, Steve noticed, and mainly trying to keep his grip on the toy.</p>\n<p>\"Never gonna give you up,\" Steve bawled out, laughing, and Tony curled up into a ball, tears of mirth streaming down his face.</p>\n<p>\"Ugh, stop!\" Tony cried, as Steve kissed his cheek, more or less attacking him.</p>\n<p>\"Never gonna let you down,\" Steve continued, off-key, wrestling Tony around until Tony finally uncurled. \"Never gonna ruuuuuuun arouuuuuuund -- ahaha! Ha! Uncle!\" he cried, as Tony climbed on top of him, still clutching the toy to his chest, and sat on his belly. When Steve reached for it, Tony held it out of his grasp.</p>\n<p>\"I thought it was for me,\" Steve said with a grin. He flexed, and Tony caught his balance with a hand on Steve's chest.</p>\n<p>\"I don't think you're old enough for it, you immature weirdo,\" Tony replied. Steve reached up and tugged on one arm, and Tony flopped onto the bed next to him, allowing Steve to pull him close.</p>\n<p>\"That was very sweet, and it's a lovely doll,\" he said sincerely.</p>\n<p>\"Plush,\" Tony muttered into his shoulder.</p>\n<p>\"Plush,\" Steve corrected. He ruffled Tony's hair.</p>\n<p>\"Next few weeks won't be easy,\" Tony said.</p>\n<p>\"Us against the world, Tony.\" Steve sighed. \"At least it's us together against it.\"</p>\n<p>Tony grunted and threw an arm around Steve's chest, tucking the little Captain America between them. \"Promise you won't leave me when I get old and ugly.\"</p>\n<p>\"Too late,\" Steve said, and Tony thumped his arm. \"I promise. It's never been about how you look. Though...\" he lifted his hand and rubbed Tony's chin. \"The scruff needs a little shaping.\"</p>\n<p>\"How would you know, Captain Clean-Shaven?\"</p>\n<p>\"Been shaving longer than you have, punk,\" Steve said, kissing his forehead. \"I love you, kid, you know that, right?\"</p>\n<p>\"Love you too, old man,\" Tony replied. He yawned and nosed at Steve's shoulder. \"Stress nap, then lunch, yeah?\"</p>\n<p>\"Sure,\" Steve replied, closing his eyes and settling in. \"Let the world explode without us for a few hours.\"</p>\n<p align=\"center\">\n<a href=\"https://ironfries.tumblr.com/post/75940769397/this-is-fanart-of-the-fanfic-hard-rock-swing-by\" rel=\"nofollow\">\n<img src=\"https://40.media.tumblr.com/8de492c2c4065e114c483c3e727ca7c8/tumblr_n0ng43RQYx1qd557ro2_500.png\" alt align=\"middle\"></a>\n</p>\n<p>\n<a href=\"https://ironfries.tumblr.com/post/75940769397/this-is-fanart-of-the-fanfic-hard-rock-swing-by\" rel=\"nofollow\"></a>\n<img src=\"https://25.media.tumblr.com/136770dbd91c4a7239997b048f2bf031/tumblr_n0ng43RQYx1qd557ro1_500.png\" alt><img src=\"https://41.media.tumblr.com/f88126a543df1ec8eb1d45d08cea8f0c/tumblr_n0ng43RQYx1qd557ro3_500.png\" alt><img src=\"https://40.media.tumblr.com/6cb25e45104ef902f722488fe6dc6d18/tumblr_n0ng43RQYx1qd557ro4_r1_500.png\" alt></p>\n<p>\n<a href=\"https://ironfries.tumblr.com/post/75940769397/this-is-fanart-of-the-fanfic-hard-rock-swing-by\" rel=\"nofollow\">Original Artwork Post</a>\n</p>"
}