{
  "id": "837918",
  "url": "https://archiveofourown.org/works/837918?view_full_work=true",
  "author": [
    "nekosmuse"
  ],
  "title": "The Borderland State",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Hannibal (TV)"
  ],
  "relationships": [
    "Will Graham/Hannibal Lecter"
  ],
  "characters": [
    "Will Graham",
    "Hannibal Lecter",
    "Abigail Hobbs",
    "Jack Crawford",
    "Alana Bloom",
    "Bedelia Du Maurier",
    "Beverly Katz",
    "Brian Zeller",
    "Jimmy Price"
  ],
  "additional_tags": [
    "Additional Warnings Apply",
    "Canon Compliant",
    "Dark",
    "Stalking",
    "Obsessive Behaviour",
    "Stockholm Syndrome",
    "Gaslighting",
    "Psychological Horror",
    "Emotional/Psychological Abuse",
    "Mental Breakdown",
    "Dubious Consent",
    "Ensemble Cast",
    "Murder Family",
    "POV Multiple"
  ],
  "language": "English",
  "series": "",
  "published": "2013-06-10",
  "completed": "2013-06-29",
  "words": "42,721",
  "chapters": "12/12",
  "comments": "688",
  "kudos": "11,233",
  "bookmarks": "2,648",
  "hits": "249,743",
  "summary": "<p>Three years after Hannibal's arrest, Will Graham stands on the front porch of his Georgian seaside home and watches twin headlights navigate the winding stretch of his lane. There is only one reason Jack Crawford would travel all this way, in the rain: Hannibal Lecter has escaped from prison, and no one knows where he is.</p>\n<p>Written for the Hannibal Kink Meme prompt: <i>Will figured out Hannibal was the Chesapeake ripper, resulting Hannibal's imprisonment and a complete breakdown for Will. A few years later, Hannibal escapes from prison. Despite the risk, the first thing he does is go after his Mongoose. Give me obsessive, possessive, creepy as hell Hannibal who still wants Will for his own.</i></p>",
  "notes": "<p>This is based off television canon (S1). Numerous warnings apply, including: cannibalism, mental illness, psychological abuse, gaslighting, potential dub-con, Stockholm syndrome, violence, mild gore, obsessive/possessive behaviour, vomiting, and past unrealized Will/Alana. Basically, if the show triggers you, this will trigger you.</p>\n<p>Couple of warnings for this chapter: implied Stockholm syndrome, psychological abuse. Pretty much if it's canon, it's here.</p>",
  "text": "<p></p>\n<p>\n<i>The Borderland State: A term used to describe Hypnagogia, the state between wakefulness and sleep, when visual and auditory hallucinations can occur.</i>\n</p>\n<p>This isn't Wolf Trap. There are no mist-shrouded fields outside his house. He no longer walks in the dead of night, taking comfort in the sight of his little house floating on a sea of fog. Wolf Trap rests somewhere behind him, a faded point along the narrow path of his history. He barely remembers it.</p>\n<p>This is delta country, sandy shores and marshy ground where the Savannah empties into the sea. In the winter the wind is biting and cold, and in the summer it rains endlessly. Mist still rises off the river, but it feels different here, oppressive in a way that reminds him of endless childhood. If he walks at all, it is down to the wooden dock stretching out over the river, tiny row boat tied to its end. He takes the boat out sometimes, feels his muscles strain against the drag of the water's weight. Other times he'll sit and listen, the night alive with sound like it wasn't in Virginia.</p>\n<p>Mostly he stays indoors.</p>\n<p>He doesn't own a television, or a radio for that matter. Sometimes, when he goes into town to pick up supplies he'll grab a newspaper, browse its headlines. More often than not the paper ends in the fireplace, unread. It's easier to shut himself away and not think about the things people are capable of: easier because it means not having to confront the things he's capable of.</p>\n<p>Besides, that life is about as far away as Wolf Trap. It no longer defines him.</p>\n<p>He's not sure if this life defines him either--most days he can barely convince himself this isn't some elaborate dream. But here when he feels the flush of sweat upon his skin it is weather driven and not born of nightmares. Here when he breathes humid August air it doesn't stick in his throat and threaten to suffocate him. Here there are no elaborate puzzles; no trails of body parts leading to the one place he would have rather they hadn't led.</p>\n<p>Here his dreams are fleeting and scarce, his mind blissfully silent for the first time in what feels like an eternity.</p>\n<p>There's a breeze coming in off the water. It carries with it the scent of brine, something he still associates with his childhood. It's no longer enough to displace him, but he feels a momentary tug for something he can't bring himself to name. Instead he watches his curtains flutter in the window. They billow out across the table, knocking aside some of his fishing tackle, then fall back against the screen, perfectly still.</p>\n<p>There's a storm brewing.</p>\n<p>He can feel it in the air, the heavy press of tension that comes before a downpour. Slowly, Will eases himself from his chair, his leg stiffening beneath him. He rubs absently at the mess of scar-tissue that cuts across his thigh, muscles screaming their protest. It is a long while before the pain recedes; longer still before he can put his weight down on the leg.</p>\n<p>The sky has already opened, drizzle coming in through the screen to dampen his table. He half-walks, half-hobbles to the window and pulls it shut. Outside, against an ever darkening horizon, twin spots of light navigate the long, meandering path of his laneway. Will watches the vehicle's approach, stomach twisting into knots.</p>\n<p>Hearing the approaching engine, the dogs begin to gather at his feet, ears stiff with interest. Will settles them with a raised hand, then crosses to the door where his shotgun sits, propped against its frame. He tucks it into the crook of his elbow and then heads outside.</p>\n<p>He doesn't move beyond the porch, the rain coming down in sheets now. The wind's picked up again, sending it sideways so that even protected he's getting wet. Not as wet as Jack, who's busy climbing out the passenger side of the SUV, unprotected from the downpour.</p>\n<p>\"The answer's no,\" he calls over the din of the rain. Jack doesn't answer. He jogs the short distance from the car--still running, headlights highlighting the falling rain--to the porch. It's too dark to see who's driving.</p>\n<p>\"Inside,\" Jack says when he reaches Will's side, though it's more of a barked command. Will's tempted to refuse him, but the rain is still falling and he's standing on his porch in his underwear.</p>\n<p>Will brings them inside.</p>\n<p>He makes sure to slam the door shut behind them, anger a low coil of heat in his gut. The anger is easier to manage than the fear, so Will clings to it, feeding it his irritation until he's clenching his jaw and balling his hands into tight fists. His words, when he speaks, come out like venom.</p>\n<p>\"I said no, Jack. And this is the third time you've come out to ask. I'm not going to change my mind.\"</p>\n<p>Jack takes a minute to shake off excess water. He's soaked through with it, the ends of his coat dripping onto the floor. Will hazards a brief glance to his features; takes in the dark circles beneath his eyes before focusing his gaze somewhere in the vicinity of Jack's chest.</p>\n<p>\"I need you to sit down,\" Jack says as he strips off the coat. He hangs it over the back of one of Will's chairs. It continues to drip. Indignation flares hot in Will's chest. He's still holding the shot gun. He sets it down by the door.</p>\n<p>\"We've been over this. I can't do it anymore, Jack. Not this case, not the next case, not the case after that. Or were the six months I spent in Spring Grove not enough for you?\"</p>\n<p>It's the first time either of them have mentioned Will's stint in the psychiatric hospital. Jack visibly flinches. Will runs a shaking hand through his hair, his breath coming in laboured pants. It's been a long time since he had a panic attack. Jack's last visit, if he's not mistaken.</p>\n<p>When he speaks again it's through gritted teeth.</p>\n<p>\"I can't do it, Jack. Find someone else.\"</p>\n<p>He collapses rather than sits in the old recliner by the fireplace, its fabric worn almost bare. One of his dogs sticks his head in Will's lap. Will sets his hand atop Wilson's head and strokes the soft fur of his ears. The fuzzy edges of his vision begin to clear.</p>\n<p>Jack, who hasn't said anything else, drags one of the kitchen chairs into the living room. He sets it before Will's chair, straddling it so that they sit face to face. Embarrassment seeps into Will's cheeks, staining them red. He ducks his head.</p>\n<p>\"Sorry, I...\"</p>\n<p>\"It's fine,\" Jack says. Will nods. \"I'm not here about a case.\"</p>\n<p>There's something in the way that Jack says it that makes Will glance up. He looks this time, really looks, seeing past the usual dark circles and exhausted lines that come with a case. This is worse, far worse. The last time Will saw Jack looking like this his wife was dying.</p>\n<p>He looks terrified.</p>\n<p>\"What happened?\" Will asks in spite of himself. He's terrified of the answer. After his extended hospital stay, he pocketed his pension and left without a backwards glance. He has no idea what became of those--his colleagues, his associates, his friends--he left behind.</p>\n<p>Jack, when he answers, speaks slowly, his words clear and precise. It doesn't make it any easier for Will to understand. He feels like he's hearing it from the end of a very long tunnel, the words tinny and distant, hollow in a way that lacks true meaning.</p>\n<p>\"Sorry, what?\" Will says when Jack has finished speaking. His words are still ringing in Will's ears, Will scrambling to grasp their meaning.</p>\n<p>Jack clears his throat and repeats them.</p>\n<p>\"Yesterday morning, at 8:15 Eastern Standard Time, there was a power failure at the Baltimore State Hospital for the Criminally Insane. Several systems were compromised, including the lockdown system. Several inmates escaped from their cells and staged a riot. During the riot, Hannibal Lecter disappeared from his cell. We don't know where he is.\"</p>\n<p>~*~</p>\n<p>She's long since muted the television, but Hannibal's image is still splayed across the screen. Bedelia glances at it occasionally, feels the cold press of paralytic fear creeping up her spine every time she does. She finishes what's left of her wine in a long swallow; refills the glass.</p>\n<p>They called her immediately of course; offered to have someone stay with her until Hannibal was caught. They won't catch him, not a second time. The only reason they caught him the first time was because he couldn't bring himself to kill Will Graham. She didn't tell them that. Instead she accepted the car parked out front--not that two officers could stop Hannibal if he was determined to come. She knows why he might. The officers outside--and the FBI for that matter--don't. She hasn't told them everything. She still believes in doctor-patient confidentiality.</p>\n<p>The second glass of wine goes down smoother, the alcohol settling nicely in her stomach, infusing her blood with artificial warmth. Between the wine and the Valium she thinks she might be able to sleep. The television, still flipping through images of Hannibal's crimes, says otherwise. Bedelia sets her empty glass down on the counter. She leaves the television on.</p>\n<p>She's halfway up the stairs before she thinks better of it. She knows the danger of obsession; knows she could spend her entire life constantly looking over her shoulder, waiting for something that might not come. She knows, too, that that isn't a life. Hannibal will come or he won't, and if he does he'll either kill her or he won't. It is out of her hands now, and for as much as she wants to live--as much as she wants this whole mess behind her--she knows better than to think she has any control here.</p>\n<p>She pads back down the stairs on silent, slipper-clad feet. When she reaches the television she finds Graham's image displayed across the screen. Bedelia reaches for the remote.</p>\n<p>The kitchen falls into darkness.</p>\n<p>There's no relief in having made the decision, however decisive. She's still tense, mind on edge as she turns to leave the room. She doesn't make it very far, a single step before a shadowed figure fills the kitchen door. Hannibal is back-lit by the light in the hall, so she can't make out his features, but it is undeniably him.</p>\n<p>She wishes she was surprised.</p>\n<p>She wishes, too, she'd had more wine. Two glasses were clearly not enough.</p>\n<p>\"Hello, Hannibal,\" she says, outwardly calm, though her heart is lodged in her throat and her pulse is racing. Hannibal, she suspects, sees past her veneer. He was always very good at that. She, apparently, is not.</p>\n<p>\"Bedelia,\" he says, casual, like there isn't a squad car parked outside, like he's not the subject of an intense manhunt. Bedelia wonders if the officers out front are even still alive. She can't picture him sneaking in through the back.</p>\n<p>He takes another step into the kitchen, Bedelia starting to feel a little penned in. She positions herself so that there is an island between them, the knife drawer within reach. Hannibal appears unconcerned with her posturing. If anything, he seems a little amused.</p>\n<p>She can see him now, faintly in the dim light. If the reports are right, it's been a little over thirty-six hours and yet somehow in that time he's managed to find a three-piece suit. He's lost weight, enough so that it no longer fits him as well as it once did, the pants hanging from his hips, the jacket loose in the shoulders. His hair is slicked back, longer than he normally wears it, and he's freshly shaven. The only outward signs of his incarceration are the prominence of his cheekbones and the sallow tint of his skin.</p>\n<p>\"Are you here to kill me?\" she asks. She doesn't think there's much point in formalities, not now.</p>\n<p>A look of distaste crosses Hannibal's features. He schools them just as fast.</p>\n<p>He steps further into her kitchen, running a hand along her counter. He glances briefly to the television set. She tells herself she's imagining the clenching of his jaw. He does a full circuit before finally coming to stand on the other side of the island. He leans across it, perfectly at home. She forgot how imposing a man he was. How much he looms.</p>\n<p>\"If I wanted to kill you, do you really think I'd choose the kitchen?\" He tilts his head as he says it, studying her, as though she's an insect; he a spider and this his web. She has to remind herself that he, above all things, respects her. Enough to show her the cracks in his facade. She sees them even now.</p>\n<p>\"Then what do you want, Hannibal?\" she asks. She shivers as she says it, remembering then the feel of a patient's hands around her neck. She doesn't want to fear Hannibal, but she does. She supposes that is the point.</p>\n<p>Hannibal scans her face. \"I think you know,\" he eventually says.</p>\n<p>\"I don't know where Will Graham is. I'm sorry,\" she says.</p>\n<p>The change in his expression is minute, fleeting, but she catches it all the same. She knows immediately he has changed his mind, that he will kill her now that he no longer has a use for her. She doesn't back down, instead straightening her shoulders, stepping forward so that she is flush against the counter. Hannibal shakes his head.</p>\n<p>\"That is... unfortunate,\" he says, and then, to her complete and utter surprise, turns on his heel and leaves the room.</p>\n<p>She spends a long minute rooted where she is, staring at the doorway and the hall beyond, waiting for him to come back. When he doesn't, her knees buckle, the only thing keeping her from crumpling to the floor the counter. Another minute passes before she is capable of crossing to the phone. She dials Jack Crawford's number; gets his voice mail.</p>\n<p>\"He was here,\" is all she says, and then hangs up. Pours herself another glass of wine.</p>\n<p>Reality is a social construct, or so say Berger and Luckmann. Will's studied the theory, generally tends to agree with it. The problem of course is accounting for people like him. The outliers.</p>\n<p>He spends the vast majority of his time alone or in the company of his dogs. He's not a part of society, hasn't been for a very long time--and even when he was, he wasn't, not really. His reality is drastically different from that of the general population. From Jack's. His reality doesn't differentiate between waking states and dream states. He has no way of knowing if Jack's really here; if this isn't some manifestation of his over-active imagination.</p>\n<p>The only person who came close to understanding that was Hannibal, but then, Hannibal is an outlier too.</p>\n<p>\"Sorry,\" he says, still struggling to process this new information. He's having a hard enough time dealing with having someone else in the house--he's grown used to moving through its empty spaces without encountering additional matter. He's woefully under-prepared for a conversation, real or imagined.</p>\n<p>\"Are you saying Hannibal escaped?\"</p>\n<p>He's spent the years since Hannibal's conviction trying desperately to forget the man. An impossible task, but one he hoped might get easier with time. Hearing his name now--saying it out loud--brings everything back. Time stutters to a standstill, his existence now measured in the ragged harshness of his breath and the obnoxious pounding of his heart. His ears are ringing, though after a moment he realizes the sound is coming from Jack's pocket. When Jack makes no move to answer a call, Will adds a mental tick to the hallucinating column.</p>\n<p>\"You can understand why I came to see you,\" Jack says. He's watching Will like he's afraid Will's going to come apart at the seams. The scrutiny is unnerving. It leaves Will feeling a bit like a bug caught under a microscope.</p>\n<p>The ringing abruptly stops.</p>\n<p>He's not exactly sure what he's supposed to say here--has never been very good at that--and the room is starting to close in around him, so he opts for bowing out of the conversation, eyes falling close, head tipping forward so that his chin comes to rest on his chest. He rubs absently at the scar tissue on his leg, skin sensitive along his stitch-line. He can still feel the heat of Hannibal's blade, remembered pain searing through the limb. Sticky warmth spills from the wound, his hands not enough to contain it. It falls to pool on the already wet floor. Hannibal hasn't hit the femoral artery, and not by accident. Killing Will was never his intention.</p>\n<p>\"You want me to help catch him, again,\" Will says, opening his eyes, his leg whole. He shakes his head, bile rising to the back of his throat. It was bad enough the first time, years inside the Ripper's head destroying everything he was when he found him behind a familiar pair of eyes. He can't go through that again, not now; not knowing what he knows now.</p>\n<p>\"No, I won't ask that of you,\" Jack says. Will doesn't miss his hesitation. \"But we are worried he might come after you.\"</p>\n<p>Will's shaking his head even before the words leave Jack's mouth. He brings a trembling hand to his forehead; pushes aside his hair, damp with sweat. Hysterical laughter builds in his chest. He swallows it down, features twisting into a grimace.</p>\n<p>\"No,\" he says. He gestures helplessly in Jack's direction. \"He doesn't want to kill me. If he did, I'd already be dead. I'm the only one who understands him, who sees him as something other than a monster and he needs that. He won't come after me until he's certain he can persuade me to his side.\"</p>\n<p>Will doesn't bother mentioning how close he came the last time. How often he's thought about it since.</p>\n<p>\"He'll go looking for Abigail. She abandoned... him,\" he almost said us, \"but she didn't reject him. He wants...\"</p>\n<p>The truth is he doesn't know what Hannibal wants, not anymore. He thought he knew, back when Hannibal was Hannibal and the Ripper was the Ripper. Now that they're one in the same, he doesn't know where to begin. He has no idea how much of what's in his head is him, and how much of it is Hannibal.</p>\n<p>Jack's watching him again, the weight of his eyes awkward, uncomfortable. Will glances up; immediately regrets it.</p>\n<p>\"She's not dead, Jack,\" he says, shaking his head. \"How many times do I have to... We didn't find a body.\"</p>\n<p>The excuse sounds flimsy, even to his own ears.</p>\n<p>\"We didn't find Miriam's body either,\" Jack says, softly. Will shakes his head, somewhat violently.</p>\n<p>This entire conversation is making him tense, antsy in a way that makes sitting impossible. He brushes aside anything else Jack might say, rising from his chair to cross to the window. It's still raining outside, though the torrent has turned into a steady drizzle, the ground thoroughly soaked. The SUV is still parked outside, but its engine is cut and the lights are off. Will turns back to Jack; finds him turned around so that they're once again face to face. Will forces himself to look Jack in the eye.</p>\n<p>\"He wouldn't have killed her, Jack. Not her. And she's clever. If she wanted to disappear, it would have been easy for her. But he will try to find her.\"</p>\n<p>Jack looks like he wants to argue, a repeat of every argument they've ever had. His gaze is filled with worry, the same concerned expression he wore when Will's world was crumbling down around him. It's too much, Will averting his eyes. His gaze falls to the floor, to where a growing puddle is forming beneath Jack's jacket. In the low light, highlighted by shadow, the water looks vaguely like blood. </p>\n<p>\"Look, Will, I know...\" Jack begins, but his words are drowned out by more ringing. Will is only marginally relieved when, this time, Jack reaches for his phone.</p>\n<p>He answers it somewhat gruffly, then stands and moves to the far corner of the room. Will turns back to the window, offering Jack a modicum of privacy. It's a small room, though, and he catches enough of the conversation to put the pieces together. He waits for Jack to disconnect before turning around.</p>\n<p>\"Where did they spot him?\" he asks.</p>\n<p>If his question surprises Jack, Jack doesn't show it. He pockets his phone before answering, moving steady across the room until he's standing just inside Will's space. Will takes an involuntary step back.</p>\n<p>\"His shrink's kitchen,\" Jack says, this time refusing to let Will look away. Will hasn't been this close to anyone in he doesn't know how long. It's making his skin itch. \"I'm going there now. You can either stay here, or you can come with me. But if you stay here, I am leaving an agent with you. Your call.\"</p>\n<p>He steps back then, Will sagging with relief. He lets out a shaky breath, then rubs his hand--still trembling--across his mouth. He has no idea which option he prefers. He's vaguely terrified of what he'll find if he follows Jack out to the car; paranoid of what he'll miss if he doesn't.</p>\n<p>Jack doesn't give him long to consider. He pulls his jacket off the back of Will's chair, folding it over his arm rather than putting it back on, and then crosses to the door. Will glances briefly to his dogs, all of them splayed across the floor or curled on random pieces of furniture, already settled in for the night. He follows a trail of wet footprints to the door where Jack is now speaking to someone Will doesn't recognize. The agent glances briefly in his direction, expression curious, like Will is a wild animal or a circus freak or something worthy of his stare. Will's lips curl back into a snarl. He has to force himself to turn away; head into the bedroom to find a pair of pants.</p>\n<p>~*~</p>\n<p>There's a vendor near the market's west entrance that sells organic tomatoes, the perfect mix of acidity and sweetness. She has an appreciation for organic produce: they're smaller than their mass-produced cousins, their flavour far superior. It's the difference between buying venison at the grocery store and hunting your own. Everything tastes better when you've skinned it with your bare hands.</p>\n<p>The basket she selects from the pile is just this side of ripe. She'll set them in her windowsill, let them redden in the sun. She has some ground meat in her freezer and a basil plant on her balcony. It's everything she needs for a Bolognese sauce. Not, perhaps, as humble as the meals her father used to prepare, and nowhere near as refined as the dishes Dr. Lecter taught her to make, but these days she's not accountable to either, so pasta it is.</p>\n<p>The tomatoes aren't cheap, but the money isn't hers--not really--so she hands over four crisp bills without hesitation and then tucks her purchase into the reusable cloth bag looped around her elbow. The market's busy this time of day, a steady flow of traffic weaving in and out of the stalls. It takes her a minute to leave the tomatoes; another to fall into the stream of pedestrians eagerly seeking their next bargain. He catches up with her near the mushroom stall. She briefly considers stopping to buy shiitakes.</p>\n<p>\"A little risky, don't you think?\" he says. He hasn't glanced in her direction, his gaze sweeping the stalls. He lingers briefly on a vendor selling a variety of grapes, though he makes no move towards them.</p>\n<p>\"People see what they want to see,\" she says. \"They ignore everything else.\"</p>\n<p>Her gaze is locked straight ahead, but she can see him out of the corner of her eye; knows he's overdressed for a Saturday morning farmer's market. No one pays him any notice, though. There's something in the way he walks, the way he sweeps through the crowd, like he owns the place, like the people around them are beneath him--and they are--that forces people to avert their gaze. No one would connect the man at her side with the man splashed across nearly every television set in America.</p>\n<p>\"I believe I owe you my gratitude,\" he tells her when they reach the heart of the market. Here the vendors sell imported goods at drastically inflated prices. They pass close to a stall selling Mediterranean fruits. Hannibal reaches out a hand; runs his fingertips over the top of a pile of pomegranates. \"Your letters were... appreciated.\"</p>\n<p>She can't quite suppress the smile that surfaces upon hearing that. She hasn't seen him--or Will for that matter--in more years than she can count. She heard of his arrest on the nightly news, watched the case unfold like everyone else.</p>\n<p>\"You're trying to figure out why I did this,\" she says. It amuses her that he doesn't know; that he hasn't figured it out.</p>\n<p>It's not enough to hear the confusion in his voice. She wants to see it, so she hazards a glance in his direction, taking in his profile. He's thinner than she remembered, gaunt in a way that reminds her painfully of a stag without its hide. He still looks as immaculate as ever. There's not a single crack in his facade.</p>\n<p>\"When I left,\" she says, looking away, \"I thought I knew what I wanted.\"</p>\n<p>She leads them away from the imported fruit, down a side-row where colourful bits of fabric--skirts and blouses and table cloths--flutter in the wind. It's quieter here. She feels entirely too exposed.</p>\n<p>\"You did. And we respected that, Abigail. We allowed you to go, to pursue your own path.\"</p>\n<p>When Hannibal says we, he means him and Will, though she knows he told Will nothing of their conversation. They are far more alike than he gives her credit for. She knows his mind almost as well as she knows her own.</p>\n<p>\"You did,\" she agrees. \"You funded it in fact.\" She holds up the bag of tomatoes. \"Thank you for that.\"</p>\n<p>Hannibal inclines his head.</p>\n<p>\"It still doesn't explain why you orchestrated all of...\" He gestures. \"This.\"</p>\n<p>Her smile feels permanent now, though it barely touches her lips. It's nice to see him off his game. Here she is no longer his charge. Not yet his equal, but this is the first time he's acknowledged her independence. She links their arms; takes him left at the next crossing to avoid the officer on horseback, crowd control.</p>\n<p>\"It's nice, isn't it? Having someone who can understand your point of view. See the world as you do.\"</p>\n<p>She glances over then, expecting to find comprehension, perhaps amusement, but instead there is only contemplation. She doesn't need insight into his psyche to know he is thinking of Will.</p>\n<p>It vexes her, how easily she is cast aside, especially now, after everything she's done, but then, she hardly expected anything different.</p>\n<p>\"I know where he is,\" she says, and for a moment, however brief, all of his defenses crumble and she sees, for perhaps the first time in their acquaintance, his true face. It is breathtaking, and she hates it. </p>\n<p>Smiling now, with arms still linked, she leads him from the market.</p>\n<p>~*~</p>\n<p>He has no idea if he's slept. He remembers leaving the house, crawling into the back of the SUV and then... nothing.</p>\n<p>He doesn't recognize the house in front of him, though he knows he's somewhere outside Baltimore. The sun's already well above the horizon, which means they drove all night to get here. He can hear Jack, somewhere behind him, talking to one of the locals. Will can't quite hear what they're saying, but Jack doesn't sound particularly happy.</p>\n<p>The house belongs to Dr. Bedelia Du Maurier. Will's heard the name before--knew her as a friend and colleague of Hannibal's. He's not sure why he didn't make the connection before now. He always assumed Hannibal's psychiatrist was male. His own bias, he knows, but it's hard to refit the idea into what he knows of Hannibal--makes a good deal of sense when he finally does.</p>\n<p>He tries to picture it: sees Hannibal knocking on the door, Du Maurier letting him inside. He doesn't think Hannibal's the type to sprawl across a couch, so she probably has two chairs, intimate but professional. He wonders how much she knows, if that's why Hannibal came to see her. He's still lost in thought when Jack appears at his elbow.</p>\n<p>\"They have no idea how he got in or out. Apparently no one was watching the back of the house.\" He moves then so that he's standing directly in Will's line of sight. \"You're not technically authorized to be here, so I need you to sit quietly and observe. If you notice something you think I need to know, save it until we're done.\"</p>\n<p>He doesn't wait for a reply, pace clipped as he heads for the front door. Will reluctantly follows.</p>\n<p>The door is standing wide open, a handful of crime scene investigators still inside. Jack shoos them out, then closes and locks the door behind them. They find Du Maurier in her consulting room.</p>\n<p>It's not exactly how Will pictured it, but he knows the second he steps into the room which chair Hannibal used. He moves towards it, taking a seat before Du Maurier can extend the invitation. She doesn't seem to mind, rising from her place on the couch and crossing to Jack's side. He cradles her hand in both of his.</p>\n<p>\"Hello, Jack,\" she says, warm and friendly. Jack's features soften.</p>\n<p>\"Bedelia. How are you?\"</p>\n<p>Her smile doesn't quite touch her eyes. She is far prettier than Will was expecting.</p>\n<p>\"Fine, all things considered. Thank you for coming.\"</p>\n<p>She gestures Jack to the empty seat across from Will's, the one Will suspects she usually uses. She takes the couch.</p>\n<p>\"This,\" Jack says when he's seated, gesturing to Will, \"is Will Graham. Do you mind if he sits in? Unofficially, of course.\"</p>\n<p>The second his name leaves Jack's lips her expression changes. She seems surprised to find him here, but curious, like she's heard his name before. Will wonders how often Hannibal mentioned him: what Hannibal has said about him.</p>\n<p>\"Will Graham,\" Du Maurier says, inclining her head. \"I've heard a lot about you.\"</p>\n<p>That gets Will's attention. \"Have you?\" he asks, far too sharp for casual conversation. He's not sure if he's angry to learn Hannibal has spoken of him, or flattered to know he warranted a place of honour in Hannibal's life. From her spot on the couch, no doubt sensing she's struck a nerve, Du Maurier holds up her hands.</p>\n<p>\"My apologies. That was crass. I only meant Hannibal spoke of you often.\" She pauses then, glancing briefly to Jack, then back to Will. \"He was here looking for you, last night. I don't know why he thought I might know where to find you.\"</p>\n<p>Du Maurier's watching him the same way Hannibal used to, with intense focus, like Will is the most fascinating thing in the world. He can feel the difference, though. With her it's both professional curiosity and idle speculation. With Hannibal it was something much, much different. He saw straight to Will's core; stripped bare his very soul.</p>\n<p>\"Why...\" Will tries to say, but the word crumbles in his mouth, turning to ash.</p>\n<p>\"Did he say what he wanted with Will?\" Jack intervenes, shooting him a glare. Du Maurier swivels to meet his gaze. Will feels like someone has cut his strings, every muscle turning to jelly at precisely the same moment. He has no idea why he doesn't slide from Du Maurier's chair, end in a puddle on the floor. He's only vaguely aware of Jack and Du Maurier's continued conversation.</p>\n<p>\"I'm not sure what he wants with him,\" Du Maurier says, pausing then. Will can't tell if her prolonged pause is a lapse in time or simple uncertainty. Jack's phone is ringing again, though he makes no move to answer it.</p>\n<p>\"But,\" Jack presses. Du Maurier sighs. Will's vision goes white around the edges. When Du Maurier speaks again, it is with obvious reluctance.</p>\n<p>\"But, I do believe Hannibal believes he's in love with Will Graham. If such a thing is possible for such a man.\"</p>\n<p>Whatever else she might have to say on the matter, Will doesn't hear. When he hits the floor, it's not in a puddle, but rather, with a sickening thud.</p>\n<p>This, she thinks, watching the play of ambulance lights across her driveway, is why she retired.</p>\n<p>There are times, few and far between, when she misses professional practice. More so before Hannibal, but even now, when she passes her living room, furniture still arranged to look like a consulting room, or when she catches sight of her degrees, hanging level on the wall, she'll reconsider her decision to leave the profession she spent a lifetime building.</p>\n<p>Today is not one of those days.</p>\n<p>Jack is speaking to an agent just inside her doorway, Bedelia standing on the bottom step of her porch, watching a paramedic try to convince an uncooperative Will Graham to let them take him to the hospital. He's awake, his fainting spell a short-lived affair, brought on by low blood pressure--too little sleep and even less food, or so he claims. He's shaking his head emphatically now, gesturing sharply at whatever the girl is saying. Bedelia moves a little closer, curious.</p>\n<p>It's not only professional curiosity, though there is hardly anyone inside the psychiatric profession who hasn't heard of Will Graham; hasn't wondered what makes him tick. Her curiosity is something much more personal. Seven years Hannibal spent on her couch, and it was only in his last two that she came even close to seeing the man behind the mask. Will Graham was the key to that, Hannibal coming alive when he spoke of him. It was the only time she ever saw the veil lift; the only time she was ever permitted a glimpse behind his walls.</p>\n<p>\"I'm fine,\" Will is saying. He sounds exasperated. He's fumbling with the blood pressure cuff wrapped around his arm, trying to pull it off. The paramedic--a young woman Bedelia thinks is probably new to the job--tries to stop him. Will flinches violently when she touches him, entire body growing rigid, his discomfort obvious.</p>\n<p>\"How is he?\" Jack says, appearing at her elbow. Bedelia glances briefly over her shoulder, catches his eye, and then goes back to watching Will.</p>\n<p>\"My professional opinion? You shouldn't have that man out in the field.\"</p>\n<p>Will is sitting quietly now, allowing the paramedic to get her reading. He glances up when he senses them watching him, annoyance painted across his features. Bedelia meets his eye. Will averts his gaze.</p>\n<p>\"You said Hannibal was in love with Will,\" Jack says, speaking loud enough for Will to hear. It catches his attention, anyway, his earlier discomfort vanishing entirely.</p>\n<p>Bedelia doesn't want to have this conversation in front of him. There is concern in Jack's voice, but he doesn't sound like a worried friend. He sounds like a man fishing for an angle. Right now she's more than a little worried about Will's fragile psyche. She knows precisely where he ended up after Hannibal's arrest.</p>\n<p>Jack's watching her intently, waiting for her answer, his impatience obvious in the set of his shoulders. She nods him towards the house. Jack relents; follows her inside. She leads them into the kitchen, where last night's empty wine glass is still sitting on the counter. It's too early in the morning to refill it so she flips on her automated espresso machine, listens to it grind a new supply of beans. </p>\n<p>\"You can appreciate how difficult this is for me, Jack,\" she says without glancing over. She crosses to the cupboard and pulls out two cups, then carries them both to the machine. \"Where Hannibal is concerned, I am still bound by doctor-patient confidentiality. I'm not at liberty to share anything we've discussed in our sessions. Not without a warrant.\"</p>\n<p>She holds up a hand when it looks like Jack might argue, letting the conversation lull while she makes him a cup of coffee. He accepts the steaming cup gingerly, but makes no move to drink from it. She places a second cup on the tray; starts it brewing.</p>\n<p>\"You must also understand that the Hannibal I knew was the Hannibal he wished me to see. I would wager there are very few people who have seen Hannibal's true face. I suspect your Will Graham is one of them.\"</p>\n<p>\"Because he was in love with him,\" Jack presses. Bedelia waits for her coffee to finish brewing, retrieves it and brings it to her lips. The first burst of bitter warmth across her tongue loosens her shoulders. She turns to face Jack.</p>\n<p>\"Hannibal never said as much, but I do believe he believed what he felt for Will was love.\"</p>\n<p>She wants to clarify, to ensure Jack understands the limitations of Hannibal's perception, but it is then Will Graham bursts into her kitchen, startling them both. </p>\n<p>She has no idea how much he's heard, but he looks livid. He's pale and shaking, unsteady on his feet like he's going to collapse at any moment--and given what happened in her living room, she wouldn't be surprised if he did. Still, she makes no move towards him, as interested to see where this is going as she is concerned for his wellbeing. Jack sets his untouched coffee down on the counter and takes a tentative step towards him.</p>\n<p>\"Don't,\" Will says, surprisingly steady.</p>\n<p>Jack freezes, the first time Bedelia has ever seen him uncertain. He holds up both hands, takes a step back so that he's once again standing before his untouched coffee. Will turns towards her. Bedelia meets his eye. This time Will doesn't look away.</p>\n<p>\"You're wrong. And you're also lying,\" he says.</p>\n<p>This isn't the first time someone has accused her of lying, and yet she's still taken aback, not entirely sure how Will came to the conclusion--or even what he means by it. She glances briefly to Jack, but he obviously puts some stock on Will's opinion, because his features have hardened, his earlier uncertainty replaced by suspicion.</p>\n<p>Bedelia takes another sip of her coffee and then sets it down. She steps forward, coming to stand on the opposite side of the island from Will, the exact spot she stood last night.</p>\n<p>\"What am I lying about, Will?\" she asks.</p>\n<p>Will smiles. It is a twisted, broken thing. Bedelia wishes there were iron bars between them.</p>\n<p>\"You said he came here looking for me, but that doesn't make sense. We've never met. You have no reason to know where I was, and Hannibal knew that. So what are you hiding? Why was he really here?\"</p>\n<p>She understands now his mistake, the omission her own negligence. She shakes her head and then glances briefly at Jack. The last twelve hours are finally catching up with her. She can feel the weight of exhaustion dragging at her bones, unperturbed by the caffeine she's just forced into her body. Jack's staring at her like she's one of his criminals, her kitchen an interrogation room. Bedelia sighs.</p>\n<p>\"I wasn't lying, Will,\" she says, which does nothing to deflate his ire. \"Hannibal was here looking for you. He was under the impression I knew where you were.\"</p>\n<p>She's confused him, that much is obvious, uncertainty flashing across his features. She has no idea the extent of the damage Hannibal did to this man--how much of what she's seeing is Hannibal's work, how much of it is Will's underlying empathy disorder--but she worries now she's made the wrong choice, that she never should have told him what she has. It's too late now, the damage done, and she only has herself to blame.</p>\n<p>\"About a year ago I visited him in prison. His request,\" she says. \"When I agreed to go it was as his doctor. I'm not sure what I was expecting, but it wasn't me he wanted to see. He wanted information. Specially, he wanted to know about you. When I told him I didn't know where you were, he asked if I would look into it for him. I agreed, and that was the end of our meeting. That was the last time I saw him, until last night.\"</p>\n<p>Sometime during her speech Will's features harden. For the first time since their meeting Bedelia can honestly say she is afraid of the man. There is something in the hard line of his jaw and the intensity of his gaze that sets her back, makes her want to retreat somewhere safe. In all the years she spent sitting across from Hannibal--even last night, Hannibal standing where Will is now--she was never once afraid of him, not really. Will, in this moment, is terrifying.</p>\n<p>\"And did you?\" he asks, his words practically hissed, upper lip curling back over his teeth. It takes all of Bedelia's training to keep from flinching.</p>\n<p>\"No,\" she says, calmly, professionally. In this moment she sees Will as a wounded animal, unpredictable, dangerous, but in desperate need of help.</p>\n<p>Her assurance has by no means diffused the situation, so it is fortunate that Jack chooses then to step in between them, close enough that Will has to step back or risk physical contact. Bedelia releases a breath, unaware until now that she'd been holding it.</p>\n<p>\"Will, if the EMTs have cleared you,\" Jack says, and they both know they haven't, \"then I need you to go wait in the car. That is not a suggestion.\"</p>\n<p>She has no idea what their relationship is outside of boss and subordinate--and certainly observing them today she hasn't learned anything new--so it surprises her when Will deflates, though he is still obviously angry. He clings fiercely to defiance, but he turns on his heel, disappears from her kitchen as swiftly as he came. Jack doesn't turn back to her until they hear the front door slam shut.</p>\n<p>When he speaks, it is softly, just under his breath, intimate conversation in place of an interview. That doesn't make the topic any less grave.</p>\n<p>\"I need to know if you think Hannibal is going to come after Will,\" he says. Bedelia considers.</p>\n<p>\"I think,\" she answers, mimicking Jack's tone, low and serious, \"using Will Graham as bait is a tremendously bad idea. One I think will backfire.\"</p>\n<p>Jack nods. \"And do you think he planned this? When he asked you to find Will, was he already planning his escape?\"</p>\n<p>Bedelia lets the question hang in the air for a very long time before answering, though only because she's terrified of what her answer will mean. When she does speak, her words are carefully chosen and heavily weighted.</p>\n<p>\"I think if he did, then you need to start looking for an accomplice.\" She lets her gaze retrace the steps Will Graham took only minutes before. Jack doesn't say anything, but she can tell he's caught her hint; that it's something that's already crossed his mind.</p>\n<p>~*~</p>\n<p>The EMTs make him sign an RMA before letting him leave. Will does so with enough force to tear the form, and then stalks back to the SUV, claiming the passenger seat this time. He checks the glove box--Jack always keeps spare snacks on hand--finds an unopened packet of beef jerky and a granola bar. He leaves the jerky, pulls out the granola bar.</p>\n<p>He has no idea how long Jack's going to be--he wants more than anything to go home, but he's starting to get that isn't going to happen, not anytime soon. He's tense and annoyed and not entirely sure what he's doing here or what he's supposed to do with himself or even how he's supposed to process everything that's happened.</p>\n<p>He's starting to feel... unstable.</p>\n<p>The thought settles in his chest, threatening to bubble forth as hysterical laughter. He swallows it back, pulls out his cell phone instead. His hands shakes as he scrolls through his contact list, eventually finding the name he wants. He opens the granola bar while waiting for the call to ring through.</p>\n<p>He doesn't recognize the girl who answers, so he asks for Dr. Manning around a mouthful of granola. The girl puts him on hold. Will swallows; takes another bite.</p>\n<p>Across the lawn, Jack emerges from the house. Will's half tempted to hang up, but he needs someone to watch his dogs and he only knows one person well enough to request the favour: his vet. He watches Jack speak to the agent who drove them in, and then the EMTs still waiting in the driveway. Whatever he says to them it starts them moving, the ambulance halfway out of the driveway before Jack glances in his direction. He frowns when he spots the phone pressed to Will's ear. Will waves him off.</p>\n<p>It takes him a bit to make the necessary arrangements, and several times he has to repeat himself around a mouthful of granola bar, but by the time Jack arrives at the side of the car Will's got someone to feed and walk his dogs and is in the process of hanging up. Jack arches an eyebrow.</p>\n<p>\"Just something I needed to take care of,\" Will says. He's still a little pissed, even though he knows it's not Jack's fault--it's not even Bedelia's.</p>\n<p>Jack stares at him through the passenger window for several seconds longer than is comfortable. Will almost sags with relief when he finally relents; moves around to the driver's side. He climbs in with little fanfare, but instead of starting the car and getting them the hell out of there, he remains rooted in place, staring out the front windshield. Will stuffs the rest of the granola bar in his mouth and swallows back his annoyance.</p>\n<p>\"What?\" he eventually snaps. When Jack glances over, his expression is entirely too serious. It's the same expression homicide detectives wear when informing a loved one of their family member's murder.</p>\n<p>Will has a feeling he's not going to like this conversation.</p>\n<p>\"I'm going to ask you something, and I need an honest answer,\" Jack says. He won't let Will avert his gaze, eyes tracking his no matter how often Will tries to look away. Short of turning his head completely, there is little Will can do to prevent it. He wishes he'd worn his glasses. Jack waits for him to settle before speaking.</p>\n<p>\"I need to know if you and Dr. Lecter were involved in a sexual relationship.\"</p>\n<p>It's the last thing he expected Jack to ask, Will stunned speechless. He opens his mouth, then shuts it again; flashes back to two years of conversations and therapy sessions and dinners--that to this day he doesn't like to think about--and tries to see their... relationship from Jack's perspective. He wonders what Dr. Du Maurier said to make Jack think such a thing was possible.</p>\n<p>He's not quite sure he doesn't already know the answer.</p>\n<p>\"No,\" he eventually says, defensive. Of course in hindsight he can see their relationship as a courtship, maybe even bordering on romantic, but outside of a hand on his shoulder and once an arm draped loosely across his back, Hannibal never touched him.</p>\n<p>Will still doesn't know if he ever wanted Hannibal to: it's not something he likes to think about, especially not now.</p>\n<p>Jack nods, looking somewhat relieved, like Will's answer has alleviated some of his doubt. Will still hasn't pieced together his purpose for asking. Jack's next question rather makes it clear.</p>\n<p>\"And during his incarceration, did you ever have any contact with Hannibal Lecter? Did you visit or send and receive letters? Did you...\"</p>\n<p>Jack hasn't stopped speaking, but Will can't listen anymore. He knows exactly what this is about. He's not sure if he's angry or amused or terrified. The inside of the car is beginning to feel like a cage, the air stale, suffocating. Will sucks mouthfuls of it into his lungs, but it does nothing to prevent his earlier suppressed laughter from spilling forth. Jack abruptly stops speaking. He stares at Will like he's grown a second head. Either that or he's thinking about tossing him into a set of cuffs.</p>\n<p>\"You think I helped Hannibal break out of a maximum security hospital?\" Will asks when he's collected himself. He doesn't give Jack a chance to answer. \"Do you even have any evidence anyone else was involved? That this wasn't just a system failure Hannibal took advantage of?\"</p>\n<p>He knows--has known since Hannibal's arrest, when Will spent the better part of three weeks staving off his inevitable breakdown so that Jack could interrogate him--that Jack has never been certain of Will's involvement--or lack thereof--in Hannibal's crimes. He'd thought perhaps this was behind them, but it's not a surprise to learn it isn't. Even after Abigail's disappearance, Jack was still convinced she'd had a hand in her father's crimes. It shouldn't have surprised him Jack would think the same of him.</p>\n<p>\"Look at this from my perspective, Will. A transformer explosion knocks out half the city's power grid, including the hospital and at the same time the hospital's back-up generators fail? It could be coincidence, but if it is it's a hell of one. If our investigation turns up anything, there are very few people I can look to. If Hannibal's escape was planned, then there is no possibly way for him to have pulled it off without an accomplice.\"</p>\n<p>\"And you think that accomplice is me,\" Will says, incredulous. He wants to laugh, the ridiculousness of it as comical as it is tragic. He means to tell Jack as much, but it is then a thought strikes him, his amusement replaced by horror, comprehension landing like a blow to the solar plexus, stealing his breath.</p>\n<p>~*~</p>\n<p>His money has served her well.</p>\n<p>The apartment Abigail secured is tasteful and refined, not ostentatious, sophisticated in its own way. It has a wonderful kitchen--light and airy and when he opens the balcony door a breeze carries through the room, bringing with it the fresh scent of bread from the bakery across the street. It is perfectly situated to allow her to come and go, and yet restricts his movements as surely as a prison cell.</p>\n<p>It does have the advantage of being the last place anyone would look for him, and she did have the courtesy to retrieve some of his things from storage--a risk, certainly, but one he appreciates. He misses his cookware--those still secured inside an evidence locker somewhere--but as far as temporary accommodations go Hannibal is hardly in a position to complain. The nest she has built is more than adequate. He is not ungrateful.</p>\n<p>To his surprise, she's had his desk brought in, or at least a startlingly accurate facsimile. She's filled its drawers with pencils and paper, a scalpel because she knows his preference for details. He sits at it now--the chair not his, this one undoubtedly bought at a flea market somewhere, hardly the sort of thing Hannibal would choose on his own--sharpening the end of a pencil while staring at the tablet she's provided. On the screen, there is a satellite image of Will's new home rendered as clear as Google Earth will allow. The lack of detail is vexing, but Hannibal is not without imagination.</p>\n<p>\"You know Jack will bring him in on this,\" Abigail says, emerging from her bedroom, towel still wrapped around her head, her robe cinched tight around her waist. She has matured considerably since he saw her last. When she left, she was little more than a slip of a girl. Now she is in the flush of womanhood. Hannibal glances pointedly at the ceiling. She should not be able to see the tablet's screen from where she is standing.</p>\n<p>\"I'm beginning to think there are cameras secreted about the room, so that you might watch me at any moment. Are we really so low on trust?\"</p>\n<p>Abigail's smile doesn't quite reach her eyes.</p>\n<p>\"I trust you as much as you trust me, but this isn't about us.\"</p>\n<p>Hannibal concedes the point with a brief chuckle. He has spent far too long outside her company. He'd forgotten how formidable she was. He still doesn't know if they've formed a partnership, or if she is working something other, more dubious angle.</p>\n<p>\"You do not believe we will find our good Will cloistered away in his seaside home,\" he says. He knows as much, but he is curious to hear her answer. He stands then, setting the pencil on the table and then crossing into the kitchen to check on the pot of water boiling on the stove. \"You believe Jack has him looking for me.\"</p>\n<p>It pleases him, more than he dare admit, to think of Will, that brilliant mind of his poised on the edge of sanity, frantically searching for him. It makes all of this feel... inevitable.</p>\n<p>Abigail moves into the kitchen; seats herself at the breakfast bar. She pulls the towel from her hair and begins drying its ends. Hannibal plucks her tomatoes from the windowsill; scores their skin and then drops them into the water.</p>\n<p>\"I think it will make this both harder and easier,\" she says, skillfully. She pauses then, Hannibal ignoring the weight of her gaze in favour of watching the tomatoes blanch. When the skin begins to peel, he fishes them out; drops them into the bowl of ice water sitting in the sink.</p>\n<p>\"Do you really think he'll come?\" she asks. She sounds uncertain, as young as she did when they first met, when her manipulations were often undercut by her own insecurities, the mould set but not yet polished. It startles Hannibal enough that he glances over.</p>\n<p>\"Positive,\" he says with complete certainty. He doesn't tell her what she already knows, that Will is his, always and forever, that if he is certain of nothing else he is certain of Will's loyalty. Will may be lost, but that is only because Hannibal has not been here to guide him home.</p>\n<p>He offers Abigail a smile, and then slowly begins stripping a tomato of its skin.</p>\n<p>They shot Hannibal, in the right shoulder, just after he plunged a linoleum cutter into Will's thigh. Will should have been the one to do it--had his gun drawn and everything--but he couldn't bring himself to pull the trigger, some distant part of his brain still clinging fiercely to the hope that he was wrong.</p>\n<p>At least, that's what he tells himself.</p>\n<p>Had Hannibal killed him, he undoubtedly would have had enough time to slip out the patient exit, vanish before they stormed in the front. That he lingered, expression disappointed and maybe a little heartbroken, ultimately resulted in his downfall. Will watched his take-down, dazed from blood loss and shock, hand wrapped around the wound, blood pulsing through his fingers. He saw them pin Hannibal to the ground, Hannibal's eyes never once leaving his. A brief flicker of pain distorted his expression when they forced his hands behind his back, but otherwise he remained stoic, unmoved. There was so much blood.</p>\n<p>He doesn't remember much after that, waking three days later in the hospital, much of the event buried in the quagmire of his subconscious. The human mind is fascinating like that. Will knows now that his fractured completely, took him back to a time before the FBI, before Hannibal. For a very long time he was certain he was going home to his boats and his motors.</p>\n<p>That didn't happen. Slowly the pieces came back to him until, livid black stitches still holding his leg together, he found himself sitting in Jack's office, trying to defend against the suspicion in Jack's tone.</p>\n<p>He stormed out of the meeting, Alana fast on his heels. She called his name, urgent and pleading, but he ignored her; disappeared from the building without a backwards glance. Two days later he checked himself into Spring Grove. He hasn't been back to Quantico since.</p>\n<p>It's eerie how little a place can change, and yet the halls of the Behavioral Sciences Unit don't feel familiar. They feel like the distant memory of someone else's dream, Will only a casual voyeur. He follows Jack blindly, down the central corridor, its walls hemoglobin red, its floors the colour of bleached bone. Word of his coming has gotten out, the hall lined with spectators, the entire department hoping to catch a glimpse of the madman who once walked their halls. He can hear their whispers, their words carrying, swarming around him like living, breathing things. Will rounds his shoulders, quickens his pace.</p>\n<p>Jack brings them around a corner. The incessant humming of gossip vanishes entirely. Will blinks; staggers to an abrupt stop. The linoleum beneath his feet is now the colour of slate, the walls institutional white. He glances back over his shoulder and finds the hall entirely empty, his audience having disappeared into thin air. Will releases a breath, silently repeats his name, his location, the time. He'd hoped treating the encephalitis would bring an end to the hallucinations. It didn't. He's not sure what's worse: conceding that not all of his symptoms were neurological, or knowing that he owes Hannibal gratitude for his arsenal of coping skills.</p>\n<p>He's feeling mostly grounded by the time Jack appears at his elbow. </p>\n<p>\"Everything alright?\" he asks.</p>\n<p>\"Fine,\" Will says, smile not quite reaching his eyes.</p>\n<p>He can tell Jack doesn't believe him, but Jack doesn't call him on it, accepting the path of least resistance. He turns them back in the direction they were headed, this hall at least familiar, though not, perhaps, as familiar as Jack's office.</p>\n<p>Stepping into Jack's office is like stepping back in time. Will pauses in the doorway, momentarily breathless. He's overwhelmed by a staggering sense of deja-vu, so much so that he almost expects to glance over and find Hannibal sitting in one of the chairs across from Jack's desk. There is no one. Will crosses to the chair farthest from the door. Jack circles around behind to claim the desk.</p>\n<p>\"You really believe Abigail's still alive,\" Jack says, a continuation of their conversation in the car.</p>\n<p>Will's frustration comes out as a barked laugh.</p>\n<p>\"How many times are we going to go over this? She's alive, Jack.\"</p>\n<p>Jack holds up his hands. \"Okay, for argument's sake, let's say she's alive. Is she capable of something like this?\"</p>\n<p>Will considers the question for a very long time. On one hand, no, absolutely not. He refuses to believe Abigail's involved in this. But on the other, he honestly has no idea how far into her head Hannibal got. She's an intelligent, cunning woman, more than capable of manipulating them both, but to what end?</p>\n<p>\"I don't know,\" he eventually answers, surprised by his honesty.</p>\n<p>There's so much more he wants to say, but he doesn't get the chance to elaborate, their conversation interrupted when Beverly Katz ducks her head into the room. As soon as he spots her, Jack waves her in. She glances only once in Will's direction before crossing to claim the chair at his side. Then she turns to face him, expression searching.</p>\n<p>\"Will. It's good to see you again,\" she says. There is curiosity there, but also tentative uncertainty. Will can only imagine what's been said in his absence.</p>\n<p>\"It's probably somewhere between the best and worst case scenario,\" he tells her, unprompted. Her expression falls, confusion clouding her gaze. Will gestures awkwardly, trying to displace his words. He didn't mean to say anything, let alone something so clumsy and cryptic. To his relief, Jack jumps in, steering the conversation back on track.</p>\n<p>\"What do you have for me?\" he asks. Beverly gives Will a final, searching glance, then turns her attention back to Jack. Will deflates, relieved.</p>\n<p>\"Still no word on the transformer explosion, but the backup generators were definitely sabotaged. Someone poured engine coolant into the oil reservoir,\" she says as she tosses a folder onto the desk. Jack reaches for it; draws it to his side.</p>\n<p>\"There is very limited access to the site, so this was definitely an inside job. Last inspection was a week ago. This,\" she gestures to the folder, \"is a list of employees with access who have been on site since then. Only two haven't reported back for duty, and one of those is a guard in hospital with injuries sustained in the riot.\"</p>\n<p>Jack looks impressed. Will can no longer remember why he agreed to come.</p>\n<p>\"We got an address on the second?\" Jack asks. Beverly nods, and Will knows exactly why he's here.</p>\n<p>No one knows Hannibal like he knows Hannibal.</p>\n<p>\"You won't find him alive,\" Will says, feeling more than a little hysterical. He's teetering on the edge again, only this time he doesn't know which way he wants to fall.</p>\n<p>Surprisingly, Jack accepts his assessment without question. He nods, sighing audibly before standing; crossing to his antechamber, where Will knows he keeps a change of clothes. It leaves him alone with Beverly, the weight of her gaze enough to make him squirm. He's tempted to snap at her, just for the pleasure of confirming any rumour she's heard. He has no idea if she thinks he had a hand in Hannibal's crimes, but right now the intensity of her stare is making him feel like a pariah.</p>\n<p>\"Hannibal doesn't like to leave loose ends. If he had an inside accomplice, he'd make sure to eliminate the evidence,\" Will says. He has no idea why he feels the need to defend himself, at least, not until Beverly answers.</p>\n<p>\"Like he did with you?\" she says.</p>\n<p>She doesn't sound accusatory, more mildly curious, like Will is something she's trying to figure out. Will still finds himself clutching his leg, hand squeezing absently around his scar. He offers a smile, though it comes out feral.</p>\n<p>\"Apparently, I'm the exception.\"</p>\n<p>He doesn't want to talk about this, the conversation making him tense and nervous. He holds Beverly's gaze until Jack comes back into the room, grateful then for the excuse to glance away. Jack is tying his tie.</p>\n<p>\"I want you with us, Will,\" he says without glancing up.</p>\n<p>Will winces. \"If it's all the same, I'm going to pass. You're not going to find anything and I need a shower, a change of clothes and maybe some food. Definitely some sleep.\"</p>\n<p>He thinks, for a moment, that Jack might argue, but after a minute he relents, nodding when he catches Will's eye. He's seen what pushing Will too far will do.</p>\n<p>\"I'll arrange for someone to take you to the hotel,\" Jack says.</p>\n<p>Will nods, grateful. He continues to rub at his leg.</p>\n<p>\"I'll take him,\" someone says, though to Will's surprise it's not Beverly, this voice achingly familiar.</p>\n<p>He's not the only one to turn towards the new arrival, but he is the first to speak, \"Hello, Alana,\" passing over his tongue before he's fully processed it's her. It's been years since he saw her last, and yet she is exactly as he remembered her.</p>\n<p>Hello, Will,\" she replies, and as far as Will's concerned, she's the only person in the room.</p>\n<p>~*~</p>\n<p>She is, above everything else, a survivor, and survival has always rested on her ability to read people. It is easy to steer a person in the direction she wants when she knows what makes them tick. It took her a very long time to figure out what made Hannibal Lecter tick, but she knows now how much he covets holding the balance of power; that he only came to respect her when she wrestled it from his hands.</p>\n<p>It's a delicate balancing act. She takes enough to maintain his respect, but offers over enough to appease his ego. She wonders sometimes if it would have been easier going straight to Will. She knew where to find him, after all, had no reason not to simply turn up on his doorstep, lost and alone and in need of care. He would have brought her in without hesitation, another of his strays.</p>\n<p>But Will is not the same--not the person she wants--without Hannibal, and so they are a matched set. She will bring Hannibal to Will, and Hannibal will bring Will to her. She need only keep herself afloat amidst their torrent. If she can manage that, she can have the thing she's spent the last four years searching for: family.</p>\n<p>Her family.</p>\n<p>Managing Hannibal, however, is more difficult than she remembers.</p>\n<p>She has, during her absence, become unpracticed in dealing with him. Or perhaps he is simply changed by his experiences. He is not quite the man she left in Baltimore. His refined edges have grown jaded, the strain of his incarceration obvious in the set of his jaw, the lines of his face. He's quick to anger now, when before he burned like ice. His obsession with Will has grown.</p>\n<p>She knew of course it might; understood that it would be laced with hurt and betrayal, the sharp irritation of failure. Hearing him speak of Will now, Abigail's not entirely certain she made the right choice. Her Hannibal, the one she left in her quest to find herself, would never have revealed so much of his hand. This Hannibal wears his wound like an open sore, blood seeping from his chest, staining his shirt. Her Hannibal was precise and exacting. This Hannibal is rash and unpredictable. She's not entirely certain what she unleashed.</p>\n<p>\"It's too soon,\" she says again. Retrieving Will has always been the plan, but to do so during the heat of an investigation is foolishness, plain and simple. She tells him that.</p>\n<p>Hannibal doesn't answer right away. He clears her plate, rinses it in the sink and then tucks it into the dishwasher. He is smiling, some of his earlier tension washed away by an afternoon in her kitchen. For a brief moment she is transported, once again standing in his kitchen, watching him chop potatoes to add to the sausage. She wonders if she ought to offer him some tea; if it would help settle the maelstrom of his mind.</p>\n<p>\"And how long would you have us wait?\" he asks after he's washed and dried his hands on the dish towel; folded it neatly into a cube. \"To remain in the country is folly, and yet we cannot leave without Will. The sooner he is retrieved the better it is for all of us.\"</p>\n<p>He sounds so certain, like it hasn't occurred to him that Will might turn him away: turn him in. She wonders what would happen if Will did, if this time Hannibal would kill him. She wonders if she would forgive him.</p>\n<p>She wonders, too, what he intends to do with her. She's walking a fine line, she knows. He will kill her if he thinks she's a threat to him--to him and this thing he has with Will. She wonders sometimes if the benefits really do outweigh the risks; if perhaps she should have put a little more effort into her therapy.</p>\n<p>Too late for that now.</p>\n<p>\"Tell me,\" he says, crossing over to her. He moves with utter grace, perfectly contained, each motion practiced and precise. He stops just outside her circle of space, looming, yet she remains unafraid.</p>\n<p>\"Tell you what?\" she says, defiant. He offers her a smile, coloured through with appreciation.</p>\n<p>\"You could not have done this alone,\" he says. She inclines her head. \"How long until they trace that path back to you? If they haven't already. You are very clever, Abigail, but not as clever as you think you are.\"</p>\n<p>She knows what he's doing, but she is too far outside his control for it to work.</p>\n<p>\"You think I opened a door I cannot close,\" she says.</p>\n<p>Hannibal nods. He reaches for the bottle of wine, refills both their glasses, hers a little too full, his not nearly enough.</p>\n<p>\"Maybe, but I'm still coming with you.\"</p>\n<p>Something flashes in his eyes then, cold-flint that strikes her like an arrow to the chest. She is very rarely afraid of him, though she understands what it means to feel fear. Fear is something her father taught her. It is the thing that makes a person stronger; that gives them strength when they might otherwise have none. Fear is why a stag can run for miles, even when gravely injured. It is the emotion that defines bravery. Courage.</p>\n<p>Abigail Hobbs is very rarely afraid, and yet in this moment, Hannibal is terrifying. It is a painful reminder of just how dangerous her game actually is.</p>\n<p>\"I need you here,\" he says, simply. She recognizes the out for what it is--bristles with indignation when she hears it--but she knows better than to stand defiant. She is, above all things, a survivor, and she will survive him.</p>\n<p>She offers him a nod and gets a smile in return, as though he is pleased she has spared him cutting her throat. She wonders idly when this became her life, why even now she continues to seek the bond she shared with her father; why she cannot seem to move past the girl her father left bleeding on the kitchen floor.</p>\n<p>If Hannibal has any insight into the matter, he doesn't comment, finishing his wine with far less care than she has come to expect from him, and then leaving her to hers. She sips at it slowly, knowing without a doubt that when she wakes in the morning, he will be gone.</p>\n<p>~*~ </p>\n<p>Years ago, when he used to fantasize that someday his friendship with Alana might evolve into something more, Will used to spend idle moments imaging their first date. Oddly, this is the closest he's ever come to seeing those fantasies made real, and yet, he no longer wishes to kiss her. She is undoubtedly still kissable.</p>\n<p>There is something decidedly comforting in standing in her presence, though, Will showered and changed, a warm meal sitting pleasantly in his stomach. He doesn't particularly want the evening to end, though he's not really sure why. Perhaps it's simply because Alana is... engaging. She is also engaged.</p>\n<p>He's oddly relieved by that.</p>\n<p>\"Are we ever going to talk about you, or are you going to continue to deflect my attempts at conversation,\" she says when they reach her car.</p>\n<p>There's nothing but suburban sprawl for miles, lines of hotels and shops and restaurants meant to serve the base and surrounding institutions. Will knows this area like the back of his hand, and yet he's never once had occasion to stop here. Until now this place had existed only as a blur of colour seen from the freeway.</p>\n<p>Will doesn't answer until he's seated in her passenger seat, seatbelt secured in place.</p>\n<p>\"We talked about me,\" he says. It's not entirely true. They talked about his house and his dogs and his boat. He talked about the catches he pulled from the river and how, on a good day, he can paddle straight into the heart of town without ever leaving the water.</p>\n<p>Alana doesn't answer until they're out of the parking lot and heading in the direction of his hotel.</p>\n<p>\"We didn't,\" she tells him, \"but you look... stable.\"</p>\n<p>Coming from her it's a compliment, so Will smiles; lets himself laugh for the first time since he spotted Jack's headlights through his rain-splattered window.</p>\n<p>\"Honestly?\" he says, because if he's ever counted on Alana for anything, it's her willingness to listen to whatever he has to say. She nods; takes them out onto the freeway. \"Most of the time,\" he begins, picking his words carefully. \"I feel stable. Since Jack turned up... not so much so.\"</p>\n<p>It isn't very far from the restaurant to the hotel, a single exit on the freeway, close enough that they could have walked, if walking was something people still did. It's impossible here, no sidewalks, only long channels of road meant to move cars and the people inside. Alana finds them a parking spot and then cuts the engine. She makes no move to get out of the car, turning to face him instead.</p>\n<p>\"That's normal, Will. You've been thrust back into a world that almost destroyed you, and on top of that you're being asked to stare down a traumatic event. I'd be worried if that wasn't getting to you.\"</p>\n<p>He spoke to her, only once during his time at Spring Grove, Hannibal not yet gone to trial. He asked her then if she knew, if she'd seen it coming; if there was any way he could have known. She shook her head sadly and answered, no, that she was as shocked as he, and that it was okay if he was angry.</p>\n<p>The problem of course wasn't that he was angry, it was that he wasn't. He couldn't bring himself to tell her that he regretted his decision. That he missed Hannibal. That he misses him still.</p>\n<p>\"Is it?\" she presses. \"Getting to you?\"</p>\n<p>Will nods, because there's no point lying about that.</p>\n<p>\"Do you want to talk about it?\"</p>\n<p>Talking about it is the last thing he wants. He spent the better part of six months talking about it: to psychiatrists he couldn't bring himself to trust, to random strangers in group therapy, to his reflection in the mirror. There's nothing left to say, except, perhaps...</p>\n<p>\"I think Jack wants to use me as bait, and I think I might be okay with that.\"</p>\n<p>It's clearly the wrong thing to say, because Alana's colour drains, her cheeks turning ashen. Her features soften into something entirely too sympathetic--entirely too close to pity--for his liking. He doesn't take it back, though. He certainly doesn't mention that he's not sure what he'll do if Hannibal does come for him. That half of his Hannibal related nightmares stem not from Hannibal's deeds, but from his arrest.</p>\n<p>He certainly doesn't share Bedelia Du Maurier's words. Doesn't mention how long they've been rattling around inside his head.</p>\n<p>Instead he offers a weak smile; listens intently while Alana tries to convince him it's a bad idea. She isn't wrong, but he doesn't tell her that either.</p>\n<p>He hasn't dreamt of Hannibal in years--which isn't precisely true, but it sounds better than months and this is the first dream he's had in a very long time.</p>\n<p>It isn't lucid, not right away. It comes to him slowly, awareness growing as the dream progresses. It begins with disorientation, the colours a little too bright, time a little too sluggish. His steps are light, floating him across marble-tiled floors that disappear beneath a heavy oak table. Hannibal's dining room is encased in long, purple shadows, the table draped in black velvet. There's a bowl of figs sitting as a centrepiece, the fruit rotten, thick with soft grey mold. Will's feet carry him to the table's head, where he sits upon a throne of elk antlers. He is only vaguely aware of the two tines goring each of his thighs. Scarlet bleeds through the fabric of his trousers, leaving dark circles that match the colour of his wine.</p>\n<p>He remembers this dinner.</p>\n<p>Shortly after his release from the hospital--the first one, the one that treated his encephalitis--Will found himself standing in Hannibal's kitchen, apologizing for the accusations he'd made; the threats. Hannibal stood patiently, serenely throughout the speech, giving a brief nod at its end, carefully contained. <i>You are hardly to blame for the transgressions of your mind, well outside your control. And of course I blame myself. Had I trusted your judgement, we would have sought a second opinion, found the source of your malaise sooner. For that you have my most humble apology,</i> he said, and Will believed him; felt relief knowing he had not lost a friend.</p>\n<p>Hannibal fed him that night: sat him down at the table's head, velvet tablecloth brushing against the tops of his thighs. The figs were ripe, deep purple with green tips, and the wine dry, bursting across his pallet. Where Will might have tiptoed, Hannibal charged headlong, weeks of awkward animosity disappearing long before the second course. Knowing what he knows now, the memory is a painful one, but at the time, oh how his heart had sung.</p>\n<p>The dream does not offer him such comfort.</p>\n<p>It bleeds in still frame, each moment stretching into the next, Will's mind screaming at him to rise from the table, to leave before it's too late. His body refuses to obey, caught by invisible bonds, pinned in place by antler tines, a smile stretched across his face.</p>\n<p>Hannibal sweeps in from the kitchen.</p>\n<p>His smile is private, meant only for Will, as suggestive as it is predatory. Will's breath hitches. It is not fear that flutters his heart, nor nausea that twists his stomach. He watches Hannibal's approach, something like fondness swelling in his chest. He is caught in Hannibal's orbit, even now.</p>\n<p>When he wakes, it is this image that will send him scrambling for the bathroom.</p>\n<p>The plate set before him is artfully designed, a stunning masterpiece of creativity. Will acknowledges it as such. Hannibal's smile widens, grows purely genuine. He leans into Will's space, takes up Will's knife and fork, and cuts into the meat. A pool of scarlet fills the plate. Will licks his lips, opens his mouth, and allows Hannibal to feed him the first bite.</p>\n<p>As always, when Will wakes, it is with a strangled shout, the sheets beneath him drenched in sweat.</p>\n<p>It takes an inordinate amount of time to determine where he is, Will shaking and panting, his stomach churning with dread. The second he spots the open bathroom door, he lunges for it. He makes it to the toilet just in time to empty the contents of his stomach into it, then continues to vomit until there is nothing left, his body wracked by dry heaves.</p>\n<p>When it is over, he flushes the toilet, strips and then climbs into the shower.</p>\n<p>The hot water washes away the sweat and vomit, but the lingering echo of the dream remains, clinging to his skin like engine oil, sticky and slick where it's seeped into his pores. He scrubs at it until his skin is raw and red, prickling with heat, and then tips his head back beneath the spray, eyes firmly shut.</p>\n<p>When he opens them again, he is standing before a clouded mirror, the shower no longer running, a thick, oversized hotel towel clutched in his hand. He has to concentrate to trace his steps from there to here, desperately relieved to find he remembers turning off the water, stepping out onto the mat. Staring at the outline of his reflection, Will wraps the towel around his waist and then reaches for his toothbrush.</p>\n<p>He feels no more grounded coming out of the bathroom than he did going in. The bland homogeny of the hotel room offers no frame of reference, nothing he can use as an anchor. He spends several long seconds standing in the hall, staring at the bed, sheets a twisted mess, undoubtedly still damp. His bag is sitting on the luggage rack by the window, thick curtains drawn against the streetlamp that kept him awake half the night. He exhales sharply, crosses to his bag, and starts pulling on clothes.</p>\n<p>There is no point in lingering once he's dressed, so Will does a final scan of the room and then opens the door into the hallway. He is immediately confronted by more sameness. It stretches out in either direction, to his right an endless trail of paisley carpet, and to his left a neon red exit sign, its shadow scarlet upon the wall. Will blinks, steps over the threshold and then glances down to his feet.</p>\n<p>Hannibal Lecter stares up at him.</p>\n<p>It's a terrible photograph, Hannibal's mug shot capturing nothing of the man. Still, it's enough to steal his breath, threatening a new wave of nausea. Will's hand trembles as he bends to retrieve the hotel's complimentary paper, Hannibal's escape still front page news.</p>\n<p>He can't bring himself to read the particulars, however much he wants to, so he folds the paper in half, tucks it under his arm and then heads for the exit sign. Outside, there's a car parked directly under his window, two of Jack's agents inside. They were there last night, and will probably remain until Will decides to leave. Will ignores them entirely and heads to the front of the building, where Alana is waiting for him, engine idling.</p>\n<p>\"Good morning,\" she calls out the open window when she spots him. Will acknowledges the greeting with a single nod, and then moves around to the passenger-side door; climbs into the car. She waits until he's seated, seatbelt in place, to hand him a cup of coffee, steam curling through its escape hatch. Will accepts it with a grateful nod. He doesn't say anything until she's pulled them out of the parking lot and gotten them onto the freeway, heading away from Jack's office.</p>\n<p>\"Are we going somewhere?\" he asks, sipping at his coffee. Alana changes lanes.</p>\n<p>\"That depends on you.\" She maneuvers them behind a minivan. \"Jack's at the hospital. He wants you to see Hannibal's cell. I think he's hoping you'll get something from it. I told him I didn't think it was a good idea, but that I'd leave the choice to you.</p>\n<p>\"I would, however, just like to repeat that I don't think it's a good idea.\"</p>\n<p>Will can't help but bark a laugh at that, though it comes out an ugly, strangled sound. The thought of standing in the place Hannibal spent the last three years is almost as unwelcome as his dream. Alana glances over again, her gaze lingering a little longer than is probably safe. Will waves off her concern.</p>\n<p>\"Did they find Hannibal's accomplice?\" he asks instead of answering. Alana gives a brief shake of her head.</p>\n<p>\"No. An APB went out this morning.\"</p>\n<p>Will nods, unsurprised. Alana brings them back into the passing lane, her patience with the minivan obviously exhausted. It's a long way from Dumfries to Baltimore, and the route is entirely too familiar. Will can't count the number of times he left Jack's office, headed up the I95, bound for Hannibal's consulting room. It's too much, too soon, the reality of it suffocating.</p>\n<p>\"They're not going to find him. I told Jack that. And I'm not going to find anything in Hannibal's cell. He's too smart for that.\"</p>\n<p>He takes another sip from his coffee, frustrated, because Alana already knows this. Next to him and Abigail, she is probably the only other person Hannibal might have considered a friend.</p>\n<p>\"Jack doesn't want me there to trace Hannibal's steps. He wants word that I'm involved in the investigation to get out. He wants Hannibal to know I'm looking for him.\"</p>\n<p>He almost makes a quip about Freddie Lounds, but then remembers she's dead, that in all likelihood he consumed parts of her. This time when he laughs, it is a weak, self-deprecating thing, the full impact of his horror carried in its notes.</p>\n<p>\"Will,\" Alana says. She sounds terrified.</p>\n<p>\"I know. You object to Jack using me as bait. Can I ask if you have another idea, because I'm all ears.\"</p>\n<p>They're passing the exit to Wolf Trap as he says it, Will momentarily overwhelmed by a desire to return home.</p>\n<p>\"Just say it,\" Will says. She's never held back before.</p>\n<p>\"I know what Bedelia told you,\" she says, choosing her words carefully. \"But whatever you're thinking, please remember that he's dangerous. Hannibal deceived a lot of people, myself included, and I will never forgive myself for introducing him into your life. I don't want my mistake to result in your death, and giving Hannibal what he wants is dangerous, especially if what he wants is you.\"</p>\n<p>Will gets the impression she's been working on this speech for a while now, probably since he told her his plans. He wants to tell her that it isn't death he's afraid of--he doesn't think Hannibal will kill him. What he's worried about is not being able to do the job: of ending up in the exact same place as last time, unable and unwilling to pull the trigger because Hannibal is, and will always be, someone he can't seem to let go of.</p>\n<p>\"I'll be careful,\" he tells her before turning to stare out the passenger-side window, the forests of Virginia slowly giving away to civilization.</p>\n<p>~*~</p>\n<p>Hannibal's bed is immaculately made. He hasn't slept in it. Abigail lets her fingers trace over the soft cotton of the duvet cover. She gave him the master suite, the only bedroom with an ensuite. The bathroom is immaculate, too, though a thumb's-width of shampoo is missing from the bottle and a towel is missing from the rack. She doesn't find it in the hamper.</p>\n<p>The clothes she bought for him, hung neatly in the closet, coordinated by both colour and season, are also gone. So is anything else that might have indicated he was here. She makes another tour of the apartment, his absence only notable in that it isn't.</p>\n<p>He's left her instructions, of course, an entire year worth of carefully concealed correspondence ending with her an errand girl. She ought to be angry--ought to be furious--but the truth is it suits her purpose.</p>\n<p>She still closes the door to Hannibal's room on her way to the front door, where she pauses beside the full length mirror. She doesn't recognize herself sometimes, long hair drawn back into a bun, pale pink lipstick smeared across her mouth. The scarf she's tied around her neck has tiny purple flowers that remind her, faintly, of her mother. Abigail smiles at her reflection, and then bends to retrieve her bag, her purse; her father's knife. She steps out the door, bolting it carefully behind her. </p>\n<p>Hannibal has left her instructions, and Abigail is nothing if not reliable.</p>\n<p>~*~</p>\n<p>\n<i>The monotony of my present existence is broken only by the availability of reading material. The prison library is not large, the vast majority of its collection pedestrian and base. With each slick dust jacket that passes through my slot, I am again reminded of mankind's unworthiness. There are so very few who aspire to true art. I am incensed by those who pander to commonality.</i>\n</p>\n<p>\n<i>Occasionally, a gem will pass through my slot, the true greats of literature unread by my colleagues. The pages are stiff with disuse, the scent of lignin bursting from their pages. I treasure these as I have nothing else.</i>\n</p>\n<p>\n<i>There is nothing else.</i>\n</p>\n<p>\n<i>They do not permit me contact with the outside world: visiting hours do not apply to men like me. I begin to fear I have erred. Escape plays constantly in the back of my head--I have unfinished business outside these walls--but to orchestrate such a thing is presently beyond my control. It is no longer a matter of patience, the game now locked in stalemate. I shall remain here until my opponent stumbles. That or I gain an ally in search of a throne. This is my design.</i>\n</p>\n<p>For a long time, far longer than Will likes to admit, Hannibal occupied every corner of his brain. He lingered there, long after his arrest, Will requiring what amounted to an exorcism to banish him completely. And even then, it felt like he never left, a residual ghost haunting the corridors of his mind. Sitting in Hannibal's cell, perched on Hannibal's only chair, a copy of Goethe's <i>Faust</i> clutched in his hands, Will feels like he's drawn back the curtains, let Hannibal in entirely. Hannibal sinks eagerly into the darkest recesses of Will's mind; builds himself a fort.</p>\n<p>His presence is so overwhelming, Will trembles from it.</p>\n<p>He's no longer aware of the others--Jack and Alana and some guard he doesn't know, all of them standing on the other side of the glass wall, looking in. He's only aware of Hannibal, bent across his back now, breath ghosting the shell of his ear. Will shivers; leans into the touch.</p>\n<p>\"You're missing the big picture, my dear Will,\" Hannibal says in his ear, hands curling around Will's shoulders, nails digging into the flesh, sharp like talons. He inhales deeply. Will closes his eyes against the sensation.</p>\n<p>\"You couldn't have initiated this,\" he says, voice trembling. He opens his eyes; stares through the glass partition. Abigail is standing on the other side.</p>\n<p>The sight is so startling Will scrambles to his feet, knocking over his chair in the process. He blinks, Abigail vanishing, replaced by Jack and Alana, twin expressions of concern painted across their features. Will stares at them for several long seconds, then glances down to the book in his hand.</p>\n<p>He gestures for them to open the door. Alana is quick to obey. She rushes to his side. Will waves her off.</p>\n<p>\"She orchestrated this,\" he says without clarifying. \"She contacted him first, set all of this in motion.\"</p>\n<p>Jack beckons Will out of the cell and then starts them walking. Their prison escort leads them out of the cell block, Jack waiting until they're back in the administrative wing before asking, \"Who?\"</p>\n<p>Will, breathless from keeping pace, gestures, annoyed. \"Abigail. She contacted him from the outside, started making plans. Hannibal just took advantage of an opportunity.\"</p>\n<p>Jack nods, more than willing to accept Abigail's involvement. \"Except,\" he says, \"Hannibal wasn't permitted outside communication. No phone calls, no computer access, no letters. The only visitor he saw outside psychologists and federal agents was Bedelia, and then only because she was his shrink.\"</p>\n<p>A couple of nurses pass the spot where they're standing, Jack gesturing them further into the corner, positioning them near a set of doors that lead out into a courtyard. <i>Employees only</i> is embossed on the glass. Will shakes his head.</p>\n<p>There are many times Will wishes just once someone would keep up with his thought process. It's easy enough to make these leaps of logic; almost impossible to explain. He gestures somewhat frantically, the book from Hannibal's cell still clutched in his hand.</p>\n<p>\"He did have outside communication. Books. And whoever was delivering them was also delivering some additional correspondence. This is Abigail, Jack. This is all her.\"</p>\n<p>He can sense Alana watching him: knows she's never been fond of the theory Abigail is anything other than a broken, traumatized young girl. He knows what she's going to ask even before she says it.</p>\n<p>\"Why?\" she says. \"What could she possibly gain from this?\"</p>\n<p>Will shakes his head, swallowing a wave of nervous laughter. \"I don't know,\" he tells her, the lie heavy on his tongue. In truth, he knows precisely why she did this. He understands it entirely too well.</p>\n<p>\"Let's say you're right,\" Jack begins, oblivious to the walls closing in around them. Alana notices, though only because she knows Will exceptionally well. She steps forward, reaching out towards him, but before she can make contact they're interrupted by the sharp trill of a ringing phone. Will flinches violently when he hears it.</p>\n<p>It takes him a second and third ring to realize the sound is coming from him. Will fumbles to answer it.</p>\n<p>\"Yeah,\" he says into the receiver, well aware that both Jack and Alana are watching him intently. He doesn't bother telling them it's probably only his vet; that he doesn't have anyone else who'd think to call.</p>\n<p>There is a long moment of silence from the other end. Will glances briefly to the employee door, half tempted to seek better reception outside. It turns out he doesn't have to, the silence broken when his caller clears their throat. Will's stomach drops out from under him.</p>\n<p>\"Abigail?\" he questions, drawing both Jack and Alana's full attention. Alana's colour drains. Jack pulls out his cell.</p>\n<p>\"Hello, Will,\" Abigail says. She sounds strangely distant. Will half expects to find he's dreaming.</p>\n<p>\"Where are you?\" he tries, because maybe word hasn't gotten out yet, maybe she's realized her mistake and is reaching out to him. Maybe there's a chance for them both.</p>\n<p>\"You won't find me, not yet,\" she tells him, and Will understands then that neither of them ever had a chance. \"But you know where he is. He's waiting for you, Will. And you and I both know he doesn't like to be kept waiting.\"</p>\n<p>She hangs up then, the resulting silence as abrupt as it is unexpected. Will curses, says Abigail's name twice before conceding defeat. He checks the call display, but the number is unlisted. Jack, when he glances over, shakes his head.</p>\n<p>\"You were saying,\" Jack says.</p>\n<p>For the first time in a really long time, Will lets himself crumble.</p>\n<p>\"Jack, give him a minute.\"</p>\n<p>She doesn't bother checking her tone, her anger--her frustration--seeping through. This isn't the first time she's had to step in as Will's protector, and it won't be the last. Jack has a tendency to overstep bounds, and always to Will's detriment. He may think he's doing the right thing, that public safety trumps Will's fragile emotional state, but as a psychologist--and more importantly, as Will's friend--Alana knows that's bullshit. She's seen Will broken once before. She's not about to let that happen a second time.</p>\n<p>\"I need to know what Abigail told him,\" Jack says, fierce determination in his gaze. Alana's half afraid she's going to have to do more than block his path. She's only grateful Will has retreated outside, into the employee courtyard.</p>\n<p>\"And he will tell you, but give him a minute to process this.\"</p>\n<p>She understands Jack's frustration, she does. She feels it herself. Jack wasn't the only one Hannibal manipulated. He made fools of them all, and while she doesn't want to admit Abigail is capable of something like this, it's starting to look more and more like Hannibal wasn't the only one.</p>\n<p>\"We,\" Jack says, leaning into her space--and if it was anyone else, Alana might have considered shying away, but because it's Jack she stares him down, unflinching in the face of his irritation. \"Don't have the luxury of time.\"</p>\n<p>The sad part is he's right. The longer Hannibal is out there, the harder he'll be to catch. And as much as she hates to admit it, Will is probably their only chance of finding him.</p>\n<p>\"Fine,\" she relents, \"but let me talk to him.\"</p>\n<p>For a moment she thinks Jack might stand his ground, but after a minute his features soften, exasperation replacing frustration. He gives a brief nod, and then steps back, already pulling out his phone. Alana breathes a sign of relief and then heads outside.</p>\n<p>She finds Will standing in the middle of the courtyard, arms wrapped around his waist, his shoulders slumped forward. He has his back towards her, but turns when he hears her approach. She sees in his gaze the numb horror of defeat.</p>\n<p>\"It was her,\" he says, so quietly Alana has to strain to hear.</p>\n<p>\"You're sure?\" she asks. Will nods. \"What did she say?\"</p>\n<p>It's warm in the courtyard, the August air humid, but Will is trembling, barely suppressed shiver running through his core. She's struck with the sudden impulse to bundle him into her arms.</p>\n<p>\"She said,\" Will begins, mouth twisting into a parody of a smile. \"That I wasn't going to find her. Not yet.\"</p>\n<p>He looks at her then, really looks, Alana struck with just how little she now knows him. He seems ethereal, like she's staring at a ghost, this Will a shell of his former self. How much, she wonders, is that Hannibal's doing?</p>\n<p>\"All this time,\" he says, \"I thought she was the only person clever enough to see him for what he was. Everyone thought she was dead--they thought he killed her--but I knew she was still alive. I <i>knew</i> she'd gotten away. That she was smarter than all of us. She got away, and now...\" He trails off, features crumpling.</p>\n<p>\"Now you're having trouble understanding why she did this,\" Alana finishes for him.</p>\n<p>Will shakes his head. \"I know why she did this.\"</p>\n<p>She wants to ask--wants to understand because she doesn't--but this isn't about Abigail. For now the only person she needs to understand is Will. He's not making it easy.</p>\n<p>\"You're worried, because if, after all that time, he can still manipulate her, then there's a chance he can still manipulate you,\" she tries. She feels like she's seeing him as he was in the hospital, jagged cut down his thigh, its edges held together with neat black sutures. She hasn't seen the wound since; has no idea how cleanly it healed, how ugly the scar.</p>\n<p>Will shakes his head, again, frantic desperation in his eyes.</p>\n<p>\"I'm worried,\" he says, sounding surprisingly calm, \"that I want him to.\"</p>\n<p>Alana doesn't have an answer for that. She's not sure one exists, and Will is still watching her like he half expects her to turn away in disgust. Instead she smiles, sympathetic, and then takes a step forward, placing a hand on his arm.</p>\n<p>\"Come on. Let's worry about catching Hannibal first. We'll worry about the rest later.\"</p>\n<p>Will nods, but it still takes entirely too long to coax him from the courtyard; even longer to get him out to the parking lot, where Jack is standing next to his SUV, phone still cradled to his ear. He hangs up when he spots them.</p>\n<p>Against her better judgement, she leads Will to his side, strategically positioning herself between them. Never one for tact, Jack charges in as soon as they're within earshot.</p>\n<p>\"I want to know every word she said,\" he says.</p>\n<p>\"Jack,\" Alana scolds, but before she can lecture him on Will's fragile mental state, Will steps around her, answers Jack without hesitation.</p>\n<p>\"Apparently he's waiting for me, and I know where to find him,\" he says, sarcastic bite to his words. Alana glances over, surprised. Will didn't tell her that part.</p>\n<p>\"And?\" Jack presses. Will shrugs. He doesn't look particularly upset. Not like he did in the courtyard.</p>\n<p>\"I don't know what she meant. I don't know where Hannibal is, and I don't know where he expects me to find him. I haven't seen or spoken with him in three years. The last time I did? He stuck a linoleum cutter in my leg and tried to kill me.\"</p>\n<p>She knows that's not precisely true. She's read the report; seen the medical files. If Hannibal wanted Will dead, Will would be dead. She doesn't tell Jack that. Neither does Will.</p>\n<p>\"Clearly,\" Jack says, refusing to back down, \"that's not what Hannibal thinks. So if there's a chance, however small, that you've got a location rattling around in that brain of yours then we need to get it out.\"</p>\n<p>\"Jack,\" Alana says, a warning, but Will overrides her with a barked laugh.</p>\n<p>\"And how do you propose we do that?\"</p>\n<p>Jack doesn't seem to have an answer for that. He glances in her direction, slightly helpless. Alana shakes her head. She doesn't want to have this conversation: doesn't want to give him the satisfaction. It's only when she catches sight of Will, looking as lost as he does hopeful, like maybe Alana holds the key to unravelling something he can't seem to solve, that she relents. She's not particularly happy about it.</p>\n<p>\"It is entirely possible Hannibal implanted a suggestion into your subconscious, but it's more likely you already know and have blocked the information. Retrieving it is possible, with the right techniques, but there is still the chance--a very good chance--Hannibal simply over-estimated the importance of a location. It would probably be easier--and faster--to make a list of places you associate with him and then have us search them all.\"</p>\n<p>Will shakes his head. \"He's too smart for that. He wouldn't make this easy.\"</p>\n<p><i>No</i>, she doesn't say. <i>He'd leave a trail of bodies only you could follow.</i></p>\n<p>\"Will's right, but it is a start.\" He glances at Will expectantly. Will rolls his eyes before rhyming off a list.</p>\n<p>\"Your office, which I think we can discount. My old class room, which again, we can discount. Hannibal's consulting room; his dining room...\" He makes a face at that. Alana can't really blame him. How often did she dine at Hannibal's table. God knows what he fed her.</p>\n<p>\"Hannibal's old property belongs to a lawyer now. It's already under surveillance,\" Jack says, gesturing for Will to continue.</p>\n<p>Will nods. \"There's my property in Wolf Trap. My new place, if he has the address. Hell, he took me to the opera once,\" he says, flushing slightly when he does. Jack doesn't appear to notice.</p>\n<p>\"So it's a big list. Anyway to narrow it down?\"</p>\n<p>Will shakes his head, minutely, but Alana can tell he's growing frustrated.</p>\n<p>\"Like Alana said, there are psychotherapies that would probably expedite the process.\" He pauses then, considering. \"Hypnotherapy might help.\"</p>\n<p>Will shrugs after that, Jack nodding to himself, like he's more than willing to play with Will's fragile psyche if it means getting what he wants. She wonders if he sees the irony; if he even knows how much of the damage done to Will rests on his shoulders--on all their shoulders--and not just Hannibal's.</p>\n<p>\"I want to go on the record as saying I'm against this,\" Alana says, now a good a time as any to object. She doesn't bother giving her reasons--Will already knows them, and Jack won't care--but she does stand her ground, hoping Will might see the sense in her words. She's not particularly surprised when he doesn't.</p>\n<p>\"So we need to find someone else then,\" is all he says, looking to Jack.</p>\n<p>\"I can probably convince Bedelia,\" Jack answers, pulling out his phone and turning back to the car. Will waits until Jack's out of earshot to turn towards her, his expression apologetic.</p>\n<p>\"Look, before you say anything,\" he says, his eyes dimming with something she thinks might be regret. \"I know this is a stupid idea. I know there are risks involved, but I need to do this. I need to know if this is him, or something else. I just...\" He gestures then, somewhat absently. \"I need to understand.\"</p>\n<p>There's not much she can say to that, however much she might like to, so instead she nods; doesn't object when he turns to leave. She waits until he's safely inside Jack's SUV before seeking her own car, Will's empty coffee cup still sitting in the tray.</p>\n<p>~*~</p>\n<p>There are obstacles to his plan--and Will's not entirely sure his plan is even sound, because while Jack is willing to do just about anything to move the investigation forward, Alana has made it abundantly clear that she disapproves entirely. Mostly, though, aside from the crippling doubt that he's once again gone off the deep end--or worse, that he wants to find Hannibal for all the wrong reasons--his obstacles come down to a matter of practicality.</p>\n<p>Namely, can they trust anything Bedelia pulls out of his head?</p>\n<p>He hasn't been to see a therapist since Spring Grove, and while he's not particularly looking forward to having Hannibal's shrink poking around in his head, he has to admit the idea is sound. Try as he might, he has no idea what Abigail meant--what Hannibal wanted him to get from the message. Without someone to lift the veil, they're searching for a needle in a haystack.</p>\n<p>Jack pulls them to a stop on the street out in front of Bedelia's house. The place is no longer crawling with agents, but there's an unmarked car down the street and another one parked in the driveway. Will suspects, if he went around back, he'd find two more hidden in her bushes. He could have told them Hannibal wouldn't come back here.</p>\n<p>He's not entirely sure he wants to be back here. He still hasn't really processed their last conversation.</p>\n<p>\"Are you ready for this?\" Jack asks, sounding concerned. Will wonders what he'd do if Will told him he wasn't.</p>\n<p>\"Ready as I'll ever be,\" Will says, and then climbs from the car. Alana, who's followed in her own vehicle, meets him on the sidewalk.</p>\n<p>She looks like she wants to say something--probably another objection--but instead shakes her head, like she knows Will's already anticipated all of her arguments. Will still offers a slightly apologetic smile. They wait for Jack to reach them before approaching the house. Bedelia is waiting for them, framed inside her open door.</p>\n<p>For a brief of moment, Will swears he can see the red and white pulse of ambulance lights reflected against the side of her house.</p>\n<p>\"And here I was hoping my part in this investigation was over,\" Bedelia says when they reach her. She offers a hand to Jack, who takes it readily, his smile soft and friendly.</p>\n<p>\"We do appreciate you doing this,\" he says. Bedelia nods; glances to Will.</p>\n<p>It feels like she's flaying him open; her eyes pinning him in place, dissecting him as easily as Hannibal once did. Will shifts under the scrutiny: understands why Hannibal held her in such high regard. Strangely, the prospect of letting her into his head isn't quite as horrifying as it was on the drive over.</p>\n<p>\"Well, come in then,\" Bedelia eventually says, nodding over her shoulder. She turns before they can answer, leading them to the consulting room, the carpet still displaced where Will fainted not thirty-six hours before. Will very intentionally chooses the couch this time, positioning himself in its middle. Bedelia claims her usual chair, Alana taking the extra seat.</p>\n<p>Jack, to Will's relief, stays out in the hall. He closes the door behind them.</p>\n<p>\"Just so you understand,\" Bedelia begins. Will places his hands on his knees, suddenly unaccountably nervous. \"This probably isn't going to work.\"</p>\n<p>She glances between them then, stern and poised and perfectly polished. Only then does Will take in her pressed pantsuit; her artfully styled hair. In an instant he is transported, once again seated in Hannibal's consulting room, Hannibal staring at him from the second chair. The space between them grew shorter each session. In Will's memories, their last sessions had them sitting knee-to-knee. When Will inhales, he swears he can taste the lingering spice of Hannibal's aftershave.</p>\n<p>\"This would, in fact,\" Bedelia continues, \"be more likely to work if it was done with someone you trusted.\"</p>\n<p>She glances pointedly at Alana then, but Alana shakes her head.</p>\n<p>\"I can't,\" she says. Bedelia nods, as though unsurprised.</p>\n<p>She turns back to Will, trapping him like a bug between two panes of glass. The uneasy weight of her gaze is achingly familiar. Her similarities to Hannibal don't just extend to her manner of dress. Everything about her, including the exacting detail of her home, is familiar.</p>\n<p>\"He didn't just respect you as a psychiatrist,\" Will says, speaking now as a profiler. \"He modelled himself after you. That's why he came here. That's why he didn't kill you.\"</p>\n<p>Bedelia continues to stare, but Will can sense her curiosity. \"Are you here to psychoanalyze Hannibal, or are you here to access repressed information?\" she asks.</p>\n<p>Will arches an eyebrow. \"For me that might amount to the same thing.\"</p>\n<p>It is easier, he's found, having someone to bounce ideas off. Hannibal always inspired his best leaps--facilitated easy connections--which was part, Will realizes, of why he so thoroughly enjoyed Hannibal's company. As horrifying as it is to admit, Hannibal brought out the best in him. Sitting here now, seeing him in Bedelia's gaze, Will again feels that connection. It's muted, a dim spark where Hannibal burned like the sun, but it's there.</p>\n<p>\"He liked sophistication,\" Will continues, both Bedelia and Alana listening intently. \"But that's not it. He was a showman, all of this his stage. He wanted to convey grandness.\"</p>\n<p>He is no longer, he realizes, speaking as a profiler.</p>\n<p>\"He'll use subterfuge that way. He knows we'll discount places he used to frequent--here, his house, the opera--but he also knows we'll discount diametric opposites. He won't return to a scene of a crime, not because he'll fear getting caught, but because they don't pertain to me.\"</p>\n<p>He pauses then; glances to the door where Jack is undoubtedly listening. \"If this was about Jack he might go to the observatory, but it's not, and none of his bodies were specifically for me, so...\"</p>\n<p>It's frustrating, the answer so close and yet still completely out of reach. Will snarls; runs a hand through his hair.</p>\n<p>\"Why don't we try an exercise,\" Bedelia says, not at all what Hannibal would have done. He would have pushed, inserted his own theories until, whether right or wrong, they would have steered Will in the right direction.</p>\n<p>Still, Will nods; sinks back into the couch.</p>\n<p>\"I want you to listen to the sound of my voice. Block everything else out. There is only you and I and the sound of my voice. You can close your eyes if you like, and if, at any point, you begin to feel uncomfortable, I want you to raise your right hand and I will talk you out.\"</p>\n<p>He told Jack once that psychotherapy didn't work on him, and he meant it--maybe even means it still, despite evidence to the contrary--so it takes far longer than he wants for Bedelia's words to wash over him. He does close his eyes, though mostly to block out external stimuli. He focuses his attention, not on what Bedelia is saying, but on the cadence of her voice, its soft tones a single point of calm in the raging sea that is his mind.</p>\n<p>\"For the moment,\" Bedelia continues, \"I want you to simply drift. Let your thoughts dissipate into nothingness. There is only the sound of my voice.\"</p>\n<p>Will does as instructed, pushing away wave after wave of thought, Bedelia's voice a calm pool towards which he rows his tiny boat.</p>\n<p>\"I want you to think back to your time with Hannibal. I don't want you to concentrate on a specific memory--push those aside--but I do want you to concentrate on a time when you felt safe. When you open your eyes, I want you to tell me where you are.\"</p>\n<p>Will does as instructed, concentrating on the linear path of their relationship, the resulting emotions that played along its line. It's a little like watching a freight train steam steadily towards an abyss. Will knows what's coming and yet is powerless to stop it.</p>\n<p>When he opens his eyes, he's standing in Hannibal's dining room.</p>\n<p>\"An East Indian dish,\" Hannibal says, his smile crooked, his eyes dancing somewhat merrily. He is entirely too pleased with the pun. It is not at all the memory Will is searching for, so he closes his eyes, sets the train back on the track, and lets it steam towards the abyss a second time.</p>\n<p>This time when he opens his eyes, he's stretched out in Hannibal's consulting room, feet propped on the far end of the couch, his head pillowed in Hannibal's lap. Hannibal is petting his hair, like he might a child or beloved pet.</p>\n<p>\"You complicate things because to approach the obvious would be too simple. It would force you to confront who and what you are, and that still terrifies you. I know you, Will. Better than they do, and this is not you. It's never been you.\"</p>\n<p>Hannibal punctuates the point by leaning forward, placing a feather-light kiss across the ridge of Will's brow. Will's eyes fly immediately open, the warmth of Hannibal's thighs vanishing beneath him, Will once again finding himself seated on Bedelia's couch.</p>\n<p>Except, sitting across from him, staring at him from Bedelia's chair, is Garrett Jacob Hobbs, his head wreathed in a crown of antlers.</p>\n<p>\"Will?\" Bedelia says, speaking through Hobbs' mouth. \"Tell me what you see.\"</p>\n<p>\"I'm sorry,\" Will says, shaking his head. \"I don't think this is working.\"</p>\n<p>He stands then, Hobbs still watching him intently. Alana is poised to rush to his side. Will swallows a mouthful of bile and, as politely as he can given the circumstances, asks, \"Where's your bathroom? I think I might be sick.\"</p>\n<p>Hobbs, without breaking eye contact, lifts a dead hand and points towards the consulting room door.</p>\n<p>\"First left as you come through the door,\" he says. Will nods, grateful. He waves off Alana's concern and then stumbles from the room. The hall outside is empty. He almost doesn't make it to the bathroom in time.</p>\n<p>~*~</p>\n<p>\"What the hell do you mean you lost him?\" Jack shouts. Bedelia's starting to understand what Hannibal saw in Will. He is certainly the most interesting person she's met in a long time. There are at least three papers currently swimming around in her brain. She wonders if Hannibal would kill her for writing them. Probably, she decides.</p>\n<p>\"He asked to use the bathroom, Jack,\" Alana says, standing toe to toe with the man, a feat that immediately earns her Bedelia's respect.</p>\n<p>\"And you just let him go?\"</p>\n<p>They're arguing nonsense now, of course, frustration manifesting as a screaming match. This is precisely why she never offered couples' counselling. She leaves them to it, their shouting growing distant the farther into the house she gets. By the time she reaches the kitchen, she can barely hear them. There are six agents stationed outside her house, and none of them saw Will Graham exit her home. It does wonders to reassure her of her safety.</p>\n<p>She takes her time filling a glass of wine--it's late enough in the day for it--and then wanders back to where Alana and Jack are still shouting at each other. She pauses just outside their circle.</p>\n<p>\"Whatever memory we triggered, he's gone after him,\" she says, which earns both their attention. The silence is blissful. \"Whether he's gone to arrest him, kill him, or join him remains to be seen.\" She smiles then, as polite a dismissal as she's willing to make. Jack looks somewhat like a gasping fish.</p>\n<p>\"And you don't know where,\" he presses.</p>\n<p>Bedelia shakes her head. \"Dr. Bloom was present for the entire session. Whatever revelation Will Graham experienced, he didn't share it with us.\"</p>\n<p>She'd give anything to know what it was--for more than just a glimpse inside his head. There are very few cases when the madness outweighs the man. Hannibal Lecter was one such case. She wagers Will Graham is another.</p>\n<p>To Alana and Jack, she offers a sympathetic smile.</p>\n<p>She knows this stretch of road like the back of her hand; could drive it blindfolded. Her father taught her to drive on these roads, away from the traffic in the city, miles of back country lanes hers for the taking. The first time she shifted without grinding gears, he smiled; patted her affectionately on the top of her head. She swelled with pride.</p>\n<p>That was a long time ago, her fifteen year old self unaware of the demons lurking inside her father's head. She thought then only of pleasing him, of one day rising to stand as his equal, her father her idol. Learning to drive his truck was like learning to shoot his gun. She wanted only to earn his respect and admiration. Funny how that turned out.</p>\n<p>She's lost track of how much time has passed since she contacted Will, gave him Hannibal's message. She was ill-prepared for hearing his voice, the worry in his tone creeping beneath her skin, settling there like an itch she can't seem to scratch. Even now, five states away, his panic echoes in her head, threatening to undo all her meticulously laid plans.</p>\n<p>The problem, she thinks, is that she never really knows where to draw the line with Will. Hannibal is easy. His line is marked in thick black ink, impossible to erase. Will's line, on the other hand, is done in faded pencil, drawn with an unsteady hand. She hasn't decided yet if she's looking forward to seeing him.</p>\n<p>She has time.</p>\n<p>It's still the middle of the night, dawn a few hours off and Will at least twelve behind. She's been driving pretty much non-stop since she got off the phone, and the day is starting to catch up with her. It leaves her feeling disconnected and impossibly light, like she drank some of Hannibal's tea and is now drifting outside her body. She needs a clear head for dealing with Hannibal--and he will be angry with her--so when she passes through the next town, she starts shopping for motels.</p>\n<p>They're not hard to find, Minneapolis close enough to warrant the urban sprawl of civilization. She pulls into the first one with a neon-red <i>Vacancy</i> sign. It's one of those squat motor-courts, lines of identical doors, cars parked outside the occupied rooms. It's the kind of place her father would have liked: discrete and out of the way, as inexpensive as it is unmemorable. Abigail pulls up to the office and then sits with the engine idling, undecided.</p>\n<p>She's half tempted to pull back out onto the road, find something a little more upscale. She's grown used to living in slightly better conditions, Hannibal's money making her life very easy. Her father, if he knew, would no doubt scold her for rising above her station. He took such pride in humility.</p>\n<p>It is not, however, her father's disapproving stare that gets her out of the car, but rather, the knowledge that Hannibal would never think to stop at such a place. This is her father's hotel, maybe even Will Graham's hotel, but it is never Hannibal's. She rather likes the idea of spending his money on something he would so thoroughly abhor.</p>\n<p>Inside the office, obnoxiously bright, Abigail has to ring the bell three times before someone shuffles out of the back room. He's an older man, wearing a pair of casual track pants and a white t-shirt, both surprisingly clean for somewhere that advertises rooms by the hour. He blinks across the counter at her, then pulls out a ledger; slides it across. Behind him, through the still-open door, a television set flickers in the background. She catches a brief glimpse of Hannibal's mug shot.</p>\n<p>\"Rooms are $63 for the night, and I need a major credit card,\" the man says. He's eyeing her suspiciously, like he's half expecting her to cheat him of his money. Abigail smiles; reaches into her purse.</p>\n<p>She hands across a card, and the money, taking special care to sign in under the name on the card. The man waits until she's finished and then scrutinizes both her signature and her money. Abigail continues to smile. She feels a little weightless.</p>\n<p>\"Room 3, down at the end,\" he eventually says, handing her over the largest key she's ever seen, tacky plastic green keychain announcing the corresponding room number. Abigail offers her thanks, pockets the key and then heads out to move her car.</p>\n<p>The room, when she finally makes it inside, is everything its keychain promised. The wallpaper is circa 1970 and the bedspreads haven't been replaced since at least the 1980s. Twin sconces on either side of the bed flicker, casting an unattractive orange glow across the room. It makes the carpet--worn shag that she thinks might have once been the colour of pea soup--look like earth. Her only consolation is the sharp scent of bleach still lingering in the air.</p>\n<p>Abigail bolts the door, then crosses to sit on the edge of the bed, the mattress squeaking beneath her.</p>\n<p>She's hit that point of exhaustion where dreams and reality blur together, Abigail too tired to do anything save stare across the room. There's a tiny motel table pushed up against the window, twin plastic orange chairs pushed beneath it. In her mind, she sees her parents sitting at the table, Styrofoam coffee cups hovering near their mouths. There's a map spread between them, her mother pointing out attractions, her father arguing about making good time. Her mother wins--she always did--and when Abigail giggles her father glances over; offers a sly smile.</p>\n<p>The smile shifts into something less pleasant, Abigail recoiling. She closes her eyes against the image, and when she opens them again the table is empty, her parents gone. She shakes her head, but the table remains empty, so she toes off her shoes and crawls up the bed to sprawl across the covers. Between one breath and the next she is asleep, though not before her father presses a whisper-soft kiss to the centre of her brow.</p>\n<p>Even in her dreams she cannot escape him.</p>\n<p>~*~</p>\n<p>\"I need more than we're looking,\" Jack says.</p>\n<p>Beverly's doing her best to stay out of it. She can't remember the last time she saw Jack this angry. Probably the last time they were hunting the Ripper, if she's honest. Not that she doesn't understand--of course she does. Will disappearing like this? It adds insult to injury.</p>\n<p>\"It would help if we had an idea of why he took off,\" Zeller comments, which earns him one of Jack's glares. No one is thinking clearly at this point. They've been at this all night.</p>\n<p>Beverly takes a sip from her coffee. It's her third in as many hours.</p>\n<p>\"We don't know,\" Dr. Bloom answers, because aside from Jack barking for answers, she's the only person with anything relevant to add to the discussion. Beverly likes her--doesn't know her as well as she'd like, but she likes her. Anyone who can stand toe-to-toe with Jack's bad mood automatically deserves her respect.</p>\n<p>\"We know Dr. Du Maurier was trying to help Will access repressed memories,\" Bloom says, not for the first time. They've been over this already, twice at this point. Beverly understands the importance of re-hashing what they know, but God does it bore her.</p>\n<p>\"Yeah, we got that,\" Price interjects, apparently just as frustrated. \"He freaked out, climbed out a bathroom window, stole your car and disappeared.\"</p>\n<p>He holds up a hand as soon as he says it, silent apology made in Jack's direction. If they don't get a lead soon, Beverly's willing to put money on this meeting ending in violence.</p>\n<p>\"About that,\" Zeller says, because once Price gets started it's impossible to keep Zeller contained. The pair of them are worse than a couple of school kids. \"How exactly did he manage to get past four agents and steal an FBI consultant's car?\"</p>\n<p>Beverly winces, and then glances in Jack's direction. Any minute now someone's going to cross his line and he's going to explode. She doesn't particularly want to be here when that happens, but it's starting to look less and less like she has a choice. Unsurprisingly, Jack looks about as murderous as one would expect. Certainly he's an interesting shade of purple.</p>\n<p>\"Are we releasing Abigail's image to the media?\" she hears herself ask. It's the first time she's spoken in probably an hour, but it has the desired effect, getting the conversation away from dangerous territory and back on track.</p>\n<p>It's Bloom who answers.</p>\n<p>\"We've thought about it,\" she says. \"But doing so might endanger Will.\"</p>\n<p>\"And?\" Zeller asks, because the man does like to push his luck. Beverly makes a mental note to kick him in the shins the next time they're alone.</p>\n<p>To her surprise, Jack responds with far more civility than she would have given him credit for. She knows he's heard the rumours--knows he's perfectly aware of the things said behind his back. Will Graham was an unstable agent who shouldn't have been in the field. Bringing him in to consult on a personal case was ill-advised. Zeller wasn't the only one to question Jack's objectivity.</p>\n<p>\"And,\" Jack says, \"Will Graham is a retired federal agent, who we will do our utmost to protect. Do I make myself clear?\"</p>\n<p>Zeller spends at least half a second staring him down. Beverly can almost see the wheels turning in his head, arguments forming on his tongue. Whatever fight he has in him vanishes when Jack arches an eyebrow. It's like watching a couple of dogs fight for dominance. In no universe was Zeller ever going to win.</p>\n<p>Jack doesn't even bother acknowledging his victory. He simply turns his attention back to the group.</p>\n<p>\"We are working under the assumption Du Maurier triggered a psychotic break. It is entirely possible Will has gone after Hannibal on his own, which means we're back to square one: finding Lecter,\" he says.</p>\n<p>Easier said than done, Beverly thinks, turning to stare at Jack's white board. Hannibal Lecter's photograph occupies the lead position, beneath it Abigail Hobbs and now Will Graham. She stares at the triangle they make, wishing then she had a body--something, anything with hard evidence. No one says the thing she knows everyone is thinking: that it is entirely possible Will didn't go after Lecter with the intention of bringing him in.</p>\n<p>\"We don't have any proof Abigail Hobbs is involved in this,\" she says, almost to herself. Alana Bloom moves to stand at her side, staring at the same triangle.</p>\n<p>\"No, only Will's word that she called.\"</p>\n<p>Beverly nods. \"What if she wasn't expecting him to tell us. What if she thinks we have no idea she's even alive.\"</p>\n<p>Movement at her shoulders resolves into Jack, he too coming to stare at the board. \"What are you thinking?\" he asks.</p>\n<p>\"We discounted obvious places, but what if that's the point. What if Will was right. What if she really is the key to this?\"</p>\n<p>She glances over then, watching Jack process what she's suggesting. She sees the minute it hits him, his eyes widening, ever so slightly. He turns and points to Zeller.</p>\n<p>\"Get on the phone. Find out what happened to the Hobbs' residence in Minneapolis. Then put out a bulletin with the local PD for Dr. Bloom's car. Locate and report only.\"</p>\n<p>Eager to do something that's not sitting around spinning their wheels, Zeller springs into action.</p>\n<p>\"I don't know, Jack,\" Bloom says, just when the room's starting to feel a little festive. Bloom looks entirely too pensive. \"It just seems a little obvious. Hannibal is smart. He's not going to make mistakes.\"</p>\n<p>Beverly feels like she's caught between them now, Jack and Bloom having their own private conversation, however much she initiated it. She turns in time to see Jack shake his head.</p>\n<p>\"Hannibal's also a showman, and he likes to taunt us. Hiding in plain sight, in the one place we would dismiss? Sounds like him, doesn't it?\"</p>\n<p>Bloom shrugs, not quite sold on the idea, but Beverly can tell she's warming up to it. There is, of course, a good chance they're wrong, but given that it's the first lead they've had in hours, Beverly's willing to take it.</p>\n<p>\"Jack's right,\" she says, pointing to a circle on the map, the place they found Will's discarded cell. \"He's heading in the right direction.\"</p>\n<p>Jack gives Bloom a pointed look, but all she does is nod, reluctant acceptance. Beverly takes it as permission to jump into action.</p>\n<p>\"I'll book us some flights,\" she says, and then extracts herself from between them. She doesn't look back; doesn't want to know if Bloom's doubt will sour Jack's mood. Mostly, she's just happy to have something to do. Besides, if she's lucky, she might get a chance to sleep on the plane.</p>\n<p>~*~</p>\n<p>There's ringing in his ears that hasn't stopped since he climbed out of Bedelia's bathroom window.</p>\n<p>He's still fuzzy on the details after that, his memory of the last twelve hours hazy and ill-shaped. He knows where he's going, but that doesn't make how he got here any clearer. Alana's car is a dream to drive.</p>\n<p>He laughs at that, a little hysterical because it's the stupidest thing he's thought in hours. He can't tell if that's lack of sleep or insanity--and he worries a lot about that, because it doesn't seem to matter how far he comes, how far he gets from the institution, he will never truly believe he is free of it. This, he realizes, is a test, his chance to put the past behind him and make things right, maybe take that first step towards closure.</p>\n<p>Which is almost as comical a thought as Alana's car, so he laughs again, this time low and just a little bit desperate. It echoes around the car, amplifying once it hits the backseat so that Will can't help but glance in his rear view mirror, expecting then to see a copy of himself, worn and faded like paper submersed in water.</p>\n<p>Instead he finds himself staring into Garrett Jacob Hobbs' dead eyes.</p>\n<p>It practically sends him careening off the road, Will slamming on the brakes, the car fishtailing. He swerves towards the soft shoulder, the only thing keeping him from pitching into the ditch blind luck. Shock has displaced him from time. He feels like he's running parallel to it, everything happening in slow motion, Will an outside observer. He slowly releases his grip on the steering wheel, blood rushing back into his knuckles, chasing away the white, then glances back to the rear view mirror. Hobbs is smiling at him.</p>\n<p>Even knowing it isn't real, Will still scrambles for the glove box, where he knows Alana keeps a P89.</p>\n<p>The gun is strapped down with Velcro, the clip out. It takes him entirely too much time to retrieve it, get it loaded and point it at the backseat. By the time he does, Hobbs is gone.</p>\n<p>\"My name is Will Graham,\" he says, scanning the backseat and finding nothing. \"It is sometime after six am, and I am somewhere in Wisconsin.\"</p>\n<p>The exercise doesn't make him feel any better.</p>\n<p>Still, he slowly lowers the weapon, setting it on the seat next to him instead of putting it back where he found it. He scans the interior of the car, then steps out into the chilled pre-dawn air.</p>\n<p>It's like dousing himself in cold water, Will instantly awake. This is a dark, lonely stretch of road, and he is utterly alone. Lines of trees and open expanses of brush surround him, the wilderness entirely too vast in the low light of dawn. He leaves the driver's side door open and makes a slow circuit of the car, getting back to where he started without finding anything.</p>\n<p>He's tempted then to call Alana--not Jack, he doesn't need Jack breathing down his neck right now--except she's not the person he wants to talk to and he's pretty sure he ditched his cell somewhere outside Baltimore. The person he wants to talk to is still a couple hundred miles away, and while he has every intention of arresting Hannibal when he finds him, the association is still there, imprinted on his psyche as surely as a brand. He has never known that level of intimacy--not before and not after--and despite all his best efforts, he still feels that tug: still misses the regal warmth of Hannibal's consulting room.</p>\n<p>He forces down the thought, because what he's doing is hard enough without the underlying guilt he feels every time he contemplates betraying Hannibal, like what Hannibal is doing is just and he's the one in the wrong. Slowly, he gets back into the car, checking the backseat one last time before pulling back out onto the road.</p>\n<p>He sticks to the back roads, avoiding civilization at all costs. He has no idea if Jack's put out an APB for him; if he's being hunted like a wanted man. He knows what this looks like, knows there are plenty inside the Bureau who still think he had a bigger hand in Hannibal's affairs than willing dupe. He wonders sometimes if that's true. Sometimes it feels like Hannibal is so far under his skin Will will never be free of him.</p>\n<p>Sometimes he wonders if he truly wants to be.</p>\n<p>He drives until the thought dissipates into the monotony of open road, Will's mind eventually growing blissfully blank. He stops just before noon, and then only because he's running low on gas and if he doesn't get some coffee in him he's not going to make it. He finds a truck stop that's little more than a watering hole, gas bar and diner side by side at the corner of two crossroads. There's a couple of semis parked out back, and two pickup trucks, both dusty with country life parked out front. Will maneuvers Alana's Prius between them and then heads inside.</p>\n<p>He's just in time for their last serving of breakfast, Will's stomach rumbling at the first scent of food. He's unaccountably nervous, but no one gives him a second glance and the television above the counter is showing only the local news, nothing to indicate anyone is looking for him. He still sits near the door; orders his coffee in a to-go cup, the breakfast special over-easy.</p>\n<p>The eggs, when they come, are swimming in oil, the toast dripping with butter. Will uses his fork to push aside the two links of sausage. Unless he's caught and cleaned it himself, he has no interest in eating anything that used to be alive.</p>\n<p>The eggs don't count.</p>\n<p>They are, despite the grease, actually pretty good. So are the hash browns. By the time Will's finished he's starting to feel a little more like himself. He asks for a coffee refill, along with the check, and then on impulse requests a state map. He disconnected Alana's GPS and no longer has his phone, so he's going to have to do this the old fashioned way. The waitress, an attractive middle-aged woman with a cheerful smile, gives him the map for free. He over-tips her and then heads to the bathroom.</p>\n<p>After he pisses, he takes a minute to splash cold water on his face and then stares at his reflection. He feels a lot more centered than he did at the side of the road, like his resolve is hardening, like this something he is actually capable of doing.</p>\n<p>The renewed confidence lasts just until he's back out on the road, full tank of gas and a couple of hours between him and Hannibal. The closer he gets the more he recognizes his surroundings, like an odd sense of deja-vu that doesn't quite translate into memory. Landmarks jump out at him, things he doesn't remember noticing before but must have because the familiarity of this place is overwhelming.</p>\n<p>Will knows precisely where to turn without looking at the map.</p>\n<p>The road to Hobbs' cabin is little more than a dirt track, framed on either side by dense trees. Late afternoon sunlight filters through the leaves, but its angle makes for long shadows. They shroud the surrounding wilderness in darkness. Will presses forward, even when it becomes apparent Alana's little car wasn't made for roads like this. He's starting to feel a little like he's made a mistake, like this is all going to go terribly wrong. Hannibal's pull is an ever present ache in his chest.</p>\n<p>He gets to the point where the road forks, the left branch leading to a lake, Will thinks, and the right to Garrett Jacob Hobbs' hunting cabin. He's tempted to leave the car here, but Hannibal already knows he's coming, so it's not like he has the element of surprise.</p>\n<p>He still slows his approach, rambling up the last bit of lane until Hobbs' cabin appears on the horizon. There are no cars parked out front, nothing to indicate anyone has been here in years. The windows are boarded up, the grass unkempt, the roof in need of re-shingling. He can't imagine Hannibal coming willingly to a place like this. Then again, he couldn't imagine a lot of things about Hannibal, not until they were staring him in the face, Will incapable of looking away.</p>\n<p>He pulls to a stop just outside the front door, scanning the cabin and surrounding area before opening the door, Alana's gun clenched in his hand.</p>\n<p>\"I know you're here,\" he still says aloud, using the door of the car to shield himself from view. When no one answers, he moves forward, coming to rest pressed against the side of the front door.</p>\n<p>It's not locked when he checks it, so Will lets it swing open, waiting for a reaction before exhaling slowly and then pivoting inside. He keeps his weapon level, sweeping it across the main room, finding it empty. At his back, through the open door, the sound of song-birds reach his ear. Will pushes forward.</p>\n<p>The place is sparse and neat, just like the last time he was here, except with an extra accumulation of dust. Will moves to the staircase, and then slowly climbs to the second level, to the room with the antlers.</p>\n<p>Even expecting it, it's still a surprise to crest the stairs and find Hannibal sitting in the middle of the attic. He's got his back to Will, his eyes locked on the place where Marissa hung, but it is undeniably him. Will's breath catches. He levels the gun at the back of Hannibal's head.</p>\n<p>\"Don't move,\" he says, trying to sound more confident than he feels.</p>\n<p>\"Come in, Will,\" Hannibal says, like this is one of their sessions, like Will's arrival corresponds with a time in Hannibal's day planner. Will climbs up the last few steps.</p>\n<p>\"Don't move and don't talk,\" Will says, because for as much as he has rehearsed this, planned it all in his head, there are at least a thousand ways this could all go wrong. Allowing Hannibal to speak is at the top of the list.</p>\n<p>Slowly, and with exacting precision, Hannibal turns. He's wearing a soft smile, though Will doesn't miss the sorrow in his eyes, an underlying anguish that Will feels all too readily. Will's hand begins to tremble.</p>\n<p>\"How are you, Will?\" Hannibal asks. Will can't tell if he's genuinely curious, or if this is yet another game.</p>\n<p>\"I said don't talk,\" Will tells him, trying and failing to avoid Hannibal's eyes. He's spent his whole life avoiding eyes, and yet on instinct he seeks out Hannibal's, the intensity of his gaze incredibly centering.</p>\n<p>Hannibal acknowledges his request by widening his smile. Slowly, as though he has all the time in the world, he rises, coming to stand before the chair like there isn't a gun pointed at him.</p>\n<p>\"You're not going to shoot me, Will,\" he says, certain. Will doesn't budge.</p>\n<p>\"You don't want to test me,\" he says, trying desperately to ignore the soft fondness in Hannibal's gaze.</p>\n<p>Hannibal has always looked at him like he meant something, like he was worth something. No one else has ever looked at him like that. He gets pity, scientific curiosity, fear, but never admiration; never fondness. He has no idea what it says about him that, even now, he flushes under the attention.</p>\n<p>Hannibal takes a step forward. A pair of antler horns protrude from the wall behind him. They frame his silhouette, Hannibal, in that moment, otherworldly.</p>\n<p>\"Don't I?\" he taunts, slowly closing the distance between them. His smile has grown wolfish.</p>\n<p>\"Don't,\" Will warns, but it's too late, Hannibal has already reached out and plucked the gun from his grasp. He considers it briefly and then hangs it from one of the antlers by its trigger guard, still well within Will's reach.</p>\n<p>\"That's better,\" he says, looking, not ironically, like he wants to consume Will. Will shakes his head, a last desperate attempt at denial. He should have known better. Should have realized he was Hannibal's long before Hannibal's blade kissed his thigh.</p>\n<p>Helpless, Will nods. He's not sure what he's agreeing to, but Hannibal reaches for him, the first touch of his hand, fingers wrapping around Will's elbow, sending sparks of electricity racing through his core. Hannibal draws him forward.</p>\n<p>\"Now try not to struggle, Will,\" Hannibal says into the shell of his ear. \"I'm going to have to tie you up, and I don't particularly want to hurt you.\"</p>\n<p>The <i>but I will</i> is more than implied.</p>\n<p>She's been doing this a long time--pretty much since she graduated, top of her class, thank you very much. She's lost track of how many times her job has taken her into the field; seen her flitting about the country on little to no notice. One would think sleeping on planes would grow easier with time. It doesn't.</p>\n<p>That doesn't stop her from trying, Beverly determined to be one of those travellers who falls asleep the minute the plane leaves the ground. She hasn't quite figured out their secret--just like she hasn't figured out how they arrive at their final destination without a single wrinkle. She's tried sleep masks, soothing ocean sounds to mask the dull roar of the engines, Gravel on the advice of her brother. None of it works, Beverly destined to be one of those people who sits, wide-eyed and awake, even on a red-eye.</p>\n<p>She thinks it's the endless waiting. All that sitting around with nothing to do when she might otherwise be working. It makes her tense and antsy, which is not at all conducive to sleep. It doesn't help that they're seated in economy, Beverly squeezed between Zeller and Price, who keep trying to have conversations around her. She's offered--twice now--to let them sit together, but Zeller won't give up the window seat and Price gets nervous bladder when he flies.</p>\n<p>Jack, of course, is sitting in business class.</p>\n<p>\"I still say we should have started a pool,\" Price says, a continuation of the same conversation they've been having since they passed over Chicago. Beneath her mask, Beverly rolls her eyes.</p>\n<p>\"With what variables?\" Zeller asks. Beverly grits her teeth.</p>\n<p>She doesn't want to get involved in this, and she knows she's probably just cranky from lack of sleep, but that doesn't stop her from putting her seat back into its upright position and then pushing her mask up so that it rests just above her brow line. The cabin is far brighter than she was expecting, so her intended glare turns into rapid blinking. It adds to her annoyance.</p>\n<p>\"Could we maybe aim for some professionalism? Will Graham is technically a retired agent,\" she says.</p>\n<p>Price has the decency to duck his head, looking somewhat like a kid caught with his hand in the cookie jar. Zeller on the other hand smirks, like she's just offered him an opening. Beverly wishes now she'd continued to feign sleep.</p>\n<p>\"Tell me you haven't thought about it,\" Zeller says, arching an eyebrow. \"I mean, let's say this goes according to plan. We get there, we find Will, we find Lecter, everyone is happy. You really think the only one getting thrown into a pair of cuffs is Lecter?\"</p>\n<p>On her other side, Price snorts. Beverly shakes her head. They've got about half an hour before they reach Minneapolis, which is thirty minutes longer than she wants to spend trapped in an airplane discussing this.</p>\n<p>The problem is Zeller's right. She has thought about it, and not just this time around. There were a lot of rumours floating around the Bureau after Lecter's arrest. For a really long time she didn't want to believe them, but seeing Will again, knowing now what she didn't know then: now she has no idea what to believe.</p>\n<p>\"What did you pull on the Hobbs residence?\" she asks instead of answering. Advice from her grandfather: when in doubt, change the subject.</p>\n<p>It does the trick, Zeller's smirk fading, his expression growing somewhat conspiratory. He exchanges a brief glance with Price, who merely shakes his head, then turns back to her, glancing once over his shoulder once before speaking.</p>\n<p>\"Something weird, and by weird I mean interesting,\" he says, leaning a little closer. Price leans towards him, trapping her between them. Yet another reason she hates flying.</p>\n<p>Overhead, the captain announces their time to arrival. Twenty-three minutes.</p>\n<p>\"So we know Hobbs owned two properties, right?\"</p>\n<p>\"The house and the hunting cabin,\" Price says, like Beverly didn't already know that.</p>\n<p>\"Exactly,\" Zeller says. \"And both properties were sold to the same buyer.\"</p>\n<p>Beverly remembers that. It happened about a year before Lecter's arrest, the money from the sale going to the families of Hobbs' victims. By the point the case was sealed away, no longer of interest and aside from passing commentary, no one paid much attention to it.</p>\n<p>\"Here's the interesting bit,\" Zeller continues. Price taps the side of his nose. She swears the pair are like children sometimes. \"The guy who bought the properties held on to both for about a year, then applied to have the cabin torn down.\"</p>\n<p>\"No reason,\" Price interjects. \"He just didn't like it. Those were the exact words he used on his permit application.\"</p>\n<p>Beverly arches an eyebrow at that, because that is... decidedly odd.</p>\n<p>Zeller nods enthusiastically. \"Then nothing, until six months ago, when he forecloses on the house and then disappears. It's been sitting empty ever since.\"</p>\n<p>Beverly realizes she probably looks something like a gaping fish. She can't quite help it. There are coincidences and then there are coincidences and she's been doing this long enough to know the difference. Over the comm, a flight attendant announces the start of their descent. Beverly absently reaches for her seatbelt.</p>\n<p>\"You're thinking this was Abigail, or someone working for her?\"</p>\n<p>\"It makes sense,\" Zeller says. \"She tore down the cabin because that's where daddy killed those girls. And she kept the house until it came time to spring Lecter from the big house.\"</p>\n<p>\"And,\" Price adds, \"Since there's not exactly a hot market for foreclosure homes these days, the odds of it remaining empty in case she needed it were pretty high.\"</p>\n<p>Beverly shakes her head at that, because it doesn't connect, not in any way she wants it to.</p>\n<p>\"Bit of a risk, though, isn't it? I mean, if she already has the house, why bother with the foreclosure?\"</p>\n<p>She doesn't breach the topic she knows is still playing in everyone's mind: that there is still a very good chance Abigail is dead, that Will was either lying or hallucinating when he said it was her on the phone.</p>\n<p>\"Who knows,\" Zeller says. \"Maybe keeping it wasn't part of the original plan. Maybe Lecter took advantage of an opportunity.\"</p>\n<p>\"Or maybe she was hoping to throw us off the trail,\" Price adds. \"Either way, Jack thinks it's enough for probable cause. We should have a warrant as soon as we touch ground.\"</p>\n<p>Which will happen sooner rather than later, Beverly realizes, catching a glimpse of the approaching city out the tiny port window. She's always found it disorienting, watching a descent, tiny dots resolving into cars and trucks, while long, winding arteries become discernible roads. Playing over Zeller's words in her head, she leans back into her chair and closes her eyes. When she opens them again, they're on the ground.</p>\n<p>~*~</p>\n<p>The attic of Hobbs' hunting cabin is smaller than he remembers, Will seated in the middle of it, fenced in on all sides by antlers. In the low light of the afternoon, they've become the twisted ribs of some great and fantastical beast, Will trapped within its ribcage, slowly rotting alongside the creature's meat.</p>\n<p>He can't see Hannibal, but he is intently aware of his presence. The antlers cast long shadows upon the floor, but they are consumed by the shadow Hannibal casts, his movements slow and methodical. Across the room, fingering a particularly sharp pair of tines, Garrett Jacob Hobbs stares over Will's shoulder, watching Hannibal work with decided interest. Will finds he is immensely jealous.</p>\n<p>\"Did she know?\" Will asks, the question directed at Hannibal, though it earns him Hobbs' attention. \"Is that why she left?\"</p>\n<p>Hobbs aside, it's easier to focus now that the situation is out of his control. He's not sure what that says about him, but he feels clearer than he has in years. Then again, Hannibal has always had that effect on him.</p>\n<p>Hannibal doesn't answer right away. His hands work quickly, steadily, gentle pressure against the outsides of Will's wrists. Will doesn't struggle--there isn't a need--waiting patiently for Hannibal to bind his hands together. He wonders idly of much of this is really necessary: if Hannibal understands this any better than he does.</p>\n<p>He hears rather than sees Hannibal withdraw, the rustling of his suit, fabric against fabric, both startlingly loud and strangely soothing. He thinks Hannibal might be rising to his feet, his presence growing larger, but it isn't confirmed until Hannibal leans over the chair, his stomach brushing against Will's shoulder, bringing with it impossible heat. Will draws a ragged breath, heart pounding frantically in his chest. He's surprised Hannibal doesn't hear it. At his back, Hannibal chuckles, warm air ghosting across Will's ear. It makes Will shiver. Without thinking, he tilts his head forward; offers Hannibal access.</p>\n<p>He's long since given up trying to understand any of this. Hobbs, he thinks without looking, is surely laughing at him.</p>\n<p>\"She knew what I allowed her to know,\" Hannibal eventually answers, his words caressing the back of Will's neck. He withdraws after he says it, Will swallowing a wave of inexplicable disappointment.</p>\n<p>The rustling of fabric is again the only indication Will has that Hannibal is moving. It runs in direct contrast to the man Will knows, Hannibal swift and silent when he wants to be. This, then, is Hannibal announcing his intentions, purposely trying to put Will at ease. Will finds the notion strangely endearing, then berates himself for the thought.</p>\n<p>He's still struck speechless when Hannibal appears before him; sinks gracefully to his knees.</p>\n<p>\"She left,\" Hannibal says when he's certain he has Will's attention, \"because I allowed her to. And because it was time. We could not protect her forever. She needed to experience life outside our influence.\"</p>\n<p>He's touching Will again, though after a moment Will realizes Hannibal is only securing his feet to the legs of the chair. Will glances down, staring between his spread legs, watching with equal parts trepidation and fascination as Hannibal deftly secures a cable tie around one of his ankles. Belatedly it occurs to him that he has played entirely into Hannibal's hands; that coming here may have been a mistake.</p>\n<p>\"You should be proud,\" Hannibal says as he works. His touch is firm, forceful and yet still impossibly tender. Will swallows heavily; tries not to feel bereft when Hannibal secures the final tie and then removes his hands.</p>\n<p>Will can't remember the last time someone touched him with genuine intent.</p>\n<p>\"She's done admirably well for herself,\" Hannibal continues, looking up now, his gaze curious, searching. Will has no idea what he's looking for. There was a time, so long ago now it feels like another life, when he could read Hannibal easily. That was before he knew who and what Hannibal is. Now Will's not entirely sure he ever knew the man.</p>\n<p>The knowledge does nothing to ease the gaping hole in his chest--the one Hannibal carved alongside the hole in his thigh.</p>\n<p>\"You've seen her?\" he asks, the longing in his voice nothing to do with paternal concern and everything to do with the man who was once his touchstone, the only grounding force he has ever known.</p>\n<p>Hannibal smiles. Will thinks he might be pleased.</p>\n<p>\"Did you think I'd killed her?\" he asks, unconcerned.</p>\n<p>Will shakes his head, somewhat desperate. He's not sure if he's eager to convince Hannibal, or himself. He's still not entirely sure it was her on the phone, that he didn't imagine the sound of her voice.</p>\n<p>Hannibal is smiling again, softer this time. He sets his hands on the top of Will's knees, warmth from his palms creeping up Will's thighs. It's like Hannibal's blade all over again, Will glancing down, half expecting to see warm wetness spilling onto the floor. His every instinct is telling him to run, but secured to the chair it's impossible, so instead he sits perfectly still, fighting against the urge to press into Hannibal's touch.</p>\n<p>As it turns out, Hannibal is only using him for leverage. He pulls away as soon as he is on his feet, Will releasing a shaky breath, ignoring the vaguely hollow feeling that settles in his chest when Hannibal steps away. He doesn't go far, still looming over Will's chair, but Will feels his loss keenly. Will cranes his neck, seeking Hannibal's gaze; needing Hannibal to act as his anchor.</p>\n<p>Hannibal stares down at him. He is again framed by antlers, these ones tipped in blood, Hannibal looking more demonic than human. With a good deal of effort, Will looks away; glances over his shoulder to find Hobbs staring longingly at Alana's gun. It's still hanging by the stairs.</p>\n<p>\"Abigail,\" Hannibal says, reclaiming Will's attention, \"is very clever. She is also very dangerous.\"</p>\n<p>There is something in his tone that catches Will's attention. He is proud, certainly, but there is something else there, something Will thinks might be concern. It's not something Will particularly wants to examine. He still hasn't figured out his part in this. He's terrified to ask if Bedelia was right.</p>\n<p>\"What are you planning on doing with me?\" he asks instead, a reasonable question given the circumstances.</p>\n<p>\"You don't know?\" Hannibal asks, sounding genuinely curious. He tuts, like he's disappointed by Will's lack of insight--and he probably is. He moves away, punishment for Will's fumble, cold air rushing in to fill the space he occupied. Will shivers, tracking his movements until Hannibal comes to a stop before the antlers that held Marissa. He turns so that he's boxed in by them, their shadows obscuring his features. Hobbs comes to stand behind Will's right shoulder. Will ignores him.</p>\n<p>\"I've made arrangements for us. For all of us,\" Hannibal says. He sounds like a king making a pronouncement: a God speaking a commandment. Will shakes his head, a feeble protest.</p>\n<p>\"It's only a matter of time before they come looking for me,\" he says.</p>\n<p>Outside, the sun has started its descent. It casts long shadows about the room. They meet where Hannibal stands, patterning a cage upon the floor, Hannibal trapped within it. Will wonders how much of this--how much of any of this--is his design. It is entirely possible he, like Will, is operating purely on instinct.</p>\n<p>\"I should hope so,\" Hannibal says. \"Though I fear they will meet with disappointment.\"</p>\n<p>Will can't tell if it's certainty or arrogance. He suspects it's the former. How long, he wonders, until someone makes the connection. Twenty-four hours? Thirty-six? Does he even want them to find him?</p>\n<p>Across the room, Hannibal is still watching him, patient and yet strangely reticent, not at all the master who spent two years pulling Will's strings, driving him, he realizes now, to complete, abject ruin. Will finds the sight strangely compelling. Calmly, he meets Hannibal's gaze.</p>\n<p>\"Are you planning on killing them? Or trussing me up and sticking me in the trunk, vanishing before they get here?\" he asks, letting his lips curl up into a smile.</p>\n<p>At his back, Hobbs laughs.</p>\n<p>Will still can't make out Hannibal's features, but the change in Hannibal's posture suggests Will has surprised him. There's amusement there, too--that and delight, like Will's impudence pleases him immensely. It's amazing, Will thinks, how fast the man can move. One minute he's lounging against the wall, framed by the shadow of Marissa's murder, and the next he's across the room, braced on either side of Will's chair, his gaze perfectly predatory.</p>\n<p>He's so close Will can count the pores on the tip of his nose.</p>\n<p>\"Oh, Will,\" he says. \"But how I've missed you.\"</p>\n<p>There is nothing pleasant in the way he says it, and for the first time since Will lost the gun he feels the cold, creeping tendrils of fear. They wrap tightly around his heart, pain spreading from his centre until he's half afraid he's actually having a heart attack, that Hannibal won't get the chance to kill him after all.</p>\n<p>He's not sure why the thought bothers him so much.</p>\n<p>Hannibal hasn't moved, poised perfectly still above him. He scans Will's face, scrutinizing Will like Will is a riddle or a puzzle or perhaps even the intended course at one of his feasts. The thought should terrify him, but instead he finds himself stretching forward, electrified and captivated by Hannibal's gaze.</p>\n<p>He realizes then he was always hopelessly caught in Hannibal's web.</p>\n<p>\"Do you see?\" a voice says in his ear. Will doesn't need to turn to know it is Hobbs. He doesn't answer, continuing to stare at Hannibal like if he looks hard enough he'll finally find a way to make the man fit the profile.</p>\n<p>Hannibal practically preens under the attention.</p>\n<p>The light in the cabin has shifted, growing dim with the approach of evening. The room's shadows have receded, Hannibal no longer bound by his cage, Will freed from the belly of the beast. A soft smile has spread across Hannibal's features, satisfaction and something Will thinks might be relief reflected in his gaze. He reaches out then, places a hand gingerly upon Will's cheek, his thumb tracing the ridge of Will's cheekbone. Some of his facade slips away.</p>\n<p>Will sees immediately what Hobbs was talking about: sees how tightly Hannibal holds himself, how frayed he is around the edges; how desperately he's trying to keep that from Will. This, Will thinks, is Hannibal afraid. Not of re-incarceration, not even of death, but of Will Graham's rejection. Power surges through him at the thought. The last time Will felt its like was the day he killed Garrett Jacob Hobbs.</p>\n<p>Some of his realization must show in his features, because Hannibal lights up, his smile growing wicked. He leans forward then, but instead of the kiss Will is half expecting, he brings his mouth to the shell of Will's ear, his words so soft Will has to strain to hear.</p>\n<p>\"Didn't I tell you,\" he says, lingering long after the words have left his tongue. Will sits perfectly still, surrounded by the scent of Hannibal's cologne, revelling in the warmth of Hannibal's body, his head swimming with emotion. He has no way of knowing how many of them are his own, but he's long since stopped feeling afraid.</p>\n<p>Across the room, now fingering Marissa's antlers, Garrett Jacob Hobbs glances over his shoulder and smiles.</p>\n<p>~*~</p>\n<p>She traces the pad of her middle finger along the now faint scar that runs the width of her neck. It's whitened with the passage of time, and when she applies pressure to it, it disappears entirely, allowing her, for the briefest of seconds, to pretend it doesn't exist.</p>\n<p>It returns the second she removes her hand, Abigail contemplating the mark for several long minutes before reaching for her scarf. This one is patterned in geometric shapes, black and red on white, a gift from Alana Bloom. She ties it swiftly, the scar disappearing. Abigail gives her reflection a final once over before heading to the door.</p>\n<p>She's slept the better part of the day, so the sun is already dipping towards the horizon when she steps outside. She pauses for a moment in front of her motel room door, blinking at the purpling sky, and then walks slowly to the office to return her key and pay the extra day's fare. It's well past check-out time.</p>\n<p>Her father's cabin is still an hour away, but Abigail moves slowly, not entirely sure how she feels about going there--seeing it again. More than that, she's not yet prepared for what it will mean to see Will again--to see Hannibal. To see them together. She's thought about this often, since Hannibal cut her loose and sent her out into the world, and yet standing on the edge of it, she is ill prepared for the maelstrom of her emotions. Her knuckles, when she eventually wraps them around her steering wheel, immediately turn white--whiter even than her scar. She releases a shallow breath, starts then engine, and then pulls out onto the road.</p>\n<p>They're positioned behind the cars when Jack sends the tactical team inside. Beverly crouches behind the open passenger-side door, her weapon drawn, pointed at the front door. She watches the men in black sweep across the lawn, the entire house surrounded.</p>\n<p>It's late--far later than it should be--Jack's warrant not quite as cut and dry as Zeller made it out to be. In the low light of twilight, the house is steeped in shadows, gaping chasms of darkness capable of swallowing a man whole. Heat sensors didn't pick up anything inside the house, but in Beverly's experience that doesn't mean much. Until tactical gives the all clear, she's going on the assumption Lecter is inside.</p>\n<p>The first team knocks in the front door and then tosses in a couple of smoke grenades. Beverly remains rooted in her spot, elbow locked to keep her gun in place. She watches the team spill into the house. Like tiny insects, they swarm with perfect precision. A booming echo from behind the property suggests a second team has gone into the back.</p>\n<p>Jack won't let them inside until they get the all clear, so it's pretty much a waiting game at this point. Beverly listens to them clear rooms over the radio, hope waning with every second. By the time they've cleared the first floor, she knows they're not going to find anything. The question is: did she miscalculate, or were they too late coming.</p>\n<p>About ten minutes after tactical kicked their way inside, the all-clear call comes over the radio. Jack motions them forward, Beverly taking the time to holster her gun before jogging towards the house. There are still tactical units all over the lawn, some of them searching the back woods, some of them retreating back to the trucks, a few of them setting up spotlights. Beverly weaves her way through them, catching up with Jack inside the front door.</p>\n<p>It's pitch black inside--tactical having gone in with night vision--and still smoky from the grenades. Beverly clears her throat, pulls a flashlight off her belt and then fumbles her way up half a flight of stairs, into the main living room. The place is still crawling with activity.</p>\n<p>It's not long before tactical brings some of the outside lights indoors, soon the entire house humming under the artificial glow of Halogen lamps. Someone has opened a window, the smoke starting to clear. Beverly gets her first good look at the place. It is very obvious no one has been here in a very long time.</p>\n<p>Miscalculation then. She shakes her head, disappointed.</p>\n<p>Jack, who's done his own tour of the house, eventually catches up with her in the kitchen, where Zeller and Price are leaned against the counter, trying to figure out where this outcome would have fit in their pool. They fall silent as soon as Jack enters the room.</p>\n<p>\"I need to know if they were here, or if we just wasted an entire day scrambling for resources and warrants,\" Jack says. He doesn't sound impressed.</p>\n<p>Beverly exchanges a glance with Zeller and Price. It soon becomes obvious they intend to leave this in her hands.</p>\n<p>\"Look, Jack, it's pretty obvious no one's been here. Not for a very long time,\" she says.</p>\n<p>Jack shoots her a glare. Beverly doesn't bother pointing out the obvious: no electricity, no running water, no furniture, no supplies--the dust hasn't even been displaced. There's not even any signs of squatters or neighbourhood kids. Hell, from what she's seen, the copper piping is still intact.</p>\n<p>Jack doesn't seem to care about any of that. He scrubs a hand over his mouth, resolve hardening.</p>\n<p>\"I've got neighbours who don't remember anyone living here, who say a professional maintenance company was maintaining the property until about six months ago. I've got a missing agent and a missing fugitive and missing person who until yesterday was presumed dead. I've got a missing hospital employee who is probably dead. Basically, I've got a whole lot of questions and no answers, so you guys are going to tear this house apart until you find something.\"</p>\n<p>He doesn't give any of them a chance to respond, already striding from the room. Beverly watches him pull out his phone; press it to his ear. She thinks he's probably calling Dr. Bloom. Beverly waits until he's out of earshot before turning back to Zeller and Price.</p>\n<p>\"Does he really want us to process the house?\" Price asks.</p>\n<p>Beverly shrugs. \"Looks like.\" She glances out the window then, full night having arrived, another twelve hours without sleep looming in her future. She probably wouldn't mind so much, save that she can't remember the last time she got a consecutive eight hours and it's starting to catch up with her.</p>\n<p><i>I'm getting too old for this,</i> she thinks, reluctantly following Price and Zeller back to the car to retrieve their kits.</p>\n<p>~*~</p>\n<p>\"You could sleep if you like.\"</p>\n<p>It is terribly amusing, watching the immediate protest that comes to Will's mind. He does not give it voice: he cannot admit, even now, even here, that he is afraid. Hannibal has always admired that about him. A man of pure empathy, whose very driving force is fear, and yet, for all of that, Will Graham is not afraid.</p>\n<p>They are not alone in the room. Hannibal is acutely aware of Will's companion. He hasn't asked who it is, but then, he already knows. Given where they are and everything that has happened between them, it can only be one person. Hannibal is torn between fascination--for Will is endlessly fascinating--and annoyance. Will Graham is his: Garrett Jacob Hobbs has no right to him.</p>\n<p>Hannibal would kill the man if he could.</p>\n<p>It is not, of course, hard to regain Will's attention. Hannibal has arranged all of this entirely for his benefit, after all. It's perhaps not the safest course of action--Will's trail will undoubtedly lead to the house, and while they will think the cabin demolished, as red herrings go it is an obvious feint. Hannibal meant it more for mockery than actual advantage. He estimates he has about twelve hours before they figure it out. Will is close to breaking, but he is not yet broken. Hannibal needs time.</p>\n<p>\"Tell me, Will, have I so thoroughly eroded your trust? You have slept in my company before.\"</p>\n<p>As expected, Will's gaze slides away from the corner of the room, where Hobbs is no doubt standing. Dozens of emotions play across his features. Hannibal wonders if he is remembering the scant handful of times he fell asleep on Hannibal's consulting room couch, or in the passenger seat of Hannibal's car. Will is a stunning creature when he sleeps, the weight of societal expectation falling from his shoulders, his true nature rising to the surface. Even sweat-damp from nightmares, his lips curl into a smile, its edges pointed, dagger-sharp.</p>\n<p>The memory of it still stirs something in Hannibal's breast.</p>\n<p>\"I think I'll pass,\" Will says, so frightfully rude. Hannibal cannot quite supress a smile.</p>\n<p>\"Very well then,\" he says, uncrossing his legs and leaning forward, his elbows coming to rest upon his knees. He's brought a second chair up from downstairs; positioned it directly across from Will. It's a poor mockery of his consulting room, but what it lacks in sophistication it makes up for in intimacy, Hobbs' attic a remarkably tight space. This close, he could stretch out a hand, run his fingers along the side of Will's neck, feel the steady beating of his heart. He doesn't, but he also doesn't miss the way Will leans towards him, Will not at all aware of doing so, but it pleases Hannibal all the same.</p>\n<p>He wonders if Will truly appreciates just how close to the brink he stands.</p>\n<p>He has dreamed about this. Fantasized about it. Rehearsed this moment in his head more times than he can count. There is nothing between them now: no encephalitis, no Jack, no secrets. Hannibal has laid himself bare and Will has come, reluctant, reticent, but he is here all the same. It takes every ounce of Hannibal's restraint not to reach out, to run his fingers up the length of Will's thigh, trace the mark he left behind.</p>\n<p>He doesn't stop himself from looking, letting his gaze caress the hidden scar instead. Will starts when he notices, his entire body tensing. Were his hands free, Hannibal has no doubt he'd reach for it. The response is practically pavlovian.</p>\n<p>\"Do you take comfort in it, Will, or is the reminder a painful one?\" Hannibal asks, glancing up. </p>\n<p>A fine tremor runs the length of Will's jaw. Hannibal follows it to Will's throat; watches him swallow, his Adam's apple bobbing nervously.</p>\n<p>\"Do you mean the six inch scar whose making almost killed me?\" Will says, manufactured venom in his tone. Hannibal laughs.</p>\n<p>\"Had I wished you dead...\"</p>\n<p>\"You would have killed me, I know. Why didn't you?\"</p>\n<p>And that is a question Hannibal is not yet prepared to answer--or rather, an answer Will is not yet prepared to hear.</p>\n<p>\"The passage of time leaves marks upon our bodies, our histories written in each tiny white scar. I have one on my wrist from where my sister cut into me with a knife. Just as I bear her mark, you bear mine. You should consider yourself lucky. Mine serves as a reminder that I am alive when she is not. So should yours.\"</p>\n<p>He lets the words hang in the air between them, Will clinging fiercely to his understanding of morality, flawed though it is. Hannibal can see the moment it conquers, a lie forming on his tongue.</p>\n<p>\"It doesn't,\" he says.</p>\n<p>Hannibal tuts.</p>\n<p>He leans a little closer, seeing then the exhaustion in Will's gaze. It is highlighted by the twin lanterns that burn upon the floor, the inky backdrop of night chased away by their light. Will doesn't shy away, but he does shiver, however minutely.</p>\n<p>\"It bothers you that it does not bother you more, and yet that is not why you are angry. You are angry because ours was a relationship built on trust, and you feel I violated this trust.\"</p>\n<p>Will laughs at that. It is an ugly sound--high pitched and desperate, more than a little hysterical. Hannibal gathers in in close; tucks it alongside his heart.</p>\n<p>\"Oh, you violated that trust all right.\"</p>\n<p>Will trembles as he says it, as close to breaking as Hannibal has seen in years. It makes Hannibal want to reach out and push; to shatter Will upon the floor so that he can put the pieces back together, his own configuration. Will's internal struggle is a sight to behold. It is raw and powerful and erotically beautiful. If he could, he would capture it in amber, keep it forever as a memento.</p>\n<p>\"Did I? Well, perhaps, though you understand my reasons. In my place, you might have done the same. We are far more alike than you think, Will.\"</p>\n<p>Will shakes his head at that, denial on the tip of his tongue. Hannibal doesn't allow him to vocalize it, silencing him then with a single touch, his right hand settling upon Will's knee. Will freezes beneath him. He has always been far more agreeable when Hannibal is touching him. Hannibal has yet to decide if it is sexual attraction or something far more primal.</p>\n<p>Either way it's like touching a wild animal, Hannibal acutely aware of the power he holds. Will calms in increments, his initial skittishness seeping away, replaced by docile acceptance, the need for flight receding entirely. His blinking has grown more pronounced, his eyes red-rimmed from lack of sleep.</p>\n<p>\"Tell me, Will,\" Hannibal says. \"What would you do if I untied you now?\"</p>\n<p>He punctuates the question by rubbing his thumb down the side of Will's kneecap, refusing to relinquish physical contact. Will licks his lips; glances briefly to the gun.</p>\n<p>\"Yes, I thought you might,\" Hannibal says, withdrawing his hand.</p>\n<p>He stands then, leaving Will where he sits, hands still bound behind his back, ankles still secured to the chair. Will watches him warily, though Hannibal does not miss the longing in his gaze. He wants so badly to cross that line, to succumb to what's already inside him, and yet still he fights. It is as vexing as it is thrilling. Had they more time, it might have entertained him for hours.</p>\n<p>\"You disappoint me, Will,\" he says, movingly slowly across the room. Will tracks his movements until Hannibal leaves their circle of light, then he blinks owlishly, gaze growing narrow. \"Would you kill me, Will? After everything I have done for you.\"</p>\n<p>There isn't much room to maneuver in this space, only the corners shrouded in darkness, but Hannibal takes advantage of Will's blind spot, keeping to them as he retrieves Will's gun; tucks it into his pocket.</p>\n<p>\"Do you imagine it would feel good?\" he presses.</p>\n<p>Still penned in the circle of light, Will shifts. It is impossible to say if he is simply stretching or struggling against his bonds. Hannibal lets his fingers trace the edges of Will's gun through his pocket, then seeks the capped scalpel he keeps in his waistcoat. He pulls it out, removes the cork from its end, and then runs his thumb across the blade. The digit comes away bloody. Hannibal sticks it into his mouth and sucks.</p>\n<p>\"And what have you done for me?\" Will asks, growing still again. Hannibal smiles. He steps back into the light, gaze fixed on his scalpel. Will starts when he sees it, drawing back, undoubtedly thinking Hannibal intends to kill him now.</p>\n<p>In three quick strides Hannibal is at his side. Will's eyes shutter closed. Hannibal presses in close; whispers in Will's ear.</p>\n<p>\"Open your eyes my dear Will, and tell me, is he still in the room?\"</p>\n<p>And Will, good, wonderful Will, obeys immediately, his eyes fluttering open, eyelashes soft as he blinks and then scans the room. He shakes his head when he finds Hobbs gone. The widening of his pupils is neither fear nor the absence of light.</p>\n<p>\"I told you once I would help you bear it. Have I not done so? Do I not continue to do so?\"</p>\n<p>He catches Will's gaze then; forces Will to hold it when he might otherwise look away. He can see the minute it breaks him, Will shaking his head, only slightly, but it is enough for Hannibal's purposes. He crowds a little closer, Will's eyes again falling shut. </p>\n<p>Hannibal braces himself on the arms of Will's chair. He moves slowly, deliberately, letting his nose trail along the side of Will's cheek until he reaches Will's ear, Will gasping at the contact. When he speaks, it is soft, the words a little more than a whisper, meant entirely as a caress. Will leans into them; abandons himself completely to Hannibal's care.</p>\n<p>\"I'm going to untie you now,\" Hannibal says, and then immediately withdraws, relishing Will's near whimper at the loss of contact.</p>\n<p>He moves slowly around to the back of the chair, letting his fingers trail down one of Will's arms before reaching his hands, cable tie binding them together. He's secured it tight enough to keep Will from moving, but not enough to cut off circulation. Still, Will has been struggling, the skin beneath the tie red from chaffing. Hannibal tsks at him.</p>\n<p>\"Now do be careful, Will,\" he says, \"I would so hate to hurt you.\"</p>\n<p>He punctuates the point by running the blunt end of the scalpel along the outside of Will's wrists, imagining then blood welling beneath the blade, Hannibal leaving additional marks, perhaps even carving his name. Hannibal slips the scalpel beneath the tie; cuts it with a single slice. Will remains motionless. He shivers slightly when Hannibal wraps a hand around one of his wrists, thumb tracing the raw edge of his skin.</p>\n<p>Even mostly, freed, Will is passive, trusting. Hannibal's heart swells at the sight. He releases Will's hand and moves slowly around to the front of the chair; finds Will watching him with hooded eyes.</p>\n<p>\"Now do be a good by and sit absolutely still,\" Hannibal says, sinking to his knees.</p>\n<p>~*~</p>\n<p>Abigail parks where the road forks, and then walks. The path is familiar, even without the benefit of light. She knows these woods like the back of her hand. She grew up here; slept under the stars before she was old enough to skin her first stag. The woods are in her bones, the familiarity of home echoing between the trees, leeching into her skin until the frantic beating of her heart settles to something approaching normal.</p>\n<p>She glances to her right; expects to find her father walking at her side. She is both disappointed and relieved to find he is not. Familiarity aside, this place is tainted now, stained by the blood of countless girls, all wearing her face.</p>\n<p>The cabin, when it appears on the horizon, looms like something out of a nightmare. Her steps falter, Abigail stumbling to a stop and then reaching automatically for the knife she tucked into her pocket. She brought it only for self-defence--she does not yet know what she will find--but its presence sinks her stomach, nausea bubbling forth at the thought of walking through those doors.</p>\n<p>She has no idea what she will find.</p>\n<p>The cabin is dark save for the light spilling from the attic. Abigail spends several long minutes standing in the driveway, a few feet from what is undoubtedly Will's car, staring at the house. She has yet to decide how she is going to do this. When she imagined it, she imagined simply walking in the front door, announcing her presence and dealing with the repercussions. Belatedly it occurred to her that Hannibal might--if he felt it warranted--simply kill her. She has no interest in dying. She has not survived this long to die by his hand now.</p>\n<p>After a moment's consideration, she moves around to the side of the house, where her father used to keep a ladder tucked beneath the crawl space. It's still there, so Abigail pulls it free, wincing when it scraps along the rocky ground. There are no sounds coming from the house, and aside from the light she has no way of knowing where either of them are. After another minute's silence, she pulls the ladder free and drags it around back.</p>\n<p>It's a short climb to the roof, where there is an access hatch that leads directly into the attic. She can't get it open without attracting their attention, but knowing Hannibal as she does, it is there he's keeping Will. She does not yet know in what state. Hannibal has never been an easy man to read and she suspects his intentions will depend entirely on Will's cooperation--or lack thereof.</p>\n<p>It strikes her, as she stands at the foot of the ladder, that the last time she was here was the day they found Marissa, mounted, bled out upon the floor. She still has nightmares about it; wonders if she would have had the strength to do the same had Hannibal not intervened. Marissa, she understands, was dangerous. She was also Abigail's only friend.</p>\n<p>The ground here is rocky, Abigail pausing to pocket one of the larger rocks before scampering up the ladder. Her heart is racing again, adrenalin and inevitability accelerating her pulse. She reaches the roof swiftly; knows she'll only have a small window of opportunity, enough, perhaps, to allow her the advantage.</p>\n<p>If Hannibal has taught her anything, it is the importance of having an advantage.</p>\n<p>Abigail has always been light on her feet, a skill her father taught her, important in the woods when stalking prey. She slips from the ladder onto the roof without making a sound, knowing instinctively where to place each foot to keep from giving away her position. She moves to the front of the house, pausing when she reaches the access hatch to listen.</p>\n<p>Creaking floorboards suggest someone is walking, and when she presses her ear to the hatch she hears the muffled strains of conversation, nothing discernible, but enough to confirm someone is there. She waits for a lull to pull the rock from her pocket. Then launches it at Will's windshield.</p>\n<p>It hits with a sickening thud, denting and cracking the safety glass. Almost immediately the alarm goes off. In the otherwise stillness of the forest, the sound is deafening. Abigail covers her ears.</p>\n<p>She realizes she is playing a dangerous game. This isn't her digging up Nicolas Boyle to prove a point. It isn't even her pushing against the chains Hannibal would wrap her in. She is bound to both of them and she would in turn bind them to her. Abigail waits; lets the shrill beeping of Will's alarm settle around her like a cloak. She lifts the hatch.</p>\n<p>It's a short drop from the roof into the attic, and she sees immediately that her ruse has worked--enough to suit her purposes anyway. Hannibal has gone to investigate, leaving her alone with Will. He hasn't spotted her yet--didn't hear her landing over the alarm--his back to her. He's seated on a chair, bent over his knees, struggling with one of his ankles. Upon closer inspection, Abigail sees that's his legs are secured to the chair. There is a cut cable tie on the floor. It undoubtedly secured his hands.</p>\n<p>Abigail crosses swiftly to his side.</p>\n<p>\"Here,\" she says when she reaches him. Will starts so badly he almost tips over his chair. She steadies him with a gentle press of her hand, Will blinking at her with wide, fear-laced eyes. They are misty with unshed tears. He looks unstable, but then, that is hardly new.</p>\n<p>\"Abigail, you shouldn't be here,\" he says when he collects himself, and then immediately goes back to fumbling with the tie. Abigail pushes aside his hands. She pulls out her father's knife; uses it to cut through the plastic.</p>\n<p>\"I told him it was too soon,\" she says, moving on to his second leg. \"He won't listen to me, but he'll listen to you.\" She glances up at him then, intending to catch his eye, to explain her part in all of this. Instead she finds herself staring into the dead eyes of her father, his chest riddled with bullets, blood oozing into the front of his shirt. With shaking hands, Abigail cuts through the second tie.</p>\n<p>\"You don't understand,\" Will--though he still wears her father's face--says. Freed, he reaches for her. \"You are in danger, Abigail. You need to leave.\"</p>\n<p>Abigail shakes her head, defiant. \"But you'll protect me,\" she says, trying then to stare past her father's eyes, to find Will on the other side. Her father nods, helpless.</p>\n<p>He lets her go then, Abigail feeling momentarily adrift, nothing anchoring her in place. She flails a little, watching Will rise, his legs shaking beneath him. He towers over her like this, his features twisted--doubt and confusion and indecision and something that terrifies her more than she's willing to admit all warning for dominance. Her father's face still overlays his, the two of them bleeding together, becoming one. Outside, the car alarm falls silent. Will extends a hand. Abigail accepts it; allows him to pull her to his feet.</p>\n<p>\"You need to get out,\" he says, desperation in his tone. He's looking at her like her father used to look at her, before the girls, before the killings and the bodies and the countless pounds of meat. Abigail shakes her head, but Will is already reaching for her, white-glazed eyes burning with worry, the hot edge of her father's blade pressed tight against her neck.</p>\n<p>Without thinking, Abigail lashes out, wanting then only space, escape from the madman who still haunts her dreams. She has forgotten about the knife, the blade striking across Will's abdomen. Too late she realizes what she has done, Will's eyes growing wide, Abigail stumbling back, horror-stricken by the sight of so much blood.</p>\n<p>There is confusion in Will's gaze, a thousand questions forming behind his eyes, Abigail incapable of answering any of them. She shakes her head, glances down at her hands and finds them blood soaked. When she glances back up to Will, she finds him desperately trying to keep his guts from spilling out onto the floor.</p>\n<p>In slow motion, he falls to his knees.</p>\n<p>Abigail takes a step back, away from the hatch, away from Will Graham and his pleading eyes. Away from her father's disappointment; his twisted affection. Away from the steady river of blood flowing towards her feet.</p>\n<p>She doesn't hear Hannibal on the stairs.</p>\n<p>Jack considers himself a patient man. If Bella was still alive she would no doubt disagree, but Jack wouldn't be where he is today if he let the evidence guide him. He's seen first-hand the dangers of forcing evidence to fit a theory.</p>\n<p>\"Nothing?\" he says, watching Brian and Jimmy try to fade into the background. Beverly stands before him, defiant.</p>\n<p>\"Nothing, Jack,\" she says. Jack has known her long enough to recognize she's getting close to the end of her rope.</p>\n<p>Still, he's not prepared to accept it. They haven't been here long enough to have processed the entire house; to come up with so definitive an answer. Jack scans the perimeter of Hobbs' living room, sweeping the floor in hopes of finding something he can use to argue his point. There is nothing. As much as he hates to admit it, Beverly is right. No one has been here in a very long time.</p>\n<p>\"So where does this leave us?\" he asks, not really expecting an answer. Beverly is obviously determined to give him one.</p>\n<p>\"It could be coincidence. The guy who bought the house really did foreclose. Not exactly uncommon in this economy.\"</p>\n<p>Jack shakes his head, dismissing the idea. It doesn't fit.</p>\n<p>\"Or it could be misdirection. Someone wanting us to think the house was important,\" she continues.</p>\n<p>Jack likes that idea even less, though it is far more probable. Either way, it doesn't help them. Hannibal could be anywhere by now, Will either dead or aiding him. If they've left the country tracking them may prove impossible. Jack scrubs a hand over his mouth, tries a new approach.</p>\n<p>\"We still have no concrete evidence Abigail is alive,\" he says. Beverly nods. \"If she was involved in this, what would be the point of keeping the house? We know no one's been living in it.\"</p>\n<p>He glances towards the fireplace then, where Jimmy and Brian are still standing. He needs everyone on board for this. Until they come up with a working theory, they're dead in the water, and that doesn't bode well for Will--that doesn't bode well for any of them. Jimmy and Brian exchange a glance, and then step forward so that the four of them form a tight circle in the middle of Hobbs' living room.</p>\n<p>\"Maybe Lecter's been directing her hand this entire time. I mean, we saw what he did to Will,\" Beverly says.</p>\n<p>\"Or,\" Brian interjects, \"Maybe this was all Lecter. The house was bought before he was arrested. Maybe he set this up wanting us to think Abigail was still alive.\"</p>\n<p>Jimmy nods, excited. \"Maybe not even us. Maybe he just wanted Will to think it. Maybe the foreclosure was just bad bookkeeping.\"</p>\n<p>And okay, Jack thinks, that at least makes sense. He can work with it, anyway.</p>\n<p>\"So Hannibal bought Hobbs' properties so that Will would think Abigail was alive. And he had the cabin destroyed because it was something Abigail would do?\"</p>\n<p>\"Or,\" Brian interjects, \"he was destroying evidence he didn't want us to find.\"</p>\n<p>Jack's never been a teacher, always preferring working in the field, but he's covered a class or two and he always tells students investigations are like puzzles. Start with the framework and then fill in the details. Eventually a full picture develops, the pieces coming together. He likes Brian's piece, the idea tangible. It doesn't, however, provide a full picture.</p>\n<p>\"The foreclosure doesn't make sense. Hannibal's too smart to let something like that slide,\" he says, glancing around the circle. Brian looks speculative, Beverly pensive. Only Jimmy answers.</p>\n<p>\"Hard to keep up payments from inside a cell,\" he says.</p>\n<p>Jack rubs a hand over his head, feeling the edge of a tension headache coming on. If only it was that simple. Unfortunately this is Hannibal Lecter, and if there's one thing Hannibal's good at it's giving Jack the run-around. The scenario is easily the kind of thing he would attempt--elaborate and showy and completely lacking physical evidence. The problem is he's not the type to drop the ball, and he certainly wouldn't go to the trouble if he didn't think they'd find the connection. More importantly, if he didn't think Will would make the connection.</p>\n<p>Jack glances to Beverly, finds her with her brow furrowed, clearly churning something over.</p>\n<p>\"You've got something on your mind, out with it,\" he says. Beverly shakes her head.</p>\n<p>\"It's not just the foreclosure. Lecter setting all this up, Abigail being dead: it eliminates our accomplice,\" she says. Jack concedes the point with a nod.</p>\n<p>\"Unless our accomplice is the missing hospital worker,\" Brian tries. \"Maybe he's not dead. Or, maybe Lecter killed him as soon as he got out.\"</p>\n<p>\"Then who called Will?\" Beverly says. \"Lecter? In which case, is Will lying to protect him or did he genuinely believe he was talking to Abigail?\"</p>\n<p>Jack watches the two of them trying to make sense of something he's beginning to think has been designed not to make sense. Something is off, and until he can put his finger on it they're not getting anywhere. He regrets now bringing Will into this, but at the same time he'd give anything to have access to his imagination. Jack knows damned well he never would have caught Hannibal the first time without him. It's starting to look like history might repeat itself.</p>\n<p>\"What is it, Jack?\" Beverly asks, Jack only then realizing he's zoned out, that in his absence their conversation has waned, the room falling silent. Jack shrugs.</p>\n<p>\"It's just... This feels orchestrated. Like he wants us wasting time talking about this.\"</p>\n<p>\"Like he's intentionally set up a puzzle we can't solve,\" Beverly says. Jack nods; points a finger.</p>\n<p>\"So Lecter wants us distracted, why?\" Jimmy asks.</p>\n<p>Jack's not yet prepared to answer that question. He lets his attention drift, out the window, Hobbs' backyard entirely empty, tactical long gone. There's no longer any light, the sun having vanished hours ago. He can't remember the last time any of them really slept.</p>\n<p>\"If Lecter's following his usual MO,\" Jimmy is saying when Jack turns his attention back to the group, \"he'll be hiding in plain sight.\"</p>\n<p>\"If Lecter's following his usual MO, he'll want to make us look like idiots,\" Beverly says, trailing off then, dawning comprehension twisting her features. Jack gives her his immediate attention.</p>\n<p>\"What do you got?\" he asks.</p>\n<p>Slowly, Beverly turns to meet his gaze. She looks almost chagrined, like if Hannibal wanted to make them look like idiots he ended up succeeding. Jack has a feeling he's not going to like this.</p>\n<p>\"Someone applied for a permit to demolish the Hobbs cabin. That doesn't necessarily mean it was demolished,\" she says. It takes Jack a minute to process what she means.</p>\n<p>Shortly after Hannibal's arrest, the contents of his home--his kitchen--placed in evidence bags, Jack got word they had a DNA match for Miriam. He felt then like someone had let the wind out of his sails, Jack simultaneously embarrassed and infuriated by how thoroughly Hannibal Lecter had pulled the wool over his eyes. He feels a little like that now, the obviousness of it striking him hard enough to sink his stomach.</p>\n<p>\"Son of a bitch,\" he says. How much time, he wonders, did they waste playing Hannibal's game? Enough to give him the advantage?</p>\n<p>Enough to give him Will?</p>\n<p>Jack's never been good at objectivity where his agents are involved. He's the first to admit Hannibal knows exactly how to get under his skin. The thought of him, not an hour's drive away, laughing at their incompetence is enough to start rage seething beneath his skin. He lets it settle there, adrenalin better than caffeine.</p>\n<p>\"Get tactical on the phone,\" he says, Brian immediately springing into action. He doesn't need to give any other orders, his team eager to start moving now that they have something resembling a lead. Jack turns from the room, getting to the door before Beverly says his name. He turns; arches an eyebrow.</p>\n<p>\"If Will's there,\" she says, \"are we to treat him as an accomplice, or a hostage?\"</p>\n<p>There's a brief moment where the entire room falls silent, Brian and Jimmy watching him intently, Beverly clearly worried about his answer.</p>\n<p>\"Until he proves otherwise, Will Graham is a retired agent who needs our help,\" he says. When no one objects, he turns from the room, hoping they've finally found a lead that'll pan out.</p>\n<p>~*~</p>\n<p>\"Abigail,\" Hannibal says, reaching the top of the stairs.</p>\n<p>Will can barely see him--though he is infinitely aware of his presence--Abigail blocking his view, her eyes entirely too wide, the knife trembling in her hand.</p>\n<p>It clatters to the floor with a resounding crash when Hannibal says her name, Abigail turning to face him. Will is only dimly aware that he's clutching his stomach, trying desperately to keep his insides on the inside.</p>\n<p>He watches Abigail back slowly towards him, the drumming of her heart--or is it his?--echoing around the room. She shakes her head, fear creeping up her spine when Hannibal reaches the top of the stairs. She moves as though caught in slow motion--or maybe that's just Will--each placement of her limbs seeming deliberately exaggerated. She skirts around the outside of him, putting him between them, Hannibal immediately coming into view.</p>\n<p>Will carefully meets his gaze; watches Hannibal's eyes widen, annoyance turning to fear turning to cold certainty. His gaze flickers to the knife, then back to Will. Will shakes his head; tries to speak. It comes out a hiss. Warm wetness spills between his fingers, falling to the floor. He feels a little like he's melting. Hannibal's features are melting, too, drained entirely of colour. His gaze flickers to Abigail. His features harden.</p>\n<p>\"Please,\" Will manages to get out, immediately regaining Hannibal's attention. He watches, somewhat alarmed when Hannibal's lip curls back into a snarl. The sound he makes is more animal than human. In an instant, Hannibal is on him, his hands, impossibly gentle, lowering Will to the floor. Will continues to shake his head.</p>\n<p>\"Stay perfectly still, Will,\" Hannibal says, getting Will onto his back. He pauses then only to draw Will's knees up. Will feels a little like putty in his hands. This close, Hannibal radiates heat. Will has to squint to bring him into focus.</p>\n<p>The lantern on the floor behind him envelops him entirely in warm yellow light. Will knows it's an optical illusion, but it has the effect of making Hannibal appear larger than he actually is. Wreathed in a halo of light, his eyes glinting in the darkness, the shadows of large antlers protruding from his head, it is hard not to imagine Hannibal as some otherworldly creature: a fallen angel sent to reap Will's soul.</p>\n<p>Blood still pours from his abdomen, but Will does not feel any pain.</p>\n<p>\"It's not as bad as you think,\" Hannibal says, pausing only long enough to strip off his coat and waistcoat. He folds the waistcoat neatly and then lays it across Will's stomach, applying gentle pressure to keep the wound closed, stem the bleeding. Will feels a little like he's floating, like someone has filled the room with water, his lungs struggling to adapt, impossible pressure pushing him towards the floor.</p>\n<p>He focuses his gaze on the rafters, needing then to orient himself in the room. It doesn't help, the ceiling alive with shadows. They flit in and out of his vision, taking on life, becoming the twisted writhing of animals: the fluttering wings of the great heron, the snarling teeth of a pine martin, and always, always the imposing majesty of a stag. Abigail's shadow passes between them, inching towards the stairs.</p>\n<p>\"Remain where you are,\" Hannibal says to her, cold, decisive. Only the tightness of his jaw betrays his heightened emotion, Hannibal tense with murderous intent.</p>\n<p>\"Please,\" Will says again.</p>\n<p>He fumbles with his arm, heavy and awkward, like it belongs to someone else. He brings his hand to his stomach so that he can wrap it, fingers blood-soaked, around Hannibal's wrist. Hannibal freezes as soon as Will touches him, his gaze falling immediately to the point where they are connected. Something flickers in his eyes. Will thinks it might be regret.</p>\n<p>\"Please don't,\" he says, clearer this time.</p>\n<p>It grows easier to push the words past his tongue each time, but it is only with Will holding his wrist that Hannibal shows any inclination to listen.</p>\n<p>\"Please don't hurt her,\" Will finally gets out, licking his lips. \"It was an accident. She didn't mean to. I need...\" He pauses then, faintly aware that blood is trickling down his sides, slipping beneath him to pool under his back. Tacky warmth soon grows cold, leaving him on the verge of shivering.</p>\n<p>He's not entirely sure it isn't shock.</p>\n<p>\"Will, you must try not to speak,\" Hannibal says, calm and reassuring. \"You have been gravely injured, and I'm afraid if you die Abigail will die alongside you. So if you want her to live, I would suggest you remain still and quiet.\"</p>\n<p>There is command in Hannibal's tone, his words sensible; rational. Will is tempted towards acquiescence. The only thing stopping him is the voice inside his head screaming in protest. Will struggles, earning another of Hannibal's snarls, this one tinged with desperation. He removes a hand from Will's stomach, places it upon his shoulder and pushes him back onto the floor. Exhausted, Will settles. He doesn't let go of Hannibal's wrist.</p>\n<p>\"You said it yourself. We have to serve her better. We need to protect her. Please.\" He punctuates the point by tightening his grip, slick fingers sliding against Hannibal's skin. \"Let her go.\"</p>\n<p>He has no idea what he means to accomplish by begging, Hannibal not someone he should be able to reach. It is surprising, then, when Hannibal's features grow soft, true consideration appearing in his gaze. It is entirely possible it is an act, but Will is clinging to the hope that Bedelia was right, that his words carry weight with Hannibal, that their relationship wasn't entirely a game.</p>\n<p>He clings even fiercer when Hannibal directs his gaze to the top of the stairs, where Abigail is frozen, staring at her blood-soaked hands.</p>\n<p>\"Abigail,\" he says, sounding very much like a father, command and affection in his tone. \"You will leave immediately and without argument, do I make myself clear?\"</p>\n<p>Abigail doesn't answer right away, but she does glance across to meet Will's gaze, her expression torn. He nods once in her direction, silent pleading, then breathes a sigh of relief when she nods at Hannibal and then disappears down the stairs. Will closes his eyes; listens intently to her moving through the cabin, then out the front door. He listens until her leaving is replaced by the singing of katydids, their chattering abnormally loud.</p>\n<p>When he opens his eyes again, Hannibal is watching him.</p>\n<p>\"You indulge her,\" Hannibal says, like he wasn't planning on killing her, like he only intended to ground her for staying out past curfew. Were the idea not entirely tragic, Will might have laughed. Instead he shakes his head.</p>\n<p>\"Thank you,\" he says, swallowing against the lack of moisture in his mouth. He has no idea how long it's been since Abigail cut him. A minute, an hour--time has elongated and aside from the steady beating of Hannibal's heart, he has no way of measuring it.</p>\n<p>Hannibal seems surprised, but he acknowledges Will's thanks with a smile. It's soft around the edges, so genuine Will has to fight to remind himself this is most likely an act. It is hard to know sometimes. He has seen the cracks in Hannibal's chassis, but he has never been certain how much is the man and how much is the performance. The gentle press of Hannibal's hands upon his wound don't feel like performance. Allowing Abigail to leave doesn't feel like performance. The cell phone that appears in Hannibal's hand doesn't feel like performance.</p>\n<p>Will blinks.</p>\n<p>He feels like he's missing time again, like something important has happened but he can't quite trace how he got from there to here. He frowns, watching Hannibal dial a number and then press the device to his ear.</p>\n<p>\"What are you doing?\" he asks. Hannibal places his finger against his lips, shushes him.</p>\n<p>\"Hello, Jack,\" Will hears him say into the phone, though his eyes never leave Will. Will doesn't hear Jack's reply, but whatever he says widens Hannibal's smile.</p>\n<p>\"Ah, good, you've figured it out. Congratulations. You should bring an ambulance with you, and some very skilled paramedics. I'm afraid I've cut your boy up rather badly.\"</p>\n<p>He makes a show of pulling the phone from his ears and hanging up, setting the phone aside, within easy reach. It starts ringing almost immediately, but Hannibal ignores it. Will furrows his brow; tries to process what he just heard.</p>\n<p>\"Why did you...?\"</p>\n<p>The room is starting to go fuzzy.</p>\n<p>\"Tell him I cut you? For the same reason I'll tell him I killed Abigail all those years ago. You wanted her protected, didn't you?\"</p>\n<p>Will absorbs that. He is well aware Hannibal is watching him, scrutinizing Will for his reaction, though try as Will might he can't find a motivation for anything that has happened. He's sprawled across the floor of Hobbs' attic, bleeding from a stomach wound that miraculously hasn't killed him--unless Hannibal is right and it isn't as bad as he thinks it is--and instead of using the situation to his advantage, instead of killing the person responsible, Hannibal is holding him together and telling the FBI where they are. Will's having a very hard time making sense of it. For the first time in as long as Will can remember, his imagination fails him completely.</p>\n<p>\"They're going to arrest you,\" he hears himself say, as though this is somehow a sticking point--as though that wasn't what he came here originally to do.</p>\n<p>\"And how does that make you feel, Will?\" Hannibal asks, no doubt expecting Will to throw the question back to him.</p>\n<p>\"Angry,\" Will says instead, perhaps the first honest answer he's given since all of this began. Above him, Hannibal smiles. He looks delighted.</p>\n<p>\"Good,\" he says, though he makes no move to leave, holding Will together until the sound of approaching vehicles blocks out even the singing of katydids.</p>\n<p>~*~</p>\n<p>Beverly is the first one in the door, though only because they've arrived before tactical and they've got confirmation Will is hurt. It could be a trap--hell, it probably is--but on the odd chance it isn't she'll be damned if she's going to let Will Graham die on her watch.</p>\n<p>Once upon a time, they might have been friends.</p>\n<p>Jack is a pace behind her. She's surprised he hasn't taken the lead, but it's probably for the best he doesn't. She knows precisely how he feels about Hannibal Lecter and even without him leading there's a good chance Jack's going to put a bullet through Lecter's head.</p>\n<p>She's trying to avoid that. The paper work would be unmanageable.</p>\n<p>They've been in contact again, Lecter surprisingly cooperative over the phone. She gets a pace into the main room--Zeller and Price are still moving past Dr. Bloom's car, the windshield destroyed--when he calls down to them.</p>\n<p>\"Up the stairs, and hurry,\" he says, sounding entirely too polite for a wanted fugitive, never mind a monster responsible for more deaths than they'll ever be able to pin on him.</p>\n<p>Beverly catches Jack's eye; waits for his signal to move forward. She starts them up the stairs.</p>\n<p>There's light up in the attic, enough so that it takes her eyes a minute to adjust. She moves slowly, using the stairwell for cover until she can poke her head over the top. It's easily the most terrifying thing she's ever done. She's an agent, so she's trained for it, but there's a reason they tend to let the tactical teams clear a building before sending in the specialists. Beverly is, above everything else, a specialist.</p>\n<p>She's ill prepared for the sight she's met with.</p>\n<p>Lecter appears unarmed, though she can see immediately Will is hurt. He's sprawled across the floor, eyes dazed, though he's not unconscious. Lecter is kneeling at his side, applying pressure to the wound, but that is not what surprises her. What surprises her is the look of concern on his face, like he genuinely cares about Will's welfare. She knows what he is--knows what he's done and what he's capable of--knows, too, that attachment, love, should be impossible for him. And yet, the look in his eyes is unmistakable. Either he is a very skilled actor or they are going to need a new word to define him.</p>\n<p>\"Freeze,\" she still says, aiming her weapon at Lecter. On the floor, Will stirs, but Lecter shushes him, Will growing still. Lecter glances over then; meets her gaze.</p>\n<p>\"Have you brought paramedics?\" he asks.</p>\n<p>Beverly doesn't answer right away, ascending the last few steps to come into the room. She kicks aside the knife she finds lying on the floor. Jack appears almost immediately at her side.</p>\n<p>\"Step away from him, Hannibal,\" he says. His hands are shaking. Lecter smiles; glances pointedly at Will's stomach.</p>\n<p>\"I'm afraid that would be inadvisable, not unless you have someone willing to take over.\"</p>\n<p>Beverly glances to Will's face, notes that he's flitting in and out of consciousness. She pulls out her radio.</p>\n<p>\"ETA on that bus?\" she asks. Zeller and Price appear at the top of the stairs. The attic is starting to feel claustrophobic.</p>\n<p>Jack glances questioningly in her direction.</p>\n<p>\"They're five minutes out,\" she says. She's not entirely sure Will's going to last that long. If the look on Lecter's face is any indication, neither is he.</p>\n<p>It makes for a rather tense five minutes, Zeller and Price retreating back downstairs to direct the EMTs, Beverly and Jack remaining in the room, guns pointed at Lecter, Lecter the only thing keeping Will alive, Jack trusting him to do so. She has no idea what has happened to get them to this point. It all feels a little anticlimactic.</p>\n<p>\"You feel like explaining what happened?\" Jack eventually says, clearly at the end of his patience. He knows better than to ask--knows nothing Lecter says can be taken at face value--but Beverly doesn't call him on it, her curiosity piqued.</p>\n<p>So, apparently, is Lecter's, amusement colouring his expression--though the stark lines of worry are still there. He glances briefly to Will before answering. \"You sent him to arrest me. I didn't particularly want him to,\" he says.</p>\n<p>Beverly frowns, because while she's glad it clears Will's name, it also doesn't make sense.</p>\n<p>\"Then why are you still here?\" she asks.</p>\n<p>Lecter swivels his head to meet her eye, his gaze unflinching. There is coldness there, but something else, a low-burning spark she cannot even begin to identify. In that moment, he reminds her of a snake, dangerous and yet not without purpose. She wishes then she had Will's gift, could figure out Lecter's purpose, understand the point of any of this.</p>\n<p>\"An unexamined life is not worth living,\" he quotes, \"and neither is an unchallenged one.\"</p>\n<p>He doesn't seem willing to say anything else on the subject, cryptic smile appearing to match his cryptic words. He continues to hold Will together, hands steady, despite the flush of his cheeks, and sweat upon his brow. Jack doesn't ask any further questions, and Lecter doesn't volunteer any information. They simply sit and wait, Beverly honestly surprised when the paramedics turn up to find Will still clinging to life.</p>\n<p>Zeller brings them up, Jack waiting only until they've secured Will enough for transport to step into Lecter's space, leery but determined. To her surprise, Lecter doesn't resist, lying flat upon his stomach, directly beside the spot where Will's blood is still pooled upon the floor. He laces his hands behind his head, allowing Jack to pull them behind his back. When Jack does so a little rougher than necessary, he doesn't complain, perfectly composed the entire time. He even goes so far as to point out the gun he has tucked in the pocket of his jacket, sitting neatly folded upon the floor. Jack kicks the jacket aside and then pats him down. He allows Beverly to lead him down the stairs, Price waiting for them below.</p>\n<p>\"As I am essentially turning myself in,\" he says on the third step, \"may I request a small favour?\"</p>\n<p>It is curiosity more than anything that makes her agree.</p>\n<p>\"Will you keep me apprised of Will's condition?\"</p>\n<p>Beverly considers for a moment; sees no reason not to share the information. Still, she can make no promises.</p>\n<p>\"I'm sure someone will let you know,\" she eventually says, nudging him forward again, still half expecting Lecter to have some plan in place; some ulterior motive they'll kick themselves for not seeing sooner. The feeling lingers, even after she has him locked into the back of the car, Beverly not sure if she should be relieved or grateful that this didn't end in bloodshed. Maybe, she thinks, a little of both.</p>\n<p>She is more than well aware the night is not over yet.</p>\n<p>The ring she wears on her left hand feels abnormally heavy today. Her hands are swollen from the flight, the band digging into her flesh, wrapped around her finger like a noose. Alana fiddles with it, contemplates pulling it off; tucking it into her purse for safe keeping. Instead she spins the stone upside-down, so that when she curls her hand into a fist it leaves a mark in her palm.</p>\n<p>She knows it's a foolish thing to worry about, that ship having set sail a long time ago--it didn't even make it into the harbour--but this isn't the first time she's walked the long length of a hospital corridor on her way to Will Graham's bedside and, given the circumstances, it's hard not to ponder the what-ifs and could-have-beens. Mostly she wishes now she'd taken the chance, however much it would have ended in disaster.</p>\n<p>That she's here now is proof of that.</p>\n<p>It's late enough in the day that the hospital is quiet, the halls empty. Alana follows the signs for the ICU, the heels of her boots echoing off the linoleum. The signs lead her to a set of glass doors, inside a waiting room where Jack Crawford sits with his head between his hands. Alana pauses outside the glass; spends an idle minute watching him, trying to reconcile the twin flares of anger and relief warring in her breast. By the time she steps into the room, she's mostly decided on resignation.</p>\n<p>Jack glances up at the sound of her footsteps. His complexion is ashen, his eyes red-rimmed from lack of sleep. Alana doubts she looks any better, and yet she still adopts an expression of sympathy, her eyes soft as she approaches his side.</p>\n<p>Jack rises; meets her halfway.</p>\n<p>\"Where is he?\" she asks, no need for formalities. They both know why she came.</p>\n<p>Jack exhales. \"He's out of surgery. They're getting him settled and then they'll let us in to see him. I don't think he's conscious yet.\"</p>\n<p>Alana nods: remembers then the last time she saw Will in hospital. He seemed so frail, so lifeless beneath the sheets. She's not entirely sure she's prepared to do this again.</p>\n<p>\"What happened?\" she asks. She didn't get the chance earlier, Jack's call waking her in the dead of the night, Alana's only thought getting on a plane.</p>\n<p>Now that she's here, she wishes she still had that journey before her.</p>\n<p>Jack doesn't answer right away, deflating somewhat before gesturing them over to a line of chairs. Alana follows him, her legs wobbly, too much sitting and not enough food. She has to brace herself against the back of the chair--geometric patterns on the vinyl upholstery--to get into it. Seated, her right hand comes immediately to her left, fingers fiddling with her ring. She turns it right-way around, diamond on display.</p>\n<p>\"It sounds like Will went after Hannibal on his own,\" Jack says, pausing to let that sink in. Relief strikes Alana so hard had she not been sitting she might have collapsed.</p>\n<p>\"Idiot,\" she says, under her breath.</p>\n<p>\"Hannibal tried to disembowel him, but changed his mind before he could get all the way through Will's abdominal muscles.\"</p>\n<p>Alana inhales sharply at that. She's already light-headed and dizzy. The mental picture does nothing to help. It frightens her sometimes, how close she once was to Hannibal, how completely oblivious she remained to his true nature. She will never forgive herself for setting Will in his path.</p>\n<p>\"What's his current condition?\" she asks. She knows Will isn't dead--Jack would have told her if he was--but she doesn't know the extent of the damage.</p>\n<p>\"I don't know much more than that. He was in pretty bad shape when they brought him in, but from the sounds of it they managed to get him stitched back together. For the record, you were right. We shouldn't have brought him in on this.</p>\n<p>She knew--Will didn't tell her, but she knew why he left; why he didn't come back. She spent the better part of six months wondering if there was anything she could have said or done differently, another six months coming to terms with guilt she didn't have any right to. When she finally let him go, decided to move on with her life, it was with the certainty that he was never coming back. Nowhere was this on her list of future plans.</p>\n<p>\"Would Hannibal have gone after him had we left him alone?\" she asks, because she's starting to understand that they've never had control. Not where Will is concerned. Certainly not where Hannibal is concerned.</p>\n<p>Jack's expression sours, answering the question long before he speaks.</p>\n<p>\"Probably,\" he still says.</p>\n<p>Alana lets that settle around her, wonders if it would have been better leaving Will on his own turf, or if in bringing him into the investigation they did him a favour. She doubts they'll ever really know.</p>\n<p>\"And Hannibal? I'm assuming you have him in custody?\"</p>\n<p>Jack nods. \"He's being held in a secure cell at the local detention centre. We should have extradition papers in the morning.\"</p>\n<p>He pauses then, catching Alana's eye, gauging her reaction. Alana braces herself.</p>\n<p>\"He's being oddly cooperative,\" Jack says, still keeping her gaze. \"And he's confessed to killing Abigail Hobbs.\"</p>\n<p>She knew of course--came to terms with it years ago--but hearing Abigail's name still hits her harder than she was expecting. She supposes some small part of her was still clinging to hope, still half expecting to spot a familiar pair of eyes in the crowd. Having confirmation doesn't make it any easier to let go.</p>\n<p>\"Did he give you the location of her body?\"</p>\n<p>Jack shakes his head, open disgust warring with his need for professionalism. \"He said, and I quote, <i>I honoured every part of her</i>.\"</p>\n<p>Alana blanches, her stomach rolling at the thought. She wants to share in Jack's disgust, his rage, but the only thing she can bring herself to feel is sorrow. That and an overwhelming sense of responsibility. There's a scream building somewhere in the back of her throat, but she swallows it, half afraid it will emerge as a sob. Instead she runs her hands through her hair, fingers curling into fists, Alana tugging sharply until hat tears come to her eyes. She lets them spill onto her cheeks.</p>\n<p>\"How did I miss this?\" she asks, not particularly wanting an answer.</p>\n<p>\"This isn't your fault, Alana,\" Jack says, impractical for once. He is comforting her, she realizes, the man beside her no longer an agent but a friend, someone whose life has been thoroughly altered by the devil hiding in their midst.</p>\n<p>Alana offers a brief smile, grateful. She scrubs the back of her hand against her cheek, wiping away stray tears. Now that she's started, she can't seem to stop. Jack produces a travel pack of Kleenex from his breast pocket. </p>\n<p>\"I think maybe I should,\" she says, gesturing to the washroom sign near the back of the room. Jack nods; tucks the Kleenex away. Alana rises from her chair.</p>\n<p>Her legs are still wobbly, but she manages to get one foot in front of the other. Exhaustion pulls at her limbs, a sharp reminder of how long it's been since she had a proper night's sleep; a proper meal. The bathroom is one of those single unisex units, a harsh fluorescent light bulb humming to life when she flicks on the switch. She closes and bolts the door behind her, moves to the sink and spends far too long staring at her reflection in the mirror, not quite recognizing what she's seeing.</p>\n<p>She gives up after a minute; turns on the tap and then splashes her face with cold water. When she's done, she combs wet fingers through her hair, attempting to tame the mess. It doesn't particularly help, but she feels better for it, Alana more or less centered when she steps back out into the waiting room.</p>\n<p>There is a doctor standing with Jack .</p>\n<p>She's wearing a set of green scrubs, newly changed, and has a clipboard held in the crook of her elbow. She stops speaking when she spots Alana; glances briefly to Jack for verification. Jack offers a brief nod, and then gestures for her to continue.</p>\n<p>The doctor glances briefly to her notes. Alana comes to stand at Jack's side.</p>\n<p>\"He's still unconscious,\" the doctor is saying, \"but the surgery went well. We're monitoring for infection, but I would say his prognosis is good.\"</p>\n<p>Alana nearly staggers with relief. She releases a breath she didn't know she was holding. \"Can we see him?\" she asks, unable to keep the desperation from her tone. The doctor glances up, expression apologetic.</p>\n<p>It changes when she meets Alana's gaze, sympathy and something Alana thinks might be understanding flashing in her eyes. She glances once to her watch, then again to her clipboard.</p>\n<p>\"I can give you a few minutes,\" she says, a very obvious breach in the rules.</p>\n<p>Alana accepts it readily.</p>\n<p>Jack declines to join them, choosing instead to remain in the waiting room, leaving Alana to follow the woman from the room. She no longer feels dragged down by exhaustion, purpose driving her forward, her heart stuttering nervously in her chest. The ICU, when they arrive, is quiet, not the flurry of activity she was expecting. Will's doctor points Alana to a wash station, where Alana scrubs up to her elbows, now having an excuse to slip off the ring and tuck it in her pocket. When she's done, she's directed to one of the beds, it's curtain obscuring her view. Alana circles around it, her breath catching when she catches sight of Will.</p>\n<p>He's paler than she was expecting, his skin almost translucent, thin blue veins visible even from the foot of the bed. She feels like she's been transported in time, like she's seeing him again after the first time, Hannibal's scar running along the length of his leg. It bothers her greatly that Hannibal has left another.</p>\n<p>She moves gingerly, treading lightly to avoid waking him. He's sedated, a steady supply of pain killers pumping steadily into his vein, but buried beneath wires and sensors, he seems impossibly vulnerable; impossibly young. She has no idea what to do now that she's here, so she settles on approaching the side of the bed; reaching out to interlace their fingers together.</p>\n<p>\"It's over,\" she tells, squeezing his hand.</p>\n<p>She has no idea if he's aware of her presence, if he's heard, Will lost to slumber, the steady rising and falling of his chest the only indication she has that he's alive. Alana remains where she's standing, watching him sleep until his doctor appears at her side; politely tells her it's time to leave.</p>\n<p>~*~</p>\n<p>He's pushing the other side of 50 and not for the first time considers what it would mean to retire. Perhaps not from the Bureau, but from active duty. He could take a desk job upstairs, no longer have to contend with the things he sees every day. He's more than earned it, but more importantly, he's starting to doubt his ability to do this job, his objectivity no longer what it was.</p>\n<p>It's late when he makes it back to Virginia, and he should go home, crawl into bed and leave the details for morning. He's not sure why he finds himself wandering the darkened halls of Quantico, bypassing his office in favour of heading down to the labs.</p>\n<p>He's clearly not the only night owl, the lights on downstairs, the security grid showing the lab occupied. He's not particularly surprised when he finds Beverly Katz inside, bent over a keyboard and looking about as wired as he feels. She glances over when she hears the door; offers the half smile of a fellow insomniac.</p>\n<p>\"How's Will?\" she asks without moving.</p>\n<p>\"Good,\" Jack says, and then amends, \"as well as can be expected, anyway. They're transferring him to John Hopkins in the morning. Alana Bloom is travelling with him.\"</p>\n<p>Beverly nods and then pushes back her chair. She stands, taking a minute to stretch her spine before coming over to stand before him. It strikes him then how long he's been working with her, his team the closest thing he has to family these days. Retirement upstairs would mean giving up the last remaining human connections he has in his life. He was never meant to retire without Bella. They were going to travel the world together. Grow old together.</p>\n<p>\"\"Everything good on this end?\" he asks. Beverly nods.</p>\n<p>\"Lecter's transfer proceeded without incidence. He's official back where he started,\" she says, sounding entirely too skeptical for someone on the far end of a successful case. Jack can't say he blames her.</p>\n<p>There's a nagging sense of unease knotting his shoulders that he can't seem to shake. He feels like they've been here before--and technically they have--like he's still missing pieces of the puzzle. His picture is complete, but he can't make any sense of it.</p>\n<p>\"This feel a little too easy to you?\" he asks, earning an arched eyebrow.</p>\n<p>\"A little?\" she asks, sarcasm heavy on her tongue. Jack shakes his head.</p>\n<p>\"I feel like I'm waiting for the other shoe to drop,\" he admits.</p>\n<p>It's probably exhaustion; the last few days blurring together, Jack needing time to process them, but no matter how hard he tries he can't figure out Hannibal's angle. Everything they know about the man, every profile he's had commissioned all say the same thing. Hannibal Lecter doesn't do anything unless it's in his best interest. Turning himself in, cooperating with the investigation, willingly returning to prison... Jack's having a hard time understanding how any of that could benefit Hannibal.</p>\n<p>He refuses to believe Bedelia was right. Men like Hannibal Lecter don't love.</p>\n<p>\"Actually,\" Beverly says, \"I'm not sure if I have your shoe, but I may be able to give you the size and style.\"</p>\n<p>She give Jack a look that's both smug and mysterious, Jack undoubtedly looking a little puzzled, because she smiles and gestures him over to the monitor. He follows, slipping in behind her chair so that he can watch over her shoulder. Beverly brings up a pair of prints.</p>\n<p>\"What am I looking at?\" Jack asks, because fingerprints are hardly uncommon in a forensics lab.</p>\n<p>\"We pulled prints from the knife used to assault Will,\" Beverly says. \"Partials, but enough to run against our database.\"</p>\n<p>She glances over her shoulder then, expression puckish, like this is the reason she's wired and at work in the middle of the night. Jack arches an eyebrow.</p>\n<p>\"I'm guessing they don't belong to Hannibal Lecter,\" he says. Beverly nods.</p>\n<p>\"Exactly. I ran the partials and didn't come up with a match, so they're not in the system, but using some inadmissible techniques, I was able to make some inferences.\"</p>\n<p>\"Inadmissible?\" Jack asks, because he really doesn't like that word. Beverly shrugs, seeming unconcerned.</p>\n<p>\"It won't help us in court, or get us a warrant, but it's interesting anyway.\"</p>\n<p>Jack considers that for a moment. He's gone the inadmissible route before--it's what got Miriam killed--and while he's not entirely sure he wants to go there again, he knows he's not going to be happy until he finishes putting this together. He nods for Beverly to proceed.</p>\n<p>\"You remember that guy in India who ran that study looking at gender disparities in fingerprints?\"</p>\n<p>Jack nods. \"Yeah, someone gave a panel on it at the last conference I attended.\"</p>\n<p>\"Exactly. Basically, women have a higher ridge density than men, so you should be able to look at a set of prints and determine gender. The margin of error is too high for field work, but...\"</p>\n<p>\"But.\"</p>\n<p>\"Best guess? We're looking at a female. Not a lot of callouses, so probably someone younger, and if their hand span is any indication, probably someone petite.\"</p>\n<p>And just like that a piece of Jack's puzzle clicks into place.</p>\n<p>\"Someone like Abigail Hobbs?\" he still asks.</p>\n<p>Beverly inclines her head.</p>\n<p>It feels right somehow, like it fits completely, and yet Hannibal's already confessed to her murder--confessed to knifing Will, too. Why would he lie? He asks as much. Beverly shrugs.</p>\n<p>\"Maybe he's protecting her? Or maybe he just likes playing with us. This,\" she gestures to the screen, \"is all speculation anyway. Without Abigail Hobbs we can't move forward, and officially she's on the records as missing, presumed dead. I'm sorry, Jack, but I think this is just going to be one of those cases that doesn't tie up all its loose ends.\"</p>\n<p>She's right, of course, but that doesn't mean Jack has to like it. He should be grateful--they all came out of this intact, including Will, and Hannibal is back where he belongs. It would be nice to find Abigail--to find their missing hospital worker--but life doesn't stay between the lines and neither does this job. Jack nods, reluctant and heavy, but he's long since come to terms with having to accept things he'd rather not accept.</p>\n<p>\"You should go home, get some sleep,\" he tells Beverly, who nods like she hadn't honestly considered the idea before then.</p>\n<p>\"You too. I'll lock up,\" she says, which Jack knows is code for <i>I need a few more minutes</i>. He gives them to her, heading out of the lab and up the elevator alone. He'll go to his car and drive the short distance to his house, then crawl into his empty bed and sleep, an entire life spent chasing demons and he's still not entirely sure what he has to show for it.</p>\n<p>Days like today, the victory isn't enough. Days like today he thinks maybe it's time to put it all away. Days like today, he misses Bella.</p>\n<p>~*~</p>\n<p>She's unaccountably nervous, which is ridiculous because she knows she has nothing to be nervous about. She's been here before, gone through every procedure they are now forcing her to endure. She has relinquished her metals; her pen. She has endured a pat down, her crisp linen suit stained by the sweat of the female warden's hands. She has walked through their metal detectors, the soles of her shoes soiled by blackened concrete. The stink of this place has already permeated her skin and she knows a single shower will not remove it entirely. She is enduring nothing she isn't entirely prepared for, and yet still her stomach twists in knots.</p>\n<p>The last time she saw Hannibal he was standing in her kitchen.</p>\n<p>He has been back inside the Baltimore Hospital for the Criminally Insane for a little more than a week now, and though Jack had requested she visit him immediately, a dig for information she has no intention of sharing, today is the first day she could bring herself to make the drive. She was still so certain Hannibal intended to kill her. It is a wonder some days that she survived their association prior to his arrest. She still scrutinizes her reflection in an effort to understand what stayed his hand.</p>\n<p>She is not, after all, Will Graham.</p>\n<p>The warden, when she has passed their many trials, leads her down a long line of hall, then through a set of glass doors and into the cell block. The patients here are violent and dangerous, but relatively calm compared to some parts of the hospital. They come to stand against the glass when she enters the room, eyeing her as she passes, some with speculation, some with intent. She ignores them; the warden bringing her to the edge of Hannibal's cell.</p>\n<p>He is lying on his cot, eyes trained on the ceiling, unmoved by her arrival.</p>\n<p>\"On your feet, Lecter,\" the warden says, anger in her tone. Bedelia remembers then that he stands accused of killing one of theirs. Funny how loyalty works.</p>\n<p>Hannibal, when he moves, does so slowly and with a good deal of grace. His time outside as done wonders for him, his complexion even, his eyes bright and alive. He spots her immediately, a brief flash of disappointment appearing in his gaze, then disappearing just as quick. When he smiles, it with the same confidence he wore across a dinner table.</p>\n<p>\"Thank you, that will be all,\" Bedelia tells the warden. She waits for the woman to leave and then pulls the chair--left for her benefit--to the front of Hannibal's cell; sits upon it.</p>\n<p>\"Hello, Bedelia,\" Hannibal says. He sounds pleased, content.</p>\n<p>\"Hannibal.\" She's not entirely sure where to start. This isn't a session she expected to have with him. She cannot even rightly call herself his psychiatrist.</p>\n<p>He doesn't make it any easier, watching her intently. There is no need for the veil anymore. She knows what he is and he knows she knows. He waits patiently for her to proceed.</p>\n<p>\"I am told,\" she begins, \"you are cooperating fully with Jack's investigation. That you turned yourself in.\"</p>\n<p>A soft smile tugs at the corner of Hannibal's lip. Bedelia knows it is not accidental. He wants her to see it.</p>\n<p>\"I am told you did so in order to save Will Graham's life, but that you were the one who injured him.\"</p>\n<p>There is no outward change in Hannibal's countenance, and yet he undeniably reacts to Will Graham's name. She senses rather than sees his worry, his concern genuine. It gives her an avenue for exploration, at the very least, one she gladly exploits.</p>\n<p>\"I met him, you know, not long after your escape. He is an... interesting man,\" she says, choosing her words carefully. Hannibal cocks his head.</p>\n<p>\"They tell me he's recovering well, that he will be as good as new in a few weeks,\" Hannibal says. She divines nothing from his tone. They could be as easily discussing the weather.</p>\n<p>\"I find it difficult to understand what you have gained from this.\"</p>\n<p>She has known Hannibal long enough now to recognize the dangers in prevaricating. He responds better to directness, his ability to manipulate rooted in subterfuge. That she gives him no handholds is perhaps the reason he continues to look upon her with admiration and respect. It is also undoubtedly the reason she is still alive.</p>\n<p>\"You are questioning my motives,\" Hannibal says, point blank accusation, and yet one she need not deny.</p>\n<p>\"I am finding it hard to understand how one man can mean so much to you. You for whom people are anomalies, puzzles, sport.\" She is not gauche enough to refer to his culinary activities. \"I am finding it hard to understand what could possibly have made this a worthy trade.\"</p>\n<p>She's not expecting Hannibal to answer--it would have surprised her if he had--but the smiles he offers tells her everything she needs to know. It is sly and amused, inordinately pleased. Jack Crawford has asked her to share the details of this meeting, and yet technically Hannibal has given nothing away. She has only her own inferences, a knowledge base that expands beyond Jack's understanding. If--when--he asks, she will tell him the truth as she sees it.</p>\n<p>Where Hannibal is concerned, Will Graham is ample motivation.</p>\n<p>The scar across his stomach is livid red, his stitches stark black. He keeps expecting to look down and find the wound has opened up; imagines he can feel the contents of his stomach spilling onto the ground. He spends an ungodly amount of time staring at it in the mirror. It's a nice match to the scar on his leg.</p>\n<p>Will runs his fingers along that one, feels the puckered ridge, the skin still sensitive to the touch. He can't bring himself to touch the one on his stomach. It feels too new, too vulnerable. Even pulling his shirt over it--cotton scratching against new skin--is enough to steal his breath. Will exhales shakily; runs a hand through his hair.</p>\n<p>The clothes Alana bought for him don't quite fit. Will can't bring himself to tell her that, so he cinches his belt a little tighter, glad at least that it rests below his scar. He looks almost human when he's done, his shirt tidy, his pants freshly pressed. He spends an idle minute scrutinizing his reflection in the mirror, but with his scars covered there is nothing to indicate the past few weeks have been anything other than a nightmare. He doesn't quite recognize himself, the man staring back at him a stranger. Will blinks; tears his gaze from his reflection and then heads back into the room.</p>\n<p>Alana is waiting for him perched on the edge of his hospital bed. She smiles when she sees him.</p>\n<p>\"Are you ready?\" she asks. She doesn't sound particularly happy. Will nods.</p>\n<p>\"Ready as I'll ever be,\" he says.</p>\n<p>Alana stands and moves to his side, bringing with her a duffle bag, inside more clothes and the few personal items he amassed during his stay. She settles it on her shoulder; catches his eye. He's never minded meeting hers.</p>\n<p>\"I spoke with your vet. Your dogs are fine,\" she says, then laughs. \"She said she has them running with her every morning, though I have no idea how she manages it.\"</p>\n<p>The thought of going home to his dogs relieves some of his anxiety, though his stomach still flutters nervously at the thought of leaving the hospital. He's overstayed his welcome, but that doesn't mean he's anywhere near ready to return to a normal life--for as much as his life has ever defined normal. Will can't bring himself to comment on it.</p>\n<p>\"We should go,\" he says, gesturing. Alana's expression falters; turns serious.</p>\n<p>\"I know you've made up your mind to do this, but I still think you should reconsider. What do you hope to accomplish by going?\" she asks.</p>\n<p>It's not a question Will can answer. He barely understands the impulse. The thought of explaining it to anyone--especially Alana--seems impossible. He can think of only person who might understand and that is the person he's going to see. What that says about him--about them--he's not prepared to examine. Not outside the confines of his head, anyway.</p>\n<p>\"I'll be fine,\" he says, hands coming automatically to his thighs. He runs his palms along their length, wiping away excess heat and moisture, shivering slightly when he brushes against Hannibal's scar. Alana clearly doesn't believe him, but she nods; accepts his decision.</p>\n<p>She follows him patiently into the hall, waiting while he signs the necessary paperwork. He has additional paperwork tucked into duffle: instructions for follow-up; a psychiatric referral; a prescription for pain killers. Will lets the nurse cut off his patient band and then nods Alana towards the door. She doesn't speak until they're outside, en route to her car.</p>\n<p>\"Do you want to stop for lunch first? Get some real food?\" she asks. Will shakes his head.</p>\n<p>\"I think I'm still digesting breakfast,\" he says. Eating is still awkward, Abigail's knife having nicked an intestine.</p>\n<p>Alana doesn't comment, but he can tell she's disappointed.</p>\n<p>It's cooler out than he was expecting, like someone flicked a switch, summer transitioning to autumn during his hospital stay. It's only early September, but it feels later somehow, like he's missed entire months instead of a few simple weeks. The sky above them is grey, threatening rain. Alana didn't think to bring him a jacket. Will rubs absently at his arms, thin layer of shirt not enough to keep out the chill. It's a relief when they reach her car.</p>\n<p>Sitting is still painful, Will climbing awkwardly inside, wincing when the seatbelt pulls too tightly against his abdomen.</p>\n<p>Alana waits until he's settled before starting the car, and while Will can tell she wants to say something--the question on the tip of her tongue--she refrains. Heavy silence settles between them, their conversations uneasy since Will woke in the hospital to find her sitting at the side of his bed. He appreciates her presence, her support, but this is beyond her understanding--beyond even his--and Will cannot help but want to escape her prying eyes.</p>\n<p>He keeps his gaze focused out the front windshield. It takes him a few minutes to realize this isn't her Prius--that that car is undoubtedly being held in an evidence impound somewhere. He hopes the Bureau has reimbursed her.</p>\n<p>\"I'm sorry, by the way, for stealing your car,\" he tells her without glancing over. He lets his gaze drift out the passenger-side window, where Baltimore is laid out like a photograph, half memory, half residual image pulled from some recess in his mind.</p>\n<p>\"I can stay, you know,\" she says, not for the first time. Will shakes his head.</p>\n<p>\"I'd rather you not,\" he says, honest. He knows he's hurt her--more than just today--and yet cannot find it in him to retract the words. She accepts them begrudgingly; continues to weave them through the city. The car falls silent.</p>\n<p>She doesn't speak again until Baltimore State Hospital for the Criminally Insane looms on the horizon. Framed against an overcast sky, the building is bleak, desolate. Will's stomach drops at the sight of it.</p>\n<p>\"I don't know if it makes a difference,\" she says, pulling up the lane, \"but I'm here for you. If you ever need someone to talk to, or if you change your mind and want a ride, please call me. I know it's awkward, but I would very much like to be your friend.\"</p>\n<p>She pulls the car to a stop in front of the main doors then, cutting the engine while the words settle between them. Will wonders if it's possible: if two people can maintain a friendship without the burden of their shared histories getting in the way. He doesn't think so, and while Alana has always been kind to him, supportive, he carries far too many secrets to allow her entirely into his heart. Still, he is grateful.</p>\n<p>\"Thank you, Alana. For everything.\" He wishes it didn't sound so much like goodbye. The softness of her smile suggests so does she.</p>\n<p>He doesn't linger, half afraid he won't be able to leave her car if he doesn't do it now. He's terrified of what he'll find waiting inside, even though this is something he's needed to do since he woke up, bereft of Hannibal's presence. Alana doesn't leave right away, her car still there when he reaches the front doors; pushes his way inside.</p>\n<p>At the administration desk, he hands over his identification.</p>\n<p>They're expecting him, Jack having already made the necessary arrangements. They still make him check his duffle bag and personal items, leaving Will only in his borrowed clothes. Without his belt, his pants sit far too low on his hips.</p>\n<p>They point him towards Chilton's office to wait, except Chilton isn't here anymore, not since Gideon. His replacement is no one Will recognizes. He comes in ten minutes into Will's wait--Will seriously considering climbing out the window--arching an eyebrow like he's genuinely surprised to find someone in his office. Will rises from his chair. </p>\n<p>\"Will Graham,\" he says, not quite making eye contact. The man nods.</p>\n<p>\"Dr. Delanco,\" he says. \"Our patient has been asking about you. I'm not sure it's entirely wise to send you in there, but I've got orders from the FBI to allow it. Far be it from me to question our government. I've only been working with the criminally insane for twenty-three odd years now, so what do I know?\"</p>\n<p>He doesn't give Will a chance to respond, gesturing over his shoulder, Will left with the choice of either losing him or running to catch up. He runs. Delanco starts talking the second Will reaches his side.</p>\n<p>\"You've done this before, so you know the drill. You've got an hour, and I will be strict with that. Also, if at any point Lecter grows agitated, becomes unstable or a threat to himself or others, you will be removed.\"</p>\n<p>He leads them swiftly from the administrative wing as he speaks, towards the cell block, where Will has to endure a pat down and metal scan before being allowed past the locked doors.</p>\n<p>\"Lecter has a preliminary hearing in two weeks to address his new charges. Anything pertaining to those charges and that hearing is off limits. We do have security footage in that area, and while we won't be recording you specifically, we will be monitoring your interactions to ensure the safety of Lecter, yourself and the surrounding population. Is that clear?\"</p>\n<p>Delanco stops then, turning to meet Will's gaze, something Will couldn't avoid even if he tried. He nods, a little overwhelmed, though completely aware of standard procedure. Delanco nods, seemingly content, though Will gets the impression he doesn't particularly care one way or another--that he's just doing his due diligence. He leaves Will with one of the wardens, gestures to a second set of locked doors.</p>\n<p>\"Lecter's through there. Your hour starts now.\"</p>\n<p>The warden waits until Delanco is gone to open the doors. He gestures Will through.</p>\n<p>He's surprisingly steady, despite the tension in his stomach, more painful than it ought to be. It's a short walk from the doors to Hannibal's cell, Hannibal's neighbours watching him pass with interest, though they are easily ignored. As far as Will is concerned, the only person in the block is Hannibal Lecter.</p>\n<p>Hannibal is watching his approaching with open fondness, a pleased smile tugging at his mouth. Will is unprepared for the shock of seeing him, his legs staggering for the first time since he arrived. He keeps them under him; crosses the final few feet until he's standing before Hannibal's cell, the only thing separating them a piece of glass.</p>\n<p>Somehow, when he imagined this, he thought the glass would make this easier, the additional barrier allowing Will to retain his composure. Instead he is acutely aware of just how little separates them; of just how much he still craves Hannibal's touch.</p>\n<p>\"Will,\" Hannibal says, sounding delighted.</p>\n<p>\"Dr...\" Will begins, then changes his mind. \"Hannibal.\"</p>\n<p>It is as if he has handed Hannibal the sun, a wide smile breaking across his face. His eyes spark with pleasure and he steps forward, so close now were it not for the glass Will could easily reach out and touch. He goes so far as to stretch out his fingers, Hannibal undoubtedly noticing the gesture, his smile growing wider. Will twitches, lets his hand fall back against his side.</p>\n<p>There are a million things he wants to ask, like why he let Abigail live, or why he sacrificed his freedom for Will's survival, and yet, standing here, staring at what Will can only assume is a genuine display of emotion, he finds he already has his answer.</p>\n<p>\"Was it worth it?\" he asks, glancing briefly around Hannibal's cell. The space is tiny, Will remembering then what it felt like to sit inside it, to feel the press of its walls.</p>\n<p>Hannibal cocks his head, amused. \"I haven't decided yet,\" he says. </p>\n<p>He gestures then, over Will's shoulder, Will following his gaze until he spots the folding chair propped in the corner. He has not requested it, but wonders now if Hannibal did. More curious than anything, he drags it forward; sets up before the glass. Hannibal retrieves a stool from his cell and mirrors Will's position. It is as if they are once again in Hobbs' attic: Hannibal's consulting room.</p>\n<p>\"The orderly, the one who helped you escape. He was tucking her notes inside your books,\" Will says. Hannibal practically grins at him. He is enjoying himself immensely.</p>\n<p>\"She initiated it, of course, much to my surprise. Our little fawn is quite resourceful. I'm glad you persuaded me to spare her life.\"</p>\n<p>Will shakes his head. \"But that's not why you did.\" If he is certain of anything, it is that.</p>\n<p>Hannibal doesn't answer, but his smile grows mischievous.</p>\n<p>\"Did she kill him, or did you?\"</p>\n<p>He spares a brief glance to the camera above his head. It's trained on the hall, not Will specifically, and it lacks a microphone, so their conversation will go unrecorded. Still, he is aware of its presence.</p>\n<p>\"Do you believe him dead, then?\" Hannibal asks. He chuckles when Will frowns. \"I begin to believe you give me far more credit than is my due. I have no idea what she did with the man. She had a considerable sum of money. She might have funded his early retirement.\"</p>\n<p>He offers the theory in the same way he used to offer theories on Will's cases, Will certain then that Hannibal knows, that this is now part of his game. For reasons Will doesn't want to examine, he has no objections to playing it.</p>\n<p>\"Tell me, Will, what hurt more, my wound or hers?\" Hannibal asks.</p>\n<p>It still strikes Will that this isn't sane--not by any definition of sanity. He should not be sitting here, engaging in play therapy with Hannibal Lecter. And yet, despite all of his common sense telling him to flee, to run back to Savannah and never look back, Will cannot quite suppress a smile. He would never admit it out loud--though he hardly needs to, Hannibal knows--but he has missed this, far more than he dares to admit.</p>\n<p>\"Tell me, Dr. Lecter, what hurt more, my leaving, or her?\" he asks. Hannibal positively beams at him, as alive as Will has ever seen him.</p>\n<p>\"Most definitely yours, my dear Will, though I think I hardly need to worry about that now,\" he answers. Will finds himself breathless under the face of Hannibal's honesty.</p>\n<p>\"Same,\" he says, watching the way Hannibal's eyes alight with excitement, the heady thrill of the chase.</p>\n<p>He stays the entire hour, time slipping inevitably away. Disappointment flares in his chest when the warden returns for him; the same disappointment flashing in Hannibal's gaze. </p>\n<p>\"And there is our hour, I'm afraid,\" Hannibal says, like this is another of their sessions, Hannibal his therapist, Will Hannibal's patient. He's not entirely sure that isn't close to the truth.</p>\n<p>Will stands reluctantly; folds and puts away his chair.</p>\n<p>\"But I never answered your question,\" Hannibal says before he can leave. Will glances over, curious.</p>\n<p>\"What question was that?\"</p>\n<p>At his side, the warden glances briefly to his watch; then towards the doors, impatient. Hannibal seems unconcerned by the press of time. Will supposes he has plenty of it.</p>\n<p>\"You asked if it was worth it,\" Hannibal says, his words heavy with meaning. Will struggles to divine their secrets.</p>\n<p>\"And was it?\"</p>\n<p>Hannibal smiles.</p>\n<p>\"I suppose I'll decide that next week,\" he says, like this has all been a ploy to return Will to his consulting room chair, like Hannibal is perfectly content to rot in jail if it means getting access to Will's head.</p>\n<p>Will knows the true answer is far, far more complicated than that.</p>\n<p>\"I'll think about it,\" he still says, unsurprised to find he means it.</p>\n<p>He gestures then for the warden to lead them from the room, not looking back. He doesn't need to. The weight of Hannibal's gaze follows him from the room.</p>\n<p>~*~</p>\n<p>She waits, discreetly--though no one would recognize her under the pale silver of her new blonde tresses--until Alana Bloom's car pulls away. She lingered over-long, though Abigail can hardly say she blames her. Were she not affiliated with the FBI, Abigail might have approached her. Dr. Bloom was kind to her. Abigail cannot say that about very many people.</p>\n<p>She doesn't pull her car forward until she's certain Dr. Bloom doesn't intend to return, and even then she feels skittish and exposed, coming a risk, and one she's not entirely sure she should have taken. Will keeps her waiting far longer than she would have liked.</p>\n<p>She cannot remain cooped up inside the car, however dangerous, tight spaces making her feel like a caged animal, too long spent in an institution. Instead she cuts the engine, heads outside and sits on her hood, the day cool but she has her coat and her scarf and besides, the sky is beginning to clear, spots of blue emerging from the greyness.</p>\n<p>The day has been miserable but she has high hopes for this evening.</p>\n<p>Baltimore State Hospital for the Criminally Insane is a lonely, isolated place. No one comes in or out, and aside from the occasional shadow passing before a window, there is no evidence to suggest there is even anyone inside. It's hard not to imagine her father ending in a place like this. Abigail wonders if she would have been allowed to visit, or if they would have given her a cell next to his.</p>\n<p>It's probably best not to think about.</p>\n<p>When the doors do finally open, it is Will who emerges from behind them. He makes it down three sets of steps before he spots her, a strange smile upon his face. He freezes, gaze narrowing, his head tilting as he attempts to reconcile the change in hair colour. Abigail smiles.</p>\n<p>\"Hello, Will,\" she says.</p>\n<p>It immediately starts him moving, Will swiftly closing the last few feet to her side. He glances nervously over his shoulder.</p>\n<p>\"Abigail, you shouldn't be here,\" he says, sounding panicked.</p>\n<p>\"I thought perhaps you might want a ride,\" she answers, ignoring his concern while gesturing to her car. Will glances towards it, then back to the hospital. When he glances back, he nods, still unaccountably nervous. She doesn't ask after Hannibal. It is obvious their meeting as gone well.</p>\n<p>She'd forgotten, in the intervening weeks about his stomach, Abigail painfully reminded when he grimaces upon climbing into her car. She's half tempted to offer assistance, but before she can move towards him he is inside, still glancing nervously around, like Jack and his agents are about to sweep in from behind the hedges. Abigail crosses casually to the driver's side; climbs behind the wheel.</p>\n<p>\"Where am I taking you?\" she says, wondering if she should offer up her apartment. Will could easily sleep in Hannibal's room.</p>\n<p>\"Um... The airport, actually. I have a flight,\" he says. Abigail nods; keys the ignition and then pulls them away from the curb.</p>\n<p>She gets to the end of the lane before his curiosity turns to suspicion.</p>\n<p>\"Did you plan this? You and he? Is that why you're here?\"</p>\n<p>Abigail shakes her head. She makes a left hand turn. It's sunny enough now that her sunglasses no longer look misplaced. She thinks the day may turn warm after all.</p>\n<p>\"Hannibal doesn't know I'm here,\" she says, and then, because this was never a part of the plan, adds, \"He has a hearing in two weeks. They're going to transfer him to the courthouse for it.\"</p>\n<p>She sees the minute it hits him, some of Will's colour draining, the rest of his good mood vanishing. He glances nervously around the car, like Jack is hiding in the backseat. When he finds it empty, he turns to stare out the front windshield. She watches him bite his lower lip; then shake his head.</p>\n<p>\"You cannot seriously be suggesting what I think you're suggesting,\" he says. He sounds angry, and maybe--though she might be imagining it--a little hopeful.</p>\n<p>Abigail changes lanes; starts following signs to the airport.</p>\n<p>\"I'm not suggesting anything,\" she says. \"I just thought you should know. I also wanted to thank you, for saving my life, for protecting me.\"</p>\n<p>She hates how small she sounds when she says it, her father still looming beside her, his expression soft, his eyes dark as he leans towards her, whispers in her ear,\"<i>I'm sorry. There's no other way.\"</i></p>\n<p>From the passenger seat, still staring at her through her father's dead eyes, Will's features twist. She watches, fascinated as the last of his walls crumble, his defenses slipping away. She is as bound to him as she is Hannibal, and she would bind them both to her, as they are to each other. She thinks, for the first time since she set off down this path, since she contacted Hannibal in the hospital, that that might now be a distinct possibility. It banishes her father from the car, Will taking his place, his expression lost, but contemplative, her seed planted.</p>\n<p>End.</p>"
}