{
  "id": "8416798",
  "url": "https://archiveofourown.org/works/8416798?view_full_work=true",
  "author": [
    "elvirakitties"
  ],
  "title": "Control It's Not What It's Cracked Up To Be",
  "rating": "Not Rated",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M",
    "M/M",
    "Multi"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Harry Potter/Severus Snape",
    "James Potter/Lily Evans Potter",
    "Petunia Evans Dursley/Vernon Dursley"
  ],
  "characters": [
    "Harry Potter",
    "Severus Snape",
    "Albus Dumbledore",
    "James Potter",
    "Lily Evans Potter",
    "Hermione Granger",
    "The Weasleys",
    "Poppy Pomfrey",
    "Minerva McGonagall",
    "Tom Riddle | Voldemort",
    "Original Male Character(s)",
    "The Dursleys"
  ],
  "additional_tags": [
    "Dumbledore Bashing",
    "James Potter Bashing",
    "Lily Evans Potter Bashing",
    "Twin Potters",
    "Wrong Boy-Who-Lived",
    "Azkaban",
    "Good Dursley Family",
    "Bad Parenting"
  ],
  "language": "English",
  "series": "",
  "published": "2016-10-30",
  "completed": "2017-08-25",
  "words": "16,556",
  "chapters": "7/7",
  "comments": "340",
  "kudos": "6,575",
  "bookmarks": "1,165",
  "hits": "142,990",
  "summary": "<p>They sent Harry to Azkaban for no reason. Harry is the Boy-Who-Lived, but everyone thinks it's his twin.</p>",
  "notes": "",
  "text": "<p>Severus looked around, no one was visiting Harry. He was disgusted by the so-called light fraction. \"How are you?\" Severus wanted to take Harry and run. What they did to him was uncalled for. What they were planning was even worse. Harry had been in the Infirmary for a week and his parents hadn't even visited him. Dumbledore and the Aurors had Harry escorted to the Infirmary. </p>\n<p>As soon as the Aurors left, Dumbledore informed Harry that he was now free. He informed Harry that Harry would be required to take his OWLs and NEWTs and that he would be returning to his parents' house as soon as Poppy deemed him fit enough. Dumbledore told Harry that a press conference had already occurred, a statement from Harry had also been released. Harry didn't speak to the man.</p>\n<p>\"Better. Why did they get me released? They know I didn't kill anyone or release the monster from the Chamber.\" Harry looked at Severus. Severus was the only person besides the Dursley family who truly cared for him. </p>\n<p>The Potters, after the Dark Lord attacked their home on Halloween in 1981, on the word of Dumbledore dumped Harry on his relatives' door. The Dursley family took him in. They raised him as one of their own. They allowed Harry to know magic and took him to Diagon Alley and provided him with all the books and anything else they could think of to prepare him for returning to the magical world. The most important person was Severus. Petunia had followed Severus advice on what books to get, what to teach Harry.</p>\n<p>Harry had spent the last four years in Azkaban for the simple reason that Harry was outshining the golden boy. When the monster was released Dumbledore and his loving magical family discovered his ability to speak to snakes. It was decided to put Harry in Azkaban for the safety of all of the students. In reality, it was because they thought he was dark and didn't want him to corrupt the students. They didn't care to find out the truth and when they did they left him in Azkaban with trumped-up charges.</p>\n<p>Harry had endured Poppy's ministrations but the only visitor he had was Severus with letters from his Muggle relatives that Severus brought him. He heard Dumbledore order Poppy to tell him when he had recovered. Dumbledore wanted Harry to now play the dutiful pawn and make nice with the Potters. Dumbledore was in for a few surprises.</p>\n<p>Severus sighed, he knew Harry had plans. He knew Harry wasn't as stupid as they hoped he was. He knew he was innocent and he was one of the few, the only one in the magical world who believed Harry was innocent of the charges the Ministry and Dumbledore leveled at Harry when he was twelve. Charges that never existed before and since. He was charged with opening a secret tunnel to harm magical beings. Harry was sentenced without a trial in a closed session.</p>\n<p>\"The Dark Lord is back. He has been back for a few years. They believe that if they toss you out in front of him that it will protect the Idiot-Who-Lived for a bit longer. Give him time to get more training in. The reality is that no amount of training will get rid of his ego, improve his lack of power, or ability to wield magic.\" Severus had voiced his objection to their plans. He wanted to speak to Harry about the Dark Lord. It would have to be after Harry got out of the Infirmary.</p>\n<p>\"I have no idea how they think that is going to work, I do hope they realized Azkaban inmates get a very good education.\" Harry gave Severus a smirk. When they first tried to bring the charges against Harry, Severus had taught him the Patronus Charm as well as a few other handy spells that helped him increase his ability in wandless magic in the months leading to Harry being arrested before Hermione had been petrified. He also gave Harry a lot of potions to aid him Azkaban, ones that were illegal but Severus wasn't going to let Harry suffer especially since he didn't do anything illegal.</p>\n<p>\"They want you to return to Hogwarts and start your seventh year.\" Severus had already cast a privacy ward around them. They had made a number of plans for Harry, all focused on having Harry play the bait. Severus wasn't going to allow them to use Harry.</p>\n<p>\"Interesting.\" Harry looked at the pile of books on the table next to his bed. \"I read those already, can you bring me some more?\" Harry knew Severus would help him and he wouldn't even have to ask.</p>\n<p>Before Severus could answer, the door to the infirmary was pushed opened and in came Barry, Harry's twin, with his two cohorts, Hermione Granger and Ron Weasley. \"Where is Poppy?\" Barry demanded. The boy was filled with his own self-importance. Harry had black hair, Barry had brown hair with a reddish tint. Barry had brown eyes like his father James. Harry had the killing curse green eyes. Barry was overweight, average height, and slightly tanned skin from flying. Harry was rail-thin, tall, and pasty white from his time in Azkaban.</p>\n<p>\"Madam Pomfrey was called away. What is the issue?\" Severus stood up. He looked at the so-called golden trio and he wanted to curse the three of them. Their egos had inflated over the years. The brat and his two friends were bullies and used to getting their own way.</p>\n<p>\"I came to see my brother.\" Barry said the word brother was it was like a disease. \"What were you talking about?\" Nothing bothered the boy more then not being in the know on something. Barry hated when his parents or Dumbledore kept things from him. Hated not being the center of everyone's world.</p>\n<p>\"We were having a theological conversation regarding the educational system Azkaban provides.\" Harry looked at Severus, who shrugged and faced his brother. \"In words, you can understand, we were talking about school.\" Harry didn't like any of the Potters since he first met them after they were disappointed in his sorting. They didn't want a snake in their family. They demanded that he be re-sorted but Harry refused to get re-sorted. They were furious at his friendship with Severus. They loathed the fact that a child of theirs was in Slytherin and didn't worship their precious son Barry. James Potter also never go of his hatred of Severus and it was a mutual feeling. James never wasted an opportunity to try and degrade Severus, he usually failed.</p>\n<p>\"I am to tutor you.\" Granger stated. \"I will bring you the books. We can study for a few hours before I need to head to dinner in the Great Hall.\" She fell into the trap of the Brat-Who-Lived self-importance and didn't believe she could ever be wrong about anything. The girl spent more time trying to get her two idiots to pass their classes and studying, combined with her love of Dumbledore and Barry, made the girl impossible to handle.</p>\n<p>\"No, you won't. I want nothing to do with you.\" Harry had already sent an owl asking to take his OWLs and NEWTs as soon as possible. He wasn't going to stay in Hogwarts and under the control of Dumbledore or allow his parents to control him. They were fools, with their assumption, that he would just follow their direction. He already wrote to Aunt Petunia to let her know what was going on. </p>\n<p>\"I will be handling Mr. Potter's education requirements.\" Severus ignored the Idiot-Who-Lived, his useless best prat, and the arrogant know-it-all. He had spent the last few years removing points and giving them detentions, much to the annoyance of Dumbledore and Potter, Sr. The staff actually supported him on it so the Golden Idiots, as he called them, had to serve the detentions.</p>\n<p>\"Dad said he is coming home with us for the summer. Dumbledore said you were coming home with us next week. You will be taught your place.\" Barry couldn't wait for them to put Harry in his place, next week they would be taking him to Gringotts to remove Harry as heir but not from the family, well, not until after Harry did his job in regards to being a decoy for him.</p>\n<p>Harry laughed, turned to Severus. \"So am I still a snake?\" He wanted to get his Mastery of Potions and Defense and was hoping Severus would take him on as his apprentice. They had spoken about Harry becoming one during their second year. </p>\n<p>\"Once a snake, always a snake.\" Severus reassured Harry. He needed to get Harry away from Hogwarts or to his quarters where they could speak without anyone interrupting. He knew Dumbledore would force Harry to remain at Hogwarts if he could. He also knew they would try to force Harry into whatever role they wanted him to take and neither of his parents would care if he died from their plans.</p>\n<p>\"He is going to be re-sorted. Professor Dumbledore said so. They are inviting Rita and the Minister to the ceremony.\" Granger's tone held that smugness that made Severus want to hex the girl. Her two friends were also gloating. He couldn't wait for them to learn their places. </p>\n<p>Harry and Severus exchanged a look but selected to ignore their comments. \"What do you want?\" Harry asked.</p>\n<p>\"Nothing, I can see you are awake and can talk. So we will be back with our parents and the Headmaster.\" Barry stood up taller with the task of doing a job for the Headmaster. \"They are meeting in the Headmaster's office right now.\" Harry and Severus waited for them to continue. \"You know, you were only released because the Headmaster allowed you to be released.\" </p>\n<p>Granger gave him a look but didn't say anything. The true reason why because they found Ginny Weasley with the dark mark on her arm and under Veritaserum, she admitted that it was her that opened the Chamber and when Madam Bones found out about Harry being in Azkaban, she demanded his release. Originally the only people who knew that Harry was in Azkaban were the Potters, some Order members like Mad-Eye and Kingsley, the Minister, and a select few Wizengamot members, who in a closed session sent Harry to Azkaban. When Madam Bones learned from the integration of Harry being imprisoned, she set to make it right. </p>\n<p>\"Leave.\" Harry didn't want them around him. He never could stomach the Potters. </p>\n<p>Severus and Harry watched the trio turn around and leave with Barry stopping at the door and saying \"see you soon, brother.\" </p>\n<p>As soon as the doors were closed, Severus and Harry exchanged looks. Harry raised his an eyebrow. \"Time to leave?\" </p>\n<p>\"Yes.\" Severus grinned. \"I do believe it's time to visit Gringotts and take control.\"</p>\n<p>Harry matched his grin. \"Time to get rid of the old man and the fake.\"</p>\n<p>\"Petunia, Vernon, and Dudley are already at the manor.\" Severus told him. \"You able to do it?\"</p>\n<p>\"Yes, ready?\" Harry stood up from the bed. He snapped his fingers and his sleepwear was changed into his regular clothes. He held out his arm and Severus took hold of it. \"I hope it gives him a concussion.\" Harry then apparated them to Prince Manor, taking down the wards of Hogwarts.</p>\n<p>\"Harry.\" Was heard as they landed in the sitting room at Prince Manor. </p>\n<p>\"Aunt Petunia, Uncle Vernon, Dudley.\" Harry was swept into their arms. \"Need to breathe.\" He was happy. He was in the arms of people who really cared for him. Not as cannon fodder, to be used and discard but people who wanted the best for him.</p>\n<p>\"Oh, Harry, we were so worried.\" Aunt Petunia said as they released him. She eyed him up and down. \"You need some food. You are too skinny, young man.\" She looked over at Dudley who was well muscled from boxing. Dudley wasn't fat any longer and she knew she would have to take it slow with Harry. Dobby was able to bring Harry regular meals but they couldn't do too much or someone might have noticed he was too healthy for being in Azkaban.</p>\n<p>\"I will get us some tea. I know there are some fresh biscuits in the kitchen. I believe a certain elf is going to be excited to see you here.\" Severus left the room. Severus didn't want to take a chance on a hyper elf making tea. Dobby had been very eager to see Harry out of Azkaban. </p>\n<p>Dobby had been the one who took the books to Harry along with collecting Harry's assignments, any letters and things that Harry needed while in Azkaban from clothing to food. \"We don't have much time. As soon as Dumbledore realizes I am out of his reach he will go to the Ministry and Gringotts.\" </p>\n<p>\"He will go to the Ministry first. Amelia is already aware of the situation and will delay him.\" Vernon held up the letter from her. \"She said the paperwork for us to adopt you can't be filed until you remove yourself from the Potter family. Once we do that you can become a Dursley.\" He was so proud of Harry. He was proud of both of his sons but Harry had endured a lot and didn't turn bitter.</p>\n<p>\"We can do that after some tea. The Ministry can't do anything at Gringotts as the goblins are their own nation and don't fall under the Ministry rules.\" Harry knew they only had to get to Gringotts and they would be safe. It wouldn't take much to get them there. Severus would be putting on the glamors, as Harry didn't want to take a chance a trace might still be on his wand. \"Tell me what has been going on?\"</p>\n<p>\"My lovely sister.\" Petunia spat sister out, not able to keep her fury out of her voice, \"decided that we weren't allowed to see you any longer. Threatened to have a restraining order placed on us. She said she and James were going to teach you to be a wizard this summer and went on about your returning to Hogwarts. Told us we failed as parents.\" The disgust in her voice wasn't hard to miss. \"She tried to say she paid us to raise you. I am so thankful Vernon kept such great records.\"</p>\n<p>\"Yes, I sent a copy to Amelia already as well as a copy to Gringotts for them to have copies placed in Severus' vaults. I have a copy in my safety deposit box at the bank, and Aunt Margie has a copy too. She said she can't wait to see you, again. I won't mention what she would like to do to your parents.\" Vernon had a huge file he had sent over to Amelia, including all their bank statements, showing no money was ever received by the Dursley's for Harry's care. They saved all letters, dated, and had them witnessed by Severus and his family.</p>\n<p>\"I can imagine. However, wouldn't want Ripper to get sick from biting them.\" Harry laughed. </p>\n<p>\"Your brother was a right ponce. You should have seen him at the house, his nose was so far up in the air I thought he would get a nosebleed. Piers and a few of our friends wanted to teach him a lesson, but Mum wouldn't allow it.\"</p>\n<p>\"Of course not, we don't need to sink to their level.\" Petunia stated, \"besides, I think if he broke a nail he would have gone crying to his mother.\"</p>\n<p>\"I agree. Though waddling would be more the term.\" Vernon added. </p>\n<p>Severus arrived back with tea and Dobby following him. The little elf saw Harry and ran to him, wrapping his arms around Harry's legs. \"Master Harry is here, finally. The bad man wanted to keep you but we get you safe.\" Dobby started bouncing around Harry. Dudley was laughing as Petunia and Vernon just enjoyed the scene. </p>\n<p>Soon the group made their way to Gringotts. Severus had an appointment with Prince Account Manager. They had seen some Aurors as they made their way to Gringotts but they didn't appear to be searching for Harry as of yet. Severus, being Severus, placed glamors on them and they encountered no issues. Severus agreed with Harry about the trace and they didn't want to take a chance that his magical signature was being watched too.</p>\n<p>\"May the blood of your enemies flow a river worth of gold to your door.\" Severus greeted the teller. </p>\n<p>\"May your gold increase tenfold and we all make a profit off of it.\" The teller replied.</p>\n<p>\"We have an appointment with Goldax.\" Severus told him. </p>\n<p>\"We have been expecting you. Smolt will guide you to his office.\" </p>\n<p>Once everyone was settled, Harry explained the problem. \"I was sentenced to Azkaban for a crime I didn't commit.\"</p>\n<p>\"We are aware and I did some digging. From what I learned, you want to remove yourself from the Potter family and adopted by your Muggle aunt and uncle.\" </p>\n<p>\"Yes, we have a detailed accounting showing how we supported Harry with no help from his parents.\" Vernon held out the folder. \"They left him on our doorstep in the middle of the night in November. We raised him from fifteen months on.\" </p>\n<p>\"I have reviewed it. I got the copy that went into Lord Prince's vaults. I will require an Inheritance Test and we will move forward from that.\" </p>\n<p>\"An Inheritance Test? Why?\" Severus knew Harry wasn't going to mind giving up the Potter title. He didn't want it. </p>\n<p>\"Trust me.\" Goldax smiled. \"It will prove to be very informative.\"</p>\n<p>\"Should we take one?\" Petunia asked.</p>\n<p>\"Yes, as we found some interesting information.\" Goldax informed them. </p>\n<p>Severus watched the testing and everyone was surprised. They were all looking at the four test results, no one spoke for a few minutes as they reread the results.</p>\n<p>Vernon Elliott Dursley </p>\n<p>Father: Milton Everett Dursley<br>\nMother: Martha Elizabeth Dursley nee Kilton</p>\n<p>Title:<br>\nHamilton (non-claimant)</p>\n<p>\"What does that mean?\" Vernon was staring at his test results. He wondered how this was going to help them with the situation.</p>\n<p>\"I will explain it all in a minute.\" Goldax again smiled. He was going to enjoy their surprise.</p>\n<p>Petunia Daisy Dursley nee Evans</p>\n<p>Father: Henry George Evans<br>\nMother: Violet Dorothy Evans nee Wilson</p>\n<p>Title:<br>\nEvans (non-claimant)</p>\n<p>Dudley Robert Dursley</p>\n<p>Father: Vernon Elliott Dursley<br>\nMother: Petunia Daisy Dursley nee Evans</p>\n<p>Title:<br>\nHamilton (non-claimant, heir)<br>\nEvans (non-claimant, heir)</p>\n<p>Harrison James Potter</p>\n<p>Father: James Charles Potter<br>\nMother: Lillian Rose Potter nee Evans</p>\n<p>Title:<br>\nSlytherin (co-heir)<br>\nGryffindor (heir)<br>\nPeverell (co-heir)<br>\nPotter (heir)<br>\nBlack<br>\nHamilton (claimant, heir)<br>\nEvans (claimant, heir)</p>\n<p>\"They are planning on removing you next week from your position as heir but not removing you from the family. We found it interesting that they didn't get an Inheritance Test if they had they might have done this sooner. Now, here is where we can help. There is an old law on the books, it's never been used because it's never happened before. When an underage wizard or witch has any type of trial in the Wizengamot they have automatically been declared an adult.\"</p>\n<p>Now everyone was grinning. \"What do you suggest we do Goldax?\" Vernon asked. \"What does this non-claimant mean also? Does it help?\"</p>\n<p>\"It does. It means because you are Muggles and the titles belong to wizarding families you can't claim them, however, Mr. Potter can. As he is in line and a full wizard.\" Goldax replied. \"Even if you don't do the blood adoption, he can still claim them. Now, the key part of this is he can't claim the Potter Lordship but he can claim the heirdom. If he does, he would be subjected to Lord Potter's decrees. If Mr. Potter removed himself from the Potter family, they can't do anything. Now, you see the Black title is here also? Sirius Black was also sentenced to Azkaban and he was innocent, however, in the family charter, he can't claim the title. They plan on next week, making your brother the new Lord Black.\"</p>\n<p>\"If I claim it today along with the other titles, remove myself from the Potter family, they can't do anything? Dumbledore will have no say?\" </p>\n<p>\"Exactly. The Black family motto is Toujours Pur, always pure. A lot of people like to think it meant in reference to blood purity, however, the motto came about during the time when chivalry was the code of honor. It meant you kept your honor, the code of being a Knight.\" Goldax explained. \"I should mention one thing I am worried about as we couldn't find any law preventing this but if you get adopted by your aunt and uncle, you might be classified being underage again, since you still a minor in the muggle world, but not in the wizarding world. Dumbledore might use it as a way to retain control and make himself your magical guardian.\"</p>\n<p>\"Would that work if I attained my NEWTs?\" Harry asked.</p>\n<p>\"The only information we could be certain of in regards to your NEWTs and this situation is that if you have your NEWTs they can't force you to return to Hogwarts.\"</p>\n<p>\"However, Dumbledore, if they did the adoption, could petition to be his magical guardian since they are Muggles?\" Severus knew Dumbledore would do exactly that. He wasn't going to let Harry escape his clutches, especially since he wanted to toss the boy in front of the Dark Lord. </p>\n<p>\"Yes.\" </p>\n<p>\"Can we be tested to see if we might be a squib? Would that give us some power in this world?\" Petunia questioned.</p>\n<p>\"Not in regards to stopping Dumbledore. It would enable you to do the adoption and claim magical guardianship, however, it would be brought before the Wizengamot.\"</p>\n<p>\"Which Dumbledore and Potter would fight.\" Vernon stated. \"Harry, take the titles and disown the Potters. You know you are our son in our hearts where it counts.\"</p>\n<p>\"I agree, Harry.\" Petunia and Dudley added. </p>\n<p>\"Besides, I say we stick it to them.\" Dudley went a bit further in his comments. \"Your brother is a tosser.\"</p>\n<p>\"Severus?\" </p>\n<p>\"I agree. I do want to suggest one more thing.\" Severus felt it was time to mention it. \"I don't know how you feel about this as we haven't had a chance to speak about it. I would like for you to talk to the Dark Lord. He has been aware of the situation and he wanted to actually break you out. He only refrained because I told him about this plan.\"</p>\n<p>Harry smiled. \"I already sent him a message. I believe it's time we get rid of the light fraction and go with a more neutral fraction.\"</p>\n<p>\"I wrote to him too.\" Petunia said. \"I was worried about what was going to happen and asked that if we couldn't protect you that he would. He agreed.\"</p>\n<p>\"Pet!\"</p>\n<p>\"MOM!\"</p>\n<p>\"Petunia!\"</p>\n<p>\"Aunt Petunia!\" </p>\n<p>\"What? I wasn't going to allow that old man to hurt you any longer. I have been reading the papers. The things in the English papers didn't match with the foreign ones. All those raids, the reasons, the dates, and figures didn't agree. I figured it had something to do with the Ministry and Dumbledore. They had to be controlling the English ones.\" </p>\n<p>\"They have been. They list a death count but never any names and no Wills, paperwork, or even death clauses on vaults trigger.\" Goldax informed them. \"If you wish I can broker a meeting for your party to meet with him.\"</p>\n<p>\"Yes, I take my exams in two weeks, well my OWLs, I want to speak to him before then. I don't want to take a chance on going to the Ministry with just Severus for protection.\"</p>\n<p>\"We might be able to get the examiners to come to Prince Manor. I will speak to Lord Malfoy.\" Severus made a list in his head of what he needed to do. \"After your NEWTs, we will speak about some apprenticeships as extra protection.\" </p>\n<p>\"Goldax, I believe I have some titles to claim and the greatest honor of removing myself from the Potter family.\" </p>\n<p>\"I will ask the questions, you affirm your answers. In the end, you can remove yourself.\" Goldax stated. \"Do you Harrison James Potter declare your parents, James Charles Potter and Lillian Rose Potter nee Evans, provided no support during your life?\"</p>\n<p>\"I, Harrison James Potter, so declare.\"</p>\n<p>\"Do you Harrison James Potter declare that your parents, James Charles Potter and Lillian Rose Potter nee Evans abandoned you to the Dursley Family?\"</p>\n<p>\"I, Harrison James Potter, so declare.\"</p>\n<p>\"Do you Harrison James Potter declare that your parents, James Charles Potter and Lillian Rose Potter nee Evan abandoned you during your time of need, placing you in great danger for a crime you didn't commit?\"</p>\n<p>\"I, Harrison James Potter, so declare.\"</p>\n<p>\"Do you Harrison James Potter declare that your parents, James Charles Potter and Lillian Rose Potter nee Evans have no intention of seeing to your best interest?\"</p>\n<p>\"I, Harrison James Potter, so declare.\"</p>\n<p>\"I, Goldax of the family Rixtal, of the Goblin Nation, hereby decree that the requirements have been achieved, you may now remove yourself from the Potter line.\"</p>\n<p>\"I, Harrison James Potter, declare myself no longer part of the Potter family, I declare myself free of any claims on the titles, duties, and requirements in remaining in or pertaining to any part of the Potter family. I decline to give up the Potter family magic, as by rights of Lady Magic, I have attained the right by abuse and neglect of an heir. So mote it be.\"</p>\n<p>\"So mote it be.\" All replied.</p>\n<p>\"Your new name?\"</p>\n<p>\"Harrison James Peverell.\"</p>\n<p>\"Harry?\" Severus asked he wasn't sure what Harry meant by taken that name. </p>\n<p>\"I can't take Slytherin without speaking to the Dark Lord. I refuse to take Gryffindor, Dumbledore would love that. Peverell, however, is above Potter in the family line. I want to remove any vaults associated with that title out of Potter's hands, the same with property and anything else you can do to them with these titles.\"</p>\n<p>Severus smirked. \"Might I suggest, after Goldax gets everything sorted, you remove them from the family and remove the family magic?\"</p>\n<p>\"You read my mind.\" Harry replied.</p>\n<p>\"Oh, I wish we could see their faces when they find out.\" Petunia commented.</p>\n<p>\"If they find out here, I will see about collecting the memories and will enjoy reviewing them with you.\" Goldax stated. \"I know a lot of us will enjoying watching them brought down a few notches.\"</p>\n<p>\"May we use your floo to return? I don't want to take a chance that the Aurors are now looking for us, we have been here for a bit, and I am sure Dumbledore has gotten around Amelia by now.\" Severus stated.</p>\n<p>\"Yes, we already arranged for it to happen. I will take you to them via our tunnels so you won't have to enter the main lobby.\"</p>\n<p>Dudley started laughing as he was reading the Daily Prophet. \"Dudley?\" Harry asked. Everyone was actually looking at Dudley wondering what was going on. Severus' paper laid folded on the table.</p>\n<p>\"You are going to love this. It seems Barry had fit in Gringotts and one in Hogwarts.\" Dudley wiped a tear from his eye. \"It turns out they were in the Great Hall having lunch when magic removed the Peverell and other family lines for the three of them.\" </p>\n<p>\"Does it show what they look like now?\" Petunia was going to frame this article.</p>\n<p>\"Yes, but let me finish telling you this.\" Dudley started laughing again. \"Sorry, but it has a picture of Barry on the floor beating his fists into the stone on the front page.\" He showed them the photo and all of them started laughing. They could see Granger and Weasley were trying to comfort their friend but it looked like Barry hit Granger in the face in this fit.</p>\n<p>\"It's told by a few students.\" Dudley explained. \"The reporter named Mike Wallace just uses a lot of quotes at the beginning. Let me read those to you.\" He adjusted the paper, allowing him to better read the beginning again.</p>\n<p>\"Magic just started swirling around them, the Potter family looked frozen for a few seconds. They started screaming as magic started stripping them of their looks.\" Neville Longbottom, a seventh year Gryffindor, stated. \"They did something to make Lady Magic angry at them.\"</p>\n<p>\"Lady Magic did something to them. The magic felt angry. It slashed through them as they were screaming. When it was over, Barry started having a fit about how he was going to make someone named Harry pay for this when they got him home for the summer.\" Colin Creevey, a sixth year Gryffindor, said. \"He started using words that I can't repeat. My mother would kill me if I did.\"</p>\n<p>\"The wind and static in the air cracked as it ripped through the three of them. You could feel it, it was savage, wild, and wanted to punish them.\" Lavender Brown, a seventh year Gryffindor, stated. \"It did nothing for their looks.\" </p>\n<p>\"Lord Potter started screaming about killing his son.\" Ian Avery, a first-year Slytherin told us. \"Started cursing him, the Headmaster had to put a silencing charm on him.\"</p>\n<p>We have many quotes all describing the fit that Barry Potter had in the Great Hall until his mother got him out of the hall.</p>\n<p>\"He was swearing, screaming about killing his no-good brother. Don't use my name, those three will come after me.\" This reporter noted that a lot of students felt that way about Barry Potter, Hermione Granger, and Ronald Weasley.</p>\n<p>\"He started describing how he was going to make sure his brother paid for everything. He was going to beat him up to casting some really dark curses at him. He talked about making sure You-Know-Who killed him.\" Theo Nott, a seventh year Slytherin stated.</p>\n<p>\"I can't believe the curses he was yelling about casting on his own brother.\" Draco Malfoy added, another seventh year Slytherin.</p>\n<p>Headmaster Albus Dumbledore issued a statement shortly before our deadline stating it was a private family matter and everything would be fine. The Potter family was just confused about what occurred and everything would be straightened out shortly. It was a slight misunderstanding. That statement lasted as long as it took them to arrive at Gringotts. The Potters with Headmaster Dumbledore accompanied by some Aurors were escorted into one of the account managers meeting rooms. After ten minutes, all the patrons in Gringotts heard a horrific scream of denial. </p>\n<p>\"It was awful, the scream made it sound as if someone had died.\" An elderly witch remarked. </p>\n<p>\"We all witnessed such an unbecoming display of manners as Lord Potter started yelling at Ironclaw about his vaults being closed. He even accused the goblins of stealing from him. They were right in the lobby standing at the teller area, demanding something be done about their vaults. They were being escorted out of the bank after a second trip into the conference room.\" Lord Thurston stated. \"Ironclaw explained they only had their personal vault and the trust vault.\"</p>\n<p>\"I didn't even know it was Lord Potter and his family until Dumbledore yelled for him to calm down.\" Another witness stated. \"They all lost their good looks, what we thought was the Potter's hair is really now just a nest of dull brown hair.\"</p>\n<p>\"One of the goblin warriors had to force all of them into a conference room as the Brat-Who-Lived started tossing a fit, screaming about killing someone named Harry. How Harry ruined everything. He started screaming that Harry needed to be killed by You-Know-Who.\" Lady Greengrass, in this reporter's opinion, was shocked by the words and actions the Potter family displayed in Gringotts. The goblins escorted them into the conference room to allow them to get control over their emotions afterward they were escorted out of the bank.</p>\n<p>Being a dutiful reporter, I headed to the Ministry to find out what I could. I hope you're ready for this because I know it took me a while to process what has occurred. I spent hours researching how this occurred and I can only say the Potter family got what they deserved. </p>\n<p>Now in November of 1992, I am sure everyone remembers how we reported the Chamber of Secrets (see page 3 for a reprint of the article) had been opened. What no one knew was they blamed Harry Potter for opening it. In a closed session of the Wizenagamot with the Potter family and a few other members, including Minister Fudge and Undersecretary Dolores Umbridge, sentenced the twelve-year-old child to Azkaban in February of 1993. The crime opening the Chamber of Secrets. That is right, just for opening it. They didn't release him either when they realized he was innocent. That is right my readers, the Potter family left their oldest in Azkaban with the Headmaster doing nothing to aid the child. What kind of Headmaster do we have that would allow an innocent child to remain in Azkaban?</p>\n<p>Now, it gets worse my dear readers. They only released him because they caught Ginevra Weasley with the dark mark on her arm and she confessed to opening the Chamber and that was three weeks ago. In the course the search for the truth, Madam Bones learned about Harry Potter and she was the one who arranged to have Harry released. </p>\n<p>We learned from sources inside Hogwarts that the Potter family planned on having Harry removed as the heir but keeping him in the family. Dumbledore planned that Harry would fight He-Who-Should-Not-Be-Named until Barry was ready to face him. However, in a brilliant move by Harry Potter, he beat them at their own game. Harry Potter, now Lord Peverell, removed himself from the family and took up his titles. He removed the Potter from the family lines that he is Lord of. The removal was witnessed by those in the Great Hall. All I can say, I am sure this feeling is shared by all, is kudos to Lord Peverell.</p>\n<p>\"Does it show a picture of them?\" Petunia asked.</p>\n<p>\"Yes, look.\" Dudley laid the paper down and they all could see Lily now had dirty blond hair, her skin had a yellow tint to it, and she looked gaunt and older. Her eyes weren't the brilliant green any longer, they looked hazel. James looked to be Lily's height, instead several inches taller than her. His hair looked like it was a nest of nasty brown hair, his skin was saggy and he looked older also. He lost his broad shoulders and looked like a skeleton. He was wearing glasses so they weren't sure if his eyes changed. Barry was even fatter and was squinting. His hair looked filthy and his face was all blotchy and red. His clothes were too tight and looked ready to rip. He looked like a filthy beachball. </p>\n<p>\"Couldn't happen to better people.\" Vernon commented. </p>\n<p>\"Do you think they are going to try and bring this before the Wizenagamot?\" Petunia asked as she took the paper. \"I want to frame this.\" </p>\n<p>Harry smirked. \"I want to preserve a copy.\" </p>\n<p>\"Dumbledore might try but I believe he is going to work on his image before he can counter this.\" Severus remarked. \"I am expecting we will hear something from the Order, the Potters, and Dumbledore himself today.\"</p>\n<p>\"I need to review for my OWL on Defense and Transfiguration. Dudley, you want to quiz me?\" Harry asked.</p>\n<p>\"Sure, how soon after the tests will you get your results?\" Dudley asked. They could see Petunia was re-reading the article again. She couldn't stop smiling.</p>\n<p>\"I am not sure. Severus?\" </p>\n<p>\"I would expect it won't take long. Since it's only a few students who are taking them not all of the fifth year of Hogwarts. I expect they will grade them the same day. So most likely next week.\" Severus answered.</p>\n<p>An owl arrived with a red letter. \"It must be for me.\" Harry grinned as the letter opened.</p>\n<p>\"HOW DARE YOU? HOW DARE YOU DISGRACE OUR FAMILY NAME LIKE THAT. YOU BETTER HAVE A DAMN GOOD REASON FOR THIS. I DEMAND YOU PRESENT YOURSELF TODAY. YOU WILL REINSTATE US, YOU WILL FACE YOUR PUNISHMENT FOR THIS SORRY EXCUSE OF BEHAVIOR. DON'T MAKE ME COME AND FIND YOU BOY!\" James' voice faded.</p>\n<p>\"HARRY JAMES POTTER, YOU SHOULD BE ASHAMED OF YOURSELF. DISGRACING THE FAMILY LIKE THAT. HOW DARE YOU. YOU WILL OBEY YOUR FATHER AND PRESENT YOURSELF AT THE MANOR NO LATER THEN NOON.\" Lily sounded like she was refraining from cursing Harry.</p>\n<p>\"Harry, my boy, I feel saddened that you are heading down such a dark and dangerous path. You must reunite with your family and fulfill the role you were destined for. Your family loves you. I am sure we can resolve this slight misunderstanding.\" </p>\n<p>The Howler fell to the floor. Harry started laughing. \"I guess the dumb in Dumbledore is there for a reason.\" </p>\n<p>\"I think he has eaten too many lemon drops.\" Severus commented. </p>\n<p>\"I hope they aren't expecting that to work?\" Petunia asked.</p>\n<p>\"No, but I am willing to bet they went to Spinner's End and Privat Drive to see if they could find us. I hope they liked the alarm system I had updated.\" Vernon held up a letter from the security company. He read the letter and passed it Petunia. \"It seems they arrested them last night but were released this morning.\"</p>\n<p>Harry spent the next few weeks working and taking his exams. It had been a tense time because for some unknown reason Dumbledore had tried to stop the test of everyone. The Ministry was in chaos because of all the delays and rescheduling. There were almost daily announcements stating that they weren't sure if the exams were going to happen. Harry, after two weeks, wondered aloud if the tests had to be taken at the Ministry or Hogwarts. They were sitting the library working on their own different projects.</p>\n<p>Severus started laughing. \"They don't. We can arrange for a private tester to come to either here or Gringotts to take the tests.\"</p>\n<p>\"Let's get a private tester, have them send the notices out to all who want to take the tests. I am sure the Ministry would love that problem being solved. We arrange the times at Gringotts. Dumbledore won't be able to keep anyone from taking the exams or block anyone from entering Gringotts.\" Vernon was relaxing after a long day at work. </p>\n<p>\"Dumbledore will be furious. I say do it.\" Dudley had already taken his end of year exams and was working on his seventh-year studies to see if he could test out early and go to university a year earlier. He had already been accepted.</p>\n<p>\"I agree, Severus. Can you make the arrangements?\" Harry asked </p>\n<p>\"Yes, and I am thinking I am going to be sending out the notice to all of my snakes who are in their seventh year and who will be entering their seventh year.\" Severus began to make the arrangements in his head. He looked at Harry. \"When do we want to arrange a time to sit down with the Dark Lord?\"</p>\n<p>\"He was willing to wait until I got all my exams finished. Why not ask him about the rest of the snakes and others, he might have more who are interested.\" Harry responded. </p>\n<p>\"Indeed.\" Severus summoned a quill, ink, and parchment and began to make a list. </p>\n<p>\"How was your day, Vernon?\" Petunia asked as she entered the room. She had been in the kitchen working with the elves on making dinner.</p>\n<p>\"Busy, it seems Dumbledore has a few people watching our house and my work. Mr. Sumton called the police on them and had them arrested for trespassing.\" Vernon grinned. \"Dumbledore showed up afterward, demanding Mr. Grunnings drop the charges. Mr. Sumton had already spoken to Mr. Grunnings and informed what was going on. Mr. Grunnings called security while Dumbledore was yelling at him. Security escorted him out of the building and we watched him get arrested too.\"</p>\n<p>\"I should be getting another howler again.\" Harry grinned. \"Is there a way to send them back with a bit of a surprise for them?\" Harry asked.</p>\n<p>\"There is. Come I will show you the spell while Dudley picks the potion from this book.\" Severus stated. Harry hadn't had any time to learn what Severus considered prank spells or potions and Severus was enjoying showing him how he got the Marauders back.</p>\n<p>_____________________________________________________________________________</p>\n<p>\"Here they come.\" Petunia laughed as they saw three howlers being delivered by one of the Hogwarts' owls. The red envelopes were frozen by Severus and Harry before they could open. Before the owl could leave Severus cast a quick Confundus on the poor Hogwarts owl. He flapped around the room until Dudley opened the window and it flew out.</p>\n<p>\"Shame we can't put up anti owl wards until after I take my exams.\" Harry waited as Severus cast detection spells on the howlers.</p>\n<p>\"Tracking charms.\" Severus disabled the charms as Harry summoned three small cauldrons. Severus put a howler into each cauldron. \"Three of them, they must have each made their own.\" </p>\n<p>\"I think one of each of us.\" Petunia stated. \"I know Lily has been trying to call the house. My cell phone, when I leave here, informs me of the calls we missed and we have missed the hourly calls from them.\"</p>\n<p>\"Dudley, you have the potions?\" Vernon asked. You could see how eager Vernon was to prank the Potters and Dumbledore. Most of his fellow workers would tell them when strangers were watching Grunnings. Their neighbors had taken to turning on the hoses on the Order members, having their dogs chase them, and if it was late at night calling in stalker reports.</p>\n<p>\"Yes, I do. This one will dye them Slytherin Green.\" He handed the potion to Severus who poured it over Howlers. They watched as Severus worked on getting the potion into the Howlers. \"This one will make it so they can't cancel or hide the dye for at least a month.\" </p>\n<p>\"Oh, I wanted to see how well that one worked. Is there a way we can monitor them?\" Harry asked.</p>\n<p>\"I can see if Draco can send us memories. I will write to him and let him know what we are doing. We can make sure they receive their howlers back at dinner tonight.\" Severus grinned. He loved being able to get even with James Potter. He wished he knew where Black and Lupin were. They hadn't made an appearance yet, except to watch places. </p>\n<p>\"Here this one will make them bald.\" Dudley gave Severus the last potion.</p>\n<p>\"Nice choice.\" Harry stated. \"Can we add one that will make talk nonsense?\" </p>\n<p>\"We can, do you know the spell?\" Severus asked. They were watching the howlers absorb all the potions. They needed to wait thirty minutes for them to dry.</p>\n<p>\"Yes, when can I cast it?\" Harry asked. </p>\n<p>\"Now.\" </p>\n<p>____________________________________________________________________________________</p>\n<p>The group exited the floo in the Leaky Cauldron and as they were entering Diagon Alley, Severus stopped them from moving forward. He guided them back through the wall and they were by the backroom. \"Order members are blocking our way.\" </p>\n<p>\"You think they will try and kidnap Harry?\" Petunia wasn't sure how they would do it in broad daylight but if anyone would be able to do it, Dumbledore would. His reputation was too shiny to allow anyone to believe he wasn't the greatest thing since sliced bread.</p>\n<p>\"Yes.\" Severus answered.</p>\n<p>\"Which is why we are here to help.\" Draco and a group of students from all the different houses except Gryffindor stepped out of the back room of the Leaky Cauldron.</p>\n<p>\"Draco.\" Severus greet him. Severus introduced everyone. He was impressed by the number of students who were there.</p>\n<p>\"We are going to be taking the exams too.\" Blaise stated. </p>\n<p>\"Yes, and we have a way to get all of you to Gringotts with us.\" Pansy held up five poly-juice potion bottles. \"Our parents donated hair. We have Lord and Lady Malfoy, Lord Parkinson, Lord Greengrass, and Lady Zambini.\" She handed out the potion bottles. \"Sorry, you are going to have to take your chances.\"</p>\n<p>\"We also brought you the memories of them being pranked.\" Theo added. \"The return howlers have scared a lot of parents from sending them.\"</p>\n<p>\"We have also packed our trunks and don't plan on returning to Hogwarts.\" Luna Lovegood stepped forward. \"Neville wanted to come but the great blob stopped him from leaving. He will need our help to get away.\"</p>\n<p>\"We will find a way to help him. Your plan?\" Severus asked.</p>\n<p>\"Simple, our parents are escorting us to Gringotts for our Inheritance Tests.\" Draco grinned. \"We already submitted the requests to the Board. The Board might not have submitted the approval to the Headmaster until after he left to come to Diagon Alley.\"</p>\n<p>\"Shame, how the owls are slacking off.\" Harry commented. </p>\n<p>\"Yes, they are getting old.\" Draco returned. </p>\n<p>Harry became Lord Greengrass, Severus became Lord Malfoy, Petunia became Lady Malfoy, Vernon became Lady Zambini, and Dudley became Lord Parkinson. They all exchanged a grin and headed toward Gringotts. Severus putting on his best impersonation of Lucius as escorted Petunia.</p>\n<p>The Order members were confused seeing about fifty of Hogwarts' seventh and sixth-year students walking toward Gringotts with the five adults. Dumbledore exchanged a quick look with Mad-Eye and James Potter as he stepped forward. The Order members moved into defensive positions around Dumbledore. \"Lord Malfoy, I was unaware you would be escorting students to Gringotts.\"</p>\n<p>\"The request was submitted to the Board. I and my fellow Board members decided to escort them. After all, it's such dangerous times that we had to make sure they arrived safely.\" Severus used part of Dumbledore's speech from the last Welcoming Feast. He was going to have to send Lucius a very good bottle of elven wine for this. </p>\n<p>\"I see. It was for today?\" Dumbledore asked.</p>\n<p>\"Yes, many of our future Lords and Ladies need to be able to spend their summer learning the rules and customs that go with attending Wizenagamot and they can't enter without verification of their inheritance. Hogwarts' year is almost over and we really didn't want to delay them being there for the first summer session. If you will excuse us, we have appointments and we don't want to be late. Have a pleasant day.\" They moved forward and when they were in Gringotts, Severus leaned close to Harry. \"What prank?\"</p>\n<p>\"Delay color scheme. They seemed to like green so tonight when they have their tea they will be back to being green again.\" Harry answered. </p>\n<p>Everyone close to them smirked and pass it on to those near them. </p>\n<p>_____________________________________________________________________________________</p>\n<p>Several hours later all the student emerged from the testing area. They all took their NEWTs and moved to their Inheritance Tests to make sure Dumbledore didn't try to deny them their entrance into the Wizengamot. Thankfully, all the testing was done away from the main teller area and they didn't have to keep taking the poly-juice. </p>\n<p>\"Does everyone have a way home?\" Vernon asked after they all gathered again. The students were exhausted and the adults were tired of worrying and watching to make sure Dumbledore didn't try anything. </p>\n<p>\"Yes, my father provided us with a portkey to the Manor and everyone can floo home from there.\" Draco answered. \"You are welcome to join us. He requested that my father included you when my father made it.\" </p>\n<p>Harry exchanged a look with Severus. \"We wanted to speak to him anyway. He knows where we stand. How do you feel about it?\"</p>\n<p>\"I believe a visit would be a great idea.\" Severus grinned.</p>\n<p>_______________________________________________________________________________</p>\n<p>After dinner with almost everyone invited and now most of having departed Harry with Severus joined Lucius and the Dark Lord in the study. Narcissa was entertaining Petunia and Vernon while Dudley went off with Draco and his friends who remained behind.</p>\n<p>The Dark Lord took his seat behind his desk. \"Severus, is he why you haven't been attending the meetings?\" Lucius looked worried for a brief second but his mask was back in place.</p>\n<p>\"Yes, my Lord. We were doing intense reviews and I also felt it would be better to keep Harry and his family safe.\" Severus answered. \"It also allowed me to arrange for the students to be tested early.\"</p>\n<p>\"I am aware of the current difficulties the Potters and Dumbledore are currently having. I am just a bit worried about a Potter becoming one of my followers.\"</p>\n<p>\"I won't be one of your followers. I am also not a Potter.\" Harry kept his emotions buried behind his mask. He knew the Potters were mentioned for a reason. \"My full name is Harrison James Slytherin Gryffindor Peverell Black Hamilton Evans.\"</p>\n<p>Lucius inhaled. He knew what would mean for their side. \"Yes, that was a very interesting plan you fulfilled. I was impressed. Especially since you had just recently been released from Azkaban. I was surprised at how fast you recovered.\" The Dark Lord wondered how the boy looked so good after four years in Azkaban. He had seen so many that looked like death just after two weeks in Azkaban.</p>\n<p>\"So were they.\" Harry grinned. \"I am your co-heir, together we can claim the Lordship. I already have claimed my part of it. If we want to use the seat that is.\" He handed him in Inheritance Test. </p>\n<p>The Dark Lord looked at the parchment that Harry laid down on his desk. He read it and passed it to Lucius. \"What makes you think you can offer me anything that would change your status from follower to ally or something else?\"</p>\n<p>\"There are a few things besides that. I am not going to expect you to name me your heir or whatever.\" Harry tilted his head, looked at the Dark Lord closely. \"You see, I am unaware if you know this or not, but Berry, oops I mean Barry, isn't the one who sent you packing all those years ago. You also left behind a present when you did.\" Harry really needed to stop thinking of his brother as some sort of berry.</p>\n<p>The Dark Lord leaned back in his chair, reviewing his own memories. \"How do I know you are telling the truth? You were twins. It was dark and Lily Potter was in the way. I wanted both of you dead.\" </p>\n<p>Harry lifted his hair off of his forehead. \"I know. Just like I know you know the full prophecy. I have the scar, however, to prove I am. Barry received his scar on his cheek when your magical backlash caused the ceiling to come down. He just happened to be closest to Lily. She opened her eyes and declared Barry did it. No one tested us. Do your scan. You will find a present you left behind.\"</p>\n<p>The Dark Lord was confused by that wording but pulled out his wand and cast the spell. His eyes widened as he read the results. \"Who else knows?\" How could he have missed that? A human Horcrux.</p>\n<p>\"Us three, unless you included Lord Malfoy. I haven't told him. I am not going to guarantee that Dumbledore doesn't but I believe the honestly thinks my brother is the one. I am cannon fodder. They decided that since I was a parseltongue I was evil and that is why they left me in Azkaban until I was needed.\"</p>\n<p>\"My Lord, they informed Harry he was only released because of Dumbledore. They didn't tell him the truth. They have tried to get everyone to believe it was an accident and as soon as Dumbledore knew the truth, he worked hard to get Harry released. Dumbledore and the Potters were the ones who wanted Harry in Azkaban from the beginning. They are also unaware of the years I have been instructing him. They planned on teaching him his place this summer.\"</p>\n<p>\"His place?\" The Dark Lord didn't like the sound of it. Lucius looked at Harry. </p>\n<p>\"Yes, Lord Potter and my former brother were planning on beating me into submission and using the family magic to control me. They were going to disinherit me but not remove me from the family. I just beat them to it.\" Harry grinned. </p>\n<p>\"That sounds like a normal Dumbledore plan. He allows students and children to be abused.\" The Dark Lord stated. \"Severus, Lucius, I need to speak to Harry for a few minutes alone.\"</p>\n<p>Severus looked conflicted but at Harry's nod, he left the office. Lucius was waiting by the door for Severus. \"Come, let's have some tea.\" </p>\n<p>\"He listens to you.\" The Dark Lord was a bit surprised. </p>\n<p>\"He has for the last few weeks. I don't want to fight you, I won't join Dumbledore but I do want to destroy him.\"</p>\n<p>\"I am conflicted about you now. You see, you know what you are.\"</p>\n<p>\"I do. The only living Horcrux which proves I am the Boy-Who-Lived. Honestly, who thinks up these names?\" Harry muttered the last bit causing the Dark Lord to grin. \"If it gets out, it proves they were wrong while it would also endanger me and your other Horcruxes as it's considered the darkest of magic. Dumbledore might find a way to justify ordering my death.\"</p>\n<p>\"Yes, it would. However, I do have a way of getting it out without endangering that. You see, despite Dumbledore's yearly ramblings and events, I haven't faced your brother once since I have returned. He has kept your brother well protected.\"</p>\n<p>Harry grinned. \"How would you like an intro?\" </p>\n<p>\"It can be arranged. We will keep you being a Horcrux a secret. You will move in here where I can protect you.\" The Dark Lord began to make plans on how to protect Harry.</p>\n<p>\"No. I am staying with Severus. I am fine there and if you try to confine me, let's just say, Dumbledore got a nasty headache when I brought down Hogwarts wards to leave. I won't ever be confined again. Consider that a deal-breaker.\" </p>\n<p>The Dark Lord glared. He wasn't going to allow his Horcrux to be in any type of danger or out of his sight. \"You must be protected.\"</p>\n<p>\"I am protected. I am aware of what I am. I am, however, also me. I have been confined for too long and I won't allow it to happen again. I am willing to be your ally or even an unmarked supporter, I refuse to be marked, confined, or even limited in what I can and can't do. I will get even with the Potters and Dumbledore. I will make the Order members who knew pay for what they have done but no one and I mean it, no one will confine me.\" Harry wasn't going to change his mind. </p>\n<p>The Dark Lord smirked. \"You think I can't do it?\"</p>\n<p>\"Try it and learn you can't.\" </p>\n<p>The Dark Lord pulled out his wand and Harry could feel the wards close down. He could feel the Dark Lord weaving a spell over him. He grinned and when the Dark Lord was done, Harry shook his head. \"Mistake.\" He warned and brought all the wards down, the Dark Lord screamed as the backlash hit him. </p>\n<p>Severus, Lucius, and Narcissa rushing in. Harry didn't bring the Manor wards down, just the wards the Dark Lord had installed in the office. \"What happened?\" Everyone else slowly arrived.</p>\n<p>\"He tried to keep me here. I taught him the error of his ways.\" Harry answered as he sat down. \"He should be thankful I didn't remove all the wards.\"</p>\n<p>The Dark Lord was helped up and over to the couch where he was laid down. Severus and Narcissa began to scan him. \"He is fine. He just needs a headache potion and a pain potion for later.\" Narcissa commented.</p>\n<p>No one spoke as the Dark Lord sat up and took the potion. He brushed off Narcissa's concern. \"I believe we will continue our conversation. Lucius, Severus please stay.\"</p>\n<p>As soon as everyone left, the Dark Lord inhaled. \"I did warn you.\" Harry told them.</p>\n<p>\"You did. I feel better about you being not being under my immediate protection.\" The Dark Lord stated. \"Shall we work out a deal?\"</p>\n<p>\"I have a simple one in mind. We can go from there.\" Harry stated.</p>\n<p>\"Let's begin.\"</p>\n<p>Severus entered his living room. He was furious. He glanced at Harry and the others. \"Dumbledore?\" Petunia asked.</p>\n<p>Severus growled. \"Yes, I would say that means yes.\" Dudley just finished taking his final exams. </p>\n<p>\"What did he do?\" Draco had been spending the day with Harry and Dudley working on different potions. Draco had been instructing Harry on some of the potions he couldn't make while he was in Azkaban and was forbidden from created in Hogwarts. Draco was also going to work on a Potion Apprenticeship.</p>\n<p>\"He actually is expecting me to find you and bring you back. He had the nerve to tell me how much you needed your family. How it was a slight misunderstanding. I was fine until the Potters arrived. Potter Senior and Junior informed Dumbledore how they haven't heard anything from you but when they did, you wouldn't be able to leave Potter Manor. They set up new wards that would limit Harry's magic. Dumbledore wants me to brew a blood adoption potion for them to use on Harry. They are going to force it into Harry.\" Severus wanted to kill them.</p>\n<p>\"Can they do that?\" Harry, Petunia, and Vernon asked as Draco and Dudley looked shocked.</p>\n<p>\"If they get their hands on you, I wouldn't put it past them to first give you a loyalty potion and then do the blood adoption.\" Severus stated. \"You can't be seen alone. Actually, you shouldn't be seen at all. They have Order members looking for you. James and Lily turned in a masterful performance about how much they love you and how they need to get you back into their family, to show you how much they do love you. Lily even shed a few tears. Dumbledore explained how it is all a slight misunderstanding. What they didn't tell anyone was how they tried to keep you at Hogwarts and their plans for you. Also, they are going to try some tracking charms and spells.\" </p>\n<p>\"Can the Dark Lord help?\" Draco asked. </p>\n<p>\"I am going to speak to him. He might insist that Harry move into Slytherin Castle but I am afraid that Dumbledore might think he is there. He is afraid that Harry will turn to the Dark Lord because of Azkaban. He is going to try to get the Wizenagamot to pass a new law requiring all newly released wizards and witches to have a guardian until they can show they are stable enough to be on their own.\" Severus sank down into a chair. \"I am sure Lucius can prevent it. The Dark Lord has already arranged for your seats and his to be assigned right before the first session.\" </p>\n<p>\"We should be ready for more Howlers?\" Dudley asked.</p>\n<p>\"I believe so. They are counting on forcing Harry into a meeting and having the Order there to secure him.\" Severus replied. \"I have him convinced that I have no idea where you are. He has shown up Spinner's End a few different times. I know he has cast some tracers there but since Harry has never been there he found nothing.\"</p>\n<p>\"He hasn't figured out that you are here at Prince Manor.\" Petunia asked.</p>\n<p>\"No, he believes a cousin inherited the title. My mother married a muggle and my grandparents distanced themselves from my father. They didn't get along.\" He wasn't going to mention his abusive, alcoholic father.</p>\n<p>Harry and the rest of them read between the lines and knew that Severus' grandparents hated Severus' father. Severus' father wasn't a nice man and they all knew that. \"Any idea where they think Harry might be?\" Vernon asked.</p>\n<p>\"A few different ones.\" Severus had gained control of his emotions. \"Lily and James are putting the idea that the Dursley family has kidnapped Harry and smuggled him out of the country. They informed the Order members how you are trying to corrupt their son and make him into a muggle. He has some of the Order still watching your house and job. He failed to mention having to bail Lupin and Black out of jail for trespassing, loitering, and stalking. Dumbledore with the Potters went to Amelia about how Vernon hates wizards and had to have kidnapped Harry. Petunia is under your influence and blindly follows you. Amelia dismissed them since Harry has his NEWTs. Amelia stated there was nothing she could do unless Harry came forward and pressed charges. Dumbledore and the Weasley family are backing that you are hiding in one of the properties you inherited and have been sending the Potters, Lupin, and Black around to the ones that they think Harry might be at. Most of the Order is now on watch in Diagon Alley. They drew up a schedule.\"</p>\n<p>\"Aurors?\" Draco asked.</p>\n<p>\"Officially, nothing they can do. Unofficially the ones with the Order are working on any form of muggle transportation, port-keys, and even foreign apparition to find if Harry is across the pond.\" Severus answered. </p>\n<p>\"Interesting.\" Harry answered. \"What do you think the Dark Lord will do?\"</p>\n<p>\"Hard to say. He might feel he has to move you into his Castle but I think mentioning Dumbledore and seeking out his residences will handle that. He knows that Dumbledore knows the locations of his Castle unless he puts it under a Fidelius.\"</p>\n<p>\"Malfoy Manor has been placed under a Fidelius.\" Draco added. \"I wouldn't put it past the Order or Dumbledore to arrange a raid.\"</p>\n<p>\"True.\" Severus agreed. \"The Dark Lord might want to provide you with an emergency port-key, I have one I can give you but his will be able to get you through wards as it will be in parsel. I don't know if the spell is the same in parsel or not, otherwise, I would say try it.\"</p>\n<p>\"I won't try it unless we know that it will work. I don't want to find out afterward we created a bomb.\" Harry grinned and it brought a smile to everyone's faces. </p>\n<p>\"I was thinking since most of the sixth years won't be returning and starting in Wizengamot, we might be able to keep a closer eye on what he is planning, at least, legally.\" Severus answered. \"Most of them won't be able to take their seats but they will be able to observe. The light won't have anyone there so it will give us more people later.\"</p>\n<p>\"We need to get Longbottom out too.\" Draco had enjoyed the time he spent with Longbottom outside of Hogwarts and the rest of their friends were able to help get him up to his NEWT levels in DADA, Charms, and Transfiguration. Longbottom admitted he would never be able to do potions and Severus agreed. Severus was able to get Longbottom caught up and taught Longbottom some tricks of the trade to assist him when he took his NEWT in potions. </p>\n<p>\"Actually, Luna and Pansy spoke to him, he wants to return to Hogwarts and keep an eye out for the trio for us. He knows they can't keep their mouths shut. Especially Weasley and Berry. His Grandmother has been very impressed with how improved he has become.\" Harry stated.</p>\n<p>\"We need to dye Berry blue.\" Dudley remarked. Barry was little exactly like a round berry or beachball.</p>\n<p>\"We should give Neville an emergency port-key too. I don't trust those three to not give him problems.\" Severus made a mental note. \"I need to go and speak to the Dark Lord.\"</p>\n<p>\"Do you want me to come with you?\" Harry asked. </p>\n<p>\"I am not sure that is a good idea, he might react first and you will give him another headache in response.\" Severus stated. While the Dark Lord wasn't totally insane, killing muggles and wizards, he still wasn't fully sane. The Dark Lord and Harry worked out a deal where Harry was going to take a slightly passive role in the leadership of the Death Eaters. Harry was going to be in charge of all the younger ones and assist the Dark Lord with plans. The Dark Lord was able to convince Harry that going on raids would be a bad idea. Severus and Lucius agreed with that. They didn't want to take a chance that someone would throw a port-key at Harry, or have him get hit by a stray curse. </p>\n<p>\"True. I also am wondering if they will be checking the floo network. Can they see who travels?\"</p>\n<p>\"In a way, they can look to see that there was travel between two floos but they can't determine who. If they see too much floo travel from here, they might put up monitors which will let them know when the traveling is occurring and they could interrupt the travel.\" Severus explained. </p>\n<p>\"Is that how Umbridge did it?\" Draco asked.</p>\n<p>\"Yes.\" Severus had already explained what had happened each year since Harry had been in Azkaban and there really wasn't anything amazing until the Dark Lord returned. Dumbledore wasn't subtle about the Dark Lord's return and earned the Ministry's interference with Hogwarts.</p>\n<p>Umbridge didn't last very long as she was caught with a blood quill and interfering with floo travel when she thought it was Barry using the floo. She stopped Lord Wickersham's son from returning home. Umbridge put a tracer on the floo network in Hogwarts and when Decker Wickersham used the floo to go home due to needing some medical attention from a potion accident, the boy landed in a Ministry holding cell and came close to dying. The only reason he didn't die was that Lord Wickersham contacted Poppy wanting to know why his son hadn't arrived. Umbridge ended up being fired from the Ministry and put in Azkaban. </p>\n<p>\"Does he have any plans for the Dark Lord?\" Petunia asked.</p>\n<p>\"No, everything has been placed on hold until they find Harry. Since the Dark Lord hasn't been active, he has been having a hard time convincing people that he has returned. He is working on the political front and trying to get more laws passed but Lucius has been able to stop a lot of them. He wants to push that werewolf restriction law again.\"</p>\n<p>\"Even though he has a pet werewolf?\" Draco asked. </p>\n<p>\"Yes.\" Severus looked up as Harry handed him a glass with two fingers of scotch in it. He took the glass and took a sip.</p>\n<p>\"Why not let that out?\" Vernon asked.</p>\n<p>\"It will be released a week before the vote. Lucius has already arranged it. He also pulled Lupin's medical records and Hogwarts transcript to back up that werewolves can function in polite society and they aren't a danger. Fenrir is getting records from the countries that allow the werewolves to attend school.\" Severus answered. They all knew the story of Lupin and the prank that Black had played on Severus.</p>\n<p>\"If the bill gets denied again, he will have to do a complete revamp on it, and won't be able to present it for another two years.\" Draco grinned. </p>\n<p>\"Yes. They were also complaining about the new classes for next year. I think I am going to have to listen to them whine until next year when Dumbledore will act like they were his idea.\" Severus finished his scotch. \"I better get going. Harry, remain here. Vernon, Petunia, please remain here. I am sure they would love to grab you and hold you until they can convince Harry to return.\"</p>\n<p>\"I already arranged to be on holiday for the next month.\" Vernon answered. \"My boss is aware of the situation and informed the security guards about strangers lurking around the factory.\"</p>\n<p>\"I spoke to Narcissa and Lucius, they are going to get us an international port-key for us to spend the time in Greece. We are going to be classified as a family since Harry and Narcissa have Black blood, we are going to use that link.\" Petunia added.</p>\n<p>\"I will inform the Dark Lord. I am sure he will have ideas also.\"</p>\n<p>Harry stood between Lucius and the Dark Lord. Today, everyone who was in the dark faction and passed their NEWTs were going to take their seats, changing the Wizengamot. The Dark Lord looked like a slightly older version of Harry. Severus had created a potion to alter the man's looks tying it to a ring the Dark Lord wore woven in with parsel magic. They knew Dumbledore wouldn't be able to see through the glamour as they tested it with Mad-Eye during a short shopping trip in Diagon Alley.</p>\n<p>\"You will be fine.\" Draco quietly told Harry.</p>\n<p>Harry sent him a small smile as each of the Slytherins gathered closer. \"We better get in there and take our seats. I don't want Dumbledore to try and corner me before we get there.\"</p>\n<p>The fairly large group of former students followed Lucius and the Dark Lord into the Wizengamot. Some took their places among the Lords and Ladies while others headed to the heir section. Harry and the Dark Lord sat in the founders' chairs. Lucius was sitting in the Minority leaders chair but didn't bother to remove anything from his robes as he wouldn't be sitting there for long.</p>\n<p>\"Marvolo, the seats.\" </p>\n<p>The Dark Lord glanced over his shoulders at the board. Three of the founders' seats were shining on the board. \"So it worked.\"</p>\n<p>\"He is going to hatch the biggest bird in he ever laid.\" Harry smirked.</p>\n<p>The Dark Lord leisurely rose and made his way to Lucius. No one was paying attention, most were gossiping about the latest Potter Paroxysm. Berry, oops, Barry Potter had a fit in Diagon Alley when he was denied the latest in brooms. Rita had covered the story including pictures. </p>\n<p>Dumbledore arrived with James Potter and Sirius Black. Black was wearing a Wizengamot robe. Harry refined from laughing as the Dark Lord took his place next to him. \"He is going to try it.\"</p>\n<p>\"Yes.\" The Dark Lord wasn't exactly sure what Dumbledore was hoping to achieve by whatever he had planned but it was going to backfire. </p>\n<p>\"I'm glad I followed your advice and bought a copy of the new Inheritance Test with me.\" </p>\n<p>The Dark Lord was looking forward to seeing Dumbledore reaction along with Potter and Black's. The three of them had been a thorn in his side long enough. If he had known that they had the wrong child he would have approached Harry during his first year. He would need to reward Severus for his protection of his co-Lord. </p>\n<p>Harry refused to let Dumbledore know that his staring at him was unsettling. Harry had been watching the man out of the corner of his eyes and saw instantly when the man realized he was in attendance. Dumbledore spoke to Potter and Black who were glaring at him. Dumbledore had two Aurors escort Potter and Black to their seats and restrain them from going after Harry. \"Give him permission to get some Basilisk ingredients.\"</p>\n<p>The Dark Lord looked at Harry. \"Once we take Hogwarts, however, he deserves something extra special.\"</p>\n<p>Harry gave the man a smirk at the Dark Lord's questioning look. \"I will explain later.\"</p>\n<p>Fudge arrived with his toadie, Percy Weasley. Once everyone was settled, Dumbledore called the Wizengamot session to order. \"I see many new faces in our first session, I believe it's time for introductions. However, before we do, we need to have Mr. Harry Potter escorted out of the session as he is unable to take his seats.\"</p>\n<p>Lucius rose. \"As the leader of the Whigs, I am wondering why you are trying to escort Lord Harrison James Slytherin Gryffindor Ravenclaw Peverell Black Hamilton Evans out of his first session?\"</p>\n<p>Dumbledore gave him a slight smile, his eyes twinkling. \"According to our laws, he is unable to take his seats until he has finished his NEWTs. The boy hasn't even taken his OWLs.\"</p>\n<p>Harry stood up, pulled out his results. He leaned over the railing, waving them in front of Percy's face. \"Read them.\"</p>\n<p>Percy took the three pieces of parchment. He read through them and then announced:</p>\n<p>The test results of Harrison James Slytherin Gryffindor Ravenclaw Peverell Black Hamilton Evans</p>\n<p>Tested at Gringotts, independent assessment by Goblin Rock, Goblin Maqi, Goblin Gole, Goblin Weka </p>\n<p>OWLs </p>\n<p>Charms E<br>\nHerbology E<br>\nDefense Against the Dark Arts O++ Highest tested<br>\nTransfiguration O<br>\nPotions O<br>\nHistory of Magic E<br>\nAncient Runes E<br>\nMuggle Studies O<br>\nCare of Magical Creatures O+<br>\nAstronomy E<br>\nArithmancy E</p>\n<p>Percy handed the parchment to Madam Bones as he read the next one:</p>\n<p>Tested at Gringotts, independent assessment by Goblin Rock, Goblin Maqi, Goblin Gole, Goblin Weka, Goblin Rix, and Head Account Manager Ironclaw</p>\n<p>NEWTs </p>\n<p>Charms O<br>\nHerbology O<br>\nDefense Against the Dark Arts O++ Highest tested<br>\nTransfiguration O<br>\nPotions O<br>\nHistory of Magic E<br>\nAncient Runes E<br>\nMuggle Studies O<br>\nCare of Magical Creatures E<br>\nAstronomy E<br>\nArithmancy O</p>\n<p>Percy handed the parchment to Madam Bones. </p>\n<p>International Council of Wizards Testing on 18 August 1997. Present ICW Headmaster Gilbertson, ICW Headmaster Le, ICW Headmaster Kumar, ICW Headmaster Arun</p>\n<p>WOMBAT (The Wizards' Ordinary Magic and Basic Aptitude Test)</p>\n<p>Magical Law O<br>\nMagical Transport O<br>\nEveryday Magic O<br>\nNatural World O<br>\nMagical Beings E<br>\nWizarding Current Affairs O<br>\nMagical Objects E<br>\nMuggle Studies O<br>\nMagical History O<br>\nInternational Wizardry E<br>\nMagical Theory O<br>\nDark Magic (Theory) O</p>\n<p>Percy handed the last piece of parchment to Madam Bones. Harry said, \"the results are on file. You can keep those copies.\"</p>\n<p>Lucius and the Dark Lord were watching Dumbledore, the man was allowing his shock to appear on his face. \"I believe that settles the issue of Lord Harrison James Slytherin Gryffindor Ravenclaw Peverell Black Hamilton Evans.\" Lucius paused \"I would also like to introduce Marvolo Gaunt Slytherin. The requirement of having three founders seat has been fulfilled, their seats are aligned with the Whig party, removing Headmaster Dumbledore from the position of Chief Warlock. We do require the removal of Sirius Noname from the Black seats as he isn't Lord Black, heir Black, nor a Black.\" </p>\n<p>\"What in Merlin's name did you do, you freak?\" Potter jumped up, screaming. </p>\n<p>\"How dare you? I am Lord Black.\" Black was being held back by two Aurors while Potter was trying to get around them. More Aurors arrived and stunned both men who crashed to the floor. </p>\n<p>Harry reached into his robe pocket and produced the advanced Inheritance test he had taken after Severus assigned him the proxy seats of Ravenclaw. He handed it to Percy, who read through it, paled, and handed it to Madam Bones. She handed it back to Percy. He read it out loud.</p>\n<p>Harrison James Slytherin Gryffindor Ravenclaw Peverell Black Hamilton Evans</p>\n<p>Birth: 31 July 1980</p>\n<p>Removal from Potter heirdom: James Charles Potter 27 November 1992<br>\nRemoval from Potter family: Harrison James (formerly Potter) Slytherin Gryffindor Ravenclaw Peverell Black Hamilton Evans 15 May 1997<br>\nLordship confirmation 15 May 1997, Illegal imprisonment of minor, non-release of an innocent minor. Laws of Legal Claimant, section 64, subsection 23, paragraph 5-Anyone minor (under the legal age at the time) subject to any incarnation declared an adult if sentenced for more than three months.</p>\n<p>Title:<br>\nSlytherin (co-Lord)<br>\nGryffindor<br>\nRavenclaw<br>\nPeverell<br>\nBlack<br>\nHamilton<br>\nEvans </p>\n<p>The Wizengamot erupted. The articles were true. They were demanding answers from Dumbledore. Fudge pounded his gavel, regaining control. \"Escort the former Mr. Black and Lord Potter out. Auror Dawlish, do not revive them until they are in a secure area.\"</p>\n<p>\"I must object to the treatment of Lord Potter and Lord B-\" Dumbledore stopped at a cough from his right. \"Sirius. They are upstanding members of our society.\"</p>\n<p>\"Yes, the same upstanding members who allowed me to remain in Azkaban knowing I was innocent. Just like you, Headmaster.\"</p>\n<p>Disorder reigned for several more minutes as Aurors and Fudge tried to get everyone to calm down. Lucius rose. \"If I may finish the introductions and take the mantle of Chief Warlock I believe we can get through this today.\"</p>\n<p>\"I must object to Lord Marvolo Gaunt Slytherin. He is Lord Voldemort.\" Dumbledore was appearing to be desperate but he couldn't lose his position. He needed to be in charge. They had a war coming. The Dark Lord couldn't be allowed to remain seated in Wizengamot. He couldn't allow the dark faction to gain control over the Wizengamot. He glanced at Harry Potter, how did one boy make sure a mess out of his plans?</p>\n<p>Harry rose from his seat. \"Are you going to toss him into Azkaban because he doesn't want to follow you? After all, you sent me to Azkaban for merely opening something I didn't even do. I can't image what you would do to someone who you believe is Lord Voldemort. Give him the Kiss?\"</p>\n<p>Chaos reigned again as Harry took his seat. \"You know, if you keep this up, Dumbledore is going to have a heart attack.\"</p>\n<p>\"And?\"</p>\n<p>\"Nothing but it would be funnier if I got to play too.\" The Dark Lord smirked.</p>\n<p>\"Have at it.\" Harry returned the smirk. </p>\n<p>The Dark Lord rose. Everyone quieted. They wanted to hear what was going to happen next. \"I do thank you, my co-Lord Slytherin for that excellent defense against my name. Headmaster Dumbledore, I am wondering how you can claim a dead man is me? I have been accepted by Lady Magic, herself.\" Everyone looked at the magical board, seeing the three founders' seats were lit. </p>\n<p>Dumbledore wasn't sure how to respond since no one believed him except those in his Order that the Dark Lord was back and the way it was going in this session he didn't want to sound crazier. He had just lost the position of Chief Warlock. Two of his favorite pawns were in ruin. Sirius was useless to him. Potter was good in name only. \"Tom Marvolo Riddle, Lord Voldemort, is heir Slytherin.\"</p>\n<p>\"Ah, I am now my former heir who has been deceased for over 10 years?\" The Dark Lord was watching everyone. They were gaining more support. \"I believe he was declared deceased on the 31st of October 1981 by you. Didn't you declare Berry Potter as the Boy-Who-Lived?\"</p>\n<p>Harry let out a snort as the Dark Lord said, Berry. \"Barry Potter did indeed defeat Lord Voldemort, however, the man isn't dead.\"</p>\n<p>\"Despite your wording? I believe we can pull the official file where you declare him deceased and the new heir Potter the winner.\"</p>\n<p>Lucius handed a piece of parchment to Madam Bones. Madam Bones summoned an Unspeakable. \"We can have the file here in a few minutes.\" The Unspeakable announced.</p>\n<p>\"That won't be necessary. I did declare the man defeated but he has since returned.\" Dumbledore's eyes started twinkling. \"After all, a simple Inheritance Test will resolve your claim.\"</p>\n<p>The Dark Lord reached into his robes. \"I agree.\" He pulled out some parchment. He handed it to Percy, who had moved to stand in front of him. \"Mr. Weasley, if you would read the results please.\"</p>\n<p>Percy opened the parchment. </p>\n<p>Marvolo Romus Gaunt Slytherin</p>\n<p>Birth: 31 July 1972</p>\n<p>Father: Morfin Marvolo Gaunt (Deceased 7 January 1976)<br>\nMother: Thana Haspidia Gaunt nee Malfoy (Deceased 7 January 1976)</p>\n<p>Titles:</p>\n<p>Slytherin<br>\nPeverell (heir)<br>\nGaunt<br>\nMalfoy (3rd in line for Lord)</p>\n<p>Percy handed the parchment to Madam Bones. \"The results are on file.\" The Dark Lord smirked at Dumbledore. </p>\n<p>Lucius moved to the Chief Warlock position and finished the formal introductions. Dumbledore was furious. He had tried to get every one removed but after five people had shown their NEWT results the rest of the Wizengamot demanded that he remain quiet as they wanted to return home sometime that day. As the session was closing, Harry remained next to the Dark Lord and Lucius with the former students clearing the way for them. They didn't want Dumbledore or his cronies to get close to Harry. </p>\n<p>\"Mr. Potter.\" Dumbledore's voice carried over the din of the crowds. </p>\n<p>Harry ignored the man. He wasn't a Potter. \"Lord Slytherin.\" Dumbledore tried again. </p>\n<p>The Dark Lord and Harry stopped. They turned and saw Dumbledore coming toward them. \"This is going to be interesting.\" Harry muttered. They knew what the man was going to say and do.</p>\n<p>\"Harry, my boy, we must speak.\" Dumbledore with Moody and Tonks behind him was in the middle of the Ministry.</p>\n<p>\"I am not your boy. There is also nothing to speak about.\"</p>\n<p>\"We must clear up this matter with your family. You need to get back into their protection. You are aware of what is required of you.\" Dumbledore stated.</p>\n<p>Moody growled. \"Listen, boy, what you did to your family is shameful. You should be thankful they're even taking you in. A snake-like you should be happy they are even allowing you into their home.\"</p>\n<p>\"Oh, yeah, there is a ringing endorsement for returning to the Potter family. In case you missed it, Auror Moody, I am not a Potter. I am also a Lord. I am not subject to anything the Potters or Headmaster Dumbledore seems to believe I should be doing or grateful for the plan my former family has for me.\" Harry's voice rose a bit. \"Did you tell them what you planned? That you planned for me to be kept a hostage in the Potter family home to learn how to be obedient and submissive? To fight against some deceased man while you train Berry?\"</p>\n<p>\"My boy, it's-\"</p>\n<p>\"Yes, a slight misunderstanding. Like leaving me in Azkaban was, issuing false statements in my name to the press about how I was resort, how I loved my family, how much they loved me. You left me there to rot because I am a Parseltongue and in James Potter's words, \"no son of mine is a snake. He is no heir of mine. I only have one son.\" He spoke those words as I was being escorted out of Hogwarts and tossed into Azkaban. You remember as your words were \"there is nothing to worry about James, Azkaban will handle him. You can legally disown him now and make Barry your heir.\" Harry could see many people were listening. \"How about when I was finally released and you lied again. Claiming you got me released when it was Madam Bones. Madam Bones learned of what you did, she, instead of allowing me to remain in Azkaban, got me released. Amazing how we have a former Chief Warlock and Headmaster who is willing to break the laws for his needs, for his gains, and his convenience.\" </p>\n<p>\"My boy, it was done for the greater good.\"</p>\n<p>Shock went through the crowd. Harry glanced at Lucius, he realized that Dumbledore or one of his cronies had placed a silencing charm on them but either the Dark Lord or Lucius had adjusted it. The charm was there but in reverse. Dumbledore and his two cronies couldn't hear the crowds but the crowds could hear them. \"That is your defense for putting an innocent in Azkaban?\" The Dark Lord wasn't shocked. He knew the truth about the man. </p>\n<p>\"I believe it's time for us to leave.\" Lucius stated as he could see Potter and Sirius Black heading toward them. He knew if Potter started anything, Harry would finish it. The boy hated Potter.</p>\n<p>\"Yes, it is.\" The Dark Lord guided Harry and the former students away. Hearing the gossip already spreading.</p>\n<p>The paper was filled with everything. Rita had been running headlines all week. She printed everything with her twists to it all. She researched everything from the past about Dumbledore, the Potters, and even Barry, and his friends. Rita used a lot of facts that she backed up with statements. She rehashed what was done in the Ministry and the Wizengamot. The public was now strongly supporting Harry. They refused to believe the Dark Lord was back and were demanding the removal of Dumbledore from Hogwarts. Dudley finished reading the morning paper as his father joined him for breakfast. \"Rita's winding everyone up.\" </p>\n<p>Vernon saw the headlines and grinned. Petunia poured him a cup of coffee. \"Harry is making them pay.\"</p>\n<p>\"They deserve it.\" Petunia wasn't about to feel sorry for any of them. \"Berry is just as bad as his parents.\"</p>\n<p>Harry smirked. His brother was now being called The Berry-Who-Lived. Barry couldn't even go into Diagon Alley without someone pranking him blue, black, or red. Barry had been called Bluebarry, Strawbarry, and Blackbarry. \"The nicknames are funny. Did you see the new one for Black and my former father?\"</p>\n<p>\"They used my names.\" Severus had enjoyed reading about Sirius \"The Mutt\" Black and James \"Potty\" Potter's misfortunes. They had been officially fired from the Ministry with charges pending for their involvement in the imprisonment of Harry. </p>\n<p>\"You know the only one who has escaped any consequences has been my former mother.\" Harry knew the woman was just as guilty as the rest.</p>\n<p>\"She has been lying low but don't worry, she will be getting hers.\" Petunia took a sip of her coffee.</p>\n<p>\"What did you do, Pet?\" Vernon could see his wife had a plan.</p>\n<p>\"I am sure you are aware of how I kept her letters, her requests, even her suggestions. Let's just say, Rita found them interesting. I even let her listen to the voicemail on our cell phones and answering machines. Who knew my dear sweet sister could be so vulgar.\"</p>\n<p>Vernon looked a bit sheepish. \"Dad, what did you do?\" </p>\n<p>\"I submitted the accounting over the years, the lack of funds that the Potters are claiming they paid us for the care of Harry. I also included Dumbledore and Potter's letters. Along with the memories of their visits over the years to Madam Bones. She wants the rest of you to submit them too.\" </p>\n<p>Severus coughed. \"I already have and I included mine from Hogwarts.\"</p>\n<p>Harry started laughing. \"I think we can safely say Dumbledore is done for.\"</p>\n<p>___________________________________________________________________________</p>\n<p>Harry, with Lucius and the Dark Lord, was in the Ministry. They were meeting with Madam Bones before the next session of the Wizengamot. Dumbledore and Mad-Eye were watching them. They couldn't get close to Harry as Harry had filed a magical restraining order after Dumbledore and Mad-Eye had tried to kidnap him in Diagon Alley. Dumbledore, of course, played it off as a slight misunderstanding. \"Dumbledore is staring at us again.\" Harry couldn't wait for this day to be over with. If everything went correctly, the Order was going to be finished.</p>\n<p>\"He knows we are meeting with Madam Bones. He has tried to stop the meeting. He went to Madam Bones to get some of the evidence disregarded.\" Lucius had been called into the meeting as he was the barrister on record for Harry. \"Nothing was disregarded and because of his concerns Madam Bones submitted a few interesting requests to Gringotts after Dumbledore left her office.\"</p>\n<p>______________________________________________________________________________</p>\n<p>Harry was sitting in the Wizengamot. Dumbledore was off to the side, sitting in the chair only the Headmaster of Hogwarts could sit in. The man had lost his power. He could only vote if there was a tie. The session was surprisingly full. Madam Bones rose as the minutes and old news was finished. \"I am here to request the removal of Albus Dumbledore as Headmaster of Hogwarts.\" No one spoke against it. \"I have proof that he allowed an innocent student to be sent to Azkaban. I have proof that showed the boy's parents agreed with Albus Dumbledore. Just because the boy could speak to snakes. Now they want to say it was to protect the school because of the snake attacks. However, even after the attacks kept happening, even after knowing the boy was innocent they kept him imprisoned.\" </p>\n<p>Madam Bones handed a stack of parchments to Percy Weasley. \"The parchment you are receiving shows that Albus Dumbledore, James Potter, Lily Potter, Barry Potter, Sirius Black, Remus Lupin, and several others were aware of this situation. The Aurors listed on the parchment have been fined and fired. As you can see, they knew the boy was innocent but felt they couldn't do anything about it because Dumbledore, the Potters, and Black were the ones who allowed it to happen. They acknowledged it was a good excuse. It's time for the guilty parties to pay.\"</p>\n<p>\"Are there any other charges?\" Lord Nott hoped there would be.</p>\n<p>\"Yes, attempted kidnapping, child abuse, and neglect. Those charges include the students at Hogwarts. I will be providing proof of the yearly events we have heard happen at Hogwarts were allowed by Albus Dumbledore as a way to test Barry Potter. I believe James Potter stated it was for the greater good. They needed to make sure Barry could defeat a dead man.\"</p>\n<p>\"He isn't dead, he will return.\" Dumbledore stood tall. He needed them to believe that the Dark Lord would return. \"Barry is the only one who can defeat him. The prophecy must be fulfilled.\"</p>\n<p>Madam Bones and numerous others shook their heads. \"It's been fifteen years. How much longer are we going to allow Dumbledore to control us using fear of a dead man? How many times has he stated that and we caved because of it? He put an innocent boy in Azkaban. He has endangered our children. He has allowed our world to become so dependent on him that many fear what will happen if he isn't in charge. Why does he want to remain in charge? He claims he doesn't want any power yet look at what power he does have. He is the one who influenced you and our children. He is the one to whom everyone turns to. He is a desperate man grasping at straws to remain in control. If we allow him to keep pushing this fear of a dead man returning, we will allow him to escape punishment for crimes he has committed. If we allow this, what does that say about our society, I will tell you. It tells them the one with the most power can do what he wants and not be held accountable for his deeds.\" Lucius looked around the room. \"We have given him much power, do we keep giving him more?\"</p>\n<p>Harry listened to everyone debate about Dumbledore and his goals. He listened to Dumbledore's insistence that Barry must defeat the Dark Lord. They even had the prophecy played. \"See, it must be fulfilled.\"</p>\n<p>Harry rose from his seat as whispering started, agreeing that the prophecy must be fulfilled. \"Excuse me.\" Everyone turned and faced Harry. \"I am sure I have this wrong since I am not up to date on divination. I read that prophecies weren't meant to be understood until after they are filled. I am wondering how he arrived at Voldemort being the Dark Lord it mentions. I am also wondering how he arrived at the idea of it being my former brother.\" When someone went to speak, Harry held up his hand. \"Let me finish, I won't be long-winded.\" He got a few laughs. Using his magic he wrote the prophecy in black ink in the air. </p>\n<p>\"The one with the power to vanquish the Dark Lord approaches... born to those who have thrice defied him, born as the seventh month dies... and the Dark Lord will mark him as his equal but he will have power the Dark Lord knows not... and either must die at the hand of the other for neither can live while the other survives... the one with the power to vanquish the Dark Lord will be born as the seventh month dies.\" </p>\n<p>\"The one with the power. Interesting, but no clue as to who. Next born to those who have thrice defied him. Well, that is anyone who is an Auror, Ministry worker, or even in Dumbledore's Order, no help there. Seven month dies, now that is interesting. In a modern calendar, it would mean July. However, there are a variety of calendars. In the one we based our current one on, it could also mean September. Now we know Voldemort was around for over fifty years so that is a lot of people. Mark him as his equal? Well, no help there as numerous people bare a scar or two from their run-ins with the man. Granted some are now dead but let's move forward. The power he knows not, again now very helpful. Dumbledore wants you to believe it's love but if it was love, the Killing Curse wouldn't work. Now, Dumbledore likes to say that my former brother survived the Killing Curse. I would like to submit my memories to show that he was never hit by a spell. It was the ceiling falling down that caused the scar. There is also no record of any dark residue in the scar and no record of any healing attempt being made on it. So to me, it is a basic scar.\"</p>\n<p>\"That isn't true.\" Barry screamed from where he had been sitting. </p>\n<p>Harry grinned. \"Shall we prove it?\" Harry held up a vial. \"I have my memories. I am sure we can get someone to run a scan on your scar.\" </p>\n<p>Madam Bones waved her wand. \"Unspeakable Cracus will be joining us.\" </p>\n<p>The Dark Lord and Lucius were a bit surprised. They weren't expecting Harry to do this. \"Harry?\"</p>\n<p>\"Relax, it's from the moment after you cast the killing curse.\" </p>\n<p>Unspeakable Cracus arrived and Barry was seated in a chair. He looked smugly at Dumbledore. Dumbledore's eyes were twinkling. They watched as the spell was cast. Everyone watched as the spell remained white and when the Unspeakable cast a basic healing spell, they saw the scar disappear. \"It wasn't from a dark curse.\" He handed his results to Madam Bones and left. Madam Bones took the memory vial and projected the memory into the air. </p>\n<p>************Memory****************</p>\n<p>Harry was crying. Barry was sitting in his cot, looking around. The room was a mess. Harry started screaming \"mummy\" suddenly there was a crack and the pieces of the ceiling started to fall. Barry landed on his back as Harry was yelling louder. They heard some more cracks and everything went black. </p>\n<p>\"Wait for a few minutes.\" Harry informed them. They waited.</p>\n<p>Blackness faded as they could see Lily and James Potter holding Barry. \"He did it. I can't believe our son did it.\" Lily was bouncing Barry. </p>\n<p>\"Mummy!\" Harry demanded. </p>\n<p>\"Our boy. He defeated Voldemort.\" James hugged Lily and Barry.</p>\n<p>\"James, James, is everyone alright?\" Dumbledore arrived with Sirius Black.</p>\n<p>\"Yes, yes, it is. Look Barry defeated Voldemort.\" </p>\n<p>Dumbledore looked at Barry. \"Yes, yes he marked. But I don't believe the man is gone for good. Severus still had his mark when I left. He said he felt a change in it.\" </p>\n<p>\"What does that mean?\" Lily sounded fearful.</p>\n<p>\"It means that he will return. We need to train Barry. You will need to get rid of Harry. He won't like not being the center of attention and he might interfere with Barry's training.\" </p>\n<p>\"Yes, of course, anything for our precious baby boy. I'm sure Petunia would take him.\" </p>\n<p>*********End memory***************</p>\n<p>Chaos broke out. Dumbledore looked at Barry. Barry wasn't the prophecy child. Where was Voldemort? Where has the man been for the last fifteen years? What happened that night? He looked at Harry, was he the prophecy child? He never checked the boy, he had taken Lily and James' word. He had seen a pile of ashes but that could have been from the debris that fell. \"Shall I continue on?\" Harry waved his hand at the prophecy.</p>\n<p>\"I don't believe that is necessary.\" Madam Bones cleared the memory and the prophecy. \"Arrest Albus Dumbledore, James and Lily Potter, Sirius-\" she stopped speaking and just handed the arrest warrants to the Aurors. </p>\n<p>_____________________________________________________________________</p>\n<p>Harry leaned against Severus as they were sitting on the couch. His family had returned home yesterday after Dumbledore and the Potters were found guilty and sentenced to five years in Azkaban. Barry was placed in a new home, under the guardianship of Madam Bones. Hogwarts was getting a new Headmaster, Severus Snape. Minerva was going to remain the deputy. </p>\n<p>\"Since I am not a student any longer, how about that date?\"</p>\n<p>Severus smirked. \"I am going to be the headmaster, I can't date a member of the staff.\" Harry was hired as an Assistant Professor. He was going to be working on his getting his masters in defense. Severus already hired the Dark Lord as the new defense professor. </p>\n<p>\"I will quit.\"</p>\n<p>Severus didn't move for a second. He knew Harry had been interested in him as he was also interested in Harry. \"You sure you want to date me?\"</p>\n<p>\"Sev, you were the only man who wasn't family that supported me. You made sure I learned how to survive in Azkaban. You made sure I was taken care of. Who else would I want? I want someone who saw the real me. I see the real Severus Snape and I like what I see.\" </p>\n<p>_______________________________________________________</p>\n<p>\"I can't believe my baby is getting married.\" Petunia fussed with Harry's tie. </p>\n<p>\"How is Severus doing?\" Harry glanced over his shoulder at his cousin.</p>\n<p>\"I think Lucius and Marvolo are about to give him a calming draught.\" Dudley had married last year. His wife, Daphne Greengrass was pregnant and expecting twins. </p>\n<p>\"I think it's sweet that he is so nervous.\" Daphne spoke from her comfortable chair. \"You should have seen Narcissa trying to get him into something other than black robes.\"</p>\n<p>Harry smirked. \"Let's get this over with.\"</p>\n<p>_______________________________________________________________</p>\n<p>\"I say Slytherin.\" Severus placed his sickle on the head table.</p>\n<p>\"Ravenclaw.\" Harry answered.</p>\n<p>\"Peverell, Templeton.\" </p>\n<p>Harry grinned as he watched their oldest child walk up to the sorting stool. Their children were a perfect combination of Peverell and Snape. Tall, with black hair, black eyes, with green specks, lean, but with brains. \"Ravenclaw.\"</p>\n<p>Harry took the prize money. \"You can win it back later.\" He whispered to his pregnant husband. They had five children already and the sixth was a bit of a surprise but a welcomed one. </p>\n<p>Templeton joined his older cousin at Ravenclaw. \"Your father won.\" Sophia Dursley handed over a Knut. \"I thought you would be a Slytherin, Uncle Sev thought so too.\" </p>\n<p>\"Oh, I could have been Slytherin, but honestly, I didn't want to spend the next few years with Septimus. He is as pompous as his father was. I am thankful Uncle Draco outgrew it and can't wait until Septimus does.\" </p>\n<p>\"He will. He has a huge crush on Uncle Fred's daughter Angie.\"</p>"
}