{
  "id": "8477533",
  "url": "https://archiveofourown.org/works/8477533?view_full_work=true",
  "author": [
    "DaaroMoltor"
  ],
  "title": "A Sense of Identity",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "DCU (Comics)",
    "Batman - All Media Types",
    "Superman - All Media Types"
  ],
  "relationships": [
    "Clark Kent/Bruce Wayne"
  ],
  "characters": [
    "Clark Kent",
    "Bruce Wayne"
  ],
  "additional_tags": [
    "Identity Porn",
    "Secret Identity"
  ],
  "language": "English",
  "series": "",
  "published": "2016-11-05",
  "completed": "2016-11-12",
  "words": "21,081",
  "chapters": "7/7",
  "comments": "563",
  "kudos": "16,821",
  "bookmarks": "3,185",
  "hits": "156,262",
  "summary": "<p>It was a Thursday afternoon at the end of March, and Bruce Wayne met Clark Kent in the way enterprising billionaires tended to meet investigative reporters: Through an interview.<br>Kent had posture like cooked spaghetti and wore his plaid like the strangest camouflage in history.</p>\n<p>Bruce was less than impressed.</p>\n<p>Distraction from post-election horror.</p>",
  "notes": "<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>This is kind of stupid, and a part of a <i>very</i> rough draft for the last part of this chapter. I did, however, write the rest of the story with it in mind and I can't quite bring myself to completely kill this darling. As you will probably be able to tell, it sets a completely different tone and now I imagine it happening later in the week or something, when the dust has settled and they are re-getting to know each other. If you enjoy it - nice. If you don't - just disregard it: </p>\n<p>“How do you…?” Clark trailed off, and the uncertainty painted plain on his features made something in Bruce’s gut twist.<br>“How do I what?” he asked.<br>“You- Batman.“ Clark sighed and dragged a hand across his face. “Do you use a voice modulator?”<br>Bruce shook his head. Adopting Batman’s timbre, he replied: “Just change the way I speak.”<br>Clark’s eyes widened and a blush crept onto his cheeks.<br>“Oh my god,” he said, sounding horrified. “That’s your sex-voice.”<br>Bruce blinked.<br>“Oh my god,” Clark said again, before he started laughing. “Have you <i>seen</i> how tight my suit is? We will never be able to work together!”</p>",
  "text": "<p>It was a Thursday afternoon at the end of March, and Bruce Wayne met Clark Kent in the way enterprising billionaires tended to meet investigative reporters:</p>\n<p>Through an interview.</p>\n<p>Kent had posture like cooked spaghetti and wore his plaid like the strangest camouflage in history. His voice was soft and seemed to be permanently stuck in a state of slight sheepishness, like he was sorry for taking the time out of your day, and he stuttered slightly on about every seventh word. He was two inches taller than Bruce and the width of his shoulders was greater but, despite this, he had a talent for not taking up any space in any room he occupied.</p>\n<p>It wasn’t, in the strictest sense, the <em>very</em> first time they had encountered one another; as was the way with reporters and billionaires, they had crossed paths at some event or other at some point, though Bruce couldn’t recall the precise details at this very moment. As far as introductions went, however, this <em>was </em>their first, complete with scheduled time and <em>hi-how-are-you</em>s. As they shook hands and traded the very first pleasantries, Bruce tried to recall anything else he knew about the reporter.</p>\n<p>Largely, he realized as he gestured for Kent to take a seat, all that he knew was all that he had just observed; that he was a clumsy, somewhat absent-minded man, unremarkable in every way.</p>\n<p>And so it was perhaps not so strange that Bruce soon felt keenly ostentatious, in his wide-legged sprawl and thousand-dollar-suit, in a way he hadn’t really done in years. It was a feat in and of itself, actually.</p>\n<p>The unassuming man then went on to ask all the questions the infallibly polite reporter ought to ask: <em>How is your day going?, Do you mind if I record our conversations?, Any topic off limits?</em></p>\n<p>Bruce hadn’t been asked all three in one interview in decades. (He answered <em>well</em>, <em>no</em>, and <em>yesterday night</em> – winking, and referring to a non-existent sexual encounter, and not the skirmish with Killer Croc that had actually taken place. Kent blushed and dropped his pen.) Still, Kent would be the one to do it, in his two decades out-of-fashion dress shirt and very faintly midwestern accent.</p>\n<p>There was, of course, a reason as to why Gotham’s favorite playboy was being interviewed by such a decidedly <em>Metropolis </em>reporter: a new branch of Wayne Electronics was set to open in the city late next month. This first foray of any Wayne Enterprises subsidiary into the city would naturally be heralded by splendor and great fanfare: there would be party-going and fundraising galore until the whole city was buzzing with excitement.</p>\n<p>So much so, hopefully, that it would drown out any rumors of shadows moving in the night.</p>\n<p>Batman had watched Superman from afar since his sudden appearance a nearly a year ago. It was time for a closer look.</p>\n<p>The interviews were an integral step in building anticipation. As such, they were held in the delicately ostentatious foyer of the company’s skyscraper – only just completed – and the grand room was positively overrun. They were a rather eclectic group, too, with everything from photographers to caterers to soon-to-be R&amp;D members.</p>\n<p>And Kent, of course. Who was still taking his time setting up the interview. Bruce watched him, dithering with pencils and flipping through papers, and wondered how the hell <em>that</em> happened.</p>\n<p>Kent was not the first reporter he had met with today (more like the seventh, actually), and the comparison to his predecessors was impossible not to make. Despite that Kent was the only one from a proper paper, instead of some pumped-up tabloid, he was the least impressive. By far.</p>\n<p>Perhaps, Bruce mused, sipping from his heavy tumbler, this was what happened when reporters lost a bet?</p>\n<p>Kent glanced up briefly – his eyes were very blue – and smiled softly. Bruce nodded magnanimously; a generous offer for him to take his time. Kent’s smile grew a little wider, and he looked back down at his notes with an air of faint abashment.</p>\n<p>It was another half-minute before he spoke.</p>\n<p>“I was thinking we could start…” Kent said, flipping through his notebook, running a finger down the lines, “with the fact that 13% of your profits from Wayne Entertainment is donated to <em>The Affordable Housing Coalition of Gotham</em> each month.”</p>\n<p>There was a fraction of a moment where Bruce's lips parted ever so slightly and the muscles in his back tensed. His heart clenched in an extra beat.</p>\n<p>Then he shut his mouth and relaxed, quicker than any ordinary eye would possibly have been able to catch the slip, and said: “I’m sure I have no idea what you mean.”</p>\n<p>As soon as the words were out he wanted them back in. It was, in all likelihood, his most idiotic slip in years. He should have stuck with the surprise, should have demanded to see the figures so he could take action against whoever was responsible. But the emotion had been so honest that he had instinctually fought to hide it.</p>\n<p>He had been a half a second too slow.</p>\n<p>He had to fight with himself not to change his laid-back and wide open posture.</p>\n<p>\"Oh, you can't fool me, Mr. Wayne,\" Kent said with a sycophantic smile that very much suggested otherwise. \"I will admit it is very well hidden – with all the offshore accounts and shell companies and all, I’m sure there’s no need to go into detail – but there is no doubt that the money is coming from you.\"</p>\n<p>Suddenly uncomfortably aware of his own racing pulse, he laughed and leaned forward.</p>\n<p>\"Is that so? Well, I will certainly need to have a talk with my economists about this. And my PR-manager! What an opportunity gone to waste!\"</p>\n<p>Kent smiled his perfectly bland smile again. \"Would you like me to quote you on that?\"</p>\n<p>Bruce forced a mildly flustered expression. \"No no no, please don't, the PR-guy has only barely let me out after that thing with the vase last week - I'd never see the light of day again if he found out that I said that. Might I suggest you put something about me always being proud to help my city instead?\"</p>\n<p>\"Unfortunately, that's not how it works, Mr. Wayne. You need to actually say something for me to be able to write that you did.\"</p>\n<p>\"Oh, one of those <em>ethical</em> ones, are you?\" Bruce observed with a slight wrinkle of his nose. \"Well, be a pal and do at least try to piece it into proper coherence, would you? I just might be the slightest bit inebriated.\" He lifted his glass with a wink and sipped the whiskey – a rather disgusting non-alcoholic variant unlikely to affect any part of his body except his bladder, but which could be passed off as the real thing if someone decided to steal a sip from his glass. \"Would you like some?\"</p>\n<p>Kent’s mellow smile suddenly made Bruce feel horribly transparent. “No, thank you, but it’s kind of you to offer. Perhaps we could discuss the 18% from your <em>Wayne Steel</em>’s 2007 profit that funded the new Children’s Wing at Gotham General Hospital, instead, if my previous choice of topic was making you uncomfortable? Or the seventeen scholarships you independently fund. Or the three research grant programs. I have numbers on those too, of course, somewhere in this pile, but you should be familiar with them. Or we could talk-”</p>\n<p>“I believe you have made your point, Mr. Kent,” Bruce interrupted.</p>\n<p>Perhaps a bit unnecessarily harshly.</p>\n<p>He closed his eyes for a moment, and then put on a slightly self-depreciating smile (and didn’t that particular expression come very easily to him right now?).</p>\n<p>“So you have found out I’m not above a bit of bribery,” he said with a dismissive gesture. “Surely that can’t be surprising enough to make any sort of news, with my reputation?”</p>\n<p>“Bribery?” Kent asked, sounding politely surprised. “You will forgive me, Mr. Wayne, I’m not all that well versed in the art of bribery, but I do believe that the point is that <em>you </em>should get something out of it too?”</p>\n<p>“And who says I haven’t?” Bruce asked, and forgot to smile.</p>\n<p>“I’m glad you asked, Mr. Wayne. You see, I-“</p>\n<p>Kent cut off suddenly, and for a heartbeat Bruce was still too agitated to even notice.</p>\n<p>Then Kent asked, in a very different tone of voice: “Did you hear that?”</p>\n<p>Bruce managed to get out “Hear wha-?” before the explosion blew out the windows.</p>\n<p>After that, events proceeded like events tended to proceed when mayhem was unleashed: there was screaming and running, and a great deal of chaos. A considerable security force swept in and removed the civilians and tucked Bruce’s away in the secret bunker in which he supposedly was to hide out in until trouble was over. There, he slipped into his suit (not for the first time, as he struggled with the Kevlar, he reflected that, for all its absurdity, the spandex suit favored by other vigilantes did have the advantage of being easy to hide underneath regular clothes. But, then, other vigilantes tended to have powers, and spandex was not known for stopping bullets) to join the action.</p>\n<p>He swept down into the middle of the chaos with the help of his grappling hook.</p>\n<p>His sudden appearance, as usual, did nothing to diffuse the tension. A woman yelled shrilly, and someone called desperately for Superman.</p>\n<p><em>Metropolis, </em>he thought uncharitably, and punched one of the attacking robots in the face.</p>\n<p>It was not his usual sort of battle.</p>\n<p>The most obvious difference, of course, was the setting: broad and shining daylight in Metropolis, instead of gloomy night in Gotham. The buildings around were glossy and polished and new, steel and glass instead of brick and stone. Fewer places to hide, less purchase for his hook.</p>\n<p>Thus, he fought his enemies on the ground, despite the gathering of people.</p>\n<p>There were three of them, all in all, and they looked rather like bastardizations of Luthor’s battle suit. They were too short and squat for any human to fit inside and – he was fairly sure – in the wrong color scheme.</p>\n<p>He attached one of his EMP-mines to one he had just punched, and then deployed his grappling hook to swing himself to the next one.</p>\n<p>The AI didn’t seem to be terribly advanced; though the remaining two were quickly ganging up on him, he found that he had little trouble anticipating and dodging their blows. He also quickly realized that, with the right technique, he was able to engage the both of them fully; an advantageous situation, since it left little opportunity for them to go after the civilians.</p>\n<p>Over the shoulder of one of the battle droids he spotted his security details ushering people out of the building he had just vacated – Clark Kent among them, with a woman clinging to his arm. He barely had time to catalog the information that the building now was likely to be empty – perhaps he could take the battle inside to prevent damage to bystanders – before…</p>\n<p>“<strong><em>Bomb</em></strong>!” a voice yelled hysterically.</p>\n<p>Bruce kicked one robot into the other and spun.</p>\n<p>The machine that <em>should </em>have been thoroughly disabled by his EMP-device was standing, arm raised and its hand inhumanly twisted flat up against its wrist, revealing it to be a barrel. A smoking barrel.</p>\n<p>Bouncing on the ground, trailing smoke and giving off short beeps, was some smaller type of grenade.</p>\n<p>If his Luthor-hypothesis held true, it likely had enough power to blow the whole block.</p>\n<p>For a moment it was so quiet that he could hear the <em>clink </em>of metal bouncing against asphalt.</p>\n<p>Then the screaming began.</p>\n<p>He already had the garrote in his hands when he whipped back to face the robots. The sharpened wire took their heads clean off, and the LEDs on their bodies blacked out.</p>\n<p>A spike of relief flashed through him – <em>thank fuck for unimaginative villains and their predictable placement of essential circuitry </em>– and then he spun to-</p>\n<p>Find Kent cradling the bomb with his body.</p>\n<p>\n<em>Civilians.</em>\n</p>\n<p>\n<em>Idiots. </em>\n</p>\n<p>“MOVE!” he bellowed, hoping beyond hope that the reporter would hear him over the din of shouting people.</p>\n<p>Kent, impossibly, looked up. And scrambled away when Batman came hurling towards him through the air.</p>\n<p>Bruce’s kick landed perfectly and was so hard that he felt it through his steel-toed boots. The device sailed in a tall and beautiful arch through the air and-</p>\n<p><em>Exploded</em>.</p>\n<p>Bruce threw up the cape to shield himself from the heat and took half a step back when the shockwave hit him. For a moment, an unnatural whine was all he could hear and the world was painted in white. Then the sound resumed and there was the wail of car alarms going off and the faint patter of falling glass from the blown-out windows several stories up.</p>\n<p>Bruce straightened and regarded the masses critically. The glass would cause some damage, but most of what pattered down were small and square and blunt – safety glass. Fighting in a modern city had its advantages.</p>\n<p>And at least it wasn’t the limbs and blood of some reporter with a hero complex raining down over them.</p>\n<p>He glanced down at Kent, sitting on his arse on the pavement with his glasses askew.</p>\n<p>Bruce had no desire to stay out longer than absolutely necessary – not in a foreign city in broad daylight. Directing a last menacing grimace at Kent, he swept away into the shadows.</p>\n<p>With Batman gone, Bruce emerged coughing from the rubble, muttering about the virtues of underground bomb shelters. </p>\n<p>He was still in the Cave, in his suit, when he took the call.</p>\n<p>It was around ten-thirty on a Tuesday morning in the beginning of April, and Bruce had not gone to bed that night. Nor, as a matter of fact, could he recall the last time had. The past weeks he had lived on stolen moments of shut-eye between meetings and brief periods of unconsciousness in the car or plane as Alfred chauffeured him between Gotham and Metropolis.</p>\n<p>His days had, naturally, been spent trying to do both imagerial and practical damage control after the explosion: he had given interviews, sat in on meetings, overlooked reconstruction, met with shareholders, visited families of victims, set in motion the beginnings of a gala for the Metropolis rescue workers… And had also hacked his way into Luthor’s servers and stolen the schematics for the robots, and started on a new design for more effective EMP-weaponry. Unrelated, technically, to the bombing but even more troubling; he had also spent some time trying to figure out how Kent’s source had managed to uncover the money trails to the charities. He had too little time to attempt the hacking required himself, however, and so had finally had to settle for only reburying it. Any and all holdings connected to Batman had always been kept entirely separate, but he had looked them over all the same.  </p>\n<p>His nights and evenings had been spent on a very different sort of mission. Bruce Wayne had been socializing and partying relentlessly. His PR-manager had thought that this would be a good way to show himself unbowed by the threat and optimistic about his new holdings in Metropolis. (Personally, he had found it to be a good way to snag column-inches away from the speculations around Batman and his entirely unsubtle appearance.)</p>\n<p>When Bruce Wayne had finally staggered into bed, Batman had emerged.</p>\n<p>Sometimes in the same city, but not always. There were always the regular patrols in Gotham, of course, and he had also started looking into the Superman situation when he was in Metropolis. But, primarily he had to do damage control – at both locations. It had been a lot of work, trying to uncouple the sudden arrival of his alter-ego with that of his own. Undoubtedly, if left alone, someone would have eventually connected the coinciding entrances of two of Gotham’s most prominent figures on the Metropolis scene. Thankfully, however, most of the attention had been directed toward the explosion. It had given him enough time to manage to diffuse the trails and the timelines. It had not been very hard or complicated work – being seen here or there in a suit (with a tie or with Kevlar), spreading this or that rumor – but it had taken considerable time and effort.</p>\n<p>Yesterday’s evening he’d spent at a party in Gotham, getting (seemingly) too intoxicated for decent company and disappearing away fairly early in the evening with one Leslie Pierce, with whom he had dallied previously. She had been drunk enough to be trusted to forget that he absconded through a back-door instead of having sex with her.</p>\n<p>He had left his tie and right sock in the room to implicate himself, and gone home with the firm intention of <em>going to sleep. </em></p>\n<p>Then Parasite had attacked.</p>\n<p>He was new, had shown up declaring nothing more than his name, and had seemed to want nothing except to wreak havoc.</p>\n<p>Superman had quickly managed to move the fight to an abandoned area of the docks, where none or few civilians would get caught in the fray. From there things had quickly gone south. Bruce had suspected as much from the first few traded blows, but all-out battle confirmed it: Parasite was leeching off Superman’s power. It had been a worrying, but also a very useful, demonstration; no other had challenged Superman like this before, and it also confirmed that he could be stopped, if push came to shove.</p>\n<p>It had been a tense few hours, however. Superman had never been much of a battle tactician – why would you need to be when you were faster and stronger than everyone else? – and there was no way to win against Parasite with brute force only.  Still, Superman had appeared to learn from his mistakes and adapt to his new weaknesses rather quickly (also important information).</p>\n<p>It was not yet dawn when Parasite lay defeated in a crater of his own making.</p>\n<p>There was much left for Bruce to go through, though: hours and hours of footage rapidly leaking onto the web, at least three new potential avenues for stopping Superman that needed examining, and finally Parasite’s mysterious abilities and background.</p>\n<p>He was clicking through mugshots, looking for a face like Parasite’s, when, suddenly, the rather obnoxious beeping of an incoming call started echoing through the cave.</p>\n<p>The pointer seemed to move to the <em>Answer call </em>button on the pop-up quite on its own.</p>\n<p>“Yes?”</p>\n<p>“… Hi? I was trying to reach Mr. Wayne?”</p>\n<p>Bruce cleared his throat, tried to dislodge Batman. “That would be me. And who, might I ask, is calling at this ungodly hour?”</p>\n<p>“Oh! Mr. Wayne! I didn’t-! Er, it’s Clark Kent, from The Daily Planet.”</p>\n<p>“Kent?” Bruce said though he could recall him perfectly, “Oh, right. Still in one piece, then?”</p>\n<p>“I’m- uh-… what?”</p>\n<p>“Last time,” Bruce said, summoning a yawn (with very little trouble). “I seem to recall seeing you throw yourself on top of a bomb?”</p>\n<p>Kent laughed uneasily. “Hah, oh, that. I prefer to not think about it, really.”</p>\n<p>“Hm, yes, I could see why. You’ll be calling about rescheduling, then?”</p>\n<p>“Er, yes, actually. Would that be possible?”</p>\n<p>“Yes, yes, sure,” Bruce replied.</p>\n<p>It was a rather alarming reflection on his presence of mind that it was the silence that made Bruce realize that he’d said anything out of the ordinary.</p>\n<p>“… really?” Kent asked, sounding like Christmas had come early.</p>\n<p>“Yeah, sure, why not?” Bruce said, lowering his forehead carefully onto the table, making sure no sound would be picked up by the sensitive mic.</p>\n<p>\n<em>Come on, <strong>think</strong>. </em>\n</p>\n<p>He was too tired. His mind was at a standstill. He had to grasp at straws.</p>\n<p>“Well, if you can come today?”</p>\n<p>“Today?”</p>\n<p>“Yes, well, it was supposed to be publicity for Wayne Electronics, was it not? And it opens next week so I think the sooner the better, no?”</p>\n<p>“Er, yeah. I mean, yes, I can be free today.”</p>\n<p>There was a slight pause as he spoke that gave Bruce the distinct impression that Kent was making faces at whoever decided if he could, in fact, be free today. He chuckled quietly at the picture, and then immediately frowned at himself for the stupidity.</p>\n<p>The interview <em>had</em> to be avoided. At all cost.</p>\n<p>“Where would you like to meet?”</p>\n<p>“Here,” Bruce replied, struck by sudden insight. “At the Manor.”</p>\n<p>“The <em>Wayne </em>Manor?” Kent asked.</p>\n<p>“Yes. In Gotham.” Bruce might have stressed the name of his city slightly.</p>\n<p><em>You have important things to do, </em>Bruce attempted to prevail upon the reporter at the other end of the line, <em>you have very important things to do and can’t possibly indulge the whims of a spoilt billionaire. </em></p>\n<p>“<em>Really</em>? Yes, sure, absolutely!” Kent said, enthusiastic and apparently impervious to telepathy. “I’m actually only about ten minutes away, how soon can I come?”</p>\n<p>Bruce stared at the floor, marveling at his poor fortune.</p>\n<p>“Mr. Wayne?”</p>\n<p>“Yes, sorry, I’m here. Give me half an hour? I’m not exactly dressed for company yet- well, not the decent sort of company.”</p>\n<p>“Well, it could make for a very interesting interview.”</p>\n<p>Bruce straightened up slowly, certain now that his exhausted mind was playing tricks on him.</p>\n<p>The silence hung heavy in the air.</p>\n<p> “I… er… see you in thirty, then, Mr. Wayne?” at least Kent’s tone was perfectly professional this time, if slightly hoarse.</p>\n<p>“Yeah, see you in thirty.”</p>\n<p>He moved his hand and clicked the red button to end the call without saying goodbye, and tabbed over to the intercom to activate it.</p>\n<p>“Alfred?”</p>\n<p>He waited, well beyond the usual time it took for Alfred to answer, but there was no reply.</p>\n<p>Because Alfred had left about twenty minutes ago, to go pick up the new EMP mines, right; that’s why Kent’s call had gone through to the Cave in the first place.</p>\n<p>Fuck.</p>\n<p>He pushed the chair back and pressed the power button on the computer, and stood. He had half an hour, provided Kent would be on time. He seemed like the type that would be. He had to… <em>prepare. </em></p>\n<p>He rubbed the heels of his hands against his eyes and spared a fleeting moment to wish desperately for Alfred. Then he gathered himself and dismissed any thoughts of the kind - wishes wouldn't help him now.</p>\n<p>A change of clothes first – a far less perceptive reporter than Kent could probably make something out of Bruce Wayne coming to greet them in the Batsuit.</p>\n<p>He ended up in a pajamas-bathrobe combo (one that Alfred had once called <em>“horrendously vulgar”) </em>and in one of the sitting rooms on the ground floor. There, he found himself the hardest chair and tried to focus, to organize his mind. In the end, though, it turned out to be a mostly futile endeavor; he was too tired to dare try much meditation and the strategies he had planned to distract and evade Kent seemed to slip from his memory even as he tried to grasp at them.</p>\n<p>In what seemed to him only the second after he had sat down, the alarms for the gate opening set his phone vibrating and Bruce cursing his entire existence.</p>\n<p>The doorbell sounded when Bruce was only ten feet from the front door, and he managed to swing it open before the button could be pressed again.</p>\n<p>Outside it was raining cats and dogs and Clark Kent held a newspaper above his head as a makeshift umbrella. He looked horrible; completely soaked through, hair an impossible mess, glasses askew, rings so dark under his eyes they were practically black, and so slumped that he looked inches away from falling over.</p>\n<p>“Oh thank heavens,” he said and slunk past Bruce inside without being properly invited.</p>\n<p>Bruce raised an eyebrow but pulled the door closed behind him and said nothing. Kent was wiping his glasses on his jeans and making a face at his ruined paper, down which the rivulets were running black with washed off ink.</p>\n<p>“I do believe I have today’s edition of the Gazette laying around here somewhere, if you are in need of a replacement?” Bruce offered.</p>\n<p>“Oh!” Kent said, seeming to only realize that Bruce was there at that very moment, and hurried to put his glasses back on and try to catch the drip from the paper in his cupped palm. “No, that- that’s okay, I flipped through it on the way here, and I think it was probably put to better use as an umbrella.”</p>\n<p>Kent’s voice had a slight rasp to it, and the slower pace it forced appeared to have eased his stutter.</p>\n<p>Bruce snorted. “Sounds likely. Don’t bother about the water; I think you’re fighting a losing battle.”</p>\n<p>Kent looked down at his hand, where the water had gathered quickly and was flowing over and dripping onto the floor. He sighed like the sight pained him, but separated his fingers and let it splash onto the dark wood. “My mother would kill me.”</p>\n<p>Bruce couldn’t help but quirk a grin. “I promise I won’t tell on you.”</p>\n<p>Kent looked up at him with a smile. And then his eyes swept downwards over Bruce; over the dark red silk pajamas, with half the buttons undone and the pants slung low on his hips, and the dark dressing robe he wore on top.</p>\n<p>Kent blushed.</p>\n<p>Bruce wondered if he was recalling the words he had said on the phone earlier.</p>\n<p>Then Kent shook himself and held out a hand. “Nevertheless, I shouldn’t have to invoke Ma to find my manners, I apologize. And thank you, for agreeing to meet me, Mr. Wayne.”</p>\n<p>Bruce took the offered hand and shook, but waved the other dismissively in the air as he did. “Don’t worry about it, I’m not exactly a paragon of that virtue myself – much to the chagrin of dear Alfred.”</p>\n<p>“I think you do alright,” Kent said, and let him go.</p>\n<p>“Well, I <em>do</em> try,” Bruce said and put on a grin, “for example: could I perhaps help you out of that dreadfully soaked jacket, Mister Kent?”</p>\n<p>Kent laughed.</p>\n<p>“Yes, <em>please,” </em>he said and turned to give Bruce easier access. “I’m not sure I could get out of it on my own, at this point.”</p>\n<p>Bruce had to reach up to peel the clinging fabric off him, and it came away only very reluctantly and with a squelching sound. The rain had soaked through the jacket, and Kent’s dress-shirt was wet and clinging to his shoulders and the top of his upper arms. Bruce's eyes lingered there, as Kent combed fingers through his dark hair to get rid of excess water. He shook his head slightly, like that would free him of the remaining drops, and then looked up sheepishly.</p>\n<p>“Thank you, Mr. Wayne,” he said again, smiling politely, and relieved Bruce of the jacket. “Sorry about the mess.”</p>\n<p>“No problem, can’t help the weather. Let’s get going, shall we?” he said, gesturing and setting off down the hall.</p>\n<p>“Oh, yes, of course,” Kent said and trailed after.</p>\n<p>They walked in silence for a while, Bruce a little ahead, watching Kent watch his home from the corner of his eye. When they stepped onto a carpet, the reporter stumbled and had to catch himself against the wall.</p>\n<p>“Are you sure you’re alright, Kent?” Bruce asked.</p>\n<p>Kent looked embarrassed but waved off his concern. “Thank you for your asking, but I’m okay. Just tired; the battle kept me up last night.\"</p>\n<p>For a moment Bruce was confused, wondering what on earth Kent could have gotten himself into.</p>\n<p>\"Oh, right,\" he said, then, when he realized – Superman’s battle must have been earth-shaking in Metropolis, both literally and figuratively. “The battle of giants yesterday, heard about it on the news earlier. Were you close to the action?”</p>\n<p>With a slight smile, Kent said: “Fairly close, yes.”</p>\n<p>“Work?”</p>\n<p>“Yes, I wasn’t primary – Luis handles the pieces on Superman – but I had to be ready to step in.”</p>\n<p>“And now you’re <em>here</em>? Jesus, Kent, how long are your shifts?”</p>\n<p>Kent smiled wryly. “Longer than you could imagine, Mr. Wayne.”</p>\n<p>“Undoubtedly,” Bruce said, smiling back. “Here we are.”</p>\n<p>He gestured to the open door to the sitting room he had chosen previously. Kent nodded and stepped in ahead, looking around. Bruce stayed behind for a moment, watching how the man carried himself.</p>\n<p>“If you don’t mind me saying, Mr. Wayne,” Kent said suddenly, eyes on the bookshelves lining the northern wall, “you don’t look so good either.”</p>\n<p>“Flatterer,” Bruce said, leaning against the doorframe with his arms crossed over his chest.</p>\n<p>“Yes, I’m sure you don’t get enough of that,” Kent replied, half-turning back towards him with an eyebrow raised.</p>\n<p>“Never, Mr. Kent, never,” Bruce said with a twist of his lips and walked into the room. “But to answer your implied question: I, too, have been rather hard-pressed to find time to sleep lately.”</p>\n<p>Kent laughed. “The problems of the rich and beautiful?”</p>\n<p>“Alas,” Bruce said with a shrug and a splay of his hands.</p>\n<p>Kent’s laugh turned into a snort and, for some reason, that pulled at the corner of Bruce’s lips.</p>\n<p>“Well, sit down for heaven’s sake, or we’ll have to abandon any aspirations for rest this evening as well,” he said, gesturing lazily towards the couch.  </p>\n<p>Kent smiled and sat, and then immediately let out an almost obscene groan. “Oh my God, what is this couch even made of?”</p>\n<p>“Clouds and kittens,” Bruce answered, putting his hands on the back of the armchair opposite, “or some other magic that I’ve never really grasped.”</p>\n<p>Kent laughed weakly. “And I’m supposed to interview you like this? In <em>this?”</em></p>\n<p>\"You could have just said no,\" Bruce said.</p>\n<p>Kent snorted. \"When it was this difficult to get a meeting with you? No thanks.\"</p>\n<p>“I’m betrayed by my own exclusivity,” said Bruce dryly. “Tell you what though, I could fetch us some coffee to make this easier for the both of us. Alfred – my butler – is out at the moment, but I'm sure I can manage by myself.\"</p>\n<p>\"You’re sure about that, are you?\" Kent asked with a small smile.</p>\n<p>\"We have a machine for these sort of emergencies, thank god, so coffee making involves placing the cup and pushing a button. Otherwise, I would not be making any promises.\"</p>\n<p>\"Well, in that case, thank you, yes, coffee sounds wonderful.\"</p>\n<p>\"Excellent,\" Bruce said and straightened, and over his shoulder as he walked to the door he added: \"I'll thank you not to take advantage of my charitable mood and go exploring.\"</p>\n<p>At his glance back he found Kent leaning his head back against the back of the couch, exposing his throat. He chuckled weakly. \"The chances of me moving <em>anywhere</em>, Mr. Wayne, are exceedingly small.\"</p>\n<p>Bruce, unusually, believed him and went to the kitchen.</p>\n<p align=\"center\">*</p>\n<p>He came back with a tray in his hands.</p>\n<p>Eyes carefully on the china, rattled by a very precise wobble, he walked slowly over to the coffee table. “I realized in the kitchen that I never did ask you how you take your coffee, so I brought...“</p>\n<p>He looked up and found Clark Kent sleeping soundly on his couch.</p>\n<p>He stopped the rattle and frowned down at the unconscious man.</p>\n<p>Then he put the tray down on the table, went over to a bookshelf, pulled a book out at random, and sat down in the armchair across from Kent.</p>\n<p>Then he fell asleep.</p>\n<p align=\"center\">*</p>\n<p>Bruce woke with a start and a crick in his neck, in a room so bright his eyes stung. Through the floor-to-ceiling windows in the eastern wall came the light of the late afternoon sun, its glowing disk slotted perfectly between the horizon and the still darkly opaque blanket of clouds hanging immediately overhead. Bruce squinted at it with a dissatisfied grimace, shielding himself from the worst of the glare with a raised hand. He shouldn’t have fallen asleep, not unplanned in the middle of the day, not in front of-</p>\n<p>He turned his head sharply.</p>\n<p>The room was empty.</p>\n<p>Kent was gone.</p>\n<p>Swearing softly to himself, he got to his feet. Though the sun’s movement really told him more than he wanted to know how long he’d been out, he touched the back of his hands to one of the still full coffee cups standing abandoned on the table.</p>\n<p>It was stone cold.</p>\n<p>He started to withdraw his hand but paused halfway through the movement. Considered. Then he grabbed the closest one and chugged it – partly for the caffeine, partly to wash the disgusting taste of mid-day sleep from his mouth.</p>\n<p>Then he set out looking for Kent.</p>\n<p>The Cave had alarms, failsafes stacked on top of each other, but Bruce had underestimated Kent once and wouldn’t readily repeat that mistake. Sliding his phone out of the pocket of his robe, he set off in a haphazard direction and thumbed open the application that allowed him to view the surveillance feed from downstairs. He leaned to look through some of the open doors he came upon as he walked down the hall, and entered the security key and pressed his thumb to the fingerprint scanner even as he did. The images from six cameras fitted, scaled down, onto his screen at once. All of them were black. Black was good, since it meant nothing had triggered the motion-activated lights.</p>\n<p>He scrolled through the rest of the feeds, looking up sporadically to check for traces of Kent off-screen. He saw nothing, neither on video nor in his home, and swiped over to get at the manual control for the lights. (The lack of night vision cameras was a conscious choice – a last resort should he be hacked, in the event of which he could simply, physically, if necessary, cut the lights and let the shadows swallow him up. The cameras would be rendered useless, even on their backup batteries.) Despite that it was highly unlikely that Kent would have somehow managed to avoid activating the lights - and even more so, been able to move around in the total darkness without any assistance - he paid close attention to the lit images. </p>\n<p>He found nothing.</p>\n<p>But, that was good news.</p>\n<p>He considered escalating – checking the surveillance inside the manor itself – but decided that he wasn’t quite that worried yet.</p>\n<p>His aimless strolling had taken him up to the second floor and, seeing as it would likely have been his own goal had he been in Kent’s shoes, he took the time to check his bedroom in the back of the house. It was empty, however, and nothing seemed to have been moved or even touched. If Kent was too polite to search through his bedroom, it was likely he would also be too polite to venture deliberately further into the house. Bruce pulled the door closed, locked it for good measure, and took the narrow servants’ stairs back down.</p>\n<p>Halfway down he suddenly pulled up short. Waited…</p>\n<p>And, yes, up the stairwell echoed the unmistakable sound of voices. Frowning slightly, he took the remaining steps quickly and quietly, and the sounds grew louder and more distinct. Soon he could recognize both Alfred’s and Kent’s voices, as well as what they were saying, and when he rounded the corner he could see the light streaming out of the open kitchen door.</p>\n<p>“… hardly think this is your point of interest, Mister Kent,” Alfred was saying.</p>\n<p>“I might surprise you,” Kent replied.</p>\n<p>Alfred made a noise of polite disbelief. “I assure you that it would take a lot for anything to surprise me anymore, Mister Kent.”</p>\n<p>“Indulge me, then” Kent insisted.</p>\n<p>Alfred paused slightly, but then said: “Very well. It was in my very early twenties. I played the part of a widower, on the very smallest stage London had to offer.”</p>\n<p>“…Yes, and?” Kent pried, and the rhythmic sound of a knife against a chopping board ceased. “I’m a reporter, remember? I can tell there’s a story here.”</p>\n<p>“And,” Alfred began, dragging out the pause. “It was the very first performed play written by George Benioff.”</p>\n<p>“<em>No!” </em>Kent said, sounding appropriately impressed.</p>\n<p>“Oh yes,” Alfred said, “I think we had sixteen paying visitors, all in all.”</p>\n<p>Kent laughed.</p>\n<p>He looked better now – far more so than he should, considering the brief time they had rested. His hair had dried into curls, and the dark circles underneath his eyes had receded. Most strikingly, he no longer stood sagged like all the weights of the world were on his shoulders; now, laughing, it seemed they had slipped off him completely.  </p>\n<p>“Am I interrupting something?” Bruce asked, leaning against the frame of the door.</p>\n<p>Kent jumped and choked on his laugh, and seemed to immediately shrink in on himself.</p>\n<p>“Oh Gosh! Mr. Wayne! You move <em>very </em>quietly!”</p>\n<p>Bruce raised his eyebrows. “I’ll take that as a compliment, shall I?”</p>\n<p>He slid onto a barstool and stole a piece of tomato off Kent’s chopping board.</p>\n<p>“We are making quiche,” Alfred informed him drily, from where he stood by the stove with a large bowl in his arms. “Spinach and bacon. Mister Kent was being so kind as to help me with the salad.”</p>\n<p>“Hm,” Bruce said, nabbing a piece of lettuce, “I thought I asked Mister Kent not to wander?”</p>\n<p>“And I thought I taught you better than to fall asleep on your guests, Master Bruce.” Alfred cut in before Kent got the chance to reply, “And Mr. Kent did not, as a matter of fact, <em>wander</em>. I found him waiting in the hall outside where you were napping.”</p>\n<p>“To be fair, I did fall asleep first,” Kent cut in with a sheepish grin, pushing the glasses up his nose with a finger. “And I had only just woken up.”</p>\n<p>Bruce turned to Kent, who looked back at him with a soft smile on his lips, and Bruce found he had forgotten what he had been about to say.</p>\n<p>“Yes, well,” he said instead, “no harm done. I got a meal out of it, didn’t I?”</p>\n<p>“One to which you are invited, of course, Mister Kent,” Alfred said.</p>\n<p>“Of course,” Bruce agreed, “it’s the least I could do.”</p>\n<p>“I couldn’t possibly-“ Kent started, but Alfred interrupted him.</p>\n<p>“And naturally Master Bruce will make himself available for another interview.”</p>\n<p>Bruce's eyes flicked to Alfred’s at this, because that could be dangerous. Then again, perhaps not as dangerous as not knowing the full extent of Kent’s information.</p>\n<p>“Yes, naturally,” Bruce said, with a wave of his hand. “But you mustn’t bore me with business <em>now</em>. The conversation I interrupted sounded much more interesting.”</p>\n<p>Bruce didn't really mean what he said. Or, at very least, he said it with the certainty that it was a plea that wouldn’t be heeded; his highest hope for it was as a distraction and a temporary solution.</p>\n<p>And yet the entire topic of Wayne Enterprises was left alone all evening.</p>\n<p>Indeed, Bruce himself was even sometimes spared as Kent and Alfred traded stories. As the quiche went into the oven, Kent shared with them the tale of when he, at the age of six, attempted to bake his mother a surprise apple pie (an endeavor that, apparently, ended in many tears and four saucepans having to be thrown away). As they ate, Alfred confessed to a youth of crime, stealing cherries from the neighbor’s yard. And Bruce found himself relaxing, slipping, inch by inch, out of his assumed persona and into something more genuine.</p>\n<p>The dangerous part was that he didn’t even notice it happening until it was too late.</p>\n<p>Perhaps he could blame it on Kent. He, too, seemed to have relaxed into a different being. Gone was the stutter and over-keen mannerism, the clumsy gestures. He smiled broadly and played with his hair instead of his glasses.  </p>\n<p>Bruce found himself transfixed. Tried to persuade himself it was because of the transformation, and nothing else.</p>\n<p>And then it was suddenly late, and Kent should probably have left an hour ago.</p>\n<p>“Thank you so much for having me,” he was saying, standing outside the door and shaking their hands.</p>\n<p>Bruce and Alfred took turns reassuring him that it was no trouble, apologizing for the inconvenience, and asking if, really, did he not want a ride into town?</p>\n<p>Kent declined, again, and finally walked down the gravel path towards the gate.</p>\n<p>Alfred shut the door.</p>\n<p>They traded a glance and then walked silently together to the next room over, which had windows overlooking the front yard.</p>\n<p> “I heard you speaking. Earlier. I thought he were trying to get information from you,” Bruce said without turning away from the window.</p>\n<p>“That was my initial assumption as well,” Alfred agreed.</p>\n<p>“But he was not,” Bruce said.</p>\n<p>“No, he was not,” Alfred said.</p>\n<p>Bruce let that hang for a moment, but then folded. “What?”</p>\n<p>“I’m sorry?” Alfred said, feigning ignorance.</p>\n<p>“Alfred.”</p>\n<p>“He’s a nice boy,” Alfred said.</p>\n<p>“He’s hiding something,” Bruce answered, glancing down at Alfred.</p>\n<p>“You make him nervous.”</p>\n<p>“He knows more than he should.”</p>\n<p>“He’s polite,” Alfred insisted, firmly.</p>\n<p>And, as was the way sometimes with Alfred, that was the end of it. Shoulder to shoulder, they stood watching Kent’s taxi disappear down the road.</p>\n<p>A week later, Bruce called Kent.</p>\n<p>The information that the reporter possessed was potentially disastrous and in no way could the situation be trusted to resolve on its own. To complicate matters further, it was made up of two separate issues  which needed to be dealt with in separate ways: Firstly, the reporter himself needed to be carefully managed, so as to make sure that the published story would make as little of an impact as possible. Secondly, there was the matter of his source; where he had gotten a hold of the transaction records, and whether whoever controlled the material had or would leak it to others.</p>\n<p>Kent was the key to all of it.</p>\n<p>If the situation went any way other than perfectly, it had the potential to destroy everything. Even just a mediocre piece, published in a paper like the Planet, had the potential to marshal enough interest that someone would decide to take a closer look at his financials. And if they dug deep and hard enough…</p>\n<p>All this Bruce told himself and still it felt like surrender, pressing his thumb to the glass on his phone.</p>\n<p>“Hello?”</p>\n<p>Bruce’s heartbeat did something idiotic, and he closed his eyes and regretted every decision in his life that had brought him to this point. </p>\n<p>“Yes, this is Bruce Wayne speaking.”</p>\n<p>The brief moment of absolute quiet told on the fact that Kent had not expected him to call. “Mr. Wayne! What can I do for you?”</p>\n<p>“Get my butler off my back, if all goes well,” Bruce replied.</p>\n<p>“I’m sorry?” Kent asked, plainly confused.</p>\n<p>“He made me promise to reimburse you for time spent napping,” Bruce reminded him. “I’ve called to see if we could arrange settling the debt.”</p>\n<p>“Oh!” there was something distinctly uneasy about Kent’s exclamation. “Well, I-“</p>\n<p>“Please,” Bruce interrupted, putting a stop to any objections before they could be voiced. “He seems to have lost all faith in my sense of manners and hasn’t stopped pestering me about it; this is me selfishly saving my own skin.”</p>\n<p>Alfred hadn’t mentioned Kent’s visit once.</p>\n<p><em>Very pointedly </em>hadn’t mentioned Kent’s visit once.</p>\n<p>Kent chuckled, and when he spoke the professionalism in his voice was cracking slightly. “I can see your problem there, Mr. Wayne, but really there is no need. Actually, I believe I owe you an apology.”</p>\n<p>“Is that so?”</p>\n<p>“Yes, well, you see, after the incident at our first interview I called your PR department to see if it was possible to reschedule, and the lady that answered-“</p>\n<p>“Yes, I understand that your heroics with the bomb charmed Alice sufficiently that she took a temporary leave of her senses and gave out my private number to a member of the press. Don’t worry, she’s not in any trouble.”</p>\n<p>“Well, that’s a relief to hear, but the fact remains that-“</p>\n<p>“Don’t make me beg, Kent.”</p>\n<p>God<em>damnit, </em>he was flirting.</p>\n<p>There was a heavy pause at the other end of the line.</p>\n<p>“I suppose I won’t, then,” Kent said, in an odd tone of voice. “When would you like to meet?”</p>\n<p>“I’ll be in Metropolis all of next week.”</p>\n<p>“I’m… probably free Thursday afternoon. Four? Would that be suitable?”</p>\n<p>“Yes, that’d be fine,” he said, though his schedule for the day was, of course, packed.</p>\n<p>“Where would you like to meet? Your office, mine?”</p>\n<p>The question snapped Bruce back to the real issue at hand; either office was far too public to discuss the matter of the donations.</p>\n<p>“Actually, I’ve been feeling a bit paranoid about having one-on-ones with the press in Metropolis as of late. Would you mind terribly if we met somewhere where we’re not as likely to be interrupted by homicidal robots?”</p>\n<p>Kent sounded reluctantly amused when he asked: “Did you have somewhere in mind?”</p>\n<p>“I have a penthouse over by Fourth and Park, if that works?” Bruce said before he had time to properly think of the consequences.</p>\n<p>Still, he hadn’t anticipated Kent’s hesitation.</p>\n<p>“Of course you have a penthouse,” Kent said, finally, somewhere between resigned and amused, “Yes, that’ll be… fine.”</p>\n<p align=\"center\">~</p>\n<p>Kent was late.</p>\n<p>Not by much – not yet – but the extra minutes nevertheless had Bruce restless. The amber liquid in his glass was real whiskey, this time, by virtue of him being in away from Gotham and under enforced abstinence from any vigilante-related activities for the evening. The glass, however, had been neglected long enough that the ice in it had melted and diluted his drink.</p>\n<p>Having felt stifled in the apartment he’d retreated onto the large balcony and now stood by its very edge, overlooking the foreign cityscape of Metropolis. The sun still hung bright in the clear sky, but had begun its descent towards the west and the shadows from the skyscrapers were growing tall. The life down on the streets was bustling, vibrant and noisy.</p>\n<p>The unmistakable streak of red and blue that was Superman had swept across the skies twice, only during the time while Bruce had been outside.</p>\n<p>He enjoyed the seclusion of his own home, but he could certainly appreciate the tactical advantage a view such as this would offer.</p>\n<p>The doorbell rang.</p>\n<p>Bruce startled, splashing whiskey over his hand.</p>\n<p>Staring down at the dripping mess, he reminded himself he didn’t believe in such things at bad omens.</p>\n<p>He drew a deep breath, put the glass down on the table to his right, and chose the longer way inside. He took the route by the pool and dunked his hand in the water on his way by. There were towels stacked in the loungers, left there by housekeeping, and he picked the topmost one off the closest one and brought it with him, drying his fingers as he walked.</p>\n<p>As he threw the towel over a barstool in the kitchen, he wondered if it wasn’t perhaps just as well that he would smell like he was inebriated.</p>\n<p>The doorbell rang again, just as Bruce jerked the door open.</p>\n<p>Kent wore an ugly blue-checkered shirt, haphazardly tucked into beige khakis, and a faint blush.</p>\n<p>“Good afternoon,” Bruce said, a great deal less pleasantly than he had intended.</p>\n<p>“Mr. Wayne!” Kent exclaimed, as though it was a surprise to find Bruce there. “I’m so sorry I’m late, I got… held up by a…”</p>\n<p>Kent trailed off, eyes on the collar of Bruce’s shirt. It was open, Bruce realized, and more so than could be considered decent, far down his chest. He wasn’t wearing an undershirt.</p>\n<p>The signs were fairly obvious: the flush deepening, licking of lips, probably some pupil dilation. But Bruce knew immediately, from the agitation in his own chest, that he wouldn’t be able to make use of it.</p>\n<p>Distractions ceased to be useful once they affected him as well.</p>\n<p>“By a what?” he prompted, turning his back to Kent and heading back into the apartment, inviting the reporter to follow with a jerk of his head.</p>\n<p>Once his back was to Kent he buttoned his shirt back up.</p>\n<p>“Er, uh, I- a mugging,” Kent said, hurrying to wrangle his coat off and throw it onto the hanger, pulling the door closed as an afterthought.</p>\n<p>“A mugging?” Bruce inquired, sitting down in one sleek and uncomfortable couch and gesturing for Kent to take the other. “Is that newsworthy in Metropolis?”</p>\n<p>“Er, no,” Kent said, unshouldering his messenger bag and fishing pen and paper out of it. “I walked into it, a bit.”</p>\n<p>Bruce kept his eyes firmly in a different direction as the reporter bent over.</p>\n<p>“Walked into it, a bit?” he repeated.</p>\n<p>“Yes,” Kent confirmed, finally sitting down. “I was taking a shortcut through an alley, and there they were. The guy startled and ran when I showed up, but the woman he’d tried to rob was pretty shaken up, so I stayed until the cops showed.”</p>\n<p>“Hm,” Bruce said, “can’t fault you for being late, then.”</p>\n<p>“I appreciate it,” Kent said, smiling slightly.</p>\n<p>Awkwardly.</p>\n<p>His shoulders were hunched again, his voice high and trembling ever on the edge of a stutter, and he kept pushing up his glasses with the knuckle of his forefinger. Bruce disliked the reversion – more than was strictly warranted.</p>\n<p>Gritting his teeth and reminding himself that he, too, had a persona to protect, he said to Kent with a wide and vapid smile: “Shall we get started?”</p>\n<p>“Sure,” Kent said, bending forward to pick up his bag. “Do you mind if I record?”</p>\n<p>“Could we perhaps limit ourselves to notetaking?” Bruce asked; he had not yet settled on a method of persuasion and a recording device in the room would certainly limit his options.</p>\n<p>Kent looked up and raised his eyebrows, and that piercing look did not belong to the fumbling reporter he pretended to be.</p>\n<p>Bruce hurried to push down the vicious stab of satisfaction.</p>\n<p>“It will take longer,” Kent warned, not lowering his bag. Probably this was a powerful dissuasion to busy CEOs.</p>\n<p>Bruce smiled, and forgot to think of connotations before he spoke. “I’m yours all night.”</p>\n<p>For all its... <em>faults</em>, the statement did prove efficient in getting Kent to drop the subject.</p>\n<p>“Ah, okay, great,” he said, flushing and letting the bag fall to the ground. “Perfect.”</p>\n<p>“Hm,” Bruce said.</p>\n<p>Kent was so busy with a doodle along the top of his pad that he didn’t look up when he asked: “Why don’t we start off with a comment about the attack?”</p>\n<p>They did.</p>\n<p>For the next two hours or so, Bruce was the perfect interviewee. He answered questions in detail, elaborated without having to be asked, paused often to give Kent time to take his notes, and gave several exclusive pieces of information. Kent, though this was their first proper interview, was clearly suspicious, but not so much so that he called Bruce out on what he was doing.</p>\n<p>Then, finally, Kent clicked his pen twice and asked: “And would you like to comment on the charitable donations we discussed in our previous interview?”</p>\n<p>Bruce, for all his planning, found himself at a loss for words.</p>\n<p>“I have brought the papers with me if you would like to look over them?”</p>\n<p>Bruce glanced up at Kent, wondering if the offer was meant as the opportunity for stalling that it sounded like. “Yes, please.”</p>\n<p>Kent nodded and brought forth a very thick blue folder from his bag. He rose slightly from the couch and reached across the table to hand it to Bruce. Their eyes met.</p>\n<p>Bruce cleared his throat and opened the folder up.</p>\n<p>Inside the stacks of paper were grouped with paperclips, stretched to their limit. Small and colorful tabs stuck out from between pages and, at a cursory flip-though, nearly every page seemed to contain annotations penned in a cramped hand. The topmost pile appeared to concern the money to the<em> Affordable Housing Coalition </em>that Kent had mentioned last the topic had come up.</p>\n<p>Bruce looked up, and found Kent watching him.</p>\n<p>“Well,” he said, lips twisting upwards slightly, “what do you say, Mr. Wayne?”</p>\n<p>“I’d say that I'd very much like to know who gave this to you, Kent.”</p>\n<p>To Bruce’s surprise, Kent looked first confused, then insulted. “I do my own research, Wayne.”</p>\n<p>“I’m sure you do,” Bruce said, “but this information is only available to someone with considerable skills with a computer.”</p>\n<p>Irritation twisted into slight bewilderment, and then cleared completely. Finally, Kent smiled wryly. “I see. Well, believe what you will, Mr. Wayne, but I do have the resources to retrieve that information on my own. No one else has it, and only you and I have seen it.”</p>\n<p>Bruce watched Kent, but the reporter only met his eyes unwaveringly.</p>\n<p>“If you say so,” Bruce said finally, not convinced either way, and leaned back on the couch.</p>\n<p>Kent smiled. “If we could, perhaps, go back to my original question…?”</p>\n<p>Bruce nodded.</p>\n<p>Kent’s smile widened, but he broke eye contact in favor of looking down at his notes, scribbling something that was probably nonsense in the margins.</p>\n<p>It was – fairly plainly so – a way of giving Bruce space. An odd tactic, in Bruce’s general experience: reporters tended to try to stress information out of him.</p>\n<p>Perhaps that was why it gave him such pause. Was why Bruce didn’t run through his tactics to find the most efficient, didn’t check his list of lies to find the most convincing. Was why he sat and watched Kent try to make him feel comfortable enough to open up, and felt it work.</p>\n<p>\n<em>Damn it all to hell.</em>\n</p>\n<p>Bruce closed his eyes with a sigh, dragged a hands across his face and through his hair. “No.”</p>\n<p>Kent looked up, brow furrowed, pen still hovering over the paper. “No?”</p>\n<p>“No, I would not like to comment on the donations,” Bruce elaborated, shaking his head. “Frankly, Kent, it’s something I have worked very hard to hide. To have it in the open like this…”</p>\n<p>Kent’s frown deepened, and he didn’t move his hand away from his pad.</p>\n<p>“I understand that it isn’t a fair thing to ask of you, but I would see it as a favor, to me personally, if you could refrain from publishing.”</p>\n<p>Kent leaned back in the couch and narrowed his eyes. “Why?”</p>\n<p>Bruce met the reporter’s eyes across the table, leaned forwards with his elbows on his knees.  He weighed his following words very carefully. “Because I… have cultivated a certain reputation for myself. A reputation that I find… useful. These… things that you wish to expose about me would have the potential to ruin this reputation, and through that… other things in my life, which are important to me.”</p>\n<p>Kent held his gaze steadily, his face an unreadable mask. The tension pressed heavy over Bruce’s chest, rippled across his skin like an itch. The threat of this having been a miscalculation loomed heavy, and all that he stood to lose seemed already beyond his capabilities to save.</p>\n<p>He was at Kent’s mercy.</p>\n<p>He took one last gamble. “I tell you this because I think that, perhaps, you might understand the benefits of having people think that you are something different than you are.”</p>\n<p>For a moment, Bruce wondered if this was taking it a step too far; the tension hung thick in the air, and Kent’s pen hovered a bare inch from the page, the frown deep on his face.</p>\n<p>He swept a calculating look over Bruce.</p>\n<p>Then he flipped the pad closed with a heavy sigh, and a tightness left his shoulders.</p>\n<p>“I do understand,” he said. “Your secret is safe with me.”</p>\n<p>It was so sudden that Bruce was, for a moment, certain that he must have misunderstood. “I-… you are sure?”</p>\n<p>Kent snorted, suddenly the man Bruce had glimpsed last time they’d met. “Hasn’t anyone told you about looking gift horses in the mouth, Wayne?”</p>\n<p>Bruce found himself huffing a laugh, too startled to be able to stop it had he wanted to. “I suppose I expected more resistance.”</p>\n<p>It was too soon to call it victory – Kent could still turn around and publish tomorrow if he wanted – but this way, at least, there would be no comments from him in the report.</p>\n<p>As if having read his thoughts, Kent shook his head with a rueful smile.</p>\n<p>“Why don’t you keep that,” he suggested, nodding to the blue folder still in Bruce’s hands.</p>\n<p>The smile slipped off Bruce’s face. “What?”</p>\n<p>“I’m sure that you would feel more comfortable if it was in your possession instead of mine,” Kent said. “It’s the only copy. It has print dates, too, so you can see approximately how long it took for me to uncover it all, if you feel the need to start moving your assets around regularly.”  </p>\n<p>Bruce blinked down at the documents,</p>\n<p>“I could argue with you some more, if that would put you at ease?” Kent offered wryly.</p>\n<p>Bruce took another moment to stare at the papers, to get his head in order. “Thank you. Clark. I… cannot overstate how much this means to me.”</p>\n<p>Clark waved the appreciation away, but his smile was broad. “If you say so… <em>Bruce</em>. But don’t think I’ll forget that favor anytime soon.”</p>\n<p>Perhaps it was the relief of a vanished threat, perhaps it was the sudden pounding in his chest when Clark said his given name, but there was something… <em>extra</em> to Bruce’s tone when he said: “Please, make sure that you don’t.”</p>\n<p>Clark blushed, and Bruce could not help but to feel pleased with himself.</p>\n<p>“Well then,” Clark said, and cleared his throat and stood, “I suddenly have quite a bit of work to catch up on.”</p>\n<p>Bruce stood as well. “Anything I can do to help.”</p>\n<p>“Yes, well, I should be able to piece something together from all this,” Kent said, waving his small notebook.</p>\n<p>“I’m pleased to hear that I didn’t entirely waste your evening,” Bruce said.</p>\n<p>“Not at all,” Clark assured him.</p>\n<p>They walked the steps to the hallway in silence, and on a whim Bruce grabbed Clark’s coat from the hanger.</p>\n<p>“May I help you with your coat, Mr. Kent?” he offered with a slight twist of his lips.</p>\n<p>From Clark’s smile, it was plain to see that he remembered the exchange from their last encounter.</p>\n<p>“Of course, thank you,” he said, grinning and turning to slide his arms into the sleeves. “Glad to see that you’re still working on those manners. I’ll be sure to report to Mr. Pennyworth next I see him.”</p>\n<p>“Much appreciated,” Bruce said. “No one holds a grudge like the British.”</p>\n<p>Bruce put his hands on Kent’s shoulders to smooth out the lines of his jacket, much like Alfred always did to him. But then he found his hands lingering there, even as the shoulders underneath the fabric grew stiff. Clark turned, and Bruce’s hands ended up right where they had been before he had moved.</p>\n<p>The jacket did nice things to Kent’s shoulders, Bruce observed distantly as his hand moved over the light fabric.</p>\n<p>“…Bruce?” Clark asked, voice slightly strained.</p>\n<p>“Hm,” Bruce said, moving his hands so that his thumb could reach the bare skin just above Clark’s collar.  </p>\n<p>There was a delightful hitch in Kent’s breath and the skin under Bruce’s thumb flushed.</p>\n<p>And for once, Bruce didn’t think, didn’t plan, didn’t meticulously examine every possible consequence.</p>\n<p>He shoved Clark up against the wall and kissed him.</p>\n<p>Their lips collided with a distinct lack of grace, but Bruce never missed once he had taken aim. Kent made a soft noise of surprise when his back collided with the wall and Bruce swallowed the sound greedily. Their stubbled skin scraped where they touched but Clark’s lips were softer than they looked, gliding warm and wet against his own, and the-</p>\n<p>Suddenly he realized his hands were closed tight around the reporter’s wrists, and that he had him pinned against the wall.</p>\n<p>He snatched back as if burned.</p>\n<p>“I apologize,” he said, still backing away, but his voice betrayed a tremble. “It wasn’t my intention to-“</p>\n<p>In the next moment, his back had slammed against the wall behind him and Kent’s lips were back on his.</p>\n<p>Bruce's mouth fell open from the shock of the impact and Clark wasn’t shy about pressing the advantage. His hands came up to clutch at the hair at the back of Bruce’s head, grabbing and angling him for better access. Instantly the kiss became deeper, filthier and wetter, and Bruce’s hands found their way inside Clark’s jacket. He grabbed his shirt and pulled him even closer. Kent <em>ground </em>against Bruce in response, and Bruce’s head was spinning, drowning, in a rush of endorphins as his body flushed with heat.</p>\n<p>They broke apart, finally, both breathing heavily.</p>\n<p>Kent’s glasses had been knocked askew at some point, and his lips were red and glistening. They quirked slightly, even as Bruce found himself unable to look away from them.</p>\n<p>Kent’s hands untangled softly from Bruce’s hair, dragged against the back of his neck as they departed. Bruce’s eyelids fluttered closed at the sensation. Then Clark was stroking across his shoulders, and then tugging gently on his arms until he held them above his head, mirroring Kent’s position from earlier. There, he gently placed his palms against Bruce’s wrists and smiled.</p>\n<p>“I didn’t mind,” Kent said, voice husky.</p>\n<p>Bruce tore his gaze from Clark’s lips and looked up into his eyes.</p>\n<p>There was only the very slightest touch against Bruce’s skin, and he could doubtlessly break free even if Clark truly attempted to hold him. He leaned his head back against the wall.</p>\n<p>“Glad to hear.”</p>\n<p>His voice came out darker and raspier than he had expected – almost dangerously close to Batman’s – and Clark’s breath stuttered and his fingers twitched around Bruce’s wrists.</p>\n<p>The faint promise of the heavier touch killed Bruce smile in an instant, and send a flush up his neck.</p>\n<p>And Clark, it seemed, never missed anything.</p>\n<p>He froze, and Bruce held perfectly still. Then, very carefully, finger by finger, Kent closed his grip on Bruce’s wrists. And squeezed. Bruce felt the beating of his heart go faster, <em>faster</em>, as the pressure steadily increased. Once Clark held him firm, it was thudding almost painfully in his chest.</p>\n<p>Outwardly, though, he showed no change. Did not break eye contact.</p>\n<p>“Is that everything you've got, Kent?” he asked, making no attempt to make his voice sound more decent.</p>\n<p>Again Clark’s hands twitched tighter, and Bruce smirked. He wasn’t usually vocal, but he certainly knew how to exploit a weakness.</p>\n<p>Before he got the chance, though, Clark’s lips were back on his.</p>\n<p>It was a different kind of kiss, this time. Where before they had met and parted rhythmically, Clark now only pressed closer, never letting Bruce up. His whole body crowded near, a leg slipping between Bruce’s, and though Bruce had gleaned some of the muscle Clark liked to pretend he didn’t have, he had underestimated its extent; the firm mass of it pressed against him and was almost as unyielding as the wall at his back. Closer and closer, until there seemed to be nothing but him.</p>\n<p>His chest, his hands, his legs, his <em>lips. </em></p>\n<p>It should not have been arousing, not with what was usually going on when he found himself pinned to walls, and yet it tore a quiet moan from his lungs.</p>\n<p>Suddenly his hands were free and his feet were no longer touching the floor. Kent’s hands were on his arse and he had wrapped Bruce’s legs around his hips.</p>\n<p>“Bedroom?” Clark breathed, seeming almost oblivious to Bruce’s weight.</p>\n<p>The abruptness of finding himself <em>carried </em>for the first time in god knows how many years almost tore him out of the haze enough to wonder what Clark meant. But then Clark’s fingers curled against the inside of his thighs, and it slammed back into him with full force.</p>\n<p>“<em>Yes,” </em>he rasped. “First door to the right.<em>” </em></p>\n<p>Clark didn’t waste any time, and Bruce found himself on his back on the bed within seconds.</p>\n<p>“Jacket off,” Bruce ordered, when Clark made a move to follow, and began working on his own clothes.</p>\n<p>Clark obliged, wrenching his arms out of the sleeves and letting the garment fall to the floor. He toed off his shoes and pulled off his glasses, and then started pulling on his tie.   </p>\n<p>Bruce’s own movements faltered halfway through his own buttons.</p>\n<p>Clark noticed, smiled, and turned to wrench both shirt and blue undershirt off in one go, without bothering with more than the topmost buttons.</p>\n<p>Even what he had felt earlier hadn’t led Bruce to expect what he saw.</p>\n<p>The large windows let through the orange light from the darkening city outside, and rays of it fell on Clark’s body. His back was unmistakably toned, muscles moving and rippling under the skin as he balled up his clothes and threw them into the corner. His waist was slimmer than the clothes hanging from his broad shoulders would lead one to believe and the build of his body was powerful and lean, the kind that was more for practical purposes than esthetic.</p>\n<p>The kind that Bruce had.</p>\n<p>Then Clark unzipped his pants and bent to pull them off. He straightened and turned, wearing only a pair of tight black boxers that did a very poor job of concealing… <em>anything. </em></p>\n<p>“Come on,” Clark said, smiling and kicking his pants underneath the bed. “You’re making me feel underdressed.”</p>\n<p>Bruce’s eyes flicked back up to Clark’s face. “Why don’t you come here and help me?”</p>\n<p>His voice wasn’t quite as dirty now as when his mouth had just been kissed raw, but it still seemed to have positive effects on Kent. His smile dropped and his eyes darkened, and then he was climbing into bed and onto Bruce’s lap. He ground down, pressing hard against Bruce’s groin. It caught Bruce unawares, and his head tipped back in a moan as his hands flitted uselessly to Clark’s hips.</p>\n<p>Then Clark was kissing along the edge of his jaw, biting down every so often, and making quick work of his shirt. When the last button was undone Clark bunched the fabric up in his hands and tugged Bruce upright by it. Bruce went willingly, angling his head to give Clark continued access to his neck. He batted Clark's hands away from the fabric and pulled the sleeves off and threw the garment off the bed.</p>\n<p>Clark leaned back from his ministrations then, put a hand to Bruce’s sternum and pushed. Bruce allowed it, falling obligingly onto his back, his arms dropping to the sides.</p>\n<p>Clark stilled, suddenly, in the middle of a movement which purpose Bruce couldn’t guess. Then the hand on his chest moved outward and down, fingers finding scars and tracing them lightly.</p>\n<p>“You’re beautiful,” Clark said.</p>\n<p>Bruce had heard it said before, but Clark sounded so sincere that it sent a thrill up his spine.</p>\n<p>“Kiss me,” he demanded.</p>\n<p>A small smile broke on Clark’s face, and his lips were still curved upwards as he did as told. The kiss was slower but just as deep as their previous, and Clark shifted his legs until one was between Bruce’s both and he was half laying on top of him.</p>\n<p>Bruce was painfully hard in his pants.</p>\n<p>Clark’s kissing did little to ease the pressure, hard and determined, but the hand that had rested almost chastely on his abdomen finally traveled lower. It stopped, though, just at the hem of Bruce’s boxers and Bruce groaned.</p>\n<p>He felt, more than heard, Clark’s chuckle.</p>\n<p>But two could play that game.</p>\n<p>“Clark,” Bruce moaned - hardly an effort - and was satisfied when Clark’s fingers twitched. “<em>Clark.” </em></p>\n<p>Clark bit down on Bruce’s neck at the same time as he rolled his hips down sharply, and vertigo had Bruce momentarily mute and gasping.</p>\n<p>“<em>Fuck, </em>Clark,” he managed, and this time he wasn’t putting on any sort of show.</p>\n<p>Still, the words dragged a stuttered moan from Clark, and he rested his forehead against Bruce’s shoulder.</p>\n<p>“You <em>voice</em>,” he said, pressing kisses against Bruce’s chest. “You could finish me off just by talking.”</p>\n<p>Bruce chuckled deep. “Good to know.”</p>\n<p>Clark half groaned, half laughed. “Tempting though it might be, I had hoped that we maybe could engage in some… other activities?”</p>\n<p>“By all means,” Bruce said, licking his lips, “don’t let me stop you.”</p>\n<p align=\"center\">~</p>\n<p>Bruce woke in a dark room with the mattress shifting beneath him.</p>\n<p>Clark was getting out of bed, taking great care to be quiet and careful during the process. Despite this, his movement caused the blanket to slide off Bruce’s shoulders and without it and the other man’s presence beside him he found himself unpleasantly cold.</p>\n<p>Still, he must have nodded off, because suddenly Clark was crouching by Bruce’s side of the bed fully clothed.</p>\n<p>“Hi,” he said, smiling softly and touching gentle fingers to Bruce’s face.</p>\n<p>“Hi,” Bruce mumbled back, gravel in his voice.</p>\n<p>“I need to leave,” Kent said.</p>\n<p>Bruce skin tingled hot under Kent’s fingers. “Okay.”</p>\n<p>“I’m sorry I woke you up. I just wanted to say goodbye.” </p>\n<p>“Hm. Goodbye.”</p>\n<p>Kent chuckled. “Not much of a morning person, are you?”</p>\n<p>“Not morning yet,” Bruce pointed out.</p>\n<p>Again Kent chuckled, then he stood and pressed a quick kiss to Bruce’s forehead. “I suppose that’s true. I really have to leave now.”</p>\n<p>Still his fingers lingered on Bruce’s skin. “So you said.”</p>\n<p>“Yeah, okay, I’m going,” Kent sounded faintly amused as his fingers finally slid off.</p>\n<p>Bruce’s skin rose in goose bumps as he watched Kent’s dark form move across the room, glance back once, and finally close the door softly behind him.</p>\n<p>It was a graceful exist, all things considered. Far more so than many that Bruce had performed, actually. Dignified, quiet, polite, and caused no unnecessary harm. Perfect etiquette, under the circumstances.</p>\n<p>And Bruce hadn’t been prepared for it in the slightest.</p>\n<p>Sleep would not return to him, and when his phone rang with the alarm from the Cave he was relieved.</p>\n<p>“Bruce Wayne speaking.”</p>\n<p>“Hi Bruce, it’s Clark.”</p>\n<p>“Clark. How are you?”</p>\n<p>“Good, thanks. I was wondering if you’d maybe like to go grab a coffee with me?”</p>\n<p>“Coffee.”</p>\n<p>“Or lunch, I could do either. Or both. Tomorrow, maybe?”</p>\n<p>“Tomorrow?”</p>\n<p>Clark chuckled. “Yes, Bruce, is this a hard-“</p>\n<p>The line suddenly went very quiet.</p>\n<p>Bruce waited.</p>\n<p>“Oh my God, I am an idiot.”</p>\n<p>“I won’t comment on that.”</p>\n<p>“It was a one-night-stand, wasn’t it?”</p>\n<p>“I thought it was rather self-evident, yes.”</p>\n<p>“Oh my God, I am <em>such </em>an- I’m sorry to have bothered you on your private line.”</p>\n<p>“It was no bother.”</p>\n<p>“I only though-… Well, you know what I thought.”</p>\n<p>“Yes, it’s quite understandable.”</p>\n<p>“No, no, not really… I-… I’m going to hang up now, Mr. Wayne.”</p>\n<p>“Okay. Take care, Clark.”</p>\n<p>“Yes. You too, Mr. Wayne.”</p>\n<p>A short, sharp beep signaled that Kent had ended the call.</p>\n<p>Kent seemed to be everywhere after that.</p>\n<p>It was like he had turned into Bruce's very own, hellish Baader-Meinhof phenomenon, popping up everywhere he looked: He was at the gala for the Metropolis rescue workers, attended the Tech Fair in Gotham, sat at the back of a press conference Bruce had to give, was present at gallery openings and premieres, and generally seemed to attend every single public event Bruce was present at. Three was no reprieve to be had.</p>\n<p>And Bruce couldn’t stop wondering.</p>\n<p>Couldn’t stop <em>thinking. </em></p>\n<p>It didn’t help that nearly all the big names in Gotham was currently enjoying an unusual coinciding stay at Arkham, which left the GCPD with enough spare resources to focus on chasing the Bat; a double hit on Bruce’s preferred method of stress relief.</p>\n<p>Thankfully there had been increased sightings of the Man of Steel of late, and Superman was proving to be the perfect distraction from Kent. It helped that was a mission that had been somewhat neglected previously, giving him all the incentive he needed to throw himself headfirst into the task and allowing it to consume him until he didn’t have to think anymore.</p>\n<p>There was only one thing missing from complete investment.</p>\n<p>Alfred lasted almost seven weeks, in near constant judgmental silence.</p>\n<p>“Are you absolutely certain that this is wise, Master Bruce?” he asked finally, one evening in the Cave, wiping his wrench clean and eyeing the surveillance feed Bruce had running in the background.</p>\n<p>Bruce bracketed his code and took a deep breath. “I know I don’t have your support in attempting to-“</p>\n<p>Alfred interrupted him with level impatience. “I question the wisdom in attracting the attention of the most powerful being on this earth, yes.”</p>\n<p>“If everything goes well, I won’t be attracting his attention.”</p>\n<p>Alfred fell quiet, long enough that Bruce swiveled back in his chair and returned to typing.</p>\n<p>“When, precisely, Master Bruce, has everything ever gone well?”</p>\n<p>Bruce’s fingers froze over the keyboard. “Alfred, would you like me to do nothing?”</p>\n<p>“You know I would, Bruce,” Alfred said.</p>\n<p>Bruce closed his eyes.</p>\n<p>“But I am also proud that you never will.”</p>\n<p>Bruce nodded, and unearthed plans about a new CPU architecture and assigned it to his Metropolis subsidiary with a few clicks of his mouse. Time to put it to the use he had intended for it.</p>\n<p align=\"center\">~</p>\n<p>Shadowing a man with the ability to fly was not easy.</p>\n<p>Especially not when the extent of his powers was unknown.</p>\n<p>The latter meant that he needed to keep Superman from even <em>suspecting </em>that he was being followed, lest he decide to put some unknown powers to use. The near impossibility of knowing the limits of the alien’s powers was also largely the reason he was here, in person, at all; there were subtleties which simply could not be caught on camera. </p>\n<p>It was not far from an exercise in futility, but Bruce was nothing if not patient.</p>\n<p>In the end, though, it was Wayne that got the opportunity, not Batman.</p>\n<p>Bruce was just stepping out of his car when the screaming began.</p>\n<p>In the next moment the ground shivered as an explosion shook the air, and Bruce ducked and threw up an arm. When he came up he saw that it had been unnecessary – smoke whirled and twisted up two streets to the southwest, and the debris had been caught in the narrow corridors between the skyscrapers. Still, there was a persistent ringing in his ears that he knew he wouldn’t be rid of within the hour.</p>\n<p>People were staggering away from the mayhem, spewing forth crying and screaming, clutching purses and children and each other. No one had any attention to spare when he slunk into a shadowed alleyway and started moving in the opposite direction.</p>\n<p>There wasn’t time to get a suit, or even to find a place to change; Superman would have to deal with this.</p>\n<p>And Bruce would watch.</p>\n<p>He moved quickly through the darkened alley, crouching low and listening carefully for any noise. But it was quiet now, beyond the ringing, unnaturally still. He was so concentrated on listening for any sound that when he rounded the corner he, for a moment, did not take in the sight in front of him. When he did it was enough to stop him short.</p>\n<p>The ground was littered with something which looked like gigantic cocoons, disturbingly humanoid in shape. Strands of the white material that they were made off blew gently through the air.</p>\n<p>Overhead, the massive noise from a sonic boom signaled Superman’s arrival.</p>\n<p>Whoever – whatever – that had caused the destruction had clearly moved on, but Bruce followed the red and blue streak across the sky with his eyes until it disappeared between the buildings.</p>\n<p>Further south it was.</p>\n<p>He moved quickly, stepping carefully and quietly and falling easily back into habits formed by many nights of reconnaissance. Soon the unmistakable sounds of battle broke the quiet; the high clatter of falling glass, the thuds of bodies hitting the asphalt, the cacophony of the car alarms.</p>\n<p>Then, suddenly, the crashes stopped and left only the high-pitched wailing.</p>\n<p>Bruce held perfectly still for a moment, assuring himself that it wasn’t a trick played on his senses by his still damaged ears, and then took off running. He cursed the height of the Metropolis buildings, which obstructed the view of the skies so much more than the buildings in Gotham did; Superman could have flown both himself and his enemy to the stratosphere without Bruce knowing.</p>\n<p>That his eyes were aimed high as he weaved through debris and alleys was the only reason that he saw it: the flicker of red reflected in the dark glass of a building ahead.</p>\n<p>He stopped short and crouched back into the shadows.</p>\n<p>Superman floated onto the street, at least sixty feet into the air, almost serenely. He was looking around carefully, arms drawn up slightly towards his chest, as though he expected to have to throw a punch any second.</p>\n<p>Bruce couldn’t have said what it was, but suddenly his eyes were drawn up and to the left – behind Superman’s back. There, on the perfectly vertical window, crouched some green… <em>creature, </em>overlarge eyes on the Man of Steel like he was a thing to be eaten.</p>\n<p>It could have been interesting, to see what would have happened if the thing managed a sneak attack, but it evidently took more than that to catch Superman unawares. He spun, midair, turning and staring up at the creature.</p>\n<p>It laughed, seemingly amused at having been caught. Then it spoke, taunting Superman by the look of it, but he was far away and there was still ringing in Bruce’s ears.</p>\n<p>Superman replied, but that, too, was too quiet for Bruce to catch.</p>\n<p>Then the thing jumped, with no warning, smashing into Superman, and the alien only barely managed to shoot up into the air before they both crashed into the street. He twisted midair and threw the thing of, and the ground cratered and shook.</p>\n<p>Then there was battle.</p>\n<p>It was entirely unlike the kind that Bruce was used to, and yet completely the same. The punches made the same noises, the moves looked the same. But the ground quaked with every impact, and the motions were often too fast for the eye to see. Again and again they collided, leaping and swirling through the air. </p>\n<p>\n<span>The Man of Steel was formidable in person, in a way that didn’t translate well to footage. </span>\n</p>\n<p>Bruce barely blinked.</p>\n<p>Despite the creature’s power, Superman had the advantage and was steadily pushing it back, southward, and Bruce would have to move soon if he wanted to be able to continue his observations. Movement drew the eye, though, and Bruce held still.</p>\n<p>But then, as if on cue, Superman landed a massive hit straight to the insectoid’s midsection and it was sent flying down the street. The Kryptonian shot off in pursuit of his target, and Bruce seized the opportunity and stepped onto the deserted street.</p>\n<p>Bruce had seen Superman’s speed several times, on news reports and surveillance cameras and hacked cellphones. He knew – probably better than most – what the alien was capable of.</p>\n<p>Still, it appeared that <em>knowing </em>and <em>experiencing </em>was two entirely separate things:</p>\n<p>One moment Superman was not there, and in the next he was. With no intermediate stage.</p>\n<p>“Bruce Wayne,” The Man of Steel said, his face a firm mask of grim disapproval. “What are you doing here?”</p>\n<p>A detached part of Bruce was grudgingly impressed by the sheer amount of primal terror his appearance managed to instill. He took a calculated couple of steps backward and widened his eyes.</p>\n<p>“<em>Superman!” </em>Bruce breathed. “I was just-“</p>\n<p>“Never mind,” Superman interrupted, and grabbed him by the collar.</p>\n<p>For a moment a spark of genuine alarm flitted through Bruce, and then he was wrapped up into the cage of Superman’s arm and flying through the air.</p>\n<p>He hardly had time to absorb the situation before he was put firmly down again, in a crowd of people, far away from where they had just been.</p>\n<p>“Stay here,” Superman said, with as much steel in his voice as in the grip on Bruce’s arm.</p>\n<p>Bruce flicked him a sloppy salute. “Yes, sir.”</p>\n<p>Superman looked deeply unamused. Bruce didn’t care, not as long as he was discredited.</p>\n<p>“I <em>mean</em> it,” he said, pointing a threatening finger in Bruce's face, and then flew off.</p>\n<p>Bruce watched him go.</p>\n<p>Then pulled out his cellphone to monitor the battle from a hacked security feed.</p>\n<p align=\"center\">~</p>\n<p>There was a waltz playing in the background, heavy on the piano.</p>\n<p>No one was dancing.</p>\n<p>The event was held in the grandest ballroom of the most splendid hotel Metropolis had to offer, and was in the honor of its Mayor’s sixtieth birthday. The room was the size of football field, with opulent fabrics draped from the walls and heavy chandeliers dripping from the ceiling. The live band had fourteen members and sat on a slightly raised staged in the northwest corner of the room, and beside them stood a table literally overflowing with birthday gifts. The Mayor’s booming laugh echoed across the room, along with the half-screamed travesties that he passed off as jokes. There was a discreet queue running through the room to deliver him well-wishes.</p>\n<p>It was precisely the sort of event that made Bruce despise parties, socializing, and humanity at large.</p>\n<p>Or perhaps Bruce was simply in that sort of mood.</p>\n<p>He was there to be seen – rumors of sightings of the Batman would fly across Gotham tonight – but the frivolity of it all made his very bones ache. Half the city appeared to have been invited, along with many well-to-dos from outside of it. As such, the avenue was stuffed and despite the efforts of a veritable armada of waiting staff there never appeared to be anything to eat or drink at hand.</p>\n<p>This, at least, was a useful shortcoming, as it made for a convenient excuse when the banalities of his conversation partners became unbearable and escape was necessary.  </p>\n<p>With the resolve of a man going to his death, Bruce picked up the glasses he had come for and carried them back to the conversation he had just left. He handed the spare to the woman to which it had been promised.</p>\n<p>She was nodding along, with forced politeness, to a tale the man across from her was spinning. She took the flute, barely glancing at Bruce, and downed a huge swing as soon as her gloved hand closed around the glass. She had been a candidate for... extended activities, but he felt the small amount of determination he had managed to muster fizzle away at the sight of her desperately bored grimace. </p>\n<p>He abandoned her to her misery and forced himself to choose a new target. His eyes found their way a delicate chain of gold, it’s pendant resting heavily in the generous cleavage of its wearer. He didn’t look away until a dainty hand came up to play along the hem, revealing to him that he had been caught. He looked up, then, and the woman smiled invitingly at him. He grinned in return and winked at her. They stood too far apart to converse, however, and he found himself lacking the will to make his legs move to close the distance; unable to stomach even the idea of prolonging the encounter. </p>\n<p>He turned away and drifted off to another group. He integrated himself seamlessly and soon became the center of it, trading quips and jokes and gossip. It was enough that he could pretend to be distracted – something to force his attention away.</p>\n<p>Then the man to his right said something and Bruce turned to him and there was Kent, visible across the room over the man's shoulder. Kent had a drink in his hand and stood awkwardly on the outskirt of a group of five. He had a pen in breast pocket instead of a handkerchief, and his tie was askew, and Bruce couldn’t believe that this was the man that he couldn’t seem to get out of his head.</p>\n<p>Suddenly Kent frowned, as though he heard something. He looked up and he<span> </span>swept his eyes across the room.</p>\n<p>Their gazes met, and locked. </p>\n<p>Kent froze for a fraction of a second, and then immediately looked away. Bruce couldn’t. Wouldn’t have been able to had his life depended on it.</p>\n<p>Kent had worse posture that Bruce recalled, and his charcoal suit was a bit too tight over the shoulders and too short in the sleeves. His usual style of slicked back hair seemed suddenly very unflattering, compared to the soft and loose curls that had splayed over the sheets on Bruce’s bed too long ago.</p>\n<p>Bruce managed to keep up a façade of interest in the conversation going on around him, but allowed himself to fade to the background. He repositioned subtly so that he would be able to keep his eyes on Kent without it being obvious.</p>\n<p>Kent, for the first few minutes, seemed determined to pretend that nothing had happened. He threw himself into the conversation going on around him, to the obvious confusion and slight disgruntlement of its original participants. Bruce watched as Kent pretended he didn’t notice, answered questions that weren’t directed at him, and offered unasked for anecdotes. Through sheer force of will, it seemed, he kept this up for several minutes.</p>\n<p>Finally, though, his resolve cracked.</p>\n<p>It was only for a fraction of a second, but he glanced up and their eyes met.</p>\n<p>The reporter’s reaction, this time, was more noticeable: he startled visibly, his shoulders grew stiff, and the smile he had plastered on his face fell. He seemed both unable and unwilling to keep himself from slipping from the discussion he had forced himself into. He stared fixedly at the floor instead, with a stiff grip on the glass in his hand.</p>\n<p>It was only a few seconds, this time, before his eyes darted up to Bruce’s again.</p>\n<p>Again he looked away just as quickly, but they were both now well past the point of pretending that nothing had happened: again and again Kent’s eyes found him, always looking away just as fast. </p>\n<p>Bruce, though, couldn't force his eyes to move. Each time Kent looked up, it felt like a blow to the chest. </p>\n<p>Then Kent suddenly heaved a sigh and closed his eyes. A moment later he opened them and put his glass down on a nearby table, and Bruce could read Kent’s lips when he said <em>‘would you excuse me for a moment?’</em> to his group. For a moment he thought that he had driven the reported to leave the party early, but instead of heading towards the doors Kent turned and started walking in the opposite direction.</p>\n<p>Towards Bruce.</p>\n<p> “Mr. Wayne,” Kent said, interrupting the current speaker in whatever discussion Bruce had been mindlessly partaking in. “Might I have a moment of your time?”</p>\n<p>Bruce, not unaware how conversations in the immediate vicinity suddenly got a bit more quiet and absentminded, shared a half-exasperated look of <em>press, what can you do? </em>with the man beside him, and answered. “Of course. What can I help you with?”</p>\n<p>“I am afraid your lawyers are refusing to take my calls.”</p>\n<p>“I see, and why might you be trying to reach them?”</p>\n<p>“I was at the attack at your company’s HQ in Metropolis in March, and I would like them to comment on the criminal negligence, on your part, that allowed the attack to take place.”</p>\n<p>Bruce was suitably impressed; a belligerent and not too bright reporter chasing a story he wouldn’t find was never news in these sorts of circles.</p>\n<p>And indeed, when Bruce summoned a vaguely patronizing expression and said, “Of course. Why don’t we take this somewhere private?” few – if any – still paid them any attention.</p>\n<p>Bruce led them as they weaved through the crowd, offering excuses and trading eye rolls whenever it was appropriate. Kent had pulled his trademark little notepad from somewhere, to keep his part of the charade going. He led them to a sitting room, one he had made use of at earlier points for smaller and more informal business deals – both on behalf of Wayne Enterprises and… more personal business.</p>\n<p>It was unlocked, as he knew that it tended to be during this type of event. He gestured for Kent to step through first and when they were both inside he closed it and twisted the lock.</p>\n<p>“Well handled,” Bruce remarked evenly.</p>\n<p>“I do work as a reporter,” Kent pointed out.</p>\n<p>“Fair enough,” Bruce agreed.</p>\n<p>They fell quiet, then, each on their own side of the spacious room. Bruce turned half away from Kent, to look up at the fairly ugly picture hanging over the mantel of the fake fireplace.</p>\n<p>“Look,” Kent said suddenly, “all I wanted to say was that I’m not here because of you.”</p>\n<p>“Oh?”</p>\n<p>From the corner of his eye, he saw Kent grit his teeth.</p>\n<p>\"Look, Mr. Wayne, I understand that a man such as yourself must experience more than his fair share of unwanted advances – people that don't know when it's time to back off. With that said, I am not one of them. I am <em>not</em> here for you, I haven't been <em>anywhere</em> for you; I am a reporter, and sometimes it's my job to be places where you also happen to be. I’m not some kind of stalker.”</p>\n<p>Bruce was quiet a moment, weighing the words and not taking his eyes off the picture.</p>\n<p>Then he said: \"The thought hadn't crossed my mind.”</p>\n<p>Kent dragged his hands across his face.</p>\n<p>\"Mr. Wayne, I regret that I somehow gave you the im-\"</p>\n<p>\"Clark,\" Bruce said, turning towards him, and the reporter quieted immediately. \"I am telling you: the thought hadn't crossed my mind.\"</p>\n<p>Clark met his eyes unwaveringly, but a frown slowly grew and creased his forehead. \"Then why were you watching me? What did you think I would do?\"</p>\n<p>\"Do? I can admit that I had some hopes, but that wasn't the reason I was looking.\"</p>\n<p>Clark now looked deeply unamused. \"You have made it very clear that you already got all that you were hoping for, Mr. Wayne.\"</p>\n<p>\"Have I?\"</p>\n<p>\"Yes. You have.\"</p>\n<p>\"I was under the impression that the situation was the reverse.\"</p>\n<p>\"What do you mean?\"</p>\n<p>Bruce raised an eyebrow. “What do you think I mean?”</p>\n<p>Kent looked angry, and frustrated, and confused. “The <em>sex</em>? <em>You </em>said it was a one-time thing.”</p>\n<p>“I might have spoken hastily.”</p>\n<p>“You said it was self-evident.”</p>\n<p>“It tends to be, yes, when one party steals away in the dead of night.”</p>\n<p>Clark opened his mouth to retort, but then snapped it shut with a look of bewilderment.</p>\n<p>Bruce turned away again, angry at himself for the words he let slip.</p>\n<p>“I- <em>what?” </em>Clark said, shaking his head. “Is <em>that</em> what you think I did? Bruce<em>. </em>There was an attack on the city, I had to go to <em>work.” </em></p>\n<p>A sharp jab twisted in Bruce’s gut. He did remember. The alarms had gone off on his phone only minutes after Clark had left. He hadn’t drawn the connection because he had been… distracted. Focused on pushing the encounter from his mind.</p>\n<p>Lingering insult mixed with realization, mixed with… hope, of a kind that he hadn’t thought himself capable of, still.</p>\n<p> “I see,” he said, and let nothing of what he felt show on his face.</p>\n<p>Clark was frowning. “Wait. What… what <em>did </em>you want?”</p>\n<p>Bruce’s brow furrowed and he turned back to Clark, unable to extrapolate any clear meaning from the sentence. “I’m sorry?”</p>\n<p>“Did you actually- were you-“ Kent shook his head. “I-… last time. During the interview. You said something about owing me a favor if I didn’t publish, and I thought… Well. It was only afterward that I realized that you kissed me right after I brought it up.”</p>\n<p>Bruce snapped his mouth shut, the meaning of it all suddenly <em>abundantly </em>clear. “I see. You thought that I-“</p>\n<p>“Not to start with,” Kent interrupted firmly. “I wouldn’t have- with you, if I thought that then. It was only later. I was trying to understand why you would… when you clearly weren’t interested.”</p>\n<p>“Clearly?”</p>\n<p>Kent laughed humorlessly. “I would say so yes.”</p>\n<p>Bruce stared at Clark, who looked dejected and yet somehow seemed to stand taller here than what he had done at the party outside.</p>\n<p>Bruce had, quite possibly, gone insane.</p>\n<p>“I see. And if I were to make it clear to you that I am interested?”</p>\n<p>Clark looked skeptical. “Are you?”</p>\n<p>“Making it clear?</p>\n<p>“Interested.”</p>\n<p>Bruce didn’t feel nearly enough hesitation for what he knew, cognitively, was a momentous decision.</p>\n<p>“Yes. I am. Very.”</p>\n<p>The silence spread like a blanket across the room.</p>\n<p>Clark stared at him, looking as though he was certain that something was wrong but couldn’t figure out what.</p>\n<p>Bruce, on the other hand, felt oddly like someone had switched him off; empty, except for the heavy arrhythmic thrashing of his heart. The beat of it seemed to echo through his head.</p>\n<p>“I can’t say that you sound very convincing,” Clark said.</p>\n<p>“Force of habit,” Bruce said, with perfectly honesty.</p>\n<p>“I see,” Clark replied.</p>\n<p>Clark stared at him, and then suddenly turned away. He plucked his glasses off his face and rubbed a hand across his eyes.</p>\n<p>“Well. What did you have in mind then?” he asked, putting the glasses back on and squinting at Bruce as though he knew that the very question was a grave mistake.</p>\n<p>“In mind?” Bruce inquired.</p>\n<p>“You make it clear that you are interested, and now what? What happens?”</p>\n<p>Bruce felt heat on his face; the words that laid him bare so clinical and devoid of emotion.</p>\n<p>“Ideally, you would reciprocate,” Bruce said.</p>\n<p>Clark’s eyebrows crept upwards. Then he scoffed. “Yeah, right.”</p>\n<p>Bruce closed his mouth and reflected that it was strange that he had taken numerous physical blows which had seemed to cause less harm than two monosyllabic words. The insight that this reflected the grave danger he had placed himself in would come later. Too late.</p>\n<p>“I see. You must forgive my forwardness.”</p>\n<p>Clark blinked. Frowned.</p>\n<p>“<em>Your… </em>forwardness?”</p>\n<p>“Of course,” Bruce said and turned towards the door. “A miscalculation I’m-“</p>\n<p>Kent was suddenly across the room and gripping his arm, spinning him around.</p>\n<p>“I meant that it was <em>obvious</em>, not absurd.” Kent said. “That I’m interested. Of course I’m interested.”</p>\n<p>“In what?” Bruce asked. “In how much?”</p>\n<p>“In as much as you’ll give,” Clark replied, with bravery that Bruce envied.</p>\n<p>“My life is complicated,” Bruce warned.</p>\n<p>For some reason, this made Clark laugh. “I think I’ll be able to manage.”</p>\n<p>His smile was wide and open and honest, and Bruce kissed it. Again and again, until the smile waned and was replaced by small moans. Then he tore away, if only an inch.</p>\n<p>“What are we now, then?” Kent asked, breathily.</p>\n<p>“We’ll see,” Bruce said against his lips. “We’ll see.”</p>\n<p>The initial navigation of whatever they were was not entirely uncomplicated.</p>\n<p>They kept it, through wordless agreement, secret and usually only met at either of their homes.</p>\n<p>In the beginning, Kent seemed to reset between every time they saw each other, and then slowly faded from bumbling incompetence, to sharp reporter, and finally to something that Bruce was suspecting was the man himself.</p>\n<p>Bruce, on the other hand, spent the time apart reminding himself that it was idiotic, short-sighted, and selfish of him to involve Kent in his life. And yet, every time they met and Bruce attempted to do something to deliberately put Clark off him… he found his words catching, his body betraying him, and Clark luring genuine responses from underneath his façade.</p>\n<p>They had sex a lot.</p>\n<p>It was the ice-breaker of their relationship. Naked and panting they would fall back from each other and onto the bed of choice – usually Bruce’s – and unfailingly begin to talk. About themselves, about the world, about their jobs; Clark Kent, Bruce was finding, was an excellent conversationalist.</p>\n<p>They fell into a routine, more domestic than anything Bruce had come to expect from life.</p>\n<p>More enjoyable.</p>\n<p>Alfred and Clark got on spectacularly. Bruce and Clark both found days where they didn’t have to work from the office. Though his work often kept him late, Clark soon spent more nights at the manor than away from it. Even Batman slotted in relatively well. There were nights Bruce had to create excuses, but faced with this new motivation he had found himself becoming ruthlessly efficient and returned earlier than he ever had.</p>\n<p>It took months for the first problems to truly appear.</p>\n<p>And then it quickly became a pattern.</p>\n<p>“Would you like to talk about it?” Clark asked, fingertips still playing gently at the purple edges of a bruise.</p>\n<p>Bruce looked at Clark, who would not meet his eyes.</p>\n<p>Bruce knew Clark – better than he had expected to know anyone new at this stage of his life – and he knew that, though Clark normally didn’t have a problem with tackling an issue head on, for some reason he never pushed on this.</p>\n<p>Never forced him to share his secrets.</p>\n<p>So Bruce said: “No, I don’t, Clark,” and watched the flicker of disappointment in Clark’s eyes.</p>\n<p>It was the rift that he had known would always come; the first and final wedge between them. They had never been built to last, and Bruce had known it from the start. It was the reason he had given himself leave to begin something in the first place.</p>\n<p>Clark interrupted his thoughts, voice cheery if somewhat strained. “Okay, then. Want to hear who Lois managed to piss off today?”</p>\n<p>And Bruce forgot what he knew, had always known. </p>\n<p>Again and again, he forgot.</p>\n<p>Bruce took a bat to the chest a Wednesday night in February.</p>\n<p>It wasn’t even from someone special; it was just some punk who had a lot of friends and scored a lucky hit while Bruce was otherwise occupied. They guy had one hell of a swing, though, and Bruce’s rib cracked.</p>\n<p>It had meant he couldn’t go home, not to Clark; the injury was too severe and would be discovered immediately.</p>\n<p>He had called home and told Clark that he had to go to Chicago on business.</p>\n<p>Of course, with his renown, this meant that he actually <em>had </em>to go to Chicago on business, to make sure that the media wouldn’t expose him.</p>\n<p>He ended up staying almost a whole week while he healed, and found some credible Wayne business to attend to while he did. On day six, though, he began to notice paparazzi skulking about. It wasn’t to a degree that would have normally worried him, but he was explicitly away from home to avoid attention; he had to go back, or risk accidental exposure.</p>\n<p>He arrived at the Manor late, later than had been planned. Him and Clark had been supposed to have dinner together, but he had been snared by some WE executives on the tarmac of the Gotham airport. He’d allowed them to keep him, wary of seeing Clark. Wary of what Clark would see.</p>\n<p>But the wariness made him angry and irritable, and finally he hadn’t been able to take it anymore; he had walked out.</p>\n<p>Now he walked the blackened halls of the manor and wondered if he perhaps should have endured longer, postponed the inevitable further. And yet, something flared within him when he stepped through the door to the bedroom, where a light still stood on and Clark lay sleeping naked on his bed with his broad back uncovered. A tension that Bruce hadn’t been aware off eased from his shoulders.</p>\n<p>As he walked over to the bed, Clark’s eyes fluttered open.</p>\n<p>“Hi,” he said, smiling sleepily up at him.</p>\n<p>“Hi,” Bruce replied, carding his hand through Clark’s dark hair.</p>\n<p>“Mmh…” Clark sighed, “I was supposed to wait up for you.”</p>\n<p>“I think this is acceptable,” Bruce said.</p>\n<p>Clark snorted and buried his face in the pillow.</p>\n<p>“Sure you do,” he said into it. “Why don’t you join me?”</p>\n<p>Bruce watched him, but Clark seemed disinclined to move his face from the pillow, so Bruce undressed, save his boxers, and crept beneath the covers.</p>\n<p>“About time,” Clark sighed, and smiled at him with his eyes still closed. “Now kiss me.”</p>\n<p>“Demanding,” Bruce mumbled against his lips, but did as told.</p>\n<p>“Deprived,” Clark corrected when he pulled away.</p>\n<p>“Depraved,” Bruce retorted, forgot himself, and lay back against the pillows.</p>\n<p>Clark became fully alert in an instant.</p>\n<p>“Bruce, what the hell is that?”</p>\n<p>Bruce only barely stopped himself from pulling the sheets up to cover his torso.</p>\n<p>“It’s just a bruise.”</p>\n<p>“A bruise?” Kent asked, voice uncharacteristically flat.</p>\n<p>“Yes.”</p>\n<p>“And you have gone to a medical professional to confirm that?</p>\n<p>“I have not because that would be wasting both-“</p>\n<p>“<em>Bruce.” </em></p>\n<p>“Clark. It’s my body, and I know what I’m feeling. It’s nothing.”</p>\n<p>“It’s not <em>nothing!</em>” Clark erupted, beginning to sound properly angry. “It’s the size of my fucking head, for god’s sake! You need to have that checked out!”</p>\n<p>Bruce paused for a moment, meeting Clark’s eyes.</p>\n<p>“I will do no such thing, because one does not seek medical attention for a b-“</p>\n<p>“I<em>t’s not just a bruise</em>! I can <em>see</em> that’s not just a-!“ Clark snapped his mouth shut “I can <em>tell </em>it’s not just a bruise. I know you. This is more than just that, please, you need to have it checked.”</p>\n<p>Their eyes met, and Clark held his gaze until Bruce had to look away. “Alfred can deal with it.”</p>\n<p>For a moment Clark looked like he was about to start screaming again, then he just… <em>deflated. </em>He threw off the blanket and swung his legs over the edge of the bed. He put his elbows on his knees and his face in his hands. Bruce watched him, watched the slope of his broad shoulders, the curve of his muscled back, and said nothing.</p>\n<p>“Bruce…” Clark said, speaking into his hands, and then shook his head like he’d changed his mind.</p>\n<p>He moved his hands, dragged them up and down over his face, then one hand went to the back of his neck while the other covered his eyes.</p>\n<p>“Bruce,” he said then, putting his palms to the mattress and twisting on the bed to face him, “can you look me in the eye and tell me it’s nothing more than a bruise?”</p>\n<p>Bruce looked him in the eye, and felt that there was a more to this question than what had actually been said.</p>\n<p>“It’s nothing more than a bruise,” he lied.</p>\n<p>Clarks mouth twisted slightly, quirked upwards into something of a smile. “Okay,” he said, nodding. “Okay.”</p>\n<p>Bruce exhaled very carefully, but said nothing. Waited for Clark to take the lead in how to proceed.</p>\n<p>“Okay,” Clark said again. “Do you need to sleep, now?”</p>\n<p>“I’m fine,” Bruce said, moving back so he sat straighter against the pillows.</p>\n<p>Was Clark implying that he wanted sex? Bruce had been gone for some time; it wouldn’t be entirely out of the realm of possibility, despite the argument and the injury that had caused it. Certainly no fucking, but… perhaps oral? Shifting slightly, Bruce assessed the state of his ribs. Yes, he could probably handle giving some. An apology and a distraction wrapped as one; it would be appropriate.</p>\n<p>He was just stretching out his arm to pull Clark into a kiss, when Clark said: “I think I need to leave.”</p>\n<p>Bruce's hand dropped to the sheets and he started at Clark. “What.”</p>\n<p>“I have to go.”</p>\n<p>Some essential circuitry seemed to have shorted within him; he couldn’t seem to understand what Clark was saying, nothing in his body willing or able to parse the meaning of his words. Instead he kept staring, kept perfectly quiet and still.</p>\n<p>Clark, as ever, took mercy on him. “This isn’t working. Bruce. I know you can tell. I know this isn’t a good time, and I’m sorry, but I… can’t.”</p>\n<p>Bruce could only stare, for a very long while.</p>\n<p>Finally, he managed to rasp: “Can’t what?”</p>\n<p>Clark closed his eyes and let out a heavy exhale. “Stay. We should… stop, Bruce.”  </p>\n<p> “Stop.”</p>\n<p>“Seeing each other. Our relationship,” Clark said. “We want different things. And I’m afraid I can’t… compromise, not on that.”</p>\n<p>Bruce's eyes tracked Clark as he suddenly stood.</p>\n<p>“I’m not…” Clark said, then frowned and seemed to hesitate.</p>\n<p>He shook his head, and appeared to be stalling when he went over to the drawers where he kept his clothes and plucked up the pants draped over it.</p>\n<p>Bruce watched him get dressed, in the jeans and one of his ugly flannels. Clark wore the frown all the while as he slowly slotted each button into its hole, but when he finally was done he seemed to have figured out what he wanted to say:</p>\n<p>“I can’t change who you are, Bruce. And I wouldn’t want to, even if I could. But I can’t change wh-“ his voice suddenly broke and faltered, and he moved his hand to his face, pressing thumb and forefinger into his eyes.</p>\n<p>He stayed like that a few moments, but when he removed his hand he met Bruce’s eye and his voice was steady. “I <em>can’t </em>change who I am either. I can’t. You can keep your secrets – God knows I have my own – but it isn’t fair, to either of us, to pretend that we want the same thing anymore. I think we’ve both known that I’ve always wanted this more than you did, and I could live with that, but… this is too big. I need someone who I can share my secrets with, who will share their secrets with me. And I think-… I had hoped it would be you, but I don’t think it will be. And that’s okay. I can… <em>understand</em> that, needing to keep secrets from people you lo-. From people in your life, and I’m sure you have your reasons. But <em>I</em> need something different.”</p>\n<p>Bruce stared.</p>\n<p>“It was good, while it lasted,” Clark said, “You made <em>me</em> happy, at least. So… thank you, for that.”</p>\n<p>“<em>Thank </em>you?”</p>\n<p>Clark just smiled again. \"Yes. I... guess I’d better go now. I'll tell Alfred about your injuries on the way out, so he knows.\"</p>\n<p>Clark nodded his goodbye, and then walked softly over to the door, pulling it gently closed after himself.</p>\n<p>\"Clark,\" Bruce protested, staring unseeingly at the closed door.</p>\n<p>His brain was at a standstill. Thoughts blocked and interrupted each other.</p>\n<p>And Clark had left.</p>\n<p>And he had always thought he would be able to manage, but he found that he <em>wasn’t. </em></p>\n<p>\"Clark!\" he called, and suddenly Bruce was in the hallway, without recollection of how he got there. \"Clark, <em>wait</em>!\"</p>\n<p>Clark, mercifully, did.</p>\n<p>He had only gotten about twenty paces down the hallway, and he turned and looked, very patiently, at Bruce.</p>\n<p>Bruce stared back.</p>\n<p>\"Just-... Just wait. I'll tell you.\"</p>\n<p>Clark looked at him, careful and wary hopefulness blooming seemingly despite himself. \"You don't have to, Bruce. That wasn’t the point.\"</p>\n<p>\"I know,\" he answered immediately, \"I know, but-\"</p>\n<p>He clamped his teeth down on deceivingly small words, and the enormity of it all seemed so impossible that he found he had to rest his palm against the wall for support. He refused to break eye contact with Clark, though, as if he could make him stay through sheer force of will. \"Will you stay so I can show you?\"</p>\n<p>Clark hesitated.</p>\n<p>Bruce only barely restrained himself from begging.</p>\n<p>Then Clark said: \"Yes. If you’re sure, of course. I'll stay.\"</p>\n<p>Bruce closed his eyes, nodded. “Okay. Would you get me my robe from the bathroom, please?”</p>\n<p>Kent nodded and walked carefully around him and back into their bedroom.</p>\n<p>Bruce’s ribs throbbed but he resisted the temptation to slump against the wall while he was alone. That was fortunate, because Clark was back quicker than he had expected. He held the robe open for Bruce, and helped him put in on. Perhaps Bruce would have smiled at that – at the ever perfect gentleman that was Clark Kent – but not in a moment where he thought he would lose him. Never then.</p>\n<p>He tied the robe about his waist and gestured for Clark to follow him.</p>\n<p>They walked slowly through the dark hallways. They had to, since Bruce ribs hurt so much that his head was pounding and Clark didn’t know the way. Perhaps it was also possible that Bruce was delaying slightly, hoping irrationally that Clark would change his mind or that Alfred would appear around the next corner and stop them.</p>\n<p>They were uninterrupted all the way to the study, however, and Bruce approached the old and broken grandfather clock.</p>\n<p>He couldn’t bring himself to look at Clark as he dragged the minute hand around until the clock showed 10:47.</p>\n<p>He did, however, hear Clark’s soft intake of breath when the locking mechanism clicked and the hidden door swung softly open. He set off down the stairs without checking if Clark followed.</p>\n<p>His footsteps echoed behind Bruce all the way down the spiraling steps, though, all the way until they suddenly were through the rock and the Cave sprawled before them.</p>\n<p>“What the-…” Clark whispered and stopped.</p>\n<p>Bruce felt like he’d been kicked in the chest, but kept slowly walking down the stairs. Across the floor. Up the steps to the raised area where his computer stood. There he turned, and looked back at Clark.</p>\n<p>He still stood on the stairs, exactly where he had stopped earlier, and was staring around the Cave like he didn’t quite know whether he should continue down or go back up. Bruce tried not to take that personally. Instead he swept his eyes across the area; took in what Clark was seeing for the first time.</p>\n<p>This main area had been lit, automatically, while they descended. The hallways and stairs leading to the other rooms, however, were still dark and would remain so unless approached. Bruce found himself very grateful for this; what was visible already seemed like too much.</p>\n<p>Then he suddenly realized that it wasn’t. Wasn’t too much. Wasn’t hardly anything. The area was wide cold and bare. There lay some gadgets he had been working on a table by the wall – grappling hooks and grenades and a taser – but they were too far away for Clark to be able to see any details. The large, many-screened computer stood there behind him, but it was off and non-descript, and the windows to his display cases for the prototype suits were closed and the Batmobile was still in the garage below.</p>\n<p>It could have been anything.</p>\n<p>Gripped suddenly by the fear that he wouldn’t even get the chance to explain, he barked: “Come here.”</p>\n<p>Clark startled, and turned to him with wide eyes. And Bruce saw him hesitate.</p>\n<p>He came, though, if slowly. Bruce told himself that was what counted.</p>\n<p>“… Bruce?” Clark asked when he reached him.</p>\n<p>“Sit,” Bruce said, gesturing to the chair in front of the giant screen that he normally occupied.</p>\n<p>Clark did sit, grasping falteringly for the armrest when the chair almost swiveled away from him. Bruce lowered himself carefully onto the edge of the table. He wondered what Clark thought was happening, thought he was seeing. He was a reporter, after all; he had to have had some sort of hypothesis.</p>\n<p>He neglected this inquiry, though, in favor of another: “Are you okay?”</p>\n<p>This, strangely, seemed to settle Clack somewhat. He nodded and exhaled carefully. “Yes, I’m fine.”</p>\n<p>Bruce frowned and his eyes lingered on Clark for a few moments, judging the truth of the statement.</p>\n<p>Finally, he nodded back. Then he turned and shifted his leg, so that he could pull out the top drawer of his desk. He was met by the gaping eyes of Batman, and could not help but to stare into the abyss.</p>\n<p>This was it: his last chance to change his mind. His last chance to stop. The moment that could bring ruin to everything.</p>\n<p>But Clark <em>would </em>leave if he did nothing – this was certainty, not possibility.</p>\n<p><em>But for how long do I truly want to keep him?, </em>he asked himself. <em>Is he worth it?</em></p>\n<p>The answer came to him with alarming immediacy, and Bruce could only marvel at his own hopeless idiocy as his fingers closed over the leather.</p>\n<p>“Here,” he said, holding out the mask.</p>\n<p>Clark took it, staring at it with wide eyes.</p>\n<p>“Bruce…” he said again, holding it with both hands, tracing the holes for the eyes gingerly with his thumbs. “… are you… what-“</p>\n<p>Clark glanced up, but Bruce only crossed his arms over his chest and smiled a little. It was an attempt to appear non-threatening. He wasn’t sure it worked.</p>\n<p>“It’s yours, then?” Clark asked finally.</p>\n<p>“Yes,” Bruce said.</p>\n<p>A small huff of air escaped Clark then, and he hung his head. “Christ.”</p>\n<p>Still clenching the cowl in his one hand, he plucked the glasses off his face with the other and threw the spectacles rather carelessly over to the table. He buried his face in his free hand.</p>\n<p>Bruce picked the glasses up, tracing the rims with his fingers for lack of anything better to do.</p>\n<p>“You’re…?” Clark asked the floor.</p>\n<p>“Batman. Yes.”</p>\n<p>Bruce only heard Clark’s small intake of breath because everything else seemed to have gone utterly silent.</p>\n<p>“And I was wondering how I was going to tell <em>you-…” </em></p>\n<p>Clark’s voice pitched strangely, and then suddenly his shoulders began shaking.</p>\n<p>Bruce had sworn to himself that he would not apologize, never for this, but he found it hard now not to go back on that. The words seemed to stick in his throat when he would not let them out, and swallowing became difficult. “Clark-“  </p>\n<p>Then Clark leaned back in the chair, face tilted up towards the ceiling. And he was not crying, but laughing.</p>\n<p>Quietly, at first, but soon it was loud and uninhibited with a faintly manic twinge.</p>\n<p>Bruce let him, but it did not ease the worry knotted in his chest.</p>\n<p>“Clark…” he said softly when the laughter was starting to die down into giggles.</p>\n<p>“Bruce,” Clark said, grinning. “<em>Bruce.” </em></p>\n<p>Bruce watched Clark’s face carefully, tracing his features for any and all tells of his thoughts.</p>\n<p>Until he suddenly found that he couldn’t. It was neither gradual, nor sudden; it just <em>was. </em>Bruce blinked, first once, twice, then furiously. Almost frightened. It was like- when he had been reading for a very long time, and then suddenly looked out through the window at something far away. It took time for his eyes, these days, to accommodate for the sudden and abrupt change of distance.</p>\n<p><em>But not this long. </em>And his eyes hadn’t shifted even the slightest from Clark’s face. Yet he could not seem to see it properly.</p>\n<p>“Oh, it dropped then…” Clark was saying, but Bruce’s heart was still thundering with the sudden fear of blindness.</p>\n<p>Then Clark was finally coming back into focus, and Bruce couldn’t help but let out a short breath of relief.</p>\n<p>But then his brow furrowed as he studied Clark’s face. It seemed… <em>different.</em> And yet perfectly recognizable as Clark. He just looked… very odd, for some reason. As though his head no longer quite matched up with his shoulders.</p>\n<p>Bruce saw his hand come up to touch Clark’s jaw, his lips.</p>\n<p>They felt the same.</p>\n<p>“Do you… recognize me?” Clark asked, voice cracking a bit over the words.</p>\n<p>Bruce answered with a swipe of his thumb against his lips, first, as if he could erase the strange question. “Of course I do, I- fuck.”</p>\n<p>Superman caught his forearm when Bruce stumbled backwards, and Bruce attempted to snatch it back by reflex. It wasn’t effective, he knew, but he was released nevertheless.</p>\n<p>Clark’s expression crumpled and he held up his hands in surrender, stepping back towards the chair he had risen from. “I’m sorry.”</p>\n<p>“You’re-“</p>\n<p>“Yes. There’s-… a low-level telepathic field that-“</p>\n<p>“Fucking shit.” Bruce interrupted.</p>\n<p>Superman laughed, but it was oddly flat and devoid of humor. “I am sorry I had to lie to you.”</p>\n<p>Bruce stared.</p>\n<p>“I’m a fucking idiot.”</p>\n<p>“You’re not.” Clark said firmly. “It’s technology. It’s from my home planet, my species-“</p>\n<p>“Your <em>species,” </em>Bruce interrupted.</p>\n<p>He knew, of course he fucking knew, but this was different and Clark was looking more and more like Superman.</p>\n<p>“Yes,” the alien said and sighed.</p>\n<p>Bruce stared at him, in his ugly flannel and tousled hair.</p>\n<p>“How much have you lied?”</p>\n<p>Fury flashed in Clark’s eyes. “How much have <em>you </em>lied?”</p>\n<p>“Some. Not about my species.”</p>\n<p>“Oh, so you’re only human then?” Clark asked angrily.</p>\n<p>“Yes.”</p>\n<p>For a moment Superman still looked furious. Then he suddenly deflated, and his shoulders fell and he buried his face in his hands. “I’m sorry. I’m sorry. I am aware that this is a bigger deal than I like to think that it is.”</p>\n<p>Bruce said nothing.</p>\n<p>“It’s true, what the press say, that I come from Krypton. I’m-…  Kryptonian. But I came here as a child, an infant, not as an adult. My parents found me, and I grew up just the way I told you. I haven’t lied about anything except what I do when I work late and my abilities. That’s it. I promise you.”</p>\n<p>Bruce found the corner of the table with his hand and used the sensory information to sit back down. He couldn’t bring himself to take his eyes off Clark.</p>\n<p>“That’s <em>it?”</em> Bruce said, in a tone of polite disbelief that Alfred would have been proud of.</p>\n<p>Superman frowned. “It’s not that different from what you have done, is it?”</p>\n<p>“Isn’t it?” Bruce asked, “With the powers you have, you could have decided to end me and I wouldn’t have been able to do anything to stop you.”</p>\n<p>Clark collapsed back into the chair and closed his eyes. “Is that what you think of me?”</p>\n<p>“Right now, I don’t know what I think of you.”</p>\n<p>Clark opened his eyes and looked at him. He was silent for a moment and then his eyes turned toward the cowl on the table.</p>\n<p>“Couldn’t you?” he asked, and it seemed to be a genuine question, though Bruce didn’t yet understand it, “If I were-… just Clark Kent. Just human. Couldn’t you have killed me just as easily?”</p>\n<p>“Yes,” he said, “I could.”</p>\n<p>Superman nodded, and silence fell.</p>\n<p>In the distance, the faint echoing hum of the air-conditioning whirred.</p>\n<p>“You have no special abilities?” Clark finally asked.</p>\n<p>“No,” Bruce replied. “Only training and an inordinate amount of money.”</p>\n<p>Clark opened his mouth as if to reply, but then shut it again. Shook his head. “It’s… one of the downsides of invulnerability. It doesn’t help anyone but me.”</p>\n<p>Bruce’s ribs twinged and for a moment the unpleasant image of the same wound on Clark flashed before his eyes. “I can see what you mean.”</p>\n<p>Clark looked up sharply, and his brows drew together in a frown.</p>\n<p>“I have x-ray vision,” he said. “That’s why I wouldn’t stop bothering you about it. You are aware that two of your ribs are cracked?”</p>\n<p>Bruce nodded. “It happened a week ago. That’s why I was in Chicago.”</p>\n<p>Clark scoffed but looked hurt. “I figured.”</p>\n<p>Bruce watched him, and thought of everything that he wanted to say. The obvious, empty, excuses.</p>\n<p>“You know why I did it,” he said finally. “The same reason you don’t fly to work every morning.”</p>\n<p>“I do,” Clark said, somewhat nonsensically.</p>\n<p>Bruce frowned.</p>\n<p>“I do fly to work every morning,” Clark clarified. “It’s how I have managed the commute.”</p>\n<p>Bruce stared.</p>\n<p>Clark shrugged.</p>\n<p>Then suddenly a laugh slipped past Bruce’s lips. Clark’s eyes went wide, and Bruce clapped a hand over his mouth, but he couldn’t stop.</p>\n<p>“You do realize-“ he was interrupted by his own mirth, “the absurdity of your own statement?”</p>\n<p>Clark, who had previously looked rather worried, broke down into quiet chuckles.</p>\n<p>“You’ve <em>flown?” </em>Bruce asked, still unable to stop his laughter.</p>\n<p>“Every day,” Clark affirmed, tears in his eyes. “Sometimes several times. The train’s always late.”</p>\n<p>The thought of it set Bruce off further, and when he spoke he could hardly get the words out. “Did you- in your <em>suit?” </em></p>\n<p>Clark shook his head, temporarily muted by laughter, but then managed: “I have my costume underneath it. Change before I go and when I get there.”</p>\n<p>Clark had always insisted on biking into town to get the train, saying that he enjoyed the exercise. He’d always blamed his windswept hair on the ride back.</p>\n<p>Bruce thought of all the deception involved, the premeditation, and his laughter died out.</p>\n<p>Clark seemed to have been struck by a similar thought, because he was no longer smiling either.</p>\n<p>“Did you know?” Bruce had to ask.</p>\n<p>“Know what?” Clark wondered.</p>\n<p>“Who I am. About Batman.”</p>\n<p>Clark frowned.</p>\n<p>“We have met,” Bruce said. “And you just told me that you have x-ray vision.”</p>\n<p>Clark shook his head. “No. <em>No. </em>I wouldn’t do something like that.”</p>\n<p>Bruce stared at him for a moment, and then conceded: “No, you wouldn’t.”</p>\n<p>Clark shook his head, as if to emphasize how little such an action aligned with his values, but leaned back in his chair.</p>\n<p>“It’s all a coincidence, then?” Bruce asked.</p>\n<p>“What is?”</p>\n<p>“That you decided to interview me. That you found out about the money.”</p>\n<p>Clark nodded.</p>\n<p>\"I have... something like this,” he gestured to the room at large, “In the arctic. It has technology from my home planet. That's how I uncovered the money trails.\"</p>\n<p>\"Why did you start looking in the first place?”</p>\n<p>“You met with Luthor,” Clark replied. “I’d known of you before, of course, but you’d never seemed very… relevant. But then you announced your plans to open the subsidiary and met with Luthor, and immediately after there was an uptick LexCorp activity. I thought it was worth investigating whether you were involved. When I found indications that you had hidden large sums of money, I became invested. My computer is more advanced than any from earth, I don’t think you have to worry about anyone else figuring it out so quickly.”</p>\n<p>Bruce raised his eyebrows. “<em>Superman </em>was interested in me?”</p>\n<p>“Yes,” Clark said, nodding. His gaze fell to the floor. “And then, after what I found… Clark was. I was.”</p>\n<p>Bruce felt like his insides were being compressed, crushed slowly by the pressure of something inevitable. “Was?”</p>\n<p>Clark looked up and met his eyes, but said nothing.</p>\n<p>Bruce looked away.</p>\n<p>“I’d been following you,” he said to the darkness.</p>\n<p>“Following me?” Clark asked, sounding both confused and wary.</p>\n<p>“Superman,” Bruce clarified. “As Batman. I felt that I needed to know more, that you might be a threat to the planet.” Bruce turned back to Clark. “You hadn’t noticed?”</p>\n<p>Clark shook his head. “Nothing except the time I found you.”</p>\n<p>Bruce smiled slightly. “Alfred would be pleased.”</p>\n<p>Clark frowned. “He knows about you?”</p>\n<p>Bruce nodded, wondering how Clark would feel about that treachery.</p>\n<p>“Who else?” Clark asked.</p>\n<p>Bruce shook his head. Shrugged. “You.”</p>\n<p>Clark frowned as though he didn’t quite understand what the word meant. Then his mouth fell open, and he shook his head. “<em>What</em>? If it’s that secret, why would you tell me?”</p>\n<p>Bruce raised his eyebrows. “You were leaving.”</p>\n<p>Clark’s mouth closed with a snap.</p>\n<p>They watched each other for a long moment, before Clark said: “I didn’t mean to pressure you.”</p>\n<p>“I know,” Bruce replied. “I decided you were worth it.”</p>\n<p>Clark leaned back in the chair, looking vaguely like someone had punched him in the face. Except, of course, Superman could probably take just about any punch to the face without even flinching.</p>\n<p>“Were<em>,” </em>Clark finally said.</p>\n<p>Bruce said nothing.</p>\n<p>Clark looked away.</p>\n<p>“My mother,” Clark finally said, “My mother knows about me. No one else.”</p>\n<p>“Except me,” Bruce said.</p>\n<p>“Except you,” Clark agreed.</p>\n<p>Then he laughed mirthlessly and said, half to himself: “She was so excited to meet you.”</p>\n<p>They fell silent again, the soft noises of the night enveloping them. Bruce wondered how much more Clark could hear, what Bruce’s own body betrayed.</p>\n<p>“Bruce, what do we do now?” Clark suddenly asked.</p>\n<p>Bruce looked up from the floor and met his eyes. They were very blue.</p>\n<p>For as long as he could remember, there had always been a particular type of bravery that Bruce had lacked. It had made him avoid situations such as this; situations that could <em>bring </em>him to situations such as this. And yet here he was.</p>\n<p>He swallowed, mouth dry, and gripped the edge of the table harder.</p>\n<p>“Bruce…?”</p>\n<p>Bruce addressed the floor. “I know what you think I felt about you. Or, perhaps better put, what you think I didn’t feel.”</p>\n<p>He glanced up, and received a tight nod from Clark.  </p>\n<p>“I am aware why. I am aware that there are… deficits, in how I treated you. Some were deliberate. Others were… how I am. But you were wrong, when you said I didn’t care as much about you as you did about me.”</p>\n<p>Clark gave a small chuckle.</p>\n<p>“Yes, I-… I kind of figured,” he gestured towards himself and the room. The cowl.</p>\n<p>“I loved you.”</p>\n<p>Clark froze, and Bruce felt as though he had just stepped off a very large precipice. He forced his face to remain neutral, forced himself to meet Clark’s eyes.</p>\n<p>He found himself saying it again: “I loved you.”</p>\n<p>Clark swallowed and blinked rapidly as his eyes grew bright. He opened his mouth to speak, but only a croak came out. He closed his mouth again.</p>\n<p>“I haven’t stopped,” Bruce said.</p>\n<p>Clarks eyes widened. “You haven’t stopped?”</p>\n<p><em>Unfortunately not, </em>Bruce thought, half-heartedly, and scrubbed a hand across his face. “It would be complicated, and dangerous, and we would increase the risk of being exposed, but… if you agree to it, I would like to keep going.”</p>\n<p>“Keep going?” Clark asked.</p>\n<p>Bruce embraced lunacy and threw caution to the wind: “Keep loving you.” </p>\n<p>Slowly, a smile spread over Clark’s face.</p>\n<p>“Okay,” he said. “Sounds good to me.”</p>\n<p> </p>"
}