{
  "id": "8694154",
  "url": "https://archiveofourown.org/works/8694154?view_full_work=true",
  "author": [
    "daretoliveforever"
  ],
  "title": "Unspoken",
  "rating": "General Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Yuri!!! on Ice (Anime)"
  ],
  "relationships": [
    "Katsuki Yuuri/Victor Nikiforov"
  ],
  "characters": [
    "Victor Nikiforov",
    "Katsuki Yuuri",
    "Katsuki Toshiya",
    "Phichit Chulanont",
    "Celestino Cialdini"
  ],
  "additional_tags": [
    "Soulmates",
    "Alternate Universe - Soulmates",
    "Muteness",
    "Mute!Yuuri",
    "Fluff",
    "Fluff and Angst"
  ],
  "language": "English",
  "series": "",
  "published": "2016-11-29",
  "completed": null,
  "words": "5,971",
  "chapters": "1/1",
  "comments": "225",
  "kudos": "13,168",
  "bookmarks": "1,884",
  "hits": "104,472",
  "summary": "<p>\n<i>“You see Yuuri, when your soulmate says something about you, like a compliment or a special message, their words will appear on your skin.\"</i>\n</p>\n<p> </p>\n<p> </p>\n<p>Soulmate AU where Yuuri is mute and soulmate marks are dependent of spoken words.</p>\n<p><a href=\"https://ficbook.net/readfic/5101353\" rel=\"nofollow\">Russian translation</a> thanks to <a href=\"https://archiveofourown.org/users/oliviaskott/\" rel=\"nofollow\">oliviaskott</a>!<br><a href=\"http://jiushiguanglidedao.lofter.com/post/43e1ca_f005de7\" rel=\"nofollow\">Chinese translation</a> thanks to <a href=\"http://jiushiguanglidedao.lofter.com/\" rel=\"nofollow\">Alexindream</a>!</p>",
  "notes": "<p><b>DISCLAIMER:</b> I pretty much know nothing about mutism. So this story is basically just that. Totally fiction. No scientific backing whatsoever. Just something I wanted to write.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>It's still the 29th here so..... HAPPY 24TH BIRTHDAY YUURI!!!! *throws confetti*</p>\n<p>Anyway, I hope you enjoyed this ridiculous soulmate au. Thanks so much for reading!!!!</p>",
  "text": "<p>Yuuri Katsuki has never been able to speak.</p>\n<p>For as long as Yuuri has been alive, his voice has never been able to utter a word.</p>\n<p>He didn’t really understand the logistics of it; all he knew was that he had some neurological problem within his brain that hampered his ability to form words. Other than that one minor detail, Yuuri was completely healthy.</p>\n<p>It wasn’t an issue for Yuuri. He didn’t see any issues with his inability to speak. He was still able to do everything everyone else was able to do, apart from this one tiny flaw.</p>\n<p>At first, Yuuri was urged to take speech therapy to try and help his speech problem. It didn’t really work. The doctors hoped that if he urged his vocal cords to produce sound, his brain would slowly correct its error.</p>\n<p>It did not.</p>\n<p>Yuuri was only able to make garbled sounds, nothing resembling words.</p>\n<p>So he stopped doing the therapy. It was strenuous and Yuuri hated it.</p>\n<p>His parents understood Yuuri’s frustration. They would have loved to have heard their baby boy speak, but they loved him too much to force him to do something he didn’t want. Yuuri was 9 when he stopped attending speech therapy,</p>\n<p>Then the doctors came.</p>\n<p>They believed they had a procedure that would fix the neurological error in Yuuri’s brain that would enable him to speak.</p>\n<p>It meant surgery. Then more therapy.</p>\n<p>Yuuri declined the offer.</p>\n<p>At the age of 10, Yuuri didn’t understand the purpose of speaking. He heard voice all around him, yet people were never able to truly express what they wanted.</p>\n<p>\n<em>What’s the point of speaking to say nothing at all?</em>\n</p>\n<p>Besides, Yuuri had found his way of communicating.</p>\n<p>Yuuri had found that he was able to express himself better than words ever would through figure skating. His ballet teacher had always told Yuuri <em>art</em> <em>doesn’t need words to tell a story</em>. She was right. Yuuri could tell anyone that he was angry or sad, lonely or happy, all through his movements across the ice.</p>\n<p>Figure skating allowed Yuuri to say what he wanted without words.</p>\n<p>However, figure skating only solved one of the two problems brought about by Yuuri’s inability to speak.</p>\n<p>The second problem was that of his soulmate.</p>\n<p>When Yuuri was 7, he was helping his father put groceries away in the kitchen when he noticed a dark smudge begin to form on his arm.</p>\n<p>It confused Yuuri as to how the smudge got there. He hadn’t bumped into anything so it couldn’t have been a bruise. As Yuuri looked at the smudge, he realized that it was slowly getting bigger and taking the shape of strange characters.</p>\n<p>Toddling over to his father, he tugged on his father sleeve to gain his attention.</p>\n<p>“What is it Yuuri?” His father asked looking down at his tiny son.</p>\n<p>Yuuri point to the characters forming just below his elbow.</p>\n<p>His father looked surprised at first, but then just smiled.</p>\n<p>“Oh Yuuri, that’s just your soulmate talking about you.” His father replied.</p>\n<p>Yuuri gave his father a confused look, waiting for more of an explanation.</p>\n<p>Kneeling down, Yuuri’s father took hold of his sons arm and gazed at the marks growing across Yuuri’s skin.</p>\n<p>He didn’t know what it said as it was in another language, but the characters still made him happy knowing that his son would have a soulmate to care for him regardless of his disability.</p>\n<p>“You see Yuuri, when your soulmate says something about you, like a compliment or a special message, their words will appear on your skin. I don’t know what this says, but I’m sure it’s something special. It’s your soulmate, Yuuri.” His father grinned.</p>\n<p>Yuuri continued to look at his father with a look of amazement.</p>\n<p>His father began to look sad. Yuuri didn’t know why his father would look sad.</p>\n<p>“I don’t really know how to explain it Yuuri, as most experts don’t even understand it. However, it would seem the only way for soulmate messages to appear on their other half’s skin is if it’s actually spoken aloud. I’m sorry to tell you this Yuuri; your soulmate may never see any messages from you.”</p>\n<p>The words his father said explained to Yuuri the sad truth that people had been trying to tell him for years. He always knew about soulmates. But, he didn’t realize that some people pushed Yuuri to speak just so he could say things for his soulmate to find.</p>\n<p>After the first time Yuuri found the strange characters decorating his arm, he tried hard to speak. He worked harder than ever in his speech therapy. He didn’t want his soulmate to go without soulmate messages, but as months passed with zero progress, Yuuri began to become discouraged.</p>\n<p>At 9 when he decided to end speech therapy, Yuuri felt bittersweet. He was happy to end the tiresome therapy sessions. Yet he was sad that he wouldn’t be able to say words for his soulmate to see.</p>\n<p>Instead, Yuuri made it a goal of his to find a way to communicate with his soulmate without the help of words.</p>\n<p>*</p>\n<p>Yuuri would occasionally think about his soulmate, but he tried not to as the thought itself was painful. He loved seeing the characters on his skin. They were fairly neutral phrases. Phrases such as <em>I know they will are a kind person </em>and <em>I can’t wait to meet my soulmate</em>.</p>\n<p>Only as years passed, his soulmarks became fewer and fewer. It wasn’t until Yuuri was 15 that he realized how much he was hurting his soulmate when the message <em>I wonder if I even have a soulmate</em> appeared across his ankle.</p>\n<p>It was after practice one evening when the words appeared. Yuuri was confused at first. Never had he seen a message like the one he was seeing now.</p>\n<p>The look on his face must have been one of shock or horror. His rinkmates and friends, Yuuko and Nishigori asked Yuuri if he was okay. When they saw the characters curling around Yuuri’s ankle, they assumed it was another kind message from his soulmate. They both knew that Yuuri’s soulmate was foreign and that Yuuri had been working for years to understand the language.</p>\n<p>“What does it say Yuuri?” Yuuko asked with a blissful look.</p>\n<p>Yuuri lifted his hands and shakily signed what the message read.</p>\n<p>He didn’t bother to look up at their expressions. He knew that they were surprised by Yuuko’s soft gasp and Nishigori’s whispered <em>damn</em>.</p>\n<p>Yuuri just pulled the leg of his workout sweats down below his ankle and plastered on the best smile he could.</p>\n<p><em>It’s okay. I knew this would happen.</em> Yuuri signed to hoping it would reassure them.</p>\n<p>Yuuko was hesitant, but she knew Yuuri well enough not to get into it. So instead the three teenagers turned their attention to the television that showed the Grand Prix event in Canada where Yuuri’s figure skating idol was performing.</p>\n<p>*</p>\n<p>It didn’t take Yuuri by surprise that that soulmate message was the last one Yuuri would find on his skin. He knew that his soulmate had probably given up. It had been years since Yuuri’s first mark showed. It had to be discouraging to never see a message written across your skin showing any little sign of having a soulmate out there waiting.</p>\n<p>Instead Yuuri focused on his skating. Already Yuuri was winning tournaments across the country for his expressive figure skating. He had both technical skill, and emotional components that made Yuuri’s figure skating so captivating.</p>\n<p>Yuuri began traveling to different countries to compete. He was able to excel in each competition, some better than others.</p>\n<p>Yuuri was 17 when he won gold at the Junior Grand Prix Finals and later won gold again at the Junior Worlds Championship.</p>\n<p>Soon after his win, Yuuri was offered to study in the United States and be taught by a top figure skating coach. It wasn’t a difficult discussion to make. Yuuri had been working hard to become a successful figure skater. The only challenging part was the fact that he would have to leave behind his friends, family, and his precious dog Vicchan.</p>\n<p>*</p>\n<p>When Yuuri was younger, he realized that the characters that sometimes decorated his skin were Russian letters.</p>\n<p>The strange characters motivated Yuuri to learn its language.</p>\n<p>In between figure skating and school, Yuuri would always been found studying the Russian language. He knew he couldn’t speak the language, but at least he would be able to read its writing and understand their speech.</p>\n<p>It had become a habit or Yuuri’s. As he grew older, he sought out to learn as many languages as he could. He didn’t want to be limited anymore than he already was. If he could learn languages, he would be able to understand people in various different countries.</p>\n<p>Yuuri’s interest in languages took him Detroit, Michigan to study linguistics as well as train to be a competitive figure skater.</p>\n<p>By the time Yuuri was 18, he was able to read and understand spoken Russian, English, French, Italian, and German, as well as Japanese sign language. Yet that wasn’t enough. Yuuri wanted to know more. </p>\n<p>Thankfully, Yuuri’s skating coach, Celestino, understood that Yuuri couldn’t speak and instead communicated in trembling hand signs and figure skating.</p>\n<p>Celestino soon learned that he had to watch Yuuri carefully as the skater would sometimes work himself too hard. He had found, on more than one occasion, Yuuri staying at the ice rink late, gliding across the ice in swift, sharp movements. <em>Anxiety</em>. Celestino realized Yuuri was communicating through his skating.</p>\n<p>It helped that 2 years after Yuuri came to Detroit he had found a roommate that would help look after him.</p>\n<p>Phichit was a true friend to Yuuri.</p>\n<p>He pushed Yuuri to become a great figure skater, encouraged him when he was in low spirits, and calmed him down when he came distressed. Phichit didn’t care that Yuuri couldn’t speak. He only wanted to see Yuuri be the best person that he could be.</p>\n<p>Even if that meant doing a lot of stupid things with the mindset of <em>live a little Yuuri!</em></p>\n<p>Yuuri worked hard. He had support of many friends and peers around him.</p>\n<p>By the age of 22, Yuuri was one of Japan’s top figure skater who had made it into the Grand Prix Finals.</p>\n<p>*</p>\n<p>Everything was going well for Yuuri.</p>\n<p>Or it was until the morning before he left for the Grand Prix Finals.</p>\n<p>Yuuri was awoken by the sound of his phone beeping. When he picked up his phone, he saw that it was his mother calling through Skype.</p>\n<p>He answered the video call with the best cheery smile he could manage at 4:30 in the morning.</p>\n<p>The smile drained quickly away as he took in his mother’s puff cheeks and red rimmed eyes. She had been crying.</p>\n<p>“Yuuri, I’m so sorry to call you this early but I needed to tell you something.” She started to say. “It’s about Vicchan.”</p>\n<p>Yuuri didn’t need to hear the rest. He already knew what had happened based off the sadness in his mother’s voice and the redness around her eyes.</p>\n<p>“He passed away in his sleep, Yuuri. I’m so sorry you didn’t get to see him one last time.”</p>\n<p>Yuuri didn’t know how to respond. His arms felt like lead and his vision began to blur. He didn’t know how long he sat there starring at the blurry image of his mother. He didn’t hear his door creak open or the gentle prying of his hands to release his phone.</p>\n<p>He heard noises, but none of them registered.</p>\n<p>“Yuuri?” a gentle voice asked beside him.</p>\n<p>Without thinking, Yuuri buried himself in the arms of the person beside him. A part of Yuuri knew it was Phichit, but he couldn’t think far enough to register what was happening. Instead he let himself cry into his friend’s arms, gasping little breathes the only sound able to escape Yuuri’s lips.</p>\n<p>*</p>\n<p>When Yuuri woke up some hours later, he was sweating and his eyes felt crusty. He heard Phichit snoring beside him, still holding Yuuri closely.</p>\n<p>Prying himself gently out of Phichit’s arms, Yuuri made his way to the bathroom to shower.</p>\n<p>Yuuri didn’t want to think. He didn’t want to feel. He just wanted to lie in bed and hibernate.</p>\n<p>Yet he knew that Celestino would be by soon to pick Yuuri up for the airport.</p>\n<p>Even as Yuuri felt his world crumbling, he still had obligations to uphold.</p>\n<p>And he hated it.</p>\n<p>When Yuuri finally exited the bathroom, he could hear soft speech drifting from the direction of the living room. Yuuri knew that Phichit would be briefing Celestino on that night’s events.</p>\n<p>So Yuuri did what he was an expert at.</p>\n<p>Ignore.</p>\n<p>He ignored everything. He just grabbed his packed bag and headed for the door.</p>\n<p>Celestino trailed after Yuuri as they exited the apartment complex. His coach didn’t say anything. Yuuri knew he wouldn’t. That was one of the things Yuuri liked about his coach; he knew when to leave Yuuri to his thoughts.</p>\n<p>It wasn’t until they were on the airplane, ready to depart for Russia where the Grand Prix Finals were being held, did Celestino say anything to Yuuri.</p>\n<p>“Will you be okay to skate?” He asked.</p>\n<p>Yuuri just turned his head to stare out the window as the plane raced down the track.</p>\n<p>He shrugged.</p>\n<p>*</p>\n<p>Yuuri was not in any way going to be okay to skate.</p>\n<p>It hadn’t even been 48 hours since Yuuri received the news about Vicchan.</p>\n<p>His head was in a fog as he entered into the chilly arena. It would take a miracle for Yuuri to do well.</p>\n<p>Yuuri could hear the whispers from onlookers as he and Celestino passed by. He ignored them. Yuuri tried to focus his mind on the task before him, yet his was finding it to be a struggle to focus on anything.</p>\n<p>“He looks so sad.”</p>\n<p>Yuuri heard the voice, but ignored it. He didn’t want to see who had stated the obvious. Instead, Yuuri walked away to find some other place to stretch before his performance.</p>\n<p>Time moved quickly.</p>\n<p>Sooner than Yuuri hoped, Celestino was ushering him out onto the ice for his Short Program routine.</p>\n<p>Shaking out his arms and legs, Yuuri tried one final time to calm his nerves and focus on his skating.</p>\n<p>That’s when he noticed a dark smudge had formed just under the cuff of his shirt sleeve. Pulling the fabric aside, Yuuri was surprised to see the first soulmate mark displayed on his skin in years. What shocked him even more where the words were written in English saying <em>He looks so sad.</em> He had heard that exact phrase uttered not long before and he had ignored it at the time.</p>\n<p>His soulmate was here.</p>\n<p>Yuuri looked up at his coach with a new sense of determination.</p>\n<p>Celestino was surprised to see the look, but happy to see Yuuri looking so motivated.</p>\n<p>“Good luck.” Celestino said before Yuuri turned and skated onto the ice.</p>\n<p>*</p>\n<p>It was a disaster.</p>\n<p>Even though Yuuri was able to concentrate on his performance, he still struggled through the whole thing.</p>\n<p>It wasn’t any better the following day during the Free Skate.</p>\n<p>Yuuri knew he was doing terribly. He knew he wasn’t expressing what he wanted. He wasn’t skating how he wanted. He was stiff in his movements, and fell when trying to land his jumps.</p>\n<p>It was embarrassing and shameful.</p>\n<p>Especially coming in last.</p>\n<p>He wasn’t able to enjoy the event as much as he wanted.</p>\n<p>For the first time, Yuuri was able to witness his favorite figure skater skating in front of him. Victor Nikiforov was someone Yuuri looked up to. The Russian skater had always provided Yuuri with the drive and inspiration to skate. For years, Yuuri had imitated Victor’s skating simply because he loved the way the man displayed his emotions while on the ice.</p>\n<p>For once, Yuuri was on par with his idol. He was a strong enough skater to make it to the Grand Prix Finals and skate against the person he looked up to. Yet he managed to look like a newborn fawn toddling across the ice.</p>\n<p>Yuuri just wanted to hide.</p>\n<p>Instead of dealing with interviews, Yuuri left it to Celestino to handle. He made his way to the changing rooms to take off his clingy outfit and into something more comfortable.</p>\n<p>When Yuuri took his shirt off, he noticed that the phrase on his wrist was slowly fading. Then he noticed another dark splotch of words just above his navel. This time the words were in Russian.</p>\n<p>\n<em>His step sequence is good. He has a lot of talent, but he looks distracted.</em>\n</p>\n<p>Yuuri felt his face flush as he read the message. His step sequence was the only part of Yuuri’s routine that he was proud of. It made him happy that his soulmate acknowledge that too.</p>\n<p>Footsteps began to approach the changing room. Yuuri hurried into an old worn t-shirt and comfortable sweatpants before collecting his belongings and hurrying out of the room.</p>\n<p>He was greeted by Celestino in the lobby.</p>\n<p>“Are you ready Yuuri?” his coach asked.</p>\n<p>Yuuri nodded his head. He knew that Celestino was disappointed in his performance, and that he should expect a thorough lecture on his mistakes once they got back to Detroit.</p>\n<p>For now, Yuuri just followed Celestino towards the direction of the car.</p>\n<p>He was stopped by the Japanese news reporter aggressively telling Yuuri it was too early for him to retire.</p>\n<p>Yuuri ignored the conversation, choosing to look outside at the snow drifting down instead.</p>\n<p>Then he heard the voice again.</p>\n<p>But when he turned around, all he saw was Victor Nikiforov talking to the Russian Yuri.</p>\n<p>When his idol turned to him and asked if he wanted a commemorative photo, Yuuri turned his back on the man and left.</p>\n<p>He just wanted to leave. He didn’t want to think anymore. Not now when his idol probably thought he was just another fan. Not now when he felt the guilt of not seeing Vicchan one last time creeping up on him. Not now that he had just lost horribly at the Grand Prix Finals.</p>\n<p>He just wanted to leave.</p>\n<p>*</p>\n<p>There had been times in Yuuri’s life when he thought he might actually die. One time was when he slipped on a rocky coastal ledge, tumbling down into the chilly autumn water. Another time was when he had been persuaded by Phichit to go to a party and <em>lighten up a little</em>. Yuuri had drunken one too many drinks and ended up sick in his bathroom all the following day.</p>\n<p>Only this time, Yuuri was sure his heart was going to give out on him.</p>\n<p>He was alone his hotel room, getting ready for bed when he checked the soulmark across his stomach.</p>\n<p>The mark had begun to fade and a new one began forming just below the older one. Yuuri stared at the mark, reading and rereading the words.</p>\n<p>\n<em>Commemorative photo?</em>\n</p>\n<p><em>How can this be?</em> Yuuri thought, his mind reeling and his heart racing far too quickly. <em>Victor said this exact thing to me… but he can’t…</em></p>\n<p>Yuuri was glad he was already lying in bed as his vision darkened and he passed out against his pillow.</p>\n<p>*</p>\n<p>When Yuuri woke up the following morning, he checked to see if the soulmark was still there.</p>\n<p>It wasn’t.</p>\n<p>It had long since faded as the night passed.</p>\n<p>Yuuri figured it was probably a mistake. There was no possible way that <em>the</em> Victor Nikiforov was his soulmate. Victor was too far out of Yuuri’s reach to be anything of importance.</p>\n<p>Before Yuuri was able to get too deep into his thoughts, Celestino was banging on his door telling him that they had 20 minutes until they needed to leave.</p>\n<p>So Yuuri spent the next 20 minutes ignoring what happened the night before. He showered and got dressed. Packed his belongings and wheeled his suitcase out the door.</p>\n<p>*</p>\n<p>Yuuri was tired.</p>\n<p>He was tired in many different ways.</p>\n<p>After a long talk with Celestino, Yuuri had decided to put his figure skating on hold, finish his degree and then go home while he decided what he wanted to do.</p>\n<p>So after 5 years, Yuuri was standing in the entryway of his childhood home.</p>\n<p>His family was happy to see him. They didn’t pressure him into anything. They were just glad to have their Yuuri back with them after so long.</p>\n<p>But soon Yuuri got restless.</p>\n<p>And somehow a video of him skating to one of Victor’s routines ended up on the internet.</p>\n<p>And for the second time within a 6 month period, Yuuri felt like he was going to die.</p>\n<p>Standing buck naked in his family onsen was his figure skating idol spouting nonsense about being Yuuri’s coach.</p>\n<p>All Yuuri could do was let out an embarrassing squeak and rush back inside.</p>\n<p>His intentions were to get a pad of paper and a pen so he could communicate with Victor and tell him he didn’t need him to be his coach, but an hour passed by and Yuuri had only just worked up the nerve to leave the safety of his room.</p>\n<p>A sleeping Russian skater was all he saw lying on the floor, wearing the familiar green guest robes their onsen provided.</p>\n<p>Minako-sensei was trying to reassure Yuuri that Victor was there because he believed Yuuri was worth his time to coach. That Yuuri had been an inspiration to Victor.</p>\n<p>When Victor woke, he inhaled more food then helped Yuuri lug all his belongings into the unused banquet room down the hall from Yuuri’s room.</p>\n<p>“Yuuri, are you okay with me being your coach?” Victor asked sitting down in the middle of his new room, surrounded my boxes containing his life’s possessions.</p>\n<p>Yuuri hesitated, but nodded his head. He would be okay with Victor coaching him. He didn’t actually know if it would work out, but he would try anyway. Why wouldn’t he want his idol to stay with him and be his coach?</p>\n<p>“Then why won’t you say anything?” Victor asked tilting his head against his dog that Yuuri thought looked like a larger version of Vicchan.</p>\n<p>Yuuri kind of expected that Victor wouldn’t know about his muteness. Most people didn’t. Reporters thought that he was just shy or tired after his performances which would explain why Yuuri never answered their questions himself.</p>\n<p>Pulling out the small notepad that Yuuri stored away in his pocket, he began to scribble out a response.</p>\n<p>Handing the notepad to Victor, he watched the man’s face, waiting for a reaction.</p>\n<p>\n<em>I’m mute. I cannot speak.</em>\n</p>\n<p>The message was written out in Russian.</p>\n<p>“Oh.” Victor responded his eyes wide with surprise. “I didn’t know that. I also didn’t know you knew Russian, Yuuri.”</p>\n<p>Yuuri looked down at his hands. He nodded his head.</p>\n<p>“Well, that’s okay. You just need to be able to express yourself through your skating right? You better work hard Yuuri.” Victor said with his characteristic smile.</p>\n<p>*</p>\n<p>Yuuri realized two things after Victor became his coach.</p>\n<p>One was that the older man was <em>extremely</em> clingy. Every chance he got, he would hang himself all over Yuuri. It was flustering at first, but the more it happened, the less it bothered him. He soon began to enjoy the warm weight constantly pressing against his sides or hanging off his shoulders.</p>\n<p>The second thing he realized that Victor was in fact Yuuri’s soulmate.</p>\n<p>Yuuri didn’t want to believe it at first. He was still hesitant to believe that it was Victor’s words that appeared on his stomach after the Grand Prix finals. But then the words came more frequently after Victor arrived in Yuuri’s life. Things like:</p>\n<p><em>Your skating is improving. </em>This phrase appeared frequently, sometimes across his back, other times on his hands. Victor would always remind Yuuri that he was getting better and better.</p>\n<p><em>You’re not weak, Yuuri. </em>Yuuri was struggling with himself, and Victor had spent time away from the rink to reassure Yuuri that he was a strong person and that he admired him for his strength.</p>\n<p><em>You’re perfect the way you are </em>was the phrase that made Yuuri realize that Victor was in fact his soulmate. Yuuri had shut himself away in his room after reading an article essentially calling Yuuri ‘A waste of Victor’s time’. When Victor realized what had happened, he forced his way into Yuuri’s room. Yuuri had engulfed himself in blankets, which Victor pulled into his arms.</p>\n<p>While Yuuri was cocooned within the warm blankets, Victor began to speak to Yuuri about why he had decided to coach him. He spoke in a quiet voice, reassure Yuuri that no matter what, he was perfect and didn’t need to change himself for anyone.</p>\n<p>As Victor said <em>you’re perfect the way you are</em>, Yuuri watched the phrase slowly appear on his left index finger.</p>\n<p>When Yuuri began to cry, Victor just held onto Yuuri.</p>\n<p>Yuuri had cried tears of joy and sadness. He was happy that Victor was his soulmate. Weeks of training had only increased his affection for the older man. However, Yuuri was upset because he realized that Victor was the same person that he was hurting.</p>\n<p>Victor believed he had no soulmate, and it was Yuuri’s fault.</p>\n<p>*</p>\n<p>Of course Yuuri knew that he wasn’t really at fault for causing Victor pain. He had tried to speak, yet it was physically impossible for him.</p>\n<p>After Yuuri accepted that Victor was indeed his soulmate, he decided to show Victor how much he cared for him in the only way he could.</p>\n<p>Through his skating.</p>\n<p>Yuuri couldn’t find it in him to tell Victor the truth. He didn’t want Victor to like him just because they were soulmates. He wanted Victor to genuinely fall in love with him.</p>\n<p>He didn’t even know if Victor would believe him. It wasn’t like Yuuri could offer any proof.</p>\n<p>So instead, Yuuri began to skate for Victor. He skated the best that he could; pouring in as many emotions for his coach that he could possible fit into his routines.</p>\n<p>“You’re really expressing you love now Yuuri. It’s perfect.” Victor had mused one day during practice.</p>\n<p>It made Yuuri happy. Victor was seeing his love poured into his performances.</p>\n<p>The relationship between the two skaters was slowly growing closer and closer. They were practically inseparable.</p>\n<p>Yuuri was happy.</p>\n<p>*</p>\n<p>Yuuri had made it to the Grand Prix Cup of China event. He was happy to see Phichit again. It had been a while since they had last seen each other.</p>\n<p>“Hey Yuuri, your soulmates speaking to you.” Phichit pointed out while they were changing into their skating outfits.</p>\n<p>\n<em>I’m confident Yuuri will win.</em>\n</p>\n<p>The mark was nestled on his lower back where he wouldn’t have noticed if it wasn’t for Phichit’s watchful eye.</p>\n<p>“I’ve never seen any soulmarks on you, I’m surprised.” Phichit said as he leaned in closer to inspect the mark.</p>\n<p>Yuuri felt a flush warm his cheeks.</p>\n<p>“Do you know who your soulmate is?”</p>\n<p>He had been waiting for the question. Phichit had always been nosy when it came to Yuuri’s life. Yuuri didn’t necessarily mind, but sometimes he questioned how much was safe to tell his friend.</p>\n<p>Unfortunately, Phichit had known Yuuri long enough that he could tell what Yuuri’s answer would be before any hand signs were made.</p>\n<p>“You do don’t you.” Phichit looked up with a grin.</p>\n<p>Yuuri nodded.</p>\n<p>“Who is it?”</p>\n<p>Yuuri didn’t know if he should say. He wasn’t sure if Phichit would tell anyone. But at the same time, Yuuri trusted his Thai friend.</p>\n<p><em>If I tell you, can you promise to keep it a secret?</em> Yuuri signed with hesitant hand movements.</p>\n<p>“Of course!”</p>\n<p>Yuuri took a deep breath.</p>\n<p><em>He doesn’t know yet, but</em>…Yuuri hesitated <em>but it’s Victor</em>.</p>\n<p>The noise that Phichit made was something between a bird screeching and garbling baby.</p>\n<p>“Seriously?” Phichit questioned too loudly in the otherwise quiet room.</p>\n<p>He nodded his head <em>don’t tell him please, I want him to figure it out</em> Yuuri signed quickly.</p>\n<p>Phichit nodded his head furiously.</p>\n<p>“Sure thing, Yuuri. Good luck!”</p>\n<p>*</p>\n<p>Phichit won the Cup of China with Yuuri coming in second.</p>\n<p>Before Victor and Yuuri left to go back to Japan, Phichit pulled Yuuri aside.</p>\n<p>“I’ve been thinking and I think you should tell Victor.” Phichit said with an unusually serious tone.</p>\n<p><em>Why?</em> Yuuri asked.</p>\n<p>“He’s already in love with you Yuuri, he deserves to know.” Phichit grinned, walking away before Yuuri could respond.</p>\n<p>*</p>\n<p>Yuuri and Victor were greeted with praise when they arrived back in Japan.</p>\n<p>They had a few weeks to rest and prepare for the Rostelecom Cup in Russia.</p>\n<p>The first thing they did when they arrive back home was sleep. The second was an early wake up call for Yuuri to begin practice while the feelings from the Cup of China were still fresh in his mind.</p>\n<p>The day was long and exhausting, but rewarding all the same.</p>\n<p>Yuuri was getting better and more consistent with his routine.</p>\n<p>Victor would always look at Yuuri skate with pride in his eyes.</p>\n<p>Yuuri couldn’t help but think of Phichit’s parting words while he practiced. He didn’t really know what the right choice would be.</p>\n<p>He figured it would be safe to tell Victor after the Grand Prix Finals. He didn’t want to cause any distractions. Yuuri still worried how Victor would react. So to him, waiting would be the best option.  </p>\n<p>That was the plan at least.</p>\n<p>Late that same evening, Yuuri was soaking his tired muscles in the onsen.</p>\n<p>The door slide open and Victor walked out, his body on full display as it always was.</p>\n<p>“Be sure to relax Yuuri, tomorrow will be another long day.” Victor said as he slide into the warm water.</p>\n<p>Yuuri hummed in reply.</p>\n<p>The two men were silent, enjoying each other’s company and the warm water soothing their aching muscles.</p>\n<p>“You know I’m proud of you Yuuri.” Victor whispered sweetly.</p>\n<p>Yuuri smiled gently.</p>\n<p>His eyes slipped shut; the warm water was making his drowsy.</p>\n<p>If it weren’t for Victor’s sudden shift in movement, Yuuri probably would have fallen asleep against the rocks.</p>\n<p>He cracked his eyes open to see Victor staring at him with bulging eyes.</p>\n<p>Yuuri cocked his head at Victor.</p>\n<p>Victor just pointed up to his cheek.</p>\n<p>He was confused. Yuuri looked down in the pool of water, his reflection shifting back at him.</p>\n<p>It was easy see what caused Victor’s strange reaction.</p>\n<p>Yuuri couldn’t see what it said, but he could see the telltale signs of a soulmark darkening his cheek.</p>\n<p>It only took a second for Yuuri to realize why Victor would have reacted to it.</p>\n<p>Yuuri jolted up from his seat and practically sprinted out of the bath.</p>\n<p>As he hastily put on his clothes, Yuuri caught his reflection in the mirror.</p>\n<p>\n<em>I’m proud of you, Yuuri.</em>\n</p>\n<p>The mark stretched clear across Yuuri’s left cheekbone.</p>\n<p>This wasn’t how it was supposed to happen. Victor wasn’t supposed to find out like this. Yuuri was supposed to tell him. He wasn’t supposed to find out while they were both naked!</p>\n<p>Yuuri fled to his room, ignoring the calls of concern from his mother as he ran past.</p>\n<p><em>This wasn’t supposed to happen</em>.</p>\n<p>*</p>\n<p>Victor wasn’t sure how long he had been staring at the spot Yuuri had previously occupied.</p>\n<p>The air in the onsen was cold, but the water was warm around him.</p>\n<p>His mind was racing at what he had just witnessed.</p>\n<p>He had said the thing that had been on his mind since Yuuri was presented with the silver medal. He had been watching Yuuri’s face to see the gentle smile stretch across his lips.</p>\n<p>The next thing Victor knew, the words he had just spoken traced across Yuuri’s cheekbone.</p>\n<p>Victor knew he had reacted to the sight.</p>\n<p>Then the waters shifted around him and Yuuri was gone.</p>\n<p>A part of Victor wanted to go after Yuuri immediately, but another part was frozen in shock.</p>\n<p>All his life, Victor had believed he had no soulmate. He spent years and years hoping and begging for a soulmark to appear on his skin. It never happened though.</p>\n<p>It was a fact that Victor had to deal with. He had no soulmate.</p>\n<p>Now he wasn’t so sure.</p>\n<p>One minute he had no soulmate, the next he was watching his words burn into his students skin.</p>\n<p>Somehow Victor managed to get out of the onsen and towel himself off.</p>\n<p>His head was in a daze, but his body knew what to do.</p>\n<p>Makkachin nosed at his hand as he stood in front of Yuuri’s door.</p>\n<p>Victor took a deep breath before knocking quietly at the door.</p>\n<p>No answer.</p>\n<p>He expected that. Instead of knocking again, he slide the door open slowly. He was thankful that Yuuri hadn’t locked it.</p>\n<p>“Yuuri?” Victor asked quietly.</p>\n<p>Victor could see Yuuri hidden in a cocoon of blankets. He was shaking underneath them all.</p>\n<p>Victor entered into the room and closed the door behind him. He wasn’t sure what he needed to do. He didn’t know what to say, as he was still at a loss for words himself.</p>\n<p>He sat down on Yuuri’s bed, right beside the bundle of blankets.</p>\n<p>At first he didn’t say anything; he just let the silence fill the room.</p>\n<p>“Did…” Victor began to say after what felt like hours “did you know?”</p>\n<p>His words were barely above a whisper.</p>\n<p>He could hear Yuuri shifting below the blankets, a tiny squeak piercing the silence.</p>\n<p>Victor had always loved to hear the tiny breathy sounds and squeaks that sometimes came out of Yuuri’s lips.</p>\n<p>The small noise was all Victor needed for an answer.</p>\n<p>“Why didn’t you tell me?” he asked not expecting an answer.</p>\n<p>He didn’t get one.</p>\n<p>“I don’t understand Yuuri. I always thought I didn’t have a soulmate. I guess it makes sense now. If you can’t speak, it’s no wonder why I never showed any signs of having one.”</p>\n<p>The silence stretched on. Victor could feel the twitching pile of blankets behind him.</p>\n<p>“I’d understand if you didn’t want me as a soulmate.” Victor whispered.</p>\n<p>He felt the bed jerk, the blankets falling away behind Yuuri’s body.</p>\n<p>Victor watched as Yuuri scrambled out of his nest, reaching for a discarded pen on the floor.</p>\n<p>For as long as he could remember, Victor always believed he was good at judging what a person was about to do or say. However, he was never good at figuring out Yuuri.</p>\n<p>He watched as Yuuri grabbed Victor’s arm, pushing up his sleeve.</p>\n<p>Yuuri uncapped the pen and began scribbling shaky words across Victor’s skin.</p>\n<p><em>I’m happy Victor is my soulmate</em>.</p>\n<p>Yuuri looked up at Victor, his eyes misty with unshed tears.</p>\n<p>“Yuuri.”</p>\n<p>He felt the pressure of the pen on his skin again as Yuuri wrote again.</p>\n<p>\n<em>Victor makes me happy. </em>\n</p>\n<p>\n<em>He is kind and patient with me.</em>\n</p>\n<p>\n<em>Victor is beautiful.</em>\n</p>\n<p>Yuuri hesitated. He turned Victor’s hand over and began to write on his palm.</p>\n<p><em>I’ve fallen in love with Victor</em>.</p>\n<p>Victor watched as Yuuri wrote words of endearment across his skin. His eyes began to fill with tears.</p>\n<p>Yuuri wrote more and more across Victor’s skin. The words that were never able to escape his lips. The words he always wanted his soulmate to hear.</p>\n<p>“Thank you Yuuri.” Victor replied with a watery smile. “I love you too.”</p>\n<p>Yuuri smiled softly as Victor.</p>\n<p>Victor reached around Yuuri, pulling him into a warm embrace.</p>\n<p>Victor held Yuuri tightly.</p>\n<p>His eyes catching of the phrase <em>I love you too</em> spreading across the palm of his soulmates hand.</p>"
}