{
  "id": "8770888",
  "url": "https://archiveofourown.org/works/8770888?view_full_work=true",
  "author": [
    "esama"
  ],
  "title": "Mother May I",
  "rating": "Mature",
  "archive_warnings": [
    "No Archive Warnings Apply",
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Fantastic Beasts and Where to Find Them (Movies)"
  ],
  "relationships": [
    "Newt Scamander & Barebone Children"
  ],
  "characters": [
    "Newt Scamander",
    "Mary Lou Barebone",
    "Modesty Barebone",
    "Chastity Barebone",
    "Credence Barebone",
    "Other Character Tags to Be Added",
    "Tina Goldstein",
    "Queenie Goldstein",
    "Percival Graves | Gellert Grindelwald",
    "Original Percival Graves",
    "Seraphina Picquery"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "Canonical Child Abuse",
    "Family",
    "Friendship",
    "Hurt/Comfort",
    "Family Drama",
    "Racism",
    "Racist Language",
    "Seriously Warnings for Mary Lou Barebone",
    "Legilimency",
    "Self-Harm",
    "Torture",
    "Aftermath of Torture",
    "Big Happy Suitcase Family",
    "Do not repost",
    "Don't copy to another site"
  ],
  "language": "English",
  "series": "",
  "published": "2016-12-06",
  "completed": "2016-12-15",
  "words": "42,365",
  "chapters": "11/11",
  "comments": "988",
  "kudos": "14,070",
  "bookmarks": "4,577",
  "hits": "128,804",
  "summary": "<p>In which Newt can recognize an Obscurial by sight.</p>",
  "notes": "<p>Unbetaed<br>And another warning for the Canonical Child Abuse. Mary Lou Barebone is terrible caregiver. And terrible person in general.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Gonna have to up the chapter estimate. Definitely not gonna be able to wrap this up in 5 chapters. Also, it’s probably not all that good, but the idea of Newt being a bit terrified of women amuses me. But then I get the feeling he’s a bit terrified of people in general.</p>\n<p>(Also Tina is so hard to write. Maybe I should’ve read some fanfics to get feel of her character before I started writing my own…)</p>\n<p>Warnings for self-harm</p>\n<p>Warnings for Torture and Torture aftermath. The story rating went up and I added a violence warning just for this chapter</p>\n<p>Slight warning for animal abuse and death</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>And that's it, that's the story, and it's not perfect but it is finished :)<br>Thank you everyone for reading and commenting. Hope you guys enjoyed it as much as I enjoyed writing it.</p>",
  "text": "<p>Muggles really can be remarkable builders when they get their mind to it. Well, truthfully, they get their mind to it fairly often. There hadn't been a settlement Newt had seen that hadn't featured one or two bits of remarkable engineering, containing tricky and clever little design solutions wizards and witches just don't think of. It's wondrous, sometimes, what the mind can come up with when it lacks magic.</p>\n<p>They're building their buildings bigger than anywhere else, in New York. Big and grand and bold, with dozens of floor and peaks that reach higher than any tower a wizard has managed to make. Even magic, things start to twist around after couple of dozen floors – but muggles, they managed to do it.</p>\n<p>Newt really must see the Woolworth building before he leaves.</p>\n<p>Not that he would stay long for New York, but while he was there, he might as well sightsee a bit. You never knew when you needed the general knowledge of a place, when travelling and writing and should anyone ask, it would be nice to say, \"I have see the Woolworth building indeed, sir, and yes it was quite very tall.\"</p>\n<p>Not that he thought anyone <em>would</em> ask. But it was still a nice thought.</p>\n<p>Pushing the future conversations never to be had out of his mind, Newt tightens his grip on his suitcase and pushes into the throng of muggles. There is another big old building there, very imposing. Bank, if he's ever seen one, with big staircase leading up to it and very dramatic pillars holding up the somewhat Roman-esque ceiling. Somewhat, though – Newt has seen the real deal, and this one is a little too… showy.</p>\n<p>Architecture isn't really his thing, but he'd met a dwarf very much into it – she'd explained to him the intricacy of the old human architecture, how everything was absolutely necessary, calculated so precisely that you couldn't take one part without fearing others would fall over. In comparison, this muggle made thing, it's mostly for show.</p>\n<p>It is a good show though.</p>\n<p>\"You, friend,\" a woman's voice calls suddenly and the people around him go quiet, look at him.</p>\n<p>\"Um, yes?\" Newt asks, confused and looks around. Oh, has he wandered into some sort of gathering?</p>\n<p>\"What drew you to our meeting?\" the woman asks. She has a… odd look about her face, as much as Newt knows human faces – she looks very excited but cold. Reverend but aloof? He isn't sure but it's, as far as he can tell a little bit off-putting.</p>\n<p>Not that Newt has the foot to stand on when it comes to off-putting faces.</p>\n<p>\"Excuse me?\" Newt asks, thinking he must have missed something. They probably talked about something important that he'd completely disregarded while looking at the architecture.</p>\n<p>\"Why did you come to our gathering today?\" the woman asks, a little more demanding – he definitely did miss something.</p>\n<p>\"Oh, I just – I was just passing by –\" Newt says and then finally really looks around himself, looking at the people in the steps who are conducting the – meeting?</p>\n<p>And then he stops.</p>\n<p>Oh.</p>\n<p>Oh, he <em>really</em> is distracted to have missed <em>that</em>, good Merlin he must be going blind.</p>\n<p>\"Oh, I think you came here for a reason,\" the woman says while Newt stares in gob smacked astonishment at the young man beside her. She doesn't seem to notice that his attention has shifted. \"You, sir, must be a seeker. A seeker of truth.\"</p>\n<p>\"More a chaser, really,\" Newt mumbles, staring, staring – oh he's staring, how awkward. Quickly he looks down, trying to think fast, trying to come up with something.</p>\n<p>He's surrounded by muggles, everyone is staring at him, he can't do anything suspicious, but he must do something, think of something, and quick. He fiddles with his suitcase nervously to buy himself time to think, just in time to see hint of a webbed dark hand slipping back inside, foiled by his sudden interest in the case.</p>\n<p>\"So you chase the truth,\" the woman says. \"You go after it with all your heart, sir?\"</p>\n<p>Newt swallows and looks up, his gaze avoiding her and looking at the young man instead. He's holding leaflets, printed with strict black print – some of the people in the gathering are holding them. New Salem, something, something reads on top.</p>\n<p>The young man works for her, she is conducting the meeting – she must be the leader of whatever is happening. So if he… yes, that will do, won't it?</p>\n<p>\"Yes, I suppose so,\" Newt says and then, holding his suitcase securely in front of him. \"I'm very keen on truth.\"</p>\n<p>\"Good, that's good,\" the woman says and smiles a stiff smile like she's won something. \"Then listen, my good sir, hear my words and heed my warning, because I have much to tell you.\"</p>\n<p>She then looks at the general gathering, rather than at Newt specifically, and continues the meeting with, \"Witches live among us!\" – and oh yes, she has things to tell them. Terrible things that make Newt smother the urge to grind his teeth and fiddle with his hands – he wants very much to not be hearing the poison she has to say, but oh, does it make sense.</p>\n<p>The young man beside the woman stands stiff and awkward, looking at people's feet rather than their faces and when ever a person comes close he dully offers them a leaflet. Newt watches his every move, wishing he had his notebook and quill to write it all down.</p>\n<p>It's remarkable and terrifying all at once – he has all the markers. Stiffness of back and awkwardness of motion – refusal to meet eyes or look at faces. Dullness of movement – sluggishness at the feet, like he's wading through water. His hands twitch every so often, and his fingers move ever so slow. Loss of physical dexterity, clear as day.</p>\n<p>Newt stares at his hands, holding the leaflet – there, a cut, red and sore in the young man's palm. A bit of paper is dragging against it and it must hurt worse than any paper cut could, but the young man doesn't notice.</p>\n<p>From Newt's previous observations, they stop feeling physical pain towards the end – if they don't notice they're hurt or pay attention to it, they just don't feel it. Loss of sensation – accompanied by loss of sense of taste and smell, followed by loss of hearing…</p>\n<p>And yet, the young man is in his twenties. Twenties and like <em>this</em>. He must be incredibly powerful.</p>\n<p>Newt takes a deep breath. Remarkable and terrifying – and so soon after Sudan too.</p>\n<p>The woman finishes her poisonous speech, expounding on the devilishness of magic and the evils of tricksters before handing out more leaflets to those who listened and telling them to come to the next meeting at some place Newt has never heard about. The crowd mumble and starts to disperse, few ask her a couple of questions which she answers with great, cold confidence.</p>\n<p>Newt lingers for a moment and then, while the woman is distracted by a pair of younger women who are nervously asking her about stuff like love potions, the wizard pushes forward. He does his damnest to make the movement seem casual as he walks around the women, far enough not to be pulled into the discussion, and then he's in front of the young man.</p>\n<p>Up close it's unmistakeable – and overwhelming.</p>\n<p>\"Could I have one of those by any chance?\" Newt asks.</p>\n<p>The young man with severe haircut looks up very briefly and then down again. He doesn't move his head at all when he does it and his shoulders look stiff and his neck doesn't move right – it's more than muscle cramps there, it looks like he can't fully turn his head anymore, his spine is starting to stiffen.</p>\n<p>The young man hands him a pamphlet and Newt looks down on it. \"WITCHES LIVE AMONG US\" it says and Newt makes a face at it before quickly stopping himself. On the back there was some… truly terrible text about the evils of witches and magic, similar to what the woman said – Mary Lou Barebone, says the pamphlet, the Leader of the New Salem Philanthropic Society and the Second Salem Church.</p>\n<p>Good grief, no wonder.</p>\n<p>\"Thank you,\" Newt says, and sneaks a closer look at the young man, just to make sure he isn't missing anything. But no, it's all there, clear as day and of course the feeling tearing under the young man's skin is utterly unmistakeable.</p>\n<p>Nothing feels quite like an Obscurus, about to break free.</p>\n<p>\"Sir,\" the terrible woman is at his elbow, smiling at him. \"How did you find our meeting?\"</p>\n<p>She touches him, fingers stiff and hard at his elbow as she turns him away from the young man. Newt goes with as much willingness as he can muster, lets her pull him away from the Obscurial, and looks at her as much as he can bear.</p>\n<p>She is smiling at him, and it looks terrible. Like she's won something over him, like she <em>has</em> him, and that's not a look you ever want to see on a human's face.</p>\n<p>\"It was quite – quite enlightening,\" Newt says because it certainly was at that.</p>\n<p>\"Oh, but sir, you aren't from around here are you? Are you freshly come to New York?\" she says and her eyes light up even further.</p>\n<p>\"Yes, fresh of the boat, I'm afraid,\" Newt says and he doesn't know what to do, what to say – he doesn't want her touching him, but it's an excuse to stay and certainly he can't just flounce off now, not with <em>this</em> brewing in the midst of these people… He clears his throat. \"I'm quite new to New York, to be honest.\"</p>\n<p>\"Have you a place to stay?\" she asks and looks him up and down, taking in his coat – which, Newt has been informed, is supposed to do quite well in muggle world. \"Have you had anything to eat since you landed? The Second Salem Church is not far from here – we would be happy to have you for dinner.\"</p>\n<p>We, meaning her, her children – the young man too?</p>\n<p>\"You – you live at the church?\" Newt asks, looking at the pamphlet.</p>\n<p>\"Yes, it's where people can find us when ever they have any questions,\" the woman says and smiles wider. \"And we're always happy to help those seeking the truth. Or those chasing it,\" she adds and quirks her lips, like making a joke.</p>\n<p>It falls a bit flat and Newt clears his throat. Good Merlin he's gotten himself into <em>something</em> here, but… He'd almost been burned at a stake in Sudan, so, so far it's not going that badly. \"I would like that, madam.\" he says and forces himself to look at her eyes. He can't manage it more than couple of seconds before he has to look away, but it seems to please her.</p>\n<p>\"Wonderful,\" she says and clasps her hand to the crook of his elbow. \"Come right this way then. Children,\" she says to the young man and two girls at the stairs. \"Gather up the leaflets and lets go.\"</p>\n<p> </p>\n<p>Newt twiddles with his suitcase nervously as he looks about the Second Salem Church. The creatures inside must be feeling his anxiety because even Dougal is being meek as mouse inside, and even the Niffler has stopped trying to creep out. Not that it looks like there is much shiny to steal here.</p>\n<p>Truthfully, it looks hopelessly grim and joyless, this place.</p>\n<p>\"What is your name?\" a young girl, pale with her blond hair pulled back severely, asks while offering him a cup of bitter smelling coffee.</p>\n<p>\"Oh, it's Newt – Newt Scamander. Uh, thank you,\" Newt says and licks his lips nervously, looking at the coffee. Oh, now he wishes Dougal hadn't retreated into sullen silence – the Demiguise loved coffee. \"And your name, Miss?\"</p>\n<p>\"Modesty,\" she says and points towards where the other two – the older sister and the young man – had gone. \"And then there's Chastity and Credence, they're going to make dinner.\"</p>\n<p>Credence – that has to be the Obscurial's name.</p>\n<p>\"Newt,\" Mary Lou the Leader of the Second Salemers asks with interest while coming closer. \"That is an interesting name.\"</p>\n<p>\"Short for Newton,\" Newt explains with awkward smile and leans his elbows onto his suitcase in order to fiddle with the cup instead. He should make a pretence to at least try to drink it, probably. \"Your church is,\" he starts and then can't quite manage a lie. \"It's very neat,\" he offers instead. Because it is. It's is almost obscenely tidy.</p>\n<p>\"I keep a clean house,\" Mary Lou agrees with a nod, looking around herself with clear pride. \"The neighbourhood children come and go – I have a meal for them once a day, and they can leave such a mess, but we've managed to enforce a certain level of cleanliness.\"</p>\n<p>\"That's… nice,\" Newt says rather desperately. \"That you offer them food.\"</p>\n<p>\"We've been teaching them,\" Modesty says proudly. \"About the church and witches. They make the leaflets too.\"</p>\n<p>\"Ah,\" Newt says, little at a loss at that. She says the word, witches, like it's a dirty word and she's proud to say it like that.</p>\n<p>\"Number of them cannot ever read, the poor dears, but they can still write and even draw if they have example to copy,\" Mary Lou says. \"So they do a bit of work as payment for the food for us and learn the value of it.\"</p>\n<p>Newt nods and lights the bitter smelling cup to his lips to save himself the necessity of replying. He isn't sure what to think at all.</p>\n<p>\"Well, I should check up on the food,\" Mary Lou says and looks at Modesty. \"Darling, why don't you sing Mr. Scamander your song?\"</p>\n<p>She nods and Newt looks at her – or just little past her ear, but it counts – as Mary Lou hurries off to the kitchen. \"I made it up myself,\" Modesty says and takes a breath.</p>\n<p>And Merlin's beard they've even managed to make songs terrible here.</p>\n<p> </p>\n<p>The dinner is… edible. It's obvious that these people don't have much in way of funds – the food is simple, bland and terribly cheap even to Newt's taste buds, and he's never been in possession of great deal of money himself. But it is edible.</p>\n<p>The dinner discussion sours it on his tongue though.</p>\n<p>\"How did you come to know about… about witches?\" Newt asks, and doesn't look at Mary Lou. He might look accusing if he does, so he keeps his eyes on the plate, on the piece of dry, hard bread. Somewhat ludicrously he wishes he could just whip out his wand and add a bit of taste to it.</p>\n<p>Mary Lou hums. \"It's all terribly obvious when you open your eyes. These attacks lately, they're just the tip of the iceberg,\" she says darkly. \"New York is such a shining, glorious city that people fail to see what goes about in shadows. People cursed, losing their minds and senses…\"</p>\n<p>Newt nods along as she tells him of the people she's met, the things she's seen – not just in New York, but in the people passing through. Those people coming back from the war – something terrible happened to them and they came back utterly bewitched and no one seemed to <em>see</em> it. The old world, with it's old crypts and temples and forests surely had even more witches to enchant poor innocent people.</p>\n<p>\"You mentioned attacks?\" Newt asks awkwardly.</p>\n<p>\"Oh, you have not heard?\"</p>\n<p>Newt shakes his head. \"I only arrived this noon.\"</p>\n<p>Mary Lou eyes him for a moment and then rises to her feet and heads out of the room, leaving Newt alone with her children. He takes it as chance to look them over.</p>\n<p>There is something terribly wrong with this family. Modesty with her horrible song about witches, Chastity with her stiff posture and furtive glances, and… Credence.</p>\n<p>He still hasn't spoken a word.</p>\n<p>He just sits there, slowly and methodically eating his food, the spoon held clumsily in his obviously stiff fingers. He looks a little out of it – but at the same time, there is that pinched quality to the way he sits, stiff just so. Listening with wary keenness Newt knows well.</p>\n<p>It was how Frank looked at him, when he first approached the thunder bird in his cage. The alertness of a wounded, beaten animal in a corner he can't get out of.</p>\n<p>Credence has scars in his palms that make Newt's own palm long to grip a wand and throw some spells around and damn the consequences.</p>\n<p>But no – he'd learned his lessons. This wasn't place or moment for shows of power. This was a treacherous land and he had to thread very, very carefully here. Not for his sake, or the sake of the Secrecy… but for Credence.</p>\n<p>The Obscurus was so close to the surface that Newt could <em>taste</em> it in every breath he took, the tingle almost physical, bitter and stinging. Metal and rust and pain.</p>\n<p>\"It's good,\" Newt says awkwardly and glances at Modesty and Chastity. \"The food, it's good. Thank you.\"</p>\n<p>Chastity looks at him nervously and then glances at her younger sister. She makes a face, regretful and a tiny bit mischievous. \"It's a bit bland,\" she admits.</p>\n<p>Credence glances up at that, just a little.</p>\n<p>Newt looks between them quickly and something in his chest unclenches. It's very, very slight, but they all three of them have relaxed just a bit, with Mary Lou no longer in the room. It isn't just Credence – they all have felt it, they all know.</p>\n<p>Newt hesitates. \"I, uh. I ate snake once,\" he said. \"I was in Africa, year or so ago, and got a little… shall we say lost, for a couple of days. Didn't think to bring much food with me, wasn't meant to get lost you see, so I had to do with what I found. Snake is… let's say this is much better than raw snake.\"</p>\n<p>They all stare at him now, their faces blank in their incomprehension.</p>\n<p>\"Ah,\" Newt says. That did come a little out of nowhere, did it? \"I'm a – zoologist,\" he says, just barely managing to swallow the <em>magi</em> from the front. \"I study various animals, preferably in their natural habitats. Africa has a lot of interesting specimens, but… they tend to be scattered all across the continent.\"</p>\n<p>The sisters share a look and Credence looks down, frowning a little.</p>\n<p>\"You've been to <em>Africa</em>?\" Modesty asks, her eyes a little wide.</p>\n<p>\"I've been… well, now that I'm here, I've been to every continent,\" Newt admits. \"Africa, Asia, Europe obviously, I <em>am</em> an Englishman. Visited Australia just four years ago, fantastic country, that. Started in South America, actually – must have been close to ten years ago now – and from there I went to Antarctica and… yes, I think that accounts for all the continents.\"</p>\n<p>He beams at the children, more because of the way Modesty leans in rather than because his own recollections. That's an expression he can recognise – curiosity. Best emotion there is, certainly.</p>\n<p>\"You've been to Antarctica?\" Modesty asks breathlessly. \"Isn't it really cold?\"</p>\n<p>\"Isn't the Arctic a continent too?\" Chastity asks with a thoughtful frown.</p>\n<p>\"Yes, Antarctica is cold, quite terribly cold, I was there during the summer, however – or rather, the winter here, which is summer there, so it wasn't quite as cold as it can be,\" Newt says, clad to have something he knows to talk about. \"And actually, the Arctic has no land mass – it's all ice, you see, so it is not an continent.\"</p>\n<p>\"But… isn't it very big?\" Chastity asks. \"I saw a globe once, in the library, and it looked like there was a lot of space there.\"</p>\n<p>\"It is a very big ice shelf, yes, but it's only ice I'm afraid,\" Newt says and pokes at his food. \"It has a lot more interesting creatures than Antarctica though, I will tell you that.\"</p>\n<p>\"You will tell them what?\" Mary Lou's voice slashes like a whip and like that, the curiosity dies.</p>\n<p>\"I was telling them about places I'd travelled to,\" Newt says hastily, almost dropping his spoon in his nervousness.</p>\n<p>\"He's eaten a <em>snake</em>!\" Modesty says quickly.</p>\n<p>\"What?\" Mary Lou asks sharply.</p>\n<p>\"In Africa – I rather didn't have anything to eat,\" Newt says and flicks his gaze up and down in desperate search for something safe to latch onto. \"I was studying the natural wildlife there and ended up terribly lost.\"</p>\n<p>\"Studying the… natural wildlife?\" Mary Lou asks thoughtfully. \"You're a scientist.\"</p>\n<p>\"Zoologist, yes,\" Newt say and his eyes land onto the papers she's holding. Muggle newspapers, with their still, stationary images.</p>\n<p>\"And you've been to Africa,\" Mary Lou muses. \"Aren't the people very… savage there?\"</p>\n<p>\"Don't they practice voodoo there?\" Modesty asks, \"The <em>black magic</em>.\"</p>\n<p>Newt looks down at his plate hopelessly, swallowing everything wants to say, the explanations he wants to give. He grips the spoon tighter, swallowing. \"It's…  a very interesting sort of place,\" he says instead, hoping that the despair he feels over this family doesn't bleed through his voice. \"Ahm, what do you have there, Mrs. Barebone?\"</p>\n<p>\"Ah, right,\" she says, though her eyes are sharp. \"It's Miss Barebone, I thank you, and here – I have saved all the news about the incidents. Surely there is no question about all of these being the results of most terrible witchcraft.\"</p>\n<p>She hands the papers to him and Newt accepts them, both terribly grateful and nervous all at once. His fingers shake a little as he spreads the topmost out – and oh. Oh.</p>\n<p>The paper calls it a Gas Explosion, put the picture shows a house that has collapsed, no hint of fire damage in sight. The article is… confused in it's facts, citing like gospel the tale of gas leak but then going around, confused about the lack of fire, actual explosion, noise, or even the smell of gas. MACUSA's hand there, the obliviations are clear in the holes in the story.</p>\n<p>It is indeed difficult to deny the magical origins of the incident. Especially since Newt has seen destruction just like it before. Back then though… the Obscurus had seemed so powerful, destroying a hut in a single sweep through it. This one though, it was a six story building and it's been brought to ruin in an instant.</p>\n<p>Newt avoids looking at Credence. \"Incredible,\" he murmurs and spreads the paper out. \"Incredible. You're quite right, Miss Barebone – this was no gas leak.\"</p>\n<p>Credence shudders and Newt can feel a shiver crawling up his spine.</p>\n<p>The young man <em>knows</em>.</p>\n<p>Mary Lou nods, satisfied, as she takes her seat. \"It's far from the only incident we've had,\" she says imperiously. \"Magic is literally tearing this city apart, Mr. Scamander, there is no denying it. And witches… witches are behind it all.\"</p>\n<p>No, Newt thinks, his fingers curling at the edges of the paper, twisting the pages. Not witches. A witch hadn't done this to her child.</p>\n<p>A monster had, and she is sitting right across him.</p>\n<p>Newt doesn't know what to do. It's not an unfamiliar feeling to him – every time he encounters something new, it starts with that. And while Credence isn't precisely new, the situation definitely is. Maybe it's like that with every Obscurial – after all, if the situation was always the same, they would be far easier to deal with, and probably far rarer. But they weren't the same.</p>\n<p>The situation in Sudan and now this one in New York, they were both unique in their own terrible ways.</p>\n<p>And Newt doesn't have the faintest clue about what to do about it.</p>\n<p>Mary Lou watches over her children like… well Newt can't even think of a comparison, that's how horrible it is. It's a little like one of those terribly confused animal mothers who after delivering their young then bent down to eat them. The way she looked at Modesty, Chastity and Credence was much like that, like she was pondering on whether to reach out and, and yet… it's not like that at all. Because even those creatures, they had reason for it.</p>\n<p>What possible reason could Mary Lou have for the way she ran her house – what possible reason was there behind the poison Modesty sang so proudly and how Chastity looked away when she heard her mother speak that same poison? What reason could there be for the cuts and scars in Credence's hands?</p>\n<p>This is why Newt doesn't like humans – they are tricky and confusing and only human can become like this and try as he might to reason out some sort of logic to it… there isn't. A human can be malicious for no reason or rhyme at all. Only a human can be truly evil.</p>\n<p>Newt sets his spoon down somewhat reluctantly and taps his fingers against the cool metal convulsively, casting glances around the table.</p>\n<p>Mary Lou is telling the children the schedule tomorrow – how they'd make the food, feed the street children, make the leaflets. Modesty should look in on Jacob, the boy had been a little strange last time, just try and see if he is alright – and not influenced by anything… unnatural. Chastity should to take the leaflets out to the library again, and not just leave them at the desk this time – slips them between pages of Bibles and anything with the word witch on it. And Credence…</p>\n<p>\"You will go to hand out the leaflets,\" Mary Lou says and there is sharpness to her voice that crawls up Newt's spine like spider made of ice. \"You haven't been pulling your weight lately at all.\"</p>\n<p>Credence nods but doesn't look up.</p>\n<p>\"Take care of the dishes,\" Mary Lou adds, a little impatient, waving at the dishware on the table.</p>\n<p>Credence nods again and stands up, the chair behind him clattering all too loud in the stiff, tense church.</p>\n<p>Newt's leg bounces with nervous energy and then he lifts to his feet. \"How about I help – I have been freeloading a bit as it is,\" he says and before anyone can deny him, he starts piling the plates. \"Let me help –\"</p>\n<p>\"Mr. Scamander,\" Mary Lou says, frowning.</p>\n<p>\"Everyone should pull their weight,\" Newt says and doesn't look at her, keeping his eyes on the plates and cups. His heart beats hard and heavy in his chest and his stomach feels like it's full of Doxies and Billywigs – he feels like he's about to fall apart and float away. And then…</p>\n<p>Credence continues to clear the table.</p>\n<p>Mary Lou sighs, \"Very well, if you feel you must,\" she says and stands up. \"You deal with the washing – me and the girls will clean up here. Girls, let's get the brooms.\"</p>\n<p>Newt swallows a utterly inappropriate giggle at that – of course they'd be Muggle brooms that never fly, how silly of him. Quickly he sweeps up what dishes Credence doesn't and then, with armload of plates and cups, he looks at the young man.</p>\n<p>Credence his looking at him from under his brows, only to look away the moment he sees Newt watching. Newt swallows. \"After you,\" he says and dully Credence turns to lead him to the kitchen.</p>\n<p>The kitchen isn't quite as obscenely clean as the rest of the church – but that's probably because it's been scrubbed clean so severely that it has worn the paint of what little furniture there is, and scraped clean the polish of the gas stove. Even the sink looks like it's been scraped with sand paper – there are scratches all over it.</p>\n<p>There is a bucket in the sink, where Credence puts the dishes – Newt does the same awkwardly, wincing at the clatter of plates. Right, washing by hand – what was he thinking?</p>\n<p>\"Soap, I suppose?\" Newt asks and pushes up his shirt sleeves, bundling them up at his elbows. Well, he can clean by hand – he generally doesn't in his own kitchen, but most of the care around the habitats is done by hand, so he figures he can manage it.</p>\n<p>Credence reaches for a bottle of some liquid and then stops in middle of glance at Newt. His shoulders visibly tense, somehow even more than they already are, and he stares, eyes widening, at Newt's arms.</p>\n<p>The wizard looks down with some confusion and then blinks. Oh.</p>\n<p>\"It's tricky, taking care of animals,\" Newt says, brushing a hand over a fairly recent scrapes and cut on his right inner arm. They're still red and little inflamed, but that's Nundus for you. \"When I was in Africa there were these poachers. They'd captured this creature, a beautiful specimen – a big… cat. Kind of like a lion, I suppose,\" he muses and smiles fondly at the cuts. \"Poor thing was in bad shape when I got to her, couldn't tell friend from foe.\"</p>\n<p>The only reason she hadn't killed him was because the poachers had muzzled her with dragon hide bag – poor creature had barely been able to breathe at all.</p>\n<p>Credence stares at the cuts and then at him. \"What did you do to it?\" he asks, and Newt's heart skips a beat.</p>\n<p>\"I released her and took care of her – she's still recovering, but she's in much better shape now,\" Newt assures him with a smile. \"And I assure you, she hasn't made a swipe at me since.\" She did try to nuzzle him, though, which was a far more perilous affair.</p>\n<p>Credence eyes Newt's arms and the new and old scars there – the Nundu was far from the first to leave her mark on him. Then, swallowing, the young man turns to the dishes and pours some soap on them.</p>\n<p>Newt watches him, sees his fingers twitch, fist trying to clench and unclench. He's feeling the pain of his own cuts now, the reminder had brought the pain back. Biting his lip, Newt glances at the door to the main church – he could hear Mary Lou speaking with the girls there.</p>\n<p>\"Credence – can you show me your hands?\" Newt asks, his voice pitched low so that it didn't carry.</p>\n<p>Credence looks at him, then at the door. It takes a moment and Newt doesn't look away, watching him patiently until Credence finally, hesitantly, offers his hands.</p>\n<p>The wizard wishes desperately he didn't know these cuts. The sharp lines, the long drag – a belt, which at least is a little better than actual whip if not by much. But worse yet, there are deeper grooves, a weird angular part – and he knows what makes that mark too. A belt buckle.</p>\n<p>Swallowing, Newt smoothes out Credence's fingers, subtly testing their flexibility – little finger of his right hand will not straighten at all, it has been broken and healed wrong. Left ring finger is stiff and when Newt straightens it out, it stays straight – the tendon is cut, a recent injury which, strangely, has not left mark on Credence.</p>\n<p>Newt frowns. Whatever had broken Credence's little finger should have left a mark too, but it hadn't. There are… scars that aren't in Credence's hands.</p>\n<p> \"Someone has been healing you,\" Newt says before he can think better of it and Credence yanks his hands away, his eyes wide with horror.</p>\n<p>Newt stares back at him, wide eyed. Someone… has been healing Credence's hands. With <em>magic</em>. Someone with magic knew Credence. Healed his hands – or… healed his cuts, his scrapes, but not the broken finger, not the severed tendon. <em>Someone with magic knew Credence</em>.</p>\n<p>\"Credence,\" Newt says and then stops when the younger man flinches away. He looks terrified and Newt bites his tongue. They stand there a moment on the cusp of danger and then a bang of wood on wood coming from the church makes them both jump.</p>\n<p>\"Let's…. let's do the dishes,\" Newt says finally, trying for soothing tone of voice, but probably only managing tense nervousness. \"Alright? Let's just do the dishes.\"</p>\n<p>Like grasping a lifeline, Credence turns to the bucket and starts filling it with water. Newt watches him, biting his lip, trying to think of something.</p>\n<p>Someone has been healing Credence's skin, but not what's beneath it – and how very true was that. But… why? Credence isn't a wizard – he wouldn't be an Obscurial if someone had taught him magic. As such, he would pass for a Muggle and the Magical Congress had some ridiculously strict and severe rules about Muggles. No magical should even be interacting with someone who was thought to be a Muggle.</p>\n<p>So, either someone knew Credence wasn't, or… or what?</p>\n<p>Very hesitantly Credence hands Newt a cup he'd just scrubbed clean, and Newt accepts it for rinsing. The young man's hands are shaking and the wizard pretends he doesn't know.</p>\n<p>Does someone know Credence is a Obscurial? But… If they knew, surely they would've already taken Credence away from Mary Lou Barebone and the church, surely. And yet, if they didn't know, why help the boy?</p>\n<p>Newt eyes the cup in his hands and then sets it onto the rack to dry. He doesn't know what to think. If this was an animal, then Newt would say that someone truly horrible was in progress of taming it – hurting and healing in turns, in shifts, try lull it into compliance. He'd seen it before.</p>\n<p>It was how dragons were often tamed.</p>\n<p>Suddenly, Credence speaks out. \"You're a…\" he says, breathing shakily and then finishing so quickly and quietly that it is barely audible, \"you're <em>magic</em>.\"</p>\n<p>\"A little bit,\" Newt admits just as quietly and looks at the young man. \"So are you.\"</p>\n<p>Credence swallows, his throat working convulsively as he tries to say something. Newt watches for a moment and then places his hands onto the edge of the sink, fingers splayed out, all in clear view. The Obscurus is close to the surface, roiling under Credence's skin – but his eyes are dark and clear, not cloudy at all.</p>\n<p>\"Do you want me to leave?\" the wizard asks quietly. \"Do you want me to back up? What do you need, Credence?\"</p>\n<p>Credence needs to breathe but he doesn't seem to manage it. Newt watches him struggle for a moment then exhales. \"With me, Credence. Inhale,\" he says softly and then takes a deep, exaggerated breath. Credence doesn't follow but looks at him desperately. \"And exhale,\" Newt says and sighs the air out slowly. \"Inhale… and exhale…\"</p>\n<p>It takes a while but eventually Credence manages to gasp for a breath and then another. Newt watches the door just in case nervously and after moment reaches past Credence to grab a dish to scrub. \"Inhale,\" Newt whispers as he pushes Credence aside to take his place at the bucket. \"And exhale…\"</p>\n<p>He's through all the cups and starting on the silverware by the time Credence is breathing more steadily. The young man then grabs at cutlery desperately and Newt lets him have it, watching Credence starts rinsing them hastily. \"Inhale… exhale,\" Newt murmurs to him and Credence inhales and exhales with him.</p>\n<p>The stops breathing completely when there is a click of a shoe heel on the floorboards and Mary Lou peaks her head into the kitchen. \"How are you coming along?\" she asks sharply.</p>\n<p>\"Almost done, Miss Barebone,\" Newt says lightly and shows the spoon he'd been cleaning.</p>\n<p>She narrows her eyes. \"Credence?\"</p>\n<p>The young man's mouth works for a moment and then he nods. \"We'll be… done soon,\" he chokes out.</p>\n<p>Mary Lou frowns and takes a breath – Newt cuts in hastily. \"We'll be right with you in a jiffy, Miss Barebone.\"</p>\n<p>\"Hmm,\" she answers, suspicious. \"Well, once you're done, I think it's time for you to be on your way, Mr. Scamander. It has been wonderful to have you and I do appreciate you helping out with the chores, but it's close to the children's bedtime.\"</p>\n<p>It can't be, it's barely six o'clock. But, like a predator, she has sensed something afoot and now wants the rival, Newt, out of her den.</p>\n<p>\"Right, of course,\" Newt answers, bowing his head slightly. \"We'll just finish here.\"</p>\n<p>She narrows her eyes further and then, somewhat deliberately, stays at the doorway, her arms folded as she watches them work.</p>\n<p>Newt turns to the dishes and starts scrubbing at a plate, disappointed and disheartened. Credence starts rinsing the spoons again, and his breath is stuttering in his throat a little. He looks even paler than before.</p>\n<p>\"Can we have a story, Mommy?\" a young voice asks from somewhere behind them – Modesty. \"Can't Mr. Scamander tell us a story? He has good ones, from <em>Africa</em>!\"</p>\n<p>Even Chastity leans in, looking interested. \"I'd like to hear more too,\" she says quietly. \"About Africa, and the Arctic.\"</p>\n<p>\"No, Modestly, Chastity – Mr. Scamander will be leaving soon, and he doesn't have the time for stories,\" Mary Lou says severely</p>\n<p>Modesty looks disappointed and Chastity bites her lips and Newt almost pouts at that, absolutely miserable at this sudden, terrible weight of atmosphere pressing down on them all. He would've had the time for stories. He would've <em>loved</em> to tell them stories, if not for any other reason then to distract them for a while.</p>\n<p>Instead he scrubs and they finish the dishes all too soon. Newt dries his hands on the dish towel, watching Credence put the last dishes away. The young man's hands look red, his fingers twitching – the cuts must be hurting even worse, after all the water and soap.</p>\n<p>Newt has essence of dittany in his suit case, never mind numerous other herbs he could've used, but…</p>\n<p>He bows his head for a moment and then turns to Mary Lou Barebone and her pale daughters. \"Thank you for having me, Miss Barebone, Modesty, Chastity. It's been enlightening,\" he says. \"The Second Salem Church is very… captivating.\"</p>\n<p>\"I'm happy to hear you think so,\" Mary Lou says with a nod, but her eyes are harder now. \"Please, do take some leaflets before you go – hand them out, spread our cause.\"</p>\n<p>\"Right,\" Newt says, swallowing, hands clenched helplessly into fists. \"Of course.\"</p>\n<p>Mary Lou's nods coolly and she motions at the door. \"You can find them at the door when you leave.\"</p>\n<p> </p>\n<p>Newt doesn't stick around to watch the church, absolutely certain that Mary Lou is lurking by any near window, watching him. Instead he walks away, trying not to shudder as he goes, trying not to stumble. His knees are shaking a little.</p>\n<p>He completely misses the woman until she already has him by the labels of his coat and is pulling him into an alleyway. \"You!\" she says and it's not Mary Lou at all, it's… someone? \"You, what do you have to do with the Barebones?\"</p>\n<p>\"I, uh, huh?\" Newt answers, staring at her with wide eyes. She's younger than Mary Lou, with dark hair cut short and light grey coat on. \"What?\" Newt asks. \"Who are –\"</p>\n<p>\"Answer the question,\" she says and points a finger at his face. \"What do you have to do with the Barebones?\"</p>\n<p>\"I – just met them today?\" Newt answers, confuses, looking her up and down. \"I saw their – rally? At the bank and Miss Barebone invited me to dinner – ah, excuse me, who are you?\"</p>\n<p>She narrows her eyes, leaning in – she's really quite intimidating, Newt realises, and tries to sink into the wall behind him, trying to look at anything but her.</p>\n<p>\"Look at me! You are not a Second Salemer,\" she says, her eyes hard and flinty, her grip on the labels of his coat strong as she tugs at him to get his attention. \"Are you?\"</p>\n<p>\"Can't say I am, no,\" Newt admits because – no, good Merlin, no, definitely not. He squirms a little and looks past her ear, because that's safer. \"Um, are you? A, uh, Second Salemer?\"</p>\n<p>She releases him at that, all but shoving him away. \"Of course not!\" she mutters and then looks backwards, at the mouth of the alley. \"Those people, that woman – no,\" she says and shakes her head before turning back to him. \"You – you're not one of them, and you don't… believe what that woman believes, I can see you don't. What were you doing with them? What do you have to do with them?\"</p>\n<p>\"I… ate dinner?\" Newt says with a swallow and then straightens the front of his coat, staring at the ground. \"I don't see how that is your –\"</p>\n<p>And then she has him by the labels of his coat again. But that's not all – she has a wand in her hand now.</p>\n<p>\"It <em>is</em> my business,\" she says with eyes narrowed and holds the wand to his throat. \"Now tell me!\"</p>\n<p>Wand – magic – witch. The dots connect quickly and Newt stops struggling. \"Are you the one who healed Credence's hands?\" he asks slowly.</p>\n<p>\"What?\" the witch asks, blinking at the sudden turn.</p>\n<p>\"Are you the one who healed Credence's hands?\"</p>\n<p>She stares at him for a moment and the eye contact really is quite uncomfortable. \"Someone's healed Credence's hands?\" she then asks, confused.</p>\n<p>\"Someone with magic,\" Newt says and nods at the wand. \"And he knows about magic – which means, someone with magic is interacting with him.\" Interacting with him – not <em>helping</em> him, he adds silently as he eyes the woman. \"It wasn't you?\"</p>\n<p>\"No, I…\" the woman blinks and then backs away a little, staring at him. \"That's why you got – you can feel that Credence's a squib?\"</p>\n<p>Newt opens his mouth and then snaps it shut. Squib? What? \"What?\" he asks out loud because he's not sure what this conversation is about anymore. \"Who are you – what is going on?\"</p>\n<p>\"Oh, I… right, um,\" the woman clears her throat and then holds out a hand. \"Tina Goldstein.\"</p>\n<p>\"Newt Scamander, how do you do?\" Newt answers dully and takes her hand – she has a <em>very</em> firm grip. And she's still holding her wand at him, which he glances at nervously.</p>\n<p>\"Right, sorry,\" She says and puts it away, looking a little sheepish. \"Sorry, I'm… I had a run in with Credence little while ago – that woman, his supposed mother… it wasn't pretty, I reacted a bit rashly and I suppose I've been a bit protective since.\"</p>\n<p>Newt eyes her silently for a moment and the straightens his coat again – hopefully for the last time. \"I see?\" Newt answers. \"Admirable, I suppose.\"</p>\n<p>\"Not really, it's not as if I've been able to do much,\" Tina sighs and runs a hand over her mouth. \"You – can you tell me what happened?\"</p>\n<p>\"Nothing,\" Newt answers honestly. \"I saw the rally and Mary Lou noticed me, singled me out I suppose. I had dinner with them. It was…\" terrible, he thinks and makes a face.</p>\n<p>\"What was that about Credence's hands, though?\" Tina asks with a frown. \"I haven't been healing him. I, uh, cursed that woman, once, and everyone got obliviated for it, but…\"</p>\n<p>\"Obliviated,\" Newt mutters. Obliviated – all of them, Credence too? \"When was this?\" he asks, quickly fitting the symptoms and the incidents on the paper into a timeframe. Credence is shattering around the edges and the incidents with the Obscurus had been happening for about a month…</p>\n<p>\"About month ago,\" the witch answers with a wince and looks down.</p>\n<p>Newt nods slowly. \"Was… Miss Barebone anti-witch before it happened?\"</p>\n<p>\"She was – I figure she's been like that all her life,\" Tina mutters and shakes her head. \"No-Majs can be like that.\"</p>\n<p>\"Hm,\" Newt answers with a distracted nod and runs a hand over his face. Obliviation – brush in with magic that tempered with the mind. And Credence knows – he is well aware what was happening, that he himself was the cause of it. He must've known… most of his life if not all of it, and somehow in control of it. That is the only possible explanation as to why the Obscurus hadn't killed him. Credence had <em>controlled it</em>…</p>\n<p>At least until he'd been Obliviated – Obliviated, no doubt, of all knowledge of magic. Not just of the incident with this witch, but whatever he had himself managed to learn and master thorough his life. And with that knowledge had gone his control.</p>\n<p>Newt almost groans. Why is it that always behind all incidents involving magical creatures, there is a human behind, thinking they knew everything? Never once has he met a magical creature going on a rampage without there being a person behind it all.</p>\n<p>\"What?\" Tina asks sharply. \"What is it?\"</p>\n<p>\"Nothing, nothing,\" Newt says, because the last thing this situation needs is the word of Credence's status as Obscurial to go out. \"If you're not the one who's been healing his hands, then who is it?\" he asks, looking past her at the alley mouth. \"There's a wizard or a witch out there, interacting with him. Do you know who?\"</p>\n<p>\"No, I… I thought I was the only one who cared,\" Tina admitted. \"I told them that Credence must be a squib, I put it in my report… but because he's been raised by No-Majs, he's as good as No-Maj himself. So… no one much cared. And I was forbidden from doing anything about it.\"</p>\n<p>Newt nods slowly at that. \"Reported?\" he asks slowly.</p>\n<p>\"I am – I was an Auror. I was suspended,\" Tina sighs and then looks at him. \"Who are you, really? You're British, what are you doing here?\"</p>\n<p>\"Oh, I was just passing through – before this,\" the wizard answers. \"I was going to – to buy a birthday present. An Appaloosa Puffskein \"</p>\n<p>She stares at him.</p>\n<p>\"There is only one breeder of them in the world and he lives in New York,\" Newt says earnestly – which is true enough, and he had been meaning to visit him anyway, so it was as good a lie as any. \"So, so I was going to buy one from him, as birthday present.</p>\n<p>\"We closed that guy a year ago – there is no legal breeding of magical creatures in New York,\" Tina says flatly. \"So that's a lie.\"</p>\n<p>Newt winces. \"Never been any good with those,\" he admits and squirms a bit. \"I was just passing through and – and anyway, does it matter where I was going? I'm all mixed up with,\" he waves a hand at the alley mouth, \"with them, and I can't very well leave now, can I?\"</p>\n<p>Tina Goldstein stares at him for a moment longer and then she sighs. \"He's just a squib,\" she says. \"What do you care?\"</p>\n<p>Newt blinks at her in astonishment. \"They're children, trapped in a terrible excuse of a home, under the tyranny of a terrible excuse of a mother,\" he says slowly. \"Why wouldn't I care?\"</p>\n<p>Newt follows Tina, missing half of what she's saying, too busy thinking about the Barebones. It feels wrong to just… leave like that – feels like he should've stayed and done something, but even now, with Tina lamenting the very same thing ahead of him, he can't for the life of him think what.</p>\n<p>All he knew was that he couldn't do what he'd done in Sudan.</p>\n<p>\"…  Registry, of all things,\" Tina is muttering as she paces ahead, her heels clicking fast on the pavement. \"I can't do anything from the Wand Registry – I can't help with these recent incidents, I can't help Credence, I can't do anything but <em>watch</em> and honestly I shouldn't even be doing that – \"</p>\n<p>\"Incidents?\" Newt asks, glancing around them.</p>\n<p>\"With the – the collapsing buildings,\" she sighs and waves a hand in haphazard motion. \"They still don't know what it is, but it's already destroyed five buildings and it's obviously magical, somehow, we just don't know how yet – or,\" she pauses, making a face, \"<em>they</em> don't know what it is. I am not in the investigation.\"</p>\n<p>The Obscurus, Newt muses. \"Right,\" he says, looking down to his suitcase. \"Those incidents.\"</p>\n<p>Something about his voice must give him away because Tina stops so suddenly that he almost runs into her shoulder. \"What was that?\" she asks.</p>\n<p>\"Nothing, nothing,\" Newt says, squirming, and fiddles with the case. A lock pops open and making a face he snaps it back shut. He hadn't been fulfilling his duties. \"I really should be looking into finding a place to stay for the night – it's getting late and –\"</p>\n<p>Tina narrows her eyes at him. \"You think you'll be staying for long, Mr. Scamander?\"</p>\n<p>However long it would take to help the Barebones, Newt thinks and shrugs awkwardly. \"Just a few days,\" he says.</p>\n<p>\"Hmm,\" she answers, looking a little suspicious. \"I have a place you can stay,\" she then says and looks around. \"But only because you seem like a decent man.\"</p>\n<p>Newt gives her – or rather, the wall little past her – and awkward smile. \"That'd be kind of you, thank you,\" he says, and the hurries to follow her as she moves ahead again, quick and brisk. \"A-about those incidents – what does the Magical Congress think about them?\"</p>\n<p>\"No one knows <em>what</em> to think,\" Tina answers. \"It's unlike anything anyone's seen. Some new spell some lunatic is trying on <em>No-Maj Buildings</em>, probably. Madam President thinks it might have something to do with what's going on in Europe.\"</p>\n<p>\"With Grindelwald you mean,\" Newt mumbles.</p>\n<p>Tina sighs and looks at him. \"We're not used to European affairs affecting us here. The war was bad enough, with the No-Majs going around the way they did, sticking their noses everywhere, but now this…\" she looks down. \"Were you in the war, being an Englishman?\"</p>\n<p>Newt shrugs. \"I didn't fight, if that's what you mean – I worked with Dragons,\" he admits. \"Eastern front.\"</p>\n<p>\"Dragons,\" she answers.</p>\n<p>\"Ukrainian Ironbellies mostly.\"</p>\n<p>Tina stares at him for a moment. \"First Puffskeins and now Dragons,\" she says slowly, suspiciously. \"Do you per chance also breed magical creatures yourself, Mr. Scamander?\"</p>\n<p>\"No,\" Newt says honestly – because breeding with intention to sell wasn't anything like what he did, and that was probably what she meant. \"And besides, breeding isn't illegal in UK.\"</p>\n<p>The look she gives him is full of suspicion. \"That sounds like something an illegal breeder of magical creatures <em>would say</em>.\"</p>\n<p>Newt squirms. \"I'm a magizoologist, Miss Goldstein. It's somewhat part of the job,\" he shrugs and then quickly tries to shift the topic. \"About the incidents though – has anyone died?\"</p>\n<p>\"No, not yet,\" Tina answers, still watching him. \"But they say it's only matter of time before whoever is behind this targets a building that isn't abandoned.\"</p>\n<p>\"They've all been abandoned?\"</p>\n<p>\"One was in middle of renovations, one had some sort of… No-Maj pest control event, and three were abandoned, including the last one,\" Tina lists. \"Whoever's doing it doesn't have the stomach for murder, apparently, but as said, it's probably just matter of time.\"</p>\n<p>Newt bites his lip. Abandoned buildings and no deaths – in five separate case. So… Credence still has some control. But for how long?</p>\n<p>\"Here,\" Tina says suddenly and grabs his wrist, pulling him into an alley – and moment later, they are Dissapparating. Newt barely has the time to watch his landing before he finds himself in another alleyway in another part of the city – a slightly better part than the one where the Church of the Second Salemers was.</p>\n<p>\"I live here,\" Tina says and then makes a face. \"I – the landlady is pretty strict and I'm not supposed to bring men on the premises, so… be very quiet, alright?\"</p>\n<p>\"Alright?\" Newt answers in confusion and then lets her drag him across the street and into the building. They all but sneak in, Newt trailing confusedly after Tina until they make their way to her door and she opens it.</p>\n<p>\"Oh, good, Queenie isn't home yet,\" Tina murmurs. \"My sister, she works at the ministry too – she forgets herself and works over time…\"</p>\n<p>Newt looks around in the flat, a little wide eyed. He can't remember time when someone – and witch nevertheless – had invited him to their home for reason that wasn't strictly speaking business. Mary Lou Barebone and her church didn't really count, he decided and then decided that he was quite bewildered about how he ended up here.</p>\n<p>\"So,\" Tina said.</p>\n<p>\"So,\" Newt said and fiddled with the suitcase handle.</p>\n<p>\"Your coat?\" she asked, arching her eyebrows.</p>\n<p>\"Right,\" Newt agreed with a wince and set the suitcase down so that he could take the coat off and hang it by the doorway. \"Ah, thank you for – for having me. You shouldn't have.\"</p>\n<p>Tina nods and sighs. \"You know, ever since I ran into those people, the Second Salemers, I've keeping an eye on them,\" she says, leading him further into the flat. \"It's unnerving how much that woman knows about magic – even before I ran into them, she knew about wands, spells, she knew there was a whole another world of magic… it's almost like she knows a witch herself, or has known one.\"</p>\n<p>\"Magical lore isn't exactly uncommon in Muggle society,\" Newt mumbles.</p>\n<p>\"No, but it's all too precise – it's real insider information,\" Tina says and falls to sit by the short dinner table, looking up at him. \"What do you think?\"</p>\n<p>\"About what she knows?\" Newt asks and, hesitantly, sits across from her, his suitcase held close. \"I… don't know really.\"</p>\n<p>Part of it was probably coming from Credence, however. Considering how powerful the young man was, there was no way there hadn't been any number of incidents with accidental magic when he'd been younger – incidents which she had then eventually beaten out of him.</p>\n<p>Newt makes a face at the thought and looks at Tina. \"You've been looking into the family. Do you know if… She insisted I called her <em>Miss</em> Barebones, rather than Mrs. Are Credence, Chastity and Modesty her children, or…\"</p>\n<p>\"Adopted, all of them,\" Tina answers grimly, making a face of her own. \"Why a woman so utterly unsuited to being mother adopted children, I have no idea but she did. I don't know much about the girls, but I know that Credence at least is an orphan – his mother died in childbirth right in the Second Salemer Church.\"</p>\n<p>\"She did?\" Newt asks, blinking.</p>\n<p>\"Mary Lou reported it and everything.\" Tina shrugs with a sigh. \"And since hers is a church known for doing some bits of charity with the local children and whatnot… they didn't hesitate let her adopt Credence by herself. I think the Second Salemer Church is also known as something of an orphanage.\"</p>\n<p>Newt swallows. \"You think…\"</p>\n<p>\"The mother was probably a witch – and probably told <em>that woman</em> things before her death,\" Tina agrees. \"We don't have proof of it, but… I've been watching them for a month now, and sometimes she mentions Credence's mother. Calls her a terrible woman.\"</p>\n<p>They are quiet for a moment, Tina thinking back to it while Newt eyes the table between them, his fingers clenching and unclenching anxiously.</p>\n<p>\"Have you… tried to…\" Newt hesitates, not sure how to put it. \"She shouldn't be allowed to…\"</p>\n<p>Tina sighs heavily. \"I've tried – but no one cares. MACUSA says it's not our problem. Credence is as good as No-Maj and we have rules about No-Majs. No interaction what so ever is allowed,\" she says somewhat grimly. \"And No-Majs themselves… Credence is an adult supposedly in full control of his destiny.\"</p>\n<p>\"And the girls?\" Newt asks. \"Chastity can't be older than fifteen, Modesty no older than eight, what about them?\"</p>\n<p>\"She doesn't beat them,\" Tina shrugs.</p>\n<p>Newt stares at her for a moment and then looks away. \"I… suppose not but…\" he mumbles and bites his lip. Beating was far from the only way you can abuse a creature – or a being.</p>\n<p>Tina stares at him for a moment and then frowns. \"They are No-Majs,\" she says slowly. \"Even if they were being hurt – there is nothing we can do. We're magical, we're not to interact with them.\"</p>\n<p>Newt takes a breath and then swallows what he wants to say. The American laws are even worse than the British ones – and nowhere are they <em>good</em>, from what he's seen. This whole no interaction thing, it just breeds contempt and disregard, paints Muggles as little more than creatures to be ignored by any means necessary. It was how wizards dealt with lot of Magical Beings and Creatures too, to everyone's detriment.</p>\n<p>No breeding of magical creatures indeed.</p>\n<p>\"Mr. Scamander, there is nothing I'd like more than help them – but I don't know how we can,\" Tina says, her voice a little desperate, a little hopeless. \"I've thought of everything but –\"</p>\n<p>\"Everything within legal limits, you mean,\" Newt answers and she abruptly shuts up.</p>\n<p>\"That,\" Tina says very slowly, \"is very dangerous thing to say to an Auror.\"</p>\n<p>\"Suspended Auror,\" Newt points out and looks away. \"You – you've been watching the Barebones since your run-in with them. You want to help Credence, yes? But laws forbid it. So…\"</p>\n<p>\"I can't just ignore the <em>law</em>,\" Tina hisses.</p>\n<p>\"I can,\" Newt says and shrugs. He ignored it on daily basis, most everywhere he went. As far as just about every magical, non magical and even non human government goes, he's dangerous smuggler of even more dangerous goods. He'd made his peace with it long time ago – back when he'd first made his suitcase, in fact.</p>\n<p>\"I could take you in,\" Tina threatens. \"Don't think I wouldn't.\"</p>\n<p>\"And then who's going to help Credence?\" Newt asks pointedly, to which she can't think of anything to say and could only frown at him, conflicted and dismayed.</p>\n<p>And he wasn't just going to try to help Credence, either. He was going to save the young man if it was the last thing he did – him, and his sisters.</p>\n<p> </p>\n<p>Tina's sister is… terrifying. In all ways that a woman can be terrifying, Queenie Goldstein is terrifying. Not that Newt knew much about women in general – but he knows the scary ones at least, because they <em>scare him</em>.</p>\n<p>And it turns out Queenie is also a Legilimens.</p>\n<p>\"Teenie,\" she says, tilting her head a little as she stares at Newt. \"What is an Obscurial?\"</p>\n<p>\"What?\" Newt asks bleakly.</p>\n<p>\"What?\" Tina asks sharply.</p>\n<p>Queenie blinks innocently. \"What?\" she asks.</p>\n<p>\"Mr. Scamander?\" Tina asks dangerously. \"Obscurial? <em>What</em>?\"</p>\n<p>\"Uhm,\" Newt squirms. \"It's just something that crossed my mind just now – it's –\"</p>\n<p>\"It's that boy you always worry about – Credence, the poor dear,\" Queenie says and makes a sad face even as she stares at Newt – and he wants to look away but can't. \"He's an Obscurial. He's… very powerful and very dangerous and oh, honey, I am so sorry,\" she says suddenly and Newt realises he's thinking of Sudan and oh no.</p>\n<p>Queenie looks absolutely heartbroken. \"I am so sorry about her, she was such a sweet girl, she didn't deserve what happened. It wasn't – it was your fault?\" she frowns with sudden confusion. \"Was it your fault?\"</p>\n<p>\"Was what his fault?\" Tina demands to know.</p>\n<p>\"The other Obscurial,\" Queenie says and touches the side of her head. \"You're a little hard to read, sweetheart, you British people always are. The accent is a little difficult…\"</p>\n<p>\"What other Obscurial – what was your fault – what – Mr. Scamander!\" Tina rounded on him. \"You've been holding out on me, and after all I shared with you.\"</p>\n<p>\"For shame,\" Queenie adds with gently mocking severity, shaking her head.</p>\n<p>\"Don't read my mind,\" Tina says to her, pointing a finger at her. \"Especially not to make jokes. Mr. Scamander, explain.\"</p>\n<p>Newt tries to squirm away except Queenie is by the door and he can't go that way, and Tina blocks his exit to the other end of the flat and oh crud. \"Ah, that is, um,\" he mumbles, fiddling with fingers. \"I haven't been fully honest with you, no,\" he admits with a wince. \"I didn't notice Credence because he's a squib – I noticed him because he's a Obscurial.\"</p>\n<p>\"How can he be an Obscurial – Credence is in his twenties!\" Tina says, sounding incredulous.</p>\n<p>\"Which would make him much older than the oldest recorded Obscurial in history, yes,\" Newt agrees hurriedly. \"But he is an Obscurial never the less. The incidents with the buildings – I've seen that before, in Sudan, there was a girl –\"</p>\n<p>\"The other Obscurial,\" Queenie adds. \"The one he tried to save.\"</p>\n<p>\"Please, don't do that,\" Newt winces. \"But yes. She was… much like Credence is now, if much younger, and Credence has all of her signs. And even if he didn't – close up you can feel the Obscurus, if you know what to look for. It has a taste to it, tingle on your tongue – like tasting a storm of iron and rust.\"</p>\n<p>Tina gapes at him for a moment and opens her mouth and then closes it. \"What?\" she then asks. \"But – there hasn't been an…\" she trails away and closes her eyes in realisation. \"Mary Lou Barebone,\" she mutters in a growl.</p>\n<p>\"Quite,\" Newt agrees with a grimace.</p>\n<p>\"But if Credence is an Obscurial… why hasn't there been incidents before?\" Tina asks, looking a little at loss. \"An Obscurial has no control – the Obscurus should have been at least seen before, there should have been other incidents. Why now?\"</p>\n<p>\"My theory is that he had control – until you Obliviated him,\" Newt says.</p>\n<p>The two women stare at him for a moment while Newt looks at anywhere but them.</p>\n<p>\"What happened to the girl – the other Obscurial?\" Tina asks finally.</p>\n<p>Newt licks his lips nervously. \"I… could show you,\" he says and looks down at the suitcase. \"If you promise not to arrest me,\" he adds.</p>\n<p>Tina's eyes narrow.</p>\n<p>\"It's really quite sweet, what he's doing,\" Queenie says helpfully and smiles at Newt encouragingly. Sadly it has the exact opposite effect – and not just on him, but on Tina who's eyes narrow even further.</p>\n<p>Merlin, what a mess.</p>\n<p> </p>\n<p>It's good to be back home – and Newt very carefully avoids looking at Queenie when he thinks that, all but feeling her sad sympathy over him. But the fact remains and he refuses to feel any shame over it – the suitcase and it's extended space had always been more a home to him than any other place he'd ever lived in.</p>\n<p>Home was where the heart was, after all.</p>\n<p>\"Have you been behaving at all?\" Newt asks the Niffler who is looking at Queenie and her golden earrings with great interest. \"don't go bothering our guests now, we're trying to be hospitable here. And don't give me that,\" he adds when the Niffler makes attempt at looking innocent. \"Don't think I didn't see your hands at the bank – you were about to sneak out, weren't you. At a bank, a Muggle bank!\"</p>\n<p>\"What on earth?\" Tina asks while the Niffler harrumphs and slinks away, tail whisking with great imperiousness as he goes.</p>\n<p>\"Never mind him, I'll get him a bauble and he'll be right as rain – ah, watch it,\" Newt quickly moves to pull Tina away. \"That's where the Nundu is – she is a little bit wary of strangers, best stay away…\"</p>\n<p>\"The <em>Nundu</em>?!\"</p>\n<p>\"I really should feed her before we go, too,\" Newt says with a wince. \"And the rest too – I haven't been the most attentive today, too many things happening – right this way, please,\" he adds and quickly ushers the sisters away. \"This way, I have it here…\"</p>\n<p>While Queenie looks around with excited, wide eyes and Tina looks on the brink of being horrified at everything, Newt shows them to the tundra habitant. It had been mostly empty in his time in Africa, which was why he'd put the Obscurus there – that way it wasn't in danger of bumping into anything else. Now it floated above the snow, as peaceful as a Obscurus could be.</p>\n<p>\"Is that –?\" Tina asks, her voice hushed.</p>\n<p>\"An Obscurus, yes,\" Newt agrees. \"Don't touch it – it's contained but that doesn't make it perfectly safe. I managed to extract it from the Obscurial, but… removing it killed her.\"</p>\n<p>\"Is that what you want to do to <em>Credence</em>?\" Tina hisses in horror.</p>\n<p>\"No, no, of course not – no it was… it was a mistake, I was wrong,\" Newt says quickly with a swallow. \"I thought – I thought it would save her, but… it obviously isn't the way to treat the condition. I kept it to study so that if I ever… encountered another Obscurial, I might know how to help them.\"</p>\n<p>Queenie watches him with soulful, sad eyes while Tina folds her arms, looking nervous. \"Do you?\" she asks. \"Can you help Credence?\"</p>\n<p>Newt bites his lip and then lets out a sigh. \"I don't know,\" he admits. \"But I want to try. I want to help.\"</p>\n<p>\"Queenie?\" Tina asks.</p>\n<p>\"He means it,\" the blond witch said softly. \"He cares so much. It almost hurts, how much he cares.\"</p>\n<p>Newt winces at that, and looks away, embarrassed. \"I should care for the creatures here, I haven't fed them since I disembarked the ship,\" he muttered. \"Don't – don't touch anything that looks dangerous, alright?\" he says and then turns to hurry away.</p>\n<p>\"Everything here looks dangerous!\" Tina calls after him but Newt's off.</p>\n<p>Its a immense relief to leave the people behind for a bit, and just concentrate onto what he knows – what he loves. He grabs the buckets as he goes and greets the Graphorns with a snorting croon that has them galloping to him – and almost bowling him over. \"There you are – hey, alright there,\" Newt mumbles, nuzzling into the tendrils fondly. \"Oh, have you missed me? I've missed you <em>terribly</em>,\" he croons and stokes the side of her neck. \"Now where's baby, huh?\"</p>\n<p>The foal is at his feet, investigating the bottom of the bucket excitedly. With a laugh, Newt takes a handful of feed and let him have it, grinning at the tickle of the tendrils on his palm.</p>\n<p>\"What are <em>those</em>?\" Tina asks with a strange tone of voice from somewhere behind him.</p>\n<p>\"Graphorns,\" Newt answers, patting the female's side and then upturning the bucket onto the ground so she too could have her dinner. \"The last breeding pair – that is,\" he back-pedals, remembering the whole thing about illegal breeding and whatnot. \"I rescued them, and if I hadn't it might've very well been the end of Graphorns as we know it. I'm hoping to eventually release them back into the wild but right now… they'll just be hunted down again, and that will be that.\"</p>\n<p>\"I think they're cute,\" Queenie says brightly.</p>\n<p>Newt beams at her while Tina just shakes her head in wonder.</p>\n<p>The sisters follow him around the habitats as Newt feeds the creatures – it kind of takes some of the joy out of it, how horrified Tina seems to be about it all. Apparently the new rules of the Magical Congress are deeply rooted, because the faces she makes when he tells her about the Nundu and the poachers is pretty foul. The one at Frank's story is little better.</p>\n<p>\"People had them?\" Tina asks, making a face. \"What – why would you capture a, a Thunder bird?\"</p>\n<p>\"They're very valuable, in lots of ways,\" Newt admits, stroking at Frank's neck gently to soothe the bird's nervousness over their guests. \"The poachers were trying to make it rain in desert, when I got to him. There are… other uses for them too. They can sense danger for one. There you go, Frank, there's nothing to be worried about. They won't hurt you, there you go…\"</p>\n<p>Tina shakes her head. \"Are all your creatures like this?\"</p>\n<p>\"They're not mine – you can't own other beings or beasts,\" Newt murmurs and pats Frank's beak before stepping back. \"But yes, more or less. I rescue and nurture them and when it's safe I release them back into the wild. Frank here is the reason why I came to the States, as matter of fact – I meant to take him to back home to Arizona.\"</p>\n<p>He glances at the sisters and squirms a little at the way they're looking at him. Quickly, shaking his head, he hurries on, to feed the Mooncalfs and then the Billywigs and Doxies. Tina and Queenie trail after him, Queenie exclaiming delightedly over everything while Tina falls into a thoughtful silence.</p>\n<p>\"Mummy's here – oh, I am so sorry, I've been gone too long,\" Newt whispers to the Occamy nest. \"You have a new sibling and I wasn't there to see her hatch – hello there sweetheart…\"</p>\n<p>He preens the new Occamy gently with his fingers until she croons at him, nuzzling into his hand. \"There you go, love,\" Newt croons back to her. \"There you go…\"</p>\n<p>\"They're lovely,\" Queenie says softly.</p>\n<p>\"Occamies – their eggshells are worth a small fortune,\" Tina says bleakly while Newt collects the said eggshells from the nest, setting the aside.</p>\n<p>\"And people don't often care about the creatures inside those eggshells,\" Newt agrees and looks at her. \"And neither did the people I collected these particular eggs from.\"</p>\n<p>Tina sighs. \"Alright, Mr. Scamander, alright,\" she says and plops down to sit beside him by the Occamy nest. \"Let's save Credence.\"</p>\n<p>\"And his sisters,\" Newt says quickly.</p>\n<p>\"And his sisters too,\" Tina sighs. \"I don't know how we're going to do that though.\"</p>\n<p>\"With care and patience – and little bit of magic,\" Queenie suggests. \"And this fella over here,\" she adds, making Newt turn around, \"might be able to help. Isn't that right, darling?\"</p>\n<p>Newt stares.</p>\n<p>She's scratching Dougal under the chin and, utterly unabashed, the Demiguise croons happily at her.</p>\n<p><em>Terrifying</em> woman.</p>\n<p>Newt has a plan. It's not a good plan but he <em>has</em> one – and Tina begrudgingly admits that it's probably better than any plan that she could come up in single night.</p>\n<p>\"Secretion of a Flesh Eating Slug,\" Newt says triumphantly, holding out a small phial.</p>\n<p>\"You can't be serious,\" Tina answered flatly.</p>\n<p>\"Not the actual slime – the secretion,\" Newt says a little impatiently. \"It has a mild anaesthetic effect – not very strong in terms of humans, the Slug's prey are commonly much smaller than that. They also have the tendency to bolt when ever a Flesh Eating Slug tries to actual eat them, so… mild anaesthetic venom. And if you have enough it's as good as sleeping potion.\"</p>\n<p>The former Auror stares at him for a moment and then looks at her sister who is in the process of cuddling Dougal. Queenie shrugs her shoulders. \"Seems like good plan to me,\" she admits and then smiles brightly. \"And it certainly couldn't happen to a nicer woman.\"</p>\n<p>Newt winces and Tina rounds up on him. \"Mr. Scamader?\"</p>\n<p>\"It… might give you a terrible rash,\" Newt says and backs away a little. \"Nothing dangerous, just… rash. It goes away in couple of days, nothing to worry about.\"</p>\n<p>\"Hmm...\" Tina answers suspiciously and then sighs, running a hand over her face. \"This is what we get for regulating sleeping potions,\" she mutters. \"Not that we should be using potions on No-Majes at all! What are we thinking of!\"</p>\n<p>\"A young wizard in terrible danger,\" Queenie offers. \"And two girls in terrible situation.\"</p>\n<p>Tina sighs at that and shares a look with Newt. \"Alright,\" she says. \"Alright, Flesh Eating Slug secretion it is. But are we sure the Demiguise can do this?\"</p>\n<p>\"Dougal?\" Newt says and then turns to the Demiguise who lazily opens his eyes. With somewhat put off look on his face, Dougal reaches a hand for Newt, and he relieves Queenie of her half-invisible burden. \"He helped me with the girl in Sudan – he was the one got her out, in the end,\" Newt admits while lifting Dougal more securely to his arms. \"This time we'll do better, Dougal.\"</p>\n<p>The Demiguise sighs at that and grabs the phial of venom from Tina's hand.</p>\n<p>\"Alright,\" Tina mutters. \"Let's go knock out a No-Maj.\"</p>\n<p> </p>\n<p>The plan isn't actually to just grab the kids and go, as simple as that would've been – Newt knows by experience that that just flat out does not work well for anyone. Also, Tina vetoed it with strongest words, so he doesn't even have to argue with them.</p>\n<p>What they want, all of them… is to just talk with the children without their mother present. And since she's always present and always watchful from what both Newt and Tina know… they were going to make sure she wasn't alert.</p>\n<p>It's eerie, coming back to the Second Salem Church at late evening. The place is even gloomier in the dim light, with bit of smog hanging about the streets, making everything eerier still. Inside, it's dark except for a slightest glimpse of light coming from the first floor. There is moisture in the air that hangs heavy over everything. It's almost like Mary Lou's… oppressive atmosphere is enough to leak even outside.</p>\n<p>\"Are we sure about this?\" Tina whispers.</p>\n<p>\"No,\" Queenie whispers back, looking a little giddy.</p>\n<p>\"Absolutely not,\" Newt agrees breathlessly and whisks out his wand. \"Disillusion charms might help.\"</p>\n<p>The witches quickly take out their wands and together they Disillusion each other. Leaving all of them looking like heat mirages in the darkness. With the shiver of the cool magic settling over him, Newt shudders and then sets Dougal down onto the street.</p>\n<p>\"Now, you know what you have to do, right?\" Newt asks him. \"Find the woman with short dark hair – not the children. Credence is around twenty, Chastity and Modesty fifteen and eight respectively, and both of them have blond hair.\"</p>\n<p>\"What if she's awake?\" Tina asks under her breath. \"There's still light.\"</p>\n<p>Newt hesitates. The Flesh Eating Slug secretion had to be applied to the skin – which would be hard to miss, when you were awake. Mary Lou also kept such a neat and pristine house that smearing the venom somewhere and hoping she'd touch it herself… that would be beyond risky. She might notice it – and then collect it, and use it in her terrible crusade against magic.</p>\n<p>\"We'll wait until she goes to bed,\" Newt decides.</p>\n<p>\"Hopefully it won't be a long wait,\" Tina says. \"Queenie, can you hear her at all?\"</p>\n<p>\"No, it's too far away,\" Queenie admits. \"I can hear a man over there though and –\"</p>\n<p>Dougal's eyes flash blue and Newt tenses. Split of a second later the Demiguise goes completely invisible and then Newt can feel his hands, pushing him and the witches away, away from the middle of the alley, and into the slightest corner where two buildings meet.</p>\n<p>\"Back up,\" Newt whispers in alarm. \"Quietly.\"</p>\n<p>Dougal pushes them flat against the corner and then holds them there with hairy arms spread across all their shins. Newt can feel Queenie on his left and Tina on his right, and grabs both their hands tensely, waiting for whatever Dougal's sensing.</p>\n<p>Moment later, a man in long dark coat walks into the alley and Newt feels Tina going tense beside him. Though he can feel her taking deep, startled breaths beside him, she's completely quiet and the man doesn't notice them – walking past them with long, confident strides and then pausing at the mouth of the alley, just in the shadow.</p>\n<p>He's looking at the Second Salem Church.</p>\n<p>Dougal quivers against Newt's knees and Tina's grip on his hand is like a vice and then Queenie is pressing very slightly against Newt's side.</p>\n<p>\"That's Percival Graves,\" she whispers, soft as feather, against Newt's ear. \"Tina's boss.\"</p>\n<p>An Auror – and a <em>wizard</em>.</p>\n<p>Newt squeezes Tina's hand, hoping to convey he knows something, that she isn't alone in her alarm. Because a <em>wizard</em> watching the Second Salem Church… There is still the slightest possibility that this Graves wasn't the one healing Credence's hands, but…</p>\n<p>The watch and wait in still, alarmed silence as Graves just watches the church. His back is on them and they can't see his face, but to Newt's eyes his shoulders look a little tense – and they don't relax until the light goes out at the Church. Ten minutes after that… they can hear footsteps.</p>\n<p>It takes effort not to gasp at the sight of Credence, sneaking over the street and into the alley.</p>\n<p>\"There you are,\" Graves says and he sounds relieved. \"Come here, let me have a look at you.\"</p>\n<p>Credence goes to him and then, when Graves touches his cheek, he goes almost completely lax. Newt watches with wide eyes how Credence leans into the touch, looking exhausted and relieved all at once.</p>\n<p>\"Do you have any news?\" Graves asks, stroking a thumb over Credence's cheek, just at the edge of the dark circle under his eye.</p>\n<p>\"I – Mr. Graves, I don't…\" Credence bites his lip. \"I – there was… I don't know,\" he says after a moment and then looks down. \"It would help if I knew whether it was a boy or girl…\"</p>\n<p>Graves sighs, shaking his head. \"My vision only showed the child's power. They're young, no older than ten – and they're somewhere near, near to your mother – that I saw clearly.\"</p>\n<p>\"That could be anyone – hundreds of children come to the church,\" Credence mumbles.</p>\n<p>Graves watches him for a moment as Credence lists tiredly into his hand. The wizard takes the younger man's face into both hands and lifts his face, no doubt higher than Credence himself can lift it anymore. \"There is something I haven't told you,\" Graves says. \"I saw you with me. You brought the child to me, and stayed with me. You want that, don't you? You want to join the Wizarding World.\"</p>\n<p>Newt almost jerks back at that, barely avoiding banging the back of his head against the brick wall and Tina's fingernails are digging into the back of his hand, that's how tight she's gripping his hand.</p>\n<p>\"I want that too,\" Graves says reassuringly, stroking his thumbs under Credence's eyes before releasing him. He runs his hands down Credence's shoulders to his wrists and then pulls them up, looking at his palms. \"Oh, Credence,\" he murmurs and then takes out his wand.</p>\n<p>The spell just barely closes the cuts – and does nothing to the inflammation and redness underneath the tender skin.</p>\n<p>\"Find me that child, Credence,\" Graves says while the young man stares at his healed hands. \"And then we shall all be free to do as we want.\"</p>\n<p>Credence leans forward him, but Graves backs away and turns his back to him – moment later, he's disappearing out in whirl of magic, leaving Credence wavering in the darkness without an anchor. Newt quivers for a moment at the cusp of decision but – no, he can't just stand there, he can't just -</p>\n<p>\"Finite Incantatem,\" Queenie whispers just as Newt jumps over Dougal.</p>\n<p>\"Credence,\" he whispers in hushed tone.</p>\n<p>The young man startles, looking up with wide eyes, looking at him. \"M-Mr Scamander!\" he gasps and stumbles back a step. \"You – you,\"</p>\n<p>\"It's alright, it's okay,\" Newt says, stopping in mid-step and  holding out his hand. \"I'm not coming closer, I'll just stay over here, don't worry. I'm not going to do anything. Are you alright?\"</p>\n<p>Credence sways where he stands a little and for a moment he looks like he's about to bolt. \"Mr. Graves – you saw –\"</p>\n<p>Newt presses his lips together for a moment, swallowing the urge to tell just <em>what</em> he'd seen. And what he'd heard. He doesn't know who this Graves is, but he knows what the man is after – how he knows about it, Newt has no idea, but somehow the man's backtracked the Obscurus to the Second Salem Church.</p>\n<p>\"Are you alright?\" Newt asks quietly, keeping his hands within Credence's sight.</p>\n<p>The young man gasps a few breaths and nods his head. \"You saw,\" he whispers.</p>\n<p>\"He doesn't know it's you?\" Newt asks.</p>\n<p>Credence's face crumbles at that and he looks at his feet, his neck almost at a painful angle. \"I don't – I haven't…  I don't know how to tell him. I don't think… he wants it to be me,\" He admits and his lips twist. \"He wants the child, not… not me.\"</p>\n<p>There's a sound like a sob behind Newt and he quickly holds out a hand to keep Queenie and Tina back. It's too late, though – Credence heard.</p>\n<p>\"Who's there?\" The young man asks in alarm.</p>\n<p>\"Two friends of mine,\" Newt says soothingly. \"They were going to help me. I wanted to talk to you, and your sisters, without your… without Mary Lou stopping us.\"</p>\n<p>\"Why can't I see them?\" Credence asks nervously and starts inching backwards.</p>\n<p>\"Finite Incantatem,\" someone whispers and then Queenie and Tina are both visible.</p>\n<p>And Queenie is crying without shame or restraint, fat tears rolling down her cheeks.</p>\n<p>\"It's an invisibility spell. We didn't want to be seen by Mary Lou,\" Newt explains softly, holding one hand back to the witches to keep them from coming forward and alarming the young man, and holding one hand towards Credence. \"It's alright, they're not going to do anything.\"</p>\n<p>\"You – you were going to sneak in?\" Credence asks.</p>\n<p>\"We want to help you, Credence,\" Tina says quietly.</p>\n<p>\"Honey, sweetheart,\" Queenie sobs.</p>\n<p>Newt waves them both to be quiet – they're treading on very thin ice right now, and Credence is on the brink of running away and that will ruin everything.</p>\n<p>\"W-what is that?\" Credence asks, and he's looking down now, down to where Newt can feel a gentle tug at his trouser leg.</p>\n<p>\"This is Dougal – he's a Demiguise,\" Newt says and then, after weighing the situation, he kneels down to let Dougal crawl to his arms. The Demiguise is thoroughly spooked and trembling – whatever potential futures he'd seen with Graves, they terrified him. \"He was going to help us well. Don't worry, he's perfectly harmless.\"</p>\n<p>Credence stares at the creature in blank astonishment. \"W-what is a demi-guis?\"</p>\n<p>\"It's a magical creature,\" Newt says, realising that for all the things Credence knew, Graves probably hadn't actually told the young much anything about what the Wizarding world was like. \"There are hundreds of magical creatures out there, protected by the Statue of Secrecy that keeps the magical and non-magical worlds apart. Dougal is one of them. I'm sorry, Credence, I did lie to you a bit before – I am not actually zoologist. I am a magizoologist. I study and nurture, take care of specifically magical creatures, like Dougal here.\"</p>\n<p>Credence stares at Dougal for a moment and then looks at Newt. \"Am I a magical creature?\" he whispers almost pleadingly</p>\n<p>Tina draws a breath and Queenie's breath hitches in another sob. Newt hesitates and then smiles. \"Yes. You are,\" he says. \"And I would very much like to take care of you.\"</p>\n<p>\"Mr. Scamander,\" Tina hisses. \"Credence isn't –\"</p>\n<p>\"W-would you take me away?\" Credence asks. \"Right now, would you take me away?\"</p>\n<p>Newt eyes him steadily even while the ground seems to shake under him. \"Yes,\" he admits. \"I would.\"</p>\n<p>Credence wavers, almost stepping closer to him, almost taking his outstretched hand. \"But what about – Mr. Graves and the child and – and my sisters…\"</p>\n<p>\"There is no child, Credence – it's just you,\" Newt says. \"And I would very much like to take your sisters too.\"</p>\n<p>\"Mr. Scamander – you can't just <em>take</em> people,\" Tina whispers furiously.</p>\n<p>\"Just watch me,\" Newt mutters and then takes a step closer to Credence. \"I don't know what Mr. Graves has promised you, Credence, I probably can't promise you the same things and I'm not going to try. I live on the foot, I travel around – I wasn't even supposed to stay here, I wouldn't have if it hadn't been for your family. But I swear – I will never hurt you. Never.\"</p>\n<p>Credence shakes his head in confusion.</p>\n<p>\"Show me your hands, please,\" Newt coaxes. With Dougal clinging to him around the neck, Newt takes out his wand and then presses the tip against the base of Credence's broken finger. He casts first a numbing spell and then straightens the bone before clearing out the joint. Then, while Credence stares at the suddenly functional finger, Newt takes his other hand and fixes the severed tendon as well.</p>\n<p>\"You know healing?\" Tina asks with mixed tone.</p>\n<p>\"Part of the job, I'm afraid,\" Newt says, wrapping an arm around Dougal's hairy back. \"I take care of a lot of abused creatures. And they almost always need healing.\"</p>\n<p>\"Huh,\" Tina answers.</p>\n<p>Credence flexes his hands and then looks up at Newt in wonder. \"I don't… know if my sisters will want to come,\" he admits in a whisper.</p>\n<p>\"We should talk to them about it,\" Newt says gently and takes out the phial of Flesh Eating Slug secretion. \"I don't suppose you could smear a bit of this on Mary Lou's arm? It will keep her sound asleep while we talk.\"</p>\n<p>Credence blinks and then, after a moment of hesitation, takes it. \"It won't hurt her?\"</p>\n<p>\"There might be a bit of a rash, but… no, she'll be fine by morning,\" Newt admits. \"Make sure not to touch it yourself, alright?\"</p>\n<p>Credence stares at the phial. \"You promise you'll take me away?\" he asks. \"You <em>promise</em>?\"</p>\n<p>\"Yes,\" Newt says firmly. \"I <em>promise</em>.\"</p>\n<p> </p>\n<p>While they wait for Credence's sign that everything is safe, Newt looks at Queenie. She wipes at her eyes, letting out the occasional heartbroken sob that makes Tina frown and Newt wince.</p>\n<p>\"This is why I didn't bring you here,\" Tina murmurs to her sister, wrapping an arm around her shoulders and rubbing her upper arm.</p>\n<p>\"I-it's so terrible. That poor boy, he's in so much pain, he's so scared – and <em>him</em>!\" Queenie almost wails. \"Why? <em>Why</em>?\"</p>\n<p>Tina frowns and looks at Newt. \"That was the Director of Magical Security at MACUSA,\" she says darkly. \"I don't… I don't know why he was here, but… Queenie, did you get anything from him?\"</p>\n<p>\"No, nothing,\" she admits with a sob. \"He's Occluded. But Credence – he's seen Credence a lot, and it's always… \"</p>\n<p>Newt strokes Dougal's back distractedly and then looks towards the church. \"He's looking for the Obscurial,\" he muses. \"He doesn't know who it is, just that it's somewhere here.\"</p>\n<p>\"He is the head of the investigation about the incidents but –\" Tina frowns. \"How would he know it's an Obscurial? I didn't know it was an Obscurus behind it all – as far as I know, we're – they're looking for a wizard with a new destructive spell and chip on their shoulder not… a creature.\"</p>\n<p>Newt glances between them and church. \"Powerful child under age of ten,\" he says then, looking down at Dougal. \"Close to Credence's mother… well Second Salem Church <em>is</em> the perfect place for a Obscurial to appear. I don't know how your Mr. Graves knows about Obscurials, but that's what he's looking for.\"</p>\n<p>He turns to Tina, eying the wall beside her. \"How did you end up in your… alteration with Mary Lou Barebone?\"</p>\n<p>\"We… we were investigating the Church,\" Tina admits. \"Their info was too good, they had list of features, how to recognize a witch, information about our wands, things like that. With what's happening in Europe, we didn't want a No-Maj stirring trouble any here. I was under cover, following them around when… well,\" she looks down. \"I saw that woman beating Credence for the slightest thing, and I couldn't help myself. I stepped in.\"</p>\n<p>\"Was Mr. Graves involved?\" Newt asks.</p>\n<p>Tina swallows and then nods. \"It was handled as internal investigation – they always are, when an Auror attacks a No-Maj,\" she admits. \"He's the one who Obliviated the family… and demoted me. And I was forbidden of going anywhere near the Second Salemers again.\"</p>\n<p>Newt nods slowly and looks at the church. \"It's interesting,\" he murmurs. \"Considering Mary Lou's crusade against magic… one would think Mr. Graves would've Obliviated her a bit more thoroughly. She still knows a lot about magic.\"</p>\n<p>Tina frowns. \"You think he…\"</p>\n<p>\"I don't know,\" Newt says honestly. There were a lot of shoddy obliviations happening here – and Graves, the way he'd treated Credence, the way he obviously had been treating him… \"It all has a sinister ring to it, doesn't it?\"</p>\n<p>The church door opens and Credence peeks out, waving a hand at them.</p>\n<p>\"Mr. Scamander,\" Tina says, looking at the church. \"Can you promise me you can take care of those children?\"</p>\n<p>\"No,\" Newt admits. \"But I can promise you I will damn well <em>try</em>.\"</p>\n<p>The witch frowns a little at that and then nods. \"I suppose that's more than anyone else is promising,\" she murmurs and then sighs. \"If anyone else finds out about this, I'm going to be <em>killed</em>.\"</p>\n<p>\"Bit harsh,\" Newt comments.</p>\n<p>\"It's a harsh sort of time,\" Tina says grimly. \"Queenie, are you good to go inside?\"</p>\n<p>The blond switch sniffles, taking out a handkerchief. \"Yes,\" she says. \"I'm… good. And don't worry, Newt – I'll try not to make things worse. I'll try not to… I'll be good.\"</p>\n<p>Newt glances at her. Part of him wants her to go, because her reaction to Credence was hardly helping anything… but Credence's sisters. They hadn't suffered quite as much at Mary Lou's hands and there was Modesty's vile song…</p>\n<p>He'd need Queenie's read on them to be sure.</p>\n<p> </p>\n<p>Modesty and Chastity are both bleary with sleep – or they were up until the moment they see Dougal in Newt's arms and then they are wide awake.</p>\n<p>\"What is <em>that</em>?\" Modesty asks with wonder.</p>\n<p>\"Oh, he's a Demiguise. His name is Dougal. Say hello, Dougal,\" Newt says, and the Demiguise waves a long fingered hand at the girls. \"Don't worry, he's perfectly harmless.\"</p>\n<p>\"Mother doesn't like animals in the church,\" Chastity says nervously.</p>\n<p>\"She's asleep,\" Credence says and looks away when his sisters both look up at him sharply. \"I – she's sleep. She won't wake up.\"</p>\n<p>\"What did you <em>do</em>?\" Chastity asks with hushed, anxious voice.</p>\n<p>\"It's alright,\" Newt says, looking between them and glancing at Tina and Queenie. Tina looks a little awkward in the presence of the two Muggle girls, but Queenie – she's covering her mouth in hands, looking wide eyed.</p>\n<p>\"I wanted to talk with you,\" Newt says soothingly. \"And I don't think your mother would have given me the chance. So, she's asleep – she'll be fine by morning.\"</p>\n<p>Chastity looks between him and credence anxiously. \"Who are you?\" she then demands to know. \"What do you want?\"</p>\n<p>Newt licks his lips nervously. \"How about we sit down?\" he asks, motioning at the table where they'd had their bland dinner just some hours ago. \"I just want to talk. These two,\" he motions at Tina and Queenie. \"Are friends of mine, they're just here to help.\"</p>\n<p>\"Help with what?\"</p>\n<p>\"With me, talking to you,\" Newt says with a faint smile and sits down. \"It's alright. We'll just talk, alright?\"</p>\n<p>Credence is the first to sit down – and he sits right beside Newt, looking both embarrassed and determined as he does so, staring at the table rather than meeting anyone's eyes. Newt smiles brightly at him, and then at the girls who slowly follow suit, Modesty still eying Dougal while Chastity looks between Newt and Credence.</p>\n<p>\"Who are you?\" Chastity asks slowly.</p>\n<p>Newt takes a breath. \"My name is Newt Scamander… and I am a Wizard.\"</p>\n<p>The girls look confused – alarmed and confused. They share looks with each other and with Credence who shrugs his shoulders awkwardly and looks at the table between them.</p>\n<p>\"Wizard,\" Chastity says. \"Is that like a… <em>witch</em>?\"</p>\n<p>\"That… depends entirely on what you mean when you say the word, <em>witch</em>,\" Newt says very carefully. \"Because there are witches and then there are <em>witches</em> and really, it's all in the context.\"</p>\n<p>\"Witches are evil horrible women who prey on good people and do evil things,\" Modesty says promptly. \"They bewitch people and things and they make world a evil place.\"</p>\n<p>Newt eyes her and tries not to look too sad. \"Then no, wizard is not at all like a <em>witch</em>. And let me tell you a secret, a witch isn't at all like a <em>witch</em> either.\"</p>\n<p>\"That doesn't make sense,\" Modesty snaps. \"Are you a <em>witch</em> or not?\"</p>\n<p>Newt bites his lip and glances at Tina and Queenie. Tina slowly takes a seat beside her, while Queenie is trying to swallow around the choked sobs that seem to have gotten caught mid throat.</p>\n<p>\"The word dog, or a tat, or any number of words, they can be used for lot of things,\"  Tina says slowly, also very carefully. \"When you call dog a dog, or rat a rat, you're just telling it as it is. But when you call a <em>person</em> a dog or a rat, that's a whole different thing. I think your <em>witch</em> is a little like that.\"</p>\n<p>Newt just barely stops himself from beaming like loon at her, and instead looks at the girls. Chastity looks confused and conflicted but Modesty is scowling. \"Are you a witch?\" she demands to know, staring at Tina.</p>\n<p>\"I'm not a <em>witch</em>,\" Tina says, putting nasty pressure on the word. \"But as a woman who does magic… I am what's known as a witch.\"</p>\n<p>Modesty screams. It's a shrill, terrible scream, the sort that should by reason make windows shake and glass shatter. Tina startles badly at it, almost goes for her wand, but Newt grabs at her, keeps her hand down. In his lap, Dougal barely even bats an eye.</p>\n<p>\"Modesty,\" Chastity says quickly, her eyes wide with fear while Credence squirms where he sits, almost jumps to his feet \"Modesty, <em>be quiet</em>!\"</p>\n<p>Modesty isn't quiet – she just screams. Newt eyes her with his eyebrows shot up and then motions Chastity to sit back down. He doesn't know much about children, or people in general, but he knows when an animal is showing a fear response, he knows when they put up a show to try and appear threatening, to ward of challengers and threats.</p>\n<p>And he knows how to react to that.</p>\n<p>As uneasy as Credence is, he follows Newt's lead and as horrified as Tina is she does the same – and of course, Queenie just flat out reads his mind and knows what he thinks. Chastity, after moment of wide eyed staring, follows their lead as well, leaning back looking uneasy.</p>\n<p>Modesty screams – until she realises that no one is doing anything about it. After a moment her voice stutters and when she has to draw for breath she falls quiet, looking a little confused – no doubt, little girl screaming usually had more of an effect on people.</p>\n<p>Newt just arches his eyebrows at her and the silence stretches a little longer. After a moment… Modesty shifts where she sits, looking embarrassed.</p>\n<p>\"Let me tell you about what witches are like,\" Newt says, as if nothing had happened at all. \"A witch is a little girl who maybe makes her favourite toy float at age of six, or whose hair turns a different colour at age of eight because the most popular girl has hair like that and she wants hers to be just like it…\"</p>\n<p>Tina watches him, first with astonishment and then with understanding as Newt explains, in a roundabout sort of way, how actual witches are like. How they went to school and did their homework, had pets and joked about with their friends and played games. Normal things kids did.</p>\n<p>\"And eventually they flirt with wizards, if they feel like it,\" Tina then says. \"And they get jobs, some of them boring jobs in boring offices, doing boring office things. And one day they might get married and have kids who, too, might be witches.\"</p>\n<p>The girls are quiet for a moment, staring at them. \"But… they're <em>evil</em>,\" Modesty says with a scowl, like trying very hard to try and make them understand.</p>\n<p>\"No more or less evil than any other woman,\" Tina says and looks up to the stairs leading to the second floor. \"All people have capability of being evil or being good, whether or not they have magic or not. And actually, I am the sort of witch who goes after evil witches – I'm an Auror. It's my job to stop people from doing evil things.\"</p>\n<p>\"That's a little like police officer, but magic,\" Newt explains, and they both ignore the fact that she's suspended.</p>\n<p>Modesty frowns at that, obviously not sure what to make of any of it. Chastity is little more reserved with her reaction – and instead of looking either Newt or Tina – or Queenie who still can't seem to speak – she's looking at Credence.</p>\n<p>\"What are they doing here?\" Chastity asks her brother. \"Credence, why are they <em>here</em>?\"</p>\n<p>Credence opens his mouth, closes it, and then looks helplessly at Newt and shakes his head. Newt looks him over and then meets Chastity's serious eyes over the table – difficult, but he manages it. \"We're here… because any woman who hurts her children is evil,\" he says slowly. \"And it doesn't matter if I'm a wizard – that's wrong and I can't just sit back and watch that happen. I only want to help you.\"</p>\n<p>Chastity swallows and leans back while Modesty looks down, frowning.</p>\n<p>\"He's going to take me away,\" Credence says with choked voice and doesn't look up. \"And I'm going. I'm <em>going</em>.\"</p>\n<p>\"Credence,\" Chastity whispers.</p>\n<p>\"You <em>can't</em>!\" Modesty says, now looking horrified. \"Mommy will be mad! Mommy will be so mad – you can't go, Credence! You can't make Mommy mad!\"</p>\n<p>Credence folds under the words a little and, awkwardly, Newt reaches out to lay a hand on his shoulder. The young man's shaking under it. \"It's alright,\" Newt says to him and then looks at the girls. They're so pale, so wide eyed – they look cold, and scared. It's terrifying, how much it hurts, for them to look scared. \"I'll take you away too,\" he says because what else can he say?</p>\n<p>\"Newt,\" Tina says and this time she's the one who silences him. She leans forwards, leaning her elbows on the dining table between them. \"Girls, you don't have to stay here, with <em>her</em>, if you don't want to. You don't have to go with him, either, no one's forcing you – we're just offering. You don't have to stay here.\"</p>\n<p>\"Newt will never hurt you,\" Queenie finally manages to speak, though her voice is strangled and faint. \"Not a single one of you. Not ever.\"</p>\n<p>Chastity rubs at her arm, staring at Credence and Newt, looking terribly conflicted. \"But…\" she starts and then looks down, frowning.</p>\n<p>\"But we have to stay here,\" Modesty says, confusedly. \"Mommy says we're safe here – Mommy keeps us safe from witches.\"</p>\n<p>\"Sweetheart, there are very few witches who are anywhere near as bad as your mother,\" Tina whispers and Modesty scowls at her.</p>\n<p>Newt looks down, at Dougal who is getting a little restless in his arms now. He releases the Demiguise, and slowly Dougal clampers up his arms, to sit on his shoulders, looking around. The girls watch him with a frown.</p>\n<p>\"Why does his eyes glow?\" Chastity asks nervously after a moment.</p>\n<p>\"Ah, Demiguises have some precognitive abilities – when his eyes glow, he's seeing the future, just a bit of it,\" Newt answers, leaning his head back a little as Dougal tugs at his hair. \"It makes Demiguises very clever at hiding, because they can see when people find them in the future, and then they just avoid it. Though the fact that they can turn invisible also helps.\"</p>\n<p>\"It's magic?\" Modesty asks with shock. \"But it's a monkey!\"</p>\n<p>\"An ape, actually, and a wilful one at that,\" Newt says and then makes a face as Dougal starts shifting through his hair. \"Dougal, honestly, my hair is <em>fine</em>.\"</p>\n<p>The Demiguise just scoffs at him, and pushes the hair down flat, and right over Newt's eyes. Tina bites her lip, smothering a chuckle and the girls just stare.</p>\n<p>\"Sorry,\" Newt says somewhat resignedly, even while grinning from under the heavy fringe of increasingly messy heir. \"Seems like it's social grooming time. Just ignore him.\"</p>\n<p>That makes Chastity smile, just a little bit, which he considers something of a victory. \"I didn't know there were magic animals,\" she says.</p>\n<p>\"There's a whole bunch of them,\" Newt says. \"And other magical beings too. Goblins, dwarves, elves – Centaurs boarder on the line a bit, but personally I consider them beings. There's mermaids,\" he adds, vaguely recalling that lot of little girls like that sort of thing. \"Though we just call them merpeople – the male merpeople object to being called mermaids, you see.\"</p>\n<p>\"Mermaids?\" Chastity asks incredulously.</p>\n<p>Modesty's eyes are wide. \"Are there – are unicorns real?\"</p>\n<p>\"Oh yes – there was a whole herd of them in the forest by the place where I went to school,\" Newt says with some nostalgia. \"I used to sneak out on weekends to see them.\" The centaurs used to chase him out after a while, but it was always worth it.</p>\n<p>\"Unicorns,\" Modesty whispers in wonder.</p>\n<p>Credence glances at Newt hesitantly and Newt smiles from beneath the fringe of hair that's covering most of his vision. It was going remarkably well now, wasn't it? That's the thing about the wonder of magic – people might be terrible, but magic was still <em>magic</em>.</p>\n<p>\"But… why?\" Chastity asks. \"Why would you… no one does anything without reason. What do you want from us?\"</p>\n<p>Newt frowns a little at that, looking at her. There's something in her voice that he doesn't understand but it makes him nervous.</p>\n<p>Tina and Queenie obviously understand it, though, because Tina frowns and Queenie's breath hitches a little.</p>\n<p>\"Chastity,\" Tina says slowly, obviously looking for something to say.</p>\n<p>\"No,\" Queenie says instead and stands up. \"Chastity, honey, come with me, please.\"</p>\n<p>\"Queenie?\" her sister asks worriedly.</p>\n<p>Queenie smiles and holds out her hands to Chastity. \"We'll just go over there and talk, woman to woman, alright?\"</p>\n<p>Chastity hesitates for a moment, looking at Credence – which is just the moment when Dougal decides he's gone through Newt's hair well enough to. Without as much as by your leave the Demiguise bounces off Newt's shoulders – and to Credence's.</p>\n<p>\"Dougal!\" Newt snaps and reaches for him as Credence gives him a wide eyed look, shoulders slouching tightly. The Demiguise gives Newt a flat look and then smoothes long fingered dark hand a hand over Credence's hair – and Credence stills.</p>\n<p>\"Alright there, Credence?\" Newt asks, watching the young man and the Demiguise who is starting to dig through Credence's strict haircut.</p>\n<p>\"Um,\" Credence says, holding very still. \"What is he doing?\"</p>\n<p>\"Looking for lice,\" Newt answers with sheepish smile and pushes his very messy hair back and away from his eyes. \"Demiguises need their fur nice and clean to turn properly invisible – can't have any sort of pests. It's also social bonding.\"</p>\n<p>Credence stares at him, blinking and looking upwards to try and see the Demiguise – but Dougal is behind his head now, peering intently at Credence's scalp.</p>\n<p>\"I can take him if you want,\" Newt promises.</p>\n<p>\"No, it's… it's fine,\" Credence answers, frowning a little. \"He's not heavy.\"</p>\n<p>\"He's mostly fur,\" Newt agrees.</p>\n<p>On the other side of the table, Queenie gently coaxes Chastity to her feet and walks her to the other end of the long table, where she speaks to her in hushed voice for a moment. Newt glances their way nervously, but after a initial moment of nervousness Chastity seems to relax and actually listen to Queenie.</p>\n<p>Tina shares a look with him and shrugs. \"Legilimens,\" she says as way of explanation and shakes her head.</p>\n<p>\"Right,\" Newt agrees and then looks at Modesty.</p>\n<p>Modesty is staring at Credence and Dougal. \"I thought animals were <em>dirty</em>,\" she says confusedly.</p>\n<p>\"No, they're actually very tidy most of the time,\" Newt says and grins. \"Keeping your coat, whatever that coat is made of, clean keeps you warm, safe, water proof and can attract mates. And in Dougal's case, it helps you go invisible too.\"</p>\n<p>\"Huh,\" she says and looks down frowning.</p>\n<p>\"Are you alright?\" Newt asks.</p>\n<p>\"Witches,\" she says and looks up. \"Are evil and they're going to bewitch us and do evil things.\"</p>\n<p>Newt arches his eyebrows. \"Do we seem evil, Modesty?\" he asks gently.</p>\n<p>She pouts and looks up at Credence and Dougal who's properly messing up Credence's hair. \"Mommy never said anything about magical <em>monkeys</em>,\" she mutters. \"Monkey can't be a witch, can it.\"</p>\n<p>\"No, not really, no. Only people can be witches,\" Newt admits and leans in. \"And I think only <em>evil</em> people can be <em>witches</em>.\"</p>\n<p>Tina sighs. \"All this word play,\" she murmurs. \"They're called <em>dark</em>, evil things,\" she says to modesty. \"Dark witches and dark wizards, they're the evil ones. And dark creatures –\"</p>\n<p>\"Ah-ah,\" Newt intersects quickly. \"Every magical government has it's own list of what creatures are dark and I seem to recall that yours include <em>phoenixes</em>.\"</p>\n<p>\"Phoenix song affects people's emotions – any creature with clear and definite ability to manipulate humans or their emotions is by definition <em>dark</em>,\" Tina says sternly.</p>\n<p>\"Phoenixes are the most light creatures there are! Their songs light people's spirits and their tears have healing powers! You can't call phoenixes dark, that's just ridiculous,\" Newt says incredulously</p>\n<p>\"Mr. Scamader –\"</p>\n<p>\"Mr. Goldstein,\" Newt answers and then turns to Modesty. \"Some magical creatures are by their nature more dangerous than others, and they have their own capabilities and defence mechanisms, but Dark Creature is a ludicrous political term you shouldn't subscribe to. It has no bearing what so ever on what animals are really like in their natural habitats.\"</p>\n<p>Modesty blinks at him with confusion.</p>\n<p>\"I think you're little too early to be teaching her about politics of creature registry,\" Tina says dryly and shakes her head. \"Dark wizards and dark witches are evil – we can at least agree on that.\"</p>\n<p>\"Yes,\" Newt says slowly and frowns. \"Reckon it might be for the best we don't get into dark magic though.\"</p>\n<p>\"Oh,\" she says and turns to face him. \"Dark magic, hm?\"</p>\n<p>Newt leans back a little. \"I don't suppose you could forget I ever said that?\" he asks regretfully.</p>\n<p>Tina narrows her eyes. \"We'll be talking about that later.\"</p>\n<p>\"Arguing you mean,\" Newt mutters uneasily.</p>\n<p>On the other side of the table Modesty giggles, watching them. Newt's heart leaps a little at the sound of it, and he grins at her brightly.</p>\n<p>Then he hears a sob coming from the other end of the table and they all turn to look at Queenie and Chastity  - and it's not Queenie who's crying now.</p>\n<p>It's Chastity.</p>\n<p>\"Newt,\" Queenie calls, one hand on Chastity's hair, stroking gently as the girl sobs into her hands. \"Come here for a moment.\"</p>\n<p>Newt shares a look with Tina and then another with Credence. \"Alright?\" Newt asks him and the young man nods with a slight frown. Newt touches Credence's shoulder and strokes a hand over Dougal's head before rising and going to the other end of the table.</p>\n<p>Queenie smiles up at him with waver on her lips and tears in her eyes. \"Chastity, darling – show him,\" she says gently. \"It's alright, I swear – just show him.\"</p>\n<p>Chastity's breath hitches and she looks up at Newt, quivering a little – and then, very carefully keeping Queenie between her and the other end of the table so that no one else saw… she bares her arm.</p>\n<p>It's covered in thin cuts.</p>\n<p>Not belt marks like Credence's hands, but thin, sharp lines that run all over her arm, slicing the skin to ribbons. Some of them are older than others, some are healed into faint pale scars – going back years from what Newt can tell. Others are so new they're barely scabbed over, red and swollen on her pale, scar ridden skin.</p>\n<p>Newt falls to his knees on the floor beside Chastity's chair and almost whines out loud as he reaches for his wand. Chastity almost pulls her hand away but Queenie soothes her with gentle whisper and she keeps holding her arm out, shaking like a leaf.</p>\n<p>The wand shakes in Newt's fingers as he begins healing the cuts. Not all of them – lot of them are far too old to be healed, on the process of healing naturally. The scars he can't do anything about, and they remain, pale white slashes across Chastity's skin. But at least he can soothe away the scabbed wounds, ease down the inflammation – help with the pain.</p>\n<p>Queenie watches him over Chastity's pale arm and tear slips loose, running down her cheek. She doesn't say anything, but when their eyes meet, Newt can hear it in his head.</p>\n<p><em>She did this to herself. Punishing herself… because her mother wouldn't</em>.</p>\n<p>Newt swallows around the ball of <em>pain</em> suddenly lodged in his throat and looks down as Chastity offers him her other arm – just as pale and just as wounded. He shakes as he does what he can for it, running wand tip over recent cuts and healing them, but the scars – there are <em>so many</em> scars…</p>\n<p>\"Chastity?\" he asks urgently. \"Chastity, can I hug you?\"</p>\n<p>Chastity shakes and her breath comes out in a terrible, wounded whine – and moment later, Newt is gathering her into his arms, whispering something into her hair and holding her close. She trembles against his chest and starts to cry in earnest, in dreadful wretched way Newt doesn't know or understand but it hurts.</p>\n<p>Newt has never cared about people like this, this <em>much</em>, and it hurts.</p>\n<p>Queenie keeps stroking Chastity's hair gently, barely withholding her own sobs as she leans in to kiss Chastity's hair. \"It's alright, sweetheart,\" she whispers. \"It's alright, it's alright, it's alright…\"</p>\n<p>It's obviously not, though. Not at all.</p>\n<p>\"What's wrong with her?\" Credence's voice asks and suddenly he's here, Dougal clinging to his shoulders as he crouches by Newt and Chastity. \"What's wrong with her, is she hurt – did <em>mother</em> –\"</p>\n<p>Newt doesn't answer – just throws an arm around his shoulders and pulls him in too. It's being awkward, the angle is awful, Credence's forehead almost bangs against Newt's, but he just wants to keep these kids close – and it doesn't even matter that Credence is technically a grown man –</p>\n<p>\"I'll make this right,\" Newt says, clasping his palm securely over Credence's trembling neck. \"I'll make this <em>right</em>.\"</p>\n<p>\"What's wrong with her?\" Credence asks desperately, touching his sister's shaking shoulder tentatively, like afraid of hurting her. \"Chastity, what's wrong? Chastity?\"</p>\n<p>Chastity just keeps on crying.</p>\n<p>\"She'll be fine, honey,\" Queenie chokes out. \"Let her cry. She hasn't been able to cry in years – just let her cry.\"</p>\n<p>Credence makes a face like it hurts – and it probably does too. Newt squeezes his neck and pulls Chastity closer and then looks up – and there is Modesty, standing over them with wide eyed look about her pale face.</p>\n<p>\"Did Mommy hurt Chastity too?\" she asks quietly and looks up when Tina comes next to her and places a hand on her shoulder.</p>\n<p>\"I think maybe your mother hurt you all, in different ways,\" Tina says and crouches down beside the girl, taking her hands in hers. \"And you shouldn't hurt other people. Do you understand, Modestly? Nobody should hurt other people.\"</p>\n<p>Modesty frowns at her siblings and then looks down. \"Is Mommy a <em>witch</em>?\" she asks quietly.</p>\n<p>\"You know, I think she might be,\" Tina says miserably.</p>\n<p>Modesty makes a face and then steps closer, kneeling by Chastity. She squirms between them, like scared cub burrowing into her mother's side, and Newt makes space for her, as much as he can, looking down at them. Merlin, he has no idea what he's doing, and everything is terrible – he's always known people are terrible but this is even worse and he doesn't know what to do. He just wants to fix this.</p>\n<p>Queenie smiles, her lips trembling. \"Just hold them,\" she says. \"Just hold them.\"</p>\n<p>\"That's not enough, though, is it?\" Newt whispers.</p>\n<p>\"No,\" she admits. \"But it's a good start.\"</p>\n<p>Chastity's sobs eventually quiet down to tired snuffling and Credence's look of concern eases into stiff awkwardness and Modesty gets bored and starts playing with Newt's tie, tugging at it and eventually undoing it completely.</p>\n<p>\"Now what?\" Tina asks quietly from where she's hovering, now a bit awkward.</p>\n<p>Newt doesn't know – his legs have gone a little numb and his shoulders are aching with the effort of holding everything in. He feels drained in a way he never has before, kind of hollowed out – like some terrible creature had sucked out all of his insides. Probably best he doesn't say that out loud.</p>\n<p>Queenie laughs and strokes her hand over Chastity's hair before standing up. \"I think you should decide whether or not you're leaving, now,\" she says.</p>\n<p>The kids look up and Credence's hand, which Newt hadn't even noticed before, twists where it's holding the back of newt's coat. Chastity pulls away and Modesty looks down, frowning and worried.</p>\n<p>\"Are we… are we really leaving?\" Chastity asks. \"Can we really do that?\"</p>\n<p>\"Well,\" Newt says. \"Yes.\"</p>\n<p>\"But,\" Tina adds, giving him a pointed look.</p>\n<p>\"But technically it will be me kidnapping you,\" Newt adds with a sigh and looks at them. \"Which isn't bad for you – I mean, it's, uh. Technically a crime, but it's my crime and if I get caught, er…\"</p>\n<p>Tina sighs and shakes her head. \"Law isn't really on our side,\" she admits, giving the children an awkward smile. \"Truth be told, we shouldn't even be here. You're No-Majes and we aren't supposed to interact with people like you at all, never mind… doing something like this. We'd get in terrible trouble, if people found out.\"</p>\n<p>Credence frowns and looks up. \"You're not supposed to… talk with us?\"</p>\n<p>\"Not by America's laws, anyway,\" Newt says. \"Things aren't quite as strict in Britain and rest of the Europe, but from what I recall the States have some bad experiences.\"</p>\n<p>\"The witch trials – I bet you've heard of those?\" Tina asks quietly and all three of the Barebone children frown at that. \"Yeah – those were real. And there are people, non magical people, around who still think like that. And it's… dangerous not just to us but to you, if things go back to that. It was different back then – there weren't that many of us magical people, witches and wizards, around back then. Now… now there's a lot more. Now it might mean war.\"</p>\n<p>\"War… like the Great War?\" Chastity asks quietly.</p>\n<p>\"Something like it,\" Newt says and pats her side. \"But worse, because we're not really two different nations far apart – we're all intermingled. Where ever there's people, there's wizards too. You can't really draw a line in between.\"</p>\n<p>\"It would be a global civil war,\" Tina says grimly. \"And once it started somewhere, it would spread everywhere. And we can't let that happen. And that's why we're generally forbidden from telling anything to non magical people. Secrecy is what protects everyone.\"</p>\n<p>Credence frowns. \"But… I thought wizards were stronger,\" he says slowly. \"Than non-magical people. It wouldn't be much of a war, right?\"</p>\n<p>Newt blinks and then glances at Tina who frowns.</p>\n<p>\"Well… that's not really true,\" Tina says slowly, watching the young man keenly. \"There's lot more of them than there are us. And the Great War proves that the non magical people are lot better than us when it comes to waging war. Sure, we have magic… but we don't have armies. We don't have soldiers. And we don't really have anything in way of warfare, not like No-Majes do.\"</p>\n<p>Newt watches the confusion dawn on Credence's face and then how it shutters a little, how his lips thin. Something of what Tina was saying did not go along with whatever Mr. Graves had told him, it looks like. Tina seems to realise it too because her face goes very serious. \"Credence,\" she says slowly. \"I would very much like to know what Mr. Graves told you?\"</p>\n<p>\"Who's Mr. Graves?\" Chastity asks, looking at her brother confusedly.</p>\n<p>Credence swallows and looks away.</p>\n<p>\"We can deal with that later,\" Newt decides because they're all high strung enough has it is. \"Right now though… I want to steal you away,\" he says and looks at all three of the Barebone children in turn. \"Do you want to come with me?\"</p>\n<p>Credence nods, not meeting his eye. Chastity wipes at her eye. \"Right now?\" she asks with quiver of a voice. \"Do we have to go <em>right now</em>?\"</p>\n<p>\"Honey,\" Queenie says, picking Dougal from the floor and lifting him into her eyes. \"You know if you stay, if you give your mother word edgewise… and if she finds out...\"</p>\n<p>Chastity shudders and looks down. Credence takes her hand in his and grips tight until finally, she too nods.</p>\n<p>Modesty makes a face and looks up at Newt. \"Where are we going?\" she asks.</p>\n<p>\"Well, that's the fun part,\" Newt says and smiles. \"You're going into my suitcase.\"</p>\n<p> </p>\n<p>Newt, Tina and Queenie help the children pack their things. They have precious few things they want to bring with them – some clothes, all of which are in shades of grey and black, couple of hairbrushes and hair ties, no toys. Credence has a book, a blank journal he eyes for a moment and then leaves it where it is, sitting by the worn down bible at his bedside.</p>\n<p>Modesty has a wand.</p>\n<p>\"Now where did you get that?\" Newt asks with interest, crouching by her as she comes away with it from under her bed.</p>\n<p>\"I found it – it's just a toy, though,\" Modesty says and holds it in her hand delicately. \"It doesn't do anything.\"</p>\n<p>Newt eyes her thoughtfully and then takes the wand in his hand. \"Well I don't know. To me toys do lot of things – dead useful things, toys. I have a whole room just filled with toys – mind you, they're toys for magical creatures, but toys are toys. Good for keeping you occupied, stimulated and distracted and keeping you happy. And, who knows,\" he takes out his own wand and taps it against the toy wand. \"You might find this one useful still.\"</p>\n<p>He hands the now faintly glowing toy wand back to Modesty who stares at it with wide eyes. Newt grins. \"Do you have any other toys you want to bring with you?\"</p>\n<p>She doesn't, and the way she clutches to her now lit up wand tightly breaks Newt's heart a little. He helps her back her clothes and hair ties and then walks out holding her hand.</p>\n<p>All the Barebone children hesitate at the corridor, looking to the end. There's a door there, shut. They mother's bedroom.</p>\n<p>\"She'll be asleep until morning,\" Newt says. \"By the time she wakes up, we'll be long gone.\"</p>\n<p>Credence lets out a breath that sounds like it's been long time coming and Chastity squeezes her hands into fists. \"Are we bad children?\" she asks quietly.</p>\n<p>\"If staying here would be what makes you good, then I'd rather be bad, personally,\" Queenie says and wraps an arm around Chastity's shoulders. \"It's alright to feel sad, honey.\"</p>\n<p>\"She's…\" Chastity starts and stops for a long, difficult moment, trying to force the words out. \"She's a bad mother,\" she then says, her voice strangled. \"I shouldn't feel sad.\"</p>\n<p>\"She's still your mother, sweetheart,\" Queenie says and kisses her temple gently. \"Of course you'll feel sad.\"</p>\n<p>\"Do you think she'll miss us?\" Modesty asks, looking up to Newt. \"Will she be sad?\"</p>\n<p>\"I don't know,\" Newt admits, crouching down beside her and eyeing the door. \"She will, if she's ever cared about you. But if she did care… she wouldn't hurt you.\"</p>\n<p>Modesty looks down for a moment and then up at her siblings. Then, frowning, she releases Newt's hand and holds hers out to Credence. \"Belt.\"</p>\n<p>\"Modesty?\" Credence asks with a frown.</p>\n<p>\"Come, give me it,\" she says and with a hesitant look at Newt, Credence slowly undoes his belt and winds it out of the belt loops before handing it to Modesty. As they watch, she marches over to her mothers door and there she hangs it on the door handle. Like a message – but why Credence's…?</p>\n<p>Oh.</p>\n<p>Newt's face crumbles and he looks down, taking slow breaths for a moment. For a moment he's absolutely furious, so angry that it's hard to breathe at all. She made him wear it. The same belt she used to hit his hands – she made Credence <em>wear</em> it.</p>\n<p>There's hand on the back of his neck then, Queenie, who's probably in his head and feeling what he was. It grounds Newt enough that when Modesty comes back, he doesn't hug her quite as tight and desperate as he might've before.</p>\n<p>\"Can we go into the suitcase now?\" Modesty asks gloomily.</p>\n<p>\"Yeah, yeah you can,\" Newt says and takes another deep breath. Tina, who has been holding onto the said suitcase, lays it out on the floor and opens the latches, revealing the ladder inside.</p>\n<p>Credence and Chastity stare at it. \"I… didn't think you meant it <em>literally</em>,\" Chastity says after a moment.</p>\n<p>\"Don't worry, It's a lot bigger inside,\" Newt says and stands up. He reaches for Queenie, who's still holding Dougal. \"Come here, you, time to go home.\"</p>\n<p>The Demiguise releases her hold on the witch with put upon sigh and grasps Newt's shoulders instead and while the children watch, Newt climbs down to his suitcase. He waits on the bottom to see who's the first come down – and somehow, it's not a surprise that of course it's Modesty.</p>\n<p>\"Oh,\" she says, staring at his office with wide eyes. \"<em>Oh</em>!\"</p>\n<p>\"Welcome to my home,\" Newt says with a grin and looks up as Chastity too climbs the ladder down, very very cautious and wide eyed.</p>\n<p>\"Chastity, look – it's huge inside!\" Modesty says.</p>\n<p>\"Yes. I can see that,\" Chastity says, looking fascinated and horrified. \"You put your house inside a suitcase? Witches can do that?\"</p>\n<p>\"Well, wizards too – but it was rather the opposite. I got a suitcase – and then I build a house in it,\" Newt grins. \"Undetectable expansion charms – quite a lot of them too. Making this suitcase is what got me graduate papers from Hogwarts – my school final, as it were. Spend almost six months making it too.\"</p>\n<p>\"How big is it?\" Chastity asks, peering out the open door. \"Will we all fit?\"</p>\n<p>\"There's plenty of space,\" Newt promises. \"Let's wait for your brother, and then I'll be happy to show you around.\"</p>\n<p>Credence comes down, the slowest and most cautious of all three, every step and move hesitant like he can't quite believe the world around him is real. The look on his face is full of almost painful wonder when he finally sees the office. He stares at the drying herbs, the phials, the pots, the pans and all the equipment Newt had strung about the place – it's really more of a shed than office really. But it was where Newt did most of his writing – thus, office.</p>\n<p>He really prefers this sort of office to the clean one with pristine desks anyway.</p>\n<p>Newt grins at the children. \"Come on,\" he then says, and walks out. Clutching to their bags and belongings, they follow.</p>\n<p>He doesn't usually like showing people around the place – it's always a bit of a mix bag on how people react to his enclosures and habitats and what's in them. But the wonder on Credence's, Chastity's and Modesty's face fills with him the sort of giddiness he'd first felt when he finished the suitcase and presented it, with great, pride, to Dumbledore. Like the world is suddenly bigger and wider and full of so much more potential than before.</p>\n<p>\"Habitats, for as many biomes than I have been able to gather,\" Newt says in explanation as the children stare at the charmed screens separating different habitats – the wind coming from the plains biome was making them all shift and flap a little. \"Almost all of them are full right now – and the creatures don't know any of you yet, so, don't go in without me, alright? I'll introduce everybody in a moment – but right now, here…\"</p>\n<p>He leads the children to an empty space. It was between two habitats – the forest to it's left and night to it's right. Both were relatively quiet biomes, and currently didn't house anything… too dangerous. \"I meant to start on water biomes here,\" Newt explained, motioning upwards to the floating spheres of water where the Grindylows and various magical fish were floating. \"Never got around to it. I haven't yet dealt with that many water borne creatures, to be honest.\"</p>\n<p>\"What is <em>that</em>?\" Modesty asks, pointing upwards at one large bubble, which glows with eerie pale light in the shadows cast by the forest and night habitats.</p>\n<p>\"That's Marmite,\" Newt says, taking out his wand and flicking a bit to summon the bubble down. Inside it, the glowing squid is doing happy circles. \"Pretty, isn't he? Found him in Turkey of all places – some… unseemly people had him in an aquarium exhibit, and in far too small a tank at that. He's just a baby right now – they grow up to be bigger than giant squids.\"</p>\n<p>Chastity and Credence stare at the floating bubble with wide eyes while Modesty reaches out to poke at it, staring in wonder as the bubble wobbles but doesn't break. Newt grins and then lifts Marmite back up, where he could roam around the tops of the habitats as he wished in his armour of water.</p>\n<p>\"Are we really going to live <em>here</em>?\" Chastity asks and then looks down, at the empty enclosure.</p>\n<p>\"Well,\" Newt says and shrugs. \"For now anyway. It's where I live – I travel, and don't really have any one place to stay, so I just bring my home with me. I was thinking – we can set you all rooms here,\" he flicks his wand and erects a illusionary walls here and there. \"Get you beds, furniture, or, I don't know, hammocks if you want – and I was thinking of putting up a library anyway, so we can do that and maybe a living room too…\"</p>\n<p>He waves his wand around, conducting an illusionary design of a place, shifting around examples of furniture until they had something that looked rather like an actual house with rooms and such. As he goes, he babbles with increasing nervousness as the kids just <em>stare</em> and don't say anything. \"– and a dining room, never needed one before, should probably add one now. Eating together, blimey, haven't done that in years, should be fun – oh we'll need a kitchen too, don't we, homes need kitchens – and a bathroom, Merlin, I'm going to have add <em>plumbing</em> too - \"</p>\n<p>He stops when Chastity hugs him.</p>\n<p>\"Er. Hi?\" Newt says and pats her back awkwardly. \"Are you alright? Um?\" he looks up at Credence who has his lips pressed tight together – as Newt watches, the young man turns away to wipe at his eyes with the sleeve of his jacket.</p>\n<p>\"… are we going to be like real family, with… real house?\" Modesty asks with wonder.</p>\n<p>Newt blinks at that and then looks up at the floating bits of water above. His throat works for a moment and he only talks when he's sure he won't cry. \"Yes,\" he says, and wraps his arms around Chastity's shoulders. \"Yes. Like a real family. With a real house.\"</p>\n<p>\"Which is in a suitcase,\" Tina comments from the side, and Newt turns a bit to see the Goldstein sisters watching them with smiles.</p>\n<p>\"We'll be a big happy suitcase family,\" Newt agrees with a grin – and that concept is as exciting as it is terrifying. Just the sort of thing he loves, Newt thinks, and presses a impulsive kiss against Chastity's hair.</p>\n<p> </p>\n<p>He shows the kids around the place, introducing them to all the creatures and making very carefully sure they knew which ones to keep a safe distance from. He knew how to handle them, and they knew not to attack him – but the kids were as new to the creatures as the creatures were to them, and worse yet most of them had very bad experiences with people other than Newt.</p>\n<p>\"I don't want anyone to get hurt,\" Newt explains when making sure all three of the Barebones knew to stay well aware of the Nundu's enclosure. \"Nothing here is dangerous by intention, but they have their defence mechanisms and lot of creatures here are a little skittish. Best not to tempt fate.\"</p>\n<p>\"What if we do, though?\" Modesty asks, watching him carefully. \"Even if we don't mean to, what if we do something bad?\"</p>\n<p>Newt looks at her, and then at the other two, both of whom are making a very good pretence of not being <em>very</em> interested in his answer. Considering it, Newt crouches down to meet Modesty's eyes. \"Do you <em>want</em> to do something bad here?\"</p>\n<p>\"No, but what if we <em>do</em>?\" Modesty asks impatiently. \"What if we can't help it? If it just happens?\"</p>\n<p>\"Then it's what's known as accident, and while accidents can be terrible, they're not <em>bad</em>,\" Newt says carefully. \"And if an accident happens then I hope is that you don't get hurt, and that I can get to you on time to help you.\"</p>\n<p>\"But what if we – if we do something really – accidental?\" she asks meaningfully. \"If – if something breaks or something.\"</p>\n<p>The wizard hesitates. \"Then we'll fix it,\" he says slowly and glances up at Tina and Queenie hopelessly, not sure what to say.</p>\n<p>Tina just makes a helpless face and Queenie smiles sadly, glancing at Credence and his hands, and at Chastity who is hugging her self.</p>\n<p>It was obvious what Modesty is after. What would he do if they did something… punishable. And honestly, Newt has no idea. As it is right now, he couldn't imagine anything they would do – though, humans being humans, who knew. They might find away. But he has no doubt that these kids are smart enough to not tempt fate in a place full of lot of very dangerous beasts.</p>\n<p>\"Would you want to hurt any creature here?\" Newt asks after a moment, and all three quickly shake their heads, looking wide eyed. \"Good. That's all I ask. This place,\" he looks around, waving a hand at the habitats. \"Is a sanctuary. I build it to be a place where <em>everything</em> and <em>anyone</em> I bring in can be safe. That includes you three. Alright?\"</p>\n<p>He looks each Barebone in turn until he gets a nod, and then smiles. \"Good,\" he says, squeezing Modesty's hands and then stands up.</p>\n<p>Tina clears her throat. \"We should start thinking about leaving the church, before <em>herself</em> wakes up,\" she says and motions to the office-shed. \"How about we'll head to our place, for now? You can stay here with the kids, Newt – we'll take care of it.\"</p>\n<p>\"Would you?\" Newt asks gratefully.</p>\n<p>\"You just get everyone settled in,\" Queenie says, reaching out to squeeze his shoulder. \"Knock if you need anything, alright?\"</p>\n<p>\"Alright, thank you,\" Newt says and watches the Goldstein sisters head towards the shed. \"So, how about I introduce you your next door neighbours?\" he then says, turning to the kids. \"I bet the Mooncalfs will love you – and I've been meaning to check up on Pickett, the poor thing has had a bit of a cold…\"</p>\n<p>Pickett is a little nervous around the kids – though, so are the other Bowtruckles, they all hide in their tree when they see them coming. Pickett at least dares to climb down on Newt's arm to be introduced.</p>\n<p>\"It's like a – a stick insect,\" Chastity murmurs, smiling a little. \"I've seen pictures of them.\"</p>\n<p>\"Similar enough,\" Newt agrees. \"Bowtruckles are in the fae family, really – closer related to Fairies and Gnomes than actual insects. There you are Pickett, give us a smile…\"</p>\n<p>\"Fairies? Gnomes?\" Modesty asks with excitement. \"Can we go see those too?\"</p>\n<p>Newt grins and the Bowtruckle clambers up his arms and hides under the labels of his coat. \"I don't have any of those around here, I'm afraid, but hopefully I'll be able to show some. I do have some books with pictures, I'll show you later. Come now, Pickett, there is no need to be shy…\"</p>\n<p>The Bowtruckle refuses to budge though and with a sigh, Newt leaves him be. \"Ah well. Shall we go say hello to the Mooncalfs?\" he asks, ushering the Barebones out of the forest.</p>\n<p>They don't get a chance to look in on the night habitat, though. As they exit the forest habitat, they see Tina running back towards them, coat tails flapping. Her face is pale and she looks alarmed. \"Newt – we're locked in,\" she says quickly.</p>\n<p>\"What?\" Newt asks, drawing to a startled halt.</p>\n<p>\"The case – someone's locked it from outside,\" she says. \"We're trapped inside.\"</p>\n<p>The obvious fear was, of course, that Mary Lou had woken up, seen them, and then put something heavy on top of the suitcase.</p>\n<p>\"We shouldn't have just left it there – one of us should've stayed outside, carried the suitcase out,\" Tina says nervously as she paces in the office-shed, staring up at the blocked hatch that leads to the world outside. \"We got complacent. That's what gets you in <em>any</em> line of work – you get complacent.\"</p>\n<p>\"None of thought of it, Tina, it's not your fault,\" Queenie says.</p>\n<p>\"I should've thought of it – I'm an Auror!\" Tina mutters. \"No wonder I got fired.\"</p>\n<p>Newt says nothing. He has one arm around Chastity's back, and other on Credence's neck, holding securely. Modesty is sitting ramrod straight in his lap, all but burrowed into his coat. \"And I should've thought of another way of exiting the case – there is no helping it now,\" Newt says. \"And no use of worrying.\"</p>\n<p>\"No use of worrying – \" Tina rounds up on him.</p>\n<p>\"My philosophy is that if you worry, you'll just suffer twice,\" Newt shrugs. That was, however… before. Now, he looks up at the closed hatch and he's damn <em>worried</em>. Taking a breath Newt looks down. \"If it's Mary Lou, we'll deal with her and that's that,\" he says and looks at the kids. \"None of you need even see her.\"</p>\n<p>\"She's going to be mad,\" Modesty whispers against his shirt. \"She's going to be <em>so</em> mad.\"</p>\n<p>\"I'm sure she's no worse than a enraged Thunderbird,\" Newt says calmly, or as calmly as he can manage it anyway. \"I didn't tell you how I found Frank, did I? He was proper mad by the time I got to him, let me tell you…\"</p>\n<p>The story doesn't do much to help, but the pinched tightness of Modesty's hands on his shirt, and the tension of Credence's neck eases a little bit as he prattles on about Frank and how difficult it was to smuggle a thunderbird – never mind a <em>furious</em> thunderbird – out of a poacher camp without being seen. It hadn't helped that Frank had resolutely refused to get anywhere near his suitcase.</p>\n<p>The very same suitcase they were now trapped in.</p>\n<p>Newt's story falters a little, but it turns out it hasn't had only an effect on the kids – Queenie has been listening too, and when Newt stops, she picks up the pace. \"You know, I was thinking – about the whole illegal kidnapping thing and all that,\" she says and glances as Tina. \"Do you think Gnarlack can manage… papers and some such? No-Maj paperwork. For adoption and such.\"</p>\n<p>\"Gnarlack?\" Newt asks.</p>\n<p>\"He's a goblin, runs the Blind Pig,\" Tina says thoughtfully. \"He was one of my informants back when I had a badge. And, I don't know – he might be able to, but it would cost us. And worse yet, he never does anything for cheap, not even No-Maj paperwork.\"</p>\n<p>\"Would it be like a forgery?\" Chastity asks nervously.</p>\n<p>\"There's a fine line between the real thing and forgery when magic is involved,\" Newt says thoughtfully. \"And goblins can be very crafty… craftsmen, when they want to be. And if you pay a goblin enough…\"</p>\n<p>\"Gnarlack isn't like most goblins,\" Tina warns him.</p>\n<p>\"Most goblins aren't like most goblins are thought to be,\" Newt shrugs and then his eyes stray to the hatch on the ceiling. Still nothing.</p>\n<p>They'd been stuck inside the case for half an hour now – or longer, none of them had a clue exactly when they'd been trapped inside. But it had been half an hour since they noticed and in that time there hadn't been any clue about what was going on in the outside.</p>\n<p>It was how Newt had designed the place – nothing from the outside affected the space inside. Considering all the hasty running he had to do, it would be a right mess if any old bang and crash would affect the habitats.</p>\n<p>But, perhaps, after this, he could add windows… or something like that.</p>\n<p>\"What if she sets the case on fire?\" Credence asks slowly. \"If she puts it in a fireplace, or –\"</p>\n<p>\"It's quite fireproof,\" Newt promises. \"Fireproof, shockproof, damage proof and completely warded. Also, if the suitcase outside is somehow destroyed, it's not as if we'll just disappear with it – no, the space inside will spill outside.\"</p>\n<p>Tina sighs. \"And it's usually bit of a mess when that happens. I remember a case where a wizard had trunk full of all sort of trash – newspapers, feathers and such. Enough to fill a decent sized brownstone. It got run over by one of those No-Maj cars – split right open. Tons and tons of very light trash strewn about, right in the middle of No-Maj New York…\" she shakes her head and then looks at Newt. \"Though I suppose he didn't have a <em>Nundu</em> in his case. Or a Erumpent.\"</p>\n<p>\"Well, his case wasn't very interesting then, was it?\" Newt answers brightly and she gives him a highly unimpressed look in answer.</p>\n<p>That's when there's a knock on the hatch and they all freeze, looking up at it. It's slow and heavy, thump, thump, thump, very deliberate.</p>\n<p>Tina straightens her back. \"I'll go,\" she says and casts a look at Newt. \"Stay here, look after them.\"</p>\n<p>\"It's my case,\" Newt says, but doesn't get up, doesn't dislodge Modesty in his lap.</p>\n<p>\"And I'm the Auror – I'll go,\" Tina says, taking out her wand. \"Everyone be calm – I'll handle this.\"</p>\n<p>She climbs the ladder up slowly, wand held at ready and then, slowly, pushed it open – and then froze mid-step, one foot hanging in the air.</p>\n<p>\"The wizard, Miss Goldstein,\" a male voice says and Newt closes his eyes. Not Mary Lou Barebone then.</p>\n<p>\"Mr. Graves,\" Tina says, her voice startled.</p>\n<p>\"The <em>wizard</em>,\" the voice says firmly. \"Now if you would.\"</p>\n<p>Tina hesitates for a moment, her wand hand poised up at her side – and then there is a flash of light. Queenie rushes in just in time to stop her sister from falling down the stairs, catching her with a spell in mid air and stopping her from banging her head on the shelves.</p>\n<p>The Barebone children cry out, Chastity jumping to her feet while Credence… goes completely still. Newt quickly lifts Modesty from his lap, and then, after making sure that Queenie had Tina, he takes Credence in.</p>\n<p>His eyes are going blearily white.</p>\n<p>\"Credence,\" Newt whispers and takes the young man's face between his hands. \"Credence, look at me. Let me handle this. Stay here, with your sisters, stay <em>safe</em>. I'll protect you. Listen to me – I'll protect you.\"</p>\n<p>\"M-Mr. Scamander,\" Credence chokes out. \"It's Mr. <em>Graves</em>. And he – Miss Goldstein –\"</p>\n<p>\"I'll handle it,\" Newt swears. \"Stay here, stay safe – get out of the shed, go to Frank's enclosure. Tell him I send you. Tell him you're scared. He'll look after you. Alright?\"</p>\n<p>\"But –\" Credence says, looking up the ladder.</p>\n<p>\"Please,\" Newt says firmly. \"I need you safe. I need to know you're safe. Please, Credence. Take your sister's and go.\"</p>\n<p>\"Mr. Scamander,\" Chastity says nervously. \"W-what is going on?\"</p>\n<p>\"I don't know, but I'll handle it,\" Newt says and looks at Credence firmly in the eyes. They're dark and clear again. \"Go, look after your sisters, and be safe.\"</p>\n<p>It takes a moment but Credence nods. Newt watches them until he's sure they're going and then he whips out his wand and flicks it at the door of the office-shed so that it can only be opened from the outside of the shed. It wouldn't stop a competent wizard, but… it would slow them down.</p>\n<p>And it did make Newt feel a little better.</p>\n<p>He turns to Queenie who is lying unconscious Tina on the floor. \"I can't read him,\" Queenie says with her voice shaking. \"But there's someone else up there – and they're… blurry.\"</p>\n<p>\"Blurry?\" Newt asks with a frown.</p>\n<p>Queenie nods. \"And in terrible pain. Be careful, Newt.\"</p>\n<p>Newt nods and takes a deep breath. \"Queenie –\"</p>\n<p>\"I won't let him in,\" Queenie swears. \"Whatever happens – he's not getting to your kids.\"</p>\n<p>His kids. My kids, Newt thinks and lets it settle on his shoulders like a cape, like armour.</p>\n<p>Then he climbs up the ladder, one step at the time. The hatch – the top of the suitcase – had clicked shut when Tina had fallen, and slowly he pushes it open.</p>\n<p>There's a wand tip at his throat before he can even look up, and the wizard from before is there, at the other end of it. The man watches him coolly over the wand, and drags the tip along Newt's neck, lifting his chin up. \"Wand.\"</p>\n<p>Newt holds out his wand, and the man takes it… and breaks it in single hand.</p>\n<p>\"Now out you come,\" Graves says while Newt stares, eyes wide, at the two halves of his wand on the floor. There was white powder spilling from inside, the bone and shell core, scattering on the wooden floor.</p>\n<p>One would think you wouldn't be so attached to a tool and yet…</p>\n<p>Newt swallows and climbs out of the case. As he does, he avoids looking at Graves and looks instead everywhere else. They're in a room, with windows and curtains and all – not a prison cell, not even an interrogation room like he'd feared. A flat, it looks like, a lived one at that. There's a dining table with chair and parchments strewn all about the table's surface, a side table with decorative stone basin sitting on top, there's pots and pans by the stove, there's…</p>\n<p>A man, chained to a Muggle radiator. A man who looks exactly like Percival Graves, except bloody, bruised and obviously out of it, staring blearily ahead with unseeing eyes. His hair, no doubt previously cut much like the other Percival Graves hair, is much thicker, the shaved sides long since grown out of the hair cut.</p>\n<p>Newt looks at the Graves holding the wand and meets his cool smile. \"Live potions ingredients always get better results, I find,\" he says and flicks his wand away from Newt for long enough to lock the suitcase again. The clasps snap shut, and then chains appear to wrap around it, and all the people inside are trapped once more.</p>\n<p>\"Now,\" fake-Graves says and the wand is back on Newt. \"Let's start with a name.\"</p>\n<p>Newt swallows, glancing around for anything, but… there's nothing. The man's wand hand is terribly steady on him, and he casts nonverbal charms with nonchalant ease… and whoever he was, he had been pretending to be the Chief of MACUSA's Auror force for months now.</p>\n<p>And Newt had never been particularly talented duellist. Terrible problem with casting competent curses, never could get them right. Intent, all his teachers had says, and Leta had agreed. He lacked the intent.</p>\n<p>\"Newt,\" he says, swallowing. \"Newton Artemis Fido Scamander. How do you do?\"</p>\n<p>\"Hello Newt,\" fake-Graves says with cool smile. \"I was quite well before you butted in, to be honest. Did you really think the church wasn't monitored? Casting healing charms on No-Maj property, tut tut. <em>Sit</em>.\"</p>\n<p>Newt sits, quite suddenly, on a chair he hadn't even noticed was there. Moment later, he was bound up in similar chains as his suitcase, trapped firmly against the chair. The chair legs bang against the floor as he startles, and the wounded Graves by the radiator jerks slightly, looking up with bleary, exhausted eyes.</p>\n<p>He has no shirt on, and his chest is cut to ribbons with thin wounds – made by a very sharp blade, or terribly talented cutting hex. Newt glances at them, then his hair – which, considering the no doubt <em>weeks</em> of Polyjuice potions, one would think would be missing chunks. It isn't though.</p>\n<p>The fake-Graves was using blood, then, rather than hair, as potions ingredient.</p>\n<p>Snorting amusedly at his silent, desperate observation, the fake Graves pulls out another chair and sits down it, facing Newt. \"Now what do you know about the Obscurus?\"</p>\n<p>\"The Obscurus?\" Newt asks, licking his lips nervously. \"What Obscurus?\"</p>\n<p>\"Mr. Scamander, <em>please</em>… don't make me hurt you,\" Graves says, unimpressed in way that reminds Newt very queerly of Tina. \"Because believe me, I will hurt you. I will hurt you <em>terribly</em> if you don't give me what I want.\"</p>\n<p>\"You want… an Obscurus?\" Newt asks, a little confused now – honestly so. Why would <em>anyone</em> want an Obscurus? \"An Obscurus is a… terribly destructive force, a parasite of magic that eats away at the host from inside – why in Merlin's name would you <em>want</em> one?\"</p>\n<p>\"Is it?\" Graves asks, arching his eyebrows. \"Is it really?\"</p>\n<p>That brings Newt up short – the mixture of threat, amusement and flat out dare in the man's voice.</p>\n<p>\"What do you think and Obscurus is?\" Newt asks slowly.</p>\n<p>\"Magic,\" the man answers. \"Plain and simple. It is the magic of a child, rebelling against the child's mind, when that mind refuses to accept it.\"</p>\n<p>Newt stares at him, his mouth opening without a sound.</p>\n<p>\"You could even call it a <em>soul</em>,\" fake-Graves says and leans in. \"Soul rebelling against it's own body.\"</p>\n<p>\"That… is not what an Obscurus is,\" Newt says slowly.</p>\n<p>\"How would you know?\" fake-Graves asks mockingly. \"Have you ever seen an Obscurial at the late stage? The Obscurus destroys their bodies at the end, shreds them to dust, and then… exist without them. They become immortal force of <em>magic</em> and <em>magic</em> alone. A being above the physical – a true immortal being.\"</p>\n<p>It quickly dawned on Newt that this man was quite insane.</p>\n<p>\"An Obscurus is a tumour in magic, a growth caused, yes, by the mind's unwillingness to accept magic, but… a growth nonetheless,\" Newt says slowly. \"It's not the magic it self and it's most certainly not the soul – it's a cancerous mutation that takes over the magic and –\"</p>\n<p>\"And that point, when it <em>has</em> taken over, isn't it the same thing as the magic itself?\" fake-Graves asks, arching his dark eyebrows. \"You know quite bit about this, Mr. Scamander. More than usual. You <em>are</em> after the Obscurial, then.\"</p>\n<p>\"All I want is to help three <em>terribly</em> abused children,\" Newt denies.</p>\n<p>\"Oh, sure, you want to help couple of No-Majes and an useless <em>squib</em>,\" fake-Graves scoffs. \"And Credence is hardly a child. How is he taking to magic, then? Asking for a wand, yet?\"</p>\n<p>Newt swallows. He rather wants to growl. He knows some good growls. Cry of a Nundu strikes fear in the hearts of even greatest wizards and he can even roar like a dragon in a pinch. Either one would've done.</p>\n<p>\"Or… is it one of them?\" fake-Graves asks. \"That girl, his youngest sister – always struck like a No-Maj to me, but then, Obscurials are what they are because they deny their magic. Is it her – is she the Obscurial?\"</p>\n<p>\"No,\" Newt says through gritted teeth. \"She's nothing more than a scared little Muggle girl.\"</p>\n<p>Fake-Graves eyes him silently for a moment, leaning back in him chair a little, throwing his left arm over the backrest. He looks disappointed as he rakes his gaze from Newt's shoes to up to his hair and then he sighs. \"I do think I am going to hurt you now.\"</p>\n<p> </p>\n<p>Fwooper howl could drive you inside if you listened to it long enough. Nundu's breath carried hundred plagues – it didn't even need to bite you to kill you. Thunderbird could cause flooding, could kill you with a lightning strike if you bothered it bad enough. Erumpent's horn was known to blow holes into <em>mountains</em>. Swooping Evil's venom could erase memories entirely, and it fed on brains. Billywig's sting caused you to float and made you so giddy you didn't mind plummeting to your death afterwards. Occamy shrinks and expands to fill the space it inhabits – outside, it can grow big enough to crush cities under it…</p>\n<p>Newt isn't sure when he fell over, but he's lying on his side on the floor, still bound up in the chair. There is something wet and sticky on his face, and his vision is a little red on one eye. He's staring at the wounded version of Graves, who is staring back with tired eyes, not making a sound.</p>\n<p>Fake-Graves is getting a drink, humming as he does pours it. Newt isn't sure what he's told the man at this point – but he's sure he hasn't said a word about the children. He knows because his mouth tastes like iron, knows because he bit his tongue every time the man asked.</p>\n<p>\"You know, I could just go down there and check it for myself,\" Fake-Graves comments as he lifts the glass. \"One baby Auror and her airhead of a sister, that's hardly enough of an opposition.\"</p>\n<p>\"Why don't you, then?\" Newt asks, and watches a bit of red splatter onto the floor. His voice sounds like a croak – he'd seen a frog once, who sounded just like it. Curious little pink thing – terribly poisonous. Filled her entire pond with the bodies dead animals. Pity Newt hadn't had the time to examine it further.</p>\n<p>\"Indeed, why don't I?\" fake-Graves asks. He tinkers with something on the other end of the room and there's a scratch of needle on record before music spills into the room. Gramophone.</p>\n<p>Newt meets the real Graves' eyes as the room fills with Muggle jazz. The man's expression doesn't shift at all, but his lips tighten a bit. His hands are stretched to each side of the radiator and his fingers, Newt notes privately, look broken. Each and every one of them.</p>\n<p>\"Muggles,\" fake-Graves mutters. \"The things they come up with.\"</p>\n<p><em>…Muggles</em>?</p>\n<p>Newt glances over his shoulder, as much as he can, and sees fake-Graves looking at the gramophone with a dark look. He glances back at Newt when he notices and then smiles, lifting his glass as if in a toast. \"To your health,\" he says sardonically, and takes a sip before walking over. \"Now. About that Obscurus…\"</p>\n<p>Newt closes his eyes and swallows, preparing for another blow. It didn't come – instead, liquid splashed against his cheek and it <em>burned.</em> Hissing with the sting, Newt turns his face away from it, and tutting gently fake-Graves turns it back, pouring the alcohol slowly into the cuts on Newt's cheek.</p>\n<p>Something tickles Newt's hands. Something sharp and familiar, clambering over his fingers.</p>\n<p>\"I – I removed it,\" Newt gasps out quickly, keeping his eyes tightly shut to keep the alcohol out of them.</p>\n<p>\"… what?\" Graves says and the liquid halts.</p>\n<p>\"I - removed it – the Obscurus – I removed it,\" Newt grinds out. \"I took it out of the host – it's – it's in the suitcase. I have it contained, in the suitcase.\"</p>\n<p>Fake-Graves watches him for a moment. \"You – removed it,\" he repeats slowly. \"You <em>removed</em> it?\"</p>\n<p>\"I took it out of the host,\" Newt breathes through the pain. \"I took it out of the host – I took it out –\"</p>\n<p>Fake-Graves snaps out his wand and holds it out, not at Newt's throat, but to his temple. Newt can't think fast enough – but it doesn't matter, because what he said wasn't a lie. He had removed the Obscurus from the host.</p>\n<p>It just wasn't the host fake-Graves was thinking about.</p>\n<p>\"You removed it. And… it's <em>useless</em> without it's host,\" fake-Graves says slowly. \"It's useless. You made it <em>useless</em>!\"</p>\n<p>That's the last thing Newt hears before he blacks out.</p>\n<p> </p>\n<p>\"Hey, you, wake up. Wake up. WAKE UP!\"</p>\n<p>Newt comes to like from under water, or under ground, crawling his way to consciousness through haze of pain and grime. He's lying on the floor on his side and everything hurts.</p>\n<p>\"There you go, come on,\" a voice says. \"Stay with me. Newt, was it? Stay with me Newt, come on.\"</p>\n<p>Newt swallows, his mouth tasting unspeakably foul, and looks up. The wounded, ragged version of Graves is staring at him, leaning out as much as the chains holding him allow. \"There you go, stay with me,\" the man says. </p>\n<p>\"The suitcase?\" Newt whispers.</p>\n<p>\"He took it,\" the real Percival Graves says. \"Your hands.\"</p>\n<p>Newt blinks slowly and looks down, lifting his hands – they're aching and <em>free</em>. And Pickett is lying curled up in his palm, shaking like, well, a leaf. \"Hey there, Pickett,\" he whispers to the bow truckle. \"Good job. Very good job. Oh I have so many woodlice for you for this.\"</p>\n<p>\"Oh. A Bowtruckle?\" Graves asks with a weary sort of incredulity. \"Huh.\"</p>\n<p>\"Yeah, he's – he's a brave little thing,\" Newt groans and gently lifts shaking Pickett to his shoulder. Then, every part of him aching, he pushes himself up from the floor. Stumbling a little, he crawls over to Graves on all fours and tries to chains. They're very secure and he barely has enough strength left to make them <em>shake</em>. \"Pickett, could you please?\"</p>\n<p>The Bowtruckle shakes for a moment but then, slowly, crawls down his arm and to the shackle holding Graves' hand.</p>\n<p>\"How long have you been here?\" Newt asks as they watch the Bowtruckle pick the lock.</p>\n<p>\"I've lost track of it. Weeks,\" Graves answers. \"It was the 12th last I recall.\"</p>\n<p>\"12th of November?\" Newt asks, with little hope.</p>\n<p>\"October,\" Graves says and then lets out a pained groan as his arm falls, the shackle undone. He shudders against the radiator. \"Ow, <em>fuck</em>, my shoulder…\"</p>\n<p>Newt winces with sympathetic pain and with shaking hand reaches for Pickett, to lift him up to the other shackle. \"It's – it's 8th of December now.\"</p>\n<p>\"Shit,\" the Auror answers and closes his eyes, just breathing for a bit. As Pickett works on the other lock, Newt examines the man's shoulders worriedly. They don't look dislocated – but if he's been shackled arms spread all this time… there would be damage.</p>\n<p>\"If I had my wand I could heal you,\" Newt mutters despairingly.</p>\n<p>\"I'll be fine,\" Graves grunts, swallowing. \"Can you Dissapparate?\"</p>\n<p>\"I should be able to manage it,\" Newt answers and then grimaces with a sort of pain he can't even fathom, it goes so deep. The fake-Graves has his suitcase. He has Newt's <em>suitcase</em>. Newt's breath stutters a little. \"But - but do you know where he's gone?\"</p>\n<p>\"Doesn't matter where he's gone – he has my wand,\" Graves says. \"And Miss Goldstein, I presume, in that suitcase of yours. Two Aurors. Two Auror wands.\"</p>\n<p>Newt blinks. \"And that helps us?\"</p>\n<p>\"Auror wands are monitored, MACUSA can track them,\" Graves says and takes a deep breath, meeting his eyes. \"You just need to get us –\" and that's when Pickett unlocks the other shackle. Graves' arm falls and the man cries out – and there is terrible wrenching <em>pop</em> as the man's shoulder falls and dislocates.</p>\n<p>Judging by the looks of it, Graves stays conscious by sheer force of will. \"<em>Shit</em> –\" the man hisses and takes a few gulping breaths. \"Be a dear and put that back in place, will you?\"</p>\n<p>\"Um,\" Newt answers, shaking a little. \"…sure. But are you –?\"</p>\n<p>\"Just fix it so we can get out of here,\" the man growls. \"We need to catch him. Even if the Obscurus isn't an issue anymore –\"</p>\n<p>\"Yeah, about that…\" Newt winces, fussing over the man's shoulder, lifting his arm. \"I didn't exactly lie, but…\"</p>\n<p>\"You're kidding me,\" Graves grunts in pain and stares at him. \"It <em>is</em> still an issue?\"</p>\n<p>\"Not the way you think – but the Obscurial is still around, yes,\" Newt says and then, before Graves can brace himself, he turns the man's wrist and pulls – and with a wet sort of pop, the shoulder goes back into it's socket. Graves <em>howls</em> behind clenched teeth and almost falls on Newt, gasping for a breath.</p>\n<p>\"Well,\" the man gasps wetly. \"All the more reason – to keep Grindelwald from – getting his hands on it – <em>fuck</em> that hurts –\"</p>\n<p>Newt blinks. \"<em>Grindelwald</em>?\" he asks incredulously.</p>\n<p>\"Yeah. Fucking <em>Grindelwald</em>,\" Graves agrees grimly.</p>\n<p>Newt doesn't really remember much about how they got to the MACUSA – just that it turns into a complete uproar very quickly. There are people shouting and someone actually screams, for a moment Newt is being dragged and pulled this way and that, poked and prodded – then he's sitting down and there's Graves, talking, his voice worn rough by weariness and no doubt by his long captivity on general.</p>\n<p>\"But Mr. Graves, how –\"</p>\n<p>\"The how really isn't as important as the fact that last I walked around a free man, it was the 12th of October, Ma'am,\" Graves says very, well, gravely and Newt looks up. There's a very imposing and very important looking witch there – as well as a whole slew of Aurors and Healers, tending to Graves and him.</p>\n<p>\"My suitcase,\" Newt says, wondering how much time he'd lost.</p>\n<p>\"Yes – his case,\" Graves says, motioning at Newt. \"With Junior Auror Goldstein, her sister and three No-Majes inside it.\"</p>\n<p>\"Former Auror Goldstein,\" the imposing witch corrects.</p>\n<p>Graves doesn't look very impressed with that. \"Demoted by Grindelwald – when her bleeding heart got in the way of his plans. If that counts official around here, I suppose I'm retired now by merit of my perfect replacement. And I'm sure he does very well here – considering it's been two months and no one fucking noticed.\"</p>\n<p>That brings the witch up short and everyone around them, Healers and Auror alike, shift guiltily. \"We're trying to track them,\" the important witch says after a moment. \"However Miss Goldstein's wand is not showing up on our scans and I'm afraid yours hasn't been traceable for a while. An undercover assignment you – he – was in that hasn't been fully cleared up yet – the traces were removed as part of it.\"</p>\n<p>\"Tch. Convenient,\" Graves mutters.</p>\n<p>Newt stares at them and he's so tired and worried that he doesn't even care how awkward it is. \"You can't find them,\" he says.</p>\n<p>\"Something about that case of yours,\" Graves says, more a question than a statement.</p>\n<p>\"Possibly,\" Newt agrees. Having his suitcase – all the precious and valuable and rare things inside – traceable was the last thing he wanted when he'd made the thing. \"And…. you can't find it. You can't find them.\"</p>\n<p>\"Do you have a way to find the suitcase, Mr. Scamander?\" the important witch asked.</p>\n<p>Newt eyes her for a moment, realises somewhat distantly that he's staring into the eyes of Madam Seraphina Picquery, the President of the Magical Congress of United States of America, and quickly looks down. Tracking his suitcase, right. But without his wand...</p>\n<p>Swallowing around the cloying taste of iron in his mouth, Newt rummages through his pockets, just in case he has anything useful. He comes away with a handkerchief, various snacks and treats for various creatures, bit of rope, cocoon of a Swooping Evil – when did that get in Newt's pocket? – couple of candy wrappers, Pickett whom he lifts up to his shoulder, another hanky – and, lastly, a flaming red feather.</p>\n<p>Newt stares at the feather for a moment in surprise. It was a beautiful thing – a flight feather, thick and sturdy with a stiff, strong shaft, good enough to make a decent quill out of it. He'd completely forgotten he had it still.</p>\n<p>When he looks up people are all staring at him a little incredulously, at the cocoon hanging from the edge of his palm, and the Bowtruckle clinging to his collar.</p>\n<p>\"You don't have a way to find it,\" Graves guesses flatly.</p>\n<p>\"No – I think I do,\" Newt says and holds out the feather.</p>\n<p>\"…what exactly am I looking at, Mr. Scamander?\" Picquery asks impatiently.</p>\n<p>\"Its – ah, it's a Phoenix feather,\" Newt says, squirming a little under all the stares. There are <em>lot</em> of people staring at him.</p>\n<p>\"A Phoenix feather?\" Picquery asks with a frown. \"Where did you get that?\"</p>\n<p>\"From – from the Phoenix, of course.\"</p>\n<p>\"And what does the Phoenix feather <em>do</em>?\" Graves asks with a frown. \"Can you use it to track the case?\"</p>\n<p>\"Well no, but -\"</p>\n<p>\"What use is it, then?\" someone asks.</p>\n<p>Newt flails for a moment and then straightens up a bit. He doesn't have the time for this – Grindelwald has his<em> </em><em>suitcase</em>. So, hoping it is a good time, Newt holds the feather between his fingers – and then he snaps the shaft in half.</p>\n<p>It takes only a second before a roar of flames tears through the air and, quite without warning, there is a fully grown Phoenix in their midst, flapping large flaming wings and sending wizards and witches scattering. There are shouts of surprise and alarm and people draw their wands – like people tend to do in the presence of one of the kindest, most Light creatures imaginable. <em>Wizards</em>.</p>\n<p>\"Its okay, it's okay, \" Newt says hastily, less to the people and more to the Phoenix who lets out an indignant shrill at the sight of him, with blood on his face and clothes. \"Its alright – Fawkes –\" he gasps a bit as the Phoenix lands on his aching shoulder, wings flapping, peering at his face in great concern. \"I'm alright – Fawkes, I'm alright, you don't need to –\" too late. Tears drip down to the cuts and the mild pain there fades.</p>\n<p>\"Mr. Scamander!\" The president of MACUSA snaps at him, wand in hand. \"Explain yourself!\"</p>\n<p>Fawkes squawks and Newt soothes him with a hand on his side. \"Ah – right, well, Phoenixes are very mindful about their feathers, they are terribly magical after all, and this one here – his name is Fawkes, say hello Fawkes – gave me his willingly. And when you break a Phoenix feather, willingly given, well, they know,\" Newt says, floundering a bit under all the wands pointing his way. \"And, ah, I can't track down my suitcase without my wand, no – but Fawkes here can. He used to live in it for half a year, you see, always coming and going as he pleased so.... yes.\"</p>\n<p>There is a moment of silence. Madam Picquery looks at Graves who lets out a weary sort of laugh. \"Well, we were already saved by his Bowtruckle – what the hell. I buy it.\"</p>\n<p>The President stares between them for a moment and then sighs, rubbing at her temple for a moment. \"Well this is already a mess, why not add beasts into it. Very well – fine.  So as long as there are no other magical creatures involved –\"</p>\n<p>Newt squirms guiltily.</p>\n<p>Picquery eyes him and then, apparently deciding to just ignore it, turns to face rest of the wizards and witches. \"Assemble the Senior Aurors. We have a Dark Wizard to catch. And someone help Mr. Graves and Mr. Scamander to the infirmary –\"</p>\n<p>\"Oh no, you are not cutting me out from this,\" Graves says sharply. \"That's my face he's wearing –\"</p>\n<p>\"I hardly think Fawkes will be going without me,\" Newt adds quickly. \"And it's my suitcase and –\"</p>\n<p>\"– and I am damn well going to be the first one to knock it's fucking teeth in!\"</p>\n<p>Picquery throws her hands up. \"I can't imagine how I ever mistook him for you,\" she says with some disbelief to Graves. \"Must have been pure relief and gratitude – I'm honestly going to miss how nice and obedient he made you seem.\"</p>\n<p>\"Hah,\" Graves answers and gets up with a grunt. \"Someone get me a wand.\"</p>\n<p> </p>\n<p>Newt is all but bouncing off the walls with anxiety while the Aurors get ready to go. He passes the time by chattering nervously with Fawkes, who preens his hair with great concern, crooning at him and trying to calm him with very little success.</p>\n<p>\"How are you liking Hogwarts, then?\" Newt babbles nervously. \"Bit colder than you're used to, I know, but it's not as if you can't just flame away to a warmer place – yeah, the treats are very good, I do miss those -\"</p>\n<p>\"Hogwarts?\" Graves asks interestedly while pulling on a long dark coat someone borrowed him, forgoing a shirt entirely.</p>\n<p>\"Yeah – he took a shining to my old Transfiguration Professor,\" Newt agrees, carefully not looking at the man while stroking Fawkes neck fondly. \"Has been staying with him in Hogwarts ever since.\"</p>\n<p>\"One would think you'd want to keep him yourself.\"</p>\n<p>\"You can't keep a Phoenix – certainly not if they don't want to be kept,\" Newt answers and looks away, his expression darkening. \"Though some people certainly try. No, Phoenixes choose for themselves and they are bad at sharing their companions with other creatures – so I'm afraid I was never quite his type.\"</p>\n<p>Graves arches an eyebrow at that, which Newt somehow picks up even at the corner of his eyes. Newt flushes a little and concentrates on Fawkes again. \"I'd still like to think us friends, though.\"</p>\n<p>\"Friends with beasts,\" Graves comments. \"Well, comparing that Bowtruckle of yours to <em>everyone I know and work with</em>…\"</p>\n<p>Newt winces a little at the bitterness in the man's voice. \"I don't know you that well, Mr. Graves but… Grindelwald seems like a fairly talented and charismatic actor.\"</p>\n<p>\"Which, honestly, should've tipped someone off,\" Graves mutters and shakes his head. \"Two fucking months. Let me tell you, I'll feel a lot better about life in general once I've managed to beat my face off his.\"</p>\n<p>Newt doesn't know what to say that, so he doesn't say anything. Thankfully soon after that they are ready to go – they including two dozen Aurors, all of them in Dragon hide armour and everything.</p>\n<p>\"There is no conceivable way Fawkes can take all of us,\" Newt says at the sight of the crowd.</p>\n<p>\"Mr. Scamander, we're about to face one of the darkest wizards ever to have lived – certainly the darkest of our time,\" Picquery says firmly. \"We'll need every single senior Auror.\"</p>\n<p>\"That doesn't change the fact that there is no conceivable way Fawkes can take all of us. Phoenixes aren't all powerful,\" Newt says apologetically and looks up as the Phoenix thrills at his ear. \"He can take four of us at most, I'd say.\"</p>\n<p>\"Delacour and Svensson – we'll send a pulse when we're through,\" Graves says, pointing out two Aurors.</p>\n<p>Picquery sighs. \"Very well,\" she allows, begrudgingly. \"Go.\"</p>\n<p> </p>\n<p>Lot of things happen very fast then.</p>\n<p>Fawkes carries them in flame and they emerge somewhere Newt did not expect – a place he'd been in not that long ago. He doesn't have any time to actually digest the realisation – because moment later, there are spells in the air, there are people apparating in and there is a lot of shouting. It goes from calm to absolute chaos very fast, and he has no hope of even trying to keep up with all the spell work.</p>\n<p>\"Mr. Grindelwald! I have a nice set of chains waiting for you but first –!\" Graves lunges at his apparent twin and then, with very little finesse, punches the man across the teeth.</p>\n<p>Newt winces – he's done that, once, and never again. He'd almost broken a knuckle – but judging by the enraged expression, Graves doesn't care if he does break a few fingers in the process of doing Grindelwald's face – which is still wearing his own face – some irreparable damage. He seems to enjoy it too.</p>\n<p>Newt shudders and looks away from the sheer violence of it. Instead he searches wildly for his suitcase, for any hint or sign of it – there, by a collapsed table, corner of a familiar leather case… and that's when he sees it.</p>\n<p>The Obscurus.</p>\n<p>It hangs above them like a dark cloud, spread all across the church ceiling – because that's where they are, in the Second Salem Church. The whole place is wrecked, tables and chairs thrown every which way, but Newt hardly cars because the Obscurus –!</p>\n<p>It's <em>massive</em>.</p>\n<p>\"Credence?\" Newt whispers in horror.</p>\n<p>Except – no, there, he sees it. The faint sheen of a shield, a shell stretched thin by the sheer size of what it was trying to hold in. He knows the shield. He <em>invented it</em> specifically to hold an Obscurus and he was the one who cast it. He'd cast it on the Obscurus from Sudan.</p>\n<p>Obscurus which had never been this immense.</p>\n<p>\"What – what did you do?\" Newt asks with horror and turns to look at the two Graveses – one of whom is once again more injured than the other. \"What did you do?!\"</p>\n<p>\"Mr. Scamander?\" Graves asks as Newt stumbles over, as he grabs at Grindelwald and shakes him.</p>\n<p>\"What did you do?!\" Newt demands and points upwards. \"The Obscurus was never this big – what did you do to it, how did you make it bigger?!\"</p>\n<p>There are cries of alarm as people look up and see the dark shadow looming above but Newt ignores them, shaking now the grinning Grindelwald again. \"What – did – you – do?!\"</p>\n<p>\"Growth, wasn't it, Mr. Scamander?\" Grindelwald grins through bloodied teeth. \"That's what you said – I just helped it grow a little more –\"</p>\n<p>\"How?\" Newt asks, feeling all the blood draining from his face. \"That should be – how?\"</p>\n<p>\"I fed it,\" the mad wizard laughs. \"I fed it a useless little <em>squib</em>.\"</p>\n<p>Newt freezes. \"Credence.\"</p>\n<p>Grindelwald cackles and Newt for a moment seriously considers punching him like Graves had done and damn broken fingers – \"You – you<em> </em><em>fed</em> Credence into –\"</p>\n<p>\"You should have seen it, how it devoured him,\" Grindelwald tells with gleeful light in his eyes. \"Researcher like you would surely appreciate it – it was almost beautiful. Not much magic in a squib – but look how it grew! Imagine if we gave it a wizard!\"</p>\n<p>Newt is shaking, trembling like there is an earthquake and he alone is caught in it. He isn't even sure if it's fury he's feeling or something worse – just that he <em>feels</em> a lot of it. He's trembling to his very core, and when a hand rests on his shoulder he almost jumps out of his, skin.</p>\n<p>\"Newt – what is that thing? \" Graves asks seriously, looking worried as he peers up at the shadow and magic churning above them.</p>\n<p>\"It's – it's the Obscurus that grew inside a little girl – I –\" Newt stammers, looking up in despair.<em> </em><em>Credence</em>.</p>\n<p>\"Obscurus?\" Picquery asks sharply. \"There hasn't been an Obscurus in a hundred years!\"</p>\n<p>\"There hasn't been anti-magic society like this either,\" Grindelwald says, cutting and waves a hand limply at the church around them. \"New Salem Philanthropic Society of Child Abusers and Scourers. <em>These people</em>, and you left a magical child in their care – tell me, madam Picquery, this masquerade, this non-involvement, these <em>laws</em> of yours – who do they protect, really?\"</p>\n<p>The look in Picquery eyes could've cut steel. \"Aurors, take him in,\" she orders coolly and looks up. \"And this Obscurus – it's no doubt the cause of our recent incidents. Destroy -\"</p>\n<p>\"No!\"</p>\n<p>Newt moves before he can even think it – he throws his hand out and the Swooping Evil flies out, right at the President pointing her wand upwards. The witch's hand is knocked down, then the Auror next to her and the next – like all Newt's rescues, the Swooping Evil isn't very fond of wands and he takes great pleasure in knocking as many of them out of their owners hands.</p>\n<p>Right now, though, Newt is in terrible need of wand himself, so he quickly rummages through Grindelwald's coat until he comes away with a wand. \"Please, let me handle it,\" he says, trying to somehow step between the Aurors and the Obscurus – even though it's above them and no one could hardly miss it. \"I know how to deal with it, please, let me handle it.\"</p>\n<p>\"Mr. Scamander!\" Picquery snaps, looking furious, clutching onto the hand the Swooping Evil had knocked against</p>\n<p>\"Please – it doesn't need to be killed,\" Newt pleads as he catches the Swooping Evil again and hides him from sight. \"Look, it's not doing anything, it's not harming anyone, and it's contained – please, let me handle it,<em> </em><em>please</em>!\"</p>\n<p>Picquery looks furious. \"Mr. Scamander, my patience is wearing <em>very</em> thin with you,\" she says through clenched teeth and summons her wand back into her and with a flick of her wrist. She points it at Newt and she looks rather like she's like to handle him with her wand and be done with him once and for all. \"What do you mean, handle it?\"</p>\n<p>\"I can contain it – I can make it – safe,\" Newt says quickly which is technically true anyway. \"I've studied Obscurials, I have even treated one – a girl, in Sudan,\" which went terribly, but it was still a treatment, \"I know what I am doing, please. It's not harming anyone. <em>Please</em>.\"</p>\n<p>Picquery's eyes narrow but she takes a slow breath and looks up – and true enough, the Obscurus is not doing anything. It just toils slowly above them like a brewing storm.</p>\n<p>\"The man has known his stuff so far,\" Graves comments from where he is watching like a hawk while the Aurors shackle Grindelwald.</p>\n<p>\"For given value of <em>know</em>. Fine – go ahead then, Mr. Scamander,\" Picquery says through gritted teeth and rests her hands at her hips. \"Handle it.\"</p>\n<p>\"Um,\" Newt answers. \"Little space maybe?\"</p>\n<p>Her eyelid twitches dangerously and Newt swallows, squirming.</p>\n<p>\"I'll stay with him,\" Graves offers. \"If something goes wrong –\"</p>\n<p>\"If something goes wrong, Mr. Graves, and I see a shred of that thing outside, I'll have this entire property <em>vanished</em>,\" Picquery says tightly. \"Along with everyone and everything within it and I will call it a job very well done.\"</p>\n<p>With that said, she turns on her heel and marches out, the Aurors trailing after her with gagged and chained Grindelwald in tow.</p>\n<p>Newt blinks. \"Why are all the women so bloody scary here?\" he asks in bewilderment.</p>\n<p>\"Welcome to New York, friend,\" Graves let's out a bark of a laugh and then looks up. \"Now what, exactly, are you going to do about<em> </em><em>that</em>?\"</p>\n<p>\"What I promised – I'm going to save him,\" Newt says and looks up. The thing is remarkably calm for an Obscurus – even before, when it had been so much smaller, it had been more active. Now it looks little more like cloud of smoke, hanging in the rafters after bit of cooking gone wrong - if… slightly more intimidating.</p>\n<p>Newt takes a fortifying breath before lifting Grindelwald's wand. \"Finite.\"</p>\n<p>The shield around the Obscurus pops like a soap bubble and a shudder runs through the cloud of dark, churning mass as it stretches out, no longer confined. It starts to slowly drift downward – but there seems to be no intent behind it, no actual direction it's taking. Its just mindlessly drifting.</p>\n<p>Newt watches it keenly, but it is indeed not actually… doing anything. \"Graves, could you find my suitcase, please?\" he asks quietly, staring at the cloud.</p>\n<p>\"It's just over there I think – I'll get it,\" Graves says and heads over to get it. His steps echo in the now quiet church and they're uneven – he's limping. Healers had taken care of most dire injuries – but not all of them, it seems.</p>\n<p>Newt still feels the sting of his own and for a moment he wonders what happened to Mary Lou Barebone. She should've woken up by now – and no way had Grindelwald done all of this in her church without her noticing. She must've woken up… and ran into Grindelwald in midst of doing whatever he'd been doing.</p>\n<p>Newt doesn't like the woman – but he still hopes she isn't dead.</p>\n<p>\"Here,\" Graves says carrying the suitcase over and quickly undoing the chains around it.</p>\n<p>Newt glances down and then crouches down to open the case, peering inside. Its dark down there – darker than it should be. Newt flicks Grindelwald's wand and casts a lighting charm – and when that doesn't work, a finite. The darkness is dispelled instantly – and then he sees Queenie's crumbled form lying on the floor below, completely still.</p>\n<p>\"Oh. Oh no,\" Newt whispers, his breath catching.</p>\n<p>\"Is that – is she –?\" Graves asks and then, without waiting for Newt, the man jumps down, stumbling little on his down the ladder. He kneels there and Newt stares down desperately as Graves checks for Queenie's pulse. He can't see any blood but –</p>\n<p>\"She's breathing,\" Graves reports back up to him, and them moves where Newt can't see him. \"Auror Goldstein is alive too, just knocked out cold!\"</p>\n<p>Newt sags a little and just breathes for a moment. \"Can you see two girls, wearing Muggle clothes?\" he asks then desperately.</p>\n<p>Graves looks around and shakes his head. \"Not here but – how big is place?\"</p>\n<p>\"About an acre or so,\" Newt informs him rather despairingly</p>\n<p>\"How did fit an<em> </em><em>acre</em> in a suitcase?\" Graves asks incredulously, peeking up from below.</p>\n<p>\"Very carefully,\" Newt admits with a shake of his head. \"And with great deal of errors in the trial and error part of the process. Almost blew up my entire flat, and part of the city block, while working on it.\"</p>\n<p>\"Somehow that doesn't surprise me,\" Graves mutters. \"Do you want me to go look for them?\"</p>\n<p>Newt hesitates. This Graves isn't Grindelwald– but Grindelwald had still operated with the same face… \"Wait a moment, please,\" he says. Little calmer now, he looks up at the Obscurus again.</p>\n<p>It's still just... drifting.</p>\n<p>\"Hey,\" he says, and his voice wavers terrible. \"Credence. Why don't you come down? We should go and make sure your sisters are alright, okay?\"</p>\n<p>No reaction what so ever, not as much as a quiver. It's like talking to an illusion, and not… not a person.</p>\n<p>Newt bites his lip – it feels dry and grimy under his teeth. \"Credence, please, come down to me,\" he says, whispers really, and his voice shakes terribly. \"We need to go check up on Chastity and Modesty. Credence, <em>please</em>.\"</p>\n<p>Nothing.</p>\n<p>Newt's face crumbles and he looks down, his throat aching. He can feel Pickett at his neck, trying catch his attention – and even the Swooping Evil is staring at him. Graves is probably too. Newt wipes at his face with a shaking hand. \"Oh Merlin this is why I shouldn't try to deal with people, I'm absolute rubbish at this,\" he whispers and looks up. \"I never get this right, do I?\"</p>\n<p>\"Newt,\" Graves murmurs from down in the case.</p>\n<p>\"Give me a moment – I just,\" Newt takes a deep breath that rattles terribly in his throat, and closes his eyes. \"I just need a moment.\"</p>\n<p>Another Obscurial – he'd failed another Obscurial. Why couldn't he ever help them? Worse than failed, he'd all but led Credence to his fate – he'd kept the Obscurus, he told Grindelwald about it, he'd all but made this happen. Another Obscurial, gone, and all he has left of them is the Obscurus that killed them.</p>\n<p>There is a questioning little thrill of a bird song – Fawkes, somewhere above, probably very confused about the Obscurus still hanging about and...</p>\n<p>Newt sighs shakily as a thought pops in his head. Blinking rapidly against the moisture in his eyes, he looks up.</p>\n<p>The Obscurus<em> </em>is still there. He broke the shield – but the Obscurus is still there. It's just floating there, not reacting, not doing anything, but it is still there.</p>\n<p>And an Obscurus can't survive without a host. It fizzles out like bit of smoke, it's power spent, it's terrible might worn out. This one should have too… by any reason, it should've disappeared by now.</p>\n<p>\"Oh,\" Newt says slowly and bounces up to his feet, his eyes wet but wide. \"Oh!\"</p>\n<p>The Obscurus doesn't react – but it's still there. </p>\n<p>The suitcase is an absolute zoo.</p>\n<p>The screens separating habitats are all trashed, and the creatures are running wild. The Nundu is roaring somewhere – judging by the sound of it, it's probably facing off against the Graphorns. There are Occamies as big as Muggle cars flying wildly in the air above the habitats, amidst the water bubbles, and there's the Cockatrice, running about. Newt can hear the clicking if the Dungbeetles and cries of the Fwooper and somewhere in the midst of it all the Doxies and Billywigs buzz in agitated cacophony.</p>\n<p>Newt stares the mess made of his home in horror, one hand holding up his wand which on other hand is holding up the still inert Obscurus. Behind him, Graves is trying to revive the Goldstein sisters.</p>\n<p>\"I take its not usually like this?\" the Auror asks dryly.</p>\n<p>\"No, no it isn't,\" Newt says faintly, watching the Niffler scamper away with his brass scales. Then he shakes his head. \"Graves, could I trouble you for a Sonorus? My wand's a bit busy.\"</p>\n<p>\"Just a moment,\" Graves says and with a gasp Queenie comes to.</p>\n<p>\"You!\" she growls.</p>\n<p>\"Whoa, Lady, calm down – I'm not him,\" Graves yelps out, skittering backwards.</p>\n<p>\"You, you terrible disgusting – I'm going to smack you a new one, I'm going to – Newt?\" Queenie asks with surprise and them stops to stare at the mass of darkness hovering above Newt's head.</p>\n<p>\"Hi Queenie – it's not him,\" Newt says, still staring at all the chaos in alarm. \"That's the real Graves – the one from before was all polyjuiced. Graves, please – before they hurt each other…\"</p>\n<p>\"Alright, alright,\" the Auror says, skirting around confused looking Queenie to press his wand tip against Newt's neck. \"Go.\"</p>\n<p>Newt drops his centre of weight a bit and breaths deep into his belly – and then he roars deep from his chest. It's a very respectable dragon roar, if he says so himself, with the definite edge of a Ukrainian Ironbelly – like groaning metal. And Graves is no pushover when it comes to spells – the noise Newt makes easily fills the entire place and brings the chaos to a grinding halt.</p>\n<p>\"MUMMY IS <em>VERY</em> DISSAPOINTED IN ALL OF YOU,\" Newt says severely now that he has everyone's unflinching attention. \"BACK TO YOUR ROOMS, RIGHT NOW.\"</p>\n<p>There are whines and pathetic little moans in the air but Newt is relentless. \"DON'T YOU MOAN AT ME – LOOK AT THE MESS YOU'VE MADE! AND FIGHTING! IN MY HOUSE! OH MUMMY IS VERY DISSAPPOINTED INDEED! BACK TO YOUR ENCLOSURES, THIS INSTANT!\"</p>\n<p>He waits until he's sure everyone is slinking back to their places before nodding to Graves. \"There's a can of cockroaches over there – grab it, will you?\"</p>\n<p>\"Cockroaches – yeah, sure, but –<em> </em><em>Mummy?</em> Seriously? And there he goes, okay,\" Graves sighs as Newt hurries off.</p>\n<p>First things first, Newt needs the sky box clear – and currently it's full of confused and alarmed Doxies, Billywigs, terrified baby Occamies and all the water bubbles are scattered around too...</p>\n<p>Graves comes after him with the jar, which Newt opens one handed while it is still in the man's grip. He grabs a hand full of squirming bugs and then whistles sharply upwards to catch the babies' attention. Holding the handful of bugs up for them to see, Newt waits until he's sure they've all noticed – and then he throws a whole handful into the hatchery.</p>\n<p>Everything trembles and the whole place seems to let out a sigh of relief as the Occamies rush down, shrinking as they go. Moment later they have a dozen more manageable little handfuls of snakes, as opposed to dozen giant behemoths, and the sky is a little bit clearer.</p>\n<p>The baby Occamies whine piteously at him even as they rush about the nest to catch the cockroaches.</p>\n<p>\"There you go – no, shh, I'm not mad with you, but honestly – flying around, so soon?\" Newt asks with an arched eyebrow as he gives each a quick pet. \"You do grow up fast don't you?\"</p>\n<p>\"I'll say,\" mutters Graves who is clutching at his wand, staring at the nest.</p>\n<p>With the Occamies out of the sky, it's the Doxies' and Billywigs' turn. \"Graves, can you give me a mild breeze – easterly,\" Newt asks and points. \"I need everyone in the air that way, over the forest.\"</p>\n<p>\"You have a forest in your suitcase,\" Graves says with arched eyebrows.</p>\n<p>\"Just a small one?\" Newt offers apologetically. \"Quickly now, please.\"</p>\n<p>Shaking his head, Graves does as asked, conjuring up a wind which, while a little stronger than Newt would've liked, does the job. There is a lot of indignant buzzing as everything is pushed towards the forest – Graves even sends the water bubbles away, clearing the skies above them.</p>\n<p>\"Excellent, well done, thank you,\" Newt says and then lifts Grindelwald's wand. \"Up you go,\" he murmurs and gently conducts the Obscurus up and into the sky box. It flows past the threshold to where there is no gravity to hold it and then it hangs there, still inert – but still very present, looking more like storm cloud than ever. \"There, safe,\" Newt murmurs.</p>\n<p>Then he turns on his heel and runs to Frank's enclosure, leaving behind a somewhat exasperated Graves.</p>\n<p>The plains enclosure is, like every place else, completely trashed. The screens are torn down and the biome enchantments are wrecked – so are the containment charms that should keep the weather from spilling from one enclosure to another. The only reason Frank isn't raining everywhere... is because he's down.</p>\n<p>Newt heart almost stops at the sight of it – the thunderbird is lying on the ground, one of his wings limb at his side and Chastity is on her knees beside him, desperately trying to comfort him. And Modesty –</p>\n<p>Modesty is standing like a knight over her sister, feet firmly planted at shoulder width, a wand in hand – the toy wand Newt had charmed to glow. She is pointing it at… Mary Lou Barebone?</p>\n<p>\"Modesty Barebone, you put that<em> </em><em>disgusting</em> thing down this instant and step aside!\" Mary Lou is all but screeching. \"And Chastity, get away from that foul demon or I'll –\"</p>\n<p>Newt doesn't even think about it – he just stuns her. She goes still mid rant and then falls – and really, he doesn't even care because, \"Modesty – Chastity!\"</p>\n<p>\"Mr. Scamander!\" Chastity wails out and Modesty drops the wand to run to him. Newt catches the girl in mid stride and carries her all the way over to Chastity.</p>\n<p>Chastity's lower lip quivers. \"I'm – I'm sorry, Mr. Scamander – he tried to stop him, that dark wizard, from taking Credence and he got hurt and there wasn't anything we could do – and the<em> </em><em>she</em> appeared and –\" she babbles anxiously. \"– and we didn't know what to do and there was all this noise coming from outside and we didn't dare to go look for help and –\"</p>\n<p>\"Shh, Chastity it's alright, it's alright, love, it's okay,\" Newt babbles right back, wrapping an arm around her, stroking hand over her hair. \"Oh Merlin, you're safe – I was so worried. Thank heavens, you're safe. Its okay now, it's over – the dark wizard is gone, it's over...\"</p>\n<p>\"What about Frank?\" Chastity asks worriedly. \"He got hurt.\"</p>\n<p>Newt looks down and Frank sighs, relaxing against the ground now that the danger is over. \"Oh Frank,\" Newt murmurs and then, releasing Chastity to get his wand arm free, he runs a quick scan over the Thunderbird. \"I can fix this. He has few broken bones and has taken a terrible blow to his chest – but don't worry, they're sturdy creatures, Thunderbirds. I can heal him.\"</p>\n<p>The girls sag against him in relief and Modesty sniffles in exhaustion – and Newt remembers that, long ago, they'd woken the girls up late in the night and he isn't sure if they'd gotten any rest since.</p>\n<p>\"What about Credence?\" Modesty asks. \"Did you save Credence? Where is he?\"</p>\n<p>\"I'm sorry, I didn't get there on time – Credence got hurt,\" Newt admits, making a face and looks up, at the Obscurus hanging above them. \"But I swear, I'm going to do everything in my power to fix it.\" Even though he wasn't sure how.</p>\n<p> </p>\n<p>Graves is done explaining what happened to angry looking Tina and Queenie by the time Newt leads the girls – and still stunned, floating Mary Lou – back towards the office-shed. Fawkes is there too, back on his old perch, preening his feathers fastidiously.</p>\n<p>\"Newt, girls,\" Queenie sighs with relief at the sight of him. She's sitting on the ladder, halfway of the suitcase, keeping watch on the outside. \"Is everyone alright?\"</p>\n<p>\"More or less – bit banged up but alive,\" Newt sighs and lowers Mary Lou to the floor. \"Are you alright?\"</p>\n<p>\"I feel like an idiot, but aside from that all I got is a headache,\" Tina answers and looks at the Muggle woman, making a face. \"How did <em>she</em> get in here?\"</p>\n<p>\"I haven't got the foggiest,\" Newt sighs, sitting down on nearest surface and running a hand over his face – and then stopping when Modesty tugs at his sleeve.</p>\n<p>\"Isn't that him?\" She asks, her voice shaking a little. \"The dark wizard – isn't that him?\"</p>\n<p>She's pointing at Graves who makes a guilty face.</p>\n<p>Newt sighs and quickly lifts her up to his lap. \"It isn't. There is a potion that let's a wizard – or a witch – look like someone else. The dark wizard was using it. It wasn't Mr. Graves at all, just somebody else using his face. This Graves is perfectly fine, I promise. If a little scruffy.\"</p>\n<p>\"Thanks Newt, nice to hear your honest opinion,\" Graves himself says flatly.</p>\n<p>Newt winces a little. \"Well… um, sorry.\"</p>\n<p>Graves shakes his head and then, crouching down to look at Modesty in the eye. \"I'm so sorry about the bad wizard,\" he says very earnestly. \"We've stopped him now though, so it's okay. Newt and me, we kicked the s-\"</p>\n<p>\"Sir,\" Tina says sharply.</p>\n<p>\"-stuffing out of him,\" Graves finishes, giving her a glare. He turns to Modesty again. \"My name's Percival and I'm really not that bad, I hope. Even if I am… <em>scruffy</em>.\"</p>\n<p>\"Percival – like the knight?\" Chastity asks, leaning on Newt's shoulder. \"From Arthur and the Knighs of the round table??\"</p>\n<p>Graves sighs the sigh of a man long since grown tired of the jokes \"Yes, exactly like the knight.\"</p>\n<p>Newt smiles a little at that and looks away and past the office-shed's walls, into the open area beyond. Little more open now, with most of the walls down. His home is, still, a wreck. \"I should do something about this – and get the girls a place to sleep...\"</p>\n<p>\"I'm not tired,\" Modesty says, tiredly.</p>\n<p>\"We should deal with<em> </em><em>her</em>,\" Tina says, looking at Mary Lou darkly.</p>\n<p>\"And we should head back – half of the Auror force is waiting outside, among which is Madam President,\" Graves says and stands up with a wince, rubbing at his back. \"And they looked mighty wand happy the last I saw them.\"</p>\n<p>Newt hesitates, looking at his home, at the girls – and then up at the Obscurus hanging above. There is so much to do.</p>\n<p>\"You stay here, Newt,\" Queenie says from the stairs. \"We'll take care of it, alright?\"</p>\n<p>\"Properly this time,\" Tina says with grimace and stands up as well. \"Though Newt, seriously – <em>security features</em>. Notice me not charms at least.\"</p>\n<p>Newt winces. \"Quite right,\" he agrees. \"First thing once I have the time.\"</p>\n<p>\"If you don't have the time, I'll add in some myself,\" Tina threatens.</p>\n<p>\"Please don't tamper with the man's suitcase, Auror Goldstein,\" Graves says with a look of suffering on his face. \"He apparently almost blew to a city block just making it.\"</p>\n<p>Tina pauses in the middle of levitating Mary Lou up the ladder. \"Why doesn't that surprise me?\" she asks flatly.</p>\n<p>\"You know what – out, out of my suitcase, all of you,\" Newt says and makes a shooting motions while Chastity and Modesty giggle tiredly. \"I have a couple of hundred very stirred up creatures to soothe and dozen habitats to fix and –\"</p>\n<p>\"Couple of<em> </em><em>hundred</em>? Newt –\"</p>\n<p>\"Out!\"</p>\n<p> </p>\n<p>Newt makes a nest of an enlargened, ten foot wicker basket, filling it with straw and Cockatrice feathers and covering it with blankets. It's a crude sort of bed, but soft enough and it should do in a pinch – and as he lies half asleep Modesty on it, she doesn't seem to mind it. Chastity climbs in after her without complaining either.</p>\n<p>\"I'll get you a proper bed as soon as I can,\" Newt promises while fiddling with the blanket. He's never tucked anyone in before, he's not quite sure about the procedure. \"As nice as you like, I swear.\"</p>\n<p>\"Basket is fine, though it smells a bit,\" Chastity yawns and then looks a little guilty. \"I mean – like, feathers. Not bad, it doesn't smell bad. I'm not complaining.\"</p>\n<p>\"It's fine to complain if something is wrong and even when it isn't,\" Newt says and waves Grindelwald's wand over the basket, casting a no-scent charm on it. \"And smell is an easy thing to fix. Better?\"</p>\n<p>Chastity hesitates and then nods. \"You'll stay here?\" she asks sleepily.</p>\n<p>\"I'll be right here, and always in hearing range,\" Newt promises and then awkwardly hands her the blanket. \"It's alright – just go to sleep now.\"</p>\n<p>Then, while Chastity lays the blanket over her sister and herself and lays down properly, Newt turns around, wand in hand, and goes to work.</p>\n<p>And oh Merlin there is a lot of work. The creatures are stirred up and still stinging from his earlier rebuke and their habitants are almost all completely ruined. Newt brings them food and treats and spoils them with petting and cuddling while re-erecting the screens and repairing shredded spells everywhere he goes. It seems like there isn't a spot of the place Grindelwald hadn't smashed up.</p>\n<p>At least the Occamies are happy, and aside from Frank most things with wings had weathered the destruction quite well. Lot of the water bubbles had gotten smashed together and it takes Newt a while to separate the Marmite from the Grindylows, but aside from few a scrapes and slight cuts, everyone seems more or less fine there.</p>\n<p>Newt makes a new barrier up into the sky box while he's at it, a small air current to separate the Obscurus from everything else floating up there.</p>\n<p>\"Alright there, Credence?\" Newt asks, but there's still no reaction. So, with a sigh and shake of his head, Newt continues on.</p>\n<p>The poor Mooncalfs whine pitifully when he comes around – it takes a double dose of treats and about as much cuddling to get them to stop making sad eyes at him. Nothing makes sad eyes quite like a Mooncalf. \"Aww there you go – see, Mummy isn't mad at you, I was just terribly worried...\"</p>\n<p>Its task and a half untangling from them to go and see to the Bowtruckles. Pickett hangs by Newt's labels as he does and refuses to join the others – but as far as Newt can see there is no damage done to their home tree, so he's willing to let it slide. He does give them all a hefty share of woodlice though.</p>\n<p>The Erumpent head butts him almost strong enough to knock him out so she's fine. The Nundu however is especially spiky with him and refuses to give into soothing words or even bribery of treats – and the Graphorns almost chase him out of their enclosure entirely. And no wonder.</p>\n<p>Apparently he'd gotten there just in time to stop the Nundu from eating their foal.</p>\n<p>\"Oh no,\" Newt gasps at the sight of her. Damn Grindelwald. What kind of mad man went and broke the containment on a<em> </em><em>Nundu</em>? \"Come on now, let me see her,\" he murmurs to the Graphorns as he squeezes in between them. They snuffle at him in distress, tendrils tugging at his hair. \"Shh, it's alright, let me see her, let's see what we can do for her...\"</p>\n<p>There's not much he can do, it turns out. Not much at all.</p>\n<p> </p>\n<p>Newt is utterly exhausted and mentally drained by the time a knock sounds in the office and Tina peaks her head in. \"Everything alright? What's that?\" she asks, listening to the distant groaning.</p>\n<p>\"Graphorns,\" Newt answers tiredly, sitting heavily down on the steps of the office-shed and staring at the basket where Chastity and Modesty are still sleeping. He'd set up a Silencio over them, so they wouldn't be disturbed by the cries. \"Their foal just died. The last mating pair – it took almost two years before they had her, and now she's...\" Newt wipes at his face and he's just so, so tired.</p>\n<p>\"I'm sorry,\" Tina whispers and slowly descends into the office-shed. \"I'm so sorry, Newt. Was it Grindelwald?\"</p>\n<p>\"He broke the containment barriers – the Nundu got loose,\" Newt says fully and looks down at his hands. There scraped and bloody – he hadn't even noticed. \"Its not the Nundu's fault – it's just her nature. The foal was weakest of the herd and I wasn't here to feed any of them and –\"</p>\n<p>\"It's not your fault,\" Tina says and sits down on the stairs beside him. \"It wasn't. Its Grindelwald's – you just try to help these creatures. He's the one who went and deliberately destroyed everything. It wasn't your fault, Newt.\"</p>\n<p>Newt swallows the weary sob trying to break loose, if just barely. \"How – how is it going, with MACUSA?\" he asks desperately, trying to breathe steadily</p>\n<p>\"It's… a mess but they're figuring it out,\" Tina says, still watching him worriedly. \"We have the full story more or less compiled now, though Grindelwald is, obviously, not talking.\"</p>\n<p>The story goes like this: Two months ago, Percival Graves had been investigating a minor magical incident when he'd been taken down, from behind, by Grindelwald. He'd been kept prisoner in his own flat ever since, with Grindelwald slowly assuming his identity and taking over his place at MACUSA.</p>\n<p>\"We don't think he knew about the Obscurus then – there weren't any incidents yet, so nobody knew,\" Tina says. \"I think he came here just because of the No-Maj election and because of how tense things are here right now – looking to stir trouble, maybe even start a conflict between us and No-Majes. He was very into investigating hostile and suspicious Now-Maj activity in the beginning. Like the New Salem Philanthropic Society.\"</p>\n<p>It had been an official investigation and everything – they'd gone through the church with a fine toothed comb, looking into Mary Lou's background, her knowledge, her intelligence and where she got it from. General consensus was that she was related to the Scourers, seeing as lot of Anti-Magic No-Maj societies were somehow connected to them. It had been deemed generally a <em>non threat</em>, regardless of her suspiciously close information.</p>\n<p>And then Tina had witnessed Credence being beaten by his mother and stepped in to stop it – and everyone had been Obliviated and Tina was suspended from Auror duties.</p>\n<p>\"And as you know, after that, the Obscurus attacks started,\" Tina continued with a sigh. \"And who even knows how Grindelwald recognised them for what they were, but he did. After that he must've been hounding on the Second Salem Church and, eventually, Credence without knowing that Credence himself was the Obscurial he was looking for.\"</p>\n<p>\"So MACUSA knows Credence is an Obscurial?\" Newt asks.</p>\n<p>\"They... know he<em> </em><em>was</em> one,\" Tina says slowly, watching him. \"As far as we know, Credence is dead – killed by the inert, lifeless Obscurus of a Sudanese girl you told me and Queenie about, which you kept in your suitcase for study and which Grindelwald brought out. You know I had to report it all, but – are you saying Credence isn't –\"</p>\n<p>Newt shakes his head. \"What happened after Grindelwald took the case? I was knocked out for a while – how come he took it to the church?\"</p>\n<p>\"Why knows – for irony?\" Tina says, still frowning at him a little. \"From what Graves could guess – and he's spent most time with Grindelwald so his guesses are better than anyone else's – Grindelwald was planning to build up the Obscurus somehow, make it stable and bigger, and just... unleash it. That was his plan since the beginning – to just unleash the full force of the Obscurus at the No-Majes to create a big enough magical incident that it couldn't be covered up again.\"</p>\n<p>\"And which would reveal magic to Muggles,\" Newt guesses and shudders.</p>\n<p>\"And start a global civil war,\" Tina agrees grimly. \"Apparently that's his goal – to start a war with No-Majes and bring wizards out of the shadows, or where ever he thinks we are lurking in.\"</p>\n<p>Newt sighs and runs a hand over his face. He really isn't build for these sorts of things – big world ending events and evil wizards and whatnot. It goes way, way past his area of expertise. \"And Mary Lou Barebone?\"</p>\n<p>\"He brought her into your suitcase the same time he got Credence out – Queenie saw all of it,\" Tina says and then smiles proudly. \"She fought him like hell to keep him from getting in. Graves thinks that's why he didn't fight half as hard as he should've – Queenie softened him up good.\"</p>\n<p>Newt nods, but can't really muster up an answering smile.</p>\n<p>\"Anyway, Mary Lou was the perfect witness to spread the word among No-Majes, I suppose – and maybe that's why he kept her alive,\" Tina finishes. \"She's been Obliviated now, obviously, and we even fixed her foul church, more's the pity.\"</p>\n<p>Newt licks his parched, bloodstained lips. \"And... her children?\" he asks and then frowns as the witch shifts guiltily where she sits. \"Tina?\"</p>\n<p>\"I uh... handled the Obliviation this time and, well,\" Tina looks studiously away. \"I doubt she remembers she had kids when she wakes up, to be honest. We might have also cleared out any sign of them from the church. Pure accident, really. And the clean up crew deal with the rest. Queenie, ah… persuaded them. This time next week it will be as if the Barebone children never existed.\"</p>\n<p>Newt stares at her with wide eyes.</p>\n<p>\"Queenie and I, we're going to try and push for adoption – for you, I mean, so that you can adopt those kids, officially,\" Tina adds. \"Madam President is so angry right now that she might just give into it, if not for any other reason then to just shut us up. And Graves is being a down right – well, he's going to be cashing in on guilt about no one noticing he'd been replaced for a long time, and he seems to like you well enough so he might help...\"</p>\n<p>Newt just shakes his head in wonder.</p>\n<p>\"That's what I came down here to tell you, actually – and that we're at our place, Queenie's and mine,\" Tina adds, looking away with some embarrassment as she goes on. \"You are technically in my custody until further notice. They want your statement at the office and Queenie wants to help you build up a place for the kids down here, because house isn't a home without a bit of woman's touch, apparently – I think she has your kitchen all planned out already and…\"</p>\n<p>She trails away, her eyes widening. Newt follows her gaze and together they stare, more confused than anything, as the Obscurus starts to drift down from the sky box. Like smoke, drifting forwards, it bunches up in a single point near the floor and slowly, painstakingly slowly, reforms into a shape.</p>\n<p>Newt opens his mouth and no sound comes out and he can only stare. Credence is pale and shaky as he kneels there, clenching his hands at his side. The shadows under his eyes – and in them – are pronounced and deep as he looks up at Newt and Tina… but his eyes are clear.</p>\n<p>Without a word, Credence turns and crawls into the basket with his sisters. There he curls up around them protectively and with a heavy sigh falls into exhausted slumber.</p>\n<p>Newt is trembling terribly, he realises, and half way up from the stair before he falls back down beside Tina. He'd <em>hoped</em> and he'd <em>wished</em> but he hadn't known for sure and he'd been so very worried and now...</p>\n<p>\"Not dead, then,\" Tina whispers in wonder.</p>\n<p>\"O-oh,\" Newt answers shakily. \"Oh I – I think I'm going to –\"</p>\n<p>Tina winds her arm tightly around his waist as it becomes all too much and Newt finally breaks down.</p>\n<p>Newt woke up to whispers, his neck aching and his head pounding – and the familiar feeling of something squirming in his lap, scratching at his vest pocket.</p>\n<p>\"You do know I've charmed it so that you can't get to it, don't you?\" Newt asks and peers down a bit blearily. He's sitting against the office-shed's wall, and the Niffler is scowling at his pocket watch, which despite all of his attempts would not budge from Newt's pocket.</p>\n<p>\"Why does it want your pocket watch?\" a little girl's voice asks and Newt looks up to see both Modesty and Chastity looking down at him from the basket, leaning their chins on the wicker side.</p>\n<p>\"Because he's a little magpie and likes all things shiny,\" Newt says and scoops the Niffler up and to his arms before jumping to his feet. It feels like every bone in his body creaks as he stretches his limbs out, but he ignores it. \"Alright there, girls?\"</p>\n<p>\"We're fine,\" Chastity says.</p>\n<p>\"We're hungry,\" Modesty disagrees.</p>\n<p>\"We best be seeing about getting you something to eat then,\" Newt says and peers into the basket. Credence is still there and still fast asleep, the shadows under his eyes still terribly dark. The girls had spread the blanket over him and he's all curled up in it, whole body pulled up in as small a space as he could manage.</p>\n<p>\"Is he alright? \" Chastity asks looking at her brother.</p>\n<p>\"I hope so,\" Newt says honestly, absently a scratching the Niffler's pouch to see if he had anything stuffed in there. \"Let's leave Credence to sleep for now and see about that food.\"</p>\n<p>Together they headed to the office-shed, where Newt usually had little this or that to snack on. There they found that somebody had thought ahead of them – there was pan under preservation charms there along with basket of bread, decanter of juice and all the necessary dishware. They'd even included a tablecloth.</p>\n<p>\"I suppose we have food, then, thanks to the Goldsteins,\" Newt comments while setting the squirming Niffler down and peers into the pan. \"Ravioli, I'd reckon.\"</p>\n<p>Then he smells it and realises he isn't sure when he'd last eaten and that he's famished. \"Right,\" Newt says while his stomach growls and the girls lean in to look. \"Let's set up a table outside and then we can have some food.\"</p>\n<p>Setting up the table involves him actually conjuring one up while the girls stare and then the girls dashing about, getting the dishware while Newt floats the hot pan over.</p>\n<p>\"Do we say grace?\" Modesty asks while Newt serves the food out for them.</p>\n<p>\"Do you want to say grace?\" Newt asks slowly, mostly because he hasn't the faintest idea what saying grace even meant. It was something Mary Lou did, possibly.</p>\n<p>Modesty frowns and looks at her sister who looks a bit conflicted. \"And... if we don't say grace...\" Chastity says slowly, watching him keenly for reaction</p>\n<p>Newt shrugs. \"To be honest, I've never felt anything lacking and I've never said it, so, really... it's quite up to you if you want to say it or not.\"</p>\n<p>Modesty frowns in concentration. \"I guess it would be a bit silly for witches and wizards to say grace,\" she says slowly. \"Since you worship the devil.\"</p>\n<p>\"I worship<em> </em><em>what</em>? \" Newt asks with a confused laugh.</p>\n<p>\"Modesty,\" Chastity hisses warningly.</p>\n<p>\"But don't they?\" Modesty asks obstinately. \"Don't witches and wizards worship the devil?\"</p>\n<p>\"Most witches and wizards don't worship much anything from what I've observed,\" Newt admits. \"Though I've met a couple of Hindu wizards and in Africa they have a myriad of very interesting beliefs – and there were those Buddhists I met in Tibet but I do believe religious wizards are fairly rare. I mean, of course you can't just go ahead and inquire people about their religious beliefs, that would be rude, but as far as I know…\"</p>\n<p>Modesty looks a little disappointed. \"So we're<em> </em><em>not</em> going to be devil worshippers?\" she asks while Chastity covers her eyes with her hand, looking embarrassed.</p>\n<p>Newt shakes his head with a laugh and serves the food out.</p>\n<p>They're half way through the ravioli – which is excellent – when a knock sounds from the office-shed and Queenie pokes her head in. \"Yohoo, is anyone awake yet? Hello Newt, good morning Chastity, Modesty! Oh, you like my ravioli?\"</p>\n<p>\"Morning, Queenie,\" he answers with a faint yawn. \"Did you make this? It's splendid.\"</p>\n<p>\"Oh, that's sweet of you – I just wasn't sure you had any proper food around here, what with there being no kitchen and all,\" she says and comes in, smiling. \"Hello girls – yes, Modesty, it really is Queenie, it's not a nickname.\"</p>\n<p>\"What?\" Modesty asks, looking a little alarmed.</p>\n<p>Queenie smiles, dimples on her cheeks, before looking at Newt. \"I came to tell you that Tina wants to visit the MACUSA today with you, to get your statement down. Do you – no, not right now, in couple of hours she said – she's headed to the office already but she'll be here to pick you up around noon.\"</p>\n<p>\"Queenie,\" Newt sighs.</p>\n<p>\"Sorry – it's just so nice, everyone being not scared anymore,\" Queenie says with a giddy little hop. \"Its always nicer when people are happier.\"</p>\n<p>\"How is she doing that?\" Modesty asks with wide eyes.</p>\n<p>\"She's a Legilimens,\" Chastity explains, surprising Newt a little. \"She can sort of read minds.\"</p>\n<p>\"Natural Legilimens, I'm afraid, I can't really help it,\" Queenie says. \"People's thoughts just drift into my head – and Newt is right, you should finish your food. You can come up when you're done if you'd like – I have little something for you girls.\"</p>\n<p>With that she heads off – giving the Niffler an affectionate scratch on her way to the ladder.</p>\n<p>\"Witches can read minds!\" Modesty whispers excitedly.</p>\n<p>\"Very few really – I certainly can't and I'm probably happier for it,\" Newt says, shaking his head. And just when he'd thought he'd gotten used to Queenie too. \"Its a rare and difficult talent – and Queenie is the only natural Legilimens I've ever met.\"</p>\n<p>Something groaned in the distance and there was a croon coming from the Cockatrice's enclosure – it was about time to get to work, soon everyone would be moaning at him. Newt finished meal quickly and stood up. \"Everyone else need their breakfast too,\" he says and sets his silverware down. \"This shouldn't take too long –\"</p>\n<p>\"Can I help?\" Modesty asks, quickly wolfing down her Ravioli.</p>\n<p>Newt hesitates for a moment. \"So as long as you promise to do exactly as I say – and be very careful,\" he then says, scenting the air a little. The atmosphere was better, but it was still a little tense and unhappy. \"The creatures are still a little spooked after yesterday. They'll need a little more spoiling before they'll settle completely and until they do, they might be a little rough. So we must be especially careful.\"</p>\n<p>\"Can I go see Queenie instead?\" Chastity asks carefully. \"Please?\"</p>\n<p>\"Of course you can if you'd like,\" Newt says. \"Tell her we'll come up when we're done, alright?\"</p>\n<p>She relaxes and nods and Newt leads Modesty to get some feed with him so they can get started on the work.</p>\n<p>Modesty is a fearless little girl – and almost painfully obedient. She isn't afraid of going near any of the creatures, not even when Newt holds her back and takes precautions. Thankfully she listens to Newt's every instruction like her life depends on it and follows them to the letter – but still, there is a measure of not-quite-disregard that worries Newt.</p>\n<p>Its almost as if she thinks animals can't hurt people. Like it's something only people can do.</p>\n<p>\"Modesty, these aren't domesticated creatures, not a single one of them,\" Newt says slowly. \"Do you understand?\"</p>\n<p>\"But they do as you say,\" Modesty points out while petting the Cockatrice's feathers.</p>\n<p>\"They do as I ask because I have their respect and they know they have mine  and I ask nicely,\" Newt says plainly. \"Not because they're obedient. They are wild creatures with will of their own. And they will act according to their nature even when we'd rather they didn't.\"</p>\n<p>Modesty frowns. \"What about Frank? Frank protected us.\"</p>\n<p>\"Frank is a special case,\" Newt sighs, not sure how to explain it. Frank, like Dougal and Pickett, wasn't precisely wild – they had all been born wild, but they'd gone through terrible attempts of taming at the hands of people. It was why they answered to names and why, sometimes, they acted completely outside their nature.</p>\n<p>It wasn't the same as being domesticated though.</p>\n<p>\"Thunderbirds can sense danger and no doubt he could sense the danger you were in,\" Newt settles on saying. \"And he knew I would've liked for him to help.\"</p>\n<p>Modesty frowns. \"So... they're not pets and I should be careful?\"</p>\n<p>\"Yes, precisely,\" Newt says and awkwardly rests a hand in her shoulder. \"Just respect what they are and what they can do. That way no one should get hurt.\"</p>\n<p>\"Alright,\" Modesty says. \"So how do we feed the flying fish bubbles?\"</p>\n<p>\"Ah, that,\" Newt says and conjures up a pair of slingshots. \"Normally I just do it by magic… but this way is much more fun.\"</p>\n<p>They're just about done feeding the Mooncalfs when Newt's eyes stray to the central clearing and he finds Credence, awake. The young man is sitting in the basket where he'd been sleeping, blanket draped around his shoulders as he hugs his knees and stares at nothing.</p>\n<p>\"Your brother is awake,\" Newt says to Modesty. \"Let's go say good morning, shall we?\"</p>\n<p>Modesty skips ahead of him, her shoes a bit dirty, her dress grass stained. \"Credence, good morning! We are feeding the creatures – and I got a slingshot, though it's really weak and I can only use it to feed the fish…\"</p>\n<p>Newt follows at a slower pace, if only very slightly. It gives him the opportunity to watch Credence,. And something… something is different. Credence is still stiff, his neck doesn't seem turn properly, he's still wound up tight and his fingers are stiffly white knuckled where they grip his legs ... but something seems to have eased up in him.</p>\n<p>\"Good morning,\" Newt says once he's close enough and Credence looks up warily. \"How are you feeling?\"</p>\n<p>Credence hesitates for a moment and then his stomach speaks for him, grumbling loudly.</p>\n<p>Newt relaxes a little at the sound. Functional stomach then – after such a complete discorporation it is a very good sign.</p>\n<p>\"There's food,\" Newt says, motioning to the conjured table. \"Ravioli, Queenie made it for us. It's really quite good. There's plenty for you.\"</p>\n<p>Credence moves like someone made of stone, slowly and stiffly and really its a wonder how he doesn't actually creak. \"Chastity?\" he asks, and his voice is hoarse.</p>\n<p>\"She's above, in the flat of the Goldstein sisters. Queenie had something for the girls – clothes I reckon,\" Newt explains.</p>\n<p>Credence watches him for a moment and then nods, taking seat slowly. Newt eyes the line of his shoulders critically and then serves him some food, still steaming hot thanks to the preservation charms.</p>\n<p>\"Will you tell me what happened?\" Newt asks, sitting down across the young man.</p>\n<p>Credence stares down a the plateful of Ravioli, his face perfectly still. Eventually he shakes his head slowly taking his fork and starting to eat. \"I'm… not sure,\" he admits.</p>\n<p>Newt considers that a moment and then changes tracks. \"Do you <em>remember</em> what happened?\" It gets a very begrudging nod between slow bites. \"But I suppose you don't really understand it. Do you?\"</p>\n<p>Finally Credence's face shifts and he frowns. He looks up slowly, not at Newt but at Modesty, who is watching her brother curiously. \"Go see what Chastity is doing,\" Credence says.</p>\n<p>\"But –\" Modesty says and then bites her lip, looking up at Newt. \"I though we weren't going to keep secrets anymore.\"</p>\n<p>Newt runs a hand over his lips, trying to think of a way to put it into words. \"There are secrets and then there is privacy,\" he says slowly. \"And I think your brother wants to keep this private. Alright?\"</p>\n<p>\"Yeah, but...\" Modesty trails off unhappily.</p>\n<p>\"You don't want your sister and brother knowing absolutely everything about what you do either, do you?\"</p>\n<p>\"No, but…\"</p>\n<p>\"Modesty, go away,\" Credence sighs and frowns at the plate. His voice is shaking a little. \"<em>Please</em> go away.\"</p>\n<p>Modesty face twists and she gives them a terrible pout before turning around and running to the office-shed. After a moment they hear her slam the suitcase shut behind her.</p>\n<p>Newt looks at the office-shed with conflicted expression, certain that that was really not the right way to handle that. Then turns to Credence. \"Alright then,\" he says with a slight shake of his head and Credence shivers. \"Credence?\"</p>\n<p>\"Why – why doesn't she have a name?\" Credence asks shakily.</p>\n<p>\"Modesty? She… does have a name,\" Newt says confusedly.</p>\n<p>\"The other – the other one. Who was like me. Why doesn't she have a name?\" Credence asks, looking up.</p>\n<p>Newt stares for a moment, stunned. How did Credence even know... \"Did you – you got something from the Obscurus – something from <em>her</em>?\"</p>\n<p>Credence looks down again, at the plate. \"Why didn't she have a name?\" he asks again, a little plaintive.</p>\n<p>Newt swallows and leans back on his chair. Then he sighs. \"She probably did, at some point but she forgot. Do you know what happened to her?\"</p>\n<p>Credence shakes his head.</p>\n<p>\"She had magic. Most commonly you can see signs of it by the time a child is six – she was two, from what I could gather,\" Newt sighs. \"And her mother did not react well – and neither did her village. They imprisoned her and refused all human contact. Only time she even saw anyone was when she was fed... and when she was punished for any small bit of magic she did.\"</p>\n<p>Newt stares at nothing for a moment, his throat tight. \"She forgot everything she ever knew, eventually,\" he then says. \"No one ever spoke her name again. Eventually she stopped showing magic too. By the time she was six, she was already an Obscurial.\"</p>\n<p>It had been the tales of the destruction that she'd been wrecking that had drawn Newt to the village. He'd done all he could, everything he could think of. The girl had been a little more than wild, terrified animal at the point but eventually he'd gotten through to her... he'd tried to help.</p>\n<p>He'd failed.</p>\n<p>\"Oh,\" Credence murmurs, a little wide eyed.</p>\n<p>\"Quite,\" Newt agrees. \"What happened, Credence? Please tell me – I want to help.\"</p>\n<p>\"I... it was him, he,\" Credence frowns in confusion. \"There were two of him? I thought I saw another one of him, for a moment.\"</p>\n<p>\"Ah – right, you rather did miss that part,\" Newt says, and then explains the kidnapping and the loss of identity of one Percival Graves to the dark wizard Grindelwald. \"I can introduce you if you'd like – the real Graves is quite different man entirely.\"</p>\n<p>Credence shakes his head quickly. \"Not I don't – I couldn't –\" he says and shakes his head again, looking a bit paler. \"Please. <em>No</em>.\"</p>\n<p>\"I won't if you'd rather not – it's okay,\" Newt assures quickly. \"You don't have to do anything you don't like, not here, not anymore.\"</p>\n<p>The young man swallows and nods. \"The other Graves... Grindelwald, he took me out of the suitcase,\" he says after a tense moment. \"I... I didn't want to go but he would've hurt Chastity and Modesty and I couldn't let that happen so I, I went with him. He told me about...\"</p>\n<p>Credence trails away for a moment, frowning deeper. \"He said I was useless – but he'd thought of an use for me and... he had the other one, the Obscurus.\"</p>\n<p>The researcher in Newt desperately wanted to ask him if he'd recognised it on some level, Obscurial knowing another Obscurus when he saw one. There had never been a recorded case of two Obscurials – or Obscurial and a different person's Obscurus – meeting.</p>\n<p>He swallowed the questions though. \"And then?\"</p>\n<p>Credence didn't answer, shaking his head and bowing a little, hiding his in face. \"I think I passed out,\" he murmurs. \"Later I heard you talking – I heard Chastity and Modesty. It stopped being so noisy and then it was just calm and... and I was so tired. I just wanted to sleep.\"</p>\n<p>Newt nods slowly. It must've been terribly dramatic, not to mention traumatic, for him to come in contact with the other Obscurus. Who even knows what happened – but one thing was obvious enough. Credence, as an Obscurial, was stronger. In his twenties and still alive – Merlin alone knows how strong he'd be if he'd been allowed to be a wizard.</p>\n<p>\"Alright,\" Newt says and looks the young man over. \"Let's put that aside then. Credence, there are some side effects to being what you are, even aside from the Obscurus. You must've noticed it – the stiff joints, the muscle aches, cramps. You're not as limber now than you used to be, are you?\"</p>\n<p>Credence looks up hesitantly.</p>\n<p>\"I would like to examine you,\" Newt says. \"To see how bad is it, alright? I'd like to take look at your spine at least, and hopefully figure out a way to help you before you get back aches.\"</p>\n<p>\"I... already have back aches,\" Credence murmurs.</p>\n<p>\"...oh. Well, try and stop them from getting worse, then,\" Newt says and stands up. \"Its alright if you don't want to, but it would help me figure out how to help you.\"</p>\n<p>Credence hesitates. \"Are you like a doctor then?\"</p>\n<p>\"I'm a magizoologist,\" Newt reminds him. \"And you are a magical creature. It is my field of experience.\"</p>\n<p>That relaxes Credence a little. \"Can I finish my food first?\" he asks carefully.</p>\n<p>\"Of course – take your time. I need to find my instruments anyway – with my luck, the Niffler has them all,\" Newt mutters. \"I'll be right back, alright?\"</p>\n<p>He putters around until Credence is done eating and then heads back, stethoscope looped around his wrist. Credence looks at him worriedly, hesitantly fiddling with the cuffs of his sweater. \"What do I… have to do?\"</p>\n<p>Newt smiles as reassuringly as he can. \"Nothing at all, though it would help tremendously if you could take your sweater and shirt off so that I can have a look at your back.\"</p>\n<p>That makes the young man shift almost as if with guilt, but he doesn't immediately say no. When, after long moment of terrified hesitation, Credence finally does as he asks, Newt almost wishes he hadn't. His hands are bad enough – and his back is even worse.</p>\n<p>It reminds Newt of an old Ironbelly – almost two hundred years old, from time when dragon taming was even worse than it is these days. The poor beast's hide was so riddled with old white scars that it had been deemed worthless by tanners. It was then when Newt had punched another human being for the first time – and now he rather wishes he could punch Mary Lou Barebone too.</p>\n<p>And it's not just how many scars there are – but how much they wary. Thicker, thinner, shorter, longer, jagged, straight, narrow – it's like she had gone through several implements before deciding on the one she liked the most. And dear Merlin does Newt wish he hadn't been able to imagine it so clearly.</p>\n<p>\"She's been Obliviated – she will never remember you,\" Newt says, the words trembling with anger. \"She will never lay a hand on you. On any of you.\"</p>\n<p>Credence tenses for a moment and then, slowly, his shoulders ease a little. When Newt touches his back, a shudder runs through the younger man and Credence bows his head, leaning a little back into Newt's hands.</p>\n<p>The examination can wait, Newt decides, and wraps his arms around the young man tightly as Credence shatters into almost silent, wretched tears.</p>\n<p> </p>\n<p>\"Hello there,\" Tina says, peering down. \"You look cosy.\"</p>\n<p>\"Mm-hmm,\" Newt agrees, watching Pickett climb the out stretched fingers of his free hand. There's a Fwooper making a nest in Newt's hair and Dougal is fighting it for real estate in search of lice – and the Niffler is, again, trying to get at Newt's pocket watch. It's <em>very</em> cosy.</p>\n<p>\"A real bed maybe?\" Tina suggests, her eyes roaming around the edge of the enlargened wicker basket and obviously finding it a bit ridiculous.</p>\n<p>\"I've always been a great believer in the benefits of a good nest, myself,\" Newt says. \"I think I will make it a permanent feature. Add a few cushions and maybe replace the straw with more feathers...\"</p>\n<p>Tina shakes her head with fondness and looks at Credence. The Obscurial is curled up tight in Newt's side, covered in couple of blankets – fast asleep. \"How is he?\"</p>\n<p>\"Worn out, confused and so very sad,\" Newt says honestly, looking down. Credence had worn himself out so utterly he'd eventually done his examination while the young man slept, as much as he could with Credence all curled up. \"But better, even with two fifths of his vertebrae all but fused together which is not good. I'll take him to see a healer I know as soon as in can, I think – a Chinese witch, very good with bones. If anyone can do anything, it will be her.\"</p>\n<p>\"His vertebrae are fused together?\" Tina asks in horrified whisper.</p>\n<p>\"Not all of them, but, yes, lot of them. Obscurials tend to suffer a level of physical petrification, as side effect,\" Newt explains sadly and runs his fingers through Credence's dark hair. \"That's how lot of them die, if the Obscurus or other people don't kill them first.\"</p>\n<p>\"Can you fix him?\" Tina asks, kneeling gown beside the basket.</p>\n<p>Newt sighs and looks at Pickett climbing his fingers. \"He's different from any other recorded Obscurial. Older, stronger, in control. Honestly I'm not sure he needs my help. He's not in <em>mortal</em> danger, but... I'm definitely going to try,\" he says and looks at Credence's face. \"Acceptance and safety should be a good start, I think.\"</p>\n<p>\"Hmm,\" Tina agrees.</p>\n<p>\"You've come to take me in for a statement then?\" Newt asks with an awkward, fleeting smile, trying to not let it show how much he absolutely loathes the idea of having to get up again</p>\n<p>\"Yeah,\" Tina says apologetically. \"Also, we need to get our stories straight.\"</p>\n<p>\"We have stories?\" Newt asks with slight frown.</p>\n<p>\"Oh boy do we have stories,\" she agrees with a wry smile. \"And in all but yours, Credence Barebone was killed by Gellert Grindelwald.\"</p>\n<p>Newt blinks. \"Oh,\" he says.</p>\n<p>\"Yeah,\" Tina agrees. \"And I think it should stay that way. Merlin only knows how many mad wizards and witches out there would just love to have an Obscurus on their grasp. Grindelwald isn't the only lunatic out there.\"</p>\n<p>\"No, he isn't,\" Newt agrees, massaging Credence's scalp gently when the young man goes tense. \"I guess that is the safest way to go but...\" But then he couldn't adopt Credence – which, he realises, is a bit silly thing to want, Credence is an adult after all. And yet...</p>\n<p>\"Would I have to change my name?\" Credence asks quietly, not opening his eyes.</p>\n<p>\"Never if you don't want to – we'll figure something out,\" Newt promises.</p>\n<p>\"Hmm,\" Credence answers and snuggles down to Newt's side with a heavy, almost content sigh. \"...I guess I wouldn't mind being a Scamander.\"</p>\n<p>It's almost quiet. There is the sound of a birds and distant buzzing of insects and every now and then some animal calls out in increasingly stranger noises… but mostly it's just quiet.</p>\n<p>Credence sits up slowly. His head is still whirling a bit and he feels like he's stuck underwater or underground. He's pretty sure there'd been time when he had been – underground that is, tearing through soil and rock and pavement. He's read it on the newspaper and he feels now just like he'd done then.</p>\n<p>Except better. So much better.</p>\n<p>The air is different in Mr. Scamander's suitcase. Its rich and warm and a little damp and smells like how Credence imagines the countryside smells like. Nothing like stone, dust, paper and ink, more like worn wood and dirt – and a little bit of dung.</p>\n<p>He isn't sure how well he likes it, but he does like it much better than the church smells.</p>\n<p>For a long moment Credence just sits there, in the basket, taking it in. Mr. Scamander had to go to give a statement about – about Grindelwald and all that. Chastity and Modesty are in the flat above, with Queenie Goldstein, probably doing some lady stuff.</p>\n<p>Credence is alone and for once it doesn't feel like it's choking him, being alone.</p>\n<p>He breathes in slowly and then out again even slower. His back seems to ache even more than before – like Mr. Scamander's examination somehow made it so much more noticeable. He shoulders through it, finds the angle where it aches the least, and then pushes up to his feet, standing up on the basket. He even almost stands up straight.</p>\n<p>Mr. Scamander said it might be fixable – that there was a healer specialising in bones who might be able to help. Credence isn't yet sure whether he believes it nor not. Mr. Scamander had never said anything about curing him of the Obscurus though, and that probably says something.</p>\n<p>Credence doesn't think it's curable either. Even now it feels like he could just fall apart and become mist. It's humming under his skin, the potential to shred himself into nothing and float away. Or rather rush, pour out through streets and buildings and tear them apart too. Its terrifying, knowing that he could just <em>do that</em> and he's pretty sure not something anyone can fix at this point.</p>\n<p>Slowly Credence leaves the basket and then sets out to look around. Mr. Scamander had given them a tour, but that felt like it had been a long time ago, and everything feels a little bit new, and lot more fantastical. Just being here, knowing that… that he doesn't need to go anywhere. He can just stay here. Amidst all of it. Like he's <em>part </em>of it.</p>\n<p>There are so many things, magical things, all around him that he isn't sure where to look first – so he looks at everything. He peers into the nest of the winged serpents and the other nests near by – Dougal opens one sleepy eye and sighs in something like greeting before going back to sleep. Dougal's nest hangs from a <em>tree</em> that's just growing there, inside the suitcase, and it's not the only plant there. There are many plants growing haphazardly here and there on mounds of dirt that look a bit like they were just dropped there. They too are magical – some of them glow. Lot of them are squished.</p>\n<p>Mr. Graves – Grindelwald – damaged a lot of them when he'd taken Credence out of the suitcase.</p>\n<p>Credence eyes them for a moment before looking around. There's a pair of well worn gardening gloves nearby – the fingers are a little long for him but they fit well enough. With the protective gloves on, Credence kneels down and starts to straighten the plants out.</p>\n<p>There'd been flowers at the church when he'd been younger. They'd planted them in boxes and set them outside at the steps. In the back behind the church there was a bit of land, they'd planted spices there, basil and thyme and others that, Credence later learned, could also be considered <em>herbs</em>.</p>\n<p>She hadn't liked that word, <em>herbs</em>. A little too nonsensical, little too magical. Later there wasn't any more herbs and eventually planting flowers gave away to making their own ink.</p>\n<p>He doesn't remember when the beatings started. Sometime around then, maybe, when world had stopped being golden and started to fade into grey. Or maybe they'd been going on forever. He doesn't really remember. It's probably best that way.</p>\n<p>Credence straightens the crooked stem of what looks a little like one of those flesh eating plants Chastity had once showed him in one of her books. It grins at him, all teeth. \"Thank ye kindly, laddie,\" it says, voice like rustling leaves.</p>\n<p>\"...You're welcome,\" Credence says, staring. Mr. Scamander's case has plants that talk.<em> </em><em>Magic</em> plants that <em>talk</em>.</p>\n<p>The plant nods at him and then sways a little, peering up at him without any eyes. \"Get us a little water, will ya?\"</p>\n<p>\"Yeah, sure,\" Credence says and stands up, something old and tight and aching in his chest slowly starting to unwind.</p>\n<p> </p>\n<p>There are books in the shed which Credence glances at while searching for gardening tools. There's not that many of them but the books look both well used and important – one of them has golden text. They are, Credence suspects, what Mr. Scamander reads and uses as a Magizoologist – all about magical creatures.</p>\n<p>It isn't until his third look around the shed – this time for any sign of more dirt to add to some of the plant piles – that he dares to look in closer.</p>\n<p>The books are written with colourful inks, with intricate initials and cursive, embellished writing. They looked actually handwritten – who knows, they might be too. And the pictures... move.</p>\n<p>Credence stares, amazed, at the illustration of a dragon spreading out its wings and displaying them with great pride before it breathes out a gust of flames at near by letters. On another page, a big cat with a human face lounges on a stone slab, flicking it's ear at Credence's gob smacked observation. There are unicorns in the books, and Occamies, though these illustrations pale in comparison to the real thing – there's even a Demiguise and that's even <em>worse</em> drawn.</p>\n<p>He ends up completely forgetting himself in reading of the book and is drawn out of it only when the hatch above opens.</p>\n<p>\"Oh, you're right there, good,\" Chastity says, quickly descending the ladder. \"Quick – you have to hide. Mr. Scamander is back with that wizard – he wants to see the suitcase and you're supposed to be dead.\"</p>\n<p>\"Oh. Right,\" Credence says and places book regretfully back where he found it. \"Where should I go – with Frank?\"</p>\n<p>\"The night enclosure, with the Mooncalfs. Its right next to where the house will be, remember?\" Chastity asks. \"Mr. Scamander says it's so dark in there you won't be seen.\"</p>\n<p>\"Okay,\" Credence says and then looks at her. \"What are you wearing?\" he asks with surprise.</p>\n<p>Its loose, has a hem that only reaches her knees and it's also<em> </em><em>pink</em>. He's never seen her wear anything pink before.</p>\n<p>Chastity hesitates, looking embarrassed. \"Queenie gave it to me – made it fit with magic. Is it... bad?\"</p>\n<p>\"No,\" Credence says, shaking his head. \"Just… different.\" And not at all what their – what Mary Lou would've ever gotten for them. \"Its nice, I guess.\"</p>\n<p>\"You<em> </em><em>guess</em>?\" Chastity asks with a slight frown.</p>\n<p>\"I don't know – it's girls clothes. If you like it, what does it matter what I think?\" Credence says awkwardly. \"Did Mr. Scamander say when they are coming?\"</p>\n<p>\"Oh, right – they're in Queenie's and Tina's apartment right now and you really need to hide,\" Chastity says guiltily, turning back to the ladder. \"I just came in to warn you – I should go back before Mr. Graves realises I'm not in the bathroom after all.\"</p>\n<p>Credence almost stumbles at that, but keeps going, hurrying out of the shed and towards where Mr. Scamander had shown their house would be, trying not to even think about it.</p>\n<p>The night enclosure is, as said, dark. There are some boulders there, arranged into a sort of cliff and Credence can easily see why Mr. Scamander would think it was a good place to hide him – in the darkness and sitting small behind the boulders he's all but invisible.</p>\n<p>Wizards and witches could actually, really go invisible, he recalls. The Goldsteins had been invisible when he'd met then. Mr. Scamander could probably do it too. And then there's Demiguises like Dougal...</p>\n<p>There's just... so much magic out there, so much more than he'd ever even dreamed off. It isn't just a hidden society of people like Mr. Gra – Grindelwald had made it seem. It is a whole world and it's just so much bigger than he'd imagined.</p>\n<p>An entire world with its own creatures, Credence thinks as he comes face to face with a pair of enormous, luminous eyes. The creature they belong to croons at him and leans down to snuffle at his hair curiously, tugging at it lightly with its lips.</p>\n<p>Credence winces a bit and pushes it away – which it then takes as petting and leans happily into it, cooing at him and so Credence ends up scratching it's neck. Its probably a Mooncalf. It certainly looks the part.</p>\n<p>There are voices coming from somewhere behind him, too distant to make out – but he does recognise two of them. Mr. Scamander... and Mr. Graves.</p>\n<p>Credence stares at nothing for a moment, feeling too much all at once to even react. Then the Mooncalf nudges at him demandingly, worming it's head under his arm and into his lap and Credence breathes again. He pets the creature mindlessly and listens – eventually they come close enough to hear.</p>\n<p>\"... the forest then,\" Mr. Graves' voice comments.</p>\n<p>\"I don't understand what's wrong with the forest,\" Mr. Scamander answers. \"Its a perfectly good forest.\"</p>\n<p>\"Which you keep in your suitcase.\"</p>\n<p>\"Well where else would I keep it? Trunks take entirely too much space and are hard to travel with besides.\"</p>\n<p>\"Right,\" Mr. Graves answers dryly.</p>\n<p>Credence blinks at that, looking up. Mr. – Grindelwald had never been... sarcastic.</p>\n<p>\"Anyway, this is where I'm going to set up rooms – bedrooms, living room, kitchen, all of it,\" Mr. Scamander says. \"Everything people need. Queenie offered to help, to make sure I won't make it look like the shed.\"</p>\n<p>\"You think this place is suitable for children?\" Mr. Graves asks after a while. \"What with terrible dangerous beasts behind every corner and all.\"</p>\n<p>\"Nothing here is dangerous when they're treated with proper respect and understanding.\"</p>\n<p>\"<em>…right</em>. What about the fact the Barebones don't have magic and can't defend themselves, like you can, if something goes wrong?\"</p>\n<p>Credence frowns down at the Mooncalf while scratching it behind the small, nub like ears.</p>\n<p>\"Then I'll have to make sure nothing will go wrong,\" Mr. Scamander says finally.</p>\n<p>\"You can't promise it won't though,\" Mr. Graves says.</p>\n<p>\"I can promise I will never, ever hurt them and that I will do everything I can to keep them from being hurt,\" Mr. Scamander says with slightly sterner voice. \"No one can give hundred percent assurances about anything. All we can do is try.\"</p>\n<p>\"Hmm,\" Mr. Graves answers and, very carefully, Credence leans in to look past the cliffs.</p>\n<p>There's two men standing between the enclosures, watching the empty space where the house would go. Mr. Scamander is fiddling with the cuffs of his blue coat, looking determined and apprehensive at the same time as he eyes Mr. Graves worriedly – and Mr. Graves...</p>\n<p>He doesn't look like Mr. Graves – and yet he does. Its the same face, only he has hint of stubble on his cheeks and his hair is longer – still silver at temples, but grown out of his haircut. Grindelwald was always so perfectly polished and this man is anything but – he doesn't have as nice a coat, doesn't wear a scarf, his shirt collar is a little rumbled and he looks like he hasn't slept in a long time.</p>\n<p>\"And Credence?\" Mr. Graves asks and Credence's heart skips a beat.</p>\n<p>Mr. Scamander pauses slightly. \"Credence is gone,\" he says slowly.</p>\n<p>\"Don't even bother with that, Newt – you're the worst liar I've ever met,\" Mr Graves laughs. \"Why do you think I asked to come here? I'm in no way qualified in matters of adoption – no, I wanted you out of the hearing range of prying ears. And you were giving yourself away at the offices.\"</p>\n<p>Mr. Scamander is quiet for a moment and when he speaks again his voice is tense. \"What do you want know then?\"</p>\n<p>\"He's alive, isn't he?\"</p>\n<p>Mr. Scamander doesn't answer.</p>\n<p>\"Right,\" Mr. Graves says slowly. \"And the Obscurus? Is it under control?\"</p>\n<p>Mr Scamander hesitates at that and takes a deep breath. \"Its not an issue anymore,\" he says slowly.\"</p>\n<p>\"There won't be any more incidents – here or elsewhere?\" Mr. Graves presses on.</p>\n<p>\"No. No more incidents,\" Mr. Scamander promises firmly.</p>\n<p>Mr. Graves is quiet for a long while, staring at Mr. Scamander seriously. \"Alright,\" he then says. \"Good. Are you planning to stay New York for much longer?\"</p>\n<p>The relief on Mr. Scamander's face is painfully obvious as he sags down. \"For a while – long enough to get the children everything they need and get the rooms set up – and security features. I don't think Tina will let us leave without those.\"</p>\n<p>\"Good for her. So as long you don't blow up a city block,\" Mr. Graves comments dryly.</p>\n<p>\"You're not going to let that go, are you?\"</p>\n<p>\"I generally don't let things go, no.\"</p>\n<p>\"So I reckon you want you wand back, then?\" Mr. Scamander asks, taking out a wand.</p>\n<p>Mr. Graves frowns. \"I... have my wand right here,\" he says, taking his wand. The two look completely different. \"I took it off Grindelwald.\"</p>\n<p>\"Well, so did I,\" Mr. Scamander says, looking at the pale piece of intermittently knotted wood. \"I guess this would be his actual wand, then.\"</p>\n<p>\"You've been using it?\" Mr. Graves asks interestedly.</p>\n<p>\"He broke my wand, I needed a replacement and he wasn't going to be using his. I didn't intend to keep it,\" Mr. Scamander muses, turning the wand in his fingers. \"It has been working remarkably well though, now that I think about it – if it wasn't for how it looks, I might mistake it for my own.\"</p>\n<p>\"Hm. Well if I take it in its just going to end up being filed away and probably forgotten in the archives,\" Graves says. \"I say you keep it.\"</p>\n<p>\"Really?\"</p>\n<p>\"Poetic justice, don't you think?\"</p>\n<p>Mr. Scamander stares at him for a moment. \"You don't let anyone ever get away with<em> </em><em>anything</em>, do you?\" he then asks with an amused shake of his head, putting the wand away again.</p>\n<p>\"I am the Chief of Magical Defence, you know,\" Mr. Graves says as they turn to head back. \"I'd be out of a job if I let people get away with things...\"</p>\n<p>Credence watches them go, listening to the sound of their steps fading as he scratches the Mooncalf's neck. His heart doesn't stop pounding for a long, long while.</p>\n<p>It takes even longer for the fondly sarcastic tilt of Mr. Graves' voice, so strange and warm, to fade from his memory.</p>\n<p> </p>\n<p>That evening, after they've had dinner, they start in on the rooms. Its a process that involves lot more things than Credence had realised. Planks of wood, cloth, tiles, pipes...</p>\n<p>\"Even magic can't make something permanent out of nothing,\" Mr. Scamander explains while Miss Goldstein – Queenie – levitates a stack of wood in. \"You need something to start from – material to transfigure.\"</p>\n<p>\"It's the magic of changing something into something else,\" Queenie explains, more to curiously watching Chastity than to Credence.</p>\n<p>\"Charms can do it too, but charming something into something else is tricky and usually doesn't last long – Transfiguration on other hand is close to permanent,\" Mr. Scamander says and then flicks his wand, taking out a couple planks of wood and starting to cast spells on them. </p>\n<p>\"Are we going to have screens, like the enclosures?\" Modesty asks. \"With living pictures?\"</p>\n<p>\"That was my plan,\" Mr. Scamander agrees. \"We can make them look like anything you want.\"</p>\n<p>\"We'll also spell them so that you can't go through or hear through them, if you want,\" Queenie adds with a wink. \"Everyone needs a little privacy now and then.\"</p>\n<p>\"Oh, like Credence,\" Modesty says which, much to Credence's mortification, makes Queenie look at him knowingly.</p>\n<p>\"Well that was a little different,\" Mr. Scamander says with a quiet laugh as he pitches up the first screen. \"And for safety reasons we can't have any place perfectly silenced – but we can certainly dampen noises getting through.\"</p>\n<p>\"Mr. Scamander, may I have my room look like the library?\" Chastity asks quietly.</p>\n<p>\"Sure, anything you like – we can even get an actual library, though gathering all the books might take time...\" Mr. Scamander trails away and looks at her. \"You don't have to call me mister, you know.\"</p>\n<p>Chastity blinks. \"What... should we call you then?\"</p>\n<p>\"How about Mummy?\" Queenie asks with a laugh. \"Its what he calls himself.\"</p>\n<p>\"Yes, well,\" Mr. Scamander says, shrugging his shoulders without a hint of embarrassment.</p>\n<p>\"But... you're a man?\" Chastity says confusedly.</p>\n<p>\"I take care of a lot of young animals – and in most those cases, the male parent has very little to do with child rearing,\" the wizard shrugs. \"Mum just seems more appropriate.\" He glances at them. \"You can call me anything you want, though, it's fine.\"</p>\n<p>\"Mummy,\" Modesty mutters. \"Is that anything like Mommy?\"</p>\n<p>\"Nothing like it,\" Mr. Scamander says firmly.</p>\n<p>\"Hm. Okay,\" Modesty says, decision made. \"Mummy, may I have my room look like Frank's habitat?\"</p>\n<p>Queenie laughs with delight and Credence is watching side eyed and so he can't miss the way Mr. Scamander's lower lip actually quivers. \"Absolutely,\" the wizard says and takes a breath. \"First we need to figure out room layout however...\"</p>\n<p>Credence watches from the side as they, along with Queenie, figure out what goes where. He doesn't think he could call anyone Mummy, not really. It was a… treacherous sort of word, and not one he thinks he could apply to someone he actually likes.</p>\n<p>\"Alright there, Credence?\" Mr. Scamander asks, suddenly there, offering him his hand.</p>\n<p>\"Yes,\" Credence says and looks down at his hands. Skin unbroken, still a little red but healing. It doesn't hurt at all to take Mr. Scamander's hand.</p>\n<p>\"How would you like your room then?\" the wizard asks with a smile.</p>\n<p>Credence thinks about it for a moment. \"Like the open sky.\"</p>\n<p> </p>\n<p>Credence comes out of the suitcase for the first time since being an Obscurus on the day they leave New York. They all come out, to eat last dinner together with the Goldsteins in their apartment.</p>\n<p>\"Do you have your tickets?\" Tina quizzes Mr. Scamander who is peering over Queenie's shoulder at her cooking.</p>\n<p>\"I have been travelling for almost ten years now, Tina – I promise I have my ticket,\" the wizard says and nods at Queenie who is mixing ingredients in air. \"Is there an incantation for that?'</p>\n<p>Tina huffs. \"Yes – but do the <em>girls</em> have their tickets? Does Credence?\" she demands to know.</p>\n<p>\"We do, Tina,\" Chastity says.</p>\n<p>\"I have mine right here!\" Modesty says, holding up her new purse – given to her by Queenie – proudly. \"And I got a passport too – with the new name.\"</p>\n<p>\"That's wonderful – how about you, Credence?\" Tina asks.</p>\n<p>\"I have mine, yes,\" Credence admits, though everyone knows it's just in case. If he can have his way – and Mr. Scamander promises him he can – he'll spend most of the ride in the suitcase.</p>\n<p>Though, having a passport declare him Artemis Credence Scamander rather than Credence Barebone was strangely comforting. Even with the change of first name – Tina's idea, Credence being so uncommon and easily recognizable. Credence doesn't think he could become <em>Artemis</em> but… it's nice to have that barrier even if it's just a word to give out to strangers.</p>\n<p>\"Its just levitation,\" Queenie explains to Mr. Scamander. \"You just need to practice. It's a little like how you feed the fish – you just do mixing while at it.\"</p>\n<p>\"Hmm, alright, but how exactly –\"</p>\n<p>\"Practice, Newt, it's just practice – although,\" Queenie pauses and seems to conjure a book out of nowhere. \"Recipe helps. Now I know this isn't as fancy as that book you're writing – but I think it will help you get started.\"</p>\n<p>\"Oh. Oh! <em>Thank</em> you,\" Mr. Scamander brightens up and starts to immediately leaf through the hand written cook book.</p>\n<p>\"And you're all dressed warmly?\" Tina asks.</p>\n<p>\"You and Queenie dressed us,\" Modesty points out.</p>\n<p>\"Yes, but are you sure you won't get cold?\"</p>\n<p>\"M-Mummy added heating charms,\" Chastity says, stumbling over the first word a bit embarrassedly. \"We're fine, Tina.\"</p>\n<p>\"You can't out mother hen The Mother Hen, Tina,\" Queenie laughs and floats the strudel she'd been making down to the table, baking it as she does. They'd all seen it several times now but it never stopped amazing Credence.</p>\n<p>Grindelwald had always made magic seem like a secretive, grand thing used for secretive, grand purposes, for wars and revolutions. Queenie used it to cook pastries midair.</p>\n<p>\"How do I make this one?\" Mr. Scamander asks, pointing at a recipe. \"It says to use a skillet – I don't have a skillet.\"</p>\n<p>\"Frying pan is pretty much the same thing, honey,\" Queenie says and leans in to look. \"Actually no you do need a skillet for that – a cast iron skillet. Hmm... I don't suppose we have time to go shopping...\"</p>\n<p>\"We might, if we're quick about it,\" Mr Scamander says, albeit dubiously.</p>\n<p>\"You can buy one from Arizona – or better yet, here, when you come back,\" Tina says and then frowns as Newt shifts. \"You <em>are</em> coming back, aren't you?\"</p>\n<p>\"Well... eventually, I suppose, \" Mr. Scamander says guiltily. \"Right now I was thinking more along the lines of continuing to the west coast and then heading over to Asia.\"</p>\n<p>Credence looks down at his plate. Its because of him they're going – Arizona is just a pit stop really.</p>\n<p>\"Oh,\" Tina says. \"Right.\"</p>\n<p>There's a moment of awful silence.</p>\n<p>\"We'll write?\" Mr. Scamander offers after a moment carefully.</p>\n<p>\"You damn well better,\" Tina mutters and throws a napkin at him and then it's all fine again.</p>\n<p>Credence says his goodbyes once they've finished eating and his sisters are getting ready to go. He didn't get to know the Goldsteins as well as his sisters did, didn't spend any alone time with the two witches like the girls had – but they'd been kind to him. And that was, he knew, a terribly rare thing.</p>\n<p>\"We <em>are</em> going to walk you to the station, you know,\" Tina says, arching her eyebrows a little.</p>\n<p>\"Teenie,\" Queenie says shaking her head and then touches Credence's hand. \"Its okay honey – it was good to meet you too. I hope you have wonderful adventures with Newt.\"</p>\n<p>\"Thank you, Queenie,\" Credence says and almost stumbles over when she hugs him.</p>\n<p>\"Newt loves you all very much, you know,\" she whispers in his ear. \"Has a heart like an ocean, that man. He'll take good care of you.\"<br>\n <br>\nCredence's throat closes up a little but he manages a nod. He knows – Mr. Scamander is terrible at hiding things after all.</p>\n<p>\"Good,\" Queenie says and pulls back, touching his cheek. \"It will all be alright now, honey. It will be alright.\"</p>\n<p>Credence nods again – and then Tina hugs him tightly too and suddenly he almost tears up. He's not even sure why, he just feels shaky. She squeezes him tighter. \"Thank you,\" she says firmly.</p>\n<p>\"For what?\" Credence asks in confusion, his breath hitching a little.</p>\n<p>\"For being safe,\" Tina says simply and pulls back to look at him. Her eyes are very serious and they seem to see right through him. \"Now keep being safe and I'll keep on being thankful. Okay?\"</p>\n<p>Credence nods shakily, not sure why she affects him so strongly when Queenie can read his mind – but she does.</p>\n<p>\"Take care of yourself now,\" Tina says and releases him.</p>\n<p>Credence looks down. \"Thank you – and I'm sorry for… for all of it.\"</p>\n<p>\"Oh, sweetheart, none of it was ever your fault,\" Queenie says. \"I know you don't believe it now – but remember that we <em>know</em> it wasn't.\"</p>\n<p>Credence shakes his head and looks at Mr. Scamander pleadingly. The man smiles and rests a hand on his shoulder, warm and secure and comforting – almost familiar by now but not quite. \"Do you want to go into the suitcase now?\" the wizard offers gently.</p>\n<p>\"Yes please,\" Credence says with a relieved sigh, making Queenie and Tina laugh tearfully.</p>\n<p>\"Okay,\" Mr. Scamander says while Modesty waves a hand and Chastity pulls on a hat. He motions at the suitcase sitting near by – open and inviting. \"Go on then. We'll see you later.\"<br>\n</p>\n<p> </p>\n<p>Later, after bit of random chores and taking care of the plants – which he thinks he will keep doing even though Mr. Scamander says he doesn't have to – Credence lays down in the basket in the middle of everything.</p>\n<p>The sky's full of water bubbles – the Marmite is playing tag with the Grindylows, which really looks more like actual hunting. There are Billywigs buzzing about, checking all the new things curiously, poking their noses into everything. There's bit of a breeze too – Frank's happy, apparently, about being in the move again. Everything still smells like Credence imagines countryside smelling like – worn wood and dirt, and a little bit of dung.</p>\n<p>There's a Niffler nosing about his pockets for anything valuable and it's only matter of time before Dougal climbs in as well. Somewhere in the distance then Graphorns are calling out – mating calls, according to Mr. Scamander. The Occamies have started to let out little bird calls too, chirping happily from their nest.</p>\n<p>Everything around him is utterly and unabashedly <em>magic</em>.</p>\n<p>Credence closes his eyes with a deep breath and lets himself drift off.</p>"
}