{
  "id": "8981179",
  "url": "https://archiveofourown.org/works/8981179?view_full_work=true",
  "author": [
    "BrilliantLady"
  ],
  "title": "Her Beauty and the Moonlight",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Hermione Granger/Draco Malfoy"
  ],
  "characters": [
    "Hermione Granger",
    "Draco Malfoy",
    "Harry Potter",
    "Ron Weasley",
    "Bill Weasley",
    "Susan Bones",
    "Lucius Malfoy",
    "Narcissa Black Malfoy",
    "Ginny Weasley",
    "Astoria Greengrass"
  ],
  "additional_tags": [
    "Love Potion/Spell",
    "Date Rape Drug/Roofies",
    "Weasley Bashing",
    "Ron Weasley Bashing",
    "Fake/Pretend Relationship",
    "Dating",
    "Good Draco Malfoy",
    "POV Hermione Granger",
    "Past Hermione Granger/Ron Weasley",
    "Adult Hermione Granger",
    "Explicit Sexual Content",
    "Gentleman Draco",
    "Post-Hogwarts",
    "Consensual Infidelity"
  ],
  "language": "English",
  "series": "Part 2 of A Counterfeit of Love",
  "published": "2016-12-24",
  "completed": "2017-05-05",
  "words": "37,484",
  "chapters": "11/11",
  "comments": "1,604",
  "kudos": "13,026",
  "bookmarks": "2,800",
  "hits": "308,236",
  "summary": "<p>When Harry helps Hermione find out the horrible truth - that Ron has been dosing her with love potions - she is furious. She is going to get her revenge on Ron in the most hurtful way she can think of – dating the one man he hates above all others.</p>\n<p>Conversations with Weasleys.</p>\n<p>Hermione knows just what would make Ron feel the worst.</p>\n<p>Hermione faces a dreadful challenge. Meeting the parents.</p>\n<p>Step Four of Hermione's plan: public date with dancing and physical contact.</p>\n<p>Step Five in Hermione's master plan - a date out in the Muggle world. Draco tries to weasel out of it.</p>\n<p>Hermione makes plans with Draco to go to Harry’s and Ginny’s wedding, and lets slip something she didn’t intend to share.</p>\n<p>The boundaries between “fake” and “real” continue to crumble as Draco and Hermione’s relationship deepens.</p>\n<p>Hermione and Draco attend Harry and Ginny’s wedding. It’s a good thing Harry told Hermione he doesn’t mind if she ends up fighting with Ron, because she thinks it’s pretty inevitable.</p>\n<p>Astoria confronts Hermione, and Hermione and Draco discuss their relationship.</p>\n<p>Happily ever after. &lt;3</p>",
  "notes": "<p>You can skip the prequel in this series if you really want – you might be a tad confused about the details of what’s going on with Harry, but you’ll get the gist of it. :) Note - this story contains references to past love potion induced non-consensual sex, but no descriptions of any non-con scenes appear in this story (past events are only referred to).</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Toraach’s comments inspired my muse to turn a Harry/Ginny one shot into the first of a series with this Dramione sequel. And here's Draco at last! :)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_4_endnotes\">notes</a>.)\n</p>\n<p>Sorry, I usually post earlier in the day. I was so busy with IRL stuff all day that I totally forgot it was fic posting day! You can thank Probably2Insane for their very timely review that jogged my memory.</p>\n<p>I’m not sure anyone really needs a spoiler warning for an opera written well over a century ago, but just in case, be warned that I’m going to spoil the ending of “Carmen” in this chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_7_endnotes\">notes</a>.)\n</p>\n<p>I will be posting another chapter next Friday (7th April).</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_9_endnotes\">notes</a>.)\n</p>\n<p>Shinagami24 – Here’s a letter from Krum for you, and a cameo by Charlie.</p>\n<p>I’m not sure anyone really needs a spoiler warning for another opera written well over a century ago, but just in case, be warned that I’m going to decidedly spoil the ending of “La Traviata” in this chapter.</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_10_endnotes\">more notes</a>.)\n</p>\n<p>Just one more chapter to go, to tidy up some loose ends. :)</p>\n<p>Stargirl1061 and DemonDragon000 – Thanks for the suggestion that Draco’s parents should go to the opera too (though in the end I made it a musical).<br>The_Doctors_ShaniMalfoy1 – Thanks for your suggestion that Draco should go out on more Muggle dates.<br>Neloska – Thanks for your idea about a good place to start working on anti-love potion legislation.<br>Asoreleks – Lucius singing for you, though not quite the production you envisaged. Perhaps he does that when no-one is watching. ;)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_11_endnotes\">notes</a>.)\n</p>\n<p>Shinigami24 – Love potions properly outlawed at last! With only a couple of exceptions for consenting couples. :)<br>Toraach – Wedding scene for you!<br>Pom_Rania – Thanks for your milder potion suggestions.<br>Ceren – Belated thanks that should’ve been on last chapter for your suggested arguments about love potions ruining a family’s pure-blood line.</p>\n<p>All done! Thanks everyone for reading, reviewing, and/or leaving kudos. :) 8,000 kudos now! Thank you all so much! Mwah! *blows kisses*</p>",
  "text": "<p>Harry and Hermione met up discreetly at a café in London, with the rumbles of a cappuccino machine and the murmurs of the busy crowd of people at tables all around them providing its own kind of noisy privacy. Harry hated going out in Diagon Alley still – nothing he did there went unremarked. But here in the Muggle world he was a nonentity, just the way he liked it. No-one praised him, no-one blamed him, and no-one tried to listen in on his conversations in hopes of gleaning some gossip to share with <em>The Daily Prophet </em>or <em>Witch Weekly</em>.</p>\n<p>Hermione sipped at her coffee with a shot of cinnamon, and eyed Harry worriedly. He looked nervous, just picking at a slice of banana bread more as if he wanted something to do than because he was actually hungry.</p>\n<p>“So what is it that’s bothering you?” she asked. “Pre-wedding jitters?”</p>\n<p>“No. Yes. We’ve worked through those, I think.”</p>\n<p>“I noticed you brooding lately.”</p>\n<p>“You didn’t say anything?”</p>\n<p>She shrugged. “I wanted to. But Ron said to leave you two to work it out between yourselves.”</p>\n<p>Harry’s mouth tightened as if he was angry about something. It was subtle, but she’d been his friend for years and knew the signs of him trying to bite down an angry comment.</p>\n<p>“You listened to him, kept your mouth shut? Just like that?”</p>\n<p>She rested a hand on top of Harry’s and gave it a worried squeeze. “Are you okay? I thought it was good advice – you seem to have settled things with Ginny. You both look happier. The wedding’s still on. But if you want to talk, I’m here for you. Is there something I can do?”</p>\n<p>“Can you answer some questions for me?” he said with a faint pleading tone to his voice.</p>\n<p>“Of course.”</p>\n<p>“How do you feel about Ron?”</p>\n<p>Her face lit up with happiness. “I love him. It’s like we’re two halves of a whole – like together we’re better. Soulmates.”</p>\n<p>Harry ate a tiny piece of banana bread and looked at her worriedly. “Do you remember how he used to drive you crazy with how you had to nag him to study? How he left his homework to the last minute, and then wanted to copy yours? He’s been slacking off in Auror training a bit. How do you feel about that?”</p>\n<p>She laughed lightly. “He <em>does</em> leave things to the last minute still, the big goof,” she said affectionately. “I help him practice a bit, but I’ve grown, Harry. I know sometimes it’s best to leave someone to make their own way in the world. I let him make his own choices.”</p>\n<p>“Do you do the home assignments for him? Researching legal precedents? Case histories?”</p>\n<p>“Sometimes,” she admitted. “He does need a bit of help, so I pitch in when he asks.”</p>\n<p>“And that makes you happy?”</p>\n<p>“Everything he does makes me happy,” she said with a sappy smile. “He might not be perfect, but he’s perfect for <em>me</em>. We balance each other out.” She sipped at her coffee contentedly, enjoying the bittersweet spicy taste that no retailer in the wizarding world bothered to try and duplicate. There it was almost always tea, Butterbeer, or strong liquor.</p>\n<p>“I heard you’re talking about marriage, kids,” he said leadingly, with a frown. “Didn’t you want to focus on a career?”</p>\n<p>“I do… I did…” she said, a frown crossing her face for a moment as she thought about it, before her face cleared with a smile, like the sun emerging from behind the clouds. “But it would make Ron so happy, and I guess it would be nice to have kids one day. I think he’s going to propose after your wedding. He doesn’t want to steal your thunder.”</p>\n<p>She smiled softly at the thought. She’d seen where he’d hidden the ring amongst his socks, while putting away his laundry. A princess-cut sapphire solitaire in a gold band. He thought he was so sneaky – it was adorable.</p>\n<p>Harry was watching her intently as she spoke. So intently it reminded her of Professor Snape for a moment – the way his eyes would blaze like he was trying to get inside your head. Snape probably had been, given his talents in Legilimency. She was never quite sure in retrospect how she’d managed to get away with stealing the ingredients to brew the Polyjuice Potion in second year. It was most likely because he was too busy suspecting Harry to rifle through her own mind.</p>\n<p>“I was talking with Ron the other day. He said you’ll be quitting your job once the first baby comes along. He’s looking forward to it – having a family with you.”</p>\n<p>There was a flash of anger burning for a moment with a flickering thought – <em>how dare he</em> – before it was gone. She loved him. That would always come first. They would work any little problems out together. “I’m sure we’ll work it out when the time comes. There’s no rush.”</p>\n<p>Harry looked upset. Too upset. Something was wrong.</p>\n<p>“Are you okay? You’ve always seemed really happy for us? I hope you’re not feeling jealous? I know you and Ginny have been going through a rough patch, but you’ll work it out. Love will find a way.” She was worried for him, and hoped something in her rambling would help. “You two are meant to be together.”</p>\n<p>Harry fumbled in a pocket, and placed a wax-sealed crystal potions vial on the table.</p>\n<p>“Harry? What’s that?”</p>\n<p>“A choice,” he said, pushing it towards her. The clear liquid inside sloshed about as the vial rolled over and over before stopping with a gentle clink against her coffee cup.</p>\n<p>She picked it up. No markings, no label.</p>\n<p>“I want you to drink it,” he said, a world of nervous stubbornness in his voice.</p>\n<p>“What is it?”</p>\n<p>“I’ll tell you after you’ve drunk it.”</p>\n<p>She laughed, but he didn’t laugh with her.</p>\n<p>He looked at her with a serious gaze. “Do you trust me, Hermione? We’ve been friends ever since I shoved my wand up a troll’s nose. I want you to do this for me, without asking questions until afterwards. I want you to drink the potion. Then I’ll tell you what it is. Trust me, <em>please</em>,” he said, stubbornness turning into pleading by the end of his spiel.</p>\n<p>Did she trust him? Yes. He didn’t have a malicious bone in his body. Well, with certain exceptions such as for Bellatrix Lestrange. Maybe Draco too, though that old enmity had died away of late.</p>\n<p>“Where did we brew Polyjuice?” she asked, throwing out a question for him to confirm his identity with. Old war-time habits died hard.</p>\n<p>“In Moaning Myrtle’s bathroom,” he said with relief. “And you were going to be Millicent, but ended up with a cat hair by mistake.”</p>\n<p>She picked up the vial, and uncorked it. “Cheers, Harry.”</p>\n<p>She quaffed it in one quick gulp. It didn’t taste bad at all – not really like anything, actually. Probably not a poison. But nothing she was familiar with.</p>\n<p>“Veritaserum diluted in water?” she guessed. Colourless and flavourless, it was a possibility, though there was a faint mineral taste she didn’t recognise.</p>\n<p>“No, it’s not that,” he said, with a shake of his head, and a nervous look. “You’re not going to like it though. I think.”</p>\n<p>“This had better not be one of George’s new creations,” she said with a sigh. “You know we’re in the middle of a Muggle café. If I suddenly sprout feathers or spontaneously tap-dancing the fallout is all on you, Mr. Auror.”</p>\n<p>“Don’t worry, it won’t have any visible effects.”</p>\n<p>“Just tell me what it is for Merlin’s sake,” she sighed. “You’re stalling.”</p>\n<p>He grinned briefly at her. “Yes, you caught me. But it should only take a minute or two for the potion to take effect. Patience.”</p>\n<p>She huffed impatiently at him, folding her arms crossly.</p>\n<p>“I’ll give you a clue. Ron took this potion in sixth year. Professor Slughorn gave it to him.”</p>\n<p>“It had better not be poison, Harry,” she said with a smile. She didn’t think it was, of course. She trusted him implicitly.</p>\n<p>“Of course not. Quite the opposite in face. It’s… it’s an antidote.”</p>\n<p>“Has someone been poisoning me?”</p>\n<p>“Not exactly,” he hedged.</p>\n<p>“Hmm… an antidote in sixth year. Some kind of essence of Bezoar? No, of course not. Wait! The love potion antidote!” she said in quiet triumph, so as to not be overheard by people at the nearby tables.</p>\n<p>He nodded, sadness in his eyes.</p>\n<p>“But why-” she started, before her face crumpled in agonised realisation as the antidote started kicking in. “Ron.”</p>\n<p>“Yes. I mean, maybe. I suspected after… I thought maybe you needed the chance – to see things clearly. So I bought the antidote… just in case. How do you feel about him now?”</p>\n<p>“Ron is…” her thoughts whirled. She loved him! She… loved him. The way he used her to write his assignments. The way he snored was adorable… no, <em>irritating</em>. She remembered how she’d broken up with him – he’d walked out on her after all, even with Snatchers and Voldemort’s entire army after her and Harry, and the fate of the wizarding world at stake. She’d been so angry and determined – it was over, for good. Then after the Battle of Hogwarts, he’d apologised. With chocolates.</p>\n<p>“Ahhhhhhh!” she screamed, and somewhere in the café a cup fell on the ground and smashed as someone startled at the noise. Patrons turned to look at them as she yelled out her anger and despair, clutching at her hair.</p>\n<p>“Shhh!” hissed Harry desperately, looking around worriedly as people stared.</p>\n<p>“Harry, Harry he drugged me!” she yelled at him, clutching at the front of his shirt in desperation. “He drugged me and I <em>slept</em> with him! He raped me!”</p>\n<p>“Shhh… shhh… You’re alright now. You can leave him if you want to,” Harry reassured her, while all around them people listened into the drama unfolding in front of them.</p>\n<p>“If someone slipped a mickey in your drink, you should report that bastard to the police!” yelled a plump woman at another table next to them, earning herself a murmur of support from some of the other nearby eavesdropping customers.</p>\n<p>“Leave him if I <em>want</em> to? Why would I stay with him? He’s <em>dead to me now</em>!” All the love had drained out of her. She didn’t feel empty, though she’d always used to feel like her life would be empty without Ron’s love. She felt <em>angry</em>.</p>\n<p>The supportive woman at the next table bought her a slice of chocolate gateau, and a friendly hug, both of which she accepted, still rattled and shaking ever so slightly. She attacked the slice of cake ravenously. Ron didn’t like her eating too much. He didn’t want her getting fat. Never mind how much <em>he</em> ate. Just this once wouldn’t make a damn bit of difference to her figure. She <em>deserved</em> chocolate gateau right now.</p>\n<p>When she heard exactly why Harry had started suspecting Ron, that Ginny had been drugging Harry too, she wept tears for him that she wasn’t quite ready to shed for herself.</p>\n<p>The anger came back in a comforting rush to dull and plaster over the grief when she heard that Harry planned to stay with Ginny anyway, and that the wizarding world didn’t class love potions as illegal. Both things were almost incomprehensible.</p>\n<p>“Look, I could if I wanted to press charges of attempted line theft, and entrapment into marriage by means of a potion or spell,” Harry explained softly. “I looked into it. They won’t apply once I’ve married Ginny of my own free will, though.”</p>\n<p>“You can’t. You mustn’t! She doesn’t deserve that. She deserves Azkaban,” hissed Hermione.</p>\n<p>“No. I still… care for her. Maybe not love. But still… I want a family, Hermione. A real family. And she loves me – she really does. She just went about things the wrong way. We’re working on our relationship. She’s apologised.”</p>\n<p>“I’m going to press charges against Ron.”</p>\n<p>She expected his support, but what she got was a shake of the head. “You could try, but as you’ve neither been entrapped into marriage nor made pregnant, and you’re not from a ‘Noble’ or ‘Ancient’ family whose line of inheritance is at stake, I think you’ll find there’s actually no charges that will stick.”</p>\n<p>“What?! Seriously? Rape, then. I will press charges for that.”</p>\n<p>“Hermione, I looked into it – it doesn’t count. They don’t even consider Amortentia illegal, and it’s the strongest love potion there is. Morally wrong and sometimes frowned upon, but not technically illegal. That’s why Romilda Vane didn’t even get a detention. That’s why George can sell various types of love potions in his shop. You just tend to get people saying people should be more careful in what they eat, and take antidotes regularly if they’re worried. There’s a lot of victim blaming.”</p>\n<p>“That’s disgusting,” she hissed.</p>\n<p>“I don’t make the laws,” Harry said apologetically.</p>\n<p>“I know,” she said, and squeezed his hand. “And since I’m not sure I’ve said it yet – thank you, Harry. Thank you for being the only person to notice and care that things might not be right. You’re a good friend.”</p>\n<p>“I’m sorry I didn’t think of it sooner,” he said anxiously, and she murmured reassurances to him for a while. He always did tend to blame himself whenever something went wrong. He wanted to save everyone – always had.</p>\n<p>Perhaps it was her turn to save him now.</p>\n<p>“You have to leave her. Don’t tell me you love her. And we’ll tell their parents.”</p>\n<p>“I don’t want to hurt them,” Harry said with a shake of his head. “Molly and Arthur have been through enough, and it’s not their fault. And besides, they’d probably just think it’s romantic… though sad that you’re breaking up with Ron. Remember how Molly said she used one on Arthur? You laughed about it.”</p>\n<p>“I remember.” Hermione felt sick to her stomach. She’d <em>laughed</em>. She’d heard about Molly dosing Arthur with a mild love potion to get him to notice her, and she and Ginny had giggled about it together. It seemed cute. Because it had all turned out happily in the end.</p>\n<p>“If I’d just <em>said</em> something!” she said, anguished. “Spoken up against it. How wrong it was. I wasn’t <em>thinking</em> and so she thought it was all cute and romantic and so she started dosing you until you went out with her! Oh my god, it’s my fault too.”</p>\n<p>“It’s okay, it’ll all be okay,” he said, but she didn’t believe him.</p>\n<p>He listened to her apologies with an instant offer of forgiveness, but he wouldn’t listen to her about leaving Ginny or cancelling the wedding, no matter how she argued or how logical her arguments. He explained in hushed whispers about his theory that he was incapable of love. She argued that even if it was true it didn’t mean he should marry <em>that woman</em> – there were other, better women out there.</p>\n<p>“Not for me,” he said with the stubbornness she knew of old. Eventually he refused to discuss it with her anymore. “Talk to Bill. Maybe he can explain it better than I can. He’s the same as me – conceived while one of his parents was under the effects of a love potion.”</p>\n<p>“Bill? But he and Fleur are in love – happily married.”</p>\n<p>“Exactly. Talk to him. And if you want to repay me for giving you the antidote… please don’t shame Ginny. I don’t want this to go public.”</p>\n<p>She sighed, and nodded, and his relief at that was scant repayment for the tremendous – though painful – favour he’d just done her.</p>\n<p>“I won’t protect Ron,” she warned.  “You can’t ask that of me.”</p>\n<p>“I understand.”</p>\n<p>He might understand her, but she didn’t understand him. She would try talking to Bill. Perhaps he’d have some insights into this craziness of Harry’s.</p>\n<p>Ron had been bewildered when Hermione had swept through their shared cottage like a hurricane, clothes and belongings literally flying through the air as she swished her wand and sent everything she owned (or could plausibly lay claim to) swishing into a couple of trunks. They had Expansion Charms on them, and after work finished on the very day she’d met up with Harry she’d bought them expressly for the purpose of helping her move out as quickly as possible.</p>\n<p>“What’s going on?” Ron said, ducking for cover as books flew through the air around in. “What’s the emergency?”</p>\n<p>“I’m leaving you, Ronald Weasley! And if you try anything I will hex your bollocks off, and <em>laugh</em>, so don’t even <em>think</em> about drawing your wand,” she warned, fury in her eyes.</p>\n<p>“Sweetheart?” he said hesitantly.</p>\n<p>“I <em>know</em>!” she screamed, swishing her wand to shrink down the empty bookcase, before stowing it in a trunk as well.</p>\n<p>He looked nervous, “If this is about having lunch with Lavender, I assure you it was just as friends. I’d even take Veritaserum to prove it – nothing happened.”</p>\n<p>She laughed bitterly, and with her hair wild and a mad gleam in her eyes she looked too intimidating for him to even think about drawing his wand, or doing anything but standing very still, frozen like prey that doesn’t want to draw a predator’s attention.</p>\n<p>“I don’t care who you sleep with. Not anymore. You can go fuck anyone you like – just not <em>me</em>. Preferably<em>, go fuck yourself</em>. You foul, despicable excuse for a human being. You <em>drugged me</em>. With a love potion. You fucking rapist!”</p>\n<p>He paled, freckles standing out sharply. “It wasn’t like that – I love you! It was just to enhance what we already-”</p>\n<p>With a swish of her wand and a muttered incantation his pitiful attempt at an explanation was cut short as he started noisily vomiting up a continuous stream of slugs. She summoned away his wand as extra insurance.</p>\n<p>“You. Will. Shut. Up!” she hissed angrily. “You can just stay there and vomit up slugs. I’m going to pack. I’m going to leave. And you will never speak to me again.”</p>\n<p>Ron scurried to the sink and stayed there while she finished her furious packing – the spell was too intense for him to get out more than a gasp of air or a couple of words before another batch of slugs came gushing out his mouth with an ooze of slimy liquid.</p>\n<p>Eventually she faced him again in the kitchen, where he held onto the sink desperately as spasms wracked his body as the tidal wave of slugs kept coming.</p>\n<p>“Hermion- Bleurgh!”</p>\n<p>“Shut up.”</p>\n<p>“Love y- Blllehhhh!”</p>\n<p>“I thought about snapping your wand, but I’m better than that. Better than you. I did throw your wand down the toilet, however. I didn’t flush, so have fun getting it back.”</p>\n<p>“Help me pl- Blarrrrgh!” The soft plopping noises of slugs falling into the sink was repulsive.  Just like he was.</p>\n<p>“I will be telling everyone what you did. You’ll never have another chance to drug a woman into caring for you ever again. I hope you end your life sad and alone. Preferably soon.”</p>\n<p>“But-! Bleurrrrrgh!”</p>\n<p>The two trunks floated out the door behind her, which slammed shut behind her. She was done with Ron. No, she was done with <em>Weasley</em>.</p>\n<p>-000-</p>\n<p>On a sandy cliff in Cornwall overlooking the sea, not far from Seashell Cottage, Hermione sat next to Bill Weasley, watching the ocean together and chatting amicably. The sky was grey and overcast, so the water wasn’t postcard-blue. But the ebb and flow of the ocean waves was still a beautiful and calming sight, and the noise of the waves and the cries of the seagulls were soothing, like white noise.</p>\n<p>“So, Harry told you about me, then. I <em>did</em> ask him to keep it quiet,” Bill said, with thinly masked irritation.</p>\n<p>“I’m sorry. I guess he thought I needed to know. Ron… Ron has been dosing me with love potions,” she admitted quietly. Though she was trying to stay calm and just state the facts, anger still seeped through her voice, and could be seen in the tightness of her lips and the clenching of her hands.</p>\n<p>Bill glanced down at her flat belly. “Are you expecting? Are tentative congratulations in order?”</p>\n<p>“No! No. I don’t think so,” she said, with slightly less certainty. “I shouldn’t be. We’ve been careful. I’ll know in a week’s time for sure, one way or the other.”</p>\n<p>“I’m sorry.”</p>\n<p>“What for?” she asked grumpily.</p>\n<p>He looked at her warily. “It’s a general apology. It always works well with Fleur. Whatever I said that was wrong, I apologise for.”</p>\n<p>A small smile snuck out, almost against her will. She liked her anger – tried to hold onto it as much as possible. It kept the tears away. She peeked at Bill – his bright blue eyes shone with humour, and he was still a handsome man despite the scars across his face.</p>\n<p>“I can see why she likes you.”</p>\n<p>“I’m a married man!” he said with a laugh. “You missed your chance. Besides, Ron would combust.”</p>\n<p>“Ron,” she said with a scowl, the familiar warmth of anger filling her again.</p>\n<p>“So,” Bill said uncomfortably, “what did you want to know? Why mum did it? What it meant for me?”</p>\n<p>“The latter. Specifically, why it seems like you’re so in love with Fleur, when the literature – what little there is on the topic – says that you should be unable to love.”</p>\n<p>“And can I trust you to keep this discussion confidential?”</p>\n<p>She thought about it for a moment. “Can I talk about it with Harry? If I need to?”</p>\n<p>Bill nodded after a moment. “Yes, I suppose so. But no-one else.”</p>\n<p>“Agreed.”</p>\n<p>“So, you might know that mum got pregnant with me quite young. I don’t want to go into how or why, but dad was under the effects of a love potion at the time. Not that mum believes it affected me, mind you. We talked about it a couple of times, but I could never convince her there was anything wrong. I dated a few girls at Hogwarts, you see. Said how crazy I was about them. So she thought everything was fine.” He wrapped his arms around his legs and gazed out at the waves crashing against the short, as they talked.</p>\n<p>“But it wasn’t.”</p>\n<p>“No. I just dated because that was what you did. I never really felt anything for them. A few kisses, plenty of hand-holding. I made out in a few broom closets, and had one very uncomfortable make-out session up the top of the Astronomy Tower that I eventually ended by pretending I heard Filch coming past on a patrol. I even tried making out with a guy once in case that was it – nothing. I never told mum about <em>that</em>, of course. Good wizards don’t shame their families like that.”</p>\n<p>“There’s nothing wrong with being gay, you know.”</p>\n<p>He shrugged. “It doesn’t apply to me anyway. I’m not gay. I wasn’t anything, and I was trying to accept that and be content with it. It was good enough. Until I met Fleur.” His eyes lit up with joy as he spoke about her.</p>\n<p>“She was different. From the moment I saw her. I felt a spark, just like people talked about. I was drawn to her – excited. I wanted her to notice me. She of course thought I was suave and cool – not bumbling around trying to impress her like all the other idiots. She thinks I’m partially immune to her charms, strong of will - and I’d like things to stay that way so please don’t tell her otherwise.”</p>\n<p>“Shouldn’t you come clean?”</p>\n<p>“Why?”</p>\n<p>Hermione thought about it – what to say that wouldn’t offend. “She should know the truth?”</p>\n<p>“Maybe I’ll tell her one day,” he said vaguely. “I’m not ready.”</p>\n<p>Her mouth tightened. Another Weasley manipulating his relationship regardless of what his partner wanted. At least this one was only drugging himself… as far as she knew.</p>\n<p>“Look, the point is with her allure from being part-Veela, I love her. Like I can never love anyone else. I don’t want to lose that. You don’t understand what it’s like to go through life feeling <em>nothing</em> for anyone else. I’ve dated people I said I cared for, but I wouldn’t have died for them. Well, out of logical choice I might risk my life, but not from love. But I would die for Fleur. Do you understand? She makes me a better person. I would do anything to make her happy. I’m not alone in the world anymore.”</p>\n<p>She nodded slowly. “I see.” It wasn’t so much him manipulating Fleur, as him permitting her to manipulate him. Into <em>feeling</em>. “I didn’t realise it could be that bad.” She still thought he should confess, but it didn’t sound like he was hurting Fleur – he really did love her.</p>\n<p>He picked at a blade of grass, shredding it slowly and letting the pieces drift away to the ocean on the breeze. “It’s hard to explain what it’s like. I can’t really compare it to anything else – I don’t know how. I’m just running off what’s in books. What people say. I try to compare it to what I feel for my family, but I don’t know if other people love their parents and siblings more than I do – how can I judge that?”</p>\n<p>Hermione kept her voice carefully neutral as she asked her next question, “If Fleur threatened to leave you, would you give her a love potion to make her stay?”</p>\n<p>“No. I hate those things. You can’t understand how much I hate them,” he said, blue eyes sparkling with anger. “I’d beg her to stay. Promise her anything. I’d die without her – I’d willingly take myself from this world rather than live without her love. But I would never do that to her. How could I forgive myself if we brought a child into the world to suffer the emptiness I lived with my whole existence, before my precious flower brought me to true life?”</p>\n<p>She nodded. “I’m sorry.”</p>\n<p>“A general sorry?”</p>\n<p>“All purpose,” she said with a quirk of a smile. “For everything I said that upset you just now.”</p>\n<p>“It’s okay. And I’m sorry about Ron. Want me to punch him for you? Kick him in the nads? Big brother’s privilege – I’m allowed to without him getting all junior Auror on me.”</p>\n<p>“No. Thanks though. I’ll get revenge my own way.”</p>\n<p>She understood Harry’s desperation to stay with Ginny a little better now. Never having had love, perhaps of <em>any </em>kind (damn those Dursleys) he was clinging to what little he had. Harry was right – talking to Bill had helped.</p>\n<p>She still didn’t like it, but would <em>try</em> to respect his wish to butt out of his relationship (pitiful mistake though it was), and leave Ginny alone. The instant Harry changed his mind the gloves would come off, though.</p>\n<p>Ron, now – that was another matter. She was going to make his life as miserable as possible. She’d started by moving out, obviously. After her first night at the Leaky Cauldron with her life packed in a couple of trunks, she’d found a poky little apartment in Diagon Alley to stay in. It was pretty unimpressive – nothing much to speak of with a kitchen straight out of the 1920’s and grime that hinted that maybe the apartment hadn’t been cleaned since it was built. In the tiny bathroom there was a claw-footed old enamel bathtub she had to fill by hand or with the wave of her wand as there wasn’t any plumbing for it. She’d wanted something fast, and there wasn’t much on offer in Diagon Alley at any given moment in time – she wasn’t the only one who liked the convenience of living there. She didn’t really enjoy the sensation of Apparating, and it was handy to be able to walk to walk at her office at the Department for the Regulation and Control of Magical Creatures, or out into the middle of London.</p>\n<p>And she’d told everyone what <em>Weasley</em> had done. Even Rita Skeeter, who was genuinely delighted with the unexpected windfall of dirt and promised it would be her pleasure to drag his name through the mud in the papers. But it wasn’t enough for the fire that still burned inside her.</p>\n<p>She’d also gone to George’s shop, bought out his entire stock of love potions, and smashed them on the floor of his shop in front of him, one by one, while telling him in detail just what she thought of “love” potions, and his rapist brother. She’d thought about smashing them <em>without</em> buying them, but didn’t want to be arrested for vandalism. By the end of her tirade, with pink fumes rising into the air around him and shattered glass all around her feet, George proclaimed his undying love for her and fell to his knees with a painful crunch on the shards of broken glass to beg her to marry him. (She was unaffected – she was taking the antidote regularly at the moment – just in case.)</p>\n<p>She hoped it would teach him a valuable lesson, and was kind enough to insist that he take an antidote – <em>for her</em>. After he had, he just stared at her for a while, blood seeping through his pants where his knees had been cut to ribbons by the broken glass, before muttering a brief apology. She swept out of the shop, triumphant, while people scurried to get out of her way.</p>\n<p>Ron – <em>Weasley</em> she reminded herself – sent her an owl a few days after she’d left. It was heavy on justifications, and light on apology. He was sure she still loved him deep down, and that they should get together to talk. He said they could still fix this. She crumpled the parchment into a ball and set it on fire. He was going to <em>pay</em>. And she knew just what kind of revenge would hurt him the most.</p>\n<p>“Draco, I want you to date me.”</p>\n<p>He laughed at first, shoulders shaking. “Really now. My horoscope did say an unexpected surprise was in store for me today. Seriously now Granger, why are you here? A donation to your cause for creature rights? Some kind of quid pro quo arrangement for political support?”</p>\n<p>Her hands clenched on the wooden chair arms as she sat in front of his desk. “I’m serious. Well, sort of serious. I want us to date for a while. You don’t have to commit to a long-term relationship. Or actually be interested in me in any way. I understand you’ve been slowly courting Astoria Greengrass – or so <em>Witch Weekly</em> claims. So long as you’re not currently engaged or exclusively dating her, I’d appreciate it if you’d date me for just a couple of months, then we can break up and you’re absolutely free to return to her arms. Being seen with me would do wonders for your shaky public image. I can speak up for you in public – how you’ve turned over a new leaf, how you deeply regret your actions in the war. Your apologies will sound more convincing coming from my lips – you can keep your pride and I’ll be humble on your behalf. I have contacts in the Ministry that could be advantageous for assisting your business or political interests. Dating me would do more for your image than thousands of Galleons donated to St. Mungo’s.”</p>\n<p>He leant back on his plush velvet chair and looked at her thoughtfully. She sat nervously opposite him on the other side of his desk. She’d hated having to come to Malfoy Manor, but needs must, despite the bad memories the place held. She had a plan. And Draco was the key.</p>\n<p>“What do you really want here, Granger? You’ve explained what’s in it for me – very thoughtful of you. You’re calm and concise, like you prepared a script for this in advance. But what’s in it for you? Surely you’re not claiming you’re secretly in love with me? Those were not the words of a woman admitting a hidden passion,” he stated, looking deeply sceptical and suspicious.</p>\n<p>She hesitated for a moment, but let honesty and anger spill unpractised words out of her mouth like poison, more bitter with every sentence that fell from her lips. “Revenge. I want Ronald Weasley to hurt, like he hurt me. I want him so angry his ears turn red when he thinks of us. I want him to know that he’s second-best in everything. That he lost to Draco Malfoy, of all people. I want spittle to fly out of his mouth when he rages at the sight of his former girlfriend – almost his fiancée – eating out at a restaurant he could never afford. I want him to see that he’s scum. Too far beneath me. For him to see that you – whom he hated above all other boys at Hogwarts – possess me when he does not and that I think you’re <em>better</em> than him. I want you to sneer and pose at him and make him incandescent with jealousy and anger, until he demands I leave with him, or begs me to come back, but I sneer too and then he knows that he is <em>nothing</em> to me now. I want the world to see Weasley brought low.”</p>\n<p>Her voice grew angrier the more she spoke, and Draco’s smile grew more with every word until at the end he laughed with sheer malicious delight at the enticing picture she painted.</p>\n<p>“Oh, Granger, how could I say no to such a delightful scheme?! And what did the Weasel do to earn this ire? Did he cheat on you?”</p>\n<p>“He <em>drugged</em> me,” she yelled. “Dosed me with love potions for <em>years</em> until I forgot how much he annoyed me, how much I missed talking to Victor, how I valued my career! Made me love his stupid freckled face and made me forget how I hated the way he keeps his mouth open when he eats, and cheats and lazes his way through life! It might be tolerable in a friend but I <em>never</em> wanted to sleep with him! Not after the way he walked out on me and Harry in the forest! That was it, and I broke up with him, and he just <em>drugged me back into compliance! Into his bed!</em>”</p>\n<p>She panted angrily as she caught her breath, but Draco wasn’t laughing now.</p>\n<p>“Granger… Hermione,” he said, leaning towards her with a serious look. “I’ll help you make him pay. He deserves it. A little mild potion to make someone notice you who wouldn’t give you a second glance, maybe. But that? Stealing your maidenhead? No. No, the man is less than the mud on my boots.”</p>\n<p>“Stealing my what?” she said with a shaky laugh. “No. I lost my virginity to Victor back in fifth year. But what Ron did was no less bad because of that. He <em>thought</em> he was my first. I let him think it – tolerated his fumbling hands and let him take the lead. I loved him, after all. But it wasn’t love. It was rape – what he did to me. I just didn’t know it at the time.”</p>\n<p>“A man should never force a woman’s affections like that,” said Draco with anger in his voice. Anger for <em>her</em>. It warmed her. “I shall help you make him pay for that.” He took her hand, and raised it slowly to his lips, laying a gentle testing kiss on her knuckles. His mouth was soft and warm, and while it didn’t thrill her, his touch didn’t repulse her like the thought of Ron did. Thoughts of Ron just sickened her now – the memory of his grunting thrusts atop her made her want to vomit.</p>\n<p>Draco’s voice drew her back to the present, pushing the intrusive memory away. “It would be my pleasure to help you. Just say how we shall begin.”</p>\n<p>Hermione let out a long relieved sigh. She wasn’t going to be rejected and humiliated. Her gamble was paying off after all. “It’s a ten step plan. I have notes,” she said, opening up her briefcase.</p>\n<p>“Of course you do,” Draco said, amusement twinkling in his grey eyes as she explained the first step where he was to buy her an expensive bouquet of flowers and “accidentally” let slip who they were for, in front of anyone he knew to be a dreadful gossip.</p>\n<p>The second step was going to be a public date. She realised she was looking forward to it, and the public snubbing she hoped she might be able to give Ron. And if he didn’t show up to try and interrupt her “first date” with Draco, well, there were still eight more steps and he was sure to bite sooner or later. The longer it went on the more convincing it would be.</p>\n<p>-000-</p>\n<p>They held hands across the candlelit table, while around them people watched them curiously. What was <em>Hermione Granger</em> doing at a romantic table for two at <em>Epicure</em>, Diagon Alley’s newest and most exclusive restaurant? With <em>Draco Malfoy</em> of all people?</p>\n<p>He’d looked at her with obvious and open admiration when he’d seen her, and pulled out her chair for her to sit, tucking her back in awkwardly as she scooted the chair inexpertly in to the table. What was the point of pulling out a woman’s chair for her? Hermione was quite capable of doing it herself. Still, she supposed it all helped to send the message she wanted to all the gossipy crowd of diners watching them – Hermione Granger and Draco Malfoy were clearly out on a date together. There wasn’t anyone there she recognised, but it was a start. Well, it was step two, technically, and she had a large bouquet of roses sitting in a transfigured vase at home to prove it. If they moved too fast, Ron wouldn’t believe it. And she wanted him to be fooled into thinking her make-believe romance with Draco was genuine. If he thought it was fake, he wouldn’t suffer as much.</p>\n<p>They made small talk for a while, about the weather, the menu, and her work at the Ministry in the Department for the Regulation and Control of Magical Creatures working on improving the rights of underprivileged non-humans. He complimented her dress. She complimented his choice of wine (really she had no idea – she didn’t even <em>like</em> wine that much).</p>\n<p>Over dessert, he leant over next to her with his hand on her shoulder to whisper in her ear, “Laugh and hit gently at my shoulder like I just said something <em>very</em> naughty.” His breath tickled her ear as he spoke, making her shiver.</p>\n<p>She pulled away with a mostly genuine laugh, and pushed him away gently with one hand on his chest. “Draco! You can’t be serious! We’re in a <em>restaurant</em>!” she said.</p>\n<p>He smirked at her, and let his eyes linger on her cleavage, breasts on display in a brand new red velvet dress with a low neckline bought specially for the occasion of their first date. “Maybe later then,” he purred, taking her hand off his chest to play with her fingers, rubbing his thumb over them. He planted a kiss in the palm of her hand before letting it go.</p>\n<p>Hermione glanced around, and noticed Pansy Parkinson passing by, turning away to gossip with a friend when she saw Hermione looking at her. Hermione blushed – she couldn’t help it. Everyone was going to think she was sleeping with Draco. She wavered for a moment in her thoughts wondering what the hell she was doing, before the memory of Ron’s “special” morning cup of tea he brought for her while still in bed reminded her why she was doing this. Nothing mattered more to her right now than getting revenge. And she could always dump Draco in some horribly humiliating way if he crossed a line. So far though, he was a polite and willing conspirator. It would probably be best if they just “parted as friends” after their flirtation had served its purpose.</p>\n<p>Hermione kind of hoped she could keep the truth behind her arrangement with Draco secret. She hadn’t even told Harry – Ron knew him too well, and Harry’s attempts at lies could be kind of pathetic sometimes. She didn’t want to keep this from him, but felt that she had to (at least until she’d gotten her revenge on Ron). The risk he’d give her plan away was too high. He wrote to her saying he’d started hearing gossip that she was dating Draco, and asked if she was happy. He also let her know that George had complained a bit about her smashing his stock of love potions, but had gone quiet when Harry had simply responded, “Good for her.” Hermione had written back that while she wasn’t truly happy yet, she was getting there. And yes, definitely not drugged this time because she was taking antidotes occasionally, and had also bought a toadstone ring (using up almost all her savings) to detect poisons and potions in her food. She wrote reassuringly about how being with Draco was helping her feel better about things, and he was a surprisingly kind and thoughtful date.</p>\n<p>Ron had owled her too, complaining at length about her article in the Daily Prophet about him, and ranting generally about how he knew it had to be fake.</p>\n<p>\n<em>“I know you’re only dating Draco out of spite, because I <strong>know</strong> you can’t stand him any more than I can. Clearly you’re just trying to make me jealous, and that’s childish of you and it won’t work. You’re just making yourself look ridiculous and cheap. You’d better cut it out immediately and apologise if you want any chance of us getting back together.”</em>\n</p>\n<p>In regards to guessing correcting that they weren’t really dating she had to grudgingly give Ron credit that sometimes he was smarter than he looked, though his ridiculous assumption that she’d want to reconcile made her livid. She’d have to try harder, until that smug superiority was washed away completely in angry jealousy. She had a start, she just needed to capitalise on it.</p>\n<p>The news of her dating Draco hadn’t featured in <em>Witch Weekly</em> yet, but she hoped it would do so soon.</p>\n<p>Of course, with the spread of gossip came consequences – not all of them what she’d wanted. And as she knocked on the door of Malfoy Manor she was very nervous about this one. Draco’s parents had heard about them dating, and wanted to meet her. There was surely no way this could go well.</p>\n<p>She was met at the door by Draco.</p>\n<p>“Hermione, welcome. Or should I use a pet name? My ‘little bookworm’, perhaps?” he asked with a grin.</p>\n<p>“Hermione will do just fine on its own I think, thank you,” she said, then paused before adding, “but you may use ‘Mione on occasion if you want to irritate Ron. When he’s not around I’d rather you didn’t, however.”</p>\n<p>“Come on in, my parents are waiting in the breakfast room. But don’t worry too much,” he said in a soothing tone of voice as he opened the door for her, leading her in with a hand pressed to the small of her back.</p>\n<p>It was all jarringly different from the last time she’d encountered Lucius Malfoy in his home. He smiled pleasantly at her, for a start. To her surprise it was Narcissa who seemed less pleased to see her, and looked her up and down in a way that made Hermione instantly wonder what was wrong with her robes and if she had something on her face.</p>\n<p>They went through the hollow courtesies of greeting that had always bored Hermione, before Draco to her relief cut the chit-chat short by getting down to business.</p>\n<p>“I explained to mother and father that your interest in me isn’t serious, and that your focus is on getting revenge on Weasley,” he said, the admission startling her. They hadn’t discussed letting anyone else know.</p>\n<p>“You told them?” she asked with a frown.</p>\n<p>Narcissa looked down her nose at Hermione as she said, “You can <em>hardly</em> think we would celebrate Draco breaking off his most promising courtship of Miss Astoria Greengrass in order to go out on a date with you. Explanations were required.”</p>\n<p>Draco reached out for a scone off a platter and spread it with jam and a dollop of whipped cream, seeming very nonchalant. “Astoria understood. She will keep quiet, and wait for me.”</p>\n<p>“Indeed,” said Mr Malfoy. “And don’t think Miss Granger that we are unaware or unappreciative of the unparalleled opportunity you have offered not just to Draco, but to our whole family.” He directed a rebuking look at his wife, who avoided eye contact with a tiny frown of pursed lips.</p>\n<p>“I wished to let you formally know,” he continued, “that we will be presenting a unified front to the public, supporting your ‘relationship’ with Draco. No unkind word in regards to the unfortunate circumstance of your birth shall cross my lips – we will be stating our utmost regard for our son’s happiness and our respect for your intelligence and skills.”</p>\n<p>Hermione’s eyes widened. “Ah, I see. I will be the poster child for your reformation – your opportunity to demonstrate your tolerance of Muggle-borns, proved by your willingness to support a serious relationship between your pure-blood heir and myself.”</p>\n<p>“Exactly right,” he said with a smug smile, “if bluntly put. And delightfully, it is a relationship without any chance whatsoever of resulting in marriage or… any other complications.”</p>\n<p>Narcissa’s smile was tight as she took her turn quizzing Hermione. “It <em>is</em> without any chance of resulting in a child out of wedlock, I hope? There is such a thing as taking an act <em>too</em> far.”</p>\n<p>“Mother! We discussed this!” Draco said with a roll of his eyes.</p>\n<p>Hermione nodded. “Of course. I understand. We won’t be sleeping together, I promise you. Though we might imply it to others in public, if that’s acceptable?”</p>\n<p>“I am concerned for my son’s reputation. And the potential impact on his future engagement,” Narcissa said stiffly.</p>\n<p>“It will be fine, dear,” Lucius said, patting his wife’s hand briefly. “His reputation will be significantly bettered by this dalliance, and Astoria has promised to wait for him; she’s a most obliging and sincere young woman.”</p>\n<p>“I’d appreciate if you didn’t discuss our arrangement with anyone else,” said Hermione. “A secret shared amongst too many isn’t a secret for long.”</p>\n<p>There was a murmur of agreement – everyone seemed happy to keep it quiet.</p>\n<p>“Rest assured the news won’t go any further,” said Draco. “I’d hardly want to be seen publicly as a schemer. Much better that I be a man in love.”</p>\n<p>Narcissa frowned again, but said nothing.</p>\n<p>“Thank you again for this opportunity, Miss Granger,” said Lucius smoothly. “And might I add that I am interested in supporting your upcoming bill you’ll be presenting to the Wizengamot soon about improved rights for werewolves in regards to employment opportunities, and time off around the full moon.”</p>\n<p>Hermione perked up. This scheme could have more benefits than she’d realised. She chatted eagerly about her proposed changes to legislation, and promised to owl him some background information about it, and a copy of the draft bill.</p>\n<p>After finishing morning tea, the couple were invited to stroll around the grounds together, affording them the opportunity to discuss the next steps in Hermione’s plan. Hermione had a feeling that Narcissa would be watching them through the windows. It was an uncomfortable feeling, but hardly the worst thing she’d suffered through at their manor.</p>\n<p>As they walked further out of sight of the manor along a gravel path and into a manicured herb garden Draco took her arm and linked it with his, so her hand rested in the crook of his elbow.</p>\n<p>“What are you doing?” she said with surprise. “There’s no-one to observe us here, surely?”</p>\n<p>“No,” he admitted. “But you have a tendency to tense up when I touch you. If you wish to be convincing in this charade, you will need to overcome it.”</p>\n<p>“I hadn’t even noticed.”</p>\n<p>“It’s a subtle thing,” he said. “Besides, this is the proper way for a gentleman to escort his date on a walk. It will look odd if you are unfamiliar with such a simple courtesy.”</p>\n<p>“R- Weasley never did that.”</p>\n<p>“Weasley has no class.”</p>\n<p>“True.”</p>\n<p>He smiled at her at her prompt agreement. She’d never noticed before, but his grey eyes had a touch of blue in them.</p>\n<p>“I apologise for mother. She worries too much. I think she suspects you’ll try and entrap me into marriage.”</p>\n<p>Hermione snorted. “You’re nicer than I thought you were, but not <em>that</em> nice. I understand that I’m interfering with your relationship with Astoria with this charade, and I’m sorry about that.”</p>\n<p>“She will wait. She understands these games – she was in Slytherin too after all. A couple of years below us. And it’s worth it, to see Weasley suffer.”</p>\n<p>“Is there a reason in particular you hate Ron?” she asked curiously. “I mean, we always fought in school, and then there’s the war. Is it that? You don’t seem to hold the same enmity for Harry.”</p>\n<p>“Potter proved to be surprisingly decent. Honourable. He saved my parents from Azkaban – that’s not something you can just turn away from. And frankly, when it comes to the Dark Lord – good riddance. He brought nothing but misery and shame to my family – we were doing better without him and have yet to completely recoup our status and wealth. So we all owe Potter for that.”</p>\n<p>“We definitely do,” she agreed, pleasantly surprised by his opinion of Harry.</p>\n<p>“Now Weasley - we’ve been at odds ever since he laughed at me on the Hogwarts Express. But if you want a particular example of why, it’s not so much the war. We all did what family and circumstances forced us into, him included. No, it’s about incidents such as the time when he laughed at me for <em>weeks</em> after Professor Moody – Crouch really – turned me into a ferret and bashed me against the walls.”</p>\n<p>Hermione’s lips quirked with amusement. “You must admit, it <em>was</em> rather funny.”</p>\n<p>Draco sneered at her angrily, “Oh really? And what if <em>Potter</em> had been turned into an animal by a teacher? Snape for instance. And then imagine that he was thrown again and again against the stone walls and floor until his wrist shattered and his leg fractured, while Slytherins stood about and laughed at the fun. Would that have been ‘rather funny’ too? It’s only funny because you don’t truly like me – this is just a pretence and we both know it. But when it’s someone you favour, that kind of thing is bullying, assault… evil. When you don’t like the victim it’s just a funny joke, right?”</p>\n<p>Hermione blanched. “I’m… I’m sorry. I never realized. I thought… we thought he was just kind of bouncing you.” She thought guiltily of how they’d laughed at Draco, the amazing bouncing ferret.</p>\n<p>“Ferrets are well known for their ability to bounce off stone unharmed, are they?”</p>\n<p>“You’re right, we were idiots not to realise,” she admitted shamefacedly.</p>\n<p>Draco’s anger faded away at her apology, and was replaced with a smirk as he patted her hand where it rested on his arm. “At last you acknowledge your intellectual inferiority to me. It took you long enough.”</p>\n<p>“Oh do shut up,” she grumbled. “See if I ever apologise for a mistake to you again, you smug prat.”</p>\n<p>He chuckled at that, and she joined in with his infectious laughter. She was starting to get the hang of talking to Draco – the trick was not to take his words at face value, for a snarky, sarcastic sense of humour underlay many of his statements, and he was usually happily amused if she picked up on that and argued with him instead of getting offended.</p>\n<p>“So if I recall correctly, step three was attracting media attention to our burgeoning relationship?” he asked with an enquiring lilt to his voice. “Do you wish to make a formal statement of some kind, or encourage friends and acquaintances to gossip to the press?”</p>\n<p>“Oh, that won’t be a problem. Skeeter will publish what I ask her to. She’ll make it sound like she just heard it as gossip.”</p>\n<p>“Because you’re such good friends,” he said sceptically, “and she’s well known for being agreeable.”</p>\n<p>“I have my ways,” she said with a smirk.</p>\n<p>“Do you now? And what comes after Rita’s article?”</p>\n<p>“Step four is a second date, with dancing and increased physical contact. Step five is our third date, where you pick me up from work wearing Muggle clothes. We’ll go out into Muggle London, demonstrating both your serious commitment to me, and also your growing tolerance for all things Muggle.”</p>\n<p>“Is there kissing, on this second date?” he asked, tilting his head and looking at her interestedly.</p>\n<p>“I… suppose.”</p>\n<p>“Shall we practice?”</p>\n<p>She hesitated a moment to think about it. It would probably be best to have their first kiss in private, rather than on a dance floor. “Alright.”</p>\n<p>He let go of her arm and turned to face her, reaching up a hand to brush along her cheek, making her shiver. Then he wound his fingers through her hair. “I like how you keep your hair smoother, these days.”</p>\n<p>“It’s a lot of work, but it looks more professional – better for work,” she said, feeling a little intimidated by how close he was standing, his face so close to hers. He leant towards her, and kissed her. It was… nice, she guessed. Warm, and gentle. Then his right hand tightened in her hair, and his other arm went around her waist, and he pulled her close against his body as he deepened the kiss, tongue sliding between her lips to tangle with hers. She moaned softly, involuntarily, and after a couple more kisses he pulled away with a smile.</p>\n<p>“Not bad,” he said with a smirk. “You’re a natural at this.”</p>\n<p>She took a deep breath. She could hardly believe she’d been kissing <em>Draco Malfoy</em>. “I may as well enjoy it. Better you than Goyle. He wasn’t an appealing option as a second choice.”</p>\n<p>Draco shook his head with a smile. “He wouldn’t have gone for it. Blaise would have - he’d sleep with anyone, even you.”</p>\n<p>“I’m flattered by your charming endorsement of my desirability as a partner,” she said dryly.</p>\n<p>“No offence.”</p>\n<p>“None taken,” she said reassuringly with a pat on his arm, even though he didn’t actually look worried at possibly having offended her. “Zabini’s bedroom habits are no concern of mine.”</p>\n<p>“He has a reputation. But really, I just meant that he would’ve been happy to help out with your scheme too. He would’ve found it funny. The odds of him getting drunk and laughing about it with someone would be a bit high, though – so probably best not to say anything to him,” Draco mused thoughtfully, thinking it through as he spoke. “When you break up with me, if you still want to make the Weasel jealous, you could always simply ask him out. He might try to pressure you into bed, though.”</p>\n<p>Hermione thought she didn’t really like the sound of that. Even if Blaise <em>was</em> almost as good-looking as Draco.</p>\n<p>Hermione had assumed there would be some kind of dance club for them to go out to for their second date, but apparently the wizarding world was completely lacking in nightclubs, at least in Britain. And the next <em>Weird Sisters</em> concert was months away. Draco had a suggestion that he thought might suit, however.</p>\n<p>“Pansy is throwing a ball for her birthday, and it’s only a week away. I can take you as my date – we can dance there. Of course the Weasel won’t be invited, but it <em>will</em> be quite the social event, and I assure you your invitation would be quite gossiped about. If you are lucky, he might even try to gatecrash.”</p>\n<p>Pansy was reportedly <em>delighted</em> to add Hermione to the guest list for her party, a claim which Hermione doubted the veracity of, but appreciated all the same for its courtesy. She must at least be over her schoolgirl crush on Draco, to take the news of them dating with such grace. Hermione had <em>no idea</em> what to buy her as a present, and in a burst of inspiration she decided to use her bewilderment as to what gift to buy as an excuse to gossip about her and Draco’s date with Harry, her good friend Susan Bones, some other acquaintances at the Ministry, and of course Luna, Neville, and Hannah. Hannah was Neville’s current girlfriend – it seemed to be going well with genuine affection between the pair, as best her newly suspicious eye could judge.</p>\n<p>Susan claimed she’d always <em>thought</em> Hermione and Draco would make a good couple (to Hermione’s secret bewilderment), and suggested chocolates or wine for Pansy’s present. Neville suggested a potted plant, of course, while Hannah favoured scented toiletries as a gift. Luna ignored her question and congratulated Hermione on getting rid of her Wrackspurt infestation. Then she hugged her tightly without explanation, and wouldn’t let go despite Hermione’s laughing protestations that she was fine, until finally Hermione broke and clung to her friend as she started crying about what Ron had done, and how broken and soiled she felt. To Hermione’s relief, the fey young woman of uncanny understanding didn’t say anything in Ron’s defence, or judge her. She just hummed soft words of agreement, and continued hugging Hermione more gently until she calmed down. Then she fed Hermione cookies and tea and gossiped brightly about strange magical creatures (that probably didn’t exist) until she was all smiles again. It was an odd relief to let the tears out at last.</p>\n<p>She didn’t ask Ginny for any advice. She didn’t want to even <em>think</em> about her, let alone talk to her. She’d decided recently that she’d have to pull out of being a bridesmaid, but didn’t know how to break the news about <em>why</em> without ranting about her wrongdoings or skipping straight to hexing the cow (which sadly, Harry would disapprove of).</p>\n<p>In the end she’d chickened out and invited Harry out for coffee, and asked him to talk to Ginny on her behalf. Harry did his best to talk her down from her initially firm stance as he really wanted her to stay in the bridal party, and had instead offered his promise to get Ginny to stop owling her about hairstyles and flowers.</p>\n<p>“All you’ll need to do is just show up,” he pleaded.</p>\n<p>“But Harry,” she sighed unhappily, “Ron is in the bridal party too – he’s your best man. I don’t want to even sit at the same table as him.”</p>\n<p>“Oh,” Harry had said quietly, “I’m going to have to choose, aren’t I?”</p>\n<p>“I’m afraid so.”</p>\n<p>“You’re both my best friends in the world,” he said sadly. “I don’t want to lose either of you.”</p>\n<p>“Even after what he did?”</p>\n<p>Harry slumped. “He said he didn’t actually know how strong the potions were. He thought it just made you more inclined to… you know. Be in the mood more often.”</p>\n<p>“He lied, Harry,” she said through gritted teeth. “He gave them to me <em>every day</em>. He turned me into a lovesick <em>slave</em> who catered to his every whim. The difference is just… immense.”</p>\n<p>“Yeah,” he said sadly. “I mean, I know. I know he’s lying. And I’m sorry. Really, so very sorry. We’re not talking much at the moment. I’ll tell him he’s out as best man. ” He wore a determined look now, though it was tinged with grief at the incipient final loss of his friend. “Maybe you can be my best woman?”</p>\n<p>Hermione appreciated the firming of Harry’s resolution and support of her. But when she thought about it, she realised after a moment that she didn’t even <em>want</em> to be in the bridal party.</p>\n<p>“No,” she said resolutely. “If you’re going to try and maintain a relationship with him, which I guess you’ll <em>have</em> to as he’ll be your brother-in-law if you’re really going through with your farce of a wedding-”</p>\n<p>“-Don’t call it that.”</p>\n<p>“Sorry. But it’s true. I guess that’s kind of my point. What I’m trying to say is that I won’t be a good bridesmaid, or best woman. I don’t <em>want</em> to stand up there and force a smile while you go through with your wedding to Ginny. I love you like a brother, Harry – I just can’t support it. You deserve better than her, you really do. So you may as well stick with Ron as your best man.”</p>\n<p>“Are you sure?”</p>\n<p>“Dead sure.”</p>\n<p>“You’ll still come to the wedding, won’t you?” he pleaded with big, wide eyes like a hopeful puppy. “You can bring Malf… Draco.”</p>\n<p><em>Now <strong>that </strong>had potential,</em> she thought to herself. And she couldn’t say no to that cutely imploring face.</p>\n<p>“The Weasleys won’t like it. There might be a scene,” she warned. “It’s not just Ron, George is mad at me too. And you know how angry I am at Ginny. Molly sent me a Howler you know, for saying nasty untrue things about her baby boy to the paper.”</p>\n<p>He shrugged. “Just don’t make a big scene until after the ceremony is done, if you can manage it. After that, have at it. If that’s the price of my best friend being there at my wedding, so be it.”</p>\n<p>“Oh, Harry!” she said happily, and he grinned and ducked his head bashfully.</p>\n<p>“Still friends?” he asked anxiously with a shy smile. “Coming to the wedding now?”</p>\n<p>She reached out and squeezed his hand. “I still hate Ginny. And I think this is a mistake. I’m so sorry I can’t support your wedding like I know you want me to. But I can be there for you anyway, and I’ll do my best. It’s what you want, so yes, Draco and I will be there. I’ll even smile at Ginny and tell her how beautiful she looks and how lucky she is – that’s true at least. We’re still friends, Harry. And if you <em>do </em>change your mind at the last minute about Ginny, I’ll hex the lot of them so hard it’ll give them PTSD flashbacks while you seize your chance to Apparate the hell out of there. Because that’s what a best friend does.”</p>\n<p>Harry didn’t seem as amused by that half-joking plan as she’d hoped, though he appreciated her general sentiment of wanting to be supportive of him. She cursed herself quietly in her mind for not keeping her big mouth shut. She should’ve just said something vague and supportive and left it at that.</p>\n<p>When she repeated her stupid plan later to Draco, he found it hilarious. He didn’t seem inclined to ask for an explanation of why she hated Ginny, thankfully, which made the conversation easier. She figured he probably just assumed she hated all Weasleys now.</p>\n<p>In the end after a lot of consulting and pondering, after wrapping up her chat with Harry she’d bought a few nice perfumes from a Muggle shop and made up a little perfume gift basket for Pansy.</p>\n<p>And then, after all her effort to think of a good gift, Draco told her that he’d assumed they’d be giving a <em>joint</em> gift.</p>\n<p>“Why didn’t you tell me that in the first place?” she complained, chatting to him that evening via his Floo connection, crouched down on the floor in front of her smoke-stained little fireplace with her head poking through the green flames into his own spacious parlour.</p>\n<p>“I assumed you would know. It’s basic etiquette for dating couples,” he said with a shrug.</p>\n<p>“Well I’m not returning my gift,” she said stubbornly.</p>\n<p>“I didn’t <em>ask</em> you to,” he said, tilting his head to one side as he watched her curiously.</p>\n<p>“You want to use my gift instead of yours?”</p>\n<p>“No, we’ll simply combine them. I can add my box of imported Belgian chocolates to your gift basket, and re-wrap it.”</p>\n<p>“Oh.”</p>\n<p>“Problem solved,” he said happily, raising his glass of white wine to her like he was toasting her.</p>\n<p>“Ron and I didn’t compromise well,” she said thoughtfully. “And I guess I assumed you’d want your own way. My mistake.”</p>\n<p>Draco shuddered. “Please do not confuse me with that pathetic specimen of manhood.”</p>\n<p>Hermione laughed, and he grinned back at her amusedly.</p>\n<p>He chatted with her for a little while about the party’s dress code (casual but dressy robes), and what would happen at the party (platters of tiny canapés, lots of wine and champagne, and a string quartet that would play music for everyone to dance to).</p>\n<p>“I’m not the best dancer,” she warned.</p>\n<p>“I saw you dance at the Yule ball in fourth year. You were quite graceful and light on your feet. I’m sure you’ll be fine,” he said reassuringly.</p>\n<p>“You watched me dance?”</p>\n<p>“<em>Everyone</em> watched you dance. You usually looked so homely, but you were simply stunning that evening. We were all in shock.”</p>\n<p>“Oh, well thank you,” she said, feeling rather flustered. “I didn’t want to disappoint Victor. And I suppose I wanted to show Ron what he was missing out on.”</p>\n<p>Draco smiled at her wickedly, teeth gently biting his bottom lip for a moment. “I hope you find the prospect of a delightful evening in my own company similarly motivating to drive you to new delights of beautification.”</p>\n<p>She wasn’t quite sure if he was serious or not, until some over-the-top seductive eyebrow-wiggling pushed her over the edge into laughter.</p>\n<p>“Don’t worry,” she giggled. “I’ll scrub up especially nice, just for you.”</p>\n<p>“And for Pansy too,” he added with a leer.</p>\n<p>“What?!” she laughed in shock.</p>\n<p>His shoulders quaked with suppressed laughter. “Why, I mean that you need to show her what a beautiful girlfriend I’ve acquired, and make her terribly jealous. What were <em>you</em> thinking about, you naughty minx?”</p>\n<p>“You’re a horrible, horrible man. You know that, right?”</p>\n<p>“I may have had it mentioned to me once or twice.”</p>\n<p>She eventually ended the call with a smile, and slept peacefully that night, her dreams blissfully free of Ron.</p>\n<p>-000-</p>\n<p>Ron was waiting in the Atrium on Level Eight when she finished work on the afternoon of Pansy’s party, standing between the lifts and the line of gaudy Ministry Floos. He was dressed in his Apprentice Auror robes – scarlet with black trim. She used to think he looked so handsome in them. Now she found herself looking around nervously to see who was around to back her up if there was a nasty confrontation. She thought the security wizard in a peacock blue robe checking wands might be her best bet, but the thought wasn’t terribly reassuring. She put her hand in her robe pocket, resting it lightly on her wand just in case.</p>\n<p>A fight didn’t seem imminent, however, as Ron flourished a bunch of red roses at her, and approached with a friendly air.</p>\n<p>“Hi Hermione, these are for you,” he said, holding them out to her with a nervous smile, but she didn’t take them, and just let his arm hang their uselessly in mid-air.</p>\n<p>“You think a bunch of roses will fix this? Don’t make me laugh!” This wasn’t what she wanted. She wanted anger. Jealousy. Complete and utter humiliation. The optimistic and rather condescending smile he was wearing now wasn’t the attitude she craved.</p>\n<p>“Don’t you think I’ve suffered long enough?” he asked. “I’m sorry, Hermione. Is that what you wanted to hear? I won’t… do that again. <em>You know</em>. What I did. So, come home.”</p>\n<p>“Home?” she hissed angrily. “I have a home. Away from you. We are <em>over</em>, Ronald Weasley. You drugged me, and raped me, and that’s unforgiveable.”</p>\n<p>She snatched the flowers off him and dashed them to the floor, scattering red petals like blood across the tiled floor.</p>\n<p>“You’re making a scene,” he chided.</p>\n<p>“Good! You deserve that!”</p>\n<p>“Look, I know you still love me deep down-”</p>\n<p>“-Clearly you know <em>nothing</em>, you ignorant louse!”</p>\n<p>“You wouldn’t be trying so hard to make me jealous if you didn’t care for me! You’re overreacting. Those potions don’t work unless there’s existing feelings there already to build on.”</p>\n<p>She wavered for a brief moment, lost in memories. She <em>had</em> loved him, once. But no more.</p>\n<p>“If I ever did, that love is dead now,” she said with quiet conviction. “As is our friendship, for that matter. My affections have turned elsewhere.” She turned her back on him and the wreckage of roses, and stalked off towards the row of fireplaces under the curious eyes of witches and wizards lingering to watch the drama.</p>\n<p>“I know you don’t love Malfoy!” Ron yelled after her, trailing behind her. “This is <em>just</em> like you flirting with Cormac McLaggen in sixth year all over again! You’re making a fool of yourself for nothing because I’m already willing to make up. And of course he doesn’t love you! Not like I do. Come home, Hermione.”</p>\n<p>Hermione gleefully realised she had the perfect opportunity to get the last word in before Flooing away.</p>\n<p>“No-one deserves to be ‘loved’ like you ‘loved’ me. That wasn’t love. It was slavery,” she called loudly to him. “And <em>Draco</em> knows how to treat a woman right, unlike you.”</p>\n<p>She thrilled at the sight of his outraged eyes at that last dig – angry at last – as she disappeared in a flash of green flames.</p>\n<p>-000-</p>\n<p>It took an hour of effort with spells, hair products, and occasional cursing to wrestle her frizzy locks into sleek sophistication, and another half-hour fussing with rarely used cosmetics, but Draco’s admiring gaze at her stylish appearance made her feel it was worth the extra effort.</p>\n<p>Pansy air-kissed her cheeks on arrival at the Parkinson manor like they were old friends instead of old enemies, and was simply <em>delighted</em> with their gift, and <em>loved</em> Hermione’s forest green dress robes. Even if she wasn’t sincere, she was at least a very polite liar about it all, which was good enough for Hermione.</p>\n<p>Daphne Greengrass was less thrilled by their appearance together, but Draco swept Hermione quickly onto the dancefloor before she could approach. But the confrontation couldn’t be put off forever.</p>\n<p>While Draco was busy getting them both glasses of chilled white wine, Daphne darted over to hiss a warning to Hermione. </p>\n<p>“Don’t get too attached,” she warned with a scowl. “He’s never going to marry you. He’s just <em>using</em> you. He’ll tire of you and your Muggle-born ways soon enough and cast you aside, and then he’ll marry <em>my</em> sister.”</p>\n<p>Hermione blinked. Obviously Daphne wasn’t one of the few in the know about the truth behind her and Draco’s arrangement.</p>\n<p>“Maybe, maybe not. If what you say is so, then I’ll enjoy it while it lasts,” she said eventually. “Carpe diem.”</p>\n<p>Daphne looked puzzled for a moment, before rallying. “Tramp,” spat Daphne, and she swept off angrily.</p>\n<p>“She wasn’t bothering you was she?” asked Draco, handing her a glass of wine.</p>\n<p>“Nothing I couldn’t deal with,” she assured him.</p>\n<p>“Excellent. Now, tell me something intimate about yourself that I can taunt Weasel with if he shows up,” Draco whispered into her ear, putting a warm hand on the small of her back as he leaned in close to her. “I heard you two had quite the public spat this afternoon, so I wouldn’t be surprised if he turns up.”</p>\n<p>“Hmm. Well, I like to take a snack and a book with me when I have a bubble-bath – it’s one of my favourite ways to relax. Soft cheese and sliced fruit to nibble on, and fruit-scented bubble-bath. And I like reading biographies for fun.”</p>\n<p>“That sounds delightful. I enjoy packing a small hamper and flying by broomstick to somewhere secluded for a relaxing picnic. But that’s not quite the level of <em>intimate</em> anecdote I had in mind,” he purred. “Something <em>sexual</em>, Hermione. The kind of detail only a lover would know.”</p>\n<p>“Oh, well uh…” she stammered. “I enjoy a man going down on me, and Ron never did that very often. And I can get very noisy.” Her voice was the quietest whisper imaginable, making Draco lean in very close indeed to catch her answer. His cologne smelled delightful, like spices and musk, and his face so close to hers made her heart flutter. Purely a meaningless physiological reaction, she assured herself.</p>\n<p>“I will remember that,” he said with a grin.</p>\n<p>“Your turn,” she insisted with a blush. “It’s only fair if I hear something about you in return.”</p>\n<p>“I enjoy having a woman on her knees in front of me, clutching at my hips while her head bobs back and forth. I would wind my hands in your hair and make a dreadful mess of it while you sucked on my hard cock until I came in your mouth,” he whispered in her ear.</p>\n<p>“Draco!” Hermione glanced around paranoidly, hoping desperately no-one was listening in, but no-one was close enough to possible overhear them.</p>\n<p>He laughed wickedly at her embarrassed reaction. He looked like he was going to tease her some more, but somewhat to her relief Pansy waved him over imperiously for a private chat, and Hermione escaped to the buffet to drink her wine and nibble on a tempting looking canapé of a parcel of something unidentifiable wrapped in bacon. And she tried to calm her racing heartbeat while images of what they’d whispered about danced through her mind.</p>\n<p>Draco took a while to return, and in the meantime she accepted a dance from Ernie Macmillan, whom she remembered from the DA. He looked like he’d gained a little weight since graduation, but his tailored dark purple robes flattered him well. He chatted as they danced, wanting to know about whether Draco’s family was supportive of their relationship.</p>\n<p>“You must keep in mind,” he warned kindly, “that while a dalliance might be tolerated by a pure-blood family, marriage is another matter. It’s not Draco you have to win over, it’s his parents. My mother says all the right things and is proud I fought against You-Know-Who, but she still looks forward to the day I bring home a nice pure-blood witch to meet the family. I’m a ninth generation pure-blood you know – that doesn’t happen by accident. There’s a lot of family pressure. And you know Malfoy’s family is worse than mine!”</p>\n<p>Hermione smiled. “It’s alright Ernie. It’s early days still and we’re not talking about marriage yet. But did you know I’ve met his parents already? His father is actually <em>delighted</em> we’re dating, can you believe it? As a war hero I’m quite a good catch, reputation wise. His mother approves too, though she’s a bit more… wary about it all. I think maybe she’s worried about me hurting her son. I honestly thought it would be the other way around – that Lucius would despise me for potentially sullying the pure Malfoy line.”</p>\n<p>“I would never have picked that either,” said Ernie with a surprised blink. “You know it could really help heal the divisions in society – if you and Malfoy marry.”</p>\n<p>“Too soon, Ernie!” she laughed. “Hush you, we’re just dating. It’s going marvellously, mind you! I’m much happier with Draco than I ever was with Ron.” As the dance ended, they wandered together to the buffet and chose a selection of canapés each to snack on.</p>\n<p>“I thought you two seemed really happy together,” Ernie said wistfully, around a mouthful of quiche. “It’s a shame you broke up.”</p>\n<p>“Didn’t you read the paper? About how he drugged me?”</p>\n<p>“Oh, the love potion?” he asked, not sounding especially concerned. “Yes, I read how upset you were about it. Usually people stay together after the potion wears off. Most people think it’s romantic.”</p>\n<p>“Being dosed every day for years is <em>romantic</em>?”</p>\n<p>“Was it that often?! Gosh, that’s a bit much isn’t it?”</p>\n<p>“<em>Yes it was</em>,” she said in a very chilly tone of voice.</p>\n<p>“You really should be more careful with your drinks, you know. It’s just common sense. And there are signs you can spot in yourself if you’re being affected – witches should really know those.”</p>\n<p>When Hermione saw Draco returning to the dancefloor, she murmured her excuses to Ernie with relief and hurried over to him with a genuine smile. He stole a piece of smoked salmon on a tiny oval of toast from her plate and listened patiently as she vented her frustrations about Ernie’s lack of understanding of how horrible being drugged was.</p>\n<p>“Romantic! Can you believe that!” she fumed. “And he blamed me for not noticing I’d been drugged.”</p>\n<p>“Well he <em>was</em> a Hufflepuff. You have to make allowances for him being a bit dim.”</p>\n<p>She snorted with laughter. “Not all Hufflepuffs were duffers.”</p>\n<p>“Enough of them. All the intelligent students went to Ravenclaw and Slytherin. With the occasional very lost Gryffindor,” he said, with an amused quirk of an eyebrow at her and a sly grin.</p>\n<p>“What kept you so long, anyway?”</p>\n<p>“I was helping Mr. Parkinson throw out Weasel. He tried to gatecrash Pansy’s party.”</p>\n<p>“You did what?! He was supposed to see us together,” complained Hermione bitterly. “Why didn’t you and Pansy just let him in?”</p>\n<p>Draco smirked at her. “Because I did something much better. When he cast doubt on the sincerity of our relationship I insulted him, and told him to leave. I said that we wanted our relationship respected and kept private, and I threatened to make him pay if he ever tried to bother you again.”</p>\n<p>Hermione’s mouth gaped open as she stared at him totally bewildered for a moment. “But that’s not the plan, and he’d never… Oh! Draco, that’s brilliant! You’re a genius!” She broke into peals of delighted laughter as she realised his plan – Ron would <em>never</em> do what Draco told him to do. It was a hundred times better than her plan to simply let him glimpse them kissing, especially since he was still doubting their relationship was real.</p>\n<p>Draco puffed up proudly under her praise, looking delighted with her reaction. “I rather thought you’d like it,” he said smugly. “He puffed up like an angry red toad, vowing to make me suffer for stealing his woman, before stalking off impotently with Mr. Parkinson yelling after him that he had no class, and to never darken the door of his manor again. It was wonderful – I <em>am</em> sorry you missed it, but they didn’t tell me what was going on until we were halfway to Weasley.”</p>\n<p>She sighed happily at that delightful vision of frustration. “Next time I <em>have</em> to see it.”</p>\n<p>“Come on, the next song is about to start.” He held her close as they waltzed, and he kissed her gently at the end of the dance, his mouth tasting faintly bitter like the wine he’d been sipping. She kissed him back, even though Weasley was of course nowhere in sight. Of course, he might return at any moment, you never knew. And there <em>were</em> others watching. She tugged on his hand to draw him out to a balcony, and he went away with her willingly, waving cheerily (and perhaps slightly tipsily) to Pansy when she smiled and wiggled her fingers at him in a tiny girlish wave as they passed.</p>\n<p>“I think Pansy likes you,” he said, wonderingly.</p>\n<p>“Don’t be ridiculous,” snorted Hermione. “She likes <em>you</em>. She’s tolerated me this evening, at best. So long as I look like I’m making you happy, she’ll put up with me. The instant you start complaining about me to her she’ll be more than happy to join in the mud-slinging.”</p>\n<p>“You’re probably right,” he admitted. “Still, I’ve seen her be catty for no good reason in the past. She’s actually trying this time, so that’s something.”</p>\n<p>Draco looked around the balcony – it was deserted. The cheery lights and warmth inside the manor were a sharp contrast to the quiet of the cool night and the slight chill of the bare granite balustrade. The fir trees and manicured lawns with their sparkling white quartz paths meandering through the grounds did look beautiful in the shadowy dappled moonlight.</p>\n<p>“What are we doing out here?”</p>\n<p>“I just thought it would be nice out here in the moonlight,” said Hermione, who was quietly hoping Ron – no, <em>Weasley</em> – might be roaming the grounds trying to get back in to the party, like an unwanted Romeo. “We could kiss? If you wanted to. People should see us making out, but I’d rather they weren’t close enough to eavesdrop on our conversation.”</p>\n<p>“Never let it be said that I disappointed a lady,” he murmured, tucking a strand of her hair behind her ear that had escaped the chignon knot that had seemed so secure earlier that evening. The charms must be fading. He gave her such a soft look, before a wicked smile snuck onto his face, as his gaze roamed all the way down her body and back up again. His gaze lingered at her chest where her cleavage was given a boost by the lightly corseted green gown, and her small emerald pendant necklace dangled enticingly between her breasts. “But <em>where</em> shall I kiss?”</p>\n<p>“Not <em>there</em>. Eyes up here, buddy,” she said with a laugh. “Your mouth, on mine. Now.”</p>\n<p>“Bossy. Well, your delectable lips are a fine place to <em>start</em>,” he conceded.</p>\n<p>She laughed a little, to try and hide the fact that his words made her breath catch and her heart beat faster.</p>\n<p>For all his suggestive words, when he started kissing her he didn’t seem inclined to try and kiss his way down her neck to her breasts like she thought he might. His kisses were soft, and he didn’t seem to slobber like Ron did. His hands weren’t as well behaved as his lips were, however, and she when she felt his hands drift down from her waist to rest atop her buttocks she had to whisper a reminder that there <em>were</em> limits to the charade. His hands obediently returned to her waist.</p>\n<p>Pansy cooed a happy farewell to them when they took their leave, but Daphne glared fiercely at them from across the room. Not everyone was thrilled to see them together. It gave Hermione a pang of worry for Astoria, but Draco reassured her that Astoria knew the truth. “She understands. She just doesn’t want to see us together – it’s why she stayed home tonight. But Daphne – she’s not a good liar, Slytherin though she was. She’s ambitious, more than cunning. So she wasn’t told. Don’t worry, she’ll get over it easily enough once we’ve broken up and I’ve proposed to her sister.”</p>\n<p>“That’s good. I’m sure she will,” Hermione agreed. But the thought didn’t reassure her as much as she’d expected.</p>\n<p>“Do I <em>have</em> to go out and mingle with Muggles?” whined Draco, a few days before their planned date, chatting through her Floo to iron out the last few details of where to meet and what to wear. His disembodied head in the greenish flames looked like it was pouting. “We could just leave together and give the <em>impression</em> we went out on a date.”</p>\n<p>“I already bought the tickets weeks ago!” said Hermione, aghast. “Grand Tier seats at <em>The Royal Opera House</em>, at 190 pounds each! You can’t skip out on me and leave me there on my own.”</p>\n<p>He sighed. “How much is that in Galleons?”</p>\n<p>She did some quick mental maths. “About 76 Galleons total for the two tickets. That’s just the opera itself and doesn’t include the taxi there and back or dinner at the Crush Room.”</p>\n<p>Draco looked surprised. “Merlin’s beard! And what kind of concert is worth that much money? The Weird Sisters are only 6 Galleons a show! Can you afford that?”</p>\n<p>“Don’t worry about the money – my parents gave me the money for it. The goblins’ exchange rate is outrageous, and my Ministry job doesn’t pay as well as I’d assumed it would. And of course it costs a bit, it’s an opera. <em>Carmen</em>, composed by Bizet. It’s in French, which I understand you speak. I’ve picked up a little from holidays in France, but not enough to follow it, so I’ll probably just read the surtitles.”</p>\n<p>“What’s an opera, exactly? Will there be dancing?”</p>\n<p>“Seriously? You don’t know what an opera is?”</p>\n<p>He frowned at her.</p>\n<p>Pure-bloods. They lived in a weird cultural ghetto. “Okay. Well, it’s like a play you just sit and watch and listen to, but it has lots of singing. Really <em>good</em> singing. And instrumental accompaniment – lots of violins and other stringed instruments, as well as woodwind and brass sections. It’s regarded as a very classy form of entertainment suitable for rich people and musical snobs, if a little old-fashioned. You’ll love it, I promise. I picked something that wouldn’t be ‘too Muggle’ and won’t shock your sensibilities.”</p>\n<p>“Dress code?”</p>\n<p>“Formal. A Muggle suit, of some kind. Black tie would be fine.” She thought for a moment about the kinds of things wizards wore when they were trying to mingle with Muggles. “A black suit with a white shirt would be best. Nothing gaudy or colourful.”</p>\n<p>“I <em>know</em> what black tie means,” he said frostily. “I think you’ll find my sense of fashion is superior to yours.”</p>\n<p>She arched an eyebrow at him. “Well <em>forgive </em>me, your highness. You <em>have</em> seen some of the things pure-bloods think are Muggle attire, haven’t you? Women’s nightdresses, and plaid trousers with a green straw sun hat?”</p>\n<p>He paused for a moment, then nodded. “Point to you. I’m quite confident I know what’s appropriate, but I’ll owl you a photo of my planned outfit for double checking. Is that agreeable?”</p>\n<p>“That sounds great.”</p>\n<p>Draco looked broody and reflective. “That's a lot of Galleons for one night out. I didn’t know your family was wealthy.”</p>\n<p>“Definitely not anywhere as much as yours – your manor is gorgeous, and the grounds are amazing. But my parents are quite well off by Muggle standards. They’re both dentists – Healers who specialise in fixing problems with teeth. It’s a reasonably lucrative career choice.”</p>\n<p>“Do we really <em>have</em> to go out amongst Muggles?” he pleaded again. “Could you get a refund of some kind? My father’s really not going to like it. I can think of some other lovely date ideas. I’ll pay.”</p>\n<p>She laughed at him. “I’ve already briefed your parents about it, so they can say the right things if asked. Your father was <em>thrilled</em> by the plan. He said something along the lines of, ‘Better him than me. Let Draco hobnob with the Muggles. It will do our image good.’ So you see, there’s no hope for you. You’re doomed to endure an opera with me. But trust me, it won’t be the ordeal you’re fearing right now.”</p>\n<p>“Damn you, father,” muttered Draco rebelliously to himself. Hermione ignored him. He didn’t have to like it – he just had to agree to it and put on a passable act, and she was confident he’d manage that much.</p>\n<p>-000-</p>\n<p>In the sumptuous darkened theatre Hermione smirked at Draco as he sat next to her, his gaze enraptured. He’d complained about the clothes (the black bowtie was <em>dull</em> and felt all wrong), the taxi and the frightening traffic (too unpredictable, and too noisy), and the intimidating press of so very <em>many</em> people. But once the music started, he’d shut up and hadn’t said a word except to hiss at her to be quiet when she’d asked him if he’d changed his mind about not liking her plan to come to the opera.</p>\n<p>When the lights brightened for intermission he was livid. “That’s not a proper ending!” he complained loudly. “Where’s the rest of the story! They didn’t finish it! I was enjoying that and they just left it in the middle! What’s going to happen with Don José and the smugglers? And what about Micaëla? And does Don José stay with Carmen or not? Are they ever going to get married?”</p>\n<p>“It’s just intermission,” she soothed. “There’s a twenty minute break to get drinks and go to the bathroom. Then there will be another hour of opera.”</p>\n<p>“I don’t like it,” he grumbled.</p>\n<p>“The opera?” she teased with a straight face.</p>\n<p>“The intermission!” he said indignantly, then laughed when he saw the grin on her face.</p>\n<p>“I suppose Muggles have <em>some</em> cultural accomplishments,” he conceded.</p>\n<p>Their break was very short. He didn’t trust the promise of a warning bell, and wanted to be sure of being back in their seats in time.</p>\n<p>At the end of the evening, they went to the Crush Room for a late dinner, and he grandly and patronisingly approved of the décor. Chandeliers, old oil paintings, and linen-covered tables were a very reassuringly familiar atmosphere for him, even if the patrons weren’t dressed in the robes he was more accustomed to.</p>\n<p>“This is quite nice,” he said, looking relieved. “More sumptuous than I’d dreamed. I’d heard Muggles sat in crowded little rooms to eat, with no-one waiting tables so you had to fetch your food yourself. Eating with flimsy cutlery that broke if you tried to use it, if they even gave you cutlery <em>at all</em> – I heard many Muggles ate with their hands. I suppose people were just making it up to mock me. Making fun of the ignorant pure-blood.”</p>\n<p>“Not really. What you said is actually the case in cheaper restaurants,” she conceded. “Fast-food restaurants, they’re called. You collect your meal of food like burgers and chips from the counter yourself, and eat them with your hands. But the nicer restaurants are a more traditional dining experience. Typically fancier than Hogwarts, in fact.”</p>\n<p>She ordered the smoked duck breast with pomegranate dressing, while he pondered the many options and eventually selected the poached lobster salad. He approved of the variety of delectable French desserts on offer, and they both decided they wanted the crème brûlée for dessert.</p>\n<p>“I enjoyed this evening immensely,” he said after the last bite of dessert was finished, reaching across the table to hold her hand. “Thank you for pushing me to come here, even though I was nervous. I would have missed out on such a wonderful experience, without ever knowing what I’d lost.”</p>\n<p>“I’m so glad,” she said with a smile. “No complaints then? Apart from the taxi?”</p>\n<p>“Well…” he said hesitantly, “it worried me that Carmen died at the end of the opera. That was a rather barbaric end to the tale. But I can appreciate the drama of it.”</p>\n<p>“It’s dreadfully sad,” she agreed. “A lot of operas are tragedies.”</p>\n<p>“Muggles don’t do that often, do they?” he asked in a quiet worried voice. “You don’t worry Ron will attack you out of jealous rage, do you?”</p>\n<p>She felt touched, and shyly embarrassed that he’d thought to worry about her feelings. “I don’t really worry… that is… I worry sometimes he may try and drug me again. With another love potion. But Harry promised to give me another antidote if I ever went back to Ron for any reason.</p>\n<p>“The opera is just a story – not real events. And one set over a century ago, at that. But while people don’t use swords any more, things a little like that do happen on rare occasions in the Muggle world – a man killing his partner if she dares to leave him. ‘If I can’t have you, no-one will!’ It’s the horrible end to years of domestic violence, in some cases. I’d wager something similar happens in the wizarding world on occasion too, albeit probably more likely to involve curses or poisons than knives.”</p>\n<p>“Potter’s a good friend to you,” mused Draco thoughtfully. “And thank you for being honest this evening instead of only telling me <em>nice</em> things about the Muggle world.”</p>\n<p>They took a taxi back to the <em>Leaky Cauldron</em>, where they got Tom to take a photo of them in all their Muggle finery, and kissed farewell in front of the few relatively disinterested patrons there before going their separate ways home via the Floo.</p>\n<p>The next day the society column of the <em>Daily Prophet</em> included their photo along with some quotes from Draco raving about the delights of Muggle opera, the high quality of the finer restaurants, and how he was looking into buying season tickets. He gave all the credit for the idea of going to the opera to his “darling Hermione”, and gushed about how she made him happier with every day of their life together.</p>\n<p>She knew the last bit was a complete fabrication. But it was nice to hear him saying such pleasant things about her. He was keeping up his end of their agreement more than adequately.</p>\n<p>She especially loved Rita’s little jibe she worked into the article about how it was clear <em>some</em> men of higher calibre knew the way to a woman’s heart was through charm and appreciation, not a bottle of potion.</p>\n<p>“What’s this?” Draco said, waving the gilt edged card at her disbelievingly. He’d shown up at her office at the Ministry at the end of the day with a gift of flowers to disguise the real object of his visit (a puzzled complaint) from her co-workers.</p>\n<p>“A wedding invitation, obviously. You’re my plus one. I’m not in the bridal party anymore – I couldn’t stomach standing up in support of their sham of a marriage. But I’m still going as a guest, and I’d like you to go too. It’s step six in my plan.”</p>\n<p>“Potter and the youngest Weasley spawn? Must I?”</p>\n<p>“<em>Yes</em>. Please.”</p>\n<p>“Very well. I suppose it <em>is </em>the ‘event of the season’. Any objections to intimidating the hoi polloi with a conspicuous show of wealth in formal robes?”</p>\n<p>It sounded fine to her. “Not at all. Go for it. I’ll be dressing up to make him rabidly angry about my now-unattainable beauty.”</p>\n<p>Draco looked thoughtfully at her. “I’ll pay for new robes for you. And I’ll ask mother about loaning you some of the Malfoy jewels.”</p>\n<p>“What?”</p>\n<p>“Your dresses on our dates were quite acceptable – don’t misunderstand me there. You looked lovely in your robes, even if the shoes weren’t quite a match. But if you want to intimidate, impress, and make a show of how happy we are together in front of your ex, custom-made flattering expensive robes will do that much better than a robe or dress everyone has already seen you wear to another event. The Malfoy family jewels will be the icing on the cake. Weasel probably won’t recognise them, but others will – and will no doubt gossip about it.”</p>\n<p>“This is payback for me making you wear a Muggle suit, isn’t it?”</p>\n<p>“That’s just a delightful bonus,” he smirked. “Don’t worry about the cost – just get the best available. It’s my treat in thanks for our delightful date at the opera. I’ll set up an appointment with <em>Twilfitt and Tattings</em>. Mother might go with you – I’ll sound her out on it for you.”</p>\n<p>“Joy,” she said in a voice dripping with sarcasm.</p>\n<p>“Be nice. She doesn’t have much to fill her days with since the war. Some families snub her because she supported the Dark Lord, others snub her because she turned on him. If she’s willing to make a rare trip out of the house to help you pick out a robe, I’d appreciate it if you’d show a little bit of bloody courtesy about it, for Merlin’s sake,” he said with increasing snippiness.</p>\n<p>“Alright, I’ll do it for her sake,” she promised. She’d just assumed Narcissa wouldn’t want to slum it out in public with a Mudblood. She’d never thought much before about the families of those who’d been on the other side of the war, or cared about their social lives. Life had been easier when things were more black and white.</p>\n<p>She shooed him out after their discussion that so she could wrap up a few last bits of work before finishing for the day. With the <em>Werewolf Fair Employment Act</em> passed, with several pure-blood members of the Wizengamot unexpectedly supporting it much to her delight, it was time to move onto other important projects such as securing more unpolluted waterways for mermaid habitation, and laws to protect their lives and territories.</p>\n<p>-000-</p>\n<p>Later that evening at home Hermione realised something she’d missed in the conversation. She’d accidentally called Harry’s wedding to Ginny a “sham”, and Draco hadn’t blinked an eye at her turn of phrase. She knew she should leave it alone, but it nagged at her like a sore tooth. He couldn’t have missed it. She’d also been talking about not being in the bridal party, and he didn’t even question that. He was too smart to miss it, and surely too curious to just leave such a thing alone. Eventually she gave into the pressure of thoughts whirling around in her head, and popped through the Floo to visit him, ostensibly to join the Malfoys for dinner and to discuss shopping plans with Narcissa. After the social niceties of greeting were done, she covertly asked Draco if they could go somewhere private to talk before dinner.</p>\n<p>“Well, well. It seems an auspicious day for me today!” he said with a grin, and led her to his room. “We can’t be long of course, or mother will worry.”</p>\n<p>His bedroom was very luxurious, with a carved four poster bed hung with heavy green velvet curtains, a brass-bound wooden chest with a curved top looking like a pirate treasure chest at the foot of his bed, two dark stained oak bookcases crammed full of leather-bound books, and a selection of dragon figures in various metals and ceramics adorning the tops of the shelves. Animated tapestries made the plain white walls more interesting, with embroidered dragons swooping through clouded skies, and gliding over stormy seas. A portrait landscape of a magical wood had tiny fairies flitting to and fro, and shy unicorns peeking out from behind trees. Draco closed the door behind them as they entered.</p>\n<p>“So, I was wondering…” Hermione started nervously, biting her lip. She glanced at him then away, embarrassed and not knowing where to start.</p>\n<p>“Mmm. I have been too,” murmured Draco, and stepped forward to slide his arms smoothly around her waist, pulling her into his lean body and kissing her softly.</p>\n<p>“What are you doing?” she gasped, pulling her lips away from his.</p>\n<p>He tilted his head quizzically at her. “Kissing you, obviously,” he said, and leaned in again to kiss her again, afterwards delicately trailing kisses on her sensitive neck. His lips mouthed at her skin, with just a hint of teeth – not enough to hurt or leave a mark – and it sent shivers down her spine. Her breath came faster and she let out an involuntary moan as his hands cupped her buttocks while his mouth nibbled at her neck.</p>\n<p>“But there’s no-one to see us, this is just pretend, remember?” she murmured. “We’re not actually in a relationship.”</p>\n<p>He pulled his head away from the patterns he was tracing on her neck with his tongue, and his grey eyes gazed seriously into her own from inches away. It would have felt intimate even <em>without</em> his hands kneading her buttocks while they spoke, or the evidence of his arousal pressing firmly against her lower belly. “Oh, yes of course,” he said matter-of-factly. “But just because it won’t last doesn’t mean we can’t have a bit of fun, don’t you think?”</p>\n<p>She bit her lip as she thought about it. Soft strands of Draco’s pale blonde hair brushed against her face as he leant in to kiss and nibble at her ear while she thought. The soft press of his wet tongue pushing inside her ear brought a shiver to her body that was decidedly <em>not</em> helping her concentrate. She <em>was</em> attracted to him. And why not? Didn’t she deserve a little fun? He might be a bit of an arrogant prat whose family would disown her if she was <em>really</em> out to catch him for marriage. But he was a very <em>handsome</em> prat. Surely it wouldn’t do any harm if their play-acting had a bit of added realism.</p>\n<p>“Just so long as we both remember it’s going to end soon,” she warned breathlessly. “That this doesn’t mean anything. Lust isn’t the same thing as love.”</p>\n<p>“Of course,” he agreed with an amicable smile, drawing back to look into her eyes again. “We both know that it can’t go anywhere. And I won’t risk getting you pregnant and sully both our reputations in the process. But there are still many other things we can do.”</p>\n<p>“Just not… actual sex?”</p>\n<p>“Astoria’s rule. And mine. You understand, I hope?”</p>\n<p>She took a step back from him and reached behind her to peel his hands off her bottom, making him sigh with disappointment. But when Hermione lifted them up and placed them on her breasts with a coy smile, he let out a deep groan of appreciation and started squeezing them gently. She sighed happily with little breathy moans as he started tweaking at her nipples through the rough silk fabric of her robe. She closed her eyes, lost in the sensations washing through her body. It had been too long. Her nipples stiffened under the attention into hard peaks, and she arched her back needily, pressing her breasts into his hands.</p>\n<p>“You have beautiful breasts,” Draco purred, and she opened her eyes to see him watching her intently. It made her suddenly more shy. Should she really be doing this? With someone she once hated? But he wasn’t a child any longer, parroting his father’s opinions.</p>\n<p>“You look like you’re thinking too much,” Draco chided. “And no biting your lip. That’s my job.”</p>\n<p>He leant in close, one hand moving to cup the back of her head gently as he kissed her. The first few kisses were soft, and gentle. Then they became hungrier, more demanding. His tongue pressed inside her mouth, and she let him inside, kissing him back with increasing passion. He nipped gently at her bottom lip with his teeth, which made her laugh.</p>\n<p>“You vampire!” she teased. “No doubt it will be my neck next.”</p>\n<p>“Well you have such a tasty and responsive neck,” he teased, “so how can I resist?” With a sudden wicked growl he buried his face in her neck, nipping gently and sucking at the skin. It made her heart skip a beat, and made her gasp with the sudden shock of pleasure.</p>\n<p>“Ohhh… yes,” she murmured. “But don’t leave a mark.” She tilted her head back to give him better access. Her hands, resting around his waist, crept slowly down his body to brush over his buttocks, evoking an indecipherable noise of pleasure from Draco. She tugged at his white linen shirt where it was tucked snugly into his pants, pulling it free, and her hands dove eagerly underneath the cloth to glide up the bare skin of his back.</p>\n<p>Draco clearly decided that turnaround was fair play, and tried to tug the font of her robe down to expose her breasts without success, as it fitted quite snugly around the top half of her body, then flared out. He cursed impatiently and his hands roved over her back for a while before he gave up and stepped back with his hands on his hips to indirectly ask for help.</p>\n<p>“Where are the <em>laces</em>? This is ridiculous. How do you even get into this? A Cutting Charm and a Reparo?” he huffed. “I know the new fashion for witches is for tight robes and they’re delightful to look at. But there must be <em>some</em> consideration for practicality!”</p>\n<p>Hermione giggled. “There’s a zip. Madam Malkin’s been experimenting with some Muggle tailoring techniques.”</p>\n<p>She turned her back to him, and reaching behind her pulled the zip slowly down while he watched curiously.</p>\n<p>“Huh. I still don’t understand how it works. But I’m impressed. You can reverse it, surely?”</p>\n<p>The mood was still intimate, but the romantic mood was rather lost while he played curiously with the zipper on the back of her robe, tugging it up and down and peering at how the teeth fitted together, and she got a little nervous again.</p>\n<p>“I don’t know… it’s a bit fast,” she said uncertainly, when he encouraged her to shimmy out of her robe.</p>\n<p>He hesitated a moment before saying, “Then we’ll go slower.” He wrapped his arms around her as he zipped her robe back up, and she smiled with relief in his embrace.</p>\n<p>They returned to making out with more gentleness than passion this time. Kissing in a leisurely and exploratory fashion, hands roaming cautiously over each other. He learnt that she loved her neck and ears being paid attention, but didn’t like him biting her lip. Her hands roamed under his shirt and found the skin on his back soft and smooth under her fingertips, and she discovered that he was ticklish around his ribs, eliciting some surprisingly deep chuckles.</p>\n<p>Hermione had just tentatively stroked a hand across the front of his pants while he kneaded her covered breasts when the chiming sound of a bell rang through the room, and Draco cursed quietly as he pulled away from her, leaving her panting as she swayed towards him. “The dinner bell. We have to go, or mother will come looking for us.”</p>\n<p>“Of course.” Curse that bell.</p>\n<p>Hermione straightened up her dress, and smoothed down her hair as best she could, but it was a lost cause. At least messy hair would look quite normal on her. She had permanent bed hair, unless liberal amounts of hair products or charms were applied. It started out neat at the beginning of her work day, but by the evening the charms had long since worn off, and she never bothered to reapply them once she was home.</p>\n<p>Draco had turned away from her to tuck his shirt back in, and was clearly trying to get his rebellious body under control before venturing out of his room.</p>\n<p>“Umm… I actually… I had a question about Ginny?” she asked tentatively.</p>\n<p>“What? What about her?” he said, sounding very surprised by her question.</p>\n<p>“You didn’t seem surprised that I’ve had a falling out with her, and won’t be in the wedding party?”</p>\n<p>“Of course not,” he said matter-of-factly. “Ten points to Gryffindor for the choice of conversational topic, by the way. Thinking of the Weaselette is certainly helping my erection go down very quickly.”</p>\n<p>Hermione let out a surprised laugh.</p>\n<p>Still facing away from her, Draco said confidently, “Obviously she’s used a love potion on Potter at some stage. Am I right?”</p>\n<p>“I… really couldn’t say,” she hedged. “I don’t think she has.”</p>\n<p>“You don’t need to say. It’s patently obvious from the hatred in your voice when you talk about her. You haven’t had any obvious falling out – the papers would be all over that. The timing is the same as you leaving the Weasel. It could just be her being angry with you about that, but I think there’s too much venom for it to be her simply fighting with you about slandering her brother. It’s something more personal. So it must be her dosing Potter, and your prevarication just now proves I’m right.”</p>\n<p>She’d promised Harry she wouldn’t say anything. “We just had a fight. Over bridesmaid dresses. It got nasty. That’s all it was.”</p>\n<p>Draco turned around at last, and the scepticism on his face was obvious. “Mmm hmm. You’ll have to practice your lines more if you want to fool people more observant than your average Hufflepuff, you know. Well, let’s shelve that topic for now. Shall I escort you down to dinner?” He tucked a stray lock of her hair behind her ear, and offered his arm.</p>\n<p>She placed her hand in the crook of his arm, and was escorted down to enjoy a quiet family dinner with the Malfoys.</p>\n<p>-000-</p>\n<p>The staff at <em>Twilfitt and Tattings</em> were overjoyed to have Hermione patronise their store during her lunchtime break from work, but looked down their nose at Narcissa, who kept a stiff upper lip about it all, but was clearly not enjoying herself.</p>\n<p>While Hermione was in a changing room behind a thick velvet curtain, trying on a stunning and expensive Acromantula silk robe edged with silver embroidery and dripping with crystal beads, she overheard the staff’s sneering quiet comments to Narcissa. “I’m not sure we’ll have anything to suit <em>you</em>,” said one clerk, a woman in her twenties with carefully curled hair and too much make-up. “We don’t cater much to the elderly here.”</p>\n<p>“Now, now, Estrella,” tutted the older lady who worked there and seemed to be in charge, “her money is as good as anyone else’s.”</p>\n<p>“Thank you,” said Narcissa, so softly that Hermione barely heard it, as she stood frozen in the changing room, eavesdropping intently.</p>\n<p>“After all,” continued the older lady with quiet viciousness, “You-Know-Who certainly appreciated the depths of the Malfoy coffers, didn’t he?”</p>\n<p>“I didn’t-”</p>\n<p>“-She doesn’t need you, or your nasty Death Eater son,” interrupted the older woman.</p>\n<p>“Don’t you have a luncheon to get to elsewhere?” said Estrella.</p>\n<p>Hermione swept back the curtain with a clatter of wooden curtain rings, and the two women jumped back guiltily away from Narcissa, whom they’d been standing over. Hermione saw the younger one slip her wand back into her pocket. Narcissa was just sitting there quietly in an armchair, head hung slightly low and a stiff carefully expressionless look on her face.</p>\n<p>“Is there some problem here?” Hermione asked coolly. “Do you have an issue with someone patronising your store who’s a hero of the war? Are you angry at your Dark Lord’s fall? We’d be more than happy to take our business elsewhere if that’s the case. I can get my robe for <em>Harry Potter’s wedding</em> at some <em>other</em> store.”</p>\n<p>The older lady hurried towards her with an anxious fluttering of her manicured hands. “Oh no! No, Miss Granger. We’re immensely grateful for what you did in the war. You helped save us all!”</p>\n<p>“Please don’t think we sided with <em>him</em>,” pleaded the younger one. “We’re ever so grateful to you, honestly. My brother was arrested during the war – they snapped his wand but at least they let him go after that. I don’t know what might have happened if You-Know-Who had actually won.”</p>\n<p>“I wasn’t speaking of myself,” she said, still with a frosty tone of voice. “I was speaking of my beloved’s mother, Mrs. Narcissa Malfoy. She too is a hero of the war. The betrayer of Lord Voldemort – no don’t flinch – and saviour of Harry Potter. Without her, Harry would be dead, and the wizarding world still under Lord Voldemort’s rule.”</p>\n<p>Narcissa raised her head wonderingly at Hermione’s words.</p>\n<p>The two ladies gaped a little before recovering. “<em>She</em> didn’t really do much,” said Estrella hesitantly.</p>\n<p>“And you did? Lied to the Dark Lord’s face, did you? Risked your life to save your brother, perhaps?”</p>\n<p>“…No. We just… hid.” The younger woman looked ashamed, and like she might burst into tears at any moment.</p>\n<p>Hermione strode over to her and held her hands, looking her in the eyes. “And there’s no shame in that. That’s what most people did, if they had any sense. They hid. They left the country. That was smart, and I don’t blame you for it. Just remember, some people didn’t have the chance. Like the Malfoys, with Lord Voldemort hovering over the lot of them, ready to kill one family member at any moment if another didn’t do exactly what he said.”</p>\n<p>The young woman sniffed unhappily. “Thank you, that means a lot, coming from you. I knew I should have done more, but I was so scared.”</p>\n<p>“Shh, it’s alright.”</p>\n<p>“But how can you date a Malfoy?” the older woman asked, disbelievingly. “No matter what their actions were at the <em>end</em> of the war, you can’t deny the whole family is Dark. And that boy Draco took the Dark Mark too. Willingly. He’s a Death Eater – how can you stand to touch him?”</p>\n<p>“He’s not perfect. Perhaps no-one is. He became a better person – would you want to be judged your whole life on what you were like at sixteen? He regretted it quickly – he took it more to save his family than out of belief in the cause. Did you know that when Harry, Ron, and I were caught and taken to Malfoy Manor, he lied for us? He was asked to identify us and he said he wasn’t sure, it might not be us. Claimed not to recognise <em>Harry Potter</em>. He and Narcissa stalled, even with her mad sister standing right there ready to torture us and hand us over to Voldemort. Six years together at Hogwarts and you think he didn’t know who we were? He did what little he could. It wasn’t much, but he tried. And he treats me with more respect and consideration than that rapist <em>Weasley</em> ever did, who drugged me to the eyeballs with love potions until I could refuse him nothing.”</p>\n<p>The woman looked embarrassed. “I’m sorry. I didn’t know about what the Malfoys did.”</p>\n<p>“Perhaps more people <em>should</em> know. And it’s not me you need to apologise to.”</p>\n<p>At a signalling nod from the elder, the two ladies curtseyed to Narcissa. “I do apologise, Mrs. Malfoy. I beg your forgiveness for our rudeness and the misunderstanding, and I hope you know that you are in fact always welcome at <em>Twilfitt and Tattings.</em>”</p>\n<p>A slow smile dawned on her face. “Thank you, I appreciate that.”</p>\n<p>They stayed, and Hermione was eventually coaxed into ordering a horrifyingly expensive concoction of the finest Acromantula pale yellow silk, embroidered with seed pearls and real gold thread. From the quietly pleased expression on Narcissa’s face, the price (while high) was perhaps not unreasonable, however.</p>\n<p>Hermione quietly slipped the staff an extra ten Galleons as a tip. “I would not be averse to the <em>Daily Prophet </em>or <em>Witch Weekly</em> hearing about what we discussed today. If you are inclined to make it better known what the Malfoys did during the war to the Light’s benefit, and my forgiveness of their less palatable actions, I would appreciate that.”</p>\n<p>“Certainly, Miss Granger. And again, my most heartfelt apologies.”</p>\n<p>Narcissa evidently wasn’t the type to gush in public. But she gave Hermione a farewell hug to go along with her quiet whispered thanks, before she Apparated home.</p>\n<p>Clearly she was more forthcoming in the bosom of her own family, however. There was a delivery of a massive bunch of rare orchids that Hermione found waiting at her door when she returned home that evening after work, with a gilt-edged card from Draco that read, “Thank you so much. Mother is smiling again and won’t stop talking about what you did. With my love and gratitude always, Draco.”</p>\n<p>Susan Bones knocked on Hermione’s office door in the Ministry.</p>\n<p>“Hermione? Are you ready to go get lunch?”</p>\n<p>“Just finishing up now!” she called out, scribbling a last note and sending it flying off through the Ministry with a quick charm.</p>\n<p>“Good work on the <em>Werewolf Fair Employment Act</em>,” Susan said, as Hermione grabbed her bag and came out into the hall.</p>\n<p>“Thank you! I’m so pleased it got through at last.”</p>\n<p>Susan laughed. “At last? It took under a year! That’s amazing – everyone says so. And your house-elf regulations only the year before that. And I hear you’re working on some projects to do with mermaids now?”</p>\n<p>“Yes, it’s so exciting! I’ve already gotten the Black Lake officially recognised as protected habitat, and secured agreement to have water filtration charms installed on all the sewage outlets from Hogwarts!” she chattered excitedly.</p>\n<p>“That’s marvellous! You know, word is that the Minister is keeping a close eye on your work lately, and is <em>very</em> impressed,” Susan said, as they entered the cafeteria.</p>\n<p>“Oh, Kingsley is a softie for any of us lot from the war,” she said humbly. “I’m not doing anything special. And how’s your work in the Accidental Magic Reversal Squad going?”</p>\n<p>“Very well, thanks. Busy time! Lots of young kids manifesting some accidental magic this month. It’s especially tricky when it’s a Muggle-born, of course. I’ve had to call in the Obliviators a couple of times. I really think early intervention with formal contact from the Ministry would be better, in some of these cases.”</p>\n<p>The two of them each grabbed a plate of sandwiches, a piece of fruit, and some biscuits from the Ministry cafeteria, and sat down at one of the whitewashed wooden tables to share lunch and chat.</p>\n<p>“Did you hear the news about your ex?” Susan asked, leaning in close to whisper confidentially. “Ron’s been fired from the Auror Program, even though he was so close to finishing his Apprenticeship and being a full Auror. Officially it’s because he’d rather go and work in his brother’s joke shop. But a little owl told me that it’s because of ‘conduct unbecoming an Auror’, and that he was strongly encouraged to leave with his dignity intact rather than be fired.”</p>\n<p>“Susan, I think I’m in love!”</p>\n<p>“With Draco?”</p>\n<p>“No, with you!” said Hermione with a laugh. “My goodness, this is the best news I’ve heard in a long while. Oh, thank you so much, you wonderful Queen of Gossip.”</p>\n<p>Susan giggled happily. “Well thank you, my darling. But I’m afraid I’ll have to spurn your affections, as I have a date on Saturday with Carl Hopkins.”</p>\n<p>“Oh! Do tell me all the juicy details!” Hermione said eagerly. “And is he any relation to Wayne Hopkins?”</p>\n<p>“His cousin. Carl was a year ahead of us at Hogwarts. He’s working with the Unspeakables. And he’s very handsome!”</p>\n<p>“Wow, good luck!”</p>\n<p>“Thank you! I haven’t had a date for over a year, so fingers crossed it goes well. Any tips? You thawed the Ice Prince, after all.”</p>\n<p>“Low cut dresses?” Hermione suggested with a straight face, before breaking into infectious giggles that Susan joined in with. They gossiped for a little while about their respective dates, in between bites of food. Hermione found it nice to have a female friend – they’d never really bonded at Hogwarts due to being in different Houses, but the D.A. and the War had drawn them together, and when they both started working at the Ministry at the same time they found themselves sticking together a lot – two lonely, bright young women without their families around to support their ambitions.</p>\n<p>“Well, I’ve got to get back to work,” Susan said eventually, pushing her chair back with a scrape and standing up. “See you at Ginny’s hen’s night this evening?”</p>\n<p>Hermione hesitated, “Well, no, I don’t think I’ll be able to make it, actually.”</p>\n<p>“Why ever not?”</p>\n<p>“I think I’m coming down with something. I’ve been quite ill this morning,” she lied.</p>\n<p>“You look well,” Susan said doubtfully.</p>\n<p>“You know me,” Hermione said guiltily, “I’m just soldiering through, dosed up with a lot of healing potions. I think when they wear off I’m going to crash badly.”</p>\n<p>“Oh,” said Susan worriedly, taking a cautious step away from her. “Nothing infectious, I hope?”</p>\n<p>“I hope not. Some vomiting, a bit of fever – I’ve taken a Fever-reducing Potion for that. Pepper-up for the tiredness.”</p>\n<p>“Maybe you should take the afternoon off, just in case? You wouldn’t want to make anyone else sick. And look after yourself – go to bed and rest up.”</p>\n<p>Trapped in her own lie, Hermione conceded with a nod. “I think you’re right, I really should. I can take a bit of work home with me, after all.”</p>\n<p>“Work! No,” Susan said sternly, “you should catch up on some of that reading you say you never have time for anymore.”</p>\n<p>“The afternoon in bed with no work, a book to read, and a mug of hot cocoa? Alright Susan, you’ve twisted my arm and I have no choice but to comply,” Hermione said with a laugh.</p>\n<p>-000-</p>\n<p>Harry hadn’t wanted a buck’s night – he’d said he didn’t see the point of it, and Ginny certainly didn’t mind him skipping that particular tradition. So since Hermione knew he’d be home alone that evening, she’d invited him to Floo over and visit her for a bit of a catch up.</p>\n<p>Over a simple pasta dinner they caught up on each other’s lives, and carefully pried into the other’s love life with the best tactfulness a couple of Gryffindors could manage.</p>\n<p>Harry carefully ascertained that Draco was treating her right, and nagged her into taking a love potion antidote in front of him… just in case. He apologised afterwards when she still insisted she was happy with Draco.</p>\n<p>“I just… had to be sure.”</p>\n<p>She patted his hand. “I understand. I did <em>tell</em> you I’ve been taking them occasionally already.”</p>\n<p>He hung his head. “I know, you said that before, but… what if they weren’t real antidotes? What if he’d swapped them out for fakes? I was just nervous.”</p>\n<p>“It’s alright, I get it. But I really <em>do</em> want to date Draco. He can be a snarky git, but he’s also amusing, and charming, and gives great presents,” she said, waving with a smile at the vase full of only slightly wilted orchids still on her desk. “He’s serious about liking Muggle opera too, you know. You should have seen him there! It was like a revelation for him that Muggles actually aren’t all uncultured barbarians.”</p>\n<p>“So long as he’s treating you well, and you’re genuinely happy. It just seemed so fast, after leaving Ron. Are you sure he’s serious? I’d hate to see you hurt again.” Harry looked so worried for her, it warmed her heart.</p>\n<p>“I don’t know how serious it is. It was a rebound relationship, after all. I admit it. If it goes somewhere, great. If not, well, it’s been a lot of fun while it lasted. I admit I talk it up for the paper a bit, but we really are doing well. It’s fun.”</p>\n<p>“I just want to see you happy.”</p>\n<p>“I am, I am happy. Happier than I have been in a long while, I think. He values me for who I am, not who he wants to shape me into,” she said, and as she spoke she realised how true it was. “Ron was never like that. He liked me <em>despite</em> the kind of person I am. Draco’s the opposite – he accepts me. The most he’s seemed inclined to do is nag me into wearing fancier clothes, and I can live with that. You should see the dress robes I’ve got for your wedding – they’re gorgeous!”</p>\n<p>Harry smiled. “I’m glad. I hope it works out then. And I haven’t seen the robes yet – keep them a surprise – but I read a description of your outfit already! Your dressmaker was in an article in <em>Witch Weekly</em> this week.”</p>\n<p>“Yes, I know,” Hermione said smugly.</p>\n<p>“I noticed you weren’t quoted saying anything about his father.”</p>\n<p>“Well, Lucius is an enormous racist prat who would’ve been delighted if the Dark Lord won. But he’s trying to change. It’s all one can hope for, really. Rehabilitation minus the prison is working well in his case. As well as can be realistically expected, anyway.”</p>\n<p>“Well, he’s supporting his son dating a ‘Mudblood’! That’s a big change,” said Harry.</p>\n<p>“You’re not the first to remark on it,” said Hermione. Her turn to quiz <em>him</em> now, she decided. “Harry?”</p>\n<p>“Yes?”</p>\n<p>“Can I ask you something?”</p>\n<p>He sighed, and answered the question that she hadn’t asked yet but he guessed she wanted to. “I’m still marrying Ginny. I want a family, Hermione.”</p>\n<p>“Yes, I figured that. I just wanted to know how you are feeling about it all. Are you angry with her?”</p>\n<p>Harry propped an elbow on the table (<em>Narcissa would be appalled</em>, thought Hermione) and leant his chin in his hand. “Yes and no. It changes from day to day. Do you want to know who I’m really angry with? My father.”</p>\n<p>“Really?”</p>\n<p>“Yes. I’m furiously angry with him. How dare he trick my mother into dating him? And entrap her into marriage and <em>still</em> keep dosing her… he enslaved her. Like you were enslaved. And now here I am, a child of a potion-laced liaison. Unable to love like everyone says a man should be able to love. Everyone except Snape used to talk about my dad like he was a great hero. Meanwhile these days I sometimes feel like applauding Voldemort for killing him and setting my mother free, however briefly.”</p>\n<p>“Oh Harry!” she said, tears in her eyes.</p>\n<p>“You mustn’t tell anyone.”</p>\n<p>“Of course I won’t.” She pushed back her chair, and walked around his side of the tiny table, pulling him into a hug. “I’m so sorry.”</p>\n<p>“What hurts so much is that I’ll never know for sure what happened. Everyone I could ask who’d know the truth is dead now – all dad’s friends are gone too. What if he stopped the potion after the wedding, and she threatened to leave, but he drugged her again? I want to know, but I don’t know if I could bear knowing the truth. I’ve been thinking about looking for the Resurrection Stone, just so I can ask. Is that wrong, do you think?”</p>\n<p>“Whatever you want to do, I’ll support you, Harry,” she vowed with fierce determination.</p>\n<p>And it was at that moment, while she was holding Harry in her arms and staring into his eyes, that the Floo flared a bright green as Draco Malfoy ducked through the fireplace into her flat, carrying a picnic basket.</p>\n<p>“Hermione? How are you… doing…” Draco said, trailing off as he saw her embracing Harry as he sat at her table, the remains of a candlelit dinner for two in front of them.</p>\n<p>“Draco? What are you doing here?” she said, letting Harry go.</p>\n<p>“I <em>heard</em> you were sick,” he said accusingly. “Confined to bed you were so ill with fever. I brought you some soup and potions. But here you are having a<em> private dinner with Harry Potter</em>.” He glared angrily at Harry, who grinned to see him so jealous.</p>\n<p>“Is there something I should know here, Hermione?” Draco asked her bitterly. “Some <em>minor</em> detail you’ve neglected to tell me? Perhaps there’s <em>another</em> reason you’re upset that Harry is marrying Ginny? Am I really just a tool to make <em>him</em> jealous and ready to commit to you?”</p>\n<p>“No! No, Draco. We’re just friends, honestly!”</p>\n<p>“It doesn’t <em>look</em> like it, meeting him secretly like this while his fiancée is away celebrating their upcoming nuptials,” he accused.</p>\n<p>“I’m <em>not</em> in love with Harry,” she stated firmly. “We’re just friends.”</p>\n<p>“And he’s not in love with you?” Draco asked suspiciously. “There’s no elopement being planned?”</p>\n<p>“Oh, I do love her, and she wants me to run away with her and forget all about Ginny,” Harry said with a teasing smile.</p>\n<p>“Harry! You’re <em>not</em> helping and it’s <em>not</em> funny!” she yelled, jaw gaping with disbelief.</p>\n<p>Draco scowled at the two of them.</p>\n<p>Harry relented. “I care for her like a sister, Draco. That’s all. We’re just friends. I was just teasing you – I wanted to see if you were serious about her. It’s good to see you are.”</p>\n<p>Draco eyed him warily. “So you don’t want to date her, marry her? You’ll say that to her face?”</p>\n<p>“Perhaps I’d marry her if I wasn’t marrying Ginny, if she’d have me. She’s my best friend. It might be nice. But she deserves better than me. You’re definitely the better man for her.”</p>\n<p>Draco’s eyes widened in surprise. “I’m… the better man?”</p>\n<p>Harry nodded decisively. “Yes. You make her happy. Happier than I could. Certainly much happier than she was with Ron. Look at you, bringing her soup, sending her flowers, taking her out on dates and introducing her to your family! She blushes and smiles when she talks about you-”</p>\n<p>“-I don’t blush!”</p>\n<p>“-And I think that’s fantastic. She deserves happiness. She deserves love. And I wouldn’t ever stand in the way of the dawn of true love, no matter who it’s with.”</p>\n<p>“Really? You don’t object to us being together?” Draco asked.</p>\n<p>“Not at all. I congratulate you on your good sense in choosing her.”</p>\n<p>Draco’s eyes were narrowed as he strode over to Hermione and pulled her into his arms, and dipped her for a kiss. She melted into it instantly – he really was an exceptional kisser.</p>\n<p>When they straightened up she found Draco was watching Harry’s reaction, not hers.</p>\n<p>“See? Nothing. I don’t mind you’re with her I swear,” said Harry, with a slightly sad smile. “I wish you two nothing but the best, Draco. Hermione and I are nothing but two old friends enjoying a private dinner.”</p>\n<p>“And the hug?” he asked, still holding Hermione tightly around the waist.</p>\n<p>“Just a friendly reassuring hug. We were discussing something upsetting. And the topic is none of your business,” Harry said firmly.</p>\n<p>“If you kiss me again while watching someone else, male or female, I will <em>slap</em> you Draco Malfoy,” Hermione warned. “Slap if you’re lucky. Punch if you’re not, and you know I have a mean right hook.”</p>\n<p>He looked into her eyes. “I’m sorry,” he said shamefacedly. “I was just… concerned.”</p>\n<p>“You were <em>jealous</em>. But there’s nothing to be jealous of,” she promised. “I won’t date anyone else while I’m dating you, I swear. And I certainly hope you’re doing the same.”</p>\n<p>“Of course not! I told you…” he trailed off, glancing at Harry.</p>\n<p>“Well, I think that’s my cue to leave,” Harry said diplomatically. “Draco, a quiet word before I go?”</p>\n<p>Harry led him over to a corner of the tiny apartment, and whispered something in his ear that made Draco go white, before Harry gave Hermione a wink and Apparated away.</p>\n<p>“What did he say?” she asked curiously.</p>\n<p>“Partly congratulations on being the man to win your heart fair and square, and partly a threat for if I hurt you in any way. He said he’d heard of my interest in opera and told me I’d have a fine future singing castrato if I hurt you, and that every Auror on the force would swear for him that he’d acted in self-defence,” Draco said nervously. “You know, when we break up, I think you’re going to have to make sure I don’t look like the bad guy.”</p>\n<p>“Oh, I thought you could just cheat on me with Astoria. Done.”</p>\n<p>“Nooo… no, no, no,” he objected, waving his hands in the air in frantic denial. “Not after what Potter just said. I know what <em>castrato</em> means, Hermione! I researched opera! No, it’ll have to be you falling for someone else, or the two of us deciding amicably that things aren’t working out, or that you want to focus on your career. Something like that.”</p>\n<p>“Alright, we’ll decide the details later – something that won’t get Harry mad at you,” she promised. She didn’t really like to think about it. Enacting step ten in her plan was a problem for later.</p>\n<p>“So, I guess you’re not really sick, then?”</p>\n<p>“Not at all. It was just an excuse to get out of Ginny’s hens night.”</p>\n<p>Draco stalked towards her, a gleam in his eye. “All alone then. No-one else expected to visit, I hope? My parents won’t expect me home for another hour, here to fuss over an invalid.”</p>\n<p>“No, no-one else should be visiting,” she said a little nervously. “Did you want to… spend some time together?”</p>\n<p>“Did you?”</p>\n<p>“I suppose,” she said uncertainly. “If you want to?”</p>\n<p>“Let me show you how much I want to,” he purred, and led her willingly to her bed. “I want to find out how loud you can get.”</p>\n<p>“Ah, just in case we get carried away,” she said nervously, “I want you to know that I’m on the pill.”</p>\n<p>“The what?”</p>\n<p>“It’s a Muggle medicine that prevents pregnancy. A tiny tablet I take every day. Ron favoured charms, but I switched after I left him. I like the reliability of predicting my periods,” she babbled. She didn’t want to say, <em>I was thinking about sleeping with you</em>.<em> I’ve been thinking about it for some time now.</em></p>\n<p>“How reliable is this Muggle pill?” he asked with a frown.</p>\n<p>“Ninety-nine percent effective. Only one woman in a hundred using this method for a year will fall pregnant. It’s not completely reliable, but very close to perfect – it’s one of the best non-permanent options available. I don’t mind if you want to use a charm as well. If it comes to that. Not that it will, right?”</p>\n<p>He nodded. “Right. Well, <em>should</em> we get carried away a quick spell is still a good idea, but this method sounds more reliable anyway.”</p>\n<p>“What?”</p>\n<p>“Well, about one in four women will get pregnant in a year even with spells. Of course, it depends on the competence and willpower of the caster, and if you’re sensible enough to cast it <em>before</em> the act or not. Afterwards it won’t do you as much good, of course.”</p>\n<p>“One in four!” she yelled, outraged. “Ron told me it was a sure thing!”</p>\n<p>Draco laughed, and Hermione turned on him furiously. “Don’t punish the messenger!” he said defensively, with a low chuckle. “I was just thinking that <em>that’s</em> why there’s so many Weasley spawn! His parents didn’t even know what they were doing!”</p>\n<p>“It’s not funny,” she said sulkily. “I could’ve ended up pregnant. Trapped.”</p>\n<p>Draco’s laughter died down, and he wrapped an arm around her shoulder, pulling her into a comforting hug. “I’m sorry. That would’ve been dreadful.”</p>\n<p>“I hate Ron just that little bit more now,” she said angrily. “And Dumbledore.”</p>\n<p>“Why him? You’re not saying…” he said with a look of wide-eyed revulsion.</p>\n<p>“Eww! No, don’t be disgusting! I meant as <em>Headmaster</em> he should’ve ensured the students received sex education. About how babies are made, puberty, contraception, that sort of thing.”</p>\n<p>Draco still looked appalled. “That’s just not proper! Such things are the responsibility of parents to handle with tact and discretion. The school shouldn’t presume to usurp that role.”</p>\n<p>“Oh, so my parents the <em>dentists</em> should have told me all about the efficacy and failure rates of the Barrenness Hex, and the Infertility Charm?”</p>\n<p>“Oh. Well, I suppose you have a point there. Perhaps a teacher or a senior student should have talked to the Muggle-borns.”</p>\n<p>“McGonagall? <em>Snape</em>? <em>You</em>, Mr. Prefect? Can you see yourself counselling young wizards and witches about sexual diseases?”</p>\n<p>Draco shuddered in an overly-dramatic fashion at all those suggestions. “Point. Well, perhaps Professor Sprout? She seemed an earthy, motherly type.”</p>\n<p>“Oh yes, I can just see her now, explaining how to go about properly sucking a man’s cock and the importance of preparation before having anal sex. Probably using a metaphor involving rosebuds.”</p>\n<p>Draco blinked very slowly. “You have scarred me mentally for life. I hope you know that,” he said dryly.</p>\n<p>Hermione giggled. “You started it!”</p>\n<p>“Well what <em>do</em> you think they should have done for you lot, then?”</p>\n<p>“Books.”</p>\n<p>“What a shock. Hermione Granger would’ve loved to have a book to read. Or possibly some very naughty parchments. With illustrations and technical diagrams of what goes where.”</p>\n<p>Hermione laughed and poked him in the ribs until he joined her in her laughter. They rolled around on her maroon bedsheets grappling for a while before he grabbed her hands to stop her tickling, pinning her beneath him.</p>\n<p>“Hermione,” he whispered, kissing her gently.</p>\n<p>“Yes, Draco?”</p>\n<p>“I’m going to ravish you now, if that’s alright with you.”</p>\n<p>“It’s a very polite kind of ravishing!”</p>\n<p>He grinned at her. “That’s the best kind.” Letting her hands go free, he ran a hand up her leg, under her robe, and she sighed with pleasure as his fingers ran over her inner thigh, evoking a shiver of pleasure.</p>\n<p>“Draco? You’re wearing too much.”</p>\n<p>He sat up on the bed, and pulled his robe off, leaving him wearing nothing but the odd-looking short button-up linen breeches that Ron had also favoured - the traditional wizarding equivalent of underwear.</p>\n<p>Draco looked at her a little anxiously as her eyes widened. She trailed a hand over his smooth, hairless chest, and traced the three large raised pink scars that ran diagonally across his chest. “Is it… I know it’s not pretty,” he said.</p>\n<p>“Voldemort?” she asked softly.</p>\n<p>“Harry, actually,” he said stiffly. “But admittedly I was trying to curse him at the time. Not my finest moment.”</p>\n<p>“Oh! The Sectumsempra? I thought that wasn’t supposed to scar.”</p>\n<p>“Maybe if I’d gone to St. Mungo’s it wouldn’t have. But I didn’t want any Aurors looking into the details of our fight too closely. Madam Pomfrey did what she could.”</p>\n<p>Hermione leant down and kissed his chest, and he let out a shuddering sigh. “I have my own scars,” she said, and summoning up her Gryffindor courage she swiftly took off her own robe to hold out her arms for him to see the patchwork of multiple pink and white lines criss-crossing her arms. “It’s why I prefer long sleeves most of the time. These are from your aunt.”</p>\n<p>With only a brief irresistible glance at her breasts in their lacy bra, he picked her arms up one by one and laid a few gentle kisses on each patch of scars.</p>\n<p>Hermione pointed to some more scars on her body. “This one on my side’s from the Whomping Willow in third year – it didn’t seem too bad a cut so I didn’t get it seen to in time to stop it scarring. There’s a few small scars from the final battle - cutting Curses, mostly. Oh, and the one on my left leg is from a shattered bit of sink that hit me in first year when the boys were fighting the troll.” Each mark got its own gentle kiss.</p>\n<p>“And this?” he said, tracing his fingers down a livid purple mark that ran from the underside of her right breast and down her chest to the left side of her stomach.</p>\n<p>“Antonin Dolohov. In the Department of Mysteries at the end of fifth year. It still aches whenever I get too overheated. Some kind of Dark flame curse, they said. This is the best the Healers could do. It’s stable.”</p>\n<p>“You’re lucky to be alive,” he said gravely. He turned his left arm out for her to see the Dark Mark branded there on the inside of his forearm.</p>\n<p>She looked at it curiously. “It’s faded. Sort of reddish-pink. I thought they were black?”</p>\n<p>“Black when <em>he</em> was active. Fading now he’s gone.”</p>\n<p>“I’m not going to kiss that one.”</p>\n<p>“I wouldn’t expect you to. Maybe kiss somewhere else?” he suggested optimistically, trying to lighten the mood with their slightly macabre session of show-and-tell all finished.</p>\n<p>She started with his mouth, then moved on to his neck, finding him just as responsive there as she was. He didn’t like her toying with his nipples though, and squirmed away uncomfortably at that.</p>\n<p>“Sorry, I always like it,” she said apologetically, and kissed her way down his belly instead.</p>\n<p>His fingers clenched in her hair, pushing her head softly downwards, and she mouthed at his penis through his breeches, lips soft on the outside of the fabric. He let out a guttural groan of pleasure.</p>\n<p>“Oh, yes <em>please</em>,” he moaned. “More, Hermione. Merlin, please more!”</p>\n<p>Her fingers toyed slowly with the buttons, and he impatiently took over and did the last one and pushed his breeches down and threw them on her floor carelessly.</p>\n<p><em>He’s so beautiful</em>, she thought, as her hands roamed all over his body as she settled down to lie next to him on the bed. She peeked curiously at his average-sized but very attractive cock – the foreskin had retracted almost the whole way back he was so hard, leaving the head of the penis exposed and leaking a bit of pre-come. The scars on his chest aside, his skin was creamy white and unmarred by so much as a single freckle – she’d seen enough of those to last a lifetime. His body was lean and lightly muscled. Ron had been starting to put on a little chub around the belly from too many pies and not enough exercise – he hadn’t kept up with Quidditch practice the way Draco still did, and he didn’t have the excuse of being a growing boy any longer.</p>\n<p>Determined not to think about her ex any longer, Hermione wrapped her hand around Draco’s cock and started sliding her hand slowly up and down.</p>\n<p>Draco meanwhile was kissing at her exposed cleavage, while his hands crept behind her back to fumble with her bra clasp, eventually setting her breasts free from their lacy prison. His mouth dove straight to one nipple, sucking it enthusiastically and causing her to squeeze his cock a little too tightly for a moment, before her rhythmic pumping resumed.</p>\n<p>He switched to the other nipple, leaving the first a hard peak, covered wetly in a thin sheen of saliva. His fingers toyed with the hard little nub while he suckled the other to excited firmness. His head rolled to the side, tugging the nipple with a sharp twinge that was more pleasure than pain, and his blue-grey eyes stared into her own.</p>\n<p>“<em>Draco Malfoy</em> is sucking on my nipple,” she said wonderingly, not entirely meaning to say it out loud. It was so strange – at school she would never have thought in a million years she would be doing such a thing with him.</p>\n<p>His lips, still latched onto her breast, curved up in a smile, the corners of his eyes crinkling with amusement. His hand crept downwards, pushing underneath the elastic of her sensible black cotton underwear (she hated lace undies), and dove into the damp curls, hunting for her clitoris.</p>\n<p>“A little lower, ah! No, up! There, yes. But… it’s too dry…” she said pleadingly. His fingers ran across her moist entrance, making her shudder with pleasure, before returning to her clitoris and starting to massage it in gentle circles.</p>\n<p>“Faster… no, not that fast. A little harder… goooood,” she murmured. “Keep up the circling for now.”</p>\n<p>His mouth popped off her nipple and he grinned at her, “Bossy in bed as well as out of it, I see. Can’t you just lie back and enjoy it?”</p>\n<p>“I <em>am</em> enjoying it!” she protested. He laughed before he resumed his enthusiastic attentions to her breasts.</p>\n<p>While it took him a while to learn exactly the speed and style she demanded, eventually his persistent compliance (and occasional stubborn innovation) yielded results, and worked her to a fever pitch of excitement. Her hand fell away from his cock, as she just grabbed at the sheets and enjoyed the sensations.</p>\n<p>“Oh god Draco, use your mouth, please! I’m begging you!”</p>\n<p>“Well, since you’re begging,” he said, sounding wickedly pleased. When he moved down to lick and suck at her clitoris she orgasmed with a loud low scream of pleasure. He didn’t stop there, though, and she moaned and gasped as the aftershocks rippled through her body, and he pushed two fingers inside her wetly clenching cunt, feeling her vaginal walls squeezing around his fingers tightly as he thrust them in and out of her.</p>\n<p>Her hands were clenched in the bedsheets, his poor weeping cock long since forgotten.</p>\n<p>“That was magnificent,” she panted.</p>\n<p>“Why thank you my dear,” he purred, wiping off his mouth with the back of his hand as he lay down next to her again. “Now, perhaps it is my turn?”</p>\n<p>“Oh yes!” she said enthusiastically. “I believe you said something about grabbing my hair while I sucked you off?”</p>\n<p>“How good of you to remember,” he said playfully, and let out a deep hiss of pleasure as she knelt awkwardly over his legs, and sucked his hard cock deep into her warm, wet mouth.</p>\n<p>It didn’t take long until his hands were indeed making a dreadful mess of her hair while his back arched as he spilled his seed into her mouth, and she spluttered and choked a little as he thrust too hard in the throes of passion, sperm dribbling out from the corners of her mouth.</p>\n<p>He didn’t seem to mind though. And truth be told, neither did she.</p>\n<p>-000-</p>\n<p>“It seems odd,” mused Draco distractedly, lying in bed afterwards with her head resting his shoulder, one of her arms stretching across her bare stomach to gently stroke her hip and buttock, and his legs entwined messily with hers, “Potter, the noble, Muggle-loving hero, letting himself be caught with a love potion by that ginger-haired harpy. Has he no self-respect? Why doesn’t he leave her?”</p>\n<p>“Professor Snape often accused him of being arrogant. But it has always been very much the opposite. He’s always felt his life and happiness were so much less valuable than anyone else’s. It’s part of what makes him so brave and self-sacrificing – and yes, noble. But it’s not healthy,” sighed Hermione. “He knows staying with her will make Ginny happy, and all the rest of the Weasley family too. His own happiness comes a distant second to him compared to that, and I can’t talk him out of it. He cares about her… but not as much as she cares for him. He doesn’t believe he can do better, or deserves better. And he wants kids.” She didn’t tell Draco about Harry’s theory about his mother being dosed with love potions when he was conceived. That wasn’t her secret to tell, and certainly not to a Malfoy, no matter how pleasant a partner he was at the moment.</p>\n<p>“If I said I <em>also</em> believe he deserves better than the Weaselette, I hope you would understand that it merely stems from my great dislike of the whole Weasel clan and their scheming ways, not out of some sickening hero-worship for him personally.”</p>\n<p>“Don’t worry,” Hermione said dryly, “I won’t accidentally credit you with any noble impulses.”</p>\n<p>He laughed at her witticism, and she quietly delighted in being with someone with enough intelligence to get her sarcastic humour without needing an explanation or an apology. Ron had usually demanded both.</p>\n<p>“He’s not a Muggle-lover,” she said conversationally, as she stroked the fine, thin downy patch of hair on Draco’s chest, so pale it was almost invisible.</p>\n<p>“Who?”</p>\n<p>“Harry. You called him a Muggle-loving hero. But he’s not Dumbledore – though frankly I think that man’s reputation for being pro-Muggle rights was overstated too. Harry wants nothing to do with the Muggle world – he never has. Ever since he came to Hogwarts.”</p>\n<p>Draco was peering at her suspiciously, watching her face for tells that she was lying, looking like he was waiting for the punchline to a very strange joke. “Harry Potter, the Chosen One, the Man-Who-Conquered, sworn enemy of the Dark Lord and all blood purists – <em>doesn’t like Muggles</em>?”</p>\n<p>“Not really. He might not say so to the press of course, but the instant he could he cut ties to the Muggle world and never looked back. He fought Voldemort because he was a madman who killed his parents, wanted to kill him, and posed a significant threat to the wizarding world - especially non-pure-bloods,” she said, ticking the points off on raised fingers as she listed them. “Not because of Voldemort’s anti-Muggle isolationist agenda. Harry actually approved of that part, not that he really ever wanted to talk about it. Obviously he couldn’t be seen to agree with anything Voldemort said.”</p>\n<p>Draco thought about it for a moment, before accepting the new information and striving to find a way to sink it into his worldview so it wouldn’t disturb that placid pool of beliefs too much with any significant ripples. “Well of <em>course</em> he’d prefer the wizarding world,” said Draco eventually. “Who wouldn’t? I suppose the Dark Lord was a significant threat to all of us. Even those who nominally supported him like my family. We didn’t have much choice <em>not</em> to, you know. At the end. I wouldn’t-”</p>\n<p>“-I understand. Your family was at risk. We all can feel forced to do things we’d rather not, to protect them.”</p>\n<p>He rubbed at his forearm, at the faded brand of cowardice and forced servility there that he’d never be rid of as long as he lived. “Yes. You understand more than most, then. I knew you did, from what mother told us you said in defence of her. Most Gryffindors still keep insisting I should’ve stood up to Voldemort earlier – that death would’ve been better than servitude. Most Gryffindors are idiots, of course. You’ve always been an exception to that.”</p>\n<p>His roundabout compliment on her intelligence warmed her. She couldn’t remember Ron lying in bed with her complimenting her on anything except her body. It was a nice change.</p>\n<p>After a moment of quiet contemplation, lying together in quiet companionship as Draco traced lazy lines with his fingertips across the smooth skin on her bottom, she softly admitted, “I don’t know what to say to Harry to convince him to leave her.”</p>\n<p>“Are you… asking me for advice?” he asked, pale eyebrows arching in disbelief.</p>\n<p>“I suppose so. Who else <em>can</em> I ask? No-one’s supposed to know about it – I promised Harry. You’re just too sneaky a guesser. And all my ideas so far have failed – Harry’s just unpersuadable.”</p>\n<p>“It’s good you’ve decided to turn to someone of superior breeding for advice then,” he said with a sly smile, and laughed as she hit him gently with a pillow. “I wish I had an easy answer for you, but the truth is you can’t make someone make the smart choice. All you can do is be ready to help them when things go wrong. I’ll send you the details of my family’s lawyer – you should encourage him to sort out his will, and of course to draft the wedding contract carefully so she won’t get much if or when he leaves her. If she’s only in it for the money that might scare her off.”</p>\n<p>“I can do that, I guess. It might be worth a try. Yes, that’s a good idea,” she said, with a decisive nod. Maybe Ginny <em>was</em> only in it for the money. She <em>said</em> she loved him, but that could be a lie.</p>\n<p>“Aren’t you worried I’ll go running to Skeeter with an exclusive about the Chosen One’s emotional state and sad relationship? I could ruin him with this,” he said with a wicked gleam in his eye.</p>\n<p>“You won’t,” she said confidently. “Ginny might be ruined – and frankly if she was I’d delight in that – but while Harry would be furious he’d come out of it alright in the end, and you know your family’s position is still too tenuous to risk your reputation. Besides, Skeeter wouldn’t write it.”</p>\n<p>“I thought you’d either burst into a rather attractive ranting fury at my words, or perhaps insist I’m too kind-hearted to do such a thing. How fascinating you are, Hermione. A woman of surprising depth. And how can you be so sure they wouldn’t publish? Money talks, and I am amply supplied with that. It would barely be necessary with such juicy gossip in any case.”</p>\n<p>“Money talks, but not louder than blackmail,” Hermione grinned. “Skeeter still won’t write a word I disapprove of. She knows the price.”</p>\n<p>“You… have blackmail material on Skeeter,” Draco echoed with surprised delight. His eyes darkened as he rolled over and grabbed both her wrists, pushing her down to pin her on the bed.</p>\n<p>“You naughty, naughty little snake,” he purred, capturing her lips with a passionate kiss that took her breath away. “Oh, you Machiavellian minx. Such a goody two-shoes at school in the Golden Trio, and look at you now.”</p>\n<p>“I just <em>looked</em> like a goody two-shoes in school,” she said archly. “We only got in trouble for less than half the stuff we did.”</p>\n<p>Hermione visited Malfoy Manor to meet Draco so they could travel to the wedding together, and also to take advantage of his mother’s willingness to help her get her hair wrestled into submission into an artful and tidy chignon knot at the base of her neck. Narcissa had found some pearl-topped gold hairpins to help hold the decoratively arranged coils of hair in place, and a necklace set with golden sapphires to borrow that she said matched the butter-yellow robes beautifully, and was a Malfoy heirloom. As she was generally rather disinterested in the traditional feminine interests such as jewellery, she hadn’t known before that sapphires came in colours other than blue. Narcissa seemed to enjoy showing off the contents of her jewellery box to Hermione, given that she responded with occasional gasps of admiration, but didn’t show any signs of coveting her precious necklaces or rings, no matter how beautiful.</p>\n<p>She had a lot of make-up on her vanity table, Hermione noticed. “I must admit I thought maybe you’d do your make-up with charms,” she commented.</p>\n<p>Narcissa shook her head. “No, those are too easy for someone to covertly counter-charm,” she explained, sorting through another polished wooden box for a suitable matching bracelet to loan. “What did you get the happy couple as a wedding gift?”</p>\n<p>“I don’t know,” admitted Hermione. “I mean, I know my half. I got them a pair of tickets to ‘Cats’ from us, but Draco’s is buying a shared gift too, and he wouldn’t tell me what it was. Only that if he could find one, it would be very appropriate and he was confident Harry would appreciate it.”</p>\n<p>“Ah yes, the actors dressed up like singing, dancing Kneazles – Draco told us all about it after you explained it to him. It sounds rather strange to me, but he is very keen for us all to go together as a family, with yourself included as his date and our guide to the Muggle world. He’s still trying persistently to persuade Lucius, which is why we haven’t purchased tickets yet. I think we shouldn’t attend the same performance that the Potters will be going to, however. We don’t want to disturb the happy newlyweds, after all.”</p>\n<p>“You don’t mind an outing amongst Muggles?” Hermione asked hesitantly, holding out her wrists so Narcissa could latch a braided gold bracelet around one. Narcissa, without asking, also spritzed both her wrists with a fine mist of perfume that smelled like roses and musk.</p>\n<p>“Draco has vouched for the quality and safety of the experience, and reassured us that there is no necessity to socialise with any Muggles. And my dear,” she said with a serious look, “I don’t <em>hate</em> Muggles. I never did. I merely feel our worlds should remain as separate as possible – that we should stay away from them, and vice versa. However, I want my son happy – if seeing this ‘musical’ and ‘operas’ delights him, then I shall do my best to be accommodating.”</p>\n<p>With a wave of her wand she levitated Hermione’s delicately carved wooden chair around in a circle, so that Hermione could view her reflection in the vanity mirror. “Oh! I look beautiful!” she said, turning her head back and forth to admire her twisted chignon with the pearl hairpins helping the charms hold everything in place, and providing a touch of decorative elegance.</p>\n<p>Hermione brushed a hand gently against the gold necklace with its waterfall of yellow sapphires. “I shall take good care of your jewellery, Narcissa,” she promised.</p>\n<p>“Thank you, Hermione. I hope the wedding goes well. Do take good care of that which has been entrusted to you – I would hate to see anything damaged.”</p>\n<p>Hermione nodded seriously, and silently wondered if they were still talking about jewellery.</p>\n<p>-000-</p>\n<p>Harry and Ginny had planned a lovely autumn-themed wedding, at Ginny’s insistence. But the cool crisp weather she’d hoped for was more grey and sleet filled, and the outdoors location they’d initially selected had an abundance of mud rather than the carpet of sunset coloured oak leaves that Ginny had envisaged and expected. So they’d reluctantly relocated the wedding to a large hired hall, and Molly stood at the door to welcome the guests inside, and to charm the mud off their shoes and dry their clothes from the rain, if necessary.</p>\n<p>The wedding was dull, and irritating. Unconsciously expecting the relative brevity of Christian style weddings, Hermione thought the whole business had far too many rituals, and was interminably long. There was handfasting with silk cords, jumping over a broom, blessings over wine, and what seemed like a million speeches. But then, her impatient and cranky mood might perhaps be more justly attributed to the fact that Harry had refused again, with a patient smile, her whispered suggestion to Apparate away before it was too late.</p>\n<p>Or perhaps it could also be because Ron was there. Standing up the front next to Harry, where she <em>had</em> to keep looking at him as he tugged uncomfortably at the tight collar of his brand new white formal robe and avoided making eye contact with her. Lavender Brown was sitting in the front row on the bride’s side (Hermione and Draco had chosen the groom’s side), making doe eyes at her Won-Won, and occasionally smirking across the aisle at Hermione. Hermione thought grumpily that she didn’t seem to even be conscious of the fact that her cheap pink taffeta robes with sequins were <em>far outclassed</em> by Hermione’s yellow Acromantula silk robes with seed pearls and genuine gold embroidery.</p>\n<p>Draco leaned over close to whisper in her ear, “Want me to discreetly hex her? She could be spending the next hour trying to cope with an uncomfortable itch she mustn’t scratch in public.”</p>\n<p>Hermione turned to him with a smile and small shake of her head in the negative, and picked up his hand to give it a squeeze. “Thank you for coming.”</p>\n<p>“It is my pleasure to do so,” he said politely.</p>\n<p>“What was our present from you?” she whispered curiously. It was something small – the be-ribboned box he’d set on the table next to her envelope had been tiny. “Did you find the whatever-it-was?”</p>\n<p>“A toadstone ring,” he said with a proud smirk. “To detect any magical poisons or potions contaminating your food or drink.”</p>\n<p>“Wonderful idea,” Hermione said quietly, and he put his arm around her shoulders to pull her snugly into cuddling at his side. His dark brown dress robes were very soft and warm – Narcissa had told her that they were made from angora wool.</p>\n<p>“They used to be a traditional gift to wealthy heirs on reaching their majority,” Draco said quietly. “It seemed appropriate, but I wasn’t sure if I could find a genuine one for sale, at first. The gem is of course a very ugly brown cabochon, but its utility makes up for a lot. It will heat up or change colour to orange if held near any potions.”</p>\n<p>They hushed as the ceremony started. Ginny was beaming radiantly with happiness, and Hermione hated her for it. She plastered on a smile for Harry’s sake. At least he looked happy too. She dearly hoped it wasn’t an act.</p>\n<p>Eventually the horrible business of Harry vowing to love Ginny forever was over, to the applause of many and the disappointment of only a few. Molly cried noisy tears through the last half of it, but unfortunately Ginny didn’t look at all upset by her mother’s outburst, Hermione observed regretfully. She thought perhaps Bill’s applause was a little lacklustre, but it could’ve been her imagination.</p>\n<p>As they filed in and found their places at tables in the reception hall was crowded, Hermione couldn’t decide if she was relieved or disappointed that they weren’t at the same table as Ron and Lavender.</p>\n<p>“Too many Weasleys,” Draco muttered with a long-suffering sigh, as they headed for table two, where Bill, Fleur, and Charlie Weasley were sitting, along with Susan, Luna, and Luna’s new boyfriend Rolf Scamander.</p>\n<p>“Carl’s not here?” Hermione asked Susan, who’d been seated next to Charlie.</p>\n<p>“We broke up last week,” she said with a sad shrug. “Nothing major to report, it was just… different interests. And he never got my jokes. It wasn’t really working out.”</p>\n<p>“So it seems mum has seated you next to yet another eligible young lady, Charlie,” teased Bill.</p>\n<p>Charlie groaned with irritated frustration, and buried his face in his hands. Susan looked offended enough that Hermione took umbrage on her behalf. “There’s nothing at all wrong with Susan,” she said stiffly. “So I see no cause for complaint. You don’t have to date her, but you <em>should</em> be polite. If you know how to be.”</p>\n<p>“I’m not interested in dating a <em>Weasley</em> anyway,” huffed Susan indignantly.</p>\n<p>“Now you’ve done it,” said Bill, sounding amused. “Say sorry to the nice young ladies, Charlie.”</p>\n<p>Charlie raised his head and saw everyone at the table, except for Bill and Fleur, glaring at him crossly. “Oh dear. I’m sorry. I didn’t mean any offence, Miss Bones,” he said with excessive courtesy. “It’s simply that mum keeps trying to set me up with ‘nice young ladies’ and just won’t listen to me when I say I’m not interested, I will <em>never</em> be interested, and that I’m not going to get married and produce any grandkids for her to fuss over.”</p>\n<p>“We ‘ave zat last part covered for you now,” said Fleur with a proud smile, resting a hand meaningfully on the slight swell of her stomach. There was a chorus of delighted congratulations for the expectant couple.</p>\n<p>Susan forgave Charlie after such a polite apology, and they all chatted pleasantly enough over dinner. Apparently he’d been very busy dealing with an outbreak of Squabb’s Syndrome amongst the dragons. Bouts of sneezing were a very serious and dangerous problem for fire-breathing creatures.</p>\n<p>No-one mentioned Ron at all, or Hermione’s split from him, and perhaps that was for the best. She didn’t really want to drag <em>all</em> the Weasleys into their mess.</p>\n<p>While Draco was slow-dancing later on with Hermione, his hands roaming only <em>a smidgen</em> lower than society deemed acceptable, Ron seemed like he was going to approach them. But when he got close enough to hear that Draco was humming “Weasley is Our King” under his breath, he scowled and turned away.</p>\n<p>“Damn it,” muttered Hermione crossly. “You scared him off. I want my scene.”</p>\n<p>“Who would’ve guessed a lion would be so faint hearted? And now he’s gone to dance with Brown as if he wouldn’t rather do anything else. But he’s still watching you when you’re not looking,” Draco reported.</p>\n<p>“What do I do now? I don’t want to be <em>seen</em> to deliberately provoke him,” she asked plaintively. “Kiss me. Make it look good.”</p>\n<p>Draco thought for a moment as he spun her around the dancefloor, then pulled her in close for a passionate kiss as the song ended. His lips tasted faintly like apples, from the sorbet they’d had for dessert. “Go and gossip with a friend about what a fantastic lover I am,” he whispered to her. “Let him overhear. I think me being with you is scaring him off.”</p>\n<p>Hermione brushed a hand along his smooth shaved jawline, and kissed him again. “Thank you, my darling dragon,” she said, with a loving smile. Then in a swirl of robes she was off to find Susan.</p>\n<p>Susan mightn’t have been aware of her plans, but she was always happy to gossip, though it took a little time to lead the conversation around to Draco.</p>\n<p>“You’ll never guess what I found out about Charlie!” Susan hissed excitedly. “He has a boyfriend in Romania!”</p>\n<p>“Oh, really, he’s gay? Well why didn’t he just say so?” Hermione said, only mildly surprised. She’d wondered a bit if he might be gay after his too-firm pronouncement that he’d never marry. She’d worried a little that maybe he’d been affected by a love potion in utero as well, so it was reassuring to hear that his reluctance to consider Susan as a partner was just because he wasn’t attracted to women. And wasn’t actually single, obviously.</p>\n<p>“Admit such a thing as a pure-blood wizard? The disgrace, my dear!” Susan said, shocked. “You don’t simply discuss such things in public!”</p>\n<p>“But you’re telling <em>me</em> in public,” Hermione rebutted logically.</p>\n<p>Susan giggled. “Well yes… but very, very quietly.”</p>\n<p>“You want to hear some more gossip that probably shouldn’t be shared?” Hermione asked, with a naughty smile.</p>\n<p>“Oh yes please!”</p>\n<p>Hermione led her over to near the drinks table. Just behind a pillar Ron was talking with another guest. She turned her back to him, as if she hadn’t noticed him standing nearby.</p>\n<p>“You want to hear a secret about Draco?” she whispered, a little too loudly on purpose.</p>\n<p>“Tell me!”</p>\n<p>“He is… a <em>fantastic</em> lover,” Hermione said, grinning broadly. “I mean, without the potion’s influence Ron’s attentions were rather lacklustre. But Draco really knows his way around a woman’s body, if you know what I mean.”</p>\n<p>“You naughty thing!” laughed Susan loudly, and then leaned in to give her a tight hug.</p>\n<p>“Are you trying to make Ron jealous?” she whispered very quietly, breath soft on Hermione’s ear. “Because he’s right behind you.”</p>\n<p>“Yes,” Hermione murmured back softly.</p>\n<p>“Right,” Susan breathed quietly.</p>\n<p>“And how well-endowed is your new man?” she asked playfully as she drew back from the hug, evoking a shocked laugh from Hermione.</p>\n<p>“Seriously?!” she asked. “That’s what you want to ask me?”</p>\n<p>“I’m talking about his bank balance, obviously!” Susan said with a wink. “What were <em>you</em> thinking of?”</p>\n<p>Hermione giggled. “Well I’d have to say it’s ample. Very satisfyingly large… amount of money. Biggest vault I’ve ever seen, actually. Puts a certain other vault I’ve viewed to shame. Draco can really provide for <em>all</em> my needs, monetary and otherwise, with a vault like his.”</p>\n<p>Ron in fact had a slightly bigger cock than Draco did, but it wasn’t like they were ever going to whip them out to compare them, so she felt pretty secure in that lie never being found out by either of them.</p>\n<p>“You… bitch!” Ron’s voice was loud and angry.</p>\n<p>Hermione spun around in pretended shock. “Ron!”</p>\n<p>“You damned whore!” he shouted, face red with anger, spittle flying from his mouth. “I thought you were mad at me for you know… but it was the money, wasn’t it? All along! You just wanted a big cock and a big pile of Galleons, and I wasn’t enough for you!”</p>\n<p>People around them were hushing to listen to the unexpected show, and Lavender had gone over and was trying to tug him away. “Ron, let’s just go, forget about her,” she pleaded, but he shook her hand off his elbow without even looking at her.</p>\n<p>“How much does he pay you? Is it worth it? He’ll never marry a Mudblood whore like you – that’s all he thinks of you as, you know! He’ll cast you off and <em>you’ll have nothing</em>!” he said, spitting out the last words at Hermione with vicious emphasis.</p>\n<p>Draco walked over to stand at her left side (Susan was standing supportively on her right), and glared regally at Ron. “Is he bothering you, ‘Mione?”</p>\n<p>He was, actually. She’d wanted this – wanted him furiously angry. But it was also a little frightening to be the target of all that rage, and she was suddenly glad her gown had a pocket large enough to stow her wand in. She slipped her right hand in her pocket to hold it, for comfort. “He is, rather,” she said with a dismissive sniff and a superior air worthy of a pure-blood heiress.</p>\n<p>“I suggest you apologise for your insulting language to my girlfriend, Weasley,” Draco said in a mildy menacing tone.</p>\n<p>“She doesn’t care about you! She’s just using you to make <em>me</em> jealous!” Ron yelled at him.</p>\n<p>Draco quirked an eyebrow. “Accusing me of your own sins there, aren’t you Weasley?” he drawled, with a meaningful glance at Lavender’s upset face where she stood a step behind Ron, still ignored. “She loves me. ‘Mione chose me freely. Whereas you… <em>your</em> only attraction came from a bottle.”</p>\n<p>“Shut up!” Ron yelled.</p>\n<p>“He’s a rapist,” Hermione said to Lavender, looking straight into her eyes, trying to communicate the seriousness of the situation to her. “If you tire of him, he’ll drug you into staying. Is that a risk you want to take?”</p>\n<p>“Don’t you say that! You’re ruining my daughter’s wedding,” sobbed Molly.</p>\n<p>“I could have,” Hermione said testily, glancing at Ginny’s white face as she clung tightly to Harry’s hand. He was just standing there looking solemn and sad. “But I didn’t. Your idiotic youngest son is giving his best shot at ruining the reception, though.”</p>\n<p>“She chose me, Weasley, the better man. And you’ve <em>lost her forever</em>,” Draco said tauntingly, then reached out to hold Hermione’s hand, lifting it up to plant a kiss on it while smirking at Ron. Hermione decided to forego her promised retribution for Draco kissing her while looking at someone else. It was a fine taunt, after all. And it worked much more effectively on Ron than it had on Harry.</p>\n<p>With an angry wordless yell Ron drew his wand, and then shot a spell at Draco with a crackling streak of red light. “<em>Calvorio</em>!”</p>\n<p>Hermione whipped her wand out quickly and waved it in a tight circle. “<em>Protego</em>!” she incanted, and a shimmering shield of gold sparkles reflected the crimson beam of light straight back at Ron, hitting him squarely.</p>\n<p>Ron let out a short cry of frustration as his shaggy red hair slid over his face obscuring his vision. But it wasn’t growing… it was falling out. He reached up a hand to brush his hair out of his eyes, and it scattered all over his robes, and with every tiny movement of his head it fell to the ground like a soft fuzzy rain, leaving him in seconds with a smooth and shiny bare freckled scalp.</p>\n<p>“Stop fighting, Ron!” warned Harry loudly, looking over sadly at his oldest friend. “Not one more spell, I’m warning you. Let her go free. You owe her that much, at least. Don’t do this.”</p>\n<p>Draco tugged his right hand free of Hermione’s, and drew his own wand. Ron looked ready to continue the fight, but Bill had moved in to stand in between them and Ron, while Charlie and Arthur moved in to grab a hold of him. They started frog-marching him out of the hall, despite the soft shower of rain outside. Ron’s dad was keeping up a constant soothing line of patter about how he should calm down, and everything would be okay.</p>\n<p>“Ginny doesn’t need this at her wedding, Ron, and neither does Harry,” Charlie said firmly but calmly. “She’s moved on, Ron. You need to as well.”</p>\n<p> “She’ll come crawling back! When he throws her over, and you know he will!” Ron insisted, as his father sighed and pulled him outside, grip firm on his wand arm. “And she cost me my job, dad! My job!”</p>\n<p>Lavender looked forlornly after them, tears in her eyes. She walked up to Hermione, and Draco pointed his wand discreetly at her, just in case, hand down at his side with his wand mostly hidden by the folds of his dark brown robe.</p>\n<p>“I’m sorry,” she sniffed. “I thought… well. He said a lot of things I don’t think he meant, now. I just want you to know that I wish you and Malfoy every happiness. And… I think Ron and I are over for good.”</p>\n<p>Hermione hugged her and asked her if she wanted to talk about it, but Lavender pulled away quickly, plucking a hanky from the reticule at her waist to dab at her eyes carefully. “Thank you, but no. I don’t want to ruin my make-up.” She plastered on a brave smile. “Better to learn now, rather than later, that he doesn’t really care about me. I’m going to go find some wine, and someone to dance with.”</p>\n<p>-000-</p>\n<p>Harry and Ginny were away on their honeymoon, and Ron had been humiliated in public, and his life ruined, just like Hermione had wanted. She knew she should be thinking about how to break up with Draco convincingly, in a way that wouldn’t get him in trouble with her overprotective friends. But she was putting it off. In her ten step master plan, step seven had been planned to be a big media interview about how happy she was with Draco, compared to Ron, and step eight was going to be implying she was sleeping with Draco, and being seen Flooing to his house for the evening. But those steps weren’t really needed any more – she’d already gotten the reaction from Ron she’d craved and didn’t need to scale up her provocation any longer. Step nine was a public date with an argument, and then the final step was breaking up.</p>\n<p><em>It’s not that I don’t <strong>want</strong> to break up with Draco</em>, she told herself as convincingly as she could in the face of rising melancholy, <em>it’s just that I can’t think of a particularly good plan to execute yet. Obviously our relationship’s not going to last – there’s too much against it. His family wouldn’t accept me for starters, and he doesn’t like me <strong>that</strong> much. But he didn’t like my plan of him “cheating” on me with Astoria, and I haven’t thought of an alternative yet. Besides, I have all this mail to answer before I can devote time to planning</em>. <em>And my flat is a mess.</em></p>\n<p>There <em>was</em> a big pile of unanswered letters to attend to in her tiny little flat. Being prominently featured in the wizarding media for months had led to a lot of owls bringing her mail. Some letters she burned without reading them after detection spells found hexes or jinxes on the parchment. She’d learnt those detection spells back in fourth year after she’d been deluged with mail, sometimes hexed, accusing her of toying with both Harry and Victor’s affections. Others were safer to read, and she answered with brief messages of thanks for their support, or confirmation that yes, it <em>was</em> true that she’d been drugged by Ron, and/or was dating Draco.</p>\n<p>A few messages required more thoughtful responses, and those she’d set aside for a less busy time so she could respond properly. Victor Krum had written worriedly to check on her – the gossip finally having reached Bulgaria. He said he understood better now why she’d stopped writing to him, and hoped she was well. He had a new girlfriend, whom he mentioned as tactfully as possible, and he sent his best wishes for her relationship with Draco. He also promised to come to her aid against Ron – if she needed his help she had but to ask. She smiled at his offer – it wasn’t needed, but it was appreciated all the same.</p>\n<p>Three other messages brought grief and anger, rather than smiles. Two separate people – an Irish witch and an older German wizard – had written to share their shame and anger about being drugged with “love” potions into someone’s bed. A third young witch (Maria “Villanueva” from Spain) wrote sadly about how she’d been facing pressure from her family to marry the man who’d tricked her into his bed, and had been contemplating suicide.</p>\n<p>\n<em>“They tell me it was my fault for succumbing to his wiles, and I should have taken more care. And that now my reputation is ruined there is no choice for me but marriage. </em>\n</p>\n<p>\n<em>“However, your bravery in telling the world your story, sharing how it was his shame, not yours, is an inspiration to me. I have resolved to cast off my family and leave my home, and I’ve recently found a broom-maker in Andalucia willing to take me on as an Apprentice.”</em>\n</p>\n<p>Maria finished her letter with many effusive best wishes for Hermione’s happiness in life, whether it be with Draco or on her own, and a hope that one day love potions would be illegal all across the world, and the laws and punishments made so strict that no man would ever again dare to use one on a woman who’d spurned his unwanted attentions.</p>\n<p>It made Hermione stop and think. Admittedly laws about potion regulation weren’t the responsibility of her own Department at the Ministry, but… laws could be changed. She knew that. She worked on them all the time, for the betterment of magical creatures. But whose responsibility <em>were</em> the potion regulations? Someone should draft a bill about them to put before the Wizengamot. Perhaps that someone could be her.</p>\n<p>It was while her head was stuck in the Floo with green flames licking all around it as she gossiped with Susan about which Department looked after potion laws that there came a demanding knock on the door.</p>\n<p>“Susan, I have to go, I have a visitor,” she apologised.</p>\n<p>“If it’s Draco, don’t call me back,” teased Susan. “I’ll just assume you’re <em>busy</em>.”</p>\n<p>“Susan!”</p>\n<p>“Bye now!” Susan said in a rush, and cut off the connection at her end hastily.</p>\n<p>Hermione opened her front door with a smile. Draco did seem the most likely visitor, for Harry was still on his honeymoon in Greece.</p>\n<p>But it wasn’t Draco. It was a thin, young dark-haired woman wearing stylish green dress robes and a pointed hat with a couple of fluffy creamy white feathers tucked into one side of the hatband.</p>\n<p>“Can I help you?” Hermione asked politely.</p>\n<p>The woman frowned at her. “Don’t you <em>know</em> who I am?”</p>\n<p>“Uh…” Hermione hesitated, looking at her closely. A classmate she should recognise? It’d been a few years now, and everyone looked a little different. She’d almost walked past Katie Bell in Diagon Alley the other day, without recognising her at all. This lady did look a little familiar. Something about the thin cheekbones, and the look on her face as she sneered reminded her of… Daphne Greengrass. She knew her now. She’d seen her photo briefly in <em>Witch Weekly</em>, some months ago.</p>\n<p>“Astoria,” she said, hollowly.</p>\n<p>She nodded. “I think we need to talk, Miss Granger.”</p>\n<p>It was quite possibly the most uncomfortable conversation Hermione had ever faced, and drinking tea together wasn’t making it any better, though Astoria appeared to almost be making an effort to put her at ease with small talk, oddly enough.</p>\n<p>“This is very nice tea, Miss Granger. What blend is it?”</p>\n<p>“Lady Grey. It’s a Twinings brand loose leaf tea. It’s one of my favourites.”</p>\n<p>“It has an interesting flavour,” Astoria said politely, sipping delicately at the tea – black, with one sugar. Her words were polite, and she was smiling as she gazed around the tiny run-down flat, but it didn’t seem like a kind smile. More… triumphant. Hermione cringed on the inside as she imagined her sneering condemnation of her poky old apartment. She’d been meaning to find somewhere better. She <em>could</em> afford somewhere better. She’d simply not gotten around to it – she’d been in such a hurry when she left Ron that she’d grabbed the first accommodation that was remotely suitable.</p>\n<p>“There’s added bergamot and citrus. But you didn’t come here to discuss my choice of tea, Miss Greengrass.” Best to get it over with fast. Like ripping off a plaster.</p>\n<p>“I imagine you can guess why I’m here, now you’ve ascertained who I am.”</p>\n<p>“You want to talk about Draco,” Hermione said, attempting to assume a businesslike air.</p>\n<p>Astoria nodded. “Yes. So, if you want to get straight to business, you may simply tell me everything I wish to know.”</p>\n<p>Hermione hesitated. She was just supposed to <em>guess</em>?</p>\n<p>“Please, Miss Granger. Don’t I deserve to know exactly what’s going on?” Astoria’s eyes glimmered with sadness as she directed a pleading look at Hermione.</p>\n<p>“It’s just… it’s rather vague. You ah… of course you are aware we’ve been dating… pretending to date?”</p>\n<p>Astoria nodded. “Of course. Yet it has gone on much longer than I expected. And with more… verisimilitude. Exactly how much is acting? For I have been awaiting my beau’s return to my side, and yet still he is with you. Are you attempting to steal him from me forever, Miss Granger? Because we were in very promising contract negotiations, prior to your current arrangement with Draco.”</p>\n<p>“We haven’t… that is, there’s nothing that would potentially result in pregnancy,” Hermione said, very awkwardly, but with a desire to come clean. “Which I was told was your boundary you asked of him. We have… done other things, however. Made out a few times.” She drank her tea, for something to do. It was still a bit too hot, but she drank it anyway.</p>\n<p>Astoria looked irritated and pensive, but not inclined to throw her tea at the wall or draw her wand. Thank Merlin for small mercies. “That was not a boundary I expected would ever be reached. You have kissed him?”</p>\n<p>“Yes.”</p>\n<p>“Seen him unclothed?”</p>\n<p>“…Yes. And to save us both some embarrassment I’m afraid to say that unless your next question is ‘Have you had intercourse?’ the answer is probably going to be yes to that one too. Shouldn’t you be asking these things of Draco, though?”</p>\n<p>With an angry huff, Astoria drummed her fingers on the table. “I appreciate your candour, but not your attitude or your poaching, Miss Granger.”</p>\n<p>“I am willing to break up with him given a little time,” Hermione said stiffly. “If it’s too sudden people will be suspicious, and Harry would be extremely angry with Draco. It could go badly for him. But I’m not stopping him from returning to you, or attempting to ‘poach’ him. I do appreciate your patience and understanding.”</p>\n<p>Astoria nodded. The regal look she was trying to assume would suit her better in ten or twenty years’ time – it looked rather affected on a woman who was younger than Hermione, barely out of her teens.</p>\n<p>“You are concerned for Draco’s reputation,” Astoria stated, rather than asked.</p>\n<p>“Yes.”</p>\n<p>“Why?”</p>\n<p>Hermione paused to think, flummoxed. “Well, it just seems the right thing to do,” she said eventually. “He’s been very… helpful. Kind, and friendly. I appreciate his assistance.”</p>\n<p>Astoria raised an eyebrow, and placing an elbow on the table, rested her chin in one hand. “Has he now? How very <em>interesting</em>.”</p>\n<p>Hermione blushed.</p>\n<p>“And when is he planning on leaving you, exactly?”</p>\n<p>“Well, we haven’t really discussed it yet,” Hermione said hesitantly. “We’ll get around to it soon. He did mention a couple of days ago that his father said he was expecting to see him break up with me soon. But he didn’t want to do so right after we’d been to Harry’s wedding. Ron would gloat. But we don’t have a future together, obviously, and he’s not in love with me. We <em>are</em> separating.”</p>\n<p>“Are you now,” said Astoria sceptically. “And does he talk about me often?”</p>\n<p>“Uh, no. That would be rather awkward, naturally.”</p>\n<p>“He’s stopped writing to me,” Astoria said, accusingly. “I need to know if I’m wasting my time waiting for Draco, Miss Granger. I have another suitor interested in me. I am a rather <em>eligible</em> young witch, you know.”</p>\n<p>“I’m sure you are. Well, I wish you all the best with whomever you choose,” Hermione said politely.</p>\n<p>“And you’ll be happy if that man I choose is Draco?” Astoria asked, watching her rival closely. “You’re perfectly satisfied that your revenge on Mr Weasley is concluded, and you don’t care for the loss of Draco as your boyfriend?”</p>\n<p>“Oh, I’m quite happy!” Hermione insisted. Her smile was forced, rather than natural, as she spoke. “After all, revenge on Ron was all I wanted, and I’ve accomplished that now. Draco can… he can do what he wants. He doesn’t want me. Not… not to keep. I knew that from the start, of course. His family would never accept me as a serious match, and neither would he.”</p>\n<p>“His parents are rather severe and demanding, aren’t they?”</p>\n<p>“Oh, they’re not so bad when you get to know them I suppose. It’s nothing compared to what I feared at first. Lucius is strictly business, but Narcissa grows on you with time. She did my hair for the wedding, which was very kind of her. But of course she doesn’t expect Draco to marry me or anything. I know she disapproves of that possibility – she made it crystal clear right from the start.”</p>\n<p>“Of course,” Astoria said, sipping the last of her tea. “Well, it has been an enlightening conversation, Miss Granger. Thank you for your hospitality, but I think I shall be on my way now. I need to have a little chat with Draco.”</p>\n<p>Hermione nodded, and didn’t let the sigh locked inside her escape. <em>Well, it was fun while it lasted</em>, she thought sadly.</p>\n<p>-000-</p>\n<p>Draco got in touch with her over the Floo the next evening to discuss Astoria’s visit with him, and its consequences.</p>\n<p>“She is expecting us to separate soon,” he said hesitantly, “I assume that’s what you’d prefer?”</p>\n<p>“It seems the most sensible course of action,” Hermione said practically. She’d braced herself for the conversation, and had roughed out a plan. She always felt better, steadier, with a couple of hours’ research and a plan under her belt. She pulled out her notes, while Draco’s head watched her from the fireplace’s flickering green flames. “I was thinking we could break up in a couple of weeks’ time. That will give us time to have another amicable public date, so it doesn’t look like you dumped me right after we declared our affection for each other at the wedding, and will also let us attend ‘Cats’ together with your family, if they still want to go. We can also then proceed to step nine of my original plan, and stage a public argument.”</p>\n<p>Draco nodded gravely. “That seems sensible. But I’d prefer to make it six weeks, because I bought us two tickets to <em>La Traviata</em>, and I’d like to have your company for that. It would be a shame to waste the ticket.”</p>\n<p>“You could take your mother instead?” Hermione suggested.</p>\n<p>He shook his head, and the green flames danced around his face. “No, I’d be too nervous out in the Muggle world without a guide, at this stage. Perhaps after I’ve done it another time or two it wouldn’t be so bad.”</p>\n<p>“Alright then, a month and a half it is.”</p>\n<p>“And we’ll stage our first argument after that,” Draco said. “Did you decide on a preferred reason for us to break up?”</p>\n<p>“Well, I have a few ideas, but I expect you still don’t want it to be because you’re in love with Astoria?”</p>\n<p>“No, that won’t do. I don’t want a reputation as being fickle, or cruelly spurning a heroine of the war. And objecting to Muggle things won’t do either – we’ve worked hard as a family to reform our image and I won’t have those efforts tarnished.”</p>\n<p>“Well then, I thought perhaps I could have insisted that I don’t ever want to have children, and you and your family objected to that, as it would mean no Malfoy heir. That I’d rather focus on my career.”</p>\n<p>Draco blinked, and looked rather startled. “You don’t want to have children? Ever?”</p>\n<p>“Well, it’s a good story. It doesn’t need to be totally true,” she said with a casual shrug.</p>\n<p>“So you <em>do</em> want children?” he asked persistently.</p>\n<p>“Maybe in five or ten years. With the right man. I wouldn’t hypothetically be averse to it, but only once my career was more established. I wouldn’t want one <em>now</em>.”</p>\n<p>“Ah, I see. Well, that certainly sounds like a very adequate reason to break up, that won’t tarnish either of our reputations unduly. For I would certainly expect at least one child of a prospective bride, somewhere along the line. And after all, if you later decide you <em>do</em> want children, you can always just tell the press that I wasn’t the right man, but now you’ve found someone new and special, it’s the right time for children after all.”</p>\n<p>“Hypothetically. But I’m in no rush. I doubt there’s a ‘right man’ who would change my mind about giving up my career to change diapers for a living. Or even for six months.”</p>\n<p>Draco nodded. “I think a dinner party would be suitable to set the scene for our argument. I can invite a few friends, and you can invite Harry and Susan. Leave it with me to plan, if you will. For six or seven weeks’ time, after the opera.”</p>\n<p>And so it was settled. As Draco disappeared from the fireplace, and the green fire changed colour and died down to a gentle orange crackling lick of tiny flames over the charred logs, Hermione admitted to herself that she would be very sorry to see their relationship end. She wished… wished it didn’t have to. At least she had six more weeks to enjoy with him. It was more than she’d expected.</p>\n<p>-000-</p>\n<p>Draco took her on a picnic, the next week. They talked about her career in the Ministry, and his own quiet ambitions to advance his family’s business interests.</p>\n<p>“I always used to dream of running for Minister one day, but well, that’s not going to be an option any more. Our reputation is improving, but I doubt it’ll ever improve to the point that I’d win an election,” he admitted with a sigh. “I think I enjoy business more anyway. There’s less pandering to idiots than the Minister has to put up with. We’ve got investments in farming magical plants, wool, some vineyards, three retail businesses, and we’re funding a very promising new enchanter of magical furniture.”</p>\n<p>“Pandering to idiots is an essential and unavoidable part of a career in the Ministry, I’m afraid,” Hermione agreed. “I know Kingsley finds it very frustrating at times. It can be very slow getting legislation through the Wizengamot – <em>that</em> I have personal experience with. I’m not always the best at networking in person, so I mostly stick to writing persuasive letters. And I’m constantly re-writing my drafts to be shorter, ever since Kingsley dropped a six foot carefully researched missive I’d written him straight into my office bin - right in front of me! He warned me that he didn’t have the time to read that much, and there were no extra House points or marks given for essay length now I was out of Hogwarts. He said he wasn’t alone in throwing anything too long straight in the bin, or leaving it unread or pushed aside to languish for weeks or months, and it was time for me to learn how to be <em>succinct</em>.”</p>\n<p>Draco laughed at her, and Hermione smiled ruefully.</p>\n<p>“And how long are your letters now?” he asked with amusement in his voice.</p>\n<p>“I stick to two feet or less. It’s a personal challenge – I try and write the best letters and reports I can within that length.”</p>\n<p>“Tiny writing?” he teased.</p>\n<p>“No!” she laughed. “That would be cheating!”</p>\n<p>They finished off their meal of roast quail, soft cheeses, and fresh figs, and packed the leftovers back into the basket. She sat behind him on his broomstick, clutching tightly at his waist as they flew back to the manor.</p>\n<p>“I can’t believe you hate flying!” Draco called over his shoulder. “Your friends were all Quidditch mad!”</p>\n<p>“Will you please watch where you’re going?” she squeaked unhappily, holding tighter.</p>\n<p>While Draco was putting away the basket and broom, Narcissa stopped by to greet Hermione.</p>\n<p>“Hello Hermione, how are you?” she asked courteously. “The weather held for your picnic?”</p>\n<p>“Yes, it was cloudy and cool, but not unpleasant,” Hermione said. “No rain, luckily.”</p>\n<p>“Would you care to join me for a cup of tea?”</p>\n<p>Hermione blinked, startled. “Well, I was just about to head home. I know it’s the weekend, but I have some draft proposals to work on…”</p>\n<p>“Your work will still be there later, but I have so <em>few</em> visitors,” Narcissa said, looking sad and wistful. “It’s a shame you have to go.”</p>\n<p>Hermione folded faster than a poker player with nothing but a ten high. “Oh, of course I would <em>love</em> to stay for tea with you if I’m not intruding. I just didn’t want to be a bother,” she said sympathetically.</p>\n<p>Narcissa led her away to a sunny little parlour, and her brief look of triumph went unnoticed by Hermione.</p>\n<p>She served the tea and a little plate of wafer-thin crisp cinnamon biscuits, and Hermione wondered if Draco knew she was still here, or would assume she’d headed home like she’d announced she would be doing.</p>\n<p>“So tell me more about <em>you</em>, Hermione,” Narcissa said conversationally. “I’m curious about your family.”</p>\n<p>“Well, my parents are both dentists – Muggle Healers who specialise in teeth. They live in Australia now.”</p>\n<p>“And do you see them often?” she asked politely.</p>\n<p>“No, not very. We’re in touch, but it’s a little awkward. I… I cast some memory charms on them during the war. To help keep them safe, and so they couldn’t be interrogated.”</p>\n<p>Narcissa frowned. “But how would that have helped? Surely sending them abroad was sufficient?”</p>\n<p>Hermione sighed. “I panicked. I was young, and I panicked. I thought that if they knew nothing about me, or about the magical world, that everyone would leave them alone. And they’d stop insisting I leave Harry to fight the war on his own. They wanted me to settle down in hiding in the Muggle world and forget all about the magical world. They were scared for me, while I was scared for them. I tried to undo the spells after the war, but it was harder than I expected. They still don’t have their full memories back, and they were… so angry with me for quite a while. After I realised I’d made a mistake, and apologised sincerely, things started getting better. We chat on the phone every few weeks, now.”</p>\n<p>“It’s not a child’s place to protect their parents,” Narcissa said rebukingly.</p>\n<p>Hermione raised an eyebrow. “Perhaps not. I wasn’t the only child in the war who did their best to do so, however.”</p>\n<p>Narcissa glanced uncomfortably away to one side. “Well, Draco had little choice by the end there. We protected him as best we could for as long as we could. Shall we change the topic, my dear?”</p>\n<p>“By all means.”</p>\n<p>They chatted for a good long while over tea, about Hermione’s siblings and cousins (that part was fast, because she had none), her ambitions in the Ministry, and what her parent’s home and business in Australia were like.</p>\n<p>“And do you have any magical relatives? The Dagworth-Grangers, perhaps?” Narcissa asked with studied casualness.</p>\n<p>Hermione levelled a frown at her. “Professor Slughorn mentioned them once. But no. No other witches or wizards in my family. Not my parents, and not my grandparents. If there are any magical relatives, they’re no earlier than my great-grandparents’ generation, and they stayed quiet about it. I’m Muggle-born, through and through.”</p>\n<p>“I’m sorry dear, I didn’t mean to make you uncomfortable,” Narcissa said apologetically. “It was just idle curiosity. Shall we have a little chat about some of my relatives instead? Those acceptable to talk about in a friendly conversation, of course. I understand Mr Potter is godfather to my great-nephew, I think they called him Teddy, or is it Theodore?”</p>\n<p>“It’s ‘Edward’, officially. But everyone calls him Teddy, and he’s not old enough to raise any objection to it yet! He’s a little sweetheart,” Hermione said with a fond smile.</p>\n<p>They chatted for a while about Teddy and his Metamorphmagus powers that he’d inherited from his mother (not seen in the Black line for generations before her) and the range of Tonks’ abilities when she’d been alive and how they compared to Teddy’s, and they parted cordially with Hermione promising to relay an olive branch of well wishes from Narcissa to Andromeda the next time they saw each other.</p>\n<p>-000-</p>\n<p>“Magical Mr Mistoffelees,” Lucius sang quietly and softly to himself in an absent-minded fashion, with his arm around his wife’s waist as they waited with Draco and Hermione for their taxi to arrive at the theatre. Draco had gotten careful instructions from Hermione on how to use a phone and a phone book, to book one for them himself as part of his personal quest to become familiar enough with the Muggle world to safely navigate his way to and from the theatres and opera houses.</p>\n<p>“He’s much less grumpy than he was when he arrived,” whispered Hermione with amusement to Draco. “He reminds me of someone, but I <em>can’t quite think who</em>.”</p>\n<p>Draco laughed as she whispered in his ear, and Narcissa glanced over at the two of them with a smile.</p>\n<p>“Not so bad, was it father?” Draco said with a grin.</p>\n<p>“Adequate, I suppose,” his father grudgingly agreed. But he was smiling too.</p>\n<p>Their taxi for the return journey to Diagon Alley when it arrived turned out to be a limousine.</p>\n<p>“My idea,” said Draco smugly. “It’s like a taxi, but much better quality.”</p>\n<p>“Much better than that poky little carriage we took on the way here,” Lucius said with an approving nod, climbing inside cautiously when the driver opened the door for them. “Ah! Dear, there’s champagne in here!”</p>\n<p>They all piled in to sit very comfortably on the plump leather seats, and Hermione seized the opportunity provided by the privacy of the driver being well separated from them to chat with Lucius about her upcoming bill.</p>\n<p>“So, Lucius, I wondered if you had a chance to consider supporting the bill going before the Wizengamot about outlawing love potion use on Muggles and banning its sale and use by anyone underage?”</p>\n<p>Lucius sighed with exasperation. “I appreciate your personal difficulties, but such measures are common sense, and I don’t see they need to be written into legislation, of which we have too much already. Anyone intending to act so won’t be inclined to pay attention to the law in any case. And the wizarding laws are designed to protect and guide wizards and witches, so I see no necessity for protecting Muggles. Let their own laws suffice for them.”</p>\n<p>“Laws against thievery and murder are common sense too,” she argued, “yet we still outlaw them. And importantly, we put <em>penalties</em> in place for those who breach them. You wouldn’t use a love potion on a Muggle now, would you? And you wouldn’t want Draco or Narcissa doing so?”</p>\n<p>“Don’t be disgusting,” he said with a sneer. “No decent pure-blood would sully themselves so.”</p>\n<p>Draco looked at Hermione a little anxiously, but she remained calm, looking if anything rather smug.</p>\n<p>“Then there’s no harm in outlawing it, is there? You’ll get to be seen to be a liberated, open-minded man who has come to support Muggle rights, with no personal loss of freedom whatsoever. No impact on the wizarding world, except perhaps slightly less half-blood wizards and witches being born,” she wheedled persuasively.</p>\n<p>Lucius blinked. “Well, I suppose so. Excellent points, I must say.”</p>\n<p>“And you wouldn’t have liked to have seen Draco as a young man ensnared by a love potion during his time at Hogwarts now, would you? Ensnared by any Muggle-born with enough money to purchase Amortentia from the Weasleys owl order service? There were a few young girls – and perhaps a few young <em>men</em> – who would’ve been <em>delighted</em> to see him humiliated as he chased after them.”</p>\n<p>Lucius nodded slowly. “He didn’t have his toadstone ring yet then… he wasn’t of age.”</p>\n<p>“And there’s so many opportunities to tamper with food at Hogwarts’ crowded tables. Don’t young pure-blood witches and wizards deserve protection from someone trying to sully the purity of their sacred family lines and entrap them into a marriage? Not all children have Draco’s caution and superior upbringing to be wary of what they eat and drink.”</p>\n<p>Lucius smirked at her as he said, “A little overdone, but an admirable line of argument all the same, Miss Granger.”</p>\n<p>“Well,” she said with an embarrassed shrug, “maybe it was a little too much. But the important thing is whether you’re now convinced or not.”</p>\n<p>“I am. I shall support your bill, and I shall speak with some other members of the Wizengamot to encourage them to do likewise.”</p>\n<p>Draco patted Hermione on the hand. “I don’t know why you think you’re not good at persuading people in person. I think you’re an excellent debater.”</p>\n<p>“Well thank you, Draco,” she said with a blush.</p>\n<p>“What I’m not sure of,” said Lucius, “is how this helps you personally. These laws wouldn’t have prevented Mr Weasley’s ah… influence of you.”</p>\n<p>She sighed. Perhaps not, but it might have saved Harry. “Well, it’s a start. It’s easier to add amendments to an existing law than to introduce a new one. I’m concerned if I push for too much too soon, it will be rejected totally at the outset. And changing society’s opinions takes time.”</p>\n<p>“Admirably practical. I shall look over your draft and see what amendments should be made to it now, that would still allow it to pass with majority support,” Lucius said imperiously. “Leave it with me.”</p>\n<p>“I would value your opinion on the matter,” she said politely.</p>\n<p>It was a pleasant drive back to Diagon Alley after that, as they chatted inconsequentially about the musical, especially the costumes and the lighting effects and how they were accomplished. Much more pleasant than the ride <em>there</em> had been, when Hermione had felt like Lucius was angry at being dragged along, and had seemed to be particularly irritated with her personally for some reason.</p>\n<p>-000-</p>\n<p>Draco toyed unhappily with the salad on his plate at the Crush Room at the Royal Opera House, poking suspiciously at the sliced radish. “It was supposed to be a romance. H- They said <em>La Traviata</em> was one of the greatest romantic operas of all time. It was <em>depressing</em>.”</p>\n<p>“The music is beautiful, and they do end up at the end. It <em>is</em> widely regarded as romantic.”</p>\n<p>“Confessing their love for a few brief moments while Violetta lies <em>dying of illness</em> can hardly be describing as ending up together. And they never even marry. And she was a <em>courtesan</em> and she left him for someone else before their eventual reconciliation,” Draco said with an unhappy scowl.</p>\n<p>“Only because his father disapproved of her, because she was besmirching his family’s reputation so much that his sister’s engagement was threatened. Not because she didn’t love him. She always loved him.”</p>\n<p>Draco dropped his knife and fork on his plate with a loud clatter, folding his arms sulkily. “Well I hated it. It wasn’t romantic at <em>all</em>. And he threw money at her at the party when he was angry with her like she was a… woman of negotiable virtue. Alfredo was an arse.”</p>\n<p>Hermione sighed. “It’s a <em>tragic</em> romance. It was doomed from the start.” She thought maybe he’d liked it, he’d seemed enraptured while listening to the opera. He’d obviously found it moving – she’d spotted him crying a couple of times at the most tragic and touching moments, surreptitiously wiping away a few escaping tears. “You liked the music, at least?”</p>\n<p>“It was beautiful,” he said grudgingly. “Did you enjoy it?”</p>\n<p>“I thought it was lovely. Thank you for inviting me. I’m sorry you found it sad, but I thought it was a wonderful last date.” Her upbeat response didn’t seem to do much for his sulky mood, however, and his scowls continued unabated.</p>\n<p>Their waiter stopped by with dessert, and placed in front of her a strawberry-topped pavlova that had been cut into a heart shape, instead of the fruit platter she’d been expecting.</p>\n<p>“This isn’t what I ordered,” she said with confusion to the waiter, who just smiled and jerked his head meaningfully in Draco’s direction. She glanced across the table at Draco and saw him holding a little velvet box open, to display the stunning emerald ring edged with diamonds nestled inside the box.</p>\n<p>“Hermione, would you do me the honour of becoming my wife?” he asked stiffly, with a very serious expression.</p>\n<p>“What? Are you serious?”</p>\n<p>The waiter politely left the bottle of champagne unopened and placed it in an ice bucket, and moved away from the uncomfortable scene. It wasn’t an enthusiastic “yes” from the young lady, and in his limited experience in such rare cases the not-so-happy-couple were best given privacy to talk things over.</p>\n<p>“Well it’s certainly not a joke, for Merlin’s sake!” he said testily. “Look at the ring! Um. That is… I love you. Please marry me.” An optimistic smile snuck onto his face, as she hesitated uncertainly, and reached out to take the ring box from him.</p>\n<p>“Really?” she said, still unbelieving.</p>\n<p>“Marry me,” he repeated nervously. “Either you have learnt to love me, as I now love you, and we can build a life together. Or… you never truly cared at all, and in rejecting me you’ll set me free. You can talk about turning me down for the sake of your career, and how I pressed you to have children you’re not ready for, like we planned. And we’ll have broken up for a good reason that won’t have Potter trying to hex my bollocks off.”</p>\n<p>“Your parents won’t let us…” she started uncertainly. “Your father has kept you so busy with ‘urgent business management tasks’ the past few weeks, we’ve hardly even gotten to see each other. He doesn’t even like us dating.”</p>\n<p>Draco shook his head emphatically. “Mother won’t mind. This was my grandmother’s old wedding ring – given with her blessing. She just wants to see me married now, and she likes you more than Astoria. Father… well he will learn to cope. I’m his only son – if he wants grandchildren he’d better get used to the idea that I’ll be marrying whomever I want. And that’s you, not the Greengrass family, no matter how advantageous the potential business connection. That was never a real love match. Just one of the few pure-blood families we weren’t too closely related to, who were open to an alliance through marriage.”</p>\n<p>“Harry won’t believe it,” she said, touching the gems gently with a tip of one finger. “He’ll make me take another antidote.”</p>\n<p>“He’ll believe it,” Draco said confidently, “because I got his blessing to propose to you. I couldn’t figure out how to subtly get your parent’s ‘phone number’ so I could ask your father for your hand in marriage, so I asked Harry for it. He wouldn’t give it to me until I explained why I wanted it, the stubborn idiot.”</p>\n<p>“That sounds like him.” Hermione slid the emerald ring onto her finger and stared at it wonderingly.</p>\n<p>“Is that a yes?” Draco asked anxiously.</p>\n<p>“Yes,” she said, looking up at him with tears glistening in her eyes, and a smile on her face. “It’s a yes.”</p>\n<p>He leapt up and pulled her out of her chair to sweep her into a passionate kiss. A few people at nearby tables applauded the happy couple, and the waiter ambled back to their table. It looked like they would need that champagne after all.</p>\n<p>“How did you do it?” Harry asked, spinning Hermione around as they danced under the glittering crystal chandelier in the Malfoy ballroom. “How did you get Lucius to cooperate and play the happy father-in-law and agree on terms and sign the marriage contract at last? I thought you were going to stay engaged to Draco <em>forever</em>.”</p>\n<p>“It wasn't that long! Barely over a year. And I threatened him. Discreetly.”</p>\n<p>Harry laughed. “Of course you did, you blackmailing fiend. What with?”</p>\n<p>“The dire prospect of a bastard child, and Draco messily forced into an honourless wedding at wandpoint,” she whispered, leaning in close so he could hear in the hubbub of the ballroom full of dancing couples.</p>\n<p>“Dear Merlin! Are you expecting? Congratulations!” Harry said, glancing at her flat stomach in her fantastically expensive cream wedding dress robes. There was really far too much silver embroidery and frilly lace on them for Hermione’s tastes, but Narcissa had cried about how she’d never had a daughter to fuss over, and Hermione had eventually caved to perhaps too many of her preferences about the wedding.</p>\n<p>“No, it was just a line,” giggled Hermione. “I mean, it <em>could</em> happen. I didn’t say I <em>was</em> pregnant, I just pointed out that I <em>could</em> be. And I talked about how unreliable contraceptive charms are. They’re much less reliable than Muggle methods you know, but Lucius certainly doesn’t know anything about the latter being an option we use. He was desperate for me to stop talking by the end of our chat, as I explained in detail about how if his son didn’t marry me by the end of the year I would vow to <em>raise his bastard Malfoy grandchild in the Muggle world</em>.”</p>\n<p>Harry tripped over his own feet, and had to clutch at her shoulder so he didn’t fall over, he was laughing so hard.</p>\n<p>“You evil woman! People are photographing us!”</p>\n<p>“It’ll be a great snap for the wedding album,” she laughed, catching the bright flash of a wizarding camera out of the corner of her eye.</p>\n<p>“He must be quietly fuming!” Harry said with delight. “Or is he angrily shouting?” Harry got along a lot better with Draco these days, but still wasn’t at all fond of his father.</p>\n<p>Hermione spun them back into a waltz and said, “Well, we <em>all</em> shouted at first, except Narcissa I suppose. I found the whole marriage contract thing horrifically patriarchal, but it was important to Draco to stick with wizarding traditions or apparently it wouldn’t feel like a ‘real’ wedding to him. Lucius has pretty much gotten over it now and is quietly fuming or grudgingly satisfied – it’s hard to tell the difference but Draco says he’s happier. I think he rather admired my cunning ruthlessness about it all, though he won’t admit it out loud. And I suppose he thinks half-blood grandchildren are better than <em>no</em> grandchildren, which was Draco’s preferred threat of choice.”</p>\n<p>Harry sighed sadly, all his good humour dropping away in a heartbeat.</p>\n<p>“Harry? Are you alright?”</p>\n<p> “Ginny and I are getting a divorce,” Harry said, with resignation rather than sadness.</p>\n<p>“Did something happen?” Hermione asked tentatively. “Did she… break her promise?” Surely she wouldn’t dose him with love potions again, after Harry had made the consequences for drugging him again without permission so very clear!</p>\n<p>Harry let go of her waist to flick his hand twice at the two of them with a softly murmured incantation, and a faint background buzzing noise around them told her a Muffliato effect was now up. The media had infringed on Harry’s privacy so many times over the past few years that he’d learnt to master that spell as one of only a rare few he could cast without wielding a wand. She wasn’t at all surprised he cast it – only that it’d taken him so long to do so.</p>\n<p>“What? No, it’s not what you’re probably thinking. No potions added to the cocoa,” he said rather quietly, despite the theoretical security of the anti-eavesdropping charm. “There were a few things, but the big one was that… she just couldn’t go through with IVF treatments. She didn’t realise what was involved, and when she did… well. It was too much for her. She refused. We talked about it a few times and she seemed on-board with it all initially, but she had this big hysterical breakdown eventually and admitted the whole process terrified her and she hated it. She just couldn’t do it.”</p>\n<p>“You could adopt?” Hermione suggested. “I think you’d be a good father.” Harry smiled gratefully at her.</p>\n<p>“We could. But that’s also something I can do on my own, without her.”</p>\n<p>“I didn’t want to say it,” Hermione admitted embarrassedly.</p>\n<p>“I know, and I appreciate your discretion,” Harry said, squeezing her hand in thanks. “And that you’re trying to be supportive of Ginny and I staying together, like I asked you to be. But it’s over, for sure. I just didn’t want to announce it before your wedding, and steal the media spotlight from the happy couple. You can relax – we’re definitely through.”</p>\n<p>“Oh good,” she sighed happily. “I’m so relieved. That is… I’m sorry that I’m happy, and that it didn’t work out, but I think it’s for the best. But how are <em>you</em> feeling about it Harry? Are you okay?” Her sentences tumbled out rather awkwardly as she tried to hastily backtrack, but luckily he didn’t look offended, just reflective.</p>\n<p>“I’m… alright. Sadder than I thought I’d be. I really wanted it to work.”</p>\n<p>“I know. And you really tried.”</p>\n<p>“She’s broken up about it. I feel especially bad about that. But apart from Ginny, Molly is the only one in the family who can’t understand why we’re separating. Everyone else gets it, to a greater or lesser degree. And Arthur keeps making Ginny cry, without meaning to, by getting distracted by the wonders of Muggle technology and asking prying questions about how IVF works, if you can believe it!” he finished with a laugh.</p>\n<p>Hermione giggled at that. “Oh dear, I can just see it now!”</p>\n<p>They whirled about the dance floor for a while longer, both lost in thought.</p>\n<p>“It’s alright that you’re sitting with her for the reception, isn’t it?” Hermione asked at last, breaking the silence with her anxious question.</p>\n<p>“Yes, it’s fine,” he said with a nod.</p>\n<p>“And you’re happy?” Hermione asked quietly. “About being single again?”</p>\n<p>Harry looked pensive as he twirled her around. “Not yet. But I think I might be eventually… boss.” He grinned as he said the last word, trying to lighten the mood with a joking change of topic.</p>\n<p>“Heard the gossip did you?” Hermione said with a grin of her own.</p>\n<p>“Susan told me. In total confidence. Along with telling half a dozen other people, reportedly.”</p>\n<p>“She’s very excited for me, but the announcement was <em>supposed</em> to wait for when I’m back from my honeymoon,” Hermione said with rueful smile. “I don’t even know how she found out. <em>I </em>didn’t tell her! I promised Kingsley I’d keep it quiet.”</p>\n<p>“Deputy Head of the Department of Magical Law Enforcement!” Harry said excitedly. “I’m so proud of you, Hermione.”</p>\n<p>“Kingsley wants me to work on eradicating some of the more dreadful pro-pure-blood laws from the end of the war. And he says I’m the best suited for that, though I don’t think I know as much about the laws as many others do,” she said modestly.</p>\n<p>“You will be <em>amazing</em> at it,” Harry promised. “Look how you pushed that new bill through about regulating poisons and other dangerous magical potions. You got over eighty percent approval for it! It’s practically unprecedented to get that kind of support from both the pure-blood old fogeys and the new blood.”</p>\n<p>“Different arguments for different people,” she said with smug pride. “Draco helped me by going over my drafts. And Narcissa hosted more morning and afternoon tea parties than I ever thought I’d have to suffer through, but you’d be amazed how much you can accomplish chatting with relaxed people stuffed full of cake, compared to dragging them into formal meetings. She’s become quite the social butterfly these days.”</p>\n<p>“Well I think you deserve the lion’s share of the credit – you did so well! The Muggle and Minor Protection Bill paved the way for this new one, and now you’ve got Amortentia almost totally banned – I’m so proud of you! Ron was angry, unfortunately, and George wasn’t too happy about it either,” said Harry. “But George understood in the end. He and R… he’s developed some much milder new potions since you’ve gotten the strongest love potions so heavily restricted. You know, I don’t mind that ‘Second Glance’ one that barely lasts a couple of minutes. It just makes the target pay attention to someone properly, it doesn’t even induce attraction at all.”</p>\n<p>“Yes, I know, I heard all about the new range. Apart from official interactions, he wrote me a letter, you know. Apologising for selling love potions at a discount. He’s figured out…” she was speaking quietly already, but still she trailed off to listen for the telltale buzz that the Muffliato was still running, glancing around at the crowded ballroom of whirling couples who might overhear their chatter if it wasn’t. Draco was dancing with Pansy, and he gave her a slightly sappy look when he caught her eye, before the gap in the crowd disappeared and he was lost from sight. He was her <em>husband</em> now – she could hardly believe it. And she was <em>Hermione Malfoy</em>. Lucius had insisted very stubbornly on the surname change, but in exchange she’d locked in having the final say for any and all educational arrangements for any future little Malfoy children (may that day be far off still!), and a generous monthly stipend of “pin money” from the Malfoy vaults, for her personal expenses. Which if Narcissa had her way would probably be mostly spent on new clothes for the first few months of her marriage, at the very least.</p>\n<p>“Yes. George and I had a chat about things not so long ago,” said Harry vaguely, with a meaningful look at her that she guessed was intended to hint that she should continue to keep mum about Ginny dosing him. She never <em>had</em> managed to change his mind about going public about that. But she was so very glad they were separating. It made her special day even more wonderful.</p>\n<p>-000-</p>\n<p>In between dinner and dessert, the happy couple circulated through the dining room from table to table, spending a few moments with each of their guests. Their respective parents and close friends had all been greeted first, so now they were mingling more generally.</p>\n<p>“She’s beautiful,” Hermione cooed, rocking Fleur and Bill’s drowsy infant daughter gently in her arms. She wasn't a newborn anymore, but she was still rather tiny. “Hello Victoire! It’s nice to meet you. And I see you’re bucking the Weasley trend and going with blonde like your mummy.” She stroked Victoire’s head gently, the fuzz of blonde hair was incredibly soft, like kitten fur. Victoire let out a tiny yawn, and it was absolutely adorable to hear.</p>\n<p>“And are you and Draco planning on starting a family soon?” asked Fleur, smiling as she took her baby back to tuck her into her blanket-lined bassinet to nap – a woven Moses basket that seemed to be a popular choice with pure-bloods for transporting their babies around in the world. Hermione had yet to see a single stroller in the wizarding world that wasn’t pushed by an obviously Muggle parent.</p>\n<p>Hermione sighed gently with frustration. About a dozen people in a row had asked that question, and it was starting to wear on her nerves. She liked babies well enough, but had no urge to hurry up and have one of her own. She was tired of saying, “No, not yet” and having to justify her answer over and over. It was as if some people found the idea of a woman <em>not</em> wanting to have children right away personally insulting.</p>\n<p>Draco gave her a quick glance, squeezed her hand supportively, and answered for them both. “Not quite yet – Hermione and I have decided to wait a while. We’d like to focus on our careers in the Ministry and in business for now.”</p>\n<p>“Well, perhaps life will surprise you early,” Fleur said with a smile.</p>\n<p>“And if that happens, we would be delighted to welcome a child into our lives,” Draco said diplomatically, before changing the subject. “I see Victoire has broken the Weasley trend of red hair, the little rebel!”</p>\n<p>Bill laughed heartily at that. “The work of four generations of redheads ruined! But isn’t she adorable? Blonde just like her mother.”</p>\n<p>“She is the sweetest baby I’ve ever seen!” agreed Hermione, wrapping her arm around Draco’s waist. He planted a gentle kiss on the top of her head, smiling that sappy smile he’d barely kept off his face for a minute all day as he gazed at her. “Is it due to her Veela ancestry, or just that cute little button nose, do you think?”</p>\n<p>“The button nose,” Fleur said happily, her lingering soft French accent stumbling a little over the first word.</p>\n<p>“Veela powers don’t manifest until the teenage years. We all love her just for being who she is,” Bill said, looking at Hermione rather intently. “Harry asked something a bit similar. And you know, I’m <em>loving</em> being a father.”</p>\n<p>Hermione beamed at him as she realised what he was hinting at – he loved his daughter. Without any aid of Veela powers or potions, he loved her like a father should. She looked around for Harry, but couldn’t see him, though she saw Ginny chatting with a couple of friends at their assigned table. She guessed this would be their last outing as a theoretically happy couple, if their planned divorce was about to go public.</p>\n<p>With a last wish for wedded bliss from the Weasleys, Hermione and Draco moved on to circulate with their other guests. “Have I mentioned how beautiful you look?” Draco asked her.</p>\n<p>“Maybe a dozen times today,” she laughed.</p>\n<p>“I thought you should know. Just in case you had forgotten. You look absolutely stunning.”</p>\n<p>“Have I mentioned how handsome you look?” she asked, running her hand along his smoothly shaven jawline.</p>\n<p>“Not nearly often enough. I’m magnificent,” he said arrogantly, making them both laugh. “Ready to face the Greengrasses?”</p>\n<p>“Let’s go.”</p>\n<p>Daphne never <em>had</em> quite forgiven her for “stealing” Draco from her sister, and her congratulations were lukewarm and focused mostly on how “lucky” Hermione was. But Astoria herself was all politeness on the surface, but with a tinge of cattiness. Of course, she was well positioned to be content, as she’d made a match of her own.</p>\n<p>“Ernest and I are so very happy for you,” she said, resting her bejewelled hand on her husband’s where it lay atop the linen-covered table. “It was such a <em>long</em> engagement some people were wondering if you’d ever marry! Why, Ernest and I were engaged after you, but married first! Still, all good things come to those who wait, don’t they?”</p>\n<p>“Well, I couldn’t wait to marry <em>you</em>, my darling,” Ernie said with a happy smile at his wife. “And my parents were thrilled to welcome you to the Macmillan family. And I’m so glad you two got married – what a wonderful thing. I’m sure you’ll be very happy together.”</p>\n<p>“And are you planning on having children soon?” Hermione asked, but Astoria didn’t take it as a dig at all.</p>\n<p>“Oh yes! We’ve even picked out names. Scorpius if it’s a boy,” she said, with a smug glance at Draco, “and Morea if it’s a girl.”</p>\n<p>After they’d left the table, Draco muttered crossly, “That was <em>our</em> name. I picked that name.”</p>\n<p>Hermione glanced at him anxiously. “Are you alright?”</p>\n<p>He let out a huff of breath and let his shoulders relax. “I’m fine. She’s just trying to get to me, but I won’t let her.”</p>\n<p>“It seems a little petty.”</p>\n<p>“She could be, sometimes. She argued a fair bit with father and mother, over things both large and small. But some of her arguments you would’ve approved of – she is actually in favour of a lot of liberal, pro-Muggle-born initiatives. And anyway, I suppose I deserve a little pettiness.”</p>\n<p>“But you’re happy?”</p>\n<p>He swept her into his arms to dip her for a passionate kiss, to the applause of a few at the nearby tables. Narcissa dabbed some happy tears from her eyes as she watched them (her lace-edged hanky had made regular reappearances all evening), chatting contentedly with her sister Andromeda while she juggled young Teddy on her knees, who was insistent about staying awake all night to enjoy all the fun.</p>\n<p>After a moment, Draco let his wife up, laughing and breathless, “Never doubt it. You are the only woman for me, and always will be. We balance each other perfectly.”</p>"
}