{
  "id": "900839",
  "url": "https://archiveofourown.org/works/900839?view_full_work=true",
  "author": [
    "mirrorkill"
  ],
  "title": "Fly a Little Faster",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "F/M",
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski"
  ],
  "characters": [
    "Derek Hale",
    "Stiles Stilinski",
    "Sheriff Stilinski",
    "Paige (Teen Wolf)",
    "Scott McCall",
    "Cora Hale",
    "Talia Hale",
    "Lydia Martin"
  ],
  "additional_tags": [
    "Time Travel",
    "Episode: s03e08 Visionary",
    "Episode Related",
    "Identity Porn"
  ],
  "language": "English",
  "series": "",
  "published": "2013-07-27",
  "completed": null,
  "words": "32,052",
  "chapters": "1/1",
  "comments": "1,596",
  "kudos": "32,363",
  "bookmarks": "9,556",
  "hits": "535,736",
  "summary": "<p>Everyone knows when you go back in time, you shouldn't step on an ant, just in case you accidentally kill your own grandparent or something. But what happens when you go back in time and, uh, accidentally interrupt the one event that apparently made the Grumpiest Alpha in Town <i>into</i> a ball of mindless manpain? </p>\n<p>Well, if Marty McFly can do it, so can Stiles Stilinski. All he has to do is get Derek and Paige to fall in love before he gets pulled back to his own time. And before he makes anything <i>worse</i>. That's easy as pie, right? <i>Right?</i></p>",
  "notes": "<p>Warnings: Time travel, gratuitous Polish names for Stiles, randomly named Hales, Sheriff-called-John.<br>PANIC ATTACK DESCRIBED WITHIN.<br>If you think I need any more warnings, let me know! I haven't slept for three days to write this. It's going to be terribly Jossed in two days. I blame <a href=\"https://archiveofourown.org/users/Seraphina_Snape\" rel=\"nofollow\">Seraphina_Snape</a> for all of this. With so much love to Theron09 for the rush beta! You're a complete star, love. ♥ The title is from IU's \"You and I.\" The whole song is vaguely appropriate. :D <b>Edit: 08/06/13: </b><br>One new warning: Brief mention of abuse.</p>\n<p><b>Translations:</b> Russian and Polish available above. Spanish currently being translated <a href=\"https://archiveofourown.org/works/6325414/chapters/14492884\" rel=\"nofollow\">here</a> by yuki_yuki (darknesswolf)</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#children\">other works inspired by this one</a>.)</p>",
  "text": "<p align=\"center\">\n<img src=\"https://24.media.tumblr.com/4c7ba9a13b2e5ba39befb28dd7bb7be1/tumblr_mqx55c80Zp1rxd0rpo1_500.jpg\" alt></p>\n<p align=\"center\">Cover by <a href=\"https://lupusululaturusest.tumblr.com/\">lupusululaturusest</a>. ♥</p>\n<p> </p>\n<p> </p>\n<p> </p>\n<p>\"For the record, this is not the smartest thing we've ever done,\" Stiles says, leaning against the wall.</p>\n<p>Lydia and Cora look up and give him matching <em>duh</em> expressions. Stiles squints at them and wags a finger in their direction.</p>\n<p>\"Am I the only one turned on by that twin glare of emasculating derision?\" Stiles asks.</p>\n<p>\"It's hot,\" Isaac offers.</p>\n<p>\"That's my <em>sister,</em>\" Derek says, trying to glare at both Isaac and Stiles and failing miserably. Isaac ducks his head apologetically, doubled when Allison jabs him in the side and Scott slumps closer to Stiles. Stiles grabs at his friend's elbow in support. The love triangle of woe is hitting Scott harder than he thought it would.</p>\n<p>\"I am a little,\" Peter offers from the couch.</p>\n<p>Cora spasms, like she's throwing up in her mouth. Stiles' expression flattens commiseratively. Peter's a jerk no matter where they are or what they're doing.</p>\n<p>\"Can we just get this over with?\" Derek says, slightly grouchily. \"The quicker it's done, the quicker you can wash the floor and move my furniture back into place.\"</p>\n<p>Stiles throws him a disdainful look. \"It's a couch and a coffee table. I think team human can deal with the <em>heavy</em> labor if you werewolves need to run off and frolic in the moonlight.\"</p>\n<p>\"It's a new moon, dumbass,\" Lydia mutters without looking up, continuing to sketch in the chalk outline for where the spell will go.</p>\n<p>\"Lydia Martin talked about my <em>ass,</em>\" Stiles informs Scott, mock-swooning. That comment does make Lydia smirk. The fact that Stiles doesn't <em>actually</em> swoon soon after is a testament to his personal growth over the last few months.</p>\n<p>Stiles has had Lydia Martin on a pedestal for so long. Seeing her flaws over the last few terrible months has been what's pushed them towards being <em>actual friends, </em>which is what's finally actually put the kibosh on Stiles' ever-consuming lust for her.</p>\n<p>Stiles has always had trouble finding a way to crush on people after making friends with them.</p>\n<p>\"So this thing will give us a clue as to what new fresh disaster is coming, right?\" Allison questions.</p>\n<p>\"Hopefully,\" Cora says. \"I remember our Mom doing this, once or twice. Once the circle is drawn and the elements are laid out, it uses our residual energies to give us a shared vision of something to help us. Deucalion's ten steps ahead of us. We need to try and see what the <em>eleventh</em> step might be. This is our best shot.\"</p>\n<p>\"And that's why we write our names around the outside of the circle,\" Lydia explains. \"So the spell knows who to feed from and who not to.\" She gives Peter a significant disdainful look. He hasn't been invited to join in. It was a unanimous vote. \"So <em>you</em> need to write your real name.\"</p>\n<p>Scott starts laughing. Stiles scowls at Lydia, but she's concentrating on the circle and not looking in his direction. Still, there's no one else in the room she could be referring to.</p>\n<p>\"Ugh, fine,\" Stiles says, folding his arms and shuffling awkwardly. \"It's not like any of you could pronounce it, anyway.\"</p>\n<p>Isaac looks up from where he's counting bay leaves for the spell. \"Where <em>did</em> Stiles come from as a nickname?\"</p>\n<p>Scott's the only one in the room who knows the story, and he won't tell it in a flattering way.</p>\n<p>\"My cousin,\" Stiles says, trying to be casual. \"It wasn't long after my mom died and he came to stay for a little while.\"</p>\n<p>\"Stiles <em>totally hero worshipped him,</em>\" Scott blurts out, like it might all be one word, not one sentence.</p>\n<p>Stiles gives him a cold look. Everyone else in the room looks curious. Except, curiously, Derek. Derek's looking at him almost <em>sadly.</em></p>\n<p>Oh. Yeah. Stiles should have remembered. Derek's dead family. Chances are Derek would have lost a relative he hero-worshipped in the fire. <em>And</em> he definitely lost his Mom too. Stiles runs through the story quickly, not wanting to hurt Derek more than he has to. There's a quota of manpain for everyone in the world, Stiles thinks, and Derek's gone through more than his fair share in a ridiculously short spell of time. It's not enough to make them <em>friends,</em> but Stiles definitely has a little more empathy for Derek Hale of late.</p>\n<p>\"He was awesome,\" Stiles defends. \"He talked to me like I was an adult. When he left, I figured it wouldn't hurt if I took his name.\"</p>\n<p>\"So even <em>you</em> don't know what it means,\" Allison says.</p>\n<p>\"I totally do,\" Stiles says, instantly. \"It means I have <em>style.</em>\" He tugs at his t-shirt, which reads <em>SCIENCE: It works, bitches!</em> and scowls at it, like it's completely betraying him.</p>\n<p>\"Go make yourself useful and help Isaac sort out the herbs,\" Lydia says, squinting at the diagram she and Cora are working from. Scott smirks at Stiles. \"You too, McCall.\"</p>\n<p>Stiles slinks over to the counter, Scott at his side, and Scott starts counting juniper berries carefully, dropping them into a small glass jar and frowning in concentration. Stiles lets Isaac count his leaves, and looks at the pile of red roses that need the thorns cutting off.</p>\n<p>Figuring he needs a little space, Stiles carries the small pile over to the counter near the sink, along with the silver knife that the ritual apparently needs (and Stiles laughed about at the time, because at least silver is involved <em>somewhere</em> in the werewolf mythos after all) and starts trying to cut the thorns from the stems.</p>\n<p>And then the knife slips.</p>\n<p>\"Mother<em>fu—</em>\" Stiles swallows the rest of the curse. Especially because Peter likes mocking Scott with that particular term. \"<em>Why yes, I am,</em>\" is Peter's favorite response. \"<em>Your mom to be precise, Scotty.</em> <em>Several times in several different positions—\"</em></p>\n<p>There's still a second hole in the loft's far-end wall from where Scott went postal on the brickwork, rather than Peter's face.</p>\n<p>Seconds later, because <em>werewolves,</em> Stiles' injured hand has been pulled upwards for someone to look at.</p>\n<p>Expecting Scott, because his best friend apparently wants to be Florence Nightingale personified, Stiles startles backwards on seeing Derek's face, all the brooding up close and personal. He slams into the counter, and pain blossoms.</p>\n<p>\"That's gonna bruise,\" Stiles whines.</p>\n<p>\"Hold <em>still </em>then<em>,</em>\" Derek snitches, gripping Stiles' wrist and pulling him over to the sink. \"You're bleeding. A lot.\"</p>\n<p>\"Nnghh,\" Stiles manages, and looks away.</p>\n<p>\"I need you to open your hand,\" Derek says.</p>\n<p>Stiles looks back to squint angrily at Derek for the stupid suggestion, because it hurts too much to open his hand right now, but catches sight of his own blood and—yeah. <em>Yeah.</em> Stiles' impulse that started all of this to look for Laura's body? That had not been a smart plan at <em>all.</em> He frowns at his hand, looking small and pathetic in Derek's large hand, as if he can scowl the blood away.</p>\n<p>Derek rolls his eyes in what seems to be a trademarked Hale facial expression, and a trail of black runs up Derek's arm. The pain lessens almost instantly, enough for Stiles to open his fingers and see the damage.</p>\n<p>Stiles isn't precisely expecting <em>Derek</em> to be the one to flinch back this time.</p>\n<p>\"Don't tell me <em>you're</em> scared of blood,\" Stiles breathes. \"That's <em>classic.</em>\"</p>\n<p>\"I'm not scared of blood,\" Derek says, instantly, and grabs for Stiles' hand again, shoving it under the faucet, turning on a blast of cold water.</p>\n<p>Stiles shrieks. It's kind of high pitched. He tries to grab his hand back and scowls at Derek when he doesn't let it go.</p>\n<p>\"It <em>is</em> you,\" Derek breathes, which makes absolutely zero sense whatsoever.</p>\n<p>\"Uh, yeah. It's me. Stiles Stilinski.\" Stiles tilts his head. \"In any of the many fights you've lost recently, have you been hit in the head at all?\"</p>\n<p>\"Your best friend dropped me two stories,\" Derek says, and then shakes himself. \"No. I mean. <em>Shit.</em>\"</p>\n<p>\"Okay,\" Stiles says, evenly, \"when the Alpha werewolf in the room swears, <em>I'm allowed to start panicking, okay?</em>\"</p>\n<p>\"Cora, can you remember what the consequences of this spell are if you do them wrong?\" Derek drops Stiles' wrist, only to put his hands on Stiles' back, shoving him towards the door, physically herding him.</p>\n<p>\"The book lists a lot of things. The usual stuff.\" Cora shrugs. \"Evisceration. Flaying of flesh. Sexually transmitted diseases. Time travel. Castration—\"</p>\n<p>Stiles turns to bat ineffectually at Derek, who just grabs his shoulders and turns him around.</p>\n<p>\"You're getting out of here,\" Derek says. \"Now. Out of the loft.\"</p>\n<p>\"<em>What?</em>\" Stiles doesn't know what's going on, but that's not going to stop him from arguing against it anyway. \"What do you mean I have to get out? Just me? Everyone?\"</p>\n<p>Scott makes some vague protest in the background.</p>\n<p>Derek grabs Stiles by the scruff of the neck and hauls him in closer, snarling right in his ear. \"Either you leave the loft <em>right now</em> or I'll carry you out.\"</p>\n<p>\"I'm not scared of you,\" Stiles says, trying not to flinch at the vibrations of Derek's growl shooting down his spine, chilling and reverberant.</p>\n<p>\"You're <em>not?</em>\" Lydia questions, still kneeling on the floor. \"Really?\" She sounds genuinely surprised.</p>\n<p>\"There are words for what I feel for Derek Hale and scared isn't among them,\" Stiles explains. \"Fear may be one of those words, though. Terror, another.\" He side-eyes Derek, who, for the briefest of moments, just looks <em>sad</em> again. Stiles frowns, and Derek's hands tighten on his hips, shoving him none-too-gently towards the door.</p>\n<p>\"Oh my god, let me go, you big doofus, I can <em>walk</em>.\" Stiles breaks away from Derek, eyeballs him weirdly, but heads over to the door. He looks at Scott. \"You coming with me?\"</p>\n<p>Scott looks angstily over to where Allison's helping Isaac, and he winces. \"I think it's best if I stay, man.\"</p>\n<p>Stiles rolls his eyes. \"<em>Fine.</em> You losers call me when Mister Manners over there is done having a big giant <em>breakdown</em>, and let me know how the spell goes, okay?\"</p>\n<p>\"You're on my speed dial,\" Cora says, in her flat monotone. Stiles gives his friends one last appalled look for letting the Alpha werewolf be a giant <em>dick</em> to him, but he gets apologetic expressions back from all of them.</p>\n<p>\"Go <em>home</em>, Stiles,\" Derek growls, red eyes flashing.</p>\n<p>\"I hope you all get genital herpes,\" Stiles calls, and slams out of the loft. He's only slightly gratified when he hears Lydia asking what the <em>hell</em> that was all about as he heads for the stairs.</p>\n<p>He mutters all of the way down the steps, and out into the Jeep, and he eyeballs Scott's rucksack vindictively on the passenger seat.</p>\n<p>\"<em>Your</em> owner can crib a ride from one of the other losers in there,\" Stiles tells Scott's bag. Lydia's purse is in the back of the Jeep too. He considers running back up the three flights of stairs, but anger boils in the bottom of his stomach, and he slams the steering wheel in frustration.</p>\n<p>His hurt hand stings, and Stiles scowls at it. \"This is your fault, y'know,\" Stiles tells his hand. Before realizing that he is, in fact, talking to himself. \"God <em>dammit</em>.\"</p>\n<p>He leans against his hands for a moment, but there's no point going back upstairs and making an idiot out of himself.</p>\n<p>It's probably just the blood, and Derek remembering Boyd's blood on his hands.</p>\n<p>\"Stupid post-traumatic stress disordered werewolves,\" Stiles mutters, and guns the engine.</p>\n<p>It's as he's only a few minutes away from home that he feels his hand sting again. Stiles adjusts his grip on his steering wheel, and keeps driving, but his hand spasms again.</p>\n<p>\"<em>Seriously?</em>\" He pulls over the Jeep carefully, and uncurls his fingers.</p>\n<p>His scar pulses, oddly. Like there's light shining through it.</p>\n<p>\"That… can't be good,\" Stiles says, and reaches automatically for his phone.</p>\n<p>He's not quick enough. For a moment, it's like the light has sparked out, hitting Stiles in the chest like lightning. Stiles has about enough time to scramble for the door handle, but even that isn't enough.</p>\n<p>The darkness claims him, and he remembers nothing more.</p>\n<p>#</p>\n<p>It's not unusual for Stiles Stilinski to wake up somewhere, firmly faceplanted, in a place he doesn't remember falling asleep.</p>\n<p>He inhales sharply a few times before he can groggily identify the itchy material his nose is currently pressed into. Ugh. Did his dad <em>really</em> let him fall asleep in the living room?</p>\n<p>\"You're the <em>worst,</em>\" Stiles tells his absent father, and tries to sit up. His head pounds as he does so, and he groans low in his throat.</p>\n<p>And then he remembers passing out in the Jeep after stupid Derek Hale threw him out of his stupid loft.</p>\n<p>Except, he's not in the Jeep. And if his dad found him passed out in the Jeep, Stiles would either be in hospital, a jail cell or his own bed. It's not like any of those options would be a <em>new</em> occurrence. Sheriff Stilinski had his bad-ass moments.</p>\n<p>Stiles rubs his head and considers the more likely option. That he'd stayed up late listening to Lydia talk about the stupid spell, and fallen asleep downstairs. That sounded likely. The spell sounded like a stupid idea all 'round. There'd been no logical reason for Derek \"I'm a dick\" Hale to suddenly throw him out of the loft.</p>\n<p><em>Dream logic.</em> Duh.</p>\n<p>That conclusion reached, Stiles lets himself sit upright much more gingerly. Taking things calmly is probably a good idea. His head's pounding. He has every intention of getting a glass of water, taking a leisurely shower, and treating himself to a cooked breakfast if the turkey bacon isn't as hideous to consume as his dad tried to tell him a couple of days ago, until he catches sight of the clock.</p>\n<p>Fifteen minutes to nine. It's a digital clock, and shows the date and temperature too. Stiles only catches sight of the <em>MON</em>, but that's enough to start panicking.</p>\n<p>\"Shit,\" Stiles says. And then repeats it a couple of times for good measure. He's going to be late to school. <em>Perfect.</em> He definitely has no time for a shower. He sniffs at his own armpits experimentally, pulls a face, and decides it's possibly good enough, if he stays downwind from Lydia. He's definitely got shower stuff in his locker in the gym, so he only has to make it until third period without anyone trying to smell him. It'll all be fine.</p>\n<p>There's probably no time to go upstairs and grab his bag. He's missed enough school that lateness is more damaging than a forgotten textbook or pen. There's enough stuff in his locker to get him through to lunchtime, and then he can sort himself out properly then. <em>Anything</em> is better than facing Mr. Atherton's wrath if Stiles is late to math.</p>\n<p>Stiles runs to the counter where his keys normally are, but they're not in the small bowl. He's about to give up on the idea of getting to math at all, but he catches sight of them on the small hook on the opposite wall which his Mom used to use for keys. Something tightens in the pit of Stiles' stomach, but he grabs for them and runs for the door.</p>\n<p>\"Bye, dad,\" Stiles yells automatically, which is habit more than anything else, and flips the latch to head outside.</p>\n<p>He slams the front door behind him, locks it up, turns to head to the Jeep – and freezes.</p>\n<p>Where the <em>hell</em> is his Jeep? Oh man. Oh <em>man.</em> His dad's going to <em>kill</em> him. The whole point of him even <em>having</em> the Jeep was that Stiles had promised to keep it safe. His Mom had always wanted Stiles to have a Jeep. It would keep her baby safe and sound on the road, not like some snobby shiny racer which the Whittemore's kid would inevitably end up in.</p>\n<p>Stiles' eyes sting for a moment, but he swallows down the emotion like it's a reflex. If his Jeep's not on the drive, it might be in the garage.</p>\n<p>Which means it might be damaged, and Stiles might still be in trouble with his dad later. Ugh. Well, later was later, and right now Stiles is running out of time. He runs for the garage, unlocks the door and sighs in relief.</p>\n<p>A few minutes later, Stiles is out on the road, his baby reacting <em>awesomely</em> under his hands, as if making up for the fact that everything else has been going totally, completely wrong. Everything inside actually looks a little cleaner. Maybe his dad got it serviced for him as a surprise. It would explain why the keys were in the wrong place, and the Jeep was undercover.</p>\n<p>When Stiles gets to Beacon Hills High, there are a good number of spaces in the car park, which is surprising. For a moment he wonders if maybe there's something he's forgotten about, maybe a trip, but there's a steady stream of kids headed through the door, so Stiles hurtles out of the Jeep, locks it, and runs to join them.</p>\n<p>He's got maybe two minutes to get his stuff and get to the classroom. Stiles thinks that maybe he might even make it, but of course he comes up to his locker and nothing. De nada. His lock has decided not to work.</p>\n<p>\"How is this my <em>life</em>?\" Stiles whines, shaking the lock. Why is there never a werewolf around when he <em>needs</em> one, huh? He double-checks the locker door number, in case he's just gone to the wrong one, but nope. \"I hate you, lock.\"</p>\n<p>\"Pretty sure it hates you too.\"</p>\n<p>Stiles makes an ungainly noise and flails backwards, and then tries his best to look composed when he sees who it is talking to him.</p>\n<p>It's a girl. Which is weird. People Stiles don't know rarely talk to him without him annoying them into replying. She's pretty, too; shoulder-length effortlessly wavy hair, smouldering dark eyes, and bright red lipstick that makes him think of Erica. She's wearing a soft brown suede jacket, white shirt, and black pants that fit her <em>very</em> well, and she has a pretty blue bag over one elbow. Lydia's probably going to adopt her <em>immediately. </em>Or hate her on sight.</p>\n<p>Stiles makes an <em>attempt</em> at coherent language, he's pretty sure, which just makes the girl grin.</p>\n<p>\"Having a fight with your locker?\" The girl asks, eyeballing Stiles almost like she's cataloguing his appearance. Stiles tries not to stare back. She seems kind of familiar, now he thinks about it. He's probably seen her around campus before.</p>\n<p>\"I think she cheated on me,\" Stiles blurts, because at least his default mode of humor doesn't let him down, even when most of his bodily control is being iffy. \"Probably with a lacrosse player, knowing this school.\"</p>\n<p>\"Ugh, don't even talk to me about sports,\" the girl sighs, turning to Stiles' locker contemplatively. \"My uncle was a big shot basketball player a few years back, and he <em>still</em> hasn't stopped bragging about it.\" She sighs, and then jabs her elbow into the locker door with sudden speed.</p>\n<p>The locker creaks open. The girl's grin widens, and Stiles' face falls.</p>\n<p>Everything inside his locker is pink. And <em>glittery.</em> Stiles is going to <em>kill Scott dead.</em></p>\n<p>\"My best friend's idea of a joke,\" Stiles sighs, and makes a grab for the least obnoxious pen and notepad, and as an afterthought grabs for his schedule, because he's pretty sure his brain might be a little scrambled. \"Thanks for the assist.\"</p>\n<p>\"No problem,\" the girl says, and turns away, hurrying down the corridor. Stiles might watch her ass as she goes. Just a little.</p>\n<p>He turns back to his bright pink, sparkly locker, and shuts the door. It won't lock now, but who's really going to steal anything from that glittery cesspit of shimmer, anyway?</p>\n<p>Stiles mopes for just a moment, and then he remembers <em>math</em>, and starts moving.</p>\n<p>He runs into the classroom just as the bell goes.</p>\n<p>And twenty-four faces turn to him in confusion, looking from behind easels.</p>\n<p>\"This is not my math class,\" Stiles realizes out loud.</p>\n<p>\"Not really,\" the art teacher tells him dryly from the front.</p>\n<p>\"Sorry!\" Stiles backs out of the room, carefully shuts the door, and flattens against the wall, frowning hard. Did math move? He lifts up his schedule to double-check. Math, yeah. Mr. Atherton, sure. Room 212.</p>\n<p>Ohhh. Stiles is in completely the wrong corridor. At least Scott put in his new schedule when he pink'd his locker. Some of his other classes have shifted around, but he still has a free period last thing on a Wednesday, so he's not going to complain.</p>\n<p>Well. Maybe not <em>loudly, </em>anyway.</p>\n<p>He's definitely, definitely late when he gets up the stairs to 212, but it doesn't stop him from knocking and entering the class.</p>\n<p>Which really doesn't look like his usual AP math class. Because Lydia isn't there. There's a couple of empty desks at the back, though. Stiles hesitates in the doorway, and that's a mistake, because the female teacher standing at the front of the class hauls him in by his shirt collar and kicks the door shut with a well-placed heel. She neatly pulls the schedule out of his hand, and sighs at it.</p>\n<p>\"Why the administration keep sending me new kids without letting me know,\" the teacher sighs, and gives Stiles a neat push in the middle of his back. \"Get to a seat, sit down, and keep your head down, new kid,\" she orders, shoving his schedule back into his hands.</p>\n<p>Stiles splutters, but the teacher gives him the evil eye, so Stiles stumbles to his seat noisily, clattering down into his seat. He eyeballs the teacher warily. He hasn't seen many of the math staff, so it's not weird he doesn't know her, but he thinks he should have seen her around – her dress sense is a little weird. She's wearing a grey pantsuit, and the pants are really high in the waist.</p>\n<p>In the desk next to him, a boy with a sharp face that reminds him almost of a weasel leans over, his lip curled with open contempt. \"You'd better be quiet, new boy,\" the boy hisses. \"The sooner I get out of this class, the better. If you hold the class back, you'll pay, okay?\"</p>\n<p>Stiles' eyebrows make a bid for escape to his hairline. \"Got it,\" Stiles whispers back, frowning. Man, this is a weird class. He's definitely in the wrong place, and he's going to <em>kill Scott dead.</em> He really is. Stiles is pretty sure he knows where there's a good patch of wolfsbane in the preserve.</p>\n<p>Stiles warily looks at the board. He probably would be hauled in front of the Principal if he makes a run for it, so his best chance is to stay low. If the questions are all as easy as the ones currently on the board, he's got a great chance; it's all regular sophomore math.</p>\n<p>The teacher sets them a few questions, and Stiles flips open his notebook.</p>\n<p>\"Nice paper,\" the boy next to him sneers. He's so unpleasant. Stiles is <em>glad</em> that he hasn't noticed him around school before, because he's a douchebag. Stiles probably has a stupidity filter. Much like Scott's Allison filter, which blanks out everything that isn't Allison.</p>\n<p>Stiles looks down at his paper. It's pink, and there's a printed unicorn in the corner, surrounded by hearts. \"Thanks,\" Stiles mutters.</p>\n<p>\"You two at the back, need I remind you: This is <em>silent time,</em>\" the teacher barks from the front. Weasel boy's scowl deepens, and he slinks further into his seat.</p>\n<p>Stiles beams widely, pleased he's gotten the other dude into trouble, and then his heart skips a beat. Just for a moment.</p>\n<p>Because his memory has just kicked in.</p>\n<p>The girl who bashed into his locker for him, with creepy werewolf-like strength now Stiles thinks about it, seemed weirdly familiar, those brown eyes looking up at him…</p>\n<p>Stiles jerks automatically, unable to help it, and he looks up in horror.</p>\n<p>Yeah, the girl was familiar. He's seen her before.</p>\n<p>Half of her body, anyway. Staring up at him from the grave Derek Hale had dug outside his gutted, burned out house.</p>\n<p><em>Laura Hale.</em> Walking around. <em>Alive.</em></p>\n<p>Several things smash together into Stiles' head, brilliant and bitter and confusing. The Jeep Mom bought for Stiles for when he grew old enough, that his dad kept in the garage until Stiles passed his driving test. The way they left her keys hanging on her hook until Stiles was old enough to need them. The weird passé fashions.</p>\n<p>The spell had bad side-effects if done incorrectly.</p>\n<p>Evisceration. Flaying of flesh. Sexually transmitted diseases.</p>\n<p><em>Time travel</em>.</p>\n<p>Because he's never developed any sort of filters for polite society, Stiles grabs at his crotch to double check the paranoia that slides in, because the next terrible side effect in Cora's list had been castration, but Stiles Junior seems to be just fine.</p>\n<p>Next to him, the weasel-faced boy starts shouting for help, and Stiles realizes he's grabbing himself. In public.</p>\n<p>In the <em>past.</em></p>\n<p>Holy werewolves in an aconite <em>bucket</em>. The walls spin, and Stiles is pretty sure the teacher's shouting at him, or shouting for help, but he can't stop himself now. His heart thumps, and his brain shrieks the only thing that makes sense to him in moments like this.</p>\n<p>Escape. Escape. <em>Escape.</em></p>\n<p>Stiles stumbles to his feet, pushes past the startled teacher, and promptly throws up in her trash can. And maybe the teacher's shouting other things behind him, things about someone escorting him to the school nurse, but Stiles stumbles out of the door and starts running on shaking legs before anyone else can stop him.</p>\n<p>He runs as far as he can, which isn't very far considering his lungs are burning, and he stumbles down two flights of steps, heading for somewhere he thinks might be a temporary safe space, because if there's a class in gym, they'll be in the hall or out on the field, and he barrels through into the changing room and sinks onto the floor in a shuddering heap.</p>\n<p>Holy hell. Holy <em>hell.</em> Stiles is in the past. How far in the past? He's in the past, and Laura's alive, and the last time he saw her she had been <em>cut in half.</em> Laura, with her awesome elbow power and fearsome smile and epic belly laugh, and Stiles has seen her <em>alive.</em></p>\n<p>Stiles is vaguely aware of a terrible sound in the air, someone whining, and it's coming from his own throat, but he can't really connect to that. His fingertips claw into the tiled floor, and he arches, struggling to try and haul in air as his brain screams at him.</p>\n<p>He can't breathe. He can't. His chest is tight, and he can't breathe, and he's going to die.</p>\n<p>In the <em>past</em>.</p>\n<p>Stiles' brain is stuck on loop, but that's kind of his panic attacks personified. A track of bad wrong thoughts that go over and over, repeating louder and louder until blood pounds behind his eyeballs, sending him to unconsciousness. His legs spasm uncomfortably, sending fire through his body.</p>\n<p>His eyes are burning, and he's probably crying, and Stiles is pretty sure he's never going to know what air feels like ever again, and then there's a pair of hands on him, pulling him upright. Someone has hold of him, and is pulling him against them, warm hands spread-eagling on his chest.</p>\n<p>\"I need you to relax,\" a voice says in his ear. Male. Stiles doesn't recognise it, but he can hear <em>something</em> in it which he can latch onto, and he struggles to hear them. \"Just relax into me, okay.\"</p>\n<p>Stiles <em>tries.</em> He does. But the thoughts are still coming, thick and fast. He'll die in the past and his dad won't ever know, there'll be a John Doe in the morgue for a decade, and his dad won't know to connect the body with his <em>missing son</em>.</p>\n<p>\"C'mon. Give me your name,\" the voice says.</p>\n<p>\"Stiles,\" Stiles manages.</p>\n<p>\"What's a Stiles?\"</p>\n<p>Stiles just manages a wheeze of a laugh.</p>\n<p>\"I need you to breathe in for the count of five. Breathe deep enough. I'll know if you're not. Just to the count of five. One, two, three, four, five—\"</p>\n<p>Whoever has hold of him has dealt with panic attacks before, because they coach him through calming down, and Stiles is less of a gibbering mess after a few minutes. The guy helps him up as far as the bench.</p>\n<p>\"Sorry,\" Stiles wheezes at him. \"Sorry. Just. You ever have the floor pulled out right from under you, all of a sudden? When nothing's what you thought it was?\"</p>\n<p>He looks at the guy who managed to calm him down, and Stiles can see him properly now the world isn't spinning. The guy reminds Stiles sharply of Scott, for some weird reason. Short dark hair, and eyes that Stiles can't tell if they're green or brown, wearing a grey t-shirt, dark pants, Nike sneakers and a green plaid shirt.</p>\n<p>Well, Stiles can at least trust the plaid.</p>\n<p>\"Yeah,\" the guy says, smiling remorsefully, rubbing the back of his neck self-consciously with one hand. \"Yeah, you could say that.\"</p>\n<p>\"Well, uh. Thanks for the rescue. I'm cool now.\" Stiles gets up to leave, to get out of there, but the guy smiles at him, warm and gentle, and just for a second Stiles can't remember why he was leaving. There's something pleasant about what that smile does to the guy's face.</p>\n<p>\"Come play hooky with me,\" the guy says. \"There's no point going back to the class you busted out from. Some fresh air would do you good.\" He jerks his head in the direction of the door that leads outside to the lacrosse pitch.</p>\n<p>Well, Stiles can escape from there just as well as anywhere else. He nods.</p>\n<p>\"Cool,\" the guy says, and smiles again.</p>\n<p>They don't really speak once they get out there. The guy slumps into a seat and shades his eyes as they watch the players, and Stiles would probably normally turn the air bright with his babble, but the silence is kind of nice.</p>\n<p>Stiles idly thinks about escaping, and where he's even going to go (Deaton, he decides. Alan Deaton might be in town), when the boy starts talking again.</p>\n<p>\"Ugh, you're a lacrosse person, right?\" the guy says eventually.</p>\n<p>\"I guess,\" Stiles says. \"I played, once.\"</p>\n<p>\"At your last school?\"</p>\n<p>Stiles makes a noncommittal sound, because saying yes or no would be sort of a lie, and he's overly used now to lying <em>without</em> lying. Stupid werewolves with their stupid ability to detect lies. \"I mostly warmed the bench,\" Stiles says, indicating the wooden bench below the bleachers which looks very much like the one Stiles has spent a lot of time wearing a groove into with his ass.</p>\n<p>\"I'm more into basketball,\" the guy says.</p>\n<p>\"More into big balls, are you, huh?\" Stiles asks, snorting under his breath.</p>\n<p>The guy laughs out loud. \"Something like that.\" He shrugs. \"They started putting lacrosse on the game rotation a couple years back. Still don't think it's going to catch on.\"</p>\n<p>Stiles keeps his smirk turned into the field so the guy can't see it. \"Maybe you'll be surprised.\"</p>\n<p>\"Maybe,\" the guy allows.</p>\n<p>The coach on the field starts to blow his whistle, calling them in to a warm-down. That's totally Stiles' cue to leave. But as soon as he turns to make a move for it, the guy leans forward and snatches Stiles' (stolen, oh god) schedule out of his hands. Stiles hadn't even realized that he was still clutching it.</p>\n<p>\"Great,\" the guy says, smiling again. \"We're both in Economics. That's cool. I'll take you.\" Stiles must be showing his confusion, because the guy adds, \"You <em>are</em> new here, right?\"</p>\n<p>\"Yeah,\" Stiles says, because it <em>feels</em> all new. Time travel. <em>Ugh.</em> \"Right.\"</p>\n<p>\"Okay,\" the guy says, and jerks his head in the direction of the school. \"I'll show you the best way.\"</p>\n<p>Stiles smiles weakly. \"Great.\"</p>\n<p>#</p>\n<p>Whoever the guy is, he's popular, because quite a few guys nod at him as he goes. A few girls, too. The guy waves back, and weaves through the crowds with an easy languidness. The crowd parts easily for him. Yeah, he's definitely popular.</p>\n<p>\"Coach Appleby takes the class,\" the guy explains as they approach room 104, Stiles' usual Economics room. Some things apparently never change. \"He's the basketball coach. Do you play?\"</p>\n<p>A round-faced beaming man appears at the doorway and looks between them both. \"I could always do with some fresh talent.\" His gaze slides to Stiles. \"He's nearly as tall as you, Star.\"</p>\n<p>The guy, <em>Star,</em> actually blushes a little. \"That he is, Coach. This is Stiles. He's new.\"</p>\n<p>\"What the hell is a Stiles?\" the Coach asks. Even Star looks at him oddly, so Stiles fidgets.</p>\n<p>\"My real name's unpronounceable. Polish. There's Zs in it,\" Stiles explains. \"Stiles is short for Stilinski.\" He realizes his mistake as soon as he says it. Beacon Hills occupies a lot of space, relatively, but apart from that, it's kinda small. His dad's entire law force career has been in this town.</p>\n<p>Well, maybe no one will make the connection.</p>\n<p>\"Like the Deputy,\" Coach Appleby says. Damn.</p>\n<p>\"Yeah,\" Stiles says, and then a cold feeling drops into the pit of his stomach, because there's no <em>way</em>.</p>\n<p>But then, Stiles has read up on all kinds of theories. He definitely had a huge Sci-Fi phase when he was eleven and wanted to be an astronaut. Time travel, if theoretically possible, should have <em>already happened.</em> Past events are immutable. It's only the future that can change.</p>\n<p>If Stiles has travelled into the past, it's a fixed event. It's already <em>happened</em>, even before the botched spell (because really, Stiles doesn’t have many other theories) sent him back.</p>\n<p>\"Exactly like the Deputy,\" Stiles finds himself saying, almost on auto-pilot.</p>\n<p>He took his name from his cool older cousin. A cousin that came and stayed for a few days and they <em>never saw him again.</em></p>\n<p>A cousin called Stiles.</p>\n<p>\"He's my uncle,\" Stiles finishes, trying his best not to shiver.</p>\n<p>Because oh my <em>god.</em> He's definitely time-travelled. He <em>had</em> to time travel. Because it already happened, and now it's happen<em>ing</em>, and he needs to calm down before he has another panic attack. Yup.</p>\n<p>\"That's cool,\" Star says. \"C'mon. We can share a desk. You won't have the textbook yet.\"</p>\n<p>The desk Star steers them to is in the middle of the room. Stiles likes the middle. It's a good view of everything that's going on, but not too far back that he forgets the teachers are usually watching out for him to misbehave.</p>\n<p>\"Appleby's a good teacher,\" Star says, passing Stiles a pen from his own bag and a few sheets of white, unicorn-free paper. Stiles would <em>kiss</em> Star in gratitude if it wasn't too weird. Maybe he <em>knows</em> Star in the future.</p>\n<p>He wonders idly how far in the past he is. The school looks unchanged. They added the new changing rooms in 2001, and they seemed like the ones Stiles is used to, except they had seemed awfully clean. So maybe it's early 2000s.</p>\n<p>Maybe Stiles can remember a string of lottery numbers, and let his dad have them. Hmm. The idea that there might be good things about this time travel thing cheer him up a little. \"Is he strict?\"</p>\n<p>\"Not in the classroom,\" Star explains. \"It's weird having your teacher being your coach, though.\"</p>\n<p>\"I know that feel,\" Stiles says, and freezes up.</p>\n<p>Just <em>what</em> year in the 2000s is it? Could his Mom be alive? For a moment, the hope is painful, even though he knows it's ridiculous, because his Mom would have been in the house at that time of the morning, shouting him awake. Then again, <em>Stiles </em>will have been in the house. Young Stiles. Stiles who isn't called Stiles yet, and his Mom might have been upstairs with him, or—</p>\n<p>Star's written the date. Monday 7th November, 2004.</p>\n<p>Nope. His Mom's dead. Ugh. Stiles feels the pain of it all over again, just for a moment, and shudders with it.</p>\n<p>\"You talk weird,\" Star tells him, and then narrows his eyes. \"Are you okay?\"</p>\n<p>Stiles can't find the right words to say <em>no, my Mom's dead and it feels like it's just happened all over again</em>, so he stretches out his hand uncomfortably, and Star inhales a little in commiseration.</p>\n<p>\"Looks deep,\" he says, and touches Stiles' palm gingerly with two fingers.</p>\n<p>It's probably Stiles' imagination, but it hurts a little less. Maybe stretching it out has done some good.</p>\n<p>\"Cut it earlier,\" Stiles says. \"Or <em>later,</em>\" he mutters to himself. Star looks confused.</p>\n<p>\"I'll tell Appleby after class that your handwriting might be a bit weird for the next few weeks,\" Star tells him. \"He's a good guy. If you ignore the fact he calls me star or champ instead of my actual name.\"</p>\n<p>\"Wait. Star isn't your name?\" Stiles blinks.</p>\n<p>Star, or… whoever the guy actually is… smiles widely. \"No. It's—\"</p>\n<p>\"When you've finished chatting, guys, I do actually have a class to run,\" Appleby yells from the front of the class.</p>\n<p>\"<em>Later,</em>\" the guy mouths.</p>\n<p>\"<em>Yeah,</em>\" Stiles silently says back, omitting the part where he's going to try and escape the class – and the guy – so he can go see if he can find Deaton.</p>\n<p>#</p>\n<p>Somehow, Stiles <em>does</em> manage to make it out of there before Star – whoever the hell he is – shoehorns him into another class he shouldn't actually be in.</p>\n<p>He slips out of a side-door which hasn't been alarmed yet at this point in time (Stiles may or may not have been the <em>reason</em> that particular door ends up having to be alarmed, but he'll never confirm that particular rumor) and runs for the Jeep.</p>\n<p>At least the town hasn't changed too much over the last eight or so years. Stiles pulls up in the parking lot of the Beacon Hills Animal Clinic. The signs are all the same, and DEATON. A. DVM is printed neatly at the bottom of the door. The only other car in the lot is a sleek black Camaro, which Stiles frowns at dubiously.</p>\n<p>Even more so when the license plate is a match to Derek's old car.</p>\n<p>He's totally not in the mood to deal with Derek Hale today.</p>\n<p>Still, it's not like Stiles has many options. He needs to talk to Deaton. He's his best hope. So he pushes through into the vet's, and sighs when the reception room's empty.</p>\n<p>There's a light in the back, though, so Stiles just goes on through, lifting up the mountain ash gate and closing it carefully behind him.</p>\n<p>He walks through, and two faces look at him: one very familiar, one not so much.</p>\n<p>\"You shouldn't be through here, son,\" Alan Deaton says. He looks <em>identical </em>to how Stiles remembers him<em>.</em> The dude ages well. Stiles will tell him so. If he ever gets back to the present.</p>\n<p>Well. Worst comes to worst, and Stiles could just <em>live</em> his way back to the present. That would kind of suck, but it was better than inevitable death.</p>\n<p>\"It's an emergency,\" Stiles says.</p>\n<p>Deaton's eyebrows raise high. \"Do you have an animal for me to treat?\"</p>\n<p>\"No,\" Stiles says, \"but—\"</p>\n<p>Deaton sighs. \"Do you even know who you're <em>interrupting</em>, here?\"</p>\n<p>The woman standing with Deaton is beautiful; glossy brown hair, red and white tunic falling to her thighs, and her green eyes are astute, calculating. Stiles remembers the Camaro in the parking lot, and knows exactly who he's interrupting.</p>\n<p>\"Alpha Hale,\" Stiles says, jerking his head in her direction. Talia Hale. Derek's <em>Mom.</em> She's a knockout. She'd kinda <em>have</em> to be. Derek, Laura and Cora did not fall very far at <em>all</em> away from that genetic tree. \"My name's Stiles. Stiles Stilinski.\"</p>\n<p>Deaton draws back from the table in surprise, but Talia just smiles and nods in greeting. She's completely unruffled, but Stiles guesses she can smell his humanity. A mere human boy would be no threat to an Alpha werewolf.</p>\n<p>\"Then you'll know this is important—\" Deaton starts, trying to regain his composure. Huh. He might look the same, but he's not quite the ultimate Zen master of Stiles' time.</p>\n<p>\"<em>Yes,</em>\" Stiles says, shuffling impatiently, \"but I seem to have time travelled a certain chunk of years back to the past, and I'd <em>really</em> like not to step on any butterflies, if you get my drift.\" He eyeballs Talia warily. \"Your daughter mentioned time-travel as a possible side-effect of doing some sort of vision-spell incorrectly?\"</p>\n<p>\"My daughter,\" Talia repeats, and the corner of her mouth lifts. \"Sounds a lot like something Laura would do.\"</p>\n<p>Stiles opens his mouth to correct it to Cora, and then snaps his mouth shut. \"<em>Spoilers,</em>\" he mutters eventually.</p>\n<p>Talia nods, and looks across at Deaton. \"This young man's problems are bigger than mine, Alan.\" She picks up a small file, casually flipping it closed, and Stiles can't resist the spike of curiosity to see what it is she's hiding. \"Time travel is more of an immediate problem than a restless Hunter pack and an impulsive Alpha meet-up.\"</p>\n<p>\"I'll see you later,\" Deaton promises her. He looks at Stiles. \"I'll lead Mrs. Hale out, and then you and I will talk.\"</p>\n<p>\"Yeah,\" Stiles says, shoving his hands in his pockets and leaning back against one of Deaton's steel counters. \"Wait. Impulsive Alphas? <em>Deucalion?</em> Crap. <em>Crap. </em>No—this isn't—\"</p>\n<p>Deaton's hand clamps down across Stiles' mouth, and he glares heavily.</p>\n<p>\"If you want my help,\" Deaton tells him, \"then you'll stay here and <em>shut the hell up.</em>\"</p>\n<p>Stiles pantomimes zipping his mouth closed.</p>\n<p>Deaton looks exasperated, but that's one of his expressions that Stiles is more familiar with. It serves him right. Anyone who surrounds themselves willingly with teenagers or werewolves deserves to be annoyed every now and again.</p>\n<p>Stiles stays quiet until Deaton comes back into the room and folds his arms menacingly.</p>\n<p>\"I could totally stop so many bad things,\" Stiles blurts out, his mind racing. Laura. The <em>fire.</em> It's too late for his own Mom, but the idea of fucking up Kate Argent before she even gets <em>close</em> to burning a whole family alive is ridiculously alluring.</p>\n<p>And Peter. Ooh. The things he could do to Peter Hale.</p>\n<p>\"You could. Or you could make it worse,\" Deaton says, flatly. \"If time travel is possible, don't you think more people would do it?\"</p>\n<p>\"Well, it <em>is</em> possible,\" Stiles automatically defends, spreading his arms. \"Look, see, me. Here I am. And if you go to Deputy Stilinski's house later tonight, you'll find me too, still probably in single digits. Wait, if I meet myself will it cause a rip in space and time?\"</p>\n<p>Deaton rolls his eyes, signalling that Stiles is being stupid.</p>\n<p>\"You've spent too much time with the Hales,\" Stiles says.</p>\n<p>\"More people would time travel if it was a good thing,\" Deaton says. \"Believe me. The reason our past isn't full of people trying to save the day, or turn things to their own advantage, is that it's usually not worth it. The best you can do is try and keep the timeline as pure as possible.\"</p>\n<p>Stiles squints. \"So I <em>can</em> change things by being here?\"</p>\n<p>\"It's possible,\" Deaton allows, slowly. \"Can you imagine your home time period worse than it is now?\"</p>\n<p>\"I can easily imagine it being better,\" Stiles says, and then thinks of his father, dead. He thinks of everyone knowing about werewolves, and the hunters spreading fear, eradicating werewolves. Of the war that would erupt, human versus werewolf, dystopian paranoia at its finest. \"Yeah,\" he admits, after a few seconds. \"Yeah, it could be worse.\"</p>\n<p>\"And that's the gamble of time travel,\" Deaton says. \"Whatever you do, you have to <em>not </em>change things. That's your main job.\"</p>\n<p>Stiles eyeballs him warily. \"For how long?\"</p>\n<p>\"If it's the spell I'm thinking of, it should wear off in a short amount of time,\" Deaton offers. \"Was your blood involved?\"</p>\n<p>Stiles thinks about it. \"I cut my hand with a silver knife.\" Stiles holds up his palm. \"While cutting rose thorns. But I was nowhere near the spell when they did it.\"</p>\n<p>\"If your… associates… used that knife without cleaning it, it could be why you were involved.\"</p>\n<p>\"<em>Awesome,</em>\" Stiles says, shaking his head. \"How long until it… wears off? And by wears off I assume I get sent back home, right, 'cause—\"</p>\n<p>\"Yes, you should automatically return to where you came from,\" Deaton says. \"But as for the length of time you'll be here…\" He shrugs. \"The spell is simple. Its poor side effects are not well documented. It could be a week, it could be a year.\" He frowns pensively. \"Do you have. um. anywhere you know you can lay low for a while?\"</p>\n<p>\"Yeah, my dad's,\" Stiles says, rubbing the back of his neck.</p>\n<p>Deaton's frown deepens.</p>\n<p>\"I think it happened before,\" Stiles offers, quickly. \"I remember an older cousin with my name coming to stay for a while. Escaping an abusive Uncle in Arizona.\"</p>\n<p>\"Ah, a fixed point location,\" Deaton says, sounding relieved. \"Well, if you stick to the rule of trying not to change anything, and don't let anyone else know you're from the future, everything should be a-OK. Just let the magic take its course.\"</p>\n<p>\"Great,\" Stiles says.</p>\n<p>Deaton bundles him out of his office soon after, even though Stiles tries to get more information out of him, but that's pretty much par for the course of the enigmatic emissary, so Stiles slinks over to his Jeep, and—</p>\n<p>—yeah, he's in more trouble out <em>here.</em></p>\n<p>Because the Jeep has a new parking lot friend, and it's not the Hale Camaro.</p>\n<p>It's a patrol car.</p>\n<p>And its driver, climbing out of the said car and glaring at the Jeep with horror, would be one <em>Deputy</em> Stilinski.</p>\n<p>\n<em>Great.</em>\n</p>\n<p>Stiles knows that a great defence is an amazing offence, so he goes with the best weapon he has in his arsenal.</p>\n<p>His voice.</p>\n<p>\"Hey, Uncle Stilinski,\" Stiles says, holding his wrists out submissively. Stiles learnt it as part of his understanding <em>werewolf</em> psychology, but it works on humans too – bare the most vulnerable parts of your body, and you appear more trustworthy. \"It's me. Stiles. Ernest's oldest kid. Uncle Ernie? You remember Uncle Ernie. Smells of sherry. Constantly drunk as a skunk. Mo—\" No, not <em>Mom,</em> Stiles. \"I wrote to Auntie Emmaline earlier in the Spring? About coming down to get away from his handsy new wife for a week or two?\"</p>\n<p>\"Excuse me?\" <em>Deputy </em>JohnStilinski says, frowning heavily, pursing his lips. Yeah, Stiles isn't winning at the moment.</p>\n<p>\"Sorry I took the Jeep out, but you weren't home, and I had a couple of errands to run first,\" Stiles says, edging closer, beaming widely. Better to appear an idiot rather than a threat. \"I was just on way to the Sheriff Department to find you. C'mon, I have the keys. I wouldn't where to get the keys or find the Jeep if Auntie Em hadn't told me where to grab them. Here. I can hand them back if it's a problem. I know she didn't write back for a few months, but she said any time, so I just figured—\"</p>\n<p>\"Oh, kid,\" John sighs, shaking his head, and his eyes moisten up a little. \"Jesus. We sent a note to Ernie, but—\"</p>\n<p>Stiles lets his face fall. \"What? What note? What happened? Is Aunty— Is she <em>okay</em>?\"</p>\n<p>Behind John, his partner shakes her head. Stiles lets his lower lip wobble theatrically (he's kind of a master of getting out of trouble, or he was until stupid supernatural lie detectors started flooding his life) and he lets his shoulders slump.</p>\n<p>\"I'm sorry to be the one to tell you this,\" John says, in a tense, tight voice. \"But your Aunt passed away a few weeks ago.\"</p>\n<p>\"A few <em>weeks</em>—\" Stiles doesn't even have to fake the shock. A few weeks. He hadn't remembered his dad coming back to work so quickly after his mom's death. \"God, I'm sorry. I'm really. I'm so sorry. I knew she was sick, of course, she wrote to me from the hospital. I guess I should have known she wouldn't say she was <em>that</em> ill—\" He slumps against the Jeep, and shakes his head slowly.</p>\n<p>\"You look a lot like her, kid,\" John says, giving Stiles an awkward pat on his shoulder. \"Stiles, did you say?\"</p>\n<p>Stiles nods his head. \"Yeah. I. uh. I've been by the school, got myself signed up there as a probationary student.\" He passes over his schedule to John, who nods at it, but his eyebrows are still furrowed. He's not entirely buying the full story.</p>\n<p>\"You can call my dad, if he picks up,\" Stiles says, and then holds up his injured hand tentatively. \"But I bet you anything he says this cut is <em>all my fault.</em>\" He looks away to the distance. \"Sometimes it feels like it is, but—\"</p>\n<p>\"Hey. <em>Hey.</em>\" His dad is closer now, and the eyebrow furrow has lessened. \"Ernie always was a bit free with his hands. You're safe now, okay?\" He looks up at the sign to Deaton's business. \"What did you need to do with a vet's, huh?\"</p>\n<p>Stiles opens his mouth to make up a lie, but the door opens, and Deaton comes out, heading straight for Stiles.</p>\n<p>\"I called your concerns through to a friend of mine at Maricopa County Animal Care,\" Deaton says, directly to Stiles, his gaze not flinching. \"They told me they visited your father and took away the three dogs with him. You were right. There were substantial injuries.\"</p>\n<p>\"Did they arrest him?\" Stiles asks, playing along.</p>\n<p>\"No,\" Deaton says. \"I'm afraid your father placed the blame on you.\"</p>\n<p>\"Great,\" Stiles says. \"<em>Great.</em>\" He looks warily at John. \"Guess you have to follow up on APBs from other states, huh?\"</p>\n<p>\"You're a minor,\" Deaton assures him. \"My colleague says there's been nothing but an alert put out to say you're missing.\"</p>\n<p>\"I'm sorry for causing all this trouble,\" Stiles says, looking between Deaton and his dad. \"I'd better go. Face the music.\"</p>\n<p>\"No,\" John says, mouth pushed into a line. \"No, if your Aunt promised you safe haven, that's what you're going to get. I'll look into this situation, see if there's anything I can do. But for now…\" He looks at Stiles coolly. \"You can come with me. We do have a spare room. I'll send someone back for the Jeep.\"</p>\n<p>Stiles nods, and hands over the keys instantly.</p>\n<p>\"It's nice he's letting you stay,\" his dad's partner whispers as she lets him into the back of the patrol car. Stiles catches a glimpse of John's calculating expression.</p>\n<p>\"Yeah,\" Stiles agrees, smiling at her. He knows the truth, because Stiles knows exactly where he got his own highly observational, manipulative personality from, and it wasn't his Mom.</p>\n<p>Stiles' dad wants to keep an eye on him, and keeping Stiles close is the best option he has.</p>\n<p>Stiles buckles his seatbelt, lies back in the seat, and then the radio chirps.</p>\n<p>\"Got a 10-57 at Barker Street,\" the dispatcher's voice calls down the radio.</p>\n<p>John sighs, audibly. \"Copy that. Got a passenger, is there anyone closer?\"</p>\n<p>\"Negative,\" the dispatcher responds.</p>\n<p>\"You could drop me off at the school,\" Stiles says, because Barker Street's beyond that area of the town. \"I'll stay outside the school office until you can come get me afterwards so I don't get into any more trouble?\"</p>\n<p>John still takes a second to respond. \"We're on our way, 5 minutes ETA,\" he tells dispatch, and guns the engine. Stiles tries not to make his celebration air punch too visible, but his dad notices.</p>\n<p>He stumbles out of the car quickly when John drives him right up to the school steps, and stays there until he goes in. Stiles tries not to roll his eyes, but the impulse is hard to resist. Seems like this whole thing is a nightmare, not a trip through <em>time.</em></p>\n<p>At least things are a little easier when he turns towards Administration, because there's no <em>way</em> John will go easy on him if he doesn't <em>try</em> to maintain this weird fiction which no one should really believe, and although he's ready to start bullshitting his way into the school he doesn't have to.</p>\n<p>Because Talia Hale is there, chatting with a woman that Stiles recognizes from photos in the main hallway – the current Principal of Beacon Hills.</p>\n<p>\"I'll have a word with Laura tonight,\" Talia promises the Principal, and then she smiles over in Stiles' direction. \"Mr. Stilinski.\"</p>\n<p>Stiles jerks a wave.</p>\n<p>The Principal looks shocked. \"I was unaware that the Deputy had an adult son?\"</p>\n<p>\"I'm <em>sixteen,</em>\" Stiles protests automatically. \"And. Um. The nephew. From out of state.\"</p>\n<p>\"Mr. Stilinski here—\" Talia starts.</p>\n<p>\"Stiles,\" Stiles intervenes.</p>\n<p>\"<em>Seriously?</em>\" the Principal bursts out. \"Stiles Stilinski? Who would name their kid that.\"</p>\n<p>\"Actually it's… Szczepan,\" Stiles says with a wince. \"Szczepan Stilinski. My grams was Polish, it's a family name, what can you do?\"</p>\n<p>\"Sh— Shche—<em>Stiles, </em>wasn't it?\"</p>\n<p>Stiles nods. \"Just here for a week or two, didn't want to fall behind on my schoolwork, thought you might be kind enough to let me just slide on in?\"</p>\n<p>\"I don't know,\" the Principal says, because it's definitely not normal protocol, and there's a thousand reasons she shouldn't.</p>\n<p>\"Sarah,\" Talia says smoothly, putting her hand on the Principal's shoulder, her fingers curling over the woollen jacket the woman's wearing. The Principal shudders, like Talia's gripping hard. Or… digging her claws in. \"I think it might be a good idea. You have an Exchange program, do you not? It would... keep Mr. Stilinski out of trouble while we have certain… guests in town.\"</p>\n<p>\"On second thoughts, a transfer student for a small period of time might enrich our local community,\" Principal Sarah says, very quickly, smiling fearfully at Talia. The Principal looks over at the curly-haired administrator sitting behind a desk, watching the exchange curiously. \"Barbara, log Mr. Stilinski in. Give him some classes. Get him the new student paperwork.\"</p>\n<p>\"Right away, Principal,\" Barbara chirps, pushing up from her desk and heading for a filing cabinet immediately.</p>\n<p>Stiles looks at Talia gratefully. \"Thanks for the help. Guess you're well known around here.\" He looks back pointedly at Barbara, who squeaks and ducks her head back in the filing cabinet.</p>\n<p>\"As is your family,\" Talia says. \"You look much like the Stilinski boy of our time,\" Talia murmurs. Stiles looks at her so suddenly it must be confirmation, because her smile turns sad. \"Your mother was a wonderful woman, Stiles. We're all less for having lost her.\"</p>\n<p>\"And more for having known her,\" Stiles automatically says, because it bubbles out of him before he can even formulate the words. Talia's smile turns glorious.</p>\n<p>\"She'd be proud of you,\" she murmurs, kissing him on the cheek and turning swiftly away.</p>\n<p>Stiles does his best to pretend he didn't tear up a tiny little bit, and turns back to Barbara.</p>\n<p>Signing up for a new school, especially when Stiles has no official paperwork or transcripts, takes a lot of time. It's nearly the end of lunch when they're finally done. Barbara's a sweetheart, though, and shares half of her dry cheese sandwiches with him when his stomach starts gurgling, and by the time the bell rings for the last two periods, Stiles is officially an honorary member of Beacon Hills High School. He charms Barbara into a promise that he'll bring his transcripts and copies of his certificates when he gets them, and promises to turn up to tomorrow lunchtime's testing to double-check his literary and mathematical abilities in the meantime, and then he's let go.</p>\n<p>Without Talia Hale's 'assistance' (read: terrorising the Principal with her <em>claws,</em> and Stiles really needs to read up on what happens to her when he gets back because <em>man</em> it would be handy if the Principal of Beacon Hills High knew about werewolves) it wouldn't have been so easy. Stiles needs to thank her.</p>\n<p>While she's still alive.</p>\n<p>The thought sinks heavy into his stomach as he makes his way to his last class, a double period American History class. Talia Hale is <em>incredible.</em> She's powerful, beautiful, and she just has this <em>presence</em> that makes Stiles feel safe. And in his time, she's gone. Just like his Mom.</p>\n<p>When Stiles gets back to his own time, there's going to be a hole where Derek's Mom should be, the same size as the one where Stiles' Mom should be. The future's already changed to be a little sadder. Stiles <em>can't</em> make it any worse.</p>\n<p>The History class isn't too bad. Stiles can remember most of it – modules must change, because this is stuff he studied last year – so he isn't bothered too much until a section on the Harlem Resistance, and as a result, the teacher keeps him back after the bell goes.</p>\n<p>Which is kind of nice, because the teacher is earnest, and has already pulled out a pile of old textbooks for Stiles to look at, to catch up with the reading. But at the same time, John might be ready and waiting for him now at the school office, and he really, <em>really</em> needs him not to wait there for too long. There'll be a margin of time – his dad will have to pick, well, Szczepan up first from his elementary school (which is a cruel, cruel school, especially when you go by <em>Szczepan</em>) – but Stiles is on a deadline if he wants to keep the past intact.</p>\n<p>When the teacher finally lets him go, Stiles makes a run for it, seven (yeah, the teacher was enthusiastic) textbooks in hand.</p>\n<p>And runs straight into a whole crowd of boys, landing firmly on his ass, books <em>everywhere.</em></p>\n<p>To top it off, a basketball soon follows, smacking into his side.</p>\n<p>\"This effectively summarises my <em>day,</em>\" Stiles whines. \"If not my <em>life</em>.\"</p>\n<p>There's a familiar chuckle from somewhere in the vicinity of his feet, and Stiles starts to push himself up in time for someone to help him up.</p>\n<p>The same guy that saved him from his panic attack.</p>\n<p>Yup. This is definitely not Stiles' day.</p>\n<p>\"Thanks,\" Stiles mutters, as the guy gestures for his friends to help pick up Stiles' books.</p>\n<p>\"C'mon guys, Stiles is new, let's show a little courtesy,\" the guy commands.</p>\n<p>\"Do you guys mind?\" a voice calls out, from behind them. \"I'm trying to <em>practice.</em>\"</p>\n<p>\"My friend here fell over,\" the guy says, scowling at the girl. She's kinda pretty, long brown hair, mole under on eye, bright hazel eyes, high-waist washed-out jeans and a purple and grey shirt that teases an expanse of creamy white skin. \"You seriously gonna rag on someone for having a problem with gravity?\"</p>\n<p>The girl's mouth drops a little. \"You were messing around before. Just cut it out. Go play basketball outside, or something.\"</p>\n<p>\"Whatever you say, princess,\" the guy says, sourly, turning back with a grimace in Stiles' direction. The girl makes an annoyed noise, and sweeps back into the room she came from. \"Don't worry about her. All the musicians around this school are stuck-up weirdoes.\" He raises his voice. \"Some of them have bigger egos than the lacrosse players.\"</p>\n<p>There's a sound of clattering within the music room. She definitely heard that.</p>\n<p>\"C'mon guys, let's go outside,\" the guy says, picking up the basketball, and twirling it effortlessly. It's obvious why the basketball coach <em>does</em> call him Star. \"You want to come with?\"</p>\n<p>\"Maybe another time,\" Stiles lies. The guy tilts his head a little, reminding him oddly again of Scott. \"Got a couple more things to chase up before I go home.\"</p>\n<p>\"I'll probably see you tomorrow, then,\" the guy says, smiling wide, before jogging off with his friends. Stiles hangs back, and because he's not a terrible person, pokes his head into the music room.</p>\n<p>\"Hey there,\" Stiles calls. \"Sorry for making a noise. I'm kinda naturally a klutz.\"</p>\n<p>The girl huffs, but sends him a smile from behind her 'cello. \"Thanks for coming in and apologizing,\" she says. \"Not many of them do.\" She looks back at her music stand, frowning at the music. \"Especially not Derek Hale and his merry band of jocks.\"</p>\n<p>\"Especially not <em>who</em> now?\" Stiles breathes, suddenly horrified.</p>\n<p>\"The guy in the green shirt? The dark hair? Derek Hale.\" The girl tosses her hair, and positions her fingers on the fingerboard, testing out her vibrato with one finger without dragging the bow across the strings for a moment. She side-eyes Stiles warily. \"I'd stay away from him, if I were you.\"</p>\n<p>\"I think it's too late for that,\" Stiles says, weakly. The girl exhales, and drags her bow against the strings, filling the air with a rich melodious sound. There's a tight feeling in the base of his stomach, a worry that feels a lot like an incoming migraine, and he squints at her. \"What's your name?\"</p>\n<p>\"I'm trying to practice,\" the girl says, frowning at him.</p>\n<p>\"I'm Stiles. Stilinski. Nephew of Deputy Stilinski.\"</p>\n<p>\"I know him. Nice guy.\" The girl looks back at her music. \"Can you leave, now? I really gotta practice.\"</p>\n<p>\"Sure,\" Stiles says. \"Just…\" And he <em>has</em> to know. \"Are you Paige?\" The girl's head snapped back.</p>\n<p>\"Did Hale tell you that? Did he tell you to mess with me, huh?\"</p>\n<p>Stiles holds his hands up, and backs off. \"No. He told me nothing. I'm—going to go now. Good luck practicing! You sound awesome.\"</p>\n<p>Before she can say anything else, Stiles flees out of the room, and doubles over in the hall outside, clutching onto the History textbooks like they're a lifeline.</p>\n<p>\"Oh my god. Oh my <em>god.</em>\"</p>\n<p>Stiles forces himself to take a deep breath, and then another, because he can't afford to have a panic attack.</p>\n<p>So much for coming back in time and not changing anything.</p>\n<p>If Peter's right about the story he told of Derek and Paige's first meeting, the meeting where they probably fell in love, then…</p>\n<p>…Stiles has just ruined <em>everything.</em></p>\n<p>#</p>\n<p>He runs to the front of the school so that he doesn't at least ruin <em>absolutely</em> everything. Deputy Stilinski's waiting for him, and in the back of the car is a mop-haired tiny terror, nose buried in a book about dinosaurs.</p>\n<p>Stiles wishes he could warn John not to buy too many dinosaur books – soon he'll turn to engines. His attention disorder's well documented by now, but his dad isn't as used to Stiles' shifting interests as his Mom was.</p>\n<p>\"Nice pile of books,\" John says.</p>\n<p>Stiles nods awkwardly, and tries not to feel too weird when his dad shifts little Stiles (and not so little, really, Stiles is nine at this point in time and already gangly and lank) to the front of the car, shoving Stiles in the back.</p>\n<p>Stiles doesn't know if it's because he <em>remembers</em> this time from the other side (he thinks he does, although specifics are blurry) or if he's unfairly using his knowledge of the future, but he fits into the family dynamic effortlessly. When John tries to pick up ready meals from the shops, Stiles makes him buy fresh food, promising to make bolognaise, insisting he can cook. He even picks up fruit and ingredients to make a dessert, telling his dad (something he researches a couple of years later in this time) about how kids actually need the energy puddings give them, and that might be when he wins John over to the scam. Because he looks at him a little strangely in the fresh produce section, telling Stiles he sounds a lot like his Aunt.</p>\n<p>Maybe it's this moment that gives Stiles some time alone later, while he's cooking, because John trusts him enough to leave him alone for a good half an hour.</p>\n<p>Stiles uses the time to chop vegetables, and phone Deaton, because the guy's a workaholic and will probably be in his office. He finds the number in the phonebook, and tucks the phone under one ear as he chops an onion.</p>\n<p>\"Alan Deaton,\" Deaton's voice says coolly as it connects.</p>\n<p>\"It's Stiles Stilinski, <em>don't hang up,</em>\" Stiles says, rushing through the words.</p>\n<p>There's a sigh from the other end. \"I presume this is an emergency?\"</p>\n<p>\"Kind of,\" Stiles says. \"Have you seen the movie <em>Back to the Future</em>?\"</p>\n<p>\"If you've called just to discuss your film preferences—\"</p>\n<p>Stiles doesn't let Deaton finish that threat. \"Nope. But I just interrupted a beautiful boy and girl couple who I'm pretty sure were supposed to fall in love?\"</p>\n<p>Deaton sighs again. Loudly. \"Fix it,\" is what he says.</p>\n<p>\"<em>How</em>?\" Stiles demands.</p>\n<p>\"Use your brain,\" Deaton says. \"I presume you have one, considering the impressed phonecall I got from Talia Hale at how well you'd insinuated yourself into school. Apparently her son spoke of you, quite a lot.\"</p>\n<p>Stiles lets out a groan.</p>\n<p>\"Fix it, Mr. Stilinski,\" Deaton says. \"Keep the time line intact.\"</p>\n<p>He hangs the phone up just in time for it to start ringing again. Stiles pulls a suspicious face at it, but pulls it up. \"Stilinski residence, Stiles speaking—\"</p>\n<p>A polite female voice answers. \"Could I speak to Deputy Stilinski, please? It's Yvonne from the station.\"</p>\n<p>\"Yup, I'll just get him for you.\" Stiles covers the receiver, leans around the corner and yells for John. \"D— Uh—Deputy Stilinski! Phone for you!\"</p>\n<p>\"Thanks,\" John answers, appearing at the top of the stairs. He takes the phone and firmly closes the kitchen door so Stiles can't hear.</p>\n<p>Ugh. Sneaky. Stiles slinks back to the burner, and fries up some onions until they soft and caramelized, before starting to brown the ground beef. He sings a little under his breath, because he hasn't burned anything yet. He gives the simmering rice a stir for good luck, and adds some of the softer vegetables when he gets to the third verse of his song. His Mom always timed her cooking with music, and Stiles has never gotten out of the habit. Which led to hilarity that summer term he took Home Economics classes, and also led to him attending a Musical Theatre summer camp one summer. His dad hadn't stopped laughing for <em>weeks,</em> but he'd been pretty impressed at the end when he came to see Stiles in a camp performance of <em>Blood Brothers.</em></p>\n<p>The door clicks open, and Stiles doesn't even flinch. He never does. He always knows when it's his dad, because his badge reflection catches on the door handle in an arc of golden light.</p>\n<p>\"That was Yvonne from the station,\" John says, slowly. \"They contacted the department in Fountain Hills.\"</p>\n<p>Stiles tries not to tense, because that's where his Uncle Ernie lives, as far as any of them actually knows. No one in their family <em>cares</em> where Uncle Ernie is, because he's a drunk letch.</p>\n<p>\"Yvonne patched me through directly to Detective Ennis,\" John continues, and Stiles <em>really</em> has to fight not to tense. Ennis. The dead Alpha. The Alpha who's going to try and turn Paige in a few days and break Derek's heart. Time is horribly confusing when it isn't in chronological order.</p>\n<p>Stiles doesn't tense, but he does turn around, and his dad seems to translate his worry about being caught out into something else, because he comes over and turns the heat off the burners and tugs Stiles over to a seat. \"They saw your house, son. It's a… Ennis said she wouldn't raise a <em>rat</em> there.\"</p>\n<p>\"It's been pretty bad,\" Stiles mumbles, hating to voice the lie. His mind's racing. Ennis, but a <em>she.</em> As a <em>Detective.</em> Maybe Ennis had human relatives.</p>\n<p>Talia Hale or Alan Deaton must have used their influence to pull some strings, to give Stiles' cover some actual credence. To help him keep the timeline pure.</p>\n<p>Even though Stiles already busted it a little, but it's okay. He's going to fix it.</p>\n<p>Somehow.</p>\n<p>\"Your dad's missing, but there are signs it was only last night. We're going to keep an eye out for him. But there was an awful <em>lot</em> of blood in the house.\" John grabs onto Stiles' hand, and he looks at Stiles earnestly. \"If he hurt you more than just your palm, you can tell me.\"</p>\n<p>\"It was just my palm this time,\" Stiles says, solemnly.</p>\n<p>John flinches a little, obviously imagining all sorts of terrible things attached to that <em>this time.</em> \"Ennis has faxed over some of your documents, which I'll copy on over to the school tomorrow,\" his dad continues, because that's what happens when he's confronted with horrible things – he sticks to the business at hand. Those documents will be forgeries. Deaton and Talia Hale have <em>connections, </em>seriously.</p>\n<p>\"You're safe with us for a while,\" John says, firm and strong. \"As my wife promised, you'll always have a home with us here. Did you tell your dad where you were going?\"</p>\n<p>This isn't a lie. \"No,\" Stiles says, looking his dad straight in the eye, not flinching. \"He never even knew I wrote to M— Auntie Em. I don't even think Ernie knows I <em>can</em> write.\" Also true. \"I'm sorry I didn't call you, but I just had to get out of where I was. Before I knew it, I was here.\" Also kind of true.</p>\n<p>\"I'll let you finish up in here,\" John says, \"while I get my son cleaned up and sorted. It smells <em>amazing.</em> You need a hand?\"</p>\n<p>\"I got it,\" Stiles says. \"Thanks for not kicking me out.\"</p>\n<p>John snorts. \"You're <em>family</em>, boy. Doesn't take a genius cop to figure it out. You're the mirror image of my own son.\"</p>\n<p>Stiles tries not to laugh. \"Bet little Szczepan's a handsome little tyke then, huh?\"</p>\n<p>\"He's something, all right.\" John shakes his head ruefully, and then he looks curious as he gets to his feet. \"That was flawless pronunciation, Stiles.\"</p>\n<p>\"Your brother might not have contacted you much, Mr. Stilinski,\" Stiles says, as carefully as he can, \"but he stuck to some traditions.\"</p>\n<p>\"Huh,\" John says, drumming the doorframe speculatively. \"What name did he lumber you with?\"</p>\n<p>Stiles does almost panic then, and drop his cover, but he <em>did </em>spend forty-nine hours straight on an Adderall bender once researching names even more unpronounceable than his own. \"Wienczyslaw,\" Stiles says, hoping his drooping expression sells it well enough.</p>\n<p>John winces. \"Ouch.\"</p>\n<p>\"Yup,\" Stiles says. \"See why I prefer Stiles.\"</p>\n<p>\"<em>Definitely.</em>\"</p>\n<p>It doesn't seem like long before Stiles is serving up dinner to John and to his younger self. This part of the lie is so much easier, because Stiles actually finds himself remembering chunks of it, and it's kind of weird. He can remember just how <em>much</em> he liked that cousin Stiles listened to all of his rambling, and gave him facts in return.</p>\n<p>\"Houseflies only hum in the key of F,\" Stiles tells his younger self at one part in the conversation, and little Szczepan's face twists into the widest smile he <em>knows</em> his younger self has managed since his Mom's death.</p>\n<p>Then he knots himself up in his brain for a little while, because Stiles <em>knows</em> this fact, and has known it intimately since his older cousin <em>told</em> him it. So just <em>when did he even learn it.</em> Oh, my god. Stiles is going to give himself the worst migraine ever, he really is.</p>\n<p>\"This is really good,\" John says, rubbing at his stomach at the end of the meal. They've all eaten too much, because the atmosphere is just that comfortable. \"I think I just want to lie here for a few hours.\" \"You can't,\" Szczepan says. \"First, you're not lying down. You can't lie in a chair.\"</p>\n<p>\"You can,\" Stiles tells his younger self. \"It depends on your definition of lying.\" He smiles at the memory of the joke.</p>\n<p>\"Don't enable him,\" John says.</p>\n<p>Stiles nods, and manages to get to his feet even though his stomach is humming a little tune about staying still <em>forever.</em> \"Want a coffee?\"</p>\n<p>\"Please,\" John says, and squints. \"You're family, you know you don't have to <em>do</em> stuff to stay here, right? Not that I don't appreciate it, and yeah, I expect you to <em>contribute</em>, but—\"</p>\n<p>\"It's cool,\" Stiles says. \"I'll do my fair share. I won't go overboard.\" He diligently empties out the coffee filter and puts a new one in, and puts in maybe too many coffee beans, but without his Adderall, he's going to have to rely on caffeine to keep himself as focussed as possible.</p>\n<p>Stupid magic spells.</p>\n<p>After coffee, John orders Szczepan to do his homework, and Stiles' younger self kicks up a fuss until Stiles explains <em>he</em> has homework too, and why don't they sit in the living room and do it together? John looks so <em>grateful</em> that Stiles' stomach creases guiltily. This whole time period, dealing with Stiles on his own, it must have been so <em>hard</em> for his dad, especially with Stiles acting up and trying to find the right medication levels and his panic attacks.</p>\n<p>At least he can pay him back a little by helping out now, for the short time he can.</p>\n<p>He helps his younger self concentrate on his homework using some of the tricks his Mom taught him. He puts some background music on low, and every few minutes he makes them switch places, so Szcepan is moving, and halfway through the session he plays a quick Memory game with his younger self.</p>\n<p>Stiles doesn't realize that John has been watching them until it's Szczepan's bedtime; when John comes back down from making sure little Stiles washed up properly and into bed, he nods at Stiles. \"You're good with him,\" he says. Stiles grins bashfully.</p>\n<p>He stays up a couple of hours longer himself, trying to focus on his own reading, and drinking a couple of mugs of strong coffee. It helps, a little, until he gets distracted making a list of how to get Paige and Derek's star-crossed romance back on trail.</p>\n<p>Moon-crossed romance, actually.</p>\n<p>He feels a little guilty as he's making the list (<em>listen to Paige, see if she's going somewhere and go to the same place; try and switch tables in class – will need their schedules to do that; send notes to each other getting them to meet in the distillery??</em>) because Paige <em>dies</em> and Derek's <em>heart</em> breaks and it feels a little like he's killing Paige himself, but… Deaton's right.</p>\n<p><em>Not</em> keeping the timeline the same could do so much more damage. Stiles is just a teenager. Alan Deaton and Talia Hale are adults. If they both think the timeline needs to be preserved, they're probably right.</p>\n<p>Stiles thinks of his friends lying on the dirt floor, bloodied and dead. He wonders how they would feel if he had the chance to save them, and didn't. Then he wonders how they would feel if saving them meant destroying the world, and he knows they would never be okay with him dooming everyone just to save them.</p>\n<p>Stiles has to put time back on track. It's not his responsibility what follows.</p>\n<p>Yeah, that's definitely guilt bubbling in the bottom of his stomach.</p>\n<p>He has to work fast. He doesn't know when the spell will snap him back home.</p>\n<p>\"Okay, kiddo, you've got school tomorrow,\" John says. Stiles blinks at him blearily, but puts his books down, and lets John give him a brief tour to the spare room and its small ensuite bathroom. \"I put some of my old clothes on the dresser,\" John says. \"Probably a little too big for you, but too small for this old body.\" He pats himself.</p>\n<p>\"You're still <em>plenty</em> young,\" Stiles says, automatically.</p>\n<p>\"Ha, buttering me up,\" John says. \"I'll remember that one for when Szczepan's a teenager.\"</p>\n<p>\"I have a feeling Szczepan's going to be a handful when it comes to mind games,\" Stiles says, remembering the hell he puts his father through with a wince.</p>\n<p>John smiles ruefully. \"Spare toothbrush under the sink, towels on the shelf, I put the keys to the Jeep back on the hook.\" He pats the wall. \"If you need anything else, shout. I'm on an early shift so I'll be taking Szczepan out to the church's Breakfast Club at 7.\"</p>\n<p>\"Thanks,\" Stiles says, and because there aren't any words as to how much it means to see his father's generosity to someone who is basically a total stranger to him, he says it again, \"thanks.\"</p>\n<p>John nods, tersely. \"Good night, son.\"</p>\n<p>It's just a word, just what he calls <em>every</em> guy he comes into contact with whom he suspects of potential misbehavior, but the rush of love for the man that surges through Stiles is almost tangible, and Stiles just <em>misses</em> his dad. His real dad. His future dad, who's been through hell and who just keeps going.</p>\n<p>John closes the door, leaving Stiles alone in the spare room, and Stiles counts John's footprints as he walks away. \"Good night, dad,\" he whispers, and gets ready for bed.</p>\n<p>##</p>\n<p>As soon as he hears John and young Stiles leave the house in the morning, Stiles gets up and puts the first part of his plan into motion.</p>\n<p>Barbara mentioned yesterday that her shift starts at 8am every day, and she's always the first in. But the school opens at 7am for kids to be able to practice – art, music, sports – it always has. Stiles gets dressed in clothes which are ridiculously big, but he doesn't have time to worry about that.</p>\n<p>The Jeep is in the driveway. Stiles climbs in, guns the engine, and finds an envelope on the passenger seat with <em>Stiles</em> written on it. There's a couple of $20 bills inside and a pencil note on the flap. <em>Gas and lunch.</em> His dad is the <em>best.</em></p>\n<p>He wonders for a moment whether when the spell breaks, if he'll go to where he came from, or if the time he's in the past will pass in the future. What will John of the future think, if Stiles doesn't come home?</p>\n<p>He can't think like that. It's twenty after seven now, and he needs to get into the Administration office.</p>\n<p>It's easier than it is than in his time. No keys necessary – Stiles picks the lock with a couple of paperclips the same way he learned how to pick his dad's handcuffs when he was thirteen, and John tried to cuff him to his desk to finish his homework (yeah, young Stiles was a handful.) He manages to find Paige's schedule by raiding the music file, and then he finds Derek's schedule. He photocopies them both on the Xerox machine, which is still the same machine that's in the office in <em>Stiles'</em> time, and also has the same code for free copies, and he's just sneaking out of the office, congratulating himself for a job well done, when he walks straight into someone.</p>\n<p>\"Derek!\" Stiles squeaks, and shoves the Xeroxed schedules into his pocket. \"Didn't see you there, man!\"</p>\n<p>\"Getting to be a habit of yours,\" Derek drawls, and steps back to coolly look Stiles up and down.</p>\n<p>Now that Stiles knows he's looking at Derek's younger self, he can see it. He has the same face, the same hair, the same faint aura of menace. He's just <em>younger</em>. \"I'm a menace,\" Stiles agrees, and turns to start walking. Maybe the canteen serves breakfast, Stiles can't remember when the school started doing that.</p>\n<p>\"What were you doing in there?\" Derek asks, his eyes flittering to Stiles' pocket meaningfully.</p>\n<p>\"Forgot something yesterday when I was signing forms,\" Stiles says. \"Thought I'd drop by, see if it was there.\"</p>\n<p>\"Right,\" Derek says. Stiles inwardly curses. <em>Werewolf.</em> Awesome. \"So I guess you do know my name now, huh?\"</p>\n<p>\"Yeah,\" Stiles says. \"Paige told me.\"</p>\n<p>\"Paige?\"</p>\n<p>\"The awesome girl with the 'cello,\" Stiles says, because it's an excellent opening to try and sell the girl to him. \"The spunky girl with attitude last night? Who asked us to shut up? I went back and apologized to her.\"</p>\n<p>Derek's forehead furrows. \"Really? She was the one being a dick.\"</p>\n<p>\"We interrupted her music,\" Stiles says, and barrels on, \"which is a shame, because she's amazing. You should hear her.\"</p>\n<p>\"Right,\" Derek says again. Huh. Apparently it's not just the eternal manpain and suffering that characterizes Derek Hale's past that makes him a man of few words. It's just in his nature. That's kind of good to know. \"Why are you making that face?\"</p>\n<p>\"<em>What</em> face?\"</p>\n<p>\"The kind of face which makes me want to punch you,\" Derek clarifies.</p>\n<p>Stiles stares at Derek. \"I met your Mom yesterday. You did not inherit her dashing personality.\"</p>\n<p>Derek grins. Stiles hesitates to apply the term <em>wolfishly</em>, but it applies. \"I inherited her killer right hook. Wanna see?\"</p>\n<p>\"I've seen it, thanks,\" Stiles mutters through gritted teeth, increasing his pace. The canteen is open, but it's not selling much – he buys a bottle of water and an apple and heads for his usual table. Derek sits opposite him. \"I've figured out the layout of the school already. I don't need an escort.\"</p>\n<p>\"Sure,\" Derek says, opening a carton of milk. \"But we've got first period together. We might as well hang out.\" He smiles innocently. \"Unless you have something better to do?\"</p>\n<p>Stiles stares, and tries not to think about how Derek is a dick no <em>matter</em> what year it is. He manages to get away from Derek for about three minutes, by squealing and running into the bathroom and locking himself in a stall, and he quickly flattens the two schedules, memorizing them as best as he can. He already knows the schedule he's landed himself with; thank goodness Barbara let him keep the same options.</p>\n<p>The three of them only have a few classes together, but two of them are this morning – French and Biology. And Paige and Stiles share a class this afternoon, so he has chance there to try and warm her up to Derek. Stiles shreds the schedules and regretfully flushes them. He has the information he needs.</p>\n<p>Derek's leaning against the sinks when Stiles comes out.</p>\n<p>\"You're kind of creepy,\" Stiles says. \"Were you listening to me taking a dump?\"</p>\n<p>\"<em>No,</em>\" Derek says, but his neck turns weirdly pink, and wow. He's lying. Stiles is totally going to mock Derek with this <em>forever</em> when he gets back home.</p>\n<p>French, or as Stiles likes to call it <em>Step One of my Awesome Plan of Awesome to force Derek and Paige to Fall In Epic Moon-Crossed Love</em>, is a disaster. Stiles manages to steal Derek's pencil case, and throw it neatly under Paige's desk.</p>\n<p>When Derek hunts for it, Stiles points it out, and Derek rolls his eyes, which just causes Stiles to curse inwardly that he didn't notice the guy who saved him from his panic attack was at least <em>some</em> kind of Hale. He does climb under Paige's desk to rescue it.</p>\n<p>The trouble is, Paige \"accidentally\" kicks him, making Derek spring back to his feet and call her a loser, loudly. To his credit, at least he does it in French. Stiles does his best not to be impressed.</p>\n<p>\"Monsieur <em>Hale,</em>\" the teacher yells.</p>\n<p>\"Excuse moi, j'ai eu tort,\" Derek mutters to Paige, resentfully.</p>\n<p>Paige smiles, unpleasantly. \" J'ordonne que tu me laisses tranquille.\"</p>\n<p>Derek throws his pencil case back down on the desk, and scowls at the back of her head.</p>\n<p>\"You should apologize to her properly, afterwards,\" Stiles suggests in a whisper.</p>\n<p>Derek looks at Stiles like he's grown another head, but that's kind of the expression he's used to from Derek, so it doesn't mean a whole lot.</p>\n<p>Well, that's step one down, but he has another chance straight away in Biology. Especially when he sidles by the teacher's desk and notices that it's pair work.</p>\n<p>Then Stiles notices the sign on the desk, and he wants to cry.</p>\n<p>Adrian Harris? <em>Seriously?</em> Beacon Hills High School has an epic teacher turnover rate, probably all the unexplained deaths, but <em>this</em> is the idiot Stiles has to deal with? <em>Harris</em> is the one teacher that survives long enough to torture Stiles' <em>soul</em>?</p>\n<p>Time travel is the <em>worst.</em></p>\n<p>Still, Stiles knows this subject – he's done it before when the stakes were nearly as high – so he successfully manages to dither around the desks and finds himself sitting next to a blonde-haired girl, while Derek's forced into the only spare chair – right next to Paige.</p>\n<p>Stiles pumps his fist under the desk, and when he looks up – Derek's sat next to him, grinning.</p>\n<p>\"Thank goodness for desk trades,\" Derek says. \"Be my lab partner?\"</p>\n<p>Stiles tries to smile back. Derek's going to be the death of him. Probably literally, considering the grumpy werewolf's self-sacrificing suicidal streak of late.</p>\n<p>Damn, though. His plans have <em>both</em> failed. He's failing before he's even begun. Shit. He's going to destroy the future. <em>Single-handedly.</em>Well done, Stiles Stilinski, A-grade failure.</p>\n<p>Derek frowns.</p>\n<p>\"What's wrong?\" Stiles asks, automatically.</p>\n<p>\"Your heartbeat's <em>racing,</em>\" Derek murmurs.</p>\n<p><em>Werewolves,</em> Stiles thinks derisively for about the millionth time. Then again, it's supposed to be a secret, so Stiles feels it's only fair to mess with Derek while he can.</p>\n<p>He'll probably pay for it later. Derek does seem to like his pound of flesh in the future.</p>\n<p>\"You can hear my <em>heartbeat</em>?\" Stiles says, trying not to show Derek that he's kinda enjoying himself immensely. Trolling werewolves is <em>fun,</em> and he so rarely ever gets away with it. Although it had been fun convincing Isaac his hair would fall out.</p>\n<p>Derek's not a great liar. He panics for an obvious moment, and then leans in, touching two fingers to the side of Stiles' neck. \"You've got a pulse here,\" Derek says, his voice low. His eyes are unnecessarily close, Stiles decides. His fingers push into the soft flesh of Stiles' neck, and Stiles' swallows nervously. \"It's <em>racing.</em>\"</p>\n<p>\"Yeah,\" Stiles says. \"I'm not a big fan of Biology.\" Derek's fingers are still on his neck. It feels weird. Like Stiles' body is turning hot, just from that contact. Derek's eyes are still unnervingly close.</p>\n<p>It has to be because of his reactions to Derek in the future. Derek's never this close or this still around him. Derek's normally pushing him into things, and growling, and generally just scowling in his direction.</p>\n<p>If <em>Stiles'</em> theory is closer to Deaton's time travel theory, and this has all <em>already happened,</em> then whatever happens between Derek and him now in this timeline? It can't turn out well if Derek follows it up with slamming him into walls or shoving his face into his steering wheel (although, yeah, Stiles deserved that one.)</p>\n<p>\"Your pulse is still racing,\" Derek says, his voice even quieter.</p>\n<p>Stiles thinks of Derek saying <em>It is you,</em> in a strangled tone that Stiles thinks, with hindsight, was almost a tone of <em>wonder.</em> He looks down automatically at his hand, and the jagged z-shaped cut in it, and Derek moves his fingers to touch that cut instead of Stiles' neck, which makes him feel like he can finally breathe.</p>\n<p>Some of the pain sneaks away. Stiles kind of wants to tell him off, for using his werewolf powers so brazenly, but Stiles isn't supposed to know about werewolves, so he just smiles awkwardly at Derek. Who's staring at him and smiling back.</p>\n<p>The attention is <em>weird,</em> and Stiles turns his attention back to the front. Paige is sitting stiffly with the blonde-haired girl, starting the experiment when Mr. Harris commands them to. Stiles automatically starts following the instructions, his body remembering how to do it.</p>\n<p>Mr. Harris orders them to change stations, so Stiles tries to slip away from Derek and find some way to maneuver Paige and Derek to sit together, but Derek's got some moves of his own, and when Stiles sits at the next station, Derek slides in next to him.</p>\n<p>Stiles quirks a grin as his first reaction, because it is kind of hilarious. It's the sort of stunt Scott and he tried to pull all the time. Mr. Harris doesn’t even notice, so it's quietly hilarious, until they have to switch stations again and Derek does it <em>again.</em></p>\n<p>\"I think the point of this exercise is to work with others,\" Stiles mutters to Derek, turning the Bunsen Burner onto its hottest stream. \"You don't think Paige is a good bio partner? You two have <em>chemistry</em> together.\"</p>\n<p>\"No, we don't,\" Derek says, picking up the tongs. \"Only biology and physics. She's in advanced chem.\"</p>\n<p>Stiles stares at Derek for a long moment.</p>\n<p>\"<em>What</em>?\" Derek asks.</p>\n<p>\"It's a good thing you're pretty,\" Stiles says, and turns back to the work, shaking his head. \"<em>Paige</em> is pretty, don't you think?\"</p>\n<p>Derek makes a weird noise. \"I guess,\" he says. \"If you like that surly, pain-in-the-ass kind of approach.\"</p>\n<p>\"I'm a fan,\" Stiles says, almost on autopilot. His brain flashes oddly to Derek in the future, who's <em>definitely</em> surly and a pain in Stiles' ass (metaphorically!), and he shakes that away irritably, because it's just the weirdness of Derek Hale being right next to him and <em>nice</em> to him that's doing a number on his brain. \"But seriously—\"</p>\n<p>\"You think I should partner up with…. <em>that</em>,\" Derek says, gesturing with the tongs at the desk two aisles over, where Paige is working with the weasel-faced boy who was such a jerk on Stiles' first day.</p>\n<p>\"I think you should,\" Stiles says.</p>\n<p>As if to perfectly punctuate Stiles' assertion, Paige and Weasel-face's experiment <em>catches on fire.</em></p>\n<p>\"I don't get <em>paid</em> enough for this,\" Harris snarls, and puts the fire out, scowling the whole time. Stiles might sort of laugh at the sight of the exasperated teacher, and Harris snarls even <em>louder, </em>glaring at Stiles in a calculating manner, and Stiles wonders if <em>this</em> is the reason why Harris hates him so much in the future. Because a kid who <em>looks</em> like him laughed at him once. Huh.</p>\n<p>\"I think I'm safer with you,\" Derek says from behind Stiles, close enough for his breath to ruffle Stiles' hair. Stiles shivers, and puts it firmly down to time travel weird feelings, and Derek just smiles at him for the rest of the hour.</p>\n<p>##</p>\n<p>Stiles has spent two classes without Derek or Paige to manipulate, so by the time it comes to lunchtime, he's antsy as anything. He buys two paper cups of coke from the canteen staff, lying that one's for a friend when they give him the evil eye (for the sugar or the caffeine, Stiles isn't sure), picks up the mystery meat even though it's probably people (<em>so</em> many unexplained deaths in Beacon Hills, <em>so many</em>) and he heads for an outside table, because he <em>thinks</em> he remembers Peter waxing poetical about the nice breeze outside the school when he was chatting to Derek in the past, so Paige must study outside.</p>\n<p>She is outside. Stiles grabs at his tray more firmly, and sits down opposite her.</p>\n<p>\"Hi there,\" Stiles says, smiling widely.</p>\n<p>Paige doesn't even look up from her notes. \"Leave me alone.\"</p>\n<p>\"Well <em>you're</em> the Queen of Amazing Manners,\" Stiles snits.</p>\n<p>Paige sighs, and looks up. \"Leave me alone <em>please.</em>\" She gestures at her work. \"I'm studying.\"</p>\n<p>\"At <em>lunchtime,</em>\" Stiles repeats.</p>\n<p>Paige's eye roll is worse than Derek's. She really <em>should</em> be a Hale, Stiles thinks. \"I practice music before and after school. I have a part-time job. Lunchtime is all I have. I want to get into a good music school. I need a scholarship. Ergo, I need to study and you need to <em>shut up.</em>\"</p>\n<p>\"Stiles.\" Stiles sighs, sags, and looks up to see Derek standing a few yards away, holding his own lunch, which is an unreasonably large pile of carbs, more carbs, protein and sugar. Werewolf metabolism is the <em>worst.</em> \"Come sit with me, huh?\"</p>\n<p>\"Wouldn't want to keep Captain Perfect waiting,\" Paige says, turning back to her work.</p>\n<p>\"Aw, c'mon,\" Stiles says, but she ignores him. The annoying approach, Stiles knows from experience (with Lydia), is likely just to annoy her more, so he picks up his tray and slouches over to Derek's table. \"Don't you have any friends?\" Stiles asks Derek, meanly.</p>\n<p>\"Sure,\" Derek says. \"They're inside, though. Flirting with the cheerleaders.\"</p>\n<p>\"You don't want to flirt with the cheerleaders?\" Stiles side-eyes Paige's table thoughtfully. \"You like the geeky girls better, huh?\"</p>\n<p>\"I don't need to practice my flirting,\" Derek says, and smiles at Stiles. Again. All this constant smiling is really turning Stiles into a bundle of high-strung nerves. \"I tend to just say hello and girls and guys fall over me.\"</p>\n<p>\"I bet they do,\" Stiles snarks, stabbing his straw into his first cup of coke. It's a pity they don't sell coffee to students.</p>\n<p>\"They don't usually fall over <em>her,</em>\" Derek says, prodding his straw in Paige's direction. \"She's not worth it. She's kinda stuck up.\"</p>\n<p>\"No, she's not,\" Stiles says, automatically. \"You just think that because you're conditioned to. Because school culture instantly labels the musicians as nerds, and not worth anything. She's probably more intelligent than any two of us put together.\"</p>\n<p>\"You're pretty smart,\" Derek says.</p>\n<p>\"And you're an airhead, we balance out,\" Stiles says.</p>\n<p>Derek barks out a short sound which might even be a laugh. \"Absolutely nothing up here but oxygen and marshmallows,\" he says, tapping the side of his head. \"Laura says that all the time.\"</p>\n<p>\"I met her,\" Stiles offers. \"She seems nice.\"</p>\n<p>\"So do sharks until they bite you,\" Derek says. \"So how long are you staying in town?\"</p>\n<p>Stiles shrugs, and chews aggressively on his straw for a moment because he doesn't have a good answer. \"I dunno,\" he offers, eventually. \"I guess it depends.\"</p>\n<p>\"On…?\"</p>\n<p>\"On what sent me here, when it wants me back,\" Stiles says, honestly.</p>\n<p>\"You're weirdly cryptic.\"</p>\n<p>Stiles beams. \"Thanks. Intelligence is hot, man. Embrace the nerds.\"</p>\n<p>Derek looks at him strangely. \"Whatever.\"</p>\n<p>Stiles laughs. <em>Whatever.</em> Derek Hale, saying <em>whatever</em>. Like a moody teenager. He <em>is</em> a moody teenager.</p>\n<p>The Derek in front of him pulls a wounded face. \"What's so funny?\"</p>\n<p>\"Nothing,\" Stiles says, and Derek looks suspicious. Oh yeah. Supernatural lie detector. \"It's just… so weird seeing you like this…\" Derek's back to looking wounded. Stiles backtracks. \"I mean, because you remind me of someone. Yeah. Someone who… looks a lot like you, but would never act like you do.\"</p>\n<p>Derek makes a curious sound, and picks up one of his four massive sandwiches. Stiles valiantly fights his werewolf-metabolism jealousy for a moment. \"You talk like you <em>like</em> this person. I can roll with that.\"</p>\n<p>\"Like I <em>like</em> him?\" Stiles scoffs, because liking <em>Derek Hale</em>? The future grump-tastic emo-embracing Grinch of werewolf land? Then again, he guess it's not entirely <em>dislike</em> anymore. He has an empathy for Derek Hale. There's a sadness that courses through this Derek's future self which Stiles' own sadness and grief for his Mom understands. He <em>trusts</em> Derek with his life, and has done so. He stoically worried over Derek being missing, and then risked Derek's wrath by asking Peter about him behind Derek's back. Does all that mean Stiles likes him? \"I guess,\" Stiles says, shrugging. \"It's complicated.\"</p>\n<p>\"How can it be complicated? Either you like someone or you don't.\"</p>\n<p>\"Well,\" Stiles says, \"it can be complicated in the way you seem to <em>hate</em> Paige over there, but I think you like her too.\"</p>\n<p>Derek pulls a face.</p>\n<p>\"C'mon. Hot, sexy, sassy 'cellist, what's not to like?\"</p>\n<p>Derek adds a frown to his displeased face. It reminds Stiles even more of Derek's future face.</p>\n<p>\"Anyway, the guy I'm talking about,\" Stiles says, gesturing with one of the cups of coke. \"I hated him, and then… I guess I slowly saw him as more human, which is ironic, because—Anyway. He slammed me into some stuff. I was <em>really </em>annoying in return.\"</p>\n<p>\"I can see that,\" Derek says. Stiles sticks his tongue out for a moment, and Derek ducks his head shyly. \"You miss him,\" Derek says, mostly to his food.</p>\n<p>\"In a weird way, yeah,\" Stiles admits, and then cringes. Because he's basically saying <em>I miss Derek Hale</em> to Derek Hale's face.</p>\n<p>Derek's never going to let him live it down.</p>\n<p>They finish their lunches in relative silence, but it's not weird. It's weirdly comfortable. Stiles' next class is English, which has Derek in it, but no Paige. He's thinking that maybe he can work on Derek's appreciation for the 'cello, but all those thoughts go out the window when English begins, and he's <em>completely lost.</em></p>\n<p>The class is on \"<em>The Crucible</em>\", and they haven't started that yet. It's on the reading list, but not until later, when \"<em>Heart of Darkness</em>\" is complete. Questions fly around the room and Stiles can't even keep up with half of them. When he can't answer the first question, the teacher yells at him, even though Stiles is new.</p>\n<p>\"I'll catch him up,\" Derek offers, cutting into the teacher's rant. Stiles sinks into his chair and spends the hour trying not to die in humiliation.</p>\n<p>As Stiles packs his stuff up quickly, hoping to hurry to math with no more humiliation, Derek turns his chair around and leans on his desk.</p>\n<p>\"Just how lost are you?\"</p>\n<p>\"My class was doing <em>Heart of Darkness,</em>\" Stiles says. \"Y'know. Unreliable narrators. The evil of man. No witches at <em>all</em>.\"</p>\n<p>\"I'm great with this book,\" Derek says. \"You're coming to my house tonight for dinner. 6pm. We're out in the Preserve, your Uncle'll know the way. I'll tell Mom you're coming, and if you don't turn up, she'll take it personally. As an offense about how well she keeps her house.\"</p>\n<p>Stiles stares at him, but it is an opportunity to sell him on Paige some more, so he guesses he can't turn him down.</p>\n<p>Besides, it's an opportunity to understand the enigma that is Derek Hale a little better. See the family he lost. Things might be easier having someone around who <em>understands</em> the enormity of his loss.</p>\n<p>\"Sure,\" Stiles says. \"I'll be there.\"</p>\n<p>Derek smiles <em>again</em> and is gone before Stiles can change his mind.</p>\n<p>It's probably a terrible idea, Stiles realizes, as he stomps to math. Barbara changed his math class so that he didn't have to share it with Weasel-face, and Paige is in this class, so Stiles should be focussing on the project, but his focus is all over the place. He tries to count his breathing and regain his focus. It's a good thing the math is easy. He does the worksheets the teacher hands out without even thinking, and it's only when he gets to the bottom of the last one that he notices Paige is his desk neighbor, and she's looking at his work, obviously intrigued.</p>\n<p>\"You're good,\" she says. Stiles smiles, surprised by the compliment, but Paige turns away before he can say anything else. Like \"<em>you know who else is good at math, Derek Hale!\"</em> He has such <em>beautiful</em> schemes to get them together, it's a shame each and every single one is thwarting him.</p>\n<p>As he starts to leave the room when class finishes, Paige hangs back to talk to a couple of girls, so Stiles drops to do up his shoelaces.</p>\n<p>\"<em>Everyone's</em> seeing <em>'National Treasure'</em> because we're getting it two weeks before everyone else, but I'm not feeling it. I kinda want to see the Dante one, <em>'Our Music'</em>?\" Paige says. \"It doesn't matter if you two can't. I'll go on my own.\"</p>\n<p>\"We're already booked with Dale and Anders to see <em>'National Treasure'</em>,\" the girl Paige is talking to says apologetically. \"Dale's half in love with Nick Cage, I gotta show him what he'd be missing, y'know?\"</p>\n<p>\"It's okay. I'll probably see you outside before the movie starts,\" Paige says. \"I'll be there about seven tomorrow?\"</p>\n<p>Stiles waits until the girls leave the room, and does a tiny little victory dance.</p>\n<p>He probably should have waited until the teacher left too, but never mind. Stiles smiles at the teacher and sidles out of the room.</p>\n<p>He has a possible <em>awesome</em> place to set Derek and Paige up, and he actually has an opportunity tonight to try and convince Derek he absolutely <em>has</em> to be at the movies tomorrow night.</p>\n<p>Stiles hums to himself, jogs to the Jeep, and finds a piece of paper in the windshield wipers.</p>\n<p>\"6PM. Be there. DH.\"</p>\n<p>Even on <em>paper </em>Derek's stoic. Awesome.</p>\n<p>Stiles formulates a good couple of persuasive statements to use on John to let him go to the Hale house, but they're completely not necessary; when he gets into the house there's a note on the fridge.</p>\n<p>Lil' Stiles is at the babysitters (actually the same lady that sits for Scott McCall, although they somehow don't meet there), his dad's at work until late, so Stiles needs to fend for himself. There's a pile of papers on the kitchen table that Stiles looks through for a moment; it's all the papers backing up his fake cover story.</p>\n<p>Whatever favor Talia Hale or Deaton called in must have been a good one, because Stiles almost believes it himself. That, or he really <em>does</em> have an unfortunate cousin living with an abusive alcoholic uncle.</p>\n<p>Stiles thinks about blowing off Derek's invitation for dinner, especially when he finds a pizza in the chiller section of the fridge that John must have bought in special, because his dad only does that when they have guests in from out of town, but he is curious, and it's a good opportunity to get the timeline back on track to where it should be.</p>\n<p>\"<em>Gone to Hale house,</em>\" Stiles writes at the bottom of the note. \"<em>Been invited for dinner :D and homework!! D: Be back later!</em>\" He pauses at the bottom of the note, and then remembers the spell could end any moment, so he shouldn't leave space for regret. \"<em>Love Stiles,</em>\" he writes at the bottom.</p>\n<p>Even if everything goes wrong, and Deaton's wrong about the spell taking him back to his time, at least his dad'll know <em>that</em> truth.</p>\n<p>He walks to the Hale house before he can talk himself out of it. The air clears his head, and it means he's there on time, and not embarrassingly early.</p>\n<p>There aren't really any words to describe how weird it feels to see the Hale house standing, and not a burned out wreck. Stiles heads up the porch steps and stares at the door and panics. Should be have brought flowers for Talia? Should he really be wandering into a house of werewolves? There's humans too, Stiles knows, but he's pretty much serving himself up into the lion's den. The werewolves' den. Ha. <em>Den.</em> He squints at the door some more. Maybe he should come back later.</p>\n<p>The door swings open just as he's taking a half-step backwards.</p>\n<p>Laura beams at him from inside the house. \"Get in, loser,\" she chirps, and grabs hold of his shirt collar, yanking him into the house. \"I'll give you the quick tour. Derek's still <em>getting ready.</em>\" She bumps his shoulder and Stiles' gets a noseful of scent, rosewater and vanilla. It's a lot better than Laura smelled in the future. Where she's <em>dead.</em></p>\n<p>Stiles' eyes threaten to water, and he blinks that away. It's not his job to save Laura, although he wants to like burning. Deaton and Talia are older than him, and have more knowledge and experience of the supernatural. If they say time travel usually works out for the worst, then they have to be right.</p>\n<p>It doesn't stop his heart hurting as Laura shows him around the first floor of the Hale house, all the signs of <em>life</em> that are everywhere. The bright colors and the paintings and the detritus of everyday life that a family of eleven can't help leaving everywhere.</p>\n<p>\"This is the living room,\" Laura introduces, and Stiles tries not to remember holding Scott down in it while Derek burned Scott's ugly tattoo back into life. \"There's my uncle Peter skulking in the corner.\"</p>\n<p>A much younger-looking Peter looks up from an armchair, glaring at them both with a surly expression for a moment over the top of the book he's reading, before burying his nose back in the book.</p>\n<p>\"He's been sitting there so long I think he's decomposing,\" Laura says in a stage whisper.</p>\n<p>\"You suck,\" Peter says, not looking up again.</p>\n<p>\"<em>Bite</em> me,\" Laura says, sing-song, and Stiles tries not to shudder. She shows Stiles the kitchen, where Eric Hale – apparently their human father – is cooking dinner, while Talia sits in the corner placidly giving instructions, and shows him the backyard where a couple of figures are running about, shouting and squealing, and she leaves him in the hall at the bottom of the stairs. \"Stay here. I'll get Derek.\"</p>\n<p>Laura jogs up the stairs, and Stiles manfully does not watch her ass this time.</p>\n<p>Much.</p>\n<p>Man, the Hales are unfairly gifted in the rear department.</p>\n<p>\"Hello!\"</p>\n<p>Stiles probably should have just made a single right-angle turn to the right, but that would have been the easy option – he does a rapid three-quarter turn to the left which makes him a little dizzy to find the source of the voice.</p>\n<p>It's a young girl, long brown hair, wearing a Beacon Hills Elementary school uniform. There's something very familiar about her dubious facial expression. More familiar than Eric Hale's face had been. This is more than the genetic resemblance pinging Stiles' sense of familiarity.</p>\n<p><em>Cora.</em> It's Cora. Stiles smiles, and he doesn't have to work to fake it. It's nice to see someone recognizable. \"Hello,\" Stiles says.</p>\n<p>Cora smiles tentatively back. \"Are you Derek's boyfriend?\"</p>\n<p>\"What?\" Stiles stares at her. \"<em>No. </em>Jeez, Cora. No. I'm Stiles Stilinski. A <em>friend.</em>\"</p>\n<p>Cora nods, accepting the answer. Then she frowns. \"How do you know my name?\"</p>\n<p>Oh, Stiles thinks. <em>Shit.</em> \"Um,\" Stiles starts.</p>\n<p>\"I showed him a family photo earlier,\" Talia's voice says coolly from behind him. Stiles winces at her apologetically. \"Why don't you go fetch your cousins in and tell them it's half an hour until dinner's ready?\"</p>\n<p>\"Okay, Mom,\" Cora says, and runs for the back of the house, shouting. Stiles watches her go, swallowing at how bright and uninhibited she is. Cora, in the future, is a bundle of rage and anger.</p>\n<p>\"It's nice you know my family from your timeline,\" Talia says.</p>\n<p>Stiles turns to her, but it's too hard to see her, standing in her family home, chin tilted proudly and calmly, and he can't look at her. It's too hard to know she burns in this house. His heart stutters and he looks at her helplessly, because he has to tell her, the timeline couldn't be damaged <em>that</em> much, surely?</p>\n<p>\"Whatever you want to tell me,\" Talia says, and her voice nearly <em>rumbles</em> with the effortless power she has at her command. \"Whatever happens to us, you could make it <em>worse.</em> Do you want that?\"</p>\n<p>Stiles looks at her, and thinks of Peter's burned face, and Laura's dead eyes. \"No,\" Stiles says, because Derek could be there too, and Cora. <em>Scott.</em></p>\n<p>Talia looks at him, and her expression is so sad, so weighted with it, it's almost like she knows. Like she can read it on Stiles' face anyway that there's tragedy heading her way, and there's nothing either of them can do to stop it. Not without causing more damage. She steps in close, and puts her hand on his cheek.</p>\n<p>\"You know my daughter, at least, wherever you're from,\" Talia says. \"That's enough for me to know.\"</p>\n<p>\"Thanks for the paperwork,\" Stiles blurts, making a guess (he has a 50/50 chance, after all) and Talia's nod is confirmation enough.</p>\n<p>\"Hey, Stiles.\" Stiles and Talia both look up to see Derek at the top of the stairs. \"Wanna come up and study here?\"</p>\n<p>\"Keep the door open, honey,\" Talia tells him. Stiles' tries not to flush at the implication, because that rule is usually employed by parents when boyfriends and girlfriends visit, not study buddies.</p>\n<p>Maybe she just wants to keep an ear on the noise levels, make sure Stiles isn't breaking the timeline.</p>\n<p>Derek rolls his eyes dramatically. \"Okay, mom.\"</p>\n<p>Stiles frowns at the eye roll. \"Some things never change,\" Stiles mutters, and starts to head up the stairs. Talia laughs at that before sweeping back off in the direction of the kitchen.</p>\n<p>Derek eyeballs Stiles warily. \"What do you mean?\"</p>\n<p>\"I mean,\" Stiles says, and thinks of a lie that will masquerade as a truth, \"studying sucks.\"</p>\n<p>\"Yeah,\" Derek agrees. \"C'mon.\" He nods his head upstairs, and doesn't look back to check Stiles is following.</p>\n<p>He doesn't need to check. Stiles' curiosity is full-blown now. It's a good thing Stiles is more of a dog person.</p>\n<p>Derek's room is surprising, considering his Spartan lifestyle at the loft. His room is cluttered. There's floor to ceiling shelves on one wall, all packed to bulging with books, and a large desk that has practically no surface space. There's a large bed in the center of the room, dressed in cozy green soft furnishings instead of the black that Stiles might have imagined, and there's junk in every spare spot around the walls. It's a lot like Scott's room – there's a guitar leaning up against the desk, and basketball and 80s rockband posters on the walls. There's a lot of space in the middle of the room, though, and a fluffy looking rug, so Stiles automatically sits down on it, leaning against the bed, spreading his arms wide.</p>\n<p>\"Nice digs,\" Stiles compliments. \"Love what you've done with it.\"</p>\n<p>\"I know it's a bit of a tip. Mom keeps saying it's like a bomb's hit it.\"</p>\n<p>Stiles' tries not to wince. It's not precisely a bomb that hits the Hale house, but it might as well have been. Thankfully Derek's not looking in his direction.</p>\n<p>\"Do you want some music while we study?\"</p>\n<p>\"Sure,\" Stiles says, leaning up and watching Derek fumble through some CDs. \"What've you got?\"</p>\n<p>\"What kind of music do you like?\"</p>\n<p>Stiles thinks about it, sees a brilliant opening, and goes for it. \"'Cello music is pretty rocking,\" he declares. \"Don't you think?\"</p>\n<p>Derek frowns down at him. \"No.\"</p>\n<p>\"And there you go reminding me of that guy I know,\" Stiles says, gesturing at Derek's face.</p>\n<p>Derek's scowl deepens. \"I don't like this guy.\"</p>\n<p>Stiles laughs. The irony might kill him at this rate. \"I'll tell him when I get home.\"</p>\n<p>Derek's scowl doesn't look in any danger of disappearing any time soon. Oh. Maybe <em>Stiles</em> is the one to give him that expression permanently. Huh. \"I'd rather I reminded you of <em>me,</em>\" he grumbles, and turns back to his CDs, the back of his neck flushing. \"You like rock? Indie?\"</p>\n<p>Stiles tries to think back to what he liked in 2004. \"Sure. Got any Switchfoot? Five For Fighting? 3 Doors Down?\" He smirks. \"Nickelback?\"</p>\n<p>\"I was about to say you had good taste until that finale,\" Derek says, and slides a CD into his player. He messes around with the controls, lowering the volume so it's not too intrusive. \"<em>We were meant to live for so much more,</em>\" filters out from the speakers, and Stiles tries not to shudder.</p>\n<p>Derek throws something at Stiles, and Stiles brings up his hands. The book Derek throws bounces off Stiles' hands and lands on the rug.</p>\n<p>\"<em>No throwing things at guests,</em>\" Stiles yelps, and goes for the only revenge he can have. \"What, were you raised by <em>wolves</em>?\"</p>\n<p>Derek has a small coughing fit. It's <em>amazing.</em></p>\n<p>\"You okay up there?\" Stiles asks.</p>\n<p>\"Let's just study, okay?\" Derek sulks, throwing himself down onto the rug next to Stiles. He's sitting oddly close considering there's a lot of room, but maybe his eyesight's not amazing and he needs to sit close to see the text if they're sharing one book.</p>\n<p>Derek gives him a good summary of the book and the characters, better than Cliff Notes, because he explains some of his own thoughts, and chuckles when Stiles yelps in outrage at some of the behavior in the book.</p>\n<p>\"So <em>any</em> woman who found out their husband was having an affair could just… call out the mistress as a witch as her revenge?\" Stiles shakes his head. \"Man. Did it ever work the other way around, do you think? The mistress wanting to push the wife out of the way?\"</p>\n<p>\"Probably,\" Derek says. \"Y'know. If witches existed.\"</p>\n<p>Stiles snorts, because he's never actually found out for sure, but if spells and druids exist, it seems a non-brainer that supernatural witches do too. \"I would not be surprised.\"</p>\n<p>Derek looks at him oddly, his eyes scraping Stiles' face for an answer to a question he hasn't asked yet.</p>\n<p>\"They already do,\" Stiles says. \"Wicca. The pagans. Love and respect all religions, man. No judging here.\"</p>\n<p>\"We're already looking at the book too literally,\" Derek says, and gestures at the book in question. \"It's actually an allegory for McCarthyism, because—\"</p>\n<p>\"Ugh, are you two losers <em>actually</em> talking nerdy to each other?\" Laura asks from the doorway, poking her head in. She sniffs exaggeratedly. \"I'll bring the air freshener up later, Der. Your room smells like my socks.\"</p>\n<p>\"You're adorable,\" Derek says. \"Wait. Did I say adorable? I meant deranged.\"</p>\n<p>Laura smirks. \"Weak. There's no point forming a rebuttal. Mom says dinner's ready. Get your cute butts downstairs.\"</p>\n<p>\"Did your sister just call your butt cute?\" Stiles asks.</p>\n<p>\"Like you'd argue,\" Laura says, already sauntering away. \"I was stalking you both at school a little and I've already seen you looking.\"</p>\n<p>Stiles' mouth drops open, and he splutters and tries his best not to look at Derek. Derek just laughs, though, and climbs gracefully to his feet, extending a hand down to Stiles.</p>\n<p>\"Need a hand up?\" Derek says.</p>\n<p>Stiles looks at the hand, strong and inviting, and shakes his head. \"I got it.\" Derek takes his hand back and folds them over his chest, <em>classic </em>Derek, and just watches as Stiles flails madly to his feet. Stiles scowls as he gets his clothes straight again. He only fell <em>once,</em> Derek shouldn't be looking so smug. Stiles glares, and Derek's cheeks go oddly pink for a moment, and Stiles looks down. Oh, man. The jeans his dad lent him are <em>way</em> too big, and they've fallen down quite a way, showing the sharp bones of his hips underneath the hem of his shirt.</p>\n<p>He tugs up the jeans, trying to hold onto his dignity, but it's probably a lost cause.</p>\n<p>\"Didn't bring many clothes with me when I left home,\" Stiles says, which isn't too much of a lie. \"Borrowed some, but… Deputy Stilinski's not quite my size.\"</p>\n<p>\"No,\" Derek says, his gaze flittering over Stiles, weirdly assessing. Stiles shifts under the scrutiny. Derek wanders forwards, right into Stiles' personal space, and touches Stiles' side, pushing the material in. \"You're more muscular than you seem at first glance.\"</p>\n<p>\"I'm lithe but wiry,\" Stiles says. \"It's the lacrosse.\"</p>\n<p>\"Huh.\" Derek tilts his head, and moves his hand, spreading it into a star to cover Stiles' stomach. Stiles looks down at Derek's hand, his stomach twisting weirdly. Derek's still young. Future Derek's hand would <em>completely</em> cover the area. Derek's palm is warm, strong, and Stiles feels oddly dizzy at the contact.</p>\n<p>\"We should go,\" Stiles blurts. \"It would be rude to be late.\"</p>\n<p>\"Yeah,\" Derek says, stepping back and taking his hand with him. \"I'll show you where the sink is so you can wash your hands.\"</p>\n<p>After visiting their bathroom, which is bright white and such a complete contrast to the black, charred skeleton the house becomes that Stiles almost convinces himself he's in a completely different house entirely, Derek takes Stiles downstairs and introduces them to the whole family, while Stiles desperately tries not to think about the casualties that will result.</p>\n<p><em>Losing one pack member is like losing a limb,</em> Cora said. Stiles can't really comprehend what losing so many at once must feel like, because he's only lost his Mom so far, and that was like losing the whole world.</p>\n<p>Talia's more than Derek's mom, she's an <em>Alpha,</em> and it shows – even though it's not just her offspring at the dinner table, everyone defers to her, easily and naturally. The family resemblance between all of them is strong.</p>\n<p>There's Eric, Derek's dad, who Stiles sort of met earlier in the kitchen. Peter's not the only Uncle at the table – there's an Uncle Andrew, who sticks out as the only non-brunet at the table. He has dark gold-colored hair and Stiles thinks might be human. He's an Uncle by marriage, to one of Talia's sisters, Kharis. Apparently Aunt Euphy's at work. Peter's sat by Kharis, and they bicker easily, definitely siblings. It seems like Eric took Talia's surname, and Andrew took Kharis', because they're all Hales. There's two cousins, Jason and Pan, who look slightly younger than Derek and Peter do. Laura he knows, and Cora, and Nick's the youngest. He and Cora look thick as thieves.</p>\n<p>Eric's cooked a spread of dishes, and they cover the middle of the table, everyone allowed to help themselves, and Stiles isn't even taken aback by the amount of food – he's seen werewolf metabolism at work before.</p>\n<p>It's a lovely atmosphere, though. Stiles usually feels intimidated by large groups, and usual resorts into acting stupid to cover up how nervous he feels, but he feels comfortable in this group.</p>\n<p>In this <em>pack.</em></p>\n<p>This pack that <em>dies.</em></p>\n<p>The only way he's going to be able to cope with this is if he distracts himself, so Stiles throws himself back into the discussion of <em>\"The Crucible\",</em> turning to Derek, who's pushed up close to him. There has to be some downsides to having such a large family, and apart from having <em>more people to lose,</em> space has to be another one.</p>\n<p>\"I really dislike the whole witch hunt concept,\" Stiles says, stabbing at a generous helping of a delicious chicken pasta bake he wants the recipe of. \"Let's say witches exist, right? Hypothetically. What are the odds that all of them are dangerous?\"</p>\n<p>\"All power has intent behind it,\" Derek says, politely swallowing before talking. \"But people get scared of power they can't control and don't understand.\"</p>\n<p>\"Still,\" Stiles says, reflectively, \"there should have been a system put into place. If a witch doesn't hurt someone, they shouldn't be burned or whatever.\"</p>\n<p>\"Oh, this one's a keeper,\" Laura says, grinning from the other side of the table.</p>\n<p>\"I dunno, I think it sounds naïve,\" Peter says, sounding surly. He looks at Stiles like he's an unwanted weed. It's not a new expression from him. Stiles' placid reaction to it is probably driving him <em>mad.</em></p>\n<p>\"Naïve? To have faith that not all people are bad?\" Stiles questions.</p>\n<p>\"There's always shades of grey,\" Peter says, leaning back in his chair.</p>\n<p>Stiles snickers. \"About fifty of them.\" Oh, wait, it's too early for that joke.</p>\n<p>\"People are paranoid,\" Peter says. \"It's only a matter of time before regular folk think the witches are going to zap them with their magical mojo. Regular <em>people</em> will think witches can't help but <em>snap.</em> It's in their nature. And it's humanity's nature to obliterate what it doesn't understand. Tell me, Stiles, do you think <em>you</em> could live with a ticking time bomb?\"</p>\n<p><em>I already do,</em> Stiles thinks, staring coolly back at him. <em>I know you're up to something in the future. I don't know </em>what, <em>yet, but you're up to </em>something <em>and I can't get rid of you until you show your hand.</em></p>\n<p>Peter stares back, and makes a snarling noise in the back of his throat, baring his teeth. It might be Stiles' imagination, but it's probably not; Peter's teeth are lengthening, subtly.</p>\n<p>\"Peter, that's enough,\" Talia says, looking across at her brother coolly. \"Go out and fetch some water for the table.\"</p>\n<p>\"I can't carry that much on my own,\" Peter snarls. \"Would your <em>guest</em> like to help, do you think, Derek?\"</p>\n<p>\"I'll do it,\" Derek volunteers quickly, shoving out of his chair, glowering at Peter darkly.</p>\n<p>\"As you wish,\" Peter says, flickering a look at Stiles before sauntering out into the kitchen.</p>\n<p>They start arguing almost instantly as they violently push through the kitchen door, bickering in what they probably <em>think</em> is a voice quiet enough not to be heard, but the table's embarrassingly quiet for a moment and their voices carry through the still-swinging door.</p>\n<p><em>\"It's cute</em> <em>you've got a friend, but he'll hate you when he finds out your little… furry secret</em>,<em>\" </em>Peter's voice carries through, before the doors still.</p>\n<p>\"Derek has an embarrassing fixation on baby rabbits,\" Laura says, quickly. \"He goes <em>goo-goo</em> over the tiny things.\"</p>\n<p>\"I understand,\" Stiles says, nodding sagely. \"I'm a red panda man, myself.\"</p>\n<p>\"I like fennec foxes,\" Cora offers, and the uncomfortable silence is replaced by a friendly conversation about animals. Stiles is kind, and doesn't bring wolves into the mix, although young Nick is <em>adamant</em> is favorite animal is the <em>Black Wolf, Mama. The Black Wolf is the best.</em></p>\n<p>It sounds like buttering up to Stiles. Nick's after <em>something</em> from his Mom. If Talia Hale is anything like Stiles' dad, then Nick will… probably get it eventually.</p>\n<p>Derek and Peter come back into the room after a moment, carrying a ton of glasses like it's a competition. It probably is. Peter sloshes water all over Stiles and insincerely apologizes.</p>\n<p>\"It's no problem,\" Stiles says, smiling. Peter snarls. Smiles drive bad guys <em>mad.</em> It's one of Stiles' favorite redeeming features about them.</p>\n<p>\"So, Stiles, tell us about yourself,\" Talia says, loudly. She looks at Peter contemplatively, and there's a glint in her eyes. Stiles frowns at her, and she nods her head. She doesn't say it, but Stiles understands anyway – it's permission.</p>\n<p>\"I'm from a town a lot like this one,\" Stiles says. It's not a lie. Beacon Hills of the future isn't identical, but it hasn't changed too much. \"My dad's a Sheriff. I play lacrosse—\"</p>\n<p>\"You should switch to something more interesting,\" Derek says.</p>\n<p>\"Lacrosse is shit,\" Peter agrees.</p>\n<p>\"Peter,\" Talia says, in a suffering tone. \"Don't swear at the table. What do you think Mom would say?\"</p>\n<p>\"That I should widen my vocabulary,\" Peter says. \"And say <em>fuck</em> too to shake things up a little. Lacrosse is <em>fucking shit</em>.\"</p>\n<p>\"What's fucking?\" Cora asks, wide-eyed.</p>\n<p>Stiles tries not to shake with laughter. Derek's not having as much luck. He puts his hand down on Stiles' thigh, warm and heavy, and Stiles can feel Derek's repressed shaking through his whole body.</p>\n<p>\"That's my thigh, not yours,\" Stiles says quietly.</p>\n<p>Derek moves his hand. \"Sorry. Missed.\"</p>\n<p>From across the table, Laura looks unutterably amused.</p>\n<p>\"Jason, Pan, Cora, Nick—why don't you take your plates and go watch TV,\" Talia says, phrasing it like a suggestion, but the power in her voice not masking the fact that it's an order. The four of them pick their plates up, eyes rolling almost in perfect synchronization.</p>\n<p>\"Fucking means copulation,\" Peter says to their retreating backs. \"Sexual reproduction.\"</p>\n<p>\"Ewwww,\" Cora and Nick yell in unison as Jason and Pan snicker, herding their two younger cousins into the living room.</p>\n<p>\"<em>Thank</em> you, Peter,\" Talia says.</p>\n<p>Peter smiles through a mouthful of casserole.</p>\n<p>\"As you were saying, Stiles?\"</p>\n<p>\"Oh,\" Stiles says, swallowing another mouthful of food. \"I'm just here for a short while. Visiting. Oh, and my best friend back home—\"</p>\n<p>\"You have a best friend?\" Derek asks, a little wounded.</p>\n<p>\"Yeah, Scotty,\" Stiles says. \"He's a werewolf too.\"</p>\n<p>Stiles takes a calm mouthful of food, and Talia hides a smile in her food, as the table flips out.</p>\n<p>\"Oh my <em>god,</em>\" Laura yells. \"He knows? And you've been making us play happy human family for the last <em>hour</em>?\" She throws her cutlery to one side and lets her claws out, spearing into the small pile of ribs on her plate.</p>\n<p>\"It doesn't mean we don't have to have <em>manners,</em>\" Talia says, daintily.</p>\n<p>\"<em>Really?</em>\" Derek says by Stiles' side, his eyes scraping Stiles' face again. \"You… know. About… us.\"</p>\n<p>\"Humans can be pack too,\" Stiles says, with a shrug.</p>\n<p>\"I smelled it on him clear as day yesterday morning,\" Talia says.</p>\n<p>\"You <em>would,</em>\" Kharis says. \"<em>Alpha</em>.\"</p>\n<p>\"I know what you are,\" Stiles says, and he looks at Derek, willing him to understand. \"I'm not scared of you.\"</p>\n<p>Derek's wide smile in response is probably the best thing Stiles has seen in a long time.</p>\n<p>\"Although,\" Stiles amends, tilting his head, \"it does put what Laura told me about you in a terrible light.\"</p>\n<p>\"<em>What,</em>\" Derek says, all color draining from his face. \"What did she tell you?\"</p>\n<p>Laura starts snickering.</p>\n<p>\"That you liked rabbits. A lot.\" Stiles lets his lower lip wobble a little, melodramatically. \"Tell me straight, Derek. What does it mean when a werewolf loves rabbits that much?\"</p>\n<p>\"I don't eat them,\" Derek protests, instantly. \"I don't! I just like to cuddle them, okay? With their twitchy little noses, they're <em>calming</em>.\"</p>\n<p>The whole table is silent.</p>\n<p>Derek squirms in his seat. \"She used it as a metaphor for being a werewolf, didn't she?\" Derek says weakly.</p>\n<p>Stiles nods.</p>\n<p>\"I… just confessed a love for cuddling rabbits didn't I?\"</p>\n<p>Stiles nods again.</p>\n<p>Derek lets out a sound and buries his face in his arms. \"You guys are the <em>worst.</em>\"</p>\n<p>After dinner, Peter informs Stiles how ballsy it is to come into another werewolf's territory without permission, and Derek snarls at him, and Talia has to separate them. So much for Peter being Derek's closest confidant.</p>\n<p>Derek wants to study a little more, but Talia makes them work downstairs this time, giving Derek a knowing look. Stiles helps Derek and Laura clean the Dining Room table, and they spread some books out on the table so they can work for a while.</p>\n<p>\"Are you gonna do your assignment as a parallel to the Hunters?\" Stiles asks, after reading through some of the first act. It's definitely very hard to concentrate without the Adderall, but having Derek there makes it easier.</p>\n<p>\"Ugh,\" Derek says, eloquently. \"I really don't like Hunters. Peter and I ran from some last week; we got stuck in a basement for two days. Peter says there's a few Alpha packs in town to talk to Mom.\"</p>\n<p>\"There <em>are,</em>\" Peter calls through from the living room, where he's skulked through to sulk again.</p>\n<p>\"I <em>said</em> so,\" Derek calls back, not hiding his annoyance from Stiles. Stiles grins. It's nice to know Peter's a little shit in every decade.</p>\n<p>\"You made it sound like you didn't believe me,\" Peter says.</p>\n<p>\"Yeah, only in front of Stiles,\" Derek argues back. \"Since when do you care what he thinks? You told me in the kitchen he was a pathetic, tiny human.\"</p>\n<p>\"Whatever,\" Peter says. Derek grins, enjoying the win. Stiles tries not to think about how much he likes this Derek, who smiles at small things, who doesn't shy from sharing someone's personal space.</p>\n<p>\"I really don't get a good vibe from the Hunters in town at the moment,\" Derek says.</p>\n<p>\"Do you know who they are?\" Stiles asks.</p>\n<p>Derek shrugs. \"The other night was the first time I'd run into any of them. The Argents.\"</p>\n<p>\"Yeah,\" Stiles says, tensing because he can't help himself. \"Yeah, Scott had some trouble with them. Gerard especially.\"</p>\n<p>Talia shoots him a look across the house. That was too much.</p>\n<p>Stiles changes the subject quickly. \"If this is an allegory for McCarthyism, what did McCarthy do?\" He pulls a face. \"I'm behind on history. The teacher seriously gave me <em>seven books</em> for background reading.\"</p>\n<p>Derek looks a bit puzzled, but he goes along with the subject change until the clock chimes nine and Talia says it's time for Stiles to go home.</p>\n<p>Derek immediately starts begging to drive Stiles home, <em>especially</em> considering the Alphas in town and the Hunters, and Talia finally agrees, hands over some keys, and tells Derek he'll be grounded if he's not back quickly.</p>\n<p>It's a truck that Derek takes him to, parked around the rear of the house.</p>\n<p>\"I thought your family had a Camaro,\" Stiles says, settling into the worn passenger seat of the Ford Ranger. Derek nods, and leans over to put Stiles' seatbelt in before Stiles can do it.</p>\n<p>\"It's fiddly,\" Derek explains, gesturing at the seatbelt clip. He <em>does</em> seem to be having trouble pushing it into its base, his breath warm of Stiles' neck for a moment, Derek's hair tickling his nose. \"Yeah, we do.\" He pulls back and settles himself ready to drive, adjusting the mirror and turning the keys in the ignition. \"It's my dad's, really. Mom drives it the most. We're not allowed to even touch it. On the pain of <em>death.</em>\"</p>\n<p>They argue about \"<em>The Crucible</em>\" a little on the way back, although Stiles feels off-foot the whole way because he hasn't read the full text yet, and it feels like no time at all until he's in front of his house, and Derek's leaning over to let his seatbelt free.</p>\n<p>It seems to unclick with no problem, but Derek hovers close for a while before hopping out of the car and brushing his palms awkwardly on his jeans while waiting for Stiles to get out. He walks Stiles to his door, which is nice, because Stiles has dancing visions of Hunters and Alphas, and he's always felt safe with Derek in the vicinity. Well. While neither of them had been paralyzed, that is.</p>\n<p>\"I had a good night,\" Derek says, when they reach the door. \"I've got a lot of friends at school, but none of them… y'know. <em>Know.</em>\" He gestures at his teeth, even though they're human-shaped and even at the moment.</p>\n<p>Stiles nods. \"I get it. Sometimes it's nice to have someone you know you can share everything with.\"</p>\n<p>\"Exactly,\" Derek says. \"We should do it again, sometime. Maybe without the studying, too. Just… hang out.\"</p>\n<p>\"Tomorrow,\" Stiles blurts out. He can't decipher Derek's expression, so he barrels through regardless. \"Y'know I'm not doing hot on history, and there's a film on Dante at the movies tomorrow night, at seven, and— We don't have classes together. We should go. See the movie. Together. We should meet. At seven. Outside the theater. Do you want to?\"</p>\n<p>Derek stares at him a moment, probably because Stiles is being a babbling idiot, and then he ducks his head, and looks sheepish when he looks back up. \"I'd like that a lot, Stiles,\" he says. He leans in, like he's going to touch Stiles' cheek or something, but he thinks better of it and steps back. \"I might see you at lunch tomorrow, okay?\"</p>\n<p>\"Okay,\" Stiles says, waving as Derek drives off. He feels a little queasy, now he thinks about it, and he unlocks the front door almost automatically, locking it behind him and leaning his forehead against the cool panes of glass in the top half of the door. He probably ate too much at the Hale's, that's all.</p>\n<p>Stiles gives himself a moment, and then moves to finds his dad in the kitchen, immersed in a pile of paperwork, and says good night to him, before sloping off to bed.</p>\n<p>It takes him a while to get to sleep. When he does, he dreams of green eyes the whole time, much too close to his, and a hand, warm on his stomach. If he wakes up hard, Derek's name on his lips, it's just overspill of the situation, the intensity of the need to fix the future back to its original path.</p>\n<p>Denial is a familiar friend, and Stiles latches onto it as best as he can.</p>\n<p>##</p>\n<p>It's lunchtime before Stiles sees Derek or Paige again, and Derek waves him over to his table automatically. It's an outside table, and Stiles is glad it has a good view of the table Paige is studying at. It's a good sign. Stiles watches Paige covertly, and sighs when Peter joins them.</p>\n<p>Peter steals something from Derek's tray. \"Greetings, boys,\" he says, in a cool voice.</p>\n<p>Derek starts bitching at Peter automatically, while Peter makes weird, veiled threats like he knows something about Stiles' situation.</p>\n<p>\"He won't be around forever,\" Peter says, while Stiles plots how he's going to get Derek and Paige to bump into each other tonight. He can't risk turning up late, because Derek will avoid her. Maybe he can pull a fire alarm, because local laws state everyone has to assemble in the same place and stay until reports can be taken. \"Maybe someone local could amend that situation,\" Peter continues.</p>\n<p>\"Stiles,\" Derek says, \"why do you have a toy soldier in your hair?\"</p>\n<p>Stiles is too busy trying to see what book exactly Paige is reading, so he can perhaps push a discussion in that direction. \"I played with myself this morning,\" he says.</p>\n<p>Peter bursts out laughing. Stiles looks at him, and then at Derek, who looks like someone just hit him with a bus.</p>\n<p>\"I mean with my <em>cousin,</em> oh my <em>god,</em>\" Stiles says, waving his arms, quickly back-pedalling and grabbing for the plastic soldier and throwing it backwards into the nearest bush. No <em>wonder</em> his dad had been laughing at him when he ran out of the door. And that the Weasel-faced boy had snickered at him in History. \"He's so much like a mini-me I forget he's not <em>actually</em> me.\"</p>\n<p>\"Austin Powers,\" Derek says, \"<em>there's</em> a movie.\"</p>\n<p>\"I liked Dr. Evil,\" Peter says.</p>\n<p>Stiles takes a moment from staring Paige to eyeball Peter sourly. \"You <em>would.</em>\"</p>\n<p>\"What's <em>that</em> supposed to mean?\" Peter says. \"Wait, who are we all staring at?\"</p>\n<p>\"Paige,\" Derek says, in a low annoyed voice. \"Stiles thinks she's <em>beautiful.</em>\"</p>\n<p>\"She <em>is,</em>\" Stiles insists. \"Don't you think so, Derek?\"</p>\n<p>\"Haughty, pale, anti-social,\" Peter says, looking Paige up and down. \"I'd say she's perfect for you, Derek.\"</p>\n<p>\"Yeah, yeah, you're both regular comedians,\" Derek grumbles. \"Seriously, Stiles, what are even thinking about right now?\"</p>\n<p>\"I'm thinking about 'cellos?\" Stiles lies.</p>\n<p>Derek frowns at him, his eyebrows furrowing deeply. Stiles manfully resists the too-obvious question about eyebrows in his werewolf state. Especially because Stiles technically hasn't seen this Derek wolf out yet. Ooh. Stiles wonders what it would take to bribe Derek to turn for him.</p>\n<p>\"You're lying,\" Derek says, softly. Stiles looks at him, startled. \"I'll find out why.\" He smiles enigmatically at Stiles, and climbs out of the bench. \"I'll see you tonight,\" he says, before shoving his hands in his pockets and whistling as he heads over to the group of guys Stiles saw him with on the first day here.</p>\n<p>Stiles shakes his head and slumps down further in the seat.</p>\n<p>\"Do you think Derek likes that girl, Paige, then?\" Peter asks him.</p>\n<p>Stiles straightens back up again, and gives Peter his best surly expression. \"You're still here?\"</p>\n<p>\"Apparently.\"</p>\n<p>\"Yes,\" Stiles says. \"I think she's the perfect girl for him too and they'd be <em>magical</em> together.\"</p>\n<p>\"I think so too,\" Peter says, looking over at Paige assessingly. \"Good talk, Stiles.\"</p>\n<p>\"No, it wasn't,\" Stiles tells him, as Peter gets up and saunters off. \"Any talk with you in is a bad talk!\"</p>\n<p>Peter doesn't respond, but Stiles feels fairly confident Peter's heard him anyway. There are some downsides to being a werewolf, and Stiles knows them <em>all.</em></p>\n<p>##</p>\n<p>There are more downsides to being human. Some of which accompany being part of Deputy Stilinski's family in Beacon Hills.</p>\n<p>Namely, the town is full of nothing but gossips, and everyone loves Stiles' dad, and so all the gossips tell him <em>everything.</em></p>\n<p>Which is why Stiles comes home to a white bag with a red star on it, John handing him $20 and also trying to give him something with it.</p>\n<p>\"Thank you for the first two things, believe me, <em>thank you. </em>But for door number 3? I'm not <em>old enough,</em>\" Stiles says, horrified, as John tries to give him a condom.</p>\n<p>\"Kid, I know you had to resit a couple of grades, but I've seen your paperwork. I know you're 18. The Hale kid is too, I double-checked. I'm not one to judge, I just want my nephew <em>safe</em> on his date.\"</p>\n<p>\"My <em>paperwork,</em>\" Stiles repeats. And then, \"Derek's <em>eighteen</em>?\" And then, \"<em>It's not a date.</em>\"</p>\n<p>\"The paperwork Fountain Hills Sheriff Department sent through to verify your identity,\" John says, slowly. Talia probably thought she was doing a <em>favor</em> getting him registered as eighteen. <em>Awesome.</em> \"And I wouldn't have thought as someone who's repeated grades that you would want to mock another student for the same condition. Especially one you are going <em>to the movies with.</em>\"</p>\n<p>\"As <em>friends,</em>\" Stiles insists. This is the <em>worst day of his life.</em> Although, knowing Derek might have had to repeat a grade or two might be interesting fuel for when he's back in the future.</p>\n<p>\"A-huh,\" John says, using his favorite talking-to-suspects face. <em>On Stiles</em>. \"I just want you safe, okay? And that includes ensuring you stay away from the woods, and that you keep safe in... other ways.\"</p>\n<p>Stiles frowns. There's always a wild animal alert in Beacon Hills, apparently, no matter what time he's in. But like in the future, he can't exactly reassure his dad that the wild animals are only werewolves, and he knows how to handle them just fine.</p>\n<p>\"Just for this, I'm making something with vegetables for dinner, <em>no complaints,</em>\" Stiles says, grabbing the bag of clothes and the money and stalking off. He turns back after a moment and takes the condom. Maybe Derek and Paige will need it.</p>\n<p>John looks smug, but it's okay. Stiles knows from experience he can break that expression from his face with the aid of copious amounts of broccoli.</p>\n<p>Stiles is his father's kid, meaning he applies the sneakiest method he knows how to ensure John <em>eats</em> the vegetables – he employs his younger self as kitchen aid.</p>\n<p>\"I'm the <em>Sous Chef,</em> dad,\" he keeps saying, over and over. Stiles sets him watching over the boiling vegetables, and throughout the dinner, Stiles' younger self keeps heaping it on his dad's plate and watching, wide eyed, until his dad eats his and praises him.</p>\n<p>It's not the <em>most</em> brilliant comeback Stiles has ever come up with, but it's pretty sound.</p>\n<p>\"Aren't you going to be late <em>for your date</em> if you don't run now?\" John snarks, as Szczepan tries to give him some of the vegetables from his own plate. Man, Stiles' younger self is a bad-ass in the <em>making</em>.</p>\n<p>\"It's not a <em>date,</em>\" Stiles insists, but runs anyway.</p>\n<p>He's definitely grateful for the clothes. His dad has managed to figure out his size pretty well, and it's nice not to be hiking up his pants the whole time, although he kinda wishes his dad <em>did</em> know about the werewolves, because then he could mock him for the ironic choice of the red hoodie.</p>\n<p>Then he actually <em>has</em> to run when he's dressed, because he's got about fifteen minutes to make it to the theater.</p>\n<p>Derek's waiting for him outside, two tickets already in his hand, leaning casually against the wall. Rather predictably he's eschewed plaid for a leather jacket, which throws Stiles' theories out the window that a werewolf has to go through emotional suffering before being allowed to wear one.</p>\n<p>\"Man, you're <em>awesome,</em>\" Stiles says, spotting Paige's dark curls nearer the door as she chats to her two friends.</p>\n<p>\"I asked for tickets to the film involving Dante somehow,\" Derek says. \"I hope this is the right movie.\"</p>\n<p>Stiles peers at the ticket. <em>Our Music</em> is printed across the top. That's the title Paige used. \"Yup. Let me just get you the money for it.\"</p>\n<p>\"Don't worry about it,\" Derek says. \"Maybe you can get the popcorn?\" he adds, squinting at Stiles.</p>\n<p>\"Oh, I can cover the snacks for <em>sure,</em>\" Stiles says, as Paige moves. Stiles steps back to make sure she's not heading to the wrong movie, but it's just to wave her friends into their line. \"C'mon. We don't want them to run out of twizzlers.\"</p>\n<p>\"No. That would be a travesty.\"</p>\n<p>\"Of the highest order,\" Stiles insists.</p>\n<p>\"Yeah. Let's not miss out on the chance for you to chew something straw-shaped aggressively,\" Derek says.</p>\n<p>\"I kind of have an oral fixation,\" Stiles offers.</p>\n<p>\"I'd noticed,\" Derek says. His cheeks are a little pink. It's probably a combination of cold and the lack of ever-present facial hair his future self opts for. Stiles can understand <em>why</em> if his face gets cold easily. \"Hey, you're wearing clothes that don't look like they're about to fall off.\" Derek touches Stiles' waist, as if verifying it, and his touch is warm even through the thick denim.</p>\n<p>\"Yeah,\" Stiles says. \"My… Deputy Stilinski got them for me.\"</p>\n<p>\"And he doesn't know about my… family's situation,\" Derek says, and he moves his hand from Stiles' waist to flick at the red material of Stiles' hoodie. \"Otherwise <em>you</em> wouldn't be dressed so ironically.\"</p>\n<p>\"Yeah, like <em>you're</em> the big bad wolf,\" Stiles scoffs. \"You're basically a puppy.\"</p>\n<p>\"You think so?\"</p>\n<p>Stiles turns to tell Derek exactly what he thinks, which is probably mostly bluster and hot air, but Derek's done that creepy silent moving thing, and when Stiles turns, he almost collides with Derek's face. Stiles lets out a shocked sound and falls back.</p>\n<p>Derek laughs at him. Man, Stiles is getting used to that sound. \"I think that proves I am.\"</p>\n<p>\"Shut up and watch me buy unhealthy foods,\" Stiles says, because he doesn't want to admit Derek's right.</p>\n<p>Stiles buys twizzlers, drinks and popcorn, marvels at the price compared to current costs, and hums happily under his breath. He loves going to the movies, and he rarely has the opportunity to go with someone, let alone a friend. And Derek? Stiles considers the guy walking next to him, with some of the Derek he knows there, and so many <em>new</em> Derek things about him too. Yeah. They're probably friends. Now if not the future versions of them, anyway.</p>\n<p>The clerk lets them into the screen for '<em>Our Music'</em>, and Stiles has to squint because he can never adjust to the lower light that quickly. He nearly trips, and a warm hand at his elbow steadies him.</p>\n<p>\"Here,\" Derek says, \"let me take the droppable things.\"</p>\n<p>\"Such a gentleman,\" Stiles says, his sarcasm automatically coming out, but he is genuinely grateful, so he mutters, \"Thanks,\" as well.</p>\n<p>Derek's eyes almost glitter in the dim light. \"You're welcome. Where do you wanna sit?\"</p>\n<p>Stiles looks over to where Paige is starting to work her way into one of the center seats. \"In the middle,\" he decides, and gives Derek a shove into the right row. \"Move over,\" Stiles says. He mentally counts chairs. \"A little more.\"</p>\n<p>\"Okay,\" Derek says, slowly.</p>\n<p>\"A bit more,\" Stiles says.</p>\n<p>\"Can't,\" Derek says, and it sounds like he's speaking through gritted teeth. \"There's someone sitting in the way.\"</p>\n<p>\"Who?\" Stiles asks, disingenuously.</p>\n<p>\"That <em>'cellist,</em>\" Derek says, like he might say <em>a rat.</em></p>\n<p>\"Who?\" Stiles prompts again, smiling like butter won't melt in his mouth.</p>\n<p>\"<em>Paige,</em>\" Derek says, still not sounding like he's opening his teeth wide enough to talk normally.</p>\n<p>\"Ah, cool, we'll sit next to her,\" Stiles says brightly, and sits down in the nearest seat. He leans over Derek. \"Hey, Paige. Fancy seeing you here.\"</p>\n<p>\"This whole screen is basically empty,\" Paige says, in her clipped, dry voice.</p>\n<p>\"Yeah, isn't it great that we know each other?\" Stiles says. \"Big abandoned theater screens are so empty and unfriendly! This makes it nice and cozy, don't you think?\"</p>\n<p>\"It's weird,\" Paige and Derek say at the same time, and then turn to each other warily.</p>\n<p>\"See how <em>well</em> you two get along,\" Stiles says, triumphantly. \"Wow. Wow, I don't feel good. Y'know. I'm going to go and throw up in the bathroom, maybe. Maybe go home. Enjoy the movie, though!\"</p>\n<p>He gets up and flees, pretty sure Derek and Paige are too stunned to react.</p>\n<p>Stiles hurries out of the theater. He does feel a little nauseous now he's out in the cool air. He tries not to think about what Paige and Derek might get up to, sitting next to each other in a dark theater while a movie in a sexy foreign-language plays out in front of them. Both of them speak French pretty fluently; Stiles remembers their hostile exchange vividly. Yeah, they'll probably be getting on just fine.</p>\n<p><em>Really</em> fine. Paige's dark eyes, wide with arousal, her pretty face flushed. Derek's large hands in her hair, holding her still as they kiss. All that antagonism, translated into intense kissing, hands sliding against skin, warm in the dark.</p>\n<p>Stiles' stomach <em>definitely </em>rolls and he moans, queasily.</p>\n<p>\"You don't sound too good,\" Derek says, and Stiles swallows the frustrated groan he wants to make and comes to a stop as Derek steps out of the shadows.</p>\n<p>Stiles just gestures at his stomach instead of lying. \"Y'know,\" he says, awkwardly. \"Why didn't you stay? You're wasting both of the tickets.\"</p>\n<p>Derek, who's still gingerly carrying the snacks, gives him a weird look. \"I came with my friend. My friend is now feeling sick. What kind of dick would I be to not make sure my friend gets home safe?\"</p>\n<p>Stiles stares at him for a moment. If he didn't know Derek and Paige were totally meant to be, he'd think Derek was doing this stuff <em>deliberately.</em> \"You'd be kind of a giant dick, I guess,\" Stiles says.</p>\n<p>\"Yeah,\" Derek says. \"And I'm not. I might <em>have</em> a giant—\"</p>\n<p>\"—and we're stopping that sentence right there,\" Stiles says, and starts walking again. \"Because I have <em>small</em> self-esteem, and I like to hold onto that.\"</p>\n<p>\"I like to hold onto mine too,\" Derek says.</p>\n<p>\"Oh my <em>god,</em>\" Stiles says, because this is <em>gold</em> flirting material and it's totally wasted, because Paige is back in the movie theater, not here.</p>\n<p>\"My giant <em>reputation,</em>\" Derek clarifies, giving Stiles a sly look. \"What did you think I was going to say?\"</p>\n<p>\"That you're a giant <em>jerk,</em>\" Stiles says, sulkily.</p>\n<p>Derek laughs. \"C'mon. Let's get you home.\"</p>\n<p>When they get to the front porch of the Stilinski house, the door opens before they even press the doorbell.</p>\n<p>\"Saw you coming up the street,\" John says, standing halfway through the door so Derek and Stiles are stuck on the porch. \"Your date finished early, huh?\"</p>\n<p>\"I told you,\" Stiles says, \"it's not a—\"</p>\n<p>\"Stiles didn't feel too well,\" Derek interrupts smoothly. \"So I brought him home.\"</p>\n<p>\"Well, at least he's a gentleman,\" John says, nodding at Stiles. \"I guess he'll do. Is that popcorn buttered or the salty kind?\"</p>\n<p>\"Real butter, the clerk said,\" Derek answers promptly.</p>\n<p>\"Excellent,\" John says, taking one of the boxes and disappearing back into the house. \"C'mon, Stiles. Let's get you sorted out.\"</p>\n<p>Stiles nods, and moves to go into the house, but stops when Derek's hand touches his arm.</p>\n<p>\"Wait,\" Derek says. \"Just a moment. I was going to give you this after the film.\" He puts the drinks down on the step, and fumbles in his pocket, pulling out a flat square. \"It's a CD. A mix. Of rock bands and recent music that uses 'cellos. I thought seeing as you like 'cellos so much you'd—y'know.\"</p>\n<p>\"Oh, cool,\" Stiles says, taking it. He looks at it awkwardly for a moment, not quite knowing how to react to it. It's not really a friends sort of gift. But Derek is… meant for Paige, and totally has to have at least a little crush on her by now, so… maybe he wants Stiles to test the mix before he gives it to Paige? Yeah. That has to be it. \"I'll listen to it as soon as I can and let you know what I think.\"</p>\n<p>\"I'm taking the second box as tax for you keeping my door open so long and letting the heat out,\" John says, suddenly appearing in the doorway and swiping the second box of popcorn. \"Hurry up and say goodbye.\"</p>\n<p>\"D—you <em>shouldn't have that much salt,</em>\" Stiles yells after him, and rolls his eyes. \"I'll see you tomorrow, yeah?\"</p>\n<p>\"No classes together on Thursdays,\" Derek prompts. \"Lunchtime? Usual place?\"</p>\n<p>\"Yeah,\" Stiles says. \"Great.\"</p>\n<p>\"Here,\" Derek says, scooping up the drinks and pushing them into Stiles' hands. \"You should probably keep hydrated if you're not feeling well.\" He pushes the packet of twizzlers into Stiles' pocket as an afterthought, and Stiles desperately tries not to react to Derek's confident touch ridiculously close to his groin. He's a <em>teenager.</em> Hands are supposed to stay <em>above the waist</em>. Derek seems oblivious to Stiles' weird jolt, and he leans in close. \"I hope you feel better soon,\" he says, close enough that Stiles can feel the warm breath of his voice against his skin. Stiles shivers despite himself, and he nods. Derek smiles and pulls back, shoving his hands in his pockets and starting to jog away.</p>\n<p>Stiles watches him go and stumbles inside, nearly dropping the drinks and having to lean against the door while his stupid heart stops racing.</p>\n<p>It's ridiculous. He shouldn't be <em>this </em>upset over his plans not working. Then again, his plans had never involved potentially turning the future into a terrible dystopia. He forces himself to breathe evenly, and practically inhales one of the cups of soda before sinking down onto the carpet.</p>\n<p>\"Thank your boyfriend for me for the popcorn,\" John says, passing through from the kitchen to the living room, a smaller bowl of the popcorn in his hand. He backs up, and stares down at Stiles. \"Are you okay, kid?\" When Stiles doesn't respond immediately, he adds, \"Did Hale <em>hurt</em> you? Because I have a gun and a license.\"</p>\n<p>\"No, he didn't hurt me,\" Stiles says. \"I just need to lie on the carpet awhile and re-evaluate my life decisions.\"</p>\n<p>\"Okay,\" John says, unflappable. That trait will serve him well when Stiles starts to go through puberty. \"I'll need you to move if anyone else comes to the door.\"</p>\n<p>\"Sure,\" Stiles says, and flaps his hand.</p>\n<p>He needs a better plan. Maybe he needs some help.</p>\n<p>##</p>\n<p>\"No,\" Deaton says, down the phone.</p>\n<p>Stiles leans against the payphone, twirling the cord in his hands, watching the students mill around him to their third period classes. Stiles has got Geography, officially, but he might skip it if he can get away with it. \"C'mon. We're halfway through my fourth day. I could disappear at any time. I'm trying everything here. Everything I try, he gets in the way.\"</p>\n<p>\"Have you considered that the <em>\"frenemy\"</em> who told you the story you're attempting to recreate was perhaps not telling the truth?\" Deaton says.</p>\n<p>Stiles pauses. \"Maybe? I mean, I'm pretty sure he was mostly lying?\"</p>\n<p>\"Remind me why we're even having this conversation?\"</p>\n<p>\"Because I know <em>something</em> happens. And I know Paige is involved somehow. Something happens in this time period while the Alphas are here to turn Derek's eyes blue. <em>That's</em> the fundamental part of the timeline.\"</p>\n<p>Deaton pauses. \"Blue, you say?\"</p>\n<p>\"You know something about it?\"</p>\n<p>\"It usually happens to a werewolf when they've experienced great negative emotion,\" Deaton says. \"Something which brings a cost to their soul.\"</p>\n<p>\"Like killing an innocent,\" Stiles says.</p>\n<p>\"Or powerful grief.\"</p>\n<p>\"Both of which I have to engineer happening,\" Stiles says, heavily.</p>\n<p>There's silence from the other end of the line. \"You must push through,\" Deaton says.</p>\n<p>\"It's weird, though. I mean. I remember some of this happening.\" Stiles shakes his head. \"I mean, the younger me remembers <em>me.</em>\"</p>\n<p>\"Then you may have nothing to worry about,\" Deaton says. \"Chances are anything you do has already happened.\"</p>\n<p>\"So I could tell everyone about the terrible… terribleness and nothing would change?\"</p>\n<p>Deaton sighs. \"Are you willing to risk it? That's the bet you take, as every time-traveller conscious of the balances of the supernatural world has to take. Are you willing to bet the reality you know? Are you willing to risk that your actions <em>won't</em> cause deadly ripples throughout time? I don't think you are, Mr. Stilinski.\"</p>\n<p>Stiles' hand trembles on the receiver. \"I don't want the responsibility of the world turning to shit,\" he says. \"I also don't want the responsibility of knowing there was something I could have done to stop the terrible things that <em>will</em> happen.\"</p>\n<p>\"We all have to bear unhappy burdens when immersed in the wonderful world of lycanthropy, Mr. Stilinski,\" Deaton says. \"The losses we suffer as human voyeurs are often undocumented, mostly unnoticed. The price we pay to stay members of this world is often beyond the pale. But knowing? Being invited to stand alongside the creatures that bloom in the night? The price is usually worth it.\"</p>\n<p>There's wonder in Deaton's voice, wonder that is a little more jaded in the Deaton of his time, a little more weary. \"Usually,\" Stiles repeats, his voice hitching on the second syllable.</p>\n<p>\"Even time cannot make an infinite promise,\" Deaton says, sounding sad. \"Now if you excuse me—\"</p>\n<p>\"Yeah,\" Stiles says. \"Yeah.\" He hangs up the receiver, and sighs heavily. It's all a bet, in the end, and Stiles doesn't want to bet red or black, but he can't run the risk of doing absolutely nothing.</p>\n<p>Putting the Derek and Paige love story back on track is the closest thing to a sure bet he has. Stiles sighs, and goes in hunt of someone to write a couple of notes for him. His handwriting is much too distinctive for this part of the plan.</p>\n<p>After his plan is put into motion – one note in Derek's locker, one in Paige's, both asking to meet a secret admirer in the distillery Peter mentioned a few times in his tale – Stiles heads for third period with a spring in his step. He doesn't even scowl through Gym class in fourth period, even though he spends most of the session holding up his borrowed sweatpants with both hands, getting smacked by a hundred balls (and not even in a sexy way.)</p>\n<p>He buys lunch in the hall, and is bringing it outside when something new happens.</p>\n<p>\"Hey,\" Paige says, from her usual seat. Stiles stops by her table, and hopefully puts his tray down on the edge. \"Not today,\" she says. \"Or in this lifetime.\" Stiles picks it up. Over Paige's shoulder, Derek's staring balefully in their direction. \"I just wanted to make sure you were okay after yesterday. It was a great film. It would have sucked if I missed it because of a stomach bug.\" She eyeballs Stiles' tray – water and curry. \"You seem okay today.\"</p>\n<p>\"It was just a twelve hour thing,\" Stiles says, waving his hand. \"I guess I'll go.\"</p>\n<p>Paige nods at him. \"<em>I</em> would.\"</p>\n<p>Stiles hurries on, because it sounds like a threat, and he knows one thing for sure about 'cellos – they come with huge spikes on the end.</p>\n<p>He knows his plan has already been successful because Derek's in a weird mood right through lunch, staring in Paige's direction with a strange expression. Peter joins them again, which is really freaking annoying, and the whole hour is a strange tableau of Derek glaring and Peter making snotty remarks about Paige's creamy skin and Stiles looking awkwardly between all three of them. He tries not to think about what Derek and Paige will do when they find themselves alone in an abandoned location.</p>\n<p>Probably kiss, Stiles decides. Run their hands over each other's body. Maybe Derek will even push Paige into a wall. Derek's really good at that, Stiles knows from experience, because he's strong and capable and <em>really</em> knows how to manhandle a guy. His eyes go unfocused for a moment. It's not that Stiles had ever <em>wanted</em> Derek to manhandle him, but he gets a mental flash of how good it would feel for Derek to do it with <em>positive </em>intent, and oh god, it's a good thing that Stiles is already sitting down and that the tables outside cover all possible… situations.</p>\n<p>It's got to be normal to be having the occasional sexual thought about someone so close to you, right? Stiles thinks it has to be normal. The Derek of this time has been absurdly thoughtful and nice to him, and is not afraid of bodily contact. It's only <em>natural</em> that Stiles might get a little, uh, excited around him sometimes. Right?</p>\n<p>Ugh, Stiles life officially <em>sucks.</em></p>\n<p>\"Wow,\" Peter says, sniffing the air and eyeballing Stiles strangely. \"You must really like that curry.\"</p>\n<p>\"Oh my <em>god,</em>\" Stiles moans, and buries his face in his hands while Peter chuckles. \"Werewolves and your insane super noses. Believe me, Peter Hale, if I don't tell you enough in the future: You're the worst person in the <em>world.</em> If you even categorize as human.\"</p>\n<p>\"You're planning to be around in the future, then?\" Derek asks quietly from Stiles' side, the first words he's really spoken to Stiles all day.</p>\n<p>Stiles looks at him. \"Yeah,\" he says. \"Of course.\"</p>\n<p>\"I'm glad,\" Derek says, and he reaches out, touching Stiles' hand. Stiles nearly jolts, Derek's hand on his nearly too much after the mental gymnastics Stiles' brain has decided is a good idea. <em>Derek's hands on his waist, pushing him into the wall.</em> Argh. Time travel has melted his mind. Obliterated it. \"I didn't like the idea of you only being here temporarily.\"</p>\n<p>\"Derek's had the future on his mind quite a lot,\" Peter says, trying to be enigmatic, and just looking a little psychotic.</p>\n<p>\"Shut up, Peter,\" Stiles says, which makes Derek snort with laughter, and Stiles can't help but join in. Even if he's feeling a little weirdly <em>jealous</em>. That's it. That's what he's feeling. He's oddly <em>jealous</em> that it's going to be Paige in Derek's arms tonight and wow, that's weird as <em>hell.</em></p>\n<p>It's just because he's lonely. He misses Scott. He misses his dad <em>knowing </em>he's his dad. He misses Allison and Lydia and Isaac and Cora's snark and Derek's snarls and even a little bit, Peter's sassy evil, because Peter's younger self keeps aiming for melodramatic and hitting pantomime, and it's a little embarrassing, actually. It's nice to know his dramatic performances do improve with practice.</p>\n<p>\"I'm glad you're here,\" Derek says, and Stiles smiles at him helplessly.</p>\n<p>He's kind of glad he is too. It's going to be hard saying goodbye to this unbroken Derek, and go back to a future where he and Derek are frenemies at best.</p>\n<p>Very hard indeed.</p>\n<p>##</p>\n<p>Come Friday morning, and the Physics class he, Derek and Paige share, Derek is in a storming mood.</p>\n<p>Stiles isn't at the top of his game, having tossed and turned all night in antsy anticipation of what Derek and Paige got up to at the distillery. He's tired, got a burgeoning headache, and is a little moody.</p>\n<p>It's nothing compared to the clouds on Derek's face.</p>\n<p>\"What happened?\" Stiles asks, sliding into the stool next to him. Damn. He totally forgot to manoeuvre to have him sit next to Paige. Oh, well. That's what last night was for.</p>\n<p>Well, it was <em>supposed</em> to be, anyway. Stiles has never actually gotten laid, yet. But he's pretty sure if you've gotten up close and personal with someone, even with just kissing involved that hasn't ended up with the person you've known for practically all your life as a virgin sacrifice, that you don't end up <em>that </em>grumpy.</p>\n<p>Unless Paige is dead. Oh, my god. Stiles is quietly working himself up to a whole new panic attack, and Derek stops it, putting his hand firmly over Stiles' hand, and holding on tight. \"Calm down,\" Derek says, moving in closer so Stiles can only focus on Derek's stupidly attractive young face.</p>\n<p>\"Yeah,\" Stiles says. \"Sorry.\"</p>\n<p>Derek's wrinkling his nose but he still snorts out a laugh. \"It's not like you <em>want</em> to have panic attacks. Anxiety disorders are horrible things that you don't do deliberately. Just listen to my voice and keep <em>breathing</em>. Okay?\"</p>\n<p>\"Okay,\" Stiles says, and manages to just about control himself. He imagines he can feel Derek's heartbeat through their joined fingers, and that helps. Soon he's breathing again, something which is aided by Paige coming into the room, looking harassed. She also sends a dirty look in Derek's direction, and he scowls back at her. \"Okay. What <em>happened</em>?\"</p>\n<p>\"Nothing,\" Derek says, automatically.</p>\n<p>\"That was too fast a denial,\" Stiles says, promptly. \"Which means it's a lie. You're grumpy. Paige is grumpy. I think these two events are linked.\"</p>\n<p>Derek pushes an undignified sound through his nose which sounds partially like a wolf growling. \"Someone played a prank on us yesterday, leading us both to a distillery. It was a <em>nightmare</em>. The whole place reeked of blood, and she kept accusing me of setting her up to embarrass her. The Alpha packs came around, and I barely only just hustled her out there just in time.\"</p>\n<p>\"Ugh,\" Stiles agrees. \"Sounds like you were her hero, then.\"</p>\n<p>\"She doesn't think so,\" Derek says. \"She punched me in the arm and ran to her car, shrieking insults so loud that the Hunter pack patrolling nearly caught me. I had to run all the way into town and hide out in the 24/7 Diner. I didn't get any sleep. It's not funny.\"</p>\n<p>\"I'm not laughing,\" Stiles says. \"My smile is an ironic smile at the fact that life never works out for you.\"</p>\n<p>\"Shut up,\" Derek says, rolling his eyes but managing a slight smile. He's still mad, though, and his eyebrows do that <em>thing</em> which normally make Stiles want to run and hide somewhere far away from any werewolves for a long time, but which just looks kind of adorable on teenager Derek.</p>\n<p>\"It's a good thing it was <em>you </em>that was set up with her and not anyone else,\" Stiles offers. \"She could be dead. They would both be dead. If it wasn't for you.\"</p>\n<p>\"I guess,\" Derek says. \"I like the way you look at the world, Stiles. It's—\"</p>\n<p>\"Hopelessly romantic, I know,\" Stiles says. \"Scott – my best friend – he's always saying that's why I end up stuck in unrequited love the whole time. I spy the first pretty girl and fall impossibly in love, because I can't see any flaws.\" Stiles chuckles ruefully and shakes his head. It's been true of Lydia in the past, but his inability to see her flaws is a thing long past, now. He's even at the point, Stiles thinks, where he isn't seeing her flaws as completely adorable.</p>\n<p>\"Oh,\" Derek says, in a smaller voice. When Stiles looks at him, Derek seems more withdrawn.</p>\n<p>\"Wow, you really look sunk,\" Stiles says. \"You got any free periods today where you can get some sleep?\"</p>\n<p>\"Not today,\" Derek grunts. \"I could do with an afternoon nap, but my house is bedlam. One of the downsides of a huge family.\"</p>\n<p>\"Maybe there's someplace in school that's quiet after hours,\" Stiles offers, because he doesn't want to start Derek listing the negative sides of a huge family.</p>\n<p>Not when Derek won't <em>have</em> that huge family for as long as he thinks. Stiles' stomach knots guiltily again. This whole <em>not telling anyone anything</em> thing is torture. He can see why it's listed alongside <em>evisceration</em> and <em>castration</em> as a negative side effect to a badly-cast spell.</p>\n<p>\"Maybe,\" Derek agrees.</p>\n<p>Stiles is still feeling guilty, though, and he wants to do <em>something</em> that will make Derek feel better. He remembers the mix CD with a start, and grabs it out of his bag. \"Oh, man, I meant to tell you – it's great. I love the way you mixed the faster songs with the slower ones.\"</p>\n<p>Derek looks at Stiles, his expression brightening. \"You liked it?\"</p>\n<p>\"I did,\" Stiles says. \"I think Paige will <em>love</em> it.\"</p>\n<p>\"Oh,\" Derek says, and his entire face shuts down.</p>\n<p>Stiles frowns. \"What—\" he starts.</p>\n<p>\"Yeah, I'm sure Paige will love it,\" he says. \"I hope you get a chance to make her listen to it.\"</p>\n<p>Stiles deepens his frown. \"You want <em>me</em> to deliver it to her? Sure. I mean I can.\"</p>\n<p>\"Whatever's good for you,\" Derek says, in a tight tone, and he looks away from Stiles to the board.</p>\n<p>Stiles' frown does not feel like it's going to go away any time soon. His headache latches onto it and rolls around possessively, and he sighs. Of <em>course </em>this is when Derek would turn into a conscientious student, when Stiles still wants to talk.</p>\n<p>Then again, Stiles always want to talk.</p>\n<p>Frustratingly, even though Derek's supposed to be in French with Stiles, he's not. Stiles manages to score Paige as a partner, and she's amazingly patient. Stiles can't help think she would be <em>perfect</em> for Derek, a great foil to Derek's lurking furious side. And when it's lunchtime, Stiles goes to look for Derek, but he's not there.</p>\n<p>The only thing he does get is a note from one of Derek's jock friends during last period, asking Stiles to meet him in the music room.</p>\n<p>The music room where Paige normally practices.</p>\n<p>Stiles resists the urge to punch in the air and do his Snoopy victory dance, because the class still isn't over yet. Derek's finally going to man up and tell Paige how he feels about her, and needs Stiles as bro-support. Everything is <em>finally</em> going to plan.</p>\n<p>He turns up in the music room on time, but it's empty, so Stiles sits on one of the chairs, idly playing the piano. He took it for a couple of years before his attention disorder was identified, but he couldn't concentrate long enough to manage anything more than a dubious two-handed performance of Mozart's Minuet in G.</p>\n<p>He can still remember it, though.</p>\n<p>\"Nice playing,\" Paige's voice floats through from the doorway. Stiles looks up from the piano, promptly stops playing, but smiles at the compliment.</p>\n<p>\"Thanks,\" Stiles says. \"I bet I'm not as good as you.\"</p>\n<p>\"Maybe on the piano you might have me beat,\" Paige allows, heading for her 'cello case and unsnapping the clasps to get to the instrument inside. She pulls out her bow first, and rubs rosin on the hairs, the white dust clouding into the air around her. \"Your note said that you wanted to talk?\"</p>\n<p>Stiles blinks. \"<em>My</em> note?\"</p>\n<p>Paige pauses in her rosin application. \"Oh, man. Don't tell me it's happened again. Two times in one day makes it fool on me.\" She pulls a piece of paper out of her pocket. Stiles hurries over and snatches it.</p>\n<p>\"<em>Hey Paige. Can I talk to you tonight? Music room 4, 4.30pm? SS.</em>\"</p>\n<p>\"SS is you, right?\" Paige says.</p>\n<p>\"Yeah,\" Stiles says. The handwriting is familiar. Stiles recognizes it with a sinking feeling. It matches the note he got from Derek. The one sending him here <em>and</em> the one on his car the other day.</p>\n<p>\"Derek sent them,\" Stiles says, realizing it. He slumps back against a music stand which instantly wobbles. He catches it, and scowls at it for nearly tumbling him to the ground. Because it totally <em>is</em> the music stand's fault. \"And… Derek's not coming.\" He sighs. \"Because he thinks I like you because I talk about you all the time.\"</p>\n<p>\"Do you?\" Paige asks, pulling out her 'cello and untwisting the spike at the end. Stiles' eyes track the spike. It has a dull end, but it could do some damage if swung with force, he guesses. <em>Spike</em> is probably too melodramatic a term, now Stiles thinks about it. \"Like me?\"</p>\n<p>\"Sure,\" Stiles says. \"You're funny. Talented. I think you and Derek would make an <em>awesome</em> pair.\"</p>\n<p>Paige narrows her eyes, but she hasn't run at him with the 'cello screaming yet, so he forges ahead. This is his best chance to win her over to the Derek Hale express. All aboard. Yeah, Stiles needs to work on his internal monologues.</p>\n<p>\"He'd be good for you,\" Stiles insists. \"I know he comes across like a bit of a douche, but when you get below that layer, he's a good guy. He has a great heart, and an amazing family. He's funny, witty, <em>relentlessly</em> conscientious, I mean, I'm new in town and he had me over at his house to study because I was behind. And he walked me home when I felt ill at the movie theater.\"</p>\n<p>Paige laughs, but it's a sarcastic one. \"It sounds more like <em>you</em> like Derek, hon.\"</p>\n<p>\"What?\" Stiles says, and shakes himself. \"Yeah, I mean. Of course I do. I wouldn't be trying to sell you bad merchandise.\"</p>\n<p>\"I mean it sounds like you <em>like</em> like him, Stiles,\" Paige says, resting her 'cello on her knees, and placing some music on her stand. \"And he likes you too. We've all noticed it. Normally he's with his jock friends all the time, playing basketball, but he's been following you around like a <em>puppy.</em>\"</p>\n<p>\"What?\" Stiles says.</p>\n<p>\"And Jenna said she overheard you talking to him about a mix CD he made you,\" Paige says. \"Do you think that's just friend behavior? It's not. Mix CDs are <em>feelings</em>.\"</p>\n<p>\"He made that for you—\" Stiles starts, and then closes his mouth, because Derek never actually <em>said</em> it was for Paige. Stiles just assumed, because mix CDs were for crushes, and Derek and Paige—</p>\n<p>\"I thought it was full moons that were supposed to make people crazy, not new moons,\" Paige says, thoughtfully, \"but—\"</p>\n<p>\"Wait. <em>Wait.</em>\" Stiles straightens, and runs to her. \"What did you just say?\"</p>\n<p>\"That full moons were supposed to make people crazy,\" Paige starts, frowning.</p>\n<p>\"But <em>new</em> moons—\"</p>\n<p>Some things come together in Stiles' mind, very quickly. Peter's story might have been mostly baloney, and completely wrong as it turns out – even though some of the events (lunchtime staring, seeing them at the distillery) have occurred the same – but there's some parts of it which probably aren't true.</p>\n<p>\"Paige, this is going to sound really bizarre,\" Stiles says, slow and level. \"But would you trust the nephew of a respected local Deputy just this once? For me? <em>Please</em>?\"</p>\n<p>\"What is it?\" Paige asks, frowning.</p>\n<p>Stiles looks at her, trying to convey the importance of his words. \"I can't explain it, but there's going to be someone in school tonight. Someone who will <em>hurt</em> you if you don't leave. Now. I need you to pack up, get in your car, and just go <em>home</em>. Please.\"</p>\n<p>Paige frowns. \"But I—\"</p>\n<p>\"Do you want to die?\" Stiles looks out the window. It's November. The nights are too short. Darkness is already creeping down. If Peter's been up to the tricks Stiles is imagining, Alpha Ennis might be here <em>now.</em> He looks at her, desperately. \"Please. Please just go.\"</p>\n<p>For once luck's on Stiles' side, or maybe Paige is just as clever as Stiles think she is, because she pushes her 'cello safely back in its case, locks it back up in the closet, and picks up her bag, hurrying out of the school.</p>\n<p>Stiles escorts her as far as the side door that leads to the parking lot, and watches as she hurries out to her car. It's only then that he can breathe.</p>\n<p>At least she's safe. He exhales slowly, and that’s when he realizes – he really should probably be going for his car too. He's about to step out when a hand touches his, and Stiles whirls to see Derek.</p>\n<p>Derek, who made him a mix CD.</p>\n<p>Derek, who maybe possibly <em>likes</em> him.</p>\n<p>Likes <em>him.</em></p>\n<p>In all fairness, it's not completely Stiles' fault he missed all the clues, because future Derek has engineered a lot of harm on Stiles' body, and threatened a lot more.</p>\n<p>\"You turned her down,\" Derek says, sounding surprised. He steps closer into Stiles' personal space, and Stiles' heart thumps in his chest. This Derek likes him, but will he when he knows Stiles could have spoken five words and saved his family from burning to death?</p>\n<p>Stiles thinks of Kate Argent, unsatisfied from not finding the werewolves, being so consumed with anger that she burned down the whole <em>town </em>to the ground to find him. Things could <em>always</em> be worse. Always. It's not very comforting to know that's the one consistent thing that time has to offer.</p>\n<p>\"We have to go,\" Stiles says, instead of answering the question, because any answer he gives now will just lead to humiliation in the future. If Derek asks if Stiles likes him back, for example, Stiles doesn't know if Derek will believe any answer he can give. Mostly because Stiles isn't entirely sure what that answer might be.</p>\n<p>\"Just tell me,\" Derek says, not letting go, staring at Stiles. \"Why didn't you open up to her?\"</p>\n<p>\"She's not what I want,\" Stiles says, because that is a truth that's easy. \"C'mon. Let's go.\"</p>\n<p>\"She's not what I want, either,\" Derek says.</p>\n<p>Stiles shakes his head. \"She is,\" he insists. \"You love her. I mean. You <em>could</em> love her. You can love her. You <em>should.</em>\"</p>\n<p>\"I don't know her,\" Derek says. \"I don't even <em>like</em> her.\"</p>\n<p>\"She's perfect for you,\" Stiles says, miserably. \"Believe me, I know. She's brilliant and here, and perfect, and me, look at <em>me.</em> Yet again, I'm useless and I'm… in the way. I'm just <em>in the way.</em>\"</p>\n<p>\"Don't talk about yourself like that,\" Derek says, his eyes flashing yellow, amber beacons in the lengthening dark. He sounds really angry. Stiles is more used to this side of Derek. \"I hate hearing you criticize yourself. You're amazing. I <em>like</em> you.\"</p>\n<p>\"I'm a decent enough friend, I guess,\" Stiles mumbles.</p>\n<p>\"No. Paige was right,\" Derek says, and he takes a deep breath and looks Stiles deeply in the eyes. \"I <em>like</em> you. A lot.\"</p>\n<p>His voice is ridiculously tender. Stiles opens his mouth to protest, but any words he might make are swallowed up when Derek courses forwards and kisses him. Stiles startles at the hot touch of Derek's mouth to his own, and Derek takes advantage of his shock, licking soundly and securely into his mouth.</p>\n<p>\"I like you, Stiles,\" Derek murmurs, breaking for just the span of a breath before surging forwards and kissing him again. His hands fit securely against Stiles' hips, and they collide against the door that leads outside, and Stiles is confused and panicked and <em>glorious</em> all at once. Derek kisses like he wants to own Stiles, inside and out, and Stiles whines into the kiss, high-pitched and needy.</p>\n<p>After what's maybe a second, or maybe an eternity, Derek manages to move his mouth away from Stiles', and he rests their foreheads together.</p>\n<p>\"You love me too,\" Derek says, breathless and triumphant, and Stiles' heart pounds, because <em>no, </em>it's not possible, Derek and <em>Paige</em> are supposed to—It's not supposed to be Derek and <em>Stiles</em>—</p>\n<p>\"No,\" Stiles breathes, and the word spills out like acid.</p>\n<p>One of Derek's hands splays on Stiles' chest, over his heart. \"That's a lie,\" he says. \"God, you drive me crazy. You're funny, and so <em>earnest</em>, and the way you fall over <em>everything,</em> it just makes me want to keep you safe forever.\" Derek's mouth moves down to Stiles' jaw, and he kisses along the bone. \"I love you, Stiles,\" he says. \"I can feel that you love me too.\"</p>\n<p>Stiles makes another incoherent sound. His heart thumps in his ears and he's so dizzy that all he can do is cling onto Derek, his hands clasping around his neck helplessly. He's the wrong person Derek should be saying this to right now.</p>\n<p>Derek's supposed to be falling in love.</p>\n<p>Derek's supposed to be having his heart metaphorically ripped out tonight.</p>\n<p>\"I'll love you forever,\" Derek murmurs into Stiles' skin, and Stiles' heart almost tattoos right out of his chest.</p>\n<p>Because Peter's story was the truth, but Peter's too much of an outsider to the story. Derek's going to lose his first love tonight.</p>\n<p>But it's not going to be Paige.</p>\n<p>It's going to be <em>Stiles.</em></p>\n<p>\"It drove me crazy,\" Derek whispers, clinging onto Stiles. \"I kept hearing you <em>muttering</em> about her.\"</p>\n<p>\"Yeah,\" Stiles says. \"Your werewolf superhearing. We should. Uh. We <em>really</em> need to get the hell out here, by the way.\"</p>\n<p>\"You should listen to him,\" a voice says stridently, echoing down the hall.</p>\n<p>\"Who the hell are you?\" Derek demands, immediately pushing Stiles behind him.</p>\n<p>Ennis steps out of the shadows, smiling, his claws already extended. Derek automatically wolfs out, snarling.</p>\n<p>\"So you're the werewolf,\" Ennis says, nodding at Derek. He looks over Derek to look directly at Stiles. \"Which makes you the human that young Peter Hale told me about. How about it, kid? I need a new pack member. You're human.\"</p>\n<p>Derek steps forwards, head lowered. \"You'll have to go through me first.\"</p>\n<p>\"It can be arranged,\" Ennis says, smiling cruelly. \"Why stop me, though? If he's a wolf, you two can stay together forever. I've always wanted a Hale on my pack.\"</p>\n<p>\"Stiles,\" Derek says. \"I need you to do something for me.\"</p>\n<p>\"Is it running?\" Stiles says. \"I can run.\"</p>\n<p>\"Yep,\" Derek says, and he growls, low in his throat. \"<em>Now</em>!\"</p>\n<p>As much as Stiles loves to see werewolf on werewolf action, he hasn't survived this long by being an idiot – Derek survives, Derek <em>always</em> survives, and he keeps that thought in his mind as he makes a run for it.</p>\n<p>Stiles' heart is pounding, and his hands shake as he pulls out his keys. He's pretty practiced at running away, though, and he manages to gun the engine pretty quickly. He squeaks out of the parking lot as the side door bursts off its hinges and the dark shape that is Ennis running at Alpha speed starts hurtling towards him.</p>\n<p>Stiles puts his foot down. He hasn't had months and months of practice driving at unsafe speeds around sharp bends for nothing. Ennis might be an Alpha and able to run as fast as a motorized vehicle, but he doesn't have Stiles' knowledge of Beacon Hills.</p>\n<p>He has two destinations in mind. One is the Animal Clinic – Deaton's mountain ash fixtures are constantly helpful. The other is the Hale house. Talia Hale is formidable enough to stop even Ennis in his tracks, Stiles thinks.</p>\n<p>He keeps his foot down on the accelerator, and Ennis cuts him off from the Animal Clinic, so Stiles goes for his second option – the Hale house.</p>\n<p>It's a risk, but he goes through downtown Beacon Hills. There are people around, but Ennis is thankfully so focused on the thrill of the chase that he doesn't seem to stop to consider new victims. Stiles uses his knowledge of the area to ditch Ennis for the moment, although he knows it won't last for long, before he guns into the stretch of mostly-abandoned road that will lead to the Hale house.</p>\n<p>Stiles thinks he's even going to make it when he sees the accident, and recognizes one of the figures standing on the side of the road, arguing about whose fault it is.</p>\n<p>Ennis might ignore the people in suburbia, but there's no way he would ignore four teenagers out in the middle of nowhere. Stiles slams on the breaks and hurtles out of the Jeep.</p>\n<p>\"Stiles,\" Paige says, \"what are you—\"</p>\n<p>\"I don't care,\" Stiles says, as the two girls and one boy Paige is talking to turn in his direction, staring at him awkwardly. It looks from his one glance that these idiots smashed into Paige's car, but that's not the point. Ennis is on the hunt for fresh blood, and these idiots are in the middle of nowhere. \"You need to get in my Jeep. There's a killer on the loose. We need to get to safety. <em>Now.</em>\"</p>\n<p>\"Too late,\" the one boy yells, pointing behind Stiles, and Stiles whirls, expecting to see Ennis, and seeing instead the one thing that just reinforces Stiles' faith in endless ironies.</p>\n<p>\"A mountain lion?\" Stiles yells. \"<em>Seriously?</em>\"</p>\n<p>\"Your Jeep, you said,\" Paige says, backing up slowly, crowding into Stiles' side. \"Maybe if we move slowly—\"</p>\n<p>Moving slowly isn’t enough, because the mountain lion isn't alone, and the face of the main lion crumples into an unhappy scowl as its two friends creep from behind to join its friend.</p>\n<p>\"Run,\" Stiles yells, and he turns to run, and it's not enough. He can feel the heavy weight slam into his back, and the burn of a claw slicing through the hoodie he's wearing, into the soft flesh of his back, and it hurts, <em>it hurts,</em> and it's ridiculous, dying on the side of the road, on a matter completely unrelated to <em>anything.</em> There's blood everywhere, over his face, dripping into his eyes, and he yells in frustration, fingers clenching into the ground. Beside him, he can hear Paige screaming, and he sort of wants to laugh, because it's so ridiculous, and he tries to escape anyway, his limbs flailing, and he readies himself for one last blow to take out his spine—</p>\n<p>—and he feels a familiar tug and dizziness wash over him.</p>\n<p>He just has time to think <em>the spell?</em> before darkness overwhelms him and he remembers nothing more.</p>\n<p>##</p>\n<p>Stiles inhales a few times groggily, unable to open his eyes. His back hurts, and he's probably crying, if that sound means anything.</p>\n<p>Yeah, his face is wet. He's crying. Stiles blinks a few times, and groans when light floods his vision.</p>\n<p>\"Time travel sucks,\" Stiles says. \"Am I dead?\"</p>\n<p>\"You're hurt,\" Scott's voice says, as if from very far away. \"But we think you'll live. What the hell happened to you?\"</p>\n<p>Stiles manages to semi open his eyes. White floods his vision. A hospital. Oh. Yay. His favorite. \"Mountain lion, if you believe it,\" Stiles says, and reaches up a hand to rub his forehead.</p>\n<p>\"Jesus,\" John breathes irreverently from his other side, and Stiles is so glad he didn't open with <em>werewolves,</em> because <em>damn.</em> Although he seems to have gotten away with <em>time travel.</em></p>\n<p>Stiles feels better knowing his dad's there, despite the almost slip.</p>\n<p>\"Scott, go get the nurse and tell them Stiles is awake.\"</p>\n<p>\"Got it,\" Scott says.</p>\n<p>\"Wait,\" Stiles croaks, trying to push himself up and failing miserably. \"Does Derek know I'm alive?\"</p>\n<p>\"<em>Derek,</em>\" John repeats, and Stiles grimaces. \"Derek Hale?\"</p>\n<p>Oh, yeah. The constant ongoing fun of the <em>getting Derek arrested</em> <em>a lot</em> thing. Wow. Derek probably <em>hates </em>him in this time. Even despite what he said, which to Stiles feels like just minutes ago, and which is making him blush like an idiot now. \"Oh, god, that expression. Do I have to go through this with <em>both</em> of you?\"</p>\n<p>\"Huh?\" Stiles says.</p>\n<p>\"Your cousin had a thing for him too,\" John says, sinking into the visitor's chair.</p>\n<p>\"Oh, yeah,\" Stiles says. \"My awesome cousin Stiles, yay.\"</p>\n<p>Scott's still frozen in the doorway.</p>\n<p>\"Scott,\" John barks. \"Some time today, perhaps?\"</p>\n<p>\"Yeah, Derek knows you're alive,\" Scott says, and disappears.</p>\n<p>John reaches out and takes Stiles' hand. Stiles smiles at him. \"See, I'm fine, dad,\" Stiles says. \"I just attract trouble.\"</p>\n<p>\"Trouble called Derek Hale,\" John mutters.</p>\n<p>\"You mean trouble called <em>mountain lions,</em>\" Stiles says.</p>\n<p>John just glares at him, but that glare fades away into manfully repressed tears. \"I'm glad you're okay, kid. Stop doing this to me, though, if you can?\"</p>\n<p>\"I'll try,\" Stiles promises.</p>\n<p>Because the cuts are vaguely shallow, the nurses let him sit up by the afternoon, and apply a dressing that Melissa promises to come over daily and change. Stiles' dad has to go back on shift, and Scott wheedles his mom until she allows the whole pack to crowd into Stiles' room for ten minutes.</p>\n<p>\"I promise,\" Scott says, crossing his fingers behind his back. \"Only ten minutes.\"</p>\n<p>Peter's not counted in the pack that Scott announces. Stiles can't help the relief.</p>\n<p>\"Oh my god,\" Lydia breathes, hurtling to his side. \"I'm so sorry. I should have told Isaac to wash the knife. Deaton's pretty sure that's what did it.\"</p>\n<p>\"Yeah,\" Isaac says sourly. \"He seemed to know the answer <em>immediately.</em>\"</p>\n<p>\"Yeahhh,\" Stiles says slowly, wincing. \"How about that, huh?\"</p>\n<p>\"I <em>told</em> you he wouldn't get the genital disease side-effect,\" Cora says to Lydia.</p>\n<p>\"How are you feeling?\" Allison asks.</p>\n<p>\"Fine,\" Stiles says. He looks up, and can't help but swallow when he sees Derek. He meets Derek's gaze challengingly. It's <em>hours</em> for Stiles and nearly a decade for Derek, but Stiles isn't going to forget it any time soon. \"It was a mountain lion. I think it killed Paige. I'm sorry.\"</p>\n<p>\"I know,\" Derek says, in a curiously flat voice. \"I found her body.\"</p>\n<p>So that part of Peter's story was right, too. Peter will have found Derek hiding, curled up around Paige's body, grieving. Only he wasn't grieving <em>Paige.</em></p>\n<p>Deaton said <em>powerful grief</em> was another cause of a werewolf's blue eyes.</p>\n<p>\"And I'm sorry,\" Stiles says, and he doesn't care that the others are watching on, confused and curious, \"I knew about the fire and I couldn't tell you. I wanted to—\"</p>\n<p>\"It's fine,\" Derek says, still in that terse and unemotional tone, and Stiles' heart jolts like someone's split it with a crack, because he's seen Derek with his emotions free.</p>\n<p>This reserved, cautious, older Derek is breaking his <em>heart.</em></p>\n<p>\"Stiles,\" Derek says, and there's a little bit of his younger self creeping into his tone now. \"I know about time travel. Don't you think I looked into it, afterwards? Hoping I could go back in time and stop <em>everything</em> bad? If you deviate from the path, time travel is always, <em>always</em> worse.\"</p>\n<p>\"You travelled in time?\" Scott asks, finally getting it. \"Dude. <em>Awesome.</em>\"</p>\n<p>Stiles manages to tear his gaze away from Derek long enough to look at his friend. \"Yeah,\" Stiles says. \"Turns out I <em>am</em> cool cousin Stiles.\"</p>\n<p>Scott looks like he's about to explode. \"That's the coolest thing I ever heard.\"</p>\n<p>\"I know, right?\" Stiles grins, but the smile falls away, and he shrugs, uselessly. \"It was…\" He looks back at Derek, and his breath catches in his throat. <em>I'll love you forever. </em>\"Illuminating.\"</p>\n<p>Derek looks back at him, and Stiles can't help himself. He doesn't care if the following years have closed Derek's heart to him, because he's <em>alive,</em> and he doesn't care about anything but having Derek underneath his fingers again, physically able to <em>feel</em> that he's okay.</p>\n<p>With a determined, rough exhale, Stiles pushes himself fully out of bed and throws himself at Derek.</p>\n<p>Derek catches him, and a laugh startles out of him before he can hold it back, and his nose buries into the soft skin of Stiles' neck. The stubble is a new brand of friction, but Stiles' body knows this warmth, and he buries into it.</p>\n<p>\"Dude,\" Scott says behind him, \"<em>what</em>?\"</p>\n<p>\"Mom found me in the basement two days later,\" Derek says. \"Eyes blue. I thought I'd got you killed. Because I wasn't strong enough.\"</p>\n<p>\"Blue eyes can be from grief,\" Stiles says, clutching at him, ungainly and half-terrified. Some of the pain seeps from him, and he doesn't know whether it's Derek's werewolf pain-stealing, or just his reassuring presence.</p>\n<p>\"Loss,\" Derek clarifies. \"I thought I lost you.\"</p>\n<p>\"We did,\" Lydia says. \"That spell was hairy.\"</p>\n<p>\"With all the body parts that the sheriff department found—\" Derek laughs, thin, unamused. \"I thought you were dead.\"</p>\n<p>Stiles shakes his head. \"But when you saw me in the preserve with Scott, that first time, you have to have thought—\"</p>\n<p>\"You had an older cousin with the same name. That's all anyone knew. That's what the school records said.\"</p>\n<p>\"And Peter assumed it was Paige that made you blue eyed because…\"</p>\n<p>\"I spent an awful lot of time when you weren't around, ranting about her and staring at her in horror that she was what you wanted, and not me.\"</p>\n<p>\"Oh.\"</p>\n<p>\"And when you turned up this summer with your ridiculous hair—\"</p>\n<p>\"<em>Hey,</em>\" Stiles protests.</p>\n<p>\"I started to think it might be you… I guess I was hoping it wasn't. Because the Stiles that turned up in my life when I was a teenager… I thought he <em>died</em>.\" Derek's hands move to Stiles' jaw, forcing his face up, and Derek's expression is hopeless when he looks at him. Hopeless and <em>ecstatic</em>, all at the same time. \"And even while I thought you were dead, I loved you.\"</p>\n<p>Stiles makes a happy noise, maybe because he's still on drugs and can't contain it, or maybe because it's all he feels.</p>\n<p>\"I said I always would,\" Derek says, and a bittersweet expression crosses his face. \"If I'd known you were still alive, I'd have waited for you, of course I would—\"</p>\n<p>\"<em>Hell</em>, no,\" Stiles says, instantly. \"We couldn't <em>both</em> be inexperienced virgins, no thank you, I want you knowing what you're doing before—\" He makes a strangled sort of noise. \"Before we finish this conversation without an audience.\"</p>\n<p>Derek laughs, one hand moving from Stiles' face to cover his own face for a moment, and Stiles can't help himself, he buries his face in Derek's shoulder and laughs, relief flooding his body. Derek tilts up Stiles' chin again, and looks at him hopefully, and Stiles nods, desperate, and kisses him, letting everything unsaid fill that space.</p>\n<p>Hopefully Derek understands the <em>I love you too</em> buried underneath the desperate touches.</p>\n<p>\"Dude, you're totally making out with Derek Hale,\" Scott says, in the background. \"Did you hit your head?\"</p>\n<p>\"Probably,\" Stiles agrees, before kissing Derek again. \"But I'm kind of in love with him, so I'd probably be kissing him even if I hadn't.\"</p>\n<p>\"<em>What,</em>\" Scott says, sounding appalled. \"When did this happen?\"</p>\n<p>Stiles stops kissing long enough to say, \"About nine years ago.\"</p>\n<p>\"<em>What.</em>\"</p>\n<p>\"In what you call years,\" Stiles adds. Cora snorts at that one.</p>\n<p>\"<em>Dude,</em>\" Scott says.</p>\n<p>\"Okay, time's up,\" Melissa yells from the doorway, bodily hauling out Isaac and Allison because they're the closest to the door.</p>\n<p>\"I <em>knew</em> he was your boyfriend,\" Cora calls triumphantly in the background.</p>\n<p>Melissa lets Derek stay a moment longer, Cora probably to thank for that one, and Stiles smiles at him in what's probably a very dopey manner.</p>\n<p>Derek carries Stiles back to the bed, and sits by his side, holding his hand. \"I'll stay until you fall asleep,\" he promises.</p>\n<p>\"Longer,\" Stiles says. His head is foggy, and it's probably the drugs, but he feels a little like he could fly, and yeah, probably the drugs, but it might have something to do with Derek's hand in his. Just a little.</p>\n<p>Derek huffs a laugh.</p>\n<p>\"It's so nice to hear you laugh,\" Stiles says. \"I thought I'd miss that the most.\"</p>\n<p>\"I haven't really laughed for years,\" Derek says, softly, like Stiles might disappear again. \"I might now.\"</p>\n<p>\"Because of me,\" Stiles manages, sleepily.</p>\n<p>Derek smiles down at him, soft and certain. \"Always because of you.\"</p>\n<p>\"Romantic <em>sap.</em>\"</p>\n<p>\"I made you a mix CD,\" Derek says, huffily. \"You're <em>aware</em>.\"</p>\n<p>Stiles attempts a laugh.</p>\n<p>\"Still think the spell wasn't the smartest thing we've ever done?\" Derek asks.</p>\n<p>\"It wasn't the smartest thing I've ever done,\" Stiles says, but he can feel sleep dragging at him again, and he lets him tug it down.</p>\n<p>The spell is definitely the second smartest thing they ever did. Falling in love is clearly at the top of the list. Stiles will tell him when he wakes up. And if he won't listen, maybe he'll make a mix CD.</p>\n<p>Without any 'cellos.</p>\n<p>Stiles is ambivalent about 'cellos, actually.</p>\n<p>He thinks he can feel Derek's fingers in his hair as he falls asleep.</p>\n<p>Derek's watching over him. A Derek that smiles and <em>laughs</em>. A Derek that loves him.</p>\n<p>Maybe time travel doesn't <em>completely</em> suck, after all.</p>\n<p> </p>"
}