{
  "id": "9183175",
  "url": "https://archiveofourown.org/works/9183175?view_full_work=true",
  "author": [
    "thehoyden"
  ],
  "title": "The Fox's Wedding",
  "rating": "Explicit",
  "archive_warnings": [
    "No Archive Warnings Apply"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Hannibal (TV)"
  ],
  "relationships": [
    "Will Graham/Hannibal Lecter"
  ],
  "characters": [
    "Will Graham",
    "Hannibal Lecter",
    "Abigail Hobbs",
    "Chiyoh (Hannibal)"
  ],
  "additional_tags": [
    "Episode Fix-It: s02e13 Mizumono",
    "Hurt/Comfort",
    "Murder Family",
    "Alternate Universe - Canon Divergence"
  ],
  "language": "English",
  "series": "",
  "published": "2017-01-03",
  "completed": null,
  "words": "11,325",
  "chapters": "1/1",
  "comments": "413",
  "kudos": "14,729",
  "bookmarks": "3,657",
  "hits": "150,661",
  "summary": "<p>Because Will’s life is bullshit, he gets gently kidnapped from the hospital after Hannibal guts him.</p>",
  "notes": "<p>So once upon a time, Rageprufrock was like, \"HANNIBAL,\" and I was like, \"But I'm easily scared and I don't think I would like it. It's about a cannibal, right?\" And then I basically finished watching the whole series in two weeks with both Pru and N figuratively and sometimes literally holding my hand, and this happened. Thanks to Pru and Twentysomething for audiencing, and to Lynnmonster for the beta -- one of the loveliest things about a new fandom is finding old fannish friends in it. You guys are all great.</p>",
  "text": "<p><br>\n<br>\n<br>\n</p>\n<p>Because Will’s life is bullshit, he gets gently kidnapped from the hospital after Hannibal guts him.</p>\n<p>At least, he muses, his kidnapper had the good sense to wait until Will no longer has to contend with a temporary colostomy bag. She also has the good sense to realize that Will is a cornered animal and not going down with a fight. Instead of repeating her request for him to get in the wheelchair, she takes out a phone and makes a call before handing it to him.</p>\n<p>“Will?” comes Abigail’s voice. It’s not an especially good connection; he holds the phone tightly to his ear, as if he could reach her. The last thing he remembers seeing after Hannibal introduced a knife to his belly was Hannibal ushering Abigail out the door.</p>\n<p>“Abigail?” he croaks out.</p>\n<p>“How are you doing?” she asks, and Will has to bite back any number of sarcastic responses, because he knows Abigail is doing her best with the hand she was dealt, and Will doesn’t like some of her choices, but he can’t blame her.</p>\n<p>“I’m sick of pudding,” he tells her. He almost can’t believe it’s her at all -- he grieved her the entire time he was held in the Baltimore State Hospital for the Criminally Insane, and to think she’s been alive all this time, that he’s lucky enough to get a second chance, well. In Will’s experience, he’s rarely that lucky.</p>\n<p>“Hospital pudding sucks,” she agrees. “You’re okay to leave the hospital, right?”</p>\n<p>“And go where?” he asks. There’s been no talk of him being discharged yet, and he highly doubts they want him to go back to his house alone in any case.</p>\n<p>“Here,” Abigail says. “With us.”</p>\n<p>Will blows out a breath, and then says, “Put your other dad on.”</p>\n<p>Abigail, being a smart girl, doesn’t bother to pretend that she has to go get Hannibal, who has undoubtedly been listening to this entire conversation.</p>\n<p>“Will,” Hannibal says, and his voice sounds so familiar that it aches. “Did you get the flowers I sent?”</p>\n<p>“I did, but I feel I have to mention that it’s kind of fucked up because you’re the reason I’m here in the first place,” Will says.</p>\n<p>“I wouldn’t have done it if you hadn’t betrayed me,” Hannibal says.</p>\n<p>“Do not start with me,” Will warns him, because if he starts yelling about all the ways Hannibal has betrayed <i>him</i>, he’s not going to stop, and that’s definitely going to attract the wrong kind of attention. “What’s this about Abigail wanting me to come to you? I thought you were pretty clear about how you felt about me when you left me to die.”</p>\n<p>“I did not leave you to die,” Hannibal says, and he sounds <i>offended</i>, like Will accused him of spitting in the soup. “Whatever else, I would hope you trust my skill with a knife.”</p>\n<p>“So you just meant to maim me, is that it? So far I’m not finding this a compelling argument to come back for round two.”</p>\n<p>“Will,” Hannibal says, and then delicately clears his throat. “I may have...overreacted.”</p>\n<p>Will takes the phone away from his ear and stares at it for a moment, because what the actual fuck. “Really,” he says flatly.</p>\n<p>“I’ve seen your chart, and you’re well enough to travel with assistance.”</p>\n<p>“Of course you’ve seen my chart,” Will says, resigned. “And I think I want a second opinion on that one, since my actual doctors don’t seem that hot about me walking five feet, never mind checking out.”</p>\n<p>“My associate will see to it that you don’t overexert yourself on your way here. Then you will recuperate under my care.”</p>\n<p>Will refuses to dignify that with a response.</p>\n<p>“Our care,” Hannibal amends. “Mine and Abigail’s.”</p>\n<p>“You manipulative asshole,” Will says tiredly, and closes his eyes. “What is this, anyway.”</p>\n<p>“I think we’re long overdue for a family vacation, wouldn’t you say?”</p>\n<p>“Oh my fucking god,” Will says, and takes great joy in hanging up on him.</p>\n<p>***</p>\n<p>He’s almost impressed with how easily this woman smuggles him out the hospital -- not that Will is really up to fighting back, but he could have definitely given her trouble if he hadn’t been complicit in his own kidnapping. She has clothes for him -- a soft cashmere sweater and pants that look way nicer than they should, considering that the waist is elastic. She’s militant about him sitting in the wheelchair instead of walking, and he really doesn’t care to argue, especially by the time they get to Dulles and he feels like his stomach is on fire.</p>\n<p>“Am I allowed to ask where we’re going?” he ventures as she helps him into an airport-issue wheelchair.</p>\n<p>“Japan,” she says shortly.</p>\n<p>He has questions, like how, because it’s not like he had his passport on him when he was admitted to the hospital. But it turns out that he didn’t need his passport, anyway -- she hands him one that says his name is David Anders. “Sure,” Will says under his breath. “And what do I call you?”</p>\n<p>She regards him steadily, and then says, “Chiyoh.”</p>\n<p>“Nice to meet you, I suppose,” Will says. He’s not sure what the etiquette is regarding dubiously consensual abduction, but he can at least make a half-assed effort at politeness for someone who’s probably just doing her job.</p>\n<p>Chiyoh says nothing to that and just pushes his wheelchair to the counter to check in. The ticket agent only spares a glance at Will, and converses in what Will is pretty sure is Japanese with Chiyoh for the whole check-in process. It’s also the quickest Will has ever gotten through security at Dulles, which momentarily restores Will’s faith in humanity; the TSA agents actually smile at him while waving him through the precheck line.</p>\n<p>Mercifully, they’re flying ANA from the main terminal, which means they only have to deal with maneuvering the wheelchair onto the aerotrain and not a shuttle bus.</p>\n<p>When they arrive at their gate, Chiyoh checks her phone and then says, “Would you like a book or some magazines for the flight?”</p>\n<p>“Did he just text you that?” Will asks. “If I’m good, do I get snacks, too?”</p>\n<p>“The food on the plane will be better.”</p>\n<p>“Since <i>when</i>.”</p>\n<p>“Since he paid for first class.”</p>\n<p>“Oh,” Will says, taken aback. He’s never flown first class in his life. And then, a little more meekly, he says, “A magazine might be nice.”</p>\n<p>She pushes his wheelchair to one of the ubiquitous airport bookstores, and since he’s completely up on celebrity gossip against his will after being stuck in the hospital, he picks up a fishing magazine and Popular Mechanics and a nonfiction book on maritime history.</p>\n<p>Once they’ve boarded the plane and Will has carefully lowered himself into his seat next to the window, exhaustion hits him hard. He barely did anything, but apparently he’s used up all the energy reserves he has left.</p>\n<p>The flight attendant comes by, and Will regrets that he can’t drink with the medication he’s on, because the beverage menu is insane. He asks for water and closes his eyes.</p>\n<p>Once they’re in the air, the flight attendant comes by with a tray just for Will. On it is a covered bowl and a shallow dish with a variety of pills in it.</p>\n<p>“Uh,” Will says intelligently. He looks at Chiyoh. “Do I want to know?”</p>\n<p>Her eyes are closed. “His instructions were specific.”</p>\n<p>Since he didn’t get discharged, he didn’t get any prescriptions to get filled, which means he has no idea what’s in front of him. But if Hannibal were going to kill him, he would have done it already; Will’s distantly aware that’s a little fucked up, but it doesn’t even make his top twenty.</p>\n<p>He takes the lid off the bowl; it’s miso soup with tofu, which definitely fits his current soft food diet. He stares at it and thinks about Hannibal not wanting him to take medication on an empty stomach.</p>\n<p>He manages half the soup before swallowing the mystery pills, which he hopes include the antibiotics he’s been on as well as something for pain, because the last dose he had in the hospital has definitely worn off. It must, because he feels a little floaty. When he comes back from the lavatory, the other passengers are ordering dinner, which Will has no interest in. His seat has already been converted to a bed, and Will crawls into it and falls deeply asleep.</p>\n<p>***</p>\n<p>The plane lands at Narita around five p.m. local time, and Will expects to follow the hordes of people to public transit. But instead, there’s a car waiting for them, and a man wearing a uniform with white gloves helps him into the backseat.</p>\n<p>“Where are we going?” he asks Chiyoh. He doesn’t expect an answer, and he doesn’t get one. Instead he gets a triangular rice ball, a bottle that purports to be “straight tea”, and several more pills. He eats the rice ball minus the seaweed -- he’s not sure if his intestines can handle it and he’s unwilling to take chances -- and is pleasantly surprised by the tuna with mayo in the middle. He opens the tea to wash down the pills, and it’s a little sweetened.</p>\n<p>They drive for a few hours, and it’s dark by the time they turn into a gated driveway and pull up to the front door. The entrance is lit softly, and when the door opens to reveal Abigail and Hannibal, Will is very worried that this is a dream, and he doesn’t know what he’ll do if it is.</p>\n<p>Chiyoh has one small bag in the trunk, which the driver retrieves. Will has nothing except the clothes he’s wearing, the ones that Hannibal sent for him. Both Will’s door and Chiyoh’s open automatically -- she’s already out and greeting Hannibal and Abigail with a brief, shallow bow. </p>\n<p>Will stays where he is, at least in part because he’s not sure he can actually move.</p>\n<p>Abigail breaks from the doorway and says, “You made it! Aren’t you coming inside?”</p>\n<p>Will maneuvers his legs out of the car and then comes to a stop. It’s possible he’s really overdone it. “I don’t know if that’s a good idea,” he says.</p>\n<p>“Will,” Hannibal says, and bends over to look at him. “Are you in pain?”</p>\n<p>“What do you think?” Will says tightly. </p>\n<p>“Put your arms around my neck, please.”</p>\n<p>“Absolutely not,” Will says, but he does it anyway, because he would like to get out of the car at some point today. Hannibal gets an arm under his knees and one around his back, and then lifts him up cleanly. Hauling corpses around must be good practice.</p>\n<p>Because he’s a dick, Hannibal pauses at the door and gives Will a significant look, like Will has somehow missed that he’s being carried over the threshold, bridal-style.</p>\n<p>“Watch it,” Will says as Hannibal maneuvers them through the doorway. “Don’t hit my head against the frame -- a concussion is the last thing I need right now. I said, <i>watch it</i>--”</p>\n<p>“How I’ve missed you,” Hannibal says with every appearance of fondness. He manages to step out of his shoes in the foyer without jostling Will or dropping him, and then proceeds down the hallway in his socks. “Are you hungry?”</p>\n<p>There’s really no point in not being honest. “Not really. Just tired,” Will says. </p>\n<p>“Of course you are,” Hannibal says with gentle sympathy that Will has no resistance to. “You’ve had a long flight, and you’re not at your best.”</p>\n<p>Hannibal carries him into a room with tatami mats and a futon on the floor -- the real deal, not the monstrosity that served as Will’s bed and couch during grad school -- and gently lowers him. Will hisses in pain as he lies down on the futon, and Hannibal frowns.</p>\n<p>“I apologize for the less than ideal setup for your recovery,” Hannibal says, kneeling next to Will. “I’d like to take a look at those stitches, if I may.”</p>\n<p>Will waves a hand in the direction of his midsection, which really fucking hurts. “Knock yourself out,” he manages. It’s not that Hannibal couldn’t hurt him more, but at the moment, it feels like he would really have to put some effort into it.</p>\n<p>Hannibal pushes Will’s sweater up, and then clucks his tongue. “I believe you’ve pulled a stitch or two.”</p>\n<p>Will looks down, and yup, he’s definitely bleeding through the gauze wrapped around his torso.</p>\n<p>Abigail comes in, then, and hands a leather bag to Hannibal, which turns out to be a medical kit. She kneels next to Hannibal and watches him cut the gauze.</p>\n<p>“Adequate, I suppose,” Hannibal says of Will’s stitches, which is the same thing he said about Will’s suit for his trial, which Will knows for a fact he wanted to light on fire. “Pay attention, Abigail -- this is a useful life skill everyone should have some basic knowledge of.”</p>\n<p>Will thinks about arguing that most people just go to the ER and that most people don’t have massive traumatic wounds requiring stitches in the first place, but concedes that Abigail is not most people. Instead, he says, “Please tell me you’re going to give me anesthetic.”</p>\n<p>“Of course,” Hannibal says soothingly, and brushes Will’s hair out of his eyes with a gloved hand.</p>\n<p>He zones out as Hannibal talks Abigail through wound care and how to administer a local anesthetic, and not long after he feels the tugging of skin as Hannibal adds a few stitches, he hears the snap of Hannibal taking his gloves off. He touches Will’s face again, and Will struggles to open his eyes.</p>\n<p>“The site is a little inflamed, I’m afraid,” Hannibal says. “Rest and medication will help. Can you manage some food?”</p>\n<p>“Ugh,” Will says.</p>\n<p>Hannibal apparently interprets that as yes. He nods to Abigail, who disappears off into the hallway, before easing Will up enough to lean against Hannibal’s chest. Abigail comes back with a tray with yet another covered bowl and a dish of pills. </p>\n<p>“I made it,” she says, taking the lid off the bowl. It looks like some kind of rice porridge. “I mean, Hannibal told me how to do it.” She spoons up a little and holds it up to his mouth, and Will just doesn’t have the heart to refuse, even though he really is not remotely hungry. He opens his mouth and closes it around the spoon, and yeah, that’s rice porridge. It doesn’t taste great -- it doesn’t really taste like anything much, but he would sooner swallow glass than tell Abigail that. She spoons the porridge into this mouth with great concentration, her brow creased in worry, and it occurs to Will that she’s worried about <i>him</i>.</p>\n<p>“I’m okay,” he says. “I’m okay, Abigail.”</p>\n<p>She bites her lip but continues to slowly feed him, while Hannibal strokes his fingertips against Will’s neck, as if to aid Will swallowing. It should be really fucking creepy, but Will is officially out of fucks to give, and anyway, it feels nice. He only manages half the bowl again, and Abigail looks unhappy but gives him his pills and a glass of water to wash them down with. </p>\n<p>When she leaves the room again with the tray, Will smacks Hannibal’s knee, which is currently the easiest part of him to reach. “Congratulations on traumatizing her again. You couldn’t have sent her out of the room before you gutted me?”</p>\n<p>Hannibal is silent for a few moments. Then he says, “I was going to kill her. In front of you.”</p>\n<p>Will squeezes his eyes shut. He can feel the rise and fall of Hannibal’s chest against his back. He’s being cradled by a serial-killing drama queen. He really should be more concerned about it than he is; maybe it’s the drugs.</p>\n<p>“Please don’t tell her that,” Will says finally, fingers clenching the fabric of Hannibal’s trousers. “Please don’t hurt her again.”</p>\n<p>Hannibal is quiet again. “I won’t,” he says. “I keep my promises, Will.”</p>\n<p>“Okay,” Will says. Hannibal eases him down onto the futon, then fusses with the pillow and the thick comforter until Will is tucked in.</p>\n<p>“Will you require no assurances for your own safety?”</p>\n<p>“I could ask you the same,” Will says tartly.</p>\n<p>Hannibal smiles. “So you could,” he says, and strokes his hand over the side of Will’s face before standing up, and pulling a cord attached to the overhead light. “Sleep well, dear Will. Good night.”</p>\n<p>“Night,” Will sighs out, and Hannibal slides the door closed.</p>\n<p>***</p>\n<p>He wakes once in the night when his pain medication wears off. It’s not totally dark in the room; there’s enough light coming in the window that Will can tell he’s not alone.</p>\n<p>It takes a minute for his brain to remember that yes, he’s in Japan, yes, he’s sleeping on the floor, and yes, that’s Hannibal, asleep on a futon beside his.</p>\n<p>“Hannibal,” he whispers. He reaches out carefully; he’s half-terrified that Hannibal’s skin will be cold to the touch.</p>\n<p>Hannibal’s shoulder is warm, and his hand comes up to clasp Will’s. “Will,” Hannibal says, voice rough with sleep. “Do you need something?”</p>\n<p>Will needs a lot of things, but first things first. “Can you help me up?”</p>\n<p>Hannibal gets Will upright and then shuffles them to the tiny bathroom attached to the room. It’s just a toilet with a sink on top of the tank that runs water while the tank is filling. There’s no mirror or anything, which is just as well because Will is pretty sure he looks like hot garbage.</p>\n<p>Hannibal consents to let Will piss in peace with the door closed, but once Will is done, he opens the door again and looks critically at Will in the bathroom light.</p>\n<p>“Would you like to get cleaned up before going back to bed?” he asks.</p>\n<p>“You can just tell me I stink,” Will says. “I haven’t had a real shower since--” he waves vaguely at his stomach.</p>\n<p>“You’ll feel better when you’re clean,” Hannibal says, and Will can’t argue with that. Will swallows the pills Hannibal gives him, and then lets Hannibal walk him out of the room and down the hall before sliding open another door, to reveal a small changing area before the entrance to a tiled room with a big, deep tub and a hand-shower outside it.</p>\n<p>“You know I’m on sponge baths only, right?” Will says with no small amount of regret.</p>\n<p>“I’ll be very careful,” Hannibal promises.</p>\n<p>“I can wash myself.”</p>\n<p>“Be sensible, Will,” Hannibal chides. “You can’t reach your feet, and you certainly can’t scrub your own back. Let me do this for you.”</p>\n<p>Will sighs, because Hannibal is annoyingly right, and strips. Hannibal applies a waterproof dressing over his stitches -- oh so conveniently on hand -- and then helps Will lower himself to sit on a plastic stool on the tiled floor outside the tub. He drapes a small towel over Will’s lap, which Will snorts at.</p>\n<p>“It’s a little late for modesty -- you know that Freddie Lounds plastered a picture of me naked in my hospital bed all over her website, right?”</p>\n<p>He expects a response, and when he doesn’t get one, he chances a look up at Hannibal.</p>\n<p>Hannibal is <i>furious</i>.</p>\n<p>“Oh,” Will says after a moment, when Hannibal has silently stripped down to his boxer-briefs and knelt behind Will. “That’s why you sent Chiyoh. You couldn’t stand it, could you? You literally cut me out of your life, but there I was, exposed to the world in high resolution. An entire photo gallery for anyone to consume.”</p>\n<p>Hannibal turns on the shower, and Will shivers when he braces Will with a hand between his shoulder blades and begins to rinse him off.</p>\n<p>“It was a violation,” Hannibal says finally as he wets down Will’s hair.</p>\n<p>“Of my privacy, or your claim on me?”</p>\n<p>Hannibal’s fingers tighten in Will’s hair, and it makes Will gasp despite himself.</p>\n<p>Hannibal’s lips are nearly touching Will’s ear as he says, “You looked like St. Sebastian, suffering so beautifully, and she <i>dared</i>--”</p>\n<p>“I think you’re giving Freddie’s photography skills a little too much credit,” Will says.</p>\n<p>Hannibal says nothing as he works shampoo into Will’s damp hair. He tilts Will’s head back, and the feel of his fingers massaging Will’s scalp almost makes him want to moan in pleasure. By the time Hannibal rinses the shampoo out of his hair, Will feels like he’s floating, high on whatever pain medication Hannibal had given him, unspooled by Hannibal’s touch.</p>\n<p>Hannibal washes his back next, and this is definitely nothing like the sponge baths in the hospital. Hannibal lingers over the scar on his shoulder with the washcloth, and traces Will’s spine with his thumb. “You’ve lost weight,” he murmurs, and he sounds displeased.</p>\n<p>“Hard not to, considering my recent diet,” Will says. Hannibal soaps up one of his armpits then, which is kind of weird and he wasn’t exactly expecting it, but he lets it happen. While Hannibal is scrubbing the rest of his arm, taking care to remove the leftover adhesive from his elbow where he’d had an IV inserted, Will says, “Alana found me on your kitchen floor.”</p>\n<p>“Did she?” Hannibal says. He moves the towel he’s been kneeling on so that he can reach Will’s feet. The washcloth between Will’s toes makes him squirm a little; Hannibal’s thumbs digging into the arch of his foot makes him sigh.</p>\n<p>“She was calling for an ambulance when one showed up.”</p>\n<p>Hannibal switches to the other foot. With Will’s ankle in his hand, he says, “As I said, I did not leave you there to die.”</p>\n<p>“But you did leave me,” Will says, and it sounds so miserable coming out of his mouth that he wishes he could take it back.</p>\n<p>“For a time,” Hannibal says. “Have I not brought you home?”</p>\n<p>“Is that what this is?”</p>\n<p>Hannibal rinses him off, and brings his hands to rest on Will’s thighs, just below where the towel is draped over his lap. “It can be,” he says.</p>\n<p>Will doesn’t know what to say to that, because so much has happened, and it’s objectively fucking crazy, and yet.</p>\n<p>“Something to think about,” Hannibal says lightly, as if he’s tabling an unproductive line of inquiry in therapy. “For now, your priority is to recover. The rest can wait.”</p>\n<p>Will finds himself nodding.</p>\n<p>Hannibal cleans gently around the waterproof dressing, taking extra care. Then he holds out the washcloth and says, “Would you like to do the rest?” </p>\n<p>“Oh,” Will says. “Uh, yeah. Thanks.”</p>\n<p>Hannibal inclines his head and rises to his feet before stepping into the small side room, and Will takes the opportunity to clean between his legs. He isn’t hard, but his body feels like it’s humming from Hannibal’s hands all over his skin. </p>\n<p>Hannibal is wearing a cotton robe that looks like a less fancy kimono when he comes back into the bathroom to help Will up. Hannibal hands him a towel, and when he’s dry, swaps out the waterproof dressing for another layer of sterile gauze. Finally, he gives Will a robe like the one he’s wearing. It’s a deep blue with carp around the hem, and Hannibal tugs the shoulders into place, and then carefully ties the belt so that it won’t rub against Will’s stitches. </p>\n<p>“So, is free-balling traditional in this getup?” Will asks.</p>\n<p>There’s a suggestion of a smile at the corner of Hannibal’s lips. “Perfectly acceptable for sleeping,” he says. “And in any case, you didn’t bring any clothes with you at all.”</p>\n<p>“Nothing except what you gave me,” Will says, and Hannibal’s hand tightens on his hip.</p>\n<p>Oh, you possessive motherfucker, Will thinks. You <i>like</i> that. You did that on purpose.</p>\n<p>He’s not sure what this is, or what Hannibal wants, but if Hannibal is going to fuck with him, Will is going to fuck with him right back. He slides his hands up to rest on Hannibal’s shoulders, and then says, “I’m tired.”</p>\n<p>Hannibal’s expression doesn’t change, but Will can feel him take in a short breath. “To bed, then,” he says, and picks Will up again and carries him back to the bedroom.</p>\n<p>***</p>\n<p>It’s late morning when Will wakes up again, judging by the sun coming in the window. He’s warm under the thick duvet, but his nose is a little cold. He lies there for a few minutes, before he determines that he really does need to get up.</p>\n<p>He can’t do that without help, and it occurs to him to wonder just how much his current sleeping arrangements are deliberate. He could try to get up on his own, but that seems like a profoundly bad idea, even for him. He takes in a deep breath and hollers Hannibal’s name.</p>\n<p>He hears a door slide open and shut and footsteps in the hallway, and then the bedroom door slides open to reveal Hannibal in an apron.</p>\n<p>“Help me up?” Will asks. He really doesn’t like feeling this dependent, but he doesn’t have a choice except to cling to Hannibal’s shoulders while Hannibal muscles him up to standing. He’s still weak, and still in pain, but he can make it to the toilet by himself and tells Hannibal as much.</p>\n<p>“We’ll be waiting for you in the kitchen,” Hannibal says, and Will grunts in response before pulling the bathroom door shut behind him.</p>\n<p>He doesn’t have far to go to reach the kitchen, thankfully, and it’s not a mystery as to which room it is. He hears a tea kettle whistle, and the next open doorway reveals Hannibal pouring the water into a teapot, and Abigail sitting at a table with a laptop and a few books, doing what looks like -- homework?</p>\n<p>“Morning,” Will says, his voice still raspy.</p>\n<p>“Good morning, Will,” Hannibal says, looking pleased. “Come, sit down.” He pulls out a chair for Will next to Abigail.</p>\n<p>The kitchen is small -- smaller than he would have expected for Hannibal, anyway, with the small round kitchen table taking up floor space that Will bets Hannibal would rather have devoted to an island or more prep space. It opens to a room with a raised floor and more tatami, with a low table that has a blanket covering the sides. Hannibal puts the tea kettle on top of a kerosene heater between the two rooms, spout uncovered so that it can release steam into the room.</p>\n<p>“Are you cold? Where are your slippers?” Hannibal asks. These are apparently rhetorical questions, because he bustles down the hallway.</p>\n<p>“He’s going to fuss,” Abigail says, her smile conspiratorial. “A lot. You should let him.”</p>\n<p>“Oh, I should, should I?”</p>\n<p>“Better you than me,” she says. Her hair is tucked behind one ear, but it hangs loose over the other.</p>\n<p>Because there’s no ear there to tuck it behind, he remembers.</p>\n<p>“What are you studying?” he asks, veering away from the thought abruptly.</p>\n<p>“Hannibal’s home schooling me so I can get my GED,” she says.</p>\n<p>Will raises his eyebrows. “I assume he forged you a new identity, too. He couldn’t forge you a high school diploma in the process?”</p>\n<p>“Education is important, Will,” Hannibal tuts from the doorway. He then kneels beside Will and slides warm slippers on his feet -- oh right, they were beside the bedroom door and he had ignored them -- and rises to tuck a wool wrap of some sort around Will’s shoulders. “How is our daughter to apply to the best schools if she does not have an exemplary foundation?”</p>\n<p>“She could pass the GED exam right now,” Will says, exasperated. “High school teaches kids obedience more than anything else.”</p>\n<p>“That may be one explanation for your grasp of Latin, but not one I am willing to accept,” Hannibal tells Abigail, who groans.</p>\n<p>“It has cases and too many tenses,” she complains, and looks to Will beseechingly. “Tell him I don’t need Latin for college.”</p>\n<p>“Be reasonable, daddy,” Will drawls with bone-dry sarcasm.</p>\n<p>Hannibal stares at him. It takes several seconds, in fact, for Hannibal to turn his attention to Abigail long enough to say, “A classical education is never a waste.” Then he puts one hand on Will’s shoulder. “I’ll make you breakfast. You must be hungry.”</p>\n<p>Will isn’t, particularly, but he knows Hannibal isn’t going to dose him on an empty stomach, so resigns himself to eating something. He guiltily hopes it’s not more of the rice gruel.</p>\n<p>He watches Hannibal cook, moving around the small space with as much ease as he had in his kitchen in Baltimore. The kitchen where Hannibal had held him close and slid a knife into his belly. And now Hannibal is gently scrambling some eggs while Abigail quietly types out an essay, and Will is there with them, waiting for his body to knit itself back together.</p>\n<p>“Why here?” Will asks suddenly. “I thought you would go somewhere in Europe.”</p>\n<p>“I had intended for the three of us to go to Paris,” Hannibal says, plating the eggs before retrieving several containers from the fridge. “This is something of a stop along the way.”</p>\n<p>Will raises his eyebrows at Hannibal as he sets down the plate of eggs in front of him, along with a dish of what looks like yogurt with some kind of fruit puree. “Maybe I should be in charge of the geography tutoring, because Japan is really not on the way to France.”</p>\n<p>“We may certainly discuss your contribution to Abigail’s education,” Hannibal says, and then fixes Will with a pointed look. “After you eat your breakfast.”</p>\n<p>Hannibal pours tea for the three of them before taking his seat at the table, and Will starts in on the eggs. They’re soft and buttery, and a far cry from hospital cafeteria cuisine. Hannibal is not even pretending to do anything but stare at Will as he slowly works his way through his plate.</p>\n<p>“How do I cite something when I’m using two sources with the same author?” Abigail mutters, maybe to herself.</p>\n<p>Will finishes his last mouthful of eggs. “Depends. What format is he making you use?”</p>\n<p>“MLA,” Abigail says, looking dejected.</p>\n<p>“You monster,” Will says to Hannibal.</p>\n<p>“She should be comfortable with multiple citation formats,” Hannibal says.</p>\n<p>“Like you’ve used anything except APA for years,” Will says, but gestures to Abigail to turn her laptop toward him so he can google his old stand-by reference site.</p>\n<p>***</p>\n<p>He tires quickly after he helps Abigail conquer MLA, and it isn’t long before Hannibal puts a gentle hand on the nape of his neck and says, “You need your rest, Will.”</p>\n<p>Will knows he does, but he doesn’t want to go back to the bedroom by himself. Abigail has migrated to the low table in the living room, where she’s working on crocheting something while the TV is on with the volume low. He looks at Hannibal, then looks at Abigail, and some of it must show on his face because Hannibal’s eyes soften minutely.</p>\n<p>“Shall I sit with you until you fall asleep in your room, or would you like me to bring your futon out here?”</p>\n<p>It hadn’t exactly occurred to Will that the latter was an option. “Out here would be good,” Will says cautiously.</p>\n<p>When he’s tucked into his futon, Hannibal settles into one of the floor chairs at the low table and takes up his tablet. Whatever is on TV is in soft Japanese that rolls over him, and as his eyes fall shut, he feels Hannibal’s hand stroking through his hair.</p>\n<p>***</p>\n<p>When Will drifts back awake, it’s apparently just in time for lunch, and whatever it is, it smells <i>delicious</i>.</p>\n<p>“Please tell me I get to eat some of that,” Will says, struggling up on his elbows.</p>\n<p>“It will fit perfectly into your current diet, with some minor alterations,” Hannibal says. “There’s a clean yukata in your room, if you would like to change before lunch.”</p>\n<p>Will nods and waits for Hannibal to help him up. The wool wrap Hannibal gave him earlier is laid out on top of his comforter -- it turns out to be a wide-sleeved open jacket kind of thing, like he’s seen in Kurosawa movies. Hannibal retrieves it and holds it up so that Will can put his arms through the sleeves.</p>\n<p>Hannibal returns to the stove, and when Will comes close, he dips a spoon in one of the pots on the stove and holds it out for Will to taste.</p>\n<p>Time spent with Hannibal has given Will more vocabulary to describe food, and this broth is just as good as it smells -- rich, creamy, with a great depth of flavor, like Hannibal simmered pork bones for days.</p>\n<p>“Is that tonkotsu?” Will asks. Nowadays, he mostly eats at home or at the Academy cafeteria, but there was a ramen restaurant near GWU that he had an intense and meaningful fling with while writing his master’s thesis.</p>\n<p>“Well, I had to do something while waiting for you to arrive,” Hannibal says. He puts the spoon down, and then fusses with the collar of Will’s jacket before smoothing the shoulder seams.</p>\n<p>“You realize I’m just going to take this off again to change, right?” Will asks. The last time he stood with Hannibal this close, face to face, Hannibal had a knife in his hand.</p>\n<p>Will knows he should feel frightened, or anxious, or angry. He doesn’t.</p>\n<p>“It will go quite nicely with the ensemble I’ve selected for you. It’s just as becoming with your coloring as I’d hoped,” Hannibal says, and his fingers slide through the curls at Will’s nape before he cups Will’s cheek.</p>\n<p>“If you had me kidnapped just to play dress up, I’m going to be pissed,” Will says, and his breath stutters as Hannibal brushes his thumb over Will’s cheekbone.</p>\n<p>“Dear Will,” Hannibal murmurs. “It would be reason enough.”</p>\n<p>“Seriously, fuck you,” Will murmurs back, far too tenderly.</p>\n<p>The moment is broken by the sound of the front door opening, and Chiyoh’s voice calling out a greeting. There are footsteps in the hall before the kitchen door slides open. It’s Chiyoh and Abigail, bearing reusable bags full of groceries, and Will is a little chagrined at his disappointment in being interrupted.</p>\n<p>“Welcome back,” Hannibal says. “Put those on the table, please, and I’ll put them away.” He squeezes Will’s nape once and says, “Go wash up and change. Lunch will be ready shortly.”</p>\n<p>Will feels like he’s doing some weird version of the walk of shame when he sidles past Abigail and Chiyoh, like Hannibal feeding him and manhandling him is something akin to second base.</p>\n<p>If it is, he reflects, they’ve been stuck on it all this time.</p>\n<p>***</p>\n<p>Apparently, Hannibal intends for Will to continue freeballing, because no underwear is included in the outfit he’s left for Will. The robe also looks less casual, and it’s not made out of cotton. There are butterflies embroidered on it, for fuck’s sake, and there’s no way that’s a coincidence. Hannibal’s never met the metaphor he didn’t want to bludgeon to death.</p>\n<p>He sighs and pulls it on. The silk slides against his dick and balls with a torturous whisper, and he mutters, “Goddammit, Hannibal.”</p>\n<p>He pulls the wool jacket on again before stepping into his slippers and heading back into the kitchen.</p>\n<p>When he slides open the kitchen door, Abigail and Chiyoh are seated at the table. Abigail gives him a once over and tries to hide a smile and fails; Chiyoh’s expression is one of mild distaste.</p>\n<p>Hannibal turns around with two bowls in his hands and goes still, devouring Will with his eyes.</p>\n<p>“You want me to do a twirl?” Will says dryly.</p>\n<p>“I want you to sit down and eat more than half of this,” Hannibal says, putting the bowls in front of Chiyoh and Abigail. It’s ramen, with the tonkotsu broth he tasted earlier, and very attractively presented.</p>\n<p>The bowl he puts down in front of Will is not exactly the same -- no raw vegetables, but he gets an extra soft-boiled egg, and the chashu pork is chopped into small pieces. It feels vaguely like being a toddler, but he’s just happy he gets to have chashu at all.</p>\n<p>Then he’s treated to the unexpected joy of watching Hannibal Lector stuff his mouth with noodles.</p>\n<p>“Hot noodles wait for no one,” Hannibal advises, and points his chopsticks at Will. “Eat.”</p>\n<p>Will does as he says, and it’s as delicious as Hannibal’s food always is, though Hannibal cops to using store-bought fresh noodles because there are some limits even to his repertoire.</p>\n<p>“Are we close to town, then?” Will asks. All he can see out the windows is a forest of cedar trees.</p>\n<p>“Not exactly,” Hannibal says. “We’re a little further up the mountain. This villa was designed as a summer retreat -- few remain year round.”</p>\n<p>In other words: few people to notice the house’s occupancy, and even if they did, the population is transient enough that their presence would not necessarily draw attention.</p>\n<p>“So you just have a random safe house in Japan?” Will asks. Hannibal shoots him a look, and Will obediently puts more noodles in his mouth.</p>\n<p>“It belonged to my aunt,” Hannibal says. “Chiyoh has served as its caretaker.”</p>\n<p>That doesn’t exactly explain to Will who Chiyoh is and why she smuggled him out of the hospital and the country. When he lets himself look, though, he sees love -- a love that bound Chiyoh’s loyalty to Hannibal, long after his aunt died. And she is most certainly dead; now that he knows where to look, he can see the ghost of grief clinging to Chiyoh, still.</p>\n<p>Will makes a valiant attempt to finish his bowl, and Hannibal’s approving look warms him more than he cares to admit.</p>\n<p>***</p>\n<p>The doctors told him that recovery would be slow -- it’s not just the skin that has to heal, it’s the abdominal wall and muscles and intestines. He’s spent a lot of time sleeping and expects that he’ll continue to do so, whether he likes it or not.</p>\n<p>Hannibal is gracious enough to share his tablet with Will when he gets bored of Japanese daytime TV, which is fairly quickly. But because Hannibal is, well, Hannibal, of course when Will turns the tablet on, Tattlecrime is open in the first tab.</p>\n<p>“Really?” Will says from his futon in the living room, where he’s propped up on pillows.</p>\n<p>Hannibal is in the kitchen making tea, and he looks like butter wouldn’t melt in his mouth. “I like to stay informed on current events.”</p>\n<p>“You like to stalk me even when I’m with you,” Will retorts, but starts scrolling through the article on the mysterious disappearance of one Will Graham from his hospital bed. Chiyoh really must have been careful, because Freddie doesn’t have a whole lot to work with -- there are a few screenshots from hospital security cameras of Will in a wheelchair, but nothing of Chiyoh’s face, and Freddie doesn’t know who she is or where they went. Freddie’s never been overly burdened by an absence of facts, though, and unfortunately, Will was on even better drugs in the hospital and said a lot of shit.</p>\n<p>\n<i>Could it be that Graham, heart longing for his would-be murderer, engineered his own escape?</i>\n</p>\n<p>“She’s an ocean away and I still want to strangle her,” Will mutters.</p>\n<p>“If you had actually killed her, that wouldn’t be an issue,” Hannibal says, as if he’s chiding Will for forgetting to pick up something from the store. He hands Will a cup of tea and sits cross-legged next to Will’s futon.</p>\n<p>Will looks at him. “I’m not going to do it,” he says carefully, because he needs to make that clear now. Will has crossed a lot of lines in his pursuit of Hannibal, but he won’t be Hannibal’s partner in murder, not the way Hannibal seems to want. “For one thing, who else would flatter your ego?”</p>\n<p>Hannibal sniffs, but instead of engaging the argument in front of them -- and they’re going to have it some time, Will is certain -- he says, “Ms. Lounds takes many liberties. That does not mean she does not occasionally arrive at the truth.”</p>\n<p>“Like when,” Will scoffs.</p>\n<p>“She refers to us as ‘murder husbands.’”</p>\n<p>Will narrows his eyes. “I’d like to hear how you think that qualifies as the truth.”</p>\n<p>“Well,” Hannibal says. “We are married.”</p>\n<p>“The hell we are,” Will says.</p>\n<p>Hannibal takes a sip of his own cup of tea. “My intention was for us to be a family. It seemed prudent to have a marriage certificate made up in addition to our passports.”</p>\n<p>“So, what, we’re Mr. and Mr. Anders?” Will says incredulously.</p>\n<p>“I considered hyphenating but decided against it.”</p>\n<p>“Wow,” Will says sardonically. “You put all that thought into it and I didn’t even get a proposal.”</p>\n<p>“I asked you to come away with me,” Hannibal reminds him.</p>\n<p>“Not even a ring.”</p>\n<p>“Will--” Hannibal starts, looking dismayed.</p>\n<p>“And I hate to break it to you, but our wedding night wasn’t anything to write home about if I can’t remember it,” Will continues ruthlessly.</p>\n<p>Hannibal’s eyes narrow minutely, which suggests Will is going to hear a rebuttal to that shortly. But first he takes Will’s hand, and says, “I had a ring for you.”</p>\n<p>The tension between them tightens abruptly. Some of that is Hannibal holding his hand like he’s something precious. Some of it is the stab of <i>want</i> that hits Will -- well, not precisely in the gut, because he knows what that feels like -- but somewhere tender, because even after everything, Hannibal still knows him best, and Will feels more alive with him than without.</p>\n<p>“Did you leave it in Baltimore?” Will asks, and feels the corners of his lips twitch into a smile when he sees the vaguely discomfited look on Hannibal’s face. “Oh no, you -- what, left it on train tracks? Threw it into the ocean?”</p>\n<p>“I dropped it into the donation box of a shrine,” Hannibal admits. “Where one typically leaves small change.”</p>\n<p>“Wow,” Will says again. He should never have underestimated Hannibal’s capacity for dramatic burns.</p>\n<p>“It’s of no consequence. It would be unsuitable for the present circumstances.”</p>\n<p>Will squints at him. “Unsuitable how?”</p>\n<p>Hannibal’s hand is still warm around his, his thumb stroking Will’s knuckles. “It was a wedding band, and rather plain. You’ve asked me for a proposal, which necessitates a different ring altogether.”</p>\n<p>“No it does not, and I did not ask you for a proposal, I was pointing out that it’s <i>customary</i>.”</p>\n<p>“Dear Will,” Hannibal says, and he looks at Will like Will is everything, absolutely everything.</p>\n<p>“We haven’t even kissed,” Will snaps.</p>\n<p>“How remiss of me,” Hannibal says, and takes Will’s face in his hands and leans down. Will can’t lean up, he can only wait, half-seconds feeling like hours until Hannibal’s lips touch his. Hannibal kisses him gently, like he thinks Will is going to object -- and instead, Will gets a handful of Hannibal’s hair and pulls him closer and holds him there, exactly where he’s wanted him.</p>\n<p>***</p>\n<p>“Why am I even surprised?” Will mutters to himself. Instead of two single futons laid out side by side in the bedroom, there’s a big one, clearly meant for two.</p>\n<p>Hannibal comes in a few minutes later, dressed in his pajamas. Actual pajamas, not Will’s usual t-shirt and shorts. He’s also carrying his medical kit. “I’ll want to have a look before you change for bed.”</p>\n<p>“You let me sleep in the robe the other night,” Will says.</p>\n<p>“A cotton yukata is acceptable for sleeping. That kimono is not,” Hannibal says.</p>\n<p>Will closes his eyes. “Please tell me this isn’t an antique.”</p>\n<p>“Dishonesty is no way to start a marriage,” Hannibal says lightly, kneeling at Will’s feet. He gently parts the top of the kimono and slides it down off Will’s shoulders, leaving it to hang over the sash at his waist.</p>\n<p>“I’m really not that kind of boy,” Will tells him. </p>\n<p>Hannibal lets out a small amused huff. “Will, the very last thing anyone could accuse you of is being <i>easy</i>.”</p>\n<p>“Well, as long as we’re clear about that,” Will says, and Hannibal rewards him with a little smile that Will can’t help but return. </p>\n<p>Hannibal unwinds the gauze wrap, then cleans the wound area carefully before redressing it. Then he goes to the closet and slides open the door, and brings Will a folded yukata, this one a pale watery blue with a geometric print.</p>\n<p>Still no underwear on offer, Will notes. He’ll insist tomorrow -- if Hannibal wants to dress him in fancy clothes, that’s fine, but Will draws the line at spending another day with silk rubbing against his junk all day long.</p>\n<p>When he returns from the bathroom, Hannibal is on one side of the futon with a book in hand. Will’s magazines and book from the plane ride are on the other side, and the comforter is flipped open for him. Hannibal gets up to help lower him into bed, and then pulls the comforter up and over him, and it feels really nice to have someone other than a nurse tuck him in.</p>\n<p>He means to pick up the fishing magazine again, but he’s had a long day of napping and Hannibal and that seems like more than enough for one day. His eyes fall shut, and at some point, Hannibal turns off the light. He’s mostly asleep when Hannibal finds his hand under the covers and laces their fingers together.</p>\n<p>***</p>\n<p>Before he knows it, a week has passed. Chiyoh disappears for long stretches of time, appearing only occasionally for meals. Will spends more time in one of the floor chairs that has an adjustable back than in his futon. Hannibal kisses him good morning and good night, and sneaks in few more when they’re alone in kitchen. Will and Abigail develop a game they call, “What product is this commercial for?” They are almost never right.</p>\n<p>Will’s kimono du jour is dark red with white cranes in flight. Hannibal did give him underwear when asked -- unfortunately, Will should have been more specific in his request, because the underwear Hannibal provides is on the slutty side and no less distracting than when he was going commando.</p>\n<p>“Your thoughts on this one?” Hannibal asks, handing Will his tablet. It’s another listing for an apartment in Paris.</p>\n<p>Will peruses the photo gallery; his French is limited to English cognates and remnants of Louisiana Creole, which is better than nothing but not by much, so the text description is less than helpful to him.</p>\n<p>“The rent is insane,” he tells Hannibal, because numbers don’t require translation.</p>\n<p>“Location, location,” Hannibal says in a genial lament.</p>\n<p>“Are you sure you want to be in the city?” Will asks. “Wouldn’t it be -- safer, to be out in the country?”</p>\n<p>“Expatriates are everywhere in Paris,” Hannibal says. “And I should like for Abigail to live at home with us while attending university.”</p>\n<p>“But daddy, what about the full college experience?” Will asks, and bats his eyelashes obnoxiously.</p>\n<p>Hannibal takes in a short breath; it’s a stutter, a blip in his norm presentation.</p>\n<p>But if Will couldn’t put two and two together and get nascent daddy kink, he arguably wouldn’t be where he is today. He wonders if Hannibal has always had a taste for it, or if it’s born purely of his obsession with Will.</p>\n<p>Whichever way it is, he’s not above using it to get what he wants, if necessary.</p>\n<p>“Let’s find a place on the outskirts of the city,” Will says. “Abigail can come home on the weekends -- she needs room to become an adult, and she can’t do it with the both of us hovering. You’ll have to give up at least that much control.”</p>\n<p>Hannibal purses his lips in thought. “You’d have me give up more than that.”</p>\n<p>“No killing for the first year,” Will says, and gives him a hard look. “You won’t endanger our family’s safety like that.”</p>\n<p>Hannibal’s eyes narrow. “Do you think me so careless as to get caught?”</p>\n<p>“They’re looking for you now -- for us,” Will says, leaning hard on their new plurality. “There will be more scrutiny than you’re used to. What good does it do to get Abigail into school if she just has to leave immediately?”</p>\n<p>Hannibal is silent, but he takes Will’s hand. He’s been doing that a lot over the last week -- before bed, during short walks around the house, while sitting together in the living room as they are right now. “Is this the price of your love, Will?”</p>\n<p>“No,” Will says steadily. “It’s the price of my company.”</p>\n<p>Hannibal looks him in the eye. “And after the first year? How far does this companionship extend?”</p>\n<p>“I’ll eat your food, no matter how your meat is sourced. But you promise me you’ll be careful about how you -- acquire it.”</p>\n<p>“And if I wish to acquire it with you?”</p>\n<p>“I can’t promise you that,” Will says. Hannibal’s hand tightens around his.</p>\n<p>“But you do not discount the possibility.”</p>\n<p>“I’m saying maybe, but if so, on rare occasions,” Will says, because the truth is that he really doesn’t know if that’s something he wants, and as Hannibal said -- dishonesty was no way to start a marriage.</p>\n<p>“And you think this is a price I should pay,” Hannibal says quietly, thoughtfully.</p>\n<p>“Unless you want me to break both our hearts and leave, yes.” The threat sounds suitably convincing to his own ears, and he feels the ache of that possible separation, bone-deep and painful.</p>\n<p>Hannibal pulls Will into his arms and holds him close. His warmth sinks into Will’s skin, and the light scent of his aftershave fills Will’s nose, and his fingertips brush the stitches binding the skin he sundered.</p>\n<p>***</p>\n<p>The cedar woods surrounding the villa hide the rest of the world away. Or at least, as much of the world as Will can venture to see, which isn’t much at the moment.</p>\n<p>Abigail surprises him by offering to accompany him for a morning walk outside. He’s been mostly confined to shuffling around the house, but he thinks a walk outdoors would do him good. He can’t deny that he’s going a little stir crazy.</p>\n<p>“We’ll go just to the foxes and then we’ll come back,” Abigail assures Hannibal.</p>\n<p>Hannibal finishes hanging up a dish towel, and then centers it neatly. Will feels something treacherous and dumb in his heart at the sight, which probably proves that he’s lost his mind after all. “You will call if you need me,” Hannibal says, and then presses a kiss to the top of Abigail’s head.</p>\n<p>Of course, Hannibal does not allow Will to step foot outside in just his yukata. “I have a vested interest in your extremities,” he says, while bundling Will into a fucking fur coat like Will is some kind of mob wife.</p>\n<p>“That’s either disturbing or kinky or both,” Will tells him.</p>\n<p>Hannibal just smiles at him and picks up his hand to press a kiss to Will’s knuckles, and then to his fingertips. “Have a nice walk. Abigail, please don’t let him overdo it.”</p>\n<p>“We’ll be back,” she says, and then carefully ushers Will out the back door into the forest.</p>\n<p>“What are the foxes?” Will asks as they make their way slowly down a dirt path.</p>\n<p>“They’re part of a little shrine up ahead. It’s not very far.”</p>\n<p>Will nods, and concentrates on putting one foot in front of another, and holds on to Abigail’s arm for extra support. The scent of the cedar trees fills his nose; it’s a grey day, and what light there is has a hard time penetrating the woods.</p>\n<p>He might have missed the shrine altogether if Abigail hadn’t stopped him. “Look up there,” she says.</p>\n<p>There are rough stone steps up the hill, leading to a tiny shrine flanked by two fox statues. The foxes’ tails and ears are tipped with moss, and the wood of the shrine looks grey and weathered. At the front of the shrine is a satsuma, like the ones that sit in a bowl in Hannibal’s kitchen.</p>\n<p>Will sits down on one of the steps, and Abigail squeezes in next to him. “You come here a lot,” he says, and he doesn’t need the swing of the pendulum behind his eyes to know it’s true.</p>\n<p>“Every day,” she says. “Chiyoh showed me. It’s a good place to think.”</p>\n<p>“What do you think about?”</p>\n<p>Abigail is quiet for a moment. “I think about what happened. What’s going to happen next.”</p>\n<p>“What do you want to happen next?” Will asks.</p>\n<p>She shrugs, and Will waits. Eventually, she says, “I want us to be a family. To be together.”</p>\n<p>“That’s the plan,” he says.</p>\n<p>She leans into him. He hesitates, and then wraps an arm around her shoulder. “He cut you open and left you,” she says, voice low.</p>\n<p>“Yeah,” Will says, and sighs. “He did.”</p>\n<p>They sit there for a while longer. Then Abigail says, “Sometimes at night, you can see lights in a line far away, moving slowly.”</p>\n<p>“Moving?”</p>\n<p>Abigail nods. “Chiyoh says it’s the fox's wedding. A procession.”</p>\n<p>Will imagines it, a line of paper lanterns in the dark. He shivers and looks back over his shoulder at the two fox statues. They don’t look tame.</p>\n<p>“I’m ready to head back,” he says, and Abigail gives him a hand up.</p>\n<p>Later that evening at twilight, Hannibal accompanies him back out to the shrine at his request. He leans a little more heavily on Hannibal’s arm than he did on Abigail’s -- the earlier walk took more out of him than he expected.</p>\n<p>When they get to the shrine, the satsuma that was there earlier is gone.</p>\n<p>“Are there foxes in the woods here? Real ones, I mean,” he asks.</p>\n<p>Hannibal frowns thoughtfully. “I saw one once, when I first visited as a young man. It would not surprise me if there were more.”</p>\n<p>Will fishes the satsuma he’d brought with him out of his coat pocket. “Will you help me up the steps?” he asks.</p>\n<p>They take it slow -- the stone steps are uneven, and there’s no railing. When they get to the top, Will takes a moment to catch his breath before moving forward. “How do I do this?” he asks, holding the satsuma uncertainly.</p>\n<p>“Place your offering there,” Hannibal says, indicating the small altar above a wooden offering box. Will does so, making sure it’s not liable to roll off. “Then you’ll ring the bell, bow twice, clap twice, and then pray and bow once more.”</p>\n<p>Will takes a deep breath, then pulls the small rope that jangles a small bell, bows twice without accidentally taking a header, claps twice, and then pauses. “What are you supposed to pray for?”</p>\n<p>“What’s in your heart,” Hannibal says simply.</p>\n<p>Will closes his eyes, and thinks. He’s a long way away from churches of his childhood, a long way from the Catholic Masses of New Orleans. As far as he’s been able to tell, praying has never gotten him anywhere. He wonders what Hannibal prays for.</p>\n<p>He opens his eyes again and bows. The light of the day is nearly gone, but something catches his eye in the wooden offering box with its slatted top.</p>\n<p>There are two gold wedding bands among the coins.</p>\n<p>“Let’s go home,” Will says, and before Hannibal can start them down the steps, Will kisses him and clutches him close like he’ll never let him go.</p>\n<p>***</p>\n<p>A few nights later, Hannibal decides it’s time for the stitches to come out.</p>\n<p>“You’re very calm,” Hannibal observes as he snips the ends and begins to pull the thread out. </p>\n<p>“I’m pretty sure you can handle this part,” Will says dryly. “In your sleep.”</p>\n<p>There’s something weirdly mesmerizing about Hannibal’s clinical touch -- he moves with such surety and efficiency, and in seemingly no time at all, the stitches are all removed, and Hannibal is cleaning the site gently before removing his gloves.</p>\n<p>“Are you going to give me discharge instructions?” Will asks.</p>\n<p>Will’s half-joking, but Hannibal looks serious as he says, “We can increase the length of your walks outside, but you shouldn’t lift anything over five pounds for several more weeks. We can continue to advance you to a normal diet, and decrease your opioid intake.”</p>\n<p>“I’m going to warn you right now about how not fun that is going to be for anyone,” Will says, but on the whole, it sounds like he’s making good progress.</p>\n<p>“Abigail and I will support you, Will,” Hannibal says. “I have every confidence that you will continue to make a good recovery.”</p>\n<p>“I’m just saying I’m probably going to be a jerk.”</p>\n<p>“Noted,” Hannibal says, looking far more pleased about the prospect than he should.</p>\n<p>Will is lying on his futon in an open yukata in what he’s sure is some pretty expensive underwear. “Can we have sex now?” he asks, because he’s human and Hannibal has refused to move things further along than necking.</p>\n<p>Hannibal gives him a arch look. “I think I can see my way toward clearing you for resumption of sexual activity.”</p>\n<p>“You have conditions?” Will asks, but he almost doesn’t care what they are, because seriously, Hannibal has been tormenting him.</p>\n<p>Hannibal strokes one finger carefully along Will’s neck, across a franky ridiculous hickey that is only partially hidden by the collar of his yukata. “I would advise any patient to engage in sexual activity during recovery with care. In your case, I think we should be quite cautious and proceed slowly so as to not set back your recovery.”</p>\n<p>“Well, that sounds annoyingly reasonable,\" Will says. He squirms a little under the heavy, greedy weight of Hannibal’s gaze.</p>\n<p>Hannibal leans over him on all fours, planting his hands on either side of Will’s shoulders. “I think it’s best if you lie there and take exactly what I give you,” he says.</p>\n<p>“As long as you’re going to give me <i>something</i>,” Will says, because he is older and theoretically wiser but probably always going to be prone to mouthing off. “So far this has been kind of a shitty honeymoon.”</p>\n<p>“I thought you might find the location romantic,” Hannibal murmurs, just a hint of a smile at the corners of his lips.</p>\n<p>“What is actually wrong with you?” Will asks, and then pulls Hannibal down into a kiss. It starts off as slow and sweet as all the rest, until Will gets impatient and the kiss gets more desperate as he starts tugging at Hannibal’s sweater.</p>\n<p>But Hannibal wasn’t kidding about restraint -- he traps the sleeves of Will’s yukata against the futon with his forearms, and says, “Gently, Will.”</p>\n<p>“I’m already mostly naked -- is there some reason you can’t be, too?” Will retorts.</p>\n<p>“All in good time, darling boy,” Hannibal murmurs against his throat, and okay, fine -- that works for Will, and he’s a little mad about it how well it works, but he doesn’t exactly care right now because Hannibal is sucking a line of kisses down to the horrendous love bite he made yesterday, while his fingers flirt with the waistband of Will’s slutty briefs.</p>\n<p>“If I come on your sweater, you’ve got no one to blame but yourself,” Will says, and then gasps when Hannibal nips at his throat.</p>\n<p>“I’m not inclined to be so wasteful,” Hannibal says, and pulls back enough to look Will in the eye. “I intend to savor you, down to the last drop.”</p>\n<p>That definitely shouldn’t work for Will either, but he doesn’t have time to be mad about it because Hannibal is making his way down Will’s body, lingering at his nipples before kissing down his sternum. He avoids the raw, tender pink of the scar he made, and slides Will’s underwear off, but not all the way. Will sees suddenly that he’s Hannibal’s new tableau, the low light of a lamp casting shadows and illuminating the ways in which Will is arranged for Hannibal’s aesthetic pleasure, selectively exposed by the yukata that contrasts with his skin, the elastic of his briefs tucked under his balls so that they’re pushed up, so that they’re displayed along with the hard line of his cock, all for only Hannibal to see.</p>\n<p>“Are you just going to look?” Will asks.</p>\n<p>“It would be enough,” Hannibal says, voice rough with emotion, and oh hell -- he means it.</p>\n<p>“It’s not enough for me,” Will says. “If it were, Freddie’s readership and I would be very happy together.”</p>\n<p>Hannibal’s eyes go dark; it wasn’t a very subtle prod, but Hannibal’s operatic feelings don’t seem to need it where Will is concerned, and some part of Will <i>likes</i> that, likes that whatever he makes Hannibal feel is so beyond his ability to control, pure and honest and more than a little fucking crazy.</p>\n<p>Hannibal slides his underwear all the way off and then finally touches him, giving his dick a few strokes before holding it at the base and leaning down to lick at the head slowly.</p>\n<p>“Oh, fuck,” Will breathes when Hannibal looks up at him as he finally takes Will into his mouth. His nerves feel all mixed up, too accustomed to pain and suddenly flooded with endorphins. He struggles to cope with how good it feels to have Hannibal work him with his lips and tongue; he feels high on what he sees in Hannibal’s eyes, possessiveness and desire and searing, sharp adoration.</p>\n<p>His balls are tight when Hannibal rubs them gently, and Will wants to buck up in his mouth but Hannibal’s forearm is laid firmly across his hips, so that he has no choice but to do what Hannibal said and take what he’s given. In Hannibal’s defense, what he’s serving up is really good -- his mouth is warm and he takes Will deep, sucks him like he’s starving for it, and when Will gasps and swears and says, “Fuck -- I’m gonna--” Hannibal swallows him down, throat working and gaze blissful.</p>\n<p>Will lies there, panting for breath, and he can hear Hannibal do the same. He feels wrung out, pleasantly exhausted, but he’s not in the habit of being selfish in bed and has no intention of leaving Hannibal hanging. He pulls at Hannibal’s sweater and says, “Come here,” and Hannibal obliges. “Why are you still dressed?” Will complains, giving up the sweater as a lost cause and going for Hannibal’s belt. He pushes Hannibal to lie on his back and finally gets his pants and underwear out of the way, and then swings one leg over Hannibal’s thighs to straddle him. He’s hampered by the fact that he’s nearly trembling with exhaustion, but he can make this good. His rumpled yukata hangs open, and he licks his hand while Hannibal watches and then starts to jerk Hannibal off. Will likes the heft of Hannibal’s dick in his hands and how Hannibal can’t look away, the small gasps and sounds as Will works him over, precome and spit making everything slick.</p>\n<p>That being said, Will kind of needs Hannibal to wrap this up before he falls over, so he decides he may as well go for it. He strokes Hannibal a little firmer, a little faster, playing with the unfamiliar foreskin before he murmurs, “Come on, daddy, please.”</p>\n<p>Hannibal arches up into Will’s hand for a few short thrusts and then comes hard, all over his own stomach. Will collapses against Hannibal’s side, and luxuriates in Hannibal petting his hair rather unsteadily. And because Will basically can’t help himself, he says, “Was it good for you too, daddy?”</p>\n<p>“Wretched boy,” Hannibal mutters.</p>\n<p>“You love me,” Will says lightly.</p>\n<p>There’s a pause, and then Hannibal says, “I know.”</p>\n<p>***</p>\n<p>They stay another month, until Will is recovered enough to travel without needing a wheelchair. Hannibal packs away the yukata and kimono, although Will feels reasonably sure that a select few are going to mysteriously appear in his wardrobe in their little house outside of Paris.</p>\n<p>“I’m not wearing that mob wife coat in public,” Will warns Hannibal.</p>\n<p>Hannibal sighs, like Will is such a trial; Abigail says, “Can I have it, then?”</p>\n<p>That kicks off a whole discussion about fit and proportion that Will tunes out in favor of making sure the kerosene heater in the kitchen can be safely stored away. Chiyoh isn’t coming with them, and she’s not staying here, so they’re closing the house up in earnest.</p>\n<p>“Will we come back?” Will asks Hannibal as he packs their luggage. Will offered to help, but wasn’t surprised to have Hannibal tell him he was welcome to keep Hannibal company but forbidden to touch anything or offer opinions on optimal packing.</p>\n<p>“I should like to,” Hannibal says. “Kyoto in cherry blossom season is not to be missed.”</p>\n<p>“I meant back to this house,” Will says. He rests one hand on the smooth wood of the doorway, old and well-cared for. “I like it here.”</p>\n<p>“If you wish.” Hannibal closes the suitcase and rises to his feet. “I’d be pleased if you would allow me to make a wedding gift of it to you.”</p>\n<p>“I don’t need a whole vacation house,” Will protests. “And anyway, you still haven’t asked me to marry you.” It’s been his refrain for a month, because Hannibal, in fact, has done everything but that -- he’s booked a French chapel and pestered Will about flowers and cake and color schemes. Abigail is getting a new dress, and Will doesn’t know what his suit is going to look like, but if he knows Hannibal, it will look good.</p>\n<p>Abigail calls down the hall for Hannibal then, and Hannibal excuses himself to assist her, leaving Will at loose ends. They’re leaving for the airport in the morning, and Will thinks that he really is going to miss this place. He goes out to the veranda off their bedroom that winds around the back of the house; the moon is bright, and it’s not as chilly as it was.</p>\n<p>When Chiyoh’s voice comes, it startles him. “You’re going with them, then,” she says quietly.</p>\n<p>Will nods slowly. “What will you do?”</p>\n<p>Chiyoh gives the barest suggestion of a shrug. “I don’t know,” she says, and sounds surprised by that turn of events.</p>\n<p>“Good luck,” Will tells her. “And thanks for kidnapping me.”</p>\n<p>“You’re very strange,” she tells him, and disappears back into the house.</p>\n<p>Hannibal joins him shortly on the veranda, a bottle of sake and two cups in hand. He also has Will’s wool jacket, which of course turned out to be designer haori that Will is also not going wear in public, but it is very warm and comfortable and he’s glad to have it now.</p>\n<p>They sit with their legs over the edge of the veranda, the cedar woods surrounding them, lit by the moon. Will picks up the decanter to pour, and then stops when he realizes there’s something in his cup. The ring glints in the moonlight, and it’s hard to make all the detail out, but it’s inlaid with something that sparkles discreetly. Positively restrained, for Hannibal.</p>\n<p>“Is this where I ask if you’re going to make an honest man out of me?” Will says.</p>\n<p>“As much as I enjoy living in sin with you, I would much rather never be parted from you again,” Hannibal says. </p>\n<p>Will looks down at the ring. “Is this the price of your company?”</p>\n<p>“No,” Hannibal says. “I will pay yours and consider it well spent, but I would be with you, married or not.”</p>\n<p>Will slides on the ring and pulls Hannibal in for a kiss, slow and tender. “Marry me,” Will whispers.</p>\n<p>“Of course,” Hannibal says. “Dear Will, of course.”</p>\n<p>Over Hannibal’s shoulder, he thinks he can see something in the dark, like a train of lights. Will closes his eyes, and prays.</p>\n<p><br>\n<br>\n<br>\n</p>"
}