{
  "id": "931046",
  "url": "https://archiveofourown.org/works/931046?view_full_work=true",
  "author": [
    "ShanaStoryteller"
  ],
  "title": "hope is the thing with feathers",
  "rating": "Teen And Up Audiences",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Teen Wolf (TV)"
  ],
  "relationships": [
    "Derek Hale/Stiles Stilinski",
    "Lydia Martin/Jackson Whittemore"
  ],
  "characters": [
    "Stiles Stilinski",
    "Derek Hale",
    "Scott McCall",
    "Alan Deaton",
    "Laura Hale",
    "Peter Hale",
    "Talia Hale",
    "Sheriff Stilinski",
    "Lydia Martin",
    "Danny Māhealani",
    "Jackson Whittemore",
    "OFCs",
    "OMCs"
  ],
  "additional_tags": [
    "BAMF Stiles",
    "Magic!Stiles",
    "Hale fire",
    "AU",
    "universe fix it",
    "Pre series",
    "Pre-Slash",
    "Scott and Stiles bromance",
    "Derek is an artist",
    "Everyone lives",
    "peter doesn't suck",
    "Stiles is Derek's Anchor",
    "stiles and the hales are tight"
  ],
  "language": "English",
  "series": "Part 1 of where thou art, that is home",
  "published": "2013-08-18",
  "completed": null,
  "words": "28,959",
  "chapters": "1/1",
  "comments": "625",
  "kudos": "26,217",
  "bookmarks": "7,080",
  "hits": "594,835",
  "summary": "<p>Stiles is ten when he saves the Hales from their burning home and Derek from a wolfsbane bullet, and this establishes a pattern that seem to continue indefinitely. </p>\n<p>\"Then he's facing a burning home, and he wraps the hood of his sweatshirt around his mouth before he pushes the door open and steps inside. There's Mr. Hale asleep - he hopes asleep - on the couch, next to - Stiles thinks that's his brother but there are so many Hales, who can keep track. He rushes over and starts shaking him, can see the rise and fall of the man's chest so he knows he's alive, but he's not waking up.<br>He shoves away his hood so he can shout, \"Mr. Hale! You have to get up, there's a fire! Mr. Hale, get up!\" Nothing, he's not even twitching, both of them taking in deep even breaths like they're having the most peaceful of rests, and Stiles is going to cry. \"Wake up, wake up, wake up!\"<br>There's a moment, where all Stiles can hear is the blood rushing in his ears and not the roar of the flames or the creak of wood, then with a violent, silent pop it's all back and both of the men are gasping awake, eyes open and jumping to their feet. \"</p>",
  "notes": "<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>I started this a couple months ago, and while I did some quick editing on thing, like making Peter Talia's brother and mentioning emissaries, the important tree and Stiles sacrifice was in there from the first outline, so I feel awesome. I'm note sure when I'll start the second part, but if nothing else I have an outline for it. </p>\n<p>If you'd like, you can follow/harass me on tumbler here: shanastoryteller.tumblr.com</p>\n<p>I put a lot of love and effort into this, so I hope you enjoyed it!</p>\n<p>Do not add this work to Goodreads or any similar sites.</p>",
  "text": "<p></p>\n<p>\n<img src=\"https://31.media.tumblr.com/05db7c97738834009b4a9998a2270111/tumblr_mt6ax2ROd31s2w4ixo1_1280.jpg\" alt width=\"606\" height=\"608\" align=\"middle\"></p>\n<p>Graphic done by <a href=\"https://blainehowler.tumblr.com/\" rel=\"nofollow\">BlaineHowler</a><br>\n</p>\n<p align=\"center\"><em>Hope is the thing with feathers</em><br>\nThat perches in the soul,<br>\nAnd sings the tune without the words,<br>\nAnd never stops at all<br>\n<br>\nAnd sweetest in the gale is heard;<br>\nAnd sore must be the storm<br>\nThat could abash the little bird<br>\nThat kept so many warm<br>\n<br>\nI've heard it in the chillest land<br>\nAnd on the strangest sea;<br>\nYet, never, in extremity,<br>\nIt asked a crumb of me</p>\n<p align=\"center\">\n<em>- Emily Dickinson</em>\n</p>\n<p align=\"center\"> </p>\n<p>It's hours past bedtime - he knows Mrs. McCall is curled asleep on the couch with a half finished glass of wine dangerously close to her out flung hand, and Scott's ridiculous, asthma induced snort-snores are familiar and comforting in his ear, but he can't sleep. Something feels tight and wrong in his body, like he wants to peel back skin and muscle so he's unburdened by nothing but bone. The last time he felt like this had been almost two years ago, and Mom hadn't made it through the night.</p>\n<p>Dad's working the night shift, which is why he's curled up with his best friend on a school night, and he - he can't stay here, right now, not like this. He's barely shoved on his clothes and shoes when Scott's shifting awake, rubbing his eyes and blinking slowly. \"Stiles?\" his mouth is deep around the words, eyes a little too wide and - and okay, maybe Stiles should have thought this through, because it's only been a couple of months since Scott woke up to someone else sneaking out in the dead of night, and so far Mr. McCall hasn't come back.</p>\n<p>\"I wasn't - I can't,\" Stiles breathes out through pursed lips, and throws Scott's jeans at his face, \"I can't sleep, or stay still, and the moon's really bright, so let's go in the woods. It looks cool at night.\"</p>\n<p>It actually looks like darkness and wild animals at night, but Scott just shoves himself into his jeans and sneakers and follows him out the back door.</p>\n<p>They've been walking for nearly fifteen minutes in silence, Stiles grabbing leaves from low hung branches every half dozen steps to shred them to pieces, when he smells it. He stops, suddenly enough that Scott stumbles into him with a soft thud.</p>\n<p>\"Do you smell that?\" he asks, tipping his head up as if that will help any.</p>\n<p>Scott breathes in deeply behind him, and Stiles knows he does when he goes rigid against his back, \"Smoke, that's smoke, oh my God, the forest is on fire, we have to go, now.\"</p>\n<p>Scott tries to stagger away, but Stiles grabs his hand and refuses to move. Scott could probably pull free, but he's as reluctant to leave someone behind as he is to be left behind himself. \"No - well, yeah, it's smoke, but it's not campfire smoke, right? That's not wood burning.\"</p>\n<p>He's still wound tight, but Scott takes another deep breath, says, \"It smells like the time Mom forgot she put the Tupperware in the oven before she preheated it.\"</p>\n<p>\"We should check it out,\" Stiles says, already walking towards the smell. Scott whines disagreement, but his hand is still tangled with Stiles's so he follows. \"Look, it's not like we can call 911 and say there's a fire somewhere in Beacon Hills, we have to find it first before we can do anything.\"</p>\n<p>\"Why do we have to do anything?\" Scott asks, but he's stopped resisting and is matching Stiles's longer stride, because Scott's mom is a nurse, and Stiles's dad is the sheriff, so if they've learned anything it's that you always do something.</p>\n<p>The stench has almost gotten unbearable by the time Stile realizes that he knows where he is, and then he's running, dragging Scott behind him as he darts around trees and bursts into a clearing that he's been to maybe once.</p>\n<p>The Hale House is on fire, and the smoke is thick enough that Scott's starting to cough, which is sufficient for Stiles to start pushing him away. \"Get out of here, go, get help.\"</p>\n<p>\"Come with me!\" he demands, face flushed an unhealthy shade of red.</p>\n<p>\"I can't, someone has to wake them up and get them out, and someone has to get help, and you have <em>asthma</em> Scott, so you're not going to be the one going into the burning, smoking building, okay? Just - go find the nearest house and bang until they let you in, and make sure they send the fire department okay?\" Scott still looks stubborn and terrified, and Stiles can feel the heat of the flames on the back of his neck, so he shoves him again, tries to make his voice sounds like his dad's when he says, \"<em>Go!</em>\" and must be mildly successful because Scott does.</p>\n<p>Then he's facing a burning home, and he wraps the hood of his sweatshirt around his mouth before he pushes the door open and steps inside. There's Mr. Hale asleep - he hopes asleep - on the couch, next to - Stiles thinks that's his brother but there are so many Hales, who can keep track. He rushes over and starts shaking him, can see the rise and fall of the man's chest so he knows he's alive, but he's not waking up.</p>\n<p>He shoves away his hood so he can shout, \"Mr. Hale! You have to get up, there's a fire! Mr. Hale, get up!\" Nothing, he's not even twitching, both of them taking in deep even breaths like they're having the most peaceful of rests, and Stiles is going to cry. \"Wake up, wake up, <em>wake up!</em>\"</p>\n<p>There's a moment, where all Stiles can hear is the blood rushing in his hears and not the roar of the flames or the creak of wood, then with a violent, silent pop it's all back and both of the men are gasping awake, eyes open and jumping to their feet.</p>\n<p>\"Your house is on fire,\" Stiles says weakly, when both pairs of eyes settle on him, in case they haven't noticed the flames or the heat or the way it's getting harder and harder to see with all this smoke, which smells a little like the wood it's eating away at, but mostly reminds Stiles of something chemical and foul, \"We should get everyone and leave, now.\"</p>\n<p>Mr. Hale curses, \"Peter, get-\" but the other Hale, Peter, is already sprinting away, hopefully to get the others. Then Mr. Hale picks him up and takes him towards the door, saying, \"Stay outside, stay right there,\" and Stiles is already nodding when they're about three feet from the door, and Mr. Hale just - stops. Stiles can feel his muscles bunching and straining, but they're not going anywhere. There's something horrible in the other man's expression when he sets Stiles to his feet and presses his hand against what to Stile looks like air. \"No,\" he breathes, once, before telling Stiles one more time, \"Go outside,\" and turning around.</p>\n<p>Stiles - Stiles is really bad at doing as he's told, and he hops back and forth across the line that Mr. Hale couldn't seem to cross, thinking about electrical lines and gas but easily maneuvering around the four feet of space that had stopped Mr. Hale. Then he hears crying from the staircase to his left, and he's already taking the steps two at a time before he remembers that he's supposed to be outside.</p>\n<p>He follows the crying to a nursery, to a toddler who's barely pushing two with three other children younger than he is huddled around him, and when four pairs of eyes lock on him with desperation, it become so much harder to breath than can be explained by smoke and running and panic. But something groans in the house, and Stiles is darting forward to heave the child into his arms, trying to hold him like he'd seen parents do in the hospital, and he grabs one of the girls' hands and says, \"All of you, follow me, okay,\" and he gets solemn nods and soft footfalls following him down stairs hot enough that Stiles is reminded of the beach and hopping around sand too burning to stand on. He makes it down to the landing, tries to lead them all out the door and - can't. He can move just fine, but his arms containing the boy won't budge, and he feels like he's playing an invisible game of tug of war when his body is on one side of the invisible line but his hands and the boy are on the other.</p>\n<p>\"Come on,\" he says to the three other children, and the girl whose hand he'd been holding and the boy cross to his side just fine, but the older girl can't, and she looks terrified as she pushes against something Stiles can't see or feel. \"Here,\" he hands her the boy, and she needs to wrap both arms around him to keep him upright, \"I'm going to get them outside, but then I'm coming back for you, okay?\" She nods, and then Stiles is grabbing hands and tugging the kids out the door, ushering them to a girl about his own age who meets him halfway and wraps both of them in a hug. He looks and sees a couple of other kids older than him behind her before ducking back in. He's almost positive he hears a siren in the distance, and he hopes he's not making that up.</p>\n<p>He finds Mr. Hale with his arms wrapped around the girl and boy, and a scattering of adults arguing with other adults with children in their arms, and Stiles doesn't know what can be so important that they can't yell at each other outside. \"Excuse me!\" he shouts, and they all fall silent, see him there for the first time, \"But your house is on fire, so we should leave now.\"</p>\n<p>Mrs. Hale gives one of the adults on his side of the line a triumphant look, and something falls down next to his head, oh my God, the house is collapsing, they don't have time for adults to be stupid. \"Let's go!\" and then he's herded out the door along with everyone else, thank you, finally. But he looks once they get outside to see they're still missing people, that all those on the other side hadn't followed, and no, no, <em>no</em>.</p>\n<p>Stiles squirms out of reaching hands and goes back into the house for the third time, has to dodge falling pieces of burning wood twice, to stand in front of them again, \"Come on!\"</p>\n<p>Mrs. Hale frowns, \"Honey, thank you, you've saved us, but you have to leave now, right now, okay? Go back outside.\"</p>\n<p>Stiles stares, because he didn't do anything, didn't save anyone, because they're still in the house, the kids and grownups, and if they don't leave they're going to die, going to be dead, just like his mom. \"Come with me.\"</p>\n<p>\"We can't,\" Mr. Hale pitches his voice soft with kindness, clutching both children to him unbearably tight, \"we just can't, okay, you have to go or you're going to get hurt.\"</p>\n<p>They're going to <em>die</em>, don't they understand, so Stiles crowds into them, almost immediately has hands trying to push him out and away but he grasps onto one, looks up into pained eyes of the other man from earlier - Peter, he thinks - and says, \"Yes, you can.\"</p>\n<p>Peter laughs, it's not funny, and says, \"We really, really can't, but you can, so you need to.\"</p>\n<p>Stiles is - Stiles is furious, who do they think they are, to die and leave those people outside alone, stupid line or not, they're going to live, they're not going to leave people behind who cry into their pillows at night or have hearts who hammer too fast with grief and lungs that forget to breathe.</p>\n<p>\"YES YOU CAN,\" he can't even call that a yell, it's a scream, harsh and high against his already blistering throat, and when he tugs Peter forward there's the same sensation as earlier - a moment of terrifying silence and stillness before it sounds like Stiles has poked a hole in the air and Peter is stumbling across the line, bracing his hands against the burning doorway with a look of utter shock on his face, same as all the others when Stiles looks back. He shoves the older man even closer to the doorway and goes back to grab the toddler from Mr. Hale's slack grip and says seriously, \"You can, you can go now, we have to go, okay?\" It seems to work, because they are, dodging flaming debris and getting far from the ominous creaking and moaning of the house that's sure to fall on top of them.</p>\n<p>All of the Hales spill onto the lawn to watch their house burn and Stiles finally feels the adrenaline start to recede as Mrs. Hale scoops him up - he's big for his age, and she looks so small he doesn't know how, but she manages it - and chants gratitude into his hair as they watch the left section of the house collapse in on itself. The house is a goner, nothing but flame and fire and a bitter, awful scent in Stiles's nose, but all the Hales are out and safe, so it's going to be okay.</p>\n<p>Stiles doesn't see her until he's being crushed between two female bodies, a girl wrapping herself around Mrs. Hale and him in the process while yelling. He can't make out all the words, only that they're frantic and pained. He wants to say something, but finds that there's something like fear lodged in his throat; what if they left someone inside, there are so many people, what if they missed one. He's almost worked up the courage to interrupt when they're running, and he clutches tight to Mrs. Hale, because she's moving far faster than a woman carrying a ten year old boy should be able to.</p>\n<p>He only opens his eyes when they stop - and Mrs. Hale tosses him on the ground, snarling and - oh my God, he must have inhaled more smoke than he'd thought because he think that Mrs. Hale just turned into a gigantic black wolf with red eyes, and the other girl is kneeling by someone else's body and crying.</p>\n<p>He glances at what he really hopes is Mrs. Hale, who's in the middle of trying to tear a group of people to pieces, and crawls over to the other two. The girl is clutching a boy's hand, she's devastated and it's not hard to see why, with a bullet hole in the middle of his chest where Stiles is pretty sure the heart is and - and something black and thick pulsing in his veins and under his skin. Stiles recognizes him - knows him, just a little bit, or maybe just knows of him, but his vision is already going a little off with held back tears when he says, \"Hi, Derek.\"</p>\n<p>They seem to notice him there for the first time, the girl's neck snapping up while Derek's head just kind of lolls to the side so Stiles can stare into fever ridden hazel eyes, \"Hey.\" His chest starts hitching like it's hard to breath. Stiles places a hand on a bloody shoulder, paying attention not to lose his grip on the slick skin, and grabs Derek's free hand to twine their fingers together. His chest smoothes, still taking in breathes too quick and sharp, but more in his control. There's a scream and the sound of what Stiles is sure is tearing flesh, but even if he wanted to look over, he can't seem to tear his eyes from Derek's. \"Do I know you?\" he asks, voice weak enough that Stiles has to shuffle that much closer to hear him.</p>\n<p>\"You work at the library, on weekends,\" he says, reaching out to the sluggishly bleeding wound without really being sure why. It's too dark to see properly, but - he's almost certain that blood shouldn't be that color, that it's a few shades too dark to be normal.</p>\n<p>\"You read Nancy Drew,\" there's something like amusement in his voice, but his eyes are sliding shut and the girl by his side starts to sob. A woman screams, and Stiles would be worried except that he doesn't think Mrs. Hale has the correct vocal cords to make that noise right now.</p>\n<p>Stiles moves his hand to the bullet hole, blood hot between his fingers and presses down until Derek's eyes open again and find his, \"You're going to be okay.\"</p>\n<p>Derek's lips twitch, like he's trying to smile, \"I'm not.\"</p>\n<p>Stiles is fed up with these Hales, and all the things they can't do, like waking up and leaving a burning house and living. He presses down more, and he doesn't believe blood is supposed to be this hot either, because he thinks that if he could see properly it would be bubbling beneath his hand. The girl gasps and scrambles back as Derek's eyes go too wide and Stiles says, \"You're going to fine,\" and presses down harder, and this time - he tries to think of how it felt when Mr. Hale woke up, of dragging Peter across that line that he couldn't see, and he remembers silent, sullen Derek shelving books while Stiles sneaked looks above musty, yellowed pages. Derek's mouth is open like he wants to scream, but can't find the breath, and Stiles adds more pressure still, wonders how much heat a body can stand before it bursts into flame, and forces fire into Derek, burns out the lines of black he can't even see, and feels flesh start shifting beneath his fingers as he repeats, \"You're going to be fine,\" with his eyes locked onto Derek's before passing out.</p>\n<p> </p>\n<p>He wakes up still in the woods but to his father's frantic voice, and he grumbles even as he curls inward, awake enough to realize he's in his dad's lap but not awake enough to be embarrassed about it. \"My head hurts,\" he whines and uses weak hands to clutch to his father's shirt and press his forehead to his chest.</p>\n<p>\"Oh God,\" he chokes, and Stiles is being cradled impossibly close and he feels wet tears against his neck, which is enough for him to flail, probably kicking his dad as he blinks his eyes open and grabs his dad's face, looks horrified into his red eyes and trembling jaw.</p>\n<p>\"Are you okay?\" Stiles demands, hands now pressing against his father's torso, \"Are you hurt? Don't be hurt.\"</p>\n<p>He shakes his head before he's clutching Stiles to him again, one hand curving around his son's head. Stiles looks over Dad's shoulder, and sees one of Dad's deputies talking to Mrs. Hale, who has one arm around the girl from earlier and the other around Derek. Stiles feels some tension go out of him as he collapses more fully against his dad, because Derek looks whole and healthy and not anything close to dying. The girl catches his eye and grins. She jerks her head to her mother, then to where he's sure a few bodies are, and winks.</p>\n<p>He winks back, because he understands secrets, he's good at those, and presses a kiss to the side of his dad's head before closing his eyes again, because everyone is okay, and safe, and his dad is here, and being awake seems like a lot of work right now.</p>\n<p> </p>\n<p>He wakes up in Dad's bed with Scott curled around him like an octopus, and he feels too hot from the night spent sharing body heat, and also he smells like smoke and can feel a dull ache in the places where burning wood and flames licked against his skin. His dad's nowhere to be seen, and there's no way he's getting up without waking Scott, so he's not even going to try. He only manages a foot of space between them and a grin that stretches his split lip before Scott's awake and throwing himself at him again, knocking his forehead against Stiles's so hard it hurts but he laughs anyway.</p>\n<p>\"It's not funny!\" Scott says, with blown pupils and panic in the strength of his grip. \"You - you wouldn't wake up, and mom had to wrap all your burns, and your dad was <em>crying</em> okay! And I - I was -\"</p>\n<p>According to Jackson they're too old for hugs, but Jackson's an idiot, so he rolls them so he can force himself on Scott and press their cheeks together, and yep, they're sticky with what Stiles is pretty sure are dried tears. Stiles is the worst best friend and son in the world, because Scott's a crier, he cried when his dad left even though Stiles was pretty sure he was the worst father in the world (he realizes it's maybe not fair to compare other people to his dad) and whenever Jackson is a jerk, and last week he cried when Greenburg fell and broke his nose, but he hasn't seen his dad cry since Mom, so if there's a hell, he's probably going to it. He just holds Scott until he feels like he isn't about to vibrate apart.</p>\n<p>They stumble downstairs, hands still clasped until they push their way into the kitchen to find his Dad and Mrs. Hale sitting at the table. He pulls away from Scott to stand in front of his father, who has turned his chair sideways so he can wrap his arms around his son, softer on the throbbing burns than Scott had been, but that only makes Stiles hold on even more tightly. When he pulls back, there's a grief in his face that Stiles hadn't wanted to see there ever again, and especially not because of him.</p>\n<p>\"I'm sorry,\" he says, reaches up a hand to smooth it across the wrinkle between his eyebrows, as if he can smooth away the worry too.</p>\n<p>Dad sighs, \"You scared the crap out of me, kid.\"</p>\n<p>\"I'm sorry,\" he repeats, miserable in a way that only guilt can achieve.</p>\n<p>\"Just - don't do it again, okay?\"</p>\n<p>Stiles drags his eyes over to Mrs. Hale, who smiles at him. He thinks of her behind that invisible line, her calm resignation in her fate of burning alive with her family and he doesn't sound very convincing even to himself when he looks back at Dad and says, \"I'll try.\"</p>\n<p>His smile is sort of resigned, and he ruffles Stiles's hair and says, \"I should have raised you worse.\"</p>\n<p>Stiles nose scrunches, because what's that supposed to mean, but before he can ask Mrs. Hale is standing, pulling him over into her own hug, and this is a whole lot of hugs from a bunch of people, but his arms encircle her waist, and she seems so small that it's hard to remember how much strength is hidden in her.</p>\n<p>\"Stiles,\" her hands cup his face, and for the first time he realizes that Mrs. Hale is really, really beautiful. Derek has her eyes. \"What you did was reckless, and dangerous. But I owe you - so much, and I can't thank you enough for what you've done.\"</p>\n<p>\"Everyone's okay, right?\" he asks, heart kicking up with anxiety, \"Even Derek?\"</p>\n<p>\"We are probably never having another family reunion in Beacon Hills ever again, but everyone's going to be fine,\" she says, and that's definitely fond exasperation in her tone, he recognizes that, it's what he evokes in Dad and Mrs. McCall most, \"thanks to you.\"</p>\n<p>\"Anytime,\" he says without thinking, but he means it, he really does, burns, fear, things he doesn't understand, and scared best friends and fathers all, he'd do it again.</p>\n<p>His father groans and Scott yelps protest, but somehow Mrs. Hale's face softens even more before she presses a kiss to his forehead.</p>\n<p> </p>\n<p>He's aware of Dr. Deaton in a vague sort of way, but when he shows up at his front door during the one hour period between him getting home from school and Dad getting home from work, he can't help but think that the look on his face is a little dramatic.</p>\n<p>\"Werewolves?\" he asks, stepping back to let him in.</p>\n<p>He whips his head around, as if Mrs. Louis is going to start stabbing him with the shears she's using to shape her bushes, and Stiles immediately wants to laugh. \"They said you they hadn't told you anything,\" he says, closing the door behind him.</p>\n<p>Stiles leads him to the living room and curls up on his dad's chair. Dr. Deaton sits on the end of couch closest to him. \"Mrs. Hale turned into a giant man-eating wolf right in front of me. It seemed kind of obvious.\"</p>\n<p>\"Does your father know?\"</p>\n<p>Stiles laughs, \"Yep, of course, no. Even if he'd believe me, it's not my secret to tell. I can keep a secret.\"</p>\n<p>Something eases in the older man's face, and Stiles tries to resist the urge to fidget, but gives in, twisting the hem of his shirt in his hands. \"Stiles,\" Dr. Deaton leans forward, \"I talked to Talia - Mrs. Hale - and she told me what you did. You know that's not normal right?\"</p>\n<p>\"Oh, really, I thought everyone could heal bullet wounds and put holes in walls with their mind,\" he mutters, and when Deaton raises an eyebrow, he admits, \"There are some pretty big missing sections of wall I'm hiding in my closet.\"</p>\n<p>A quirk of the lip turns into a smile, \"I can teach you to control it. It's best for everyone if you can control your powers - unchecked, they could be dangerous. You're the most powerful mage I've ever seen Stiles, and I've seen a lot.\"</p>\n<p>He feels like he's in the middle of something J K Rowling thought up, and he understands why Harry seems to have so many anger management problems. He sighs, \"How am I going to explain it to my dad?\"</p>\n<p>\"You don't want him to know?\" Stiles just stares, they've covered this, and he's not going to put that look of worry back on Dad's face by telling him that he's something not quite normal. \"You could say you're volunteering with me. He'll appreciate knowing that someone's watching you after school when he can't.\"</p>\n<p>\"Yeah,\" Stiles says dryly, \"it's a huge hazard - anyone could walk up to the front door and ask to be let in.\"</p>\n<p> </p>\n<p>He's not sure if they were waiting for a signal from Deaton or what - but suddenly the Hales are all up in his business, Cora starts sitting with him and Scott during lunch and sometimes she and Cory, Peter's human daughter (who apparently has an asshole dad who names his kid Cordelia) hang out his house on weekends, and Scott doesn't really know how to handle these new people vying for Stiles's time, so he mostly pouts and glares at them until Stiles tackles him.</p>\n<p> </p>\n<p>It's nearly a month after the fire when Stiles looks above his collection of poems of Edgar Allen Poe to see Derek stretching to reshelf a book. He jolts, and his own book comes tumbling down and he's on his feet before he can get some better judgment. \"You're okay,\" he says, and Derek startles almost like he did, losing his grip on the massive tome. Stiles flicks his hands, and he's more relieved than impressed that he manages to stop it from falling on top of their heads and slides it into place as opposed to just blowing the whole thing up. He glances over at the librarian, but as always she's more interested in the book she's reading than anything happening around her. Stiles can respect that.  He feels the heat of Derek's body and looks back at him, the first time he's seen the older boy since his hands were slick with his blood.</p>\n<p>\"Oh, man,\" he says quietly, because he looks awful, too pale and heavy shadows under his eyes. Stiles lays a hand over his chest where the bullet was. There's a feeling like static and Derek's chest jumps under his hand. \"Did I mess it up? Your mom said you were okay.\"</p>\n<p>\"I'm,\" it comes out hoarse, and Derek clears his throat before he continues, \"I'm fine, all healed. You did a good job.\"</p>\n<p>\"What's wrong?\" Stiles saved his life, and that doesn't give him the right to invade the older boy's space and demand answers, but he's not being pushed away.</p>\n<p>\"I'm fine,\" Derek says, but it sounds like a broken record to Stiles's ears and he makes a fist in the material above Derek's chest. He takes a final step closer, rests his forehead near his hand, stays there until Derek's stiffness lessens by degrees. His hands stay at his sides, but his chin does land on the top of Stiles's head and rest there a moment. When he takes a step back, Stiles sees the new ease in his face, and he feels like an idiot, because Derek is older and cool, but he says anyway, \"If - if you want - I mean - I didn't save your life so you could be sad, and not sleep, and I realize sometimes shitty things happen and you get sad, and that's not something you can really help, but you have all your family, and they love you, so whatever it is that's not letting you sleep, you have that and - and if you want, you can have me to.\"</p>\n<p>Derek's mouth is open, eyes wide, and Stiles flushes a previously unknown shade of red before he bolts out of there, because, Jesus, how did he even get Scott, he's terrible at making friends.</p>\n<p> </p>\n<p>Later that night Stiles is still attempting to bury his mortification in Lord of the Rings when his Dad comes in, face creased in the place between confusion and amusement, and hands him the phone, \"For you.\"</p>\n<p>Stiles blinks, because the only person who ever calls him is Scott, but he's seeing a movie with his Mom. \"Hello?\" he asks, and loves Dad a little bit when he leaves to give him privacy. Secrets are never really things he's had with Dad, but now with training to be the next Harry Potter and hanging out with an increasing number of werewolves, he's starting to see the appeal.</p>\n<p>\"Stiles.\"</p>\n<p>He knows that voice, and he squeaks out a \"Mr. Hale.\"</p>\n<p>\"Derek came home and it smelled like you saw him today.\"</p>\n<p>Stiles scrunches his nose even as he flushes, because doesn't Mr. Hale realized how <em>weird</em> stuff like that sounds, \"Uh, yeah, I saw him at the library.\"</p>\n<p>\"Thank you,\" he says, and that's the second expression of gratitude he's gotten from an adult recently. It's starting to freak him out.</p>\n<p>\"Um,\" Stiles's mouth twists, because he thinks his behavior is vaguely stalker-ish, and this wasn't what he was expecting, if he'd had the time to expect anything at all. \"For what? I kind of, um, accosted him, a little. He seemed sad.\"</p>\n<p>\"He is,\" and Mr. Hale sounds sad too, and Stiles is struck with more helplessness, he <em>hates</em> when people are sad and hurt and there's nothing he can do about it. \"But he was less sad, after he saw you. We weren't sure what we were going to do if - well, he seems like he's handling things better, after seeing you. Thank you.\"</p>\n<p>\"Anytime,\" he answers, and Mr. Hale doesn't hang up fast enough to hide his laughter.</p>\n<p> </p>\n<p>Laura Hale shows up in the middle of one his sessions with Deaton and kisses his forehead, nudges him in the ribs, and hands him a hot chocolate without saying a word.</p>\n<p>Stiles sips at the drink which is somehow neither too hot nor too cold, and at Deaton's expression he sighs and asks, \"Are all werewolves this weird, or are the Hales just special?\"</p>\n<p>\"Half of the Hales are human,\" he says mildly, sliding over the lines of Latin he'd just translated with corrections marked in red.</p>\n<p>Stiles breathes a sigh of relief when it only looks like someone had a nosebleed over it, and not like someone slashed their wrists and then used the paper to stem the flow. \"So the Hales are just special then.\"</p>\n<p> </p>\n<p>Scott pokes him awake and Stiles startles before looking at the tv screen and abandoned game controller guiltily. \"You're getting into trouble without me,\" Scott says, and it's not a questions. Stiles doesn't try to lie, just nods. \"Why?\"</p>\n<p>\"It's - new trouble. I'm not sure what it is, yet.\"</p>\n<p>\"Dangerous?\" he asks, lips already pulled in a scowl, and Stiles almost shakes his head, but hesitates, because he's not sure. \"Secret?\" This one's easy, but it makes the rolling pit of guilt heavier in his stomach. Scott sighs, knocks their shoulders together and says, \"You'll tell me when you can?\"</p>\n<p>This is easy too, \"Of course.\"</p>\n<p>Scott nods and resets their game. Stiles may be the worst person to have ever lived, but Scott is the greatest best friend ever.</p>\n<p> </p>\n<p>A week later Derek falls through his window. Stiles should probably be mad about this, or scared, because Derek's nails are more like claws and his face has morphed into something barely recognizable. Instead he's rushing forward to the snarling, angry teenage werewolf and patting him down, \"Are you hurt? What's wrong?\"</p>\n<p>Derek doesn't answer, pulls him down so Stiles is lying on Derek's chest. He presses his face into Stiles's neck, and it feels funny shifted, his fangs scraping against his skin. It's weird, but Stiles whole life is weird, so he goes with it, stays right where he is and prays that Dad doesn't come to investigate what the thumping was. Eventually, Derek shifts back to human, but he doesn't let go, and Stiles is so, so confused, but he doesn't move, and falls asleep to counting Derek's heartbeat, eerily in sync with his own.</p>\n<p>He wakes up to Derek's phone vibrating. The older boy is fast asleep, and it seems like he needs it, with the way the skin under his eye are a deep enough shade of purple that it's almost comical. He only feels mildly guilty about answering his phone, because Derek did tumble through his window wolfed out. \"Hello?\" he asks, and his voice isn't enough to disturb Derek, because he doesn't even twitch.</p>\n<p>\"Stiles?\" Mrs. Hale says, and her voice is high and frantic, \"Is Derek with you? Where are you?\"</p>\n<p>\"Uh, yeah, he's with me, in my room. Um, did something happen? He was all wolfy when he came here.\"</p>\n<p>\"Are you hurt?\" she asks, and Stiles kind of loves Mrs. Hale forever.</p>\n<p>\"No, it's cool, I'm cool, he apparently, just wanted sniff and hug me? Which is like, really weird normally, but you know, werewolves. And Derek, Derek's pretty weird all by himself.\"</p>\n<p>She laughs, and he figures it's more in relief than that he's a comical genius. \"Can I speak with him?\"</p>\n<p>\"Uh,\" he glances down, \"he's kind of asleep? I could wake him up, but he looks like he could use the rest.\"</p>\n<p>\"He's sleeping?\" and there's definite relief and softness in her voice now.</p>\n<p>\"Yeah, like, peacefully and all. Well, he's on my floor, but besides that.\"</p>\n<p>There's some quiet on the other end of the line and Stiles shifts his weight until she says, \"I know this is a lot to ask, but do you or your father mind if he stays? It's just. He hasn't been sleeping well.\"</p>\n<p>\"I figured,\" he says, because he has exactly zero tact, \"but Derek's always welcome here, as far as I'm concerned, and the motto 'what my Dad doesn't know won't hurt' is fast becoming my favorite.\"</p>\n<p>Her laughs a little more strained this time, but she thanks him - again with this gratitude thing, he's a boy, he's going to get hives - before hanging up. Stiles sighs. He throws on pajamas and slides into bed, because Derek seems to think Stiles's  carpet makes up for a mattress, but he is wrong.</p>\n<p>Derek isn't there when he wakes up, but it only takes him thirty minutes of blinking himself awake to realized his bookshelf has been rearranged according to the Dewey Decimal System.</p>\n<p> </p>\n<p>Two days later, Mr. Hale's brother is climbing through his window. \"I have a door,\" he says, sounding more petulant than he'd intended.</p>\n<p>\"And a very convenient window. Or is that only access granted to my nephew?\" Peter bounces down next to him on his bed, and Stiles considers that for a moment before shaking his head.</p>\n<p>\"No, although my dad is going to start thinking you guys are really weird. Weirder. But I like you, and Cory is really nice. And less scary than Cora.\"</p>\n<p>Peter's face lightens at the mention of his daughter, and he says, \"She's quite fond of you - I've heard good things. She says you're very mature.\" Stiles flushes and looks at his knees, because Cory is a full year older, and that's really cool, that she said something like that to her dad. When he looks back up Peter's face has slipped into contemplation. \"She's a good judge of character - sometimes I think her human intuition is better than our werewolf senses, and she seems to think that you're tougher than you look. Considering what I've seen you do, I'm willing to believe the same.\"</p>\n<p>Stiles tenses, because this doesn't seem to be heading any where good. \"What am I going to need to be tough for?\"</p>\n<p>Peter ruffles his hair, \"Not tough, maybe, but mature. The whole house is an uproar about you, and what Derek did.\"</p>\n<p>\"That he came here? That's okay though! I like Derek. He's nice even though he's bad at it,\" Stiles frowns, because he doesn't think that came out right.</p>\n<p>The bed shakes with Peter's laughter, so he must understand,  \"Yes. Has Alan taught you about anchors yet?\"</p>\n<p>That seems a little random, but \"They're what keep werewolves human.\"</p>\n<p>Peter nods, \"For most werewolves, pack is their anchor. All the people you care about, and the feeling of belonging and love you feel for them.\" Stiles thinks that makes sense, but still isn't sure what that has to do with him. \"That was Derek's anchor - but it's not working so well, right now.\"</p>\n<p>\"Why?\" Stiles demands, \"Can you fix it?\"</p>\n<p>\"If only it was that simple,\" he murmurs, \"but - do you know who set our house on fire? She - she knew Derek, and it's not his fault, we all know that, but that kid is so -\" Peter bites of his words, \"He's stubborn, and he feels guilty, to the point where he can't use the pack as his anchor because he doesn't believe he <em>deserves</em> to, which is such -\" he growls.</p>\n<p>\"Bullshit?\" Stiles offers, because he's pretty sure that's what he wanted to say. Dad uses that word a lot when he forgets that Stiles is right there.</p>\n<p>\"Yes,\" he agrees, lips curved in a smile, \"but he can't help it, right now, and it's harming him to not have a stable anchor.\"</p>\n<p>\"That's not good,\" Stiles says, which he's aware is a huge understatement, \"but what does that have to do with me?\"</p>\n<p>Peter's shifts so he can curl his hands around Stiles' wrists and hold the boy's hands out and flat, \"You saved his life, draining most of your energy in the process of this - well, I'd say what you did was impossible if I didn't know you. That's hard to ignore, and if that's not enough, it turns out you're ridiculously brave and loyal on top of that.\"</p>\n<p>Stiles is blushing, because there's a lot of compliments in there. \"So now I'm Derek's anchor?\"</p>\n<p>\"You could be, which is what has the family in an uproar. I snuck away when there was more growling than talking.\"</p>\n<p>\"They don't like me?\" he asks, and his voice comes out small.</p>\n<p>Peter rolls his eyes and cuffs him on the back of the head, \"Quite the opposite. It's just that being someone's anchor - that's a lot of responsibility, a lot to put on one person. It's also dangerous for them, because if something were to happen to that person, or your relationship with them, then you're without an anchor. It's always safer to have your family as your anchor than one person.\"</p>\n<p>\"But Derek can't do that now, but he can use me,\" he says. This seems pretty simple to him, he doesn't get what the adults are freaking out about. \"That's okay. If something were to happen, that just puts him back to square one, and in the mean time he's safe.\"</p>\n<p>Peter keeps staring at him and Stiles is starting to wonder what he did wrong, when he asks, \"How old are you, Stiles?\"</p>\n<p>\"Ten. I'll be eleven soon,\" he's not sure if he sounds proud or defensive. Probably a bit of both.</p>\n<p>Peter shakes his head, \"You're going to grow up terrifying.\" Stiles doesn't say anything to that, mostly because calling an adult dumb seems rude. He's about as terrifying as Mr. Collins's fifteen year old Labrador the street over. Peter holds out his hand to shake, and that's odd, this whole family is odd, but does it anyway only to be pulled into a fierce hug. Again with the hugging, between Scott and Dad and the Hales he should just really give up.</p>\n<p>\"Good luck,\" Peter intones with a solemnity Stiles is ninety percent sure is fake by the way his eyes crinkle like he's smiling before vaulting himself out the window.</p>\n<p>Werewolves. <em>Hales</em>. Whatever. And he used to think he and Scott were weird.</p>\n<p> </p>\n<p>Deaton is still making him translate terrible things in Latin, which Stiles is starting to think is just wrong. He's ten - he's lucky he can read English! He'd tried pointing this out to Deaton, but the older man had just looked from him to his backpack, which was heavy with books too advanced for most fifth graders.</p>\n<p>Stiles scowls even as he tried to remember what conjugation this is. Lydia reads more than he does, and about things like how stars are born and how they die. He's still not all that smart in comparison.</p>\n<p>Deaton's doing something painful looking to the dog on the exam table while Stiles weighs the benefits of setting the whole place on fire in order to get out of this. Why can't they work on him moving stuff with his mind, he likes those training sessions.</p>\n<p>Thankfully for Deaton's office, Laura Hale in all her glory burst through the door and says, \"Are you really going to do it?\"</p>\n<p>Deaton and he share a look, and Stiles thinks he's getting to know the other man a little too well. \"Probably, knowing me. What are we talking about?\"</p>\n<p>\"Derek, we're talking about my baby brother, are you really okay with being his anchor?\"</p>\n<p>Deaton makes some sort of strangled noise that Stiles would love to make him repeat under different circumstances. See how he likes it. But he pointedly doesn't look at him while he nods and says, \"Yeah, sure. I like your brother. It's cool.\"</p>\n<p>Laura stares at him before leaving as quickly as she came.</p>\n<p>\"Hales are so weird,\" Stiles complain before going back to his Latin.</p>\n<p> </p>\n<p>Cory ruffles his hair next time she sees him, \"Dad said good things about you. Nice to know I was right.\"</p>\n<p>Stiles knows this is probably a little rude, but, \"Does it get exhausting?\"</p>\n<p>She blinks, \"What?\"</p>\n<p>\"Being the only normal Hale. Because I've met the other humans, Mark likes <em>white chocolate</em>. I know the weirdness is a Hale thing and not a werewolf thing, and you're like almost a fully functioning human being.\"</p>\n<p>She laughs, and it sounds like Peter's, \"I like you. You're my new favorite.\"</p>\n<p>He blanches, \"Oh my God, don't tell Cora.\"</p>\n<p>He's not too worried though. Everyone knows Mark is her favorite.</p>\n<p> </p>\n<p>It's three in the morning, according to the too bright, blinking numbers of his clock. At first he thinks the crash of thunder woke him up, but on second thought it might be the fifteen year old growling at the foot of his bed. He holds back a yawn, \"We have school in the morning, do I need to be awake for this? Cause otherwise you should like, lay down. Or take the floor, or-\" He's caught off by Derek climbing in and turning his back to Stiles, and Derek is <em>tall</em>, Stiles can be the big spoon with Scott, but Derek's a lot bigger than him. However if Stiles doesn't do something soon, he thinks Derek might end up bleeding in his bed, with how tightly he seems to be clenching his clawed hands.</p>\n<p>Stiles shuffles forward until he can rest his forehead against the center of Derek's back and tucks his knees against the older boy's. He's still holding himself too stiff, so Stiles snakes a hand over his chest to press a hand to his heart and breathes in and out like Dad had taught him when he had trouble breathing after mom died, waiting for Derek to match him, so their breaths and heartbeats match up.</p>\n<p>He thinks Derek's claws have retreated into nails, and his growling has settled into deep, even breaths that Stiles hopes means the older boy is asleep. Stiles still resolves to make fun of him for being so <em>weird</em> in the morning, but when he's woken by the too bright sun, Derek isn't there.</p>\n<p> </p>\n<p>\"Liking white chocolate isn't weird.\"</p>\n<p>Stiles throws up his hand, and the pen flies across the room to smack Deaton in the side of the head. That hadn't been his intention, but it's still hilarious. \"Is nothing sacred?\" he asks him, \"First Laura, now Mark. If Cora starts showing up, we're lining the place in mountain ash.\"</p>\n<p>Deaton rolls his eyes before going back to his paperwork - which is in <em>English</em> - while Mark smirks. Stiles scowls, off balance, because Mark is the eldest Hale child, almost done with college and like a fully fledged adult. Derek and Laura are at least still in high school. \"It wouldn't matter - I'm human, it wouldn't work.\"</p>\n<p>\"I'd make it work,\" he mutters, and Deaton twitches a little, like he actually could, which - huh, cool, he's exploring that later. Anything is better than Latin.</p>\n<p>Mark sets down a styrofoam cup down at his elbow, and if that's white hot chocolate, Stiles's appreciation of irony will be won out over the cruelty. \"I heard Derek came by last night - sorry, if he uh, well that he, just. Sorry.\"</p>\n<p>Mark is starting to look as awkward as Stiles feels, which, Mark's an adult, they can't do that. He takes a sip of his thankfully normal hot chocolate before saying, \"You and Laura don't have to keep apologizing for him. Or bribing me to like him, or whatever it is you two are doing when you drop by here. I like him already - it'd be nice if he talked to me, ever, but he's doing fine.\" That last part came out more defensive than not, and he take another long sip to hide the frown in the corners of his mouth.</p>\n<p>Mark doesn't hug him, really, but he does stand obnoxiously close and ruffle his hair before leaving.</p>\n<p>\"Hales,\" Stiles mutter before bending back over his Latin.  </p>\n<p>Deaton snorts.</p>\n<p> </p>\n<p>\"Come in,\" he says absently, squinting at the words that aren't in Latin, but he thinks it might be easier if they were.</p>\n<p>Dad clears his throat, \"You have a visitor.\"</p>\n<p>\"Scott?\" he tears his eyes away, and beams when he sees the person at Dad's side, \"Derek! You okay?\"</p>\n<p>Derek clears his throat, \"Yeah. I'm just...\" he trails off. Dad raises an eyebrow, and Stiles shrugs.</p>\n<p>\"Yeah,\" he agrees, \"Hey, have you read Midsummer's Night Dream? Because this is written in like, Greek.\" Which, according to Deaton, he'll be learning once he masters Latin.</p>\n<p>Derek's eyebrow mirrors Dad's, \"Isn't that a little advanced for you?\"</p>\n<p>Stiles glares.</p>\n<p>The older boy laughs, quick and soft, but it still makes a grin stretch over Stiles's face. \"Let me see,\" he sits by Stiles and takes the book from his hands, eyes scanning the page and he's explaining Shakespeare in something approaching English when Dad closes the door and leaves them to it.</p>\n<p> </p>\n<p></p>\n<p>~</p>\n<p> </p>\n<p>When the Hale house is completely rebuilt a good year and a half later, Derek shows up through his window and shoves a key in his chest. \"Thanks?\" he says, holding it up with a raised eyebrow. \"What's it for?\"</p>\n<p>Derek looks at him like he's an idiot, which Stiles long ago figured out to take as affection, \"It's to the house.\"</p>\n<p>\"The house?\" Stiles repeats, \"Wow, like your house? Are you sure I'm supposed to have it?\"</p>\n<p>He rolls his eyes, \"Mom made it for you. You're supposed to have it.\"</p>\n<p>Stiles bites his lip, runs a fingernail over the metal's jagged edges, \"I could get into your house if I needed to, you know. I can open a lock, and all the wards you have were made by either me or Alan, and I'm stronger than he is anyway.\"</p>\n<p>Derek's sitting on his desk, and he rolls his eyes so hard that it's lucky werewolves don't have to worry about eyestrain. He pushes Stiles chair with his foot so he roles a few inches away, \"Maybe we just want you there, dumb ass.\"</p>\n<p>He looks down, spends too much time cataloguing the glints of light off the key, and says without looking up, \"I never lock my window.\"</p>\n<p>Derek ruffles his hair before he leaves, and Stiles grins long enough that his face begins to hurt.</p>\n<p> </p>\n<p>Cory and Peter are grinning, and Stiles is stupidly grateful that for whatever reason the rest of the family agreed to let them be the ones to do this, because they're probably the only two Hales who he can cry in front of without someone offering to kill someone else for him.</p>\n<p>\"You like it? Derek picked out the colors.\" Cory settles an arm over his shoulders, and he nods jerkily, because if he tries to talk, he's probably going to sob. He's almost thirteen, and he's <em>not</em> going to cry over this.</p>\n<p>It's a room. It's not very big, and most of is taken up by mostly empty bookshelves and a huge desk, with a twin bed stuck in the corner. It's his, between Derek and the Pete's, and the key was one thing, but this - it's - it's -</p>\n<p>Peter pulls him in, and then he's being crushed between Cory and her dad, trying not to sob, because every once in a while it nearly leaves him breathless, how much he loves and is loved by this family he stumbled upon.</p>\n<p> </p>\n<p>When Scott snaps at him, \"Dude, I got over most of your weirdness years ago, but this is a new level of what the hell,\" Stiles stares at him in true bafflement, because they're in the middle of study hall and he thinks Lydia's giving them dirty looks. Scott scowls for another two seconds before all of his irritation bleeds out of him with a sigh. \"You have no idea what I'm talking about, do you?\"</p>\n<p>Stiles grins and shrugs before breaking his Snickers in half and offering it to his best friend as a peace offering.</p>\n<p>\"You've been freaking out over the new teacher,\" Scott attempts to stuff most of the candy in mouth at once.</p>\n<p>Stiles glances over at their new study hall teacher, a little grey around the edges and round around the middle, but nothing that sets off his spidey senses. \"I have?\"</p>\n<p>\"Dude, whenever he gets up to walk around, you scoot away from whatever direction he's in, and you keep glaring at him, with like this really creepy expression on your face,\" Scott pauses, waiting for a reaction beyond blank surprise and groaning when none is forthcoming, \"Seriously?\"</p>\n<p>Stiles shrugs and forks over the rest of his candy bar, \"Thanks, man.\" Scott rolls his eyes before shoving his math homework under Stile's nose and demanding he explain the Pythagorean theorem in words he can understand.</p>\n<p>Scott tolerates about thirty seconds of Stiles speaking in Greek before he attempts to brain him with his notebook.</p>\n<p> </p>\n<p>His dad is working late and Deaton's out of town, so he's piling green beans on his dinner plate at the Hale's when he asks, \"Do you know of anything that could hide itself from a mage?\"</p>\n<p>Derek stiffens beside him, but the rest of the family doesn't react beyond Peter shrugging and saying, \"Many things, but most only to those without great power.\"</p>\n<p>\"Oh,\" great power is frequently used to describe his abilities by Alan, although unfortunately it's often followed up with the phrase 'great responsibility'. \"What about one like me?\"</p>\n<p>The younger Hales don't give him much attention, but he's got a good half dozen pairs of eyes locked on to him now. Derek groans and drops his head into his hands. Stiles elbows him.</p>\n<p>\"Why?\" Laura asks, looking like she's going to regret it but wanting to know anyway.</p>\n<p>\"Nothing!\" he insists. No one seems convinced, so he sighs and admits, \"Probably nothing. Scott told me I keep reacting to a new teacher like he smells like old cheese, but maybe it'll turn out to be because he really subtly smells of old cheese.\"</p>\n<p>\"Who?\" Cora demands.</p>\n<p>\"Mr. Greyson?\" he offers, \"He covers study hall, and like, geography, or something.\"</p>\n<p>Cora's face is blank and she shrugs, \"Doesn't ring a bell, but I haven't noticed anything weird.\"</p>\n<p>Stiles nods eagerly, \"See, complete overreaction, I'm sure everything's fine.\"</p>\n<p>Peter and Cory are sharing shady glances, and he hates that more than anything, and judging by the constipated look on Derek's face, he does too. When those two start acting like they know more than everyone else, it's usually because they do, and it's almost never good.</p>\n<p>Mr. and Mrs. Hale are starting to look concerned too, so Stiles dumps a huge helping of green beans on Derek's plate just to see him scowl and says overly brightly, \"Laura, dear sweet Laura, how's college? NYU everything you'd hoped for?\"</p>\n<p> </p>\n<p>He promised his dad he was going straight home after Deaton's, where Alan just shoves some books at him and tells him to try to figure it out, already halfway through his own tome and lips chapped from where Stiles is sure he's been biting them all day.</p>\n<p>They've dealt with some weird things. He's had to aid in a spell or two, and pretty much every potion and ward in Beacon Hills is his handy work. However this - this is new, this isn't the first dead body, but it's still a first in context.</p>\n<p>His promise to his dad doesn't mean much when Derek, Laura, and Mark pull up in the eldest brother's Camaro as soon as he walks outside. He blinks, \"Were you waiting for me? Because that's a little creepy, it's not like the mountain ash would have kept you out.\"</p>\n<p>\"It would have kept me out,\" Mark grumbles, because he's still not over that, and his siblings think it's hilarious. Mountain ash is Stiles's <em>bitch</em>.</p>\n<p>\"Whatever, it's not like you people even know what boundaries are,\" he thinks his point is excellently well demonstrated as soon as he slides into the backseat and has Derek plastered against his side, the seventeen year old pressing his face to Stiles's neck and taking two long breaths before giving him his space.</p>\n<p>\"We heard about Mr. Greyson,\" he growls, hand still clamped uncomfortably tight on Stiles's shoulder, but he knows better than to complain.</p>\n<p>Stiles winces, \"Yeah, so, how? Because I was going to tell you, and I haven't, obviously, so?\"</p>\n<p>\"Peter was in the Peace Corps in Africa for two years,\" and Stiles is relieved to note they're heading toward the Hale House and they're not just giving him a lift home.</p>\n<p>He snorts, \"Like, Peter Peter? The same guy who refuses to drink white wine and complains when his sweaters aren't cashmere and once pouted for a whole hour because Cory said she didn't know what Burberry was, nor did she care?\"</p>\n<p>Laura and Mark are smirking, he can't see it but he knows. \"Yeah,\" she says, \"the coroner called him down to ask if he'd seen anything like it, like maybe he thought it was some sort of parasite he'd never seen before?\"</p>\n<p>\"He? Good, you're not talking about Sharon, because she's wonderful and smart and not dumb enough to think that a parasite managed to make all of this guy's internal organs rot for three weeks.\" Derek's back to growling again, and Stiles bares his neck to shut him up, because he is surrounded by overprotective people.</p>\n<p> \"Sharon's on maternity leave - the guy covering for her has yet to reach the point of frustration where he throws ups his hands, calls your dad, and is done with it.\"</p>\n<p>\"That's unfortunate,\"  his neck is starting to ache, but Derek's pressing his nose there and scent marking him like he doesn't already constantly reek of PROPERTY OF HALE, \"but my dad got a copy of the report anyway, since his death was suspicious, so it works out.\"</p>\n<p>They've arrived, and Stiles herds Derek out of the car with a minimum of hair pulling. \"Not that you guys aren't my favoritest ever, because you are, but why am I here?\"</p>\n<p>\"Because you said something felt off, and now people are dying in ways not even Mom and Dad have seen before - so now you get to try to articulate your weird mage senses into something more specific than 'kinda smells like old cheese'.\"</p>\n<p>Stiles pouts, but still tucks himself closer to Derek on principal.</p>\n<p> </p>\n<p>He's throwing himself over Scott before he even properly understands what's going on, feels something tearing through his skin before he has a chance to wrangle his magic into something useful, throwing off Deputy Johnson - whom Stiles has known his whole life, who babysat him before he had a whole family of werewolves at his back, who squeezed his shoulder tight when Mom died but didn't offer any platitudes - and Stiles is bleeding, can feel the warmth of it dripping down his arm as the man snarls and charges forward, which shouldn't be possible because he put enough force into it that he feels it in his bones.</p>\n<p>Scott's screaming, which is good because he isn't, is dragging up more power to push the deputy back and away, this time hard enough that his neck cracks and twists at an angle that should mean it's broken, but instead he's getting up again, eyes glowing red. There's another sharp pain as he realizes Scott's pressing down on his wound as he sobs, and - and - and this is his fight, things with eyes glowing red, werewolves or not, are his responsibility, and no one he loves is ever dying because of him again.</p>\n<p>So this time it's him snarling even as he hears feet pounding down the hallway, hopefully his dad and the force, and he pushes with something more than the last two times, treats his magic like it's mountain ash and twists it until he makes into something he hopes will be useful.</p>\n<p>Johnson's face flinches in pain for the first time, but it smoothes out fast enough that Stiles maybe wants to throw up a little. \"Not bad,\" he says, and it sounds nothing like the man Stiles knows, \"but I wouldn't get your hopes up. And we thought you'd be dangerous.\"</p>\n<p>Dad is rounding the corner as Johnson crumples to the floor, and Stiles panics when he looks down, because Scott is covered in blood, but then he realizes it's his own blood. That probably shouldn't be as much of a relief as it is, because Scott is still crying and Dad looks like he want to murder someone.</p>\n<p>\"I'm okay,\" he says, because the magical exhaustion is actually more of a bummer than the bullet hole in his arm. \"I'm fine, Scott's fine, you're fine right? All good here Dad.\" There are a half dozen deputies behind him, and he can't tell if they're more horrified by the words coming out of his mouth or Johnson's body.</p>\n<p>Dad's putting pressure to stop the flow of blood and Scott has switched sides so he can clutch at Stiles's arm and press his face into his shoulder. Stiles meets Dad's eyes, and makes a motion with his mouth that he hopes is more smile than grimace, \"At least it wasn't a burning building this time?\"</p>\n<p>His dad's sigh isn't anything close to a laugh, but his eyes look a little looser around the edges so Stiles still counts it a win.</p>\n<p> </p>\n<p>It was a graze, not a really bullet wound, and Stiles get a sling and some pain medications with strict instructions to not get hurt again anytime soon.</p>\n<p>Scott refuses to go home. He flat out looks his mom in the face and says, \"I'm not leaving Stiles,\" with his best friend's blood still crusted under his fingernails, and Stiles is really bad at making friends, he knows this, but he can't help but think he got really lucky with the ones he does have.</p>\n<p>Stiles beams and snags Scott's hand in his good one, asking, \"Sleepover? It's not a school night.\" Scott nods vigorously at their parents.</p>\n<p>Ms. McCall sighs, and shrugs at Dad who rolls his eyes, \"I suppose.\"</p>\n<p>Stiles and Scott high five, and even if it's awkward using his left hand, the relief that it brings out on his dad's face makes it worth it.</p>\n<p> </p>\n<p>That night snug under Stiles's sheets Scott says it's time Stiles told him the truth, that what happened wasn't an insane deputy, that no matter what Dr. Evens says, his mom says rabies don't do to people what happened to Deputy Johnson.</p>\n<p>\"I can't tell you everything,\" he whispers in the cover of night, \"it's not my secret.\" Scott's mouth pulls down at the corners, but before his pout can form into a full scowl Stiles twitches his nose like on that old black and white show his dad likes and pulls something in his chest forward and settles it between them. He's tired, but this is easy, easier still when he thinks of Scott, his best friend, and how he's loyal and brilliant, and when faced with fire and blood his first concern is Stiles. It settles like a ball between them, light, like a giant firefly but more golden. When Scott passes his hand through it and giggles, he knows his friends feels warmth like pie crust straight from the oven and static dancing across his fingers, \"I'm magic.\"</p>\n<p>There's more after that, but he doesn't mention werewolves or Deaton or the Hales, and Scott can pick up that there are huge parts he's leaving out, but the ball of light and warmth remains settled between his hands so he seems content to listen Stiles speak of impossible things until they fall asleep between one word in the next.</p>\n<p> </p>\n<p>Stiles opens his eyes the next morning to the same ball of light fluttering by his head and his Dad twisting the door knob. He grabs the ball from the air and tosses it under his bed, hoping that it's rolled far enough out of sight that Dad won't notice. He's half out of bed blinking blearily when his dad laughs and says, \"I genuinely do not know how they found out.\"</p>\n<p>\"Hales?\" he yawns, pulling himself into something approaching upright. Scott whimpers in his sleep, and Stiles shoves his pillow into his arms, since he doesn't have Stiles to clutch to him anymore. \"At least they waited until morning.\" He's genuinely impressed that he didn't wake up to Derek curled up at the end of his bed like the huge puppy he is.</p>\n<p>\"Stiles, it's <em>six thirty</em> in the morning. It's barely daybreak. I'm going back to bed.\"</p>\n<p>He bangs his head against his wall a few times before going downstairs, still in Batman pajama bottoms and a t-shirt he's almost positive is Derek's. As soon as he steps into the kitchen he's surrounded by Hales, Cory and Cora ducking under his arms even though they're both taller than him, and Mark and Laura squishing them all in one big hug. Stiles laughs and squeezes back, even though it makes his arm throb.</p>\n<p>\"You're so stupid!\" Cora scolds, kissing him on the cheek.</p>\n<p>\"If you're going to get attacked by a magical creature, can't you at least get magically hurt?\" Cory continues, \"You can at least heal those.\"</p>\n<p>\"Guys,\" he whines, and Laura's peppering his face with kisses like the most annoying big sister he never wanted, but got stuck with anyway. \"Ew, gross, Mark, help!\"</p>\n<p>\"All right everyone, back it up, let him breathe,\" he rubs Stiles's head like a half hearted noogie, but the girls do back off, so he's not going to complain much. He finally gets a look at Derek though, and he forgets to breathe for a moment.</p>\n<p>\"Oh,\" he says, moving past the suddenly subdued family to him. He pauses in front of Derek, who's holding himself too still and too stiff with his eyes stuck to the ground. Stiles reaches for his clenched hands first, wrapping his hands around them until Derek breathes out harshly and unfurls his hands. Stiles wants to follow the path up his arms to clutch his shoulders, but he already knows his arm won't take it. So instead he places one of Derek's hands on his chest and presses his own to Derek's, feels the synchronous beating of their hearts and stares at Derek until he tilts his head up enough to meet his eyes.</p>\n<p>He steps a bit closer, runs his thumb around Stiles's jaw line, because it's never enough for him to smell like Hale, he has to smell like Derek. \"You scared me,\" he admits, and Derek hates words and emotions and using the former to express the latter is huge.</p>\n<p>\"I'm sorry,\" he says, earnest, \"I didn't mean to.\"</p>\n<p>\"You never do,\" he sighs, and before Stiles can get offended he's wrapping his free hand around his bandage and leeching the dull flares of pain out of him. He groans, dropping his body against Derek's and letting the older boy support his weight. Derek's hand moves from his heart to around his waist.</p>\n<p>Once he's pleasantly high off of werewolf endorphins he says, \"Is this a good time to tell everyone that Scott knows about magic and that whatever's going on not only has eyes that glow red, but has heard of me?\"</p>\n<p>Derek clutches him to the point of discomfort, Mark swears, and Laura says, \"We should really talk to Mom and Dad.\"</p>\n<p>\"On the other hand, Dad owes me five bucks,\" Cory offers and this is why Stiles loved them both, it so is.</p>\n<p> </p>\n<p>\"Demons,\" Stiles repeats blankly, because no, absolutely not, he is qualified to deal with so much shit, but this is not it.</p>\n<p>\"Yes,\" and Stiles has only met their grandfather once, for about a second two years ago when he threw himself into a burning building, but he's almost positive he's seeing what Derek will look like in fifty years, although minus the scars because werewolves don't get those, \"but not exactly. You're sure his eyes were red?\"</p>\n<p>Stiles raises an eyebrow.</p>\n<p>Talia and Kevin sigh in unison, which is impressive, but Grampa Paul seems more amused by him than anything. Also very Derek like. \"That means they're not just demons - they're the first demons, almost as old as the Earth herself, and that's ...\"</p>\n<p>\"Not good?\" he offers, voice faint, because demons are terrifying, but he can chant Latin in his sleep, as long as they don't kill him before he can get out an exorcism then they're fine. But these things are older than Latin, and no pretty words are sending them back to hell.</p>\n<p>He knows they don't understand, the others, although by the way Cory and Peter are clutching at each other they might, but this is beyond bad, worse than any story he's read in Alan's dusty old books.</p>\n<p>He doesn't know how they're going to survive this, doesn't even know if they can, and he's not a crier, he and Dad have that in common, but now he's thinking of Dad and Scott and the Hales, all of them, and he can feel his chest hitching because he can't protect them. His magic, so supposedly powerful, isn't going to do anything against evil like this, nothing is, and they might actually all die.</p>\n<p>He doesn't know he's sobbing until he's being pressed to Derek's chest, knows he smells like fear and grief, which is probably freaking them all out, but he can't explain it, so he just pushes himself impossibly closer to the person who he loves as much as Scott and his Dad and prays to a god he doesn't believe in that they're going to survive this.</p>\n<p> </p>\n<p>Three more bodies, used and abused by demons, show up over the next two weeks. Dad's face has gone weary with frustration and fear. Stiles almost wants to tell him to let it go, but the truth isn't going to save anyone.</p>\n<p>He and Scott get picked up and dropped off by Derek, Cory, and Cora every day, and more often than not they drive  back to the Hale house where everyone is too quite. One night he finds Peter leaning against the wall outside of Cory's door, head tipped back. He sits down beside him, and shuffles under the arm Peter lifts for him so he can curl against the older man. He can't hear her heartbeat and breaths like her dad can, but he can feel her with his magic when she's this close, burning differently than the werewolves, but just as bright.</p>\n<p>When he shows up at Alan's, he's given literature on demons to read until his eyes bleed, and his teacher hugs him before he leaves, every time, as if he might not see him again.</p>\n<p>They can't fight back against this force in their town, and laying low and hoping they get bored and leave seems like a terrible plan, but it's the only one they have.</p>\n<p> </p>\n<p>It is a terrible plan, because it doesn't work.</p>\n<p>Stiles and Scott are at the Hale House, working steadily through homework that's easier to concentrate on than the nearly dozen dead bodies showing up scattered through the town, when Talia gets the call. She freezes, and all the werewolves do the same, the voice on the other end as clear to them as if they were holding the phone themselves. Mark and Stiles share a frustrated glance while Scott leans against him.</p>\n<p>Talia nods once, says, \"We're on our way,\" and hangs up. As soon as she does, there's an outbreak of yelling but Kevin silences them with a glare.</p>\n<p>\"Laura, you're with us. Derek, Mark, you stay here, take care of the kids,\" he says and they both nod jerkily, even though Mark has no idea what he's agreeing to and normally Derek would be throwing a fit over Laura being allowed to do something he isn't, but he's silent now. Between one blink in the next they're gone, and Stiles turns to Derek, eyes wide. He opens his mouth to answer Stiles's silent demand, but nothing comes out.</p>\n<p>It's Cora who answers, the book she'd been reading to four year old Pete having fallen to the floor, \"That was Uncle Peter. They have Cory.\"</p>\n<p>Mark makes a sound like someone's shot him, and he's already halfway to the door by the time Derek's wrapping an arm around his waist, still gangly and growing into his too long limbs but werewolf strong and able to hold his elder brother still. \"Derek, let me go.\"</p>\n<p>\"So you can get yourself killed? No.\" Derek's almost hugging him now, and the way his voice cracks makes Stiles heart ache.</p>\n<p>\"Well, if anyone's going anywhere, it's me,\" he says, standing, and Scott's trying to pull him back down even as Derek twist and snarls. \"Don't. None of them stand a chance - werewolves are nothing to them. I'm the only one who might be able to do something.\"</p>\n<p>\"You couldn't stop him last time,\" Scott insists, \"and there's going to be more of them this time. No, no way, you've already almost died on me twice. No.\"</p>\n<p>\"It left, last time,\" he points out, but he's not fighting against Scott's grip.</p>\n<p>Cora shakes her head, \"It left because the body was broken and useless, not because you forced it out.\"</p>\n<p>\"So I'll break the bodies again,\" he insists, even though just saying the words makes something twist in his gut.</p>\n<p>\"Werewolves are better at that,\" Derek says, pleading at Mark and Stiles both, \"Come on, it'll be fine.\"</p>\n<p>Stiles doesn't need to be a werewolf to know Derek doesn't believe what he's saying, and Mark tugs against his brother's iron grip fruitlessly. \"Derek, it's <em>Cory</em>,\" he repeats, like he doesn't know, and Stiles aches for a new reason.</p>\n<p>There are nine years separating Cory and Mark, but he's closer to her than any of his siblings, and Stiles knows it's because they're the only humans in pack of wolves. It wouldn't be so bad if Kevin and Talia weren't both werewolves, but Mark being born a human surprised everyone, and he's the only one. Stiles is abstractly grateful that at least he's the oldest, although he seems to have middle child syndrome almost as bad as Derek, because his perfect grades and straight As from Columbia seems to be his own version of proving he's just as good as the wolves he's grown up with.</p>\n<p>Cory's mom was a human, and Peter's a beta. Her humanity was almost expected, and she feels the separation just as sharply, but she has Mark. She has Mark to look up to and love and it's not that she doesn't love the rest of them fiercely, but Mark's her favorite, and Stiles is pretty sure that's part of the reason that she likes him so much, he's another human that runs with wolves.</p>\n<p>\"She's tough,\" Stiles offers, and it falls empty, because being tough means nothing when a demon takes your body for a joyride.</p>\n<p>Mark sighs, turning in his brother's hold. \"Derek, please. I can't leave her.\"</p>\n<p>Cory told Stiles a story once, one that her dad had told her. She'd been presented to the rest of the Hales after her birth, and they'd all cooed over her, but it had taken fifteen minutes for Mark to realize the squalling little bundle in Uncle Peter's arms was human, because all the others had known by smell. He'd been hanging back, because he's already dealt with two crying babies, he knew the drill.</p>\n<p>Then someone had made a comment, and he was pushing forward, shoving Laura out of the way to stare at the baby girl, demanding, \"She's like me?\" Peter had nodded, offered the baby to the nine year old, and that was it, that was all she wrote. Mark had refused to give her back for the next hour, and spent it staring at her and beaming, because he wasn't alone anymore.</p>\n<p>And now he might be, now the baby he'd claimed as his own was out there, and very likely wasn't coming back.</p>\n<p>\"Derek,\" Stiles says, soft, \"if it was me, what would you do?\"</p>\n<p>Derek's face closes off, even as his grip on his brother becomes tight enough that he's probably going to leave bruises. If it were Stiles, Derek would be there, he'd be fighting anyone and anything that got in his way, because even if Stiles was going to die, there is no way Derek would let him die alone.</p>\n<p>\"It might end up being you, actually,\" and all that tension is broken as Stiles is hurrying forward, Scott's grasp having gone limp.</p>\n<p>\"Alan!\" he's leaning against the doorframe, clutching his bleeding side. Stiles can feel the bitter strings of magic clinging to it, and he's so relieved, reaching out his hands to heal.</p>\n<p>\"No!\" Alan tries to step back, but just ends up more slumped against the doorframe, \"Don't, it'll keep, save your energy. You're going to need it.\"</p>\n<p>\"No, he's not,\" Derek growls, \"because he's not going anywhere.\"</p>\n<p>\"They're going to die,\" Alan says, face pinched in pain, \"They're all going to die, and Stiles is our last chance.\"</p>\n<p>Stiles should feel smug at this declaration, instead he just feels nauseous, but he squares his shoulders and summons a grin, \"You heard the man. Let's go.\"</p>\n<p>Derek growls, looking between him and Mark, and Stiles can tell victory by the slope of his shoulders, but it still feels like defeat, because he'd do almost anything to keep that look from Derek's face. Derek sighs, let's go of Mark to point a finger at Cora, says, \"Watch Pete, and try to keep Dr. Deaton alive.\"</p>\n<p>She nods, running a hand through Pete's hair.</p>\n<p>Scott stands beside him, and Stiles opens his mouth to tell him no way in hell is his squishy human best friend going toe to toe with demons, but Scott's slapping a hand over his mouth and shaking his head. \"I don't want you anywhere near this, but if you're going, then I'm coming with you.\"</p>\n<p>Stiles wants to argue, he does, he could have Cora hold Scott down no problem, but instead he claps him on the shoulder, nods once, and leads the way out the door, bumping against Derek on the way by.</p>\n<p>\"All right then. Come on everyone, we have a pack to save.\"</p>\n<p>Derek can smell he's terrified, but he rolls his eyes and flicks him in the back of the head instead of calling him out on it, because Stiles doesn't call him out on it either.</p>\n<p> </p>\n<p>There are three of them, and Stiles prays Scott and Mark stay in the car until this is over, because no one here is going to survive.</p>\n<p>Stiles recognizes the other two, vaguely, knows if he had more time to concentrate he could probably put names to faces, but instead he's clutching Derek's arm and wondering what the fuck it is that Deaton expects him to do.</p>\n<p>Kevin and Talia have a demon each, while Laura and Peter are circling Cory, but Peter's switching between defending himself against the demon and snarling at Laura whenever she does anything close to offensive.</p>\n<p>\"What do we do?\" he whispers, because while Cory remains mostly untouched, the other two are spilling internal organs on the floor, and it doesn't seem to be slowing them down any, although he winces when Kevin slips on spleen.</p>\n<p>Derek's face is pale, \"I'm going to help Dad, and you should really, really leave.\"</p>\n<p>Stiles doesn't even address that, just grips Derek's arm all the tighter and thinks that if by some miracle they survive this, he's inking protection wards into Derek. Instead he sends out a thin layer of them over his skin, and it probably won't do the older boy any good past the second hit, but it's <em>something</em>.</p>\n<p>It's probably more than he should have risked though, because the demon Kevin had been attacking sniffs the air and turns, heading straight for them. Kevin gets in the way, manages to rip open his rib cage and tear out a lung, but the demon doesn't do more than snarl and toss the werewolf aside like a misbehaving pup. Derek's already pushing Stiles behind him, claws and fangs out, but - no, nope, nopenopenope.</p>\n<p>No one is going to die for him, least of all Derek.</p>\n<p>His telekinesis isn't his strongest, but it's more than enough to shove Derek aside, and then the angry, evil demon is wrapping it's hands around his throat, and it's not just breath he's cutting off, but his magic too, draining it out of Stiles's body. He didn't know that was possible and it hurts, not in a physical way, but deep down, the equivalent to someone sucking the marrow from his bones while they're still inside his body. Derek throws himself at the demon, but he's tossed back so quickly he barely makes contact. Stiles meets its eyes and - and he sees the greed  there, but something else, something in the way that it's hands shake against his throat makes him - if he's going to die, he's doing it with a bang, and there's a good possibility he might be able to take the demon with him. So he relaxes, tries to fight down the rising panic from lack of oxygen, and lets his magic wash over the demon, tries to feel where it's concentrated, and if he had enough breath to laugh he would, because this fucking thing is in the man's heart.</p>\n<p>He digs deep, deeper than his marrow, to the power that's threaded into his DNA, and lunges just enough to grasp a hand around this nameless man's rotting heart and pushes everything into it, pushes all the raw power he has, pushes his mother's smile, his father's patience, Scott's stubborn loyalty, the Hale's love, and Derek, and his horrible way with words, his snarls and his anger and his worry and his love, and dedication. He pushes himself into this man, can almost feel his soul leaving his body as he shoves it at this demon, and prays he's as strong willed as his father's always told him.</p>\n<p>He is, he really is, because the demon's eye shine white before he's screaming, being pushed out of this body, but it's not enough, because Stiles wants him out, out of everything, and he sends him as far away as he can, thinks of how the Latin feels curled around his tongue, because he thinks it'll work now, and sends a demon older than he can comprehend back to the depths of hell.</p>\n<p>Kevin's holding him up, Derek knocked out on the floor, and he can't breathe again until his soul is back in his chest, but then he's gasping, coughing. \"Heart,\" he says, raw, \"open it's chest, I need the heart.\"</p>\n<p>He knows Talia hears him by the way her attack changes, doing anything to rip the thing's torso open, and Kevin tips him against the wall before joining her, because maybe the thing was playing with them before, or it's desperate, but no way Talia's going to survive that thing on her own. He's already stumbling forward when Kevin claws its skin away in ribbons and Talia cracks the ribs open like a stubborn egg. Stiles can feel the thing trying to escape, and he pitches himself forward so he can wrap another fist around a rotting heart and it's harder this time, to force his soul into this body when he isn't being pulled, wills himself into a place where he can chant Latin loud inside his own head and send this thing far enough away that no one he loves is going to get hurt. Kevin's holding him up again, and Stiles has to take a couple deep breathes before he can bring himself to open his eyes, because his skin feels too tight and stiff for a few moments, like his soul had resettled at the wrong angle. Talia comes up at his other side, helps him get over to Cory, Peter and Laura, because he's bleeding and limping.</p>\n<p>\"What are you going to do, little mage?\" the thing wearing his friend's face taunts, \"Going to rip open her chest, push me back to hell with my siblings and kill her in the process?\"</p>\n<p>Peter snarls, and Stiles doesn't know if it's at him or the demon.</p>\n<p>\"I'm really sorry,\" he says, because even if this works Cory might just kill him on principal, and he throws himself forward. He's not aiming for her heart though, so the way she twists her body doesn't matter much, since it's still facing him head on and his lips meet hers with a painful clack of teeth and he puts his hand on the back of her head, holding her still while he forces her mouth open with his tongue, kissing her like in the movies he's not old enough to watch. He can't force himself in without touching the heart, isn't strong enough for that right now, but he thinks he can force it out and inside him, pulls and tugs at the dark, evil thing that's settled in Cory's chest until it's flowing into his, sliding along his soul and wrapping itself around his heart. He gasps, lets go and staggers back while Cory crumples to the ground. He hears Peter roaring the background, but he can't focus on that right now, can only focus on the way the thing is beating against his ribs like a battering ram, trying to fight its way out, but Stiles doesn't let it, feels it unraveling around the edges the longer he keeps it inside him, until there's a burning along his side and a scream in his chest that isn't his and a demon almost as old as earth itself dies inside of him this day.</p>\n<p>He falls to his knees and coughs up ash, all that's left of it, and when he stops Scott is at his side, eyes wide, with hands hovering over skin that's mostly burned and a shirt mostly gone. He looks up to see Kevin, Talia, and Laura doing their best to keep Peter contained, and Stiles thinks that he sees a flash of silver in Peter's electric blue eyes, and fuck, he's going feral, why why why.</p>\n<p>Then he looks down a little, and he knows why, in the way Mark is clutching Cory to him and sobbing.</p>\n<p>\"She's not breathing,\" Scott whispers beside him, as if that pronouncement could be anything less than deafening.</p>\n<p>\"Please,\" Mark looks up at him, eyes red and snot smeared across his upper lip, \"heal her, please, heal her.\"</p>\n<p>He crawls forward with Scott's help, ash still clinging to his lips, and let's his hands hover over her unmoving body. \"I don't know if I can,\" he says, words thick, \"this isn't - it's not -\"</p>\n<p>\"You saved Derek,\" he insists, laying Cory down and closer to Stiles.</p>\n<p>\"That was wolfsbane,\" he says, and not that he wasn't already dead.</p>\n<p>\"Try,\" Mark demands, and Stiles barely has the strength to breathe, why does he think he can do this.</p>\n<p>Hands settle over his shoulders, and Stiles twists to see Derek, his head wound tacky with blood and almost all healed. Derek presses a soft, firm kiss to his forehead, repeats \"Try\" against his skin and Stiles takes a deep breath and nods, draws strength from the grip Derek maintains on his shoulders.</p>\n<p>He lays his hands against Cory's neck and is relieved to find the skin still warm. He presses there, sweeps his magic though her body and almost weeps in relief when he find the darkness clutching to her heart and lungs, because it's magic, he can fix that. He takes a deep breath before pushing a different flavor of magic through her body, sweeping the last traces of the demon out and into the Earth.</p>\n<p> He collapses back into Derek's hands and Cory takes a breath deep enough to be a gasp, eyes open when she sputters, \"You're a shitty kisser.\"</p>\n<p>Stiles blushes, but he's grinning too. Mark has almost a full minute to clutch Cory to him before Peter's pulling Cory into his own arms, features melted back into human by the time she's settled. \"She's your anchor, not the pack,\" Stiles says, fighting off the desire to pass out. He's cradled against Derek's chest in between the V of his legs, the older boy's arms tight against his torso.</p>\n<p>Peter meets his eyes, \"Yes.\"</p>\n<p>\"That's dangerous,\" he continues, and he doesn't think he needs to elaborate on why.</p>\n<p>Cory hums agreement, but for the most part seems content to be crushed to her father's chest, who shrugs and answers, \"I don't much care to be in any world without my daughter.\"</p>\n<p>Stiles doesn't argue, but does tip his head back against Derek's shoulder to murmur, \"It's dangerous for you too.\"</p>\n<p>Derek drags his nose up against Stile's throat and wraps Scott into the embrace when he pushes himself up against Stiles, and he honest to god passes out at that point, which he feels he deserves.</p>\n<p> </p>\n<p>Stiles wakes up in Derek's bed with the older boy asleep beside him - and ew, gross, so gross, he's still in the tattered remains of his clothing and covered in things he's going to do his absolute best not to think about. He's not fully awake until he's already in the shower, water too hot as it beats against his skin. He trails a hand over his side, and the burns that had split his skin are gone, but there's a thick mark in his skin, smooth and seamless like an old tattoo. It's silver, which is weird as fuck, it shimmers in the week fluorescent light, and from this angle he can tell it's kind of swirly, but that's it. When he finally steps out of the shower, he sees a pair of pajama bottoms and an old t shirt left out for him. They're Derek's and Stiles doesn't even bother to hide his eye roll, because he knows for a fact he has pajamas in his room here, but he shrugs them on and they smell like Derek. He hadn't realized he was shaking until he stopped with worn cotton pressed to his face.</p>\n<p>By the time he makes it downstairs, almost everyone is there, and he realizes it's barely pushing nightfall. He heals Alan at least partially to make Derek scowl, but then he's wobbly on his feet and has to be steadied by Laura's hand. \"You okay?\" she asks, anxious.</p>\n<p>\"Oh my god,\" he moans, and he can practically feel everyone in the room tense with worry, \"I'm so hungry, what the hell, quick someone go catch me a cow.\" He's already marching to the kitchen before everyone shakes themselves out of their stupor to trail behind him. He begins assembling a sandwich and is actually so hungry he crams a slice of bread in his mouth to tide him over.</p>\n<p>\"Do you want an omelet?\" Mark offers. He's already pulling out the eggs, but Stiles nods vigorously anyway, because fuck yes, if he can eat it, he wants it.</p>\n<p>Alan sits down heavily at the kitchen table, \"It's the magical exhaustion. He's done a couple of things I would have sworn were impossible yesterday, and now his body is trying to replenish energy.\"</p>\n<p>Stiles is so not ready to discuss his impossible things, so he takes a bite of his sandwich and moans. The bruising on his throat means it hurts going down, but it is so worth it. \"Is Cory okay?\" It takes a few moments for the silence to mean something, and his throat is so dry that his next bite drags its way down. \"Guys?\"</p>\n<p>\"She's fine,\" Laura says, pressing a hand against the center of his back, \"Peter's ... he's, he'll probably be fine. He has her in his bedroom, but he's not letting anyone in. We can hear their heartbeats though. They're fine.\"</p>\n<p>Stiles drops his sandwich, and he's striding toward Talia, but he swerves at the last second to Derek standing be her side, wrapping his shirt in his fists and yanking the older boy down so he can look him in the eye. \"Yes?\" Derek says, and he's trying to come off of as exasperated, but all he manages is apprehensive.</p>\n<p>Talia moves to stand by Kevin, so Stiles can crowd even more into Derek's space, \"What would happen to you, if I died?\" Derek opens his mouth, but he's already shaking his head, so Stiles presses on, \"Would you go feral? Cory is Peter's anchor, and once he couldn't hear her heartbeat he fucking lost it. What would you do?\"</p>\n<p>Derek's still shaking his head, and his hands have come up to wrap around Stiles's, although he doesn't do anything to dislodge the grip.</p>\n<p>\"Derek,\" he presses, \"I know, that you can't, that your pack isn't,\" he glances toward Talia, but he understands the sadness and acceptance there, \"that your pack can't be your anchor, but I've nearly died a few times, and what's going to happen to you if I do?\"</p>\n<p>\"You're not going to die,\" if Derek meant for that to come out as a command, he should know it sounds more like a plea.</p>\n<p>\"I might.\"</p>\n<p>He leans down, drags his hands down Stile's sides so he can dig his thumbs into his hips and drags his nose up Stiles's neck, because Derek is a <em>ridiculous person</em>. He's wearing Derek's clothes, used his shampoo and body wash, there's no way he's not already saturated in his friend's scent, and still he has to mark him more. \"Don't die,\" he says, a breath of sound against Stiles's ear.</p>\n<p>It's not a solution, or an answer, they have to discuss this, damnit, but Stiles drops his head against Derek's chest and says, \"Okay.\"</p>\n<p>\"Omelet's ready!\" Mark says brightly.</p>\n<p> </p>\n<p>Deaton doesn't drive Stiles straight home, not that he expected him to, but he also didn't expect to have this conversation pulled over on the side of the road.</p>\n<p>\"Do you understand what you did?\" Alan asks once Stiles is to the point where he's actually going to snap if someone doesn't say something.</p>\n<p>He leans his head against the glass, \"I saved Cory.\"</p>\n<p>\"You saved this entire town, but Stiles - I thought you'd be strong enough to send the demons to hell, and it was a risk, one I hoped I wouldn't have to take. I never wanted-\"</p>\n<p>\"Stop,\" he can't make himself look at the older man just yet, but he thinks his voice is firm enough that it doesn't matter. \"You didn't force me to do anything, I went there of my own free will. Don't - just don't, okay. I know I'm not normal, not even for a mage, and I had the ability to do something that needed to be done, so I did it. End of story.\"</p>\n<p>Alan puts a hand to his shoulder and squeezes tight enough that he almost feels like he's not going to shatter, \"I didn't know you could kill a demon that old Stiles. I would have made blood oaths stating it was impossible, and you did it.\"</p>\n<p>\"Did you see?\" he asks, a hand going to his side.</p>\n<p>Alan sighs, \"It will fade once you use it- it's, it's a blessing, Stiles. You removed evil from this earth, and earth sought to repay you.\"</p>\n<p>Stiles turns so fast his neck cracks, \"What? What do you - what?\"</p>\n<p>Deaton presses a kiss to his forehead, and he's definitely been spending too much time around the Hales. \"You'll figure it out, I believe in you.\"</p>\n<p> </p>\n<p>Scott pokes at it, and Stiles scowls on principal, even though it doesn't hurt. \"It's a tree? It doesn't look like a tree.\"</p>\n<p>\"Apparently it's a ancient Celtic symbol for a tree,\" Stiles grumbles, wondering if he can smother himself in his pillow. \"Apparently the energy of the earth did - you know what I don't even know, Alan explained it like twice, but I just kept on making Lord of the Rings references in my head.\"</p>\n<p>Scott nods, \"Most of the stuff that comes out of your mouth I end up cross referencing with Harry Potter.\"</p>\n<p>Stiles makes a face at that before tugging the collar of his shirt down. Scott winces, and Stiles releases it with a sigh, \"Still that bad?\"</p>\n<p>\"You're torso is just generally horrifying for multiple reasons,\" he says apologetically. Stiles groans. \"Do you want to blow up some zombies?\"</p>\n<p>Stiles is horrified for all of two seconds before he realizes Scott's talking about a video game, and - yes, yes he does.</p>\n<p> </p>\n<p>Stiles rocks back on his heels in front of the Hale House, chewing on his bottom lip. It's been over two weeks, his bruises have faded, although the weird shiny thing along his ribs is going strong. He's seen Cory multiple times, she still picks him up with Derek and Cora every morning, but he hasn't seen or heard from Peter at all.</p>\n<p>\"You know,\" Mark closes the door on his Camaro, and Stiles feels like a little bit of an idiot for not hearing him come up, \"you have a key, a room even. You can go inside.\"</p>\n<p>Stiles shakes his head, twisting his lips before saying at a regular volume, \"Derek, come here, I need a favor.\"</p>\n<p>Mark rolls his eyes when his younger brother is striding down the front steps seconds later, and he cuffs him up the back of the head as he heads inside himself.</p>\n<p>\"Peter's not inside,\" Stiles says, not a question because he could probably sense him if he was. Derek raises an eyebrow. \"Help me find him.\"</p>\n<p> </p>\n<p>He's in the forest, standing in front of a tree that his initials carved into it. Derek hangs back, but Stiles stands at Peter's side and waits.</p>\n<p>\"It's dying,\" he says finally, hands pressed to the bark.</p>\n<p>Stiles stares, because it looks fine to him. \"How can you tell?\"</p>\n<p>Peter shakes his head, grabbing Stiles's hand to press it to the tree, and when he does he makes a wounded sound that makes Derek snarl. It is dying, slowly and softly, like it's - like it's cancer, the same way his mother died, fighting, but only delaying the inevitable. It feels like it's been dying for years, and it's on its last leg. \"What does it mean?\"</p>\n<p>Peter shakes his head, but slowly, like not only doesn't he know, but he doesn't understand why he doesn't know. \"It's the oldest tree in the forest, and the tallest.\"</p>\n<p>\"So nothing good,\" Stiles says, because it would be great if a dying tree were a dying tree, but it never is.</p>\n<p>Peter moves suddenly, gripping him around the back of his neck, still not looking at him when he says, \"Thank you.\"</p>\n<p>\"Anytime,\" he says.</p>\n<p>Derek snorts and Peter laughs, and for the first time Stiles thinks that they might all be okay.</p>\n<p> </p>\n<p></p>\n<p>~</p>\n<p> </p>\n<p>Scott is the one who tells him, because this entire thing was Scott's idea. Stiles had gone along with it because Scott has a long history of going along with all his stupid shit, so it wouldn't hurt for him to do the same once in a while.</p>\n<p>\"I made second string!\" he says, throwing himself down at the lunch table with more vigor than necessary. If he had a tail, it'd be wagging.</p>\n<p>Stiles swallows his milk. \"That's great!\" because he is a supportive motherfucker.</p>\n<p>\"No it's not!\" Scott crows, and if he smiles any wider he's actually going to break his face in two.</p>\n<p>Stiles falters, \"Uh, what?\"</p>\n<p>\"You made first line!\" he continues, like this is something to be excited about.</p>\n<p>Jackson and company choose this exact moment to walk by, and the other boy actually goes so far as slap him on the back, \"Guess you're not totally useless, loser.\"</p>\n<p>Stiles gapes while Scott continues, \"Dude, you, Jackson, and Danny are the only freshman who made first line! That's so cool!\"</p>\n<p>He opens his mouth to tell Scott how not cool this is when Cora and Cory sit themselves at the table and they're smirking, they know, they so know. \"Deaton is going to <em>love</em> this. So will Derek - all that time in this full contact sport - think of all the people you're going to smell like.\"</p>\n<p>Cora is actually cackling, because she is a mini Laura and absolutely shameless about it, so he just holds his head in hands and hopes it will all go away.</p>\n<p> </p>\n<p>\"You should do it.\"</p>\n<p>Stiles fucks up the rune he was sketching as Scott pumps his fist in the air from his place doing actual veterinary work. Instead of throwing it out, Stiles sets the rune on fire because that's just the mood he's in. \"Why. Just - why.\"</p>\n<p>Alan is completely unimpressed with his little flames show. Scott didn't even look up. \"It wouldn't hurt for you to have more social interaction with people who aren't Hales or Scott.\" Scott makes a disagreeable noise, because he's never really learned to share his friends, which is fair because Stiles is pretty bad at that too.</p>\n<p>\"I train with you for two hours every other day, and on my off days I'm at the Hales letting Talia do horrible evil things to me. Mark's living in New York permanently now, you know, the only human I have is Cory when I go over there, and she <em>grew up with this bullshit</em>. I don't know why Kevin and Talia forget that I'm human, but there's only so many miles I can run and pushups I can do before someone has to die. Probably me.\"</p>\n<p>Alan rolls his eyes, but Stiles is serious. \"There's a reason you made first line, and it's probably because Kevin and Talia treat you like a wolf. I'm willing to work around lacrosse practice for you just as with Scott, and considering it's physical Talia might even lessen up on the training.\"</p>\n<p>Stiles narrows his eyes, because that is dirty rotten lie and Alan knows it. \"This is going to suck. At least twice a month we're dragged out to kill whatever new ridiculous evil is here - if you could figure out the cause of that, by the way, that'd be awesome - and I'm getting a 4.0. I'm aiming for valedictorian, but considering Lydia Martin I'm willing to settle for salutatorian.\" It's not that Stiles cares about his grades, really, but sometimes in between Scott and the Hales and Alan his dad looks a little sad around the eyes, and there's no way to explain that it has nothing to do with his dad, and all to do with how crazy Beacon Hills has become, but if Stiles can't make his dad happy, he can at least make him proud.</p>\n<p>Judging be the looks both Scott and Alan are giving him he's transparent as fuck, so he interlocks another rune on the paper, only because he's almost sure if he activates it everything will blow up and it will give Alan hives when he sees it among his paperwork later.</p>\n<p> </p>\n<p>Danny snags the seat next to him in biology before Cora can the next day. She raises an eyebrow, he shrugs, and she smiles her dazzling smile at some boy until he stutters and makes room for her.</p>\n<p>Stiles stares at the other boy, like maybe if he does it for long enough his behavior will make sense. Danny doesn't even acknowledge him until he's set out his notebook, pen, pencil, and binder <em>just so</em> and Stiles's fingers are already twitching with the urge to fuck it up. But then Danny meets his gaze, and he's distracted by big brown earnest eyes that inevitably remind him of Scott. \"I know you don't like me,\" he begins.</p>\n<p>\"I like you,\" Stiles interrupts, because he does, everyone likes Danny, Danny is awesome.</p>\n<p>Judging by the confused but pleased smile on the other boy's face he may have said that out loud, which, oops. \"You do?\" Stiles nods. \"Jackson?\"</p>\n<p>\"Jackass,\" he says automatically, because that's what Stiles called him in fourth grade and he will go to his grave doing it.</p>\n<p>\"Greenburg?\"</p>\n<p>\"....Who?\"</p>\n<p>\"Lydia?\" he goes on.</p>\n<p>\"Goddess, perfect, but scary, so scary, and trust me I know scary people.\"  Scary not for the reason Danny probably thinks, but because she has enough untapped magical potential that the idea of what they could do together makes his mouth water. Danny ranks below her on this only because he's had his powers bound, so Stiles has no idea how much magic he has, but it's enough that someone felt the need to control it, and isn't that <em>interesting</em>.</p>\n<p>Danny's eyes flicker to Cora and his mouth turns down at the corners, \"I know.\"</p>\n<p>\"She's not scary,\" Stiles says dismissively, before pausing and considering that she can hear him. \"She kind of scary, but only, comparatively? And when she wants to be. Like, Laura, did you ever meet her, that's some scary shit. Mark is also terrifying, but that might have to do with the whole white chocolate thing than any intimidation factor, because what the hell, dark chocolate is the best. Derek agrees.\"</p>\n<p>He's being stared at like he has two heads, and Stiles swallows nervously. \"So you like me?\" Danny repeats, going back to his initial question.</p>\n<p>Stiles scratches his head, \"Yeah, of course dude, you're great. And I mean, Jackass is a horrible person, but I'm also nine hundred percent sure I've seen him carry Mrs. Goldblum's groceries a million times, and I remember what he did in middle school, that one time someone decided to be an asshole to you, and I'm the son of the sheriff, violence is wrong,\" Cora snorts so loudly it takes a serious amount of effort not to look over, \"but that was some badass  shit okay, if I was scary I would have made an attempt, but I think we all know I'm like, not.\"</p>\n<p>Danny seems to becoming more accustomed to his onslaught of words, because he only has to blink at him for about fifteen seconds before he can think of a response. \"I - so, do want to have lunch together?\"</p>\n<p>Stiles blinks, because, what, \"You don't like me.\"</p>\n<p>Danny shakes his head, \"Man, you don't even realize it, but after fifth grade, you fell off the fucking map. We all saw you every day, but if it wasn't Scott or the Hales you just didn't have the time for it. So I never disliked you, but I think it's safe to say none of us know you enough to have an opinion.\"</p>\n<p>Stiles is, for once in his life, shocked into silence, until the teacher walks in and he asks, \"Why now?\"</p>\n<p>Danny grins, \"You tried out for lacrosse. Lydia almost had an aneurysm over it. We figured it meant that we wouldn't get our heads bitten off by territorial Hales if we tried to talk to you.\"</p>\n<p>He is so lucky the teacher chooses this moment to start talking, because if he hadn't Stiles would have burst out laughing and wouldn't have stopped until Danny had taken back any and all overtures of friendship.</p>\n<p> </p>\n<p>\"If you leave us for them, I'll kill them,\" Cora says cheerfully. \"I know they're something like you, and that's nice for you to have your own kind and all, but I can't tell you how many fucks I don't give.\"</p>\n<p>Stiles blinks, \"What? Ew, no.\"</p>\n<p>\"Who's Stiles leaving us for?\" Cory asks.</p>\n<p>Stiles doesn't  even pay attention to what Cora says in response, because, \"Is that <em>designer</em>?\"</p>\n<p>Cory's face twists, but Lydia Martin is sliding in next to her, \"Kate Spade, very classy, but not your taste.\"</p>\n<p>Jackson and Danny follow her, pulling out their own lunches, which almost covers the flash of panic that overtakes her face, because it's possible to take that the totally wrong way, and Stiles forgets a lot of the time, but Cory is older, and people think she's cool because she's in the drama club and on the swim team and last year she dated the captain who this year is a senior.</p>\n<p>But Cory nods, sighing, \"It's not, it's really not, but my dad bought it for me, you know? I like your dress though, it has flow.\"</p>\n<p>Lydia flashes her honestly pleased smile, and Jackson stops looking like he wants to punch all of them. Danny knocks his shoulders against Stiles, who rolls his eyes and that's the only reason he sees Scott hesitating and clenching his lunch tray too tight, with a look on his face that Stiles hasn't seen since around the time his dad left.</p>\n<p>\"Hey,\" he's already sliding his too long limbs out to go up to Scott, \"What happened, what's wrong?\"</p>\n<p>Scott shakes his head, \"Nothing,\" and Stiles stares because that was not convincing at all. He looks back over to them and says, \"The table looks a little full.\"</p>\n<p>Stiles looks back, and no, it doesn't, but whatever, \"I mean, okay. Do you want to eat outside instead? Let me grab my stuff.\"</p>\n<p>He doesn't even make it a step before Scott's clutching at his arm, and okay, what. \"You're eating with me?\" he asks, eyes wide.</p>\n<p>\"Um, yeah, dude we've ate lunch together since we were five, we're not going to stop now. They can entertain each other, or whatever.\"</p>\n<p>Scott's lost that look on his face, and now he's beaming in a way that's sort of starting to make Stiles' uncomfortable. \"Never mind, let's go eat with everyone else.\"</p>\n<p>Stiles raises both eyebrows, but this is what he gets for letting Scott hang around the Hales, it was only a matter of time before he lost it.</p>\n<p> </p>\n<p>He's making the dishes wash themselves while he makes coffee, and his phone is wedged between his ear and shoulder while he fumbles with the buttons, \"I made the lacrosse team.\"</p>\n<p>\"You like lacrosse?\" Derek asks from the other end.</p>\n<p>When the pleasant gurgling of the coffee maker starts, he slumps against the wall and actually uses his hand to keep the phone to his ear. Alan keeps telling him there's not an instant coffee spell, but Stiles just things he's an asshole who doesn't want his favorite apprentice to be happy. \"Kind of? Not really, I mean, I don't dislike it, I did grow up here, but it's all right. If I was going to be pushed into an organized sport, I would have chosen cross country. Or soccer.\"</p>\n<p>\"And you're doing lacrosse because?\" There's a loud horn and some swearing the background, and it makes Stiles grin.</p>\n<p>He throws some bread in the toaster, and wishes Mark was still here if only because he made bread from scratch and it was always delicious. \"Scott has asthma, track would end poorly. Can you irritate your brother into sending me bread?\"</p>\n<p>\"What? I mean, yeah, sure. He's a stress baker anyway.\"</p>\n<p>\"New job not going well?\" Stiles grabs a disgustingly large to go cup to poor his coffee in, black like his soul before nine in the morning.</p>\n<p>Derek makes a noise between a sigh and a growl, \"Not - no, he's doing well and his stupid fancy law degree from Harvard can't hurt, but his boss is being an asshole, and Mark is...\"</p>\n<p>\"An OCD as fuck perfectionist with inadequacy issues,\" Stiles offers, glancing at the clock and cursing Derek in his head, because he's going to be late for school while the time difference between here and New York means Derek is on his way to his ten o'clock class.</p>\n<p>Derek makes that sound again, because even if it's true Mark is his older brother and Derek's going to die thinking he hung the moon and the stars. \"I guess, and he's just an associate so there's not a lot he can do about it. Laura's been taking him out to get drunk a lot.\"</p>\n<p>\"One advantage of being a human,\" he should get a fucking award for managing to lock his door while balancing his toast, coffee, and the phone.</p>\n<p>Derek hums before saying, \"Cory's almost there.\"</p>\n<p>Stiles blinks, \"How did you-\" he hears the familiar rumble from down the road, and scowls. Derek laughs like he can see him, which he totally can't. \"Whatever, jerk. Have fun drawing naked people.\"</p>\n<p>\"That's not-\" he begins, outraged, but Stiles hangs up on him before he can finish.</p>\n<p> </p>\n<p>Stiles collapses more than sits next to Scott, tucking his head against his friend's shoulder, who thankfully just throws an arm over his shoulder and lets himself be used as a pillow.</p>\n<p>\"Dude,\" Jackson says, sliding into the seat on his other side, \"you looked wiped. Not even tired, just wiped.\"</p>\n<p>Stiles moans, trying to shove his face even further into Scott's chest, \"Because Talia Hale is an evil, heartless woman.\"</p>\n<p>Scott laughs, jostling Stiles, \"Dude, I can't tell if she really likes you or hates you deep, deep down.\"</p>\n<p>\"Hate,\" he sighs, \"It's probably hate.\" He can feel the force of Jackson's confusion, so he explains, \"Since I can't do training after school because of lacrosse, she makes me run in the morning.\"</p>\n<p>\"How many miles?\"</p>\n<p>\"Six on weekdays, ten on weekends,\" he grumbles.</p>\n<p>\"That's fifty miles a week,\" Jackson says slowly.</p>\n<p>Stiles moans, \"I know! She's awful. With only Cora and Pete in the house, she has far too much attention to spend on making me miserable.\"</p>\n<p>\"You run fifty miles a week,\" Jackson repeats.</p>\n<p>\"Stop reminding me,\" Stiles pleads, pushing off of Scott to grab his English homework from his bag.</p>\n<p>Jackson's silent while he pulls out his own homework before saying, \"Do you want company?\"</p>\n<p>\"What?\" Both he and Scott are starring.</p>\n<p>Jackson's not looking either of them in the eye, \"Danny and I could join you, if you want. Meet at your place at, what, five thirty? My dad can drop us off on his way in to work.\"</p>\n<p>\"Sounds good,\" Stiles says, hoping the words come out sounding normal because he feels kind of numb.</p>\n<p>That's how he ends up running with Jackson and Danny every morning.</p>\n<p> </p>\n<p>Stiles presses both hands against the tree, and swallows down the nausea that comes with it. The magic rotting it isn't thick so much as it's cloying, makes it feel like he's pushing his own magic through the sap of its trunk. He puts his forehead against the bark and has to take quick, shallow breaths to stop himself from upchucking. He reaches further into the tree, tries to trace the poison back to the source, but he reaches the tips of the roots and ends of bare branches and can go no farther, it vanishes.</p>\n<p>He wants to yell, or break something, because he's certain this is the answer, that if only he could find what's making the oldest tree on Hale property die, he could find what attracts evil here in waves and stop it. He's - tired, and too young to be so tired of fighting and running and bleeding. But he can never trace the magic past the roots, no matter how many times he tries.</p>\n<p>Instead he flattens his hands which have formed into fists and presses back into the tree. He can feel the sweat break out over his skin and his legs begin to shake. He finds the now familiar lines of foul magic, and tries to treat them like wolfsbane in veins, tries to burn out what's killing this living organism, and it leaves him, as it always does, on his back and gasping, eyelids slipping shut.</p>\n<p>He wakes up to fingers dragging across his scalp, and he groans, resists the urge to curl into Talia's stomach to block out the sun beating against his eyelids. \"You should stop this - one of these days a mountain lion really is going to come across you.\"</p>\n<p>Stiles snorts, and it makes his already throbbing headache worse. \"I smell too much of Hale and wolf for anything else to even consider it.\"</p>\n<p>\"Not all predators are so easily deterred,\" she scolds, although her hands remain gentle.</p>\n<p>He gives in, turning just enough so he can hide his face in her torso, his words coming out muffled when he says, \"You'd save me.\"</p>\n<p>Her hand cups the back of his head and she drains out the sharp stabs of pain, \"We would.\"</p>\n<p> </p>\n<p>\"Holy shit,\" Jackson says, Scott's echo not far behind him. Stiles and Danny just lean against each other and stare.</p>\n<p>Cory rolls her eyes and Cora snorts, \"Get in losers.\"</p>\n<p>\"How did you,\" Jackson's hand hovers over the car handle, as if he's afraid to touch.</p>\n<p>\"Talia is going to give Peter such shit for this,\" Stiles laughs, bypassing the door entirely to jump in. Jackson makes a wounded noise before reverently opening the door. He strokes the side while the rest pile in, and Danny practically ends up in Stiles lap. \"I can't believe he got you a Jaguar.\"</p>\n<p>\"Neither can Mark,\" she says smugly, pulling out and onto the road.</p>\n<p>Scott laughs, \"Oh my God, this was your way of one upping him over the Camaro wasn't it?\"</p>\n<p>\"She sent him a picture this morning,\" Cora says, \"he's sent her nothing but a stream of curse words in response.\"</p>\n<p>\"How long before one of you can drive?\" she glances in the back, \"This is super crowded, and Lydia's not even here.\"</p>\n<p>\"I can drive in June,\" Jackson offers, \"My parents are getting me a car.\"</p>\n<p>\"Ridiculously expensive and douchebaggy?\" Cora asks.</p>\n<p>Jackson grins.</p>\n<p> </p>\n<p>\"Really Stiles?\" Dad sighs, and Stiles smiles sheepishly before putting his phone back in his pocket and digging back into his lasagna. He's arguing with Deaton about covens, and how much Stiles does not need a part of one, but he doesn't think his dad needs to know that.</p>\n<p>\"Sorry, Cory's freaking out,\" he explains, shoving in a bite of cheesy goodness.</p>\n<p>\"Cory?\" Dad repeats, face scrunching up, \"She's normally very level headed, ignoring that ridiculous car.\"</p>\n<p>Stiles grins, because he loves that car, it's burnt orange. \"She's bringing Lyle - her boyfriend, the captain of the swim team - over for dinner, and she's worried her dad is going to kill him.\"</p>\n<p>\"Lyle Eastwood?\" he asks, taking a long sip of water, \"He's not a bad kid. Doesn't really seem her type.\"</p>\n<p>\"He has the body of a marble statue, a face to match, and apparently he also possesses a very talented tongue,\" he says, and manages to keep a straight face up until he looks up to see the nauseated look on Dad's face, at which point he cracks up.</p>\n<p>\"I'm sure Peter will handle the situation as any father would.\"</p>\n<p>Stiles does not role his eyes, because his dad and Peter have bonded a little too well over being stupidly protective single fathers.</p>\n<p> </p>\n<p>\"Holy shit!\" Stiles says, crowding up in the other boy's space, \"What truck ran you over?\"</p>\n<p>He's already tugging his shirt over his head, eyes wide, \"Nothing. It's nothing.\"</p>\n<p>Stiles eyebrows are climbing up his head, \"What? No. Dude, that looks really painful. Did you get in a fight or something?\" He's shaking his head, ducking to hide behind a mop of curls. Something heavy and bitter is starting to curl in Stiles's lower stomach. \"Who did it?\"</p>\n<p>His hands clench around the straps of his backpack, \"No one, I'm fine, back off.\"</p>\n<p>For a moment all Stiles can do is stare, because he doesn't need to be a werewolf to hear the lie. Stiles doubts a blind and deaf person would believe that to be the truth. He feels anger heavy in his chest, and he doesn't think it's aimed at this kid, but it's certainly aimed somewhere. He takes a step closer, not sure what he intends to do, but before he can figure it out Jackson's throwing an arm over his shoulder and steering him away, asking too loud in his ear, \"Are we doing something after school? Because Cory, Cora, and Lydia are, and we're not invited.\"</p>\n<p>\"What? We can, whatever,\" Stiles cranes his neck to get a look at the kid, and he's pretty sure he looks grateful, but Jacksons tugs him out the door before he can properly categorize it.</p>\n<p> </p>\n<p>\"His name is Isaac Lahey,\" Stiles says, phone once again wedged between his ear and shoulder. He's in Batman pajamas and flipping pancakes, because all three of his houseguests are still asleep and he might as well be useful while he isn't. \"Jackson's known for a while, apparently.\"</p>\n<p>\"And he hasn't done anything about it?\" Stiles can <em>see</em> Derek's angry frown in the tone of his voice, \"I didn't think he was that type of asshole.\"</p>\n<p>\"He's not,\" Stiles says, and despairs that he's reached a point in his life where he's defending Jackson, \"Apparently he tried to get his dad to do something about it, but Isaac will swear up and down that his dad doesn't lay a finger on him, so that went nowhere. His dad apparently beat him extra hard after that, if the limp Isaac had was any indication, so Jackson just - covers for him, I guess, instead. Which doesn't exactly help, but considering the first option ended the way it did.\"</p>\n<p>Derek's silent on his end, and Stiles wishes he had werewolf hearing, wonders if he listens extra hard he can figure out whether Derek's writing or sketching, if he'd be able to tell by the drag of the pencil. \"What are you going to do?\"</p>\n<p>Stiles flips another pancake onto the stack and pours more batter onto the pan, \"I wish I could just have Dad take care of it, but if Isaac's not going to say anything, it won't do any good. You can't save someone without their consent, which actually sucks so hard I can't even articulate it.\"</p>\n<p>\"A first,\" Derek murmurs, and Stiles feels the thrill of triumph - he doesn't need super hearing when he knows the man so well.</p>\n<p>He adds half a bag of chocolate chips to the rest of the batter, \"What are you drawing?\"</p>\n<p>There's a beat of silence before he asks, \"How do you know I'm drawing?\"</p>\n<p>\"You only use that tone of voice when you're impressed with something you'd created, and you always end up using two hands when you paint, but you only need one to draw.\" Derek's silence is from embarrassment, so Stiles laughs a little before sipping at his coffee, \"You don't have to tell me. Is it porn? I bet it's porn.\"</p>\n<p>\"<em>Stiles</em>,\" he sounds so scandalized that he chokes on his coffee, \"Fucking hell, it's you.\"</p>\n<p>He puts down his mug because for some reason his hands are shaking, \"Me?\"</p>\n<p>\"I - just, you get this really big smile on your face sometimes, and I can't get the look in your eyes right without at least four shades of paint, but your smile - I can do that with charcoal, I think, it looks like I remember, at least.\" Derek pauses, and he knows he should say something, that this sort of thing deserves a response, but he can't fucking breathe. \"Stiles?\"</p>\n<p>\"You didn't say it wasn't porn,\" he says.</p>\n<p>Derek's sputtering and laughing, but Stiles's hands are still shaking.</p>\n<p> </p>\n<p>Stiles slumps against Isaac's locker to give the other boy the height advantage, because even though he's taller the most people no one can tell with the way he's hunched over all the time. \"I'm Stiles.\"</p>\n<p>Isaac nods, shoving his folders into his backpack, \"I know.\"</p>\n<p>He huffs a breath, scrubbing his hand through his hair, \"I should have asked Scott or Danny to do this - I'm really shit at these things.\"</p>\n<p>\"Pushing your nose into other people's business? You seem to be doing great so far,\" he says, and his face blanches and goes a little pale before he can help it, but Stiles is grinning like a loon, because he's got <em>attitude</em>, Stiles can appreciate that so hard.</p>\n<p>\"Do you want to hang out with us after school?\" he offers, \"Danny and Cora have been dying to see the new Ryan Gosling movie, and the rest of us don't care enough to outvote them.\"</p>\n<p>\"You love Ryan, don't lie,\" Isaac says, and it's hesitant and defensive all at once, \"I can't, though. I work after school.\"</p>\n<p>\"Sucks,\" Stiles says, and wonders what it's be like to do work that doesn't involve sigils and chanting in ancient languages. Stiles doesn't have a clue as to where or whom Alan sends most of the things he makes, but he makes a shit ton off it. \"Some other time?\"</p>\n<p>Isaac gives an awkward shrug and nod before shuffling around Stiles and down the hall. </p>\n<p> </p>\n<p>\"How many?\"</p>\n<p>Dad falls heavily onto the couch, and it's a good thing Stiles had already paused his game because his dad is pulling him into a hug tight enough that he's not going to want to know. At fifteen he's probably reached the age where hugs are long past cool, except he hangs out with Hales and <em>Scott</em>. Surprisingly, Jackson is also pretty tactile, an arm thrown around shoulders, shoves that feel more like nudges, and if he sit next to him on a bed or sofa they can be sure to be touching from elbow to hip. Either way he melts into his dad, gives him a few minutes before he pulls back just enough so he can look him in the eye, \"Dad?\"</p>\n<p>\"Three. They - they were kids. Twelve, thirteen,\" he still has an arm wound too tight around Stiles, but he's not going to complain.</p>\n<p>\"You told their parents?\" he asks, but he doesn't need his dad's sharp nod to know the answer. Beacon Hills has certainly seen its fair share of bodies these past few years, and a few more, even ones around his age, aren't going to shake Dad up this much. \"Sorry.\"</p>\n<p>His dad sighs, squeezing him once more before getting up, \"Part of the job. Just, be careful, all right?\"</p>\n<p>Stiles nod and hope Dad can't see his lips twist down. Dead bodies almost certainly mean he's going to be the opposite of careful.</p>\n<p> </p>\n<p>\"This is why you need a coven,\" Alan says, and Stiles is going to turn him into a toad.</p>\n<p>He flips to another page of the police report, \"Actually, this may be a perfectly human murderer. All three victims were strangled with rope, which is horrible, but we might be able to leave this to my dad.\"</p>\n<p>\"A coven is the  best way safely strengthen your connection to the Earth, and to yourself. Additionally, as much as I care for the Hales, some things should be handled by covens. Demons, for example, although I doubt any are brave enough to come within a hundred miles of Beacon Hills for the next century or so.\"</p>\n<p>Stiles slams the files shut, and drags over a book on druids written almost entirely in Gaelic, which he hates, \"We do fine. Also I'm not some fucking hedgewitch who needs a whole group to cast a freaking circle, I'm a <em>mage</em>, we don't join fucking covens.\"</p>\n<p>\"No,\" Alan agrees quietly, and before Stiles can get a grip on his triumph he continues, \"You lead them.\"</p>\n<p>It takes Stiles a good thirty seconds to drag his eyes up from the page, his mouth numb when he says, \"You want me to take over a coven, and what, drag it back here? Sure, I'll just fuck with the hierarchy of a fully functioning magical unit and then force them into the already unstable magical Bermuda triangle that is Beacons Hills. Have you lost your fucking mind?\"</p>\n<p>Alan shrugs, \"I never said you had to take over a coven. You could build your own.\"</p>\n<p>\"With who?\" Stiles snarls, fed up with this topic since the second his mentor brought it up, \"You and me do not a coven make.\"</p>\n<p>\"No. However, there are others whom you could train to proficiency.\"</p>\n<p>Alan stares at him until Stiles blanches in horror, at which point his lips curl into a satisfied smile. \"Danny and Lydia?!\"</p>\n<p> </p>\n<p>\"How did we become friends?\"</p>\n<p>Scott blinks, \"What?\"</p>\n<p>\"What overture of friendship did I make at the tender age of five to secure your valuable love and loyalty this past decade?\"</p>\n<p>Scott taps his pencil against his algebra, \"You gave me a peanut butter sandwich and missed the bus with me.\"</p>\n<p>Stiles scrunches his nose even as he reaches over to erase Scott's wrong equation. Math is never going to be his strong suit. \"I did what?\"</p>\n<p>\"Dad forgot to pack my lunch, and I didn't want to tell Mrs. Ross because that would make it the third time that week, so you gave me your sandwich and just ate grapes. Then when my dad was late, you missed your bus to sit with me and wait.\"</p>\n<p>\"He didn't show up,\" Stiles says, because he hazily remembers that day now, \"Mom took you to our house and we played dinosaurs.\"</p>\n<p>He would feel self conscious about the idiot grin stretching across his face if he wasn't certain he was seeing it's twin on Scott's face. \"I don't think that will work on Isaac.\"</p>\n<p>\"Probably not,\" Scott agrees, ducking his head to go back to his homework. \"Are we really going to tell Danny and Lydia everything?\"</p>\n<p>\"Hard to train them in magic if we don't,\" Stiles sighs, \"We're going to have to tell Jackson too.\"</p>\n<p>\"Why?\" Scott sighs, because even when Jackson is kind he isn't very nice, \"He can't do magic.\"</p>\n<p>\"But if we don't tell him, he'll be the only one who doesn't know. Eventually one of us will slip up, and if we don't tip him off on the whole magic and werewolves part, he'll still know that we're keeping something from him. He has inadequacy issues to the point he, Derek, and Mark should just make a fucking support group. So if we read in his girlfriend and his best friend, we read in Jackson.\"</p>\n<p>Scott pouts, but all the protest has gone out of him, \"I hate it when you're logical.\"</p>\n<p>\"Me too,\" Stiles confides.</p>\n<p> </p>\n<p>Stiles finds out through text message, and he's disgustingly thankful he got a heads up about this, because when his dad tells him he'll be able to hear the details without throwing up. Cory is the one who texts him, but for the life of him he can't think of why she would be there, unless Cora was the one who sniffed it out first and she tagged along.</p>\n<p>It doesn't matter how it happened, it matters that it did and Stiles isn't going to get a minute of decent sleep until he's sure it isn't going to happen again. He'd been hoping to ease the three humans into this world, but it looks like he's going to pull them in the deep end.</p>\n<p>The three children's bodies, two boys and one girl, had been dug up. That's horrific in and of itself, but they'd also been eaten. Not by animals, which while horrible is at least not their problem, but it's something which makes werewolves recoil, and he's sure as soon as he can bring himself to head over there, he's going to be able to sense something similar. He has time before Cory pulls up to collect him though, has a good fifteen minutes to put his head between his knees, breathe deep, and wonder to himself if he knew that running into the burning building five years ago would lead him here, if he'd still have done it.</p>\n<p>(It doesn't take long to ponder out - he would, in a heartbeat, with no regrets.)</p>\n<p> </p>\n<p>\"What the fuck?\"</p>\n<p>Stiles pulls the phone away, wondering if he'd read the caller ID wrong, except even if he'd had he can recognize that voice, although it's been a long time since he's heard Derek's light tenor go rough with anger. \"Hello?\"</p>\n<p>\"Why the fuck didn't you tell me?\" and oh, that's not so new, the way Derek makes his voice too loud to keep it from breaking, and Stiles isn't sure what he's talking about, specifically, but that there's more than one option already makes him feel like shit.</p>\n<p>He closes his eyes and takes a deep breath that he knows Derek can hear, \"I'm sorry. I just - there's a lot, and I didn't want you to worry.\"</p>\n<p>\"You're starting a coven,\" he says, and Stiles resists the urge to drawl that he's aware, because now is so far from the time, \"with people I've never met, and you and Deaton are giving them a crash course in magic because something new and terrible is killing kids, letting their corpses rot for a week, and then devouring them like a feast, which, what the hell. Stiles, why am I just finding this out now? From fucking Laura, of all people.\"</p>\n<p>\"I figured someone would tell you what was going on,\" he says weakly, shoving the phone between his ear and shoulder because his hands are shaking so badly.</p>\n<p>Derek roars, \"THEY ALL THOUGHT YOU WERE TELLING ME!\" Stiles opens his mouth to apologize, but what comes out is a sob he can't force back fast enough. \"Hey,\" he can feel Derek thawing, and he feels like an asshole, because he deserves this. \"Stiles, come one, I'm sorry, it's all right. Don't cry, oh god, please don't cry.\"</p>\n<p>\"I'm not crying,\" he snaps, ignoring how thick his voice sounds, giving in and falling down on his bed and rolling on his back, \"I'm sorry, okay? It's not that I didn't want you to know, or didn't trust you, I'm just really scared okay?\"</p>\n<p>Derek makes a soothing noise on the other end of the line, and not for the first time Stiles wishes Derek hadn't chosen to join his brother and sister in New York, wishes he was right here to press his hands to Stiles's ribs, and let Stiles hide his head in his chest until the world didn't seem so frightening anymore, \"Scared?\"</p>\n<p>\"So scared,\" he confesses, curling around one his pillows, \"All the time - I don't know what I'm doing, at all. Alan is helping, but I'm training both Lydia and Danny in the traditional manner, so their training will last a year and a day, and that is three hundred and sixty six days to fuck them up, okay. I was doing impossible acts before I could levitate something, and that's so backwards, and I'm such an anomaly, why the hell does Alan think putting me in charge of two powerful witches flush on power is a good idea.\"</p>\n<p>\"Because it is,\" Derek says while Stiles is still gasping from his rant, \"Stiles, you're the most powerful mage anyone has ever seen, and you're a natural leader with natural talent. You're going to be a great coven leader, you're in middle of building something amazing.\"</p>\n<p>\"Wow,\" Stiles says after a few long moments, \"Are you breaking out in hives right now? That was a lot of blind faith you just articulated.\"</p>\n<p>\"Shut up,\" he says, and it's almost right, but not quite. The ever present fondness is there, but there's also an undercurrent of pain which Stiles doesn't understand.</p>\n<p>Stiles rubs his thumb against his bedspread, it's soft and ridiculously expensive. Peter gave it to him for his fourteenth birthday. \"You know I do trust you, right? I just, I know being in New York is hard for you, sometimes, and that you worry about us. I was just scared about everything, and I didn't want to put that on you.\"</p>\n<p>\"When you're scared,\" he says, voice coming out slow, \"you usually come to me.\"</p>\n<p>\"Different kind of scared,\" he insists, \"I'm used to being afraid I'm going to die, or that someone I love is, or even that a spell or something I did isn't going to work right and it's going to be my fault. But - I'm turning them into witches. Lydia and Danny are two very different kinds of magic users, and it's my responsibility to ensure that they both are strong and in control of this power I'm teaching them to wield, not just for myself and this coven I'm trying to create, but for them too.\"</p>\n<p>\"Do three people make a coven?\" Derek asks, and there's that pain again.</p>\n<p>Stiles twists on his bed so he's lying on his back, \"No, not really. Well, I'm a mage, so technically, but I'm going to need two more people to really get this going. Ideally that would be Scott and Jackson, but neither of them really have the spark for it. There are a few local covens Alan and I have worked with before, and the bigger ones are usually willing to send new trainees to other covens they trust, so that's an option.\"</p>\n<p>Derek makes a sound like he's been shot, and Stiles knows that sound because Derek's actually been shot a time or two, \"Fuck, what's wrong?\" He doesn't say anything, and replays their conversation, and when he figures it out he feels like an idiot, but Derek's an idiot too. \"Oh my god, I'm not leaving you! Have you lost your mind? Deaton's been an emissary to your family for decades, what makes you think me leading a coven is going to change anything between me and your family, beyond that now I can protect them better? Derek, fuck that, even if I were to leave everyone else behind, which I never would, there's nothing in heaven or hell that could make me leave <em>you</em>.\" Derek's breaths are deep and even on the other end, like he's putting all his effort into keeping them that way. \"That's what you were thinking, wasn't it, that's why you were so mad, because you thought I was keeping secrets because I was pulling away, and I'm not, I never will, you're stuck with me Derek Hale. I'm your anchor, and you're just fucking mine, understand?\"</p>\n<p>It's only once he's said it that it realizes how creepy and possessive that is, but before he can apologize Derek sighs in his ear, \"Yeah, okay,\" and all the tension comes out of him, and he's exhausted all of a sudden.</p>\n<p>\"Tell me about your painting, or the book you're reading,\" he says, knowing he'll fall asleep to Derek's light voice and not caring, just wants something he can hold on to since he can't hold on to Derek.</p>\n<p> </p>\n<p>There's a firm hand on his shoulder shaking him awake, and he blinks his eyes open to his dad standing over him. He's curled on top of his bed, phone still stuck between his face and pillow, and he's half stretched when he hears the humming. He laughs, pulling himself up so he's sitting and presses the phone to his hear. He doesn't recognize the song, doesn't know if it is one, but he says, \"You weirdo, were you listening to me sleep?\"</p>\n<p>The humming stops, and it's another beat before Derek says, \"I could hear your heartbeat too.\"</p>\n<p>Stiles softens, because they have a thing about heartbeats, \"Still weird, you were doing that for,\" he glances at the clock, \"for an hour and a half. Did you paint something good, at least?\"</p>\n<p>\"Yeah,\" Derek's voice is faint, and Dad clears his throat.</p>\n<p>Stiles grins at him, saying, \"I got to go, but I'll talk to you later okay?\"</p>\n<p>\"Okay,\" Derek repeats, and they're good, Stiles knows they're good, but something about his tone still makes Stiles's chest ache. Before he can say anything else, Derek hangs up.</p>\n<p>Stiles frowns at his phone before looking up at his dad. \"Hey, sorry. What's up?\"</p>\n<p>\"Dinner,\" he says, but he sits down next to Stiles, \"Everything okay with you and Derek?\"</p>\n<p>\"Yeah,\" Stiles sighs, \"It sucks that he's so far away, but he really does love New York, and as much as Mark bitches and moans about wanting some space, he loves having him and Laura there. Cory definitely handled Mark moving better than I am Derek.\"</p>\n<p>Dad's looking down at his clasped hands, pulling at the wedding ring he still wears, \"But it's different with you and Derek, right?\"</p>\n<p>\"Because we're not related?\" Stiles asks.</p>\n<p>\"Yes!\" his dad still doesn't look at him, \"Yes, because you're not related. So it's different.\"</p>\n<p>Stiles frowns, and maybe if he could get his dad to look at him this might start to make sense, \"He's still my best friend after Scott. We're close, even if we're not related,\" he nudges his dad's shoulder, \"Dad, what's your point?\"</p>\n<p>Dad turns towards him, and Stiles can't breathe, because he's got the look on his face when he's thinking about Mom, a fierce sort of sadness and that's all mixed up with an even fiercer love. He wraps a hand around the back of Stiles's neck and presses a quick kiss to his forehead, \"Nothing, nothing. Just. Derek's a good kid.\" He claps him on the shoulder, \"Pizza downstairs.\"</p>\n<p>Stiles is still sitting on the edge of him bed when his dad walks out, staring at the phone cradled in his hands.</p>\n<p> </p>\n<p>\"What the fuck,\" Stiles takes a step back from Lydia, and then feels instantly guilty and moves forward again, close enough that he can fold his hands around her elbows, \"Hey, it's okay, I've seen weirder things, we'll figure it out.\" Danny shuffles closer too, presses his hip against hers. His face is white, but he's steady when he curls an arm around her shoulders.</p>\n<p>\"She's dead,\" she says, eyes too wide.</p>\n<p>Stiles's eye's flick to the mutilated, half eaten corpse and says, \"We're in a graveyard.\" He then feels like a dick, because he's seen a dead person or fifty but this is new for them, so he follows it up with, \"I know. She's not the first this has happened too. I'll explain later, but we should really leave so someone can find her and call my dad, okay?\" Lydia's starring at him like he's something she can't identify, and it's a look he's slowly becoming used to. To be fair, after Lydia has led them to a dead body like a bloodhound, he's not too sure what she is either. She nods and he and Danny bracket her as they turn to leave.</p>\n<p>\"Hey!\" Stiles hangs his head, because he knows that voice, \"What are you - oh my God!\"</p>\n<p>They turn, and Stiles tries to smile, \"Hello Isaac. Um. Fancy meeting you here.\" Danny groans and Lydia makes a noise that's almost a snort.</p>\n<p>Isaac looks between the corpse and them, and Stiles is intrigued, because he doesn't even twitch at the mauled middle school-er, but what's putting him on edge is that they're here. \"Did you do this?\"</p>\n<p>\"<em>Excuse me</em>?\" Lydia sounds strangled, but Stiles is actually smiling now.</p>\n<p>\"Your dad runs this place, right?\"</p>\n<p>Isaac nods, doesn't look down at the body in between them. \"Yes, I was doing some maintenance, because unlike some people I don't hang around graveyards for fun.\"</p>\n<p>\"I don't know if fun is the right word,\" Danny says, \"Are you the one that takes care of the flowers here? I've always thought they were really pretty.\" Isaac flushes, retreats to something closer that Stiles recognizes from school. He glances around, and he hasn't really thought about it, because whenever he comes here all he can think about is his mom, but Danny's right. Most graveyards are long expanses of bright green grass but there are flower bushes and beds and big green plants dotted around curving trees. It's almost like a garden instead of a graveyard.</p>\n<p>\"This must take a lot of patience,\" he says, \"and talent. I didn't know you were into horticulture. That's really cool.\"</p>\n<p>He's trying to sound earnest, because he is, but Isaac's shaking his head, \"Just - look, get out of here, okay? I'll call this in, and my all of these bodies have been setting my dad on edge. It'll be better if you're not here when he finds out.\"</p>\n<p>\"We didn't do it!\" Danny says, something between horrified and pained.</p>\n<p>Isaac sighs, \"I know that, okay? I do. But you guys should really leave now. Stiles, the last thing you need is to be found at another crime scene.\"</p>\n<p>Stiles is still caught on his previous words, \"What's your dad going to do?\"</p>\n<p>\"Get interviewed by your dad. Again,\" he won't look Stiles in the eye, and he wants to leap across body of the poor girl so he can grab Isaac and shake him.</p>\n<p>\"Isaac,\" he says.</p>\n<p>His shoulders slump, going into a familiar slouch that makes him look smaller than he really is. \"It'll be better for me if you're not here, okay? Just go. Please.\"</p>\n<p>Stiles nods, and when he turns back around Danny and Lydia follow. By the time they make it back to the car, Lydia's shaking and Stiles pulls her against him, finds the smoky edges of her magic shifting under her skin, soothes and settles them until she's still against him. He draws Danny closer, shifts her into his arms to finish what he started.</p>\n<p> Danny's still scarily new to all of this, but he's easier for Stiles to train because of the way his magic moves. Danny's magic is intertwined in the earth, connected to it in a way that's almost like a mage. Stiles commands the Earth, but Danny converses with her, or at least has the potential to do so. Once he gets more trained up, Stiles is going to throw him at the tree on the Hale property - maybe he'll be able to follow the lines of magic. Neither of Danny's parents were the ones to put a seal on him, and Stiles is dying to meet his grandmother, because the seal didn't work because of the power it held but the skill in which it was weaved. Stiles can admire that, when for most of his life he's just shoved his magic at a problem until the world bent to accommodate him. Finesse is not his strong suit.</p>\n<p>\"Am I something bad?\" Lydia asks, face buried in Danny's shoulder.</p>\n<p>Stiles lays a hand on the center of her back, \"Lyds, no, of course not. You have a powerful gift, and it's connected to death and the other side, but <em>that's okay</em>. It's morbid, maybe but it's also amazing and new and something I'm sure you'll learn to wield with grace and expertise. It's not bad, and neither are you. I've seen bad, I've fought bad, and you're just really, really good.\"</p>\n<p>He meets Danny's eyes, helpless, but the other boy is smiling at him. The tension he can feel in Lydia's back bleeds away, and she says, \"You're not half bad at this, you know.\"</p>\n<p>Stiles isn't sure which 'this' she's talking about, but his answer is the same, \"Thank you.\"</p>\n<p> </p>\n<p>Cora is helping Pete with his very complicated second grade homework, and Cory's head is in his lap while they watch Peter and Kevin pace. They look more alike than Peter and Talia do, and when they move in sync it's almost easier to believe they're siblings.  </p>\n<p>\"Will you stop that?\" Talia snaps.</p>\n<p>They both glare at her, and keep pacing. Cory sighs, and pushes herself upright to grab her phone and start texting, \"So, I really think the rest of the Scooby Doo gang should be here.\"</p>\n<p>\"Alan's out of town for the next week, something to do with his sister,\" Stiles says, \"Lydia's convinced herself she's causing the deaths instead of just predicting them, so I sent Jackson over to talk some sense into her, or maybe just make out with her until she stops crying. Danny's babysitting his little sister, and Scott is covering for Deaton by being on call for animal emergencies, which I'm pretty sure is illegal, but he has the skill for it, so whatever.\"</p>\n<p>\"Do you know what Lydia is yet?\" Peter asks.</p>\n<p>Stiles sighs, \"Besides terrified, and intent on convincing me insane wendigos are running about? No, not really. The boy is the third body she's led us to, though, and I would adore to write her off as psychic, but her magic is much stronger than that, even if she has psychic elements, it's not what she <em>is</em>.\"</p>\n<p>Talia's shoulders are slumped and she cradles her head in her palm. Stiles sends a whisper of magic over, a breeze that smells like pine trees and the sea, and she lifts her head just enough to smile at him.</p>\n<p>\"We'll figure it out,\" he promises, feeling the tight iron core of power low in his spine, \"As soon as we figure out what it is, and how to catch it, we can kill it, and we will.\"</p>\n<p>She smiles, and the Hale brothers stop pacing. No one mentions how even if that's true, it's a symptom, not a cause, and that their town is still sick with a disease none of them know how to cure.</p>\n<p> </p>\n<p>Scott and Stiles are shoulder to shoulder and loudly trash talking each other when Dad sticks his head in the room. They pause the game automatically, and there's a tightness in both their faces, just in case there's more bad news to be delivered. Nothing new is on Dad's face though, just fondness, but they don't relax fast enough for him not to notice their reaction. He doesn't call them on it, but he does lean on the doorway a little heavier.</p>\n<p>\"Are you staying over, Scott?\" he asks, and Stiles nods before Scott can answer, because he loves Lydia and Danny, loves the Hales, but he's really starting to miss his best friend, which is a little ridiculous since he sees him every day.</p>\n<p>Scott has a small, pleased smile at his face, and Stiles bumps against him with a grin. His dad rolls his eyes at them both, but says, \"All right, I'm heading out - nothing's wrong,\" he says before Stiles can even begin to properly panic, \"I'm just picking up the late shift for Janet, she couldn't come in. I left money for pizza downstairs.\"</p>\n<p>\"Thanks, Dad,\" Stiles says, \"Be careful.\"</p>\n<p>He nods and gives them both one more fond look before leaving. Stiles and Scott spend the rest of the night like that, video games, bad movies, too full of pizza, and for a little while Scott can almost feel like he's fifteen.</p>\n<p> </p>\n<p>\"What's with you?\" Jackson slides into the seat opposite him at lunch, \"You look - gleeful, and not even the mayhem kind of glee I'm used to seeing on you.\"</p>\n<p>\"He's texting my brother,\" Cora rolls her eyes, \"He, Laura, and Mark are coming down for Christmas, and Derek just sent him their flight information.\"</p>\n<p>\"I haven't seen him in nearly four months,\" Stiles pouts, \"You're not making fun of Cory for being excited over Mark. You should get on that.\"</p>\n<p>\"Mark and Cory share a special, human bond of love and affection,\" Cora says while winking at said girl, \"You and my brother are co-dependent and gross.\"</p>\n<p>\"We are not co-dependent,\" Stiles informs the table at large, \"Derek's been living in New York for two years.\"</p>\n<p>\"How many times do you two call each other?\" Danny asks.</p>\n<p>Stiles flushes, but says, \"Not that much.\"</p>\n<p>Scott snorts. Loudly. Stiles gives him a look of total betrayal, but he just shrugs and says, \"Sorry dude, but you guys talk every day. Sometimes more than once.\"</p>\n<p>\"Co - dependent and gross,\" Cora repeats, and Stiles throws his apple core at her face.</p>\n<p> </p>\n<p>Peter's the one waiting for him this time when he goes to the tree, and he gives him a salute which is returned with an eye roll. \"Any luck?\" he asks while Stiles places his hands on the tree.</p>\n<p>\"No,\" he sighs, \"Not really. Lydia's still pushing wendigo, but usually they're a bit more senseless than this, and they eat their kills fresh.\" He sucks in a breath, the magic like ink coursing through the tree coursing through him while he tries to purge it just a little, to take a little more so that the tree might live that much longer. It won't make a difference, treating this symptom of a larger problem, but still he comes here and does his best.</p>\n<p>When he sways and begins to fall, Peter curves an arm around his back and says, \"Derek is going to love it when he figures out what this does to you.\"</p>\n<p>Stiles tucks his head into Peter's shoulder, and doesn't complain when he's lifted like a child, \"He'll get over it. I can't wait for him to come home.\"</p>\n<p>\"Of course you can't,\" Peter says, and Stiles wants to demand what that's supposed to mean but he's already falling asleep and his voice had been layered in affection, so whatever he meant, it probably wasn't bad.</p>\n<p> </p>\n<p>Lydia's getting stronger, her powers more focused and more easily called to her grasp. Stiles would be happier about this if it didn't mean he was holding off a half dozen wendigos who are apparently even more fucked up than normal ones.</p>\n<p>\"Go,\" he grunts, letting power flow through his hand on the next hit so that the thing staggers.</p>\n<p>Danny coaxes a tree to wrap it's branches around a wendigo, and that will last a few minutes. It leaves him pale. \"We can't leave you here.\"</p>\n<p>\"You can, and you will. Get the Hales - magic is well and good, but teeth and claw would be better right now.\"</p>\n<p>Danny wants to argue, the sloppy edges of his magic sparking for a fight. Lydia tugs him away, ducking under the cover Stile provides, because she can sense it too. The wendigos weren't senseless, were perhaps given too much sense by the dark magic in this town they still can't trace. If he lives, he'll try to find out which of these children were magic, which of the ones they ate gave them the power to stand against him now.</p>\n<p>He's a mage, the power of the earth his to call and command, and they should be nothing to him. Instead long gashes open against his arm, and he prays that he lives long enough for back up to arrive.</p>\n<p>\"STILES?\"</p>\n<p>Not the backup he meant. He pushes himself in front of the other boy, curls his magic like mist because wendigos can't see or hear that well, it's mostly their sense of smell, and this may give them a minute of cover. \"Isaac, hey buddy, has anyone ever told you that you have horrible timing?\"</p>\n<p>\"Actually, no,\" he says, eyes wide, although Stiles is suitable gratified when Isaac stays behind him, \"So I guess you guys really weren't the ones digging up the bodies.\"</p>\n<p>\"Oh my God, no, that's why you've been avoiding us at school isn't it?\" Stiles curses when they start to circle them, and curses himself even more for not carrying mountain ash. Not the best against wendigos, but he could make it work.</p>\n<p>\"You can't blame me, for all I knew I was your next victim,\" Isaac ducks further behind Stiles, and he finally notices what the other boy is carrying.</p>\n<p>He grabs the rusted pipe from his hands, \"Please tell me this is pure iron.\" Isaac nods, but Stiles doesn't need him to, can already feel the feedback loop of energy under his hands. It's not mountain ash, but oh, how Stiles can work with this. His magic heats the metal in his hands, the rust flakes away and when the tip begins to drip he flicks it like a whip, so hot metal splatters on the wendigos moving closer. They roar back, and Stiles cackles.</p>\n<p>\"You're vaguely terrifying,\" Isaac says, but he sounds more amused than scared.</p>\n<p>Stiles shrugs, some tension draining out of him as flicks the pole again. He's starting to feel like he's holding a water bottle and punishing naughty cats. \"You want terrifying, let's talk Lydia Martin. Also you're handling this extremely well.\"</p>\n<p>Isaac moves so his shoulder brushes Stiles when the next time the wendigos charge they get too close for comfort, \"I always knew there was something weird with all of you; you guys are not exactly subtle.\"</p>\n<p>\"I'm subtle!\" he defends.</p>\n<p>\"You're really, really not,\" a familiar voice says from <em>right behind him</em>.</p>\n<p>He turns to brandish his iron pole at Laura threateningly, \"Am too!\"</p>\n<p>\"Am not,\" Cory takes the pole from his grasp and tosses it at an approaching wendigo. Stiles would be protesting, except that Laura is already transformed and the warmth in his bones means the rest of the Hales are fast approaching. She pulls him into a quick hug as her cousin launches herself into the fight. \"You okay?\"</p>\n<p>\"Of course,\" he scoffs, even as he leans into her a little bit. He's not sure what she smells like to werewolves, but she smells like lavender to him. When she pulls away it's only to turn to Isaac. Stiles is aware the rest of Hales have arrived and are busy tearing the wendigos apart, but he's far more interested in watching the way Isaac's eyes bug out of his head when Cory wraps herself around him. He grimaces a little at  the bruises she presses against, but it doesn't stop him from pulling her close and tucking her under his chin. Stiles doesn't blame him - Cory gives the best hugs. She's small, about as tall as Lydia, and she curls up into you so you have no choice but to effulge her and tuck her close, and it makes you feel strong to hold her, because if Cordelia Hale trusts you to keep her safe, you're going to be fine.</p>\n<p>Cora rips the arm off of a wendigo, and some liquid he doesn't want to identify sprays across his face. \"Gross,\" he complains, but before he goes to wipe it off, he can <em>feel </em>it, and no, oh no, he recognizes the magic running through their veins, because it's his, it's his magic that's given them immunity, his and the dark poison which he always, always thought was a symptom, but he was wrong.</p>\n<p>It wasn't an effect, it was a cause, and he's an idiot.</p>\n<p>\"Stiles?\" Cory says, cautious, and he doesn't know what he looks like when he turns to her, but she takes a step back.</p>\n<p>He shakes his head, says, \"You got this, right?\" and bolts for his jeep, because he knows what he has to do, he thinks he might be able to fix this.</p>\n<p> </p>\n<p>He stumbles to the tree, the big, gorgeous dying tree and presses his hands to it. For the first time in a long time, he doesn't try to push his magic in but skims it, presses against it like he's looking for a bruise, just so he can see the spots where the tree is most tender and where he's going to have to focus hardest.</p>\n<p>\"Stiles!\" he lets Derek jerk him back by the shoulder and shove him close. He presses his face to Derek's chest, doesn't try to stop himself when he starts to cry, \"What's wrong? Stiles, what happened?\"</p>\n<p>Stiles keeps his hands on Derek's chest, but he steps back enough to see his face. Any injuries he might have gotten will have already healed, but Derek's looks just as pained as if he were gutted. \"Do you trust me?\"</p>\n<p>Derek stares, \"<em>What</em>?\"</p>\n<p>Stiles swallows, \"Do you trust me, Derek?\"</p>\n<p>\"Of course. More than anyone, more than Mom or Laura, now will you please trust <em>me</em> and tell me what's going on?\" Derek's  arms are tight around Stiles, and fear and frustration make his voice rough.</p>\n<p>He shifts his hands so he can feel Derek's heartbeat under his palms, \"Do you trust me to protect you, Derek? To protect your whole family, all the Hales? Do you trust that I would do anything, anything at all, to make sure you were all safe?\"</p>\n<p>He doesn't respond for a long moment, and fear clogs Stiles's throat until he leans down to kiss Stiles's forehead and say against his skin, \"You ran into a burning building to save us all before we even knew you, and every action you've taken since has just reinforced how much you care for us, and the lengths you'd go to in order to keep us safe. I don't trust that you'd protect us, I know you would. So will you please explain to me what's going on now?\"</p>\n<p>\"I figured it out,\" he says, ignores how hoarse his own voice is, is so thankful that Derek can't feel the shift in the earth his words have caused, because if he knew what he'd just gave permission to happen he'd take it back. You can't save someone without their consent. \"I know what's drawing all these supernatural beings here, and I think I know how to stop it, but I need your help.\"</p>\n<p>\"Anything,\" Derek says.</p>\n<p>Stiles swallows, wells up the last dregs of his courage to say, \"Transform.\"</p>\n<p>Derek does, confused but willing, and Stiles drags his nose up Derek's throat, scent marking him purposely for the first time, and presses a kiss to Derek's furry cheek before he turns his magic on him, keeps him still in a way he would never manage physically. He looks into Derek's eyes and says, \"It needs a sacrifice,\" before he slits his throat on Derek's claws.</p>\n<p>He falls against the dying tree to bleed on its roots, rests his head against the bark. This will take nothing less than everything he has, so he releases Derek in order to push himself into the tree. He's always stopped far from draining himself before, but that's not what's going to happen this time. Derek curls around him, hands uselessly presses against his throat in an attempt to stop the bleeding, but Stiles knows that Derek understands it's pointless, because instead of trying to drag him away he's just clinging and sobbing into the back of his neck, chanting \"why why why\" into his ear.</p>\n<p>Stiles can't talk with his throat slit, so instead he hold on to one of Derek's hands, slippery with his own blood, and hopes he understands. He pours his blood, magic, and soul into this tree, because if he can heal the sickness killing it, he'll eradicate the foul magic summoning monsters to his home and to his family like moths to a flame. The last thing he feels is Derek's hand, slick with blood, clutching his fingers so hard bones break, and then he feels nothing at all.</p>\n<p> </p>\n<p>When he wakes up, his connection to the Earth is like a punch to the stomach, stronger and new and so much more than what he had before. It's enough that it feels as if his skin itches, too small and stretched over his soul which is bigger and brighter and stronger than it's ever been. Under that, he feels his connection to the Hales, all of them, but Derek most of all. Derek, who must know he's awake and alive, but is clutching him and sobbing as if he's still dead. He can sense the other Hales a few yards away, doesn't understand why someone doesn't come closer and do something because Derek is hysterical. \"Hey,\" he says, voice smooth and even in his newly repaired throat. \"I'm sensing a pattern where I do something impressive and impossible and then pass out, which might cancel out the impressive part.\" Derek doesn't react, although Stiles does notice that he's being rocked back and forth, and that the hands clutching him are clawed. \"Derek?\" he repeats and reaches behind him to prod at his face, the ridges and rough edges tell him he's still all the way transformed. \"Derek, I'm okay, it's all okay now.\" He can't see the Hales from how his body is twisted against Derek, but he can sense them, and he doesn't understand why they don't come closer and help him, it's not like Derek is going to attack -</p>\n<p>Oh.</p>\n<p>He might attack them if they go closer, because Derek slit his anchor's throat who then died in his arms, and wow, Stiles is probably the stupidest person who's ever lived, because Derek might be a little bit feral right now due to Stiles's inability to think ahead properly. So he shifts, presses back against Derek until he yields, uncurling from his protective ball to flat on his back, let's Stiles turn so they're lying chest to chest, and the silver edging Derek's beautiful blue eyes makes his heart break. \"I'm sorry,\" he whispers, pressing a kiss to his chin, \"I'm sorry,\" kisses his left cheek, \"I'm sorry,\" then the right, \"I'm sorry,\" his forehead, \"I'm sorry,\" his nose, and then he tugs at Derek's hands until he can wedge them between them, until Derek can feel their twin heartbeats pulsing in sync, and Stiles pushes his head in between the werewolf's neck and shoulder, presses his lips to Derek's pulse, and hopes that if they stay like this long enough they can convince each other that they're both okay.</p>\n<p>Stiles has mostly fallen asleep more than an hour later when Derek moves, pulling his hands from in between their bodies and settling them along Stiles's back. He kisses Stiles forehead with full, human lips and Stiles pushes himself up enough to look into Derek's hazel eyes before he's throwing himself down on top of him and wrapping his arms around his neck, \"I'm sorry, Derek, I'm really sorry.\"</p>\n<p>\"I forgive you,\" he says, easy, as if Stiles wasn't the biggest fuck up to ever exist. \"No you're not.\"</p>\n<p>\"I didn't mean to say that out loud,\" he scowls, but can't help drinking in the smooth planes of Derek's face, the perfect shade of green his eyes are in afternoon light. \"Your eyes were silver on the outside, Derek, I'm your anchor, I should have taken that seriously, instead I fucked off and did what I wanted, and nearly fucked you over-\"</p>\n<p>\"You saved us, you healed the stupid tree, and you've bound yourself to my family and this land, all so you can continue to save us, and when I said I trusted you Stiles, I meant it, okay?\" Then Derek drags his nose up Stiles's throat, just like Stiles did to him, \"You dying was something that's never, ever going to happen again though, okay?\"</p>\n<p>\"Okay,\" he whispers, clutching tighter to Derek, because the Hales are inching closer now, the wendigos are dead, he's alive and Derek forgives him and trusts him and everything is going to be fine.</p>\n<p>\"What do silver eyes mean?\" Derek asks.</p>\n<p>Stiles blinks, because is Derek brain dead, \"It means you almost went feral, dumb ass.\"</p>\n<p>\"Not in werewolves,\" Stiles can practically feel him rolling his eyes, \"in mages.\"</p>\n<p>\"Nothing? It doesn't happen outside of myth.\"</p>\n<p>\"What does the myth say?\" Derek insists, and Stiles is starting to get a little suspicious, because while Derek's voice is still rough from crying, he's trying to come off as a little too casual.</p>\n<p>\"That you're really powerful? Merlin's eyes turned gold, so I guess silver would be more powerful than fuck but still less powerful than the most powerful mage of all time?\"</p>\n<p>\"Huh,\" Derek's breath of hot air ghosts over his neck, \"Not to freak you out, but your eyes are silver.\"</p>\n<p> </p>\n<p>\"So, you healed a tree by killing yourself, and now you're even more of a badass than you were before?\" Scott clarifies.</p>\n<p>Stiles winces, and not just because he's losing against Scott on screen, \"That's a gross over simplification of what happened.\"</p>\n<p>Scott snorts, \"Dude, it was the ending of Deathly Hallows, with you has Harry and this stupid tree as Voldemort.\"</p>\n<p>\"Who does that make Derek?\"</p>\n<p>\"Ginny.\"</p>\n<p>Stiles crashes. Scott wins.</p>\n<p> </p>\n<p>Since its winter break, Stiles manages to avoid them for a full three days. \"Stiles?\" Dad gives two perfunctory knocks before walking in, \"You have company.\"</p>\n<p>\"I'm not here,\" he says, not looking up from his book, because Scott's spending the day with Alan, and anyone else he'd want to see wouldn't use the door.</p>\n<p>\"Stiles!\" and he sighs, giving a weak grin to Lydia as she throws herself on top of him, pushing him against the bed and holding tight enough that it gets hard to breathe.</p>\n<p>He hugs her back, light and careful to balance out her ferocity, and says, \"Miss Martin, your boyfriend is right there, this is completely inappropriate.\"</p>\n<p>\"Shut up, loser,\" Jackson snorts, bouncing lightly down beside them on the bed, pressing himself shoulder to hip against Stiles, who nudges him back.</p>\n<p>\"Danny? Aren't you going to join?\"</p>\n<p>He sighs loudly before carefully sitting down on his other side, and for a moment Stiles thinks he's going to get the silent treatment for avoiding them before Danny lays his head against Stiles's shoulder and slings his arm over Lydia's back.</p>\n<p>\"So...,\" Stiles stifles a laugh at how his dad drags out the word, \"Is there something you want to tell me?\"</p>\n<p>\"I'm completely irresistible and in a polyamorous relationship with the three hottest people in school who aren't Hales,\" Stiles says, and none of them even hit him for it.</p>\n<p>\"Right,\" his dad says, \"Well, practice safe sex,\" and shuts the door.</p>\n<p>Danny laughs, \"I kind of love your dad.\"</p>\n<p>\"Me too,\" Stiles admits, and tries not to look too reluctant when they all move away from each other and sit up right.</p>\n<p>\"Show us,\" Lydia demands, intent, and Stiles sighs, brings the boiling presence of his magic to the fore so his irises turn silver. Jackson sucks in a breath and Danny's grinning so wide his face is going to break in half. \"We felt it, when you died, and came back like this.\"</p>\n<p>\"What?\" Stiles demands, grabbing her hands, \"Really?\"</p>\n<p>She nods, looking down at their joined hands as if she can see the magic making their hands tingle if she concentrates hard enough, \"Danny too. What does this mean?\"</p>\n<p>\"That we're more of a coven than I thought,\" he grumbles, because them bonding to him so soon was not in the plan, he doesn't want to force their hand like that.</p>\n<p>She slaps him on the arm, \"I meant what your power boost means for us, for the coven.\"</p>\n<p>He looks from Lydia to Danny, feels Jackson tense and anxious at his back and says, \"It means I have even more of a duty to both the Hales and the people of Beacon hills than before, but it doesn't change a whole lot for us. We're going to finish your training, and after you've both completed a year and a day working under me, should you choose to remain in my coven, I'll send out some feelers and see if we can get two more members, and that will make us the official coven of Beacon Hill, closely allied to the Hale pack.\"</p>\n<p>\"What will being the official coven mean?\" Danny asks.</p>\n<p>Stile bites his lips, \"If someone or something threatens or attacks us, we won't just be defending ourselves as allies or pseudo emissaries of a werewolf pack, we'll be doing it as witches with a claim to this land. Mostly that's only useful with other witches, hunters, or werewolf pack emissaries. We'll still be deferring to Hale Pack in most fights.\"</p>\n<p>All three of them are staring at him, and he meets them with a confused stare of his own until he's once again on the bottom of a pile of humans and Lydia's demanding in his ear, \"Teach me how to set things on fire.\"</p>\n<p>\"Oh my God, no,\" he laughs, even as he's thinking of the right combination of Latin.</p>\n<p> </p>\n<p>Derek climbing into his window and bed is far from new, especially recently, but he doesn't fall right back to sleep even after he's curled on top of Derek's chest. \"What's up?\" he yawns, pressing his palm to tense muscle and feeling the beats of his heart.</p>\n<p>Stiles feels Derek's arm press hard into his back for a moment, \"We go back to New York in a week.\"</p>\n<p>He wonders if Derek can smell his sadness, but knows he can, so he reaches to rub his thumb along the back of Derek's ear. He knows he reeks of Hale, Derek's scent always stronger than the rest combined, that any foreign wolves smell Derek Hale on him before they smell Hale, but his obsession on making sure Derek smells like him is new. The older man doesn't seem to mind, leans into those touches meant to scent mark while his face goes soft, \"I'll miss you.\"</p>\n<p>\"I'll miss you too,\" Derek murmurs, \"which is part of the reason I don't think I'll go back after this semester.\"</p>\n<p>Stiles is wide awake now, clutching the fabric of Derek's shirt in his fist, \"Dude, no, you love New York, and you should get your degree, don't transfer somewhere your senior year, that would suck.\"</p>\n<p>\"Relax,\" he smoothes out Stiles's fist on his shirt, \"I was already graduating a semester early, and I'll finish up this summer. Then I can come home.\"</p>\n<p>Stiles nudges himself upward, and doesn't deny the thrill he gets when Derek bares his throat so he can bury his face there. \"Don't think I don't want you around, because if I had it my way I would be with you all the time, but I also don't want you to leave New York because of me.\"</p>\n<p>\"Feeling a little self important, aren't you?\" he teases, \"It's not just because of you - I love Laura and Mark, but I miss home, I miss Cory and Cora making my life hell, and I'll deny this, but sometimes I even miss Scott. I miss our woods, and the scents, and - after all this, after everything that's happened, I feel like I want to stick close to home for a while, you know?\"</p>\n<p>Stiles squeezes Derek until his arms hurt, until Derek wraps both arms around him just as tightly, and only then when it is easy to breathe does he say, \"Yeah.\"</p>\n<p>He understands wanting to be close to your home.</p>"
}