{
  "id": "9323225",
  "url": "https://archiveofourown.org/works/9323225?view_full_work=true",
  "author": [
    "Endrina"
  ],
  "title": "The Meaning of Mistletoe",
  "rating": "Mature",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Harry Potter - J. K. Rowling"
  ],
  "relationships": [
    "Remus Lupin/Severus Snape"
  ],
  "characters": [
    "Harry Potter",
    "Remus Lupin",
    "Severus Snape"
  ],
  "additional_tags": [
    "Alternate Universe - Canon Divergence",
    "Childhood",
    "Domestic",
    "Don't copy to another site"
  ],
  "language": "English",
  "series": "Part 1 of The secret language of plants",
  "published": "2017-01-14",
  "completed": "2017-01-28",
  "words": "30,708",
  "chapters": "3/3",
  "comments": "917",
  "kudos": "10,236",
  "bookmarks": "1,648",
  "hits": "184,406",
  "summary": "<p>“Just… tell me. Tell me what is going on, Snape.”<br>What was going on was that Severus Snape had no trouble tracking down one Petunia Evans, now Dursley, to a little town in Surrey where he saw how exactly she was treating her nephew. Which somehow led to last night and Severus knocking on Lupin’s door with a toddler half-asleep in his arms.</p>",
  "notes": "<p>Warning for implied bad treatment of children (not sexual). Emotional and physical abuse in a domestic setting.<br>Also, many of the DADA professors that led to Lockhart’s hiring, which had to had been bad. </p>\n<p>This work is part of a long series. More warnings with future updates, which I hope to do weekly.</p>\n<p>Translation available in Russian <a href=\"https://ficbook.net/readfic/9448537#part_content\" rel=\"nofollow\">here</a>.<br>Partial translation available in German <a href=\"https://www.fanfiktion.de/s/5f0cd2d8000c302c39036bf9/1/The-Meaning-of-Mistletoe\" rel=\"nofollow\">here</a>.</p>\n<p>Podfic by sam Gabriel available <a href=\"http://samgabrielvo.com/lopcasts\" rel=\"nofollow\">here</a>.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a> and <a href=\"#children\">other works inspired by this one</a>.)</p>\n<p>\n(See the end of the chapter for <a href=\"#chapter_3_endnotes\">notes</a>.)\n</p>\n<p>Yes, I know. But the story is continued in The Meaning of Dandelions!</p>\n<p>Mistletoe has many symbolic meanings. In addition to Christmas and the kissing tradition it symbolizes fertility and vitality. It has also been used to symbolize peace and friendship. Hanging mistletoe could indicate a place where violence was forbidden.</p>\n<p>Feedback is love!</p>",
  "text": "<p>“Dumbledore wants everyone in the Order to know” said Snape sullenly in way of greeting.</p>\n<p>Sturgis Podmore was a bit more friendly, like he always was to Remus, but he still looked grim as he relayed the news. Harry Potter had disappeared from the muggle house where he was living. There was no trace of dark magic used but still Dumbledore wanted everyone ready in case they had to fight.</p>\n<p>Remus tensed instantly. His face hardened with concern, his shoulders tight and rigid. His right hand closed around his wand with new strength.</p>\n<p>He listened silently to Podmore’s explanations. There were people investigating already. No, he didn’t have to do anything. No, no, nothing he could help with right now. But Dumbledore wanted everyone on alert and ready to go in case they heard something or they were needed somewhere. This matter had to be resolved quickly.</p>\n<p>Remus nodded, and didn’t say any of the things that were coming to his mind. Remus had amassed a veritable amount of knowledge of the dark arts (enough, he knew, to make his closet friends distrust him during the darker days of the war) and he had learned quickly what professional Aurors took years to realize: that caution and restraint were more important than any spell. Impulsiveness took more lives than any dark creature could.  </p>\n<p>“I am sorry, Lupin” Podmore said as they stepped out of the threshold (they hadn’t even gone in, too much to do right now). Snape looked at him straight in the eye and said nothing as they apparated away to another house, another member to warn.</p>\n<p>Remus went inside wondering if it had been Snape, the person who came visiting last night. Or perhaps this quiet, surly, version was the impostor after all.</p>\n<p>***</p>\n<p>Severus Snape apparated back in the front garden of Remus Lupin’s shabby house hours later, a little bit before dinner time. He immediately discovered that old and unkempt as the house looked, its wards and protections were top notch and also that werewolves were <em>truly</em> strong, even the thin and sick-looking ones.</p>\n<p>“Get off me” he hissed as he tried to shake Lupin off to no avail. Lupin had both of his wrists caught in an iron grip and a knee on his back to keep him down. He quickly uncovered with his free hand a bottle with a clear looking liquid and splashed Severus liberally with it while muttering an incantation. It smelled faintly of something sour and of alcohol.</p>\n<p>Nothing happened. Nevertheless, Lupin still waited a full minute before letting Severus go. He did offer his hand to help him up, though.</p>\n<p>“All right” Lupin said, still breathing a bit quick. “All right” he nodded. His left hand went through his hair twice but the right kept clutching his wand tightly. “It’s you.”</p>\n<p>“For the future, lets agree on a password.” Severus said as he got up and shook the grass and earth from his clothes. The sour smell of All-Reveal potion clung to him.</p>\n<p>Funny. People, and in fact most books, thought that only time or the incredible complex Thief’s Downfall would reveal a Polyjuice user. That Lupin had gone for the significantly cheaper option of All-Reveal was… ingenious. Of course the potion was too weak to revert the effects of Polyjuice, but it would tell if someone had taken it which was more than enough when you thought about it.</p>\n<p>He wanted to be angry. His wrists ached! But this was exactly why he had come to Lupin in the first place.</p>\n<p>“I have a better idea” Lupin said, his eyes were scanning the deserted road behind Severus and he had positioned himself strategically between him and the door. His wand was still pointing straight at him. “Passwords can be learned by third parties, after all. Personal questions are better. For example: Did you come here last night?”</p>\n<p>Lupin was oddly amicable in his hostility. Polite yet threatening, a picture of restraint and control that reminded you that at any moment he could snap and be… not in control. But, just this time, he had the right to be. He smiled a big beautiful smile full of sharp teeth.</p>\n<p>“Yes” answered Severus simply.</p>\n<p>Yes, he had. Scared and distraught and so in need of an ally.</p>\n<p>Lupin’s face relaxed slightly. He was still an image of pure strength, but the look in his eyes changed and his voice was soft.</p>\n<p>“Just… tell me. Tell me what is going on, Snape.”</p>\n<p>What was going on was that Severus Snape had no trouble tracking down one Petunia Evans, now Dursley, to a little town in Surrey where he saw how exactly she was treating her nephew. Which somehow led to last night and Severus knocking on Lupin’s door with a toddler half-asleep in his arms.</p>\n<p>No one was more surprised than Severus. But at the time it had seemed like the only sensible thing to do.</p>\n<p>***</p>\n<p>In all honesty, Remus didn’t know what to make of Snape’s behaviour. Not now, facing the man who was trying to remain calm despite his obvious anxiety, nor in the afternoon with the perfectly composed and detached gentleman, nor the previous night with the anxious mess that had knocked on his door.</p>\n<p>Remus had been bewildered. First at seeing Severus Snape, who might very well had come to kill him, Remus wouldn’t put it past him. Perhaps the stress was becoming too much and he had gone in a murderous rampage of revenge against everyone who ever wronged him. But although Remus could had been firmer with his friends, he should hardly be on top of the list. He ought to have heard of other killings before Snape came to him. Henrietta Bullstrode came to mind.</p>\n<p>Secondly, he noticed with bemusement the fact that Snape was wearing a black <em>Queen</em> t-shirt on top of a plain long sleeved one. With the crown and the four member’s faces. And jeans. Severus Snape was wearing light faded jeans.</p>\n<p>That there was a child in his arms and that it was <em>Harry Potter</em> didn’t register until much later, and by then Remus had already offered him to come inside. It was the polite thing to do after all.</p>\n<p>When Snape asked him to take Harry for the night, he said yes. Remus had met Harry when he was only two hours old and still wrinkled and red in the face. He had sworn to protect him right then, even if it was the kind of oath you made in your heart and not aloud. Remus took Harry from Snape’s arms and watched the young man go, still confused at what had happened.</p>\n<p>***</p>\n<p>Remus admitted, in the light of recent events, that he knew <em>nothing </em>of Severus Snape. Despite having known him for all of his years in Hogwarts whatever his impression of the man was it was wrong and incomplete.</p>\n<p>But there were other things that Remus knew with more certainty.</p>\n<p>Like how children were supposed to cry and be upset when they were taken from their homes. But Harry hadn’t cried. He hadn’t cried <em>at all</em> and he hadn’t asked after his mum even <em>once</em>.</p>\n<p>(Remus had assumed that if Lily’s sister had adopted her son, she wouldn’t make him call her Aunt).</p>\n<p>Remus made him a bed in the sofa and Harry fell back asleep without fuss. In the morning, he made him breakfast which Harry ate quickly and quietly and when he was done he even went to put his mug and plate in the sink, and then took Remus’ and carried them too. </p>\n<p>It was such a surreal situation, looking at this tiny person. This tiny human being that had Lily’s eyes and James’ everything and who could walk and move despite being so, so, small.</p>\n<p>Snape had said that it would be for a short time, that it was an emergency. Having fed Harry, Remus went about how to keep a small child amused and occupied. Snape was right, after all. He did not have anything else to do. He had been getting less and less hours on his job, so that now he was on “call as needed” and he knew he would be fired soon. He was, by far, the best charms caster out of the whole staff, but this didn’t change the fact that he would be permanently dismissed soon. It was the way of the world.</p>\n<p>He got one of his books on creatures (one he knew wasn’t particularly dark and scary) and set on entertaining Harry by pointing at the pictures.</p>\n<p>“This is an illustration of a forest, see? Here we have the trees. Sitting in this tree there is an owl.”</p>\n<p>“Owl” repeated Harry, his eyes in the drawing and on Remus’ finger as he pointed.</p>\n<p>“Very good. And here in this branch there is a flying buzzsnap. It has blue wings and it goes bzzz.”</p>\n<p>Harry attempted a bzz sound as he pointed, too, to the flying buzzsnap.</p>\n<p>“This is a troll” Remus explained.</p>\n<p>“Throll.”</p>\n<p>“Yes. Here, the troll has brown skin.”</p>\n<p>“Brrrown.”</p>\n<p>“Very good! But sometimes they can also be grey.”</p>\n<p>“G’rey” said Harry, his little hand slapping over the image.</p>\n<p>The illustration turned into a grey troll.</p>\n<p>It was… It was very faint. The brown had been kind of dusty to begin with. But there was no denying that what had previously been brown was now stone grey.</p>\n<p>“Oh, Harry. Look at what you did!” Remus exclaimed in amazement.</p>\n<p>“sorry”</p>\n<p>“No, no. That is all right.” Remus said absentmindedly. His fingers caressed the illustration in wonder as the brown slowly came back to the picture.</p>\n<p>“…”</p>\n<p>“Harry?”</p>\n<p>The child was sliding down the chair. He looked around and not finding what he was looking for attempted to get inside Remus’ only and very cramped closet.</p>\n<p>***</p>\n<p>Remus brewed one of the angriest cups of tea of his life. He didn’t drink it. He just brewed it because that is the English thing to do when you are upset. Instead, he got the cocoa tin down and prepared two excellent chocolate milks. One for Harry and one for him.</p>\n<p>They were punishing him for doing magic.</p>\n<p>He was able to perform magic at the tender age of three (five or six years before most kids did anything remarkable) and <em>they</em> were punishing him and locking him in a cupboard.</p>\n<p>The chocolate helped. Seeing Harry smear his face helped immensely.</p>\n<p>By lunch time, there were three cups of tea untouched in the kitchen counter and the table’s surface was barely visible under the books and papers. They had seen three of the pictures in the book, which is a lot considering what little patience small children have. Then, Remus had gotten some paper and a pencil and made Harry draw, which kept him entertained for a very long time and also led to those two new teacups because HE DREW HIMSELF UNDER THE STAIRS. THEY WERE PUTTING HIM UNDER THE STAIRS LIKE A PAIR OF OLD SHOES. Remus was going to MAIM SOMEONE.</p>\n<p>At lunch time, Harry was lifted from the floor where he was playing with a slipper as if it were a car, and sat on the counter from where he could observe Remus preparing lunch and look at all the colourful labels and point all the words he knew. He also learned the word “mushroom” which he found quite enjoyable to pronounce.</p>\n<p>Snape and Podmore came during nap time. When Remus went back inside Harry was just waken, his hair even more dishevelled. He looked at Remus expectantly. Quiet.</p>\n<p>Such a small thing! Utterly dependent and vulnerable. He seemed to know… Harry seemed to know that he was at the whim of adults and he calmly awaited for them to make up their mind.</p>\n<p>Remus felt a wave of protectiveness surge in his chest and he had to look for support in the wall.  Had that been Snape and Podmore? Was it someone in disguise?</p>\n<p>He spent the afternoon checking and updating all the numerous wards and charms in his house, with Harry sitting on his left hip looking at everything with wonder. If Snape had come looking for safety, he had chosen the right place because out of Gringotts or Hogwarts the house had to be one of the most secure buildings in the whole country. Remus knew because he had made it so himself. A house that can contain an adult werewolf inside is a house that can also keep a lot of people outside.</p>\n<p>***</p>\n<p>“She, <em>they</em>… They were <em>not</em> treating him well.” Snape said now, leaning against the counter on Remus’ small kitchen.</p>\n<p>“Yes, that’s the impression I got.”</p>\n<p>Snape paused and looked at him with eyes full of – something Remus didn’t want to explore right now. He waved at Snape, indicating he should go on.</p>\n<p>“I had to take him away from there.”</p>\n<p>Remus absolutely understood and supported that. Still, it seemed that perhaps Snape had forgotten some tiny little detail in his rush to rescue Harry. Like letting people know he was doing that.</p>\n<p>Remus <em>should</em> have alerted people right away; he certainly should do it now.</p>\n<p>But again, Remus was cautious. Just as his father had been rash and impulsive and still was, in a way, although age had taken a lot out of him. Remus took the time to think, always, before acting or speaking. James and Sirius used to make fun of him, said the world could crack open like an egg and Moony would still be thinking. Less often, they would say he was like a locomotive. Hard to start, but unstoppable once you got him moving.</p>\n<p>Remus thought now. How could they discover Harry’s disappearance so quickly yet not know what was going on in that house?</p>\n<p>Snape deserved the opportunity to explain himself.</p>\n<p>“Before I could get to Dumbledore” Snape spoke with a mellow voice that was like warm sheets and the sun on your skin, Remus hadn’t really noticed that before, “they had already found he was missing and…”</p>\n<p>And Minerva had been so sure that it was the muggles. That <em>they</em> had done something. Because apparently she had warned Dumbledore that they were <em>not</em> good people. But Dumbledore had insisted on leaving Harry there.</p>\n<p>Remus nodded and looked to the side, to the kitchen table where Harry was quietly finishing a bowl of rice with vegetables for his dinner. What child ate vegetables without fuss?</p>\n<p>They argued softly (so as to not upset Harry) on what to do, how to break the news to Dumbledore and make their case. Who in the Order could possibly support them. Who would be willing to take Harry once they successfully exposed the Dursley’s unfitness. They talked about it over Harry finishing his dinner and drawing some more and while Remus looked through his things and made a pair of jammies out of an old shirt with a flick of his wand. Remus insisted that the longest they waited the weirdest it was going to look and that they had to tell Dumbledore now, this night. They were still talking about it when Remus called Harry to brush his teeth and give him a bath, because he was quite certain you shouldn’t use <em>Scourgify</em> on a child, and then the talk came to an abrupt end when they realized Harry had a purple ring of bruises on his arm.</p>\n<p>***</p>\n<p>Remus had run out of mugs in which to make tea.</p>\n<p>Harry was once again fast asleep on his makeshift bed on the sofa. The sound of his breathing was the only good thing in the world.</p>\n<p>Both men sat at the kitchen table, the drawings and the mugs between them, and a silence that had mass and density.</p>\n<p>Snape said McGonagall had issued a warning before, and yet Dumbledore had left him there. If they talked to Dumbledore now and he didn’t listen… If there was the slightest chance that Harry was sent back to that house…</p>\n<p>“He is not going back” said Remus at last. His words were made of iron and steel, coal and steam. “I won’t allow it.”</p>\n<p>“No” Snape agreed, simple and quiet.</p>\n<p>***</p>\n<p>Severus knew what it was like to grow with bruises and screams and insults and the acrid taste that fear leaves on your mouth. Lily had been made of light and laughter and he would not have her son sullied so. Even if he was also Potter’s son.</p>\n<p>No child deserved to grow up like that.</p>\n<p>***</p>\n<p>Sometimes, miracles are big and astounding. The waters part, the sky breaks and pours, the stone cries and the dry tree blooms once more.</p>\n<p>Sometimes miracles are something intimate and quiet. Sometimes it is just two enemies finding each other and making a pact for someone else. Sometimes it is just a conversation in a dark kitchen with no apologies extended, but an understanding. Something as simple as finding that he and you have made the same vow.</p>\n<p>Sometimes miracles come to the chorus of a thousand voices, awed, scared; and sometimes the only accompaniment are the soft breaths of a sleeping child.</p>\n<p>***</p>\n<p>It was an incredibly complex operation that they nevertheless managed to complete in a little under two weeks.</p>\n<p>They were both aware they were not suited to be parents. The werewolf and the deatheater. Of course they should not be minding a child! But they were obviously better than the muggle family and <em>how could they trust anyone else?</em> How, after they had let Harry go there? How when they said Harry had to go back? The others hadn’t seen the bruises, may not know about the closet under the stairs, but the muggle family hadn’t even bothered contacting the police when Harry disappeared, even denied there was another child living there when Dumbledore and McGonagall went to talk to them. That should be enough to disqualify them. It should be enough to show that anyone else would be better and that insisting on taking Harry back to the Dursleys was lunacy.  </p>\n<p>They were too young, too. Too young to be anyone’s guardian and yet they were older now than James and Lily had been when they had Harry, older than when they defied Voldemort, rejected him, older than when they made their last act of resistance and died protecting Harry.</p>\n<p>Snape was teaching at Hogwarts now, Potions, rather than DADA as he would have liked, and he was also Head of Slytherin to boot. The youngest Head of House in the records. He could hardly take care of a toddler and people would definitely notice if he were to secrete one in his chambers at Hogwarts.</p>\n<p>Remus, for his part, was on his last few days employed before he got the usual dismissal. He was and always would be unemployable.</p>\n<p>If you looked at it that way, neither of them could possibly hope to be able to protect and raise Harry, not for any length of time.</p>\n<p>But of course Snape wasn’t looking at it that way. Slytherins always have to go at things sideways.</p>\n<p>“I have the money” he said. He had the professor salary <em>plus</em> the extra stipend as a Head of House, and with room and board for most of the year he didn’t have much need or occasion to spend money. Nor did he had the inclination to, not when he was still mourning.</p>\n<p>(He mourned Lily, but Remus knew that, just like him, he mourned the loss of a world where they had had friends, a group to belong to even if it was imperfect. They mourned the start of the age of adulthood).</p>\n<p>So yes, Snape was in a good position to provide.</p>\n<p>“You have the time” Snape went on. “It is the most logical solution.”</p>\n<p>“At the very least, nobody will ever guess that we are working together” Remus answered drily. Logical it may be, but it still sounded mental. <em>Everyone</em> knew Snape hated him, almost as much as he despised James and Sirius.</p>\n<p>So they set to it and it was exhausting.</p>\n<p>Remus spent most of the day taking care of Harry, bathing, clothing, feeding him, but also making him feel loved and safe and happy; while Snape went around doing Dumbledore’s bidding and investigating some residual groups of dark wizards. Then Snape came to Remus’s place to babysit Harry and prepare dinner while Remus went to make a show of looking into the werewolf community as Dumbledore had requested.</p>\n<p>They both attempted to talk to Dumbledore about the Dursleys and they were both shut down. Harry had to be with his blood relatives. It was imperative.</p>\n<p>Harry also had to be happy. That was imperative, too.</p>\n<p>If Dumbledore had no qualms about sending him back, then they would have no qualms about keeping him out of that house.</p>\n<p>(They would be forever grateful to Molly Weasley for suggesting the unthinkable and saying they could <em>imperius</em> the muggles to behave like decent human beings, even if it was categorically rejected.)</p>\n<p>Neither of them knew how or when, but they also found time to discuss and design a safety plan which involved acquiring a house and making it safe and moving Harry there.</p>\n<p>Fortunately, Dumbledore requested their help less and less. People weren’t that inclined to talking to Snape and everybody felt a subconscious fear or Remus. Like, of course Remus was nice and gentle and no one doubted his allegiance (anymore). The poor boy, he had been such a good friend of James. But still, he shouldn’t be near a toddler, you know? Might not be safe, is all.  What if he was feeling a bit peckish and ended eating someone? (even, Merlin forbid it, Harry himself?).</p>\n<p>Remus would cut his own chest open and tear his heart out rather than seeing Harry in danger. So of course he worried too, even though he knew perfectly well that he only posed a threat one night of the month. He worried enough that he voiced his concerns to Snape, because Harry deserved not just better, but the best.</p>\n<p>“You stay with the child” said Snape in way of greeting the next time Remus saw him after this chat. Snape was coming from some Order business since he was dressed in robes rather than jeans. “And you <em>eat</em> anyone who comes after him. You <em>eat them</em>, do you hear me?”</p>\n<p>Of course they both were investigating Harry’s disappearance so as to not arise any suspicions in the Order, but it was all for show. They knew where Harry was! They just had to feign that they didn’t!</p>\n<p>And yet.</p>\n<p>Many of Voldemort’s followers had escaped imprisonment. Many thought that there was something special about the child. That he would become an ever bigger Dark Wizard. That if he were killed, Voldemort would return.</p>\n<p>Snape had managed to uncover some plan from a small group near Bristol to find Harry and… do something terrible to him. Just as Remus had heard some werewolves and northern hags boast that they would eat the little Potter. Remus had thought it little more than pub talk, though. Snape obviously gave more credibility to the Bristol plot.</p>\n<p>Snape made him swear that he would kill them, if it came to that. It was actually an easy vow to make.</p>\n<p>They spent half the night reviewing the list of wards and safety measures for the house. It grew so late that Remus invited Snape to stay and sleep on the couch.</p>\n<p>***</p>\n<p>A child’s mind is a beautiful and complex thing. It is like a palace of white marble in the middle of the desert. Full of air and empty space and yet not much room for certain things.</p>\n<p>The passing of time. There is no room for that until much later, when the ground floor and the gardens are full and construction of the towers begins.</p>\n<p>Life, on the other hand. There is nothing more fascinating for a child than seeing a living thing. This is why worms hold such attraction to little kids. Many rooms are dedicated to store knowledge on life.</p>\n<p>Thus, Harry couldn’t say very well what had happened lately. He still hadn’t gotten a good grasp of time. Plus, he was discovering so many new and interesting things that they were piling over the old ones, covering them.</p>\n<p>He was vaguely aware that there had been another house with a thin hard woman who was like a pencil. She screamed and hurt Harry’s arms, but she also gave him food. The round pink child that used to kick Harry on the legs he had almost forgotten, his memory hidden by a room full of all the interesting looking creatures Harry had seen in a book.</p>\n<p>For some reason, he remembered vividly the room under the stairs where he used to sleep and spend most of the day.</p>\n<p>But he didn’t dwell much on that.</p>\n<p>Then, there had come the big room that was also a house. In there, Harry had learned about creatures and foods. He had also seen a spider by the window. It had an orange and silver back, which obviously made it so much more interesting than other spiders.</p>\n<p>Then came the house that would become home. It had a small garden in front and a big garden in the back where Harry could run and play and look at the plants. It was there that the Baggy Man (the man who gave him an apple, cut in slices, and asked a lot of questions about Auntpetunia and took Harry to the house that was a room, that man), it was there that he taught Harry about blowing dandelions seeds. He told him that the name meant lion’s tooth and that you could eat the leaves, but better in soup and not right away, child, spit that out right now. He talked a lot about all the things the plant could do and Harry listened intently but still forgot many of the words. He remembered that the plant could make you wee, because that is the kind of information that seems relevant to a child.</p>\n<p>The Baggy Man had a big nose and hair that resembled a black plastic rubbish bag. His name was Severus and Harry rather liked him, although after a while he didn’t see him so often. He knew a lot about plants.</p>\n<p>The house that would become home had a kitchen where Harry had a stool with painted pink and yellow flowers to stand on and help prepare their meals. Harry liked raisins and chocolate. He liked cheesy omelettes and the trays Remus made of roasted vegetables, with carrots and potatoes and onions, hot and salty. </p>\n<p>Harry lived with Remus now. Remus was very big and very strong and knew all the names of the things. Remus kept all the bad things away.</p>\n<p>There was also a living room next to the kitchen. It was the biggest room in the house. There was a table and many shelves and things Harry was allowed to touch and things that he wasn’t.</p>\n<p>Upstairs, there was a bathroom. Harry had another stool there. It was blue and it had a picture of a yellow fish. There was also a room that was Remus’s room and then there was a room that was <em>Harry’s </em>room! Harry had a bed and a closet and a chest of drawers that were all his own. It was okay if sometimes the wallpaper changed colours, he wouldn’t be punished.</p>\n<p>In this house, if Harry made noise he was not grabbed by the neck by a big fat hand and locked in the closet. Remus taught him a song about the number of magpies, and Harry would sing it as often as he liked and if he got a word wrong, Remus would tickle him until Harry was squealing and shrieking with laughter. Sometimes he changed the words on purpose and gave four for a ball and six for… chocolate! and then he would run as Remus chased him. Remus always caught him and lifted him in the air.</p>\n<p>***</p>\n<p>The house was a simple cottage near a tiny muggle village (with a pub) and a slightly bigger town (with a store and a primary school) a bit farther away. It was perfect. Close enough to people that Lupin could get the bare necessities and far enough to keep their privacy.</p>\n<p>The walls and the foundations were stone, old and solid. The roof needed repairs which was all right because it lowered the price and they were going to do extensive work in the attic anyway. It should hold a grown werewolf in and not let anyone see or hear anything.</p>\n<p>Not that Harry would be staying in the house when Lupin transformed. Lupin was quite adamant that Snape took him for the night.</p>\n<p>Snape had extensive knowledge of the dark arts, of curses, hexes and poisons. Lupin knew about all kind of creatures and spells and countercharms. It was quite providential that their expertise complemented so well. Lupin knew to bury a silver coin under each corner of the drystone wall that surrounded the house. Snape knew to plant hawthorn and holly on each side, plus some feverfew and angelica by the door. They did the wards together, against dark and not so dark creatures, against wizards and spells, against every curse they could think of. Even against themselves.</p>\n<p>Two weeks after getting Harry they moved in. Snape couldn’t be there, though. He was in a small and seedy pub in Glasgow chatting to some people and feigning interest in buying a dark artefact until the Aurors came to arrest them.</p>\n<p>Two of them had been planning on getting to Harry, had already learned that he used to be in Little Whinging. The third was just an unscrupulous apothecary, the kind that will sell you the ingredients for a love potion and say it is none of his business what you choose to do with it. During the chaos of the arrest Snape got the chance to relieve the apothecary of a box of fairy wings, crushed and dusted and highly illegal. The dust was used as an enhancer and a leave-of-senses. However, if spread in a circle under a certain phase of the moon by someone wearing silver in their left hand, it would make a barrier of confusion and disinterest so that any wizard trying to cross it uninvited would most likely forget why they wanted to do it.    </p>\n<p>***</p>\n<p>It shouldn’t had been so easy for Remus to disappear. No, not disappear. Disappearances leave an absence, a shape. Remus had faded. Let himself be sacked from his job (“what will customers say? I know you are not contagious, but…”), removed himself from wizarding spaces and let everybody’s minds drop his name.</p>\n<p>It shouldn’t had been so easy to step in the role of a father, and yet here he was. Years after accepting he was condemned to a life of solitude, for who would dare share their life with a monster? And how could he impose such a weight on anyone? Two years after seeing his group of friends disappear in less than a week, taking with them what little acceptance Remus had ever known; here he was, with his life now orbiting around a three-year-old.</p>\n<p>In the month he had been taking care of Harry, Remus had changed. A change profound and lasting, he could tell. Even if Harry went somewhere else, Remus would remain changed. His bones and sinews, his very blood was now different.</p>\n<p>Harry had changed, too, so much that he seemed a different child. When he arrived, blinking sleep in Snape’s arms, he had been quiet and gentle and, Remus had thought at the time, quite unafraid.</p>\n<p>Well, that was a big load of hippogriff manure. This Harry, the Harry that had spent a month under Remus’ care occupied on changing him to the core, well he was <em>noise</em>. He was a bundle of songs and laughter who yelled excitedly for Snape to come outside because he had found a pretty flower and who screamed for Remus to catch him as he jumped from the top of the couch and who sung the magpie song all the time as if it were the best thing in the world.     </p>\n<p>***</p>\n<p>The full moon came upon them quicker than expected. By the time they realized it, Snape didn’t have time to brew the Wolfsbane. Which he didn’t know he would have to in the first place because until then he hadn’t thought to give a look to the ingredient cost and the complexity of the recipe and he certainly hadn’t known the absurd prices at which the prepared potion was sold.  </p>\n<p>He had stared in horror, not just at the fact that Lupin had been riding the transformations without the potion, but at his <em>nonchalance</em>. As if it were perfectly natural to have a cure be unattainable.</p>\n<p>“Don’t worry too much about it” he had said. “And remember, don’t let him swallow the toothpaste.”</p>\n<p>He had given Severus an old travel bag full of supplies with the approximate same weight and size as Harry. Apparently, to take care of a child you needed an amount of materials equal to said child. Then he kissed Harry twice, once on each cheek, and reminded him that it was just one night and that he had to be good for Severus.</p>\n<p>There was something of routine to it that made it all the more terrible to witness. Severus had seen the beast (quite closer than he would have liked). Now he saw the man, perfectly collected, undress and lock himself behind all kind of barriers to calmly wait in a cell of his own for the torment of the moon.</p>\n<p>He checked the chains and barriers and heard Lupin do the same from the other side. He picked up Harry and the bag and checked that every window and door were locked before disappearing to Spinner’s End.</p>\n<p>***</p>\n<p>“Oh!” said Harry at reappearing in Severus’ foyer. He immediately pushed himself away with his arms to get a better look. It made holding him most uncomfortable.</p>\n<p>Severus had been alone with Harry before. When he first took him and on Lupin’s cottage. But it was something else to have James’ brat running around his childhood house touching everything. Such entitlement from a young age.</p>\n<p>He did not recall having a VHS player, but Harry spotted it as soon as he set foot on the living room and asked to watch a movie. This, of course, took Severus a while to understand because the original request was to put the singing mouse.</p>\n<p>“There is no mouse” he said. There would be no such idiocy in the house.</p>\n<p>However, Harry was happy enough to instead make a drawing of a grotesque creature with disproportionate big ears and a deformed nose. The monster was called a derivative from Michael.</p>\n<p>Lupin had already fed him dinner, since the moon rose late in the summer. So Severus only had to give him a snack and then keep him entertained until bed time. Harry sung the magpie song three times.</p>\n<p>The toothpaste was strawberry flavoured and Harry did try to swallow it. He giggled at Severus’ frown, full of happiness and mischief. And perhaps the laughter belonged to Potter, Severus wasn´t sure, but the crinkle of his eyes and the way he threw his head back as if laughter were an activity that had to involve all of his body, that was all Lily’s.</p>\n<p>Lily would be remembered as the beautiful witch who married James Potter and gave birth to The Boy Who Lived. She would be remembered as a tragic mother.</p>\n<p>Severus didn’t talk about her, but if he were to describe her as being made of light no one would disagree. It was misleading, however. It gave the impression she was some kind of light spirit, gentle and sweet.</p>\n<p>When Severus said she was made of light it included hard and unforgiving. She was the blinding bathroom light in the middle of the night, the one that makes you regret all your bad decisions and exposes all the lies. She was the presence that filled the room completely and claimed it from the darkness. Looking at her was terrible, because it made you all the more aware of all the bad things in the world, the things that hid in the dark and that you wished you could ignore, but you couldn’t, not with her. She would make you face the world as it really was. She was also a balm. She was the beacon of hope, the lone light in the night that showed not everything had to be dark and scary. She reminded you that, eventually, there would come the daylight.</p>\n<p>She was so much more than a wife and a mother, the brilliant muggle-born girl that refused to let the world be a bad place. God, how he missed her.</p>\n<p>***</p>\n<p>Harry had no understanding of abstract concepts like right or wrong. He did not know what melancholy was, or existential anguish, or happiness. He couldn’t define it and he couldn’t describe it.</p>\n<p>But he was very, very, happy.</p>\n<p>Harry was warm. Harry was fed. Harry lived with Remus who was big and strong and made him feel safe because Remus never hurt Harry and he wouldn’t let anyone else hurt him either. Remus would pick him up and Harry would bury his face in his chest and everything would be good. He didn’t have to be afraid. Plus, not only Remus knew the names of all the things, he was also willing to tell Harry about them.</p>\n<p>Sitting on Remus’s lap, Harry learned the letters and the numbers. Harry was there by himself, so absolutely <em>nothing</em> happened if he said which one was the F and which one was the H before the pink kid did. Harry could say all he thought about letters. Harry liked the letter O because it sounded funny, and the letters T and Z because they were fun to draw.</p>\n<p>Harry liked the number 2 and the number 8.</p>\n<p>One day, Harry saw a robin come to the bushes near the door. It was fantastic! The bird had an orange face and chest and Harry stared at it for a long while.  </p>\n<p>Harry learned another song. This one was about a wonderful woman who had six white horses, and puppies and red pyjamas. Harry’s pyjamas turned red, just like the woman’s.</p>\n<p>Harry had no understanding of right and wrong, but he had experienced both and now, at last, the experience was starting to balance.</p>\n<p>***</p>\n<p>There was absolutely no reason why Severus should spot Mundungus Fletcher twice in Diagon Alley.</p>\n<p>Of course, there was any number of reasons why two wizards who knew each other would go to a wizarding place at the same time. But Severus hadn’t seen Mundungus, he had <em>spotted</em> him. Fletcher was obviously trying not to be seen. (And if he lost that dirty old green bowler hat, he would have much better luck).</p>\n<p>Again, many reasons for that. Or just one. Severus was Severus and not many people tolerated his presence.</p>\n<p>Severus added seven more items to his purchase. Some lady ferns leaves and milk of three different kinds of poppies, so that even a master potioneer would have trouble figuring out what he was going to brew just from the list of ingredients. If anything, the poppies were more suspicious than the aconite. On a whim, he added a jar of honey from white bees. Incredibly expensive and easily replaceable with other types of honey. But its delicacy was irreproducible.  </p>\n<p>***</p>\n<p>Harry turned three years old fifty-two days after his change of life. Remus wished he could do more for him. Throw him a proper party with lots of kids to play with, balloons and funny hats. Harry, however, didn’t miss any of that and was absolutely flabbergasted at being allowed to eat the cake Remus bought him.</p>\n<p>Snape didn’t come. He claimed to be occupied with other matters and Remus kept a calm even face and didn’t call bullshit. It was all right. If Severus had finally realized what he was doing for the son of his sworn school enemy, if he never wanted to see Harry again, Remus would still be there for Harry.</p>\n<p>Besides, he was reasonably sure that Snape would come around. He just needed a few days to freak out. Remus had a muggle bank account and Severus was putting money there <em>and</em> he was brewing him the Wolfsbane potion, even though Remus insisted, because he thought he should, that it was not necessary. Snape argued quite scathingly that of course it was, shut up Lupin, we can’t have you looking like dead warmed over when you are taking care of the child. Or had he forgotten that there were still many people out there who wanted to hurt Harry?</p>\n<p>Snape had a way of going from cold to hot in seconds. Today Harry was Potter’s son and Snape hated him. But every day he was Lily’s, and Snape would do anything for him.</p>\n<p>***</p>\n<p>Harry asked again to see the singing mouse during the August moon. Severus said no.</p>\n<p>He had no idea how, but somehow the child ended standing on the kitchen counter, rummaging through the cabinets and taking bags and cans of food and asking what they were. Severus lectured him on the multiple uses of parsley and to his surprise, the brat remembered that dandelions had a diuretic effect too. So he showed him garlic and clove next, let him smell and touch. He quizzed him later and he remembered most of it.</p>\n<p>***</p>\n<p>Snape brought a VHS player with a small assortment of tapes to the cottage. He spent the better part of an evening setting it up and muttering angrily to make it function in the magical household.</p>\n<p>He gave no explanation as to why he would do such a thing. His frown was so impressive Remus preferred not to ask and retired to a corner of the couch, a cup of tea by his side and Harry in his lap to study all the common household items depicted in an illustration of boggarts’ hiding places.</p>\n<p>Remus didn’t know Severus Snape, but he dared say that neither did his so called friends. They certainly didn’t know this version of Snape who dressed in jeans and long sleeved shirts with muggle bands (sometimes a short-sleeved shirt on top of a long one) who hummed muggle songs to himself.</p>\n<p>That was a funny thought, wasn’t it? Remus didn’t have to guess as to why Snape clung to the long sleeves. Brilliant Snape in love with the older Slytherin students. Remus had plenty of first hand evidence of Snape’s magical talent. He knew how valuable he would be as a follower. No one would let pass the opportunity to snatch him to their side.</p>\n<p>Half-blood Snape.</p>\n<p>Remus was half-blood too, although the fear of his illness had kept him isolated of both muggle and wizarding community. Still, he had grown with the muggle fairy tales his mother told him and she had given him a muggle education, convinced he would never be allowed entry in the wizarding world.</p>\n<p>Remus wasn’t proud or arrogant by any means. The world never let him be. So he was quite fair when he said, even in his mind, that he too was a talented wizard. He had a natural understanding of charms, an excellent memory and a remarkable knowledge of magical creatures’ behaviour. He, too, had received an offer to join the mad group where he would be accepted and appreciated for his true worth.</p>\n<p>Half-blood werewolf Lupin.</p>\n<p>It had been very easy to reject it. Remus guessed as easy as it must had been for Snape to accept it. Remus had had his group of friends and so there was little that he needed in the world.</p>\n<p>Or so he thought. After that night, after Sirius' betrayal… Some thoughts are too horrible to hold, cannot be given shape into words. But he had thought, in his mourning, that they had suspected him, feared him, doubted his allegiance and saw him as the one who would cave and become a spy for Voldemort.</p>\n<p>What a funny little world this was, where the one everyone suspected was always the loyal friend and the one everyone thought would follow Voldemort had become the spy.</p>\n<p>***</p>\n<p>Severus spent the full moon of October in the cottage. Spinner’s End was too cold to stay over, after almost two full months of no use. He could probably have managed, but Harry had been coughing and sniffling lately and Lupin had been on the Wolfsbane for three moons now. He reported remembering everything and being perfectly calm, if a bit bored. It should be safe for Harry to stay, then. Lupin would not try to get out, could not get out (had already ascertained that back in June) and even if something went wrong, Snape would be there to stop him.</p>\n<p>Snape had made a habit of not always being at the professor’s table, so his absences wouldn’t be associated with the full moon (he had figured it out, after all, why shouldn’t someone else?). After class, he took a floo from his office to Hogsmeade, and from there he apparated to Octon, a reduced medieval village whose main feature was its name starting with Oct- and thus being easy to remember as the October route.</p>\n<p>Severus never apparated directly in the cottage (the Blue Cottage, as they had both started to call it to differentiate from the derelict thing where Lupin used to live. Its windows were painted blue). And he never took the same route. Sometimes he made as many as six jumps, sometimes it was just three. In either case, he always stopped at the designated village of the month, to lurk in a dark corner for a while and make sure he wasn’t being followed.</p>\n<p>Was it paranoid? Possibly. But he was an ex-deatheater. He couldn’t afford not to look over his shoulder, specially whenever he wandered away from Dumbledore’s wing.</p>\n<p>He stood by the farm wall for fifteen minutes, until he was satisfied and he apparated once more.</p>\n<p>***</p>\n<p>“Now we see the story, look”, explained the child as the TV screen turned blue and the white letters formed a castle. He seemed inordinately excited at the novelty of having Severus in the house while Lupin was sick and it was dark outside.</p>\n<p>Severus agreed to watching a film because it meant that the child would stay in a fixed position for a determined length of time rather than running around the house and ransacking the kitchen asking questions about food. Severus vaguely remembered having watched animated films as a child, but not many and not often.</p>\n<p>Harry was looking at the screen absolutely enraptured. The story did not wait to pick up the action, opening with a second class offense as a witch performed an illegal partial transformation on a rude muggle. The switch from the crime scene to a picturesque village left Severus at a loss. Particularly when all the town inhabitants performed a choreographed singing number.</p>\n<p>The child seemed to notice Severus’ bemusement. He leaned towards him and confided that the arrogant looking fellow who was boasting in the best Potter brag tradition was not to be trusted.</p>\n<p>And yet everyone in the village seemed to follow his lead, like blind little Gryffindors.</p>\n<p>Harry dutifully pointed that the girl was good, as she liked to read. Other good characters were: Her father. A big yellow horse. An animated candlestick (what) and animated clock (just what) and <em>animated closet</em> (someone must have bribed her way through the Improper Use of Magic Office) a sentient and opinionated teapot (with some resemblance to Molly Prewett, well, Weasley for the last years), and the violent ferocious beast from the prologue. <em>He</em> was good too, Severus would see.</p>\n<p>He didn’t know about the Beast, but the girl had thoroughly rejected the marriage proposition from the arrogant buffoon and it was most satisfying. A pity, that none of the characters felt compelled to break in to song and dance then.</p>\n<p>***</p>\n<p>Harry fell asleep at some point during the process of introducing the Beast to grooming and manners.</p>\n<p>Severus didn’t move. He wrapped Harry in a blanket and let him sleep, feeling his little chest rise under his hand. He left his hand there for a minute, relishing the sensation of his breath and heartbeat while in the TV the cutlery taught the Beast how to brush his teeth or something like that. Then Harry shifted, let a strong breath, and grabbed Severus’ hand and Severus just couldn’t move after that.</p>\n<p>He watched the rest of the movie, like a fool. Gaston’s death was good.</p>\n<p>***</p>\n<p>Remus woke to the smell of breakfast. He dragged himself downstairs, joints aching, and went to make the chamomile tisane that helped settle his stomach. Even with the potion, the transformation was hard on his body.</p>\n<p>“Good morning. How was the night?” he asked, ignoring Snape’s frown at the amount of sugar he was putting in his mug. People who didn’t transform had no business judging his aftercare.</p>\n<p>“We watched a film and I put him to bed.”</p>\n<p>“Ah, <em>Beauty and the Beast</em> wasn´t it? He has been watching it daily. He doesn´t usually get to the end.”</p>\n<p>Remus took a careful sip of the infusion. He felt terrible, but the Wolfsbane meant he would only feel terrible for a day instead of three to five. It was such a difference that even this bad day turned better, knowing that with a nap and a good night sleep by the next day he would be fine.</p>\n<p>“Doesn’t Gaston remind you of someone?” blurted Remus. He had been thinking about it for a while and he didn’t have anyone else to talk about it. (Don’t think why, don’t think why, don’t think why they are all gone). By Snape's expression, he did.</p>\n<p>“He does hold a resemblance to Potter, yes.”</p>\n<p>“What, James? No! I meant…” well, to be fair, fifth year James had been a bit like that. Especially the way he would talk to Lily. Although James never got such a deep and potent voice. “I haven’t thought of that, now that you mention it” he admitted finally. It felt… It felt as if he had to be extra sincere to Snape. As if they couldn’t afford even the smallest of lies.</p>\n<p>Snape looked quite pleased with his admission.</p>\n<p>“But the chin” Remus went on. And because he knew he was right, he deliberately waited until Snape had taken his cup of tea to his lips. “That is Malfoy’s isn’t it? Like a brunet Lucius Malfoy.”</p>\n<p>Snape sputtered tea all over the table. Remus awarded himself a point, even though he didn’t know exactly what game they were playing.  </p>\n<p>***</p>\n<p>It didn’t matter who. It was the words, not the person. A passing remark that Severus was not a spendthrift, precisely.</p>\n<p>No one was going to look in his account to see how much money he had saved. The Gringotts’ goblins could be counted on their discretion. But perhaps one of them would mention that he often changed galleons into pounds. Someone could wonder, what did Severus do with his money and his time?</p>\n<p>He could not afford for anyone to ask that and worse still look for an answer.</p>\n<p>His façade of grim and boring, concerned with potions and not much else would not be enough. People liked that story. The serious character with no life. But once they got in their heads that he must do something to fill his day, suddenly studying potions and collecting stamps or whatever quiet activity they had assigned him would not be enough.</p>\n<p>So Severus put on his long robes and went to one of those establishment that Lucius had shown him, places that don’t quite manage to shake the sleazy air despite the expensive décor.</p>\n<p>The best way to hide a secret is behind another secret.</p>\n<p>He let himself be seen entering the house and he spent what he considered a reasonable amount of time, almost ninety minutes, in one of the lounges with an overpriced drink.</p>\n<p>He let himself be seen exiting the place, careful to appear as if that were the last thing in the world he wanted. The second time he did this, he spotted a worn green bowler hat.</p>\n<p>And now that they thought they had the answers, they would not ask the questions.</p>\n<p>***</p>\n<p>Having watched, or heard, or just been in the same room as the TV played <em>Beauty and the Beast</em> over a hundred times Remus found his limit.</p>\n<p>“We are watching something else” he said to a Harry that was protectively hugging the videotape.</p>\n<p>Harry pouted and did not look convinced as Remus pushed in the first tape he found. The familiar music and the white letters over the blue background mollified him enough to at least release the tape and sit in the couch.</p>\n<p>It was all good for about an hour. Harry liked the fairies and the girl dancing with the woodland creatures and laughed happily at the melting disaster the birthday cake was.</p>\n<p>But then Aurora returned to the castle of her birth right. Remus was making a mental note that the film would come in handy in the future, to help explain why Harry was also living in a cottage in the woods (well, country). Only then Aurora was crying in her bedroom and Maleficent had sent a green light to lure her and they didn’t even get to see her touch the spindle because Harry freaked out and started to cry like Remus had never heard before. He was scared out of his mind and it took Remus a whole hour to calm him down.</p>\n<p>Harry had a nightmare that night and ended up sleeping in Remus’ bed, clutching the t-shirt Remus slept in with both of his fists. He did not have any more nightmares that night, but Remus still barely slept. Once you become a parent, a <em>true</em> parent, your child crying is like a <em>cruciatus</em> in sound form.</p>\n<p>The next time they saw the movie, weeks and weeks later, Remus forwarder past the scene of the green light, and had to let Harry clutch his hand in the final scenes with Maleficent. Mostly, Harry watched the first half of the movie, forwarded to the funny scene of the kings fighting and falling asleep and didn’t even bother with the rescue and Aurora awakening.</p>\n<p>***</p>\n<p>Severus spent barely five minutes in Dechmont, enough to confirm that yes, no one was following him, because that would be the cherry on top of a disastrous night.   </p>\n<p>Nights came so early on December.</p>\n<p>He kept telling himself that Lupin would have gone to the attic. They knew it held him. And he would have taken the potion, anyway. He had just finished brewing it the weekend before and had taken the whole cauldron content to the cottage (in a glass container, goblin crafted, because apparating upset potions and this required the utmost delicacy). Lupin had careful instructions on how to heat and take it and not to add even a crystal of sugar. Snape had seen him take the potion plenty of times now, not trusting him to do it right the first few times. He knew that as much a Lupin complained about the taste, he still drank it all as he was supposed to.</p>\n<p>So Lupin would have drank the potion and locked himself in the attic, just in case. Even if something was wrong with the ingredients and the potion didn’t work (why would that happen, he had brewed it himself, measured the aconite dose four times), there was the attic that they knew could hold a grown wild werewolf.  Harry would be perfectly safe.</p>\n<p>It would no matter that the moon was already in the sky and Snape hadn’t arrived there yet.</p>\n<p>Nights came so early on December!</p>\n<p>He had just enough time if he skipped dinner and went right after the fourth year double session with Ravenclaws and Slytherins. He would have time to spare, even. But he wasn’t counting on a fight breaking between the students (how? Griffindors were the troublemakers) and someone throwing half a bottle of belladonna essence in one of the boiling potions. He had vanished the ensuing toxic cloud quickly enough, but he still had to give them detention, finish the lesson (they would not leave his class without understanding the basics of poison antidotes, those were important) and send some of the students to the infirmary because belladonna was poisonous after all.</p>\n<p>He could still have made it if it weren’t for that fool McKendrick, the new DADA teacher, accidentally hexing himself in the face when he attempted to teach the seventh year students a mirror <em>Protego</em>. The Slytherin Head Girl had come down to the dungeon and drily informed Severus that the DADA professor had lost his eyes and was possibly choking.</p>\n<p>(She would have encountered another professor quicker if she didn’t go to the dungeons. The girl must have been hoping that by the time Severus made it to the classroom the professor were beyond help).</p>\n<p>McKendrick had indeed been choking as all the students confirmed. “His lips were going blue and everything” informed a Hufflepuff. But he had managed to execute a non-verbal spell that liberated half of his face and quite possibly saved his life.</p>\n<p>He had lost his eyes; the girl had not been exaggerating. It wasn’t something as gruesome as empty eye sockets, though. Instead, he had sent his eyes somewhere else and the upper half of his face was now smooth flesh and skin.</p>\n<p>“It was the flourish” the Head Girl confided in a whisper. “He always adds a little flourish to the wand move” she demonstrated, making her wand twirl over her fingers. It looked very nice, if you didn’t mind the possibility of hexing yourself in the face.</p>\n<p>“Can you see anything?” Severus asked as he appointed two students to help the professor to his chair and sent the Head Girl to get the rest of the teachers.</p>\n<p>“It’s all daaaark! Oh, I am blind! Blind!”</p>\n<p>Severus had to identify what kind of charm each student was casting at the time, and what were they thinking, to get a general idea of the combination of curses that had vanished McKendrick's eyes. And then he, plus the seventh year class and all the professors who were free at the time, had to go around the castle looking for dark corners where the eyes could had been sent to. Some of the ghosts participated in the search, too.</p>\n<p>“He was looking at Marzara’s rack” the Head Boy informed Severus while he desultorily looked between the arches of a gallery. “He is always trying to get the girls’ attention.”</p>\n<p>Useful information. Snape would check the Astronomy tower next, as it was and always had been a meeting place for couples.</p>\n<p>Snape couldn’t well leave, at least not until the eyes had been located if not until after they had been reattached to their face. He lost almost two hours with the search and by the end, when they found them in the Ravenclaw’s quidditch locker room, he had been ready to murder McKendrick himself and call the whole thing off.</p>\n<p>He was reasonably sure that Minerva would have his back. </p>\n<p>Severus came in to the house panting, his heart beating wildly and dreading what he would find.</p>\n<p>Harry was on the couch, a bowl of cereal in his lap as he watched the French village sing praises to Gaston.</p>\n<p>***</p>\n<p>It would had been better if he didn’t do anything. The child was well, so Severus didn’t have to worry about anything else.</p>\n<p>He still went upstairs to check on the wolf. He told himself that he wanted to look at the wards, that he didn’t really care if the potion had worked or if Lupin was all right.</p>\n<p>The wolf went to his feet as soon as he opened the door and Severus raised his wand in alarm. But the wolf stopped, froze immediately. It- he looked at Severus anxiously, but he respected the distance.</p>\n<p>“There was a problem in the school” Severus said. “Harry is fine, watching his film.”</p>\n<p>A canine form is particularly suited for showing certain expressions, like relief.</p>\n<p>They descended the stairs together. A werewolf form is also particularly suited to express certain messages, such as “I am going down to check on him and there is no power on this Earth to stop me from crossing that door.” Lupin put his massive head over the railing in the first floor landing and listened to the familiar music of the movie and Harry’s soft humming. He was actually wagging his tail.</p>\n<p>Nothing else should had come from this. Having both assuaged their worries, Severus would descend while Lupin went back to his lair to spend the night.</p>\n<p>Only the animated clock was doing something funny and Harry wanted Severus to see so he paused the film, because he had learned how to use the player better and faster than both of them, and climbed the stairs to go find him.</p>\n<p>“Beast!” Harry screamed.</p>\n<p>He was a Potter, after all, quick to draw blood with wand or words.</p>\n<p>Severus put himself between the child and the wolf. He was sure now that Lupin wouldn’t hurt him, so perhaps he was doing it the other way. So Lupin wouldn’t have to see Harry screaming and crying at his form.</p>\n<p>“Beast! Beast! Beast!” Harry repeated merciless as his father had been. He ducked between Severus legs, crawled under his robes and emerged on the other side, the robes tangled still over his head. He run to the retreating wolf and… hugged him. Pressed his face right against his side as his little arms tried to embrace the massive form.</p>\n<p>There was no sending Lupin back after that. Harry lost all interest in the movie and instead insisted on playing with the wolf. The game consisted on Beast and Harry going on an adventure to help Little Red Riding Hood collect the food she had lost in the forest. Severus found himself in the living room levitating a bunch of apples for Harry to gather while Beast defended the Magic Basket.</p>\n<p>Thank Merlin and Morgana that Lupin was transformed. The look he was giving Severus was full of meaning that Severus did not feel particularly inclined to read. He suspected it was something along the lines of “you besotted idiot” and who was Lupin to comment anyway.</p>\n<p>***</p>\n<p>Seven minutes. That’s how long it will take a child to decide he wants to ride on top of the murderous beast with huge fangs and massive paws. In case you wonder. Shy of seven minutes.</p>\n<p>***</p>\n<p>The wolf was still giving Severus <em>a look</em> later that night when Harry was passed out on top of him, both hands buried deep in his fur. He, the wolf, not Harry, had a kitchen towel wrapped around his left leg as a make up bandage for the injuries suffered when battling the Wicked Pied Piper of Hamelin. There was a sock on the floor that Harry had attempted to use as a bandage for the muzzle, but it kept falling down.   </p>\n<p>Severus still did not want to analyse that look. Severus had his robes open so they would billow behind him and was a bit flushed from playing the aforementioned Wicked Pied Piper of Hamelin, a vampire who lured little children to his cave to eat them. He suspected he would have to play the role again in future occasions, because Harry had <em>shrieked</em> with laughter when Severus chased him.</p>\n<p>***</p>\n<p>In the morning, Snape barely stayed long enough to get breakfast started before apparating back to Hogwarts. He did say he would try to come back later that night or during the weekend, so he at least acknowledged that they ought to talk about the not so disaster that last night had been.</p>\n<p>Remus dragged himself to the kitchen, his muscles aching although not as badly as when he had to transform without potion. That was agony. This was just sore muscles and swollen joints.</p>\n<p>There was bread in the toaster and two mugs with a simple charm to keep them warm. Harry’s milk (in a blue mug that he had chosen himself and which he liked a lot) and Remus’ tea with a spoonful of honey.</p>\n<p>Harry was a bit confused on whether Remus was or wasn’t the wolf. He seemed to accept that he was (Snape kept referring to him as Lupin even in wolf form) but nevertheless Harry recounted the night’s events, just as he always did when he spent time with Snape, although with wild inaccuracies. He told Remus how he and the Beast picked the golden apples to heal Little Red Riding Hood’s grandma.</p>\n<p>“And where was Belle?”</p>\n<p>Belle was with the Grandmother, of course. She was reading her a story to make her feel better until they could get her the apples. Also, Harry fought a vampire. He gave him one of the apples and his fangs got stuck and so he couldn’t eat children anymore and had to eat pea soup. And then they got the apples to the Grandmother and she healed.</p>\n<p>“And then there was a party and everybody was at the party and there was cake. The blue fairy made it. Can we make a cake?”</p>\n<p>“A cake?”</p>\n<p>“For Sevesus.”</p>\n<p>Remus knew where his limits laid. He thought he may have baked something with his mother when he was child, before Hogwarts. He remembered that flour was required and there was no flour at the house.</p>\n<p>“Why don´t you make Severus a drawing of cake? I am sure he will like it.”</p>\n<p>So Harry did just that and informed Remus that Severus would bake the cake with him.</p>\n<p>***</p>\n<p>Lupin would have to spend Christmas with his father. They weren’t close, but he couldn’t just not go. In fact, Severus insisted he went, because they really couldn’t afford to arouse any suspicions.</p>\n<p>Severus had no inconvenience in minding Harry. His mother had passed away a few years ago and if his father wasn’t dead, the bottle would take care of that soon enough. Until then, Tobias certainly wouldn’t show his face in Spinner’s End. Not since Severus became of age and told him what exactly would happen if he dared raising his hand against his mother ever again.</p>\n<p>Severus could had been punished, imprisoned even. He did not care and his father saw it in his eyes because he left that same night. Severus really couldn’t understand why his mother hadn’t been more grateful, just as he never understood why she, a witch, allowed him to treat her that way.</p>\n<p>Spinner’s End was chilly and would only warm up by the time Severus had to leave. Lupin insisted he stayed at the cottage. They could transfigure the couch into a bed for the night and it would only be for a few days. Severus surprised himself by accepting.</p>\n<p>***</p>\n<p>Remus didn’t want to miss Harry’s Christmas morning. He argued that he could just apparate for lunch with his father, whereas Snape pushed and pushed for him to go the night before if it meant looking conventional and unremarkable. Remus found himself sharing way more that he intended of his personal life, to convince him that going the night before would definitely give reason to comment.</p>\n<p>He loved his father and he knew that his father loved him. But their relationship was tainted anyway by Remus’s lycanthropy and his father’s blame. It had been fine while his mother lived, but since she passed away from cancer it had become difficult to hold a conversation. Remus insisted on living on his own and trying to survive in the world, insisted on not depending on his father. While his father seemed convinced that Remus could never do anything for himself (for lack of natural talent or the world’s prejudice, he couldn’t say) and that he had to provide for his sick boy.</p>\n<p>Both wanted the best for the other, yet they usually ended arguing and saying the most hurtful things.</p>\n<p>So Remus stayed and saw Harry’s expression of wonder at his four presents.</p>\n<p>(They had agreed that they would give him <em>one</em> present each, but here he was with one package and one little thing that hardly counted as a present it is clearly smaller than the official present, from each of them).</p>\n<p>Harry got a <em>Beauty and the Beast</em> themed colouring book from Snape as well as a box of chocolate wands. He opened the box and promptly distributed the wands, because it turned out Harry was the kind of kid who shared treats and sweets. Snape bit the end of his chocolate wand in bemusement under Harry’s attentive gaze.</p>\n<p>Remus had gotten him an assortment of plastic cups and dishes of different colours and sizes and his very own set of crayons.</p>\n<p>The crayons he may not have needed. Harry opened the colouring book to a random page and started to colour with his index finger. It probably was the first time Snape witnessed Harry’s magic given how he stared, eyes wide open and brows high. He finished his chocolate wand without noticing, chewing on automatic as he saw Harry fill Belle’s gown.</p>\n<p>“Look!” Harry proudly lifted the book.</p>\n<p>“Very good” said Snape, sounding honestly impressed although as serious as always. “But you have coloured outside the lines.”</p>\n<p>Harry put the book back to fix it and also change the gown to blue, instead of yellow (the result came a bit greenish in certain parts). Snape’s eyes searched for Remus. He looked like a man who had just witnessed a miracle and didn’t want people to know how moved he was.</p>\n<p>***</p>\n<p>Harry ate two whole chocolate wands before Severus took the box away and explained he had to save them for later, which okay, Harry could do. He coloured the whole page of the book, which was <em>his, </em>it had been given to him, and saw in puzzlement as the colour vanished from the paper. Severus, who was a very wise man and knew a lot of stuff, almost as much as Remus (yet, sadly, not how to properly watch a film), indicated that he ought to use the box of crayons for the colour to stay.</p>\n<p>The box of crayons was also Harry’s.</p>\n<p>Harry spent a happy morning colouring inside and outside the lines until Severus called him to the table and presented him with a tasty meal. There was something called Christmas pudding that tasted strong and sweet and which Harry liked very much.</p>\n<p>After the meal, Harry made Severus read him one of his books. Severus did not know how to read the book properly, as he forgot to point the presence of the glass fairies and the flying buzzsnap and the redhat goblins (these were always accompanied by a frown and the hands made into claws, to signal that Harry remembered they were not good and he should never try to touch one if he saw them in the garden). Harry had to do it for him and show him what to point and what to say.</p>\n<p>Even then, Severus pointed at things Remus didn’t. He said things like “This is a fern. Ferns grow in wet places” and “redhat goblins like to hide under nettles. <em>This</em> is a nettle. No, don’t touch it, even in the picture.” Harry retired his finger from the page, staring at Severus. “Nettles burn your fingers, but they have multiple uses. This is why muggles made them a symbol of protection and life and death. You can be sure that something behind a barrier of this plant will be very well protected.”</p>\n<p>“Oh.”</p>\n<p>Remus returned much later that day, when Severus had Harry twisting and squirming out of his arms and almost unable to breath from laughter. Severus was playing the Wicked Pied Piper Vampire of Hamelin, who had the most refined tastes and so insisted in adding salt and lemon and other herbs to all the little boys he captured to eat. This, of course, facilitated the escape of those little boys when the vampire had his back turned looking for the basil leaves. It was all very humorous.</p>\n<p>***</p>\n<p>“What’s this?”</p>\n<p>“It’s a present, Snape. For you.”</p>\n<p>“We said no presents.”</p>\n<p>“We said <em>one</em> present only for Harry, each, and look how much we listened. Just take it, you don’t have to open it if you don’t want to. But it is Christmas, we are working in this together, and <em>I</em> am giving you a present to show my appreciation.”</p>\n<p>***</p>\n<p>Snape had a small package in the inner pocket of his coat robes. He had purchased it without intending to use it, just as an insurance in case the werewolf became emotional and decided to exchange gifts, because Snape would not be put in the position of having to accept a gift without having anything to give back. And no, the Wolfsbane <em>didn’t count, </em>that was just practicality. Lupin couldn’t very well care for Harry if he was in agony.</p>\n<p>Lupin had given him a muggle book of poetry. That was… nice. He gave him the leather calendar in turn.</p>\n<p>***</p>\n<p>Severus suspected that Lupin’s Christmas gift to Harry was some sort of delayed revenge for the VHS tapes.</p>\n<p>Severus had the impression that he spent the remainder of the holidays until his return to Hogwarts sitting cross legged on the cottage’s floor, playing Kitchen and Potions with Harry who sometimes was a vendor of ingredients and sometimes was a cook making a cake but in either case required Severus to pass him the pink bowl and the blue spoon to use as a mortar.</p>\n<p>***</p>\n<p>When Remus woke after the moon of February, breakfast was ready and under a heating charm. There was also a glass bottle. Remus didn’t need to uncork it to get the citrusy aroma of a pain relief potion.</p>\n<p>The last moon there had also been a potion for the sore muscles, which Snape presented and Remus drank without a single word exchanged.</p>\n<p>(Remus would have said thank you, but Snape looked like he would throw the potion to his face if he so much as acknowledged that he was doing something nice exclusively for Remus and not for Harry).</p>\n<p>Remus took a careful sip of the potion. He wished he were better at potion brewing to know if the faint taste of honey he was getting was a required ingredient.</p>\n<p>***</p>\n<p>The school term ended with the expulsion of McKendrick. Officially, he was just taking leave to rest and heal properly from the eye accident, but his behaviour towards the 6<sup>th</sup> and 7<sup>th</sup> year girls certainly didn’t help.</p>\n<p>It had become more obvious after the accident, because sometimes the eyes would detach themselves from the face and follow the girl around, floating gently in the air.</p>\n<p>Snape actually caught the Slytherin Head Girl putting the eyes inside a jar with the probable intention of dropping them in the lake. Since she was being helped by the rather voluptuous Ravenclaw Head Girl and another female Gryffindor prefect he thought it better to let the other Heads of House deal with it.</p>\n<p>***</p>\n<p>It had been a year since Harry was snatched from his home. Only it wasn’t his home and he hadn’t been snatched, per se. During that year the Order had uncovered enough conspiracies and dark wizards to flood the Auror department <em>and</em> the Winzegamot. It had also become a bit more obvious that the Dursleys were not the best foster family.</p>\n<p>In fact, they were worse than some of the plots discovered. The Daughters of the Eye of Ra believed that Harry would be the next dark wizard, more powerful than anything ever witnessed. They wanted to direct that power and scorch the Earth which was bad for the world, but not for Harry who would be treated like a king and in fact had a palace waiting for him somewhere in the Mediterranean.</p>\n<p>This time they sat on the little stone bench in the house wall, rather than on the kitchen, looking at Harry playing in the backyard.</p>\n<p>They could give him back. They could make it so that no one knew of their involvement.</p>\n<p>But he would be sent back to the Dursleys. Dumbledore was weirdly adamant that it had to be. Something about a protection that he couldn’t get anywhere else.</p>\n<p>Perhaps he was starting to think like a Slytherin, but Remus thought that rather than putting Harry in a bad home, not matter how safe Dumbledore claimed it was, they could leave him in a good home where he grew happy and redirect all efforts to making sure no threat whatsoever got near him.</p>\n<p>“It’s our fault” said Snape out of nowhere.</p>\n<p>Remus turned to look at him and became aware that as he was doing so he was also keeping Harry within his vision. Children change you in so many ways.</p>\n<p>“Yours, mine, everyone's” Snape went on. “It’s our fault for letting a one-year-old vanquish the Dark Lord. It <em>shouldn’t</em> have been him. It shouldn’t have gotten to that point.”</p>\n<p>Harry was running around with a tablecloth tied around his neck like a cape. He was acting some sort of story that involved a lot of running and putting a basket over his head. From time to time he stopped, distracted by the three butterflies fluttering between the flowers.</p>\n<p>“He has done enough, hasn’t he? He has paid enough. Enough that we should leave him well alone. Enough that we shouldn’t rely on him for anything else in the future. Not a single demand.”</p>\n<p>Ah, what a fascinating thing were Slytherin minds. What was Snape thinking, guessing, to go and say a thing like that? Why would he imply that Harry would have to do something else in the future?</p>\n<p>In the garden, Harry froze in place as a butterfly suddenly sat on his arm. He looked at it with a smile and offered his finger. The butterfly jumped and perched between his knuckles saying hello with a flick of its wings.</p>\n<p> </p>\n<p>The world kept looking for Harry. Harry, unknowing and unconcerned by this, went on living and learning.</p>\n<p>Harry knew all the letters now, even if he often forgot about Ls. He could write his own name, as well as Remus’ and Severus’, but he usually forgot about the second “e” in Severus.</p>\n<p>He knew the names of all the plants in his garden. Every time Severus came, he made him quiz him and proudly showed him how well he remembered. </p>\n<p>Harry was perfectly happy, as only children can be.</p>\n<p>***</p>\n<p align=\"center\">4</p>\n<p>***</p>\n<p>After the <em>Sleeping Beauty</em> scare, Remus made sure to always watch the films and read the books before passing them to Harry so he would never have to go through another night of terror.</p>\n<p>Most were harmless, but he took <em>Cinderella</em> away because he rightly guessed that Harry would be too upset by the mistreatment from the family. <em>The Sword in the Stone</em> he banned for himself, because the last thing he needed was Harry getting more encouragement to make the crockery fly and dance around the house. He wasn’t doing much yet, but the plastic set he had gotten on Christmas had seen fifty good hours of flying from whenever Harry saw that thrice cursed musical number, and lately the actual crockery was starting to hum or jump with the song. So, no, no more funny domestic magic.</p>\n<p>You wouldn’t think this would be such a common example that he would have to worry about it: Dangerous depictions of magic use in children’s movies. But then he watched <em>Fantasia</em>, which didn’t even have a plot and yet there was a whole scene about magical accidents that of course Harry would instantly recreate given half the chance.</p>\n<p><em>Robin Hood</em>, however, was safe. There were songs and talking animals and later Harry could pretend he was shooting arrows in the garden and overthrowing tyrants with no damage to the furniture whatsoever.</p>\n<p>***</p>\n<p>That November, Severus apparated in Nowton early. He waited around the park, looking at the church’s glass coloured windows while he cast the usual <em>Homenum Revelio</em> to ensure he wasn’t followed. He apparated to the cottage and wholeheartedly approved of Lupin’s frown and discreet behaviour.</p>\n<p>“Snape? What can I do for you?” asked Lupin with a friendly smile. The house’s door firmly closed behind him and his wand ready.</p>\n<p>“Gaston <em>does</em> look a bit like Lucius Malfoy” said Snape and Lupin relaxed. It was the quickest way to prove that it was really him. While it wasn’t strange for him to drop by unannounced, they both tended to be extra tense around the moon. His arrival hours before the sunset couldn’t help but rise all alarms.</p>\n<p>“Shit, I mean, sorry. You gave me a fright” Lupin waved his wand and the air in the front garden cleared. Severus hadn’t noticed before, there was… Not a darkening exactly, but some sort of fog descending over them. Now it felt as if a grey layer had been peeled away.</p>\n<p>“I won’t be able to stay tonight”</p>\n<p>“What?”</p>\n<p>“There has been an… incident. My presence is required at Hogwarts.”</p>\n<p>To his credit, Lupin didn’t argue. He didn’t like it, nor did Severus, but he jumped readily to finding a solution. The night came early, but the full moon wouldn’t appear until a couple of hours later. He could give Harry an early dinner, transform in the attic, and… what? Spend the night there and leave Harry alone downstairs? That wouldn’t work.</p>\n<p>They reached a solution. They would never had come to it by themselves, but they had somehow grown used to thinking together.</p>\n<p>***</p>\n<p>Severus went back to Hogwarts, via two apparitions and flooing from a pub in Oxford to his office. Now that the situation with the lost child secretly living in the woods with a werewolf had been satisfactorily solved, he could attend to the real mess.</p>\n<p>Helga’s Hell, why was his life like this? He rested his head a few seconds, his fingers pressing against the bridge of his nose.</p>\n<p>“Severus?”</p>\n<p>“Yes, Minerva?” he kept his eyes closed and the fingers pressing. It was perhaps rude not to make eye contact, but Minerva would understand.</p>\n<p>“How is the potion going?”</p>\n<p>“About…” he opened his eyes then and glanced at the glittering purple clock floating above a cauldron. “Fifteen minutes until I can add the black locust.”</p>\n<p>Minerva’s hair had escaped from her usual tight and neat bun. There was a stain of something that could be vomit on her left sleeve. Severus wanted to ask, but he feared the answer.</p>\n<p>They waited in silence until the purple clock started to vibrate and emit a clinking sound. Severus vanished it with a wave of his wand.</p>\n<p>He had already measured the essence of black locust earlier, but he did it again. When you are working with poisons, you should measure them every time you give them your back. He added seven drops to the mixture and the potion turned black and then chrome yellow. Severus stirred it with an iron ladle. This was important, too. Any other material and the result would be corrupted.</p>\n<p>“How are the children?” he said at last.</p>\n<p>“We had to move them from the infirmary” Minerva spoke with her eyes fixed in the cauldron and on Severus’ hands. “They could not be contained to the beds and there were more kids that required medical care. One of the Hufflepuff prefects needed attention for various bites and a sprained ankle.”</p>\n<p>There was perhaps a hint of reproach in Minerva’s words.</p>\n<p>“We had to lock them in a classroom” she went on “but a few of them escaped during the transport and are still roaming the castle. Everybody is looking for them. The Gryffindor prefects have corralled two in the bathrooms.”</p>\n<p>Minerva could sound as guilt-inducing as she pleased, implying that Severus had it easy absconding to the dungeons. This wouldn’t had happened if they had hired <em>him</em> as the DADA teacher.</p>\n<p>“Mulcifer had to run in to the lake to shake them off.”</p>\n<p>That gave Snape pause. Mulcifer, like his father, was a big wizard <em>and</em> Severus knew he had mastered quite a lot of hexes and curses. He should be able to defend himself from a bunch of third years, no matter how aggressive they had turned.</p>\n<p>He brought the distiller to the table.</p>\n<p>“It may be best if we vaporize it” he said.</p>\n<p>***</p>\n<p>Remus opened his eyes to a world of silver and shadows, black and white with the barest hints of yellow and blue. He stretched slowly his front and back legs. If he was careful, the transformation into wolf didn’t hurt as much as the transformation back.</p>\n<p>He looked at the door. He remembered. The wolf couldn’t remember, the wolf only knew rage and pain. The wolf would have lashed at the door, trying to escape, and he would have gotten a dose of aconite (grown in their garden) that would put him to sleep before he gave five more steps.</p>\n<p>Severus was reasonably sure the dose would not kill him, but he hadn’t made any promises. Aconite was very toxic, and the one in the garden hadn’t been tested. If its intensity was higher than usual…</p>\n<p>Remus hadn’t minded. He would die, before getting to Harry. He didn’t want to die, but he would do it gladly if the alternative was hurting Harry in anyway. And he trusted that Severus would still look after him.</p>\n<p>That was the most important thing, really.</p>\n<p>But that wouldn’t be the case tonight. Because Remus remembered.</p>\n<p>He waited fifteen minutes, nonetheless. Remus had never been able to afford Wolfsbane, but some months he managed to get enough to pay for the black market version. Only you never knew for sure what you were getting. They often used expired ingredients when they didn’t just substitute them. Snape had been livid when he mentioned it. Remus knew that the alternative potion could lose some of its effects, could make you snap at nothing, barely control the cravings for flesh and blood. Essentially it made the wolf more intelligent but still unable to reign on its fury unless you were completely isolated. Remus had stopped taking it because of that.</p>\n<p>Severus had <em>ordered</em> him to stop taking it and promise not to do it ever again because <em>he could die</em>. In fact, his death was more likely than the wolf actually managing to hurt anyone, improved intelligence notwithstanding. A brew that wasn’t perfectly balanced could already be lethal, if it didn’t even use the right ingredients it was a guaranteed death.</p>\n<p>So Remus waited, like he always did, for the tell-tale signs of a bad dose. He made some mental calculations and thought about the groceries list. There is nothing like thoughts of bread and milk and beans to check if you are about to become a blood-thirsty maniac. If you can still think of how much broccoli to buy (as little as possible, they were getting their vitamins from other sources) you are probably fine.</p>\n<p>He stepped outside, careful of the trap by the door.</p>\n<p>Harry had been playing kitchen and potions. He was now laying on the floor on his stomach, reading by himself one of the picture books he had gotten that summer for his birthday, surrounded by the toys that he still hadn’t put away.  </p>\n<p>Remus pushed and nipped lightly at Harry’s bum to make him put his toys away. The kid knew he was supposed to do it. He was testing the limits of how far he could get away with the Beast, and it squeezed hard at some nerves in Remus’ chest that it was so. That Harry thought that the Beast could be more lenient than the two humans.</p>\n<p>He shepherded Harry to the bathroom to brush his teeth and then to bed. Harry went through the routine pleasantly and since he could not have a story read to him, he picked up a book with lots of big pictures to look at and asked for Remus to stay. He fell asleep in his bed, his head pillowed on Remus’s side.</p>\n<p>***</p>\n<p>With the potion ready, there was no way Severus could beg off the miserable task of patrolling the corridors of Hogwarts, finding the third year students and dosing them (from a safe distance) with the calming potion.</p>\n<p>He entered the girl’s bathroom in the second floor, where Quirinus Quirrell was trying to keep one of the stalls closed by leaning over it with his whole body. His feet were sliding over the wet slippery floor. </p>\n<p>“She bit me!” screamed Bathsheda Babbling, professor of Ancient Runes. She was washing her hand in the sink. “She bit me in the hand as I was casting a Sleeping Incantation”. She looked at Severus in horror. Severus noticed that she didn’t have her wand with her.</p>\n<p>“Oh dear Rowena, help me!” cried Quirrell as the door shook. The wood around the hinges was starting to splinter.</p>\n<p>“I told her, it was better to leave her alone” the ghost of Moaning Mirtle informed Severus. “She was quieting down here by herself. But she said no, and she stood on the toilet on the next stall and tried to hit her with a charm, and that’s when she bit her. It was kind of cool.”</p>\n<p>What was it with female teenagers, alive or dead, that they felt like confiding in Severus? Why didn’t this happen when <em>he</em> was a teenager?</p>\n<p>Severus opened the smoking vial and directed the fumes with his wand to the stall. The door stopped shaking.</p>\n<p>Five minutes later they exited the bathroom levitating the unconscious body of Henrietta Wildgin. Severus saw Minerva and Pomona Sprout go pass running at the far end of the corridor chasing a boy currently wearing only his uniform shirt and one sock. He made sure to take his group through the other end of the corridor.</p>\n<p>***</p>\n<p>“So what happened the other night?” asked Lupin with a glint in his eyes. If you felt like lying to yourself and being a bit too poetical, you could describe them as golden, but really, they were just light brown with a bit of green. They were not gold. They looked like a window open to the forest outside and the smell of pine and wild honey in the wind.</p>\n<p>Severus just couldn’t stand inaccuracies.</p>\n<p>They both had a glass of wine and Remus had put some cheese slices in the middle of the table for their chat.</p>\n<p>“Sauveterre thought that the students would benefit from some practical experience casting <em>protegos</em> and other defence charms.”</p>\n<p>“That sounds very reasonable. Theory can only take you so far.”</p>\n<p>Severus paused and looked at Lupin. He took a sip from his glass.</p>\n<p>“He did not throw rubber or yarn balls at them, did he?” asked Lupin, because <em>he</em> actually had some measure of sense.</p>\n<p>“No, he did not.”</p>\n<p>“Was it hard balls? Stones?”</p>\n<p>What does it mean, when a teacher throwing stones to his students would actually be preferable?</p>\n<p>“No, Lupin, he did not throw stones at the third year students. Because this was a practical exercise, he thought he would have them stop some hexes.”</p>\n<p>“Oh, no” Lupin got up from the chair and circled the kitchen twice with second-hand horror and embarrassment. Actually, it was something he did a lot when he felt strong emotions, walking in circles. “No, no, no… what did he-? Merlin, no, don't tell me”.</p>\n<p>“<em>Furorem Magnum</em>” Severus said as Lupin flailed. “You see, he thought other students would find it <em>funny</em> when their classmates started acting crazy.”</p>\n<p>“Dear Merlin, Morgana and Circe, I can't hear anymore.”</p>\n<p>Severus took another sip of wine. He deserved all the wine for his pains.</p>\n<p>“Of course, these being third year students at their first exercise, they all failed casting <em>protego</em>, and if they didn’t, they soon did after being attacked by their classmates.”</p>\n<p>Soon, the whole class was affected by the curse.</p>\n<p>They didn’t have any trouble overcoming Sauveterre. They went at him madly and in some cases literally biting at his ankles and foaming from the mouth. <em>They had broken his wand!</em> Soon Hogwarts found itself fighting demented and highly aggressive third year students who moved too quickly to get more than one attempt at hitting them with a charm before they tried to bite your nose and tear your ears off. They could only be calmed down with the Deep Sleep potion Severus had to hurriedly brew, and even then some were stirring in their sleep.</p>\n<p>“But why didn’t you just cast <em>Petrificus Totalus</em> on them?”</p>\n<p>“Oh, there was some <em>petrificus</em>, but only partial and they were so enraged they could actually shake them off.”</p>\n<p>Lupin laughed at this. Severus supposed that from his perspective it was funny.</p>\n<p>It hadn’t felt funny then, when you had to face a thirteen-year-old hissing and roaring at you. And, of course, people didn’t want to hurt them, so they hesitated and they got hurt instead.</p>\n<p>The number of injuries was truly embarrassing. Especially when you considered that the third years were not using magic.</p>\n<p>He had to admit that the Gryffindors prefects had truly come to shove, which made Lupin shine with shared house pride. They kept fighting and were unafraid to use some light curses, and so they managed to temporally stop some of the raging students and after the transport fiasco, they helped corral them again.</p>\n<p>The Slytherins prefects had all locked themselves in their rooms, claimed they always did that during lunch and that they were studying and didn’t hear a thing. That despite one of the wild third year managing to enter the common room and the screams of the rest of the students who were left to fend for themselves.</p>\n<p>(Severus suspected this had to do with Mulcifer’s run into the lake. His Slytherins obviously weren’t above sacrificing one of their own to clear the common room).</p>\n<p>Lupin laughed again, loud and clear, at Severus’ telling of how Hagrid had to fish Mulcifer out of the lake. And then he laughed so hard he splashed some wine when he heard of the three girls who got the drop on Quirrell and for some reason claimed his clothes as a war prize. One of them had fourteen torn sleeves on her, so it obviously held some meaning.</p>\n<p>“How?” asked Lupin between shakes of laughter. “How could they? If he was…”</p>\n<p>“Well, Bathsheda Babbling had been bitten earlier on her wand hand, so she couldn’t protect him.”</p>\n<p>“And you?”</p>\n<p>“I had to make sure that I would get all of them with the potion, didn’t I?”</p>\n<p>It is such a nice feeling, talking to someone and making them laugh. Severus found he was quite enjoying himself.</p>\n<p>Next, he would tell Lupin about Minerva growling right back at the boy who had managed to make four sixth year students hide in a closet.</p>\n<p>***</p>\n<p>Snape started to come about twice a month and spend the whole weekend with them. Remus looked forward to it, because he hadn’t had time for himself in over a year. He couldn’t even go get a haircut. He had had to give up on shaving and grow a beard because it was easier to keep.</p>\n<p>But whatever personal errands he had to do, they didn’t take the whole weekend. Saturday evenings and Sundays were just… days. Days he spent with Snape and Harry, when they took him to parks and once to the Botanical Garden and Snape answered all of Harry’s questions about plants and later he also helped with dinner preparations.</p>\n<p>Harry knew the word “variegated”. He could differentiate lobed leaves. He was starting to remember the name of the plants in Latin. Yet he still forgot to put his toys away and consistently put his shirts inside out. Remus kept finding crayons in the most peculiar places.</p>\n<p>On this Saturday Remus returned home from some quick trip to the shops, quick because he didn’t have a curious four-year-old with him, to find Harry standing on his kitchen stool down to his elbows in flour.</p>\n<p>“Remuuuuus! We are making a caaaaake!” he screamed.</p>\n<p>That they were doing. Snape had taken his black robe and was down to the shirt and trousers he wore underneath.</p>\n<p>“Severus is doing the eggs!! I strain the flour!!”</p>\n<p>Harry kept talking exclusively in exclamations for the next two hours. The cottage was soon full of the sweet smell of baking and Harry was given permission to lick the spoon and pans used. That was a spectacle all by itself, the elation he could derive from a spoon.</p>\n<p>Then Harry sat in front of the oven transfixed by the magic that took simple (and tasteless in many cases) ingredients and made them in to something delicious. Forget the occasional levitating object or the changing colour wallpaper in his room, for Harry, magic was in baking.</p>\n<p>And that night, Snape and Remus shared a small glass of wine over conversation as it had, somehow, become their routine.</p>\n<p>***</p>\n<p>Nobody was surprised by the announcement that Sauveterre would not continue as DADA teacher in Hogwarts. Turning the third year students into violent maniacs was bad enough, but when the same thing happened in February with the fourth years, it was harder to find any excuses for his behaviour. Plus, there was the very real chance that if he stayed he would be murdered by Minerva McGonagall, who would no doubt made it look like it had been Severus because that woman didn’t forgive or forget.</p>\n<p>***</p>\n<p>Harry put on weight and Remus had to restrict the amount of candy he was taking.</p>\n<p>(It wasn’t that much candy to begin with. Remus suspected it was his body’s reaction to those two years when Harry wasn’t fed properly).</p>\n<p>That was all right. There were many other things to eat and smell and explore. In the summer, Severus took him to the fields around the house and Harry picked dandelions leaves to wash and make into soup. Severus also taught him how to make his very first, very magical, potion. A simple solution to cure small cuts. Although, really, Harry was still fascinated by the magic that turned plain tasteless flour into deliciousness.</p>\n<p>***</p>\n<p align=\"center\">5</p>\n<p>***</p>\n<p>Harry was turning five and so he would soon start going to The School.  Remus had explained it was a place to go and learn things so Harry was quite happy about it.</p>\n<p>In the week of his birthday, they caught the bus and Remus took him to the big city. They went to the cinema and watched an animated movie called <em>Aladdin</em> that Harry liked very much.</p>\n<p>Remus said that Harry had to be a bit like Aladdin, and couldn’t show people that he could do certain things like the Genie did. Outside the house, it had to be a secret.</p>\n<p>So Harry definitely shouldn’t make the carpets fly, even if he thought the other kids would enjoy it.  </p>\n<p>***</p>\n<p>Remus thought they were very well prepared for Harry’s beginning of school. They had all the adequate muggle papers for one Harry Fleamont (Fleamont, and not Potter, after that grandfather he would never get to know. They didn’t want to risk his name leaking out from the muggle world back to wizarding society. And if Severus had tracked down the Evans to Dursley, so could anyone else). They had the school supplies and a bright and colourful backpack with Lumiére and Cogsworth. They had a child who already knew how to read and write decently and who seemed excited at the prospect of attending school.</p>\n<p>There was, however, something they hadn’t accounted for.</p>\n<p>Snape had been all for making Remus a widower, but Remus had felt a bit uncomfortable about claiming paternity, even if he thought of Harry as his own. They had decided, instead, that he would play the role of an uncle caring for his nephew after the tragic death of his sister and her husband. It was closer to the truth and it left Remus free to talk to Harry about James and Lily if and when the child decided to ask.</p>\n<p>So they had a perfectly good background for both of them. A good tight story that didn’t arise any suspicions, or rather, a story that deterred people from asking questions. They both knew that questions were a danger.</p>\n<p>What neither of them had considered was that from an outside perspective Remus came across like a young, <em>tall</em>, ruggedly handsome man who was selflessly taking care of a child. A bad boy turned good. What neither of them had considered was that Sirius Black (cursed be his name) was the dashing boy of their year, but Remus didn’t look half bad either.</p>\n<p>***</p>\n<p>Remus stood among the group of mothers, and the occasional father, that waited for the children, chatting happily with all of them. He had always enjoyed people’s company even if it was soon withdrawn from him. He was focused, however, on delivering his story right while looking perfectly muggle and conventional; and on listening to the multiple offers of help and advice that were coming his way (the woman who used white wine for cooking was on to something, she would pass him her recipe for chicken). So perhaps Remus could be excused for not noticing right away.</p>\n<p>The mothers thought Remus was<em> adorable</em>. Harry’s teacher, Miss Bliss, thought he was adorable and yummy. Even Mr. Bertrand, the music teacher, looked at Remus once and spent the rest of the term questioning what he knew about sexuality.</p>\n<p>The children left the school. Harry started to run when he saw Remus, a big excited grin on his face.</p>\n<p>Remus crouched to pick him up. His shirt sleeves were rolled up exposing strong arms that flexed and strained against the clothes as he easily lifted Harry in the air. The sun caught in his light hair and he smiled his wolfish smile that did things to people’s bellies and the region just below.</p>\n<p>There was a unison moan behind him.</p>\n<p>Remus didn’t hear it though, because Harry was babbling on his ear about all the things he had done and seen and how he had a chair assigned, which was green, but light green like an apple, not dark green like moss, and there were other children and two of them cried and during recess they could play with even more children, and, and, and.</p>\n<p>***</p>\n<p>The wind was crisp and cold, but the sun was still strong enough to warm them, a jacket or a sweater was enough for a countryside walk. There were still blackberries on the bushes and Harry was happily looking for and eating them. He also had a small wicker basket transfigured from a wicker bowl at home that one of the ladies had gifted Remus. They had put a plastic bag inside and Harry was collecting berries to later put in a pudding.</p>\n<p>Remus was telling Snape about Harry's latest adventures in school and how he seemed the kind of kid who was actually happy to sit and do his homework. It was amazing how curious he was about everything.</p>\n<p>(Sitting was perhaps an exaggeration. At best of times Harry was a blur of movement and sound. Even when he sat quietly and unmoving, the things that surrounded him did not. But he was happy to learn, is what Remus meant).</p>\n<p>It was ridiculously domestic and peaceful, this walk in the country with the werewolf and the ex-deatheater and the child.</p>\n<p>When they returned to the house Harry was sent to thoroughly wash his purple hands and face. He went along, singing a song to himself. </p>\n<p>“Oh, and I brought you this.” Remus looked up, surprised. Snape had a piece of parchment in his hands.</p>\n<p>He had very nice hands. Different from Remus’ own big and hairy pair, but somehow appropriate looking for potions or cooking. Narrow and long fingered and white.</p>\n<p>Remus took the piece of parchment (that in itself was enough to tell him it came from the wizarding world) and read over it quickly. It was an advertisement from a journal, requiring all kind of writers for scholarly topics in a popularizing manner.</p>\n<p>“Snape, what…?”</p>\n<p>“You will have the mornings free now. You could do it.”</p>\n<p>Remus was doubtful. Even more when Snape said he had seen Hewitt, the current idiot teaching DADA at Hogwarts, looking at the advert and pencilling down the information. It seemed like they wanted proper academic writing for articles and short responses to readers’ queries.</p>\n<p>Remus doubted he was the most appropriate person. Although the job seemed easy and so convenient for him! He could write from home and send the articles by owl.</p>\n<p>“You can do it” repeated Snape. There was a bit of anger in his tone and Remus wondered at what it was directed. “You have to. If you don't, he will get the assignments.”</p>\n<p>“Snape, he is a professor at Hogwarts, I am sure we can’t be compared.”</p>\n<p>That, exactly, is what Snape thought. They couldn't be compared. The Slytherin prefects had come to him to complain just after the first month of class. Severus had to give them some bibliography and sign permissions to access the restricted section of the library so they could study for themselves. The man thought you could just <em>stupefy</em> both gnomes and redhats alike.</p>\n<p>Remus stared in horror.</p>\n<p>You could <em>stupefy</em> a gnome, if for some reason you didn’t feel like shaking them a bit to disorient them. Although, of course, Remus was more partial to non-violent solutions like spreading a trail of cheese and breadcrumbs from the garden of the house to another field. The gnomes would be gone in a night, especially if the trail ended somewhere near a source of water and an oak or some other tree that produced nuts. More importantly, this method guaranteed that the gnomes wouldn't sneak back in to the garden within the week, as they often did.</p>\n<p>For comparison, the redhat would punch you on the ankle, and they were strong enough to crack bone. You couldn’t <em>stupefy</em> them. You could, but you would have to be very fast and very nimble or you would soon find yourself on the ground with a swollen ankle and a redhat sitting on your chest. What you should do, instead, was cast a <em>Languidus Flundus</em> which would make a debilitating circle around you, thus keeping your ankles intact. Spraying a mixture of sulphur and <em>geranium robertarium</em> leaves would keep them away, although redhats usually lived by themselves whereas gnomes were gregarious creatures.</p>\n<p>Severus looked at him perfectly impassive.</p>\n<p>Well, no. Not impassive. Remus was learned enough on Snape by now to know he was secretly smiling. He actually smirked outwards a bit as he pushed the ad forward. </p>\n<p>“Don't let that man get this job, please.”</p>\n<p>***</p>\n<p>Remus sent a thousand and five hundred words explaining how to properly deal with gnomes and not to get them confused with redhats. He got a reply a week later, stating the frequency of the assignments and the payment he would receive.</p>\n<p>***</p>\n<p>It had been mere survival instinct. The child, Harry, thought that the Disney songs were among the best in the world, which, fine, they were actually pretty good. They did lose some of their charm after having heard them well over two hundred times, but they were good.</p>\n<p>Only now that he was going to school Harry had been introduced to a series of atrocities muggles were selling under the label “children music” and perhaps Lupin could take it (he claimed to be inured to any kind of music now) but Severus couldn't, he couldn't.</p>\n<p>Why would anyone add a banjo to a perfectly decent folk song? Why the high pitch?</p>\n<p>So Severus took Harry to Spinner’s End and introduced him to Proper Music. He was still too young to fully appreciate Bohemian Rhapsody, but someone had to at least show him there was world beyond songs that listed farm animals.</p>\n<p>They spent the whole Saturday afternoon and listened a sample of almost half of Severus collection until he could get a good sense of what Harry liked. He liked the most rhythmic songs of Queen (good, good start) and Abba (we can work with that). Then he pointed at some opera vinyl that Severus’ mother used to listen to when he was little and again for the most part Harry was too young to appreciate, but he liked some of them.</p>\n<p>At the very last second Severus remembered himself, or rather, the lyrics, and refrained from listening to Boney M’s <em>Rasputin</em>. It was exactly the kind of song Harry would like. But he was also a very inquisitive boy who was not afraid of asking what he didn't know, and Severus knew that it would be up to him because Lupin would argue that it was his fault. Severus didn’t look forward to explaining the socio political events in Russia at the start of the century nor the more private affairs of the royal family.</p>\n<p>***</p>\n<p>Harry discovered that the world was made of songs. Children songs, and folk songs, and adult songs, and songs with no words in them but lots of numbers inside that made you want to dance. Harry discovered that sometimes things that you were feeling inside could take form in music and that, in turn, you could put the music inside of yourself and fly.</p>\n<p>***</p>\n<p align=\"center\">6</p>\n<p>***</p>\n<p>Harry had never seen the sea. This was something that obviously required fixing.</p>\n<p>The idea of taking Harry away from his house, where he was <em>safe</em> terrified both of them. Until they realized they were wizards and they could just apparate to the beach for the day and then go back. Harry would sleep in his warded home where nothing could get him. (And there were still dark people looking for him, just as the supposedly good people did).</p>\n<p>They went to Plymouth. Severus made the jump because he remembered better having been there. They were both anxious and yet they easily blended with all the other tourists walking around the promenade and the families in the beach.</p>\n<p>Harry was delighted. He liked the sea, he liked the sand, he liked seeing other people and running away from the waves and drawing in the sand. They had to quite literally drag him back home, each grabbing a flailing arm while he begged for five more minutes and swore he was not hungry they could go ahead and have dinner without him he would just be here playing.</p>\n<p>They went back every day for a week and Snape was sunburned.</p>\n<p>***</p>\n<p>“I saw your last article. It was good.”</p>\n<p>“Oh, thanks. The editor thought it was appropriate for the season, river and sea creatures.”</p>\n<p>“Very informative, a bit too short, perhaps, but I understand the limitations of the paper.”</p>\n<p>“Yes. I couldn’t really expound each type, so I had to content myself explaining how to best recognize them and know which ones are dangerous.”</p>\n<p>“A pity that it didn’t come earlier. Mr. Hewitt would have benefited from reading it.”</p>\n<p>“Mr. Hewitt…  Do you mean professor Hewitt?”</p>\n<p>“Didn’t I tell you? He won’t be a professor next year, that’s for sure.”</p>\n<p>Remus stopped on his tracks. Snape was sporting a satisfied expression that was very alarming. His voice had more velvet and lemon than usual, which meant there was something big he wasn’t saying.</p>\n<p>“Snape, what.”</p>\n<p>“An encounter with grindylows, I’m afraid.”</p>\n<p>“Grindylows! Those are…”</p>\n<p>“He is missing quite a few chunks of his legs and sides, I am told.”</p>\n<p>“Grindylows live in water” piped Harry, who had been only half listening while he decorated his sand castle with shells. “If they catch you, you have to keep calm and hit them above the wrist and they will release you.”</p>\n<p>Harry didn’t know magic defences quite yet because he hadn’t turned six (not for a couple of weeks yet) and his magic was erratic. But Remus would be damned if he didn’t teach him everything else to protect himself.</p>\n<p>Besides, a wand could be dropped. This method worked always.</p>\n<p>Half eaten by grindylows! Circes’ Curls.</p>\n<p>***</p>\n<p>“Why don’t you use your names?” asked Harry in between bites of his ice-cream.</p>\n<p>“What do you mean?” answered Remus, peering down. They were enjoying quite a nice walk through the streets of Plymouth. “Of course we use our names.”</p>\n<p>“You don’t call him Severus.”</p>\n<p>Ah.</p>\n<p>Well.</p>\n<p>How to explain.</p>\n<p>“Sometimes grown-ups don’t use each other's names unless they are very, very, very, good friends. They use their surnames, instead” said Remus. He thought it was an excellent answer. Better than “we didn’t like each other that much and we only learned to tolerate each other's presence because of you, because we both want you to be all right.” He had become quite adept at this child rearing thing.</p>\n<p>“Mr. Bertrand calls you Remus” Harry said loud and clear, exhibiting the typical unfortunate commentary children are so prone to.</p>\n<p>“Oh, does <em>he</em> now” Snape said in that sarcastic monotone that could be so damn funny when directed to someone else. “And are you very, very, very, good friends with Mr. Bertrand, <em>Mister</em> Lupin?”</p>\n<p>“He is the Music teacher” informed Harry quickly. How could he talk so much when he had such a big ice-cream?</p>\n<p>“No, I am not very good friends with Mr. Bertrand” answered Remus, and because he had to show Snape he could dish them as well, he added “I believe <em>he</em> wants to be my friend more than I want to be his, <em>my dear Severus.</em>”</p>\n<p>“Olivia’s mum says Mr. Bertrand thinks he is in somewhere call a Yenosten-book”</p>\n<p>“Harry, don’t talk so much. Your ice-cream is going to melt.”</p>\n<p>***</p>\n<p>It all started quite as a joke and as a silent fight. But they were both using each other’s names, now.</p>\n<p>And… they were friends. He guessed that’s what they were. Friends who verbally sparred over wine and who never fought when discussing Harry’s wellbeing. Friends who quietly exchanged Christmas gifts but not during birthdays. The most unlikely of friends, but friends nonetheless.</p>\n<p>***</p>\n<p>Severus had thought there was something strange about the new DADA teacher. He got a weird impression of him.</p>\n<p>For example, he was quite sure that on Monday he was wearing a female brassiere under his clothes. Severus didn’t see it, but the way the robe creased on his back was quite distinctive. Given that Chadwick was a tall broad man with the typical boxer broken nose, the brassiere was clearly an unnecessary wardrobe choice as he lacked the breast development that usually required additional support. Severus, or course, didn’t mention it and didn’t judge. To each their own. If he enjoyed wearing female lingerie that was no smell off Severus’ cauldron.</p>\n<p>He had seen weirder things. He wished he could say he had witnessed them at the establishments Lucius favoured and Severus still visited every few months to protect his private life, but the truth was most of it came from the Slytherin dorms and from his deatheater days, which many would say were one and the same.</p>\n<p>Still, it was just a feeling. He barely saw the professor otherwise. He was usually absent from the meals and he had only come twice to the professor’s common room.</p>\n<p>He was not the only one who thought there was something about him, though.</p>\n<p>It was Filch, however, the one to raise the alarms about Chadwick when for the third time in as many days he caught students playing outside in the garden when they were supposed to be in their DADA class. Cross examination of said students revealed that Chadwick was only very occasionally going to class and never with the sixth years, who were studying the subject on their own.</p>\n<p>The Heads of House, plus Dumbledore, met with Chadwick who after barely five minutes of interview broke down and started to cry, saying that it was all a joke that went out of hand and that she was oh so very tired and very, very, sorry.</p>\n<p>***</p>\n<p>“Nymphadora Tonks” Severus said. “She is, of course, Andromeda Black’s daughter and most importantly in this case, a metamorphmagus.”</p>\n<p>Remus buried his face in his folded arms. His shoulders shook with laughter. He could not form any words for the next minute. He emitted something close to a whine, though.</p>\n<p>“Oh, my… Oh, dear… How- How could you not notice? Severus! One of your students.”</p>\n<p>“She is not in Slytherin” Severus informed with a perfectly calm tone.</p>\n<p>“What?”</p>\n<p>“I resent your prejudice. That kind of trouble making is more according to your house.”</p>\n<p>“Yes, but I can’t believe Minerva wouldn’t notice it! You have plenty of other things to think about” Remus smiled (Mr. Bertrand the music teacher had a lot of thoughts about that smile.) Severus nodded in acceptance of the hidden apology in Remus’s words and, unlike the music teacher, did not dwell on the smile <em>at all</em>.</p>\n<p>“In any case, Miss Tonks is a third year Hufflepuff.”</p>\n<p>This time even Severus had to chuckle.</p>\n<p>The thing is, they didn’t know what happened to the real Chadwick. Tonks said she had seen him in the Hogwarts Express, that’s where she got the image to copy. But then he didn’t come to class on Tuesday and her group of friends thought it would be so funny if she went and taught the Slytherin/Gryffindor third year DADA class…</p>\n<p>They found an emergency replacement, so that at least the fifth and seventh years had someone to help them prepare for the exams. Young Leikam had graduated from Hogwarts the previous year and everybody still saw her as the Ravenclaw Head Girl. But she had Exceed Expectations in her NEWTS (the highest qualifications in the last three years, Outstanding grades in DADA Newts were rare) and she was available, so they made do with her even if she still called professor to her now colleagues and trembled in fear of Filch. </p>\n<p>***</p>\n<p>Sometimes, usually when they were around the school, Harry referred to Remus as Dad.</p>\n<p>He knew he wasn’t his real dad. Sometimes he also called him Uncle, or Remus. But with school, it was just easier to call him Dad, rather than “Man who is acting like my dad because my Mum and Dad died in an accident and my other Aunt is very, very, bad.” It was just a mouthful, especially when you were arguing with the other kids over whose Dad was better.</p>\n<p>He had suffered a lot of anguish, for a while, at the thought of being adopted and at his parent’s deaths. There was something very much like the smell of sweat, and tangled sheets over your face, in the knowledge that his parents were dead. That he had been all alone once. It was a fear and sorrow that took over everything, like a room with a slanted ceiling.</p>\n<p>Remus noticed somehow. Even if Harry didn’t say a word, Remus knew and he sat Harry on his lap and told him that he loved him the most out of the whole world, that he loved him now and he would love him tomorrow and the day after that, <em>always</em>. That he loved him even if Harry ever did something bad. Harry would be loved forever and as long as Remus lived Harry would not be alone in the world.</p>\n<p>That and a chocolate wand after dinner was all Harry required to put existential anguish out of his heart. It is a great thing to know you are loved.</p>\n<p>***</p>\n<p align=\"center\">7</p>\n<p>***</p>\n<p>By the time Harry was seven Remus thought they may have rescued well over half a dozen birds. All nursed back to health by Harry. They even had a dedicated shoebox now for the injured birds.</p>\n<p>This was the age when most wizards and witches started to show some magic ability. In Harry’s case, it was the age when he finally started to show some restraint. Magic was now limited to first days of snow, very sunny days, days when Severus accepted baking something with him, days when there were fireworks and every time there was a particular piece of music on the radio.</p>\n<p>It was a vast improvement over the age of four, when Harry mimicked everything he saw on the TV and made the silverware dance.</p>\n<p>Remus was making a bit of money now, thanks to his articles for <em>Magical Review</em>. He wasn’t wanting for anything, but he also very rarely spent on himself. He had grown used to being careful with what little money he earned and when he started… this. Well, he got what was best for Harry but it was different, using Severus’ money on himself. Especially when he was already getting the Wolfsbane for free.</p>\n<p>Now, Remus could buy himself a wool sweater if he wanted, or a bottle of wine once in a while, rather than letting Severus always be the one to bring it. And, on Christmas, he could get them decent gifts. A set of books for Harry and a pair of silk black gloves for Severus. Thin enough that he could still use his wand or stir a cauldron, but a welcome layer for the humid chill of the dungeons.</p>\n<p>***</p>\n<p>It was the most bizarre affair.</p>\n<p>Brennan, DADA teacher after Miss Leikam, came well recommended. He had defeated that hag in the northern countries and studied snow and ice creatures in depth. Rumours said he could speak with wolves although Severus doubted it and Remus failed to see what a wolf would have to say to the man. He was tall and broad shouldered, blue eyes just like the ice he knew so well, and a shock of red hair despite no known Weasley connection.</p>\n<p>Now this man was lying at the bottom of the Gryffindor tower. Given Madam Pomfrey’s expression, he wasn’t in any condition to explain how he had come to be there, but evidence suggested he had somehow entered the Gryffindor rooms (for which he had no clearance) and once there located a window from which to jump to his current position on the ground.</p>\n<p>It made absolutely no sense. The castle wasn’t short on windows or heights, precisely, that you would have to resort to breaking into the rooms of one of the houses. Besides, no one could see why Brennan would want to jump anyway. He was popular and attractive. <em>Witch Weekly</em> had featured him in the month of December and again in February in the “Twelve wizards to fall for” section. The magazine argued that Brennan’s beard was reason enough to include him.</p>\n<p>McGonagall was interrogating the students, of course, but so far she hadn’t learned anything. Most of them were gone to Hogsmeade or preparing for exams, so it wasn’t impossible that no one had heard or seen him.</p>\n<p>Severus sighed tiredly. Brennan had seemed like a nice fellow, but there had been something in his eyes Severus didn’t like. He wouldn’t say it was coldness just because they were ice blue and he knew so much about winter creatures, but they were calculating even when his smile was so warm. Also, his stupid beard was stupid and Severus had seen better.</p>\n<p>He volunteered to wait with the students gathering outside while McGonagall interrogated the prefects in her office one by one. Severus had come to accept his powers, strange and undesired as they were.</p>\n<p>He only had to stand by the window at the end of the corridor short of ten minutes before a teenager girl sidled to him. Severus said nothing. Others would have greeted the girl and possibly offered her candy, but Severus had learned that it was best to let them gather their thoughts and courage in peace.</p>\n<p>Although this one was taking more time than usual. Severus was starting to get bored by the view. Besides, there was a draft by the window.</p>\n<p>The next time a professor came by, Severus made sure to make a disparaging and utterly inappropriate comment on Brennan. Flitwick looked taken aback and Quirrell stuttered so much he stopped talking altogether and had to be gently guided away by Flitwick.</p>\n<p>But, as soon as they turned the corner, Severus found he now had two students next to him and it didn’t take them long before they started to speak.    </p>\n<p>***</p>\n<p>It definitely was the most bizarre affair. The matter wasn’t helped by the ridiculous Gryffindor solidarity and their refusal to speak. That in itself should have told the faculty all they needed to know. If the students were protecting one of their own, they must think he or she was in the right.</p>\n<p>It took Severus a while, and half a dozen hushed conversations in the corridors and the stairs. He still didn’t know what exactly had happened to Brennan but he knew <em>why</em> and honestly he didn’t care if the complete Gryffindor fifth year had decided to beat Brennan to death with the Quidditch bats and later thrown him over the window to hide the evidence.</p>\n<p>(Unlikely, unless they had a friend in Slytherin, which Severus knew they did not. Besides a Slytherin would have told them to do it from another tower).</p>\n<p>What Severus knew, and this is what he explained in the emergency meeting at the Headmaster’s office later that night, was that Brennan had been circling the Gryffindors for a while now. And that he may or may not be related to young Elderberry (fifth year, strawberry blonde, hilariously big front teeth that gave him a lisp) who would be inheriting quite a considerable sum of money upon reaching the majority age.  However, if some regrettable accident were to befall poor Elderberry the fortune would pass to his maternal cousin Marcus Cesario Brennan.</p>\n<p>Had Brennan accessed the Gryffindor tower with a nefarious purpose? It was hard to say since Elderberry hadn’t been there at the time. He had spent the day in Hogsmeade and, funny thing, there were at least three students from different houses that could attest at having seen him at all times.</p>\n<p>It was agreed that Brennan had gained unlawful access to the Gryffindor tower and that the spirit of Godric Gryffindor himself rose to the defence of his students. And if someone else noticed the dark hairs in Brennan’s robes or the red marks on the neck of one of the sixth year students, no one mentioned it. Certainly Severus didn't.</p>\n<p>***</p>\n<p>The Brennan affair unfortunately opened once again the case of the missing Harry Potter. Not on the papers or the public opinion, thankfully, the public never even learned that Harry was missing. But between the old members of the Order that still kept some contact.</p>\n<p>There was nothing to say, really. They hadn’t discovered anything new other than the occasional plot and the usual rumours. But Severus felt a bit more disappointed and disenchanted than usual when he heard the same old repetition of “Harry must be with his relatives”. Look at Elderberry’s relatives. Look at Harry’s.</p>\n<p>***</p>\n<p>Harry could make ladybugs walk around all the fingers of his hand before flying away. He could also get butterflies to perch on the back of his hand. Birds didn’t fly away from him and they let themselves be petted, which Harry loved because their feathers were very soft.</p>\n<p>Harry would very much like to have a dog, but Remus said no and that it was enough that he had a wolf once a month. He asked Severus, too, just in case, but he said the same thing. Harry contented himself with petting every dog he came across, and every cat. He also talked to Mrs. K.</p>\n<p>Mrs. K lived in the creek near the school grounds. She had a yellow ring right behind her head and the rest of her body was dark green. Mostly, she talked about the frogs she had eaten and about keeping away from the birds that would try to eat her instead. It wasn’t much in the way of conversation, but Harry liked talking to her either way.</p>\n<p>There was a field trip with the school and Harry saw a horse, a cow and pig. He petted all of them.</p>\n<p>***</p>\n<p align=\"center\">8</p>\n<p>***</p>\n<p>When Harry turned eight he received a Walkman and three cassette tapes. Every single object in the house jumped one inch in the air and stayed there for an hour, so happy was Harry. And for the rest of the week the spoons vibrated gently every time Harry listened to his music.</p>\n<p>That summer Harry learned how to ride a bike and Severus and Remus found themselves taking increasingly longer walks around the country trails so Harry could practice.</p>\n<p>Remus now associated Severus with the smell of grass and daisies under the summer sun.</p>\n<p>Severus spent the summer in Spinner’s End, officially. But more often than not he stayed over at the cottage. Plenty of his things were there from his weekend visits during the school term, and it was as simple as casting <em>Engorgio</em> on the couch so he could spend the night. Severus made breakfast and taught Harry about food and music. Remus prepared lunch and gave Harry the very best books to read.</p>\n<p>***</p>\n<p>Remus had a weirdly specific mental image of Teresa. She was the housewife who greeted everyone warmly and offered them tea and then excused herself a second to go check the cake she had in the oven and when she returned she had a sawed-off shotgun and she killed the mobsters that had come looking for her brother/husband/son.</p>\n<p>He couldn’t tell exactly why. Particularly when she herself admitted to not being a good baker.</p>\n<p>Teresa had two children. Eddie, who was a kid of thirteen or fourteen and Olivia who was a year older than Harry but since there weren’t that many kids in the school they had become close friends. Teresa was divorced and worked at the reception desk of a nursing home two towns over, where the high school was.</p>\n<p>Remus had a good relationship with her. All the other divorced mothers (and the widow) had flirted with him one way or another when he first started taking Harry to school. They were all lovely ladies and they meant well, but the attention was awkward nevertheless. Teresa had divorced just then and had no interest in men. She had made no passes at Remus and so she was the first to befriend him.</p>\n<p>When she had the evening shift her eldest, Eddie, picked up Olivia from school. But two days a week he had drama practice and so Remus picked Olivia and Harry and helped them with their homework (“it is not due until Friiiday” “I don't care. You do it now.”) until Eddie came to pick his sister.</p>\n<p>Eddie was quite possibly one of the most awkward teenagers in the British Isles. He was shy, un-athletic, sensitive and obviously upset about his parents’ divorce. He also sported a very unfortunate haircut.</p>\n<p>Harry adored him and thought he was the epitome of all things cool. Not that the opinion of an eight-year-old matters much to a teenager. But still, Harry loved him. He loved that he had Asterix and Tintin books (that he and Olivia read together sitting on the floor, their backs on the couch), that he would talk to Harry about animals and that he knew Star Wars and would have the final word on the debates on whether or not there were girl jedis (yes) and what people ate on Tatooine (potatoes. They grow them on the sand).</p>\n<p>Harry was attracted to kindness, and he had a way to make you a better person just for fear of disappointing him. Why, Severus willingly ate ice-creams now because Harry couldn’t conceive that a person wouldn’t like ice-cream.</p>\n<p>Remus always made a point of talking to Eddie and praising him for his interests. He could tell that although Eddie acted as if it didn’t matter and he didn’t care, it meant something to the boy that an adult would think his love of stars and animals had value.</p>\n<p>“Harry is showing” said Teresa one day, as the kids were playing in the square. It was a bit too cold to just stand in there, but the running kids were perfectly fine. They were sweating while Remus felt the cold seeping in through the sole of his shoes.</p>\n<p>“Showing?”</p>\n<p>“His magic” Teresa said as if it were perfectly normal and they were not in the mugglest of muggle villages. “I am sorry. You do know, don’t you? You looked like a wizard to me. You have a wizard name.”</p>\n<p>Remus was aware that his mouth was hanging open as he looked at the woman. She wasn’t looking at him. Her eyes were trained on the kids, who were currently conquering the castle that used to be a stone bench.</p>\n<p>“I… I really don’t know what to say.”</p>\n<p>“You don’t have to say anything.”</p>\n<p>Teresa was quite possibly the greatest muggle Remus had met.</p>\n<p>“Yesterday the kids were playing” she went on “and Harry levitated a stone. I don’t think he intended to do it, they were playing jedis, and he looked quite surprised. But you should know.”</p>\n<p>“Thanks. I will have a word with him.”</p>\n<p>To further prove that Teresa was a queen, she switched the topic to the school raffle next month and how she was not looking forward to baking a carrot cake and having to bid on other people’s crap.</p>\n<p>***</p>\n<p>It turned out that Teresa had been married to a wizard. She had a Clause 73 Exception and everything, which Remus didn’t even know existed, that registered her as a “Knowledgeable Muggle” putting her in the same category as squibs. Mostly, it meant people could do magic in front of her without breaking any laws and without her having to be Obliviated.</p>\n<p>Not that she cared. She was not impressed with the wizarding world and no amount of charms would change her mind.</p>\n<p>The reason was Eddie. Sweet awkward Eddie who had turned eleven and had not received a letter from Hogwarts. He didn’t have to. It was all right; Eddie was a great boy.</p>\n<p>“He really is” Remus agreed. Any boy willing to design and draw a coat of arms in a t-shirt for his sister to wear when she was playing knights had to be good.</p>\n<p>But Teresa’s husband disagreed. They had spent three months fighting, three more living separately and trying to fix things and before the year had ended they had divorced.</p>\n<p>“I suppose it was all right for the wife to be a – muggle, isn’t it? Just a hot piece to keep at home waiting for him” Teresa said. In her voice there was smoke and gunpowder and the deceiving smell of something sweet in the oven. “But not the boy. The boy had to be a wizard and carry his legacy out in the world.”</p>\n<p>Remus didn’t understand. Harry could be a six legged squib with red eyes and he would still love him with all his heart.</p>\n<p>So yeah, Teresa was not impressed with the wizarding world. Especially because she hadn’t failed to notice that once it became clear that Eddie wasn’t remotely magical, the ex hadn’t wanted to wait around to see how Olivia turned out. It was the boy or nothing. And it would be nothing for that man, whereas Teresa loved her children with all her soul.</p>\n<p>***</p>\n<p>Oddly enough, Severus barely spoke of this year’s DADA teacher. He only said that she was competent, which was wonderful praise considering the latest professors.</p>\n<p>She was a bit more than that. Kayla Miller was good at charms and counter curses. She had an award winning smile, big breasts, and the open and confident personality of Americans. She was perhaps a bit too informal for the hallowed halls of Hogwarts, but she was very well liked nevertheless. She played sports, she laughed loudly, she was always there for any female student in need of advice. She certainly didn’t plan to murder anyone.</p>\n<p>She also made her interest in Severus known quite clearly, not seeing the point of the British ceremony and shyness.</p>\n<p>And Severus said no, not knowing exactly his reasons why other than the fact that she was all <em>wrong</em> while he could recognise her multiple virtues.</p>\n<p>She was kind, she was smart, she was very strong. She got the cutest freckles in her cheeks with the sun.</p>\n<p>Yet she was lacking something. Severus didn’t know what, other than she wasn't it.</p>\n<p>She left at the end of the course to the students’ disappointment. She had gotten a better offer at a private academy and as she said, glancing aside, no one gave her a good reason to stay.</p>\n<p>Her words were devoid of anger. Pure and white acceptance that it was not to be, <em>that’s</em> how good she was. Severus wished her all the best.</p>\n<p>Just in case, Severus increased his visits to the sad brothel. <em>Exquisite Lounge for the Discerning Gentleman</em>, was the name in the card, but to Severus it was a sad place that only the very arrogant (like Lucius) or the very cruel (Mulcifer senior, the Lestrange before they went to prison, Dolohov) could enjoy.</p>\n<p>He hated the place. But he needed it now, to justify why he would pass over such a pretty, funny, woman like Miller. He had to present himself as socially inept (already there) and a pervert (Hell, no, not all. Maybe a bit during his Hogwarts years, but funnily he had had the tamest thoughts since before Harry). Make himself look like he didn’t know and didn’t want to know how to talk to people. Like he couldn’t appreciate Miller or was too scared of rejection when she got to know him better.</p>\n<p><em>The Lounge</em> prided itself on its discretion, and it had to be if a Malfoy gave it their patronage. So Severus didn’t even have to bother going for the full service to keep his cover. To be seen entering or leaving the place was enough. So he could just lay down in one of the multiple rooms, drink the overpriced alcohol and wait an appropriate amount of time.</p>\n<p>It was, unfortunately, an excellent time to ask himself why in Helga's Hell he hadn’t fallen for Miller. She had all the good traits that had attracted him to Lily, while being different enough that she wouldn’t be just a substitute. And she had been interested. Someone actually thought Severus was deserving of attention and desire, if not love.</p>\n<p>And she had no other intentions as far as Severus could tell. That was a first.</p>\n<p>So why the hell not? What exactly did she not have that Severus wanted?</p>\n<p>…</p>\n<p>No, actually, let’s not answer that. Never mind. It was a stupid question that Severus should not have asked. What he should ask is whether there was a way to reverse amortentia and make you stop feeling in a certain way about someone.</p>\n<p>***</p>\n<p>Remus took Harry to the local doctor on schedule, and got him all his shots and all his check-ups and always left the consult with a fuzzy feeling at the notion of Harry being healthy.</p>\n<p>This year they discovered he needed glasses, which was expected. Remus bought him a pair with green frames. The paediatrician was also a bit concerned that Harry exhibited some signs of hyperactivity and attention deficit, but not enough to get a diagnosis. Harry could pay attention, he did, in fact, to an outstanding level. And he had a wonderful memory. He could not, however, remain still for a long time.</p>\n<p>Which didn't necessarily interfere with what he was doing. Remus wouldn't trust Harry with a pair of scissors, but otherwise he could read, draw, cook and brew, watch a movie and play a game. Only there would always be some part of his body moving at the time.</p>\n<p>(And that was <em>good</em> because if Harry was moving his leg then he wasn’t moving the chairs around him).</p>\n<p>***</p>\n<p>This year Harry learned what it was to love, truly love, people beyond the house. He also learned to control his magic better and to take deep breaths when he was agitated.</p>\n<p>The wallpaper in his bedroom now changed colour because Harry wanted it, most of the time, rather than because he was feeling something.</p>\n<p>Also he had been given the marvellous gift of glow in the dark stickers shaped like stars, which Harry would say was the relevant thing here if one were to ask Harry what he thought about his year. The stickers were awesome. He put them on the ceiling over his bed and he stared at them every night before going to sleep.</p>\n<p>***</p>\n<p align=\"center\">9</p>\n<p>***</p>\n<p>Lyall Lupin passed away on a Wednesday.</p>\n<p>It shouldn’t have been a surprise. He was old and he had been sick for a long time. Yet Remus still felt like he had been robbed of something, once again.</p>\n<p>Teresa offered her condolences and said that of course Harry could stay with them for a couple of days while Remus went to the funeral. Harry had been extremely sad at the idea of Remus’ father dying, obviously extrapolating from his own fears of being orphaned once again. But he was also quite excited at spending more time with Olivia and the kids had already planned every hour of the day.</p>\n<p>Lyall Lupin had been well known and respected. There was quite a lot of people from the Ministry in attendance and a few from the Order. Remus shook hands with all of them and hollowly thanked them for coming, faces and names blending one after the other. It was better this way. Otherwise he might start noticing the pitying glances, the sorrys charged with meaning. The question nobody dared asking on what was he going to do now. The poor young werewolf, lost in the world without his father’s help. And those were the ones who knew about his lycanthropy. The others weren’t even sorry for him, thought it was about time he let go of the losses of the war and got himself a proper job.</p>\n<p>There were less people in the cemetery and less still on his way back to his father’s house. But Dumbledore was there. Dumbledore with his golden half-moon glasses and those twinkly blue eyes Remus used to love and then had learned to distrust, breaking his heart. He used to revere those eyes and that kind voice, like you do with a benevolent god. Dumbledore had given him the chance to study at Hogwarts, to make friends, had given him what no other wizard would and he had gained Remus’ love and loyalty.</p>\n<p>It hurt. It hurt then and it still hurt now, Remus having to lie to Dumbledore’s face. Somehow, it hurt even worse than not having been able to show Harry to his father, tell him that in a way he was his grandson. It hurt because Dumbledore had been so good to him, so generous. How could he be the same person that allowed for a ring of bruises to form on a child’s arm? How could he <em>forgive</em> that, and want to send Harry back? How could he be so wrong?</p>\n<p>“How are you, Remus?”</p>\n<p>“I’m uh… I’m as good as can be expected, Professor.”</p>\n<p>“Of course, of course. It is such a pity…” Dumbledore still sounded kind, honestly interested. “And how have you been all this time? I haven’t heard much of you all these years.”</p>\n<p>Was there something calculating on his gaze? A sudden realization, perhaps? Remus couldn’t say.</p>\n<p>“People are not quick to hire my kind” offered Remus. But he felt out of practice. Too many chats with parents outside the school, too many conversations with Severus and Teresa. He had forgotten how to sound resigned to his bleak fate.</p>\n<p>You couldn’t sound happy. People find it hard to forgive your happiness. They will be sorry for you, but they won’t be happy when you refuse to be miserable as is expected and proper.</p>\n<p>“I am doing some small work in research” Remus added. And thanks Merlin and Morgana for Severus providing such a good explanation. Bless his rotten, paranoid, core. “It’s not much, but enough to go by.”</p>\n<p>“Ah, excellent, excellent! You have always been one not to run away from a challenge, even if life has given your harder and longer tests than most.”</p>\n<p>Don’t you know it well.</p>\n<p>Remus smiled. Made himself remember how he had felt at his graduation from Hogwarts and the words Dumbledore have dedicated him in a private chat. Family. Belonging. They had been so sweet! Let that sweetness and gratefulness show in his eyes.</p>\n<p>“Thank you, professor. Just… thank you.”</p>\n<p>***</p>\n<p>Remus felt Dumbledore’s eyes on him all the way from the graveyard to his father’s cottage.</p>\n<p>His black robes were a bit used on the neck and the cuffs. It should be all right. They should look old and poor enough.</p>\n<p>***</p>\n<p>“I am sorry I couldn’t be there.”</p>\n<p>It was raining heavily and Severus’ hair and shoulders were still wet. Harry was occupied on the big table in the living room, making a treasure map to play with during recess. Remus was just getting started preparing lunch.</p>\n<p>Severus’ words… They felt like the first honest condolences Remus had heard since Teresa’s. Not that the people at the funeral hadn’t been sorry, but there was the underlying question of whatever would Remus do now without his father’s support?</p>\n<p>Remus hated it. He wished he could blame his wolfish nature, claim he was untamed and free at the core. But the wolf actually liked company. It was the man who hated feeling dependant. From his father. From Severus.</p>\n<p>“That’s quite all right” he said “Your presence would have risen too many questions. But… thanks.”</p>\n<p>Severus nodded and went to take his long black robe and change into one of his band shirts. Mr. Bertrand had spotted him once and assumed he was a priest but Teresa, who could be quite wicked at times, had informed him that Severus was a relative of Harry from another family branch that worked in fashion design, hence the clothes.</p>\n<p>“Your heart seems heavy.” Severus had returned to the kitchen. He bended to look for one of the pots and the big bowls, starting the fire. Whether he was going to prepare a sauce or one of his potions, Remus didn't know.</p>\n<p>“More like turmoil.”</p>\n<p>“I imagine you don't want to talk about it.”</p>\n<p>“No, Severus” Remus snapped. “I do not want to talk.”</p>\n<p>***</p>\n<p>Damn the Slytherins and Severus in particular.</p>\n<p>It was flan he had made, filling the house with the smell of caramel and warm milk and orange.</p>\n<p>Remus was very sensitive and attuned to smells. He couldn't help it. That particular combination, the hot milk with the orange peels inside just made him relax. It was comforting.</p>\n<p>Severus had recently brought a radiocasette to the house. Neither that, nor the TV, the VHS player, the radio or the fridge were supposed to work. It was a magical house after all. <em>Very</em> magical, considering the amount of spells and wards they had put on it. Yet the electronics worked fine. Sometimes they needed a little pushing and bumping but that was all.</p>\n<p>There were a few new cassettes for Harry to listen. Severus suggested trying them after lunch.</p>\n<p>“<em>I SEE a BAD moon rising</em>” announced a baritone in between <a href=\"https://www.youtube.com/watch?v=zUQiUFZ5RDw\" rel=\"nofollow\">cheerful guitar chords</a>. “<em>I see… trouble on the way. I see earthquakes and lighting, I see bad times today</em>.”</p>\n<p>Severus looked so damn smug when he made eye contact over Harry's bowing head. It was a wonder, how could he keep that straight face, the bastard.</p>\n<p>There were more songs after that. Harry wasn’t particularly impressed because the music was mellower in many of them, but he liked that the name was hidden in something like a hieroglyphic. (“See? Because it reads <em>U-2</em> but also <em>You too</em>” he told Remus, all happy and excited.) It was exactly what Remus needed. A voice like rain and the colour grey singing somewhere between melancholy and hope.</p>\n<p>By the time they had sent Harry to bed Remus was talking despite himself. About how bad it felt that everybody thought him incompetent, unable to do anything for himself. About how much he had fought with his father over that and how he still thought he was right but it hurt, nevertheless, knowing there had always been that breach between them and now he was gone before they could bridge it.</p>\n<p>About the dark ugly thought that perhaps Remus was kidding himself. Rejecting his father’s help only to be depending on Severus’ income.</p>\n<p>About how maybe the world was right and he couldn't stand for himself.</p>\n<p>Severus listened in silence. Merely humming from time to time to indicate he was paying attention. It still took him a few minutes to talk after Remus was done. Remus breathed deeply. He felt emptied and tired.</p>\n<p>“The death of a parent is always traumatic. I suppose you are entitled to some morose thoughts and utter nonsense.”</p>\n<p>“Nonsense?”</p>\n<p>Oh, the things Severus could do with his brows. What a way to indicate how he found your words hopelessly stupid.</p>\n<p>“Lupin” he said, and it had been years now since they referred to each other with their surnames. “You are a capable man. You are not the problem.”</p>\n<p>That was very kind. But having emptied his mind from the upheaval that resided there, Remus now felt like nothing could enter back. Not a thought.</p>\n<p>“When was the last time Harry cried?” asked Severus.</p>\n<p>“Well, he, hum…”</p>\n<p>When he fell from his bike and scraped his legs? But that had been a year or a year and half ago. Possibly that scene in <em>Dumbo</em>, then. When the mother was chained.  </p>\n<p>“Exactly” said Severus, not waiting for him to actually answer. “You are doing a good job with Harry” he went on with finality “And your research and your articles are excellent. You are allowed some sad thoughts, but only until the end of the week.”</p>\n<p>“It’s Saturday night!”</p>\n<p>“I would hurry up with my wallowing, then.”</p>\n<p>***</p>\n<p>Remus’ work was honestly good. He was unbiased and knowledgeable and he had a knack for communicating effectively. If he wasn’t more popular, it was probably for that approach of his that always went for the cleanest solution. Someone who claimed you didn't need to <em>Incendio</em> a net of buzzsnaps came dangerously close to saying that there were other ways of doing things beyond what tradition dictated.</p>\n<p>He actually suggested plenty of those ways. Many of which didn't even require magic, for crying out loud, that heretic man.</p>\n<p>But he was good. Severus had caught Swindells, the current DADA teacher, twice now taking notes from one of Remus’s articles.</p>\n<p>“Didn't I tell you?” and today Severus’ voice was like dark chocolate and nuts and a splash of liquor. “Oh, Mercy, that man.”</p>\n<p>***</p>\n<p>Swindells wasn’t that bad, really. They were all reasonably sure that he was not planning on murdering or groping any of the students. Although neither had Sauveterre and he was still the most disliked one. But it was the beginning of March and he hadn’t seriously injured anyone so that should put him on the tragically short list of good DADA teachers.</p>\n<p>It’s just that he was so damned irritating!</p>\n<p>Swindells was slow.</p>\n<p>In movement too, as it took him for-freaking-ever to gather his things when he was leaving the faculty room, but mostly he was slow in mind. One of those persons who, after explaining to them something twice at different speeds are still utterly confused with step two.</p>\n<p>“You patrol the corridors” McGonagall said in much the same tone she used with a fourth year student who still couldn’t reliably manage simple needle-match switches.</p>\n<p>“Yes, but when…?”</p>\n<p>“For Merlin’s sake, man! You look at the schedule and if you see your name, you go patrol the corridors to see if there are any students out of bed.”</p>\n<p>So of course Swindells missed his next class and went on patrol instead and gave detention to the entirety of the fifth year that was making its way to the Herbology class.</p>\n<p>“I am so sorry, Minerva. I saw my name in the paper and I thought…”</p>\n<p>Minerva didn’t want to know what he thought.</p>\n<p>He always arrived late to the meetings. He forgot which Saturdays he was supposed to stay at Hogwarts while the others went to Hogsmeade. He got lost constantly and Severus had to give detention to some second year Slytherins when he learned they were giving him the wrong directions deliberately.</p>\n<p>At least the Slytherin Prefects were more subtle about it.</p>\n<p>The classes weren’t so bad, since mostly they just read from the book and he gave them supplemented materials, like copies of Remus’ articles among others authors. So he wasn’t completely incompetent in that aspect but for the fact that he never gave the right copies. Not even once. The students were quite adept at figuring out which year needed the article on vampires and who was supposed to study curses and hexes. There was a free exchange market Fridays during lunch hour where people switched notes.  </p>\n<p>Then there was the day he decided to take his students to the Forbidden Forest for a practical test, which was, yes, forbidden.</p>\n<p>And the time Hagrid had to explain there really was a giant squid in the lake and he should not bathe there, no matter how sunny it suddenly was. Of course he didn't listen and he ended with a grindylow bite for his trouble.</p>\n<p>And…</p>\n<p>There was only <em>one</em> Whomping Willow at Hogwarts and it did not change its location. They had already explained. If he walked into a tree that was a different matter.</p>\n<p>And…</p>\n<p>Severus was not a trained healer. He was a Potion Master. He brewed potions. If he was feeling unwell he should go ask Madam Pomfrey.</p>\n<p>And…</p>\n<p>No, Severus couldn’t take a look anyway and he would not make him a remedy.</p>\n<p>And…</p>\n<p>Those were not his chocolate covered berries and they had not been left there for everyone to take some. This was the third time it happened.</p>\n<p>(It took some special talent to irritate Flitwick).</p>\n<p>And…</p>\n<p>He held a twenty minutes conversation with Mrs. Norris, thinking it was McGonagall.</p>\n<p>And…</p>\n<p>Madame Hooch was a woman and she would appreciate it if he would refer to her as such.</p>\n<p>And…</p>\n<p>Professor Binns and The Bloody Baron were two different ghosts.</p>\n<p>And…</p>\n<p>Madame Pince was human and did not understand where he got the notion that she was some flesh monster with three mouths. Neither was she an accomplished baker nor was she waiting to show him her culinary skills.  </p>\n<p>***</p>\n<p>Given that Severus had become the resident jerk (a deliberate choice to avoid nosy questions and entertaining the notion that he could be nice to, let alone allied with, anyone), it fell upon him to set Swindells straight. The others would send him murderous glares but they would not speak.</p>\n<p>Madame Hooch may very well beat him with a Quidditch bat. Severus was tempted to wait just to see that.</p>\n<p>In the end the decision was made for him when the sixth year female prefect pointed out to him that Swindells kept mispronouncing Hari Rayaprolu’s and Suruchi Subadar's names. Which, okay, the first few times they understood. But it just went on despite correcting him every time and Suruchi, second year and already planning her career in the Ministry, called him out on it the next time he called roll.</p>\n<p>“Yes, well, these funny foreign names sound all the same. You know I'm calling you, don't you Miss Zuprata?”</p>\n<p>“Subadar. And no, I do not.”</p>\n<p>“Let's just change your name for something more adequate.” He went on in what he thought was reasonable tone. “How about Smithers?”</p>\n<p>The prefect had found Suruchi in the bathroom, washing her hot tears of rage. Swindells had docked her ten points for insolence and disruptive behaviour because she kept fighting it rather than dropping the topic and let him continue with the class. The girl had been quite unreasonable, is what he said.</p>\n<p>***</p>\n<p>Severus came to the professors’ common room looking very much like the personification of an avenging spirit. Some of the first year students who saw him go swore he didn't have feet and was in fact floating in a cloud of ash and smoke. There was a sulphurous smell in the air around him.</p>\n<p>The sound of the door closing behind him was like the executioner’s axe.</p>\n<p>Filch only told the students lingering in the corridor to get lost twice, and he didn't insist after that. Swindells had a knack for filling the freshly cleaned corridors with mud and Filch relished what little pleasures he could get.</p>\n<p>Everybody agreed, it was most satisfying. Scary, but satisfying. Quirrell peed himself a little bit.</p>\n<p>Swindells complained to Dumbledore, of course he did, which was like threatening the gale with taking it to court for all the good it did.</p>\n<p>And the next day, Flitwick presented Severus with a whole bag of chocolate covered berries.   </p>\n<p>***</p>\n<p>He gave the berries to Remus. He was the one with the sweet tooth, after all.</p>\n<p>Plus, it allowed him to tell the story of how he had gotten them and Remus looked indignant at first and then ridiculously proud and happy and made him describe the reaction of every single person in the room.</p>\n<p>***</p>\n<p>It was that same night, the night at the end of spring full of wind and rain. The night when they helped Harry with a school project and they had dinner and saw a movie and then Harry went to bed while they stayed talking in the living room, as they always did, sharing conversation and chocolate-covered berries. They were actually pretty good. Sweet and tart.</p>\n<p>The rain picked up, and there was some thunder and lightning bolts. And in between one bolt and the deafening thunder that followed it, the lights of the house blacked out.</p>\n<p>They fumbled a bit, rising from their chairs and looking for discarded wands to <em>Lumos</em> and for the candles that slept somewhere in a kitchen drawer and instead, of course, they found each other, bumping in the dark and arms rising and holding so they wouldn't fall.</p>\n<p>And then, not taking the arms back.</p>\n<p>And then, staying like that, standing in each other’s space in the dark, shrouded by the sound of the rain outside.</p>\n<p>And then, closeness. The warmth of skin. Breathing in the same air. A kiss.</p>\n<p>***</p>\n<p>“Daaaad! What happened to the lights?”</p>\n<p>Remember: you love Harry with every cell of your being.</p>\n<p>Was that a smile on Severus’ lips?</p>\n<p>“There was a blackout!” Remus screamed back “And you should be asleep!”</p>\n<p>“I was reading!”</p>\n<p>“Go to sleep, it's almost midnight!”</p>\n<p>Severus mumbled that it wasn’t even eleven thirty.</p>\n<p>***</p>\n<p>The moment was gone. Severus found his wand and got it to <em>Lumos</em> non verbally (little show off) and Remus got the candles and his own wand. It was late anyway, they didn’t need much light and they should just go to bed. But Remus wanted to make sure the fridge would stay cold until the morning or whenever the light came back so they spent at least twenty minutes fixing that. They debated whether to use <em>Glacio,</em> which might be a bit extreme and damage the appliance, or <em>Refrigero</em>, which in turn they thought was too weak. The ended up casting <em>Perfrigefacio</em> which was seldom used and rarely taught, but Severus thought it was the most adequate since apothecaries employed it with the most delicate ingredients. It should work well enough with the eggs and milk.</p>\n<p>Remus had a candle with him, a common plain candle, store bought. He would now say goodnight and climb up to his bedroom and Severus would <em>engorgio</em> the couch and get whatever he needed from the corner closet that had become his. They would say nothing else and in the morning everything would be the same. If it had stopped raining they would go outside for a walk with Harry, and if not they would stay home and read and cook and maybe Severus would brew something and Remus would write some notes for his latest article and it would be nice and peaceful as it always was. It would be safe. Known. Reliable. Customary and undisturbed.</p>\n<p>Remus was a Gryffindor. It was up to him to be brave.</p>\n<p>“Severus?”</p>\n<p>Severus turned around to look at him. He hesitated before meeting Remus’ eyes.  </p>\n<p>Remus blew the candle off. There was only darkness and the storm.</p>\n<p>***</p>\n<p>Remus came with little knowledge of amatorial arts. It hadn’t been easy to ask when mere tolerance of his presence was already a gift, when friendship had been a feast he still couldn't believe he got. He didn’t dare ask for more when he already had so much. And he understood that friendship was one thing, but loving <em>a werewolf</em> was another thing completely different and too much to ask of anyone. Then there had been the war and so many more important things to do that he got lost in them.</p>\n<p>There had been an encounter with Gideon Prewett, though, rushed and born from the excitement of having fooled death once again. Not particularly good, but good enough, and sweet afterwards in the shared embrace.</p>\n<p>Gideon had been killed a week and half later, and his brother Fabian too. Afterwards, it was just easier to think only of winning the war.</p>\n<p>And now he was here.</p>\n<p>Severus knew what he was doing, there was no doubt about that. And yet there was a certain hesitance about him. No, not hesitance, second-guessing. He would kiss Remus with ardour, push him against the wall and put a hand down his trousers, only to suddenly doubt himself and take the hand back and spend the next ten minutes kissing his mouth, his cheek, his neck, with his hands well above his hips and over his clothes.</p>\n<p>No complaints with that. Kissing was very nice. Kissing <em>Severus</em> was nice, even though he was made of sharp lines and narrow angles. There was this hint of restrained hunger that was most alluring. But Remus would appreciate some sort of clarification on the route ahead, is all.</p>\n<p>All right, well, that worked too. Severus walking him to the sofa turned bed in the middle of the room and pushing him down and demonstrating how exactly you can drive someone mad with just your mouth before even getting properly undressed. That was a good route.</p>\n<p>Remus remembered to grab his wand and cast <em>muffliato</em>. That was his last clear thought. After that there was only the feeling of the darkness and the rain outside and Remus let himself fall in their warm nest and the quiet, gentle, meeting of bodies.</p>\n<p>***</p>\n<p>And then afterwards it wasn’t so quiet (thank all the gods for silencing charms) and it was gentle, yes, but there was also some biting on the chest and Severus scratched him on the back as Remus pushed in. Severus’s legs tightly clamped on his sides and Remus’ hands buried on Severus’ hair which was surprisingly soft and smelled liked cranberries.</p>\n<p>***</p>\n<p>Sunday morning Severus had a little freak out and acted as if nothing had happened. Remus took his cues from him and did the same, knowing all the while that it wouldn’t be long until it happened again.</p>\n<p>Perhaps he didn’t have much experience, but he was not in the habit of lying to himself and so he didn’t take any other lies either. This was not a one-time thing and it was not mere physical release.</p>\n<p>***</p>\n<p>Harry noticed, eventually, that Remus and Severus stood a bit closer now, bumped into each other more. But he didn’t really think about it. It meant nothing. There were still dinners and country walks and during the summer short trips to the beach or the mountains in the north and a couple of times to the big cities. And lately Harry had developed an interest in Ancient Greece and the Age of Sail and Napoleon and he was very busy reading about that.</p>\n<p>But when he was thirteen, almost fourteen, Harry looked back to this time and went “oh.”</p>\n<p>***</p>\n<p align=\"center\">10</p>\n<p>***</p>\n<p>After only two weeks of the term, McGonagall asked Sprout to keep an eye on Miss Tonks in case she had gotten any ideas again. It was not her, however. There truly was someone even more dangerously clumsy than Tonks and that was Professor Pontifex.</p>\n<p>She was quite a lovely woman, really. Sweet and dedicated to her students and knowledgeable enough. She also tripped on the stairs on her way to class and badly injured her wrist. And she knocked her head with a door. All in the same day.</p>\n<p>Then there was the day she went down to the dungeons to ask something of Severus, absentmindedly leaned on a cauldron that immediately keeled over and she ended with burns on her legs and stomach. And then she slipped on the wet floor and fell down.</p>\n<p>***</p>\n<p>Severus still went to <em>The Lounge</em> every five to seven weeks, which was the perfect interval of time so that it would look random and natural. The way to spot a cover is when it becomes too regular.</p>\n<p>He went there and he found he hated the place even more. He also came to discover what exactly it was that lovely Professor Miller lacked, and it was the careful truce turned into trust with years of work.</p>\n<p>That and the beard. Remus' short beard was something else. Everybody in the muggle village mourned whenever he decided to shave during summers.</p>\n<p>***</p>\n<p>The Quaffle. Not the Bludgers, no, but the <em>one</em> ball that was designed to be visible and expected to be in someone’s arms at all times. That is what hit poor Professor Pontifex.</p>\n<p>***</p>\n<p>If asked, neither of them would say that they were in love. But the thing is, they didn’t know.</p>\n<p>The real tragedy of their generation wasn’t so much death as the loss of time. By the time they graduated from Hogwarts there was an open war and sides to choose and no time, not really, to think about it. People did everything big and fast, trying to cram ten or fifteen years in a few months because there was that shared sense of time running out. Either you did things now or tomorrow you wouldn’t have the chance.</p>\n<p>James and Lily had married at eighteen, became parents at twenty, died at twenty-one. They were not the only ones. The Longbottoms followed the same pattern only they didn’t even have the fortune of death.</p>\n<p>So for them love was something passionate and violent. Quick encounters during missions that let the room destroyed afterwards, or marriages when you were still in your teen years. Love, for them, was those first three years of passion.</p>\n<p>They didn’t know.</p>\n<p>They didn’t know about what comes after. The quiet partnership, the easy company. They didn’t know love hides in the exact amount of sugar added to the extra cup of tea, the grocery list where you thoughtlessly add someone else’s tastes beside your own, learning to enjoy new music and books and shows.</p>\n<p>They had no idea.</p>\n<p>***</p>\n<p>Severus was able to sneak out of Hogwarts early and got to Harry’s school recital on time to witness how the early courses fought their way through something that originally may have been a carol. Then it was the turn of Harry’s year which was about to perform a modern retelling of <em>A Christmas Carol</em>. Mr. Humbug’s moustache kept falling down and one of the spirits forgot his lines and stood frozen until the end of the play. Harry sang a song all by himself about the importance of generosity and having fun once in a while.</p>\n<p>He actually had, if not a beautiful voice, a decent sense of rhythm and tone. Everybody thought it was quite nice. In fact, Mr. Bertrand approached Remus to suggest, once again, that he enrolled Harry on after class music lessons, such promise he was showing!</p>\n<p>(Remus wasn’t doing such thing because sometimes Harry enjoyed music a bit too much and made the furniture dance along. There would be no music lessons until they fixed that).</p>\n<p>Mr. Bertrand had to give his speech with Severus frowning down at him and he had to admit it did not come as beautifully earnest as he had practiced it.</p>\n<p>***</p>\n<p>There was something about this Christmas break, the first to see the three of them in the cottage for the entire time. Severus cooked the meals and directed Harry on dessert and there was music, and a film, and wonderful presents afterwards.</p>\n<p>And there were, perhaps, some kisses. Hot and intense and fast, but Harry certainly didn’t notice any of that. They occurred behinds closed doors and a silencing charm. Many things happened, in fact, behind those wards. And every time it felt like something new, every time asking again for permission. It was tentative and sweet.</p>\n<p>(And Severus was astoundingly bossy and also incredibly generous and Remus wanted to say he would never had guessed, but actually he would because that was just as Severus was every hour of the day).</p>\n<p>***</p>\n<p>“I can’t… I’m not…” Severus sighed “I am very tired today.”</p>\n<p>Severus Snape requiring three attempts to form a sentence? He was certainly tired. Why he was fighting this Remus did not know.</p>\n<p>“Come to bed, then.” Remus said once more. Again, Remus would admit he had no idea of what he was doing half of the time, but it was obviously to his advantage because whatever people knew or thought they knew, it was wrong. He was not faulting Severus’ technique, dear Merlin, not at all. But everything else that surrounded the act, clearly Severus had learned it wrong.</p>\n<p>He took Severus’ hand and pulled him after him, up the stairs and to the bedroom. Remus pushed him down and just ten minutes later they were both under the covers, his arm over Severus’ waist. Apparently Severus thought he was only welcome there as long as he could perform, which, really, what a ridiculous notion! If he was so tired that he couldn’t even accept Remus’ enthusiastic attempts at a blowjob, then he certainly needed his sleep and Remus saw no reason why he should force him in to anything or kick him down to the couch.  </p>\n<p>Not that Severus could fall asleep easily despite his exhaustion that day. It was the first time in his life someone invited him to their bed just for the sake of his presence without any other demands. It wouldn’t be the last. Every night Remus would ask and he would keep asking until Severus learned that he was wanted every day.</p>\n<p>***</p>\n<p>Professor Pontifax willingly resigned from Hogwarts to go back home and rest for a while. She had broken both arms, sprained an ankle, burned several times, received numerous hits, cuts, and bruises, and on a particularly bizarre accident almost drowned in a bucket.</p>\n<p>Remus laughed and laughed and kissed Severus’ frown away at the indignity that he had once more been rejected for the DADA position. Dumbledore had chosen trembling, inept, <em>Muggle Studies</em> Quirrell instead, and Remus sympathized, truly, he did. But he also laughed.  </p>\n<p>It was less of an affront if it made Remus laugh.</p>\n<p>***</p>\n<p>Harry was happy. He was reading well beyond his level and he was reading everywhere. In the school, and at Olivia’s and in the sunny spot on the stairs and laying on his stomach under the holly tree by the door. He did his schoolwork by Remus’ side on the scraped big table of the living room. He read on his bed in that room that had been given to him, <em>his bedroom</em>, with the stained wallpaper whose original colour was impossible to know now.</p>\n<p>Olivia’s mum gave him <em>The Black Tulip</em> for completing primary school, because she knew he had read Dumas and loved it (the adventures, oh, the thrilling adventures) and that he also loved plants. The book was about a flower and about adventure, too, and Harry read it in less than a week and when he got to a very thrilling bit all the glass in the house would frost and change colour. For his birthday, Severus got him <em>A Plants’ Glossary</em>, a tiny beautiful edition that compiled over a hundred plants and their secret meaning and all the rules to make a message. It was Harry’s first adult book. Not to say he wasn’t reading things not deemed appropriate for kids, but it was the first book that didn’t have a story in it. Just knowledge and beautiful illustrations.</p>\n<p>***</p>\n<p align=\"center\">11</p>\n<p>***</p>\n<p>They were scared of what would happen when Harry turned eleven. But the day came and went and there was no letter.</p>\n<p>They had explained, a year earlier. When Harry turned ten Remus had explained everything. He had even gone for a walk and let Harry talk to Severus in private, in case he had other questions he didn’t dare asking to him.</p>\n<p>Harry knew Remus wasn’t his real dad. Had always known and hadn’t cared much. It wasn’t that strange. Mowgli was raised by a <em>whole pack</em> of wolves plus a bear and a panther. Harry just had a dad that once a month turned into a wolf, and a second dad, kind of like Bagheera now that he thought about it. </p>\n<p>He also knew he was a wizard and that he shouldn’t show in public.</p>\n<p>Now they explained everything else. Put together in a coherent narrative all the bits and pieces Harry had learned through the years. What exactly happened to his parents. That some bad wizard wanted to hurt him because of a stupid prophecy (but he shouldn’t worry, never worry, he was safe and would always be and Severus would be the first to know if he came back). That they hadn’t exactly asked permission when they took him from his aunt’s house.</p>\n<p>The thing is, Harry <em>remembered</em>. He remembered seeing a man with funny hair in the garden, looking in. He remembered talking to him, with that easiness with which children sometimes talk to strangers, because why shouldn’t they? (and certainly a stranger couldn’t be worse than what Harry knew at home). He remembered because the man, Severus, had given him an apple and that was the first thing Harry ate in hours that day. He didn’t remember well what exactly had it been, whether he had sung a song too loudly or he had taken a toy that the other kid said he wanted, but he remembered that he had been punished without dinner that night. He remembered how sweet the apple had been.</p>\n<p>So really, he was quite happy with things as they were. And if going to magic school would make trouble for Remus and Severus, he was perfectly happy going to normal school. He was going to be a vet or a private detective, he wasn’t sure yet.</p>\n<p>***</p>\n<p>The world kept looking for Harry. Harry unknowing and unconcerned by this, went on living and learning.</p>\n<p>Until the world found him.</p>\n<p align=\"center\"> </p>\n<p> </p>\n<p>The hawthorn and holly trees had been torn and burned. Only a black skeleton remained, like a mockery, and the trees now looked like giant black spiders. The stones of the hedge had been knocked out in various places. Still, it had been necessary a wondrous display of magic to push through. Something, someone, had slashed through the stones cutting them. They were still hot and glowing white over the wet grass. Not many wizards could cut through a layer of three different protection wards when there was fairy magic in effect.</p>\n<p>But someone did, opening a path for the rest of them.</p>\n<p>They hadn’t been able to cross the wards in the attic, though. If Harry had stayed there, they wouldn’t have gotten to him.</p>\n<p>But he didn’t, he didn’t. How could he? How could he when he heard some strangers come in to his house, knocking the door down in the middle of the night? When he saw three wizards capture his dad under a net of silver and heard them scream spell after spell to put the wolf down, the tame wolf that had taken Wolfsbane.</p>\n<p>Of course Harry didn’t think to run and protect himself. Of course Harry, standing in the stairs landing, didn’t turn around and climbed up to the attic.</p>\n<p>He still had a little bit of Remus’ fur in his hands, from where he had clung to him until the giant man lifted him up and dragged him away.</p>\n<p>***</p>\n<p>Everybody kept speaking over him. That he was Harry Potter, The Boy Who Lived, that he had been kidnapped, that of course, poor child, didn’t know any better and kept defending the beast, that it was an honour to shake his hand. He would be taken to a wonderful school, not a muggle one, and of course he wouldn’t see that monster ever again. It was going to be so nice, he would love it.</p>\n<p>That “monster” was Harry’s dad.</p>\n<p>And Harry was going to a school all right, two towns over, where he would see his friend Olivia again. Maybe join the football team.</p>\n<p>Harry just wanted to be back with Remus in their cottage with the garden and the kitchen and the sunny spot in the stairs. Instead he spent a week locked in a strange muggle house with people who didn’t want him there anymore than he wanted to be. Then he was transferred to an inn in Diagon Alley and was told he would be there until the beginning of the course in a week’s time. There had been quite a large group of wizards to transport Harry but still he had noticed that two of them remained in the house. He supposed it had to do with the family making him sleep in the cupboard under the stairs.</p>\n<p> </p>\n<p> </p>\n<p>He didn’t want to think about it.</p>\n<p> </p>\n<p> </p>\n<p>But</p>\n<p> </p>\n<p>He remembered that cupboard. He thought- he <em>used to think</em> it was an odd dream from his childhood, but it was not. It was real and he panicked when they showed it to him and that man, Vernon, just pushed him inside and <em>locked</em> the door.</p>\n<p>But no, of course, Harry was <em>confused</em> and Remus was the terrible monster eating children in the night. Remus who taught Harry the letters and the names of the living things and how to control his magic. The same Remus who gave him the naked truth on his tenth birthday and who later that night held him in his arms as the realization came upon Harry and he wept for the parents he couldn’t remember. Remus who dried his tears and made him a chocolate milk and told him about the time Lily taught James how to drive a muggle car and the ensuing disaster, just to make him laugh.</p>\n<p>They said Remus was a kidnapper and a liar and Harry shouldn’t trust him. <em>They </em>said that, the same people that trembled and couldn’t bring themselves to say the name Voldemort.</p>\n<p>(Harry had read a lot about the Middle Ages when he and Olivia played knights. And also later with his Napoleon period he had read quite a lot about history and society. He was certain that <em>Voldemort</em> was not a member of the peerage and had no right at all to the term “lord”).</p>\n<p>It was so frustrating to keep speaking and have people ignore him, or worse yet being told that he didn’t know what he was saying, that without meaning to Harry stopped talking altogether. He spent three days without saying a single word until the giant man, Hagrid, noticed and took him to Florean Fortescue’s Ice-cream parlour.</p>\n<p>Harry hated him. But at least he had noticed and seemed upset and he kept trying to be nice although the only thing that would make Harry happy was to have his life back. Harry hated him less than everyone else.</p>\n<p>For the first time in over eighty hours he spoke. He said “thank you.”</p>\n<p>He ate two spoonfuls of the ice-cream and let it melt in to a sloppy mess. It was three-chocolates with cookie bits. Harry supposed it was good and he did like chocolate. But his favourite ice-cream flavour was lemon. Remus knew that. Severus, too.</p>\n<p>Nobody had asked him what kind of flavour he wanted. As soon as they entered the place the owner had greeted them and shook his hand and waved them to a table saying he would be right away with his best.</p>\n<p>“I’m so sorry, lad” said Hagrid. He did look sorry. His eyes, so warm and kind, were sad when he looked at Harry. “But you will see. Dumbledore is the wisest man, and Hogwarts is a wonderful place. Everybody likes it there.”</p>\n<p>Oh, to hell with it.  </p>\n<p>He hated him, he hated all of them, and Harry promised himself that they would not win. Whatever he had to do, he would not let them win.</p>\n<p>***</p>\n<p>They came at night, Severus read in <em>The Prophet</em>. It was pure dumb luck that he hadn’t been there, that he hadn’t fallen with Remus.</p>\n<p>He had been saved by his father. The one and only thing Tobias Snape ever did for his son: held to his miserable life long enough to get some notion of regret and ask for Severus to come see him as he laid moribund in a hospital in Exeter. That is what kept Severus out of suspicion and away from the clutches of the Ministry.</p>\n<p>The newspaper article was currently praising the Auror Office and Magical Misuse coalition for its heroic labour.</p>\n<p>Severus had been saved, and he wished he hadn´t. He wished he had been there to defend the house. And when they broke all the barriers (the ones Severus knew were mighty, the ones Severus knew no ordinary wizard from the Ministry could cross), then Severus would be arrested too and pay for his crime of stealing a little boy away from a family that didn’t bother to report his disappearance to the police.</p>\n<p>But it was not to be, because it was Severus’ curse to see once more his whole world burn down and to remain, like the phoenix, untouched by the fire. It was Severus’ curse and privilege to stand in the ashes and be the sole guardian of Harry Potter.</p>\n<p>In his most private moments, he fantasized with going to the Ministry, storming the cells and freeing Remus. Fighting with him and perhaps falling with him, but side by side in any case, together. And Harry would be free, too, to go and live his life and grow up and don’t have a single demand made of him.  Not another request or sacrifice for his part. Harry would be blessed with a common, unexceptional, life.</p>\n<p>But it was not to be, because it was Severus’ curse that that summer, for the first time in ten years, he felt a pang, something like an electric shock, on his left forearm. And now he could not go and get himself killed and leave Harry alone and he could not take Harry away from Hogwarts while the tiger lurked outside. </p>"
}