{
  "id": "9569057",
  "url": "https://archiveofourown.org/works/9569057?view_full_work=true",
  "author": [
    "galaxymilk"
  ],
  "title": "Drastic Measures",
  "rating": "Not Rated",
  "archive_warnings": [
    "Creator Chose Not To Use Archive Warnings"
  ],
  "categories": [
    "M/M"
  ],
  "fandoms": [
    "Voltron: Legendary Defender"
  ],
  "relationships": [
    "Keith/Lance (Voltron)"
  ],
  "characters": [
    "Lance (Voltron)",
    "Keith (Voltron)",
    "Shiro (Voltron)",
    "Hunk (Voltron)",
    "Pidge (Voltron)",
    "Allura (Voltron)",
    "Coran (Voltron)",
    "Original Alien Character(s)"
  ],
  "additional_tags": [
    "Angst",
    "Hurt/Comfort",
    "Injury",
    "Langst",
    "Lance's Insecurities",
    "i love him so much",
    "klance"
  ],
  "language": "English",
  "series": "",
  "published": "2017-02-04",
  "completed": null,
  "words": "8,679",
  "chapters": "1/1",
  "comments": "128",
  "kudos": "5,833",
  "bookmarks": "707",
  "hits": "55,088",
  "summary": "<p>Lance is struggling with his insecurities and fears that the team doesn't need him. But their true feelings become clear when Lance literally sticks his hand into a life or death situation.</p>",
  "notes": "<p>I stole the idea from season 2 episode 17 of Grey's Anatomy after watching it and feeling an intense need to write about it! I finished this in a day so I apologize if it has errors. Klance has taken over my life.</p>",
  "text": "<p>\n<span>Lance wakes to a steady pounding behind his eyes. The familiar throb of a migraine, somehow burrowing itself comfortably in his previously unconscious brain. He stubbornly keeps his eyes closed, refusing to accept that this is how his day is going to start. What are the odds of waking up to a migraine? Lance ponders what he must have done in a past life to deserve this kind of torment, and wonders if he can maybe apologize for it in this one. He tries a few times to cheat the pain and fall back asleep, but his head has other plans. The throbbing has become a deep, steady beat that is denying his pleas for mercy. </span>\n</p>\n<p> </p>\n<p>\n<span>With resignation, Lance groans and rolls his body into a sitting position. He presses the heels of his palms into his eyes until he sees dancing colors. The headache is most likely due to the fact that he hadn’t slept much that night. Lance had spent most of it in the castle’s control room, gazing at the holographic star charts. Earth, to be specific. Lance watched his small planet slowly rotate for hours. It was the closest he came to feeling comfort these days. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance sucks in a steadying breath and gets out of bed. They’re supposed to do some new training exercises today, and maybe if he shows up early he’ll be in Allura’s graces. With this tiny spark of hope Lance stumbles over to his closet to grab his jeans and jacket. He tosses the shirt he slept in to the side and slips on his clothes. The migraine screaming in protest every time he leans forward too far. He makes his way into the bathroom to brush his teeth and hair. Breathing a sigh of relief when he finds a small bottle of orange capsules for pain that Coran had given him, after he had noticed Lance wincing from a previous headache. He swallows three of them dry while briefly thinking that he should probably try and fix his sleeping habits before someone scolds him. That's the last thing he needs, more reasons for his friends to be unhappy with him.</span>\n</p>\n<p> </p>\n<p>\n<span> Lance doesn’t forget to moisturize his face before heading out, refusing to let a headache strip him of beautifully soft skin. </span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>By the time Lance makes it out into the dining room, his migraine has already started to ebb away. Alien medicine is magic. He is pleased to find that he is the first one there. It must be pretty early. Lance briefly wonders what time it is on Earth, the sun could be setting over the horizon for all he knows. It sends a fresh wave of longing through him that he instantly tries to push back down. </span>\n</p>\n<p>\n<span>Shaking his head, Lance grabs a bowl and fills it with green goo. He eyes it suspiciously, shaking it to let it jiggle for good measure. His stomach twists in distaste, and he realizes he was never even hungry in the first place. Instead of heading back to the table, he moves to the sink to dump out the green mass and wash the bowl. Hearing it splatter into the metallic basin makes him feel a pang of guilt. His mother would definitely yell at him if she could see him wasting food, no matter how questionable it looked. The painful wave washes through him once again with full force. </span>\n</p>\n<p>\n<span>Just as Lance is about to settle on going back to bed to wallow in self pity, he picks up on the sound of footsteps and resonating voices. The rest of his team comes walking into the kitchen, absorbed in their own conversations. Pidge is walking with Hunk, waving their arms animatedly while Hunk chuckles alongside. They are followed by Keith and Shiro. Lance can see a light smile on Shiro’s face as he talks to Keith, who is looking back up at him with an amused expression. Something harsh twists within Lance. He clears his throat and the four of them instantly look up. Keith’s face immediately hardens. </span>\n</p>\n<p> </p>\n<p>\n<span>“Good morning, Lance!” Hunk greets him happily as he grabs a bowl, “did you eat already?”</span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, just finished.” Lance returns his smile. Hunk’s kindness rarely fails to cheer him up.  </span>\n</p>\n<p>\n<span>“You’re up surprisingly early. I was sure you’d be out until midday at least.” Pidge snorts. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance scowls, “Says you? When you sleep in it's for the entire day!” </span>\n</p>\n<p> </p>\n<p>\n<span>They seem to consider this, before mumbling something and flopping into a chair by the table. Lance leaves his bowl in the sink and takes a seat next to Hunk, hoping to maybe absorb some of the warmth coming from his friend. He glances up to see that Keith is directly across from him, and staring at him. The red paladin’s eyes are intense and his eyebrows are slightly pinched. Lance finds himself instantly breaking eye contact, before mentally kicking himself for submitting to a man with a mullet. </span>\n</p>\n<p> </p>\n<p>\n<span>“You look like hell.” Keith states, as if he’s talking about the weather.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance’s headache threatens to come back in full force. </span>\n</p>\n<p> </p>\n<p>\n<span>“I look </span>\n<em>\n<span>great</span>\n</em>\n<span>, mind you. Maybe you’re just looking in a mirror.” Lance kicks himself again for that failure of a comeback. What is he, twelve? Though he does feel a bit satisfied when Keith makes a disgruntled noise in response.</span>\n</p>\n<p> </p>\n<p>\n<span>“Keith is right, Lance.” Shiro tells him. Lance shoots him an exasperated look, “not that you look bad! Just that you look tired, you have dark circles under your eyes. Are you sleeping okay?” </span>\n</p>\n<p>\n<span>Shiro looks concerned, and Lance shifts uncomfortably. He can feel Keith’s gaze back on him, along with the others. </span>\n</p>\n<p>\n<span>“I’m fine, really! I just-” Lance is cut off by Allura and Coran entering the room. He doesn’t know whether to relieved or disappointed. </span>\n</p>\n<p> </p>\n<p>\n<span>“Good morning, paladins. I hope you are ready to train this morning!” Allura greets them. </span>\n</p>\n<p> </p>\n<p>\n<span>“What kind of training even is this?” Pidge asks. “Since you told us that we wouldn’t need our armor.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Bonding exercises!” Allura says excitedly. “I did some research, and it will be beneficial if you all are more closely bonded. Voltron will be able to be formed even smoother and quicker.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Thats a great idea, Princess. Plus, we haven’t done any exercises like this in a while.” Shiro says. </span>\n</p>\n<p>\n<span>The other paladins chat with each other, but Lance begins to zone them out. He stares at his hands, mind wandering. Bonding exercises are something that might’ve been a breeze for him in the past, but sound unappealing now. If it turns out to be some therapy session, Lance doesn’t want to know what the others think of him. He’s pretty sure he already knows. He’s the odd one out, it's a fact that isn't up for debate. Lance </span>\n<em>\n<span>knows</span>\n</em>\n<span> this, yet actually hearing his friends say it.. He doesn't know if he can handle that. He wants to be strong for them, wants to prove himself. He wants to be enough- </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance?” Shiro is looking at him with concern. The room is completely silent. Shit. </span>\n</p>\n<p> </p>\n<p>\n<span>“Uh, yeah? Sorry, zoned out for a second.” Lance rubs the back of his neck, he can feel warmth prickling his face. </span>\n</p>\n<p> </p>\n<p>\n<span>“I were just asking if you were ready to head out,” Shiro frowns. Lance notices that the rest of the team is already gone. “Are you sure you’re alright?” </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah, man. Of course!” Lance flashes him a smile that he hopes looks real. Shiro looks at him for a moment longer before sighing and getting up from the table. </span>\n</p>\n<p> </p>\n<p>\n<span>“Okay. Let’s go then.” </span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Lance and Shiro catch up with the others and follow Allura into a room that Lance has never been in before. Which doesn’t surprise him, since the castle is the size of a small city. The lighting in the room is dim, except for a large circle of light in the center. There seems to be a constant, low pitched hum that fills Lance’s body. Its relaxing, and Lance lets out a deep breath. </span>\n</p>\n<p> </p>\n<p>\n<span>“The exercise we are going to be focusing on today is about trust,” Allura says quietly. The calming effect of the room must also be affecting her. “Please take a seat in the circle.”</span>\n</p>\n<p> </p>\n<p>\n<span>They all find a spot in the ring of light. Lance notices that Keith chooses to sit next to him and gives him a questioning look. Keith doesn’t even glance at him. Lance huffs. </span>\n</p>\n<p> </p>\n<p>\n<span>“Now, for this to work, you are going to need to fully open your mind.” Allura’s soft voice fills Lance’s head. “Close your eyes, and take the hand of the person next to you.”</span>\n</p>\n<p> </p>\n<p>\n<span>A sudden twinge of anxiety fills Lance. Pidge has already grasped one of his hands, but the other is still empty. Lance closes his eyes, not wanting to see whatever face Keith is making. He chews the inside of his cheek and holds out his empty hand. A fleeting feeling of nervousness courses through him. What the hell?</span>\n</p>\n<p> </p>\n<p>\n<span>There’s a pause, and Lance is about to snap at Keith because this is getting ridiculous but then a tentative hand wraps around his. Keith’s hand is </span>\n<em>\n<span>warm</span>\n</em>\n<span>, Lance can feel it through his dumb fingerless gloves. His fingertips brush against Lance’s wrist and his ears begin to heat up. Lance wants to punch himself in the face. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance can hear Allura telling them to open their minds again, but she sounds distant. Its as if he’s been submerged underwater. </span>\n</p>\n<p> </p>\n<p>\n<span>“There are five of you,” Allura’s words are coming from everywhere all at once. “You are a team that depends on each other. You need one another to accomplish your goals. Think of each and every one of the others around you. Shiro, Keith, Hunk, Pidge, and Lance. Imagine each face, each tallent, show them how much you trust them. Imagine them alongside you in a predicament, how safe do you feel knowing that they are with you?”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance imagines Shiro, their leader. Even though he has his own problems, he looks out and protects everyone around him. Lance respects him and trusts him to make life or death decisions. Even if he may have a hard time expressing it out loud, he wouldn’t want anyone else being their honorary space-dad. He tries to send these emotions out to wherever Shiro is. </span>\n</p>\n<p> </p>\n<p>\n<span>Next he thinks of Hunk, his best friend. Hunk has always been there for him and on his side. Hunk feels like home, and Lance can spend hours just talking with him. He knows for a fact that Hunk is a fantastic engineer and reliable partner. He trusts him with his life. </span>\n</p>\n<p> </p>\n<p>\n<span>Next is Pidge. They are an absolute genius, a prodigy. They invent new technology faster than Lance can even think. He knows that they worry about their dad and brother, yet still work hard to protect the universe. Lance trusts Pidge’s ability and resourcefulness. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance is suddenly surprised by how easily he is doing this. Normally he’d be making witty jokes and teasing, but his thoughts are spilling out. He respects his team and his emotions are bubbling up and spilling over. </span>\n</p>\n<p> </p>\n<p>\n<span>Finally, he thinks of Keith. His rival and teammate. He would never say it outloud, but he respected Keith from the moment he met him in the garrison. Keith is strong and capable. Lance would be lying if he hadn’t felt a stab of disappointment when he didn't remember him at first. Lance hadn’t been memorable enough. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance thinks of Keith now, and their weird rival friendship. If they are even friends, Lance isn’t too sure. He thinks of Keith’s piercing eyes, they’re a dark indigo color, like the ocean during a storm. He wonders if Keith has ever been to the ocean, since he lived in the desert. Lance imagines Keith standing before the sea, wondering what his expression would be. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance suddenly snaps back into focus, feeling thoroughly embarrassed for </span>\n<em>\n<span>that</span>\n</em>\n<span> train of thought. That was fucking weird. He tries to think about Keith and trust. Does he trust Keith? They often butt heads, but Keith was the top of their class before he dropped out. Keith is impulsive and hot headed, but he is strong and capable. Lance realizes, with a bit of shock, that he does trust Keith. A lot. </span>\n</p>\n<p> </p>\n<p>\n<span>Something foreign begins to fill him. Without being told, Lance knows that it’s the thoughts of his teammates. They feel familiar, and he can register their emotions. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Strong willed… Quick learner.. </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance feels Shiro thinking of him. Pride fills his core, knowing that their leader thinks positively of him.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Just needs to focus more..</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance deflates. Hunk’s voice comes next.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>My best friend.. But I don’t think he’s always honest with himself.. Needs to put his trust in others..</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>What? Lance tries to think hard at Hunk in a questioning manner. What was he talking about? Pidge’s voice comes next.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Always messing around.. Getting into trouble..</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance can feel himself shutting down. They don’t believe in him, and it hurts</span>\n<em>\n<span>.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance tenses even further when he senses Keith. </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Lance.. Lance is- </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>He can’t take it. Lance snaps his eyes open, shattering the peaceful atmosphere. His heart is racing. He knew it would be like this, he </span>\n<em>\n<span>knew.</span>\n</em>\n<span> Shiro will always choose Keith over him in a mission. He can’t keep up with Hunk or Pidge. He has no place, no “thing”. He is just there, and the others know it just as much as him.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance’s breathing is ragged as he looks at the others. They are shaking their heads and groaning as if they had just been woken up from a deep sleep.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance, what happened? Why did you end the meditation?” Allura is looking at him questioningly.</span>\n</p>\n<p> </p>\n<p>\n<span>“I don't feel well. I’m sorry.”  He rasps.</span>\n</p>\n<p> </p>\n<p>\n<span>He moves to get up, but realizes his hand is still being held by Keith’s. His grip is strong, and Lance can feel the tips of his fingers start to tingle. Keith still looks unfocused and confused. Lance swallows and jerks his hand out of his grasp. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m sorry.” He says again before making his way out of the room. He can feel his breathing pick up, his heart is pounding in his ears. He is light years away from home, surrounded by people who don’t need him. What is he doing here? He is useless. He wants to go home. A choked noise escapes him, and he feels like a child again, just wanting his mom. How long has it been? With the amount of wormholes they’ve gone through, there is no way to tell how long he has been gone. His family could be long dead for all he knows. </span>\n</p>\n<p> </p>\n<p>\n<span>He stumbles into hangars. Blue purrs when she senses him, and wraps around his mind comfortingly. Tears begin to roll down his cheeks as he makes his way towards her, collapsing next to one of her paws. Despite her being made of metal, he feels comfortable and safe by her. She rumbles and continues to sooth his rampant mind. </span>\n</p>\n<p> </p>\n<p>\n<span>“That’s my girl.” Lance lets out a choked laugh. </span>\n</p>\n<p> </p>\n<p>\n<span>He must’ve fallen asleep, because he wakes up to someone aggressively tapping his forehead. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance.” </span>\n</p>\n<p> </p>\n<p>\n<span>Oh no. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance opens his eyes and is met by an angry looking Keith. </span>\n</p>\n<p> </p>\n<p>\n<span>“Keith, buddy, what’s up?” Lance asks, though his voice is so scratchy it makes him wince. He sits up and rubs the back of his neck. Man, falling asleep on a robotic cat does not feel too good. </span>\n</p>\n<p>\n<span>“What's wrong with you?” Keith asks, though it sounds more like a demand. Lance can see small droplets of sweat on his forehead, and wonders how long the team must’ve been looking for him. He hadn’t expected them to, and starts to feel shame swell within him. </span>\n</p>\n<p> </p>\n<p>\n<span>“Nothing! I said I didn’t feel well, and decided to check in on Blue.” He says defensively. </span>\n</p>\n<p> </p>\n<p>\n<span>Keith narrows his eyes, giving Lance the intense glare that he is familiar with. Though, having it directed solely at him is making something flutter in Lance’s chest. Damn his traitorous body. </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re lying. Something’s been off with you for days. You haven’t hit on Allura in so long that it’s worrying.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You’re worried about me?” The words come out of his mouth before he can stop them.</span>\n</p>\n<p> </p>\n<p>\n<span>Keith freezes and his eyes widen for a moment before they flicker off the the side. Lance can see his cheeks tinge pink. He wonders if his face is as warm and as soft as his hand was. </span>\n</p>\n<p> </p>\n<p>\n<span>“No. I mean- we all are I guess.” Keith makes it look like saying that is physically painful. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance wants to scoff and tell him he doesn’t need to baby him. He knows that they’re all probably just thinking that he is being a nuisance. An immature one, at that. But he is cut off by the sound of an alarm filling the castle. </span>\n</p>\n<p> </p>\n<p>\n<span>Keith holds out his hand. “C’mon, they need us.” </span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>They only need you, </span>\n</em>\n<span>he thinks. He doesn’t even think it bitterly.</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>The two of them jog towards the control room, splitting up to grab their armor from their rooms. These alarms are never a good sign. Lance changes into his signature blue armor. He checks himself in the mirror. Shiro was right, he does have dark bags under his eyes. His brown hair is a bit ruffled, and he smooths it down before sticking his helmet on. Lance looks down at his hands to see that they are shaking. How can he fight alongside his team if he isn’t really one of them? He’ll only get in the way. Lance grits his teeth and forces himself to stop trembling. He’s being pathetic. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance meets the rest of the crew in the control room. </span>\n</p>\n<p> </p>\n<p>\n<span>“There you are! What happened, man?” Hunk exclaims, looking worried. </span>\n</p>\n<p>\n<span>“Nothing, I just felt a little nauseous,” Lance pats his friend’s shoulder. “No big deal.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance notices Keith looking at him with a strange expression. He looks away right as Lance turns to him. Allura clears her throat and suddenly all eyes are on her. </span>\n</p>\n<p> </p>\n<p>\n<span>“There are Galra ships on a small planet nearby. We received their distress call.” She says, pressing a few buttons and bringing up an image of a blue, swirling planet. It looks like the Earth, if the ocean swallowed up the land. </span>\n</p>\n<p> </p>\n<p>\n<span>“There are only a few, and they are rather small ships, but they are causing damage to the peaceful people that live there,” Allura continues, looking increasingly angry. “We must assist them immediately.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You heard her,” Shiro directs. “Get to the hangars and get your lions.”</span>\n</p>\n<p> </p>\n<p>\n<span>The process of getting to his lion goes by in a blur, Lance’s nerves are making it impossible to focus. They don’t need him, why are they asking him to help? He should just stay here, out of the way.. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance registers Blue’s worry as soon as he sees her. He sends her mental reassurance, but it doesn’t seem to convince her. She opens her metallic jaws to let him in, and he runs his hand along the side of her. Blue is the only one who undoubtedly believes in Lance, and he will forever appreciate his big, beautiful girl for that. Even if he thinks, deep down, that there is someone out there who could pilot her better than him. </span>\n</p>\n<p> </p>\n<p>\n<span>Blue growls at him. Oops, thinking too loud. </span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>As soon as they arrive on the planet, Lance can clearly see the damage that the Galra have done. There are multiple white, adobe looking houses on fire. Aliens with light blue skin are running around in a panic. Lance and Shiro land and immediately move to assist. Blue puts out the fires with a careful ice breath. Lance hops out of her and looks around for something to do to help, even if he can’t fight well, he can help those in need. Lance looks up to see Hunk and Keith blasting at two Glara ships. They look strong and in sync. Lance can’t help but feel proud. </span>\n</p>\n<p> </p>\n<p>\n<span>A hand on his shoulder makes him jump. It’s Shiro, looking down at him.</span>\n</p>\n<p> </p>\n<p>\n<span>“These aliens are called the Nyx. They’re known for being advanced in medicine, and are very peaceful. We need to find their Chief.” Shiro says with a determined expression. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance nods. He can do this. He can help.  They are about to start on their search before a cry rips through the air. Lance and Shiro whip around to see a figure lying on the ground, not to far from them. Its one of the blue aliens, and Lance realizes with horror that their blood is the same color as a human’s, and it's everywhere. Without thinking, Lance runs over and crouches next to the alien. It has wide, black eyes and pointed ears. Lance spots the profusely bleeding wound on its side and puts his hand over it. The alien shrieks, but Lance doesn’t let go.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance!” Shiro is behind him.</span>\n</p>\n<p> </p>\n<p>\n<span>“It's fine, I’ve got it.” Lance’s voice is steadier than he expects it to be. A sticky hand grips Lance’s forearm. He looks down to see the alien is looking directly at him, and is holding his arm steady. Blood is seeping inbetween his fingers, in stark contrast against the pale blue skin of the creature. </span>\n</p>\n<p> </p>\n<p>\n<span>“They need to be moved.” Shiro says.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance agrees. He looks down at the alien, not knowing if they can even understand him and says, “I have to pick you up. It’s gonna hurt like hell but you need help, okay?” He slowly shifts his grip so that he can put his other arm under the alien. It seems to understand, and tenses up as if to brace itself. Lance manages to pick up the creature, it whimpers in response. Lance notes that this alien is about the size of his eleven year old brother, who he has carried many times. </span>\n</p>\n<p>\n<span>“Do you have any idea where your Chief may be?” Shiro asks the alien gently. They nod and point a shaky finger towards the largest building to their left. It is scorched and smoking. Lance can see Shiro wet his lips before nodding once. </span>\n</p>\n<p> </p>\n<p>\n<span>“Thats where we need to head. Lance, I’m going to run ahead, you meet me there.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro takes off towards the building and Lance follows, careful not to jostle the alien. The creature begins to nod off in his arms. Lance feels panic prickle within him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey- hey there, I need you to stay awake, okay?” Lance says. The alien flutters its eyes back open.</span>\n</p>\n<p> </p>\n<p>\n<span>“What’s your name?” Lance asks, picking up speed.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lea.” The alien croaks. Lance feels a sweep of relief.</span>\n</p>\n<p> </p>\n<p>\n<span>“Well, Lea, I’m pretty good company so you’re gonna wanna stay awake for this.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lea lets out a light purring sound that Lance realizes is a laugh. He can’t help but smile a bit himself. </span>\n</p>\n<p> </p>\n<p>\n<span>“I see, Blue Paladin.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Call me Lance.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance.” </span>\n</p>\n<p> </p>\n<p>\n<span>The walk to the building is farther than Lance had assumed, and he struggles to keep the bleeding alien in his arms conscious. He manages to get her tell him about her family and home. She has a twin brother, and they are both studying medicine, trying to create remedies that can be universal to all species. By the time Lance spots Shiro with a taller, older looking alien, Lance has already become quite attached to his little blue friend. Lea’s bleeding seems to have slowed, but she is growing worryingly cold. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance greets Shiro and the other, who he finds out to be the chief of this planet. He is the same light blue, but with wrinkles and many different kinds of jewelry. He graciously thanks Lance for helping Lea, telling him that she is a brilliant young student, before turning back to Shiro.</span>\n</p>\n<p> </p>\n<p>\n<span>“Black Paladin, please, if there is anything you can do to help we would be eternally grateful.”</span>\n</p>\n<p> </p>\n<p>\n<span>“What’s going on?” Lance asks. </span>\n</p>\n<p> </p>\n<p>\n<span>“They need a clean place to operate on the injured, but all of their hospitals have been destroyed. I’m trying to get ahold of Allura.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance looks up and sees the faint outline of the castle. He also notices that he can no longer see the other three lions, or the Galra. He hopes they’re safe. </span>\n</p>\n<p> </p>\n<p>\n<span>“Allura, yes. They need a safe place. A few ticks? Perfect, thank you.” Shiro takes his hand off the comm on his helmet. </span>\n</p>\n<p> </p>\n<p>\n<span>“The princess will be here soon, you’ll be able to use a room in the castle for the injured.” Shiro says to the chief. The Chief grasps his hand and thanks him repeatedly. </span>\n</p>\n<p> </p>\n<p>\n<span>“Guys?” Hunk’s voice comes through his helmet. </span>\n</p>\n<p> </p>\n<p>\n<span>“Hunk! You guys alright?” Lance asks, a tightness in his chest that he hadn’t been aware of loosens. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah! We took out the Galra ships, Keith did this really awesome thing with his- hey, wait where are you?” Hunk questions.</span>\n</p>\n<p> </p>\n<p>\n<span>“Uh, helping Shiro. There are a lot of injured aliens.” Which isn’t a lie.</span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, man.” Pidge’s voice comes through as well. “We’ll be there soon. I can see the castle descending too.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Alright, see you then.” Lance says. He waits to see if Keith will say anything, but comm is silent. He almost jokingly asks if Keith is tired from actually accomplishing something, but doesn’t. He doesn’t have the right to. </span>\n</p>\n<p> </p>\n<p>\n<span>The castle lands nearby, and Lance is quickly surrounded by blue bodies. Many bleeding, leaning on one another. A few are on devices that look like stretchers. Lance feels rage towards the Galra boil inside of him. A hand sweeps against the front of his helmet. He glances down at Lea, thankfully still awake in his arms. </span>\n</p>\n<p> </p>\n<p>\n<span>“I can hear your heart rate increase, Lance,” Lea whispers. “Do not fear for us, the Nyx are strong.”</span>\n</p>\n<p> </p>\n<p>\n<span>Lance wants to scream. Lea is so brave, she doesn’t deserve this. None of them do. He gives her a watery smile. He has nothing witty to say, no jokes either. Allura comes out of the castle, looking angry, horrified, and sad all at once. Shiro goes up to meet her. </span>\n</p>\n<p> </p>\n<p>\n<span>She greets the chief, “Please, come in, Coran has an entire floor prepared for you. </span>\n</p>\n<p> </p>\n<p>\n<span>The aliens slowly enter the castle. A couple of them bring a stretcher over to Lance, and he carefully lowers Lea onto it. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’ll come check on you later.” He gives her the best grin he can manage. She smiles back. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance lets his arms drop to his sides. He feels wrong, having complained about his life earlier. He had no idea. He could have it so much worse, he is so selfish. </span>\n</p>\n<p> </p>\n<p>\n<span>Three heavy impacts behind him shake him out of his head. The three lions lower their heads to the ground to let their pilots out. They all look dirty, but none of them appear to be damaged. Pidge, Hunk, and Keith all make their way over to Lance and the castle. </span>\n</p>\n<p> </p>\n<p>\n<span>“Hey, Lance! Man you should've seen it. Pidge was so fast, and then Keith-” Hunk cuts off as he gets closer to Lance. The other two stop as well. Hunk looks horrified, Pidge has their mouth hung open, looking equally terrified. Keith’s eyes are wide, color drained from his face. Lance is so confused, what’s wrong with him? Is there something in his teeth? </span>\n</p>\n<p> </p>\n<p>\n<span>“What happened?!” Keith is suddenly rushing him, and Lance’s instincts are telling him to </span>\n<em>\n<span>run.</span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>“What are you talking about?” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith is suddenly very close, but he looks nervous, eyes flitting all over Lance. That's when he realizes, </span>\n<em>\n<span>oh. </span>\n</em>\n<span> Lance has blood smeared all over him. His chest plate is covered, and there are dried droplets that had dripped down his torso and legs. He looks horrific. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh my god, are you hurt?!” Hunk cries. </span>\n</p>\n<p> </p>\n<p>\n<span>“No- no, this isn’t mine.” Lance can feel his composure breaking. </span>\n<em>\n<span>No</span>\n</em>\n<span> he is not going to break down in front of them. </span>\n</p>\n<p> </p>\n<p>\n<span>“Let's get to the castle.” Keith says, his voice more gentle than Lance has ever heard. He is still very close to Lance. He has an urge to reach out and grab his hand, anything to steady him. But he doesn’t. Keith would probably think he was going insane. </span>\n</p>\n<p> </p>\n<p>\n<span>They walk to the castle together, Keith never leaving Lance’s side. He is silently grateful, though he doesn’t know why Keith is being so attentive to him. Once inside, they all remove their helmets. The castle is hectic. Blue figures moving with purpose as they attend to the injured. Lance does his best to stay out of their way. Coran has provided them beds and operating tables, as well as holographic curtains to give each bed privacy. The aliens must have brought their medical equipment, because there are unfamiliar boxes next to each bed.</span>\n</p>\n<p> </p>\n<p>\n<span>Coran pulls Hunk off to the side to help him carry some things for the Nyx. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m going to go find Shiro.” Keith tells Lance.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance nods. He is still very, very confused by this new personality Keith has acquired. He gives Lance a final glance before jogging off to find their leader. This leaves Lance with Pidge. They are eyeing their surroundings, and Lance briefly wonders if they think in calculations and numbers, rather than actual thoughts.</span>\n</p>\n<p> </p>\n<p>\n<span>“Maybe we should ask if they need any help.” They offer. </span>\n</p>\n<p> </p>\n<p>\n<span>“Good idea.”  </span>\n</p>\n<p> </p>\n<p>\n<span>They head towards the beds, careful to stay out of the way of any rushing Nyx. Though thankful, most of them deny their help, they seem to have the injuries under control. Lance even spots Lea being helped by multiple Nyx. Apparently, the Nyx have anatomy somewhat similar to humans, and Lance finds this strangely endearing. Back home, people always thought that aliens were these tiny, green things that had nothing in common with humans. Man, were they wrong.</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge and Lance are about to give up, but then they notice one last curtain near the back of the room. Pidge shrugs and walks towards it. Lance wonders why no one is near this bed, maybe there’s no one even in it. This bed is fairly far from the others. He’s about to ask if they need help but his words are caught in his throat at the sight on the bed greets him. Pidge looks just as stunned. Before them is one of the Nyx, unconscious on the bed. Blood is covering its torso. Behind them, is a second Nyx, with their hand inside the injury of the other. Their other hand is squeezing a bag that is attached to the alien’s face. Lance has watched enough tv to guess that the bag is keeping the alien breathing. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you a doctor?” Pidge suddenly asks. The alien looks up, they look unfocused.</span>\n</p>\n<p> </p>\n<p>\n<span>“No,” They squeak. Lance can sense Pidge tense up next to him.</span>\n</p>\n<p> </p>\n<p>\n<span>“Where did the doctor go?” Pidge continues to question. </span>\n</p>\n<p> </p>\n<p>\n<span>“They ran away. He didn’t want to die.” The alien is visibly shaking. Lance’s eyes continue to be drawn to the hand inside of the other alien’s stomach. He doesn't understand. </span>\n</p>\n<p> </p>\n<p>\n<span>“They left,” The Nyx says again. “Before you came, the Galra were attacking on foot. They had weapons that shot explosives. They destroyed our homes.” The alien looks down at the body below them. </span>\n</p>\n<p> </p>\n<p>\n<span>“He was shot with one of them, but it didn't detonate. It’s still inside, my hand is on it, the surgeon told me if I move it may go off. I’m not a doctor, I’m just a student, I can’t do this.” The alien’s voice breaks, Lance can register the panic in their eyes. Lance feels something similar within him. There’s an unstable explosive in the middle of the castle, with dozens of innocents all around. Lance and Pidge slowly approach the frightened alien.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hey.. Lets calm down,” Lance says, he curses himself at how his voice shakes. “What’s your name?”  </span>\n</p>\n<p> </p>\n<p>\n<span>“Selsie,” The alien breathes. “I- I think I’m going to take my hand out.”</span>\n</p>\n<p> </p>\n<p>\n<span>Panic hits Lance full force. He can hear his heart in his ears. His body is buzzing as he carefully approaches Selsie, coming up behind her. Her entire body is shaking, and Lance holds his breath every time he sees her arm twitch.</span>\n</p>\n<p> </p>\n<p>\n<span>“This is a mistake, I’m not supposed to be here. I don’t want to die.” She whispers. Her eyes are wide and unseeing. </span>\n</p>\n<p> </p>\n<p>\n<span>“No one is going to die,” Lance says. His eyes shoot up to Pidge, who is standing still, clearly in shock. </span>\n</p>\n<p> </p>\n<p>\n<span>“Right , Pidge?” He tries to snap them out of it. </span>\n</p>\n<p> </p>\n<p>\n<span>They look to Lance with wide eyes and visibly swallow, before moving towards Selsie as well. </span>\n</p>\n<p> </p>\n<p>\n<span>“Yeah. Everything is going to be fine. Can you tell me what the object feels like?” Pidge asks. </span>\n</p>\n<p> </p>\n<p>\n<span>“It’s.. It's a cylinder, but the top is pointed.” Selsie says. Pidge’s eyes become calculating once again, before they darken. </span>\n</p>\n<p> </p>\n<p>\n<span>“Selsie, it is crucial that you do not take your hand out.” Pidge says, a dangerous tone in their voice. Lance furrows his brows at them, but they only give him a serious look. Lance can only guess that this must be </span>\n<em>\n<span>really</span>\n</em>\n<span> bad. </span>\n</p>\n<p> </p>\n<p>\n<span>“I can’t do this, I have to take it out.” Selsie whimpers, her breathing picking up.</span>\n</p>\n<p> </p>\n<p>\n<span>“No, no, come on you can do this. It’s going to be okay.” Lance struggles to comfort her. </span>\n</p>\n<p> </p>\n<p>\n<span>“We need to get Shiro.” Pidge says. </span>\n</p>\n<p> </p>\n<p>\n<span>“Go. Now.” Lance looks at them with desperation. Pidge gives him a curt nod before slowly backing away. Once out of sight, Lance can hear their footsteps as they start sprinting. </span>\n</p>\n<p> </p>\n<p>\n<span>“Selsie, look at me.” Lance puts his hand over her quivering one. He can feel blood seeping through the black gloves he’s wearing.</span>\n</p>\n<p> </p>\n<p>\n<span>“No, no, no,” She begins to hyperventilate. “I’m just a student this isn’t supposed to happen.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I know, I’m so sorry.” Lance’s brain feels empty as he racks it for something to say. Nothing comes up. He can feel her hand starting to move away from the injury and his thudding heart skips a beat. </span>\n</p>\n<p> </p>\n<p>\n<span>Somewhere in the back of his mind Lance hears footsteps, and he looks up to see Pidge, Shiro, and Keith coming around the curtain. Shiro takes one look at the scene in front of him and sets his mouth into a firm line. Keith’s eyes fly up and look into Lance’s directly, jaw clenched. Lance hopes he doesn’t look as terrified as he feels. Pidge is whispering to the two of them, most likely explaining what exactly is going on. But Lance can’t hear, his ears are ringing and he can’t stop focusing on Selsie’s hand under his as it shakes and how if she moves the wrong way they’re going to be toast and- </span>\n</p>\n<p> </p>\n<p>\n<span>“Selsie,” Shiro’s voice is calm and assertive. “It’s going to be okay. But I need you to not move your hand, okay? There are doctors on the way who are going to help.”</span>\n</p>\n<p> </p>\n<p>\n<span>“I can’t- I have to move I can’t do this.” </span>\n</p>\n<p> </p>\n<p>\n<span>“She’s panicking, we need to clear everyone out of here.” Lance hears Keith say. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m not leaving,” Lance looks up to meet Keith’s eyes. He looks desperate and angry but Lance doesn’t care. He steadies his hand over Selsie’s. Her breathing is erratic and wild. Lance starts murmuring encouragement to her, trying to calm her but her panic only seems to intensify. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance, please,” Keith’s strangled voice pierces through the ringing and he almost relents. But he can’t, Selsie is just scared and he knows that feeling. He isn’t going to leave and let her, or the unconscious alien under them die. Shiro is trying to talk to Selsie as well but she isn’t hearing anything either and everything is suddenly too loud. Lance thinks he hears even Pidge talking now. Their hands are out as if they’re trying to calm a wild animal. A strangled noise rips from Selsie and suddenly there is no hand under Lance’s. </span>\n</p>\n<p> </p>\n<p>\n<span>“Get down!” Shiro screams. </span>\n</p>\n<p> </p>\n<p>\n<span>Multiple bodies hit the floor. Lance’s body moves quicker than his brain and before he knows it his hand is surrounded by warmth. Out of the corner of his eye he sees Selsie running around the corner and out of sight. He looks down to see his hand inside of the body of the alien, feels his fingers delicately touch foreign cylinder inside of it. The ringing in his ears has stopped. All he can hear is his own breathing. He feels numb. After what feels like eons, three heads poke up from the other side of the operating bed. </span>\n</p>\n<p> </p>\n<p>\n<span>“Oh, Lance.” Shiro rasps.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance feels nothing but the warmth squeezing his hand. Keith looks sick.</span>\n</p>\n<p> </p>\n<p>\n<span>“What did I do?” Lance can barely hear his own voice. </span>\n</p>\n<p> </p>\n<p>\n<span>“Just stay right where you are.” Shiro whispers. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance, why?” Keith’s voice sounds pained. He looks like he wants to move towards him but is stopping himself. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance can’t think straight, only one thought repeating in his head.</span>\n</p>\n<p> </p>\n<p>\n<span>“What did I do?”</span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>“That wasn’t the smartest thing to do,” Shiro says.</span>\n</p>\n<p>\n<span>“Yeah, I think that might have been the stupidest thing you’ve ever done.” Keith hisses while he steps over to the front of the bed, grabbing the breathing bag and starting to squeeze rhythmically. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance bristles. “You know, yelling at someone who has their hand inside of a body with a bomb probably isn’t too smart either!”</span>\n</p>\n<p> </p>\n<p>\n<span>“Fair enough.” Shiro says, inspecting the injury that Lance’s hand is in. He turns to Pidge, “Go and tell Allura everything that's going on, and then get the Nyx to evacuate.”</span>\n</p>\n<p> </p>\n<p>\n<span>Pidge looks conflicted for a moment before sighing and turning to leave. </span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t die, Lance.” They quietly say before leaving. Lance feels his heart clench. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance focuses on the feeling of the explosive under his hand. It’s cold and Lance swears he can feel energy buzzing within it. Lance wonders if doing this was a mistake. Maybe it wouldn’t have gone off after Selsie took her hand off, Lance might’ve made it worse by doing this, but he hadn’t been thinking straight. Now he might get all of his friends killed. Dark, painful feelings claw their way up Lance’s body. </span>\n<em>\n<span>I’m such a fuck up</span>\n</em>\n<span>.</span>\n</p>\n<p> </p>\n<p>\n<span>“It was all I could do,” Lance whispers. He can see Keith falter for a moment, before returning to his rhythmic squeezes. “I just wanted to do something right for once.” </span>\n</p>\n<p> </p>\n<p>\n<span>“What the hell are you talking about?” Keith demands in the softest voice he can muster. </span>\n</p>\n<p> </p>\n<p>\n<span>“I’m- I’m not one of you.” Lance internally groans, he can feel all of his pent up issues heavy on his tongue. He wants to stop, he doesn’t have the right to complain. But if they’re all going to die here, he might as well get all this shit off his chest. “You all have a ‘thing’ and I’m nothing. I’m not smart or talented or a leader and I don’t even know why Blue chose me!” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith is looking at him with those stormy ocean eyes. They’re beautiful, Lance thinks, but then again he’s always thought that. </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance, you know that’s not true,” Shiro looks like he wants to put a hand on his shoulder, but thinks better of it. “You’re very important to us, we need you.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance laughs, and it sounds as bitter as he feels. “Right, that’s not what you all were thinking during that exercise today.” </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro frowns. “I was thinking that during the exercise, Lance. What did you hear?” </span>\n</p>\n<p> </p>\n<p>\n<span>“It doesn’t matter!” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith and Shiro both flinch, and Lance deflates. </span>\n</p>\n<p> </p>\n<p>\n<span>“You guys should leave. Let me deal with this. If something goes wrong you can find another person to pilot Blue.”</span>\n</p>\n<p> </p>\n<p>\n<span>“Don’t you dare.” Keith grits out. He looks furious. </span>\n</p>\n<p> </p>\n<p>\n<span>“Why would it matter?” Lance asks, “ I’m pretty sure you wouldn’t mind.” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith’s eyebrows furrow, and he looks away from Lance. Lance hopes he hasn’t gone too far with that one. But it’s true, Keith </span>\n<em>\n<span>is</span>\n</em>\n<span> always more annoyed with him than anyone else. </span>\n</p>\n<p> </p>\n<p>\n<span>“Did you hear me when we were meditating today?” Keith asks suddenly. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance thinks back, and he realizes that he hadn’t. He had quit before Keith’s thoughts had reached him. </span>\n</p>\n<p> </p>\n<p>\n<span>He shakes his head.</span>\n</p>\n<p> </p>\n<p>\n<span>“Do you want to know what I think?”</span>\n</p>\n<p> </p>\n<p>\n<span>Keith’s eyes look gentle yet determined, never leaving Lance’s. He takes Lance’s silence as confirmation. </span>\n</p>\n<p> </p>\n<p>\n<span>“I think you’re incredibly talented. The best sharpshooter we have. I’ve seen you make shots that would be impossible for anyone else.” Lance can see Keith’s face reddening, and knows his is doing the same. </span>\n</p>\n<p> </p>\n<p>\n<span>“But it’s not just that, you’re also what keeps us grounded. You make everyone laugh and make even the darkest situations lighter.” Keith’s face is slightly twisted, and if he wasn’t saying this directly to him, Lance would never have believed that Keith could say anything like this. Lance can feel warmth filling his entire being. </span>\n</p>\n<p> </p>\n<p>\n<span>“We need you, Lance. I need you.”</span>\n</p>\n<p> </p>\n<p>\n<span>That’s what breaks the dam. A disgusting noise escapes Lance and suddenly tears are streaming down his face. Keith looks mortified. </span>\n</p>\n<p> </p>\n<p>\n<span>“Shit, sorry! Was that wrong?” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance laughs, and wipes his face with his free hand. He feels lighter than he has in days, and if his hand wasn’t on an unstable explosive, he would want to run up and hug Keith. </span>\n</p>\n<p> </p>\n<p>\n<span>“No, no. Thanks, Mullet.” Lance smiles. </span>\n</p>\n<p> </p>\n<p>\n<span>Keith tries to look offended, but a smile creeps onto his face as well. Lance sees Shiro looking satisfied nearby, he had forgotten he was even there. </span>\n</p>\n<p> </p>\n<p>\n<span>“I seriously think something was up with that exercise, because I was thinking something similar.” Shiro says. </span>\n</p>\n<p> </p>\n<p>\n<span>“You guys really need me? All of you?” Lance asks, feeling open and vulnerable. </span>\n</p>\n<p> </p>\n<p>\n<span>“Of course.” </span>\n</p>\n<p> </p>\n<p>\n<span>Just then a group of three Nyx clad in white armor appear around the curtain, and Lance is reminded of the situation they’re still in.</span>\n</p>\n<p> </p>\n<p>\n<span>“Hello, paladins.” One of them greets. </span>\n</p>\n<p> </p>\n<p>\n<span>“Are you the doctors?” Shiro asks.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes, we specialize in injuries due to explosions, and are familiar with that type of weapon,” They gesture to where Lance is standing. “The castle is evacuated, and we are going to have to ask you to leave.” </span>\n</p>\n<p> </p>\n<p>\n<span>“No.” Keith growls. Lance frowns at him. </span>\n</p>\n<p> </p>\n<p>\n<span>“For the safety of your friend, as well as the patient, we must insist.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Keith, we should listen-” </span>\n</p>\n<p> </p>\n<p>\n<span>“No way,” Keith cuts off Shiro. “I’m not leaving.”</span>\n</p>\n<p> </p>\n<p>\n<span>“You have to,” Lance says. Keith shoots him a glare. “I can’t do this with you here. I’ll just be thinking about how if I fuck up you’re going to die. It’s hard to even focus now. Please.” </span>\n</p>\n<p> </p>\n<p>\n<span>Keith opens his mouth, but then shuts it. Lance can see his jaw flexing as he grits his teeth, and is filled with the desire to cup his face and run his thumbs along that jawline. Shiro grabs Keith by the arm and starts to lead them out. Just before they’re out of sight Keith says, “Don’t you die, McClain, or I swear I’ll kill you.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance watches them leave, and then exhales a shaky breath. The Nyx gather around him, inspecting the body. One of them holds up an object that looks like a tablet over where the explosive is, and then inspects the screen. Lance wonders if it’s something like an X-ray. </span>\n</p>\n<p> </p>\n<p>\n<span>“Blue Paladin.” One of them says.</span>\n</p>\n<p> </p>\n<p>\n<span>“Please, call me Lance.” He laughs shakily, “I think this situation allows for us to be on a first name basis.” </span>\n</p>\n<p> </p>\n<p>\n<span>“Lance,” The alien tries again. “I’m going to ask you to take the hand that you have inside of the patient, and wrap it around the device. Once you feel that you have a solid grip, you need to pull it out completely level.” </span>\n</p>\n<p> </p>\n<p>\n<span>“I can just do that?” Lance’s voice squeaks, and he clears his throat.</span>\n</p>\n<p> </p>\n<p>\n<span>“Yes, and the sooner it is done the better.” </span>\n</p>\n<p> </p>\n<p>\n<span>A second Nyx moves next to Lance, scalpel in hand. Lance eyes it warily.</span>\n</p>\n<p> </p>\n<p>\n<span>“I’m going to create a larger incision, and when I do the patient will begin to bleed again. To keep them alive, you will need to extract the device immediately.” The second alien says. </span>\n</p>\n<p> </p>\n<p>\n<span>“I- I got it.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You can do it Lance.” A familiar voice says.  </span>\n</p>\n<p> </p>\n<p>\n<span>“Shiro! What the hell?” Lance whispers harshly.</span>\n</p>\n<p> </p>\n<p>\n<span>Shiro comes into the room, nodding at the Nyx. They seem to not want to question the leader of Voltron, and say nothing. </span>\n</p>\n<p> </p>\n<p>\n<span>“I said I can’t do this with you here.” Lance says.</span>\n</p>\n<p> </p>\n<p>\n<span>“You were talking to Keith,” Shiro gives him a knowing look, and Lance flushes. “I don’t want you to be alone in this. And don’t worry, Keith is being held back by Allura, you don’t have to worry about him.” </span>\n</p>\n<p> </p>\n<p>\n<span>Lance’s head is spinning and he’s starting to feel nauseous. He can’t mess up. He </span>\n<em>\n<span>can’t</span>\n</em>\n<span> mess this up.</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance, you can do this.” Shiro’s voice sooths a few of his frayed nerves. Lance comes back into focus enough to accept that he very well may die here. His family will never see him again, he’ll never know if Keith’s face is as soft and warm as his hand was. He doesn’t want to die, there’s so much he wants to do. </span>\n</p>\n<p> </p>\n<p>\n<span>“You have to tell Keith his eyes are pretty.” Lance blurts out. </span>\n</p>\n<p> </p>\n<p>\n<span>Shiro gives him a questioning look before realization dawns on him. “Lance, don’t. You’re not going to-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Tell him that they remind me of the ocean. Also tell Hunk that he’s the best friend a guy could ask for, and that I know for a fact that Pidge is going to find their family. Tell Allura and Coran that they’re the coolest aliens I’ve ever met, no offense Nyx, and that-”</span>\n</p>\n<p> </p>\n<p>\n<span>“Lance.” Shiro’s eyes are dark and he’s closer than he had been a few moments ago. Lance’s breathing is shallow, and he swallows. </span>\n</p>\n<p> </p>\n<p>\n<span>“I don’t want to die.” </span>\n</p>\n<p> </p>\n<p>\n<span>“You won’t. Breathe, I’m right here with you.” </span>\n</p>\n<p> </p>\n<p>\n<span>The Nyx next to him starts to cut along the pale flesh next to Lance’s hand, and blood begins to pool. Lance takes a steadying breath and wraps his fingers around the foreign object under his hand. Once satisfied with his grip, he begins to pull back. Lance is aware that he’s stopped breathing. He frowns when he feels a tear slip down one of his cheeks. He pulls the object out agonizingly slow. It’s is black with purple engravings, it looks as sinister as it feels. The third Nyx comes up and offers both hands to Lance. He passes the explosive to the smaller being, and once it is out of his hand a violent tremor wracks his body. He looks up to meet Shiro’s eyes. </span>\n</p>\n<p> </p>\n<p>\n<span>“You did good.” He breathes.</span>\n</p>\n<p> </p>\n<p>\n<span>The Nyx slowly moves to walk away from the patient, who is being worked on by the two others. Lance watches the alien turn and walk past the curtain and out of sight. Shiro is talking to one of the Nyx doctors about the patient. Lance doesn’t know why, but his body moves to follow the alien carrying the explosive. He strides toward them, wanting to see where they go and where they take it before- </span>\n</p>\n<p><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>Nothing.</span>\n</p>\n<p><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>Nothing but a painful ringing in his ears. Lance’s head hurts, and he thinks he’s on the floor. He can see nothing but white. </span>\n</p>\n<p><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>His eyes open again and though it’s not white, everything is blurry. He hears voices, though they sound miles away. Someone is yelling, and he thinks someone else is crying. His vision is filled with black, green, pink, yellow, and red. The colors are comforting, and Lance wonders why. The color red suddenly takes up most of his sight, and Lance feels a hand brush something off of his forehead. It’s a warm hand. </span>\n</p>\n<p><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>Lance is in and out of consciousness as Coran checks out his wounds. There is nothing worrying, just several cuts and burns on his face and neck. Lance also apparently hit his head pretty hard on the floor. Hunk cries on his shoulder, Pidge holds his hand in their shaking one. Shiro is pale and always nearby. Lance feels his vision darken, and the last thing he feels is sadness because he can’t find Keith. </span>\n</p>\n<p><br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n<br>\n</p>\n<p>\n<span>Lance isn’t sad for long, because when he wakes Keith is the only one with him. He is helping Lance off of the bed, murmuring encouraging words that Lance is having a hard time registering. Keith leads him to what Lance recognizes as the ship showers. He’s aware how heavily he is leaning into Keith, but can’t find it in him to care. Keith doesn’t seem to mind too much either. </span>\n</p>\n<p> </p>\n<p>\n<span>Lance feels Keith taking off his armor, he hears each piece clatter on the floor. Keith stands back up to face him once Lance is only standing in his black bodysuit. He puts a hand to Lance’s forehead, most likely to feel for a fever, but Lance leans into it. He can hear Keith’s breath hitch. Lance is so happy that Keith is safe. </span>\n</p>\n<p>\n<span>The two of them get in one of the showers, Lance in his bodysuit, and Keith in his gray v-neck and black pants. Lance wants to laugh at how ridiculous they must look, but is cut off by warm water running over his face. Keith is next to him, holding him steady as he runs a washcloth over Lance’s face and neck. Lance looks down and sees dirt and blood running down the drain. The warm water soothes his tense muscles, and Keith’s attentiveness is making his heart swell. He turns his head to the side to look at the boy with wet, black hair pushed back from his forehead, and that familiar intense look in his eyes. Lance reaches out and curves his hand around Keith’s jaw. He tenses, but doesn’t move away. Lance is pleased to find that Keith </span>\n<em>\n<span>is</span>\n</em>\n<span> just as soft and warm as he had imagined. </span>\n</p>\n<p> </p>\n<p>\n<span>Keith’s cheeks are flushed red, which looks hilarious against the irritated face he’s trying to pull off. Lance begins to laugh, and Keith’s eyes widen before he begins to chuckle himself. Lance feels a hand snake around the back of his neck, and he’s rendered speechless. Keith is close, Lance is suddenly filled with a brand new urge. This one, impossible to resist.</span>\n</p>\n<p> </p>\n<p>\n<span>Lance closes the distance and presses his lips to Keith’s. Water is streaming down both of their faces. Keith gently puts his other hand against the side of Lance’s face, careful not to hurt him. Their lips slide against each other’s in a way that makes Lance’s stomach start doing backflips. Keith opens his mouth a bit wider and Lance runs his tongue along the inside of his bottom lip, causing Keith to groan. They break apart flushed and thoroughly soaked. </span>\n</p>\n<p> </p>\n<p>\n<span>***</span>\n</p>\n<p> </p>\n<p>\n<span>Lance later learns that the Nyx carrying the explosive had miraculously survived, thanks to the armor they were wearing, as well as the patient who had had the explosive inside of them. The castle had to stay for an extra day to be repaired, which gave Lance time to visit Lea, who was going to make a full recovery. She thanked Lance profusely for saving her life. On the day that they left, Shiro convinced Allura to try the trust exercise again. After Shiro explained to her what Lance had experienced, she told him that that type of meditation only allows you to hear what your mind already accepts. Lance had only heard the background noise of what the others were trying to say. </span>\n</p>\n<p> </p>\n<p>\n<span>So here they were, once again, in the circle of light. Keith squeezes Lance’s hand and he has to bite back a smile. They all close their eyes, and Lance feels himself being submerged once again. Nervousness creeps back into him, but he forces it down. His team needs him, he isn’t a seventh wheel. Lance let’s their thoughts flow through him.</span>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Number one sharpshooter</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>My best friend </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Never backs down from a challenge </span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>Can be an idiot, but he’s my idiot</span>\n</em>\n</p>\n<p> </p>\n<p>\n<em>\n<span>The true blue paladin </span>\n</em>\n</p>\n<p> </p>\n<p>\n<span>Lance can feel himself grinning so hard it hurts, and he realizes that he doesn’t need to feel so homesick. </span>\n</p>\n<p> </p>\n<p>\n<span>He has his own family right there with him. </span>\n</p>\n<p><br>\n</p>"
}