{
  "id": "9597686",
  "url": "https://archiveofourown.org/works/9597686?view_full_work=true",
  "author": [
    "AutumnHobbit"
  ],
  "title": "The D-Word",
  "rating": "General Audiences",
  "archive_warnings": [
    "Graphic Depictions Of Violence"
  ],
  "categories": [
    "Gen"
  ],
  "fandoms": [
    "Batman (Comics)",
    "Batman - All Media Types"
  ],
  "relationships": [
    "Bruce Wayne & Jason Todd"
  ],
  "characters": [
    "Jason Todd",
    "Bruce Wayne",
    "Tim Drake",
    "Alfred Pennyworth",
    "Dick Grayson",
    "Damian Wayne",
    "Roy Harper"
  ],
  "additional_tags": [
    "father-son feels",
    "Hurt/Comfort",
    "Emotional Hurt/Comfort",
    "Angst",
    "Fluff",
    "Humor",
    "Injury",
    "Canon-Typical Violence",
    "Bit-more-than-canon-typical language"
  ],
  "language": "English",
  "series": "",
  "published": "2017-02-06",
  "completed": null,
  "words": "5,627",
  "chapters": "1/1",
  "comments": "228",
  "kudos": "12,065",
  "bookmarks": "2,413",
  "hits": "96,800",
  "summary": "<p>thatsochangeablechick: like i know there’s this post going around of Jason calling Bruce ‘dad’ sarcastically and getting freaked about it, but i want you to consider<br>jason calls bruce ‘dad’ and b is visibly moved, gruff voice shaky, sheen of tears behind lenses and all that, as he tries to brush past it (bc if b made a big deal jay would flip his shit, for the discourse ™ )<br>so jason gets into the habit of dropping the d-word in there just to see what he can get away with, want a batmobile? take it. fleeing his siblings after irritating them? you do you jay chum.</p>\n<p>________</p>\n<p>\"See, Tim?\" Jason called over his shoulder sardonically. \"Dad agrees with me.\"</p>\n<p>He turned back to his food for a moment before the thought suddenly occurred to him that the Cave had gone near silent. He cautiously glanced back at the others. Alfred was still working away at stitching Tim up. Tim looked a little pale and sweaty, but he was glancing over at Jason with a look that was a mixture of concern and confusion. Bruce was standing stock-still, seemingly staring off into space.</p>",
  "notes": "<p>Idk. I'm in a cruddy mood today and this was done. Enjoy.</p>\n<p class=\"jump\">(See the end of the work for <a href=\"#work_endnotes\">more notes</a>.)</p>\n<p>I'm on tumblr: autumnhobbit.tumblr.com</p>",
  "text": "<p>The first time it happened was honestly an accident. Jason had decided to head back to the Cave instead of going straight to his apartment after patrol because Tim had gotten clipped in the upper arm during a shootout. It certainly wasn't fatal, and the idiot was still walking and grumbling about exactly how much he didn't need Jason's help--<em>\"I'm not thirteen, Jason, geez!\"</em>--but hey, maybe he felt guilty once in a while. Besides, he'd get nice points and he'd had a hankering for Alfred's scones.</p>\n<p>So, he carted Tim back to the Cave on the back of his motorcycle--where Dickie and the demon brat were and why Dick's big-brother senses were not tingling enough to have him to Tim before Jason could so much as look in his direction was a mystery. Regardless, when they pulled up to the Cave the only ones in sight were Alfred, always prepared with the post-patrol snack and the fully-equipped medical kit at the ready, and Bruce, who was typing away at the computer, as always.</p>\n<p>\"Well, here we are, Replacement.\" Jason kicked the stand on his bike, yanked his helmet off and dumped it on the floor, then scooped Tim up as the younger boy spluttered in surprise. \"And just to make sure you don't run off and hide in a closet or something...\" Jason deposited Tim in the waiting gurney next to Alfred. The butler was looking on with the hint of a smile playing around his general nonplussed expression. \"And I'll take that as my payment, thank you,\" Jason reached for the tray of scones on the nearby table. He stuck one in his mouth and pocketed five more.</p>\n<p>Tim squirmed on the cot and pulled his arms across his chest, and Jason almost choked on his scone. Pouting. The kid was <em>pouting</em>. That was adorable.</p>\n<p>\"What, you want one?\" Jason held a scone directly above Tim's face, and when Tim reached up to grab it he yanked it back out of reach.<br> Tim huffed. \"Jerk,\" he growled, laying back down and resuming his not-pout.</p>\n<p>\"Do stop tormenting Master Tim, Master Jason,\" Alfred said dryly, not looking up from the antiseptic he was preparing. \"And if you would like a bag for the scones, you could just ask. I made three dozen.\"</p>\n<p>\"Oh, fine,\" Jason groused. \"I can be nice.\" He snatched one of the scones from his pocket and held it in front of Tim's face again. \"Open wide,\" he said brightly. Tim glared at him, but opened his mouth, and Jason mock-delicately placed the scone between his teeth. \"Maybe some sugar'll make you less grouchy.\" Jason ruffled Tim's hair. \"Have fun getting stitches, Timmy.\" He turned and headed for the table, chuckling at Tim's angry, muffled (because of the scone), and indignant sounds from behind him. He yanked a chair over next to the table with his foot, dropping into it and munching at his pilfered scones happily. Damn, he'd missed Alfred's cooking.</p>\n<p>Tim hissed behind him, and Alfred made a tsking sound. \"Really, Master Tim, that's the seventh time in three months. You should try to be more cautious.\"</p>\n<p>\"Yeah, Replacement, quit being so reckless,\" Jason called absentmindedly.</p>\n<p>\"Screw you.\" Tim mumbled.</p>\n<p>\"I heard that,\" Jason replied cheerfully. More mumbled curses from Tim. Jason grinned. He couldn't remember the last time he'd had this much fun.</p>\n<p>\"Jason's right, Tim.\" Bruce suddenly decided to enter the conversation. He turned, crossing the short distance and standing next to the gurney. \"You don't have to take on the entire drug trade by yourself, you know.\"<br> There was a pause, and Jason could almost imagine Bruce leaning over and tilting Tim's chin up in one hand, practically oozing fatherly concern and affection. He tried not to gag.</p>\n<p>\"I know it's tough because Dick is with Damian, but don't hesitate to call me if you need backup. Or Jason or Cass or Steph, for that matter.\"</p>\n<p>\"See, Tim?\" Jason called over his shoulder sardonically. \"Dad agrees with me.\"</p>\n<p>He turned back to his food for a moment before the thought suddenly occurred to him that the Cave had gone near silent. He cautiously glanced back at the others. Alfred was still working away at stitching Tim up. Tim looked a little pale and sweaty, but he was glancing over at Jason with a look that was a mixture of concern and confusion. Bruce was standing stock-still, seemingly staring off into space. Jason leaned over a bit in his chair, concerned and about to shoot off another wisecrack--it was his default response to any situation, honestly--but then he suddenly realized that there was a sheen of <em>tears</em> in Bruce's eyes. And that in of itself was enough to startle him into paying more attention, because Bruce did <em>not</em> cry often, and he could count on one hand the number of times he'd seen him cry in-uniform, even without the cowl. Bruce was just...standing there, his mouth slightly open, like he was lost for words.</p>\n<p>Jason opened his mouth for a second, then closed it. He could feel his cheeks heating up--going directly to embarrassment in awkward situations was a trait of his he absolutely <em>hated</em>--and he was debating whether to ignore this whole debacle, slink away and hope no one would notice he'd left, or to say something. But just as he was about to open his mouth--who even knew what the hell he was about to say, he had no idea--Bruce did what he did best, and Jason could practically see the walls coming back up....though Bruce still looked shaken. \"Just...just be careful, Tim.\" He patted Tim's shoulder gently, and then turned away, walking past Jason with a bit of hesitation--and Jason felt relieved but also oddly bereft.</p>\n<p>He shook his head, appetite suddenly gone. He stared at the tabletop. He knew he had been wrong originally, for assuming that Bruce didn't give a shit when he'd died, but he'd never thought he'd react <em>that</em> strongly...</p>\n<p>It was weird. And scary. And kind of...<em>sad</em>.</p>\n<p>Jason shook his head again, scoffing quietly at himself. He tucked the remaining scones back into his pocket and called a distracted goodbye to the others, heading for his apartment and a night of restless sleep.</p>\n<p><br> ___</p>\n<p> </p>\n<p><em>\"Shit.\"</em> Jason pounded down the steps, bouncing off a wall as he dove around a corner at top speed. He threw a door out of his way, hurtled through a hallway, hearing his pursuers coming closer and closer. He barely restrained himself from kicking another door out of the way as he ducked as quickly as he could into the locker room, jumping into a locker he knew was empty.</p>\n<p>\"Damnit,\" he growled under his breath, trying desperately to squeeze his massive shoulders into the tiny space without giving away his position. He could hear pounding footsteps getting closer, could hear a chorus of angry shouts, and a shrill sound that sent a chill down his spine.</p>\n<p>\n<em>\"TODD!\"</em>\n</p>\n<p>\"Dami, please slow down,\" Dick was pleading. \"Maybe it wasn't Jason...\"</p>\n<p>\"DON'T YOU <em>DARE</em> DRAG ME INTO THIS, DICK,\" Tim yelled in exasperation. \"All I was doing was eating breakfast, and now I'm getting dragged all over the place on a witch hunt for Jason--who, by the way, probably flew the coop as soon as the deed was done and is probably in Kansas by now.\"</p>\n<p><em>Oh, Timmy, if only.</em> Jason closed his eyes. <em>Though, I suppose I deserve this. It was an okay second life, while it lasted.</em></p>\n<p>Jason was sure Damian had all sorts of non-Alfred-or-Bruce-approved plans for what to do to him when he was caught. The kid probably wanted to burn him at the stake, or draw and quarter him, or put him in an iron maiden or some such torture. The little nutjob probably had one of those things somewhere. Hell, he might even break out a crowbar or something--though Jason assumed that at least Dick and maybe the Replacement wouldn't go along with it.</p>\n<p>It was still totally worth it, though.</p>\n<p>Just as Jason was pretty close to being psyched up for his impending second death, the door opened and Jason found himself face-to-face with a sweats-clad Bruce Wayne, who blinked awkwardly at him. Jason blinked awkwardly right back.</p>\n<p>Bruce looked Jason up and down, taking in his crushed position in the locker, his street clothes, his doubtlessly wild expression, and Damian's murderous shrieks coming nearer and nearer. Bruce opened his mouth, and then seemed to think better of asking and closed it.</p>\n<p>\"I know I'm a naughty child and I deserve justice,\" Jason said, quietly but intensely. \"But please. I beg you. Mercy.\"</p>\n<p>Bruce raised an eyebrow. He glanced back over his shoulder as Damian called, \"Father! I request your permission to discipline Todd!\" He glanced back at Jason.</p>\n<p>Jason bit his tongue to hold back a groan. Desperately, he said, \"Dad, please.\"</p>\n<p>Bruce blinked in surprise and sudden emotion, and Jason started cursing up a firestorm in his mind and squirming nervously in the locker as he heard Damian and his impromptu-posse coming closer.</p>\n<p>Finally, Bruce took a single step back, opening the door a bit wider. Jason tripped over his own feet and nearly knocked both Bruce and the locker over as he staggered, running full out from the cabinet and disappearing from sight within a split second. Bruce stood, blinking in bemusement for a moment before gently closing the locker door and grabbing his towel. Within a few seconds, his other three sons were rounding the corner, Damian at the head. All three of them were 'armed'...Dick with a pool noodle, Tim half-heartedly with a flyswatter, and Damian with a baseball bat. Bruce nearly lost his balance when he saw that Damian's hair was dyed neon blue.</p>\n<p>\"Father,\" Damian demanded imperiously, dignity intact despite the circumstances. \"Have you seen Todd recently?\"</p>\n<p>Bruce blinked. \"...No.\" He finally said, and Damian huffed. Right at that instant, there was a roar of an engine from the main cave, and Damian whirled and charged off, Dick and Tim at his heels. \"Todd! Return at once and face purgation like a man!\"</p>\n<p>Bruce just shook his head.</p>\n<p>Jason, meanwhile, was on cloud nine, cackling as he zoomed through the Gotham streets. He'd gotten away with it. He had <em>actually</em> gotten away with it.</p>\n<p>A grinch-like grin spread slowly across his face.</p>\n<p>For posterity's sake, he needed to experiment with this scenario to the fullest extent possible.</p>\n<p>___</p>\n<p> </p>\n<p>\n<em>\"There is no way this is gonna work.\"</em>\n</p>\n<p>\"This is totally gonna work.\"</p>\n<p>\n<em>\"I have enough terrible father figures, ya know?\"</em>\n</p>\n<p>\"Just shut up.\"</p>\n<p>\n<em>\"I really don't need the effin Batman on my case, too...\"</em>\n</p>\n<p>\"Oh my...\" Jason facepalmed. \"Shut <em>up</em>, Roy!\"</p>\n<p>The redhead's voice was tinny over the phone, and Jason could even hear the idiot playing with that stupid arrowhead of his that he always fiddled with and cut his fingertips on. <em>\"Look, my life may suck, but that still doesn't mean I wanna throw it away. Dying just isn't my style. No offense,\"</em> he tacked on.</p>\n<p>\"None taken,\" Jason deadpanned, sighing as he turned the corner. \"And anyway, how would you get in trouble? You're not even here.\"</p>\n<p><em>\"He</em> knows,\" Roy said dramatically, and Jason rolled his eyes. \"You're insufferable.\"</p>\n<p>Roy laughed. <em>\"Yeah, and this was your idea, moron.\"</em></p>\n<p>\"Yes, it was,\" Jason sighed (again) as he stepped into the Cave. Bruce was typing away at the computer, same as always. \"Okay. I'm in the Cave. I'm going to try it out.\"</p>\n<p>\n<em>\"Copy that. Operation: Joyride is go. Repeat, it is go.\"</em>\n</p>\n<p>\"What the hell...\" Jason moaned. \"Nerd.\"</p>\n<p><em>\"Uh huh. Go on, Jaybird,\"</em> Roy said gleefully. <em>\"Get your family-together-ness on.\"</em></p>\n<p>\"Ugh.\" But Jason squared his shoulders and marched forward. He stepped up until he was only a few feet behind Bruce's seat. Bruce, who of course realized he was there almost immediately, didn't pause typing, but there was a hint of expectation in the air. Jason swallowed, took a deep breath, and spoke. \"Hey, B. S'up?\"</p>\n<p>Bruce didn't stop typing. \"What do you want, Jason?\"</p>\n<p>\"Hey!\" Jason said, only half-feigning hurt. \"I'm not <em>always</em> trying to screw you over, okay?\"</p>\n<p>No response, still typing. Jason fought the urge to spin on his heel and leave. He swallowed and sheepishly muttered, \"I...well...actually, I <em>was</em> kind of wondering...\"</p>\n<p>Bruce paused for a split second, then turned back and continued typing, correcting himself. \"What does <em>Arsenal</em> want?\"</p>\n<p>Jason gaped. <em>\"How</em>...you know what, I don't wanna know.\" He shook his head and held a hand to his mouth, almost beside himself. He forced himself to remove his hand and keep on. \"He's...well, see, he's thinking about doing a custom car sometime soon, and he wants to know what state of the art perfection looks like, soooo. I was wondering if maybe we could, ehhhhh, I dunno. Uh. Borrow the Batmobile?\" <em>Screw me</em> sideways, <em>what the hell was I thinking.</em></p>\n<p>Silence.</p>\n<p>\"Only for an hour or two. We could even do it at patrol time to avoid suspicion...\"</p>\n<p>A sigh. \"Jason...\"</p>\n<p>\"Pleaaaaaase?\" Jason was not above drama. Or emotional manipulation. He glanced down, traced the toe of his boot on the floor, allowed his voice to dip uncertainly. \"I...I never got the chance to drive it myself. Before, you know.\"</p>\n<p>Bruce's shoulders tensed right up instantly. Stifling a grin, Jason put the final nail in the metaphorical coffin. \"Please, Dad?\"</p>\n<p>Silence. Jason waited.</p>\n<p>He was almost startled at the sudden rattling of keys, and barely glanced up in time to catch them before they hit him in the face.</p>\n<p>\"No law-breaking or you'll wish I'd left you for Gordon.\" Bruce said gruffly, but Jason could hear the slight fondness under it that said he was bluffing. He was too busy being so giddy that he could barely contain himself to be truly offended. \"Thanks, B!\" He said, actually half-way meaning it as he turned and ran. He called Roy back as he went. \"Holy shiitake, it worked.\"</p>\n<p><em>\"Whaaaaaat.\"</em> Roy said over exaggeratedly.</p>\n<p>\"It did!\"</p>\n<p>Roy whistled. <em>\"Dude. Use these powers only for good. It's kinda scary what you can get away with.\"</em></p>\n<p>\"Mmm,\" Jason hummed noncommittally, thinking of the case--which he hated, but was still up---and of the photo of him and Bruce at a WE function that Bruce had in his wallet, of the picture of him poking around with the engine of one of the cars that Bruce had in a frame beside his bed. Sure, he'd been cooperating more nowadays, but that didn't seem like a motivation for Bruce to dig out all the old artifacts.</p>\n<p>Unless they'd been there all along.</p>\n<p>Shaking his head from all the sudden deep thoughts, he said, \"Steak n' Shake?\"</p>\n<p><em>\"Hell yes.\"</em> Roy said. <em>\"Nutella milkshake, here I fucking come. I'll be waiting.\"</em></p>\n<p>___</p>\n<p> </p>\n<p>The third time Jason woke up was when he started to realize he was cold.</p>\n<p>Of course, that made a fair amount of sense, since he was sprawled on cold concrete, his hands and feet duct-taped together and his arms thoroughly taped to his sides. He had just barely managed to get out of the tape enough to finagle his hand to put pressure on the still sluggishly bleeding stab wound in his chest, over the shred of the tape he'd managed to rip off to make a three-way seal to try and prevent his lung from collapsing. He figured it had worked so far, since he could still breathe and wasn't actively suffocating--his lung was hurting, but working. There was pain around the stab wound, too, and he remembered getting hit with a pipe a few times in between shots in the mad scramble to try and get out of this hellhole before it was too late. So much for that idea.</p>\n<p>He shivered, wishing they hadn't taken his jacket. It might not have been worth much once it was thoroughly blood-soaked, but he was fairly certain that anything would be better than this. His fingers had lost all feeling except throbbing pain, and his back was screaming at him for being pinned on one side, bent at an awkward angle for as long has he had been. Which...he actually had no idea how long he had been. He tried shifting...and nearly screamed when pain <em>sliced</em> through his leg, as if something was tearing. He stifled it down to a choked sound through his teeth, and craned his neck to look at his leg. His breath caught in his throat at the sight of a jagged edge of bone sticking out of his shin. There was a pool of blood on the floor around his leg--he couldn't feel the wetness or heat at all, all the heat must have leaked out into the air and his leg must have been pretty far gone.</p>\n<p>He gulped shakily, very slowly laying his head back down and trying not to hyperventilate. And also wishing the shivering would stop, because it was really starting to jar his ribs and his leg.</p>\n<p>Jason tried hard not to hope that Bruce would come. He actually had good reason to hope he would, this time...he'd directly disobeyed Bruce and gone out when a few members of Bane's gang had turned up in his territory. And he'd been on the line with Bruce when he was jumped. Before they drugged him and brought him here. He'd really rather not have the last thing Bruce ever said to him be a fucking lecture. Not that anything else was new.</p>\n<p>Turning his head very slightly, and cringing at the pain the motion brought, Jason glanced around. He was in a small room, probably a utility closet, goodness-knew-where. He might have been transported. He couldn't remember. He didn't see anything he could use to get out. In fact, he didn't see anything anyway because there was no light to see with.</p>\n<p>Normally he wasn't superstitious, but lying alone in the cold and the dark did weird things to him, and his skin prickled as if a hand were just inches from touching his back. He clenched his eyes shut and tried to measure his breathing, to remind himself that he was the one who made evil people feel this way. That sex traffickers and abusers and drug lords went to bed feeling like this, terrified that one day they'd wake up to him standing over their bed.</p>\n<p>But that was when he was Hood, and he had his guns and his health and what little mental stability he had left. Not when he was just Jason, who wasn't even twenty yet, who was more than a little scared of the dark and cold, and being alone. Not when his heart was beating dully like a drum, with a constant scream of <em>you're gonna die, you're gonna die, you're gonna die</em> building in his mind.</p>\n<p>Jason closed his eyes and cursed himself and thought of home. He thought of Bruce's face whenever he'd learned something new or helped Alfred with the chores, or when he got hurt, or when he was scared or angry or sad. He thought of how he'd flippantly thrown the d-word around just to see Bruce squirm.</p>\n<p>But mostly he thought about how he'd actually meant it. How it was true. How, if he was honest with himself--and there was no reason not to be, other than it hurt--it had always been true.</p>\n<p>And about how he threw it all away. And how he spat in Bruce's face, time and time again.</p>\n<p>It'd be typical if that was how he died again, wouldn't it? Spitting in the face of one of the first people who truly loved him, and not even telling him he loved him back. And not because he'd been denied the chance. Because he'd had the chance, time and fucking time again. But he was too stubborn, too proud, and too weak to admit it.</p>\n<p>He wasn't sure when he'd started crying, but once he did, he couldn't stop. The sobbing hurt, his lung started burning warningly again, and the tears itched and were bitter cold on his frigid face, but he cried and cried until he could barely breathe.</p>\n<p>He wanted to go home. He wanted his dad.</p>\n<p>Jason exhausted himself pretty badly with all the crying. That, the lack of food or water, the blood loss and the cold were what finally did him in, and he slipped into semi-consciousness before he'd really stopped crying. He drifted for a long while, occasionally coming around to the still-empty storage room and the numbness of his whole body except for the dull throbbing of his heart. He usually slipped back under fairly quickly after that.</p>\n<p>He wasn't sure what eventually roused him, but he blinked his crusty eyelashes open and sluggishly glanced towards the door. He heard a muffled bang, and a distant crash. There was a crack of light coming from under the door, faint, but there. Curious, Jason tilted his head, barely having the energy to do more than that. He heard a screamed curse, a crunch of a fist colliding with flesh, a crack of a body being slammed viciously against metal.</p>\n<p>He should have put two and two together far sooner. <em>Dad.</em></p>\n<p>Suddenly feeling urgent, and irrationally <em>terrified</em> of being left behind, Jason slowly rolled onto his stomach. His body flared dully with pain, but he struggled faintly against the tape, which loosened a bit, worn from his constant struggle and exposure. He managed to get his arms beneath him and began to slowly, painstakingly drag himself across the floor towards the door. But he realized his mistake when he felt his leg pulsing, and his energy seemed to ebb away before he'd gone more than three feet. His vision started darkening at the edges, and he slumped back down, cheek pressed against the frigid concrete as he slowly passed out again.</p>\n<p>He didn't think he'd wake up again after that, but he stirred with a hoarse groan when he was moved, gently rolled onto his back. His lashes opened to slits without his permission.</p>\n<p>Bruce was there, his fingers pressed against Jason's throat, as Jason realized belatedly. His face was hard, his jaw clenched. Jason almost felt like he could hear Bruce's jaw creaking as the man carefully pulled him into his lap and kept examining him. Though in hindsight, maybe it was his own jaw he was hearing. He stifled a whimper when Bruce lightly fingered the edges of the wound in his leg.</p>\n<p>\"Damnit, Jay,\" Bruce whispered tightly, taking in the compound fracture, and probably the trail of blood Jason had left when he tried to get to the door. \"What the hell were you--\"</p>\n<p>\"Didn't,\" Jason slurred thickly. He swallowed, closed his eyes to avoid meeting Bruce's. His tongue felt awkward and swollen. \"Didn' wanna b'left behind.\"</p>\n<p>Jason heard the shaky inhale above him. \"Jay,\" Bruce sighed, like he was hopeless. Jason blinked back tears again, but felt them trickling down his face, anyway.</p>\n<p>\"Jay?\" Suddenly, Bruce sounded afraid. More afraid, Jason corrected himself. He heard a scuffle of leather, and then there was a warm hand cradling his cheek, Bruce's thumb brushing the tears from beneath his eyes with barely contained frenzy. \"What is it?\"</p>\n<p>Jason choked a broken sob. \"M'sorry,\" he whimpered.</p>\n<p>Bruce's hand stilled for a shocked second. Jason sobbed harder, gasping a bit at the pain that stabbed him at the movement.</p>\n<p>\"Shhh, Jay.\" Bruce's hand was stroking back his bangs, now. The tension was dialed back, giving way to reassurance. \"It's alright.\"</p>\n<p>Jason kept his eyes shut and pressed his lips together as he swallowed, nodding frantically.</p>\n<p>Bruce checked his pulse again, his fingers deft and sure on Jason's neck before moving away, and Jason tried not to tense up when he wrapped something firmly around his leg to hold it steady and stem the bleeding. He probed the stab wound gently, pressed a bandage onto it, and Jason gritted his teeth. He felt Bruce lean closer, slide a hand beneath the back of his head. \"Jason.\"</p>\n<p>Jason blinked open his eyes, taking in Bruce's blurry shape above him. He'd flipped his lenses back, so his eyes were showing. The earnestness in his gaze made Jason blink a bit more, try to focus. \"Jay. I need to move you. I'm going to try not to hurt you. But I have to get you out of here and warmed up. I need you to stay awake. You understand?\"</p>\n<p>Jason pursed his lips, nodded faintly. Bruce nodded once, as if in agreement, then carefully slid his hand down a bit and cupped Jason's back, easing him into a sitting position. Jason's head spun, and he drew deep breaths to try and keep from passing out again. Bruce leaned Jason up against his chest and then kept an arm curled around Jason's back as he slid his other arm underneath Jason's knees. Then he slowly stood, and Jason let his head rest on Bruce's shoulder, his forehead pressed into the hollow of his neck.</p>\n<p>Bruce grunted a bit, hefting Jason up gently as he went. \"You're heavier than I--\" he cut off with a choke.</p>\n<p>Jason blinked his eyes open, glancing up in concern, before realizing. Oh. <em>Hell</em>. The last time Bruce had carried him was right after he'd died.</p>\n<p>Aaaand he had no fucking clue how to make <em>that</em> better. Probably no way he could, really. Bruce was always so damn guilty over everything. How was Jason supposed to talk him out of feeling guilty for something he was convinced was his fault?</p>\n<p>Jason was already tired, and the rocking motion from Bruce walking out of the factory was putting him to sleep even more than the relief. He glanced around sluggishly and blinked in shock at the sight of the floor littered with the unconscious bodies of his captors, some of them with compound fractures of their own. Bruce didn't pause once, just kept striding towards the door.</p>\n<p>Jason's arms were trembling from hunger and cold, but he forced himself to lift them, wrap them around Bruce's neck so he was holding on. He squeezed once, as tight as he could manage, before he laid his head back down and drifted again.</p>\n<p>___</p>\n<p> </p>\n<p>Jason stayed asleep for a long time. So what, fight him. He was finally warm, so he was gonna enjoy unconscious bliss for as long as possible. Sure, there was the occasional irritation of being manhandled, the hands tucking him beneath heavy things, removing clothing, the occasional pinch of a needle, mumbled curses and other things he couldn't really hear. He ignored it for the most part.</p>\n<p>At least until someone gently shook his shoulder. \"Jason.\"</p>\n<p>With a groan, Jason forced his eyes open, and flinched at how it stung. It wasn't really that bright in the room--in fact, it was dimmed fairly well--but his eyes still burned. Bruce was there, minus the cowl but still in his suit. \"Jason, I have to set your leg. And,\" Bruce swallowed. \"Your blood pressure's too low for me to give you much of anything.\"</p>\n<p>Well. That wouldn't be pleasant. Jason swallowed dryly, tried to square his chin and nod certainly. He didn't think he quite managed it, but Bruce nodded, gave a quick, comforting stroke to his hair before moving off. Jason closed his eyes and made sure his tongue was out of the way of his teeth and waited, trying to breathe slowly and smoothly.</p>\n<p>He felt Bruce very lightly touching the bone, and his vision started swimming. He gritted his teeth and closed his eyes tightly, breathing harshly. But when Bruce started moving the bone, he couldn't breathe. He just lay there, gulping for air that wouldn't come, hands balled into shaking fists, his whole body rigid and seizing. By the time the bone clicked back into place, Jason had already passed out again.</p>\n<p>He woke up again to Bruce calling his name and he was still crying when he opened his eyes. What little he could see of Bruce through the tears looked so angry that Jason started and drew back a little. He lifted his arm, which was tingling with pins and needles as blood returned to it, and scrubbed at his eyes, clearing the tears away as best he could.</p>\n<p>Bruce's jaw was ticking, his brows drawn together, and his entire expression looking generally like he wanted to beat someone into the dirt as he fiddled with an IV bag that was connected to Jason's wrist. Jason was more than a little scared by that; he always had been scared of Bruce, in a way, and always grateful that his ire wasn't often directed towards him. But now, he just felt both guilty and scared.</p>\n<p>He'd made Bruce angry. And why shouldn't he be? Jason had only disobeyed him for the billionth time, which resulted in all this mess and his need to be rescued. And now he didn't even have the ability to run away and lick his wounds, because his leg would take weeks if not months to heal. He hated being such a sap, but he started silently crying again. He couldn't stop, and he wanted to so badly, and he hated it. He couldn't stifle a choked sniffle.</p>\n<p>And Bruce instantly appeared seemingly out of nowhere. \"Jason?\" He didn't sound angry, but the furrow between his brows was still there.</p>\n<p>Jason cried harder. \"I--I'm sorry, Dad,\" he finally gasped out.</p>\n<p>Bruce looked startled, his eyes widening and his gaze quickly scanning Jason, likely checking all his injuries. When he looked back at Jason's face, and he was still crying, his expression softened.</p>\n<p>\"For what?\" He asked softly, not looking away from Jason's tear-filled green eyes.</p>\n<p>\"For...for <em>everything</em>,\" Jason sobbed, \"but...b-but for letting you down. Again.\" He closed his eyes tightly and turned his head on the pillow, unwilling to look at Bruce.</p>\n<p>\"Oh, Jay,\" Bruce said, and his voice sounded wet, too. Jason felt the mattress dip as Bruce sat down, felt him brushing his bangs back from his forehead, and then felt a chaste kiss being pressed there. \"I'm not mad at you. Well...\" Bruce sounded a mix of amused and sorrowful, \"I <em>am</em>, but not as much as I am at the people who hurt you. And,\" his voice dipped tremulously, \"and at myself.\"</p>\n<p>At that, Jason's lashes flew open, and he glanced back at Bruce in shock. \"B-but...\" he stammered. \"It-it was my fault! I blew you off again, that's the only reason I got caught.\"</p>\n<p>Bruce shook his head. \"No, Jay. I should have dealt with those men before you had to. And I should have known better than to tell you without an immediate plan to deal with them together. And--\" his voice broke. \"--I should have gotten to you sooner. I already lost you once, and if you...if you...if this happened <em>again</em> because of me...\" He swallowed hard, a sheen of tears over his grey eyes as he kept stroking Jason's head, looking at him like he was irreplacable. \"I don't want to lose you again, Jay.\"</p>\n<p>Jason whimpered quietly. \"I...I don't want to lose you, either.\"</p>\n<p>Bruce sighed shakily. \"And I always make you think I'm seconds from throwing you out. Don't I?\"</p>\n<p>Jason's heart was in his throat, but he nodded.</p>\n<p>Bruce closed his eyes, pinched the bridge of his nose. \"Damnit.\" He muttered brokenly. \"Jay, I--\" he glanced back up. \"You're my son. As long as you want to stay here, you can. I don't hate you because you make mistakes.\" Bruce leaned over and laid his hand on top of Jason's head, his eyes boring into Jason's. \"I just don't want those mistakes to cost me you. Because it's not worth it, Jay. The job is not. Worth. You. Do you understand?\"</p>\n<p>Jason nodded, throat too tight to speak. Bruce leaned down and pressed their foreheads together for a moment. Jason was still sniffling, but Bruce didn't seem to mind. When Bruce finally pulled back, he smoothed Jason's hair back again and smiled down at him, which Jason returned faintly.</p>\n<p>Bruce glanced away at one of the monitors set up in the room--Jason realized he was in the Cave's medical bay, which was conspicuously empty. \"Wher's Alfie?\" He slurred dazedly.</p>\n<p>\"Running logistics for the other boys. They're still out on patrol,\" Bruce said over his shoulder. \"They've been asking after you, so I kept them apprised.\"</p>\n<p>Jason nodded mutely, feeling a curious warmth in his chest as he fingered the loose sheet and thought about the other boys worrying about him.</p>\n<p>Bruce glanced back at Jason. \"Your blood pressure's held steady for long enough that I can give you some pain meds. Do you want them?\"</p>\n<p>Jason hesitated. He generally didn't like taking anything that would keep him from waking up immediately if he needed to--but his leg was screaming at him, so he nodded silently, not meeting Bruce's eyes. Bruce got up with a sigh and retrieved a syringe from one of the bins, loading it with painkiller and carefully injecting it into Jason's IV tube. Within moments, the pain had faded to barely a whisper and Jason's eyelids were drooping. He barely heard Bruce throwing away the syringe and pulling a chair up at his bedside again, but he felt Bruce taking one of his limp hands and holding it between both his own.</p>\n<p>\"Night, Dad,\" Jason mumbled through numb lips, and he barely heard Bruce say, \"Night, Jay,\" in response before he was fast asleep.</p>\n<p> </p>"
}